{"quest":{"name":"Way of the Botanist","location":"Gridania","id":65539,"patch":2.0,"sort":10,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000294,"target":1000815,"genre":145,"journal":["Leonceault wishes you to reaffirm your desire to join the Botanists' Guild.","You have been referred to Fufucha, the master of the Botanists' Guild. Seek her out and impress upon her your desire to learn.","Having welcomed you into the guild, Fufucha presents you with a weathered hatchet to help you on your way. Take up the tool of your new trade, and speak with her again to be assigned your first task as a botanist."],"objectives":["Speak with Fufucha."],"dialogue":[{"name":"LEONCEAULT","text":"Ready to enroll in the Botanists' Guild, I take it?"},{"name":"LEONCEAULT","text":"Not yet certain you wish to join us? I understand."},{"name":"LEONCEAULT","text":"Our doors are ever open to those who would learn of the forest and the trees. Take all the time you need to decide."},{"name":"LEONCEAULT","text":"Music to my ears! It will be my pleasure to refer you to Guildmaster Fufucha."},{"name":"LEONCEAULT","text":"Our guildmaster's knowledge of nature is second to none. One need only witness her uncanny knack for spotting the finest timber to see that hers is a truly gods-given talent. It is for this reason that she holds the title of first botanist. Oh, but you need not be overawed, for she is the kindliest of souls!"},{"name":"LEONCEAULT","text":"You will find the guildmaster just outside this building. Seek her out and impress upon her your desire to become a botanist."},{"name":"FUFUCHA","text":"I'm Fufucha, the master of this guild. Pleased to make your acquaintance."},{"name":"FUFUCHA","text":"I take it Leonceault has given you an overview of botany already? Well then, I suppose I had better continue where he left off."},{"name":"FUFUCHA","text":"All Gridanians may rightly claim to share a close relationship with nature, but none is so intimate as that of the botanist. It is our calling to nurture the natural environment to the mutual benefit of man and wood."},{"name":"FUFUCHA","text":"But even as nature holds us in her loving embrace, providing for our every need, she is at heart an unsentimental creature. One that will take life just as readily as she gives it."},{"name":"FUFUCHA","text":"Being a botanist means coming face-to-face with this uncomfortable truth on a regular basis. Knowing this, do you still wish to walk our path?"},{"name":"Q1","text":"Walk the path of the botanist?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"FUFUCHA","text":"I see... That is a shame, yet ours is not a path to be walked with but half one's heart."},{"name":"FUFUCHA","text":"Mayhap you will one day feel compelled to dedicate your life to botany. It has been the way with many a weary warrior before you. Till that day comes, I wish you well in all your endeavors."},{"name":"FUFUCHA","text":"The look in your eye bespeaks the passion in your heart. Very well, I bid you welcome to the Botanists' Guild."},{"name":"FUFUCHA","text":"To help you on your way, I present you with this hatchet. Take it up, and then present yourself to me again."},{"name":"FUFUCHA","text":"I would assign you your first task as a botanist of the guild."}],"reward":{"items":[{"id":2545}],"xp":100},"reqs":{"quests":[65729]},"next":[65744]},"partials":[{"type":"npc","id":"1000294","obj":{"i":1000294,"n":"Leonceault","l":53,"q":2,"t":"Guild Receptionist"}},{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"2545","obj":{"i":2545,"n":"Weathered Hatchet","l":1,"c":38103,"t":30,"p":69}},{"type":"quest","id":"65729","obj":{"i":65729,"n":"So You Want to Be a Botanist","g":0,"l":"Old Gridania","s":0,"f":1}},{"type":"quest","id":"65744","obj":{"i":65744,"n":"My First Hatchet","g":145,"l":"Gridania","s":11,"f":1}}]}