{"quest":{"name":"Dressed to Harvest","location":"Gridania","id":65543,"patch":2.0,"sort":200,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000292,"genre":145,"usedItems":[5599],"journal":["Fufucha appears to be concerned with your appearance.","In order to grow as a botanist, you must be mindful that the tools you use are appropriate to your level of proficiency. To this end, Fufucha tells you about materia─a special kind of crystal that can be used to enhance gear. The enhancement process once required certain catalysts found throughout nature, and though they are no longer in use, Fufucha believes that gathering them would provide you with a suitable challenge. Take yourself to Aleport in western La Noscea, and there obtain fifteen fragments of grade 1 carbonized matter. Once you have collected enough, present the fragments to Sandre at the Botanists' Guild.","You listen with interest as Sandre explains that materia is extracted from old equipment and attached to still-useful gear, thereby enhancing its properties. The carbonized matter you have gathered is a type of catalyst that was once essential to the attachment process. If you would learn more about materia, Sandre recommends you visit the goblin Mutamix, who has his camp at the Bonfire in central Thanalan.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 25."],"objectives":["Deliver fragments of grade 1 carbonized matter to Sandre."],"dialogue":[{"name":"FUFUCHA","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>, <span class=\"highlight\">Forename</span>. I see from the soil on your hands that you have been as diligent as ever in your botany. I am not surprised. As we develop new skills, so do our labors become more varied, and thus does our motivation grow."},{"name":"FUFUCHA","text":"Yet know that motivation can only take one so far. If you wish to master botany, you must pay heed to those details which you have until now taken for granted."},{"name":"FUFUCHA","text":"In particular, I speak of gear─the tools of our trade. Not all tools are created equal, you see, and if you are to work with any degree of efficiency, you must use such gear as befits your ability."},{"name":"FUFUCHA","text":"Lest you misunderstand, I am not telling you to go and replace your gear. There is a more frugal way to improve your tools─and one more respectful to nature besides."},{"name":"FUFUCHA","text":"Tell me, have you heard of materia? It is a kind of crystal that can be used to enhance the efficacy of gear. In the past, the enhancement process required certain catalysts found throughout nature, the gathering of which was our domain, but new methods have rendered them obsolete."},{"name":"FUFUCHA","text":"Be that as it may, these substances still make for ideal subjects of training for budding botanists such as yourself. Therefore, for your next task, I would like you to gather a quantity of one such catalyst, namely grade 1 carbonized matter. Fifteen fragments should suffice."},{"name":"FUFUCHA","text":"A thorough search of the area surrounding Aleport will surely prove fruitful. The hamlet lies in western La Noscea, upon the island of Vylbrand. Once you have gathered the requisite amount, pray present the carbonized matter to Sandre. He will teach you the basics of materia."},{"name":"SANDRE","text":"Fufucha sent you to learn about materia, you say? Very well, bring me fifteen fragments of grade 1 carbonized matter, and we'll talk."},{"name":"SANDRE","text":"It seems Fufucha has high hopes for you. Very well, let us speak of materia."},{"name":"SANDRE","text":"The art of crafting with materia is yet new to Eorzea. It was borne to our shores by a goblin scholar named Mutamix some few years ago."},{"name":"SANDRE","text":"Put simply, the process begins with extracting materia from old gear. This is then attached to another piece of gear, enhancing the item's properties."},{"name":"SANDRE","text":"Mind you, it's not as if any half-wit can do the attaching. No, it takes a skilled craftsman with the necessary knowledge and experience."},{"name":"SANDRE","text":"And once, the process also required substances known as catalysts. The carbonized matter you've gathered is one such substance."},{"name":"SANDRE","text":"But then they discovered a way to attach materia without the stuff, and we botanists are a little more idle for it. Such is the way of progress."},{"name":"SANDRE","text":"And that, my friend, is materia in brief. Now, I'd thank you not to ask me about the workings of it─that sort of scholarly stuff is beyond my fathoming. If you wish to know more─perhaps even try your hand at crafting with materia─I suggest you seek out the goblin Mutamix. It's said he has his camp at a place called the Bonfire, out in the wilds of central Thanalan."},{"name":"SANDRE","text":"Oh, and keep in mind that materia comes in a great many varieties, each granting unique benefits to the gear it's attached to. I daresay you'll lose count of all the kinds you come across on your adventures."},{"name":"SANDRE","text":"If I were you, I'd try to find a craftsman who'd be willing to attach materia for me. Chances are there's such a person among your list of acquaintances."}],"reward":{"gil":470,"items":[{"id":2549},{"id":2700,"one":1},{"id":3341,"one":1},{"id":3561,"one":1},{"id":3790,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":18}],"quests":[65542]},"next":[65544]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000292","obj":{"i":1000292,"n":"Sandre","l":53,"q":2}},{"type":"item","id":"2549","obj":{"i":2549,"n":"Initiate's Hatchet","l":19,"c":38102,"t":30,"p":765}},{"type":"item","id":"2700","obj":{"i":2700,"n":"Cotton Coif of Gathering","l":19,"c":41530,"t":34,"p":524}},{"type":"item","id":"3341","obj":{"i":3341,"n":"Initiate's Slops","l":20,"c":45010,"t":36,"p":540}},{"type":"item","id":"3561","obj":{"i":3561,"n":"Cotton Work Gloves","l":20,"c":44036,"t":37,"p":630}},{"type":"item","id":"3790","obj":{"i":3790,"n":"Padded Leather Duckbills of Gathering","l":19,"c":46112,"t":38,"p":532}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5599","obj":{"i":5599,"n":"Grade 1 Carbonized Matter","l":15,"c":20406,"t":60}},{"type":"quest","id":"65542","obj":{"i":65542,"n":"Haste Makes Waste","g":145,"l":"Gridania","s":150,"f":1}},{"type":"quest","id":"65544","obj":{"i":65544,"n":"Aromatic Aspirations","g":145,"l":"Gridania","s":250,"f":1}}]}