{"quest":{"name":"Sap for Smiles","location":"Gridania","id":65540,"patch":2.0,"sort":50,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000295,"genre":145,"usedItems":[5498],"journal":["Fufucha wants to assign you a new task.","Fufucha has asked you to harvest ten pots of maple sap, which you must deliver to Cicely of the Botanists' Guild. Take yourself to Treespeak, where the sap can be found.","Cicely explains that the maple sap you collected will be used to make sweets for the many children orphaned by the Calamity. Upon hearing this, you cannot help but feel a sense of pride that your newly acquired skills have served such a good cause. Keep your nose to the grindstone, and ever more resources will be yours to gather.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 10."],"objectives":["Deliver pots of maple sap to Cicely."],"dialogue":[{"name":"FUFUCHA","text":"Hello again, <span class=\"highlight\">Forename</span>. I'm told you've been putting your hatchet to good use. Well done!"},{"name":"FUFUCHA","text":"Yet, as I mentioned before, hacking away at trees does not make you a botanist. You must also strive to deepen your understanding of nature."},{"name":"FUFUCHA","text":"I say this in the knowledge that you have done just that. Whether you realize it or not, you have the air of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who is at ease with the world around <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. I do believe you are ready for your next task."},{"name":"FUFUCHA","text":"I would like you to go to Treespeak, and there harvest ten pots' worth of maple sap. Once you have enough, pray deliver the sap to Cicely. She will be pleased to receive it."},{"name":"FUFUCHA","text":"Off you go now, <span class=\"highlight\">Forename</span>."},{"name":"CICELY","text":"On a quest for maple sap? Then your best bet is to search in the vicinity of Treespeak. I happen to be waiting for a delivery of sap myself. Might you be the botanist tasked with supplying it?"},{"name":"CICELY","text":"Ah, the maple sap I requested! Then you must be the new botanist Fufucha has been fussing over. Ah, but where are my manners? Thank you!"},{"name":"CICELY","text":"Hm? Why do I need so much of the stuff? Well, allow me to explain─it's the very least I can do, after all you've done."},{"name":"CICELY","text":"Boiling maple sap causes it to thicken into a sweet syrup called─aye, you've guessed it─maple syrup."},{"name":"CICELY","text":"From maple syrup we can make maple sugar, an ingredient used in various recipes, particularly confectionery─from cakes and tarts to toffees and chocolates. In short, all the things that children love."},{"name":"CICELY","text":"You've probably guessed it by now, but the maple sap you harvested will be used to make sweets for the children─those poor souls who were orphaned by the Calamity."},{"name":"CICELY","text":"They may put on a brave face, but their eyes reveal the depths of their sorrow. There's precious little joy left in their lives."},{"name":"CICELY","text":"But Gridania hasn't─<span class=\"emphasis\">won't</span> abandon them. No matter your walk of life, there is always something you can do to help. Though it may only last a fleeting moment, a single smile of theirs is worth all the effort."},{"name":"CICELY","text":"...M-My apologies. I got carried away. Now, where was I? Ah, yes."},{"name":"CICELY","text":"In addition to maple sap, we botanists gather various other kinds of foodstuffs. As such, we work quite closely with culinarians, those Disciples of the Hand who excel at cooking. We're also on good terms with woodworkers and weavers, as both are reliant upon us to supply the lumber and fiber they need for their respective crafts."},{"name":"CICELY","text":"As botanists, it behooves us to learn what manner of materials are used in crafting, and there's no better way to do so than firsthand. If you have an interest, you might consider dabbling in one of the disciplines out there."},{"name":"CICELY","text":"I also urge you to make a habit of reviewing the gathering log. As your knowledge of botany grows, more of its contents will become comprehensible to you."},{"name":"CICELY","text":"Well, I'd best see to the maple sap. It was lovely talking to you!"},{"name":"SYSTEM","text":"For every fifth level you reach as a botanist, you will gain the ability to detect higher-level mature trees and lush vegetation. When this occurs, any new items that are available through gathering will be added to your <span class=\"highlight\">gathering log</span>."},{"name":"SYSTEM","text":"You can use the <span class=\"highlight\">Arbor Call</span> botanist action to help you locate the nearest mature tree or lush vegetation within your skill range."}],"reward":{"gil":194,"items":[{"id":2546},{"id":3310,"one":1},{"id":3532,"one":1},{"num":2,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":18}],"quests":[65744]},"next":[65541]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000295","obj":{"i":1000295,"n":"Cicely","l":53,"q":2}},{"type":"item","id":"2546","obj":{"i":2546,"n":"Bronze Hatchet","l":8,"c":38101,"t":30,"p":257}},{"type":"item","id":"3310","obj":{"i":3310,"n":"Leather Culottes","l":5,"c":45127,"t":36,"p":135}},{"type":"item","id":"3532","obj":{"i":3532,"n":"Hempen Work Gloves","l":6,"c":44022,"t":37,"p":145}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"5498","obj":{"i":5498,"n":"Maple Sap","l":1,"c":22642,"t":54,"p":3}},{"type":"quest","id":"65744","obj":{"i":65744,"n":"My First Hatchet","g":145,"l":"Gridania","s":11,"f":1}},{"type":"quest","id":"65541","obj":{"i":65541,"n":"Weapons of a Feather","g":145,"l":"Gridania","s":100,"f":1}}]}