{"quest":{"name":"A Feast to Say the Least","location":"Gridania","id":65546,"patch":2.0,"sort":350,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000815,"involved":[1000774],"genre":145,"usedItems":[4839],"journal":["Fufucha is in need of an adventurer's helping hand.","The culinarian Yannie, an old friend of Fufucha's, is preparing a victory feast for the brave men and women of the Gods' Quiver, but lacks for a key ingredient. Harvest twenty laurel leaves from the lush vegetation northeast of Little Ala Mhigo in southern Thanalan, and bring them back to Fufucha for inspection.","Fufucha has assured you that the laurel leaves you harvested pass muster. Deliver them to Yannie at the Greatloam Growery, that she may resume preparations for the feast.","While expressing gratitude for your assistance, Yannie laments that with no end to the war in sight, she will be calling on the botanists' aid again. Report back to Fufucha with the news.","Grateful for your efforts on behalf of her friend, Fufucha's heart nevertheless weighs heavy. She longs for the day when Gridanians and Ixal may live in peace with the forest, and with each other.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 40."],"objectives":["Present handfuls of laurel leaves to Fufucha.","Deliver the laurel leaves to Yannie.","Report to Fufucha."],"dialogue":[{"name":"FUFUCHA","text":"Ah, <span class=\"highlight\">Forename</span>. You couldn't have come at a better time. A dear old friend of mine has found herself in a predicament, and is in dire need of a botanist's aid."},{"name":"FUFUCHA","text":"Normally, I would not trouble you with a request of such a personal nature. This task, however, should serve you nicely in your training."},{"name":"FUFUCHA","text":"A contingent of the Gods' Quiver has just returned victorious from a hard-fought battle with the Ixal, and my culinarian friend Yannie has been tasked with overseeing a feast befitting the occasion. Unfortunately, she is suffering an untimely shortage of a key ingredient."},{"name":"FUFUCHA","text":"I would ask you to harvest twenty laurel leaves, which can be found amidst the lush vegetation to the northeast of Little Ala Mhigo in southern Thanalan, then bring them to me for inspection."},{"name":"FUFUCHA","text":"I would ask you to harvest twenty laurel leaves, which can be found amidst the lush vegetation to the northeast of Little Ala Mhigo in southern Thanalan, then bring them to me for inspection."},{"name":"FUFUCHA","text":"Let me see here... Nineteen, twenty...and nary a withered leaf among the lot! Yannie will be pleased as peas."},{"name":"FUFUCHA","text":"Speaking of which, <span class=\"highlight\">Forename</span>, do you know why laurel is so prized by culinarians across the realm?"},{"name":"FUFUCHA","text":"Not only does it boast a most pleasant aroma─deep yet not overpowering, the perfect accent to a savory stew or seasoning for a steak─but it is also known to stimulate the appetite."},{"name":"FUFUCHA","text":"The brave men and women of the Gods' Quiver feast now, but it is only a matter of time before they are summoned back to the field of battle."},{"name":"FUFUCHA","text":"Deliver the laurel to Yannie, that she might prepare a feast that will warm their hearts as well as sate their stomachs."},{"name":"YANNIE","text":"Greetings, friend. Are you perchance the botanist to whom Fufucha entrusted my order for laurel?"},{"name":"YANNIE","text":"Well, I can see why Fufucha is always singing your praises. These will be among the crispest, most aromatic laurel leaves ever to grace my spice rack."},{"name":"YANNIE","text":"Ixali raiding parties grow more relentless with each passing day. I fear that the day will soon come when we can no longer afford to feast our men as heartily as we do today."},{"name":"YANNIE","text":"Still, Gridania's finest require sustenance as much as they need their lances and bows."},{"name":"YANNIE","text":"I am but a simple culinarian, but I would do what I can to support my countrymen. And yet there is only so much I can accomplish on my own."},{"name":"YANNIE","text":"In any event, I am grateful for your aid. Pass along my thanks to Fufucha, and let her know that I shall be calling upon your services again."},{"name":"FUFUCHA","text":"I hear Yannie was overjoyed with your delivery. Thanks to you, she'll be able to prepare a feast befitting the triumphant occasion."},{"name":"FUFUCHA","text":"And yet, truth be told, I take no pleasure in martial victories. Every day that we continue to water the soil with blood, I fear we lose something of what we once were."},{"name":"FUFUCHA","text":"There was a time when Gridanian and Ixal alike lived in harmony with nature, and with each other. Is there no other way to resolve our differences than with lance and arrow?"},{"name":"FUFUCHA","text":"Forgive me, <span class=\"highlight\">Forename</span>. I do not mean to burden you with my troubles."}],"reward":{"items":[{"id":2553},{"id":3129,"one":1},{"id":2778,"one":1},{"id":3613,"one":1},{"id":3843,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":18}],"quests":[65545]},"next":[65547]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000774","obj":{"i":1000774,"n":"Yannie","l":53,"q":2}},{"type":"item","id":"2553","obj":{"i":2553,"n":"Plumed Steel Hatchet","l":34,"c":38106,"t":30,"p":3786}},{"type":"item","id":"3129","obj":{"i":3129,"n":"Apprentice's Doublet","l":36,"c":42006,"t":35,"p":4410}},{"type":"item","id":"2778","obj":{"i":2778,"n":"Angler's Hat","l":35,"c":41124,"t":34,"p":2721}},{"type":"item","id":"3613","obj":{"i":3613,"n":"Fingerless Boarskin Gloves of Gathering","l":35,"c":44101,"t":37,"p":3024}},{"type":"item","id":"3843","obj":{"i":3843,"n":"Boarskin Crakows of Gathering","l":35,"c":46217,"t":38,"p":2764}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4839","obj":{"i":4839,"n":"Laurel","l":35,"c":25009,"t":45}},{"type":"quest","id":"65545","obj":{"i":65545,"n":"What Nature Giveth","g":145,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"65547","obj":{"i":65547,"n":"Crisis of Faith","g":145,"l":"Gridania","s":400,"f":1}}]}