{"quest":{"name":"What Nature Giveth","location":"Gridania","id":65545,"patch":2.0,"sort":300,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000815,"involved":[1000129],"genre":145,"usedItems":[4813],"journal":["Fufucha appears to be in some distress.","Much to Fufucha's dismay, the guild's crop of alligator pears has been devastated by vermin, and, to make matters worse, she has just received a sizable order for said fruit from the Carline Canopy. All hope is not lost, however, for the pears are known to grow in the wilderness. Solyeux at Bentbranch Meadows should be able to point you in their general direction.","According to Solyeux, wild alligator pears grow in an area northeast of Quarrymill. Harvest fifteen fruits and deliver them to Fufucha.","Thanks to your tireless efforts, Miounne will be able to offer her new salad as planned. Though you have saved the day, Fufucha reminds you that nature is capricious, and that her bounty cannot be taken for granted. Keeping these words close to heart, you continue your journey along the path of the botanist.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 35."],"objectives":["Speak to Solyeux at Bentbranch Meadows.","Deliver alligator pears to Fufucha."],"dialogue":[{"name":"FUFUCHA","text":"I fear we have a situation on our hands, <span class=\"highlight\">Forename</span>. The guild's crop of alligator pears has been ravaged by vermin─and scarcely a day before the fruit was due to be picked."},{"name":"FUFUCHA","text":"It is disheartening to see our labors come to naught, but such is the way of nature."},{"name":"FUFUCHA","text":"Alas, our woes do not end there. In a fine example of ill timing, no sooner had the disaster come to light than we received an <span class=\"emphasis\">unusually</span> large order for, yes, alligator pears from the Carline Canopy."},{"name":"FUFUCHA","text":"Yet all hope is not lost, for the fruit also grows in the wild. We need but find enough to fulfill the order─fifteen, to be precise."},{"name":"FUFUCHA","text":"Our man Solyeux is charged with keeping track of such produce as may be harvested in the Twelveswood. He spends most of his days around Bentbranch Meadows at this time of year."},{"name":"FUFUCHA","text":"If there are alligator pears out there, he will know where to find them. Pray seek him out, <span class=\"highlight\">Forename</span>, and do as he directs."},{"name":"SOLYEUX","text":"Looking for alligator pears? Aye, I heard the unfortunate tidings. Yet all we can do is take it on the chin and cope as best we can."},{"name":"SOLYEUX","text":"I recommend you search northeast of Quarrymill. Wild alligator pears grow there, and were doing well when I last passed through. Barring pests, they should be ripe for picking right about now."},{"name":"SOLYEUX","text":"Oh, and just so you know, the place you're going is no different from any other untamed corner of the Twelveswood─by which I mean it's full of nasties. Botanists like myself avoid the area if we can help it, but it should be as a walk through a flower garden for an adventurer like you."},{"name":"SOLYEUX","text":"Now, you had best be on your way. Those alligator pears aren't going to pick themselves."},{"name":"SOLYEUX","text":"Like I said, your best bet is to search northeast of Quarrymill. Give the undergrowth thereabouts a good rummage, and you'll find the alligator pears."},{"name":"FUFUCHA","text":"I trust you now know where alligator pears are found in nature. Please hurry, <span class=\"highlight\">Forename</span>. It would not do to keep our client waiting."},{"name":"FUFUCHA","text":"Fifteen alligator pears, and just in the nick of time! You have spared us Miounne's wrath."},{"name":"FUFUCHA","text":"Lest you misunderstand, Miounne is a reasonable woman...ordinarily. It is just that much rests upon the fruit's availability. Alligator pears are to form the centerpiece of a new dish of hers, you see, a hearty salad which she has been promoting feverishly to adventurers far and wide."},{"name":"FUFUCHA","text":"Miounne would <span class=\"emphasis\">not</span> have been best pleased had her plans gone awry. But owing to your efforts, she can keep her promise, and we our good reputation. My profoundest thanks, <span class=\"highlight\">Forename</span>."},{"name":"FUFUCHA","text":"I trust you have learned a valuable lesson from this episode. Namely, that we must not take nature's bounty for granted."},{"name":"FUFUCHA","text":"As I taught you when first you came to us, nature is an unsentimental creature. She may provide for our every need today, only to take it all away on the morrow."},{"name":"FUFUCHA","text":"Those who would walk the path of botany must come to terms with this fact, and the sooner the better. For should your labors prove fruitless─and they frequently shall─no amount of brooding will avail you."},{"name":"FUFUCHA","text":"At such times, one must remember that for all her seeming cruelty, nature is not our enemy. She simply <span class=\"emphasis\">is</span>. If you would become intimate with her and partake of her bounty, you must learn to accept her unconditionally."}],"reward":{"gil":639,"items":[{"id":2552},{"id":2758,"one":1},{"id":3369,"one":1},{"id":3601,"one":1},{"id":3829,"one":1},{"num":3,"id":5825,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":18}],"quests":[65544]},"next":[65546]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000129","obj":{"i":1000129,"n":"Solyeux","l":54,"q":1}},{"type":"item","id":"2552","obj":{"i":2552,"n":"Steel Hatchet","l":31,"c":38102,"t":30,"p":3256}},{"type":"item","id":"2758","obj":{"i":2758,"n":"Steel Goggles","l":31,"c":40902,"t":34,"p":2539}},{"type":"item","id":"3369","obj":{"i":3369,"n":"Toadskin Culottes","l":30,"c":45281,"t":36,"p":2403}},{"type":"item","id":"3601","obj":{"i":3601,"n":"Velveteen Work Gloves","l":30,"c":44160,"t":37,"p":2242}},{"type":"item","id":"3829","obj":{"i":3829,"n":"Toadskin Workboots","l":30,"c":46146,"t":38,"p":2563}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4813","obj":{"i":4813,"n":"Alligator Pear","l":30,"c":25313,"t":45}},{"type":"quest","id":"65544","obj":{"i":65544,"n":"Aromatic Aspirations","g":145,"l":"Gridania","s":250,"f":1}},{"type":"quest","id":"65546","obj":{"i":65546,"n":"A Feast to Say the Least","g":145,"l":"Gridania","s":350,"f":1}}]}