{"quest":{"name":"Crisis of Faith","location":"Gridania","id":65547,"patch":2.0,"sort":400,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000815,"involved":[1000775],"genre":145,"usedItems":[4792],"journal":["Fufucha wears a pensive mien.","Fufucha has tasked you with procuring zucchini to fill an order from her culinarian friend Yannie. Zucchini grow in abundance south of the Raincatcher Gully docks in eastern La Noscea. Harvest twenty and present them to Fufucha for inspection.","Fufucha is curious as to why Yannie requires such large quantities of zucchini, yet bids you to deliver your harvest with her blessing.","Having cooked up a delectable ratatouille with your zucchini, Yannie bids you deliver a serving to Fufucha.","Fufucha savors every bite of the ratatouille, which Yannie painstakingly recreated from Fufucha's mother's recipe. Recalling her childhood and the days when the forest was at peace, Fufucha grows yet more pensive about the current state of affairs.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 45."],"objectives":["Present ramhorn zucchini to Fufucha.","Deliver the ramhorn zucchini to Yannie.","Deliver a serving of Yannie's ratatouille to Fufucha."],"dialogue":[{"name":"FUFUCHA","text":"Oh, good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>, <span class=\"highlight\">Forename</span>. Forgive me if I seem a bit pensive. If you must know, the thought that our harvests are contributing to the war effort has been weighing heavily on my heart."},{"name":"FUFUCHA","text":"What I truly wish is to be an agent of peace...but what can a humble botanist do? In the meanwhile, another order has come in from Yannie─this time for zucchini, in large quantities."},{"name":"FUFUCHA","text":"No, I am afraid our homegrown harvest simply will not suffice. Fortunately, they are said to grow wild and in abundance in the La Noscea region."},{"name":"FUFUCHA","text":"I would ask you to travel to eastern La Noscea, and harvest twenty of the finest zucchini you can find from the area south of Raincatcher Gully. When you are through, bring them here to me."},{"name":"FUFUCHA","text":"I would ask you to travel to eastern La Noscea, and harvest twenty of the finest zucchini you can find from the area south of Raincatcher Gully. When you are through, bring them here to me."},{"name":"FUFUCHA","text":"What resplendent zucchini! I had no idea such succulent specimens could be found in the wild─truly a testament to the splendor of nature, is it not?"},{"name":"FUFUCHA","text":"The zucchini plant is quite sensitive to humidity. One would never see them grow so large and luscious here in the Twelveswood. Furthermore, they are quick to ripen and quicker to rot, meaning that timing is of the essence."},{"name":"FUFUCHA","text":"And yet a perfectly ripe zucchini is truly a thing of beauty. Sweet enough to be savored raw, its skin retains a pleasantly firm texture even when stewed."},{"name":"FUFUCHA","text":"I suppose Yannie means to prepare a wholesome and hearty feast for our soldiers. &lt;sigh&gt; I know. I should take pride in serving our nation this way. But I have troubled you enough. Take your harvest to Yannie with my blessing."},{"name":"YANNIE","text":"Fufucha assured me my twenty zucchini were on their way. Might you be the one who took the order?"},{"name":"YANNIE","text":"Why, what remarkable zucchini! I've not seen the likes of these in quite some time. At the risk of sounding boastful, I daresay that my next batch of ratatouille is shaping up to be the tastiest Gridania has ever seen!"},{"name":"YANNIE","text":"Ratatouille is a dish that holds a special place in my heart. It was the first recipe I learned, you see, taught to me by none other than Fufucha's own mother."},{"name":"YANNIE","text":"My father was a traveling merchant, and our family moved often when I was young. I had few friends until we moved here to Gridania, where I befriended Fufucha."},{"name":"YANNIE","text":"Hours would I spend by her side as she rooted through her garden. After sunset, we would go inside, where her mother would whip up a ratatouille that truly warmed both body and soul. Ah, to relive those days... Wait a minute! I have an idea!"},{"name":"YANNIE","text":"This is the ratatouille that inspired me to pursue the culinarian's path from such a young age. Do take a bowl to Fufucha─it seems she could use something to pick up her spirits these days."},{"name":"FUFUCHA","text":"I thank you for delivering the zucchini to Yannie. &lt;sigh&gt; I suppose she is already slaving over a hot stove, preparing a stew that will give our warriors the stamina to fight yet another─ What's that? Yannie has something for me?"},{"name":"FUFUCHA","text":"Why, this... This is my mother's ratatouille! I always knew that Yannie loved this recipe, but I had no idea she had learned to reproduce it to such succulent perfection!"},{"name":"FUFUCHA","text":"Ah, this brings me back to the old days! Yes, things were so much simpler then... Now, the ratatouille that once warmed our hearts after hours spent frolicking in the garden serves to light a fire in the bellies of those who march off to war. Will things never again be as they were?"}],"reward":{"items":[{"id":2567},{"id":2819,"one":1},{"id":3410,"one":1},{"id":3627,"one":1},{"id":3853,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":18}],"quests":[65546]},"next":[65548]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000775","obj":{"i":1000775,"n":"Yannie","l":53,"q":1}},{"type":"item","id":"2567","obj":{"i":2567,"n":"Apprentice's Scythe","l":40,"c":38155,"t":31}},{"type":"item","id":"2819","obj":{"i":2819,"n":"Mythril Mesail","l":42,"c":40411,"t":34}},{"type":"item","id":"3410","obj":{"i":3410,"n":"Woolen Sarouel of Gathering","l":40,"c":45180,"t":36,"p":3240}},{"type":"item","id":"3627","obj":{"i":3627,"n":"Fingerless Peisteskin Gloves of Gathering","l":40,"c":44102,"t":37,"p":3780}},{"type":"item","id":"3853","obj":{"i":3853,"n":"Peisteskin Crakows of Gathering","l":40,"c":46218,"t":38,"p":3456}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4792","obj":{"i":4792,"n":"Ramhorn Zucchini","l":37,"c":25212,"t":45}},{"type":"quest","id":"65546","obj":{"i":65546,"n":"A Feast to Say the Least","g":145,"l":"Gridania","s":350,"f":1}},{"type":"quest","id":"65548","obj":{"i":65548,"n":"Botanist in a Bind","g":145,"l":"Gridania","s":450,"f":1}}]}