{"quest":{"name":"Aromatic Aspirations","location":"Gridania","id":65544,"patch":2.0,"sort":250,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000292,"genre":145,"usedItems":[5542],"journal":["Fufucha has a mind to assign you a large order.","As Gridania continues along the path to recovery, so too does trade flourish with her neighbors. Her premise thus established, Fufucha tells you that an order has arrived from Ul'dah for no fewer than two thousand sprigs of chamomile. The herb is known to grow around Oakwood in upper La Noscea. Harvest fifteen sprigs by way of your contribution to the group effort, and deliver them to Sandre.","You deliver the chamomile to Sandre, who is bemused by the notion that Ul'dahns could have any appreciation for the herb. Trade may flourish between nations, but it would seem that old prejudices die hard.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 30."],"objectives":["Deliver sprigs of chamomile to Sandre."],"dialogue":[{"name":"FUFUCHA","text":"As Gridania continues to make headway along the road to recovery, ever more outsiders shall flock to her gates."},{"name":"FUFUCHA","text":"They come here in hopes of trading, and Gridania must welcome them if she is to forge stronger bonds with her neighbors and prosper. Make no mistake, <span class=\"highlight\">Forename</span>, busy times lie ahead."},{"name":"FUFUCHA","text":"Verily, we have just now received an order for no fewer than two <span class=\"emphasis\">thousand</span> fine-quality sprigs of chamomile from the Quicksand in Ul'dah. So run along and harvest them, would you?<br>...I jest, of course! A task of this scale will require more than two hands. If you would be so good as to procure, say, fifteen sprigs, I would consider it an appropriate contribution."},{"name":"FUFUCHA","text":"Chamomile is well known for its fragrant aroma and soothing properties. There is satisfaction to be had in ensuring that folk from every corner of the realm can sample the delights of this great staple, do you not agree?"},{"name":"FUFUCHA","text":"The herb is abundant in upper La Noscea, around Oakwood to be precise. Once you have harvested fifteen sprigs, pray deliver them to Sandre."},{"name":"SANDRE","text":"So Fufucha has you harvesting chamomile as well, does she? Return here when you have fifteen sprigs, and I'll add them to the pile. While you harvest, I shall ponder how in the seven hells I'm supposed to ship them all..."},{"name":"SANDRE","text":"...thirteen, fourteen, fifteen! Aye, precisely fifteen sprigs of chamomile. My thanks, friend."},{"name":"SANDRE","text":"&lt;sniff&gt; Ahhh, that distinct aroma! There's nothing like chamomile tea to calm the nerves. It's the perfect way to end the day, I reckon."},{"name":"SANDRE","text":"Now all I have to do is wait for your fellow harvesters to bring the rest, pack the lot, and drag it all to the airship landing... &lt;sigh&gt; I expect I will have earned a cup or two of tea when that's done─though I rather suspect it will be the very <span class=\"emphasis\">last</span> thing I fancy."},{"name":"SANDRE","text":"I don't know if Fufucha mentioned, but this batch is bound for Ul'dah. It would seem the lords and ladies there have developed a taste for chamomile tea."},{"name":"SANDRE","text":"Developed a taste, I said, but like as not they drink it just to impress their neighbors. Wouldn't surprise me one bit if each cup was served on a golden saucer."},{"name":"SANDRE","text":"Ack, but there I go again spouting my old prejudices. It's a bad Gridanian habit, I know. Sooner or later, I'll have to get rid of it. Don't want a visiting Ul'dahn to splash hot tea in my face now, do I!? Hah hah hah!"}],"reward":{"gil":557,"items":[{"id":2564},{"id":3092,"one":1},{"id":3351,"one":1},{"id":3578,"one":1},{"id":3810,"one":1},{"num":4,"id":5824,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":18}],"quests":[65543]},"next":[65545]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000292","obj":{"i":1000292,"n":"Sandre","l":53,"q":2}},{"type":"item","id":"2564","obj":{"i":2564,"n":"Novice's Scythe","l":29,"c":38152,"t":31}},{"type":"item","id":"3092","obj":{"i":3092,"n":"Velveteen Coatee of Gathering","l":27,"c":42198,"t":35,"p":1812}},{"type":"item","id":"3351","obj":{"i":3351,"n":"Velveteen Sarouel of Gathering","l":25,"c":45178,"t":36,"p":1099}},{"type":"item","id":"3578","obj":{"i":3578,"n":"Fingerless Goatskin Gloves of Gathering","l":25,"c":44062,"t":37,"p":1282}},{"type":"item","id":"3810","obj":{"i":3810,"n":"Goatskin Crakows of Gathering","l":25,"c":46156,"t":38,"p":1172}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5542","obj":{"i":5542,"n":"Chamomile","l":24,"c":25008,"t":54}},{"type":"quest","id":"65543","obj":{"i":65543,"n":"Dressed to Harvest","g":145,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"65545","obj":{"i":65545,"n":"What Nature Giveth","g":145,"l":"Gridania","s":300,"f":1}}]}