{"quest":{"name":"Weapons of a Feather","location":"Gridania","id":65541,"patch":2.0,"sort":100,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000295,"genre":145,"usedItems":[5352],"journal":["Fufucha needs your help to fulfill a large order.","Fufucha has asked you to acquire ten crow feathers, which you must deliver to Cicely of the Botanists' Guild. The feathers are said to be abundant in the area south of Gilbert's Spire.","You learn that the crow feathers will be used to make arms and armor. While Cicely takes satisfaction from the thought that the feathers will be used in the nation's defense, it gives her pause that war may be coming to the Twelveswood once more.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 15."],"objectives":["Deliver crow feathers to Cicely."],"dialogue":[{"name":"FUFUCHA","text":"Ah, <span class=\"highlight\">Forename</span>. You couldn't have come at a more opportune time. I have a favor to ask of you."},{"name":"FUFUCHA","text":"We have just received an urgent request from the Order of the Twin Adder. They ask that we supply them with ten crow feathers as soon as possible."},{"name":"FUFUCHA","text":"Crows often leave behind feathers where they perch, which can be used to make arms and armor."},{"name":"FUFUCHA","text":"Requests for the items have been coming in with increasing regularity. The situation must be grim indeed."},{"name":"FUFUCHA","text":"It would not do to keep the defenders of our nation waiting. I would be most glad if you could help us fulfill this order."},{"name":"FUFUCHA","text":"Crow feathers can be found in abundance in the area south of Gilbert's Spire."},{"name":"FUFUCHA","text":"Once you have procured ten, promptly deliver them to Cicely. I've given her charge over our stores. My thanks in advance."},{"name":"CICELY","text":"You're helping us out again? My thanks, friend. In case you've forgotten, the crow feathers can be found in the area south of Gilbert's Spire."},{"name":"CICELY","text":"Ah, the crow feathers! You have my thanks."},{"name":"CICELY","text":"Doubtless you already know this from Fufucha, but it's the Order of the Twin Adder that requested the feathers."},{"name":"CICELY","text":"If I heard it true, they're in the midst of preparing for war against the Ixal. The crow feathers are needed to make arms and armor─feathered harpoons, plumed yew crooks, and the like."},{"name":"CICELY","text":"It's a fine feeling, being able to do our part to aid those men and women who defend our nation."},{"name":"CICELY","text":"But to need such a large stockpile of feathers... It gives me pause to imagine the bloodshed that lies ahead. Will the Twelveswood ever know true peace?"},{"name":"CICELY","text":"Oh, but there I go again with my wistful ramblings. Feel free to ignore me."},{"name":"CICELY","text":"Now, before I forget, Fufucha asked me to give you something on her behalf: a scythe."},{"name":"CICELY","text":"The scythe is what we call a secondary tool. Used in your off hand, it allows you to harvest from lush vegetation in addition to the mature trees you already know so well."},{"name":"CICELY","text":"That Fufucha has seen fit to make you this gift is proof positive of your progress. You're no longer a novice, my friend. I daresay you're ready to try your hand at fieldcraft leves, perhaps even take on Grand Company work."},{"name":"CICELY","text":"But first, I recommend you head into the wood and find some lush vegetation to try that new scythe on. Off you go now, and come back when you're ready to take on another task for the guild!"}],"reward":{"gil":289,"items":[{"id":2560},{"id":2658,"one":1},{"id":3771,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":18}],"quests":[65540]},"next":[65542]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000295","obj":{"i":1000295,"n":"Cicely","l":53,"q":2}},{"type":"item","id":"2560","obj":{"i":2560,"n":"Bronze Scythe","l":11,"c":38151,"t":31,"p":304}},{"type":"item","id":"2658","obj":{"i":2658,"n":"Straw Hat","l":10,"c":41037,"t":34,"p":226}},{"type":"item","id":"3771","obj":{"i":3771,"n":"Hard Leather Shoes","l":11,"c":46167,"t":38,"p":256}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5352","obj":{"i":5352,"n":"Crow Feather","l":10,"c":21903,"t":51,"p":21}},{"type":"quest","id":"65540","obj":{"i":65540,"n":"Sap for Smiles","g":145,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65542","obj":{"i":65542,"n":"Haste Makes Waste","g":145,"l":"Gridania","s":150,"f":1}}]}