{"quest":{"name":"Seeds of Hope","location":"Gridania","id":65549,"patch":2.0,"sort":500,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000815,"involved":[1000774,1000776,1000777],"genre":145,"usedItems":[5395],"journal":["Fufucha of the Botanists' Guild has reached a most difficult decision.","Unable to reconcile her conflicting feelings regarding the Botanists' Guild serving the war effort that has brought such turmoil to the once-tranquil Twelveswood, Fufucha has made the grave decision to resign her position as guildmaster. Yannie at the Greatloam Growery would assign you a task in the former guildmaster's stead.","Yannie would convince her friend Fufucha not to abandon the guild, and seeks your aid. Travel to the Timberlord's Lodge, west of Skyfire Locks in the Coerthas central highlands, and seek the counsel of Roiteloin, a former apprentice of Fufucha's.","Roiteloin sympathizes deeply with Fufucha's dilemma, and has devised a plan that he believes will lift her spirits and impel her to reconsider her decision. Gather for him three logs of spruce, a type of lumber still rare in these lands. Use the Truth of Forests technique to identify unspoiled mature trees that appear at 9 a.m. (Eorzea time) to harvest spruce logs.","Roiteloin explains that the spruce logs you gathered are sorely needed by the people of Coerthas, many of whom have had their homes razed to the ground by dragon fire. Head due west from the Observatorium and seek out the carpenter who heads the rebuilding effort.","At Yannie's request, Fufucha journeyed to Coerthas to see with her own eyes the forest she helped grow, and the experience has opened her eyes. Return to the Botanists' Guild and speak with Fufucha.","Having finally come to peace with her role as a botanist in times of strife, Fufucha has decided to remain at the guild. She thanks you for helping her rediscover the sense of purpose she had lost, and applauds you as a model for all botanists to follow.<br><br>※The next botanist quest will be available from Fufucha once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Yannie.","Speak with Roiteloin at the Timberlord's Lodge.","Present spruce logs to Roiteloin.","Find the troubled carpenter.","Speak with Fufucha at the Botanists' Guild."],"dialogue":[{"name":"FUFUCHA","text":"Forgive me if I seemed a bit distant the last time we spoke, <span class=\"highlight\">Forename</span>. Allow me to get straight to the point. I have not come to this decision easily, but I have come to it all the same: as of today, I have resigned from the Botanists' Guild."},{"name":"FUFUCHA","text":"Our battle with the Ixal rages on, and there are rumblings from the Empire as well. With each passing day, more people die, the soil is stained deeper with blood, and the Twelveswood weeps..."},{"name":"FUFUCHA","text":"Meanwhile, I fill orders for the war effort. And for what purpose? That more Ixal may suffer and die than Gridanians? No, if this is what it means to be a botanist in this day and age, I want no more part of it."},{"name":"FUFUCHA","text":"Yannie, may Nophica bless her dear heart, tried her best to convince me to stay. Still, I fear my heart is settled."},{"name":"FUFUCHA","text":"Mind you, this decision is mine alone. I would pass no judgment on those who find meaning in their efforts here. Should you wish to continue to serve the guild, I am sure Yannie will have suitable tasks for you. Farewell, <span class=\"highlight\">Forename</span>, and may the Twelveswood ever shelter you."},{"name":"YANNIE","text":"Oh, <span class=\"highlight\">Forename</span>. I'm so glad you're here. You spoke to Fufucha, yes? It absolutely breaks my heart to see what's become of my old friend."},{"name":"YANNIE","text":"Fufucha and I have known each other since we were both knee-high to a funguar, and I assure you, her knowledge of and passion for the flora of this realm is second to none. This guild would be absolutely lost without her guidance."},{"name":"YANNIE","text":"Of course, I understand her worries─these are not easy times for a true seeker of peace and friend to nature. And yet, I cannot help but feel that her emotions cloud her better judgment─that she is not seeing the forest for the trees, if you will."},{"name":"YANNIE","text":"Fufucha has convinced herself that she is doing more harm than good to the natural world she so loves. Preposterous! Has she forgotten the countless trees she planted after the Calamity, journeying far and wide to return lush verdure to our shattered realm?"},{"name":"YANNIE","text":"Someone must remind her of all she has accomplished, and the work that is still left to be done."},{"name":"YANNIE","text":"To that end, I have made contact with one of Fufucha's former apprentices, a botanist by the name of Roiteloin, who now tends to a forest that Fufucha herself led the planting of many years ago."},{"name":"YANNIE","text":"My words as a friend will not reach Fufucha now─only a fellow botanist who understands the depths of her worries can heal the wounds in her heart. I beg of you, <span class=\"highlight\">Forename</span>, speak with this Roiteloin and seek his counsel."},{"name":"YANNIE","text":"Roiteloin tends to the forests surrounding the Timberlord's Lodge in the central highlands of Coerthas. Please, go quickly─once Fufucha leaves our guild behind, I fear that she shall never return..."},{"name":"YANNIE","text":"Roiteloin tends to the forests surrounding the Timberlord's Lodge in the central highlands of Coerthas. Please, go quickly─once Fufucha leaves our guild behind, I fear that she shall never return..."},{"name":"ROITELOIN","text":"Well met, <span class=\"highlight\">Forename</span>. Yannie told me to expect you. I am Roiteloin, a humble botanist plying his trade in these bleak lands."},{"name":"ROITELOIN","text":"Botany is not simply my livelihood. I consider it my true calling─a calling I would never have discovered were it not for Fufucha's guidance. Needless to say, I was devastated to hear the news."},{"name":"ROITELOIN","text":"All hope is not lost, however, as I have hit upon an idea. Tell me, <span class=\"highlight\">Forename</span>, are you familiar with the spruce tree?"},{"name":"ROITELOIN","text":"I do not blame you if you are not, as it is a rare sight these days. As Fufucha would tell it, in the years before the Calamity, vast forests of spruce would stretch for malms and malms."},{"name":"ROITELOIN","text":"What spruce trees you see today are the result of Fufucha's efforts to bring the flora of ages past back to Eorzea. Perhaps seeing that her work has borne fruit will convince her not to abandon her life as a botanist."},{"name":"ROITELOIN","text":"Knowing Fufucha as I do, the gesture would mean the most to her if the spruce were harvested by the hand of an apprentice close to her heart─<span class=\"emphasis\">your</span> hand, <span class=\"highlight\">Forename</span>."},{"name":"ROITELOIN","text":"Before you set off, be forewarned: spruce is still rare to these parts, and not easily discerned. Only one with knowledge of the Truth of Forests could hope to identify such trees, and then only after straining the eyes from the break of dawn."},{"name":"ROITELOIN","text":"If your eyes are true, friend, you will come upon mature trees unlike any you have seen before. Harvest from them three spruce logs, and bring them back to me."},{"name":"SYSTEM","text":"Use the Truth of Forests technique to identify unspoiled mature trees that appear in the Coerthas central highlands at 9 a.m. (Eorzea time) to harvest spruce logs."},{"name":"ROITELOIN","text":"Should you have difficulty locating the spruce trees, remember: only one with knowledge of the Truth of Forests can see them, and only after waiting from dawn till sundown."},{"name":"ROITELOIN","text":"If your eyes are true, friend, you will come upon mature trees unlike any you have seen before."},{"name":"ROITELOIN","text":"Did you follow all that, <span class=\"highlight\">Forename</span>? Very well. Gather three spruce logs, and bring them back here to me."},{"name":"ROITELOIN","text":"Remarkable gathering, <span class=\"highlight\">Forename</span>. I see that Fufucha has trained you well."},{"name":"ROITELOIN","text":"I had a mind to deliver them to Fufucha straightaway, but I just received some troubling news. You have heard that we here in Coerthas are locked in war with the dragons, have you not?"},{"name":"ROITELOIN","text":"A recent dragon raid has left many soldiers and settlers without shelter. A carpenter in the area is doing all he can to construct new lodgings, but lumber is in painfully short supply."},{"name":"ROITELOIN","text":"I share your concern for Fufucha, but I am sure you agree that our first priority as botanists is to help those in need. Why, Fufucha herself taught me as much."},{"name":"ROITELOIN","text":"Please, <span class=\"highlight\">Forename</span>, seek out the carpenter, and deliver to him some spruce logs, that the people of Coerthas need suffer without a roof over their heads for no longer."},{"name":"MAN","text":"Yes? On the off chance that you're either blind or stupid, I'm a busy man."},{"name":"MAN","text":"Busy doin' what, you say? Searchin' for lumber, that's what! We've no end of houses that need rebuilt after bein' smashed to bits by those damned dragons."},{"name":"MAN","text":"...Or haven't you noticed that there's a war goin' on here?"},{"name":"MAN","text":"Look, I don't mean to be rude, but I've no time for chitchat. Take a look around─these ain't hospitable lands. Without shelter, people will die."},{"name":"MAN","text":"Damn it all! Is there not a single sturdy log left in all the highlands!?"},{"name":"MAN","text":"Why, this is...! I've never seen wood like this! Where in the name of the Twelve did you find this?"},{"name":"MAN","text":"To think that lumber of this quality could be found in these lands. Why, I'll not forget this kindness, friend. Those trees will save lives."},{"name":"FUFUCHA","text":"Those trees...will save lives?"},{"name":"MAN","text":"You bet they will, little missy! Er, speakin' o' which, whom do I have the pleasure of addressin'?"},{"name":"FUFUCHA","text":"My name matters not. I am just a humble botanist, and nothing more. I would bid you speak to my colleague Roiteloin at the Timberlord's Lodge. He will see that you never want for lumber."},{"name":"MAN","text":"I don't know who you are, miss, but I'm glad we met! The gods are truly watchin' over us today!"},{"name":"FUFUCHA","text":"Shall we go for a walk, <span class=\"highlight\">Forename</span>?"},{"name":"FUFUCHA","text":"When Yannie suggested I travel to Coerthas, I had not the slightest idea what she had in mind. The moment I laid eyes on this forest, I remembered."},{"name":"FUFUCHA","text":"This was your intent, was it not, <span class=\"highlight\">Forename</span>? You, Yannie, and Roiteloin."},{"name":"FUFUCHA","text":"Your gentle concern for my faltering heart is not lost on me. Nor is the meaning of this forest. The trees themselves speak volumes."},{"name":"FUFUCHA","text":"The seeds, the art of botany, the love and reverence for nature that we brought to Ishgard have taken root in the lands and the hearts of the people, and grown strong...strong indeed."},{"name":"FUFUCHA","text":"As strong as the majestic spruces that once more grace these snow–swept highlands."},{"name":"FUFUCHA","text":"The spruces that will now provide shelter and comfort to those who have been ravaged by war..."},{"name":"FUFUCHA","text":"Like the Twelveswood, this forest has suffered greatly in these times of strife. And yet...this forest has strength."},{"name":"FUFUCHA","text":"A strength it has harbored since time immemorial, and one it shares with us. A strength that goes beyond logs we harvest or the herbs we gather."},{"name":"FUFUCHA","text":"I must never forget the lessons I have learned here today. On the contrary, I must share what I have discovered here, that hope might take root again in the hearts of our countrymen."},{"name":"FUFUCHA","text":"Let us return to Gridania, <span class=\"highlight\">Forename</span>. The Twelveswood is calling us home."},{"name":"FUFUCHA","text":"Do you hear, <span class=\"highlight\">Forename</span>? The leaves whisper to us, welcoming us home. To think that I almost turned my back on them forever..."},{"name":"FUFUCHA","text":"The battles rage on, and the forest will not go unscathed. Gridanian and Ixal hack away at innocent branches and uproot flowers and shrubs for their own self-seeking causes."},{"name":"FUFUCHA","text":"The sadness, the powerlessness is at times too great to bear. And yet, if I were to walk away, who would tend to the wounded forest in my stead?"},{"name":"FUFUCHA","text":"There is only so much that a lone botanist can accomplish. And yet, every seed that is planted, every tree that takes root brings us one step closer to a future where we live in harmony with the forest."},{"name":"FUFUCHA","text":"In my pain and frustration, my eyes had been blinded to this truth. Thanks to you, Yannie, and Roiteloin, I see again."},{"name":"FUFUCHA","text":"Rest easy, <span class=\"highlight\">Forename</span>. I will remain here at the Growery. How could I not? The forest needs every friend it can muster in these dark times, and it would seem I still have much to learn."},{"name":"FUFUCHA","text":"I would be honored to continue to walk the path of the botanist with you. Not as guildmaster and apprentice, but as peers─fellow shepherds of the forest. Be you ever safe in your travels."},{"name":"SYSTEM","text":"This concludes the botanist quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next botanist quest will be available from Fufucha."}],"reward":{"items":[{"id":2558},{"id":2929,"one":1},{"id":3490,"one":1},{"id":3715,"one":1},{"id":3936,"one":1},{"num":3,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":18}],"quests":[65548]},"next":[67584]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000774","obj":{"i":1000774,"n":"Yannie","l":53,"q":2}},{"type":"npc","id":"1000776","obj":{"i":1000776,"n":"Roiteloin","l":63,"q":4}},{"type":"npc","id":"1000777","obj":{"i":1000777,"n":"Troubled Carpenter","l":63,"q":1}},{"type":"item","id":"2558","obj":{"i":2558,"n":"Rauni","l":55,"c":38111,"t":30,"p":1000}},{"type":"item","id":"2929","obj":{"i":2929,"n":"Hamlet Cutter's Hat","l":55,"c":41138,"t":34}},{"type":"item","id":"3490","obj":{"i":3490,"n":"Botanist's Slops","l":55,"c":45326,"t":36}},{"type":"item","id":"3715","obj":{"i":3715,"n":"Botanist's Gloves","l":55,"c":44184,"t":37}},{"type":"item","id":"3936","obj":{"i":3936,"n":"Botanist's Workboots","l":55,"c":46344,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"5395","obj":{"i":5395,"n":"Spruce Log","l":55,"c":22413,"t":50}},{"type":"quest","id":"65548","obj":{"i":65548,"n":"Botanist in a Bind","g":145,"l":"Gridania","s":450,"f":1}},{"type":"quest","id":"67584","obj":{"i":67584,"n":"Call from the Clouds","g":145,"l":"Gridania","s":502,"f":1}}]}