{"quest":{"name":"Leves of Wineport","location":"Eastern La Noscea","id":65550,"patch":2.0,"sort":350,"unlocksFunction":1,"eventIcon":71341,"issuer":1002367,"target":1002367,"genre":91,"journal":["Aileen, the Adventurers' Guild representative for local levequests in Wineport, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves she has to offer, Aileen requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Aileen in Wineport.","Aileen is now confident that you are capable of handling any of the trials and tribulations you might encounter around Wineport. Prove your worth as an adventurer, and continue to undertake the guildleves she has to offer."],"objectives":["Complete Aileen's trial guildleve.","Report to Aileen."],"dialogue":[{"name":"AILEEN","text":"Looking for work to fund our wine habit, are we?"},{"name":"AILEEN","text":"The Adventurers' Guild has assigned me to Wineport so that I might distribute guildleves to the willing and able."},{"name":"AILEEN","text":"Depending on what skills you possess, I may have suitable work for you. Beast culling, crafting, gathering, and so forth."},{"name":"AILEEN","text":"That said, my offer is contingent upon you first demonstrating your capacity to complete a contract."},{"name":"AILEEN","text":"The La Noscean wilderness is fraught with peril, so it behooves me to test your ability to survive in it."},{"name":"AILEEN","text":"While these goobbues are wont to devour anything and everything, they have a fondness for pelican meat."},{"name":"AILEEN","text":"Your task will be to slay a pelican and use its remains to lure out the ravenous goobbues."},{"name":"AILEEN","text":"The area in which the goobbues were last sighted is fairly large, so this may take a fair amount of time. Be warned, however, that other hungry creatures may be drawn to the meat."},{"name":"AILEEN","text":"I believe I've explained your task in sufficient detail. If you have any further questions, refer to the guildleve in your possession."},{"name":"AILEEN","text":"Oh, you actually completed the trial. I suppose you'll be wanting this, then."},{"name":"AILEEN","text":"So it's begun. Good. I look forward to hearing of your success."},{"name":"AILEEN","text":"You've proven yourself competent, which is well. If you desire additional guildleves, I will not deny you."},{"name":"AILEEN","text":"You can drink whilst you work for all I care. As long as the client is satisfied, so am I."}],"reward":{"gil":1791,"xp":9020},"reqs":{"jobs":[{"lvl":35,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1002367","obj":{"i":1002367,"n":"Aileen","l":32,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}