{"quest":{"name":"Way of the Archer","location":"Gridania","id":65557,"patch":3.1,"sort":11,"icon":100048,"unlocksFunction":1,"eventIcon":71341,"issuer":1000197,"target":1000200,"genre":131,"journal":["Athelyna wishes you to reaffirm your desire to join the Archers' Guild.","You have been referred to Luciane, the master of the Archers' Guild. Seek her out in the rear chamber.","Luciane wishes to test your fitness to join the Archers' Guild. Take yourself outside the city and slay three squirrels, three ladybugs, and three funguars.","You have succeeded in slaying the specified creatures. Report back to Luciane at the Archers' Guild.","Having successfully completed the trial, Luciane names you a member of the Archers' Guild. She encourages you to practice proper technique, loosing arrow after arrow until the movement becomes second nature.<br><br>※The next archer quest will be available from Luciane upon reaching level 5."],"objectives":["Speak with Luciane, the master of the Archers' Guild.","Slay ground squirrels.","Slay little ladybugs.","Slay forest funguars.","Report to Luciane at the Archers' Guild."],"dialogue":[{"name":"ATHELYNA","text":"So, are you resolved to join the Archers' Guild?"},{"name":"ATHELYNA","text":"Need more time to consider, do you? Very well."},{"name":"ATHELYNA","text":"Our guildmaster would discern your indecision ere you had approached to within fifty paces, so keen is her eye. Best you do not go before her until such time as you know your own mind."},{"name":"ATHELYNA","text":"The look in your eye bespeaks your determination. It would be my pleasure to refer you to Guildmaster Luciane."},{"name":"ATHELYNA","text":"Lest you worry unduly, Luciane is an affable and kind-hearted woman. Even those not of the guild have been known to seek her counsel on various matters, and ever have they been given fair hearing."},{"name":"ATHELYNA","text":"Luciane awaits you in the training area yonder. Present yourself before her, and impress upon her your desire to join the guild."},{"name":"LUCIANE","text":"Greetings, adventurer. I am told you wish to join our ranks."},{"name":"LUCIANE","text":"I am Luciane, the master of the Archers' Guild, and I bid you welcome. Our doors are open to all who have the will to learn."},{"name":"LUCIANE","text":"Allow me to explain the basics of our art, and offer you a foretaste of that which we teach the members of our guild."},{"name":"LUCIANE","text":"The bow's greatest advantage is its range. Unlike those arms used in other disciplines of war, it allows one to strike at the enemy from afar."},{"name":"LUCIANE","text":"Though the bow may not boast the destructive force of a sword or spear, its myriad strategic applications more than compensate for this shortcoming. An experienced archer can immobilize an enemy by striking a leg, or sap its strength with a poisoned arrow."},{"name":"LUCIANE","text":"Rise to become a virtuoso of archery, and a veritable deluge of death will be yours to rain down upon your foes."},{"name":"LUCIANE","text":"By fighting from a distance, we can better assess the battlefield and thereby determine the most advantageous course of action."},{"name":"LUCIANE","text":"This is of paramount import, as our role in battle is to exploit the enemy's weakness. With the requisite placement and timing, but a single arrow may serve to turn the tide."},{"name":"LUCIANE","text":"To this end, the guild seeks to instill a discerning eye within its members, that they might learn to strike at vulnerabilities, swiftly and surely."},{"name":"LUCIANE","text":"Now, any half-wit can bend the bow, but it is no simple undertaking to become a skilled archer. You must be prepared for a long and arduous journey."},{"name":"LUCIANE","text":"Are you resolved to complete that journey?"},{"name":"Q1","text":"Will you dedicate yourself to archery?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"LUCIANE","text":"That is regrettable. Yet it is good to see a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who knows <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own mind."},{"name":"LUCIANE","text":"You would make a fine archer─had you but the will. Should you experience a change of heart, seek me here once more."},{"name":"LUCIANE","text":"Very well. Now, before proceeding any further, I must needs gauge your innate aptitude for archery. To this end, I hereby assign you the following trial..."},{"name":"LUCIANE","text":"Slay the squirrels, ladybugs, and funguars that roam just beyond the city gates─three of each should suffice."},{"name":"LUCIANE","text":"In so doing, you will prove your fitness to join the Archers' Guild."},{"name":"LUCIANE","text":"Report back to me when the task is accomplished. I doubt that it will trouble you unduly."},{"name":"LUCIANE","text":"Welcome back, <span class=\"highlight\">Forename</span>. It would seem you have successfully completed the trial."},{"name":"LUCIANE","text":"You have proven yourself worthy of a place within these halls. It is with pleasure that I name you an archer of the guild."},{"name":"LUCIANE","text":"As fellows of the path, let us together strive for greater mastery of our art."},{"name":"LUCIANE","text":"Now, though you may be a member of the Archers' Guild, know that your seniors will not coddle you with personal attention. It is up to you to seek out the experiences you need to grow as an archer."},{"name":"LUCIANE","text":"To this end, I present you with this hunting log. Written within are the names of such creatures as would provide a fitting challenge. Should you find yourself lacking direction, you would do well to refer to the log."},{"name":"LUCIANE","text":"By way of a first step, I encourage you to practice proper technique. Loose arrow after arrow, paying close attention to form, until the movement becomes second nature."},{"name":"LUCIANE","text":"When drawing your bowstring has become as natural to you as drawing breath, and the world seems clearer when viewed down the shaft of an arrow, return to me. Go well, my young apprentice."},{"name":"SYSTEM","text":"The next archer quest will be available from Luciane upon reaching level 5."}],"reward":{"job":5,"items":[{"num":5,"id":4657}],"xp":100},"reqs":{"jobs":[{"lvl":1,"id":6}]},"next":[65582,65603]},"partials":[{"type":"npc","id":"1000197","obj":{"i":1000197,"n":"Athelyna","l":52,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1000200","obj":{"i":1000200,"n":"Luciane","l":52,"q":13,"t":"Guildmaster"}},{"type":"item","id":"4657","obj":{"i":4657,"n":"Braised Pipira","l":7,"c":24311,"t":46,"p":12}},{"type":"quest","id":"65582","obj":{"i":65582,"n":"A Matter of Perspective","g":131,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65603","obj":{"i":65603,"n":"School of Hard Nocks","g":131,"l":"Gridania","s":100,"f":1}}]}