{"quest":{"name":"Leves of Saint Coinach's Find","location":"Mor Dhona","id":65554,"patch":2.0,"sort":450,"unlocksFunction":1,"eventIcon":71341,"issuer":1004348,"target":1004348,"genre":95,"journal":["K'leytai, the Adventurers' Guild representative for local levequests at Saint Coinach's Find, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves she has to offer, K'leytai requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to K'leytai at Saint Coinach's Find.","K'leytai is now confident that you are capable of handling any of the trials and tribulations you might encounter around Saint Coinach's Find. Prove your worth as an adventurer, and continue to undertake the guildleves she has to offer."],"objectives":["Complete K'leytai's trial guildleve.","Report to K'leytai."],"dialogue":[{"name":"KLEYTAI","text":"Ah, another adventurous soul. Welcome to Saint Coinach's Find. I am K'leytai of the Adventurers' Guild."},{"name":"KLEYTAI","text":"It is my responsibility as levemete to recruit hardworking, industrious men and women to fulfill the guild's many contracts."},{"name":"KLEYTAI","text":"Be advised that these contracts can be quite demanding, and we cannot afford to assign work to the unqualified."},{"name":"KLEYTAI","text":"Many of my leves would require you to travel far from the safety of this encampment. The creatures which roam Mor Dhona are not to be trifled with, and I have no desire to send you to your doom."},{"name":"KLEYTAI","text":"Therefore, I will evaluate you based on your ability to complete a battlecraft leve. Oh, and you should know that I was selected for this post due to my military experience. Do not expect your trial to be an easy one."},{"name":"KLEYTAI","text":"I should remind you that the client explicitly requested live specimens. It is essential that you do not slay the nixes."},{"name":"KLEYTAI","text":"Once you have sufficiently weakened your quarry, cease your attacks and attempt to <span class=\"highlight\">soothe</span> it. However, you must take care when attempting to do so, for if the attempt fails, the beast may be driven into a frenzy for a time."},{"name":"SYSTEM","text":"Use the /soothe emote to pacify a weakened winter nix. You may find it convenient to add the emote to your hotbar before beginning the guildleve."},{"name":"KLEYTAI","text":"You may begin your trial whenever you are ready. We will be watching."},{"name":"KLEYTAI","text":"Based on the reports from the local levewatches, I am more than satisfied with your qualifications. The client was most pleased as well, and would like you to have this."},{"name":"KLEYTAI","text":"Time is of the essence─I suggest you do not dally. Report to me once you have pacified the nixes."},{"name":"KLEYTAI","text":"If ever you want for more guildleves, you need only ask. We all look forward to your return."}],"reward":{"gil":1958,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1004348","obj":{"i":1004348,"n":"K'leytai","l":67,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}