{"quest":{"name":"Way of the Conjurer","location":"Gridania","id":65558,"patch":3.1,"sort":11,"icon":100051,"unlocksFunction":1,"eventIcon":71341,"issuer":1000323,"target":1000692,"genre":133,"journal":["Madelle wishes you to reaffirm your desire to join the Conjurers' Guild.","You have been referred to Brother E–Sumi–Yan, the master of the Conjurers' Guild. Seek an audience with him at Stillglade Fane.","Having formally admitted you to the Conjurers' Guild, Brother E–Sumi–Yan bids you aid in the Twelveswood's recovery by purging it of three squirrels, three ladybugs, and three funguars.","You have succeeded in slaying the specified creatures. Report back to Brother E–Sumi–Yan at the Conjurers' Guild.","Brother E–Sumi–Yan explains that conjurers harness the power of nature in order to bring about change. Thus enlightened, you set out to accustom yourself to being at one with the forces that surround you.<br><br>※The next conjurer quest will be available from E–Sumi–Yan upon reaching level 5."],"objectives":["Speak with Brother E–Sumi–Yan.","Slay ground squirrels.","Slay little ladybugs.","Slay forest funguars.","Report to Brother E–Sumi–Yan at the Conjurers' Guild."],"dialogue":[{"name":"MADELLE","text":"Is your mind made up? Are you ready to join the Conjurers' Guild?"},{"name":"MADELLE","text":"So you require more time to decide... Very well. Know that there is no call for haste─such a decision must not be rushed."},{"name":"MADELLE","text":"It takes unwavering conviction to become a conjurer. After all, if you are not ready to embrace nature fully, you cannot expect nature to embrace you. Ponder these words, and return here again when you are certain you wish to walk our path."},{"name":"MADELLE","text":"That is well. I shall introduce you to our guildmaster, Brother E–Sumi–Yan."},{"name":"MADELLE","text":"Brother E–Sumi–Yan presides over the Conjurers' Guild even as he serves the nation as a Hearer."},{"name":"MADELLE","text":"You will find him in the meditation area within. Go to him, and make known your desire to join the guild."},{"name":"ESUMIYAN","text":"Greetings, adventurer. I am told you wish to become a conjurer of Stillglade Fane."},{"name":"ESUMIYAN","text":"I am Brother E–Sumi–Yan, master of this guild."},{"name":"ESUMIYAN","text":"Before you are formally accepted into our ranks, I would impart to you the principles of conjury. Pray attend me well."},{"name":"ESUMIYAN","text":"Conjury is an arcane art that takes life and the living for its domain. Its primary purpose is the salving of hurts and the granting of protection."},{"name":"ESUMIYAN","text":"Adventurers such as yourself oft stand upon the front lines of battle. Owing to this, you are like to find yourself in many situations wherein a capacity for healing would be advantageous. Mind you, there is more to conjury than that."},{"name":"ESUMIYAN","text":"By harnessing the power of earth, wind, and water, conjurers are also capable of weaving spells that wreak havoc."},{"name":"ESUMIYAN","text":"In terms of sheer destructive power, conjury may pale in comparison to thaumaturgy, but its capacity to defend one against aggression more than compensates for this relative shortcoming."},{"name":"ESUMIYAN","text":"In mastering healing and purification, not only will you be able to mend wounds and purge afflictions─you will also be able to breathe life back into the fallen."},{"name":"ESUMIYAN","text":"More than simply healers, yet not true dealers of destruction, conjurers realize their full potential when they employ their powers in support of others. This, my dear adventurer, is what it means to be one of us."},{"name":"ESUMIYAN","text":"...Hm, mayhap that was too much to grasp upon a single hearing. But worry not, for the meaning of my words will become clear to you in due time."},{"name":"ESUMIYAN","text":"Aye, you will come to understand that conjury is not the sole province of the conjurer."},{"name":"ESUMIYAN","text":"Should you wish to walk our path, I must needs ask that you solemnly vow to embrace nature─to heed the will of the elementals and the Twelveswood alike. Can you make this vow?"},{"name":"Q1","text":"Do you vow to embrace nature?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"ESUMIYAN","text":"I knew your answer ere your lips had parted. The air of uncertainty yet clings to you."},{"name":"ESUMIYAN","text":"So long as doubt clouds your heart, you will not be able to draw on the power of the elements. Search your soul, and seek me again when you have resolved to become as one with nature."},{"name":"ESUMIYAN","text":"I knew your answer ere your lips had parted. Yet I am no less pleased to hear it."},{"name":"ESUMIYAN","text":"By the power vested in me, I hereby name you a member of the Conjurers' Guild."},{"name":"ESUMIYAN","text":"And so to work! Listen well, now, for I would assign you your first task as a conjurer of Stillglade Fane."},{"name":"ESUMIYAN","text":"Just beyond the city gates, you will encounter squirrels, ladybugs, and funguars. I would have you slay three of each."},{"name":"ESUMIYAN","text":"Lest you wonder how I can so coolly order the taking of life, know that things are not as they once were. As a consequence of the Calamity─and, I may add, through no fault of their own─these creatures have become a burden to the Twelveswood. A burden it cannot well bear."},{"name":"ESUMIYAN","text":"As a conjurer, it is your duty to carry out the will of the forest. And by employing your powers in so doing, you will come to learn something of your art."},{"name":"ESUMIYAN","text":"Go now, <span class=\"highlight\">Forename</span>, and perform your first task in the name of the elementals."},{"name":"ESUMIYAN","text":"Welcome back, <span class=\"highlight\">Forename</span>. The elementals have told me of your success."},{"name":"ESUMIYAN","text":"By placing yourself in the midst of nature and seeing it with a conjurer's eyes, you have taken your first step along the path to enlightenment."},{"name":"ESUMIYAN","text":"Healing, protection, and destruction... Though our spells vary in function, they all derive their power from the same source─the forces embodied in all creation."},{"name":"ESUMIYAN","text":"By gaining a true understanding of these, a conjurer may call upon them to manipulate his environment, thereby realizing the state of being that he desires."},{"name":"ESUMIYAN","text":"Ah, yes...yours is a familiar look: the very picture of confusion! Be not disheartened, for comprehension shall come in due time."},{"name":"ESUMIYAN","text":"For now, you must learn to reach out to the forces embodied in each of us."},{"name":"ESUMIYAN","text":"Pray receive of me this hunting log. Within you will find the names of such creatures as would pose a suitable challenge to a conjurer."},{"name":"ESUMIYAN","text":"There is no single path to mastering conjury. Yet should you find yourself needing direction, know that the log is there to guide you."},{"name":"ESUMIYAN","text":"Breathe deep and open your eyes to that which cannot be seen. Feel the myriad life around you, and draw upon this boundless reservoir of energy. Take up your cane, and use it to lend that energy form."},{"name":"ESUMIYAN","text":"Go forth, my young conjurer, and be at one with the world. Return to me when you have learned to draw upon the forces around you with the selfsame ease you draw upon those within."},{"name":"SYSTEM","text":"The next conjurer quest will be available from E–Sumi–Yan upon reaching level 5."}],"reward":{"job":6,"items":[{"num":5,"id":4728}],"xp":100},"reqs":{"jobs":[{"lvl":1,"id":7}]},"next":[65584,65627]},"partials":[{"type":"npc","id":"1000323","obj":{"i":1000323,"n":"Madelle","l":53,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"item","id":"4728","obj":{"i":4728,"n":"Raisins","l":3,"c":24058,"t":46,"p":5}},{"type":"quest","id":"65584","obj":{"i":65584,"n":"Trial by Earth","g":133,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65627","obj":{"i":65627,"n":"Trial by Wind","g":133,"l":"Gridania","s":100,"f":1}}]}