{"quest":{"name":"Leves of Camp Bluefog","location":"Northern Thanalan","id":65551,"patch":2.0,"sort":400,"unlocksFunction":1,"eventIcon":71341,"issuer":1002398,"target":1002398,"genre":93,"journal":["Rurubana, the Adventurers' Guild representative for local levequests in Camp Bluefog, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves he has to offer, Rurubana requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Rurubana in Camp Bluefog.","Rurubana is now confident that you are capable of handling any of the trials and tribulations you might encounter around Camp Bluefog. Prove your worth as an adventurer, and continue to undertake the guildleves he has to offer."],"objectives":["Complete Rurubana's trial guildleve.","Report to Rurubana."],"dialogue":[{"name":"RURUBANA","text":"&lt;sigh&gt; Of all postings in all of Thanalan, I had to get stuck with─ Ah, you there! You look like a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action. Might I interest you in a guildleve?"},{"name":"RURUBANA","text":"As the representative of the Adventurers' Guild here in Camp Bluefog, I am charged with distributing work to able-bodied individuals not unlike yourself."},{"name":"RURUBANA","text":"Now I know what you're thinking─why waste time performing menial tasks for strangers? Well, my good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, allow me to assure you that you shall be <span class=\"emphasis\">richly</span> recompensed for all services rendered."},{"name":"RURUBANA","text":"I see that I have your attention. Excellent! Now then, there is but the small matter of the trial guildleve. It would hardly be prudent of me to send you out into the wild without first verifying that you can complete my tasks."},{"name":"RURUBANA","text":"This job should serve as an adequate test. What say you, friend?"},{"name":"RURUBANA","text":"A<span class=\"emphasis\">ha</span>, I knew you'd agree!"},{"name":"RURUBANA","text":"Let us review the details of the request which you doubtlessly considered carefully before accepting, yes? Your client desires materials for the development of a new type of explosive. To that end, you must slay a variety of beasts in the wilds north of Camp Bluefog."},{"name":"RURUBANA","text":"A simple task, perhaps, but nevertheless dangerous. Do take care, and remember that if you die, you cannot claim your reward. Good luck!"},{"name":"RURUBANA","text":"What is it? I've already given you your trial leve. What are you waiting for? Begin!"},{"name":"RURUBANA","text":"Welcome back, my good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Here is your payment, as promised."},{"name":"RURUBANA","text":"You must be quite confident in your abilities if you're willing to waste time talking to me whilst in the middle of a leve. You <span class=\"emphasis\">do</span> realize there is a time limit, don't you?"},{"name":"RURUBANA","text":"Not that I ever truly harbored doubts as to your abilities, but rules and regulations cannot be ignored."},{"name":"RURUBANA","text":"I am pleased to state that, given your stellar performance, I am now permitted to offer you a wide variety of guildleves. Peruse them at your leisure and let me know if any are to your liking. I'll be here when you're ready!<br>...I'll <span class=\"emphasis\">always</span> be here..."}],"reward":{"gil":1958,"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1002398","obj":{"i":1002398,"n":"Rurubana","l":46,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}