{"quest":{"name":"Leves of Whitebrim","location":"Coerthas Central Highlands","id":65553,"patch":2.0,"sort":400,"unlocksFunction":1,"eventIcon":71341,"issuer":1002401,"target":1002401,"genre":94,"journal":["Voilinaut, the Adventurers' Guild representative for local levequests in Whitebrim Front, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves he has to offer, Voilinaut requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Voilinaut in Whitebrim Front.","Voilinaut is now confident that you are capable of handling any of the trials and tribulations you might encounter around Whitebrim Front. Prove your worth as an adventurer, and continue to undertake the guildleves he has to offer."],"objectives":["Complete Voilinaut's trial guildleve.","Report to Voilinaut."],"dialogue":[{"name":"VOILINAUT","text":"Well met, adventurer. Might I interest you in a guildleve?"},{"name":"VOILINAUT","text":"Ah, my sincerest apologies. 'Twas presumptuous of me to assume you were an adventurer─I mean, how could I possibly know at a glance?"},{"name":"VOILINAUT","text":"That said, on the off chance that you <span class=\"emphasis\">are</span> an adventurer, I've a wide assortment of contracts that need doing."},{"name":"VOILINAUT","text":"There is, however, one catch: I must, in accordance with official protocol, ask that you undertake a trial guildleve."},{"name":"VOILINAUT","text":"Once you have completed this trial, you will become eligible to receive any leves I have to offer."},{"name":"VOILINAUT","text":"Regrettably, the roads to Whitebrim Front grow more dangerous every day. If these attacks were to continue unabated, it would be disastrous for the local economy."},{"name":"VOILINAUT","text":"We ask only that you do your part to cull dangerous beasts in the region. I do not think you incapable of this task, but be warned─leaving behind rotting corpses is likely to attract other creatures, eager to feed."},{"name":"VOILINAUT","text":"Was I unclear in my instructions? You need only begin your trial and carry out its objectives. After that, please return to me."},{"name":"VOILINAUT","text":"Congratulations on a job well done! Here is your payment. Moments like this make it all seem worthwhile, do they not?"},{"name":"VOILINAUT","text":"I realize you may wish to request other leves, but I'm afraid I can't accommodate  you at this time. You must first complete that which you have just begun."},{"name":"VOILINAUT","text":"Should you see fit to undertake another leve, you may avail yourself of my services at will."}],"reward":{"gil":1958,"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1002401","obj":{"i":1002401,"n":"Voilinaut","l":63,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}