{"quest":{"name":"Essential Oil","location":"Gridania","id":65567,"patch":2.0,"sort":30,"eventIcon":71221,"issuer":1000705,"target":1000705,"genre":92,"journal":["Braya is busy with preparations for the coming ceremony and needs an adventurer to bring her scarlet oil.","Braya, a somewhat stiff but well-meaning conjurer's apprentice, is mortified to discover that the guild's stores of scarlet oil are insufficient for the coming ceremony. Slay six ladybugs near the Bannock and bring her the oil she needs.","You heroically slay six ladybugs and extract scarlet oil from their still-twitching corpses. Return to Stillglade Fane and triumphantly deliver the oil to Braya.","Braya's expression betrays no hint of emotion as she graciously accepts the scarlet oil. With one less worry, perhaps she will be able to relax a little...someday."],"objectives":["Obtain scarlet oil from little ladybugs.","Deliver the scarlet oil to Braya."],"dialogue":[{"name":"BRAYA","text":"Might you perchance be comfortable around vilekin? If so, I have urgent need of your assistance."},{"name":"BRAYA","text":"You see, I was preparing for the forthcoming auguries when I found, to my great embarrassment, that we lack the requisite quantity of scarlet oil."},{"name":"BRAYA","text":"If it is not too much to ask, I would be most grateful if you could resupply us in time for the ceremony."},{"name":"BRAYA","text":"Scarlet oil can be harvested from ladybugs, such as those found near the Bannock. Six of the vilekin should yield the necessary amount. Pray return to me as soon as you have it."},{"name":"BRAYA","text":"Ah, you are back. Have you procured the scarlet oil as I requested?"},{"name":"BRAYA","text":"Yes, everything appears to be in order. The ceremony may proceed as planned. I am grateful..."},{"name":"BRAYA","text":"...to the elementals for delivering you to us. Pray accept this small token of our appreciation."}],"reward":{"items":[{"id":3530,"one":1},{"id":3531,"one":1},{"id":5824,"one":1}],"xp":420}},"partials":[{"type":"npc","id":"1000705","obj":{"i":1000705,"n":"Braya","l":53,"q":4}},{"type":"item","id":"3530","obj":{"i":3530,"n":"Fingerless Leather Gloves","l":5,"c":44060,"t":37,"p":126}},{"type":"item","id":"3531","obj":{"i":3531,"n":"Leather Lightmitts","l":5,"c":44065,"t":37,"p":126}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}