{"quest":{"name":"Once Bitten, Twice Shy","location":"Gridania","id":65562,"patch":2.0,"sort":30,"eventIcon":71221,"issuer":1000297,"target":1000315,"genre":92,"journal":["A botanist named Ethelred needs an adventurer to make a delivery on his behalf.","After first insulting you without provocation, Ethelred bids you deliver an Azeyma rose to Waldew outside the Conjurers' Guild.","Waldew is delighted that Ethelred entrusted the task of delivering the Azeyma rose to you. He explains that the botanist has harbored a grudge against adventurers since time immemorial. That he was able to set aside his mistrust of outsiders represents a tremendous step forward. If Ethelred can overcome his prejudices, perhaps other Gridanians can do the same."],"objectives":["Deliver the Azeyma rose to Waldew."],"dialogue":[{"name":"ETHELRED","text":"Gods damn it, <span class=\"emphasis\">another</span> adventurer!? You're like flies on muck! Whatever Gridania did to deserve such a plague I don't know... &lt;spit&gt;"},{"name":"ETHELRED","text":"&lt;sigh&gt; I suppose times are changing, and they keep telling me I should...and perhaps <span class=\"emphasis\">you</span> might be...<br>Oh, gods help me, just...just take this Azeyma rose to Waldew of Stillglade Fane, will you?"},{"name":"ETHELRED","text":"Well, what are you still standing there for? Go and deliver the bloody rose!"},{"name":"WALDEW","text":"Welcome, adventurer, to the Conjurers' Guild. Here we commune with the elementals and heed their guidance. Yet, I must confess, the elementals did not whisper of <span class=\"emphasis\">your</span> coming."},{"name":"WALDEW","text":"We did indeed request an Azeyma rose from Ethelred, but that you should bring it to us in his stead means..."},{"name":"WALDEW","text":"...that something wonderful has happened!"},{"name":"WALDEW","text":"Ethelred has long held a grudge against the many adventurers who have passed through Gridania's gates. His beloved flowers are renowned for their beauty, you see, and were once so highly coveted by Ul'dahn collectors that they were picked nigh to extinction by fortune-seeking foreigners."},{"name":"WALDEW","text":"Yet, if it is peace we desire, we must all learn to look beyond mistrust born of the past and overcome our prejudices. So has the Elder Seedseer taught us, and so do we live."},{"name":"WALDEW","text":"I doubt it was easy for Ethelred to entrust this Azeyma rose to you. When he hears we have received it, he will come to know that not all outsiders are deserving of scorn."},{"name":"WALDEW","text":"Truly, it was by the will of the elementals that you came to us this day. Please accept this as a token of our gratitude."}],"reward":{"gil":118,"xp":210}},"partials":[{"type":"npc","id":"1000297","obj":{"i":1000297,"n":"Ethelred","l":53,"q":1}},{"type":"npc","id":"1000315","obj":{"i":1000315,"n":"Waldew","l":53,"q":1}}]}