{"quest":{"name":"To the Bannock","location":"Gridania","id":65564,"patch":2.0,"sort":12,"eventIcon":71201,"issuer":1000100,"target":1000421,"genre":1,"journal":["Miounne wishes to send an adventurer to the instructor at the Bannock.","The instructor at the Bannock is in need of a helping hand. Leave the city through the Blue Badger Gate, and speak with Galfrid once you arrive at your destination.","You learn from Galfrid that the Calamity of five years past has left deep scars on the Twelveswood, with both wildlife and plant life showing signs of the disaster's corrupting influence. Lend your strength to the people of Gridania as they work to restore the forest to its former state."],"objectives":["Speak with Galfrid at the Bannock."],"dialogue":[{"name":"MIOUNNE","text":"<span class=\"highlight\">Forename</span>, have you visited the Bannock on your wanderings?"},{"name":"MIOUNNE","text":"It is a training ground found just outside the city where the soldiers of the Order of the Twin Adder are drilled in swordplay and other martial matters."},{"name":"MIOUNNE","text":"I mention this because an acquaintance of mine─a gentleman by the name of Galfrid─is an instructor there, and I think you may be of use to him. Go and introduce yourself, and find out if there is anything you can do to help."},{"name":"MIOUNNE","text":"Mind you do not stray far from the path─the Twelveswood is no place for merry strolls through the underbrush."},{"name":"GALFRID","text":"Greetings, <span class=\"highlight\">Forename Surname</span>. Miounne sent word to expect you."},{"name":"GALFRID","text":"My name is Galfrid, and I am responsible for training our Twin Adder recruits."},{"name":"GALFRID","text":"I thank you for volunteering your assistance. The Twelveswood is much changed since the calamitous arrival of the Seventh Umbral Era five years ago."},{"name":"GALFRID","text":"The power of the elementals wanes, and the harmony of the forest gives way to chaos. A great abundance of life has been lost as the strong run rampant, stifling the weak and new-sprung."},{"name":"GALFRID","text":"Though it may not appear so to the eyes of an outsider, the Twelveswood is ailing─its once rich variety a fading memory."},{"name":"GALFRID","text":"For the citizens of Gridania, the restoration of the forest is a sacred duty. And it is my hope that adventurers such as you will offer to aid them in their struggle."},{"name":"GALFRID","text":"Listen to their requests, and do all that you can. May the elementals bless your endeavors, <span class=\"highlight\">Forename Surname</span>."}],"reward":{"gil":127,"items":[{"id":27634,"one":1},{"id":27665,"one":1},{"id":5824,"one":1}],"xp":910},"reqs":{"jobs":[{"lvl":4,"id":130}],"questsType":"any","quests":[65621,65659]},"next":[65737]},"partials":[{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000421","obj":{"i":1000421,"n":"Galfrid","l":54,"q":6}},{"type":"item","id":"27634","obj":{"i":27634,"n":"Altered Thighboots","l":5,"c":49077,"t":38}},{"type":"item","id":"27665","obj":{"i":27665,"n":"Altered Leather Thighboots","l":5,"c":46102,"t":38}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65621","obj":{"i":65621,"n":"Close to Home","g":1,"l":"Gridania","s":2}},{"type":"quest","id":"65659","obj":{"i":65659,"n":"Close to Home","g":1,"l":"Gridania","s":3}},{"type":"quest","id":"65737","obj":{"i":65737,"n":"Passing Muster","g":1,"l":"Central Shroud","s":15}}]}