{"quest":{"name":"Sylphic Gratitude","location":"Gridania","id":65578,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1000286,"target":1000286,"genre":92,"journal":["Estaine, the caretaker of Mih Khetto's Amphitheatre, needs an adventurer to help her tidy up.","Arriving at Mih Khetto's Amphitheatre one morning, overworked caretaker Estaine is surprised to discover mysterious piles of vegetables. She concludes that the sylphs, who frequent the amphitheatre at night, left them as a token of appreciation to Gridania. Help her by gathering the fresh offerings.","The amphitheatre is tidy─until the next time the sylphs feel generous, at least. Estaine will be glad to hear that you have finished the task.","Estaine thanks you for your kindness, before stressing the importance of Mih Khetto's Amphitheatre in bringing Gridanians together. She wonders if the place has a similar significance for the sylphs...before debating how to handle the surplus of fresh produce."],"objectives":["Gather the vegetable offerings.","Speak with Estaine."],"dialogue":[{"name":"ESTAINE","text":"Greetings, traveler. Come to see Mih Khetto's famed amphitheatre, have you?"},{"name":"ESTAINE","text":"I am Estaine, caretaker of this fine centerpiece of Gridanian culture, and I fear I must needs trouble you for your assistance."},{"name":"ESTAINE","text":"You see, it is not only well-meaning <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> like yourself who are drawn to this place. The sylphs often visit in the dead of night, long after our citizens have gone to bed."},{"name":"ESTAINE","text":"We have no particular objection to their presence, and they seem grateful for the accommodation. So much so, in fact, that last night they left us a token of their appreciation...in the form of vegetables. A <span class=\"emphasis\">lot</span> of vegetables."},{"name":"ESTAINE","text":"Their generosity is more than welcome, of course...but the sheer quantity of the things makes gathering them all something of a chore. And it's not as if I don't have enough to do already. In short, I'd be most grateful for any help you could give me."},{"name":"ESTAINE","text":"Well done, friend. Mih Khetto herself would sing you praise."},{"name":"ESTAINE","text":"She knew well the power of art, how it could strengthen the soul of a nation and preserve its history for future generations. This amphitheatre was her greatest gift to Gridania, and it was her wish that all folk use it freely─not only for performances and festivals, but as a place to share memories and make new ones."},{"name":"ESTAINE","text":"I wonder if the sylphs come here to do just that... That said, I <span class=\"emphasis\">do</span> wish they would find other ways to express their gratitude. We have no need of vegetables here, but mayhap the Carline Canopy can make use of them. Anyway, thanks be to the elementals for bringing you here today."}],"reward":{"gil":110,"items":[{"num":5,"id":4}],"xp":110}},"partials":[{"type":"npc","id":"1000286","obj":{"i":1000286,"n":"Estaine","l":53,"q":4}}]}