{"quest":{"name":"Parsemontrenomics","location":"Gridania","id":65574,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1000768,"target":1000248,"involved":[1000214,1000218,1000238],"genre":92,"journal":["The master of the markets, Parsemontret, is willing to permit an adventurer to assist him in fulfilling an order from the Lancers' Guild.","Parsemontret, the master of the markets, bids you fulfill an order from the Lancers' Guild. Though he claims the task is a practical education in mercantilism, you have certain doubts regarding his motivations. Even so, you have little choice but to search the Ebony and Rosewood Stalls for the requested items.","You obtain the requested items, gaining a much clearer impression of your self-styled mentor in the process. All that remains is for you to deliver the goods to Ceinguled at the Lancers' Guild.","Impressed by the swift fulfillment of her order, Ceinguled praises Parsemontret and declares that you would do well to follow in the great man's footsteps if you harbor any mercantile ambitions. Yet knowing how the master of the markets makes his money, can you set aside moral objections and exploit those around you?"],"objectives":["Obtain a bone spearhead from Gurthcid.","Obtain a pot of beeswax oil from Admiranda.","Obtain a length of brambleweed rope from Alaric.","Deliver the requested items to Ceinguled."],"dialogue":[{"name":"PARSEMONTRET","text":"<span class=\"alternative-container\"><span class=\"alternative\">Lost, are we? Unsure how to navigate the Rosewood and Ebony Stalls?</span><span class=\"alternative\">Hmph! I take it my previous explanation did not suffice to sate your curiosity.</span></span> Very well! If you wish to know more of the markets, I shall give you a <span class=\"emphasis\">practical</span> education, free of charge."},{"name":"PARSEMONTRET","text":"As master of the markets, I entertain many requests─this order from the Wailers, for example─but I delegate their fulfillment to my hirelings, that I might tend to such tasks as I alone am capable of performing."},{"name":"PARSEMONTRET","text":"For your personal betterment, I shall delegate the fulfillment of this particular request to you. I bid you search the stalls for a bone spearhead, a pot of beeswax oil, and a length of brambleweed rope, and deliver them to Ceinguled of the Lancers' Guild."},{"name":"PARSEMONTRET","text":"There is much and more to be found in these stalls, if you have the dedication to seek it and the coin to procure it."},{"name":"PARSEMONTRET","text":"However, as my representative, you need only offer my name as payment─none will deny me. In fact, many will be all too eager to part with their wares, so numerous are the debts I am owed."},{"name":"PARSEMONTRET","text":"A fine proposition, is it not? I am spared a simple task, and you gain priceless mercantile experience. Why, I should rightly charge <span class=\"emphasis\">you</span> for such an opportunity! But worry not─I am a man of my word and the terms will stand. Deliver the goods to Ceinguled, and she may even see fit to reward you."},{"name":"GURTHCID","text":"Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">mate</span></span>─we ain't open yet."},{"name":"GURTHCID","text":"Oh...one o' Parsemontret's? Well 'en, what was it you said you wanted? A bone spearhead?"},{"name":"GURTHCID","text":"Ah, 'ere she is. Take it, an' tell that bastard we're square!"},{"name":"ADMIRANDA","text":"Welcome! <span class=\"emphasis\">Welcome</span>!<br>...Hm? At the behest of good Master Parsemontret, you say? To what do we owe the pleasure of your company today, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>?"},{"name":"ADMIRANDA","text":"May I take this opportunity to say that it is an <span class=\"emphasis\">honor</span> and a <span class=\"emphasis\">privilege</span> to serve you! Ah, but you must have your beeswax oil without delay! Yes, yes! Feel free to take as much as you require. And...you will of course inform Master Parsemontret that I was only too happy to accommodate his needs, yes?"},{"name":"ALARIC","text":"Ye got discernin' eyes, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─the craftsmanship's truly somethin', ain't it? Perfect for securin' any manner of─"},{"name":"ALARIC","text":"Parsemontret!? Gods, if I never hear that bloody name again, it'll be too soon..."},{"name":"ALARIC","text":"An' there I was thinkin' I might make a gil today. Here, take the damn brambleweed rope an' bugger off."},{"name":"CEINGULED","text":"What business have you with me, adventurer? Hm? You come upon the bidding of Master Parsemontret?"},{"name":"CEINGULED","text":"So soon? ...I am impressed."},{"name":"CEINGULED","text":"I placed my order only a short time ago, yet here are all the items I requested. Truly, Master Parsemontret is every bit as resourceful as they say."},{"name":"CEINGULED","text":"You are fortunate to work under such a man. You would do well to mold yourself in his image, if you have any aspirations as a merchant."}],"reward":{"gil":111,"items":[{"num":5,"id":5}],"xp":110}},"partials":[{"type":"npc","id":"1000768","obj":{"i":1000768,"n":"Parsemontret","l":53,"q":8}},{"type":"npc","id":"1000248","obj":{"i":1000248,"n":"Ceinguled","l":53,"q":5}},{"type":"npc","id":"1000214","obj":{"i":1000214,"n":"Gurthcid","l":53,"q":1}},{"type":"npc","id":"1000218","obj":{"i":1000218,"n":"Admiranda","l":53,"s":11,"q":1,"t":"Tool Supplier","a":565,"c":[14.55,10.09]}},{"type":"npc","id":"1000238","obj":{"i":1000238,"n":"Alaric","l":53,"s":1,"q":1,"t":"Independent Tinker","a":564,"c":[14.36,8.81]}}]}