{"quest":{"name":"Covered in Roses","location":"Gridania","id":65577,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1000300,"target":1000300,"genre":92,"journal":["A botanist named Samiane is hoping that an adventurer will pick up scattered rose hips for her.","Like all good Gridanians, Samiane treats her belongings with respect and is loath to discard them before they reach the end of their useful lives. An admirable stance, to be sure, but one which leads to disaster when her venerable seed pouch splits, depositing its cargo of Azeyma rose hips in her wake. Help the unfortunate botanist by gathering the lost rose hips strewn along the road to the Greatloam Growery.","You gather the scattered rose hips with great care. Return them to Samiane and set her mind at ease.","Samiane thanks you for your assistance in collecting the Azeyma rose hips. Though some seeds may have sprouted where they fell, she explains that all botanists consider it their responsibility to raise the Twelveswood's flora in the best possible conditions. That said, she concedes that a rose-lined path might not have been so bad..."],"objectives":["Gather Azeyma rose hips.","Deliver the Azeyma rose hips to Samiane."],"dialogue":[{"name":"SAMIANE","text":"Stop right there! Not another step!"},{"name":"SAMIANE","text":"I apologize if I have startled you, but please be careful─the ground here is covered in rose hips. You see, my seed pouch had grown so threadbare that it finally split open."},{"name":"SAMIANE","text":"Unbeknown to myself, I've been scattering Azeyma rose hips all along this road. Oh, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, if you would help me gather them, I'd be ever so grateful."},{"name":"SAMIANE","text":"Thank you! Your kindness is truly a blessing from the elementals. The rose hips should be lying on the road between here and the Greatloam Growery. Remember to tread lightly, lest you crush them underfoot!"},{"name":"SAMIANE","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, pray tell me you have recovered all the rose hips and abandoned not one to a traveler's boot!"},{"name":"SAMIANE","text":"Blessings be upon you! I feared this path would be lined with roses next year."},{"name":"SAMIANE","text":"Not that such a wondrous sight would be wholly objectionable, but Azeyma roses are ill-suited to this location. As a botanist, it's my responsibility to see Gridania's plants grow and thrive in the most ideal conditions. A place for every seed and every seed in its place, you might say."},{"name":"SAMIANE","text":"'Twas most gracious of you to aid me in my time of need. I pray the elementals extend you the same kindness."}],"reward":{"gil":111,"xp":110}},"partials":[{"type":"npc","id":"1000300","obj":{"i":1000300,"n":"Samiane","l":53,"q":2}}]}