{"quest":{"name":"Skin in the Game","location":"Gridania","id":65587,"patch":2.0,"sort":250,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"involved":[1000542],"genre":140,"usedItems":[5280],"journal":["Guildmaster Geva appears to be upset. Though it would probably be wiser not to, perhaps you should see what is troubling her.","It would seem that an Ul'dahn merchant named Aymar has set about defaming the guild. He claims that the toad leather he purchased is of inferior quality. Geva intends to resolve the matter with a display of authentic craftsmanship, and bids you craft and present to her a circle of high-quality toad leather.","Your toad leather passes Geva's rigorous inspection. Present it to Aymar at the Carline Canopy, so that he may compare his purchase with an item of confirmed Fen–Yll provenance.","After gazing upon your magnificently crafted toad leather, Aymar realizes that the goods he purchased were not produced by the Leatherworkers' Guild. Return to Geva and reassure her that the guild's good name is not in danger.","Geva is delighted by the surpassing quality of your work─though it sounds as if she was even <span class=\"emphasis\">more</span> delighted by the groveling apology of the Ul'dahn merchant. She is, however, deeply resentful of the unknown “Angrbotha” upstarts who she believes mean to exploit the guild's reputation. You cannot help but shiver when she adds that she would like very much to meet the leatherworker responsible for the whole affair...<br><br>※The next leatherworker quest will be available from Geva upon reaching level 30."],"objectives":["Present a circle of toad leather <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Geva.","Present the toad leather <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Aymar.","Report to Geva."],"dialogue":[{"name":"GEVA","text":"Ohhh, he'll pay! I swear by Louisoix's beard, I'll tear the skin from his─"},{"name":"GEVA","text":"Ahem! <span class=\"highlight\">Forename</span>─it's good that you are here. Listen to this!"},{"name":"GEVA","text":"An Ul'dahn merchant has set about blackening the guild's good name. He <span class=\"emphasis\">claims</span> that some toad leather we sold him is─and I quote─“of inferior quality”!"},{"name":"GEVA","text":"Aye, you heard me─<span class=\"emphasis\">inferior</span>! The gall of the man! I swear to you, I would be the very soul of contrition if his allegations were proven true, but they just seem so...so utterly...unthinkable!"},{"name":"GEVA","text":"Why, he claims the leather was unevenly tanned and still reeking of toad slime! It's clear that whoever made that leather didn't know the first thing about working with toad skin."},{"name":"GEVA","text":"Which means that there's no way in the seven hells that it came from us! Believe me when I tell you, <span class=\"highlight\">Forename</span>, I'll be deep in the cold, hard ground before I permit such shoddy work to bear our name."},{"name":"GEVA","text":"The very <span class=\"emphasis\">thought</span> of some two-gil hide mangler claiming to represent this guild makes me want to... Gaaah!"},{"name":"GEVA","text":"Ahem. <span class=\"emphasis\">Ultimately</span>, it doesn't matter that this isn't our handiwork. If our customers begin to suspect that our standards are slipping, and that we are not showing our materials the proper respect, our good name will be lost, and our many years of hard work will have been for naught."},{"name":"GEVA","text":"We <span class=\"emphasis\">cannot</span> let that happen. Though I am certain we have done no wrong, we need to make this right."},{"name":"GEVA","text":"We'll settle this with a display of authentic craftsmanship. Prepare a circle of high-quality toad leather and bring it to me for inspection. Understood?"},{"name":"SYSTEM","text":"Increasing an item's <span class=\"highlight\">quality</span> during synthesis improves the chance that the resulting product will be of a higher grade (<span class=\"highlight\">HQ</span>)."},{"name":"SYSTEM","text":"To be deleted."},{"name":"GEVA","text":"Prepare a circle of high-quality toad leather and bring it to me immediately. I want this matter resolved as soon as possible."},{"name":"GEVA","text":"Heh heh heh...this will do nicely, <span class=\"highlight\">Forename</span>."},{"name":"GEVA","text":"You clearly understand the unique properties of toad skin and how best to harness them."},{"name":"GEVA","text":"This leather is sturdy, flexible, and completely free of unpleasant odors. "},{"name":"GEVA","text":"There is but one thing left to do."},{"name":"GEVA","text":"I want you to take this toad leather, march down to the Carline Canopy, and shove it in this Aymar's face! Show the impertinent fool what <span class=\"emphasis\">real</span> Fen–Yll quality looks like!"},{"name":"MERCHANT","text":"Completely and utterly unacceptable! Shame on Fen–Yll and their vainglorious claims! &lt;spit&gt; How could anyone call this rubbish “toad leather”!?"},{"name":"MERCHANT","text":"About time one of you charlatans showed up! What is this, more toad leather!? I demanded a full refund, not more of your─"},{"name":"MERCHANT","text":"Your... Wait, is this...?"},{"name":"MERCHANT","text":"By the Twelve, I have never seen such exquisite toad leather! This would make an excellent belt or bag..."},{"name":"MERCHANT","text":"Consigned to oblivion, this tag."},{"name":"MERCHANT","text":"Am I to understand that you are a producer of Fen–Yll goods? ...And you bring this to me...by special order of the legendary Geva herself!? What in the world is the meaning of this?"},{"name":"MERCHANT","text":"...I am most <span class=\"emphasis\">terribly</span> sorry, good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>. When the merchant told me it was Gridanian leather, I naturally assumed that this “Angrbotha” was somehow affiliated with Fen–Yll."},{"name":"MERCHANT","text":"I should have known it was too good to be true. “A fraction of the time, a fraction of the price,” he said. Well, I certainly got what I paid for."},{"name":"MERCHANT","text":"I mean, I had never even heard of Angrbotha before, but <span class=\"emphasis\">everyone</span> knows that Gridania is famous for─"},{"name":"MERCHANT","text":"No, no more excuses. It is my responsibility as a merchant to evaluate the supplier, and my own damn fault that I purchased an inferior product."},{"name":"MERCHANT","text":"Reputation is everything in this world, and I fear I have unjustly besmirched your guild's. And yet, despite all that, the great Geva saw fit to gift me this exquisite leather..."},{"name":"MERCHANT","text":"Well, I too have a reputation to uphold! This gesture cannot go unanswered."},{"name":"MERCHANT","text":"That the guild should be so generous as to correct my misconceptions in this manner is marvelous and humbling in equal measure. You have my word that my partners in Ul'dah will learn of your guild's exemplary service!"},{"name":"GEVA","text":"Excellent work, <span class=\"highlight\">Forename</span>! That bastard Aymar felt so appallingly guilty, he rushed over here to beg my forgiveness in person. I have witnessed some groveling in my time, but his was a truly masterful display! Bowing, stuttering, sniveling─it had it all!"},{"name":"GEVA","text":"Oh, how I wish you had seen it, <span class=\"highlight\">Forename</span>. A proud Ul'dahn merchant, humbled by a circle of toad leather. You've improved more than I thought."},{"name":"GEVA","text":"Now all we have to do is find out who's making this “Angrbotha” dross. Our contrite friend said that he had been told it was a new Gridanian brand, but no one here has heard of it."},{"name":"GEVA","text":"New Gridanian brand... &lt;snort&gt; It's obvious they mean to capitalize on our good name. I'd like to meet the man who made that toad leather..."},{"name":"GEVA","text":"Actually, <span class=\"highlight\">Forename</span>... Should you happen across him on your travels, I'd consider it a personal favor if you would flay the skin from his back and make me a pair of soles, so that I can grind him into the dirt every single day!"}],"reward":{"gil":557,"items":[{"id":2434},{"id":2731,"one":1},{"id":3065,"one":1},{"id":3575,"one":1},{"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":13}],"quests":[65673]},"next":[65597]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000542","obj":{"i":1000542,"n":"Aymar","l":52,"q":1}},{"type":"item","id":"2434","obj":{"i":2434,"n":"Initiate's Awl","l":23,"c":35452,"t":21,"p":1013}},{"type":"item","id":"2731","obj":{"i":2731,"n":"Silver Magnifiers","l":25,"c":40895,"t":34,"p":1314}},{"type":"item","id":"3065","obj":{"i":3065,"n":"Initiate's Gown","l":24,"c":42034,"t":35}},{"type":"item","id":"3575","obj":{"i":3575,"n":"Velveteen Halfgloves","l":24,"c":44027,"t":37,"p":902}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5280","obj":{"i":5280,"n":"Toad Leather","l":26,"c":22001,"t":52}},{"type":"quest","id":"65673","obj":{"i":65673,"n":"Aldgoat Everything","g":140,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"65597","obj":{"i":65597,"n":"Toadskins of the Father","g":140,"l":"Gridania","s":300,"f":1}}]}