{"quest":{"name":"Spear of the Fearless","location":"Gridania","id":65583,"patch":2.0,"sort":50,"icon":100057,"unlocksFunction":1,"eventIcon":71341,"issuer":1000254,"target":1000254,"involved":[1000251],"genre":130,"journal":["Guildmaster Ywain would teach you the meaning of courage.","Guildmaster Ywain bids you go to the Central Shroud and slay riverbank yarzons. Use the sack of foul-smelling bait he has provided to lure the creatures from their nest.","You have successfully defeated the riverbank yarzons. Report back to Ywain at the Lancers' Guild.","Upon returning to the guild, Ywain bids you slay unspecified fiends in the Central Shroud. Investigate three collapsed pillars near Spirithold, and put down whatever creatures appear.","You have successfully defeated the creatures at the collapsed pillars. Report back to Jillian at the Lancers' Guild.","Back at the guild, you encounter a mysterious lancer who seems intent on acquainting you with the dangerous end of his spear. Just when it seems that bloodshed is inevitable, the unknown intruder chooses to withdraw, leaving you to ponder his parting words. Perhaps Ywain can shed some light on this incident.","According to Ywain, it is not uncommon for rogue lancers to challenge members of the guild. He tells you to pay the uninvited guest no further heed, and to focus instead on preparing for the coming trial.<br><br>※The next lancer quest will be available from Ywain upon reaching level 10."],"objectives":["Use foul-smelling bait to lure out riverbank yarzons and slay them.","Report to Ywain at the Lancers' Guild.","Slay the creatures at the collapsed pillars.","Report to Jillian at the Lancers' Guild.","Speak with Ywain."],"dialogue":[{"name":"YWAIN","text":"Ah, you have returned. I take from your presence that you have gained a measure of familiarity with your weapon. Good. You are ready to begin the next phase of your training."},{"name":"YWAIN","text":"You will recall my telling you that it takes no small amount of courage to be a lancer. Now, in general terms, “courage” is the strength to do something which one finds unnerving."},{"name":"YWAIN","text":"However, a lancer's notion of courage is not so simple. Having first drawn a distinction between courage and recklessness, he then divides the former into two aspects. I would have you learn each with spear in hand."},{"name":"YWAIN","text":"The first is <span class=\"emphasis\">composure</span>."},{"name":"YWAIN","text":"When outnumbered in battle, a lancer may lose his composure and succumb to panic. Should this happen, all of his training will swiftly flee his mind, and he will struggle to overcome opponents whom he would ordinarily have bested with ease. He will, in short, contribute to his own defeat."},{"name":"YWAIN","text":"If you wish to become a lancer in sooth, you must learn to maintain your composure at all times. Do this and you will be able to call upon every onze of your strength and skill when it matters most. And so to your first task..."},{"name":"YWAIN","text":"The riverbanks of the Central Shroud are home to vilekin known as yarzons. Fiercely territorial, the creatures will attack anyone who strays too close, making them the bane of fisherfolk."},{"name":"YWAIN","text":"They typically fall upon their prey en masse, barring all avenues of escape before closing in for the kill."},{"name":"YWAIN","text":"What must go through the mind of their victim in that instant? Panic? Despair? Be sure to tell me upon your return. Needless to say, I would have you brave such an encounter. Take this sack of decidedly noisome bait, and use it to lure the ever-ravenous creatures out of their nest."},{"name":"YWAIN","text":"It may be that only one curious yarzon appears, but what if two or three follow the scent...? Let us see how you fare then."},{"name":"YWAIN","text":"Go now, my young lancer, and learn what it means to fight with composure."},{"name":"YWAIN","text":"Welcome back, <span class=\"highlight\">Forename</span>, and well done. I trust you now understand that in times of direst need, no amount of strength or skill with a spear will avail the lancer who lacks composure."},{"name":"YWAIN","text":"You are now ready to learn the second aspect of a lancer's courage: resolve."},{"name":"YWAIN","text":"When faced with a terrible foe, a lancer may succumb to fear and self-doubt. Should this happen, he will become defensive, and in seeking to cover his weakness, surrender his greatest strength─namely, his capacity to attack."},{"name":"YWAIN","text":"A lancer who fears to attack is naught but a man holding a pole. His spear may as well be a broomstick for all the good it would do him. It is not and will never be a shield."},{"name":"YWAIN","text":"That you may learn the truth of my words firsthand, I bid you go to the Central Shroud, to an area adjoining the abandoned dungeon known as Spirithold."},{"name":"YWAIN","text":"Since the Calamity, that neck of the Twelveswood has become a veritable menagerie of fearsome fauna."},{"name":"YWAIN","text":"There you will find three collapsed pillars, which have become a haunt for fell creatures. You are to put them down."},{"name":"YWAIN","text":"Hm? What manner of fiends can you expect to encounter? Hah! To reveal <span class=\"emphasis\">that</span> would be to defeat the purpose of the lesson, my young lancer."},{"name":"YWAIN","text":"I will say only this: if you face these foes with a lancer's resolve, you will surely emerge the victor."},{"name":"YWAIN","text":"Once you have completed the trial, pray report to Jillian in the entrance hall."},{"name":"YWAIN","text":"She has grasped the two aspects of courage, albeit with some trouble. Though I doubt you will encounter similar difficulties, her struggle has furnished her with certain insights which I think you would benefit from hearing."},{"name":"YWAIN","text":"A lancer learns best when he is doing, aye, but the wisdom of his seniors is not entirely without worth. Go now, <span class=\"highlight\">Forename</span>, and do as I bid you."},{"name":"JILLIAN","text":"I have been expecting you, <span class=\"highlight\">Forename</span>. By your return, I trust you now understand the importance of resolve."},{"name":"JILLIAN","text":"Like one's flesh, courage can be made strong. It is a matter of training each of its aspects."},{"name":"JILLIAN","text":"Now, the endeavor may prove difficult in the beginning─gods know how much <span class=\"emphasis\">I</span> struggled. You may suffer untold humiliation and more frustration than you can bear...but you must persevere."},{"name":"JILLIAN","text":"Whenever you engage an opponent, whether in training or in earnest, make a conscious effort to fight with composure and resolve. Over time, doing so will become second nature, and you will acquire such courage as you never thought could be yours."},{"name":"JILLIAN","text":"Mind you, not all battles entail a physical clash of might. It could simply be a disagreement born of a conflict in ideology."},{"name":"JILLIAN","text":"The point is, it matters not what battlefield you stand upon. So long as you take care to be composed and resolute, your courage will grow."},{"name":"JILLIAN","text":"...Did that make any sense? Even a little? I fear I cannot hold a candle to Guildmaster Ywain, but if there is aught I can do to assist in your training─"},{"name":"JILLIAN","text":"What was that? Something is afoot in the training area..."},{"name":"FOULQUES","text":"(-???-)And you call yourselves lancers? Pathetic..."},{"name":"FOULQUES","text":"(-???-)You are next, Guildmaster. Arm yourself and face me."},{"name":"FOULQUES","text":"(-???-)Refuse, and all will know that you are no true lancer."},{"name":"YWAIN","text":"Say what you will. I am above provocation."},{"name":"FOULQUES","text":"(-???-)Hmph... Craven to the last man..."},{"name":"FOULQUES","text":"(-???-)Ah, but what have we here?"},{"name":"YWAIN","text":"Wait. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is but a novice."},{"name":"FOULQUES","text":"(-???-)That makes no odds to me. You yourself admitted <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to your ranks, did you not?"},{"name":"FOULQUES","text":"(-???-)Very well. I shall withdraw for now."},{"name":"FOULQUES","text":"(-???-)Yet know that only the fearless are fit to wear the mantle of lancer."},{"name":"FOULQUES","text":"(-???-)I look forward to measuring your worth in the days to come."},{"name":"YWAIN","text":"There is naught more to see. Return to your drills!"},{"name":"YWAIN","text":"<span class=\"highlight\">Forename</span>. You made no attempt to evade his thrust."},{"name":"YWAIN","text":"Did your opponent so unnerve you as to deprive you of your senses?"},{"name":"YWAIN","text":"Well, it is of little consequence now."},{"name":"YWAIN","text":"You need pay no further heed to our uninvited guest. Lest you wonder, it is not uncommon for challengers to come pounding on our door, seeking to test their mettle."},{"name":"YWAIN","text":"For now, dedicate yourself to tempering the two aspects of courage: the composure to bring the sum of your strength and skill to bear against your foes..."},{"name":"YWAIN","text":"...and the resolve to attack when fear would stay your hand, as befits a lancer."},{"name":"YWAIN","text":"When next we meet, I shall have another trial for you─one that will put your courage to the test."},{"name":"YWAIN","text":"Until then, continue to apply yourself to your training. Farewell, <span class=\"highlight\">Forename</span>."},{"name":"POP","text":"You feel a ravenous gaze!"}],"reward":{"items":[{"id":1820},{"id":3006,"one":1},{"id":2653,"one":1},{"id":3530,"one":1},{"id":27634,"one":1},{"num":5,"id":5823,"one":1}],"xp":560},"reqs":{"jobs":[{"lvl":5,"id":5}],"questsType":"any","quests":[65559,65754]},"next":[65571,65679]},"partials":[{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000251","obj":{"i":1000251,"n":"Jillian","l":53,"q":5,"t":"Guild Receptionist"}},{"type":"item","id":"1820","obj":{"i":1820,"n":"Bone Harpoon","l":5,"c":31810,"t":5,"p":212}},{"type":"item","id":"3006","obj":{"i":3006,"n":"Custom-made Scale Mail","l":6,"c":43170,"t":35,"p":100}},{"type":"item","id":"2653","obj":{"i":2653,"n":"Leather Eyepatch","l":5,"c":40914,"t":34,"p":141}},{"type":"item","id":"3530","obj":{"i":3530,"n":"Fingerless Leather Gloves","l":5,"c":44060,"t":37,"p":126}},{"type":"item","id":"27634","obj":{"i":27634,"n":"Altered Thighboots","l":5,"c":49077,"t":38}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"quest","id":"65559","obj":{"i":65559,"n":"Way of the Lancer","g":130,"l":"Gridania","s":11,"f":1}},{"type":"quest","id":"65754","obj":{"i":65754,"n":"My First Spear","g":130,"l":"Gridania","s":12,"f":1}},{"type":"quest","id":"65571","obj":{"i":65571,"n":"Courage of Stone","g":130,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65679","obj":{"i":65679,"n":"Courage of Stone","g":130,"l":"Gridania","s":100,"f":1}}]}