{"quest":{"name":"Li'l Rascals","location":"Mor Dhona","id":65586,"patch":3.0,"sort":101,"icon":100487,"eventIcon":71221,"issuer":1009813,"target":1009813,"involved":[1001304,1006530,1009812,1009814,1009815,1009816,1009823,1009824,1009825,1009826],"genre":81,"journal":["Yozan is in the mood for another adventure.","It seems Yozan hoped your appearance would signal the start of a new quest. However, since you have not heard anything worth investigating, the boy bids all the Doman Adventurers' Guild spread out, and see what they can learn from the passing travelers. Rokka stops briefly to ask that you enjoin Rhesh Polaali to stay safe. See to it that the message is passed along.","Rhesh Polaali is thankful to learn that Rokka has received the earrings. However, the former Crystal Brave has heard worrying tidings. It seems a valuable grimoire was stolen from Rowena's establishment, and a witness saw four short people around the time of the crime. As such, the Adventurers' Guild suspects that the Doman children may have played a part in the theft. Unwilling to believe they had anything to do with it, Rhesh Polaali bids you intercede on their behalf with Slafborn.","Slafborn confirms what Rhesh Polaali has told you. The Adventurers' Guild is indeed investigating the children in relation to the theft. While Slafborn himself doubts they would be capable of such, the facts nevertheless do point in the Domans' direction. Knowing that you are a friend to the younglings, he asks that you speak with them on the guild's behalf. Locate the four children, and ascertain what they know.","After combing Revenant's Toll, you find and speak to the children, each of whom is shocked by the accusation. Return to the usual meeting place of the Doman Adventurers' Guild, and see how Yozan wishes to proceed.","Yozan believes that the children ought to plead their case to Slafborn. However, as an adventurer he thinks they ought first find proof of their innocence. To do this, they must discover who the criminals are. Rokka supposes that they are Lalafells, and Koharu realizes she has seen a gang of four recently come to town. With this in mind, Yozan begins to plan. Speak with him again to get down to the nitty-gritty of the investigation."],"objectives":["Speak with Rhesh Polaali.","Speak with Slafborn.","Find the Doman children.","Speak with Yozan."],"dialogue":[{"name":"YOUZAN","text":"Hello, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>. Have you found us another quest?"},{"name":"YOUZAN","text":"Oh. I was hoping... Well, no matter─we Doman adventurers can find our own!"},{"name":"YOUZAN","text":"Everyone, go and see what the travelers are talking about. Any rumors of more treasure we could hunt, or giant demons we could slay, or whatever!"},{"name":"YOUZAN","text":"We just need to find something good. Then, we'll head off on another quest with our trusty advisor in tow!"},{"name":"ROKKA","text":"Hey, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>, could you tell Miss Rhesh to be careful, please? She was badly hurt, and she shouldn't push herself too hard."},{"name":"KOHARU","text":"I enjoyed our last adventure. But Yozan wants to do more. And so do I!"},{"name":"SHIUN","text":"I'm glad we didn't find a vengeful spirit last time, but I wanted to watch you fight something. Yozan talks about how good you are a lot."},{"name":"ROKKA","text":"It's true we didn't find gold or silver. But none of us got eaten, either."},{"name":"RHESHPOLAALI","text":"Why hello, <span class=\"highlight\">Forename</span>! Did you ever find Rokka?"},{"name":"RHESHPOLAALI","text":"Oh good, I'm glad she got her earrings back. I would like to thank her in person someday, though─she's such a sweet little thing. My daughter could learn a thing or two from her."},{"name":"RHESHPOLAALI","text":"Oh, but have you heard the news? There's been a theft, and they think children are behind it! The Adventurers' Guild has even begun an official investigation."},{"name":"RHESHPOLAALI","text":"I'm not privy to the details, but I do know the Doman younglings are under suspicion. I can't imagine they would turn to crime, though! Wouldn't you agree?"},{"name":"RHESHPOLAALI","text":"It's got to be a big misunderstanding. I've half a mind to speak to Slafborn on the children's behalf. &lt;sigh&gt; If only my word carried any weight... "},{"name":"RHESHPOLAALI","text":"Forgive me, but could you look into this? You have shown yourself a steadfast friend of the Domans─I trust that you will handle it nicely."},{"name":"SLAFBORN","text":"Well met, my friend. Have you come to discuss more tales of treasure?"},{"name":"SLAFBORN","text":"You've caught wind of that, eh? The Adventurers' Guild is still investigating the facts, but aye, an aged grimoire of great value was stolen from Rowena's establishment. "},{"name":"SLAFBORN","text":"The storeroom door was locked at the time, but we have found evidence that a window covering was removed. There is little doubt in my mind that is how our thieves entered."},{"name":"SLAFBORN","text":"The opening itself is quite small, however. Only someone slight of frame, like a child, could pass through it. And I have a witness who saw four short people loitering outside the store─as the Doman children are wont to."},{"name":"SLAFBORN","text":"Though I am loath to suspect them, the children fit the profile of our suspects. And crimes oft begin as small dares or games, after all."},{"name":"SLAFBORN","text":"But in truth, I am more worried about the potential backlash against the Domans. They fit in well amongst the other refugees, but this offense would not reflect well upon them."},{"name":"SLAFBORN","text":"Rowena is of the same mind, and has agreed to keep the theft quiet. I've entrusted the investigation to my most dependable men as well."},{"name":"SLAFBORN","text":"Could I ask you to aid us by speaking with the children? You seem close to them, and I fear my armed men would only frighten them away."},{"name":"YOUZAN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>? Does this mean you've found us a quest?"},{"name":"YOUZAN","text":"What? Of course we didn't steal anything! We're adventurers, not thieves! I'd better call the guild together, and quickly!"},{"name":"KOHARU","text":"I just heard adventurers talking about a detective who can get to the bottom of any case. I want to meet him!"},{"name":"KOHARU","text":"We're suspects!? Hmmm... This sounds like a case for Koharu─inspectress extraordinaire!"},{"name":"SHIUN","text":"What are these people always looking at? I want to see!"},{"name":"SHIUN","text":"I-I'm not a criminal! And neither's Yozan, or Rokka, or Koharu!"},{"name":"ROKKA","text":"I thought I'd hear something interesting here. But I was wrong. They're all just so sad..."},{"name":"ROKKA","text":"Of <span class=\"emphasis\">course</span> we didn't steal anything! Someone else is to blame─someone else small like us. But who? We have to talk this over!"},{"name":"SLAFBORN","text":"I hope the Doman children are innocent, but I would ask you bring them in if they are not."},{"name":"ROWENA","text":"Hm? Bloody hells, isn't there <span class=\"emphasis\">anythin'</span> you don't hear about? Well, I'm o' the mind the children ain't thieves. But they don't look innocent right now, either."},{"name":"YOUZAN","text":"We're being accused of something we didn't do! Before this can go any further, we have to tell Mister Slafborn!"},{"name":"YOUZAN","text":"...Well, we can't just <span class=\"emphasis\">say</span> we're innocent, though. We have to clear our names, by finding that grimoire and learning who took it!"},{"name":"YOUZAN","text":"We may be young, but we can show everyone we're proper adventurers─by protecting our friends and punishing the wicked!"},{"name":"SHIUN","text":"But how do we find the real criminals? All we know is that there were four people about as tall as us."},{"name":"ROKKA","text":"But that's just it─there <span class=\"emphasis\">are</span> plenty of others smaller than us who aren't children!"},{"name":"YOUZAN","text":"...Lalafells!"},{"name":"KOHARU","text":"Four of them... I may've seen them."},{"name":"KOHARU","text":"See, I like to watch all the different people who come through here."},{"name":"KOHARU","text":"And I've only seen one group of four Lalafells, and they just got here the other day."},{"name":"KOHARU","text":"Yozan, you remember the cart Slafborn caught you trying to sneak into? They're the ones who own it!"},{"name":"YOUZAN","text":"I <span class=\"emphasis\">thought</span> they were Lalafells. Now we can begin the real investigation─by looking into them!"},{"name":"KOHARU","text":"I'll get to the bottom of this! I'm Koharu─inspectress extraordinaire!"},{"name":"SHIUN","text":"Koharu's acting weird... I'll just have to figure out why later."},{"name":"ROKKA","text":"Yozan's got a good plan─I can see it in his eyes."}],"reward":{"gil":605,"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"questsType":"all","quests":[67168,65581]},"next":[65636]},"partials":[{"type":"npc","id":"1009813","obj":{"i":1009813,"n":"Yozan","l":67,"q":4}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1009812","obj":{"i":1009812,"n":"Rhesh Polaali","l":67,"q":2}},{"type":"npc","id":"1009814","obj":{"i":1009814,"n":"Koharu","l":67,"q":4}},{"type":"npc","id":"1009815","obj":{"i":1009815,"n":"Shiun","l":67,"q":4}},{"type":"npc","id":"1009816","obj":{"i":1009816,"n":"Rokka","l":67,"q":4}},{"type":"npc","id":"1009823","obj":{"i":1009823,"n":"Yozan","l":67,"q":1}},{"type":"npc","id":"1009824","obj":{"i":1009824,"n":"Koharu","l":67,"q":1}},{"type":"npc","id":"1009825","obj":{"i":1009825,"n":"Shiun","l":67,"q":1}},{"type":"npc","id":"1009826","obj":{"i":1009826,"n":"Rokka","l":67,"q":1}},{"type":"quest","id":"67168","obj":{"i":67168,"n":"A Brave Resolution","g":3,"l":"Ul'dah","s":53}},{"type":"quest","id":"65581","obj":{"i":65581,"n":"Toll Booty","g":81,"l":"Mor Dhona","s":100}},{"type":"quest","id":"65636","obj":{"i":65636,"n":"Short Arms of the Law","g":81,"l":"Mor Dhona","s":102}}]}