{"quest":{"name":"Back and Fourth","location":"Ul'dah","id":65589,"patch":2.4,"sort":59,"eventIcon":71201,"issuer":1009961,"target":1010078,"involved":[1009112,1009962,1009964,1009966,1009967,1009969,1009971,1010535],"genre":2,"journal":["Ilberd is eager to continue his investigation into the Garlean spy known as the Ivy.","With Raubahn now informed of the Garlean spy in his midst, your business in Ul'dah is concluded. Accompany Ilberd back to the Rising Stones and report to Alphinaud.","Upon returning to the Rising Stones, Alphinaud informs you that a unit of Crystal Braves was ambushed by Garlean forces during your absence. Worse, it seems that one of the unit's members was captured and taken to Castrum Centri. With no time to form a rescue party, Ilberd asks that you lead a mission to free the prisoner. Make your way to the Tangle, by the entrance to the imperial stronghold, and receive further instructions from Alianne.","Alianne fears that her wounded comrade may not survive the rough treatment of her Garlean captors. Accompany her and the 4th Unit as they infiltrate Castrum Centri, and find Crystal Brave Rhesh Polaali.","You find Rhesh Polaali alive, but in no condition to move unaided. Seeing this, Alianne asks you to create a diversion, that her comrade might be borne away unmolested. Make your way around the castrum, striking down any imperial forces you encounter, and thereby ensuring that all eyes are on you.","You have wreaked considerable havoc within Castrum Centri, hopefully affording the 4th Unit a chance to bear away their wounded comrade. Head outside the stronghold and search for Alianne.","You are relieved to find that Alianne and the others made it to safety. Return to the Rising Stones and report the mission's success to Alphinaud.","Back at the Rising Stones, Alphinaud and Ilberd take turns congratulating you on the success of the rescue mission. You have little time to glory in your triumph, however, as Alphinaud goes on to reveal that your work for him is not yet done. It is time to set down your weapon and don the hat of diplomacy, for your presence has been requested at a meeting with an Ishgardian dignitary..."],"objectives":["Speak with Alphinaud at the Rising Stones.","Speak with Alianne in the Tangle.","Find Rhesh Polaali in Castrum Centri.","Defeat imperial troops who appear at specified locations in Castrum Centri.","Speak with Alianne in the Tangle.","Report to Alphinaud at the Rising Stones."],"dialogue":[{"name":"ILBERD","text":"Our hunt for the Ivy begins in earnest, Scion."},{"name":"ILBERD","text":"Suffice it to say, we must tread warily. But one misstep may well cost us our lives."},{"name":"ILBERD","text":"Our business here is concluded for the time being. Let us return to the Rising Stones and report to Commander Leveilleur."},{"name":"ILBERD","text":"Our business here is concluded for the time being. Let us return to the Rising Stones and report to Commander Leveilleur."},{"name":"ILBERD","text":"We are returned from Ul'dah, Commander."},{"name":"ALPHINAUD","text":"And not a moment too soon. Something has happened."},{"name":"ILBERD","text":"Trouble?"},{"name":"ALPHINAUD","text":"You will recall that the 4th was tasked with reconnoitering the rendezvous site used by the Ivy's minion and his imperial contacts. Soon after you left, we received word that the unit was ambushed en route to its destination."},{"name":"ILBERD","text":"Gods damn it..."},{"name":"ALPHINAUD","text":"According to the report, one of ours has been taken captive. The Garleans are not wont to treat their foemen with dignity, and I have grave fears for her safety."},{"name":"ALPHINAUD","text":"We must dispatch a rescue party at once. Recall those Braves who are afield."},{"name":"ILBERD","text":"Begging your pardons, Commander, but we have not the time."},{"name":"ILBERD","text":"I'm afraid I must ask for your aid once more, Scion."},{"name":"ILBERD","text":"An ill-prepared rescue party will only serve to provide the Garleans with more captives, yet time is of the essence. Simply put, you are the best chance we have."},{"name":"ALPHINAUD","text":"Captain Ilberd has the right of it. I trust you are willing? But of course you are. Now, Alianne of the 4th lies in wait in the Tangle, near the entrance to Castrum Centri. Seek her out, and she will apprise you of the situation."},{"name":"ALPHINAUD","text":"Alianne of the 4th lies in wait in the Tangle, near the entrance to Castrum Centri. Seek her out, and she will apprise you of the situation."},{"name":"ILBERD","text":"You are the best chance we have of rescuing our comrade. I shall pray for your success."},{"name":"CRYSTALSOLDIER00053","text":"Hang in there, Rhesh... We'll free you yet..."},{"name":"ALIANNE","text":"...You would aid us in the rescue mission? We are in your debt, Warrior of Light! Now, time is against us, so allow me to brief you on the situation."},{"name":"ALIANNE","text":"The Garleans fell upon us without warning, wounding poor Rhesh and hauling her away to the castrum yonder. Outnumbered as we were, it was all we could do to flee and regroup."},{"name":"ALIANNE","text":"Even as we speak, the Garleans may be interrogating Rhesh...or worse. With her hurts, I fear that she will not long survive their attentions. We must rescue her without delay."},{"name":"ALIANNE","text":"Our order may yet be in its infancy, but the bond that binds us is strong as mythril. None of us will stand by while a comrade suffers."},{"name":"ALIANNE","text":"We, the remnants of the 4th, will infiltrate Castrum Centri. Please help us find Rhesh before it is too late!"},{"name":"RHESHPOLAALI","text":"Unnngh... Wh-Where am I...?"},{"name":"ALIANNE","text":"Rhesh! Thank the gods we found you!"},{"name":"ALIANNE","text":"And thank <span class=\"emphasis\">you</span>, Warrior of Light!"},{"name":"ALIANNE","text":"Now, to quit this accursed place... Rhesh cannot move with those wounds. She will need to be carried out. I believe a diversion is in order. Might we trouble you to provide one? Given your reputation, I suspect the Garleans will be only too happy to grant you their undivided attention."},{"name":"ALIANNE","text":"If you were to create a commotion within the castrum, we should be able to steal away unnoticed. Let us speak again once we are safely outside these walls."},{"name":"RHESHPOLAALI","text":"Th-Thank you..."},{"name":"ALIANNE","text":"Rhesh cannot move with those wounds. She will need to be carried out. And for that to work, we will require some manner of diversion."},{"name":"ALIANNE","text":"If you were to create a commotion within the castrum, we should be able to steal away unnoticed. Let us speak again once we are safely outside these walls."},{"name":"CRYSTALSOLDIER00053","text":"Let's get out of here!"},{"name":"ALIANNE","text":"I have awaited your return most anxiously, my friend. You have done us a great service indeed. Thanks to your aid, our comrade Rhesh is safe, and we suffered no further casualties. Words cannot well express my gratitude."},{"name":"ALIANNE","text":"All that is left is to report the mission's success to Commander Leveilleur. I shall go on ahead to the Rising Stones."},{"name":"ALPHINAUD","text":"Ah, it does me well to see you thus returned. Though I doubt not your prowess, entering an enemy stronghold is generally considered to be a risky venture, and I must confess to having been a trifle anxious."},{"name":"ALPHINAUD","text":"But here you are, hale and whole, having succeeded in your mission as is your wont."},{"name":"ALPHINAUD","text":"Lest you wonder, the woman you rescued is being cared for by the Domans. Thanks to their expert ministrations, the danger is past. You have my gratitude, <span class=\"highlight\">Forename</span>."},{"name":"ILBERD","text":"Allow me to thank you also, Scion. Rhesh owes you her life."},{"name":"ALPHINAUD","text":"We escaped with minimal casualties this time, but we can ill afford to be caught off guard again. The Empire is not an opponent to be trifled with."},{"name":"ILBERD","text":"As you say, Commander. I will see to it that the men keep their wits about them."},{"name":"ILBERD","text":"And it may yet take time, but I will not rest until we have identified and apprehended the Ivy."},{"name":"ALPHINAUD","text":"I have every confidence that you will succeed, Captain."},{"name":"ALPHINAUD","text":"As for you, <span class=\"highlight\">Forename</span>─I realize you have scarce caught your breath, but I'm afraid there is no rest for the weary. I require that you accompany me to Coerthas."},{"name":"ALPHINAUD","text":"I have been granted an audience with an Ishgardian dignitary, you see, and the man expressly requested your presence."},{"name":"ALPHINAUD","text":"Oh, do not look so surprised. You should be familiar with the trappings of fame by now. We shall depart as soon as you are ready."},{"name":"ACCESS","text":"There are more pressing matters at hand!"},{"name":"BALLOON","text":"Come for the maiden fair, eh?"},{"name":"BALLOON","text":"Intruder detected!"},{"name":"BALLOON","text":"You'll not leave this place alive!"},{"name":"BALLOON","text":"Sound the alarm!"},{"name":"BALLOON","text":"All units, engage and destroy!"}],"reward":{"gil":2000,"items":[{"id":7322,"one":1},{"id":7332,"one":1},{"id":7342,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65588]},"next":[65590]},"partials":[{"type":"npc","id":"1009961","obj":{"i":1009961,"n":"Ilberd","l":40,"q":1}},{"type":"npc","id":"1010078","obj":{"i":1010078,"n":"Alphinaud","l":481,"q":3}},{"type":"npc","id":"1009112","obj":{"i":1009112,"n":"Alianne","l":67,"q":1}},{"type":"npc","id":"1009962","obj":{"i":1009962,"n":"Alianne","l":67,"q":1}},{"type":"npc","id":"1009964","obj":{"i":1009964,"n":"4th Unit Brave","l":67,"q":1}},{"type":"npc","id":"1009966","obj":{"i":1009966,"n":"Rhesh Polaali","l":67,"q":1}},{"type":"npc","id":"1009967","obj":{"i":1009967,"n":"Alianne","l":67,"q":1}},{"type":"npc","id":"1009969","obj":{"i":1009969,"n":"4th Unit Brave","l":67,"q":1}},{"type":"npc","id":"1009971","obj":{"i":1009971,"n":"Rhesh Polaali","l":67,"q":1}},{"type":"npc","id":"1010535","obj":{"i":1010535,"n":"Ilberd","l":481,"q":1}},{"type":"item","id":"7322","obj":{"i":7322,"n":"Auroral Bracers","l":110,"c":44258,"t":37}},{"type":"item","id":"7332","obj":{"i":7332,"n":"Daystar Gloves","l":110,"c":44256,"t":37}},{"type":"item","id":"7342","obj":{"i":7342,"n":"Evenstar Gloves","l":110,"c":44254,"t":37}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65588","obj":{"i":65588,"n":"Traitor in the Midst","g":2,"l":"The Rising Stones","s":58}},{"type":"quest","id":"65590","obj":{"i":65590,"n":"Coming to Terms","g":2,"l":"The Rising Stones","s":60}}]}