{"quest":{"name":"I Am Millicent, Hear Me Roar","location":"Gridania","id":65585,"patch":2.0,"sort":10,"eventIcon":71221,"issuer":1000788,"target":1000429,"genre":92,"journal":["Duimessand has need of an adventurer to deliver a message.","Duimessand, a sentry stationed in northern Gridania, is long overdue to be relieved. However, his superior Millicent has yet to send a replacement. Seek her outside the Leatherworkers' Guild before Duimessand collapses from exhaustion.","Duimessand warned you about Millicent's temper, but nothing could prepare you for the verbal barrage she delivered in response to his message. It seems Duimessand's watch has just begun..."],"objectives":["Speak with Millicent."],"dialogue":[{"name":"DUIMESSAND","text":"You there, adventurer! Could you deliver a message for me?"},{"name":"DUIMESSAND","text":"My superior, Millicent, is stationed outside Atelier Fen–Yll. She's doubtless busy, but I'm past due to be relieved."},{"name":"DUIMESSAND","text":"Long past due, truth be told. However, I can't simply abandon my post."},{"name":"DUIMESSAND","text":"Speak to her for me, would you? But choose your words wisely─she has a bit of a temper."},{"name":"MILLICENT","text":"What's all this about? Duimessand says he needs his break?"},{"name":"MILLICENT","text":"The <span class=\"emphasis\">nerve</span> of that snivelin' little shite, cryin' for relief at a time like this! Has he already forgotten how shorthanded we are since that business with the Ixal the other day!?"},{"name":"MILLICENT","text":"And sendin' a bloody unknown 'venturer to do his bleatin' no less! That self-servin' sod thinks only of his own woes, rubbin' his sore soles while welcomin' all manner of gil-grabbin' 'venturers into our holy wood. Useless bloody fool!"},{"name":"MILLICENT","text":"Makes me blood boil, it does! ...Ah, but it's not you I should be givin' a piece of me mind to─you seem a decent enough sort, considerin'... Still, understand that it's our duty to keep an eye on <span class=\"emphasis\">every</span> stranger that passes through these parts."},{"name":"MILLICENT","text":"Anyroad, I appreciate you lendin' an ear to my subordinate, damn fool that he is. Go on then, and stay out of trouble."}],"reward":{"items":[{"num":5,"id":4551}],"xp":50}},"partials":[{"type":"npc","id":"1000788","obj":{"i":1000788,"n":"Duimessand","l":53,"q":2}},{"type":"npc","id":"1000429","obj":{"i":1000429,"n":"Millicent","l":53,"q":1}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}}]}