{"quest":{"name":"Alisaie's Path","location":"Northern Thanalan","id":65580,"patch":2.4,"sort":6,"icon":100315,"unlocksFunction":1,"eventIcon":71341,"issuer":1009777,"target":1009771,"involved":[1009776],"genre":14,"journal":["Alisaie would bring the tale of the Seventh Umbral Calamity to a close.","Having banished the elder primal Bahamut to the aether, you and the Leveilleur twins are transported back to Dalamud's Talons in northern Thanalan. Make your way to the Ceruleum Processing Plant, and report the mission's success to Urianger.","If anything, Urianger seems more relieved at your safe return than glad of your victory─though it is indeed a proud achievement. Thanks to you, Bahamut is no more, and with all his worshipers eliminated, the primal shall never again return to threaten the realm. As Alphinaud and Urianger embark on their diplomatic mission to conceal the truth of the Calamity, Alisaie bids you accompany her to the Burning Wall in eastern Thanalan. Having offered a prayer to all those who lost their lives at the start of the Seventh Umbral Era, Alisaie declares that she will embark on a journey to find her own reason to fight for the realm. Inspired by your fine example, she pledges to help those in need, and grow stronger in so doing."],"objectives":["Report to Urianger at the Ceruleum Processing Plant."],"dialogue":[{"name":"ALISAIE","text":"And here we are again. After that descent into darkness, the desolation of northern Thanalan seems paradisal."},{"name":"ALISAIE","text":"As promised, I shan't reveal the truth of the Calamity to a single soul. However, the nations of Eorzea will require certain assurances that the threat of a new primal is gone."},{"name":"ALISAIE","text":"Kept in the dark overlong, 'tis only a matter of time before they seek answers of their own accord. Let us recommend that the fragments of Dalamud are sealed off, that the truth may rest undisturbed."},{"name":"ALISAIE","text":"But first, we must go and report to Urianger. It would not do to keep him in suspense. I daresay we shall find him pacing up and down at the Ceruleum Processing Plant."},{"name":"ALPHINAUD","text":"In spite of your presence, I must confess that there were moments when I feared the worst. But in the end, you plucked us from the flames and bore us safe unto victory─just as you always have. As for Alisaie...I have never been more proud to call her my sister."},{"name":"ALISAIE","text":"Let us go to the Ceruleum Processing Plant and report to Urianger. It would not do to keep him in suspense."},{"name":"URIANGER","text":"Ah, the Warrior of Light returneth undimmed from the depths of darkness..."},{"name":"URIANGER","text":"By thy triumphant bearing, I take it thou hast succeeded in thy mission. And yet thou art alone... Mistake me not, dear friend─full glad am I of thy safe return─but where, pray, are Master Alphinaud and Mistress Alisaie?"},{"name":"ALPHINAUD","text":"Here, my friend. Forgive us our lateness─we took the scenic route."},{"name":"ALISAIE","text":"Bahamut is no more. The realm is safe."},{"name":"URIANGER","text":"&lt;gasp&gt; By the heavens! Look at you!"},{"name":"URIANGER","text":"What horrors your young eyes must have seen! What suffering your young bodies must have borne!"},{"name":"URIANGER","text":"Pray tell me─where are you hurt? Your wounds must needs be cleansed and dressed at once! I shall make for you a poultice which draweth out─"},{"name":"ALISAIE","text":"Be at ease, my friend! We are hale and whole, I assure you!"},{"name":"ALISAIE","text":"We took a few tumbles, but the worst of our hurts are healed. I believe we have Grandfather to thank for that."},{"name":"URIANGER","text":"Master Louisoix? ...Then you met with him once more? But wherefore should Bahamut's thrall seek to ease your suffering?"},{"name":"ALISAIE","text":"I promise to reveal all to you in due course, dear friend. But first, there is a matter which requires our immediate attention."},{"name":"ALISAIE","text":"Now that Bahamut is defeated, we deem it best to bar entry to all of the fragments of Dalamud."},{"name":"ALISAIE","text":"To this end, we will convince the nations' leaders that the danger is past, and invite their cooperation in ensuring that the fragments are never again disturbed. Come, let us depart and seek an audience with them forthwith."},{"name":"ALPHINAUD","text":"A moment, Sister. You need not burden yourself with this task. Urianger and I will more than suffice. Might you not take this opportunity to rest? The gods know you have earned it."},{"name":"ALISAIE","text":"But I am fine, Brother. Besides, you have been through as much as I have."},{"name":"ALISAIE","text":"...Oh, I see now! You would play your game of diplomacy, and wish me out of the way!"},{"name":"ALPHINAUD","text":"N-No, I... Naught could be further from the truth, Alisaie."},{"name":"URIANGER","text":"My lady, 'tis mine earnest belief that your brother hath your best interests at heart. You have more than done your part, and he desireth but to relieve you of a burden he might easily bear alone."},{"name":"ALPHINAUD","text":"I have some experience treating with dignitaries, you must allow. And as you never fail to remind me of my fondness for diplomacy, I feel it only right that I remind you of your aversion to it."},{"name":"ALISAIE","text":"(Marked for deletion)"},{"name":"ALPHINAUD","text":"Then it is settled. Urianger─pray make arrangements for a chocobo carriage. The ride should give us ample time to prepare our story."},{"name":"ALISAIE","text":"Alphinaud!"},{"name":"ALISAIE","text":"Though our paths are different, we share the same goal, do we not?"},{"name":"ALPHINAUD","text":"But of course, dear sister. That which we have just achieved together stands as testament to that fact. Whatever path we choose to take, our hearts shall ever lead us to the same end, of that I am certain."},{"name":"ALISAIE","text":"Thank you."},{"name":"ALISAIE","text":"There is a place that I would visit. Might I ask you to accompany me?"},{"name":"ALISAIE","text":"But first, I do believe a change of garments is in order. It won't take a moment."},{"name":"ALISAIE","text":"The landscape is the same. Of course, there is no reason that it would be otherwise."},{"name":"ALISAIE","text":"Though it would be poetic for the fragments to magically disappear, I am well aware that they shall remain long after you and I are gone."},{"name":"ALISAIE","text":"The world may change irrevocably, but life shall ever go on."},{"name":"ALISAIE","text":"Let us take a closer look, shall we?"},{"name":"ALISAIE","text":"I have no doubt that Alphinaud will do an admirable job concealing the truth of the Calamity."},{"name":"ALISAIE","text":"And such truths as were revealed in those dark depths will never see the light of day."},{"name":"ALISAIE","text":"I myself agreed that it must be so..."},{"name":"ALISAIE","text":"But the thought that the people of Eorzea shall forever remain ignorant of their savior─of your deeds... The injustice of it is almost too much for me to bear."},{"name":"ALISAIE","text":"How typical of you, <span class=\"highlight\">Forename</span>... Ever the <span class=\"alternative-container\"><span class=\"alternative\">heroine</span><span class=\"alternative\">hero</span></span>. Even so, I cannot deny that I feel better for your reassurance..."},{"name":"ALISAIE","text":"But I want you to know that I will never forget. You are the one who freed Grandfather's soul and saved Eorzea from Bahamut's wrath."},{"name":"ALISAIE","text":"And though these great deeds will never be remembered in song, their consequences will be felt forevermore by every soul who calls this realm home."},{"name":"ALISAIE","text":"Yes, this spot will do."},{"name":"ALISAIE","text":"For Grandfather, Nael, and the dragons of Meracydia... For all those who were taken by the Calamity..."},{"name":"ALISAIE","text":"At long last, our struggle with Bahamut is over..."},{"name":"ALISAIE","text":"The realm, given new life through the prayers and sacrifices of countless souls, may look to a brighter tomorrow."},{"name":"ALISAIE","text":"When the dust of our adventure has settled, I shall embark on a journey."},{"name":"ALISAIE","text":"I mean to find my own reason to fight for Eorzea."},{"name":"ALISAIE","text":"And when I do, I will fight with all my being."},{"name":"ALISAIE","text":"You have done so much for me, <span class=\"highlight\">Forename</span>. One day, I hope to be able to repay you in kind."},{"name":"ALISAIE","text":"I have no doubt but that you will continue to help those in need, and grow ever stronger in so doing."},{"name":"ALISAIE","text":"I shall endeavor to do the same. And if the Twelve are kind, I hope one day to become Eorzea's sword in the darkness─as you are."},{"name":"ALISAIE","text":"Come what may, you may rest assured that I will <span class=\"emphasis\">not</span> be outdone by Alphinaud."},{"name":"ALISAIE","text":"When next we meet, I promise that I will not disappoint you."},{"name":"ALISAIE","text":"Till that day, fare you well, my friend. And thank you, from the bottom of my heart."},{"name":"SYSTEM","text":"You may view the opening cutscene for the Final Coil of Bahamut before accepting this quest."},{"name":"Q1","text":"View the opening cutscene?"}],"reward":{"gil":5000,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[30019],"quests":[65579]}},"partials":[{"type":"npc","id":"1009777","obj":{"i":1009777,"n":"Alisaie","l":46,"q":1}},{"type":"npc","id":"1009771","obj":{"i":1009771,"n":"Urianger","l":46,"q":2}},{"type":"npc","id":"1009776","obj":{"i":1009776,"n":"Alphinaud","l":46,"q":1}},{"type":"instance","id":"30019","obj":{"i":30019,"n":"The Final Coil of Bahamut - Turn 4","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":123}},{"type":"quest","id":"65579","obj":{"i":65579,"n":"Fragments of Truth","g":14,"l":"The Waking Sands","s":5,"f":1}}]}