{"quest":{"name":"Toll Booty","location":"Mor Dhona","id":65581,"patch":3.0,"sort":100,"icon":100486,"eventIcon":71221,"issuer":1009812,"target":1009813,"involved":[1001304,1006530,1009814,1009815,1009816,1009817,1009818,1009819,1009820],"genre":81,"journal":["Rhesh Polaali's face lights up to see her erstwhile savior.","After narrowly surviving Castrum Centri thanks to you, Rhesh tells you she had to leave the Crystal Braves to tend to her wounds. By the time she was well enough for duty, the organization was gone. She has found work as a guard in Revenant's Toll, a posting that keeps her quite busy. She has left one errand unattended, namely returning earrings to Rokka, one of the Doman children who healed her back to health. Thus, she leaps at your offer to find the girl for her, and tells you to speak with Rowena, as the children have been seen in her establishment.","Rowena informs you that the Doman children are helping her organize her wares, but are done for the moment. Should you care to wait outside of her establishment, she continues, you may very well catch sight of them playing.","You find all four members of the Doman Adventurers' Guild, led by a somewhat frustrated Yozan. After returning the earrings to Rokka, you learn the cause─none of them know of any quests to undertake. However, Shiun has heard whispers of something mysterious hidden just outside of town, and Yozan invites you to accompany them there. Make your way to Camp Revenant's Toll, and take a look around.","Somewhat discouraged by the ruin that greets them, the Doman Adventurers' Guild nevertheless begins to search for the buried treasure. Join in their search, and see if you can find anything of value at all.","From the rotting folds of a damp tent, you pull a cloudy bottle of wine. Show this now to Yozan.","Yozan is disheartened to learn that even you could find nothing but junk. However, Koharu reminds him that old wine can be quite valuable, and Shiun suggests you take the bottle to Slafborn for appraisal. Knowing that children caught with liquor will not be treated lightly, Yozan asks that you ask the questions in their place.","Slafborn is mildly amused by the bottle, and informs you that you have, in fact, found the rumored treasure of Camp Revenant's Toll. In the past, the settlers survived the hard days and long nights deep in their cups. They took to calling their wine “treasure,” which then attracted some more dim-witted adventurers to the dangerous land. Worried, the frontier hands then came up with a ludicrous horror story to keep these unwanted people away. As time went on, the tales of “treasure” faded to legend. Find Yozan outside of Rowena's establishment, and relay this information.","Despite the fact you found very little, Yozan realizes that this was still a proper quest with his favorite adventurer. He seems satisfied for the moment, but you have a strong feeling that such an adventurous spirit will not remain so for long."],"objectives":["Speak with Rowena.","Wait at the designated spot near Rowena's establishment.","Survey the designated spot at Camp Revenant's Toll.","Search for the treasure.","Deliver the cloudy bottle of wine to Yozan.","Deliver the cloudy bottle of wine to Slafborn.","Report to Yozan."],"dialogue":[{"name":"RHESHPOLAALI","text":"<span class=\"highlight\">Forename</span>! My, it seems so long since Castrum Centri!"},{"name":"RHESHPOLAALI","text":"Don't...you recognize me? No, I suppose you wouldn't remember everyone you rescue. And I looked quite different when we met, dressed in my uniform."},{"name":"RHESHPOLAALI","text":"I'm Rhesh Polaali, of the Crystal Braves' 4th Unit. Until everything fell apart, that is."},{"name":"RHESHPOLAALI","text":"Everyone has gone their own ways. Some followed Captain Ilberd, others have found new work altogether. I've been keeping busy guarding the frontier hands here. A little too busy, in fact─I can scarce find a moment to spend with my family!"},{"name":"RHESHPOLAALI","text":"The transition wasn't entirely easy. By the time I was fit for duty the Crystal Braves just...weren't, anymore. In a strange way, I've my injuries to thank for keeping me from the worst of it."},{"name":"RHESHPOLAALI","text":"Oh, speaking of that, you're close to the Domans, aren't you? Well, I'm told one of their children aided in my recovery. Would you happen to know where Rokka is?"},{"name":"RHESHPOLAALI","text":"I'm Rhesh Polaali. It's been quite some time since, but I served with the Crystal Braves' 4th Unit. Until everything fell apart, that is."},{"name":"RHESHPOLAALI","text":"Everyone went their own ways. Some followed Captain Ilberd, others found new work altogether. I've kept busy guarding the frontier hands here. A little too busy, in fact─I can scarce find a moment to spend with my family!"},{"name":"RHESHPOLAALI","text":"The transition wasn't entirely easy. I was bedridden after Castrum Centri, and by the time I was fit for duty the Crystal Braves just...weren't, anymore. In a strange way, I've my injuries to thank for keeping me from the worst of it."},{"name":"RHESHPOLAALI","text":"Oh, speaking of that, you're close to the Domans, aren't you? Would you happen to know where Rokka is? She aided in my recovery, and─well, it's quite embarrassing that I didn't notice until now, but..."},{"name":"RHESHPOLAALI","text":"There was a great misunderstanding, you see─her earrings were bundled up in my bags! I've been trying to return them, but those children are neither seen nor heard. I can't find her, no matter how much I look."},{"name":"RHESHPOLAALI","text":"I'm sure the girl misses her earrings, but I simply don't have the time to track her down."},{"name":"RHESHPOLAALI","text":"What? Do you really have a spare moment to look for her in my stead?"},{"name":"RHESHPOLAALI","text":"Oh, thank you, <span class=\"highlight\">Forename</span>, thank you so much!"},{"name":"RHESHPOLAALI","text":"There you are. I've heard the Doman children visit the House of Splendors, though never when <span class=\"emphasis\">I'm</span> there, for some reason. But speak with Rowena─very little escapes her, even invisible children."},{"name":"ROWENA","text":"Lookin' for the Doman children? Aye, they sometimes help arrange my less valuable wares. Just finished for the day, though."},{"name":"ROWENA","text":"Come to think on it, Auriana said she'd caught sight o' them playin' nearby. Might catch 'em, should you have the patience to wait."},{"name":"YOUZAN","text":"I hereby call this meeting of the Doman Adventurers' Guild to order! Old business first─Koharu, we'll start with you."},{"name":"KOHARU","text":"I've been helping Miss Alys get the ingredients she wanted!"},{"name":"ROKKA","text":"I was helping treat hurt adventurers."},{"name":"SHIUN","text":"And I've been helping arrange stuff for Rowena."},{"name":"YOUZAN","text":"No, no, that's not right! Those are all just chores─I want to go on a proper adventure! Didn't any of you find something exciting or scary or mysterious we could explore?"},{"name":"ROKKA","text":"Did <span class=\"emphasis\">you</span> find anything, Yozan? I'll bet you didn't!"},{"name":"YOUZAN","text":"I did too! We've got a big wide world to explore, and <span class=\"emphasis\">I</span> was looking into ways to do it. Which is more than can be said for any of you."},{"name":"SHIUN","text":"Oh, it's true─Yozan got caught sneaking into a horsebird cart! Mister Slafborn was yelling at him for <span class=\"emphasis\">bells</span> after that!"},{"name":"ROKKA","text":"&lt;sigh&gt; You're hopeless."},{"name":"KOHARU","text":"Hehehe─ I'm sorry, Yozan, it's just... Hee hee hee!"},{"name":"YOUZAN","text":"Shiun, you little snitch! I told you that in secret!"},{"name":"SHIUN","text":"But Yozan, I may have found us a quest! I overheard some people talking, and they said there's something hidden at Camp Revenant's Toll!"},{"name":"SHIUN","text":"It might be a famous adventurer's lost treasure, or a vengeful spirit who was sealed away, or...or something else!"},{"name":"SHIUN","text":"No one knows for sure."},{"name":"YOUZAN","text":"That's perfect! We could be the first to find out what's hidden there! Now, we've just got to figure out how to leave town without being caught."},{"name":"YOUZAN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>? What are you doing here?"},{"name":"ROKKA","text":"I was so sad when I thought I lost these earrings! I brought them all the way from Doma, you know. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>!"},{"name":"YOUZAN","text":"Hold on a moment!"},{"name":"YOUZAN","text":"I've got an important announcement! The Doman Adventurers' Guild needs experience in the field actually adventuring. No one's going to let us, though, because they think it's too dangerous."},{"name":"YOUZAN","text":"But <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span> is a good friend of the guild, and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is an incredible adventurer, too. So, I say we invite <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to join us in this quest!"},{"name":"KOHARU","text":"Oh, yes, yes! I want to go on adventures with <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>!"},{"name":"SHIUN","text":"And I'll feel much safer if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> comes along with us, Yozan."},{"name":"ROKKA","text":"Once Yozan's made up his mind, nothing can unmake it─welcome to the guild, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>!"},{"name":"YOUZAN","text":"Now, come on! We've got to find out what's hidden at Camp Revenant's Toll!"},{"name":"ROWENA","text":"Auriana said she'd caught sight o' the children playin' 'round front. If you've got somethin' to talk about, might have to wait a spell."},{"name":"ROKKA","text":"Are you sure this is where Revenant's Toll used to be?"},{"name":"SHIUN","text":"It doesn't look anything like a town!"},{"name":"KOHARU","text":"Not even a little. Where would we even start looking for hidden treasure? What do we do, Yozan?"},{"name":"YOUZAN","text":"We won't know anything unless we poke around a bit. Spread out, and see what you can find─and be careful of monsters."},{"name":"YOUZAN","text":"Oh, I almost forgot to tell you, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>─we've given up on being the Doman Braves. It just didn't seem right, after everything that happened."},{"name":"KOHARU","text":"I wonder what's buried out there? I'll bet it's silver and gold, or really old weapons!"},{"name":"SHIUN","text":"Do you know what vengeful spirits look like? And can you beat them if that's what we find?"},{"name":"ROKKA","text":"Adults are always saying that adventuring's not all fun and games, but why? It <span class=\"emphasis\">looks</span> like a fun game!"},{"name":"YOUZAN","text":"There's something fishy about this tent... No, I mean, it smells like rotten fish. It's making my eyes water..."},{"name":"KOHARU","text":"There's nothing here. Oh, and don't open that jar─I already tried, and I wish I hadn't."},{"name":"SHIUN","text":"Hello! HELLO!<br>Whew... If there's treasure down there, we're not getting to it."},{"name":"ROKKA","text":"I wonder if a monster ate the treasure. But then, do we have to open a monster's belly to get it?"},{"name":"SYSTEM","text":"From amongst the refuse, you find a cloudy bottle of what appears to be wine."},{"name":"YOUZAN","text":"Nothing, nothing, and more nothing! Did you find anything?"},{"name":"YOUZAN","text":"Even <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span> only found this junk. &lt;sigh&gt; Treasure's not easy to come by, I guess."},{"name":"ROKKA","text":"But this might not be junk, Yozan. Isn't really old wine valuable?"},{"name":"KOHARU","text":"That's right! With wine, the older, the better─Miss F'lhaminn told me so."},{"name":"SHIUN","text":"Mister Slafborn knows a lot about wine, too. He spent bells and bells talking about it to some adventurer!"},{"name":"KOHARU","text":"Wow, Mister Slafborn's much wiser than he looks, isn't he?"},{"name":"KOHARU","text":"Yozan, why don't we ask him about this bottle?"},{"name":"YOUZAN","text":"Mmmmmm... Maybe we shouldn't. I think he'll just be angry that we have the wine at all."},{"name":"YOUZAN","text":"Oh, but he wouldn't scold you, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>. Could you ask him for us?"},{"name":"YOUZAN","text":"Great! We'll go back to Revenant's Toll. Tell us what you find out!"},{"name":"SLAFBORN","text":"What is it you need of me, friend?"},{"name":"SLAFBORN","text":"Wine? Much as I might like to join you in a glass, I am on duty. Pray, where did you find so aged a bottle?"},{"name":"SLAFBORN","text":"Hmmm... I take it you were searching for treasure at the old camp. And you came to me to learn its value?"},{"name":"SLAFBORN","text":"I'm afraid it has none whatsoever. But you <span class=\"emphasis\">have</span> found the lost treasure of Revenant's Toll...after a fashion."},{"name":"SLAFBORN","text":"Now, our town is flourishing, but 'twas not always so. Not so very long ago, this was an utterly savage place, marked by little but ruin and the stench of death."},{"name":"SLAFBORN","text":"It was a hard life for the few who chose it, and naturally, they took comfort in the bottle by night. By and by, passing adventurers would bring wine with them, to join the settlers in a glass."},{"name":"SLAFBORN","text":"So prized was this wine that certain adventurers took to calling it “treasure” for a spell. "},{"name":"SLAFBORN","text":"As time went on, someone mistook this name for sooth, and came searching for this vaunted liquor. The first were adventurers, of course, but shopkeeps and artisans soon followed."},{"name":"SLAFBORN","text":"But the monsters around here were still deadly, and the paths still as treacherous, and many who came searching paid for this misunderstanding with their lives."},{"name":"SLAFBORN","text":"So the settlers came up with a new rumor."},{"name":"SLAFBORN","text":"Revenant's Toll belonged to the dead, they said, and any man who slept on the land would have their soul torn from their body, to wander these bleak fields forever as a vengeful spirit."},{"name":"SLAFBORN","text":"As you can imagine, that nonsense was enough to scare the inexperienced and drunks away, and soon the tales of treasure faded away into legend. And that, my friend, is the truth buried at Camp Revenant's Toll."},{"name":"YOUZAN","text":"Hurry up, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>! We're all waiting for you to go and ask Mister Slafborn about the wine!"},{"name":"KOHARU","text":"I think Yozan's afraid to talk to Mister Slafborn because he got scolded."},{"name":"SHIUN","text":"I don't know why everyone thinks Mister Slafborn is frightening. He's only ever been nice to me."},{"name":"ROKKA","text":"There's older wine than that bottle you found, right? So...someone could still drink it?"},{"name":"YOUZAN","text":"What did Mister Slafborn say about the wine?"},{"name":"YOUZAN","text":"Oh... So there never really was a treasure of Revenant's Toll."},{"name":"YOUZAN","text":"Bother. I was hoping for buried gold, or an ancient demon, or something."},{"name":"YOUZAN","text":"...But I guess it wasn't so bad after all. We did get to go outside the town, and explore with <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":665,"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"quests":[67168]},"next":[65586]},"partials":[{"type":"npc","id":"1009812","obj":{"i":1009812,"n":"Rhesh Polaali","l":67,"q":2}},{"type":"npc","id":"1009813","obj":{"i":1009813,"n":"Yozan","l":67,"q":4}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1009814","obj":{"i":1009814,"n":"Koharu","l":67,"q":4}},{"type":"npc","id":"1009815","obj":{"i":1009815,"n":"Shiun","l":67,"q":4}},{"type":"npc","id":"1009816","obj":{"i":1009816,"n":"Rokka","l":67,"q":4}},{"type":"npc","id":"1009817","obj":{"i":1009817,"n":"Yozan","l":67,"q":1}},{"type":"npc","id":"1009818","obj":{"i":1009818,"n":"Koharu","l":67,"q":1}},{"type":"npc","id":"1009819","obj":{"i":1009819,"n":"Shiun","l":67,"q":1}},{"type":"npc","id":"1009820","obj":{"i":1009820,"n":"Rokka","l":67,"q":1}},{"type":"quest","id":"67168","obj":{"i":67168,"n":"A Brave Resolution","g":3,"l":"Ul'dah","s":53}},{"type":"quest","id":"65586","obj":{"i":65586,"n":"Li'l Rascals","g":81,"l":"Mor Dhona","s":101}}]}