{"quest":{"name":"Coming to Terms","location":"The Rising Stones","id":65590,"patch":2.4,"sort":60,"icon":100317,"eventIcon":71201,"issuer":1010078,"target":1007603,"involved":[1006384,1008969,1009029,1009977],"genre":2,"journal":["An influential Ishgardian wishes to meet the Warrior of Light, and Alphinaud would like nothing more than to oblige him.","Alphinaud has been granted an audience with Ser Aymeric, lord commander of the Ishgardian Temple Knights, who will be acting as a representative of the Holy See. Keen to ingratiate himself, Alphinaud has asked you to accompany him to the meeting, as Ser Aymeric has expressed a desire to meet the famous Warrior of Light. Minfilia will surely give you her blessing once she learns of the plan.","Ever since the Battle of Silvertear Skies, the city–state of Ishgard has kept her neighbors at arm's length. Not even the threat posed by the VIIth Legion was enough to coax the reclusive nation back to the negotiating table. Now, however, after two decades of near silence, they have reached out─but to what end? Regardless of Ser Aymeric's agenda, Alphinaud is resolved to advance his own. Travel with him to Camp Dragonhead and speak with Lord Haurchefant upon your arrival.","As always, you receive a warm welcome in Camp Dragonhead, and are informed that Ser Aymeric is already present and ready to meet with you and Alphinaud. Weary though you may be from your travels, make your way to the intercessory and prepare to meet the Ishgardian ambassador.","After favoring you with a few kind words, Ser Aymeric and Alphinaud proceed to debate Ishgardian policies at length. Alas, the ambassador is not easily swayed, and it becomes apparent that the Holy See has no intention of rejoining the Eorzean Alliance. However, Ser Aymeric eventually reveals that he came to the meeting with a different purpose in mind... You learn that the astrologians of Ishgard have foretold the return of Midgardsormr─the fallen guardian of Silvertear Falls─and that Ser Aymeric wishes to enlist the Scions' aid in keeping watch over the great wyrm's remains. In exchange, he will ensure that the shipments of aid from House Fortemps to Revenant's Toll will continue unabated. Content with the arrangement, Alphinaud agrees─only to learn moments after that the latest shipment has been waylaid by Iceheart and her followers..."],"objectives":["Speak with Minfilia.","Speak with Haurchefant at Camp Dragonhead.","Speak with the House Fortemps guard."],"dialogue":[{"name":"ALPHINAUD","text":"We have been blessed with a rare opportunity, <span class=\"highlight\">Forename</span>─an audience with an ambassador of the Holy See of Ishgard."},{"name":"ALPHINAUD","text":"We are to treat with Ser Aymeric, lord commander of the Temple Knights, in Camp Dragonhead."},{"name":"ALPHINAUD","text":"It is considered a great honor to serve the Holy See directly as a Temple Knight. Needless to say, their leader wields tremendous political influence. We would be wise to court his favor."},{"name":"ALPHINAUD","text":"For that reason, I consider your attendance essential. If Ser Aymeric wishes to meet the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> behind the legend, I would not deny him the pleasure of your company."},{"name":"ALPHINAUD","text":"The Antecedent should see the wisdom of this plan when you request her permission to accompany me to Coerthas."},{"name":"ALPHINAUD","text":"...Mayhap you feel this to be a waste of your talents, which could doubtless be put to nobler use? If so, I should remind you that more good can be accomplished with the stroke of a pen than the thrust of a sword."},{"name":"ALPHINAUD","text":"If my many “adventures” in diplomacy have taught me anything, it is the importance of humoring those who have something one wants."},{"name":"ALPHINAUD","text":"Not every victory is won on a battlefield, my friend. 'Tis the lot of legendary heroes to be paraded about from time to time."},{"name":"MINFILIA","text":"...A meeting with an Ishgardian ambassador? By all means, I think it a wonderful idea."},{"name":"MINFILIA","text":"We have received no reports of aetheric disturbances or unusual beast tribe activity of late."},{"name":"MINFILIA","text":"If Alphinaud believes your presence may help him to secure more favorable terms, I see no reason to deny him."},{"name":"ALPHINAUD","text":"Antecedent. I take it <span class=\"highlight\">Forename</span> has explained the situation?"},{"name":"MINFILIA","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has. Yet welcome though these overtures are, I cannot help but wonder what prompted them. The Ishgardians have spurned all contact with the other city–states for decades. Why reach out now?"},{"name":"ALPHINAUD","text":"Would that I knew... The question of their motives is one to which I have given no small amount of thought. Alas, I know no more than is generally known."},{"name":"ALPHINAUD","text":"The notoriously reclusive nation of Ishgard, situated at the center of Abalathia's Spine..."},{"name":"ALPHINAUD","text":"...Ruled by the Ishgardian Orthodox Church, at the head of which presides the archbishop."},{"name":"ALPHINAUD","text":"...Members of the original Eorzean Alliance, formed in the wake of Ala Mhigo's fall some two decades ago."},{"name":"ALPHINAUD","text":"...Friends of convenience who withdrew from the Alliance as soon as the imperial fleet was routed at the Battle of Silvertear Skies."},{"name":"MINFILIA","text":"...Since which time, their borders have remained closed to all outsiders."},{"name":"ALPHINAUD","text":"They have rejected every one of their former allies' calls to reopen dialogue, turning a deaf ear to their neighbors' pleas even when the Calamity loomed large."},{"name":"ALPHINAUD","text":"And on the fields of Carteneau, where brave men and women laid down their lives in defense of the realm, their banners were conspicuously absent..."},{"name":"ALPHINAUD","text":"I have tried to convince Ishgard to rejoin the Alliance at every opportunity."},{"name":"ALPHINAUD","text":"I have explained <span class=\"emphasis\">over and over again</span> that unless Eorzea stands united, we cannot hope to preserve our freedom. One by one, our nations will fall, as once fell Ala Mhigo..."},{"name":"ALPHINAUD","text":"...And what have mine efforts yielded? Why, naught."},{"name":"MINFILIA","text":"Surely this can be considered a step in the right direction?"},{"name":"ALPHINAUD","text":"I should hope so. Rather than the lowly messengers we have been fobbed off with in the past, this time we shall meet with a man of genuine influence."},{"name":"ALPHINAUD","text":"Of course, I am not so naive as to think that they come to us out of the goodness of their hearts. We have something they desire, though I have yet to find out what."},{"name":"ALPHINAUD","text":"But such is the nature of diplomacy. They will bring their agendas to the negotiating table, and so will I─along with a handful of incontrovertible truths."},{"name":"MINFILIA","text":"The Empire will soon be at our doorstep once more."},{"name":"ALPHINAUD","text":"Indeed. You may be assured that I will expound upon this point and others."},{"name":"ALPHINAUD","text":"Let us depart for Camp Dragonhead, <span class=\"highlight\">Forename</span>. Our old friend Lord Haurchefant is expecting us."},{"name":"ALPHINAUD","text":"Since our quest to recover the <span class=\"emphasis\">Enterprise</span>, I understand you have further ingratiated yourself with the man. Excellent work. His fondness may prove useful to our cause."},{"name":"MINFILIA","text":"Though I know but little of Ser Aymeric, I have faith that Alphinaud's efforts are about to bear fruit."},{"name":"HAURCHEFANT","text":"Ah, <span class=\"highlight\">Forename</span>! Ever a welcome sight!"},{"name":"HAURCHEFANT","text":"Our hearths have been stoked to blazing in preparation for your arrival. It would not do for such a distinguished personage to catch cold whilst enjoying our hospitality."},{"name":"ALPHINAUD","text":"The gesture is much appreciated. I fear I shall ever struggle in cold climes."},{"name":"HAURCHEFANT","text":"...Ah, good Master Alphinaud. An honor, as always."},{"name":"ALPHINAUD","text":"Likewise, Lord Haurchefant. Forgive us yet another imposition─I fear we have relied overmuch on your aid since you so generously assisted us in locating the <span class=\"emphasis\">Enterprise</span>."},{"name":"HAURCHEFANT","text":"Nonsense! Any debts incurred have long since been repaid. Besides, who can say what the future may bring?"},{"name":"HAURCHEFANT","text":"House Fortemps may even seek the aid of your newly formed Crystal Braves."},{"name":"ALPHINAUD","text":"(Marked for deletion)"},{"name":"HAURCHEFANT","text":"In any case, I am simply delighted that the Holy See is at last willing to grant you an audience."},{"name":"HAURCHEFANT","text":"No doubt your discoveries at Snowcloak helped to justify the decision. This recent resurgence in heretical activity is of grave concern to us all."},{"name":"HAURCHEFANT","text":"But to the matter at hand: Ser Aymeric arrived in Camp Dragonhead earlier, and I am told he is eager to meet with you at your first convenience."},{"name":"HAURCHEFANT","text":"You are doubtless weary from your journey and desirous to rest awhile by the warmth of our hearth..."},{"name":"HAURCHEFANT","text":"...But if you are willing to forgo such comforts, pray inform the knight stationed outside the intercessory. He will grant you entrance and send word to the other attendees."},{"name":"ALPHINAUD","text":"As inviting as your hearth sounds, I think it best we proceed to the intercessory forthwith."},{"name":"HAURCHEFANT","text":"You will find the entrance to the intercessory outside. It's just around the corner to the right. Speak with the guard stationed there when you are ready to begin the meeting."},{"name":"ALPHINAUD","text":"I see no reason to keep Ser Aymeric waiting, do you? Let us proceed to the intercessory."},{"name":"FORTEMPSGUARD00054","text":"We have been expecting you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Pray take your ease inside and I shall summon the others."},{"name":"FORTEMPSGUARD00054","text":"Proceed to the intercessory?"},{"name":"FORTEMPSGUARD00054","text":"Yes"},{"name":"FORTEMPSGUARD00054","text":"No"}],"reward":{"gil":901,"items":[{"id":9333},{"id":7297,"one":1},{"id":7307,"one":1},{"id":7313,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65589]},"next":[65593]},"partials":[{"type":"npc","id":"1010078","obj":{"i":1010078,"n":"Alphinaud","l":481,"q":3}},{"type":"npc","id":"1007603","obj":{"i":1007603,"n":"House Fortemps Guard","l":63,"q":4,"t":"Gatekeep"}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1009029","obj":{"i":1009029,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1009977","obj":{"i":1009977,"n":"Alphinaud","l":63,"q":5}},{"type":"item","id":"9333","obj":{"i":9333,"n":"Shark Fin Soup","l":90,"c":24115,"t":46}},{"type":"item","id":"7297","obj":{"i":7297,"n":"Noct Breeches","l":110,"c":45432,"t":36}},{"type":"item","id":"7307","obj":{"i":7307,"n":"Astrum Hose","l":110,"c":45434,"t":36}},{"type":"item","id":"7313","obj":{"i":7313,"n":"Gloam Brais","l":110,"c":45435,"t":36}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65589","obj":{"i":65589,"n":"Back and Fourth","g":2,"l":"Ul'dah","s":59}},{"type":"quest","id":"65593","obj":{"i":65593,"n":"The Intercession of Saints","g":2,"l":"Coerthas Central Highlands","s":61}}]}