{"quest":{"name":"Simply the Hest","location":"Western La Noscea","id":65595,"patch":3.1,"sort":100,"unlocksFunction":1,"eventIcon":71341,"issuer":1001788,"target":1004745,"genre":91,"journal":["Swygskyf believes you are ready to join a guildhest.","Guildhests are special operations organized by Adventurers' Guilds and overseen by battlewardens. To learn more about what guildhests entail, speak with Battlewarden Tiroro.","Battlewarden Tiroro explains that guildhests will test your ability to work with others to achieve a common goal. Unless you are content to conduct your adventures forever alone, it may be in your best interests to participate in these operations at least once."],"objectives":["Speak with Battlewarden Tiroro."],"dialogue":[{"name":"SWYGSKYF","text":"By the by, a sturdy 'venturer like yerself might want to look into guildhests."},{"name":"SWYGSKYF","text":"Have a word with Battlewarden Tiroro, and she'll give ye the details. Don't ye fret now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─I'll set her straight if she has any doubts as to yer ability."},{"name":"TIRORO","text":"Word travels quickly in Swiftperch. Here to learn about guildhests, are we?"},{"name":"TIRORO","text":"What's a guildhest? Why, it's a be<span class=\"emphasis\">hest</span> issued by the Adventurers' <span class=\"emphasis\">Guild</span>, savvy? When a certain task brought to the attention of the guild is a little too grand for a leve, but not grand enough for Grand Company involvement, they're deemed guildhests and sent to yours truly."},{"name":"TIRORO","text":"But don't let the lack of grandeur fool you. The tasks are anythin' but simple. Most take place in tight quarters, and <span class=\"emphasis\">all</span> require precision teamwork 'twixt you and your battlemates."},{"name":"TIRORO","text":"And so what do you get in return for placin' your neck on the loppin' block? Besides a beamin' grin from Battlewarden Tiroro Tiro? Fame, fortune, the usual."},{"name":"TIRORO","text":"So, I presume you'll be joinin' our next operation?"},{"name":"SYSTEM","text":"You have unlocked the Duty Finder! This feature allows you to undertake multiplayer duties without having to form a party on your own."},{"name":"SYSTEM","text":"To bring up the Duty Finder interface, select <span class=\"highlight\">Duty Finder</span> under <span class=\"highlight\">Duty</span> from the <span class=\"highlight\">main menu</span>."}],"reward":{"items":[{"num":3,"id":4551,"one":1},{"num":3,"id":4555,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":1}],"quests":[66229]}},"partials":[{"type":"npc","id":"1001788","obj":{"i":1001788,"n":"Swygskyf","l":33,"q":2,"t":"Levemete"}},{"type":"npc","id":"1004745","obj":{"i":1004745,"n":"Tiroro","l":33,"q":1,"t":"Battlewarden"}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}}]}