{"quest":{"name":"Lead by Example","location":"Gridania","id":65599,"patch":2.0,"sort":350,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"genre":140,"usedItems":[3616],"journal":["Guildmaster Geva has a task she believes appropriate for a leatherworker of your burgeoning abilities.","Guildmaster Geva has singled you out to craft a pair of boarskin ringbands to serve as an example to the laggards and loafers of the guild. Produce ringbands worthy of her exacting standards and deliver them forthwith.","Geva lavishes uncharacteristic praise upon your craftsmanship, and expresses a desire to delegate work to you while she devotes herself to preparing for the upcoming exhibition. Continue to hone your skills so as not to let her down.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 40."],"objectives":["Deliver a pair of boarskin ringbands <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Geva."],"dialogue":[{"name":"GEVA","text":"Sluggards and slouches, the lot of them!"},{"name":"GEVA","text":"<span class=\"highlight\">Forename</span>. Don't tell me you haven't noticed as well."},{"name":"GEVA","text":"Uneven seams, slipshod stamping─the work produced by the guild's rank and file in recent days simply isn't up to snuff."},{"name":"GEVA","text":"Whether it be the impending exhibition or this whole Angrbotha business that is distracting our craftsmen, I do not know. What I <span class=\"emphasis\">do</span> know is that if they don't get their act together─and <span class=\"emphasis\">soon</span>─we're at risk of actually losing business to those charlatans."},{"name":"GEVA","text":"I will not stand idly by as a lack of discipline undoes the reputation that our guild has worked so long to achieve!"},{"name":"GEVA","text":"Someone needs to remind those slouches why they became leatherworkers in the first place, and I've decided that person will be you. Yes, <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>."},{"name":"GEVA","text":"Surprised, are you? Hah! I may question your skills, but not your dedication to our craft. Bring me the finest pair of boarskin ringbands you can craft and show me that my trust hasn't been misplaced."},{"name":"GEVA","text":"It would be only the slightest of exaggerations to say that the future of this guild─not to mention <span class=\"emphasis\">your</span> future─hangs in the balance. Now get to it, and show your good-for-nothing guildmates how it's done."},{"name":"GEVA","text":"Well, <span class=\"highlight\">Forename</span>? Have you crafted for me the finest boarskin ringbands this guild has ever seen? No pressure, of course."},{"name":"GEVA","text":"Hmph... Is that a smudge? One could hardly call this perfect."},{"name":"GEVA","text":"Fortunately, it is not perfection I sought of you, but pure, single-minded devotion to the craft. And from the moment I took this ringband in hand, I knew you had not let me down."},{"name":"GEVA","text":"Clearly, you possess a keen understanding of the ideal ringband. The boarskin─light, sturdy, and resistant to friction─is reinforced by steel links to afford protection without weighing down the wearer."},{"name":"GEVA","text":"Clumsily crafted ringbands have been known to distract those that would wield magic. Yours, however, are so well balanced that one might forget that she is wearing anything at all."},{"name":"GEVA","text":"This is a true accomplishment of leatherworking, and will serve as a clarion wake-up call to any loafer content with churning out substandard work."},{"name":"GEVA","text":"I will be honest with you, <span class=\"highlight\">Forename</span>. When you first came stumbling through our doors, I reckoned I'd have an easier time making you into a saddle than a respectable leatherworker."},{"name":"GEVA","text":"How pleased I am to have been proven wrong. You have risen to the challenge and become a model to the entire guild. Which reminds me..."},{"name":"GEVA","text":"I have spoken to you of the Gridanian exhibition, yes? The day of opening draws near, and I must devote myself fully to producing our new line of leather fashions."},{"name":"GEVA","text":"As this will afford me little time to devote to everyday affairs, I require someone to handle the more demanding commissions until the exhibition has come and gone. I have decided that you are the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job."},{"name":"GEVA","text":"That's right─your next task will be to serve as my personal assistant. Don't even think about neglecting your training. Is that clear?"}],"reward":{"items":[{"id":2424},{"id":2769,"one":1},{"id":3130,"one":1},{"id":3607,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":13}],"quests":[65597]},"next":[65600]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"2424","obj":{"i":2424,"n":"Steel Round Knife","l":34,"c":35405,"t":20,"p":3786}},{"type":"item","id":"2769","obj":{"i":2769,"n":"Mythril Magnifiers","l":34,"c":40901,"t":34,"p":2953}},{"type":"item","id":"3130","obj":{"i":3130,"n":"Apprentice's Smock","l":36,"c":42185,"t":35}},{"type":"item","id":"3607","obj":{"i":3607,"n":"Linen Halfgloves","l":33,"c":44161,"t":37,"p":2195}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3616","obj":{"i":3616,"n":"Boarskin Ringbands","l":36,"c":48241,"t":37,"p":2533}},{"type":"quest","id":"65597","obj":{"i":65597,"n":"Toadskins of the Father","g":140,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"65600","obj":{"i":65600,"n":"Brand Loyalty","g":140,"l":"Gridania","s":400,"f":1}}]}