{"quest":{"name":"A Dangerous Proposition","location":"Gridania","id":65591,"patch":2.0,"sort":150,"icon":100057,"unlocksFunction":1,"eventIcon":71341,"issuer":1000254,"target":1000254,"involved":[1000732,1001194],"genre":130,"journal":["Guildmaster Ywain urgently needs you to travel to the East Shroud in his stead.","You learn that Foulques has offended a hot-headed young lancer of the guild, and that the two of them have left to duel in the East Shroud. Unable to leave his post, Ywain bids you follow them in his stead and ensure that no one comes to serious harm.","If you wish to save the young lancer, you have no choice but to do as Foulques says. Sprinkle the alchemic potation upon the exposed roots, and prepare for battle.","You have succeeded in defeating the angered elm. With the battle at an end, you can now turn your attention to Foulques.","Not content with pitting you against a single mighty foe, Foulques would have you face a multitude. He bids you go to Lifemend Stump, and there lie in wait for a pack of man-eating wolves. When the beasts show themselves, you are to slay their leader─the alpha wolf.","Foulques urges you to forsake the guild, declaring that his is the one true path to courage. Even were you inclined to heed his advice, honor demands that you bear word of these developments to Ywain at the Lancers' Guild.","Upon your return, Ywain praises you for the courage you displayed in rescuing your fellow lancer, and declares you ready to learn the Piercing Talon technique. Though the day was saved on this occasion, the guildmaster is nonetheless concerned that Foulques's corrupted beliefs may yet cause great harm. Something must be done. While Ywain deliberates a course of action, he bids you put thoughts of the rogue lancer from your mind, and dedicate yourself wholly to your training.<br><br>※The next lancer quest will be available from Ywain upon reaching level 20."],"objectives":["Seek out Foulques in the East Shroud.","Sprinkle the alchemic potation on the exposed roots.","Speak to Foulques.","Lie in wait near Lifemend Stump.","Report to Ywain.","Defeat the wolves!"],"dialogue":[{"name":"YWAIN","text":"Ah, <span class=\"highlight\">Forename</span>! You come at a good time. I urgently require your help."},{"name":"YWAIN","text":"Scarcely a bell ago, our old friend Foulques paid us another visit, seemingly intent upon reprising the performance he gave on the day of your first meeting. As on that occasion, he raved till the air was thick with slanders, declaring every soul who met his gaze more craven than the last..."},{"name":"YWAIN","text":"This time, however, not all ears were deaf to his myriad provocations. It seems one of our younger members took offense at his words and demanded satisfaction of the rogue. The two have since departed to duel in the East Shroud."},{"name":"YWAIN","text":"Had I been on hand, I would have forbidden such folly, and rebuked the lad for letting pride cloud his judgment. Alas, I learned of it too late, and the boy is gone. All we can do now is ensure that the hot-headed fool does not come to lasting harm."},{"name":"YWAIN","text":"I would have departed in pursuit of the pair ere you came, but my duties keep me here. That is why I turn to you now, <span class=\"highlight\">Forename</span>. Pray go to the East Shroud in my stead, and watch over our comrade."},{"name":"FOULQUES","text":"So we meet again. You remember who I am, I trust?"},{"name":"Q1","text":"Do you remember?"},{"name":"A1","text":"I do."},{"name":"A1","text":"I... Who are you again?"},{"name":"FOULQUES","text":"But of course you remember your mentor─he who taught you the <span class=\"emphasis\">true</span> meaning of courage."},{"name":"FOULQUES","text":"You wound me! How could you <span class=\"emphasis\">possibly</span> forget your mentor─he who taught you the true meaning of courage? Well, it is of little consequence. Though you have forgotten the teacher, it is plain that you have not forgotten his teachings."},{"name":"FOULQUES","text":"I understand you were able to retrieve the Stone of Courage in Spirithold. It seems I was right about you."},{"name":"FOULQUES","text":"Aye, you have the makings of a true lancer─unlike those charlatans at the Lancers' Guild."},{"name":"FOULQUES","text":"It is well that you have come to me, for I have just the trial for you─one that will do wonders for your courage."},{"name":"FOULQUES","text":"Not interested, you say? Ah, but you have no choice. Should you refuse...well, suffice it to say that I will not be able to guarantee the safety of your comrade here."},{"name":"FOULQUES","text":"When last we spoke, I told you that a lancer may forge true courage only in the midst of great danger. Needless to say, the threat posed by ordinary creatures is insufficient─you must needs seek out better sport."},{"name":"FOULQUES","text":"Ah, but fear not, for I have taken the liberty of finding you something suitable."},{"name":"FOULQUES","text":"Take this alchemic potation and sprinkle it upon the exposed roots yonder. Doing so will garner you the wrath of a certain creature, which you must then strike down."},{"name":"CLSLNC003MOB1","text":"Unnngh..."},{"name":"FOULQUES","text":"Sprinkle the alchemic potation upon the exposed roots as I bade you, or your comrade's life is forfeit."},{"name":"CLSLNC003MOB1","text":"I-I underestimated him..."},{"name":"FOULQUES","text":"So you have vanquished the treant. Well done. By striking down that frenzied creature, you have further strengthened your courage."},{"name":"FOULQUES","text":"Hm? Release your comrade? Oh, I shall─once you have completed my next trial. This one will pit you against a multitude of foes."},{"name":"FOULQUES","text":"Make your way to Lifemend Stump in the Central Shroud. Once there, seek out a likely spot along the forest path to lie in wait. Man-eating wolves are wont to hunt there at this time of year, and it should not be long before a pack appears."},{"name":"FOULQUES","text":"When the beasts show themselves, you are to slay their leader─the alpha wolf. I shall be observing from up close, the better to offer you advice."},{"name":"CLSLNC003MOB1","text":"F-Forgive me..."},{"name":"FOULQUES","text":"Was I not clear in my instructions? Go to Lifemend Stump, and there lie in wait for a pack of man-eating wolves. When the beasts appear, slay their leader─the alpha wolf."},{"name":"FOULQUES","text":"You are to be congratulated, <span class=\"highlight\">Forename</span>. By throwing yourself into the midst of danger, you have further tempered your courage."},{"name":"FOULQUES","text":"And in the process, you have brought peace to Lifemend Stump, a place considered sacred by the people of Gridania."},{"name":"FOULQUES","text":"Having undertaken my trials, you must now see that those issued by the guild are naught but child's play."},{"name":"FOULQUES","text":"Mine is the one true path to courage─all others lead to ignominy. If you wish to become a lancer worthy of the name, I suggest you leave Ywain and his house of cravens, never to return."},{"name":"FOULQUES","text":"For your sake, I pray you do so soon. Till we meet again..."},{"name":"TALK","text":"This isn't the text you're looking for."},{"name":"YWAIN","text":"<span class=\"highlight\">Forename</span>, thank the gods you are safe! That young fool of a lancer returned but moments ago, and through choked tears recounted to me all that transpired."},{"name":"YWAIN","text":"I understand Foulques again attempted to force upon you his corrupted notion of courage."},{"name":"YWAIN","text":"I cannot say this often enough: a lancer strengthens his courage by tempering his composure and resolve, <span class=\"emphasis\">not</span> by rushing headlong into danger."},{"name":"YWAIN","text":"You were able to overcome Foulques's trials, 'tis true, yet know that you did so by virtue of true courage─that is, courage born of composure and resolve."},{"name":"YWAIN","text":"You faltered not before the fury of a frenzied treant, nor did you succumb to panic when surrounded by bloodthirsty wolves. Owing to this, you were able to perform to the fullest of your potential."},{"name":"YWAIN","text":"You have come far, <span class=\"highlight\">Forename</span>. It is past time that I taught you the Piercing Talon technique, one of the most versatile weapons in the lancer's arsenal. May it serve you well."},{"name":"YWAIN","text":"Now, I must needs decide what course of action to take with regard to your self-appointed “mentor.” Though no lives were lost, this latest incident only serves to confirm what I have long suspected: that Foulques will cause great harm if left to propagate his corrupted notion of courage. He must be persuaded to desist, though I do not yet know how. Mayhap his regard for you could be turned to our advantage... But leave such considerations to me."},{"name":"YWAIN","text":"For the time being, you would do well to put Foulques from your mind. Focus on your training, and strive to master the technique I have taught you. I look forward to our next meeting."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“A Dangerous Proposition”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"FOULQUES","text":"'Tis as good as over if the alpha wolf paralyzes you."},{"name":"FOULQUES","text":"Will your courage hold out in the face of terror? We shall see!"},{"name":"FOULQUES","text":"Courage is forged only in the midst of great danger!"},{"name":"FOULQUES","text":"I grow deathly bored. Let me make this more...<span class=\"emphasis\">interesting</span>."},{"name":"FOULQUES","text":"A true lancer needs not his eyes to win─only his courage!"},{"name":"FOULQUES","text":"Oh, dear, it would seem you have enraged the beast."},{"name":"FOULQUES","text":"My part here is done. The rest I leave to you."},{"name":"FOULQUES","text":"P-Preposterous!"}],"reward":{"action":90,"items":[{"id":1824},{"id":3028,"one":1},{"id":2677,"one":1},{"id":3546,"one":1},{"id":3780,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":5}],"questsType":"any","quests":[65571,65679]},"next":[65592]},"partials":[{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000732","obj":{"i":1000732,"n":"Leih Aliapoh","l":56,"q":2}},{"type":"npc","id":"1001194","obj":{"i":1001194,"n":"Foulques","l":55,"q":1}},{"type":"action","id":"90","obj":{"i":90,"n":"Piercing Talon","c":315,"j":4,"t":3,"l":15}},{"type":"item","id":"1824","obj":{"i":1824,"n":"Brass Spear","l":14,"c":31815,"t":5,"p":783}},{"type":"item","id":"3028","obj":{"i":3028,"n":"Cotton Tabard","l":16,"c":43046,"t":35,"p":508}},{"type":"item","id":"2677","obj":{"i":2677,"n":"Hunting Hat","l":16,"c":41046,"t":34,"p":513}},{"type":"item","id":"3546","obj":{"i":3546,"n":"Fingerless Hard Leather Gloves","l":15,"c":44061,"t":37,"p":420}},{"type":"item","id":"3780","obj":{"i":3780,"n":"Hard Leather Crakows","l":15,"c":46155,"t":38,"p":384}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65571","obj":{"i":65571,"n":"Courage of Stone","g":130,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65679","obj":{"i":65679,"n":"Courage of Stone","g":130,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65592","obj":{"i":65592,"n":"Lance of Destiny","g":130,"l":"Gridania","s":200,"f":1}}]}