{"quest":{"name":"Simply the Hest","location":"Western Thanalan","id":65594,"patch":3.1,"sort":100,"unlocksFunction":1,"eventIcon":71341,"issuer":1001796,"target":1004743,"genre":93,"journal":["Totonowa believes you are ready to join a guildhest.","Guildhests are special operations organized by Adventurers' Guilds and overseen by battlewardens. To learn more about what guildhests entail, speak with Battlewarden Lost Rabbit.","Battlewarden Lost Rabbit explains that guildhests will test your ability to work with others to achieve a common goal. Unless you are content to conduct your adventures forever alone, it may be in your best interests to participate in these operations at least once."],"objectives":["Speak with Battlewarden Lost Rabbit."],"dialogue":[{"name":"TOTONOWA","text":"While I heartily encourage you to partake of my guildleves, should you seek a different sort of challenge, you might also consider joining a guildhest."},{"name":"TOTONOWA","text":"If you wish to know more, pray speak with Battlewarden Lost Rabbit. I will inform her of your success against the peiste so that there are no doubts as to your abilities."},{"name":"LOSTRABBIT","text":"You needn't say a word, adventurer. I could hear Totonowa quite well from here."},{"name":"LOSTRABBIT","text":"As this would be your first time joining us, allow me a moment to explain in detail just what exactly a guildhest entails."},{"name":"LOSTRABBIT","text":"More than a simple levequest, but not quite as realm-shaking as a Grand Company outing, guildhests will test your ability to work together with a small party of battle companions to overcome not-so-small obstacles."},{"name":"LOSTRABBIT","text":"The duty is taxing, but the coin is decent, and you will be helping maintain the safety of Eorzea and the well-being of her citizens."},{"name":"LOSTRABBIT","text":"If what I described appeals to you, pray speak to me again to join a guildhest."},{"name":"SYSTEM","text":"You have unlocked the Duty Finder! This feature allows you to undertake multiplayer duties without having to form a party on your own."},{"name":"SYSTEM","text":"To bring up the Duty Finder interface, select <span class=\"highlight\">Duty Finder</span> under <span class=\"highlight\">Duty</span> from the <span class=\"highlight\">main menu</span>."}],"reward":{"items":[{"num":3,"id":4551,"one":1},{"num":3,"id":4555,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":1}],"quests":[66223]}},"partials":[{"type":"npc","id":"1001796","obj":{"i":1001796,"n":"Totonowa","l":42,"q":2,"t":"Levemete"}},{"type":"npc","id":"1004743","obj":{"i":1004743,"n":"Lost Rabbit","l":42,"q":1,"t":"Battlewarden"}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"quest","id":"66223","obj":{"i":66223,"n":"Leves of Horizon","g":93,"l":"Ul'dah","s":100,"f":1}}]}