{"quest":{"name":"The Intercession of Saints","location":"Coerthas Central Highlands","id":65593,"patch":2.4,"sort":61,"eventIcon":71201,"issuer":1009976,"target":1009977,"involved":[1006384,1006401,1009978,1009979,1009982],"genre":2,"journal":["Recent developments have given Alphinaud much to consider.","Given the decidedly unfortunate timing of Iceheart's most recent attack, Alphinaud cannot help but wonder if the gods themselves are conspiring against him. Yet even if they were, he would not hesitate to defy them. Follow him and speak with Lord Haurchefant to learn more of the heretics' activities.","The route taken by the caravan was known only to a few, yet by all accounts, the ambush laid by the heretics was executed flawlessly─a fact which does not escape Aymeric's subordinate. In spite of this, Alphinaud believes that a thorough examination of the ambush site must be conducted before pursuing other avenues of inquiry. Travel to Boulder Downs and question the House Fortemps knights keeping watch there.","One of the knights investigating the scene shares his thoughts with you regarding the attack, speculating that the heretics came prepared with their own wagons to transport the crates. He also makes mention of a squire who survived the attack, who is currently receiving care at the Observatorium. With luck, he will have regained consciousness by the time you arrive.","The wounded squire's words paint a grim picture indeed. Disguised as pilgrims, Iceheart and her brethren slaughtered the caravan's guards, and the young man only survived by feigning his own death. As he lay still in the snow, he heard the heretics speak of “Shiva's resurrection”─the thought of which fills the squire with disbelief and dread in equal measure. Alphinaud must know what the squire saw.","Apostate to the Holy See, patron saint to the heretics, Shiva lay down with dragons long ago. But she is long dead, and the dead are forever lost to us...are they not? The heretics seem convinced that her resurrection is nigh, but Alphinaud believes it to be something far worse: the summoning of yet another primal, made possible with the crystals stolen from the caravan. If he is right, Iceheart's plan cannot be allowed to come to fruition."],"objectives":["Speak with Haurchefant.","Speak with the House Fortemps knight at Boulder Downs.","Speak with the surviving squire at the Observatorium.","Report to Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"&lt;sigh&gt; Just when we were starting to make progress..."},{"name":"ALPHINAUD","text":"And to make matters worse, the caravan they spoke of was bound for Revenant's Toll of all places. Honestly, were I so inclined, I should think the gods were conspiring against us."},{"name":"ALPHINAUD","text":"Happily, however, I am not. I would know more of this attack. Let us speak with Lord Haurchefant and find out what he has learned."},{"name":"ALPHINAUD","text":"We must needs find the heretics and─ &lt;sigh&gt; No, it will avail us naught to rush. Let us hear what Lord Haurchefant has to say first."},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)I am come to hear Lord Haurchefant speak, not you."},{"name":"HAURCHEFANT","text":"My sincerest apologies for the interruption, my friends, but the situation is such that we must act swiftly."},{"name":"ALPHINAUD","text":"If you would be so kind as to elaborate..."},{"name":"HAURCHEFANT","text":"Iceheart's heretics fell upon the caravan bound for Revenant's Toll as it was passing through Boulder Downs."},{"name":"HAURCHEFANT","text":"'Twas an ambush─swift and ruthless. In an instant, every knight was slain, every crate seized. Then, as quickly as they had appeared, they were gone."},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)'Twould be an impossible feat without knowledge of the route─knowledge to which only a select few are privy, I presume."},{"name":"ALPHINAUD","text":"...Quite. We can pursue that avenue of inquiry in due course. It seems to me that examining the scene of the ambush should be our first concern."},{"name":"ALPHINAUD","text":"The trail is yet warm. We must act swiftly─as Lord Haurchefant said─lest crucial evidence be lost."},{"name":"ALPHINAUD","text":"You have a knack for discerning hidden truths, <span class=\"highlight\">Forename</span>. Why don't you go and inspect the ambush site in person?"},{"name":"HAURCHEFANT","text":"An excellent idea! Inform my men of your intent upon arrival, and they will gladly share their findings."},{"name":"ALPHINAUD","text":"I shall remain in Camp Dragonhead for now. Should you learn aught of interest, pray return at once."},{"name":"HAURCHEFANT","text":"My men are conducting their own investigation at present. Follow the road south towards Mor Dhona and you shall find them and the wagon in due time."},{"name":"YAELLE","text":"How brazen these heretics have become, to raid caravans escorted by knights of House Fortemps!"},{"name":"FORTEMPSGUARD00057","text":"Move along, adventurer. There's nothing for─ Eh? Lord Haurchefant bid you speak with us? Then you must be─ Beg your pardon, Scion."},{"name":"FORTEMPSGUARD00057","text":"As you can see, they left nary a crate behind. Tipped the wagon for good measure even."},{"name":"FORTEMPSGUARD00057","text":"Whole thing's a bit odd, if you ask me. Would've been easier to just steal it─though a damn sight harder to conceal it, I'll allow."},{"name":"FORTEMPSGUARD00057","text":"Reckon they came prepared, probably with wagons of their own hidden a way off... Ah, but pay no heed to my ramblings. Absent of proof, 'tis naught but speculation."},{"name":"FORTEMPSGUARD00057","text":"Might be as the squire receiving care at the Observatorium could tell you something more factual. That is, if he's awake. Unlike myself, he was there during the attack─not that his presence amounted to much."},{"name":"FORTEMPSGUARD00057","text":"Sorry, Scion, but if it's answers you want, I've got none for you. Best go and see what that squire laid up at the Observatorium remembers, if he's fit to speak."},{"name":"YAELLE","text":"Dead? All of them? Even...even the squires?"},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)It takes but one pair of loose lips..."},{"name":"INJUREDSENTRY00057","text":"You...you've come to ask about the attack, haven't you?"},{"name":"INJUREDSENTRY00057","text":"...We came upon them before the entrance to the Hall of the Seven Echoes. Pilgrims, we marked them as─lost and ill equipped for a journey further north. Our leader called out to them, and one stepped forward to answer."},{"name":"INJUREDSENTRY00057","text":"Slowly she approached, her silver hair flowing in the wind like melting snow. Just a young girl, I thought, some poor lost lamb in search of salvation."},{"name":"INJUREDSENTRY00057","text":"Our leader must have thought the same─else why would he let her draw so close? They exchanged some words I couldn't hear, and she leaned forward as if to kiss his cheek...and then he sighed and crumpled to the ground. I didn't know what had happened till I saw the snow turn red."},{"name":"INJUREDSENTRY00057","text":"And then there was red everywhere I looked. I tried to fight, but took a blow to the head, and by the time I came to, the others were dead and the heretics were unloading the wagon. I couldn't... I-I mean, they'd have killed me, so... So I just lay still and listened."},{"name":"INJUREDSENTRY00057","text":"Iceheart's people spoke of deliverance and resurrection. And...they spoke of <span class=\"emphasis\">Shiva</span>..."},{"name":"INJUREDSENTRY00057","text":"To hear them speak, they truly believe they can resurrect Shiva. But that can't be possible, can it...? It can't..."},{"name":"ALPHINAUD","text":"Ah, you've returned. What news have you for us?"},{"name":"HAURCHEFANT","text":"It seems the Lady Iceheart does not scruple to sully her hands with blood."},{"name":"ALPHINAUD","text":"Who is this “Shiva” the heretics spoke of?"},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)...Have you not read a single line of the <span class=\"emphasis\">Enchiridion</span>, Master Alphinaud?"},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)Shiva was a traitor to kith and kin─an apostate who <span class=\"emphasis\">lay down with dragons</span>."},{"name":"HAURCHEFANT","text":"Now, now, we cannot expect all foreigners to know Ishgardian scripture so well─particularly when it concerns the patron saints of heretics."},{"name":"ALPHINAUD","text":"Wait─you say she is their <span class=\"emphasis\">patron</span> saint? Oh, no... It all makes sense now..."},{"name":"ALPHINAUD","text":"Lord Haurchefant─what was the caravan's cargo?"},{"name":"HAURCHEFANT","text":"Ah...if I recall correctly, the Diamond Forge had requested a rather large quantity of crystals─"},{"name":"ALPHINAUD","text":"Do you not see? Iceheart and her followers intend to <span class=\"emphasis\">summon</span> Shiva, as a beast tribe would a primal! Why else would they go to such lengths to secure crystals?"},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)...I shall inform the lord commander at once. Lord Haurchefant, you would agree that discretion is of paramount concern?"},{"name":"HAURCHEFANT","text":"Of course."},{"name":"HAURCHEFANT","text":"I trust we can count on your continued support, Master Alphinaud?"},{"name":"ALPHINAUD","text":"The Scions of the Seventh Dawn are sworn to combat the primal threat. Our support is a given."},{"name":"ALPHINAUD","text":"I will need to send word to my brethren in Revenant's Toll. Our entire order must turn its efforts to the prevention of this summoning."},{"name":"ALPHINAUD","text":"Naturally, that includes you─though I am sure you would not miss this for the world."},{"name":"YAELLE","text":"Halone be praised, he yet lives! I pray his recovery is swift."},{"name":"HAURCHEFANT","text":"Welcome back, old friend! I─ (Oh dear, Alphinaud's looking this way. I do not think he likes being ignored.)"}],"reward":{"gil":658,"items":[{"id":7323,"one":1},{"id":7333,"one":1},{"id":7343,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65590]},"next":[65598]},"partials":[{"type":"npc","id":"1009976","obj":{"i":1009976,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1009977","obj":{"i":1009977,"n":"Alphinaud","l":63,"q":5}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006401","obj":{"i":1006401,"n":"Yaelle","l":63,"q":4}},{"type":"npc","id":"1009978","obj":{"i":1009978,"n":"Taciturn Temple Knight","l":63,"q":1}},{"type":"npc","id":"1009979","obj":{"i":1009979,"n":"House Fortemps Knight","l":63,"q":1}},{"type":"npc","id":"1009982","obj":{"i":1009982,"n":"Surviving Squire","l":63,"q":1}},{"type":"item","id":"7323","obj":{"i":7323,"n":"Auroral Brais","l":110,"c":45436,"t":36}},{"type":"item","id":"7333","obj":{"i":7333,"n":"Daystar Breeches","l":110,"c":45433,"t":36}},{"type":"item","id":"7343","obj":{"i":7343,"n":"Evenstar Tights","l":110,"c":45431,"t":36}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65590","obj":{"i":65590,"n":"Coming to Terms","g":2,"l":"The Rising Stones","s":60}},{"type":"quest","id":"65598","obj":{"i":65598,"n":"Strength in Unity","g":2,"l":"Coerthas Central Highlands","s":62}}]}