{"quest":{"name":"Brand Loyalty","location":"Gridania","id":65600,"patch":2.0,"sort":400,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"involved":[1003674],"genre":140,"usedItems":[3639],"journal":["A recent order has Guildmaster Geva flustered.","A client has requested that his commission be filled by the guildmaster herself. Disinclined to indulge this request, Guildmaster Geva has instead delegated the task to you. Craft a pair of boarskin smithy's gloves to the best of your ability and present it to Geva for inspection.","Guildmaster Geva assures you that her client will be unable to distinguish the gloves you have crafted from ones of her own making. Take her at her word and deliver the gloves to the blacksmith waiting outside Fen–Yll Fineries.","The blacksmith praises your craftsmanship, proclaiming the gloves you fashioned are the finest he has ever owned. Report your success to Geva at the Leatherworkers' Guild.","The patterns which bear Geva's name were developed years ago in response to a rash of counterfeiting. Realizing that she could not prevent others from copying her creations, Geva swore a vow that the next line of Geva toadskin bags would be made with an eye towards economy, and that the patterns used would enable inexperienced leatherworkers to reproduce her designs with minimal waste. However, as an artisan worthy of the Fen–Yll name, you do not need to rely upon her patterns. Filled with pride in seeing you uphold the guild's high standards, she encourages you to continue your efforts.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 45."],"objectives":["Present a pair of boarskin smithy's gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Geva.","Deliver the boarskin smithy's gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the blacksmith.","Report to Geva."],"dialogue":[{"name":"GEVA","text":"Rhalgr take me! Of all the times for <span class=\"emphasis\">this</span> order to come in..."},{"name":"GEVA","text":"Here, have a look, <span class=\"highlight\">Forename</span>. “An order for a pair of boarskin smithy's gloves made by the guildmaster herself, using her famous Geva patterns.” To be delivered <span class=\"emphasis\">posthaste</span>, no less."},{"name":"GEVA","text":"I'd bet a month's earnings that this oaf couldn't tell my handiwork from a goobbue's arse, but does that stop him from filing such a tactless order when I'm up to my very ears in work for the exhibition? Apparently not!"},{"name":"GEVA","text":"<span class=\"emphasis\">Posthaste</span>!? I'd deliver a slap upside the head <span class=\"emphasis\">posthaste</span> if it wouldn't have negative repercussions for guild business. &lt;sigh&gt; Fortunately, my new assistant has arrived."},{"name":"GEVA","text":"Why, you, of course, <span class=\"highlight\">Forename</span>. I <span class=\"emphasis\">did</span> mention that I'd be delegating work to you while I focused on the exhibition, did I not?"},{"name":"GEVA","text":"What about the customer's conditions, you say? Bah! He'll get a pair of gloves made by the famous <span class=\"highlight\">Forename</span> <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>, and he'll like them just fine."},{"name":"GEVA","text":"Well? Have you brought the work of the famous <span class=\"highlight\">Forename</span>?"},{"name":"GEVA","text":"A smithy's gloves must be sturdy enough to protect his hands from the fires of the forge."},{"name":"GEVA","text":"At the same time, they must be pliant enough so as not to hinder the precise movements needed to work fine steel."},{"name":"GEVA","text":"Crafted from boarskin─lightweight, tough, and resistant to friction─this pair of smithy's gloves represents the best of both worlds."},{"name":"GEVA","text":"The simple design allows the five fingers to move with full range of motion─the ideal handwear for any capable smith."},{"name":"GEVA","text":"Your work has admirably captured each of these essential points. I am happy to sign off on it. You may deliver it to Fen–Yll Fineries without delay."},{"name":"GEVA","text":"What, the Geva patterns? Do not worry yourself about such foolishness. Have I not told you that he will know no better?"},{"name":"GEVA","text":"At any rate, off with you. Even a fool of a client is a valued customer."},{"name":"BLACKSMITH","text":"My very first pair of custom-made smithy's gloves─made by the famous Guildmaster Geva, to boot─are set to arrive from the Leatherworkers' Guild any moment now! I can hardly wait to try them on!"},{"name":"BLACKSMITH","text":"A delivery for me, you say? Oh, do hand it over. And quickly, if you would!"},{"name":"BLACKSMITH","text":"Now what have we...? Hoglets to hornets and Byregot's my uncle─if this isn't the finest, most comfortable pair of gloves I've ever laid hands on! And to think they are the─ Hm, what's that you say?"},{"name":"Q1","text":"Tell the blacksmith the truth?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"BLACKSMITH","text":"I am but a simple blacksmith, but I can read your face. Admit it, now: you would demand a higher price for such impeccable craftsmanship. That's it, yes?"},{"name":"BLACKSMITH","text":"Wh-What's that, you say!? These gloves are not the work of Geva?"},{"name":"BLACKSMITH","text":"Why, I never... I could just... I... I..."},{"name":"BLACKSMITH","text":"I couldn't give two shites about that! Haha! Hahahahahaha!"},{"name":"BLACKSMITH","text":"Friend, I don't know a damn thing about you leatherworkers and your patterns."},{"name":"BLACKSMITH","text":"A fellow smith assured me that Geva's gloves were of peerless quality, and that was enough for me. I placed my order that same day, sight unseen."},{"name":"BLACKSMITH","text":"And I am glad I did, for you have brought me the most comfortable pair of smithy's gloves I've ever had the pleasure to own. You and the guildmaster have my utmost gratitude."},{"name":"BLACKSMITH","text":"You've brought me the most comfortable pair of smithing gloves I've ever had the pleasure to own. Thank you."},{"name":"GEVA","text":"Heh heh. Another satisfied customer, yes? I told you that you worried for naught, <span class=\"highlight\">Forename</span>."},{"name":"GEVA","text":"Oh, I suppose you're still curious about those Geva patterns, aren't you. Allow me to explain."},{"name":"GEVA","text":"Some years ago, Gridanians took quite a fancy to a toadskin bag of my design. So popular were the bags that they quickly sold out, driving prices up to a premium."},{"name":"GEVA","text":"What do you suppose happened next? Greedy artisans sought to cash in on my success. Toads were hunted nigh to extinction, and a host of imitation bags flooded the market."},{"name":"GEVA","text":"I was devastated, as a proud leatherworker and lover of nature both. But what could I do? For weeks, months, I struggled, yet felt powerless against the forces of greed."},{"name":"GEVA","text":"That's when it struck me. Even if I could not stop others from copying my creations, I could at least ensure that their work was not needlessly destructive. I swore a vow that the next line of Geva toadskin bags would be made with an eye towards economy, and that the patterns used to craft these wares would enable inexperienced leatherworkers to reproduce my designs with minimal waste."},{"name":"GEVA","text":"Do you see now, <span class=\"highlight\">Forename</span>? Artisans worthy of the Fen–Yll name do not need to rely on Geva patterns. They already respect the natural world to which we owe our livelihood."},{"name":"GEVA","text":"This is something that cannot be taught, yet it has clearly awakened within you. "},{"name":"GEVA","text":"Which is why I did not hesitate to entrust you with this task─and why you can expect many more to come."}],"reward":{"items":[{"id":2438},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":13}],"quests":[65599]},"next":[65601]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1003674","obj":{"i":1003674,"n":"Sooted Blacksmith","l":53,"q":1}},{"type":"item","id":"2438","obj":{"i":2438,"n":"Apprentice's Awl","l":40,"c":35454,"t":21}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65599","obj":{"i":65599,"n":"Lead by Example","g":140,"l":"Gridania","s":350,"f":1}},{"type":"quest","id":"65601","obj":{"i":65601,"n":"Dissension in the Ranks","g":140,"l":"Gridania","s":450,"f":1}}]}