{"quest":{"name":"Violators Will Be Shot","location":"Gridania","id":65604,"patch":2.0,"sort":150,"icon":100048,"unlocksFunction":1,"eventIcon":71341,"issuer":1000200,"target":1000200,"involved":[1000204],"genre":131,"journal":["Guildmaster Luciane desires that you train under Silvairre.","You have been instructed to train under Silvairre, one of the most experienced archers in the guild. Speak with the Elezen and learn what he requires of you. ","Curt as ever, Silvairre declares that the ability to read and anticipate enemy movements is essential to the art of archery. He then orders you to seek out and destroy targets hidden in the East Shroud─a region rife with savage beasts. If you are to complete this task, you will need to observe the behavior of the local fauna, and identify opportunities to pass by unnoticed. Only then will you be close enough to take aim at your targets.","You have successfully destroyed all of the targets. Report back to Silvairre at the Archers' Guild.","Your feat does little to earn you Silvairre's acceptance. He next tasks you with slaying Nezul Cattlan the Violator, the leader of an Ixali scouting party. Journey to the North Shroud, slip past the scouts, and slay their leader.","You have succeeded in slaying Nezul Cattlan the Violator, prompting his scouts to flee Gridania in disarray. Report back to Silvairre at the Archers' Guild.","Though Silvairre is quick to attribute your success to luck, he grudgingly agrees to stop agitating for your expulsion from the guild. Inform Luciane that you have completed your lesson.","Luciane is well pleased with your showing against the Ixal, and observes that while Silvairre may refuse to acknowledge your skill, his actions send a different message. Having completed the lessons of your superiors, Luciane pronounces you an archer in your own right, and teaches you the Repelling Shot technique to commemorate the occasion. Thus encouraged, you resume your quest for greater mastery of the bow.<br><br>※The next archer quest will be available from Luciane upon reaching level 20."],"objectives":["Speak with Silvairre.","Destroy the targets.","Report to Silvairre.","Defeat Nezul Cattlan the Violator.","Report to Silvairre.","Speak with Luciane.","Defeat Nezul Cattlan the Violator!"],"dialogue":[{"name":"LUCIANE","text":"Welcome back, <span class=\"highlight\">Forename</span>. I trust you have been keeping your nose to the grindstone."},{"name":"LUCIANE","text":"As I mentioned when last we spoke, you will train under Silvairre's tutelage today."},{"name":"LUCIANE","text":"Put aside your misgivings and avail yourself of his wealth of experience. Go now, present yourself before him."},{"name":"SILVAIRRE","text":"Hmph. I see it was too much to hope that you would not return."},{"name":"SILVAIRRE","text":"The others believe that you have potential, but I am not so easily convinced. Like so many adventurers, you have not the faintest <span class=\"emphasis\">inkling</span> of what it means to be an archer."},{"name":"SILVAIRRE","text":"And how could you? Archery is the proud tradition of the Wildwood Elezen. The essence of this art─to read one's enemy─has been instilled in us over <span class=\"emphasis\">centuries</span>. In that time, we have defended this great nation against every imaginable foe, granting us insight which you will never possess."},{"name":"SILVAIRRE","text":"Can you recognize the subtle signs that betray a coming action? No. Can you accurately predict an opponent's movement? No. Can you glean your foe's intentions at a glance? No. And can such things be learned by one who knows nothing of our traditions? <span class=\"emphasis\">No</span>."},{"name":"SILVAIRRE","text":"It is only out of respect for Luciane that I have agreed to teach you."},{"name":"SILVAIRRE","text":"Go to the East Shroud and seek out the targets hidden there. But do not presume this will be as easy as before."},{"name":"SILVAIRRE","text":"As I told you, the ability to read one's enemies is fundamental to archery. Yet the trials set by my colleagues did not require you to do this."},{"name":"SILVAIRRE","text":"Mine will. The targets you seek have been hidden─and I do mean <span class=\"emphasis\">hidden</span>─in the midst of a region rife with savage beasts. They will play the part of your enemies."},{"name":"SILVAIRRE","text":"In the unlikely event that you spy a target, your limited range will necessitate that you slip past its bestial guardians prior to taking aim─a feat I consider beyond you. Hm? Was that a <span class=\"emphasis\">frown</span>? Mayhap you are thinking that the Miqo'te set you a similar task? You are wrong. She asked merely that you consider where your foes are─I demand that you discern precisely where they <span class=\"emphasis\">will be</span>. How, then, will you go about this?"},{"name":"SILVAIRRE","text":"Observe them closely and discern their characteristics. Learn to read their movements and recognize patterns in their behavior."},{"name":"SILVAIRRE","text":"If it has eyes, let it not see you. If it has ears, let it not hear you. Be neither where it is nor where it means to be, and thereby pass unnoticed."},{"name":"SILVAIRRE","text":"But enough talk. Whether or not you heed my counsel is your decision. I will shed no tears should you fail."},{"name":"SILVAIRRE","text":"So you have returned. A passable performance for an adventurer, but the bare minimum for any archer."},{"name":"SILVAIRRE","text":"I carry with me generations of Wildwood tradition─a tradition built upon the bones of the many outsiders who tried to take what is ours."},{"name":"SILVAIRRE","text":"It was <span class=\"emphasis\">my</span> ancestors who first learned to conceal their presence and fight from the shadows, to hold the enemy at distance to protect the weak. All of it, <span class=\"emphasis\">everything</span> was─"},{"name":"SILVAIRRE","text":"This is a waste of time. You <span class=\"emphasis\">cannot</span> understand."},{"name":"SILVAIRRE","text":"But if you are so intent upon following in the footsteps of my people..."},{"name":"SILVAIRRE","text":"I bid you go to the North Shroud. Ixali scouts have been sighted near the river west of E–Tatt's Spire, and─unless you are entirely ignorant of Gridanian history─I need not explain that this act of aggression is part of a centuries-old conflict."},{"name":"SILVAIRRE","text":"The minions do not matter. It is their leader, Nezul Cattlan the Violator, who must fall."},{"name":"SILVAIRRE","text":"He commands the scouts, and will be well guarded. Yet he stands upon hostile ground, with birdmen and not walls for protection. If you are diligent and determined, you can slip through their defenses and slay their leader."},{"name":"SILVAIRRE","text":"This is the art of the Gridanian archer. Embrace the wisdom I have bestowed upon you, and the fight will be short."},{"name":"SILVAIRRE","text":"...If you see the deed done, adventurer, I will take it as proof of your commitment to us, and labor no more to drive you from the guild. Now go."},{"name":"SILVAIRRE","text":"Even now, I struggle to credit the sentries' reports... Yet here you are, and Nezul Cattlan the Violator is no more. That a godsdamned adventurer should be so..."},{"name":"SILVAIRRE","text":"Hmph. Only by the grace of Nymeia Herself could you have survived. But even though it was pure <span class=\"emphasis\">luck</span>, I will keep my word. <span class=\"highlight\">Forename</span>─should you stay or should you go, I...care not."},{"name":"SILVAIRRE","text":"You have completed the task and are no longer my responsibility. Go now to Luciane. She will doubtless wish to lavish you with praise.<br>...Hm? Oh, you'll get no more from me. Off with you!"},{"name":"LUCIANE","text":"I am given to understand that you single-handedly drove off an Ixali scouting party─and that you did so with precision and guile."},{"name":"LEIHALIAPOH","text":"How exactly was that training, Luciane? <span class=\"highlight\">Forename</span>'s just an adventurer. Silvairre thrust <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> into the jaws of the enemy in the hope that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> wouldn't come back!"},{"name":"LEIHALIAPOH","text":"And when, against all expectation, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> <span class=\"emphasis\">did</span> come back, that stubborn arse <span class=\"emphasis\">still</span> refused to acknowledge <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> skill!"},{"name":"LUCIANE","text":"...Is that truly your impression?"},{"name":"LEIHALIAPOH","text":"Well, yes! He said it was pure luck!"},{"name":"LUCIANE","text":"Mere noise. Silvairre sees <span class=\"highlight\">Forename</span>'s skill, of that I have no doubt. Did you not mark the way he covered his mouth when he uttered the words?"},{"name":"LUCIANE","text":"It is a habit of his to do so on those occasions when his tongue and his heart are in disagreement."},{"name":"LUCIANE","text":"For all his skill at reading the idiosyncrasies of others, he has yet to recognize his own."},{"name":"LUCIANE","text":"Impressive work, <span class=\"highlight\">Forename</span>. You have applied yourself to Leih and Silvairre's lessons and demonstrated your command of the core concepts."},{"name":"LUCIANE","text":"You are now an archer in your own right. Allow me to teach you something to commemorate this accomplishment."},{"name":"LUCIANE","text":"Repelling Shot is an advanced technique that enables an archer to evade attacks whilst continuing to fire upon <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> opponent. Used wisely, it can grant you a brief respite in the heat of battle."},{"name":"LUCIANE","text":"I have faith that, with regular practice, you will learn how best to employ it to your advantage. Remember your seniors' lessons as you strive for true mastery."},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“Training with Silvairre”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"IXAL01","text":"Squaaawk! What that!?"},{"name":"MIRAUDONT","text":"Ixal!? In <span class=\"emphasis\">my</span> forest!? Not if I have anything to say about it!"},{"name":"MIRAUDONT","text":"I shall assist you, adventurer!"},{"name":"MIRAUDONT","text":"Ware the leader's magicks! Maintain a safe distance!"},{"name":"MIRAUDONT","text":"Ugh, is...is that all you..."}],"reward":{"action":112,"items":[{"id":1895},{"id":3028,"one":1},{"id":2677,"one":1},{"id":3546,"one":1},{"id":3780,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":6}],"questsType":"any","quests":[65603,65670]},"next":[65606]},"partials":[{"type":"npc","id":"1000200","obj":{"i":1000200,"n":"Luciane","l":52,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000204","obj":{"i":1000204,"n":"Silvairre","l":52,"q":2}},{"type":"action","id":"112","obj":{"i":112,"n":"Repelling Shot","c":366,"j":5,"t":4,"l":15}},{"type":"item","id":"1895","obj":{"i":1895,"n":"Ash Shortbow","l":15,"c":32202,"t":4,"p":708}},{"type":"item","id":"3028","obj":{"i":3028,"n":"Cotton Tabard","l":16,"c":43046,"t":35,"p":508}},{"type":"item","id":"2677","obj":{"i":2677,"n":"Hunting Hat","l":16,"c":41046,"t":34,"p":513}},{"type":"item","id":"3546","obj":{"i":3546,"n":"Fingerless Hard Leather Gloves","l":15,"c":44061,"t":37,"p":420}},{"type":"item","id":"3780","obj":{"i":3780,"n":"Hard Leather Crakows","l":15,"c":46155,"t":38,"p":384}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65603","obj":{"i":65603,"n":"School of Hard Nocks","g":131,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65670","obj":{"i":65670,"n":"Training with Leih","g":131,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65606","obj":{"i":65606,"n":"To Catch a Poacher","g":131,"l":"Gridania","s":200,"f":1}}]}