{"quest":{"name":"Dissension in the Ranks","location":"Gridania","id":65601,"patch":2.0,"sort":450,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"involved":[1000179,1000371,1003675],"genre":140,"usedItems":[3651,2270,4360],"journal":["Geva is running about the guild like a half-crazed chocobo, and looks like she could use a helping hand.","The guildmaster has a crisis on her hands, as three leatherworkers have abruptly left their posts without completing their commissions. You are to take up the slack by crafting three raptorskin pieces of the highest quality─a pair of fingerless gloves, a targe, and a choker─and presenting them to Geva.","Your raptorskin creations have passed Geva's strict inspection. Deliver the fingerless gloves to Pimoh Nelhah at Nophica's Altar, the targe to Leuric at the Carline Canopy, and the choker to Nhago Jawantal at the Shaded Bower.","To varying degrees, all three clients were satisfied with the quality of the goods you furnished. Geva at the Leatherworkers' Guild will want to hear of your success.","While pleased with your efforts, these recent troubles have convinced Geva to forgo this year's exhibition in favor of devoting the guild's limited resources to filling the commissions of its valued clients.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 50."],"objectives":["Present a pair of fingerless raptorskin gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a raptorskin targe <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a raptorskin choker <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Geva.","Deliver the fingerless raptorskin gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Pimoh Nelhah.","Deliver the raptorskin targe <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Leuric.","Deliver the raptorskin choker <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Nhago Jawantal.","Report to Geva."],"dialogue":[{"name":"GEVA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. Now, you have the look of a leatherworker who could do the work of three <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span>."},{"name":"GEVA","text":"And thank the Twelve for that, because three of your good-for-nothing colleagues just walked right out the door, leaving three commissions of the highest priority unfilled."},{"name":"GEVA","text":"A pair of raptorskin fingerless gloves, a raptorskin targe, and a raptorskin choker─I need them, and I need them on the double."},{"name":"GEVA","text":"The promised dates of delivery, you ask? Yesterday, last week, and four fortnights ago─in that order! To make amends for the delays, I've personally assured each of our clients that their items will be of peerless quality. I trust you will not keep them waiting any longer than necessary."},{"name":"GEVA","text":"Time is of the essence, <span class=\"highlight\">Forename</span>. If you have the raptorskin targe, choker, and gloves, show them to me."},{"name":"GEVA","text":"Yes, I suppose these will do."},{"name":"GEVA","text":"The skin of the fleet-footed raptor boasts both superior flexibility and exceptional ruggedness─the rub of course being that it is by no means easy to work with."},{"name":"GEVA","text":"Fingerless gloves are the choice of many a warrior for allowing the fingers to better grip their weapon. Thus do weapon and wielder become one."},{"name":"GEVA","text":"A well-crafted choker affords superior protection without impairing breathing or causing undue discomfort."},{"name":"GEVA","text":"And the targe. At first glance a means of defense, in times of need it can be employed to intimidate or even injure one's foe."},{"name":"GEVA","text":"I presume you were well aware of all this. The quality of your work speaks to a sound understanding of material and implementation alike."},{"name":"GEVA","text":"I see no reason that these items be kept from their purchasers any longer. Deliver them with all speed."},{"name":"GEVA","text":"The gloves to Pimoh Nelhah at Nophica's Altar..."},{"name":"GEVA","text":"The targe, to Leuric at the Carline Canopy..."},{"name":"GEVA","text":"And the choker to a new client by the name of Nhago Jawantal. You'll find her at the Shaded Bower."},{"name":"GEVA","text":"With that, I can finally return to my work for the exhibition. And I swear, the next person who dares interrupt me will see their hide made into the centerpiece of my display!"},{"name":"PIMOHNELHAH","text":"Wait, I recognize you. You're one of Geva's subordinates, yes? Have you perchance come to deliver my gloves?"},{"name":"PIMOHNELHAH","text":"What craftsmanship! Why, it's as if these gloves were tailored to fit each of my fingers."},{"name":"PIMOHNELHAH","text":"This is precisely why I would never think to obtain my protectives from anywhere other than the Leatherworkers' Guild. For Geva to maintain this level of quality with the exhibition at hand is no small feat."},{"name":"LEURIC","text":"You've the look of a leatherworker. Might you know why my commission has been delayed? I've been waiting for my targe for a week now!"},{"name":"LEURIC","text":"This...this is exceptional! No apologies needed, my friend. For a targe of this quality, I'd have gladly waited twice as long."},{"name":"LEURIC","text":"Which is why these rumors of mass resignations are so distressing. What could have possessed good, honest leatherworkers to abandon their craft?"},{"name":"NHAGOJAWANTAL","text":"Hold it right there, you loafing leatherworker! You'll take not another step until you explain why your guild has yet to deliver the choker I commissioned moons ago!"},{"name":"NHAGOJAWANTAL","text":"And it had best not be another overworn excuse, lest I take my business straight to Angrbotha and tell all my friends to do the same!"},{"name":"NHAGOJAWANTAL","text":"Why, this choker... I've never seen such─"},{"name":"NHAGOJAWANTAL","text":"I mean, bah! A choker is a choker. My battle-scarred papa could fashion the likes of this with his one remaining arm tied firmly behind his back."},{"name":"NHAGOJAWANTAL","text":"You brazenly neglect your clients in favor of designing frivolous fashions for some ridiculous exhibition, then expect pay for shoddy work delivered behind schedule? The arrogance of you self-styled artisans knows no bounds."},{"name":"NHAGOJAWANTAL","text":"I hear that even your guild's own have had enough of Guildmaster Geva and her nonsense. Mark my words: the Leatherworkers' Guild is finished. Customers these days want speed and value for their gil, and your lot offers neither."},{"name":"NHAGOJAWANTAL","text":"If the Leatherworkers' Guild is to survive in these competitive times, you and your guildmaster had best remember that the customer should always come first!"},{"name":"GEVA","text":"Nhago said <span class=\"emphasis\">what</span>!? Speed and value!? That mutton-headed Miqo'te wouldn't know a well-crafted choker if I used one to wring her scrawny neck!"},{"name":"GEVA","text":"&lt;sigh&gt; That said, even I must admit there is some truth to her words."},{"name":"GEVA","text":"No self-respecting guild would seek fame and fortune at the exhibition while valued customers suffer undue delays for goods purchased with honest coin."},{"name":"GEVA","text":"I wish it had not come to this, <span class=\"highlight\">Forename</span>, but my decision is made. The Leatherworkers' Guild shall withdraw from this year's exhibition. There are customers out there who appreciate the quality our guild offers, and we must see them well served."},{"name":"GEVA","text":"There will be other exhibitions, but trust once lost is not so easily regained. In any event, you have proven yourself a loyal leatherworker today, <span class=\"highlight\">Forename</span>. I thank you."}],"reward":{"items":[{"id":2426},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":13}],"quests":[65600]},"next":[65602]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000179","obj":{"i":1000179,"n":"Pimoh Nelhah","l":53,"q":1}},{"type":"npc","id":"1000371","obj":{"i":1000371,"n":"Leuric","l":52,"q":1}},{"type":"npc","id":"1003675","obj":{"i":1003675,"n":"Nhago Jawantal","l":53,"q":1}},{"type":"item","id":"2426","obj":{"i":2426,"n":"Mythril Round Knife","l":43,"c":35410,"t":20,"p":5615}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3651","obj":{"i":3651,"n":"Fingerless Raptorskin Gloves","l":45,"c":44103,"t":37,"p":4620}},{"type":"item","id":"2270","obj":{"i":2270,"n":"Raptorskin Targe","l":42,"c":30010,"t":11,"p":5277}},{"type":"item","id":"4360","obj":{"i":4360,"n":"Raptorskin Choker","l":45,"c":54836,"t":40,"p":3234}},{"type":"quest","id":"65600","obj":{"i":65600,"n":"Brand Loyalty","g":140,"l":"Gridania","s":400,"f":1}},{"type":"quest","id":"65602","obj":{"i":65602,"n":"Accept No Imitations","g":140,"l":"Gridania","s":500,"f":1}}]}