{"quest":{"name":"Accept No Imitations","location":"Gridania","id":65602,"patch":2.0,"sort":500,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"involved":[1000286,1003676],"genre":140,"usedItems":[3206],"journal":["Geva appears to be very, very happy to see you.","Geva's decision to withdraw from the exhibition has done little for her nerves, as what little free time she gained has been spent filling commissions for customers. Unable to deliver her wares herself, she has entrusted you with a choker ordered by a client, who is currently waiting at the Whistling Miller.","The customer to whom you delivered the choker turned out to be none other than Dauid, owner of Angrbotha Apparel and Accoutrements, the organization responsible for many of the guild's recent troubles. Not content to disparage Geva and her work, the charlatan also has the audacity to offer you employment. Return to the Leatherworkers' Guild and inform Geva of this troubling development.","Incensed by Dauid's words, Geva bids you represent the Leatherworkers' Guild at the upcoming exhibition. Fashion a raptorskin jerkin enhanced with a gatherer's grasp materia of the third grade, then submit your work to Estaine at Mih Khetto's Amphitheatre.","You complete your jerkin and submit it just in time for the exhibition to begin. Though the judges are initially swayed by Angrbotha's rugged yet serviceable craftsmanship, your late entry quickly earns the accolades of all present, and ultimately the award for best in show. A stunned Dauid is then forced to accompany two Wailers, as his questionable business practices have at last come to light. Return to the Leatherworkers' Guild and report to Geva.","Your triumph at the exhibition leads Geva to declare your apprenticeship is over, and that you are now a full-fledged artisan of the Leatherworkers' Guild. As her hands will be full retraining those who have returned to the guild from Angrbotha, Geva will most assuredly be counting on your aid again. Continue to hone your skills so as not to disappoint her.<br><br>※The next leatherworker quest will be available from Geva once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Deliver Geva's choker to the client.","Speak with Geva.","Deliver a raptorskin jerkin <img class=\"hq-icon small\" src=\"images/item/hq.png\"> melded with a gatherer's grasp materia III to Estaine.","Speak with Geva."],"dialogue":[{"name":"GEVA","text":"Oh, for the love of... <span class=\"highlight\">Forename</span>! You picked a fine time to show up─and for once, I'm not being sarcastic. I'm in quite the predicament here, and you just might be able to help."},{"name":"GEVA","text":"What sort of predicament, you ask? Only the sort in which I have several <span class=\"emphasis\">hundred</span> deliveries to make before the next bell despite having just the two legs you see."},{"name":"GEVA","text":"Withdrawing from the exhibition has freed me to devote my efforts to filling guild commissions. That is all well and good. The problem is that I now have more clients than ever, none of whom take kindly to being kept waiting."},{"name":"GEVA","text":"Bah! For every moment we waste chatting, we risk losing a valued customer. Make yourself useful and take this choker to a client waiting at the Whistling Miller. On the double!"},{"name":"DAUID","text":"From the guild, yes? Have you come to deliver my choker?"},{"name":"DAUID","text":"Ah...true guild quality, as ever. Yes, all the <span class=\"emphasis\">time</span> and <span class=\"emphasis\">effort</span> put into this piece is painfully evident in the overwrought nature of its design."},{"name":"DAUID","text":"We have only just met, but you strike me as a smart young <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. Hence my offer: what say you bid farewell to your fruitless life as Geva's lapdog and come work for me?"},{"name":"DAUID","text":"Who am I, you ask? Why, none other than the founder and proprietor of Angrbotha Apparel and Accoutrements, Gridania's premier producer of leather goods."},{"name":"DAUID","text":"As a clever <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> like you has doubtless surmised, many of your more ambitious colleagues have already abandoned the Leatherworkers' Guild to bring their prodigious talents to Angrbotha."},{"name":"DAUID","text":"And why wouldn't they? Who wants to waste precious hours learning how to stitch the perfect seam when a serviceable one will suffice? Not I, that's for certain."},{"name":"DAUID","text":"Angrbotha products are just as durable as Geva's overrated rubbish, crafted in half the time for a fraction of the cost. Should you have any doubts, I invite you to come by the exhibition and judge for yourself."},{"name":"DAUID","text":"Such a <span class=\"emphasis\">shame</span> that the Leatherworkers' Guild will be absent from the competition. I was so looking forward to defeating dear Geva this year. Ah, well. For all her faults, clearly the woman had sense enough to see that she was fighting a lost cause. Ta-ta, friend, and remember my offer."},{"name":"GEVA","text":"You're back, <span class=\"highlight\">Forename</span>, and not a moment too soon. I've just heard a most distressing rumor."},{"name":"GEVA","text":"Word about town is that renowned leatherworkers from across the realm are withdrawing from the exhibition at an alarming rate."},{"name":"GEVA","text":"Should this continue, Angrbotha will have a clear course to win top honors. Curses! It pains me enough that I cannot represent our guild in the contest, but the thought that those talentless hacks could claim the prize that is rightfully ours..."},{"name":"GEVA","text":"What's that!? Dauid of Angrbotha was the client who commissioned that choker? If I had known, I'd have delivered it in person and taken the payment out of his lousy hide!"},{"name":"GEVA","text":"Oh, yes, the two of us go back quite a ways. He was an adventurer and aspiring leatherworker─not unlike yourself, <span class=\"highlight\">Forename</span>. We had a bit of a falling-out, though."},{"name":"GEVA","text":"I remember like it was yesterday. He strolled through that door wearing a shite-eating grin and holding a jerkin that looked like it had come out the wrong end of an aldgoat."},{"name":"GEVA","text":"I told him as much, and the next moment, he ran back out the door, bawling like a child. That was the last I saw of him."},{"name":"GEVA","text":"His sorry efforts weren't worth the hide they were made from, and now he fancies himself a fashion magnate? Small wonder that Angrbotha attire looks like something even a goblin would be ashamed to wear."},{"name":"GEVA","text":"The sad state of affairs is that not all customers are so discerning. What's worse, if Angrbotha takes top honors at the exhibition, then their wasteful practices will be vindicated."},{"name":"GEVA","text":"Slipshod craftsmanship and butchery will become the norm. I cannot─I <span class=\"emphasis\">will</span> not─allow this to happen."},{"name":"GEVA","text":"<span class=\"highlight\">Forename</span>. Listen carefully, for I mean to give you your most challenging task yet, if not ever."},{"name":"GEVA","text":"You are to represent the Leatherworkers' Guild at the exhibition and put that charlatan in his place."},{"name":"GEVA","text":"A raptorskin jerkin of peerless quality, melded with a gatherer's grasp materia of the third grade─this will be your submission. No simple task, but as one who's taken <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> lumps and paid <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> dues, I believe that you have it in you."},{"name":"GEVA","text":"The exhibition is to be held at Mih Khetto's Amphitheatre. Estaine has been charged with accepting submissions. Once your work is complete, deliver it to her with all speed."},{"name":"ESTAINE","text":"What's that, you say? You wish to submit one of your works for the exhibition? Then pray hand it over without delay─the judging is about to commence."},{"name":"ESTAINE","text":"Consider yourself fortunate. Had you come a bell later, the contest would have already been over! I must say, I am relieved. There are far fewer entrants in this year's exhibition compared to past ones. And when I heard that the Leatherworkers' Guild would not be participating..."},{"name":"GEVA","text":"Then you'll be happy to hear that our plans have changed."},{"name":"ESTAINE","text":"Guildmaster Geva! Do tell me that you've decided to compete, after all!"},{"name":"GEVA","text":"Our guild will be represented, yes, but by <span class=\"highlight\">Forename</span> here."},{"name":"ESTAINE","text":"What an unexpected turn of events! But I must hurry─the exhibition is about to begin!"},{"name":"MAISENTA","text":"And now, ladies and gentlemen, the moment you have all been waiting for: the judging for best leather apparel will now commence!"},{"name":"MAISENTA","text":"It would seem that an unprecedented number of last-minute withdrawals have left us with precious few candidates worthy of top honors. Nevertheless, we will proceed as planned."},{"name":"MAISENTA","text":"Our next finalist is this lovely raptorskin jerkin, painstakingly crafted by an artisan of Angrbotha Apparel and Accoutrements. Judges, if you would."},{"name":"YWAIN","text":"The cut is rugged, yet serviceable. It would seem that numerous skins were layered to afford maximum protection. Function over form─a lancer cannot help but applaud such craftsmanship."},{"name":"BEATINE","text":"The tanning work is clumsy, but the sturdiness of the piece cannot be denied. In times of war, speed and practicality are virtues. I would say that it is worthy of consideration."},{"name":"GEVA","text":"As wasteful as ever, I see. How many raptors did you butcher to create that misshapen mess?"},{"name":"DAUID","text":"Ah, Geva. Fancy meeting you here. Stand back and watch as that <span class=\"emphasis\">misshapen mess</span> is named best in show."},{"name":"MAISENTA","text":"Our next and final piece is this last-minute entry from the Leatherworkers' Guild."},{"name":"GEVA","text":"You look pale, Dauid. What's the matter? I take it you weren't expecting actual competition?"},{"name":"OAPPPESI","text":"Why, this is positively stunning. One can almost feel the raptor's very life force exuding from this jerkin."},{"name":"FUFUCHA","text":"Not a single seam out of place, and not a single cut of the hide wasted. This piece was clearly crafted with a profound respect for the beast whose life was taken to create it."},{"name":"LUCIANE","text":"It offers superior protection to the Angrbotha piece, while at the same time allowing for greater freedom of movement. This jerkin would be a proud addition to any archer's armory chest."},{"name":"MIOUNNE","text":"In my line of work, I have seen many an adventurer come and go. Rare is the one who possesses the aptitude and diligence demonstrated by the creator of this piece."},{"name":"MAISENTA","text":"Ladies and gentlemen! It would appear that we have a consensus!"},{"name":"MAISENTA","text":"By unanimous vote, the award for best leather apparel goes to...<span class=\"highlight\">Forename</span> of the Leatherworkers' Guild, for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> exquisite raptorskin jerkin!"},{"name":"SOLDIER","text":"Dauid of Angrbotha Apparel, I presume?"},{"name":"SOLDIER","text":"We are investigating numerous accusations of harassment, extortion, counterfeiting, and poaching. If you would be so kind as to come with us so that we might discuss these allegations in private..."},{"name":"GEVA","text":"Well, <span class=\"highlight\">Forename</span>. It seems our work here is done. Let us return to the guild."},{"name":"GEVA","text":"I must confess, <span class=\"highlight\">Forename</span>. Until I saw your jerkin with my own eyes, I was not entirely convinced you had it in you. "},{"name":"GEVA","text":"But you did. From this day forth, I am proud to call you not apprentice, but peer."},{"name":"GEVA","text":"As for me, I can <span class=\"emphasis\">finally</span> return to my own work free of headaches and distractions!"},{"name":"GEVA","text":"Though, as luck would have it, we have a veritable legion of erstwhile Angrbotha defectors knocking at our door, looking to rejoin our ranks."},{"name":"GEVA","text":"They think their false tears and trite words of remorse will earn them my pity? Hah! I'll send them straight on their way, and lop a square off their hindquarters for good measure!"},{"name":"GEVA","text":"...Or so I once might have done. But who among us has not erred? Even I have been known to make mistakes, albeit rarely."},{"name":"GEVA","text":"And so I will give these turncloaks a second chance. But mark my words: any who so much as <span class=\"emphasis\">thinks</span> of crossing me again can look forward to a new life as a subligar!"},{"name":"GEVA","text":"The life of a guildmaster is fraught with frustration. Yet I would gladly deal with a thousand hapless apprentices for even the slimmest hope of seeing one flourish as you have."},{"name":"GEVA","text":"With your triumph at the exhibition, your goods are sure to be in demand across Eorzea. But you must never forget how you achieved your success."},{"name":"GEVA","text":"Unflagging dedication to your craft, and a deep respect for the lives you must take to perform it. Remember always the values of Fen–Yll, and I have no doubt that you will do us proud wherever you go."},{"name":"SYSTEM","text":"This concludes the leatherworker quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next leatherworker quest will be available from Geva."}],"reward":{"items":[{"id":2429},{"id":2924,"one":1},{"id":3710,"one":1},{"id":3931,"one":1},{"num":3,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":13}],"quests":[65601]},"next":[67611]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000286","obj":{"i":1000286,"n":"Estaine","l":53,"q":4}},{"type":"npc","id":"1003676","obj":{"i":1003676,"n":"Dauid","l":53,"q":1}},{"type":"item","id":"2429","obj":{"i":2429,"n":"Pinga","l":55,"c":35411,"t":20,"p":1000}},{"type":"item","id":"2924","obj":{"i":2924,"n":"Leatherworker's Hat","l":55,"c":41142,"t":34}},{"type":"item","id":"3710","obj":{"i":3710,"n":"Leatherworker's Gloves","l":55,"c":44185,"t":37}},{"type":"item","id":"3931","obj":{"i":3931,"n":"Leatherworker's Workboots","l":55,"c":46345,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"3206","obj":{"i":3206,"n":"Raptorskin Jerkin","l":48,"c":42223,"t":35,"p":7191}},{"type":"quest","id":"65601","obj":{"i":65601,"n":"Dissension in the Ranks","g":140,"l":"Gridania","s":450,"f":1}},{"type":"quest","id":"67611","obj":{"i":67611,"n":"Turndown Service","g":140,"l":"Gridania","s":502,"f":1}}]}