{"quest":{"name":"A Simple Plan","location":"The Rising Stones","id":65618,"patch":2.4,"sort":71,"eventIcon":71201,"issuer":1010147,"target":1010147,"involved":[1010039,1010040,1010041,1010109,1010110,1010111,1010112],"genre":2,"journal":["Minfilia has never been one to hesitate when it comes to asking others for aid.","It would seem that Minfilia's claims of progress on the matter of finding a way into Iceheart's sanctuary are somewhat premature. After a lengthy discussion with Urianger, the Antecedent has concluded that the Scions in Revenant's Toll lack the expertise to develop a solution and must therefore turn to another for assistance─a Sharlayan colleague who is currently en route to Mor Dhona. Minfilia invites you to accompany her to the northern gates, where she intends to greet the newcomer's arrival.","While you and Minfilia converse upon matters deep and profound, a carriage arrives in Revenant's Toll. A tall Roegadyn woman disembarks from it, whom Minfilia introduces to you as Moenbryda, an accomplished Sharlayan scholar and an authority on aetheryte technologies. Now that your new colleague has arrived, it would seem a good time to trouble Minfilia for a plan of action.","Eager to resolve the situation in Snowcloak, Minfilia and Moenbryda return to the Rising Stones. Join them in the solar where you can discuss the matter in private.","It turns out that Moenbryda's meeting with the other Scions is less an introduction and more a reunion─a particularly emotional one, in the case of Urianger. Setting her mind to the problem of the missing aetheryte, she quickly devises a solution involving white auracite, a material she has been researching for the purpose of capturing Ascian souls. By using it to channel a burst of concentrated aether into the aetheryte by which Iceheart escaped, she believes she can recreate the beacon at the opposite end. If successful, it should theoretically be possible for you to teleport to it. Should it fail, of course, any such attempt would result in your death─a painless death, to be sure, but a permanent one nonetheless."],"objectives":["Wait for the carriage outside Revenant's Toll.","Speak with Minfilia."],"dialogue":[{"name":"MINFILIA","text":"As you may recall, Iceheart used the aetheryte in the depths of Snowcloak to teleport a short distance to the west─most likely to a sanctuary of some description. It is there that we suspect she means to summon Shiva using the crystals she stole from the House Fortemps caravan."},{"name":"MINFILIA","text":"The heretics believe that they are bringing about the second coming of their patron saint. But if, as we suspect, they mean to hold a summoning ritual of the kind employed by the beast tribes, it seems likely that the result will be something more akin to a primal."},{"name":"MINFILIA","text":"Suffice it to say, they must be stopped─and stop them we shall. But first, we must surmount the obstacle that Iceheart has placed in our path."},{"name":"MINFILIA","text":"Ordinarily, it would be a simple matter to tap into the established Aethernet and thereby follow our quarry. However, despite our best efforts, we have been unable to ascertain the position of the aetheryte to which she teleported."},{"name":"MINFILIA","text":"Our prevailing theory is that she destroyed the second aetheryte upon arrival─a reckless, desperate measure, but also an effective one."},{"name":"MINFILIA","text":"After discussing the matter at length with Urianger, we have concluded that we lack the expertise to develop a solution."},{"name":"MINFILIA","text":"...Which is why we have called upon the aid of one who <span class=\"emphasis\">does</span> possess such expertise─a colleague of ours who is currently en route to Revenant's Toll from Sharlayan. She should be arriving within the hour, in fact."},{"name":"MINFILIA","text":"Since you are here, mayhap we could welcome her together. I am certain she would appreciate the gesture. Let us make our way to the northern gates and await her coming."},{"name":"MINFILIA","text":"What manner of woman is she, I wonder...? We have spoken before via linkpearl, of course, but it is not the same."},{"name":"YDA","text":"I can't wait until she gets here! We have <span class=\"emphasis\">so</span> much to talk about!"},{"name":"PAPALYMO","text":"Master Louisoix did think quite highly of her. On the other hand, so does Yda..."},{"name":"THANCRED","text":"The arrival of a newcomer has ever been cause for celebration─doubly so when she's an attractive young lady. A bard could wish for no better audience. Mayhap I shall regale her with the tale of our battle against Leviathan's thralls─how I soared over my opponent's axe and brought him low with my blades..."},{"name":"YSHTOLA","text":"Only those with proven expertise receive the mark─as our newcomer has. Pay no heed to her manner."},{"name":"MOENBRYDA","text":"For an outpost in an aether-rich wasteland, this place is a good deal livelier than I expected. Just goes to show that you never know until you know."},{"name":"MINFILIA","text":"Let us return to the Rising Stones at once, then. We have much to discuss."},{"name":"MOENBRYDA","text":"Is that Tupsimati on the wall back there? I'm amazed you managed to find all the pieces after...well...you know."}],"reward":{"gil":658,"items":[{"id":9335}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69423]},"next":[65620]},"partials":[{"type":"npc","id":"1010147","obj":{"i":1010147,"n":"Minfilia","l":481,"q":4}},{"type":"npc","id":"1010039","obj":{"i":1010039,"n":"Minfilia","l":67,"q":1}},{"type":"npc","id":"1010040","obj":{"i":1010040,"n":"Moenbryda","l":67,"q":1}},{"type":"npc","id":"1010041","obj":{"i":1010041,"n":"Moenbryda","l":481,"q":1}},{"type":"npc","id":"1010109","obj":{"i":1010109,"n":"Thancred","l":481,"q":1}},{"type":"npc","id":"1010110","obj":{"i":1010110,"n":"Yda","l":481,"q":1}},{"type":"npc","id":"1010111","obj":{"i":1010111,"n":"Papalymo","l":481,"q":1}},{"type":"npc","id":"1010112","obj":{"i":1010112,"n":"Y'shtola","l":481,"q":1}},{"type":"item","id":"9335","obj":{"i":9335,"n":"Bacon Broth","l":110,"c":24103,"t":46}},{"type":"quest","id":"69423","obj":{"i":69423,"n":"In Flagrante Delicto","g":2,"l":"Gridania","s":70}},{"type":"quest","id":"65620","obj":{"i":65620,"n":"The Instruments of Our Deliverance","g":2,"l":"The Rising Stones","s":72}}]}