{"quest":{"name":"Doman Connection","location":"Gridania","id":65616,"patch":2.4,"sort":69,"eventIcon":71201,"target":1010034,"involved":[1009975,1009986,1010020,1010021],"genre":0,"journal":["Ilberd is eager to resume the pursuit of Eline Roaille.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ilberd in Gridania.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","After joining Ilberd at Sweetbloom Pier, the two of you are met by Yugiri, who informs you that Eline Roaille is headed in the direction of the Hawthorne Hut. However, your reunion with the Garlean spy must wait, for another matter requires your immediate attention. An imperial squadron has set forth from Castrum Oriens on a mission to destroy an Alliance communications-jamming device in the South Shroud. If they succeed, Eline Roaille may well abort her secret rendezvous, thus depriving you of the chance to secure damning evidence of her treachery. Make haste to the South Shroud, and seek out the shinobi at Quarrymill who will brief you on the situation.","The shinobi informs you that the advancing imperial squadron is presently near Amdapor Keep. Intercept the Garleans, and destroy their magitek weapons.","You have destroyed all the death claws. Report your success to the shinobi who awaits nearby.","With the imperial squadron defeated, the jamming device is now safe. As such, Eline Roaille will have no choice but to communicate with her accomplices in person. All that remains is to catch her in the act."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ilberd in Gridania.</span>"],"dialogue":[{"name":"ILBERD","text":"Our hunt leads us to the East Shroud, Scion. I suggest we follow Roaille's example and take the ferry from Westshore Pier."},{"name":"ILBERD","text":"You'll doubtless wish to make certain preparations. See to them while I go on ahead. I shall wait for you at Sweetbloom Pier."},{"name":"YUGIRI","text":"This way, my friends."},{"name":"YUGIRI","text":"Your quarry makes for the Hawthorne Hut."},{"name":"ILBERD","text":"Very good. We must make haste─"},{"name":"YUGIRI","text":"A moment, Captain."},{"name":"YUGIRI","text":"There is another matter which requires your attention─and most urgently, I fear."},{"name":"ILBERD","text":"What is it?"},{"name":"YUGIRI","text":"A short while ago, an imperial squadron was observed departing Castrum Oriens. They march at speed for the South Shroud."},{"name":"ILBERD","text":"So they have decided to take action..."},{"name":"YUGIRI","text":"Indeed. They seek to destroy the jamming device."},{"name":"ILBERD","text":"An explanation is in order. You may be aware that the Garleans have their own method of communicating over great distances."},{"name":"ILBERD","text":"Well, our ingenious friends at Garlond Ironworks have provided us with devices which disrupt these communications, and we have installed them around the city–states. In so doing, we have made it difficult for imperial agents to correspond with their masters."},{"name":"ILBERD","text":"Of course, we did not expect the Garleans to remain silent. If they wished to communicate, they would find a way, be it via covert correspondence or secret meetings."},{"name":"ILBERD","text":"Needless to say, we hoped they would risk the latter. And Roaille has not disappointed us."},{"name":"ILBERD","text":"As a well-known face in the Immortal Flames, she cannot move about Thanalan without being recognized. It would only be a matter of time before someone saw through her disguise."},{"name":"ILBERD","text":"'Tis for this reason, I believe, that she has chosen the Black Shroud for her clandestine meeting. <span class=\"alternative-container\"><span class=\"alternative\">This place is home to many of your kind</span><span class=\"alternative\">The Elezen are a common sight here</span></span>, and <span class=\"alternative-container\"><span class=\"alternative\">the arrival of one more Elezen is</span><span class=\"alternative\">her comings and goings are</span></span> not like to turn any heads."},{"name":"YUGIRI","text":"However, were the jamming device to be rendered inoperative, Roaille would no longer need to meet her masters in person, and their planned rendezvous would almost certainly be called off."},{"name":"ILBERD","text":"...And we cannot have that. It would deprive us of the opportunity to secure damning evidence against her─which is the very least we need if we're to convict someone of her standing."},{"name":"YUGIRI","text":"All rests upon the continued operation of the jamming device. It must needs be protected. If you could attend to this task, my shinobi and I will continue to observe Roaille."},{"name":"ILBERD","text":"Very well. Scion─I would have you intercept the Garleans while my men move to cut off their retreat. None must escape."},{"name":"YUGIRI","text":"Several of my countrymen have already taken up positions in the South Shroud. Seek out the shinobi at Quarrymill, and he will apprise you of the situation."},{"name":"YUGIRI","text":"Pray seek out the shinobi at Quarrymill. He will apprise you of the situation."},{"name":"ILBERD","text":"Make haste and find those Garleans. I will send my men to cut off their retreat."},{"name":"SHINOBI00080","text":"We meet again, my friend. I have no Mun–Tuy tonic to offer this time, I'm afraid."},{"name":"SHINOBI00080","text":"As I believe you know, imperial forces are in the South Shroud on a mission to destroy the jamming device. We must see to it that they do not succeed."},{"name":"SHINOBI00080","text":"...So the Crystal Braves will cut off their retreat? Very well."},{"name":"SHINOBI00080","text":"My countrymen and I shall attend to the soldiers. Their infernal machines, we leave in your capable hands."},{"name":"SHINOBI00080","text":"At present, the Garleans are in the vicinity of Amdapor Keep. Let us head there at once."},{"name":"SHINOBI00080","text":"The Garleans are in the vicinity of Amdapor Keep. Let us head there at once."},{"name":"SHINOBI00080","text":"That was a most impressive showing, my friend."},{"name":"SHINOBI00080","text":"As you can see, we too have not been idle. The Ivy will receive no warning of our coming."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65615]},"next":[65617]},"partials":[{"type":"npc","id":"1010034","obj":{"i":1010034,"n":"Shinobi","l":56,"q":1}},{"type":"npc","id":"1009975","obj":{"i":1009975,"n":"Yugiri","l":55,"q":1}},{"type":"npc","id":"1009986","obj":{"i":1009986,"n":"Ilberd","l":55,"q":1}},{"type":"npc","id":"1010020","obj":{"i":1010020,"n":"Ilberd","l":55,"q":1}},{"type":"npc","id":"1010021","obj":{"i":1010021,"n":"Shinobi","l":56,"q":1}},{"type":"quest","id":"65615","obj":{"i":65615,"n":"Chasing Ivy","g":0,"l":"Gridania","s":68}},{"type":"quest","id":"65617","obj":{"i":65617,"n":"In Flagrante Delicto","g":0,"l":"South Shroud","s":70}}]}