{"quest":{"name":"Chasing Ivy","location":"Gridania","id":65615,"patch":2.4,"sort":68,"eventIcon":71201,"target":1010017,"involved":[1010011,1010012,1010013,1010014,1010015,1010016,1010018,1010019],"genre":0,"journal":["Ilberd is convinced that he has discovered the Ivy's identity and is preparing to move against the Garlean spy.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ilberd in Gridania.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Eline Roaille appears to be bound for the Blue Badger Gate. Continue to shadow the suspect.","Eline Roaille has entered the Carline Canopy, and Ilberd bids you look for her within. If she is not on the upper level, take your search to the landing area below and speak with Crystal Brave Ephemie.","Ephemie is certain that Eline Roaille has not boarded an airship. Make your way back outside the Carline Canopy, and report her mysterious disappearance to Ilberd.","Ilberd believes that Eline Roaille may have availed herself of a room at the Roost to throw pursuers off her trail. While he conducts a thorough search of the premises, speak with the Crystal Braves posted at Gridania's four main egresses─the Blue Badger Gate, the White Wolf Gate, the Yellow Serpent Gate, and Westshore Pier. If the flame marshal has left the city, one of them will surely have spotted her.","It would seem that none of the Crystal Braves stationed around Gridania have seen Eline Roaille. Report your findings to Ilberd, who awaits you at the aetheryte plaza.","Just when it seems as though your quarry has eluded you, a shinobi of Doma appears with word that Eline Roaille has left Gridania by way of Westshore Pier. Your hunt will next take you to the East Shroud."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ilberd in Gridania.</span>"],"dialogue":[{"name":"ILBERD","text":"Listen well. The spy we have been seeking all this time is none other than Flame Marshal Eline Roaille, Raubahn's second-in-command."},{"name":"ILBERD","text":"Prior to joining the Immortal Flames, she was a mercenary of no small renown. They say her skill with a polearm had to be seen to be believed."},{"name":"ILBERD","text":"Of Ishgardian birth, she is the highest-ranked foreigner in the Immortal Flames─barring the Flame General himself, of course."},{"name":"ILBERD","text":"When he formed the Grand Company, Raubahn chose people based on their worth. Whence they hailed was of no interest."},{"name":"ILBERD","text":"The Monetarists saw things differently, however. Having funded the enterprise, they reserved the right to reject candidates nominated for high-ranking positions."},{"name":"ILBERD","text":"And 'twas no secret that they did not favor foreigners─Ishgardians especially, after the way the Holy See forsook the Alliance."},{"name":"ILBERD","text":"Yet the Monetarists did not raise so much as a murmur of protest when Roaille was appointed to her post. Passing strange, is it not? Could it be that the Ivy has some hold over the Monetarists?"},{"name":"ILBERD","text":"...But these revelations are secondary to our current mission. Of foremost interest to us is Roaille's presence here now. As you may be aware, it is the duty of the flame marshal to command the Immortal Flames in the absence of the Flame General. While Raubahn attended the council of Alliance leaders, she <span class=\"emphasis\">should</span> have remained in the Hall of Flames."},{"name":"ILBERD","text":"The woman has no business being in Gridania─yet here she is nonetheless, on some pretense. She is up to something, mark my words."},{"name":"ILBERD","text":"Even as we speak, I have a dozen men trawling the Flames' records for evidence of Roaille's guilt─but if we can catch her red-handed, we shall have all the proof we need."},{"name":"ILBERD","text":"...Which brings me to the plan. I have people watching the city gates, the airship landing, and the docks─every point of egress. She cannot leave without our knowledge. All that remains is to shadow her until she betrays her true purpose. Can I rely upon your eyes, Scion?"},{"name":"ILBERD","text":"You have my thanks. Let us go, then, and take care not to alert our quarry."},{"name":"ILBERD","text":"Roaille is headed in the direction of the Blue Badger Gate. With me, Scion."},{"name":"ROAILLE","text":"Ahhh... The forest air is so cleansing. I feel like a new woman every time I visit Gridania."},{"name":"ILBERD","text":"So, Roaille has entered the Carline Canopy... Meeting someone, perchance? Or could it be she means to board an airship?"},{"name":"ILBERD","text":"Pray look for her within. If she is not on the upper floor, try the landing area below."},{"name":"ILBERD","text":"One of mine is stationed there, and she may have seen something. Ephemie is her name. I shall remain here in case Roaille reappears."},{"name":"ILBERD","text":"Quickly now─look for Roaille inside the Carline Canopy. If she is not on the upper floor, try the landing area below. Speak with Ephemie─she may have seen something."},{"name":"EPHEMIE","text":"<span class=\"highlight\">Forename Surname</span>! Such an unexpected pleasure! What brings you here?"},{"name":"EPHEMIE","text":"Ahem. <span class=\"emphasis\">A social visit</span>, you say? How pleasant! (No─she didn't come this way. I've noted every passenger, and none bore any resemblance.) Well, don't let me keep you!"},{"name":"EPHEMIE","text":"Still no sign of your friend, I'm afraid! (And I mean that.) I do hope you find <span class=\"emphasis\">him</span>!"},{"name":"ILBERD","text":"...Nowhere to be seen, you say? And you are sure she did not board an airship?"},{"name":"ILBERD","text":"Hmph. She did not come back out, either. Where in the seven hells could she have gone...?"},{"name":"ILBERD","text":"...The Roost! How could I forget!?"},{"name":"ILBERD","text":"Rhalgr strike me down for a fool!"},{"name":"ILBERD","text":"I will search the premises. While I do that, I need you to speak with the men I posted at the three main gates and the pier."},{"name":"ILBERD","text":"Find out whether there has been any suspicious activity, and then meet me at the aetheryte plaza."},{"name":"SECONDSQUADRON00079","text":"Nothing to report at this gate, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>! No one resembling the suspect has been here, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>!"},{"name":"SECONDSQUADRON00079","text":"Nothing to report at this gate, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>! No one resembling the suspect has been here, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>!"},{"name":"SECONDSQUADRON00079","text":"No, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. The suspect didn't come this way. Given how little traffic passes through this gate, I would have noticed if she'd tried to slip by."},{"name":"SECONDSQUADRON00079","text":"The suspect didn't come this way. Given how little traffic passes through this gate, I would have noticed if she'd tried to slip by."},{"name":"SECONDSQUADRON00079","text":"...The suspect? Haven't seen her. Best check with one o' the others."},{"name":"SECONDSQUADRON00079","text":"Suspect hasn't been here, sorry to say. Best check with one o' the others."},{"name":"SECONDSQUADRON00079","text":"No, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. A few Elezen women <span class=\"emphasis\">did</span> leave on the last ferry, but none of them matched the suspect's description."},{"name":"SECONDSQUADRON00079","text":"A handful of Elezen women <span class=\"emphasis\">did</span> take the ferry, but none of them matched the suspect's description."},{"name":"ILBERD","text":"Well? Have there been any sightings?"},{"name":"ILBERD","text":"Damn it all. I turned the Roost upside down, but Roaille was nowhere to be found."},{"name":"ILBERD","text":"The innkeeper told me that she had availed herself of a room, but no one saw her leave. She has donned some manner of disguise, of that there can be no doubt, but as to where she has gone..."},{"name":"SHINOBI00079","text":"(-Peddler-)Greetings, good sir. Might I interest you in some Mun–Tuy tonic? A cup a day imbues a man with great <span class=\"emphasis\">vigor</span>, if you take my meaning. Heh heh..."},{"name":"ILBERD","text":"Perhaps another time, friend."},{"name":"ILBERD","text":"...Wait. That necklace─ You are a shinobi of Doma."},{"name":"SHINOBI00079","text":"The woman you seek has left Gridania by way of Westshore Pier."},{"name":"SHINOBI00079","text":"She was attired as a merchant, but these eyes are not so easily deceived."},{"name":"SHINOBI00079","text":"You may wish to take your search to the East Shroud. Rest assured that we shall continue to support you from the shadows."},{"name":"ILBERD","text":"Thank the Twelve for the Domans. Were it not for their unique talents, Roaille would have disappeared without a trace."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65614]},"next":[65616]},"partials":[{"type":"npc","id":"1010017","obj":{"i":1010017,"n":"Ilberd","l":52,"q":1}},{"type":"npc","id":"1010011","obj":{"i":1010011,"n":"Eline Roaille","l":52,"q":2,"t":"Flame Marshal"}},{"type":"npc","id":"1010012","obj":{"i":1010012,"n":"Ephemie","l":52,"q":1}},{"type":"npc","id":"1010013","obj":{"i":1010013,"n":"2nd Unit Brave","l":52,"q":1}},{"type":"npc","id":"1010014","obj":{"i":1010014,"n":"2nd Unit Brave","l":52,"q":1}},{"type":"npc","id":"1010015","obj":{"i":1010015,"n":"2nd Unit Brave","l":53,"q":1}},{"type":"npc","id":"1010016","obj":{"i":1010016,"n":"2nd Unit Brave","l":53,"q":1}},{"type":"npc","id":"1010018","obj":{"i":1010018,"n":"Ilberd","l":52,"q":3}},{"type":"npc","id":"1010019","obj":{"i":1010019,"n":"Eline Roaille","l":52,"q":1,"t":"Flame Marshal"}},{"type":"quest","id":"65614","obj":{"i":65614,"n":"Tendrils of Intrigue","g":2,"l":"Coerthas Central Highlands","s":67}},{"type":"quest","id":"65616","obj":{"i":65616,"n":"Doman Connection","g":0,"l":"Gridania","s":69}}]}