{"quest":{"name":"The Road Less Traveled","location":"Coerthas Central Highlands","id":65622,"patch":2.4,"sort":73,"eventIcon":71201,"issuer":1010042,"target":1007603,"involved":[1006384,1006444,1009977,1009984,1009985,1010065],"genre":2,"journal":["Moenbryda remains unconvinced that you have not sustained a head injury.","Seeing little point in pondering the implications of your tale in Coerthas, Moenbryda declares that she and the others will return to the Rising Stones. Before you join them, journey to Whitebrim Front and inform Alphinaud that you are still alive, among other things.","Alphinaud's voice swells with pride as he asks you to recount the events in Snowcloak. Though he is disappointed and concerned by Iceheart's success in summoning Shiva, Ser Aymeric advises him to take solace in your victory. As further comfort, he reveals that some of the supplies stolen from the House Fortemps caravan have been recovered and will be delivered to Revenant's Toll forthwith. The lord commander then requests that you accompany him to Camp Dragonhead, as it seems a certain lord has been praying for your safe return.","Lord Haurchefant is more than a little distressed that you did not think to involve him in your daring endeavor. Though plainly overjoyed that you survived, it is clear that the stress has taken its toll on him. Composing himself, he informs you that Ser Aymeric has requested a private audience with you and Alphinaud in the intercessory, though he makes no mention of what the lord commander wishes to discuss.","The cordial mood between Alphinaud and Ser Aymeric abruptly turns sour when the Scion accuses his counterpart of manipulating the situation to his advantage. In response, the lord commander all but declares his desire to work with Alphinaud for the betterment of Eorzea, while stressing that a man in his position must act with the utmost discretion. Alphinaud relents, having at last gained an understanding of the pragmatic ambassador, and the rift between the two is quickly mended. Ser Aymeric then formally introduces his second-in-command, Lucia, who will act as his representative when he is otherwise indisposed. As a final gesture of goodwill, the lord commander shares the results of the Ishgardian investigation into the heretics' attacks with Alphinaud, which should help the Crystal Braves to dismantle the remainder of Eline Roaille's network of spies. Whatever else Ishgard may be, it is plain that she is no friend to Garlemald."],"objectives":["Speak with Alphinaud at Whitebrim Front.","Speak with Haurchefant at Camp Dragonhead.","Speak with the House Fortemps guard."],"dialogue":[{"name":"MOENBRYDA","text":"If you ask me, there's naught to be gained from mulling over the implications of your story in the freezing cold. Let's save it for the Rising Stones, eh? I'll get everyone to meet us there."},{"name":"MOENBRYDA","text":"Ah, but before that, you had best pay a visit to Whitebrim Front and speak with Alphinaud. He's probably worried sick about you."},{"name":"MOENBRYDA","text":"That, or he's busy playing at politics with the Ishgardians. Either way, I'm sure he'll be delighted to see you hale and healthy. Speaking of which─you don't have a headache or anything, do you? No? ...Blurred vision? Oh, no reason!"},{"name":"MOENBRYDA","text":"See you again soon!"},{"name":"DRILLEMONT","text":"I still remember the first time you entered these chambers. Suffice it to say, I never imagined that I would one day be so glad of your return. Welcome, my friend. Welcome."},{"name":"LUCIA","text":"(-Taciturn Temple Knight-)...'Tis customary to report to one's commanding officer after completing a mission."},{"name":"AYMERIC","text":"That you stand here now is proof of your mission's success. Praise be to Halone."},{"name":"ALPHINAUD","text":"There <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is─and none the worse for wear! Was there ever any doubt that the Warrior of Light would succeed?"},{"name":"ALPHINAUD","text":"I think I speak for us all when I say that I should like nothing more than to hear the stirring tale of your victory─if you would be so kind."},{"name":"ALPHINAUD","text":"Then we were too late to prevent the summoning..."},{"name":"AYMERIC","text":"But not too late to prevent further loss of life. An outcome worthy of celebration..."},{"name":"AYMERIC","text":"And one for which we have <span class=\"highlight\">Forename</span> to thank."},{"name":"ALPHINAUD","text":"Yes... You are right, of course, Ser Aymeric. We should be content with what we have accomplished."},{"name":"AYMERIC","text":"I for one could not have wished for a better outcome. Shiva is no longer a threat, and the heretics have been routed."},{"name":"AYMERIC","text":"Aye, there is the matter of Iceheart's escape, but she cannot run forever. Whether it takes days, weeks, moons, or even years, my knights will find her."},{"name":"AYMERIC","text":"In the meantime─ Lord Drillemont, is the caravan ready?"},{"name":"DRILLEMONT","text":"The supplies that your men recovered have been prepared for transport, in accordance with your wishes."},{"name":"DRILLEMONT","text":"Rest assured that my knights will see them safely to Revenant's Toll."},{"name":"AYMERIC","text":"Of that I have no doubt."},{"name":"ALPHINAUD","text":"I take it these are the selfsame supplies the heretics stole from the House Fortemps caravan?"},{"name":"AYMERIC","text":"Less the crystals which comprised the bulk of the shipment, yes. Scarcely a fraction of that which was promised, but a meaningful contribution to your cause all the same."},{"name":"AYMERIC","text":"Ah, on an unrelated note... <span class=\"highlight\">Forename</span>─might I trouble you to accompany me to Camp Dragonhead at your earliest convenience?"},{"name":"AYMERIC","text":"'Tis not for my benefit. A certain lord was most distressed when he learned of your intent to risk life and limb to stop Iceheart. It took half a dozen knights to restrain him, I am told."},{"name":"AYMERIC","text":"Men give vent to their anxieties in myriad ways. Pray do not think less of him."},{"name":"ALPHINAUD","text":"If our business here is concluded, we should attend to Ser Aymeric in the intercessory."},{"name":"HAURCHEFANT","text":"What were you thinking, <span class=\"highlight\">Forename</span>!? Wagering your very being on a dubious theory which <span class=\"emphasis\">might</span> allow you to enter Iceheart's lair─knowing full well that she could have sufficient forewarning to complete her ritual to summon Shiva anyway...?"},{"name":"HAURCHEFANT","text":"And then─and <span class=\"emphasis\">then</span>─engaging the abomination in mortal combat!? By the Fury, <span class=\"highlight\">Forename</span>! 'Tis the stuff of ballads! A battle for the ages! Would that I had been there to fight by your side!"},{"name":"HAURCHEFANT","text":"Yet here I was forced to wait─<span class=\"emphasis\">condemned</span> to wonder at the fate of a dear friend for a veritable <span class=\"emphasis\">eternity</span>!"},{"name":"HAURCHEFANT","text":"I would not wish such torture on my most hated enemy..."},{"name":"HAURCHEFANT","text":"&lt;sigh&gt; But you are here now, and that is what truly matters. Let us move on."},{"name":"HAURCHEFANT","text":"Ser Aymeric wished to have words with you and Master Alphinaud in private. He awaits us in the intercessory."},{"name":"HAURCHEFANT","text":"Pray go on ahead without me, <span class=\"highlight\">Forename</span>. Another matter requires my attention, but I shall join you anon."},{"name":"FORTEMPSGUARD00054","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I shall show you in at once."},{"name":"FORTEMPSGUARD00054","text":"Proceed to the intercessory?"},{"name":"FORTEMPSGUARD00054","text":"Yes"},{"name":"FORTEMPSGUARD00054","text":"No"}],"reward":{"gil":758,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65620]},"next":[65623]},"partials":[{"type":"npc","id":"1010042","obj":{"i":1010042,"n":"Moenbryda","l":63,"q":2}},{"type":"npc","id":"1007603","obj":{"i":1007603,"n":"House Fortemps Guard","l":63,"q":4,"t":"Gatekeep"}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006444","obj":{"i":1006444,"n":"Drillemont","l":63,"q":13}},{"type":"npc","id":"1009977","obj":{"i":1009977,"n":"Alphinaud","l":63,"q":5}},{"type":"npc","id":"1009984","obj":{"i":1009984,"n":"Alphinaud","l":63,"q":3}},{"type":"npc","id":"1009985","obj":{"i":1009985,"n":"Aymeric","l":63,"q":3}},{"type":"npc","id":"1010065","obj":{"i":1010065,"n":"Taciturn Temple Knight","l":63,"q":3}},{"type":"quest","id":"65620","obj":{"i":65620,"n":"The Instruments of Our Deliverance","g":2,"l":"The Rising Stones","s":72}},{"type":"quest","id":"65623","obj":{"i":65623,"n":"Eyes Unclouded","g":2,"l":"Coerthas Central Highlands","s":74}}]}