{"quest":{"name":"Trial by Water","location":"Gridania","id":65628,"patch":2.0,"sort":150,"icon":100051,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1000692,"involved":[1000561,1000619,1001213,1002960,1003001,1003006,1003057],"genre":133,"journal":["Brother E–Sumi–Yan wants you to learn about the element of water.","Desiring that you learn about the element of water, Brother E–Sumi–Yan has assigned you a new task. Take the flask he has provided and pour its crystal-clear contents onto the ground at the foot of the Hedgetree near to the Hawthorne Hut.","You have succeeded in purifying the area of elemental corruption. Report to Brother Joacin at the Hawthorne Hut.","Upon receiving word of an attack by a herd of antelope stags, Brother Joacin bids you make haste to Josselin's Spire and assist the soldiers stationed there. Report to the spire guard, Aniud, for further instructions.","Your arrival at Josselin's Spire coincides with that of the latest group of soldiers wounded in the battle with the antelope stags. Cast the Cure spell on one of the injured combatants outside Josselin's Spire.","You have tended to an injured soldier. Speak with the harried healer outside Josselin's Spire and see what can be done for the rest of the wounded.","The battle continues to rage on the road to the east of Josselin's Spire. Make haste to the scene of the conflict and provide support.","Brother E–Sumi–Yan has asked that you follow after Sylphie and offer her a sympathetic ear.","Upon realizing the truth of her desperate situation, Sylphie wishes only to be alone. Return to Stillglade Fane and report to Brother E–Sumi–Yan.","Brother E–Sumi explains that Sylphie's powers of healing draw not upon the boundless energies of nature, but upon her own limited life force. Should she continue to practice her magic, the young conjurer is in danger of sharing her mother's tragic fate. Deeply concerned, the Padjal pledges to search for a way to save the girl, and hopes you will aid him should a solution be found. Returning to the subject of your education, the guildmaster expresses his satisfaction with your mastery of conjury's fundamental principles, and bids you strive to attune yourself ever more closely to the elements.<br><br>※The next conjurer quest will be available from E–Sumi–Yan upon reaching level 20."],"objectives":["Pour the pristine water onto the base of the Hedgetree and defeat the tainted water sprite.","Speak with Joacin at the Hawthorne Hut.","Speak with Aniud at Josselin's Spire.","Cast Cure on one of the injured soldiers.","Speak with the harried healer.","Speak with the Gods' Quiver bow.","Speak with Sylphie.","Report to Brother E–Sumi–Yan at Stillglade Fane.","Slay the young antelope stags!"],"dialogue":[{"name":"ESUMIYAN","text":"It is good to see you again, <span class=\"highlight\">Forename</span>. By the aura you exude, it is plain you have grown further as a conjurer."},{"name":"ESUMIYAN","text":"The time is come that you acquaint yourself with the third element of our art: water."},{"name":"ESUMIYAN","text":"For the first part of your lesson, you are to take this flask of pristine water and pour it at the foot of the Hedgetree found near the Hawthorne Hut."},{"name":"ESUMIYAN","text":"The water's purity will draw forth the corrupting entity that is siphoning the tree's life force."},{"name":"ESUMIYAN","text":"Dispatch this being, and then speak with Brother Joacin at the Hawthorne Hut."},{"name":"ESUMIYAN","text":"As you might expect, he is a conjurer with a fine ear for the murmurings of brook and stream. Listen well to his advice if you would learn to master the element of water."},{"name":"JOACIN","text":"Greetings, <span class=\"highlight\">Forename</span>. Brother E–Sumi informed me of your coming. I assume it was you who purified the befouled water at the Hedgetree?"},{"name":"JOACIN","text":"The joyous bubbling of the elementals was a pleasure to hear. On behalf of both them and myself, I thank you."},{"name":"JOACIN","text":"Now, without further ado, let us speak of that which Brother E–Sumi sent you here to learn."},{"name":"JOACIN","text":"I trust you did not find it strange to be asked to tend to a tree when your lesson this day concerns the element of water."},{"name":"JOACIN","text":"One need not have studied botany to realize that the forest requires more than rich soil to flourish. Water is essential for carrying the nutrients in the earth from a tree's roots all the way to the very tips of its leaves."},{"name":"JOACIN","text":"This precious liquid is the lifeblood of the Twelveswood. Without it, naught would grow. But should it rise in too great a volume, and too swiftly, the nourishing flow will become a crashing wave that washes away all before it."},{"name":"JOACIN","text":"It is important to realize that all of nature is in balance. As conjury derives its power from nature, we must take care not to use our art in a manner like to disrupt this state. Ever must we be mindful of the ceaseless tug-of-war embodied in creation─this...fruitful stalemate of the elements."},{"name":"MAXIMILOIX","text":"Brother Joacin! Are you about!?"},{"name":"JOACIN","text":"I am here, sir. What has transpired?"},{"name":"MAXIMILOIX","text":"A herd o' young antelope stags has gone berserk. I dunno what's got 'em so panicked, but there's no calmin' 'em now."},{"name":"MAXIMILOIX","text":"The mad beasts gored the soldiers sent to shepherd 'em away from civilian settlements, leavin' us with a pile o' wounded over at Josselin's Spire, an' not enough hands to stanch the bleedin'. We need a healer, an' fast!"},{"name":"JOACIN","text":"Curious. I sensed nothing amiss in the whisperings of the elementals. What could have frightened these antelopes so...?"},{"name":"JOACIN","text":"Ah, apologies! I shall revisit these musings anon. Let us make haste."},{"name":"JOACIN","text":"If matters are as chaotic as you say, I fear the number of injured may be rising as we speak. I doubt that we two will suffice."},{"name":"JOACIN","text":"We must divide our forces."},{"name":"JOACIN","text":"<span class=\"highlight\">Forename</span>─travel straightway to Josselin's Spire and tend to the wounded. I shall endeavor to rally further healers, and follow after you bearing what restorative unguents I can."},{"name":"JOACIN","text":"You, sir, head to Stillglade Fane and beseech the aid of Brother E–Sumi."},{"name":"ANIUD","text":"Who are─? A conjurer, you say? Praise Nophica!"},{"name":"ANIUD","text":"You've come not a moment too soon─sounds like yet more wounded have just been carried in. Pray offer them what aid you can."},{"name":"DOUSHI","text":"Such terrible injuries... Leave this one to me, and weave your restorative spells on that soldier there."},{"name":"SOLDIER","text":"Unnngh..."},{"name":"SOLDIER","text":"&lt;gasp&gt; I... I can breathe again... Thank you."},{"name":"DOUSHI","text":"These folk are out of danger for the present, but I fear our reprieve shall be brief."},{"name":"DOUSHI","text":"The battle with the stags yet rages, and there are reports of yet more wounded. I bid you join the Wood Wailers and help put an end to this."},{"name":"DOUSHI","text":"Seek them just off the road that leads to the northeast. And do not worry─my art should be sufficient to prevent matters from worsening here. Now, go!"},{"name":"SOLDIERB","text":"Come to lend a hand, have you? Quickly! The fight is this way!"},{"name":"SYLPHIE","text":"&lt;gasp&gt; The conjurer from the guild!"},{"name":"SYLPHIE","text":"Well, tell Brother E–Sumi if you want─I don't care! I'm not going to stand by and watch while people bleed to death!"},{"name":"SYLPHIE","text":"I don't understand. When I try to cast spells, nothing happens. When I reach for my power...there's just nothing there."},{"name":"SYLPHIE","text":"Is this what the guildmaster was trying to warn me about?"},{"name":"SYLPHIE","text":"He said I was repeating my mother's mistakes. The same thing happened to her─losing her magic, I mean. And then she─"},{"name":"SYLPHIE","text":"Am I...going to die?"},{"name":"SYLPHIE","text":"This can't be happening. I didn't think..."},{"name":"SYLPHIE","text":"Please. I need to be alone."},{"name":"ESUMIYAN","text":"<span class=\"highlight\">Forename</span>! You have returned at last. Were you able to speak with Sylphie?"},{"name":"ESUMIYAN","text":"I see..."},{"name":"ESUMIYAN","text":"I once taught you that conjurers harness the power of nature that we might bring about change. Earth, wind, water, healing─the principle is no different."},{"name":"ESUMIYAN","text":"For the art of mending, we draw on the boundless life force of nature and bestow it upon the wounded. Sylphie has never sought to borrow from that bounty."},{"name":"ESUMIYAN","text":"Her power to heal stems from her <span class=\"emphasis\">own</span> life force. The vital energies of mortals are, however, finite...and now that which I most feared has come to pass."},{"name":"ESUMIYAN","text":"Her mother unwittingly took her own life through the continued use of her healing skills."},{"name":"ESUMIYAN","text":"And Sylphie's aptitude for the art is, if anything, even greater. Thus it is not unexpected that she should reach the limits of her strength at a much earlier age."},{"name":"ESUMIYAN","text":"If we do not intervene, this terrible tragedy will be repeated, and I for one could not bear to see the child suffer the same fate as her mother..."},{"name":"ESUMIYAN","text":"I shall think on a solution to this dark dilemma. It may be that I will have need of your assistance in the near future, <span class=\"highlight\">Forename</span>."},{"name":"ESUMIYAN","text":"Do not doubt your abilities. You are a conjurer who has passed the trials of earth, wind, and water. You grow closer to nature with every passing day, and I sense within you the seeds of greatness."},{"name":"ESUMIYAN","text":"In your encounter with water, you learned its role as a bringer of life. But you also felt the implacable power of a surging wave as it swept you along in its path. Like earth and wind, and nature at large, the element of water is possessed of more than one aspect."},{"name":"ESUMIYAN","text":"Having completed the third lesson, I am satisfied that you have mastered the fundamentals of conjury."},{"name":"ESUMIYAN","text":"Yet this is but the beginning of your journey. Henceforth, you must strive to attune yourself ever more closely to the elements, and to nature."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"SOLDIER4","text":"Unnngh..."},{"name":"SYLPHIE","text":"No!"},{"name":"SOLDIER5","text":"Arrrgh!"},{"name":"SOLDIER4","text":"Are...are you all right, miss?"},{"name":"SYLPHIE","text":"Gods above..."},{"name":"SOLDIER4","text":"Conjurer! Your aid!"},{"name":"SYLPHIE","text":"&lt;cough&gt; &lt;wheeze&gt;"},{"name":"SOLDIER5","text":"Miss!?"},{"name":"SYLPHIE","text":"I-I'm fine... Don't mind...me..."},{"name":"ESUMIYAN","text":"Pray tell me that we are not too late."},{"name":"ESUMIYAN","text":"Sylphie! What have you done!? I forbade you from using such...such...methods!"},{"name":"SYLPHIE","text":"Guildmaster!"},{"name":"ESUMIYAN","text":"I will not see you repeat your mother's mistakes."},{"name":"SYLPHIE","text":"..."},{"name":"SYLPHIE","text":"My mother never did anything wrong!"},{"name":"ESUMIYAN","text":"<span class=\"highlight\">Forename</span>, may I ask that you follow her...please? I fear my presence will only serve to provoke her further."},{"name":"ESUMIYAN","text":"She cannot have gone far in her weakened state. "},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“Trial by Water”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"SYLPHIE","text":"This soldier needs all my attention.<br>Please, help the other Wood Wailers!"},{"name":"SOLDIER","text":"Stand firm!"},{"name":"SOLDIER","text":"On your guard! There are more of them!"}],"reward":{"items":[{"id":1961},{"id":2233},{"id":3024,"one":1},{"id":3547,"one":1},{"id":3327,"one":1},{"id":3777,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":7}],"questsType":"any","quests":[65627,65683]},"next":[65629]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1000561","obj":{"i":1000561,"n":"Joacin","l":55,"q":1}},{"type":"npc","id":"1000619","obj":{"i":1000619,"n":"Aniud","l":55,"q":2}},{"type":"npc","id":"1001213","obj":{"i":1001213,"n":"Gods' Quiver Bow","l":55,"q":1}},{"type":"npc","id":"1002960","obj":{"i":1002960,"n":"Sylphie","l":55,"q":1}},{"type":"npc","id":"1003001","obj":{"i":1003001,"n":"Wounded Wood Wailer","l":55,"q":1}},{"type":"npc","id":"1003006","obj":{"i":1003006,"n":"Sylphie","l":55,"q":1}},{"type":"npc","id":"1003057","obj":{"i":1003057,"n":"Harried Healer","l":55,"q":1}},{"type":"item","id":"1961","obj":{"i":1961,"n":"Ash Wand","l":16,"c":32402,"t":8,"p":560}},{"type":"item","id":"2233","obj":{"i":2233,"n":"Square Ash Shield","l":17,"c":30019,"t":11,"p":683}},{"type":"item","id":"3024","obj":{"i":3024,"n":"Cotton Cowl","l":15,"c":43610,"t":35,"p":663}},{"type":"item","id":"3547","obj":{"i":3547,"n":"Hard Leather Ringbands","l":16,"c":48239,"t":37,"p":365}},{"type":"item","id":"3327","obj":{"i":3327,"n":"Cotton Tights","l":15,"c":45083,"t":36,"p":315}},{"type":"item","id":"3777","obj":{"i":3777,"n":"Hard Leather Boots","l":15,"c":46139,"t":38,"p":480}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65627","obj":{"i":65627,"n":"Trial by Wind","g":133,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65683","obj":{"i":65683,"n":"Trial by Wind","g":133,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65629","obj":{"i":65629,"n":"Sylphie's Trials","g":133,"l":"Gridania","s":200,"f":1}}]}