{"quest":{"name":"Close to Home","location":"Gridania","id":65621,"patch":3.1,"sort":2,"icon":100004,"eventIcon":71201,"issuer":1001140,"target":1000100,"involved":[1000159,1000251,1000768],"genre":1,"journal":["Miounne, proprietress of the Carline Canopy, wants you to perform three tasks that will help you learn the fundamentals of adventuring.","Miounne has given you three tasks to perform. As you make your way around Gridania, try approaching citizens who appear to be in need of help.","You have completed all three tasks. Report back to Miounne at the Carline Canopy.","Miounne explains that the three locations you visited will prove indispensable in your adventuring life. Heed well her advice, and travel further afield as your experience grows."],"objectives":["Attune yourself to the aetheryte found inside the city.","Visit the Lancers' Guild.","Listen to Parsemontret's explanation of the markets.","Report to Miounne at the Carline Canopy."],"dialogue":[{"name":"MIOUNNE","text":"Let us begin at the beginning, shall we? Now that you are a formal member of the Adventurers' Guild, we must be sure you have a firm grasp of the fundamentals of adventuring. To that end, I have three tasks I wish you to perform."},{"name":"MIOUNNE","text":"Your first task is to visit the aetheryte. This massive crystal stands in the middle of the aetheryte plaza, not far from the Carline Canopy."},{"name":"MIOUNNE","text":"As a device that enables instantaneous transportation, the aetheryte plays a key role in the life of the ever-wandering adventurer."},{"name":"MIOUNNE","text":"Once you have located the crystal, all you need do is touch its surface. A member of the Wood Wailers will be present to offer further instruction."},{"name":"MIOUNNE","text":"For your second task, you are to visit the Lancers' Guild."},{"name":"MIOUNNE","text":"There is no better place to learn the arts of the polearm. Speak with Jillian, and she will explain the benefits of joining the guild."},{"name":"MIOUNNE","text":"For your third and final task, I would have you visit the markets at the heart of Old Gridania's commercial district. There you shall find weapons and armor, and all the various items that an adventurer might need on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> travels."},{"name":"MIOUNNE","text":"There is, however, more to the markets than buying and selling goods. Speak with Parsemontret, and listen well to his counsel."},{"name":"MIOUNNE","text":"The master merchant can be...uncooperative at times, so be sure to offer him one of my famous eel pies. Like so many men, he is <span class=\"emphasis\">much</span> more charitable when his stomach is full. Here, I made a batch not long ago."},{"name":"MIOUNNE","text":"You have your tasks, <span class=\"highlight\">Forename</span>. May Nophica guide your path."},{"name":"MIOUNNE","text":"Ah, and one more thing: should you happen to come across any citizens in need, don't be afraid to proffer a helping hand. I am certain they will be pleased to meet an adventurer in whom they can confide their woes."},{"name":"MIOUNNE","text":"Granted, the work they offer is unlikely to be of realm-shattering importance─but prove your worth and build a reputation, and in time folk will be more inclined to entrust you with matters of moment."},{"name":"MIOUNNE","text":"I also suggest that you lend an ear to the Smith here in the Canopy. The Smiths are trusted representatives of the Adventurers' Guild, and are an invaluable source of advice for neophyte heroes seeking to attain greatness."},{"name":"TALK","text":"empty"},{"name":"JILLIAN","text":"Welcome to the Lancers' Guild. I see you brought your own spear."},{"name":"JILLIAN","text":"If you seek to refine your skills with the polearm, then you have come to the right place."},{"name":"JILLIAN","text":"Here at the Lancers' Guild, spear wielders gather to train with one another, and further hone their abilities under the tutelage of our fine instructors."},{"name":"JILLIAN","text":"More than just an instrument of war, the spear is also a tool for hunting, and with game ever plentiful in the Twelveswood, the weapon has been the mainstay of the locals here since before the founding of Gridania."},{"name":"JILLIAN","text":"With the passing of time, our nation became a gathering place for spearmasters from across the realm─many eager to test their mettle against the famed might of our Wood Wailers."},{"name":"JILLIAN","text":"And it was here in Gridania that their myriad fighting styles came into contact, eventually giving rise to the art taught here today."},{"name":"JILLIAN","text":"That spear technique could be formalized at all owed much to the founding of the Lancers' Guild by Wood Wailer captain Mistalle nigh on a century past."},{"name":"JILLIAN","text":"The tradition of accepting students from without as well as within Gridania's borders persists to this day, ensuring that the art of the polearm may not only survive, but also continue to evolve."},{"name":"JILLIAN","text":"Well, there you have it. I hope this brief history of the guild has helped settle any doubts in your mind."},{"name":"JILLIAN","text":"The Lancers' Guild is always eager to welcome new initiates."},{"name":"JILLIAN","text":"If you've a will to enlist, speak with me again and we can begin the enrollment procedures."},{"name":"NICIA","text":"Greetings, adventurer. I see you are faithfully following Mother Miounne's instructions."},{"name":"NICIA","text":"Allow me to offer you a bit of instruction myself. I am Nicia of the Wood Wailers, and I know a thing or two about the aetheryte─yes, that big crystal right there."},{"name":"NICIA","text":"Aetherytes are devices that tap into aetherial energies, and are primarily used as a means to travel swiftly from one place to another."},{"name":"NICIA","text":"Return and Teleport─the most common transportation spells─make direct use of the aetherytes and their connection to the flow of aether."},{"name":"NICIA","text":"And as these devices are found in almost every corner of Eorzea, any adventurer worthy of the name will wish to seek out and attune <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> to each one."},{"name":"NICIA","text":"Truly, few things in this world are so useful to an intrepid explorer."},{"name":"NICIA","text":"But you need not locate them all at once. Before rushing out into the wilds, I suggest you start with the aetherytes found here in Gridania."},{"name":"NICIA","text":"Should you wish to learn more about the aetheryte or transportation magic, I am here to answer your questions."},{"name":"SYSTEM","text":"You attune with the aetheryte.<br>You are now able to use the Return spell!"},{"name":"PARSEMONTRET","text":"By what right does a fledgling adventurer presume to address Parsemontret, master of the markets?"},{"name":"PARSEMONTRET","text":"You think you can stroll in here, bold as you please, and demand my hard-earned knowledge? Hah! A merchant does naught for naught, <span class=\"emphasis\">especially</span> when dealing with would-be heroes."},{"name":"PARSEMONTRET","text":"If, on the other hand, you had some tasty “morsel” to curry my favor, then I might reconsider your request."},{"name":"PARSEMONTRET","text":"Come now, this whole encounter reeks of Miounne's handiwork─and more specifically her <span class=\"emphasis\">baking</span>. Don't look so surprised, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>─I smelled that eel pie of yours a malm away. Hand it over!"},{"name":"PARSEMONTRET","text":"Mmm, that flaky crust...just divine. Very well, I am a man of my word. Pay close attention, for I shall only explain this once."},{"name":"PARSEMONTRET","text":"The aspiring adventurer need look no further than the Rosewood and Ebony Stalls. Both are but a short stroll from where we stand."},{"name":"PARSEMONTRET","text":"If you mean to do battle, you'd best be prepared with a quality set of weapons and armor."},{"name":"PARSEMONTRET","text":"Such goods are the province of the Rosewood Stalls, directly south of here. You will be pleased to learn that the merchants of Gridania are exceedingly particular when it comes to craftsmanship, so you needn't fear defective straps and the like."},{"name":"PARSEMONTRET","text":"If it is potions and paraphernalia you seek, head north to the Ebony Stalls."},{"name":"PARSEMONTRET","text":"The shelves there are lavishly stocked by widely traveled Ul'dahn merchants, and I may truly say that I have seen things amongst their myriad wares that I scarce knew existed."},{"name":"PARSEMONTRET","text":"Do you follow me thus far? The first step in any purchase is to select the stalls that meet your needs. Then you may concern yourself with price and profit."},{"name":"PARSEMONTRET","text":"There is little more I can teach you with mere words. Go, peruse the stalls, and see for yourself what wares they offer. There is no substitute for firsthand experience, after all, and I am weary of talking...unless you have another eel pie?"},{"name":"MIOUNNE","text":"The conquering hero returns. You have completed my little tasks, I trust?"},{"name":"MIOUNNE","text":"The three locations you visited will feature prominently in your life as an adventurer─it is best you grow familiar with them as soon as possible."},{"name":"MIOUNNE","text":"And you took the time to listen to the woes of the citizenry? I cannot emphasize enough how important it is to lend your talents to one and all, no matter how trivial the matter may seem."},{"name":"MIOUNNE","text":"I am thankful that you are an obliging sort, <span class=\"highlight\">Forename</span>. It is adventurers like you who will win the hearts of the locals and pave the way for those who follow. I pray Gridania can rely on your aid in its struggles to come."}],"reward":{"gil":107,"job":4,"xp":100},"reqs":{"jobs":[{"lvl":1,"id":130}],"quests":[65575]},"next":[65564,65568,65570]},"partials":[{"type":"npc","id":"1001140","obj":{"i":1001140,"n":"Mother Miounne","l":52,"q":4,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000159","obj":{"i":1000159,"n":"Nicia","l":52,"q":3}},{"type":"npc","id":"1000251","obj":{"i":1000251,"n":"Jillian","l":53,"q":5,"t":"Guild Receptionist"}},{"type":"npc","id":"1000768","obj":{"i":1000768,"n":"Parsemontret","l":53,"q":8}},{"type":"quest","id":"65575","obj":{"i":65575,"n":"Coming to Gridania","g":92,"l":"Gridania","s":1}},{"type":"quest","id":"65564","obj":{"i":65564,"n":"To the Bannock","g":1,"l":"Gridania","s":12}},{"type":"quest","id":"65568","obj":{"i":65568,"n":"A Hard Nut to Crack","g":92,"l":"Gridania","s":40}},{"type":"quest","id":"65570","obj":{"i":65570,"n":"Derision of Labor","g":92,"l":"Gridania","s":40}}]}