{"quest":{"name":"Drop Dead Shiva","location":"The Waking Sands","id":65626,"patch":2.4,"sort":7,"icon":112074,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1007478,"involved":[1006444,1010054],"genre":13,"journal":["A chill wind blows in Eorzea, and Urianger's eyes bespeak knowledge of the reason why.","Urianger grimly confirms that which a part of you already suspected: Lady Iceheart has recovered from her wounds and resumed her campaign against Ishgard. A letter from Lord Drillemont makes mention of a recent theft of crystals, which would suggest that the heretic leader intends to summon Saint Shiva once again. Return to Whitebrim Front and speak with Lord Drillemont to ascertain the situation.","Lord Drillemont reveals that he had intended to establish an Ishgardian outpost at Snowcloak. Alas, Lady Iceheart and her forces fell upon his men in a surprise attack, retaking the fortress along with the knights' sundry supplies. He implores you to confront the heretic leader and, if necessary, put down the dread primal Shiva once again. A Temple Knight posted at Snowcloak can escort you through hidden tunnels to the aetheryte within the heretics' lair which you can use to reach Lady Iceheart's sanctuary.","The Temple Knight stands ready to guide you through the tunnels. Assemble your companions and do what you must for the good of the realm.<br><br>※The Akh Afah Amphitheatre (Extreme) can be accessed via the Duty Finder.","At the end of a titanic struggle, you succeed in defeating Saint Shiva, but cannot prevent Lady Iceheart from making her escape once again. Be that as it may, Lord Drillemont will doubtless be relieved to hear of your victory.","The troubling events of recent days have given Lord Drillemont much to consider; in particular, whether or not Ishgard has the capability to address the heretic threat on its own. Putting aside such concerns, he thanks you for your timely intervention, and bids you convey his gratitude to Urianger and the other Scions.","Long accustomed to the sight of your triumphant swagger, Urianger discerns that Saint Shiva is no more before you have even opened your mouth. Your subsequent description of the events at Snowcloak gives him pause, however, and he concludes that the Ascians yet labor to incite the heretics and Lady Iceheart to continue their crusade. Undaunted, the Archon declares his belief that Eorzea will one day be rid of the Ascian menace, and that you are the key to the realm's salvation."],"objectives":["Speak with Drillemont at Whitebrim Front.","Speak with the stalwart Temple Knight at Snowcloak.","Confront Shiva in the Akh Afah Amphitheatre (Extreme).","Report to Drillemont.","Report to Urianger."],"dialogue":[{"name":"URIANGER","text":"By thy high deeds were the people of Coerthas spared certain doom at the hands of a deiform entity."},{"name":"URIANGER","text":"Yet, if the missive we have received from Lord Drillemont of House Durendaire speaketh true, 'twould seem that hard-won respite hath come and gone."},{"name":"URIANGER","text":"Recovered from her wounds, the Lady Iceheart hath rejoined the struggle against Ishgard. Worse, 'tis said that her disciples have already laid claim to a hoard of crystals..."},{"name":"URIANGER","text":"...A hoard far exceeding the quantity but recently wrested from the caravans of House Fortemps. 'Tis all but certain that the heretics' mistress intendeth to call upon Saint Shiva once more."},{"name":"URIANGER","text":"And so, once more, must Eorzea's blade of Light be brought to bear against a primal. None save thee hath might enough to defeat such a foe. 'Tis for this reason that Lord Drillemont hath requested thy presence at Whitebrim Front. Pray hie thee thither with all haste."},{"name":"URIANGER","text":"None save thee can deliver Ishgard from Lady Iceheart's vengeance. Pray hasten thee to Whitebrim Front, where Lord Drillemont awaiteth thy coming even now."},{"name":"DRILLEMONT","text":"My gratitude for your timely return, <span class=\"highlight\">Forename</span>. Would that it were under better circumstances."},{"name":"DRILLEMONT","text":"Our efforts to contain the heretic threat in the western highlands beyond Snowcloak have suffered a grievous setback."},{"name":"DRILLEMONT","text":"In order to support expeditions further afield, we sought to establish an outpost in the heretics' former fortress. Under guard, our craftsmen began the necessary improvements, and for a time all proceeded according to plan."},{"name":"DRILLEMONT","text":"The building work had scarce begun when Iceheart's minions descended upon the fortress from all directions. If I were to guess, I would say that they deliberately delayed their attack until sufficient supplies had been delivered to their doorstep."},{"name":"DRILLEMONT","text":"I do not begrudge my men their decision to flee. By all accounts, it would have been a slaughter─any survivors condemned to a fate worse than death at the hands of their leader. However, by abandoning our crystal stores, we have given the heretics the means to summon their patron saint."},{"name":"DRILLEMONT","text":"I beseech you, <span class=\"highlight\">Forename</span>─slayer of the gods of beastmen, who banished once before the demon who threatens us now─lend us your strength! Infiltrate Snowcloak and put an end to Iceheart's machinations!"},{"name":"DRILLEMONT","text":"Thank you, my friend. Though I pray you can stop her before she completes her ritual, I have faith you can defeat Shiva should it come to that."},{"name":"DRILLEMONT","text":"One of Ser Aymeric's Temple Knights awaits you at Snowcloak. He shall guide you through secret tunnels to the aetheryte at the heart of the heretics' fortifications, whence you may gain entrance to Iceheart's sanctuary as before."},{"name":"DRILLEMONT","text":"Much hinges on your efforts, <span class=\"highlight\">Forename</span>. If Iceheart is allowed to summon Shiva, the lives of countless Ishgardians will be in danger."},{"name":"TEMPLER00075","text":"It is an honor, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. When you are ready, I shall lead you through the tunnels to the aetheryte. We should not be troubled by heretics or beasts along the way, so you may concentrate solely on the task at hand."},{"name":"TEMPLER00075","text":"May the Fury grant you the strength to strike down that heathen witch once and for all."},{"name":"TEMPLER00075","text":"We will depart when you are ready, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. You need but speak the word."},{"name":"TEMPLER00075","text":"You've returned! The deed is done, I take it? Lord Drillemont will want to hear the tale in full."},{"name":"DRILLEMONT","text":"Praise Halone for your safe return! All here prayed for your success, <span class=\"highlight\">Forename</span>. Tell us: have our prayers been answered?"},{"name":"DRILLEMONT","text":"Even stronger than before, you say? Then we are truly fortunate for your intervention."},{"name":"DRILLEMONT","text":"Yet it would be wrong to glory in this victory, for it is yours, not ours. Indeed, your very presence here is a testament to the inadequacy of our own preparations. Plainly, it is time that we reappraised the threat posed by the heretics, and our readiness to address it. I can no longer say with any certainty that we are equal to the task... But this is none of your concern. Forgive me."},{"name":"DRILLEMONT","text":"Your deeds shall not be forgotten, my friend. You, Urianger, and your entire order have my utmost thanks."},{"name":"DRILLEMONT","text":"Pray convey our gratitude to Urianger and the rest of your brethren. Were it not for your aid, I know not how many others would have perished."},{"name":"URIANGER","text":"'Tis not the first time I have seen thee stride into the Waking Sands wearing such a look. Thou art as an open book, <span class=\"highlight\">Forename</span>, wherein the tale of thy victory is writ large."},{"name":"URIANGER","text":"...In her redoubled strength I glimpse the dark hand of the Paragons. Her return, and her very defeat, serveth merely to continue the escalating cycle of conflict."},{"name":"URIANGER","text":"Full glad am I of thine all-surpassing martial skills, <span class=\"highlight\">Forename</span>, yet still more glad would I be were they not required."},{"name":"URIANGER","text":"&lt;sigh&gt; Would that the Lady Iceheart could be made to abandon her misbegotten crusade... Till she be thus converted, or else slain, the people of Ishgard will know no peace."},{"name":"URIANGER","text":"...But be not disheartened. One day, by thy light, the darkness within and without shall be purged, and the Ascians shall taste lasting defeat. We need only have faith."}],"reward":{"gil":3000,"xp":0,"instance":20025},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[65625]}},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1006444","obj":{"i":1006444,"n":"Drillemont","l":63,"q":13}},{"type":"npc","id":"1010054","obj":{"i":1010054,"n":"Stalwart Temple Knight","l":63,"q":3}},{"type":"instance","id":"20025","obj":{"i":20025,"n":"The Akh Afah Amphitheatre (Extreme)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":95}},{"type":"quest","id":"65625","obj":{"i":65625,"n":"Let Us Cling Together","g":2,"l":"Northern Thanalan","s":76}}]}