{"quest":{"name":"Let Us Cling Together","location":"Northern Thanalan","id":65625,"patch":2.4,"sort":76,"icon":100323,"eventIcon":71201,"issuer":1010063,"target":1008969,"involved":[1010534],"genre":2,"journal":["Alphinaud would ask another favor of you.","Alphinaud informs you that he and Ilberd are planning to question Eline Roaille before reporting their findings to Raubahn. While they conduct their interrogation, you are to return to the Rising Stones and inform Minfilia of all that has occurred.","With the Ivy unmasked and her network of spies in disarray, the Empire's power to observe and influence Eorzean affairs has been greatly diminished. Meanwhile, your fellow Scions have made further progress in the quest to find a means to destroy the Ascians. If their theories are correct, white auracite may allow you to recreate the blade of Light you once used to vanquish Lahabrea."],"objectives":["Report to Minfilia at the Rising Stones."],"dialogue":[{"name":"ALPHINAUD","text":"Captain Ilberd and I have a few questions for the flame marshal regarding the circumstances of her miraculous escape. When we have completed our interrogation, we shall take our findings directly to General Raubahn, and that shall be the end of it."},{"name":"ALPHINAUD","text":"Your work here is done, my friend─my thanks."},{"name":"ALPHINAUD","text":"Ah, but I have one last task for you: return to the Rising Stones and apprise Minfilia of all that has happened."},{"name":"ALPHINAUD","text":"I am aware that the Antecedent held Roaille in high regard... For better or worse, she will want to know how this tale ends."},{"name":"ILBERD","text":"Like Roaille, I once made my way as a mercenary─and like her, I did more than a few things I am not proud of."},{"name":"ILBERD","text":"But never once did I betray my own. There are depths to which a man should not sink."}],"reward":{"gil":7000,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65624]},"next":[65626,65899]},"partials":[{"type":"npc","id":"1010063","obj":{"i":1010063,"n":"Alphinaud","l":46,"q":2}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010534","obj":{"i":1010534,"n":"Ilberd","l":46,"q":2}},{"type":"quest","id":"65624","obj":{"i":65624,"n":"The Reason Roaille","g":2,"l":"The Rising Stones","s":75}},{"type":"quest","id":"65626","obj":{"i":65626,"n":"Drop Dead Shiva","g":13,"l":"The Waking Sands","s":7,"f":1}},{"type":"quest","id":"65899","obj":{"i":65899,"n":"Good Intentions","g":2,"l":"The Rising Stones","s":77}}]}