{"quest":{"name":"Eyes Unclouded","location":"Coerthas Central Highlands","id":65623,"patch":2.4,"sort":74,"icon":100322,"eventIcon":71201,"issuer":1009976,"target":1008969,"genre":2,"journal":["For one with reason to celebrate, Alphinaud looks rather grim.","The implications of Iceheart's actions are not lost on Alphinaud, who is eager to discuss them with your colleagues at the Rising Stones. Return with him to Mor Dhona and report to Minfilia.","Was Shiva a primal, or something heretofore unseen? Did Iceheart truly become her, and if so, did she retain control? Did the Ascians have a hand in her plans? Your tale raises more than a few questions which the Scions are unable to answer. Minfilia is most troubled by Iceheart's final words to you, from which she concludes that the heretics' leader is blessed with the power of the Echo. What drove the young maiden to take such drastic action remains unclear, but if she is to be believed, then the answer may lie with Midgardsormr─the great wyrm that perished at the Battle of Silvertear Skies, and that Ishgardian astrologians fear may soon rise from the dead..."],"objectives":["Speak with Minfilia at the Rising Stones."],"dialogue":[{"name":"ALPHINAUD","text":"It would seem we have much to discuss with our friends at the Rising Stones."},{"name":"ALPHINAUD","text":"If what you say is true, Iceheart's method of summoning Shiva defies all precedent. It necessitates a complete reappraisal of the primal threat, and of our approach to combating it."},{"name":"ALPHINAUD","text":"Moreover, there are grave ramifications if word of this incident reaches imperial ears."},{"name":"ALPHINAUD","text":"The Garlean Empire believes that primals are an insufferable menace─that their mere existence is a threat to this very star. As such, they deem any action taken against the beast tribes to be justified by default."},{"name":"ALPHINAUD","text":"Imagine then...if it became known that it was not only the beast tribes of Eorzea that could summon primals, but her civilized peoples as well, any lingering objections to the Eorzean campaign would vanish overnight."},{"name":"ALPHINAUD","text":"Where before we had to contend with a <span class=\"emphasis\">single</span> imperial legion, we could well find ourselves facing the combined might of <span class=\"emphasis\">all Garlemald</span>..."},{"name":"ALPHINAUD","text":"But I speak unadvisedly. Come, <span class=\"highlight\">Forename</span>─it is better that we continue this conversation in Mor Dhona."},{"name":"ALPHINAUD","text":"If there is one thing that can be said for Ser Aymeric, it is that he understands how dangerous knowledge can be in the wrong hands."},{"name":"ALPHINAUD","text":"We are but fortunate that this incident took place in so remote a location. The truth should not be too difficult to suppress─for now, at least."}],"reward":{"gil":760,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65622]},"next":[65624]},"partials":[{"type":"npc","id":"1009976","obj":{"i":1009976,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"quest","id":"65622","obj":{"i":65622,"n":"The Road Less Traveled","g":2,"l":"Coerthas Central Highlands","s":73}},{"type":"quest","id":"65624","obj":{"i":65624,"n":"The Reason Roaille","g":2,"l":"The Rising Stones","s":75}}]}