{"quest":{"name":"My First Daggers","location":"Limsa Lominsa","id":65638,"patch":2.4,"sort":10,"icon":100344,"unlocksFunction":1,"eventIcon":71341,"issuer":1009944,"target":1009943,"genre":132,"journal":["Lonwoerd would have you reaffirm your desire to join the Rogues' Guild.","Lonwoerd suggests that you meet with the master of the Rogues' Guild. Head inside and speak with Jacke.","After listening to Jacke's explanation of “the job,” you convince the guildmaster that you're willing to embrace the shadowy life of a rogue. Equip the weathered daggers, and speak with Jacke once more."],"objectives":["Speak with Jacke."],"dialogue":[{"name":"LONWOERD","text":"I didn't scare you off, then? Bene. They told me ye was a mettlesome <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">cove</span></span>, an' so it's proved."},{"name":"LONWOERD","text":"Ye'll need every onze o' that mettle soon enough. Now step inside an' have a prattle with Jacke. He's our Upright Man─the master o' the guild."},{"name":"SYSTEM","text":"You may now freely enter the Rogues' Guild. Speak with Lonwoerd whenever you wish to gain admittance to the guild's headquarters."},{"name":"JACKE","text":"Aye, I'm the one they call “Jacke”─though I'm surprised ye've heard o' me. Perhaps ye'd be good enough to tell me <span class=\"emphasis\">yer</span> name...along with that o' the kindly cove as told ye mine?"},{"name":"JACKE","text":"Ahhh! The famous <span class=\"highlight\">Forename</span>! Ol' Lonny Left-patch let you in, did he?"},{"name":"JACKE","text":"Hmmm... He can't throw a blade for shite, but that one eye don't miss naught when it comes to sizin' up a dimber <span class=\"alternative-container\"><span class=\"alternative\">mort</span><span class=\"alternative\">colt</span></span> for the stallin'."},{"name":"JACKE","text":"Just one thing... You ain't a pirate, are ye?"},{"name":"JACKE","text":"Well, then, it's time ye was stalled to the rogue! Pull on yer best beater cases an' I'll swear ye in meself when yer ready."},{"name":"JACKE","text":"Now, I could fill yer wattles with the storied history of our guild, but that's just whids an' wind. The most important thing─the <span class=\"emphasis\">only</span> thing─we care about is gettin' the job done."},{"name":"JACKE","text":"Now, most folk, an' I'm assumin' yer among 'em, know that not long after Limsa's foundin', the city was overrun by a motley collection o' pirates an' thieves."},{"name":"JACKE","text":"But as wild as that lot were, it soon became clear that they'd all end up killin' each other if they didn't lay down a few rules─an unspoken code o' conduct, as it were."},{"name":"JACKE","text":"One, ye don't bite the purses o' yer fellow Lominsans; two, ye don't rook a crew out o' their spoils; an' three, ye don't trade culls like they was chattel. I'll admit the finer points o' the code are a mite murky, but most agree on those three, at least."},{"name":"JACKE","text":"Now, ye might be thinkin' none o' that amounts to a sack o' dilberries now the Admiral's outlawed piracy, but in the back alleys an' black markets where Merlwyb's grip ain't so tight, the code's still alive an' well."},{"name":"JACKE","text":"An' just as the law is enforced by the Yellowjackets, the code is regulated by us rogues."},{"name":"JACKE","text":"We go where the shadows are darkest, an' hand out justice to them as break the code. Some rum-soaked cove steals goods from the wrong cull, an' we steal 'em back. That's the job, my natty <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"JACKE","text":"'Course, we don't hop the twig when bladework's called for, neither."},{"name":"JACKE","text":"Ye'll see there's more to our daggerplay than just stickin' culls with the pointy end. We'll weaken a mark with poison, fade away an' strike in the darkmans─whatever it takes to get the work done."},{"name":"JACKE","text":"Well, <span class=\"highlight\">Forename</span>? What do ye say to that? Got the guts to do a rogue's job?"},{"name":"Q1","text":"<span class=\"emphasis\">Do</span> you have the guts to do a rogue's job?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"JACKE","text":"All right, then! First off, we'll have to get yer kit sorted out."},{"name":"JACKE","text":"A rogue needs to be light on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> dew beaters to stay on a mark's trail. The job might have ye fightin' across a deck or weavin' through a mob, an' the last thing ye want is a bleedin' great battleaxe what hooks itself on every rope an' post."},{"name":"JACKE","text":"That's why we stick to daggers─they let ye slip through the streets just as easily as they slip through a rook's ribs."},{"name":"JACKE","text":"Here, take these stabbers an' let's see how they look on ye. ...Just don't get so excited with yer new toys that ye forget to dress for the role. Ye'd be surprised at how many colts come back to me in their bloody smallclothes..."},{"name":"JACKE","text":"A pity, but it's your choice to make, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. The life of a rogue ain't for the pigeon-livered."},{"name":"LONWOERD","text":"Ye lookin' to head inside?"},{"name":"Q9","text":"Enter the Rogues' Guild?"},{"name":"A9","text":"Yes"},{"name":"A9","text":"No"}],"reward":{"items":[{"id":7952}],"xp":100},"reqs":{"quests":[65637]},"next":[65640]},"partials":[{"type":"npc","id":"1009944","obj":{"i":1009944,"n":"Lonwoerd","l":29,"q":3,"t":"Gatekeep"}},{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"item","id":"7952","obj":{"i":7952,"n":"Weathered Daggers","l":1,"c":33801,"t":84,"p":63}},{"type":"quest","id":"65637","obj":{"i":65637,"n":"So You Want to Be a Rogue","g":0,"l":"Limsa Lominsa Lower Decks","s":0,"f":1}},{"type":"quest","id":"65640","obj":{"i":65640,"n":"Stabbers in Yer Fambles","g":132,"l":"Limsa Lominsa","s":11,"f":1}}]}