{"quest":{"name":"It's Definitely Pirates","location":"Mor Dhona","id":65630,"patch":2.4,"sort":510,"icon":112067,"unlocksFunction":1,"eventIcon":71341,"issuer":1006975,"target":1010359,"involved":[1003282,1005064,1010355,1010356,1010357,1010358],"genre":95,"journal":["Bloezoeng has a favor to ask of you on behalf of an old friend.","According to Bloezoeng, Commodore Reyner of the Yellowjackets has need of a capable adventurer for what promises to be a grueling task. If you would answer the call, make your way to Limsa Lominsa and present yourself before the commodore at the Coral Tower on the upper decks.","Reyner informs you that Sastasha has been overrun by an unidentified group of pirates...who may in fact be monsters. Recalling the way you once drove the Serpent Reavers from the caverns, the commodore is confident that you will be able to quell the new threat─whatever it is. Make your way to Sastasha in western La Noscea, and report to D'perjha, who stands guard by the entrance.","D'perjha has briefed you on the current situation. In the absence of new intelligence, you have no choice but to play it by ear. Venture into Sastasha, and eliminate the threat within.<br><br>※Sastasha (Hard) can be accessed via the Duty Finder.","Deep within the bowels of Sastasha, you corner the hideously transformed resurrection of Captain Madison who summons forth the kraken to do his bidding. However, the dread pirate's dastardly plan rebounds upon him when, with a flick of its tentacle, the creature sends him flying. Setting aside this bizarre scene, you and your comrades engage the gargantuan sea beast, and succeed in vanquishing it. Your mission thus accomplished, make your way back to the outside world and report to D'perjha.","D'perjha is shocked to learn that the monsters that had overrun Sastasha were none other than the Serpent Reavers. Having informed you that their bodies will be collected for analysis, the Yellowjacket bids you report to Reyner, who has since arrived in Aleport.","No sooner do you begin speaking with Reyner than the body of one of the jellyfish men arrives from Sastasha. The scholar Ceana believes that its hideous form is the result of overexposure to aether, most likely due to repeated tempering. In light of recent developments, Reyner pledges to tighten security around Aleport."],"objectives":["Speak with Reyner in Limsa Lominsa.","Speak with D'perjha at the entrance to Sastasha.","Enter Sastasha (Hard).","Report to D'perjha.","Report to Reyner at Aleport."],"dialogue":[{"name":"BLOEZOENG","text":"By the onion, you're <span class=\"highlight\">Forename</span>! You couldn't have come at a better time. A friend of mine sent word that he needs a capable adventurer, you see, and I naturally thought of you."},{"name":"BLOEZOENG","text":"Who's this friend, you ask? Why, none other than Commodore Reyner of the Yellowjackets. He and I met back when I first started out as a culinarian, and we've been friends ever since."},{"name":"BLOEZOENG","text":"Anyroad, I'd appreciate it if you'd pay him a visit and inquire as to what he needs doing. You'll find him in the Coral Tower with his Yellowjackets."},{"name":"BLOEZOENG","text":"(Marked for deletion)"},{"name":"BLOEZOENG","text":"I'd appreciate it if you'd pay old Reyner a visit and inquire as to what he needs doing. He should be in the Coral Tower over in Limsa."},{"name":"REYNER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"highlight\">Forename</span>! How timely! There is something I would ask of you. Ah, but where are my manners? Is there aught you require?<br>...Here at Bloezoeng's behest, you say? Ha! That he should send you of all people is a stroke of good fortune indeed."},{"name":"REYNER","text":"Permit me to apprise you of the situation. You will doubtless recall driving the Serpent Reavers out of Sastasha."},{"name":"REYNER","text":"Well...despite our best efforts to keep the place secure, I regret to inform you that it has been occupied by pirates. Pirates, I say, though eyewitnesses claim that they seemed more akin to fiends from the briny depths... To be frank, we are not wholly certain what it is we are dealing with."},{"name":"REYNER","text":"I dispatched a party of adventurers to identify and eliminate the threat, but it would seem their courage failed them."},{"name":"REYNER","text":"But they were not you, my friend. You will fare better against whatever awaits within Sastasha, of that I have no doubt. If you would be willing to assist us, pray report to D'perjha, who stands guard by the entrance to the caverns."},{"name":"REYNER","text":"If you are minded to brave Sastasha, pray report to D'perjha, who stands guard by the entrance."},{"name":"DPERJHA","text":"Ah, it's you! I take it you mean to help us again? Wonderful!"},{"name":"DPERJHA","text":"You see those adventurers yonder? We sent them in first, but it soon became clear that they were unequal to the task. By my count, they lasted just under a minute inside before staggering back out, sucking for air like fish out of water. As such, we're no closer to ascertaining the nature of the threat, let alone eliminating it."},{"name":"DPERJHA","text":"You'll be going in blind, I know, but you've purged Sastasha before, and I'm certain that you can repeat the feat. Enter whenever you're ready. I look forward to hearing of your success!"},{"name":"DPERJHA","text":"You've purged Sastasha before─I'm certain you can repeat the feat. Enter whenever you're ready. I look forward to hearing of your success!"},{"name":"KENJYUTU00094","text":"&lt;gasp&gt; The Cure spell never came... &lt;pant&gt; If I hadn't had that potion on me, I'd be crab dung by now..."},{"name":"GENJYUTU00094","text":"Ye'd better not be blamin' me for that fiasco. In case ye missed it, fearless leader, I was busy dodgin' razor-sharp pincers at the time. <span class=\"emphasis\">Someone</span> couldn't hold the monsters' attention like he was s'posed to."},{"name":"KYUJYUTU00094","text":"Bwahahaha! You're <span class=\"emphasis\">both</span> sorry excuses for adventurers! Hells, I'm hardly a paragon among archers myself, being─hic!─partial to the odd drink... But what does it matter!? We're here to have fun, so let's have some, eh!?"},{"name":"JYUJYUTU00094","text":"We comprehensively failed in our duties, but we still came out alive─and at the end of the day, isn't that all that matters? Though I must admit, our leader came pretty close to losing his head in there..."},{"name":"DPERJHA","text":"(Marked for deletion)"},{"name":"DPERJHA","text":"Ah, you are returned! Tell me, were you able to identify our intruders?"},{"name":"DPERJHA","text":"...Men who looked like jellyfish!? And you say that they were Captain Madison and his crew!?"},{"name":"DPERJHA","text":"This is...decidedly odd. But I know better than to doubt you. I will have the bodies retrieved for study, that we might be better prepared to face such enemies in future."},{"name":"DPERJHA","text":"Your work here is done, friend. Pray make your way to Aleport. Commodore Reyner awaits news there, and will doubtless be glad of a firsthand account."},{"name":"DPERJHA","text":"Pray make your way to Aleport. Commodore Reyner awaits news there, and will doubtless be glad of a firsthand account."},{"name":"KENJYUTU00094","text":"Gah, how could we let some other adventurer waltz in and finish the job? If only we had a more competent healer..."},{"name":"GENJYUTU00094","text":"Use yer bloody head next time, will ye? Rush in like that again, an' yer like to get us all killed!"},{"name":"KYUJYUTU00094","text":"Bwahahaha! You pair need to learn to─hic!─relax! Here, have a swig of this. It'll help, I promise!"},{"name":"JYUJYUTU00094","text":"I understand you have secured Sastasha, and not for the first time. Please accept my congratulations...and my thanks. Had you not stepped in, my comrades and I might have kept on trying until we were quite dead."},{"name":"DPERJHA","text":"(Marked for deletion)"},{"name":"REYNER","text":"I have already received word of your success. You do not disappoint, <span class=\"highlight\">Forename</span>!"},{"name":"YELLOWJAKET00094","text":"Sir! A body has arrived for inspection!"},{"name":"REYNER","text":"This...this <span class=\"emphasis\">thing</span> used to be a man? Gods be good... How did this happen?"},{"name":"CEANA","text":"(-???-)A sight to turn the stomach... 'Tis well I haven't eaten."},{"name":"YELLOWJAKET00094","text":"My lady! Thank you for granting us your valuable time and expertise."},{"name":"YELLOWJAKET00094","text":"Commodore, allow me to introduce Miss Ceana, foremost among the celebrated Professor Lamberteint's students."},{"name":"CEANA","text":"Let us not stand on ceremony. Friends─this man's unnatural form can be attributed, I believe, to the excess absorption of water-aspected aether."},{"name":"CEANA","text":"A living being can only absorb a certain quantity of aether before suffering adverse effects. To be altered so drastically requires a fatal dose, yet our subject here lived long enough to be struck down. A most peculiar case indeed..."},{"name":"REYNER","text":"I have heard that a primal creates thralls by showering mortals with its own aether. Could this be an extension of that process?"},{"name":"CEANA","text":"I daresay you have struck the mark, Commodore."},{"name":"CEANA","text":"If being exposed once to a primal's aether is enough to corrupt the mind, 'tis plausible that repeated exposure corrupts the flesh."},{"name":"REYNER","text":"Madison and his crew had failed to hold Sastasha for their Sahagin overlords, and I suspect that this was their punishment. The fishbacks' depravity knows no bounds..."},{"name":"CEANA","text":"To think that creatures capable of such cruelty lurk nearby... I shan't get another wink of sleep while I am here..."},{"name":"REYNER","text":"Have no fear, my lady. My Yellowjackets are sworn to protect Aleport and her denizens, and in light of recent developments, you may be certain that we will redouble our vigilance."},{"name":"CEANA","text":"Your words give me heart, Commodore. And as previously agreed upon, by way of payment for my services, I shall hold on to this specimen for my research."}],"reward":{"gil":2064,"xp":0,"instance":28},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]}},"partials":[{"type":"npc","id":"1006975","obj":{"i":1006975,"n":"Bloezoeng","l":67,"q":5}},{"type":"npc","id":"1010359","obj":{"i":1010359,"n":"Reyner","l":33,"q":1}},{"type":"npc","id":"1003282","obj":{"i":1003282,"n":"Reyner","l":28,"q":6}},{"type":"npc","id":"1005064","obj":{"i":1005064,"n":"D'perjha","l":33,"q":1}},{"type":"npc","id":"1010355","obj":{"i":1010355,"n":"Ghost-faced Gladiator","l":33,"q":1}},{"type":"npc","id":"1010356","obj":{"i":1010356,"n":"Consumed Conjurer","l":33,"q":1}},{"type":"npc","id":"1010357","obj":{"i":1010357,"n":"Apathetic Archer","l":33,"q":1}},{"type":"npc","id":"1010358","obj":{"i":1010358,"n":"Threadbare Thaumaturge","l":33,"q":1}},{"type":"instance","id":"28","obj":{"i":28,"n":"Sastasha (Hard)","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":80}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}