{"quest":{"name":"The Wrath of Qarn","location":"Mor Dhona","id":65632,"patch":2.4,"sort":510,"icon":112068,"unlocksFunction":1,"eventIcon":71341,"issuer":1005524,"target":1010365,"involved":[1006220,1010366],"genre":95,"journal":["Few things can match the ire of a brother riled, and how much greater the anger when there are two of them?","According to Hugubert, Amajina & Sons Mineral Concern is in urgent need of adventurers. The craggy Highlander is uncharacteristically mealymouthed about the clients, however. Speak with one of them at the Miners' Guild and get a measure of this Seserukka.","You learn that to speak with Seserukka is to hear from Popokkuli, and to speak with Popokkuli is to have an earful from Seserukka. What they demand is a rescue mission, but there is nothing simple about entering the Sunken Temple of Qarn─especially after some raiders have set off the ancient traps within. Still, the scholar Nenekko must be rescued, or her brothers will have your hide. Bibimu will allow you entry into the temple once you arrive in southern Thanalan.","From Bibimu, you learn that your two clients are the “sons” in Amajina & Sons Mineral Concern. In addition, Nenekko is a rising star in the scholarly world. With this knowledge in mind, enter the Sunken Temple of Qarn and pull off the rescue.<br><br>※The Sunken Temple of Qarn (Hard) can be accessed via the Duty Finder.","You return to the treacherous corridors of the Sunken Temple of Qarn, and live to tell the tale.","Nenekko proves to be an unflappable little person in very little need of rescuing. Precede her back to the Miners' Guild to set her brothers' minds at rest, and remember: non-intrusive first and systematic always.","The twins are relieved to see you and positively ecstatic to see their sister. They have loving hearts, all three, though in the twins it comes cloaked in much bluster. Nenekko's plan to sow superstitious fear should protect the ruins─and her team─from further danger created by unscrupulous raiders. What time has devoured, knowledge can recreate. And what was lost, soft eyes can find. "],"objectives":["Speak with Seserukka at the Miners' Guild.","Speak with Bibimu at the Sunken Temple of Qarn.","Enter the Sunken Temple of Qarn (Hard).","Report to Seserukka at the Miners' Guild."],"dialogue":[{"name":"HUGUBERT","text":"Ah, there's an industrious ant! An adventurer in need of a bit of business, if I'm not mistaken. The anthill you want is Amajina & Sons Mineral Concern─something's kicked it over good."},{"name":"HUGUBERT","text":"They've put out word for adventurers. “Have skill, will move fast”─that sort of thing. Perfect for you, I'll warrant."},{"name":"HUGUBERT","text":"The client? A bit of a handful, a mite aggressive, but nothing you can't handle─the <span class=\"emphasis\">twins</span>. You'll find them at the Miners' Guild. Talk to Seserukka─he's the milder of the two."},{"name":"HUGUBERT","text":"Deletion"},{"name":"HUGUBERT","text":"The twins are far more fearsome in reputation than reality, or so some say. Go to the Miners' Guild and speak with Seserukka, the milder of the two."},{"name":"HUGUBERT","text":"Deletion"},{"name":"POPOKKULI","text":"Here for the job, are you? Speak with my brother here. I've got some thinking to do."},{"name":"SESERUKKA","text":"Hey, aren't you that miner who was embroiled in the Deep Canyon scandal? Not that it has any bearing on the situation, mind you. So long as you do what we ask, you'll serve just fine. Now then, the situation's like this..."},{"name":"SESERUKKA","text":"Heard about our petition, have you? And you'll do as we ask, no questions asked? Great attitude! Now then, the situation's like this..."},{"name":"POPOKKULI","text":"No, this isn't right! I'll be damned if I put our sister's fate in a stranger's hands! I'm going myself!"},{"name":"SESERUKKA","text":"Oh, brilliant plan, Brother. Go blundering into the Sunken Temple of Qarn. The place is a death trap!"},{"name":"POPOKKULI","text":"What guarantees do we have that this adventurer can beat those traps? None, that's what. But you know better than any what these muscles are capable of!"},{"name":"POPOKKULI","text":"...What the hells do you mean you've beaten those traps already? Wait... <span class=\"emphasis\">You're</span> the reason Nenekko's in this trouble! I'm gonna <span class=\"emphasis\">end</span> you, I swear it!"},{"name":"SESERUKKA","text":"Calm yourself, Brother! This adventurer's not to blame for what happened. Besides, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s perfect for the task!"},{"name":"SESERUKKA","text":"Let's start again, shall we? I am Seserukka and this is my twin brother, Popokkuli. And as you may have gathered, we need you to mount a rescue mission in the Sunken Temple of Qarn. After you defeated the temple's snares and traps, the place was officially open for busi─er, I mean, research! The Concern partnered with the Order of Nald'thal to fund an expedition..."},{"name":"SESERUKKA","text":"(Marked for deletion)"},{"name":"POPOKKULI","text":"Aye, and the research team was led by none other than Nenekko, our little sister! She's the one who wrote the book on the ruins of Sil'dih, the research to <span class=\"emphasis\">end</span> all other research on the place!"},{"name":"POPOKKULI","text":"Nobody except her was gonna figure out that Sil'dih and Ul'dah are <span class=\"emphasis\">both</span> descended from the Belah'dian civilization! The Sunken Temple of Qarn is the native rock─no way in seven hells was she going to <span class=\"emphasis\">not</span> lead that expedition!"},{"name":"SESERUKKA","text":"But who comes bumbling in? A band of relic raiders, that's who! The greedy whoresons set off a trap, and now our little sister is stuck in the stinking place!"},{"name":"POPOKKULI","text":"Poxy bastards, putting Nenekko in danger! If they aren't tonberry mince already, you can be sure that I'll end them myself!"},{"name":"SESERUKKA","text":"And that's the situation as it stands. Talk to Bibimu at the entrance to the temple, and she'll let you in. You go and get Nenekko out of there in one piece, you hear?"},{"name":"POPOKKULI","text":"Aye, and we don't give two shites what becomes of the rest of them. We just want our little sister safe!"},{"name":"POPOKKULI","text":"Sod everyone else on the expedition─just get Nenekko out of there!"},{"name":"SESERUKKA","text":"Talk to Bibimu at the entrance to the temple, and she'll let you in. You go and get Nenekko out of there in one piece!"},{"name":"BIBIMU","text":"Welcome to the stately ruin that was─and is─the Sunken Temple of Qarn. What a relief they actually sent someone who's been here and knows the drill."},{"name":"BIBIMU","text":"The twins? They can be a little...overbearing. They'll need some of that imperiousness soon enough, though, when it falls on them to run the Concern. In case you didn't know, those two are the chairman's progeny─them and Miss Nenekko."},{"name":"BIBIMU","text":"You will find it much changed within, thanks to those fool robbers. Take care─but not so much that you cannot make haste!"},{"name":"BIBIMU","text":"You will find it much changed within, thanks to those fool robbers. Take care─but not so much that you cannot make haste!"},{"name":"NENEKKO","text":"(-???-)You're the one who caused all that commotion, aren't you!? Twelve's sakes, walk softly!"},{"name":"NENEKKO","text":"Non-intrusive first and systematic always! Never forget! ...Now then, who are you? Are you with the Miners' Guild?"},{"name":"NENEKKO","text":"Non-intrusive first and systematic always! Never forget! ...Now then, who are you? One of the apprentice haulers?"},{"name":"NENEKKO","text":"Hm? Yes, I'm Nenekko, but...why would anyone be looking for me?"},{"name":"NENEKKO","text":"...What? Ancient traps have been triggered!? I had no idea!"},{"name":"NENEKKO","text":"I alone ventured into the deepest section of the temple, for the work there requires the most delicate of touches. I was completely oblivious to the commotion until you came."},{"name":"NENEKKO","text":"What of the members of my expedition? Please tell me they are safe!"},{"name":"NENEKKO","text":"S-Scarcely any survivors!? Gods be good... I had known that we were come to a dangerous place, but all those lives... "},{"name":"NENEKKO","text":"But this is neither the time nor place for mourning. Let us quit this place. I have a duty to notify our backers of this incident. Meanwhile, might I ask you to go and tell Popo and Sese that I am fine?"},{"name":"BIBIMU","text":"...Oblivious? Why, I heard that trap go off all the way out here! And those...fumaroles!"},{"name":"BIBIMU","text":"When I first met Nenekko, someone styled her the snow-mouse sister to a pair of lions. Really, she is the boldest of the three. Well, you had better let the twins know all is well."},{"name":"POPOKKULI","text":"Gods damn those cunning Belah'dians! Gods damn those poxy robbers! And gods damn that slack-witted, shamble-gaited adventu─ There you are! Where's my sister? Where is she!?"},{"name":"SESERUKKA","text":"Yes, where's Nenekko? You'd better have good news, or I'll let my brother do this <span class=\"emphasis\">his</span> way!"},{"name":"NENEKKO","text":"My dear brothers!"},{"name":"NENEKKO","text":"I've worried you, haven't I? I am sorry. But as you can see, there's nothing to be concerned about!"},{"name":"POPOKKULI","text":"Nenekko! Nenekko! We've been so worried about you!"},{"name":"SESERUKKA","text":"Aye, we'd feared the worst! It's so good to see your face!"},{"name":"NENEKKO","text":"I must thank you again, good adventurer. After we parted ways, I sent for a search party, and we were able to rescue the survivors."},{"name":"POPOKKULI","text":"Nenekko, from now on, I'm going to accompany you on all expeditions. Those Belah'dians were real bastards about booby traps. It's not safe for you alone!"},{"name":"SESERUKKA","text":"Brother, she won't be alone, because <span class=\"emphasis\">I'm</span> going with her!"},{"name":"NENEKKO","text":"Brothers, brothers! You forget your duty. Your place is with the Concern!"},{"name":"NENEKKO","text":"You are right that the temple is dangerous. But I can make it safe─all you need is to believe!"},{"name":"NENEKKO","text":"We must look at the causes─the <span class=\"emphasis\">twin</span> causes, hee─of today's incident: the people's belief that within lie magical relics, and that the ruins are now safe to traverse."},{"name":"NENEKKO","text":"Those temple raiders are already telling tales of deadly ancient traps in every tavern. But we'll let it be known it's no <span class=\"emphasis\">ordinary</span> danger that awaits..."},{"name":"NENEKKO","text":"The Order of Nald'thal has agreed to vehemently deny that the temple's relics are cursed─that tales of looters found horribly dead afterwards are baseless. That should give instant credence to the opposite, and end the looting! ...For a while, at least."},{"name":"SESERUKKA","text":"Nenekko, you're brilliant! I may be the strongest one, but you've got the goods upstairs!"},{"name":"POPOKKULI","text":"Right you are about our sister, puny brother! And I'm not gonna stoop to stating the obvious!"},{"name":"NENEKKO","text":"They say history is the gristle of the past. But in these ruins, the past is fleshed out again. That is what I love about this work."},{"name":"NENEKKO","text":"I won't let the raiders despoil the place. The ruins are not a mine, to be dug and blasted for gil. If they want gold or gems, let them join the Miners' Guild and toil for them!"},{"name":"SESERUKKA","text":"Deletion"},{"name":"POPOKKULI","text":"Deletion"},{"name":"SESERUKKA","text":"Deletion"},{"name":"SESERUKKA","text":"Deletion"},{"name":"SESERUKKA","text":"Deletion"},{"name":"SESERUKKA","text":"Deletion"},{"name":"POPOKKULI","text":"Deletion"},{"name":"SESERUKKA","text":"Deletion"},{"name":"NENEKKO","text":"Deletion"}],"reward":{"gil":2064,"xp":0,"instance":26},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[9],"quests":[70058]}},"partials":[{"type":"npc","id":"1005524","obj":{"i":1005524,"n":"Hugubert","l":67,"q":3}},{"type":"npc","id":"1010365","obj":{"i":1010365,"n":"Seserukka","l":41,"q":1}},{"type":"npc","id":"1006220","obj":{"i":1006220,"n":"Bibimu","l":45,"q":3}},{"type":"npc","id":"1010366","obj":{"i":1010366,"n":"Popokkuli","l":41,"q":1}},{"type":"instance","id":"26","obj":{"i":26,"n":"The Sunken Temple of Qarn (Hard)","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":80}},{"type":"instance","id":"9","obj":{"i":9,"n":"The Sunken Temple of Qarn","c":61801,"t":"Dungeons","min_lvl":35,"max_lvl":37}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}