{"quest":{"name":"Drink Your Beans, Dear","location":"North Shroud","id":65634,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1000656,"target":1000656,"genre":92,"journal":["Dametta needs someone to gather microchu leaflets for her cooking.","Dametta of Hyrstmill is making a batch of Mun–Tuy tonic, a nutritious but notoriously foul-tasting drink. If she could get her hands on some microchu leaflets to flavor the concoction, however, she could render it palatable for normal folk. Slay the microchus surrounding Hyrstmill and gather four leaflets from their remains.","You've gathered four microchu leaflets. Deliver them to Dametta posthaste, before she makes some hapless soul drink the unadulterated brew!","To respect the forest and take only that which is needed, to lead a life without waste─such is the tenet by which Gridanians live. Dametta stresses the importance of this belief, before lamenting that her son has yet to take it to heart..."],"objectives":["Slay microchus and gather leaflets from their remains.","Deliver the microchu leaflets to Dametta."],"dialogue":[{"name":"DAMETTA","text":"Oh dear... If I'm to make this much Mun–Tuy tonic, I'll need far more microchu leaflets..."},{"name":"DAMETTA","text":"Young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>, would you be so kind as to fetch me four leaflets from the microchus outside the hamlet?"},{"name":"DAMETTA","text":"I'm whipping up a fresh batch of Mun–Tuy tonic, you see. Oh, it's a <span class=\"emphasis\">lovely</span> drink, absolutely bursting with nutrients and goodness. I'll have you know I always drink at least one cup a day! Alas, few people share my <span class=\"emphasis\">passion</span> for healthy living... Truth be told, most won't touch the stuff─not unless you add microchu leaflets, anyway. Apparently, the taste and the smell are too distracting or some such nonsense."},{"name":"DAMETTA","text":"Oh, but listen to me prattling on like an Ishgardian priest! I shall stop talking and start stirring! Well, don't just stand there, dear─run along and fetch me those leaves! This batch will be ready soon, and it'd be <span class=\"emphasis\">such</span> a shame if no one could drink it but me."},{"name":"DAMETTA","text":"Ah, you're back! Did you manage to find the microchu leaflets I asked for?"},{"name":"DAMETTA","text":"Let's see... Yes, that's four, alright! &lt;sniff&gt; &lt;sniff&gt; Ah, such a <span class=\"emphasis\">lovely</span> scent!"},{"name":"DAMETTA","text":"Now, you gathered only the four I asked for, and not one more, yes? Oh, I know I shouldn't have to ask, but these days, more and more people forget to take only what they need. If we're to live in harmony with the wood, we must respect life and remember what it means to take it."},{"name":"DAMETTA","text":"<span class=\"emphasis\">Never be wasteful</span>! Know the value of life and know the value of our time here in this world. That's why I always live my life to the fullest, wasting nary a moment and nary a word─nay, not so much as a single one!"},{"name":"DAMETTA","text":"Remember: if you mean to remain within the Twelveswood, you must be ever mindful to show respect and gratitude to the forest and to the elementals."},{"name":"DAMETTA","text":"You know, you remind me of my son. He's a good boy, but sometimes forgets what it means to be Gridanian. Why, just the other day, I caught him and his friends throwing Mun–Tuy beans at each other!"},{"name":"DAMETTA","text":"Needless to say, I was terribly cross─who wouldn't be?─and all set to give them a memorable scolding, when I noticed they were playing in teams, and that <span class=\"emphasis\">my son</span> was leading the winners!"},{"name":"DAMETTA","text":"Oh, I know I shouldn't have been proud, but when I saw the way he marshaled his troops─by which I mean his friends─it was so <span class=\"emphasis\">clear</span> to me that he was a born leader... Ah, where was I? Oh, yes! You see, later that day, I was cooking dinner and he, quite without prompting, offered to wash the vegetables! He's <span class=\"emphasis\">such</span> a good boy, you know..."}],"reward":{"items":[{"num":15,"id":5},{"id":2654,"one":1},{"num":10,"id":4555,"one":1},{"id":5824,"one":1}],"xp":1275},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65639]},"next":[65635]},"partials":[{"type":"npc","id":"1000656","obj":{"i":1000656,"n":"Dametta","l":57,"q":4}},{"type":"item","id":"2654","obj":{"i":2654,"n":"Hard Leather Pot Helm","l":8,"c":40015,"t":34,"p":220}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65639","obj":{"i":65639,"n":"Death to the Bean Thieves","g":92,"l":"North Shroud","s":60}},{"type":"quest","id":"65635","obj":{"i":65635,"n":"The Kindness of Strangers","g":92,"l":"North Shroud","s":90}}]}