{"quest":{"name":"Stabbers in Yer Fambles","location":"Limsa Lominsa","id":65640,"patch":2.4,"sort":11,"icon":100344,"unlocksFunction":1,"eventIcon":71341,"issuer":1009943,"target":1009943,"genre":132,"journal":["Jacke wishes to give you a few pointers on daggerplay.","To help you get a feel for your new weapons, Jacke suggests you head to the fields outside Limsa Lominsa and slay some of the local wildlife. Travel to middle La Noscea and defeat three wharf rats, three lost lambs, and three pugils.","You have slain the requisite creatures. Return to the Rogues' Guild and report to Jacke.","Jacke welcomes you back from your dagger practice with another nugget of wisdom: in combat, a rogue relies more on agility than brute force. Keep the guildmaster's words in mind as you work on preparing yourself for whatever job Jacke means to give you.<br><br>※The next rogue quest will be available from Jacke upon reaching level 5."],"objectives":["Slay lost lambs as a rogue.","Slay wharf rats as a rogue.","Slay pugils as a rogue.","Report to Jacke at the Rogues' Guild."],"dialogue":[{"name":"JACKE","text":"Managed to strap those daggers on without cuttin' yerself? Well, we're off to a good start, I'd say."},{"name":"JACKE","text":"Next, ye'll want to get a feel for the weight an' speed o' yer new weapons. I reckon those bleatin' cheats in the fields outside Limsa should serve for yer first lesson."},{"name":"JACKE","text":"Aye, test yer blades on a few o' them lambs, then slice up some rats an' pugils for good measure. Mind that ye mill them beasties one at a time, though, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I know ye've served far worse in the past, but yer no dimber damber with them stabbers just yet!"},{"name":"JACKE","text":"Head out into the fields an' test yer blades on some o' the local pests. Aye, a few lambs an' rats, an' then some pugils for a bit of a challenge."},{"name":"JACKE","text":"Done with yer millin', are ye? Ye can never have enough blade practice, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">me young colt</span></span>."},{"name":"JACKE","text":"In fact, I'll even add a list o' marks to yer huntin' log. Pit yerself against the lot, an' ye'll soon learn some new steps for yer dance with the daggers."},{"name":"JACKE","text":"Aye, ye must think o' yerself as a dancer─not a bleedin' butcher. Ye only need so much force to ram a shortblade in to the hilt."},{"name":"JACKE","text":"Precision an' speed─that's how ye get the most outta yer stabbers. Bulky armor'll only have ye ploddin' about like an ungainly aurochs, so make sure yer wearin' gear what'll let ye move freely, as well."},{"name":"JACKE","text":"All right? Get yer bladework up to scratch, <span class=\"highlight\">Forename</span>, an' I might just have a job for ye..."},{"name":"SYSTEM","text":"The next rogue quest will be available from Jacke upon reaching level 5."}],"reward":{"gil":115,"xp":100},"reqs":{"jobs":[{"lvl":1,"id":91}],"quests":[65638]},"next":[65646]},"partials":[{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"quest","id":"65638","obj":{"i":65638,"n":"My First Daggers","g":132,"l":"Limsa Lominsa","s":10,"f":1}},{"type":"quest","id":"65646","obj":{"i":65646,"n":"A Dainty Dilemma","g":132,"l":"Limsa Lominsa","s":50,"f":1}}]}