{"quest":{"name":"Close to Home","location":"Limsa Lominsa","id":65644,"patch":3.1,"sort":6,"icon":100079,"eventIcon":71201,"issuer":1002697,"target":1000972,"involved":[1000926,1001217],"genre":1,"journal":["Baderon, proprietor of the Drowning Wench, wants you to perform three tasks that will help you learn the fundamentals of adventuring.","Baderon has given you three tasks to perform. As you make your way around Limsa Lominsa, try approaching citizens who appear to be in need of help.","You have completed all three tasks. Report back to Baderon at the Drowning Wench.","Baderon explains that the three locations you visited will feature prominently in your adventuring life. Heed well his advice, and travel further afield as your experience grows."],"objectives":["Attune yourself to the aetheryte found on the lower decks.","Listen to Swozblaet's explanation of the markets.","Visit the Marauders' Guild.","Report to Baderon at the Drowning Wench."],"dialogue":[{"name":"BADERON","text":"Right, then. Let's start ye off nice an' easy with three tasks what'll 'elp ye get used to life 'ere in Limsa."},{"name":"BADERON","text":"Firstly, if ye 'ead down a floor then point yer nose to the west, ye'll get an eyeful o' the great glowin' crystal in the middle o' the courtyard."},{"name":"BADERON","text":"That's an aetheryte─a device what can move ye from one place to another in the blink of an eye. Ain't no swifter way to travel─providin' there's an aetheryte where ye want to go, o' course."},{"name":"BADERON","text":"'Ave a chat with the Yellowjacket on guard down there an' ye'll be treated to a lecture on the workin's o' the device. 'Fore ye do that, though, remember to touch the thing. Strange as it sounds, it won't work till you 'ave."},{"name":"BADERON","text":"Second on the list is the marketplace. Ye'll find weapons an' armor an' all yer 'venturin' bits an' pieces fer sale in the district what lies beyond the aetheryte."},{"name":"BADERON","text":"Don't go throwin' yer gil around just yet, though, or ye'll get fleeced quicker'n ye can say, “Why's me coinpurse so light?” 'Ave a word with Swozblaet, instead. 'E's the 'ead o' the Merchants' League, by the way."},{"name":"BADERON","text":"Give 'im this old octant, an' 'e'll treat ye well."},{"name":"BADERON","text":"Fer the last o' me 'elpful 'ints, I suggest ye meet some fellow axe-wielders at the Marauders' Guild."},{"name":"BADERON","text":"I guarantee ye'll learn a few new tricks fer swingin' that 'ead-splitter o' yours if ye join their crew. Blauthota at the front desk is the one to get ye started."},{"name":"BADERON","text":"Got all that, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Seein' to them three tasks'll take ye on a little jaunt 'round the city, an' 'elp ye work out where everythin' is. Now, I've best be gettin' on. Run along, eh?"},{"name":"BADERON","text":"Bugger it! There I go, sendin' ye off without tellin' ye summat crucial. That bloody Calamity's made a right mess o' me memory, I swear. Well, that or the ale... Anyroad, while yer out, if ye 'appen to pass any poor sods what look like they might need yer 'elp, consider givin' their tale o' woe a listen, eh?"},{"name":"BADERON","text":"Sounds like a chore, I admit, but ye never know what interestin' opportunities could be lurkin' out there, just waitin' fer ye to stumble on 'em. Fer example, Niniya over yonder's been castin' glances at ye since ye waltzed in.<br>Why not lend an ear an' see what she 'as to say? Aye, yer like to find yerself runnin' odd errands in the beginnin', but once ye build a reputation as a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> folk can trust, the jobs'll get 'arder an' the rewards more generous."},{"name":"BADERON","text":"If ye've the time, I'd also seek the advice o' the Smith 'ere in the Wench. The lads as bear that title 'ave some fine advice fer them what're just startin' out in the profession. An' <span class=\"emphasis\">that</span>, my <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">lad</span></span>, is 'ow ye go about becomin' a legend among 'venturers."},{"name":"SYSTEM","text":"To leave the Drowning Wench, you must accept the quest “Making a Name” by speaking with Niniya."},{"name":"SUNDHIMAL","text":"(-???-)Ah, another novice adventurer. Aye, Baderon has sent more than a few of your kind this way of late."},{"name":"SUNDHIMAL","text":"I am Sundhimal, one of the Yellowjackets tasked with keeping the peace in the city. It is also my charge to provide guidance in the use of this device. Fear not, I shall be brief."},{"name":"SUNDHIMAL","text":"Aetherytes are crystalline structures that tap into aetherial energies. They are primarily used as a means to travel swiftly from one place to another."},{"name":"SUNDHIMAL","text":"Return and Teleport─the most common transportation spells─make direct use of the aetherytes and their connection to the flow of aether."},{"name":"SUNDHIMAL","text":"And as these devices are found in almost every corner of Eorzea, any adventurer worthy of the name will wish to seek out and attune <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> to each one."},{"name":"SUNDHIMAL","text":"Once you have expanded your horizons beyond the walls of the city, you will soon find yourself performing the act of attunement as a matter of course."},{"name":"SUNDHIMAL","text":"There is, however, no need for unseemly haste. The aetherytes found in and around the city will be sufficient for the present, I assure you."},{"name":"SUNDHIMAL","text":"Should you wish to learn more about aetherytes or transportation magic, I will be here to answer your questions."},{"name":"SYSTEM","text":"You attune with the aetheryte.<br>You are now able to use the Return spell!"},{"name":"SWOZBLAET","text":"A fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Welcome to the most replete marketplace in the grand realm of Eorzea, where every shelf groans under the weight of wonders borne from all four corners of the world!"},{"name":"SWOZBLAET","text":"Pray browse the stalls until your eyeballs ache from ogling the overabundance of unbelievable bargains! Now, as much as I would love to elaborate upon the unrivaled quality of our merchandise, I must tend to some cargo but recently arrived at the docks─"},{"name":"SWOZBLAET","text":"Hm? You bear a gift from Baderon? Whatever could it─ Ah! My octant! By the Navigator, I must have left it behind in the Wench─along with a week's pay and several bells' worth of intoxicated memories!"},{"name":"SWOZBLAET","text":"I am most grateful to have it back! This tool is a keepsake from my days as a ship captain, you see. Needless to say, your good deed must be repaid, and what better recompense than the wisdom of a master merchant?"},{"name":"SWOZBLAET","text":"If it is simple and sturdy adventuring equipment you seek, you need look no further than the East and West arms of Hawkers' Alley."},{"name":"SWOZBLAET","text":"Lest you doubt, each gil you invest in arms and armor will be money well spent. Adventuring is, after all, a dangerous profession by its very nature."},{"name":"SWOZBLAET","text":"It goes without saying that Hawkers' Alley boasts stalls specializing in the tools of every martial discipline imaginable."},{"name":"SWOZBLAET","text":"And within but a few steps are bazaars and apothecaries that will most amply supply all your potion and perishable needs."},{"name":"SWOZBLAET","text":"Our keen-eyed agents procure a frankly befuddling range of wares during their sojourns to distant shores, so it pays to become familiar with the type─and price─of the goods offered by each stall."},{"name":"SWOZBLAET","text":"Such knowledge will serve you well if your purse is light or your time is short."},{"name":"SWOZBLAET","text":"Ah, but verbal instruction of this kind will only profit you so much. Experience has ever been the surest teacher─if not the kindest. I invite you to explore the markets for yourself."},{"name":"BLAUTHOTA","text":"Ho there, adventurer. Curious about the Marauders' Guild, are ye?"},{"name":"BLAUTHOTA","text":"Any axe worth swingin' needs two hands on the haft, an' has a blade what can make short work of a galley's mast. That's the kind o' weapon our members train to use with deceptive swiftness an' all too predictable force."},{"name":"BLAUTHOTA","text":"Are ye interested in hearin' more, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Then why don't I give ye the short version o' the guild's foundin' history, an' we can go from there."},{"name":"BLAUTHOTA","text":"It all started with ships, ye see. What've ships got to do with axes, ye ask? Well, buildin' 'em would be pretty bloody difficult without a sturdy tool to lop down trees for timber."},{"name":"BLAUTHOTA","text":"An' since only the Navigator Herself knows when a ship'll run afoul of a storm or worse, it makes sense for the crew's carpenter to carry an axe on board. Aye, it all started with shipbuildin' an' ship repair. What? Am I borin' ye?"},{"name":"BLAUTHOTA","text":"Hmph. As I was sayin', any tool on a ship can become a weapon, an' the axe was perfect for hookin' yerself over the rail of an enemy vessel, lettin' loose in a whirl o' steel, an' generally layin' waste to all about ye."},{"name":"BLAUTHOTA","text":"As more seafarers took up the axe as their weapon o' choice, so did the bloody art o' the marauder begin to take shape─'specially among pirates, where strength an' skill decided yer place in the world."},{"name":"BLAUTHOTA","text":"With an eye to assemblin' crews o' battle-ready raiders, the pirates started teachin' the proper way to wield a choppin' blade to their new recruits. An' <span class=\"emphasis\">that's</span> how the Marauders' Guild first came to be."},{"name":"BLAUTHOTA","text":"But once the Galadion Accord was signed to unite the Maelstrom an' the pirates against Limsa's enemies, the whole game changed."},{"name":"BLAUTHOTA","text":"The accord itself was a dismal failure, o' course, but the Marauders' Guild was never the same─it was taken over, restructured, an' purged of its pirate elements. It had been reborn as an institution dedicated to naught but the teachin' of axe fightin'."},{"name":"BLAUTHOTA","text":"The members o' this new Marauders' Guild weren't no greed-driven cutthroats, neither─they were warriors what sought to use their martial prowess for the good o' society."},{"name":"BLAUTHOTA","text":"If masterin' the axe is yer heart's desire, then ye'll find no better arena in which to practice yer swings."},{"name":"BLAUTHOTA","text":"Think it over, then let me know if ye fancy joinin' our ranks. I've a feelin' I'll be seein' more o' ye soon, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"BADERON","text":"Ah, there ye are, <span class=\"highlight\">Forename</span>. Enjoy yer jaunt 'round the city, did ye?"},{"name":"BADERON","text":"If ye mean to base yerself in Limsa Lominsa, that won't be the last time ye'll visit them three places."},{"name":"BADERON","text":"An' now ye've got some idea o' what's where, ye can start explorin' the rest o' the town."},{"name":"BADERON","text":"Ye've shown a good ear fer listenin', <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Stick with ol' Baderon, an' ye'll go far."}],"reward":{"gil":107,"job":3,"xp":100},"reqs":{"jobs":[{"lvl":1,"id":130}],"quests":[65643]},"next":[65658,65998,66199]},"partials":[{"type":"npc","id":"1002697","obj":{"i":1002697,"n":"Baderon","l":28,"q":3}},{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1000926","obj":{"i":1000926,"n":"Blauthota","l":28,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1001217","obj":{"i":1001217,"n":"Swozblaet","l":29,"q":7}},{"type":"quest","id":"65643","obj":{"i":65643,"n":"Coming to Limsa Lominsa","g":91,"l":"Limsa Lominsa","s":1}},{"type":"quest","id":"65658","obj":{"i":65658,"n":"Glory Days","g":91,"l":"Limsa Lominsa","s":40}},{"type":"quest","id":"65998","obj":{"i":65998,"n":"On to Summerford","g":1,"l":"Limsa Lominsa","s":13}},{"type":"quest","id":"66199","obj":{"i":66199,"n":"Fool Me Once","g":91,"l":"Limsa Lominsa","s":40}}]}