{"quest":{"name":"Coming to Limsa Lominsa","location":"Limsa Lominsa","id":65643,"patch":2.0,"sort":1,"icon":100078,"eventIcon":71221,"issuer":1001028,"target":1002697,"involved":[1000914,1002732],"genre":91,"journal":["To be recognized as an adventurer in the city–state of Limsa Lominsa, you must first register yourself with the Adventurers' Guild.","The Yellowjacket, Ryssfloh, strongly suggests that you sign up as an adventurer in the Drowning Wench. Speak with Grehfarr at the end of the street to take the Crow's Lift up to the pub.","You have arrived at the Drowning Wench. Speak with the owner, Baderon, about registering with the Adventurers' Guild.","Now that you have successfully registered yourself as an adventurer, you are ready to begin exploring Limsa Lominsa. Speak with Baderon again to learn more about the city and the basics of adventuring."],"objectives":["Speak with Grehfarr at the Crow's Lift.","Speak with Baderon at the Drowning Wench."],"dialogue":[{"name":"RYSSFLOH","text":"Now then, I'm sure you're itching to explore, but adventurers are required to register their presence in the city...and without a bit of local knowledge, you're like to get your throat slit in some piss-stinking alley."},{"name":"RYSSFLOH","text":"So before you do anything else, get yourself over to the Drowning Wench and enroll with the Adventurers' Guild."},{"name":"RYSSFLOH","text":"It's not far─just head straight down this street and speak with Grehfarr. He'll show you how to work that big moving platform we call the Crow's Lift, and that'll take you up to the pub."},{"name":"RYSSFLOH","text":"Once you're there, look for a fellow by the name of Baderon─he's the proprietor of the Wench. He might curse like an ale-sodden sailor, but the man's got a soft spot for wide-eyed newcomers like yourself. He'll set you straight."},{"name":"RYSSFLOH","text":"Got all that? Good. Now run along, and may the Navigator guide you on your journey."},{"name":"SYSTEM","text":"You have begun a quest!"},{"name":"SYSTEM","text":"Use the <span class=\"highlight\">duty list</span> to help you complete your task."},{"name":"GREHFARR","text":"Welcome to Limsa Lominsa. If you've a mind to visit the Drowning Wench, the Crow's Lift will take you there."},{"name":"Q1","text":"Take the Crow's Lift?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"GREHFARR","text":"Might I remind you that all newly arrived adventurers are required to register with the Adventurers' Guild? Until you have done so, you will struggle to find employment in these parts."},{"name":"BADERON","text":"Greetin's to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"BADERON","text":"What'll it be? ...Ah, but you ain't 'ere fer the drink, are ye!? Ye've come with a mind to try yer 'and at 'venturin', I reckon! Well, ye'll find no shortage o' work 'ere in Limsa."},{"name":"BADERON","text":"So what do they call y─ Nay, don't tell me. 'Tis on the tip o' me tongue... 'Tis...'tis...'tis bloody <span class=\"emphasis\">gone</span> is what it is. Bollocks."},{"name":"BADERON","text":"They say this forgetfulness is some lingerin' effect o' the Calamity. <span class=\"emphasis\">I</span> say it's a Leviathan-sized pain in the arse. Ah, but where are me manners?"},{"name":"BADERON","text":"The name's Baderon, an' this most 'ospitable of 'ostelries is the Drownin' Wench."},{"name":"BADERON","text":"'Tis also the 'ome o' the 'Venturers' Guild, 'ere in Limsa. That's why we've got a desk 'specially fer 'andlin' guild business─an' why I seem to spend more time savin' the necks o' whelps like yerself than wettin' the throats o' me regulars."},{"name":"BADERON","text":"'Venturers 'ave a knack fer findin' trouble, see."},{"name":"BADERON","text":"Not that they need it in these parts, on account o' there bein' trouble wherever ye look. If ye manage to steer clear o' the fishbacks an' the kobolds outside the city, the pirates on the <span class=\"emphasis\">inside</span> will get ye instead."},{"name":"BADERON","text":"An' if they don't manage, there's always the Garlean Empire to finish the job. Oh, no one knows what they're plannin', o' course...but if they're plannin' <span class=\"emphasis\">anythin'</span>, ye can be sure it's to kill the lot of us."},{"name":"BADERON","text":"Aye...this town seems peaceful at a glance, but look again, an' ye'll see a people livin' in fear o' what tomorrow might bring."},{"name":"BADERON","text":"...An' who can blame 'em, after everythin' that's 'appened? Eorzea took a mighty blow durin' the Calamity, but our 'omes weren't the only things what got wiped off the face of existence by that thrice-damned bastard of a dragon."},{"name":"BADERON","text":"It took our bleedin' <span class=\"emphasis\">memories</span>, too. An' no one's been able to explain it in a way as makes an onze o' sense."},{"name":"BADERON","text":"None o' the folks what saw it an' lived to tell the tale seem to agree on 'ow the tale actually goes. 'Tis all foggy...like recollections from an 'ard night on the ale. Ye can imagine why people might fear fer the future if they can't rightly recall the past."},{"name":"BADERON","text":"But there is <span class=\"emphasis\">one</span> thing we all remember, an' that's the group o' 'venturers what laid down their lives to drag Eorzea back from the brink, when she was bound fer the abyss."},{"name":"BADERON","text":"Well, I say we remember... Truth is, though we ain't forgotten what they did fer us, this godsdamned Calamity-spawned memory loss robbed us o' their names..."},{"name":"BADERON","text":"It won't even let us picture their damn faces. 'Tis like starin' at a gull flyin' in front o' the sun─all ye see in yer mind's eye is a shadow set against a blindin' glare. An' that's 'ow <span class=\"emphasis\">every</span> bugger describes it, by the way...give or take the odd gull."},{"name":"BADERON","text":"It's this what's got people callin' these 'eroes the “Warriors o' Light.”"},{"name":"BADERON","text":"If Limsa's ever goin' to put this time o' darkness behind it, it's goin' to need 'venturers to 'elp banish the fear. It's goin' to need new 'eroes like the ones we lost."},{"name":"BADERON","text":"Maybe one day ye'll be one of 'em. An' that's why any aid we can give to a 'venturer is effort well spent. What say ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Ye willin' to lend us yer strength?"},{"name":"BADERON","text":"Me thanks to ye, an' to the Navigator an' all! I knew She'd steered ye my way fer a reason."},{"name":"BADERON","text":"Ah, but listen to me, yatterin' on like a sun-touched fishwife. 'Tis 'igh time we got yer mark in me book."},{"name":"BADERON","text":"Put yer scrawl right there."},{"name":"BADERON","text":"<span class=\"highlight\">Forename Surname</span>, is it? An' a fine name it is."},{"name":"BADERON","text":"Congratulations. Yer now an upstandin' member o' the 'Venturers' Guild."},{"name":"YELLOWJACKETARMY","text":"You there─adventurer. You sailed in on the last ferry, did you not?"},{"name":"YELLOWJACKETARMY","text":"The captain reported being attacked by a pirate vessel. And several witnesses have testified independently that a passenger matching your description went out on deck mere moments before the incident took place. Sending your friends signals, were you?"},{"name":"BADERON","text":"Now 'old on a just a moment there, officer. Ye've got the wrong <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">bloke</span></span>."},{"name":"BADERON","text":"This fine, upstandin' young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gent</span></span> is me dear departed grandma's sister's niece's cousin's closest companion. The <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> wouldn't be caught dead fraternizin' with such unsavory elements."},{"name":"YELLOWJACKETARMY","text":"...Is that right? Ahem. You are surely aware of the recent kidnappings? Respectfully, then, we cannot be too trusting of outsiders at a time when the loyalty of even our closest friends is in doubt."},{"name":"BADERON","text":"Aye, ye make a good point there, officer, a very good point. Very wise. Ye needn't worry, though─I keep one eye open at all times, me, an' two more often than not. Now, sir, what say ye to a tankard o' me finest ale afore ye return to yer duties, eh?"},{"name":"YELLOWJACKETARMY","text":"Not a watered-down cup of piss like last time, I should hope?"},{"name":"BADERON","text":"Ain't got the faintest idea what yer on about, officer. The Wench might offer some o' the cheapest grog this side o' the Strait o' Merlthor, but that don't mean it won't get ye good an' pickled! An' look, there's a chair over there just cryin' out to be sat on, so kick off them 'eavy boots, eh!?"},{"name":"BADERON","text":"Ye'll 'ave to excuse these eager bloody Yellowjackets. There's been a spate o' kidnappin's, see, an' they ain't got a clue who's behind 'em. Naturally, they've taken to clappin' irons on anyone who looks vaguely suspicious, which means 'venturers, visitors...an' pretty much every bugger else in this town."},{"name":"BADERON","text":"Don't take it personal, though. Us Lominsans can be an 'eadstrong bunch o' bastards, 'tis true, but given time, we'll grow on ye. Now, where was I...?"},{"name":"BADERON","text":"Oh aye! Welcome to Limsa Lominsa, where the sea's as green as the faces o' me patrons after a few too many Blackbelly whiskeys!"},{"name":"BADERON","text":"Now, take a moment to gather yer wits, an' we'll get started with learnin' ye the ways o' the city."},{"name":"SYSTEM","text":"This concludes the introductory game tutorial."},{"name":"SYSTEM","text":"You have taken your first step as an adventurer in the city of Limsa Lominsa."},{"name":"SYSTEM","text":"Listen well to the wisdom of Baderon Tenfingers, then go forth and discover the incredible adventures that await you!"}],"reward":{"gil":103,"xp":50},"next":[65644,65645,65647]},"partials":[{"type":"npc","id":"1001028","obj":{"i":1001028,"n":"Ryssfloh","l":29,"q":1}},{"type":"npc","id":"1002697","obj":{"i":1002697,"n":"Baderon","l":28,"q":3}},{"type":"npc","id":"1000914","obj":{"i":1000914,"n":"R'baharra","l":29,"q":2}},{"type":"npc","id":"1002732","obj":{"i":1002732,"n":"Grehfarr","l":29,"q":1,"t":"Lift Attendant"}},{"type":"quest","id":"65644","obj":{"i":65644,"n":"Close to Home","g":1,"l":"Limsa Lominsa","s":6}},{"type":"quest","id":"65645","obj":{"i":65645,"n":"Close to Home","g":1,"l":"Limsa Lominsa","s":7}},{"type":"quest","id":"65647","obj":{"i":65647,"n":"Making a Name","g":91,"l":"Limsa Lominsa","s":10}}]}