{"quest":{"name":"Proper Procedure","location":"Limsa Lominsa","id":65649,"patch":2.0,"sort":10,"eventIcon":71221,"issuer":1001209,"target":1001209,"involved":[1000898,1003598],"genre":91,"journal":["The goblin merchant Sweetnix appears to be in some distress.","Sweetnix wishes to submit a “letter” to Limsa Lominsa's tax offices, but is too afraid to deliver it in person. Take the letter from Sweetnix, and hand it to P'tahjha at Mealvaan's Gate.","As long as the proper procedures are observed, any merchant is free to trade within the borders of Limsa Lominsa. P'tahjha asks that you assure Sweetnix that there is nothing to fear from assessors.","Sweetnix appears overjoyed to hear P'tahjha's kind words, and thanks you for your aid in delivering his letter."],"objectives":["Deliver the letter to P'tahjha.","Report to Sweetnix."],"dialogue":[{"name":"SWEETNIX","text":"Pshhh... Shkohhh...<br>Sweetnix is beauteous gobbie and craftysmart trademaker!"},{"name":"SWEETNIX","text":"Sweetnix makes busydeal with uplanders! Need deliver letter to Gate of Mealvaan, but Sweetnix has shivershakes."},{"name":"SWEETNIX","text":"Uplander walks to Gate of Mealvaan for Sweetnix? Uplander delivers letter to taxlady P'tahjha?"},{"name":"PTAHJHA","text":"Where is Sweetnix with those import records? Without the proper documentation, I am afraid we shall have to expel him from the city..."},{"name":"PTAHJHA","text":"Why, these are Sweetnix's records! Glad I am to see they were submitted in time."},{"name":"PTAHJHA","text":"Honestly, you would think that goblin would have lost his fear of our offices by now. Every month he is to submit these papers, and every month his tardiness forces me to consider his removal."},{"name":"PTAHJHA","text":"As long as one follows proper procedure, Limsa Lominsa is quite welcoming of foreign traders. Pray convey these words to Sweetnix─perhaps it will aid in soothing the poor goblin's fears."},{"name":"SWEETNIX","text":"Uplander delivered letter to Gate of Mealvaan? Uplander has wideheart and swiftlegs!"},{"name":"SWEETNIX","text":"Taxlady P'tahjha has kind backwords for Sweetnix? Sweetnix has outflow of joy for taxlady P'tahjha!"},{"name":"SWEETNIX","text":"Sweetnix is happy gobbie! Gives uplander jinglyshine!"}],"reward":{"gil":103,"xp":50}},"partials":[{"type":"npc","id":"1001209","obj":{"i":1001209,"n":"Sweetnix Rosycheeks","l":29,"q":1}},{"type":"npc","id":"1000898","obj":{"i":1000898,"n":"P'tahjha","l":29,"q":2}},{"type":"npc","id":"1003598","obj":{"i":1003598,"n":"Quentenain","l":28,"q":3}}]}