{"quest":{"name":"A Test of Technique","location":"Gridania","id":65642,"patch":2.0,"sort":50,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"genre":140,"usedItems":[4304],"journal":["Guildmaster Geva wishes to evaluate your progress.","In order to evaluate your progress, Geva instructs you to prepare three leather chokers. Craft the items as requested and present them to her.","Geva declares your workmanship satisfactory─for a jobbing leatherworker. She rewards you with an amateur's awl and reminds you to work hard if you wish to rise from obscurity and become a famous <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 10."],"objectives":["Deliver leather chokers to Geva."],"dialogue":[{"name":"GEVA","text":"Getting used to that knife I gave you? Gods know it doesn't happen very often, but you've chanced to find me unoccupied. How about you show me what you've learned?"},{"name":"GEVA","text":"Let's see you make three leather chokers."},{"name":"GEVA","text":"After all, there's more to our craft than simply tanning hides, and chokers are just about the simplest things one can make."},{"name":"GEVA","text":"You'll need circles of leather and animal sinew to accomplish this task. Osgyth can provide the sinew, and I'm sure you recall the method for making leather."},{"name":"GEVA","text":"I hope your technique has improved since last time."},{"name":"GEVA","text":"Now, while we have an ample stock of skins, there are other means of procuring your materials."},{"name":"GEVA","text":"Hunting for your own pelts, for instance. Aye, I know what I said about that before. But that was about assuming it was <span class=\"emphasis\">necessary</span>. <span class=\"emphasis\">Choosing</span> to do so is another matter. Indeed, it may teach you to appreciate the source of your livelihood."},{"name":"GEVA","text":"Not all leatherworkers are wont to choose this method...but you are an adventurer, are you not?"},{"name":"GEVA","text":"When you've finished your work, bring your chokers here for inspection."},{"name":"GEVA","text":"You've finished your work, then?"},{"name":"GEVA","text":"I suppose there is no denying that these are leather chokers."},{"name":"GEVA","text":"If truth be told, an opo–opo could've achieved similar results given skins, sinew, and time."},{"name":"GEVA","text":"Oh, but I don't mean to make light of your efforts. You fulfilled the order precisely as requested─a job well done."},{"name":"GEVA","text":"Now then, I will teach you something to supplement your learning."},{"name":"GEVA","text":"Through physical training, the body can be made strong and resistant to injury. Not so the throat, which ever remains a vulnerable point."},{"name":"GEVA","text":"Although a leather choker provides less protection than a metal gorget, its simple design makes it ideal for everyday applications."},{"name":"GEVA","text":"This simplicity also makes it an ideal choice for beginners practicing basic techniques─and for guildmasters assessing their progress."},{"name":"GEVA","text":"As you are, you would make a passable leatherworker─one among the nameless multitudes who scrape a living out there. Whether you rise to become something more is contingent upon your efforts."},{"name":"GEVA","text":"Consider this amateur's awl a reward for your efforts."},{"name":"GEVA","text":"You will find it an indispensable partner to the head knife as you continue your training."},{"name":"GEVA","text":"Now, I must return to my work. If you chance to find me unoccupied again, mayhap I will teach you something else."},{"name":"GEVA","text":"Till then, keep your nose to the grindstone!"},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">craftsmanship</span>, <span class=\"highlight\">control</span>, and <span class=\"highlight\">CP</span> values."},{"name":"SYSTEM","text":"A higher craftsmanship rating hastens the progress of synthesis; greater control increases the chance of creating high-quality items; and additional CP improves your crafting stamina."},{"name":"SYSTEM","text":"Outfitting yourself with an eye to your current objective will increase the efficiency of your crafting endeavors."}],"reward":{"gil":194,"items":[{"num":200,"id":5},{"num":150,"id":4},{"id":2430},{"id":2652,"one":1},{"id":3309,"one":1},{"id":3763,"one":1},{"num":3,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":13}],"quests":[65745]},"next":[65671]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"2430","obj":{"i":2430,"n":"Amateur's Awl","l":5,"c":35451,"t":21,"p":129}},{"type":"item","id":"2652","obj":{"i":2652,"n":"Hempen Bandana","l":5,"c":41540,"t":34,"p":85}},{"type":"item","id":"3309","obj":{"i":3309,"n":"Hempen Chausses","l":5,"c":45048,"t":36,"p":94}},{"type":"item","id":"3763","obj":{"i":3763,"n":"Maple Pattens","l":5,"c":46122,"t":38,"p":129}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"4304","obj":{"i":4304,"n":"Leather Choker","l":5,"c":54836,"t":40,"p":88}},{"type":"quest","id":"65745","obj":{"i":65745,"n":"My First Head Knife","g":140,"l":"Gridania","s":11,"f":1}},{"type":"quest","id":"65671","obj":{"i":65671,"n":"Geva's Gambit","g":140,"l":"Gridania","s":100,"f":1}}]}