{"quest":{"name":"I Stay the Streetlight","location":"Limsa Lominsa","id":65656,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1002434,"target":1000857,"genre":91,"journal":["N'tanmo needs help keeping the city a bright and cheery place.","Unable to leave her post, N'tanmo has tasked you with inspecting the streetlamps about town. Refill them with streetlamp oil lest they run dry.","You have refilled all of the guttering streetlamps. Speak with Sisipu at the Fishermen's Guild to receive more streetlamp oil.","You learn that N'tanmo has a habit of foisting her duties upon fledgling adventurers, much to Sisipu's disapproval. However, you sense that there is more to Sisipu's frustrations than meets the eye."],"objectives":["Refill guttering streetlamps with streetlamp oil.","Speak with Sisipu at the Fishermen's Guild."],"dialogue":[{"name":"NTANMO","text":"Sounds like you're already in the Yellowjackets' good graces. You truly are a model adventurer─a paragon among your fellows!<br>...Um, do you think you could do me a favor?"},{"name":"NTANMO","text":"You see, I'm supposed to go and fill up all the streetlamps with oil so that they'll stay lit through the night. But thanks to this business of missing people, I can't simply up and leave my post."},{"name":"NTANMO","text":"If you could tend to the streetlamps in my stead, I'd be <span class=\"emphasis\">eternally</span> grateful."},{"name":"NTANMO","text":"Oh, and when you're finished, please fetch more oil from Sisipu in the Fishermen's Guild. We're running low here, and she has care of our stores."},{"name":"SISIPU","text":"...You're doing <span class=\"emphasis\">what</span>!? &lt;sigh&gt; What am I to do with that girl?"},{"name":"SISIPU","text":"She has the nerve to ask me for work, twaddlin' tripe about her savings, only to foist it on the first adventurer that comes along!"},{"name":"SISIPU","text":"Being young and pretty does <span class=\"emphasis\">not</span> give you license to shirk responsibility! Aye, she'll get her oil all right...and a piece of my mind to boot! "}],"reward":{"gil":110,"items":[{"num":5,"id":4551}],"xp":110},"reqs":{"quests":[65655]}},"partials":[{"type":"npc","id":"1002434","obj":{"i":1002434,"n":"N'tanmo","l":29,"q":2}},{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"quest","id":"65655","obj":{"i":65655,"n":"Lost and Found","g":91,"l":"Limsa Lominsa","s":20}}]}