{"quest":{"name":"Licensed to Reave","location":"Limsa Lominsa","id":65654,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1000916,"target":1000915,"involved":[1000856,1000938,1000947],"genre":91,"journal":["Mordyn would like to make you a completely legal proposition.","Mordyn invites you to take on a job for the Kraken's Arms, one of Limsa Lominsa's greatest pirating crews. Should you be interested, seek out Captain Carvallain, who awaits upon the balcony above the Seventh Sage.","Carvallain has prepared two sets of spice samplers, which he requires delivered to two individuals. Take the first to Ginnade in the Coral Tower, and the second to Lyngsath at the Bismarck.","You have delivered both sets of spice samplers. Report back to Carvallain.","In completing the task, you have endeared yourself to Carvallain. He reveals to you his ambitions to grow rich as a privateer, attacking and looting Garlean ships in the Admiral's name."],"objectives":["Speak with Carvallain.","Deliver a Seventh Sage sampler to Ginnade at the Coral Tower.","Deliver a Seventh Sage sampler to Lyngsath at the Bismarck.","Speak with Carvallain."],"dialogue":[{"name":"MORDYN","text":"Ye want fer coin, 'venturer? 'Ow'd ye fancy workin' fer the Kraken's Arms, one o' the greatest piratin' crews in Limsa?"},{"name":"MORDYN","text":"If yer interested, take yerself up these 'ere steps to the balcony above, an' talk to Carvallain, our cap'n. Do right by 'im, an' 'e'll do right by ye."},{"name":"TALK","text":"Textless"},{"name":"CARVALLAIN","text":"Greetings, friend, and welcome to the Seventh Sage, purveyors of the finest spices from the East. All of our products are guaranteed obtained through completely <span class=\"emphasis\">legal</span> means."},{"name":"CARVALLAIN","text":"Oh, you do not seek spices, but employment? Well then, let us speak of how you might be of service to our organization."},{"name":"CARVALLAIN","text":"Our <span class=\"emphasis\">Misery</span> returned from her latest voyage bearing exotic <span class=\"emphasis\">spices</span> never before seen in Eorzea. I have prepared two samplers, each of which I would have you deliver to certain individuals."},{"name":"CARVALLAIN","text":"The first is for Ginnade, whom you will find at the Coral Tower. The second is for Master Lyngsath, the head chef of the Bismarck. And <span class=\"emphasis\">do</span> make certain the right person gets the right set. Go now, and return here once you have accomplished the task."},{"name":"GINNADE","text":"Welcome to the headquarters of the Yellowjackets, the keepers of the peace in Limsa Lominsa. Is there aught I can assist you with?"},{"name":"GINNADE","text":"A sample of spice courtesy of the Seventh Sage, you say?<br>Hmmm... There is no mistake─this is firesand, and the kind used by the Garleans besides. Quite intriguing. Very well, we will consider placing an order."},{"name":"GINNADE","text":"Oh? You thought that you had brought me spice? I see you are not familiar with <span class=\"emphasis\">Carvallainisms</span>. For the sake of convenience, he uses the word “spice” to refer to literally anything he has procured on the high seas."},{"name":"GINNADE","text":"Lest you worry, the man isn't engaged in any activity that is considered piracy. Far from it. Think of him as a trader─a heavily armed one─who represents Lominsan interests in eastern lands."},{"name":"LYNGSATH","text":"A new sample from the Seventh Sage? Alright, let's 'ave a whiff of it, then."},{"name":"LYNGSATH","text":"Hmmm... Ain't smelled nothin' like it afore. The note as came with it says it's a root what grows on Othard."},{"name":"LYNGSATH","text":"Last I 'eard, Othard was under imperial rule. 'Ow the seven 'ells did Carvallain manage to get 'old o' this?"},{"name":"LYNGSATH","text":"Anyroad, I reckon I can cook up summat fresh an' new with it. Thanks fer the delivery, friend."},{"name":"CARVALLAIN","text":"Welcome back. It would seem both samples were rather well received, and this is in no small part due to our affable courier."},{"name":"CARVALLAIN","text":"'Tis unfortunate, but notoriety accumulated over the course of years does not fade overnight. There are many still who are hesitant to do business with savage pirates."},{"name":"CARVALLAIN","text":"Yet the old days of piracy have passed, giving way to a new wave of opportunity. My crew and I have decided to embrace this wave."},{"name":"CARVALLAIN","text":"With the Admiral's blessing, we engage in a form of <span class=\"emphasis\">trade</span> with Garlean ships. Everything we do, you may rest assured, is within the law."}],"reward":{"gil":110,"xp":110}},"partials":[{"type":"npc","id":"1000916","obj":{"i":1000916,"n":"Mordyn","l":28,"q":2}},{"type":"npc","id":"1000915","obj":{"i":1000915,"n":"Carvallain","l":28,"q":6}},{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"npc","id":"1000938","obj":{"i":1000938,"n":"Ginnade","l":28,"q":6}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}}]}