{"quest":{"name":"A Thousand Words","location":"Limsa Lominsa","id":65653,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1001537,"target":1000957,"involved":[1000937],"genre":91,"journal":["Latisha needs someone to report a bilking patron.","A first-time patron has left without settling his bill, and Latisha wants you to report the incident to the Yellowjackets. First, speak with R'sushmo and receive her sketch of the criminal.","A visibly shaken R'sushmo entrusts you with her rendition of the offender. Deliver it to Godebert at the Coral Tower.","Unfortunately, the artist's rendition alone will not suffice to identify the offender. Instead, Godebert bids you tell R'sushmo to present herself at the Coral Tower for questioning.","R'sushmo cannot comprehend what the problem is with her handiwork. You do not have the heart to tell her the truth."],"objectives":["Receive R'sushmo's artist's rendition.","Deliver the artist's rendition to Godebert at the Coral Tower.","Speak with R'sushmo."],"dialogue":[{"name":"LATISHA","text":"We spare no effort to ensure that all our patrons enjoy the finest food and hospitality. And so it is doubly hurtful when someone decides to leave without settling the bill. Nary a bell ago, a first-time patron did just that."},{"name":"LATISHA","text":"R'sushmo is the one who lovingly prepared the man's meal. She is quite upset by the whole affair, and has taken it upon herself to draw an illustration of the offender. Might I trouble you to deliver it to the Yellowjackets on our behalf? R'sushmo should be done adding the finishing touches by now."},{"name":"RSUSHMO","text":"Grrr... I poured my heart and soul into that grilled dodo... If I ever get my hands on that scoundrel, I'll grind his bones to make my bread!"},{"name":"RSUSHMO","text":"Here it is, my rendition of the criminal! Please deliver it to Godebert at the Coral Tower─he will know what to do!"},{"name":"TALK","text":"Textless"},{"name":"GODEBERT","text":"A bilker at the Bismarck, and you have an artist's rendition of the man?"},{"name":"GODEBERT","text":"Er...what in the seven hells is this supposed to be? It looks more like the prow of a ship than a man's face!"},{"name":"GODEBERT","text":"Look, we would like nothing more than to bring the offender to justice─'tis our duty, after all. However, we will need a little bit more to go on than this piece of...art."},{"name":"GODEBERT","text":"It would be easiest for all involved if R'sushmo were to come here and answer some questions. Please relay to her as much."},{"name":"TALK","text":"Textless"},{"name":"RSUSHMO","text":"Ah, so you've spoken with Godebert? Bwahahaha! Within the bell, the Yellowjackets will have that swindling scoundrel locked in a dungeon cell, and then I'll take my filleting knife and─"},{"name":"RSUSHMO","text":"Huh? Godebert wants me to go to the Coral Tower for <span class=\"emphasis\">questioning</span>!?"},{"name":"RSUSHMO","text":"But what more information does he want that my drawing doesn't already provide!? Isn't a picture supposed to paint a thousand words!?"}],"reward":{"gil":110,"xp":110}},"partials":[{"type":"npc","id":"1001537","obj":{"i":1001537,"n":"Latisha","l":28,"q":6}},{"type":"npc","id":"1000957","obj":{"i":1000957,"n":"R'sushmo","l":28,"q":1}},{"type":"npc","id":"1000937","obj":{"i":1000937,"n":"Godebert","l":28,"q":1}}]}