{"quest":{"name":"A Soldier's Breakfast","location":"Central Shroud","id":65661,"patch":2.0,"sort":32,"eventIcon":71201,"target":1000408,"involved":[1000449,1000455],"genre":0,"journal":["Pauline at Gabineaux's Bower needs an adventurer to cull the growing anole population, as well as gather some of the scalekin's eggs.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Pauline at Gabineaux's Bower.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have thinned the number of anoles and collected their eggs. Report to Pauline at Gabineaux's Bower.","Large and rich in nutrients, anole eggs make a perfect breakfast for a soldier. Deliver them to Tsubh Khamazom at the Bannock.","Upon taking receipt of your gift of anole eggs, Tsubh Khamazom notes with admiration that you appear not to have sustained any serious injury in the course of their collection."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Pauline at Gabineaux's Bower.</span>"],"dialogue":[{"name":"PAULINE","text":"A word with you, <span class=\"highlight\">Forename</span>. I hesitate to make such a dangerous request, but might you assist us in thinning the number of anoles on Naked Rock?"},{"name":"PAULINE","text":"In our efforts to commune with the elementals, we conjurers often find ourselves in the area. Of late, however, our meditations have all too frequently been interrupted by unprovoked anole attacks. Truly, the beasts grow more aggressive by the day."},{"name":"PAULINE","text":"Their numbers have continued to grow since the advent of the Seventh Umbral Era, you see, forcing packs of the scalekin to come down from the mountains in search of food. If you could slay half a dozen or so of the beasts, that should lessen their need to hunt and also serve as a warning to the anoles to remain within their territory."},{"name":"PAULINE","text":"But I am afraid you must do more than thin the existing population. If we are to truly break this spiraling growth, then we must also target their future offspring. Bring me four anole eggs, and you will have played your part in returning balance to this area of the forest."},{"name":"PAULINE","text":"Ah, you have returned. Now might my brothers and sisters continue their meditations undisturbed. You have my thanks."},{"name":"PAULINE","text":"As for these eggs, may I ask you to deliver them to Tsubh Khamazom at the Bannock?"},{"name":"PAULINE","text":"Anole eggs are both large and filled with nutrients─the perfect meal for a soldier. She will be more than a little pleased to see you, I should imagine."},{"name":"TSUBHKHAMAZOM","text":"Who goes there!? Oh, <span class=\"highlight\">Forename</span>, it's you. Hm? Another delivery?"},{"name":"TSUBHKHAMAZOM","text":"I'm not certain I should be the one to─ By Nophica, these are anole eggs! The troops will be glad indeed to see these at table! And you say Hearer Pauline sent you on this errand?"},{"name":"TSUBHKHAMAZOM","text":"I hear the anoles are more numerous than ever, yet you appear to have managed the task with your skin intact. Your skill and bravery continue to amaze me, <span class=\"highlight\">Forename</span>."}],"reward":{"xp":3240},"reqs":{"jobs":[{"lvl":4,"id":130}],"quests":[65734]}},"partials":[{"type":"npc","id":"1000408","obj":{"i":1000408,"n":"Tsubh Khamazom","l":54,"q":4}},{"type":"npc","id":"1000449","obj":{"i":1000449,"n":"Monranguin","l":54,"q":4}},{"type":"npc","id":"1000455","obj":{"i":1000455,"n":"Ealdfrith","l":54,"q":2}},{"type":"quest","id":"65734","obj":{"i":65734,"n":"Butcher of Greentear","g":0,"l":"Central Shroud","s":31}}]}