{"quest":{"name":"Spirithold Broken","location":"Central Shroud","id":65665,"patch":2.0,"sort":33,"icon":100003,"eventIcon":71201,"issuer":1000421,"target":1000100,"involved":[1000465,1000512,1000513,1000514,1000515,1000516,1000740],"genre":1,"journal":["Galfrid, chief instructor at the Bannock, would entrust you with the task of investigating Spirithold.","You learn that a party of conjurers and their Wood Wailer escort were attacked by a towering shadow while performing a sacred rite inside Spirithold. Report to Alestan, who stands guard at the dungeon's entrance, and request further orders.","While the majority of those who entered Spirithold have been evacuated, two conjurers, three Wood Wailers, and the Hearer remain unaccounted for. Locate the missing, and rescue any survivors.","Only the Hearer remains, somewhere in the dungeon's depths. Find him and ensure that he leaves Spirithold alive.","You encounter a mysterious masked mage who unleashes a clay golem upon you. After a desperate struggle, you manage to dispatch the automaton just as Yda and Papalymo arrive.","The presence of the two scholars triggers yet another inexplicable vision inside your mind. Though your soul cries out for answers, this is neither the time nor place to ask questions. Report to Alestan outside Spirithold.","Alestan listens intently as you recount all that unfolded within Spirithold. Understandably concerned, the Wood Wailer promises to investigate the masked mage, and bids you return to Gridania and speak with Miounne.","Safely back in Gridania, you relate your tale to Miounne, only for her to forbid you from repeating the story to others. What strange forces could be at work in the Twelveswood? Such matters are best left to the Hearers, it would seem. For now, take advantage of Miounne's introduction to guildleves, as well as her offer of guild accommodations, and prepare yourself for future adventures."],"objectives":["Speak with Alestan.","Rescue the missing conjurers and Wood Wailers.","Rescue the Hearer.","Report to Alestan.","Return to Gridania and speak with Miounne."],"dialogue":[{"name":"GALFRID","text":"<span class=\"highlight\">Forename</span>! Thank the gods you've come!"},{"name":"GALFRID","text":"We have a potential crisis on our hands, and I would appreciate your assistance. Will you hear me out?"},{"name":"GALFRID","text":"Listen well, for we haven't much time."},{"name":"GALFRID","text":"To the southeast of here lies a dungeon known as Spirithold. It was all but destroyed during the Calamity."},{"name":"GALFRID","text":"Desiring to offer the ruins back to the forest, a Hearer ventured inside to carry out the Rite of Returning."},{"name":"GALFRID","text":"Alas, it would seem something has gone awry. Word arrived just moments ago that the Hearer and his guards have been attacked by a towering shadow. Aye, you heard me true─a <span class=\"emphasis\">shadow</span>."},{"name":"GALFRID","text":"On any other day, I would dispatch my best Quivermen to provide support, but I sent them to repel an Ixali incursion in the West Shroud nary a bell ago."},{"name":"GALFRID","text":"The timing of these events cannot be mere coincidence. I fear the Ixal somehow caught wind of our plans, and are attempting to disrupt the rite in an effort to weaken the bond between man and elemental."},{"name":"GALFRID","text":"They must not be allowed to succeed. And so I bid you go to Spirithold and do whatever is necessary to resolve the situation. Please, say you will help us."},{"name":"GALFRID","text":"I knew you would not let me down. You will have all the support I can muster."},{"name":"GALFRID","text":"Now, we are racing against time, so you had best make haste."},{"name":"ALESTAN","text":"Who goes there? An adventurer, is it?"},{"name":"ALESTAN","text":"Here at Instructor Galfrid's request, you say? Thank the Matron!"},{"name":"ALESTAN","text":"Doubtless you already know this, but a towering shadow manifested without warning and attacked the Hearer in the midst of the rite."},{"name":"ALESTAN","text":"Most of his party has been successfully evacuated, but five remain unaccounted for."},{"name":"ALESTAN","text":"Please find them, and see them out of harm's way."},{"name":"KIKOKUA","text":"&lt;groan&gt; A great shadow...towering over me... What in the Twelve's good grace?"},{"name":"KIKOKUA","text":"A-An adventurer!? Please, you must save the Hearer!"},{"name":"KIKOKUB","text":"Galfrid...sent you?"},{"name":"KIKOKUB","text":"I am no longer...of use here. Pray help the Hearer...in my stead."},{"name":"KIKOKUC","text":"Away, vile fiend! Away, I say! I defy you! <span class=\"emphasis\">I defy yooouuu</span>!!!<br>...Uh? ...Oh! An adventurer!"},{"name":"KIKOKUC","text":"W-We were ambushed─ambushed in the midst of the ritual! And then... And then...I'm not sure what happened."},{"name":"CONJURERA","text":"...You were sent to help? I fear you are too late─the ritual has failed."},{"name":"CONJURERA","text":"I must needs return to Gridania. The Seedseers must know of this."},{"name":"CONJURERB","text":"That thing was no elemental, but a being born of darkness."},{"name":"CONJURERB","text":"The Hearer languishes alone in the depths. You must help him!"},{"name":"CONJURERC","text":"Do not mind me... Save the others..."},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">O mournful voice of creation! Grant ye this humble stone a soul, that it may wake to life!</span>"},{"name":"SYSTEM","text":"Defeat the clay golem!"},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">That the golem could be vanquished...</span>"},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">That <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> is no ordinary adventurer.</span>"},{"name":"PAPALYMO","text":"Damnation! He has eluded us yet again!"},{"name":"YDA","text":"Oh, fancy meeting you here! How are things?"},{"name":"PAPALYMO","text":"Hm? Whatever are you─"},{"name":"YDA","text":"Shhh! More birds! This makes it how many times today? Seven?"},{"name":"PAPALYMO","text":"Their movements are beyond our fathoming."},{"name":"PAPALYMO","text":"They are up to something, that much is plain─the question is, <span class=\"emphasis\">what</span>?"},{"name":"YDA","text":"Hmmm. Do you think maybe...they're trying to summon their primal?"},{"name":"PAPALYMO","text":"I hope not, for all our sakes. Yet we must be prepared for the worst."},{"name":"PAPALYMO","text":"Withered. The same fate has befallen Emerald Moss."},{"name":"PAPALYMO","text":"It is as we feared: Dalamud's anomaly is affecting life in the Twelveswood."},{"name":"YDA","text":"You mean the disturbance in the aetheric flow?"},{"name":"PAPALYMO","text":"The very same. The Garleans have a lot to answer for."},{"name":"PAPALYMO","text":"The imbalance they have created is plunging the land into chaos, just as Louisoix forewarned."},{"name":"YDA","text":"It's no wonder the primals have started appearing..."},{"name":"PAPALYMO","text":"Time is against us, but there is still hope for the land."},{"name":"PAPALYMO","text":"We must hold fast to that hope and fight to the very last."},{"name":"YDA","text":"Agreed!"},{"name":"YDA","text":"Waaah!"},{"name":"YDA","text":"Ack! Stupid things..."},{"name":"PAPALYMO","text":"These <span class=\"emphasis\">stupid things</span> happen to be the very latest in Sharlayan innovation! Show some respect!"},{"name":"YDA","text":"But they're so uncomfortable and...and...<span class=\"emphasis\">ugly</span>!"},{"name":"PAPALYMO","text":"If you ask me, they're an improvement over that mask of yours."},{"name":"YDA","text":"&lt;sigh&gt; Hard to believe it's already been five whole years, isn't it?"},{"name":"PAPALYMO","text":"<span class=\"emphasis\">Already</span>? Five years is but a heartbeat in the life of the planet!"},{"name":"YDA","text":"I suppose you're right... Now that I think about it, the Twelveswood's barely recovered at all, and the Gridanians still have the same old problems."},{"name":"PAPALYMO","text":"Aye, along with some new ones. Just in case the Ixal and Garuda weren't troublesome enough, the sylphs <span class=\"emphasis\">had</span> to go and invite Ramuh, didn't they?"},{"name":"YDA","text":"...Do you ever think about those adventurers who fought alongside us? I do. And then five years seems like ages... I wonder what became of them."},{"name":"YDA","text":"Ah..."},{"name":"PAPALYMO","text":"Yda, look."},{"name":"YDA","text":"Hm?"},{"name":"YDA","text":"Golly!<br>...And this is what, exactly?"},{"name":"PAPALYMO","text":"Yet another disturbance in the aether, and freshly manifested at that."},{"name":"PAPALYMO","text":"It seems to be emanating from Lifemend Stump. We must hurry!"},{"name":"YDA","text":"Are you all right? Your eyes glazed over for a while there."},{"name":"PAPALYMO","text":"The good news is that the Hearer is unharmed. Somewhat dazed, yes, but whole of mind and body. The bad news...concerns everything else."},{"name":"PAPALYMO","text":"Lest you forget, the Twelveswood is the domain of the elementals; it is by their leave that man abides in the forest and avails himself of its bounty. The ground which the dungeon occupies is no different."},{"name":"PAPALYMO","text":"Having no more use for the dungeon, the Gridanians sent a Hearer to offer the place back to the elementals by way of the Rite of Returning, which is essentially an expression of gratitude."},{"name":"PAPALYMO","text":"Alas, he failed to complete the ritual for obvious reasons."},{"name":"PAPALYMO","text":"While the poor soul cannot be blamed for this, the fact remains that unless the elementals are given their due, they may well consider it a slight. And the very <span class=\"emphasis\">last</span> thing the Gridanians can afford to do in these uncertain times is risk alienating the Twelveswood's eternal guardians."},{"name":"PAPALYMO","text":"But you have more than done your part. We shall see the Hearer to safety, and send for his peers to finish the rite."},{"name":"PAPALYMO","text":"In the meantime, please make your way outside and report to Alestan."},{"name":"PAPALYMO","text":"Ah, but where are my manners?"},{"name":"PAPALYMO","text":"I am Papalymo, and the tactless woman beside me here is─"},{"name":"YDA","text":"Yda!"},{"name":"YDA","text":"Papalymo and I are surveying the Twelveswood together!"},{"name":"YDA","text":"Pleased to meet you!"},{"name":"PAPALYMO","text":"Yda, give me a hand, would you?"},{"name":"PAPALYMO","text":"Wait. There is something...familiar about you. Could it be that you are...?"},{"name":"PAPALYMO","text":"N-Never mind. Doubtless my eyes are playing tricks. Till we meet again!"},{"name":"ALESTAN","text":"All this happened inside Spirithold? Twelve preserve us..."},{"name":"ALESTAN","text":"Who was that masked mage, and by what dark ambition is he driven? So many things shrouded in mystery..."},{"name":"ALESTAN","text":"Well, I shan't find any answers on my own. I must needs discuss this with Galfrid. The matter warrants a full investigation, if I am any judge, and that shall certainly be my recommendation."},{"name":"ALESTAN","text":"Your courage has saved many lives this day, adventurer. For this you have my deepest gratitude."},{"name":"ALESTAN","text":"Pray return to Gridania and seek out Miounne."},{"name":"ALESTAN","text":"I understand she wishes to thank you for your efforts on our behalf."},{"name":"MIOUNNE","text":"Welcome back, <span class=\"highlight\">Forename</span>. A little bird tells me that the Hearer and his party owe you their lives."},{"name":"MIOUNNE","text":"A tale for the tavern if ever there were one!<br>...It is only a shame that I must ask you not to tell it─for the time being, at least. Do I make myself clear?"},{"name":"MIOUNNE","text":"Until the Hearers have made their will on the matter known, it would be best to avoid unsettling people with stories of walking statues."},{"name":"MIOUNNE","text":"Now then, you must have suitable recompense for your valiant service."},{"name":"MIOUNNE","text":"For the first half of your reward, I give you leave to make use of the accommodations here at the guild."},{"name":"MIOUNNE","text":"Arrangements have been made, so all you need do is speak with Antoinaut whenever you crave the comfort of a firm bed and a soft pillow."},{"name":"MIOUNNE","text":"For the second half of your reward, I offer you another path to fame and fortune: guildleves."},{"name":"MIOUNNE","text":"Guildleves are records of the various requests we receive from the citizenry. They outline all manner of tasks which ambitious young adventurers like you can elect to undertake."},{"name":"MIOUNNE","text":"Gontrant is our guildleve official, or “levemete,” here at the Carline Canopy. I have spoken with him regarding your knack for solving challenging problems, and he is eager to make your acquaintance."},{"name":"MIOUNNE","text":"By the way, have you perchance heard about the coming festival? It is truly a splendid occasion, looked forward to by young and old alike, and one I heartily recommend that you take the time to enjoy."},{"name":"MIOUNNE","text":"Don't be <span class=\"emphasis\">too</span> disappointed if the recent troubles cast a shadow over proceedings, however. I fear nothing short of the mysterious interloper's apprehension can prevent that..."},{"name":"MIOUNNE","text":"But we were talking about you, <span class=\"highlight\">Forename</span>. You have made Mother proud. I expect great things of you, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>!"},{"name":"SYSTEM","text":"In recognition of your achievements, you are now granted access to guildleves and inn rooms."},{"name":"SYSTEM","text":"As you complete quests and embark on new adventures, the world will draw you ever deeper into its mysteries."},{"name":"SYSTEM","text":"The great realm of Eorzea yet holds myriad roads untraveled and sights unseen. Continue along the path of the adventurer and discover what wonders await you!"},{"name":"Q1","text":"Duty calls. Do you wish to proceed with<br>“Spirithold Broken”?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MASKEDMAGUS","text":"You are strong. But are you strong enough to withstand <span class=\"emphasis\">this</span>?"},{"name":"MASKEDMAGUS","text":"Yesss...writhe! Writhe in eternal darkness!"},{"name":"MASKEDMAGUS","text":"Impossible! Never has the golem been so sorely tested!"},{"name":"SYSTEM","text":"You now have access to Recommendations. This feature displays a list of quests or duties currently available in your area."},{"name":"SYSTEM","text":"The Recommendations list can be opened from under Duty in the main menu, and will also be displayed automatically when you log in. If you find yourself unsure of what to do next, this tool makes it simple to locate activities suitable for your present class and level."}],"reward":{"gil":206,"items":[{"num":23,"id":5}],"xp":3240},"reqs":{"jobs":[{"lvl":9,"id":130}],"quests":[69391]},"next":[65712,65756,66964]},"partials":[{"type":"npc","id":"1000421","obj":{"i":1000421,"n":"Galfrid","l":54,"q":6}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000465","obj":{"i":1000465,"n":"Alestan","l":54,"q":1}},{"type":"npc","id":"1000512","obj":{"i":1000512,"n":"Worried Wood Wailer","l":54,"q":1}},{"type":"npc","id":"1000513","obj":{"i":1000513,"n":"Witless Wood Wailer","l":54,"q":1}},{"type":"npc","id":"1000514","obj":{"i":1000514,"n":"Overwrought Wood Wailer","l":54,"q":1}},{"type":"npc","id":"1000515","obj":{"i":1000515,"n":"Cool-headed Conjurer","l":54,"q":1}},{"type":"npc","id":"1000516","obj":{"i":1000516,"n":"Confused Conjurer","l":54,"q":1}},{"type":"npc","id":"1000740","obj":{"i":1000740,"n":"Injured Hearer","l":54,"q":1}},{"type":"quest","id":"69391","obj":{"i":69391,"n":"A Soldier's Breakfast","g":1,"l":"Central Shroud","s":32}},{"type":"quest","id":"65712","obj":{"i":65712,"n":"On to Bentbranch","g":1,"l":"Gridania","s":40}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"66964","obj":{"i":66964,"n":"He's Got a Ticket to Ride","g":92,"l":"Gridania","s":90}}]}