{"quest":{"name":"Way of the Conjurer","location":"Gridania","id":65669,"patch":2.0,"sort":10,"icon":100051,"unlocksFunction":1,"eventIcon":71341,"issuer":1000323,"target":1000692,"genre":133,"journal":["Madelle wishes you to reaffirm your desire to join the Conjurers' Guild.","You have been referred to Brother E–Sumi–Yan, the master of the Conjurers' Guild. Seek an audience with him at Stillglade Fane.","Satisfied that you will dedicate yourself to conjury, Brother E–Sumi–Yan formally admits you to the Conjurers' Guild. Take up the weathered cane he has bestowed upon you, and speak to him once more to receive your first task as a conjurer of Stillglade Fane."],"objectives":["Speak with Brother E–Sumi–Yan."],"dialogue":[{"name":"MADELLE","text":"Is your mind made up? Are you ready to join the Conjurers' Guild?"},{"name":"MADELLE","text":"So you require more time to decide... Very well. Know that there is no call for haste─such a decision must not be rushed."},{"name":"MADELLE","text":"It takes unwavering conviction to become a conjurer. After all, if you are not ready to embrace nature fully, you cannot expect nature to embrace you. Ponder these words, and return here again when you are certain you wish to walk our path."},{"name":"MADELLE","text":"That is well. I shall introduce you to our guildmaster, Brother E–Sumi–Yan."},{"name":"MADELLE","text":"Brother E–Sumi–Yan presides over the Conjurers' Guild even as he serves the nation as a Hearer."},{"name":"MADELLE","text":"You will find him in the meditation area within. Go to him, and make known your desire to join the guild."},{"name":"ESUMIYAN","text":"Greetings, adventurer. I am told you wish to become a conjurer of Stillglade Fane."},{"name":"ESUMIYAN","text":"I am Brother E–Sumi–Yan, master of this guild."},{"name":"ESUMIYAN","text":"Before you are formally accepted into our ranks, I would impart to you the principles of conjury. Pray attend me well."},{"name":"ESUMIYAN","text":"Conjury is an arcane art that takes life and the living for its domain. Its primary purpose is the salving of hurts and the granting of protection."},{"name":"ESUMIYAN","text":"Adventurers such as yourself oft stand upon the front lines of battle. Owing to this, you are like to find yourself in many situations wherein a capacity for healing would be advantageous. Mind you, there is more to conjury than that."},{"name":"ESUMIYAN","text":"By harnessing the power of earth, wind, and water, conjurers are also capable of weaving spells that wreak havoc."},{"name":"ESUMIYAN","text":"In terms of sheer destructive power, conjury may pale in comparison to thaumaturgy, but its capacity to defend one against aggression more than compensates for this relative shortcoming."},{"name":"ESUMIYAN","text":"In mastering healing and purification, not only will you be able to mend wounds and purge afflictions─you will also be able to breathe life back into the fallen."},{"name":"ESUMIYAN","text":"More than simply healers, yet not true dealers of destruction, conjurers realize their full potential when they employ their powers in support of others. This, my dear adventurer, is what it means to be one of us."},{"name":"ESUMIYAN","text":"...Hm, mayhap that was too much to grasp upon a single hearing. But worry not, for the meaning of my words will become clear to you in due time."},{"name":"ESUMIYAN","text":"Aye, you will come to understand that conjury is not the sole province of the conjurer."},{"name":"ESUMIYAN","text":"Should you wish to walk our path, I must needs ask that you solemnly vow to embrace nature─to heed the will of the elementals and the Twelveswood alike. Can you make this vow?"},{"name":"Q1","text":"Do you vow to embrace nature?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"ESUMIYAN","text":"I knew your answer ere your lips had parted. The air of uncertainty yet clings to you."},{"name":"ESUMIYAN","text":"So long as doubt clouds your heart, you will not be able to draw on the power of the elements. Search your soul, and seek me again when you have resolved to become as one with nature."},{"name":"ESUMIYAN","text":"I knew your answer ere your lips had parted. Yet I am no less pleased to hear it."},{"name":"ESUMIYAN","text":"By the power vested in me, I hereby name you a member of the Conjurers' Guild."},{"name":"ESUMIYAN","text":"If you would be so kind as to lend me your hunting log, I shall add to it the names of such creatures as would pose a suitable challenge to a conjurer."},{"name":"ESUMIYAN","text":"And to mark this momentous occasion, I present to you this cane. Though it may be old and weathered, it will serve you well as you take your first steps upon the path of the conjurer."},{"name":"ESUMIYAN","text":"Take up your cane, <span class=\"highlight\">Forename</span>, and present yourself to me once more."},{"name":"ESUMIYAN","text":"I would assign you your first task as a conjurer of Stillglade Fane."}],"reward":{"items":[{"id":1995}],"xp":100},"reqs":{"quests":[65718]},"next":[65683,65747]},"partials":[{"type":"npc","id":"1000323","obj":{"i":1000323,"n":"Madelle","l":53,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"item","id":"1995","obj":{"i":1995,"n":"Weathered Cane","l":1,"c":32611,"t":9,"p":94}},{"type":"quest","id":"65718","obj":{"i":65718,"n":"So You Want to Be a Conjurer","g":0,"l":"Old Gridania","s":0,"f":1}},{"type":"quest","id":"65683","obj":{"i":65683,"n":"Trial by Wind","g":133,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65747","obj":{"i":65747,"n":"My First Cane","g":133,"l":"Gridania","s":12,"f":1}}]}