{"quest":{"name":"Aldgoat Everything","location":"Gridania","id":65673,"patch":2.0,"sort":200,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"genre":140,"usedItems":[3784],"journal":["Guildmaster Geva has a difficult task for you.","In order to gauge your aptitude for materia melding, Geva instructs you to prepare a pair of materia-enhanced goatskin leggings. Though the aldgoat leather and cotton cloth you require are common in Thanalan, you need not travel to the sultanate to procure them. However, such a trip may be warranted if you know nothing of materia, as a goblin scholar living in central Thanalan is said to be an authority on the subject. Prepare the requested item and deliver it to the guildmaster.","Your work elicits no complaints from the guildmaster this time. However, she still doubts your understanding of the leatherworker's craft, and demands that you redouble your efforts to hone your skills. She also mentions that, were you to improve beyond all recognition, you <span class=\"emphasis\">might</span> be eligible to contribute some work to the annual exhibition─though such lofty goals are yet far off.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 25."],"objectives":["Deliver a pair of materia-enhanced goatskin leggings to Geva."],"dialogue":[{"name":"GEVA","text":"Ah, there you are, <span class=\"highlight\">Forename</span>. I hope you've been working on your techniques, because I have a difficult task for you."},{"name":"GEVA","text":"Well, mayhap not as difficult as I had originally intended. I had thought to bid you prepare a hundred circles of aldgoat leather, but instead I want to gauge your aptitude for materia melding."},{"name":"GEVA","text":"You have at least a passing familiarity with materia, correct? The crystallized substance often used to enhance the properties of weapons and armor?"},{"name":"GEVA","text":"I certainly hope you do, <span class=\"highlight\">Forename</span>, because an experienced leatherworker is expected to possess the skills to meld materia to his wares."},{"name":"GEVA","text":"For this task, you will affix a single materia to a pair of goatskin leggings."},{"name":"GEVA","text":"What type of materia you use is of no consequence. What matters is your ability to successfully attach it."},{"name":"GEVA","text":"And it goes without saying that you must make the leggings as well. To do so, you'll need cotton cloth and aldgoat leather."},{"name":"GEVA","text":"Most cotton cloth is produced by the weavers of Ul'dah's Sunsilk Tapestries, while aldgoat leather is, of course, obtained from aldgoats, which roam the deserts of Thanalan."},{"name":"GEVA","text":"Lest you think I mean to send you all the way to the sultanate, fear not."},{"name":"GEVA","text":"If you can obtain your materials by perusing the market boards or by eliciting the help of friends, by all means, do so."},{"name":"GEVA","text":"That said, a trip to central Thanalan might be warranted if you know nothing of materia. There's a goblin somewhere out there who's said to be an authority on the subject."},{"name":"GEVA","text":"Now run along and get crafting, <span class=\"highlight\">Forename</span>!"},{"name":"GEVA","text":"Are the leggings ready yet? I trust you didn't forget to attach a materia to it?"},{"name":"GEVA","text":"Well...they could be worse."},{"name":"GEVA","text":"I don't know how long you've been about this adventuring business, <span class=\"highlight\">Forename</span>, but did you know that leggings were once no more than strips of cloth or leather? It's true! We used to wrap each leg with a single long strip, from ankle to knee."},{"name":"GEVA","text":"Nowadays, of course, designs which extend to the thigh are far more popular. Soft, lightweight leggings like these provide the balance of protection and flexibility demanded by the Wood Wailers, the Gods' Quiver, and adventurers like your good self."},{"name":"GEVA","text":"Based on your leggings, I'd say you understood well the importance of these qualities─not to mention the basics of materia melding. Indeed, if I were to judge your performance on a scale of one to ten, I would give you a six─no, a <span class=\"emphasis\">seven</span>."},{"name":"GEVA","text":"...The remaining three points, you ask?"},{"name":"GEVA","text":"Quite simple, really. Your leggings were made from skins, which were taken from living creatures."},{"name":"GEVA","text":"The Twelveswood is filled with a wealth of life, which we leatherworkers must take in order to craft our products."},{"name":"GEVA","text":"Do you know how that aldgoat lived? How it was killed and skinned? Do you understand how these skins find their way to our hands?"},{"name":"GEVA","text":"To understand this process is to understand life itself. Those leatherworkers whose creations truly <span class=\"emphasis\">deserve</span> to bear the name of Fen–Yll have faced this burden and accepted it. To them, it's simply truth. Therein lies the difference between the good and the great."},{"name":"GEVA","text":"Your leggings are fine, <span class=\"highlight\">Forename</span>. It is you that needs improvement. Call me an incurable optimist, but I do not think it beyond you."},{"name":"GEVA","text":"Study your materials and learn their history. Practice your craft and keep discovering new techniques. That is still your path forward."},{"name":"GEVA","text":"And who knows? Mayhap one day I'll allow you to represent the guild in the annual exhibition, and pit your skills against the finest craftsmen in all of Gridania..."},{"name":"GEVA","text":"Of course, that day─should it ever come─is yet a long way off... Still, it is good to have a goal, however distant, is it not?"}],"reward":{"gil":470,"items":[{"id":2420},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":13}],"quests":[65672]},"next":[65587]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"2420","obj":{"i":2420,"n":"Initiate's Head Knife","l":19,"c":35403,"t":20,"p":765}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"3784","obj":{"i":3784,"n":"Goatskin Leggings","l":17,"c":46163,"t":38,"p":569}},{"type":"quest","id":"65672","obj":{"i":65672,"n":"Working Hells for Leather","g":140,"l":"Gridania","s":150,"f":1}},{"type":"quest","id":"65587","obj":{"i":65587,"n":"Skin in the Game","g":140,"l":"Gridania","s":250,"f":1}}]}