{"quest":{"name":"A Carpenter in Need","location":"Gridania","id":65677,"patch":2.0,"sort":150,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000149,1000200,1000254],"genre":136,"usedItems":[1823,1895],"journal":["Timbermaster Beatin needs a carpenter to assist one of his newest apprentices.","Postponing your final test, Timbermaster Beatin asks you to assist one of the guild's newest members, an adventurer named Mera Pamera.","The task of preparing a vast batch of oak lumber has overwhelmed fellow adventurer Mera Pamera. Hoping to escape Timbermaster Beatin's infamous wrath, he begs that you make an ash shortbow and a feathered harpoon in his stead, and deliver them to the Archers' and Lancers' Guilds, respectively.","You deliver the items as requested and spare the Lalafellin carpenter-in-training a fate worse than death. Report back to Timbermaster Beatin.","Timbermaster Beatin is not fooled by your efforts to give Mera Pamera the credit for your crafting, yet seems anything but displeased by your attempted deception. He subsequently reveals that the whole affair was in fact an improvised third trial intended to gauge your compassion. He congratulates you on completing your training and declares you a journeyman carpenter.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 20."],"objectives":["Speak with Mera Pamera.","Deliver a feathered harpoon to Ywain.","Deliver an ash shortbow to Luciane.","Report to Beatin."],"dialogue":[{"name":"BEATINE","text":"Well met, <span class=\"highlight\">Forename</span>. Your training as a carpenter is almost complete. Indeed, I had a splendid final test prepared for you."},{"name":"BEATINE","text":"Alas, the plight of one of our guild's newer members demands my attention."},{"name":"BEATINE","text":"The boy's name is Mera Pamera, and he is an adventurer like you─though one of rather less promise."},{"name":"BEATINE","text":"Something troubles the lad, yet he is loath to speak of personal matters with me─though I am the very <span class=\"emphasis\">soul</span> of understanding, as you know..."},{"name":"BEATINE","text":"Mayhap you would fare better? I sense that he may be more inclined to speak with a fellow adventurer."},{"name":"BEATINE","text":"Now go, <span class=\"highlight\">Forename</span>, and do not disappoint me."},{"name":"MERAPAMERA","text":"Gods strike me down for a fool! I'll never be able to finish in time!"},{"name":"MERAPAMERA","text":"Please! You <span class=\"emphasis\">must</span> help me!"},{"name":"MERAPAMERA","text":"You can make ash shortbows and feathered harpoons, can't you!?"},{"name":"MERAPAMERA","text":"You see, I went and forgot that I had agreed to craft two weapons for the Archers' and Lancers' Guilds for delivery no later than, well...today."},{"name":"MERAPAMERA","text":"But today I am <span class=\"emphasis\">also</span> obligated to complete an order of <span class=\"emphasis\">one hundred</span> lengths of oak lumber!"},{"name":"MERAPAMERA","text":"The point being that I can't possibly do both! And Timbermaster Beatin is a veritable <span class=\"emphasis\">terror</span> when his wrath is on him! If I dare neglect either duty, he surely will not spare me his saw!"},{"name":"MERAPAMERA","text":"So...while I labor over this lumber, might you consent to craft the goods for the guilds?"},{"name":"MERAPAMERA","text":"Thank you! ...Oh, and when you've finished them, I'd appreciate it if you could deliver the weapons to the relevant guildmasters. Godsspeed!"},{"name":"YWAIN","text":"Well met, adventurer. You do not seem to be here for training..."},{"name":"YWAIN","text":"Ah, the feathered harpoon! My thanks for the delivery."},{"name":"YWAIN","text":"Had we not received it in time, I was considering using a fisherman's harpoon instead."},{"name":"YWAIN","text":"You seem surprised. I take it you are not aware that the harpoons we use in battle were born of the humble fisherman's tool?"},{"name":"YWAIN","text":"Aye, when Hyuran fishers migrated inland from the coasts, they adapted the tools of their trade for use in the hunting of game."},{"name":"YWAIN","text":"The resulting harpoon proved a fearsome weapon indeed, and so the lancers of old took it for their own. Hard to believe, is it not?"},{"name":"YWAIN","text":"I must say, this harpoon is a particularly impressive piece of craftsmanship. My compliments to the carpenter."},{"name":"LUCIANE","text":"Welcome, adventurer. To what do we owe the pleasure?"},{"name":"LUCIANE","text":"Is this the ash shortbow we ordered? Thank you for delivering it."},{"name":"LUCIANE","text":"One of our Miqo'te recruits has been struggling, lest you wonder. Talented though she is, the longbow we furnished her with does not suit a Miqo'te's shorter arms and slighter frame."},{"name":"LUCIANE","text":"But I daresay this shortbow─with its lighter draw weight and more modest span─should help her reach her true potential."},{"name":"LUCIANE","text":"Indeed, shortbows not unlike this were favored by her ancestors. And some things never change."},{"name":"LUCIANE","text":"It is clear to me that a great deal of care went into this shortbow's construction. I will see that our recruit spares no effort in making the most of this boon."},{"name":"BEATINE","text":"How kind of you to assist Mera Pamera with the orders. The guildmasters spoke highly of <span class=\"emphasis\">your</span> craftsmanship as well. This is very good."},{"name":"BEATINE","text":"Do not attempt to mislead me. I know full well it was your work. Needless to say, it was necessary to punish the Lalafell. Ah...I seem to spend more time sawing apprentices than wood of late."},{"name":"BEATINE","text":"...I jest, of course. A saw is wasted on an apprentice. The stink of blood lingers, making it hard to focus on work. This, I <span class=\"emphasis\">know</span>."},{"name":"BEATINE","text":"I will admit, I was not ignorant of Mera Pamera's situation."},{"name":"BEATINE","text":"In fact, I recognized an opportunity to test your character."},{"name":"BEATINE","text":"You aided your fellow carpenter with no prospect of reward, delivering finely crafted goods when merely serviceable ones would have sufficed. And you claimed no credit."},{"name":"BEATINE","text":"I am proud of you, <span class=\"highlight\">Forename</span>. There is no doubt in my mind that your talents will serve the nation of Gridania well, and save many lives."},{"name":"BEATINE","text":"Just as they will bring about many deaths. This is the responsibility of all who make weapons."},{"name":"BEATINE","text":"But a choice between the deaths of our people and the deaths of our enemies is no choice at all."},{"name":"BEATINE","text":"You have passed the third and final test. Congratulations, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"By your actions you have demonstrated your understanding of what it means to know the wood, be the wood, and to love the wood."},{"name":"BEATINE","text":"You possess the knowledge, skill, and compassion necessary to master carpentry."},{"name":"BEATINE","text":"By overcoming these trials, you have proven that you are no longer a novice. The sapling is well on its way to becoming a tree."},{"name":"BEATINE","text":"You are now a true carpenter of the Oak Atrium."},{"name":"BEATINE","text":"Know, though, that however refined your skills may be, there will always be more to learn. Represent us well on your travels, <span class=\"highlight\">Forename</span>, and return to us often. You shall always be welcome."}],"reward":{"gil":382,"items":[{"id":2330},{"id":3019,"one":1},{"id":3779,"one":1},{"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":9}],"quests":[65676]},"next":[65678]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000149","obj":{"i":1000149,"n":"Mera Pamera","l":52,"q":1}},{"type":"npc","id":"1000200","obj":{"i":1000200,"n":"Luciane","l":52,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"item","id":"2330","obj":{"i":2330,"n":"Recruit's Claw Hammer","l":17,"c":35051,"t":13}},{"type":"item","id":"3019","obj":{"i":3019,"n":"Hempen Doublet Vest of Crafting","l":12,"c":42116,"t":35,"p":436}},{"type":"item","id":"3779","obj":{"i":3779,"n":"Ash Pattens","l":15,"c":46123,"t":38,"p":432}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"1823","obj":{"i":1823,"n":"Feathered Harpoon","l":12,"c":31811,"t":5,"p":528}},{"type":"item","id":"1895","obj":{"i":1895,"n":"Ash Shortbow","l":15,"c":32202,"t":4,"p":708}},{"type":"quest","id":"65676","obj":{"i":65676,"n":"Supplies for the Sick","g":136,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65678","obj":{"i":65678,"n":"The Lance's Lesson","g":136,"l":"Gridania","s":200,"f":1}}]}