{"quest":{"name":"Working Hells for Leather","location":"Gridania","id":65672,"patch":2.0,"sort":150,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000681,"genre":140,"usedItems":[3772,4308],"journal":["Guildmaster Geva requires your assistance due to an unanticipated setback.","You have been instructed to make a pair of hard leather caligae and a hard leather choker in place of a fellow guild member who has run away. Craft the two items and present them to Geva for inspection.","Despite your best efforts, your caligae and choker are not quite up to Fen–Yll standards. Geva must make additional adjustments, which means the delivery will be delayed. Geva asks that you /kneel in apology before the customer, a gentleman by the name of Sosobati, who awaits in the reception area.","Much to your relief, Sosobati turns out to be an understanding fellow. He believes that Geva favors you highly, even if her words may not always make this wholly apparent. Taking the episode's lessons to heart, you continue to apply yourself to mastering your craft.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 20."],"objectives":["Deliver a pair of hard leather caligae and a hard leather choker to Geva.","/kneel before Sosobati and apologize."],"dialogue":[{"name":"GEVA","text":"Ah, <span class=\"highlight\">Forename</span>. You couldn't have come at a better time. We urgently need someone to craft a pair of hard leather caligae and a hard leather choker. Do you think you could handle both?"},{"name":"GEVA","text":"To explain the situation, I had entrusted the commission to another leatherworker, but found the quality of his work so wholly <span class=\"emphasis\">unacceptable</span> that I had no choice but to demand that he start again. Naturally, I gave the fellow a sound dressing-down, reminding him that he had dishonored the name of Fen–Yll and so on, only for him to run off, <span class=\"emphasis\">bawling</span>, leaving a trail of snot and tears in his wake!"},{"name":"GEVA","text":"Needless to say, I was more than a little concerned─after all, there was a very real possibility that I was going to have to keep a customer waiting. But thanks to your timely arrival, everything will be put to rights."},{"name":"GEVA","text":"As I've already mentioned, I need you to craft the two articles in your overly sensitive colleague's stead."},{"name":"GEVA","text":"This will be your first task undertaken for Fen–Yll Fineries."},{"name":"GEVA","text":"This is an opportunity few leatherworkers receive. See that you don't squander it."},{"name":"GEVA","text":"...What is it? Troubled by the crushing weight of expectation?"},{"name":"GEVA","text":"Well, you may cast your fears aside. You've done yourself credit thus far, carrying out my instructions with nary a complaint and taking all my criticism on the chin. I know that you won't shame us."},{"name":"GEVA","text":"And even should the worst come to the worst, I know you'll have the good grace to go before the customer and apologize in person."},{"name":"GEVA","text":"But enough talk. You had best get started if you're to complete the order on time."},{"name":"GEVA","text":"The two pieces are ready, you say? Hm! <span class=\"emphasis\">That</span> remains to be seen."},{"name":"GEVA","text":"Hmmm..."},{"name":"GEVA","text":"The leather used is well made, and the articles look as they should."},{"name":"GEVA","text":"The construction is solid. Good."},{"name":"GEVA","text":"As you know, this type of leather is valued for its toughness and durability. Yet these same qualities make it troublesome to work."},{"name":"GEVA","text":"An inexperienced leatherworker often ruins the material with shoddy stitching and poor molding, resulting in a final product that is misshapen, brittle, and liable to fall apart."},{"name":"GEVA","text":"Your caligae and choker, however, bear none of the hallmarks of amateurism. Your construction is solid, and your leather has retained its strength."},{"name":"GEVA","text":"You have grown considerably as a leatherworker, <span class=\"highlight\">Forename</span>─your latest creations attest to this."},{"name":"GEVA","text":"...But you still have some way to go. The clasps aren't securely fastened, and the stitching needs to be tighter. In short, you must learn to pay more attention to the details."},{"name":"GEVA","text":"These articles aren't quite fit to be placed into the customer's hands, but they <span class=\"emphasis\">can</span> be salvaged. You have done your part well enough─I will see to the rest."},{"name":"GEVA","text":"In the meantime, I would have you attend to something else. It is an important duty, and one that is all too often overlooked by artisans. Namely, taking responsibility for falling short of expectations."},{"name":"GEVA","text":"In the guild's reception area you will find an Ul'dahn gentleman named Sosobati, one of our regular customers. It is he who placed the order for the caligae and choker. I would have you go to him and <span class=\"highlight\">kneel</span> in apology for the delay."},{"name":"SOSOBATI","text":"My son's nameday is fast approaching, so I thought I would gift him the finest protectives money can buy─and none are finer in all the realm than Fen–Yll!"},{"name":"SOSOBATI","text":"Huh? Wh-What in the name of the Twelve are you doing!? Do get up!"},{"name":"SOSOBATI","text":"What's that? My order is delayed, you say? Is <span class=\"emphasis\">that</span> all? Hah hah hah! And there I was thinking something terrible had happened!"},{"name":"SOSOBATI","text":"It's quite all right, truly. I came here precisely <span class=\"emphasis\">because</span> the Leatherworkers' Guild has never compromised on quality. This trifling delay only confirms to me that the principle still endures. Anyway, it is very kind of you to bring me word."},{"name":"SOSOBATI","text":"By the by, your face isn't familiar to me. Are you new to the guild?"},{"name":"SOSOBATI","text":"...So Geva herself is applying the finishing touches to your handiwork even as we speak! Well!"},{"name":"SOSOBATI","text":"I daresay the guildmaster sees promise in you. Why else would she consider your work worthy of her personal attention? She is famous for having cut up far more experienced leatherworkers' efforts for scraps─and that before their very eyes!"},{"name":"SOSOBATI","text":"As for encouraging you to come and apologize... Some may think that Geva goes too far, but it is simply her way of educating her own on the finer points of business. As a native of Ul'dah, I may say with some confidence that it is an education worth enduring."},{"name":"SOSOBATI","text":"Well, it has been a pleasure to meet a rising star of the Leatherworkers' Guild. And that is no hollow flattery I speak."},{"name":"SOSOBATI","text":"Your name is <span class=\"highlight\">Forename Surname</span>, yes? I shall observe your career here with great interest. In fact, the next time I place an order at Fen–Yll Fineries, I shall make a point of insisting that you are given the job!"}],"reward":{"gil":382,"items":[{"id":2432},{"id":3019,"one":1},{"id":3779,"one":1},{"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":13}],"quests":[65671]},"next":[65673]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000681","obj":{"i":1000681,"n":"Sosobati","l":53,"q":1}},{"type":"item","id":"2432","obj":{"i":2432,"n":"Recruit's Awl","l":16,"c":35451,"t":21}},{"type":"item","id":"3019","obj":{"i":3019,"n":"Hempen Doublet Vest of Crafting","l":12,"c":42116,"t":35,"p":436}},{"type":"item","id":"3779","obj":{"i":3779,"n":"Ash Pattens","l":15,"c":46123,"t":38,"p":432}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"3772","obj":{"i":3772,"n":"Hard Leather Caligae","l":12,"c":49811,"t":38,"p":430}},{"type":"item","id":"4308","obj":{"i":4308,"n":"Hard Leather Choker","l":15,"c":54840,"t":40,"p":294}},{"type":"quest","id":"65671","obj":{"i":65671,"n":"Geva's Gambit","g":140,"l":"Gridania","s":100,"f":1}},{"type":"quest","id":"65673","obj":{"i":65673,"n":"Aldgoat Everything","g":140,"l":"Gridania","s":200,"f":1}}]}