{"quest":{"name":"Training with Leih","location":"Gridania","id":65670,"patch":2.0,"sort":100,"icon":100048,"unlocksFunction":1,"eventIcon":71341,"issuer":1000200,"target":1000200,"involved":[1000199],"genre":131,"journal":["Guildmaster Luciane wishes you to learn how to see things from different perspectives.","Satisfied with your progress, Luciane places you under the charge of Leih Aliapoh for your next lesson. Speak with your fellow archer to learn what is required of you.","Leih Aliapoh impresses upon you the importance of minding your surroundings while searching for your target. In order to put theory into practice, seek out and destroy the targets hidden in the Central Shroud whilst simultaneously avoiding contact with the many hostile creatures that reside there. As before, your Heavy Shot technique will make short work of the objects you seek.","You have successfully destroyed all of the targets. Report back to Leih Aliapoh at the Archers' Guild.","Now that you have grasped the basic principle, Leih Aliapoh bids you hone your skills through combat. Journey to the Honey Yard in the East Shroud and slay eight northern vultures and eight tree slugs.","You have succeeded in slaying the specified creatures. Report back to Leih Aliapoh at the Archers' Guild.","Leih Aliapoh enlightens you as to the origins of archery. Apparently, the art was conceived by her ancestors, the Keepers of the Moon, who lived as hunters in former times. Her lesson concluded, it is time to return to Luciane, who will doubtless be eager to learn of your progress.","As before, Silvairre makes no effort to hide his contempt for you. Yet in spite of this─or perhaps because of it─Luciane declares her intent to place you under his charge for your next lesson. So forewarned, you resume your training with greater purpose.<br><br>※The next archer quest will be available from Luciane upon reaching level 15."],"objectives":["Speak with Leih Aliapoh.","Destroy the targets.","Report to Leih Aliapoh.","Slay tree slugs.","Slay northern vultures.","Report to Leih Aliapoh.","Speak with Luciane."],"dialogue":[{"name":"LUCIANE","text":"It pleases me to see how you have grown as an archer. Plainly, you have taken my counsel to heart and learned to see with your own eyes."},{"name":"LUCIANE","text":"I would now have you discover what it means to behold things from a different standpoint."},{"name":"LUCIANE","text":"You will recall Leih Aliapoh, your senior in the guild. I have given you over to her care for this lesson. Speak with her and do as she bids."},{"name":"LEIHALIAPOH","text":"I've been expecting you, <span class=\"highlight\">Forename</span>. Shall we get on with it, then?"},{"name":"LEIHALIAPOH","text":"First, a quick review. Remember how the bowmaster had you seek out and destroy targets hidden throughout the city?"},{"name":"LEIHALIAPOH","text":"Well, I would have you do the same. This time, however, you will need to venture outside the gates."},{"name":"LEIHALIAPOH","text":"I'm sure you've realized this by now, but there is no guarantee of safety within the Twelveswood. As you search, you should take care to mind your surroundings."},{"name":"LEIHALIAPOH","text":"You won't have the luxury of focusing solely on your quarry this time─you'll have to keep your eyes peeled for potential threats as well."},{"name":"LEIHALIAPOH","text":"That said, your objective is to destroy the targets alone, so avoid unnecessary combat and maintain a safe distance from any hostile creatures you encounter. Should you come under attack, take to your heels, risking direct confrontation only if you can't outrun your pursuers."},{"name":"LEIHALIAPOH","text":"The targets are hidden in the Central Shroud. As before, use the Heavy Shot technique to destroy each one with a single arrow. Go well, <span class=\"highlight\">Forename</span>."},{"name":"LEIHALIAPOH","text":"Well, well! You made short work of those targets, I must say. It seems you've learned to seek your prey without being preyed upon."},{"name":"LEIHALIAPOH","text":"Let's continue then. I've a mind to give you more practical experience, and we received a request just recently which I think will provide the perfect opportunity..."},{"name":"LEIHALIAPOH","text":"It seems tree slugs and vultures have been congregating in ever-increasing numbers in the vicinity of the Honey Yard, causing no end of trouble for the locals. We have been tasked with culling the beasts."},{"name":"LEIHALIAPOH","text":"This request comes direct from Stillglade Fane. When the Wood Wailers and the Gods' Quiver cannot spare the forces to attend to such matters, the conjurers often turn to us for help. And before you ask, there's good reason why they would rather not see to this particular task themselves."},{"name":"LEIHALIAPOH","text":"The creatures in question possess abilities which can cause problems for the magically inclined. But that's quite enough about conjurers' troubles! Luciane taught you how to discern an enemy's key traits, did she not? Well, now you'll need to do so while maintaining situational awareness, lest you be overrun."},{"name":"LEIHALIAPOH","text":"Consider this a comprehensive review of her lessons and mine own. Your orders are as follows: head out into the East Shroud, and there put down eight tree slugs and eight vultures, using all of the skills you have acquired thus far. Good hunting, <span class=\"highlight\">Forename</span>."},{"name":"LEIHALIAPOH","text":"Judging by your smug expression, I'd say you've acquired a feel for maneuvering to exploit enemy weaknesses whilst covering your own."},{"name":"LEIHALIAPOH","text":"Vultures are wont to keep their opponents at wing's length, and their attacks will send you flying. The solution to this is simple: maneuver to the rear."},{"name":"LEIHALIAPOH","text":"Tree slugs, on the other hand, have an annoying knack of disrupting spellcasting with their secretions. As such, you would do well to keep the creatures away from any mages in your party."},{"name":"LEIHALIAPOH","text":"Needless to say, good positioning is the key to success in battle─which is why it is absolutely essential that you know your target's traits."},{"name":"LEIHALIAPOH","text":"The knowing of these traits is a fundamental part of hunting. Before the Keepers of the Moon conceived of archery, they dwelt not in the city, but the forest. For my people, hunting was a way of life."},{"name":"LEIHALIAPOH","text":"Hmmm... In hindsight, I suppose this was more a lesson on hunting than on archery. Still, Luciane knows well my past─mayhap that was her intent."},{"name":"LEIHALIAPOH","text":"Hunting, too, is an art. Before I came to Gridania, I never gave it much thought. But the more I think of home, the more I begin to realize..."},{"name":"LEIHALIAPOH","text":"Ahem! Forgive me. I'm not given to fits of sentiment. Truly. Forget I said anything."},{"name":"LEIHALIAPOH","text":"But do not forget that a hunter must recognize <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> prey's weakness and strike swiftly when the opportunity presents itself."},{"name":"LEIHALIAPOH","text":"That concludes the lesson. Now, I suggest you pay Luciane a visit─she is doubtless eager to hear from you."},{"name":"LUCIANE","text":"It is good to see you, <span class=\"highlight\">Forename</span>. I hope you have learned much from Leih."},{"name":"SILVAIRRE","text":"You, adventurer! Is it true? Are you the one who slew the tree slugs and vultures?"},{"name":"Q1","text":"Acknowledge that you slew the creatures?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"SILVAIRRE","text":"Do not take me for a fool. You cannot conceal the truth from this archer's eye."},{"name":"SILVAIRRE","text":"How <span class=\"emphasis\">dare</span> she entrust the security of our people to the hands of a stranger! I knew Miqo'te were reckless, but she is downright irresponsible! Shame on her!"},{"name":"SILVAIRRE","text":"Did I not warn you that it was folly to suffer that woman's presence in our guild, Luciane? Every time she wastes an arrow on game, she drags our noble art back into the darkness."},{"name":"SILVAIRRE","text":"Aye, and this <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>, too. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is an embarrassment to us all!"},{"name":"LUCIANE","text":"That is quite enough, Silvairre."},{"name":"LUCIANE","text":"Your skill with the bow is undeniable, as is your love for our nation. Yet there is much and more you have yet to learn about archery."},{"name":"LUCIANE","text":"<span class=\"highlight\">Forename</span> has matured greatly in the short time that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has been with us. You know this to be true."},{"name":"SILVAIRRE","text":"..."},{"name":"LUCIANE","text":"I suggest you come to terms with <span class=\"highlight\">Forename</span>'s presence here─you will be giving <span class=\"alternative-container\"><span class=\"alternative\">her her</span><span class=\"alternative\">him his</span></span> next lesson, after all. Unless of course you have any <span class=\"emphasis\">objections</span>? Good."},{"name":"LUCIANE","text":"As for you, <span class=\"highlight\">Forename</span>─I would have you devote yourself wholly to training ahead of your lesson with Silvairre. Suffice it to say, he will not be an easy instructor to impress."},{"name":"SILVAIRRE","text":"On <span class=\"emphasis\">that</span> we can agree."},{"name":"TALK","text":"ダミーテキスト（仮）"}],"reward":{"items":[{"id":1893},{"id":3016,"one":1},{"id":2662,"one":1},{"id":3539,"one":1},{"id":3772,"one":1},{"num":2,"id":5824,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":6}],"questsType":"all","quests":[65582,65667]},"next":[65604]},"partials":[{"type":"npc","id":"1000200","obj":{"i":1000200,"n":"Luciane","l":52,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000199","obj":{"i":1000199,"n":"Leih Aliapoh","l":52,"q":3}},{"type":"item","id":"1893","obj":{"i":1893,"n":"Plumed Maple Shortbow","l":10,"c":32203,"t":4,"p":424}},{"type":"item","id":"3016","obj":{"i":3016,"n":"Leather Jacket","l":10,"c":43026,"t":35,"p":351}},{"type":"item","id":"2662","obj":{"i":2662,"n":"Bronze Sallet","l":10,"c":40020,"t":34,"p":283}},{"type":"item","id":"3539","obj":{"i":3539,"n":"Hempen Bracers","l":11,"c":44042,"t":37,"p":280}},{"type":"item","id":"3772","obj":{"i":3772,"n":"Hard Leather Caligae","l":12,"c":49811,"t":38,"p":430}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65582","obj":{"i":65582,"n":"A Matter of Perspective","g":131,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65667","obj":{"i":65667,"n":"Way of the Archer","g":131,"l":"Gridania","s":10,"f":1}},{"type":"quest","id":"65604","obj":{"i":65604,"n":"Violators Will Be Shot","g":131,"l":"Gridania","s":150,"f":1}}]}