{"quest":{"name":"Supplies for the Sick","location":"Gridania","id":65676,"patch":2.0,"sort":100,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"genre":136,"usedItems":[5364],"journal":["Timbermaster Beatin is looking for someone to deliver ash lumber.","Before you can undertake your final trial, Timbermaster Beatin asks you to help replenish the guild's stock of ash lumber. Deliver twelve lengths to him at the Oak Atrium.","Grateful for your delivery, Timbermaster Beatin explains that versatility is the secret of ash lumber's enduring popularity. While he still considers you unready for the final trial, he grants you leave to practice your craft independently, and directs you to Gontrant at the Carline Canopy for additional work.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 15."],"objectives":["Deliver lengths of ash lumber to Beatin."],"dialogue":[{"name":"BEATINE","text":"I see by the wearing of your sawblade that you have not neglected your carpentry since last we spoke. Very good."},{"name":"BEATINE","text":"You will soon be ready for your third and final test. In the meantime, the guild has need of your services."},{"name":"BEATINE","text":"You are familiar with ash wood? Ah, but of course you are."},{"name":"BEATINE","text":"I bid you craft me ash lumber. A simple task, you say?"},{"name":"BEATINE","text":"Then you shan't have trouble crafting me twelve lengths."},{"name":"BEATINE","text":"This is no jest. We used our last few mere moments ago."},{"name":"BEATINE","text":"So you see, this assignment is motivated purely by practical concerns."},{"name":"BEATINE","text":"I would ordinarily handle such a trifling task myself, of course, but I am feeling unwell─and I do believe you would benefit from the practice."},{"name":"BEATINE","text":"Now go, and do not disappoint me."},{"name":"BEATINE","text":"Ah, have you brought the ash lumber?"},{"name":"BEATINE","text":"Such a prodigious quantity!"},{"name":"BEATINE","text":"Thank you, child. You have done your guild a great service."},{"name":"BEATINE","text":"Ash lumber is renowned for its unparalleled flexibility. This quality makes it ideal for use in bows and myriad other weapons."},{"name":"BEATINE","text":"By the same token, ash lumber is easily worked and thus ideal for learning the basics of our craft."},{"name":"BEATINE","text":"Such a versatile material is understandably popular, and so we always have need of more."},{"name":"BEATINE","text":"It may─nnngh─also interest you to know that ash possesses certain medicinal properties. Tea brewed from its bark eases various complaints."},{"name":"BEATINE","text":"Complaints such as that with which I am presently afflicted. Suffice to say, I am pleased to see that your lumber is dusted with a sufficiency of bark fragments! But let us return to the subject of carpentry."},{"name":"BEATINE","text":"You have proven yourself more than capable of working without my guidance."},{"name":"BEATINE","text":"If you wish to market your crafts to others, speak with Gontrant in the Carline Canopy. He has an abundance of guildleves waiting to be fulfilled."},{"name":"BEATINE","text":"Continue to─ahem, refine...your skills, and return to me when you are ready to take the next step."}],"reward":{"gil":289,"items":[{"num":250,"id":4},{"num":200,"id":3},{"id":2315},{"id":2660,"one":1},{"id":3014,"one":1},{"id":3536,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":9}],"quests":[65675]},"next":[65677]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"item","id":"2315","obj":{"i":2315,"n":"Bronze Saw","l":8,"c":35002,"t":12,"p":274}},{"type":"item","id":"2660","obj":{"i":2660,"n":"Amateur's Headgear","l":10,"c":40420,"t":34,"p":283}},{"type":"item","id":"3014","obj":{"i":3014,"n":"Amateur's Kurta","l":9,"c":42233,"t":35,"p":246}},{"type":"item","id":"3536","obj":{"i":3536,"n":"Amateur's Smithing Gloves","l":10,"c":44071,"t":37,"p":252}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5364","obj":{"i":5364,"n":"Ash Lumber","l":10,"c":22458,"t":50,"p":43}},{"type":"quest","id":"65675","obj":{"i":65675,"n":"To Be the Wood","g":136,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65677","obj":{"i":65677,"n":"A Carpenter in Need","g":136,"l":"Gridania","s":150,"f":1}}]}