{"quest":{"name":"The Lance's Lesson","location":"Gridania","id":65678,"patch":2.0,"sort":200,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"genre":136,"usedItems":[1827],"journal":["Timbermaster Beatin has a request for a well-traveled carpenter.","Beatin is curious to know how your carpentry skills are coming along, and bids you bring him a single materia-enhanced iron lance so that he may evaluate your progress. He also mentions that, should your knowledge of materia be lacking, a goblin somewhere in central Thanalan can teach you more. Craft the lance to the best of your ability and deliver it to him.","Reflecting on the moment you first joined the guild, Beatin explains the importance of perseverance. Like the Ishgardian knights with their lances, he implores you to remain resolute in the face of adversity.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 25."],"objectives":["Deliver a materia-enhanced iron lance to Beatin."],"dialogue":[{"name":"BEATINE","text":"Ah, <span class=\"highlight\">Forename</span>. My thoughts have turned to you lately."},{"name":"BEATINE","text":"I trust you have honed your skills further since last we met? In that case, I have a request."},{"name":"BEATINE","text":"Mayhap you have made iron lances before for your customers. However, you have not made them for <span class=\"emphasis\">me</span>. As you doubtless know, my standards differ from those of others."},{"name":"BEATINE","text":"An iron lance's design is one of elegance and simplicity, and I would see you demonstrate your understanding of those qualities through your work. This I ask of all my charges."},{"name":"BEATINE","text":"The iron lance is a marriage of elm, iron, and leather. As you are doubtless aware, the requisite elm lumber and circles of leather are readily available within the city."},{"name":"BEATINE","text":"Iron ingots, however, are much rarer, as they are forged by the smiths of Limsa Lominsa. Procuring them will prove far more problematic."},{"name":"BEATINE","text":"You must steel yourself for a long and arduous journey, <span class=\"highlight\">Forename</span>. The wilderness is infested with unspeakable horrors, and the roads are watched by bandit hordes."},{"name":"BEATINE","text":"Ah, but I jest. While such arduous, character-building trials may have been possible once upon a time, they are, alas, simply unfeasible now."},{"name":"BEATINE","text":"You need only browse the market boards or enlist the aid of a blacksmithing associate to obtain the iron you require. Oh, and there is but one more thing you must needs do."},{"name":"BEATINE","text":"I would have you attach a single materia to the lance you craft. Any type will suffice."},{"name":"BEATINE","text":"I find it hard to believe that an experienced adventurer like yourself could be unfamiliar with the substance, but on the off chance that you are, I suggest you seek out that goblin fellow in central Thanalan. There is no one more knowledgeable on the subject, or so I have heard."},{"name":"BEATINE","text":"When you are in possession of all the necessary materials, I bid you craft me a single materia-enhanced iron lance."},{"name":"BEATINE","text":"Is your lance ready? I am eager to see what you have wrought."},{"name":"BEATINE","text":"...You do not disappoint, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"Your lance exceeds my expectations."},{"name":"BEATINE","text":"These formidable weapons were originally intended for use by the Ishgardian cavalry, and were designed with the aim of maximizing their bearers' effectiveness on the field of battle."},{"name":"BEATINE","text":"By utilizing the speed of his mount, a lance-wielding knight could easily deliver a devastating blow that would cripple, if not outright kill."},{"name":"BEATINE","text":"But this mode of attack placed significant strain on both the rider and his weapon. Should the latter fail, the knight would be left defenseless."},{"name":"BEATINE","text":"Needless to say, the iron lance proved to be anything <span class=\"emphasis\">but</span> prone to failure, eventually prompting Gridania's Wood Wailers to adopt it as their own."},{"name":"BEATINE","text":"The differences between the modern Gridanian weapon and the Ishgardian original are not so substantial, amounting to little more than a smaller vamplate. Our lancers do not require the same protection as a mounted knight, you see."},{"name":"BEATINE","text":"Fascinating, is it not─the history our weapons carry, how they change and evolve to meet different demands..."},{"name":"BEATINE","text":"Truly, all things possess potential for growth─weapons and armor, forests and cities...and aspiring carpenters."},{"name":"BEATINE","text":"Remember this too, <span class=\"highlight\">Forename</span>..."},{"name":"BEATINE","text":"The iron lance is a marvelous weapon not because it does not bend at the moment of impact, but because it does not break."},{"name":"BEATINE","text":"To bend yet not break; to endure, and persevere, and finally triumph... When I gaze upon this lance, I am reminded of the singular importance of resolve─a quality I saw in you when first you joined us, and that will serve you well in the future."},{"name":"BEATINE","text":"Whatever troubles you may face, remain resolute as an iron lance, and you will succeed."}],"reward":{"gil":470,"items":[{"id":2318},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":9}],"quests":[65677]},"next":[65704]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"item","id":"2318","obj":{"i":2318,"n":"Initiate's Saw","l":19,"c":35004,"t":12,"p":815}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"1827","obj":{"i":1827,"n":"Iron Lance","l":20,"c":31803,"t":5,"p":1296}},{"type":"quest","id":"65677","obj":{"i":65677,"n":"A Carpenter in Need","g":136,"l":"Gridania","s":150,"f":1}},{"type":"quest","id":"65704","obj":{"i":65704,"n":"A Crisis of Confidence","g":136,"l":"Gridania","s":250,"f":1}}]}