{"quest":{"name":"Geva's Gambit","location":"Gridania","id":65671,"patch":2.0,"sort":100,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"genre":140,"usedItems":[5276],"journal":["Guildmaster Geva has a new task for you.","After receiving a large order from Fen–Yll Fineries, the Leatherworkers' Guild has nearly run out of hard leather. Help replenish their stock by delivering a dozen circles of hard leather to Geva, and quickly!","It seems the situation was not as dire as you were led to believe, as your hard leather was only needed to aid initiates in their training. Sensing your disappointment, Geva states that she is satisfied with your progress and that she no longer considers you a beginner. If you continue to show improvement, perhaps Geva will entrust you with more important orders.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 15."],"objectives":["Deliver circles of hard leather to Geva."],"dialogue":[{"name":"GEVA","text":"How are your techniques coming along? If you honestly think you've improved, then I have a new task for you."},{"name":"GEVA","text":"But before that, let me ask: you <span class=\"emphasis\">are</span> familiar with the Fen–Yll brand, are you not?"},{"name":"Q1","text":"Are you familiar with the Fen–Yll brand?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"GEVA","text":"Surely you jest. I could forgive such ignorance if you were a passing adventurer, newly come to Eorzea."},{"name":"GEVA","text":"But to have trained under my roof whilst remaining ignorant of the most coveted brand of leather goods in all the realm... It boggles the mind."},{"name":"GEVA","text":"But of course, how silly of me. Even an adventurer hailing from distant lands should know the most famous brand of leather goods in Eorzea."},{"name":"GEVA","text":"Anyway, all goods sold under the distinguished Fen–Yll name are crafted by none other than our leatherworkers."},{"name":"GEVA","text":"We've been asked to fill an especially large order on short notice, and so our stores of hard leather are nearly depleted."},{"name":"GEVA","text":"I was considering how best to handle this situation when you arrived."},{"name":"GEVA","text":"I'm sure you see where this is going."},{"name":"GEVA","text":"We need a dozen circles of hard leather, as fast as you can make them. Quickly now, go!"},{"name":"GEVA","text":"Please tell me you've brought the hard leather."},{"name":"GEVA","text":"Well, well..."},{"name":"GEVA","text":"These are better than I expected!"},{"name":"GEVA","text":"It is more difficult to boil leather than to tan it, but the process results in a stronger, more durable product."},{"name":"GEVA","text":"These properties make hard leather the material of choice for those who prefer stouter armor."},{"name":"GEVA","text":"The fruits of your labor shall serve the guild well..."},{"name":"GEVA","text":"...as training materials for new initiates."},{"name":"GEVA","text":"Hm? You seem troubled. Surely you did not imagine that your leather would be used in the construction of Fen–Yll goods?"},{"name":"GEVA","text":"Hah hah hah! Oh, <span class=\"emphasis\">gods</span>, no! Only our elite leatherworkers, handpicked by me, are permitted to make wares that bear the Fen–Yll name."},{"name":"GEVA","text":"While we had enough hard leather to complete the Fen–Yll commission, some of the materials used─despite being of excellent quality─were originally intended to be distributed as practice materials. As such, the initiates' supplies ran dangerously low."},{"name":"GEVA","text":"Come now, there is no call to be disheartened. Do you not see that in furnishing the beginners with supplies, you have proven that you are no longer a beginner? You have given them that which they could not make themselves!"},{"name":"GEVA","text":"When you first arrived, I would never have entrusted you with such a task. Make no mistake, you <span class=\"emphasis\">are</span> improving."},{"name":"GEVA","text":"Why, at this rate, my great-great-grandchildren may yet commission you to make a shoe sole─or even two!"},{"name":"GEVA","text":"Speaking of commissions, I think you've proven yourself sufficiently skilled to handle orders without my supervision."},{"name":"GEVA","text":"Go and see Gontrant in the Carline Canopy if you're interested in taking on a few guildleves. You would gain much-needed experience, and earn yourself some coin besides."},{"name":"GEVA","text":"But enough chatter. Come and see me again when you have further refined your technique. Oh, and if you make it during my lifetime, I daresay you'll find me in a more talkative mood."}],"reward":{"gil":289,"items":[{"num":250,"id":5},{"num":200,"id":4},{"id":2417},{"id":2660,"one":1},{"id":3014,"one":1},{"id":3536,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":13}],"quests":[65642]},"next":[65672]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"2417","obj":{"i":2417,"n":"Bronze Head Knife","l":8,"c":35401,"t":20,"p":257}},{"type":"item","id":"2660","obj":{"i":2660,"n":"Amateur's Headgear","l":10,"c":40420,"t":34,"p":283}},{"type":"item","id":"3014","obj":{"i":3014,"n":"Amateur's Kurta","l":9,"c":42233,"t":35,"p":246}},{"type":"item","id":"3536","obj":{"i":3536,"n":"Amateur's Smithing Gloves","l":10,"c":44071,"t":37,"p":252}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5276","obj":{"i":5276,"n":"Hard Leather","l":8,"c":22005,"t":52,"p":31}},{"type":"quest","id":"65642","obj":{"i":65642,"n":"A Test of Technique","g":140,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65672","obj":{"i":65672,"n":"Working Hells for Leather","g":140,"l":"Gridania","s":150,"f":1}}]}