{"quest":{"name":"To Be the Wood","location":"Gridania","id":65675,"patch":2.0,"sort":50,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"genre":136,"usedItems":[2219],"journal":["Timbermaster Beatin wants you to craft three maple shields.","For your second test, Timbermaster Beatin challenges you to demonstrate your skill as a carpenter by crafting three maple shields. Fashion the requested items to the best of your ability and deliver them to him at the Oak Atrium.","Having expressed his satisfaction with your shields, Timbermaster Beatin stresses to you the responsibility that comes with crafting equipment for war, explaining that to embrace this duty is to become one with the wood. He rewards you with an amateur's claw hammer, and bids you return when you are ready to attempt the next test.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 10."],"objectives":["Deliver square maple shields to Beatin."],"dialogue":[{"name":"BEATINE","text":"It is plain from your bearing that you and your saw have begun to move as one, as true partners."},{"name":"BEATINE","text":"Good. You are ready for the second test."},{"name":"BEATINE","text":"You must <span class=\"emphasis\">be</span> the wood."},{"name":"BEATINE","text":"Before, you brought me maple lumber to demonstrate your knowledge of wood. This time you will demonstrate your ability to create with it."},{"name":"BEATINE","text":"I bid you craft me three maple shields. For this you will require maple lumber and bronze rivets."},{"name":"BEATINE","text":"As you would expect, our guild supplier, Ferreol, has no shortage of that which you require. Should you desire a more economical solution, however, you might consider a more traditional method of acquisition."},{"name":"BEATINE","text":"Many materials essential to our craft are harvested by our steadfast allies, the botanists of the Greatloam Growery. Were you to befriend one of their number, you might be able to come to a mutually beneficial arrangement."},{"name":"BEATINE","text":"Or, if you would rather not be beholden to another, you could even try your hand at botany."},{"name":"BEATINE","text":"Now go, and do not disappoint me."},{"name":"BEATINE","text":"What's this? Have you already bent the wood to your will?"},{"name":"BEATINE","text":"You...are no workaday carpenter. That much is plain."},{"name":"BEATINE","text":"Well done, child. Your shields are <span class=\"emphasis\">most</span> satisfactory."},{"name":"BEATINE","text":"The pattern of the grain, the lingering scent of maple... Your choice of materials is excellent, and the construction above criticism. Few carpenters can claim such skill."},{"name":"BEATINE","text":"The Elezen once favored shields of wood, do you know this?"},{"name":"BEATINE","text":"Today, it is not so. They, like your adventurer brethren, are wont to choose the surety of the armorer's metal."},{"name":"BEATINE","text":"But a shield of wood provides ample protection for a lower price. It is readily made and readily replaced if broken."},{"name":"BEATINE","text":"And while not quite so sturdy, it may yet serve to spare a man his doom just as readily as any shield of metal."},{"name":"BEATINE","text":"To imbue shield and spear with your strength, to pour your life into the wood that others might preserve their own..."},{"name":"BEATINE","text":"<span class=\"emphasis\">This</span> is what it means to be the wood."},{"name":"BEATINE","text":"Such responsibility is not to be taken lightly, child."},{"name":"BEATINE","text":"You have passed the second test, and in so doing have earned this amateur's claw hammer."},{"name":"BEATINE","text":"Though a saw will suffice for many tasks, a carpenter who wields blade and hammer both can perform his trade with greater ease."},{"name":"BEATINE","text":"If you wish to improve as a carpenter, it is essential that you learn to use the two tools in combination."},{"name":"BEATINE","text":"Continue to refine your skills, and return to me when you are ready to take the next step."},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">craftsmanship</span>, <span class=\"highlight\">control</span>, and <span class=\"highlight\">CP</span> values."},{"name":"SYSTEM","text":"A higher craftsmanship rating hastens the progress of synthesis; greater control increases the chance of creating high-quality items; and additional CP improves your crafting stamina."},{"name":"SYSTEM","text":"Outfitting yourself with an eye to your current objective will increase the efficiency of your crafting endeavors."}],"reward":{"gil":194,"items":[{"num":200,"id":4},{"num":150,"id":3},{"id":2328},{"id":2652,"one":1},{"id":3309,"one":1},{"id":3763,"one":1},{"num":3,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":9}],"quests":[65741]},"next":[65676]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"item","id":"2328","obj":{"i":2328,"n":"Amateur's Claw Hammer","l":5,"c":35051,"t":13,"p":136}},{"type":"item","id":"2652","obj":{"i":2652,"n":"Hempen Bandana","l":5,"c":41540,"t":34,"p":85}},{"type":"item","id":"3309","obj":{"i":3309,"n":"Hempen Chausses","l":5,"c":45048,"t":36,"p":94}},{"type":"item","id":"3763","obj":{"i":3763,"n":"Maple Pattens","l":5,"c":46122,"t":38,"p":129}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"2219","obj":{"i":2219,"n":"Square Maple Shield","l":1,"c":30017,"t":11,"p":72}},{"type":"quest","id":"65741","obj":{"i":65741,"n":"My First Saw","g":136,"l":"Gridania","s":11,"f":1}},{"type":"quest","id":"65676","obj":{"i":65676,"n":"Supplies for the Sick","g":136,"l":"Gridania","s":100,"f":1}}]}