{"quest":{"name":"Trial by Wind","location":"Gridania","id":65683,"patch":2.0,"sort":100,"icon":100051,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1000692,"involved":[1000767],"genre":133,"journal":["Brother E–Sumi–Yan wants you to learn about the element of wind.","Desirous that you should learn about the element of wind, Brother E–Sumi–Yan bids you travel to Fullflower Comb in the East Shroud and attend to the teachings of Hearer Wulfiue.","Hearer Wulfiue has instructed you to exterminate a swarm of honeybees. Though the task's relevance is not immediately apparent, you have little alternative but to do as you are told. Head to the east of Sweetbloom Pier and investigate the spring.","You have defeated the bees at the spring. Return to Hearer Wulfiue.","Wulfiue explains that the bees' presence was the result of a disturbance in the wind's natural currents. Return to the spring near Sweetbloom Pier, locate the source of the disturbance, and cleanse it with conjury.","You have dispersed the pocket of corrupted air. Return to Fullflower Comb and report to Wulfiue.","Wulfiue has imparted her knowledge of the element of wind to you. Return to Stillglade Fane and inform Brother E–Sumi–Yan of your progress.","Back at the Conjurers' Guild, Brother E–Sumi–Yan expresses his pleasure at the fact that you have learned to hear the voice of the wind. Once again, however, your studies are interrupted by the young conjurer, Sylphie. As ever, she has no desire to deepen her understanding of nature, and refuses to heed his counsel. You, by contrast, take the Padjal's words to heart, and with the power of earth and wind at your command, continue your quest to master conjury.<br><br>※The next conjurer quest will be available from E–Sumi–Yan upon reaching level 15."],"objectives":["Speak with Wulfiue at Fullflower Comb.","Investigate the spring near Sweetbloom Pier.","Speak with Wulfiue at Fullflower Comb.","Investigate the pocket of corrupted air.","Report to Wulfiue at Fullflower Comb.","Report to Brother E–Sumi–Yan at Stillglade Fane."],"dialogue":[{"name":"ESUMIYAN","text":"Greetings, <span class=\"highlight\">Forename</span>. Each time we meet, the part of conjurer befits you ever better."},{"name":"ESUMIYAN","text":"In your previous lesson, you learned about the element of earth. It is my desire that you next become acquainted with the wind."},{"name":"ESUMIYAN","text":"Travel to Fullflower Comb in the East Shroud, and seek the teachings of Hearer Wulfiue."},{"name":"ESUMIYAN","text":"Though scant few years have passed since her coming of age, Wulfiue is a conjurer of consummate skill who is able to divine the will of air elementals with uncommon clarity. I can recommend no better tutor for your lessons in the mysteries of wind."},{"name":"WULFIUE","text":"You must be <span class=\"highlight\">Forename</span>. Brother E–Sumi–Yan sent word to expect you."},{"name":"WULFIUE","text":"It shall be my pleasure to instruct you on the patterns of gusts and gales."},{"name":"WULFIUE","text":"Now...how to proceed? Pray forgive my hesitation. It was but recently that I attained the title of Hearer and, well...you are my first student."},{"name":"WULFIUE","text":"Hmmm... Ah, yes, I believe I have a suitable task for you. To the east of Sweetbloom Pier, there is a small spring, giving rise to a pool. Go there and clear the air of the honeybee swarm which lately took up residence in the area."},{"name":"WULFIUE","text":"...You seem uncertain. Mayhap you wonder at the connection between my request and the subject of your study? I sympathize, <span class=\"highlight\">Forename</span>. But trust me, inexperienced though I may seem, this deed <span class=\"emphasis\">will</span> deepen your understanding of wind."},{"name":"WULFIUE","text":"Welcome back. I take it the bees are no more?"},{"name":"WULFIUE","text":"Tell me, did you happen to notice many of the vilekin's preferred flowers in the vicinity of the spring? I ask because there were none. Strange then, is it not, that the bees should choose to congregate there..."},{"name":"WULFIUE","text":"And what has caused this aberrant behavior? Still your mind and reach out with your senses. Can you feel it? The path of the wind veers from its natural course, sweeping hapless creatures along in its wake."},{"name":"WULFIUE","text":"Something is playing havoc with the air currents. Such a disturbance bespeaks corruption."},{"name":"WULFIUE","text":"Return to the spring near Sweetbloom Pier and search for pockets of corrupted air. Should you find one, use your powers of conjury to disperse it."},{"name":"WULFIUE","text":"I must apologize for exposing you to such danger─the corruption was greater than I anticipated. But it is through such trials that we flourish as conjurers."},{"name":"WULFIUE","text":"Now then, <span class=\"highlight\">Forename</span>─what did you learn as you struggled within the air's grasp? You will doubtless have noticed that wind does not strike with the instant, crushing force of earth."},{"name":"WULFIUE","text":"Instead, it torments one's form, dancing across every surface and leaving a thousand tiny wounds in its wake."},{"name":"WULFIUE","text":"These are the agonies of erosion. Having experienced such pain, you are now intimately acquainted with wind's capacity for patient destruction."},{"name":"WULFIUE","text":"No land is a stranger to its power. When you stand under distant skies and feel the wind's familiar caress upon your skin, remember the lessons you have learned here this day."},{"name":"WULFIUE","text":"Hmmm... I suppose I should be grateful that this latest elemental disturbance manifested itself at such an opportune time─only the gods know what I would have taught you had it not! Yet the growing frequency of such phenomena begins to concern me..."},{"name":"WULFIUE","text":"While it is true that the Calamity wrought much harm upon the Twelveswood, I suspect some other force is at work here. I bid you remain wary, <span class=\"highlight\">Forename</span>."},{"name":"WULFIUE","text":"But enough of these ominous rumblings. I regret to say that your time with me is at an end. Return to Stillglade Fane and inform Brother E–Sumi of your newfound mastery.<br>...Oh, and be sure to thank him for sending me such a willing first student!"},{"name":"ESUMIYAN","text":"Welcome back, <span class=\"highlight\">Forename</span>. The elementals inform me that you have opened your ears to the voice of the wind. That is well."},{"name":"ESUMIYAN","text":"Having made allies of two elements, you are well on your way along the path of conjury─though full comprehension of these forces will only come to you in the fullness of time."},{"name":"ESUMIYAN","text":"Be patient. As you seek to embrace nature more fully, so will nature hold you more closely."},{"name":"SYLPHIE","text":"They made you study <span class=\"emphasis\">wind</span>? Why bother?"},{"name":"SYLPHIE","text":"You don't need wind to heal things, whatever those dreary lessons tell you."},{"name":"ESUMIYAN","text":"Conjury is inextricably bound with nature, Sylphie. That “dreary lesson” is one you should have learned by now."},{"name":"ESUMIYAN","text":"I assume by your presence here that you have once again abandoned your tutors?"},{"name":"ESUMIYAN","text":"You <span class=\"emphasis\">must</span> understand: if you persist in casting spells without the proper knowledge─"},{"name":"SYLPHIE","text":"I have all the knowledge I need! My mother never needed to “embrace nature” to heal. And the people she helped were thankful for her art!"},{"name":"SYLPHIE","text":"I'll learn conjury the same way she did, and become just as great a conjurer, you'll see."},{"name":"SYLPHIE","text":"But I didn't come here to argue with you, Brother E–Sumi. I wanted to tell you that I've discovered how to cast Raise!"},{"name":"ESUMIYAN","text":"How─ What were you <span class=\"emphasis\">thinking</span>, girl!?"},{"name":"ESUMIYAN","text":"You know not what you do─what you risk! You are meddling with forces beyond your comprehension! Should you even <span class=\"emphasis\">attempt</span> to use that spell, I will have no recourse but to strip you of the name of “conjurer” and banish you from our halls! <span class=\"emphasis\">Do I make myself clear</span>?"},{"name":"SYLPHIE","text":"Why must you be so angry with me? It's not as if I were trying to hurt anyone!"},{"name":"ESUMIYAN","text":"But that's─ &lt;sigh&gt; Sylphie...my dear child... That is precisely the point."},{"name":"ESUMIYAN","text":"My apologies, <span class=\"highlight\">Forename</span>... I hope you do not find these constant disruptions...distracting."},{"name":"ESUMIYAN","text":"As you have just heard, Sylphie's mother was also a conjurer─a conjurer who was unable to use any spells outside of the sphere of healing. Needless to say, Sylphie seeks to emulate her in every way."},{"name":"ESUMIYAN","text":"It is a rare and wondrous talent to heal without relying on the energies of nature. But such power is not born of true conjury."},{"name":"ESUMIYAN","text":"By all that we know of the art, it should not be possible for Sylphie to cast Raise. I shudder to think what would happen if she tried."},{"name":"ESUMIYAN","text":"I fear my inability to set her upon the true path reflects my own failings as a teacher..."},{"name":"ESUMIYAN","text":"I am only glad that those same failings have not hindered you. Whether it be with my help or in spite of it, I believe that you will become a fine conjurer. Already, you are blessed with great power, and more shall be yours should you persevere with our art─as indeed I hope you shall. Yet however much you grow, however powerful you become, remember that ours is a power <span class=\"emphasis\">borrowed</span>, not taken."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"items":[{"id":1997},{"id":3015,"one":1},{"id":2661,"one":1},{"id":3538,"one":1},{"id":3769,"one":1},{"num":2,"id":5824,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":7}],"questsType":"all","quests":[65584,65669]},"next":[65628]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1000767","obj":{"i":1000767,"n":"Wulfiue","l":55,"q":2}},{"type":"item","id":"1997","obj":{"i":1997,"n":"Maple Crook","l":10,"c":32607,"t":9,"p":446}},{"type":"item","id":"3015","obj":{"i":3015,"n":"Amateur's Dalmatica","l":10,"c":42017,"t":35,"p":280}},{"type":"item","id":"2661","obj":{"i":2661,"n":"Amateur's Hempen Coif","l":10,"c":41527,"t":34,"p":226}},{"type":"item","id":"3538","obj":{"i":3538,"n":"Hempen Dress Gloves","l":11,"c":44159,"t":37,"p":224}},{"type":"item","id":"3769","obj":{"i":3769,"n":"Amateur's Duckbills","l":10,"c":46109,"t":38,"p":230}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65584","obj":{"i":65584,"n":"Trial by Earth","g":133,"l":"Gridania","s":50,"f":1}},{"type":"quest","id":"65669","obj":{"i":65669,"n":"Way of the Conjurer","g":133,"l":"Gridania","s":10,"f":1}},{"type":"quest","id":"65628","obj":{"i":65628,"n":"Trial by Water","g":133,"l":"Gridania","s":150,"f":1}}]}