{"quest":{"name":"Sweet Sorrows","location":"Limsa Lominsa","id":65684,"patch":2.4,"sort":250,"icon":100344,"unlocksFunction":1,"eventIcon":71341,"issuer":1009943,"target":1009943,"involved":[1010198,1010250,1010251,1010252],"genre":132,"journal":["Jacke wishes to discuss the plan for recovering the remaining treasures.","Jacke explains that the remaining treasures are in the possession of the Reformists─an extreme faction of the dreaded Bloody Executioners. The guildmaster then sends you to speak with the ever-moving black marketeer to learn more about these dangerous marks and their plans. Make your way to the House of Sticks in lower La Noscea, and defend yourself against the underworld broker's kobold bodyguards should they seek to impede your approach.","You have defeated the kobold doormen. Speak with the black marketeer at the House of Sticks and pay him with the sack of coin you received from Jacke.","Pleased with the weight of your proffered purse, the black marketeer proceeds to outline the Reformists' plan to sell the Silver Sorrows. Return to Jacke at the Rogues' Guild, and report both the details of the deal and the unexpected presence of Milala's lackey at the House of Sticks.","After making your report to Jacke, the guildmaster prepares to set out for eastern La Noscea with all haste. He is momentarily stunned, however, when the Stray nominates herself for the job and suddenly strides out of the guild alone. Follow Jacke's orders, and track down V'kebbe at Costa del Sol.","You catch up with the Stray and learn the reason behind her unusual behavior. Speak with V'kebbe at Costa del Sol once more, then make your attempt on the Silver Sorrows.","Jacke joins you at the site of the deal, and shares his plan for stealing the earrings. After defeating the guards and threatening the Ul'dahn merchant, however, your prize is snatched away at the last moment by a well-prepared Captain Milala. Commiserate with Jacke at Costa del Sol.","As Jacke laments his failure, he is approached by the Yellowjacket captain, who further taunts the guildmaster with the details of her victory. After a heated exchange, it is clear that neither rogue nor soldier intend to forfeit the challenge. Return to the Rogues' Guild and speak with Jacke.","Putting the loss of the Silver Sorrows behind him, Jacke focuses his gaze on the last remaining treasure─the Black Sarcophagus. He warns that the Reformists are not likely to part with the mysterious object without a significant struggle. Hone your bladework to perfection, and prepare for what promises to be your most challenging job yet...<br><br>※The next rogue quest will be available from Jacke upon reaching level 30."],"objectives":["Defeat the black marketeer's bodyguards at the House of Sticks.","Pay the black marketeer with the sack of coin.","Speak with Jacke at the Rogues' Guild.","Speak with V'kebbe at Costa del Sol.","Speak with V'kebbe and steal the Silver Sorrows.","Speak with Jacke at Costa del Sol.","Speak with Jacke at the Rogues' Guild."],"dialogue":[{"name":"JACKE","text":"Ho there, <span class=\"highlight\">Forename</span>. We've a rough job ahead of us, an' that's a fact."},{"name":"JACKE","text":"Matters are tangled enough what with that Milala mort snappin' at our heels, but we still managed to grabble that first trinket without too much fuss."},{"name":"JACKE","text":"Bitin' back them other two treasures, though, that'll be a different story... Once the Stray gets here, I'll explain what─or more to the point, “who”─we're up against."},{"name":"JACKE","text":"All right. We've two baubles left on the list: the Silver Sorrows, an' the Black Sarcophagus. Let's see where we're at."},{"name":"VKEBBE","text":"Oi, where's Perimu got to?"},{"name":"JACKE","text":"Underfoot? He's still lookin' to whiddle the tale behind that bleedin' sarcophagus. We'll not be cloyin' that stickler until we've at least an inklin' as to what the bloody thing <span class=\"emphasis\">looks</span> like."},{"name":"JACKE","text":"Treasures aside, I've been doin' some diggin' o' me own into these “Executioner” allies of the Grinning Curs. An' I'm afraid the name weren't no coincidence."},{"name":"JACKE","text":"<span class=\"highlight\">Forename</span>, ye've heard o' the Bloody Executioners, I hope? It seems them Curs was feedin' from the famble o' one o' the nation's greatest pirate powers."},{"name":"JACKE","text":"This ain't no ordinary crew o' cutthroats, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─within Limsa Lominsa, the Bloody Executioners wield a power an' influence second only to the Admiral herself."},{"name":"JACKE","text":"They was none too fond o' Merlwyb or her prohibition on piracy, an' it was only the overwhelmin' threat posed by the Garlean Empire what eventually convinced 'em to play nice with the thalassocracy."},{"name":"JACKE","text":"...But pirates ain't ones to play nice for long. Now that Hyllfyr ain't around to helm the ship, the solidarity o' the Bloody Executioners has begun to show cracks."},{"name":"JACKE","text":"All the strongest captains an' lieutenants've begun to form their own factions, an' are scrabblin' to claim the top chair for 'emselves. ...'Course, not one bloody cove can agree with another on which way the Executioners ought to sail."},{"name":"JACKE","text":"Among these new factions, though, is a group what is pushin' to break free o' the Admiral's grip completely. Turns out these “Reformists” as they call 'emselves was the ones as took the Grinnin' Curs under their wing."},{"name":"VKEBBE","text":"...Which means they've got possession o' the last two treasures we've yet to cloy. Rumors 'round town say that, even for Executioners, these coves're bloody an' ruthless an' not to be crossed."},{"name":"VKEBBE","text":"We should sit this one out, Jacke. Piss on Milala's contest─it ain't worth this kind o' grief!"},{"name":"VKEBBE","text":"We'd be invitin' the wrath of a crew so large an' dangerous that even the <span class=\"emphasis\">Admiral</span> ain't keen on comin' to blows with 'em. If they ever came after us..."},{"name":"JACKE","text":"Large or small, it don't much matter─they broke the code when they hit that Maelstrom tub."},{"name":"JACKE","text":"Aye, the Grinnin' Curs are payin' for that crime, but we'd be poor soddin' excuses for rogues if we let the real culprits carry on unpunished. I mean to see this job to the end─an' that means bitin' back them treasures, an' handin' out proper justice to them as deserve it."},{"name":"VKEBBE","text":"But, Jacke─!"},{"name":"JACKE","text":"Listen, with all the infightin' goin' on at present, us stabbin' a shortblade into one faction's toe ain't like to bring the whole Executioner crew down on our heads. Besides, them Reformist buggers are so far split from the main mob that they've been avoidin' the city altogether."},{"name":"JACKE","text":"Now, it's about time we got to work. <span class=\"highlight\">Forename</span>, yer to track down our black market contact. I set him to lookin' into the Curs' new allies a while back, so he should have some answers for us by now."},{"name":"JACKE","text":"Hmmm... The Veil was lifted by a southerly this morn─that'll put the old man at his haunt in lower La Noscea. Here, take this sack o' blunt an' pay a visit to the House o' Sticks."},{"name":"JACKE","text":"That's kobold territory, if ye didn't know. The old man bribes 'em with ore, an' hires the biggest an' meanest sods as bodyguards. Just be ready for yer approach to be...challenged."},{"name":"VKEBBE","text":"I know full soddin' well what it means to be a rogue. But as deadly as our guild is, we'd not survive a war with the bloody Bloody Executioners..."},{"name":"BLACKMERCHANT00146","text":"Welcome to the House of Sticks, young rogue! You must excuse my hirelings' <span class=\"emphasis\">enthusiasm</span> for greeting visitors. Now, have you any cumbersome baggage of which I might relieve you before we begin our conversation in earnest...?"},{"name":"BLACKMERCHANT00146","text":"Gyahahaha! &lt;wheeze&gt; A heavy burden for one of your tender years to bear, but its weight has balanced the scales. The sum is paid, and the deal is made! Let us speak of these Reformists."},{"name":"BLACKMERCHANT00146","text":"This faction that so wronged the code now seeks to peddle one of its stolen treasures: the earrings better known as the Silver Sorrows."},{"name":"BLACKMERCHANT00146","text":"The deal, it is said, is set to take place at Costa del Sol. The buyer? A moneyed merchant from the golden sands of Ul'dah."},{"name":"BLACKMERCHANT00146","text":"The earrings will be out in the open. Vulnerable. I would target the moment of transaction, were I so inclined. ...As the gentleman up there by the cabin appears to be, for he purchased this selfsame information."},{"name":"BLACKMERCHANT00146","text":"Though he attempts to disguise his identity, the stench of a soldier yet lingers. I know not where one such as he came to learn of my existence, but I suspect he works for a certain yellow-coated captain."},{"name":"BLACKMERCHANT00146","text":"Gyahaha! Brave, she is, but foolish! Stumble blindly into the underworld, and your groping hands will not save you from the holes at your feet. Sudden shall be her fall..."},{"name":"BLACKMERCHANT00146","text":"The Reformists will soon divest themselves of the Silver Sorrows. I would not dally if you wish to stay ahead of your rivals!"},{"name":"JACKE","text":"Welcome back, <span class=\"highlight\">Forename</span>. What information did the old man have on them Reformists? ...Lookin' to unload them earrings, are they? An' to an Ul'dahn, no less."},{"name":"JACKE","text":"Can't say as I'm surprised to hear the buyer's from out o' town. Ye won't find many Lominsans willin' to melt coin on aught them coves're sellin'... Only the daftest of sods would go about fundin' them as means to pull down the Admiral."},{"name":"JACKE","text":"...Eh? One o' Milala's lackeys arrived at the House afore ye!? How did they know to─ Bah, them Curs we captured must've cackled durin' the shrew's interrogations."},{"name":"JACKE","text":"We'll have to assume the Yellowjackets know what we know. An' that means we'd best get our arses to Costa del Sol right bleedin' now!"},{"name":"VKEBBE","text":"I'll handle this one, Jacke. You an' <span class=\"highlight\">Forename</span> can wait here for Perimu."},{"name":"JACKE","text":"Oi, V'kebbe! What in the hells is she playin' at? After her, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. She knows this ain't a solo job..."},{"name":"JACKE","text":"Go after the Stray an' lend her a famble, will ye? Ye can board the ferry for Costa del Sol from the docks at Fisherman's Bottom."},{"name":"VKEBBE","text":"I told ye to wait at the guild. I don't need─<br>...Well, it might be as I could use an extra <span class=\"alternative-container\"><span class=\"alternative\">mort</span><span class=\"alternative\">cove</span></span> in the shadows, after all."},{"name":"VKEBBE","text":"Jacke has his mind set on punishin' the Executioners, but me? I just want to skulk in, cloy them silver bits, an' skulk out."},{"name":"VKEBBE","text":"I reckoned that if I could manage that with no one the wiser, then they wouldn't know who to come after. Finish the job without drawin' me daggers, ye know?"},{"name":"VKEBBE","text":"It ain't exactly true to the code, but the shield of underworld honor won't stop them bloody killers from cuttin' me mates' throats an' settin' the Sisters a-glimmer. The guild's the only place what offered to take in a pirate stray like me, an' I'll not see it burned to the ground..."},{"name":"VKEBBE","text":"The deal's about to start. Say the whid when yer bene to head in..."},{"name":"VKEBBE","text":"All right, here's what we know. The rich merchant what's come over from Ul'dah is some old mate o' Master Gegeruju, the cull as owns Costa del Sol."},{"name":"VKEBBE","text":"Gegeruju's taken his guards an' dancin' dells an' pranced off down the beach someplace, givin' over the use o' the entire resort to this friend. Seems she didn't want an audience for her bargain with the Reformists."},{"name":"VKEBBE","text":"...Which, as it happens, works out well for us. We'll wait until they're busy hagglin' over price, then snatch the Sorrows an' hop the twig afore they realize aught's amiss. Sound like a plan?"},{"name":"VKEBBE","text":"There. The players've arrived; the Reformists' coincounter an' the Ul'dahn buyer are settin' up on the southeast platform. The earrings ought to be nearby."},{"name":"VKEBBE","text":"Hang about. Who're all these other culls? The place was meant to be empty..."},{"name":"VKEBBE","text":"I see some nasty-lookin' blokes in Ul'dahn garb, an'...are those mammets? Ugh, that merchant's brought along a whole bloody entourage!"},{"name":"VKEBBE","text":"I've gone an' got ahead o' meself. I should've realized the job'd never be that easy..."},{"name":"JACKE","text":"(-???-)We'll have to mill a few o' them bodyguards first, I reckon. Ye don't want to fight through a forest o' blades should ye get caught sneakin' about up on them narrow walkways."},{"name":"VKEBBE","text":"Jacke! I was just... I mean, I thought I'd─"},{"name":"JACKE","text":"Stow yer excuses, love. I know full well what ye were about."},{"name":"JACKE","text":"Ye start goin' soft on us, though, an' it'll be like losin' one o' me arms! I can't take on the Bloody Executioners all by meself."},{"name":"JACKE","text":"It's only 'cause I've got rogues like you, an' Underfoot, an' <span class=\"highlight\">Forename</span> here that the guild can take the jobs it does. When our coves walk the shadows, it's the bleedin' pirates what do the tremblin'."},{"name":"JACKE","text":"Remember that, V'kebbe! We ain't some two-gil robbers what piss their breeches when their daddles're caught in the honey pot! We're the knives in the darkmans, an' no bastard wants to go blade to blade with the likes of us!"},{"name":"VKEBBE","text":"...I see ye've not changed yer mind, then. Ye'll need all the stabbers ye can get...an' I promise mine'll be there when ye need 'em."},{"name":"JACKE","text":"Bene! Now let's carve a path to that platform, an' bite back them earrings! V'kebbe, you hide yerself down by the docks in case the marks escape durin' the fightin'."},{"name":"JACKE","text":"<span class=\"highlight\">Forename</span>, you an' me'll split up, an' mill the guards as we go."},{"name":"JACKE","text":"It's them puppets as concern me most... I suggest ye crash them little buggers afore they can spring any rum fun."},{"name":"JACKE","text":"Creep in as close as ye dare, then give 'em a good, solid clout from behind! Aye, it ain't the most original strategy, but that don't make it any less lethal."},{"name":"JACKE","text":"Once yer done with the first group, slip back into the shadows an' move on to the next. Naught to it, eh?"},{"name":"JACKE","text":"I'll head over to the back while you start in from the front. Let's wrap this up afore them 'Jackets blunder in an' scare off our marks."},{"name":"MERCHANT00148","text":"Rogues!? No one mentioned aught about rogues!"},{"name":"MERCHANT00148","text":"Wh-What in the hells do you think you're doing!? I am conducting a business transaction on behalf of the <span class=\"emphasis\">Bloody Executioners</span>! Do you understand what that means!? Do you know what they'll <span class=\"emphasis\">do</span> to you!?"},{"name":"JACKE","text":"Aye, I'm all a-frighted. Odd, then, that yer the one who's shakin'."},{"name":"JACKE","text":"It don't much matter to me <span class=\"emphasis\">who</span> ye work for. Yer bosses broke the code, an' we're here to collect."},{"name":"JACKE","text":"Those'd be the Silver Sorrows, then? I'm sure ye paid a caravan o' coin for them shiny baubles, but I doubt they're worth yer life. Let's have 'em, then."},{"name":"MERCHANT00148","text":"W-Wait! Wait, damn you! You should know that this personage is an extremely influential member of the East Aldenard Trading Company! Surely you've heard of it!"},{"name":"MERCHANT00148","text":"If the threat of reprisal will not stay your hand, then consider the political ramifications of interfering with a foreign dignitary! The Admiral would not desire you to damage Limsa's relations with Ul'dah!"},{"name":"RICH00148","text":"Y-Yes, exactly! I am very highly placed in Ul'dahn society! I have powerful friends who would not be pleased were you to mistreat me in any fashion!"},{"name":"RICH00148","text":"And you must understand, the Silver Sorrows are a historical treasure─a gift once bestowed upon Sultana Nanasha Ul Nasha by her champion. The earrings were later stolen from the royal vault, and we'd lost hope of ever recovering them. That I might so easily purchase them thus is a <span class=\"emphasis\">miracle</span>!"},{"name":"RICH00148","text":"The return on these trinkets will be─<br>...Er, that is to say, the Sorrows must be returned to Ul'dah! Can you not look the other way for the sake of my nation's pride!?"},{"name":"JACKE","text":"...Ye must think me some dull-witted thug. If this deal was bein' made on behalf o' yer country, then why're ye sneakin' about an' consortin' with pirates!?"},{"name":"MILALA","text":"(-???-)An excellent point. One might doubt your quality of character were you to continue with these feeble fabrications."},{"name":"MILALA","text":"You need only entrust those earrings to me...should you truly wish to see them returned to Ul'dah, that is. After all, 'twas to fulfill that very purpose that the thalassocracy bid on the Sorrows in the first place."},{"name":"JACKE","text":"Bit late there, aren't ye, Captain? I think ye'll agree this round belongs to us..."},{"name":"MILALA","text":"On the contrary, my dear scoundrel. I made the winning move the moment I knew we were dealing with a merchant of Ul'dah."},{"name":"MILALA","text":"I come bearing an official order of seizure, authorized by the Admiral herself. You will not be harmed, but I must insist that you cooperate with this reclamation of <span class=\"emphasis\">unlawfully</span> obtained goods."},{"name":"MILALA","text":"Though Costa del Sol is private property, it nevertheless lies within state-governed territory. Come along quietly, and we need not inconvenience Master Gegeruju any further..."},{"name":"MILALA","text":"These suspects will be taken into Yellowjacket custody. And do not concern yourself with the Silver Sorrows─they'll be quite safe with me!"},{"name":"JACKE","text":"Ah, bollocks─we've left the Stray back in Costa del Sol. We should head back an' let her know how this mess turned out."},{"name":"VKEBBE","text":"Aye, I heard the news from Jacke. I don't think that was the Admiral choosin' to side with Milala, though. Probably just eager to reclaim the Silver Sorrows..."},{"name":"VKEBBE","text":"Anyway, that bit about them earrings bein' cloyed from the royal vault turns out to be true. Seems some famous burglar went after 'em once he heard about the “godlike agility” they was said to bestow upon the wearer."},{"name":"JACKE","text":"Bah! The hells take that canary-colored harpy! We might as well've handed the things to her on a velvet cushion."},{"name":"VKEBBE","text":"I'll go find Underfoot an' help him with his diggin'. There's still that last treasure out there, an' ye can be sure the Reformists won't be givin' it up without a fight."},{"name":"JACKE","text":"Aye, you do that. Bene luck to ye, love."},{"name":"MILALA","text":"Ah, there you are. You left before events had truly been decided, and I thought you deserved to know the score."},{"name":"MILALA","text":"The Ul'dahn merchant has acquiesced to our request and surrendered the Silver Sorrows into our keeping. We've also apprehended the Reformists' accountant, and will be holding him for further questioning."},{"name":"JACKE","text":"Oho! Bonin' an associate o' the Bloody Executioners? You Yellowjackets don't flinch from yer duty, I'll give ye that!"},{"name":"JACKE","text":"An' what's this I hear about you <span class=\"emphasis\">buyin'</span> information, Captain? I thought ye'd sooner die than associate with elements o' the underworld?"},{"name":"MILALA","text":"I will do what I must to stay ahead in this challenge, and that marketeer's knowledge was vital to the case. 'Tis true I might find his practices...distasteful, but he is no pirate."},{"name":"MILALA","text":"It is the fading era of <span class=\"emphasis\">piracy</span> which I mean to consign to the history books. And that chapter will never be fully closed until every pirate-spawned relic─including you and your guild─becomes a thing of the past."},{"name":"MILALA","text":"Valiant and forthright! These are the words by which the Yellowjackets live; it is the manner in which we protect Limsa Lominsa! I swore an oath on the graves of my sisters: no more shall the innocent suffer at the hands of these savage buccaneers, these...unrepentant killers!"},{"name":"JACKE","text":"And a grand oath it is. Me, I've got me fambles full just keepin' the code intact."},{"name":"JACKE","text":"But the code is a kind of oath, too, when you get down to it. An' since I've sworn to uphold it, I've no intention o' steppin' aside an' lettin' ye trample all over me or me coves."},{"name":"JACKE","text":"In fact, ye'd be better off givin' in now afore matters get proper serious. Just say yer sorry, admit defeat, an' we'll leave it at that, eh?"},{"name":"MILALA","text":"You─ Your audacity knows no bounds! I am done wasting words!"},{"name":"MILALA","text":"I shall reclaim that last treasure, and then I will look on victorious as your guild is dismantled brick by brick!"},{"name":"JACKE","text":"Hahaha! That's the spirit, Captain! Just don't forget to keep an eye on them earrings!"},{"name":"JACKE","text":"The city's crawlin' with rogues, ye know! Ye could keep the Sorrows in a bloody lockbox in the Coral Tower, but look away for a moment an' one o' me coves'll bite them beauties right back!"},{"name":"JACKE","text":"...Come on, <span class=\"highlight\">Forename</span>. It's back to the Sisters for us."},{"name":"JACKE","text":"Well, after all that hard work, the shrew made off with the spoils."},{"name":"JACKE","text":"And as far as her damn contest goes, I s'pose that makes us even. It'll be the last treasure─this “Black Sarcophagus”─that decides the victor."},{"name":"JACKE","text":"Whatever the Reformists are doin' to keep it bob, ye can bet yer grandmum's teeth there'll be some bladework needed afore this job is done. Get yerself ready for a proper scrap, <span class=\"highlight\">Forename</span>..."},{"name":"QIB","text":"Defeat the bodyguards!"},{"name":"JACKE","text":"Ugh, this bastard's made o' solid rock!<br><span class=\"highlight\">Forename</span>, get over here an' start chippin'!"},{"name":"MERCHANT","text":"This is a <span class=\"emphasis\">private</span> meeting!<br>Remove these rats at once!"},{"name":"JACKE","text":"Guess me daggers...wasn't sharp enough..."}],"reward":{"items":[{"id":8663},{"id":3066,"one":1},{"id":3576,"one":1},{"id":3349,"one":1},{"id":27638,"one":1},{"num":2,"id":5825,"one":1}],"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":91}],"quests":[65682]},"next":[65690]},"partials":[{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1010198","obj":{"i":1010198,"n":"V'kebbe","l":1427,"q":4}},{"type":"npc","id":"1010250","obj":{"i":1010250,"n":"Jacke","l":32,"q":1}},{"type":"npc","id":"1010251","obj":{"i":1010251,"n":"V'kebbe","l":32,"q":1}},{"type":"npc","id":"1010252","obj":{"i":1010252,"n":"Black Marketeer","l":31,"q":1}},{"type":"item","id":"8663","obj":{"i":8663,"n":"Iron Pugiones","l":22,"c":33811,"t":84,"p":1028}},{"type":"item","id":"3066","obj":{"i":3066,"n":"Velveteen Shirt","l":25,"c":42226,"t":35,"p":1428}},{"type":"item","id":"3576","obj":{"i":3576,"n":"Fingerless Goatskin Gloves","l":25,"c":44062,"t":37,"p":1282}},{"type":"item","id":"3349","obj":{"i":3349,"n":"Velveteen Sarouel","l":25,"c":45178,"t":36,"p":1099}},{"type":"item","id":"27638","obj":{"i":27638,"n":"Altered Velveteen Bandana","l":25,"c":41774,"t":34}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65682","obj":{"i":65682,"n":"Grinners in the Mist","g":132,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"65690","obj":{"i":65690,"n":"Market for Death","g":132,"l":"Limsa Lominsa","s":300,"f":1}}]}