{"quest":{"name":"Unholy Matrimony","location":"Ul'dah","id":65689,"patch":2.0,"sort":10,"eventIcon":71221,"issuer":1001291,"target":1003896,"involved":[1001292],"genre":93,"journal":["Hihito has had enough of her husband's poor work ethic, and needs someone to whip him into shape.","Hihito is frustrated with her husband, whose lack of ambition is leading them to financial ruin. Speak with Bobonima outside the Coliseum and find some way to motivate him.","Bobonima is clearly annoyed with your meddling in his personal affairs. Nonetheless, he takes your presence to his advantage, and bids you help him by putting up Franz the Fair flyers inside the Coliseum.","You find suitable spots for all the flyers. Seek out Wolkan at the Gladiators' Guild and tell him how you helped Bobonima.","Your tale elicits Wolkan's gratitude as well as his sympathies, as the rocky relationship between Bobonima and his wife is anything but secret."],"objectives":["Speak with Bobonima.","Post the flyers inside the Coliseum.","Speak with Wolkan."],"dialogue":[{"name":"HIHITO","text":"How can the Ossuary demand such exorbitant contributions every single moon!? It's outrageous, I tell you!"},{"name":"HIHITO","text":"Don't they understand that a woman has <span class=\"emphasis\">needs</span>? How do they expect me to pay for rouge and Sunsilk dresses, <span class=\"emphasis\">and</span> feed my marmot?"},{"name":"HIHITO","text":"Oh, if only I'd had the foresight to marry a more ambitious man! This is all <span class=\"emphasis\">his</span> fault! "},{"name":"HIHITO","text":"If he just worked harder and showed some initiative, surely he would be rewarded─maybe even promoted!"},{"name":"HIHITO","text":"If things don't improve, it won't be long before I join the beggars in Pearl Lane. Save me from this cruel fate, I beg of you! Speak with my husband, Bobonima, and find some way to motivate him! You should find him at the Coliseum entrance, wearing one of those ridiculous outfits."},{"name":"BOBONIMA","text":"...Aye, I'm Bobonima. Congratulations, you've found the world's worst husband."},{"name":"BOBONIMA","text":"That is, if you believe that harpy I have for a wife. She never cooks, she never cleans, she just gallivants around spending my hard-earned money. And now I see she's speaking ill of me to bloody strangers!"},{"name":"BOBONIMA","text":"Well, if you're hells-bent on meddling in my affairs, you can assist me by taking some of these Franz the Fair flyers and posting them on the walls inside the Coliseum."},{"name":"BOBONIMA","text":"I've <span class=\"alternative-container\"><span class=\"alternative\">got a long night</span><span class=\"alternative\">got a long day</span><span class=\"alternative\">still got a long shift</span></span> ahead of me standing out here, so I won't be getting to it any time soon. When you've finished, go and tell Wolkan at the Gladiators' Guild. He should give you something for your trouble."},{"name":"WOLKAN","text":"Ye helpin' Bobonima? Well, ain't that charitable of ye! Franz's gotten pretty popular of late, and his fans keep stealin' these flyers and takin' them home as souvenirs."},{"name":"WOLKAN","text":"...Ahhh, so ye've met Bobonima's wife. <span class=\"emphasis\">Now</span> I understand. Sorry to hear ye got caught up in all that."},{"name":"WOLKAN","text":"If ye ask me, they're made for one another. Not that it's my place to judge, mind. Anyroad, we appreciate yer help."}],"reward":{"items":[{"num":5,"id":4551}],"xp":50},"reqs":{"quests":[65687]}},"partials":[{"type":"npc","id":"1001291","obj":{"i":1001291,"n":"Hihito","l":40,"q":1}},{"type":"npc","id":"1003896","obj":{"i":1003896,"n":"Wolkan","l":41,"q":3}},{"type":"npc","id":"1001292","obj":{"i":1001292,"n":"Bobonima","l":40,"q":1}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"quest","id":"65687","obj":{"i":65687,"n":"Gil for Gold","g":93,"l":"Ul'dah","s":10}}]}