{"quest":{"name":"Slave to the Code","location":"Western La Noscea","id":65681,"patch":2.4,"sort":151,"icon":100344,"unlocksFunction":1,"eventIcon":71341,"issuer":1010218,"target":1009943,"involved":[1010228],"genre":132,"journal":["Jacke is determined to track down the remnants of the Jolly Merchants.","Putting himself in his marks' shoes, Jacke hazards a guess as to where the last of the Jolly Merchants will likely be hiding. Head out to the Flock in western La Noscea and search for signs of the remaining slavers.","After discovering a family of villagers tied up amongst the dodo nests, you are confronted by the final gang of slavers. One hectic and feather-filled battle later, the pirates are defeated and the Jolly Merchants no more. See to the well-being of the captive smallfolk.","As you are tending to the traumatized villagers, you are approached by a trio of Yellowjackets led by one Captain Milala. The Yellowjacket captain appears fanatically opposed to anything with the slightest connection to piracy, and challenges the Rogues' Guild to a contest to justify its very existence. Return to the guild and discuss this development with Jacke.","You return to the Dutiful Sisters to find Jacke still chafing over Captain Milala's presumptuous challenge. Bound by the code, however, the guildmaster fully intends to reclaim the stolen treasures even if it means dancing to the Yellowjacket's tune. Master the Mug ability and continue sharpening your skills that you might ensure victory for the guild.<br><br>※The next rogue quest will be available from Jacke upon reaching level 20."],"objectives":["Search the Flock for signs of the Jolly Merchants.","Speak with Jacke at the Rogues' Guild."],"dialogue":[{"name":"JACKE","text":"Those last few Jolly Merchant bastards must be camped out somewhere in western La Noscea. Now, if I was a black-blooded, gil-grubbin' slaver, where would I be hidin'...?"},{"name":"JACKE","text":"There's naught to the west but the Sahagin pools; even those bollocks-for-brains pirates know better'n to trespass on fishback territory."},{"name":"JACKE","text":"An' they won't want to chance runnin' into patrols near Aleport, so that just leaves us east. ...The Flock? Aye, they'll likely be nestled down in the ruins out there amongst the dodos."},{"name":"JACKE","text":"That's where we'll try to pick up their trail. You head on over an' snilch the place while I send word to the Sisters an' the Maelstrom."},{"name":"JACKE","text":"Head on over to the Flock an' see if ye can't spy our missin' slavers. I'll be along once I've passed on word to the Maelstrom an' our fellow coves."},{"name":"POORLADY00145","text":"Thank you for freeing us! We've been tied up here since those awful pirates snatched us from our beds."},{"name":"JACKE","text":"Those are some interestin'-lookin' dodos ye've got there, <span class=\"highlight\">Forename</span>. ...No sign o' the Merchants, though, eh?"},{"name":"POORLADY00145","text":"Their leader mentioned heading over to Aleport. He said something about there being no signal, and that was a signal that something was wrong."},{"name":"POORLADY00145","text":"They just left us hobbled here like lambs for the market; one of them japed about keeping the meat unsullied in case there was trouble... Pray let us flee this place before they return!"},{"name":"PIRATE00145","text":"(-???-)An' who are you to just sidle in an' set loose our 'ard-won prizes? Hm?"},{"name":"PIRATE00145","text":"'Twas the damndest thing. We'd 'alf a crew lodgin' in Aleport, an' not a one of 'em survived the night. Done in by a couple o' sneaky curs what favored the shortblades, they say."},{"name":"PIRATE00145","text":"...I'm supposin' that was you two. Seems ye've a bone to pick with our choice o' “trade.”"},{"name":"JACKE","text":"Aye, I can't say as I've much use for slavers...'cept as a place to bury me knives. Oh, an' I wouldn't bother yerself with waitin' on yer ship to come back neither. The Jolly Merchants are done for."},{"name":"PIRATE00145","text":"Hee hee hee! Ye might have the right of it, lad!"},{"name":"PIRATE00145","text":"But then ye wouldn't know the kind o' coin three 'ealthy slaves like them ones'll bring us. I'll 'ave a new ship an' a new crew afore a single moon 'as passed."},{"name":"PIRATE00145","text":"Ye 'ear that, chattel? Yer each worth a shinin' bloody fortune! An' ye've me to thank for 'elpin' ye learn yer true worth!"},{"name":"JACKE","text":"Ignore this bleatin' sod. In fact, why don't ye step back a ways?"},{"name":"JACKE","text":"These coves are about to learn the consequences o' breakin' the code, an' the discussion is like to get messy."},{"name":"JACKE","text":"Did ye not think we'd come for ye? Ye can try to stifle yer victims' screams in the darkmans, but the shadows are always listenin'!"},{"name":"POORLADY00145","text":"Thank you. I shudder to think what horrid fate awaited us had you not helped us to escape..."},{"name":"POORBOY00145","text":"I knew someone would come! You're just like the heroes in the stories!"},{"name":"POORBOY00145","text":"They always arrive at the perfect time and triumph over the villains! Do you think I could be a hero like you? I know I could be brave and strong, too. I just know it!"},{"name":"JACKE","text":"I... Ye don't want to be like me, lad."},{"name":"JACKE","text":"Listen, now. Me an' those coves there, we're the ones what the scary folk are afraid of. An' that's 'cause we keep the rules for the world they live in."},{"name":"JACKE","text":"We don't much care if ye shirk yer chores, or get into fights..."},{"name":"JACKE","text":"But if ye ever break the code an' betray yer mates, then that's when we'll come after ye─no matter how far ye run or how well ye hide!"},{"name":"JACKE","text":"Live yer life like the hero ye want to be, though, an' ye'll never need worry about that."},{"name":"JACKE","text":"Aye? You two can stubble it, an' all!"},{"name":"MILALA","text":"(-Yellowjacket Soldier-)I assume you are the citizens who were abducted by the Jolly Merchants?"},{"name":"MILALA","text":"I am Captain Milala of the Yellowjackets. Maelstrom Command has entrusted me with conducting you to safety."},{"name":"JACKE","text":"It's all right, lad, these folk'll take care of ye. ...Go on, ye'd best not get left behind."},{"name":"JACKE","text":"Was there aught else, Captain? Word on a new job?"},{"name":"MILALA","text":"A job? From me? ...For <span class=\"emphasis\">you</span>?"},{"name":"MILALA","text":"How patently absurd! Why, I'd rather hire a sewer rat to mind my larder!"},{"name":"MILALA","text":"Was it during one of your “jobs” that you turned Aleport into a slaughterhouse? What dark age is this that we must employ assassins to enforce the law!?"},{"name":"MILALA","text":"It is this continued dalliance with underworld miscreants such as you that prevents Limsa Lominsa from ever fully expunging the stain of piratical infection!"},{"name":"MILALA","text":"Look at these weapons you bear! A civilized person uses such implements to carve meat or peel fruit, and leaves them at table where they belong!"},{"name":"MILALA","text":"Do you perhaps clench them 'twixt your teeth as you swing over rails like the pirates you hunt? Our fair city has no place for those who refuse to abandon the brutish ways of the past..."},{"name":"MILALA","text":"The only champions of justice this nation requires are the valiant and forthright soldiers of the Yellowjackets!"},{"name":"VKEBBE","text":"Jacke... What the bloody hells does this cull want with us?"},{"name":"JACKE","text":"I've not the foggiest idea, love. Just smile an' nod."},{"name":"MILALA","text":"I've not come here to be patronized─I've come to put a decisive end to piracy in <span class=\"emphasis\">all</span> its forms! Consider this visit a gauntlet thrown at the collective feet of the Rogues' Guild!"},{"name":"MILALA","text":"Heed well my words. Just before dawn this very morn, a Maelstrom vessel stocked with provisions was boarded and looted by pirates."},{"name":"MILALA","text":"Much of the cargo was stolen, and that is vexing indeed. But it is the theft of three items in particular─three unique treasures of nigh-incalculable worth─that most distresses my martial colleagues."},{"name":"MILALA","text":"As for the brigands, they made well their escape, disappearing into the dawn's mist along with their precious plunder..."},{"name":"JACKE","text":"A rum tale. What's it to do with us?"},{"name":"MILALA","text":"I challenge you! A contest to reclaim these stolen treasures!"},{"name":"MILALA","text":"Should my Yellowjackets and I succeed in retrieving the greater share, I shall formally propose the abolition of the Rogues' Guild. Upon review of our achievements, the Admiral will surely concede that your unscrupulous institution has outlived its usefulness."},{"name":"JACKE","text":"Ah, blow it out yer wattle. I've better ways to spend me time."},{"name":"MILALA","text":"Oh, do you now? This incident constitutes a theft against the nation of Limsa Lominsa. Does that not violate your beloved code?"},{"name":"MILALA","text":"If I'm not mistaken, you've no choice but to rise to the occasion. ...Unless of course, you mean to slink back into your hole and abandon the fundamental precepts of your “duty”?"},{"name":"JACKE","text":"All right, all right, ye screechin' shrew─ye've made yer bloody point. An' ye'll be sorry that ye did, I promise ye that."},{"name":"MILALA","text":"Your paltry promises amount to naught in the face of my conviction. I shall not rest until Limsa Lominsa is free of every last buccaneer, scoundrel, and shadow-dwelling ne'er-do-well!"},{"name":"PERIMUHAURIMU","text":"...What now, Jacke?"},{"name":"JACKE","text":"For right now? We head back to the Sisters."},{"name":"JACKE","text":"For a wee lass, that Milala's got some bollocks. An' it seems she's well done with aught what whiffs o' pirate stock."},{"name":"JACKE","text":"Hmph. I don't take kindly to culls pullin' me strings, but the shrew is right─the code's been broken an' we've a job to do."},{"name":"JACKE","text":"From the sounds of it, though, them coves knew what they were about when they cloyed them treasures. I'll need ye at yer best."},{"name":"JACKE","text":"It's time ye learned the art o' muggin'! Rough up a cull in just the right way, an' he'll give up more than what ye'd get if ye just plain knocked him on his arse."},{"name":"JACKE","text":"Me an' the lads'll be busy whiddlin' the story on them bitten baubles, so yer free to head out an' sharpen yer skill─might even be as ye'll pocket some extra blunt while yer at it, eh?"},{"name":"QIB","text":"Defeat the Jolly Merchants!"},{"name":"JACKE","text":"Stow yer whids an' draw yer steel!"},{"name":"JACKE","text":"Always more of 'em..."},{"name":"JACKE","text":"These birds move slow, but they've a nasty peck!"},{"name":"JACKE","text":"Keep yer distance an' skewer 'em from afar!<br>Aye, throw yer bloody daggers at 'em, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"},{"name":"JACKE","text":"Ugh, <span class=\"emphasis\">more</span> dodos!?<br>Thought they was slavers, not bleedin' farmers!"},{"name":"JACKE","text":"Stay calm now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!<br>Take 'em one at a time!"},{"name":"JACKE","text":"An' still they come...<br>Bene! Saves us the searchin'!"},{"name":"JACKE","text":"Get out o' here, <span class=\"highlight\">Forename</span>.<br>Take the captives an' go..."},{"name":"JACKE","text":"No scraps for latecomers!<br>The <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">colt</span></span> an' me had a hunger!"},{"name":"JACKE","text":"You coves took yer sweet time!<br>Let's mop this up already!"},{"name":"BOSS","text":"I like me slaves with a bit o' fight!<br>Ye'll fetch a grand price on the block!"},{"name":"VKEBBE","text":"This's a fine pile o' quarrons!<br>There's naught for us to do..."},{"name":"VKEBBE","text":"Yer not the only ones with reinforcements!"},{"name":"PERIMU","text":"Underfoot is here to get underfoot!"},{"name":"PERIMU","text":"...Or, at least I would if any bugger was left standin'."}],"reward":{"action":2248,"items":[{"id":8661},{"id":3022,"one":1},{"id":2677,"one":1},{"id":3546,"one":1},{"id":3780,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":91}],"quests":[65680]},"next":[65682]},"partials":[{"type":"npc","id":"1010218","obj":{"i":1010218,"n":"Jacke","l":33,"q":2}},{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1010228","obj":{"i":1010228,"n":"Beggarly Boy","l":33,"q":1}},{"type":"action","id":"2248","obj":{"i":2248,"n":"Mug","c":613,"j":29,"t":4,"l":15}},{"type":"item","id":"8661","obj":{"i":8661,"n":"Brass Knives","l":15,"c":33806,"t":84,"p":504}},{"type":"item","id":"3022","obj":{"i":3022,"n":"Cotton Shirt","l":14,"c":42105,"t":35,"p":424}},{"type":"item","id":"2677","obj":{"i":2677,"n":"Hunting Hat","l":16,"c":41046,"t":34,"p":513}},{"type":"item","id":"3546","obj":{"i":3546,"n":"Fingerless Hard Leather Gloves","l":15,"c":44061,"t":37,"p":420}},{"type":"item","id":"3780","obj":{"i":3780,"n":"Hard Leather Crakows","l":15,"c":46155,"t":38,"p":384}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65680","obj":{"i":65680,"n":"Stifled Screams","g":132,"l":"Limsa Lominsa","s":150,"f":1}},{"type":"quest","id":"65682","obj":{"i":65682,"n":"Grinners in the Mist","g":132,"l":"Limsa Lominsa","s":200,"f":1}}]}