{"quest":{"name":"Tougher than Leather","location":"Ul'dah","id":65699,"patch":2.0,"sort":30,"eventIcon":71221,"issuer":1003898,"target":1003898,"genre":93,"journal":["Jajakuta the merchant is visibly perturbed and in need of some assistance.","Jajakuta has received an order from the Pugilists' Guild for several gloves and harnesses, but he lacks the materials needed to craft them. Gather the pelts he requires by heading to central Thanalan and culling snapping shrews.","You have gathered the five shrew pelts Jajakuta requested. Deliver them to him outside the Pugilists' Guild.","Having delivered the pelts, you can now sleep soundly in the knowledge that those hapless shrews will live on forever in the instruments of war their hides are destined to become."],"objectives":["Collect shrew pelts from snapping shrews in central Thanalan.","Report to Jajakuta outside the Pugilists' Guild."],"dialogue":[{"name":"JAJAKUTA","text":"Tell me, what brings you here, friend? Hm? Looking for a bit of work, perhaps? Some small job to add a little weight to that coinpurse of yours, hm?"},{"name":"JAJAKUTA","text":"Well, you're in luck! The pugilists have just placed an order with me for several of the leather gloves and harnesses they use for sparring."},{"name":"JAJAKUTA","text":"But the Traders are cruel, for I find myself lacking the hides required. Would that I had the pelts of a few snapping shrews..."},{"name":"JAJAKUTA","text":"What say you, friend, hm? Care to help a merchant down on his luck, hm? Bring me five snapping shrew pelts and I promise to make it worth your while. You can find the creatures roaming central Thanalan."},{"name":"JAJAKUTA","text":"Back already, are you? Come, let us see what you've brought."},{"name":"JAJAKUTA","text":"Exceptional! These are fine shrew pelts indeed! Well done, my friend."},{"name":"JAJAKUTA","text":"The Pugilists' Guild is among my largest clients. I fear what would have come to pass had this order been delayed any longer."},{"name":"JAJAKUTA","text":"Take this, hm? You've more than earned it."}],"reward":{"gil":127,"items":[{"num":11,"id":6}],"xp":147}},"partials":[{"type":"npc","id":"1003898","obj":{"i":1003898,"n":"Jajakuta","l":40,"q":1}}]}