{"quest":{"name":"Extending Fences","location":"Central Shroud","id":65693,"patch":2.0,"sort":110,"eventIcon":71221,"issuer":1000471,"target":1000471,"genre":92,"journal":["Luquelot at Bentbranch Meadows wishes you to procure fence-building materials from diremites.","A cruel intruder has been sneaking into the ranch to frighten the chocobos. Obtain six strands of diremite web to aid in the construction of a fence.","You have collected the strands of diremite web. Deliver them to Luquelot at Bentbranch Meadows.","Luquelot originally hails from Ishgard, a nation renowned for chocobo husbandry. Having been brought up around the birds, the Elezen possesses a wealth of knowledge on chocobos that serves him well at the ranch. He is, however, frequently surprised by the vagaries of Gridanian life."],"objectives":["Obtain six strands of diremite web.","Deliver the strands of diremite web to Luquelot at Bentbranch Meadows."],"dialogue":[{"name":"LUQUELOT","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. You have the distinct air of an adventurer. Might I trouble you for some assistance?"},{"name":"LUQUELOT","text":"In recent days, a heartless cad has been sneaking into the ranch to scare our chocobos. The poor birds are in a state of constant unease, wondering when the next fright will come."},{"name":"LUQUELOT","text":"It is my hope that extending the fencing will help to keep the intruder out. To that end, could I ask you to procure some strands of diremite web? They make for a surprisingly sturdy construction material."},{"name":"LUQUELOT","text":"You should be able to obtain the web from the diremites themselves. There are usually a few to be found roaming the lands around the ranch. Six strands should be sufficient."},{"name":"LUQUELOT","text":"Ah, you have returned. Tell me, were you able to procure the diremite web I requested?"},{"name":"LUQUELOT","text":"Yes, yes, these will do nicely. These are perfect for binding posts together."},{"name":"LUQUELOT","text":"Were I still in Ishgard, I would never have entertained the notion of using such a bizarre material in this manner."},{"name":"LUQUELOT","text":"Oh, did I not mention I was from Ishgard? Aye, well, Gridania is, in actual fact, my second home."},{"name":"LUQUELOT","text":"My native land was once famous for its chocobo stables. No man in Eorzea could speak of the creatures without his thoughts turning naturally to Ishgard. Sadly, however, that time has passed."},{"name":"LUQUELOT","text":"I left my homeland to accept employment here at the ranch, instructing others in the methods of chocobo husbandry. Yet I have found that it is often I who am the recipient of others' instruction─and on a great many matters! Truly, one can never know what life may hold in store."}],"reward":{"gil":180,"items":[{"num":23,"id":5},{"id":4093,"one":1},{"id":4198,"one":1},{"id":5824,"one":1}],"xp":2100},"reqs":{"jobs":[{"lvl":10,"id":1}],"quests":[65911]}},"partials":[{"type":"npc","id":"1000471","obj":{"i":1000471,"n":"Luquelot","l":54,"q":5}},{"type":"item","id":"4093","obj":{"i":4093,"n":"Bone Armillae","l":10,"c":55632,"t":42}},{"type":"item","id":"4198","obj":{"i":4198,"n":"Copper Ear Cuffs","l":11,"c":55201,"t":41,"p":224}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65911","obj":{"i":65911,"n":"Not a Material Girl","g":92,"l":"Central Shroud","s":100}}]}