{"quest":{"name":"Slimy Hollows","location":"Central Shroud","id":65696,"patch":2.0,"sort":130,"eventIcon":71221,"issuer":1000494,"target":1000494,"genre":92,"journal":["Finnea, a guard at Galvanth's Spire, seeks a willing volunteer to deal with a slug problem.","Finnea tasks you with slaying slugs. Sprinkle flat ale around three moist depressions near the Hedgetree, and defeat the creatures that emerge.","You have slain the saprophagous slugs. Report to Finnea at Galvanth's Spire.","In search of a new food source, the saprophagous slugs had begun devouring the flowers left in remembrance of the lost at the Tam-Tara Deepcroft. Problems arising from the spiraling slug population notwithstanding, Finnea could not bear to see the resting place of her fallen companions defiled. Perhaps your efforts have given the grieving guard some small measure of comfort."],"objectives":["Sprinkle ale near the moist depressions and defeat the saprophagous slugs.","Report to Finnea at Galvanth's Spire."],"dialogue":[{"name":"FINNEA","text":"Hmph. You must be desperate for work indeed if you would speak with me a second time. Either that, or you never learned to leave well enough alone."},{"name":"FINNEA","text":"But if you're so bloody eager, then here's another job for you. Head on over to the Hedgetree and clear out some nests of saprophagous slugs."},{"name":"FINNEA","text":"All you need do is sprinkle some of this flat ale on the ground where you find the moist depressions. You should soon be up to your armpits in slugs."},{"name":"FINNEA","text":"Don't let any of the buggers slither away─and make sure you find and clear out all three nests."},{"name":"FINNEA","text":"Judging by the looks of you, no slug escaped unharmed."},{"name":"FINNEA","text":"Hmph. I don't suppose you have the faintest notion what the Tam-Tara Deepcroft is, do you?"},{"name":"FINNEA","text":"It's the final resting place of those who perished during the Calamity. The slugs you so handily dispatched were feeding on the flowers we had laid there in remembrance of the fallen."},{"name":"FINNEA","text":"The monsters multiply, and food grows scarce. Perhaps there was naught else for them to feed on, but to see those wreaths disturbed thus was more than I could bear."},{"name":"FINNEA","text":"And now I've said too much. Here, take your reward and leave me be."},{"name":"SYSTEM","text":"A squelching sound reaches your ears..."},{"name":"SYSTEM","text":"A squelching sound reaches your ears..."},{"name":"SYSTEM","text":"A squelching sound reaches your ears..."}],"reward":{"items":[{"id":27635,"one":1},{"id":2668,"one":1},{"num":2,"id":5824,"one":1}],"xp":3080},"reqs":{"jobs":[{"lvl":10,"id":1}],"quests":[65919]}},"partials":[{"type":"npc","id":"1000494","obj":{"i":1000494,"n":"Finnea","l":54,"q":2}},{"type":"item","id":"27635","obj":{"i":27635,"n":"Altered Cotton Bandana","l":12,"c":41540,"t":34}},{"type":"item","id":"2668","obj":{"i":2668,"n":"Brass Spectacles","l":13,"c":40879,"t":34,"p":355}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65919","obj":{"i":65919,"n":"If Ye Break Faith","g":92,"l":"Central Shroud","s":120}}]}