{"quest":{"name":"Market for Death","location":"Limsa Lominsa","id":65690,"patch":2.4,"sort":300,"icon":100344,"unlocksFunction":1,"eventIcon":71341,"issuer":1009943,"target":1009943,"involved":[1010261,1010265,1010267],"genre":132,"journal":["Jacke's rogues have new information on the final missing treasure.","Jacke calls a meeting to discuss the true nature of the enigmatic Black Sarcophagus. According to Perimu's investigation, the ominously named object is, in fact, an experimental explosive developed by the Garlean Empire. As the gathered rogues ponder the implications of their discovery, Lonwoerd interrupts to deliver a letter from their itinerant underworld contact. Travel to Thalaos in upper La Noscea, and seek out the black marketeer.","Upon approaching the inert form of the dark-robed old man, you suddenly find yourself the target of an Executioner ambush. Though the odds are against you, your deadly rogue training eventually prevails. Wipe the blood from your blades and see what can be done for the black marketeer.","The eccentric information broker has been murdered by the Executioners for his meddling. You learn from the lone pirate remaining at the scene that the captain of the Reformists plans to use the Black Sarcophagus to assassinate Admiral Bloefhiswyn. Speak with Jacke and discuss what can be done.","While he is busy escorting his pirate prisoner back to the guild, Jacke asks that you share your revelations with the Yellowjackets. Head to the Foremast in middle La Noscea and speak with Captain Milala.","Though she initially suspects you of harboring larcenous intentions, Milala nevertheless accepts the news of the impending assassination attempt at face value. Return to the Rogues' Guild and report to Jacke.","Jacke appears relieved to hear of the Yellowjackets' immediate deployment. Master the use of your new trick, and join your fellow rogues in their efforts to reclaim the Black Sarcophagus...before it is too late."],"objectives":["Search for the black marketeer at Thalaos.","Tend to the black marketeer.","Speak with Jacke at Thalaos.","Speak with Milala at the Foremast.","Speak with Jacke at the Rogues' Guild."],"dialogue":[{"name":"JACKE","text":"I was wonderin' when ye'd show up, <span class=\"highlight\">Forename</span>, but bugger me if ye don't look ready to mill an entire crew o' sods by yerself."},{"name":"JACKE","text":"An' bene that ye are, 'cause we've finally uncovered some hard facts about that last treasure. Won't be long now afore we cloy the winnin' piece an' put this daft challenge to bed."},{"name":"JACKE","text":"All right. I've gathered the other coves for a meetin', so let's get down to it."},{"name":"JACKE","text":"At long bloody last, the Black Sarcophagus has given up its secrets. ...Underfoot, ye've some news for us?"},{"name":"PERIMUHAURIMU","text":"Aye, Jacke. I think half our troubles in whiddlin' the truth of it lay in callin' this nasty thing a “treasure.”"},{"name":"PERIMUHAURIMU","text":"The Black Sarcophagus ain't no dimber bauble...it's the Mark LI magitek mine─a bleedin' prototype explosive what was bitten from an imperial transport vessel!"},{"name":"PERIMUHAURIMU","text":"An' even though it ain't that big─maybe the size of a small cargo box─they say the blast'd have enough kick to incinerate a bloody behemoth."},{"name":"PERIMUHAURIMU","text":"Seems the Garleans meant to start production at their factory in La Noscea, then distribute the mines through Castrum Marinum. Lucky some plucky privateer cloyed the prototype en route, then, eh?"},{"name":"VKEBBE","text":"An experimental weapon... That explains why the thalassocracy was so bleedin' eager to bid at that auction, an' so reluctant to share the details with us."},{"name":"PERIMUHAURIMU","text":"At least now we know the “what”...but there's still the question of the “where.” The Curs delivered their bitten goods to the Reformists, that much is certain."},{"name":"PERIMUHAURIMU","text":"What happened to the sarcophagus after that, though, we ain't so sure. There've been no reports o' huge explosions or the like, so either the Executioners still have the mine, or they've peddled it to some other buyer..."},{"name":"JACKE","text":"The Reformist faction came together out o' their shared hatred for the Admiral an' her ways. I'm guessin' they didn't cloy that bomb just to sell it..."},{"name":"JACKE","text":"...What is it, Lonny?"},{"name":"LONWOERD","text":"A letter for ye, Jacke. Says it's urgent."},{"name":"JACKE","text":"A letter? Who's it from?"},{"name":"LONWOERD","text":"The old man. I found it while I was sortin' through our daily deliveries."},{"name":"JACKE","text":"Let's see now...<br><br><span class=\"emphasis\">Come to Thalaos. I have urgent news.</span>"},{"name":"PERIMUHAURIMU","text":"I've never known the old man to summon a customer! No one's seen him at his usual haunts for a while, so do ye reckon this's some rum morsel he's dug up just for us?"},{"name":"JACKE","text":"Aye, it could be..."},{"name":"JACKE","text":"<span class=\"highlight\">Forename</span>, you an' me are headed to Thalaos. Underfoot, V'kebbe, yer to take another stab at pinnin' down the location o' the sarcophagus."},{"name":"JACKE","text":"You an' me'll head to Thalaos to see what the old man wants. I hope it's good news...but me gut is tellin' me otherwise."},{"name":"BALLOON","text":"Yer done for, rogue!"},{"name":"BALLOON","text":"Slice <span class=\"alternative-container\"><span class=\"alternative\">'er</span><span class=\"alternative\">'im</span></span> up!"},{"name":"BALLOON","text":"Trustin' fool!"},{"name":"PIRATE00154","text":"(-???-)&lt;giggle&gt; Yer wastin' yer time, darlin'. We opened that scrag's wrinkled throat bells ago."},{"name":"PIRATE00154","text":"Ye cross the Bloody Executioners, an' ye get what's comin' to ye."},{"name":"PIRATE00154","text":"...Did ye like our message? We wasn't sure ye'd fall for it, but a little mystery goes a long way, eh?"},{"name":"PIRATE00154","text":"Aw, now don't be like that, darlin'. Me an' me mates didn't have much choice─when the boss says “go <span class=\"emphasis\">play</span> wiv the rogues,” then we gotta go play wiv the rogues."},{"name":"PIRATE00154","text":"After all, we never asked ye to come ruin our game, now, did we? An' don't give me no long-winded speech about yer precious code..."},{"name":"PIRATE00154","text":"The Reformists' vision stretches far beyond what them tired ol' rules is good for. Once Cap'n Aisibhir takes command o' the Executioners, 'e'll give us back the teeth we lost when we submitted to the Admiral's leash!"},{"name":"PIRATE00154","text":"We'll be the terrors of the sea once more! Free to rove an' plunder in a new age o' pirate glory!"},{"name":"PIRATE00154","text":"...An' I'll bathe in blood to see that age come to pass! I'll kick down yer shite-stinkin' code, an' 'ave all yer sneaky 'eads on the choppin' block!"},{"name":"JACKE","text":"(-???-)Like hells you will! The only sentence what's bein' passed today is yers!"},{"name":"PIRATE00154","text":"Well, 'ello there, darlin'. Ain't you a fine-lookin' lad?"},{"name":"JACKE","text":"I've heard all this prattle afore. Free to pillage an' plunder, is it? Aye, it all sounds grand, but ye don't think o' the price."},{"name":"JACKE","text":"That “shite-stinkin' code” is the only thing what keeps you bloody coves from millin' one another! Without it─without Limsa Lominsa to call home─ye'd be adrift in an ocean o' quarrons!"},{"name":"JACKE","text":"...But if yer so keen to keep company with the dead, I'll be soddin' happy to oblige!"},{"name":"PIRATE00154","text":"&lt;sigh&gt; You was prettier wiv yer gob shut... But I can see I'm outta me depth, 'ere."},{"name":"PIRATE00154","text":"As much as I'd like to lop off yer noggins, I'll 'ave to be satisfied wiv draggin' the two o' ye out into the wilds. Kept ye well outta the way, 'aven't I?"},{"name":"JACKE","text":"...Out with it, then!"},{"name":"PIRATE00154","text":"Gahahahahaha! Ain't it obvious? You stubborn scrags is lookin' to swipe our new toy, an' my job was to stall ye."},{"name":"PIRATE00154","text":"The cap'n 'as the mine wiv 'im right now. 'E's set to show the rest o' the Executioners that 'e's got the stones to sit in the leader's chair!"},{"name":"PIRATE00154","text":"...An' what better way to do that than <span class=\"emphasis\">executin'</span> the bitch what snapped the chains on our crew!"},{"name":"JACKE","text":"He's targetin' the Admiral herself!? ...Yer plannin' to blow up the command room, ain't ye?"},{"name":"PIRATE00154","text":"Aye, you 'ave me permission to panic! 'Course, if ye'd rather steer clear o' the city, I'd be glad to keep ye company right 'ere, sweetmeat! Gahaha!"},{"name":"JACKE","text":"Back to Thalaos, <span class=\"highlight\">Forename</span>. We ain't done with that cacklin' pirate mort just yet..."},{"name":"PIRATE00154","text":"Think ye can stop Cap'n Aisibhir? If ye sprout yerself some wings, then ye might still make it! Gahaha!"},{"name":"JACKE","text":"We've got this mad mort at our mercy, but she seems to be enjoyin' herself... I'd better drag her back to the guild an' see what other information she'll spill."},{"name":"JACKE","text":"I'll need you back in Limsa as well, but ye've business at the Foremast first. Ye should find Captain Milala at her post there."},{"name":"JACKE","text":"Forget about the soddin' challenge an' tell her everythin' we know. Unless me judgment's well off-kilter, she'll do what needs to be done. "},{"name":"JACKE","text":"Have ye been to the Foremast yet? Well, ye'd best get yerself out to middle La Noscea on the bloody double! Milala needs to hear the Executioners' plans!"},{"name":"MILALA","text":"Oh, you're one of Jacke's rogues. ...You've come to steal the Sorrows, have you!?"},{"name":"MILALA","text":"Well, you shan't have them. As you can see, they're safely clasped upon my very own─ Hm? You're not here for the earrings?"},{"name":"MILALA","text":"...The Admiral, you say!? And you are sure these fiends are in possession of the sarcophagus? I must deploy more sentries at once!"},{"name":"MILALA","text":"Do not think this voids our challenge, rogue! And you can relay as much to your impudent guildmaster! ...I suppose you can thank him for the warning, as well."},{"name":"JACKE","text":"...So the 'Jackets are on the move? Bene. I've been listenin' to that addled pirate cackle since I got her back to the Sisters, but she's given us naught what we didn't already know."},{"name":"JACKE","text":"An' we know more'n enough. I say we rally the rogues an' go after that mine...afore it blows up in our muns."},{"name":"JACKE","text":"（★未使用／削除予定★）"}],"reward":{"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":91}],"quests":[65684]},"next":[65691]},"partials":[{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1010261","obj":{"i":1010261,"n":"Jacke","l":34,"q":1}},{"type":"npc","id":"1010265","obj":{"i":1010265,"n":"Bloody Executioner","l":34,"q":1}},{"type":"npc","id":"1010267","obj":{"i":1010267,"n":"Milala","l":30,"q":1}},{"type":"quest","id":"65684","obj":{"i":65684,"n":"Sweet Sorrows","g":132,"l":"Limsa Lominsa","s":250,"f":1}},{"type":"quest","id":"65691","obj":{"i":65691,"n":"Cloying Victory","g":132,"l":"Limsa Lominsa","s":301,"f":1}}]}