{"quest":{"name":"Cloying Victory","location":"Limsa Lominsa","id":65691,"patch":2.4,"sort":301,"icon":100344,"unlocksFunction":1,"eventIcon":71341,"issuer":1009943,"target":1009943,"involved":[1005411,1009945],"genre":132,"journal":["Jacke needs you to join his rogues in the effort to reclaim the Black Sarcophagus.","Jacke has decided that a net of rogues cast over the city is the only way to catch the Reformists before they can go through with their murderous plan. Take up your position at the Aftcastle, and stay vigilant for any signs of Aisibhir and his crew.","Slipping past the vigilant gazes of rogues and Yellowjackets alike, the Reformists manage to reach the Mizzenmast and prime the Black Sarcophagus to explode. With scant moments left until the mine is set to detonate, however, you manage to disable the device and save the city from untold destruction. Aisibhir and his crew are defeated, and the prototype weapon once again safe in the hands of the Yellowjackets.<br><br>As for Milala's challenge, Jacke's keen ears and nimble fingers have allowed the impudent guildmaster to liberate the Silver Sorrows from the ailing and unsuspecting captain. Thus do the rogues end the contest with two of the three treasures, ensuring victory for the guild. Return to the Dutiful Sisters and speak with Jacke.","Appearing glad to see the difficult and lengthy assignment come to an end, Jacke praises your unrelenting dedication to the code. Should you choose to leave the shadows of the underworld, however, he suggests that you devote yourself to a code of your own, and employ your deadly new skills to uphold it. Though your eyes may readjust to the light of day, the lessons learned at the Dutiful Sisters will never leave you."],"objectives":["Keep watch from your position at the Aftcastle.","Speak with Jacke at the Rogues' Guild."],"dialogue":[{"name":"JACKE","text":"If the leader o' the Reformists─this “Captain Aisibhir”─is plannin' on millin' the Admiral with a bang, then my guess is he'll be aimin' to demolish the entire command room."},{"name":"JACKE","text":"Ye know the Mizzenmast, aye? The tower what holds the Drownin' Wench an' Bulwark Hall? The Admiral's Bridge─an' her command room─are right at the top of it."},{"name":"JACKE","text":"Then ye've got the district what surrounds the Mizzenmast─that's the busy beatin' heart o' the city. Even with the threat of an attack, ye can't just seal it up in the blink of an eye an' call the whole thing bob. Try to explain the danger to the culls what live an' work there, an' then ye'd have a frightened, stampedin' mob on yer fambles."},{"name":"JACKE","text":"Nay, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, our only option is to have eyes snilchin' every approach to the tower. I'll put the whid out to as many coves as I can, an' spread 'em through the streets."},{"name":"JACKE","text":"Yer job'll be to cover the Aftcastle. Just wait an' see, <span class=\"highlight\">Forename</span>─we'll get this Aisibhir...an' his little bomb, too!"},{"name":"JACKE","text":"Take up a vantage point at the Aftcastle. One of us'll spot Aisibhir, an' then he'll learn what it means to defy the code!"},{"name":"BOCHARD","text":"Ye all right, then, <span class=\"alternative-container\"><span class=\"alternative\">dove</span><span class=\"alternative\">colt</span></span>? Ye seem set to fly to pieces. But it's times like this that ye most need to calm yer mind, an' keep yer glazes peeled for the small stuff."},{"name":"LONWOERD","text":"（★未使用／削除予定★）"},{"name":"ITOLWANN","text":"The Reformists are planning to blow up the command room!? I'll be sure to keep an eye out for any unusual customers here at the Wench. ...Well, more unusual than usual."},{"name":"JACKE","text":"Ugh, the fog picked a grand night to roll in thick. This'll make things interestin'..."},{"name":"MILALA","text":"Our presence on the streets is far too thin! Where are the reinforcements I ordered!?"},{"name":"YELLOWJACKET00155","text":"My apologies, Captain. There just aren't any more soldiers to spare. The bulk of our forces has already been assigned to guard not only the Admiral, but a number of other high-ranking personnel, as well."},{"name":"MILALA","text":"Unacceptable! What could Commodore Reyner be thinking? There are dangerous criminals stalking the city as we speak!"},{"name":"MILALA","text":"Call in squads from the outposts if you must, but I want to see our security tightened and the populace properly protected!"},{"name":"YELLOWJACKET00155","text":"But, Captain... We can't be certain the pirates' plan hasn't changed. If we consider the possibility that they've switched to a target outside the walls, it would be folly to weaken those defenses..."},{"name":"MILALA","text":"Hmph! You've made your point, Sergeant. Return to your post!"},{"name":"MILALA","text":"Once all is lost, it is far too late to question what one should have done..."},{"name":"MILALA","text":"You seem troubled, sir. Perhaps I can be of assis─"},{"name":"MILALA","text":"Ah!"},{"name":"AISIBHIRSCREW00155","text":"(-Smirking Lalafell-)I've been dyin' to meet you, lass. Aye, keen to set eyes on the bold Yellowbelly what cost our crew a fortune in Ul'dahn coin."},{"name":"MILALA","text":"You... You're an Executioner! One of Aisibhir's men!"},{"name":"AISIBHIRSCREW00155","text":"Ye've strayed too far into a world ye don't understand, lass. Yer eyes is fixed on the light o' justice, leavin' ye blind to the chasm openin' up at yer feet..."},{"name":"AISIBHIRSCREW00155","text":"At least they'll say ye died with yer boots on."},{"name":"AISIBHIRSCREW00155","text":"The Yellowbelly won't be botherin' us no more, Cap'n. As for the mine, the lads'll 'ave it primed in front o' the Wench by the time ye get there."},{"name":"AISIBHIR","text":"Good. Not long now afore we drag that bitch Admiral, her pretty tower, an' all her simperin' curs down to the bottom o' the sea..."},{"name":"AISIBHIR","text":"Then I'll raise our flag on the ruins o' the Mizzenmast, an' lead our brethren in a return to the old ways o' blood an' plunder!"},{"name":"DRUNK00155","text":"Should not've 'ad that lasht bottle... &lt;hiccup&gt; ...Bottlesh? The wife ish gonna... &lt;hiccup&gt; ...kill me..."},{"name":"DRUNK00155","text":"...Eh? What'sh that, then?"},{"name":"MILALA","text":"...Not after...the command room...<br>They mean to bring down...the entire...tower..."},{"name":"MILALA","text":"If the Mizzenmast falls... &lt;gasp&gt; The bridges...will follow... Half the city will..."},{"name":"MILALA","text":"P-Please... You must help me...<br>The danger... Far greater than we..."},{"name":"DRUNK00155","text":"Bloody hells! It'sh alive! Oh no, no, no, I didn't shee nuffin'! Didn't. Shee. <span class=\"emphasis\">Nuffin'</span>!"},{"name":"MILALA","text":"Please! You must...send word..."},{"name":"MILALA","text":"Someone...must be told..."},{"name":"MILALA","text":"You... How did you...?"},{"name":"JACKE","text":"Yer “valiant an' forthright” weapon─ye could hear that single pistol shot from malms away. Weren't hard to guess what'd happened."},{"name":"PERIMUHAURIMU","text":"I poked the Yellowjackets on me way over. A healer'll be along shortly."},{"name":"JACKE","text":"Bene. That means we've only one last thing to do."},{"name":"MILALA","text":"We have never...been allies... But I beg of you..."},{"name":"MILALA","text":"You must... You must stop them! ...Save the city!"},{"name":"JACKE","text":"Ah, lass, ye know ye don't need to ask. Takin' down mad coves an' bitin' back what was bitten is our job."},{"name":"JACKE","text":"You all set, then?"},{"name":"VKEBBE","text":"Ready, Jacke."},{"name":"PERIMUHAURIMU","text":"Always!"},{"name":"JACKE","text":"Then let's go cloy that sarcophagus─an' fit Aisibhir for a new coffin!"},{"name":"MILALA","text":"Status report?"},{"name":"YELLOWJACKET00155","text":"The mine has been disabled, and the engineers should soon have it safely removed."},{"name":"YELLOWJACKET00155","text":"Our soldiers sustained some injuries in the battle with the Reformists, but none were fatal. ...Also, the Admiral sends her sincerest gratitude."},{"name":"MILALA","text":"Hm..."},{"name":"CITIZENB00155","text":"Look, there she is! That's Captain Milala! The hero of Limsa Lominsa!"},{"name":"CITIZENA00155","text":"Are you recovered from your wound, Captain!?"},{"name":"CITIZENB00155","text":"We heard how you very nearly lost your life stopping that horde of pirates from blowing up the Mizzenmast!"},{"name":"CITIZENC00155","text":"Three cheers for the Yellowjackets! Our city'd be lost without ye!"},{"name":"MILALA","text":"But, wait... That's not how it..."},{"name":"MILALA","text":"Sergeant! What of the rogues? Did they survive the battle?"},{"name":"YELLOWJACKET00155","text":"I don't rightly know, Captain... All we found near the sarcophagus were Reformists─either dead or strung from the rafters."},{"name":"MILALA","text":"...Alive, then. 'Twould seem we are deeply in their debt."},{"name":"YELLOWJACKET00155","text":"...Ah, Captain? Might I have the Silver Sorrows from you now? We've been ordered to hand them over to the commodore, along with the Black Sarcophagus."},{"name":"MILALA","text":"Why, of course, they're right h─"},{"name":"MILALA","text":"...The earrings! I could've sworn I was still..."},{"name":"MILALA","text":"&lt;gasp&gt; ...He wouldn't have! He <span class=\"emphasis\">stole</span> them from me while I lay dying!?"},{"name":"MILALA","text":"That...that cad! I <span class=\"emphasis\">knew</span> he was not to be trusted!"},{"name":"MILALA","text":"“Keep an eye on them,” indeed. I should have known..."},{"name":"PERIMUHAURIMU","text":"Are ye sure about this, Jacke? We should've cloyed the sarcophagus as well."},{"name":"JACKE","text":"（★未使用／削除予定★）"},{"name":"JACKE","text":"...Eh, I think she's earned it, don't you? If it bothers ye that much, think of it as a trade."},{"name":"PERIMUHAURIMU","text":"（★未使用／削除予定★） "},{"name":"VKEBBE","text":"&lt;giggle&gt; If ye ask me, they look a bit daft."},{"name":"JACKE","text":"Well, I didn't ask ye!"},{"name":"JACKE","text":"So, the 'Jackets ended up with the mine, an' we got the diamond an' the earrings. Which means... Victory belongs to the Rogues' Guild!"},{"name":"PERIMUHAURIMU","text":"Do ye think Milala'll leave it at that, then? I get the feelin' we ain't done with her yet."},{"name":"JACKE","text":"I'd say we're done with her challenge, but ye never know when our paths'll cross again. We'll just have to see what Limsa's underbelly spits up next."},{"name":"PERIMUHAURIMU","text":"Aye. This city ain't ever quiet for long..."},{"name":"PERIMUHAURIMU","text":"Well, it's been a pleasure workin' with ye, <span class=\"highlight\">Forename</span>! If I ever need a trusty pair o' stabbers by me side, I'll know who to ask!"},{"name":"VKEBBE","text":"I'm off as well. Bloody starvin', I am... Don't forget to yaffle a bite when ye can, eh, <span class=\"highlight\">Forename</span>?"},{"name":"JACKE","text":"We'd best head back to the Sisters, too, afore the shrew decides she'd rather hear us cry cockles."},{"name":"JACKE","text":"Bene work, <span class=\"highlight\">Forename</span>. Be seein' ye soon."},{"name":"JACKE","text":"Ho there, <span class=\"highlight\">Forename</span>. It'll be nice to finally have a bit of a rest, eh? The job never ends, but even a dimber damber like meself needs to breathe every now an' again."},{"name":"JACKE","text":"An' yer 'venturin' mates must be wonderin' where ye've got to! That was a proper long assignment, but I'm glad ye decided to see it through."},{"name":"JACKE","text":"Ye've proven to be a stalwart protector o' the code...even if this ain't truly yer world. When ye walk back into the lightmans, ye'll have to find yer own code to uphold."},{"name":"JACKE","text":"An' when ye do, ye'll have the skills ye learned in the shadows to help ye defend it."},{"name":"JACKE","text":"Well, that's more'n enough prittle prattle out o' me. Yer travels might take ye far an' wide, <span class=\"highlight\">Forename</span>, but know yer always welcome here at the Sisters!"},{"name":"QIB","text":"Defeat the Reformists, and prevent the explosion!"},{"name":"QIB","text":"Destroy detonators"},{"name":"QIB","text":"Find and destroy the detonators before time runs out!"},{"name":"QIB","text":"Defeat the Reformists!"},{"name":"JACKE","text":"Make for the Mizzenmast an' find Aisibhir!"},{"name":"JACKE","text":"<span class=\"highlight\">Forename</span>, mill all them detonators!<br>We'll keep these coves busy!"},{"name":"JACKE","text":"The bomb! We're too late..."},{"name":"JACKE","text":"That's the bomb taken care of, then.<br>Now these bastards get our full attention!"},{"name":"JACKE","text":"The job... We was almost done..."},{"name":"JACKE","text":"Bene!<br>Ye know how I hate trackin' down stragglers!"},{"name":"PERIMU","text":"So many of 'em...<br>I think their whole bloody crew is here!"},{"name":"PERIMU","text":"Find an' smash them detonators!<br>Check the ramps goin' up, an' goin' down!"},{"name":"PERIMU","text":"The light on the mine went out!"},{"name":"PERIMU","text":"Try not to trip...over me quarron..."},{"name":"VKEBBE","text":"What!? That's it, then!?"},{"name":"VKEBBE","text":"<span class=\"highlight\">Forename</span>'s disabled the sarcophagus!"},{"name":"VKEBBE","text":"I guess I have...gotten soft..."},{"name":"BOSS","text":"Ye can't stop us now, scrags!<br>Only three minutes until the show begins!"},{"name":"BOSS","text":"Damn you rogues an' yer swivin' code!<br>I'll have yer bloody 'eads for this!"},{"name":"BOSS","text":"This wasn't...part o' me plan...<br>I could've been a king among pirates..."}],"reward":{"items":[{"id":8664},{"id":3100,"one":1},{"id":2753,"one":1},{"id":3597,"one":1},{"id":3827,"one":1},{"num":3,"id":5825,"one":1}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":91}],"quests":[65690]},"next":[65748]},"partials":[{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1005411","obj":{"i":1005411,"n":"I'tolwann","l":28,"q":5}},{"type":"npc","id":"1009945","obj":{"i":1009945,"n":"Bochard","l":1427,"q":1}},{"type":"item","id":"8664","obj":{"i":8664,"n":"Steel Knives","l":30,"c":33818,"t":84,"p":2691}},{"type":"item","id":"3100","obj":{"i":3100,"n":"Toadskin Jacket","l":30,"c":43085,"t":35,"p":3123}},{"type":"item","id":"2753","obj":{"i":2753,"n":"Steel Sallet","l":30,"c":40035,"t":34,"p":2523}},{"type":"item","id":"3597","obj":{"i":3597,"n":"Toadskin Armguards","l":30,"c":48329,"t":37,"p":2242}},{"type":"item","id":"3827","obj":{"i":3827,"n":"Toadskin Leg Guards","l":30,"c":46323,"t":38,"p":2563}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65690","obj":{"i":65690,"n":"Market for Death","g":132,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"65748","obj":{"i":65748,"n":"Peasants by Day, Ninjas by Night","g":152,"l":"Limsa Lominsa","s":1,"f":1}}]}