{"quest":{"name":"A Crisis of Confidence","location":"Gridania","id":65704,"patch":2.0,"sort":250,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000162],"genre":136,"usedItems":[5371],"journal":["Something appears to be troubling Timbermaster Beatin...","Though he did not choose to confide in you, something is clearly troubling Beatin. For now, he has asked you to attend to the younglings in the Acorn Orchard.","Nicoliaux is certain that Beatin is experiencing a sudden dearth of creativity. Until the timbermaster finds a new source of inspiration, Nicoliaux fears he will remain morose and uninteresting. Craft and bring Beatin a length of high-quality walnut lumber to deliver him from his depression.","Just as Nicoliaux intended, Beatin is struck by the seemingly infinite uses to which he might put your high-quality walnut lumber. Recalling an old friend who once aided him in similar fashion, he thanks you for your help, before reminding you that he expects nothing less than the best from one with your undoubted talent.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 30."],"objectives":["Speak with Nicoliaux.","Deliver a length of walnut lumber <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Beatin."],"dialogue":[{"name":"BEATINE","text":"... &lt;sigh&gt;"},{"name":"BEATINE","text":"Oh, <span class=\"highlight\">Forename</span>. You look well. If you have come in search of work, I fear I have nothing to offer."},{"name":"BEATINE","text":"Though...if you have no other pressing responsibilities, you might consider spending some time with the younglings in the Acorn Orchard."},{"name":"BEATINE","text":"The workshop has demanded my full attention of late, and I have been unable to see to them myself."},{"name":"BEATINE","text":"...That will be all, <span class=\"highlight\">Forename</span>."},{"name":"NICOLIAUX","text":"Hey, you're one of those adventurers that joined the guild!"},{"name":"NICOLIAUX","text":"Beatin's down in the dumps, is he? No wonder he hasn't visited in <span class=\"emphasis\">ages</span>."},{"name":"NICOLIAUX","text":"I've seen him like this before. I'll bet it's because he can't think of anything new to make."},{"name":"NICOLIAUX","text":"He's no fun when he's like this. I prefer it when he's waving his saw around and threatening to tie his useless new apprentices to Figaga's Gift and─"},{"name":"NICOLIAUX","text":"Wait, I know! You're a pretty good carpenter, right?"},{"name":"NICOLIAUX","text":"Then you can make high-quality walnut lumber!"},{"name":"NICOLIAUX","text":"You know how he's always saying stuff like, “You must <span class=\"emphasis\">KNOW</span> the wood,” and all that? Well, I bet if we gave him some really <span class=\"emphasis\">good</span> wood, it'd cheer him up in no time!"},{"name":"NICOLIAUX","text":"I know it sounds a bit strange, but then he <span class=\"emphasis\">is</span> a bit strange, isn't he? And we have to try <span class=\"emphasis\">something</span>! I miss the mean old Beatin!"},{"name":"SYSTEM","text":"Increasing an item's <span class=\"highlight\">quality</span> during synthesis improves the chance that the resulting product will be of a higher grade (<span class=\"highlight\">HQ</span>)."},{"name":"SYSTEM","text":"To be deleted."},{"name":"BEATINE","text":"...Leave me be, <span class=\"highlight\">Forename</span>. I must focus."},{"name":"BEATINE","text":"What is this malaise which plagues me? I thought myself resolute as an iron lance, and yet..."},{"name":"BEATINE","text":"...Hm?"},{"name":"BEATINE","text":"Yes...I feel it. <span class=\"emphasis\">I feel it</span>! This high-quality walnut lumber, it is your handiwork, is it not?"},{"name":"BEATINE","text":"Dense, durable, and expertly finished. There is no doubting your skill, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"Walnut furniture was once quite popular in Ul'dah...mayhap we could revive that tradition..."},{"name":"BEATINE","text":"Or, better yet, produce a sturdier base for a new vamplate design..."},{"name":"BEATINE","text":"The possibilities are endless! Thanks to you, <span class=\"highlight\">Forename</span>, it seems I am now paralyzed with indecision."},{"name":"BEATINE","text":"How you have grown, and in so short a time. You remind me of a dear friend, another soul possessed of great passion. Though we walked different paths, we pushed each other to give nothing less than our utmost."},{"name":"BEATINE","text":"He even helped me through those times when inspiration failed me. I see much of him in you─and so I know I can hold you to the same high standards. Return to your work, <span class=\"highlight\">Forename</span>...and do not disappoint me."}],"reward":{"gil":557,"items":[{"id":2332},{"id":2731,"one":1},{"id":3065,"one":1},{"id":3575,"one":1},{"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":9}],"quests":[65678]},"next":[65705]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000162","obj":{"i":1000162,"n":"Nicoliaux","l":52,"q":5}},{"type":"item","id":"2332","obj":{"i":2332,"n":"Initiate's Claw Hammer","l":24,"c":35052,"t":13,"p":1225}},{"type":"item","id":"2731","obj":{"i":2731,"n":"Silver Magnifiers","l":25,"c":40895,"t":34,"p":1314}},{"type":"item","id":"3065","obj":{"i":3065,"n":"Initiate's Gown","l":24,"c":42034,"t":35}},{"type":"item","id":"3575","obj":{"i":3575,"n":"Velveteen Halfgloves","l":24,"c":44027,"t":37,"p":902}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5371","obj":{"i":5371,"n":"Walnut Lumber","l":25,"c":22456,"t":50,"p":219}},{"type":"quest","id":"65678","obj":{"i":65678,"n":"The Lance's Lesson","g":136,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"65705","obj":{"i":65705,"n":"Between Captain and Conjurer","g":136,"l":"Gridania","s":300,"f":1}}]}