{"quest":{"name":"Between Captain and Conjurer","location":"Gridania","id":65705,"patch":2.0,"sort":300,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000125,1000235],"genre":136,"usedItems":[2015],"journal":["Timbermaster Beatin has a special commission for you.","Word of your craftsmanship has spread, and a client has requested you by name. Prepare a walnut cane of the highest quality and present it to Beatin for inspection.","Beatin decrees that the cane will satisfy your client. Look for him at the Adders' Nest and deliver the cane.","The client, Gairhard, is having difficulty earning the trust of a conjurer newly assigned to his unit. In an effort to show her that some outsiders mean no harm, and wish only to help, he commissioned you to make the cane. He asks you to deliver it to Ponette at Stillglade Fane on his behalf.","Ponette is deeply moved by the walnut cane. She apologizes for judging outsiders so harshly and acknowledges the contribution made by individuals like Captain Gairhard and yourself to Gridania's cause. Return to the Adders' Nest and inform the captain of the conjurer's change of heart.","Captain Gairhard congratulates you on a job well done, noting that Beatin was right to favor you. Return to the timbermaster and inform him that the commission is complete.","The timbermaster's pleasure at the news of your success is matched only by his surprise at the revelation that your client was in fact an old friend of his, back from a long campaign abroad. Though puzzled by Gairhard's failure to inform him of his return, Beatin is nonetheless relieved to hear that he is in good health.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 35."],"objectives":["Present a walnut cane <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Beatin.","Deliver the walnut cane <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Gairhard.","Deliver the walnut cane <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Ponette.","Report to Gairhard.","Report to Beatin."],"dialogue":[{"name":"BEATINE","text":"It is good you have come, <span class=\"highlight\">Forename</span>. Your talents are needed for a commission."},{"name":"BEATINE","text":"The client asked for you by name, in fact."},{"name":"BEATINE","text":"It would seem that the adventurer-turned-carpenter has earned <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> a reputation."},{"name":"BEATINE","text":"You are to craft a walnut cane of unparalleled quality. When it is ready, bring it to me."},{"name":"BEATINE","text":"I will not permit you to deliver anything less than perfection."},{"name":"BEATINE","text":"Have you made the cane, <span class=\"highlight\">Forename</span>?"},{"name":"BEATINE","text":"..."},{"name":"BEATINE","text":"You've done well, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"The gentle curve of the crook appears natural, as if it was destined to take such a shape."},{"name":"BEATINE","text":"Indeed, your skillful application of growth formula has imbued this cane with new life, giving it the appearance of unworked wood."},{"name":"BEATINE","text":"Wands and canes are perhaps the purest expression of the carpenter's creed, in that the finished product is a celebration of the wood's past life."},{"name":"BEATINE","text":"Conjurers are, of course, highly attuned to the natural world. Hence it is no small coup to craft a cane that satisfies."},{"name":"BEATINE","text":"But your cane should meet with the client's approval. You may go and deliver it to him at the Adders' Nest."},{"name":"GAIRHARD","text":"Yes, I am waiting for a carpenter from the guild. Why do you ask?"},{"name":"GAIRHARD","text":"So this is Beatin's famed disciple... It pleases me that I can finally put a face to the name. I am Gairhard."},{"name":"GAIRHARD","text":"Though I myself have no talent for conjury, it is plain to see that this cane is exquisitely wrought."},{"name":"GAIRHARD","text":"Aye, the cane is not for me. It is meant for a conjurer recently assigned to my unit."},{"name":"GAIRHARD","text":"Her name is Ponette, a talented but stubborn soul who has thus far resisted my every attempt to integrate her into our ranks."},{"name":"GAIRHARD","text":"I have been here long enough to know that Gridanians can be rather protective of their city, and that this can manifest itself in a deep mistrust of outsiders."},{"name":"GAIRHARD","text":"However, I cannot simply order her to set aside her prejudices─I need her to trust me of her own volition."},{"name":"GAIRHARD","text":"It is my hope that by giving her this cane, she will at least accept my leadership."},{"name":"GAIRHARD","text":"You will find her in Stillglade Fane. Please give it to her on my behalf."},{"name":"GAIRHARD","text":"Please deliver the cane to Ponette on my behalf. You will find her in Stillglade Fane."},{"name":"PONETTE","text":"How long does the captain intend to keep me waiting? Does he have any idea how little time a conjurer has to spare?"},{"name":"PONETTE","text":"A <span class=\"emphasis\">gift</span>!? That Ala Mhigan kept me waiting this long for some trinket he did not even see fit to deliver himself? Typical. These foreigners truly don't have the first idea about─"},{"name":"PONETTE","text":"&lt;gasp&gt;"},{"name":"PONETTE","text":"Gods! It can't be... A walnut cane!?"},{"name":"PONETTE","text":"And one so finely wrought that I scarce believe it man-made."},{"name":"PONETTE","text":"To conjurers, our canes are the physical representation of our connection with the living world. They provide a focus for us to channel the forces of nature and weave spells."},{"name":"PONETTE","text":"To possess a cane made of walnut is a dream most conjurers share. And I am no different. I see the beauty of this cane, and the heart of the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who made it."},{"name":"PONETTE","text":"That an outsider could craft this flawless cane..."},{"name":"PONETTE","text":"I..."},{"name":"PONETTE","text":"Forgive my impropriety, adventurer. I have never paid outsiders any mind, imagining them incapable of comprehending Gridanian tradition."},{"name":"PONETTE","text":"Yet it seems that it was I who failed to comprehend. You have humbled me, adventurer, and opened my eyes."},{"name":"PONETTE","text":"It is clear that you have worked hard to learn our ways...as has Captain Gairhard. I cannot thank you both enough. Though I do not deserve this cane, I swear that I will do my utmost to earn it."},{"name":"PONETTE","text":"My thanks again, adventurer. Should you meet with the captain before I do, please convey my gratitude."},{"name":"PONETTE","text":"Thank you again, adventurer. Though I do not deserve this cane, I will do my utmost to earn it. Should you meet with the captain before I do, please convey my gratitude."},{"name":"GAIRHARD","text":"I knew it would not be easy pleasing her, but I never doubted that Beatin's finest could deliver."},{"name":"GAIRHARD","text":"Heh, I wonder...how is he? Still working too hard, I presume?"},{"name":"GAIRHARD","text":"So it goes. Anyway, duty calls. Thank you again, <span class=\"highlight\">Forename</span>. Please give my regards to the timbermaster."},{"name":"BEATINE","text":"Welcome back, <span class=\"highlight\">Forename</span>. Was the client satisfied?"},{"name":"BEATINE","text":"Interesting. So the client was not a conjurer himself..."},{"name":"BEATINE","text":"In any case, I am glad to hear that the intended recipient was satisfied."},{"name":"BEATINE","text":"I must know, <span class=\"highlight\">Forename</span>: who was this client? I only received their messenger, and I cannot fathom why they would not come in person."},{"name":"BEATINE","text":"...Gairhard!? You are certain?"},{"name":"BEATINE","text":"I thought him far from Gridania, on campaign. When did he return? And why would he not greet me in person?"},{"name":"BEATINE","text":"We have known each other for so many years... Well, I can only assume that his duties leave no time for such niceties. I am glad to hear he is home and well."},{"name":"BEATINE","text":"Thank you for attending to his request, <span class=\"highlight\">Forename</span>. I look forward to our next meeting."}],"reward":{"gil":639,"items":[{"id":2320},{"id":2750,"one":1},{"id":3104,"one":1},{"id":3583,"one":1},{"num":6,"id":5824,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":9}],"quests":[65704]},"next":[66072]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000125","obj":{"i":1000125,"n":"Gairhard","l":52,"q":4}},{"type":"npc","id":"1000235","obj":{"i":1000235,"n":"Ponette","l":53,"q":1}},{"type":"item","id":"2320","obj":{"i":2320,"n":"Iron Chocobotail Saw","l":28,"c":35005,"t":12,"p":2544}},{"type":"item","id":"2750","obj":{"i":2750,"n":"Velveteen Beret","l":29,"c":41032,"t":34}},{"type":"item","id":"3104","obj":{"i":3104,"n":"Velveteen Gown","l":30,"c":42071,"t":35,"p":2499}},{"type":"item","id":"3583","obj":{"i":3583,"n":"Velveteen Shortgloves","l":28,"c":44081,"t":37,"p":1453}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"2015","obj":{"i":2015,"n":"Walnut Cane","l":29,"c":32604,"t":9,"p":3586}},{"type":"quest","id":"65704","obj":{"i":65704,"n":"A Crisis of Confidence","g":136,"l":"Gridania","s":250,"f":1}},{"type":"quest","id":"66072","obj":{"i":66072,"n":"Growing Apart","g":136,"l":"Gridania","s":350,"f":1}}]}