{"quest":{"name":"With Open Arms","location":"Ul'dah","id":65703,"patch":2.0,"sort":10,"eventIcon":71221,"issuer":1007621,"target":1007621,"involved":[1001297,1001692,1001693,1001697,1001698],"genre":93,"journal":["Juliana of the Weavers' Guild finds herself at a troubling loss for manpower.","A gathering of Ul'dah's elite has brought an influx of orders that has thrown the Weavers' Guild into chaos. You have been asked to venture forth and /welcome any would-be workers to aid in this tumultuous time. First, practice your /welcome on Juliana.","Impressed with your display, Juliana has granted you leave to find her more employees. Use your warmest /welcome beyond the walls of the Weavers' Guild to recruit any help there is to be had.","Your inviting gestures were enough to entice at least two passersby to consider taking up the needle for the guild. Return to Juliana and see what she has to say.","Despite only being able to gather two more for the effort, Juliana seems well glad of extra help. The able bodies you have recruited are sure to prove invaluable to the Weavers' Guild."],"objectives":["Show Juliana your best /welcome.","Seek out any would-be weavers and give them a warm /welcome.","Report back to Juliana at the Weavers' Guild."],"dialogue":[{"name":"JULIANA","text":"If it is work you seek, the Weavers' Guild welcomes you. Indeed, your timing is impeccable. A soirée is to be held with all of Ul'dah's elite in attendance. "},{"name":"JULIANA","text":"Once the invites went out, the orders came in, and that with a fury. Every lord and lady from Cape Deadwind to the Cinderfoot is demanding the latest fineries."},{"name":"JULIANA","text":"I need hands, and I need them now. Yet I cannot spare the time to go off in search of them."},{"name":"JULIANA","text":"Would you care to aid us, friend? I ask no more than you <span class=\"highlight\">welcome</span> to our doors any willing souls you might find."},{"name":"JULIANA","text":"Come, let us see how you fare. Show me your warmest <span class=\"highlight\">welcome</span>."},{"name":"JULIANA","text":"Come, let us see how you fare. Show me your warmest <span class=\"highlight\">welcome</span>."},{"name":"JULIANA","text":"Excellent! I daresay I would work for you myself. Now hurry off! We need those people!"},{"name":"JULIANA","text":"No, no, that simply will not serve. Come now, show me your warmest <span class=\"highlight\">welcome</span>."},{"name":"BIBICHUA","text":"So, the weavers need help, do they? Sorry, friend, I'm all set for coin."},{"name":"BIBICHUA","text":"Fancy my garb, do you? And well you should. It's all the latest rage."},{"name":"ESDELINE","text":"Work at the Weavers' Guild? Hmmm... I'd be lying if I said I weren't interested. To whom might I go to inquire further?"},{"name":"ESDELINE","text":"We Ul'dahns have a weakness for fashion. Why, just look at me─I've taken the trouble to match my wrap to my hair. Ravishing, no?"},{"name":"JELLION","text":"The weavers are recruiting!? Finally, my chance to become a famous designer!"},{"name":"JELLION","text":"Gods, I can hardly contain myself thinking of the new dresses that will be at that party. Would that I were invited..."},{"name":"SOSOTTA","text":"I appreciate the offer, but I must refuse. I'm all thumbs when it comes to stitching and whatnot."},{"name":"SOSOTTA","text":"Are you looking for a model? Oh, you naughty <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! Flattery will get you <span class=\"emphasis\">everywhere</span>, hee hee."},{"name":"LURKINGREECH","text":"Weavin' work? Take a look at me, friend. I'm a bloody guard, and on duty, no less! Move along, now."},{"name":"LURKINGREECH","text":"What? What do you want? I've no time for your shenanigans. You're gettin' in my bloody way. Now, piss off!"},{"name":"JULIANA","text":"You've returned! Well, how did you fare?<br>...Two potential recruits, you say? Welcome news! I only hope their zeal for fashion will show in their efforts for the guild."},{"name":"JULIANA","text":"What we do here may seem all silk and satin, to be sure, but the work within these walls is far from easy. In that, I suppose our trade is not unlike any other."}],"reward":{"gil":102,"xp":50}},"partials":[{"type":"npc","id":"1007621","obj":{"i":1007621,"n":"Juliana","l":41,"q":1}},{"type":"npc","id":"1001297","obj":{"i":1001297,"n":"Bibichua","l":41,"q":1}},{"type":"npc","id":"1001692","obj":{"i":1001692,"n":"Esdeline","l":41,"q":1}},{"type":"npc","id":"1001693","obj":{"i":1001693,"n":"Jellion","l":41,"q":1}},{"type":"npc","id":"1001697","obj":{"i":1001697,"n":"Sosotta","l":41,"q":2}},{"type":"npc","id":"1001698","obj":{"i":1001698,"n":"Lurking Leech","l":41,"q":1}}]}