{"quest":{"name":"So You Want to Be a Lancer","location":"Old Gridania","id":65716,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000251,"target":1000251,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"JILLIAN","text":"Welcome to the Lancers' Guild, adventurer."},{"name":"JILLIAN","text":"If you seek to refine your skills with the polearm, then you have come to the right place."},{"name":"JILLIAN","text":"Here at the Lancers' Guild, spear wielders gather to train with one another, and further hone their abilities under the tutelage of our fine instructors. Do you seek membership with us?"},{"name":"Q1","text":"Do you wish to join the Lancers' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"JILLIAN","text":"I see. It would seem you are already occupied with other pursuits."},{"name":"JILLIAN","text":"In which case, you have no further business here. Please be on your way."},{"name":"JILLIAN","text":"While your enthusiasm is commendable, you are yet a stripling among adventurers."},{"name":"JILLIAN","text":"You must gain more experience before you can be considered for a place within these halls. Return here again once you have done so."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"JILLIAN","text":"Very well. I shall provide you with an insight into the history of our guild."},{"name":"JILLIAN","text":"More than just an instrument of war, the spear is also a tool for hunting, and with game ever plentiful in the Twelveswood, the weapon has been the mainstay of the locals here since before the founding of Gridania."},{"name":"JILLIAN","text":"With the passing of time, our nation became a gathering place for spearmasters from across the realm─many eager to test their mettle against the famed might of our Wood Wailers."},{"name":"JILLIAN","text":"And it was here in Gridania that their myriad fighting styles came into contact, eventually giving rise to the art taught here today."},{"name":"JILLIAN","text":"That spear technique could be formalized at all owed much to the founding of the Lancers' Guild by Wood Wailer captain Mistalle nigh on a century past."},{"name":"JILLIAN","text":"The tradition of accepting students from without as well as within Gridania's borders persists to this day, ensuring that the art of the polearm may not only survive, but also continue to evolve."},{"name":"JILLIAN","text":"Well, there you have it. I hope this brief history of the guild has helped settle any doubts in your mind."},{"name":"JILLIAN","text":"The Lancers' Guild is always eager to welcome new initiates."},{"name":"JILLIAN","text":"If you've a will to enlist, speak with me again and we can begin the enrollment procedures."}],"reward":{"job":4},"next":[65668]},"partials":[{"type":"npc","id":"1000251","obj":{"i":1000251,"n":"Jillian","l":53,"q":5,"t":"Guild Receptionist"}},{"type":"quest","id":"65668","obj":{"i":65668,"n":"Way of the Lancer","g":130,"l":"Gridania","s":10,"f":1}}]}