{"quest":{"name":"So You Want to Be a Conjurer","location":"Old Gridania","id":65718,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000323,"target":1000323,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"MADELLE","text":"Well met, adventurer. You are come to Stillglade Fane, home of the Conjurers' Guild."},{"name":"MADELLE","text":"We conjurers harness the powers of earth, wind, and water that abound in nature, and thereby weave spells of healing and protection."},{"name":"MADELLE","text":"Ever do we seek noble souls to initiate into our mysteries. Might you be such a soul, come to join the guild?"},{"name":"Q1","text":"Do you wish to join the Conjurers' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MADELLE","text":"My apologies. No doubt you wish to remain wholly dedicated to your current pursuit."},{"name":"MADELLE","text":"Yet should ever you long to become one with all creation, I invite you to return here. It is never too late to the learn about the forces that surround us."},{"name":"MADELLE","text":"While your zeal cannot be denied, you are yet wanting for experience as an adventurer."},{"name":"MADELLE","text":"I recommend that you first deepen your acquaintance with your chosen discipline. Fear not─even having done so, there will yet be time for you to learn about the forces that surround us."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"MADELLE","text":"Then allow me to provide you with an overview of what it is to be a conjurer."},{"name":"MADELLE","text":"Conjury is the art of healing and purification. Its practitioners harness the power of nature, that they might bring about change in the form of spells."},{"name":"MADELLE","text":"Primitive magic such as that once wrought by individuals known as mages─meaning those with the ability to manipulate aether─has existed since the dawn of time."},{"name":"MADELLE","text":"It was not until some five centuries ago that conjury emerged from this shapeless agglomeration of spells and charms─an event which led to the founding of Gridania."},{"name":"MADELLE","text":"In those dark days, the elementals would not suffer man's presence in the Twelveswood, forcing our forebears to make their homes beneath the earth, in the great subterranean city of Gelmorra."},{"name":"MADELLE","text":"But their desire to settle in the Twelveswood continued to burn fiercely; time and again they sought to curry the elementals' favor."},{"name":"MADELLE","text":"Unlike men and other creatures bound in temples of flesh, the elementals are beings of pure aether. Recognizing this, the mages of eld reasoned that their talent for aetheric manipulation might allow them to commune with these theretofore enigmatic entities."},{"name":"MADELLE","text":"It took five long decades, but our forebears finally succeeded. Their reward: the elementals' permission to dwell in the Twelveswood. So it was that the nation of Gridania was born."},{"name":"MADELLE","text":"Since that time, the elementals have taught us to live as one with nature, speaking to all Gridanians through the Hearers─those mages who are able to commune with them."},{"name":"MADELLE","text":"And for their intimacy with the elementals, the Hearers would go on to attain greater mastery over the forces of nature. Thus did they conceive the art of conjury."},{"name":"MADELLE","text":"...And that, my most attentive listener, is a brief history of conjury."},{"name":"MADELLE","text":"If you have a mind to walk our path, I wholeheartedly recommend you join our guild."},{"name":"MADELLE","text":"It would be my pleasure to explain the initiation process to you. Pray speak with me again when you are ready."}],"reward":{"job":6},"next":[65669]},"partials":[{"type":"npc","id":"1000323","obj":{"i":1000323,"n":"Madelle","l":53,"q":4,"t":"Guild Receptionist"}},{"type":"quest","id":"65669","obj":{"i":65669,"n":"Way of the Conjurer","g":133,"l":"Gridania","s":10,"f":1}}]}