{"quest":{"name":"So You Want to Be a Thaumaturge","location":"Ul'dah - Steps of Nald","id":65719,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1002279,"target":1002279,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"YAYAKE","text":"Welcome to the Thaumaturges' Guild. It is fate that has guided your steps here, friend."},{"name":"YAYAKE","text":"Within these hallowed halls, the arts of devastation are taught─primeval magicks with which to bring about an enemy's ruin."},{"name":"YAYAKE","text":"If you would join our ranks and wield the power of thaumaturgy, I urge you to seize this moment and confide in me your arcane ambitions."},{"name":"Q1","text":"Do you wish to join the Thaumaturges' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"YAYAKE","text":"Your denial is most unsettling!"},{"name":"YAYAKE","text":"Ah, but I see the stars were not yet aligned. Your time will come, and I shall be waiting."},{"name":"YAYAKE","text":"...I fear my words of destiny and desire were spoken in haste. Your aura bespeaks a certain...unpreparedness, as if your spirit is reluctant to abandon a path yet freshly begun."},{"name":"YAYAKE","text":"Pray continue down that path until a fork presents itself. Perhaps the choice you then make shall lead you back to the gates of thaumaturgy."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"YAYAKE","text":"Yes. There truly was no other answer, was there? Lean closer now, and I shall whisper to you of thaumaturgy's beginnings."},{"name":"YAYAKE","text":"The nation of Ul'dah inherited its traditions from ancient Belah'dia, a city founded by the descendants of the first mages."},{"name":"YAYAKE","text":"The secrets of these illustrious sorcerers were ultimately entrusted to the priests of the Order of Nald'thal, who have passed them down from generation to generation ever since."},{"name":"YAYAKE","text":"Focused and refined over centuries of use in the Order's funereal rites, the arcane magicks of our ancestors eventually emerged as the art we now know as thaumaturgy."},{"name":"YAYAKE","text":"A freezing blizzard to halt corruption; a raging fire to cleanse the corpse; a bolt of lightning to expel the sins of mortal life... The dweomers employed in the preparation of the dead are equally efficacious when applied to the living."},{"name":"YAYAKE","text":"Thus does our guild thrive in the depths of Arrzaneth Ossuary─a sanctuary devoted to Thal, the divine arbiter of the afterlife."},{"name":"YAYAKE","text":"What say you, then, adventurer? If you would plumb the abyssal depths of thaumaturgy, let our learned sages guide your descent!"},{"name":"YAYAKE","text":"Ah, but before you leap into the darkness, you must prove to our guildmasters that you are possessed of the spiritual fortitude necessary to look upon that which waits therein."},{"name":"YAYAKE","text":"When you are ready to submit to the judgment of our most eminent mages, say the word."}],"reward":{"job":7},"next":[65880]},"partials":[{"type":"npc","id":"1002279","obj":{"i":1002279,"n":"Yayake","l":40,"q":9,"t":"Guild Receptionist"}},{"type":"quest","id":"65880","obj":{"i":65880,"n":"Way of the Thaumaturge","g":134,"l":"Ul'dah","s":10,"f":1}}]}