{"quest":{"name":"So You Want to Be an Archer","location":"New Gridania","id":65717,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000197,"target":1000197,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"ATHELYNA","text":"Greetings, adventurer, and welcome to the Archers' Guild."},{"name":"ATHELYNA","text":"It is here that archers the realm over gather to master the bow. We engage the enemy from a distance, ever seeking to alter the course of battle with a single, well-placed arrow."},{"name":"ATHELYNA","text":"If you have a mind to become an archer, then you have come to the right place. Do you wish to join our ranks?"},{"name":"Q1","text":"Join the Archers' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"ATHELYNA","text":"A pity. You might do well among us."},{"name":"ATHELYNA","text":"No doubt you wish to focus on your current discipline─a commendable attitude. Should you ever crave a new challenge, though, know that you are always welcome here."},{"name":"ATHELYNA","text":"While your enthusiasm cannot be faulted, it seems you still have much and more to learn about adventuring."},{"name":"ATHELYNA","text":"I suggest you focus on your current pursuit for a time. Let us speak again once you have cut your teeth as an adventurer."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"ATHELYNA","text":"Marvelous! Then allow me to enlighten you on the history of both our art and the guild."},{"name":"ATHELYNA","text":"The bow is an ancient tool that has existed since before our fair nation came into being. As an implement of war and hunting both, it protects us from our enemies even as it keeps us fed and clothed."},{"name":"ATHELYNA","text":"Archery as practiced in Gridania was born of two distinct styles of bowmanship."},{"name":"ATHELYNA","text":"The first was devised by the longbow sentries of the Elezen who once ruled the lowlands, while the second belonged to the shortbow hunters of the formerly nomadic Miqo'te. As you will doubtless be aware, both races ultimately came to call the Twelveswood home."},{"name":"ATHELYNA","text":"Though the two peoples began as rivals, they gradually learned to live together in harmony."},{"name":"ATHELYNA","text":"During this time, they learned from one another, their two schools of archery intermingling to give birth to the art as it is known today. Ah, but this wouldn't have been possible were it not for the Trappers' League."},{"name":"ATHELYNA","text":"The guild was established in order to promote sustainable hunting and cooperation within the hunting fraternity at large. As a happy consequence of this union, the guild's members came to engage in friendly contests of skill."},{"name":"ATHELYNA","text":"Inspired by such competitions, a handful of their number began to focus on perfection as opposed to mere practicality, transforming a skill into what may be termed an art. These individuals would go on to form a guild of their own."},{"name":"ATHELYNA","text":"Aye, the Archers' Guild, where men and women gather to attain mastery over the bow. More than a few members of the Gods' Quiver loosed their first arrow within these very halls."},{"name":"ATHELYNA","text":"...And that, my friend, is a brief history of archery in Gridania. Doubtless you are more eager than ever to take up the bow."},{"name":"ATHELYNA","text":"It would be my pleasure to recommend you to our guildmaster─you must receive her permission if you are to join us."},{"name":"ATHELYNA","text":"If you would excuse me a moment, I shall see to it that the relevant lists are amended. Pray speak to me again in a short while."}],"reward":{"job":5},"next":[65667]},"partials":[{"type":"npc","id":"1000197","obj":{"i":1000197,"n":"Athelyna","l":52,"q":4,"t":"Guild Receptionist"}},{"type":"quest","id":"65667","obj":{"i":65667,"n":"Way of the Archer","g":131,"l":"Gridania","s":10,"f":1}}]}