{"quest":{"name":"So You Want to Be a Pugilist","location":"Ul'dah - Steps of Nald","id":65714,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1001286,"target":1001286,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"GAGARUNA","text":"Greetings and welcome to the Pugilists' Guild!"},{"name":"GAGARUNA","text":"We pugilists are specialists in hand-to-hand combat. Through rigorous training, we forge devastating weapons of our fists and feet, which we employ to great effect in battle."},{"name":"GAGARUNA","text":"There is no better place in all the realm to train in our discipline than here. If you would walk the path of the pugilist, I highly recommend you add your name to our roll. What say you, friend?"},{"name":"Q1","text":"Join the Pugilists' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"GAGARUNA","text":"That is truly a shame. I could see you doing quite well among us."},{"name":"GAGARUNA","text":"Should you have a change of heart, I invite you return here."},{"name":"GAGARUNA","text":"Hmmm... Looking closely at your physique, it would seem you are still somewhat...<span class=\"emphasis\">soft</span>."},{"name":"GAGARUNA","text":"I'm afraid the guild requires a basic level of fitness in its recruits. You must condition your body further before you can join us."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"GAGARUNA","text":"A decision you'll not regret! But before we proceed to the paperwork, it is essential that you know something of our guild's storied past."},{"name":"GAGARUNA","text":"Since time immemorial, man has used whatever has been at his disposal to settle disputes. In the beginning, that meant fighting with his fists. Such hand-to-hand combat existed in various forms throughout Eorzea, each evolving independently of one another."},{"name":"GAGARUNA","text":"The origins of pugilism as we know it, however, can be traced back to the staging of bare-handed bouts at the Coliseum. These contests attracted fighters from far and wide, bringing their myriad styles crashing together on the bloodsands."},{"name":"GAGARUNA","text":"Amidst this chaotic intermingling of styles, there rose a pugilist of singular strength and skill. This woman made it her life's mission to master every form she encountered, that she might refine her art."},{"name":"GAGARUNA","text":"Among her many song-worthy exploits, we pugilists remember her participation in a gladiator tournament most fondly. Back when bare-handed fighting was still seen as a pastime for peasants, she took on fully armed and armored gladiators, and effortlessly bested the lot of them."},{"name":"GAGARUNA","text":"Word of her feat spread across the realm like wildfire, of course, and Ul'dah swiftly transformed into a center of pugilism, with people flocking from all over to train under this master among masters."},{"name":"GAGARUNA","text":"The woman's name was Cornelia, and it is to her that the Pugilists' Guild owes its existence. The art practiced here is based on her all-encompassing style, and this training hall is modeled upon the one which she once built."},{"name":"GAGARUNA","text":"And there it is─a brief history of our guild."},{"name":"GAGARUNA","text":"I've told this tale a thousand times, but gods, it never fails to fan the flames of my fighting spirit!"},{"name":"GAGARUNA","text":"Now then, before we can proceed with your enrollment, you must first obtain the guildmaster's approval. Let me know when you are ready to meet him."}],"reward":{"job":2},"next":[66068]},"partials":[{"type":"npc","id":"1001286","obj":{"i":1001286,"n":"Gagaruna","l":40,"q":5,"t":"Guild Receptionist"}},{"type":"quest","id":"66068","obj":{"i":66068,"n":"Way of the Pugilist","g":128,"l":"Ul'dah","s":10,"f":1}}]}