{"quest":{"name":"On to Bentbranch","location":"Gridania","id":65712,"patch":2.0,"sort":40,"eventIcon":71201,"issuer":1000100,"target":1000470,"genre":1,"journal":["Impressed by your progress, Miounne wishes to send you on to Bentbranch Meadows, where you will find further opportunities to learn.","Having precious little time for anything besides the care of their chocobos, the farmhands at Bentbranch Meadows are looking for someone to help out with various chores around the ranch. Make your way to Bentbranch and speak with Keitha, the head wrangler.","Keitha welcomes you to Bentbranch, eager for another hand to help around the ranch. Talk to her when you're ready for some work, and keep an eye out for anyone else who might need your assistance."],"objectives":["Speak with Keitha at Bentbranch Meadows."],"dialogue":[{"name":"MIOUNNE","text":"How is my favorite fresh-faced adventurer? Oh, do not scowl so─I speak out of habit. You've come a long way since first you walked through my door, and I'll not deny it."},{"name":"MIOUNNE","text":"As a matter of fact, I think it's about time you made yourself useful at Bentbranch Meadows in the Central Shroud."},{"name":"MIOUNNE","text":"Unlike the recruits you see at the Bannock, the men and women out at Bentbranch are fully occupied with their own work. As such, I imagine there are more than a few who would welcome the assistance of a <span class=\"emphasis\">rapidly maturing</span> adventurer like yourself."},{"name":"MIOUNNE","text":"Bentbranch is also home to a very usefully situated aetheryte. It is, in other words, the perfect place for you to begin the next stage of your journey as an adventurer."},{"name":"MIOUNNE","text":"And what better time than the present!? Leave the city via the Blue Badger Gate, and continue to the southwest until you come to a bridge."},{"name":"MIOUNNE","text":"Cross it, and when you spy an aetheryte in the distance, you may congratulate yourself on having successfully found Bentbranch Meadows."},{"name":"MIOUNNE","text":"If you so fancy, you may also make use of the chocobo porter service, doubtless the safest way to get to your destination. Chocobokeep Cingur should not hesitate to lend his birds to a capable adventurer like you."},{"name":"MIOUNNE","text":"Oh, and be sure to introduce yourself to Keitha, the head chocobo wrangler, when you arrive."},{"name":"KEITHA","text":"You must be the 'venturer Miounne sent word about. I'm Keitha, head wrangler 'round these parts."},{"name":"KEITHA","text":"I've heard many and more things about you─good things, lest you worry."},{"name":"KEITHA","text":"When the Elder Seedseer bade us welcome 'venturers, 'tis fair to say we had our doubts─till hardworkin' folk like yourself set about provin' us wrong, that is. Consider me a convert!"},{"name":"KEITHA","text":"Anyroad, you've a mind to help out at the ranch, have you? Good. We could always do with a hand or two to keep the place runnin' smoothly."},{"name":"KEITHA","text":"As a matter of fact, I've a task right here that wants doin'."},{"name":"KEITHA","text":"Let me know when you're ready to get busy. Oh, and you come highly recommended, so don't go lettin' no one down, eh?"}],"reward":{"items":[{"num":23,"id":3},{"id":3318,"one":1},{"id":3316,"one":1},{"num":2,"id":5824,"one":1}],"xp":3420},"reqs":{"jobs":[{"lvl":10,"id":130}],"quests":[65665]},"next":[65910,65912]},"partials":[{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000470","obj":{"i":1000470,"n":"Keitha","l":54,"q":9}},{"type":"item","id":"3318","obj":{"i":3318,"n":"Hempen Trousers","l":10,"c":45015,"t":36,"p":270}},{"type":"item","id":"3316","obj":{"i":3316,"n":"Amateur's Breeches","l":10,"c":45035,"t":36,"p":216}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65665","obj":{"i":65665,"n":"Spirithold Broken","g":1,"l":"Central Shroud","s":33}},{"type":"quest","id":"65910","obj":{"i":65910,"n":"Feeding Time","g":0,"l":"Central Shroud","s":41}},{"type":"quest","id":"65912","obj":{"i":65912,"n":"You Shall Not Trespass","g":1,"l":"Central Shroud","s":42}}]}