{"quest":{"name":"So You Want to Be a Gladiator","location":"Ul'dah - Steps of Thal","id":65713,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1002277,"target":1002277,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"LULUTSU","text":"Welcome to the Gladiators' Guild, adventurer. Here, our members train tirelessly with sword and shield so that their names might one day be writ in legend!"},{"name":"LULUTSU","text":"Hm? Was that a flash of interest in your eyes? If you wish to study swordplay, know that admission to the guild is free of charge!"},{"name":"Q1","text":"Join the Gladiators' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"LULUTSU","text":"You say no today, but the lure of fame and fortune will bring you back! When you inevitably change your mind, you need only seek me out, and we can discuss your future as a gladiator."},{"name":"LULUTSU","text":"What's this? I thought you somewhat versed in the arts of combat, but it seems you are anything but experienced."},{"name":"LULUTSU","text":"Before you can learn how to wield a sword, you must become more proficient in your current pursuit. Pray return when you have achieved this."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"LULUTSU","text":"I had marked you as a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action. I am pleased to see that I was not wrong!"},{"name":"LULUTSU","text":"Now, while you may be familiar with the deadly dance of battle, you are new to us, and must begin at the beginning."},{"name":"LULUTSU","text":"If you would take your place in these hallowed halls, you must be willing and ready to undergo the most rigorous training. You must endure cuts and bruises beyond counting, and like as not far worse."},{"name":"LULUTSU","text":"A daunting prospect, I concede─but there is no other way if you mean to take to the bloodsands one day. And why wouldn't you? The Coliseum is only the most celebrated place of public entertainment in all of Ul'dah!"},{"name":"LULUTSU","text":"Where else could a poor man amass a fortune so vast as to one day allow him to claim a seat on the Syndicate?"},{"name":"LULUTSU","text":"Ahhh...there's not an Ul'dahn alive who isn't inspired by the rise of the self-made man."},{"name":"LULUTSU","text":"And there is no truer embodiment of that dream than the gladiator who wins riches and fame with his sword."},{"name":"LULUTSU","text":"Throughout its long and storied history, this guild has nurtured countless champions. Our training methods are second to none, and our members ever strive to develop new techniques."},{"name":"LULUTSU","text":"If you desire true glory─to fight and triumph, 'midst the roar of ten thousand voices─then this is where you belong, adventurer."},{"name":"LULUTSU","text":"...Think of it. Think of your legacy. And if your soul stirs...join us."}],"reward":{"job":1},"next":[65821]},"partials":[{"type":"npc","id":"1002277","obj":{"i":1002277,"n":"Lulutsu","l":41,"q":6,"t":"Guild Receptionist"}},{"type":"quest","id":"65821","obj":{"i":65821,"n":"Way of the Gladiator","g":127,"l":"Ul'dah","s":10,"f":1}}]}