{"quest":{"name":"So You Want to Be a Goldsmith","location":"Ul'dah - Steps of Thal","id":65723,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1002280,"target":1002280,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"JEMIME","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, adventurer, and welcome to the Goldsmiths' Guild. Have you come to observe our artisans at work?"},{"name":"JEMIME","text":"Indeed, it is a marvel to watch goldsmiths transform raw metals and uncut gemstones into sparkling rings, earrings, and necklaces─some of which possess magical properties, no less!"},{"name":"JEMIME","text":"You know, if you'd like to try your hand at goldsmithing, the guild is open to adventurers like yourself. No prior experience is required, for we teach all you need to know about the craft. Would you be interested?"},{"name":"Q1","text":"Join the Goldsmiths' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"JEMIME","text":"Forgive me, it seems I've misunderstood your intent. Forget I said anything."},{"name":"JEMIME","text":"Oh dear, this part is always <span class=\"emphasis\">so</span> awkward. I would love nothing more than to welcome you into the guild, but you are still somewhat rough, and in need of further refinement."},{"name":"JEMIME","text":"That is to say, you are yet lacking in worldly experience. But I do not doubt that it won't be long before you are ready to take up the chaser hammer."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"JEMIME","text":"It pleases me greatly to hear you say so. As the first step, I would have you understand the purpose of our guild."},{"name":"JEMIME","text":"The vast mineral resources of Thanalan have given rise to a grand goldsmithing tradition, which has been refined through the ages. Our techniques are renowned across the realm, our creations held in the highest regard."},{"name":"JEMIME","text":"However, we of Eshtaime's Lapidaries, the premier source for Ul'dahn jewelry, were not content to rest on our laurels."},{"name":"JEMIME","text":"Seeking to advance our craft, we turned our eyes to the East, the only place in the known world whose goldsmithing was said to rival our own."},{"name":"JEMIME","text":"We built the finest facilities to beckon their masters hither, and blended their foreign techniques with ours. Our guild quickly became the center of Eorzean goldsmithing."},{"name":"JEMIME","text":"Aye, here you shall benefit from the refined wisdom of countless veteran craftsmen. You will learn to see the potential in your materials and shape them to your will."},{"name":"JEMIME","text":"These are essential skills, for a goldsmith must hone his eyes to identify and appraise all manner of materials, and─when needs be─recognize imitations for what they are."},{"name":"JEMIME","text":"It is even said that a master goldsmith can ascertain the authenticity of a man himself."},{"name":"JEMIME","text":"You may one day come to possess such vision. But even the most magnificent jewel begins life as a rough-hewn stone. It must first be cut and polished before it can delight the eyes with its brilliance."},{"name":"JEMIME","text":"If you would become a goldsmith, you must needs refine yourself as you would a gemstone. It will take much time and effort, and there is no guarantee of success."},{"name":"JEMIME","text":"Should you be certain that this is the life you seek, speak to me once more."}],"next":[66144]},"partials":[{"type":"npc","id":"1002280","obj":{"i":1002280,"n":"Jemime","l":41,"q":7,"t":"Guild Receptionist"}},{"type":"quest","id":"66144","obj":{"i":66144,"n":"Way of the Goldsmith","g":139,"l":"Ul'dah","s":10,"f":1}}]}