{"quest":{"name":"So You Want to Be an Armorer","location":"Limsa Lominsa Upper Decks","id":65722,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000998,"target":1000998,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"GWAHNAKO","text":"Sound o' hammerin' bring you in from the street, did it, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? It's well that you find the din invitin', for the Armorers' Guild is not the place for quiet reverie."},{"name":"GWAHNAKO","text":"If the clangor o' metal strikin' metal is music to your ears, mayhap you've the spirit of a shipwright."},{"name":"GWAHNAKO","text":"Are you of a mind to join our guild? Take it from me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, there's no greater joy than workin' a shapeless lump of iron into a shinin' breastplate with your own hands. What say you, then?"},{"name":"Q1","text":"Do you wish to join the Armorers' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"GWAHNAKO","text":"Hmph, seems I read you wrong."},{"name":"GWAHNAKO","text":"Well, I'll be here if you decide you need another earful o' why our guild is the right choice for you."},{"name":"GWAHNAKO","text":"Hmmm... Now that I take a closer look, I don't think you're ready."},{"name":"GWAHNAKO","text":"We can't be takin' on initiates that lack the inner steel to stick with a discipline for more than a bell or two─not in troubled times like these. We need people with perseverance. Show me you've got some, an' we'll talk."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"GWAHNAKO","text":"Well said, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Now, we should cover a bit o' guild history afore forgin' ahead with the formalities."},{"name":"GWAHNAKO","text":"The armorer's craft is an offshoot o' blacksmithin'. Time was when armorers an' smitties were one an' the same."},{"name":"GWAHNAKO","text":"But as the years trickled by, the techniques for workin' sheet metal into armor plates became a specialized trade."},{"name":"GWAHNAKO","text":"An' the smitties who showed uncommon skill an' passion for this trade earned 'emselves the title of “armorer.”"},{"name":"GWAHNAKO","text":"Now, as you can probably imagine, the skills necessary for makin' armor are also needed for shipbuildin'. But buildin' ships is a bit harder than knockin' out simple helms, which led those armorers who were good enough to work on boats to claim the title o' “shipwright.” 'Course, it was one thing callin' armorers blacksmiths an' shipwrights armorers, but it was quite <span class=\"emphasis\">another</span> callin' shipwrights blacksmiths, 'cause buildin' a ship an' makin' a hatchet couldn't be more different."},{"name":"GWAHNAKO","text":"It seemed as though a line needed drawin', an' seein' as how Limsa Lominsa was built on the strength o' her navy, you can imagine why the armorers chose to cut their ties with the smitties, an' established a guild o' their own."},{"name":"GWAHNAKO","text":"As for the smitties, well, the whole notion of an independent Armorers' Guild never did sit well with 'em, an' there's been a fair old rivalry between our two factions ever since. Always tryin' to outdo each other, we are."},{"name":"GWAHNAKO","text":"Which is why we're ever on the lookout for new talent to help us keep the smitty bastards in their place! All you need do is impress the forgemaster, an' we can start you on your trainin'."},{"name":"GWAHNAKO","text":"Be warned─Forgemaster H'naanza's tongue could strip the scales off a fishback at forty paces. Sayin' that, you won't find a fairer mistress this side o' the Strait o' Merlthor. Let me know when you've mustered the courage to speak with her, an' I'll see to the rest."}],"next":[65809]},"partials":[{"type":"npc","id":"1000998","obj":{"i":1000998,"n":"G'wahnako","l":28,"q":2,"t":"Guild Receptionist"}},{"type":"quest","id":"65809","obj":{"i":65809,"n":"Way of the Armorer","g":138,"l":"Limsa Lominsa","s":10,"f":1}}]}