{"quest":{"name":"So You Want to Be a Miner","location":"Ul'dah - Steps of Thal","id":65728,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1002282,"target":1002282,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"LINETTE","text":"Well met, adventurer. You stand within the Miners' Guild, the place where seekers of the realm's mineral wealth gather."},{"name":"LINETTE","text":"With pickaxe and sledgehammer, we miners work rock and earth that they might yield us ores, fossils, precious stones, and more."},{"name":"LINETTE","text":"If you have a mind to join our ranks, you will be pleased to know that we are currently recruiting. Great riches await those with strong backs and keen eyes!"},{"name":"Q1","text":"Do you wish to join the Miners' Guild?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"LINETTE","text":"Oh. I take it the prospect of striking it rich does not appeal."},{"name":"LINETTE","text":"Well, to each <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own, I suppose."},{"name":"LINETTE","text":"Should you undergo a change of heart, know that I will be here."},{"name":"LINETTE","text":"Excellent! Ah, wait a moment... Would I be right in thinking you're rather new to adventuring? You are, aren't you... Oh, don't ask me how I know─it's something that comes with experience. Anyway, I regret that you do not yet qualify for membership."},{"name":"LINETTE","text":"To be considered for a place in the guild, you must first prove that you take your work seriously. In your case, that means devoting a little more time to your present pursuit."},{"name":"LINETTE","text":"Once you have done so, I invite you to visit us again. Rest assured that there will still be minerals to mine when that day comes."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"LINETTE","text":"A decision you will not regret. You have just taken your first step toward striking it rich!"},{"name":"LINETTE","text":"To look at the lands around Ul'dah, one would be forgiven for thinking the region barren of opportunity, but beneath the surface, the scene could not be more different. There lie veins of copper, silver, and gold beyond measure!"},{"name":"LINETTE","text":"For as long as he has dwelt in Thanalan, man has availed himself of these vast deposits, giving rise to a thriving mining trade, which forms the foundation of our nation's prosperity."},{"name":"LINETTE","text":"Of course, the mining trade as it is today owes much to an event which took place some century and a half ago─namely, the Mad Mythril Rush."},{"name":"LINETTE","text":"Never before had the sultanate seen such an influx of migrants. Endless throngs came from lands near and far, spurred on by the dream of discovering the mother lode. Alas, a harsh reality awaited them."},{"name":"LINETTE","text":"You see, the vast majority of these poor souls were miners in name alone, and they possessed neither the proper equipment nor the training to realize their dreams. To make matters worse, the mining concerns, who in those days held absolute power, did not scruple to exploit them."},{"name":"LINETTE","text":"Presented with a glut of unskilled labor, they proceeded to fill every tunnel to bursting, and atrocious working conditions soon became the norm. Miners were paid a pittance for backbreaking labor, and saw naught of the riches they unearthed."},{"name":"LINETTE","text":"Pushed to breaking point, the workers banded together to form the Miners' Guild, with the aim of improving conditions while protecting the integrity of the trade."},{"name":"LINETTE","text":"Since then, we have sought to educate folk in correct mining practices, both to prevent accidents and to curb the impact that our trade has upon the environment."},{"name":"LINETTE","text":"I trust you now have a better understanding of what we do. All that is left is to commit your name to our roll."},{"name":"LINETTE","text":"When you are ready to do so, pray speak with me again. I shall guide you through the enrollment procedure."}],"next":[66133]},"partials":[{"type":"npc","id":"1002282","obj":{"i":1002282,"n":"Linette","l":41,"q":4,"t":"Guild Receptionist"}},{"type":"quest","id":"66133","obj":{"i":66133,"n":"Way of the Miner","g":144,"l":"Ul'dah","s":10,"f":1}}]}