{"quest":{"name":"So You Want to Be a Carpenter","location":"New Gridania","id":65720,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000148,"target":1000148,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"CORGG","text":"Greetings, adventurer, and welcome to the Carpenters' Guild."},{"name":"CORGG","text":"We are the artisans who take wood and grant it new form and purpose as the archer's bow, the lancer's spear, and the novice's shield."},{"name":"CORGG","text":"If carpentry holds any appeal, you should consider joining our guild. Might you be interested in learning the ways of woodworking?"},{"name":"Q1","text":"Learn the ways of woodworking?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"CORGG","text":"No? So be it."},{"name":"CORGG","text":"Know that our door remains open, however. Should you find that you have a mind to join us after all, I will be happy to furnish you with the necessary information."},{"name":"CORGG","text":"While I appreciate your ambition, I fear you want for experience."},{"name":"CORGG","text":"I think it best that you focus on your current path. One must take the time to get to know one's own trade before contemplating abandoning it for another."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"CORGG","text":"Wonderful, wonderful! Now, before we proceed, I think it only right that I acquaint you with our guild's storied past."},{"name":"CORGG","text":"Since the founding of Gridania, we have built our homes and crafted our weapons from the trees of the Twelveswood."},{"name":"CORGG","text":"As our nation grew and prospered, the woodworker's repertoire expanded to encompass a greater variety of articles, and carpentry developed into an art."},{"name":"CORGG","text":"At first, there was no association of carpenters; each individual worked and sold his services independently. However, the advent of watermills meant that more efficient construction methods were needed, along with formalized maintenance regimes, all of which necessitated organization."},{"name":"CORGG","text":"The Carpenters' Guild was founded to oversee the operation of watermills and promote cooperation between woodworkers."},{"name":"CORGG","text":"Now, I must mention at this point that we owe much and more of our prosperity to the Greatloam Growery."},{"name":"CORGG","text":"Thanks to the hardworking botanists, we are blessed with the finest lumber in all Eorzea."},{"name":"CORGG","text":"This confluence of ideal circumstances allows us to provide all manner of goods and services to the people of Gridania."},{"name":"CORGG","text":"...My apologies, that was rather longer than I intended. Still, I trust you have gained a greater understanding of our guild."},{"name":"CORGG","text":"We expect our members to drink deep of the collected wisdom that the guild has amassed over the course of its history─to actively seek an understanding of wood and the techniques required to work it, rather than simply waiting to be taught."},{"name":"CORGG","text":"We expect, in short, nothing less than total commitment to the craft."},{"name":"CORGG","text":"If you wish to start down this path, speak to me once more. I shall explain to you the enrollment process."}],"next":[65674]},"partials":[{"type":"npc","id":"1000148","obj":{"i":1000148,"n":"Corgg","l":52,"q":4,"t":"Guild Receptionist"}},{"type":"quest","id":"65674","obj":{"i":65674,"n":"Way of the Carpenter","g":136,"l":"Gridania","s":10,"f":1}}]}