{"quest":{"name":"So You Want to Be a Culinarian","location":"Limsa Lominsa Upper Decks","id":65727,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000946,"target":1000946,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"CHARLYS","text":"I beg your pardons, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but this is the Culinarians' Guild. If you are here to dine at the Bismarck, one of our waiters will be along shortly to show you to your─"},{"name":"CHARLYS","text":"...Oh, you're <span class=\"emphasis\">not</span> a patron? Might I assume, then, that you wish to become a culinarian?"},{"name":"CHARLYS","text":"If so, I wholeheartedly recommend you join the Culinarians' Guild, where one may learn the culinary arts under the finest chefs in all the realm. What say you?"},{"name":"Q1","text":"Do you wish to join the Culinarians' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"CHARLYS","text":"Oh... Please accept my apologies─it would seem I misread your intentions."},{"name":"CHARLYS","text":"If you are here to dine after all, our waiters shall attend you at table. I hope you enjoy your meal."},{"name":"CHARLYS","text":"Ah, but I sense you require more time to steep in life's piquant marinade─by which I mean you lack the worldly experience that the guild requires in its acolytes. I apologize if I have unduly raised your hopes."},{"name":"CHARLYS","text":"But do not despair─judging by the glint of determination in your eyes, I suspect it shan't be long before you are ready to take up the skillet."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"CHARLYS","text":"Wonderful! Then without further ado, I shall acquaint you with the history of our guild."},{"name":"CHARLYS","text":"As you are doubtless aware, Limsa Lominsa has long been the gastronomic capital of Eorzea. The city's rich culinary tradition is the product of a unique combination of factors. The first is our proximity to the fertile lands and plentiful seas of Vylbrand, which have ever yielded bounteous produce."},{"name":"CHARLYS","text":"The second is our standing as the realm's foremost trading port, which grants us access not only to exotic ingredients from faraway shores, but also to foreign merchants versed in their use. We are, in short, the beneficiaries of culinary knowledge from every corner of the world."},{"name":"CHARLYS","text":"Until recently, knowledge of this kind was passed on solely through word of mouth, and was therefore susceptible to corruption and loss. But that all changed when one man made it his mission to catalog every recipe of note. His name was Admiral Guolskyf Bhaldwaensyn, also known as Mastcleaver."},{"name":"CHARLYS","text":"The man's love of fine cuisine was such that, at sea, he would regularly spend as much time preparing meals in the galley as giving commands on the bridge. It was none other than he who founded the Culinarians' Guild and codified cooking methodology."},{"name":"CHARLYS","text":"Today, the guild carries on Bhaldwaensyn's legacy, though the scope of our endeavors has expanded significantly. Not content with simply preserving existing recipes, we labor tirelessly to devise wholly novel culinary creations with which to delight the senses."},{"name":"CHARLYS","text":"To this end, our doors are open to folk from all walks of life, including adventurers such as your good self. One may liken our guild to a great pot of stew, and each member to an ingredient imparting a unique flavor."},{"name":"CHARLYS","text":"As with every dish, however, adding ingredients willy-nilly is certain to spoil the taste. Before you may take your place in the pot, you must be deemed a worthwhile addition by Guildmaster Lyngsath, a man whose passion for cookery burns hotter than any oven."},{"name":"CHARLYS","text":"Before troubling him, I must warn you that ours is a truly sweltering kitchen. As such, you would be well advised to ask yourself: can I stand the heat? If you earnestly believe that you can, speak to me once more, and I shall be glad to guide you through the enrollment process."}],"next":[65807]},"partials":[{"type":"npc","id":"1000946","obj":{"i":1000946,"n":"Charlys","l":28,"q":3,"t":"Guild Receptionist"}},{"type":"quest","id":"65807","obj":{"i":65807,"n":"Way of the Culinarian","g":143,"l":"Limsa Lominsa","s":10,"f":1}}]}