{"quest":{"name":"So You Want to Be a Blacksmith","location":"Limsa Lominsa Upper Decks","id":65721,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000995,"target":1000995,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"RANDWULF","text":"Unless yer blind and deaf, I presume ye've wandered into our forge of yer own accord. Drawn by the siren song of our smitties' hammers, no doubt."},{"name":"RANDWULF","text":"In these here hallowed halls, Limsa's finest pound metal into all manner o' tools and weapons. And when I say “Limsa's,” I mean the whole bloody realm's. Make no mistake─ye need more than a big arm to join our ranks."},{"name":"RANDWULF","text":"But if ye've got iron in yer veins and the Builder's blessin', speak up."},{"name":"Q1","text":"Join the Blacksmiths' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"RANDWULF","text":"You haven't, eh? Hmph. And there I was thinkin' ye'd got potential..."},{"name":"RANDWULF","text":"Well then, bugger off. I've no time to waste on idle adventurers who've got naught better to do than run around pesterin' honest guild receptionists. Don't bother me again unless yer resolved to join."},{"name":"RANDWULF","text":"Hmmm...ye've got fire in yer belly, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, I'll give ye that. Might even make a half-decent smitty one day."},{"name":"RANDWULF","text":"But that day's a way off yet. I reckon ye should see where yer current path leads before choosin' a new one."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"RANDWULF","text":"Heh! Well yer not short on confidence!"},{"name":"RANDWULF","text":"But do ye truly know what yer gettin' yerself into here, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"RANDWULF","text":"Ours is a trade born o' blood and brine. Fer as long as pirates have sailed the Rhotano, smitties have forged their weapons and fitted out their ships from keel to cannon."},{"name":"RANDWULF","text":"'Course, “till sea swallows all” ain't just an idle sayin'─brine'll eat through even the stoutest iron given time, and our forebears long struggled to forge more rust-resistant alloys."},{"name":"RANDWULF","text":"Lucky fer us, the smitties of eld were a determined bunch, and clever too. So when they learned that the kobolds knew somethin' of advanced metallurgy, the smitties set out to make it their own."},{"name":"RANDWULF","text":"Thanks to the kobolds' wisdom─which they generously gifted us with only the merest <span class=\"emphasis\">hint</span> o' pirately promptin'─Lominsan smithin' came on leaps and bounds."},{"name":"RANDWULF","text":"'Twasn't long before the Gridanians and Ul'dahns started eyein' our knowledge like we did the kobolds', though. And so, some hundred and fifty-odd years ago, two particularly forward-thinkin' men named Theor Naldiq and Bryce Vymelli had the bright idea of establishin' a respectable business."},{"name":"RANDWULF","text":"Bein' fair-minded fellows, they'd sell their wares to anyone who had the coin─pirates and foreigners included. And when folks weren't inclined to pay, they made sure to remind 'em that we hadn't completely forsaken our pirate ways."},{"name":"RANDWULF","text":"Times have changed, though, and we're a wee bit more willin' to share our wisdom these days. The company's been runnin' the Blacksmiths' and Armorers' Guilds fer years now, welcomin' any soul with the necessary talent and will to work."},{"name":"RANDWULF","text":"As to whether ye've got enough of either...well, that's fer the forgemaster to decide. Speak to me when yer ready to present yerself to him."}],"next":[65827]},"partials":[{"type":"npc","id":"1000995","obj":{"i":1000995,"n":"Randwulf","l":28,"q":3,"t":"Guild Receptionist"}},{"type":"quest","id":"65827","obj":{"i":65827,"n":"Way of the Blacksmith","g":137,"l":"Limsa Lominsa","s":10,"f":1}}]}