{"quest":{"name":"So You Want to Be an Alchemist","location":"Ul'dah - Steps of Thal","id":65726,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1002281,"target":1002281,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"DEITRICH","text":"Ah, an adventurer, one of my favorite kinds of people! I find your unquenchable thirst for exploration neatly complements the burning hunger for sagacity that marks our dedicated members. Welcome to the Alchemists' Guild."},{"name":"DEITRICH","text":"Though I hesitate to define alchemy in such narrow terms, our main field of expertise is the concoction of various potions and elixirs. There are salves to treat all manner of afflictions, not to mention miraculous libations that enhance the imbiber beyond <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> natural physical limits."},{"name":"DEITRICH","text":"As an adventurer, I am sure you can appreciate the eminently practical applications of our work. What say you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? Care to take up mortar and pestle and join our ranks?"},{"name":"Q1","text":"Do you wish to join the Alchemists' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"DEITRICH","text":"No!? After hearing my most persuasive argument to the contrary, you tell me “no”!? You...you have perhaps heard stories of our guildmaster, then?"},{"name":"DEITRICH","text":"Well, n-never mind that! It benefits neither party should you attend our teachings with but half a mind to do so. A waste of both your time and ours!"},{"name":"DEITRICH","text":"Yes? Wonderful, then let us continue with the initi─ Oh dear. It seems I was somewhat premature in extending to you an invitation to join our guild."},{"name":"DEITRICH","text":"In my enthusiasm, I failed to inquire as to your status with the other guilds of the realm. My apologies, the fault lies entirely with me. Please do return once you have gained the approval of your current guildmaster."},{"name":"SYS","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"DEITRICH","text":"Wonderful! Now then, allow me to give you a brief history of the guild before we tackle the official paperwork."},{"name":"DEITRICH","text":"Though alchemists are presently known as the quintessential brewers of potions, the profession itself arose from the desire to achieve an as-yet-unrealized ambition."},{"name":"DEITRICH","text":"The original driving purpose behind our art was─and perhaps still is─the discovery of a process that can transform base metals into gold or silver. And the mystical medium thought necessary to effect such a transformation is the Philosopher's Stone─which is itself believed to have panacean properties and be capable of bestowing eternal life."},{"name":"DEITRICH","text":"Though success yet eludes us, years of endless experimentation towards this golden goal had the initially unintentional consequence of unearthing a wealth of knowledge in the field of alchemical medicine."},{"name":"DEITRICH","text":"Regretfully, alchemy's potential to enrich the lives of the masses was first met with a wave of distrust. As if our ability to create helpful compounds was akin to dabbling in back-alley witchcraft!"},{"name":"DEITRICH","text":"The profession eventually gained credibility in Ul'dah through its integration into traditional medicine by Frondale's Phrontistery, an institution known for producing respected physicians."},{"name":"DEITRICH","text":"Once the city's shift in perception became known, budding alchemists wishing to study without fear of persecution journeyed to Ul'dah from every corner of the realm. It was not long before this gathering of inquisitive minds banded together to form the Alchemists' Guild."},{"name":"DEITRICH","text":"Thus, while our organization is intensely focused on perfecting and sharing the fruits of our research, it is also of paramount importance that we uphold the reputation of alchemy itself as a legitimate discipline."},{"name":"DEITRICH","text":"If you would revel in the secrets of our art, then you must be prepared to shoulder the responsibility I have described. Take a moment to dwell on these words before you truly enter the world of alchemy."}],"next":[66111]},"partials":[{"type":"npc","id":"1002281","obj":{"i":1002281,"n":"Deitrich","l":41,"q":4,"t":"Guild Receptionist"}},{"type":"quest","id":"66111","obj":{"i":66111,"n":"Way of the Alchemist","g":142,"l":"Ul'dah","s":10,"f":1}}]}