{"quest":{"name":"So You Want to Be a Botanist","location":"Old Gridania","id":65729,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000294,"target":1000294,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"LEONCEAULT","text":"Hello there, and welcome to the Botanists' Guild. What brings you here today?<br>...Hm? Interested in <span class=\"emphasis\">becoming</span> a botanist, are you?"},{"name":"LEONCEAULT","text":"Then you've come to the right place. At our guild, you can study under some of the finest botanists in all the realm. An enticing proposition, is it not?"},{"name":"LEONCEAULT","text":"So, what say you? Would you like to add your name to our roll?"},{"name":"Q1","text":"Do you wish to join the Botanists' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"LEONCEAULT","text":"Oh... Well, that's a shame. I'm sure you'd find botany a singularly rewarding pursuit. I know I do."},{"name":"LEONCEAULT","text":"If you ever have a change of heart, feel free to return here. The guild is ever looking to welcome new members into its ranks."},{"name":"LEONCEAULT","text":"Then welcome to the guild!"},{"name":"LEONCEAULT","text":"...Is what I would say if you were a suitable candidate. Alas, my instincts tell me you've only just started out as an adventurer. You don't lack for enthusiasm, I'll give you that, but you're still as green as spring grass. Come back when you've seen a bit more of the world, will you?"},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"LEONCEAULT","text":"Excellent! Now, you're doubtless eager to dive headlong into the nearest shrubbery─but first, a brief explanation on the origins of the Botanists' Guild."},{"name":"LEONCEAULT","text":"Our guild boasts a long history. Its roots can be traced back some five hundred years, to when our nation was still in its infancy. It was around that time that a precursor organization to our own was established to facilitate communion with the elementals..."},{"name":"LEONCEAULT","text":"Ah...but I suspect you're already confused, not being forestborn. Let me put it in a way that your kind would understand."},{"name":"LEONCEAULT","text":"The Twelveswood doesn't belong to man, but almighty beings known as elementals. It is by their leave that we Gridanians dwell here in the forest, and it is by their leave that we receive of its bounty."},{"name":"LEONCEAULT","text":"Ever since mankind settled in the Twelveswood, it has been necessary for us to obtain the elementals' permission prior to taking aught from their domain. Historically, this was a rather involved process in that only a precious few could actually commune with them─specifically, those conjurers blessed with the ability to hear the elementals, aptly known as Hearers."},{"name":"LEONCEAULT","text":"In order to relay the elementals' will to the botanists in a more timely manner, a new organization was formed with a Hearer as its mouth and ears. This organization would eventually evolve to become the Botanists' Guild."},{"name":"LEONCEAULT","text":"To this day, the guild employs the services of a Hearer who offers guidance to our members. Yet this is no longer our organization's sole concern. We also seek to promulgate correct harvesting practices─that is, practices which honor the will of the elementals."},{"name":"LEONCEAULT","text":"...And that, my friend, is the story of how our guild came to be. I trust you have a newfound appreciation for the work we do."},{"name":"LEONCEAULT","text":"Now, with all this talk of elementals and communing, mayhap you're wondering whether you're fit to join us. Well, you may cast such doubts aside. You don't need to have been raised as a good little forestborn <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span> to be a botanist, nor do you need to know the secret forestborn salute─<span class=\"emphasis\">I jest</span>─you just need a healthy respect for nature and the will to learn."},{"name":"LEONCEAULT","text":"If you honestly believe you possess these things, it would be my pleasure to recommend you to our guildmaster."},{"name":"LEONCEAULT","text":"Please wait a moment while I see to the formalities. Speak to me again when you are ready to begin the enrollment procedures."}],"next":[65539]},"partials":[{"type":"npc","id":"1000294","obj":{"i":1000294,"n":"Leonceault","l":53,"q":2,"t":"Guild Receptionist"}},{"type":"quest","id":"65539","obj":{"i":65539,"n":"Way of the Botanist","g":145,"l":"Gridania","s":10,"f":1}}]}