{"quest":{"name":"So You Want to Be a Leatherworker","location":"Old Gridania","id":65724,"patch":2.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1000352,"target":1000352,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"RANDALL","text":"Greetings and welcome to the Leatherworkers' Guild. Here we produce the finest leather goods, taking care to honor the lives which were sacrificed for their creation."},{"name":"RANDALL","text":"Our leather armor is worn by the archers and lancers of this great nation, and favored by all who prefer that their protection does not come at a cost to mobility."},{"name":"RANDALL","text":"If you wish to place an order, I bid you visit Fen–Yll Fineries. If, on the other hand, you have a mind to join our guild, I should be happy to assist you. Might you be interested in becoming a leatherworker?"},{"name":"Q1","text":"Become a leatherworker?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"RANDALL","text":"A pity─but better that than a grudging yes. Guildmaster Geva expects nothing less than complete dedication."},{"name":"RANDALL","text":"Should you ever wish to learn our craft, come and speak to me again. It would be my pleasure to furnish you with the necessary information."},{"name":"RANDALL","text":"I wish I could consider your application, but Guildmaster Geva would never admit such an inexperienced adventurer."},{"name":"RANDALL","text":"She demands our recruits possess a certain level of worldly experience, you see, and has a decidedly <span class=\"emphasis\">low</span> opinion of those who would choose a career upon a whim. When you have taken the time to acquaint yourself properly with your current profession, we can speak about your future here."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"RANDALL","text":"Nothing would make me happier than to welcome a new initiate into our ranks. However, it is essential that you first understand the burden that every leatherworker must bear."},{"name":"RANDALL","text":"As you cannot have failed to notice, the Twelveswood is blessed with an abundance of life, and we Gridanians have long hunted the forest's creatures for both nourishment and clothing."},{"name":"RANDALL","text":"But Gridania is unlike any other place. The elementals that watch over the Twelveswood have never looked kindly on the taking of life, and those who flout their governance do so at their own peril."},{"name":"RANDALL","text":"The elementals decreed that life not be taken without due necessity. And so the Trappers' League was formed to regulate the hunting of animals."},{"name":"RANDALL","text":"The Leatherworkers' Guild was subsequently founded to manage the fair and equitable distribution of pelts."},{"name":"RANDALL","text":"Nowadays, adventurers are a major supplier of pelts, and leather goods have become widespread. But in times past, they were rare and precious."},{"name":"RANDALL","text":"The Leatherworkers' Guild has not forgotten those times. We treat leather with no less respect than the living creatures whence it comes, and craft goods of the highest quality. In so doing, we honor the lives lost, and minimize the need for further killing─an oft-forgotten benefit of our products' surpassing durability."},{"name":"RANDALL","text":"Our guild is also the sole producer of the famous Fen–Yll brand of leather goods─the pride of Gridania. These products represent the ultimate expression of our core tenets and the transcendent technique which shaped them."},{"name":"RANDALL","text":"Know, though, that being a guild member does not automatically make you a Fen–Yll artisan─you must <span class=\"emphasis\">earn</span> the right to become one. For most of the leatherworkers here, having the fruit of their labors bear the Fen–Yll brand is yet a distant dream."},{"name":"RANDALL","text":"That is the life which awaits you, should you choose to walk our path."},{"name":"RANDALL","text":"Success will not be handed to you─but I guarantee that you <span class=\"emphasis\">will</span> have the opportunity to seize it."},{"name":"RANDALL","text":"So, if you wish to make a name for yourself─and craft goods which are the envy of all─you have come to the right place."},{"name":"RANDALL","text":"Speak to me once more if you wish to learn more about the enrollment process."}],"next":[65641]},"partials":[{"type":"npc","id":"1000352","obj":{"i":1000352,"n":"Randall","l":53,"q":3,"t":"Guild Receptionist"}},{"type":"quest","id":"65641","obj":{"i":65641,"n":"Way of the Leatherworker","g":140,"l":"Gridania","s":10,"f":1}}]}