{"quest":{"name":"A Glim Harvest","location":"North Shroud","id":65731,"patch":2.0,"sort":50,"eventIcon":71221,"issuer":1000671,"target":1000671,"genre":92,"journal":["Linyeve, a quartermaster at Hyrstmill, needs an adventurer to bring her a glimshroom, a variety of brightly glowing fungus.","Pick a glimshroom from the rock face in the southwest of Peacegarden. Linyeve insists that you harvest the fungus with the brightest glow.","Deliver the glimshroom to Linyeve at Hyrstmill.","Glimshrooms are an essential ingredient in the medicine used to treat the disease known as the Creeping Death. With so few conjurers present in Hyrstmill, Linyeve prefers to keep a supply of the medicine on hand to deal with possible outbreaks."],"objectives":["Pick the brightest glimshroom.","Deliver the glimshroom to Linyeve at Hyrstmill."],"dialogue":[{"name":"LINYEVE","text":"You have the look of an adventurer! Adventurers love little tasks, do they not? Well, I need you to head into the forest and pick a glimshroom for me."},{"name":"LINYEVE","text":"You...haven't the faintest idea what a glimshroom is, do you? “Glimshroom” is the common name for a variety of fungus with a unique white phosphorescence. Hm? What did you say? “A glowing mushroom”? ...Yes, I suppose you could put it that way. There is a colony on the rock face in the southwest of Peacegarden."},{"name":"LINYEVE","text":"But do not simply pick the first one you come across! The brightest “glowing mushroom” you can find, if you please!"},{"name":"LINYEVE","text":"Hm? Well, yes, I would love to be able to harvest glimshrooms for myself, but there is the small matter of Ixali scouts. Not terribly friendly, those chaps. Off you go, then!"},{"name":"LINYEVE","text":"Were you able to find the glimshrooms?"},{"name":"LINYEVE","text":"Ah, would you look at that glow! Perfect! This will help me mix a potent remedy for the Creeping Death."},{"name":"LINYEVE","text":"To forestall the obvious question, the Creeping Death is a deadly plague that once ravaged the Hyuran population of Gridania. Though it can now be cured through simple conjury, it doesn't hurt to have a ready supply of the medicine."},{"name":"LINYEVE","text":"After all, out here in Hyrstmill, we cannot always rely on a conjurer to be on hand whenever a youngling coughs. Thank the Matron for wandering adventurers, though, hm?"}],"reward":{"gil":138,"xp":560},"reqs":{"jobs":[{"lvl":4,"id":1}]}},"partials":[{"type":"npc","id":"1000671","obj":{"i":1000671,"n":"Linyeve","l":57,"q":1}}]}