{"quest":{"name":"Butcher of Greentear","location":"Central Shroud","id":65734,"patch":2.0,"sort":31,"eventIcon":71201,"target":1000685,"genre":0,"journal":["Pauline, a conjurer at Gabineaux's Bower, seeks an able adventurer to cull the local hoglet population.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Pauline at Gabineaux's Bower.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have butchered half a dozen hoglets. Report to Pauline at Gabineaux's Bower.","Pauline senses the elementals' joy at your efforts to restore the natural balance. Each small victory brings stability to the forest's cycle of life."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Pauline at Gabineaux's Bower.</span>"],"dialogue":[{"name":"PAULINE","text":"If you might spare the time, <span class=\"highlight\">Forename</span>, I would have you thin the numbers of hoglets in Greentear."},{"name":"PAULINE","text":"While these beasts have always called the Twelveswood home, their appetite has grown so insatiable of late that I fear they will devour every nut on the forest floor. The cycle of life cannot well sustain such gluttony."},{"name":"PAULINE","text":"I must ask you to slay at least six of the creatures. Their sacrifice will be to the greater good of the Twelveswood, I assure you."},{"name":"PAULINE","text":"Yes...the elementals rejoice at your actions."},{"name":"PAULINE","text":"The life of the forest relies on a delicate balance, and the unchecked proliferation of beasts would mean a slow but certain death for the Twelveswood. It is our duty to correct such imbalance, and swiftly, even if it means shedding blood..."},{"name":"PAULINE","text":"Though it may seem trivial, you have performed a vital service this day. May the elementals bless your future endeavors."}],"reward":{"xp":3240},"reqs":{"jobs":[{"lvl":4,"id":130}],"quests":[65711]},"next":[65661]},"partials":[{"type":"npc","id":"1000685","obj":{"i":1000685,"n":"Pauline","l":54,"q":3}},{"type":"quest","id":"65711","obj":{"i":65711,"n":"Surveying the Damage","g":1,"l":"Central Shroud","s":27}},{"type":"quest","id":"65661","obj":{"i":65661,"n":"A Soldier's Breakfast","g":0,"l":"Central Shroud","s":32}}]}