{"quest":{"name":"The Trouble with Truffles","location":"Ul'dah","id":65739,"patch":2.4,"sort":15,"icon":100312,"unlocksFunction":1,"eventIcon":71341,"issuer":1010290,"target":1001679,"involved":[1010169,1010185,1010313,1010314,1010316],"genre":68,"journal":["Hildibrand appears to be in something of a hurry.","At a loss for any remaining leads for his investigation, Hildibrand would return to the tourney venue and review the rules for the competition, that he may face his foes with a gentleman's honor. Accompany the inspector back to the Coliseum.","Upon returning to the Coliseum with Hildibrand, you encounter a visibly agitated Ultros outside his office, from which a series of ominous rumblings can be heard. Your conversation is interrupted by Inspector Briardien, who has returned from his own investigation and demands a moment of your time.","Piecing together your findings with the fruits of his own investigation, Briardien deduces that the Ala Mhigan gladiatrix Avila is conspiring with Ultros to claim the prize and share the victor's spoils, but remains unsure of the means by which the two intend to secure her victory. Hearing that the eight-legged receptionist hastily discarded several crates of rubbish from his office, he bids you go to Pearl Lane to recover any potential evidence.","You have successfully recovered several crates of foul-smelling refuse from the streets of Pearl Lane. Deliver them to Inspector Briardien and hope that your efforts have earned you more than a dire need for a bath.","Amidst a healthy heaping of guts and gore, the crates you recovered housed a foul-smelling sack apparently purchased from Syntgoht's Sundries. Suspecting a possible connection between this merchant and the scheming Ultros, Briardien suggests that the two of you travel to the markets and confront the man with the evidence.","As Syntgoht tells it, Ultros has purchased from him multiple sacks of gold truffles, a costly foodstuff with a distinctive aroma that is appreciated by only the most discerning epicures. One such man appears when Hildibrand rushes to the scene and, after expressing displeasure at Briardien not including him in his investigation, quickly launches into a paean to his mother's recipe for roasted truffles, as Syntgoht listens intently. Convinced that no further clues are to be found here, Inspector Briardien proposes a return to the Coliseum, where the Mythril Cup is set to get underway."],"objectives":["Speak with Hildibrand at the Coliseum.","Speak with Briardien.","Search Pearl Lane for Coliseum refuse.","Deliver the Coliseum refuse to Briardien.","Deliver the stinking sack to Syntgoht."],"dialogue":[{"name":"HILDIBRAND","text":"Good heavens! We haven't much time before the tourney begins. We must hasten back to the Coliseum and apprise ourselves on the rules of engagement."},{"name":"HILDIBRAND","text":"To a true gentleman, the battle is not about victory or defeat, but fighting with honor! Whatever treachery or guile my opponents may employ, I must not─I <span class=\"emphasis\">will</span> not─lower myself to their level!"},{"name":"NASHUMHAKARACCA","text":"Is it just me, or is Mister Ultros a bit...lumpier...than he was before?"},{"name":"ORTHRUS","text":"Bumps on the head, chipped teeth─I am one shabby-looking octopus! I tell ya, they don't pay me enough for this!"},{"name":"ORTHRUS","text":"But that's all going to change soon. Isn't it, buddy?"},{"name":"TYPHON","text":"(-???-)Fungahhhhhh!"},{"name":"HILDIBRAND","text":"Ah, Mister Ultros, just the octopus we were looking for! I was hoping that you might enlighten us as to...ye gads! Who gave you those ghastly bruises?"},{"name":"ORTHRUS","text":"B-Bruises? I f-fell down the stairs, that's all! Now get lost! I'm a busy octopus!"},{"name":"TYPHON","text":"(-???-)Fungaaaaaaaaahhh!!!"},{"name":"HILDIBRAND","text":"Ouch! You have my sympathies, good sir. It is challenge enough to coordinate four limbs, let alone eight! Hm? Is there someone inside your office?"},{"name":"ORTHRUS","text":"N-No! Whatever gave you that idea!? I am simply, ah, fumigating the place! For pests─pests like yourself! Now, don't you have a battle to go fight!?"},{"name":"TYPHON","text":"(-???-)Fuuuuuun...GAAAHHHHHH!!!"},{"name":"NASHUMHAKARACCA","text":"Inspector, I think something's alive in there!"},{"name":"ORTHRUS","text":"Th-That's just me, ah, talking to myself! Yes! Fun...gah...gods, yes, <span class=\"emphasis\">gods</span>, working as a receptionist is fun!"},{"name":"HILDIBRAND","text":"Battered, bruised, beset by vermin, and still able to find joy and fulfillment in your work? I say, Mister Ultros, your passion for your chosen profession is truly an inspiration to us all!"},{"name":"BRIARDIEN","text":"<span class=\"highlight\">Forename</span>, if you would come with me for a moment. I fear the stupidity in the air may be contagious."},{"name":"HILDIBRAND","text":"Mister Ultros is truly a man after my own heart! A gentleman among octopodes!"},{"name":"NASHUMHAKARACCA","text":"Listening to Mister Ultros talk truly is inspiring! I say, he's looking more appetizing by the minute!"},{"name":"BRIARDIEN","text":"Well? Has your investigation borne any fruit?"},{"name":"BRIARDIEN","text":"...I see. Avila seeks to win the tourney to claim a fortune and raise her and her sister out of poverty. Furthermore, she has implied that she has taken the necessary precautions to ensure that her victory is all but certain."},{"name":"BRIARDIEN","text":"While trailing her, you narrowly evaded a series of dastardly obstacles, and upon your return, that strange octopus appeared considerably worse for the wear. The evidence points in one direction─the Ala Mhigan girl and Ultros are plotting together to claim the Mythril Cup and its lucrative prize."},{"name":"BRIARDIEN","text":"...It is not as preposterous as it sounds. I have done some research on our eight-legged friend. It would appear that Ultros has become something of a regular at Ul'dah's taverns and, ah...houses of pleasure."},{"name":"BRIARDIEN","text":"I suspect that he is using his inside knowledge of the workings of the Coliseum to identify and eliminate potential threats, thereby ensuring victory for Avila and earning himself a healthy commission."},{"name":"BRIARDIEN","text":"There is also the matter of the “Tempest Blade” that is rumored to be the source of the Ala Mhigan girl's strength. This remains a mystery─which means that I fear your life is still in danger, <span class=\"highlight\">Forename</span>."},{"name":"BRIARDIEN","text":"One of the guards informed me that several crates of refuse from the Coliseum reception room were hastily discarded in Pearl Lane not bells ago. It is a stab in the dark, but the contents may yet provide some answers. I would ask you to bring them to me."},{"name":"BRIARDIEN","text":"Loath as I am to sift through rubbish, the refuse from the Coliseum may hold the answers we seek. I would ask you to retrieve them from Pearl Lane for me."},{"name":"BRIARDIEN","text":"Well? Let me see what you have found."},{"name":"BRIARDIEN","text":"Now what have we here... Ah, yes, a spectacular assortment of innards and entrails, and...what's this?"},{"name":"BRIARDIEN","text":"A sack, even more foul smelling than the gore it was lying in, if that can be believed. And look here─something appears to be written on the side."},{"name":"BRIARDIEN","text":"<span class=\"emphasis\">Syntgoht's Sundries</span>...? It would seem this merchant has had dealings with that squishy mass of tentacles. Let us pay a visit to the man and have him enlighten us as to the exact nature of their partnership."},{"name":"BRIARDIEN","text":"It would appear this merchant Syntgoht has had dealings with that squishy mass of tentacles. Let us pay a visit to the man and have him enlighten us as to the exact nature of their partnership."},{"name":"SYNTGOHT","text":"Welcome, <span class=\"emphasis\">welcome</span>! What might a discerning <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> like yourself be looking for today?"},{"name":"SYNTGOHT","text":"I'm sorry, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but if I've said it once, I've said it a thousand times─no exchanges, replacements, or refunds. I stand by the quality of my wares, and I expect my customers to do the same! Wait, now...did Ultros send you?"},{"name":"BRIARDIEN","text":"...I'll be asking the questions here. What exactly did you sell to that ungodly creature?"},{"name":"SYNTGOHT","text":"Why, an entire sackful of gold truffles! Can you believe it? What with the impressive price and that, ah, <span class=\"emphasis\">distinctive</span> aroma, they're only for the most <span class=\"emphasis\">discerning</span> of customers. Which Mister Ultros clearly is, as he just placed another order today!"},{"name":"BRIARDIEN","text":"Could these truffles somehow be connected to─ No. I shall stop myself before I start sounding like..."},{"name":"HILDIBRAND","text":"Inspector Briardien! It wounds me─<span class=\"emphasis\">wounds</span> me─that you would sneak off to conduct your investigation without me. And to steal away <span class=\"highlight\">Forename</span> here? This gentleman is not impressed!"},{"name":"ELLIE","text":"Did you find anything, Inspector─good gods! What is that dreadful smell!?"},{"name":"HILDIBRAND","text":"Miss Ellie! I would have expected a cultured young woman like yourself to be more educated in the epicurean arts! That is the most distinct and delightful aroma of the gold truffle. An acquired taste, to be sure, but one that has won the heart of many an Ul'dahn gourmet!<br>I particularly enjoy them slow-roasted, as my dear mother makes them..."},{"name":"SYNTGOHT","text":"Roasted, you say? Why, my mouth's watering just thinking about it! Might I be so bold as to ask the recipe?"},{"name":"BRIARDIEN","text":"...It appears the productive portion of this conversation has come to an end. Besides, the tourney is about to begin. Let us make haste back to the Coliseum."}],"reward":{"gil":517,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[65738]},"next":[65740]},"partials":[{"type":"npc","id":"1010290","obj":{"i":1010290,"n":"Hildibrand","l":40,"q":2}},{"type":"npc","id":"1001679","obj":{"i":1001679,"n":"Syntgoht","l":41,"q":12}},{"type":"npc","id":"1010169","obj":{"i":1010169,"n":"Hildibrand","l":41,"q":1}},{"type":"npc","id":"1010185","obj":{"i":1010185,"n":"Nashu Mhakaracca","l":41,"q":1}},{"type":"npc","id":"1010313","obj":{"i":1010313,"n":"Hildibrand","l":41,"q":1}},{"type":"npc","id":"1010314","obj":{"i":1010314,"n":"Nashu Mhakaracca","l":41,"q":1}},{"type":"npc","id":"1010316","obj":{"i":1010316,"n":"Briardien","l":41,"q":1}},{"type":"quest","id":"65738","obj":{"i":65738,"n":"What Price Victory","g":68,"l":"Ul'dah","s":14,"f":1}},{"type":"quest","id":"65740","obj":{"i":65740,"n":"The Coliseum Conundrum","g":68,"l":"Ul'dah","s":16,"f":1}}]}