{"quest":{"name":"What Price Victory","location":"Ul'dah","id":65738,"patch":2.4,"sort":14,"icon":100311,"unlocksFunction":1,"eventIcon":71341,"issuer":1010279,"target":1010290,"involved":[1010286,1010293,1010298,1010310,1010312,1010523,1010784],"genre":68,"journal":["Hildibrand is contemplating the implications of Ultros's behavior.","Convinced that Ultros's suspicious behavior is simply the hapless advances of a lovesick octopus, Hildibrand chooses to pursue a different line of investigation: the gladiatrix Avila. Return to the Coliseum and inquire with Dour Meadow as to her current whereabouts.","Dour Meadow explains that Avila left the Coliseum a short while ago to share a flagon of ale with her countrymen, while warning you that the warrioress does not take kindly to others poking around in her personal affairs. Undeterred by these words, Hildibrand dashes off to continue his investigation. Follow him to the Coffer & Coffin in central Thanalan and see what knowledge might be gleaned.","At the Coffer & Coffin, a confident Avila assures her fellow Ala Mhigans that her victory in the upcoming tourney is all but certain. The conversation is not particularly enlightening, save for the information that Avila intends to pay a visit to her sister at the Nanawa Mines. Meanwhile, Ultros's plan to dispatch Hildibrand is foiled when the gentleman inspector, his nose well honed from his experiences with Nashu's homemade explosives, catches a whiff of the cleverly disguised bomb and hurls it off fortuitously in the direction of its maker. Your path free of danger, accompany Hildibrand to the mines and assist with his continued investigation.","Eavesdropping on the sisters' conversation reveals Avila's true motivation for entering the Mythril Cup─to claim the priceless relic and a better life for her and her sister─if not the source for her unfaltering confidence. With no remaining leads to pursue and the Mythril Cup set to commence, Ellie suggests a return to Ul'dah. In the meantime, Ultros's best-laid plans again go awry, as Hildibrand stumbles headfirst into a pitfall dug by the octopus in hopes of incapacitating you before the tourney can begin. Safe once more due to the uncanny instincts of the gentleman inspector, you are free to follow him off in the direction of the Gate of Nald.","Determined as ever to keep you from competing in the tourney, Ultros enlists the services of a chimera to forestall your return to Ul'dah. This plan proves to be as successful as his last two─which is to say, not very─when none other than Godbert, ever the Manderville man, arrives on the scene and makes short work of the beast. In a brief exchange, he mentions having come to Thanalan in search of inspiration for his latest work of goldsmithery, and offers a few words of encouragement to his son as his hour of truth in the Coliseum draws nigh. Meanwhile, Ultros finds an unlikely ally in the form of Gilgamesh, who has returned to avenge his defeat at the hands of you and your sleuthing companion. His fortune is short-lived, however, when he is spotted by Godbert, who sees in the colorful sea critter not just inspiration, but also potential materials for his masterworks. As the mustachioed muscle-head beats the unfortunate octopus into a bloody pulp, return to the Coliseum and rendezvous with the gentleman inspector.","His vaunted powers of deduction having failed to afford any knowledge that might avail him regarding the tourney at hand, Hildibrand is nevertheless not disheartened in the least, cheerily declaring that he will continue the investigation on the field of battle. This can only end well for all involved..."],"objectives":["Speak with Dour Meadow on the Steps of Thal.","Speak with Hildibrand at the Coffer & Coffin.","Speak with Hildibrand.","Follow Hildibrand to the Gate of Nald.","Speak with Hildibrand in front of the Coliseum."],"dialogue":[{"name":"HILDIBRAND","text":"Poor, misunderstood Ulty! Here we suspected him of criminal activity, when in truth he was just a gentle soul luckless in love! Oh, Ulty─can you find it in your squishy, slimy heart to forgive us!?"},{"name":"ELLIE","text":"...Yes, yes. Now, perhaps we should return to our investigation? If Avila is as suspicious as they say, perhaps we should follow her around for a bit. Dour Meadow back at the Coliseum should be able to enlighten us as to her whereabouts."},{"name":"HILDIBRAND","text":"An excellent idea, Miss Ellie, but I have a better one! Let us return to the Coliseum and speak with Dour Meadow. From him, we shall ascertain Miss Avila's whereabouts, upon which we shall follow her about to see if she is indeed as suspicious as they say! Come, Nashu, the investigation calls!"},{"name":"ORTHRUS","text":"Don't think Uncle Ulty didn't see you following me!"},{"name":"ORTHRUS","text":"What's the big idea, eh? I'm nothing more than a stupid octopus! Gwee-hee-hee..."},{"name":"ORTHRUS","text":"...Or am I?"},{"name":"ORTHRUS","text":"Come on, now, I just want what any octopus wants─a cute girl, untold riches, and the admiration of millions. Can't Uncle Ulty dream?"},{"name":"ORTHRUS","text":"Well, kids, hate to ink and run...then again, I <span class=\"emphasis\">am</span> an octopus!"},{"name":"NASHUMHAKARACCA","text":"Poor Mister Ultros didn't seem to have much luck with the ladies. Speaking only for myself, I'd love to have him for dinner! Perhaps in a nice lemon butter sauce..."},{"name":"DOURMEADOW","text":"Yes? What is it this time? I'm a busy man."},{"name":"DOURMEADOW","text":"Looking for Avila, you say? She said something 'bout sharin' a flagon with her countrymen over at the Coffer & Coffin. I reckon you might still find her there."},{"name":"DOURMEADOW","text":"I'll warn ye, though: if you're smart, you'll keep yer distance from that one. That poor bugger Ganelon tried to interview her for an article─thought the girl was going to rip his head clean off."},{"name":"DOURMEADOW","text":"How can I put this? She doesn't seem to take kindly to bein' asked questions of a personal nature, if you catch my drift."},{"name":"DOURMEADOW","text":"That said, if you're lookin' for a good sparrin' match to warm ye up for the tourney, that might be just the ticket. Gar har har!"},{"name":"HILDIBRAND","text":"(-Hildibrand-)I can assure you there will be no need for gratuitous fisticuffs, my good sir! With my remarkable powers of espionage, we will ascertain all the information we need without the fiery lass even being alerted to our presence. Let us be off!"},{"name":"DOURMEADOW","text":"If you're lookin' for Avila, like as not you'll find her at the Coffer & Coffin, sharin' a drink with her countrymen."},{"name":"HILDIBRAND","text":"Behold! The lovely Miss Avila, just as predicted! Let us keep watch from here, so as not to set off the girl's famed temper."},{"name":"AVILA","text":"How many times must I tell you? There is no cause for concern. The spoils shall be mine─it may as well be writ in stone."},{"name":"AVILA","text":"Do you realize what this means? We have suffered, and suffered long. But my victory shall mark a new era! Just as Raubahn Aldynn won a new life for himself in the Coliseum, I shall win a new life for our people!"},{"name":"AVILA","text":"The prize that I shall claim will bolster the wealth of our people a thousand─no, ten-thousandfold! In a land where wealth is power, we will be kicked to the gutter by the Ul'dahns no longer. And with that, I must be off to the Nanawa Mines to meet my sister."},{"name":"HILDIBRAND","text":"Miss Avila's self-assurance is ever a sight to behold! I deduce that my own chances of felling her on the field of battle are infinitesimal!"},{"name":"ELLIE","text":"...I could have told you that before you signed up. Come now, we have a suspect to pursue!"},{"name":"ORTHRUS","text":"Gwee-hee-hee! Trying to steal Avila from Uncle Ulty's tentacles, are you? I'm afraid <span class=\"emphasis\">that</span> isn't going to happen."},{"name":"ORTHRUS","text":"Yes, Uncle Ulty's homemade explosive will see that this is the end of the road for you. ...Does that make me a bad octopus?"},{"name":"HILDIBRAND","text":"Ah, the distinctive smell of firesand! Another one of your handcrafted explosives, I take it, Nashu?"},{"name":"NASHUMHAKARACCA","text":"Heavens no, Inspector! This is far too elaborate to be one of mine! Do you think whoever crafted this would be willing to give me a lesson?"},{"name":"ORTHRUS","text":"Th-They're onto me? Preposterous! Could it be that muscle-head isn't as stupid as he looks!?"},{"name":"HILDIBRAND","text":"...I see. In any event, I shudder to think of what might happen if an unsuspecting passerby chanced upon such a hazardous object. Allow me. Heave...ho!"},{"name":"ORTHRUS","text":"You gotta be kidding meeeeeeeeeeee!"},{"name":"HILDIBRAND","text":"That maiden in mining garb must be the sister of whom Miss Avila spoke. Let us listen a bit closer."},{"name":"AVILA","text":"I thought we agreed: no hard labor until your leg is healed! I swear, sometimes I think you were born solely to give your poor sister headaches!"},{"name":"HEGELINA","text":"...Says the girl who once fought off ten imperials with one good arm. Perhaps someday you'll understand that your little sister can take care of herself just as well as you. Speaking of which, what news of the tourney?"},{"name":"AVILA","text":"Worry not, Hegelina. I have taken all the necessary precautions. The Warden's Grace is as good as ours."},{"name":"AVILA","text":"Even the most modest estimates value its worth at some thirty million gil! Do you realize what this means? Necklaces from Eshtaime's! Sunsilk dresses! All the luxuries you've ever wanted will be yours!"},{"name":"AVILA","text":"The poor little girls in shabby clothes, objects of pity and scorn for the Ul'dahn upper crust─those days are over! After I claim victory, <span class=\"emphasis\">we</span> will take our rightful place at the top of society!"},{"name":"HEGELINA","text":"I...I don't know, Avi. Wealth is all well and good, but..."},{"name":"HEGELINA","text":"When I see you stand tall in the Coliseum, hundreds and thousands cheering your name, I...I am proud. No matter how humble our birth, if we stand strong, and stand together... This alone is all the wealth I ask for..."},{"name":"AVILA","text":"...That is your problem, Hegelina. You've always been too quick to settle for less than you're worth. But worry not, for your sister is watching over you. I will do this...for us. Now I must return─gods forbid one of those prying reporters overhears us."},{"name":"HEGELINA","text":"That's my Avi─unfazed by a duel to the death, yet terrified to be caught in a moment of tenderness. May the gods smile on you, Sister, and...be safe."},{"name":"HILDIBRAND","text":"&lt;sniff&gt; A more moving display of sisterly love I have not seen! And yet I fear it has afforded us little in the way of prospective clues."},{"name":"ELLIE","text":"It would seem Avila's obsession with victory runs even deeper than we imagined. That said, I can't help but feel a bond with the girl. My sister and I were alone in the world, too, you see..."},{"name":"NASHUMHAKARACCA","text":"Inspector! Did you just hear what I heard!?"},{"name":"ORTHRUS","text":"Look, kids, Uncle Ulty has had it up to here with you. D'ya think you could just fall in this pit and die like a good little <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>?"},{"name":"ORTHRUS","text":"Gwee-hee-hee... I'm talking to you, <span class=\"alternative-container\"><span class=\"alternative\">Missus</span><span class=\"alternative\">Mister</span></span> Warrior of Light. Hear that sound? Just one step closer...closer...!"},{"name":"ORTHRUS","text":"Not <span class=\"emphasis\">you</span>, you idiot!!!"},{"name":"HILDIBRAND","text":"...Ahem! No need for concern, friends! I have simply taken the liberty of investigating this hole in the ground, and am pleased to report that there seems to be nothing out of the ordinary!"},{"name":"ELLIE","text":"...Our hero. Now, shall we return to Ul'dah? The Mythril Cup will be starting before long, and the last thing we want after all this is to lose our bout by forfeit."},{"name":"ORTHRUS","text":"Could it be!? Did that muscle-head dive straight into my trap to save his companions?"},{"name":"ORTHRUS","text":"The others seem completely unsurprised at this turn of events. Doubtless he has performed such selfless acts before. A true gentleman if I ever saw one!"},{"name":"ORTHRUS","text":"...But if you think that means I'm gonna show mercy on you, you've got another think coming! Time to break out the big guns, kids!"},{"name":"ORTHRUS","text":"...Wait a minute. I dug two pits, didn't I? Come to think of it, the second one was right around..."},{"name":"ORTHRUS","text":"Gimme a breeeaaaaaakkk...!"},{"name":"ELLIE","text":"Whatever does he think he's found <span class=\"emphasis\">this</span> time?"},{"name":"ELLIE","text":"Yes? Is something the matter? We're on something of a tight schedule here, Inspector."},{"name":"HILDIBRAND","text":"Stand back, Miss Ellie! My well-honed inspector's senses are tingling. I feel a most fearsome adversary lurking about!"},{"name":"ORTHRUS","text":"This time you're <span class=\"emphasis\">really</span> up the creek without a paddle, kids. Mwa ha ha!"},{"name":"ORTHRUS","text":"Say hello to a not-so-little friend of mine from the Coliseum. He's large, he's in charge, and most of all...he's hungry! Gwee-hee-hee!"},{"name":"ORTHRUS","text":"Where in the world <span class=\"emphasis\">is</span> he!? I haven't got all <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>!"},{"name":"ORTHRUS","text":"M-My chimera! Who is that half-naked fool!?"},{"name":"HILDIBRAND","text":"Father! Could it be that the aura of unmitigated murderous rage that I felt was not our quarry, but <span class=\"emphasis\">you</span>!?"},{"name":"GODBERT","text":"Hildy! I was merely taking a stroll in search of inspiration and materials for my newest masterpiece in the making. And what brings you and your friends to these parts today?"},{"name":"HILDIBRAND","text":"Just a bit of sleuth work, Father dear. And with that, we must return to Ul'dah. If you have not heard, your son is set to compete for the Mythril Cup."},{"name":"GODBERT","text":"Oho! Moonlighting as a gladiator, are we? A fitting second career for a Manderville man, if I do say so myself!"},{"name":"ORTHRUS","text":"That muscle-bound old man is the inspector's <span class=\"emphasis\">father</span>!? Remind me never to go to one of their family reunions!"},{"name":"ORTHRUS","text":"Gah! Just who <span class=\"emphasis\">is</span> this inspector, anyway!?"},{"name":"GILGAMESH","text":"(-???-)Hildy is...a worthy rival, if ever there were one."},{"name":"ORTHRUS","text":"Wh-Who goes there!?"},{"name":"GILGAMESH","text":"Hildy...<span class=\"highlight\">Forename</span>. I have been waiting for this day."},{"name":"ORTHRUS","text":"Well, looky who we have here. You're quite the intimidating gent yourself. A friend of the inspector, mayhap?"},{"name":"GILGAMESH","text":"I am Gilgamesh, wandering duelist. And I am not so much the inspector's friend as...his enemy."},{"name":"ORTHRUS","text":"Well, that makes two of us! Perk up, Gulliver, 'cause this just might be our lucky day."},{"name":"GILGAMESH","text":"Is there <span class=\"emphasis\">no one</span> in this accursed realm who can remember my─ &lt;sigh&gt; Call me what you will, friend, but heed my words: <span class=\"highlight\">Forename</span> is a formidable foe."},{"name":"ORTHRUS","text":"That's soundin' like high praise comin' from a big fella like yerself. To have such a powerhouse as his sidekick, that inspector must be somethin' else indeed!"},{"name":"GILGAMESH","text":"I know not what brings you to do battle with those two, but I warn you: you will end up as seafood soup if you face them alone."},{"name":"GILGAMESH","text":"And with that, I must be off. For reasons that I do not entirely understand, I am considered something of a fugitive in these parts."},{"name":"GILGAMESH","text":"<span class=\"highlight\">Forename</span>... I will not fall so easily this time."},{"name":"ORTHRUS","text":"Well, it looks like I've got my legs full─all eight of 'em. But if that adventurer's too strong to take on alone..."},{"name":"ORTHRUS","text":"...I'll just have to bring along a friend. Mwa ha ha!"},{"name":"GODBERT","text":"A supplely twisting ring calling to mind the undulations of a creature of the sea! Yes, inspiration has struck!"},{"name":"ORTHRUS","text":"Eh heh heh... Uh, nobody here but us octopodes?"},{"name":"GODBERT","text":"Look forward to your next life as a masterpiece, fiend!"},{"name":"ORTHRUS","text":"Muscle-heads─I haaaaaaaaate 'em!"},{"name":"HILDIBRAND","text":"Good heavens! Chancing upon Father like that─I daresay it's taken a year off my life."},{"name":"HILDIBRAND","text":"Quite a crowd has assembled. It would seem the festivities are nigh about to commence!"},{"name":"HILDIBRAND","text":"I had hoped to uncover more of Miss Avila's secrets, but no matter! What better place to continue my investigation than on the field of battle!?"}],"reward":{"gil":1151,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[65702]},"next":[65739]},"partials":[{"type":"npc","id":"1010279","obj":{"i":1010279,"n":"Hildibrand","l":40,"q":1}},{"type":"npc","id":"1010290","obj":{"i":1010290,"n":"Hildibrand","l":40,"q":2}},{"type":"npc","id":"1010286","obj":{"i":1010286,"n":"Hildibrand","l":40,"q":2}},{"type":"npc","id":"1010293","obj":{"i":1010293,"n":"Hildibrand","l":43,"q":1}},{"type":"npc","id":"1010298","obj":{"i":1010298,"n":"Hildibrand","l":43,"q":1}},{"type":"npc","id":"1010310","obj":{"i":1010310,"n":"Hildibrand","l":43,"q":1}},{"type":"npc","id":"1010312","obj":{"i":1010312,"n":"Ellie","l":43,"q":1}},{"type":"npc","id":"1010523","obj":{"i":1010523,"n":"Dour Meadow","l":41,"q":1}},{"type":"npc","id":"1010784","obj":{"i":1010784,"n":"Nashu Mhakaracca","l":40,"q":1}},{"type":"quest","id":"65702","obj":{"i":65702,"n":"Eight-armed and Dangerous","g":68,"l":"Eastern La Noscea","s":13,"f":1}},{"type":"quest","id":"65739","obj":{"i":65739,"n":"The Trouble with Truffles","g":68,"l":"Ul'dah","s":15,"f":1}}]}