{"quest":{"name":"Peasants by Day, Ninjas by Night","location":"Limsa Lominsa","id":65748,"patch":2.4,"sort":1,"icon":100327,"unlocksFunction":1,"eventIcon":71341,"issuer":1009943,"target":1010139,"involved":[1010140,1010601,1010602,1010603,1010607,1010611,1010615],"genre":152,"journal":["Jacke has just the job for a dimber <span class=\"alternative-container\"><span class=\"alternative\">mort</span><span class=\"alternative\">cove</span></span> like yourself.","Impressed with the work you have done for his guild, Jacke tasks you with looking into a group of suspicious individuals who have attracted the attention of his men in recent days. Travel to Wineport, where the dodgy types have been seen, and rendezvous with your fellow rogue, Perimu Haurimu.","Perimu elaborates upon the target of your investigation─what little he has gleaned, at least─when your conversation is interrupted by the sound of a scream coming from within the town. Head into Wineport and investigate.","You enter Wineport to find a milkmaid─the source of the scream─standing over the bodies of three ruffians. She explains that she was almost mugged, until the brutes turned upon each other in a drunken scuffle which incapacitated all of them. Finding her story a bit <span class=\"emphasis\">too</span> convenient, Perimu heads off east of Wineport to investigate. Follow your guildmate and see what he has found.","Perimu finds a couple of farmhands lying on the ground, equipped with weapons and suffering from mortal wounds. Convinced more than ever that the innocent milkmaid is not what she appears to be, he heads off in pursuit. Accompany him to upper La Noscea and ascertain the girl's true identity.","No sooner do you and Perimu happen upon the girl than are you ambushed by an eccentric Easterner clad in red. A comrade of the girl's arrives, and the would-be assailant retreats, strongly implying that you've not seen the last of him. Conversing with the two reveals them as Oboro and Tsubame, <span class=\"emphasis\">shinobi</span> from the Far Eastern land of Doma, come to bring their traitorous countryman─the man named Karasu─to justice. Upon seeing the soul of his fallen brother respond to your touch, Oboro offers to instruct you in the art of his people in exchange for information that might assist him in his mission. Should you care to take him up on his offer, seek him out at the Raincatcher Gully docks.","Oboro is heartened by your arrival, and invites you to step inside the storehouse where the two of you may speak in private. He gives you the necessary password: when the gatekeep Byakubu speaks <span class=\"emphasis\">Ayame</span>, you are to answer <span class=\"emphasis\">Kaede</span>.","Your pronunciation of the Doman language seems to have satisfied Byakubu, who grants you passage into the ninja hideout. Speak with Oboro, who awaits you within.","Oboro expresses his gratitude for your cooperation, and gives you a brief summary of the ancient art passed down among his people for generations. As he tells it, the art─called <span class=\"emphasis\">ninjutsu</span>─involves channeling the powers of heaven, earth, and man, given physical form through the use of hand gestures known as <span class=\"emphasis\">mudra</span>. He teaches you your first mudra, <span class=\"emphasis\">Ten</span>, and invites you to attune yourself to the soul of his brother and speak with him again to commence your training."],"objectives":["Speak with Perimu Haurimu in Wineport.","Investigate Wineport for suspicious activity.","Speak with Perimu Haurimu.","Speak with the queer maid at Bronze Lake.","Speak with Oboro by the storehouse at the Raincatcher Gully docks.","Speak with Byakubu.","Speak with Oboro."],"dialogue":[{"name":"JACKE","text":"Ah, <span class=\"highlight\">Forename</span>. Keepin' yer stabbers sharpened, I hope? 'Cause I've got a job to be done, and I reckon the dimber damber what put the Executioners on the choppin' block is just the one to do the doin'."},{"name":"JACKE","text":"My men have sighted some shifty types 'round Wineport o' late. Not code-breakin' curs, so far as I know, an' that's the rub─we don't know half as much about them as I'd like."},{"name":"JACKE","text":"They claim to be simple peasants─refugees from some far-flung realm─but I don't know many peasants what skulk about in the darkmans as much as they've been doin'."},{"name":"JACKE","text":"So long as they're not breakin' the code, they can do as they please. But bein' who we are, it falls to us to look into the matter an' make sure that all's bob."},{"name":"JACKE","text":"As my gut tells me this may be a two-rogue job, I've sent Underfoot on ahead. So pull on yer best beater cases, head to Wineport, an' meet him there."},{"name":"JACKE","text":"This ain't the time for prittle prattle, <span class=\"highlight\">Forename</span>. I'm countin' on you and Underfoot to snilch Wineport and make sure that all's bob."},{"name":"PERIMUHAURIMU","text":"<span class=\"highlight\">Forename</span>! When Jacke said he'd be sendin' one o' the guild's canniest <span class=\"alternative-container\"><span class=\"alternative\">morts</span><span class=\"alternative\">coves</span></span> along after me, I had a feelin' it might be you."},{"name":"PERIMUHAURIMU","text":"Now, I'd love to tell ye ol' Underfoot's already whiddled the whole scrap on our friends, but truth is I've turned up more questions than answers."},{"name":"PERIMUHAURIMU","text":"They claim to hail from the south sea isles, but me little birds at Mealvaan's Gate swear to the last man that that's some piss-poor mummery. There's no record of any such ship sailin' into port."},{"name":"PERIMUHAURIMU","text":"Looks like it falls to you and me to take a closer snilch, aye? I hope ye brought yer sharpest stabbers, as there's no tellin' who we're─"},{"name":"PERIMUHAURIMU","text":"Did ye hear that, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Either ol' Underfoot's gone daft, or some mort just screamed out for dear life."},{"name":"PERIMUHAURIMU","text":"Somethin' tells me our little task is about to take a turn for the interestin'. What say we go see what's what?"},{"name":"TSUBAME","text":"H-Have mercy! I am but a simple milkmaid, with not a single gil to my name."},{"name":"PERIMUHAURIMU","text":"Rest easy, lass─my friend and I don't mean ye no harm. Though I must say ye've got me curious─just what in the name o' the Twelve happened here?"},{"name":"TSUBAME","text":"I had just come to town to purchase some supplies. No sooner had I walked through the gates than I was suddenly accosted by three burly drunkards who demanded that I hand over all of my possessions."},{"name":"TSUBAME","text":"To my good fortune, it seems the men had partaken a bit too heavily. When they saw the meager contents of my coinpurse, they began to squabble among themselves. A fistfight ensued, and before I knew it, the three men were lying on the ground as you see them now."},{"name":"PERIMUHAURIMU","text":"Sounds like Nymeia smiled upon you today, lass. Though might I suggest ye be a bit more careful on yer next visit. All manner of scurvy sorts frequent these parts, and you'll find that not all of them are blundering lackwits like yer friends here."},{"name":"TSUBAME","text":"Thank you for your concern, good sir, and rest assured that I will take your words to heart. Good day to the both of you."},{"name":"PERIMUHAURIMU","text":"Well, <span class=\"highlight\">Forename</span>? How did the girl's whids strike ye?"},{"name":"Q1","text":"What did you think of the girl?"},{"name":"A1","text":"Mummery, I say."},{"name":"A1","text":"Seemed like an upright lass."},{"name":"PERIMUHAURIMU","text":"You too? I was thinkin' the very same. Squabblin' amongst themselves? Just look─there's barely a scratch on any o' these louts."},{"name":"PERIMUHAURIMU","text":"Ye reckon? As for me, I've got me questions. Squabblin' amongst themselves? Just look─there's barely a scratch on any o' these louts."},{"name":"PERIMUHAURIMU","text":"Aye, I'd wager there's more to the rum doxy than she's lettin' on. Come, let's go on the drag and see what she might be hidin'."},{"name":"PERIMUHAURIMU","text":"...And a right mess we've got here. Ye reckon these coves got on the wrong side of our lass? One thing's for sure, they're no more peasants than you an' I─one look at those stabbers tells me as much."},{"name":"NINJA00212","text":"(-Man in Peasant Garb-)I have...failed...<br>I beg of you... Take this, and return it to Master Oboro...to Lady...Tsubame..."},{"name":"PERIMUHAURIMU","text":"...It's too late. The poor sod's dead. As for this stone, yer guess's as good as mine. A lucky charm o' sorts, mayhap?"},{"name":"PERIMUHAURIMU","text":"Anyroad, we'd best start movin' our dew beaters afore the lass gets away. Her footprints lead in the direction of upper La Noscea."},{"name":"KARASU","text":"(-???-)She hides behind a tree...as if that could hide her from me!"},{"name":"KARASU","text":"(-Eccentric Easterner-)She didn't <span class=\"emphasis\">really</span> think she could fool me with those silly rags, did she? Or <span class=\"emphasis\">did</span> she? Perhaps she's not as clever as we believed?"},{"name":"KARASU","text":"(-Eccentric Easterner-)And a mysterious savior rushes to the damsel's defense! Such <span class=\"alternative-container\"><span class=\"alternative\">bravery</span><span class=\"alternative\">chivalry</span></span>! Such compassion!"},{"name":"KARASU","text":"(-Eccentric Easterner-)...Such folly! Little does <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> know that the girl is <span class=\"emphasis\">more</span> than capable of taking care of herself."},{"name":"KARASU","text":"(-Eccentric Easterner-)...And right on cue! Oboro the dim leaps onto the scene to save his dear little swallow in the most unsurprising surprise attack the realm has ever seen!"},{"name":"OBORO","text":"(-Oboro-)Cease your ramblings, Karasu, before I rip that tongue from your bloody beak!"},{"name":"KARASU","text":"(-Karasu-)Yeeeow! Our hero is wounded! A stab through the heart! His childhood friends stand before him, blades drawn and hate in their eyes! Oh, the tragedy of it all! The audience sobs!"},{"name":"KARASU","text":"(-Karasu-)...And what's this? A couple of bit players who have forgotten to leave the stage? Did no one tell them their part in the play is long since over?"},{"name":"KARASU","text":"(-Karasu-)Oho! And the faceless rogue shows surprising skill! Perhaps <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> yet has a role to play? I will say this much: unlike a certain someone, at least you...<span class=\"emphasis\">intrigue</span> me."},{"name":"KARASU","text":"(-Karasu-)...But other matters demand our hero's attention, and so the first act must draw to a close. Come, my pet!"},{"name":"OBORO","text":"(-Oboro-)Wait! Karasu! ...Ever quick to retreat, that one."},{"name":"TSUBAME","text":"(-Queer Maid-)The <span class=\"alternative-container\"><span class=\"alternative\">two</span><span class=\"alternative\">two gentlemen</span></span> from Wineport? Did you...follow me here? "},{"name":"PERIMUHAURIMU","text":"Beg pardon, miss. My friend an' I are here on behalf o' the Dutiful Sisters. An' <span class=\"emphasis\">you</span>, Sister, have some questions to answer."},{"name":"PERIMUHAURIMU","text":"I've lived on the underbelly o' society long enough to recognize when a man's more than he seems. So make this easy for us, lass─just who exactly are ye, and what are ye doin' here? And here's hopin' for both your sakes that it doesn't involve breakin' no code."},{"name":"OBORO","text":"(-Oboro-)...So you are the rogues of whom Lady Yugiri spoke. Forgive me─we were remiss in not seeking you out sooner. Very well. You shall know all there is to know."},{"name":"OBORO","text":"(-Oboro-)...So you are the rogues of whom I have heard so much. Forgive me─we were remiss in not seeking you out sooner. Very well. You shall know all there is to know."},{"name":"OBORO","text":"My name is Oboro, and she is Tsubame. We hail from a village in Doma, several thousand malms across the sea. We are─ah, but perhaps you have no word for what we are. In our own tongue, one might call us <span class=\"emphasis\">shinobi</span>."},{"name":"PERIMUHAURIMU","text":"<span class=\"emphasis\">Doma</span>? The imperial province!?"},{"name":"TSUBAME","text":"...The same, though it did not have to be so. Our countrymen fought with honor against the might of Garlemald. What we lacked in number, we made up for with martial prowess. It was a battle we could have won...had we not been betrayed by one of our own."},{"name":"TSUBAME","text":"Our every secret, our every move known to our foe, the tide of battle turned on the morrow. Thousands of our countrymen were slaughtered, and at day's end, Doma remained under the imperial yoke."},{"name":"OBORO","text":"The traitorous cur joined the imperial ranks as chief of their covert operatives, or so they say. That is the man you just met, Karasu─though I am loath to call him a man."},{"name":"OBORO","text":"To this day, he whispers in the ears of the Garleans, making a mockery of those who once called him friend and brother─but no longer. We have come to Eorzea at our village elder's behest to see that Karasu pays for his crimes...with his life."},{"name":"PERIMUHAURIMU","text":"Come to mill a treacherous rook who blew the gab on his comrades? You sound like a right bene cove─consider ol' Underfoot impressed."},{"name":"OBORO","text":"...Hm? Forgive me─this land and its tongue are still new to us. Nonetheless, we were able to lure Karasu here, but more than a few of our comrades gave their lives in the effort. And now this... Was their sacrifice for naught?"},{"name":"OBORO","text":"Ah... You have my gratitude. When one of our kind falls, tradition dictates that we return their soul to the village, that it may rest with our ancestors."},{"name":"OBORO","text":"What!? Our fallen brother's soul calls out to this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>? Could it be a sign? Are we fated to fight as one?"},{"name":"OBORO","text":"I would make you an offer. We will instruct you in our art─the art of ninjutsu. In return, you will share with us your knowledge of this land, that it might serve us in our mission."},{"name":"TSUBAME","text":"B-But, Oboro! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is not Doman! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is not of the village!"},{"name":"OBORO","text":"Look around you, Tsubame. Our brothers and sisters are fallen or gravely wounded. And today's failure makes it all too clear─we cannot hope to stand against Karasu without knowing the lay of the land."},{"name":"PERIMUHAURIMU","text":"Can't say I'm thrilled at the prospect o' losin' a dimber damber like yerself, but hells! In my younger days, I'd like been keen to try my fams at some o' those techniques myself!"},{"name":"PERIMUHAURIMU","text":"An' the more my wattles take in, the more these two strike me as benar and benar folks. If yer keen to lend them yer daddles, I'll not be the one to stand in yer way."},{"name":"OBORO","text":"If you would know more, come to the dock storehouse at Raincatcher Gully. We shall await you there."},{"name":"PERIMUHAURIMU","text":"Who'd have figured, eh? Anyroad, the choice is yours, <span class=\"highlight\">Forename</span>. In the meantime, I'm goin' to head back to Limsa and report to Jacke afore he comes an' gives me a good clout in the nob."},{"name":"TSUBAME","text":"Tradition forbids us from sharing our art with those from outside our village. Yet watching you hold your own against Karasu today, I cannot deny your potential..."},{"name":"OBORO","text":"And so we meet again. Am I to take your presence to mean that you have chosen to accept our offer?"},{"name":"Q2","text":"Accept Oboro's offer?"},{"name":"Q2","text":"Yes"},{"name":"Q2","text":"No"},{"name":"OBORO","text":"...Thank you. I speak not only for myself and Tsubame but for our entire village when I say that you have our profound gratitude."},{"name":"OBORO","text":"What I would tell you next, I would tell you out of the earshot of strangers. Byakubu has been instructed to let only trusted visitors through the doors behind me."},{"name":"OBORO","text":"When he speaks to you <span class=\"emphasis\">a-ya-me</span>, you are to answer <span class=\"emphasis\">ka-e-de</span>. You need not know what the words mean, only that they will grant you entrance."},{"name":"OBORO","text":"...I see. This disappoints me, yet it is honorable of you to deliver the message in person. Should you ever have a change of heart, pray return to us."},{"name":"TSUBAME","text":"Oboro has chosen to accept you, and it is not my place to question his judgment. From this day on, you are one of us."},{"name":"BYAKUBU","text":"<span class=\"emphasis\">A...ya...me</span>..."},{"name":"Q3","text":"How will you answer?"},{"name":"A3","text":"<span class=\"emphasis\">Kaede</span>."},{"name":"A3","text":"<span class=\"emphasis\">Kaeru</span>."},{"name":"BYAKUBU","text":"...Enter."},{"name":"BYAKUBU","text":"...Begone."},{"name":"BYAKUBU","text":"...Master Oboro awaits."},{"name":"OBORO","text":"Welcome, <span class=\"highlight\">Forename</span>. You stand within the provisional base of operations my people have established in your land of Eorzea."},{"name":"OBORO","text":"It may not look like much─either without or within─but that is precisely the point. We find it an ideal vantage point from which to observe the comings and goings of Karasu and his men without attracting undue attention to ourselves."},{"name":"OBORO","text":"My fallen brother saw you as a worthy inheritor to his soul. To honor his memory, I entrust it to you. But soul alone will not make you a <span class=\"emphasis\">shinobi</span>. No, this will require training of the body and mind."},{"name":"OBORO","text":"Our art─the art of ninjutsu─originated with our ancestors many years ago. Since then, it has been passed down with each generation...mother to daughter, father to son."},{"name":"OBORO","text":"We draw power from the world around us─the heaven, the earth, and the hearts of man─and channel this power into physical form. I am told that this is similar to your concept of...<span class=\"emphasis\">ay-ther</span>, was it? I must confess that Eorzean words and ways remain unfamiliar to me."},{"name":"OBORO","text":"How does one channel this power, you ask? Through the use of <span class=\"emphasis\">mudra</span>, hand gestures that call forth each of the three forms of energy of which I spoke. The first mudra I will teach you will call power from the heavens. In Doma, we call this <span class=\"emphasis\">Ten</span>."},{"name":"OBORO","text":"You are eager to learn, yes? Attune your soul to that of my fallen brother, then approach me once more. It is then that your training will begin."}],"reward":{"action":2259,"items":[{"id":7886}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":91}],"questsType":"all","quests":[65691,66049]},"next":[65749]},"partials":[{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1010140","obj":{"i":1010140,"n":"Tsubame","l":32,"q":6}},{"type":"npc","id":"1010601","obj":{"i":1010601,"n":"Byakubu","l":32,"q":2,"t":"Gatekeep"}},{"type":"npc","id":"1010602","obj":{"i":1010602,"n":"Perimu Haurimu","l":32,"q":1}},{"type":"npc","id":"1010603","obj":{"i":1010603,"n":"Queer Maid","l":32,"q":1}},{"type":"npc","id":"1010607","obj":{"i":1010607,"n":"Perimu Haurimu","l":32,"q":1}},{"type":"npc","id":"1010611","obj":{"i":1010611,"n":"Queer Maid","l":34,"q":1}},{"type":"npc","id":"1010615","obj":{"i":1010615,"n":"Oboro","l":32,"q":2}},{"type":"action","id":"2259","obj":{"i":2259,"n":"Ten","c":2901,"j":30,"t":4,"l":30}},{"type":"item","id":"7886","obj":{"i":7886,"n":"Soul of the Ninja","l":30,"c":26037,"t":62}},{"type":"quest","id":"65691","obj":{"i":65691,"n":"Cloying Victory","g":132,"l":"Limsa Lominsa","s":301,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"65749","obj":{"i":65749,"n":"My First Mudra","g":152,"l":"Eastern La Noscea","s":2,"f":1}}]}