{"quest":{"name":"My First Hatchet","location":"Gridania","id":65744,"patch":2.0,"sort":11,"icon":100056,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1000815,"genre":145,"usedItems":[5509],"journal":["Fufucha wishes to assign you your first task as a botanist.","Keen that you should acquire the basics of botany through practical experience, Fufucha bids you harvest ten pots' worth of latex. The mature trees that stand outside the Blue Badger Gate and the Yellow Serpent Gate should yield that which you require.","You have successfully harvested and delivered the pots of latex. Praising you for your work, Fufucha encourages you to continue honing your skills as a botanist.<br><br>※The next botanist quest will be available from Fufucha upon reaching level 5."],"objectives":["Deliver pots of latex to Fufucha at the Botanists' Guild."],"dialogue":[{"name":"FUFUCHA","text":"I see you have your hatchet on you. Very good."},{"name":"FUFUCHA","text":"A botanist's hatchet is his livelihood. Never forget this. If you fail to keep its blade clean and keen, your efforts will yield you naught but sweat and splinters."},{"name":"FUFUCHA","text":"But let us see about your first task... Ah, yes. To help you grasp the basics of botany, I would like you to gather ten pots' worth of latex."},{"name":"FUFUCHA","text":"The forest yields to us many and more resources. It is the botanist's job to know what can be found, and where."},{"name":"FUFUCHA","text":"If it is latex you require, you would do well to search just outside the Blue Badger Gate or the Yellow Serpent Gate."},{"name":"FUFUCHA","text":"Seek out the mature trees that stand in those areas, and then put your hatchet to use. I wish you well."},{"name":"SYSTEM","text":"Botanists can use hatchets and other cutting tools to log the forests of Eorzea and gather materials used in crafting."},{"name":"SYSTEM","text":"Trees that are prime for logging are known as <span class=\"highlight\">mature trees</span>."},{"name":"SYSTEM","text":"To locate mature trees, make your way out of the city and then use the botanist action known as <span class=\"highlight\">Triangulate</span>."},{"name":"FUFUCHA","text":"How goes the gathering effort? Lest you forget, latex can be had just outside the Blue Badger Gate and the Yellow Serpent Gate."},{"name":"FUFUCHA","text":"Ah, yes. Precisely ten pots of latex, just as I instructed. You have done well."},{"name":"FUFUCHA","text":"Latex is easy to find and equally easy to harvest. As such, collecting the stuff is an ideal task for young botanists who are learning their way around a hatchet."},{"name":"FUFUCHA","text":"Yet know that being able to swing said tool does not make you a botanist. You must also possess the knowledge to locate the resources you seek."},{"name":"FUFUCHA","text":"That will be all from me for the present. I urge you to keep honing your senses and skills as a botanist. Gather near and far, and learn from your experiences."},{"name":"FUFUCHA","text":"I look forward to seeing you again when you have become better acquainted with our trade. Till then, I bid you happy gathering!"},{"name":"SYSTEM","text":"The next botanist quest will be available from Fufucha upon reaching level 5."}],"reward":{"gil":115,"items":[{"id":2959}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":18}],"quests":[65539]},"next":[65540]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"2959","obj":{"i":2959,"n":"Hempen Dalmatica of Gathering","l":1,"c":42016,"t":35}},{"type":"item","id":"5509","obj":{"i":5509,"n":"Latex","l":5,"c":22643,"t":54,"p":7}},{"type":"quest","id":"65539","obj":{"i":65539,"n":"Way of the Botanist","g":145,"l":"Gridania","s":10,"f":1}},{"type":"quest","id":"65540","obj":{"i":65540,"n":"Sap for Smiles","g":145,"l":"Gridania","s":50,"f":1}}]}