{"quest":{"name":"Mmmmmm, Soulglazed Relics","location":"North Shroud","id":65742,"patch":2.38,"sort":5,"icon":100300,"unlocksFunction":1,"eventIcon":71341,"issuer":1008948,"target":1008948,"involved":[1003075],"genre":73,"journal":["By his penetrating gaze, you have a feeling that Jalzahn has further plans for your relic weapon.","According to Jalzahn, your relic weapon is presently not benefiting fully from the soul energy it holds. The problem, he posits, lies in the unattuned state of that energy to its host. Having struck a wall in his search for a solution, Jalzahn bids you recruit the assistance of the ill-tempered weaponsmith Gerolt.","Owing to your quick thinking, Gerolt has reluctantly agreed to lend his expertise to your cause. Deliver the good tidings to Jalzahn.","In an unlikely alliance, Jalzahn and Gerolt have devised the means by which your weapon may be further enhanced. It seems that, by rendering the relic aethertight by way of a special glaze, you will be able to attune its soul energy through normal use. Speak with Jalzahn when you are ready to begin the process.","Jalzahn has entrusted you the care of Gerolt's Zodiac glass. Present to him the relic you wish enhanced, and he will coat it in soulglaze.<br><br>※Should you misplace the Zodiac glass, you may obtain a new one by speaking with Drake at Hyrstmill."],"objectives":["Speak with Gerolt.","Speak with Jalzahn."],"dialogue":[{"name":"JALZAHN","text":"I trust you have been keeping well, my friend. As you can doubtless guess, my research into the enhancement of your relic continues."},{"name":"JALZAHN","text":"Most recently, I have been delving into the subject of “soul attunement.” Allow me to explain how it pertains to our endeavor."},{"name":"JALZAHN","text":"Through no small amount of effort on your part, your weapon has become host to abundant soul energy."},{"name":"JALZAHN","text":"However, it seemed to me that the relic was not as powerful as it should have been. It was plainly not benefiting fully from the energy it held."},{"name":"JALZAHN","text":"After conducting some tests, I believe I have identified the problem: the degree of soul attunement."},{"name":"JALZAHN","text":"You see, though soul energy permeates your weapon, at present, that energy is not attuned to its host. As such, much of it remains latent and untapped."},{"name":"JALZAHN","text":"If your weapon is to realize its potential, it must have full access to this energy. Alas, I fear that my expertise alone has not sufficed to find a solution to this problem."},{"name":"JALZAHN","text":"Being the person who reforged your weapon, Gerolt may well possess knowledge that is of use to us."},{"name":"JALZAHN","text":"However, you will recall that the man hasn't been exactly accommodating of my requests for assistance. Unless some manner of miracle has come to pass, I doubt that he would be willing to help me now."},{"name":"JALZAHN","text":"But you, my friend─you have something of a rapport with Gerolt, yes? I believe you stand a far better chance of winning him over to our cause. I would be much obliged if you could speak with him in my stead."},{"name":"SYSTEM","text":"In order to receive the quest “Mmmmmm, Soulglazed Relics,” you must be equipped with a relic weapon novus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"SYSTEM","text":"In order to advance the quest “Mmmmmm, Soulglazed Relics,” you must be equipped with a relic weapon novus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"GEROLT","text":"If yer here fer yer kettle, it ain't ready. Takes time to get the contours jus' right, ye ken?"},{"name":"GEROLT","text":"...<span class=\"emphasis\">You</span> again!? Can't a man mend kettles in peace!? What in the seven hells do ye want this time!?"},{"name":"GEROLT","text":"Eh? Advice on how to enhance yer relic of eld? Well, might be as I can help ye, but what's in it fer me? Why should I drop me kettle-mendin' jus' so ye can kill things better?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Because we're friends─you and I and <span class=\"emphasis\">Rowena</span>."},{"name":"A2","text":"You might learn a trick or two for your kettles."},{"name":"A3","text":"You'll get to lord it over Jalzahn."},{"name":"GEROLT","text":"Ye call us friends an' say that harlot's name in the same breath!? Yer a black-hearted bloody bastard, ye know that!? Hmph!"},{"name":"GEROLT","text":"Hmmm... As much as I hate to admit it, ye might be on to somethin'. I've been short on inspiration fer me kettle work o' late."},{"name":"GEROLT","text":"Hmmm... Now that ye mention it, puttin' that know-it-all in his place would certainly make me feel better 'bout meself..."},{"name":"GEROLT","text":"Fine, I'll hear what Jalzahn has to say. Ye go an' tell him to get his arse over here."},{"name":"JALZAHN","text":"Have you spoken with Gerolt yet? Seeing as you have something of a rapport with the man, you stand a far greater chance than me of winning him over to our cause."},{"name":"JALZAHN","text":"Gerolt has agreed to help us? Incredible! I know not what honeyed words you used to convince him, but it seems you are as skilled with your tongue as you are with your weapon. But come, let us waste no time."},{"name":"GEROLT","text":"I'm told ye've got questions fer me, old man. I ain't got all day, so be quick 'bout it."},{"name":"JALZAHN","text":"Very well. As you are doubtless aware, with <span class=\"highlight\">Forename</span>'s assistance, I have sought to recreate the mighty arms as wielded by the Zodiac Braves of legend. Thus far, we have succeeded in..."},{"name":"GEROLT","text":"...So ye want to attune the relic's soul energy to its host. Is that right?"},{"name":"JALZAHN","text":"Precisely, Master Gerolt. Have you any advice to give us regarding this endeavor?"},{"name":"GEROLT","text":"Aye, I reckon I do. Ye need to <span class=\"emphasis\">isolate</span> the energy inside yer relic from external influence."},{"name":"GEROLT","text":"Ye see, soul energy naturally becomes attuned to its host through use. Problem is, bein' composed of aether, that energy's fickle as sin─gets easily distracted by forces outside the host."},{"name":"GEROLT","text":"Fer attunement to happen, ye need to get rid o' them pesky outside forces. Ye can do this by makin' yer weapon “aethertight.” Buggered if I know how, though─ye'll have to work that bit out yerself."},{"name":"GEROLT","text":"Anyroad, once yer weapon's aethertight, ye just need to use it as usual─run around an' kill things with it. Over time, the energy ought to become one with its host. After that, I imagine ye'll need to undo the, er...aethertight<span class=\"emphasis\">ness</span>, or the newfound power will remain sealed."},{"name":"JALZAHN","text":"Isolation! But of course! This is far simpler and more elegant a solution than I had dared to imagine!"},{"name":"JALZAHN","text":"Now, I believe I can readily prepare a glaze that will render the relic impassable to aether. However, when will we know that sufficient attunement has been achieved, and the glaze is ready to be removed?"},{"name":"GEROLT","text":"Ye know them Archons from Sharlayan? They use newfangled goggles what allow the wearer to see traces of aether. We can make somethin' similar, I reckon."},{"name":"GEROLT","text":"Mind ye, we don't need nothin' near as sophisticated. A magnifyin' glass fitted with lenses what're crafted from aether-sensitive material ought to serve our needs."},{"name":"JALZAHN","text":"Ah, yes! By blending finely ground crystals with glass, it should be possible to create such lenses as you describe. A truly inspired idea! You are a genius, Master Gerolt!"},{"name":"GEROLT","text":"Praise is nice an' all, but it won't slake a man's thirst. If ye want to show yer admiration, do it with a drink."},{"name":"JALZAHN","text":"But of course, my friend! For your invaluable assistance, I shall distill for you a fiery liquor the likes of which you have never tasted!"},{"name":"GEROLT","text":"Ooh, now yer talkin'! Ye ain't half bad, old man!"},{"name":"GEROLT","text":"Now, it jus' so happens I've got leftover materials to make our magnifyin' glass. I'll get to work on it right away!"},{"name":"GEROLT","text":"&lt;pant&gt; &lt;pant&gt; It's...it's ready... With this, ye'll be able to check soul attunement levels at a glance."},{"name":"GEROLT","text":"I call it the Zodiac glass! See that you put it to good use, ye hear?"},{"name":"JALZAHN","text":"Your skills are beyond compare, Master Gerolt! For my part, I shall prepare the coating for <span class=\"highlight\">Forename</span>'s relic anon."},{"name":"JALZAHN","text":"When your preparations are in order, come and see me, and we shall make your weapon aethertight. I take my leave of you."},{"name":"GEROLT","text":"I'll hear what Jalzahn has to say. Ye go an' tell him to get his arse over here."},{"name":"JALZAHN","text":"The gods smile upon our endeavor once more, my friend. I shall entrust the Zodiac glass to your care, that you may use it to examine soul attunement levels wherever you desire."},{"name":"JALZAHN","text":"Should you misplace it, you will need to speak with Gerolt's apprentice. Drake is his name, and he will furnish you with a replacement."},{"name":"JALZAHN","text":"As for the aethertight coating, I am pleased to say that it is ready. In observance of the fine tradition of naming our creations, it shall be known as soulglaze!"},{"name":"JALZAHN","text":"Present to me the relic you wish enhanced, and I shall coat it with a layer of soulglaze. Thence begins the next stage of our quest to recreate the legendary arms of the Zodiac Braves!"},{"name":"SYSTEM","text":"It is now possible to upgrade your relic weapon novus by way of soulglazing."},{"name":"SYSTEM","text":"To begin the process, speak with Jalzahn while in possession of the relic you wish to enhance, then select <span class=\"highlight\">Relic Weapon Novus Soulglazing</span>."},{"name":"GEROLT","text":"Heh, it's been too bloody long since I've tasted foreign spirits. I can't wait to see what Jalzahn'll bri─<br>...Eh? What're ye still doin' here? Bugger off an' leave me in peace!"}],"reward":{"gil":658,"items":[{"id":8659}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67000]},"next":[65892]},"partials":[{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"item","id":"8659","obj":{"i":8659,"n":"Zodiac Glass","l":1,"c":25939,"t":63}},{"type":"quest","id":"67000","obj":{"i":67000,"n":"Star Light, Star Bright","g":73,"l":"Central Thanalan","s":4,"f":1}},{"type":"quest","id":"65892","obj":{"i":65892,"n":"Wherefore Art Thou, Zodiac","g":73,"l":"North Shroud","s":6,"f":1}}]}