{"quest":{"name":"My First Head Knife","location":"Gridania","id":65745,"patch":2.0,"sort":11,"icon":100060,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1000691,"genre":140,"usedItems":[5275],"journal":["To gauge your potential, Guildmaster Geva wants you to prepare a circle of leather.","Geva has instructed you to prepare a circle of leather. Craft the item as requested and present it to her.","Geva sees potential in you, despite your painfully amateurish technique. Potential is nothing without commitment, however. If you harbor hopes of producing work worthy of the Fen–Yll name, you must continue to apply yourself. Though the burden of expectation is heavy, you resolve to spare no effort in your attempt to master the craft of leatherworking.<br><br>※The next leatherworker quest will be available from Geva upon reaching level 5."],"objectives":["Deliver a circle of leather to Geva."],"dialogue":[{"name":"GEVA","text":"Well, you've passed the first test─gripping your knife by the handle and not the pointy end."},{"name":"GEVA","text":"Now it's time to see how well you can wield it."},{"name":"GEVA","text":"Make me a circle of leather. You'll need an animal skin to do so."},{"name":"GEVA","text":"Newcomers to our craft often imagine that they need to hunt in order to obtain their materials. But if you have the sense the gods gave a chocobo's arse, you'd realize that's <span class=\"emphasis\">hardly</span> the case."},{"name":"GEVA","text":"Osgyth, over by our receptionist, sells most of the items commonly used in our craft. However, she cannot supply you with earth shards."},{"name":"GEVA","text":"And that's it for my advice─the rest is up to you. Once you've made the circle of leather, bring it here to be inspected."},{"name":"GEVA","text":"I can't say I have great expectations for your work. Just see to it you do not waste good skins. Now, away with you."},{"name":"SYSTEM","text":"To synthesize a circle of leather for Guildmaster Geva, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>."},{"name":"GEVA","text":"Isn't the leather ready yet?"},{"name":"GEVA","text":"When you've finished, bring it here to be inspected. See Osgyth if you lack the necessary materials."},{"name":"SYSTEM","text":"To synthesize a circle of leather for Guildmaster Geva, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>."},{"name":"GEVA","text":"Aye, this is indeed leather...after a fashion."},{"name":"GEVA","text":"Your work is amateurish in the extreme. The leather is unevenly tanned and practically unusable."},{"name":"GEVA","text":"But you show promise."},{"name":"GEVA","text":"Well, about as much promise as the leather you haphazardly crafted."},{"name":"GEVA","text":"Still, it is apparent that you paid due respect to the life from which it came."},{"name":"GEVA","text":"Had you performed any worse, I'd have cast you out without a second thought. But you didn't, so I won't. Approach each task in earnest as you did today, and I'll continue to advise you."},{"name":"GEVA","text":"However, you alone are responsible for your development. This is a business we're running, and neither I nor your seniors have the time to hold your hand."},{"name":"GEVA","text":"Apply yourself to learning our techniques, and return here when you have acquired some skills. Mayhaps then I will have an errand for you to run."},{"name":"SYSTEM","text":"The next leatherworker quest will be available from Geva upon reaching level 5."}],"reward":{"items":[{"num":150,"id":5},{"num":100,"id":4},{"num":10,"id":5291},{"id":2961}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":13}],"quests":[65641]},"next":[65642]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"item","id":"5291","obj":{"i":5291,"n":"Animal Skin","l":1,"c":21819,"t":52,"p":4}},{"type":"item","id":"2961","obj":{"i":2961,"n":"Hempen Kurta","l":1,"c":42233,"t":35}},{"type":"item","id":"5275","obj":{"i":5275,"n":"Leather","l":1,"c":22020,"t":52,"p":8}},{"type":"quest","id":"65641","obj":{"i":65641,"n":"Way of the Leatherworker","g":140,"l":"Gridania","s":10,"f":1}},{"type":"quest","id":"65642","obj":{"i":65642,"n":"A Test of Technique","g":140,"l":"Gridania","s":50,"f":1}}]}