{"quest":{"name":"The Coliseum Conundrum","location":"Ul'dah","id":65740,"patch":2.4,"sort":16,"icon":100313,"unlocksFunction":1,"eventIcon":71341,"issuer":1010317,"target":1010330,"involved":[1001679,1010161,1010326,1010328,1010329,1010331,1010334,1010703,1010772],"genre":68,"journal":["Briardien has seen enough incompetence for the day.","Frustrated at yet another interruption at the hands of his nemesis Hildibrand, Briardien has resolved to continue the investigation at the Coliseum, where the Mythril Cup melee will soon begin. Return and speak with Dour Meadow.","The Mythril Cup melee commences! With the other combatants distracted in the heat of battle, Ultros attempts to employ the gold truffles he purchased from Syntgoht to elicit a mighty sneeze from his friend Typhon─the power behind Avila's so-called Tempest Blade. However, the purple fiend only succeeds in getting the fungi roasted to savory perfection by the unwitting Hildibrand. Inspector Briardien swiftly observes the Ala Mhigan gladiatrix's suspicious movements, shortly thereafter revealing Typhon and the conspirators' scheme for all to see. Ultros squirms out of responsibility by assigning all the blame to Avila, successfully convincing Dour Meadow to hold a final event among those who still remain standing in the wake of the storm. Speak with Briardien before departing for the climactic confrontation.","Less than impressed at the octopus's machinations, Briardien expresses his confidence in your ability to make some sense out of this madness. Make for Halatali and speak with Dour Meadow when you are ready to do battle.","The final battle for the Mythril Cup─and the priceless relic sought by the phantom thief─will pit you and seven of your comrades against the dastardly duo of Ultros and Typhon in a special arena known as the Dragon's Neck. Who will remain standing when the storms subside? The challenge awaits!<br><br>※The Dragon's Neck can be accessed via the Duty Finder.","You succeed in making seafood soup out of Ultros and his oversized companion. Speak with Inspector Briardien, who will doubtless be pleased with your efforts.","Briardien praises you for your efforts, which he hopes will serve to keep the priceless relic out of the grasp of the many-faced thief. Return to the Coliseum and speak with Dour Meadow to claim your hard-earned spoils.","No sooner had the award ceremony begun than does the phantom thief make his grand entrance. Hildibrand confronts him, only to find his path obstructed by a spear cast by Gilgamesh, who has returned to avenge the defeat he suffered at your hands. Hildibrand moves quickly, deftly disarming his erstwhile traveling companion. As the hulking duelist angrily chases the inspector about the Coliseum, the phantom thief takes advantage of the chaos, dropping from the rafters a single gold truffle. Its aroma tickles the sensitive nose of Typhon, the resulting sneeze sending the ring soaring through the air. Just as Hildibrand has given up hope, Godbert returns, seizing his son by the legs and hurling him heavensward─and clear through the Coliseum roof─with truly Mandervillian strength. Events take another turn when the victor's ring is revealed as a fake, and the thief produces a common key and declares his intentions to claim the <span class=\"emphasis\">true</span> treasure─the Ring of Inquiry, sat safely in the storehouse as a consolation prize. Upon hearing this, Dour Meadow panics and calls for the Stone Torches to pursue, but it is for naught, as the fiend absconds with the priceless relic. As Inspector Briardien and Ellie ponder what has transpired, a massive challenge card falls from above, and another mighty sneeze─this time from Nashu─sends it toppling over the unfortunate Hildibrand. The message speaks of four sacred treasures and justice served, which Godbert recognizes as a reference to an old legend from the times of the Belah'dians. Inspector Briardien and Ellie muse that the thief holds a deep-seated grudge against the wealthy and the powerful, but other than that, it is not immediately evident where the thief intends to strike next..."],"objectives":["Speak with Dour Meadow.","Speak with Briardien.","Speak with Dour Meadow at Halatali.","Confront Ultros atop the Dragon's Neck.","Speak with Briardien.","Speak with Dour Meadow inside the Coliseum."],"dialogue":[{"name":"BRIARDIEN","text":"Well, that merchant proved to be a spectacular waste of time─time which is in short supply. We must return to the Coliseum before the battles begin."},{"name":"BRIARDIEN","text":"Here is the plan, <span class=\"highlight\">Forename</span>: I shall find a suitable vantage point to observe Miss Avila in combat. Until I have ascertained the trickery behind her abilities, you are to keep a wide berth of her blade. Understood?"},{"name":"HILDIBRAND","text":"Do you feel the anticipation in the air, my friend!? This shall go down in Eorzean history as the greatest battle since I slew that dragon! ...That did actually happen, yes?"},{"name":"BRIARDIEN","text":"I shall find a suitable vantage point to observe Miss Avila in combat. Until I have ascertained the trickery behind her abilities, you are to keep a wide berth of her blade. Understood?"},{"name":"SYNTGOHT","text":"<span class=\"emphasis\">Truffles à la Manderville</span>! Why, it is an epicurean revelation! I can hardly wait to recreate the recipe myself."},{"name":"DOURMEADOW","text":"<span class=\"emphasis\">There</span> you are! I was this close to startin' the melee without you! Gar har har!"},{"name":"DOURMEADOW","text":"Ah, I'd be remiss not to tell ye that there's been a slight change o' plans. Another contestant suffered a last-minute injury, and none other than our very own Ultros has stepped in to take his place."},{"name":"DOURMEADOW","text":"With everyone's favorite octopus joining you two in the fray, spectators are just pourin' in, and bookmakers across town are rakin' in the gil─which ain't a bad thing for us."},{"name":"DOURMEADOW","text":"Word has it that Master Fyrgeiss himself is quite taken with my promotional skills. Aye, the future's lookin' bright for ol' Dour Meadow, it is!"},{"name":"DOURMEADOW","text":"So, what say ye? Are ye ready to get yer arses kicked? Gar har har!"},{"name":"Q1","text":"Ready for battle?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"DOURMEADOW","text":"Well, then you'd better <span class=\"emphasis\">get</span> ready, and in a hurry! The audience is clamorin' for blood, and if it ain't <span class=\"emphasis\">your</span> blood, it's gonna be mine, ye hear?"},{"name":"DOURMEADOW","text":"Aye, that's what I like to hear! Ladies and gents, it's time for blades to whirl and limbs to fly!"},{"name":"DOURMEADOW","text":"Ladies and gentlemen, boys and girls, plutocrats and paupers, open your eyes and steel your stomachs! The Mythril Cup, brought to you by our ever-charitable friends at Amajina & Sons Mineral Concern─“Your concern is <span class=\"emphasis\">our</span> concern!”─is about to begin!"},{"name":"DOURMEADOW","text":"Who will stand atop the heap of maimed bodies and twisted limbs to claim victory!? Will it be the tempestuous Avila of Ala Mhigo!? <span class=\"highlight\">Forename</span>, the famed Warrior of Light? Or─who was that grinnin' fool again? Ah, that's right─Humberbatch, agent of infamy and imbecile extraordinaire!"},{"name":"DOURMEADOW","text":"Or, will it be our eleventh-hour entry, Ultros, the eight-legged purple purveyor of pain!"},{"name":"ORTHRUS","text":"Mwa ha ha! Here I am! Did ya miss me!?"},{"name":"DOURMEADOW","text":"Aye, I'd say we have a battle for the ages here, folks! Combatants, take your positions, and...let the battles begin!"},{"name":"ORTHRUS","text":"(Alright, you know the deal: we team up and wipe out the others. Then, when it's just the two of us, I'll take a dive.)"},{"name":"AVILA","text":"(...And you receive your share of the winnings. I have not forgotten our promise.)"},{"name":"DOURMEADOW","text":"Look at Avila's blade spin! Why, she's a veritable whirlwind o' death and destruction out there! They breed 'em tough in Ala Mhigo, that's for certain!"},{"name":"AVILA","text":"You...are next!"},{"name":"ORTHRUS","text":"Here we go, ladies and gents! Once my buddy gets a whiff of these raw truffles, he'll be sneezing up a storm─literally! G'fa, ha, ha!"},{"name":"ORTHRUS","text":"Ah, nothin' like the rich aroma of roasted truffles! All this fighting is giving Uncle Ulty an appetite. Is it time for dinner yet?"},{"name":"ORTHRUS","text":"Wait a minute...<span class=\"emphasis\">roasted</span> truffles!?"},{"name":"HILDIBRAND","text":"Braised in a savory sauce, just like Mother used to make them! Feel free to have seconds─there's a whole sackful where that came from."},{"name":"ORTHRUS","text":"That meddling muscle-head!"},{"name":"AVILA","text":"(What's taking him so damned long...?)"},{"name":"BRIARDIEN","text":"The girl's gaze gives it away! Open that gate at once!"},{"name":"TYPHON","text":"(-???-)Fuuuuuun...gahhh?"},{"name":"AUDIENCEA00204","text":"Wh-What is that monstrosity!?"},{"name":"ORTHRUS","text":"Mister T-Typhon! Is that your st-stomach I hear rumbling? C-Could I interest you in some roasted truffles, perhaps?"},{"name":"HILDIBRAND","text":"What fascinating friends you have, Ulty! Why, just look at this charming little nose! Hmmm? Is he perhaps suffering from a case of the sniffles?"},{"name":"TYPHON","text":"Fu...fu...fu...<br>FUUUNNN-GAAAHHHHHHHHH!"},{"name":"AUDIENCEA00204","text":"C-Could it be? Avila's vaunted Tempest Blade...it was that monster all along! The girl played us all for fools!"},{"name":"ORTHRUS","text":"D-Don't look at me! It was all <span class=\"emphasis\">her</span> idea! I-I'm just a stupid octopus!"},{"name":"AVILA","text":"<span class=\"emphasis\">You</span> were the one who approached <span class=\"emphasis\">me</span>, you double-dealing fiend!"},{"name":"ORTHRUS","text":"I-I just wanted to experience the thrill of battle! You know, for my work and all! Come on, Dour, has Uncle Ulty ever lied to you?"},{"name":"AUDIENCEB00204","text":"What did I tell ye? I <span class=\"emphasis\">knew</span> there was somethin' fishy about that Ala Mhigan whore!"},{"name":"AUDIENCEC00204","text":"Ala Mhigans... &lt;spit&gt; Beggars and brutes, the lot of 'em. We give them a home in our lands, and this is the thanks we get? Send her to Garlemald for all I care─just get her out o' my sight before I get sick!"},{"name":"AVILA","text":"But... But I just wanted to... M-My sister..."},{"name":"ORTHRUS","text":"I feel for the girl─really, my little octopus heart goes out to her─but the rules are the rules, right? Now, if Uncle Ulty may be so bold..."},{"name":"ORTHRUS","text":"I say we call off the melee and have a final showdown between the three remaining competitors─that would be me, my buddy Typhon, and <span class=\"highlight\">Forename</span> here. Whaddaya say, <span class=\"alternative-container\"><span class=\"alternative\">Missus</span><span class=\"alternative\">Mister</span></span> Warrior of Light?"},{"name":"AUDIENCED00204","text":"(-Raucous Crowd-)Aye, that's what we want to see! Ul-tros! Ul-tros! UL-TROS!"},{"name":"DOURMEADOW","text":"Well, this is a most unprecedented turn of events! But who am I to deny the wishes of such a passionate crowd of martial arts aficionados?"},{"name":"DOURMEADOW","text":"The venue: Halatali! The fighters: the tag team of Ultros and Typhon versus the Warrior of Light! Who will be left standing when the storm has settled? Be there, or miss a battle for the ages!"},{"name":"BRIARDIEN","text":"So, to review: the truffles were to elicit a sneeze from the octopus's oversized crony, which would be positioned so as to appear it was coming from the Ala Mhigan girl's blade, allowing the two to sweep away their opponents with ease."},{"name":"BRIARDIEN","text":"No wonder I wasn't able to see it sooner─it's quite possibly the most imbecilic scheme I've encountered in my years as a consulting inspector."},{"name":"BRIARDIEN","text":"At any rate, we have no choice but to trust in your abilities now, <span class=\"highlight\">Forename</span>. Let us make for Halatali."},{"name":"HILDIBRAND","text":"He...did not fight...as a gentleman...!"},{"name":"BRIARDIEN","text":"There is no telling what inane trickery that octopus will attempt next. Be on your guard, <span class=\"highlight\">Forename</span>."},{"name":"ELLIE","text":"I suppose if anyone can defeat those fiends, it's you. Be safe, <span class=\"highlight\">Forename</span>."},{"name":"DOURMEADOW","text":"Well, this tourney's turned into a right mess. With all the trouble I took preparin' consolation prizes for the melee, it looks like we won't be needin' 'em, after all."},{"name":"DOURMEADOW","text":"'Course, as long as you're bringin' in the spectators─and the profits─I could give a gnat's arse! Gar har har!"},{"name":"DOURMEADOW","text":"Now, I know what you're thinkin'─two against one ain't fair, especially when one of the two is the size of a small house. So here's the deal: why don't ye bring along some o' your friends for the battle─let's say seven of 'em. That should even the odds, aye?"},{"name":"DOURMEADOW","text":"Now, I know what you're thinkin'─two against one ain't fair, especially when one of the two is the size of a small house. So here's the deal: you can recruit seven o' your friends for the battle. That should even the odds, aye?"},{"name":"DOURMEADOW","text":"Combatants! The final confrontation will<br>be held here, atop the Dragon's Neck!"},{"name":"DOURMEADOW","text":"If all members of a team fall from the platform,<br>they forfeit the match. Let the battle begin!"},{"name":"ORTHRUS","text":"Seafood soup is <span class=\"emphasis\">not</span> on the menu today, kids!"},{"name":"ORTHRUS","text":"Thwarted again! I feel like such a sucker..."},{"name":"DOURMEADOW","text":"And <span class=\"highlight\">Forename</span> claims the Mythril Cup!"},{"name":"ELLIE","text":"You did it, <span class=\"highlight\">Forename</span>! With any luck, we've seen the last of that lecherous devilfish."},{"name":"BRIARDIEN","text":"Good show, <span class=\"highlight\">Forename</span>. Your performance has earned us front row seats at the award ceremony."},{"name":"BRIARDIEN","text":"This should afford us the perfect vantage point to thwart the thief. Come, let us return to the Coliseum."},{"name":"HILDIBRAND","text":"A most remarkable display of martial skill, my adventuring friend! Clearly you have been observing me well in our travels together!"},{"name":"BRIARDIEN","text":"The ceremony will begin any moment now. Be on your guard─our adversary may be anywhere...or anyone."},{"name":"DOURMEADOW","text":"It was a battle for the ages, but a worthy victor has risen to claim the spoils! And now, let's take a look at the relic that our champion has won!"},{"name":"DOURMEADOW","text":"Behold! From the personal vaults of Master Fyrgeiss himself─the Warden's Grace, a timeless treasure the likes o' which our realm has never seen! One that's earned the attention of Eorzea's most prominent pilferer! Gar har har!"},{"name":"BRIARDIEN","text":"...Above you!"},{"name":"AMANYFACEDPHANTOMTHIEF","text":"(-???-)Ladies and gentlemen, inspectors and invertebrates. The opening act dragged on overlong, but worry not─the main event is about to begin!"},{"name":"AMANYFACEDPHANTOMTHIEF","text":"I know that you paid well for your seats here today, but I can assure you that my performance will not leave you disappointed. Now, I invite one and all to sit back and enjoy the show!"},{"name":"HILDIBRAND","text":"Vile fiend! Mark my words: you have stolen your last treasure─I swear it on the Manderville name!"},{"name":"GILGAMESH","text":"I think not, <span class=\"emphasis\">Hildegard</span>!"},{"name":"HILDIBRAND","text":"G-Greg!? 'Tis always a pleasure to reunite with old friends, but your timing truly leaves something to be desired!"},{"name":"GILGAMESH","text":"<span class=\"highlight\">Forename</span>! You bested me once, but not today! I shall have my revenge when I pierce your chest with my spear!"},{"name":"BRIARDIEN","text":"Do you not mean...your <span class=\"emphasis\">skewer</span>?"},{"name":"GILGAMESH","text":"...My spear!"},{"name":"GILGAMESH","text":"Vile thief! Is there not a shred of honor in you? Return my weapon at once!"},{"name":"AMANYFACEDPHANTOMTHIEF","text":"Oh ho, it seems we have an unexpected guest. I appreciate your enthusiasm, but I fear attendance at today's performance is by invitation only."},{"name":"ORTHRUS","text":"Hm? Now it's raining truffles? But the battle's already..."},{"name":"ORTHRUS","text":"M-Mister Typhon...? Ah, er...just a moment, I'm sure I had a tissue here somewh─"},{"name":"TYPHON","text":"Fu...fu...fu...fu...<br>FUNNNNNN-GAAAAAAAAAHHH!!!!!!"},{"name":"HILDIBRAND","text":"Alas and alack! The ring sails straight into the hands of the fiend!"},{"name":"GODBERT","text":"(-???-)Giving up so soon, are we? ...Those don't sound like the words of a Manderville man."},{"name":"HILDIBRAND","text":"B-But of course! Brilliant, Father! If the ring won't come to me, I shall go to the ring! Why, it'll be just like Dalamud!"},{"name":"GODBERT","text":"Hildibrand Helidor Maximilian Manderville..."},{"name":"GODBERT","text":"...Skyward, as only a Manderville can!"},{"name":"HILDIBRAND","text":"F-Father! You know not your own strengaaaaaaHHHHHH...!"},{"name":"HOTCH","text":"Nine hundred and ninety-seven! Nine hundred and ninety-eight! Nine hundred and ninety..."},{"name":"HILDIBRAND","text":"...aaaAAAaaahhhHHHhhh-oof!"},{"name":"HUTCHIN","text":"These legs! They look strangely...familiar."},{"name":"GODBERT","text":"Hah! Put a little too much spin on that one, it seems."},{"name":"AMANYFACEDPHANTOMTHIEF","text":"Not exactly as planned, but who can argue with the results? Save for one thing... This ring is a fake."},{"name":"AMANYFACEDPHANTOMTHIEF","text":"But no matter. I have a feeling this will lead me to the <span class=\"emphasis\">true</span> treasure. Until next time, friends! You have been a most attentive audience."},{"name":"DOURMEADOW","text":"That key! B-Bloody hells!"},{"name":"DOURMEADOW","text":"Guards! Seize the fiend at once!"},{"name":"STONETORCH00204","text":"I-It's too late, sir! The second prize─the Ring of Inquiry─it's gone!"},{"name":"ELLIE","text":"<span class=\"emphasis\">Second</span> prize? What is the meaning of this!?"},{"name":"GODBERT","text":"...Many-faced fiend or no, the man spoke true. A master goldsmith's eyes cannot be deceived─this sun sphere is clearly a second-rate replica."},{"name":"DOURMEADOW","text":"P-Preposterous! It's just, ah, the dim lighting! Yes, if you'll just step over here..."},{"name":"BRIARDIEN","text":"Have you taken ill, friend? You seem to be perspiring most heavily..."},{"name":"DOURMEADOW","text":"L-Let's not be so hasty, friends! I can explain!"},{"name":"AVILA","text":"I sold out my honor, joined forces with that odious octopus...all for a false treasure. What a fool I have been! Whatever was I thinking?"},{"name":"HILDIBRAND","text":"Do not berate yourself so, Miss Avila! Why, it was exactly as you said, was it not? You were thinking of dear Hegelina, and nothing more!"},{"name":"AVILA","text":"...I suppose I was, at that. Hm...? How do you know my sister's name!?"},{"name":"HILDIBRAND","text":"I-I assure you, young miss! Under no circumstances did I tail you to the Nanawa Mines to eavesdrop on your intimately personal dialogue with your beloved sister!"},{"name":"AVILA","text":"Ugh, you...<span class=\"emphasis\">you</span>... &lt;sigh&gt; You have the right of it."},{"name":"AVILA","text":"Blinded by the prospect of fortune and fame, I lost sight of myself and what I truly was fighting for. My honor and my sister's trust will not easily be regained, but I will not shirk from the challenge."},{"name":"BRIARDIEN","text":"One mystery still remains. Before the thief had identified the ring as fake, he had already acquired the key to the storeroom."},{"name":"BRIARDIEN","text":"Clearly the second prize─this Ring of Inquiry─was his target from the start. But why? There must be some pattern to the items the fiend has stolen. A pattern that betrays his true intentions..."},{"name":"GODBERT","text":"The Treaty-Blade, Azeyma's Virtue, the Ring of Inquiry...all relics with quite a history. Or, to be more precise, relics from the era of the Belah'dians."},{"name":"HILDIBRAND","text":"Oho! If that is so, the answer is clear as day! The fiend means to found Eorzea's greatest museum of Belah'dian history, pushing up the prices and gouging honest men out of their hard-earned coin! Doubtless another one of his cards will appear on the scene to tell us just as much..."},{"name":"ELLIE","text":"“I have enjoyed our little game, but all good things must come to an end. I shall claim the four sacred treasures, and justice shall be served.”"},{"name":"ELLIE","text":"...So this is the thief's final challenge to us. But what are these four treasures of which he speaks?"},{"name":"GODBERT","text":"“Where the four treasures of Belah'dia become one, the wicked shall be judged in the blazing light of sun.”"},{"name":"GODBERT","text":"An old legend─little more than a faerie tale, at that. And yet it seems the phantom believes there is some truth in these words..."},{"name":"BRIARDIEN","text":"Four sacred relics from Belah'dia? The Warden's justice? Lofty words coming from a glorified footpad."},{"name":"ELLIE","text":"...One who's winning over the commonfolk by the day, if rumors are to be believed. It would seem the tales of a master thief ruffling the feathers of the rich and famous have won the man more than a few admirers."},{"name":"ELLIE","text":"Consider his targets thus far: an Ul'dahn collector and her hired thugs, a trading mogul and the Brass Blades, and now a mining magnate and the Stone Torches. Is it any surprise that the sympathies of ordinary Ul'dahns would lie with the perpetrator rather than his victims?"},{"name":"BRIARDIEN","text":"...Astutely observed, Miss Ellie. Our quarry clearly harbors no small degree of resentment for wealth and authority. Might his next target be a member of the Syndicate? Perhaps the sultana herself?"},{"name":"HILDIBRAND","text":"Haha! Then it will be to his downfall! For the greater the challenge, the higher I rise! Ahem...just one moment, if you would."},{"name":"HILDIBRAND","text":"Mark my words, ye of many faces! There is but one man who shall lay claim to the four lost relics of Belah'dia, and it shall be Hildibrand─agent of enquiry, inspector extraordinaire!"},{"name":"ELLIE","text":"...Yes, I'm sure that inspires us all with great confidence."},{"name":"GODBERT","text":"Hm, was that...? No, it couldn't be. Hah! Methinks Godbert may need a new pair of spectacles!"},{"name":"HILDIBRAND","text":"It's a race to recover the four lost relics of Belah'dia!"},{"name":"HILDIBRAND","text":"As the fiend's true identity and aspirations are revealed!"},{"name":"HILDIBRAND","text":"Will Eorzea fall prey to the forces of evil?"},{"name":"HILDIBRAND","text":"Or will our hero do what only a Manderville can?"},{"name":"NASHUMHAKARACCA","text":"The key to the next case is a mask! Have you ever worn a mask for so long that you forgot what you actually looked like? I have!"},{"name":"NASHUMHAKARACCA","text":"And how did they freeze in midair like that? Talk about a mystery! Oh, well─see you next time!"}],"reward":{"gil":2000,"xp":0,"instance":20026},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[65739]},"next":[66026]},"partials":[{"type":"npc","id":"1010317","obj":{"i":1010317,"n":"Briardien","l":41,"q":1}},{"type":"npc","id":"1010330","obj":{"i":1010330,"n":"Dour Meadow","l":41,"q":1}},{"type":"npc","id":"1001679","obj":{"i":1001679,"n":"Syntgoht","l":41,"q":12}},{"type":"npc","id":"1010161","obj":{"i":1010161,"n":"Dour Meadow","l":44,"q":1}},{"type":"npc","id":"1010326","obj":{"i":1010326,"n":"Hildibrand","l":41,"q":1}},{"type":"npc","id":"1010328","obj":{"i":1010328,"n":"Ellie","l":44,"q":1}},{"type":"npc","id":"1010329","obj":{"i":1010329,"n":"Briardien","l":44,"q":1}},{"type":"npc","id":"1010331","obj":{"i":1010331,"n":"Hildibrand","l":41,"q":1}},{"type":"npc","id":"1010334","obj":{"i":1010334,"n":"Briardien","l":41,"q":1}},{"type":"npc","id":"1010703","obj":{"i":1010703,"n":"Hildibrand","l":41,"q":1}},{"type":"npc","id":"1010772","obj":{"i":1010772,"n":"Briardien","l":41,"q":1}},{"type":"instance","id":"20026","obj":{"i":20026,"n":"The Dragon's Neck","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":80}},{"type":"quest","id":"65739","obj":{"i":65739,"n":"The Trouble with Truffles","g":68,"l":"Ul'dah","s":15,"f":1}},{"type":"quest","id":"66026","obj":{"i":66026,"n":"Shades of Sil'dih","g":68,"l":"Ul'dah","s":17,"f":1}}]}