{"quest":{"name":"My First Saw","location":"Gridania","id":65741,"patch":2.0,"sort":11,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"genre":136,"usedItems":[5361],"journal":["Timbermaster Beatin is testing fledgling carpenters by challenging them to craft maple lumber.","As your first test, Timbermaster Beatin challenges you to demonstrate your knowledge of wood by crafting and delivering a length of maple lumber.","Having inspected your maple lumber, Timbermaster Beatin declares that you have passed the first test. He then instructs you to continue to hone your skills as a carpenter and return when you have gained more experience.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 5."],"objectives":["Deliver a length of maple lumber to Beatin."],"dialogue":[{"name":"BEATINE","text":"Good. You have proven that you know how to grip a saw. But do not mistake it for a mere tool, for it is a part of you─of your arm. And can you put down part of your arm? No."},{"name":"BEATINE","text":"Mark me, then: if you <span class=\"emphasis\">do</span> put it down, and worse, <span class=\"emphasis\">lose</span> the bloody thing, I shall use mine own saw to demonstrate to you the pain of losing a limb."},{"name":"BEATINE","text":"Ah, but I jest. One-armed carpenters are scarcely <span class=\"emphasis\">half</span> as useful, in my experience."},{"name":"BEATINE","text":"In any case, merely holding a saw does not make you a carpenter, whatever some might think. You must become one with it, and learn to feel with it as you work the wood."},{"name":"BEATINE","text":"To wit, you must first <span class=\"emphasis\">know</span> the wood. Demonstrate your knowledge by bringing me a length of maple lumber."},{"name":"BEATINE","text":"Maple lumber is made from maple logs, just so."},{"name":"BEATINE","text":"Our man Ferreol, by the entrance, will furnish you with such logs for a nominal price."},{"name":"BEATINE","text":"Of course, any fool knows that fresh-cut logs are laden with water."},{"name":"BEATINE","text":"To guard against decay, we use wind shards to hasten the natural drying process."},{"name":"BEATINE","text":"Do not forget to do the same."},{"name":"SYSTEM","text":"To synthesize a length of maple lumber for Timbermaster Beatin, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>."},{"name":"BEATINE","text":"As I mentioned before, Ferreol has maple logs in his stock, as well as many other materials you may require."},{"name":"BEATINE","text":"Or, if you are ready, show me what you have brought."},{"name":"BEATINE","text":"..."},{"name":"BEATINE","text":"Yes...I feel it. The wood tells all."},{"name":"BEATINE","text":"There were no careless cuts. Saw and carpenter moved as one, as if dancing."},{"name":"BEATINE","text":"Do you see this grain, how it flows softly, like syrup?"},{"name":"BEATINE","text":"Durable yet pliant, suitable for weapons and armor both─this, child, is maple."},{"name":"BEATINE","text":"Trace the grain with your fingertips and memorize the lines. Consider every characteristic when choosing your materials."},{"name":"BEATINE","text":"That is what it means to know the wood."},{"name":"BEATINE","text":"The maple lumber you have brought me is...acceptable. You have passed the first test."},{"name":"BEATINE","text":"Yet for all it has grown, your knowledge is still lacking. You must needs learn more─a true carpenter knows the qualities and uses of every tree in the forest. When you know the lines of the maple better than those upon your own hand, return to me."},{"name":"BEATINE","text":"I shall have another test for you. Until then, child."},{"name":"SYSTEM","text":"The next carpenter quest will be available from Beatin upon reaching level 5."}],"reward":{"items":[{"num":150,"id":4},{"num":100,"id":3},{"num":30,"id":5380},{"id":2961}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":9}],"quests":[65674]},"next":[65675]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"item","id":"5380","obj":{"i":5380,"n":"Maple Log","l":1,"c":22408,"t":50,"p":2}},{"type":"item","id":"2961","obj":{"i":2961,"n":"Hempen Kurta","l":1,"c":42233,"t":35}},{"type":"item","id":"5361","obj":{"i":5361,"n":"Maple Lumber","l":1,"c":22461,"t":50,"p":9}},{"type":"quest","id":"65674","obj":{"i":65674,"n":"Way of the Carpenter","g":136,"l":"Gridania","s":10,"f":1}},{"type":"quest","id":"65675","obj":{"i":65675,"n":"To Be the Wood","g":136,"l":"Gridania","s":50,"f":1}}]}