{"quest":{"name":"Pirates versus Ninjas","location":"Eastern La Noscea","id":65752,"patch":2.4,"sort":5,"icon":100327,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010619,"involved":[1010140,1010620],"genre":152,"journal":["Oboro believes the time has come to take your talents to the field.","Impressed with your progress, Oboro has decided that your training will continue in the field...as a full-fledged participant in his mission to assassinate Karasu. Having received word that the imperial espionage unit under Karasu's command means to target Captain Grymuwil of the Bloody Executioners, Oboro intends to ascertain the traitor's whereabouts by interrogating one Wolfstan, the captain's trusted lieutenant. Make for Camp Bronze Lake in upper La Noscea, where Oboro will brief you in detail on the plan of attack.","Oboro imparts to you the technique of Shukuchi, which he explains will afford you an ideal vantage point for your surveillance. When you are ready to proceed with the mission, speak with him once more."],"objectives":["Speak with Oboro at Camp Bronze Lake."],"dialogue":[{"name":"OBORO","text":"You have trained well since we last met, <span class=\"highlight\">Forename</span>. I heard not a cry from the door as you entered, nor a creak from the floorboards as you drew near."},{"name":"OBORO","text":"This much is clear: neither waterfalls nor men of wood will serve to hone your senses further. No, a shinobi of your abilities receives his tutelage in the field. Consider this your first lesson in the art of assassination."},{"name":"OBORO","text":"I need not remind you who our target is. He is ever the elusive bird, and yet I have come across some information that I believe may avail us."},{"name":"OBORO","text":"Rumor has it that Captain Grymuwil of the Bloody Executioners has narrowly evaded several attempts on his life in recent days. This is doubtless the work of Karasu and his men─none other are so bold or skilled as to even consider such an attack."},{"name":"OBORO","text":"Nothing short of death will cause a shinobi to forsake his mission. Karasu <span class=\"emphasis\">will</span> strike again─the only questions are <span class=\"emphasis\">where</span> and <span class=\"emphasis\">when</span>."},{"name":"OBORO","text":"Answer those questions, and it will be us paying him a surprise visit next time. Fortunately, I know of a man who might be able to give us what we seek."},{"name":"OBORO","text":"Captain Grymuwil has a trusted lieutenant by the name of Wolfstan, a man who─if rumors are to be believed─is known to fancy a hot spring bath. I recall reading of a famous bath resort not far from here, but the name escapes me... Have you any idea where it might be?"},{"name":"Q1","text":"Where might an Eorzean go to bathe?"},{"name":"A1","text":"Camp Bronze Lake."},{"name":"A1","text":"Costa del Sol."},{"name":"A1","text":"Camp Overlook."},{"name":"OBORO","text":"Why, yes, that does sound familiar! In upper La Noscea, off to the east, was it? Let us make our way there at once."},{"name":"OBORO","text":"That is an ocean resort, is it not? The place of which I read was on higher ground, and known for its healing baths..."},{"name":"OBORO","text":"Yes! It was Camp─no. That cannot be right. The issue of the <span class=\"emphasis\">Harbor Herald</span> I read earlier spoke of Camp Overlook as a bastion of defense against some unpleasant creatures called kobolds. It sounds like the last place anyone would go for rest and relaxation."},{"name":"TSUBAME","text":"Your presence is ever heartening, <span class=\"highlight\">Forename</span>. Where we once struggled to adapt to this land, your friendship and your devotion to the way of the shinobi has instilled us with renewed hope."},{"name":"OBORO","text":"I had no idea that so many Eorzeans also enjoyed public bathing. I would say it is a comforting sight, but in truth it makes me all the more nostalgic for the pleasures of my homeland."},{"name":"OBORO","text":"That said, seeing all these people milling about gives me cause for concern. Even with these disguises, it is only a matter of time before our foreign mannerisms raise eyebrows among the more observant types."},{"name":"OBORO","text":"Yes, best we stay out of sight until our man arrives. Let us keep watch from high above until it is time to act."},{"name":"OBORO","text":"The time has come for me to impart to you another technique, which we call <span class=\"emphasis\">Shukuchi</span>. You may think of it as compressing the physical space around you, allowing you to cross great distances in the blink of an eye. Go ahead, <span class=\"highlight\">Forename</span>, give it a try."},{"name":"TSUBAME","text":"I have long dreamed of visiting one of Eorzea's hot springs! Perhaps, when our mission is complete, we can return to partake in its pleasures..."}],"reward":{"action":2262,"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":92}],"quests":[65751]},"next":[65753]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1010619","obj":{"i":1010619,"n":"Oboro","l":34,"q":2}},{"type":"npc","id":"1010140","obj":{"i":1010140,"n":"Tsubame","l":32,"q":6}},{"type":"npc","id":"1010620","obj":{"i":1010620,"n":"Tsubame","l":34,"q":2}},{"type":"action","id":"2262","obj":{"i":2262,"n":"Shukuchi","c":2905,"j":30,"t":4,"l":40}},{"type":"quest","id":"65751","obj":{"i":65751,"n":"Once Upon a Time in Doma","g":152,"l":"Eastern La Noscea","s":4,"f":1}},{"type":"quest","id":"65753","obj":{"i":65753,"n":"Ninja Bathin'","g":152,"l":"Upper La Noscea","s":6,"f":1}}]}