{"quest":{"name":"Leves of Bentbranch","location":"Gridania","id":65756,"patch":2.0,"sort":100,"unlocksFunction":1,"eventIcon":71341,"issuer":1000101,"target":1000105,"genre":92,"journal":["Gontrant is responsible for assigning guildleves at the Carline Canopy, and is offering to give you an introduction to the world of levequests.","Guildleves are the means by which the Adventurers' Guild organizes and assigns the various requests made by the citizenry. To accept your first such task, make your way to Bentbranch Meadows and speak with Tierney.","In order to gauge your ability to handle the various guildleves she has to offer, Tierney requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Tierney at Bentbranch Meadows.","Tierney is now confident that you are capable of handling any of the trials and tribulations you might encounter at Bentbranch Meadows. Prove your worth as an adventurer, and continue to undertake the guildleves she has to offer."],"objectives":["Speak with Tierney at Bentbranch Meadows.","Complete Tierney's trial guildleve.","Report to Tierney at Bentbranch Meadows."],"dialogue":[{"name":"GONTRANT","text":"Mother Miounne has told me much of your endeavors, <span class=\"highlight\">Forename</span>. Have you considered attempting one of the guildleves available here at the Adventurers' Guild?"},{"name":"GONTRANT","text":"Guildleves are the means by which we document requests for assistance from the citizenry, prior to assigning them to adventurers possessed of the necessary skills."},{"name":"GONTRANT","text":"From “battlecraft leves” that require the extermination of monsters, to “tradecraft leves” that ask for the creation of goods, the tasks we term “levequests” are many and varied in their nature."},{"name":"GONTRANT","text":"Should your interest be piqued, I suggest you make your way to Bentbranch Meadows and speak with Tierney. She will be happy to set your feet on the path to completing your first levequest."},{"name":"TIERNEY","text":"Greetings, adventurer. My name is Tierney, and I am in charge of assigning local levequests here at Bentbranch Meadows."},{"name":"TIERNEY","text":"Gontrant convinced you to seek me out, did he? Then I shall assume you have a basic understanding of what accepting a guildleve might entail."},{"name":"TIERNEY","text":"But first things first: I must be certain that your skills are a match for your enthusiasm. The Adventurers' Guild would not approve of me sending a fledgling hero to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> death or dishonor for want of the requisite capabilities."},{"name":"TIERNEY","text":"Take a moment to peruse the task outlined in this guildleve. Do you believe yourself up to the challenge?"},{"name":"TIERNEY","text":"I am glad to hear it. Pray be aware, however, that anoles are wont to flee to their broodmates when they sense they are overmatched. You would be wise to prevent such a reunion, lest the battle be drawn out past your limits of endurance."},{"name":"SYSTEM","text":"Open your journal under Duty in the main menu, and begin the selected levequest by pressing the “Initiate” button."},{"name":"SYSTEM","text":"When an anole feels overmatched, it will flee the battle. If it reaches a certain distance, then another anole will appear. The levequest objective can be more easily achieved by slaying the fleeing creature before it is joined by more of its kind."},{"name":"TIERNEY","text":"Ah, your first foray into the world of levequests appears to have been a success. And here is the reward for your efforts."},{"name":"TIERNEY","text":"Now that this little trial is behind us, I have no further qualms about assigning you tasks around Bentbranch Meadows."},{"name":"TIERNEY","text":"There are levequests aplenty for a hardworking adventurer such as yourself, and a deal of fame and fortune to be won in their doing!"},{"name":"TIERNEY","text":"Should you seek a different sort of challenge, you might also consider joining a guildhest."},{"name":"TIERNEY","text":"If you wish to know more, pray speak with Battlewarden Ribald in yonder tent. I will inform him of your success against the anoles so that there are no doubts as to your abilities."},{"name":"GONTRANT","text":"If you mean to undertake a guildleve, then make your way to Bentbranch Meadows and speak with Tierney."},{"name":"GONTRANT","text":"I see you wasted no time in following my advice! Be sure to attend to Tierney's instructions in carrying out your levequest."},{"name":"TIERNEY","text":"Not having second thoughts now, are we?"},{"name":"GONTRANT","text":"You must be elated to have performed so admirably in the task Tierney set you. I imagine she is eager to hear of your success."},{"name":"GONTRANT","text":"You must be elated to have performed so admirably in the task Tierney set you. I imagine she is eager to hear of your success."},{"name":"TIERNEY","text":"How do you fare? Levequests can certainly test our abilities, but I have a feeling you are equal to the task."}],"reward":{"gil":215,"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":34}],"quests":[65665]},"next":[65550,65551,65552,65553,65554,65596,65757,65979,65980,66224,66228,66230,66231,66232]},"partials":[{"type":"npc","id":"1000101","obj":{"i":1000101,"n":"Gontrant","l":52,"q":1,"t":"Levemete"}},{"type":"npc","id":"1000105","obj":{"i":1000105,"n":"Tierney","l":54,"q":2,"t":"Levemete"}},{"type":"quest","id":"65665","obj":{"i":65665,"n":"Spirithold Broken","g":1,"l":"Central Shroud","s":33}},{"type":"quest","id":"65550","obj":{"i":65550,"n":"Leves of Wineport","g":91,"l":"Eastern La Noscea","s":350,"f":1}},{"type":"quest","id":"65551","obj":{"i":65551,"n":"Leves of Camp Bluefog","g":93,"l":"Northern Thanalan","s":400,"f":1}},{"type":"quest","id":"65552","obj":{"i":65552,"n":"Leves of the Observatorium","g":94,"l":"Coerthas Central Highlands","s":350,"f":1}},{"type":"quest","id":"65553","obj":{"i":65553,"n":"Leves of Whitebrim","g":94,"l":"Coerthas Central Highlands","s":400,"f":1}},{"type":"quest","id":"65554","obj":{"i":65554,"n":"Leves of Saint Coinach's Find","g":95,"l":"Mor Dhona","s":450,"f":1}},{"type":"quest","id":"65596","obj":{"i":65596,"n":"Simply the Hest","g":92,"l":"Central Shroud","s":100,"f":1}},{"type":"quest","id":"65757","obj":{"i":65757,"n":"Leves of Hawthorne","g":92,"l":"East Shroud","s":150,"f":1}},{"type":"quest","id":"65979","obj":{"i":65979,"n":"Leves of Quarrymill","g":92,"l":"South Shroud","s":200,"f":1}},{"type":"quest","id":"65980","obj":{"i":65980,"n":"Leves of Camp Tranquil","g":92,"l":"South Shroud","s":300,"f":1}},{"type":"quest","id":"66224","obj":{"i":66224,"n":"Leves of Camp Drybone","g":93,"l":"Eastern Thanalan","s":150,"f":1}},{"type":"quest","id":"66228","obj":{"i":66228,"n":"Leves of Little Ala Mhigo","g":93,"l":"Southern Thanalan","s":250,"f":1}},{"type":"quest","id":"66230","obj":{"i":66230,"n":"Leves of Aleport","g":91,"l":"Western La Noscea","s":150,"f":1}},{"type":"quest","id":"66231","obj":{"i":66231,"n":"Leves of Moraby","g":91,"l":"Lower La Noscea","s":200,"f":1}},{"type":"quest","id":"66232","obj":{"i":66232,"n":"Leves of Costa del Sol","g":91,"l":"Eastern La Noscea","s":300,"f":1}}]}