{"quest":{"name":"A Dab'll Do Ya","location":"Western Thanalan","id":65759,"patch":2.0,"sort":50,"eventIcon":71221,"issuer":1002006,"target":1002006,"genre":93,"journal":["The trader Guntram is furiously ransacking his cargo at Scorpion Crossing, looking for all the world like a man who has misplaced something.","Though the reasons remain unclear, Guntram claims to urgently need four bottles of cactuar blood, which can be drained from the corpses of freshly slain cactuars.","Return to Scorpion Crossing and deliver the cactuar blood you have collected to Guntram.","Guntram means to use the cactuar blood you provided to refill his spent stock of coveted Radz–at–Han tonic, confident the latter is so little known in Ul'dah that none of his clientele will notice."],"objectives":["Slay cactuars and gather bottles of cactuar blood.","Deliver the bottles of cactuar blood to Guntram."],"dialogue":[{"name":"GUNTRAM","text":"No, no, no, no, no, no, no, no, no, no! This can't be happening! There's no time to send for more, and no─<br>&lt;gasp&gt; You there!"},{"name":"GUNTRAM","text":"Please, you must help me. Go kill as many cactuars as you must to gather four bottles of their blood. I don't care if you have to hunt the little green bastards to extinction!"},{"name":"GUNTRAM","text":"Please, there's no time to explain! Just know that my very life hangs in the balance. For the love of the gods, hurry, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>!"},{"name":"GUNTRAM","text":"Have you brought the cactuar blood? All four bottles? Show me!"},{"name":"GUNTRAM","text":"Phew, you've saved my hide, friend. Just stopped to give my cargo a check on the way to Ul'dah and saw that all my bottles of Radz–at–Han skin tonic were as empty as a Garlean promise."},{"name":"GUNTRAM","text":"Looks as though the lids shook off in transit and the whole load spilled right out. But I refuse to have it said that Guntram failed to make good on a delivery."},{"name":"GUNTRAM","text":"Cactuar blood is supposed to help keep the skin supple. I'll just use what you've brought to fill the empty bottles, and all those lovely Ul'dahn ladies will be none the wiser."},{"name":"GUNTRAM","text":"Oh, don't worry about getting found out. Radz–at–Han skin tonic is still a rare find, all the more so this far south. I'd venture none in Ul'dah would even know it from an ampoule of their own piss."}],"reward":{"gil":132,"xp":560},"reqs":{"jobs":[{"lvl":4,"id":1}]}},"partials":[{"type":"npc","id":"1002006","obj":{"i":1002006,"n":"Guntram","l":42,"q":2}}]}