{"quest":{"name":"Leves of Hawthorne","location":"East Shroud","id":65757,"patch":2.0,"sort":150,"unlocksFunction":1,"eventIcon":71341,"issuer":1000821,"target":1000821,"genre":92,"journal":["Qina Lyehga, the Adventurers' Guild representative for local levequests at the Hawthorne Hut, is seeking an adventurer to undertake guildleves.","Before setting you loose on the local levequests, Qina Lyehga requires that you demonstrate your capabilities. Complete her trial guildleve and prove yourself up to the task.","You have successfully completed the trial guildleve. Report to Qina Lyehga at the Hawthorne Hut.","Her trial guildleve successfully discharged, Qina Lyehga is satisfied that you are fit for service. As such, you are now entitled to accept other guildleves from the Adventurers' Guild representative at the Hawthorne Hut."],"objectives":["Complete the trial guildleve assigned to you by Qina Lyehga.","Report to Qina Lyehga at the Hawthorne Hut."],"dialogue":[{"name":"QINALYEHGA","text":"Hail, adventurer. I am Qina Lyehga, a guildleve representative for the Adventurers' Guild."},{"name":"QINALYEHGA","text":"If it is work you seek, the good folk who reside in the vicinity of the Hawthorne Hut have entrusted me with a multitude of tasks that I am eager to assign to stalwart heroes."},{"name":"QINALYEHGA","text":"<span class=\"emphasis\">Stalwart</span> ones, I say again. Many of these levequests are not for the faint of heart or frail of body. Before I send you marching into the wilderness, I must see what manner of adventurer has arrived upon my doorstep, so to speak."},{"name":"QINALYEHGA","text":"Let's start you on a trial guildleve, shall we? How does this one suit you?"},{"name":"QINALYEHGA","text":"Excellent. You need merely <span class=\"highlight\">beckon</span> to the sylph, to help lead her to her destination."},{"name":"SYSTEM","text":"Use the <span class=\"highlight\">beckon</span> emote to lead the sylph safely to the destination. You may find it convenient to add the emote to your hotbar before beginning the guildleve."},{"name":"QINALYEHGA","text":"Please begin the levequest once you are ready."},{"name":"QINALYEHGA","text":"Completed all that needs completing, have we? Then only one step remains: to collect your reward!"},{"name":"QINALYEHGA","text":"You've begun the trial guildleve, then? I wish you fortune in your task."},{"name":"QINALYEHGA","text":"Such passable diligence and general competence are exactly the qualities I admire most."},{"name":"QINALYEHGA","text":"Now that I am satisfied that you possess the necessary level of skill, feel free to peruse the guildleves I have available. I look forward to hearing of your future exploits!"},{"name":"QINALYEHGA","text":"I wish you fortune in your task."}],"reward":{"gil":239,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1000821","obj":{"i":1000821,"n":"Qina Lyehga","l":55,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}