{"quest":{"name":"I Believe You Can Fly","location":"Western Thanalan","id":65760,"patch":2.0,"sort":60,"eventIcon":71221,"issuer":1001992,"target":1002014,"involved":[1002006],"genre":93,"journal":["Oswell is holding a letter addressed to someone at the Silver Bazaar.","Oswell wishes to send a letter to an old friend at the Silver Bazaar. Help him first muster up a respectable gift to accompany the letter by relieving five hammer beaks of their lovely plumage.","You have collected five fine hammer beak tailfeathers. Together with Oswell's letter, see them delivered to Kikipu at the Silver Bazaar.","Despite delivering the letter, Kikipu seems unmoved by Oswell's sincerity and the hard-won hammer beak tailfeathers. It seems she is determined not to leave the Silver Bazaar."],"objectives":["Gather tailfeathers from hammer beaks.","Deliver the tailfeathers and Oswell's letter to Kikipu at the Silver Bazaar."],"dialogue":[{"name":"OSWELL","text":"Boxes, crates, barrels... Lifting, moving, stacking... There's no end to it. I'm tired. So very tired."},{"name":"OSWELL","text":"Say, friend, do a hardworking stranger a kindness, would you? See this letter safe to Kikipu at the Silver Bazaar. I'd call on her myself, but I haven't the time, and I doubt these weary legs would carry me there even if I did."},{"name":"OSWELL","text":"I'd like to send her something nice along with it. Could I trouble you to scrounge up, say, five hammer beak tailfeathers? Gods know you can find the beasts around here easy enough."},{"name":"OSWELL","text":"Kikipu's a dear old friend. She's called the Silver Bazaar home for...well, for far too long. There's been ill rumors of the place of late. I'd just like to make sure she's well, is all."},{"name":"KIKIPU","text":"Well, what is it, then? Come to try and scare me and these poor folk off our land again? Go on, do your worst. I'll not budge one step from this spot!"},{"name":"KIKIPU","text":"Hammer beak tailfeathers and a letter? Dear gods, it's from Oswell! Have you seen him? Is he well?"},{"name":"KIKIPU","text":"“Dearest Kikipu,<br><br>It's been too long since I wrote you last. How have you fared since? As ever, I'm a slave to my trade, and sadly it hasn't seen fit to take me to or through the Silver Bazaar in some years."},{"name":"KIKIPU","text":"“I've heard it told the scum of Ul'dah have set their sights on your Silver Bazaar. It seems beyond saving... Really, how long do you mean to linger in that horrid hovel? Remember─some birds just aren't meant to be caged. Spread your wings and soar once more, Kikipu!”"},{"name":"KIKIPU","text":"Spread my wings and soar? By the gods... This... This is by far the most ridiculous letter I've ever read. And hammer beak tailfeathers? The dolt <span class=\"emphasis\">does</span> realize he's sent the feathers of a flightless bird, doesn't he?"},{"name":"KIKIPU","text":"Well, Oswell can go bugger himself! I've no intentions of stepping one ilm from this <span class=\"emphasis\">hovel</span>, much less soaring from it. It's my hovel, and I love it!"}],"reward":{"gil":139,"xp":975},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65758]},"next":[65762]},"partials":[{"type":"npc","id":"1001992","obj":{"i":1001992,"n":"Oswell","l":42,"q":3}},{"type":"npc","id":"1002014","obj":{"i":1002014,"n":"Kikipu","l":42,"q":4}},{"type":"npc","id":"1002006","obj":{"i":1002006,"n":"Guntram","l":42,"q":2}},{"type":"quest","id":"65758","obj":{"i":65758,"n":"Nor Rain nor Heat nor Gloom of Night","g":93,"l":"Western Thanalan","s":40}},{"type":"quest","id":"65762","obj":{"i":65762,"n":"Reasonable /Doubt","g":93,"l":"Western Thanalan","s":60}}]}