{"quest":{"name":"Tough Guys","location":"Eastern La Noscea","id":65768,"patch":2.4,"sort":7,"icon":100327,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"involved":[1009943,1010140,1010571,1010572,1010573,1010574,1010575,1010627],"genre":152,"usedItems":[7893,7889,7891,7892],"journal":["Oboro would bequeath to you that which you have earned.","Oboro believes that you have proven yourself worthy of inheriting his people's traditional garb, and has thusly ordered a full set to be delivered from his village. As such a shipment would arouse suspicion at the docks, he has arranged for the goods to be delivered to the De Nevelle Checkpoint in middle La Noscea.","That which awaited you at the checkpoint was not the delivery you sought, but a surprise attack at the hands of a suspicious porter, who you subsequently dispatched. Speak with the shadowy porter cowering beside his compatriot's limp body in hopes of finding out just what manner of skullduggery is going on here.","Your questioning of the shadowy porter reaches an abrupt end when none other than Karasu appears to silence the tongues of his own men. Karasu claims that the measures he has taken are for your own benefit, as he would see you truly consummate your training before you inherit the garb of the shinobi. To this end, he has entrusted the various pieces to four of his “shadows” that he has deemed expendable. You are to traverse the land and defeat each in single combat to earn what you would claim as yours. Your first challenge awaits at the Red Rooster Stead.","You dispatch a minion of Karasu's disguised as a milkmaid. Open the crate beside her to claim the piece of ninja garb she had been guarding.","You lay claim to your first piece of ninja garb. Travel on to Costa del Sol, where your next challenge awaits.","You dispatch another minion of Karasu's. Open the crate beside her to claim the piece of ninja garb she had been guarding.","You claim your second piece of ninja garb. Continue on to Jijiroon's Trading Post, where yet another challenge awaits.","You have dispatched yet another minion of Karasu's, this time disguised as a fisherman. Open the crate beside him to claim the piece of ninja garb he had been guarding.","You have claimed a third piece of ninja garb. Proceed on to Camp Overlook, where your fourth and final challenge awaits!","You defeat the last of Karasu's underlings, this one disguised as a trader. Open the crate to collect yet one more piece of ninja garb.","You obtain the fourth piece of ninja garb, which leaves but one piece remaining to complete the set. Return to the De Nevelle Checkpoint, where Karasu has promised to give you a little something extra.","It was not Karasu, but Oboro who greeted you back at the checkpoint, along with a letter stating that the promised surprise will be delivered straight to your doorstep. Oboro fears that this is little more than a thinly veiled threat. Hurry back to the docks and deliver Tsubame from danger!"],"objectives":["Speak with the suspicious-looking porter at the De Nevelle Checkpoint.","Speak with the shadowy porter.","Seek out and eliminate any of Karasu's minions at the Red Rooster Stead.","Examine the weathered crate.","Seek out and eliminate any of Karasu's minions at Costa del Sol.","Examine the weathered crate.","Seek out and eliminate any of Karasu's minions at Jijiroon's Trading Post.","Examine the weathered crate.","Seek out and eliminate any of Karasu's minions at Camp Overlook.","Examine the weathered crate.","Return to the De Nevelle Checkpoint and look for Karasu."],"dialogue":[{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>. I look into your eyes today, and see a mind unclouded by worldly cares. The time has come─I would pass on to you the ancestral garb of the shinobi."},{"name":"OBORO","text":"Knowing that this day was close at hand, I have already made the necessary arrangements. With Karasu watching our every move, I cannot act freely, so I asked your friends at the Rogues' Guild to send word to my village and arrange for the delivery of a set."},{"name":"OBORO","text":"Needless to say, this location must remain a secret. I have arranged for the goods to be delivered in secret to the De Nevelle Checkpoint. A porter there will be expecting you."},{"name":"OBORO","text":"Tsubame and I must express our thanks to your Captain Jacke. Be mindful in your travels, <span class=\"highlight\">Forename</span>. We eagerly await your return."},{"name":"TSUBAME","text":"Oboro may beg to differ, but I find myself enjoying life here more and more with each passing day. Of course, I still look back fondly on my days in Doma, but I have come to consider Eorzea a second home."},{"name":"JACKE","text":"That mate o' yers─O'borro, was it?─came by here not long ago to pay his respects. Seems like an upright type, a real bene cull, and that dimber mort's right easy on the eyes. Almost made me feel bad for doubtin' 'em─but doubtin's what we do, aye?"},{"name":"JACKE","text":"'Twasn't easy, mind ye, sending a little gods-know-how-many thousands o' malms across the sea. But he said it was for you, and I couldn't right refuse, eh?"},{"name":"PORTER00232","text":"Expectin' a shipment of goods, ye say?"},{"name":"PORTER00232","text":"Now that strikes me as right curious, on account of how a scraggly fellow came by not long ago to claim them."},{"name":"PORTER00232","text":"They were actually <span class=\"emphasis\">yours</span>, ye say? Well, ain't that a bloody coincidence!"},{"name":"PORTER00232","text":"See, the fellow I talked to said that someone was like to come by sayin' just that... And that if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did, he'd pay good coin for me to gut <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> good an' proper."},{"name":"PORTERB00232","text":"&lt;gulp&gt; ...Y-Yes?"},{"name":"BALOON","text":"It's just business, eh?"},{"name":"PORTERB00232","text":"H-Have mercy! If I knew you were this strong, I never would have taken his money!"},{"name":"KARASU","text":"And if <span class=\"emphasis\">I</span> knew <span class=\"emphasis\">you</span> were this incompetent, I would have put you out of your misery long ago."},{"name":"KARASU","text":"Well, if it isn't my favorite chirping little horsebird. Oh, come now, I'm not <span class=\"emphasis\">that</span> scary...am I?"},{"name":"KARASU","text":"I heard from a little bird in Doma of a shipment en route to Eorzea in secret. I surmised─I'm quite good at that, you see─that it might have something to do with you and your friends, and I just <span class=\"emphasis\">had</span> to know what was inside."},{"name":"KARASU","text":"Lo and behold, what did I find but a shiny set of shinobi garb! Why did you not <span class=\"emphasis\">tell</span> me it was your nameday, little chick? I would have bought you something far more fitting─like a sack of gysahl greens! Ahahaha!"},{"name":"KARASU","text":"No, I fear Brother Dim and Sister Swallow are mistaken─you are not quite ready for such an honor. But this is no fault of your own─after all, the student is only as good as <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> teacher."},{"name":"KARASU","text":"But today is your lucky day, little chick, for a true master has come to take you under his wing."},{"name":"KARASU","text":"Four crates, scattered to the winds, each containing one of the items you seek. Four of my shadows, guarding each piece with their lives. A test, one where failure will mean your death."},{"name":"KARASU","text":"Red Rooster Stead. Costa del Sol. Jijiroon's Trading Post. Camp Overlook. Claim that which you seek by your own hand, or die in the act─it is of little matter to me. If by some chance you survive, return here. You just might find a <span class=\"emphasis\">very</span> special present awaits you. Now shoo, shoo, I say!"},{"name":"BATTLEA00232","text":"Pardon me, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. Have you seen my aldgoats anywhere?"},{"name":"BATTLEA00232","text":"...Oh, it's you. Don't worry, this won't hurt...much."},{"name":"BATTLEA00232","text":"(-Suspicious-looking Milkmaid-)Oh, there's nothing in there but aldgoat milk. Rich and creamy aldgoat milk, to be sure, but aldgoat milk just the same."},{"name":"BALOON","text":"Die, scum!"},{"name":"BATTLEB00232","text":"Oh, dear heavens! I must have fallen asleep while sunbathing. How can I ever thank you for rousing me from slumber?"},{"name":"BATTLEB00232","text":"What say I slit your throat and we call it even, eh?"},{"name":"BATTLEB00232","text":"(-Suspicious Midwife-)Didn't your mother teach you not to touch a lady's personal belongings?"},{"name":"BALOON","text":"For Karasu!"},{"name":"BATTLEC00232","text":"What's with the dour face, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Fish just not bitin' today?"},{"name":"BATTLEC00232","text":"Maybe they know you're already a dead <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>...?"},{"name":"BATTLEC00232","text":"I ain't runnin' a charity here, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Get your own rod and lure!"},{"name":"BALOON","text":"This'll be over quick!"},{"name":"BATTLED00232","text":"Whatever possessed me to set up shop in this ungodly place!? I'm like to drop dead from the fumes before I see a single gil in profit!"},{"name":"BATTLED00232","text":"...'Course, if I bring yer head back to Karasu, I'll be set for life!"},{"name":"BATTLED00232","text":"(-Suspicious-looking Trader-)Whoa there, now! Are you familiar with the concept of <span class=\"emphasis\">trade</span>? It's quite simple, really: it involves you giving me coin before you put your grubby little paws on my goods."},{"name":"BALOON","text":"Die!"},{"name":"OBORO","text":"...<span class=\"highlight\">Forename</span>. I am relieved to see you safe. When you did not return, I feared the worst."},{"name":"OBORO","text":"Karasu did <span class=\"emphasis\">what</span>!? Forgive me... I never suspected he would target you on your own. It is clear now that his treachery knows no bounds."},{"name":"OBORO","text":"And yet, it is curious. Again, he chose to test you rather than dispatch you by his own hand. His intentions remain as inscrutable as ever... Hm. What's this?"},{"name":"OBORO","text":"...Karasu!"},{"name":"OBORO","text":"“Welcome back, <span class=\"highlight\">Forename</span>! And hullo to you as well, Oboro. I left the present I promised you on your doorstep. Such a shame that you weren't at home...”"},{"name":"OBORO","text":"Th-The docks! Tsubame... Byakubu... Yomei... We must hurry!"},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>, I realize it is far too early in your training for this, but the situation is grim. Our only hope of surviving the battle ahead is for you to learn the mudra Jin."},{"name":"OBORO","text":"This is the mudra that will allow you to harness the energies of your fellow man. It is also the final mudra that I can teach you."}],"reward":{"action":2263,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":92}],"quests":[65753]},"next":[65769]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1010140","obj":{"i":1010140,"n":"Tsubame","l":32,"q":6}},{"type":"npc","id":"1010571","obj":{"i":1010571,"n":"Suspicious-looking Milkmaid","l":31,"q":1}},{"type":"npc","id":"1010572","obj":{"i":1010572,"n":"Suspicious-looking Puller","l":34,"q":1}},{"type":"npc","id":"1010573","obj":{"i":1010573,"n":"Suspicious-looking Porter","l":30,"q":1}},{"type":"npc","id":"1010574","obj":{"i":1010574,"n":"Suspicious-looking Trader","l":350,"q":1}},{"type":"npc","id":"1010575","obj":{"i":1010575,"n":"Suspicious-looking Midwife","l":32,"q":1}},{"type":"npc","id":"1010627","obj":{"i":1010627,"n":"Shadowy Porter","l":30,"q":1}},{"type":"action","id":"2263","obj":{"i":2263,"n":"Jin","c":2903,"j":30,"t":4,"l":45}},{"type":"item","id":"7893","obj":{"i":7893,"n":"Ninja Kyahan","l":50,"c":46952,"t":38,"p":1000}},{"type":"item","id":"7889","obj":{"i":7889,"n":"Ninja Hatsuburi","l":50,"c":41625,"t":34,"p":1000}},{"type":"item","id":"7891","obj":{"i":7891,"n":"Ninja Hakama","l":50,"c":45469,"t":36,"p":1000}},{"type":"item","id":"7892","obj":{"i":7892,"n":"Ninja Tekko","l":50,"c":48436,"t":37,"p":1000}},{"type":"quest","id":"65753","obj":{"i":65753,"n":"Ninja Bathin'","g":152,"l":"Upper La Noscea","s":6,"f":1}},{"type":"quest","id":"65769","obj":{"i":65769,"n":"The Crow Knows","g":152,"l":"Middle La Noscea","s":8,"f":1}}]}