{"quest":{"name":"Search and Seizure","location":"Western Thanalan","id":65766,"patch":2.0,"sort":90,"icon":100097,"eventIcon":71221,"issuer":1002014,"target":1001353,"involved":[1003685],"genre":93,"journal":["Kikipu is searching for someone to help her with the land prospectors who have their sights set on the Silver Bazaar.","You witness a confrontation between Kikipu and Kenrick in which the future of the Silver Bazaar is threatened once more. After the heated discussion, you learn that Kenrick's thugs have placed writs of seizure all about the Bazaar. Locate the writs and remove them, making sure to take care of any fiends who appear to stop you.","You have taken down all of the writs of seizure and put an end to Kenrick's henchmen. Take the writs to the Silver Bazaar gate, where Kenrick is awaiting his demolitionists, and return them to him with grand indignation.","You have returned the writs of seizure to Kenrick, who flees in terror after learning that you have bested his henchmen. Go and speak with Kikipu about all that has transpired.","Kikipu thanks you in her own awkward way for saving her and the Silver Bazaar from ruin. Moved by the love she bears her humble home, you observe at least two more of the Bazaar's inhabitants resolve to stand with her. Deliver the letter Kikipu has given you to Momodi at the Quicksand in Ul'dah.","You have given Kikipu's letter to Momodi, and learned that the two are old, close friends. With Kikipu around to stand watch, the Silver Bazaar will be safe from harm for a good while."],"objectives":["Tear down the writs of seizure.","Return the writs to Kenrick.","Speak with Kikipu.","Deliver Kikipu's letter to Momodi at the Quicksand."],"dialogue":[{"name":"KIKIPU","text":"It's terrible, <span class=\"highlight\">Forename</span>! Simply terrible! Please, you must help us. You've already done so much for us, I know, but we are in grave danger!"},{"name":"KIKIPU","text":"Those fiends have drawn up a fake contract of sale and are trying to use it to drive us from the Bazaar!"},{"name":"KENRICK","text":"Do you smell that, Kikipu? That is the smell of inevitability. You knew this day would come. You simply chose to fill the interim with resistance rather than acceptance. Brave, but foolish."},{"name":"KIKIPU","text":"Back for more, Kenrick? How many times must I say it before it seeps into that thick skull of yours? I'll <span class=\"emphasis\">die</span> before I see one ilm of this land fall into your hands!"},{"name":"KENRICK","text":"Easily arranged, I assure you. Come, Kikipu, listen to reason. You know who we are. You know our deeds. You've no hope in this."},{"name":"KENRICK","text":"Look at this miserable place. A stain on the map. You resist now, but I swear I will lay waste to these shabby tents and broken buildings. And when I'm finished, I guarantee you will thank me for it."},{"name":"KIKIPU","text":"You stupid, foolish man. You couldn't be more wrong."},{"name":"KIKIPU","text":"We may no longer boast the visitors or gil of days past, but this is home to me and many more. Our memories are here─years' worth of them. <span class=\"emphasis\">Decades</span>."},{"name":"KIKIPU","text":"We sweated together when we dug this well. We laughed and drank together in every festival. And we mourned together with each life the desert took from us."},{"name":"KIKIPU","text":"<span class=\"emphasis\">That</span> is the Silver Bazaar. <span class=\"emphasis\">That</span> is home. Those memories are what make this place. And I swear to the Twelve above, I'll feed you and whatever masters you serve your own manhood before I let you destroy it!"},{"name":"KENRICK","text":"&lt;sigh&gt; Stubborn girl... No matter. The sale is all but concluded. Look about you. Writs of seizure have already been posted."},{"name":"KENRICK","text":"And I'd not think of taking them down, were I you. End this futile fight, Kikipu! There are far more of us, and if you are truly willing to die for this place, we're more than willing to oblige you."},{"name":"KIKIPU","text":"<span class=\"highlight\">Forename</span>, please, the writs of seizure! You must tear them down and chase Kenrick from here once and for all!"},{"name":"POP","text":"You sense a hostile presence!"},{"name":"KENRICK","text":"I thought you might be along. Pity, you're too late. The demolitionists are already on their way. Every building bearing a writ of seizure will be rubble within the hour!"},{"name":"KENRICK","text":"...Th-The writs! You... What have you done!?"},{"name":"KENRICK","text":"But that means... My men... No, that's impossible."},{"name":"KENRICK","text":"The day may be yours, but I will be back soon, and with <span class=\"emphasis\">far</span> more fearsome company. You've made an enemy for life, you fool. I won't be content simply to see the Bazaar struck from the maps. No, I will not rest until its name is wiped from every history book in Eorzea!"},{"name":"KIKIPU","text":"So, Kenrick is gone for now, is he? That's certainly the brightest news we've had in a while, though I can't help but wonder about the “more fearsome company” he threatens to bring."},{"name":"KIKIPU","text":"Uh... I-I've never had a way with words... Bloody paltry things. But I, er...<span class=\"emphasis\">we</span> would like to thank you, <span class=\"highlight\">Forename</span>. You've not just saved the Silver Bazaar. You've saved me. You've saved who I am."},{"name":"KIKIPU","text":"I see now that I'll have to maintain constant vigilance to keep my home from harm. But it's a vigil I welcome. I'll stand up to any threat that comes through that gate."},{"name":"FAFAFONO","text":"And we'll stand with you!"},{"name":"KIKIPU","text":"Wh-What do you...?"},{"name":"GALFRIDUS","text":"Saw what ye did for us, havin' <span class=\"highlight\">Forename</span> here chase off Kenrick an' all. It's true, there ain't much here worth fightin' for. But it's home, godsdammit, an' I for one ain't ready to give up on it just yet."},{"name":"FAFAFONO","text":"Aye, this <span class=\"emphasis\">is</span> home. And even if there's nothing left but sand and cracked stone, then I say we <span class=\"emphasis\">build</span> something─right here, together."},{"name":"KIKIPU","text":"Thank you, everyone... Thank you so much. And most of all, thank <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>."},{"name":"KIKIPU","text":"There are no more fine garments of goldspun and brocade here. No more bustling port with ships full of cargo and fish. But the better days live on in our hearts. We are the Silver Bazaar, and it is us. Our memories, our past, our history─that is what makes this place."},{"name":"KIKIPU","text":"So long as we remain, so too does hope. You taught us what it is to defend the home we love, and from now on, we'll do no less for ourselves than you've done for us."},{"name":"KIKIPU","text":"I've a final favor to ask of you. This letter...I wonder if you would deliver it to Momodi for me when next you visit Ul'dah."},{"name":"KIKIPU","text":"She and I have been friends for many years. Let her read my words, and she'll be able to give you the reward I cannot."},{"name":"MOODI","text":"What's all this, then? You got somethin' for me?"},{"name":"MOODI","text":"Hm? A letter? Now who would think to─"},{"name":"MOODI","text":"Kikipu! Haven't had word from that ol' gal in ages. How's the dear doin'? Let's see here... Mmm-hmmm... Uh-huh... Hahaha! That's Kikipu, all right."},{"name":"MOODI","text":"Time was I used to call in at the Silver Bazaar quite often. This was back when it was still the busiest hub in Thanalan, mind you. Ol' Kikipu and I used to stay up till dawn talkin' 'bout...well, whatever girls do."},{"name":"MOODI","text":"Kikipu's the very heart and soul of that place. Hells, even most folk here in the city still remember her name."},{"name":"MOODI","text":"Breaks my bloody heart to hear her and them good folk were nearly forced from their land. Dirty business, that."},{"name":"MOODI","text":"But I'm not to the point of worryin' just yet. I'd wager gil to goobbue poop the Silver Bazaar'll be rallyin' back to its former glory 'fore long."},{"name":"MOODI","text":"In any case, I thank the Twelve you were there to help them. Here, for you─on behalf of Kikipu and the Bazaar."},{"name":"ACCESS","text":"The enemy is still about!"}],"reward":{"gil":132,"items":[{"num":17,"id":7},{"id":4422,"one":1},{"id":4421,"one":1},{"id":5824,"one":1}],"xp":1620},"reqs":{"jobs":[{"lvl":4,"id":1}],"questsType":"all","quests":[65764,65765]}},"partials":[{"type":"npc","id":"1002014","obj":{"i":1002014,"n":"Kikipu","l":42,"q":4}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1003685","obj":{"i":1003685,"n":"Kenrick","l":42,"q":1}},{"type":"item","id":"4422","obj":{"i":4422,"n":"Copper Ring","l":9,"c":54401,"t":43,"p":170}},{"type":"item","id":"4421","obj":{"i":4421,"n":"Bone Ring","l":9,"c":54432,"t":43,"p":132}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65764","obj":{"i":65764,"n":"Getting Your Bearings","g":93,"l":"Western Thanalan","s":70}},{"type":"quest","id":"65765","obj":{"i":65765,"n":"Tackle the Problem","g":93,"l":"Western Thanalan","s":80}}]}