{"quest":{"name":"So Close yet So Far","location":"Western Thanalan","id":65761,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1002027,"target":1002027,"genre":93,"journal":["Something has Fafafono of the Silver Bazaar in a very agitated state.","Fafafono is the sad victim of some baggage haulers having left their work undone. His wares lie beyond the gates, undelivered and unguarded. Gather the three pieces of said baggage and deliver them to their worried owner.","You have picked up all of the abandoned baggage. See the bags safely back to the fretful Fafafono.","Fafafono's baggage contains miswoven articles of clothing from Sunsilk Tapestries. To the isolated people of the Silver Bazaar, however, the fact that they are brand-name goods is all that matters."],"objectives":["Gather pieces of Fafafono's baggage.","Deliver the baggage to Fafafono."],"dialogue":[{"name":"FAFAFONO","text":"Those godsdamned haulers! Who do they think they are!? I paid good coin to─ Ah, you there! You're one of those task-seeking adventurer types, are you not?"},{"name":"FAFAFONO","text":"Some wares I ordered from an Ul'dahn merchant arrived, but those bloody worthless haulers just dropped them outside the gate and left."},{"name":"FAFAFONO","text":"“Ain't obliged to bring 'em no further,” the lazy bastards said. “Gate to the Bazaar's still the Bazaar. Order ain't said nothin' 'bout no home delivery.” The gall! &lt;sigh&gt; There are three pieces in all. Would you be so good as to bring them to me?"},{"name":"FAFAFONO","text":"Gods, those oafs better not have damaged my bags... Well? Have you found them yet?"},{"name":"FAFAFONO","text":"Let's see... Yes, yes, and yes. Excellent! Everything is accounted for! These bags contain garments from Sunsilk Tapestries, though each is...flawed in some way."},{"name":"FAFAFONO","text":"In Ul'dah, even a minor misthread is enough to turn the most luxurious gown into fodder for the furnaces. Not here, though. So long as the garments bear a famous name, the souls of the Silver Bazaar have no qualms with quality."},{"name":"FAFAFONO","text":"&lt;sigh&gt; Times used to be better. We were never driven to such...lows. But gil is harder to come by now, and more so with each passing day. All that's left to this Bazaar are overly proud souls with underly developed tastes."},{"name":"FAFAFONO","text":"Everyone clings to the glories of the golden past, yet none make efforts to reshape the dismal present. I pray this damnable Bazaar someday sinks beneath the sands that strangle it. The sooner the better."}],"reward":{"items":[{"id":3765,"one":1},{"id":3766,"one":1},{"num":2,"id":5824,"one":1}],"xp":892},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65763]}},"partials":[{"type":"npc","id":"1002027","obj":{"i":1002027,"n":"Fafafono","l":42,"q":3}},{"type":"item","id":"3765","obj":{"i":3765,"n":"Leather Leggings","l":8,"c":46159,"t":38,"p":224}},{"type":"item","id":"3766","obj":{"i":3766,"n":"Leather Boots","l":8,"c":46137,"t":38,"p":224}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65763","obj":{"i":65763,"n":"Greasing the Cogs","g":93,"l":"Western Thanalan","s":70}}]}