{"quest":{"name":"The Crow Knows","location":"Middle La Noscea","id":65769,"patch":2.4,"sort":8,"icon":100327,"unlocksFunction":1,"eventIcon":71341,"issuer":1010628,"target":1010139,"involved":[1010601,1010629,1010630,1010631,1010632],"genre":152,"journal":["Oboro would teach you what he can in what little time you have.","Oboro teaches you four new mudra combinations that you can form with your newfound knowledge, but sadly lacks the time to explain, let alone demonstrate the precise nature of their effects and how they will serve you in battle. The task at hand is to see to Tsubame's safety. Return to the dock storehouse where Oboro awaits!","You return to the docks to see signs that a battle was fought in your absence. Tsubame is missing, but Oboro suspects she is close by. Find her and attend to her wounds if she is injured as Oboro fears.","As suspected, you find Tsubame in the clutches of Karasu, who while flogging her to near death, has seemingly seen fit to spare her life. Oboro utterly loses control of his emotions, turning against his foe in a blind, frenzied rage, which seems to please Karasu all the more. Suggesting that this is what he had hoped to see in his rival, the traitor agrees to a battle to the death─a battle in which Oboro and you prove victorious. Oboro is about to claim Karasu's life when your flamboyant foe spins a curious tale that suggests the true traitor of Doma was none other than the trusted teacher of the two shinobi, Master Gekkai. Oboro scoffs, dismissing Karasu's words as pathetic lies, but his expression betrays a heart in turmoil. Karasu cryptically reveals the name of a single location─Candlekeep Quay─before taking to the air and self-immolating in a burst of glory as his rival stands there nonplussed. Speak with Oboro and see how he has handled this unexpected turn of events.","Understandably rattled by all that has transpired, a stupefied Oboro can only haltingly suggest that the two of you return to the storehouse with Tsubame.","While Oboro is reluctant to accept Karasu's words as truth, it appears that his rival's words have planted a seed of doubt in his mind. Give your teacher time to work through his crisis of confidence as you hone your ninjutsu skills to new heights.<br><br>※The next ninja quest will be available from Oboro upon reaching level 50."],"objectives":["Speak with Oboro at the dock storehouse.","Find Tsubame.","Speak with Oboro.","Speak with Oboro at the storehouse."],"dialogue":[{"name":"OBORO","text":"You have now learned Jin, the final mudra that I can impart to you. Combine it with the mudra you have already mastered, and you will find four new ninjutsu techniques available to you. Time is short, so listen well."},{"name":"OBORO","text":"The first is Hyoton, ice release. Form Ten–Jin or Chi–Jin. The energies you summon will be channeled into a glacial floe."},{"name":"OBORO","text":"Second is Huton, wind release. Form Jin–Chi–Ten or Chi–Jin–Ten. The winds will gather and swirl around you."},{"name":"OBORO","text":"Third is Doton, earth release. Form Ten–Jin–Chi or Jin–Ten–Chi. The earth itself will move at your will."},{"name":"OBORO","text":"Finally, there is Suiton, release of water. Form Ten–Chi–Jin, or Chi–Ten–Jin. Water will course and flow through you."},{"name":"OBORO","text":"As for how each technique will avail you, I trust you will learn on the field of battle."},{"name":"OBORO","text":"Now, let us hurry! Tsubame is in danger!"},{"name":"BYAKUBU","text":"Ahhh... &lt;cough&gt; Ahhhhhhhhh...!"},{"name":"OBORO","text":"Shuriken... A battle was fought here. I hear no sounds from within. Tsubame must be here, somewhere!"},{"name":"OBORO","text":"Byakubu has lost his words from the shock. He can tell us nothing. Come, we must find Tsubame, and quickly!"},{"name":"OBORO","text":"Tsu-Tsubame!"},{"name":"TSUBAME","text":"It is...but a flesh...wound... &lt;cough&gt; O-Oboro... Look out!"},{"name":"KARASU","text":"(-???-)Come now, little swallow. Say that it hurts...that you were scared... Tell the dim one how I took great pains to see that you were fully awake for every moment of agony and terror!"},{"name":"OBORO","text":"Karasu! This time, you go too far!"},{"name":"KARASU","text":"Yes, <span class=\"emphasis\">yes</span>! Those are the eyes I wanted to see! Let the anger, the hatred burn away any spot of doubt that remains in your heart!"},{"name":"KARASU","text":"The fire in your eyes─resolve born from the all-consuming flames of rage and passion! The look in your eyes that day, when you looked on as your friends, your countrymen were massacred, powerless to end the slaughter!"},{"name":"OBORO","text":"Gaaahhh!!! Be silent, be silent, BE SILENT, <span class=\"emphasis\">BE SILENT</span>!!!"},{"name":"OBORO","text":"Tsubame, stand back. I shall slice this crow's tongue, then tear him limb from limb with my bare hands!"},{"name":"KARASU","text":"Ahahaha! Such pure, unadulterated malice! Finally, you are an adversary worthy of my blade!"},{"name":"KARASU","text":"The true shinobi─ever calm, dutiful to his master... Presence of mind... Yes, the first few times we met, you fought with all the passion of a mokujin. Today you stand before me as a man!"},{"name":"KARASU","text":"You wanted a battle, and today you shall have one─no retreat, no reprieve. The defeated shall die like a dog, and the victor? The victor's tale will continue for another day..."},{"name":"OBORO","text":"...Karasu Redbeak. In the name of our elders, I take your life as divine retribution for your crimes. Your bloodstained beak will feast on the innocent no more."},{"name":"KARASU","text":"...Ahaha! Ahahahaha! Does he <span class=\"emphasis\">truly</span> believe those words!? Ahaha! Aheahehaheaheaeha!"},{"name":"KARASU","text":"Oh, yes, this beak is stained with blood...this I do not deny. But I am not the leader of this murderous flock."},{"name":"OBORO","text":"I tire of your riddles, Redbeak! Give me one reason why I should not separate your head from your shoulders!"},{"name":"KARASU","text":"Oh, dear! What a pickle I find myself in! Now how can I put this in terms even the dim one can understand? I am not the traitor you seek. He is not I, and <span class=\"emphasis\">I</span> am not <span class=\"emphasis\">he</span>."},{"name":"KARASU","text":"You believe I was the only one who fled Doma. Are you <span class=\"emphasis\">sure</span>? Absolutely <span class=\"emphasis\">certain</span>? Did you see the bodies─the <span class=\"emphasis\">faces</span>─of all your brothers who fell that day?"},{"name":"KARASU","text":"Think, think, <span class=\"emphasis\">think</span>! I know it is not a strength of yours, but surely you remember! One body, maimed so badly that only the possessions could identify the man. And the <span class=\"emphasis\">face</span>─could it even be called a face? Naught but shattered bone and shredded flesh remained where once had been the proud features of..."},{"name":"OBORO","text":"You <span class=\"emphasis\">LIE</span>!!! One more word... One more twisted, deceitful <span class=\"emphasis\">word</span>, Redbeak, and I will... I will..."},{"name":"KARASU","text":"Ahahaha! Oh, Oboro─poor, sweet, <span class=\"emphasis\">stupid</span> Oboro. How long will you continue to deceive yourself?"},{"name":"OBORO","text":"You <span class=\"emphasis\">lie</span>, Redbeak, as you always have. Did betraying our homeland not sate your thirst for treachery? That now you must drag our master's name through the mud!? Answer me this, then: if you were not the traitor, then why did you flee the village that day?"},{"name":"KARASU","text":"...How often have I asked myself the same! Oh, how simpler things would have been had I been as naive as you! But the circumstances of Master Gekkai's death did not sit well with me. I left the village looking for answers, and found something far more interesting─our master himself, alive and well."},{"name":"KARASU","text":"In an instant, his hand was at my mouth and his blade at my neck. A simple choice he gave me: follow him and live, refuse and die."},{"name":"KARASU","text":"I would like to say I weighed my decision heavily, but the answer really was quite clear. Death is so <span class=\"emphasis\">final</span>, after all, while life─even a life spent as an imperial spy─holds so many <span class=\"emphasis\">opportunities</span>."},{"name":"KARASU","text":"What's the matter, dim one? Do you still find my tale hard to swallow? Oh, believe as you will─redemption means little to a dead man."},{"name":"KARASU","text":"You <span class=\"emphasis\">are</span> going to kill me, yes? That <span class=\"emphasis\">is</span> your mission, after all. Sworn in the sight of the elders, tradition and custom, and so on and so forth?"},{"name":"KARASU","text":"...Candlekeep Quay. When the time is right, he will come, and all will be revealed. ...I just thought I'd tell the one who's shown <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> capable of listening to reason."},{"name":"KARASU","text":"The lights grow dim! The <span class=\"alternative-container\"><span class=\"alternative\">stars turn black</span><span class=\"alternative\">sun turns black</span></span> in the sky! Our hero fought─fought bravely, even─but his chapter in this grand mummery has come to a close... Summoning his last breaths, our hero...speaks..."},{"name":"KARASU","text":"Just promise me this, Oboro. Whatever your mission, should you fail, just don't go off <span class=\"emphasis\">dying</span>. I know how fond you are of tradition, but this is a new era, and we are not our ancestors. Besides, such an end just wouldn't become a solemn youth like yourself."},{"name":"KARASU","text":"So <span class=\"emphasis\">live</span>, and leave the dying to those who can do it in style. Yes, I may not have been the hero I thought I was, nor the villain you would have me be, but from beginning to end, I was <span class=\"emphasis\">me</span>, and there is nothing I would rather be. Farewell, cruel world, and good bloody riddance!"},{"name":"OBORO","text":"Wait... Karasu!!!"},{"name":"OBORO","text":"What can this all mean...?"},{"name":"OBORO","text":"Karasu is dead, our mission complete. Yet you will forgive me if I am unsure how to feel about this turn of events..."},{"name":"OBORO","text":"In any event, there is nothing more to be done here. Tsubame is wounded. Let us bring her home."},{"name":"TSUBAME","text":"Thank you for coming to my rescue, <span class=\"highlight\">Forename</span>. I owe you and Oboro my life. Worry not for me─with rest, I will be fine..."},{"name":"BYAKUBU","text":"When last we met I was not myself. Pray forgive me. Master Oboro awaits inside."},{"name":"OBORO","text":"The mission that brought me to Eorzea is complete. Once Tsubame's wounds heal, we have no reason to sojourn further in these lands."},{"name":"OBORO","text":"And yet, if Karasu spoke true... No... It simply cannot be..."},{"name":"QIB","text":"Defeat Karasu and his minions!"},{"name":"QIB","text":"This trembling... My heart will know no peace until you are gone from this world!"},{"name":"QIB","text":"You look <span class=\"emphasis\">angry</span>, dear Oboro. Is it because I clipped your pretty swallow's wing?"},{"name":"QIB","text":"Come, my pets─it is feeding time!"},{"name":"QIB","text":"A mudra of summoning!? ...This bodes ill. <span class=\"highlight\">Forename</span>, that magicked circle must be destroyed!"},{"name":"QIB","text":"Gah! Your mind is nothing but <span class=\"emphasis\">noise</span>, Oboro! Purge your heart of all anger, all hatred, all compassion, all regret! Only in emptiness will you find the strength to defeat me!"},{"name":"QIB","text":"Again!? I don't want to see what's coming... Destroy that circle quickly, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"It cannot end... Not like this!"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":92}],"quests":[65768]},"next":[65770]},"partials":[{"type":"npc","id":"1010628","obj":{"i":1010628,"n":"Oboro","l":30,"q":1}},{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1010601","obj":{"i":1010601,"n":"Byakubu","l":32,"q":2,"t":"Gatekeep"}},{"type":"npc","id":"1010629","obj":{"i":1010629,"n":"Oboro","l":32,"q":1}},{"type":"npc","id":"1010630","obj":{"i":1010630,"n":"Tsubame","l":32,"q":1}},{"type":"npc","id":"1010631","obj":{"i":1010631,"n":"Oboro","l":32,"q":1}},{"type":"npc","id":"1010632","obj":{"i":1010632,"n":"Tsubame","l":1428,"q":2}},{"type":"quest","id":"65768","obj":{"i":65768,"n":"Tough Guys","g":152,"l":"Eastern La Noscea","s":7,"f":1}},{"type":"quest","id":"65770","obj":{"i":65770,"n":"Master and Student","g":152,"l":"Eastern La Noscea","s":9,"f":1}}]}