{"quest":{"name":"Reasonable /Doubt","location":"Western Thanalan","id":65762,"patch":2.0,"sort":60,"eventIcon":71221,"issuer":1002014,"target":1002014,"involved":[1003681,1003682,1003683,1003684],"genre":93,"journal":["Kikipu of the Silver Bazaar is having a hard time handling a couple of troublesome laborers.","Four laborers who tend the derricks are taking an elongated break in the Silver Bazaar, and testing Kikipu's last nerve in the process. Chase them out of the Bazaar by casting /doubt on the validity of their actions, the purpose of their presence, and the very nature of their existence.","You have rid the Silver Bazaar of the surly derrick workers. Run and tell Kikipu of your feat.","It seems the laborers were not laborers at all, but cowardly thugs hired to disguise themselves as laborers and prospect land in secret. Here's hoping nothing further comes of the incident..."],"objectives":["Use the power of /doubt to make the workers leave.","Report back to Kikipu."],"dialogue":[{"name":"KIKIPU","text":"You've a warm face for an outsider. Not like those other curs loitering about the Bazaar."},{"name":"KIKIPU","text":"Surely, you've seen the hammers to the east of here, or at the very least heard them. Well, a few of their workers have decided to drop in on us for a little rest and relaxation."},{"name":"KIKIPU","text":"But they're no workers. They're nothing but hired muscle sent to threaten the people of the Bazaar and harass our shops. It's not the first time."},{"name":"KIKIPU","text":"But I daresay a formidable <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> such as yourself just might be able to scare them off with some strongly worded <span class=\"highlight\">doubts</span>. What say you?"},{"name":"KIKIPU","text":"Are they gone, then? All of them? Well, that's a relief! Serves them right for trying to scare honest folk from their homes so their own masters can buy them."},{"name":"KIKIPU","text":"The hammers were built to pound the ground here into solid foundation. The plan is to turn these tracts into manors and manses for Thanalan's wealthy."},{"name":"KIKIPU","text":"The same fate awaits the Silver Bazaar. Since the value of the land is set to rise, small wonder some opportunist is trying to drive us all off so he can have it all to himself."},{"name":"KIKIPU","text":"The Silver Bazaar may not be what she used to. Aye, more people leave now than come, and aye, more shops close than open."},{"name":"KIKIPU","text":"But it's my home, and I don't mean to be chased off by some bloody gillionaire craven who sends common thugs to do his dirty work!"},{"name":"WORKMANA","text":"My business is my own. Now get out of my sight before I put you out of it."},{"name":"WORKMANA","text":"Bah, I was just about to leave anyway, so don't go thinking you had any part in it."},{"name":"WORKMANB","text":"You don't want trouble with me, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Piss off."},{"name":"WORKMANB","text":"Your ears working? I said piss off!"},{"name":"WORKMANB","text":"Enough, already. I'm leaving, but tell that bloody Kikipu this is the end of nothing, ya hear? Nothiiiiiing!"},{"name":"WORKMANC","text":"You can talk at me all day if you like. Short of a Garlean legion marchin' through that gate, I won't be gettin' up any time soon."},{"name":"WORKMANC","text":"You Silver Bazaar folk are annoying as all hells, I'll give you that. Bugger this job, I'm off to find some peace and quiet!"},{"name":"WORKMAND","text":"Sittin' 'round pickin' on poor folk. Easiest bloody gil I ever made─and the funnest. Heh heh heh! "},{"name":"WORKMAND","text":"Persistent little <span class=\"alternative-container\"><span class=\"alternative\">thing</span><span class=\"alternative\">bastard</span></span>, ain'tcha? Fine, I'm on my way. But tell that Kikipu this ain't over."}],"reward":{"gil":139,"xp":585},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65760]}},"partials":[{"type":"npc","id":"1002014","obj":{"i":1002014,"n":"Kikipu","l":42,"q":4}},{"type":"npc","id":"1003681","obj":{"i":1003681,"n":"Riled Worker","l":42,"q":1}},{"type":"npc","id":"1003682","obj":{"i":1003682,"n":"Riled Worker","l":42,"q":1}},{"type":"npc","id":"1003683","obj":{"i":1003683,"n":"Riled Worker","l":42,"q":1}},{"type":"npc","id":"1003684","obj":{"i":1003684,"n":"Riled Worker","l":42,"q":1}},{"type":"quest","id":"65760","obj":{"i":65760,"n":"I Believe You Can Fly","g":93,"l":"Western Thanalan","s":60}}]}