{"quest":{"name":"Tackle the Problem","location":"Western Thanalan","id":65765,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1002044,"target":1002044,"genre":93,"journal":["Galfridus of the Silver Bazaar wishes to reclaim his fishing lures from the goblin muggers who took them.","Galfridus claims some of his tackle was stolen by goblin muggers. Find the culprits to the northeast of the Silver Bazaar, slay them for their unforgivable crime, and reclaim two of his copper lures.","You have prised two copper lures from goblin mugger corpses. Return them to Galfridus at the Silver Bazaar.","Galfridus's copper lures have been damaged beyond repair. Perhaps this would be a good opportunity for the despondent Galfridus to look for a new calling in life."],"objectives":["Obtain copper lures from goblin muggers.","Return the copper lures to Galfridus at the Silver Bazaar."],"dialogue":[{"name":"GALFRIDUS","text":"I 'preciate what ye did, friend, bringin' me magnetite. Gave it some more thought, I did, puttin' back out to sea an' all. But even with me compass fixed, still ain't got me lucky copper lures."},{"name":"GALFRIDUS","text":"Was waylaid by some goblin muggers few weeks back, just north an' east of here. Thievin' bastards made off with all me lures─dozens all told."},{"name":"GALFRIDUS","text":"Must be ye felled some earth sprites to get at them magnetite chunks. Am I right? If so, I reckon ye could put down a few goblins an' bring me back me lures."},{"name":"GALFRIDUS","text":"S'pose I could make do with just two of 'em. Couple of copper ones should serve for now. Ye up for helpin' put a broken life back together?"},{"name":"GALFRIDUS","text":"It ain't easy to ask, but I'm askin' all the same, friend. Two copper lures to get me back out to sea an' put me Danyell's heart at ease."},{"name":"GALFRIDUS","text":"I'll be damned! Me ol' copper lures. Never thought I'd see these beauts again!"},{"name":"GALFRIDUS","text":"Bloody hells, them goblins sure saw to bangin' them up. Bah! Ain't gonna be catchin' no fish with these."},{"name":"GALFRIDUS","text":"Well, that's that. Must be Nald Hisself tellin' me to give up me sea legs. Might be as there's a new life waitin' out there, somewheres. Heh, maybe me compass'll lead me to it."},{"name":"GALFRIDUS","text":"&lt;sigh&gt; Born an' bred here, I was. Ain't never called no place else home. Times are changin', though. S'pose I could sell off me land to them bloody buzzard prospectors an' see what else is out there for me."}],"reward":{"items":[{"id":3534,"one":1},{"id":3535,"one":1},{"id":5824,"one":1}],"xp":1275},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65764]},"next":[65766]},"partials":[{"type":"npc","id":"1002044","obj":{"i":1002044,"n":"Galfridus","l":42,"q":2}},{"type":"item","id":"3534","obj":{"i":3534,"n":"Leather Mitts","l":8,"c":44065,"t":37,"p":196}},{"type":"item","id":"3535","obj":{"i":3535,"n":"Leather Ringbands","l":8,"c":48250,"t":37,"p":156}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65764","obj":{"i":65764,"n":"Getting Your Bearings","g":93,"l":"Western Thanalan","s":70}},{"type":"quest","id":"65766","obj":{"i":65766,"n":"Search and Seizure","g":93,"l":"Western Thanalan","s":90}}]}