{"quest":{"name":"Greasing the Cogs","location":"Western Thanalan","id":65763,"patch":2.0,"sort":70,"eventIcon":71221,"issuer":1002027,"target":1002049,"involved":[1002022,1002047],"genre":93,"journal":["Fafafono has the look of a Lalafell dying to be asked if he has any work to offer.","Fafafono has asked you to slay rusty coblyns and gather four bottles of coblyn grease.","You have collected the coblyn grease Fafafono requested. Deliver it to Adelard at the Hammers.","Adelard is happy to receive the coblyn grease, and is thankful to you and Fafafono for acquiring it. He explains that the hammers are creating a foundation on which estates for Ul'dahns of considerable means are to be built. Of course, not everybody is excited at this proposition, such as the Silver Bazaar's own Kikipu. It would seem that not everybody's idea of progress is the same."],"objectives":["Collect four bottles of coblyn grease from rusty coblyns.","Deliver the coblyn grease to Adelard at the Hammers."],"dialogue":[{"name":"FAFAFONO","text":"Hey there, friend. I've a sure way into some easy gil, if you're interested. It won't even require you to break a sweat─well, not much of one."},{"name":"FAFAFONO","text":"All you need do is slay enough rusty coblyns to gather four bottles of coblyn grease, and then deliver them to a Hyur by the name of Adelard at the Hammers. Once he has the grease, he can use it to keep the hammers running. It couldn't be more simple!"},{"name":"FAFAFONO","text":"I'm surrounded by fools here. They detest the hammers and the new way of life they symbolize. They care only for the successes of the past, but it blinds them to the opportunities of the present. Change isn't coming, friend─it's already here!"},{"name":"FAFAFONO","text":"I call the Silver Bazaar home for now, but I've no lingering affection for the place. I go wherever there is gil to be gotten!"},{"name":"ADELARD","text":"What is it? Can't you see I'm busy cleaning the sand clogs from these hammers? Gods, I'd kill for a few bottles of coblyn grease right now..."},{"name":"ADELARD","text":"Coblyn grease! Fafafono must have sent you. Thank the gods for both of you!"},{"name":"ADELARD","text":"Before long, these tracts will be covered with the estates of Ul'dahn elite. But the ground is still too loose to build upon. The hammers are pounding to make a solid foundation. Once that's done, then you'll see the structures start to rise."},{"name":"ADELARD","text":"The building was planned to stretch even farther─to the heart of the Silver Bazaar, even. But it seems the powers that be are being met with some...local resistance."},{"name":"ADELARD","text":"I hear some lass named Kikipu holds the rights to the bulk of the land there. Stubborn to a fault, that one. A bloody thorn in the side."}],"reward":{"gil":146,"xp":1120},"reqs":{"jobs":[{"lvl":4,"id":1}]},"next":[65761]},"partials":[{"type":"npc","id":"1002027","obj":{"i":1002027,"n":"Fafafono","l":42,"q":3}},{"type":"npc","id":"1002049","obj":{"i":1002049,"n":"Adelard","l":42,"q":1}},{"type":"npc","id":"1002022","obj":{"i":1002022,"n":"Cenmin","l":42,"q":2}},{"type":"npc","id":"1002047","obj":{"i":1002047,"n":"Spotted Meadow","l":42,"q":2}},{"type":"quest","id":"65761","obj":{"i":65761,"n":"So Close yet So Far","g":93,"l":"Western Thanalan","s":80}}]}