{"quest":{"name":"A Qiqirn Always Pays His Debts","location":"Limsa Lominsa","id":65779,"patch":2.51,"sort":20,"icon":100361,"eventIcon":71221,"issuer":1009153,"target":1010438,"involved":[1001787,1005249,1010434,1010435,1010436,1010437],"genre":77,"journal":["The deputy postmoogle would have you deliver the undeliverable.","Despite his proclivity for delegation, the deputy postmoogle took the rare decision to deliver an urgent missive himself, only to find no trace of the intended recipient at the given address. Chagrined to find the undeliverable letter must be returned to sender, yet quick to spot opportunity in adversity, he awards the awkward assignment to his trusted trainee, that you might gain valuable experience in dealing with the wrath of a disappointed customer. He bids you round the corner to the Octant, and return the letter to Bango Zango, the prickly vice-chair of the Brugaire Consortium.","Bango Zango is furious to find the letter undelivered, but not with you: he is angry with Jijiroon, the intended recipient of his missive, who appears to have skipped out on his sizable debt to the Consortium. He asks that you assist him in tracking down the evasive Qiqirn. Journey to upper La Noscea, and question his younger brother, Memeroon, who runs a trading post on the banks of Bronze Lake.","Memeroon knows little of his brother's woes, and even less of his current location, but pledges to aid your search in any way he can. He suggests that you cross the lake to Jijiroon's own trading post, and search for any clues that his harried brother may have left behind.","At the trading post, you cross paths with a burly bailiff, sent by the Consortium to collect on Jijiroon's debt. Among the Qiqirn's abandoned belongings, a hurriedly emptied chest piques the bagman's interest. However, if the local junkmonger is to be believed, the box contained naught but Mamool Ja currency─worthless to all but the lizardmen. The collector speculates that Jijiroon may have gone north to buy protection from the Mamool Ja, but is unwilling to follow the trader into beastman territory without a significant increase to his fee. Journey north, through the shallow reaches of Bronze Lake, and try to track Jijiroon down.","You discover Jijiroon in parley with a lizardman mercenary, but the panicking trader doesn't stop to chat. Fearing you to be a Brugaire Consortium enforcer, he quickly strikes a deal with the Mamool Ja to enter their protection. While he and the mercenary flee to the north, a pair of scaly soldiers emerge from the waters to harry your pursuit. Throw off your attackers, and search for signs of Jijiroon in Zelma's Run.","In Zelma's Run, you meet with the Mamool Ja mercenary Jijiroon hired to protect him. He explains that the deal the Qiqirn struck only guaranteed his protection from you: when your acquaintance from the trading post came to seize the trader, the beastmen stood aside. With the mercenary's contract fulfilled, and Jijiroon in the collector's custody, all that remains is to return to Memeroon's Trading Post and inform his brother of all that befell.","Familiar with the workings of piratical justice, Memeroon fears his unlucky brother is fated to be packed in a barrel and thrown in the lake. He urges you to return to Jijiroon's trading post, and persuade your debt–collecting friend not to give his brother the old heave–ho.","You find the collector, his catch already barreled and ready to be nudged off the pier. But just as push is about to come to shove, Memeroon bursts in, with a sack of gil large enough to repay his brother's debts. Satisfied with the settlement, the bailiff turns Jijiroon loose. The dejected Qiqirn offers his trading post in payment for his brother's assistance, but Memeroon refuses, despite the boost to his fortunes that such a transaction would entail. For despite their differences, it is only his respect for Jijiroon's business brain that drives him to succeed. Henceforth do they pledge to compete against each other not as hated foes, but as respected rivals, and to usher in a new age of prosperity for their businesses both."],"objectives":["Return the undelivered letter to Bango Zango.","Speak with Memeroon at Memeroon's Trading Post.","Search for clues at Jijiroon's Trading Post.","Search for Jijiroon in the shallows of Bronze Lake.","Search for Jijiroon in Zelma's Run.","Speak with Memeroon.","Speak with the retired reaver at Jijiroon's Trading Post."],"dialogue":[{"name":"LETTERMOOGLE","text":"Oh, <span class=\"highlight\">Forename</span>, dear <span class=\"highlight\">Forename</span>─my unfortunate assistant! I'm afraid that something rather awkward has come up, and I'm going to have to drop it right in your lap, kupo. It's an urgent epistle from Bango Zango, vice-chair of the Brugaire Consortium..."},{"name":"LETTERMOOGLE","text":"...And to Bango Zango must it be returned! It <span class=\"emphasis\">was</span> to be delivered to one Jijiroon, a Qiqirn who runs a trading post on the shores of Bronze Lake, but when I got there, the slippery devil was nowhere to be found. To make matters worse, he neglected to leave a forwarding address, kupo!"},{"name":"LETTERMOOGLE","text":"I was going to break the news to Master Zango myself, but who am I to deny an up–and–coming delivery <span class=\"alternative-container\"><span class=\"alternative\">Hyur</span><span class=\"alternative\">Elezen</span><span class=\"alternative\">Lalafell</span><span class=\"alternative\">Miqo'te</span><span class=\"alternative\">Roegadyn</span><span class=\"alternative\">Au Ra</span><span class=\"alternative\">Hrothgar</span><span class=\"alternative\">Viera</span></span> such valuable experience? It's not often our service fails in its duties, so you'll have to be at your sycophantic best if he's to accept your apology.<br>You'll find Mister Zango just around the corner, in the Octant. Good luck, <span class=\"highlight\">Forename</span>! The reputation of the moogle delivery service rests on your shoulders, kupo!"},{"name":"LETTERMOOGLE","text":"What does Jijiroon think he's doing, disappearing like that? It's almost as if he's <span class=\"emphasis\">trying</span> to bring the service into disrepute. Ah, well...I suppose we'll just have to take it on the chin this time. To the Octant, <span class=\"highlight\">Forename</span>, and keep your chin up!"},{"name":"BANGOZANGO","text":"Yes, I am Bango Zango, second chair of the Brugaire Consortium. And who are you, pray tell? If you have business with me, you'll need to make an appointment with my─ ...What? My letter's been returned to sender!?"},{"name":"BANGOZANGO","text":"“Not known at this address”!? Gods damn it! I never should have trusted that double–dealing Qiqirn! The minute I threaten to call in his debts, the blasted rat does a moonlight flit!"},{"name":"BANGOZANGO","text":"...Forgive my outburst. It's Jijiroon I'm angry with, not you. He borrowed a sizable sum from the Consortium, but he's fallen behind on his repayments─this letter was to be our final demand. Sad to say, it seems the wretch has taken the money and ran."},{"name":"BANGOZANGO","text":"It's a sorry state for a once–shrewd trader to find himself in. He was the first to set up a trading post in upper La Noscea after the Calamity, straddling the fence between everyone from the kobolds to the Maelstrom, and raking in a pretty packet from all sides."},{"name":"BANGOZANGO","text":"He ran it with his brother, Memeroon, but they had a falling-out some years back─a disagreement about the direction of the business, or so they say. Whatever the reason, it led to Memeroon striking out on his own, and setting up his own little trading post in Oakwood. They've been rivals ever since."},{"name":"BANGOZANGO","text":"Perhaps that's when the rot set in. Memeroon's fortunes have gone from strength to strength, but Jijiroon... Well, the only thing he's gained in the past few years is an ever–increasing mountain of debt. I had every confidence he would turn it around, but it seems my faith was misplaced."},{"name":"BANGOZANGO","text":"And what faith it was! Were he to default on this loan, it would have serious implications for the Consortium's finances. I need you to do me a favor, adventurer: return to upper La Noscea, and collar this rat for me. Mayhap his brother has some idea where he has scurried off to."},{"name":"BANGOZANGO","text":"The Consortium has invested heavily in Jijiroon based on his past record. But past is past, and whatever has become of his business, he'll not drag the Consortium down with him. Find him, adventurer, and bring the scoundrel back to me. You shan't go unrewarded!"},{"name":"MEMEROON","text":"Welcome, customer! Customer welcome to shop at Memeroon shop! ...Memeroon's brother causing bother? Run away with shiny shinies!?"},{"name":"MEMEROON","text":"Memeroon no know where Jijiroon go. Memeroon and Jijiroon always fighting fight, never talking talk. Memeroon keep to Memeroon side, and keep away from Jijiroon side."},{"name":"MEMEROON","text":"Memeroon work for long time at Jijiroon shop, long time ago. Memeroon spot good spot for new shop, but Jijiroon say he want to stay put in Jijiroon shop spot. Move here, Memeroon say, but Jijiroon no want to hear, and no want to move."},{"name":"MEMEROON","text":"Quarrelsome Jijiroon quarrel with Memeroon. “Go away,” he say, so away Memeroon go. Memeroon move to new place, and set up new setup. Never ever talking talk with Jijiroon ever since."},{"name":"MEMEROON","text":"Everyone cross with Jijiroon? Everyone think Jijiroon cross everyone? Jijiroon need help, and helpful Memeroon help. Look in Jijiroon shop─Jijiroon leave shop, but maybe he leave hints that hint where Jijiroon go."},{"name":"MEMEROON","text":"Memeroon and Jijiroon fight bad fight, but Jijiroon not bad. Helpful Memeroon help find Jijiroon. Go to Jijiroon shop and look for leads to lead you to Jijiroon!"},{"name":"TORITATE00243","text":"What's yer business 'ere, <span class=\"alternative-container\"><span class=\"alternative\">darlin'</span><span class=\"alternative\">matey</span></span>? ...Bango Zango sent ye to look fer a missin' trader? Heh heh─same 'ere. Seems the Consortium ain't takin' no chances when it comes to trackin' down this Jijiroon character."},{"name":"TORITATE00243","text":"What say we work together, then, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? I put the shakes on the shopkeep over yonder already─'e don't got a glimmer where the ol' boy's got to. Says this pile over 'ere's Jijiroon's stash, but it ain't nothin' but chocobo feed. 'Ardly worth filchin', when it comes down to it."},{"name":"TORITATE00243","text":"Thought 'e might o' taken the loot with 'im, but the only thing missin's what was in this 'ere chest. Accordin' to yon shopkeep, it weren't naught but a pile o' Mamool Ja coinage, and that ain't worth it's weight in shite to anyone this side o' the Deep."},{"name":"TORITATE00243","text":"Exceptin' the Mamool Ja, that is... No Eorzean merchant'd touch that stuff with a forty–yalm bargepole, but chances are it's still o' some value to the beasts. 'Ere, ye don't reckon the rat bastard's gone off to 'ire 'imself a lizardman army, do ye?"},{"name":"TORITATE00243","text":"There's a band o' the scaly buggers 'angin' around northwards, but a Qiqirn's one thing an' a Mamool Ja's another─I ain't gettin' paid enough to go pokin' me nose in lizard business. I'll 'ead back to Limsa an' report to Zango. Don't ye be gettin' yerself in any trouble now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"YOUHEI00243","text":"Mamool Ja money not worthless! You worthless! Never did we say we would pay with gil!"},{"name":"JIJIROON","text":"Look, look! Debt collector comes to collect Jijiroon's debts! Jijiroon give Mamool Ja back the shiny shinies, then good Mamool Ja protect Jijiroon from bad collector, yes?"},{"name":"YOUHEI00243","text":"Very well, Jijiroon, you have a deal! Mamool Ja protect you from smoothskin! Soldiers, cover our retreat!"},{"name":"BALOON","text":"Mamool Ja deal with you!"},{"name":"YOUHEI00243","text":"You seek Jijiroon, collector? The pirate has him. Mamool Ja make deal to protect Jijiroon from you, and you alone. He say nothing about the pirate."},{"name":"YOUHEI00243","text":"You are not collector? ...Then Mamool Ja work is done. Jijiroon make another bad deal─no wonder collectors are after him."},{"name":"YOUHEI00243","text":"Mamool Ja make good deal with Jijiroon─buy many items, and pay fair price. But when we pay, Jijiroon say our money no good, and ask for gil."},{"name":"YOUHEI00243","text":"If Jijiroon want gil, he need to say so at the start. Mamool Ja proud warriors, not mind readers! You want find Jijiroon? Speak with rat brother. Maybe he knows where the pirate take him."},{"name":"MEMEROON","text":"Jijiroon did deal with Mamool Ja and got Mamool Ja shiny shinies? But Mamool Ja shinies no good to pay back his back payments?"},{"name":"MEMEROON","text":"Oh no, oh no! Jijiroon collected by collector? That collector a pirate collector, and pirate collectors deter debtors by barreling them in barrels, and jettisoning them from jetties!"},{"name":"MEMEROON","text":"Got to stop Jijiroon getting launched in the lake! Go to Jijiroon shop, and stop freebooter booting Jijiroon into the wet, wet water! Memeroon got arrangements to arrange, but see you there soon!"},{"name":"MEMEROON","text":"Bad, bad pirate make Jijiroon walk long walk off short plank! Got to go to Jijiroon shop and stop him going plop! Memeroon got preparations to prepare, but Memeroon be along before long."},{"name":"JIJIROON","text":"(-???-)Boohoo, boohoo... &lt;sniffle&gt;"},{"name":"TORITATE00243","text":"Well, if it ain't me ol' <span class=\"alternative-container\"><span class=\"alternative\">darlin'</span><span class=\"alternative\">matey</span></span>! Look 'ere, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─I finally got me mitts on the shirkin' wretch, an' 'e's about to take the plunge!"},{"name":"TORITATE00243","text":"Seems 'e'd been makin' merry with the Mamool Ja, but 'e never counted on 'em tryin' to lumber 'im with their own dodgy lucre. An' ye can't pay yer debts with lizard coin, can ye, Jijiroon?"},{"name":"TORITATE00243","text":"Poor ol' bugger ain't a bad sort, really─should've just been a bit more careful drawin' up his deals with the beastmen. But good intentions don't count fer shite in this business─a defaulter's a defaulter, and a bailiff's got to do what a bailiff's got to do."},{"name":"TORITATE00243","text":"I thought I'd washed me 'ands o' the pirate life when I went into the collectin' racket, but the old ways still come in 'andy. They pays me a pretty penny to give those as bilk their lenders the old 'eave–'o, pirate style─bung 'em in a barrel, and sling 'em in the briny!"},{"name":"MEMEROON","text":"Stop, stop, stop! Memeroon give you shinies! Many, many shinies to repay repayments!"},{"name":"TORITATE00243","text":"'Ere, what's with the 'ubbub, whiskers? Are ye sayin' ye'll pay off Jijiroon's debts fer 'im?"},{"name":"TORITATE00243","text":"Well, blow me down... There's enough gil 'ere to drag down a galleon! Aye, this'll cover what the Consortium's after, alright. That's an end to that, then─time to let the rat out o' the barrel."},{"name":"JIJIROON","text":"Jijiroon no speak to Memeroon for long, long time, but Memeroon pay Jijiroon's payment? Jijiroon not worthy of worthy Memeroon... Nothing to give in return. Nothing but...Jijiroon shop. Jijiroon shop Jijiroon shop no more. Jijiroon shop Memeroon shop now."},{"name":"MEMEROON","text":"No, no, no! Memeroon no take Jijiroon shop! Jijiroon keep dealing deals, and pay Memeroon back bit by bit."},{"name":"TORITATE00243","text":"'Ere, ain't ye lookin' to get yer 'ands on 'is tradin' post? I thought you Qiqirns was all cutthroat when it came to business─if you 'ad 'is plot, ye'd 'ave the 'ole of upper La Noscea under yer thumb. An' there ain't nothin' like a monopoly to push up prices!"},{"name":"MEMEROON","text":"No, no, no! Memeroon no want Jijiroon shop, Memeroon just want to help! Why Jijiroon no ask helpful Memeroon for helpful help!?"},{"name":"JIJIROON","text":"Jijiroon could no face showing Memeroon his face... Good Memeroon suggest good suggestions, but ignorant Jijiroon ignore proposals, and propose Memeroon go away. Jijiroon wrong to wrong Memeroon─feel bad feelings ever since..."},{"name":"MEMEROON","text":"Jijiroon no wrong─Jijiroon and Memeroon differ because Jijiroon and Memeroon different. Good Jijiroon stand up for long–standing customers; good Memeroon like to look for likely place to find new customers. Different ways of working, but both ways can work."},{"name":"TORITATE00243","text":"Ah, so that's 'ow it is... Ye were stuck on stayin' put 'cause ye didn't want to leave yer ol' customers in the lurch, eh?"},{"name":"TORITATE00243","text":"But while yer brother's new post starts rollin' it, pickin' up all the new custom off the western road, yer ol' faithful let ye down. Only takes a few big–money deals to go south, an' before ye know it, ye ain't got a pot to piss in. It's a sorry tale, to be sure..."},{"name":"MEMEROON","text":"Memeroon only set up new shop to show Memeroon as good a trader as good trader Jijiroon! If Jijiroon not there to motivate Memeroon, Memeroon got no motivation! Jijiroon will always be Memeroon's unrivaled rival!"},{"name":"TORITATE00243","text":"D'ye 'ear that, Jijiroon? Yer little brother don't 'alf set store in ye. An' what better way's there to thank 'im fer savin' yer 'ide than bringin' yer business back to its feet? ...Just remember to get 'em to pay ye in gil next time."},{"name":"JIJIROON","text":"Jijiroon got tears in teary eyes! Jijiroon agrees to agreement─Jijiroon deal better deals, and get the better of Memeroon! Not as bad, bad enemies, but good, good rivals!"},{"name":"TORITATE00243","text":"Now that's what I call a deal! An' with both o' ye backin' up the other, I reckon there's no way this one'll fall through. Go on then, lads: get back to yer posts, draw up yer plans, and show La Noscea what ye've got!"},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":1374,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1010438","obj":{"i":1010438,"n":"Retired Reaver","l":34,"q":1}},{"type":"npc","id":"1001787","obj":{"i":1001787,"n":"Bango Zango","l":29,"s":10,"q":1,"t":"Brugaire Consortium","a":739,"c":[10.01,11.44]}},{"type":"npc","id":"1005249","obj":{"i":1005249,"n":"Memeroon","l":34,"q":3,"t":"Junkmonger"}},{"type":"npc","id":"1010434","obj":{"i":1010434,"n":"Bum-bailiff","l":34,"q":1}},{"type":"npc","id":"1010435","obj":{"i":1010435,"n":"Jijiroon","l":34,"q":1}},{"type":"npc","id":"1010436","obj":{"i":1010436,"n":"Mamool Ja Mercenary Captain","l":34,"q":1}},{"type":"npc","id":"1010437","obj":{"i":1010437,"n":"Mamool Ja Mercenary Captain","l":34,"q":1}}]}