{"quest":{"name":"Master and Student","location":"Eastern La Noscea","id":65770,"patch":2.4,"sort":9,"icon":100327,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1002515,1010632,1010633,1010634,1010762],"genre":152,"journal":["After much soul-searching, Oboro has reached a resolution.","Oboro politely expresses his gratitude for the assistance you offered in his mission before abruptly informing you that he and his fellow Domans will be journeying on from Eorzea. As a final favor, he has asked you to watch over the recovering Tsubame while he pays one last visit to the place in Eorzea most special to him.","Tsubame's wounds have healed impressively, leading her to surmise that Karasu manipulated his attack on her primarily for visual effect. She is more concerned for Oboro, who she feels is hiding his true feelings from her. Seek him out at his favorite Eorzean haunt, Fool Falls in upper La Noscea.","Initially taken aback at your presence, Oboro soon confesses his true feelings to you. His battle with Karasu has left the shinobi a changed man. No longer willing or able to repress his true self, he has chosen to forsake obligation in favor of following his own heart's desire, which urges him to seek out the truth behind the traitor he hunted for so long. Prepared to face the answer he fears the most, he has resolved to undertake this final mission alone, insisting that Tsubame and you have sacrificed enough on his behalf. No sooner does he leave than Tsubame steps out from the shadows, looking very concerned at his words.","Oboro's words confirm Tsubame's worst fear: that he means to seek out and confront Master Gekkai alone, even if it means sacrificing his life. She explains that she, too, has come to a resolution─to fight at Oboro's side─and has no intention of being denied. Recalling the dying Karasu's last words, Tsubame suggests that you make for Candlekeep Quay and question the guards about any happenings of note in the area.","According to Zahrmerl, everything is quiet on the quay, save for talk of a small private vessel scheduled to arrive in port at the break of dawn. Though it appears that Oboro is already in the area, Tsubame deems it too dangerous to search for him and attempt to make contact at this time, preferring to observe the area from a safe distance until Master Gekkai shows himself. Take up position on the promontory above the quay and keep lookout for any suspicious movements.","Karasu's tale─Oboro's worst fears─is confirmed as true when the Garlean espionage unit commander who sailed into Candlekeep Quay is indeed revealed to be none other than Master Gekkai. Confronted by his former pupil, Gekkai shows no remorse, coolly explaining how he made a simple decision to seek out a stronger master, while at the same time guaranteeing the safety of his village over that of countless Doman commonfolk that were of no import to him. Incensed by his one-time master's callous disdain for the nation he called home, Oboro draws his blade and swears vengeance, and together you, he, and Tsubame defeat the shinobi master. After the battle, Karasu returns from his self-staged death to bequeath to you the final piece of your ninja garb, and to Oboro the soul crystal that will allow him to go home to a hero's welcome, before walking off to parts unknown. His long mission finally at an end, Oboro returns to the dock storehouse. Meet him there to say your farewells.","Upon returning to the storehouse, Oboro imparts to you a final ninjutsu technique, Kassatsu. While the two shinobi initially intended to return home together, Oboro has decided to remain behind to continue his study of Eorzean culture, in hopes of bringing new schools of thought back to his home. From your experiences traveling with Oboro and Tsubame and fighting at their side, it would seem that the future of the village is in good hands.<br><br>※The next ninja quest will be available from Oboro once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Tsubame.","Search for Oboro at Fool Falls.","Speak with Tsubame.","Speak with Zahrmerl at Candlekeep Quay.","Keep watch from the lookout point.","Speak with Oboro at the dock storehouse."],"dialogue":[{"name":"OBORO","text":"Ah, <span class=\"highlight\">Forename</span>. Your return pleases me. I feared I might miss the chance to bid you a proper farewell."},{"name":"OBORO","text":"Yes, we will be taking our leave from your realm. My mission is complete, and Tsubame's wounds have all but healed. Tradition dictates that we return to our elders to deliver tidings of our success."},{"name":"OBORO","text":"Redbeak's last words? I will not lie─at first, they weighed heavily on my mind. But in the end, I am a shinobi─I came to this land to perform a role, not out of curiosity or spite. "},{"name":"OBORO","text":"Mayhap Master Gekkai still lives, mayhap not─it is no longer my concern. Karasu is dead, and with his passing, it is time to close the curtain on this chapter of our lives."},{"name":"OBORO","text":"Before I leave, I would ask one favor of you. There is a place I would visit before we depart your realm. I would go alone to gather my thoughts."},{"name":"OBORO","text":"Could you pray look after Tsubame while I am away? Her condition has much improved, but I would not take any chances. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"TSUBAME","text":"Oboro has not been himself since the two of you returned from your battle with Karasu. He seems strangely...distant. Please speak to him─perhaps your words will reach him where mine have failed."},{"name":"TSUBAME","text":"Your concern is most touching, but I am quite fine, <span class=\"highlight\">Forename</span>. In fact, it would seem that the injuries I suffered were not nearly as grave as they appeared on first glance. It would appear that Karasu meant more to fan the flames of Oboro's ire than to cause true harm."},{"name":"TSUBAME","text":"Speaking of Oboro, have you seen him about? It is not like him to disappear in the midst of our preparations for departure."},{"name":"TSUBAME","text":"Alone with his thoughts, you say? Where do you suppose he might have gone?"},{"name":"Q1","text":"Where might Oboro have traveled?"},{"name":"A1","text":"Limsa Lominsa."},{"name":"A1","text":"Fool Falls."},{"name":"A1","text":"Bronze Lake."},{"name":"TSUBAME","text":"Truly? Perhaps Eorzeans feel most at peace in a bustling city–state, but that doesn't sound like Oboro at all."},{"name":"TSUBAME","text":"The place where the two of you practiced, yes? He always has had a fondness for waterfalls. Yes, that is it! It must be!"},{"name":"TSUBAME","text":"<span class=\"highlight\">Forename</span>, Oboro is not himself of late. Perhaps I worry overmuch, but I could never forgive myself if something ill were to befall him. You <span class=\"emphasis\">will</span> go look after him for me, will you?"},{"name":"TSUBAME","text":"I seek not to change his heart, if his heart is truly made up. I wish only to know his true feelings, that I might support him in whatever humble way I can."},{"name":"TSUBAME","text":"Bronze Lake? Oboro does enjoy a bath, but the hustle and bustle of that place was not to his liking. Knowing him as I do, I cannot help but feel he would seek out more peaceful environs..."},{"name":"TSUBAME","text":"I seek not to change Oboro's heart, if his heart is truly made up. I wish only to know his true feelings, that I might support him in whatever humble way I can."},{"name":"OBORO","text":"What are you doing here, <span class=\"highlight\">Forename</span>? I took you for a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your word..."},{"name":"OBORO","text":"...Tsubame sent you, didn't she? It looks like I was the fool for thinking I could fool two who know me so well."},{"name":"OBORO","text":"Ever since that day, this is the only place in the world where I can find a moment's respite from the turmoil that rages within me. And yet, the instant the sound of the crashing waters fade from earshot, it all comes flooding back..."},{"name":"OBORO","text":"You have proven yourself a true friend to us, and a worthy shinobi in your own right. Answer this for me, <span class=\"highlight\">Forename</span>: for what, for <span class=\"emphasis\">whom</span> do you wield your blade?"},{"name":"Q2","text":"For whom or what do you fight?"},{"name":"A2","text":"For myself."},{"name":"A2","text":"For power."},{"name":"A2","text":"For those around me."},{"name":"A2","text":"For reasons I alone shall know."},{"name":"OBORO","text":"A clear, unwavering answer worthy of you, <span class=\"highlight\">Forename</span>. Yes─why fight, if not for that which you believe is unquestionably right?"},{"name":"OBORO","text":"Puissant words from a puissant <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, <span class=\"highlight\">Forename</span>. Yes, without true power, how can one hope to stand up for that which you truly believe?"},{"name":"OBORO","text":"...Yes. I knew you a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> after my own heart, <span class=\"highlight\">Forename</span>. Standing here just now, that is the answer that I arrived at as well."},{"name":"OBORO","text":"Forgive me, <span class=\"highlight\">Forename</span>─it was a fool question. Well do I know that true conviction must come from within. And yet..."},{"name":"OBORO","text":"I speak in earnest to you, <span class=\"highlight\">Forename</span>. Our battle with Karasu, his dying words... They left me a changed man, and I can no longer deny what I have become."},{"name":"OBORO","text":"For so many years, I questioned nothing. Tradition, custom, my mission... I was a shinobi─a blade─and a blade does not think. I shut off the doubts, the emotions that threatened to rise to the surface, and told myself <span class=\"emphasis\">this</span> was true presence of mind."},{"name":"OBORO","text":"I lie to myself no longer. In confronting Karasu, I confronted myself. Looking upon Tsubame, lying battered and beaten like my countrymen so many years ago, I felt a single, all-consuming desire─to visit retribution upon those who wronged us, and to do so by my own hand."},{"name":"OBORO","text":"I have made my decision. I shall go and face the truth, for it is only in doing so that my heart will ever know true peace. I will go alone, and I will hear no more of it. You and Tsubame have sacrificed and suffered more than enough─the battle that awaits is mine and mine alone."},{"name":"OBORO","text":"If it is Master Gekkai I find at the end of my journey, so be it. One or both of us will die─it matters not. Either way, my mind will be at rest. You have been a true friend and ally, <span class=\"highlight\">Forename</span>. Farewell."},{"name":"TSUBAME","text":"(-Tsubame-)Oboro..."},{"name":"TSUBAME","text":"Forgive me, <span class=\"highlight\">Forename</span>. It was as if my legs moved of their own accord."},{"name":"TSUBAME","text":"It is just as I imagined. Oboro means to confront Master Gekkai, even if it costs him his life."},{"name":"TSUBAME","text":"He has made his decision, and I will not stand in his way. But neither will he stand in the way of mine. Wheresoever Oboro fights, I will fight beside him."},{"name":"TSUBAME","text":"If it is not too much to ask, pray lend your strength to us this one final time, <span class=\"highlight\">Forename</span>. You have proven yourself a true shinobi, and your blade, unfettered by tradition or convention, may just be what turns the tide of battle in our favor."},{"name":"TSUBAME","text":"Oboro did not say where he was headed, but we already know, don't we? Karasu's last words: Candlekeep Quay. Let us see what the guards there might tell us."},{"name":"ZAHRMERL","text":"Any unusual happenings of late? Not as such, save for a small private vessel scheduled to dock tomorrow at the crack of dawn. Other than that, it's all pretty quiet around these parts, as it's wont to be."},{"name":"ZAHRMERL","text":"Funny thing, though. You're not the first one to ask that question. A milkmaid─a fairly comely one at that─came by not minutes ago asking the very same question."},{"name":"TSUBAME","text":"...Is that so? The milkmaid is one of Oboro's favorite costumes. As we might suspect, he's one step ahead of us."},{"name":"TSUBAME","text":"If we could rendezvous with him somehow, it would give us the advantage in numbers. And yet, the risk of exposing ourselves to our foe is too great. We should observe from the shadows until Master Gekkai reveals himself."},{"name":"TSUBAME","text":"I will take up position on the western shoreline. You take to the high ground and keep watch from the promontory over there. Between the two of us, that should cover the entire quay."},{"name":"ZAHRMERL","text":"Any unusual happenings of late? Not as such, save for a small private vessel scheduled to dock tomorrow at the crack of dawn. Other than that, it's all pretty quiet around these parts, as it's wont to be."},{"name":"STRANGE00234","text":"Who goes there!? Show yourself!"},{"name":"GEKKAI","text":"(-???-)I know a rat when I smell one."},{"name":"OBORO","text":"I trust that I am speaking with the Garlean Empire's chief of espionage and covert operations."},{"name":"HATENA","text":"(-???-)...None other."},{"name":"GEKKAI","text":"But you can call me “Master” if you like, young one. For old times' sake..."},{"name":"GEKKAI","text":"You're full of surprises these days, young one. The Oboro I knew would have been on the first ship back to Doma once Karasu cawed his last caw."},{"name":"GEKKAI","text":"You look sturdier than I remember, if a bit gaunt in the cheeks. Are you getting enough rest? You always worked just a bit <span class=\"emphasis\">too</span> hard for your own good."},{"name":"OBORO","text":"All these years...it was you... You, who taught me the way of the shinobi... You, who I loved as a father! Why, Master... Why!?"},{"name":"GEKKAI","text":"Why else...? For our village, of course. I simply made the choice that any true shinobi would make."},{"name":"GEKKAI","text":"Don't tell me you require a history lesson, young one. Since the time of our ancestors, the shinobi have served many masters."},{"name":"GEKKAI","text":"For many years, I served Doma. Then, when the time was right, I chose a more powerful master. Fortunately for me─and for our village─my services were in high demand."},{"name":"GEKKAI","text":"Have you never wondered <span class=\"emphasis\">why</span>, Oboro? Why, when the Doman rebellion was crushed by the Empire, was our village alone spared Garlemald's wrath? It was because of <span class=\"emphasis\">my</span> actions. <span class=\"emphasis\">I</span> protected us where the entire nation of Doma could not."},{"name":"OBORO","text":"Protected!? <span class=\"emphasis\">You betrayed us all</span>! The people of Doma trusted us!"},{"name":"OBORO","text":"Do you know how many Domans died that day!? We swore our lives to protect them, and you sold them into slaughter! Do you feel <span class=\"emphasis\">nothing</span>!? Not even a twinge of remorse at the massacre you brought upon your countrymen?"},{"name":"GEKKAI","text":"Countrymen? What is Doma to me when weighed against the ancient and glorious history of my fellow <span class=\"emphasis\">shinobi</span>? History is littered with the husks of fragile men who gave their worthless lives to bring glory to their betters."},{"name":"OBORO","text":"I hoped against hope that Karasu was wrong. That his story was naught but the twisted lies of a sad fool. But no...<span class=\"emphasis\">I</span> was the fool. Master─no, <span class=\"emphasis\">Gekkai</span>, for you are no master of mine... In the name of the souls of the untold thousands whose blood is on your hands, I declare your life forfeit."},{"name":"GEKKAI","text":"Hahaha... Revenge, is it? Revenge for foot soldiers and peasants? Is <span class=\"emphasis\">that</span> what this is all about? That's why you lingered here like a festering boil after your allotted mission was complete?"},{"name":"GEKKAI","text":"Forsaking your role for some selfish flight of fancy will not earn you many friends back home, Oboro. Nor here..."},{"name":"GEKKAI","text":"The more time I spend in Garlemald, the more I realize that the Empire quite suits me. There is something to be said for a culture that values merciless strength above all. I've won over quite a few loyal subordinates..."},{"name":"GEKKAI","text":"Poor little one... All your lofty words, and here you stand alone. You are alone because you are <span class=\"emphasis\">weak</span>..."},{"name":"HATENA","text":"(-???-)He has no subordinates, this is true. This isn't an army, after all."},{"name":"TSUBAME","text":"But Oboro has something you will never have: comrades who believe in him and the ideals for which he fights!"},{"name":"OBORO","text":"Tsubame! How did you...!?"},{"name":"TSUBAME","text":"Not just me, Oboro. <span class=\"highlight\">Forename</span>, too, has come to fight at your side."},{"name":"GEKKAI","text":"<span class=\"emphasis\">Comrades</span>!? You would choose the company of a glorified sellsword over that of the master who made you what you are? Oh, how far my pupils have fallen!"},{"name":"TSUBAME","text":"<span class=\"emphasis\">You</span> are the one who has fallen, Gekkai. <span class=\"highlight\">Forename</span> fights with a sense of honor and purpose that you have long forgotten."},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>... I cannot begin to express my gratitude."},{"name":"OBORO","text":"My friends, my comrades─I am honored to fight at your side. Let us show this false master what true strength is!"},{"name":"OBORO","text":"Tsubame, <span class=\"highlight\">Forename</span>...thank you. It is through your belief in me that I was finally able to believe in myself..."},{"name":"OBORO","text":"And Karasu... You had a hand in bringing this chapter to a close. You may be gone, but you are not forgotten..."},{"name":"KARASU","text":"(-???-)Awww, that almost sounds like a eulogy! It almost makes me wish I were actually dead..."},{"name":"OBORO","text":"K-Karasu! You still live!? But...but how!?"},{"name":"KARASU","text":"Well, when it comes to playing dead, I did learn from one of the best, you know!"},{"name":"OBORO","text":"...I see. But why vanish, only to return?"},{"name":"KARASU","text":"Oh, just an undelivered present."},{"name":"TSUBAME","text":"This is...the fifth and final piece of <span class=\"highlight\">Forename</span>'s traditional garb!"},{"name":"KARASU","text":"Let it never be said that I don't complete my missions. Even if it's just playing delivery boy..."},{"name":"OBORO","text":"Wait, Karasu! The elders who named you traitor to our village. They were simply blind to the truth, as was I..."},{"name":"OBORO","text":"If I explain, they will surely see reason. Please, let us return home...together."},{"name":"KARASU","text":"Wh-What's this now!? Now <span class=\"emphasis\">that</span> wasn't in the script! How soon we forget, Oboro... I was not <span class=\"emphasis\">the</span> traitor, no, but I did follow him. That makes me just as much <span class=\"emphasis\">a</span> traitor, at least in their eyes."},{"name":"OBORO","text":"...Perhaps so. At the same time, you risked your life for what you believed in. We are not so different, you and I."},{"name":"KARASU","text":"The sentiment is most touching, but my answer remains no. The village was always a bit too cramped for me. I prefer to spread my wings on a grander stage."},{"name":"KARASU","text":"The honorable deeds of my present do not erase the terrible crimes of my past. I was a spy and assassin─quite a good one, I might add─and for all the blood Gekkai has on his hands, mine are nearly as red."},{"name":"KARASU","text":"In the elders' minds, you had one mission, Oboro. Why complicate the matter?"},{"name":"KARASU","text":"Bring this back, and tell the others what they want to hear─the traitor Karasu Redbeak is no more, slain at your hand. You will be welcomed as a hero, while my fate will be even grander. I will at long last be <span class=\"emphasis\">free</span>!"},{"name":"OBORO","text":"If that is how you would have it, Karasu, then so it shall be. But this I promise you: slowly but surely, our village will change. I will take what I have learned and build a village that honors all of our fallen. A village <span class=\"emphasis\">you</span> could be proud to call home."},{"name":"KARASU","text":"Just don't get too cocky, now, or I'll have to come back to put you and your whole village in its place."},{"name":"OBORO","text":"I look forward to that day. Let us meet again on the battlefield, and pit our ideals against each other as we did that day."},{"name":"TSUBAME","text":"The flood of emotions I felt when you leaped to our rescue, <span class=\"highlight\">Forename</span>...I have no words to describe it. So I will only say again: thank you for being a friend."},{"name":"OBORO","text":"It is strange, <span class=\"highlight\">Forename</span>... All this time, I believed I was instructing you in the way of the shinobi, and yet now that all is done, I feel that I should be the one to call you teacher."},{"name":"OBORO","text":"Thanks to you, I finally achieved true clarity and presence of mind. My blade is stronger for it, and more important still, I now understand what I am truly fighting for."},{"name":"OBORO","text":"Body or mind─by any measure, you are every bit my equal as a shinobi. Save for one final technique which I will now impart to you: Kassatsu."},{"name":"OBORO","text":"Use it to rearrange the energies channeled into your body, and unleash powerful ninjutsu techniques one after the next. But be warned. In our tongue, it means quite literally “life and death.” Which one it means for <span class=\"emphasis\">you</span> will depend entirely on your presence of mind."},{"name":"OBORO","text":"And with this, I believe we have both satisfied the respective sides of our initial agreement. We will return to our village...which means I must bid you farewell."},{"name":"OBORO","text":"...Though perhaps not this day. I would see my home change for the better, and introduce new ways of thinking to complement the old. But before I can, there is much I still must learn about this land."},{"name":"TSUBAME","text":"And so I will go on ahead. I will report to our elders the success of Oboro's mission, and inform them that he will return as soon as he recuperates from the wounds he sustained in battle."},{"name":"OBORO","text":"With the soul crystal that Karasu gave us, no one will doubt the success of our mission. It is a flawless plan, if I do say so myself!"},{"name":"TSUBAME","text":"Yes, how fortunate we were that <span class=\"emphasis\">I</span> thought of it. Never change, Oboro─promise me that."},{"name":"TSUBAME","text":"And with that, <span class=\"highlight\">Forename</span>, it seems that it is <span class=\"emphasis\">I</span> who will bid you farewell. You've been a true friend, and my heart awaits the day when we shall meet again."},{"name":"TSUBAME","text":"...But you <span class=\"emphasis\">will</span> return to give Oboro lessons from time to time, yes? I'm not convinced that his bows are as masterful as <span class=\"emphasis\">he</span> seems to think..."},{"name":"SYSTEM","text":"This concludes the ninja quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next ninja quest will be available from Oboro."},{"name":"QIB","text":"Defeat Gekkai!"},{"name":"QIB","text":"Oboro and I will thin the ranks! Make Gekkai feel your blade!"},{"name":"QIB","text":"Gekkai's ninjutsu is like nothing I've ever seen... But you can evade them!"},{"name":"QIB","text":"True talent is wasted on peons like you..."},{"name":"QIB","text":"How <span class=\"emphasis\">amusing</span>! Now, why don't we try <span class=\"emphasis\">this</span>?"},{"name":"QIB","text":"I tire of these games. Behold...true...power!"},{"name":"QIB","text":"This technique... It cannot be...!"},{"name":"QIB","text":"The lost fourth mudra!? But it was said to be pure myth!"},{"name":"TSUBAME","text":"<span class=\"highlight\">Forename</span>! Please...fight on!"},{"name":"OBORO","text":"I can fight...no further... I put my trust...in you..."}],"reward":{"action":2264,"items":[{"id":7890},{"id":20647}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":92}],"quests":[65769]},"next":[65771,67115]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1002515","obj":{"i":1002515,"n":"Zahrmerl","l":31,"q":1}},{"type":"npc","id":"1010632","obj":{"i":1010632,"n":"Tsubame","l":1428,"q":2}},{"type":"npc","id":"1010633","obj":{"i":1010633,"n":"Oboro","l":34,"q":1}},{"type":"npc","id":"1010634","obj":{"i":1010634,"n":"Tsubame","l":34,"q":1}},{"type":"npc","id":"1010762","obj":{"i":1010762,"n":"Tsubame","l":1428,"q":1}},{"type":"action","id":"2264","obj":{"i":2264,"n":"Kassatsu","c":2906,"j":30,"t":4,"l":50}},{"type":"item","id":"7890","obj":{"i":7890,"n":"Ninja Chainmail","l":55,"c":48057,"t":35,"p":1000}},{"type":"item","id":"20647","obj":{"i":20647,"n":"Koga Garb Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"65769","obj":{"i":65769,"n":"The Crow Knows","g":152,"l":"Middle La Noscea","s":8,"f":1}},{"type":"quest","id":"65771","obj":{"i":65771,"n":"Strangers in a Strange Land","g":152,"l":"Eastern La Noscea","s":500,"f":1}},{"type":"quest","id":"67115","obj":{"i":67115,"n":"A Relic Reborn (Yoshimitsu)","g":152,"l":"North Shroud","s":11,"f":1}}]}