{"quest":{"name":"Blues on Emerald Avenue","location":"Limsa Lominsa","id":65776,"patch":2.55,"sort":22,"icon":100360,"eventIcon":71221,"issuer":1009153,"target":1001285,"involved":[1001679,1003908,1010341,1010342,1010345,1010346,1010347],"genre":77,"journal":["The postmoogle's fluttering seems more frantic than usual.","The cause of the postmoogle's distress this time becomes quickly evident: a letter with an illegible address. With a bit of guesswork, however, the courier deduces the intended recipient is Wymond. Deliver the post to the sultanate's preeminent information broker on Emerald Avenue, and see if the postmoogle's deduction is any good.","Wymond reads the letter─only to discover that it is a ransom note for someone named “Raymond.” The kidnappers, a gang known as the “Purple Haze,” have taken his daughter, and will do her harm unless their demands are met. Wymond bids you find the list from behind the shack at Copperbell Mines, to make up for getting him into this mess.","Deliver it to Wymond, who awaits you at his usual spot on Emerald Avenue.","Taking the list, Wymond learns that the gang is demanding the deed to a plot of Raymond's ceruleum-rich land in exchange for the girl. The information-monger detects a merchant mastermind behind the scenes, and promises to end the dastardly scheme. He reveals that he once was a member of the Purple Haze─until Hildibrand and a flower girl named Myrtha allowed him to escape from that life. Now, Wymond intends to trap the criminals using the markets of Ul'dah, and bids you speak with Seseroga at the Sapphire Avenue Exchange to purchase ceruleum with a banknote.","Seseroga proves most obliging after seeing the banknote, and directs you to Syntgoht for all your ceruleum needs.","The banknote allows you to strike a deal with Syntgoht. The merchant speaks of fantastic rumors that Garlond Ironworks has invented a way to make airships for a fraction of present costs, and speculates that the price of ceruleum fuel will soon soar. Return now with the ceruleum futures contract to Wymond.","Wymond reveals the rumors of cost-efficient airships have been greatly exaggerated─by him. Though the hearsay appears real enough thanks to your purchase, it was all a ploy to start a ceruleum craze. He turns next to making it appear as though the Purple Haze will betray the mastermind for a small fortune. To that end, he bids you approach a member of the gang in his haunt, the Coffer & Coffin in central Thanalan, and express your interest in ceruleum-rich land.","Over a flagon of grog, the man of the Purple Haze gives you reason to believe he would betray the merchant mastermind...for the right offer. Return with these wispy words and the futures contract to Wymond.","Handing the ceruleum futures contract back to Wymond, you learn that your meeting with the Purple Haze has reached the mastermind's ears. The merchant will reveal himself in order to confront the gang about their dealings─drawing him into the open and right into Wymond's trap. The information-monger asks that you join him to the north of Cutter's Cry in central Thanalan, to rescue the girl and make the villains' plan go up in smoke.","From behind a bush, Wymond directs your attention to the mouth of the cave. There stand the villains, alongside Raymond's daughter. With a bit of luck, and a well-forged fake deed, you secure her release. Wymond then reveals that he sold the futures contract for the most volatile of firesands─and placed it near the scoundrels for the moment they light a pipe of somnus. One larger-than-expected explosion later, Wymond instructs the girl to return to her parents at Arrzaneth Ossuary. Verify that she makes it there safely.","Raymond is overjoyed that his daughter is little the worse for her ordeal, but even more grateful is his young wife. She thanks you profusely, and asks you deliver a small token of their thanks to Wymond as well. Deliver the single red rose to Wymond, who should be at his usual spot on Emerald Avenue.","You deliver the flower to Wymond. It is a single long-stemmed rose─the selfsame flower he once so treasured. Amazed, the information-monger opens the attached card to learn that Raymond's wife is Myrtha, the flower girl who brought him joy so long ago, and helped him towards the right side of the law. Happy that she is alive and with a good man, Wymond tells you time will begin to flow for him again, on his part of Emerald Avenue."],"objectives":["Deliver the letter to Wymond in Ul'dah.","Search for the list of demands near Copperbell Mines.","Deliver the list of demands to Wymond.","Present the banknote to Seseroga at the Sapphire Avenue Exchange.","Deliver the banknote to Syntgoht.","Present the ceruleum futures contract to Wymond.","Show a hazy-eyed man the futures contract at the Coffer & Coffin in central Thanalan.","Deliver the futures contract to Wymond.","Rendezvous with Wymond at Cutter's Cry.","Speak with Raymond's wife in Ul'dah.","Deliver the single red rose to Wymond."],"dialogue":[{"name":"LETTERMOOGLE","text":"Dear me... A fine mess this is, a fine mess indeed, kupo..."},{"name":"LETTERMOOGLE","text":"...Kupopo!? I didn't notice you there! I was too preoccupied with living a postmoogle's worst nightmare!"},{"name":"LETTERMOOGLE","text":"I have a letter with an <span class=\"emphasis\">unreadable</span> address! All I can make out are the words “mond,” and “Ul'dah.” The rest is illegible squiggles. Who could it be!?"},{"name":"LETTERMOOGLE","text":"Clymond? No, maybe...Bymond? Or Frymond─ Oooh, of course: <span class=\"emphasis\">Wymond</span>! Yes, Wymond, the sultanate's information-monger."},{"name":"LETTERMOOGLE","text":"Not a single doubt about it, my assistant─Wymond in Ul'dah is our recipient! Now, take this letter to him. I believe he can be found on Emerald Avenue most days. I'll rest easy knowing it's in your experienced hands, kupo!"},{"name":"LETTERMOOGLE","text":"Have you delivered the letter to Wymond yet? If not, you'd best hurry, kupo. Gods know we've kept him waiting long enough!"},{"name":"WYMOND","text":"If it ain't my 'venturin' friend...or is it post<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> today? Can't say I was expectin' mail, though..."},{"name":"WYMOND","text":"“Raymond─we have your daughter. Demands behind shack at Copperbell. Obey or she dies.<br><br>The Purple Haze”"},{"name":"WYMOND","text":"'Tis...'tis a ransom note..."},{"name":"WYMOND","text":"Wh-Why'd you bring this to me!? I <span class=\"emphasis\">ain't</span> “Raymond,” you fool! An' I can't very well look the other way, can I!?"},{"name":"WYMOND","text":"&lt;sigh&gt; 'Course, it'd <span class=\"emphasis\">have</span> to be the godsdamned Purple Haze... Cruel sense of humor fate's got, makin' me remember what I've worked to forget."},{"name":"WYMOND","text":"They're a gang of crooks who'd do in a newborn babe for the right price. Thought they all got thrown in the clink before the Calamity. If they're at large again..."},{"name":"WYMOND","text":"...Then we've got to stop them! Aye, my home plus <span class=\"emphasis\">your</span> blunder makes it “we.” So I'll thank you to get their demands from Copperbell."},{"name":"WYMOND","text":"Up to us to stop the Purple Haze, <span class=\"highlight\">Forename</span>─so run an' find their ransom demands! Ought to be behind some shack near Copperbell Mines."},{"name":"WYMOND","text":"Nice timin'─I just got back myself from deliverin' the bad tidin's to Raymond an' his wife."},{"name":"WYMOND","text":"Good folk hit by bad fortune, those two. Had to stop 'em from callin' in the Brass Blades, though. That'd only force the Haze's hand, an' get the girl killed. Took a lot of promises, but they've trusted her life to me."},{"name":"WYMOND","text":"That's how it stands on my end. You got the ransom demands?"},{"name":"WYMOND","text":"...The Haze're demandin' the deed to Raymond's land...or the ceruleum 'neath it, more like."},{"name":"WYMOND","text":"Secure the mineral rights, an' live as kings. Clever. Too clever. I've got a sneakin' suspicion the gang's actin' as the brawn to some corrupt merchant. But they'll succeed over my dead body!"},{"name":"WYMOND","text":"...Before I get you involved, <span class=\"highlight\">Forename</span>, there's somethin' you ought to know: I used to be part of the Purple Haze."},{"name":"WYMOND","text":"Aye, I was one of the bastards. Blackmail, extortion, confidence tricks─if it was a far cry from lawful, I'd a hand in it."},{"name":"WYMOND","text":"Those were black days...and I'd still be lost in the dark─if not long dead─had it not been for <span class=\"emphasis\">her</span>... A flower girl named Myrtha who used to stand at this very spot."},{"name":"WYMOND","text":"Buyin' one of her roses turned into my daily routine. Just to hear her say “Thank you kindly, Mr. Wymund.”"},{"name":"WYMOND","text":"Not once did she get my name right. But seein' that innocent smile made me see goodness in the realm."},{"name":"WYMOND","text":"But then, the Haze silences this one bloke. He was a good, upstandin' type...who'd informed on the gang."},{"name":"WYMOND","text":"Brave man's sacrifice should've made for a happy endin'. But that informer was Myrtha's brother."},{"name":"WYMOND","text":"An' she just...vanished. Never saw her smilin' face again after that day. Not once."},{"name":"WYMOND","text":"...Ain't easy to talk about, even after all these years."},{"name":"WYMOND","text":"Anyroad, it was the push I needed to leave the criminal life. I sang like a canary to the most famous detective I could find: Hildibrand."},{"name":"WYMOND","text":"But he took <span class=\"emphasis\">me</span> for the dead man. Went around Ul'dah tellin' anyone who'd listen I was a “righteous monger of information.”"},{"name":"WYMOND","text":"Soon enough, all of the Haze were behind bars. I'd gotten my new chapter, but had nothin' else to my name. So, I stepped into the murdered bloke's life, an' rode the rumors to where I am today."},{"name":"WYMOND","text":"Come to think on it, though, where in the hells are that Hildy an' Nashu? Even that prize pair should've gotten wind of this kidnappin'."},{"name":"WYMOND","text":"...Well, my point is that I ain't standin' by while scum threatens a little girl's life. Can I count on your help savin' her, <span class=\"highlight\">Forename</span>?"},{"name":"WYMOND","text":"Good, good. 'Cause it just so happens I've got a scheme that needs two bodies."},{"name":"WYMOND","text":"The way I see it, the Haze'll disperse if we snuff out the mastermind. But this merchant's too smart to be caught within a malm of the gang. So we'll just need a trap so large he can't see it comin': the market itself!"},{"name":"WYMOND","text":"First, we have to start a few rumors, an' make 'em seem true. Make your way to Seseroga at the Sapphire Avenue Exchange, an' get his attention with this banknote."},{"name":"WYMOND","text":"Tell him you're workin' for a wealthy fellow who wants to buy as much ceruleum as he can with the gil promised on that paper. Then, actually buy a boatload of the fuel from whomever Seseroga introduces."},{"name":"WYMOND","text":"You mark my words, <span class=\"highlight\">Forename</span>─those villains're goin' to rue stumblin' back into my life."},{"name":"WYMOND","text":"Go an' speak with Seseroga at the Sapphire Avenue Exchange. Aye, the right word in his ear, an' every able merchant's like to learn what we want 'em to."},{"name":"WYMOND","text":"Tell him you're lookin' to buy ceruleum on behalf of an employer with that banknote. Then, get a load from whomever he introduces."},{"name":"SESEROGA","text":"Ah, adventurer─what do you want? A purveyor of ceruleum, you say? An expensive request─do you have the funds to back it?"},{"name":"SESEROGA","text":"My dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>─how came you by such great riches?"},{"name":"SESEROGA","text":"Your employer's money, eh? Well, allow me to assure you that you are speaking with the right person!"},{"name":"SESEROGA","text":"Syntgoht─the fellow over yonder─will be happy to provide all the ceruleum you desire. And let us not forget to thank the finder!"},{"name":"SESEROGA","text":"Your sudden interest, however, gives credence to today's rumors that a certain engineer's groundbreaking invention will send the demand for ceruleum, ahem, <span class=\"emphasis\">soaring</span>."},{"name":"SESEROGA","text":"Yes, 'tis perhaps time that I purchase ceruleum futures myself! What I could do for Mistress Momodi with... Ah, but I have said too much."},{"name":"SESEROGA","text":"Syntgoht just yonder is as fine a purveyor of ceruleum as I know, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"SESEROGA","text":"And with these new rumors about ceruleum, I shan't be more than a few steps behind!"},{"name":"SYNTGOHT","text":"Welcome, <span class=\"emphasis\">welcome</span>! What might a discerning─ Ceruleum? Of course! Are you interested in current stocks, or futures? And what do you have to spend?"},{"name":"SYNTGOHT","text":"Gods be good! In all my days, no one has ever placed so large an order! ...It is <span class=\"emphasis\">your</span> money, yes? If you are tied up in something shady, there can be no deal."},{"name":"SYNTGOHT","text":"...I see. Well, if this employer of yours is legitimate, I will be happy to assist you! And let me say, he has impeccable timing!"},{"name":"SYNTGOHT","text":"What do I mean? Why, just that the market has been full of rumors today, about Garlond Ironworks."},{"name":"SYNTGOHT","text":"The word is that those engineers found a way to craft airships for a fraction of the cost. Vessels will soon fill the skies, and the price of ceruleum will soar!"},{"name":"SYNTGOHT","text":"If this is true, ceruleum will become the most desirable of commodities. And with the amount he's willing to spend, I daresay your employer knows a thing or two we don't."},{"name":"SYNTGOHT","text":"But this is not the time for talk! Here is your ceruleum futures contract. I'll make good on it─or my name isn't Syntgoht!"},{"name":"SYNTGOHT","text":"Never fear, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I will make good on that ceruleum futures contract. And for all your other needs, I hope you continue to think of Syntgoht's Sundries!"},{"name":"WYMOND","text":"Heard Seseroga introduced you to Syntgoht. Do you have a futures contract to show for your dealin's with him?"},{"name":"WYMOND","text":"Well, you've set the price of ceruleum soarin' high as an airship! Aye, it was me who started those rumors. But they look real now that you've placed that order."},{"name":"WYMOND","text":"Hold on to the futures contract for now. 'Tis the very bait we need to lure the mastermind into the open."},{"name":"WYMOND","text":"No doubt he's heard how you swept into the markets. That's like to vex him, as is the news that he's gotten himself a rival businessman with a real adept underlin'."},{"name":"WYMOND","text":"An' how do you imagine he'd feel if said underlin' were to meet with the Haze secretly? With ceruleum prices high as they are, he'd feel betrayed for godsdamned sure!"},{"name":"WYMOND","text":"Aye, <span class=\"highlight\">Forename</span>, it's a date with a kidnapper at the Coffer & Coffin for you! You'll have to find a man of the Haze, 'course, but just keep your eyes out."},{"name":"WYMOND","text":"Get his attention with a pint. Then, show him the futures contract, an' let it slip your employer's lookin' for rich land. His greed'll do the rest!"},{"name":"WYMOND","text":"Plan calls for you to move yourself to the Coffer & Coffin, 'venturer, to meet a man of the Purple Haze."},{"name":"WYMOND","text":"When you find one, put a little liquor in him. Then, give him a peek at the futures contract, an' let it slip your employer's searchin' for rich land!"},{"name":"VILLAIN00240","text":"Wha...? A drink? Fine. Ain't nothin' in the realm for free, though. What d'you want?"},{"name":"VILLAIN00240","text":"...So it's <span class=\"emphasis\">your</span> master what's struck it rich in this ceruleum craze! Hah! S'pose it's him I ought to thank for this grog, eh?"},{"name":"VILLAIN00240","text":"Mine his own ceruleum!? Har har! I'll wager he is, the greedy bugger! ...Hmmm. Maybe you've got an itch I can scratch."},{"name":"VILLAIN00240","text":"I'll be comin' into the deed to a huge plot of land shortly. Ceruleum-rich land. Its yield? Take what you're imaginin', an' add two zeroes. <span class=\"emphasis\">Two</span>."},{"name":"VILLAIN00240","text":"Might be land ain't quite me cup of tea. Might be as I'm willin' to sell it. For the right offer, that is."},{"name":"VILLAIN00240","text":"Just a little somethin' to think about. But I'm drownin' me troubles here most days if you fancy another chat."},{"name":"VILLAIN00240","text":"The mead here don't half go down well. When you've a mind to talk business, come back an' join me for a pint."},{"name":"WYMOND","text":"While you were gone, the price of ceruleum hit its peak. I'll need the contract back now. It'll fetch a good price, an' give me the funds to finish things with a bang."},{"name":"WYMOND","text":"'Preciate it. Aye, an' you meetin' with that thug. Our mastermind's sure to be feelin' betrayed, what with his underlin' talkin' to my own in the Coffer & Coffin."},{"name":"WYMOND","text":"After he went to the trouble of kidnappin' Raymond's daughter, false friends tryin' to turn a profit on their own ain't like to sit well with him."},{"name":"WYMOND","text":"An' I've given him a little push with a certain letter as well. Reckon he'll be leavin' to question the Haze round about now."},{"name":"WYMOND","text":"The lot of them're makin' for Cutter's Cry─an' straight into the trap you've worked to bait. Leave the springin' of it to me."},{"name":"WYMOND","text":"Heh, ain't none of them leavin' those caves unscathed."},{"name":"WYMOND","text":"What's it I mean to do? Can't spoil the surprise yet, but don't worry unduly. Wymond's just goin' to play a trick─somethin' from the bad ol' days!"},{"name":"WYMOND","text":"Meet me up north of Cutter's Cry, <span class=\"highlight\">Forename</span>. Then, we can watch the Haze's dreams go up in smoke!"},{"name":"WYMOND","text":"The stage is set, <span class=\"highlight\">Forename</span>, an' we're in for a good show."},{"name":"WYMOND","text":"The Haze said to put the deed over there. I obliged─with a forgery."},{"name":"WYMOND","text":"Our mastermind's here, too. I'm hopin' my deed fools them, so they'll let the girl go."},{"name":"WYMOND","text":"Easy, lass. You're safe now. Just keep close to that kindly 'venturer, eh?"},{"name":"WYMOND","text":"Whew... Well, looks to be drama unfoldin' 'twixt our villains."},{"name":"WYMOND","text":"Wouldn't want to be in that thug's boots─our mastermind's doubtless givin' the bloke a right proper grillin' about his relationship with you."},{"name":"WYMOND","text":"But at the end of the day, the merchant needs the Haze. To keep 'em sweet, he'll offer a bigger share of the spoils."},{"name":"WYMOND","text":"An' they'll accept it, I don't doubt. No sense in them sidin' with some 'venturer they barely know over the merchant's coin."},{"name":"WYMOND","text":"So they'll seal their deal with the Haze's solemn custom─passin' a pipe while speakin' a crook's vow: “That sworn in somnus's glow holds true in hellsfire.” Hah! As if a puff or two bound them to anythin'."},{"name":"WYMOND","text":"（★未使用／削除予定★）"},{"name":"WYMOND","text":"But I will say, that bit of somnus takes the edge off. But what if some bloke went an' hid military-grade firesand nearby? Heh heh."},{"name":"WYMOND","text":"Aye, the moment they light their pipe, one hundred million gil's worth of the stuff will explode! That's what I sold the futures contract for: explosives what can blow a settlement sky-high!"},{"name":"WYMOND","text":"Least, that's what the fellow who sold it─<br>Er...now hold on a moment..."},{"name":"WYMOND","text":"That whole “sky-high” bit might not've been a figure of speech..."},{"name":"WYMOND","text":"Seven hells!<br>I...er, hope somethin' survived that..."},{"name":"WYMOND","text":"Well, little one, I reckon you've had enough excitement to last a lifetime. Go an' find the Brass Blades. They'll see you safely to your parents."},{"name":"RAYMONDSDAUGHTER","text":"Y-Yes, sir! Thank you, sir!"},{"name":"WYMOND","text":"...Good child, that. <span class=\"highlight\">Forename</span>, make sure she meets her family at Arrzaneth Ossuary. They ought to thank you for all you've done."},{"name":"WYMOND","text":"I'd be grateful if you'd check in on Raymond's wife while you're there. She's young an' comely, but the worry made her look weary as a crone..."},{"name":"WYMOND","text":"Seen the girl an' her family at Arrzaneth Ossuary yet?"},{"name":"WYMOND","text":"No? Well, would you? An' check on Raymond's wife, too. Poor thing was half-dead with worry."},{"name":"RAYMOND","text":"Are you the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who rescued my daughter? Thank you, a thousand times, thank you! Truly, words cannot express how relieved I am to have her back! "},{"name":"RAYMONDSDAUGHTER","text":"Thanks again, 'venturer!"},{"name":"RAYMONDSWIFE","text":"Oh! Are you Wymond's friend? Then I owe you a great debt. I was beside myself with worry when he came, but no longer: my daughter is safe."},{"name":"RAYMONDSWIFE","text":"As she tells it, it seems we need fear the gang or that awful merchant no more."},{"name":"RAYMOND","text":"You have my gratitude as well. In truth, I wavered─enlist the Brass Blades to bring our daughter home by force, or leave it to Wymond to save her with cunning?"},{"name":"RAYMOND","text":"But my wife felt he could be trusted, and full glad am I that she convinced me to do so as well."},{"name":"RAYMONDSWIFE","text":"We wish to thank Wymond, too. Could you take this to him on Emerald Avenue? 'Tis a token, really, but I hope it shows our appreciation."},{"name":"RAYMONDSWIFE","text":"(-Raymond's Wife-)Once again, thank you for returning our daughter to us!"},{"name":"WYMOND","text":"Playin' post<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> again? Wait, wait─before you hand it over, are you dead certain it's for me, an', if it is, that it <span class=\"emphasis\">ain't</span> another ransom note?"},{"name":"WYMOND","text":"Heh, a rose. Just like what I used to buy from Myrtha."},{"name":"WYMOND","text":"Ever since she vanished, time's stood still for me. I've been waitin' for her so long, what used to be her spot's turned into mine."},{"name":"WYMOND","text":"Precious blossom, this. Makes the good memories come floodin' back... Who's it from, by the way?"},{"name":"WYMOND","text":"Raymond's wife, eh? Well, look at that─there's even a card."},{"name":"WYMOND","text":"“Thank you kindly, Mr. Wymund.<br><br>- Your Myrtha”"},{"name":"WYMOND","text":"Seven hells! It was <span class=\"emphasis\">her</span> all along?"},{"name":"WYMOND","text":"She grew up quick! I'm glad she's happy, an' has a good husband."},{"name":"WYMOND","text":"Thank you, <span class=\"highlight\">Forename</span>. I think time'll start movin' for me again."},{"name":"WYMOND","text":"“Thank you kindly, Mr. Wymund.”"},{"name":"WYMOND","text":"...Heh, she still doesn't get my name right...an' I wouldn't have it any other way."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":2449,"items":[{"id":5540}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66740]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1001285","obj":{"i":1001285,"n":"Wymond","l":40,"q":8}},{"type":"npc","id":"1001679","obj":{"i":1001679,"n":"Syntgoht","l":41,"q":12}},{"type":"npc","id":"1003908","obj":{"i":1003908,"n":"Seseroga","l":41,"q":5}},{"type":"npc","id":"1010341","obj":{"i":1010341,"n":"Hazy-eyed Hyur","l":43,"q":1}},{"type":"npc","id":"1010342","obj":{"i":1010342,"n":"Wymond","l":43,"q":1}},{"type":"npc","id":"1010345","obj":{"i":1010345,"n":"Raymond","l":40,"q":1}},{"type":"npc","id":"1010346","obj":{"i":1010346,"n":"Raymond's Wife","l":40,"q":1}},{"type":"npc","id":"1010347","obj":{"i":1010347,"n":"Raymond's Daughter","l":40,"q":1}},{"type":"item","id":"5540","obj":{"i":5540,"n":"Carnation","l":12,"c":25003,"t":54,"p":13}},{"type":"quest","id":"66740","obj":{"i":66740,"n":"The Rise and Fall of Gentlemen","g":68,"l":"Ul'dah","s":1,"f":1}}]}