{"quest":{"name":"Strangers in a Strange Land","location":"Eastern La Noscea","id":65771,"patch":3.0,"sort":500,"icon":100436,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1009943,1013882,1013884,1013885,1013892,1013967],"genre":152,"journal":["Oboro has been pondering how you might grow as a shinobi.","Oboro is convinced the path to mastery yet lies ahead of you, but is unsure where you should begin. He remembers that taking on missions in service of Doma honed his own skills, and wonders if perhaps you, too, are wanting for duty. Luckily, Jacke has recently asked for Oboro's presence in some urgent matter. Accompany your erstwhile mentor to the Rogues' Guild.","According to Jacke, there is a bandit in Far Eastern garb going about robbing people, and, even more concerning, using ninjutsu in the process. After checking a slightly disgruntled Oboro, the guildmaster asks that you both aid him in tracking the thief. Follow him to Summerford Farms, and there interview the victim, Mulfa Kelfa.","The distraught merchant tells you his sad tale of how two thieves stole his one rare and oh-so-expensive Far Eastern orb. Learning that the criminals headed northwest, Jacke proposes that you immediately give chase, that you might track them down before they have a chance to escape with their ill-gotten goods. Begin by traveling to where they were last seen, just outside Summerford Farms.","You find a trail of footprints leading northwest. Follow them on the path across the bridge, towards the Descent.","The footprints continue to the northwest. Climb down the wooden stairs, and see again where they lead.","You see the faint outlines of two figures near the entrance of Woad Whisper Canyon to the northeast. Head in that direction, and be ready for anything.","You corner a strange girl along the cliffs, who answers Jacke's questions by silently drawing her blades. Before you come to blows, however, Mulfa Kelfa arrives. He thanks you for your service, and then asks his bodyguard to kill you. Apparently, it would not do for you to learn how he acquired the orb. Unfortunately for him, you, Jacke, and Oboro make short work of his hired blade. The strange girl grudgingly thanks you for your aid. Oboro marks her for a person from the Far East, at which point her retainer, Akagi, introduces her as Princess Yuki Yatsurugi. She left her lands in search of treasures stolen from her clan. Oboro presumptuously offers her your aid, but she refuses, calling all shinobi traitors. Akagi, however, is more accommodating to Oboro's proposal, and promises to contact you should Yuki ever be found in danger. Return now to the dock storehouse, and hear Oboro's thoughts on the matter.","Oboro tells you that the princess's skills are famed in the Far East, and that she may have little need of your help. However, you have now promised your blade to her, and so must train both it and your mind so that you can protect her, no matter what may come.<br><br>※The next ninja quest will be available from Oboro upon reaching level 52."],"objectives":["Speak with Jacke at the Rogues' Guild.","Speak with Mulfa Kelfa at Summerford Farms.","Search the area west of Summerford Farms.","Search the area leading toward the Descent.","Search around the base of the Descent.","Speak with the peculiar suspect.","Speak with Oboro at the dock storehouse."],"dialogue":[{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>, you are well come. I can tell your devotion to our art has been absolute, and I sense that greater power awaits you."},{"name":"OBORO","text":"But I have no new ninjutsu to teach. You alone can awaken to the power inside you. But if you do, our art will be in the very beating of your heart."},{"name":"OBORO","text":"I learned much and more whilst I was a shinobi of Doma. Mayhap you would find your own way if your blade served a master..."},{"name":"OBORO","text":"Such thoughts will have to wait, however. Not minutes before you came through those doors, I received this missive from Jacke. He bid me come to Limsa proper with all due haste."},{"name":"OBORO","text":"Join me, <span class=\"highlight\">Forename</span>. Your path here began at the Rogues' Guild, and mayhap returning will spark something new within you."},{"name":"OBORO","text":"I wonder if Jacke will have any advice for you."},{"name":"OBORO","text":"Captain Jacke, it has been too long. I never did thank you properly for obtaining the ancestral garb of the shinobi."},{"name":"JACKE","text":"Ho there, I was wonderin' when ye'd show up. An' ye brought <span class=\"highlight\">Forename</span>! How are ye keepin', <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"JACKE","text":"Bene, bene. Now, I need a whid with Oboro. There's a thief on the loose in La Noscea who's fast─too fast to be a regular old rook."},{"name":"OBORO","text":"Hm. You have my sympathies for your problem, of course, but why summon me?"},{"name":"JACKE","text":"Well, as I was told it, the one doin' the cloyin' ain't from Eorzea. Came from the Far East, judgin' by the garb."},{"name":"OBORO","text":"How very strange... The journey is too long to be undertaken lightly. I wonder what drove them here?"},{"name":"JACKE","text":"Who knows, who knows? But here's the rum thing: this cove's a ninja, by all accounts."},{"name":"OBORO","text":"A ninja? Ahaha! It is uncanny how much your thief sounds like me, Jacke! Why, if I did not know better, I would say <span class=\"emphasis\">I</span> was your culprit!"},{"name":"JACKE","text":"Aye... So get yer daddles where I can see them!"},{"name":"JACKE","text":"Ahahahahaha! Couldn't help a bit of amusin' there. 'Course I don't actually suspect <span class=\"emphasis\">you</span>. Truthfully, I just wanted to see if ye knew anythin' what could help me with the case."},{"name":"OBORO","text":"That I would be taken in by so obvious a ruse... &lt;sigh&gt; Well, if the thief <span class=\"emphasis\">is</span> a shinobi of Doman origin, then I might know him. Would you allow me and <span class=\"highlight\">Forename</span> to aid your investigation?"},{"name":"JACKE","text":"With pleasure! Things'll go a good bit smoother with a couple dimber dambers like you on board. Why don't we go and see what the victim's got to say about our rook, eh?"},{"name":"JACKE","text":"Mulfa Kelfa's the cove we want, an' we'll find him over at Summerford Farms. Hah, been a goodly while since our last job together, <span class=\"highlight\">Forename</span>, an' I'm lookin' forward to havin' ye along!"},{"name":"JACKE","text":"Me an' my favorite <span class=\"alternative-container\"><span class=\"alternative\">mort</span><span class=\"alternative\">cull</span></span>, back on the job! Ye ready to go an' whiddle what's happened to this Mulfa Kelfa cove?"},{"name":"JACKE","text":"Lend that cove yonder yer wattles, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"MULFAKELFA","text":"And <span class=\"emphasis\">who</span>, pray tell, are <span class=\"emphasis\">you</span>? Yes, <span class=\"emphasis\">you</span>...and the gloomy-looking fellow there. Are these your people, Jacke? Can they handle this matter with the guild's customary sensitivity?"},{"name":"JACKE","text":"(-Jacke-)Aye, I reckon so. <span class=\"highlight\">Forename</span> here is one o' the guild's newer <span class=\"alternative-container\"><span class=\"alternative\">lasses</span><span class=\"alternative\">lads</span></span>. An' yer gloomy-lookin' cove is, er...a colt─just joined up, so to speak."},{"name":"MULFAKELFA","text":"In that case...bring back my orb! It's one of a kind, and they stole it from me─two nasty thieves with a Far Eastern look to them! And after I spent a bloody fortune on it!"},{"name":"MULFAKELFA","text":"The <span class=\"emphasis\">nerve</span> of those two, falling upon me just as I was on my way here. The fiends ran to the northwest, thrice as fast as my men could! I want them found and clapped in irons, damn it!"},{"name":"JACKE","text":"(-Jacke-)Well, we best get after 'em, then. If they <span class=\"emphasis\">are</span> foreigners, they won't know the lay o' the land. Might be as we can use that against 'em an' catch up afore they hop the twig."},{"name":"JACKE","text":"(-Jacke-)No need to be shy if it comes to bladework, but don't mill them, either. We need to find out why the rooks're cloyin' from honest folk."},{"name":"MULFAKELFA","text":"Get me my orb back! I don't care how!"},{"name":"GILPIN","text":"Move along. Ain't nothin' to see here."},{"name":"SYSETM","text":"You find a set of footsteps heading to the northwest."},{"name":"SYSETM","text":"You can just make out two figures ahead in Woad Whisper Canyon."},{"name":"OBORO","text":"He is not dead. I believe he simply knocked himself unconscious. The girl silently staring at us is of more immediate concern. From her looks, she is not to be taken lightly."},{"name":"JACKE","text":"Well, well, yer a dimber mort, make no mistake! So why's it ye've taken to cloyin'?"},{"name":"JACKE","text":"&lt;sigh&gt; Never a tender whid for Jacke, is there? No, it's <span class=\"emphasis\">always</span> a stabber..."},{"name":"MULFAKELFA","text":"Yes! That's her! The thief! Hah, I knew taking this to the guild was the right choice!"},{"name":"MULFAKELFA","text":"Sadly, this means our relationship is at an end. It would be...inconvenient if you were to learn of how I came by the orb. Sellsword? Your skills are required."},{"name":"GILPIN","text":"Har har har, it'd be me pleasure! Jacke's one to be reckoned with, but not when he's got two fledglin's at his side! Me trusty trident'll do fer 'em all!"},{"name":"JACKE","text":"Well, them's choice whids from a double-crossin' bastard. Neither o' ye mind bein' called fledglin's?"},{"name":"OBORO","text":"Not in the least. It will be all the sweeter to make him eat those words. And he is a more fitting foe than some silent maiden."},{"name":"GILPIN","text":"Har har, bluster an' rage all ye want─you won't be goin' gently into the night! Har har har!"},{"name":"JACKE","text":"Well, we did ye wrong, my dimber mort. Seems we owe ye an apology."},{"name":"YUKI","text":"(-Peculiar Suspect-)You have my thanks. But I didn't need your aid for such brutes as these."},{"name":"OBORO","text":"Your bow... Then it is true. You are from the Far East. Have we met, by any chance? You seem...familiar."},{"name":"YUKI","text":"(-Peculiar Suspect-)Hmph. Your accent marks you a shinobi. Akagi─explain the situation."},{"name":"AKAGI","text":"Ngh... Oh, you were the lot who were chasin' us? Scary, bein' chased.<br>...But, uh, er... Right. Why we're here."},{"name":"AKAGI","text":"Ahem... This is Yatsurugi no Yuki! If I understand your customs, you'd call her Princess Yuki of the Yatsurugi clan. She's left her lands to search for her family's treasures. They were stolen by bandits, you see."},{"name":"OBORO","text":"The Yatsurugi clan!? You are very far from your domain, Princess! Tell me, why make the journey?"},{"name":"YUKI","text":"(-Yuki-)...I have no time to talk, not while the identity of the bandits still eludes me. You need only know that I have taken back three of the stolen treasures, and I will leave when the other two are mine."},{"name":"OBORO","text":"Very well. Your reasons are yours to keep. But I cannot leave you without a sworn dagger, Princess."},{"name":"OBORO","text":"And I know just the person to do it. <span class=\"highlight\">Forename</span>, will you not aid in Princess Yuki's mission as her shinobi?"},{"name":"OBORO","text":"As you know, we are blades, and missions are as whetstones to us. Through duty and service, we sharpen our skills and our minds. This is the next step on your path."},{"name":"OBORO","text":"The princess is a stranger here. She can trust no one, save you. Your mission is to guard her with your life, and return her safely to her people. What say you?"},{"name":"YUKI","text":"(-Yuki-)Tch, you think me naive enough to trust <span class=\"emphasis\">shinobi</span>!? When Doma fell, we all saw <span class=\"emphasis\">your</span> daggers in its back! Come, Akagi─leave the traitors!"},{"name":"AKAGI","text":"...Been like that ever since we got here. Why, she'll barely let me pack her bloody clothes!"},{"name":"AKAGI","text":"I understand why she refuses my help when it comes to fightin', I suppose. I'm no warrior. But she does have her limits. Everyone does, pauper or princess. So, I'd appreciate it if you'd lend me a hand keepin' her...well, alive."},{"name":"OBORO","text":"Of course, my friend. If her life is in danger, send word here. <span class=\"highlight\">Forename</span> and I will answer."},{"name":"AKAGI","text":"I'm much obliged. You've no ide─ Ah, but, I'd best go. She'll have my head if she catches me chattin'. I'll be in touch!"},{"name":"JACKE","text":"Bitin' back Far Eastern baubles what was bitten, eh?"},{"name":"JACKE","text":"We'll need to whiddle more from that dastardly duo, I expect. The guild'll tip a daddle to track down the bandits that cloyed the treasures."},{"name":"OBORO","text":"Thank you, Jacke. When you have something, you know where to find us. Shall we, <span class=\"highlight\">Forename</span>?"},{"name":"OBORO","text":"I had heard of Yuki Yatsurugi before. The pride of her clan, puissant princess of the Far East..."},{"name":"OBORO","text":"If even a tenth of the rumors are true, she has reason to deny our aid. But somehow, you must earn her trust. Someday, her life may depend upon it."},{"name":"OBORO","text":"The path ahead of you is long. Your resolve cannot falter. I will help where I can, but from this day forth, you must devote your entire being to protecting Princess Yuki."},{"name":"SYSTEM","text":"The next ninja quest will be available from Oboro upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1201,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":92}],"questsType":"all","quests":[65770,65964]},"next":[67220]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1013882","obj":{"i":1013882,"n":"Jacke","l":30,"q":1}},{"type":"npc","id":"1013884","obj":{"i":1013884,"n":"Mulfa Kelfa","l":30,"q":1}},{"type":"npc","id":"1013885","obj":{"i":1013885,"n":"Gilpin","l":30,"q":1}},{"type":"npc","id":"1013892","obj":{"i":1013892,"n":"Peculiar Suspect","l":30,"q":1}},{"type":"npc","id":"1013967","obj":{"i":1013967,"n":"Oboro","l":30,"q":1}},{"type":"quest","id":"65770","obj":{"i":65770,"n":"Master and Student","g":152,"l":"Eastern La Noscea","s":9,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67220","obj":{"i":67220,"n":"The Impossible Girl","g":152,"l":"Eastern La Noscea","s":520,"f":1}}]}