{"quest":{"name":"Lone Survivor","location":"Limsa Lominsa","id":65777,"patch":2.45,"sort":15,"icon":100342,"eventIcon":71221,"issuer":1009153,"target":1010370,"involved":[1006312,1010372],"genre":77,"journal":["When the land is at war, the meanest lodgings never lack for tenants who sleep fitfully and wake screaming.","The deputy postmoogle has a mysterious delivery for you. Perhaps the recipient, the hermit Drest of the Severed String, can shed some light on the puzzling letter.","Drest's reaction is not exactly what one would call enlightening, but it certainly lives up to the postmoogle's fanfare. Signed, “The Ones You Killed,” the letter calls the hermit “Dashing Drest” and asks a singular question: “Do you dream of rain?” Reflect on it while you retrieve Drest's precious leather sack from Raincatcher Gully.","You find the leather sack, though you can still make neither head nor tail of the message in the letter. Perhaps Drest will have something to say about it, when you deliver the sack with its hoard of gil.","Drest's hard-won gil is gone from the sack, replaced with a blood-caked helm of a Garlean legionnaire. The terrified hermit begs you to draw off any watchers outside the shack, then meet him near the House of Sticks in lower La Noscea to guard him on his flight.","You arrive at the appointed location and discover that the rendezvous has become a rescue mission. Save Drest from the Garlean legionnaires and see whether you can finally get to the bottom of this very strange delivery.","Drest is safe, and may yet find his way out of the thorn–wood of his heart. You suspect that what happened on a rainy night three years ago was but the last straw, and the tragedy began when Garlemald set its sights on Drest's homeland... But that story is for another day."],"objectives":["Deliver the mysterious letter to Drest in eastern La Noscea.","Search for the leather sack.","Deliver the leather sack to Drest.","Rendezvous with Drest in lower La Noscea.","Rescue Drest."],"dialogue":[{"name":"LETTERMOOGLE","text":"My trusty <span class=\"highlight\">Forename</span>! I have a delivery for you, addressed to Drest at the Severed String, over in Raincatcher Gully, kupo. But..."},{"name":"LETTERMOOGLE","text":"I promised the Seedseers no more secrets, kupo! The letter was handed to me in a most curious way. Why, he seemed not to know of postmoogles, and was very furtive to boot."},{"name":"LETTERMOOGLE","text":"I introduced myself in a way that did credit to our kind, you can be sure! But when he asked me to deliver the letter in his stead, do you know what he said?"},{"name":"LETTERMOOGLE","text":"“Don't deliver it now; wait a few days”! Have you heard the like before? I know how much you enjoy the strange and the suspicious, so here you are, kupo!"},{"name":"LETTERMOOGLE","text":"This letter is for Drest at the Severed String, over in Raincatcher Gully. A very strange delivery in my opinion, kupo!"},{"name":"DREST","text":"It's...you. Been a while. A letter...a letter from who? Nobody knows me..."},{"name":"DREST","text":"\"My dear Dashing Drest,<br>Do you dream of rain?<br><br>The Ones You Killed“"},{"name":"DREST","text":"H-How did they know? Ghosts...ghosts that won't leave me in peace...!"},{"name":"DREST","text":"Taunting me. Before they...kill me. No...no...no! I won't let them! I'll run─I'll start over somewhere else!"},{"name":"DREST","text":"Help me! There's a leather sack hidden east of here. A peaceful spot...surrounded by rocks...trees..."},{"name":"DREST","text":"My savings... Gil...gil to go home with. Home to...my family. Get it for me, help me!"},{"name":"DREST","text":"Get my savings... A leather sack...hidden. A peaceful spot...surrounded by rocks...trees... East of here, help me!"},{"name":"DREST","text":"Did...did you find it? Did you find the leather sack?"},{"name":"DREST","text":"Thank the... But let me look inside─must be sure..."},{"name":"DREST","text":"What...?<br>No...no...no..."},{"name":"DREST","text":"Just a dream...a dream! Let me wake...wake...wake... Oh gods, mercy, have <span class=\"emphasis\">mercy</span>!"},{"name":"DREST","text":"You see it too!? No...no dream... A bloody helm...black blood, old blood! Idem in me...by the majesty of Garlemald...never to desert...idem in me!"},{"name":"DREST","text":"Ghosts...ghosts...ghosts. Three years, not a single night of peace and now...they rise."},{"name":"DREST","text":"Help me, they're watching right now. I...I have to get out of here. Go somewhere else...just a short while. Then I can...I can go home."},{"name":"DREST","text":"I'll go...out the back after you go out the front. Meet me...near the abandoned house in lower La Noscea. You know...the kobolds' squat. The House of Sticks."},{"name":"DREST","text":"Must...must be careful. I'll go...after you leave. The House of Sticks... Meet me near the House of Sticks."},{"name":"COLLEAGUE","text":"You'll clean that helm tonight, worm. Lick the blood and brains off of it while we drink the wine bought with your paltry hoard..."},{"name":"COLLEAGUE","text":"Once a craven, always a craven. Flushed you out like a rabbit with that letter. Isn't that what desert conies do? <span class=\"emphasis\">Dash</span>!?"},{"name":"DREST","text":"You...died. You all died."},{"name":"COLLEAGUE","text":"Not all, just most. Three good soldiers survived...and <span class=\"emphasis\">you</span>. Figured you for dead until I saw you skulking by the water a week ago. "},{"name":"COLLEAGUE","text":"Do you think <span class=\"emphasis\">we</span> don't dream of rain, worm? What honor in surviving an ambush, eh? Three years of disdain─that ends when we hand over a deserter to the cudgel–man."},{"name":"DREST","text":"I... I..."},{"name":"COLLEAGUE","text":"Hm? You a <span class=\"emphasis\">friend</span> to this scum? You ought to pick them more carefully!"},{"name":"POP","text":"The soldiers fix you with a murderous gaze!"},{"name":"BALLOON","text":"Your blood will paint my path to glory!"},{"name":"DREST","text":"&lt;groan&gt; I should have known...this would happen. Now I'll never go home..."},{"name":"COLLEAGUE","text":"Look at it this way, Dashing Drest: this is an easier way to go than what they do to deserters back in Garlemald!"},{"name":"DREST","text":"Thank...thank you. There's no one...knows I'm alive now. I'm...safe."},{"name":"DREST","text":"I was in a unit...of Garlean scouts. A Maelstrom ambush in heavy rain, three years ago."},{"name":"DREST","text":"I thought...I was the only survivor. It didn't feel like desertion. It felt like...dying."},{"name":"DREST","text":"You heard what they called me. Dashing Drest. I never tried to...run before that night. They...kill you for that. It's from...before...in the desert, I..."},{"name":"DREST","text":"Why did you...protect me? We're not kin. Look at me, I'm barely...barely a man. A broken, craven thing..."},{"name":"DREST","text":"You decided I should live. How...do you do that? I can't even decide some days...which foot to move first."},{"name":"DREST","text":"Do you think...I can be well again? Decide to live...not just be afraid to die?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It all begins with the first step."},{"name":"A1","text":"..."},{"name":"DREST","text":"True... I haven't thought things through in...in a long time. Not since my homeland fell to the Empire."},{"name":"DREST","text":"No...you don't have the answers either. But you─ You know that. And you can still...you can still decide. Without answers."},{"name":"DREST","text":"Home is─home isn't somewhere I can buy a fare to. It's not a sack of gil or answers I need but <span class=\"emphasis\">questions</span>. Why does it hurt? How do I feel..."},{"name":"DREST","text":"I will see my children again. But it's not the time yet. I think─I think, though, it will come. That's a start..."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":864,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1010370","obj":{"i":1010370,"n":"Drest","l":31,"q":1}},{"type":"npc","id":"1006312","obj":{"i":1006312,"n":"Drest","l":32,"q":6}},{"type":"npc","id":"1010372","obj":{"i":1010372,"n":"Sharp-eyed Shaver","l":31,"q":1}}]}