{"quest":{"name":"The Gift of Joy (The Goblet)","location":"The Goblet","id":65785,"patch":2.45,"sort":65,"interval":"daily","repeatable":1,"icon":100330,"eventIcon":71222,"issuer":1010746,"target":1010746,"genre":204,"usedItems":[9273],"journal":["The saint's little helper in the Goblet seeks your assistance in running the Starlight Celebration festivities.<br>※This quest is available for a limited time only.","You have volunteered your services to assist with the Starlight Celebration festivities. Pull on your Starlight tunic, and collect a child's message from one of the Starlight sentinels found within the Goblet.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have collected a letter to the Spinner. Return to the Brimming Heart and deliver the message to the saint's little helper.","You have delivered the message to the brusque and businesslike little helper. Take the gift from the festival volunteer, and hand it to the child waiting nearby.","You have performed your duty as a little helper, and brought gift-wrapped happiness to a child. Report to the saint's little helper in the Brimming Heart.","The volunteer is pleased with your efforts, and looks forward to your continuing assistance during the remainder of the Starlight Celebration."],"objectives":["Equip the Starlight tunic and collect a letter to the Spinner from a Starlight sentinel.","Deliver the letter to the Spinner to the saint's little helper.","Equip the Starlight tunic and deliver the lucky star to the waiting youngling.","Report to the saint's little helper."],"dialogue":[{"name":"VOLUNTEER65785","text":"Ready to spread that festive cheer? Then let's get straight to work, shall we?"},{"name":"VOLUNTEER65785","text":"Visit any of the Starlight sentinels within the Goblet, and bring back one of the children's messages. And be sure to wear your Starlight tunic─you never know when the younglings will be watching!"},{"name":"VOLUNTEER65785","text":"...Ah, I should mention that, aside from the trees that we volunteers placed ourselves, there are sentinels to be found within the gardens of your fellow adventurers."},{"name":"VOLUNTEER65785","text":"Visiting different trees will bring rewards in the form of differently colored festive tokens─a form of festival currency we've taken to calling “fallen stars.”"},{"name":"VOLUNTEER65785","text":"These fallen stars can be exchanged for a range of seasonal merchandise, and an industrious little helper can speak with the Starlight Celebration crier to learn exactly which hue of fallen star is obtained from visiting which tree."},{"name":"SYSTEM","text":"The position of Starlight sentinels will be displayed on your minimap. Search the residential area to pinpoint their locations!"},{"name":"SYSTEM","text":"You can only obtain one festival message at a time, so choose your sentinel wisely! Keep in mind which fallen stars are needed to purchase the seasonal goods you wish to acquire."},{"name":"VOLUNTEER65785","text":"Head out into the ward and visit one of the Starlight sentinels. But do not collect a message without first donning your scarlet tunic! The sight of an armor-clad, bloodstained adventurer fails to inspire the same level of innocent wonder, you understand."},{"name":"SYSTEM","text":"The position of Starlight sentinels will be displayed on your minimap. Search the residential area to pinpoint their locations!"},{"name":"SYSTEM","text":"You can only obtain one seasonal message at a time, so choose your sentinel wisely! Keep in mind which fallen stars are needed to purchase the seasonal goods you wish to acquire."},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65785","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"VOLUNTEER65785","text":"Quickly, now, let's see what you've brought."},{"name":"VOLUNTEER65785","text":"...Ah, yes, a very Ul'dahn sentiment. Would you believe some of these younglings attempt to negotiate for extra presents? So precious. Here, pray deliver this gift to the merchant-to-be waiting nearby."},{"name":"VOLUNTEER65785","text":"Pray hand over the present to the anxious child you'll find lingering across the way. Remember: the younglings expect to meet a little helper!"},{"name":"CHILDA65785","text":"Hello, little helper. Is this the part where you give me a present?"},{"name":"CHILDA65785","text":"Yes, I suppose this will do. Thank you─that will be all."},{"name":"CHILDB65785","text":"By Thal and by Nald! A little helper! That means it's gift time!"},{"name":"CHILDB65785","text":"Huzzah! This is my favorite festival of the year!"},{"name":"CHILDC65785","text":"I waited and waited and waited and now you're finally here! May I have my present now, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span> little helper?"},{"name":"CHILDC65785","text":"Yay! I'll never forget you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span> little helper!"},{"name":"CHILDA65785","text":"I'm told that if I wait here, a little helper will arrive to shower me with riches. How very exciting."},{"name":"CHILDB65785","text":"Come on, little helper, I'm here! Thrill me! Come on, thrill me! I'm here!"},{"name":"CHILDC65785","text":"I'm supposed to wait for a little helper, but my brother says it'll just be a normal grown-up in disguise. If I get a present either way, I don't know why that would matter..."},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65785","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"VOLUNTEER65785","text":"Gift giving all taken care of? Very good."},{"name":"VOLUNTEER65785","text":"I don't know what we'd do without kind-hearted souls such as you...and our mysterious celebration-funding benefactor."},{"name":"VOLUNTEER65785","text":"Even our celebrant, Amh Garanjy, has only met with this philanthropist's agents─never face-to-face."},{"name":"VOLUNTEER65785","text":"All I know is that with the costs involved in running this festival, it must be a personage of considerable wealth. A bored merchant-prince─or princess─perhaps? I suppose, in the end, the reasons are less important than the results..."},{"name":"VOLUNTEER65785","text":"But I detain you overlong with my idle musings. I shall be here handing out tasks the entire festival through, should you be struck by the desire to volunteer once more."},{"name":"VOLUNTEER65785","text":"Placed the present in eager little hands, have you? Very good. Feel free to return to me for another task should you be struck by the desire to volunteer once more."},{"name":"SYSTEM","text":"You have contributed to the Starlight Celebration in every residential district! Report to Amh Garanjy in the Lavender Beds."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"VOLUNTEER65785","text":"（★未使用／削除予定★）"},{"name":"VOLUNTEER65785","text":"（★未使用／削除予定★）"}],"reward":{"gil":200,"items":[{"id":9276},{"id":9277},{"id":9278},{"id":9279}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65876]}},"partials":[{"type":"npc","id":"1010746","obj":{"i":1010746,"n":"Saint's Little Helper","l":427,"q":2}},{"type":"item","id":"9276","obj":{"i":9276,"n":"Yellow Fallen Star","l":1,"c":21256,"t":85}},{"type":"item","id":"9277","obj":{"i":9277,"n":"Blue Fallen Star","l":1,"c":21255,"t":85}},{"type":"item","id":"9278","obj":{"i":9278,"n":"Red Fallen Star","l":1,"c":21253,"t":85}},{"type":"item","id":"9279","obj":{"i":9279,"n":"Green Fallen Star","l":1,"c":21254,"t":85}},{"type":"item","id":"9273","obj":{"i":9273,"n":"Starlight Tunic","l":1,"c":42403,"t":35,"p":59}},{"type":"quest","id":"65876","obj":{"i":65876,"n":"A Little Help (The Goblet)","g":204,"l":"The Lavender Beds","s":62}}]}