{"quest":{"name":"The Gift of Joy (The Lavender Beds)","location":"The Lavender Beds","id":65783,"patch":2.45,"sort":63,"interval":"daily","repeatable":1,"icon":100328,"eventIcon":71222,"issuer":1010744,"target":1010744,"genre":204,"usedItems":[9273],"journal":["The saint's little helper in the Lavender Beds seeks your assistance in running the Starlight Celebration festivities.<br>※This quest is available for a limited time only.","You have volunteered your services to assist with the Starlight Celebration festivities. Pull on your Starlight tunic, and collect a child's message from one of the Starlight sentinels found within the Lavender Beds.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have collected a letter to the Spinner. Return to Yainu-Par and deliver the message to the saint's little helper.","You have delivered the message to the grateful little helper. Take the gift from the festival volunteer, and hand it to the child waiting nearby.","You have performed your duty as a little helper, and brought gift-wrapped happiness to a child. Report to the saint's little helper in Yainu-Par.","The volunteer is pleased with your efforts, and looks forward to your continuing assistance during the remainder of the Starlight Celebration."],"objectives":["Equip the Starlight tunic and collect a letter to the Spinner from a Starlight sentinel.","Deliver the letter to the Spinner to the saint's little helper.","Equip the Starlight tunic and deliver the lucky star to the waiting youngling.","Report to the saint's little helper."],"dialogue":[{"name":"VOLUNTEER65783","text":"Filled with the spirit of giving, are we? Let's set you to your task, then."},{"name":"VOLUNTEER65783","text":"All you need to do is collect a single child's message from one of the Starlight sentinels within the Lavender Beds...all while wearing your Starlight tunic, of course."},{"name":"VOLUNTEER65783","text":"As you know, there is the tree we helpers set up here in Yainu-Par, but there are also decorated sentinels to be found in the gardens of your fellow adventurers' estates."},{"name":"VOLUNTEER65783","text":"You should also know that the type of fallen star you receive for your efforts will depend on the sentinel from which the message is retrieved."},{"name":"VOLUNTEER65783","text":"Did we talk about fallen stars? It's a simple system we devised to reward hardworking volunteers─a type of festive currency that can be exchanged for seasonal goods. Speak with the Starlight crier if you'd like to know more!"},{"name":"SYSTEM","text":"The position of Starlight sentinels will be displayed on your minimap. Search the residential area to pinpoint their locations!"},{"name":"SYSTEM","text":"You can only obtain one seasonal message at a time, so choose your sentinel wisely! Keep in mind which fallen stars are needed to purchase the seasonal goods you wish to acquire."},{"name":"VOLUNTEER65783","text":"Pray bring me a message from any of the Starlight sentinels found within the Lavender Beds. Oh, and don't forget to don your scarlet apparel!"},{"name":"SYSTEM","text":"The position of Starlight sentinels will be displayed on your minimap. Search the residential area to pinpoint their locations!"},{"name":"SYSTEM","text":"You can only obtain one seasonal message at a time, so choose your sentinel wisely! Keep in mind which fallen stars are needed to purchase the seasonal goods you wish to acquire."},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65783","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"VOLUNTEER65783","text":"Hello again! You've returned with one of the children's messages, I trust?"},{"name":"VOLUNTEER65783","text":"Excellent. Now comes the fun part! Take this gift, and deliver it to the waiting youngling. Remember: the wee ones expect someone dressed as a little helper!"},{"name":"VOLUNTEER65783","text":"You should find an expectant child waiting nearby. Don't forget to dress the part!"},{"name":"CHILDA65783","text":"A little helper! Yay! Do you have my present!? Can I have my present now!?"},{"name":"CHILDA65783","text":"I got a pre-sent!♪<br>A present from the go-ddess!♪<br>Thank you, little helper!"},{"name":"CHILDB65783","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss little helper</span><span class=\"alternative\">mister little helper</span></span>... I was told to wait here for my present..."},{"name":"CHILDB65783","text":"...Can I really have this? Thank you so much!"},{"name":"CHILDC65783","text":"Wow, are you <span class=\"emphasis\">really</span> a little helper? Well, I've been good this year, so is it okay if I get my gift now...?"},{"name":"CHILDC65783","text":"Thank you! I'll be sure not to play too rough..."},{"name":"CHILDA65783","text":"I'm waiting here for the little helper to bring my present! I wonder what's taking so long..."},{"name":"CHILDB65783","text":"Have you seen a little helper anywhere? Maybe they forgot about me..."},{"name":"CHILDC65783","text":"If I wait right here, a little helper is supposed to bring me a gift. That's what they said..."},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65783","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"VOLUNTEER65783","text":"You've returned to me empty-handed. Good! I do hope the youngling enjoys the gift!"},{"name":"VOLUNTEER65783","text":"Amh Garanjy does so dearly love to see the children smile. When I once marveled at her dedication, the celebrant explained that her fervor grew from her troubled past as an orphan."},{"name":"VOLUNTEER65783","text":"She would spare any child the misery and loneliness she experienced, even if it meant funding the entire Starlight Celebration by washing dirty dishes at the Carline Canopy for a year."},{"name":"VOLUNTEER65783","text":"And I must admit, her intensity is quite contagious! I assume you must feel it too, otherwise why else would you find yourself compelled to help us again and again?"},{"name":"VOLUNTEER65783","text":"I believe I heard the delighted laughter from here! Good show, little helper! I hope I can count on your assistance again in the future!"},{"name":"SYSTEM","text":"You have contributed to the Starlight Celebration in every residential district! Report to Amh Garanjy in the Lavender Beds."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"VOLUNTEER65783","text":"（★未使用／削除予定★）"},{"name":"VOLUNTEER65783","text":"（★未使用／削除予定★）"}],"reward":{"gil":200,"items":[{"id":9276},{"id":9277},{"id":9278},{"id":9279}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65861]},"next":[65890]},"partials":[{"type":"npc","id":"1010744","obj":{"i":1010744,"n":"Saint's Little Helper","l":426,"q":2}},{"type":"item","id":"9276","obj":{"i":9276,"n":"Yellow Fallen Star","l":1,"c":21256,"t":85}},{"type":"item","id":"9277","obj":{"i":9277,"n":"Blue Fallen Star","l":1,"c":21255,"t":85}},{"type":"item","id":"9278","obj":{"i":9278,"n":"Red Fallen Star","l":1,"c":21253,"t":85}},{"type":"item","id":"9279","obj":{"i":9279,"n":"Green Fallen Star","l":1,"c":21254,"t":85}},{"type":"item","id":"9273","obj":{"i":9273,"n":"Starlight Tunic","l":1,"c":42403,"t":35,"p":59}},{"type":"quest","id":"65861","obj":{"i":65861,"n":"A Little Help (The Lavender Beds)","g":204,"l":"The Lavender Beds","s":60}},{"type":"quest","id":"65890","obj":{"i":65890,"n":"Going the Extra Smile","g":204,"l":"The Lavender Beds","s":66}}]}