{"quest":{"name":"Way of the Gladiator","location":"Ul'dah","id":65789,"patch":3.1,"sort":11,"icon":100054,"unlocksFunction":1,"eventIcon":71341,"issuer":1002277,"target":1001739,"involved":[1003896],"genre":127,"journal":["Lulutsu wishes you to reaffirm your desire to join the Gladiators' Guild.","Lulutsu has bid you speak with First Sword Mylla, whose approval you must obtain if you wish to join the guild.","The guildmaster has instructed you to slay marmots, hornets, and shrews outside the gates of Ul'dah. Venture forth and do battle with the beasts.","You have slain the creatures as instructed and become more familiar with your weapon. Return to the Gladiators' Guild and speak with Mylla.","Mylla states that to master the sword, you must remember and reflect upon your experiences in battle. Taking her words to heart, you resolve to seek out and test yourself against new foes.<br><br>※The next gladiator quest will be available from Mylla upon reaching level 5."],"objectives":["Speak with First Sword Mylla.","Slay star marmots.","Slay huge hornets.","Slay snapping shrews.","Report to Mylla."],"dialogue":[{"name":"LULUTSU","text":"What will it be? Will you rise above the masses and inscribe your name in legend, or will you resign yourself to mediocrity and die in obscurity?"},{"name":"Q1","text":"Join the Gladiators' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"LULUTSU","text":"Oh, so it's to be death in obscurity... Well, should you come to your senses, you may speak with me at any time to proceed with the enrollment process."},{"name":"LULUTSU","text":"A decision you shan't regret. One moment─make way for <span class=\"highlight\">Forename Surname</span>! Fresh meat coming through!"},{"name":"LULUTSU","text":"Now then, before your enrollment can be considered complete, you must present yourself to First Sword Mylla. Seek her out and obtain her approval."},{"name":"MYLLA","text":"Aye, I heard Lulutsu. So you're <span class=\"highlight\">Forename Surname</span>. 'Tis a good, strong name."},{"name":"MYLLA","text":"On behalf of the Gladiators' Guild, allow me to welcome you. I am Mylla, guildmaster here."},{"name":"MYLLA","text":"So you wish to study our arts. I presume you have your reasons for choosing the sword over all other weapons. Perhaps you think it easiest to learn."},{"name":"MYLLA","text":"A sword is a simple weapon. But to wield a blade well is anything but simple."},{"name":"MYLLA","text":"For every Coliseum champion to emerge from our ranks, there have been countless disappointments who failed to achieve greatness."},{"name":"MYLLA","text":"Bear that in mind before you answer me, <span class=\"highlight\">Forename</span>, for I do not ask this question lightly: have you the strength to live by the sword and─if it be your fate─die by it?"},{"name":"Q2","text":"Have you the strength to live by the sword?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"MYLLA","text":"Then perhaps your path lies elsewhere. Should it lead you back to us someday, we can discuss your future once more."},{"name":"MYLLA","text":"Then welcome, gladiator, to your new home!"},{"name":"MYLLA","text":"Let's not waste time, shall we? I would gauge your aptitude for the sword."},{"name":"MYLLA","text":"Just outside the gates of Ul'dah, you'll find plenty of marmots, hornets, and shrews. Slay three of each and return here when finished."},{"name":"MYLLA","text":"A simple task, but essential to your training nonetheless. Now, go."},{"name":"MYLLA","text":"Welcome back, <span class=\"highlight\">Forename</span>. I take it you've dispatched the beasts, and with ease."},{"name":"MYLLA","text":"Rest assured there will be far greater challenges to come. If you wish to master the sword, you must test yourself against a wide variety of foes. To this end, I present to you this hunting log."},{"name":"MYLLA","text":"It contains information on creatures ideal for a gladiator-in-training. You will doubtless gain valuable experience should you seek out and slay them. It is only with such practice that you will recognize and eliminate the deficiencies in your technique."},{"name":"MYLLA","text":"Your training under me shall continue once the haft sits so snugly in your hand that you cannot imagine holding aught else. Until then, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"The next gladiator quest will be available from Mylla upon reaching level 5."}],"reward":{"job":1,"items":[{"num":5,"id":4639}],"xp":100},"reqs":{"jobs":[{"lvl":1,"id":2}]},"next":[65792,65797]},"partials":[{"type":"npc","id":"1002277","obj":{"i":1002277,"n":"Lulutsu","l":41,"q":6,"t":"Guild Receptionist"}},{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003896","obj":{"i":1003896,"n":"Wolkan","l":41,"q":3}},{"type":"item","id":"4639","obj":{"i":4639,"n":"Marmot Steak","l":5,"c":24355,"t":46,"p":9}},{"type":"quest","id":"65792","obj":{"i":65792,"n":"Kicking the Hornet's Nest","g":127,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"65797","obj":{"i":65797,"n":"Ul'dah's Most Wanted","g":127,"l":"Ul'dah","s":100,"f":1}}]}