{"quest":{"name":"The Gift of Joy (Mist)","location":"Mist","id":65784,"patch":2.45,"sort":64,"interval":"daily","repeatable":1,"icon":100329,"eventIcon":71222,"issuer":1010745,"target":1010745,"genre":204,"usedItems":[9273],"journal":["The saint's little helper in Mist seeks your assistance in running the Starlight Celebration festivities.<br>※This quest is available for a limited time only.","You have volunteered your services to assist with the Starlight Celebration festivities. Pull on your Starlight tunic, and collect a child's message from one of the Starlight sentinels found within Mist.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have collected a letter to the Spinner. Return to the Seagaze Markets and deliver the message to the saint's little helper.","You have delivered the message to the coarse but emotional little helper. Take the gift from the festival volunteer, and hand it to the child waiting nearby.","You have performed your duty as a little helper, and brought gift-wrapped happiness to a child. Report to the saint's little helper in the Seagaze Markets.","The volunteer is pleased with your efforts, and looks forward to your continuing assistance during the remainder of the Starlight Celebration."],"objectives":["Equip the Starlight tunic and collect a letter to the Spinner from a Starlight sentinel.","Deliver the letter to the Spinner to the saint's little helper.","Equip the Starlight tunic and deliver the lucky star to the waiting youngling.","Report to the saint's little helper."],"dialogue":[{"name":"VOLUNTEER65784","text":"Ready for a run through the ward, then, are ye? That's the bloody spirit, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"},{"name":"VOLUNTEER65784","text":"'Tis the same job as ye've done afore: find yerself a Starlight sentinel, an' collect one o' them adorable little imps' messages. And don't forget to wear yer bleedin' tunic, all right? Ye know, the bright bloody red one?"},{"name":"VOLUNTEER65784","text":"Oh, an' I s'pose I ought to mention 'ow there's more of them trees about the place aside from the ones what we 'elpers put up─aye, ye might want to check the sentinels what are decoratin' the gardens o' some o' these estates."},{"name":"VOLUNTEER65784","text":"Yer probably thinkin', “Why would I run me arse to the far side o' the ward when I can just grab a letter from the tree over there?” Well, that's 'cause the type o' fallen star ye'll get as a reward'll change dependin' on the sentinel ye took the message from!"},{"name":"VOLUNTEER65784","text":"An' dependin' on the seasonal loot yer lookin' to bag, ye might need yerself a different fallen star to exchange for it. Make sense? Well, the Starlight Celebration crier'll explain it nice an' clearly for ye if me charmin' Lominsan brogue is too 'arsh for yer delicate sensibilities."},{"name":"SYSTEM","text":"The position of Starlight sentinels will be displayed on your minimap. Search the residential area to pinpoint their locations!"},{"name":"SYSTEM","text":"You can only obtain one seasonal message at a time, so choose your sentinel wisely! Keep in mind which fallen stars are needed to purchase the seasonal goods you wish to acquire."},{"name":"VOLUNTEER65784","text":"Pick a Starlight sentinel somewhere in Mist, an' bring me back one o' them Starlight messages. An' don't forget to wear yer bleedin' tunic!"},{"name":"SYSTEM","text":"The position of Starlight sentinels will be displayed on your minimap. Search the residential area to pinpoint their locations!"},{"name":"SYSTEM","text":"You can only obtain one seasonal message at a time, so choose your sentinel wisely! Keep in mind which fallen stars are needed to purchase the seasonal goods you wish to acquire."},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65784","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"VOLUNTEER65784","text":"Back now, are ye? Where's me tear-jerkin' message, then?"},{"name":"VOLUNTEER65784","text":"Aye, that's...that's just lovely. Warms me brutish 'eart, it do. Right, time for some gift givin'! 'Ere, take this to the wee bugger waitin' over yonder."},{"name":"VOLUNTEER65784","text":"Go on wiv ye! Go an' 'and out that present afore me stoic facade starts to crumble!"},{"name":"CHILDA65784","text":"Hmm, so yer one o' them little 'elpers, are ye? I weren't sure ye'd actually come. ...Is it true ye'll give me a present for writin' that letter?"},{"name":"CHILDA65784","text":"Yer really givin' this to me!? Hooray! Me mates'll never believe this!"},{"name":"CHILDB65784","text":"Hey! Over here! Aye! Me! Give the toy to me!"},{"name":"CHILDB65784","text":"This festival is the best! Thank you!"},{"name":"CHILDC65784","text":"You think to deceive me, you crimson-clad charlatan!? I'll have you know I plan on becoming a famous arcanist! My magic eyes will see right through your tricky gift illusions!"},{"name":"CHILDC65784","text":"...This feels solid. Y-You might just be who you say you are. So...I can keep this? Yay! A present for me!"},{"name":"CHILDA65784","text":"The grown-ups told me that if I wait 'ere, then a little 'elper'll come an' give me a present. Sounds like a bunch o' bollocks...but I'll stay a mite longer, just in case."},{"name":"CHILDB65784","text":"Awww, you're just an adventurer. Can you move outta the way so the little helper can see me?"},{"name":"CHILDC65784","text":"I suspect that the little helper who was meant for me is an impostor. A <span class=\"emphasis\">real</span> helper wouldn't be taking so long. I mean, how many other children can there possibly be!?"},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65784","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"VOLUNTEER65784","text":"'Anded out yer gift an' brought a child festive joy an' all that, 'ave ye? Good work, good work. Yer a chip off the ol' saint's block!"},{"name":"VOLUNTEER65784","text":"Speakin' o' the ol' saint, Amh Garanjy said she met a white-bearded bloke what was wearin' Starlight garb when she was a but a wee lass 'erself."},{"name":"VOLUNTEER65784","text":"She was weepin' over a special ring she'd lost or summat o' the sort, an' this saint-like fella gave 'er a new one to replace it. Cheered 'er right up, she said."},{"name":"VOLUNTEER65784","text":"Sometimes kindness finds ye when ye least expect it. I'd thought this world a bloody cruel an' lonely place till I met decent folk like you an' Amh Garanjy..."},{"name":"VOLUNTEER65784","text":"...An' now I'm gettin' all bleedin' emotional again. Sod off, then─ye've done yer part for the now. Maybe I'll see ye back for more work afore the celebration's over an' done, eh?"},{"name":"VOLUNTEER65784","text":"Done wiv yer gift givin', are ye? Ah, I live to see them little buggers' faces light up. Yer doin' good work, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Come back again afore the celebration's over an' done, eh?"},{"name":"SYSTEM","text":"You have contributed to the Starlight Celebration in every residential district! Report to Amh Garanjy in the Lavender Beds."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"VOLUNTEER65784","text":"（★未使用／削除予定★）"},{"name":"VOLUNTEER65784","text":"（★未使用／削除予定★）"}],"reward":{"gil":200,"items":[{"id":9276},{"id":9277},{"id":9278},{"id":9279}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65874]},"next":[65890]},"partials":[{"type":"npc","id":"1010745","obj":{"i":1010745,"n":"Saint's Little Helper","l":425,"q":2}},{"type":"item","id":"9276","obj":{"i":9276,"n":"Yellow Fallen Star","l":1,"c":21256,"t":85}},{"type":"item","id":"9277","obj":{"i":9277,"n":"Blue Fallen Star","l":1,"c":21255,"t":85}},{"type":"item","id":"9278","obj":{"i":9278,"n":"Red Fallen Star","l":1,"c":21253,"t":85}},{"type":"item","id":"9279","obj":{"i":9279,"n":"Green Fallen Star","l":1,"c":21254,"t":85}},{"type":"item","id":"9273","obj":{"i":9273,"n":"Starlight Tunic","l":1,"c":42403,"t":35,"p":59}},{"type":"quest","id":"65874","obj":{"i":65874,"n":"A Little Help (Mist)","g":204,"l":"The Lavender Beds","s":61}},{"type":"quest","id":"65890","obj":{"i":65890,"n":"Going the Extra Smile","g":204,"l":"The Lavender Beds","s":66}}]}