{"quest":{"name":"The Hazy Professor","location":"Limsa Lominsa","id":65780,"patch":2.51,"sort":20,"icon":100362,"eventIcon":71221,"issuer":1009153,"target":1010377,"involved":[1006493,1006495,1010378],"genre":77,"journal":["The deputy postmoogle has letters from learned fellows.","The addressee this time is Professor Lamberteint, whose reputation as an aetherial researcher is soaring. Now, his three greatest pupils have some business with him, and have sent one missive apiece. Ensure that these find their way into Lamberteint's hands in Camp Drybone.","You deliver the letters, only to discover that Lamberteint has no memory of you. With barely a word of apology, he instead informs you of his symposium. Seeing how adept a letter carrier you are, he asks that you place a pot of lovely flowers on the tavern table─for the sake of his pupils, of course.","Lamberteint joins you in the tavern shortly after you arrive, whereupon he shows you his original collection of the <span class=\"emphasis\">On the Properties of Aspect Conversion</span> series, and then proceeds to settle in to wait for his students.<br><br>Much to the professor's disappointment, however, the pupils fail to arrive. Before dejectedly deciding to return to his chambers, he wonders aloud if something might have befallen them on their way. Scout the outskirts of Camp Drybone to see whether or not his fears are unfounded.","Though you gaze into the distance till your eyes hurt, you see nothing of Lamberteint's pupils. Go and inform him, and hope he will not be too crestfallen.","You bear the bad news to the professor. Though he tries to hide it, you can tell he is quite upset. To make matters worse, he realizes he has forgotten his books in the tavern. Stifling a sob, he bids you retrieve the volumes of <span class=\"emphasis\">On the Properties of Aspect Conversion</span> forthwith.","As you reach for the books, the professor's students appear. They are surprised to learn that Lamberteint is despondent, as the symposium is actually set to begin tomorrow. In spite of this blunder, the three pupils agree to cheer up their professor with a gift of corrupted crystals. To aid them, make your way to Highbridge and speak with Hahasako.","Hahasako provides you with a special-order sledgehammer and another warded pot to collect corrupted crystals. Now make your way to the Burning Wall, and there get to work fracturing the cluster.","You break shards of crystal from the formation. Place them within the warded pot.","You safely store the corrupted crystals within the warded pot. Deliver them to Ceana in Camp Drybone.","Ceana and Hedyn are happy you have returned with the crystals. Just as Hahasako offers to summon Lamberteint, the professor suddenly appears. Ceana explains the mishap, and offers him the pot of crystals. All members exchange heartfelt thanks, and, with a little push from Ceana, the professor remembers your role in his success. Lamberteint then names you an honorary member of the intellectual circle, and calls upon you all to continue studying the aether."],"objectives":["Deliver the letters to Lamberteint in Camp Drybone.","Place the lovely flowers on the tavern table.","Search for the students near Camp Drybone.","Speak with Lamberteint.","Retrieve the volumes of <span class=\"emphasis\">On the Properties of Aspect Conversion</span>.","Speak with Hahasako at Highbridge.","Use the special-order sledgehammer to fracture the corrupted crystal.","Use the warded pot to collect corrupted crystals.","Deliver the corrupted crystals to Ceana."],"dialogue":[{"name":"LETTERMOOGLE","text":"Knowledge, my dear assistant, is the gift that keeps on giving. I've got letters today for a fellow who embodies that notion: Professor Lamberteint, kupo!"},{"name":"LETTERMOOGLE","text":"He's an authority on aether, known for his passion and absent-mindedness. I'm sure you've heard of him─lately <span class=\"emphasis\">everyone</span> is talking about his theories."},{"name":"LETTERMOOGLE","text":"Now, such a renowned scholar has many students, and these letters come from his best and brightest."},{"name":"LETTERMOOGLE","text":"So your task, my friend, is to deliver the mail to Lamberteint in Camp Drybone. Make sure to get it there promptly, as a good post<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> should, kupo!"},{"name":"LETTERMOOGLE","text":"Have you delivered the letters to Lamberteint in Camp Drybone? No? Then make haste, and show the realm what a good post<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> you are, kupo!"},{"name":"LAMBERTEINT","text":"Hm? Why, yes, I am Professor Lamberteint. Eh? We've <span class=\"emphasis\">met</span>, you say? Are you certain about that? Er...perhaps telling me why you've come will refresh my memory."},{"name":"LAMBERTEINT","text":"Ah, I have been expecting these. I still can't quite remember you, but you have my thanks all the same."},{"name":"LAMBERTEINT","text":"So all three will attend the symposium... Excellent. I expected their replies sooner, but better late than never!<br>...Ah, pray excuse me. I've gotten ahead of myself."},{"name":"LAMBERTEINT","text":"The symposium I speak of is a biannual event that I organize for my students. We gather under one roof to share our research and critique others'─constructively, of course!"},{"name":"LAMBERTEINT","text":"Perchance you are familiar with “aspect conversion”? 'Tis a theory I but recently published─with the aid of an adventurer much like you, come to think of it. Anyway, the focus of this symposium shall be <span class=\"emphasis\">post</span>-aspect conversion."},{"name":"LAMBERTEINT","text":"Speaking of which, the hour is nearly upon us─though it seems my pupils have yet to arrive... Oh well, there are papers I can attend to while I wait."},{"name":"LAMBERTEINT","text":"Since you have proven yourself an able courier, would you mind taking these flowers to the tavern for me? 'Tis the venue for the symposium, and I fear it wants for decoration."},{"name":"LAMBERTEINT","text":"Hm? Yes, you can put those flowers on the table in the tavern. Discourse flows where liquor runs free, and I suspect blossoms will stimulate discussion even more."},{"name":"LAMBERTEINT","text":"You are still here? I must have finished more quickly than I realized. Though to do things swiftly and well is only natural for a mind like mine."},{"name":"LAMBERTEINT","text":"...Where are my students? 'Tis strange for them to be so late. And what of my big surprise?"},{"name":"LAMBERTEINT","text":"Ahem... I present the <span class=\"emphasis\">original</span> four volumes of my latest work: <span class=\"emphasis\">On the Properties of Aspect Conversion</span>! I intend to bequeath them to my students, as thanks for their assistance─once they arrive, anyway..."},{"name":"LAMBERTEINT","text":"...They are awfully tardy. Perhaps...perhaps I shall retire to my chambers for the time being."},{"name":"LAMBERTEINT","text":"Well, I suppose you are free to go. But if you venture outside Camp Drybone, would you keep your eyes open for my pupils? I'm sure they are fine, but I worry all the same."},{"name":"LAMBERTEINT","text":"I do hope they have not run afoul of anything on the road..."},{"name":"SYSTEM","text":"You see neither hide nor hair of the students."},{"name":"LAMBERTEINT","text":"Have you seen any sign of my students outside the camp?"},{"name":"LAMBERTEINT","text":"Nothing at all? I...I... Ah! My students must be busy with their research! So busy that they forgot...uh...that they forgot to tell me."},{"name":"LAMBERTEINT","text":"The symposium is hereby canceled! My pupils will have to wait for their─"},{"name":"LAMBERTEINT","text":"Egads! The books! I left them in the tavern!"},{"name":"LAMBERTEINT","text":"This is all so... Ahem. Could you retrieve them for me? I...I require a moment... &lt;sniffle&gt;"},{"name":"LAMBERTEINT","text":"&lt;sniffle&gt; O-Oh, er...the books should still be on the table. I would go myself, but it seems a grain of sand is lodged in my eye... &lt;sniffle&gt;"},{"name":"HAHASAKO","text":"Do mine eyes mislead me? 'Tis the adventurer who came in search of corrupted crystals!"},{"name":"HEDYN","text":"Of the countless taverns throughout the realm, that we would cross paths here! Tell me, <span class=\"highlight\">Forename</span>─what brings you to this place?"},{"name":"CEANA","text":"The symposium's been canceled on account of our absence? Whatever for!? It's to be held <span class=\"emphasis\">tomorrow</span>, not today!"},{"name":"HEDYN","text":"Evidently the professor mixed up the date─hence why he fears we have forgotten all about it."},{"name":"HAHASAKO","text":"&lt;sigh&gt; The professor can be ever-so-slightly scatterbrained─though a genius when it comes to aetherial studies."},{"name":"CEANA","text":"Hahaha! As if worse hasn't been said of us, Hahasako! People would still think us lunatics had we not come to study under the professor."},{"name":"HEDYN","text":"Indeed. Whatever his failings, none of us would be where we are without him."},{"name":"CEANA","text":"（★未使用／削除予定★）"},{"name":"HAHASAKO","text":"I say we surprise him with a gift of our own─something to show our thanks for all he has done, and to commemorate his latest publication!"},{"name":"CEANA","text":"Hear, hear! And I think we all know what would make the perfect gift..."},{"name":"HEDYN","text":"(-Lamberteint's Pupils-)Corrupted crystals!"},{"name":"HAHASAKO","text":"（★未使用／削除予定★）"},{"name":"CEANA","text":"Hah, a fine idea─if I do say so myself. Can we count on your help as well, <span class=\"highlight\">Forename</span>?"},{"name":"HAHASAKO","text":"I must return to Highbridge and prepare a containment vessel for the crystals. You may come and collect it anon."},{"name":"HEDYN","text":"Corrupted crystals are central to the professor's research. I daresay he will jump for joy when he gets them."},{"name":"CEANA","text":"As Professor Lamberteint's greatest students, we must lift his spirits─I most of all, as the greatest of us three!"},{"name":"LAMBERTEINT","text":"Have you found my books? Or did <span class=\"emphasis\">you</span> forget about me, as well?"},{"name":"HAHASAKO","text":"'Tis high time you arrived! I completed my preparations a long while ago."},{"name":"HAHASAKO","text":"We seek crystals marred by nary a single mark. Make your way to the center of the Burning Wall, where stands the finest of formations."},{"name":"HAHASAKO","text":"Here is a sledgehammer you can use to fracture a cluster once there."},{"name":"HAHASAKO","text":"And here, a warded pot. Collect within it the shards of crystal, and deliver the lot to Ceana. Simple, is it not?"},{"name":"HAHASAKO","text":"I trust you are aware that the nearest path to the Burning Wall begins at Burgundy Falls? Then I bid you merry mining!"},{"name":"HAHASAKO","text":"Are you as absent-minded as the professor? &lt;sigh&gt; Go and gather corrupted crystals from the center of the Burning Wall."},{"name":"HAHASAKO","text":"Use the sledgehammer I have quite kindly provided to fracture a cluster, and place the crystals within this warded pot. Then take the lot to Ceana."},{"name":"HAHASAKO","text":"Was anything unclear, or must I repeat myself again?"},{"name":"SYSTEM","text":"You fracture the corrupted cluster. Place the crystals within the warded pot."},{"name":"HAHASAKO","text":"You've finished? Then do not delay in reporting to Ceana!"},{"name":"HEDYN","text":"I anticipated your success, my friend, but you were much quicker than I had estimated."},{"name":"CEANA","text":"Welcome back! Did the mirrorknights give you any trouble?"},{"name":"CEANA","text":"Aha! An exquisite potful of corrupted crystals, if ever I saw one!"},{"name":"HAHASAKO","text":"Well, now that everything seems in order, I shall summon the professor for his surprise!"},{"name":"LAMBERTEINT","text":"Ahem! What “surprise,” pray tell? If it was for the symposium, I'm afraid you're too late."},{"name":"HAHASAKO","text":"(-Lamberteint's Pupils-)Professor Lamberteint!"},{"name":"LAMBERTEINT","text":"And you, post<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>─did you <span class=\"emphasis\">ever</span> intend to return with what I asked!? Why, I ought to─"},{"name":"CEANA","text":"Hold on a moment, Professor! You forgot that the symposium starts <span class=\"emphasis\">tomorrow</span>!"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"},{"name":"HEDYN","text":"We know you can be a bit absent-minded. But above all else, we beg you remember:"},{"name":"HAHASAKO","text":"(-Lamberteint's Pupils-)No student ever skips a symposium!"},{"name":"CEANA","text":"Voilà! Corrupted crystals to celebrate your latest publication, and to express our gratitude for your constant support."},{"name":"LAMBERTEINT","text":"Ahaha! So <span class=\"emphasis\">that's</span> what you three have been doing! I hardly know whether to laugh or to cry."},{"name":"LAMBERTEINT","text":"It just so happens I have prepared something for each of you, as well."},{"name":"LAMBERTEINT","text":"<span class=\"emphasis\">On the Properties of Aspect Conversion</span> would not exist were it not for you all, and so I thought to divide the volumes between the four of us─that the set would be complete whenever we meet."},{"name":"LAMBERTEINT","text":"Your questions, your contributions, your very presence drives me onwards─as quickly as a corrupted crystal can change aspects!"},{"name":"HEDYN","text":"It matters not where our research takes us, so long as we are of one mind and one purpose."},{"name":"LAMBERTEINT","text":"Why...why don't we meet four times a year instead of two? It would be a pleasure to hear your papers more often─and to present mine own, of course!"},{"name":"HEDYN","text":"（★未使用／削除予定★）"},{"name":"LAMBERTEINT","text":"I must say, I am quite eager to begin experimenting with these crystals. You didn't go to too much trouble obtaining them, did you?"},{"name":"CEANA","text":"Not at all, haha. <span class=\"highlight\">Forename</span> saw to the dangerous tasks. For the second time, come to think of it─didn't <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> efforts serve as inspiration for your research before?"},{"name":"LAMBERTEINT","text":"<span class=\"highlight\">Forename</span>!? Ah! I <span class=\"emphasis\">knew</span> I had seen you before."},{"name":"LAMBERTEINT","text":"Well, no longer shall your contributions go unrecognized! I, Professor Lamberteint, hereby name thee an honorary pupil!"},{"name":"LAMBERTEINT","text":"Now, my friends, to work! The unsolved mysteries of aether are waiting to be unraveled!"},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"BOOKMAN00244","text":"（★未使用／削除予定★）"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"},{"name":"LAMBERTEINT","text":"（★未使用／削除予定★）"}],"reward":{"gil":1359,"items":[{"num":25,"id":2},{"num":10,"id":8}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1010377","obj":{"i":1010377,"n":"Ceana","l":44,"q":1}},{"type":"npc","id":"1006493","obj":{"i":1006493,"n":"Lamberteint","l":44,"q":6}},{"type":"npc","id":"1006495","obj":{"i":1006495,"n":"Hahasako","l":44,"q":3}},{"type":"npc","id":"1010378","obj":{"i":1010378,"n":"Hedyn","l":44,"q":1}}]}