{"quest":{"name":"Lions for Lambs","location":"Limsa Lominsa","id":65788,"patch":2.45,"sort":67,"icon":100333,"eventIcon":71221,"issuer":1010714,"target":1010725,"involved":[1001204],"genre":194,"journal":["The heavens have turned once more, bringing a fresh flock of Easterlings to Lominsan shores.<br>※This quest is available for a limited time only.","The lights are lit in Limsa Lominsa in celebration of the turning of the year, and the changing of the heavenly guard. A delegation from the Far East has set to shore in Eorzea to lead the festivities. But while the townspeople choose their new year's resolutions, the leader of the Easterlings seems singularly lacking in resolve. Speak with the hitsuji bugyo, lest the dark clouds that gather on his brows usher in a year of sorrows.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The bugyo unburdens himself: he dreams of expanding his pet project─an army of spell-slinging sheep known as the Fleece Force─into Eorzea, but his calls have fallen on deaf ears. Convinced that an Eorzean adventurer would have better luck, he recruits you to the Force's propaganda arm. But an immediate problem stalls your progress─the prototype tender lamb refuses to acknowledge your existence. Perhaps a taste of the special fodder the bugyo has ordered through Engerrand, a trader in Hawkers' Alley, might help to win her over.","Engerrand hands over the nutritious fodder. Return to the Aftcastle, and entice the tender lamb with the platter of toothsome twigs.","The lamb is delighted with the shoots and leaves, and acknowledges you as its master. Satisfied, the hitsuji bugyo presents you with a ceremonial helm to consecrate your alliance with the Fleece Force. By wearing this kabuto, his underlings across the land will recognize you as a fellow sheepwielder. And so it falls to you to travel to the three city–states, and spread the fame of the Fleece Force to every corner of the realm."],"objectives":["Speak with the hitsuji bugyo.","Speak with Engerrand in East Hawkers' Alley.","Feed the Force's finest fodder to the tender lamb in the Aftcastle."],"dialogue":[{"name":"SYOJO","text":"What a resplendent spectacle─'tis as if the stars themselves have descended from the heavens to toast the occasion! ...Erm, I mean─pretty, ain't they, these 'Eavensturn decorations? Nothin' like a lantern show to usher in the new year!"},{"name":"SYOJO","text":"And it ain't just a new year we're usherin' in, neither─it's all change up in the 'eavens and all. Every 'Eavensturn, the Twelve pick out which one of 'em'll be takin' the reins for the comin' year."},{"name":"SYOJO","text":"Your astrologians have divined─ I mean...I've 'eard mutterin's it's to be Menphina this year─the goddess o' love. An 'ole year o' peace, love, and understandin' 'twixt kinsmen and sweethearts alike... Ain't it a grand time to be alive!?"},{"name":"SYOJO","text":"But it seems there's some who ain't quite feelin' the love. Every new year there's a gaggle of Easterners─“Easterlings” as we call 'em─what come over to Eorzea to mark the occasion, but it looks like their leader ain't in the 'oliday mood. Proper rainin' on the parade, 'e is."},{"name":"SYOJO","text":"'Ark at 'im there, in the middle of the square─mutterin' to 'imself somethin' rotten. Tried talkin' to 'im meself, but 'e waved me away─“no job for a fishwife,” 'e said, the woolly-'eaded prig. Say...yer an adventurer, right? Maybe <span class=\"emphasis\">you'd</span> have better luck gettin' through to 'im."},{"name":"SYOJO","text":"'Ow that 'itsuji bugyo plans on usherin' in a year o' love with a miserable kipper like that on 'im, I don't know. Someone needs to cheer the surly bugger up before 'e drags the 'ole year down with 'im!"},{"name":"SYSTEM","text":"The tender lamb ignores you completely."},{"name":"SHEEPMISSIONARY","text":"If only they could see...or be <span class=\"emphasis\">made</span> to see─ Hmmm? Do you have some business with me, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>? I have important matters to consider. Prithee, leave me to my thoughts."},{"name":"SHEEPMISSIONARY","text":"Oho? Hold a moment, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>─you are an adventurer, are you not? Pray forgive me my discourtesy. For a moment, I thought you another prying <span class=\"alternative-container\"><span class=\"alternative\">fishwife</span><span class=\"alternative\">tomfool</span></span> come to instruct me to “turn my frown upside down.”"},{"name":"SHEEPMISSIONARY","text":"Allow me to introduce myself: I am the hitsuji bugyo. Many malms have I traveled across the seas from my Far Eastern homeland for one purpose: to celebrate the changing of the heavenly guard, and to strengthen ties between this realm and our own. ...Ahem. Two purposes, then."},{"name":"SHEEPMISSIONARY","text":"Mark you the wondrous creature that crowns my helm? It is the sheep─totem beast of my birth year, and of the year to come. Whilst my official role is to herald the arrival of the sheep to its rightful place in the heavens, a greater mission fills my heart: to expand the Fleece Force from the East to Eorzea!"},{"name":"SHEEPMISSIONARY","text":"For too long have we sheep been derided as weak-willed softies, lacking in leadership. But no more! For many years now, I have been leading research into breeding sheep for the battlefield, culminating in the masterpiece you see before you: my prototype of fell fluffiness─the tender lamb!"},{"name":"SHEEPMISSIONARY","text":"Just imagine─armies of warsheep like these may one day patrol your borders, strengthening not only the realm's defenses, but also the bonds of brotherhood between your people and mine! Alas, it has proven a struggle to win local support for my vision..."},{"name":"SHEEPMISSIONARY","text":"Full many gather to admire my fleecy helm, but my words of war and warning fall upon deaf ears. “So cute!” they say, as I speak of my companion's mighty enchantments. “So fluffy!” they cry, as I boast of its potential for quelling riotous peasantry."},{"name":"SHEEPMISSIONARY","text":"People are wont to be suspicious of the unfamiliar, and perhaps my foreignness renders them disinclined to consider the lamb's potential. But if an upstanding local such as yourself were to lend us your aid...! I beg you, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>─join us, and help us spread word of the Fleece Force across the land!"},{"name":"SHEEPMISSIONARY","text":"Will you join the Fleece Force?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"SHEEPMISSIONARY","text":"Y-You will!? Oh, how my heartstrings sing! You have made an old bugyo very happy, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. But we have no time to waste on sentiment─allow me to introduce you to the lynchpin of the Fleece Force project: the tender lamb."},{"name":"SHEEPMISSIONARY","text":"You would see Eorzea shorn of her defenses and naked before her enemies? Will you not reconsider? The fate of the realm may well rest upon irresistibly fluffy fleece!"},{"name":"SHEEPMISSIONARY","text":"Our sheepmasters have developed several varieties of ovine armament─some imbued with envenomous magicks, others that can muffle the tongue. But this is our most advanced weapon yet: a sheep with the ability to put its prey to sleep."},{"name":"SHEEPMISSIONARY","text":"Do not be fooled by its button nose and fluffy coat, for by this dainty display does it ensnare its foes! Thereby lulled into a false sense of security, the lamb unleashes its hypnoturgical blast, felling enemies where they stand."},{"name":"SHEEPMISSIONARY","text":"In my opinion, it is this soporific branch of the Fleece Force that has the widest potential for civilian and military applications alike. However, there remains one small problem with the hypnoturgical blast─it doesn't work."},{"name":"SHEEPMISSIONARY","text":"Not in the manner intended, at any rate. My plan for the Fleece Force has it that the sheep's abilities should be triggered by the aggressive energies of their commanding officer, or <span class=\"emphasis\">sheepwielder</span>, upon encountering an enemy force."},{"name":"SHEEPMISSIONARY","text":"But in practice, the opposite applies: the hypnoturgical blast will not fire in response to a sheepwielder's aggression, but only to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> <span class=\"emphasis\">exuberance</span>. To wit, whenever its master attempts to <span class=\"highlight\">cheer</span> an ally along, the sheep will respond by putting said ally to sleep."},{"name":"SHEEPMISSIONARY","text":"If this problem is not rooted out, the entire project could be doomed to failure. And so, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>, as you travel abroad, spreading word of the Fleece Force, I would also ask that you investigate why this lamb refuses to answer to aggression."},{"name":"SHEEPMISSIONARY","text":"But enough talk─go, sheepwielder! Journey to the many corners of this realm, proclaiming the arrival of the Fleece─<br>...She's been completely ignoring you all this time, hasn't she?"},{"name":"SHEEPMISSIONARY","text":"Hmmm... If she refuses to recognize you as her master, you will not be able to call upon her hypnoturgical blast. A fine advertisement for the Fleece Force that would be..."},{"name":"SHEEPMISSIONARY","text":"We must do something to strengthen your bonds... Aha─I have it! There is a man in Hawkers' Alley─a trader by the name of Engerrand. I recently ordered some special fodder for our friend here through him: a special blend of herbs and grasses to nurture her magical abilities."},{"name":"SHEEPMISSIONARY","text":"They say the best way to a sheep's heart is through its belly. If you were to present her with such a tasty treat, perchance she would warm to you a little."},{"name":"SHEEPMISSIONARY","text":"Engerrand runs a tradecraft supply stall in Hawkers' Alley─it was through him that I ordered the feed. It should be ready for collection by now. Do not dally, sheepwielder─deprive her of treats for too long, and you risk arousing more wrath than respect."},{"name":"ENGERRAND","text":"Yer the one who ordered this bowl o' twigs, are ye? Whatever floats yer boat, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─I'll be stickin' to the ol' meat and two veg, thank you very much!"},{"name":"SHEEPMISSIONARY","text":"Did you collect the fodder from Engerrand? Excellent. Prithee feed the lamb from your own hands. In so doing, she will come to look upon you as a <span class=\"alternative-container\"><span class=\"alternative\">matriarch</span><span class=\"alternative\">father figure</span></span>."},{"name":"SYSTEM","text":"The tender lamb ignores you completely."},{"name":"SHEEPMISSIONARY","text":"Oho! The plan worked! A free meal was enough to earn the lamb's loyalty. To be sure, this trusting nature is a weakness...but for now, all is ready! Your bond with the lamb is secure, and she should now respond to your <span class=\"highlight\">cheers</span>."},{"name":"SHEEPMISSIONARY","text":"A sheepwielder's path is long and stony, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>, but I am convinced that your footing is sure. And so, it will be my honor to place the tender lamb under your wing. With the two of you working hand in hoof, the Fleece Force cannot help but flourish!"},{"name":"SYOJO","text":"You always did have a liberal tongue, bugyo─that adventurer merely had to unbutton your lip, and the words spilled out like water. Warsheep indeed..."},{"name":"SYOJO","text":"So you yet contrive to put that senseless project of yours into action? On my honor, you shall answer for this folly!"},{"name":"SHEEPMISSIONARY","text":"I have already dispatched my subordinates to the three city–states of Eorzea, where they strive tirelessly to spread the word, and the reputation, of the Fleece Force. If you would be so kind, I would have you assist them in their efforts."},{"name":"SHEEPMISSIONARY","text":"To solemnify your admittance to our fellowship, it will be my honor to present you with a kabuto just like my own, crowned with the living image of the noble sheep. Wear this, and my comrades will know you for a friend."},{"name":"SHEEPMISSIONARY","text":"Should some disaster befall you, and the helm is lost or destroyed, never fear! The hitsuji shonin have laid many more in stock for those who assist us. I shall inform them that you are a friend of the flock. And so, the time for talking is done...let us put this plan into action!"}],"reward":{"gil":239,"items":[{"id":9268}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[65823,65825,65826,65845]},"partials":[{"type":"npc","id":"1010714","obj":{"i":1010714,"n":"Merry Maid","l":28,"q":1}},{"type":"npc","id":"1010725","obj":{"i":1010725,"n":"Tender Lamb","l":28,"q":1}},{"type":"npc","id":"1001204","obj":{"i":1001204,"n":"Engerrand","l":29,"s":1,"q":1,"t":"Tradecraft Supplier","a":744,"c":[8.66,11.82]}},{"type":"item","id":"9268","obj":{"i":9268,"n":"Hitsuji Kabuto","l":1,"c":40177,"t":34,"p":71}},{"type":"quest","id":"65823","obj":{"i":65823,"n":"All's Wool That Ends Wool","g":194,"l":"Limsa Lominsa","s":71}},{"type":"quest","id":"65825","obj":{"i":65825,"n":"Sleepless in the Stable","g":194,"l":"Limsa Lominsa","s":68}},{"type":"quest","id":"65826","obj":{"i":65826,"n":"Sleepless in the Swaddle","g":194,"l":"Limsa Lominsa","s":69}},{"type":"quest","id":"65845","obj":{"i":65845,"n":"Sleepless in the Saloon","g":194,"l":"Limsa Lominsa","s":70}}]}