{"quest":{"name":"A Starlight Miracle","location":"Gridania","id":65786,"patch":2.45,"sort":58,"icon":100331,"eventIcon":71221,"issuer":1010739,"target":1010740,"genre":204,"journal":["Xavalien, a correspondent for <span class=\"emphasis\">The Raven</span>, seeks an adventurer to help ensure the smooth running of this year's Starlight Celebration.<br>※This quest is available for a limited time only.","Xavalien, a reporter for <span class=\"emphasis\">The Raven</span>, has published an article on the ambitious festivities planned for this year's Starlight Celebration. It appears, however, that the celebrant in charge of the event has encountered some unexpected difficulties. Seek out Amh Garanjy in Yainu-Par in the Lavender Beds and offer your assistance.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Amh Garanjy, the Starlight celebrant, explains the dilemma that now threatens to steal the smiles from the expectant faces of the children. Promise your aid to the troubled organizer, and do what you can to help save the celebration."],"objectives":["Speak with Amh Garanjy in the Lavender Beds."],"dialogue":[{"name":"XAVALIEN","text":"Ah! An adventurer! Marvelous! The name's Xavalien, and I scratch the parchment for a little publication called <span class=\"emphasis\">The Raven</span>. Might I enlist your aid in a matter concerning the Starlight Celebration?"},{"name":"XAVALIEN","text":"...You <span class=\"emphasis\">are</span> familiar with the festival and its origins, yes? Ishgardian knights rescuing poor orphans from the frozen fingers of winter?"},{"name":"XAVALIEN","text":"The principal hero of the tale─a snowy-bearded captain─is often referred to as the “Saint of Nymeia,” for it was by his unorthodox order that the wayward waifs were given food and shelter. The compassionate acts of this saint and his soldiers are now honored by an annual tradition, wherein gifts are given to younglings during the coldest days of the year."},{"name":"XAVALIEN","text":"Which brings us to this year's celebration. As is the custom, the Starlight celebrant and her colleagues have donned scarlet apparel reminiscent of the jackets worn by those charitable knights─the saint's “little helpers,” so to speak. Thus attired, they plan to distribute gifts to every child who writes a letter to Nymeia, patron goddess of celestial wonders."},{"name":"XAVALIEN","text":"“A fine seasonal piece this shall make!” thought I, and proceeded to publish an article that brought news of this wonderful event to folk across the realm..."},{"name":"XAVALIEN","text":"...Since then, however, it appears the celebrant has encountered some unexpected difficulties. Would you be so kind as to offer your assistance to Amh Garanjy in the Lavender Beds so that the festivities might proceed as planned?"},{"name":"SYSTEM","text":"Board a ferry bound for the Lavender Beds by speaking with the skipper at the Mirror Planks in the Central Shroud."},{"name":"SYSTEM","text":"To proceed with the quest “A Starlight Miracle,” you may visit any residential ward within the Lavender Beds."},{"name":"XAVALIEN","text":"Seek out Amh Garanjy within the Lavender Beds, and she will surely welcome your proffered assistance with open arms!"},{"name":"AMHGARANJY","text":"Yes? Yes, I am Amh Garanjy, the Starlight celebrant. ...Ah, Master Xavalien sent you to me, did he?"},{"name":"AMHGARANJY","text":"Then pray allow me to explain our dilemma. As you have no doubt heard, our plan for this year's event is to pass out presents to every sweet-cheeked child who composes a letter to Nymeia, be they from a northern land or a southern sea, an east-end city or a west-end town."},{"name":"AMHGARANJY","text":"An ambitious endeavor, to be certain! Once <span class=\"emphasis\">The Raven</span> printed word of our activities in its publication, however, we were contacted by an anonymous supporter─a generous benefactor who offered to fund the entire celebration, gifts and all."},{"name":"AMHGARANJY","text":"Originally, our idea was to have the little ones place their messages at the foot of the Starlight sentinel we erected in each city."},{"name":"AMHGARANJY","text":"Our scarlet-clad helpers would then retrieve the letters, and hand presents to the waiting younglings. Simple."},{"name":"AMHGARANJY","text":"...Unfortunately, the wee darlings didn't know which of the seasonal trees in each city was <span class=\"emphasis\">our</span> tree, and now even the decorated boughs found within adventurers' estates have become receptacles for misplaced mail."},{"name":"AMHGARANJY","text":"As you might imagine, this has transformed a fairly straightforward task into a ward-wide marathon..."},{"name":"AMHGARANJY","text":"And as eager as we are to plaster a joyous smile on every child's face, we simply cannot hope to cover so much ground with so few helpers. We are in need of a Starlight miracle..."},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"JOURNALIST65786","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":286,"items":[{"id":9273}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[65787]},"partials":[{"type":"npc","id":"1010739","obj":{"i":1010739,"n":"Xavalien","l":53,"q":1}},{"type":"npc","id":"1010740","obj":{"i":1010740,"n":"Amh Garanjy","l":426,"q":6}},{"type":"item","id":"9273","obj":{"i":9273,"n":"Starlight Tunic","l":1,"c":42403,"t":35,"p":59}},{"type":"quest","id":"65787","obj":{"i":65787,"n":"Starlight Savings","g":204,"l":"The Lavender Beds","s":59}}]}