{"quest":{"name":"Starlight Savings","location":"The Lavender Beds","id":65787,"patch":2.45,"sort":59,"icon":100332,"eventIcon":71221,"issuer":1010740,"target":1010740,"genre":204,"usedItems":[9273],"journal":["Amh Garanjy is not-so-subtly hinting that your help is needed to save this year's Starlight Celebration.<br>※This quest is available for a limited time only.","You have pledged to aid Amh Garanjy and her helpers gather the messages that children have mistakenly placed at trees throughout the expansive Lavender Beds. Equip your Starlight tunic, and collect the letter recently left at the base of the Starlight sentinel in Yainu-Par.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You collect your first letter to the Spinner, much to the delight of the little girl on the lookout for one of the saint's little helpers. Return to Amh Garanjy with the young lady's message.","After showing the message to Amh Garanjy, the Starlight celebrant next charges you with the delivery of the child's seasonal gift. Take the celestial present to the good little girl waiting nearby.","The young lady is overjoyed to receive her gift from a little helper, but is also surprised to find another child's letter wrapped up with her present. Return to Amh Garanjy and show her the misplaced message.","Amh Garanjy reads the new letter you have brought her, only to learn that the youngling author wants nothing more than the return of his departed father. The Starlight celebrant vows to discover what may be done to ease the poor lad's suffering. Meanwhile, she urges you to continue your work as a little helper, both in the Lavender Beds and in the residential districts abroad."],"objectives":["Equip the Starlight tunic and collect the letter to the Spinner from the Starlight sentinel.","Deliver the letter to the Spinner to Amh Garanjy.","Equip the Starlight tunic and deliver the lucky star to the good little girl.","Deliver the misplaced letter to Amh Garanjy."],"dialogue":[{"name":"AMHGARANJY","text":"You'll be the miracle we need? Oh, thank you, dear adventurer!"},{"name":"AMHGARANJY","text":"With your assistance in gathering the messages scattered across the Lavender Beds, we can be sure that all those adorable letter writers will receive the gifts they were promised."},{"name":"AMHGARANJY","text":"Rather than send you tramping directly into the gardens of your adventuring fellows, however, I suggest we start you off somewhere close."},{"name":"AMHGARANJY","text":"The Starlight sentinel we placed here in Yainu-Par recently had a small visitor. Would you be so kind as to check the base of its trunk for messages to Nymeia?"},{"name":"AMHGARANJY","text":"Oh, and do be so good as to dress yourself in “little helper” attire while you go about Starlight business. Maintaining the fantasy is of utmost importance. 'Tis all for the children, you understand."},{"name":"AMHGARANJY","text":"Your first task will be to retrieve a letter from the Starlight sentinel here in Yainu-Par. Oh, and pray be sure to don your little helper apparel while you work!"},{"name":"CHILDA65787","text":"Wow, are you really one of the saint's little helpers!? You've come to collect my letter, haven't you!? I waited and waited, but I wasn't sure if anyone would come!"},{"name":"CHILDA65787","text":"That one there is mine! No other children came to this tree, so I got it all to myself! ...You'll make sure my message is delivered to the goddess, won't you?"},{"name":"CHILDA65787","text":"Well, I guess I should let you go now. Bye-bye, little helper!"},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65787","text":"You've lost your Starlight tunic? Never fear! We've enough spares to dress a small army! Here, take another one!"},{"name":"POPMESSAGE","text":"You obtain a Starlight tunic."},{"name":"AMHGARANJY","text":"Welcome back...er, <span class=\"highlight\">Forename</span>, is it? Do you have the letter?"},{"name":"AMHGARANJY","text":"Ah, isn't that precious? This young lady has written “Thank you!” in big pink letters, and drawn charming little pictures of flowers and stars. Here, you must be sure she receives her present."},{"name":"AMHGARANJY","text":"You should find her nearby, eagerly glancing about for the appearance of a little helper. Let's not keep the little darling waiting, shall we?"},{"name":"AMHGARANJY","text":"The wee one who wrote that letter should be waiting nearby. Deliver her gift while wearing your Starlight tunic and see her face light up with happiness!"},{"name":"CHILDB65787","text":"Oh, there you are! Was my letter good enough for a present!?"},{"name":"CHILDB65787","text":"Hooray! Thank you, little helper!"},{"name":"CHILDB65787","text":"...Huh? What's this? I found someone else's letter..."},{"name":"CHILDB65787","text":"Silly helper! You must have wrapped it with my gift by mistake! Here, you better make sure it gets delivered to the goddess!"},{"name":"CHILDB65787","text":"Come on, little helper, where are you? ...Maybe my letter wasn't pretty enough!"},{"name":"SYSTEM","text":"You must have the Starlight tunic equipped to continue with this quest."},{"name":"SYSTEM","text":"If you have misplaced your Starlight tunic, speak with a Starlight Celebration crier to receive a replacement."},{"name":"GUIDE65787","text":"（★未使用／削除予定★）"},{"name":"POPMESSAGE","text":"（★未使用／削除予定★）"},{"name":"AMHGARANJY","text":"Hello again, <span class=\"highlight\">Forename</span>. Was the child simply transported with joy?"},{"name":"AMHGARANJY","text":"Oh! Oh dear. How did that get in there? We must remember to thank the young lady for bringing this missing message to our attention."},{"name":"AMHGARANJY","text":"<span class=\"highlight\">Forename</span>... Did you happen to glance at the contents of this letter? Listen:"},{"name":"AMHGARANJY","text":"(-Letter to the Spinner-)<span class=\"emphasis\">There's no such thing as a Starlight miracle! If you, the saint, and the little helpers were real, you'd bring back my father!</span>"},{"name":"AMHGARANJY","text":"The poor thing. I, too, know the pain of losing a parent..."},{"name":"AMHGARANJY","text":"Perhaps there is something we can do... Yes, I shall look into it─after all, it would not be a successful Starlight Celebration if we failed to put a smile on <span class=\"emphasis\">every</span> child's face, now, would it?"},{"name":"AMHGARANJY","text":"Otherwise, I believe you have proven yourself more than qualified to wear the scarlet of a little helper. Your continued assistance would be most appreciated."},{"name":"AMHGARANJY","text":"And not just here in the Lavender Beds, either! I am certain my colleagues abroad could also benefit from your aid...assuming you were so inclined?"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"}],"reward":{"gil":286,"items":[{"id":9279}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65786]},"next":[65861,65874,65876]},"partials":[{"type":"npc","id":"1010740","obj":{"i":1010740,"n":"Amh Garanjy","l":426,"q":6}},{"type":"item","id":"9279","obj":{"i":9279,"n":"Green Fallen Star","l":1,"c":21254,"t":85}},{"type":"item","id":"9273","obj":{"i":9273,"n":"Starlight Tunic","l":1,"c":42403,"t":35,"p":59}},{"type":"quest","id":"65786","obj":{"i":65786,"n":"A Starlight Miracle","g":204,"l":"Gridania","s":58}},{"type":"quest","id":"65861","obj":{"i":65861,"n":"A Little Help (The Lavender Beds)","g":204,"l":"The Lavender Beds","s":60}},{"type":"quest","id":"65874","obj":{"i":65874,"n":"A Little Help (Mist)","g":204,"l":"The Lavender Beds","s":61}},{"type":"quest","id":"65876","obj":{"i":65876,"n":"A Little Help (The Goblet)","g":204,"l":"The Lavender Beds","s":62}}]}