{"quest":{"name":"Kicking the Hornet's Nest","location":"Ul'dah","id":65792,"patch":2.0,"sort":50,"icon":100054,"unlocksFunction":1,"eventIcon":71341,"issuer":1001739,"target":1001739,"involved":[1001353,1003984,1003985,1003990,1003992,1003994,1004222,1004223],"genre":127,"journal":["First Sword Mylla wishes to teach you the fundamentals of the gladiatorial arts.","A gladiator must be capable of commanding an opponent's attention at will. To help you better understand this concept, Mylla has bid you seek out Lominsan marauders harassing people outside the Quicksand. Once located, tell them to face /me and show them that their disruptive behavior will not be tolerated.","The mere sight of you sends the marauders packing. Enter the Quicksand and deal with any belligerents that remain.","Your attempt to intimidate Pfarmurl the Driven nearly ends in disaster until a man named Aldis intervenes, causing the marauder to flee in terror. Speak with Momodi and inform her that all the Lominsans are gone.","Momodi is grateful for the help you and Aldis provided. However, before you depart, she asks that you not speak of Aldis to Mylla. Return to the Gladiators' Guild and tell the guildmaster that the task is complete.","Mylla informs you that the Lominsan marauders have begun terrorizing merchants outside Scorpion Crossing in western Thanalan. Speak with any victim you can find so that you may track down Pfarmurl's gang and bring them to justice.","The Bloody Marauders may be the ones behind a recent assault on a traveling merchant. Search for the merchant's goods outside Scorpion Crossing and confront the Lominsans if they are still in the area.","You recover the merchant's goods and ensure that the Bloody Marauders will terrorize the people of Thanalan no more. Return the stolen goods to their rightful owner.","The merchant is overjoyed to receive his stolen merchandise. Return to the guild and report to Mylla.","Mylla is pleased to hear of your accomplishments. She reminds you that by mastering the sword, you master yourself. Duly advised, you return to your training.<br><br>※The next gladiator quest will be available from Mylla upon reaching level 10."],"objectives":["Tell the marauders outside the Quicksand to face /me.","Tell the marauder inside the Quicksand to face /me.","Speak with Momodi.","Report to Mylla.","Search for witnesses at Scorpion Crossing.","Recover the merchant's goods.","Return the goods to the merchant.","Report to Mylla."],"dialogue":[{"name":"MYLLA","text":"Ah, <span class=\"highlight\">Forename</span>. I take it you and your sword have become better acquainted. Then I will now instruct you on another fundamental aspect of what it means to be a gladiator: commanding an opponent's attention."},{"name":"MYLLA","text":"As gladiators, we are trained to engage enemies at close range, weathering their attacks as we deliver our own. However, there are times when we must do battle alongside allies whose talents are not the same as our own."},{"name":"MYLLA","text":"In such a situation, your role is <span class=\"emphasis\">not</span> to slay the enemy in front of you, but rather to defend the man beside you."},{"name":"MYLLA","text":"We do this by eliciting the enmity of our opponents through attacks and techniques designed to incite their hatred."},{"name":"MYLLA","text":"You must learn to draw the enemy's attention to yourself and to trust in your stout constitution to endure. In so doing, you protect your weaker comrades who would otherwise perish."},{"name":"MYLLA","text":"To help you better understand this, there is a task I would have you perform. It just so happens that Momodi of the Quicksand has requested our assistance─a gang of Lominsan marauders has paraded into town and begun harassing people outside her establishment."},{"name":"MYLLA","text":"Men like these prey on the weak, but will turn tail and flee at the first sign of defiance. You need not resort to violence─it will suffice to show them that you are not afraid of them, and will not tolerate their behavior."},{"name":"MYLLA","text":"Seek out the Lominsans and make your presence known by bellowing, “Face <span class=\"highlight\">me</span>, marauder!” In this way, you will protect the people of Ul'dah, as you would your allies in battle."},{"name":"ONOA","text":"Ye know yer friend 'ere's a Twelve-damned cheat!? Thinks 'e can charge us more 'cause we're foreigners! But 'e'll get 'is own back, mark me words!"},{"name":"ONOA","text":"The 'ells ye want? This don't concern ye, so bugger off!"},{"name":"ONOB","text":"What? Ye blamin' me 'cause this little shite shat 'is own pants!? Well, bugger 'im, an' bugger you, too!"},{"name":"ONOB","text":"Bugger off! Can't ye see I'm 'avin' a civilized conversation with this poxy whoreson!?"},{"name":"ONOC","text":"Oi, come on now, 'e was disrespectin' me proud Sea Wolf 'eritage! &lt;spit&gt; Fine, I'll leave the bastard be, but we ain't finished!"},{"name":"ONOC","text":"Ye gots a lot o' nerve, thinkin' ye can talk to me like that!"},{"name":"ONOD","text":"The 'ells is yer problem!? Maybe she likes 'er men rough! What're ye s'posed to be, 'er bleedin' <span class=\"alternative-container\"><span class=\"alternative\">lady-in-waitin'</span><span class=\"alternative\">manservant</span></span>!? Bah, it don't matter, ye've gone an' spoiled the mood..."},{"name":"ONOD","text":"...Just turn around an' walk away, 'venturer. Are ye deaf? Get lost!"},{"name":"ONOE","text":"Me poxy arse this is yer best brew! I'd sooner drink a pint o' me own piss than this swill!"},{"name":"ONOE","text":"Just who the 'ells do ye think yer speakin' to, maggot!? I'm Pfarmurl the Driven, an' me an' me Bloody Marauders've been reavin' so long, mothers scare their children with tales about us!"},{"name":"ONOE","text":"Don't believe me words? Then I'll let me axe do the talkin'!"},{"name":"ALDI","text":"(-???-)Oho, this is lively, even for the Quicksand. You two going to put on a show for us?"},{"name":"ONOE","text":"What's this? Another godsdamned fool? Show some respect when ye talk to─"},{"name":"ALDI","text":"(-???-)Pfarmurl the Driven, leader of a troupe of bloody mummers or some such. Aye, I heard you the first time─your voice carries quite well."},{"name":"ONOE","text":"Then unless ye want me to split yer skull with me axe, ye better─"},{"name":"ONOE","text":"Th-That sword! It couldn't be...<span class=\"emphasis\">Frenzy</span>!? But only the Sword of Nald would─ Bloody hells, it's <span class=\"emphasis\">you</span>!"},{"name":"ALDI","text":"(-???-)You know, I've never been one to stand back and watch. Mind if I join the fun?"},{"name":"ONOE","text":"B-B-Beggin' yer pardon, sir!"},{"name":"ALDI","text":"(-???-)Why do they always do that...? &lt;sigh&gt; Looks like it's just you and me."},{"name":"ALDI","text":"(-???-)Standing up to that Lominsan was quite brave of you─and quite foolish."},{"name":"ALDI","text":"I think I like you, gladiator. Name's Aldis, and I'd buy you a drink, but I'm afraid I just spent the last of my coin."},{"name":"ALDI","text":"I used to be a young gladiator like you. Back then, I... Ah, but that hardly concerns you. These days I'm just an explorer of the unexplored, a seeker of as-yet-unknown experiences..."},{"name":"ALDI","text":"...Like that beautiful stranger keeping my bed warm right now. <span class=\"emphasis\">Gods</span>, I've missed this city, this wonderful desert jewel of debauchery and sin. Now, if you'll excuse me."},{"name":"MOMODI","text":"I swear, if I hadn't seen Aldis with my own eyes, I wouldn't have believed it was him. Everyone here thought he died years ago."},{"name":"MOMODI","text":"Listen, <span class=\"highlight\">Forename</span>. Do me a favor and <span class=\"emphasis\">don't</span> tell Mylla about meetin' Aldis, alright? She doesn't need this sort of drama."},{"name":"MOMODI","text":"Why? Well...let's just say some folk ain't good for one another."},{"name":"MYLLA","text":"I've already heard of your exploits at the Quicksand, <span class=\"highlight\">Forename</span>. You did well to send those marauders packing. I wish I could say we've heard the last of them."},{"name":"MYLLA","text":"Alas, we've received reports of axe-wielding raiders assaulting merchants traveling through Scorpion Crossing. It seems words will not suffice, after all."},{"name":"MYLLA","text":"I want you to finish what you've begun, <span class=\"highlight\">Forename</span>. Head to western Thanalan and see that Pfarmurl the Driven and all those who have shared in his crimes never trouble the people of Ul'dah again."},{"name":"ENPCA","text":"They...they tore me from my saddle and took everything I own! Bring my goods back to me, I beg of you!"},{"name":"ENPCA","text":"Twelve bless you, adventurer! If it weren't for good <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> like you, I'd never leave home."},{"name":"MYLLA","text":"Good, it is finished. And with that, this stage of your training is complete."},{"name":"MYLLA","text":"This time, your enemies were ill-behaved ruffians, but who knows what manner of opponents you will face in the future?"},{"name":"MYLLA","text":"Regardless, I have faith that you will do well. Master your sword and you shall master yourself."},{"name":"MYLLA","text":"Now then, there will be work for you in the days to come."},{"name":"MYLLA","text":"Return to your training, <span class=\"highlight\">Forename</span>. We will speak again."},{"name":"ALSDIS","text":"<span class=\"alternative-container\"><span class=\"alternative\">'Tis a rare day indeed I have the honor of speaking with such a fair maiden. A toast to a most fortuitous meeting─the first of many, I pray.</span><span class=\"alternative\">Sorry mate, but I drink alone─or at least not with the likes of you. Aye, I prefer companions better suited to...companionship.</span></span>"},{"name":"POP","text":"A concatenation of angry curses assaults your ears!"}],"reward":{"items":[{"id":1602},{"id":3005,"one":1},{"id":2653,"one":1},{"id":3530,"one":1},{"id":27634,"one":1},{"num":5,"id":5823,"one":1}],"xp":560},"reqs":{"jobs":[{"lvl":5,"id":2}],"questsType":"any","quests":[65789,65822]},"next":[65797,65824]},"partials":[{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1003984","obj":{"i":1003984,"n":"Ill-mannered Marauder","l":40,"q":1}},{"type":"npc","id":"1003985","obj":{"i":1003985,"n":"Nervous Merchant","l":42,"q":1}},{"type":"npc","id":"1003990","obj":{"i":1003990,"n":"Menacing Marauder","l":40,"q":1}},{"type":"npc","id":"1003992","obj":{"i":1003992,"n":"Keen-eyed Marauder","l":40,"q":1}},{"type":"npc","id":"1003994","obj":{"i":1003994,"n":"Mocking Marauder","l":40,"q":1}},{"type":"npc","id":"1004222","obj":{"i":1004222,"n":"Pfarmurl","l":40,"q":1}},{"type":"npc","id":"1004223","obj":{"i":1004223,"n":"Stately Gentleman","l":40,"q":1}},{"type":"item","id":"1602","obj":{"i":1602,"n":"Bronze Bastard Sword","l":5,"c":30502,"t":2,"p":151}},{"type":"item","id":"3005","obj":{"i":3005,"n":"Custom-made Cuirass","l":6,"c":48028,"t":35,"p":100}},{"type":"item","id":"2653","obj":{"i":2653,"n":"Leather Eyepatch","l":5,"c":40914,"t":34,"p":141}},{"type":"item","id":"3530","obj":{"i":3530,"n":"Fingerless Leather Gloves","l":5,"c":44060,"t":37,"p":126}},{"type":"item","id":"27634","obj":{"i":27634,"n":"Altered Thighboots","l":5,"c":49077,"t":38}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"quest","id":"65789","obj":{"i":65789,"n":"Way of the Gladiator","g":127,"l":"Ul'dah","s":11,"f":1}},{"type":"quest","id":"65822","obj":{"i":65822,"n":"My First Gladius","g":127,"l":"Ul'dah","s":12,"f":1}},{"type":"quest","id":"65797","obj":{"i":65797,"n":"Ul'dah's Most Wanted","g":127,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"65824","obj":{"i":65824,"n":"Ul'dah's Most Wanted","g":127,"l":"Ul'dah","s":100,"f":1}}]}