{"quest":{"name":"Winning Friends with Aldgoat","location":"Limsa Lominsa","id":65796,"patch":2.0,"sort":250,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1000956,"genre":143,"usedItems":[4644],"journal":["Lyngsath still appears to be concerned about Diving Dove's health.","Thanks to your dried prunes, Diving Dove seems much less tense than before. However, Lyngsath is still not convinced that the woman is as healthy as she should be, and bids you make her a hearty meal of aldgoat steak. Alas, Diving Dove is known to mislike both the taste and texture of the meat. Clearly, it will take some effort to make the dish palatable to her.","Pretending to seek her opinion on your handiwork once more, you succeed in convincing Diving Dove to eat your aldgoat steak. As before, it does not take long for her to see through your deception, but she is nevertheless impressed that you were able to make her enjoy aldgoat. Encouraged by her words, you continue along your chosen path.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 30."],"objectives":["Deliver an aldgoat steak to Diving Dove."],"dialogue":[{"name":"LYNGSATH","text":"Great timin', <span class=\"highlight\">Forename</span>. Just so 'appens I've got a task fer ye what'll test yer ingenuity in the kitchen."},{"name":"LYNGSATH","text":"Divin' Dove's lookin' a lot less tense thanks to yer dried prunes, but she's still a bit on the pale side fer my likin'."},{"name":"LYNGSATH","text":"Woman needs some red meat in 'er, if you ask me, an' I wants <span class=\"emphasis\">you</span> to cook it."},{"name":"LYNGSATH","text":"A nice big aldgoat steak should put some color back in 'er cheeks. Thing is, Divin' Dove don't much care fer the meat."},{"name":"LYNGSATH","text":"Aldgoat's tough as leather, ye see, an' it's got a pretty pungent flavor to boot. 'Ighlanders're just about the only folk as enjoy it."},{"name":"LYNGSATH","text":"Safe to say, ye'll need to do summat about the texture an' taste if ye want Divin' Dove to eat yer aldgoat steak."},{"name":"LYNGSATH","text":"Got all that? Good. Now run along, eh?"},{"name":"DIVINGDOVE","text":"Hm? You'd like my opinion on a dish? Very well. What do you have for me?"},{"name":"DIVINGDOVE","text":"...Oh. Is this what I think it is? If so, I must warn you that I'm not particularly fond of aldgoat. My evaluation may not be the most objective...but if you insist..."},{"name":"DIVINGDOVE","text":"My word... Are you <span class=\"emphasis\">certain</span> this is aldgoat? It's not chewy in the slightest! You've done a fine job of tenderizing the meat, I must say."},{"name":"DIVINGDOVE","text":"What's more, I can scarce make out the pungent flavor. It remains, to be sure, but it's somehow...pleasant─almost delicious when complemented by garlic."},{"name":"DIVINGDOVE","text":"Being rich in iron, aldgoat is supposedly good for you, but its texture and taste leave <span class=\"emphasis\">a lot</span> to be desired."},{"name":"DIVINGDOVE","text":"Which is why I've always loathed the stuff. How ironic that you should choose <span class=\"emphasis\">me</span> of all people to sample yo─"},{"name":"DIVINGDOVE","text":"Wait a minute... This is another one of the guildmaster's schemes to nurse me back to health, isn't it?"},{"name":"DIVINGDOVE","text":"Why, that interfering─ I <span class=\"emphasis\">said</span> I would take better care of myself, didn't I? Apparently he thinks he knows better! Hmph!"},{"name":"DIVINGDOVE","text":"...At any rate, it does nothing to detract from your achievement. You've made me change my mind about aldgoat, and that's no small coup."},{"name":"DIVINGDOVE","text":"No chef in my native Ul'dah would've gone to such lengths to make the meat appealing. They would have dismissed it as lowly fare, unworthy of their time."},{"name":"DIVINGDOVE","text":"Ul'dahn cuisine is a true product of life in the sultanate, you see─rife with pomp and pretense. I began my career there, but soon grew weary of all the charlatans masquerading as gourmands. To hear them speak, one would assume that gold leaf was an essential part of every meal. That is why I came to Limsa Lominsa."},{"name":"DIVINGDOVE","text":"And thank the gods that I did. Here, the people's love of cuisine is simple and pure, and it shows in the dedication of our guild members. Not a day goes by that I do not count myself fortunate to have been given the opportunity to work alongside fine culinarians like you."}],"reward":{"gil":557,"items":[{"id":2511},{"id":2731,"one":1},{"id":3065,"one":1},{"id":3575,"one":1},{"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":16}],"quests":[65795]},"next":[65802]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000956","obj":{"i":1000956,"n":"Diving Dove","l":28,"q":4}},{"type":"item","id":"2511","obj":{"i":2511,"n":"Initiate's Culinary Knife","l":24,"c":35752,"t":27,"p":1225}},{"type":"item","id":"2731","obj":{"i":2731,"n":"Silver Magnifiers","l":25,"c":40895,"t":34,"p":1314}},{"type":"item","id":"3065","obj":{"i":3065,"n":"Initiate's Gown","l":24,"c":42034,"t":35}},{"type":"item","id":"3575","obj":{"i":3575,"n":"Velveteen Halfgloves","l":24,"c":44027,"t":37,"p":902}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4644","obj":{"i":4644,"n":"Aldgoat Steak","l":27,"c":24360,"t":46}},{"type":"quest","id":"65795","obj":{"i":65795,"n":"Releasing a Burden","g":143,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"65802","obj":{"i":65802,"n":"The Chefsbane Cometh","g":143,"l":"Limsa Lominsa","s":300,"f":1}}]}