{"quest":{"name":"Dodo It Yourself","location":"Limsa Lominsa","id":65793,"patch":2.0,"sort":100,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1000950,"genre":143,"usedItems":[4640],"journal":["Lyngsath wants you to assist Ingham with a large order.","According to the guildmaster, Ingham has forgotten something in his order: grilled dodo. Prepare the two required servings in Ingham's stead, and deliver them to him.","Somewhat predictably, your immaculately prepared gift of grilled dodo serves to humiliate Ingham once again. By way of repayment for your unwelcome act of kindness, he dutifully proceeds to share his knowledge of tradecraft leves with you. It would seem these tasks, assigned by T'mokkri of the Adventurers' Guild, offer an excellent opportunity to gain cooking experience while earning coin.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 15."],"objectives":["Deliver servings of grilled dodo to Ingham."],"dialogue":[{"name":"LYNGSATH","text":"Ah, <span class=\"highlight\">Forename</span>. Fine timin'! I need yer 'elp."},{"name":"LYNGSATH","text":"Remember Ingham? Well, yer grilled trout did wonders fer 'is motivation. Lad's been workin' 'is arse off ever since. Anyroad, I thought I'd give 'im a chance to prove 'imself with a big order fer delivery...but it looks like 'e might've bit off more than 'e can chew."},{"name":"LYNGSATH","text":"Now, everythin' 'e's made, 'e's made to me satisfaction─the problem bein' what 'e's <span class=\"emphasis\">not</span> made. An' I ain't talkin' about a missin' tuile, nor a stray crouton, neither─I'm talkin' about the bleedin' <span class=\"emphasis\">main course</span> o' grilled dodo. So, I'd be much obliged if ye could whip up two servin's in 'is stead, an' get 'em over to 'im, <span class=\"emphasis\">quick</span>."},{"name":"LYNGSATH","text":"'Case yer not familiar with the dish, 'tis one o' the Bismarck's old favorites. Ye rub garlic an' salt into a piece o' dodo tenderloin, then grill it. Shouldn't pose a risin' star like yerself no trouble."},{"name":"INGHAM","text":"What is it now? The guildmaster has entrusted me with the preparation of a <span class=\"emphasis\">sizable</span> order, so if you don't mind, I shall get back to work."},{"name":"INGHAM","text":"Hm? You've brought me two servings of grilled dodo? And what precisely do you propose I do with─"},{"name":"INGHAM","text":"&lt;gasp&gt; The main course! How could I have forgotten the <span class=\"emphasis\">main bloody course</span>!? And it's far too late to start preparing now!"},{"name":"INGHAM","text":"Damn it, your grilled dodo will have to do. I only hope the quality of the other courses and accompaniments compensates for─"},{"name":"INGHAM","text":"By the Twelve... <span class=\"emphasis\">You</span> cooked <span class=\"emphasis\">these</span>? The golden brown hue, tantalizing the eyes from betwixt a perfect diamond pattern of griddle lines..."},{"name":"INGHAM","text":"The surface is seared to perfection... Aye, over a hot fire to seal in the juices, just as the guildmaster teaches."},{"name":"INGHAM","text":"And this irresistible aroma... Just enough garlic to balance the dodo's gamy richness, but not so much as to overwhelm the palate. Mmmmmmmmm..."},{"name":"INGHAM","text":"&lt;slurp&gt; Beg pardons. As I was saying, this is...impressive. Grilled dodo may seem a simple dish, but therein lies the rub. If one thing goes wrong, <span class=\"emphasis\">everything</span> goes wrong. I...could not have produced anything near this standard."},{"name":"INGHAM","text":"Godsdammit! I practice day and night in order to improve my skills, only to botch my largest ever order, and then <span class=\"emphasis\">you</span> come along and save the day! You of all bloody people! Gah! What have I done to deserve this!?"},{"name":"INGHAM","text":"Suffice it to say, I am <span class=\"emphasis\">not</span> pleased with how things have turned out, but you've done me a kindness, and I <span class=\"emphasis\">always</span> repay my debts. Listen well, for I will share with you information that should prove to your profit."},{"name":"INGHAM","text":"You know what guildleves are, I trust? Well, there's a variety that calls for culinary expertise. They're known as tradecraft leves, and they provide an excellent opportunity to hone your skills while earning coin."},{"name":"INGHAM","text":"If such work interests you, I recommend you speak with T'mokkri of the Adventurers' Guild. And on that note─away with you!"}],"reward":{"gil":289,"items":[{"num":250,"id":2},{"num":200,"id":7},{"id":2494},{"id":2660,"one":1},{"id":3014,"one":1},{"id":3536,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":16}],"quests":[65791]},"next":[65794]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000950","obj":{"i":1000950,"n":"Ingham","l":28,"q":3}},{"type":"item","id":"2494","obj":{"i":2494,"n":"Bronze Skillet","l":8,"c":35701,"t":26,"p":246}},{"type":"item","id":"2660","obj":{"i":2660,"n":"Amateur's Headgear","l":10,"c":40420,"t":34,"p":283}},{"type":"item","id":"3014","obj":{"i":3014,"n":"Amateur's Kurta","l":9,"c":42233,"t":35,"p":246}},{"type":"item","id":"3536","obj":{"i":3536,"n":"Amateur's Smithing Gloves","l":10,"c":44071,"t":37,"p":252}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4640","obj":{"i":4640,"n":"Grilled Dodo","l":11,"c":24352,"t":46}},{"type":"quest","id":"65791","obj":{"i":65791,"n":"A Treat of Trout","g":143,"l":"Limsa Lominsa","s":50,"f":1}},{"type":"quest","id":"65794","obj":{"i":65794,"n":"On a Skewer Tip","g":143,"l":"Limsa Lominsa","s":150,"f":1}}]}