{"quest":{"name":"Releasing a Burden","location":"Limsa Lominsa","id":65795,"patch":2.0,"sort":200,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1000956,"genre":143,"usedItems":[4730],"journal":["Lyngsath is concerned about the health of a certain guild member.","One of your guildmates, a woman named Diving Dove, has been looking strangely tense of late, but is too engrossed in her work to take the time to relax. Concerned for her well-being, Lyngsath bids you prepare her some dried plums, in the hope that they might help to lighten her burden. The pixie plums required to make them can be obtained in the wilderness, or purchased via the market board in Hawkers' Alley.","Pretending to seek her opinion on your handiwork, you succeed in convincing Diving Dove to eat your dried plums. She soon sees through your ruse, however, and takes umbrage at Lyngsath's interference. Thankfully, her mortification swiftly passes, and she admits to feeling moved by your gift, before promising to take better care of herself in future.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 25."],"objectives":["Deliver a handful of dried plums to Diving Dove."],"dialogue":[{"name":"LYNGSATH","text":"'Ow do, <span class=\"highlight\">Forename</span>? Been takin' care o' yerself, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>? Remember: if you ain't got yer 'ealth, you ain't got nothin'."},{"name":"LYNGSATH","text":"Speakin' of 'ealth, one of our lot ain't been 'er normal self o' late. Divin' Dove's 'er name, an' she's 'avin' a bit o' trouble <span class=\"emphasis\">lettin' go</span>, judgin' by the grimace she's been wearin'."},{"name":"LYNGSATH","text":"I told the poor woman she should take better care of 'erself, but she'll barely leave the kitchen fer <span class=\"emphasis\">anythin'</span>─which is prob'ly 'ow the problem came about, now I comes to think of it. Anyroad, if it ain't sorted soon, I'm worried she'll burst."},{"name":"LYNGSATH","text":"D'ye know what a pixie plum is, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>? 'Tis a fruit what's native to Coerthas, an' jus' the thing to 'elp solve Divin' Dove's problem. Trouble is, they're bitter as sin when fresh."},{"name":"LYNGSATH","text":"...Which is why plenty o' chefs don't cook with the things. 'Course, what they don't know is, ye can get rid o' the bitterness by dryin' 'em. Better still, doin' so brings out their natural sweetness without affectin' their other properties, givin' rise to the noble treat that is the dried plum."},{"name":"LYNGSATH","text":"Now, I would've made these meself, but we ain't got no plums at the moment, an' I can't very well leave me post to go an' get 'em. So I needs <span class=\"emphasis\">you</span> to do the procurin' an' the makin' in me stead."},{"name":"LYNGSATH","text":"Ye can pick the plums in the wilds if yer fond o' foragin'. Failin' that, take a gander at the market board in West 'Awkers' Alley. Oh, an' once the dried plums're ready, see that Divin' Dove eats 'em, would ye?<br>...Aye, an', um...ye might want to avoid lettin' on about the whys an' wherefores... Touchy subject, an' all that."},{"name":"DIVINGDOVE","text":"Hm? You want me to give you my opinion on your handiwork?"},{"name":"DIVINGDOVE","text":"Well, my dodo won't need turning for a little while, so I suppose I can spare a moment. Let's go to the upper floor."},{"name":"DIVINGDOVE","text":"Oh, these are lovely! What kind of fruit did you say they were?"},{"name":"DIVINGDOVE","text":"...<span class=\"emphasis\">Pixie plums</span>? Well I never. There isn't a hint of bitterness about them."},{"name":"DIVINGDOVE","text":"The drying process rids them of that, you say?"},{"name":"DIVINGDOVE","text":"I had no idea."},{"name":"DIVINGDOVE","text":"In truth, the only thing I <span class=\"emphasis\">did</span> know about pixie plums is that they're a traditional remedy fo─ &lt;gasp&gt;"},{"name":"DIVINGDOVE","text":"N-Now, look here! We've barely exchanged two words since you joined this guild, and yet here you are being...being...<span class=\"emphasis\">presumptuous</span>!"},{"name":"DIVINGDOVE","text":"...What? It was all the <span class=\"emphasis\">guildmaster's</span> idea!?"},{"name":"DIVINGDOVE","text":"Oh...GODS! Has the man no decency!? This is an <span class=\"emphasis\">outrageous</span> invasion of my privacy! Unforgivable! And...&lt;rumble&gt;...uhhh..."},{"name":"DIVINGDOVE","text":"And...strangely...moving.<br>As busy as I am, I am not so busy as Master Lyngsath, yet somehow he finds the time to look after his many charges while I can scarcely spare a moment to look after myself."},{"name":"DIVINGDOVE","text":"I've been working so hard...but maybe effort is not the answer. Perhaps I just need to relax a little... Thank you for the gift. I promise to take better care of myself in the future."}],"reward":{"gil":470,"items":[{"id":2497},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":16}],"quests":[65794]},"next":[65796]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000956","obj":{"i":1000956,"n":"Diving Dove","l":28,"q":4}},{"type":"item","id":"2497","obj":{"i":2497,"n":"Initiate's Skillet","l":19,"c":35703,"t":26,"p":732}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4730","obj":{"i":4730,"n":"Dried Plums","l":21,"c":24058,"t":46,"p":44}},{"type":"quest","id":"65794","obj":{"i":65794,"n":"On a Skewer Tip","g":143,"l":"Limsa Lominsa","s":150,"f":1}},{"type":"quest","id":"65796","obj":{"i":65796,"n":"Winning Friends with Aldgoat","g":143,"l":"Limsa Lominsa","s":250,"f":1}}]}