{"quest":{"name":"That Old Familiar Feeling","location":"Ul'dah","id":65798,"patch":2.0,"sort":150,"icon":100054,"unlocksFunction":1,"eventIcon":71341,"issuer":1001739,"target":1001739,"involved":[1004091,1004224],"genre":127,"journal":["First Sword Mylla wishes to assign you another task.","A band of Amalj'aa archers has been raiding caravans near Camp Drybone. Mylla has already dispatched several gladiators to assist with patrols, and bids you travel to eastern Thanalan to join them.","You luck upon and slay the Amalj'aa archers, rescuing a wounded guildmate and a cowering merchant. Speak with the gladiator and see if he needs aid.","Your guildmate assures you that his wounds are not mortal, and that he can look after the merchant. Return to the Gladiators' Guild and report to Mylla.","Shortly after your return, the guild erupts into chaos when Aldis enters. The First Sword is especially upset, demanding that he leave or face dire consequences. Aldis agrees and makes to depart, but not before requesting that you join him at the Quicksand for a drink.","Your conversation with Aldis is interrupted when a gang of sellswords bursts into the Quicksand, intent on slaying the man. In an impressive display of swordsmanship, Aldis slays most of the assassins, though you do your part as well. His mood soured, Aldis wanders off in search of a quieter tavern. Return to the guild and speak with Mylla.","Finally recovered from the shock of Aldis's earlier intrusion, Mylla recalls that she wished to teach you something new. She hopes that your new Shield Lob technique, with which you can attack enemies at range, will serve you well in the future.<br><br>※The next gladiator quest will be available from Mylla upon reaching level 20."],"objectives":["Search for your guildmates near Camp Drybone.","Speak with the injured gladiator.","Report to Mylla.","Meet Aldis at the Quicksand.","Report to Mylla."],"dialogue":[{"name":"MYLLA","text":"Hail, <span class=\"highlight\">Forename</span>. You come at a good time. I've another task I wish to assign you."},{"name":"MYLLA","text":"The Immortal Flames and the Brass Blades have both requested the guild's assistance in maintaining security at Camp Drybone, a vital outpost along the Royal Allagan Sunway."},{"name":"MYLLA","text":"The Amalj'aa have been raiding caravans with reckless abandon, creating a significant disruption in trade."},{"name":"MYLLA","text":"Ul'dah has a long, troubled history with the Amalj'aa, so raids are not unheard of. However, this recent escalation must be addressed."},{"name":"MYLLA","text":"Go to Camp Drybone and search for these raiders, <span class=\"highlight\">Forename</span>. I've already dispatched other gladiators to patrol the region, so I suggest you speak with one for more information."},{"name":"GUILDMEMBER","text":"Get down! They're still here!"},{"name":"GUILDMEMBER","text":"&lt;cough&gt; &lt;wheeze&gt; Don't worry, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>, I'll be fine─though maybe not when the First Sword is done with me, eh? Go and tell her that the Amalj'aa are dead─leave the merchant to me."},{"name":"GUILDMEMBER","text":"&lt;cough&gt; &lt;wheeze&gt; Tell the First Sword that the Amalj'aa are dead. I'll look after the merchant."},{"name":"MYLLA","text":"I knew I was right to send you, <span class=\"highlight\">Forename</span>! You've done us proud."},{"name":"ALDIS","text":"Seven hells, this place reeks of sweat! How do you expect a man to concentrate on his swordplay like this!?"},{"name":"GUILDMEMBER","text":"Aldis!?"},{"name":"ALDIS","text":"You remember me! How goes it, brother? Still waving your sword around like a feather duster?"},{"name":"MYLLA","text":"You...you..."},{"name":"ALDIS","text":"Good to see you too, Mylla my dear. You're more beautiful than I remember."},{"name":"MYLLA","text":"Y-You're alive!? Where have you been all these years!? Answer me!"},{"name":"ALDIS","text":"Me? Well, if you must know, I'm on a spiritual journey of self-discovery."},{"name":"MYLLA","text":"Dammit, Aldis, this is serious! We all thought you were dead! And for you to walk in here, as though nothing ever happened─have you forgotten how you dishonored us!? I should cut you down where you stand!"},{"name":"ALDIS","text":"Ho ho, that's the Mylla I remember, all fire and brimstone! I knew that pretty face could still contort itself into some terrifying shapes!"},{"name":"ALDIS","text":"Ahhh, don't pout, girl, I'm just having fun. But, as you wish, I'll go."},{"name":"ALDIS","text":"<span class=\"highlight\">Forename</span>, was it? Why don't you join me at the Quicksand? I could use some company, and I doubt anyone else here would be so kind."},{"name":"MYLLA","text":"That...that bastard. Why now, after all these years...?"},{"name":"ALDIS","text":"Ho, you came. Sorry you had to witness that little reunion between me and Mylla."},{"name":"ALDIS","text":"The Sword of Nald, back from the dead─you'd think I'd be greeted by throngs of adoring fans, not threats of violence..."},{"name":"ALDIS","text":"Listen, <span class=\"highlight\">Forename</span>. You're good with a sword, that's plain to see."},{"name":"ALDIS","text":"But more than that, you've got purpose. There's a fire burning within you."},{"name":"ALDIS","text":"As a former man of conviction, I can recognize a kindred spirit."},{"name":"ALDIS","text":"Gerolt named her <span class=\"emphasis\">Frenzy</span>. She's one of a magnificent pair of swords that the drunken prodigy forged for Coliseum champions."},{"name":"ALDIS","text":"The man who wielded her twin had eyes that burned like yours..."},{"name":"ALDIS","text":"<span class=\"highlight\">Forename</span>, I─"},{"name":"ALDIS","text":"The hells!?"},{"name":"ARCHER","text":"Aldis, Sword of Nald! We've come for your head!"},{"name":"ALDIS","text":"If you do that, then how the hells am I supposed to enjoy my ale?"},{"name":"ARCHER","text":"Arrogant fool! Prepare to meet your maker!"},{"name":"ALDIS","text":"Well, ain't you a bunch of impatient, humorless fellas."},{"name":"ALDIS","text":"Up for a bit of fun, <span class=\"highlight\">Forename</span>? I'll lead, you follow."},{"name":"ALDIS","text":"Didn't think he'd go so far as to send a gang of sellswords into the Quicksand in broad daylight."},{"name":"ALDIS","text":"Why is it never a bevy of beauties?"},{"name":"ALDIS","text":"Let's continue this another time, shall we? I need to find a new place to drink─one with more attractive company than this sorry lot."},{"name":"MYLLA","text":"My apologies, <span class=\"highlight\">Forename</span>─I meant to teach you a new technique earlier, but when that idiot arrived, I completely forgot. He's just so...infuriating."},{"name":"MYLLA","text":"Ahem. The Shield Lob technique will allow you to attack from afar without the need for ranged weaponry."},{"name":"MYLLA","text":"Since we gladiators are primarily close-range fighters, the ability to draw the attention of distant enemies is a valuable asset. May it serve you well in the field, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"The next gladiator quest will be available from Mylla upon reaching level 20."},{"name":"POP","text":"You feel a rush of air as an arrow whistles by your head!"},{"name":"SCENE00040","text":"Duty calls. Do you wish to proceed with “CLSGLA150”?"},{"name":"SCENE00040","text":"Yes"},{"name":"SCENE00040","text":"No"},{"name":"QIB","text":"Defend yourself from the unknown assailants!"},{"name":"ALDIS","text":"Watch closely now, <span class=\"highlight\">Forename</span>!<br>I'll show you how a Coliseum champion fights!"},{"name":"ALDIS","text":"Is this all you've got!? Try to keep up, boys! "},{"name":"ALDIS","text":"Those weaklings're all yours, <span class=\"highlight\">Forename</span>!"},{"name":"ALDIS","text":"Aye, that's the sort of sport I crave!"},{"name":"ALDIS","text":"Watch their eyes, <span class=\"highlight\">Forename</span>, not their hands!"}],"reward":{"action":24,"items":[{"id":1607},{"id":3026,"one":1},{"id":3544,"one":1},{"id":3325,"one":1},{"id":3775,"one":1},{"num":5,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":2}],"questsType":"any","quests":[65797,65824]},"next":[65799]},"partials":[{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1004091","obj":{"i":1004091,"n":"Aldis","l":40,"q":1}},{"type":"npc","id":"1004224","obj":{"i":1004224,"n":"Injured Gladiator","l":44,"q":1}},{"type":"action","id":"24","obj":{"i":24,"n":"Shield Lob","c":164,"j":1,"t":3,"l":15}},{"type":"item","id":"1607","obj":{"i":1607,"n":"Brass Bastard Sword","l":15,"c":30504,"t":2,"p":504}},{"type":"item","id":"3026","obj":{"i":3026,"n":"Bronze Cuirass","l":15,"c":48001,"t":35,"p":819}},{"type":"item","id":"3544","obj":{"i":3544,"n":"Bronze Gauntlets","l":15,"c":48301,"t":37,"p":588}},{"type":"item","id":"3325","obj":{"i":3325,"n":"Padded Hempen Trousers","l":15,"c":45015,"t":36,"p":450}},{"type":"item","id":"3775","obj":{"i":3775,"n":"Bronze Sabatons","l":15,"c":46801,"t":38,"p":672}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65797","obj":{"i":65797,"n":"Ul'dah's Most Wanted","g":127,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"65824","obj":{"i":65824,"n":"Ul'dah's Most Wanted","g":127,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"65799","obj":{"i":65799,"n":"The Face of Thal","g":127,"l":"Ul'dah","s":200,"f":1}}]}