{"quest":{"name":"On a Skewer Tip","location":"Limsa Lominsa","id":65794,"patch":2.0,"sort":150,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1000947,"involved":[1000950,1000965],"genre":143,"usedItems":[4642],"journal":["Lyngsath wants you to speak with Ingham, who he suspects has botched another order.","It would seem that Ingham is in low spirits once again. Could he have botched yet another order? Lyngsath bids you ask your hapless colleague about the cause of his woes, and lend whatever help you may.","Ingham miserably reveals that he has offended a regular patron of the Bismarck─a fellow by the name of Maetimaga─by serving him a second-rate meat miq'abob. Though he wishes to set things right, Ingham is too shaken to apologize to the man in person. Perhaps you could do so in his stead.","It would seem Maetimaga means to have Ingham dismissed from his post out of concern for the Bismarck's reputation. In order to prove that the offending meat miq'abob was a mere aberration, you must make him another─one that is fit for consumption.","Deeply impressed by your miq'abob, Maetimaga undergoes a change of heart. Bear the glad tidings to Lyngsath.","Upon hearing your report, Lyngsath thanks you for your efforts on behalf of the guild. He then explains that his students are his foremost priority, and that he would willingly let the Bismarck's proud reputation suffer rather than stifle his charges' development. Inspired by the strength of Lyngsath's conviction, you continue along your chosen path.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 20."],"objectives":["Speak with Ingham.","Speak with Maetimaga.","Deliver a meat miq'abob to Maetimaga.","Report to Lyngsath."],"dialogue":[{"name":"LYNGSATH","text":"Well, if it ain't young <span class=\"highlight\">Forename</span>. An' judgin' by the burns on yer 'ands, ye've been workin' 'ard at yer cookin'. Good on ye! Yer an inspiration to yer peers, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─'specially Ingham."},{"name":"LYNGSATH","text":"Aye, 'e's been workin' like a man possessed since that business with the grilled dodo! ...Not that it's made much difference. &lt;sigh&gt; Truth be told, I'm convinced 'e's made a pig's ear o' things again..."},{"name":"LYNGSATH","text":"'E 'asn't told me as much, mind, but it's writ plain on 'is face. I've tried to prise the story out of 'im─see if there's aught I can do, like─but 'e bites 'is tongue when I'm around, stubborn sod."},{"name":"LYNGSATH","text":"Anyroad, I was thinkin'─might be as 'e'd open up to one of 'is peers. An' seein' as 'ow ye've 'ad such an effect on 'im, I reckon you might be just the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> fer the job. So do us a favor an' coax the story out of 'im, would ye? Oh, an' lend 'im an 'and, if 'e needs one."},{"name":"INGHAM","text":"You again!? What have you come for this time!? Oh, I see─the guildmaster has you <span class=\"emphasis\">spying</span> on me now! He thinks that I'm incompetent and can't be trusted to do my own work!"},{"name":"INGHAM","text":"&lt;sigh&gt; Who am I fooling? If Master Lyngsath thinks that I'm incompetent, it's because I <span class=\"emphasis\">am</span>. With me, it's one bungled order after another."},{"name":"INGHAM","text":"It shames me to reveal this to <span class=\"emphasis\">you</span> of all people, but I've offended one of the Bismarck's regulars. The man─Maetimaga is his name─has a soft spot for meat miq'abobs, and so I thought I'd impress him with a complimentary skewer..."},{"name":"INGHAM","text":"...Only to have his expression turn sour the instant he took a bite. I'll never forget the steel in his voice when he said that he would “have words with the management.”"},{"name":"INGHAM","text":"I meant to add luster to the Bismarck's proud reputation─instead, I tarnished it."},{"name":"INGHAM","text":"I want to set things right, but I don't know how. Maetimaga's still out on the terrace, but I just can't bear facing him again─not this soon. Gods, what am I to do?"},{"name":"MAETIMAGA","text":"Hm? No, I shan't be ordering anything else.<br>...I see you're still here."},{"name":"MAETIMAGA","text":"Ah, let me guess: you've come to apologize on behalf of the sorry excuse for a chef who made that gods-awful meat miq'abob."},{"name":"MAETIMAGA","text":"Well, I am afraid the damage has been done. I have been served second-rate food <span class=\"emphasis\">at the Bismarck</span>. It is only right that the man responsible should be dismissed, and I mean to see to it that he is."},{"name":"MAETIMAGA","text":"Do not mistake my intention. I do this solely to preserve the Bismarck's good name. Were it to become known that Lyngsath was employing the services of inferior chefs, this once-fine establishment would soon fall into disrepute."},{"name":"MAETIMAGA","text":"Hm. You have yet to speak a word, but I take it you are not pleased with my evaluation. Very well─if you would have me believe that this incident was an aberration, and not, in fact, indicative of a general decline in standards, I suggest you convince me with your cooking."},{"name":"MAETIMAGA","text":"I will not have it said that I am an unreasonable man. Make me another meat miq'abob─one fit for consumption, this time─and I shall reconsider my stance."},{"name":"MAETIMAGA","text":"Where is my meat miq'abob? The other fellow's attempt may have been unpalatable, but at least I did not have to wait for it."},{"name":"MAETIMAGA","text":"Ah, here it is. Finally. Unless you have any objections, I shall sample it in your kitchen. That way, I can treat Lyngsath to my opinion with the flavor still fresh upon my palate."},{"name":"MAETIMAGA","text":"Well, well... It would seem you have made amends for your fellow chef's failure."},{"name":"MAETIMAGA","text":"This is as moist and flavorsome a meat miq'abob as I have ever tasted, and I've tasted more than I can count. As a matter of fact, I consider myself something of a connoisseur of the dish, and know more than a little about its preparation. Would you like me to tell you what I think your colleague did wrong?"},{"name":"MAETIMAGA","text":"First of all, in his eagerness to seal in the meat's moisture, he left it searing for far too long, producing something akin to charcoal. Not so with your dodo─its surface is charred just enough to be aromatic while the middle is still moist."},{"name":"MAETIMAGA","text":"Second, your friend grilled <span class=\"emphasis\">all</span> the ingredients together, even though tomato and paprika require far less time over the fire than meat. To your credit, you did not fall into this trap."},{"name":"MAETIMAGA","text":"Last but not least, your friend was too heavy on the salt. Those with underdeveloped palates may beg to differ, but it is the harmony of sweet, sour, and salty that makes a miq'abob. And yours, my friend, struck the perfect balance."},{"name":"MAETIMAGA","text":"Which brings me to my conclusion: I was wrong to assume that the quality of your colleague's dish was indicative of a general decline in standards. It would seem the Bismarck's reputation is in no immediate danger. Thus reassured, I shall forget about the incident."},{"name":"MAETIMAGA","text":"Master Lyngsath has done well to train such a capable culinarian. I pray you continue honing your skills under his tutelage."},{"name":"LYNGSATH","text":"Ah, <span class=\"highlight\">Forename</span>! Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was lookin' for. Word's already reached me ears about what ye got up to while I was away."},{"name":"LYNGSATH","text":"To 'ear 'em tell it, ye single-'andedly restored ol' Maetimaga's faith in the Bismarck. Fer that, you 'ave me gratitude, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, an' Ingham's too."},{"name":"LYNGSATH","text":"I told 'im to thank you in person, but 'e's too bloody proud. Don't 'old it against 'im, though, eh? I've already forgiven the daft sod."},{"name":"LYNGSATH","text":"I dunno what ye've 'eard about me, but I ain't never been one to give none of mine the axe fer buggerin' up a dish or three. There's no denyin' our patrons're important, but they ain't me main reason for bein' 'ere."},{"name":"LYNGSATH","text":"Nay, me first duty is the trainin' o' culinarians. An' even if the good name o' this restaurant suffers for it, ye won't see me sheddin' no tears."},{"name":"LYNGSATH","text":"Ye know why, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>? 'Cause it's the people what ultimately make this place. An' more'n anythin' else, it's their passion fer cookin' that I wants to bring out."},{"name":"LYNGSATH","text":"Truth be told, there's only one reason I'd send a man away: if 'e stopped wantin' to be a culinarian."},{"name":"LYNGSATH","text":"'Course, I doubt that's summat as'll ever apply to you. In the short time ye've been 'ere, ye've already proven yerself more'n capable. An' so long as ye keep yer nose to the stove, yer only gonna get better. I look forward to seein' what yer capable of─an' tastin' it fer good measure!"}],"reward":{"gil":382,"items":[{"id":2509},{"id":3019,"one":1},{"id":3779,"one":1},{"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":16}],"quests":[65793]},"next":[65795]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000950","obj":{"i":1000950,"n":"Ingham","l":28,"q":3}},{"type":"npc","id":"1000965","obj":{"i":1000965,"n":"Maetimaga","l":28,"q":1}},{"type":"item","id":"2509","obj":{"i":2509,"n":"Recruit's Culinary Knife","l":16,"c":35751,"t":27}},{"type":"item","id":"3019","obj":{"i":3019,"n":"Hempen Doublet Vest of Crafting","l":12,"c":42116,"t":35,"p":436}},{"type":"item","id":"3779","obj":{"i":3779,"n":"Ash Pattens","l":15,"c":46123,"t":38,"p":432}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4642","obj":{"i":4642,"n":"Meat Miq'abob","l":15,"c":24351,"t":46,"p":33}},{"type":"quest","id":"65793","obj":{"i":65793,"n":"Dodo It Yourself","g":143,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65795","obj":{"i":65795,"n":"Releasing a Burden","g":143,"l":"Limsa Lominsa","s":200,"f":1}}]}