{"quest":{"name":"A Taste of Home","location":"Limsa Lominsa","id":65805,"patch":2.0,"sort":450,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1001537,"genre":143,"usedItems":[4679],"journal":["Lyngsath has received word that a foreign dignitary has arrived in Limsa Lominsa. ","The time is come for you to employ your culinary skills for the benefit of Lominsan diplomacy. Speak with Latisha to learn what you are to prepare for the Admiral's esteemed guest.","You learn from Latisha that the dignitary is an emissary from Ishgard, and the Admiral wants her guest to enjoy a taste of home away from home. To this end, you have been tasked with preparing a traditional Ishgardian dish: Dzemael gratin. Suffice it to say, it must be of the finest quality.","You present your serving of Dzemael gratin to Latisha, who declares that it is certain to satisfy the Admiral's Ishgardian guest. Thanking you for your contribution, Latisha encourages you to strive ever higher as a culinarian.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 50."],"objectives":["Speak with Latisha.","Deliver a serving of Dzemael gratin <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Latisha."],"dialogue":[{"name":"LYNGSATH","text":"I'm told ye passed Latisha's test with flyin' colors, an' now yer to cook fer the Admiral's official functions. Well, the time's come fer ye to begin flexin' 'em culinary muscles fer the good o' Lominsan diplomacy."},{"name":"LYNGSATH","text":"Aye, word arrived from the Bridge jus' now. A foreign dignitary's come to Limsa, an' the Admiral wants us─by which I mean <span class=\"emphasis\">you</span>─to fashion the meal together."},{"name":"LYNGSATH","text":"Latisha's got all the details, so ye'll want to speak with 'er. Go an' do us proud, <span class=\"highlight\">Forename</span>!"},{"name":"LATISHA","text":"I have been waiting for you, <span class=\"highlight\">Forename</span>. As I'm sure Lyngsath informed you, we are playing host to a man of some importance, an emissary from the Holy See of Ishgard. Your task is to prepare a dish that will satisfy him."},{"name":"LATISHA","text":"When the Admiral receives foreign visitors, she ordinarily requests that we serve them the best of Lominsan cuisine. This time, however, she wishes to treat her guest to a taste of home away from home─a gesture of goodwill."},{"name":"LATISHA","text":"To this end, you are to prepare a serving of Dzemael gratin. 'Tis a baked dish of eft tail and popotoes, creamy and warming, that is a mainstay in the cold climes of Ishgard. Suffice it to say that only the finest sample of the dish, made with only the finest ingredients, will do on this occasion."},{"name":"LATISHA","text":"Is the Dzemael gratin ready yet? Remember, only the finest sample of the dish will do for this occasion."},{"name":"LATISHA","text":"Ah, yes, it certainly looks and smells the part. Let us see if the same can be said of the taste."},{"name":"LATISHA","text":"Oh my... Simply exquisite! The crust is baked to golden perfection, and breaking it yields the creamy goodness beneath."},{"name":"LATISHA","text":"Eft tail tends to be lean and sinewy, but grinding it solves the problem. The Ishgardians have prepared the meat in this fashion since eras past, and I am pleased to see that you have done likewise."},{"name":"LATISHA","text":"As for the popoto slices, they are boiled enough to be cooked through, yet not so much as to render them bereft of texture. In summary, your Dzemael gratin leaves naught to be desired."},{"name":"LATISHA","text":"Lest you wonder, the dish takes its name from one of Ishgard's oldest and proudest families."},{"name":"LATISHA","text":"House Dzemael has long stood at the forefront of castle building. Legend has it the family created this dish in order to fill the bellies and warm the hearts of their workers, and I am confident that your rendition will do the same for our esteemed guest."},{"name":"LATISHA","text":"Today, your culinary creation shall serve not only to sate hunger, but also to close the distance between nations. You can hold your head up high, <span class=\"highlight\">Forename</span>. Keep up your efforts, and soon you will become the equal of Master Lyngsath himself."}],"reward":{"items":[{"id":2503},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":16}],"quests":[65804]},"next":[65806]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1001537","obj":{"i":1001537,"n":"Latisha","l":28,"q":6}},{"type":"item","id":"2503","obj":{"i":2503,"n":"Cobalt Skillet","l":44,"c":35710,"t":26,"p":5586}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4679","obj":{"i":4679,"n":"Dzemael Gratin","l":55,"c":24112,"t":46,"p":457}},{"type":"quest","id":"65804","obj":{"i":65804,"n":"Diplomacy of the Skillet","g":143,"l":"Limsa Lominsa","s":400,"f":1}},{"type":"quest","id":"65806","obj":{"i":65806,"n":"Revenge of the Chefsbane","g":143,"l":"Limsa Lominsa","s":500,"f":1}}]}