{"quest":{"name":"Way of the Culinarian","location":"Limsa Lominsa","id":65807,"patch":2.0,"sort":10,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000946,"target":1000947,"genre":143,"journal":["Charlys would have you reaffirm your desire to join the Culinarians' Guild.","You have been referred to Lyngsath, the master of the Culinarians' Guild. Seek him out and impress upon him your desire to learn.","Having welcomed you into the guild, Lyngsath presents you with a weathered skillet to help you on your way. Take up the tool of your new trade, and speak with the guildmaster again to be assigned your first task."],"objectives":["Speak with Lyngsath."],"dialogue":[{"name":"CHARLYS","text":"So, have you the resolve to walk the path of the culinarian?"},{"name":"CHARLYS","text":"Wonderful! Then you must speak to Guildmaster Lyngsath at once!"},{"name":"CHARLYS","text":"This will come as no surprise, but he is the finest chef in Limsa Lominsa. His skill and dedication are second to none."},{"name":"CHARLYS","text":"You will find the guildmaster up the stairs yonder, keeping a watchful eye on his charges. Impress upon him your desire to learn, and he will surely find a place for you in his stew─by which I mean the guild."},{"name":"CHARLYS","text":"Still unsure? Then I think it best that you do not go before the guildmaster."},{"name":"CHARLYS","text":"As I believe I mentioned, he is passionate about cookery, and has little patience for those who show anything less than absolute commitment to the craft. Such ingredients spoil the stew, you see...and he is <span class=\"emphasis\">fiercely</span> protective of his stew."},{"name":"LYNGSATH","text":"Well met, 'venturer. I take it ye want to join our guild. Let's 'ave a good look at ye, then."},{"name":"LYNGSATH","text":"...Bah! What's an underfed whelp like you know about cookin'? Judgin' by them scrawny arms o' yours, ye'd struggle to lift a spoon, never mind a skillet!"},{"name":"LYNGSATH","text":"...Hahaha! I jest, I jest... &lt;sigh&gt; It don't take muscle to be a culinarian. 'Ells, it don't even take talent─'least not on its own."},{"name":"LYNGSATH","text":"No, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>, more'n anythin' else, becomin' a good cook boils down to <span class=\"emphasis\">passion</span>. If ye got that, there ain't nothin' ye can't achieve. So tell me...'ave ye got it?"},{"name":"Q1","text":"Have you the passion to become a culinarian?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"LYNGSATH","text":"Well, then...assumin' you ain't got an overwhelmin' urge to scrub me pans neither, I suggest ye bugger off back to where the food's served, an' leave the makin' of it to folks as give a damn."},{"name":"LYNGSATH","text":"That's the spirit! Aye, yer passion fer the culinary arts is plain to see."},{"name":"LYNGSATH","text":"An' ye'll be needin' every bit of it if ye want to become a master culinarian. Why, if mastery was a twelve-course dinner, I'd 'ardly 'ave finished the soup."},{"name":"LYNGSATH","text":"Make no mistake, our trade's as tough as old mutton, an' passion's the only thing what gets us through the gristly bits. But enough talk─what do ye call yerself?"},{"name":"LYNGSATH","text":"Well then, <span class=\"highlight\">Forename</span>, welcome to the guild. To mark the occasion, I present ye with yer very own skillet."},{"name":"LYNGSATH","text":"Ain't much to look at, but it'll more'n serve a novice like yerself."},{"name":"LYNGSATH","text":"Now then, let's see whether ye can tell which end's which. Aye, aye...I know I said ye'd struggle to lift a spoon, but ye've won me over. Now, show me ye <span class=\"emphasis\">can</span> 'old a skillet, an' I'll get ye started on yer first task."}],"reward":{"gil":115,"items":[{"num":100,"id":2},{"num":50,"id":7},{"id":2493}],"xp":100},"reqs":{"quests":[65727]},"next":[65790]},"partials":[{"type":"npc","id":"1000946","obj":{"i":1000946,"n":"Charlys","l":28,"q":3,"t":"Guild Receptionist"}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"item","id":"2493","obj":{"i":2493,"n":"Weathered Skillet","l":1,"c":35704,"t":26,"p":66}},{"type":"quest","id":"65727","obj":{"i":65727,"n":"So You Want to Be a Culinarian","g":0,"l":"Limsa Lominsa Upper Decks","s":0,"f":1}},{"type":"quest","id":"65790","obj":{"i":65790,"n":"My First Skillet","g":143,"l":"Limsa Lominsa","s":11,"f":1}}]}