{"quest":{"name":"The Chefsbane Cometh","location":"Limsa Lominsa","id":65802,"patch":2.0,"sort":300,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1000947,"involved":[1000956,1000973],"genre":143,"usedItems":[4645],"journal":["Lyngsath wants you to cook for a distinguished guest in his stead.","You learn that Lord Lolorito, one of Ul'dah's most powerful men, has announced his intention to dine at the Bismarck. Apparently, the man is a self-styled food critic, notorious for using his influence to ruin restaurants that fail to satisfy his rarefied needs. In an unfortunate turn of events, Lyngsath has injured his hand, and it falls to you to represent the Bismarck in his stead. In order to learn more about your distinguished guest, the guildmaster recommends you speak with Diving Dove, a native of Ul'dah.","You learn from Diving Dove that Lolorito's butler, a fellow by the name of Nonopesa, is presently at the Bismarck. Seek him out and endeavor to discover what manner of cuisine his master may be craving.","For a blessing, Nonopesa turns out to be a personable fellow, and you learn from him that Lolorito currently has a hankering for a hearty meal of meat. As per the butler's recommendation, prepare a haunch of smoked raptor of the finest quality, and deliver it to him.","Nonopesa is deeply impressed by your smoked raptor. You, in turn, are deeply impressed by his ability to judge food without taking a single bite. What was it that Diving Dove said about Ul'dahn cuisine...? At any rate, it would seem your cooking will satisfy even the exacting requirements of the great Lord Lolorito. Bear the glad tidings to Lyngsath.","Nonopesa's high opinion of your food serves to put Lyngsath at ease. The guildmaster thanks you for safeguarding the future of the guild, and proceeds to liken you to his trusty left hand. Keep up your efforts, and you may yet become one of the realm's finest culinarians.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 35."],"objectives":["Speak with Diving Dove.","Speak with Nonopesa.","Deliver a haunch of smoked raptor <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Nonopesa.","Speak with Lyngsath."],"dialogue":[{"name":"LYNGSATH","text":"Bollocks! Me 'and! 'Ow in the seven 'ells am I meant to cook with one bloody 'and!? Gah! Of all the godsdamned times I could've 'urt it, why'd it 'ave to be <span class=\"emphasis\">now</span>!?"},{"name":"LYNGSATH","text":"Forgive me language, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>. Don't worry─it ain't serious.<br>...Well, it is a <span class=\"emphasis\">bit</span> serious, to tell the truth."},{"name":"LYNGSATH","text":"I've gone an' knackered me 'and tryin' to catch a fallin' crate, see. It'll 'eal an' all, but it 'urts like a bastard. Can't so much as scratch me arse with it, never mind 'old a skillet. Wouldn't be so bad, but we got usselves a bigwig comin' to dine today─one o' the most powerful men in Ul'dah!"},{"name":"LYNGSATH","text":"Now, I've been in the business fer decades, an' I ain't no stranger to coddled dignitaries what whine about the color of the bloody crockery, an' 'ow there's too much parsley garnish on top o' their soup. But this ain't no ordinary coddled dignitary we're dealin' with."},{"name":"LYNGSATH","text":"This one fancies 'imself as a food critic, an' 'e's <span class=\"emphasis\">always</span> out to find fault, real or not."},{"name":"LYNGSATH","text":"An' that ain't the worst of it. Owin' to 'is influence, 'e's driven more'n a few respectable establishments into the ground. Fer this 'e's earned 'imself the name o' “Chefsbane” in culinary circles."},{"name":"LYNGSATH","text":"Each time the man's dined at the Bismarck, I've personally done the cookin' so as to avert disaster."},{"name":"LYNGSATH","text":"Don't get me wrong─I've got complete trust in all me chefs, but if the Bismarck goes under, the guild goes with it. An' that ain't a burden I can put on just anyone's shoulders."},{"name":"LYNGSATH","text":"But this time, someone else's gonna 'ave to fill in fer me...an' I wants that someone to be <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>. Ye've proven yerself more than capable, an' in 'igh-pressure situations besides. I'm confident ye won't let us down."},{"name":"LYNGSATH","text":"Ye'd do well to begin by talkin' with Divin' Dove. Bein' a native of Ul'dah, might be as she knows somethin' o' the Chefsba─I mean, <span class=\"emphasis\">Lord Lolorito</span>."},{"name":"DIVINGDOVE","text":"Aye, I'm aware of the situation. But don't panic─though the guildmaster is indisposed, all is not yet lost."},{"name":"DIVINGDOVE","text":"In case you're unfamiliar with our distinguished guest, he is the head of the East Aldenard Trading Company. Though you may not have heard that name before, you will almost certainly have heard of the many famous brands it owns, such as Eshtaime's Lapidaries and Sunsilk Tapestries."},{"name":"DIVINGDOVE","text":"Lord Lolorito's countless successes have made him the wealthiest man in Ul'dah─a place where wealth and influence are synonymous. It goes without saying that he has a seat on the Syndicate, the cabal that rules the sultanate. Ah, lest you wonder, Ul'dah is only notionally a sultanate these days..."},{"name":"DIVINGDOVE","text":"<span class=\"emphasis\">Anyway</span>, as is often the way with men of means, Lord Lolorito is a lover of fine cuisine. And as the guildmaster doubtless mentioned, he's made a name for himself as a ruthless food critic."},{"name":"DIVINGDOVE","text":"The man has a penchant for making life miserable for us chefs. Indeed, he <span class=\"emphasis\">never</span> places an order, but demands instead that you “impress him.” And therein lies our first dilemma: what to serve?"},{"name":"DIVINGDOVE","text":"Lest you think the fates unduly mischievous, I'm happy to report that the odds are not <span class=\"emphasis\">wholly</span> stacked against us. It just so happens that Lolorito's butler, a fellow by the name of Nonopesa, is dining at the Bismarck at this very moment."},{"name":"DIVINGDOVE","text":"This is a golden chance to learn what manner of dish Lolorito craves. Go to Nonopesa on the terrace, and try to coax the information out of him. Good luck!"},{"name":"NONOPESA","text":"I'm sorry? I think I may have misheard. Did you say that <span class=\"emphasis\">you</span> would be preparing Lord Lolorito's meal? Well...this is rather unexpected. But if Master Lyngsath saw fit to entrust the task to you, then you must not be without skill."},{"name":"NONOPESA","text":"Hm? You wish to know what my master desires to eat? Hah hah hah! <span class=\"emphasis\">Finally</span> it occurs to someone to ask me that question!"},{"name":"NONOPESA","text":"It is my duty to see that my lord never wants for comfort, and naught pleases me more than to see Lord Lolorito in high spirits. As such, I should be glad to share with you what I know."},{"name":"NONOPESA","text":"To be deleted."},{"name":"NONOPESA","text":"Shortly prior to arriving in Limsa Lominsa, my master spoke of being seized by a craving for a hearty meal of meat. Though he did not mention a specific dish, I happen to know that smoked raptor is a particular favorite of his. Needless to say, a man of such refined taste as he would expect no less than the <span class=\"emphasis\">finest</span> sample of the dish. I hope this information serves you well."},{"name":"NONOPESA","text":"Lord Lolorito is due to conclude his business negotiations presently, and will desire to take his meal thereafter. Once the smoked raptor is ready, pray bring it to me. I shall see it delivered to my master."},{"name":"SYSTEM","text":"The higher the <span class=\"highlight\">quality</span> achieved during synthesis, the greater the chance that the finished item will be of a higher grade (<span class=\"highlight\">HQ</span>)."},{"name":"SYSTEM","text":"To be deleted."},{"name":"NONOPESA","text":"Remember: Lord Lolorito will accept nothing less than the best. Your smoked raptor must be the finest example of the dish, prepared with the utmost skill."},{"name":"NONOPESA","text":"Ah, the smoked raptor is ready? Good. Now, I trust you won't object to an inspection. Lest you worry about your handiwork being defaced, my years serving Lord Lolorito have taught me how to taste with sight and smell alone."},{"name":"NONOPESA","text":"By the gods... This raptor is <span class=\"emphasis\">sublime</span>!"},{"name":"NONOPESA","text":"The marriage of cracked pepper and sun lemon begets an irresistible fragrance that perfectly complements the aroma of the meat."},{"name":"NONOPESA","text":"The flavor is rounded out with the mellow fruitiness of olive oil, which also lends the shank a lustrous sheen that tantalizes the eye."},{"name":"NONOPESA","text":"I have presided over Lord Lolorito's dining table for many years..."},{"name":"NONOPESA","text":"And I can say without reservation that this is the most delectable smoked raptor I have ever had the pleasure of <span class=\"emphasis\">not</span> eating!"},{"name":"NONOPESA","text":"It is of little wonder that Master Lyngsath deemed you fit to cook in his stead─I doubt that even he could have delivered a better rendition of my master's favorite dish. You, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, are quite a culinarian."},{"name":"NONOPESA","text":"...Ah, but I sense you are more relieved than flattered. Hardly surprising, I suppose. Much and more is said of my lord's “uncompromising” approach to cuisine."},{"name":"NONOPESA","text":"While I will not refute the rumors, you may rest assured that the Bismarck has no cause to worry."},{"name":"NONOPESA","text":"Now then, if you will excuse me, I must see my lord's meal delivered to him."},{"name":"NONOPESA","text":"You may look forward to hearing his judgment anon─and entirely without trepidation, if my senses do not fail me. Pray send Master Lyngsath my compliments."},{"name":"LYNGSATH","text":"Ye did it, <span class=\"highlight\">Forename</span>! You impressed the pants off Lolorito's butler!"},{"name":"LYNGSATH","text":"Nonopesa knows 'is master's tastes better'n 'is own, an' 'is approval's all the assurance I need. The guild's safe, an' it's all thanks to you!"},{"name":"LYNGSATH","text":"Ye never cease to amaze me, <span class=\"highlight\">Forename</span>. Ye came to us with nary any knowledge of cookin', an' now yer like a second left 'and!"},{"name":"LYNGSATH","text":"...Well, that didn't come out right. What I meant to say was, yer as useful to me as the 'and I 'old me skillet with─summat no culinarian can do without."},{"name":"LYNGSATH","text":"Ye've got it in ye to be one o' the finest chefs in the realm, an' I would see ye fulfill yer potential. Promise me ye'll keep at yer cookin'."}],"reward":{"gil":639,"items":[{"id":2499},{"id":2750,"one":1},{"id":3104,"one":1},{"id":3583,"one":1},{"num":2,"id":5825,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":16}],"quests":[65796]},"next":[65803]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000956","obj":{"i":1000956,"n":"Diving Dove","l":28,"q":4}},{"type":"npc","id":"1000973","obj":{"i":1000973,"n":"Nonopesa","l":28,"q":1}},{"type":"item","id":"2499","obj":{"i":2499,"n":"Bomb Frypan","l":28,"c":35706,"t":26,"p":2284}},{"type":"item","id":"2750","obj":{"i":2750,"n":"Velveteen Beret","l":29,"c":41032,"t":34}},{"type":"item","id":"3104","obj":{"i":3104,"n":"Velveteen Gown","l":30,"c":42071,"t":35,"p":2499}},{"type":"item","id":"3583","obj":{"i":3583,"n":"Velveteen Shortgloves","l":28,"c":44081,"t":37,"p":1453}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4645","obj":{"i":4645,"n":"Smoked Raptor","l":31,"c":24358,"t":46}},{"type":"quest","id":"65796","obj":{"i":65796,"n":"Winning Friends with Aldgoat","g":143,"l":"Limsa Lominsa","s":250,"f":1}},{"type":"quest","id":"65803","obj":{"i":65803,"n":"Of Cooks and Books","g":143,"l":"Limsa Lominsa","s":350,"f":1}}]}