{"quest":{"name":"Diplomacy of the Skillet","location":"Limsa Lominsa","id":65804,"patch":2.0,"sort":400,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1001537,"genre":143,"usedItems":[4712,4733,4749],"journal":["Lyngsath wants you to assist Latisha with a matter of great import.","According to Lyngsath, Latisha is in urgent need of assistance. Speak with her to learn what she requires of you.","Latisha needs your help to prepare sample dishes for an afternoon tea being hosted by the Admiral. Do as bade and make a blood currant tart, a serving of pastry fish, and a cup of chamomile tea─all of the finest quality.","After preparing all of the requested items to Latisha's satisfaction, the bookkeeper informs you that she was in fact judging your abilities. Having passed her test with flying colors, you have won the honor of serving as the Admiral's official chef for her coming functions. Keep up your efforts, that you might do the Bismarck name justice.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 45."],"objectives":["Speak with Latisha.","Deliver a blood currant tart <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a serving of pastry fish <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a cup of chamomile tea <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Latisha."],"dialogue":[{"name":"LYNGSATH","text":"Oi, <span class=\"highlight\">Forename</span>. Yer jus' the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> I was lookin' fer."},{"name":"LYNGSATH","text":"Which is to say, ye be the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> what <span class=\"emphasis\">Latisha</span> was lookin' fer. She's in need o' some practiced 'ands, an' ye've got the only ones she'll trust. Well, 'sides mine, o' course, but I've got me own matters to attend to."},{"name":"LYNGSATH","text":"Take fair warnin', though, <span class=\"highlight\">Forename</span>: the better ye get, the more others'll turn to ye. 'Tis a fine feelin', bein' relied upon, but it can be a right pain in the arse, too. Anyroad, enough o' me prattle─run along an' find out what Latisha wants."},{"name":"LATISHA","text":"My thanks for agreeing to help, <span class=\"highlight\">Forename</span>. Now, I will tell you the details of your task, but I must ask that you keep it in the utmost confidence."},{"name":"LATISHA","text":"The Admiral is scheduled to host an afternoon tea for visiting dignitaries, and the Bismarck has been called upon to provide the repast and refreshments."},{"name":"LATISHA","text":"I have been charged with conceiving the menu, and require help making a few sample dishes. I would be grateful if you could prepare a blood currant tart, a serving of pastry fish, and a cup of chamomile tea─all of the finest quality."},{"name":"LATISHA","text":"As a woman of the sea, the Admiral drinks liquor like most folk drink water, but the same cannot be said of her guests. Hence the afternoon tea as opposed to, say, a dinner banquet."},{"name":"LATISHA","text":"Alas, we know little and less of their tastes besides that, so I am forced to consider a wide variety of options. It has proven to be quite a task, but with your help, I am confident that we can serve up a menu to please."},{"name":"LATISHA","text":"How are the items I requested coming along? Lest you forget, it's a blood currant tart, a serving of pastry fish, and a cup of chamomile tea that I need─all of the finest quality."},{"name":"LATISHA","text":"Ahhh, such a tantalizing medley of aromas! I cannot wait to sample each one!"},{"name":"LATISHA","text":"You have outdone yourself yet again, <span class=\"highlight\">Forename</span>. As soon as our guests seat themselves at table, their noses will be enticed by the rich, relaxing fragrance of chamomile."},{"name":"LATISHA","text":"Having taken a warming sip of the tea, their attention will turn next to tart and pastry. For an instant, they are at a loss, as both dishes are prepared with such loving detail. Is this mere food to consume, or art to admire?"},{"name":"LATISHA","text":"They feel a twinge of sadness that they must deface such beauty, but that sensation is short-lived. For no sooner do their teeth break the flaky crust than they experience a veritable symphony of tastes and textures."},{"name":"LATISHA","text":"The making of pastries and sweets demands not only a delicate hand, but artistic sense besides. And <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>, are possessed of both. I can recommend you to the Admiral without reserve."},{"name":"LATISHA","text":"I owe you an apology and an explanation─I wasn't being wholly forthright with you. While I am indeed tasked with conceiving the menu for the Admiral's functions, it was also my job to select the guild member who will serve as her chef."},{"name":"LATISHA","text":"And I am thrilled to inform you that that honor shall fall to you, the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who passed my test with flying colors! There is no doubt in my mind that you will represent the Bismarck admirably. Keep up the fine work, and be close at hand for when the Admiral has need of you."}],"reward":{"items":[{"id":2515},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":16}],"quests":[65803]},"next":[65805]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1001537","obj":{"i":1001537,"n":"Latisha","l":28,"q":6}},{"type":"item","id":"2515","obj":{"i":2515,"n":"Apprentice's Culinary Knife","l":40,"c":35754,"t":27}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4712","obj":{"i":4712,"n":"Blood Currant Tart","l":32,"c":24056,"t":46}},{"type":"item","id":"4733","obj":{"i":4733,"n":"Pastry Fish","l":40,"c":24052,"t":46}},{"type":"item","id":"4749","obj":{"i":4749,"n":"Chamomile Tea","l":24,"c":24406,"t":46}},{"type":"quest","id":"65803","obj":{"i":65803,"n":"Of Cooks and Books","g":143,"l":"Limsa Lominsa","s":350,"f":1}},{"type":"quest","id":"65805","obj":{"i":65805,"n":"A Taste of Home","g":143,"l":"Limsa Lominsa","s":450,"f":1}}]}