{"quest":{"name":"Of Cooks and Books","location":"Limsa Lominsa","id":65803,"patch":2.0,"sort":350,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1001537,"genre":143,"usedItems":[4677],"journal":["Lyngsath wants you to learn about other aspects of the restaurant business.","To broaden your knowledge of the restaurant business, Lyngsath bids you speak with the Bismarck's bookkeeper, Latisha, who used to be a customs officer at Mealvaan's Gate.","Latisha is famished and requires a bite to eat before teaching you about her duties. She has asked you to prepare for her the choicest serving of ratatouille you can manage.","Lavishing your ratatouille with praise, Latisha goes on to tell you of her responsibilities as the Bismarck's bookkeeper. As is the case with most other professions, it appears that speed is of the essence if one wishes to maintain a well-run restaurant.<br><br>※The next culinarian quest will be available from Lyngsath upon reaching level 40."],"objectives":["Speak with Latisha.","Deliver a serving of ratatouille <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Latisha."],"dialogue":[{"name":"LYNGSATH","text":"Right good o' ye to drop in again, <span class=\"highlight\">Forename</span>. Ye'd be surprised 'ow many o' yer guildmates stop comin' altogether, thinkin' they know all what needs knowin'."},{"name":"LYNGSATH","text":"But as any scholarly would tell ye, the learnin' never stops, an' I speak from experience. There's some as say I'm the best in the realm, but there ain't a day what passes that I don't discover somethin' new."},{"name":"LYNGSATH","text":"Now, you an' me, we're chefs first an' foremost. But there's more to the restaurant business than jus' cookin'."},{"name":"LYNGSATH","text":"That's why I want ye to speak with Latisha, our bookkeeper. Afore comin' to us, she 'erself was a scholarly doin' customs work at Mealvaan's Gate. Ye stand to learn much an' more by seein' things from 'er perspective."},{"name":"LATISHA","text":"Ah, <span class=\"highlight\">Forename</span>, the chef who prepared Lord Lolorito's meal in the guildmaster's stead! Thanks to your heroics, the Bismarck's reputation came through unscathed. We all owe you for that. So, what brings you to my counter?"},{"name":"LATISHA","text":"Master Lyngsath would have you learn about the restaurant business at large, you say? Why, of course! It would be my pleasure to share with you such knowledge as I possess."},{"name":"LATISHA","text":"But before we begin...I could do with a bite to eat. It has been a long and busy shift, and I haven't had the chance to sit down to a proper meal."},{"name":"LATISHA","text":"By way of board, might I trouble you to prepare some ratatouille for me? And call me spoiled, but please make it the most <span class=\"emphasis\">exquisite</span> serving you can manage! My thanks in advance!"},{"name":"LATISHA","text":"I don't mean to rush you, but if the ratatouille takes much longer, I fear I'm like to pass out from exhaustion."},{"name":"LATISHA","text":"Ahhh, such an enticing aroma! I will enjoy this right away!"},{"name":"LATISHA","text":"Mmmmmm, I can't remember the last time I had such tasty ratatouille... That was truly wonderful! And with my hunger sated, we can now delve into the kind of work I do here."},{"name":"LATISHA","text":"In fact, you have just witnessed one of my more important duties: keeping track of our members' progress. I've found that sampling each person's rendition of ratatouille gives a marvelous insight into their growth."},{"name":"LATISHA","text":"Owing to its simplicity, the vegetable sauté lends itself well to variation, allowing the chef to pour himself into its creation. Indeed, your own bespeaks your ability to create a quality dish under strict time constraints."},{"name":"LATISHA","text":"Do not underestimate that skill. You'll find a great deal of a restaurant's success lies in performing tasks expeditiously. As an example, some other services I provide are procuring ingredients, ensuring our equipment functions, and, perhaps most importantly, listening to our customers."},{"name":"LATISHA","text":"If any of these tasks were ignored for an extended period, it is fair to say the Bismarck would fall into chaos, and our name would lose its considerable luster."},{"name":"LATISHA","text":"Well, I trust you now have something of an insight into my responsibilities. I only wish that <span class=\"emphasis\">all</span> our members shared your curiosity about what goes into running this place!"}],"reward":{"items":[{"id":2501},{"id":2769,"one":1},{"id":3130,"one":1},{"id":3607,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":16}],"quests":[65802]},"next":[65804]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1001537","obj":{"i":1001537,"n":"Latisha","l":28,"q":6}},{"type":"item","id":"2501","obj":{"i":2501,"n":"White Skillet","l":34,"c":35708,"t":26,"p":3622}},{"type":"item","id":"2769","obj":{"i":2769,"n":"Mythril Magnifiers","l":34,"c":40901,"t":34,"p":2953}},{"type":"item","id":"3130","obj":{"i":3130,"n":"Apprentice's Smock","l":36,"c":42185,"t":35}},{"type":"item","id":"3607","obj":{"i":3607,"n":"Linen Halfgloves","l":33,"c":44161,"t":37,"p":2195}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4677","obj":{"i":4677,"n":"Ratatouille","l":37,"c":24108,"t":46}},{"type":"quest","id":"65802","obj":{"i":65802,"n":"The Chefsbane Cometh","g":143,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"65804","obj":{"i":65804,"n":"Diplomacy of the Skillet","g":143,"l":"Limsa Lominsa","s":400,"f":1}}]}