{"quest":{"name":"Revenge of the Chefsbane","location":"Limsa Lominsa","id":65806,"patch":2.0,"sort":500,"icon":100052,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1000947,"involved":[1000899,1000956,1000962,1001029,1001537,1002079,1003277],"genre":143,"usedItems":[4647,4678,4715,4713],"journal":["Lyngsath needs you to prepare a banquet fit for a sultana.","Word of your talents has reached the sultana of Ul'dah, who has requested that your culinary creations be served at her welcoming supper. Alas, while Her Grace specified the chef, she did not specify what she desires to eat. In order to decide upon the menu, Lyngsath recommends you seek the counsel of Diving Dove.","Diving Dove suspects that Lord Lolorito, the man culinarians fear as the Chefsbane, organized this royal visit for the sole purpose of discrediting the Bismarck. Seek Latisha's counsel on how you might go about averting disaster.","So as to discover the sultana's preferences, Latisha suggests that you seek the advice of Ul'dahn visitors to the city. She also directs you speak with her former colleague, Rubh Epocan of Mealvaan's Gate.","You have succeeded in identifying four of the sultana's favorite dishes. Return to Latisha with the information.","After some deliberation, it has been decided that you will prepare all four dishes for the sultana. Prepare an eft steak, a bowl of beef stew, a serving of trapper's quiche, and a crowned pie─all of the highest quality─and deliver them to the banquet venue. Speak with Zanthael at Bulwark Hall to gain admittance.","Much to your relief, the sultana is tremendously satisfied with her meal, and Lord Lolorito's plot to humiliate you and the Bismarck is foiled. For the second time, you have gotten the better of the Chefsbane. Deliver the glad tidings to Lyngsath.","Lyngsath applauds your most recent success, and goes as far as to say you have surpassed him in fame. He bids you apply your skills for the benefit of the realm, and promises that he will strive to do the same.<br><br>※The next culinarian quest will be available from Lyngsath once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Diving Dove.","Speak with Latisha.","Speak with an Ul'dahn observer in Limsa Lominsa.","Speak with an Ul'dahn merchant in Limsa Lominsa.","Speak with an Ul'dahn trader in Limsa Lominsa.","Speak with Rubh Epocan at Mealvaan's Gate.","Report to Latisha.","Present an eft steak <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a bowl of beef stew <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a serving of trapper's quiche <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a crowned pie <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Zanthael at Bulwark Hall.","Speak with Lyngsath."],"dialogue":[{"name":"LYNGSATH","text":"Thank the gods yer 'ere, <span class=\"highlight\">Forename</span>! The Admiral's due to receive the sultana of Ul'dah, an' the Bismarck's been called on to handle the welcomin' feast...but that ain't the 'alf of it!"},{"name":"LYNGSATH","text":"The sultana specifically requested that <span class=\"emphasis\">your</span> cookin' be served! It seems word o' yer talents reached 'Er Grace's ears, an' naught would do but she must sample yer culinary creations."},{"name":"LYNGSATH","text":"Now, that's all well an' good, but there's a bleedin' lot at stake 'ere. Pleasin' the sultana would win ye more acclaim than aught else ye could do, but if ye was to bugger it up...well, I'd rather not dwell on it."},{"name":"LYNGSATH","text":"Right now, all we know is she's keen to dine on summat tasty. But if ye want to guarantee yer royal client satisfaction, ye'll need to learn what she's hankerin' fer."},{"name":"LYNGSATH","text":"As always, ye can count on the help o' yer guildmates. Fer starters, ye'd do well to consult Divin' Dove. Woman's from Ul'dah, as ye know, an' might be as she can offer some insights into the sultana's preferences. Off ye go, now, an' good luck!"},{"name":"DIVINGDOVE","text":"In Ul'dah, commoners like myself seldom get the chance to see the sultana in the flesh. 'Tis a great honor, being called upon to prepare Her Grace's meal...but I warn you to proceed with caution."},{"name":"DIVINGDOVE","text":"I'm sure you will recall Lord Lolorito, your erstwhile patron. Well, a troubling rumor is circulating to the effect that <span class=\"emphasis\">he</span> arranged this royal visit. As a member of the Syndicate, it's entirely within his powers to do so."},{"name":"DIVINGDOVE","text":"And if the whispers can be believed, Lolorito's sole purpose for bringing the sultana to Limsa Lominsa is to humiliate <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>, and by extension, the Bismarck. Whatever his reasons, 'twould seem he is still intent on proving our creations wanting."},{"name":"DIVINGDOVE","text":"So as to preserve our good name, it would be to your benefit to do as the guildmaster suggested and learn all you can of the sultana's tastes. For this, I recommend you consult Latisha─knowing her, she's already begun looking into the matter."},{"name":"LATISHA","text":"I have been expecting you, <span class=\"highlight\">Forename</span>. I may be more bookkeeper than chef, but I'm no less a member of the Bismarck. As such, I mean to do all in my power to see that you succeed in pleasing the sultana."},{"name":"LATISHA","text":"Lord Lolorito has gone to great lengths to prevent us from discovering the sultana's preferences, but discover them we shall."},{"name":"LATISHA","text":"At any given time, there are a great many Ul'dahns visiting Limsa Lominsa, be it for business or leisure. I suggest you begin by learning all you can from them."},{"name":"LATISHA","text":"You might also wish to speak with Rubh Epocan, a former colleague of mine at Mealvaan's Gate. As a customs officer, she has an overview of exports to Ul'dah. I realize that this may be a stretch, but we cannot have too many hints."},{"name":"GIGIWAZU","text":"Why, yes! I <span class=\"emphasis\">do</span> happen to come from Ul'dah. Is there something you require?"},{"name":"GIGIWAZU","text":"Hm? You wish to know what the sultana likes to eat? Er, I scarce qualify to judge such things, but I do recall this one time I went to the markets."},{"name":"GIGIWAZU","text":"There was a vendor crying his stock of meats. And if the fellow is to be believed, his beef was bound for the royal kitchens, to be used to make beef stew for Her Grace. I hope that helps."},{"name":"COCORAMA","text":"You would know about the sultana? Her Grace is possessed of a good heart, that much is plain. But if you ask my honest opinion, she is rather young to be ruling─"},{"name":"COCORAMA","text":"...Ohhh, her preferences at table! In that case, I know for a fact that she is partial to crowned pie. Aye, I once went to a patisserie to buy one, only to be informed that Her Grace had bought out the <span class=\"emphasis\">entire</span> shop."},{"name":"ROSE","text":"What the sultana likes to eat, you ask? I cannot claim firsthand knowledge, but some moons ago, there was an article in the <span class=\"emphasis\">Mythril Eye</span>."},{"name":"ROSE","text":"Her Grace was on a royal visit to Gridania, where she reportedly fell in love with a local dish. Something called trapper's quiche, if memory serves."},{"name":"RUBHEPOCAN","text":"Ah, you must be from the Bismarck. Latisha sent word that you might be along to learn what manner of cuisine the sultana enjoys."},{"name":"RUBHEPOCAN","text":"While I do not have plain answers for you, I <span class=\"emphasis\">can</span> tell you that eft tails suddenly vanished from the Lominsan market right before Her Grace arrived."},{"name":"RUBHEPOCAN","text":"Some investigative work revealed that the tails were snapped up by the East Aldenard Trading Company, which is chaired by none other than Lord Lolorito. Somehow I doubt that this is simple coincidence."},{"name":"RUBHEPOCAN","text":"After all, when one thinks of eft tail, one can't help but think of the eponymous dish, eft steak. I would wager that Lord Lolorito seeks to prevent you from making it. All the more reason to prepare a plate, no?"},{"name":"LATISHA","text":"'Tis good to see you returned, <span class=\"highlight\">Forename</span>. Judging by your elated expression, I take it your investigation has borne fruit."},{"name":"LATISHA","text":"<span class=\"emphasis\">Four</span> potential fruits, you say? An eft steak, a bowl of beef stew, a serving of trapper's quiche, and a crowned pie... Hmmm... Picking which one the sultana has the greatest tendre for is a quandary."},{"name":"LATISHA","text":"...So why not prepare <span class=\"emphasis\">all</span> of them? This <span class=\"emphasis\">is</span> to be a grand banquet, is it not? It would certainly not be taken amiss were you to present several dishes."},{"name":"LATISHA","text":"With that settled, best you get to work. Needless to say, all the dishes must be prepared to the highest standard. Once they are ready, please deliver them to the banquet venue. Speak with Zanthael at Bulwark Hall, and he will grant you admittance."},{"name":"LATISHA","text":"This is the moment of truth, <span class=\"highlight\">Forename</span>. Go and do us proud!"},{"name":"ZANTHAEL","text":"You are the culinarian <span class=\"highlight\">Forename Surname</span>? I am informed that you will be serving an eft steak, a bowl of beef stew, a serving of trapper's quiche, and a crowned pie for the Admiral's banquet."},{"name":"ZANTHAEL","text":"My lords and ladies are beside themselves with anticipation. Pray do not keep them waiting overlong."},{"name":"ZANTHAEL","text":"Ah, the dishes! Yes, everything appears to be in order. You may enter."},{"name":"NANAMO","text":"I do declare, that was a most magnificent meal. My sole lament is that I cannot eat another bite. Would that I had the girth of a goobbue!"},{"name":"LOLORITO","text":"It gladdens me to see Your Grace so well satisfied."},{"name":"NANAMO","text":"Forsooth, never have I known such satisfaction at table."},{"name":"NANAMO","text":"You did not exaggerate when you told me that a culinarian of surpassing skill was to be found in Limsa Lominsa."},{"name":"NANAMO","text":"<span class=\"alternative-container\"><span class=\"alternative\">You are that culinarian, are you not?</span><span class=\"alternative\">Never did I imagine that it would be <span class=\"emphasis\">you</span>, dear <span class=\"highlight\">Forename</span>!</span></span> Thanks to you, I have tasted heaven. My gratitude is yours."},{"name":"LOLORITO","text":"(Grrr... How could <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> possibly have known every one of the sultana's favorite dishes?)"},{"name":"LOLORITO","text":"(Instead of being humiliated, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> ends up winning Her Grace's adulation! Bah!)"},{"name":"NANAMO","text":"Did you say something, Lord Lolorito?"},{"name":"LOLORITO","text":"N-Nay, Your Grace. I was merely admiring the cuisine."},{"name":"NANAMO","text":"As you say."},{"name":"NANAMO","text":"<span class=\"alternative-container\"><span class=\"alternative\">Now then, my dear culinarian, pray tell me your name. I would send to you a gift befitting your service this day.</span><span class=\"alternative\">But, truly. Your presence here is a surprise of the highest order. You must allow me to send you a gift befitting your service this day.</span></span>"},{"name":"NANAMO","text":"Hm? You were given to understand that <span class=\"emphasis\">I</span> requested you by name? Forgive me, but there appears to be a misunderstanding. I had entrusted the arrangements wholly to Lord Lolorito."},{"name":"LYNGSATH","text":"I've 'eard all about it, <span class=\"highlight\">Forename</span>! Ye did it again, gods bless ye!"},{"name":"LYNGSATH","text":"To 'ave the sultana 'erself praise yer cookin' as a taste of 'eaven... 'Ells, even I can't boast o' such a feat!"},{"name":"LYNGSATH","text":"The Admiral commends me fer trainin' such a fine culinarian, but I did no more'n teach ye what it means to be one. Make no mistake, 'twas <span class=\"emphasis\">you</span> what did all the 'ard work."},{"name":"LYNGSATH","text":"Ye've surpassed even meself fer fame, <span class=\"highlight\">Forename</span>. There ain't nothin' left I can tell ye what ye don't already ken. I'm prouder than I've got any right to be."},{"name":"LYNGSATH","text":"Nay, nay, 'tain't no modest accomplishment, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! An' from 'ere, ye'll go on to reach even greater 'eights in our craft. But wherever ye end up, always remember me words: it's passion what makes a culinarian."},{"name":"LYNGSATH","text":"With that passion close to yer 'eart, go an' put smiles on the faces o' folk with yer cookin'! Ye can be sure I'll keep strivin' to do the same!"},{"name":"SYSTEM","text":"This concludes the culinarian quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next culinarian quest will be available from Lyngsath."}],"reward":{"items":[{"id":2506},{"id":2927,"one":1},{"id":3713,"one":1},{"id":3934,"one":1},{"num":2,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":16}],"quests":[65805]},"next":[67579]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000899","obj":{"i":1000899,"n":"Rubh Epocan","l":29,"q":1}},{"type":"npc","id":"1000956","obj":{"i":1000956,"n":"Diving Dove","l":28,"q":4}},{"type":"npc","id":"1000962","obj":{"i":1000962,"n":"Cocorama","l":28,"q":1}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1001537","obj":{"i":1001537,"n":"Latisha","l":28,"q":6}},{"type":"npc","id":"1002079","obj":{"i":1002079,"n":"Gigiwazu","l":28,"q":3}},{"type":"npc","id":"1003277","obj":{"i":1003277,"n":"Rose","l":29,"q":1}},{"type":"item","id":"2506","obj":{"i":2506,"n":"Chantico","l":55,"c":35713,"t":26,"p":1000}},{"type":"item","id":"2927","obj":{"i":2927,"n":"Culinarian's Hat","l":55,"c":41144,"t":34}},{"type":"item","id":"3713","obj":{"i":3713,"n":"Culinarian's Mitts","l":55,"c":44194,"t":37}},{"type":"item","id":"3934","obj":{"i":3934,"n":"Culinarian's Gaiters","l":55,"c":46354,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"4647","obj":{"i":4647,"n":"Eft Steak","l":50,"c":24352,"t":46,"p":435}},{"type":"item","id":"4678","obj":{"i":4678,"n":"Beef Stew","l":50,"c":24110,"t":46,"p":415}},{"type":"item","id":"4715","obj":{"i":4715,"n":"Trapper's Quiche","l":50,"c":24252,"t":46,"p":376}},{"type":"item","id":"4713","obj":{"i":4713,"n":"Crowned Pie","l":50,"c":24057,"t":46}},{"type":"quest","id":"65805","obj":{"i":65805,"n":"A Taste of Home","g":143,"l":"Limsa Lominsa","s":450,"f":1}},{"type":"quest","id":"67579","obj":{"i":67579,"n":"Wait on Me","g":143,"l":"Limsa Lominsa","s":502,"f":1}}]}