{"quest":{"name":"Life, Materia and Everything","location":"The Waking Sands","id":65808,"patch":2.0,"sort":104,"icon":100075,"eventIcon":71201,"issuer":1005116,"target":1005116,"involved":[1001425],"genre":1,"journal":["Minfilia would like you to meet a distinguished individual.","Minfilia would like you to meet a goblin scholar named Mutamix, who she claims is responsible for introducing a revolutionary method of enhancing gear to Eorzea. Make your way to the goblin's encampment at the Bonfire in central Thanalan, and present Minfilia's dagger to him.","Arriving at the Bonfire, you are treated to a zany display by Mutamix and his students. Upon learning your identity, the knowledgeable goblin proceeds to teach you the basics of materia, a type of crystal which can be melded to items to enhance their properties. Assuming you understood correctly, only experienced Disciples of the Hand are capable of attaching these crystals. Take yourself back to the Waking Sands, and present Minfilia with her freshly enhanced dagger.","Minfilia impresses upon you the importance of being well equipped for battle, and encourages you to use materia to maximize the effectiveness of your gear. Keep her words in mind when preparing for the missions ahead."],"objectives":["Present Minfilia's dagger to Mutamix at the Bonfire.","Deliver the materia-enhanced dagger to Minfilia."],"dialogue":[{"name":"MINFILIA","text":"Though we seek a peaceful solution to the primal problem, we must needs be ready to fight for our cause. That you might take to the field suitably prepared, I would have you meet with a goblin acquaintance of mine. His name is Mutamix Bubblypots, and he is a scholar of no small repute."},{"name":"MINFILIA","text":"Mutamix is renowned for having introduced a revolutionary method of enhancing equipment to Eorzea."},{"name":"MINFILIA","text":"The knowledge of this method was once a closely guarded secret, but thanks to Mutamix and his students, it has now been disseminated to the great benefit of all the realm."},{"name":"MINFILIA","text":"It would serve you well to acquire an understanding of the process. For this purpose, I shall lend you a blade. Take it to Mutamix, and bid him use it to demonstrate his craft to you."},{"name":"MINFILIA","text":"Mutamix is ever to be found at his camp in central Thanalan─a place known as the Bonfire. Look for a pillar of smoke, and the way will become clear."},{"name":"MUTAMIX","text":"Pshhh... Shkohhh...?<br>Who is uplander come to tent-ring of Mutamix Bubblypots?"},{"name":"SWYNBROES","text":"Fighty-tool drinks in airyself."},{"name":"FHOBHAS","text":"When full of airyself, fighty-tool changes to stonyshine, name of <span class=\"emphasis\">materia</span>."},{"name":"KOKOSAMU","text":"If materia join with other fighty-tool..."},{"name":"MUTAMIX","text":"Then bigeyes! Fighty-tool gains power of airyself!"},{"name":"MUTAMIX","text":"Pshhh... Shkohhh...<br>Mutamix is reckoning that uplander is friend of Minfilia."},{"name":"MUTAMIX","text":"Yesss, tongueflaps reach ears of Mutamix with fastness."},{"name":"MUTAMIX","text":"Minfilia wants uplander to see power of materia. Uplander brings fighty-tool to Mutamix, yes?"},{"name":"MUTAMIX","text":"Shkohhh! Fighty-tool is unstrong as eating-tool! Make good teachy-show of power of materia!"},{"name":"SWYNBROES","text":"The materia, Master."},{"name":"MUTAMIX","text":"Now eyes of uplander point at fighty-tool, yes?<br>Pshhh... Shkohhh... Materia join with fighty-tool..."},{"name":"MUTAMIX","text":"Fighty-tool gains power of materia! Fighty-tool reborn! Here, uplander take fighty-tool to Minfilia!"},{"name":"SWYNBROES","text":"Materia, strictly speaking, is a kind of crystal. It is created by drawing out the aetheric constituents from a piece of equipment and then crystallizing them."},{"name":"FHOBHAS","text":"Not just any old equipment will serve, mind you. It must have sufficient <span class=\"emphasis\">spiritbond</span>─that being a measure of how fully an item has been imbued with its owner's spirit."},{"name":"KOKOSAMU","text":"When ye attach a piece o' materia to gear, ye imbue the host item with its power. That's how Master Mutamix turned that dagger o' yours from summat as would've struggled to cut steak into a weapon worth wieldin'."},{"name":"MUTAMIX","text":"Pshhh... Shkohhh...<br>Uplander wishes to be joiner of materia?"},{"name":"MUTAMIX","text":"Then uplander best fill braincase with knowings of crafty-making."},{"name":"MUTAMIX","text":"With knowings of crafty-making, uplander can become joiner of materia."},{"name":"MUTAMIX","text":"If uplander wants braincase to rattle with knowings of materia, uplander best trade tongueflaps with learny-ones of Mutamix."},{"name":"MINFILIA","text":"Welcome back, <span class=\"highlight\">Forename</span>. I trust your visit to the Bonfire proved fruitful."},{"name":"MINFILIA","text":"Ahhh...what a remarkable difference a single piece of materia can make! Granted, the skills needed to manipulate the substance are not easily acquired, but one need only look upon the results to realize such efforts are worthwhile."},{"name":"MINFILIA","text":"As I am sure you are aware, the quality of one's equipment can be the difference between victory and defeat. Materia may well give you the edge you need, <span class=\"highlight\">Forename</span>, so make it your ally."},{"name":"MINFILIA","text":"Now, it is time we discussed the matter of your next mission. Pray speak with me when you are ready to begin."}],"reward":{"gil":215,"items":[{"id":31329}],"xp":7840},"reqs":{"jobs":[{"lvl":19,"id":130}],"quests":[66110]},"next":[65688,65879,66999]},"partials":[{"type":"npc","id":"1005116","obj":{"i":1005116,"n":"Minfilia","l":356,"q":4}},{"type":"npc","id":"1001425","obj":{"i":1001425,"n":"Mutamix Bubblypots","l":43,"q":5}},{"type":"item","id":"31329","obj":{"i":31329,"n":"Level 18 Weapon Coffer","l":1,"c":26557,"t":61}},{"type":"quest","id":"66110","obj":{"i":66110,"n":"Dressed to Deceive","g":1,"l":"Eastern Thanalan","s":103}},{"type":"quest","id":"65688","obj":{"i":65688,"n":"Gone to Pieces","g":93,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"65879","obj":{"i":65879,"n":"Lord of the Inferno","g":1,"l":"The Waking Sands","s":105}},{"type":"quest","id":"66999","obj":{"i":66999,"n":"Marvelously Mutable Materia","g":93,"l":"Central Thanalan","s":190,"f":1}}]}