{"quest":{"name":"Pans of Steel","location":"Limsa Lominsa","id":65817,"patch":2.0,"sort":350,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1000947,"genre":138,"usedItems":[2502],"journal":["Forgemaster H'naanza wishes to assign you a new commission.","H'naanza is concerned that the growing animosity between you and Blanstyr will distract you from the improvement of your discipline. In order to focus your mind on more productive matters, the forgemaster has chosen you to craft the steel frypan requested by the eminent culinarian, Master Lyngsath. Once you have made a utensil of sufficient quality, deliver it to H'naanza for appraisal.","Your steel frypan has earned the praise of Forgemaster H'naanza. Deliver your finished work to Lyngsath at the Culinarians' Guild.","Master Lyngsath appears more than satisfied with your fine-quality frypan. You have joined Forgemaster H'naanza as one of the armorers whom the exacting culinarian is willing to trust in the forging of his cooking utensils.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 40."],"objectives":["Present a steel frypan <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to H'naanza.","Deliver the steel frypan <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Lyngsath."],"dialogue":[{"name":"HNAANZA","text":"Greetings, <span class=\"highlight\">Forename</span>. I hear word you bested Blanstyr in an armorer's contest of skill. An impressive feat, and one of which you should be proud."},{"name":"HNAANZA","text":"But I'm afraid you've made a most troublesome enemy, for he is both persistent and vindictive. As you well know, I speak from bitter experience on that matter."},{"name":"HNAANZA","text":"Rather than dwell on this unpleasant rivalry, however, I would have you focus on your craft. Ready your hammer and pliers, <span class=\"highlight\">Forename</span>─there is much and more to do!"},{"name":"HNAANZA","text":"Master Lyngsath over at the Bismarck has commissioned a new steel frypan. And, as one might expect of the head of the Culinarians' Guild, he accepts only the finest of wares."},{"name":"HNAANZA","text":"Now, compared to pounding out thick, protective plates of armor, cooking utensils─being generally smaller and lighter─require a somewhat more delicate touch. You must bring all of your concentration to bear, lest you risk ruining the entire piece with a single misplaced blow."},{"name":"HNAANZA","text":"In light of recent events, which have no doubt left your mind scattered, I believe a task that fully engages your faculties will prove beneficial."},{"name":"HNAANZA","text":"Let us not keep Master Lyngsath waiting, <span class=\"highlight\">Forename</span>. To the forge with you."},{"name":"HNAANZA","text":"Where is that frypan, <span class=\"highlight\">Forename</span>? It is true that you are no longer some rank novice, but do not think your posterior safe from the toe of my boot if you choose to dither and dally!"},{"name":"HNAANZA","text":"Truly, another consummate work. I can find no flaw with its weight or balance; it is not so heavy as to be a struggle to lift, yet it remains sturdy enough to endure the frantic pace of the Bismarck's kitchens."},{"name":"HNAANZA","text":"I trust at this juncture that you comprehend in full my earlier warning─to produce a frypan of this quality would most certainly have required your undivided attention. And I can tell this item received just that─the consistency of the metal's thickness is all the evidence one needs."},{"name":"HNAANZA","text":"This type of precision should not be undervalued. In this case, should the frypan be poorly forged, the heat of its cooking surface will be uneven...and such flaws are unacceptable to an exacting culinarian such as Master Lyngsath."},{"name":"HNAANZA","text":"Even the sturdiest of utensils, however, rarely last him more than a few seasons. It is a struggle to find armorers who can meet his demanding specifications when he turns to our guild for replacements."},{"name":"HNAANZA","text":"I had long intended to assign this commission to you, but your encounter with Blanstyr had me doubting your ability to concentrate. This is one of those rare occasions when I am happy to be proven wrong."},{"name":"HNAANZA","text":"Your uncompromising attention to detail continues to be an inspiration to your colleagues. Ah, and speaking of details, there is one that remains untended: delivering this frypan into Master Lyngsath's hands. I trust you do not need directions to the Culinarians' Guild."},{"name":"LYNGSATH","text":"Ye've come to deliver me new frypan, 'ave ye?"},{"name":"LYNGSATH","text":"Well, now, ain't she a beauty! With this pan, I'll be able to whip up all sorts o' dishes an' not fret about burnin' the middle or undercookin' the edges. Ye say this was <span class=\"emphasis\">yer</span> work?"},{"name":"LYNGSATH","text":"Only the forgemaster 'erself 'as ever been able to make utensils what I'd consider worthy o' the Bismarck. Seems like I finally got me another <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> I can trust. Yer welcome in me kitchen any time, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."}],"reward":{"items":[{"id":2374},{"id":2769,"one":1},{"id":3130,"one":1},{"id":3607,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":11}],"quests":[65816]},"next":[65818]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"item","id":"2374","obj":{"i":2374,"n":"Steel Doming Hammer","l":34,"c":35207,"t":16,"p":3951}},{"type":"item","id":"2769","obj":{"i":2769,"n":"Mythril Magnifiers","l":34,"c":40901,"t":34,"p":2953}},{"type":"item","id":"3130","obj":{"i":3130,"n":"Apprentice's Smock","l":36,"c":42185,"t":35}},{"type":"item","id":"3607","obj":{"i":3607,"n":"Linen Halfgloves","l":33,"c":44161,"t":37,"p":2195}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"2502","obj":{"i":2502,"n":"Steel Frypan","l":39,"c":35709,"t":26,"p":4551}},{"type":"quest","id":"65816","obj":{"i":65816,"n":"May the Best Armorer Win","g":138,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"65818","obj":{"i":65818,"n":"Best of Three","g":138,"l":"Limsa Lominsa","s":400,"f":1}}]}