{"quest":{"name":"The Base Fundamentals","location":"Limsa Lominsa","id":65812,"patch":2.0,"sort":100,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001009,"genre":138,"usedItems":[5071],"journal":["Forgemaster H'naanza wants you to assist a novice armorer who is struggling with the basics of the craft.","Granae, a novice armorer, has fallen behind in her task of forging bronze plate. To supplement Granae's work, Forgemaster H'naanza has requested that you craft twelve sheets of bronze plate and deliver them directly to the novice, hoping that your good example might inspire her to display similar diligence.","You have delivered the bronze plate to Granae. Her head swimming with visions of the fantastic armor she would forge, it seems the novice deemed her more mundane─though equally important─tasks unworthy of her time and effort. The sight of your exacting work, however, has convinced her otherwise. After promising to improve on her fundamental techniques, Granae suggests that you seek out T'mokkri at the Drowning Wench and try your hand at a few tradecraft leves.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 15."],"objectives":["Deliver sheets of bronze plate to Granae."],"dialogue":[{"name":"HNAANZA","text":"Ah, <span class=\"highlight\">Forename</span>. Just the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> I was hoping to see."},{"name":"HNAANZA","text":"I have a new initiate that has near exhausted my reserves of patience, and I think she would benefit from seeing the results of a peer's dedication and skill─specifically, yours."},{"name":"HNAANZA","text":"Her name is Granae, and, Builder help me, she is the most distracted, fumble-fingered craftswoman ever to lift a hammer."},{"name":"HNAANZA","text":"If she could but learn to forge the simplest of items without constant supervision, I would consider it a rare victory."},{"name":"HNAANZA","text":"&lt;sigh&gt; It is unfortunate that Byregot did not see fit to invest all of my armorers with your innate talents..."},{"name":"HNAANZA","text":"But I suppose we must all start somewhere─and if I abandoned every initiate that was slow to grasp a technique, our guild would have a grand total of, what, <span class=\"emphasis\">nine</span> members? Mayhap ten. I jest...but 'twould be few enough for our clients in the Maelstrom to have to share breastplates."},{"name":"HNAANZA","text":"So what say you, <span class=\"highlight\">Forename</span>? You need only craft a dozen sheets of bronze plate to supplement Granae's own."},{"name":"HNAANZA","text":"When they are ready, I want you to deliver them to the lass in person. Mayhap your example will inspire her to take more care with her work."},{"name":"GRANAE","text":"Oh, you must be <span class=\"highlight\">Forename</span>! The guildmaster told me you'd be─ Wait, where did I put my hammer? Ah, there it is! Sorry, what were you saying? Right, yes─I would be most grateful for the extra sheets of bronze plate."},{"name":"GRANAE","text":"Gods...did you craft these yourself? Why, they are absolutely─ Whoa! Nearly dropped them! No harm done, though!"},{"name":"GRANAE","text":"As I was saying, I can certainly see why the forgemaster speaks so highly of your work."},{"name":"GRANAE","text":"The bronze is the perfect color and thickness, so I assume you carefully measured out the amounts of tin and copper...? I always add too much tin. Did you know metal can <span class=\"emphasis\">shatter</span>?"},{"name":"GRANAE","text":"Well, I didn't. Truth be told, I've tended to put all my effort into making the armor itself, rather than bothering with the base materials. I mean, compared to hammering out glorious winged helms or ornate greaves, measuring out metals just seemed so...trivial."},{"name":"GRANAE","text":"But looking at your work, I'm beginning to wonder... I never realized how beautiful a simple sheet of bronze could be..."},{"name":"GRANAE","text":"With materials like this, just imagine the sturdy, shiny suits of armor one might create!"},{"name":"GRANAE","text":"It seems I've been putting the cart before the chocobo. From this moment onwards, I swear to focus all my attention and care on the task at hand. Even if the task at hand is forging bronze ingots."},{"name":"GRANAE","text":"And what of you, <span class=\"highlight\">Forename</span>? Do you have any grand projects waiting for you on the anvil?"},{"name":"GRANAE","text":"I overheard some of the senior armorers boasting about the coin they made through tradecraft leves. Might that be something you'd consider?"},{"name":"GRANAE","text":"They say T'mokkri over at the Drowning Wench is the one to talk to. And that's where I'll be heading once I improve my technique! Now where did I put that hammer...?"}],"reward":{"gil":289,"items":[{"num":250,"id":3},{"num":200,"id":5},{"id":2367},{"id":2660,"one":1},{"id":3014,"one":1},{"id":3536,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":11}],"quests":[65811]},"next":[65813]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001009","obj":{"i":1001009,"n":"Granae","l":28,"q":1}},{"type":"item","id":"2367","obj":{"i":2367,"n":"Bronze Doming Hammer","l":8,"c":35201,"t":16,"p":268}},{"type":"item","id":"2660","obj":{"i":2660,"n":"Amateur's Headgear","l":10,"c":40420,"t":34,"p":283}},{"type":"item","id":"3014","obj":{"i":3014,"n":"Amateur's Kurta","l":9,"c":42233,"t":35,"p":246}},{"type":"item","id":"3536","obj":{"i":3536,"n":"Amateur's Smithing Gloves","l":10,"c":44071,"t":37,"p":252}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5071","obj":{"i":5071,"n":"Bronze Plate","l":3,"c":20953,"t":49,"p":32}},{"type":"quest","id":"65811","obj":{"i":65811,"n":"From Thigh to Neck","g":138,"l":"Limsa Lominsa","s":50,"f":1}},{"type":"quest","id":"65813","obj":{"i":65813,"n":"One's Own Worst Critic","g":138,"l":"Limsa Lominsa","s":150,"f":1}}]}