{"quest":{"name":"May the Best Armorer Win","location":"Limsa Lominsa","id":65816,"patch":2.0,"sort":300,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001001,"involved":[1002107],"genre":138,"usedItems":[3096],"journal":["In a bid to quell mutinous murmurings within the guild, Forgemaster H'naanza has decided to entrust you with a prestigious commission.","H'naanza has asked you to undertake the commission of a wealthy and highly respected client on her behalf. To learn more about the job, make your way to the Fishermen's Guild and seek out Nortyrwyb, the customer's maidservant.","Upon arriving at the Fishermen's Guild, a rather nonplussed Nortyrwyb explains that Blanstyr has already accepted her master's commission as the armorers' appointed representative. Clearly, there has been some sort of misunderstanding... Track the veteran craftsman down and attempt to resolve the matter.","In order to decide who should have the honor of taking the commission, Blanstyr proposes a contest of skill. Craft an all-surpassing suit of steel chainmail and deliver it to the Roegadyn artisan for appraisal alongside his own work.","Blanstyr is both impressed and dismayed by the quality of your chainmail. Though he admits defeat, it is plain that the old artisan has no intention of putting the matter behind him. You have acquired a bitter rival this day. Continue to strive for mastery over your craft and prepare yourself for the inevitable confrontation to come.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 35."],"objectives":["Speak with Nortyrwyb.","Speak with Blanstyr.","Deliver a suit of steel chainmail <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Blanstyr."],"dialogue":[{"name":"HNAANZA","text":"Ah, <span class=\"highlight\">Forename</span>. The <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> whose name is on everyone's lips. In case you didn't know, the entire guild seems to be holding its breath, waiting to see which side you'll come down on."},{"name":"HNAANZA","text":"The popular opinion is that you're ready to take up with Blanstyr."},{"name":"HNAANZA","text":"I have no such concerns, of course. Had you resolved to distance yourself from me, we would not be having this conversation."},{"name":"HNAANZA","text":"But that does not change the fact that your allegiance remains a subject of public debate─one which threatens the unity of the guild."},{"name":"HNAANZA","text":"I propose you dispel our colleagues' unfounded anxiety by demonstrating your affiliation in a manner that none may doubt or dispute."},{"name":"HNAANZA","text":"Specifically, I would have you accept the commission of a valued client on my behalf. That, I think, would serve as proof of both my faith in you, and of your support for the guild's present course."},{"name":"HNAANZA","text":"Tell me, how would you like to try your hand at crafting a suit of steel chainmail?"},{"name":"HNAANZA","text":"The order comes from a resident of Costa del Sol─an extremely wealthy and discerning gentleman who will accept nothing less than the finest-quality armor. As you may imagine, his patronage is of <span class=\"emphasis\">great</span> value to the guild. I need hardly add that I would not entrust this commission to an armorer in whom I had aught less than the utmost faith."},{"name":"HNAANZA","text":"The client's maidservant, Nortyrwyb, will supply you with the finer details of the order. She should be here in the city, conducting business at the Fishermen's Guild as we speak."},{"name":"NORTYRWYB","text":"Greetings and salutations! What an honor it is to meet another of Limsa Lominsa's famed artisans!"},{"name":"NORTYRWYB","text":"...I'm sorry? A commission? Oh dear, there seems to be some confusion..."},{"name":"NORTYRWYB","text":"I have already entrusted my master's commission to a veteran craftsman of your esteemed organization."},{"name":"NORTYRWYB","text":"You are acquainted with Blanstyr? H-His reputation precedes him, you see, and I saw little reason to doubt that a man of his experience should be assigned the task... Oh, b-but I do not mean to suggest that you─ Ahem. I merely sought to justify my own misapprehension."},{"name":"NORTYRWYB","text":"Regrettable though this situation may be, I would hesitate to shame your colleague by stripping him of his commission─given all the sterling work he has done for us in the past, I mean..."},{"name":"NORTYRWYB","text":"Yet I can well imagine that you are loath to return to your superior empty-handed."},{"name":"NORTYRWYB","text":"Hmmm... Assuming the finished armor is of exceptional quality, my master will provide full remuneration regardless of the hand that forges the links."},{"name":"NORTYRWYB","text":"Mayhap it would be best for all concerned if you discussed the matter with your fellow armorer."},{"name":"BLANSTYR","text":"Well, if it ain't H'naanza's lapdog. Aye, I heard about yer little show of allegiance."},{"name":"BLANSTYR","text":"Hmph. I s'pose Nortyrwyb told ye I snatched that commission from right under yer nose, did she? Heh. Seems we got ourselves a thorny little predicament, don't it?"},{"name":"BLANSTYR","text":"Well, I ain't about to hand the job back to ye on a silver bleedin' platter.<br>...But that don't mean I want ye to give up, neither."},{"name":"BLANSTYR","text":"Don't ye see? This is the perfect chance to find out who's the better armorer─to see which of us has walked the right an' proper path."},{"name":"BLANSTYR","text":"I'm talkin' about a contest o' skill, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Whichever of us crafts the finer suit o' chainmail gets the job."},{"name":"BLANSTYR","text":"But remember: this bloke pays good coin for a reason. He wants the <span class=\"emphasis\">best</span>, an' he ain't about to settle for less. Not that he'll have to, o' course─yer armor'd need to be bloody <span class=\"emphasis\">flawless</span> to be better'n mine, so our mate'll be gettin' his money's worth whatever happens."},{"name":"BLANSTYR","text":"Once yer ready, bring yer armor back here an' we'll lay it out next to mine. We've both got our pride, so I reckon we can judge the results fairly for ourselves."},{"name":"BLANSTYR","text":"Now bugger off!"},{"name":"BLANSTYR","text":"Well? Pressure too much for ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Or have ye finally finished puttin' that chainmail together?"},{"name":"BLANSTYR","text":"Right then─let's have a look, shall we?"},{"name":"BLANSTYR","text":"&lt;gulp&gt; By Byregot's beard! Where'd ye learn to forge links like that!? It's...it's bloody perfect!"},{"name":"BLANSTYR","text":"Rhalgr Himself would struggle to stick a dagger through that steel. An' look at that luster... Strength an' beauty in equal godsdamned measure!"},{"name":"BLANSTYR","text":"H'naanza should be praisin' the Builder for droppin' a gift like yerself in her lap."},{"name":"BLANSTYR","text":"Ye won fair an' square, <span class=\"highlight\">Forename</span>. I'll not bother to lecture ye no more."},{"name":"BLANSTYR","text":"I'll take yer beauteous bloody chainmail to Nortyrwyb meself an' let her know who it was as crafted it."},{"name":"BLANSTYR","text":"That's an old tradition among us armorers, 'case ye didn't know. The loser o' these contests gets the job o' deliverin' the victor's goods."},{"name":"BLANSTYR","text":"...Bah! Gloat while ye can, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Ye just joined H'naanza at the top o' me list. This ain't over─not by a long shot."}],"reward":{"gil":639,"items":[{"id":2373},{"id":2750,"one":1},{"id":3104,"one":1},{"id":3583,"one":1},{"num":2,"id":5825,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":11}],"quests":[65815]},"next":[65817]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1002107","obj":{"i":1002107,"n":"Nortyrwyb","l":29,"q":1}},{"type":"item","id":"2373","obj":{"i":2373,"n":"Wrapped Iron Raising Hammer","l":29,"c":35206,"t":16,"p":2776}},{"type":"item","id":"2750","obj":{"i":2750,"n":"Velveteen Beret","l":29,"c":41032,"t":34}},{"type":"item","id":"3104","obj":{"i":3104,"n":"Velveteen Gown","l":30,"c":42071,"t":35,"p":2499}},{"type":"item","id":"3583","obj":{"i":3583,"n":"Velveteen Shortgloves","l":28,"c":44081,"t":37,"p":1453}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3096","obj":{"i":3096,"n":"Steel Chainmail","l":28,"c":43082,"t":35,"p":3037}},{"type":"quest","id":"65815","obj":{"i":65815,"n":"Showing Your Steel","g":138,"l":"Limsa Lominsa","s":250,"f":1}},{"type":"quest","id":"65817","obj":{"i":65817,"n":"Pans of Steel","g":138,"l":"Limsa Lominsa","s":350,"f":1}}]}