{"quest":{"name":"From Thigh to Neck","location":"Limsa Lominsa","id":65811,"patch":2.0,"sort":50,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001000,"genre":138,"usedItems":[2226],"journal":["Forgemaster H'naanza seeks your assistance in fulfilling a customer's order.","It seems an ambitious young armorer by the name of Swithin has overreached himself by accepting an order for a quantity of shields which he plainly cannot produce in the allotted time. Keen to uphold the reputation of the Armorers' Guild, H'naanza has instructed you to help fulfill the order by crafting three bronze hoplons. Synthesize the requested items and deliver them to the forgemaster.","Forgemaster H'naanza is impressed by the quality of your shields, and deems you ready to wield the second weapon in the armorer's arsenal: pliers. Thus equipped, continue to hone your skills, and thereby increase your value to the Armorers' Guild.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 10."],"objectives":["Deliver bronze hoplons to H'naanza."],"dialogue":[{"name":"HNAANZA","text":"Ah, <span class=\"highlight\">Forename</span>. I take it you are now intimate with every aspect of the bronze ingot's production?"},{"name":"HNAANZA","text":"Good. Then you can assist us in a pressing matter."},{"name":"HNAANZA","text":"It seems that one of our younger members, Swithin, accepted an order which he would struggle to fulfill in <span class=\"emphasis\">thrice</span> the time he promised. While I am tempted to let him squeal under the weight of his own ambition, the guild is not in the habit of delivering late."},{"name":"HNAANZA","text":"Several veteran armorers have volunteered their services, but I would also like you to assist in this matter. On the one hand, you will be helping to spare the guild unnecessary embarrassment, and on the other, you will be deepening your understanding of the craft. The Builder could not have planned it better."},{"name":"HNAANZA","text":"For your part in this endeavor, you are to craft three bronze hoplons. You'll need bronze plate and maple lumber to make the shields."},{"name":"HNAANZA","text":"While we're on the subject, how have you been acquiring your materials? The markets are a reliable source, but have you considered making an arrangement with a miner or botanist?"},{"name":"HNAANZA","text":"As you will have gleaned, the craft calls for a near constant supply of copper and tin, both of which are commonly mined in the region of Thanalan. Should your purse grow too light for comfort, there is little to stop you taking up a pickaxe yourself."},{"name":"HNAANZA","text":"For the time being, however, I want you to concentrate on honing your skills as an armorer. With the fundamentals under your belt, hoplons shouldn't prove too challenging."},{"name":"HNAANZA","text":"But do <span class=\"emphasis\">not</span> fall into the trap of complacency. A poorly wrought shield is worse than no shield at all. Each piece you craft, however simple, must reflect the utmost attention to detail. Make the guild proud, <span class=\"highlight\">Forename</span>."},{"name":"HNAANZA","text":"How fare you with your task? Do you have those three hoplons for me?"},{"name":"HNAANZA","text":"...Impressive. You have managed to balance the conflicting requirements of sturdiness and portability...much as you balanced hardness and malleability in your first task."},{"name":"HNAANZA","text":"The bronze plate is securely fitted and should weather the most vicious blows without becoming dislodged."},{"name":"HNAANZA","text":"And, importantly, your work was swift and sure. Many an armorer has lost a sale due to late delivery. And rightly so. A customer's need for armor is invariably pressing, and its absence like to be sorely felt."},{"name":"HNAANZA","text":"Given the stakes, a reputation for reliability can mean handsome profits, especially at a time when the Maelstrom is seeking armorers to outfit its ever-expanding ranks."},{"name":"HNAANZA","text":"It is all we can do to keep pace with the Grand Company's orders for equipment. And that is why every member of our guild must support the next, much as the warriors of eld supported their fellows in the phalanx with their shields."},{"name":"HNAANZA","text":"Though you have but recently begun your training, a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your natural talents belongs on the front line. I think the time has come for you to learn the use of another weapon in the armorer's arsenal."},{"name":"HNAANZA","text":"Specifically, pliers. Take this pair and try using them in combination with your hammer."},{"name":"HNAANZA","text":"It will feel strange at first, but persist and you will find that your work proceeds a damn sight more smoothly. When you think you've mastered the pliers, I'll want to see the results of your dedication. Until then, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">craftsmanship</span>, <span class=\"highlight\">control</span>, and <span class=\"highlight\">CP</span> values."},{"name":"SYSTEM","text":"A higher craftsmanship rating hastens the progress of synthesis; greater control increases the chance of creating high-quality items; and additional CP improves your crafting stamina."},{"name":"SYSTEM","text":"Outfitting yourself with an eye to your current objective will increase the efficiency of your crafting endeavors."}],"reward":{"gil":194,"items":[{"num":200,"id":3},{"num":150,"id":5},{"id":2380},{"id":2652,"one":1},{"id":3309,"one":1},{"id":3763,"one":1},{"num":3,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":11}],"quests":[65810]},"next":[65812]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"item","id":"2380","obj":{"i":2380,"n":"Amateur's Pliers","l":5,"c":35251,"t":17,"p":129}},{"type":"item","id":"2652","obj":{"i":2652,"n":"Hempen Bandana","l":5,"c":41540,"t":34,"p":85}},{"type":"item","id":"3309","obj":{"i":3309,"n":"Hempen Chausses","l":5,"c":45048,"t":36,"p":94}},{"type":"item","id":"3763","obj":{"i":3763,"n":"Maple Pattens","l":5,"c":46122,"t":38,"p":129}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"2226","obj":{"i":2226,"n":"Bronze Hoplon","l":8,"c":30021,"t":11,"p":420}},{"type":"quest","id":"65810","obj":{"i":65810,"n":"My First Doming Hammer","g":138,"l":"Limsa Lominsa","s":11,"f":1}},{"type":"quest","id":"65812","obj":{"i":65812,"n":"The Base Fundamentals","g":138,"l":"Limsa Lominsa","s":100,"f":1}}]}