{"quest":{"name":"One's Own Worst Critic","location":"Limsa Lominsa","id":65813,"patch":2.0,"sort":150,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001000,"involved":[1001001,1001011],"genre":138,"usedItems":[2680,2231],"journal":["Forgemaster H'naanza wishes you to offer a sympathetic ear to a novice armorer.","H'naanza is concerned about one of her more diligent novices who is uncharacteristically late with an order. Speak with Dyrstwyda at the Armorers' Guild and learn what has caused the delay.","It seems that after being subjected to some withering criticism from Blanstyr, a veteran armorer, Dyrstwyda has lost confidence in her ability. Speak with Blanstyr at the Armorers' Guild and discover what prompted his scathing remark.","Before Blanstyr will discuss what prompted him to criticize Dyrstwyda, he demands that you prove your ability as an armorer. Synthesize a decorated bronze barbut and a bronze buckler and deliver them to the veteran artisan.","You have delivered the requested pieces to Blanstyr, and thereby earned his grudging respect. Rather than explain his criticism of Dyrstwyda's work, he instead insists that you tell the crestfallen novice to learn to examine her own flaws or turn her back on the forge for good. Return to Dyrstwyda with Blanstyr's “advice.”","After hearing Blanstyr's advice, Dyrstwyda seems even more inclined to abandon her dream of becoming a master armorer. Perhaps it wasn't such a good idea to recount his words so faithfully... Return to Forgemaster H'naanza and apprise her of the situation.","H'naanza reveals that she and Blanstyr were once apprenticed to the same master, but that an irreconcilable difference of opinion has kept the two armorers at odds for many years. Loath to allow their old rivalry to undermine the unity of the guild, H'naanza pledges to think upon what can be done to resolve the matter once and for all. Continue to hone your skills as an armorer that you might provide support to the forgemaster when the time comes.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 20."],"objectives":["Speak with Dyrstwyda.","Speak with Blanstyr.","Deliver a decorated bronze barbut and a bronze buckler to Blanstyr.","Return to Dyrstwyda.","Report to Forgemaster H'naanza."],"dialogue":[{"name":"HNAANZA","text":"Where have you been, <span class=\"highlight\">Forename</span>? There's work to be done!"},{"name":"HNAANZA","text":"I need you to speak with another novice─a lass by the name of Dyrstwyda."},{"name":"HNAANZA","text":"I was due a barbut and a buckler from her a few bells ago, but I find myself standing here with nary a noseguard."},{"name":"HNAANZA","text":"Lest you wonder, Dyrstwyda is nothing like Granae. She's as dedicated to the craft as you are, and I've <span class=\"emphasis\">never</span> known her to miss a delivery."},{"name":"HNAANZA","text":"Something must be amiss, and I need to find out what. I'd go and ask her myself, but I fear my usual approach would do more harm than good. The lass might be built like a stack of anvils, but she flinches at the merest hint of criticism..."},{"name":"HNAANZA","text":"That's why I've decided to assign you as Dyrstwyda's supervisor for this job. I'm counting on you to sort this out, <span class=\"highlight\">Forename</span>."},{"name":"DYRSTWYDA","text":"A p-pleasure to meet you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I'm sorry the forgemaster had to interrupt your work so that you might assist me with mine."},{"name":"DYRSTWYDA","text":"I do hope you're not angry. I don't know if I could endure another dressing-down..."},{"name":"DYRSTWYDA","text":"...As pathetic as it sounds, that's actually the reason my delivery is late. I just can't bring myself to work... &lt;sigh&gt; I'm sorry. I should start from the beginning."},{"name":"DYRSTWYDA","text":"A short while ago, I received a visit from an armorer by the name of Blanstyr. He is one of the old guard─a true veteran of the guild."},{"name":"DYRSTWYDA","text":"After but a single glance at the armor I had made, he y-yelled that my work wasn't fit to “cover a kobold's arse.”"},{"name":"DYRSTWYDA","text":"And now I cannot banish the scene from my mind. His face twisted in anger, those scornful words... Am I truly so talentless?"},{"name":"DYRSTWYDA","text":"The shame, it...it paralyzes me. If he had explained the flaws in my work, I might endeavor to correct them."},{"name":"DYRSTWYDA","text":"But I couldn't bring myself to speak to him...or to anyone else, for that matter. Not until now."},{"name":"DYRSTWYDA","text":"M-Might you speak with Blanstyr on my behalf? I would know the reason behind this...this reprimand."},{"name":"BLANSTYR","text":"Aye, I'm Blanstyr. If yer lookin' for an armorer with skill an' integrity, ye've found him. What're ye after, then?"},{"name":"BLANSTYR","text":"...Eh? Ye want to know what's amiss with Dyrstwyda's work? Hmph. One o' the guild's newer faces, are ye?"},{"name":"BLANSTYR","text":"All these whelps trainin' under H'naanza get their heads filled with daft bloody notions o' cooperation an' camaraderie when what they should be learnin' is how to use a pair o' pliers."},{"name":"BLANSTYR","text":"I've yet to meet one o' her novices as could forge an ingot worth a damn. An' them as ain't got the skill ain't worth me time. Which means <span class=\"emphasis\">you</span>, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Now bugger off."},{"name":"BLANSTYR","text":"Not budgin', eh? <span class=\"alternative-container\"><span class=\"alternative\">Wearisome wench</span><span class=\"alternative\">Stubborn sod</span></span>. All right then, tell ye what: I'll give ye one chance to prove yerself."},{"name":"BLANSTYR","text":"Let's see ye craft the same pieces as yer friend made such a meal of."},{"name":"BLANSTYR","text":"A decorated bronze barbut and a bronze buckler, it were. An' if they're half-decent, we'll have ourselves a nice little chat."},{"name":"DYRSTWYDA","text":"\"Or hang up my bloody hammer“?<br>Well...thank you for passing on Blanstyr's...<span class=\"emphasis\">advice</span>."},{"name":"DYRSTWYDA","text":"I... I believe I understand what he means to say. B-But not everyone has the inner fortitude to endure such criticism─be it from oneself or from others."},{"name":"DYRSTWYDA","text":"If such strength is required to master the armorer's art, then mayhap I have mistaken my calling."},{"name":"DYRSTWYDA","text":"I joined the guild with the dream of following in H'naanza's footsteps, but I see now that was folly."},{"name":"DYRSTWYDA","text":"I shall have to think long and hard about my aspirations. Please convey my apologies to the forgemaster for the delay..."},{"name":"HNAANZA","text":"Ah, so it was Blanstyr that caused this mess. The old bastard always did take it upon himself to weed out the weaker initiates."},{"name":"HNAANZA","text":"We're not exactly on the best of terms, he and I...even after all this time."},{"name":"HNAANZA","text":"I've known Blanstyr since we were naught but wide-eyed novices, serving our apprenticeships under the same master."},{"name":"HNAANZA","text":"We always had our differences, but when our master retired, they became that much more stark. And when we both put ourselves forward for the role of forgemaster, the resulting contest drove a permanent wedge between us."},{"name":"HNAANZA","text":"Blanstyr's arguments are not entirely without merit, but neither is his approach the only way to train new armorers."},{"name":"HNAANZA","text":"For that damnable curmudgeon, though, it's his way or no way at all. The idea of nurturing aught less than gods-given talent is anathema to him, and his ears wax deaf at the mere mention of it. But outfitting an army is the work of more than a talented few─it is the work of <span class=\"emphasis\">many</span> hands acting in unison."},{"name":"HNAANZA","text":"I have turned a blind eye to Blanstyr's behavior until now, but if he would threaten the unity of this guild, something must needs be done. I will think on it."},{"name":"BLANSTYR","text":"Bring me a decorated bronze barbut and a bronze buckler or ye'll get naught outta me save curses, ye weepin' sack o' Sahagin shite."},{"name":"BLANSTYR","text":"Back at last, are ye? I was beginnin' to think ye'd crawled off to Ul'dah to buy the damn things from a back-alley peddler. Anyroad, let's have a look, shall we?"},{"name":"BLANSTYR","text":"...Bugger me. Are you <span class=\"emphasis\">sure</span> ye made these yerself?"},{"name":"BLANSTYR","text":"Huh! Seems at least <span class=\"emphasis\">one</span> o' H'naanza's whelps knows the difference 'twixt hammer an' sledge. Builder take me, ye've some talent, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"BLANSTYR","text":"This barbut well shows the character o' yer work: precise an' uncompromisin', as it should be."},{"name":"BLANSTYR","text":"Ye've realized that forgin' a helm ain't a matter o' slappin' a few molded sheets o' bronze together. Nice."},{"name":"BLANSTYR","text":"An' yer buckler's just as good. Small an' light, but a damn sight sturdier than shields twice the size."},{"name":"BLANSTYR","text":"Didn't expect to be sayin' this, but I'm impressed. With this level o' quality an' polish, ye could make a tidy livin' for yerself as an artisan."},{"name":"BLANSTYR","text":"But yer the exception as proves the rule, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Fact is, the other novices ain't fit to lick yer boots─Dyrstwyda included. So you tell her this from me..."},{"name":"BLANSTYR","text":"If ye've the time to wallow in wounded tears, ye've the time to examine yer own mistakes. There's no room in this world for craftsmen as can't criticize their own handiwork. So learn how to gauge yer failin's an' correct 'em, or hang up yer bloody hammer."}],"reward":{"gil":382,"items":[{"id":2382},{"id":3019,"one":1},{"id":3779,"one":1},{"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":11}],"quests":[65812]},"next":[65814]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1001011","obj":{"i":1001011,"n":"Dyrstwyda","l":28,"q":1}},{"type":"item","id":"2382","obj":{"i":2382,"n":"Recruit's Pliers","l":17,"c":35251,"t":17}},{"type":"item","id":"3019","obj":{"i":3019,"n":"Hempen Doublet Vest of Crafting","l":12,"c":42116,"t":35,"p":436}},{"type":"item","id":"3779","obj":{"i":3779,"n":"Ash Pattens","l":15,"c":46123,"t":38,"p":432}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"2680","obj":{"i":2680,"n":"Decorated Bronze Barbut","l":17,"c":40009,"t":34,"p":672}},{"type":"item","id":"2231","obj":{"i":2231,"n":"Bronze Buckler","l":14,"c":30004,"t":11,"p":598}},{"type":"quest","id":"65812","obj":{"i":65812,"n":"The Base Fundamentals","g":138,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65814","obj":{"i":65814,"n":"An Armorer's Pride","g":138,"l":"Limsa Lominsa","s":200,"f":1}}]}