{"quest":{"name":"Best of Three","location":"Limsa Lominsa","id":65818,"patch":2.0,"sort":400,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001001,"genre":138,"usedItems":[3149],"journal":["Forgemaster H'naanza has an announcement for you.","You learn from H'naanza that Blanstyr has challenged you to a formal contest of skill. Seek out the Roegadyn in his usual haunt, and find out what this challenge entails.","Blanstyr has proposed a three-round contest to decide once and for all who is the superior armorer. For the first round, you are to craft a high-quality mythril cuirass, and present it to H'naanza for appraisal.","H'naanza has determined that the mythril cuirass you have crafted is the superior piece. Take the armor to Blanstyr, and inform him of the forgemaster's decision.","After appraising your mythril cuirass for himself, Blanstyr is forced to admit defeat. Far from being discouraged, however, the veteran armorer seems eager to pit his skills against you in the next round of the contest.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 45."],"objectives":["Speak with Blanstyr.","Present a mythril cuirass <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to H'naanza.","Deliver the mythril cuirass <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Blanstyr."],"dialogue":[{"name":"HNAANZA","text":"I hope you're feeling competitive, <span class=\"highlight\">Forename</span>, for Blanstyr has submitted a formal challenge. It seems he means to recover the pride you cost him with your previous victory."},{"name":"HNAANZA","text":"&lt;sigh&gt; He is as an overgrown, sulky child who sees his fellow colleagues as naught more than rivals. In his tiny world, all that matters is who is the best, who is the brightest, and who is the most able to provide immediate value to the guild."},{"name":"HNAANZA","text":"Now, I would be lying if I said I did not also take such factors into account; you well know my demand for excellence. But the methods we take to reach it differ vastly. Blanstyr would run a guild of exclusion, one in which an adventurer like yourself would have been unwelcome. The lack of sense in that is clear."},{"name":"HNAANZA","text":"He may be my equal in skill and technique, but it is this narrow perspective that weighed the balance against him in our contest for the guildmaster's chair."},{"name":"HNAANZA","text":"I won, and he lost. That simple fact plays an enormous role in the enmity that now lies between us. And I'm certain that past defeat is no small part of what fuels Blanstyr's present desire to prove himself <span class=\"emphasis\">your</span> better."},{"name":"HNAANZA","text":"I regret that this ridiculous feud has drawn you into its bitter maw. But if it means seeing that stubborn old dodo put in his place, then I'm just childish enough myself to encourage you to accept."},{"name":"HNAANZA","text":"Blanstyr awaits you in his usual haunt. Go to him, and show you've the steel to pick up the gauntlet he's thrown down."},{"name":"BLANSTYR","text":"I've had just about enough o' H'naanza's coddlin' ways. She's raisin' a generation o' slackjaws what <span class=\"emphasis\">look</span> like armorers, but ain't fit to wipe the soot from a proper craftsman's backside."},{"name":"BLANSTYR","text":"Before ye know it, folk'll start losin' trust in the trade itself. Years o' pride an' tradition are crumblin' to dust around our feet!"},{"name":"BLANSTYR","text":"'Course, ever since ye bested me in our little competition, me words don't carry the weight they once did..."},{"name":"BLANSTYR","text":"Seems like I've got to take ye down a few pegs afore I can start puttin' things aright. Aye, the world needs to know that ol' Blanstyr's not to be beaten by one o' H'naanza's lot─even if it were her prize pup!"},{"name":"BLANSTYR","text":"We'll settle this the old-fashioned way: a three-round contest o' skill. There ain't no point in draggin' this out, so let's get straight to the challenge for the first round─the finest mythril cuirass ye can forge!"},{"name":"BLANSTYR","text":"Since I'll be choosin' the tasks, we'll leave the appraisal of our work to yer precious forgemaster. I'll be takin' me armor to her directly."},{"name":"BLANSTYR","text":"Once ye've shown H'naanza yer own cuirass an' heard her decision, ye bring the piece to me so's I can see it for meself."},{"name":"HNAANZA","text":"Blanstyr has already been here to submit his work for appraisal. You have a mythril cuirass prepared as well, I trust?"},{"name":"HNAANZA","text":"This is superb craftsmanship, <span class=\"highlight\">Forename</span>. It seems the pressures of this challenge have done naught to cloud your eye for detail. In fact, you may have produced your finest piece yet."},{"name":"HNAANZA","text":"It is superior to Blanstyr's in every respect. You think me biased? Yes, it is true that I despise that self-centered windbag, but I mean to judge this contest fairly. And the Roegadyn's armor was indeed forged with his customary quality."},{"name":"HNAANZA","text":"But it is thus that the brilliance of <span class=\"emphasis\">your</span> cuirass shines all the more brightly for improving on the work of a master artisan."},{"name":"HNAANZA","text":"Mythril is a notoriously difficult material to shape, yet see the gloss of these plates! Not a single imperfection to mar the surface."},{"name":"HNAANZA","text":"I have cast an eye over many a suit of armor, but it is refreshing to know that I can still be impressed."},{"name":"HNAANZA","text":"The first round goes to you. I only wish I could be there to see Blanstyr weep when you show him the masterpiece you have created."},{"name":"BLANSTYR","text":"So, H'naanza chose yer armor over mine, did she? Tch, surprise, surprise... Come, then, pup, let's see this bloody work of art."},{"name":"BLANSTYR","text":"Huh... Well...ye've not been neglectin' yer craft, that much is certain. I can't rightly disagree with her decision. But the next round'll be a different story─ye can be sure o' that!"}],"reward":{"items":[{"id":2387},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":11}],"quests":[65817]},"next":[65819]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"item","id":"2387","obj":{"i":2387,"n":"Apprentice's Pliers","l":39,"c":35255,"t":17}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3149","obj":{"i":3149,"n":"Mythril Cuirass","l":40,"c":48033,"t":35,"p":7371}},{"type":"quest","id":"65817","obj":{"i":65817,"n":"Pans of Steel","g":138,"l":"Limsa Lominsa","s":350,"f":1}},{"type":"quest","id":"65819","obj":{"i":65819,"n":"For the Good of the Guild","g":138,"l":"Limsa Lominsa","s":450,"f":1}}]}