{"quest":{"name":"For the Good of the Guild","location":"Limsa Lominsa","id":65819,"patch":2.0,"sort":450,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001001,"genre":138,"usedItems":[3861,2830,3868],"journal":["Forgemaster H'naanza wishes to relay to you Blanstyr's next challenge.","Blanstyr has notified H'naanza of your contest's second-round challenge, a task that requires you to craft several pieces of armor within a strict, though somewhat ambiguous, time frame. Make haste and forge the necessary high-quality items: a pair of mythril-plated caligae, a reinforced mythril elmo, and a pair of mythril sollerets. When finished, deliver the finished pieces to the waiting forgemaster for appraisal.","Once again, H'naanza credits you for your fine work. Rather than declare you the victor, however, she has instead requested that you relinquish your armor to the guild to serve as a replacement order for the Maelstrom. Go to Blanstyr, and explain the delay in your submission.","Although your selfless deed has guaranteed victory for Blanstyr in the second round, you have made a vital contribution to the guild's continuing survival and prosperity. Return to honing your craft in preparation for the veteran artisan's final, and likely most demanding, challenge.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 50."],"objectives":["Deliver a pair of mythril-plated caligae <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a reinforced mythril elmo <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a pair of mythril sollerets <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to H'naanza.","Speak with Blanstyr."],"dialogue":[{"name":"HNAANZA","text":"Blanstyr has notified me of the challenge for the second round of your contest. Defeat in the first round has humbled him not a whit, it seems."},{"name":"HNAANZA","text":"You may have gained an early lead, <span class=\"highlight\">Forename</span>, but keep your focus sharp. As I have said before, complacency can be your downfall. And a man like Blanstyr is at his most dangerous when his pride is on the line."},{"name":"HNAANZA","text":"Now, according to the wishes of our vindictive veteran, for this next round, you are to craft several items...and you must do so within a reasonable time frame to “reflect the pressures of an actual commission.” He fails to mention what he considers to be “reasonable,” so I suggest you work with dispatch."},{"name":"HNAANZA","text":"The challenge requires you to forge a pair of mythril-plated caligae, a reinforced mythril elmo, and a pair of mythril sollerets, all of the finest-possible quality."},{"name":"HNAANZA","text":"Naturally, every one of these items requires an abundance of mythril ore... See how he deliberately chooses the same material as before? Such is Blanstyr's confidence in his ability, and his certitude that he cannot be beaten twice under similar conditions."},{"name":"HNAANZA","text":"This is your chance to unravel that obnoxious self-assurance, and end this contest with a second-round victory. If anyone can quench the fury of that insufferable aurochs, <span class=\"highlight\">Forename</span>, it is you."},{"name":"HNAANZA","text":"Bring your submissions to me once you are satisfied with your forging. Take no shortcuts─I expect to see armor of unsurpassed quality."},{"name":"HNAANZA","text":"Do you have the pieces required for the second round? I need to see a pair of mythril-plated caligae, a reinforced mythril elmo, and a pair of mythril sollerets─all of the best quality you can muster."},{"name":"HNAANZA","text":"Well done, <span class=\"highlight\">Forename</span>─your work is flawless. I would declare you victor this very moment, except..."},{"name":"HNAANZA","text":"I need you to relinquish this armor to the guild. As for the why, it concerns a potentially dire loss of trust and reputation."},{"name":"HNAANZA","text":"Do you recall the time you aided one of our novices with an order of bronze hoplons? Well, I'm afraid young Swithin has failed to deliver once more."},{"name":"HNAANZA","text":"He has improved much in his craft─spurred on as he was by your example─but again the lad accepted a commission he could never hope to honor. And one does not break a promise made to the Maelstrom..."},{"name":"HNAANZA","text":"I could drop full responsibility for this failure onto Swithin's unreliable shoulders, and cast him out of the guild. But what worth is a guild that does naught to support its own members when they truly need it?"},{"name":"HNAANZA","text":"Blanstyr is a harsh man, but not entirely without reason. If you explain the circumstances, he may grant you a few extra days to forge your submission anew. What say you, <span class=\"highlight\">Forename</span>? Will you yield your work to the guild?"},{"name":"Q1","text":"Yield your work to the guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"HNAANZA","text":"I understand how unreasonable this request must seem, but the livelihood of the entire guild is at stake. Without your armor to appease them, the quartermasters of the Maelstrom may never again entrust us with another commission."},{"name":"HNAANZA","text":"Byregot's blessings upon you, <span class=\"highlight\">Forename</span>. Swithin! Come over here and show some gratitude!"},{"name":"SWITHIN","text":"I don't know how to repay you for saving my neck yet again. I'll never forgive myself if it costs you your victory over Blanstyr..."},{"name":"SWITHIN","text":"But the compassion you and the forgemaster have shown me this day will not be squandered, this I promise you. I'll work twice as hard! Three times, even!"},{"name":"HNAANZA","text":"We are in your debt. I'll arrange to have these pieces delivered to the Maelstrom quartermasters immediately."},{"name":"HNAANZA","text":"Meanwhile, you should hurry over to Blanstyr and explain the delay in your submission."},{"name":"BLANSTYR","text":"What's this now? Ye let the guild have yer armor to make up a missed order!? Hahahaha, what'd I <span class=\"emphasis\">tell</span> ye? Those fumble-fingered parasites're holdin' ye back at every turn."},{"name":"BLANSTYR","text":"Ye was meant to honor the terms of <span class=\"emphasis\">our</span> contest, no matter the circumstances. Now, ye've neither the gear ye crafted to show for yer effort, nor the time to forge a new submission. This round goes to me!"},{"name":"BLANSTYR","text":"I'd grant ye this ain't the kind o' victory a man looks for, but rules is rules, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, an' failure comes with consequence. So, I don't want to hear no excuses for the final round. Ye just bring yer best work to the table, and we'll let the results stand for 'emselves."}],"reward":{"items":[{"id":2376},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":11}],"quests":[65818]},"next":[65820]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"item","id":"2376","obj":{"i":2376,"n":"Cobalt Doming Hammer","l":43,"c":35207,"t":16,"p":5859}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3861","obj":{"i":3861,"n":"Mythril-plated Caligae","l":42,"c":49824,"t":38}},{"type":"item","id":"2830","obj":{"i":2830,"n":"Reinforced Mythril Elmo","l":44,"c":40046,"t":34,"p":5998}},{"type":"item","id":"3868","obj":{"i":3868,"n":"Mythril Sollerets","l":43,"c":46839,"t":38}},{"type":"quest","id":"65818","obj":{"i":65818,"n":"Best of Three","g":138,"l":"Limsa Lominsa","s":400,"f":1}},{"type":"quest","id":"65820","obj":{"i":65820,"n":"Rivalry and Respect","g":138,"l":"Limsa Lominsa","s":500,"f":1}}]}