{"quest":{"name":"My First Doming Hammer","location":"Limsa Lominsa","id":65810,"patch":2.0,"sort":11,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001000,"genre":138,"usedItems":[5056],"journal":["Forgemaster H'naanza wishes to see what use you can make of your new doming hammer.","You have been instructed to forge a bronze ingot with your newly acquired hammer. The requisite chunks of copper and tin ore can be purchased from Soemrwyb of the Armorers' Guild. Once you have synthesized a bronze ingot, deliver it to Forgemaster H'naanza.","Upon examining your bronze ingot, Guildmaster H'naanza is satisfied that the quality of your work is sufficient to meet the exacting standards of the Armorers' Guild. She instructs you to continue crafting bronze ingots until the process becomes second nature, at which point you are to return to the forge for your next lesson.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 5."],"objectives":["Deliver a bronze ingot to H'naanza."],"dialogue":[{"name":"HNAANZA","text":"Ah, yes. If I didn't know better, I'd think you were an armorer, <span class=\"highlight\">Forename</span>."},{"name":"HNAANZA","text":"Of course, I <span class=\"emphasis\">do</span> know better. Until you craft something with that hammer of yours, you'll look like a babe with a rattle to me─and I've no intention of mothering you. Make no mistake, I mean to shape you into an artisan, however hard I have to pound."},{"name":"HNAANZA","text":"Save your sweat for the forge, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─I don't expect you to fashion full suits of plate on your first day. Just pay close attention to my instructions, be diligent in your work, and the skill will come in due time."},{"name":"HNAANZA","text":"Now let's be about your first lesson, shall we?"},{"name":"HNAANZA","text":"I want you to take up your hammer and make me a bronze ingot. A mundane task, I grant you, but one which every armorer must master."},{"name":"HNAANZA","text":"Bronze, you see, is the most basic material of the craft, and bronze ingots are its building blocks."},{"name":"HNAANZA","text":"'Tis not the strongest of alloys, of course, but it is that very quality that makes bronze so easy to shape─and the metal of choice for a novice armorer."},{"name":"HNAANZA","text":"To forge your ingot, you'll need to procure two chunks of copper ore, a chunk of tin ore, and an ice shard."},{"name":"HNAANZA","text":"The ore can be purchased from Soemrwyb here at the guild. The ice shard you'll have to find on your own."},{"name":"HNAANZA","text":"...Well? Are you waiting for me to swing your arm for you? Or mayhap you would have me swing my <span class=\"emphasis\">boot</span>?"},{"name":"SYSTEM","text":"Synthesize a bronze ingot for Forgemaster H'naanza using two chunks of copper ore, a chunk of tin ore, and an ice shard."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>."},{"name":"HNAANZA","text":"Where's that bronze ingot I asked for? If you can't find the ore yourself, try speaking with Soemrwyb here at the guild."},{"name":"HNAANZA","text":"Completed your first task, have you? Well then, let's have a look at this ingot..."},{"name":"HNAANZA","text":"Hm. So this is the sort of quality I can expect from you, is it? For a novice armorer, this is excellent work. Excellent. Well done, <span class=\"highlight\">Forename</span>."},{"name":"HNAANZA","text":"The key to making good bronze is judging the ratio of copper to tin. With too much tin, the alloy becomes harder but also more brittle. Not the sort of material you want protecting your vital organs."},{"name":"HNAANZA","text":"Lest you forget, quality is a matter of life and death in our craft. That is why we teach our initiates the ideal metallurgic composition of every item we forge. Not that all are quick to learn. There are some who seem destined to produce mediocre results however painstakingly the processes are explained."},{"name":"HNAANZA","text":"Thank the Builder you are not one of them. I am pleased to say that your ingot would fetch a decent price in the markets."},{"name":"HNAANZA","text":"But do not let this first success make you complacent. A single bad helm will lose you more trust than a hundred good ones will win, because bad armor means dead men. It is not enough that your work be good. It must needs be <span class=\"emphasis\">consistently</span> good."},{"name":"HNAANZA","text":"And achieving that consistency requires discipline and long hours of crafting the same item over and over, again and again. For you, this means a mountain of bronze ingots. Bronze ingots in your dreams. Bronze ingots until the process is so ingrained that you wake up and find that your pillow is an ingot you made in your sleep."},{"name":"HNAANZA","text":"When you feel you have learned all you can from forging bronze ingots, seek me out and I will find you something else to craft. May the Builder guide your hand, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"The next armorer quest will be available from H'naanza upon reaching level 5."}],"reward":{"items":[{"num":150,"id":3},{"num":100,"id":5},{"num":30,"id":5106},{"id":2961}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":11}],"quests":[65809]},"next":[65811]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"item","id":"5106","obj":{"i":5106,"n":"Copper Ore","l":1,"c":21209,"t":48,"p":2}},{"type":"item","id":"2961","obj":{"i":2961,"n":"Hempen Kurta","l":1,"c":42233,"t":35}},{"type":"item","id":"5056","obj":{"i":5056,"n":"Bronze Ingot","l":1,"c":20803,"t":49,"p":9}},{"type":"quest","id":"65809","obj":{"i":65809,"n":"Way of the Armorer","g":138,"l":"Limsa Lominsa","s":10,"f":1}},{"type":"quest","id":"65811","obj":{"i":65811,"n":"From Thigh to Neck","g":138,"l":"Limsa Lominsa","s":50,"f":1}}]}