{"quest":{"name":"Showing Your Steel","location":"Limsa Lominsa","id":65815,"patch":2.0,"sort":250,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001001,"genre":138,"usedItems":[5058],"journal":["Forgemaster H'naanza wishes to speak with you.","After inquiring as to what Blanstyr said during your recent dealings, H'naanza launches an impassioned defense of her approach to the education of novices, citing you as a prime example of its efficacy. She then informs you that her old rival has submitted an order for an ingot of the purest steel, forged by none other than your good self. It would appear that the veteran armorer is eager to recruit you to his cause. Craft a high-quality steel ingot and deliver it to him.","Upon taking receipt of your steel ingot, Blanstyr declares that he is less than impressed with H'naanza's handling of your obvious talent, and encourages you to “do something about it.” What he means by this is unclear, but what <span class=\"emphasis\">is</span> clear is that you have become the unwitting subject of your superiors' godsforsaken feud.<br><br>※The next armorer quest will be available from H'naanza upon reaching level 30."],"objectives":["Deliver a steel ingot <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Blanstyr."],"dialogue":[{"name":"HNAANZA","text":"Ah, there you are. Tell me, were you able to prise anything useful out of Blanstyr? What did he have to say?"},{"name":"HNAANZA","text":"Hmph. Dampening the flames in our forges..."},{"name":"HNAANZA","text":"A familiar refrain. That stubborn old sod will never understand why his way is doomed to fail. Not that he's ever even thought to question it."},{"name":"HNAANZA","text":"If we choose not to pass on our knowledge, all of the techniques and methods we've perfected over gods know how long are destined to perish along with us. Blanstyr bemoans the “dampening” of our forges' flames, while advocating a course which would see them extinguished altogether!"},{"name":"HNAANZA","text":"And <span class=\"emphasis\">that</span> is why I will continue to expose all of our initiates to as many facets of the craft as I can, until such time as I die or am replaced. I may add that you yourself stand as a shining example of how effective this approach can be."},{"name":"HNAANZA","text":"I'll not force the issue, but you'd make the perfect champion for my cause. That said, Blanstyr has apparently come to much the same conclusion─he's submitted an order that asks for you by name."},{"name":"HNAANZA","text":"The order is for a single steel ingot. But being the difficult bastard that he is, he doesn't want just <span class=\"emphasis\">any</span> steel ingot─he wants an ingot of the purest steel. And that'll require extra effort on your part."},{"name":"HNAANZA","text":"Well, I'll not keep you any longer. You've work to do and a cantankerous artisan to impress."},{"name":"SYSTEM","text":"Increasing an item's <span class=\"highlight\">quality</span> during synthesis improves the chance that the resulting product will be of a higher grade (<span class=\"highlight\">HQ</span>)."},{"name":"SYSTEM","text":"To be deleted."},{"name":"BLANSTYR","text":"You here to deliver that ingot, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? I ain't one for idle chitchat."},{"name":"BLANSTYR","text":"Hmmm...the weight feels right. Let's head inside an' have a look, shall we?"},{"name":"BLANSTYR","text":"Hah hah! I knew ye were up to the task, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Ye can't forge steel much purer'n that."},{"name":"BLANSTYR","text":"It's a common enough material, o' course, an' one no self-respectin' armorer should have any trouble workin'."},{"name":"BLANSTYR","text":"But it's the quality o' these “common” materials as makes the difference between craftin' a workaday piece an' a masterpiece. No matter how shiny ye polish it, yer work'll never be more'n mediocre if the stuff ye make it from is second-rate."},{"name":"BLANSTYR","text":"Anyroad, I can see ye've already learned that lesson. Heh! I swear, every time our paths cross, yer twice the armorer ye was before!"},{"name":"BLANSTYR","text":"An' yet H'naanza has a talented <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> like yerself tidyin' up after her bunglin' bloody novices, 'stead o' givin' ye the freedom to master yer craft."},{"name":"BLANSTYR","text":"Makes me blood boil, it does..."},{"name":"BLANSTYR","text":"If our guild's to survive, it's got to be able to serve its customers' needs. Any bugger as don't contribute to keepin' the roof over our heads don't deserve to work under it."},{"name":"BLANSTYR","text":"I've naught but respect for ye, <span class=\"highlight\">Forename</span>. Yer the kind of armorer this guild needs more of."},{"name":"BLANSTYR","text":"But tell me true: are ye <span class=\"emphasis\">really</span> content to waste yer career wipin' the arses of H'naanza's squallin' babes?"},{"name":"BLANSTYR","text":"Yer talent's bein' buried under a mountain o' mediocrity, an' it's high time ye did somethin' about it. As to what, well...that's for you to decide..."}],"reward":{"gil":557,"items":[{"id":2384},{"id":2731,"one":1},{"id":3065,"one":1},{"id":3575,"one":1},{"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":11}],"quests":[65814]},"next":[65816]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"item","id":"2384","obj":{"i":2384,"n":"Initiate's Pliers","l":25,"c":35252,"t":17,"p":1319}},{"type":"item","id":"2731","obj":{"i":2731,"n":"Silver Magnifiers","l":25,"c":40895,"t":34,"p":1314}},{"type":"item","id":"3065","obj":{"i":3065,"n":"Initiate's Gown","l":24,"c":42034,"t":35}},{"type":"item","id":"3575","obj":{"i":3575,"n":"Velveteen Halfgloves","l":24,"c":44027,"t":37,"p":902}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5058","obj":{"i":5058,"n":"Steel Ingot","l":26,"c":20802,"t":49,"p":258}},{"type":"quest","id":"65814","obj":{"i":65814,"n":"An Armorer's Pride","g":138,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"65816","obj":{"i":65816,"n":"May the Best Armorer Win","g":138,"l":"Limsa Lominsa","s":300,"f":1}}]}