{"quest":{"name":"Sleepless in the Swaddle","location":"Limsa Lominsa","id":65826,"patch":2.45,"sort":69,"icon":100336,"eventIcon":71221,"issuer":1010715,"target":1010718,"genre":194,"usedItems":[9268],"journal":["The hitsuji bugyo wishes to shore up support for the Fleece Force in La Noscea.<br>※This quest is available for a limited time only.","His hands full with Heavensturn formalities, the hitsuji bugyo has appointed an able ally to champion the Fleece Force in La Noscea on his behalf. He would have you assist this man, the red hitsuji yoriki, in his efforts. Don the hitsuji kabuto to prove your allegiance to the cause, and speak with the wary Easterner.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The red hitsuji yoriki has caught wind of an ideal opportunity to publicize the tender lamb's powers: in Aleport, a baby has been crying without cease for days, to the chagrin of both the townspeople and its increasingly fraught mother. Take the tender lamb to western La Noscea, and see if you can be of service to the straitened saltwife.","The wailing baby's mother is fast approaching the end of her tether, and welcomes your offer of a sleeping spell with open arms. With the tiny lamb in tow, /cheer for the baby to activate the hypnoturgical blast.","The lamb's magic hits its mark, but fails to stifle the baby's screams. Its desperate mother pleads with you to work your magic on the baby again, but the tender lamb seems more interested in her than in the baby. Follow the lamb's lead, and /cheer for the stalwart saltwife.","The hypnoturgical blast takes effect, forcing the worries from the saltwife's tired mind. And as the mother's agitation ebbs away, so do her daughter's tears. She thanks you effusively, and asks you to pass on her gratitude to the red hitsuji yoriki. Return to the Aftcastle to report on your success.","The red hitsuji yoriki commends your actions, and presents you with a crimson hitsuji kabuto to honor your service to the Fleece Force in La Noscea. If his comrades in Ul'dah and Gridania meet with equal success, the bugyo's plan is sure to succeed."],"objectives":["While wearing the hitsuji kabuto, speak with the red hitsuji yoriki.","With the tender lamb minion summoned, speak with the stalwart saltwife in Aleport.","With the tender lamb minion summoned, /cheer for the suckling babe.","With the tender lamb minion summoned, /cheer for the stalwart saltwife.","Report to the red hitsuji yoriki."],"dialogue":[{"name":"SHEEPMISSIONARY","text":"Alas, the Heavensturn formalities keep me from devoting myself to my true mission. But fear not, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>─I have a trusty familiar working on my behalf right here in Limsa Lominsa."},{"name":"SHEEPMISSIONARY","text":"In fact, there he is over there─the fellow in the crimson cuirass. An able man, but provincial. He is like to give short shrift to an Eorzean like your good self, unless you prove your allegiance to the Fleece Force. The kabuto I gave you should assure him of your good intentions."},{"name":"SHEEPMISSIONARY","text":"I have already deposited the tender lamb in his care. With the three of you working together, we shall surely soon see a squad of sheep in each and every La Noscean port!"},{"name":"SHEEPMISSIONARY","text":"That is, if the lamb fails to convince him. But I am convinced, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>! To see my prototype patrolling the streets at the heels of an Eorzean sheepwielder─'tis as if my vision has become reality!"},{"name":"BLACKSHEEPYORIKI","text":"Yes, I saw you speaking with my master. And no, I do not trust you. If you are as true a comrade as you claim, then where is the kabuto he gave you? Don it now, or begone."},{"name":"BLACKSHEEPYORIKI","text":"That kabuto <span class=\"emphasis\">looks</span> authentic, but... No, no, it must be! Forgive my suspicion, comrade─this city is not kind to strangers. Why, only <span class=\"alternative-container\"><span class=\"alternative\">this morning</span><span class=\"alternative\">yesterday</span></span>, I had an unfortunate experience in the lower decks. I had merely stopped to ask a comely maid for directions, when all at once a hand darted into my hip pocket, and..."},{"name":"BLACKSHEEPYORIKI","text":"A-Ahem! But I shan't burden you with my personal troubles. To business! I have scoured this land for the perfect opportunity to demonstrate the power of the tender lamb, and I believe I have it: in Aleport, there is a baby...and the baby is crying!"},{"name":"BLACKSHEEPYORIKI","text":"What of it, you ask? If it is a baby's job to cry, then this particular child puts the most industrious docker to shame. The floodgates opened several days ago, and nothing has succeeded in drawing them to a close. Its constant wailing has denied so much as a wink of sleep to mother and baby both."},{"name":"BLACKSHEEPYORIKI","text":"This is our chance, comrade! The lady in question is the wife of a fisherman, and you know how fishwives are wont to gossip. If the lamb succeeds in calming the child where all else has failed, the Fleece Force will be heralded across the isle!"},{"name":"BLACKSHEEPYORIKI","text":"Unfortunately, that <span class=\"emphasis\">if</span> may be a sizable one... Our initial trials suggested that the hypnoturgical blast may be less effective against smaller quarry. I have full confidence that our sheepmasters will remedy this issue in time, but be aware that, should the blast fail, you may have to improvise."},{"name":"BLACKSHEEPYORIKI","text":"However you achieve it, the Fleece Force must be seen to play a vital role in silencing the child. To begin, take the tender lamb to Aleport, and offer its services to the baby's mother. Should you succeed today, comrade, this infant may grow to be the sheepwielder of tomorrow!"},{"name":"SYSTEM","text":"During this quest, the tender lamb will accompany you as a minion."},{"name":"SYSTEM","text":"However, if you summon another minion or companion, or log out of the game, the tender lamb will leave your side and return to the red hitsuji yoriki."},{"name":"SYSTEM","text":"In order to progress in the quest, the tender lamb must remain summoned."},{"name":"SYSTEM","text":"Should the tender lamb leave your side, it can be retrieved by speaking with the red hitsuji yoriki once more."},{"name":"SYSTEM","text":"During this quest, the tender lamb will accompany you as a minion."},{"name":"SYSTEM","text":"However, if you summon another minion, or log out of the game, the tender lamb will leave your side and return to the red hitsuji yoriki."},{"name":"SYSTEM","text":"It will also be dismissed if you leave the city while a companion is summoned. Please withdraw your companion in order to proceed with the quest."},{"name":"SYSTEM","text":"Should the tender lamb leave your side, it can be retrieved by speaking with the red hitsuji yoriki once more."},{"name":"BLACKSHEEPYORIKI","text":"Missing something, comrade? Fear not, I have the tender lamb right here. Do try not to misplace her next time."},{"name":"SYSTEM","text":"The tender lamb will be dismissed if you leave the city while a companion is summoned. Please withdraw your companion in order to proceed with the quest."},{"name":"Q1","text":"Take charge of the tender lamb?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"BLACKSHEEPYORIKI","text":"Godsspeed, comrade. Let the mothers of La Noscea know the power of the Fleece Force!"},{"name":"BLACKSHEEPYORIKI","text":"They say that babies are the children of the wind, comrade─their only constant is change. If its screeching should cease before the lamb can cast its spell, our chance for glory will be lost."},{"name":"BLACKSHEEPYORIKI","text":"There is no time to lose, comrade. The longer the baby cries, the harder it may be to soothe. Take the tender lamb to Aleport, and put this problem to bed!"},{"name":"SAILOR","text":"I was out at sea when me little girl was born. Sailed back special to see 'er. But the moment she gets a glimpse of this ol' mug o' mine, she starts screamin' 'er 'ead off. I know I ain't pretty, but I never reckoned meself <span class=\"emphasis\">that</span> ugly neither..."},{"name":"MOTHER","text":"My baby won't stop crying... Why won't she stop crying? There was a gent here before who said something about a magical sheep... Or was it a sheep talking about a magical man...? Oh, why won't she stop crying!?"},{"name":"MOTHER","text":"Another sheep? I've never seen so many in town before. First the one on that strange man's helmet, and now... Wait a moment─you're not the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> he was talking about, are you? Please, you have to help me!"},{"name":"MOTHER","text":"You see, my husband just returned from a long sea voyage. He was so looking forward to seeing his newborn daughter for the first time, but when she saw his face she burst out crying, and I just can't seem to make her stop... Oh, why did I marry such an ugly man!?"},{"name":"MOTHER","text":"She never cried like this before... I just don't know what to do. The man in the helmet said you could help─that you could stop her crying. Can you really stop her crying!?"},{"name":"MOTHER","text":"...Your sheep can make her sleep? Well, she can't rightly cry in her sleep! ...Oh gods─she can't, can she!? Please, just do what you can... If this lasts any longer, my heart shall break!"},{"name":"SYSTEM","text":"The baby is crying loudly. <span class=\"highlight\">Cheer</span> for her to unleash the hypnoturgical blast and put her to sleep."},{"name":"MOTHER","text":"She's been crying for days, now. I've tried everything, but she just won't stop. I beg of you─whatever it is you mean to do, please do it now! I can't bear to see her like this..."},{"name":"SYSTEM","text":"The baby is crying loudly. <span class=\"highlight\">Cheer</span> for her to unleash the hypnoturgical blast and put her to sleep."},{"name":"MOTHER","text":"Please, I─　Wait...where's your lamb gone? But I thought she was the one who could─　...Oh gods! My poor baby's never going to stop crying, is she!?"},{"name":"MOTHER","text":"Was that it? B-But...your lamb didn't even move! Are you sure you know what you're doing?"},{"name":"MOTHER","text":"(-Suckling Babe-)Blub... Burble... Wuh... Wah...<br>WAAAAAAAAAH! WAAAAAAAAAH!"},{"name":"SYSTEM","text":"The hypnoturgical blast has some effect, but fails to put the baby to sleep. It serves only to make the baby more tired, and increasingly upset."},{"name":"MOTHER","text":"Wh-What have you done? You've just made it worse! I can't cope with all this! I─I just... Wh–Why won't she...? Why can't I...? Wh–Why is your lamb looking at me like that!?"},{"name":"SYSTEM","text":"The tender lamb is staring intently at the baby's mother."},{"name":"MOTHER","text":"Why was your lamb looking at me like that? It's my baby who needs your help, not me! She needs to sleep! Why won't you help her sleep!?"},{"name":"SYSTEM","text":"The tender lamb seems more interested in the mother than her baby. <span class=\"highlight\">Cheer</span> for the stalwart saltwife to unleash the hypnoturgical blast and put her to sleep."},{"name":"MOTHER","text":"Where has that lamb of yours disappeared to? My poor little baby's crying even harder than she was before! I beg of you─call her back, and try that magic again. It's my only hope..."},{"name":"MOTHER","text":"Please, stop messing about! First your lamb stares at me, and now you're doing strange things! If that sheep of yours can really make my baby sleep, then I beg you, make her do it. I...I...I can't cope with this!"},{"name":"SYSTEM","text":"The tender lamb seems more interested in the mother than her baby. <span class=\"highlight\">Cheer</span> for the stalwart saltwife to unleash the hypnoturgical blast and put her to sleep."},{"name":"MOTHER","text":"Ah! What did you...? O-Oh... I feel so..."},{"name":"MOTHER","text":"So calm, and sleepy... I can't remember the last time I felt so relaxed. ...B–But, I can't sleep now! My baby, she─ Ah!"},{"name":"MOTHER","text":"She... She's stopped crying. But why...? Your lamb used her magic on <span class=\"emphasis\">me</span>, not her..."},{"name":"MOTHER","text":"Ahhh, I see... So it wasn't my husband's face that was upsetting her, after all─it was me. She had never screamed so hard before... I was so worried about her. My worries must have been fueling her tears, which only made me more worried, and her more upset..."},{"name":"MOTHER","text":"I just needed to calm down...didn't I, my darling? I got so wound up worrying about you, when all the while you were worrying about me. But it's all right now, all thanks to this little lamb."},{"name":"MOTHER","text":"What a clever little thing you are. You saw that <span class=\"emphasis\">I</span> was the one who needed calming when no one else did. Why, if I didn't have my hands full, I'd cuddle you rotten!"},{"name":"MOTHER","text":"But...&lt;yawn&gt;...that will have to wait till <span class=\"alternative-container\"><span class=\"alternative\">morning</span><span class=\"alternative\">later</span><span class=\"alternative\">tomorrow</span></span>. It's high time we were snuggled up in bed. Thank you─both of you─for everything. And thank your friend in red for me, too. Oh, and...if you get the chance...tell my husband he's not so bad, really. Not so bad at all."},{"name":"SYSTEM","text":"The tender lamb looks at you cheerfully."},{"name":"SYSTEM","text":"By working together to calm the crying baby and her fraught mother, you and the tender lamb have become closer."},{"name":"SYSTEM","text":"Your joint effort to ease another pair of troubled souls has brought you and the tender lamb even closer together."},{"name":"SYSTEM","text":"With a third successful mollification, you and the tender lamb have become fast friends."},{"name":"MOTHER","text":"(-Suckling Babe-)Zzzzzzzzz..."},{"name":"MOTHER","text":"She's fast asleep... Isn't she just adorable? I really can't thank you enough for all you've done for us. Oh, and thank your friend in red for me, too, would you? In the meantime, I think I'll join her in taking a well-earned snooze."},{"name":"SAILOR","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>─from the bottom of me 'eart. I just don't know 'ow I can show me face again, after all the damage it's done. ...What, she really said that? &lt;sob&gt; Oh, me darlin' girls─I'll never leave the two of ye alone again!"},{"name":"BLACKSHEEPYORIKI","text":"Welcome back, comrade! So, how fared your mission? Did that baby succumb to the might of the Fleece Force?"},{"name":"BLACKSHEEPYORIKI","text":"Welcome back, comrade! The tender lamb has already returned to me, with a grin on its face. I have never seen a lamb grin before. Does this mean the plan worked?"},{"name":"BLACKSHEEPYORIKI","text":"I see. Then it is as we thought─the effect was weak against a crying infant... Is it simply a question of size? Of age? Of emotional state? Hmmm... This matter must needs be researched further, before we embark on the production phase..."},{"name":"BLACKSHEEPYORIKI","text":"And you say the gossiping will have to wait until the mother and child get a good night's sleep? Why, the lazy─! Ahem. Better late than never, as they say. Let the saltwife rest her voice, so that it might sing the Fleece Force's praises all the louder!"},{"name":"BLACKSHEEPYORIKI","text":"In honor of your success, this crimson kabuto is yours. Should you misplace it, fear not─I shall send word of your achievements to my comrades, the hitsuji shonin. They will gladly issue a replacement to a <span class=\"alternative-container\"><span class=\"alternative\">heroine</span><span class=\"alternative\">hero</span></span> such as yourself."},{"name":"BLACKSHEEPYORIKI","text":"But for now, I do believe your work here is done. Have you already assisted our comrades in Ul'dah and Gridania? I have no doubt that with your help, the bugyo's plans for Eorzea are sure to succeed."},{"name":"BLACKSHEEPYORIKI","text":"Allow me to return the tender lamb to him. You have done much for us this day─it is only fair that I should do something for you."}],"reward":{"gil":626,"items":[{"id":9270}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65788]}},"partials":[{"type":"npc","id":"1010715","obj":{"i":1010715,"n":"Hitsuji Bugyo","l":28,"q":4}},{"type":"npc","id":"1010718","obj":{"i":1010718,"n":"Red Hitsuji Yoriki","l":28,"q":1}},{"type":"item","id":"9270","obj":{"i":9270,"n":"Crimson Hitsuji Kabuto","l":1,"c":40178,"t":34,"p":71}},{"type":"item","id":"9268","obj":{"i":9268,"n":"Hitsuji Kabuto","l":1,"c":40177,"t":34,"p":71}},{"type":"quest","id":"65788","obj":{"i":65788,"n":"Lions for Lambs","g":194,"l":"Limsa Lominsa","s":67}}]}