{"quest":{"name":"All's Wool That Ends Wool","location":"Limsa Lominsa","id":65823,"patch":2.45,"sort":71,"icon":100334,"eventIcon":71221,"issuer":1010715,"target":1010727,"involved":[1000938,1001217],"genre":194,"usedItems":[9269,9270,9271],"journal":["The hitsuji bugyo is eager to learn of your progress in the three city–states.<br>※This quest is available for a limited time only.","Having dispatched you to the ends of the realm to rally support for the Fleece Force, the hitsuji bugyo is eager to hear of your achievements. His assistants in the three city–states have instructions to reward any adventurer who supports their cause with a colored kabuto. Once you have earned all three kabuto, return to the Aftcastle, and present them to the bugyo.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You present the three kabuto to the hitsuji bugyo, and earn his undying gratitude. But while all Eorzea is abuzz with talk of the merits of sheep, mention of the Fleece Force is notable by its absence. The bugyo would have you canvass a cross section of Lominsans to find out why.","The people of Limsa Lominsa speak as one: sheep are simply too adorable to have any place on the battlefield. Report this discovery to the hitsuji bugyo.","The bugyo is incensed by the townspeople's soft-heartedness, and pledges to prove them wrong with a show of force. But the merry maid of Limsa Lominsa─now revealed as the hitsuji ometsuke in disguise─stands in the way of his drastic design. He attempts to use the lamb's power to put her─and you─to sleep, but the lamb rebels and blasts the bugyo instead. You escape unscathed, but the lamb is not so lucky. Activating her own magic without the proper preparation has exhausted her life force, and left her on the brink of oblivion. Reenergize the lamb with a /cheer of encouragement.","You cheer for the lamb, but she barely responds. With the chat mode in <span class=\"highlight\">Say</span>, enter “Don't give up!” to rally the tender lamb's dissipated spirits.","The tender lamb is moved by your cry of encouragement, but still lacks the strength to stand, let alone smile. The hitsuji ometsuke urges you to make one last, great effort, and /pray for the lamb with all your heart.","The tender lamb hears your prayers, and makes a miraculous recovery. His heart heavy with regret, the bugyo entrusts the lamb to you, while he sets about righting the wrongs he has caused. Though the lamb may no longer be able to use the hypnoturgical blast, the friendship that has blossomed between you shall surely bring peace to your heart in the years to come."],"objectives":["Present the black, crimson, and white kabuto to the hitsuji bugyo.","Inquire about sheep on the upper decks.","Inquire about sheep on the lower decks.","Report to the hitsuji bugyo.","/cheer for the tender lamb.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Don't give up!” to encourage the tender lamb.","/pray for the tender lamb."],"dialogue":[{"name":"SYOJO","text":"<span class=\"alternative-container\"><span class=\"alternative\">Evenin'</span><span class=\"alternative\">Mornin'</span><span class=\"alternative\">Afternoon</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. A little bird told me yer workin' fer the bugyo. ...What do I know about it? Hee hee! That's my little secret!"},{"name":"SHEEPMISSIONARY","text":"It is my mission─nay, my destiny!─to make our plans for the Fleece Force a reality. My trusted yoriki are already working to this end in the cities three, with orders to reward any Eorzean who assists them in their duties with a ceremonial helm."},{"name":"SHEEPMISSIONARY","text":"If any man, woman, or child should prove their devotion to the cause by earning all three helms, my appreciation would know no bounds. I believe you have what it takes, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. I pray you, help to make my dream a reality─if not for me, then for the future of Eorzea!"},{"name":"SHEEPMISSIONARY","text":"I await your triumphant return, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. Though the victory of the Fleece Force is its own reward, rest assured that should you return to me with the three kabuto, it shall not be your <span class=\"emphasis\">only</span> reward..."},{"name":"SHEEPMISSIONARY","text":"<span class=\"alternative-container\"><span class=\"alternative\">My lady</span><span class=\"alternative\">My lord</span></span>, you have returned! My yoriki have already sent word of your achievements. How my heart swelled to hear of your triumph over the passions of youth in Aleport! Your services to commerce in the Black Shroud! Your dominion over the Brass Blades in Thanalan!"},{"name":"SHEEPMISSIONARY","text":"Oh, but I am getting ahead of myself. I am old enough to know that words are but wind, no matter how balmy the breeze. Prithee, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>─if you have rightly earned the white, crimson, and black kabuto, permit me to examine them, and confirm the truth of these tales!"},{"name":"SHEEPMISSIONARY","text":"These are indeed my yoriki's helms... Then their reports were true! My eternal thanks, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. You have worked wonders in the service of sheep. Why, thanks to you, the creatures have become the talk of the town!"},{"name":"SHEEPMISSIONARY","text":"However, this talk is not quite what I intended. On every corner, the great unwashed discuss how the sheep is <span class=\"emphasis\">cute</span>, how the sheep is <span class=\"emphasis\">clever</span>, how if one recites “tender lamb” three times in a glass, one's wishes will come true... But naught have I overheard of the mighty Fleece Force."},{"name":"SHEEPMISSIONARY","text":"Tell me, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>─why do they shun the hypnoturgical blast so? Why do they insist on confining their sheep to the fold, instead of unleashing them onto the battlefield?"},{"name":"SHEEPMISSIONARY","text":"Was my plan flawed from the start...? No, no, it cannot be... The only flaw is in their understanding. Their eyes are closed to the sheep's true potential!"},{"name":"SHEEPMISSIONARY","text":"Forgive me, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>, but I have one last favor to ask of you: could you speak with the people of Limsa Lominsa on my behalf, and assess why they refuse to believe in the sheep's worth as a weapon?"},{"name":"SHEEPMISSIONARY","text":"Why can these people not see what the sheep has to offer to their defenses? I pray you, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>─speak with them, and discover why they spurn the lamb so."},{"name":"GINNADE","text":"...You wish to speak with me about sheep? Ah, yes, I have heard the rumors─a little lamb wandering from town to town, helping those in need. A most edifying tale, I'm sure."},{"name":"GINNADE","text":"But using sheep as weapons? Don't make me laugh. We have plenty of the things milling around outside the Zephyr Gate already, and they've hardly been striking the fear of death into the local beasties. Besides, using something so fluffy as a weapon of war... I'd just feel too sorry for them."},{"name":"SYOJO","text":"Sending sheep into battle? Hmph. I see the bugyo insists on beating his ignominious little drum."},{"name":"SYOJO","text":"Ah─I mean, erm... I don't know nothin' 'bout fightin', <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, but I don't reckon I'd 'ave it in me to send a cute little blighter like that into battle. Just thinkin' o' them wee darlin's up against soldiers, an' monsters, an' what-'ave-ye... Brings a lump to me throat, it does."},{"name":"SWOZBLAET","text":"I always thought the sheep a doltish creature, its mind as woolly as its coat. These recent tales of its quick wits have quite confounded my prejudices. But a sheep as a soldier? Hah! I've never heard the like. The poor little things wouldn't survive for a single shake of their own tails!"},{"name":"SYOJO","text":"You shall pay for this temerity, bugyo... Ah, erm─sorry, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. I was just sayin' 'ow them sheep're just so fluffy, it'd break me 'eart to see 'em forced into fightin'..."},{"name":"SYSTEM","text":"The tender lamb looks at you...tenderly."},{"name":"SHEEPMISSIONARY","text":"A thousand welcomes on your safe return, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. I am sure our comrade here bids you the same. So tell me─what was the public's reaction to sending sheep into battle?"},{"name":"SHEEPMISSIONARY","text":"They would feel <span class=\"emphasis\">sorry</span> for them!? Gladly do they sup on their flesh, yet they quail at joining forces with them out of <span class=\"emphasis\">pity</span>? Agh, these fools leave me no choice... It is time I brought together the full might of the Fleece Force, and showed these boneless milksops the true power of the sheep!"},{"name":"SYOJO00287","text":"(-???-)You shall do no such thing, hitsuji bugyo!"},{"name":"SHEEPMISSIONARY","text":"What in the─? What are <span class=\"emphasis\">you</span> doing here!?"},{"name":"SYOJO00287","text":"(-Merry Maid?-)You are undone, bugyo! I am here to put an end to your barbarous plots!"},{"name":"SYOJO00287","text":"I thank you for your unwitting assistance, adventurer. I am the hitsuji ometsuke. It is my dishonor to be the commanding officer of this most scurrilous of bugyos. Though you thought me the merry maid of Limsa Lominsa, 'twas but a clandestine facade for my surveillances."},{"name":"SYOJO00287","text":"He told you he plans to expand the Fleece Force from the East to Eorzea? An opprobrious lie! His perverse project has been banned in our homeland. I feared he might recommence his research in Eorzea, but it was only by your assistance that I was able to gain the proof I needed."},{"name":"SYOJO00287","text":"You have put a prohibited plan into practice. You have experimented on innocent animals, in breach of every national and natural law. You have used your position as an envoy to promote your own sorry schemes. You... You... You fool!"},{"name":"SHEEPMISSIONARY","text":"And I would've gotten away with it, too, if it wasn't for your meddling! The Fleece Force is my dream, and I will not allow it to be crushed! Not by you─not by <span class=\"emphasis\">anyone</span>!"},{"name":"SHEEPMISSIONARY","text":"Do not think I shall go gently, ometsuke! You may be my commanding officer, but I am the master of my destiny. And, lest you forget, I am also the master of the tender lamb! Let's see if a little show of force won't change your mind. Lamb─a hypnoturgical blast, if you please!"},{"name":"SHEEPMISSIONARY","text":"What!? No, not <span class=\"emphasis\">me</span>, you...! Uhhh..."},{"name":"SYOJO00287","text":"Hoist with his own petard... Ah! Adventurer─the lamb!"},{"name":"SYOJO00287","text":"She has collapsed in turn... But why? We must wake the bugyo─he may be a fool, but none understand sheep better than he. Hold on, dear lamb! Help is coming!"},{"name":"SHEEPMISSIONARY","text":"Ohhh, my head... The hypnoturgical blast is a powerful weapon indeed..."},{"name":"SHEEPMISSIONARY","text":"...But this is unprecedented! Why would the lamb use her magic without receiving a direct order? She has never acted alone before..."},{"name":"SHEEPMISSIONARY","text":"Ah... And it seems she has paid the price for doing so. Her blast requires great energies─both in its execution and its activation. The latter must be provided by the sheepwielder's exhortations. In activating the spell without the proper mandate, she has all but exhausted her life force."},{"name":"SHEEPMISSIONARY","text":"Only by replenishing her vital energies may she recover, but that may be more easily said than done. For the spiritual energy of one being to flow to another, their hearts must needs be in perfect accord..."},{"name":"SYOJO00287","text":"Adventurer─your bond with the lamb is the deepest. I pray you, do whatever you must to save the poor creature's life."},{"name":"SYOJO00287","text":"The tender lamb has tirelessly instilled <span class=\"highlight\">cheer</span> in the hearts of Eorzeans, asking nothing in return. It is past time that the favor is returned!"},{"name":"SYOJO00287","text":"She used her powers to save us... Now it is our turn to save her. Prithee, adventurer─<span class=\"highlight\">cheer</span> for her, and lend her your strength!"},{"name":"SHEEPMISSIONARY","text":"The tender lamb was not designed to activate her powers independently─her life force barely suffices to power the blast itself, let alone its activation. Such energy is provided by her sheepwielder's cheers, but I fear she is too far gone to be roused by a mere cheer now..."},{"name":"SYSTEM","text":"The tender lamb is fading fast."},{"name":"SYOJO00287","text":"Now is not the time for idle merriment, adventurer. <span class=\"highlight\">Cheer</span> for the lamb with all your heart, before it is too late!"},{"name":"SYSTEM","text":"The tender lamb twitched!"},{"name":"SYOJO00287","text":"It worked! Your fervent cheering has brought her back from the brink! But it is still not enough... Speak with her, adventurer─give voice to your passion, and arouse her ailing heart!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter “Don't give up!” to revitalize the tender lamb."},{"name":"SYOJO00287","text":"Your cheers staved off the darkness, adventurer, but she is still so weak... Tell her she must not give up! We believe in her!"},{"name":"SYSTEM","text":"The tender lamb looks up at you with bleary eyes."},{"name":"SYSTEM","text":"Don't give up!"},{"name":"SYSTEM","text":"The tender lamb pricks up her ears, and trembles all over."},{"name":"SYOJO00287","text":"Is it still not enough? No...there must still be a way. We must not lose faith. ...Why, that is it! You must show her the <span class=\"emphasis\">faith</span> you have in her! I beg you, adventurer─clear your mind of all but the lamb, and <span class=\"highlight\">pray</span> for her with all your heart!"},{"name":"SYOJO00287","text":"Your words had some effect, adventurer, but actions speak louder. Prithee, <span class=\"highlight\">pray</span> for her with all your heart, and prove your devotion!"},{"name":"SHEEPMISSIONARY","text":"She clings on to life with every onze of her being. Never have I seen such a tenacious will to survive."},{"name":"SYSTEM","text":"The tender lamb's breathing is labored, and she struggles to stand."},{"name":"SYOJO00287","text":"Come, adventurer─only you can save her! You must <span class=\"highlight\">pray</span> for her recovery!"},{"name":"SHEEPMISSIONARY","text":"It is no good... She is beyond help..."},{"name":"SYOJO00287","text":"Adventurer, look! The lamb, she...she...!"},{"name":"SHEEPMISSIONARY","text":"What in the─!? I can scarce believe my eyes! This is a miracle!"},{"name":"SYOJO00287","text":"A miraculous recovery indeed. But one that was never in doubt, to those sensible to the bond of trust between this <span class=\"alternative-container\"><span class=\"alternative\">woman and her</span><span class=\"alternative\">man and his</span></span> lamb."},{"name":"SYOJO00287","text":"...A bond that was forged as they journeyed this land together, bringing peace to troubled souls, and tempered by the love they came to share as comrades, allies, and friends."},{"name":"SHEEPMISSIONARY","text":"What hogwash! If the lamb's recovery can be explained, it will be in terms of the transfer of aetherial energies, not woolly words of “love” and “peace.”"},{"name":"SYOJO00287","text":"Tell me, bugyo─why do you think I gave you charge of this year's Heavensturn celebrations? It is because I know that there is none who loves the sheep more than you. But in your passion to prove their military worth, you hardened your heart to your true feelings."},{"name":"SYOJO00287","text":"The totem of the coming year is the sheep, but its patron deity is Menphina─the goddess of love and tenderness. I wished to have you reflect upon your <span class=\"emphasis\">love</span> for sheep, and not your plans for them."},{"name":"SHEEPMISSIONARY","text":"Love...and tenderness? I...I had not even considered such things. So this is why my plans came to naught... If there is no place in the Fleece Force for friendship, it is small wonder that the tender lamb took me for an enemy..."},{"name":"SHEEPMISSIONARY","text":"Is this why she would respond only to encouragement, and not hostility? Did she, too, wish to show me the error of my ways?"},{"name":"SHEEPMISSIONARY","text":"What a fool I have been..."},{"name":"SHEEPMISSIONARY","text":"<span class=\"alternative-container\"><span class=\"alternative\">My lady</span><span class=\"alternative\">My lord</span></span>─if I may still call you that─would you do this fool a great honor, and take charge of this lamb, for once and for all? I have done too much damage already to inflict myself upon her any longer."},{"name":"SHEEPMISSIONARY","text":"I fear her recent exertion may have divested her of her powers, but that is not the reason why I press her into your arms. I believe she would be...happier...by your side than by mine."},{"name":"SYOJO00287","text":"A new year, and a new friend... It seems your astrologians were correct, adventurer─the goddess of love is truly smiling down on you."}],"reward":{"gil":286,"items":[{"id":6207}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65788]}},"partials":[{"type":"npc","id":"1010715","obj":{"i":1010715,"n":"Hitsuji Bugyo","l":28,"q":4}},{"type":"npc","id":"1010727","obj":{"i":1010727,"n":"Tender Lamb","l":28,"q":1}},{"type":"npc","id":"1000938","obj":{"i":1000938,"n":"Ginnade","l":28,"q":6}},{"type":"npc","id":"1001217","obj":{"i":1001217,"n":"Swozblaet","l":29,"q":7}},{"type":"item","id":"6207","obj":{"i":6207,"n":"Tender Lamb","l":1,"c":59441,"t":81}},{"type":"item","id":"9269","obj":{"i":9269,"n":"Black Hitsuji Kabuto","l":1,"c":40180,"t":34,"p":71}},{"type":"item","id":"9270","obj":{"i":9270,"n":"Crimson Hitsuji Kabuto","l":1,"c":40178,"t":34,"p":71}},{"type":"item","id":"9271","obj":{"i":9271,"n":"White Hitsuji Kabuto","l":1,"c":40179,"t":34,"p":71}},{"type":"quest","id":"65788","obj":{"i":65788,"n":"Lions for Lambs","g":194,"l":"Limsa Lominsa","s":67}}]}