{"quest":{"name":"Hammer Time","location":"Limsa Lominsa","id":65829,"patch":2.0,"sort":50,"icon":100050,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1000997,"genre":137,"usedItems":[2341],"journal":["Forgemaster Brithael would like to evaluate your progress.","Satisfied with your recent progress, Brithael has tasked you with crafting three bronze cross-pein hammers. He has also suggested a number of ways to acquire materials, such as mining and hunting. Craft three bronze cross-pein hammers and present them to the forgemaster.","Your hammers have met with Brithael's approval, and he rewards your efforts with an amateur's file, which should prove most useful in the days to come. He urges you to familiarize yourself with the tool, and return once you have gained more experience.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 10."],"objectives":["Deliver bronze cross-pein hammers to Brithael."],"dialogue":[{"name":"BRITHAEL","text":"Praise the Builder, I was afraid ye might've joined up with another crew! The thought of it pained me so much, I was down at the Wench till the mornin' bells, I was."},{"name":"BRITHAEL","text":"But here you are, still brimmin' with potential─an' with some extra meat on yer smittin' arm, if me eyes don't deceive me!"},{"name":"BRITHAEL","text":"So, errr...somethin' new, somethin' new... O' course, how could I forget? <span class=\"highlight\">Forename Surname</span>, I bid ye craft three bronze cross-pein hammers─jus' like the ones all our apprentice smitties use."},{"name":"BRITHAEL","text":"Fer this ye'll need bronze, maple lumber, an' hempen cloth. Now, I know makin' the bronze won't pose ye no trouble, but allow me to offer ye a bit of advice regardin' the materials."},{"name":"BRITHAEL","text":"If ye want to save yerself some coin, ye might consider minin' yer own copper an' tin out in the wilds."},{"name":"BRITHAEL","text":"An' if that don't tickle yer fancy, ye might consider whackin' the odd coblyn till it stops movin'. They lug ore 'round with 'em, see. An' it ain't as if swingin' a sword's all that different from poundin' a lump o' metal into shape, is it?"},{"name":"BRITHAEL","text":"At the end o' the day, though, how ye go about gettin' the bits an' pieces don't matter to me. I jus' want to see if ye can make a decent hammer. Do what needs doin' an' come back when it's done."},{"name":"BRITHAEL","text":"Where are them hammers I asked for, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"BRITHAEL","text":"Heh heh...seems last time weren't no fluke. This here's some impressive work, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"BRITHAEL","text":"Now, a layman might look at this an' think ye'd jus' stuck a piece o' bronze on a maple stick, but ye've done a damn sight more than that─whether ye know it or not."},{"name":"BRITHAEL","text":"A hammer's a tool, after all, an' the head's got to grip the shaft fer tens o' thousands o' strikes."},{"name":"BRITHAEL","text":"What's more, when a smitty's poundin' a red-hot piece o' metal, <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> hammer takes up some o' the heat an' swells a touch. Which ain't a problem─unless it's a poorly made piece o' shite."},{"name":"BRITHAEL","text":"Take it from me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─there's few things more embarrassin' than flingin' a glowin' hammerhead over yer shoulder, straight into the eye o' yer newest apprentice...even if he <span class=\"emphasis\">did</span> eventually get his sight back."},{"name":"BRITHAEL","text":"But I reckon your hammers won't lead to any incidents like that!"},{"name":"BRITHAEL","text":"In short, I'm happy with what ye've done. Now, I'll spare us both the “don't rest on yer laurels” speech if it's all the same to you. Statin' the bleedin' obvious is best done with a drink in yer hand, I find."},{"name":"BRITHAEL","text":"But well done, anyroad."},{"name":"BRITHAEL","text":"Here, ye'll be needin' this."},{"name":"BRITHAEL","text":"A hammer'll suffice fer simple smithin', but complex jobs call fer a more delicate touch─which is what a file gives ye. Usin' one alongside yer hammer'll make yer life a good deal easier, whatever yer craftin'."},{"name":"BRITHAEL","text":"Try smithin' somethin' simple─I guarantee ye'll see the difference. An' when ye've done that, do it again. I want ye to practice till ye can wield that file as well as yer hammer! Once ye've got the hang of it, come back here fer another task!"},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">craftsmanship</span>, <span class=\"highlight\">control</span>, and <span class=\"highlight\">CP</span> values."},{"name":"SYSTEM","text":"A higher craftsmanship rating hastens the progress of synthesis; greater control increases the chance of creating high-quality items; and additional CP improves your crafting stamina."},{"name":"SYSTEM","text":"Outfitting yourself with an eye to your current objective will increase the efficiency of your crafting endeavors."}],"reward":{"gil":194,"items":[{"num":200,"id":2},{"num":150,"id":5},{"id":2355},{"id":2652,"one":1},{"id":3309,"one":1},{"id":3763,"one":1},{"num":3,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":10}],"quests":[65828]},"next":[65830]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"item","id":"2355","obj":{"i":2355,"n":"Amateur's File","l":5,"c":35151,"t":15,"p":133}},{"type":"item","id":"2652","obj":{"i":2652,"n":"Hempen Bandana","l":5,"c":41540,"t":34,"p":85}},{"type":"item","id":"3309","obj":{"i":3309,"n":"Hempen Chausses","l":5,"c":45048,"t":36,"p":94}},{"type":"item","id":"3763","obj":{"i":3763,"n":"Maple Pattens","l":5,"c":46122,"t":38,"p":129}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"2341","obj":{"i":2341,"n":"Bronze Cross-pein Hammer","l":8,"c":35101,"t":14,"p":263}},{"type":"quest","id":"65828","obj":{"i":65828,"n":"My First Cross-pein Hammer","g":137,"l":"Limsa Lominsa","s":11,"f":1}},{"type":"quest","id":"65830","obj":{"i":65830,"n":"Riveting Ramblings","g":137,"l":"Limsa Lominsa","s":100,"f":1}}]}