{"quest":{"name":"Rivalry and Respect","location":"Limsa Lominsa","id":65820,"patch":2.0,"sort":500,"icon":100049,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001000,"involved":[1001001,1001540],"genre":138,"usedItems":[3203],"journal":["Forgemaster H'naanza wishes to speak with you regarding Blanstyr's final challenge.","The final round in your contest against Blanstyr is to be judged by none other than the Admiral herself. To suffer defeat before the representatives of the Maelstrom would cause untold damage to the guild's reputation, not to mention your own. You cannot afford to lose! Affix a grade three heavens' eye materia to a high-quality cobalt haubergeon, and deliver it to Sergeant Zwynberk at Hawkers' Round.","After a rather unorthodox turn of events, Admiral Merlwyb has appraised the strength of your armor and found it superior to Blanstyr's. H'naanza, wishing to know if defeat has finally humbled the veteran artisan, bids you follow the stunned Roegadyn back to the Armorers' Guild to hear his thoughts.","Acknowledging his loss, Blanstyr has decided to spend some time away from the forge to rethink his narrow perspective. Return to the forgemaster, and pass on the beaten craftsman's message.","H'naanza, after hearing of your conversation with Blanstyr, explains that the Roegadyn's self-imposed isolation was to blame for his eventual downfall. The forgemaster believes that it is mutual respect and an atmosphere of friendly rivalry that truly allows an artisan to advance <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> craft. Though undeniably skilled, Blanstyr's hostility ultimately limited his improvement, allowing you to seize victory with superior techniques.<br><br>※The next armorer quest will be available from H'naanza once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Deliver a cobalt haubergeon <img class=\"hq-icon small\" src=\"images/item/hq.png\"> melded with a heavens' eye materia III to Zwynberk at Hawkers' Round.","Speak with Blanstyr.","Speak with H'naanza."],"dialogue":[{"name":"HNAANZA","text":"I must thank you again, <span class=\"highlight\">Forename</span>, for sacrificing your time and effort to help our guild with that order for the Maelstrom. It behooves us not to fail clients such as they, no matter the reason. But, as is our fate, we are rarely afforded a respite from the flames of the forge."},{"name":"HNAANZA","text":"I have recently been informed that Admiral Merlwyb will be inspecting various organizations─our own Armorers' Guild included─and their roles in promoting Limsa Lominsa's trade with the East."},{"name":"HNAANZA","text":"The impressions made during this inspection will have a direct influence on whom the Maelstrom chooses as the provider of its equipment and other sundry supplies."},{"name":"HNAANZA","text":"Blanstyr, in his usual arrogant manner, has proposed that we seize this opportunity to have the Admiral herself serve as arbiter for the final round of your contest."},{"name":"HNAANZA","text":"Ugh, imagine how that bastard would crow if you were to suffer defeat before the commander of Limsa Lominsa's Grand Company. The credence such a public failure would lend to his arguments would spell the end of the guild as we know it. You must not allow this to come to pass."},{"name":"HNAANZA","text":"Success in this third and final challenge hinges on your ability to forge what might need to be the most exquisite cobalt haubergeon in the realm. And, as you'd expect, it is one of the more demanding pieces of armor a student of our discipline can attempt."},{"name":"HNAANZA","text":"While I harbor not the slightest doubt that you will produce a haubergeon of surpassing quality, let us tip the scales in your favor by augmenting it with materia─a heavens' eye materia of the third grade should do the trick."},{"name":"HNAANZA","text":"Once your armor is complete, deliver it to Sergeant Zwynberk at Hawkers' Round and he will see it passed along to the Admiral."},{"name":"ZWYNBERK","text":"<span class=\"highlight\">Forename Surname</span>? Ah, you have a cobalt haubergeon for me, then? It would not do to keep Admiral Merlwyb waiting."},{"name":"ZWYNBERK","text":"Consider your submission accepted. I think you'll enjoy the Admiral's, uh, methods of appraisal."},{"name":"HNAANZA","text":"<span class=\"highlight\">Forename</span>. Blanstyr. This, the final round of your contest, will decide victory or defeat. May the best armorer win!"},{"name":"HNAANZA","text":"Admiral? Who are these gentlemen? Where are the mannequins?"},{"name":"MERWYB","text":"I find little can be learned from insipidly lifeless models, so I've decided to take a different tack. My men here will wear your armorers' submissions instead."},{"name":"HNAANZA","text":"I see. Do you intend them to take on varying poses for your inspection?"},{"name":"MERWYB","text":"In a manner of speaking. We wish to determine the quality of the armor, do we not? I prefer the direct approach."},{"name":"HNAANZA","text":"Byregot's beard! What kind of appraisal is <span class=\"emphasis\">this</span>!?"},{"name":"BLANSTYR","text":"Ye really that surprised, H'naanza? No finer way to test yer gear than in the heat o' battle."},{"name":"HNAANZA","text":"Using flesh and blood warriors is hardly necessary! What of the risks of injury?"},{"name":"BLANSTYR","text":"Heh, me armor was built to withstand far worse'n this. If those blokes get hurt by them oversized hatchets, then I ain't got no business bein' here. Ye agree on that score, don't ye, <span class=\"highlight\">Forename</span>?"},{"name":"MERWYB","text":"Well, well, it appears your claims to excellence are more than empty boasts. Let's raise the stakes, shall we?"},{"name":"HNAANZA","text":"Admiral! You go too far!"},{"name":"MERWYB","text":"Such expensive equipment is of little use to us if it cannot stop a bullet."},{"name":"MERWYB","text":"And lest you think me reckless, my men were never in any real danger─I quite carefully inspected the sturdiness of both haubergeons before we began. You are not the only one with an eye for quality, dear Forgemaster."},{"name":"MERWYB","text":"In any case...it appears we have a winner."},{"name":"BLANSTYR","text":"I don't... I don't believe it... The shot punched through me links? What's so damn different between your armor an' mine!?"},{"name":"MERWYB","text":"Perhaps the reason you cannot answer that question, armorer, is the reason you just lost to your colleague."},{"name":"BLANSTYR","text":"I─ Bloody hells."},{"name":"MERWYB","text":"This was a most educational─and entertaining─experience. When the Maelstrom next finds itself in need of replacement equipment, I believe I know just the sort of armorer to whom we shall turn."},{"name":"HNAANZA","text":"Congratulations, <span class=\"highlight\">Forename</span>! It was a close contest, but you've struck a telling blow here today nonetheless."},{"name":"HNAANZA","text":"The question is, does Blanstyr yet realize his folly? It would be best for you to seek him out to learn where we now stand."},{"name":"BLANSTYR","text":"Come to see me beaten an' broken, have ye? Ye've made a bloody fool out o' me."},{"name":"BLANSTYR","text":"Bah, I've made a fool out o' meself. I was just too thickheaded stubborn to see it comin'."},{"name":"BLANSTYR","text":"Reckon I ought to steer clear o' guild business fer a time─get me some distance to think on all o' this."},{"name":"BLANSTYR","text":"But ye tell that harpy H'naanza that she better not let this place fall to pieces─I'll still be watchin'."},{"name":"HNAANZA","text":"How very like Blanstyr to have the last word. At least now he seems to have grasped the idea that his way is not as absolute as he believed."},{"name":"HNAANZA","text":"After all, the greatest source of innovation is found in our connection with others. For instance, did you know that “kobold” was the original pronunciation of “cobalt”?"},{"name":"HNAANZA","text":"It was through trade with those beastman miners that we first encountered, and subsequently refined, the use of cobalt ore. Without such contact, it is unlikely that the armor you forged for the last round of your contest would even exist today."},{"name":"HNAANZA","text":"There is only so much an armorer can achieve on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own. It is mutual respect─and a healthy dose of friendly rivalry─that truly spurs the improvement of a craft."},{"name":"HNAANZA","text":"Blanstyr's gravest mistake was to see his rivals as <span class=\"emphasis\">enemies</span>. By walling himself off from his peers, he denied himself the knowledge of techniques which <span class=\"emphasis\">you</span> were grateful enough to receive. His defeat was inevitable."},{"name":"HNAANZA","text":"And it was your determination and skill that taught him the dangers of stagnation. You embody everything I stand for, <span class=\"highlight\">Forename</span>, and the guild is richer for your presence."},{"name":"SYSTEM","text":"This concludes the armorer quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next armorer quest will be available from H'naanza."}],"reward":{"items":[{"id":2379},{"id":2922,"one":1},{"id":3708,"one":1},{"id":3929,"one":1},{"num":3,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":11}],"quests":[65819]},"next":[67574]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1001540","obj":{"i":1001540,"n":"Zwynberk","l":29,"q":1}},{"type":"item","id":"2379","obj":{"i":2379,"n":"Kurdalegon","l":55,"c":35210,"t":16,"p":1000}},{"type":"item","id":"2922","obj":{"i":2922,"n":"Armorer's Visor","l":55,"c":40414,"t":34}},{"type":"item","id":"3708","obj":{"i":3708,"n":"Armorer's Gloves","l":55,"c":44188,"t":37}},{"type":"item","id":"3929","obj":{"i":3929,"n":"Armorer's Workboots","l":55,"c":46348,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"3203","obj":{"i":3203,"n":"Cobalt Haubergeon","l":48,"c":43087,"t":35}},{"type":"quest","id":"65819","obj":{"i":65819,"n":"For the Good of the Guild","g":138,"l":"Limsa Lominsa","s":450,"f":1}},{"type":"quest","id":"67574","obj":{"i":67574,"n":"The Breaking of Blanstyr","g":138,"l":"Limsa Lominsa","s":502,"f":1}}]}