{"quest":{"name":"Waiting in the Winglet","location":"Limsa Lominsa","id":65838,"patch":2.0,"sort":500,"icon":100050,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1000997,"involved":[1001005,1005177,1005178],"genre":137,"usedItems":[1663],"journal":["Forgemaster Brithael has a special commission only you can handle.","The guild is busier than ever due to your numerous past efforts. Countless customers have requested you by name, but Brithael has only seen fit to oblige a single one. Speak with Faezahr to learn the details of this special commission.","A former champion of the Coliseum has come all the way from Gridania to speak with you in person. You will find the client waiting for you on the platform just below the Drowning Wench, where you may speak in private.","The client, who chose not to divulge her name, wishes to furnish a struggling gladiator with a weapon that befits his skill and experience. This gladiator, known as the Bronze Bull, is apparently another former champion who has chosen to fight under a different name. You are to craft a quality cobalt winglet, meld to it a savage might materia of the third grade, and deliver the finished product to Faezahr.","Upon confirming that your sword satisfies the client's requirements, Faezahr summons the Bronze Bull to collect the weapon in person, while the anonymous client surreptitiously listens. The gladiator is at first puzzled by the gesture, unable to understand the motives of your patron. However, when Faezahr delivers a cryptic message, the Bronze Bull immediately identifies your client as the Hellfire Phoenix, who he thought had perished in the Calamity years ago. He accepts the sword, proclaiming that he will one day stand atop the Coliseum and do it justice, and leaves without meeting your client. Speak with her and see if these events transpired as she desired.","Your client explains that her desire to remain distant from the Coliseum and its affairs drove her to deliver the sword in this manner. Nevertheless, she could not resist using Greinfarr's words to reveal her identity to the former champion. Having entrusted your payment to the forgemaster, she bids you return to him to receive it.","Brithael reflects on how you single-handedly changed the guild's fortunes, stating that the impact of your deeds will be felt for years to come. With a glint in his eye and a smile on his face, he calls you one of the best blacksmiths he has ever known.<br><br>※The next blacksmith quest will be available from Brithael once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Faezahr.","Speak with the client.","Deliver a cobalt winglet <img class=\"hq-icon small\" src=\"images/item/hq.png\"> melded with a savage might materia III to Faezahr.","Speak with the client.","Report to Brithael."],"dialogue":[{"name":"BRITHAEL","text":"Good news, <span class=\"highlight\">Forename</span>! That gladiator ye outfitted, Muriel? Done the work of a million merchants fer us since! Her name's on the lips of every Coliseum fan, as is the name o' the smitty what forged her armaments!"},{"name":"BRITHAEL","text":"Our wares're sellin' faster than we can forge 'em, an' every member o' the guild is reapin' the benefits! Aye, the ale'll flow like wine at the Wench tonight!"},{"name":"BRITHAEL","text":"O' course, customers, they've been askin' for ye by name, but I tell 'em ye ain't got the time to personally craft all their butcher's knives an' bric-a-brac. I've certainly no intention o' shovelin' that drudgery off on ye."},{"name":"BRITHAEL","text":"But there's one commission what requires yer personal attention, I reckon. This one comes to us by way o' Faezahr, so pay the man a visit."},{"name":"BRITHAEL","text":"Before ye go, a word o' warnin': Faezahr's a solemn soul to begin with, but this job's got him wound tighter than ever, judgin' from his countenance. Best be prepared fer a bleedin' tough challenge."},{"name":"FAEZAHL","text":"There you are! Hear me, <span class=\"highlight\">Forename</span>─none other than the finest blacksmith in all Vylbrand will do for this task."},{"name":"FAEZAHL","text":"So renowned are your weapons that your name echoes through the distant wood of Gridania. So powerful your forge that it has bent their disdain for steel into admiration."},{"name":"FAEZAHL","text":"As such, a former champion of the Coliseum living amid the leaves has contacted me in hopes of engaging your services."},{"name":"FAEZAHL","text":"That is all I can say. The rest she would tell you herself."},{"name":"FAEZAHL","text":"The client wishes to meet with you in private, and will be waiting for you on the platform just below the Drowning Wench. Pray do not keep her waiting."},{"name":"JMOLDVA","text":"An honor, <span class=\"highlight\">Forename Surname</span>. I appreciate you coming all this way to meet with me."},{"name":"JMOLDVA","text":"I am told you are a blacksmith without peer. It is for this reason that I have come to seek your assistance."},{"name":"JMOLDVA","text":"The sword I would have you forge must befit a storied Coliseum champion─rather, a man who would become one once more."},{"name":"JMOLDVA","text":"This gladiator is recently returned to Ul'dah, and has chosen to fight under a different name, you see."},{"name":"JMOLDVA","text":"Perhaps you are familiar with the Bronze Bull? I thought not. His performance on the bloodsands has been less than stellar."},{"name":"JMOLDVA","text":"Despite his wealth of experience, he struggles. I have seen him fight; his weapons are his weakness. But I fear he thinks himself at fault."},{"name":"JMOLDVA","text":"Which brings me to my request: I wish to arm the Bronze Bull with a quality cobalt winglet, strengthened with a savage might materia of the third grade."},{"name":"JMOLDVA","text":"He is a far greater gladiator than his record suggests, and deserves better than the rubbish he wields."},{"name":"JMOLDVA","text":"When the sword is ready, deliver it to Faezahr. He shall see that the Bronze Bull receives it."},{"name":"FAEZAHL","text":"I am aware of the client's specifications. As soon as I verify that your sword is to her satisfaction, I shall contact the intended recipient."},{"name":"FAEZAHL","text":"You have outdone yourself yet again. Your task is almost complete."},{"name":"FAEZAHL","text":"In a most peculiar request, the client wishes to be on hand, yet out of sight, for the purveyance of her gift."},{"name":"FAEZAHL","text":"I shall attend to the arrangements. You need only be ready."},{"name":"GREINFARR","text":"Since when have you taken a fancy to a <span class=\"emphasis\">male</span> gladiator, Faezahr? What's all this really about?"},{"name":"FAEZAHL","text":"I assure you, you will not be displeased. Quite the opposite, I should hope."},{"name":"GREINFARR","text":"Pleased, then?"},{"name":"FAEZAHL","text":"Precisely. We come bearing a gift."},{"name":"GREINFARR","text":"A gift? For me? Hah! Give it to someone who deserves it. I'm in no mood to be fawned over."},{"name":"FAEZAHL","text":"Due to your mounting defeats, no doubt."},{"name":"GREINFARR","text":"I know my record, merchant."},{"name":"FAEZAHL","text":"Ah, but that is the very reason I believe this gift will lift your spirits. Behold the cure for your recent woes─a sword like no other!"},{"name":"GREINFARR","text":"This blade, I've...I've never seen its equal. Did you forge this, smith?"},{"name":"GREINFARR","text":"I would be proud to call it my own."},{"name":"FAEZAHL","text":"I believe that is precisely what our patron intended."},{"name":"GREINFARR","text":"Care to tell me who your patron is? And why he sees fit to confer upon me such a treasure?"},{"name":"FAEZAHL","text":"I can say only that <span class=\"emphasis\">she</span> prays for your success. It is her hope that with this sword you will win new glory, and that these words will help you to remember that of old:"},{"name":"FAEZAHL","text":"“The way of the sword is such that all who walk it become lost.”"},{"name":"GREINFARR","text":"...<span class=\"emphasis\">Her</span> words, eh?"},{"name":"GREINFARR","text":"Well, I don't see why she had to orchestrate this mummer's farce. I would've gladly accepted the sword from her in person."},{"name":"FAEZAHL","text":"Oh?"},{"name":"GREINFARR","text":"Aye. I thought the Calamity had claimed her life."},{"name":"GREINFARR","text":"Heh, I should've known better than to think the Hellfire Phoenix would die so easily."},{"name":"GREINFARR","text":"And now it is my turn to take wing."},{"name":"GREINFARR","text":"On my honor, I shall one day stand atop the Coliseum, and do this sword justice."},{"name":"JMOLDVA","text":"Greinfarr's no fool. I suspect he knew I was present the moment <span class=\"emphasis\">his</span> words left Faezahr's lips."},{"name":"JMOLDVA","text":"Hm? Why not give him the sword in person? It is...complicated."},{"name":"JMOLDVA","text":"Simply put, I will not involve myself directly in Coliseum affairs. Long ago, I swore never again to take up sword or spear for sport."},{"name":"JMOLDVA","text":"I have entrusted the forgemaster with your honorarium. Please accept it with my heartfelt thanks."},{"name":"BRITHAEL","text":"Well, look who's back from bringin' in another fortune!"},{"name":"BRITHAEL","text":"I don't know how ye do it, <span class=\"highlight\">Forename</span>, but I'm glad yer doin' it fer us."},{"name":"BRITHAEL","text":"If ye hadn't come along when ye did an' helped us turn things around with yer quality smithin', I reckon I'd be another workless drunk drownin' me sorrows at the Wench."},{"name":"BRITHAEL","text":"Instead, I'm a happily employed drunk celebratin' me <span class=\"emphasis\">successes</span> at the Wench!"},{"name":"BRITHAEL","text":"Ye know, any lout with a tool can put passion into <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> work, but to have it come out the other side an' <span class=\"emphasis\">affect</span> folk is true artistry."},{"name":"BRITHAEL","text":"An' make no mistake, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>: the impact of what ye've done fer the guild will be felt fer years to come."},{"name":"BRITHAEL","text":"Yer one o' the best godsdamned smitties I've had the pleasure o' knowin', <span class=\"highlight\">Forename</span>. There ain't nothin' more to say than that."},{"name":"SYSTEM","text":"This concludes the blacksmith quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next blacksmith quest will be available from Brithael."}],"reward":{"items":[{"id":2354},{"id":2921,"one":1},{"id":3707,"one":1},{"id":3928,"one":1},{"num":3,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":10}],"quests":[65837]},"next":[67543]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1001005","obj":{"i":1001005,"n":"Faezahr","l":28,"q":6}},{"type":"npc","id":"1005177","obj":{"i":1005177,"n":"Well-traveled Miqo'te","l":28,"q":1}},{"type":"npc","id":"1005178","obj":{"i":1005178,"n":"Well-traveled Miqo'te","l":28,"q":1}},{"type":"item","id":"2354","obj":{"i":2354,"n":"Vulcan","l":55,"c":35111,"t":14,"p":1000}},{"type":"item","id":"2921","obj":{"i":2921,"n":"Blacksmith's Goggles","l":55,"c":40904,"t":34}},{"type":"item","id":"3707","obj":{"i":3707,"n":"Blacksmith's Gloves","l":55,"c":44192,"t":37}},{"type":"item","id":"3928","obj":{"i":3928,"n":"Blacksmith's Workboots","l":55,"c":46352,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"1663","obj":{"i":1663,"n":"Cobalt Winglet","l":49,"c":30436,"t":2}},{"type":"quest","id":"65837","obj":{"i":65837,"n":"Beauty and the Bardiche","g":137,"l":"Limsa Lominsa","s":450,"f":1}},{"type":"quest","id":"67543","obj":{"i":67543,"n":"Forging Northwards","g":137,"l":"Limsa Lominsa","s":502,"f":1}}]}