{"quest":{"name":"By the Sweat of Your Brow","location":"Limsa Lominsa","id":65832,"patch":2.0,"sort":200,"icon":100050,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1000997,"genre":137,"usedItems":[2344],"journal":["Forgemaster Brithael has important news he would like to share with you.","It appears Faezahr has made progress towards securing new contracts for the guild, largely thanks to the samples you supplied. After congratulating himself on a job well done, Brithael assigns you your next task. Not only must you craft him an iron cross-pein hammer, but you must also attach a single materia to it. Should your knowledge of materia be lacking, he suggests you consult the goblin Mutamix in central Thanalan. Prepare the requested item and deliver it to the forgemaster.","Brithael has nothing but the highest praise for your hammer, confessing that he covets the tool for his own use. He goes on to suggest that your talents might prove key to promoting the guild's services to a wider audience─though what that would entail remains a subject for another day.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 25."],"objectives":["Deliver a materia-enhanced iron cross-pein hammer to Brithael."],"dialogue":[{"name":"BRITHAEL","text":"Jus' the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> I was hopin' to see. Yer a bleedin' godssend, ye know that?"},{"name":"BRITHAEL","text":"Ye'll be happy to hear that the treefolk were mightily impressed with them samples ye made fer that son of a whore."},{"name":"BRITHAEL","text":"Heh! Even the shrew had to admit I'd done a good job!"},{"name":"BRITHAEL","text":"But who gives a damn about business, eh? Yer here to smith, am I right!? So be a good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> an' whip us up an iron cross-pein hammer, will ye?"},{"name":"BRITHAEL","text":"Oh, before ye run off, I should prob'ly mention that Smydhaemr ain't sellin' iron at present. Grand Company contracts take priority, see, an' the shipwrights need all the stock we can lay our hands on."},{"name":"BRITHAEL","text":"So ye'll have to get the iron on yer own, be it by minin' or buyin'. I'd sooner go to Hawkers' Alley, meself, but then it ain't my coin."},{"name":"BRITHAEL","text":"An' one more thing─I don't want jus' <span class=\"emphasis\">any</span> iron cross-pein hammer, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I want one melded with materia."},{"name":"BRITHAEL","text":"Ye know what materia is, don't ye? It's like, er...say I'd got an apron I'd been usin' fer years an' years, an' it'd got all soaked through with sweat, but instead o' just sweat, it'd taken up a bit o' me, er...spiritual essence, or somethin'..."},{"name":"BRITHAEL","text":"Well, that essence can be pulled out an' turned into stuff called “materia,” which is like a sort o' crystal that ye can attach to gear to make it stronger an' so on."},{"name":"BRITHAEL","text":"Needless to say, I don't know how materia works, but there's s'posed to be a gobbie who does. Name's Mutamix if memory serves, an' he's got a camp out in Thanalan. Track him down if ye need some proper guidance."},{"name":"BRITHAEL","text":"Got that hammer fer me yet? Don't forget that she needs a piece o' materia stuck to her as well. Any kind'll do, by the way─don't have to be from an apron."},{"name":"BRITHAEL","text":"Damn fine work as always, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"},{"name":"BRITHAEL","text":"She's got good heft, this one─the kind ye jus' don't get with bronze. Ye'd tire quicker, o' course, but that's a failin' o' the arm, not the tool."},{"name":"BRITHAEL","text":"An' even after ye'd worked up a sweat, I reckon her cotton-wrapped grip would keep her firmly in yer hand, where she belongs. Ahhh..."},{"name":"BRITHAEL","text":"It's common fer smitties to make their own tools, ye know. There's no better way o' gettin' jus' what ye want, see─assumin' yer half-decent."},{"name":"BRITHAEL","text":"I fer one have always made me own... Bugger me, though...I'm startin' to wish I'd asked ye fer two o' these so I could keep one fer meself!"},{"name":"BRITHAEL","text":"Heh...ye really should let me buy you a drink sometime, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"BRITHAEL","text":"Ye've done a lot fer me, an' I don't want ye to think me ungrateful. In fact, I'm wonderin' if we oughtn't to put yer skills on display more prominently─really show our potential customers what the guild has to offer."},{"name":"BRITHAEL","text":"No need to fret about that fer the time bein', though. You jus' keep hammerin' away, all right?"},{"name":"BRITHAEL","text":"Take it from me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>: ye'll do yer best work when yer only concerns are the hammer in yer hand an' the vision in yer head. Byregot's blessin's be upon ye."}],"reward":{"gil":470,"items":[{"id":2344},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":10}],"quests":[65831]},"next":[65833]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"item","id":"2344","obj":{"i":2344,"n":"Iron Cross-pein Hammer","l":18,"c":35102,"t":14,"p":725}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65831","obj":{"i":65831,"n":"The Business of Blacksmithing","g":137,"l":"Limsa Lominsa","s":150,"f":1}},{"type":"quest","id":"65833","obj":{"i":65833,"n":"True as Steel","g":137,"l":"Limsa Lominsa","s":250,"f":1}}]}