{"quest":{"name":"As Iron Sharpens Iron","location":"Limsa Lominsa","id":65834,"patch":2.0,"sort":300,"icon":100050,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1000997,"involved":[1000971,1001005],"genre":137,"usedItems":[2551],"journal":["Forgemaster Brithael is eyeing you with an ominous grin on his face. It may be wise to inquire as to why.","Apparently, your recent accomplishments have not gone unnoticed. According to Brithael, a wealthy Ul'dahn has requested you by name for a prestigious commission. Speak with Faezahr for more information.","Although the commission represents a chance to win respect and renown, Faezahr warns you that failure is not an option. He then directs you to meet with the client's representative, a woman named Khuswyb. Summon your courage and address her directly.","Khuswyb's master wishes to present his chief groundsman with a plumed iron hatchet in recognition of his loyal service. Needless to say, your client will settle for nothing short of perfection. Craft a plumed iron hatchet of unsurpassed quality and present it to Khuswyb.","Your masterpiece has a profound impact on Khuswyb, and she accepts it with great fanfare. Relay the good news to Faezahr.","Faezahr seems unsurprised by your success, though he is quick to note Khuswyb's enthusiastic endorsement. The trader then begrudgingly bids you bear word of your success to the forgemaster─though not before once again expressing his low opinion of the man. Return to Brithael and report all that has transpired.","Brushing aside Faezahr's comments, Brithael reminisces about the day you first joined the Blacksmiths' Guild, claiming that he always knew you had the potential for greatness. He then swears that as long as you remain loyal to the guild, you will be able to count on its unwavering support.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 35."],"objectives":["Speak with Faezahr.","Speak with Khuswyb.","Deliver a plumed iron hatchet <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Khuswyb.","Speak with Faezahr.","Report to Brithael."],"dialogue":[{"name":"BRITHAEL","text":"Been waitin' fer ye to come an' see me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Seems ye've got yerself an admirer! An' I ain't talkin' about me, neither─I'm talkin' about someone else!"},{"name":"BRITHAEL","text":"'Twas only a matter o' time before folk started askin' questions about who was responsible fer the guild's recent change in fortunes."},{"name":"BRITHAEL","text":"You heard o' Costa del Sol─out in Bloodshore?"},{"name":"BRITHAEL","text":"'Cause that's where yer new admirer lives. 'Case ye don't know the place, it's a favorite resort of Ul'dah's rich an' famous. Aye, that's right─I'm talkin' about one o' <span class=\"emphasis\">them</span>! Asked fer you by name, they did. Said they wished to commission <span class=\"emphasis\">the great <span class=\"highlight\">Forename Surname</span></span> and no other! Hah hah!"},{"name":"BRITHAEL","text":"This could be yer chance, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! It ain't every day ye get invited to curry favor with such a wealthy bleedin' client."},{"name":"BRITHAEL","text":"At first I thought it was just Byregot who was watchin' over ye, but I'm beginnin' to think that two-faced bugger Nald'thal might've taken an interest, an' all!"},{"name":"BRITHAEL","text":"Anyway, ye'll do it, won't ye? Bah! 'Course ye bloody will! Ye'd be a godsdamned fool to refuse!"},{"name":"BRITHAEL","text":"Ye'll need to trouble that bastard Faezahr fer the details... Oh, an' though it sticks in me throat to say it, I reckon ye should prob'ly thank the chocobo's arse while yer at it─he's the one as made this happen."},{"name":"FAEZAHL","text":"Well met, smith. I gather you've heard about your commission?"},{"name":"FAEZAHL","text":"I trust you understand what an honor this is..."},{"name":"FAEZAHL","text":"As well as what's at stake."},{"name":"FAEZAHL","text":"The client in question is a distinguished personage with <span class=\"emphasis\">tremendously</span> high expectations. Should you fail to live up to them, it will reflect poorly on both you and your guild. As for myself, the <span class=\"emphasis\">last</span> thing I need is a well-connected Ul'dahn telling his associates not to buy your products─products, I need hardly add, which I should very much like to sell them."},{"name":"FAEZAHL","text":"In short: <span class=\"emphasis\">don't fail</span>."},{"name":"FAEZAHL","text":"Now then, I believe I saw Miss Khuswyb arrive a moment ago. She is our client's representative. Go inside and introduce yourself to her. She will explain the commission."},{"name":"KHUSWYB","text":"I've heard a great deal about you, <span class=\"highlight\">Forename Surname</span>."},{"name":"KHUSWYB","text":"As you may have heard, my master was captivated by the tales of your exceptional craftsmanship, and thought you the ideal candidate to undertake a commission of particular import to him."},{"name":"KHUSWYB","text":"By way of an introduction, my master's estate boasts the most spectacular gardens in all of Costa del Sol. Its many botanical marvels owe much to the efforts of our chief groundsman, who has nurtured them since he was a lad. The dear old fellow has been with the family for generations now, and my master feels it is past time that his years of faithful service be recognized."},{"name":"KHUSWYB","text":"And what better way to honor the tireless efforts of one's loyal servant than to present him with an exquisitely wrought example of the tool of his beloved trade?"},{"name":"KHUSWYB","text":"In short, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Surname</span>, my master would like to commission a plumed iron hatchet of the first order."},{"name":"KHUSWYB","text":"Know that anything less than perfection will be deemed unacceptable."},{"name":"KHUSWYB","text":"We trust you will not disappoint us."},{"name":"FAEZAHL","text":"You certainly rose to the occasion. Expertly done, smith."},{"name":"FAEZAHL","text":"And it seems Miss Khuswyb has marked you out as a crafter of outstanding skill. If her master agrees with her assessment, this may well be the first of many such commissions."},{"name":"FAEZAHL","text":"You have every right to be proud."},{"name":"FAEZAHL","text":"I suppose your <span class=\"emphasis\">mentor</span> will want to know what's transpired. &lt;sigh&gt; I swear, your talents are truly wasted serving that fool."},{"name":"FAEZAHL","text":"You may tell him I said so, if you wish. You're a damn good smith, <span class=\"highlight\">Forename</span>. You can do better."},{"name":"BRITHAEL","text":"Ah, there you are, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Well tell us how it went, then!<br>...Eh? He said that, did he? Cheeky sod! Talkin' like he knows what it means to be a smitty... There ain't <span class=\"emphasis\">no one</span> as knows better than me, an' I've only ever wanted what's best fer ye!"},{"name":"BRITHAEL","text":"I still remember the day ye first walked in here, ye know... 'Twas clear to me even then that ye'd got a will of iron. Somethin' in yer eyes, there was─somethin' as told me ye'd give yer all to the craft, not fer coin or fer fame, but fer the sake o' makin' somethin' <span class=\"emphasis\">good</span>."},{"name":"BRITHAEL","text":"An' that's jus' what we need 'round here. So don't let us down, <span class=\"highlight\">Forename</span>. Stick with us, and we'll do right by ye."},{"name":"KHUSWYB","text":"Do you have the hatchet?"},{"name":"KHUSWYB","text":"My... Though I count myself no expert in such matters, even I am sensible to this hatchet's quality. It is...magnificent."},{"name":"KHUSWYB","text":"Master Faezahr's words did not do you justice. You are a veritable prodigy, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"KHUSWYB","text":"Your hatchet is more a work of art than a tool. When I run my fingers along its smooth leather grip and gaze upon its flawless, sparkling blade, I find that I am...<span class=\"emphasis\">moved</span>."},{"name":"KHUSWYB","text":"It seems a great shame to allow such a masterpiece to be used for mere gardening."},{"name":"KHUSWYB","text":"But...tools are made for a purpose. Mayhap, as the blade dulls and the grip wears, it will gain a different sort of beauty..."},{"name":"KHUSWYB","text":"Ah, but I am beginning to sound like our chief groundsman. Such a gentle soul... I am quite sure that he will see the artistry in your creation. Why, it may even serve to inspire him in his own craft. You should be proud."},{"name":"KHUSWYB","text":"On behalf of my lord, I thank you, <span class=\"highlight\">Forename Surname</span>. Pray give my regards to Master Faezahr."}],"reward":{"gil":639,"items":[{"id":2347},{"id":2750,"one":1},{"id":3104,"one":1},{"id":3583,"one":1},{"num":2,"id":5825,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":10}],"quests":[65833]},"next":[65835]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1000971","obj":{"i":1000971,"n":"Khuswyb","l":28,"q":1}},{"type":"npc","id":"1001005","obj":{"i":1001005,"n":"Faezahr","l":28,"q":6}},{"type":"item","id":"2347","obj":{"i":2347,"n":"Heavy Crowsbeak Hammer","l":29,"c":35107,"t":14,"p":2718}},{"type":"item","id":"2750","obj":{"i":2750,"n":"Velveteen Beret","l":29,"c":41032,"t":34}},{"type":"item","id":"3104","obj":{"i":3104,"n":"Velveteen Gown","l":30,"c":42071,"t":35,"p":2499}},{"type":"item","id":"3583","obj":{"i":3583,"n":"Velveteen Shortgloves","l":28,"c":44081,"t":37,"p":1453}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"2551","obj":{"i":2551,"n":"Plumed Iron Hatchet","l":28,"c":38105,"t":30,"p":2388}},{"type":"quest","id":"65833","obj":{"i":65833,"n":"True as Steel","g":137,"l":"Limsa Lominsa","s":250,"f":1}},{"type":"quest","id":"65835","obj":{"i":65835,"n":"Set Faezahr to Stun","g":137,"l":"Limsa Lominsa","s":350,"f":1}}]}