{"quest":{"name":"Step Nine","location":"Central Thanalan","id":65839,"patch":2.0,"sort":23,"eventIcon":71201,"issuer":1001500,"target":1001541,"involved":[1001455],"genre":1,"journal":["Cicidoa needs a reliable adventurer to deliver a gift to the Coffer & Coffin.","To repay a debt of gratitude, Cicidoa wishes to give Roger a pumpkin, which he has purchased from the Royal Plantations.","The pumpkin grown at the Royal Plantations is as prodigiously plump as promised. Deliver it to Roger at the Coffer & Coffin.","Roger thanks you for delivering the pumpkin. He believes that his patrons will benefit from a more balanced diet─though whether or not they will take to the new menu remains to be seen."],"objectives":["Present the receipt to Gagari.","Deliver the pumpkin to Roger."],"dialogue":[{"name":"CICIDOA","text":"You're an adventurer, yes? If you're not otherwise occupied, I've a favor to ask. I've resolved to repay a debt of gratitude, which I owe to the owner of the Coffer & Coffin."},{"name":"CICIDOA","text":"For this purpose, I've purchased from the Royal Plantations a prodigiously plump pumpkin─a particularly popular piece of produce."},{"name":"CICIDOA","text":"Alas, I cannot part this place to procure and proffer the pumpkin. You see, the scheduled shipment from the Nanawa Mines, for which I wait, is late."},{"name":"CICIDOA","text":"I would prevail upon you to pick up the pumpkin in my stead, and see it safely to the Coffer & Coffin. Present this receipt of purchase to Gagari at the Royal Plantations, and she will yield it to you."},{"name":"CICIDOA","text":"I apologize for asking you to attend to this time-consuming task, but I truly appreciate your assistance!"},{"name":"GAGARI","text":"If Cicidoa doesn't come calling soon, this spectacular specimen shall sadly be past its prime..."},{"name":"GAGARI","text":"Oh, so you're to deliver this decadent delight? I can say with confidence that any gourmand would be grateful for such a grand gift."},{"name":"GAGARI","text":"Here is the pumpkin. I hope it meets with Roger's approval."},{"name":"GAGARI","text":"Fresh produce is somewhat scarce in these parts, and as such we are always deluged with demand."},{"name":"GAGARI","text":"You know the way to the Coffer & Coffin, correct? It is beyond the bridge to the northwest. Look for a place where local laborers lounge."},{"name":"ROGER","text":"Drink fer ye, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">laddie</span></span>? Ye won't get better ale or spirits fer yer coin than at me place."},{"name":"ROGER","text":"What's that? Wee Cicidoa asked ye to bring this here to me? Ha! Heh, so even that foul-mouthed drunk knows the meanin' o' remorse. Reckon this is fer the time I carried his drink-sodden arse back home."},{"name":"ROGER","text":"But hells, an honest-to-gods pumpkin from the Royal Plantations! I can't wait to see what the cooks'll do with her."},{"name":"ROGER","text":"The lads here scoff down beastly amounts o' meat, an' it's startin' to tell on their health. It'll be good to get more vegetables in their bellies─assumin' I can get the stubborn bastards to try somethin' new. Thanks fer the help, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">laddie</span></span>!"}],"reward":{"gil":139,"items":[{"num":2,"id":4639}],"xp":1950},"reqs":{"jobs":[{"lvl":4,"id":130}],"quests":[66086]},"next":[65860,69388]},"partials":[{"type":"npc","id":"1001500","obj":{"i":1001500,"n":"Cicidoa","l":43,"q":1}},{"type":"npc","id":"1001541","obj":{"i":1001541,"n":"Roger","l":43,"q":4}},{"type":"npc","id":"1001455","obj":{"i":1001455,"n":"Gagari","l":43,"q":3}},{"type":"item","id":"4639","obj":{"i":4639,"n":"Marmot Steak","l":5,"c":24355,"t":46,"p":9}},{"type":"quest","id":"66086","obj":{"i":66086,"n":"Underneath the Sultantree","g":1,"l":"Central Thanalan","s":20}},{"type":"quest","id":"65860","obj":{"i":65860,"n":"Disorderly Conduct","g":0,"l":"Central Thanalan","s":26}},{"type":"quest","id":"69388","obj":{"i":69388,"n":"Prudence at This Junction","g":1,"l":"Central Thanalan","s":30}}]}