{"quest":{"name":"Beauty and the Bardiche","location":"Limsa Lominsa","id":65837,"patch":2.0,"sort":450,"icon":100050,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1001539,"involved":[1001005],"genre":137,"usedItems":[1723,1796,1659],"journal":["Forgemaster Brithael is delighted to see you.","Everyone at the Blacksmiths' Guild is in high spirits of late, and Brithael is no exception. The forgemaster even managed to enjoy the company of Faezahr for a change, who over drinks with Brithael spoke of his latest obsession: a young female gladiator, whom he has a mind to lavish with gifts. Precisely what those gifts are to be remains to be seen, but what is clear is that Faezahr means to ask you to craft them.","Faezahr bids you craft a pair of cobalt knuckles, a buccaneer's bardiche, and a cobalt shamshir worthy of his gladiator muse, Muriel. Naturally, it will be necessary for him to first inspect and approve of the weapons prior to delivery. Craft the items to the best of your ability and present them to Faezahr when finished.","The merchant waxes poetic as he evaluates your weapons, before judging them fit for his warrior goddess. Believing it only proper for Muriel to meet the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who made such splendid wares, Faezahr bids you deliver his gifts to Muriel, who can be found aboard the <span class=\"emphasis\">Astalicia</span>.","Muriel treasures the gifts you have brought, and seems overjoyed to have made your acquaintance─so overjoyed, in fact, that you cannot help but question the sincerity of her words. In any case, the commission is complete; should Faezahr be unsatisfied with the result, the fault will not lie with you.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 50."],"objectives":["Speak with Faezahr.","Present a pair of cobalt knuckles <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a buccaneer's bardiche <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a cobalt shamshir <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Faezahr.","Deliver the cobalt knuckles <img class=\"hq-icon small\" src=\"images/item/hq.png\">, the buccaneer's bardiche <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and the cobalt shamshir <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Muriel."],"dialogue":[{"name":"BRITHAEL","text":"'Tis a good time to be a smitty, <span class=\"highlight\">Forename</span>! Clients're bangin' down our doors, clamorin' fer our wares..."},{"name":"BRITHAEL","text":"And to think it's all 'cause one fateful day, I had the foresight to let ye join our ranks... Smartest thing I ever done!"},{"name":"BRITHAEL","text":"Aye, in prosperous times such as these, ye can't help but be in high spirits. Even yer most hated enemies start to seem like decent folk.  Why, just the other day, I downed a few pints with ol' Faezahr! Oh, speakin' o' which..."},{"name":"BRITHAEL","text":"Faezahr was goin' on an' on about this lady gladiator what caught his eye, one he'd like to lavish with gifts. Said he'd a mind to have ye forge the weapons."},{"name":"BRITHAEL","text":"Ah, but you know him. Demanded to speak to ye in person. Best go on an' oblige the bastard."},{"name":"FAEZAHL","text":"<span class=\"highlight\">Forename</span>, good of you to come. I knew no other whom I could call upon."},{"name":"FAEZAHL","text":"Her name is Muriel. She is both muse and genius─a portrait of grace and beauty amid the carnage of war, expertly versed in every technical discipline of combat."},{"name":"FAEZAHL","text":"Muriel is more than a mere gladiator─she is an <span class=\"emphasis\">artist</span>. If she is to paint the battlefield red, only the finest of instruments will suffice. And such instruments can only be created by the greatest of blacksmiths."},{"name":"FAEZAHL","text":"Thus, I would ask of you a pair of cobalt knuckles, a buccaneer's bardiche, and a cobalt shamshir with which she might reign over the Coliseum like the goddess she is."},{"name":"FAEZAHL","text":"I will inspect your work when it is complete. Though I have little reason to doubt your capabilities, I will <span class=\"emphasis\">not</span> present to Muriel anything less than perfection."},{"name":"FAEZAHL","text":"Knuckles, a bardiche, and a shamshir. They must be fit for a goddess."},{"name":"FAEZAHL","text":"Hm. While your weapons look most impressive, I must properly appraise your work. Inside."},{"name":"FAEZAHL","text":"Ah, the knuckles. A sturdy and stable design for a straightforward weapon."},{"name":"FAEZAHL","text":"The lack of superfluous ornamentation speaks to an emphasis on function."},{"name":"FAEZAHL","text":"Next, we come to the bardiche. A brutish, base weapon likely born of the beast tribes."},{"name":"FAEZAHL","text":"Initially, I feared its barbaric origins might sully Muriel's angelic hands, but I firmly believe there is no weapon her feminine touch cannot civilize."},{"name":"FAEZAHL","text":"And lastly, the shamshir. The seductive curvature of the blade is sinister in its simplicity."},{"name":"FAEZAHL","text":"You have taken notoriously obstinate cobalt and bent it to your will. Again you exceed my every expectation."},{"name":"FAEZAHL","text":"I can only imagine Muriel's joy upon seeing such splendid wares. Let her gaze upon the face of the one who forged them. You will find her aboard the <span class=\"emphasis\">Astalicia</span>."},{"name":"MURIEL","text":"Hm? Ah, yes, the gifts I was promised. It is good to know Faezahr is a man of his word, though personally I prefer a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action. Show me what you've got."},{"name":"MURIEL","text":"Most impressive indeed! I am humbled. With your weapons in my grip, victory is all but assured."},{"name":"MURIEL","text":"Faezahr certainly possesses an eye for the finer things. Yet the eye that finds beauty interests me less than the hands that craft it─the strong, skilled hands of an artisan like yourself..."},{"name":"MURIEL","text":"Gladiator and blacksmith make quite a pair, do we not? What is a weapon without a wielder? Or a wielder without a weapon? We complete each other."},{"name":"MURIEL","text":"I came to Limsa Lominsa to see your wares at the old man's behest, and found everything he promised and more. Know that in the heat of battle, as I clutch them tightly in my hands, my thoughts will be of you."}],"reward":{"items":[{"id":2351},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":10}],"quests":[65836]},"next":[65838]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1001539","obj":{"i":1001539,"n":"Muriel","l":29,"q":1}},{"type":"npc","id":"1001005","obj":{"i":1001005,"n":"Faezahr","l":28,"q":6}},{"type":"item","id":"2351","obj":{"i":2351,"n":"Cobalt Cross-pein Hammer","l":43,"c":35108,"t":14,"p":5737}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"1723","obj":{"i":1723,"n":"Cobalt Knuckles","l":43,"c":31018,"t":1}},{"type":"item","id":"1796","obj":{"i":1796,"n":"Buccaneer's Bardiche","l":45,"c":31426,"t":3,"p":9504}},{"type":"item","id":"1659","obj":{"i":1659,"n":"Cobalt Shamshir","l":46,"c":30453,"t":2,"p":6577}},{"type":"quest","id":"65836","obj":{"i":65836,"n":"Forging Ahead","g":137,"l":"Limsa Lominsa","s":400,"f":1}},{"type":"quest","id":"65838","obj":{"i":65838,"n":"Waiting in the Winglet","g":137,"l":"Limsa Lominsa","s":500,"f":1}}]}