{"quest":{"name":"Set Faezahr to Stun","location":"Limsa Lominsa","id":65835,"patch":2.0,"sort":350,"icon":100050,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1001005,"genre":137,"usedItems":[1778],"journal":["Forgemaster Brithael has had to take on more smithing than he can anvil.","Brithael's love of drink has caught up with him, as he appears to be suffering from a prolonged hangover. Unfortunately, this means that he is in no condition to fill Faezahr's latest commission. Offer your services to the merchant on behalf of the forgemaster.","The steel bhuj Faezahr seeks to have forged is intended as a present for his favorite axeman, and he will accept nothing less than the finest quality. Craft the item to the best of your ability and present it to Faezahr for inspection.","Your bhuj elicits an uncharacteristic expression of bloodlust from Faezahr, though he manages to quickly regain his composure. Once again impressed with your fine display of craftsmanship, the merchant hints that he will have more work for you in future.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 40."],"objectives":["Speak with Faezahr.","Deliver a steel bhuj <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Faezahr."],"dialogue":[{"name":"BRITHAEL","text":"Ugh... Somethin' evil's brewin' in me belly, I tell ye. Can't seem to─<span class=\"emphasis\">hurk</span>─keep anythin' down. Too many at the Wench, I reckon."},{"name":"BRITHAEL","text":"Couldn't have come at a worse time either, with Faezahr breathin' down me neck..."},{"name":"BRITHAEL","text":"Now when it comes to the market, ye've never met a tighter miser than ol' Faezahr, but at the Coliseum, the man throws gold at fighters like water at a fire."},{"name":"BRITHAEL","text":"They know it, too! So they ask their patron fer a new blade. An' once they get their blade, now it's a bigger, sharper, shinier blade. Before you know it, I'm wastin' me wakin' bells forgin' weapons fer folk what ain't got arms enough to wield 'em all!"},{"name":"BRITHAEL","text":"Don't get me wrong─I'd gladly take the whoreson's coin. But I ain't up to it this time, on account o' me condition."},{"name":"BRITHAEL","text":"Which is why I need ye to make whatever needs makin' in me stead. Have a word with Faezahr an' see what he wants."},{"name":"FAEZAHL","text":"So, Brithael sends you to me yet again? I am flattered he holds me in such esteem."},{"name":"FAEZAHL","text":"As you may have heard, I have an eye for able warriors. Yet without the proper arms and armaments, ability is for naught."},{"name":"FAEZAHL","text":"Forge me one steel bhuj of equal parts splendor and might, and you and Brithael shall know the bounty of my generosity."},{"name":"FAEZAHL","text":"But fail me, <span class=\"highlight\">Forename</span>, and I may be forced to reconsider my arrangement with Naldiq & Vymelli's."},{"name":"FAEZAHL","text":"One steel bhuj, <span class=\"highlight\">Forename</span>. Make the greatest weapon you've ever made, then throw it away and make me a better one!"},{"name":"FAEZAHL","text":"You've come with my gift? Excellent. Let us have a look, shall we?"},{"name":"FAEZAHL","text":"I demanded nothing short of perfection, and you have exceeded my every expectation, <span class=\"highlight\">Forename</span>. A finer bhuj I have never seen."},{"name":"FAEZAHL","text":"A well-wrought oak haft with a solid steel blade, more than sharp enough to slice through sinew and bone."},{"name":"FAEZAHL","text":"Many an aurochs' neck shall it cleave. I cannot wait to see it wielded."},{"name":"FAEZAHL","text":"Yes, the glory of the steel bhuj you have forged for me shall be sung in the screams of all who stand before it!"},{"name":"FAEZAHL","text":"Ahem. I see my trust in you was not misplaced, <span class=\"highlight\">Forename</span>. And I trust I shall have need of your skills in the future."}],"reward":{"items":[{"id":2349},{"id":2769,"one":1},{"id":3130,"one":1},{"id":3607,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":10}],"quests":[65834]},"next":[65836]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1001005","obj":{"i":1001005,"n":"Faezahr","l":28,"q":6}},{"type":"item","id":"2349","obj":{"i":2349,"n":"Steel Crowsbeak Hammer","l":34,"c":35057,"t":14,"p":3869}},{"type":"item","id":"2769","obj":{"i":2769,"n":"Mythril Magnifiers","l":34,"c":40901,"t":34,"p":2953}},{"type":"item","id":"3130","obj":{"i":3130,"n":"Apprentice's Smock","l":36,"c":42185,"t":35}},{"type":"item","id":"3607","obj":{"i":3607,"n":"Linen Halfgloves","l":33,"c":44161,"t":37,"p":2195}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"1778","obj":{"i":1778,"n":"Steel Bhuj","l":34,"c":31424,"t":3,"p":5927}},{"type":"quest","id":"65834","obj":{"i":65834,"n":"As Iron Sharpens Iron","g":137,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"65836","obj":{"i":65836,"n":"Forging Ahead","g":137,"l":"Limsa Lominsa","s":400,"f":1}}]}