{"quest":{"name":"Axe in the Stone","location":"Limsa Lominsa","id":65849,"patch":2.0,"sort":50,"icon":100053,"unlocksFunction":1,"eventIcon":71341,"issuer":1000927,"target":1000927,"involved":[1002108,1002679,1002680],"genre":129,"journal":["Axemaster Wyrnzoen wishes you to experience a traditional marauder training method.","Wyrnzoen has instructed you to speak with a fellow marauder to learn the nature of the training you are to undertake. Find Broenbhar in the practice area downstairs.","Broenbhar explains that marauders develop strength and precision by splitting rocks with their axes. To try your hand at this traditional training method, head out to the Rogue River in middle La Noscea and speak with Rhotgeim.","Rhotgeim bids you shatter the stones she has prepared. Destroy the solid rocks on the bank of the river using the Heavy Swing technique.","You have shattered three solid rocks. Report to the waiting Rhotgeim.","Rhotgeim bids you shatter yet more rocks. Destroy the solid rocks on the bank of the river with your Heavy Swing ability.","You have shattered yet another three solid rocks. Report to the waiting Rhotgeim.","Rhotgeim seems pleased with your rock-shattering ability. Return to the Marauders' Guild and report to Axemaster Wyrnzoen.","Upon returning to the guild, you learn that Axemaster Wyrnzoen has assigned you to respond to an urgent request from the Red Rooster Stead─a duty that involves slaying murderous megalocrabs. Solkwyb, a veteran conjurer, will aid you in this task. Seek her out within the guild before you depart for lower La Noscea.","You speak with the conjurer, Solkwyb, and learn more of the duty that lies ahead. Meet her at the megalocrab nest near the Mourning Widow in lower La Noscea.","As you are searching through the megalocrab nest, you are approached by a desperate old man by the name of Neddard. Rush to the aid of his grandson, Sighard, before the boy is slain by the rampaging crustaceans.","You have slain the megalocrabs and rescued Neddard's grandson from a grisly fate. After thanking you for saving him, Sighard pleads with you to avenge his parents by slaying the fearsome creature responsible for their deaths. Return to the Marauders' Guild and report the situation to Axemaster Wyrnzoen.","You report the outcome of your duty to Axemaster Wyrnzoen. The veteran marauder, however, already appears to have knowledge of the creature that slew Sighard's parents. He commends your desire to seek vengeance on the boy's behalf, but warns that you are currently no match for this territorial monstrosity. Nurture your rage and hone your skills before attempting to grant Sighard's fervent wish.<br><br>※The next marauder quest will be available from Wyrnzoen upon reaching level 10."],"objectives":["Speak with Broenbhar.","Speak with Rhotgeim.","Use Heavy Swing to destroy the solid rocks.","Speak with Rhotgeim in middle La Noscea.","Use Heavy Swing to destroy the solid rocks.","Speak with Rhotgeim.","Report to Axemaster Wyrnzoen at the Marauders' Guild.","Speak with Solkwyb.","Investigate the megalocrab nest in lower La Noscea.","Rescue Sighard.","Report to Axemaster Wyrnzoen at the Marauders' Guild."],"dialogue":[{"name":"WYRNZOEN","text":"<span class=\"highlight\">Forename</span>. You approach me with a marauder's strides: determined, unswerving, and bereft of the hesitation that marked our first meeting. I am pleased. The time has come for you to begin a new stage in your training."},{"name":"WYRNZOEN","text":"Now, what sets the axe aside from the gladius or the dagger? It is the raw, unstoppable destruction wrought by its thick, heavy blade. And that overwhelming power can only be properly directed by extraordinary physical strength."},{"name":"WYRNZOEN","text":"Thus we come to the core of this day's lesson. Such strength as a marauder must possess is developed through a traditional method passed down through the generations of the guild. A method that you, too, shall be taught to employ."},{"name":"WYRNZOEN","text":"Present yourself to Broenbhar in the practice area downstairs, and he shall instruct you further."},{"name":"BROENBHAR","text":"The axemaster told me ye'd be on yer way. Me name's Broenbhar. Good it is to meet a new marauder!"},{"name":"BROENBHAR","text":"Now, we axe-wielders build strength an' control by splittin' boulders. That's right─our traditional method involves smashin' a rock with yer axe."},{"name":"BROENBHAR","text":"But ye can't use just any ol' swing; ye need to hit the rock just so. Rhotgeim, a fellow marauder, is waitin' just outside the Zephyr Gate, by the bridge over the Rogue River. She'll tell ye how it's done."},{"name":"RHOTGEIM","text":"Greetin's, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Ready to split some stone, are ye? I've three nice, hard rocks for ye to build up a sweat on. Don't try nothin' fancy now, just hit 'em with a good, solid, Heavy Swing."},{"name":"SYSTEM","text":"Destroy the solid rock with your Heavy Swing ability."},{"name":"RHOTGEIM","text":"That's the way to do it, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Now ye've got the idea, why don't ye have at 'em a little harder with that Heavy Swing o' yers? Hold nothin' back."},{"name":"RHOTGEIM","text":"Aye, I can see yer a natural. Me head's still ringin' with the sound o' crackin' boulders. Take yerself back to Axemaster Wyrnzoen and let him know yer ready for somethin' harder."},{"name":"WYRNZOEN","text":"Has the training loosened your muscles and focused your mind, <span class=\"highlight\">Forename</span>? An urgent request for help has arrived from the Red Rooster Stead, and I have chosen you to respond. It appears a hostile group of megalocrabs has unwittingly elected itself the next test of your prowess."},{"name":"WYRNZOEN","text":"As this is your first outing on official marauder duty, you shall be accompanied by a veteran conjurer by the name of Solkwyb. She awaits you on the floor below. May devastation follow in your wake."},{"name":"SOLKWYB","text":"Aye, <span class=\"highlight\">Forename</span>, I know who you are. My brother often has me escort his fledgling marauders on their more dangerous tasks. I suppose Wyrnzoen expects me to give you the details, then? Very well."},{"name":"SOLKWYB","text":"It seems the farmers need us to clear out a megalocrab nest near the Mourning Widow in lower La Noscea. I shall trust you to find your own way there─just don't forget your axe."},{"name":"SOLKWYB","text":"Hmph, looks as if nobody's home. Mayhap they knew we were coming...?"},{"name":"NEDDARD","text":"Aid! I need aid!"},{"name":"NEDDARD","text":"&lt;pant&gt; &lt;pant&gt; Please, it's my grandson! Them snippers've got 'im! I <span class=\"emphasis\">told</span> Sighard not to get too close! I told 'im..."},{"name":"SOLKWYB","text":"Get that weapon ready, <span class=\"highlight\">Forename</span>! We need to move. Now."},{"name":"SIGHARD","text":"Ah, bugger an' shite! Get away from me, ye bloody great bastard!"},{"name":"SIGHARD","text":"Eh? Oh! Oh, thank ye, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>!"},{"name":"SCENE00027","text":"Duty calls. Do you wish to proceed with<br>“Axe in the Stone”?"},{"name":"SCENE00027","text":"Yes"},{"name":"SCENE00027","text":"No"},{"name":"SIGHARD","text":"Thank ye, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! I thought I was dead fer sure!"},{"name":"SIGHARD","text":"I can't even play outside no more, what with all these scary monsters about. Me ma and me da, they was both killed by some nasty bugger not so long ago─an aurochs, big as a mountain..."},{"name":"SIGHARD","text":"But I bet <span class=\"emphasis\">you</span> could beat it! Aye, make it pay fer what it did to me folks!"},{"name":"SOLKWYB","text":"You take it easy now, son─there's a whole guild full of strapping lads and lasses like <span class=\"highlight\">Forename</span> here who'll be glad to do just that."},{"name":"SOLKWYB","text":"All you need do is head home with your grandpa. You let us worry about that big “nasty bugger.”"},{"name":"SOLKWYB","text":"Consider your first duty a success, <span class=\"highlight\">Forename</span>. It's time you headed back as well, before Wyrnzoen begins to worry I've left your corpse for the crabs."},{"name":"WYRNZOEN","text":"So, you have shattered the shells of the megalocrabs and saved the life of a child into the bargain. Thus does our violent craft prove its merit. Well done, <span class=\"highlight\">Forename</span>."},{"name":"WYRNZOEN","text":"Though no longer a threat to the farmers, you should know that it is unusual for such crabs to be found so near the Stead. By all accounts, the creatures were ousted from their usual feeding grounds by a more fierce beast."},{"name":"WYRNZOEN","text":"The beast of which I speak is a known terror in the lands of La Noscea, ever seeking to expand its territory."},{"name":"WYRNZOEN","text":"And that boy's parents were but two of the many victims to fall to its rampages. It is a threat that must be dealt with ere long."},{"name":"WYRNZOEN","text":"Do thoughts of vengeance flit through your mind, <span class=\"highlight\">Forename</span>? Nurture those urges, but do not yet act upon them─this monstrosity is far beyond your present skills. If you would answer the lad's cry for revenge, then you must grow stronger. Become the raging behemoth this challenge demands."},{"name":"QIB","text":"Defeat the megalocrabs!"},{"name":"SOLKWYB","text":"I will soothe your wounds, <span class=\"highlight\">Forename</span>!"},{"name":"SOLKWYB","text":"Do not stray too far from my side!"},{"name":"BROENBHAR","text":"Got room for one more?<br>Can't let the novice have all the fun!"},{"name":"BROENBHAR","text":"Some o' these bastards are harder than the damn boulders!"}],"reward":{"items":[{"id":1750},{"id":3005,"one":1},{"id":2653,"one":1},{"id":3530,"one":1},{"id":27634,"one":1},{"num":5,"id":5823,"one":1}],"xp":560},"reqs":{"jobs":[{"lvl":5,"id":4}],"questsType":"any","quests":[65847,65848]},"next":[65850,65851]},"partials":[{"type":"npc","id":"1000927","obj":{"i":1000927,"n":"Wyrnzoen","l":28,"q":12,"t":"Guildmaster"}},{"type":"npc","id":"1002108","obj":{"i":1002108,"n":"Rhotgeim","l":30,"q":1}},{"type":"npc","id":"1002679","obj":{"i":1002679,"n":"Solkwyb","l":28,"q":1}},{"type":"npc","id":"1002680","obj":{"i":1002680,"n":"Broenbhar","l":28,"q":2}},{"type":"item","id":"1750","obj":{"i":1750,"n":"Bronze War Axe","l":5,"c":31401,"t":3,"p":223}},{"type":"item","id":"3005","obj":{"i":3005,"n":"Custom-made Cuirass","l":6,"c":48028,"t":35,"p":100}},{"type":"item","id":"2653","obj":{"i":2653,"n":"Leather Eyepatch","l":5,"c":40914,"t":34,"p":141}},{"type":"item","id":"3530","obj":{"i":3530,"n":"Fingerless Leather Gloves","l":5,"c":44060,"t":37,"p":126}},{"type":"item","id":"27634","obj":{"i":27634,"n":"Altered Thighboots","l":5,"c":49077,"t":38}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"quest","id":"65847","obj":{"i":65847,"n":"Way of the Marauder","g":129,"l":"Limsa Lominsa","s":11,"f":1}},{"type":"quest","id":"65848","obj":{"i":65848,"n":"My First Axe","g":129,"l":"Limsa Lominsa","s":12,"f":1}},{"type":"quest","id":"65850","obj":{"i":65850,"n":"Wake of Destruction","g":129,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65851","obj":{"i":65851,"n":"Wake of Destruction","g":129,"l":"Limsa Lominsa","s":100,"f":1}}]}