{"quest":{"name":"Way of the Marauder","location":"Limsa Lominsa","id":65847,"patch":2.0,"sort":11,"icon":100053,"unlocksFunction":1,"eventIcon":71341,"issuer":1000926,"target":1000927,"genre":129,"journal":["Blauthota wishes you to reaffirm your desire to join the Marauders' Guild.","Blauthota bids you speak with Axemaster Wyrnzoen, whose approval you must obtain if you wish to join the guild.","Though somewhat grim of word and demeanor, Axemaster Wyrnzoen nevertheless welcomes you to the Marauders' Guild. As a new student of the axe, you are bid by the hulking Roegadyn to waste no time in testing the edge of your chosen weapon in combat. Head to the outskirts of Limsa Lominsa and slay three lost lambs, three wharf rats, and three little ladybugs.","You have slain the specified creatures. Return to the Marauders' Guild and report to Axemaster Wyrnzoen.","You return to the guild with a greater awareness of your weapon's brutal potential. To fully realize that potential, however, Wyrnzoen encourages you to hone your skill and strength with relentless determination.<br><br>※The next marauder quest will be available from Wyrnzoen upon reaching level 5."],"objectives":["Speak with Axemaster Wyrnzoen.","Slay wharf rats.","Slay lost lambs.","Slay little ladybugs.","Report to Axemaster Wyrnzoen at the Marauders' Guild."],"dialogue":[{"name":"BLAUTHOTA","text":"Ye've decided to swing an axe with the marauders, then?"},{"name":"Q1","text":"blank"},{"name":"A1","text":"blank"},{"name":"A1","text":"blank"},{"name":"BLAUTHOTA","text":"That's yer choice, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─the axe ain't for everyone. May the Navigator guide ye on whichever path ye decide to set yer feet on."},{"name":"BLAUTHOTA","text":"Alright, then. All that needs doin' now is to speak with the axemaster himself. Sounds simple? I've seen folk slink out the door rather than put 'emselves in the path o' that unnervin' glare."},{"name":"BLAUTHOTA","text":"That's the bloke right there in the middle o' the room. Wyrnzoen's his name. Put some steel in yer spine an' look him straight in the eye when ye talk to him, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Good fortune to ye."},{"name":"WYRNZOEN","text":"Yes. I am Wyrnzoen. “Axemaster” they call me. Not the most imaginative of titles, I agree, but one should not underestimate the value of directness. I welcome your interest in our guild."},{"name":"WYRNZOEN","text":"The art of the marauder is used to rend, to cleave, and to destroy. It is not our way to simply outfight our adversaries; we seek to <span class=\"emphasis\">overwhelm</span> them."},{"name":"WYRNZOEN","text":"A marauder must be the most powerful and enduring presence on the battlefield; we must account for the most enemies defeated. Our role in combat is that of a steel whirlwind, dealing death and destruction without equal."},{"name":"WYRNZOEN","text":"No doubt the question has already been put to you by Blauthota, but once more shall I challenge your commitment: are you prepared for the bloody carnage that awaits an initiate of the Marauders' Guild?"},{"name":"Q2","text":"Are you prepared for carnage?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"WYRNZOEN","text":"You recoil at the thought of shattered bone and hewn flesh? Then it is well you choose to turn away from this path. There is no dishonor in knowing your own strengths...or weaknesses."},{"name":"WYRNZOEN","text":"Very well. Your name? Attend me well, then, <span class=\"highlight\">Forename</span>. Hold fast to this moment of dedication. The path of the marauder is a jagged and perilous one─the blood that spills at your feet will ofttimes be your own."},{"name":"WYRNZOEN","text":"You stand now as a student of the axe─let us waste no time in testing the edge of your chosen weapon. You shall wade straightway into combat as befits a novice of our discipline."},{"name":"WYRNZOEN","text":"Go forth and slay the bleating, scurrying, crawling pests that plague the outskirts of Limsa Lominsa."},{"name":"WYRNZOEN","text":"Lost lambs, wharf rats, and little ladybugs shall be your piteous adversaries this day. Return to me once three of each creature have fallen to your blade."},{"name":"WYRNZOEN","text":"You are returned to me a different <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. Already your face shows a harder cast; a realization of the slaughter of which you are capable."},{"name":"WYRNZOEN","text":"But there is much training to be done before you will wield the axe to its fullest potential. Learn well your lessons, build your strength, and make of each swing an instinctive act."},{"name":"WYRNZOEN","text":"You shall have this hunting log to aid you in that endeavor. Its pages are marked with opponents suitable for honing your skills."},{"name":"WYRNZOEN","text":"There are, of course, myriad methods by which you might improve your techniques, but when the way forward is not readily apparent, the log provides a reliable source of challenges."},{"name":"WYRNZOEN","text":"Every blow of your weapon will clear another step towards the mastery of the marauder way. Implacable, relentless─such must be your momentum on both the practice grounds and the battlefield."},{"name":"SYSTEM","text":"The next marauder quest will be available from Wyrnzoen upon reaching level 5."}],"reward":{"job":3,"items":[{"num":5,"id":4639}],"xp":100},"reqs":{"jobs":[{"lvl":1,"id":4}]},"next":[65849,65850]},"partials":[{"type":"npc","id":"1000926","obj":{"i":1000926,"n":"Blauthota","l":28,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1000927","obj":{"i":1000927,"n":"Wyrnzoen","l":28,"q":12,"t":"Guildmaster"}},{"type":"item","id":"4639","obj":{"i":4639,"n":"Marmot Steak","l":5,"c":24355,"t":46,"p":9}},{"type":"quest","id":"65849","obj":{"i":65849,"n":"Axe in the Stone","g":129,"l":"Limsa Lominsa","s":50,"f":1}},{"type":"quest","id":"65850","obj":{"i":65850,"n":"Wake of Destruction","g":129,"l":"Limsa Lominsa","s":100,"f":1}}]}