{"quest":{"name":"The Tasting of the Shrews","location":"Central Thanalan","id":65840,"patch":2.0,"sort":70,"eventIcon":71221,"issuer":1001460,"target":1001460,"genre":93,"journal":["Wowobaru needs an adventurer to furnish him with fresh shrew meat.","The popularity of smoked shrew loaves at the Coffer & Coffin is such that Wowobaru can never have enough shrew meat. While he has several shrews trapped outside, he does not have the stomach for butchering the beasts. Do the deed in Wowobaru's stead and take the meat to him.","You slaughter the shrews and harvest choice cuts from their carcasses. Take the fresh meat to Wowobaru.","Crisis averted, Wowobaru thanks you for replenishing his stores of shrew meat. Alas, because the cooking process is quite time-consuming, it seems you will have no opportunity to sample the freshly prepared product."],"objectives":["Slay the captured shrews.","Deliver the shrew meat to Wowobaru."],"dialogue":[{"name":"WOWOBARU","text":"Ah, bugger! My stores of shrew meat are nearly naught!"},{"name":"WOWOBARU","text":"The meat is an indispensable ingredient for making my smoked shrew loaves, which are famous for their fantastic flavor."},{"name":"WOWOBARU","text":"Fortunately, I am no fool. In preparation for this possibility, I have set two barrel traps outside our establishment."},{"name":"WOWOBARU","text":"Alas, I am not accustomed to butchering live beasts. If you could do the deed in my stead and bring me the meat, I can continue to cook."},{"name":"WOWOBARU","text":"Have you carved up the critters? Quickly, else my customers will complain!"},{"name":"WOWOBARU","text":"This rich, robust redness! Shrew meat is lean yet lovely, I'll learn you! "},{"name":"WOWOBARU","text":"Slathered in my secret sauce and smoked, it is a symphony of savory sensations that will satisfy even the most critical connoisseur."},{"name":"WOWOBARU","text":"It takes time to prepare it properly, though, so I fear we may be forced to deny our dedicated customers their desired dinner regardless..."},{"name":"POP","text":"A shrew bursts forth and lashes out in anger!"}],"reward":{"gil":141,"xp":1120},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65858]}},"partials":[{"type":"npc","id":"1001460","obj":{"i":1001460,"n":"Wowobaru","l":43,"q":2}},{"type":"quest","id":"65858","obj":{"i":65858,"n":"Listen to Your Fish","g":93,"l":"Central Thanalan","s":70}}]}