{"quest":{"name":"Prudence at This Junction","location":"Central Thanalan","id":65842,"patch":2.0,"sort":30,"eventIcon":71201,"target":1001447,"genre":0,"journal":["Warin wishes to inspect your equipment before he will set you to task.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Roger at the Coffer & Coffin.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","A single piece of equipment can be the difference between life and death. Now satisfied that you are suitably outfitted, Warin is ready to assign you a task."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Roger at the Coffer & Coffin.</span>"],"dialogue":[{"name":"WARIN","text":"We Stone Torches are sellswords hired by Amajina & Sons Mineral Concern to protect its interests. Our primary duty here is to keep the tracks clear of pests, and it is for this purpose that we require your aid."},{"name":"WARIN","text":"You have proven that you have some skill at arms, but before I send you into the midst of fell fiends, I would inspect your gear."},{"name":"WARIN","text":"A single piece of gear can mean the difference between life and death. I'll not have it on my conscience that I sent an ill-equipped adventurer to an untimely demise."},{"name":"WARIN","text":"See to it that your arms and armor are in order. When you are ready, present yourself to me again."},{"name":"SYSTEM","text":"Equip your head, body, hands, legs, and feet with gear of item level 5 or above before returning to speak with Warin."},{"name":"WARIN","text":"So you are ready for inspection?"},{"name":"WARIN","text":"Good. Everything appears in order."},{"name":"WARIN","text":"Yet know that naught is guaranteed in this world. Fate is a fickle mistress, after all. At any rate, capable adventurers like you are few and far between, and I would not have you throw your life away."},{"name":"WARIN","text":"I have had to bury too many comrades who brushed aside cracks in their hauberks and dints in their helms. No matter what you face, do not disregard the importance of gear."},{"name":"WARIN","text":"By the gods, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! However in the seven hells did you survive the antlings equipped as poorly as you are? I cannot in good conscience send you to face savage beasts until your gear is in order."},{"name":"SYSTEM","text":"Equip your head, body, hands, legs, and feet with gear of item level 5 or above before returning to speak with Warin."}],"reward":{"xp":1785},"reqs":{"jobs":[{"lvl":4,"id":130}],"quests":[65841]}},"partials":[{"type":"npc","id":"1001447","obj":{"i":1001447,"n":"Warin","l":43,"q":6}},{"type":"quest","id":"65841","obj":{"i":65841,"n":"Until a Quieter Time","g":0,"l":"Central Thanalan","s":29}}]}