{"quest":{"name":"Bringing Down the Mountain","location":"Limsa Lominsa","id":65855,"patch":2.0,"sort":300,"icon":100053,"unlocksFunction":1,"eventIcon":71341,"issuer":1000927,"target":1000927,"involved":[1002115,1002686,1002689,1002713,1002714,1002715],"genre":129,"journal":["Axemaster Wyrnzoen appears to have some urgent news for you.","Wyrnzoen informs you that Kujata has been spotted in lower La Noscea. Before seeking to do battle with the rampaging beast, the axemaster bids you first visit Sighard at the Red Rooster Stead.","Sighard has once again begged you to slay the beast responsible for the death of his parents. It seems, however, that you will not be alone in the task. Speak with Solkwyb and Broenbhar before leaving the Stead, and enlist their aid for the coming battle.","Solkwyb and Broenbhar are both eager to stand at your side as you seek to bring down the Stampeding Mountain. Follow Broenbhar's advice, and track down Kujata by following the beast's trail of destruction.","You have found the broken remnants of a pot, but Kujata is nowhere to be seen. Continue following the trail left by him and his pack of rapacious scavengers.","You have discovered the shattered pieces of a barrel on the side of the road, but have yet to spot Kujata. Continue following the trail of destruction left behind by the monster and his pack.","You have stumbled upon the splintered remains of a crate, but Kujata himself appears to have since moved on. Continue your search for the vile beast and the ravenous creatures that follow him.","You have finally caught up with Kujata and ended the murderous aurochs' terrible rampage. Wyrnzoen appears with Sighard and Neddard in tow, just in time to help celebrate your hard-won victory. Sighard is overcome with gratitude. Now that you have freed the boy from his burden of vengeance, he has decided to pursue the path of a hero. All that remains is to speak with your waiting colleagues.","Wyrnzoen, Solkwyb, and Broenbhar all applaud the mighty deed you have accomplished. Return to Limsa Lominsa, and speak with the axemaster once more back at the guild.","Wyrnzoen, having imparted to you all the knowledge of axecraft that he possesses, bids you venture beyond the teachings of the guild. And once you have attained a new peak of marauder perfection, he hopes you will return to share your discoveries. The world─with all its wondrous and deadly challenges─is yours to explore."],"objectives":["Speak to Sighard at the Red Rooster Stead.","Speak with Solkwyb.","Speak with Broenbhar.","Inspect the trail of destruction.","Speak with Wyrnzoen.","Speak with Solkwyb.","Speak with Broenbhar.","Speak with Wyrnzoen at the Marauders' Guild."],"dialogue":[{"name":"WYRNZOEN","text":"<span class=\"highlight\">Forename</span>. Your confrontation with the beast is at hand─Kujata has made his presence known."},{"name":"WYRNZOEN","text":"Reports place the creature to the northeast of the Red Rooster Stead, in the vicinity of the Grey Fleet."},{"name":"WYRNZOEN","text":"There is little more for me to say but this: harness all the strength you have built through your labors of sweat and blood, and unleash it full-fury upon Kujata and his menagerie of scavengers."},{"name":"WYRNZOEN","text":"Sighard yet lies abed, trusting in your strength and praying for your victory."},{"name":"WYRNZOEN","text":"I ask that you go to the lad before the battle, and tell him you venture forth to fell the object of his vengeance. Such news should cheer his ailing heart."},{"name":"WYRNZOEN","text":"The time is come, <span class=\"highlight\">Forename Surname</span>! May your axe strike deep and true!"},{"name":"SIGHARD","text":"<span class=\"highlight\">Forename</span>... I'm sorry fer makin' trouble."},{"name":"SIGHARD","text":"No, I deserved what I got. It's me own fault fer not believin' in ye..."},{"name":"SIGHARD","text":"B-But ye came back anyway! And now yer gonna take that axe to Kujata's head, ain't ye!?"},{"name":"SIGHARD","text":"I know ye can beat that bastard! Ye got to!"},{"name":"SIGHARD","text":"Please, <span class=\"highlight\">Forename</span>! Ye got to make 'im pay!"},{"name":"SOLKWYB","text":"I heard Kujata had reared his ugly head again, and reckoned you'd not be too far behind."},{"name":"SOLKWYB","text":"I hope you won't object to me lending what aid I can. We've been through much, you and I, and I would see this tale to its end."},{"name":"SOLKWYB","text":"Broenbhar, well, he felt much the same. So here we are─a pack of two to offset the ravenous beasts that follow in Kujata's wake."},{"name":"BROENBHAR","text":"Might be as I'm stickin' me nose in where it ain't wanted, but I couldn't abide the thought o' ye facin' that monster solo. Kujata's got <span class=\"emphasis\">his</span> friends, so it's only fair if ye've got a couple, too."},{"name":"BROENBHAR","text":"An' what're friends for if not to lighten yer load? I already did some o' the groundwork for ye. Seems like a farmer an' his wain have fallen victim to the fiend's pack."},{"name":"BROENBHAR","text":"If we follow the trail o' destruction, it might just lead us to the big bugger himself."},{"name":"SYSTEM","text":"You find a pot that appears to have been dragged from the farmer's wain."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"SYSTEM","text":"You find a barrel that appears to have been dragged from the farmer's wain."},{"name":"SYSTEM","text":"You find a crate that appears to have been dragged from the farmer's wain."},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“Bringing Down the Mountain”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"SIGHARD","text":"<span class=\"highlight\">Forename</span>!"},{"name":"WYRNZOEN","text":"It appears our timing was fortuitous."},{"name":"SIGHARD","text":"The axemaster carried me 'ere so's I could see..."},{"name":"SIGHARD","text":"Ye did it. Ye really did it..."},{"name":"SIGHARD","text":"&lt;sniffle&gt; Ma? Da? Do ye see? <span class=\"highlight\">Forename</span> killed the bastard! 'E's finally dead!"},{"name":"SIGHARD","text":"Thank ye. Thank all of ye."},{"name":"SIGHARD","text":"<span class=\"highlight\">Forename</span>? Do ye reckon I could learn to swing an axe like that?"},{"name":"SIGHARD","text":"When I's bigger, I mean. I want to protect folk, too. Keep 'em safe from...ye know, monsters an' things."},{"name":"WYRNZOEN","text":"If you train hard, then naught is beyond your reach, young man."},{"name":"SIGHARD","text":"Then that's what I'll do! I'll train every single day!"},{"name":"SIGHARD","text":"Ye'll see! I'll be the strongest 'ero there ever was!"},{"name":"WYRNZOEN","text":"It is done, <span class=\"highlight\">Forename</span>. You have answered the boy's prayers, and upheld the pride of the guild."},{"name":"WYRNZOEN","text":"Hold your head high, marauder! I shall be awaiting your triumphant return to Limsa Lominsa!"},{"name":"SOLKWYB","text":"Well done, <span class=\"highlight\">Forename</span>! I knew from the first moment we met that you would rise to meet any challenge!"},{"name":"BROENBHAR","text":"I saw it with me own eyes, an' I can still scarce believe it. Ye brought down the Mountain..."},{"name":"WYRNZOEN","text":"That was truly a mighty feat, <span class=\"highlight\">Forename</span>. Never have I seen a marauder so dedicated to attaining the pinnacle of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> discipline."},{"name":"WYRNZOEN","text":"In recognition of your achievements, I, Axemaster Wyrnzoen, pass on to you our guild's final technique: the Thrill of Battle."},{"name":"WYRNZOEN","text":"This skill teaches you to embrace the fear and danger of combat, allowing you to push well beyond the normal limits of your stamina."},{"name":"WYRNZOEN","text":"Though the thought brings me both joy and sadness, there is naught more I can teach you. May the memories of your time here at the guild sustain you as you strive for ever greater heights of perfection."},{"name":"WYRNZOEN","text":"Experience, now, shall be your tutor. There will always be greater foes and deadlier challenges on which to test your blade─of that, I am certain."},{"name":"WYRNZOEN","text":"You enter a realm of our craft in which even I have never set foot. I only hope that when you reach the very boundaries of our art, you will return to share your triumphs with us. Until then, <span class=\"highlight\">Forename</span>, may your axe ever swing true!"},{"name":"QIB","text":"Defeat Kujata!"},{"name":"SOLKWYB","text":"This is it, <span class=\"highlight\">Forename</span>.<br>Send the beast to the abyss!"},{"name":"BROENBHAR","text":"Focus on fightin' Kujata!<br>Leave the hyenas to me!"},{"name":"SOLKWYB","text":"Be on your guard!<br>He's up to something!"},{"name":"SOLKWYB","text":"I can barely close your wounds!<br>What has he done to you!?"},{"name":"SOLKWYB","text":"Ugh, no wonder his victims<br>were so hard to heal!"},{"name":"SOLKWYB","text":"Hold on, <span class=\"highlight\">Forename</span>!"},{"name":"BROENBHAR","text":"More damn hyenas!<br>Quickly now─put that bastard down!"},{"name":"BROENBHAR","text":"When did me axe...get so heavy...?"},{"name":"SOLKWYB","text":"And thus the tale ends for me..."}],"reward":{"action":40,"items":[{"id":1769},{"id":3102,"one":1},{"id":2755,"one":1},{"id":3599,"one":1},{"id":3825,"one":1},{"num":3,"id":5825,"one":1}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":4}],"quests":[65854]},"next":[66585]},"partials":[{"type":"npc","id":"1000927","obj":{"i":1000927,"n":"Wyrnzoen","l":28,"q":12,"t":"Guildmaster"}},{"type":"npc","id":"1002115","obj":{"i":1002115,"n":"Sighard","l":31,"q":1}},{"type":"npc","id":"1002686","obj":{"i":1002686,"n":"Solkwyb","l":31,"q":1}},{"type":"npc","id":"1002689","obj":{"i":1002689,"n":"Wyrnzoen","l":31,"q":1}},{"type":"npc","id":"1002713","obj":{"i":1002713,"n":"Broenbhar","l":31,"q":1}},{"type":"npc","id":"1002714","obj":{"i":1002714,"n":"Solkwyb","l":31,"q":1}},{"type":"npc","id":"1002715","obj":{"i":1002715,"n":"Broenbhar","l":31,"q":1}},{"type":"action","id":"40","obj":{"i":40,"n":"Thrill of Battle","c":263,"j":3,"t":4,"l":30}},{"type":"item","id":"1769","obj":{"i":1769,"n":"Spiked Steel Labrys","l":28,"c":31422,"t":3,"p":4049}},{"type":"item","id":"3102","obj":{"i":3102,"n":"Steel Cuirass","l":30,"c":48003,"t":35,"p":4373}},{"type":"item","id":"2755","obj":{"i":2755,"n":"Steel Celata","l":30,"c":40003,"t":34,"p":3532}},{"type":"item","id":"3599","obj":{"i":3599,"n":"Steel Gauntlets","l":30,"c":48303,"t":37,"p":3139}},{"type":"item","id":"3825","obj":{"i":3825,"n":"Steel Sabatons","l":30,"c":46807,"t":38,"p":3588}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65854","obj":{"i":65854,"n":"Bleeder of the Pack","g":129,"l":"Limsa Lominsa","s":250,"f":1}},{"type":"quest","id":"66585","obj":{"i":66585,"n":"Pride and Duty (Will Take You from the Mountain)","g":149,"l":"Limsa Lominsa","s":1,"f":1}}]}