{"quest":{"name":"Way Down in the Hole","location":"Central Thanalan","id":65856,"patch":2.0,"sort":39,"icon":100046,"eventIcon":71201,"issuer":1001578,"target":1001353,"involved":[1002947,1002948,1002949,1002950,1002951,1002955],"genre":1,"journal":["Zuzumeda wishes to share with you a most amazing rumor.","Rumor has it that Wystan, a merchant living in Stonesthrow, is recruiting able-bodied adventurers to protect his team of prospectors. Speak to him at the Coffer & Coffin and volunteer your services.","While Wystan does not require additional escorts for the expedition, he would appreciate your assistance in convincing a group of children from Stonesthrow to stop waiting for him and return home. Offer Wystan's cookies to the children and persuade them to leave.","Your kind words and crumbling cookies are enough to satisfy the children. Let Wystan know that the situation has been resolved.","Even as Wystan is telling you about his ambitious plans for the future, one of the Brass Blades from the expedition party bursts into the bar and declares that they have made a promising discovery. Wasting no time, Wystan resolves to go and see for himself, and invites you to join him at the site.","Your confrontation with the Brass Blades is interrupted by a mysterious masked mage, who unleashes a clay golem upon you. In the chaotic battle that ensues, you somehow slay the rampaging construct moments before Thancred arrives.","Thancred's presence triggers more strange visions which you are unable to explain. Though your soul cries out for answers, this is neither the time nor place. Speak with Wystan, who has returned to the Coffer & Coffin.","Wystan now understands that he has been marked for death by Lord Lolorito. The ore vein, the Brass Blades, and the golem all appear to have been part of the trap. The merchant promises to do his utmost to hide your involvement, but he also suggests you seek the counsel of Mistress Momodi at the Quicksand, in case Lolorito's spies are already aware of your actions.","Momodi confirms that Wystan is finished in Ul'dah, but assures you that no one knows of your deeds. Though many would question the wisdom of opposing such powerful forces, she clearly approves of your actions. As a reward, Momodi grants you complimentary accommodation at the Hourglass, and permission to undertake guildleves."],"objectives":["Speak with Wystan.","Give ginger cookies to the children.","Speak with Wystan.","Follow Wystan to the Sil'dih ruins.","Speak with Wystan.","Speak with Momodi in Ul'dah."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"ZUZUMEDA","text":"Ah, the altruistic adventurer! I was hoping we'd bump into each other. Why? Because the most fascinating piece of news recently reached my ears, and I'm eager to share it! May I?"},{"name":"ZUZUMEDA","text":"Rumor has it that there is a vast, untapped vein of ore beneath the ruins of Sil'dih."},{"name":"ZUZUMEDA","text":"But that is not all! Inconceivably, the Concern appears to be entirely ignorant of its existence. And even as we speak, a young upstart─a self-made merchant from <span class=\"emphasis\">Stonesthrow</span> of all places─is moving to claim it!"},{"name":"ZUZUMEDA","text":"The fellow's name is Wystan, and he is a very, <span class=\"emphasis\">very</span> ambitious young man. Not only does he intend to secure exclusive excavation rights, but they say his master plan is to use his new fortune to curry favor with the Sacrarium."},{"name":"ZUZUMEDA","text":"Of course, the thaumaturges only consider the opinions of the most wealthy when drafting the laws of Ul'dah. If you would have your voice heard, you must be prepared to pay a sultan's ransom."},{"name":"ZUZUMEDA","text":"One voice which is invariably heard belongs to Lord Lolorito. He has long lavished gil upon the thaumaturges, and some claim that he devises new laws with the express intention of ruining his competitors while protecting his own interests."},{"name":"ZUZUMEDA","text":"Suffice it to say, if Wystan thinks he can compete with the likes of the Syndicate, he's in for a rude awakening. But that eventuality may yet be a little way off. For the present, he is moving ahead with his plans, and assembling a team to survey the site."},{"name":"ZUZUMEDA","text":"I'm told he's at the Coffer & Coffin right now, recruiting able-bodied adventurers to escort his prospectors."},{"name":"ZUZUMEDA","text":"Warin said you were looking for work. Mayhap you should meet Wystan and volunteer for his expedition?"},{"name":"WYSTAN","text":"Come to join? Sorry, but you're too late."},{"name":"WYSTAN","text":"Some Brass Blades looking for extra coin volunteered, and the team's already en route to the ruins."},{"name":"WYSTAN","text":"But look, I know it's not easy to find work these days. If you're interested, there's something else you can do for me."},{"name":"WYSTAN","text":"There are these children outside─little ones from Stonesthrow. I look after them when I've time to spare, and so they've taken to following me around, even when I tell them not to."},{"name":"WYSTAN","text":"But what with overseeing the search for the vein, I barely have a chance to visit the privy at the moment, much less entertain younglings. Can you give them these ginger cookies and convince them to go home for me?"},{"name":"KODOMOA","text":"I ain't goin' nowhere, <span class=\"alternative-container\"><span class=\"alternative\">missus</span><span class=\"alternative\">mister</span></span>! I'm too hungry to move, besides, so you'll have to carry me!"},{"name":"KODOMOA","text":"A <span class=\"emphasis\">cookie</span>!? ...Well, if Wystan really wants me to go home, then all right. But I want two next time!"},{"name":"KODOMOB","text":"I like playing with Wystan. He makes sure no one bullies us."},{"name":"KODOMOB","text":"Wystan's worried about us? Oh, I don't want to make him worried. I'm a good girl, so I'll go home."},{"name":"KODOMOC","text":"But Wystan always plays with us! Why won't he come out and play?"},{"name":"KODOMOC","text":"Wow, a ginger cookie! I'd better save some for my brother. I know─I'll go home and eat it with him!"},{"name":"KODOMOD","text":"Wystan's kind to us. I like him."},{"name":"KODOMOD","text":"This is for me? I want to eat it, but then again I don't, because then it'd be gone."},{"name":"KODOMOD","text":"Tell Wystan thanks, and...tell him I'm sorry for getting in the way."},{"name":"WYSTAN","text":"Give the children those cookies and convince them to go home without me. I'll see that you're rewarded for your trouble."},{"name":"WYSTAN","text":"Thank you, adventurer. I only wish I could do more. Stonesthrow is no place for a child."},{"name":"WYSTAN","text":"...Not that my childhood was much happier. Never enough food to go around, nor work to earn it─but no shortage of contempt from the great and the good."},{"name":"WYSTAN","text":"I remember thinking things could only get better... Yet now, after the Calamity and everything else...for us refugees to be forced to live outside the gates like bloody beastmen is a disgrace."},{"name":"WYSTAN","text":"They say with enough money you can change the laws here. So I'm going to make a fortune and do just that!"},{"name":"WYSTAN","text":"I'll buy the excavation rights and start my own mining business. Then I'll give my fellow refugees the work they're crying out for, and pay them <span class=\"emphasis\">fairly</span>!"},{"name":"WYSTAN","text":"The mining companies have profited from our suffering for too long. But in their hubris they've grown complacent─presenting us with a golden opportunity."},{"name":"WYSTAN","text":"And we will take it, adventurer─we will reclaim our dignity, and with it our place within those walls."},{"name":"BRASSSENTRY","text":"We found her! We found the vein! Wystan, ye must come an' see!"},{"name":"WYSTAN","text":"Already!? Amazing! We leave at once!"},{"name":"WYSTAN","text":"You should join me, my friend! Come and bear witness to history in the making!"},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“The Pursued and the Pursuing”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"BRASSSENTRY","text":"Thal's balls, son! A vein of ore in the middle of a ruined bloody <span class=\"emphasis\">city</span>? Godsdamned idiot!"},{"name":"BRASSSENTRY","text":"What did ye think was gonna happen? That ye'd strike it rich and get cozy with the Order, while the masters of Ul'dah looked on? <span class=\"emphasis\">No one</span> crosses the Syndicate!"},{"name":"WYSTAN","text":"&lt;pant&gt; &lt;pant&gt; The...the Syndicate!?"},{"name":"BRASSSENTRY","text":"Hah! Finally sunk in, has it?"},{"name":"BRASSSENTRY","text":"Well look at this! Not <span class=\"emphasis\">all</span> yer friends've deserted ye, it seems... Lucky boy! Now ye won't have to die alone!"},{"name":"MASKEDMAGUS","text":"(-???-)<span class=\"highlight-purple\">O mournful voice of creation! Grant ye this humble stone a soul, that it may wake to life!</span>"},{"name":"BRASSSENTRY","text":"Who's that spoutin' gibberish!? Show yerself!"},{"name":"BRASSSENTRY","text":"This ain't part o' the plan! Bloody hells, does Lord Lolorito mean to kill us too!?"},{"name":"QIB","text":"Defeat the clay golem!"},{"name":"MASKEDMAGUS","text":"You are strong.<br>But are you strong enough to withstand <span class=\"emphasis\">this</span>?"},{"name":"MASKEDMAGUS","text":"Yesss...writhe! Writhe in eternal Darkness!"},{"name":"MASKEDMAGUS","text":"Impossible! Never has the golem been so sorely tested!"},{"name":"MASKEDMAGUS","text":"(-???-)<span class=\"highlight-purple\">That the golem could be vanquished...</span>"},{"name":"MASKEDMAGUS","text":"(-???-)<span class=\"highlight-purple\">That <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> is no ordinary adventurer.</span>"},{"name":"THANCRED","text":"Damn, seems I've missed all the fun."},{"name":"THANCRED","text":"I see you didn't need my help this time."},{"name":"THANCRED","text":"I would compose a ballad in your honor, but I fear no words would do you justice. The Songstress of Ul'dah herself could not rival your beauty."},{"name":"ACTIVEGIRL","text":"Oh, stop it!"},{"name":"THANCRED","text":"I have oft heard it said that a blossom's beauty can move a man to love and long, but I never truly believed it until I met you two desert roses."},{"name":"BURNTMERCHANT","text":"I hear they attacked another caravan..."},{"name":"MERCHANT2","text":"Aye, an' business is sufferin' for it. Bloody Amalj'aa... What's stirred 'em up, do you reckon?"},{"name":"THANCRED","text":"Another raid...and I'll wager that caravan was carrying crystals, much like the last."},{"name":"THANCRED","text":"If they truly mean to summon a primal, we must act quickly."},{"name":"ACTIVEGIRL","text":"Are you coming, love?"},{"name":"AGGRESSIVEGIRL","text":"You wouldn't keep a girl waiting, would you!?"},{"name":"THANCRED","text":"Perish the thought!"},{"name":"THANCRED","text":"So tell me, where in this marvel of a city might you lovely ladies be staying?"},{"name":"THANCRED","text":"At this rate, grain will soon be more precious than gold."},{"name":"THANCRED","text":"A result of the uncommonly bad harvests, to be sure..."},{"name":"THANCRED","text":"And we have <span class=\"emphasis\">you</span> to thank for them, do we not?"},{"name":"THANCRED","text":"Aye, this weakening of the aetheric flow must surely be linked to Dalamud's descent."},{"name":"THANCRED","text":"And, of course, to the primals."},{"name":"THANCRED","text":"A fine mess. But we must not lose hope."},{"name":"THANCRED","text":"Louisoix will know what to do. We need only trust in his judgment."},{"name":"THANCRED","text":"Truly a marvel of Sharlayan ingenuity... It's as if I could reach out and touch the aether."},{"name":"THANCRED","text":"Time to focus... No more gallivanting about like before. The Scions are counting on you."},{"name":"THANCRED","text":"Have faith. Just have faith. You can do this."},{"name":"THANCRED","text":"Hmmm... This disturbance is recent."},{"name":"THANCRED","text":"The Sultantree? Maybe Papashan will know something of it."},{"name":"THANCRED","text":"Looks like they gave you quite a thrashing. Can you walk?"},{"name":"THANCRED","text":"It's me. I was too late. Our person of interest had already quit the scene. The General? Very well. I shall be there anon."},{"name":"THANCRED","text":"My colleagues went to great lengths to provide me with the means to detect aetheric disturbances, but every time I find one, you seem to be in the middle of it. I'm starting to wonder if it might not be simpler just to follow you around. Sadly, I have business elsewhere."},{"name":"THANCRED","text":"Tread softly, my friend. The carefully laid trap you dismantled was clearly sanctioned by Lord Lolorito. I heard the Blades mention him as they fled. Believe me when I tell you that he is not a man to be trifled with."},{"name":"THANCRED","text":"The sultana's enemies grow bolder by the day, and I suspect they have the support of outside forces."},{"name":"WYSTAN","text":"Thank you. If you hadn't come along, those bastards would surely have slaughtered us all."},{"name":"WYSTAN","text":"I would speak with you further, but it isn't safe for us to linger here."},{"name":"WYSTAN","text":"Find me at the Coffer & Coffin later. Until then, stay safe."},{"name":"THANCRED","text":"I shall accompany Wystan and his men. They need protection─and I need more information."},{"name":"THANCRED","text":"Ah, but where are my manners? I have yet to properly introduce myself. I am Thancred, a humble scholar surveying the flow of aether in Thanalan."},{"name":"THANCRED","text":"It is an honor and a privilege to make your acquaintance. I hope when next we meet it is under more auspicious circumstances. Farewell!"},{"name":"THANCRED","text":"...Ah. Wait a moment. It occurs to me that we may have..."},{"name":"THANCRED","text":"Never mind. Fare thee well!"},{"name":"WYSTAN","text":"Twelve bless you, my friend. You risked your life to save ours."},{"name":"WYSTAN","text":"Betrayed by my own guards... Gods, I was a fool to trust those men."},{"name":"WYSTAN","text":"Lolorito <span class=\"emphasis\">owns</span> the godsdamned Brass Blades. I should've questioned their motives from the start."},{"name":"WYSTAN","text":"Even so, I could hardly have predicted that the wealthiest man in Ul'dah would want me <span class=\"emphasis\">dead</span> for the heinous crime of seeking to change the law! I'm just a merchant, for gods' sakes!"},{"name":"WYSTAN","text":"That ruthless bastard! And what of that monstrosity? Those were his <span class=\"emphasis\">own men</span>! It beggars belief!"},{"name":"WYSTAN","text":"Well, that's it. I'm finished. If I stay in Ul'dah any longer, I'm as good as dead."},{"name":"WYSTAN","text":"My associates, my friends─gods, even the <span class=\"emphasis\">children</span> may not be safe if I don't disappear. And you...godsdammit, if Lolorito learns of your involvement, you'll be next."},{"name":"WYSTAN","text":"I'll speak with the others and make sure your part in this stays secret. Beyond that, I don't know what to suggest... Maybe you should seek the counsel of Mistress Momodi."},{"name":"WYSTAN","text":"She's helped countless adventurers in her time. Mayhap she'll know what to do."},{"name":"WYSTAN","text":"Go quickly now, my friend. Lolorito's spies may be watching."},{"name":"MOMODI","text":"Settle down, <span class=\"highlight\">Forename</span>. You've got nothin' to worry about. No one seems to know you were at the ruins."},{"name":"MOMODI","text":"Wystan, on the other hand, is now a pariah─about as welcome 'round here as a rabid wolf, poor bugger. Suffice to say, that boy risked the wrath of the wrong man."},{"name":"MOMODI","text":"<span class=\"emphasis\">Lord</span> Lolorito: chairman of the East Aldenard Trading Company, generous contributor to the Order of Nald'thal, <span class=\"emphasis\">and</span> member of the Syndicate."},{"name":"MOMODI","text":"Didn't get where he is by leavin' loose ends, that one."},{"name":"MOMODI","text":"Which is why he ain't above killin' his own men."},{"name":"MOMODI","text":"Hells, even if those Blades knew what was comin', it's not like they could refuse to do their benefactor's biddin'."},{"name":"MOMODI","text":"&lt;sigh&gt; Don't let this color your view of Ul'dah, <span class=\"highlight\">Forename</span>... It's true that there are some here who ain't afraid to crack a few skulls if it gets 'em what they want. But most of us are decent folk just tryin' to make ends meet."},{"name":"MOMODI","text":"You know, a lot of people would call you a damn fool for riskin' your life to save a marked man..."},{"name":"MOMODI","text":"But I believe you did a good thing, <span class=\"highlight\">Forename</span>, and for that you have my respect."},{"name":"MOMODI","text":"Listen: you've been through a lot lately. Why don't you rest a spell?"},{"name":"MOMODI","text":"I'll have the boys at the Hourglass set you up with a room, my treat. Just have a word with Otopa Pottopa whenever you feel like stayin'."},{"name":"MOMODI","text":"And when you've got your appetite for adventurin' back, consider takin' on a guildleve or two."},{"name":"MOMODI","text":"We've a lot of requests from locals lookin' to hire adventurers for various jobs. It'd be a good way for you to earn yourself some extra gil."},{"name":"MOMODI","text":"Eustace can tell you more about how the system works, so go and speak with him if you're interested."},{"name":"SYSTEM","text":"In recognition of your achievements, you have been granted access to guildleves and inn rooms."},{"name":"SYSTEM","text":"As you complete quests and embark on new adventures, the world will draw you ever deeper into its mysteries."},{"name":"SYSTEM","text":"The great realm of Eorzea yet holds myriad roads untraveled and sights unseen. Continue along the path of the adventurer and discover what wonders await you!"},{"name":"WYSTAN","text":"If I don't disappear, everyone I know will be in danger─and that includes you, my friend."},{"name":"WYSTAN","text":"I pray you do not come to harm because of me."},{"name":"SYSTEM","text":"You now have access to Recommendations. This feature displays a list of quests or duties currently available in your area."},{"name":"SYSTEM","text":"The Recommendations list can be opened from under Duty in the main menu, and will also be displayed automatically when you log in. If you find yourself unsure of what to do next, this tool makes it simple to locate activities suitable for your present class and level."}],"reward":{"gil":179,"items":[{"num":5,"id":4551}],"xp":3240},"reqs":{"jobs":[{"lvl":9,"id":130}],"quests":[65843]},"next":[66159,66223,66965]},"partials":[{"type":"npc","id":"1001578","obj":{"i":1001578,"n":"Zuzumeda","l":43,"q":2}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1002947","obj":{"i":1002947,"n":"Wystan","l":43,"q":1}},{"type":"npc","id":"1002948","obj":{"i":1002948,"n":"Starveling Child","l":43,"q":1}},{"type":"npc","id":"1002949","obj":{"i":1002949,"n":"Starveling Child","l":43,"q":1}},{"type":"npc","id":"1002950","obj":{"i":1002950,"n":"Starveling Child","l":43,"q":1}},{"type":"npc","id":"1002951","obj":{"i":1002951,"n":"Starveling Child","l":43,"q":1}},{"type":"npc","id":"1002955","obj":{"i":1002955,"n":"Wystan","l":43,"q":1}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"quest","id":"65843","obj":{"i":65843,"n":"Out of House and Home","g":1,"l":"Central Thanalan","s":37}},{"type":"quest","id":"66159","obj":{"i":66159,"n":"Takin' What They're Givin'","g":1,"l":"Ul'dah","s":45}},{"type":"quest","id":"66223","obj":{"i":66223,"n":"Leves of Horizon","g":93,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"66965","obj":{"i":66965,"n":"Lend Me Your Ears Already","g":93,"l":"Ul'dah","s":90}}]}