{"quest":{"name":"Bleeder of the Pack","location":"Limsa Lominsa","id":65854,"patch":2.0,"sort":250,"icon":100053,"unlocksFunction":1,"eventIcon":71341,"issuer":1000927,"target":1000927,"involved":[1002682,1002685],"genre":129,"journal":["Axemaster Wyrnzoen wishes to set for you a trial that will hone your strength and skill to ever greater heights.","After your eye-opening encounter with the pack jackals, the axemaster deems that, without further training, your chances against Kujata remain slim. He has thus devised a new trial, designed to unleash your deepest reserves of destructive power. Head to the Bismarck and speak with Solkwyb to learn what you must do.","It appears that Solkwyb will once again accompany you during your training. Prepare yourself for what promises to be a grueling trial before seeking out the conjurer on the Salt Strand in lower La Noscea.","At first, your trial seems absurdly simple. But even as you defeat the first wave of adversaries in the shadow of the Salt Strand's ominous formations, you next find yourself attacked by an eerily familiar group of masked men. After swinging your axe with grim determination, you eventually triumph over the “mysterious” warriors, and they quit the field in deference to your superior skill. Return to the Marauders' Guild and report this turn of events to Axemaster Wyrnzoen.","Setting the matter of strange masked men aside, Wyrnzoen instead focuses on praising your display of unrivaled power. You are now recognized as the exemplar of marauder strength, and the entire guild stands ready to support you in your quest to slay the monstrous Kujata. Keep your axe blade keen and your skills sharp as you await the next sighting of the murderous aurochs. The time has come for the beast to die.<br><br>※The next marauder quest will be available from Wyrnzoen upon reaching level 30."],"objectives":["Speak with Solkwyb.","Speak with Solkwyb on the Salt Strand.","Report to Wyrnzoen."],"dialogue":[{"name":"WYRNZOEN","text":"<span class=\"highlight\">Forename</span>. Our near-disastrous encounter with the pack that follows Kujata has been preying on my mind. The overwhelming number of the beasts was beyond aught I had imagined─even the most dedicated marauder could not hope to carve through that snarling wall of flesh."},{"name":"WYRNZOEN","text":"And if we cannot dispatch the pack, then Kujata remains beyond our reach."},{"name":"WYRNZOEN","text":"Thus, I have prepared for you a trial that shall unleash your deepest reserves of destructive strength. As before, Solkwyb awaits you at the Bismarck to guide you on your path."},{"name":"WYRNZOEN","text":"Do not squander this opportunity for growth, <span class=\"highlight\">Forename</span>. The pride of the guild itself rides on the keen edge of your axe."},{"name":"SOLKWYB","text":"You've word from my brother? ...Hah, the “pride of the guild,” eh? My brother has placed quite a burden on your shoulders, it seems. But, from what I have witnessed, if any marauder has the skill and determination to put down Kujata, then it is you."},{"name":"SOLKWYB","text":"And there is, of course, the matter of Sighard's vengeance. You don't want to disappoint the poor boy, now, do you?"},{"name":"SOLKWYB","text":"Let us be about this trial, <span class=\"highlight\">Forename</span>. I shall meet you on the Salt Strand in lower La Noscea, where your training is to take place. Hm? Well, naturally, <span class=\"emphasis\">I</span> will be there. Without me, you're like to forget to tend your wounds and bleed to death!"},{"name":"SOLKWYB","text":"Well, this should be the place. I don't see─ Ah, do you sense that encroaching aura of violence, <span class=\"highlight\">Forename</span>? Pray unlimber that axe of yours."},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“Bleeder of the Pack”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"SOLKWYB","text":"That seems to be the last of them. Compared to what we have faced before, though, it wasn't terribly─"},{"name":"WYRNZOEN","text":"(-???-)So, this is the indomitable <span class=\"highlight\">Forename Surname</span>."},{"name":"SOLKWYB","text":"Who in the seven hells are you!? Wait, is that...?"},{"name":"WYRNZOEN","text":"(-???-)We have deemed you worthy of our challenge. Come, marauder! Let us test the edge of your steel!"},{"name":"WYRNZOEN","text":"Oh, brother..."},{"name":"WYRNZOEN","text":"It seems my underlings have provided you with poor sport. Very well. I shall take your measure with mine own blade."},{"name":"WYRNZOEN","text":"Do not think to show me quarter, <span class=\"highlight\">Forename</span>, for I shall surely show you none!"},{"name":"WYRNZOEN","text":"I yield! Your strength has humbled us all. Aye, it might just be enough..."},{"name":"WYRNZOEN","text":"We are done here, my colleagues! Drag away those who cannot stand."},{"name":"WYRNZOEN","text":"Your display of prowess was truly impressive, <span class=\"highlight\">Forename</span>. Worthy, indeed..."},{"name":"SOLKWYB","text":"&lt;sigh&gt; What a ridiculous charade. Did he honestly think we couldn't see through those paltry disguises?"},{"name":"SOLKWYB","text":"Though I am confident my brother's act was not born of malice; rather, he hoped by concealing his identity that the trial would seem more threatening, thus increasing its effectiveness. Not an entirely successful undertaking, but one must appreciate his intentions."},{"name":"SOLKWYB","text":"It is time you returned to the guild. Oh, and as a favor to me? Pray indulge Wyrnzoen in his little deception─subterfuge is not a marauder's forte."},{"name":"WYRNZOEN","text":"<span class=\"highlight\">Forename</span>, I have heard of your skirmish on the Salt Strand. You did well to topple opponents of such formidable skill."},{"name":"WYRNZOEN","text":"But let us not dwell on the nature of those masked men. What is important is your triumph in the face of overwhelming odds."},{"name":"WYRNZOEN","text":"Your fellow marauders are honored to have you swing your axe in the guild's name. They stand behind you, one and all, as you prepare to overcome your greatest trial yet."},{"name":"WYRNZOEN","text":"Aye, the time has come for you to bring Kujata's bloody rampage to an end. When next he rears his horrible horned head, you shall be ready to bury your blade in his skull."},{"name":"QIB","text":"Defeat the Moraby hedgemoles!"},{"name":"QIB","text":"Defeat the masked marauders!"},{"name":"QIB","text":"Defeat the familiar marauder!"},{"name":"SOLKWYB","text":"Hah!<br>This is supposed to be a trial!?"},{"name":"SOLKWYB","text":"What are you playing at, you oafs!?"},{"name":"SOLKWYB","text":"No matter.<br>We fight to win!"},{"name":"SOLKWYB","text":"Now this is more like it!"},{"name":"SOLKWYB","text":"On your guard!<br>We are not done!"},{"name":"SOLKWYB","text":"Keep your focus!<br>This is no game!"},{"name":"WYRNZOEN","text":"Prepare to be tested!"},{"name":"WYRNZOEN","text":"Spent already?<br>Our battle has scarce begun!"},{"name":"WYRNZOEN","text":"You fight well, marauder.<br>Now we see what you are truly made of."}],"reward":{"items":[{"id":1766},{"id":3068,"one":1},{"id":3579,"one":1},{"id":3352,"one":1},{"num":2,"id":5825,"one":1}],"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":4}],"quests":[65853]},"next":[65855]},"partials":[{"type":"npc","id":"1000927","obj":{"i":1000927,"n":"Wyrnzoen","l":28,"q":12,"t":"Guildmaster"}},{"type":"npc","id":"1002682","obj":{"i":1002682,"n":"Solkwyb","l":28,"q":2}},{"type":"npc","id":"1002685","obj":{"i":1002685,"n":"Solkwyb","l":31,"q":1}},{"type":"item","id":"1766","obj":{"i":1766,"n":"Thunderstorm Axe","l":25,"c":31413,"t":3,"p":2271}},{"type":"item","id":"3068","obj":{"i":3068,"n":"Heavy Iron Armor","l":25,"c":48020,"t":35,"p":3540}},{"type":"item","id":"3579","obj":{"i":3579,"n":"Heavy Iron Gauntlets","l":25,"c":48368,"t":37,"p":1795}},{"type":"item","id":"3352","obj":{"i":3352,"n":"Heavy Iron Flanchard","l":25,"c":45291,"t":36,"p":2748}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65853","obj":{"i":65853,"n":"The Mountain That Strides","g":129,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"65855","obj":{"i":65855,"n":"Bringing Down the Mountain","g":129,"l":"Limsa Lominsa","s":300,"f":1}}]}