{"quest":{"name":"The Mountain That Strides","location":"Limsa Lominsa","id":65853,"patch":2.0,"sort":200,"icon":100053,"unlocksFunction":1,"eventIcon":71341,"issuer":1000927,"target":1000927,"involved":[1002112,1002113,1002682,1002683,1002684,1003546,1003547,1003548],"genre":129,"journal":["Axemaster Wyrnzoen requires your assistance with a troubling development.","Wyrnzoen informs you that Sighard, the boy whose parents were killed by Kujata, has gone missing. In light of your previous experiences, the axemaster has nominated you to find the wayward child. Seek out Solkwyb at the Bismarck, and discuss how you should best proceed with the search.","Solkwyb suggests that you first hear the details of Sighard's disappearance directly from the boy's grandfather. Make your way to the Red Rooster Stead in lower La Noscea and speak with Neddard.","After listening to Neddard's tale, you learn that Sighard has likely run off towards Aleport in search of Kujata. Speak with Solkwyb to plan your next move.","Solkwyb mentions an acquaintance in Aleport who might have more information on Sighard's whereabouts. Head to the coastal settlement in western La Noscea, and question the gate guard Pfarstym.","Pfarstym tells you that he saw a boy matching Sighard's description heading off to the north. Fearing for the child's safety, he urges you to make haste before a roaming pack of predators finds Sighard first. Search the area around Aleport, and attempt to pick up the boy's trail.","You have managed to discover some of Sighard's belongings, but the boy himself is nowhere to be seen. Catch up to Solkwyb, and see if her search has proven more fruitful.","Along with Solkwyb, and the sudden arrival of Wyrnzoen, you manage to rescue Sighard from a vicious pack of ravenous jackals. Return to the Red Rooster Stead and speak with the waiting Neddard.","Upon hearing your account of the rescue, Neddard apologizes for his grandson's foolhardy actions. There appears to be little more you can do for Sighard now except allow him time to recover from his injuries. Return to the Marauders' Guild and discuss with Wyrnzoen what you might best be doing.","Wyrnzoen expresses sympathy for Sighard's impatience, and directs you to return to your training. The axemaster once again vows to shape you into a weapon deadly enough to fell even the mighty Kujata.<br><br>※The next marauder quest will be available from Wyrnzoen upon reaching level 25."],"objectives":["Speak with Solkwyb.","Speak with Neddard at the Red Rooster Stead.","Speak with Solkwyb.","Speak with Pfarstym in Aleport.","Find signs of Sighard's passing.","Speak with Solkwyb.","Speak with Neddard at the Red Rooster Stead.","Speak with Wyrnzoen at the Marauders' Guild."],"dialogue":[{"name":"WYRNZOEN","text":"<span class=\"highlight\">Forename</span>, there is trouble afoot. Do you recall the lad whose parents were slain by the beast Kujata?"},{"name":"WYRNZOEN","text":"The boy's grandfather, Neddard, but recently contacted us with worrisome news─young Sighard has gone missing."},{"name":"WYRNZOEN","text":"There have been sightings of Kujata in the area, and it would seem that the child felt compelled to seek the creature out."},{"name":"WYRNZOEN","text":"As you are familiar with the boy and his tragic tale, I would have you attend to this matter. My sister, Solkwyb, awaits you at the Bismarck. She has been apprised of the situation, and will aid you in plotting a suitable course of action."},{"name":"SOLKWYB","text":"Ah, <span class=\"highlight\">Forename</span>. I assume you are here to discuss the missing child, and not to sample a bowl of mutton stew?"},{"name":"SOLKWYB","text":"First things first, I would advise against rushing off to peer under every rock in the countryside. We need more information to direct our search."},{"name":"SOLKWYB","text":"I suggest we head to the Red Rooster Stead, and learn what more we can from old Neddard."},{"name":"NEDDARD","text":"Thank the gods yer 'ere. Seems me grandson is set on causin' naught but trouble fer ye."},{"name":"NEDDARD","text":"But surely ye ken 'ow the lad is feelin'─'ow 'e's boilin' with 'ate fer that murderous beast."},{"name":"NEDDARD","text":"An' the last time, when ye came along like an avengin' angel an' showed 'im the strength o' yer steel, well, ye lit a fire in 'is belly."},{"name":"NEDDARD","text":"'E must've got it in 'is 'ead to take revenge on the beast 'isself. Daft little bugger..."},{"name":"NEDDARD","text":"Anyroad, once 'e 'eard Kujata'd been spotted near Aleport, why, 'e shot through that door like an arrow from a bow, an' I ain't seen 'im since."},{"name":"NEDDARD","text":"I beg of ye: find me little Sighard afore 'e gets 'isself stomped to death. That big bastard aurochs 'as spilled more'n enough o' me kin's blood..."},{"name":"SOLKWYB","text":"I'll leave the talking to you, <span class=\"highlight\">Forename</span>."},{"name":"SOLKWYB","text":"Our course is clear. We must set out for Aleport at once."},{"name":"SOLKWYB","text":"An old...acquaintance of mine, Pfarstym, often stands guard at the port gates. He might know something of the lad's whereabouts."},{"name":"PFARSTYM","text":"Have I seen a boy wandering about by himself? As a matter of fact, me and my fellow gate guard here just watched a young lad traipsing off to the north. We were arguing whether or not to abandon our post and bring the child back ourselves."},{"name":"PFARSTYM","text":"Large packs of jackals have been prowling the wilds of late, so if you mean to head after him, pray do so quickly. Hells, I might even pass along word to the Marauders' Guild─you'll be better off with an extra blade or two at your back."},{"name":"SOLKWYB","text":"Have you found any sign of Sighard?"},{"name":"SOLKWYB","text":"He must have been in a desperate hurry indeed to cast away his belongings in such a careless manner. I, myself, came across this wood axe─a tool the lad took from the Stead, perhaps?"},{"name":"SOLKWYB","text":"Gods below! <span class=\"highlight\">Forename</span>, over there!"},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“The Mountain that Strides”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"SIGHARD","text":"&lt;groan&gt; ..."},{"name":"SIGHARD","text":"<span class=\"highlight\">Forename</span>..."},{"name":"WYRNZOEN","text":"Step aside!"},{"name":"WYRNZOEN","text":"Raaarrrggghhh!"},{"name":"SOLKWYB","text":"Wyrnzoen!?"},{"name":"WYRNZOEN","text":"He breathes yet!"},{"name":"WYRNZOEN","text":"We withdraw to the Red Rooster Stead. Follow my lead, <span class=\"highlight\">Forename</span>!"},{"name":"NEDDARD","text":"Ye brought 'im 'ome! I don't got the words to thank ye!"},{"name":"WYRNZOEN","text":"..."},{"name":"SOLKWYB","text":"I must concentrate. Pray do not disturb me."},{"name":"SIGHARD","text":"&lt;groan&gt; ..."},{"name":"SOLKWYB","text":"The lad's past the worst of it. He struck his head in the fall, though, and it may be some time before he opens his eyes."},{"name":"SOLKWYB","text":"Thank you for coming, Brother. If you hadn't scattered those jackals when you did..."},{"name":"WYRNZOEN","text":"I have done naught to earn your thanks. When I learned of the situation from Aleport, I realized the dangers were greater than I had anticipated. No single marauder could have hoped to fend off such numbers in time."},{"name":"WYRNZOEN","text":"Pray accept my apologies, Neddard. You turned to us for help, and yet your grandson now lies before you, broken and battered..."},{"name":"NEDDARD","text":"Ye risked yer lives to save little Sighard─'ow's a man to find fault with that? It's me who ought to be beggin' forgiveness for the wounds ye took protectin' me foolish boy."},{"name":"WYRNZOEN","text":"You needn't concern yourself with our well-being. Our training prepares us for such eventualities."},{"name":"WYRNZOEN","text":"There is naught more we can accomplish here, <span class=\"highlight\">Forename</span>. It is time we returned to the guild and focused on other tasks."},{"name":"WYRNZOEN","text":"I am glad the lad will live, but I fear this will not be the last time Sighard abandons caution in his thirst for vengeance against Kujata."},{"name":"WYRNZOEN","text":"The wound in his heart festers and seethes, feeding his impatience at our seeming inaction."},{"name":"WYRNZOEN","text":"But we must not think ill of the boy. Instead, let his helpless rage be as a spur to our efforts."},{"name":"WYRNZOEN","text":"I say again, <span class=\"highlight\">Forename</span>: Kujata will fall by your hand. And I will shape you into the deadly weapon you need to be."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"QIB","text":"Defeat the jackals!"},{"name":"SOLKWYB","text":"Quickly now! Those curs are out for blood!"},{"name":"SOLKWYB","text":"Watch your flanks!"},{"name":"SOLKWYB","text":"More have found the scent!"},{"name":"SOLKWYB","text":"Ware this one's tainted jaws!"}],"reward":{"items":[{"id":1758},{"id":3045,"one":1},{"id":2712,"one":1},{"id":3563,"one":1},{"id":3793,"one":1},{"num":5,"id":5824,"one":1}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":4}],"quests":[65852]},"next":[65854]},"partials":[{"type":"npc","id":"1000927","obj":{"i":1000927,"n":"Wyrnzoen","l":28,"q":12,"t":"Guildmaster"}},{"type":"npc","id":"1002112","obj":{"i":1002112,"n":"Neddard","l":31,"q":1}},{"type":"npc","id":"1002113","obj":{"i":1002113,"n":"Pfarstym","l":33,"q":1}},{"type":"npc","id":"1002682","obj":{"i":1002682,"n":"Solkwyb","l":28,"q":2}},{"type":"npc","id":"1002683","obj":{"i":1002683,"n":"Solkwyb","l":31,"q":1}},{"type":"npc","id":"1002684","obj":{"i":1002684,"n":"Solkwyb","l":33,"q":1}},{"type":"npc","id":"1003546","obj":{"i":1003546,"n":"Sighard","l":31,"q":1}},{"type":"npc","id":"1003547","obj":{"i":1003547,"n":"Wyrnzoen","l":31,"q":1}},{"type":"npc","id":"1003548","obj":{"i":1003548,"n":"Solkwyb","l":31,"q":1}},{"type":"item","id":"1758","obj":{"i":1758,"n":"Inferno Axe","l":20,"c":31408,"t":3,"p":1116}},{"type":"item","id":"3045","obj":{"i":3045,"n":"Iron Cuirass","l":20,"c":48002,"t":35,"p":1228}},{"type":"item","id":"2712","obj":{"i":2712,"n":"Iron Celata","l":20,"c":40002,"t":34,"p":992}},{"type":"item","id":"3563","obj":{"i":3563,"n":"Iron Gauntlets","l":20,"c":48302,"t":37,"p":882}},{"type":"item","id":"3793","obj":{"i":3793,"n":"Iron Sabatons","l":20,"c":46806,"t":38,"p":1008}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65852","obj":{"i":65852,"n":"Brutal Strength","g":129,"l":"Limsa Lominsa","s":150,"f":1}},{"type":"quest","id":"65854","obj":{"i":65854,"n":"Bleeder of the Pack","g":129,"l":"Limsa Lominsa","s":250,"f":1}}]}