{"quest":{"name":"The Slaying of the Shrews","location":"Central Thanalan","id":65857,"patch":2.0,"sort":60,"eventIcon":71221,"issuer":1001457,"target":1001457,"involved":[1001469],"genre":93,"journal":["Hihiyaja needs help thinning out the snipping shrew population.","At the Royal Plantations, earthworms are used to improve soil quality and crop yields. However, snipping shrews are threatening to wipe them out. Locate the shrewhills and slay the shrews within.","With the last of their predators no more, the earthworms can focus on their humble task of enriching the soil. Deliver the good tidings to Hihiyaja.","With the earthworms now safe, Hihiyaja can devote himself to growing vegetables that may one day grace the dining table of the sultana herself."],"objectives":["Slay the snipping shrews.","Report to Hihiyaja."],"dialogue":[{"name":"HIHIYAJA","text":"Thanalan has ever been a barren region. Believe me when I say that it takes no small amount of effort to make crops grow here."},{"name":"HIHIYAJA","text":"We've even introduced earthworms to the soil in order to enrich it."},{"name":"HIHIYAJA","text":"Alas, they've been nigh eradicated by snipping shrews, burrowing critters native to these parts."},{"name":"HIHIYAJA","text":"Unless we save the earthworms, this entire plot won't yield so much as a single pumpkin next harvest. Won't you help us by thinning out the shrew population? The shrewhills would be the best place to start."},{"name":"HIHIYAJA","text":"Thank you, friend! You truly are the champion of earthworms!"},{"name":"HIHIYAJA","text":"Now we can look forward to a plentiful harvest of pumpkins."},{"name":"HIHIYAJA","text":"I wonder which ones will grace the sultana's plate..."},{"name":"POP","text":"A high-pitched squeal pierces the air!"}],"reward":{"gil":139,"items":[{"num":13,"id":4}],"xp":975},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[66086]},"next":[65858]},"partials":[{"type":"npc","id":"1001457","obj":{"i":1001457,"n":"Hihiyaja","l":43,"q":2}},{"type":"npc","id":"1001469","obj":{"i":1001469,"n":"Gagalyo","l":43,"q":2}},{"type":"quest","id":"66086","obj":{"i":66086,"n":"Underneath the Sultantree","g":1,"l":"Central Thanalan","s":20}},{"type":"quest","id":"65858","obj":{"i":65858,"n":"Listen to Your Fish","g":93,"l":"Central Thanalan","s":70}}]}