{"quest":{"name":"A Little Help (The Lavender Beds)","location":"The Lavender Beds","id":65861,"patch":2.45,"sort":60,"icon":100348,"eventIcon":71221,"issuer":1010740,"target":1010744,"genre":204,"journal":["Amh Garanjy wishes you to continue your volunteer work in the Lavender Beds.<br>※This quest is available for a limited time only.","Amh Garanjy welcomes your continued assistance in the Lavender Beds. Speak with the saint's little helper in Yainu-Par, and learn what more you can do to support the Starlight Celebration.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The little helper has heard of your pledge to help, and appears eager to set you to work. Speak with the volunteer once more to assist with the festivities in the Lavender Beds."],"objectives":["Speak with the saint's little helper in the Lavender Beds."],"dialogue":[{"name":"AMHGARANJY","text":"You wish to do more for the celebration? Wonderful! Should you wish to focus your efforts here in the Lavender Beds, then pray speak with the little helper over yonder."},{"name":"AMHGARANJY","text":"A slew of errands always accompanies the festivities, and I don't know what I would do without my dedicated volunteers. For as much as I would like to shoulder the entire burden, it simply isn't possible..."},{"name":"AMHGARANJY","text":"...But let us not waste time with maudlin thoughts! We've a joyous festival to run!"},{"name":"AMHGARANJY","text":"If you wish to continue your efforts here in the Lavender Beds, then pray speak with the little helper over there to the left of the mammets. Thank you for your assistance, <span class=\"highlight\">Forename</span>!"},{"name":"VOLUNTEER65861","text":"Hello there! You must be the adventurer the celebrant mentioned."},{"name":"VOLUNTEER65861","text":"If I'm not mistaken, you've already retrieved a letter and delivered a gift, yes? Then you're quite prepared to perform the tasks I shall give you, for they are identical in nature."},{"name":"VOLUNTEER65861","text":"Oh, were you perhaps concerned about the contents of the presents you'll be handing out? You needn't be. They are but simple items fashioned of wood─toy bows and hairpins and the like─blessed by the Hearers themselves!"},{"name":"VOLUNTEER65861","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"A daily quest is now available from the little helper in the Lavender Beds."},{"name":"SYSTEM","text":"By completing this repeatable task, you will obtain fallen stars which can be exchanged for Starlight Celebration seasonal goods."},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65787]},"next":[65783]},"partials":[{"type":"npc","id":"1010740","obj":{"i":1010740,"n":"Amh Garanjy","l":426,"q":6}},{"type":"npc","id":"1010744","obj":{"i":1010744,"n":"Saint's Little Helper","l":426,"q":2}},{"type":"quest","id":"65787","obj":{"i":65787,"n":"Starlight Savings","g":204,"l":"The Lavender Beds","s":59}},{"type":"quest","id":"65783","obj":{"i":65783,"n":"The Gift of Joy (The Lavender Beds)","g":204,"l":"The Lavender Beds","s":63,"r":1}}]}