{"quest":{"name":"Sometimes the Old Ways Are Best","location":"Central Thanalan","id":65862,"patch":2.0,"sort":90,"eventIcon":71221,"issuer":1001439,"target":1001436,"genre":93,"journal":["Zezeda needs someone to procure hammer beak ribs.","Eshtaime's Lapidaries has ordered silver ingots for the production of ceremonial silverware. However, Zezeda has long neglected to restock the hammer beak ribs that are needed to refine the silver ore. Assist her by slaying hammer beaks and gathering their ribs.","You have obtained the requested number of ribs. Deliver them to Beringaer at Black Brush Station.","According to Beringaer, using the ribs to refine silver is time-consuming and needlessly expensive. Funerary rites must be profitable indeed if Arrzaneth Ossuary is willing to pay for this method."],"objectives":["Slay hammer beaks and obtain their ribs.","Deliver the hammer beak ribs to Beringaer."],"dialogue":[{"name":"ZEZEDA","text":"Looking to help out around the station, are you? Well then, how about hunting some hammer beaks?"},{"name":"ZEZEDA","text":"We just received an order from Eshtaime's Lapidaries for silver ingots. They need it to make ceremonial silverware, or so I'm told."},{"name":"ZEZEDA","text":"However, we've been instructed to refine the ore by melting it in a furnace lined with a layer of bone ash. Since we don't normally smelt silver this way, I've long neglected to restock our stores of hammer beak ribs."},{"name":"ZEZEDA","text":"Alas, there's no time to order more. If you would slay several of the fiends and take their bones to Beringaer in my stead, I'd be forever grateful."},{"name":"BERINGAER","text":"I told her so, I told her! What the hells is that incompetent little runt doin' anyway!? Rare as orders like this may be, we should always be keepin' hammer beak ribs on hand!"},{"name":"BERINGAER","text":"Well I'll be damned─guess the girl found a way after all. Thanks for the help, 'venturer."},{"name":"BERINGAER","text":"Don't quite understand it myself, but 'em fellas straight said to do it the old way─even though we could be usin' shards to refine silver faster and cheaper."},{"name":"BERINGAER","text":"Well it ain't my gil, so if that's how they want it... Just goes to show that the Thaumaturges' Guild has more money than it knows what to do with. Gods, what I wouldn't do to have that kind o' problem!"}],"reward":{"items":[{"id":2654,"one":1},{"num":10,"id":4555,"one":1},{"id":5824,"one":1}],"xp":1620},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[65843]},"next":[65844]},"partials":[{"type":"npc","id":"1001439","obj":{"i":1001439,"n":"Zezeda","l":43,"q":3}},{"type":"npc","id":"1001436","obj":{"i":1001436,"n":"Beringaer","l":43,"q":2}},{"type":"item","id":"2654","obj":{"i":2654,"n":"Hard Leather Pot Helm","l":8,"c":40015,"t":34,"p":220}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65843","obj":{"i":65843,"n":"Out of House and Home","g":1,"l":"Central Thanalan","s":37}},{"type":"quest","id":"65844","obj":{"i":65844,"n":"In the Court of the Rat King","g":93,"l":"Central Thanalan","s":90}}]}