{"quest":{"name":"Heir Today, Gone Tomorrow","location":"Central Thanalan","id":65867,"patch":2.0,"sort":60,"eventIcon":71201,"target":1001605,"involved":[1002065],"genre":0,"journal":["Leofric has a request for an adventurer looking to do some good.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Leofric in Lost Hope.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Baron von Quiveron III Esquire and his nefarious entourage are no more. Tell Leofric that the refugees need no longer fear the bandits.","Leofric thanks you for aiding the people of Lost Hope, who continue to suffer in spite of Ul'dah's growing prosperity. Reflecting on his downfall, the captain concludes that the Brass Blades of the Rose must look to others for guidance."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Leofric in Lost Hope.</span>"],"dialogue":[{"name":"LEOFRIC","text":"I thought I told you to get out of here. What, looking for a chance to do some good? &lt;sigh&gt; I guess I can't force you to leave. Damn stubborn adventurers, the lot of you. Fine, then. Listen well."},{"name":"LEOFRIC","text":"A band of outlaws has taken up residence at the Quiveron Manse on the ridge to the south."},{"name":"LEOFRIC","text":"Their leader has styled himself heir to Eolande Quiveron, the Syndicate member who died in the Calamity. &lt;spit&gt;"},{"name":"LEOFRIC","text":"The baron and his cronies are naught more than a pack of jackals. They prey on the people of Lost Hope, robbing them of what little they have."},{"name":"LEOFRIC","text":"I myself cannot act without endangering the refugees, as they know my face and will retaliate against Lost Hope. You, however, are not known to the bandits or their allies. If you wish to help us, then deal with the baron."},{"name":"LEOFRIC","text":"So it is done? Good. I hope that wretch died screaming."},{"name":"LEOFRIC","text":"Ul'dah is more prosperous than ever, some say. That may be true for the Syndicate, but none of that wealth has trickled down to the smallfolk."},{"name":"LEOFRIC","text":"It's all a mummer's farce. One day, I refused to play my part─and so I was made to leave the stage."},{"name":"LEOFRIC","text":"Aye, my time has passed. The Brass Blades of the Rose must look to others for guidance."},{"name":"POP","text":"The air begins to crackle with dark magicks..."}],"reward":{"xp":5250},"reqs":{"jobs":[{"lvl":10,"id":130}],"quests":[65866]}},"partials":[{"type":"npc","id":"1001605","obj":{"i":1001605,"n":"Leofric","l":43,"q":5}},{"type":"npc","id":"1002065","obj":{"i":1002065,"n":"Dadanen","l":42,"q":4}},{"type":"quest","id":"65866","obj":{"i":65866,"n":"Last Letter to Lost Hope","g":1,"l":"Western Thanalan","s":56}}]}