{"quest":{"name":"A Little Help (Mist)","location":"The Lavender Beds","id":65874,"patch":2.45,"sort":61,"icon":100349,"eventIcon":71221,"issuer":1010740,"target":1010745,"genre":204,"journal":["Amh Garanjy wishes you to volunteer your services to the little helper in Mist.<br>※This quest is available for a limited time only.","Amh Garanjy has asked that you offer your assistance to her colleague in Mist, the residential district of Limsa Lominsa. Speak with the saint's little helper in the Seagaze Markets, and learn what more you can do to support the Starlight Celebration.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The little helper has heard of your pledge to help, and appears eager to set you to work. Speak with the volunteer once more to assist with the festivities in Mist."],"objectives":["Speak with the saint's little helper in Mist."],"dialogue":[{"name":"AMHGARANJY","text":"As I've explained, it is not only the Lavender Beds that suffer from too few helping hands. Your assistance with the Starlight festivities would also be most welcome in Mist."},{"name":"AMHGARANJY","text":"If you've the occasion to visit Limsa Lominsa, might you consider sacrificing a few more moments of your time for the sake of the children?"},{"name":"AMHGARANJY","text":"My colleague in the Seagaze Markets will assign you any tasks that need doing. May Nymeia bless you and your charitable soul, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"The work of the saint's little helpers is never done! The entrance to Mist can be found in lower La Noscea, east of the Red Rooster Stead."},{"name":"AMHGARANJY","text":"Should you find yourself in Limsa Lominsa with time to spare, pray consider lending your aid to the little helper in Mist. As things stand, I fear the younglings will be faced with bitter disappointment..."},{"name":"VOLUNTEER65874","text":"'Ere now, yer a right strappin' <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, ain't ye? Nymeia bless the celebrant for sendin' ye me way!"},{"name":"VOLUNTEER65874","text":"The job I've got for ye ain't no different from what ye've already done in the Lavender Beds: collect the wee brats' letters, then give 'em their bleedin' presents. No problem, eh?"},{"name":"VOLUNTEER65874","text":"Them young scamps'll be grinnin' ear to ear when they get their blunted daggers an' coral jewelry an' what-'ave-ye. Aye, I love to see them little buggers 'appy, I do!"},{"name":"VOLUNTEER65874","text":"&lt;cough&gt; Ahem. Well, ye didn't come 'ere to listen to me wax all sentimental, now did ye? Just give me an 'oller when yer ready to get to work!"},{"name":"SYSTEM","text":"A daily quest is now available from the little helper in Mist."},{"name":"SYSTEM","text":"By completing this repeatable task, you will obtain fallen stars which can be exchanged for Starlight Celebration seasonal goods."},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65787]},"next":[65784]},"partials":[{"type":"npc","id":"1010740","obj":{"i":1010740,"n":"Amh Garanjy","l":426,"q":6}},{"type":"npc","id":"1010745","obj":{"i":1010745,"n":"Saint's Little Helper","l":425,"q":2}},{"type":"quest","id":"65787","obj":{"i":65787,"n":"Starlight Savings","g":204,"l":"The Lavender Beds","s":59}},{"type":"quest","id":"65784","obj":{"i":65784,"n":"The Gift of Joy (Mist)","g":204,"l":"Mist","s":64,"r":1}}]}