{"quest":{"name":"The Scent of a Mongrel","location":"Western Thanalan","id":65877,"patch":2.0,"sort":110,"eventIcon":71221,"issuer":1002064,"target":1003814,"genre":93,"journal":["Chechezan, a Brass Blade in Horizon, has a task for an unoccupied adventurer.","Chechezan has asked that you procure four bottles of mongrel blood. Find the creatures to the south of Horizon, and slay them for their vital fluids.","You have obtained the requisite amount of mongrel blood. Seek out Nononzo along the Royal Allagan Sunway, and deliver to him the foul-smelling liquid.","Nononzo explains that the stench of burning mongrel blood is perfect for warning away the creatures' natural enemies─which happen to include most other beastkin. Thanks to your aid, the roads are now a good deal safer for both Brass Blades and traveling merchants alike."],"objectives":["Collect bottles of mongrel blood.","Deliver the mongrel blood to Nononzo."],"dialogue":[{"name":"CHECHEZAN","text":"Looking for a task to fill your <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>, adventurer? I may have just the thing if you're not feeling squeamish."},{"name":"CHECHEZAN","text":"Here's the job: I need you to draw four bottles' worth of blood from the mongrels that roam to the south of here."},{"name":"CHECHEZAN","text":"Once you have enough, take the foul fluid to a Brass Blade by the name of Nononzo."},{"name":"CHECHEZAN","text":"You should find him somewhere along the road out of Horizon, bemoaning his terrible fortune, no doubt. Happy hunting."},{"name":"CHECHEZAN","text":"What do you want with me, then?"},{"name":"CHECHEZAN","text":"&lt;sniff&gt; Is this mongrel blood!? Thank the gods! Now I can finally head back to Horizon."},{"name":"CHECHEZAN","text":"Mongrels are the natural enemy of most other predators, you see. Throw their thick blood onto a fire, and the resulting stench'll send beastkin fleeing for malms around."},{"name":"CHECHEZAN","text":"Makes light work of our patrols...as long as we have a steady supply of the nasty stuff. And I'll wager you can guess which Brass Blade picked the short straw to kill mongrels this time around."},{"name":"CHECHEZAN","text":"But thanks to you, I'm off to enjoy a hot meal and a tankard! May Thal's golden halls await you in the afterlife!"}],"reward":{"gil":196,"xp":2100},"reqs":{"jobs":[{"lvl":10,"id":1}],"quests":[65865]}},"partials":[{"type":"npc","id":"1002064","obj":{"i":1002064,"n":"Chechezan","l":42,"q":2}},{"type":"npc","id":"1003814","obj":{"i":1003814,"n":"Nononzo","l":42,"q":1}},{"type":"quest","id":"65865","obj":{"i":65865,"n":"The Perfect Swarm","g":1,"l":"Western Thanalan","s":55}}]}