{"quest":{"name":"A Little Help (The Goblet)","location":"The Lavender Beds","id":65876,"patch":2.45,"sort":62,"icon":100350,"eventIcon":71221,"issuer":1010740,"target":1010746,"genre":204,"journal":["Amh Garanjy wishes you to volunteer your services to the little helper in the Goblet.<br>※This quest is available for a limited time only.","Amh Garanjy has asked that you offer your assistance to her colleague in the Goblet, the residential district of Ul'dah. Speak with the saint's little helper in the Brimming Heart, and learn what more you can do to support the Starlight Celebration.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The little helper has heard of your pledge to help, and appears eager to set you to work. Speak with the volunteer once more to assist with the festivities in the Goblet."],"objectives":["Speak with the saint's little helper in the Goblet."],"dialogue":[{"name":"AMHGARANJY","text":"While we will certainly miss your tireless efforts here in the Lavender Beds, my colleague in the Goblet could also benefit from the presence of a dedicated volunteer."},{"name":"AMHGARANJY","text":"Should you happen to have business in Ul'dah, might you consider paying her a visit and easing her burden?"},{"name":"AMHGARANJY","text":"You'll find your fellow little helper in the Brimming Heart amongst a forest of Starlight sentinels. Don't you just <span class=\"emphasis\">adore</span> how the seasonal decorations transform our cities?"},{"name":"SYSTEM","text":"The work of the saint's little helpers is never done! The entrance to the Goblet can be found in western Thanalan, southeast of Scorpion Crossing."},{"name":"AMHGARANJY","text":"Look for your fellow little helper in the Goblet in Ul'dah. Remember: every gift you deliver means another merry child!"},{"name":"VOLUNTEER65876","text":"Well, it's about time you showed up! The celebrant's been promising help, but promises won't mend the holes I've worn into the soles of my boots!"},{"name":"VOLUNTEER65876","text":"The task itself is hardly complicated, and you've already had a taste of what needs to be done, I hear."},{"name":"VOLUNTEER65876","text":"The only thing that's different is the gifts themselves─here in Ul'dah even the younglings can appreciate precious metals, so the Goldsmiths' Guild's been busy churning out pretty trinkets by the dozen."},{"name":"VOLUNTEER65876","text":"Catch your breath and have a sit-down if you need one, but don't be too long about it, eh? We're aiming for <span class=\"emphasis\">happy</span> children here, not screeching and wailing wee ones who missed out on their Starlight presents..."},{"name":"SYSTEM","text":"A daily quest is now available from the little helper in the Goblet."},{"name":"SYSTEM","text":"By completing this repeatable task, you will obtain fallen stars which can be exchanged for Starlight Celebration seasonal goods."},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"},{"name":"MOONKEEPER","text":"（★未使用／削除予定★）"}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65787]},"next":[65785]},"partials":[{"type":"npc","id":"1010740","obj":{"i":1010740,"n":"Amh Garanjy","l":426,"q":6}},{"type":"npc","id":"1010746","obj":{"i":1010746,"n":"Saint's Little Helper","l":427,"q":2}},{"type":"quest","id":"65787","obj":{"i":65787,"n":"Starlight Savings","g":204,"l":"The Lavender Beds","s":59}},{"type":"quest","id":"65785","obj":{"i":65785,"n":"The Gift of Joy (The Goblet)","g":204,"l":"The Goblet","s":65,"r":1}}]}