{"quest":{"name":"Oh Captain, My Captain","location":"Western Thanalan","id":65872,"patch":2.0,"sort":81,"icon":100098,"eventIcon":71201,"issuer":1002071,"target":1002058,"involved":[1003816],"genre":1,"journal":["Merilda may have stumbled upon a secret...","Fufulupa has accidentally overheard Merilda's tale regarding the bandits and their plans to obtain Nashachite stolen from Copperbell Mines. Before you can stop him, the Brass Blade runs to tell his supervising officer─who, unbeknownst to Fufulupa, is cooperating with the bandits. Find Captain Baldewyn before Fufulupa does!","You arrive too late to prevent Fufulupa from confronting his captain, and are forced to battle the corrupt officer and his bandit ally. Baldewyn remains defiant even after you defeat him, until the disgraced Captain Leofric reveals that Baldewyn was in fact operating without Lord Lolorito's knowledge and will therefore face severe punishment for his crimes. Return to Horizon and speak with Fufulupa when next you have an opportunity.","Due to the events at the Footfalls, Baldewyn has been stripped of his rank, leaving the Brass Blades of the Rose without a captain. For now, Fufulupa will serve as acting captain of the Horizon garrison. Though the young Lalafell believes this to be a temporary arrangement, he swears to do his utmost to protect the people of Horizon."],"objectives":["Speak with Captain Baldewyn.","Speak with Fufulupa in Horizon.","Defeat Captain Baldewyn and Baron von Quiveron IV!"],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MERILDA","text":"You are an adventurer, are you not? I know this is sudden, but I have no one else to turn to."},{"name":"MERILDA","text":"Last night, a gang of bandits from the Quiveron Manse were in their cups, and I overheard them discussing their plans..."},{"name":"MERILDA","text":"It seems they've come to collect gemstones stolen from Copperbell Mines. Nashachite, I think I heard one say. They are to meet with their co-conspirator soon, at the Footfalls─"},{"name":"FUFULUPA","text":"Wh-Wh-What did you say!?"},{"name":"FUFULUPA","text":"Illicit exchanges and shadowy dealings! The Brass Blades cannot abide such malfeasance!"},{"name":"FUFULUPA","text":"Forgive my eavesdropping, <span class=\"highlight\">Forename</span>─I came to Crescent Cove merely to thank you in person."},{"name":"FUFULUPA","text":"I never imagined I'd uncover a criminal conspiracy right outside Horizon's gates!"},{"name":"FUFULUPA","text":"We must act quickly if we are to apprehend these thieves! I will notify Captain Baldewyn at once!"},{"name":"MERILDA","text":"No, wait! You mustn't! Oh, gods..."},{"name":"MERILDA","text":"You must stop him before it's too late! <span class=\"emphasis\">Captain Baldewyn</span> himself is working with the bandits!"},{"name":"FUFULUPA","text":"Captain Baldewyn, sir! I've discovered something shocking, something horrible!"},{"name":"FUFULUPA","text":"Someone has been stealing gemstones from Copperbell Mines and─"},{"name":"FUFULUPA","text":"Wait, those gauntlets, those boots─why, you're one of Quiveron's men! Sir, that man is a thief and a scoundrel!"},{"name":"BALDEWYN","text":"...And? What of it? His coin's good, and that's what counts."},{"name":"FUFULUPA","text":"What!? Captain Baldewyn...are you working with these men!? It cannot be..."},{"name":"BALDEWYN","text":"I told you to stay in Horizon, Fufulupa. It didn't have to be like this..."},{"name":"BALDEWYN","text":"They'd get their Nashachite, I'd get my gil, and none would be the wiser."},{"name":"FUFULUPA","text":"B-B-But, sir, what if your crimes are uncovered!? What if Lord Lolorito finds out!?"},{"name":"BALDEWYN","text":"You godsdamned fool, don't you see!?"},{"name":"BALDEWYN","text":"I am acting under the authority of Lord Lolorito himself!"},{"name":"FUFULUPA","text":"No... No! That can't be true..."},{"name":"BALDEWYN","text":"Why do you think people join the Brass Blades, Fufulupa? To serve and protect? Hah!"},{"name":"BALDEWYN","text":"We're not the bloody Flames here! We do this for the coin!"},{"name":"ENEMY","text":"(-Ser Baron von Quiveron IV Esquire-)You there, adventurer! Do you remember me? Well, I remember you!"},{"name":"ENEMY","text":"(-Ser Baron von Quiveron IV Esquire-)I am Ser Baron von Quiveron IV Esquire! You killed my brother, and now I'm going to return the favor!"},{"name":"BALDEWYN","text":"Well, that settles it! It's clearly in everyone's best interests that both of you die!"},{"name":"LEOFRIC","text":"That's enough, Baldewyn!"},{"name":"LEOFRIC","text":"Your partner is dead and your plans are undone. You've no reason left to fight."},{"name":"BALDEWYN","text":"Stay out of this, Leofric! I don't take orders from you!"},{"name":"BALDEWYN","text":"I may have spared your life before, but if you interfere, I will not show you mercy!"},{"name":"LEOFRIC","text":"And what mercy will he show you, I wonder? You who have done so much in another man's name."},{"name":"BALDEWYN","text":"What are you blathering on about!?"},{"name":"LEOFRIC","text":"Every fisherman in Crescent Cove knew about your meeting, you arrogant fool. Quiveron's men couldn't keep their mouths shut. "},{"name":"LEOFRIC","text":"Imagine Lord Lolorito's surprise when he learned that a rank-and-file Brass Blade was using his name to advance a personal agenda..."},{"name":"BALDEWYN","text":"He knows!? Seven hells! But I'm a captain, he wouldn't─"},{"name":"LEOFRIC","text":"I was once a captain too, remember? And we both know what happened to me."},{"name":"LEOFRIC","text":"Well fought, boy. You've done the Brass Blades of the Rose proud."},{"name":"FUFULUPA","text":"Captain Leofric! Captain Baldewyn, he...he said that Lord Lolorito─"},{"name":"LEOFRIC","text":"Lord Lolorito wouldn't waste his time on a small-scale smuggling operation. This is all Baldewyn's doing."},{"name":"LEOFRIC","text":"What else did he say? That all our brethren are no better, and that each and every one cares for naught but coin? Hah! Mere excuses to justify his schemes."},{"name":"LEOFRIC","text":"Aye, we've no shortage of greedy sods, some who'd probably sell their own mothers into slavery if the price was right."},{"name":"LEOFRIC","text":"But there are men like you, Fufulupa─men good and true, whom the smallfolk respect."},{"name":"LEOFRIC","text":"Which is why I gave you the dagger. The Brass Blades of the Rose need a leader with honor, and you're the most honorable man I know."},{"name":"FUFULUPA","text":"&lt;sniffle&gt; &lt;sob&gt; Captaaaaaain!"},{"name":"FUFULUPA","text":"Thank you for all your help, <span class=\"highlight\">Forename</span>! The captain and I will escort Captain Baldewyn back to Horizon."},{"name":"FUFULUPA","text":"Pray visit me in town when next you return!"},{"name":"FUFULUPA","text":"Welcome back, <span class=\"highlight\">Forename</span>! So much has happened!"},{"name":"FUFULUPA","text":"Captain─ahem, <span class=\"emphasis\">Baldewyn</span> has been arrested and stripped of rank, which means the Brass Blades of the Rose no longer have a captain."},{"name":"FUFULUPA","text":"Until a new one is designated, I've been ordered to serve as acting captain of the Horizon garrison."},{"name":"FUFULUPA","text":"Though doubtless this is only a temporary arrangement, I will do my utmost to represent my brethren and protect the people of Horizon!"},{"name":"FUFULUPA","text":"Thank you, <span class=\"highlight\">Forename</span>, for your service to the sultanate. You are a true hero!"},{"name":"FUFURUPA","text":"Captain... H-How could you...?"},{"name":"BALDWIN","text":"It's time to do your duty, Fufulupa!<br>Time to die for your country!"},{"name":"FUFULUPA","text":"Why, Captain, why!? I trusted you!"},{"name":"BALDWIN","text":"Heh, you're stronger than I thought!"},{"name":"BALDWIN","text":"Damn you both, you're ruining everything!"},{"name":"FUFULUPA","text":"Ware his spear, <span class=\"highlight\">Forename</span>!"},{"name":"SCENE00001","text":"Duty calls. Do you wish to proceed with “SUBWIL088”?"},{"name":"SCENE00001","text":"Yes"},{"name":"SCENE00001","text":"No"}],"reward":{"gil":220,"items":[{"num":5,"id":4564}],"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65870]},"next":[66164]},"partials":[{"type":"npc","id":"1002071","obj":{"i":1002071,"n":"Merilda","l":42,"q":2}},{"type":"npc","id":"1002058","obj":{"i":1002058,"n":"Fufulupa","l":42,"q":9}},{"type":"npc","id":"1003816","obj":{"i":1003816,"n":"Baldewyn","l":42,"q":1}},{"type":"item","id":"4564","obj":{"i":4564,"n":"Antidote","l":10,"c":20641,"t":44,"p":39}},{"type":"quest","id":"65870","obj":{"i":65870,"n":"Storms on the Horizon","g":1,"l":"Western Thanalan","s":68}},{"type":"quest","id":"66164","obj":{"i":66164,"n":"Secrets and Lies","g":1,"l":"Western Thanalan","s":82}}]}