{"quest":{"name":"For Their Eyes Only","location":"Western Thanalan","id":65875,"patch":2.0,"sort":100,"eventIcon":71221,"issuer":1002056,"target":1002056,"genre":93,"journal":["Zuzutyro has a profitable proposition for you.","Zuzutyro bids you bring him four Eyes of the Serpent, which are literally the eyeballs of peistes. Slay as many of the creatures as it takes to procure the requested amount.","You have obtained the requested number of Eyes of the Serpent. Deliver them to Zuzutyro back at Horizon.","Receiving the four eyes with glee, Zuzutyro informs you that dipping them in an alchemical solution will produce beautiful red gemstones. The merchant's next stop is Gridania, where the eyes are expected to fetch a handsome price."],"objectives":["Slay desert peistes and obtain Eyes of the Serpent.","Deliver the Eyes of the Serpent to Zuzutyro."],"dialogue":[{"name":"ZUZUTYRO","text":"Greetings, adventurer. If you have a moment to spare, I have a proposition that's guaranteed profitable <span class=\"emphasis\">and</span> legitimate both."},{"name":"ZUZUTYRO","text":"Tell me, do you know what a peiste is? It's the scalekin that looks like a snake, except it gets around on four legs. The creatures are wont to petrify their prey with their dreadful gaze before moving in for the kill."},{"name":"ZUZUTYRO","text":"I want to get my hands on their eyes─“Eyes of the Serpent,” they're called─and I need someone who knows how to handle deadly wildlife to do the procuring for me. If you could slay some of the beasts and bring me four of their eyes, I'll see to it you're well rewarded."},{"name":"ZUZUTYRO","text":"That's four Eyes of the Serpent I want. Slay as many peistes as it takes to procure them."},{"name":"ZUZUTYRO","text":"The eyes! My thanks, adventurer!<br>...Hm? What do I mean to do with these things, you ask? Why, sell them, of course! They may not look like much at first, but if you dip them in an alchemical concoction, they transform into beautiful red gemstones."},{"name":"ZUZUTYRO","text":"And these gemstones happen to fetch a <span class=\"emphasis\">handsome</span> price in Gridania. Peistes aren't found in the Black Shroud, you see. As a merchant, it's my job to know such things."}],"reward":{"items":[{"id":4092,"one":1},{"id":4091,"one":1},{"num":2,"id":5824,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":1}]}},"partials":[{"type":"npc","id":"1002056","obj":{"i":1002056,"n":"Zuzutyro","l":42,"q":2}},{"type":"item","id":"4092","obj":{"i":4092,"n":"Leather Wristbands","l":8,"c":55643,"t":42,"p":201}},{"type":"item","id":"4091","obj":{"i":4091,"n":"Copper Wristlets","l":8,"c":55601,"t":42,"p":229}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}