{"quest":{"name":"The Threat of Paucity","location":"Ul'dah","id":65885,"patch":2.0,"sort":100,"icon":100061,"unlocksFunction":1,"eventIcon":71341,"issuer":1001708,"target":1001710,"genre":134,"journal":["Guildmaster Cocobuki wishes you to learn from the second chapter of <span class=\"emphasis\">Thaumaturgy: The Yawning Abyss</span>.","Listen to Cocobani, the third-eldest brother, as he instructs you from the chapter entitled “The Threat of Paucity.”","Keeping your state of aetheric balance in mind, head to Black Brush and slay eight efts.","You have slain the efts. Return to the Thaumaturges' Guild and report to Cocobani.","It appears that an Amalj'aa raiding party has attacked a merchant caravan and made off with a crate of ether. Make your way to the south of Drybone, and investigate the beastmen's armored war transport. Before retrieving the stolen cargo, however, you are to defeat the Amalj'aa and obtain bottles of their blood.","You have slain the threatening Amalj'aa and satisfied Cocobuki's additional request. Investigate the armored war transport once more, and retrieve the crate of ether.","You have reclaimed the crate of ether. Return to the Thaumaturges' Guild and report to Cocobani.","Cocobani has taught you the importance of maintaining a steady flow of aetheric energy, be it through managing your state of balance, or replenishing your arcane reserves with a vial of precious ether. Keep these lessons in mind as you return to your journey into the stygian depths of thaumaturgy.<br><br>※The next thaumaturge quest will be available from Cocobuki upon reaching level 15."],"objectives":["Speak with Cocobani.","Slay efts.","Speak with Cocobani at the Thaumaturges' Guild.","Investigate the armored war transport and obtain blood from the Amalj'aa.","Investigate the armored war transport and retrieve the crate of ether.","Take the crate of ether and Amalj'aa blood to Cocobani at the Thaumaturges' Guild."],"dialogue":[{"name":"COCOBUKI","text":"Yes, <span class=\"highlight\">Forename</span>, yes. The aura of power surrounding you is palpable. The glare begins to blind my thaumaturge's eye."},{"name":"COCOBUKI","text":"Your lesson today shall be taught by Cocobani. Go to him, and hear from the chapter entitled, “The Threat of Paucity.”"},{"name":"COCOBANI","text":"Aha! So, <span class=\"highlight\">Forename</span>, you have come to learn at the foot of the third-eldest brother, have you? I promise you, however, your education shall not be third-rate!"},{"name":"COCOBANI","text":"Let us read from the second chapter, shall we? Are you settled? No last-moment trips to the privy? Very well."},{"name":"COCOBANI","text":"“The Threat of Paucity.<br>Ah, how magnificent the ruthless power we wield. Flame devours, ice entombs, and lightning courses through the stricken bodies of our foes."},{"name":"COCOBANI","text":"“But, oh, such desperation when the wellspring runs dry. Flame sputters out, ice melts into slush, and lightning sparks no longer. Know you this threat, and mind you the limits of your mortal vessel.”"},{"name":"COCOBANI","text":"A terrifying thought, isn't it? A thaumaturge who has exhausted <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> arcane reserves is naught but a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with a stick and a funny hat!"},{"name":"COCOBANI","text":"For we mages, you may as well equate the aetheric energy flowing through our veins with our very lifeblood─should a battle find us lacking in this precious resource, we are as good as dead."},{"name":"COCOBANI","text":"Controlling the expenditure of your power requires an understanding of aetheric balance. The scales can tip in one of two directions─astrally or umbrally."},{"name":"COCOBANI","text":"When your mind and spirit lean in an umbral direction, your thaumaturgy is affected by a state known as “Umbral Ice.” The potency of your spells is diminished, but they also require less energy to invoke."},{"name":"COCOBANI","text":"On the other hand, a thaumaturge in the “Astral Fire” state will find the potency of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> incantations enhanced, but at a greater cost to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> aetheric stamina."},{"name":"COCOBANI","text":"Now, with the concepts of aetheric balance and efficient casting foremost in your mind, I bid you go forth and slay...eight efts! Pray do your best to stay alive─it reflects badly on me when the mauled corpse of one of my pupils is returned to the Ossuary."},{"name":"COCOBANI","text":"Aha! You arrive before me upright and breathing. Wonderful! It is so much simpler to pose questions to a student without having to resort to necromantic divination."},{"name":"COCOBANI","text":"Tell me, <span class=\"highlight\">Forename</span>. What action would you take if you found your thaumaturgical endurance exhausted in the midst of battle?"},{"name":"Q","text":"What would you do if your mana ran out during battle?"},{"name":"A","text":"Flee."},{"name":"A","text":"Brandish my scepter as a club."},{"name":"COCOBANI","text":"Oho? Most practical, indeed! A discreet withdrawal to await the replenishment of your energies is a sound strategy. But should there be nowhere left to run, a vial of ether can be your stoutest ally."},{"name":"COCOBANI","text":"Yes, the scepter is certainly a lethal instrument of death. <span class=\"emphasis\">Your</span> death, you valorous fool! Remember the first chapter! We do not close distance with our enemies!"},{"name":"COCOBANI","text":"And we certainly do not <span class=\"emphasis\">hit</span> them with our finely crafted tools of thaumaturgy! Pray consider replenishing your energies with a vial of ether before humiliating yourself in melee combat."},{"name":"COCOBANI","text":"Ah, ether! The draught of the gods! We thaumaturges─indeed, any who practice the arts of arcane manipulation─value this substance above all others."},{"name":"COCOBANI","text":"Thus it was with unbridled fury that we received the most recent report of beastman activity. It seems an Amalj'aa raiding party has attacked a caravan on the trade routes and made off with an entire crate of precious ether!"},{"name":"COCOBANI","text":"The time has come for you to put your new knowledge to the test. Annihilate these Amalj'aa bandits, and retrieve the cargo of ether-filled vials! According to the report, their armored war transport was last spotted to the south of Drybone."},{"name":"COCOBANI","text":"Ah, and I believe Cocobuki has an additional request: while you are busy incinerating Amalj'aa, be sure to collect some samples of their blood. ...Assuming you can draw any from their smoking remains."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"COCOBANI","text":"Do I detect the scent of ether? And I trust that <span class=\"emphasis\">stench</span> is Amalj'aa blood..."},{"name":"COCOBANI","text":"Oho! Ten vials...twenty...thirty! The sight of so much ether is just so very comforting."},{"name":"COCOBUKI","text":"What have we here, Cocobani? Is this the crate that was stolen? I see <span class=\"highlight\">Forename</span>'s lessons have had the desired effect. "},{"name":"COCOBUKI","text":"Hm hm hm. I will assume the vile, viscous liquid you have there is beastman blood. Cocobusi should be pleased..."},{"name":"COCOBUSI","text":"Cocobuki! You left word for me to visit the Ossuary. Have you finally decided to begin my training in thaumaturgy?"},{"name":"COCOBUKI","text":"Ah, Cocobusi! Good of you to come! <span class=\"highlight\">Forename</span> here was kind enough to obtain a supply of Amalj'aa blood for you."},{"name":"COCOBUKI","text":"An alchemist acquaintance of mine explained how you had been using the substance in your research to create a mana-amplifying elixir."},{"name":"COCOBUKI","text":"Naturally, we are most interested in the results of such experiments! So you see, Busi, your work as an alchemist already puts you in a position to work alongside us. You needn't become a thaumaturge to be part of our family!"},{"name":"COCOBANI","text":"That's right, Busi. Besides, the battlefield is a dangerous place, and our skills are not exactly suited to keeping others safe from harm..."},{"name":"COCOBUSI","text":"...I see. This is but another attempt to dissuade me from pursuing my true calling. I do not <span class=\"emphasis\">want</span> to cheer you on from the safety of my workbench. I want to fight at your side!"},{"name":"COCOBUKI","text":"B-Busi! We just cannot stand the thought of you being harmed! Pray do not do anything foolish!"},{"name":"COCOBUKI","text":"&lt;sigh&gt; ...I do apologize, brother. I sometimes forget how difficult it must be not having a natural aptitude for the arcane arts."},{"name":"COCOBUKI","text":"As I mentioned before, <span class=\"highlight\">Forename</span>, Cocobusi is dangerously unsuited to the wielding of thaumaturgy. Even with the proper training, he would be unable to cast magicks as we can. Were he to attempt to force a manifestation of power, the strain on his aetheric reserves would likely kill him."},{"name":"COCOBUKI","text":"But let us not dwell on this unpleasant circumstance. For you, on the other hand, are brimming with thaumaturgic potential! Remain diligent in your studies, and do not cease in your efforts to expand your wellspring of power!"}],"reward":{"items":[{"id":2057},{"id":3015,"one":1},{"id":2661,"one":1},{"id":3538,"one":1},{"id":3769,"one":1},{"num":2,"id":5824,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":8}],"questsType":"all","quests":[65882,65883]},"next":[65886]},"partials":[{"type":"npc","id":"1001708","obj":{"i":1001708,"n":"Cocobuki","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1001710","obj":{"i":1001710,"n":"Cocobani","l":40,"q":2}},{"type":"item","id":"2057","obj":{"i":2057,"n":"Copper Scepter","l":9,"c":32801,"t":6,"p":297}},{"type":"item","id":"3015","obj":{"i":3015,"n":"Amateur's Dalmatica","l":10,"c":42017,"t":35,"p":280}},{"type":"item","id":"2661","obj":{"i":2661,"n":"Amateur's Hempen Coif","l":10,"c":41527,"t":34,"p":226}},{"type":"item","id":"3538","obj":{"i":3538,"n":"Hempen Dress Gloves","l":11,"c":44159,"t":37,"p":224}},{"type":"item","id":"3769","obj":{"i":3769,"n":"Amateur's Duckbills","l":10,"c":46109,"t":38,"p":230}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65882","obj":{"i":65882,"n":"My First Scepter","g":134,"l":"Ul'dah","s":12,"f":1}},{"type":"quest","id":"65883","obj":{"i":65883,"n":"The Threat of Intimacy","g":134,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"65886","obj":{"i":65886,"n":"The Threat of Superiority","g":134,"l":"Ul'dah","s":150,"f":1}}]}