{"quest":{"name":"Way of the Thaumaturge","location":"Ul'dah","id":65881,"patch":2.0,"sort":11,"icon":100061,"unlocksFunction":1,"eventIcon":71341,"issuer":1002279,"target":1001708,"involved":[1001709],"genre":134,"journal":["Yayake wishes you to reaffirm your desire to join the Thaumaturges' Guild.","Yayake has bid you seek out the eldest of five brothers, thaumaturge siblings who each bear the title of guildmaster. Speak with Cocobygo in the inner sanctum of the Thaumaturges' Guild.","Cocobuki has set you a trial to test the limits of your aptitude for channeling thaumaturgy. Exercise your sorcerous might and slay three huge hornets, three star marmots, and three snapping shrews.","You have slain the specified creatures. Return to the Thaumaturges' Guild and report to Cocobuki.","Cocobuki has formally accepted you into the ranks of the Thaumaturges' Guild. Continue to train and expand your reserves of magical endurance that you might further explore the yawning abyss of thaumaturgy's mysteries.<br><br>※The next thaumaturge quest will be available from Cocobuki upon reaching level 5."],"objectives":["Speak with Cocobygo.","Slay star marmots.","Slay huge hornets.","Slay snapping shrews.","Report to Cocobuki at the Thaumaturges' Guild."],"dialogue":[{"name":"YAYAKE","text":"Well, adventurer? Will you join our guild, or do you presume to ignore the urgings of impatient destiny?"},{"name":"YAYAKE","text":"A wise decision, indeed. To prepare for your initiation, I would have you study the volumes of fundamental thaumaturgical principle. All one hundred and eight of them."},{"name":"YAYAKE","text":"...Or at least, I <span class=\"emphasis\">would</span> if such requirements had not been abolished. “Too great a deterrent to fresh novices,” they said. I suppose you shall just have to settle for calling upon the collective wisdom of our guildmasters."},{"name":"YAYAKE","text":"We have five, you see─all brothers of the same house. Though they all wield supreme authority, it is the eldest who provides a singular voice for the guild when one is required. Master Coco... Cocoby...? Cocobygo! ...I believe."},{"name":"YAYAKE","text":"You choose to close your eyes to fate's beckoning hand? Very well, but you cannot avoid this path forever. Sooner or later, your steps will bring you back to the Ossuary...and our guild."},{"name":"COCOBYGO","text":"Who!? What!? Oh. Thal's teeth, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">man</span></span>, did your mother never tell you not to startle a thaumaturge?"},{"name":"COCOBANI","text":"Look at that expectant face, Cocobygo! This <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> is obviously a new applicant for the guild seeking audience with our eldest brother."},{"name":"COCOBEZI","text":"Oh, Prelate Yayake... She can recite the three hundred and seven verses of the <span class=\"emphasis\">Funerary Rites for the Virtuous Fallen</span> from memory, but the simple task of keeping our names straight seems ever beyond her grasp."},{"name":"COCOBOHA","text":"Bwahahahaha! Well, I for one find the constant confusion endlessly entertaining! My apologies, <span class=\"alternative-container\"><span class=\"alternative\">my dear</span><span class=\"alternative\">good sir</span></span>, my merriment was not meant to mock your mistake. It is our sibling Coco<span class=\"emphasis\">buki</span> with whom you should speak."},{"name":"COCOBUKI","text":"What's this, what's this? Great Thal has led to us a new aspirant?"},{"name":"COCOBYGO","text":"Aaah! Cocobuki! Were you here the entire time!?"},{"name":"COCOBUKI","text":"Greetings, child. I am Cocobuki, the eldest─and, I would venture to say, the wisest─of the five masters of the Thaumaturges' Guild. It is my solemn duty to furnish our would-be initiates with a succinct understanding of our beloved art, thus I would have your fullest attention."},{"name":"COCOBUKI","text":"To wield thaumaturgy is to unleash devastation of the highest magnitude. The lethal force of our spells far exceeds the destructive capability of any other form of arcane manipulation."},{"name":"COCOBUKI","text":"Fire, lightning, blizzards, somnolence─the thaumaturge calls upon an expansive arsenal of offensive incantations to incapacitate and obliterate all manner of adversaries."},{"name":"COCOBUKI","text":"Open your mind to our sorcerous teachings, and you, too, shall soon hold the unparalleled power of our discipline in the palm of your hand."},{"name":"COCOBUKI","text":"Hm hm hm... Of course, such power has a price. You must be willing to plunge headfirst into the forbidding chasm of thaumaturgy's secrets─for advancement in this art comes only with the completion of deadly and terrible trials."},{"name":"COCOBUKI","text":"I ask you now, aspirant: are you prepared to leap into the abyss in pursuit of power unrivaled?"},{"name":"Q1","text":"Are you prepared to leap into the abyss?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"COCOBUKI","text":"Hm hm hm... A confident response. Your name, if you will? Very well, <span class=\"highlight\">Forename</span>, let us mark your initiation with a trial to test the limits of your aptitude for channeling thaumaturgy."},{"name":"COCOBUKI","text":"Huge hornets, star marmots, and snapping shrews inhabit this land in abundance. Exercise your sorcerous might and slay three of each of these creatures before returning to my side."},{"name":"COCOBUKI","text":"Have my words lodged a splinter of fear in your mind? We are patient, aspirant─return to us again once your undeniable ambition has scoured this wasted terror from your thoughts."},{"name":"COCOBUKI","text":"Hm hm hm... You have the satisfied look of a mage who has utterly vanquished <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> foes. <span class=\"highlight\">Forename</span>, I formally welcome you into the brotherhood of thaumaturges."},{"name":"COCOBUKI","text":"The purpose of this trial was to gauge your capacity for wielding thaumaturgy; an innate quality the limits of which are bound by the level of aetheric energy flowing through your physical being."},{"name":"COCOBUKI","text":"Aether─the very stuff of life─exists within all living creatures to a greater or lesser extent. Remember this, for it is the most basic law of arcane manipulation."},{"name":"COCOBUKI","text":"Now, I have here a tome that shall serve you as a hunting log."},{"name":"COCOBUKI","text":"As the name suggests, its pages are to be filled with records of the enemies you slay. The log also contains the names of such adversaries that will challenge and improve your skills as a thaumaturge."},{"name":"COCOBUKI","text":"As your experience grows, so shall your reserves of thaumaturgical endurance. The wellspring of your magical might will also swell in response to moments of extreme terror and duress."},{"name":"COCOBUKI","text":"When you find yourself seeking greater challenge, when next you crave the thrill of exquisite fear, that is when you shall know the time has come for you to visit me once more. Hm hm hm hm hm..."},{"name":"SYSTEM","text":"The next thaumaturge quest will be available from Cocobuki upon reaching level 5."}],"reward":{"job":7,"items":[{"num":5,"id":4728},{"id":2219}],"xp":100},"reqs":{"jobs":[{"lvl":1,"id":8}]},"next":[65883,65884]},"partials":[{"type":"npc","id":"1002279","obj":{"i":1002279,"n":"Yayake","l":40,"q":9,"t":"Guild Receptionist"}},{"type":"npc","id":"1001708","obj":{"i":1001708,"n":"Cocobuki","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1001709","obj":{"i":1001709,"n":"Cocobygo","l":40,"q":5}},{"type":"item","id":"4728","obj":{"i":4728,"n":"Raisins","l":3,"c":24058,"t":46,"p":5}},{"type":"item","id":"2219","obj":{"i":2219,"n":"Square Maple Shield","l":1,"c":30017,"t":11,"p":72}},{"type":"quest","id":"65883","obj":{"i":65883,"n":"The Threat of Intimacy","g":134,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"65884","obj":{"i":65884,"n":"The Threat of Paucity","g":134,"l":"Ul'dah","s":100,"f":1}}]}