{"quest":{"name":"The Threat of Intimacy","location":"Ul'dah","id":65883,"patch":2.0,"sort":50,"icon":100061,"unlocksFunction":1,"eventIcon":71341,"issuer":1001708,"target":1001709,"involved":[1002027],"genre":134,"journal":["Guildmaster Cocobuki wishes to draw you further into the abyss of thaumaturgy's secrets.","Listen to Guildmaster Cocobygo's lesson taken from “The Threat of Intimacy,” the first chapter from Zozomaya's lauded guide <span class=\"emphasis\">Thaumaturgy: The Yawning Abyss</span>.","The passage recited by Cocobygo warns that a thaumaturge would do well to keep <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> enemies at a distance. To put this teaching into practice, take the dried fish given to you and set it down in the field located to the northeast of the Silver Bazaar. Its presence should lure out an unsuspecting vulture upon which you can unleash thaumaturgical devastation.","You have placed the dried fish. Find an area from which you can comfortably view the fish and wait for a circling vulture to appear. When it does, slay the scavenger while still at range.","You have slain the vulture. Take a slice of the vulture's breast meat to Fafafono in the nearby Silver Bazaar.","Fafafono seems pleased by your offering of the lightly charred bird meat. Return to the Thaumaturges' Guild and report your success to Cocobygo.","Though you have but recently learned firsthand the merits of engaging in conflicts from a distance, you are unfortunately subjected to a close-range quarrel between the guildmasters and their youngest brother, Cocobusi. It seems the infuriated sibling lacks the aptitude for thaumaturgy and resents his siblings for their refusal to accept him for training. Guildmaster Cocobuki bids you pay the incident no mind and return to your study of thaumaturgical mysteries.<br><br>※The next thaumaturge quest will be available from Cocobuki upon reaching level 10."],"objectives":["Speak with Cocobygo.","Place the dried fish at the specified location northeast of the Silver Bazaar.","Wait for the chance to slay a circling vulture.","Hand a slice of vulture breast meat to Fafafono in the Silver Bazaar.","Report to Cocobygo at the Thaumaturges' Guild."],"dialogue":[{"name":"COCOBUKI","text":"Hm hm hm... Your burgeoning power strains against the confines of your untried mortal shell. Another trial you must have!"},{"name":"COCOBUKI","text":"From this day forth, your tasks and challenges will be shaped by the teachings found within <span class=\"emphasis\">Thaumaturgy: The Yawning Abyss</span>, a tome penned by the renowned thaumaturge Zozomaya."},{"name":"COCOBUKI","text":"My brothers─who have not once tasted the bitter draught of defeat─will instruct you on the vital lessons to be gleaned from the four extensive chapters that comprise this exemplary work. Much shall you learn about the threats with which a practitioner of our art must contend."},{"name":"COCOBUKI","text":"The first chapter, “The Threat of Intimacy,” falls within Cocobygo's purview. It is only fitting that one so...averse to being approached should teach you the wisdom to be uncovered therein."},{"name":"COCOBYGO","text":"Aaargh!"},{"name":"COCOBYGO","text":"Ah, yes, <span class=\"highlight\">Forename</span>. I've been expecting you! Allow me to read to you the pertinent passages from the opening chapter to Zozomaya's guide. Ahem."},{"name":"COCOBYGO","text":"“The Threat of Intimacy.<br>Ah, how magnificent the potent power we wield. Roaring flames, piercing ice, and shocking bolts are matched not by fist or sword or spear."},{"name":"COCOBYGO","text":"“But the burly warrior waxes fearsome with every closing step. Fists shatter bone; blades slide through flesh; spears puncture soft bellies. Know you this threat, and stand you apart from such men.”"},{"name":"COCOBYGO","text":"&lt;shiver&gt; Ugh, that last part makes me queasy no matter how often I recite it... The lesson, however, should be obvious: keep your distance from your foes."},{"name":"COCOBYGO","text":"Apart from the agony of being hit...or stabbed...or worse, you'll have a devil of a time completing an incantation with an enemy flailing his weapons at your person. Thus the wise thaumaturge always strikes from afar─the farther the better."},{"name":"COCOBYGO","text":"Now, let us proceed with your trial. Take this dried fish and set it down in the vicinity of the Silver Bazaar. Next, simply draw back to a comfortable distance and wait for a vulture to swoop in to feed."},{"name":"COCOBYGO","text":"That's when you ambush the nasty creature with a barrage of deadly spells! Once you have slain the scavenger, be sure to retrieve a generous slice of vulture meat for Fafafono."},{"name":"COCOBYGO","text":"He doesn't mind us conducting trials so close to his shop, so long as he's properly compensated. ...Yes, <span class=\"highlight\">Forename</span>, we pay him in sorcery-blasted bird flesh."},{"name":"FAFAFONO","text":"You're done making use of my “testing grounds,” are you? Cough up the fee, then."},{"name":"FAFAFONO","text":"Hee hee! There's nothing so tender as a bit of meat pummeled with wanton wizardry. Nice doing business with you, thaumaturge."},{"name":"COCOBUSI","text":"(-Diminutive Alchemist-)...Did you say “thaumaturge”? Has this mage just completed a guild trial?"},{"name":"FAFAFONO","text":"Ah, Master Alchemist, what brings you out to our bazaar this fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>?"},{"name":"FAFAFONO","text":"The <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> here just slew <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> a plump vulture. You'd be surprised at how many of these scepter-wielding sorcerers end up sliced to ribbons by beak and talon. And that's not the sort of flesh I've a taste for, you understand."},{"name":"COCOBUSI","text":"(-Diminutive Alchemist-)My brothers... Not again!"},{"name":"COCOBYGO","text":"Aaah! Ah, welcome back, <span class=\"highlight\">Forename</span>. You seem to have done well. Both eyes intact. Face appears unshredded."},{"name":"COCOBANI","text":"It truly is the most terrible feeling to have one's casting interrupted by heinous injury."},{"name":"COCOBEZI","text":"Hmph. It's one of the easier trials, if you ask me. Keep well away from pointy, slashy, bashy things if you want to reach the end of an arcane utterance─that's just common sense."},{"name":"COCOBOHA","text":"Fortune favors the fighter who flings fire from afar! I simply love the look of loathing leveled at me by the distant duelist distressed by my deadly downpour! Bwahahahaha!"},{"name":"COCOBYGO","text":"&lt;cringe&gt; We thaumaturges excel at offense, but fail miserably at defense. Our most effective strategy is to topple our adversaries with overwhelming force before they have a chance to respond. Honor is for knights...and dead mages."},{"name":"COCOBUKI","text":"Hm hm hm... <span class=\"highlight\">Forename</span>, your studies appear to be progressing nicely. It won't be long before you dominate the battlefield as an avatar of sorcerous destruction."},{"name":"COCOBUSI","text":"(-Diminutive Alchemist-)So it's true, Buki! Don't try to hide from me, Bygo! Or you, Bani! Or Bezi! Or Boha!"},{"name":"COCOBUKI","text":"C-Cocobusi!? What are you doing here!?"},{"name":"COCOBUSI","text":"You promised! You promised you would teach me next!"},{"name":"COCOBUKI","text":"Well, yes, of course we did, Busi, but─ <span class=\"highlight\">Forename</span> here was most insistent!"},{"name":"COCOBUSI","text":"&lt;sniffle&gt; And once again you brush me aside in the hope that I abandon my heart's desire! Why do you deny me!?"},{"name":"COCOBUSI","text":"I hate you! All of you!"},{"name":"COCOBUKI","text":"Please, Busi! You shouldn't say such hurtful things. You know how delicate Bygo is!"},{"name":"COCOBUKI","text":"&lt;cough&gt; Erm. That was Cocobusi, our youngest brother. He so dearly wishes to become a thaumaturge like the rest of us, but it simply isn't possible. The poor boy's aetheric levels are pitifully low."},{"name":"COCOBUKI","text":"We thought we had convinced him to accept fate's cruel quirks when he entered the Alchemists' Guild, but he yet yearns to walk the path of thaumaturgy."},{"name":"COCOBUKI","text":"Such is Cocobusi's determination that he spends all his waking moments experimenting with alchemical concoctions, seeking a method by which he can expand his capacity for arcane manipulation..."},{"name":"COCOBUKI","text":"Ahem, well, this is obviously not your concern. Back to the abyss with you, young thaumaturge! ...And I mean that in the most encouraging manner possible!"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"items":[{"id":2106},{"id":3007,"one":1},{"id":2655,"one":1},{"id":4421,"one":1},{"id":4091,"one":1},{"num":5,"id":5823,"one":1}],"xp":560},"reqs":{"jobs":[{"lvl":5,"id":8}],"questsType":"any","quests":[65881,65882]},"next":[65884,65885]},"partials":[{"type":"npc","id":"1001708","obj":{"i":1001708,"n":"Cocobuki","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1001709","obj":{"i":1001709,"n":"Cocobygo","l":40,"q":5}},{"type":"npc","id":"1002027","obj":{"i":1002027,"n":"Fafafono","l":42,"q":3}},{"type":"item","id":"2106","obj":{"i":2106,"n":"Bone Staff","l":5,"c":33001,"t":7,"p":234}},{"type":"item","id":"3007","obj":{"i":3007,"n":"Custom-made Robe of Casting","l":6,"c":42308,"t":35,"p":100}},{"type":"item","id":"2655","obj":{"i":2655,"n":"Hempen Hat","l":5,"c":41015,"t":34,"p":113}},{"type":"item","id":"4421","obj":{"i":4421,"n":"Bone Ring","l":9,"c":54432,"t":43,"p":132}},{"type":"item","id":"4091","obj":{"i":4091,"n":"Copper Wristlets","l":8,"c":55601,"t":42,"p":229}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"quest","id":"65881","obj":{"i":65881,"n":"Way of the Thaumaturge","g":134,"l":"Ul'dah","s":11,"f":1}},{"type":"quest","id":"65882","obj":{"i":65882,"n":"My First Scepter","g":134,"l":"Ul'dah","s":12,"f":1}},{"type":"quest","id":"65884","obj":{"i":65884,"n":"The Threat of Paucity","g":134,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"65885","obj":{"i":65885,"n":"The Threat of Paucity","g":134,"l":"Ul'dah","s":100,"f":1}}]}