{"quest":{"name":"The Threat of Perplexity","location":"Ul'dah","id":65887,"patch":2.0,"sort":200,"icon":100061,"unlocksFunction":1,"eventIcon":71341,"issuer":1001708,"target":1001708,"involved":[1001712,1002305,1002306,1002322,1002323,1002324],"genre":134,"journal":["Guildmaster Cocobuki wishes you to learn from the next chapter of <span class=\"emphasis\">Thaumaturgy: The Yawning Abyss</span>.","Listen to Cocoboha, the second-youngest brother, as he instructs you from the chapter entitled “The Threat of Perplexity.”","You learn of a recent spate of murders perpetrated by a villain known only as the “Mageslayer.” The killer appears to be exclusively targeting thaumaturges, draining them of their aetheric vitality. Head to Nophica's Wells in western Thanalan, and aid Cocobusi in his attempt to track down this seemingly insatiable predator.","Cocobusi has bid you examine the remains of the slain thaumaturges. Head into the nearby stream, and see what evidence of the killer can be found.","You have recovered a bloody scepter, a shredded tome, and a bloody bracelet from the corpses of the unfortunate mages. Return to Cocobusi, and see what he can determine from the sullied objects.","After noting the freshness of the blood staining the items you recovered, Cocobusi believes the killer may yet be lurking nearby. Head back into the stream, and draw out the Mageslayer by using yourself as bait. You nervously hope that the Roegadyn warrior does, indeed, stand ready to leap into the fray!","With the help of the stalwart swordsman, you have succeeded in defeating the trio of imps. Report your success to Cocobusi.","Cocobusi laments that a single imp managed to escape the scene of slaughter. Search for the cowardly voidsent in the shaded outcropping to the southeast, and bring your trial to a satisfying conclusion.","The true identity of the Mageslayer has been revealed. Return to the Thaumaturges' Guild and report to Cocoboha.","Cocoboha, seemingly unaware of his younger sibling's possession, declares that with the successful completion of this lesson's trial, your training with the <span class=\"emphasis\">Yawning Abyss</span> is now at an end. Speak with Cocobuki, and learn what is to be done about Cocobusi.","Cocobuki appears shaken and dismayed by his confrontation with the voidsent-possessed Cocobusi. He asks that you leave him in peace for a time, that he might consider his next course of action.<br><br>※The next thaumaturge quest will be available from Cocobygo upon reaching level 25."],"objectives":["Speak with Cocoboha.","Speak with Cocobusi in Nophica's Wells.","Gather evidence from the thaumaturges' corpses.","Deliver the evidence to Cocobusi.","Offer yourself as bait.","Speak with Cocobusi.","Investigate the shaded outcropping.","Report to Cocoboha at the Thaumaturges' Guild.","Speak with Cocobuki.","Defeat the soulsucker imp and its minions!"],"dialogue":[{"name":"SCENE00019","text":"Duty calls. Do you wish to proceed with<br>“The Threat of Perplexity”?"},{"name":"SCENE00019","text":"Yes"},{"name":"SCENE00019","text":"No"},{"name":"COCOBUKI","text":"<span class=\"highlight\">Forename</span>, you're safe! I feared you had fallen victim to the “Mageslayer”! Have you not heard of the recent spate of gruesome killings taking place within Ul'dah?"},{"name":"COCOBUKI","text":"Each case involves at least one dead thaumaturge, and every corpse is found bloody, battered, and utterly drained of aetheric energy. "},{"name":"COCOBUKI","text":"Ill tidings aside, I am glad to see you alive and glowing with vitality─it is time for you to delve into the final chapter of the <span class=\"emphasis\">Yawning Abyss</span>. Cocoboha, our second-youngest sibling, will read to you from “The Threat of Perplexity.”"},{"name":"COCOBOHA","text":"Bwahaha! Greetings, <span class=\"highlight\">Forename</span>! Are you once more prepared to peruse the pages of power and peril? Then let us begin."},{"name":"COCOBOHA","text":"“The Threat of Perplexity.<br>Ah, how magnificent the daunting power we wield. Flames pursue, ice transfixes, and lightning dances into the ranks of our enemies."},{"name":"COCOBOHA","text":"“But what terror descends when, from all sides, those ranks close? Flames are smothered, ice crushed, and lightning grounded. Know you this threat, and ware you the multitudinous foe.”"},{"name":"COCOBOHA","text":"Is the point of this passage readily apparent? It would be most problematic, for example, should you meet this malefic Mageslayer and he─or she─proves to be multiple murderers."},{"name":"COCOBOHA","text":"What a thaumaturge needs is a thickset thrall...er, courageous companion to accompany <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> in cases where collective cronies are expected. Now, as for your trial─"},{"name":"COCOBUSI","text":"Cocoboha! Pray allow me to suggest a PRACTICAL course for <span class=\"highlight\">Forename</span>'s training!"},{"name":"COCOBUSI","text":"The town is buzzing with the news of yet more SLAUGHTERED thaumaturges, their mutilated bodies found fouling the waters of Nophica's Wells. I would have <span class=\"highlight\">Forename</span> aid me in hunting down the culprit while the trail is yet FRESH!"},{"name":"COCOBOHA","text":"<span class=\"highlight\">Forename</span> may have tolerated your interruption of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> trial the last time, Busi, but you are hardly the hardy henchman <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> needs to clear such a hazardous hurdle."},{"name":"COCOBUSI","text":"Your concerns are understandable, brother. If it would allay your FEARS, I can introduce <span class=\"highlight\">Forename</span> to a valiant warrior who recently entered my employ."},{"name":"COCOBOHA","text":"You have secured the services of a stalwart swordsman? Then, that would, indeed, be in line with learning the lesson of the day. Perhaps─"},{"name":"COCOBUSI","text":"Come now, <span class=\"highlight\">Forename</span>! Let us be about our business before Cocoboha has a change of HEART. I'll be waiting for you in Nophica's Wells!"},{"name":"COCOBUKI","text":"Was that...Cocobusi?"},{"name":"COCOBUSI","text":"Ah, <span class=\"highlight\">Forename</span>, so GOOD of you to come! My Roegadyn friend here is the warrior I mentioned back at the Ossuary."},{"name":"COCOBUSI","text":"Now, there's no time to waste! Why don't you head into the stream and examine the bodies of the slain mages? I would go with you, but with my DELICATE stomach, I fear I might...contaminate the scene. Remember: you're looking for anything that might help us track down this killer."},{"name":"COCOBUSI","text":"You'll find the bloodied CORPSES over in the running stream east of here. Examine the remains, and see what clues you can find!"},{"name":"GLADIATOR","text":"The Lalafell promised me a sack full o' gil to do what I do best─an' that's keepin' all the attention on me. Hah!"},{"name":"COCOBUSI","text":"Did you uncover anything...incriminating?"},{"name":"COCOBUSI","text":"Hee hee! The blood is yet slick to the touch. The SLAUGHTER must have been recent indeed."},{"name":"COCOBUSI","text":"The villain may yet lurk nearby! Return to the creek where the bodies lay and linger for a time. I daresay your aura, saturated as it is with ENTICING aetheric energy, will lure the Mageslayer into the open. Have courage, <span class=\"highlight\">Forename</span>─our burly companion stands ready to leap to your aid!"},{"name":"COCOBUSI","text":"Back to the stream, <span class=\"highlight\">Forename</span>! Wait by the place where you found the bodies. Your ALLURING aura may serve to draw out this insatiable Mageslayer."},{"name":"COCOBUSI","text":"It seems your partnership with our hired blade went splendidly! It is unfortunate, though, that one of the imps was able to FLUTTER away... Oh? Did you not notice?"},{"name":"COCOBUSI","text":"You wouldn't wish to report to Cocoboha with your trial but half-finished, would you? Of course not. I'm AFRAID, however, that the Roegadyn has already collected his recompense and departed for the nearest alehouse. What to do, what to do?"},{"name":"COCOBUSI","text":"Hmmm. Surely, a thaumaturge of your CALIBER can handle a single imp, yes? If I'm not mistaken, it fled into that little cave over there. Hurry now, before it slips away into some hidden nook or cranny!"},{"name":"COCOBUSI","text":"The imp must be hiding inside that little cave. If you HURRY, you may catch it before it escapes you entirely!"},{"name":"COCOBUKI","text":"That is <span class=\"emphasis\">not</span> Cocobusi. Well, it <span class=\"emphasis\">is</span> Cocobusi...but a Cocobusi possessed by the voidsent that escaped from Mormo's urn! It was feeding on the aetheric energy of all those slain thaumaturges."},{"name":"SUCCUBUS","text":"Hee hee hee! And you, my dear, mana-rich <span class=\"highlight\">Forename</span>, were to be NEXT! I have wanted to absorb YOUR delicious power since the moment we met."},{"name":"SUCCUBUS","text":"A pity. This has been such an AMUSING charade. How ever did you see through it?"},{"name":"COCOBUKI","text":"Hm hm hm. I am Cocobusi's brother. How could I not? It is time I destroyed you, Mormo, and put a stop to these sinister killings. As the eldest, I must take responsibility for my family's misadventures."},{"name":"SUCCUBUS","text":"Hee hee. A coward like YOU? Destroy ME? Your opening strike should have pierced my heart, but instead, you aimed for the KNIFE."},{"name":"SUCCUBUS","text":"Fear stays your hand─fear that slaying me will ALSO slay your sibling!"},{"name":"SUCCUBUS","text":"Hee hee! Poor, spineless thaumaturge. I shall, however, leave you with a pleasant thought: it was Cocobusi's FERVENT wish to amass this power!"},{"name":"SUCCUBUS","text":"He CRAVED the arcane strength to stand beside his brothers as an equal. What a shame that he must now stand AGAINST you! Hee hee hee!"},{"name":"COCOBUKI","text":"It pains me to admit, but there is some truth to that creature's words. I surrendered the perfect opportunity to end this. I have betrayed my own teachings..."},{"name":"COCOBUKI","text":"Return to the Ossuary and report the completion of your trial, <span class=\"highlight\">Forename</span>. I will remain here for a time and...gather my thoughts."},{"name":"COCOBOHA","text":"Ah, <span class=\"highlight\">Forename</span>! Cocobuki has advised me of your adventures. It seems the Mageslayer slithered away, but your stint with the swordsman was nonetheless successful!"},{"name":"COCOBOHA","text":"Consider this chapter complete; your time with our tome of teachings is at an end!"},{"name":"COCOBOHA","text":"Ahem. Well, to be absolutely accurate, there <span class=\"emphasis\">is</span> an addendum with additional advice, but Cocobuki considers it “extracurricular.” Even I dare not delve into those diabolical depths─I do not yet deign to die, you understand!"},{"name":"COCOBUKI","text":"I have yet to inform my brothers of Cocobusi's misfortune; I have yet to reconcile the maelstrom within my own mind."},{"name":"COCOBUKI","text":"The most fundamental lessons of thaumaturgy demanded I slay the creature where it stood. It was the most opportune moment to strike─minimal risk, and victory all but assured. How many more will suffer for my hesitation...and my cowardice?"},{"name":"COCOBUKI","text":"It will likely be some time, however, before Mormo resurfaces to kill again. Now that we have uncovered the deception, the voidsent will seek a new hunting ground where Cocobusi's face is unknown."},{"name":"COCOBUKI","text":"And though the respite may be brief, I must devote this time to considering my next course of action. Pray leave me to my musings, <span class=\"highlight\">Forename</span>."},{"name":"FRIEND","text":"Aha! The demon shows its claws!"},{"name":"FRIEND","text":"I'll keep it busy.<br>You just focus on magickin'!"},{"name":"FRIEND","text":"This bastard's got some nasty spells!<br>Stay well back, you hear!?"},{"name":"FRIEND","text":"Put the big bugger to sleep!<br>I can't take three at once!"},{"name":"FRIEND","text":"That takes care o' that!<br>I'm off to collect me coin!"}],"reward":{"items":[{"id":2111},{"id":27666,"one":1},{"id":2703,"one":1},{"id":3568,"one":1},{"id":3800,"one":1},{"num":5,"id":5824,"one":1}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":8}],"quests":[65886]},"next":[65888]},"partials":[{"type":"npc","id":"1001708","obj":{"i":1001708,"n":"Cocobuki","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1001712","obj":{"i":1001712,"n":"Cocoboha","l":40,"q":1}},{"type":"npc","id":"1002305","obj":{"i":1002305,"n":"Cocobusi","l":42,"q":1}},{"type":"npc","id":"1002306","obj":{"i":1002306,"n":"Stalwart Swordsman","l":42,"q":2}},{"type":"npc","id":"1002322","obj":{"i":1002322,"n":"Thaumaturge Corpse","l":42,"q":1}},{"type":"npc","id":"1002323","obj":{"i":1002323,"n":"Thaumaturge Corpse","l":42,"q":1}},{"type":"npc","id":"1002324","obj":{"i":1002324,"n":"Thaumaturge Corpse","l":42,"q":1}},{"type":"item","id":"2111","obj":{"i":2111,"n":"Staghorn Staff","l":20,"c":33003,"t":7,"p":1170}},{"type":"item","id":"27666","obj":{"i":27666,"n":"Altered Cotton Dalmatica","l":18,"c":42657,"t":35}},{"type":"item","id":"2703","obj":{"i":2703,"n":"Ash Mask (Lapis Lazuli)","l":20,"c":40415,"t":34,"p":425}},{"type":"item","id":"3568","obj":{"i":3568,"n":"Cotton Dress Gloves","l":21,"c":44076,"t":37,"p":589}},{"type":"item","id":"3800","obj":{"i":3800,"n":"Cotton Dress Shoes","l":22,"c":46194,"t":38,"p":783}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65886","obj":{"i":65886,"n":"The Threat of Superiority","g":134,"l":"Ul'dah","s":150,"f":1}},{"type":"quest","id":"65888","obj":{"i":65888,"n":"The Hidden Chapter","g":134,"l":"Ul'dah","s":250,"f":1}}]}