{"quest":{"name":"The Threat of Superiority","location":"Ul'dah","id":65886,"patch":2.0,"sort":150,"icon":100061,"unlocksFunction":1,"eventIcon":71341,"issuer":1001708,"target":1001711,"involved":[1002300,1002301,1002302],"genre":134,"journal":["Guildmaster Cocobuki urges you ever deeper into the yawning abyss of thaumaturgy.","Listen to Cocobezi as he instructs you from the chapter entitled “The Threat of Superiority.”","A trio of furious merchants have come to demand recompense for the crate of ether consumed by the guildmaster siblings. Elicit the traders' sympathy by crying, and convince them to leave empty-handed.","Your tears have convinced the merchants to leave without pressing their case for repayment. Report your success to Cocobezi.","You have been assigned a trial that requires you to destroy the cursed artifact known as Mormo's urn. Keeping in mind how effective a well-timed Sleep spell can be, track down and defeat the Alacran thieves who have stolen the urn and are now traveling in the southeast of Drybone.","You have defeated the Alacran thieves and destroyed Mormo's urn. Return to the Thaumaturges' Guild and report to Cocobezi.","Cocobuki is impressed with your control and skill in the midst of an unexpected situation. You are, however, concerned with the change that has come over Cocobusi after the unusual events of your trial. Endeavor to keep your lessons fresh in your mind as you return to your training in thaumaturgy.<br><br>※The next thaumaturge quest will be available from Cocobuki upon reaching level 20."],"objectives":["Speak with Cocobezi.","/cry to elicit sympathy from the furious merchants.","Report to Cocobezi.","Lie in wait at the designated location.","Report to Cocobezi at the Thaumaturges' Guild.","Locate Mormo's urn!","Defeat the Alacran henchmen!"],"dialogue":[{"name":"COCOBUKI","text":"Come, <span class=\"highlight\">Forename</span>, the yawning abyss beckons once more."},{"name":"COCOBUKI","text":"Today, Cocobezi will instruct you from the chapter entitled, “The Threat of Superiority.”"},{"name":"COCOBEZI","text":"You are come for your lesson, <span class=\"highlight\">Forename</span>? Then heed well my words..."},{"name":"COCOBEZI","text":"“The Threat of Superiority.<br>Ah, how magnificent the intimidating power we wield. Flames sear the air, ice frosts the ground, and lightning flashes with blinding incandescence."},{"name":"COCOBEZI","text":"“But not all are cowed by our elemental fury. Ignite not your flames, summon not your ice, and strike not with your lightning. Know you this threat, and stay your hand against such foes.”"},{"name":"COCOBEZI","text":"Once you cut away all the overblown imagery, the passage draws attention to an important tactic: a wise thaumaturge does not engage in battle against opponents <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> cannot defeat."},{"name":"COCOBEZI","text":"A fine example would be avoiding conflict with Ul'dah's multitude of furious merchants. These soulless, ravening creatures are afflicted with the madness of insatiable avarice."},{"name":"COCOBEZI","text":"Do you perhaps recall the crate of ether you retrieved from the Amalj'aa bandits? Well, a number of irate peddlers have arrived at the guild with the gall to demand recompense for the <span class=\"emphasis\">few</span> measly vials we emptied as our just reward."},{"name":"COCOBEZI","text":"...Alright, yes, we drank the entire bloody box. But the point is that the guild cannot presently afford to pay such a sum. Thus, I pass on to you the secret of my last and most potent defense:"},{"name":"COCOBEZI","text":"Shameless weeping."},{"name":"COCOBEZI","text":"I'm not speaking of a few tears here─I want you to stride right up to these tyrannical traders and <span class=\"highlight\">cry</span> your eyes out."},{"name":"SHOUNINA","text":"Hey! You ether-swilling miscreant! Where's the gil you owe me!?"},{"name":"SHOUNINA","text":"I... Alright, alright, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">son</span></span>! I know you're the one who chased down those Amalj'aa brutes for us. I'll let it go this one time. For your sake."},{"name":"SHOUNINB","text":"Thaumaturge! What manner of guild are you running here!? Do you simply loot and pillage the goods of fine, upstanding citizens as you see fit!?"},{"name":"SHOUNINB","text":"It's not that─ Oh dear, I'm not angry at you, you understand. It's those five, ether-addled brothers I take issue with. You tell them the next time this happens, I'll have the price taken out of their unprincipled hides!"},{"name":"SHOUNINC","text":"Ye ought to be ashamed of yerself! Did yer mother never teach ye that a merchant's to be paid for his wares!?"},{"name":"SHOUNINC","text":"Well, y-ye needn't cry about a few vials of ether, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I'll tell ye what: ye dry yer eyes for me, an' I'll take care o' the loss out o' me own purse."},{"name":"COCOBEZI","text":"A masterful performance, <span class=\"highlight\">Forename</span>. The sniffling was a nice touch. You will, however, encounter foes who are unmoved by such piteous wailings. Take this recent request, for instance, which I have nominated to serve as your next trial..."},{"name":"COCOBEZI","text":"A team of scholars has asked for a thaumaturge to destroy a cursed relic they unearthed known as “Mormo's urn.” While pottery is, by and large, immune to tears, it is the Alacran thieves that subsequently stole it that concern me."},{"name":"COCOBEZI","text":"The Alacran are an organization of criminals not normally known for their gentle or understanding dispositions. Rather than attempting to engage an entire gang of their thugs, I would suggest you neutralize the threat to your person with a well-timed Sleep spell."},{"name":"COCOBEZI","text":"The Alacran have been seen traveling in the southeast of Drybone. Find them, and destroy the urn they carry."},{"name":"COCOBUSI","text":"<span class=\"highlight\">Forename</span>, a moment, if you please! Pray allow me to shatter that urn!"},{"name":"COCOBUSI","text":"I... I thought that if I assisted you with your task, then my brothers might finally deign to take me seriously. So, I followed you."},{"name":"TOUZOKU","text":"What've we got here, then? A couple o' nosy sand rabbits that're about to get skinned!"},{"name":"COCOBUSI","text":"Oh, dear gods! Where did they come from!?"},{"name":"COCOBUSI","text":"That was simply incredible, <span class=\"highlight\">Forename</span>. I wish I could wield the same sort of power."},{"name":"COCOBUSI","text":"I became an alchemist in the hopes of creating some manner of mana-amplifying elixir, but all my efforts have been for naught. The results have been far too mild to make any difference."},{"name":"COCOBUSI","text":"I'll never be a thaumaturge like my brothers at this rate. I'll forever be the pitiful, powerless little sibling."},{"name":"COCOBUSI","text":"Mormo's urn. If I destroy it, then maybe my family will see what I'm capable of..."},{"name":"SUCCUBUS","text":"(-Mormo's Urn-)Wait, wait, wait, wait, WAIT! Don't you DARE break my urn!"},{"name":"COCOBUSI","text":"Ahhh! What the─!? Did that piece of pottery just <span class=\"emphasis\">talk</span>? Are...are you Mormo, the voidsent!?"},{"name":"SUCCUBUS","text":"(-Mormo-)Hee hee, well, yes, I AM Mormo. But I'm one of the NICE voidsent."},{"name":"SUCCUBUS","text":"(-Mormo-)It was the NASTY ones that sealed me up in here for helping a mortal. If you would be so kind as to open the lid of my urn, I would be HAPPY to grant you a wish! Anything you desire! Fortune? Fame?"},{"name":"COCOBUSI","text":"I... I'm not really interested in fame or fortune. But perhaps there is one thing: I'd like to have aetheric power to equal that of my brothers..."},{"name":"SUCCUBUS","text":"(-Mormo-)Hee hee! POWER, is it? A perfectly acceptable wish! In fact, I sense the latent ability buried deep within your spirit. It will be a SIMPLE thing for me to turn it loose!"},{"name":"SUCCUBUS","text":"(-Mormo-)...What more is there to think about? OPEN the lid!"},{"name":"COCOBUSI","text":"Hmmm. Well, I don't feel different at all. I think Mormo may have been lying."},{"name":"COCOBUSI","text":"Come, <span class=\"highlight\">Forename</span>, it's time we were leaving. Oh, weren't we supposed to break this urn?"},{"name":"COCOBUSI","text":"And that is that! Yes, this will be such FUN─ Ahem, I mean, it will be nice to return home after all this excitement."},{"name":"COCOBEZI","text":"Welcome back, <span class=\"highlight\">Forename</span>. I am glad to see you making a habit out of not dying."},{"name":"COCOBEZI","text":"Before we discuss your trial further, however, I would ask you about Cocobusi. When I saw him but a few moments ago, he seemed...odd. Well, odder than usual. Would you happen to know aught of it?"},{"name":"Q1","text":"How do you respond?"},{"name":"A1","text":"Cocobusi joined me at my trial."},{"name":"A1","text":"..."},{"name":"COCOBEZI","text":"Your eyes betray the secret within your breast. If you do not aid me in aiding my brother, things will go ill for you, <span class=\"highlight\">Forename</span>."},{"name":"COCOBEZI","text":"He... Busi was at your trial!?"},{"name":"COCOBUKI","text":"It is extraordinarily dangerous and foolish to interfere with a thaumaturge's training. I shall have to scold him most heartily."},{"name":"COCOBUKI","text":"&lt;sigh&gt; Such unpleasantness aside, I am impressed that you claimed victory in spite of this unexpected development. The teachings of the <span class=\"emphasis\">Yawning Abyss</span> have served you well."},{"name":"COCOBUKI","text":"With your experience and control thus demonstrated, I believe you are ready to add a new spell to your repertoire─Scathe. This elementally neutral blast of force will prove effective against all manner of opponents."},{"name":"COCOBUKI","text":"As I am sure you are eager to test this incantation's efficacy, I shall grant you leave to return to your training. Hm hm hm... I pity the next hostile creature that crosses your path."},{"name":"SCENE00013","text":"Duty calls. Do you wish to proceed with<br>“The Threat of Superiority”?"},{"name":"SCENE00013","text":"Yes"},{"name":"SCENE00013","text":"No"},{"name":"COCOBUSI","text":"I'm no thaumaturge, but I still have my tricks!"},{"name":"COCOBUSI","text":"Are you injured!? I have a salve for that!"}],"reward":{"action":156,"items":[{"id":2059},{"id":2233},{"id":3024,"one":1},{"id":3547,"one":1},{"id":3327,"one":1},{"id":3777,"one":1},{"num":2,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":8}],"questsType":"any","quests":[65884,65885]},"next":[65887]},"partials":[{"type":"npc","id":"1001708","obj":{"i":1001708,"n":"Cocobuki","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1001711","obj":{"i":1001711,"n":"Cocobezi","l":40,"q":2}},{"type":"npc","id":"1002300","obj":{"i":1002300,"n":"Raging Merchant","l":40,"q":2}},{"type":"npc","id":"1002301","obj":{"i":1002301,"n":"Ranting Merchant","l":40,"q":2}},{"type":"npc","id":"1002302","obj":{"i":1002302,"n":"Raving Merchant","l":40,"q":1}},{"type":"action","id":"156","obj":{"i":156,"n":"Scathe","c":462,"j":7,"t":2,"l":15}},{"type":"item","id":"2059","obj":{"i":2059,"n":"Brass Cudgel","l":15,"c":32812,"t":6,"p":564}},{"type":"item","id":"2233","obj":{"i":2233,"n":"Square Ash Shield","l":17,"c":30019,"t":11,"p":683}},{"type":"item","id":"3024","obj":{"i":3024,"n":"Cotton Cowl","l":15,"c":43610,"t":35,"p":663}},{"type":"item","id":"3547","obj":{"i":3547,"n":"Hard Leather Ringbands","l":16,"c":48239,"t":37,"p":365}},{"type":"item","id":"3327","obj":{"i":3327,"n":"Cotton Tights","l":15,"c":45083,"t":36,"p":315}},{"type":"item","id":"3777","obj":{"i":3777,"n":"Hard Leather Boots","l":15,"c":46139,"t":38,"p":480}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65884","obj":{"i":65884,"n":"The Threat of Paucity","g":134,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"65885","obj":{"i":65885,"n":"The Threat of Paucity","g":134,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"65887","obj":{"i":65887,"n":"The Threat of Perplexity","g":134,"l":"Ul'dah","s":200,"f":1}}]}