{"quest":{"name":"A Ponze of Flesh","location":"Mor Dhona","id":65893,"patch":2.45,"sort":7,"repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1010809,"target":1010809,"genre":73,"usedItems":[9539,9540,9538,9510,9511],"journal":["Papana is grumbling to herself about ancient tomes and a lack of custom.","The garrulous Papana reveals that she is in Revenant's Toll to free her old associate G'jusana from the shackles of heavy debt. To that end, the bookseller will part with a rare tome which details the Zodiac Weapons, but only if you can furnish her with the following rare items: a Bronze Lake crystal, a Bombard core, and a bottle of sacred spring water. The first of these may be found in the vicinity of the lake of its namesake.","Having painstakingly obtained the requested items, you return to Papana only to find that their quality is not to her satisfaction. Judging them insufficient payment for the book, Papana further asks you fetch her a horn of the beast which prowls Dzemael Darkhold, and a gobmachine bangplate from Brayflox's Longstop.<br><br>※Dzemael Darkhold and Brayflox's Longstop (Hard) can be accessed via the Duty Finder.","Through great effort, you have obtained the goods Papana requested. Make your way back to Revenant's Toll and present them to her.","Upon returning to Papana, you are told that a wealthy collector seeks to buy the selfsame book you desire, and the competition has driven up the price of exchange. The Lalafellin shopkeep will now settle for nothing less than a Narasimha hide and a sickle fang, highly prized objects found only within Halatali and Snowcloak.<br><br>※Halatali (Hard) and Snowcloak can be accessed via the Duty Finder.","Through sheer perseverance, you have succeeded in obtaining the next set of items Papana has requested. Make your way back to Revenant's Toll, and pray that your toils are finally over.","Your prayers go unanswered, for Papana has yet another request to make of you. Rowena, the bookseller explains, has tasked her with incinerating those tomes that are unfit to sell, and only when this chore is finished can she turn her attention back to you. If you would obtain your book, suppress your desire to scream, and bring Papana a high-quality furnace ring and a bundle of perfect firewood.<br><br>※Certain ingredients required to craft these items can be obtained by desynthesizing aged goods sold at the Silver Bazaar.","The items for igniting books now in her hands, Papana apologizes for having taken advantage of you. In wistful tones, she tells you of her misspent youth, and of her admiration and respect for G'jusana. Thanking you for your part in helping her dear friend get closer to financial freedom, Papana presents you with the object of your desire: the Book of Skylight. With the knowledge held within, Gerolt may now faithfully recreate such an arm as was wielded by the Zodiac Braves of legend.<br><br>※If you have obtained all four items requested by Gerolt, you may return to Hyrstmill to have your Zodiac Weapon forged."],"objectives":["Deliver a Bombard core, a bottle of sacred spring water, and a Bronze Lake crystal to Papana.","Obtain a horn of the beast from Dzemael Darkhold.","Obtain a gobmachine bangplate in Brayflox's Longstop (Hard).","Deliver the requested items to Papana.","Obtain a Narasimha hide from Halatali (Hard).","Obtain a sickle fang from Snowcloak.","Deliver the requested items to Papana.","Deliver a furnace ring <img class=\"hq-icon small\" src=\"images/item/hq.png\"> and a bundle of perfect firewood <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Papana."],"dialogue":[{"name":"PAPANA","text":"Oh, what use is it havin' wares aplenty to sell, an' not a soul 'round with any intent to buy 'em!? &lt;sigh&gt; But I suppose gripin' about it won't change things none, nor do aught for G'jusana."},{"name":"PAPANA","text":"...Oh? An' where did a strappin' <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> like yerself spring from? If ye've a mind to barter for tomes, there's no need to speak with yon pretty lass. Nay, Papana'll deal with ye instead."},{"name":"PAPANA","text":"Now, don't think ill of me as some filcher of other's custom. Nay, though I may be the wanderin' sort at heart, I'm here because G'jusana is me dearest friend from years back. I hadn't thought to meet her again in a place like this, though."},{"name":"PAPANA","text":"'Tis the cruelest of fates that keeps me friend here pawnin' books, 'venturer. Aye, G'jusana's fallen into fearsome debt with that harpy Rowena. Sellin' tomes is dull as the day is long, but even <span class=\"emphasis\">that's</span> a boon for the lass."},{"name":"PAPANA","text":"Well, Papana's nothin' if not loyal, so I march meself up to Rowena, an' wheedle meself work peddlin' tomes. What wages I don't need to eat, I'm usin' to pay down G'jusana's debts! Now, 'venturer, were ye not just tellin' me why ye've come yerself?"},{"name":"PAPANA","text":"A book about ancient heroes an' the weapons they wielded, eh? Well, there's a chance I laid eyes on such a tome just a few days ago, so there is!"},{"name":"PAPANA","text":"Tell ye what: how about we make a fair trade of it? The book ye want for...a Bombard core an' a bottle of sacred spring water. ...An' a Bronze Lake crystal. Aye. That's an equitable deal, if I do say so meself."},{"name":"PAPANA","text":"Why, shouldn't be but the work of a moment for a 'venturer like yer fine self. But I'll give ye a hint anyway─gab a bit with the merchants 'round Camp Bronze Lake, an' ye might just get a shiny bit of rock."},{"name":"PAPANA","text":"Well, if it ain't me favorite adventurin' <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! 'Tis grand to see ye, but I thought our dealings were done...unless ye've more custom for Papana?"},{"name":"PAPANA","text":"...Ahhh, so ye've come callin' after <span class=\"emphasis\">another</span> ancient tome. Well, it'll be me pleasure to hand it over to ye─<span class=\"emphasis\">after</span> ye bring me goods what are of equal value. I'll be wantin' the same as last time─a Bombard core, a bottle of sacred spring water, an' a Bronze Lake crystal."},{"name":"PAPANA","text":"Ye'll find the last one in upper La Noscea, same as last time. I'm a bit lost as to where to get the other two, but ye managed it fine before. Now off ye go─I've got tomes to peddle to other people, ye know."},{"name":"PAPANA","text":"Well, seein' as yer back to prate, I take it ye've found the stuff I asked for?"},{"name":"PAPANA","text":"Now let's─ Hold on a moment! Are ye tryin' to cheat me out of a book with these!? The Bombard core is missin' a bit, an' there's a hair in the sacred spring water─an' 'tain't no upstandin' head hair, neither!"},{"name":"PAPANA","text":"Now I'm not blamin' ye, but ye must see that tradin' a rare an' precious book for trinkets ain't fair. But I believe in second chances, an' I'm willin' to settle for somethin' else."},{"name":"PAPANA","text":"Somethin' like... Somethin' like a horn of the beast what prowls Dzemael Darkhold. Aye, that an' a gobmachine bangplate from Brayflox's Longstop will do nicely."},{"name":"PAPANA","text":"Now, 'tain't as if either grows on trees. The truth of it is, ye would have more luck findin'...well, a gobmachine bangplate on a tree!"},{"name":"PAPANA","text":"'Course, that's why moneyed dilettantes will pay a small fortune for two such rare pieces. If ye bring 'em to me, ye'll get yer book <span class=\"emphasis\">an'</span> a kiss, so ye will!"},{"name":"PAPANA","text":"...Now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, this Bronze Lake crystal would fetch a fine price─<span class=\"emphasis\">if</span> it weren't covered in grime! Ye can try to pawn useless stuff off on me all ye wish, but I'll be havin' none of it!"},{"name":"PAPANA","text":"...Ah, well, I'll grant ye another chance anyroad. How about another horn of the beast from Dzemael Darkhold an' a gobmachine bangplate from Brayflox's Longstop for yer book?"},{"name":"PAPANA","text":"Why, it won't take a big strappin' <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> like ye more than a moment, seein' as ye've danced this jig before!"},{"name":"PAPANA","text":"'Tis a grand thing to talk, but I'd rather have a horn of the beast an' gobmachine bangplate in hand before we start gabbin'."},{"name":"PAPANA","text":"...Well now, 'tain't a single thing wrong with these. But I fear ye've taken a few more bells than ye ought to have."},{"name":"PAPANA","text":"While I was bidin' me time waitin' for ye, who should come by but some moneyed eccentric after me books on legendary arms. An' ye can bet his questions were backed up with a grand old coinpurse, so they were."},{"name":"PAPANA","text":"Well, says I, “I'm happy to hear ye've enough gil to buy a library's worth of rare books, but this one ain't for sale!” I've a proper sense of duty that's not like to bend for the lure of coin, so I turned him down for ye."},{"name":"PAPANA","text":"But there's a limit to me kindness. After all, I've still got to eat, an' set me friend free from Rowena. At present, I can't think of a reason in the realm to sell off the book...so long as ye bring me a Narasimha hide from Halatali an' a sickle fang from Snowcloak."},{"name":"PAPANA","text":"...Well, yer silence means we've an understandin'. Ain't business relationships grand old things?"},{"name":"PAPANA","text":"'Course, a lass can't hold out forever, no matter how strong her principles are. Best ye trot off, then, before I change me mind."},{"name":"PAPANA","text":"Well, these are exquisite examples of perfection, but ye...well, ye've taken far too long to deliver them to me again, so ye have."},{"name":"PAPANA","text":"While I was standin' here all on me lonesome, see, that old moneyed eccentric came back. Aye, yer man even walks up bold as brass, an' tells me to name me price!"},{"name":"PAPANA","text":"Well, I says, “thank ye kindly, sir, but that particular tome's earmarked for me 'venturer friend.” Aye, I turned down another allurin' offer. Because I've got faith in ye. &lt;wink&gt;"},{"name":"PAPANA","text":"I take it ye've read 'twixt the lines? Grand, grand."},{"name":"PAPANA","text":"I think it's to be another Narasimha hide from Halatali an' a sickle fang from Snowcloak. 'Tis such a <span class=\"emphasis\">small</span> request that I can't imagine any reason ye should make a poor lass wait about too long. Can <span class=\"emphasis\">you</span>?"},{"name":"PAPANA","text":"Well, don't we have a look of accomplishment about us? An' do we have the Narasimha hide an' a sickle fang to back it up?"},{"name":"PAPANA","text":"Thank ye, friend. 'Tis a grand thing that ye've done for me... So it pains me to tell ye I can't hand over yer book just as yet. See, I've to earn a lot of gil to free G'jusana, an' I can't very well do that if I fall from Rowena's good graces."},{"name":"PAPANA","text":"As it happens, Rowena's ordered me to toss a heap of old tomes too moldy for sellin' into the furnace. I've no clue why, but I've to do that before speakin' to those with custom."},{"name":"PAPANA","text":"But I've no notion how long it will take me to set fire to the lot. An' 'tis twice the pity, as I could incinerate the whole heap in an instant if only I had a furnace ring to light the blaze an' a bundle of perfect firewood to keep it aflame."},{"name":"PAPANA","text":"&lt;sigh&gt; Ain't life unfair, 'venturer? Here I was, all ready to give ye the book ye've worked so hard for, an' I can't for dealin' with another task..."},{"name":"PAPANA","text":"Eh? Ye'll bring 'em to me? Ah, yer a true friend. So I'll not have ye stumblin' 'round the realm in search of the things. I've heard bits of aged items in the Silver Bazaar can find new use if ye've the skill to take them apart."},{"name":"PAPANA","text":"Well now, I'll just await ye here. Now hurry on back to this dainty lass!"},{"name":"PAPANA","text":"Oh, 'tis a grand thing ye've done for me, an' it pains me I must do ye wrong in return. But I've to ask one more thing of ye before givin' ye yer reward."},{"name":"PAPANA","text":"See, Rowena's just tasked me with burnin' another heap of old books. Lucky thing it is, then, that ye can bring what I need to light the flames─a furnace ring an' a bundle of perfect firewood."},{"name":"PAPANA","text":"There's no need to look so downhearted, 'venturer. The book ye been lustin' for will be yers after ye've brought me what I want─cross me heart an' hope to die!"},{"name":"PAPANA","text":"Well, has me favorite 'venturer come with a furnace ring an' a bundle of perfect firewood?"},{"name":"PAPANA","text":"Twelve be praised─ye've done it! Now I won't have to spend ages up to me ears in musty old books!"},{"name":"PAPANA","text":"Ye've done right by me, I must admit. I never thought ye'd do <span class=\"emphasis\">all</span> I asked of ye, 'specially as I'm the one what'll profit most from yer labor. But 'tis all for the good if it serves to set G'jusana free."},{"name":"PAPANA","text":"Ahaha...ha... I do hope yer not <span class=\"emphasis\">too</span> upset with me. I realize it's horrible to take advantage of the vulnerable, an' even more horrible <span class=\"emphasis\">knowin'</span> that's what yer doin'."},{"name":"PAPANA","text":"I was on the other end, once, when I hadn't two gil to scrape together. I had to join a certain crew known for havin' sticky fingers to get by. 'Twas there I met G'jusana. Don't know what I'd have done without her... Hells, I'd probably be rottin' away in some godsforsaken gaol."},{"name":"PAPANA","text":"A saint among thieves, that G'jusana is, one what trusted not wisely but too bloody well. Her lover ran off with the crew's coffers, an' she took the responsibility for repayin' it. Well, she was kicked out on her tail with a mountain of debt to boot."},{"name":"PAPANA","text":"Nothin' for the pretty lass but to steal an' skirmish to make the money back. But a hard life that is, an' G'jusana washed up here broken an' battered to lick her wounds before too long. Well, she meets Rowena, sells herself into servitude to pay off her debts, an' ye know the rest."},{"name":"PAPANA","text":"'Tain't a new story, of course─me travels have taught me that much. The realm's full to burstin' with hardworkin' souls like her, good folk what keep goin' even after bein' stabbed in the back. But I want someone to beat the odds, an' I'll do all I can for that someone to be me friend."},{"name":"PAPANA","text":"Well, don't I sound the sentimental fool? Anyroad, ye've given what I was wantin', an' now it's me turn. Here, have yer Book of Skylight. I hope it helps ye beat the odds, too."},{"name":"PAPANA","text":"Ah, but ye've been a grand old friend to me, an' to G'jusana. A true pity it is that her debt's so great. Even between the pair of us, we've only put a little dent in it. But if that lightens her load, then 'tis all for the best, eh?"},{"name":"PAPANA","text":"'Tain't me cup of tea, this work, but I'll not despair nor falter till G'jusana is her own woman again."},{"name":"PAPANA","text":"Well, I'm a lass of me word─have another copy of the Book of Skylight. 'Tis hard earned, but well deserved."},{"name":"SYSTEM","text":"You have obtained all the necessary items to recreate a Zodiac Weapon. Report to Gerolt at Hyrstmill to proceed."}],"reward":{"items":[{"id":9506}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[65892]}},"partials":[{"type":"npc","id":"1010809","obj":{"i":1010809,"n":"Papana","l":67,"q":1}},{"type":"item","id":"9506","obj":{"i":9506,"n":"Book of Skylight","l":1,"c":25932,"t":63}},{"type":"item","id":"9539","obj":{"i":9539,"n":"Bombard Core","l":1,"c":21261,"t":54}},{"type":"item","id":"9540","obj":{"i":9540,"n":"Sacred Spring Water","l":1,"c":22614,"t":54}},{"type":"item","id":"9538","obj":{"i":9538,"n":"Bronze Lake Crystal","l":1,"c":20020,"t":61,"p":100000}},{"type":"item","id":"9510","obj":{"i":9510,"n":"Furnace Ring","l":90,"c":54407,"t":61}},{"type":"item","id":"9511","obj":{"i":9511,"n":"Perfect Firewood","l":90,"c":52113,"t":50}},{"type":"quest","id":"65892","obj":{"i":65892,"n":"Wherefore Art Thou, Zodiac","g":73,"l":"North Shroud","s":6,"f":1}}]}