{"quest":{"name":"A Treasured Mother","location":"Mor Dhona","id":65896,"patch":2.45,"sort":10,"repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1006981,"target":1006981,"involved":[1010811],"genre":73,"usedItems":[9539,9540,9544,9516,9517],"journal":["Brangwine seems in a world to herself.","Brangwine is more than willing to give you the flawless alexandrite her son found...in exchange for a few things. The first is a Bombard core to heat her bath, and the second is a bottle of sacred spring water for stain removal. The last is a fine brass kettle of the type fashionable in the North Shroud. Obtain all three to warm her heart.","Brangwine takes what you have brought her not with a smile, but with a sigh. Though she wishes to leave Ealdwine money enough to settle down, she worries he never will have the chance. Treasure hunting is, after all, a dangerous business, and so the mother insists you make way to western La Noscea, and persuade her boy to give it up.","No less soused or stubborn than usual, Ealdwine refuses to stop treasure hunting until he finds his one, big score. Help him do so by searching Amdapor Keep, Pharos Sirius, and the Tam–Tara Deepcroft for lost treasure.<br><br>※Amdapor Keep, Pharos Sirius, and the Tam–Tara Deepcroft (Hard) can be accessed via the Duty Finder.","Dirty and tired, you nevertheless now have the three treasure coffers. Return to Swiftperch so that Ealdwine might pry them open.","You watch as Ealdwine lifts the lids of coffers not opened for an age...only to find worthless junk inside. Never one to lose heart for long, though, the treasure hunter lets you in on another tip: there may be another great treasure lost in the Stone Vigil. Go now and see if there is any truth to Ealdwine's claim.<br><br>※The Stone Vigil (Hard) can be accessed via the Duty Finder.","The treasure of the Stone Vigil is lost no more. Return with it to Swiftperch, and hope that this, too, is not filled with rubbish.","Excited as a little boy, Ealdwine pries opens the lost treasure from the Stone Vigil. However, once again, he finds nothing but junk. Ealdwine then proclaims he cannot give up treasure hunting yet. However, so as to not to leave you completely empty-handed, he imparts the way to his mother's heart: high-quality tailor-made eel pie and a piece of perfect cloth. Obtain these and return to Revenant's Toll.<br><br>※Certain ingredients required to craft these items can be obtained by desynthesizing aged goods sold at the Silver Bazaar.","You could not fulfill your part of the bargain, and Ealdwine remains a treasure hunter. Nonetheless, Brangwine is so pleased with her eel pie and fine fabric that she gives you the piece of flawless alexandrite anyway. With patience and persistence, she reasons, she will make her son give up treasure hunting.<br><br>※If you have obtained all four items requested by Gerolt, you may return to Hyrstmill to have your Zodiac Weapon forged."],"objectives":["Deliver a Bombard core, a bottle of sacred spring water, and a brass kettle to Brangwine.","Speak with Ealdwine in Swiftperch.","Obtain the lost treasure from Amdapor Keep.","Obtain the lost treasure from Pharos Sirius.","Obtain the lost treasure from the Tam–Tara Deepcroft (Hard).","Deliver the lost treasures to Ealdwine.","Obtain the lost treasure from the Stone Vigil (Hard).","Deliver the lost treasure to Ealdwine.","Deliver a tailor-made eel pie <img class=\"hq-icon small\" src=\"images/item/hq.png\"> and a piece of perfect cloth <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Brangwine."],"dialogue":[{"name":"BRANGWINE","text":"Why, if it isn't the nice <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who wanted all those maps! What brings you Brangwine's way?"},{"name":"BRANGWINE","text":"Alexandrite? Oh, that bit of crystal my son brought home? I've been using it to brighten up my garden, but if it means that much to you I suppose I could part with it."},{"name":"BRANGWINE","text":"Well, in exchange for a few things, anyway. It's just a few items that I have wanted for of late, and certainly nothing an adventurer like yourself should have any trouble with. Do we have a deal?"},{"name":"BRANGWINE","text":"Good! Well, the first thing I would like you to bring me is a Bombard core. I just have to drop it into the bath and presto: boiling water to soak my bones in!"},{"name":"BRANGWINE","text":"Next, I should like some sacred spring water. My neighbor swears by it for getting stains out of dirty clothing."},{"name":"BRANGWINE","text":"And lastly, I need a new teapot, a proper brass one. I should like something a bit easier to use than the chipped earthenware one I have now."},{"name":"BRANGWINE","text":"I am sure you can barter or buy Bombard cores and spring water, though I do not know where. But I do believe you are like to find metal kettles in the North Shroud."},{"name":"BRANGWINE","text":"Oh my, after another bit of...alexandrite, was it? Well, you are in luck─my son just brought one home. I shall be happy to give it to you. In exchange for a few items, of course."},{"name":"BRANGWINE","text":"The Bombard core and bottle of sacred spring water you brought were terribly useful, so I would like another one of each. Oh, and a brass kettle for good measure."},{"name":"BRANGWINE","text":"Old Brangwine will be here rain or shine, so just make sure to come back with all I asked for, hmmm?"},{"name":"BRANGWINE","text":"My, that was quick! Are you sure you have everything? Even the brass kettle?"},{"name":"BRANGWINE","text":"Deary me, aren't these lovely! Thank you, young one. &lt;sigh&gt; I wish I could afford to buy such goods every day. But I have been tightening the purse strings of late."},{"name":"BRANGWINE","text":"I should like to leave my son a tidy sum after I die. Not too much, of course, but enough that he can find a home for himself."},{"name":"BRANGWINE","text":"Would that my husband were alive to watch over Ealdwine after I'm gone... Yet it is better not to dwell on what could have been. <span class=\"emphasis\">I</span> must set my son on his own two feet."},{"name":"BRANGWINE","text":"Mark my words, young one: treasure hunting will not end well for him, the same as─ Well, never mind who. The point is nothing I say can convince him to give it up."},{"name":"BRANGWINE","text":"Hmmm... Perhaps it would carry more weight coming from an adventurer. Well, then, I have another task for you: persuade my son to stop chasing treasure."},{"name":"BRANGWINE","text":"He is somewhere in western La Noscea, I believe. If you can make him see the folly of his ways, then that crystal is yours."},{"name":"BRANGWINE","text":"Yes, these will do nicely. Thank you. ...I am sorry if I seem curt. It's just my Ealdwine went off on yet another treasure hunt just this morning."},{"name":"BRANGWINE","text":"Would you go and talk to him again? As best I could make out, he was bound for western La Noscea."},{"name":"BRANGWINE","text":"It would lift the worry from my mind, and perhaps another lecture will be just the thing to make him stop treasure hunting."},{"name":"EALDWINE","text":"Day in and day out, I huntsh and I huntsh, but I've nothing to show for me troublesh. It'll be yearsh 'fore I can bring Ma any bloody cheer..."},{"name":"EALDWINE","text":"'Courshe, plummeting to me death won't make her lesh glum neither."},{"name":"EALDWINE","text":"Aaah! When did ye─hic!─get here!? Byregot'sh gut, I need shomethin' to shoothe me nervesh after the shtart ye gave me!"},{"name":"EALDWINE","text":"Eh? Ye came on Ma'sh behalf? Hah! I'll wager─hic!─she wantsh ye to put paid to me treashure huntin' days."},{"name":"EALDWINE","text":"Save yer shermon, friend─I'm not changin' me waysh. Ealdwine'sh a treashure hunter through an' through. Hellsh, I couldn't earn enough gil for watery grog if I tried me hand at shomethin' else."},{"name":"EALDWINE","text":"I know in me heart o' heartsh that me one, great treashure'sh still out there! An' I ain't quittin' till I've got it!"},{"name":"EALDWINE","text":"'Courshe, no one'sh shaid I've to go it on me own... How'd ye feel about huntin' me treashure for me?"},{"name":"EALDWINE","text":"I jusht traded me lasht pair o' socksh for a tip or three, shee? Word ish, there'sh richesh losht shomewhere in Amdapor Keep, Pharos Siriush, an'─hic!─the Tam–Tara Deepcroft."},{"name":"EALDWINE","text":"Now, they're a bit too periloush for ol' Ealdwine. But a 'venturer like ye will be jusht fine, won't ye?"},{"name":"EALDWINE","text":"An' if any one o' thoshe treashuresh ish big enough for me and Ma to live like kingsh, then I sholemnly shwear to give up treashure huntin'─crossh me heart!"},{"name":"EALDWINE","text":"Yer not here on Ma'sh ordersh <span class=\"emphasis\">again</span>, are ye? Hah, she'sh jusht as hardheaded as me."},{"name":"EALDWINE","text":"Well, I'll tell ye same as lasht time─I'll only give up treashure huntin' when I find the richesh me pa died dreamin' of!"},{"name":"EALDWINE","text":"But I got a lead. I were caroushin' lasht night, an' heard there'sh <span class=\"emphasis\">more</span> treashure losht in Amdapor Keep, Pharos Siriush, an' the Tam–Tara Deepcroft!"},{"name":"EALDWINE","text":"I know ye already looked, but ye musht've jusht─hic!─misshed it the lasht time. But if ye can turn up me one an' only, then I'll quit thish life!"},{"name":"EALDWINE","text":"Now leave me to me drink till ye've got coffersh full o' treashure with ye! Ahahaha!"},{"name":"EALDWINE","text":"Me dreamsh will come true all for the losht richesh, me friend! Jusht think o' the grog the treashures will buy me!"},{"name":"EALDWINE","text":"&lt;sniff&gt; That shmell─it ain't the sweet scent o'─hic!─treashure, ish it?"},{"name":"EALDWINE","text":"Three coffersh─that'sh a wondroush sight, friend! Let me pry theshe open and shee what'sh inshide! I tellsh ye, I haven't been sho exshited for..."},{"name":"EALDWINE","text":"Nothin'... What!? Thish...thish ain't nothin' but a bunch o' queer knickknacksh! What wrinkly scrote thought thish shite was worthy o' keepin' in a treashure coffer!?"},{"name":"EALDWINE","text":"Ah well. Ol' Ealdwine don't get disheartened that eashily. Might be as I've got a trick up me shleeve. Shee, there'sh <span class=\"emphasis\">another</span> losht treashure!"},{"name":"EALDWINE","text":"An' <span class=\"emphasis\">you</span> are goin' to find it for me in the Shtone Vigil! I'd do it meshelf, but I've tired meshelf out from all thish shoutin'!"},{"name":"EALDWINE","text":"I've a good feelin' about thish time! Great richesh are callin' to me from─hic!─inshide theshe coffersh: open ush, open ush!"},{"name":"EALDWINE","text":"...Byregot'sh gut, theshe're filled with rubbish again. That bloke in the tavern'sh full o' shite. “Richesh so great I'd never have to work another day in me life”─hah!"},{"name":"EALDWINE","text":"But I'm not─hic!─givin' up jusht like that. Ye've an idea o' why, don't ye?"},{"name":"EALDWINE","text":"There'sh another treashure in the Shtone Vigil! Now if ye nab it for me, ol' Ealdwine will never ask nothin' o' ye again'! ...If the coffer ish full."},{"name":"EALDWINE","text":"Me friend, why aren't ye in the Shtone Vigil? If ye bring me the richesh─hic!─what'sh losht there, I'll deal ye a cut an' spend me days happily soushed in grog!"},{"name":"EALDWINE","text":"Did ye find shomethin' in the Shtone Vigil, friend?"},{"name":"EALDWINE","text":"'Mazing bloody 'venturer, ye are! I can almosht tashte the treashure from here! Let'sh open her up, eh?"},{"name":"EALDWINE","text":"Knickknacksh...<span class=\"emphasis\">again</span>!? &lt;sniffle&gt; And I was so shure that...I mean, the bloody losht treashure o' the Shtone Vigil!? Yearsh I've been at thish, an' for what?"},{"name":"EALDWINE","text":"The Twelve're tellin' me shomethin', an' I'm bound to lishten. Their message ish loud an' clear: keep treashure huntin'!"},{"name":"EALDWINE","text":"The more I─hic!─shtruggle now, the bigger me find will be. An' till I get me one an' only, there ain't no reashon to give up treashure huntin'! Shorry if ye were 'spectin' another anshwer, me friend."},{"name":"EALDWINE","text":"Ah, don't shcrew up yer face like that. Ol' Ealdwine'll leave ye with a little shecret: tailor-made eel pie an' a piece o' perfect cloth. Give that pair to Ma, an' she'll give ye whatever ye wantsh!"},{"name":"EALDWINE","text":"Ma ain't so bad, even with the fusshin'. I know she'sh got me best intereshts at heart. She'sh jusht frettin' so I don't go the same way as Pa─may he resht in peace."},{"name":"EALDWINE","text":"Died chasin' dreamsh o' wealth, Pa did. I only became a treashure hunter to walk in his footshteps. I meansh to find everythin' he sought, an' make Ma happy along the way."},{"name":"EALDWINE","text":"Well, now ye know why I can't shtop! Ahahaha, anyroad, might be as ye can make Ma'sh treatsh from shomethin' old in the Silver Bazaar. Now <span class=\"emphasis\">I'm</span> off to the tavern─hic!─in search o' new treashure!"},{"name":"EALDWINE","text":"Thish ish it! Thish ish the coffer what holdsh me untold richesh!"},{"name":"EALDWINE","text":"...No, no, it don't. Byregot'sh buttock, why'sh it always junk an' refushe in theshe losht treashures?"},{"name":"EALDWINE","text":"Well, ye 'member our deal─I ain't quittin' thish life till I've got me grand richesh."},{"name":"EALDWINE","text":"But ye worked hard, so I'll give ye the same advice as last time: a tailor-made eel pie an' a piece o' perfect cloth are the keysh to Ma'sh heart."},{"name":"EALDWINE","text":"Well, I'm off to find new treashure. I'll keep an eye out for ye on the road─long as I ain't shleepin' one off in the ditch, ahaha!"},{"name":"BRANGWINE","text":"You were gone for quite a while, adventurer. Does that mean my son has come to his sens─ Eh? You have something to give me?"},{"name":"BRANGWINE","text":"Hehe, my favorite eel pie and some beautiful cloth for my needlework... And Ealdwine told you to get them, you say?"},{"name":"BRANGWINE","text":"That son of mine, remembering what is dear to my heart! Hehe, he might not have too much betwixt the ears, but he has a good heart."},{"name":"BRANGWINE","text":"My late husband was just the same, always chasing his dreams. Now, my son is the very same. Little wonder he is off on yet another treasure hunt."},{"name":"BRANGWINE","text":"And deary me, I had you running about after him! Thank you for trying. I should say you have more than earned this crystal."},{"name":"BRANGWINE","text":"Well, well, eel pie and some beautiful fabric. I suppose this means Ealdwine won't be giving up his treasure hunting?"},{"name":"BRANGWINE","text":"&lt;sigh&gt; He is truly his father's son, but I'll get him to stop chasing empty dreams someday."},{"name":"BRANGWINE","text":"But that's my burden to bear. Here, have your alexandrite, and a mother's thanks."},{"name":"SYSTEM","text":"You have obtained all the necessary items to recreate a Zodiac Weapon. Report to Gerolt at Hyrstmill to proceed."}],"reward":{"items":[{"id":9509}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[65892,66676]}},"partials":[{"type":"npc","id":"1006981","obj":{"i":1006981,"n":"Brangwine","l":67,"q":3}},{"type":"npc","id":"1010811","obj":{"i":1010811,"n":"Ealdwine","l":33,"q":1}},{"type":"item","id":"9509","obj":{"i":9509,"n":"Flawless Alexandrite","l":1,"c":21278,"t":60}},{"type":"item","id":"9539","obj":{"i":9539,"n":"Bombard Core","l":1,"c":21261,"t":54}},{"type":"item","id":"9540","obj":{"i":9540,"n":"Sacred Spring Water","l":1,"c":22614,"t":54}},{"type":"item","id":"9544","obj":{"i":9544,"n":"Brass Kettle","l":1,"c":27601,"t":61,"p":100000}},{"type":"item","id":"9516","obj":{"i":9516,"n":"Tailor-made Eel Pie","l":90,"c":24305,"t":46}},{"type":"item","id":"9517","obj":{"i":9517,"n":"Perfect Cloth","l":90,"c":21612,"t":51}},{"type":"quest","id":"65892","obj":{"i":65892,"n":"Wherefore Art Thou, Zodiac","g":73,"l":"North Shroud","s":6,"f":1}},{"type":"quest","id":"66676","obj":{"i":66676,"n":"One Man's Trash","g":92,"l":"North Shroud","s":500,"f":1}}]}