{"quest":{"name":"Good Intentions","location":"The Rising Stones","id":65899,"patch":2.5,"sort":77,"icon":100365,"eventIcon":71201,"issuer":1008969,"target":1010845,"involved":[1010844,1011127,1011279],"genre":2,"journal":["Minfilia is considering which of her many responsibilities demands her utmost attention.","As the Scions of the Seventh Dawn have grown in size and influence, so too have their responsibilities, prompting Minfilia to consider if their expansion was wise. Alphinaud, however, does not harbor such concerns, having embraced his role as commander of the Crystal Braves and guardian of Eorzea. The young Elezen now wishes to aid the Immortal Flames in their ongoing efforts to bring stability to Ul'dah, and he would like your assistance with this mission as well. Join him outside the solar and listen to what Riol, his subordinate, has to say.","Riol, who has been attempting to trace the source of some weapons wielded by disgruntled refugees, has learned of a large shipment which may be intended for the same purpose. A black marketeer in eastern Thanalan is planning to resell the weapons and reap a tidy profit─unless you and Ilberd intervene before the exchange takes place. Rendezvous with the captain of the Crystal Braves at Highbridge.","Ilberd informs you that the black marketeer's clients have arrived. With luck, you may prevent the sale of illicit goods, seize the men who covet them, and learn their intent."],"objectives":["Speak with Riol.","Speak with Ilberd at Highbridge."],"dialogue":[{"name":"RIOL","text":"Lot o' new faces've come in from all over to join the Crystal Braves. We're glad for the help, o' course, but it's still a right pain in the arse trainin' 'em up."},{"name":"MINFILIA","text":"I am most eager to address the Ascian threat. However, we dare not neglect our other pressing concerns."},{"name":"MINFILIA","text":"We both know full well that Saint Shiva will not be the last primal we face...and our relationship with Ishgard is still tenuous at best."},{"name":"MINFILIA","text":"To think that the resolution of the primal threat was once the sole priority of the Scions of the Seventh Dawn. Some days I wonder if it was wise for us to take on so many other responsibilities."},{"name":"ALPHINAUD","text":"Lest you forget, Antecedent, the Scions need not shoulder the burden alone. Were not the Crystal Braves established for this very reason?"},{"name":"ALPHINAUD","text":"True, we are presented with a multitude of problems. However, we have all the resources we need to address them in turn."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, in particular, is ever a steadying hand, who I trust will continue to support the Braves."},{"name":"MINFILIA","text":"To what do we owe the pleasure? Have there been further developments regarding the situation in Ul'dah?"},{"name":"ALPHINAUD","text":"As expected, the Immortal Flames have been struggling to cope with the revelation that one of their highest-ranking officers was a Garlean agent."},{"name":"ALPHINAUD","text":"Suffice it to say, Teledji Adeledji and his Monetarist ilk have wasted no time in attempting to turn the situation to their advantage. Coupled with ongoing unrest, the Flames are finding themselves hard-pressed."},{"name":"ALPHINAUD","text":"Plainly, General Raubahn needs our help, and I will direct the Crystal Braves to offer what support they can."},{"name":"ALPHINAUD","text":"If I am to stay abreast of the latest developments and issue effective orders, however, I cannot afford to waste time traveling back and forth."},{"name":"ALPHINAUD","text":"And so, for the foreseeable future, I think it would be for the best if I were to remain in Ul'dah─unless you have an objection?"},{"name":"MINFILIA","text":"None whatsoever. We have matters here well in hand."},{"name":"ALPHINAUD","text":"Moenbryda's research is proceeding as planned?"},{"name":"MINFILIA","text":"So she tells me, though I am not familiar with the details."},{"name":"MINFILIA","text":"Urianger is poring over his tomes at the Waking Sands, and the others are contributing in their own ways."},{"name":"MINFILIA","text":"Alas, the key problem─how to form an aetherial blade at will─remains unsolved. Nevertheless, it is only a matter of time."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>, while we focus on that task, mayhap you could assist Alphinaud and his Braves with theirs?"},{"name":"MINFILIA","text":"It would do much to restore faith in the Immortal Flames if the Warrior of Light was seen working on their behalf."},{"name":"MINFILIA","text":"Never forget that your esteemed status allows you to act in ways that those more tightly bound to organizations and nations cannot. As ever, I implore you to do so."},{"name":"ALPHINAUD","text":"Not that your response was ever in doubt, but I humbly thank you once more for aiding our cause."},{"name":"ALPHINAUD","text":"Now then, there are preparations I must attend to before my departure, such as receiving Riol's latest report."},{"name":"ALPHINAUD","text":"He has proven to be quite skilled at gathering information others wish kept secret, hence why I placed him under my direct command and ordered him to investigate the Ul'dahn riots."},{"name":"ALPHINAUD","text":"When you are finished here, join me outside. Depending on what he has to say, I may soon have a favor to ask."},{"name":"MINFILIA","text":"If there are any developments on our front, I shall inform you at once in the usual fashion."},{"name":"MINFILIA","text":"While we focus on resolving the Ascian threat, pray devote your energies to assisting Alphinaud and the Crystal Braves."},{"name":"ALPHINAUD","text":"Is everything in order, <span class=\"highlight\">Forename</span>? Are you ready to attend us?"},{"name":"RIOL","text":"Pleasure as always, <span class=\"highlight\">Forename</span>. You'll be escortin' the commander to Ul'dah, I take it?"},{"name":"ALPHINAUD","text":"Actually, I had another task in mind for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"ALPHINAUD","text":"If you would be so kind as to repeat your report for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> benefit?"},{"name":"RIOL","text":"Right, then."},{"name":"RIOL","text":"Me an' mine've been makin' inquiries into the source o' the weapons what found their ways into refugee hands a ways back."},{"name":"RIOL","text":"So happens we caught wind o' somethin' promisin': a rather large purchase o' sharp an' pointy things by a black marketeer holed up near Highbridge."},{"name":"ALPHINAUD","text":"I doubt that this man would have secured such a quantity of weapons if he did not already have clients waiting─clients that, for whatever reason, would prefer for this transaction to remain secret."},{"name":"RIOL","text":"Brings to mind that merchant what caught an arrow while talkin' to <span class=\"highlight\">Forename</span>, don't it? Generous fellow, he was, dolin' out swords an' spears to the downtrodden an' disgruntled."},{"name":"RIOL","text":"Which isn't to say that these clients have the same mischief in mind...but if ye want to be sure, might be prudent to intervene before they collect their goods, savvy?"},{"name":"ALPHINAUD","text":"Seizing the weapons before they fall into the wrong hands would be for the best. However, if we strike at the appointed hour, we might capture the black marketeer as well as his clients. What say you, <span class=\"highlight\">Forename</span>?"},{"name":"ALPHINAUD","text":"Then it is settled. Rendezvous with Captain Ilberd at Highbridge and intervene when the exchange takes place."},{"name":"ALPHINAUD","text":"Now then, if you would excuse me, I must leave for Ul'dah. I expect good tidings."},{"name":"RIOL","text":"Don't keep Captain Ilberd waitin' for ye too long, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">mate</span></span>. He might have to start without ye!"},{"name":"ILBERD","text":"Ah, <span class=\"highlight\">Forename</span>. My scouts have been keeping a close eye on the black marketeer, and it would seem that his guests have arrived."},{"name":"ILBERD","text":"It would also seem that he has hired more than a few men to stand guard─common thugs of no consequence, but they nevertheless pose a threat."},{"name":"ILBERD","text":"Even so, I feel compelled to apologize. This is far beneath a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your standing, and Commander Leveilleur needn't have dispatched you hither..."},{"name":"ILBERD","text":"But powerful men ever have need of loyal, able-bodied friends. Having found one in you, 'tis only natural that he would come to rely upon you without hesitation."}],"reward":{"gil":802,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"instances":[20004,20005,20006],"quests":[65625]},"next":[65900]},"partials":[{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010845","obj":{"i":1010845,"n":"Ilberd","l":44,"q":2}},{"type":"npc","id":"1010844","obj":{"i":1010844,"n":"Riol","l":481,"q":1}},{"type":"npc","id":"1011127","obj":{"i":1011127,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1011279","obj":{"i":1011279,"n":"Riol","l":481,"q":1}},{"type":"instance","id":"20004","obj":{"i":20004,"n":"The Bowl of Embers (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":49}},{"type":"instance","id":"20005","obj":{"i":20005,"n":"The Navel (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":57}},{"type":"instance","id":"20006","obj":{"i":20006,"n":"The Howling Eye (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":52}},{"type":"quest","id":"65625","obj":{"i":65625,"n":"Let Us Cling Together","g":2,"l":"Northern Thanalan","s":76}},{"type":"quest","id":"65900","obj":{"i":65900,"n":"Bait and Switch","g":2,"l":"Eastern Thanalan","s":78}}]}