{"quest":{"name":"Wherefore Art Thou, Zodiac","location":"North Shroud","id":65892,"patch":2.45,"sort":6,"icon":100347,"unlocksFunction":1,"eventIcon":71341,"issuer":1008948,"target":1008948,"involved":[1003075],"genre":73,"journal":["His brow furrowed, Jalzahn seems deep in thought about the Zodiac Braves' arms.","Far though you have come in your journey to complete your relic weapon, Jalzahn feels as though there is yet more to do. However, he is admittedly stumped about exactly how to proceed. He entreats you to consult with Gerolt, that the three of you might discover a new path to take.","Through the promise of fiery liquor, you have secured Gerolt's promise of aid. Return to Jalzahn with the glad tidings.","Gerolt believes that your relic has become so refined that nothing can enhance it further. Instead, he proposes that the next step upon your journey towards the Zodiac Brave's arms is to recreate one's frame, and infuse it with the soul bound to your current relic. To those ends, he bids you seek four items:<br><br>- Literature on the Zodiac Weapons: seek out a merchant who deals in ancient tomes.<br>- Material for a new host: seek a master of crafting and gathering.<br>- Special sphere scroll: seek a scholar well versed in materia.<br>- Special alexandrite: seek a treasure hunter known for collecting precious stones.<br><br>※Upon collecting all four items, return to Hyrstmill and deliver them to Gerolt."],"objectives":["Speak with Gerolt.","Speak with Jalzahn."],"dialogue":[{"name":"JALZAHN","text":"<span class=\"highlight\">Forename</span>! Come, tell me─how fares your relic?"},{"name":"JALZAHN","text":"Splendid, splendid! Why, I daresay our efforts with soul energy have been well worth it."},{"name":"JALZAHN","text":"...I suppose this is when I ordinarily reveal my next grand plan for further enhancing your relic. &lt;sigh&gt; It shames me to say that I have none to share."},{"name":"JALZAHN","text":"Not for a lack of thought, though. I have revisited each step of your journey, starting with the relic's initial infusion of Thavnairian mist."},{"name":"JALZAHN","text":"From there, I have considered your painstaking collection of crystallized souls, and how each of the twelve varieties of atma were infused into your relic thereafter."},{"name":"JALZAHN","text":"I have reflected on asking you to walk in the footsteps of the Zodiac Braves, and how you absorbed the light of slain souls into your relic."},{"name":"JALZAHN","text":"Ah, and did not such efforts yield a mightier weapon still? Indeed they did, as did using a sphere scroll to imbue your relic with the fortifying strength of materia made into light."},{"name":"JALZAHN","text":"Finally, I have dwelt upon our application of soulglaze so that all the energies became aligned with the weapon. By my estimations, you now hold an arm of unparalleled soul attunement because of it."},{"name":"JALZAHN","text":"It has been quite the winding road we've walked, but we have traversed it with success. And I would perfect your relic, no matter how long it takes. Yet..."},{"name":"JALZAHN","text":"Well...as I said, I have done all I can think to do. The soul within your relic must be close to that of the arm of legend I desire to recreate. But what comes next?"},{"name":"JALZAHN","text":"Mayhap the nature of the soul in your relic is lacking? No, that cannot be. ...Please, <span class=\"highlight\">Forename</span>, do not mistake my pessimism for a lack of will. I simply lack for a <span class=\"emphasis\">way</span>."},{"name":"JALZAHN","text":"&lt;sigh&gt; I am at wit's end─unable to see the forest for the trees, as it were."},{"name":"JALZAHN","text":"Although...I am certainly not without allies. What if...what if <span class=\"emphasis\">Gerolt</span> holds the answer to this particular conundrum? I can't say I relish the notion, but it would be thoughtless to dismiss the man's curious expertise."},{"name":"JALZAHN","text":"Could I ask you to approach him in my stead, <span class=\"highlight\">Forename</span>? You have convinced the man to lend us his aid before. Perchance you can do so again."},{"name":"JALZAHN","text":"Have you spoken with Gerolt yet? I daresay we need his expertise in the matter of your relic."},{"name":"SYSTEM","text":"In order to receive the quest “Wherefore Art Thou, Zodiac,” you must be equipped with a relic weapon nexus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"SYSTEM","text":"In order to advance the quest “Wherefore Art Thou, Zodiac,” you must be equipped with a relic weapon nexus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"GEROLT","text":"If yer here fer yer kettle, it ain't ready. Takes time to get the texture jus' right, ye ken?"},{"name":"GEROLT","text":"Oh, fer the love of the gods, it's <span class=\"emphasis\">you</span>! Does yer yearnin' for punishment know no bounds? Or is it jus' that yonder old coot can't get enough of me sparklin' personality?"},{"name":"GEROLT","text":"Heh, so yer both still founderin' over that relic o' yers? Well, I <span class=\"emphasis\">do</span> owe Jalzahn a debt fer that wine..."},{"name":"GEROLT","text":"Aye, I've a mind to help. Who knows, might be as there's another bottle or three o' fiery liquor in it fer me if I do."},{"name":"GEROLT","text":"I owe the old man fer that fiery liquor he gave me last time. So aye, ye can tell Jalzahn I've a mind to help."},{"name":"GEROLT","text":"Oi, Jalzahn! Fer all the time ye spent buryin' yer beak in moldy books, how is it yer always lost as fer what to do with the bleedin' relic?"},{"name":"GEROLT","text":"Ah well, never fear. I'm here to bail ye outta yer predicament. The way I see it, yer tryin' to better a weapon what can't be improved any more."},{"name":"GEROLT","text":"We've jus' made the thing into the bleedin' picture o' perfection. No amount o' spit an' polish will make it any finer."},{"name":"JALZAHN","text":"I suppose I know what you say to be true, but... I cannot help but feel there is something more still to be done to realize its potential."},{"name":"GEROLT","text":"I wish there were, seein' as restorin' that bloody relic is some o' the finest work I've ever done. But if ye mean to remake a legendary arm like what the Zodiac Braves wielded, well, ye can't do it with this. The weapons are jus' different, down to the very smithin'."},{"name":"JALZAHN","text":"But if this relic can never become... Has my work been for naught? I...I must return to my research, then. Mayhap I will find a clue on some forgotten page."},{"name":"GEROLT","text":"A clue, ye say? A clue what unlocks a forgotten way to forge steel? Seven hells, old man, that sounds bleedin' interestin'! Here, let me take a look at a book or two. Can't very well call meself the best smitty in the land if there's a technique 'neath the sun I don't know, can I?"},{"name":"JALZAHN","text":"Your skill is not in doubt, Gerolt. But precious few descriptions of the arms of legend's appearances remain, and accounts of their fashioning are fewer still. Even this, my most comprehensive tome, holds but snippets. It would take a genius to understand it."},{"name":"GEROLT","text":"Can't ye remember who yer talkin' to, old man? If the greatest weaponsmith in all the realm can't figure it out, no one can! Let's give it a read."},{"name":"GEROLT","text":"Well, blow me down... This is some bleedin' brilliant smithin' what's written here. Me finest kettle work pales in comparison. Gods, I've a mind to try me hand at this!"},{"name":"JALZAHN","text":"B-But... Well, you are welcome to the techniques, but what of the materials? I daresay you cannot find the catalysts the ancients used for soul infusion in this age. Simply put, we cannot just <span class=\"emphasis\">recreate</span> a legendary arm."},{"name":"GEROLT","text":"Might be as ye've a point there. Given the right stuff an' a picture, I could fashion a fair likeness of a Zodiac Brave's arm, but I'm well buggered as to how ye might infuse it with soul. I doubt Thavnairian mist could do the job."},{"name":"GEROLT","text":"Hmmm... The relic's infused with soul, then fortified with atma, an' spiced with materia made light... Seven hells, I've got it!"},{"name":"JALZAHN","text":"Wh-What!?"},{"name":"GEROLT","text":"Break out yer strongest liquor, old man! There <span class=\"emphasis\">is</span> a way to recreate an arm o' legend. See, the relic's got the right bleedin' soul energy. We jus' need to get <span class=\"emphasis\">that</span> to ascend to a legendary host!"},{"name":"JALZAHN","text":"Ascend the soul into a new host? My friend, should you but prove yourself here, I will sing your praises not only as the greatest weaponsmith of the realm, but the greatest of our era!"},{"name":"GEROLT","text":"Oh, I'll have ye singin' like a canary by the time I'm through! But let's not forget about Gerolt's payment─a bottle or three o' fiery liquor, eh?"},{"name":"GEROLT","text":"Good. Now first, we've to assemble a few raw materials. Jus' 'cause I've an inkling of how to forge an arm o' legend don't mean I know what it's supposed to look like. I'll need a tome what'll tell me about the original's appearance."},{"name":"GEROLT","text":"Seein' as ye've bartered fer books by yerself in the past, I'll leave the findin' o' the bleedin' thing to ye. I've no mind to get pecked by the harpies 'round Revenant's Toll."},{"name":"GEROLT","text":"Next, we'll need somethin' to forge the host. Yer about as like to find what they used eras ago as I am to find sobriety, so we'll jus' have to use the next best thing─whatever that is."},{"name":"GEROLT","text":"Aye, what we're lookin' fer is the most versatile o' materials what can be formed into anythin'. I've a feelin' somethin' like that can't be bought fer all the gil in Eorzea, so ye'll want to talk to a bloke what's wise in the ways o' craftin' an' gatherin'."},{"name":"GEROLT","text":"Now, <span class=\"emphasis\">if</span> ye can lay hands on that fer the new host, then we've to deal with infusin' it with soul energy. That means some mighty special form o' materia."},{"name":"GEROLT","text":"Might be as I've an idea o' where we'll get our materia, so don't worry about that fer now. 'Course, I'm not certain how we'll infuse it with the host, seein' as this new materia's a hundred times more powerful than ordinary gobs o' the stuff."},{"name":"JALZAHN","text":"Could we not channel the energy of this highly potent materia into another sphere scroll? It is a method that has served us well in the past."},{"name":"JALZAHN","text":"...Unless, of course, the materia is so powerful it would incinerate a standard sphere scroll. Is it even possible to contain such energy?"},{"name":"JALZAHN","text":"I know little of sphere scrolls beyond that which you have shared with me. However, Master Mutamix and his disciples at the Bonfire may have the answer."},{"name":"JALZAHN","text":"Ah, and we will need a catalyst for the materia's transformation to light. I suspect, however, that no ordinary alexandrite will suffice this time."},{"name":"JALZAHN","text":"You would do best to seek a strange fellow styling himself a treasure hunter. I have heard he found an exotic stone, and I am certain the man─and those close to him─cannot be difficult to find."},{"name":"GEROLT","text":"Yer to come straight back here when ye've gathered all the bits an' bobs together. As much as I thought I'd had enough o' ye, I know I can stand a little more. If it means seein' a real arm o' legend come together, an' the soul in yer relic ascend."}],"reward":{"gil":517,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[65742]},"next":[65893,65894,65895,65896]},"partials":[{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"quest","id":"65742","obj":{"i":65742,"n":"Mmmmmm, Soulglazed Relics","g":73,"l":"North Shroud","s":5,"f":1}},{"type":"quest","id":"65893","obj":{"i":65893,"n":"A Ponze of Flesh","g":73,"l":"Mor Dhona","s":7,"r":1,"f":1}},{"type":"quest","id":"65894","obj":{"i":65894,"n":"Labor of Love","g":73,"l":"Mor Dhona","s":8,"r":1,"f":1}},{"type":"quest","id":"65895","obj":{"i":65895,"n":"Method in His Malice","g":73,"l":"Central Thanalan","s":9,"r":1,"f":1}},{"type":"quest","id":"65896","obj":{"i":65896,"n":"A Treasured Mother","g":73,"l":"Mor Dhona","s":10,"r":1,"f":1}}]}