{"quest":{"name":"His Dark Materia","location":"North Shroud","id":65897,"patch":2.45,"sort":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1003075,"target":1003075,"involved":[1001425,1008948],"genre":73,"journal":["You sense that Gerolt is excited to see you back in Hyrstmill.","Now that you have gathered the necessary pieces, Gerolt reveals the identity of his secret materia: your relic weapon nexus. Indeed, he reasons, if all the combined energies bound to the weapon could be made into materia, the very souls you have worked so hard to cultivate can ascend to the new host. But whether such an outrageous thing is even possible remains to be seen. To find out, Gerolt bids you seek the counsel of Master Mutamix at the Bonfire.","Mutamix readily agrees to lend his aid to your cause. Inform Gerolt that the materia master is ready and willing.","Delighted that Master Mutamix has promised to help, Gerolt now says everything is in place. Speak with Jalzahn when you are ready to recreate your Zodiac Weapon."],"objectives":["Speak with Mutamix Bubblypots at the Bonfire.","Speak with Gerolt."],"dialogue":[{"name":"GEROLT","text":"So ye've found all four bits an' pieces, eh? How do I know? Hah, it's written all over yer smug face."},{"name":"JALZAHN","text":"Does Gerolt speak true, my friend? You have acquired <span class=\"emphasis\">all</span> the items? Huzzah! Come, <span class=\"alternative-container\"><span class=\"alternative\">my friends</span><span class=\"alternative\">gentlemen</span></span>, let us recreate an arm of yore!"},{"name":"GEROLT","text":"We ain't there jus' yet, Jalzahn. Aye, I can forge a host with the raw materials what <span class=\"highlight\">Forename</span> brought quick as ye please. But all we'll have then is a fancy weapon without the essence of a legendary arm."},{"name":"GEROLT","text":"We've still got to join it with special materia. By my reckonin', it's the only way to infuse our new host with the power o' souls."},{"name":"JALZAHN","text":"How do you propose we fashion this materia? Should <span class=\"highlight\">Forename</span> gather ten pieces of each form of atma? No, mayhap...twenty? Fifty? Surely materia composed of fifty pieces would be sufficient."},{"name":"GEROLT","text":"What the hells're ye on about, old man? The answer's right in front o' yer eyes: the bleedin' relic itself!"},{"name":"GEROLT","text":"Aye, you an' <span class=\"highlight\">Forename</span> have done a fine job o' fillin' the thing up with soul energy as the ancients did. Jus' turn all that to materia, an' meld it with our new host─make the souls ascend into an arm o' legend!"},{"name":"GEROLT","text":"'Tis an awful amount of energy to deal with, though. Yer average old craftsman would make a right mess o' me finest smithin', an' disperse the souls to boot. What we need is a real master o' materia─if ye catch me drift."},{"name":"JALZAHN","text":"Master Mutamix─but of course! Who else but he could create such potent materia?"},{"name":"JALZAHN","text":"Come, <span class=\"highlight\">Forename</span>, you must go to the Bonfire and ask his aid at once! Surely he will not refuse the challenge."},{"name":"JALZAHN","text":"I have never been so close to achieving my dreams... But long experience among failed experiments, however, teaches caution in such matters."},{"name":"GEROLT","text":"I thought ye were off speakin' with Mutamix at the Bonfire about the arm o' legend?"},{"name":"SYSTEM","text":"In order to receive the quest “His Dark Materia,” you must be equipped with a relic weapon nexus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"SYSTEM","text":"In order to advance the quest “His Dark Materia,” you must be equipped with a relic weapon nexus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"MUTAMIX","text":"Pshhh... Shkohhh...<br>Hubairtin and Adkin trade many tongueflaps about sphere scrolls. But today, uplander seeks materia-knowings of Mutamix?"},{"name":"MUTAMIX","text":"...Uplander wants to make legendary fighty-tool into materia? Interesting. Fighty-tool full of airyself become amazing materia... And with the knowings in Mutamix's braincase, it possible!"},{"name":"MUTAMIX","text":"But Mutamix has shivershakes. It is very big chance-game! Even with the knowings of Mutamix, cannot give wordbond of success. Braincase filled with doubtful buzzing muchly!"},{"name":"MUTAMIX","text":"May go very, very unrightly! If Mutamix is failing, legendary fighty-tool will turn to bittybits! Airyself go bye-bye, too!"},{"name":"MUTAMIX","text":"But will give hand-lending if uplander is unweak of bladder. Give hail-call, and Mutamix make trip to your stayplace."},{"name":"MUTAMIX","text":"When uplander makes up braincase, give hail-call. Mutamix will make trip to your stayplace."},{"name":"GEROLT","text":"An' what did Mutamix have to say? ...Hah! I knew he couldn't say no to a challenge like this!"},{"name":"GEROLT","text":"An' that...that means that everything's set fer the great show! I've got me forge fired up, so all that's left is to tell Jalzahn yer ready an' willin'."},{"name":"GEROLT","text":"Well, me adventurin' friend, what say we recreate us a legendary arm? Ahahaha!"}],"reward":{"gil":799,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]},"next":[66096]},"partials":[{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"npc","id":"1001425","obj":{"i":1001425,"n":"Mutamix Bubblypots","l":43,"q":5}},{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"quest","id":"66096","obj":{"i":66096,"n":"Rise and Shine","g":73,"l":"North Shroud","s":12,"f":1}}]}