{"quest":{"name":"Aether on Demand","location":"The Rising Stones","id":65903,"patch":2.5,"sort":81,"icon":100367,"eventIcon":71201,"target":1006646,"involved":[1008969,1010859,1010860,1010861,1010862,1010863,1010864,1010865,1010866,1010882,1010883,1010884,1010885,1010886,1010887,1010888,1010889,1010890,1011125,1011126,1011787],"genre":0,"journal":["Alphinaud has a message from Moenbryda for the Scions.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Rising Stones.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have located the Roegadyn scholar and informed her that her requested meeting may now take place. Make your way to the solar and speak with Moenbryda once more.","Moenbryda reveals that she has formulated a means of producing the staggering amount of aether required to destroy a captured Ascian soul─namely, by siphoning energy from the corrupted crystals found across Eorzea. It is at this point in her presentation that Alphinaud arrives and suggests that she conduct her experiments in northern Thanalan, where such crystal formations are bountiful yet not too closely grouped. He soon adds, however, that the imperial forces in the area are seeking to ransack the resources of the Ceruleum Processing Plant. With a knowing smile, Alphinaud laments that Moenbryda's experiments will be nigh impossible to perform without the Scions first cooperating with the Crystal Braves to defeat the Garlean threat. Speak with Alphinaud at the Rising Stones to learn more about your role in defending the processing plant from the advancing imperial soldiers.","Alphinaud has bid you rendezvous with the 4th in northern Thanalan while he moves to take command of the Crystal Braves stationed in Ul'dah. As you make to depart, you encounter Hoary Boulder and Coultenet, who have been charged with escorting F'lhaminn during her efforts to recruit her influential Ul'dahn acquaintances to the Scions' cause. It seems that the call of duty shall once more empty the Rising Stones of Eorzea's stalwart defenders. Travel to the Ceruleum Processing Plant and report to Wilred.","After reporting to Wilred, the eager Crystal Braves member takes you to Lieutenant Edelstein for a briefing on the current situation. Edelstein appears elated at your presence, but his mood quickly turns sour as he relates to you the news of how several imperial explosive devices have been discovered within the perimeter of the plant. Join the soldiers and the newly arrived Scions in the search for any suspicious boxes that could prove a danger to the garrison.","You have scoured the entire compound and uncovered what you believe to be four more imperial explosive devices. Return to Lieutenant Edelstein and deliver the suspicious containers.","Lieutenant Edelstein gingerly receives the crates from your steady hands, and puts them aside for his sappers to disable. Though one threat has been effectively neutralized, the garrison commander informs you that returning scouts have reported movement amongst the nearby Garlean forces..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Rising Stones.</span>"],"dialogue":[{"name":"ALPHINAUD","text":"Ere I forget, I believe Moenbryda has requested a gathering of the Scions. I assume there has been some progress concerning our efforts to combat the Ascians."},{"name":"ALPHINAUD","text":"Pray inform her that our business with the Ishgardians is concluded for the moment─I shall be along once I've completed my communications with the Crystal Braves."},{"name":"ALPHINAUD","text":"Would you be so kind as to inform Moenbryda that our Ishgardian visitor has departed? I must speak with the Crystal Braves, then I shall join you all forthwith."},{"name":"MOENBRYDA","text":"All done with your talk of dragons? Wonderful, because Ascians are next on the menu! Let's head into the solar, shall we?"},{"name":"YDA","text":"I'm telling you, Thancred: keep pestering Moenbryda and the only thing you'll become intimate with is her axe..."},{"name":"PAPALYMO","text":"There have been no reports of suspicious masked men in Gridania, that is certain. Mayhaps they weave their dark plots in other lands?"},{"name":"THANCRED","text":"Such statuesque beauty─and possessed of a mind for research to match her belly for hard liquor! What does a woman of so many charms see in musty old Urianger...?"},{"name":"YSHTOLA","text":"I keep my senses strained for signs of Ascian activity, but there is little news to be had."},{"name":"YSHTOLA","text":"Have their schemes reached some critical step? This silence is most disturbing..."},{"name":"MINFILIA","text":"I've summoned everyone to the solar. 'Twould seem Moenbryda has something exciting to share with us."},{"name":"MINFILIA","text":"Of all our adversaries, the Ascians could well be considered the most dangerous. I do hope Moenbryda's research has borne fruit..."},{"name":"TATARU","text":"For a small organization, we certainly chew through a prodigious amount of foodstuffs. Perhaps I should put a lock on the larder door..."},{"name":"HIGIRI","text":"We do seem to be running low on provisions. I believe an excursion to the marketplace is in order."},{"name":"FLHAMINN","text":"I see that the Scions once more ready themselves for the road. I, too, must make preparations for an absence from the Rising Stones..."},{"name":"HOARYBOULDER","text":"It seems you have barely arrived before you must once more plunge into the fray. Duty is an unforgiving mistress, eh? Though the tasks we tackle are not like to be as realm-shaking, Coultenet and I must also heed her call."},{"name":"COULTENET","text":"Hoary was most eager to join you on the front lines of battle, but, as fate would have it, the Antecedent had other plans for our talents."},{"name":"MINFILIA","text":"Though I have little doubt you will prevail against the Empire's forces, I shall pray for your success nonetheless. Our very future may depend upon Moenbryda being free to pursue her experiments."},{"name":"ALPHINAUD","text":"'Twould seem that events have once more conspired to rob us of rest and recuperation. Though I would wish it otherwise, I must ask that you head straightaway to the processing plant."},{"name":"ALPHINAUD","text":"The 4th have already deployed to the area, and await the arrival of the Scions. Wilred will brief you on the developing situation."},{"name":"ALPHINAUD","text":"Meanwhile, I must rendezvous with Captain Ilberd at our headquarters in Ul'dah. I shall take command of our forces there with a lighter heart, knowing that you go to support the front lines."},{"name":"HOARYBOULDER","text":"Your duties take you to northern Thanalan, do they not?"},{"name":"COULTENET","text":"We, too, must say our farewells to the Rising Stones for a time. F'lhaminn travels to Ul'dah, and we shall serve as her escort."},{"name":"FLHAMINN","text":"At my daughter's behest, I go to contact certain old acquaintances in the gilded city."},{"name":"FLHAMINN","text":"We are beset on all sides by civil unrest and imperial machinations, threatened by primals and troubled by dragons─we need all the allies we can muster."},{"name":"FLHAMINN","text":"Many of my friends hold positions of power, you see, and it is my hope that they can be convinced to aid the Scions' cause."},{"name":"FLHAMINN","text":"If past events have taught us anything, then we know that Eorzea <span class=\"emphasis\">must</span> present a united front or we shall fall..."},{"name":"FLHAMINN","text":"Ah, how extraordinary that my little Ascilia is involved in such far-reaching affairs."},{"name":"FLHAMINN","text":"I am proud that I might now stand at her side not only as a mother, but also as a colleague."},{"name":"COULTENET","text":"A colleague with influential connections! But I fear that Ul'dah has become a place of danger even for one so familiar with her streets."},{"name":"HOARYBOULDER","text":"Bah! Woe betide the blackguard that so much as glares in your direction, milady!"},{"name":"FLHAMINN","text":"Ahaha, I shall be well protected, it seems."},{"name":"COULTENET","text":"Shall we be on our way, then?"},{"name":"ALIANNE","text":"'Tis unsettling to think that an enemy base lies but a brief stroll beyond these walls..."},{"name":"WILRED","text":"Commander Leveilleur sent word that you'd be coming─a veteran of your talents is most welcome."},{"name":"WILRED","text":"Not that I don't think we can handle the situation, mind you! I've learned a trick or two since that disaster with the Amalj'aa."},{"name":"WILRED","text":"But returning to the task at hand..."},{"name":"WILRED","text":"The Flames' reconnaissance scouts have reported imperial soldiers assembling at Raubahn's Push. Such a force is likely interested in only one thing: getting their hands on the resources found here at the processing plant."},{"name":"WILRED","text":"The Garleans could begin marching on us at any time, and I think it's time we speak with Lieutenant Edelstein to finalize our counter strategy."},{"name":"EDELSTEIN","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! My soldiers yet tell tales of your deeds during Operation Archon!"},{"name":"EDELSTEIN","text":"Would that we could sit a while and reminisce about old times..."},{"name":"WILRED","text":"Are the Garleans on the move, then?"},{"name":"EDELSTEIN","text":"Not as such. The civilian draughtsmen have, however, come across several highly suspicious crates within the boundaries of the processing plant."},{"name":"EDELSTEIN","text":"I had my sappers take a closer look, and our worst fears were confirmed─these boxes contain powerful explosive devices. Devices of imperial design, no less."},{"name":"WILRED","text":"Found <span class=\"emphasis\">inside</span> the plant, you say!? But...how!? We've had guards stationed around the perimeter day and night!"},{"name":"THANCRED","text":"'Tis likely the plant was infiltrated long before the Braves arrived."},{"name":"WILRED","text":"Master Thancred! Have the Scions come in force, then?"},{"name":"PAPALYMO","text":"All who could be spared, yes. Now, there are likely more of these imperial explosives about the place, so I suggest we spread out and conduct a thorough sweep of the compound."},{"name":"PAPALYMO","text":"Considering the volatile nature of ceruleum, allowing even one such device to escape our search may lead to us enjoying an uncomfortably close view of a rather spectacular explosion."},{"name":"WILRED","text":"&lt;gulp&gt; R-Right, then. I'll pass the word on to the 4th.<br>...Uh, what exactly should we do with these crates should we find them?"},{"name":"EDELSTEIN","text":"Bring them here to me. <span class=\"emphasis\">Carefully</span>, mind you. My sappers will render the devices harmless, as they did with the first batch we found."},{"name":"THANCRED","text":"Very well. Let's get started, shall we?"},{"name":"WILRED","text":"J-Just another day for the Braves! Guarding the front lines. Keeping an eye on the Garleans. Tracking down potentially lethal explosive devices..."},{"name":"ALIANNE","text":"How goes the search? I've not had much luck myself..."},{"name":"PAPALYMO","text":"I wonder if these devices could be effectively disabled through the focused application of ice-aspected magicks..."},{"name":"THANCRED","text":"I've found only one suspicious container thus far...and it contained naught but the remains of some hurried worker's midday repast."},{"name":"YDA","text":"I'm having a contest with Papalymo to see who can find the most explosives! Hmmm. I may have forgotten to mention it to him before I started looking..."},{"name":"YSHTOLA","text":"Thancred told me of the explosives. Let us secure the plant, and swiftly, that we might proceed with our original agenda."},{"name":"MOENBRYDA","text":"I've done some exploring, and located the perfect place where I might conduct my experiment. A pity, then, that we must deal with all this Garlean nonsense before I can begin testing my theories."},{"name":"EDELSTEIN","text":"I would ask that you bring any suspicious containers here to me─my sappers will safely disable these little surprise gifts from the Empire."},{"name":"EDELSTEIN","text":"Should you discover any containers that appear out of place, then hand them over to me. My sappers will determine whether or not these objects are explosives─and then disarm them should they prove to be so."},{"name":"EDELSTEIN","text":"There were four more of those blasted things!? I'll have our engineers disassemble them at once. Fine work, as always, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>."},{"name":"EDELSTEIN","text":"The entire compound has now been scoured from top to bottom, so I should hope that's the last we've seen of these explosives."},{"name":"EDELSTEIN","text":"Our troubles with Castrum Meridianum, however, are far from over. Scouts have returned with news of movement on the front..."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65902]}},"partials":[{"type":"npc","id":"1006646","obj":{"i":1006646,"n":"Edelstein","l":46,"q":8,"t":"Flame Lieutenant"}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010859","obj":{"i":1010859,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1010860","obj":{"i":1010860,"n":"Moenbryda","l":481,"q":1}},{"type":"npc","id":"1010861","obj":{"i":1010861,"n":"Wilred","l":46,"q":1}},{"type":"npc","id":"1010862","obj":{"i":1010862,"n":"Thancred","l":46,"q":1}},{"type":"npc","id":"1010863","obj":{"i":1010863,"n":"Papalymo","l":46,"q":1}},{"type":"npc","id":"1010864","obj":{"i":1010864,"n":"Yda","l":46,"q":1}},{"type":"npc","id":"1010865","obj":{"i":1010865,"n":"Y'shtola","l":46,"q":1}},{"type":"npc","id":"1010866","obj":{"i":1010866,"n":"Moenbryda","l":46,"q":1}},{"type":"npc","id":"1010882","obj":{"i":1010882,"n":"F'lhaminn","l":481,"q":1}},{"type":"npc","id":"1010883","obj":{"i":1010883,"n":"Higiri","l":481,"q":1}},{"type":"npc","id":"1010884","obj":{"i":1010884,"n":"Hoary Boulder","l":481,"q":1}},{"type":"npc","id":"1010885","obj":{"i":1010885,"n":"Coultenet","l":481,"q":1}},{"type":"npc","id":"1010886","obj":{"i":1010886,"n":"Thancred","l":481,"q":1}},{"type":"npc","id":"1010887","obj":{"i":1010887,"n":"Yda","l":481,"q":1}},{"type":"npc","id":"1010888","obj":{"i":1010888,"n":"Papalymo","l":481,"q":1}},{"type":"npc","id":"1010889","obj":{"i":1010889,"n":"Y'shtola","l":481,"q":1}},{"type":"npc","id":"1010890","obj":{"i":1010890,"n":"Moenbryda","l":481,"q":1}},{"type":"npc","id":"1011125","obj":{"i":1011125,"n":"Alianne","l":46,"q":1}},{"type":"npc","id":"1011126","obj":{"i":1011126,"n":"Wilred","l":46,"q":1}},{"type":"npc","id":"1011787","obj":{"i":1011787,"n":"Alianne","l":46,"q":1}},{"type":"quest","id":"65902","obj":{"i":65902,"n":"The Rising Chorus","g":2,"l":"The Rising Stones","s":80}}]}