{"quest":{"name":"The Wyrm's Roar","location":"Coerthas Central Highlands","id":65908,"patch":2.55,"sort":87,"eventIcon":71201,"issuer":1010951,"target":1010953,"involved":[1006384,1007603,1009974,1009977],"genre":2,"journal":["Alphinaud seems eager to return to Camp Dragonhead.","Eager to begin his meeting with Ser Aymeric, Alphinaud puts the Gates of Judgement behind him. Return to Camp Dragonhead and ask Lord Haurchefant where the audience is to be held.","After welcoming you with his customary warmth, Lord Haurchefant informs you that Ser Aymeric awaits within the nearby intercessory. Speak with the House Fortemps guard to gain entry to the audience chamber, and announce your arrival to the lord commander.","Shortly after greeting Ser Aymeric in the intercessory, you are joined by Estinien, the Azure Dragoon. Owing to his prolonged contact with the Eye, Estinien is able to hear Nidhogg's “voice,” and confirms that the roar that recently shook the heavens was the vengeful wyrm's call to battle. It would appear that Iceheart, if not directly in league with the creature, at least shares Nidhogg's desire to invade the city and lay claim to the Eye.<br><br>Swayed by Ser Aymeric's grim prediction of a desolate Coerthas providing a new staging point for the Empire, Alphinaud agrees to aid the beleaguered lord commander. Speak with the young Scion and hear his thoughts concerning the Ishgardians' request.","The Dravanians converge upon the city of Ishgard in their thousands, and there is no guarantee that her defenders will be able to repel them─even <span class=\"emphasis\">with</span> outside assistance. Nevertheless, Alphinaud seems grateful for this opportunity to bring the nations of Eorzea together as allies once more."],"objectives":["Speak with Haurchefant.","Speak with Aymeric in the intercessory.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"...Lady Iceheart has grown bold indeed if she would risk direct action against the city. Come, let us do as we were bid, and return to Camp Dragonhead."},{"name":"ALPHINAUD","text":"Lord Haurchefant will know where Ser Aymeric means to receive us."},{"name":"ALPHINAUD","text":"Pray ask Lord Haurchefant to direct us to the meeting place when you are ready."},{"name":"HAURCHEFANT","text":"'Tis reassuring indeed to behold the countenance of a friend when one's homeland teeters upon the very brink of disaster!"},{"name":"HAURCHEFANT","text":"Though a single misstep could send us plunging into the abyss, your heroic presence stokes the flames of courage within my heart!"},{"name":"HAURCHEFANT","text":"Ah, but you did not come to Dragonhead to listen to my prattling! The lord commander has arrived, and would treat with you in the intercessory."},{"name":"HAURCHEFANT","text":"Ser Aymeric is now arrived in Camp Dragonhead. Pray make your way to the intercessory!"},{"name":"ALPHINAUD","text":"Ishgard's future hangs in the balance. If the city's salvation rests on our assistance, I cannot well withhold it. Even so, I mean to make Ser Aymeric sweat for his reinforcements. On this occasion, feigned disinterest may serve the cause of Eorzean unity better than naked philanthropy.<br>Come! Let us find out what concessions the Holy See is willing to make..."},{"name":"FORTEMPSGUARD00054","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Shall I show you inside?"},{"name":"FORTEMPSGUARD00054","text":"Proceed to the intercessory?"},{"name":"FORTEMPSGUARD00054","text":"Yes"},{"name":"FORTEMPSGUARD00054","text":"No"},{"name":"AYMERIC","text":"I thank you for coming with such haste...and apologize for my absence. Suffice it to say, Lady Iceheart and her heretics have much to answer for..."},{"name":"ALPHINAUD","text":"Yes...we are but recently returned from the Gates of Judgement ourselves. Given the circumstances, we quite understand if you would prefer to postpone our appointed audience."},{"name":"AYMERIC","text":"On the contrary, Master Alphinaud─I think it more important than ever that this meeting take place. Rest assured, I shall return to my post on Ishgard's walls the moment our business is concluded."},{"name":"AYMERIC","text":"Before we move on to the subject of reinforcements, however, I would introduce you to a close friend and stalwart ally. Estinien!"},{"name":"AYMERIC","text":"May I present to you Ishgard's Azure Dragoon."},{"name":"ALPHINAUD","text":"An impressive title...though I confess, I know precious little of the order of dragoons."},{"name":"AYMERIC","text":"They are formidable warriors all. Yet even among such masters of the lance, Estinien is without equal."},{"name":"AYMERIC","text":"He, out of all the warriors of Ishgard, was chosen to wield the power of dragons, and may thus contend with any Dravanian."},{"name":"ESTINIEN","text":"...You flatter me overmuch, Lord Commander."},{"name":"ESTINIEN","text":"If ever I was without equal, I am no longer─as my fellow Azure Dragoon here will attest. Be at ease, <span class=\"highlight\">Forename</span>─I did not come to challenge you this day."},{"name":"ESTINIEN","text":"Ah, it is you...<br>But of course...it is only fitting that fate should draw the two of us together."},{"name":"ESTINIEN","text":"So, you are the adventurer of whom they spoke...<br>I see now why my blood fair sang in anticipation of our meeting."},{"name":"AYMERIC","text":"...Well, now that we have all been introduced, let us proceed to the matter at hand. I would share with you what we have learned of Iceheart's design, as confessed by the heretics taken captive after the assault on the gates."},{"name":"AYMERIC","text":"'Twould seem that Lady Iceheart and the Dravanians share a common goal─the reclamation of Nidhogg's stolen eye."},{"name":"ALPHINAUD","text":"Nidhogg...<br>One of the seven great wyrms."},{"name":"ALPHINAUD","text":"His name features prominently in your nation's history. Though once defeated by the hero Haldrath, the beast is said to have terrorized Coerthas since Ishgard's founding."},{"name":"AYMERIC","text":"Aye, many are the scars our walls bear from Nidhogg's relentless efforts to raze the city."},{"name":"AYMERIC","text":"The trophy Haldrath plucked from the bested wyrm's skull─known simply as “the Eye”─is a treasured relic of Ishgard, and one possessed of untold power."},{"name":"AYMERIC","text":"Should it ever be returned to Nidhogg, the dread creature would be restored to the height of his strength. ...And then no wall or ward we could erect would be stout enough to deny him."},{"name":"MIDGARDSORMR","text":"(-Voice of Midgardsormr-)My vengeful son hath waged war against Ishgard for a thousand years. No mortal mind could comprehend the depths of his rancor."},{"name":"AYMERIC","text":"The Eye itself is secreted deep within the Vault. It is kept under heavy guard─surrounded at all times by men and women who have proven their loyalty to the Holy See."},{"name":"AYMERIC","text":"But though stout walls and sharp blades may suffice to discourage the heretics, the dragons are another matter. There are individuals within the Dravanian Horde whom an entire company of knights would labor to repel─to say nothing of Nidhogg himself."},{"name":"ESTINIEN","text":"Nor does age rob them of their strength. Through the endless march of years, the dragons endure. Patient. Calculating. Inexorable. You must understand: these creatures do not share our perception of time."},{"name":"ESTINIEN","text":"And that is especially true of the great wyrms─they who spend centuries in slumber only to wake and resume their campaign as if mere hours had passed."},{"name":"AYMERIC","text":"It has been twenty years since Nidhogg last darkened our skies. Twenty years for him to gather his strength, and for us to bolster our defenses... And now, just as he seems primed to return, the heretics strike at the gates..."},{"name":"ALPHINAUD","text":"...You believe that Lady Iceheart is in league with the creature, then?"},{"name":"AYMERIC","text":"Of that, we cannot be certain. Though we know the heretics covet the Eye, we have been unable to determine their plans for it."},{"name":"AYMERIC","text":"Such questions aside, we must needs address the ragged hole their mistress has seen fit to rend in Ishgard's protections. 'Tis a weakness the Dravanians are not like to leave untested."},{"name":"ALPHINAUD","text":"So it would seem... You have described your plight in admirable detail, Lord Commander. Yet I cannot help but wonder at your candor. Why share such sensitive information with us?"},{"name":"AYMERIC","text":"I shall speak plain. Ishgard has need of allies, and I would have you bolster our front lines in readiness for the coming battle against the dragons."},{"name":"ALPHINAUD","text":"This much I expected. Unlike our arrangement concerning the Keeper of the Lake, however, only you stand to benefit from our assistance in this matter. I fail to see why we should intervene in a conflict which concerns only Ishgard and Dravania."},{"name":"ALPHINAUD","text":"When the Eorzean Alliance requested Ishgard's assistance during Operation Archon, you refused us."},{"name":"ALPHINAUD","text":"Does it not seem grossly unjust to demand that we now risk our lives in your private war?"},{"name":"AYMERIC","text":"I make no attempt to defend my country's conduct. I only ask that you consider what would follow were Ishgard to fall."},{"name":"AYMERIC","text":"Having razed our city to the ground, the Horde would have little cause to linger, and most would return to their lairs in Dravania. Soon thereafter, the ruins of Coerthas would be buried in snow, and the land would become the sole province of beasts and beastmen."},{"name":"AYMERIC","text":"...Until the Garleans' arrival, that is─for you may be certain that the Empire would not hesitate to claim Coerthas. They would not even have to draw steel."},{"name":"ALPHINAUD","text":"An imperial province sharing a border with Mor Dhona...? Seven hells..."},{"name":"ALPHINAUD","text":"...Ahem. Very well─we will assist you in repelling the dragons. The roar of a great wyrm may have shaken the firmament, but we of Eorzea will not abandon our Ishgardian brothers to face the coming Horde alone."},{"name":"AYMERIC","text":"Nor did I ever think you would. Now, upon the matter of the roar─"},{"name":"ESTINIEN","text":"Allow me, Ser Aymeric."},{"name":"ESTINIEN","text":"Through the power of the Eye, I have become the vessel of Nidhogg's strength. His essence has stolen into my very blood."},{"name":"ESTINIEN","text":"Fear not─I am in full control of my faculties, I assure you. And the Eye itself is of no relevance to this tale─it is not essential that I bear it with me wheresoever I go."},{"name":"ESTINIEN","text":"Its lingering influence does, however, allow me to hear Nidhogg's voice..."},{"name":"ALPHINAUD","text":"Then the wyrm who roared...?"},{"name":"ESTINIEN","text":"...Was Nidhogg, aye. He means to hurl his Horde against Daniffen's Collar, and shatter the remaining wards that protect the city."},{"name":"ESTINIEN","text":"There can be no doubt─the wyrm has summoned his minions to war."},{"name":"ALPHINAUD","text":"Though the circumstances are far from ideal, this desperate endeavor will at least provide us an opportunity to bring the sister states of Eorzea together in common cause."},{"name":"ALPHINAUD","text":"...Ser Aymeric was more ruthless in his negotiations than I had anticipated. I suppose one must give no quarter when one's home is at stake."},{"name":"ALPHINAUD","text":"But did you see the look on his face when he formally requested our assistance? Though the lord commander has long campaigned for Ishgard to open its gates to outsiders, I suspect this softening of the Holy See's attitude towards foreign cooperation comes as something of a bittersweet victory."},{"name":"ALPHINAUD","text":"The days ahead promise to be interesting indeed..."}],"reward":{"gil":767,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65907]},"next":[65909]},"partials":[{"type":"npc","id":"1010951","obj":{"i":1010951,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1010953","obj":{"i":1010953,"n":"Alphinaud","l":1429,"q":2}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1007603","obj":{"i":1007603,"n":"House Fortemps Guard","l":63,"q":4,"t":"Gatekeep"}},{"type":"npc","id":"1009974","obj":{"i":1009974,"n":"Aymeric","l":1429,"q":1}},{"type":"npc","id":"1009977","obj":{"i":1009977,"n":"Alphinaud","l":63,"q":5}},{"type":"quest","id":"65907","obj":{"i":65907,"n":"Defenders for Ishgard","g":2,"l":"The Rising Stones","s":86}},{"type":"quest","id":"65909","obj":{"i":65909,"n":"Committed to the Cause","g":2,"l":"Intercessory","s":88}}]}