{"quest":{"name":"Defenders for Ishgard","location":"The Rising Stones","id":65907,"patch":2.55,"sort":86,"eventIcon":71201,"issuer":1010930,"target":1010951,"involved":[1006384,1006401,1010931,1010939,1010940,1010941,1010942],"genre":2,"journal":["Alphinaud awaits the arrival of the Ishgardian envoy.","The envoy from Ishgard turns out to be Lucia, Ser Aymeric's second-in-command. The knight brings grim tidings, and has come to seek the aid of the Crystal Braves and the Grand Companies in bolstering her city's defenses. She also bears a personal request from the lord commander, who wishes to speak with you. Travel to Camp Dragonhead in the Coerthas central highlands, and rendezvous with Alphinaud prior to meeting with Ser Aymeric.","You join Alphinaud in Camp Dragonhead, but it appears that Ser Aymeric has yet to arrive. As you wait together, the Crystal Braves' commander notes the unusually agitated mood in the camp─Dravanian invasion or no─and suggests that further investigation might be in order. Make your way to the Gates of Judgement, and question the unsettled knights.","You learn from the knights stationed at the Gates of Judgement that they were attacked by Lady Iceheart and her followers. Inform Alphinaud of this development.","Shortly after apprising Alphinaud of your discovery, you are accosted by Lucia, who confirms that which you have already learned: a heretic force has broken through the outer defenses and dispelled the first layer of arcane wards protecting the city of Ishgard. Now is not the time to debate the ramifications of this event, however, as Ser Aymeric is waiting for you back in Camp Dragonhead."],"objectives":["Speak with Alphinaud in Camp Dragonhead.","Question the knights at the Gates of Judgement.","Speak with Alphinaud at the Gates of Judgement."],"dialogue":[{"name":"ALPHINAUD","text":"...The envoy is here."},{"name":"LUCIA","text":"I thank you for receiving me at such short notice. Time is of the essence, so I would forgo the usual pleasantries, if I may."},{"name":"MINFILIA","text":"Certainly. You come with news of the Dravanians?"},{"name":"LUCIA","text":"Aye, the dragons have begun their attack in earnest. The first wave reached the central highlands a short while ago, and battle was joined soon thereafter."},{"name":"LUCIA","text":"Ser Aymeric himself sallied forth with a contingent of Temple Knights and several companies of the noble houses' finest. Though the beasts were ultimately forced into retreat, our victory─if such it may be called─came at the cost of many of our own. Too many."},{"name":"LUCIA","text":"We will not withstand a second wave should the Dravanians renew their assault."},{"name":"ALPHINAUD","text":"You paint a grim picture, my lady. It is reinforcements you seek, then?"},{"name":"LUCIA","text":"We do. Though it pricks our pride, it is plain we cannot protect Ishgard with our ranks thus thinned by the Horde. Ser Aymeric would meet with you to discuss the possibility of enlisting your aid."},{"name":"ALPHINAUD","text":"Very well. I shall depart for Coerthas at once."},{"name":"ALPHINAUD","text":"I must warn you, however, that the involvement of the Crystal Braves is by no means assured─our commitment to quelling the unrest in Ul'dah must take precedence."},{"name":"LUCIA","text":"It is with such contingencies in mind that I must make another request. The Scions of the Seventh Dawn are known for sharing close ties with all three of the Grand Companies of Eorzea. Would you consent to plead our case to their leaders?"},{"name":"MINFILIA","text":"Hm. Though I will gladly appeal to the Grand Companies on your behalf, I dare not promise a favorable reply..."},{"name":"LUCIA","text":"You need say no more. Considering our past dealings with the Eorzean Alliance, I can well imagine how our plea will be received."},{"name":"LUCIA","text":"But the fate of Ishgard hangs in the balance. We must explore every avenue still open to us─no matter how unpromising."},{"name":"MINFILIA","text":"I see. Very well. I shall send envoys to each of the allied nations, and have them present your request directly to the heads of the Grand Companies."},{"name":"MINFILIA","text":"In the event that your plea does receive a favorable answer, know that any support is certain to be conditional. Demands will be made of Ishgard..."},{"name":"LUCIA","text":"That is only to be expected. Rest assured that I speak with Ser Aymeric's authority in this matter, and that our actions are fully sanctioned by the Holy See."},{"name":"LUCIA","text":"...Which brings me to my final request: a personal appeal to you, Warrior of Light. The lord commander much desires to speak with you, regardless of your fellows' involvement."},{"name":"LUCIA","text":"You faced Midgardsormr and survived. Anything you can share of your experience may yield us an advantage over our foe."},{"name":"LUCIA","text":"Thank you. You wear the mantle of hero well."},{"name":"ALPHINAUD","text":"'Twould seem the road leads us both to Camp Dragonhead. Seek me out when you arrive, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"It seems I was the swifter, <span class=\"highlight\">Forename</span>. You too, however, have arrived with time to spare, for our host has yet to make an appearance."},{"name":"ALPHINAUD","text":"The murmurings about camp tell of some manner of trouble at the Gates of Judgement...<br>In the lord commander's absence, I suggest we visit the place, and find out what is afoot."},{"name":"HAURCHEFANT","text":"My dear friend, <span class=\"highlight\">Forename</span>! Once more you arrive in our hour of need! Would that we could speak longer, but I'm afraid my duties demand my full attention..."},{"name":"YAELLE","text":"We knights of House Fortemps train nigh without cease for moments such as this. Yet now that one is here, my knees threaten to buckle beneath me..."},{"name":"TEMPLERA00371","text":"W-We need not fret overmuch─there are yet several layers of arcane protection that shield the city from invasion. Mother will be fine..."},{"name":"TEMPLERB00371","text":"When I laid eyes upon Lady Iceheart...I felt the marrow freeze within my bones."},{"name":"CAVALRYMANA00371","text":"The Gates of Judgement are much more than mere doors─they are the outermost layer of Ishgard's magical wards. If our first line of defense can be so easily shattered..."},{"name":"CAVALRYMANB00371","text":"Heretic scum! How <span class=\"emphasis\">dare</span> they meddle with our divine protections! I shall rid our nation of their blasphemy even if it means cutting them down one by one!"},{"name":"ALPHINAUD","text":"Mark the nervous glances our friends share...<br>The dragons have attacked, yes, but something else has occurred...something unexpected. Let us question the knights here ere we proceed."},{"name":"ALPHINAUD","text":"'Twould seem the heretics struck the first─and most telling─blow against Ishgard..."},{"name":"LUCIA","text":"Scions! We expected you at Camp Dragonhead!"},{"name":"ALPHINAUD","text":"My apologies. We chanced to hear that there had been trouble at the gates, and thought it prudent to investigate the cause."},{"name":"LUCIA","text":"Then you have learned of the heretics' treachery. Lady Iceheart led a force of her followers against our defenders, and came close enough to dispel the first of our wards."},{"name":"LUCIA","text":"But let us speak more of this back at the camp. Ser Aymeric awaits you..."}],"reward":{"gil":617,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65906]},"next":[65908]},"partials":[{"type":"npc","id":"1010930","obj":{"i":1010930,"n":"Alphinaud","l":481,"q":2}},{"type":"npc","id":"1010951","obj":{"i":1010951,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006401","obj":{"i":1006401,"n":"Yaelle","l":63,"q":4}},{"type":"npc","id":"1010931","obj":{"i":1010931,"n":"Alphinaud","l":63,"q":1}},{"type":"npc","id":"1010939","obj":{"i":1010939,"n":"Trembling Temple Knight","l":63,"q":1}},{"type":"npc","id":"1010940","obj":{"i":1010940,"n":"Tenterhooked Temple Knight","l":63,"q":1}},{"type":"npc","id":"1010941","obj":{"i":1010941,"n":"Dyspeptic Dragoon","l":63,"q":1}},{"type":"npc","id":"1010942","obj":{"i":1010942,"n":"Bothered Bowman","l":63,"q":1}},{"type":"quest","id":"65906","obj":{"i":65906,"n":"Mask of Grief","g":2,"l":"The Rising Stones","s":85}},{"type":"quest","id":"65908","obj":{"i":65908,"n":"The Wyrm's Roar","g":2,"l":"Coerthas Central Highlands","s":87}}]}