{"quest":{"name":"An Uninvited Ascian","location":"Northern Thanalan","id":65905,"patch":2.5,"sort":83,"icon":100368,"eventIcon":71201,"issuer":1006646,"target":1011000,"involved":[1006950,1008278,1010870,1010879,1010880,1010898,1010899,1010900,1010901],"genre":2,"journal":["Lieutenant Edelstein appears concerned for Moenbryda's well-being.","With the battle against Castrum Meridianum's soldiers concluded, Moenbryda is now free to conduct her experiments in the field. Find the scholar at Dalamud's Talons, and see how her research progresses.","After witnessing Moenbryda perform a successful trial upon a corrupted crystal formation, you are visited by an Ascian who introduces himself as Nabriales. The Paragon soon senses that you have lost Hydaelyn's blessing and teleports away, seemingly intent on taking advantage of the Scions' vulnerability. Moenbryda realizes that the staff Nabriales spoke of is likely Tupsimati, the relic once wielded by Louisoix himself. Hurry back to the Rising Stones and protect Minfilia from the Ascian's intrusion.","You return to the Rising Stones to find Nabriales already in the solar with Minfilia, the Antecedent clutching the shards of the broken Tupsimati. With dismissive contempt, the Ascian reveals his plans to use the power yet hidden within the staff to bring about a new Rejoining. He then tears open a dimensional rift, through which he escapes with both Minfilia and the relic she holds. Follow Nabriales into the rift, and put a stop to his nefarious plans.<br><br>※The Chrysalis can be accessed via the Duty Finder.","You have defeated Nabriales and rescued Minfilia. Return to the Rising Stones.","Upon your return to the Rising Stones, you are once more visited by Nabriales, who taunts you with his immortality. Before he can flee into the void, however, Minfilia succeeds in trapping the soul of the weakened Ascian within the chunk of white auracite. But try though you might, without Hydaelyn's blessing, you are unable to summon enough aether to truly destroy him. As she witnesses Light struggle to triumph over Dark, Moenbryda finally comes to understand her mentor Louisoix's dedication to his duty. The wounded scholar then expends her own life energy in a brilliant burst of aether, allowing your glowing blade to at last pierce Nabriales's essence.<br><br>A step too late, the rest of the Scions enter the solar to be greeted by the tragic news of Moenbryda's sacrifice. Somewhat comforted by the knowledge that his dear friend was, at the last, liberated from doubt and confusion, Urianger departs to grieve at the Waking Sands. Speak with the Antecedent to discuss the aftermath of the battle.","Though assailed by her own grief, Minfilia yet worries more for Urianger and the loss he must be feeling. The Antecedent then voices her intention to hold a memorial service for the Scions' fallen friend, and honor all that Moenbryda has accomplished."],"objectives":["Speak with Moenbryda.","Return to the Rising Stones.","Confront Nabriales in the Chrysalis.","Speak with Minfilia."],"dialogue":[{"name":"EDELSTEIN","text":"You must be anxious for word of your fellows. Lieutenant Alianne has reported a sound victory over the main column, and informs me that the Scions have already turned their attention to other duties."},{"name":"EDELSTEIN","text":"All but one, that is. The Roegadyn lady with the large axe? 'Twould appear she has chosen to remain at the site of the battle."},{"name":"EDELSTEIN","text":"I know not what task keeps her from returning to civilization, but northern Thanalan is no place to wander alone─even for a capable sort such as her. I would certainly feel better about things if you could check in on her before you continue on your way."},{"name":"EDELSTEIN","text":"I believe the lady's name was “Moenbryda,” yes? She was last seen inspecting an outcrop of corrupted crystals at Dalamud's Talons to the east."},{"name":"MOENBRYDA","text":"If I'm right, and the Ascian is after Tupsimati, then we'd best make all haste back to the Rising Stones! Minfilia must be warned!"},{"name":"WANDERINGMINSTREL","text":"What evil is afoot that my breast should flutter so with unnamed dread?"},{"name":"ALYS","text":"Oh, <span class=\"highlight\">Forename</span>! I heard quite a loud bang from inside the Stones not moments ago. Is everything all right?"},{"name":"MOENBRYDA","text":"You're here!"},{"name":"MOENBRYDA","text":"Master Louisoix's staff is kept in the solar, isn't it? Quickly, now!"},{"name":"MOENBRYDA","text":"（★未使用／削除予定★）"},{"name":"MOENBRYDA","text":"Forget about me! Go!"},{"name":"YDA","text":"Oh, Moen... I miss you so much already..."},{"name":"PAPALYMO","text":"She was counting on the theory that a soul's aether burns brightest at the moment of its passing. A scholar until the very end..."},{"name":"THANCRED","text":"Would we had arrived a few moments sooner...<br>Just a few moments..."},{"name":"YSHTOLA","text":"Our list of grievances against the Ascians was already overlong. Must they continue to add to it?"},{"name":"MINFILIA","text":"Never have I seen Urianger so utterly defeated. No one should be made to suffer such grief..."},{"name":"MINFILIA","text":"We shall gather in the Sharlayan manner to celebrate Moenbryda's life...and mourn her passing."}],"reward":{"gil":2064,"items":[{"id":5667,"one":1},{"id":5672,"one":1},{"id":5677,"one":1}],"xp":4800,"instance":20029},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65904]},"next":[65965]},"partials":[{"type":"npc","id":"1006646","obj":{"i":1006646,"n":"Edelstein","l":46,"q":8,"t":"Flame Lieutenant"}},{"type":"npc","id":"1011000","obj":{"i":1011000,"n":"Minfilia","l":481,"q":2}},{"type":"npc","id":"1006950","obj":{"i":1006950,"n":"Alys","l":67,"q":7}},{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"npc","id":"1010870","obj":{"i":1010870,"n":"Moenbryda","l":46,"q":1}},{"type":"npc","id":"1010879","obj":{"i":1010879,"n":"Moenbryda","l":46,"q":1}},{"type":"npc","id":"1010880","obj":{"i":1010880,"n":"Moenbryda","l":481,"q":1}},{"type":"npc","id":"1010898","obj":{"i":1010898,"n":"Thancred","l":481,"q":2}},{"type":"npc","id":"1010899","obj":{"i":1010899,"n":"Yda","l":481,"q":2}},{"type":"npc","id":"1010900","obj":{"i":1010900,"n":"Papalymo","l":481,"q":2}},{"type":"npc","id":"1010901","obj":{"i":1010901,"n":"Y'shtola","l":481,"q":2}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"instance","id":"20029","obj":{"i":20029,"n":"The Chrysalis","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":90}},{"type":"quest","id":"65904","obj":{"i":65904,"n":"On the Counteroffensive","g":2,"l":"Northern Thanalan","s":82}},{"type":"quest","id":"65965","obj":{"i":65965,"n":"In Memory of Moenbryda","g":2,"l":"The Rising Stones","s":84}}]}