{"quest":{"name":"Best Laid Schemes","location":"Eastern Thanalan","id":65901,"patch":2.5,"sort":79,"eventIcon":71201,"issuer":1010849,"target":1010891,"involved":[1008969,1010850,1010851,1010852,1010853,1010855,1011122,1011123],"genre":2,"journal":["Ilberd would like nothing more than to have this incident forgotten.","Ilberd wishes to join the 1st Unit in their pursuit of the Duskwight sellswords. However, the crate of weapons you and he have confiscated cannot simply be abandoned. He asks that you collect it and deliver it in his stead to Yuyuhase of the 3rd.","With remarkable ease, you secure the wooden crate filled with weapons. All that remains is to leave it in the care of Yuyuhase, who can be found on the Steps of Thal in Ul'dah.","You find Yuyuhase conversing with Alianne of the 4th Unit and her subordinate, Wilred, and place the crate of weapons at their feet. Although Alianne struggles to accept that the single crate is the entirety of the shipment, Yuyuhase dismisses the discrepancy as Riol's failure. After you part ways with the three Braves, Riol steps from the shadows and begs a private audience, though he does not explain why. Seek him out at the Sapphire Avenue Exchange.","After listening to your account of events at the Burning Wall, Riol shakes his head in disbelief and insists that something is not right. He reiterates his claim that there should have been more weapons, crediting his experience deciphering financial transactions, as he once did for the Crystal Braves to ensure that no funds came from unsanctioned sources─though such precautions are no longer taken, it would seem. Apologizing for his outburst, he takes his leave, moments before Tataru summons you to Revenant's Toll via linkpearl. Return to the Rising Stones and speak with the receptionist.","Tataru thanks you for returning so quickly and states that a guest from Ishgard has requested your presence. Given the urgency of the receptionist's summons, it seems likely that the envoy has a dangerous task in mind."],"objectives":["Collect the confiscated crate.","Deliver the confiscated crate to Yuyuhase in Ul'dah.","Speak with Riol.","Speak with Tataru in the Rising Stones."],"dialogue":[{"name":"ILBERD","text":"I will join the 1st in their hunt for the Duskwight sellswords. If the gods are good, we will catch them before they escape into the Black Shroud."},{"name":"ILBERD","text":"In the meantime, I ask that you deliver these weapons to Ul'dah in my stead."},{"name":"ILBERD","text":"Entrust them to the 3rd's Yuyuhase. He will take care of the rest."},{"name":"ILBERD","text":"Pray take the black marketeer's weapons in that crate and deliver them to Ul'dah."},{"name":"ILBERD","text":"Seek out Yuyuhase of the 3rd unit on the Steps of Thal and deliver the crate into his care."},{"name":"ALIANNE","text":"Why, <span class=\"highlight\">Forename</span>, this is a surprise!"},{"name":"ALIANNE","text":"Rhesh wished for me to thank you for helping us to rescue her from Castrum Centri. How fortunate that we could meet again so soon!"},{"name":"WILRED","text":"Did you hear, my friend? I've received my first official assignment as a full-fledged member of the Crystal Braves!"},{"name":"YUYUHASE","text":"Ah, the Warrior of Light, ever-reliable friend to the Crystal Braves. You have my deepest thanks for your assistance in Coerthas. Now, what brings you to us this day?"},{"name":"YUYUHASE","text":"A gift of weapons from a certain black marketeer, courtesy of Captain Ilberd, you say?"},{"name":"YUYUHASE","text":"Understood. Once we've cataloged the contents, I'll have them delivered to the Hall of Flames."},{"name":"ALIANNE","text":"This cannot be everything, can it?"},{"name":"ALIANNE","text":"Riol stated with confidence that there would be a far greater quantity of weapons."},{"name":"YUYUHASE","text":"A blatant falsehood. Clearly, Riol is unfamiliar with the ways of Ul'dahn merchants, who ever strive to present themselves as greater than they are."},{"name":"YUYUHASE","text":"We should be thankful that his information was not completely erroneous, and that we managed to achieve anything of worth at all."},{"name":"WILRED","text":"It's still something worth celebrating, isn't it, Lieutenant?"},{"name":"WILRED","text":"Besides, we've got more important things to worry about─like fighting those Garleans up north!"},{"name":"ALIANNE","text":"There'll be no fighting if I have anything to say about it. Our orders are to stand watch, not to seek glory in battle."},{"name":"ALIANNE","text":"If you have no further need of us, then I shall take my unit to the Ceruleum Processing Plant."},{"name":"YUYUHASE","text":"Time for the 4th to earn their keep, eh? Fight well, Alianne─for the freedom of all!"},{"name":"YUYUHASE","text":"Excellent work as always, my friend. Rest assured that the Immortal Flames will hear of your contribution. Until we meet again."},{"name":"RIOL","text":"<span class=\"highlight\">Forename</span>. A word, if it please ye."},{"name":"RIOL","text":"Not here─look for me at the Sapphire Avenue Exchange. No need for whistlin' this time, don't ye worry."},{"name":"RIOL","text":"Thanks for indulgin' me request."},{"name":"RIOL","text":"Few places better than a market for privacy, I find. All the hustle an' the bustle o' commerce means most conversations go unnoticed."},{"name":"RIOL","text":"I'll get to the point: at the Burnin' Wall, when you an' the captain interrupted the exchange, what happened? Tell me everythin'─leave no detail out."},{"name":"RIOL","text":"Hmmm...that's not quite how the 1st told it."},{"name":"RIOL","text":"These Duskwights they were chasin'─latest word is that we lost the trail."},{"name":"RIOL","text":"But ye never saw 'em yerself? Not before the fightin' started, an' not after?"},{"name":"RIOL","text":"Somethin' ain't right. I don't know what it is, but I can <span class=\"emphasis\">feel</span> it in me bones."},{"name":"RIOL","text":"I'm not daft enough to be misled by some merchant's drunken boasts. Our information was reliable, godsdammit! I <span class=\"emphasis\">know</span> he purchased those weapons!"},{"name":"RIOL","text":"Hmph. As if I've never deciphered a moneylender's books, or had to follow a transaction back to its source..."},{"name":"RIOL","text":"Did plenty o' that back when the Braves were gettin' started, believe me. The commander wanted assurances that we weren't takin' gil from the wrong sort o' benefactors."},{"name":"RIOL","text":"'Course these days the money flows like water, an' the 1st an' 3rd get the shiniest new toys..."},{"name":"RIOL","text":"...Forgive me, friend. I've a lot on me mind these days, an' I appreciate ye lendin' an ear. Right, then─best get back to it."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, can you hear me!? This is Tataru!"},{"name":"TATARU","text":"Your presence is urgently requested at the Rising Stones! Please come and see me as soon as you are able!"},{"name":"TATARU","text":"Thank you for coming so quickly, <span class=\"highlight\">Forename</span>!"},{"name":"TATARU","text":"We've a guest from Ishgard who wishes to speak with you─a most, um...determined lady, by all indications..."},{"name":"MINFILIA","text":"Oh, <span class=\"highlight\">Forename</span>─we will be with you in a moment. Would you please wait outside with Tataru?"},{"name":"LUCIA","text":"You look well, <span class=\"highlight\">Forename</span>. We will have words when the Antecedent and I are finished."},{"name":"URIANGER","text":"'Tis poor form to assault a guest in one's home. Alas, Moenbryda hath ever struggled to observe proper decorum."},{"name":"MOENBRYDA","text":"So this is an Ishgardian knight, eh? She looks the part, I'll give her that─but I reckon I could hold my own."}],"reward":{"gil":1077,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65900]},"next":[65902]},"partials":[{"type":"npc","id":"1010849","obj":{"i":1010849,"n":"Ilberd","l":44,"q":2}},{"type":"npc","id":"1010891","obj":{"i":1010891,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010850","obj":{"i":1010850,"n":"Yuyuhase","l":41,"q":1}},{"type":"npc","id":"1010851","obj":{"i":1010851,"n":"Alianne","l":41,"q":1}},{"type":"npc","id":"1010852","obj":{"i":1010852,"n":"Wilred","l":41,"q":1}},{"type":"npc","id":"1010853","obj":{"i":1010853,"n":"Riol","l":41,"q":1}},{"type":"npc","id":"1010855","obj":{"i":1010855,"n":"Lucia","l":481,"q":2}},{"type":"npc","id":"1011122","obj":{"i":1011122,"n":"Moenbryda","l":481,"q":2}},{"type":"npc","id":"1011123","obj":{"i":1011123,"n":"Urianger","l":481,"q":2}},{"type":"quest","id":"65900","obj":{"i":65900,"n":"Bait and Switch","g":2,"l":"Eastern Thanalan","s":78}},{"type":"quest","id":"65902","obj":{"i":65902,"n":"The Rising Chorus","g":2,"l":"The Rising Stones","s":80}}]}