{"quest":{"name":"Mask of Grief","location":"The Rising Stones","id":65906,"patch":2.55,"sort":85,"icon":100370,"eventIcon":71201,"issuer":1010897,"target":1010930,"involved":[1001304,1010903,1010904,1010929],"genre":2,"journal":["Minfilia has a request to make of you.","Minfilia expresses concern over Yda's emotional state following the loss of Moenbryda. Seek out the melancholy pugilist at the Rising Stones, and see if there is anything you can do to lighten her burden.","Yda explains how Moenbryda would disapprove of her gloominess, and outlines a plan to cheer herself up. You learn that she has ordered a rare flower in memory of her friend, which is currently awaiting collection at Rowena's store. Unfortunately, it would seem Yda finds the merchant rather trying, and is therefore reluctant to pay for the goods in person. Head to the store in your fellow Scion's stead, and use the purse provided to purchase the moon daisy.","You have collected the moon daisy─as well as a flurry of unsolicited advice─from Rowena. Take the flower to the mark of the Scholar at Rathefrost, and hand it to the waiting Yda.","As Yda places the moon daisy before the mark of the Scholar, the skies over Rathefrost are suddenly darkened by the passing of Dravanian wings. Moments later, you are contacted by an audibly anxious Alphinaud, who bids you return to Revenant's Toll at once. Hasten back to the Rising Stones and speak further with the young commander.","Upon returning to the Rising Stones, you are informed that events are coming to a head in Ishgard, and that an envoy from the Holy See is already en route to the Scions' headquarters, bearing an urgent report..."],"objectives":["Speak with Yda.","Hand over the flower payment to Rowena.","Deliver the moon daisy to Yda at Rathefrost.","Speak with Alphinaud at the Rising Stones."],"dialogue":[{"name":"MINFILIA","text":"Have you a moment, <span class=\"highlight\">Forename</span>? I believe Yda wished a word with you."},{"name":"MINFILIA","text":"I should consider it a personal favor if you would lend a sympathetic ear to her troubles."},{"name":"MINFILIA","text":"She has not been herself since Moenbryda's passing, and my heart aches to see her so downcast..."},{"name":"MINFILIA","text":"Yda should be somewhere within the Rising Stones. Pray lend her a sympathetic ear, my friend."},{"name":"YDA","text":"Hey, it's <span class=\"highlight\">Forename</span>! <span class=\"emphasis\">Great</span>!"},{"name":"YDA","text":"...Oh, it's no use. I'm trying to stay positive, but... &lt;sigh&gt; It's just hard, you know...?"},{"name":"YDA","text":"The thing is, I <span class=\"emphasis\">know</span> Moen would tell me off if she saw me moping around like this..."},{"name":"YDA","text":"...Which is why I decided to cheer myself up by getting her a special flower."},{"name":"YDA","text":"I placed an order for a moon daisy with Rowena a little while ago, and it's ready to be picked up."},{"name":"YDA","text":"The trouble is...I find Rowena a bit difficult at the best of times, and...well, this isn't one of them. I know it's silly, but I just can't face it at the moment. So, I was wondering...do you think you could maybe collect it for me? I have the coin to pay for the flower right here."},{"name":"YDA","text":"Thank you so much! I'll be waiting for you─and the daisy─at Rathefrost!"},{"name":"ROWENA","text":"What can I do for you today, adventurer? Eldritch trinket to trade?"},{"name":"ROWENA","text":"...Eh? They've got you runnin' errands now? &lt;snort&gt; Them Scions really know how to make the most o' your talents, don't they? Sendin' the savior of Eorzea to the bleedin' market... Fine use o' your time, that is!"},{"name":"ROWENA","text":"Seriously, though─you'd best learn how to say “no,” or they'll have you muckin' out the chocobo stables next."},{"name":"ROWENA","text":"Anyway, what was it you were here to pick up? The moon daisy, was it? Here, then─take it. And tell that Yda lass I've got a wide selection o' headwear in stock if she ever decides to replace that dowdy ol' mask o' hers. Gods know, she needs to..."},{"name":"YDA","text":"Ugh, Rowena can be so <span class=\"emphasis\">annoying</span>! She just will not take no for an answer. Every time I visit her, she <span class=\"emphasis\">insists</span> I replace my visor with something more “fashionable.” And when I tell her I like it just fine the way it is, she says it again. And then again. And then AGAIN! It drives me crazy!"},{"name":"YDA","text":"Uh, what I mean to say is, I really appreciate you doing this for me. So anyway...let's see it!"},{"name":"YDA","text":"&lt;sigh&gt; Moenbryda loved these things, you know... I hope that somewhere, somehow, she knows I'm still thinking of her..."},{"name":"YDA","text":"Thanks again, <span class=\"highlight\">Forename</span>. I think... I think I'm going to be all right."},{"name":"PAPALYMO","text":"Yda seems to have regained a little of her spark.<br>...And I believe we have you to thank for that. I am most grateful, <span class=\"highlight\">Forename</span>. Truly."},{"name":"ALPHINAUD","text":"My apologies for the interruption... I was deeply saddened to learn of Moenbryda's passing. Her loss will be sorely felt..."},{"name":"ALPHINAUD","text":"Alas, recent developments in Ishgard leave us little time to mourn. The envoy from Coerthas will soon arrive, and we must hasten to hear her report."}],"reward":{"gil":658,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65965]},"next":[65907]},"partials":[{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1010930","obj":{"i":1010930,"n":"Alphinaud","l":481,"q":2}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1010903","obj":{"i":1010903,"n":"Yda","l":481,"q":2}},{"type":"npc","id":"1010904","obj":{"i":1010904,"n":"Papalymo","l":481,"q":2}},{"type":"npc","id":"1010929","obj":{"i":1010929,"n":"Yda","l":67,"q":1}},{"type":"quest","id":"65965","obj":{"i":65965,"n":"In Memory of Moenbryda","g":2,"l":"The Rising Stones","s":84}},{"type":"quest","id":"65907","obj":{"i":65907,"n":"Defenders for Ishgard","g":2,"l":"The Rising Stones","s":86}}]}