{"quest":{"name":"Not a Material Girl","location":"Central Shroud","id":65911,"patch":2.0,"sort":100,"eventIcon":71221,"issuer":1000742,"target":1000742,"involved":[1000474,1000476,1000483],"genre":92,"journal":["An Ul'dahn merchant by the name of Kukuvachi seeks an adventurer to make some inquiries on his behalf.","Kukuvachi has tasked you with discovering what Keitha, the head wrangler, covets most in all the world. Collect the opinions of three Bentbranch locals.","You have gleaned what information you can from the locals of Bentbranch Meadows. Make your report to Kukuvachi.","Kukuvachi's plan to ingratiate himself with Keitha by means of an expensive gift has availed him naught. So long as he fails to grasp what the head wrangler truly values, it would seem his dream of owning a chocobo is destined to go unrealized."],"objectives":["Ask the locals about Keitha's wants and desires.","Return to Kukuvachi."],"dialogue":[{"name":"JIJIBETA","text":"You there─adventurer! Yes, you will suffice. I have a job I need performed, and I'm willing to pay the going rate."},{"name":"JIJIBETA","text":"A trifling task, really. I simply need you to ask the locals here at Bentbranch Meadows what the head wrangler covets most in all the world."},{"name":"JIJIBETA","text":"This is a private matter, lest you doubt, so be sure to inquire <span class=\"emphasis\">discreetly</span>. And please, for the love of Nald, do <span class=\"emphasis\">not</span> reveal that you are in my employ. In fact, it would be best if my name wasn't mentioned at all."},{"name":"AETHELTHRYTH","text":"...What does Keitha covet most? Why would you wish to know som─ <span class=\"emphasis\">Waaait a minute</span>! That Ul'dahn merchant put you up to this, didn't he?"},{"name":"AETHELTHRYTH","text":"&lt;sigh&gt; He's wasting his time with that approach. If the man is serious about owning a chocobo, he would be better served by convincing Keitha of his intent to provide the bird with the proper care and attention."},{"name":"LEODAIRE","text":"Keitha? The only thing Keitha wants is for her birds to be happy."},{"name":"LEODAIRE","text":"If she cares for anything besides the well-being of the chocobos, then I've not heard of it."},{"name":"BERNARD","text":"What's that about Miss Keitha? <span class=\"alternative-container\"><span class=\"alternative\">Hmph, doing that peddler's dirty work, are you</span><span class=\"alternative\">You looking to stir up trouble, son</span></span>?"},{"name":"BERNARD","text":"If <span class=\"alternative-container\"><span class=\"alternative\">that half-wit thinks</span><span class=\"alternative\">you think</span></span> some shiny trinket will move her heart, then <span class=\"alternative-container\"><span class=\"alternative\">he's dafter than he looks. Any fool can see </span><span class=\"alternative\">you don't know her like I─ Er, that is...</span></span>Miss Keitha is only interested in her birds."},{"name":"BERNARD","text":"<span class=\"alternative-container\"><span class=\"alternative\">Tell Kukuvachi from me that if he persists in harassing the head wrangler, the Wood Wailers'll remove him from Bentbranch Meadows for disturbing the peace</span><span class=\"alternative\">Listen here, adventurer─if your actions cause her any distress, the Wood Wailers'll come down on you so hard your boots'll leak blood</span></span>. <span class=\"emphasis\">Got that</span>?"},{"name":"JIJIBETA","text":"Well? Do you plan to keep me in suspense? I must have a chocobo for my very─ What's this!? They told you nothing of her <span class=\"emphasis\">material</span> desires?"},{"name":"JIJIBETA","text":"Ugh! The stubbornness of these Gridanians is infuriating! And I should have known better than to hire a buffoon for such delicate work."},{"name":"JIJIBETA","text":"To think of the amount of gil I have wasted on this fruitless venture... Oh, cease your mewling. I promised you a reward, and a reward you shall have. Now leave me to my misfortune."}],"reward":{"gil":173,"items":[{"id":4092,"one":1},{"id":4091,"one":1},{"id":5824,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":1}]},"next":[65693]},"partials":[{"type":"npc","id":"1000742","obj":{"i":1000742,"n":"Kukuvachi","l":54,"q":1}},{"type":"npc","id":"1000474","obj":{"i":1000474,"n":"Aethelthryth","l":54,"q":2}},{"type":"npc","id":"1000476","obj":{"i":1000476,"n":"Leodaire","l":54,"q":2}},{"type":"npc","id":"1000483","obj":{"i":1000483,"n":"Bernard","l":54,"q":3}},{"type":"item","id":"4092","obj":{"i":4092,"n":"Leather Wristbands","l":8,"c":55643,"t":42,"p":201}},{"type":"item","id":"4091","obj":{"i":4091,"n":"Copper Wristlets","l":8,"c":55601,"t":42,"p":229}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65693","obj":{"i":65693,"n":"Extending Fences","g":92,"l":"Central Shroud","s":110}}]}