{"quest":{"name":"Bloodied and Bowed","location":"Central Thanalan","id":65924,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1001434,"target":1001445,"genre":93,"usedItems":[4552],"journal":["Aethelgyth is concerned for the welfare of a fellow sentry.","Although Aethelgyth knows Osbert is injured, the stubborn sentry refuses to admit anything to her. Believing he might more readily accept aid from a stranger, she bids you offer him a hi-potion, which can be purchased from a merchant nearby.","As Aethelgyth suspected, Osbert was more receptive to your offer of assistance, taking your hi-potion with only a slight show of defiance. Perhaps next time he will take more care when practicing his mummer's tricks."],"objectives":["Offer a hi-potion to Osbert."],"dialogue":[{"name":"AETHELGYTH","text":"See that bloke over there? Name's Osbert, an' he's hurt bad."},{"name":"AETHELGYTH","text":"Now, it ain't exactly my job to mind his business─I'm a Torch, he's a Blade. But at the end of the day we're both people, you know what I'm sayin'?"},{"name":"AETHELGYTH","text":"Anyroad, I went over to him just earlier, asked what's wrong. But he refuses to tell me, the stubborn bugger. Seems his pride's more important to him than his life. What is it with men an' actin' tough?"},{"name":"AETHELGYTH","text":"I tell myself I've tried, but if the fella ends up kickin' the bucket... I don't want that on my conscience. I know this is sudden, but could you try an' talk him into drinkin' a hi-potion? I'd sleep a deal better for it. I ain't got one on me, but one o' 'em fellas over yonder sells 'em."},{"name":"OSBERT","text":"Breathe, Osbert old boy, just breathe. Pain is just weakness leaving the─<span class=\"emphasis\">godsdammit</span>, my head! If only I had saved a hi-potion. I think this might be the end..."},{"name":"OSBERT","text":"Well, I...I don't really <span class=\"emphasis\">need</span> this, but if you insist. You have my thanks, adventurer."},{"name":"OSBERT","text":"I was resigned to suffering in silence, for I, Osbert the Undying, veteran of countless battles, could not afford to show weakness to my colleagues and our allies. They look to me for inspiration, you see."},{"name":"OSBERT","text":"To think that I was almost brought low by a gentle blow to the head! Hah hah hah! I was only incapacitated for a few moments...I think."},{"name":"OSBERT","text":"To repay you for your discretion in this delicate matter, I shall share with you my warrior's wisdom:"},{"name":"OSBERT","text":"If you must practice your juggling, use heavy stones at your own peril."}],"reward":{"gil":122,"items":[{"num":19,"id":2}],"xp":892},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[69388]}},"partials":[{"type":"npc","id":"1001434","obj":{"i":1001434,"n":"Aethelgyth","l":43,"q":1}},{"type":"npc","id":"1001445","obj":{"i":1001445,"n":"Osbert","l":43,"q":2}},{"type":"item","id":"4552","obj":{"i":4552,"n":"Hi-Potion","l":25,"c":20602,"t":44,"p":146}},{"type":"quest","id":"69388","obj":{"i":69388,"n":"Prudence at This Junction","g":1,"l":"Central Thanalan","s":30}}]}