{"quest":{"name":"Vox Populi","location":"Ul'dah","id":65929,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1001685,"target":1001945,"involved":[1001914,1001937,1001939,1001940,1001942,1001949,1003899,1003902],"genre":93,"journal":["Aethelwine appears vexed by his work at the Weavers' Guild and is in need of a helping hand.","Aethelwine is having trouble deciding on a color for the dress he is designing. He would like you to scour the city for this season's trendiest hue.","A survey of Sultansworn and local alchemical sages has led you to the conclusion that red is the new black. Hurry to the Alchemists' Guild and have Leucu concoct the appropriate dye.","Though underwhelmed by the lack of unanimity in your gathered responses, Leucu settles upon red, and assures you that she will begin synthesizing dye immediately."],"objectives":["Find the most popular color on the Hustings Strip.","Find the most popular color on the Steps of Thal.","Report to Leucu at the Alchemists' Guild."],"dialogue":[{"name":"AETHELWINE","text":"Something in a cream...? Oh, whatever shall I do? This dress... I just can't seem to finish it."},{"name":"AETHELWINE","text":"Oh, the design is flawless. Absolutely flawless, of that I have no doubt. But I simply cannot settle on a color for the life of me!"},{"name":"AETHELWINE","text":"How would you like to conduct a bit of field research for me? I'm dying to know what color the ladies of Ul'dah are wearing these days─especially on the Hustings Strip."},{"name":"AETHELWINE","text":"And when you're finished, please call on Leucu at the Alchemists' Guild. The woman is a <span class=\"emphasis\">wizard</span> with dyes. Have her cook up whatever color you find is most popular."},{"name":"DODOMUN","text":"What color is in fashion? Well, I must say, I'm just back from Gridania, and I find there's a certain verve to verdant livery... &lt;sigh&gt; <span class=\"emphasis\">Green</span>, you bloody idiot!"},{"name":"TALK","text":"Time was, the Sultansworn were the finest warriors in Ul'dah. But they've since grown as feeble and flaccid as the royal family itself. &lt;spit&gt; Hells, they'll not even be a match for the Brass Blades before long."},{"name":"FASTRED","text":"Best color for a dress? Well, you know what they say: once you go black, you never go back."},{"name":"TALK","text":"We Sultansworn have vowed to put the safety of the sultana and her house before all else! But I sure could go for a sandwich..."},{"name":"CORDIALSPIDER","text":"Yellow. What fairer color than that in the name of the fairest maiden? Yellow Moon... Oh, Yellow Moon, how my heart pines for you!"},{"name":"TALK","text":"Ahem... Speaking of colors, though... The fountain and plaza below are known as the Gold Court. In former days, many a royal gala graced its stones."},{"name":"BOBOLAN","text":"There's never a shortage of white dresses on our Ul'dahn ladies. Surely, it is the most comfortable color to wear under this murderous sun."},{"name":"TALK","text":"&lt;sigh&gt; Just mentioning the treacherous heat causes fatigue... And my passion for alchemy is such that I oft forget to sleep. And so I have resolved to concoct a magical elixir─a potable that shall imbue the imbiber with the energy of a bull, red with waking rage! Sleep, begone!"},{"name":"RURUREMU","text":"Red, ever and always! This is Ul'dah, my dear <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>, where the sun beats on your back with fiery fists, and the sins and sands are hot and unforgiving and everywhere at once. We Ul'dahns live for our passions, and our lust for life is surpassed only by our lust for lust!"},{"name":"TALK","text":"Didn't you hear me, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>? Red's the only way to go in this city. Now, off with you! I've alchemical formulae to work out!"},{"name":"CORNELL","text":"Personally, I've always had a thing for a motley of red and green overlaid with stripes of purple and dark brown."},{"name":"TALK","text":"It's been months since I've joined the guild, yet they've taught me only the most basic alchemy. It's possible that seeing only my own questionable alchemical concoctions has influenced my taste in color palettes..."},{"name":"AUBELET","text":"The most popular color of late? Well, all colors have their merits, of course. But, if pressed, I'd have to say red."},{"name":"TALK","text":"Beyond lies the upper tier of Ul'dah, home to nobles and aristocrats alike. Know that here the eyes of the Sultansworn are upon you at all times."},{"name":"TETESHAN","text":"Why, any color is perfectly fine for a dress, you silly thing. So long as it comes off easily at the end of the night!"},{"name":"TALK","text":"The royals strut about as though the sun shone out of their arses, but I hear life in the palace isn't nearly so sweet as they'd have us believe. Word is most merchants lead far fatter lives than any of the sultansblood."},{"name":"LEUCU","text":"You are here on behalf of the Weavers' Guild, are you not? Yes, Aethelwine said you'd be along. Well, what color is it to be, then?"},{"name":"LEUCU","text":"It sounds as though you have two votes for red, one vote each for green, yellow, white, and black, one abstaining, and one vote for...a motley of red and green overlaid with stripes of purple and dark brown."},{"name":"LEUCU","text":"By no means a resounding victory, but I suppose red it shall be. I have some catalysts I've been saving for just such an occasion. Mark my words: I'm going to concoct the most vibrant red Ul'dah has ever seen!"},{"name":"LEUCU","text":"Alchemy may look arcane and esoteric to the uninitiated, but it is grounded in naught but science and experimentation. Indeed, I daresay it does more to advance culture and civilization than nigh any other discipline."}],"reward":{"gil":109,"xp":121}},"partials":[{"type":"npc","id":"1001685","obj":{"i":1001685,"n":"Aethelwine","l":41,"q":2}},{"type":"npc","id":"1001945","obj":{"i":1001945,"n":"Leucu","l":41,"q":1}},{"type":"npc","id":"1001914","obj":{"i":1001914,"n":"Aubelet","l":41,"q":1}},{"type":"npc","id":"1001937","obj":{"i":1001937,"n":"Fastred","l":41,"q":1}},{"type":"npc","id":"1001939","obj":{"i":1001939,"n":"Cordial Spider","l":41,"q":1}},{"type":"npc","id":"1001940","obj":{"i":1001940,"n":"Dodomun","l":41,"q":1}},{"type":"npc","id":"1001942","obj":{"i":1001942,"n":"Bobolan","l":41,"q":1}},{"type":"npc","id":"1001949","obj":{"i":1001949,"n":"Rururemu","l":41,"q":1}},{"type":"npc","id":"1003899","obj":{"i":1003899,"n":"Teteshan","l":41,"q":1}},{"type":"npc","id":"1003902","obj":{"i":1003902,"n":"Cornell","l":41,"q":1}}]}