{"quest":{"name":"Decisions, Decisions","location":"Ul'dah","id":65928,"patch":2.0,"sort":20,"eventIcon":71221,"issuer":1001680,"target":1001691,"genre":93,"journal":["Bitter Snow's eyes are those of a man in love, wrought with worry and doubt. He appears to be waiting for someone who has yet to arrive...","Bitter Snow has revealed to you that he is standing in wait for his beloved. However, she is nowhere to be seen, and he is beginning to fear for the worst. Hasten to the Weavers' Guild to see if you can locate the belated Yellow Moon.","You locate Yellow Moon after a quick search of the Weavers' Guild. It turns out she has spent the past few bells fretting over which outfit to wear for her rendezvous with Bitter Snow. You consider taking word to Bitter Snow, but instead decide to leave well enough alone."],"objectives":["Speak with Yellow Moon in the Weavers' Guild."],"dialogue":[{"name":"BITTERSNOW","text":"What could be keeping her?"},{"name":"BITTERSNOW","text":"My beloved Yellow Moon and I promised to meet at this very spot, but two bells have passed and I've nary a word from her. Gods, I hope she's all right..."},{"name":"BITTERSNOW","text":"As much as I wish to go off and find her, I simply cannot. What if she were to come in my absence? Please, would you search for her in my stead?"},{"name":"BITTERSNOW","text":"It's possible she's somewhere near the Weavers' Guild. She always enjoyed watching the─"},{"name":"BITTERSNOW","text":"By the gods! Do you...do you think she's left me for someone more...dapper? I try not to look a bumpkin, but I've no mind for fashion!"},{"name":"YERROWMOON","text":"Byregot be good, just look at me! This hair... This outfit... They don't match at all! I look <span class=\"emphasis\">atrocious</span>! What was I thinking!?"},{"name":"YERROWMOON","text":"Oh, I can't let Bitter Snow see me like this. Maybe that last tunic <span class=\"emphasis\">was</span> best, after all. Or no... Perhaps the blue?"},{"name":"YERROWMOON","text":"Hm? Bitter Snow is waiting for me? But I haven't anything to wear!"}],"reward":{"gil":111,"items":[{"id":5539}],"xp":110}},"partials":[{"type":"npc","id":"1001680","obj":{"i":1001680,"n":"Bitter Snow","l":41,"q":1}},{"type":"npc","id":"1001691","obj":{"i":1001691,"n":"Yellow Moon","l":41,"q":4}},{"type":"item","id":"5539","obj":{"i":5539,"n":"Lavender","l":11,"c":25002,"t":54}}]}