{"quest":{"name":"Out to Dry","location":"Middle La Noscea","id":65935,"patch":2.0,"sort":100,"eventIcon":71221,"issuer":1003242,"target":1003242,"genre":91,"journal":["W'dhovaka, a Skylift operator, is looking for someone to assist with her megalocrab woes.","Each time a balloon envelope is ruined, it reduces the amount of cargo the Skylift operation can transport. Slay five megalocrabs and help keep the crates moving.","You have slain the megalocrabs. Return to the Skylift and report to W'dhovaka.","Thanks to your shell-cracking efforts, the balloon envelopes are safe from marauding megalocrabs for a time. With the demand for cargo transport ever growing, however, a more permanent solution to the problem seems in order."],"objectives":["Slay megalocrabs.","Report to W'dhovaka at the Skylift."],"dialogue":[{"name":"WDHOVAKA","text":"Ah, for the love o' Llymlaen, not again! The leather's ripped to bloody shreds! Hm? No, there's naught awry with me breeches, ye cheeky sod."},{"name":"WDHOVAKA","text":"It's the megalocrabs─they've been at the balloon envelopes I left out to dry on the rocks. Those hells-spawned snippers think they've found a squid or somethin' an' set to nibblin'."},{"name":"WDHOVAKA","text":"Less balloons in the air means less cargo gettin' lifted, an' that don't sit too well with me. Ye lookin' for a quick job? How 'bout ye crack a few shells afore ye head off on yer way? If ye could put down five or so o' the buggers, that ought to do for now."},{"name":"WDHOVAKA","text":"Ye take care o' them snippers? Good bloody riddance! Nice work there, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"WDHOVAKA","text":"Still, it won't be long afore a new crew o' crabs comes sidlin' in to claim that territory. And our loads just keep gettin' heavier, what with all the rebuildin' going on. If I don't want to be buried under a mountain o' crates, I'd best think of a more lastin' solution to this snipper problem."}],"reward":{"gil":173,"items":[{"num":23,"id":3}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":1}]}},"partials":[{"type":"npc","id":"1003242","obj":{"i":1003242,"n":"W'dhovaka","l":30,"q":1}}]}