{"quest":{"name":"Failure to Lunch","location":"Lower La Noscea","id":65945,"patch":2.0,"sort":120,"eventIcon":71221,"issuer":1002233,"target":1002233,"involved":[1002453,1002455],"genre":91,"journal":["Poor Wafufu's food cart is light a few lunches, and she needs help locating the lost meals.","Search the Moraby Drydocks for four missing lunches.","You have located all four lunches. Now hurry them back to Wafufu before foreman Ahtbyrm does something drastic!","Your efforts have spared Wafufu a terrible fate...that in all likelihood would have never befallen her anyway (but don't tell her that)."],"objectives":["Find Wafufu's missing lunches.","Return the lunches to Wafufu."],"dialogue":[{"name":"WAFUFU","text":"Oh, woe is me! I seem to have gone and misplaced four of my packed lunches. Whatever am I to do? I can hear Ahtbyrm's belly grumble from all the way over here!"},{"name":"WAFUFU","text":"I'm certain I made enough for everyone, so it must be that I either dropped a few, or gave some to the wrong fellows. Oh, did you hear that? It was Ahtbyrm's belly again. He does not look at all pleased, does he?"},{"name":"WAFUFU","text":"I must stay with my cart, but if you could search the Drydocks and see if you cannot find those lunches, I would be eternally grateful. I might even whip together something special for y─ Ah! Did you see that? Ahtbyrm just gave me the evil eye. If those lunches don't turn up soon, I'm afraid he'll come over here and eat <span class=\"emphasis\">me</span>!"},{"name":"LYNGSTYRM","text":"&lt;sigh&gt; Don't tell me. You came to collect my lunch. I can see it in them accusing eyes of yours."},{"name":"LYNGSTYRM","text":"Sure, I knew right well that none of these lunches was meant for me, what with today being my day off and all. But I never thought little Wafufu would miss just <span class=\"emphasis\">one</span>."},{"name":"LYNGSTYRM","text":"If I give back the lunch, would you promise me you'll not mention that it was I who took it? I don't want the lass to think I was trying to swindle her...though that's sort of what I was trying to do... But she doesn't have to know that now, does she? Right then! Carry on!"},{"name":"MAETIMYND","text":"Wafufu be needin' one o' her lunches back, ye say?"},{"name":"MAETIMYND","text":"And here I was beginnin' to think the lass had eyes fer me. Not that she's me type, mind ye. I like me women a few hands taller...and a few ponzes heavier...<span class=\"emphasis\">and</span> a few shades bluer, if ye catch me drift."},{"name":"MAETIMYND","text":"I wouldn't have minded the extra meal, though. A man can work up quite a cravin' when he's been poundin', stretchin', and shapin' sheets of iron all <span class=\"alternative-container\"><span class=\"alternative\">day</span><span class=\"alternative\">night</span></span>."},{"name":"WAFUFU","text":"Please tell me you found the lunches. I swear Ahtbyrm has shifted several paces closer since you departed!"},{"name":"WAFUFU","text":"One, two, three...four! You did it! You found all the missing lunches!"},{"name":"WAFUFU","text":"Now, perhaps, I can rest in peace, knowing that Ahtbyrm won't be indulging in his cannibalistic fantasies..."},{"name":"WAFUFU","text":"...at least for today."}],"reward":{"gil":196,"items":[{"id":27637,"one":1},{"id":3773,"one":1},{"num":2,"id":5824,"one":1}],"xp":2625},"reqs":{"jobs":[{"lvl":10,"id":1}]},"next":[65944,65946]},"partials":[{"type":"npc","id":"1002233","obj":{"i":1002233,"n":"Wafufu","l":31,"q":1}},{"type":"npc","id":"1002453","obj":{"i":1002453,"n":"Lyngstyrm","l":31,"q":1}},{"type":"npc","id":"1002455","obj":{"i":1002455,"n":"Maetimynd","l":31,"q":1}},{"type":"item","id":"27637","obj":{"i":27637,"n":"Hard Leather Thighboots","l":12,"c":46103,"t":38}},{"type":"item","id":"3773","obj":{"i":3773,"n":"Hard Leather Sandals","l":12,"c":49804,"t":38,"p":286}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65944","obj":{"i":65944,"n":"What Counts","g":91,"l":"Lower La Noscea","s":120}},{"type":"quest","id":"65946","obj":{"i":65946,"n":"Nailed It","g":91,"l":"Lower La Noscea","s":130}}]}