{"quest":{"name":"Do Angry Pirates Dream","location":"Lower La Noscea","id":65949,"patch":2.0,"sort":66,"eventIcon":71201,"issuer":1002238,"target":1002237,"involved":[1002240,1002463,1002464,1002465],"genre":1,"journal":["<span class=\"emphasis\">Victory</span> foreman Ahtbyrm is considering recommending you for an important job involving drydock security.","Head of the Moraby Drydocks watch, Ghimthota has asked <span class=\"emphasis\">Victory</span> foreman Ahtbyrm to recommend an adventurer to assist the watch in learning more about a band of suspicious individuals who have recently made camp on the Gods' Grip. The foreman has recommended you. Hurry over to the aetheryte to receive your orders.","Ghimthota believes the suspicious individuals in question to be pirates who are planning to sabotage the <span class=\"emphasis\">Victory</span>. She wishes you to infiltrate their gang and see if you can learn anything of their intentions. Speak with C'nangho stationed at the rear gate for details on the exact location of the pirates' camp.","The pirates were last seen to the southeast near an ancient stone known as the mark of the Spinner.","Your conversations with the suspicious characters reveal that they truly are pirates, and that they could be plotting a kidnapping. Report this to Ghimthota at once.","Upon learning of the pirates' plot, Ghimthota resolves to increase patrols of the area. However, who could this “boy” of which the pirates speak be?"],"objectives":["Speak with Ghimthota.","Speak with C'nangho.","Confront the suspicious individuals.","Return to the Moraby Drydocks and report to Ghimthota."],"dialogue":[{"name":"AHTBYRM","text":"<span class=\"highlight\">Forename</span>. While I originally had doubts about your motives, you have repeatedly proven yourself an asset to Naldiq & Vymelli's. I still do not like you, but that does not mean I do not trust you."},{"name":"AHTBYRM","text":"Ghimthota, head of the watch here at the Drydocks, believes that pirates may be plotting an attack on the <span class=\"emphasis\">Victory</span>, and she requires assistance investigating a group of unsavory individuals making camp nearby. I have recommended you for the task."},{"name":"AHTBYRM","text":"Despite all Limsa Lominsa endured before, during, and following the Calamity, the fact that there are still those who would turn their backs on the city–state so that they might line their pockets with a few handfuls of coin... Just the thought of it sickens me."},{"name":"GHIMTHOTA","text":"Ah, yes. I had a feeling you would be the one Ahtbyrm sent. Since you first arrived at the Moraby Drydocks, I have had my men watch you. Oh, there's no need to get angry. I make it a point to keep an eye on all those new to the area. It is simply protocol."},{"name":"GHIMTHOTA","text":"And you'll be pleased to know that nothing...incriminating was found. You <span class=\"emphasis\">appear</span> to be a model citizen. That, and the foreman seems to think somewhat highly of you...which I must admit is quite shocking. The man doesn't even trust his own mother."},{"name":"GHIMTHOTA","text":"Very well, then. I assume Ahtbyrm informed you of what your task would entail. The pirates we believe are conspiring to raid the Drydocks were last seen making camp near an ancient stone called the mark of the Spinner. I would have you approach the men, posing as a lost adventurer, and see if you cannot somehow learn of their intentions. C'nangho stationed at the rear gates can provide you with an exact location of the camp."},{"name":"CNANGHO","text":"<span class=\"highlight\">Forename</span>! Ha ha! I knew it! No more sardines for C'nangho. Tonight, I shall dine on the finest salmon on the peninsula! Why? Well, I had a little wager going with some of the other guards on who Ahtbyrm would recommend for the next job. My money was on you!"},{"name":"CNANGHO","text":"Ah, the job. Yes, of course. If you follow the road past the gates to the southeast, you will eventually come to a barren cape with a single large stone half-buried in the cliff overlooking the sea. Followers of the Twelve say it's a holy place dedicated to Nymeia, the Spinner. I'd be surprised if the pirates camped up there were aware of that, though."},{"name":"CORSAIR","text":"I'm givin' ye to the count of nine to step back on that path, and carry yer 'venturin' arse back down to whatever rock it is ye crawled out from under."},{"name":"CORSAIR","text":"Ye see, I's 'ad it up to me ears with yer type, roamin' the 'ills like they was yers to roam. It's gettin' to be that a man cannae enjoy a mug o' rum wivout some shite-breath outlander runnin' up askin' which is the way to the local levemete. Seven 'ells if I know! I'm a bloody pirate, godsdammit!"},{"name":"CORSAIR","text":"Thal's balls! Once we 'ave me boy back, I'm puttin' this godsforsaken piss'ole of an island so far behind me, ain't no one'll remember I was ever 'ere. Come on, scrags. We's knives to sharpen."},{"name":"CORSAIRFOLLOWA","text":"What do we 'ave 'ere? A li'l lost lamb come lookin' for <span class=\"alternative-container\"><span class=\"alternative\">'er</span><span class=\"alternative\">'is</span></span> mummy? We's a nice fire goin'. Why not come and sit yer tender arse down by old One–Tooth? I'll keep ye all warm an' toasty, like. Heh heh heh."},{"name":"CORSAIRFOLLOWB","text":"Bugger off, ye unbloodied whelp. Ye reek of an old maid's teats, and it's makin' me wine taste more sour than it already is."},{"name":"GHIMTHOTA","text":"So the trespassers are indeed pirates, and they are indeed planning something. But what is this talk of getting “me boy back”?"},{"name":"GHIMTHOTA","text":"Could it be that their target never was the <span class=\"emphasis\">Victory</span>?"},{"name":"GHIMTHOTA","text":"Something is not right, and I won't sit by idly waiting for those pirates to make the first move. I shall order increased patrols immediately. Thank you again for your help, <span class=\"highlight\">Forename</span>. It appears we were wise to put our trust in you."}],"reward":{"gil":220,"items":[{"id":1753,"one":1},{"id":2146,"one":1},{"id":9186,"one":1},{"num":7,"id":5824,"one":1}],"xp":6160},"reqs":{"jobs":[{"lvl":10,"id":130}],"quests":[65951]},"next":[65950]},"partials":[{"type":"npc","id":"1002238","obj":{"i":1002238,"n":"Ahtbyrm","l":31,"q":5}},{"type":"npc","id":"1002237","obj":{"i":1002237,"n":"Ghimthota","l":31,"q":4,"t":"Storm Captain"}},{"type":"npc","id":"1002240","obj":{"i":1002240,"n":"C'nangho","l":31,"q":2,"t":"Storm Private"}},{"type":"npc","id":"1002463","obj":{"i":1002463,"n":"Disreputable Pirate","l":31,"q":1}},{"type":"npc","id":"1002464","obj":{"i":1002464,"n":"Loyal Scrag","l":31,"q":1}},{"type":"npc","id":"1002465","obj":{"i":1002465,"n":"Loyal Scrag","l":31,"q":1}},{"type":"item","id":"1753","obj":{"i":1753,"n":"Spiked Bronze Labrys","l":13,"c":31405,"t":3,"p":773}},{"type":"item","id":"2146","obj":{"i":2146,"n":"Ash Picatrix","l":13,"c":33404,"t":10,"p":634}},{"type":"item","id":"9186","obj":{"i":9186,"n":"Brass Daggers","l":13,"c":33805,"t":84,"p":416}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65951","obj":{"i":65951,"n":"Righting the Shipwright","g":1,"l":"Lower La Noscea","s":59}},{"type":"quest","id":"65950","obj":{"i":65950,"n":"Victory in Peril","g":1,"l":"Lower La Noscea","s":76}}]}