{"quest":{"name":"A Bridge Too Full","location":"Lower La Noscea","id":65943,"patch":2.0,"sort":110,"eventIcon":71221,"issuer":1002231,"target":1002231,"involved":[1002447,1002448,1002449,1002450,1002451,1002452],"genre":91,"journal":["Captain Doesrael, stationed at Oschon's Embrace, needs you to track down a guard who has abandoned his duties.","With the recent increase in deliveries being sent between the Moraby Drydocks and Limsa Lominsa, passage across Oschon's Embrace has slowed to a crawl. Find Wyrstmaga, the guard whose duty it is to ensure smooth travel across the bridge.","Wyrstmaga appears intimidated by the angry shouts of the drivers as they fume at the seemingly interminable delays. Do your best to /soothe the irate coachmen so that the harried guard might return to his post and perform his duties in relative peace.","You have managed to soothe the irate coachmen. Report your success to Wyrstmaga and have him return to his post.","Wyrstmaga has returned to his post on the bridge. Report your progress to Captain Doesrael at Oschon's Embrace.","The conflict preventing passage across Oschon's Embrace has been resolved. But with work on the <span class=\"emphasis\">Victory</span> demanding ever more materials, you can only wonder how Wyrstmaga will cope with the steadily increasing traffic on the bridge."],"objectives":["Speak with Wyrstmaga.","/soothe the irate coachmen.","Speak with Wyrstmaga.","Speak with Doesrael."],"dialogue":[{"name":"DOESRAEL","text":"Eh? Ye be wantin' to cross Oschon's Embrace? If ye ain't in a hurry to be some place, I'd rather ye hold off for a bell or two─presently, the bridge is such a right confusion o' wagons an' such, the damn thing's like to collapse."},{"name":"DOESRAEL","text":"We expect a <span class=\"emphasis\">bit</span> o' congestion, what with this bein' the only bridge connectin' the roads from the Drydocks to Limsa Lominsa, but today's traffic is somethin' awful."},{"name":"DOESRAEL","text":"Speakin' o' which, what in the seven hells does Wyrstmaga think he's playin' at desertin' his post at a time like this? Do me a favor, would ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Track down that skittish bugger an' tell him to get his arse back to directin' the chaos at the Embrace."},{"name":"WYRSTMAGA","text":"Bah, 'twas only a matter o' time before they sent someone after me, I suppose. Aye, I heard ye─the bridge is a bloody mess. Truth be told, I wish the damn thing <span class=\"emphasis\">would</span> collapse and save me the sufferin'."},{"name":"WYRSTMAGA","text":"I can't simply wave me hands an' have everythin' suddenly sort itself out, now can I? An' if I try reasonin' with those demon-spawned coachmen, I'm like to get me head bit off."},{"name":"WYRSTMAGA","text":"Listen, if yer not goin' to let me be, then can ye at least have a word with the more irate wagon drivers? Ye know, <span class=\"highlight\">soothe</span> their tempers some? That'll be one less headache for me to deal with."},{"name":"OROGUARD","text":"Good sirs and ladies! Calm yourselves! There's no need to─oh gods..."},{"name":"IRATECOACHMANS","text":"I got me a load o' goods from the Drydocks meant for Forgemaster H'naanza herself! Now yield the way afore I drive me wagon right over yer squealin' hide!"},{"name":"IRATECOACHMANN","text":"And my cargo's already late for the shipyard! If you want to be the one to explain to the Admiral why her <span class=\"emphasis\">Victory</span> is behind schedule, then be my bloody guest!"},{"name":"COACHMANS","text":"Blocked again!? They'll have the road backed up all the way to the gates at this rate. I swear by the Navigator, I'll kick those wagons over the sides my damn self if this bridge doesn't open up soon!"},{"name":"COACHMANN","text":"&lt;groan&gt; This is the third time this week. I must have these fish across and properly stored before they begin to spoil!"},{"name":"WYRSTMAGA","text":"Ye have a word with those irate coachmen an' <span class=\"highlight\">soothe</span> some tempers, an' I'll soon have the rest of this mess sorted out."},{"name":"WYRSTMAGA","text":"Well, I'll be damned. Ye actually managed to calm them buggers down!? Yer a miracle worker, an' that's the honest truth."},{"name":"WYRSTMAGA","text":"All I need is for the drivers to heed me directions without all that snappin' an' snarlin', ye see. Well, I'd best be at it afore they lose their tempers again."},{"name":"WYRSTMAGA","text":"Oh, an' I'd appreciate it if ye could let Captain Doesrael know I'm back on the job."},{"name":"OROGUARD","text":"Thank you kindly, adventurer! We should be able to get things moving again as soon as─ Hm? Now where did Wyrstmaga disappear to!?"},{"name":"IRATECOACHMANS","text":"Hmph. Ye could be right, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Maybe there <span class=\"emphasis\">is</span> room for both of us to squeeze past if I shift an ilm or two to the left. Probably could've seen that for meself if I hadn't been so busy screamin'. Heh heh."},{"name":"IRATECOACHMANN","text":"I'm sore glad at least one person on this bridge has <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> head on straight. Perhaps those useless guards should retire and let <span class=\"emphasis\">you</span> assume their post."},{"name":"COACHMANS","text":"Well done, mate, well done! Might've been a good show if it'd come to blows, but we all have places to be, now don't we?"},{"name":"COACHMANN","text":"&lt;sigh&gt; Now half my Drydocks shipment is spoiled thanks to this cursed bridge and its endless delays. If only I had spent more coin on chilling the fish..."},{"name":"DOESRAEL","text":"Wyrstmaga is back at his post, is he? Yer tongue must be made o' silver to have accomplished that feat!"},{"name":"DOESRAEL","text":"He can't handle the yellin', you see. The gods only know how such a delicate flower survived guard trainin' in the first place."},{"name":"DOESRAEL","text":"An' he's never goin' to survive duty at the bridge now that work on the <span class=\"emphasis\">Victory</span> has a flood o' deliveries comin' in an' out every bloody day. Wyrstmaga better harden up, or start lookin' for a quieter line o' work."},{"name":"IRATECOACHMANS","text":"Make way, ye ugly bilge rat! I should've been in Limsa bells ago! Eh!? I'll calm down when fishbacks learn to fly! Now move yer arse!"},{"name":"IRATECOACHMANS","text":"Well, if ye put it like that, then maybe I'll hold me tongue for a bit."},{"name":"IRATECOACHMANN","text":"You can take your self-important words and take a dive in the harbor! I have shipwrights expecting this cargo, and it'll be a cold day in Thanalan before I back down first!"},{"name":"IRATECOACHMANN","text":"Perhaps you do have a point. I shall endeavor to keep a hold on my temper, if only to see this situation resolved before the moon turns."}],"reward":{"gil":188,"items":[{"id":4093,"one":1},{"id":4198,"one":1},{"id":5824,"one":1}],"xp":2100},"reqs":{"jobs":[{"lvl":10,"id":1}]}},"partials":[{"type":"npc","id":"1002231","obj":{"i":1002231,"n":"Doesrael","l":31,"q":1}},{"type":"npc","id":"1002447","obj":{"i":1002447,"n":"Wyrstmaga","l":31,"q":1}},{"type":"npc","id":"1002448","obj":{"i":1002448,"n":"Panicked Yellowjacket","l":31,"q":1}},{"type":"npc","id":"1002449","obj":{"i":1002449,"n":"Irate Coachman","l":31,"q":1}},{"type":"npc","id":"1002450","obj":{"i":1002450,"n":"Irate Coachman","l":31,"q":1}},{"type":"npc","id":"1002451","obj":{"i":1002451,"n":"Troubled Coachman","l":31,"q":1}},{"type":"npc","id":"1002452","obj":{"i":1002452,"n":"Troubled Coachman","l":31,"q":1}},{"type":"item","id":"4093","obj":{"i":4093,"n":"Bone Armillae","l":10,"c":55632,"t":42}},{"type":"item","id":"4198","obj":{"i":4198,"n":"Copper Ear Cuffs","l":11,"c":55201,"t":41,"p":224}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}