{"quest":{"name":"Need to Breed","location":"Western La Noscea","id":65941,"patch":2.0,"sort":120,"eventIcon":71221,"issuer":1003244,"target":1003244,"genre":91,"journal":["Lyulf, a farmer at the Swiftperch settlement, needs your assistance with another part of his restoration scheme.","To help Lyulf begin his dodo-raising endeavor, seek out the dodo nests scattered throughout the Flock and gather three fertilized eggs.","You have gathered three fertilized dodo eggs. Return to Swiftperch and deliver them to the waiting Lyulf.","Ready now to begin raising dodos in earnest, Lyulf is giddy with the thought of restoring Swiftperch to its former heights of agricultural glory. You can only hope that the eggs you acquired for the farmer will help contribute to the salvation of this Calamity-ravaged land."],"objectives":["Gather fertilized eggs from dodo nests.","Deliver the dodo eggs to Lyulf at Swiftperch."],"dialogue":[{"name":"LYULF","text":"All these wild dodos you see about the place were actually once domesticated birds, bred by my father. They broke loose during the chaos of the Calamity and gradually became the feral, ill-tempered creatures we now do our best to avoid."},{"name":"LYULF","text":"But if I am to restore Swiftperch to the very same settlement it was when my father was alive, then I must also try my hand at dodo-raising. And, as you have likely surmised, I shall require your adventurer's resourcefulness in this endeavor."},{"name":"LYULF","text":"For the initial stage of my dodo-rearing enterprise, I need you to head into the Flock and seek out dodo nests. You'll be looking for fertilized eggs─three of them should do nicely for now."},{"name":"LYULF","text":"But pray be careful when liberating the eggs. The adult dodos will not take kindly to an intruder making off with their offspring!"},{"name":"TALK","text":"You find nothing of interest."},{"name":"LYULF","text":"With three eggs, I should be able to experiment with breeding. Success or failure is not terribly important─to begin with, I mean only to gain some practical experience with the birds."},{"name":"LYULF","text":"Yes, you did exceptionally well in selecting only fertilized eggs! Now that I consider it, I'm not entirely sure how you managed to tell... In any case, I must raise the naturally aggressive dodo from the egg if I am to have any chance of surviving the breeding process."},{"name":"LYULF","text":"Apart from encouraging a more docile behavior while the bird is but a chick, it is imperative that I remove the gland that produces that infamous poisonous breath. My father's notes quite graphically depict the consequences of failing to do so."},{"name":"LYULF","text":"This really is rather exciting! Every day I take another step closer to my vision of a Swiftperch surrounded by golden fields of wheat and echoing with the calls of plump, waddling dodos!"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":188,"xp":2625},"reqs":{"jobs":[{"lvl":10,"id":1}],"quests":[65940]}},"partials":[{"type":"npc","id":"1003244","obj":{"i":1003244,"n":"Lyulf","l":33,"q":3}},{"type":"quest","id":"65940","obj":{"i":65940,"n":"Farmer of Fortune","g":0,"l":"Western La Noscea","s":52}}]}