{"quest":{"name":"On to the Drydocks","location":"Limsa Lominsa","id":65942,"patch":2.0,"sort":54,"eventIcon":71201,"issuer":1001000,"target":1002238,"genre":1,"journal":["Forgemaster H'naanza, head of Naldiq & Vymelli's, wants you to assist with the workload over at the Moraby Drydocks.","With her company struggling to complete construction of a massive warship due to a shortage of artisans, Forgemaster H'naanza has requested your assistance in handling any miscellaneous tasks. Your first job requires you to deliver a missive to Ahtbyrm, the head shipwright at the Moraby Drydocks.","The shipwrights at the Moraby Drydocks are working feverishly on construction of the Maelstrom's new warship, the <span class=\"emphasis\">Victory</span>. Lend your aid to the overworked artisans and help them complete this towering symbol of Limsa Lominsa's glorious renewal."],"objectives":["Deliver the missive to Ahtbyrm at the Moraby Drydocks."],"dialogue":[{"name":"HNAANZA","text":"What say you to taking on some work from Naldiq & Vymelli's? We've a great hulking warship to build and could certainly use an extra hand for any number of tasks."},{"name":"HNAANZA","text":"For your first job, I need you to run this missive over to Ahtbyrm, the head shipwright at the Moraby Drydocks."},{"name":"HNAANZA","text":"We forge most of the ship's bits and pieces here at the Armorers' Guild, but the actual construction takes place at the docks found in the south of lower La Noscea."},{"name":"HNAANZA","text":"That's also where you'll find the main offices of Naldiq & Vymelli's. The Moraby Drydocks is one of Limsa Lominsa's most important districts─at least as far as I'm concerned─and I'm sure you'll not regret attuning yourself to the area's aetheryte."},{"name":"HNAANZA","text":"If you've no confidence in your sense of direction, you'd be best served making use of the chocobo porters. First floor of the Mizzenmast, in case you were wondering."},{"name":"HNAANZA","text":"Should you choose to make the trek on your own two feet, leave the city through the Tempest Gate and follow the road south. May the Navigator guide your steps."},{"name":"AHTBYRM","text":"You have a missive for me from Forgemaster H'naanza? I assume it pertains to the pending arrival of the materials I ordered over a moon past. Let's see it, then."},{"name":"AHTBYRM","text":"Blast and botheration! Another delay? I am well aware of the shortage of skilled artisans, but this is insufferable!"},{"name":"AHTBYRM","text":"&lt;sigh&gt; My apologies. The messenger does not deserve to bear the brunt of my frustration. Might I have your name?"},{"name":"AHTBYRM","text":"<span class=\"highlight\">Forename</span>, is it? Well, <span class=\"highlight\">Forename</span>, this proud maiden you see taking shape before you is the <span class=\"emphasis\">Victory</span>, the first new vessel to grace the docks since the Calamity."},{"name":"AHTBYRM","text":"We may have lost the bulk of our ships that fateful day, but starting with this beauty, we <span class=\"emphasis\">will</span> restore the Maelstrom's fleet to its former glory. The <span class=\"emphasis\">Victory</span> is more than a simple warship─it is the symbol of Limsa Lominsa's rebirth from the wreckage wrought by the coming of the Seventh Umbral Era."},{"name":"AHTBYRM","text":"Thus we are striving to complete her construction as swiftly as possible, even going so far as to hire veteran shipwrights from outside the thalassocracy."},{"name":"AHTBYRM","text":"Yet even with such unprecedented measures, there are never enough hands to handle the abundance of tasks. Should you choose to linger at the docks for a time, there is no end of odd jobs for a <span class=\"emphasis\">hardworking</span> adventurer. Be you fair warned─there is no place here for layabouts and troublemakers."}],"reward":{"gil":188,"items":[{"id":3770,"one":1},{"id":3769,"one":1},{"num":2,"id":5824,"one":1}],"xp":4200},"reqs":{"jobs":[{"lvl":10,"id":130}],"quests":[65939]},"next":[65948]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1002238","obj":{"i":1002238,"n":"Ahtbyrm","l":31,"q":5}},{"type":"item","id":"3770","obj":{"i":3770,"n":"Leather Jackboots","l":10,"c":46816,"t":38,"p":288}},{"type":"item","id":"3769","obj":{"i":3769,"n":"Amateur's Duckbills","l":10,"c":46109,"t":38,"p":230}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65939","obj":{"i":65939,"n":"Relighting the Torch","g":1,"l":"Western La Noscea","s":53}},{"type":"quest","id":"65948","obj":{"i":65948,"n":"Without a Doubt","g":1,"l":"Lower La Noscea","s":58}}]}