{"quest":{"name":"Constant Carvings","location":"Lower La Noscea","id":65947,"patch":2.0,"sort":130,"eventIcon":71221,"issuer":1002236,"target":1002236,"involved":[1002445],"genre":91,"journal":["Naldiq & Vymelli's veteran shipwright Mimidoa seeks someone to travel to Oschon's Torch in his stead.","Search the nearby hills for wild jackals and slay them for their fangs. Four fangs are required and only curved ones will suffice.","Deliver the four curved jackal fangs to a candlekeep stationed at Oschon's Torch named Rostn...something.","You have completed your delivery of the jackal fangs to Rostnzeh. Now return to Mimidoa at the Moraby Drydocks and inform him you fear for the candlekeep's sanity.","Mimidoa has shown genuine concern for Rostnzeh's mental state, and has already devised a plan to, shall we say, liven his spirits."],"objectives":["Slay wild jackals to obtain curved jackal fangs.","Deliver the jackal fangs to Rostnzeh.","Return to Mimidoa."],"dialogue":[{"name":"MIMIDOA","text":"What ye say? 'Nother 'nitiate, eh? 'Nitiate, ye say? Gettin' lots of 'nitiates these days. Lots of 'nitiates. What day ye say it was?"},{"name":"MIMIDOA","text":"Now, I reckon this 'nitiate's here lookin' fer work. Is it work ye seek, eh? Well, ye need not fret, as I just happen to have a task what needs tendin'. A dear friend of mine, Rostn...somethin'-or-such, is holed up in the lighthouse on this side of the Grip."},{"name":"MIMIDOA","text":"Used to be that I'd visit the lad once a sennight to see how he was farin', but me legs just ain't the same since the gout gone and grabbed hold of 'em."},{"name":"MIMIDOA","text":"I'd be grateful if ye could check up on the candlekeep in me stead. Oh, and don't ye be forgettin' to take along four curved jackal fangs. Tell him they's from Mimidoa. He'll understand."},{"name":"ROSTNZEH","text":"It can get right lonesome up here, all alone, with naught but the wind's chill to keep a man company. Some days, I carve jackal fangs to help clear me head of the voices─the voices callin' me back to the great blue..."},{"name":"ROSTNZEH","text":"What's this? Mimidoa send ye, did he?"},{"name":"ROSTNZEH","text":"Well, ye tell that old man that he needn't waste his few last suns in this realm worryin' 'bout poor Rostnzeh."},{"name":"ROSTNZEH","text":"I'll carry on as I always have, in the service of the sailors...alone till the day I die..."},{"name":"MIMIDOA","text":"Eh? Where'd ye crawl in from? I don't recall sendin' for no 'nitiates. Eh? <span class=\"highlight\">Forename Surname</span>? I once knew a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> named <span class=\"highlight\">Forename</span> back when I served on the <span class=\"emphasis\">Cloud Dancer</span>. <span class=\"alternative-container\"><span class=\"alternative\">She was a buxom young lass with eyes as big an' round as ogre pumpkins</span><span class=\"alternative\">He was a strappin' young lad with teeth as white as a princess's paps</span></span>. Ye ain't <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, though. Nose ain't quite right... And who are ye, again? Ah, got somethin' to tell me, has ye?"},{"name":"MIMIDOA","text":"Rostnzeh? What's that mumblin' milksop whinin' about this time? No, let me guess─that he's lonely? Bah! Put a pair of warm women in his arms and 'nother on his lap, and he'll be right as rain!"},{"name":"MIMIDOA","text":"'Tis what I do to help me forget that what ails me...not that ol' Mimidoa needs much help with forgettin', mind ye. Might be that I'll send him up a few saucy strumpets this comin' eve!"}],"reward":{"gil":220,"xp":3080},"reqs":{"jobs":[{"lvl":10,"id":1}]}},"partials":[{"type":"npc","id":"1002236","obj":{"i":1002236,"n":"Mimidoa","l":31,"q":1}},{"type":"npc","id":"1002445","obj":{"i":1002445,"n":"Rostnzeh","l":31,"q":2}}]}