{"quest":{"name":"Ancient Ways, Timeless Wants","location":"Limsa Lominsa","id":65958,"patch":2.55,"sort":94,"eventIcon":71201,"issuer":1011020,"target":1010897,"involved":[1000909,1010982,1010983],"genre":2,"journal":["Tataru is considering her next course of action, and how you might aid her in it.","Though Tataru has been forced to abandon her pursuit of a new profession, she would not see her brief sabbatical end without accomplishing something of note. Accordingly, she asks that you accompany her to Costa del Sol─though for what purpose she does not say.","Once more, you find Tataru dressed appropriately for the occasion─her goal this time being the procurement of pearls from clams native to Bloodshore. The endeavor is not without risk, however, as the clams are a favorite food of certain dangerous creatures. Follow Tataru to the sands below and see if she requires any assistance.","Fortune smiles on the young woman, as she soon uncovers a clam. While she works to remove the pearl within, stand watch for any creatures that might do her harm.","A ravenous serpent sets its sights on your friend and her prize, but you promptly slay it. Happily, Tataru appears to have completed her task─let her know that you have too.","Tataru reveals her intent to use the blood pearls she has harvested to fashion charms for her fellow Scions. In this way, she hopes to ensure that they will always come home. Having accomplished her task, she makes for Limsa Lominsa, where F'lhaminn awaits, and bids you return to Minfilia at the Rising Stones.","After listening to your account, Minfilia concludes that despite Tataru's failure to become an arcanist, she nevertheless benefited from the experience. With the benefit of hindsight, she suspects that the receptionist would have managed on her own...but is grateful that you indulged her request even so."],"objectives":["Speak with Tataru in Costa del Sol.","Speak with Tataru.","Stand guard as Tataru harvests pearls.","Speak with Tataru.","Speak with Minfilia at the Rising Stones."],"dialogue":[{"name":"TATARU","text":"&lt;sigh&gt; As fetching as these garments are, I fear I shall never don them again..."},{"name":"TATARU","text":"But I can't go back to the Rising Stones without <span class=\"emphasis\">something</span> to show for my time away."},{"name":"TATARU","text":"Wait─I know what I can do! That is, if you don't mind accompanying me for a little longer?"},{"name":"TATARU","text":"Wonderful! Then to Costa del Sol we will go! It's a bit of a gamble, but I'm confident it will pay off!"},{"name":"THUBYRGEIM","text":"Tataru is a bright, spirited girl. If she could but focus her nervous energy..."},{"name":"TATARU","text":"Yes, this is it! This is where the man at the Drowning Wench told me to look!"},{"name":"TATARU","text":"There is a certain variety of clam which can be harvested this time of year in Bloodshore─one which produces the most marvelous pearls!"},{"name":"TATARU","text":"However, these clams are also coveted by certain wild creatures─and since I fared rather poorly in battle last time... Ahem. Let us be off!"},{"name":"TATARU","text":"What fortune, I've already found one! Would you be so kind as to keep watch while I work? This should only take a moment..."},{"name":"TATARU","text":"Open...up...you little... Gah! This is proving more difficult than I thought..."},{"name":"TATARU","text":"Well fought, <span class=\"highlight\">Forename</span>, well fought! I knew I was right to ask you to come."},{"name":"TATARU","text":"As for me, I have my prize: a bounty of blood pearls!"},{"name":"TATARU","text":"So named for their reddish hue, they were treasured as wards against dark magicks in ancient times."},{"name":"TATARU","text":"I thought I might make charms for everyone...so that no matter where they go, they will always come home."},{"name":"TATARU","text":"It's <span class=\"emphasis\">sort of</span> the power to defend myself and other people...in a way. Right, well, I mustn't keep F'lhaminn waiting! There's work to be done─and lots of it!"},{"name":"TATARU","text":"We're to secure provisions for the Scions in the Lominsan markets. She may have an eye for quality, but I have a nose for bargains!"},{"name":"TATARU","text":"Will you be heading back to the Rising Stones? If so, pray convey my apologies to the Antecedent, and tell her that she needn't worry about me."},{"name":"TATARU","text":"Farewell, <span class=\"highlight\">Forename</span>, and thank you for everything!<br>Hmmm, that sounded rather final, didn't it? How about...until we meet again!"},{"name":"MINFILIA","text":"Welcome home, <span class=\"highlight\">Forename</span>. I gather you found Tataru in Limsa Lominsa?"},{"name":"MINFILIA","text":"My, it sounds as though she had quite an adventure. And while it did not end as she had hoped, I suspect that it will prove to be a valuable experience."},{"name":"MINFILIA","text":"I daresay she could have managed without our intervention. Even so, I appreciate you indulging my request."},{"name":"MINFILIA","text":"My, it sounds as though she had quite an adventure. And while it did not end as she had hoped, I suspect that it will prove to be a valuable experience. I daresay she could have managed without our intervention. Even so, I appreciate you indulging my request."},{"name":"MINFILIA","text":"I am sorry, <span class=\"highlight\">Forename</span>. No doubt you have other matters to attend to, and we have already imposed upon you so much. Pray take some time for yourself─I daresay you have more than earned a respite."},{"name":"MINFILIA","text":"After all, we will be most busy with preparations as the banquet draws near. Should other adventures summon you elsewhere, perhaps now is the time to heed their call?"},{"name":"SYSTEM","text":"In order to progress in the main scenario, you must first complete certain quests in the Crystal Tower series."},{"name":"SYSTEM","text":"The Crystal Tower quest series may be undertaken by speaking with the outlandish man in Revenant's Toll."}],"reward":{"gil":1343,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65957]},"next":[65961]},"partials":[{"type":"npc","id":"1011020","obj":{"i":1011020,"n":"Tataru","l":29,"q":1}},{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1010982","obj":{"i":1010982,"n":"Tataru","l":32,"q":1}},{"type":"npc","id":"1010983","obj":{"i":1010983,"n":"Tataru","l":32,"q":1}},{"type":"quest","id":"65957","obj":{"i":65957,"n":"An Unexpected Ambition","g":2,"l":"The Rising Stones","s":93}},{"type":"quest","id":"65961","obj":{"i":65961,"n":"A Time to Every Purpose","g":2,"l":"The Rising Stones","s":97}}]}