{"quest":{"name":"An Unexpected Ambition","location":"The Rising Stones","id":65957,"patch":2.55,"sort":93,"eventIcon":71201,"issuer":1010897,"target":1000909,"involved":[1008969,1010980,1010981],"genre":2,"journal":["Minfilia is at a loss for words.","Recalling a conversation with Urianger, Minfilia surmises that Tataru may have taken up the study of arcanima. Despite the young woman's declaration that she will return as receptionist and bodyguard both, the Antecedent cannot help but worry. To put Minfilia's mind at ease, journey to the Arcanists' Guild in Limsa Lominsa and search for Tataru.","You find Tataru on the practice floor of the Arcanists' Guild, sporting a brand-new ensemble and the same old enthusiastic expression. With obvious pride, she declares that she must undertake a special training exercise at Mistress Thubyrgeim's behest, and hurries off before you can respond. Given the circumstances, it may be prudent to ask the acting guildmaster what manner of training she has asked Tataru to complete.","Upon learning that you are a friend of Tataru's, Mistress Thubyrgeim shares her concerns regarding the young receptionist's potential as an arcanist─or lack thereof. She then implores you to oversee Tataru's training outside the city, south of the Zephyr Gate, in case something goes awry.","As you watch from a distance, Tataru approaches several crates in order to conduct a mock inspection. Wild beasts soon approach, and she steels herself for battle─only to be abandoned by her Carbuncle. Tataru has no choice but to flee, just as you have no choice but to follow.","Despite your carefully impassive expression, Tataru soon realizes that you bore witness to her shame. Crestfallen, she renounces arcanima and returns to the city. Though the trial ended in failure, Mistress Thubyrgeim should be glad to learn that her student did not come to harm.","Tataru returns to the guild shortly after you arrive and proceeds to deliver a scathing appraisal of her performance and general aptitude to a bemused Mistress Thubyrgeim. Before your young friend can heap further scorn upon herself, however, the acting guildmaster tells her not to lose sight of her strengths─to remember that, while there are studies at which she may not excel, there are others to which she is well suited. Though Tataru claims that she will take these words to heart, it is plain that her confidence has been dealt a crushing blow..."],"objectives":["Search for Tataru at the Arcanists' Guild.","Speak with Thubyrgeim.","Observe Tataru's training south of the Zephyr Gate.","Speak with Tataru.","Speak with Thubyrgeim."],"dialogue":[{"name":"MINFILIA","text":"The power to defend oneself...? Hmm. Tataru has ever been full of surprises."},{"name":"MINFILIA","text":"Now that I think on it, I do recall Urianger mentioning that she had developed an interest in arcanima..."},{"name":"MINFILIA","text":"Mayhap she hopes to gain admittance to the Arcanists' Guild in Limsa Lominsa? ...Yes, that will be the way of it."},{"name":"MINFILIA","text":"Would you be so kind as to journey to the guild and see that all is well? It is doubtless unwarranted─but surely I am not alone in my concern for her safety?"},{"name":"THUBYRGEIM","text":"Has she already gone downstairs? Enthusiasm is well and good, but in excess... &lt;sigh&gt; I pray I was not wrong."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>!? What are you doing here?"},{"name":"TATARU","text":"I didn't mean for her to worry... That's the last thing I wanted."},{"name":"TATARU","text":"Putting an end to such worries is precisely the reason I'm here, don't you see?"},{"name":"TATARU","text":"I, Tataru Taru, shall become a great and powerful arcanist!"},{"name":"TATARU","text":"And now, at Mistress Thubyrgeim's behest, I must go and complete a special training exercise! Until we meet again!"},{"name":"THUBYRGEIM","text":"Ah, if it isn't <span class=\"highlight\">Forename</span>. What brings you to the guild?"},{"name":"THUBYRGEIM","text":"...So you are acquainted with our newest member. &lt;sigh&gt; An arcanist of your experience must see that her potential is somewhat lacking."},{"name":"THUBYRGEIM","text":"Nevertheless, she would not be denied, and goes now to undertake her first trial: a simulated inspection of three crates. Doubtless you recall receiving similar training under K'lyhia's supervision?"},{"name":"THUBYRGEIM","text":"A thought occurs to me─why not oversee Tataru's training yourself? Given your relationship with the girl and your familiarity with the task, I think you the ideal choice. You need only head to the cliffs south of the Zephyr Gate, as before, and observe at a distance."},{"name":"THUBYRGEIM","text":"Yes? How may I assist you, <span class=\"highlight\">Forename</span>?"},{"name":"THUBYRGEIM","text":"...So you are acquainted with our newest member. &lt;sigh&gt; Mayhap you have already noticed, but I fear young Tataru's potential is somewhat lacking."},{"name":"THUBYRGEIM","text":"Nevertheless, she would not be denied, and goes now to undertake her first trial: a simulated inspection of three crates. A simple task, some might say, but one all arcanists are expected to complete."},{"name":"THUBYRGEIM","text":"A thought occurs to me─why not assist Tataru with her training? Given your relationship with the girl and your growing understanding of arcanima, you may prove a great help to her. Her trial will be conducted at the cliffs south of the Zephyr Gate. You need only observe at a distance."},{"name":"THUBYRGEIM","text":"Greetings, and welcome to the Arcanists' Guild. Do you require assistance?"},{"name":"THUBYRGEIM","text":"...So you are acquainted with our newest member. Hmm... I am sorry to be the bearer of bad news, but...I fear young Tataru may not be ideally suited to the study of arcanima."},{"name":"THUBYRGEIM","text":"Nevertheless, she would not be denied, and goes now to undertake her first trial: a simulated inspection of three crates. A simple task, some might say, but one all arcanists are expected to complete."},{"name":"THUBYRGEIM","text":"A thought occurs to me─why not supervise Tataru's training? You are clearly an accomplished adventurer, and given your relationship with the girl, you seem an ideal person to have on hand. Her trial will be conducted at the cliffs south of the Zephyr Gate. You need only observe at a distance."},{"name":"TATARU","text":"O'er azure seas to pirates' port,♪<br>Where she met her shining jewel...♪"},{"name":"TATARU","text":"For to bring the smugglers' plans to naught,♪<br>Came the lass whom none could fool!♪"},{"name":"TATARU","text":"Beat 'em with a Backdraft!♪<br>Gut 'em with a Gust!♪<br>Deck 'em with a Downburst!♪<br>Go, Carbuncle, go!♪"},{"name":"TATARU","text":"O～hohoho! Are those <span class=\"emphasis\">crates</span> I spy?"},{"name":"TATARU","text":"Ah, and <span class=\"emphasis\">this</span> must be the true test! But we're ready for them, aren't we, Carbuncle!?"},{"name":"TATARU","text":"...Carbuncle?"},{"name":"TATARU","text":"Uwaaah! Come back, Carbuncle! Come baaack!"},{"name":"TATARU","text":"I should've known you'd come, <span class=\"highlight\">Forename</span>."},{"name":"TATARU","text":"You needn't say a word─your face says it all. I know you bore witness to my shame."},{"name":"TATARU","text":"&lt;sniffle&gt; Betrayed by my own Carbuncle and left at the mercy of wild beasts..."},{"name":"TATARU","text":"I...I must accept the truth. I'll never be a warrior like you or the others."},{"name":"TATARU","text":"I will inform Mistress Thubyrgeim of my intention to withdraw from the guild. Arcanima...like so much else...is beyond me."},{"name":"THUBYRGEIM","text":"Ah, back so soon? How fared our fledgling arcanist?"},{"name":"TATARU","text":"<span class=\"emphasis\">Abysmally</span>, Mistress Thubyrgeim, abysmally─as <span class=\"highlight\">Forename</span> will testify."},{"name":"TATARU","text":"I was wrong to become an arcanist. Wrong as usual. I am completely and utterly unqualified, and I sincerely apologize for wasting your time."},{"name":"THUBYRGEIM","text":"...Tataru. If that were true, I would not have permitted you to join in the first place."},{"name":"THUBYRGEIM","text":"We must all come to accept our limitations, lest our ambitions lead us astray. However, we must not lose sight of our strengths in the process."},{"name":"THUBYRGEIM","text":"For example, your exceptional skill with numbers helped you to gain a solid grasp of the fundamentals of arcanima. Were it not so, you would have struggled even to summon Carbuncle to your side."},{"name":"THUBYRGEIM","text":"In my opinion, the Scions are truly fortunate to have such a capable and good-natured receptionist in their service. Would you not agree?"},{"name":"TATARU","text":"You are too kind, Mistress Thubyrgeim. Though I could not overcome this challenge, I shall take your words to heart and try not to be discouraged."}],"reward":{"gil":961,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65956]},"next":[65958]},"partials":[{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010980","obj":{"i":1010980,"n":"Tataru","l":29,"q":1}},{"type":"npc","id":"1010981","obj":{"i":1010981,"n":"Tataru","l":30,"q":1}},{"type":"quest","id":"65956","obj":{"i":65956,"n":"Administrative Decision","g":2,"l":"The Rising Stones","s":92}},{"type":"quest","id":"65958","obj":{"i":65958,"n":"Ancient Ways, Timeless Wants","g":2,"l":"Limsa Lominsa","s":94}}]}