{"quest":{"name":"Victory in Peril","location":"Lower La Noscea","id":65950,"patch":2.0,"sort":76,"icon":100096,"eventIcon":71201,"issuer":1002237,"target":1002237,"involved":[1002229,1002238,1002240,1002651],"genre":1,"journal":["Ghimthota, a captain of the watch at the Moraby Drydocks, wishes your aid in dealing with potential intruders.","Ghimthota is convinced that a gang of treacherous pirates aims to sabotage the construction of the <span class=\"emphasis\">Victory</span>. Speak with either Urswyrst at the front gate or C'nangho at the rear gate to learn of any suspicious activity.","You have spoken with one of the guards and heard a report concerning a possible saboteur. Make your way to the cliff at Empty Heart and learn what trouble is afoot.","You have confronted the suspicious sailor, and he leaves you with words that send a chill down your spine. Hurry back to the Drydocks and report to Ghimthota.","You have succeeded in preventing the destruction of the <span class=\"emphasis\">Victory</span>. It has come to light, however, that the leader of the pirates, Ahtzapfyn, is actually Ahtbyrm's father. Speak with the troubled foreman, and see how he fares.","Though he puts on a brave face, it is clear that Ahtbyrm is deeply shaken by his father's unexpected appearance. Return to Ghimthota and convey Ahtbyrm's gratitude and apologies.","Ghimthota appears convinced that a swift return to work on the <span class=\"emphasis\">Victory</span> will soon ease Ahtbyrm's troubled heart. The watch captain thanks you for your assistance, and mentions that the would-be saboteurs have been handed over to the Yellowjackets. There has, however, been an important discovery that she would like to discuss with you."],"objectives":["Speak with one of the guards.","Find the shifty-eyed sailor.","Report to Ghimthota at the Moraby Drydocks.","Speak with Ahtbyrm.","Speak with Ghimthota."],"dialogue":[{"name":"GHIMTHOTA","text":"I am concerned, <span class=\"highlight\">Forename</span>. It appears that the pirates I had you investigate are on the move."},{"name":"GHIMTHOTA","text":"They creep ever closer to the Drydocks, so I must assume they mean to target the <span class=\"emphasis\">Victory</span> herself."},{"name":"GHIMTHOTA","text":"That ship is the symbol of everything Limsa Lominsa strives to become, and I will not allow these base scoundrels to lay a single finger upon her hull."},{"name":"GHIMTHOTA","text":"We must apprehend them before they put their plans into motion! And you, <span class=\"highlight\">Forename</span>, are just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to do it."},{"name":"GHIMTHOTA","text":"Without your capable assistance, I fear the security of the Drydocks cannot be guaranteed."},{"name":"GHIMTHOTA","text":"Not moments ago, my guards submitted reports of suspicious activity in the area. Pray begin your efforts by listening to one of their accounts firsthand."},{"name":"GHIMTHOTA","text":"It matters not whom you choose to speak with, but be sure to question either Urswyrst at the front gate or C'nangho at the rear."},{"name":"GHIMTHOTA","text":"Any suspect saboteurs you encounter during the course of your investigation are to be interrogated. Report any and all findings directly to me."},{"name":"URSWYRST","text":"Ghimthota sent you to follow up on my report?"},{"name":"URSWYRST","text":"Well, it was not too long ago that I saw some unsavory sort slinking along the top of the bluff near Empty Heart, just over yonder."},{"name":"URSWYRST","text":"It may be that he's still about. If you've got the time, adventurer, I'd much appreciate you getting up there to take a look."},{"name":"CNANGHO","text":"Hail, adventurer. Glad to have another hand aboard to help shore up security."},{"name":"CNANGHO","text":"The gods know our reports would sit on Ghimthota's desk gathering dust if it weren't for the assistance of those such as yourself."},{"name":"CNANGHO","text":"Speaking of reports, though, I saw one of those mangy pirates lurking around the cliff near Empty Heart. I'd take a closer look before he has a chance to cover his tracks."},{"name":"CORSAIRFOLLOWA","text":"Bah, spotted me, did ye? Well, yer too late─what's to 'appen is already 'appenin'."},{"name":"Q1","text":"Duty calls. Do you wish to proceed with<br>“Victory in Peril”?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"GHIMTHOTA","text":"So, you found me one of those pirates, did you?"},{"name":"GHIMTHOTA","text":"I knew you were the right adventurer to ask for aid."},{"name":"GHIMTHOTA","text":"But what could these knaves be planning? “What's to happen is already happening”...?"},{"name":"MAELSTROM","text":"Captain! Ungh... Trouble...at the shipyard... &lt;pant&gt;"},{"name":"GHIMTHOTA","text":"Easy now, soldier. Who did this to you?"},{"name":"MAELSTROM","text":"&lt;pant&gt; Pirates... Out of nowhere... &lt;cough&gt; Stuck me good..."},{"name":"GHIMTHOTA","text":"Gods below, we are not prepared for this!"},{"name":"GHIMTHOTA","text":"The pirates, soldier, how many do they number?"},{"name":"MAELSTROM","text":"Not sure... More than I could quickly count... Seemed to be carrying...explosives..."},{"name":"GHIMTHOTA","text":"Explosives!? Then there is no time to lose!"},{"name":"GHIMTHOTA","text":"<span class=\"highlight\">Forename</span>, you heard the situation. Make your way to the shipyard and engage these intruders!"},{"name":"GHIMTHOTA","text":"I will see to this man's wounds, then follow after."},{"name":"GHIMTHOTA","text":"Make haste, now!"},{"name":"AHTZAPFYN","text":"Gahahaha! Never reckoned it'd be this easy! Still don't trust those slimy bastards, but their plan worked like a charm!"},{"name":"AHTBYRM","text":"Da! What are you doing, you great bloody fool!?"},{"name":"AHTZAPFYN","text":"Shut yer trap, boy."},{"name":"AHTZAPFYN","text":"This'll all be over soon. All that's left now is to blow this ugly pile o' driftwood into splinters."},{"name":"AHTBYRM","text":"Why would you do such a thing!? Have you any idea how important this ship is? What it represents?"},{"name":"AHTZAPFYN","text":"Aye, an' that's what makes it all the sweeter! Whatever it takes to knock some sense into me treacherous, backstabbin' son!"},{"name":"AHTZAPFYN","text":"Imagine, a boy o' <span class=\"emphasis\">mine</span> givin' up the pirate life to become a shipwright! An' buildin' a bleedin' Maelstrom vessel at that! What under Llymlaen's wide, green ocean made ye take up with these self-righteous shites!?"},{"name":"AHTBYRM","text":"You're the one with no bloody sense, Da! Don't you see? The pirates had their glory days, but that era is over!"},{"name":"GHIMTHOTA","text":"Ah! I wondered why Ahtbyrm never spoke of his father. I never would have thought..."},{"name":"AHTZAPFYN","text":"This ship's a symbol alright─of everythin' what went wrong with the world. An' I mean to shatter it into a hunnerd thousand pieces!"},{"name":"71","text":"Ghimthota! <span class=\"highlight\">Forename</span>! Pray beat the tar out of this bloated sea slug, and make sure no harm comes to the <span class=\"emphasis\">Victory</span>!"},{"name":"AHTZAPFYN","text":"I...I must be gettin' old, lettin' some green 'venturer get the best o' me."},{"name":"AHTBYRM","text":"Da..."},{"name":"AHTZAPFYN","text":"&lt;cough&gt; That's one big bloody ship. Big...an' nasty lookin'. Ye made that, did ye...?"},{"name":"AHTBYRM","text":"My thanks, <span class=\"highlight\">Forename</span>. I shudder to think what may have become of the <span class=\"emphasis\">Victory</span> without your intervention."},{"name":"AHTBYRM","text":"&lt;sigh&gt; The pirates have made a right mess of things─I'd best get to sorting out the docks."},{"name":"AHTBYRM","text":"...And my thoughts could use some sorting out as well. Ever did my father have a way of turning my life upside down."},{"name":"AHTBYRM","text":"Pray convey my thanks─and my apologies─to Ghimthota."},{"name":"GHIMTHOTA","text":"How fare you, <span class=\"highlight\">Forename</span>? I cannot begin to thank you for the role you played in preventing this madness."},{"name":"GHIMTHOTA","text":"You defended more than a simple ship─you saved the budding hope of Limsa Lominsa from a violent demise. The day was yours."},{"name":"GHIMTHOTA","text":"It seems our security regimen will require much in the way of improvement if we are to truly keep the Drydocks safe."},{"name":"GHIMTHOTA","text":"...Ahtbyrm apologizes? Well, I suppose I can understand why he would feel responsible for his father's actions. Of all those involved, this incident was hardest on him."},{"name":"GHIMTHOTA","text":"But, in time, I believe he will come to a single conclusion: the most fitting way of moving past his anguish is to see the <span class=\"emphasis\">Victory</span> completed and in the water."},{"name":"GHIMTHOTA","text":"Ah, by the by, the pirates we defeated have been handed over to the Yellowjackets. Reyner's men will be taking over the investigation."},{"name":"GHIMTHOTA","text":"Before the Yellowjackets moved in, however, we recovered a most unusual object. Should you have the time to spare, I would ask of you another favor..."},{"name":"QIB","text":"Defeat the pirates and protect the <span class=\"emphasis\">Victory</span>!"},{"name":"AHTBYRM","text":"Da, this is madness!"},{"name":"AHTZAPFYN","text":"A pirate don't abandon 'is treasures!"},{"name":"AHTBYRM","text":"My father... You must stop him!"},{"name":"GHIMTHOTA","text":"Leave him to us.<br><span class=\"highlight\">Forename</span>, C'nangho, to me!"},{"name":"MAMOOJA","text":"As we agreed, Ahtzapfyn!"},{"name":"CNANGHO","text":"Mamool Ja mercenaries!?"},{"name":"GHIMTHOTA","text":"I'll take the Mamool Ja. You focus on Ahtzapfyn."},{"name":"AHTZAPFYN","text":"Ye've no idea who yer up against!"},{"name":"AHTZAPFYN","text":"Now, outta me damn way!"},{"name":"AHTBYRM","text":"Please! You cannot let him win!"},{"name":"CNANGHO","text":"Ware, adventurer!<br>Ahtzapfyn has a crazy glint in his eye..."},{"name":"GHIMTHOTA","text":"Protect the ship..."},{"name":"CNANGHO","text":"Captain, I...ugh..."}],"reward":{"gil":212,"items":[{"num":5,"id":4564}],"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65949]},"next":[66225]},"partials":[{"type":"npc","id":"1002237","obj":{"i":1002237,"n":"Ghimthota","l":31,"q":4,"t":"Storm Captain"}},{"type":"npc","id":"1002229","obj":{"i":1002229,"n":"Urswyrst","l":31,"q":1,"t":"Storm Private"}},{"type":"npc","id":"1002238","obj":{"i":1002238,"n":"Ahtbyrm","l":31,"q":5}},{"type":"npc","id":"1002240","obj":{"i":1002240,"n":"C'nangho","l":31,"q":2,"t":"Storm Private"}},{"type":"npc","id":"1002651","obj":{"i":1002651,"n":"Shifty-eyed Sailor","l":31,"q":1}},{"type":"item","id":"4564","obj":{"i":4564,"n":"Antidote","l":10,"c":20641,"t":44,"p":39}},{"type":"quest","id":"65949","obj":{"i":65949,"n":"Do Angry Pirates Dream","g":1,"l":"Lower La Noscea","s":66}},{"type":"quest","id":"66225","obj":{"i":66225,"n":"Men of the Blue Tattoos","g":1,"l":"Lower La Noscea","s":77}}]}