{"quest":{"name":"Administrative Decision","location":"The Rising Stones","id":65956,"patch":2.55,"sort":92,"eventIcon":71201,"issuer":1010897,"target":1008969,"involved":[1010979,1010999,1011612],"genre":2,"journal":["Minfilia seems loath to put you to further trouble so soon after your last great exertion.","Though she had hoped to grant you some respite after your exertions in Ishgard, an unexpected invitation from Ul'dah compels Minfilia to beg your assistance once more. A feast is being held to celebrate Ishgard's victory, and it would seem the Scions are expected to attend. Though Tataru wastes no time making the necessary arrangements, her uncharacteristic sighs tell Minfilia that something is amiss. Look for the troubled receptionist at her desk outside the solar.","You search for Tataru, but find her desk unattended. Mayhap F'lhaminn knows of her whereabouts.","F'lhaminn informs you that Tataru recently left through the front door of the Rising Stones, sighing as she went. Head out into Revenant's Toll and search for the receptionist.","You find Tataru alone, grappling with a problem she feels unable to share. After drawing encouragement from your stoic presence, however, she decides to bring the issue to the Antecedent. Return to the Rising Stones and speak with Minfilia.","Citing a need for some measure of martial prowess, Tataru requests a leave of absence to study her chosen discipline. Just as the determined Lalafell is departing, Hoary Boulder arrives to petition the Antecedent with a request of his own. It would seem that the adventurer assigned to his escort party has been seriously injured, leaving them in need of a replacement guard..."],"objectives":["Look for Tataru at her desk.","Speak with F'lhaminn.","Search for Tataru in Revenant's Toll.","Speak with Minfilia at the Rising Stones."],"dialogue":[{"name":"MINFILIA","text":"You must be weary, <span class=\"highlight\">Forename</span>. And now may very well be your only chance to─"},{"name":"TATARU","text":"Antecedent!"},{"name":"TATARU","text":"A messenger from Ul'dah arrived with a missive for you."},{"name":"MINFILIA","text":"...The royal seal. Curious indeed..."},{"name":"MINFILIA","text":"...Ah. An invitation."},{"name":"MINFILIA","text":"“On behalf of the Council of the Eorzean Alliance, Her Royal Majesty Nanamo Ul Namo invites the Scions of the Seventh Dawn to attend a feast at the Royal Palace of Ul'dah...in honor of Ishgard's recent victory.”"},{"name":"MINFILIA","text":"It would seem we are to be recognized for our part in lifting the siege─you, for your valiant efforts as commander of the adventurers' contingent, and the Archons for their earnest attempts to rouse the city–states."},{"name":"MINFILIA","text":"Truly, I find it strange that the Alliance leaders should think themselves deserving of a place at such a celebration."},{"name":"MINFILIA","text":"All three refused to deploy their standing armies, preferring to send hastily assembled companies of sellswords, many of whom perished ere the siege began. Are they truly so brazen as to seek to share in the glory of your triumph?"},{"name":"MINFILIA","text":"Ah, but mayhap they simply seek a pretext to meet with the Ishgardians while the mood is yet jubilant... Such an occasion would present a fine opportunity to press for Ishgard's return to the Eorzean Alliance."},{"name":"MINFILIA","text":"&lt;sigh&gt; We have scarce had time to mourn Moenbryda, and I, for one, am in no mood to carouse. But I suppose we must put away our grief for the good of the realm."},{"name":"MINFILIA","text":"Though you were promised rest, I fear I must insist that you also attend. It would be a strange celebration indeed if the victorious hero were not present. Pray content yourself with the thought that such occasions may bring about momentous change─and this without recourse to bloodshed."},{"name":"MINFILIA","text":"Tataru, if you would do me the favor of contacting the rest of the Scions?"},{"name":"TATARU","text":"Of course, Antecedent."},{"name":"TATARU","text":"And please let me know if there's anything else I can do.<br><br>&lt;sigh&gt;"},{"name":"MINFILIA","text":"Curious... I have never known Tataru to sigh at such requests. Could aught be amiss?"},{"name":"MINFILIA","text":"Tataru is troubled, I am certain of it. Would you mind speaking with her? I fear any concern I show will be met with stoic denials."},{"name":"SYSTEM","text":"Tataru is conspicuous by her absence..."},{"name":"FLHAMINN","text":"Tataru? I believe she just stepped outside."},{"name":"FLHAMINN","text":"Now that I think on it, she did seem rather preoccupied..."},{"name":"TATARU","text":"Oh, <span class=\"highlight\">Forename</span>─it's you. I didn't mean to worry anyone. It's nothing, really..."},{"name":"TATARU","text":"Well, it's not <span class=\"emphasis\">nothing</span> exactly... But it feels like nothing compared to the towering trials you and the others face every day."},{"name":"TATARU","text":"...And that's why I should probably talk to Minfilia before things get any worse! Ah, you always know what to say, <span class=\"highlight\">Forename</span>! I'm glad we had this little chat!"},{"name":"TATARU","text":"My mind is made up..."},{"name":"MINFILIA","text":"Yes, Tataru? You have my undivided attention."},{"name":"TATARU","text":"I've been hesitant to broach the subject, what with all the recent excitement, but <span class=\"highlight\">Forename</span> made me realize that there's no time like the present. ...And time is what I'm here to ask you for!"},{"name":"MINFILIA","text":"I am not sure I understand. If you wish to be excused from your duties for a time, then you have certainly earned the rest."},{"name":"MINFILIA","text":"...But I suspect that lying abed is far from your intent."},{"name":"TATARU","text":"You know me too well, Antecedent. There is, in fact, something I've been wanting to try my hand at."},{"name":"TATARU","text":"Along with the adventurers and the Crystal Braves, the Scions are constantly being thrown into dangerous battles and deadly predicaments."},{"name":"TATARU","text":"Even Hoary Boulder and Coultenet have been promoted from guard duty to fill our need for competent warriors..."},{"name":"TATARU","text":"And so it seems only right that I, too, should acquire the power to defend myself! And <span class=\"emphasis\">others</span>, more importantly! When I return, I shall be both your receptionist <span class=\"emphasis\">and</span> your bodyguard!"},{"name":"HOARYBOULDER","text":"Whoa─hey!"},{"name":"HOARYBOULDER","text":"That's the first time I've almost been knocked to the ground by a Lalafell! I've never seen Miss Tataru so determined. Has aught befell with which I might help, Antecedent?"},{"name":"MINFILIA","text":"Ah, not at present, thank you. ...Was there something you would ask of me?"},{"name":"HOARYBOULDER","text":"Oh, yes! Pray excuse my distraction. An adventurer who was to join us for escort duty was injured while out on patrol."},{"name":"HOARYBOULDER","text":"And I fear we cannot properly defend the scholars entrusted to our protection without the aid of at least one more guard..."},{"name":"HOARYBOULDER","text":"Therefore, I humbly request that another adventurer─of the capable kind, of course─be assigned to our party."},{"name":"MINFILIA","text":"Very well. I shall consider the potential candidates and provide you with a replacement as soon as I am able."},{"name":"HOARYBOULDER","text":"My thanks, Antecedent. I take my leave of you."}],"reward":{"gil":517,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[70127]},"next":[65957,65959]},"partials":[{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010979","obj":{"i":1010979,"n":"Tataru","l":67,"q":1}},{"type":"npc","id":"1010999","obj":{"i":1010999,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1011612","obj":{"i":1011612,"n":"F'lhaminn","l":481,"q":1}},{"type":"quest","id":"70127","obj":{"i":70127,"n":"The Steps of Faith","g":2,"l":"Coerthas Central Highlands","s":91}},{"type":"quest","id":"65957","obj":{"i":65957,"n":"An Unexpected Ambition","g":2,"l":"The Rising Stones","s":93}},{"type":"quest","id":"65959","obj":{"i":65959,"n":"Where We Are Needed","g":2,"l":"The Rising Stones","s":95}}]}