{"quest":{"name":"Say It with Flowers","location":"Lower La Noscea","id":65953,"patch":2.0,"sort":130,"eventIcon":71221,"issuer":1002445,"target":1002237,"genre":91,"journal":["Rostnzeh yearns to profess his love to a certain special someone, and requires your help to do so.","Rostnzeh has asked you to tell Moraby Drydocks guard Ghimthota of his feelings for her, and to do it with a single La Noscean lilybell. This common flower can be found growing near the lakeside in Empty Heart.","You find a La Noscean lilybell, only to be ambushed by a pair of frenzied landtraps. Luckily, the seedkin are no match for you. Now hurry to Ghimthota at the Moraby Drydocks before the flower withers.","You deliver the lilybell to Ghimthota, only to learn that she has made a vow to another─her duty."],"objectives":["Search Empty Heart for a La Noscean lilybell.","Deliver the lilybell to Ghimthota at the Moraby Drydocks."],"dialogue":[{"name":"ROSTNZEH","text":"Whilst the carvin's help keep me head clear, a bit o' company would ease the solitude. Truth is, with each turn o' the sun I creep ever closer to the brink o' madness."},{"name":"ROSTNZEH","text":"All day and all night, I dream of someone who might rescue me from this prison. Someone broad and hale, with skin the color of the sea, and eyes what'll suck you in like a maelstrom... Someone like Ghimthota..."},{"name":"ROSTNZEH","text":"I's been enchanted by her sweet magicks since I first saw her─a young lass from the Moraby Drydocks on patrol of the Gods' Grip. She smiled at me, but I was too et up inside by fear to meet her gaze. And now, since her promotion to head watch, she can't be bothered to make the climb."},{"name":"ROSTNZEH","text":"I would tell her how it is I feel...but me duty to the sailors─ Wait! Might be <span class=\"emphasis\">you</span> could tell her for me! I'd make it worth yer while. Ye could take her a nice La Noscean lilybell. You think she'd like that? Aye, I reckon she'd like that. Ain't met a woman what didn't like flowers."},{"name":"GHIMTHOTA","text":"A gift for <span class=\"emphasis\">me</span> from the candlekeep at Oschon's Torch? But I don't recall ever meeting anyone─"},{"name":"GHIMTHOTA","text":"Ah, a La Noscean lilybell... Yes, it's coming back to me now. Rostnzeh, I believe his name was. I remember specifically commenting on how I despised my patrols through the Gods' Grip for the area is full of La Noscean lilybells, and the terrible weeds always send me into sneezing fits."},{"name":"GHIMTHOTA","text":"While I am...uh, flattered, I'm afraid I cannot return the gesture. As head watch of the Moraby Drydocks, it is my responsibility to see that the peace is kept until the <span class=\"emphasis\">Victory</span>'s christening. I simply haven't the time to pay would-be suitors any mind, no matter how desperate they may be."},{"name":"GHIMTHOTA","text":"Though...perhaps once the ship is complete, I <span class=\"emphasis\">could</span> consider a climb up the peninsula...perhaps."},{"name":"SYSTEM","text":"A pair of creatures have been drawn to the fragrant scent of the lilybell!"}],"reward":{"items":[{"id":27636,"one":1},{"id":3320,"one":1},{"num":2,"id":5824,"one":1}],"xp":3080},"reqs":{"jobs":[{"lvl":10,"id":1}]}},"partials":[{"type":"npc","id":"1002445","obj":{"i":1002445,"n":"Rostnzeh","l":31,"q":2}},{"type":"npc","id":"1002237","obj":{"i":1002237,"n":"Ghimthota","l":31,"q":4,"t":"Storm Captain"}},{"type":"item","id":"27636","obj":{"i":27636,"n":"Hard Leather Kecks","l":12,"c":45099,"t":36}},{"type":"item","id":"3320","obj":{"i":3320,"n":"Striped Cotton Slops","l":13,"c":45296,"t":36,"p":297}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}