{"quest":{"name":"Come, but Not Gone","location":"Ul'dah","id":65962,"patch":2.55,"sort":98,"eventIcon":71201,"issuer":1010992,"target":1001353,"involved":[1010993,1010994,1010995,1010996,1011623],"genre":2,"journal":["A hero must go where'er <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is needed, and according to Minfilia, you are needed elsewhere.","It would seem that a matter at the Quicksand requires your immediate attention. Minfilia asks that you make your way to the Steps of Nald and speak with Momodi, before joining her and the other Scions in the Fragrant Chamber.","By way of Momodi, Alianne of the 4th has requested a private meeting so that she might show you something of importance. According to the proprietress' account, the lieutenant appeared to be deeply troubled... Journey to the station west of the Coffer & Coffin and await her arrival as instructed.","You stand in plain view and patiently wait for Alianne to appear. As the minutes roll by, however, you begin to wonder at her whereabouts.","After a further indeterminate period of waiting, you come to doubt that Alianne will ever arrive. No sooner has the thought entered your mind than you chance to catch sight of a vial at your feet. Though it may be no more than discarded refuse, it does not appear to have lain there for long...","As you puzzle over the significance of the vial, a familiar voice reaches your ears. Laurentius, another man you personally recruited to the Crystal Braves, is surprised to see you out in the field so soon before the royal banquet. He tells you that he has seen no sign of Alianne on his patrol, but reassures you that if he does happen to meet with her, he will tell her that you waited. Time is growing short, yet something about the vial troubles you. Perhaps Momodi will know what to make of it.","Momodi can offer little insight into the vial, save that it resembles those used by alchemists. Like Laurentius, she implores you not to worry about Alianne, and to turn your thoughts to more pressing matters."],"objectives":["Speak with Momodi at the Quicksand.","Rendezvous with Alianne in central Thanalan.","Continue waiting for Alianne.","Pick up the clouded vial.","Show the clouded vial to Momodi."],"dialogue":[{"name":"MINFILIA","text":"We will go on ahead, <span class=\"highlight\">Forename</span>. Pray join us once matters at the Quicksand are resolved."},{"name":"THANCRED","text":"Give my regards to Momodi, and let her know that I will call upon her anon."},{"name":"YSHTOLA","text":"If I did not know better, I should think our bard had run afoul of another jilted lover..."},{"name":"THANCRED","text":"Is that...? No, just my imagination."},{"name":"THANCRED","text":"Oh, pay no attention to me. 'Tis a habit from my misspent youth, looking over my shoulder from time to time."},{"name":"YDA","text":"Food then dancing...or dancing then food? Or food then dancing then more food? Hmm..."},{"name":"PAPALYMO","text":"I do hope Yda is not under the impression that we are here to make merry. We are ostensibly the Antecedent's escort, after all."},{"name":"MOMODI","text":"I appreciate you droppin' in on such short notice, <span class=\"highlight\">Forename</span>. I know you've got places to be, so I won't waste your time."},{"name":"MOMODI","text":"You're friends with a Crystal Brave by the name of Alianne, aren't you? Former adventurer? Come to think of it, I'm pretty sure you recruited her yourself."},{"name":"MOMODI","text":"Well anyway, she came 'round for a meal not long ago, and before she left, she asked me to give you a message. Said if the others ended up draggin' you to the feast, I was to see you got it before you made your grand entrance."},{"name":"MOMODI","text":"“Meet me at the station west of the Coffer & Coffin. There's something I must show you.”"},{"name":"MOMODI","text":"A short message, I'll grant you, but she thought long and hard before pickin' those words. Barely touched her food, too. Under other circumstances, I'd've thought those signs of a troubled heart, but somethin' tells me she ain't plannin' to <span class=\"alternative-container\"><span class=\"alternative\">ask your thoughts on a gentleman caller</span><span class=\"alternative\">confess her undyin' love</span></span>."},{"name":"MOMODI","text":"Best not keep Alianne waitin'─or your friends at the feast, for that matter."},{"name":"SYSTEM","text":"As you stand upon the platform, your thoughts begin to wander...and all too soon, the ghosts of comrades lost and enemies slain begin to file by your mind's eye in solemn procession... Clearing your head, you scan the horizon, but see no sign of Alianne."},{"name":"SYSTEM","text":"Straining your ears to listen, you hear the chatter of Qiqirn and the buzzing of syrphids, but no approaching footfall. Sighing, you bow your head...only to notice the vial lying at your feet."},{"name":"LAURENTIUS","text":"<span class=\"highlight\">Forename</span>, is that you? What brings you out this way?"},{"name":"LAURENTIUS","text":"Lieutenant Alianne? Why no, I haven't seen her about..."},{"name":"LAURENTIUS","text":"Had she come this way, I guarantee we would have crossed paths. I must have passed this spot a dozen times."},{"name":"LAURENTIUS","text":"We're to patrol the city's environs, on account of the royal banquet. Captain's orders, you understand. Speaking of which─isn't it about to begin?"},{"name":"LAURENTIUS","text":"You should be with the other honored guests, enjoying your well-deserved respite. Aye, pray return to Ul'dah, <span class=\"highlight\">Forename</span>. If I chance to meet the lieutenant, I will tell her you were here."},{"name":"LAURENTIUS","text":"Gods, I envy you. All that food and wine... But I cannot think of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> more deserving. Enjoy the feast, <span class=\"highlight\">Forename</span>─you've earned it."},{"name":"MOMODI","text":"I reckoned you'd head straight to the feast after meetin' with Alianne. What's the matter? No appetite?"},{"name":"MOMODI","text":"...So she wasn't there, but <span class=\"emphasis\">this</span> was, eh? Let's see..."},{"name":"MOMODI","text":"Hmmm...looks to me like an alchemist's vial, but beyond that, I can't say. Might be best if you hold on to it for safekeepin', though."},{"name":"MOMODI","text":"Anyroad, no use worryin' about Alianne. I'm sure she'll turn up before too long, and when she does, we'll soon find out what this was all in aid of. Besides─you've got more important things to think about."}],"reward":{"gil":869,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65961]},"next":[65963]},"partials":[{"type":"npc","id":"1010992","obj":{"i":1010992,"n":"Minfilia","l":41,"q":2}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1010993","obj":{"i":1010993,"n":"Thancred","l":41,"q":2}},{"type":"npc","id":"1010994","obj":{"i":1010994,"n":"Y'shtola","l":41,"q":2}},{"type":"npc","id":"1010995","obj":{"i":1010995,"n":"Yda","l":41,"q":2}},{"type":"npc","id":"1010996","obj":{"i":1010996,"n":"Papalymo","l":41,"q":2}},{"type":"npc","id":"1011623","obj":{"i":1011623,"n":"Laurentius","l":43,"q":1}},{"type":"quest","id":"65961","obj":{"i":65961,"n":"A Time to Every Purpose","g":2,"l":"The Rising Stones","s":97}},{"type":"quest","id":"65963","obj":{"i":65963,"n":"The Parting Glass","g":2,"l":"Ul'dah","s":99}}]}