{"quest":{"name":"A Legend for a Legend","location":"Mor Dhona","id":65968,"patch":2.5,"sort":10,"eventIcon":71221,"issuer":1008278,"genre":95,"journal":["The wandering minstrel of Revenant's Toll would like you to wet his whistle.","Much has the wandering minstrel heard of your legendary deeds, but he is more interested in your knowledge of legendary steeds. Upon discovering that you have a full stable of magicked mounts at your beck and call, a revelation dawns on him: could you be the one of whom the ancient hermit spoke, all those years ago? The one who can sound the mystic whistle he has carried with him ever since, and call forth the beast of legend? Convinced that this hero is you, he bids you take the pipe to a suitable stage─the crystal cliffs of Rathefrost─and blow with all your might.","You climb the glowing pathway to the Rathefrost cliffs, and blow the magicked dizi beneath the crystal branches. As its piercing note echoes in the air, a mythical Kirin appears before your very eyes. The minstrel emerges from his hiding place, full awed by the sight of the legendary beast, and declares that his word was true: you are indeed the hero to whom the Kirin has pledged its fealty. Whensoever you call upon it with a blast from the whistle, the immortal beast will return to you from its otherworldly kingdom, and whisk you wheresoever you please. And so a new chapter in your epic saga begins..."],"objectives":["Travel to Rathefrost and blow the magicked dizi at the designated location."],"dialogue":[{"name":"WANDERINGMINSTREL","text":"How good it is to see you again, <span class=\"highlight\">Forename</span>! Little have I had to wander in search of inspiration these past moons, for the very air resounds with word of your valorous deeds. Are the rumors true? The primals of Eorzea resurrected in ever more ferocious forms, only to meet a swift end at your hand?"},{"name":"WANDERINGMINSTREL","text":"I-It is <span class=\"emphasis\">you</span>! How well my words captured your steely eye, your straining thew, your indomitable brow! Are you not the hero of whose valorous deeds the very air resounds? The bane of primals summoned to plague these lands in ever more ferocious forms?"},{"name":"WANDERINGMINSTREL","text":"I knew it! But tell me: in your forays among the beast tribes, did you ever come across a <span class=\"emphasis\">nightmare</span>? Steeds of darkness, gifted to the beast tribes by the servants of evil as mounts for their unholy armies. ...Or so the rumors have it, for neither sable hide nor inky hair have I seen firsthand."},{"name":"WANDERINGMINSTREL","text":"You have not only seen these fell beasts, but <span class=\"emphasis\">tamed</span> them? Even the fabled magicked steeds consecrated by the primals themselves!? I can scarce believe it possible... Yet if any <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> is capable of the feat, it is you."},{"name":"WANDERINGMINSTREL","text":"I thought the animals were merely the stuff of legend: creatures of manifest darkness sacrificed to the beast tribes' unholy gods, emerging from the void recast in their elemental image... To think that not only do these eldritch beings exist, but I know the very <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to whom they answer!"},{"name":"WANDERINGMINSTREL","text":"Yes...I see it now. You are the one, <span class=\"highlight\">Forename</span>. The one of whom the oracle spoke, all those years ago..."},{"name":"WANDERINGMINSTREL","text":"I wish for you to have this whistle. I collected it during my wanderings in the East─a gift from an ancient hermit who lived a life of seclusion atop a holy mountain. At the time, I thought it a poor reward for climbing to the top of that godsforsaken peak."},{"name":"WANDERINGMINSTREL","text":"But as I turned to go, the hermit spake unto me thus: “The gift I give you is no mundane instrument. Only a matchless hero may sound its clarion call, and summon the ageless one... A legend to call a legend forth!”"},{"name":"WANDERINGMINSTREL","text":"Colt that I was, I thought him senile─a broken man with a broken whistle. And yet, there was something in the passion of his voice, the glint in his eyes, that told me he was speaking true. Though my lips have never mustered a single peep from the thing, I have kept it at my side ever since."},{"name":"WANDERINGMINSTREL","text":"But now I gladly part with it, for who could the hermit have been speaking of but you, <span class=\"highlight\">Forename</span>? A matchless hero who has defended the realm time and time again from the primal menace! A living legend who can call forth legendary beasts at will! Surely he must have foreseen our fateful meeting!"},{"name":"WANDERINGMINSTREL","text":"Full faith have I that your heroic lips will succeed where my merely musical ones failed. What an honor it shall be to bear witness to the first encounter between the greatest hero of our time, and a mythical creature the like of which the world has never seen! What a song I shall make of it!"},{"name":"WANDERINGMINSTREL","text":"But a sublime song calls for a sublime setting...and I can think of none better than the crystal cliffs of Rathefrost, overlooking Silvertear Lake. Forgive me for wishing to add a touch of theater to an already auspicious event, but if you would indulge me this once, I would be eternally grateful."},{"name":"WANDERINGMINSTREL","text":"I shall follow you to Rathefrost, and keep out of sight until such time as you blow the fife, and summon the─ Oh, but my heart races just to think of it! To Rathefrost, <span class=\"highlight\">Forename</span>...your legend awaits!"},{"name":"WANDERINGMINSTREL","text":"The shining cliffs of Rathefrost are the perfect stage for such an historical moment! Simply stand beneath the crystal bower, overlooking the lake, and sound the whistle... I shall be watching from the shadows, searing the image into my very soul."},{"name":"WANDERINGMINSTREL","text":"Beautiful... Not even in my wildest flights of fancy did I ever dream of witnessing such a sight!"},{"name":"WANDERINGMINSTREL","text":"If I am not mistaken, this is the immortal Kirin of Eastern legend! Thank you, <span class=\"highlight\">Forename</span>, for allowing me this chance to see one with my own eyes. I shall treasure this memory for always."},{"name":"WANDERINGMINSTREL","text":"That the Kirin has responded to your summons can mean only one thing: it assents to your command. It is as I always knew it would be, from the very moment we met... You are the one the hermit spoke of─the legend fit to call the legend forth!"},{"name":"WANDERINGMINSTREL","text":"Beneath a crystal bower, a silent whistle sounds,♪<br>That o'er a crystal tower, around the world resounds.♪<br>So from its clouded kingdom, a golden steed descends,♪<br>To bend its knee to a hero brave, and for its strength to lend.♪"},{"name":"WANDERINGMINSTREL","text":"I am positively overflowing with newfound inspiration, and it is all thanks to you, <span class=\"highlight\">Forename</span>! I shall call this song...<span class=\"emphasis\">The Ballad of the Mythrider</span>. It shall be my finest creation yet!"},{"name":"WANDERINGMINSTREL","text":"I have but one request, <span class=\"highlight\">Forename</span>: as you ride out into the wide world atop your legendary steed, do not forget to return to me once in a while and recount your adventures. People the realm over may shout your praises, but who among them can set them to verse as well as I?"}],"reward":{"items":[{"id":10080}],"xp":0}},"partials":[{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"item","id":"10080","obj":{"i":10080,"n":"Kirin Fife","l":1,"c":26039,"t":63}}]}