{"quest":{"name":"The Parting Glass","location":"Ul'dah","id":65963,"patch":2.55,"sort":99,"icon":100374,"eventIcon":71201,"issuer":1001353,"target":1006384,"involved":[1001821,1006401,1010928,1010997,1010998,1011622],"genre":2,"journal":["Judging by Momodi's grin, your star could not rise any higher.","Before you make your entrance at the banquet, you must answer the summons of Her Royal Majesty Nanamo Ul Namo. Speak with her handmaiden on the Royal Promenade when you are ready to meet the monarch.","In private, the sultana reveals to you her intent to abdicate the throne and establish a fair and equitable republic. However, she is not so naive as to think that the transition will be without difficulty, which is why she asks that you support Raubahn however you can in the days ahead. You agree, and see relief wash over Nanamo's face...only to be replaced with confusion and terror as her body is racked by convulsions. Time seems to slow down as she falls to the floor and lies motionless, and as you rise to your feet to aid her, Teledji Adeledji and a contingent of Brass Blades burst into the room. The scene thus set, Teledji proclaims to all and sundry that Her Royal Majesty Nanamo Ul Namo has been murdered with poison─and that you, the Warrior of Light, are the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> responsible.<br><br>Captain Ilberd of the Crystal Braves delivers you bound into the Fragrant Chamber and declares that you stand accused of regicide. Your bewildered allies vehemently deny Teledji's claims, but the Syndicate member counters their protestations with accusations that they too had a hand in the assassination. Ludicrous as it sounds, you see fear and doubt spreading across every face in the room─save for that of Raubahn Aldynn, a man foundering in a sea of disbelief and despair. Yet it is not words of comfort which serve to bring him back to shore, but Teledji Adeledji's unconcealed glee at ridding himself of the sultana once and for all. Unable to resist, he goads the Bull of Ala Mhigo into action, and is cleft in twain for his troubles, never to mock Nanamo again.<br><br>Lost to fury, Raubahn then advances upon Lolorito─only to be taken unawares by Ilberd, who severs his arm with a single practiced stroke. His true colors thus revealed, he delights in tormenting his rival in Teledji's stead, going so far as to claim credit for Nanamo's murder. His rage rekindled, the General rises to his feet, and in the ensuing struggle succeeds in freeing you from your bonds. As he and Ilberd eye each other from across the room, Raubahn bids you and the Scions escape─to clear your names and see justice done─before preparing to cross swords with the man he once called brother.<br><br>Bereft of allies and branded fugitives, you and your fellow Scions flee the scene, with a legion of Braves and Blades in hot pursuit. But it soon becomes plain that they are not to be outrun. One by one, your comrades choose to remain and hold back the tide of pursuers, until at last, when you emerge from the Sil'dihn ruins, you find yourself alone. For a mercy, you are soon reunited with Alphinaud, at least, as well as an unexpected friend: <span class=\"alternative-container\"><span class=\"alternative\">Brennan</span><span class=\"alternative\">Bremondt</span><span class=\"alternative\">Brendt</span></span>, the peddler whom you met when traveling to <span class=\"alternative-container\"><span class=\"alternative\">Limsa</span><span class=\"alternative\">Gridania</span><span class=\"alternative\">Ul'dah</span></span> long ago. Together with Pipin Tarupin─Vice Marshal of the Immortal Flames, and Raubahn's adopted son─you flee to Black Brush, where <span class=\"alternative-container\"><span class=\"alternative\">Brennan</span><span class=\"alternative\">Bremondt</span><span class=\"alternative\">Brendt</span></span> asks you to wait until help arrives.","Your promised help turns out to be none other than Cid Garlond, who is prepared to spirit you away from Thanalan aboard the <span class=\"emphasis\">Enterprise</span>. But where will you go? Somewhere beyond the reach of the Monetarists and the Crystal Braves both, Pipin offers, prompting Alphinaud to conclude that Coerthas is your best choice. And so you part ways with the young vice marshal, who swears to do what he can to clear your names, and climb aboard the <span class=\"emphasis\">Enterprise</span>. After what seems a short journey, you disembark near Camp Dragonhead, where a downcast Alphinaud proposes you seek Lord Haurchefant's counsel.","You receive a customarily warm welcome from Lord Haurchefant, who has already had the particulars of your tale from Alphinaud. Though plainly sympathetic to your plight, it would seem that he has a tale of his own to tell..."],"objectives":["Speak with the lady-in-waiting on the Royal Promenade.","Speak with Pipin.","Speak with Haurchefant at Camp Dragonhead."],"dialogue":[{"name":"MOMODI","text":"Would you believe that, while you were away, another message arrived for you? Well, one did."},{"name":"MOMODI","text":"One delivered by the sultana's handmaiden, no less. Seems Her Grace desires a private audience."},{"name":"MOMODI","text":"Her handmaiden will meet you on the Royal Promenade and escort you to the sultana's chambers.<br>...So what are you waitin' for? Go on, then! Go!"},{"name":"MOMODI","text":"I don't know about you, but if the sultana summoned <span class=\"emphasis\">me</span> for a private meetin', I'd be practicin' my curtsy on the Royal Promenade by now! <span class=\"emphasis\">OUT</span>!"},{"name":"BARTHOLOMEW","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. The banquet began mere moments ago, and I would be honored to show you in─but I believe that the sultana's handmaiden has an urgent matter to discuss with you. My apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"LADYINWAITING00427","text":"Thank you for coming, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Her Grace is most eager to speak with you."},{"name":"LADYINWAITING00427","text":"If you require a moment to compose yourself before your audience, you may have it. Or, if you are ready, it would be my honor to escort you to Her Grace's chambers forthwith."},{"name":"SYSTEM","text":"Upon proceeding to the sultana's bedchamber, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"Q1","text":"Proceed to the sultana's bedchamber?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"BREMONDT","text":"Them soldiers'll keep searchin' for a while yet. Reckon we'll take the carriage back towards Ul'dah an' get the lay of the land─maybe provide a distraction if need be."},{"name":"BREMONDT","text":"You three wait here. Help'll be along shortly. Stay strong, friends─the real fight's to come!"},{"name":"BREMONDT","text":"All right, let's go!"},{"name":"ALPHINAUD","text":"How could I have been so blind..."},{"name":"PIPPIN","text":"The most unassuming folk can prove to be our greatest allies. That fellow was but a passing merchant, yet he lent us aid without a moment's hesitation─or any hint of concern for his own safety."},{"name":"PIPPIN","text":"Though I can well imagine how a man could feel inspired to risk all in <span class=\"emphasis\">your</span> presence."},{"name":"PIPPIN","text":"Father spoke often of you, <span class=\"highlight\">Forename</span>, and long have I looked forward to our first meeting. Needless to say...this is not at all how I envisioned it."},{"name":"PIPPIN","text":"Master Alphinaud, you must not give in to despair. That would only play into our enemies' hands! So long as you and <span class=\"highlight\">Forename</span> are free, we may still set things right."},{"name":"ALPHINAUD","text":"Forgive me, Marshal Tarupin, but I─"},{"name":"CID","text":"(-???-)Alphinaud, my boy─sorry to keep you waiting!"},{"name":"ALPHINAUD","text":"Cid? What are you doing here?"},{"name":"CID","text":"Pulling you out of the fire, as usual! Your merchant friend told me everything."},{"name":"PIPPIN","text":"Truly? Then he is no merchant but an angel in peddlers' clothing... But tell us─how do you intend to bear our friends to safety?"},{"name":"CID","text":"I hid the <span class=\"emphasis\">Enterprise</span> but a short distance away. All I need is a destination."},{"name":"PIPPIN","text":"We must find a place beyond the reach of both the Monetarists and the Crystal Braves..."},{"name":"ALPHINAUD","text":"...Coerthas. Ishgard will not suffer the intrusion of foreign forces in their territory."},{"name":"CID","text":"That settles it. With me, everyone!"},{"name":"PIPPIN","text":"Not I, I fear. I must remain here. I dare not abandon Ul'dah to the Monetarists and their cronies."},{"name":"PIPPIN","text":"You may be certain that they will seek to defame you, both here and in the other city–states. But know that I shall do my utmost to thwart their every effort."},{"name":"PIPPIN","text":"Frankly, I do not expect it to be much of a challenge. The smallfolk will not turn so easily on the Warrior of Light and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> allies, no matter what the Monetarists claim."},{"name":"ALPHINAUD","text":"Marshal Tarupin, I...I know not what to say."},{"name":"PIPPIN","text":"Hah! Now <span class=\"emphasis\">that</span> Father would labor to believe! But enough talk─you must go, Master Alphinaud. Your airship awaits!"},{"name":"CID","text":"Up, up! There's no rest for the righteous!"},{"name":"ALPHINAUD","text":"We should make for Camp Dragonhead and speak with Lord Haurchefant. Mayhap...mayhap he will know what to do."},{"name":"ALPHINAUD","text":"Lord Haurchefant has agreed to grant us succor. He says that we will be safe here..."},{"name":"YAELLE","text":"You are among friends here. Pray take your ease and turn your thoughts to better days."},{"name":"HAURCHEFANT","text":"Master Alphinaud told me your tale, <span class=\"highlight\">Forename</span>. It warms my heart that you should turn to me before all others─and I shall endeavor to deserve your trust."},{"name":"HAURCHEFANT","text":"Alas...the situation here has grown more complicated in your absence. 'Twould be best if I explained in full."}],"reward":{"gil":1502,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65962]},"next":[65964]},"partials":[{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1006401","obj":{"i":1006401,"n":"Yaelle","l":63,"q":4}},{"type":"npc","id":"1010928","obj":{"i":1010928,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1010997","obj":{"i":1010997,"n":"Lady-in-waiting","l":41,"q":1}},{"type":"npc","id":"1010998","obj":{"i":1010998,"n":"Pipin","l":43,"q":1}},{"type":"npc","id":"1011622","obj":{"i":1011622,"n":"Alphinaud","l":43,"q":1}},{"type":"quest","id":"65962","obj":{"i":65962,"n":"Come, but Not Gone","g":2,"l":"Ul'dah","s":98}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}}]}