{"quest":{"name":"The Least among Us","location":"South Shroud","id":65960,"patch":2.55,"sort":96,"eventIcon":71201,"issuer":1010984,"target":1010897,"involved":[1010988,1010989,1010990,1010991],"genre":2,"journal":["Who better to serve the Scions of the Seventh Dawn than a humble scholar and his faithful assistant?","Eager to obtain additional readings with which to confirm his theory, your scholarly companion proposes a visit to Urth's Fount. Proceed to the next─and hopefully final─survey site.","Having arrived in Urth's Fount, the scholar bids you do what you have done before: stand watch at an appropriate distance while he takes his measurements.","The survey takes a tragic twist when the scholar discovers the body of Wilred, the young Ala Mhigan whom you personally recruited to the Crystal Braves. Hoary Boulder and Coultenet soon arrive at the scene, and they conclude that the boy was murdered─though by whom and for what reason they can only speculate. The pair offer to look after the scholar in your stead and implore you to report the boy's death to Minfilia at the Rising Stones.","The news of Wilred's death comes as a shock to Minfilia, who cannot fathom why anyone would want to harm the boy. In a hollow voice, she declares that Alphinaud will want to conduct an investigation and send word to Wilred's family, before sinking back into her own thoughts..."],"objectives":["Speak with the unsettled scholar at Urth's Fount.","Stand guard as the scholar takes measurements.","Speak with Minfilia at the Rising Stones."],"dialogue":[{"name":"SCIENTIST00423","text":"For our next survey, I would have you escort me to Urth's Fount."},{"name":"SCIENTIST00423","text":"The ambient aether concentrations there are so high that crystalline structures form spontaneously. Consequently, anomalous fluctuations should be much easier to detect. Brilliant, yes? No, don't bother answering─that was rhetorical. Now, come along!"},{"name":"SCIENTIST00423","text":"You should be more than familiar with the procedure by now. Pray find a suitable position from which to keep watch while I take measurements."},{"name":"SCIENTIST00423","text":"We will be here all <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> if you do not leave me be, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>!"},{"name":"SCIENTIST00423","text":"Yes...yes...quite high, yet still markedly lower than the historical measurements taken near the end of the Sixth Astral Era..."},{"name":"SCIENTIST00423","text":"Could the presence of a primal account for the difference? Or is there something else...something else..."},{"name":"SCIENTIST00423","text":"Something...else..."},{"name":"SCIENTIST00423","text":"Scion! Scion, come here! I-I need you!"},{"name":"HOARYBOULDER","text":"Fear not, my friends! Help has arrived!"},{"name":"COULTENET","text":"There you are, <span class=\"highlight\">Forename</span>! Hoary and I were worried when you and your charge failed to return at the appointed hour."},{"name":"HOARYBOULDER","text":"&lt;sigh&gt; Gutted like a hog...but not <span class=\"emphasis\">by</span> one, no. These wounds were made with a blade... Doesn't look like he put up much of a fight, either. Nary a mark on his sword or his shield..."},{"name":"COULTENET","text":"I've heard nothing of any Crystal Brave operations in this area. What cause had Wilred to come here?"},{"name":"SCIENTIST00423","text":"Wh-What should we do!?"},{"name":"COULTENET","text":"We will see to the scholar's protection, <span class=\"highlight\">Forename</span>."},{"name":"HOARYBOULDER","text":"Aye, and the boy's remains. You should return to the Rising Stones. The Antecedent will want to know what happened here."},{"name":"HOARYBOULDER","text":"And so do I..."},{"name":"SCIENTIST00423","text":"I've...I've never been this close to a...to a... Oh...oh gods..."},{"name":"HOARYBOULDER","text":"We spoke a few times in the Rising Stones. He wasn't as experienced as some of the other Braves─but gods, he had passion..."},{"name":"COULTENET","text":"Gods, what a waste... Pray leave matters here to us, <span class=\"highlight\">Forename</span>. You must return to the Rising Stones and inform the Antecedent at once."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>, you are returned! And you seem troubled. Did the role of escort chafe so?"},{"name":"MINFILIA","text":"Wilred...dead? Mayhap <span class=\"emphasis\">murdered</span>? By the Twelve! How can that be!?"},{"name":"MINFILIA","text":"I will send word to Alphinaud at once. He will want to conduct a full investigation, and send word to Wilred's family..."},{"name":"MINFILIA","text":"Gods... He was just a boy. Who would do this─and why?"},{"name":"MINFILIA","text":"Gods... He was just a boy. Who would do this─and why? ...But I am sorry, <span class=\"highlight\">Forename</span>. Doubtless this weighs heavy on your heart...and we have already imposed upon you so much."},{"name":"MINFILIA","text":"Pray take some time for yourself─I daresay you have more than earned a respite. After all, we will be most busy with preparations as the banquet draws near. Should other adventures summon you elsewhere, perhaps now is the time to heed their call?"},{"name":"SYSTEM","text":"In order to progress in the main scenario, you must first complete certain quests in the Crystal Tower series."},{"name":"SYSTEM","text":"The Crystal Tower quest series may be undertaken by speaking with the outlandish man in Revenant's Toll."}],"reward":{"gil":930,"items":[{"num":2,"id":7060,"one":1},{"num":2,"id":7059,"one":1},{"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65959]},"next":[65961]},"partials":[{"type":"npc","id":"1010984","obj":{"i":1010984,"n":"Unsettled Scholar","l":56,"q":2}},{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1010988","obj":{"i":1010988,"n":"Unsettled Scholar","l":56,"q":1}},{"type":"npc","id":"1010989","obj":{"i":1010989,"n":"Unsettled Scholar","l":56,"q":1}},{"type":"npc","id":"1010990","obj":{"i":1010990,"n":"Hoary Boulder","l":56,"q":1}},{"type":"npc","id":"1010991","obj":{"i":1010991,"n":"Coultenet","l":56,"q":1}},{"type":"item","id":"7060","obj":{"i":7060,"n":"Durability Draught","l":45,"c":20644,"t":44}},{"type":"item","id":"7059","obj":{"i":7059,"n":"Spiritbond Potion","l":55,"c":20645,"t":44}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65959","obj":{"i":65959,"n":"Where We Are Needed","g":2,"l":"The Rising Stones","s":95}},{"type":"quest","id":"65961","obj":{"i":65961,"n":"A Time to Every Purpose","g":2,"l":"The Rising Stones","s":97}}]}