{"quest":{"name":"A Time to Every Purpose","location":"The Rising Stones","id":65961,"patch":2.55,"sort":97,"icon":100373,"eventIcon":71201,"issuer":1010897,"target":1010992,"involved":[1008969,1010993,1010994,1010995,1010996],"genre":2,"journal":["While others look forward to the impending royal banquet, Minfilia cannot help but look to the past.","As four great nations stand poised to commemorate the successful defense of Ishgard, Minfilia is haunted by memories of the lost and concerns for the future of Eorzea. But while she would rather remain at the Rising Stones and focus on her work, she recognizes that this is a time for celebration, and that the Scions of the Seventh Dawn must stand united as a beacon of hope to all. And so she departs for Ul'dah to rendezvous with the other Scions, instructing you to follow when you are ready.<br><br>As you leave the solar, Riol calls out to you, and you take the opportunity to share the news of Wilred's death. In response, the Crystal Brave reveals he has uncovered evidence that Teledji Adeledji has bribed members of the 1st and 3rd Units. Riol also divulges that Wilred had begun to ask pointed questions, which likely led to his demise at the hands of these traitors. Troubling as these revelations may be, you have obligations in Ul'dah which cannot be postponed.","You rendezvous with the other Scions on the Royal Promenade, ready for the feast. However, Minfilia reveals that you will not be making your entrance together as planned, due to an untimely request for aid from Mistress Momodi. It would seem that your presence is required at the Quicksand..."],"objectives":["Speak with Minfilia on the Royal Promenade."],"dialogue":[{"name":"SYSTEM","text":"In order to progress in the main scenario, you must first complete certain quests in the Crystal Tower series."},{"name":"SYSTEM","text":"The Crystal Tower quest series may be undertaken by speaking with the outlandish man in Revenant's Toll."},{"name":"MINFILIA","text":"Though recent events weigh heavily on our minds, we must needs set them aside for now."},{"name":"MINFILIA","text":"We are come to a defining moment in Eorzean history..."},{"name":"MINFILIA","text":"The grand commemoration of our joint defense of Ishgard─the first time in fifteen long years that our people have stood side by side with our neighbors to the north to fight in common cause."},{"name":"MINFILIA","text":"This may mark the true rebirth of the Eorzean Alliance. Failing that, it should at the very least serve to bring our nations closer together."},{"name":"MINFILIA","text":"...We have every reason to raise our voices in celebration, do we not?"},{"name":"MINFILIA","text":"We have bested Dravanians and Ascians both. Against desperate odds, we have fought and won."},{"name":"MINFILIA","text":"But the primals still plague us, and the Empire still plots our subjugation. And our triumphs, remarkable though they are, were bought at a terrible price."},{"name":"MINFILIA","text":"Brave adventurers and allies, broken on the Steps of Faith. And before our eyes, in this very room, our dear friend Moenbryda..."},{"name":"MINFILIA","text":"This is the victory we have wrought, and it is as bitter ashes in my mouth."},{"name":"MINFILIA","text":"I would sooner stay here and invite those with more appetite to enjoy the feast in my stead."},{"name":"MINFILIA","text":"Alas, it is a royal banquet, and all of our allies will be in attendance. It is our duty to present a united front, that we might serve as a beacon of hope to all..."},{"name":"MINFILIA","text":"It seems I have no choice but to take my own advice."},{"name":"MINFILIA","text":"I instructed the others to meet us in Ul'dah, that we might make our grand entrance together."},{"name":"MINFILIA","text":"Unfortunately, I had to settle for leaving Tataru and Lhaminn a note. If they do not return quickly, they will have to settle for whatever leftovers I can smuggle out of the Fragrant Chamber..."},{"name":"RIOL","text":"Off to the big soirée, <span class=\"highlight\">Forename</span>? Raise a glass for me, eh? ...Or not. You don't look best pleased, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Somethin' on yer mind?"},{"name":"RIOL","text":"By the Navigator, Wilred's dead!? Godsdammit! They must know they've been rumbled..."},{"name":"RIOL","text":"I mean, er... Sod it. 'Tis past time we had this talk. After our last conversation, I got to thinkin' about where certain funds were comin' from. So I had a dig around─on the quiet, like─an' sure enough, I found it."},{"name":"RIOL","text":"Seems a fair bit o' coin's made its way into the Braves' coffers courtesy of a “Dodo Consortium”─a daft name for a business if ever I heard one, which is what first gave me an inklin' that somethin' weren't right."},{"name":"RIOL","text":"So I went through the ledgers again, an' found another half-dozen donations from organizations with stupid bloody names. Didn't take long to find the common thread: all were owned by the Mirage Trust."},{"name":"RIOL","text":"Oh, I'll give the bastard credit─he showed us up for the amateurs we are. Short o' callin' one o' his businesses the bloody “Bribery Consortium,” I don't know what more he could've done to mock our rules on financial contributions."},{"name":"RIOL","text":"The gods only know how many men o' the 1st an' 3rd are takin' Teledji's coin. But now we know as some of 'em are, I'd wager me right eye they're the ones what did for Wilred."},{"name":"RIOL","text":"The earnest young fool had taken to askin' the wrong kind o' questions. Bound to attract attention, he was... Should've seen it at the time─but I didn't, gods damn me..."},{"name":"RIOL","text":"Still, I don't see what Teledji hopes to accomplish. He hid his scheme with all the care of a drunk pissin' into the wind..."},{"name":"RIOL","text":"No, he's cleverer than this─so we need to be clever too. That's the only way we'll ever repay this debt o' blood."},{"name":"RIOL","text":"We'll purge every one o' them traitorous bastards from our ranks! On that you have me word."},{"name":"RIOL","text":"An' <span class=\"highlight\">Forename</span>─mind yerself when yer in Ul'dah, eh? We're headin' into a storm. I can smell it."},{"name":"RIOL","text":"...The kind what'll sweep a man overboard an' drag him under 'fore he knows it."},{"name":"YSHTOLA","text":"If I did not know better, I should think our bard had run afoul of another jilted lover..."},{"name":"THANCRED","text":"Is that...? No, just my imagination."},{"name":"THANCRED","text":"Oh, pay no attention to me. 'Tis a habit from my misspent youth, looking over my shoulder from time to time."},{"name":"YDA","text":"It's a banquet, so there'll definitely be food─but will there also be dancing? And if there is, will it be before or after the food? Dancing on a full stomach is no fun...but neither is being hungry... Hmm, what to do..."},{"name":"PAPALYMO","text":"I do hope Yda is not under the impression that we are here to make merry. We are ostensibly the Antecedent's escort, after all."},{"name":"MINFILIA","text":"We have been waiting for you, <span class=\"highlight\">Forename</span>. The celebration is due to begin shortly."},{"name":"MINFILIA","text":"I had hoped that we might make our introductions together, but Mistress Momodi just sent word that you are needed at the Quicksand..."}],"reward":{"gil":877,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"questsType":"all","quests":[65958,65960]},"next":[65962]},"partials":[{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1010992","obj":{"i":1010992,"n":"Minfilia","l":41,"q":2}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1010993","obj":{"i":1010993,"n":"Thancred","l":41,"q":2}},{"type":"npc","id":"1010994","obj":{"i":1010994,"n":"Y'shtola","l":41,"q":2}},{"type":"npc","id":"1010995","obj":{"i":1010995,"n":"Yda","l":41,"q":2}},{"type":"npc","id":"1010996","obj":{"i":1010996,"n":"Papalymo","l":41,"q":2}},{"type":"quest","id":"65958","obj":{"i":65958,"n":"Ancient Ways, Timeless Wants","g":2,"l":"Limsa Lominsa","s":94}},{"type":"quest","id":"65960","obj":{"i":65960,"n":"The Least among Us","g":2,"l":"South Shroud","s":96}},{"type":"quest","id":"65962","obj":{"i":65962,"n":"Come, but Not Gone","g":2,"l":"Ul'dah","s":98}}]}