{"quest":{"name":"In Memory of Moenbryda","location":"The Rising Stones","id":65965,"patch":2.5,"sort":84,"icon":100369,"eventIcon":71201,"issuer":1011000,"target":1010897,"involved":[1010898,1010899,1010900,1010901,1010902,1010903,1010904,1010905],"genre":2,"journal":["Minfilia wishes to gather the Scions and honor the fallen Moenbryda.","Wishing to hold a simple service to honor the fallen Moenbryda, Minfilia suggests a gathering at the nearby monument─a stone sacred to Thaliak, the guardian deity of Sharlayan. Travel to Rathefrost in Mor Dhona, and wait at the mark of the Scholar for the other Scions to arrive.","You kneel before the mark of the Scholar, and offer a prayer for Moenbryda's soul. Now, more than ever, the Scions are determined to bring an end to the Ascians' destructive crusade. Return to the Rising Stones and speak with Minfilia.","Though her resolve threatens to crumble under the weight of yet another companion lost, Minfilia reminds herself of her duty to the fallen. She cannot surrender to her grief while Eorzea remains besieged on all sides. The Scions look to their leader for strength, and the Antecedent, in turn, confesses her reliance upon you. With the myriad perils yet menacing the realm, she will yet have need of your steadfast presence..."],"objectives":["Show your respects at the mark of the Scholar at Rathefrost.","Speak with Minfilia at the Rising Stones."],"dialogue":[{"name":"MINFILIA","text":"（★未使用／削除予定★）"},{"name":"MINFILIA","text":"（★未使用／削除予定★）"},{"name":"MINFILIA","text":"As Moenbryda was a native of Sharlayan, I feel it is only fitting that we gather before the mark of the Scholar. Are you familiar with the stone?"},{"name":"MINFILIA","text":"'Tis a monument found at Rathefrost, and is sacred to Thaliak, guardian deity of the city of learning."},{"name":"MINFILIA","text":"There shall we pray for our dear friend's soul, and bid her a peaceful return to the light of the Mothercrystal."},{"name":"YDA","text":"Oh, Moen... I miss you so much already..."},{"name":"PAPALYMO","text":"She was counting on the theory that a soul's aether burns brightest at the moment of its passing. A scholar until the very end..."},{"name":"THANCRED","text":"Would we had arrived a few moments sooner...<br>Just a few moments..."},{"name":"YSHTOLA","text":"Our list of grievances against the Ascians was already overlong. Must they continue to add to it?"},{"name":"YDA","text":"I don't want to believe she's really gone..."},{"name":"PAPALYMO","text":"The loss of those close to you is never easy...and Yda was closer to Moenbryda than most."},{"name":"THANCRED","text":"As ever, I was a step too late..."},{"name":"YSHTOLA","text":"Was there aught we might have done to save her? 'Tis foolish to torture oneself with such thoughts, but the heart is ofttimes deaf to quiet reason."},{"name":"MINFILIA","text":"Moenbryda showed us the way forward at the cost of her own life. What worth is her sacrifice if we do not follow where it leads?"},{"name":"MINFILIA","text":"Let us gather at Rathefrost, and show our respects for our fallen comrade. Then we shall continue with the work she began..."},{"name":"YDA","text":"I don't feel much like talking at the moment. If you could just...give me some time."},{"name":"PAPALYMO","text":"I loathe to see Yda in such pain, but I have not the words to comfort her. Can you imagine it? I, Papalymo, the one who has an eloquent comment for every situation, am at a loss for words..."},{"name":"THANCRED","text":"We must find some means of protecting ourselves from Ascian intrusions. There must be a way..."},{"name":"YSHTOLA","text":"The Rising Stones feels somehow colder. Moenbryda always carried with her such an abundance of warmth and cheer."},{"name":"MINFILIA","text":"Though we have said our farewells, the pall of sadness has diminished but little. Forgive me: as Antecedent, 'tis my job to be the pillar of strength for all others to lean upon."},{"name":"MINFILIA","text":"Yet I also believe the grief we feel now is precious in its own way, and not to be lightly swept aside. Do you not agree, <span class=\"highlight\">Forename</span>?"},{"name":"MINFILIA","text":"'Tis as if a dagger has been thrust into my breast..."},{"name":"MINFILIA","text":"But 'tis a pain we must learn to bear if we are to forge ahead with our duty."},{"name":"MINFILIA","text":"The battles we have fought have taken the lives of so many. Louisoix. Moenbryda. Our fellows at the Waking Sands."},{"name":"MINFILIA","text":"Their spirit and dedication to our cause, however, will never be lost as long as we rise to fight once more."},{"name":"MINFILIA","text":"I hardly need remind you of this, of course. 'Tis for my own benefit that I repeat these words─a reaffirmation of mine own chosen path."},{"name":"MINFILIA","text":"If I do not rebuild the foundation of my resolve, I am like to collapse in a fit of weeping..."},{"name":"MINFILIA","text":"My apologies again, <span class=\"highlight\">Forename</span>─there is no other to whom I could display such weakness."},{"name":"MINFILIA","text":"You are <span class=\"emphasis\">my</span> pillar of strength, and I fear I shall have need of your steadfast presence in the days to come..."}],"reward":{"gil":7000,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65905]},"next":[65906]},"partials":[{"type":"npc","id":"1011000","obj":{"i":1011000,"n":"Minfilia","l":481,"q":2}},{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"npc","id":"1010898","obj":{"i":1010898,"n":"Thancred","l":481,"q":2}},{"type":"npc","id":"1010899","obj":{"i":1010899,"n":"Yda","l":481,"q":2}},{"type":"npc","id":"1010900","obj":{"i":1010900,"n":"Papalymo","l":481,"q":2}},{"type":"npc","id":"1010901","obj":{"i":1010901,"n":"Y'shtola","l":481,"q":2}},{"type":"npc","id":"1010902","obj":{"i":1010902,"n":"Thancred","l":481,"q":1}},{"type":"npc","id":"1010903","obj":{"i":1010903,"n":"Yda","l":481,"q":2}},{"type":"npc","id":"1010904","obj":{"i":1010904,"n":"Papalymo","l":481,"q":2}},{"type":"npc","id":"1010905","obj":{"i":1010905,"n":"Y'shtola","l":481,"q":1}},{"type":"quest","id":"65905","obj":{"i":65905,"n":"An Uninvited Ascian","g":2,"l":"Northern Thanalan","s":83}},{"type":"quest","id":"65906","obj":{"i":65906,"n":"Mask of Grief","g":2,"l":"The Rising Stones","s":85}}]}