{"quest":{"name":"Not Easy Being Green","location":"Mor Dhona","id":65967,"patch":2.5,"sort":520,"icon":112078,"unlocksFunction":1,"eventIcon":71341,"issuer":1006975,"target":1011262,"involved":[1006356,1011263],"genre":95,"journal":["Bloezoeng seems to have eyes only for you.","Bloezoeng is overjoyed to hear that you are the very adventurer who survived the Wanderer's Palace. He explains that a fellow in his acquaintance─a treasure hunter of sorts─has been searching for you. Go and discover why at Camp Bronze Lake in upper La Noscea.","You speak with the blundering treasure hunter and his companion. The two tell a harrowing tale, of how close they came to death within the Wanderer's Palace themselves, only to be saved by the tonberries. Their respite was short-lived, however, as a bloodthirsty band of Mamool Ja sellswords invaded not long after, slaughtering many tonberries and locking the remainder away. The treasure-hunting duo barely escaped the attack with their lives. Now, they ask that you give the mercenaries the boot, and so aid their tonberry comrades. Speak with the ferryman Abazi Charazi to gain entrance to the Wanderer's Palace.","Deciding to overlook his hatred of the tonberries, Abazi Charazi grants you passage to the Wanderer's Palace to save the beleaguered creatures from the Silverscales.<br><br>※The Wanderer's Palace (Hard) can be accessed via the Duty Finder.","The Silverscales are now sleeping with faerie bass, so to speak, and the tonberries are rescued. Return to Camp Bronze Lake, and tell the treasure hunters of your triumph.","The treasure-hunting pair are overjoyed to hear of your success. They thank you profusely, vowing that they will do all in their power to ensure the tonberries' safety. With smiles on their lips, the two depart to live happy lives amongst their green friends."],"objectives":["Speak with the blundering treasure hunter in Camp Bronze Lake.","Speak with Abazi Charazi.","Enter the Wanderer's Palace (Hard).","Report to the blundering treasure hunter."],"dialogue":[{"name":"BLOEZOENG","text":"Good day to you, my wayfaring friend. Say, you wouldn't happen to be the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who slew the tonberry king, would you?"},{"name":"BLOEZOENG","text":"I knew it, by the onion! I've a fine gent for you─looking for you, that is. He has an appetizing proposal on the table, and I think you should pay him a visit."},{"name":"BLOEZOENG","text":"He is one of the treasure hunters at Camp Bronze Lake. Oh, and he will of course be there with his partner. The two are inseparable─but I'll let them tell you more themselves. Well, off to La Noscea with you!"},{"name":"BLOEZOENG","text":"Have you spoken to my treasure-hunting acquaintance at Camp Bronze Lake? No? Well, make your way to him and his partner. The two are inseparable─but I shall let them tell you more themselves."},{"name":"HUNTERSBUDDY00431","text":"I say, are you here for us? Then you will want to speak with my partner."},{"name":"TREASUREHUNTER00431","text":"Eh? Bloezoeng sent ye our way, ye say? Well, I'll be thrice damned─it's you! Aye, the 'eroic <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">bloke</span></span> what lopped off the tonberry king's 'ead."},{"name":"TREASUREHUNTER00431","text":"Do ye 'member us? We was the pair 'round the entrance to the Wanderer's Palace. Saw you right 'fore that great bleedin' tonberry stabbed us. 'Ere, wasn't we stabbed, love?"},{"name":"HUNTERSBUDDY00431","text":"Indeed we were. 'Twas <span class=\"emphasis\">most</span> unpleasant. Now, adventurer, you are here to do something we would prefer <span class=\"emphasis\">not</span> to do ourselves: venture into the Wanderer's Palace again!"},{"name":"TREASUREHUNTER00431","text":"...Best we start at the beginning, eh? Like I was sayin', we was 'ackin' away at little tonberries when the big one snuck up behind us! Well, we tried to fight it off, but it got the best of us. Never been in worse shape! Just lyin' there, bleedin'..."},{"name":"TREASUREHUNTER00431","text":"Hells, I thought we weren't long for the realm! But just as I was thinkin' of me last words, lo and behold the tonberries we'd been 'avin' it out with started treatin' us! Nursed us right back to 'ealth, they did."},{"name":"TREASUREHUNTER00431","text":"That's when we learned the truth 'bout the tonbies. See, they was only menacin' folk 'cause of a curse...a curse that <span class=\"emphasis\">you</span> lifted when ye slew the tonberry king."},{"name":"TREASUREHUNTER00431","text":"At 'eart, that lot're calm and twice as kindly again! Why, it was a right pleasure, 'avin' them take care of us for a fair spell. &lt;sigh&gt; It's a pity those peaceful days didn't last..."},{"name":"TREASUREHUNTER00431","text":"A band of Mamool Ja what call themselves the “Silverscales” came stormin' into the palace! They say they're mercenaries, but they're nothin' but the scum of the bleedin' realm!"},{"name":"HUNTERSBUDDY00431","text":"The howling, the blood─and so many dead! As if that weren't enough, the surviving tonberries were locked away deep in the ruins! Why in the name of the Twelve do they deserve such a fate, I ask you!"},{"name":"HUNTERSBUDDY00431","text":"We...we had grown rather fond of the tonberries while living amongst them. They have good hearts, no matter how odd their appearance. None of that should matter anyway. This fellow is Hyuran and I am Miqo'te; are we lesser a couple for our difference? I should think not!"},{"name":"HUNTERSBUDDY00431","text":"...I say, you look like the learned type. Perhaps you have made the acquaintance of one called Surito Carito?"},{"name":"HUNTERSBUDDY00431","text":"I thought as much. Has he told you the tonberries' great secret: that they once looked the same as you or I?"},{"name":"HUNTERSBUDDY00431","text":"Is that not the greatest tragedy you have ever heard? To be so spurned and locked away in some horrid gaol─and by one's own people, no less!"},{"name":"HUNTERSBUDDY00431","text":"&lt;sigh&gt; My heart goes out to the tonberries, truly. To be so...so betrayed, so ill treated, and locked away in some horrid dungeon─and by one's own people, no less!"},{"name":"HUNTERSBUDDY00431","text":"My dearest and I know their pain all too well. We both had to leave our birthplace. Why, you ask? Simply because we were different. No, we will not sit idly by and let the tonberries be subjected to such terrible treatment!"},{"name":"TREASUREHUNTER00431","text":"Well said, love! But much as we'd like to give the Silverscales the boot ourselves, we can't stand up to a cartload of Mamool Ja. So please, say ye'll do it in our place! The Wanderer's Palace is the only 'ome the tonberries 'ave got!"},{"name":"TREASUREHUNTER00431","text":"Now ye'll 'ave to speak with Abazi Charazi and get a ride in 'is boat across the lake. Er...what's it now, <span class=\"emphasis\">von boyage</span>?"},{"name":"TREASUREHUNTER00431","text":"...'Ere, why 'aven't you spoken with Abazi Charazi? I can't very bleedin' well ferry you over to the Wanderer's Palace, can I!?"},{"name":"HUNTERSBUDDY00431","text":"The two of us had to leave our village, but we always have each other. The tonberries have only the Wanderer's Palace, though. Please, return to them their home!"},{"name":"ABAZICHARAZI","text":"Come on that treasure hunter's errand, have ye? Well, I'll take ye 'cross the lake, but be warned: the palace yer makin' for is held by the Silverscales. And their leader's the most fearsome of the lot!"},{"name":"ABAZICHARAZI","text":"Now, the tonberries aren't friends of mine, but even <span class=\"emphasis\">I</span> think the way the Mamool Ja have 'em imprisoned is wrong. Capturin' them, turnin' them into thralls... Go and give those sellswords hell!"},{"name":"ABAZICHARAZI","text":"The tonberries aren't friends of mine, but the way the Mamool Ja're imprisonin' them is just plain wrong. Ye go and give those sellswords hell!"},{"name":"ABAZICHARAZI","text":"Skewered the sellswords, have ye? Hah! The treasure hunter an' his partner'll be thrilled to hear that!"},{"name":"HUNTERSBUDDY00431","text":"I daresay that glint in your eye means the sellswords harass the tonberries no more?"},{"name":"TREASUREHUNTER00431","text":"'Ere, 'ave you swept the sellswords out of the palace? Hah! That's a splendid <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Our thanks to ye for savin' the tonbies, honest."},{"name":"HUNTERSBUDDY00431","text":"Allow me to add my thanks to his, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. You have our gratitude on behalf of the tonberries as well."},{"name":"HUNTERSBUDDY00431","text":"I think they truly deserve succor! Can you imagine losing your entire being to hatred? Little wonder the tonberries became monsters!"},{"name":"HUNTERSBUDDY00431","text":"Neither of us are strangers to hate. Growing more spiteful with each passing day is sadly the province of those who are shunned by all around them."},{"name":"HUNTERSBUDDY00431","text":"Yet malice will turn us all to monsters. A tonberry told me as much one day. It gave me pause, to think of wandering for ages with a heart ruled by rancor."},{"name":"TREASUREHUNTER00431","text":"Aye, the tonbies 'ave known more than their fair share of 'ard times. So from 'ere on out, we want to make sure where they live <span class=\"emphasis\">stays</span> a sanctuary."},{"name":"TREASUREHUNTER00431","text":"Fortunately, while there's 'venturers like yerself about to knock invaders out, we won't 'ave to fear for the tonbies. Now, we're off for a right old reunion! Good fortune to ye, friend!"}],"reward":{"gil":2064,"xp":0,"instance":30},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[10],"quests":[70058]}},"partials":[{"type":"npc","id":"1006975","obj":{"i":1006975,"n":"Bloezoeng","l":67,"q":5}},{"type":"npc","id":"1011262","obj":{"i":1011262,"n":"Blundering Treasure Hunter","l":34,"q":1}},{"type":"npc","id":"1006356","obj":{"i":1006356,"n":"Abazi Charazi","l":34,"q":2}},{"type":"npc","id":"1011263","obj":{"i":1011263,"n":"Steadfast Companion","l":34,"q":1}},{"type":"instance","id":"30","obj":{"i":30,"n":"The Wanderer's Palace (Hard)","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":90}},{"type":"instance","id":"10","obj":{"i":10,"n":"The Wanderer's Palace","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":45,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}