{"quest":{"name":"World of Wonders","location":"The Gold Saucer","id":65971,"patch":2.51,"sort":141,"icon":100377,"unlocksFunction":1,"eventIcon":71341,"issuer":1011022,"target":1010448,"involved":[1010478,1011038,1011079,1011080,1011084],"genre":93,"journal":["The attendant at the airship landing seems eager to welcome you to the Gold Saucer.","You have been invited to participate in an introductory tour of the Gold Saucer, at the conclusion of which you will apparently be entitled to some manner of complimentary gift. The economics of complimentary gifts aside, there seems little reason not to take part. Proceed to the main counter and inform the receptionist of your readiness to begin.","Having enthusiastically welcomed you to the Gold Saucer, the receptionist points out the gates leading to one of its main attractions: the chocobo races. He then explains that most transactions within the establishment are conducted in Manderville Gold Saucer points (MGP), and directs you to his colleague to learn more about the currency and how to acquire it.","You step away from the front desk with a newfound understanding of MGP. To continue your tour, proceed to Card Square, where the Triple Triad trader is waiting to teach you more about Eorzea's favorite new card game.","The Triple Triad trader introduces you to the realm's most popular new card game, encouraging you to return at any time to learn the rules and begin building a deck of your own. The next stop on your tour will be Wonder Square─make your way there and listen to what the resident GATE Keeper has to say.","You learn that Wonder Square is home to an assortment of games─as well as a giant revolving cactuar named “El Coloso,” which features prominently in a number of events. Continue on to the second floor of Event Square, where an attendant named Veleda awaits you by the Cactpot Board.","Veleda cheerfully welcomes you to Event Square, home to the Gold Saucer's center stage and the lucrative lottery known as the Jumbo Cactpot. Apparently conscious of the time, she soon blows you a kiss and sends you on your way to the final place of interest on your tour: the incongruously named Round Square. Speak with the GATE Keeper there to continue your tour.","Though your visit to Round Square notably fails to shed any light on its oxymoronic name, it does alert you to the presence of a massive boulder dubbed Mt. Corel─the scene of a rousing mountaineering challenge in which you are heartily encouraged to participate. The GATE Keeper informs you that your tour is complete, and encourages you to return to the main counter to receive your complimentary gift. Whatever could it be?","Even as you receive your long-anticipated gift, you are greeted by Master Roland, the overseer entrusted with managing daily operations at the Gold Saucer. Observing that you are an adventurer, he shares with you the story behind the birth of the establishment, and the ambitious goals of his esteemed employer, the singular Godbert Manderville. Trusting that you share a common understanding, he takes his leave, encouraging you to enjoy all that the Gold Saucer has to offer."],"objectives":["Speak with the Gold Saucer attendant at the main counter.","Speak with the other Gold Saucer attendant at the main counter.","Speak with the Triple Triad trader at Card Square.","Speak with the GATE Keeper at Wonder Square.","Speak with Veleda at the Cactpot Board.","Speak with the GATE Keeper at Round Square.","Speak with the Gold Saucer attendant at the main counter."],"dialogue":[{"name":"RECEPTIONIDT00434","text":"Welcome, honored guest, to the Manderville Gold Saucer, where your wildest dreams are ever but a card or a chocobo's beak away from coming true."},{"name":"RECEPTIONIDT00434","text":"If this is your first visit, nothing would please us more than to give you a full tour of our establishment, that you might enjoy its wonders to the fullest."},{"name":"RECEPTIONIDT00434","text":"At the conclusion of the tour, it is our custom to offer our esteemed patrons a complimentary gift, straight from the vaults of our illustrious proprietor himself. Consider it Lord Manderville's way of <span class=\"emphasis\">personally</span> thanking you for your patronage."},{"name":"RECEPTIONIDT00434","text":"Should you wish to take the tour, pray proceed to the main counter over there and speak with the receptionist.<br>On behalf of the management, may I take this opportunity to thank you for choosing the Gold Saucer. Rest assured, my colleagues and I will spare no effort in seeing that your visit is a pleasant and profitable one. May fortune smile upon you!"},{"name":"RECEPTIONIDT00434","text":"To commence your tour, pray proceed to the main counter over there and speak with the receptionist.<br>On behalf of the management, may I take this opportunity to thank you for choosing the Gold Saucer. Rest assured, my colleagues and I will spare no effort in seeing that your visit is a pleasant and profitable one. May fortune smile upon you!"},{"name":"INFORMATION00435","text":"Welcome, traveler, to the Gold Saucer! This is the main counter, where you can purchase tickets for the Mini Cactpot, acquire and redeem Manderville Gold Saucer points, and much, much more. But what in the world are Manderville Gold Saucer points, I hear you cry! A most astute question, and one which I shall be only too happy to answer. But first─if I may direct your gaze to your left..."},{"name":"INFORMATION00435","text":"Beyond those majestic gates, you will find Chocobo Square, home to the chocobo racing circuit! Aye, what chocobo owner has not dreamed of pitting their fleetest bird against the realm's finest in a pulse-quickening dash for fame and fortune? Truly, it is the sport of sultans!"},{"name":"INFORMATION00435","text":"And should you desire a more elaborate contest of strategy, you will surely find it in Minion Square, at the Lord of Verminion tables, where would-be generals pit armies of minions against one another in battles for honor and glory!"},{"name":"INFORMATION00435","text":"Now, where were we? Ah, yes, Manderville Gold Saucer points. Put simply, MGP─as we call it for short─is the currency by which dreams are bought and sold within these halls."},{"name":"INFORMATION00435","text":"But my associate here beside me can tell you more, including how to go about acquiring some MGP of your very own. Pray speak with him to continue your tour."},{"name":"EXCHANGE00435","text":"So, you're about to experience the wonders of the Gold Saucer for the first time? How I envy you... Ah, but before you venture forth, you'll want to exchange a share of your gil for MGP─a service which it is my great honor to provide."},{"name":"EXCHANGE00435","text":"With MGP in your coinpurse, you'll be able to enjoy all of the fabulous attractions we have to offer─and all of the wonderful <span class=\"emphasis\">games</span>. If you play them with skill, you'll find your little stack of points increasing ten, twenty, even a hundredfold!"},{"name":"EXCHANGE00435","text":"Now that you know the fundamentals, you're ready to step out onto the floor of the Gold Saucer! Your tour will continue at Card Square to the southwest. The card trader there will be your guide."},{"name":"EXCHANGE00435","text":"...I would of course be happy to exchange some of your gil for MGP before you venture on. While my associates and I strive to leave nothing unexplained, there truly is no substitute for firsthand experience, and I heartily recommend trying your hand at our many amusements for yourself."},{"name":"CARDSHOP00435","text":"Well, aren't <span class=\"alternative-container\"><span class=\"alternative\">you just the sweetest thing</span><span class=\"alternative\"><span class=\"emphasis\">you</span> a handsome one</span></span>! Welcome to Card Square, home of the Triple Triad tables."},{"name":"CARDSHOP00435","text":"What's Triple Triad, you ask? Why, only the mind-bending, pulse-pounding, maddeningly moreish card game that's taken the realm by storm! But don't take my word for it─behold!"},{"name":"CARDSHOP00435","text":"Can you not feel the tension in the air!? Form a hand of five cards and play the role of a field general sending your bravest into battle. Should you wish to learn the rules and experience the excitement for yourself, you need only ask. Start today and we'll even throw in some complimentary cards to help you on your way!"},{"name":"CARDSHOP00435","text":"You can face off against a single opponent at any time, or─if you crave an even greater test of your skills─take part in one of our regular tourneys. And believe me when I tell you, there's no feeling quite like standing triumphant on the battlefield after vanquishing all comers. You really should try it!"},{"name":"CARDSHOP00435","text":"A minute to learn, a lifetime to master─that's Triple Triad! Ah, but I'm getting carried away─you have a tour to finish. Wonder Square is your next destination. ...Not that there's any hurry, of course. If you'd like to play a hand or two before you go, you need but say the word!"},{"name":"GATENPCA00435","text":"You look lost, honey. Why don't I show you around? <span class=\"alternative-container\"><span class=\"alternative\">It'll be nice to talk to a woman for a change.</span><span class=\"alternative\">I've been <span class=\"emphasis\">dying</span> for some company. &lt;wink&gt; &lt;wink&gt;</span></span>"},{"name":"GATENPCA00435","text":"Feast your eyes on Wonder Square! From gripping games and awe-inspiring attractions to the finest in fine dining and the freshest of refreshments, there's no end to the wonders housed within these halls."},{"name":"GATENPCA00435","text":"And let's not forget the most wondrous of them all. El Coloso─as we lovingly call our mammoth cactuar mascot─is the star of some of our most popular events. Suffice it to say, you <span class=\"emphasis\">won't</span> want to miss them!"},{"name":"GATENPCA00435","text":"Now, I know what you're thinking: “With everything going on at the Gold Saucer, how can I ever hope to keep up?” But you needn't worry─my fellow GATE Keepers and I will always be on hand to see that you don't miss a thing!"},{"name":"GATENPCA00435","text":"For the continuation of your tour, I've been instructed to direct you into the waiting arms of my colleague Veleda at the Cactpot Board. She's one of our most popular girls, and once you meet her, I'm sure you'll understand why. Well, ta-ta for now!"},{"name":"BUNNY00435","text":"<span class=\"alternative-container\"><span class=\"alternative\">Ah, there you are, my darling</span><span class=\"alternative\">Greetings, handsome</span></span>! I've been waiting for you. I'm Veleda, and I'd like to personally welcome you to Event Square."},{"name":"BUNNY00435","text":"The most spacious of all the areas of the Gold Saucer, Event Square is a veritable cornucopia of pleasure and delight. Doubtless the sizable stage in the middle of the square has caught your eye."},{"name":"BUNNY00435","text":"That is the scene of some of our most sensational attractions, so don't be shy about taking center stage!"},{"name":"BUNNY00435","text":"And after the curtain has fallen, why not try changing your life forever? At the Jumbo Cactpot, all you need is a handful of MGP and a headful of dreams!"},{"name":"BUNNY00435","text":"Just choose four numbers and cast your hopes to the heavens! You never know just when Nymeia will smile down upon you."},{"name":"BUNNY00435","text":"Now, as much as I've enjoyed getting to know you, I'm afraid it's time for us to part. The next and final leg of your tour takes you to Round Square. Don't think too hard about the name, <span class=\"alternative-container\"><span class=\"alternative\">my darling</span><span class=\"alternative\">darling</span></span>─even I'm not sure it's supposed to make sense."},{"name":"GATENPCB00435","text":"Are you the first-time visitor I was told to expect? A thousand welcomes to the Gold Saucer, and a thousand welcomes to Round Square! How can a square be round, you ask? ...I'm not sure I understand the question."},{"name":"GATENPCB00435","text":"Moving on to more important matters, is that lofty peak not a sight to behold!? That is Mt. Corel, the main attraction here at Round Square."},{"name":"GATENPCA00435","text":"One of our most thrilling events pits our customers against each other in a challenge to see who can most swiftly scale its heights. I tell you, the view from the summit is a sight to behold!"},{"name":"GATENPCA00435","text":"And that concludes your tour of the Gold Saucer! While I'm sure you're eager to start enjoying yourself, pray do not forget to return to the main counter and claim your complimentary gift!"},{"name":"INFORMATION00435","text":"Welcome back, honored guest! I trust that you've come away from the tour with a greater appreciation of all the Gold Saucer has to offer?"},{"name":"INFORMATION00435","text":"As a token of our appreciation for your patronage, it is my great pleasure to offer you a complimentary gift from the personal vaults of our esteemed proprietor─"},{"name":"ROLAND","text":"Well knock me down with a chocobo's tailfeather! Is that a new customer I see!? Ha HA! I could hardly have picked a better time to drop in for an impromptu inspection."},{"name":"INFORMATION00435","text":"M-Master Roland! Yes, this <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> here has but this moment completed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> introductory tour."},{"name":"ROLAND","text":"Is that so? Well then, allow me to personally welcome you to the Gold Saucer. I am Roland, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, the fellow entrusted with overseeing the daily affairs of this fine establishment on behalf of our esteemed proprietor─a great man if ever there was one."},{"name":"ROLAND","text":"You are an adventurer, yes? Aye, your dress and bearing told me as much. I daresay, then, that on your travels you have seen firsthand the difficulties which yet plague our nation."},{"name":"ROLAND","text":"Witnessed the struggles of Ala Mhigo's displaced masses...and those whose homes were consumed in the fires of the Calamity."},{"name":"ROLAND","text":"...The sultanate is not unsympathetic to their plight, of course, yet how can one begin to provide succor to such countless multitudes?"},{"name":"ROLAND","text":"...To whose swelling ranks were recently added the refugees from Doma. The sultanate is not unsympathetic to their plight, of course, yet how can one begin to provide succor to such countless multitudes?"},{"name":"ROLAND","text":"...And yet, at a time when our leaders should rightly be working together to ease the suffering without, there is instead no end to the fighting within. What hope then remains for this once-great realm?"},{"name":"ROLAND","text":"...The sultanate is not unsympathetic to their plight, of course, yet how can one begin to provide succor to such countless multitudes? Every solution to the problem has only served to raise more questions."},{"name":"ROLAND","text":"...One man had an answer."},{"name":"ROLAND","text":"Godbert Manderville had a dream. A dream of a house of untold wonders that would provide stable employment and lodgings to the displaced, mirth and merriment to the disconsolate, and prosperity and plenty to the sultanate at large..."},{"name":"ROLAND","text":"To many of our patrons, the Gold Saucer is merely Eorzea's foremost entertainment venue─a place to forget about their cares for the day. To me, it is one of the founding stones upon which our realm will be rebuilt─a miracle wrought by the hand of the greatest man I have ever known."},{"name":"ROLAND","text":"Something tells me you understand that which I have told you─that you, perchance, share a similar dream. But I shall keep you no longer. The Gold Saucer and all its wonders await you, friend─pray enjoy them to your heart's content. Till we meet again, may the Spinner's pull be ever kind!"}],"reward":{"items":[{"num":5,"id":10085}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65970]}},"partials":[{"type":"npc","id":"1011022","obj":{"i":1011022,"n":"Airship Ticketer","l":1484,"q":1}},{"type":"npc","id":"1010448","obj":{"i":1010448,"n":"Gold Saucer Attendant","l":1484,"q":2,"t":"Information"}},{"type":"npc","id":"1010478","obj":{"i":1010478,"n":"Triple Triad Trader","l":1484,"s":1,"q":1,"r":1,"a":1487,"c":[4.14,7.45]}},{"type":"npc","id":"1011038","obj":{"i":1011038,"n":"Gold Saucer Attendant","l":1484,"q":1,"t":"MGP Exchange"}},{"type":"npc","id":"1011079","obj":{"i":1011079,"n":"Veleda","l":1484,"q":2}},{"type":"npc","id":"1011080","obj":{"i":1011080,"n":"GATE Keeper","l":1484,"q":1}},{"type":"npc","id":"1011084","obj":{"i":1011084,"n":"GATE Keeper","l":1484,"q":1}},{"type":"item","id":"10085","obj":{"i":10085,"n":"Gold Saucer Ticket","l":1,"c":26173,"t":61}},{"type":"quest","id":"65970","obj":{"i":65970,"n":"It Could Happen to You","g":93,"l":"Ul'dah","s":141,"f":1}}]}