{"quest":{"name":"Like Mother, Like Daughter","location":"Gridania","id":65976,"patch":2.0,"sort":250,"icon":100051,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1000692,"involved":[1008146,1008147,1008148,1008149,1008150,1008157,1008158,1008159,1008160],"genre":133,"journal":["Brother E–Sumi–Yan requires your assistance in a matter concerning the young conjurer, Sylphie.","After disappearing from the guild without a word, Sylphie was later spotted by a party of conjurers in the South Shroud. Brother E–Sumi has requested that you travel to the area and escort the wayward child back to Gridania. Speak first with Wulfiue in Buscarron's Druthers to learn more of the young conjurer's present state of mind.","Wulfiue has explained that Sylphie, with her sensitivity to the voices of the elementals, must be troubled by the powerful disturbance discovered to the southeast of Buscarron's Druthers. Speak with Sylphie and see how she fares.","Upon reading her mother's journal, Sylphie has become convinced that conjury is to blame for inciting the wrath of nature. Fearing that the party of Hearers sent to cleanse the corruption are further angering the Twelveswood, the young conjurer sets off to stop them. Catch up to Sylphie before she stumbles into danger.","With a helping hand from nature, you have managed to cleanse the massive manifestation of corrupted earth. Speak with Sylphie and learn what the young conjurer is thinking.","After witnessing the battle, Sylphie has conceded that perhaps nature is not as frightening as she believed. Return to Stillglade Fane and report to Brother E–Sumi.","Having learned of her mother's honest, though misguided, motivations, Sylphie is now determined to embrace the power of nature. At long last, the young conjurer seems to have put her personal troubles behind her. The general mood of hope is dampened, however, by the revelation that the Twelveswood is suffering from some widespread and as-yet-unknown affliction. Return to your studies and seek greater mastery over your art in preparation for the day when Brother E–Sumi calls upon you once more.<br><br>※The next conjurer quest will be available from E–Sumi–Yan upon reaching level 30."],"objectives":["Speak with Wulfiue at Buscarron's Druthers.","Speak with Sylphie.","Chase after Sylphie.","Speak with Sylphie.","Report to Brother E–Sumi–Yan at Stillglade Fane.","Purify the corrupted earth!"],"dialogue":[{"name":"ESUMIYAN","text":"Welcome, <span class=\"highlight\">Forename</span>. The tales of your deeds reach me even here in the cloistered heart of Stillglade Fane."},{"name":"ESUMIYAN","text":"Glad I am that you have come, for I would ask your assistance in a matter of some delicacy. It concerns, yes, young Sylphie once again..."},{"name":"ESUMIYAN","text":"As you can no doubt imagine, the recent revelations concerning her mother have sorely troubled the poor child."},{"name":"ESUMIYAN","text":"It appears Sylphie needed some time alone to sort through the whirlwind of emotions which now beset her. She has, in short, fled from the guild."},{"name":"ESUMIYAN","text":"Fortunately, a party of conjurers who were dispatched to the South Shroud to investigate another instance of corruption sent word that they have spotted our wayward Sylphie."},{"name":"ESUMIYAN","text":"Considering the importance of their mission, I would not seek to distract the conjurers from their task. Thus, I turn to you to escort Sylphie back here to the guild. You are, I believe, one of the few people to whom she will listen."},{"name":"ESUMIYAN","text":"Pray travel to Buscarron's Druthers and speak with Wulfiue. She was the conjurer who first chanced upon Sylphie, and will be able to tell you more of how the young lady fares."},{"name":"WULFIUE","text":"We meet again, <span class=\"highlight\">Forename</span>. I assume Brother E–Sumi warned you of the corruption my companions and I have been tasked with purifying here in the South Shroud?"},{"name":"WULFIUE","text":"The source of this extensive blight is found to the southeast─the shrill, discordant voices of the elementals shriek their dismay in the vicinity of the withered treant. I suggest you give the area a wide berth."},{"name":"WULFIUE","text":"Considering the potential dangers, you might imagine how alarmed I was to discover young Sylphie wandering about this part of the Twelveswood. It seems that her mother─a woman who healed with conjury, but remained untrained by the guild─called this region her home."},{"name":"WULFIUE","text":"Sylphie herself had her head buried in some manner of tome, but if she is as sensitive to the elementals' murmurings as I am led to believe, then the din within her mind must be driving her to distraction."},{"name":"WULFIUE","text":"Pray speak with the child and see that she is well. I would do so myself if our current duty were not so pressing. We will, in fact, be setting out at any moment."},{"name":"NOLANEL","text":"<span class=\"highlight\">Forename</span>, you have grown much since last we spoke of the mysteries of earth. Though you are no doubt capable of defending yourself, I must nonetheless advise you against venturing out into the wilds until such time as balance has been restored."},{"name":"JOACIN","text":"Wulfiue divines the will of air, Nolanel is deeply rooted in earth, and I claim some small degree of mastery over water. False modesty aside, that we three were chosen to respond to this disturbance suggests that the situation is dire indeed."},{"name":"WULFIUE","text":"We are soon to depart on our mission. I am, however, relieved to know that you are here to speak with Sylphie and safeguard her well-being."},{"name":"SYLPHIE","text":"<span class=\"highlight\">Forename</span>!? Ah, I should've known that Wulfiue would tattle on me! And Brother E–Sumi sent you to take me back, didn't he?"},{"name":"SYLPHIE","text":"This is where my mother used to live, you know. Right up until she...passed on, folk were grateful for the healing she offered."},{"name":"SYLPHIE","text":"And this is the journal she used to keep. There's an entry that explains how nature becomes furious when conjurers use their art; how there are always more people wounded in battles when “mortals abuse the power that is not theirs to take.”"},{"name":"SYLPHIE","text":"My mother refused to draw on nature, because she was scared of making it angry."},{"name":"SYLPHIE","text":"She wouldn't lie about such things, and I want to do what she would've wanted. I'm going to stop using conjury altogether!"},{"name":"SYLPHIE","text":"Unnngh... I've never heard the voices this mad before."},{"name":"SYLPHIE","text":"I bet it's because Wulfiue and the others are overusing their art. We have to go and stop them!"},{"name":"SYLPHIE","text":"Gods, it's so loud... Can't you hear it? Nature is shrieking in rage..."},{"name":"NOLANEL","text":"Never has the earth so confounded me... I must apologize."},{"name":"WULFIUE","text":"Thank you for your timely assistance. With the origin of the corruption now neutralized, we should be able to cleanse whatever traces remain."},{"name":"JOACIN","text":"You possess quite an affinity for the elements... That was most impressive."},{"name":"SYLPHIE","text":"I... I can't believe nature actually helped us."},{"name":"SYLPHIE","text":"There was nothing scary about it at all."},{"name":"SYLPHIE","text":"I might still wonder if it really was safe for conjurers to borrow that power if I hadn't seen the way you wield it. Nothing could seem more...natural. I think it's time I went back to the guild."},{"name":"SYLPHIE","text":"There are a few things I need to collect first, so, please, go on ahead without me."},{"name":"ESUMIYAN","text":"Welcome back, <span class=\"highlight\">Forename</span>. And you also, Sylphie."},{"name":"SYLPHIE","text":"Brother E–Sumi, I'm sorry I ran away like that..."},{"name":"ESUMIYAN","text":"I understand, child. Did you find the answers you sought?"},{"name":"SYLPHIE","text":"Yes─thanks to <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> showed me that nature was nothing to be afraid of."},{"name":"SYLPHIE","text":"...I think I know why my mother refused to call upon its power─she believed the act caused suffering to nature itself."},{"name":"ESUMIYAN","text":"I see."},{"name":"ESUMIYAN","text":"So it was her very love for nature that prevented her from drawing on its strength."},{"name":"ESUMIYAN","text":"Tell me, Sylphie─has the fog of indecision now lifted from your mind?"},{"name":"SYLPHIE","text":"It has, Guildmaster. I understand now why my mother chose the path she did."},{"name":"ESUMIYAN","text":"Full glad am I to hear that, for I must ask of you one more question."},{"name":"SYLPHIE","text":"Yes, Brother E–Sumi?"},{"name":"ESUMIYAN","text":"When you first witnessed <span class=\"highlight\">Forename</span> cleanse a corrupted element, you mentioned hearing voices. How exactly did they sound?"},{"name":"SYLPHIE","text":"The voices? Well...they sounded joyful, like a crowd letting out a sudden cheer. I really heard them, I swear!"},{"name":"ESUMIYAN","text":"I am sure you did, Sylphie. This is a gift."},{"name":"ESUMIYAN","text":"Conjurers may sense the power of nature, and borrow from its strength. But not all can hear its whispers."},{"name":"ESUMIYAN","text":"What you describe are the voices of the elementals. You may very well possess the talent to become a Hearer."},{"name":"SYLPHIE","text":"A <span class=\"emphasis\">Hearer</span>!?"},{"name":"ESUMIYAN","text":"Of course, much relies on your studies of conjury. You have a natural aptitude, but have thus far lacked commitment. You must not neglect your training, Sylphie."},{"name":"ESUMIYAN","text":"Putting aside such matters for a moment, I am curious to hear about the disturbance you observed in the South Shroud, <span class=\"highlight\">Forename</span>. I assume from the reports I have received that it was of a different magnitude to those which you have previously encountered. Am I correct?"},{"name":"ESUMIYAN","text":"Hmmm... This bodes ill. The creatures known as “mud pies” are not native to the Twelveswood. I wonder what relation this may have to the seemingly ever-increasing frequency of these disturbances."},{"name":"ESUMIYAN","text":"Something beyond the damage wrought by the Calamity afflicts the Twelveswood. I shall commune with the elementals and seek to identify this threat."},{"name":"ESUMIYAN","text":"<span class=\"highlight\">Forename</span>, Sylphie, I may have need of you both before long. Until then, give yourselves over to the study of our art."},{"name":"ESUMIYAN","text":"Ever shall the earth meet your footfall, and the wind guide your path."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"QIB","text":"Nature is angry with us...<br>You mustn't use any more conjury!"},{"name":"QIB","text":"We are only making nature more furious!"},{"name":"QIB","text":"Even the creatures of the woods know this is wrong!"},{"name":"QIB","text":"Now nature sends thunder and lightning against us!<br>What more proof do you need!"},{"name":"QIB","text":"Elementals!? Are they angry too!?<br>We're really in trouble now!"},{"name":"QIB","text":"They... The elementals are helping us!?"},{"name":"QIB","text":"Never has the earth so confounded me..."},{"name":"QIB","text":"I can muster no second wind..."},{"name":"QIB","text":"My well has run dry..."}],"reward":{"items":[{"id":1965},{"id":3050,"one":1},{"id":3581,"one":1},{"id":27667,"one":1},{"id":2728,"one":1},{"id":5825,"one":1}],"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":7}],"quests":[65629]},"next":[65977]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1008146","obj":{"i":1008146,"n":"Sylphie","l":56,"q":1}},{"type":"npc","id":"1008147","obj":{"i":1008147,"n":"Nolanel","l":56,"q":1}},{"type":"npc","id":"1008148","obj":{"i":1008148,"n":"Joacin","l":56,"q":1}},{"type":"npc","id":"1008149","obj":{"i":1008149,"n":"Wulfiue","l":56,"q":1}},{"type":"npc","id":"1008150","obj":{"i":1008150,"n":"Sylphie","l":56,"q":1}},{"type":"npc","id":"1008157","obj":{"i":1008157,"n":"Sylphie","l":56,"q":1}},{"type":"npc","id":"1008158","obj":{"i":1008158,"n":"Nolanel","l":56,"q":1}},{"type":"npc","id":"1008159","obj":{"i":1008159,"n":"Joacin","l":56,"q":1}},{"type":"npc","id":"1008160","obj":{"i":1008160,"n":"Wulfiue","l":56,"q":1}},{"type":"item","id":"1965","obj":{"i":1965,"n":"Whispering Ash Wand","l":26,"c":32402,"t":8,"p":1778}},{"type":"item","id":"3050","obj":{"i":3050,"n":"Cotton Halfrobe","l":21,"c":42154,"t":35,"p":820}},{"type":"item","id":"3581","obj":{"i":3581,"n":"Goatskin Ringbands","l":26,"c":48240,"t":37,"p":1158}},{"type":"item","id":"27667","obj":{"i":27667,"n":"Altered Goatskin Moccasins","l":26,"c":49075,"t":38}},{"type":"item","id":"2728","obj":{"i":2728,"n":"Silver Spectacles","l":25,"c":40881,"t":34,"p":1314}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65629","obj":{"i":65629,"n":"Sylphie's Trials","g":133,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"65977","obj":{"i":65977,"n":"In Nature's Embrace","g":133,"l":"Gridania","s":300,"f":1}}]}