{"quest":{"name":"Proof of Might","location":"Gridania","id":65975,"patch":2.0,"sort":300,"icon":100057,"unlocksFunction":1,"eventIcon":71341,"issuer":1000254,"target":1000254,"involved":[1000448],"genre":130,"journal":["Guildmaster Ywain would set you a final trial.","Your visit to the Lancers' Guild has taken an unexpected turn─it would seem that Foulques has attacked a party of novice lancers in the Central Shroud, meaning the trial must wait. Ywain bids you hasten to your comrades' aid, granting you full discretion to use all necessary force if it will serve to prevent further bloodshed.","According to the lancer you rescued, Foulques was headed in the direction of the North Shroud. Intercept him before he has the chance to do any more harm.","You have prevailed over the deranged Foulques. Take word of his demise to Ywain, who awaits at the Lancers' Guild.","For the courage you displayed in defeating Foulques, Ywain declares you ready to master a devastating new technique: Lance Charge. Having learned all you can from your guildmaster, you set your sights upon challenges yet unknown. Keeping your lessons close to heart, go forth and blaze a new trail with lance in hand."],"objectives":["Investigate the scene of Foulques's attack.","Track down Foulques in the North Shroud.","Report to Ywain.","Defeat the lindwurms!","Defeat Foulques of the Mist!"],"dialogue":[{"name":"YWAIN","text":"Ah, <span class=\"highlight\">Forename</span>. Ever a sight for sore eyes."},{"name":"YWAIN","text":"By your return, I take it you are ready for the final trial. Very well, let us─"},{"name":"EDDARD","text":"G-Guildmaster Ywain!"},{"name":"YWAIN","text":"You are wounded! What has happened!?"},{"name":"EDDARD","text":"We were attacked, sir...by a Duskwight lancer...as we trained in the forest."},{"name":"EDDARD","text":"He was... He was impossibly strong...a demon... He kept screaming something about...teaching us true courage."},{"name":"YWAIN","text":"No. Not him. Not Foulques..."},{"name":"EDDARD","text":"We were...in the northwest corner of the Central Shroud...when it happened. I was able to get away...but the others... <span class=\"emphasis\">You must help the others</span>!"},{"name":"EDDARD","text":"Arrrgh..."},{"name":"YWAIN","text":"Be strong, man!"},{"name":"YWAIN","text":"I am sorry, <span class=\"highlight\">Forename</span>─the trial must wait."},{"name":"YWAIN","text":"Pray make haste to the Central Shroud and help your comrades.<br>And <span class=\"highlight\">Forename</span>─should Foulques force your hand...do what must be done. Twelve speed you on your way."},{"name":"THIBAIN","text":"Help! For the love of the Twelve, help me!"},{"name":"THIBAIN","text":"I owe you my life, friend. Another breath and I would have become wurm fodder."},{"name":"THIBAIN","text":"A Duskwight lancer unleashed the fiends upon us, claiming it would temper our courage! You should have seen the look in his eye when he said it─mad bastard!"},{"name":"THIBAIN","text":"Hm? Where is he now? Uh...I think he headed off towards the North Shroud, maybe in the direction of Fallgourd Float...? I can't say for sure─I was concentrating on the scalekin at the time."},{"name":"THIBAIN","text":"If it's a reckoning you seek, you are like to be disappointed. Those of us who managed to outrun the wurms will already have alerted the Wailers."},{"name":"THIBAIN","text":"I daresay the Duskwight is being held at spearpoint as we speak, begging for his worthless life in a puddle of his own piss. Serves the bastard right, and all!"},{"name":"FOULQUES","text":"What kept you?"},{"name":"FOULQUES","text":"Helping your comrades, you say? Fool. You waste your pity on false friends."},{"name":"FOULQUES","text":"It is only a matter of time before they betray you. Aye, just like those wretches who saw me imprisoned and exiled."},{"name":"FOULQUES","text":"I was once an upright citizen of Gridania, and a man of the Lancers' Guild. Yet life was not easy. For want of the coin to obtain the barest necessities, I conspired with my closest comrades to steal from the guild's coffers."},{"name":"FOULQUES","text":"The theft soon came to light, and though there were no suspects, it was clear that the deed had been perpetrated by someone within the ranks. An air of suspicion hung heavy over the guild from that day forth, until at last, unable to bear the guilt, I convinced my accomplices to join me in confessing..."},{"name":"FOULQUES","text":"...Only for them to bite their <span class=\"emphasis\">craven</span> tongues after I had stepped forward and admitted my part in the crime. And so it was that I alone took the blame! “Of <span class=\"emphasis\">course</span> it was the Duskwight,” everyone said. “Was there ever any doubt?” It all made perfect sense!"},{"name":"FOULQUES","text":"Despite my heartfelt pleas, my so-called friends denied any involvement. Instead they called me vulgar names that I do not care to repeat. Can you imagine the shock and anguish I felt at their betrayal?"},{"name":"FOULQUES","text":"Would that I had had the strength to force the truth out of those traitors!"},{"name":"FOULQUES","text":"Would that I had had the courage to escape my dungeon cell, even if it meant taking some hapless guard's life!"},{"name":"FOULQUES","text":"Driven by vengeance and no small amount of self-loathing, I resolved to forge my courage anew."},{"name":"FOULQUES","text":"I strode into the lairs of ravenous fiends while drenched in blood! I put their helpless offspring to the spear, that I might face the unbridled fury of their kin!"},{"name":"FOULQUES","text":"For my efforts I have acquired the ultimate courage─a courage forged amidst danger and tempered by rage!"},{"name":"FOULQUES","text":"I fear nothing! I am the greatest lancer that has ever lived!"},{"name":"FOULQUES","text":"...I-Impossible!"},{"name":"FOULQUES","text":"M-My courage is absolute!"},{"name":"FOULQUES","text":"Nooo! Come no closer!"},{"name":"YWAIN","text":"So Foulques is no more..."},{"name":"YWAIN","text":"His was a tragic tale...and one that might have been so different. Had fate not dealt him such a cruel hand, he could well have commanded a place of honor within these halls."},{"name":"YWAIN","text":"But it avails us naught to dwell upon what might have been. It is enough that you are still with us, <span class=\"highlight\">Forename</span>."},{"name":"YWAIN","text":"Lest you wonder about your final trial...there will be none─I have seen all I need to see. You have proven beyond a shadow of a doubt that yours is a genuine courage."},{"name":"YWAIN","text":"In recognition of this, I shall pass to you the secrets of Lance Charge, one of the most potent abilities in our arsenal."},{"name":"YWAIN","text":"You are a lancer in your own right now─there is naught more I can teach you. From here onwards, it is up to you to seek out such challenges as will make you grow."},{"name":"YWAIN","text":"Like attracts like, and the strong are drawn to strength. Just as I once knew for a certainty that I was destined to face the Lord of the Bramble Patch, so too will you find─or be found by─an adversary of equal worth."},{"name":"YWAIN","text":"None can say what fate will bring, but armed with your courage, there is naught you need fear. Keep close to your heart the lessons you have learned here, and go forth to blaze a new trail with spear in hand."},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“Proof of Might”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“Proof of Might”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"THIBAIN","text":"Help me! Please!"},{"name":"THIBAIN","text":"G-Get them away from me!"},{"name":"THIBAIN","text":"Nooo! I don't want to die!"},{"name":"FOULQUES","text":"We settle this once and for all!"},{"name":"FOULQUES","text":"Urgh! You will not get the better of me!"},{"name":"FOULQUES","text":"You think me without honor? To hells with your honor!"},{"name":"FOULQUES","text":"I fight for victory, and I will stop at nothing to attain it!"},{"name":"FOULQUES","text":"You are the sole lancer worthy of the name!<br>By defeating you, I will prove my courage!"}],"reward":{"action":85,"items":[{"id":1845},{"id":3100,"one":1},{"id":2753,"one":1},{"id":3597,"one":1},{"id":3827,"one":1},{"num":3,"id":5825,"one":1}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":5}],"quests":[65974]},"next":[66603]},"partials":[{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000448","obj":{"i":1000448,"n":"Foulques","l":57,"q":1}},{"type":"action","id":"85","obj":{"i":85,"n":"Lance Charge","c":309,"j":4,"t":4,"l":30}},{"type":"item","id":"1845","obj":{"i":1845,"n":"Steel Spear","l":31,"c":31828,"t":5,"p":5097}},{"type":"item","id":"3100","obj":{"i":3100,"n":"Toadskin Jacket","l":30,"c":43085,"t":35,"p":3123}},{"type":"item","id":"2753","obj":{"i":2753,"n":"Steel Sallet","l":30,"c":40035,"t":34,"p":2523}},{"type":"item","id":"3597","obj":{"i":3597,"n":"Toadskin Armguards","l":30,"c":48329,"t":37,"p":2242}},{"type":"item","id":"3827","obj":{"i":3827,"n":"Toadskin Leg Guards","l":30,"c":46323,"t":38,"p":2563}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65974","obj":{"i":65974,"n":"Questions and Lancers","g":130,"l":"Gridania","s":250,"f":1}},{"type":"quest","id":"66603","obj":{"i":66603,"n":"Eye of the Dragon","g":150,"l":"Gridania","s":1,"f":1}}]}