{"quest":{"name":"Questions and Lancers","location":"Gridania","id":65974,"patch":2.0,"sort":250,"icon":100057,"unlocksFunction":1,"eventIcon":71341,"issuer":1000254,"target":1000254,"involved":[1000590,1000756,1002815],"genre":130,"journal":["Guildmaster Ywain wants you to learn from other masters of the lancer's art.","Ywain would send you to train under the tutelage of three renowned lancers. The first of these is a man named Matheomi, who can be found at Amarissaix's Spire in the East Shroud.","Matheomi has set you a trial. Sprinkle the contents of the flask he has provided at the foot of the great tree to the north, and defeat the fell creatures that appear.","You have vanquished the blood bats. Bear word of your success back to Matheomi.","Matheomi praises your courage, and pronounces you a lancer of great promise. Your first lesson complete, it is now time to seek out Buscarron, the proprietor of Buscarron's Druthers in the South Shroud.","Buscarron gives you a bottle of Fullflower mead, and bids you make an offering of it at Mistalle's Lance, a monument nestled in a rocky cleft to the south of his tavern.","You have made an offering of the bottle of Fullflower mead at Mistalle's Lance. Report back to Buscarron at his tavern.","You listen intently as Buscarron tells you of the life of Mistalle, a man to whom all students of the lancer's art owe a debt of gratitude. Imbued with newfound appreciation for the guild, the time is come to seek out your third and final instructor. Make your way to Fallgourd Float in the North Shroud, and partake of the wisdom of Vauxclairt.","Vauxclairt has set you a trial, the first part of which requires you to procure six fingers from creatures known as balloons.","You have procured the requisite number of fingers from slain balloons. Use the grisly digits to kindle a raging flame at the gutted campfire described by Vauxclairt, and lure out the true object of your trial─the red balloon.","You have vanquished the red balloon. Bear word of your success back to Vauxclairt.","You have completed your training under the three master lancers. Report back to Ywain at the Lancers' Guild.","Ywain welcomes you back to the guild with pride in his eyes, and declares that he has little more to teach you. Only one trial remains before you may call yourself a fully fledged lancer. Dedicate yourself to your lancework, and return when you are ready to undertake the final challenge.<br><br>※The next lancer quest will be available from Ywain upon reaching level 30."],"objectives":["Speak with Matheomi at Amarissaix's Spire.","Sprinkle fresh spoken blood at the foot of the great tree.","Report to Matheomi.","Speak with Buscarron.","Offer up the Fullflower mead at Mistalle's Lance.","Report to Buscarron.","Speak with Vauxclairt at the Bobbing Cork.","Slay balloons and obtain their fingers.","Use balloon fingers at the gutted campfire.","Report to Vauxclairt.","Report to Ywain at the Lancers' Guild."],"dialogue":[{"name":"YWAIN","text":"It is good to see you again, <span class=\"highlight\">Forename</span>, and stronger than when last we spoke. Plainly, you have devoted many hours to training─which is just as well, for I have a mind to set you your next task."},{"name":"YWAIN","text":"At the Bramble Patch, you came to grasp the true meaning of courage. I would have you put that courage to the proof before three masters of our art."},{"name":"YWAIN","text":"In the many years since they began their training within these walls, these men have led very different lives, yet they share the distinction of being regarded amongst the finest lancers of their time."},{"name":"YWAIN","text":"And just as they once looked to their seniors for inspiration, so too shall you look to them. By availing yourself of their wisdom, you will take another step toward becoming a fully fledged lancer."},{"name":"YWAIN","text":"Your first instructor is a man named Matheomi. Seek him out at Amarissaix's Spire in the East Shroud, where he serves as a frontier sentry."},{"name":"YWAIN","text":"The long years at his post have honed Matheomi's perception─no detail escapes the man's piercing gaze. Present yourself before him for inspection, <span class=\"highlight\">Forename</span>, and do as he bids you."},{"name":"MATHEOMI","text":"You must be the young lancer I was told to expect. Greetings and well met. I am Matheomi, commander of the brave men and women of this spire. Now, let's have a good look at you..."},{"name":"MATHEOMI","text":"I see... You possess strength and skill in abundance, of this there is no doubt, but you still want for experience."},{"name":"MATHEOMI","text":"Oh, I don't doubt you've seen much and more. Mayhap you believe there is naught left out there to unnerve you. Yet the world is wide, and only the gods can claim to know all. You may be assured that the legendary lancers of old faltered at times."},{"name":"MATHEOMI","text":"No lancer, nor any man, can foresee all possibilities, but he <span class=\"emphasis\">can</span> steel himself for the unexpected. I would have you do just that."},{"name":"MATHEOMI","text":"Take this bottle of fresh spoken blood, and sprinkle it at the foot of the great tree to the north. Doing so will lure out creatures of the night, which you are to vanquish."},{"name":"MATHEOMI","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>, and well done. I bore witness to your battle with mine own eyes."},{"name":"MATHEOMI","text":"The blood bat bewilders its prey with its ceaseless flittering, which makes putting a spear in the beast an exercise in frustration─frustration that may easily have given rise to panic. Yet to your credit, you fought on resolutely, and thus emerged the victor."},{"name":"MATHEOMI","text":"Ywain has taught you well, young one. You have a way to go, to be sure, but beneath those rough-hewn edges I see the makings of a great lancer."},{"name":"MATHEOMI","text":"With my blessing, make your way to Buscarron's Druthers in the South Shroud. It is there that your next instructor─Buscarron himself─awaits."},{"name":"MATHEOMI","text":"The man had a unique approach to our art. Though it's a fair while since he hung up his spear, his words are well worth hearing. Indeed, lancers visit him as much for his counsel as they do his mead─good though it is."},{"name":"MATHEOMI","text":"By meeting Buscarron and availing yourself of his knowledge, your lancework will surely improve."},{"name":"BUSCARRON","text":"Well, if it isn't Ywain's protégé. I thought it was about time you arrived."},{"name":"BUSCARRON","text":"I'm Buscarron, and this here's my place. In case you're wondering why ol' Ywain sent you, I should mention I've not always been in the food and drink business─before I opened the Druthers, I manned an outpost not far from here."},{"name":"BUSCARRON","text":"Anyroad, between keeping throats wet and bellies full, I ain't got a great deal of time to chat just now, so if you don't mind, I'll get on with educating you."},{"name":"BUSCARRON","text":"Now, take this nice bottle of Fullflower mead─ Wait! Don't open it. This ain't that kind of lesson. No, I want you to make an <span class=\"emphasis\">offering</span> of it at Mistalle's Lance, which is a monument tucked away in a rocky cleft to the south of here. See the bottle safely there─complete with its contents─and when you come back, I'll tell you a story. Got all that? Good."},{"name":"BUSCARRON","text":"So you offered up the mead as I told you? And without drinking a drop? Very well, you shall have a tale of me, as promised."},{"name":"BUSCARRON","text":"Mistalle is the man who founded the Lancers' Guild, and the monument I sent you to was erected in his honor."},{"name":"BUSCARRON","text":"Mistalle was courage made flesh. Cut him and I daresay he'd have bled the stuff. It was him who first identified the two aspects of a lancer's courage, as well as how to go about tempering 'em."},{"name":"BUSCARRON","text":"And that weren't all he did. Seeing how the art had gone stale, what with our lancers keeping to the confines of the Twelveswood, he sought to bring in new techniques and methods from faraway lands."},{"name":"BUSCARRON","text":"But Gridania was a different place in his day. The outside world was a thing to be shunned back then, and non-forestborn were considered faithless savages. Aye...it was even worse than now!"},{"name":"BUSCARRON","text":"'Course, ol' Mistalle wasn't afraid to call that way of thinking what it was─a lot of ignorance and cowardice."},{"name":"BUSCARRON","text":"To cut a long story short, despite a forestful of good old Gridanian stubbornness, he finally convinced the nation to open its doors to foreign lancers. And by blending their techniques with his own, he gave the world the art which you now practice."},{"name":"BUSCARRON","text":"To this day, the Lancers' Guild accepts students regardless of their origin. That wouldn't have been possible if it hadn't been for Mistalle."},{"name":"BUSCARRON","text":"Us lancers owe him much and more, and it's our charge to carry on his legacy. Never forget that."},{"name":"BUSCARRON","text":"Eh? What's that? When's the trial!? Bwah hah hah hah hah! Much as I hate to disappoint, there isn't one. Your courage was never in doubt, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>."},{"name":"BUSCARRON","text":"My part in your training's done. 'Tis time you visited your third and final instructor, a fellow named Vauxclairt. You'll find him whiling away his time at the Bobbing Cork, like as not. Oh, that's the name of an inn in Fallgourd Float, in case you don't know. Up in the North Shroud, it is."},{"name":"BUSCARRON","text":"Vauxclairt's an old rival of mine. Me and him used to go at it till neither man could lift his spear tip off the ground. I warn you: he was a right stubborn bugger back then, and the years ain't done much to improve his humours. So, er...good luck with impressing him!"},{"name":"VAUXCLAIRT","text":"I take it you are the young lancer of whom Ywain spoke─and an adventurer besides, by the look of you. I was an adventurer myself once. That was before I became a lance for hire."},{"name":"VAUXCLAIRT","text":"But enough idle talk. You have come to learn from me, and learn from me you shall. Be warned, though, that you will not find me as lenient an instructor as the others. Now pay attention."},{"name":"VAUXCLAIRT","text":"Thus far you have learned to muster your courage in situations of fear, panic, and uncertainty. With me you will learn to do so in the face of <span class=\"emphasis\">change</span>."},{"name":"VAUXCLAIRT","text":"The enemy is a living thing, and living things are apt to change. Whatever the nature of that change, a lancer must be able to think and adapt. And to think and adapt during battle requires <span class=\"emphasis\">courage</span>."},{"name":"VAUXCLAIRT","text":"To teach you the meaning of my words, I would have you challenge a fiery fiend known as the red balloon."},{"name":"VAUXCLAIRT","text":"However, the creature will appear only where there is a raging flame. You may kindle such a flame by procuring six fingers from slain balloons, and depositing them at a gutted campfire. This should suffice to entice the red balloon."},{"name":"VAUXCLAIRT","text":"As the battle wears on, the creature's fury shall burn with ever greater fervor until it is ripe to burst in a conflagration of death. Let courage lend strength to your lance, and extinguish this fiery foe."},{"name":"VAUXCLAIRT","text":"So you have vanquished the red balloon─no less than what I would expect of one of Ywain's."},{"name":"VAUXCLAIRT","text":"Your enemy altered its nature throughout the encounter, thereby causing the terms of battle to shift repeatedly. Yet ever did you press onward, your courage holding firm in the midst of constant change. So it was that you emerged triumphant."},{"name":"VAUXCLAIRT","text":"I am not known for being liberal with my praise...but you have done well. Yours is a genuine courage."},{"name":"VAUXCLAIRT","text":"Mind you, this does <span class=\"emphasis\">not</span> give you license to forsake your training. You are still but a fledgling among us, after all."},{"name":"VAUXCLAIRT","text":"I have finished with you─you may report back to Ywain. And when you do, tell that young upstart that I <span class=\"emphasis\">demand</span> he show his face here from time to time. That is all."},{"name":"YWAIN","text":"Old Vauxclairt <span class=\"emphasis\">demands</span> I show my face? Hah hah hah!"},{"name":"YWAIN","text":"I can only assume the buxom brunette at the Float isn't lavishing him with the attention he craves! Very well, I shall see what I can do."},{"name":"YWAIN","text":"As for you, <span class=\"highlight\">Forename</span>...well done. I never doubted that you would meet with the approval of all three men, yet I am no less proud of you for having done so."},{"name":"YWAIN","text":"You have traveled far along the lancer's path, and soon you will no longer require my guidance. In fact, you need overcome but one further trial to complete your education here. Do so and I will give you my blessing to leave the Lancers' Guild and embark upon a new adventure with spear in hand. "},{"name":"YWAIN","text":"As ever, apply yourself to your lancework, and return when you are ready for your final challenge. I look forward to our next meeting."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"items":[{"id":1836},{"id":3066,"one":1},{"id":27638,"one":1},{"id":3576,"one":1},{"id":3808,"one":1},{"num":2,"id":5825,"one":1}],"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":5}],"quests":[65592]},"next":[65975]},"partials":[{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000590","obj":{"i":1000590,"n":"Buscarron","l":56,"q":14,"t":"Alehouse Proprietor"}},{"type":"npc","id":"1000756","obj":{"i":1000756,"n":"Matheomi","l":55,"q":1}},{"type":"npc","id":"1002815","obj":{"i":1002815,"n":"Vauxclairt","l":57,"q":1}},{"type":"item","id":"1836","obj":{"i":1836,"n":"Silver Battle Fork","l":26,"c":31827,"t":5,"p":2977}},{"type":"item","id":"3066","obj":{"i":3066,"n":"Velveteen Shirt","l":25,"c":42226,"t":35,"p":1428}},{"type":"item","id":"27638","obj":{"i":27638,"n":"Altered Velveteen Bandana","l":25,"c":41774,"t":34}},{"type":"item","id":"3576","obj":{"i":3576,"n":"Fingerless Goatskin Gloves","l":25,"c":44062,"t":37,"p":1282}},{"type":"item","id":"3808","obj":{"i":3808,"n":"Goatskin Crakows","l":25,"c":46156,"t":38,"p":1172}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65592","obj":{"i":65592,"n":"Lance of Destiny","g":130,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"65975","obj":{"i":65975,"n":"Proof of Might","g":130,"l":"Gridania","s":300,"f":1}}]}