{"quest":{"name":"In Nature's Embrace","location":"Gridania","id":65977,"patch":2.0,"sort":300,"icon":100051,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1000692,"involved":[1002965,1002966,1002967,1002968],"genre":133,"journal":["Brother E–Sumi–Yan would have you investigate the creeping corruption which threatens the Twelveswood.","Brother E–Sumi–Yan has tasked you and Sylphie with discerning the nature of the corruption spreading through the Twelveswood. Head to Quarrymill in the South Shroud and search the surrounding area for elemental disturbances.","You have located and cleansed a patch of corrupted soil. Speak with Sylphie and determine your next move.","Sylphie senses the taint of further corruption. Follow her directions, and seek out another disturbance.","You have cleansed a second patch of corrupted soil. Speak with Sylphie once more.","Despite your best efforts, Sylphie is certain that the forest still harbors unseen corruption. Trust in her senses, and search for a further elemental disturbance.","You have cleansed a third patch of corrupted soil. Consult Sylphie as to whether your work in the forest is done.","Worryingly, Sylphie insists that an even greater source of corruption yet remains... Follow the young conjurer to the southeast.","You have defeated Akoman. Return to Stillglade Fane and report to Brother E–Sumi–Yan.","At last, Sylphie has felt the embrace of nature and is ready to set forth upon the path of conjury alone. Observing that your experiences alongside the young conjurer have served to deepen your own understanding of the art, Brother E–Sumi rewards you with the potent healing spell Cure II. Though your tutelage under the guildmaster has come to an end, your journey as a conjurer continues ever onwards."],"objectives":["Investigate corruption in the South Shroud.","Speak with Sylphie.","Investigate the disturbance.","Speak with Sylphie.","Investigate the disturbance.","Speak with Sylphie.","Report to Brother E–Sumi–Yan at Stillglade Fane.","Defeat Akoman!"],"dialogue":[{"name":"SYLPHIE","text":"This creature is a voidsent!<br>I've heard Brother E–Sumi speak of them!"},{"name":"SYLPHIE","text":"Be careful, <span class=\"highlight\">Forename</span>!<br>You'll be paralyzed if you meet its gaze!"},{"name":"SYLPHIE","text":"It's drawing power from the corruption!<br>We have to cleanse the disturbance first!"},{"name":"SYLPHIE","text":"The corruption attracts the worst kind of monsters!"},{"name":"SYLPHIE","text":"The power of nature is so incredible!<br>I feel like I can do anything!"},{"name":"ESUMIYAN","text":"Ah, <span class=\"highlight\">Forename</span>─your presence here is most welcome. I have another task to which your maturing skills are well suited. Attend me closely."},{"name":"ESUMIYAN","text":"Expansive wounds that ooze corruption have formed throughout the forest. After examining the traces of the sizable disturbance you previously cleansed, I can only conclude that this phenomenon is the work of a malign agent."},{"name":"ESUMIYAN","text":"It must be found swiftly, lest the corruption spread, and I would have you assist in the investiga─"},{"name":"SYLPHIE","text":"Guildmaster! You must let me help!"},{"name":"ESUMIYAN","text":"Sylphie?"},{"name":"SYLPHIE","text":"Since I got back from the South Shroud, I've spent all my time studying the forces of nature! I even sat through one of Hearer Nolanel's lectures!"},{"name":"SYLPHIE","text":"The Twelveswood is crying out in pain. My skills are still a bit...lacking...in some areas, but I want to do what I can for the forest."},{"name":"ESUMIYAN","text":"Lacking? Sylphie, you have yet to master a single offensive spell. Without the means to defend yourself, it would be far too dangerous to send you off into the forest alone."},{"name":"SYLPHIE","text":"...So I am to stay here, then?"},{"name":"ESUMIYAN","text":"Not necessarily..."},{"name":"ESUMIYAN","text":"<span class=\"highlight\">Forename</span>, with your consent, I would have Sylphie accompany you once more."},{"name":"ESUMIYAN","text":"I do not propose this arrangement solely with her safety in mind. Given the nature of the investigation, it is like that Sylphie's innate talent for hearing will prove as useful to you as your conjury will to her. There is much you might accomplish together."},{"name":"ESUMIYAN","text":"Sylphie─you are not to approach any sources of corruption without <span class=\"highlight\">Forename</span> at your side. Do I make myself clear?"},{"name":"ESUMIYAN","text":"And should you chance to encounter the origin of these disturbances, <span class=\"emphasis\">do not</span> initiate a confrontation. Too often, you allow your curiosity to overwhelm your good sense. Now go, and may the elementals watch over you."},{"name":"SYLPHIE","text":"I... Yes, Guildmaster."},{"name":"SYLPHIE","text":"Something tells me we should start at Quarrymill in the South Shroud. Meet me there as soon as you can, <span class=\"highlight\">Forename</span>. And hurry─the corruption is spreading!"},{"name":"SYLPHIE","text":"There's the tainted soil, <span class=\"highlight\">Forename</span>. Please do what you can."},{"name":"SYLPHIE","text":"That was brilliant, <span class=\"highlight\">Forename</span>! But it was only the start. The forest still groans in pain─I can hear it."},{"name":"SYLPHIE","text":"I think it's coming from...the north─no, the northeast. Let's go and have a look."},{"name":"SYLPHIE","text":"More corrupted soil. Over to you."},{"name":"SYLPHIE","text":"You're doing really well, <span class=\"highlight\">Forename</span>...but I think there's another one. And, well...it calls to me even more fervently than the last."},{"name":"SYLPHIE","text":"It's to the east, I think. Yes, to the east."},{"name":"SYLPHIE","text":"Right there, <span class=\"highlight\">Forename</span>. This corruption is everywhere..."},{"name":"SYLPHIE","text":"Nice work, the earth here feels healed. And yet..."},{"name":"SYLPHIE","text":"There's another disturbance. And it's big. <span class=\"emphasis\">Really</span> big. It's hard to describe, but it feels...sort of...<span class=\"emphasis\">wrong–er</span>. I think... I think it might be what's causing all of this."},{"name":"SYLPHIE","text":"I know Brother E–Sumi said we weren't to confront it, but we can't just let it corrupt the rest of the forest. And however powerful it is, it can't be any more powerful than you. You're...well...you're <span class=\"emphasis\">amazing</span>. Wh-What I mean to say is, I'm willing to risk a scolding if you are!"},{"name":"SYLPHIE","text":"It's not far from here─somewhere to the southeast, I think. Shall we at least have a closer look?"},{"name":"ESUMIYAN","text":"Welcome back, <span class=\"highlight\">Forename</span>, Sylphie."},{"name":"SYLPHIE","text":"Our mission was a success, Guildmaster."},{"name":"ESUMIYAN","text":"Quite. I take it the two of you conspired to defy my orders?"},{"name":"SYLPHIE","text":"W-Well...the forest was suffering! We couldn't just walk away..."},{"name":"SYLPHIE","text":"It's not <span class=\"highlight\">Forename</span>'s fault! It's mine. It was all my idea. I take full responsibility!"},{"name":"ESUMIYAN","text":"Calm yourself, child."},{"name":"ESUMIYAN","text":"You did nothing I did not foresee. I am of no mind to lecture you."},{"name":"ESUMIYAN","text":"Indeed, Gridania is indebted to you for your heroic deeds. The corruption born of Akoman had taken root in the Calamity-weakened soil─there is no telling how much further it might have spread if you had not defeated the creature."},{"name":"ESUMIYAN","text":"And if I am not mistaken, Sylphie, you succeeded in drawing upon the energies of nature during the battle."},{"name":"SYLPHIE","text":"How did you─? Yes. Yes, I did. I'm not really sure how it happened. I remember thinking how badly I wanted to help <span class=\"highlight\">Forename</span>, and then I suddenly felt the power surging through me."},{"name":"ESUMIYAN","text":"That is as it should be. One does not simply <span class=\"emphasis\">choose</span> to borrow from nature's strength. The mind may command only that which the heart permits. In your desperation to help your friend, you opened your heart to nature, and nature responded to your need."},{"name":"ESUMIYAN","text":"Ah, but we must not forget your part in this, <span class=\"highlight\">Forename</span>. It is clear to me that your journey with Sylphie has brought you still closer to the pinnacle of our art."},{"name":"ESUMIYAN","text":"I believe you are ready for the last of my teachings. Thus it is with great pleasure that I pass on another of our guild's magicks─a more potent form of the Cure spell is now yours to command."},{"name":"ESUMIYAN","text":"I have no doubt that it will serve you well in your continuing endeavors. Wheresoever you go, nature will go with you, my friend. Ever shall the earth meet your footfall, and the wind guide your path."},{"name":"SYLPHIE","text":"I don't think you need to be able to hear the voices of the forest to notice <span class=\"emphasis\">that</span>, do you, <span class=\"highlight\">Forename</span>?"},{"name":"SYLPHIE","text":"The corruption is definitely coming from somewhere around here."},{"name":"SYLPHIE","text":"Hmmm...that's odd. As soon as we arrived, that sense of wrongness I had suddenly felt less...well...it just felt <span class=\"emphasis\">less</span>."},{"name":"SYLPHIE","text":"It's almost as if it's holding its breath. Or hiding."},{"name":"SYLPHIE","text":"Do you see that? Just in that one spot, there─the air seems...wrong."},{"name":"SYLPHIE","text":"Aaah!"},{"name":"SYLPHIE","text":"Heh. Heh heh. Ahahahahaha!"},{"name":"SYLPHIE","text":"Isn't it amazing, <span class=\"highlight\">Forename</span>?"},{"name":"SYLPHIE","text":"Did the breeze always feel this good?"},{"name":"SYLPHIE","text":"Was the ground always this warm?"},{"name":"SYLPHIE","text":"I'm so glad I finally understand."},{"name":"SYLPHIE","text":"I just wish I could tell my mother how incredible nature feels."},{"name":"SYLPHIE","text":"Oh, you're injured. Here."},{"name":"SYLPHIE","text":"Don't worry─healing doesn't drain me anymore."},{"name":"SYLPHIE","text":"Not since I learned how to borrow from nature."},{"name":"SYLPHIE","text":"And I have you to thank for that, <span class=\"highlight\">Forename</span>."},{"name":"SYLPHIE","text":"Let's return to the guild. We have to explain everything to Brother E–Sumi."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“In Nature's Embrace”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"}],"reward":{"action":135,"items":[{"id":2015},{"id":27669,"one":1},{"id":27671,"one":1},{"id":27670,"one":1},{"id":27672,"one":1},{"num":3,"id":5825,"one":1}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":7}],"quests":[65976]},"next":[65730,66615]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1002965","obj":{"i":1002965,"n":"Sylphie","l":56,"q":1}},{"type":"npc","id":"1002966","obj":{"i":1002966,"n":"Sylphie","l":56,"q":1}},{"type":"npc","id":"1002967","obj":{"i":1002967,"n":"Sylphie","l":56,"q":1}},{"type":"npc","id":"1002968","obj":{"i":1002968,"n":"Sylphie","l":56,"q":1}},{"type":"action","id":"135","obj":{"i":135,"n":"Cure II","c":406,"j":6,"t":2,"l":30}},{"type":"item","id":"2015","obj":{"i":2015,"n":"Walnut Cane","l":29,"c":32604,"t":9,"p":3586}},{"type":"item","id":"27669","obj":{"i":27669,"n":"Velveteen Bliaud","l":31,"c":42663,"t":35}},{"type":"item","id":"27671","obj":{"i":27671,"n":"Altered Velveteen Hose","l":31,"c":47275,"t":36}},{"type":"item","id":"27670","obj":{"i":27670,"n":"Velveteen Gloves","l":31,"c":44734,"t":37}},{"type":"item","id":"27672","obj":{"i":27672,"n":"Toadskin Boots","l":31,"c":49071,"t":38}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65976","obj":{"i":65976,"n":"Like Mother, Like Daughter","g":133,"l":"Gridania","s":250,"f":1}},{"type":"quest","id":"65730","obj":{"i":65730,"n":"Unicorn Power","g":92,"l":"Gridania","s":300}},{"type":"quest","id":"66615","obj":{"i":66615,"n":"Seer Folly","g":153,"l":"Gridania","s":1,"f":1}}]}