{"quest":{"name":"Leves of Quarrymill","location":"South Shroud","id":65979,"patch":2.0,"sort":200,"unlocksFunction":1,"eventIcon":71341,"issuer":1000823,"target":1000823,"genre":92,"journal":["Nyell, the levemete at Quarrymill, is recruiting adventurers to undertake his stack of local levequests.","Convince Nyell to allow you to undertake further levequests by completing a trial leve. Though the decidedly risk-averse levemete portrays the test as a means for him to measure the likelihood of your death, you may choose instead to consider it an assessment of your skills as an adventurer.","You have successfully completed the trial leve. Return to Quarrymill and report to Nyell.","Having been forced to concede that you seem capable of completing such tasks as he might allocate, Nyell bemusedly accepts your offer to continue risking life and limb in the service of others. Speak with the despondent levemete to undertake further levequests, and take solace in the thought that the residents of Quarrymill, at least, will be cheered by your efforts..."],"objectives":["Complete the trial leve.","Report to Nyell at Quarrymill."],"dialogue":[{"name":"NYELL","text":"Hello, I'm Nyell. I work for the Adventurers' Guild. Not looking for a job, are you? &lt;sigh&gt; But of course you aren't."},{"name":"NYELL","text":"In any case, I'm contractually obliged to tell you that I have in my possession the details of such needful tasks as have been set forth by the residents of Quarrymill and the surrounding areas─mostly involving the slaying of monsters and the procurement of goods."},{"name":"NYELL","text":"All in all, terribly dangerous work...or so they tell me. Should this idea appeal to you for some reason, I may add that I am required to assess each volunteer's chances of surviving said employment via the assignation of a similarly dangerous trial leve."},{"name":"NYELL","text":"Not put off by the thought of an abrupt and painful demise? Then please signal your intent to undertake this test."},{"name":"NYELL","text":"&lt;sigh&gt; Very good. Oh, I almost forgot: treants won't feel the effects of the bottle of Solace unless you weaken them sufficiently first. I wish you fortune in your task."},{"name":"SYSTEM","text":"Select the item icon on the duty list while targeting a treant to use the bottle of Solace."},{"name":"NYELL","text":"You may initiate the trial leve whenever you are ready. On the morrow, next year─it's honestly up to you."},{"name":"NYELL","text":"Ah, it seems I must congratulate you on completing the trial leve. Here is a reward to entice you to jeopardize your personal safety a second time."},{"name":"NYELL","text":"The trial leve is underway. You needn't speak with me again until the test is complete. A relief, I'm sure."},{"name":"NYELL","text":"I am cautiously heartened by the knowledge that you are not certain to be summarily slaughtered should you choose, for whatever reason, to undertake a levequest at some point in the future."},{"name":"NYELL","text":"Oh dear. I do hope I haven't just tempted fate..."}],"reward":{"items":[{"id":21800},{"id":3045,"one":1},{"id":3043,"one":1},{"id":27666,"one":1},{"id":5825,"one":1}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1000823","obj":{"i":1000823,"n":"Nyell","l":56,"q":1,"t":"Levemete"}},{"type":"item","id":"21800","obj":{"i":21800,"n":"Glamour Prism","l":35,"c":26235,"t":60}},{"type":"item","id":"3045","obj":{"i":3045,"n":"Iron Cuirass","l":20,"c":48002,"t":35,"p":1228}},{"type":"item","id":"3043","obj":{"i":3043,"n":"Goatskin Jacket","l":20,"c":43030,"t":35,"p":877}},{"type":"item","id":"27666","obj":{"i":27666,"n":"Altered Cotton Dalmatica","l":18,"c":42657,"t":35}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}