{"quest":{"name":"Renewing the Covenant","location":"Gridania","id":65985,"patch":2.0,"sort":75,"icon":100066,"eventIcon":71201,"issuer":1000100,"target":1003027,"involved":[1000153,1000286,1000460],"genre":1,"usedItems":[2651],"journal":["Miounne has some final words of advice to offer regarding your role in Greenbliss.","According to Miounne, all you are required to do during the ceremony is maintain an air of dignified serenity. With the proceedings due to begin at any moment, it's time to don your Monoa mask, and make your way to Mih Khetto's Amphitheatre. Estaine, the venue's hardworking caretaker, will escort you to your place.","At the ceremony, Kan–E–Senna tells you of the Warriors of Light─the adventurers who fought for the survival of Eorzea five years ago. The tale of these brave souls triggers inside your mind a vision of their final stand at the Battle of Carteneau. When you subsequently come to your senses, you are surprised to find yourself in a room at the Carline Canopy, with no idea how you got there. Near at hand, Miounne explains that you fainted, and tells you to visit the worried Elder Seedseer. Make your way to Nophica's Altar, and request admission to the Lotus Stand.","It appears that Kan–E–Senna means to ask a favor of you, and no simple one at that. Speak to her again when you are ready to hear her request."],"objectives":["Put on the Monoa mask and speak with Estaine.","Speak with Kan-E-Senna at the Lotus Stand."],"dialogue":[{"name":"MIOUNNE","text":"Now that you have the Monoa mask, all that's left is to participate in the ceremony."},{"name":"MIOUNNE","text":"Perchance you are feeling nervous, but never fear─despite all the pomp surrounding the role, there really is nothing to being Emissary."},{"name":"MIOUNNE","text":"All you are required to do is wear the mask, stand up straight, and look dignified. The more involved aspects of the proceedings will be handled by others. Simple, no?"},{"name":"MIOUNNE","text":"The ceremony will be held at Mih Khetto's Amphitheatre. When you are ready, make yourself known to the caretaker there─a woman named Estaine."},{"name":"MIOUNNE","text":"Oh, and be sure to wear your mask or she may not recognize you. Now, off you go, <span class=\"highlight\">Forename</span>, and good luck!"},{"name":"ESTAINE","text":"Ah, you must be the Emissary."},{"name":"ESTAINE","text":"I have been instructed to escort you to your place. You just need to put on the Monoa mask, and the ceremony may commence."},{"name":"ESTAINE","text":"You <span class=\"emphasis\">do</span> have the mask, don't you? If you have misplaced it, you must needs speak with Timbermaster Beatin <span class=\"emphasis\">at once</span>. And gods help you if you don't have a compelling excuse..."},{"name":"ESTAINE","text":"I see you have come prepared. That is well."},{"name":"ESTAINE","text":"I have been instructed to escort you to your place. Please follow me."},{"name":"CLATTERM","text":"Look!"},{"name":"CLATTERM","text":"The Elder Seedseer!"},{"name":"CLATTERF","text":"Twelve bless her heart!"},{"name":"KANESENNA","text":"May <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> find favor with the elementals!"},{"name":"KANESENNA","text":"This radiance..."},{"name":"KANESENNA","text":"Could it be...a Crystal of Light?"},{"name":"KANESENNA","text":"Tell me true─has the Mothercrystal revealed Herself to you? Did you bask in Her Light?"},{"name":"KANESENNA","text":"Have you perchance experienced sensations akin to aether sickness of late?"},{"name":"KANESENNA","text":"That Hydaelyn would speak directly to this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>..."},{"name":"KANESENNA","text":"There once were dauntless adventurers who fought in the name of Eorzea."},{"name":"KANESENNA","text":"When the primals threatened to bleed the land dry, these brave men and women rose to face them. When the Garlean Empire resumed its war of conquest, they rushed to the realm's defense."},{"name":"KANESENNA","text":"And when it was foretold that Dalamud would fall, they fought with all their strength to deliver us from certain doom."},{"name":"KANESENNA","text":"Yet as strong and as brave as they were, they─like so many─disappeared amidst the flames at Carteneau."},{"name":"KANESENNA","text":"None have forgotten the heroes who gave all for the sake of a realm not their own."},{"name":"KANESENNA","text":"Yet when we try to recall their names, we find the pages of our memories are blank, as if bleached by the sun."},{"name":"KANESENNA","text":"And when we try to recall their faces, we see them only in silhouette, as if they stood betwixt us and a blinding glare."},{"name":"KANESENNA","text":"Hence have these heroes come to be known as the Warriors of Light."},{"name":"KANESENNA","text":"Beholding you, illuminated by the glow of the Crystal, I could not help but be reminded of them."},{"name":"KANESENNA","text":"The Crystal has chosen you for a purpose."},{"name":"KANESENNA","text":"Trust to its guiding light, and all shall be revealed to you in good time."},{"name":"KANESENNA","text":"Though none can say for certain what the future will bring, it is my belief that you may yet play a telling role in the tale of this great realm."},{"name":"KANESENNA","text":"...For the power of the Echo resides within you."},{"name":"RAUBAHN","text":"Flames, to the fore!"},{"name":"RAUBAHN","text":"Victory belongs to the bold! Show those imperial whoresons what we're made of!"},{"name":"MERLWYB","text":"The left flank buckles! Divert the Barracudas!"},{"name":"MERLWYB","text":"Bid 'em hold that position though it cost 'em their lives!"},{"name":"KANESENNA","text":"The Yellow Serpents are in need of succor. Pray send the White Wolves to their aid."},{"name":"KANESENNA","text":"The adventurers risk life and limb for our cause. We must not fail them."},{"name":"MERLWYB","text":"Is aught amiss?"},{"name":"KANESENNA","text":"No... It is nothing."},{"name":"FLAMESOLDIER","text":"Uwaaah!"},{"name":"FLAMESOLDIER","text":"Bloody hells!"},{"name":"RAUBAHN","text":"The barrier won't go down so easily! Eyes forward!"},{"name":"KANESENNA","text":"We are being watched..."},{"name":"RAUBAHN","text":"Raging Bull calling Blood Thorn! Blood Thorn, respond! Respond, damn you!"},{"name":"RAUBAHN","text":"Arrrgh!!!"},{"name":"JAKYS","text":"(-Jakys Ryder-)Raging Bull! This is Mad Snake! Respond!"},{"name":"RAUBAHN","text":"Ryder!? This is Raging Bull! What news!?"},{"name":"JAKYS","text":"(-Jakys Ryder-)We're surrounded by a blaze! There's no way out! Gods preserve, what <span class=\"emphasis\">is</span> that thing!?"},{"name":"RAUBAHN","text":"What's going on!? Speak to me!"},{"name":"JAKYS","text":"(-Jakys Ryder-)Godsdammit! We cannot hold much longer!"},{"name":"JAKYS","text":"(-Jakys Ryder-)AaaaaaAAAAAAAAAH!!!"},{"name":"RAUBAHN","text":"Mad Snake!? Mad Snaaaaaake! Answer me!"},{"name":"RAUBAHN","text":"Damn it! Damn it all to the seventh hell!"},{"name":"MERLWYB","text":"What of the Barracudas? Can they not be reached?"},{"name":"STORMRUNNER","text":"Sorry, Admiral─shell's not workin'!"},{"name":"KANESENNA","text":"What of our own?"},{"name":"SERPENTRUNNER","text":"I cannot say, my lady! That monstrosity appears to be disrupting our communications!"},{"name":"KANESENNA","text":"We must keep trying. Call till they respond."},{"name":"SERPENTRUNNER","text":"Yes, my lady!"},{"name":"KANESENNA","text":"Admiral, General─we can do no more. We must give the order to withdraw."},{"name":"RAUBAHN","text":"I will not forsake Louisoix!"},{"name":"KANESENNA","text":"General, please! Victory may belong to the bold, but there will be no victor this day!"},{"name":"KANESENNA","text":"You know this to be true. Let us not sacrifice lives in vain."},{"name":"KANESENNA","text":"The adventurers fight bravely, but to no avail. Let them withdraw, and let us be the ones to stand with Louisoix."},{"name":"MERLWYB","text":"Belay previous orders! All Maelstrom units are commanded to fall back, effective immediately!"},{"name":"MERLWYB","text":"Give the Foreign Levy priority! Let the main host cover their retreat, and bring up the rear!"},{"name":"RAUBAHN","text":"Damn it... Relay the order: all Flames are to withdraw.<br>I don't care if our linkshells are useless!"},{"name":"RAUBAHN","text":"You still have a working pair of legs, don't you!? Well, <span class=\"emphasis\">use 'em</span>, you bloody half-wit!"},{"name":"KANESENNA","text":"The outcome of this battle was long since decided."},{"name":"KANESENNA","text":"Better to retreat now, than risk a massacre."},{"name":"KANESENNA","text":"This dark, stifling presence... Who...or what...?"},{"name":"KANESENNA","text":"We go to take our place beside Archon Louisoix! To your positions!"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">That I should live to behold Bahamut once more...</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">Magnificent. The eons of imprisonment have only made him hungrier.</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">I am aware of them. Pay them no mind. They are powerless to act.</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">It has begun. Soon the planet will regain its true form.</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">Ahahaha... Ahahahahaha!</span>"},{"name":"MIOUNNE","text":"Ah! Look who's back in the land of the living!"},{"name":"MIOUNNE","text":"Hm? You mean to say you don't remember a thing?"},{"name":"MIOUNNE","text":"You collapsed in the middle of the ceremony─gave us all a good fright. So we carried you back here. I must say, you're heavier than you look!"},{"name":"MIOUNNE","text":"You've hardly stopped of late─your exertions must have caught up with you."},{"name":"MIOUNNE","text":"But you adventurers are nothing if not resilient! Seeing as the worst is past, I shall take my leave and return to my duties."},{"name":"MIOUNNE","text":"Oh, I almost forgot─the Elder Seedseer told me she'd like to see you when you felt well enough."},{"name":"MIOUNNE","text":"The gentle soul was almost as worried about you as I was, bless her. When you're back on your feet, be sure and visit her at the Lotus Stand."},{"name":"BEATINE","text":"Twelve as my witness... I will not bother speculating how you lost the mask, though I find it hard to believe it was not <span class=\"emphasis\">intentional</span>."},{"name":"BEATINE","text":"See that you don't lose <span class=\"emphasis\">this</span> one. Now stop wasting time and continue your quest. This minstrel's tale cannot reach its climax till all the players be assembled."},{"name":"DOORMANLOTUS","text":"Ah, you are <span class=\"highlight\">Forename Surname</span>, are you not? I bid you welcome, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">sir</span></span>. The Elder Seedseer left word that you would be joining her at the Lotus Stand. May I show you in?"},{"name":"Q2","text":"Proceed to the Lotus Stand?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"DOORMANLOTUS","text":"Very well. Yet know that it is not meet to keep the Elder Seedseer waiting."},{"name":"KANESENNA","text":"I have looked forward to your coming, <span class=\"highlight\">Forename</span>. But tell me, are you recovered?"},{"name":"KANESENNA","text":"I am most glad of that. Now, I hope you will not doubt the earnestness of my concern...but I would ask a favor of you. Nor can I deny that I summoned you here in part with this in mind. Know, however, that I proceed only upon the understanding that you are rested and well."}],"reward":{"gil":319,"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65984]},"next":[66043]},"partials":[{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1003027","obj":{"i":1003027,"n":"Kan-E-Senna","l":347,"q":9}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000286","obj":{"i":1000286,"n":"Estaine","l":53,"q":4}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"item","id":"2651","obj":{"i":2651,"n":"Monoa Mask","l":1,"c":40403,"t":34,"p":100}},{"type":"quest","id":"65984","obj":{"i":65984,"n":"Festive Endeavors","g":1,"l":"Gridania","s":74}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}}]}