{"quest":{"name":"Dread Is in the Air","location":"Central Shroud","id":65982,"patch":2.0,"sort":72,"eventIcon":71201,"issuer":1000471,"target":1000100,"genre":1,"journal":["Luquelot appears to be in need of assistance.","At Bentbranch Meadows, you learn from Luquelot that Ixali dirigibles have been crossing the Twelveswood's borders seemingly at will. Concerned that something may be amiss with the elementals, he has committed the details of his sightings to parchment, and bids you deliver the document to Miounne.","Miounne's face turns deathly pale as she reads Luquelot's letter. It would seem trouble is brewing, and that your aid is needed once more. Prepare yourself for a mission of grave import, and then request further orders from Miounne."],"objectives":["Deliver Luquelot's letter to Miounne."],"dialogue":[{"name":"LUQUELOT","text":"My thanks for your kindness earlier. I hate to impose again, but I have need of your assistance in another matter─one of grave import, I fear."},{"name":"LUQUELOT","text":"Of late, I have noticed that Ixali dirigibles have been appearing over the Twelveswood with increasing regularity. The frequency, however, does not bother me near so much as <span class=\"emphasis\">where</span> they choose to fly─the patch of sky directly above the Guardian Tree."},{"name":"LUQUELOT","text":"The tree is a sacred site, or so I was given to believe when first I came to Gridania, and thus I naturally assumed that the elementals would not suffer the Ixal to profane it. Yet the birdmen have been coming and going as they please, with nary a sign of protest from the guardians of the Twelveswood."},{"name":"LUQUELOT","text":"And it was that which set me to thinking... Ever since the appearance of the much-talked-about “suspicious individual,” many and more strange things have been occurring in the forest. Could it be that he did something to the elementals?"},{"name":"LUQUELOT","text":"In case it proved useful, I have committed the details of my sightings to parchment, and would ask that you deliver the document to Mother Miounne."},{"name":"LUQUELOT","text":"Please make all haste─I have an irrepressible feeling that something terrible is about to happen."},{"name":"MIOUNNE","text":"Hello there, <span class=\"highlight\">Forename</span>. Word of your tireless efforts at Bentbranch Meadows has reached my ears. The folk there have naught but the highest praise for you!"},{"name":"MIOUNNE","text":"You certainly have a knack for making Mother proud."},{"name":"MIOUNNE","text":"Keep up the good work, you hear?"},{"name":"MIOUNNE","text":"Hm? A letter...from Luquelot?"},{"name":"MIOUNNE","text":"I haven't the slightest inkling what this could be about..."},{"name":"MIOUNNE","text":"Gods be good..."},{"name":"MIOUNNE","text":"I have a mission for you, <span class=\"highlight\">Forename</span>. Suffice it to say, it is urgent."},{"name":"MIOUNNE","text":"I fear it may also prove dangerous, however, so you <span class=\"emphasis\">must</span> be prepared."},{"name":"MIOUNNE","text":"Make what arrangements you can, and report back to me the moment you are ready."}],"reward":{"gil":230,"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65697]},"next":[65983]},"partials":[{"type":"npc","id":"1000471","obj":{"i":1000471,"n":"Luquelot","l":54,"q":5}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"quest","id":"65697","obj":{"i":65697,"n":"Leia's Legacy","g":1,"l":"Central Shroud","s":71}},{"type":"quest","id":"65983","obj":{"i":65983,"n":"To Guard a Guardian","g":1,"l":"Gridania","s":73}}]}