{"quest":{"name":"Leves of Camp Tranquil","location":"South Shroud","id":65980,"patch":2.0,"sort":300,"unlocksFunction":1,"eventIcon":71341,"issuer":1002397,"target":1002397,"genre":92,"journal":["Merthelin, the levemete at Camp Tranquil, seeks capable adventurers to undertake his many tasks.","Merthelin is eager to have you begin accepting levequests, but first you must complete a trial leve to prove that your skills as an adventurer are up to the task.","You have successfully completed the trial leve. Return to Camp Tranquil and report to the levemete, Merthelin.","Merthelin is clearly overjoyed at your success. Prove his trust in you is well placed by undertaking future levequests in service to the people of Camp Tranquil."],"objectives":["Complete Merthelin's trial leve.","Report to Merthelin at Camp Tranquil."],"dialogue":[{"name":"MERTHELIN","text":"Looking for a spot of work? Then you've come to the right place. I'm Merthelin, a representative of the Adventurers' Guild."},{"name":"MERTHELIN","text":"As the levemete stationed here in Camp Tranquil, I'm responsible for assigning the various tasks that come in from the beleaguered locals."},{"name":"MERTHELIN","text":"Quite a number of these tasks can entail a significant degree of danger, however. If I'm to set you loose on my leves with a clear conscience, I must first be convinced of your capacity to surmount the challenges you're likely to encounter."},{"name":"MERTHELIN","text":"Hmmm. How about we start you off with a leve of my choosing, and see how you get on? Let's try this one, shall we?"},{"name":"MERTHELIN","text":"Excellent. Pray be aware that while you are retrieving the furs, you may encounter the poachers themselves. I suggest you arm yourself for battle. Good fortune to you, adventurer, and I hope to receive word of your success in the very near future!"},{"name":"MERTHELIN","text":"The leve can be initiated once your preparations are complete. You need not rush into these things until you are sure you are quite ready."},{"name":"MERTHELIN","text":"Bravo, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I had a feeling you would do well from the moment we met. And though this was but a trial, you earned your reward nonetheless."},{"name":"MERTHELIN","text":"Now that your trial leve has begun, I'm afraid you're on your own. Speak with me again once your task is complete."},{"name":"MERTHELIN","text":"I must say, I was rather impressed with your results! I see no reason not to grant you access to a greater range of levequests."},{"name":"MERTHELIN","text":"Your most difficult task now is choosing what to attempt next!"}],"reward":{"items":[{"id":21800},{"id":3102,"one":1},{"id":3100,"one":1},{"id":27669,"one":1},{"num":4,"id":5825,"one":1}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1002397","obj":{"i":1002397,"n":"Merthelin","l":56,"q":1,"t":"Levemete"}},{"type":"item","id":"21800","obj":{"i":21800,"n":"Glamour Prism","l":35,"c":26235,"t":60}},{"type":"item","id":"3102","obj":{"i":3102,"n":"Steel Cuirass","l":30,"c":48003,"t":35,"p":4373}},{"type":"item","id":"3100","obj":{"i":3100,"n":"Toadskin Jacket","l":30,"c":43085,"t":35,"p":3123}},{"type":"item","id":"27669","obj":{"i":27669,"n":"Velveteen Bliaud","l":31,"c":42663,"t":35}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}