{"quest":{"name":"To Guard a Guardian","location":"Gridania","id":65983,"patch":2.0,"sort":73,"icon":100065,"eventIcon":71201,"issuer":1000100,"target":1003061,"involved":[1000423,1000456],"genre":1,"journal":["Miounne has a mind to assign you a mission of great import.","Miounne tells you that the Guardian Tree, held sacred by the Gridanians, may fall under Ixali attack. She gives you a letter and bids you deliver it to Bowlord Lewin at the Seat of the First Bow.","A large Ixali force has amassed at the Guardian Tree. Make all haste to Everschade, and assist in the great tree's defense.","You have succeeded in repelling the Ixal, whom evidence suggests were acting under the command of the mysterious masked mage.","What is the significance of the black crystal that was left at the scene, and who exactly are the two scholars from Sharlayan? For now, set aside your questions, and make your way back to the Seat of the First Bow, where Bowlord Lewin awaits.","At the Seat of the First Bow, you are graciously received by Elder Seedseer Kan–E–Senna. As a token of her gratitude for saving the day, she invites you to serve as Emissary in the forthcoming Greenbliss ceremony. Touched by her gesture, you are inspired anew to continue to strive for the good of Gridania."],"objectives":["Deliver Miounne's letter to Bowlord Lewin.","Make haste to the Guardian Tree.","Return to the Seat of the First Bow and speak with Lewin.","Speak with Lewin."],"dialogue":[{"name":"MIOUNNE","text":"Time is of the essence, so I shall speak plain."},{"name":"MIOUNNE","text":"Based on Luquelot's observations, the Ixal have designs on the Guardian Tree, and they mean to act soon."},{"name":"MIOUNNE","text":"The tree is the oldest living thing in this ancient forest, and it is held sacred by every forestborn Gridanian."},{"name":"MIOUNNE","text":"Should it come to any harm, the elementals would fly into a rage beyond pacifying. I dread to think of the chaos that would ensue."},{"name":"MIOUNNE","text":"There isn't much time. We must act quickly."},{"name":"MIOUNNE","text":"<span class=\"highlight\">Forename</span>, please see this letter to the hands of Bowlord Lewin, at the Seat of the First Bow in Quiver's Hold. Should the need arise, pray put yourself wholly at the man's disposal. I strongly suspect he will need all the able-bodied souls he can muster."},{"name":"MIOUNNE","text":"The fate of Gridania hangs in the balance. Go swiftly, <span class=\"highlight\">Forename</span>."},{"name":"DOORMANSINYU","text":"An urgent message from Mother Miounne? Very well, you may enter."},{"name":"Q1","text":"Proceed to the Seat of the First Bow?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"DOORMANSINYU","text":"Mayhap the messenger has forgotten the message? Should you gather your wits, I will be here."},{"name":"LEWIN","text":"So you are <span class=\"highlight\">Forename Surname</span>, the adventurer of whom I have heard so much. I understand you wish words with me."},{"name":"LEWIN","text":"Miounne has information on the Ixal, you say? Speak freely─you have both my ears."},{"name":"LEWIN","text":"...Matron forfend! They mean to defile the <span class=\"emphasis\">Guardian Tree</span>?"},{"name":"LEWIN","text":"Before Nophica, I swear those filthy birdmen will not touch it─nay, not so much as a single leaf!"},{"name":"LEWIN","text":"Twelve help me! How can it be that neither the Wood Wailers nor the Gods' Quiver caught wind of this?"},{"name":"LEWIN","text":"I cannot help but think this plot bears the mark of the masked devil who has eluded us for so long. We must be wary─this incursion may be more than it seems."},{"name":"LEWIN","text":"Ah, would that the Warriors of Light were still with us...<br>But this is no time for such idle thoughts. I thank you for delivering this message. You may assure Miounne that I will dispatch a unit of my best men to investi─"},{"name":"SINYUSOLA","text":"My lord!"},{"name":"LEWIN","text":"What is it!?"},{"name":"SINYUSOLA","text":"It's the Ixal, sir! The Ixal have amassed at the Guardian Tree!"},{"name":"LEWIN","text":"Already!? Bloody hells..."},{"name":"LEWIN","text":"<span class=\"highlight\">Forename</span>─Miounne believes you capable, and I can think of no better judge than she. Lend us your strength this day─aid in the defense of the Guardian Tree!"},{"name":"SINYUCOMMAND","text":"The Bowlord sent you, yes? Good to have you with us!"},{"name":"SINYUCOMMAND","text":"The birdmen have completely surrounded the Guardian Tree, and their calls grow more urgent by the minute."},{"name":"SINYUCOMMAND","text":"Whatever it is they mean to do, we cannot let them go through with it. They must be stopped, no matter the cost!"},{"name":"Q2","text":"Duty calls. Do you wish to proceed with<br>“To Guard a Guardian”?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"IXALPRIESTS","text":"(-Ixali Occultists-)<span class=\"highlight-purple\">O mournful voice of creation!<br>O mournful voice of time!</span>"},{"name":"IXALGURU","text":"Squaaawk! Attend me, all!"},{"name":"IXALGURU","text":"To us, this forest, Tinolqa, belongs!"},{"name":"IXALGURU","text":"Wisdom of Paragons, we possess! To our former glory, restore us it will!"},{"name":"IXALGURU","text":"From this tree, a great crystal we take! Unto Garuda, an offering we shall make!"},{"name":"IXALGURU","text":"Unfeathered ones and elementals, banish we shall! Our ancient home, reclaim we will! Squaaawk!"},{"name":"LEWIN","text":"First squad, left flank. Second and third, right flank."},{"name":"LEWIN","text":"The rest, form the main host with me. It is high time we reminded our Ixal guests why we Quivermen are to be feared!"},{"name":"LEWIN","text":"This position is yours, adventurer. May the elementals keep you!"},{"name":"IXALGURU","text":"Squawk!?"},{"name":"IXALGURU","text":"Interrupt us, you dare!? In your own blood, you shall bathe!"},{"name":"SYSTEM","text":"Defeat the Ixal!"},{"name":"SINYUSOLB","text":"Impressive work, adventurer."},{"name":"SINYUSOLB","text":"The Bowlord bids you hold this position. Enemies may yet lurk near, so stay on your guard."},{"name":"SINYUSOLB","text":"We go to bolster the left flank, where the battle yet rages."},{"name":"MASKEDMAGUS","text":"The source of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength becomes clear..."},{"name":"MASKEDMAGUS","text":"You may have bested the golem, but you will not fare so well this day."},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">O mournful voice of creation! Send unto me a creature of the abyss, my thrall to command, that I may smite mine enemies!</span>"},{"name":"MASKEDMAGUS","text":"Your very being imperils the plan. You cannot be suffered to live."},{"name":"SYSTEM","text":"Defeat the masked mage!"},{"name":"MASKEDMAGUS","text":"Unnngh... That the wisdom of the Paragons should be brought low...by mere mortals..."},{"name":"PAPALYMO","text":"...Paragons?"},{"name":"YDA","text":"That's what I heard."},{"name":"PAPALYMO","text":"The Bringers of Chaos...or <span class=\"emphasis\">Ascians</span>, to give them their proper name."},{"name":"PAPALYMO","text":"It would seem our suspicions were correct─it is they who have been manipulating the beast tribes."},{"name":"LEWIN","text":"<span class=\"highlight\">Forename</span>, are you unharmed!? Had I known this creature was near, I would have <span class=\"emphasis\">sent</span> men, not called them away!"},{"name":"SINYUSOLB","text":"There is no mistake, sir─he is the one who stirred the Ixal from their nest. Our intelligence was reliable."},{"name":"LEWIN","text":"So <span class=\"emphasis\">this</span> is the man who has eluded us for so long?"},{"name":"YDA","text":"Right! We finally got him!"},{"name":"PAPALYMO","text":"We sensed an ominous presence, and came here as swiftly as our legs would carry us."},{"name":"YDA","text":"Well, it's good to know what we're up against, anyway."},{"name":"LEWIN","text":"My thanks as ever, friends."},{"name":"LEWIN","text":"Quivermen! Move out!"},{"name":"LEWIN","text":"To say you played an instrumental role in the success of this mission would scarcely do justice to your efforts this day, adventurer. Upon your return to Gridania, pray visit me at Quiver's Hold. I will see to it that you receive the thanks you are due."},{"name":"YDA","text":"Hmmm...you're probably wondering why we <span class=\"emphasis\">always</span> seem to appear when there's trouble, right?"},{"name":"YDA","text":"Well, trust me when I tell you that it's almost never our fault. Despite what it looks like, Papalymo and I are actually <span class=\"emphasis\">helping</span> the Gridanians. And we've been doing so for a good few years, too. Oh! Did I mention that we're not from around here?"},{"name":"YDA","text":"Hm? Why, yes, we <span class=\"emphasis\">are</span> Sharlayans! However did you know?"},{"name":"PAPALYMO","text":"So I <span class=\"emphasis\">wasn't</span> mistaken..."},{"name":"YDA","text":"Mistaken? About what?"},{"name":"PAPALYMO","text":"Nothing. Nothing at all."},{"name":"YDA","text":"Awww! You <span class=\"emphasis\">always</span> do that! Mumble something loaded with meaning, only to keep it to yourself when someone asks! It's unfair! And it's <span class=\"emphasis\">especially</span> unfair when the someone is me!"},{"name":"PAPALYMO","text":"Oh, do calm down! I'll tell you later."},{"name":"YDA","text":"Hmph! I bet you won't. Anyway, all's well that ends well."},{"name":"PAPALYMO","text":"...Quite. We'd best be on our way."},{"name":"YDA","text":"See you later!"},{"name":"DOORMANSINYU","text":"Welcome back, adventurer. Your exploits at the Guardian Tree are the stuff of songs. The Bowlord awaits you within."},{"name":"Q3","text":"Proceed to the Seat of the First Bow?"},{"name":"A3","text":"Yes"},{"name":"A3","text":"No"},{"name":"DOORMANSINYU","text":"Let me know when you are ready to proceed, and I will admit you."},{"name":"LEWIN","text":"I have awaited your return, <span class=\"highlight\">Forename</span>. Allow me to thank you again for helping us to defend the Guardian Tree."},{"name":"LEWIN","text":"Not only did you put the invading Ixal to rout─you confronted the masked mage and his fell minion, and emerged the victor."},{"name":"LEWIN","text":"I have good men and women under me, none of whom give me cause for complaint─but you, <span class=\"highlight\">Forename</span>, are a class apart."},{"name":"LEWIN","text":"Your strength, your determination, your heart..."},{"name":"LEWIN","text":"You have all the makings of a great adventurer. Miounne is seldom mistaken in her appraisals, and she is plainly not mistaken now."},{"name":"LEWIN","text":"Gridania is stronger for your presence. The Elder Seedseer will doubtless be pleased to learn that a capable adventurer like you has come to us."},{"name":"LEWIN","text":"Once more, I thank you. Owing to your valor, disaster has been averted."},{"name":"SINYUSOL","text":"Elder Seedseer!"},{"name":"SINYUSOL","text":"My lady!"},{"name":"KANESENNA","text":"I am come to express my gratitude for your valiant efforts before the Guardian Tree."},{"name":"KANESENNA","text":"I am informed that an adventurer of singular talent now walks amongst us. You are <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>, are you not?"},{"name":"KANESENNA","text":"Hm? You seem...familiar to me. We have...met before?"},{"name":"KANESENNA","text":"No...I do not believe we have."},{"name":"KANESENNA","text":"Forgive me. Mayhap you are merely exactly as I pictured you when the elementals told me of your deeds."},{"name":"KANESENNA","text":"My name is Kan-E-Senna, and it is my solemn charge to watch over all who call Gridania home."},{"name":"KANESENNA","text":"Well met and well come to our fair nation."},{"name":"KANESENNA","text":"It was your valor that won us the day, I believe. On behalf of all Gridanians, I offer you my humblest thanks."},{"name":"KANESENNA","text":"This gift I present to you as a small token of my gratitude. I hope that you will ever remain a friend to Gridania."},{"name":"KANESENNA","text":"Greenbliss is coming. It is an age-old ceremony to renew the bond between man and elemental."},{"name":"KANESENNA","text":"Over the centuries, it has blossomed into a joyous festival encompassing Gridanians from every walk of life."},{"name":"KANESENNA","text":"I should be most gratified if you would participate in the ceremony as Emissary."},{"name":"SINYUSOL","text":"&lt;gasp&gt;"},{"name":"SINYUSOL","text":"Such a great honor!"},{"name":"KANESENNA","text":"I look forward to seeing you on that most joyous of days."},{"name":"KANESENNA","text":"Till then, fare you well. May you walk in the light of the Crystal."},{"name":"WOODWAILERLANCE","text":"Protect the Guardian Tree with your lives! For Gridania!"},{"name":"ARCHER","text":"Do not lower your guard! The next wave comes!"},{"name":"MASKEDMAGE","text":"You will perish here!"},{"name":"MASKEDMAGE","text":"Where...? Where do you get such strength!?"},{"name":"IDA","text":"In the nick of time!"},{"name":"IDA","text":"Looks like you could do with a hand!"},{"name":"IDA","text":"Hurry it up, Papalymo!"},{"name":"PAPARIMO","text":"I trust you won't object to our assistance!"},{"name":"QIB","text":"The enemy chieftain is mine!"},{"name":"QIB","text":"We shall engage the main flock!"},{"name":"QIB","text":"A voidsent!? Th-This bodes ill!"},{"name":"QIB","text":"Another wave!? Where are they coming from!?"},{"name":"QIB","text":"Wisdom of Paragons, almighty is!<br>Perish, unfeathered ones shall!"},{"name":"QIB","text":"Creature of the abyss! Mine enemies, strike down!"},{"name":"QIB","text":"Ugh... Is this...the end?"},{"name":"QIB","text":"Hold fast! We almost have him!"},{"name":"QIB","text":"Stubborn bastards..."},{"name":"QIB","text":"You must not...fail..."},{"name":"QIB","text":"I was...careless..."},{"name":"QIB","text":"I'm done for..."},{"name":"QIB","text":"Soon, you shall take your vile gifts to the grave!"},{"name":"QIB","text":"Mwahahaha! Writhe!<br>Writhe as the venom eats its way through your veins!"},{"name":"QIB","text":"Unwelcome guests... No matter, all shall fall before me!"},{"name":"QIB","text":"How is this possible...?"},{"name":"QIB","text":"I trust you won't object to our assistance!"},{"name":"QIB","text":"Looks like you could do with a hand!"},{"name":"QIB","text":"Whence comes your strength!?"},{"name":"QIB","text":"It is past time we finished this!"},{"name":"QIB","text":"Come on! We're almost there!"}],"reward":{"items":[{"id":4428}],"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65982]},"next":[65984]},"partials":[{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1003061","obj":{"i":1003061,"n":"Lewin","l":346,"q":6}},{"type":"npc","id":"1000423","obj":{"i":1000423,"n":"Gods' Quiver Bow","l":52,"q":6}},{"type":"npc","id":"1000456","obj":{"i":1000456,"n":"Gods' Quiver Instructor","l":54,"q":1}},{"type":"item","id":"4428","obj":{"i":4428,"n":"Gridanian Ring","l":15,"c":54410,"t":43,"p":100}},{"type":"quest","id":"65982","obj":{"i":65982,"n":"Dread Is in the Air","g":1,"l":"Central Shroud","s":72}},{"type":"quest","id":"65984","obj":{"i":65984,"n":"Festive Endeavors","g":1,"l":"Gridania","s":74}}]}