{"quest":{"name":"Festive Endeavors","location":"Gridania","id":65984,"patch":2.0,"sort":74,"eventIcon":71201,"issuer":1003061,"target":1000100,"involved":[1000153,1000423,1000437],"genre":1,"journal":["Bowlord Lewin has information regarding your role in Greenbliss.","It appears that you will need to make certain preparations if you are to play the part of Emissary. Lewin suggests you consult Miounne regarding the necessary arrangements. Though humbled by the Elder Seedseer's gesture, you cannot help but feel apprehensive about what now seems a heavy responsibility. Then again, honor and duty always did go hand in hand...","Miounne explains that the Emissary plays an active role in the ceremony at the heart of the Greenbliss festival. It would appear you have been entrusted with the not insignificant task of representing mankind. Present yourself to Timbermaster Beatin of the Carpenters' Guild, and receive from him the ceremonial artifact traditionally worn during the rite.","The timbermaster has given you a wooden lockbox, along with a sinister warning. Return to the Carline Canopy, and present the former to Miounne.","According to Miounne, the Monoa mask given to you by Timbermaster Beatin is carved from consecrated lumber rendered up by the Guardian Tree. Now equipped to play the role of Emissary, you look forward to the festival's commencement with growing excitement...and perhaps a hint of anxiety."],"objectives":["Consult Miounne.","Collect the artifact from Beatin.","Deliver the wooden lockbox to Miounne."],"dialogue":[{"name":"LEWIN","text":"None in Gridania can doubt your worth, <span class=\"highlight\">Forename</span>..."},{"name":"LEWIN","text":"But to receive such praise from the Elder Seedseer herself!"},{"name":"LEWIN","text":"And nor is that the half of it! She chose you to play the role of Emissary, for gods' sakes! You! An <span class=\"emphasis\">outsider</span>! Do you have any idea what this means!?"},{"name":"LEWIN","text":"&lt;sigh&gt; But of course you don't. You are not forestborn...which is rather the point. Mistake me not, I think you worthy, but your selection is all but unprecedented. And I'll wager you have not the faintest inkling what is required of you..."},{"name":"LEWIN","text":"There are preparations that the Emissary must needs complete ahead of time. I suggest you consult Miounne regarding the matter─she is overseeing the arrangements for the event."},{"name":"LEWIN","text":"Now, you had best get going─the ceremony cannot commence without the Emissary.<br>Oh, and, <span class=\"highlight\">Forename</span>...don't make a hash of this!"},{"name":"MIOUNNE","text":"Well, well, if it isn't the Emissary <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! Had I known you were coming, I would have baked a pie!"},{"name":"MIOUNNE","text":"You truly are full of surprises, <span class=\"highlight\">Forename</span>. Next you'll be telling me you're one of the Warriors of Light, back from a half-decade long holiday!"},{"name":"MIOUNNE","text":"But let's speak of preparations. As you doubtless already know, Greenbliss is an age-old ceremony for strengthening the bond between man and elemental. These days, though, the name also refers to the festival at large."},{"name":"MIOUNNE","text":"In the ceremony, the Emissary serves as a conduit─a bridge between the people and the guardians of the Twelveswood. Suffice it to say, it is no small responsibility─nor does the Elder Seedseer choose mankind's representative on a whim."},{"name":"MIOUNNE","text":"Seldom in history have non-forestborn been chosen for the role─which should give you an idea of the magnitude of the honor being accorded you."},{"name":"MIOUNNE","text":"For your part, you are required to wear a ceremonial artifact, which is presently in the keeping of Timbermaster Beatin."},{"name":"MIOUNNE","text":"Go to the Carpenters' Guild and collect it from the man, then return to me for further instructions."},{"name":"BEATINE","text":"So you are the Emissary-to-be. Miounne sent word that you would be coming to collect the ceremonial artifact."},{"name":"BEATINE","text":"The good news is that it's ready─painstakingly crafted by these very hands, and from the <span class=\"emphasis\">rarest</span> of materials."},{"name":"BEATINE","text":"Take it, along with this warning: get so much as a scratch on the thing, and I shall make an unceremonial artifact out of <span class=\"emphasis\">you</span>."},{"name":"MIOUNNE","text":"Back from your trip to the Carpenters' Guild? Let's see what you have in that box."},{"name":"MIOUNNE","text":"Ahhh...this is by far the finest Monoa mask I have ever laid eyes upon. The timbermaster has truly outdone himself this time."},{"name":"MIOUNNE","text":"In case he didn't mention, the mask is crafted from consecrated lumber rendered up by the Guardian Tree, solely for use in the ceremony. In other words, it is <span class=\"emphasis\">priceless</span>─Mother bids you to handle it with care."},{"name":"MIOUNNE","text":"And with that, your preparations are complete. The venue should just about be in order as well. If you have any questions, now's the time to ask them."},{"name":"Q1","text":"Proceed to the Seat of the First Bow?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"}],"reward":{"gil":230,"items":[{"id":2651}],"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65983]},"next":[65985]},"partials":[{"type":"npc","id":"1003061","obj":{"i":1003061,"n":"Lewin","l":346,"q":6}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000423","obj":{"i":1000423,"n":"Gods' Quiver Bow","l":52,"q":6}},{"type":"npc","id":"1000437","obj":{"i":1000437,"n":"Zacheus","l":55,"q":2}},{"type":"item","id":"2651","obj":{"i":2651,"n":"Monoa Mask","l":1,"c":40403,"t":34,"p":100}},{"type":"quest","id":"65983","obj":{"i":65983,"n":"To Guard a Guardian","g":1,"l":"Gridania","s":73}},{"type":"quest","id":"65985","obj":{"i":65985,"n":"Renewing the Covenant","g":1,"l":"Gridania","s":75}}]}