{"quest":{"name":"So You Want to Be an Arcanist","location":"Limsa Lominsa Lower Decks","id":65987,"patch":2.0,"sort":0,"icon":100100,"unlocksFunction":1,"eventIcon":71341,"issuer":1000895,"target":1000895,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"MURIE","text":"Welcome to the Arcanists' Guild. It is here that we research and develop the field of arcanima."},{"name":"MURIE","text":"Arcanima is the science of employing “arcane geometries”─intricate patterns that map the unlocked mysteries of existence─to draw forth and manipulate the body's aetheric energies."},{"name":"MURIE","text":"If you prefer an arcane art built on structured thought and precise reasoning, then your discerning intellect may find a home here at our guild. Might you consider enrolling yourself as an initiate?"},{"name":"Q1","text":"Do you wish to join the Arcanists' Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MURIE","text":"You display an admirable measure of self-awareness. The path of the arcanist would be rocky indeed should you lack the requisite intellectual curiosity."},{"name":"MURIE","text":"Ah, I admire your academic ambition. But I am afraid your enthusiasm is a step ahead of your ability─we cannot accept initiates who have yet to build a solid foundation in their primary discipline. Your focus must not be unduly divided, you understand."},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"MURIE","text":"Aha, just as I predicted. Before we proceed any further, however, let us first feed your appetite for knowledge with a morsel of guild history."},{"name":"MURIE","text":"The roots of arcanima can be traced back to the esoteric calculations practiced by the people of the south sea isles. It was these island folk that first discovered a method to express natural phenomena in mathematical terms."},{"name":"MURIE","text":"Building on this process, the existing mathematical formulae were further developed into arcane geometries─precise patterns that allowed a practitioner to weave aether into specific magical effects. The mages who invoked this new form of magic became known as “arcanists,” and the school of arcanima was born."},{"name":"MURIE","text":"Many such mages, wishing to expand their understanding of the world, took to the seas aboard trading vessels. Upon their arrival in Limsa Lominsa, arcanists found themselves welcomed into the academic elite, and soon secured positions in the realms of governance and counsel."},{"name":"MURIE","text":"The knowledge of an arcanist, however, is traditionally passed on from master to chosen disciple. As such, Admiral Merlwyb, counting several wielders of arcanima among her personal staff, became concerned that this exclusionary practice would lead to the eventual extinction of the art."},{"name":"MURIE","text":"So, at the Admiral's express orders, an official Arcanists' Guild was established, and funding was provided for research and training."},{"name":"MURIE","text":"The complex and demanding nature of arcanima, however, remains the greatest threat to its own future. If you invite such cerebral challenges, then you have but to reaffirm your commitment to joining our guild."}],"reward":{"job":26},"next":[65988]},"partials":[{"type":"npc","id":"1000895","obj":{"i":1000895,"n":"Murie","l":29,"q":5,"t":"Guild Receptionist"}},{"type":"quest","id":"65988","obj":{"i":65988,"n":"Way of the Arcanist","g":135,"l":"Limsa Lominsa","s":10,"f":1}}]}