{"quest":{"name":"Tactical Planning","location":"Limsa Lominsa","id":65992,"patch":3.1,"sort":100,"icon":100100,"unlocksFunction":1,"eventIcon":71341,"issuer":1000909,"target":1000909,"involved":[1005199,1005200,1005201],"genre":135,"journal":["Acting Guildmaster Thubyrgeim wishes to assess the improvement of your arcanima skills.","In order to once again gauge your growth as an arcanist, Thubyrgeim bids you travel to western La Noscea to engage in battle with more ferocious foes. Slay three roselings and three wild jackals.","You have slain the designated creatures. Return to the Arcanists' Guild and report to Thubyrgeim.","Satisfied with the results of your training, Thubyrgeim next orders you to accompany K'lyhia on an official inspection. Seek out the foreseer in the practice area and learn the details of your forthcoming duty.","The foreseer explains that a goblin family of peddlers known as the Boilstox is suspected of dealing in black market goods. Predicting a violent response to her inspection, K'lyhia bids you stand ready to execute a tactic she has dubbed “Stratagem Focus Fire.” Travel to middle La Noscea, and rendezvous with the assessor at the goblins' location.","You have successfully subdued the Boilstox. Speak with K'lyhia and follow her instructions.","K'lyhia educates you on the necessity of knowing your own strengths and weaknesses when formulating strategies. Return to Thubyrgeim at the Arcanists' Guild and inform her that the inspection is complete.","After returning to the guild and making your report, Thubyrgeim hints that your burgeoning abilities may soon qualify you for a more ambitious assignment. Continue to improve and experiment with your strategies in preparation for the next call to duty.<br><br>※The next arcanist quest will be available from Thubyrgeim upon reaching level 15."],"objectives":["Slay roselings.","Slay wild jackals.","Report to Thubyrgeim at the Arcanists' Guild.","Speak with K'lyhia.","Speak with K'lyhia in middle La Noscea.","Speak with K'lyhia.","Report to Thubyrgeim at the Arcanists' Guild.","Defeat the goblin peddlers!"],"dialogue":[{"name":"THUBYRGEIM","text":"Yes, <span class=\"highlight\">Forename</span>, the time for your next lesson is upon us. You are keeping well, I trust? Taking the occasional brisk walk? One cannot form sound thoughts if one fails to maintain a sound body."},{"name":"THUBYRGEIM","text":"Now, assuming you have been following K'lyhia's instructions, you should be ready to face the more dangerous threats found in western La Noscea."},{"name":"THUBYRGEIM","text":"I speak of roselings and wild jackals. And yes, I would have you vanquish three of each. 'Tis the perfect sample size: the first acts as a preliminary test case, the second to test your hypotheses, the third to perfect the tactics you've devised."},{"name":"THUBYRGEIM","text":"Speaking of which, I trust your strategy will consist of more than simply flinging Ruin over and over again. You are not the novice you once were, and your skills in the field ought reflect that. If you find yourself wanting for other approaches, consider an assault with Ruin in tandem with attacks from your Carbuncle. When timed appropriately, you can deal a crippling blow to your opponent."},{"name":"THUBYRGEIM","text":"Welcome back, <span class=\"highlight\">Forename</span>. How did it feel to conquer such ferocious foes? Let us ride that wave of triumph onto an even more demanding─and dangerous─challenge."},{"name":"THUBYRGEIM","text":"Your next training exercise will have you accompanying Foreseer K'lyhia on one of her inspections."},{"name":"THUBYRGEIM","text":"This experience will afford you the opportunity to witness firsthand the practical application of arcanima. Pray do not tarry, <span class=\"highlight\">Forename</span>─K'lyhia awaits you on the floor below with further details."},{"name":"KLYHIA","text":"A timely appearance, as I expected. Shall we proceed directly to the job at hand? I have been tasked with examining the wares of a goblin peddler caravan run by the Boilstox family. "},{"name":"KLYHIA","text":"Our agents suspect these beastman merchants of dealing in forbidden goods. As such, I have calculated that announcing an inspection has a 60% chance of inviting physical violence."},{"name":"KLYHIA","text":"I have prepared a strategy to respond to this possible shift into hostilities, but there is an important precondition you should be made aware of before we discuss the finer points of my plan."},{"name":"KLYHIA","text":"Though I am considered gifted in the formation of tactics, I lack the reflexes and coordination necessary to employ many of those selfsame strategies on the field of battle. Pray keep this factor in mind, and adjust your perceptions accordingly."},{"name":"KLYHIA","text":"Now, should the goblins offer battle, you are to execute Combat Pattern 1345, otherwise known as “Stratagem Focus Fire.”"},{"name":"KLYHIA","text":"You and your Carbuncle will concentrate your attacks on a single foe, and, one by one, the enemy will wither under the combined onslaught. Probability of victory: 95%."},{"name":"KLYHIA","text":"Reports place the peddlers in the vicinity of the Cookpot, in middle La Noscea. I will depart immediately to assess the situation. Seek me out once you arrive."},{"name":"KLYHIA","text":"I am Foreseer K'lyhia of Mealvaan's Gate. You are to cease all transactions and surrender your goods for inspection."},{"name":"GOBURIN","text":"Nasty sneakypeekers! Gobbies spit uplander nosyeyes on stabbyiron!"},{"name":"KLYHIA","text":"A predictably aggressive response. Very well, <span class=\"highlight\">Forename</span>. Remember what we discussed!"},{"name":"KLYHIA","text":"Nicely done. Adaptation, improvisation─I might have been observing our beloved guildmaster himself in action!"},{"name":"KLYHIA","text":"This was the <span class=\"emphasis\">perfect</span> example of how the strategy for a given task should be tailored to the abilities of the assessor."},{"name":"KLYHIA","text":"In other words, before you begin formulating your tactics, it is necessary to fully understand your own strengths and weaknesses."},{"name":"KLYHIA","text":"On that note, there is another question I would ask you: when it comes to improving the probable success of a strategy, do you consider it more effective to concentrate on playing to your strengths, or shoring up your weaknesses?"},{"name":"Q1","text":"Which do you concentrate on?"},{"name":"A1","text":"Enhancing my strengths."},{"name":"A1","text":"Covering my weaknesses."},{"name":"KLYHIA","text":"Oho, again you respond as the guildmaster once did. I must revise the probability for your potential to attain greatness to...97%. You are one to keep an eye on, that much is certain."},{"name":"KLYHIA","text":"But to return to the subject of battle plans, your calculations must include an accurate assessment of your available techniques and their relative effectiveness. This requires you to be critically aware of your own limits, the limits of your allies, and the characteristics of your enemies."},{"name":"KLYHIA","text":"I believe that covers everything for today. Please return to the guild and make your report to Mistress Thubyrgeim. Until next we meet."},{"name":"KLYHIA","text":"I shall abide here until the Yellowjackets arrive to take the peddlers into custody. My strategies will keep me company."},{"name":"KLYHIA","text":"Assuming Precondition C, the execution of Combat Maneuver B would impact Scenario A in a manner which would precipitate..."},{"name":"THUBYRGEIM","text":"Back from the field, <span class=\"highlight\">Forename</span>? K'lyhia contacted me with a summary of events."},{"name":"THUBYRGEIM","text":"It seems you were treated to a lecture on “knowing thyself.” That particular lesson is ordinarily taught only to intermediate practitioners."},{"name":"THUBYRGEIM","text":"Without a sufficient store of combat experience from which to draw, it is difficult to fully appreciate the profundity of such a seemingly simple truth."},{"name":"THUBYRGEIM","text":"Nevertheless, I feel confident that you will soon be ready for a more ambitious assignment. Keep to your studies, and maintain the razor edge of your mind."},{"name":"THUBYRGEIM","text":"One last thing, <span class=\"highlight\">Forename</span>. Considering the dedication you have shown towards our discipline, I have decided to permit you leave to explore the teachings offered by other guilds."},{"name":"THUBYRGEIM","text":"I would suggest, however, that you first master the science of arcanima. The strategic training you receive here will serve you well no matter the path you eventually choose to walk. Return to me when your reason tells you the time is right."},{"name":"SYSTEM","text":"You now have access to the Armoury system. Quests to unlock the other classes can be undertaken by speaking to the receptionist in the corresponding guild."},{"name":"SYSTEM","text":"There exist myriad disciplines in Eorzea that adventurers can take up. For the most rewarding experience, however, it is recommended that you first focus on mastering your current class."},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>! Now!<br>Execute Stratagem Focus Fire!"},{"name":"QIB","text":"Strike now with all your might!"},{"name":"QIB","text":"Do not forget the precondition!<br>Adjust your tactics accordingly!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>!<br>Switch to Combat Pattern 2538: “Evasive Maneuvers”!"},{"name":"QIB","text":"Avoiding bomb blasts is your top priority!"},{"name":"QIB","text":"Interrupt casting if you must!<br>Focus on mobility!"},{"name":"QIB","text":"An excellent decision!"},{"name":"QIB","text":"Your combat style gives me an idea..."},{"name":"QIB","text":"I must formulate a new tactic.<br>The battlefield is yours!"}],"reward":{"items":[{"id":2145},{"id":3015,"one":1},{"id":2661,"one":1},{"id":3538,"one":1},{"id":3769,"one":1},{"num":2,"id":5824,"one":1}],"xp":1710},"reqs":{"jobs":[{"lvl":10,"id":27}],"questsType":"all","quests":[65989,65991]},"next":[66639]},"partials":[{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1005199","obj":{"i":1005199,"n":"K'lyhia","l":29,"q":3}},{"type":"npc","id":"1005200","obj":{"i":1005200,"n":"K'lyhia","l":30,"q":2}},{"type":"npc","id":"1005201","obj":{"i":1005201,"n":"K'lyhia","l":30,"q":2}},{"type":"item","id":"2145","obj":{"i":2145,"n":"Engraved Leather Grimoire","l":10,"c":33402,"t":10,"p":439}},{"type":"item","id":"3015","obj":{"i":3015,"n":"Amateur's Dalmatica","l":10,"c":42017,"t":35,"p":280}},{"type":"item","id":"2661","obj":{"i":2661,"n":"Amateur's Hempen Coif","l":10,"c":41527,"t":34,"p":226}},{"type":"item","id":"3538","obj":{"i":3538,"n":"Hempen Dress Gloves","l":11,"c":44159,"t":37,"p":224}},{"type":"item","id":"3769","obj":{"i":3769,"n":"Amateur's Duckbills","l":10,"c":46109,"t":38,"p":230}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65989","obj":{"i":65989,"n":"Way of the Arcanist","g":135,"l":"Limsa Lominsa","s":11,"f":1}},{"type":"quest","id":"65991","obj":{"i":65991,"n":"What's in the Box","g":135,"l":"Limsa Lominsa","s":50,"f":1}},{"type":"quest","id":"66639","obj":{"i":66639,"n":"Topaz Teachings","g":135,"l":"Limsa Lominsa","s":150,"f":1}}]}