{"quest":{"name":"On to Summerford","location":"Limsa Lominsa","id":65998,"patch":2.0,"sort":13,"eventIcon":71201,"issuer":1000972,"target":1002626,"genre":1,"journal":["Baderon, proprietor of the Drowning Wench, wants you to lend a hand at Summerford Farms.","Staelwyrn, the owner of Summerford Farms, is in need of a helping hand. Leave Limsa Lominsa through the Zephyr Gate and pay a visit to the hardworking farmer.","Staelwyrn explains that many of his workers were once the crew of his pirate ship, a vessel lost in the destruction of the Calamity. With the former buccaneers less than eager to embrace life on the land, numerous problems are cropping up across the orchard. Seek out those who are struggling with the unruly farmhands and lend what aid you can."],"objectives":["Speak with Staelwyrn at Summerford Farms."],"dialogue":[{"name":"BADERON","text":"Still in Limsa, are ye, <span class=\"highlight\">Forename</span>? 'Ow'd ye fancy a trip outside the city walls?"},{"name":"BADERON","text":"I'd like ye to visit an orchard by the name o' Summerford Farms. Ever 'eard o' the place? The owner, Staelwyrn, is an old mate o' mine."},{"name":"BADERON","text":"'E's got 'imself a crew o' mostly reformed pirate types, if ye can believe that, and 'as been tryin' to bring a bit o' life back to the fields after the Calamity ruined the soil. 'E mentioned needin' another 'and or two, and yer name sprang to mind."},{"name":"BADERON","text":"I gave ye a glowin' recommendation, so make sure ye work 'ard and impress the old bastard. Ye need directions? The place ain't 'ard to find: just take the Zephyr Gate out o' the city, and follow the road northeast."},{"name":"STAELWYRN","text":"Ah, you must be the adventurer Baderon promised to send along. <span class=\"highlight\">Forename Surname</span>, wasn't it?"},{"name":"STAELWYRN","text":"You honored his word, so that's a good start. I'm Staelwyrn, the “old bastard,” as Baderon likely described me, and this here is my humble orchard."},{"name":"STAELWYRN","text":"A good number of the lads and lasses workin' here once terrorized the high seas. And if you're wonderin' why I employ these scrags, well, they used to crew my pirate ship."},{"name":"STAELWYRN","text":"But the Calamity did for our ship, like it did so many others, and I was sore wounded into the bargain."},{"name":"STAELWYRN","text":"I had to feed myself and my crew somehow, and Admiral Merlwyb's initiative to get us landlocked buccaneers workin' the fields seemed too fine an offer to refuse."},{"name":"STAELWYRN","text":"Well, it turns out you can take the pirate away from the sea, but you can't take the sea away from the pirate. A lot of my blokes just never took to tendin' the soil, you see."},{"name":"STAELWYRN","text":"And unfortunately, the botanists I called in to train 'em have been wringin' their hands in black despair. With so much work pilin' up, I need a tougher soul like you to step in and help where it's needed."}],"reward":{"items":[{"id":27634,"one":1},{"id":27665,"one":1},{"id":5824,"one":1}],"xp":910},"reqs":{"jobs":[{"lvl":4,"id":130}],"questsType":"any","quests":[65644,65645]},"next":[65999,66008]},"partials":[{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1002626","obj":{"i":1002626,"n":"Staelwyrn","l":30,"q":10}},{"type":"item","id":"27634","obj":{"i":27634,"n":"Altered Thighboots","l":5,"c":49077,"t":38}},{"type":"item","id":"27665","obj":{"i":27665,"n":"Altered Leather Thighboots","l":5,"c":46102,"t":38}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65644","obj":{"i":65644,"n":"Close to Home","g":1,"l":"Limsa Lominsa","s":6}},{"type":"quest","id":"65645","obj":{"i":65645,"n":"Close to Home","g":1,"l":"Limsa Lominsa","s":7}},{"type":"quest","id":"65999","obj":{"i":65999,"n":"Dressed to Call","g":1,"l":"Middle La Noscea","s":17}},{"type":"quest","id":"66008","obj":{"i":66008,"n":"The Time Is Ripe","g":91,"l":"Middle La Noscea","s":60}}]}