{"quest":{"name":"Grimoire Fandango","location":"Limsa Lominsa","id":65996,"patch":2.0,"sort":250,"icon":100100,"unlocksFunction":1,"eventIcon":71341,"issuer":1000909,"target":1000909,"involved":[1005227,1005228,1005249,1006195],"genre":135,"journal":["Acting Guildmaster Thubyrgeim would have your assistance in tracking down a certain someone.","You learn from Thubyrgeim that the elusive guildmaster, K'rhid Tia, has at long last been spotted. She believes that the guildmaster holds the key to breaking K'lyhia free from her depression. Travel to Memeroon's Trading Post in upper La Noscea, and question a local as to K'rhid Tia's current whereabouts.","One of the trading post locals tells you of the guildmaster's intended destination. Travel next to Thalaos, and speak with the scholar who makes his camp in the area.","The scholar Tanga Tonga has a message for you from the guildmaster. It appears you are to locate three slips of parchment upon each of which are written parts of a single clue.","You have collected the three slips of parchment. Deliver the curious missives to Tanga Tonga.","After deciphering the Allagan script, Tanga Tonga reads to you the guildmaster's instructions. Though the clues are somewhat cryptic, you determine that you are to travel to Fool Falls and /dance before an old wooden box found somewhere in the area...","You have located the old wooden box and have danced for it like you've never danced before. Prise open the lid and see what wonders await you.","You have defeated the tree slugs that sprung when you attempted to open the box. Ready yourself for anything, and attempt to open the box once more.","The box holds no further nasty surprises for you, and you have found yet another slip of parchment within. The parchment has directed you to Memeroon's Trading Post in upper La Noscea, where you should seek out the owner and /dance for him.","The guildmaster was watching as you performed your dance for Memeroon, apparently needing a diversion from his studies. After applauding your effort, he gifts you with a new grimoire and recommends you deliver it to K'lyhia. Follow the arcanist's instructions, and /dance for K'lyhia in the Anchor Yard of Limsa Lominsa.","After performing a dance for K'lyhia, she deduces that you have met with Guildmaster K'rhid Tia. Hand over the new grimoire to the foreseer to answer her question as to why.","You give the new tome to K'lyhia, and the foreseer soon realizes the significance of the gift: it is within her to shape the world into the reality she desires. And that reality is one in which she defeats Doesmaga. Return to the Arcanists' Guild, and inform Thubyrgeim of the assessor's recovery.","Thubyrgeim appears relieved to hear the news of K'lyhia's decision to return to duty. The foreseer is, however, yet bound by the chains of her past. Focus your efforts on your training, and prepare yourself for the forthcoming confrontation with Doesmaga.<br><br>※The next arcanist quest will be available from Thubyrgeim upon reaching level 30."],"objectives":["Speak with a local at Memeroon's Trading Post.","Speak with the scholar at Thalaos.","Find the hidden slips of parchment.","Deliver the slips of parchment to Tanga Tonga.","/dance before the old wooden box at Fool Falls.","Open the old wooden box.","/dance for Memeroon at Memeroon's Trading Post.","/dance for K'lyhia in the Anchor Yard of Limsa Lominsa.","Hand over the new grimoire to K'lyhia.","Report to Thubyrgeim at the Arcanists' Guild."],"dialogue":[{"name":"THUBYRGEIM","text":"Have you come to ask about K'lyhia's condition? The foreseer is...unchanged. She walks about as if all the joy in life has been leeched from her soul."},{"name":"THUBYRGEIM","text":"I believe the only one who can help her now is the same person who broke K'lyhia out of her shell the first time: our absent guildmaster. And─though I am leery of the coincidence─the man himself has at long last been spotted."},{"name":"THUBYRGEIM","text":"Should you seek out his last known location, it is unlikely he will still be there. And even should you catch him, he may not deign to speak with you. Nevertheless, this may be our only chance."},{"name":"THUBYRGEIM","text":"Pray travel to Memeroon's Trading Post in upper La Noscea, and speak with anyone who might have seen the guildmaster. Oh, and one more thing: though he prefers us not to use it for some inexplicable reason, our leader's name is K'rhid Tia."},{"name":"MOKUGEKISHA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Evening</span><span class=\"alternative\">Morning</span><span class=\"alternative\">Afternoon</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Aye, I was the one as sent word to your guild about spotting your leader. It's a right rare sight to see K'rhid Tia roaming about! He asked me the way to Thalaos. Could be he was seeking to speak with the scholar who lives out there."},{"name":"KOUKOGAKUSHA","text":"Hello there. Why, yes, I did receive a visit from a gentleman identifying himself as the arcanists' guildmaster. An odd fellow, but obviously possessed of a well-rounded education."},{"name":"KOUKOGAKUSHA","text":"As it so happens, he bid me pass on a message to anyone who came searching for him. Ahem. “Reunited, the three slips of parchment hold the problem to the solution.”"},{"name":"KOUKOGAKUSHA","text":"The guildmaster mentioned that the slips of parchment are concealed among the bones of Thalaos. I suppose you are expected to search for them."},{"name":"KOUKOGAKUSHA","text":"Have you tracked down those three slips of parchment?"},{"name":"KOUKOGAKUSHA","text":"Hm, interesting. They actually exist. To be perfectly honest, I thought you had been sent on a wild-dodo chase. Let's have a look at these, shall we? ...Well, well, penned in ancient Allagan, no less. Fortunately for you, I have a passing familiarity with the script..."},{"name":"KOUKOGAKUSHA","text":"(-Slips of Parchment-)“Seek the box at Fool Falls.”<br>“Dance a jig for your wooden audience.”<br>“Claim the secret from the opened heart.”"},{"name":"KOUKOGAKUSHA","text":"A most cryptic set of instructions, I must say. Do you intend to follow them? This guildmaster of yours certainly enjoys his games..."},{"name":"SYSYTEM","text":"The box rattles and thumps about, as if something within seeks to be freed. It appears the lid has been loosened somewhat..."},{"name":"SYSYTEM","text":"The lid of the box is jammed shut."},{"name":"SYSTEM","text":"You find a slip of parchment inside the box."},{"name":"MEMO","text":"(-Slip of Parchment-)“If there are answers you would seek,<br>Then to the trading post now go,<br>Before the owner, be not meek,<br>With your two feet, provide a show.”"},{"name":"MEMEROON","text":"Funny Miqo'te dance funny dance! You dance funny dance too?"},{"name":"KRHIDTIA","text":"Ah, now that was most entertaining. I must have something to amuse me during these little jaunts back to civilization, you understand."},{"name":"KRHIDTIA","text":"Based on my evaluation of your abilities, however, I calculated that you would arrive at this point somewhat earlier. You balked at the dancing, didn't you?"},{"name":"KRHIDTIA","text":"I never expected you to be so shy."},{"name":"KRHIDTIA","text":"Heh heh, another variable to add to your list of characteristics. I keep extensive mental notes of all the guild's members, you see."},{"name":"KRHIDTIA","text":"Heh heh. Fascinating."},{"name":"KRHIDTIA","text":"As an arcanist, it was a simple matter to engineer events so that I might meet you face-to-face. After all, strategy is a tool used to manipulate one's situation into the desired reality."},{"name":"KRHIDTIA","text":"And I do so enjoy seeing others dance in the palm of my hand, as it were."},{"name":"KRHIDTIA","text":"Here, you may have this. Think of it as payment for your...performance."},{"name":"KRHIDTIA","text":"Though you might consider passing the tome on to K'lyhia. That <span class=\"emphasis\">is</span> the reason you sought me out, was it not?"},{"name":"KRHIDTIA","text":"Before you give K'lyhia the grimoire, however, I must insist that you dance for her. I will know if you don't."},{"name":"KRHIDTIA","text":"&lt;yawn&gt; All this banal interaction has simply exhausted me. It is time I returned to my studies."},{"name":"KRHIDTIA","text":"You, on the other hand, should travel forthwith to the Anchor Yard in Limsa Lominsa. Be well, <span class=\"highlight\">Forename</span>. We shall meet again."},{"name":"KRHIDTIA","text":"I'm 100% certain of it."},{"name":"KLYHIA","text":"My mind is ordinarily a whirlwind of probabilities and feints and counterattacks, but now there is naught but silence. This is how it once used to be...and perhaps how it always will be from now on."},{"name":"KLYHIA","text":"Were you always one for dancing? I don't recall any such pref─<br>...Ah. You have met with our guildmaster, haven't you?"},{"name":"Q1","text":"Have you met with the guildmaster?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"KLYHIA","text":"That would explain your odd behavior. He does so enjoy seeing people perform unexpected acts of frivolity."},{"name":"KLYHIA","text":"It is typical of him to offer no introduction, but there is no mistaking the identity of the man you met. No one else takes such delight in seeing people perform unexpected acts of frivolity."},{"name":"KLYHIA","text":"But what could have spurred our reticent guildmaster to speak with you in person?"},{"name":"KLYHIA","text":"He gave you this grimoire to give to me? Uncanny... It is identical to the tome I received the first time I ever met our leader..."},{"name":"KLYHIA","text":"You have my thanks, <span class=\"highlight\">Forename</span>. The guildmaster is fond of games and mischief, and I understand the troublesome trials he likely put you through before deeming you worthy of his attention."},{"name":"KLYHIA","text":"With this gift, however, his message to me is abundantly clear: I am to shape reality into the one I desire."},{"name":"KLYHIA","text":"And that means defeating Doesmaga!"},{"name":"KLYHIA","text":"Gods, my mind is alive again with strategies! I must have time to think. Pray inform Mistress Thubyrgeim of my return to duty."},{"name":"KLYHIA","text":"Assuming Precondition C, the introduction of Variable M would alter Scenario A in a manner which would perforce require..."},{"name":"THUBYRGEIM","text":"K'lyhia has recovered from her despondency? This is wonderful news, and we have you to thank for it."},{"name":"THUBYRGEIM","text":"It is unfortunate, however, that both K'lyhia and our guildmaster are possessed of such impenetrable personalities. But at least in the case of the foreseer, we have an inkling as to the nature of the cage that imprisons her."},{"name":"THUBYRGEIM","text":"I continue to hope that her partnership with you shall gradually pry those bars apart. Return to your training, <span class=\"highlight\">Forename</span>, and prepare yourself for the demanding tactics K'lyhia is sure to formulate in the days ahead."}],"reward":{"items":[{"id":2151},{"id":3050,"one":1},{"id":3581,"one":1},{"id":27667,"one":1},{"id":2728,"one":1},{"id":5825,"one":1}],"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":27}],"quests":[65995]},"next":[65997]},"partials":[{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1005227","obj":{"i":1005227,"n":"Witness","l":34,"q":1}},{"type":"npc","id":"1005228","obj":{"i":1005228,"n":"K'lyhia","l":28,"q":1}},{"type":"npc","id":"1005249","obj":{"i":1005249,"n":"Memeroon","l":34,"q":3,"t":"Junkmonger"}},{"type":"npc","id":"1006195","obj":{"i":1006195,"n":"Tanga Tonga","l":34,"q":3}},{"type":"item","id":"2151","obj":{"i":2151,"n":"Yew Picatrix","l":22,"c":33407,"t":10,"p":1566}},{"type":"item","id":"3050","obj":{"i":3050,"n":"Cotton Halfrobe","l":21,"c":42154,"t":35,"p":820}},{"type":"item","id":"3581","obj":{"i":3581,"n":"Goatskin Ringbands","l":26,"c":48240,"t":37,"p":1158}},{"type":"item","id":"27667","obj":{"i":27667,"n":"Altered Goatskin Moccasins","l":26,"c":49075,"t":38}},{"type":"item","id":"2728","obj":{"i":2728,"n":"Silver Spectacles","l":25,"c":40881,"t":34,"p":1314}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"65995","obj":{"i":65995,"n":"Pincer Maneuver","g":135,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"65997","obj":{"i":65997,"n":"Sinking Doesmaga","g":135,"l":"Limsa Lominsa","s":300,"f":1}}]}