{"quest":{"name":"Pincer Maneuver","location":"Limsa Lominsa","id":65995,"patch":2.0,"sort":200,"icon":100100,"unlocksFunction":1,"eventIcon":71341,"issuer":1000909,"target":1000909,"involved":[1000938,1003505,1005215,1005217,1005220,1005221],"genre":135,"journal":["Acting Guildmaster Thubyrgeim appears unusually distressed.","Thubyrgeim tells you that the recovering K'lyhia has vanished without a word. Follow the acting guildmaster's suggestion and make inquiries on Hawkers' Alley as to the foreseer's whereabouts.","After speaking with Dodozan on Hawkers' Alley, you learn that K'lyhia was seeking information concerning a Qiqirn smuggling ring. During their conversation, however, it appears that the Yellowjackets appeared and took the foreseer away. Speak to Ginnade at the Coral Tower to learn more of K'lyhia's fate.","Ginnade explains that K'lyhia was once a prisoner of Doesmaga, and that the Yellowjackets brought the Miqo'te in for questioning to learn what she knew of the black-hearted pirate. Return to the Arcanists' Guild and report your findings to Thubyrgeim.","Upon making your report to Thubyrgeim, the acting guildmaster has an epiphany regarding the missing assessor's probable destination. Head to Aleport in western La Noscea and search for K'lyhia.","You discover the foreseer in Aleport to find that she is already formulating a strategy to recover her lost grimoire. Speak with Thubyrgeim at Oschon's Embrace and lend your strength to K'lyhia's planned attack.","In order to retrieve the foreseer's grimoire, you have been asked to cooperate in a covert strike on a black market merchant and his retinue. The plan hinges on the successful execution of a classic pincer maneuver at Oschon's Embrace. Take up your position, and await the arrival of the target.","Though you have managed to retrieve the grimoire, prolonged immersion in seawater has ruined the tome beyond any chance of restoration. K'lyhia, visibly sagging at the sight of her damaged possession, makes her despondent way back to Limsa Lominsa. Return to the Arcanists' Guild and speak with Thubyrgeim.","K'lyhia is devastated by the destruction of her grimoire. Promising a means to aid the dispirited assessor, Thubyrgeim asks that you return to your training until she is ready to call upon your help.<br><br>※The next arcanist quest will be available from Thubyrgeim upon reaching level 25."],"objectives":["Inquire about K'lyhia on Hawkers' Alley.","Speak with Ginnade at the Coral Tower.","Speak with Thubyrgeim at the Arcanists' Guild.","Search for K'lyhia in Aleport.","Speak with Thubyrgeim at Oschon's Embrace.","Wait for the Qiqirn to arrive.","Speak with Thubyrgeim at the Arcanists' Guild.","Defeat Kikiroon's mercenaries and retrieve the grimoire!"],"dialogue":[{"name":"THUBYRGEIM","text":"Greetings, <span class=\"highlight\">Forename</span>. In case such doubts fill your mind, you should know that I am ever willing to lend an ear if you find your thoughts troubled."},{"name":"THUBYRGEIM","text":"At the very least, I would have <span class=\"emphasis\">you</span> know this, because it seems that K'lyhia does not. The foreseer has been missing since this morning. There have been other times when she has disappeared without a word, but we have always been able to find her. Alas, that is not the case this day."},{"name":"THUBYRGEIM","text":"Were the guildmaster here, he could deduce her whereabouts with nary a moment's concentration..."},{"name":"THUBYRGEIM","text":"I find myself beginning to wonder if those who devote themselves overmuch to arcanima are more prone to bouts of wanderlust... But while I might wish to ponder further such oddities of character, we must needs organize a search party."},{"name":"THUBYRGEIM","text":"Would you be so kind as to make inquiries in Hawkers' Alley? It is not uncommon for K'lyhia's wanderings to take a path through the markets."},{"name":"DODOZAN","text":"You seek a Miqo'te agent of Mealvaan's Gate? Why, yes, I have seen her. Spoke with her, in fact. She was, however, apprehended by the Yellowjackets."},{"name":"DODOZAN","text":"The assessor was drilling me for details about a Qiqirn smuggling ring based in Aleport, but then the soldiers arrived and took her away."},{"name":"DODOZAN","text":"If you wish to know her fate, then I suggest you speak with Ginnade of the Coral Tower."},{"name":"GINNADE","text":"Foreseer K'lyhia? Yes, we brought her in for questioning regarding the reappearance of the pirate Doesmaga."},{"name":"GINNADE","text":"A member of the Arcanists' Guild, are you? Then I see no reason to conceal the nature of our discourse. Perhaps you are already aware of this, but the foreseer was once held captive by that rabid sea dog."},{"name":"GINNADE","text":"Few pirates sink to such depths of depravity as Doesmaga. It has been six years now since he was exiled from Limsa Lominsa for engaging in the worst kind of black market trading."},{"name":"GINNADE","text":"And now the villain has returned. He is, however, both cunning and cautious, and continues to evade our troops. Thus, we hoped to borrow the knowledge of Foreseer K'lyhia, whose experiences have given her an intimate familiarity with the way the scoundrel operates."},{"name":"GINNADE","text":"At least, that was our intent. After weathering a barrage of questions from the assessor, we found <span class=\"emphasis\">ourselves</span>, instead, providing the details of our search. Should you wish to speak with Foreseer K'lyhia, I imagine she has already returned safely to your guild."},{"name":"THUBYRGEIM","text":"Back already? You were led to believe she had returned here? I am afraid not. ...Hm? So, the Yellowjackets told you something of her history with Doesmaga, did they? Perhaps it would be best if I told you the entire tale."},{"name":"THUBYRGEIM","text":"Doesmaga's banishment was the result of a surprise inspection that revealed his involvement in an underground slave trade."},{"name":"THUBYRGEIM","text":"The assessor that stepped aboard the pirate's merchant ship spoke of finding dozens of unwashed unfortunates crammed into that squalid hold. Among these prisoners was a young Miqo'te, destined for some black market auction block."},{"name":"THUBYRGEIM","text":"Though K'lyhia was initially too terrified to even speak, the guildmaster brought her out of her fearful daze with the gift of an initiate's grimoire. Yes, the selfsame tome that she has carried her entire career."},{"name":"THUBYRGEIM","text":"I─<br>...Of course. Did you not mention that K'lyhia's grimoire was thrown into the sea?"},{"name":"THUBYRGEIM","text":"There are rumors that a Qiqirn merchant of ill repute has retrieved the black market goods the crew of the <span class=\"emphasis\">Morningstar</span> heaved into the ocean. Even now, he gloats over his salt-encrusted catch in Aleport."},{"name":"THUBYRGEIM","text":"It is entirely possible that the foreseer's most prized possession was caught up in the Qiqirn's salvage net. I've no doubt now that K'lyhia has reached the same conclusion. To Aleport with you, <span class=\"highlight\">Forename</span>. That is where you will find our wayward assessor."},{"name":"KLYHIA","text":"Yes, yes... Combat Pattern 256 should serve to cover all expected contingencies─you never know when you'll have to nullify a thaumaturge or two! My retrieval strategy is complete."},{"name":"KLYHIA","text":"<span class=\"highlight\">Forename</span>, it is good of you to come. I was unable to calculate for certain if you would piece together my movements in time. Very little is certain when so many variables are involved."},{"name":"KLYHIA","text":"But there is good news: this prisoner here was kind enough to confirm that the trader who salvaged the <span class=\"emphasis\">Morningstar</span>'s jettisoned cargo did indeed retrieve a tome matching the description of my lost grimoire."},{"name":"KLYHIA","text":"Lominsan law and the policies of Mealvaan's Gate would support the confiscation of goods connected to an official inspection, but alas, my personal belongings do not fall under that definition. Thus, I intend to launch an unofficial offensive against this black marketeer and his cronies."},{"name":"KLYHIA","text":"The peddler has already departed for Candlekeep Quay. It is time I gathered to me such allies as I possess─and I count you as one of them, <span class=\"highlight\">Forename</span>!"},{"name":"KLYHIA","text":"Despite the nature of this endeavor, Mistress Thubyrgeim has offered me her cooperation. If you would, pray join her at Oschon's Embrace─that is where we shall ambush this disreputable Qiqirn."},{"name":"KLYHIA","text":"Please make haste to Oschon's Embrace and join forces with Mistress Thubyrgeim─I will be along once I have made sure of my preparations."},{"name":"THUBYRGEIM","text":"Greetings, <span class=\"highlight\">Forename</span>. Your arrival completes our small company. You are equipped for battle, I trust? We need not await K'lyhia's arrival─once the Qiqirn appears on the bridge, we spring our ambush."},{"name":"THUBYRGEIM","text":"The strategy for trapping our target relies on the two allies we have concealed on the other side of the ravine. This pincer maneuver was, naturally, the foreseer's idea."},{"name":"THUBYRGEIM","text":"As for the target himself, the Qiqirn is known as a careful and cautious fellow. He travels with a small retinue so as to avoid attracting attention, but do not be fooled: more bodyguards follow at a distance, and will likely join the fray after hostilities ensue."},{"name":"THUBYRGEIM","text":"Do not, however, expect any assistance from the Yellowjackets. They cannot be seen aiding us in what amounts to a personal matter, but they are willing to turn a blind eye for K'lyhia's sake."},{"name":"THUBYRGEIM","text":"In any case, the foreseer's tactics account for our limited numbers and individual strengths. Victory is all but assured. Now, let us take up our positions and wait for the Qiqirn to arrive."},{"name":"THUBYRGEIM","text":"Do not be concerned─I have memorized the foreseer's strategy down to the last detail. For the moment, you need only await the Qiqirn's arrival."},{"name":"KLYHIA","text":"Well executed, everyone. ...Were you able to retrieve my grimoire?"},{"name":"THUBYRGEIM","text":"<span class=\"highlight\">Forename</span>, pray hand over the tome."},{"name":"KLYHIA","text":"It's ruined... My wonderful grimoire is ruined."},{"name":"KLYHIA","text":"The probability of repairing this degree of damage is...0%. Even the most brilliant strategy cannot undo such ravages of seawater."},{"name":"KLYHIA","text":"I have never felt so...defeated. I believe it is time I returned home."},{"name":"GEISSFRYN","text":"Leave her be!"},{"name":"AERSTHOTA","text":"But, how can I!?"},{"name":"THUBYRGEIM","text":"He is right, Aersthota. You must allow K'lyhia time to process the loss."},{"name":"THUBYRGEIM","text":"And you have other matters to which you must attend. Come, <span class=\"highlight\">Forename</span>, it is time we returned to the guild, as well."},{"name":"GEISSFRYN","text":"We'll clean up here. No one will even suspect a fight took place."},{"name":"AERSTHOTA","text":"Please, take care of Foreseer K'lyhia."},{"name":"THUBYRGEIM","text":"Not quite the victory we imagined, was it? The moment K'lyhia beheld her soaked and tattered grimoire...you could see the light of hope die in her eyes."},{"name":"THUBYRGEIM","text":"There is, however, something we can do. I will call on your aid soon, but in the meantime, you would be well served to deepen your knowledge of arcanima."},{"name":"QIB","text":"Filthy ambushers! They want Kikiroon's sparklies!<br>Ambush them back!"},{"name":"QIB","text":"Your foul trade is a blight on Limsa Lominsa.<br>Surrender your goods at once!"},{"name":"QIB","text":"Geissfryn! Aersthota! Now!"},{"name":"QIB","text":"Kikiroon no scared! Kikiroon have scary spellslingers!"},{"name":"QIB","text":"Conjurers. Just as K'lyhia predicted.<br>We shift to Combat Pattern 158!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>!<br>Focus on the conjurers and blunt their heals!"},{"name":"QIB","text":"No! Be late for business!<br>This business be bad for you!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, I spy a thaumaturge!<br>Quickly, switch to Combat Pattern 256!"},{"name":"QIB","text":"Even a lone mage can wreak untold havoc.<br>Focus your attacks on the thaumaturge first!"},{"name":"QIB","text":"I failed to earn my coin on this job..."},{"name":"QIB","text":"I hope you packed potions..."},{"name":"QIB","text":"This wasn't part of the strategy..."},{"name":"QIB","text":"That appears to be the last of them.<br>Now, to find the foreseer's grimoire!"}],"reward":{"items":[{"id":2149},{"id":27666,"one":1},{"id":2703,"one":1},{"id":3568,"one":1},{"id":3800,"one":1},{"num":5,"id":5824,"one":1}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":27}],"quests":[65994]},"next":[65996]},"partials":[{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1000938","obj":{"i":1000938,"n":"Ginnade","l":28,"q":6}},{"type":"npc","id":"1003505","obj":{"i":1003505,"n":"Dodozan","l":29,"q":2}},{"type":"npc","id":"1005215","obj":{"i":1005215,"n":"K'lyhia","l":33,"q":1}},{"type":"npc","id":"1005217","obj":{"i":1005217,"n":"Thubyrgeim","l":31,"q":1}},{"type":"npc","id":"1005220","obj":{"i":1005220,"n":"Geissfryn","l":31,"q":1}},{"type":"npc","id":"1005221","obj":{"i":1005221,"n":"Aersthota","l":31,"q":1}},{"type":"item","id":"2149","obj":{"i":2149,"n":"Engraved Hard Leather Grimoire","l":20,"c":33405,"t":10,"p":1098}},{"type":"item","id":"27666","obj":{"i":27666,"n":"Altered Cotton Dalmatica","l":18,"c":42657,"t":35}},{"type":"item","id":"2703","obj":{"i":2703,"n":"Ash Mask (Lapis Lazuli)","l":20,"c":40415,"t":34,"p":425}},{"type":"item","id":"3568","obj":{"i":3568,"n":"Cotton Dress Gloves","l":21,"c":44076,"t":37,"p":589}},{"type":"item","id":"3800","obj":{"i":3800,"n":"Cotton Dress Shoes","l":22,"c":46194,"t":38,"p":783}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65994","obj":{"i":65994,"n":"Over the Rails","g":135,"l":"Limsa Lominsa","s":151,"f":1}},{"type":"quest","id":"65996","obj":{"i":65996,"n":"Grimoire Fandango","g":135,"l":"Limsa Lominsa","s":250,"f":1}}]}