{"quest":{"name":"Just Deserts","location":"Middle La Noscea","id":66005,"patch":2.0,"sort":36,"icon":100094,"eventIcon":71201,"issuer":1002626,"target":1000972,"involved":[1002633,1002644,1002645,1002646,1002647,1002648,1003349],"genre":1,"journal":["Staelwyrn has reason to believe that Sevrin is up to no good. Something must be done.","Apparently, Sevrin began behaving suspiciously after receiving a curious letter, and subsequently absconded with his band of scoundrels. Staelwyrn wants you to hunt the rogue down and drag him back to Summerford Farms before he gets himself into trouble. Speak with Grynewyda at the aetheryte and find out where he was headed.","It seems that Sevrin and his men have set forth for Woad Whisper Canyon. Track them down, and see that they return to Summerford Farms.","According to Aylmer, Sevrin lured his lackeys into a trap with the promise of drink. Head into the canyon and save whomever you can.","Eyrimhus tells you that more of Sevrin's hapless comrades are trapped further on in the canyon. Find them before it is too late.","While attempting to rescue Sevrin and his “friends,” you encounter a masked mage who unleashes a towering clay golem upon you. After a desperate struggle, you succeed in defeating the dread automaton.","For reasons unknown, Y'shtola's presence conjures visions from the past in your mind. Though you would like nothing more than to ask her about this mysterious phenomenon, you concede that Woad Whisper Canyon is no place for such an exchange. Head back to Summerford Farms and report all that has transpired to Staelwyrn.","Back at Summerford Farms, Sevrin explains that he had planned to serve up his crewmen to the Serpent Reavers as recompense for deserting them, but that in the end he could not bear to sell his soul to save his own skin. Though Staelwyrn has taken the penitent pirate back, Sevrin seems determined to pay for his crimes. Speak with Staelwyrn to see what might be done.","Aware that Baderon's voice carries weight with the Yellowjackets, Staelwyrn bids you relate to him the full tale of Sevrin's misadventures in the hope that he will feel moved to plead the penitent pirate's case. It would seem a visit to the Drowning Wench is in order.","Having listened to your tale, Baderon pledges to intervene on Sevrin's behalf, and commends you for serving Staelwyrn so diligently. By way of reward, he offers you lodgings, and further employment in the form of leves. Take advantage of his generosity, and prepare yourself for the adventures to come."],"objectives":["Speak with Grynewyda.","Intercept Sevrin and his henchmen in Woad Whisper Canyon.","Rescue Sevrin's henchmen.","Rescue Sevrin's henchmen in the heart of Woad Whisper Canyon.","Speak with Staelwyrn at Summerford Farms.","Speak with Staelwyrn.","Speak with Baderon at the Drowning Wench."],"dialogue":[{"name":"STAELWYRN","text":"I've come to expect a great deal from you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, and you've never once let me down."},{"name":"STAELWYRN","text":"Yet what I'd ask of you now goes beyond aught I've asked before. Would you hear my plea all the same?"},{"name":"STAELWYRN","text":"It eases my mind to have your ear."},{"name":"STAELWYRN","text":"You're no doubt familiar with that scoundrel Sevrin by now."},{"name":"STAELWYRN","text":"Well, the schemin' scapegrace is at it again. Since that letter came for him, he's been skulkin' about in that manner he does when he's up to no good."},{"name":"STAELWYRN","text":"Now he's rounded up his rogues and buggered off, with nary a word to anyone."},{"name":"STAELWYRN","text":"I've grown accustomed to his insolence, but somethin' tells me this is different. It ain't exactly damnin', but when last I had words with him, he didn't look defiant so much as <span class=\"emphasis\">hunted</span>. I can't help thinkin' he's gone lookin' for trouble and found more than he wanted."},{"name":"STAELWYRN","text":"So I was hopin' you might hunt his sorry hide down and drag it back here before it's too late."},{"name":"STAELWYRN","text":"The ungrateful little cur bites me every chance he gets, but I can't quite bring myself to cut him loose. I s'pose he reminds me a bit of my younger self."},{"name":"STAELWYRN","text":"Suffice it to say, I'd rather he didn't come to a sticky end. As for how to find him, I'd try askin' Grynewyda at the aetheryte. She was the last one to see him."},{"name":"STAELWYRN","text":"I daresay she'll be able to tell you where he was headed."},{"name":"GRYNEWYDA","text":"Nothing that passes through those gates escapes my notice!"},{"name":"GRYNEWYDA","text":"I saw the rouser and his rabble set out for Woad Whisper Canyon not long ago, singing about drinking themselves stupider. Cheeky sods said I should <span class=\"emphasis\">join</span> them!"},{"name":"GRYNEWYDA","text":"I told them I'd rather shrivel up than sip whatever it was that had pickled their brains. If you find the idle swine, be sure and give them a cuff 'round the ear from me, will you?"},{"name":"AYLMER","text":"Of all the dirty, deceitful, downright dastardly deeds that slippery bastard's done!"},{"name":"AYLMER","text":"Claimin' to take the lads out for a drink, only to lead us straight into a bloody trap! It don't get no lower than that!"},{"name":"AYLMER","text":"'Course, I've learned to stay a step ahead of ol' Sevrin, so I was ready─but the others weren't so lucky. You've got to help 'em!"},{"name":"SEVRIN","text":"It ain't safe here! Take the others an' get out while you still can!"},{"name":"IREZUMI","text":"Resistance is futile!"},{"name":"EYRIMHUS","text":"My axe may as well've been a white flag for all the good it did... Hope you fare better, or the sorry bastards in there are done for."},{"name":"SEVRIN","text":"Can't move...my leg. Leave me. Save the others."},{"name":"IREZUMI","text":"At long last, you will have the dog's death you deserve...<span class=\"emphasis\">deserter</span>."},{"name":"SOZAIRARZAI","text":"Sevrin might've got us into this mess, but I ain't about to let him give his life for us. I'd sooner bow to a fishback than be in that connivin' bastard's debt! To arms!"},{"name":"Q1","text":"Duty calls. Do you wish to proceed with<br>“Comeuppance”?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"IREZUMI","text":"A true knave! You betray even yourself, Sevrin."},{"name":"SEVRIN","text":"Ugh..."},{"name":"IREZUMI","text":"We were prepared to overlook the matter of your desertion on the condition that you provided us with suitable replacements. That was the agreement."},{"name":"IREZUMI","text":"Yet your latest change of heart leaves your debt to us unpaid.<br>Few are they who betray the Serpent Reavers twice. You will not do so a third time."},{"name":"IREZUMI","text":"Cowering behind your protector will only delay the inevitable. Honorless wretch...your life is all you have left."},{"name":"IREZUMI","text":"And worthless though it be, we shall take it!"},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">O mournful voice of creation! Send unto me a creature of the abyss, my thrall to command, that I may smite mine enemies!</span>"},{"name":"QIB","text":"Defeat the clay golem!"},{"name":"MASKEDMAGUS","text":"You are strong.<br>But are you strong enough to withstand <span class=\"emphasis\">this</span>?"},{"name":"MASKEDMAGUS","text":"Surrender! Surrender to the Darkness!"},{"name":"MASKEDMAGUS","text":"Impossible! Never has the golem been so sorely tested!"},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">That the golem could be vanquished...</span>"},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">That <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> is no ordinary adventurer.</span>"},{"name":"YSHTOLA","text":"&lt;sigh&gt; ...The snake slithered away."},{"name":"YSHTOLA","text":"I am only glad he did not have the chance to sink his fangs more deeply into you."},{"name":"YSHTOLA","text":"Those pirates do not belong to any of the known Lominsan factions... Whom then do they serve? The <span class=\"emphasis\">beast tribes</span>? Surely not."},{"name":"YSHTOLA","text":"But the timing of their appearance coincides all too neatly with the recent surge in Sahagin and kobold activity... Something is afoot. The question is: what?"},{"name":"YSHTOLA","text":"...Could it be that the tribes are planning to summon their primals?"},{"name":"YSHTOLA","text":"Twelve help us if it should prove so. Limsa would be hard-pressed to keep a single primal at bay, let alone two. But all is yet speculation. I must needs find evidence."},{"name":"YSHTOLA","text":"The seas continue to rise..."},{"name":"YSHTOLA","text":"While the lesser moon continues to fall..."},{"name":"YSHTOLA","text":"And ilm by ilm, the world becomes ever more unlike itself."},{"name":"YSHTOLA","text":"It is as Louisoix foretold..."},{"name":"YSHTOLA","text":"The coming of chaos has rendered the laws of nature mutable, blurring the boundary between the material and aetherial planes... Little now stands between us and the primals."},{"name":"YSHTOLA","text":"...But they are not here yet.<br>“Though time be against us, hope shall ever be on our side.”"},{"name":"YSHTOLA","text":"Never did the creed of Sharlayan ring more true."},{"name":"YSHTOLA","text":"Never did I dream that I would possess the means to <span class=\"emphasis\">see</span> aether...yet now that I do, I do begin to take it for granted. How swiftly do the wonders of Sharlayan seem commonplace..."},{"name":"GIRL","text":"Um..."},{"name":"GIRL","text":"Here, for you. Have you come for the festivities?"},{"name":"GIRL","text":"Today the Maelstrom officially makes that great hole in the sea its training ground. Join in the celebrations!"},{"name":"YSHTOLA","text":"Wait. A disturbance in the aetheric flow. But whence does it emanate?"},{"name":"YSHTOLA","text":"...Seasong Grotto, perhaps?"},{"name":"YSHTOLA","text":"What have we here...? Can you walk?"},{"name":"YSHTOLA","text":"'Tis I.<br>Regrettably, no. He eluded me.<br>Understood. I will inform the commodore."},{"name":"YSHTOLA","text":"You collapsed from your exertions. Are you suitably recovered?"},{"name":"YSHTOLA","text":"Sevrin here has apprised me of all that transpired. His account shed some light upon how you came to be attacked by a <span class=\"emphasis\">golem</span> of all things."},{"name":"YSHTOLA","text":"A golem is a mindless automaton, inert save when commanded to be otherwise. Common pirates could not hope to control such a thing, so arcane are its workings."},{"name":"YSHTOLA","text":"But then these tattooed wretches are no common pirates─they are the minions of the Sahagin. As to their purpose...well, I shall get to the bottom of it."},{"name":"YSHTOLA","text":"But first I must escort Sevrin back to his place of employment. I daresay Staelwyrn will be wondering what has become of him."},{"name":"YSHTOLA","text":"And you too, for that matter. I will bear word to him of your preservation, but I am certain he would like to thank you in person. Pray pay the man a visit."},{"name":"YSHTOLA","text":"Ah...he told me of you, but perchance he did not tell you of me. My name is Y'shtola."},{"name":"YSHTOLA","text":"I am...a naturalist of sorts, surveying the aether in the hope that it might offer up some clue as to our predicament. "},{"name":"SEVRIN","text":"I'd say I owed you my life...but that don't cover it. If it weren't for you, my friends would be dead, an' all..."},{"name":"SEVRIN","text":"'Tis a debt I can never repay. But I'll not make things worse by runnin' away. Take me to Summerford Farms, an' I'll face the consequences."},{"name":"YSHTOLA","text":"For reasons I cannot fathom, you seem...<br>Forgive me. Mayhap we shall have a chance to speak again when I have marshaled my thoughts."},{"name":"YSHTOLA","text":"Until our paths next cross, farewell."},{"name":"STAELWYRN","text":"Lo! I knew you'd return."},{"name":"STAELWYRN","text":"Y'shtola delivered Sevrin a bit ago. Tales of your heroic deeds precede you!"},{"name":"STAELWYRN","text":"The rest came shufflin' back, too─the lot of 'em sportin' the same haunted expression."},{"name":"SEVRIN","text":"It's me who's to blame for that─that an' the rest."},{"name":"SEVRIN","text":"I was once a Serpent Reaver."},{"name":"STAELWYRN","text":"...A thrall to the Sahagin? Seven hells... Reavers may look and sound and act like pirates, but they're naught but the fishbacks' flunkies."},{"name":"SEVRIN","text":"Us pirates ain't much for laws, but there's things we won't do. We've got a <span class=\"emphasis\">code</span>, see─but the Reavers've never followed a word of it. A few years back, they started snatchin' law-abidin' Lominsans."},{"name":"SEVRIN","text":"I'd only just taken my oath when our captain bent the knee to his new Sahagin masters. I knew I had to get away."},{"name":"SEVRIN","text":"So I crept off one night, got myself a new name, an' found myself a new home─Summerford Farms. Trouble is, secrets don't stay secret for long 'round here, an' word soon spread...all the way back to the sea."},{"name":"SEVRIN","text":"The penalty for desertion is death, but the Reavers offered me a way out instead─my freedom in exchange for my mates'."},{"name":"STAELWYRN","text":"The letter..."},{"name":"SEVRIN","text":"I dunno what I was thinkin'... &lt;snort&gt; I <span class=\"emphasis\">wasn't</span> bloody thinkin'. Too busy soilin' meself."},{"name":"STAELWYRN","text":"Aye, but you got there in the end, didn't you? When the time came, you made the right decision."},{"name":"STAELWYRN","text":"The men say little to me, but I hear 'em talk of how you stood up to the Reavers at the last─of how you tried to give your life to save theirs."},{"name":"SEVRIN","text":"Be that as it may, no deed, however good, can atone for the crime of betrayin' your brethren."},{"name":"SEVRIN","text":"I know that─I do. That's why I'm going to hand myself over to the Yellowjackets. I'll bring shame to the farm no more."},{"name":"STAELWYRN","text":"Hm. You'll hear no arguments from me. Each man must sail accordin' to his own moral compass."},{"name":"STAELWYRN","text":"I just hope yours guides you back here someday. There will always be a place for you at Summerford Farms, lad."},{"name":"SEVRIN","text":"An' I'll always be in your debt, Staelwyrn."},{"name":"SEVRIN","text":"An' yours an' all, adventurer. I've caused more than my fair share o' trouble durin' my time here─not that you need tellin'."},{"name":"STAELWYRN","text":"I owe you a debt too, <span class=\"highlight\">Forename</span>. Not once have you let me down. Thank you for savin' the men of my farm."},{"name":"STAELWYRN","text":"If I could ask one more favor of you, it'd be this: tell Baderon what's happened, from start to finish. I'm certain he'd put in a good word for Sevrin if he knew the whole story."},{"name":"STAELWYRN","text":"And he's one of the few people I know who the Yellowjackets'll listen to."},{"name":"STAELWYRN","text":"Well, I reckon I've asked all I can possibly ask of you. Safe travels, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>."},{"name":"BADERON","text":"...Bloody 'ells! Life on the farm ain't quite 'ow I pictured it!"},{"name":"BADERON","text":"Ah, but ye needn't worry yerself over young Sevrin. The Yellowjacket as 'ands out the punishments is a good mate o' mine. If I ask 'im nice, I reckon 'e'd be willin' to commute the lad's sentence from 'angin' to keelhaulin', kindly gent that 'e is.<br>...Ah, I'm only jestin' with ye! I'll see 'e's treated fair."},{"name":"BADERON","text":"Now, it sounds to me like ye've done everythin' ol' Staelwyrn asked o' ye an' more─justifyin' me generous finder's fee in the process. Much obliged, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"},{"name":"BADERON","text":"As fer a reward...well, she's a lonely lady, this Drownin' Wench o' mine. 'Ow'd ye fancy keepin' 'er company fer a spell...<span class=\"emphasis\">with free room an' board</span>?"},{"name":"BADERON","text":"'Venturin's a tryin' business, after all. Them as don't rest their bones every now an' again tend to end up with broken ones. An' take it from me: fightin' ain't <span class=\"emphasis\">nearly</span> so much fun when yer nursin' a shattered arm. Got that? Good. There'll always be a free bed fer ye, so make use of it."},{"name":"BADERON","text":"Not that ye'll 'ave much time fer lyin' around, what with all the leves ye'll be doin'. Oh, didn't I mention? I'm puttin' yer name down fer leves."},{"name":"BADERON","text":"Our guild draws all manner o' clients, offerin' all manner of odd jobs. Honestly, ye'd be <span class=\"emphasis\">amazed</span> 'ow much folk'll pay to avoid doin' an honest day's labor."},{"name":"BADERON","text":"Just give T'mokkri a shout whenever ye feel like makin' a few extra gil. She'll always 'ave some task or other fer ye to do."},{"name":"BADERON","text":"Oh, an' it's all above board, 'case yer wonderin'. We're careful to stay on the Admiral's right side in 'ere─unlike some pirates I could mention... I tell ye, if it turns out they 'ad aught to do with them kidnappin's, there'll be seven hells to pay. A proper bleedin' <span class=\"emphasis\">reckonin'</span>..."},{"name":"BADERON","text":"Mayhap that's what Limsa needs, though. On rough seas, sometimes ye 'ave to rock the boat to right it."},{"name":"BADERON","text":"But we'll 'ave time fer such talk when yer well an' rested. Till then, enjoy the Wench's 'ospitality!"},{"name":"SYSTEM","text":"In recognition of your achievements, you have been granted access to guildleves and inn rooms."},{"name":"SYSTEM","text":"As you complete quests and embark on new adventurers, the world will draw you ever deeper into its mysteries."},{"name":"SYSTEM","text":"The great realm of Eorzea yet holds myriad roads untraveled and sights unseen. Continue along the path of the adventurer and discover what wonders await you!"},{"name":"SYSTEM","text":"You now have access to Recommendations. This feature displays a list of quests or duties currently available in your area."},{"name":"SYSTEM","text":"The Recommendations list can be opened from under Duty in the main menu, and will also be displayed automatically when you log in. If you find yourself unsure of what to do next, this tool makes it simple to locate activities suitable for your present class and level."}],"reward":{"gil":177,"xp":3240},"reqs":{"jobs":[{"lvl":9,"id":130}],"quests":[66004]},"next":[65933,66023,66229]},"partials":[{"type":"npc","id":"1002626","obj":{"i":1002626,"n":"Staelwyrn","l":30,"q":10}},{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1002633","obj":{"i":1002633,"n":"Grynewyda","l":30,"q":2}},{"type":"npc","id":"1002644","obj":{"i":1002644,"n":"Sevrin","l":30,"q":1}},{"type":"npc","id":"1002645","obj":{"i":1002645,"n":"Aylmer","l":30,"q":1}},{"type":"npc","id":"1002646","obj":{"i":1002646,"n":"Eyrimhus","l":30,"q":1}},{"type":"npc","id":"1002647","obj":{"i":1002647,"n":"Sozai Rarzai","l":30,"q":1}},{"type":"npc","id":"1002648","obj":{"i":1002648,"n":"Tattooed Man","l":30,"q":1}},{"type":"npc","id":"1003349","obj":{"i":1003349,"n":"Sevrin","l":30,"q":1}},{"type":"quest","id":"66004","obj":{"i":66004,"n":"Plowshares to Swords","g":1,"l":"Middle La Noscea","s":35}},{"type":"quest","id":"65933","obj":{"i":65933,"n":"Sky-high","g":1,"l":"Limsa Lominsa","s":43}},{"type":"quest","id":"66023","obj":{"i":66023,"n":"Meet, Greet, and Deceit","g":91,"l":"Limsa Lominsa","s":90}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}}]}