{"quest":{"name":"Double Dealing","location":"Middle La Noscea","id":66002,"patch":2.0,"sort":25,"eventIcon":71201,"issuer":1002626,"target":1002626,"involved":[1002630,1002640,1002641,1002642,1002643],"genre":1,"journal":["Staelwyrn worries his sack of oranges will not reach the La Thagran Checkpoint as planned.","Sevrin has made off with a sack of oranges with the intention of fencing it to goblins. Staelwyrn bids you seek out Sevrin and cast /doubt on his actions, that he might be compelled to do the right thing.","Sevrin openly admits to have taken the oranges for his own purposes, but he is not concerned with being found out at the moment. His deal with the goblins has gone awry, and his partners in crime are in trouble. He asks that you help them out of their jam.","You have saved Sevrin's mates from an unfortunate fate at the hands of the goblin muggers. Inform Sevrin about their well-being, and remind him about the sack of oranges he appropriated.","Sevrin is grateful to you for saving his henchmen, but is not apologetic for the attempted theft or his cowardice. Not wishing to start another fight, however, he grants you leave to take what you came for. Retrieve the sack of oranges.","You have acquired the oranges. See them to their rightful recipient, Ossine at the La Thagran Checkpoint.","Judging by Ossine's reaction, this is not the first time Sevrin has attempted a stunt like this. Return to Summerford Farms and relay to Staelwyrn all that has transpired.","Once again, Staelwyrn is appreciative of your honest efforts. He also bemoans the fact that Sevrin's disloyalty may be beyond repairing. You are duly warned to keep an eye on the delinquent whenever he is around."],"objectives":["Confront Sevrin and cast /doubt on his actions.","Save Sevrin's henchmen.","Speak with Sevrin.","Retrieve the sack of oranges.","Deliver the sack of oranges to Ossine at the La Thagran Checkpoint.","Report to Staelwyrn at Summerford Farms."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"STAELWYRN","text":"Pains me to say, but all the gil in the world can't buy loyalty. There are some, like you, who can be trusted. But then there are others..."},{"name":"STAELWYRN","text":"Until now, I've had no choice but to rely on that charlatan Sevrin, even though I am <span class=\"emphasis\">full aware</span> he's been doin' shady deals behind my back. More than once I've heard tell of improper tradin' with goblins."},{"name":"STAELWYRN","text":"I wouldn't be the least surprised if that were happenin' right <span class=\"emphasis\">now</span>. Not a bell ago, a sack of oranges vanished, as did Sevrin. I want you to find and confront the bastard for me, <span class=\"highlight\">Surname</span>. I'm sure there's wrongdoin' afoot, so be sure to <span class=\"highlight\">doubt</span> anythin' that comes out of his mouth."},{"name":"SEVRIN","text":"Bloody hells! I'm up the strait without a paddle!"},{"name":"SEVRIN","text":"What's this now? Staelwyrn sent you for the oranges? Huh... So the old bugger had known all this time... Argh, what does it matter anyway?"},{"name":"SEVRIN","text":"Listen, you're one o' those goody-goody adventurer types, right? Go rescue me mates from those double-dealin' goblins! They're just over yonder by the bonfire."},{"name":"SEVRIN","text":"You save me mates and, by the Navigator, you'll have your sack o' scurvy snacks!"},{"name":"AYLMER","text":"I owe you one. Would've gotten away meself if not fer Sevrin shovin' me aside."},{"name":"EYRIMHUS","text":"Sevrin sent you? Hah! The way he flew out of here, I was sure he'd sold us down the river!"},{"name":"SDHODJBI","text":"Textless"},{"name":"SOZAIRARZAI","text":"If you hadn't come, my dodo would've been cooked! Mmm...cooked dodo."},{"name":"SEVRIN","text":"You saved me mates, and for that, I owe you."},{"name":"SEVRIN","text":"S'pose I should be ashamed I couldn't clean up my own mess..."},{"name":"SEVRIN","text":"...But a pirate knows no shame! I've no qualms about goin' back on my word! I'm only givin' you this sack 'cause I like the cut of your jib. Take it to Ossine, an' send him my regards."},{"name":"OSSINE","text":"What have we here? A delivery from Summerford Farms, and as scheduled? Hah! There's a first time for everything!"},{"name":"OSSINE","text":"Well, look at that... Not a single one missing, either! About the only things not here are those bagmen, and I don't miss <span class=\"emphasis\">them</span> one bit."},{"name":"OSSINE","text":"Here's Staelwyrn's payment in full. With <span class=\"emphasis\">you</span>, I can trust it'll reach him!"},{"name":"TALK","text":"Textless"},{"name":"STAELWYRN","text":"Back in one piece! That's a relief. How did you fare, <span class=\"highlight\">Surname</span>?"},{"name":"STAELWYRN","text":"Ah, this is what I was aimin' for! Looks to be all I was owed, all right. Though, I'd be tellin' you false if I claimed I had not held out more hope for Sevrin."},{"name":"STAELWYRN","text":"I was even willin' to overlook the skimmin' off the top, but to sell us all short in favor of those godsforsaken goblins... &lt;sigh&gt;"},{"name":"STAELWYRN","text":"You'd do well to mind yourself around that two-gil cheat. If he'd leave his own mates for dead, there's no tellin' what he'd do to <span class=\"emphasis\">you</span>."},{"name":"TALK","text":"Textless"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":179,"items":[{"num":10,"id":3},{"id":4552},{"id":3008,"one":1},{"id":3000,"one":1},{"id":5824,"one":1}],"xp":2550},"reqs":{"jobs":[{"lvl":5,"id":130}],"quests":[66001]},"next":[66003,66010]},"partials":[{"type":"npc","id":"1002626","obj":{"i":1002626,"n":"Staelwyrn","l":30,"q":10}},{"type":"npc","id":"1002630","obj":{"i":1002630,"n":"Ossine","l":30,"q":1}},{"type":"npc","id":"1002640","obj":{"i":1002640,"n":"Sevrin","l":30,"q":1}},{"type":"npc","id":"1002641","obj":{"i":1002641,"n":"Aylmer","l":30,"q":1}},{"type":"npc","id":"1002642","obj":{"i":1002642,"n":"Eyrimhus","l":30,"q":1}},{"type":"npc","id":"1002643","obj":{"i":1002643,"n":"Sozai Rarzai","l":30,"q":1}},{"type":"item","id":"4552","obj":{"i":4552,"n":"Hi-Potion","l":25,"c":20602,"t":44,"p":146}},{"type":"item","id":"3008","obj":{"i":3008,"n":"Hempen Acton","l":8,"c":43012,"t":35,"p":273}},{"type":"item","id":"3000","obj":{"i":3000,"n":"Hempen Cowl","l":8,"c":43601,"t":35,"p":309}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66001","obj":{"i":66001,"n":"Washed Up","g":1,"l":"Middle La Noscea","s":22}},{"type":"quest","id":"66003","obj":{"i":66003,"n":"Loam Maintenance","g":1,"l":"Middle La Noscea","s":34}},{"type":"quest","id":"66010","obj":{"i":66010,"n":"A Pound of Cure","g":91,"l":"Middle La Noscea","s":80}}]}