{"quest":{"name":"Rocks in a Hard Place","location":"Middle La Noscea","id":66007,"patch":2.0,"sort":50,"eventIcon":71221,"issuer":1002633,"target":1002633,"genre":91,"journal":["Grynewyda seeks courageous pioneers who can tame the wilderness for Summerford Farms.","The Admiral's settlement initiative rewards pioneers for settling the Lominsan frontier, but the washed-up pirates who work under Grynewyda have not been diligent in their work. If you would assist, take up the tiller's shovel at the nearby shack.","You have taken up the tiller's shovel. Make your way to the designated area and clear away the rocks and debris.","All is clear on the frontier. Report the completion of your task to Grynewyda.","Summerford Farms has upheld the Admiral's settlement initiative. While the pirates the Admiral sent know how to sail the savage seas, they have much to learn about breaking the stubborn earth."],"objectives":["Obtain the tiller's shovel.","Remove rocks from the frontier with the shovel.","Pick up debris from the frontier.","Report to Grynewyda."],"dialogue":[{"name":"GRYNEWYDA","text":"Summerford Farms bears the charge of the Admiral's settlement initiative. We're rewarded handsomely to brave new frontiers."},{"name":"GRYNEWYDA","text":"Yet if we fail to fulfill our part of the bargain, the grant will be withdrawn. In spite of this, the washed-up pirates elect to laze their days away."},{"name":"GRYNEWYDA","text":"There is still time. We need only clear away the rocks and debris for the area to be deemed settled."},{"name":"GRYNEWYDA","text":"If you are willing to help, you'll find a shovel outside that hut on the hillside."},{"name":"GRYNEWYDA","text":"You've certainly proven you are not one to let obstacles stand in your path."},{"name":"GRYNEWYDA","text":"If only these supposedly pioneering pirates were half as industrious as you..."},{"name":"GRYNEWYDA","text":"Expanding borders is all well and good, but the Admiral ought to know rugged frontiers can't be settled by layabouts."},{"name":"TALK","text":"Deleted"},{"name":"TALK","text":"Deleted"},{"name":"TALK","text":"Deleted"}],"reward":{"gil":128,"xp":560},"reqs":{"jobs":[{"lvl":4,"id":1}]}},"partials":[{"type":"npc","id":"1002633","obj":{"i":1002633,"n":"Grynewyda","l":30,"q":2}}]}