{"quest":{"name":"Bait and Swat","location":"Lower La Noscea","id":66015,"patch":2.0,"sort":90,"icon":100095,"eventIcon":71221,"issuer":1002571,"target":1000972,"involved":[1002221,1002591,1002659],"genre":91,"journal":["Anaoc deems a confrontation with the kobolds imminent.","The kobolds and Lominsans have long shared an armistice, but Anaoc is convinced that the peace is untenable, and that recent kobold incursions justify a preemptive attack. Arenlona of the Dawn Meadow will brief you on the stratagem.","Arenlona posits that, since prolonged famine has driven the kobolds to raid the Stead for foodstuffs, they can be baited out. Speak to Anaoc about preparing the lure.","Anaoc directs you to Skarnmhar, who can supply you with dodo meat from an unshipped consignment.","K'wabati waits by the southern mouth of Blind Iron Mines to instruct you where to set the crate of meat.","Set the crate of meat in the mines.","Slay the kobolds that take the bait.","Inform Anaoc that the mines are clear of kobolds.","The immediate threat has been quelled, but the specter of a kobold uprising still looms. Speak with Baderon at the Drowning Wench to see what can be done to fortify the Red Rooster Stead for the trials ahead.","Baderon recognizes that, in their zeal to summon Titan, the kobolds have been amassing crystals through increasingly violent means. He will speak with the Yellowjackets about a dispatch to defend the Red Rooster Stead, but it will matter little should Titan awaken."],"objectives":["Speak with Arenlona.","Speak with Anaoc.","Acquire the meat from Skarnmhar.","Speak with K'wabati at Blind Iron Mines.","Set the crate of meat in the mines.","Take cover and ambush the kobolds that appear.","Speak with Anaoc.","Speak with Baderon at the Drowning Wench."],"dialogue":[{"name":"ANAOC","text":"You've seen with your own eyes how the kobolds have taken up arms against us."},{"name":"ANAOC","text":"The mines of O'Ghomoro aren't enough for the native nuisances of northern Vylbrand anymore. They've come to claim what is ours."},{"name":"ANAOC","text":"Long ago, our war-weary forebears struck a shortsighted peace with the kobolds: what lay beneath the sea was to be Limsa's, what lay underground was O'Ghomoro's."},{"name":"ANAOC","text":"Yet what resolved one conflict created another, as the sea cannot fully feed, clothe, and shelter the children of land. Realizing this, the kobolds tacitly condoned the Lominsan settlement of La Noscea. We shared an unspoken agreement."},{"name":"ANAOC","text":"But now, the kobolds aggressively assert their dominion, threatening our very survival."},{"name":"ANAOC","text":"Adherence to a pact is meaningless if it means our demise. It comes time for us to take a stand. Seek the wisdom of Arenlona to learn how."},{"name":"ARENLONA","text":"So, Anaoc has at last abandoned the naive hope that the kobold menace would abate of its own accord."},{"name":"ARENLONA","text":"Their numbers have increased manifold as they expand southward. The food shortages spurred by overpopulation quicken the cycle of aggression."},{"name":"ARENLONA","text":"A common beggar would know better than to expect foodstuffs aboard a stagecoach bound for the Stead, but the filthy scamps grow desperate."},{"name":"ARENLONA","text":"We need only set the bait, and their hunger will be their undoing. Tell Anaoc to make the arrangements."},{"name":"ANAOC","text":"Ingenious. We'll trap the hungry kobolds as one would any rodent."},{"name":"ANAOC","text":"And I know just the bait to set. Tell Skarnmhar to set aside some dodo meat from our next shipment."},{"name":"ANAOC","text":"Set a bit of that in Blind Iron Mines and the little gluttons won't be able to resist."},{"name":"SKARNMHAR","text":"I hand dead dodo to you, and you kill kobolds for me? A bargain if I ever heard one!"},{"name":"SKARNMHAR","text":"Take this over to K'wabati south of the mines. She'll know where it goes."},{"name":"KWABATI","text":"Good to see the Red Rooster Stead hasn't turned chicken on us."},{"name":"KWABATI","text":"Once you've found a good hiding spot, open the crate of meat nearby. The kobolds will follow their noses; by the time they see you, it'll be too late."},{"name":"ANAOC","text":"Haha, you've done it! I expected no less."},{"name":"ANAOC","text":"I don't know what we'd have done without you...which makes me wonder what we will do once you've gone."},{"name":"ANAOC","text":"I was hoping you might visit the Drowning Wench and speak with Baderon."},{"name":"ANAOC","text":"It is no secret the Yellowjackets pay him heed. Mayhap he would put in a word, so that the Stead might procure their protection."},{"name":"BADERON","text":"So the Stead's in over their 'eads with the kobolds, are they?"},{"name":"BADERON","text":"'Twas wishful thinkin' to believe the mine rats would stay put in O'Ghomoro."},{"name":"BADERON","text":"Any barkeep can tell ye as rodents're wont to spread. This wave just comes sooner than reckoned."},{"name":"BADERON","text":"The pact was a farce─no 'andshake ever solved a blood feud. We just needed to lick our wounds a while is all."},{"name":"BADERON","text":"Well, I s'pose they're all 'ealed up. Even the Maelstrom's taken note of 'ow the rascals run rampant."},{"name":"BADERON","text":"Ye can be sure they're 'oardin' crystals to summon Titan, an' gods 'elp us if they do."},{"name":"BADERON","text":"Limsa'll look back on these petty thefts an' skirmishes as the good ol' times when that day comes, I tell ye!"},{"name":"BADERON","text":"An' there won't be a Company of 'Eroes around to answer our prayers this time, neither!"},{"name":"BADERON","text":"Well, an onze o' prevention's worth a ponze o' cure. I'll talk to the Yellowjackets an' see if they can't slow the kobolds' advance on the Stead."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":179,"items":[{"num":17,"id":4},{"id":4422,"one":1},{"id":4421,"one":1},{"id":5824,"one":1}],"xp":1620},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[66014]}},"partials":[{"type":"npc","id":"1002571","obj":{"i":1002571,"n":"Anaoc","l":31,"q":4}},{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1002221","obj":{"i":1002221,"n":"K'wabati","l":31,"q":1}},{"type":"npc","id":"1002591","obj":{"i":1002591,"n":"Skarnmhar","l":31,"q":4}},{"type":"npc","id":"1002659","obj":{"i":1002659,"n":"Arenlona","l":31,"q":4}},{"type":"item","id":"4422","obj":{"i":4422,"n":"Copper Ring","l":9,"c":54401,"t":43,"p":170}},{"type":"item","id":"4421","obj":{"i":4421,"n":"Bone Ring","l":9,"c":54432,"t":43,"p":132}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66014","obj":{"i":66014,"n":"Kobolds and Indigents","g":91,"l":"Lower La Noscea","s":90}}]}