{"quest":{"name":"Beetle Juice","location":"Lower La Noscea","id":66019,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1002659,"target":1002659,"genre":91,"journal":["Arenlona is in a bit of a tight spot.","Arenlona asks you to sprinkle aphid nectar upon Althyk lavender to lure little ladybugs, then squash them into three phials' worth of ladybug viscera.","You have obtained the required amount of ladybug viscera. Deliver them to Arenlona.","Arenlona explains that, since ladybugs are natural predators of aphids, the ladybug viscera will keep the aphids at bay. She insists that this is all very scientific."],"objectives":["Sprinkle aphid nectar upon Althyk lavender and obtain three phials of ladybug viscera.","Deliver the ladybug viscera to Arenlona."],"dialogue":[{"name":"ARENLONA","text":"Care to partake in the inexorable march of science?"},{"name":"ARENLONA","text":"The concoction I'm currently formulating could change horticulture as we know it! Imagine, a fluid one could strew over crops to ward off pests."},{"name":"ARENLONA","text":"All I need are some ladybugs and someone to squash them."},{"name":"ARENLONA","text":"Ladybugs simply cannot resist aphids. Find some Althyk lavender, dab it with a bit of aphid nectar, and they'll come swarming to the slaughter."},{"name":"ARENLONA","text":"Return to me once you've collected three phials of ladybug viscera."},{"name":"ARENLONA","text":"It's elementary, really. Aphids live in fear of ladybugs, and so applying the scent of ladybug blood to our crops is certain to ward off the parasites. We are manipulating the laws of nature."},{"name":"ARENLONA","text":"Of course, we could have just let the ladybugs go on defending the crops as always and not squash them for their viscera, but I hardly see the science in that."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"items":[{"id":3534,"one":1},{"id":3535,"one":1},{"id":5824,"one":1}],"xp":1275},"reqs":{"jobs":[{"lvl":4,"id":1}],"quests":[66018]}},"partials":[{"type":"npc","id":"1002659","obj":{"i":1002659,"n":"Arenlona","l":31,"q":4}},{"type":"item","id":"3534","obj":{"i":3534,"n":"Leather Mitts","l":8,"c":44065,"t":37,"p":196}},{"type":"item","id":"3535","obj":{"i":3535,"n":"Leather Ringbands","l":8,"c":48250,"t":37,"p":156}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66018","obj":{"i":66018,"n":"Whack-a-Mole","g":91,"l":"Lower La Noscea","s":70}}]}