{"quest":{"name":"Fire and Brimstone","location":"Lower La Noscea","id":66021,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1002658,"target":1002658,"genre":91,"journal":["Brimstone has blocked Broenruht out of Blind Iron Mines.","Digging stoppages may endanger the miners' livelihoods, but a surfeit of sulphurous gas endangers their very lives. Only clear earth crystals can plug the gas plumes and decontaminate the shafts.","The clear earth crystals worked like a charm on the gas plumes. Let Broenruht know that the mines are no longer brimming with brimstone.","The demand for ore has risen sharply due to rebuilding efforts in the wake of the Calamity. Many miners would not think twice about risking their health for the healthy profits in store, but owing to your deeds, none will have to."],"objectives":["Use clear earth crystals on the gas plumes.","Report to Broenruht."],"dialogue":[{"name":"BROENRUHT","text":"Well, this time we've dug ourselves into a hole well and truly!"},{"name":"BROENRUHT","text":"Struck brimstone while shoveling through the mines, and now the rocks are rife with the reek of rotten eggs. The gas grew to be too much to bear."},{"name":"BROENRUHT","text":"You'll need this clear earth crystal if you're to restore the earth and plug the leak properly."},{"name":"BROENRUHT","text":"Just mind the syrphid clouds brought on by the brimstone."},{"name":"BROENRUHT","text":"Now that's a breath of fresh air!"},{"name":"BROENRUHT","text":"For many of the miners, a bit of brimstone is nothing to write home about, but I'm the one who has to write the letters when the gluttons choke to death down there."},{"name":"BROENRUHT","text":"The prices metals command in the wake of the Calamity will make us either rich or dead."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"items":[{"id":3765,"one":1},{"id":3766,"one":1},{"num":2,"id":5824,"one":1}],"xp":1275},"reqs":{"jobs":[{"lvl":4,"id":1}]}},"partials":[{"type":"npc","id":"1002658","obj":{"i":1002658,"n":"Broenruht","l":31,"q":2}},{"type":"item","id":"3765","obj":{"i":3765,"n":"Leather Leggings","l":8,"c":46159,"t":38,"p":224}},{"type":"item","id":"3766","obj":{"i":3766,"n":"Leather Boots","l":8,"c":46137,"t":38,"p":224}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}