{"quest":{"name":"Beneath the Mask","location":"Ul'dah","id":66028,"patch":2.5,"sort":19,"icon":100355,"unlocksFunction":1,"eventIcon":71341,"issuer":1011691,"target":1011697,"involved":[1011693,1011694,1011695,1011698,1011704,1011705],"genre":68,"journal":["Not even the <span class=\"emphasis\">shockingest</span> turn of events will deter the famed agent of enquiry.","Undaunted in the face of recent developments, Hildibrand is convinced he might still persuade his erstwhile companion Miss Ellie from pursuing the consummation of her criminal plans. Meanwhile, after sending her men out in pursuit of the escaped thief, Phillice of the Sultansworn confesses that she is the last of the Arbiters of Truth─the thief's final target─and states her intention to go into hiding so as not to place any more lives in danger. Hildibrand assures her that he has the situation entirely under control, and promptly enlists your aid in canvassing the area for any suspicious individuals. Begin your search at the Hustings Strip.","You come upon an anonymous letter urging you─or whomever it was intended for─to exercise extreme caution. Continue your search of the halls of the Hustings Strip.","You come upon a second letter, this one a warning that even your closest companions are not to be trusted. A hint from an unknown ally, or a snare laid by your quarry? More evidence is necessary to evaluate the situation. Continue to scour the halls of the Hustings Strip to see what other clues might be had.","No sooner do you come upon a third letter, this time accompanied by a sachet of demasking dust, than you are greeted from behind by none other than Godbert Manderville, father of Hildibrand and goldsmith extraordinaire. The Hammer─as he is known─eagerly offers his assistance in the pursuit of the thief, in part out of concern for his son's well-being and in part out of concern for his own. From his words, it would appear that Hildibrand's mother is also a force to be reckoned with. Return to the royal vault and see what Godbert has deduced about the current state of affairs.","Godbert surmises that the thief may already have assumed the identity of one of your companions. Speak with Briardien, Nashu, and Phillice, and be especially on the lookout for any uncharacteristic reactions or behavior.","Your questioning of Briardien, Nashu, and Phillice revealed nothing of particular interest─it would appear that the thief will not be so easily unmasked. Consult once again with Godbert to hammer out your next plan of action.","Despite Hildibrand's best efforts, the thief blows her cover when the typically good-natured-to-a-fault Nashu snaps at her beloved inspector for an offhand comment about her facial complexion. You move swiftly to unmask the faux-Nashu, revealing─to the surprise of all─not Miss Ellie, but an unfamiliar woman's face. It would appear there is yet more to this case than anyone suspected..."],"objectives":["Search for evidence.","Search for more evidence.","Search for yet more evidence.","Speak with Godbert.","Gather information.","Speak with Godbert."],"dialogue":[{"name":"BRIARDIEN","text":"When you have eliminated the impossible, whatever remains, however improbable..."},{"name":"PHILLICE","text":"How could we have been so blind!?"},{"name":"HILDIBRAND","text":"...My ever-loyal associate. We must find Miss Ellie, and quickly! Surely if confronted by her constant companions, she can still be convinced to abandon this fool plan!"},{"name":"HILDIBRAND","text":"Oho, Miss Phillice! I thought you had already departed in the company of your men. But all for the better! Shall we conduct the search together?"},{"name":"PHILLICE","text":"I fear that would only put them at greater risk..."},{"name":"PHILLICE","text":"You see, the fifth and final member of the Arbiters of Truth─the phantom thief's final target─is none other than..."},{"name":"HILDIBRAND","text":"...H-H-Hildibrand Mander─!?"},{"name":"PHILLICE","text":"...Me. Mind you, it is not a role I sought of my own accord. My name and my passion for history are somewhat well known in the sultanate. One day, I received an anonymous letter, stating that a position in the committee had opened, and I had been chosen to fill it."},{"name":"PHILLICE","text":"The letter went on to enumerate my duties: to prevent the spread of historical lies that would sully the name of our illustrious nation. As a high-ranking officer in the Sultansworn, I was deemed to be in a particularly unique position to serve as an Arbiter."},{"name":"PHILLICE","text":"I knew that there were other members of the organization, but was told nothing of their names or identities. To think that my unknown compatriots were the victims all along..."},{"name":"PHILLICE","text":"...I cannot put any more lives in danger. I will sequester myself in a place where my presence can cause no harm, until such time as the killer is apprehended."},{"name":"HILDIBRAND","text":"Your concern for our well-being is most touching, Miss Phillice, but there is no need for such caution. As a seasoned inspector, I am more than capable of protecting a lady in distress─and as a gentleman, that is exactly what I shall do!"},{"name":"HILDIBRAND","text":"My associates here also stand at your side. Speaking of which, has anyone seen my loyal assistant?"},{"name":"NASHUMHAKARACCA","text":"Inspector! Over heeeeeere!"},{"name":"HILDIBRAND","text":"Ah, there you are, Nashu! You really shouldn't run off on your own like that. I was worried sick about you!"},{"name":"NASHUMHAKARACCA","text":"I'm sorry, Inspector! Miss Ellie said she saw somebody in the shadows, so I went to take a look. Now, there wasn't anything there but a dormouse, but it was a really <span class=\"emphasis\">cute</span> dormouse, you see? It just kept squeaking and scurrying away, and I just..."},{"name":"HILDIBRAND","text":"...Pardon me for a moment, Nashu. Yes, my inspector's sense speaks to me─someone is watching us. <span class=\"highlight\">Forename</span>! Let us split up and canvass our surroundings."},{"name":"BRIARDIEN","text":"Apologies, <span class=\"highlight\">Forename</span>, but I require a moment alone with my thoughts."},{"name":"PHILLICE","text":"I cannot allow my presence to put my men in danger."},{"name":"NASHUMHAKARACCA","text":"Where is Miss Ellie? Do you think she went looking for the dormouse, too?"},{"name":"SYSTEM","text":"A water-stained letter lies conspicuously on the floor."},{"name":"SYSTEM","text":"BE WARY AND BE WARNED"},{"name":"SYSTEM","text":"TRUST NO ONE<br>AND YOUR FRIENDS ALL THE LESS"},{"name":"SYSTEM","text":"THIS WILL AVAIL YOU WELL<br>USE IT WISELY"},{"name":"SYSTEM","text":"You obtain a sachet of demasking dust. In the next instant, you feel an intimidating presence behind you!"},{"name":"GODBERT","text":"Ho ho ho! If it isn't my beloved son's staunch companion, the mighty <span class=\"highlight\">Forename</span>!"},{"name":"GODBERT","text":"I was in the area on a matter of business, which I curtailed when I felt a suspicious presence from the shadows. Pursuing it led me here─mayhap it is the same for you?"},{"name":"GODBERT","text":"Oho! So your pursuit of the thief of many faces has taken quite the unexpected turn. And now you have come upon a series of anonymous letters?"},{"name":"GODBERT","text":"Mayhap our watcher in the shadows is a friend? Or is this but another trap laid by the fiend? Yes, the plot thickens like a dollop of salamander oil."},{"name":"GODBERT","text":"In either event, I daresay the circumstances call for utmost caution. The thief could be anywhere─or anyone. Myself excluded, of course─no mere mask could replicate the physique of this Manderville man!"},{"name":"GODBERT","text":"That said, I fear my dear Hildy may be in a bit over his head this time. Allow me to assist in your investigation. Were anything to happen to Hildibrand, his dear mother would, ah...not be pleased."},{"name":"GODBERT","text":"If the sender speaks true, the villain even now lurks within our midst. And yet, we have but a single sachet of demasking dust at our disposal. We must identify the impostor beyond reasonable doubt before we proceed."},{"name":"GODBERT","text":"You know the players better than I, <span class=\"highlight\">Forename</span>. What say you have a few words with each of them, and see if aught seems amiss?"},{"name":"GODBERT","text":"You know the players better than I, <span class=\"highlight\">Forename</span>. What say you have a few words with each of them, and see if aught seems amiss?"},{"name":"BRIARDIEN","text":"Miss Ellie is the phantom thief. It is the only logical conclusion. And yet, I cannot help but feel that another truth still evades us..."},{"name":"NASHUMHAKARACCA","text":"Inspector Briardien told me all about it! Who'd have thunk Miss Ellie was the phantom thief all this time? She sure fooled me!"},{"name":"PHILLICE","text":"Am I doomed to share the same fate as the others? I'd sooner die than become one of those...things..."},{"name":"OKKAKE","text":"Something just isn't...right..."},{"name":"BRIARDIEN","text":"It makes no sense. There must be something we're missing..."},{"name":"NASHUMHAKARACCA","text":"The inspector sure is taking his time..."},{"name":"PHILLICE","text":"Too much has happened in too short a span. I need more time to make sense of it all, but time is something we do not have..."},{"name":"GODBERT","text":"Nothing particularly odd about any of them, you say? It stands to reason. The fiend would not take such a risk if he were not utterly confident that he could pull off the ruse."},{"name":"CECY","text":"(-???-)Curses! This one's not half the fool his son is. I must elude him, and quickly─time is of the essence."},{"name":"HILDIBRAND","text":"I questioned the Sultansworn outside. To a man, they insist they have seen naught of Miss Ellie. Wherever could she have gone?"},{"name":"HILDIBRAND","text":"F-Father! What brings you here!?"},{"name":"BRIARDIEN","text":"Yes, finally the pieces are coming together. Now, if you would kindly stand still and shut up. The fiend already stands among us."},{"name":"HILDIBRAND","text":"I-Inspector Briardien! I should hope you are not doubting <span class=\"emphasis\">me</span>!?"},{"name":"BRIARDIEN","text":"While I'm quite convinced that even a master impersonator would struggle to recreate your particular brand of idiocy, the fact remains that anyone here who has spent even a moment alone must be considered a suspect. The thief has proven to be highly efficient at assuming new identities."},{"name":"GODBERT","text":"An astute observation, my gangly friend. I'd say this occasion calls for a dose or two of that powder <span class=\"highlight\">Forename</span> here found earlier. There wouldn't happen to be another sachet or two lying about, would there?"},{"name":"PHILLICE","text":"What remains of our supply has already been distributed to the search party, but worry not. They should be reporting back within a bell's time."},{"name":"CECY","text":"(-???-)Hah! Time might be against me, but just you watch. I'll wiggle my way out of this and turn you into the reeking, drooling corpse you deserve to be."},{"name":"HILDIBRAND","text":"I fear that is more time than we can afford, Miss Phillice. Fortunately, my powers of deduction will lay the fiend's face bare within minutes."},{"name":"HILDIBRAND","text":"We know that, given the choice, the thief prefers to impersonate familiar personages. As Miss Ellie has had only passing interactions with my dear father, we can safely eliminate him from consideration."},{"name":"HILDIBRAND","text":"That leaves myself, Nashu, and <span class=\"highlight\">Forename</span> here. Nashu and I, in particular, have had a close and extended relationship with our suspect. I shall begin by questioning mine own assistant. I assure you that none know her better than I!"},{"name":"CECY","text":"Brilliant reasoning as ever, Inspector! Go on, ask me anything!"},{"name":"CECY","text":"(-???-)Of all the times for this overstuffed buffoon to start talking sense! If he asks me anything too obscure, my cover is as good as blown..."},{"name":"HILDIBRAND","text":"My relationship with Nashu is so close, I daresay at times it is as if we share a mind. If this Nashu is truly my ever-loyal assistant, she should have no trouble completing my thoughts. Ahem! I'm a Mander-Mander-Manderville...?"},{"name":"CECY","text":"...man!♪"},{"name":"HILDIBRAND","text":"Doing what only a Manderville...?"},{"name":"CECY","text":"...can!♪"},{"name":"HILDIBRAND","text":"From the peaks of Coerthas to Thanalan,♪<br>Mander-Mander-Manderville..."},{"name":"CECY","text":"...man!♪ You're the best, Inspector!"},{"name":"HILDIBRAND","text":"A perfect score! You may rest easy, dear friends. This is unmistakably, unequivocally, indubitably the true Nashu!"},{"name":"CECY","text":"(-???-)I've never loved you more than now, you marvelous muttonhead, you!"},{"name":"HILDIBRAND","text":"Nashu? Is something the matter?"},{"name":"HILDIBRAND","text":"Just because you've picked up a few more wrinkles beneath the eyes, there's no need to avert that charming face of yours."},{"name":"CECY","text":"Wrinkles? Wrinkles!? Look who's talking, you crusty, cretinous old─"},{"name":"CECY","text":"...uh, genius inspector?"},{"name":"BRIARDIEN","text":"The charade is up...Miss Ellie."},{"name":"HILDIBRAND","text":"Miss Ellie? You look somehow...different?"}],"reward":{"gil":517,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66027]},"next":[66029]},"partials":[{"type":"npc","id":"1011691","obj":{"i":1011691,"n":"Hildibrand","l":41,"q":2}},{"type":"npc","id":"1011697","obj":{"i":1011697,"n":"Godbert","l":41,"q":2}},{"type":"npc","id":"1011693","obj":{"i":1011693,"n":"Nashu Mhakaracca","l":41,"q":1}},{"type":"npc","id":"1011694","obj":{"i":1011694,"n":"Briardien","l":41,"q":2}},{"type":"npc","id":"1011695","obj":{"i":1011695,"n":"Phillice","l":41,"q":2}},{"type":"npc","id":"1011698","obj":{"i":1011698,"n":"Behatted Sprat","l":41,"q":1}},{"type":"npc","id":"1011704","obj":{"i":1011704,"n":"Briardien","l":41,"q":2}},{"type":"npc","id":"1011705","obj":{"i":1011705,"n":"Phillice","l":41,"q":3}},{"type":"quest","id":"66027","obj":{"i":66027,"n":"Sibling Strife","g":68,"l":"Western Thanalan","s":18,"f":1}},{"type":"quest","id":"66029","obj":{"i":66029,"n":"Truths Untold","g":68,"l":"Ul'dah","s":20,"f":1}}]}