{"quest":{"name":"Meet, Greet, and Deceit","location":"Limsa Lominsa","id":66023,"patch":2.2,"sort":90,"eventIcon":71221,"issuer":1000980,"target":1000984,"genre":91,"journal":["There is no shortage of free advice or cheap hangovers at the Drowning Wench, and Gregory is happy to provide the guidance if not the grog.","Gregory advises you to go pay your respects to other adventurers, as is the custom in Limsa Lominsa. For your first test, he targets Niniya as the recipient of your obeisance. A curious choice, but then again, Gregory is a curious man.","Niniya asks what your business is, and you find yourself momentarily at a loss for words. With the chat mode firmly in <span class=\"highlight\">Say</span>, enter “I come in peace.” with all the dignity you can muster.","While Niniya does not seem displeased by your greeting, she voices a preference for more common parlance. Take a deep breath, relax your shoulders, and with the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!} to greet Niniya again.","Niniya is pleased, though you cannot tell whether it is by your greeting or your docility. She urges you to save your more formal utterances for the likes of Singing Stormcloud, and what better time than now?","The Roegadyn with the fine contralto has heard of you, and would know more. With the chat mode in <span class=\"highlight\">Say</span>, follow Niniya's advice and greet the decorous adventurer by entering “Greetings and salutations!”","Niniya's advice may have been given in jest, but if your reputation had not preceded you, Singing Stormcloud would likely have taken offense. The bluff adventurer tells you to observe Niniya's deeds and not her words, and such sound counsel deserves a {Thank you.}","After thanking Singing Stormcloud for her advice, she seems more amenable to your forthrightness. Will she be as good as her word and summon you back one day for a worthy cause? Or will nothing more come of this encounter? Only time will tell."],"objectives":["Speak with Niniya.","With the chat mode in <span class=\"highlight\">Say</span>, enter “I come in peace.” to greet Niniya.","With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!}.","Speak with Singing Stormcloud.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Greetings and salutations!” to greet Singing Stormcloud.","With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Thank you.}."],"dialogue":[{"name":"GREGORY","text":"Ah, adventurer, I see that you received the approbation of Baderon himself. What a pity it would be to mar such a promising start for simple want of knowledge about local customs."},{"name":"GREGORY","text":"Allow me to show you the ropes. It is the way of adventurers who ply their trade in Limsa Lominsa to seek out others of their kind and pay their respects. I am told this is a carryover from our neighbors of the pirate persuasion."},{"name":"GREGORY","text":"Now, let's see... Who might you...? Ah, Niniya! She will do. Sally forth and pay her your respects...whether she's deserving or not."},{"name":"NINIYA","text":"Well, well, well, I see a stormy petrel under my cozy roof. Come to say hello, have you?"},{"name":"SYSTEM","text":"Niniya is waiting for you to answer."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “I come in peace.”"},{"name":"SYSTEM","text":"I come in peace."},{"name":"NINIYA","text":"Never occurred to me things were otherwise, but I've heard worse greetings. Might you have something less...ponderous to say?"},{"name":"SYSTEM","text":"Niniya would like you to greet her again."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!}."},{"name":"NINIYA","text":"Oh, that was nice! I prefer not to stand on ceremony, unlike some adventurers. But still, we must adopt different ways if we wish to adventure widely and be paid handsomely."},{"name":"NINIYA","text":"Speaking of different ways, have you paid your respects to Singing Stormcloud? She's one to appreciate a ceremony or three, if you know what I mean."},{"name":"SINGINGSTORMCLOUD","text":"Ye'll be the 'venturer Baderon was singin' the praises of? What do ye want with me, eh?"},{"name":"SYSTEM","text":"Singing Stormcloud is waiting for you to answer."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Greetings and salutations!”"},{"name":"SYSTEM","text":"Greetings and salutations!"},{"name":"SINGINGSTORMCLOUD","text":"I thank ye kindly for that most peculiar greetin'. Tread softly, though, 'venturer. If ye didn't have the nod from Baderon himself, I might o' taken that for impudence and given you what for."},{"name":"SINGINGSTORMCLOUD","text":"Now, ye don't seem the cheeky sort, and not an Easterlin' neither. So what─or who─brings ye to a Roegadyn testy from a night o' losin' at the tables?"},{"name":"SINGINGSTORMCLOUD","text":"A wicked little thing in a black hood is my guess. Niniya does like her little lies. I'll not tell ye to disbelieve her. Just watch what her words bring to folk. That's all ye can do for anyone."},{"name":"SYSTEM","text":"Singing Stormcloud has given you sound counsel."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Thank you.}"},{"name":"SINGINGSTORMCLOUD","text":"Ye seem to have sense enough not to go trustin' words o'er deeds. Ye should have no trouble navigatin' the waters 'round here, I reckon."},{"name":"SINGINGSTORMCLOUD","text":"Be seein' ye, 'venturer! And mayhap I'll come callin' when I've a need for a sensible sort of <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"}],"reward":{"gil":183,"items":[{"num":3,"id":4551},{"num":3,"id":4555}]},"reqs":{"jobs":[{"lvl":9,"id":1}],"quests":[66005]}},"partials":[{"type":"npc","id":"1000980","obj":{"i":1000980,"n":"Gregory","l":28,"q":3}},{"type":"npc","id":"1000984","obj":{"i":1000984,"n":"Singing Stormcloud","l":28,"q":3}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"quest","id":"66005","obj":{"i":66005,"n":"Just Deserts","g":1,"l":"Middle La Noscea","s":36}}]}