{"quest":{"name":"Kobolds Ahoy","location":"Lower La Noscea","id":66022,"patch":2.0,"sort":80,"eventIcon":71221,"issuer":1002653,"target":1002626,"involved":[1002119,1002591,1002657,1002658],"genre":91,"journal":["Diminutive kobolds are wreaking great chaos at the Grey Fleet.","Loetrswys seeks to enlist the aid of the Red Rooster Stead by contacting Moegramm.","On hearing of Loetrswys's woes, Moegramm asks you to help send a missive to Ostfyr at the La Thagran Checkpoint. Broenruht can provide you with guidance through Blind Iron Mines, so that you may reach La Thagran in time.","Broenruht informs you that the mine's inhabitants keep mostly to themselves, and that the route to La Thagran is relatively safe. ","On reading the report, Ostfyr fears for Summerford Farms, and asks that you inform Staelwyrn of the kobold threat.","Staelwyrn has been more concerned with the Sahagin menace of late, but takes Ostfyr's warning to heart out of respect."],"objectives":["Speak to Moegramm.","Speak to Broenruht.","Deliver the report on kobolds to Ostfyr.","Speak to Staelwyrn."],"dialogue":[{"name":"LOETRSWYS","text":"The kobold crimes of late give us ample cause for concern."},{"name":"LOETRSWYS","text":"Yet Weitzaren is content to pass them off as mere mischief-making. He cares more for the welfare of his mills than that of his workers."},{"name":"LOETRSWYS","text":"If only my beloved, Moegramm, knew of my plight, I am certain he would leap to my rescue all the way from his post at the Red Rooster Stead."},{"name":"LOETRSWYS","text":"He often calls me his “little lamb,” and I am certain my absence could only have made his heart grow fonder. "},{"name":"MOEGRAMM","text":"Indeed, the kobolds' steady incursions warrant wariness."},{"name":"MOEGRAMM","text":"And now they frighten my poor little lamb, the soul I love more than any other on two legs! We must summon the Yellowjackets at once."},{"name":"MOEGRAMM","text":"I shall pen the missive warning Ostfyr of the kobolds' advance. You must deliver it to the La Thagran Checkpoint."},{"name":"MOEGRAMM","text":"There is no time to spare. To reach the La Thagran Checkpoint, go first to Blind Iron Mines─Broenruht will guide you from there."},{"name":"BROENRUHT","text":"Bound for the La Thagran Checkpoint? You've come to the right mines."},{"name":"BROENRUHT","text":"You'll find most denizens of the dark will leave you be so long as you extend them the same courtesy, but kobolds can be a bit more belligerent. Still, nothing an adventurer of your venturesomeness can't handle, I suppose."},{"name":"OSTFYR","text":"They say a messenger through the mines arrives faster than the crow flies from the Stead. It is good to see you."},{"name":"OSTFYR","text":"I hadn't realized the extent of the kobold menace, but Moegramm's missive has opened my eyes."},{"name":"OSTFYR","text":"Should we fail to bolster our patrols of the La Noscean lowlands now, we stand to lose the region altogether."},{"name":"OSTFYR","text":"I have not forgotten when the kobolds sought to seize the west. 'Twould be best those there know their former nemesis has resurfaced."},{"name":"OSTFYR","text":"Though Staelwyrn no doubt remains vigilant, I would ask you to visit Summerford Farms and remind him that sleeping dogs may not be content to lie."},{"name":"STAELWYRN","text":"Ostfyr's prudence befits his post. The watchman's always seen threats far over the horizon."},{"name":"STAELWYRN","text":"Which is all well and good, but the Sahagin swarmin' at our gates demand my immediate attention before ugly heads that haven't reared themselves in recent memory."},{"name":"STAELWYRN","text":"Still, I know better than to disregard the biddin' of the Yellowjackets."}],"reward":{"gil":174,"items":[{"id":3313,"one":1},{"id":3314,"one":1},{"id":5824,"one":1}],"xp":637},"reqs":{"jobs":[{"lvl":4,"id":1}],"questsType":"all","quests":[66012,66020]}},"partials":[{"type":"npc","id":"1002653","obj":{"i":1002653,"n":"Loetrswys","l":31,"q":2}},{"type":"npc","id":"1002626","obj":{"i":1002626,"n":"Staelwyrn","l":30,"q":10}},{"type":"npc","id":"1002119","obj":{"i":1002119,"n":"Ostfyr","l":30,"q":2}},{"type":"npc","id":"1002591","obj":{"i":1002591,"n":"Skarnmhar","l":31,"q":4}},{"type":"npc","id":"1002657","obj":{"i":1002657,"n":"Moegramm","l":31,"q":4}},{"type":"npc","id":"1002658","obj":{"i":1002658,"n":"Broenruht","l":31,"q":2}},{"type":"item","id":"3313","obj":{"i":3313,"n":"Hempen Kecks","l":8,"c":45062,"t":36,"p":168}},{"type":"item","id":"3314","obj":{"i":3314,"n":"Hempen Gaskins","l":8,"c":45309,"t":36,"p":168}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66012","obj":{"i":66012,"n":"Wool's Errand","g":91,"l":"Lower La Noscea","s":60}},{"type":"quest","id":"66020","obj":{"i":66020,"n":"What Goes Around","g":91,"l":"Lower La Noscea","s":70}}]}