{"quest":{"name":"Truths Untold","location":"Ul'dah","id":66029,"patch":2.5,"sort":20,"icon":100356,"unlocksFunction":1,"eventIcon":71341,"issuer":1011699,"target":1011707,"involved":[1001679,1011691,1011694,1011695,1011697,1011704,1011705,1011712],"genre":68,"journal":["Who is this unfamiliar woman, and what secrets does she hold?","The woman reveals herself as Cecy, sister to Ellie and the woman behind the phantom thief's many masks. She further tells of her quest for vengeance against Ul'dah for the heinous crime of turning her ancestors into zombies─a historical fact covered up, she insists, by Phillice and her fellow Arbiters. Seeking to deliver revenge by her own hand, Cecy casts a handful of zombie powder at Phillice, only to see the ever-chivalrous Hildibrand take the brunt of the attack in her stead. As all look on with shock and dismay, Hildibrand's mother, Julyan, arrives on the scene. Distressed at the sight of her beloved son in his zombified state, she delivers a violent reckoning to her husband Godbert, whom she holds responsible for Hildibrand's plight, and Gilgamesh, who really just picked a bad time to show up. Fortunately, she takes an instant liking to you, and enlists your aid in saving her son from permanently joining the ranks of the undead. Speak with the imposing matron and see what she has in mind.","Julyan explains that holy water is a well-known remedy for those afflicted with a case of zombie-ism, and assures you that she can fashion a dose from two ingredients─Oversoul rags and twice-distilled water. That said, the cleansing agent must be administered before the ichor has diffused throughout the entire body. With time being of the essence, she sends you and a befuddled Gilgamesh into town to retrieve the necessary materials: the rags from Syntgoht of Syntgoht's Sundries, and the water from a trader by the name of Gest.","A well-timed visit from Avila, the gladiatrix who you and Hildibrand befriended in your recent travails at the Coliseum, proves to be just the ticket in convincing Syntgoht to part with the last piece of Oversoul rags he has in stock. Count your blessings and seek out Gest at the Hustings Strip.","Gest proves to be a thoroughly unpleasant sort who would just as soon see Hildibrand die on account of his dislike for the way the Manderville family conducts its business. Just as all hope seems lost, the most fortuitous appearance of Arabella, the maiden you and Hildibrand befriended at Costa del Sol, has Gest changing his tune, as he begrudgingly parts with a bottle of twice-distilled water in return for a dance with the lapis-tressed beauty. With the two ingredients safely in hand, deliver them to Julyan back at the vault and hope there is still time to save the unfortunate Hildibrand.","Julyan swiftly synthesizes a phial of holy water and administers it to Hildibrand, assuring you that her son is strong enough of will and body to fight off the zombie curse. She promises to see to his care, urging you to go and stop Ellie before she can bring her plan to fruition─using the four relics to break the ancient Sil'dihn seal and drown all of Ul'dah in zombie dust. She further cows Gilgamesh into making another trip to the markets to procure the fire crystals to keep her son's body warm. Gilgamesh stands over a crate of crystals, wistfully recalling old times with his feathered companion. As he delivers a heartfelt plea, a blinding flash of light comes down from the heavens, reuniting the traveling warrior with a long-absent friend..."],"objectives":["Speak with Julyan.","Procure Oversoul rags from Syntgoht.","Procure twice-distilled water from Gest.","Deliver the Oversoul rags and twice-distilled water to Julyan."],"dialogue":[{"name":"PHILLICE","text":"I was all but certain that Ellie was our thief. What is the meaning of this!?"},{"name":"BRIARDIEN","text":"Another two-layered mask, mayhap? But no...this woman bears a striking resemblance to Miss Ellie."},{"name":"GODBERT","text":"So the letters spoke true─the fiend was in our midst all along."},{"name":"HILDIBRAND","text":"My prodigious powers of deduction scream out to me: this woman knows something!"},{"name":"CECY","text":"...Seven hells. Done in by a muscle-bound muttonhead and his motley troupe of mummers."},{"name":"BRIARDIEN","text":"Just who <span class=\"emphasis\">are</span> you? Your resemblance to Miss Ellie is most uncanny, and yet..."},{"name":"CECY","text":"...Consulting Inspector Briardien. Once again, you fail to measure up to your lofty reputation."},{"name":"CECY","text":"Of course we resemble each other. Ellie is, after all, my own flesh and blood. My beloved sister, and my eminently capable partner in crime."},{"name":"CECY","text":"(-Cecy-)A thousand faces I may wear, but only one name do I bear. You can call me Cecy. Charmed, I'm sure."},{"name":"CECY","text":"(-Cecy-)Are you quite all right? Why, you look as if you've seen a ghost! Despite my moniker, I assure you that Ellie and I are no specters. What we <span class=\"emphasis\">are</span>, mind you, are the last living scions of Sil'dihn aristocracy."},{"name":"CECY","text":"(-Cecy-)Bemused, are you? Befuddled, to find two sisters behind the mask? Try using your brains once in a while. Every time you encountered the thief, Ellie was standing right in your midst."},{"name":"CECY","text":"(-Cecy-)No, the thief that four times stole the show─oh, and those priceless relics─was me. Meanwhile, Ellie hid in plain sight, supplying me with just the knowledge I needed to stay one step ahead of my pursuers, all while spinning the hair-raising tales of my exploits that won the hearts of this nation."},{"name":"CECY","text":"(-Cecy-)We owe a lot to you. Truly! Why, without the tales of your hapless attempts to catch me, we never could have risen to these heights of celebrity!"},{"name":"HILDIBRAND","text":"...Miss Cecy. From a gentleman to a lady, I would ask you one thing and one thing only. Just what is it that you and Miss Ellie hope to accomplish with all of your schemes?"},{"name":"CECY","text":"(-Cecy-)Justice! Four hundred years ago, Ul'dahn dogs reduced our great nation to a nation of zombies! At long last, the cowards that would still justify these foul deeds will suffer the same fate!"},{"name":"BRIARDIEN","text":"...Wait. The histories say that it was <span class=\"emphasis\">Sil'dih</span> that turned their own men into zombies."},{"name":"CECY","text":"(-Cecy-)The histories <span class=\"emphasis\">lie</span>! And <span class=\"emphasis\">you</span> work from the shadows, silencing those who would speak the truth! <span class=\"emphasis\">You</span> should have died with your fellows, false arbiter!"},{"name":"CECY","text":"(-Cecy-)It was Ul'dah that ordered the creation of that dreadful powder, and wielded it as a weapon against our proud ancestors. The history of your glorious sultanate is built on a lie!"},{"name":"GODBERT","text":"What is this madness you speak, woman!?"},{"name":"CECY","text":"(-Cecy-)Not madness─<span class=\"emphasis\">truth</span>! The powder in my possession was stolen from the Ul'dahn army four centuries ago by one of my ancestors. They say it was his final act of courage in the moments before his leg fell off and his rotting head dropped from his shoulders."},{"name":"CECY","text":"(-Cecy-)<span class=\"emphasis\">This</span> is the truth that the histories don't tell. The truth that this doe–eyed Sultansworn would kill to keep buried deep in the sands of Thanalan!"},{"name":"CECY","text":"(-Cecy-)...But your time of reckoning is nigh. Oh, yes... Before long, you─and everyone in this rotten nation─will know firsthand the horrors my ancestors knew. Ahahaha!"},{"name":"BRIARDIEN","text":"And just what do you mean by that?"},{"name":"CECY","text":"(-Cecy-)Oh, how the idiots lap up the stories! A masked crusader for justice! A dashing rebel waging battle against power and authority! Oh, if only they knew..."},{"name":"CECY","text":"(-Cecy-)But they will see soon enough...when they're eating each other's brains out on the streets!"},{"name":"CECY","text":"(-Cecy-)In the last days before our proud nation was razed to the ground, a band of the final survivors stole a vast quantity of the powder from the Ul'dahn vaults, hiding it away in a secret vault sealed with powerful magicks."},{"name":"CECY","text":"(-Cecy-)The sole means by which the vault may be opened? By assembling four secret relics from Belah'dia. Four relics once housed in the royal palace of Sil'dih, before the Ul'dahn dogs stole them and claimed them for their own."},{"name":"CECY","text":"(-Cecy-)...And so it dawns upon you at last. Yes, even as we speak, Ellie makes for the vault, the four relics safely in hand. Just think! One day, you'll be able to tell your grandchildren you were there when zombie powder rained down on Ul'dah. No, wait...you'll all be <span class=\"emphasis\">dead</span>! Ahahaha!"},{"name":"BRIARDIEN","text":"Preposterous!"},{"name":"CECY","text":"But first, <span class=\"emphasis\">you</span>, my dear. You will not even have the pleasure of looking upon the last moments of your precious homeland. Let your flesh rot like all of your rotten lies!"},{"name":"HILDIBRAND","text":"I think not, Miss Cecy!"},{"name":"BRIARDIEN","text":"Hildibrand!"},{"name":"CECY","text":"You <span class=\"emphasis\">idiot</span>! Just for once, could you not get in the way!?"},{"name":"HATENA","text":"(-???-)Godbert Manderville! I can't even trust your sorry arse to look after him for a day!"},{"name":"JULYAN","text":"Godbert Manderville! Can I not even trust yer sorry arse to keep an eye on our dear boy for a bloody <span class=\"emphasis\">day</span>!?"},{"name":"GODBERT","text":"I knew it! That presence watching over us from the shadows... It was <span class=\"emphasis\">you</span>, my dear wife!"},{"name":"BRIARDIEN","text":"...Ahem. Am I to understand that you are Hildibrand's...mother?"},{"name":"GILGAMESH","text":"Aye, this is more like it! Hand to hand, skillet to skillet...it's enough to send a warrior's pulse racing! Prepare yourself, <span class=\"highlight\">Forename</span>! The time of our final confrontation is nigh!"},{"name":"JULYAN","text":"Do ye have popotoes for brains, you overstuffed buffoon!? My beloved boy's been turned into a stinkin' corpse, if ye hadn't bloody noticed!"},{"name":"JULYAN","text":"You! <span class=\"highlight\">Forename</span> or somethin', was it!?"},{"name":"JULYAN","text":"Hildy's told me all about your high jinks together. Pleased to meet ye!"},{"name":"JULYAN","text":"My dear boy's always had a bit of a rebellious streak. What can I say? I can come on a bit too strong at times."},{"name":"JULYAN","text":"But can ye blame me!? This time I thought I'd sit back and leave things to my sorry-arse husband here, and look what that got me! You'll help me out, won't ye?"},{"name":"PHILLICE","text":"Inspector Hildibrand's...mother?"},{"name":"BRIARDIEN","text":"I daresay it's quite clear who wears the pants in the family...so to speak."},{"name":"JULYAN","text":"Reunited with my dear boy for the first time in ages, and just look at him! He's...<span class=\"emphasis\">green</span>!"},{"name":"JULYAN","text":"Fortunately, there's still time to reverse the zombie curse, and I know just the remedy: a phial o' holy water. The ingredients are simple: a tatter of Oversoul rags and a phial of twice-distilled water."},{"name":"JULYAN","text":"Syntgoht at the markets stocks the former, and the latter you can procure from a trader by the name o' Gest. Now hurry! Once the poison spreads throughout his veins, no antidote'll save him."},{"name":"BRIARDIEN","text":"In the meantime, I will search for the bumbler's bumbling assistant. With any luck, Miss Nashu is still alive."},{"name":"GILGAMESH","text":"Ouch! That smarts. Ye gads, Hildy─you're looking none too hearty yourself!"},{"name":"JULYAN","text":"No thanks to you, you bumbling oaf! Now, are ye going to accompany <span class=\"highlight\">Forename</span> here and make yourself useful, or do I have to reintroduce you to that wall!?"},{"name":"GILGAMESH","text":"Er, ah...b-but of course, milady, Gilgamesh is ever at your service. Syntgoht's Sundries, was it? Come now, <span class=\"highlight\">Forename</span>! There is work to be done!"},{"name":"JULYAN","text":"A piece of Oversoul rags from Syntgoht's Sundries and a bottle of twice-distilled water from the trader Gest! Now hurry, godsdammit─my dear boy's life is at stake!"},{"name":"SYNTGOHT","text":"Oversoul rags, you say? I fear that I've only a single tatter left in stock, and it's already been spoken for."},{"name":"GILGAMESH","text":"But, my good man, you must reconsider! My dear friend's life─and quite possibly mine own as well─hangs in the balance!"},{"name":"SYNTGOHT","text":"I sympathize with your plight, friend, but a man has to make a living. I've been promised a copious supply of rare chimera membrane for these rags. Unless you can offer me the same, no deal."},{"name":"GILGAMESH","text":"Gah! And you expect us to be able to summon such a rarity out of nowhere at a moment's notice!?"},{"name":"AVILA","text":"(-???-)...Well, look what we have here. If it isn't the Warrior of Light from the Coliseum. Funny who you meet at the markets."},{"name":"AVILA","text":"As it happens, I just returned from my training, and the slaying of ten chimeras just happened to be my task for the day. If it's chimera membrane you seek, you're more than welcome to a share."},{"name":"GILGAMESH","text":"My lady! You are far too kind!"},{"name":"AVILA","text":"Don't mention it. If it hadn't been for Inspector Hildibrand and <span class=\"highlight\">Forename</span> here, I'd still be tag teaming with that slimy beast and cheating my way to fame and fortune. ...And I'm a woman who pays her debts."},{"name":"SYNTGOHT","text":"Thal take me if that wasn't Avila the Tempest! Ever since she confessed to her trickery and started climbing back up from the bottom of the ranks, I've been proud to call myself one of her biggest fans. Why, I've half a mind to give you the rags you seek simply for the privilege of meeting her!"},{"name":"GILGAMESH","text":"A kind sentiment, my good man, but we are more than happy to uphold our side of the bargain─aren't we, <span class=\"highlight\">Forename</span>? And with this, our task here is done. Now, let us find this trader named Gest!"},{"name":"SYNTGOHT","text":"Why did you not tell me that you knew Avila the Tempest, friend!? Say, do you suppose you could come by front row seats for her upcoming bout?"},{"name":"GEST","text":"The blundering Manderville boy is on his last legs and you need something of mine to save him, you say?"},{"name":"GEST","text":"Hmph... Perhaps you can give me a good reason why I should care. Those bloody Mandervilles are richer than the Traders Themselves, yet they have the audacity to haggle me down to the last gil for every purchase. If the family line ended today, I'd be a happier─and wealthy─man."},{"name":"GEST","text":"...And now, I believe the ballroom calls. Good day to you, and do pass along my condolences to the grieving parents."},{"name":"GILGAMESH","text":"Have you not a shred of honor or compassion in that spindly body!? Business rival or no─the man is on death's doorstep!"},{"name":"VANNES","text":"(-???-)After the events of that day, my father will not so easily forgive and forget─but it matters not to me. No, my love for you is as deep as the seven seas! I beg of you, milady, may I have this dance?"},{"name":"ARABELLA","text":"<span class=\"highlight\">Forename</span>! What a lovely surprise. Are you here for the ball, perchance?"},{"name":"ARABELLA","text":"Heavens! The poor inspector..."},{"name":"GEST","text":"Well, if it isn't the lapis maiden in the flesh! What say you bid farewell to preening fops and scruffy adventurers and share a dance with a cultured gentleman befitting your great beauty?"},{"name":"ARABELLA","text":"Why, it would be a pleasure and an honor both, milord."},{"name":"ARABELLA","text":"...Provided you first provide my good friend <span class=\"highlight\">Forename</span> with the bottle of twice-distilled water that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> seeks."},{"name":"GEST","text":"Y-You <span class=\"emphasis\">know</span> this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>!? Bah...if that is the price you would set, then so be it. Take it─it's barely worth its weight in gil, anyway. Now, shall we, Miss Arabella?"},{"name":"GILGAMESH","text":"I knew Hildy to be a worthy rival, but to think he was this beloved by so many! Clearly, this realm would deeply mourn his loss. Quickly, <span class=\"highlight\">Forename</span>! Let us deliver these goods while there is still time to save him!"},{"name":"JULYAN","text":"...I trust the two of ye wouldn't dare to come back empty-handed!?"},{"name":"JULYAN","text":"Bloody brilliant! Aye, I'd take you over my muscle-headed half-wit of a husband any day!"},{"name":"JULYAN","text":"Now, stand back and let me show you some real Manderville home cookin'!"},{"name":"JULYAN","text":"Thal, Ye bloody bugger, guide my skillet!"},{"name":"JULYAN","text":"Aye, that should stop its spread. Now it's up to Hildy to flush what's left out o' his system. Don't worry, he's <span class=\"emphasis\">my</span> son, after all─I reckon he's still got some fight left in him."},{"name":"BRIARDIEN","text":"Look who I found. She was slumbering obliviously in a rubbish-strewn corner of Pearl Lane."},{"name":"NASHUMHAKARACCA","text":"Boy, did that nap feel good!"},{"name":"BRIARDIEN","text":"...Yes, I'm sure it did. <span class=\"highlight\">Forename</span>. Word has it that Ellie has been sighted at the Sil'dihn ruins. We must go there with all haste."},{"name":"JULYAN","text":"Ye've done well by my dear boy today. Don't worry, I'll handle things from here. There's a nice warm bed for him, and I think I know a few specialists who might know a thing or two about his condition."},{"name":"JULYAN","text":"...What in the seven hells are ye standin' around for!? The future of Ul'dah is at stake!"},{"name":"GILGAMESH","text":"...<span class=\"highlight\">Forename</span>. My strength is yours as well. For Ul'dah...and for our friend Hildy!"},{"name":"JULYAN","text":"You! You remind me o' my husband, what with ye havin' more muscles than sense. If yer so keen on makin' yerself useful, why don't ye run to the markets and bring me some fire crystals?"},{"name":"JULYAN","text":"Keepin' my dear boy warm is key to fightin' off the zombification. Let's see...I believe twenty crates or so should suffice."},{"name":"GILGAMESH","text":"I-I am a warrior, not an err─ah...y-yes, milady!"},{"name":"GILGAMESH","text":"I say, Enkidu! The burden we must bear simply to secure my long-awaited final confrontation with <span class=\"highlight\">Forename</span>..."},{"name":"GILGAMESH","text":"That said, the events of today have given me cause to reflect. <span class=\"highlight\">Forename</span> and Hildy both─oh, to be blessed with such veritable legions of friends tried-and-true!"},{"name":"GILGAMESH","text":"But alas, not I! No... Only one true friend have I ever known, and she is long lost to me..."},{"name":"GILGAMESH","text":"You are a fine bird, and have given me great comfort in my travels. But you will never be Enkidu, my one and true companion! Oh, my friend! Were you here with me, even <span class=\"highlight\">Forename</span> could not stand against our combined might!"},{"name":"GILGAMESH","text":"O, Enkidu, wherever you may wander! Hear my words, and return here to my side! Enkidu, do you hear me!? ENKIIIDUUUUUUUUUUUU!"},{"name":"GILGAMESH","text":"Ye gads! What was that flash from the heavens? It nearly blinded me! And...what!? The crystals! Where have they gone!?"},{"name":"ENKIDU","text":"(-???-)Fancy meeting you here...old friend."},{"name":"GILGAMESH","text":"That voice... Could it be...!?"},{"name":"GILGAMESH","text":"My faithful companion... Why must you always make me wait so!?"}],"reward":{"gil":658,"items":[{"num":3,"id":7621}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66028]},"next":[66038]},"partials":[{"type":"npc","id":"1011699","obj":{"i":1011699,"n":"Hyuran Woman","l":41,"q":1}},{"type":"npc","id":"1011707","obj":{"i":1011707,"n":"Julyan","l":41,"q":2}},{"type":"npc","id":"1001679","obj":{"i":1001679,"n":"Syntgoht","l":41,"q":12}},{"type":"npc","id":"1011691","obj":{"i":1011691,"n":"Hildibrand","l":41,"q":2}},{"type":"npc","id":"1011694","obj":{"i":1011694,"n":"Briardien","l":41,"q":2}},{"type":"npc","id":"1011695","obj":{"i":1011695,"n":"Phillice","l":41,"q":2}},{"type":"npc","id":"1011697","obj":{"i":1011697,"n":"Godbert","l":41,"q":2}},{"type":"npc","id":"1011704","obj":{"i":1011704,"n":"Briardien","l":41,"q":2}},{"type":"npc","id":"1011705","obj":{"i":1011705,"n":"Phillice","l":41,"q":3}},{"type":"npc","id":"1011712","obj":{"i":1011712,"n":"Gest","l":41,"q":1}},{"type":"item","id":"7621","obj":{"i":7621,"n":"Glamour Dispeller","l":30,"c":26228,"t":60,"p":500}},{"type":"quest","id":"66028","obj":{"i":66028,"n":"Beneath the Mask","g":68,"l":"Ul'dah","s":19,"f":1}},{"type":"quest","id":"66038","obj":{"i":66038,"n":"Her Last Vow","g":68,"l":"Ul'dah","s":21,"f":1}}]}