{"quest":{"name":"A Thorne-y Relationship","location":"Ul'dah","id":66035,"patch":2.51,"sort":77,"icon":100387,"eventIcon":71221,"issuer":1011778,"target":1011780,"genre":198,"journal":["The sophisticated servitor would beseech your aid on behalf of his troubled master.<br>※This quest is available for a limited time only.","The sophisticated servitor explains to you that his master, one Nanapasi, means to fashion a special gift for his dear daughter, but the preparations have hit an unfortunate snag. Make your way to Emerald Avenue and offer the forlorn father what assistance you can.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","At Emerald Avenue, you encounter a visibly flustered Nanapasi, who appears convinced that his dear daughter has come to utterly despise him. Rendezvous with the troubled trader outside the Quicksand, where he will meet you after taking a walk to settle his troubled mind.","You meet with Nanapasi outside the Quicksand, where the flustered father explains his plight in detail. As he tells it, he sought to take advantage of this year's Little Ladies' Day festivities to repair a strained relationship with his daughter Ninimo, promising the girl that he would oversee the construction of a modern-day replica of the Thorne Dynasty decorations that she has long adored. Unfortunately, failing to exercise due diligence before he spoke, he now finds himself without the materials he needs to see his words become reality. Pleading for assistance, he entrusts you with an ancient map and directs you to speak with the disciplined domestic beside him if you are willing to offer your aid."],"objectives":["Speak with Nanapasi.","Speak with Nanapasi once more."],"dialogue":[{"name":"BUTLER00499","text":"You are an adventurer, yes? Oh, thank the Twelve! If it would not be too much trouble, might you spare a few bells of your time to assist my master and me with a most trying predicament?"},{"name":"BUTLER00499","text":"As you doubtless have observed from the colorful decorations about town, Little Ladies' Day festivities are in full swing here in the sultanate. It is in the spirit of this season that Master Nanapasi has devised a plan to make his dear daughter's dreams come true."},{"name":"BUTLER00499","text":"And yet, I fear the preparations have proven far more troublesome than he foresaw. Why, the last time I saw him, he was racing up and down Emerald Avenue like a chocobo with its head cut off! Please, friend, pray lend us a helping hand."},{"name":"BUTLERXXX","text":"Master Nanapasi means only the best for his daughter, yet it seems he has bitten off more than he can chew. You will help him, won't you, friend? You will find him a little bit further down the street."},{"name":"NANAPASI","text":"What say you, Ninimo!? Behold this grand stage, soon to be adorned with life-size figurines the likes of which this realm has not looked upon for ages! Just sit back and enjoy the show─Daddy dearest will see to the rest!"},{"name":"NANAPASI","text":"What say you, Ninimo!? Behold this grand stage and the life-size figurines which stand so elegantly and majestically upon it! It is but a matter of time before work is complete. Just sit back and enjoy the show─Daddy dearest will see to the rest!"},{"name":"NINIMO","text":"How many times must I <span class=\"emphasis\">tell</span> you, Father? I did not ask for you or anyone to build a stage for me. I wanted only to create something with my own─"},{"name":"NANAPASI","text":"Do not be ridiculous, my dear girl! What sort of father would I be if I let my very own little princess soil her dainty hands on her special day? ...No father at all, I say!"},{"name":"NINIMO","text":"...Very well, Father. I shall look forward to seeing the finished work, I suppose... &lt;sigh&gt;"},{"name":"NANAPASI","text":"Oh, Nanapasi! You've done it this time, you bloody half-wit! She hates you, absolutely <span class=\"emphasis\">hates</span>─hm? Do you have business with me, stranger?"},{"name":"NANAPASI","text":"Truly!? You are a godssend, my adventuring friend! I beg of you, lend your strength and deliver this fool of a father from his own folly!"},{"name":"NANAPASI","text":"...F-Forgive me. I have a habit of letting my emotions get the better of me. Might you join me outside the Quicksand to discuss the matter further? A brief stroll should suffice to cool my head."},{"name":"NANAPASI","text":"(He just doesn't understand! Oh, Ninimo, if only you had the courage to <span class=\"emphasis\">say</span> something...)"},{"name":"NANAPASI","text":"It is heartening to see you, friend. Your assistance in this matter is appreciated to no end."},{"name":"NANAPASI","text":"I trust you're aware of Little Ladies' Day and its origins? Each year, in honor of Princess Edvya─the adventure-seeking little lady that the festival is based on─artisans across the realm craft exquisite dolls, and fathers play doting seneschals to their precious princesses."},{"name":"NANAPASI","text":"My Ninimo, strong-willed girl that she is, never took much interest in the festivities─until this year, that is. “Father, Father!” she said to me one day, “Would it not be <span class=\"emphasis\">divine</span> if we could recreate the grand stage and life-sized dolls of the Thorne Dynasty!?”"},{"name":"NANAPASI","text":"&lt;sniff&gt; Oh, it brought a tear to my eye! Through the years, my work had prevented me from duly doting upon my daughter, and she learned quickly to fend for herself. And yet here was my beautiful girl, for the first time I could remember, practically <span class=\"emphasis\">begging</span> a favor of her daddy dearest!"},{"name":"NANAPASI","text":"I thought to myself: do the tales not speak of how Princess Edvya's ruse and the events with the miller's family brought about newfound understanding between the sultan and his daughter?"},{"name":"NANAPASI","text":"Yes, my heart leapt, <span class=\"emphasis\">this</span> is my chance to bridge the chasm that gapes within our own household, and forge a new bond with the daughter for whom I care so dearly!"},{"name":"NANAPASI","text":"...So it was that I swore to Ninimo that I would personally oversee the creation of the most magnificent Little Ladies' Day decoration Ul'dah had ever seen!"},{"name":"NANAPASI","text":"Sadly, it appears that I spoke too soon. I quickly learned that to recreate the decorations of the Thorne days would require materials which are all but impossible to find in modern days."},{"name":"NANAPASI","text":"Costumes and accessories I have managed to prepare, but if the dolls themselves are not of Thorne Dynasty make, any attempt to dress them up will seem hollow indeed. I fear that at this rate, my promise to my daughter will prove an empty one..."},{"name":"NANAPASI","text":"As you saw, I have prepared a grand stage, but with nothing to adorn it, it is a very lonely one indeed. This is where you come in. What say you, friend? Will you come to this hapless father's aid!?"},{"name":"NANAPASI","text":"With the help of your fellow adventurers, we have managed to secure some of the materials we need, but I fear we are still far from creating a piece that will win my dear daughter's heart. What say you, friend? Will you come to this hapless father's aid!?"},{"name":"NANAPASI","text":"If you can find it in your heart to help us, pray take this map and speak with my attendant here. She will tell you everything you need to know. You have my sincere gratitude for any and all assistance that you are able to offer!"}],"reward":{"gil":286,"items":[{"id":9900}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":34}]},"next":[66036]},"partials":[{"type":"npc","id":"1011778","obj":{"i":1011778,"n":"Sophisticated Servitor","l":40,"q":1}},{"type":"npc","id":"1011780","obj":{"i":1011780,"n":"Nanapasi","l":40,"q":2}},{"type":"item","id":"9900","obj":{"i":9900,"n":"Thorne Dynasty Map","l":40,"c":25940,"t":61,"p":200}},{"type":"quest","id":"66036","obj":{"i":66036,"n":"Digging for Dolls","g":198,"l":"Ul'dah","s":78,"r":1}}]}