{"quest":{"name":"A Father's Folly","location":"Ul'dah","id":66037,"patch":2.51,"sort":79,"icon":100389,"eventIcon":71221,"issuer":1011780,"target":1011780,"genre":198,"journal":["Nanapasi has a triumphant gleam in his eye.<br>※This quest is available for a limited time only.","Visibly impressed with himself, Nanapasi gleefully informs you of the successful completion of his magnum opus, a modern-day recreation of the grand Little Ladies' Day decorations from the Thorne Dynasty days. As a token of his appreciation for the role you played in making this possible, he invites you to be present at the moment of its grand unveiling before his daughter Ninimo. Make your way to Emerald Avenue and await father and daughter there.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Nanapasi unveils his creation to his daughter, only to be met with a less-than-enthusiastic reaction. Summoning the courage to speak her mind, Ninimo reveals that her true intention behind proposing the construction of the doll stand was to spend more time with her father, a message that at long last reaches the over-doting Nanapasi. Moved by his daughter's pure and gentle heart, Nanapasi apologizes for his obtusity and vows that he will endeavor to be the father she has always wanted him to be. For your role in bringing father and daughter together─not unlike Baldric and Edvya Thorne so many years ago─Nanapasi would offer you due reward. Seek him out in front of the Quicksand.","Nanapasi reiterates his gratitude for your efforts, informing you that he and Ninimo have decided to recraft the doll stand─this time, together. Expressing his confidence that today's events will lead to a healthy and happy family for years to come, he asks for your continued assistance in recovering the doll parts that will allow them to realize their dream together."],"objectives":["Wait for Ninimo at the specified location.","Speak with Nanapasi."],"dialogue":[{"name":"NANAPASI","text":"Impeccable timing, my friend! Thanks in no small part to your efforts, the doll stage that I promised to my dear daughter is at long last complete─and it is truly a wonder to behold, if I do say so myself!"},{"name":"NANAPASI","text":"When my dear Ninimo sees this, there will be no doubt in her mind as to the depths of her father's affection. Yes, I daresay no other man in the realm has gone to such lengths to make his daughter's dreams a reality!"},{"name":"NANAPASI","text":"As a token of my gratitude for all you have done, I would like to personally invite you to attend as I unveil the grand stage before my daughter's eyes. Go on ahead─I shall see to it that my daughter is along shortly."},{"name":"NANAPASI","text":"As a token of my gratitude for all you have done, I would like to personally invite you to attend as I unveil the grand stage before my daughter's eyes. Go on ahead if you will─I shall make sure that Ninimo is along momentarily."},{"name":"NANAPASI","text":"Behold, friend! Tell me, are these not the most magnificent dolls you have ever set eyes upon!?"},{"name":"NANAPASI","text":"Ninimo's dreams, my superior craftsmanship, and the kindness of you and your fellow adventurers have come together to realize one of the greatest masterworks Ul'dah has ever known!"},{"name":"NANAPASI","text":"Yes, my dear daughter will surely be blinded by the shining radiance of her father's love! Oh, and speak of an angel... Here she comes!"},{"name":"NINIMO","text":"You called, Father?"},{"name":"NINIMO","text":"My heavens, it's...it's beautiful! And you did this for <span class=\"emphasis\">me</span>? I...I do not know what to say, Father..."},{"name":"NINIMO","text":"You are the adventurer who made this possible, yes? Then I owe you my thanks as well. For I have finally found the opportunity─and the courage─to tell my father what I should have told him long ago."},{"name":"NINIMO","text":"...Father. The doll stand you have built for me is beautiful...beautiful beyond my wildest dreams. But to speak the truth, it is not what I truly wanted."},{"name":"NINIMO","text":"You are quick to dote on me, but I fear you are as blind to my true wishes as the sultan was to Princess Edvya's in the legend of yore..."},{"name":"NINIMO","text":"For you see, Father, it was not this grand spectacle itself that I truly desired. To speak the truth, even the humblest replica would have sufficed, had only the two of us created it...<span class=\"emphasis\">together</span>."},{"name":"NANAPASI","text":"...N–Ninimo. So that is why you were so insistent on... Th–That is why you... Oh, Thal take me─what have I done!?"},{"name":"NANAPASI","text":"Oh, what an imbecile I have been! A more unworthy father this realm has never known! Ninimo, my dearest daughter, what can your fool of a father do to earn your forgiveness!?"},{"name":"NINIMO","text":"Oh, Father...do not berate yourself so. I never doubted your love for me. I was merely waiting for the day that you would finally understand─a day that has finally come."},{"name":"NINIMO","text":"All I ask is that you allow me to contribute to the decorations in my own way. After all, it is hardly fair to impose solely on the generosity of adventurers."},{"name":"NANAPASI","text":"Oh, Ninimo! My dearest daughter's kindness truly knows no bounds! I daresay that at this moment, there is no prouder father in all of Eorzea!"},{"name":"NINIMO","text":"...Nor a happier daughter, for the events of this day have brought us together much as it happened so many centuries ago for Baldric and Edvya Thorne."},{"name":"NANAPASI","text":"...N-Ninimo! Promise that you will always be my princess!"},{"name":"NINIMO","text":"Oh, Father... &lt;sniff&gt; Must you always be so sentimental?"},{"name":"NINIMO","text":"I cannot thank you enough, adventurer. Were it not for your kindness, I would not have had the opportunity to open my heart to my father on this most fitting of occasions."},{"name":"NANAPASI","text":"...And I thank you as well, friend, not only for your part in seeing my creation to completion, but for bridging the gaping chasm of misunderstanding that threatened to tear the two of us apart. Pray visit again, that I might properly reward you for all you have done."},{"name":"NANAPASI","text":"There you are, friend! After discussing the matter, Ninimo and I have decided to embark on a reshaping of the doll display─one that this time shall be crafted to meet the aesthetic ideals of father and daughter alike."},{"name":"NANAPASI","text":"Doubtless we will continue to have our differences, as all parents and their children do. But now that we are able to share our thoughts freely, I have no doubt that the bonds between us will grow even stronger in the days and years to come."},{"name":"NANAPASI","text":"Word has it that there are still doll parts out there to be found. If you would be so kind, any continued assistance you might offer would be a great boon to us in our efforts."},{"name":"NANAPASI","text":"Little Ladies' Day comes around each and every year, but I know now that I was blind to the true meaning of the occasion until today. Please accept this as a token of a father's most heartfelt gratitude."}],"reward":{"gil":286,"items":[{"id":10066}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":34}],"quests":[66036]}},"partials":[{"type":"npc","id":"1011780","obj":{"i":1011780,"n":"Nanapasi","l":40,"q":2}},{"type":"item","id":"10066","obj":{"i":10066,"n":"Peach Blossom Choker","l":1,"c":54911,"t":40,"p":45}},{"type":"quest","id":"66036","obj":{"i":66036,"n":"Digging for Dolls","g":198,"l":"Ul'dah","s":78,"r":1}}]}