{"quest":{"name":"The Light of Hope","location":"Mor Dhona","id":66031,"patch":2.5,"sort":8,"icon":100379,"unlocksFunction":1,"eventIcon":71341,"issuer":1006725,"target":1006725,"involved":[1011641],"genre":15,"journal":["With a look of finality upon him, Rammbroes seems intent upon sealing the Crystal Tower once and for all.","You tell Cid and Rammbroes of what occurred in the World of Darkness. Suddenly, a researcher dashes up, and tells you in panicked tones that G'raha Tia is ordering researchers out of the Crystal Tower. Hasten back to the Eight Sentinels, and speak with the son of Saint Coinach to discover what is happening.","You rush to the Crystal Tower. Before you can enter the Crystal Tower to discover what is afoot, G'raha bids you stop. It seems he has a mind to seal the gates with himself inside. He reveals that the survivors of the Fourth Umbral Calamity prayed the tower would become a beacon of hope in the future. To make that a reality, Princess Salina─the only remaining royal Allagan─gave her blood and memories to her most trusted advisor. That man was G'raha's ancestor. Now, to ensure the wish of the ancients comes true, the historian has decided to put the Crystal Tower once again into a long slumber. He leaves you with a task: build a bright future. His farewells fade with the closing of the Crystal Tower. It would be best to return to Rammbroes and discuss all that has transpired.","Though the tower is silent and Cid has left to pursue new ventures, Rammbroes vows that NOAH will not disband. He promises to continue onwards─in honor of the wish passed down from ancient Allag, in honor of Unei and Doga's sacrifice, and in honor of G'raha's future. Now, a new dawn has come to Eorzea."],"objectives":["Speak with the son of Saint Coinach.","Report to Rammbroes."],"dialogue":[{"name":"RAMMBROES","text":"I trust you have rested, my friend. Good. I wish to seal the tower now...but there is something we must do first."},{"name":"RAMMBROES","text":"Let me summon the others, and hear in full what happened beyond the rift."},{"name":"RAMMBROES","text":"...So the Allagan Eye that runs in G'raha's line <span class=\"emphasis\">does</span> mean that royal blood flows in his veins."},{"name":"RAMMBROES","text":"I suppose it is not so odd to think his forebears gained it via ancient technology. But who imbued his family with the blood, and for what purpose?"},{"name":"RAMMBROES","text":"Mayhap all this was fate, from discovering the tower to G'raha gaining Unei and Doga's blood."},{"name":"BIGGS","text":"Has G'raha said anything? For that matter, where <span class=\"emphasis\">is</span> G'raha? And what of Nero?"},{"name":"CID","text":"I'm not sure about our resident historian, but Nero left the tower with me. Where he's vanished to since, I cannot say."},{"name":"CID","text":"But knowing him as I do, I don't believe he'll scheme against us for the time being. ...Though he <span class=\"emphasis\">is</span> still Nero."},{"name":"RAMMBROES","text":"<span class=\"highlight\">Forename</span>, you say G'raha stayed behind at the Crystal Tower. I wonder if he even now prepares to seal the place off."},{"name":"INVESTIGATORA","text":"Master Rammbroes! Master Rammbroes!"},{"name":"INVESTIGATORA","text":"'Tis G'raha Tia, sir! He came into the Crystal Tower, and began ordering researchers out!"},{"name":"RAMMBROES","text":"What? Why would he do such a thing?"},{"name":"INVESTIGATORA","text":"I do not know, sir, but he was quite insistent. He all but bodily forced me out of the gates."},{"name":"INVESTIGATORA","text":"I suppose it's possible he told one of the others, but I wasted no time in finding out. I thought it best to hasten here and ask your guidance."},{"name":"RAMMBROES","text":"Very well. Let us go and speak with these researchers, and get to the bottom of this queer business."},{"name":"RAMMBROES","text":"Master Garlond, <span class=\"highlight\">Forename</span>, please come with me. No doubt G'raha means to seal off the Crystal Tower, but it worries me that he did not breathe a word of his plan to us."},{"name":"INVESTIGATORB","text":"What in the world was G'raha Tia thinking, demanding we leave the tower?"},{"name":"INVESTIGATORB","text":"No doubt you want to know why. I wish I knew that myself!"},{"name":"INVESTIGATORB","text":"Of course, he would tell me nothing. But he will be honest with you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─I am certain of it!"},{"name":"GRAHATIA","text":"(-???-)Go no further, my friends! The doors will close ere long."},{"name":"RAMMBROES","text":"So you <span class=\"emphasis\">are</span> of a mind to seal the tower, G'raha."},{"name":"RAMMBROES","text":"I know time is of the essence, but all I ask is a hint of your plan. Please, come here so we can discuss this."},{"name":"GRAHATIA","text":"...No. My apologies, but I cannot."},{"name":"RAMMBROES","text":"Come, man, what is this nonsense!? If aught is amiss, surely we can help!"},{"name":"GRAHATIA","text":"Not this time, my friend. Just as Unei and Doga fulfilled their destiny, so too must I fulfill mine. My blood has awakened me to this fact."},{"name":"GRAHATIA","text":"As my father told me, the truth has always lain with Allag. Or, rather, 'twas there the wish I must grant was born."},{"name":"GRAHATIA","text":"You see, not all the world perished in Xande's calamity. Survivors stood amidst the ruins of Allag, looking to the Crystal Tower. But it was nowhere to be seen."},{"name":"GRAHATIA","text":"Yet they hoped its spires would again dominate the land, and prayed that the Crystal Tower would be a beacon of hope to people everywhere."},{"name":"GRAHATIA","text":"Word of this soon reached the only member of Allag's royalty to outlive the empire: the princess Salina."},{"name":"GRAHATIA","text":"Salina was moved by the people's dearest wish. She used the very best of Allag's technology to give her blood and memories to he whom she trusted most. That man was my forebearer."},{"name":"GRAHATIA","text":"For millennia, we waited. Allag's art and ingenuity faded. Our royal blood grew thin. But before the last drop could vanish from the realm, the memory of all this returned to me."},{"name":"GRAHATIA","text":"And now, I must fulfill the wish of the ancients. The tower <span class=\"emphasis\">will</span> shine forth as a new beacon of hope."},{"name":"CID","text":"G'raha, the Crystal Tower's strength poses too great a threat to Eorzea now."},{"name":"CID","text":"We would need technology as advanced as Allag's to use it correctly. As things stand, we barely understand the tower's workings. Hells, we may <span class=\"emphasis\">never</span> fully comprehend them."},{"name":"GRAHATIA","text":"'Tis as you say, Cid. We could wait for someone, someday, to reach the same heights as Allag, but by then we will have lost the royal blood <span class=\"emphasis\">and</span> the means to control the tower."},{"name":"GRAHATIA","text":"But what if I do as Amon did, and put the tower into a deep sleep?"},{"name":"CID","text":"What!? You cannot mean that!"},{"name":"GRAHATIA","text":"I am deadly serious, Cid. The tower may only be used once men rival the Allagans in knowledge. I will slumber within Syrcus Tower until then, to greet those with the means to open the gates."},{"name":"GRAHATIA","text":"Then, I will guide them. And thus will the tower shine forth as the beacon of hope it was meant to be. 'Tis the only way to make the wishes of the ancients come true."},{"name":"GRAHATIA","text":"The future is where my destiny awaits."},{"name":"GRAHATIA","text":"But yours lies outside of these doors. Go. Create a future where hope reigns, and the tragedies of the past are but memories. No one but you can accomplish such things."},{"name":"CID","text":"Nothing we say will make you change your mind, will it?"},{"name":"CID","text":"Onwards to a brighter future... It won't be easy, of course. But that's exactly why we'll do it!"},{"name":"WEDGE","text":"W-We'll catch up with Allag, just you wait! We'll cover all that lost ground before you even know it!"},{"name":"BIGGS","text":"Well said, Wedge! It'll only be a few years before we come knocking, G'raha. Then you're in for a rude awakening!"},{"name":"RAMMBROES","text":"You shall be witness to NOAH's accomplishments. Pray keep alive our successes, and forgive us our failures. And may we meet again, my friend."},{"name":"GRAHATIA","text":"The Twelve keep you till then, Rammbroes. I look forward to learning of your exploits. And you, <span class=\"highlight\">Forename</span>─I know history will remember you. No doubt your heroism will be the star by which I chart my course when I awake."},{"name":"GRAHATIA","text":"Well, now I must rest. Recalling so much has put me in the mood for sleep."},{"name":"GRAHATIA","text":"Farewell, my friends. I eagerly await a future born of your courage and the ancients' wish."},{"name":"NERO","text":"The Crystal Tower slumbers again, then. 'Tis too quiet for my taste."},{"name":"NERO","text":"Good-bye, Cid. I must put all this at my back. Possibility beckons, and I am bound to follow."},{"name":"NERO","text":"A new dawn has come for me."},{"name":"RAMMBROES","text":"You have just missed Cid, <span class=\"highlight\">Forename</span>. There is much that needs his attention if he is to fulfill G'raha's wishes, it seems."},{"name":"RAMMBROES","text":"But this is not the end of NOAH, no matter how lonely Saint Coinach's Find has become for our friends' departure."},{"name":"RAMMBROES","text":"We must all walk in different directions now. Remember that we labor for a brighter future, lit by G'raha's beacon. Sealing the Crystal Tower was but the first step."},{"name":"RAMMBROES","text":"Farewell, my friend. May our paths cross again."},{"name":"SYSTEM","text":"You have completed the Crystal Tower quest series. The next main scenario quest can be accepted by speaking with Minfilia at the Rising Stones."},{"name":"SYSTEM","text":"You have completed the Crystal Tower quest series. Rest well, champion, for the main scenario and many other adventures await you!"}],"reward":{"gil":658,"items":[{"id":9376}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66030]},"next":[66033]},"partials":[{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1011641","obj":{"i":1011641,"n":"Son Of Saint Coinach","l":67,"q":1}},{"type":"item","id":"9376","obj":{"i":9376,"n":"Allagan Catalyst","l":100,"c":27604,"t":54}},{"type":"quest","id":"66030","obj":{"i":66030,"n":"The World of Darkness","g":15,"l":"Mor Dhona","s":7,"f":1}},{"type":"quest","id":"66033","obj":{"i":66033,"n":"But I Hardly Noah","g":15,"l":"Mor Dhona","s":9,"f":1}}]}