{"quest":{"name":"The Gift of the Archmagus","location":"Mor Dhona","id":66034,"patch":2.5,"sort":10,"repeatable":1,"icon":100380,"unlocksFunction":1,"eventIcon":71342,"target":1011655,"genre":15,"journal":["Koh Rabntah─or rather, the spirit Noah who possesses her─seems keen to begin your dealings.","Noah asks you to revisit, in your mind's eye, your expeditions into the Crystal Tower, that you might record the memories in oneiromantic pearls for her viewing. She bids you speak with her again once you have filled a Pearl of the Labyrinth, a Pearl of the Tower, and a Pearl of the Darkness in the areas of the same name.<br><br>※The Labyrinth of the Ancients, Syrcus Tower, and the World of Darkness can be accessed via the Duty Finder.","You have delved deep into your memories, and recalled every step of your way through the Crystal Tower. Deliver now the three filled oneiromantic pearls to Koh Rabntah─or rather, Noah─in Revenant's Toll.","The Allagan archmagus accepts your memories gladly. Praising your efforts, she hopes that what she has given you in exchange will serve you well in your adventures to come."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon it.</span>"],"dialogue":[{"name":"KOHRABNTAH","text":"Aha! I thought an inquiring mind like yours could not resist my offer. Well, come then, produce the records of NOAH's expeditions to the Crystal Tower."},{"name":"KOHRABNTAH","text":"I seek nothing so crude as a tome, though. No, memories speak far truer than written words, my <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Kindly conjure all you have seen in the Crystal Tower within your own mind."},{"name":"KOHRABNTAH","text":"No, no, do not <span class=\"emphasis\">tell</span> me either! &lt;sigh&gt; You are clearly unfamiliar with oneiromantic pearls. These are devices capable of holding memories─an invention born of my beloved oneiromancy and some technological manipulation of the mind."},{"name":"KOHRABNTAH","text":"Now, allow your mind to drift back to all you have done with NOAH, every battle fought and comrade lost. Think hard, that I might transfer your experiences to oneiromantic pearls. I shall peruse these memories when you are done, and judge your worthiness by them."},{"name":"KOHRABNTAH","text":"My offer has brought you back yet again, eh? 'Tis lucky for you I never tire of viewing memories."},{"name":"KOHRABNTAH","text":"As before, you will need to relive your time in the labyrinth, tower, and dark realm. Remember each and every tiny detail, so I may seal the memories within oneiromantic pearls for the viewing."},{"name":"KOHRABNTAH","text":"Have you turned your mind's eye to all three places that NOAH investigated? Pray, relive every painful moment and glorious battle, and I shall see all the memories sealed within oneiromantic pearls."},{"name":"KOHRABNTAH","text":"I take it you have recalled all you accomplished with NOAH. The spirit of inquiry in me can scarce wait to see how you faced adversity in the shadow of my civilization. The pearls, if you will be so good."},{"name":"KOHRABNTAH","text":"Thank you. Well, has this fellowship of NOAH outfitted itself bravely amidst Allag's ruins? We shall see, we shall see."},{"name":"KOHRABNTAH","text":"Dear me! 'Twould seem our two ages are closely intertwined. And even now, this fellow with the Royal Eye sleeps within the Crystal Tower in hopes that it may light the future?"},{"name":"KOHRABNTAH","text":"I see. Well, beholding your exploits has certainly proven your worthiness in my eyes. I would give you this as thanks. 'Tis an article born of most ancient knowledge; I think you shall find some use for it on your adventures."},{"name":"KOHRABNTAH","text":"&lt;sigh&gt; 'Tis a pity that oneiromantic pearls offer but a single viewing, though... I always miss something the first time. So I shall make you a deal─another token of my wisdom for another look at your memories!"},{"name":"KOHRABNTAH","text":"I quite look forward to it! And in the meantime, there is much else I would see in this enchanting age. Yes, I do believe I shall inhabit Koh's body for a bit longer."},{"name":"KOHRABNTAH","text":"Your readiness to think back upon all you have done is commendable in the highest! I cannot imagine reliving every moment was pleasant; your reward shall be equal to your tribulations!"},{"name":"KOHRABNTAH","text":"Yes, you are indeed worthy of this token of my wisdom. I wish I could offer more, but I dare not lest I hurt Koh's body. So here, take this, and may it light your way to greater adventure still."}],"reward":{"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66033]}},"partials":[{"type":"npc","id":"1011655","obj":{"i":1011655,"n":"Koh Rabntah","l":67,"q":3}},{"type":"quest","id":"66033","obj":{"i":66033,"n":"But I Hardly Noah","g":15,"l":"Mor Dhona","s":9,"f":1}}]}