{"quest":{"name":"Digging for Dolls","location":"Ul'dah","id":66036,"patch":2.51,"sort":78,"repeatable":1,"icon":100388,"eventIcon":71222,"issuer":1011781,"target":1011781,"genre":198,"usedItems":[10089],"journal":["The disciplined domestic seeks assistance in acquiring the materials necessary for Nanapasi's masterwork.<br>※This quest is available for a limited time only.","As the disciplined domestic tells it, the map entrusted to you by Nanapasi will lead you to a buried stash of the age-old doll parts he requires to assemble the decorations he has promised his daughter.<br><br><span class=\"highlight\">Decipher</span> the Thorne Dynasty map to reveal the location of the parts, then acquire them and deliver them to the disciplined domestic.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The disciplined domestic rejoices at your success, assuring you that the parts that you have recovered will contribute greatly to the realization of Nanapasi's grand stage. Should the spirit of Little Ladies' Day strike you, continue to lend your aid to Nanapasi and his attendants, that the dreams of both father and daughter alike may come to fruition."],"objectives":["Deliver moth-eaten doll parts to the disciplined domestic."],"dialogue":[{"name":"MAID00500","text":"Greetings, kind adventurer. On behalf of Master Nanapasi, allow me to express my most sincere gratitude for your cooperation in this matter."},{"name":"MAID00500","text":"As you have heard from the man himself, my master seeks to assemble a modern-day recreation of the Little Ladies' Day decorations seen in the Thorne Dynasty days, as a special gift to his dear daughter Ninimo. Sadly, the task has proved a daunting one."},{"name":"MAID00500","text":"While tales of the dolls' beauty are many, actual descriptive records of the materials used and the means by which they were made are not so easily had. To further complicate things, the Thorne dolls were destroyed back when the Ul Dynasty came to power.<br>While this was doubtless done in order to sever cultural ties to the past and reinforce the Ul Dynasty's rule, it does not make our job any easier."},{"name":"MAID00500","text":"That said, all hope is not lost. It is said that among those tasked with the charge, there were those so smitten with the dolls' beauty that they simply could not bear to destroy them, instead concealing them outside of the city walls."},{"name":"MAID00500","text":"If these stories are true, then my master's dream may yet be realized. Though the remnants will be too ancient to use as they are, any parts we could obtain would go far in allowing us to properly fashion our recreation."},{"name":"MAID00500","text":"The map entrusted to you by Master Nanapasi marks the location where some dolls were said to be buried. If you could venture afield and recover whatever might yet be found, we would be forever in your debt."},{"name":"SYSTEM","text":"The doll parts sought by Master Nanapasi and his attendants can be obtained from treasure chests discovered by examining Thorne Dynasty maps."},{"name":"SYSTEM","text":"Use the action <span class=\"highlight\">Decipher</span> to extract the map and examine its contents."},{"name":"SYSTEM","text":"The action <span class=\"highlight\">Decipher</span> can be obtained by completing the quest “Treasures and Tribulations,” which can be undertaken by speaking to H'loonh in Wineport."},{"name":"SYSTEM","text":"If you are unable to learn <span class=\"highlight\">Decipher</span>, or if you are below the recommended level of 40, you are encouraged to form a party with your fellow adventurers and undertake the quest together."},{"name":"SYSTEM","text":"Thorne Dynasty maps can be obtained by completing this quest, or purchased from the capitalistic chambermaid stationed in the immediate vicinity."},{"name":"MAID00500","text":"Welcome back, adventurer. Have you come to offer us your aid once more? We would be forever in your debt for any doll parts you are able to recover."},{"name":"SYSTEM","text":"Thorne Dynasty maps can be obtained by completing this quest, or purchased from the capitalistic chambermaid stationed in the immediate vicinity."},{"name":"MAID00500","text":"Welcome back, friend. On behalf of Master Nanapasi, allow me to once again extend my most sincere gratitude for your efforts on our behalf."},{"name":"MAID00500","text":"As you know, my master intends to work with Miss Ninimo to transform the menagerie before us into a spectacle of beauty the likes of which Ul'dah has never seen! Should you be so inclined, we would welcome your continued assistance."},{"name":"MAID00500","text":"Your return heartens us, friend! Were you perchance able to recover any of the extant doll parts that we seek?"},{"name":"MAID00500","text":"Why, yes, this should serve marvelously! Master Nanapasi will be overjoyed. We are forever grateful for your service, and would be even more so if you would deign to lend us your aid again."},{"name":"SYSTEM","text":"This quest may be undertaken multiple times. The quantity of doll parts recovered in a given World will be reflected in the appearance of the doll stage, which will grow more and more extravagant over time."},{"name":"SYSTEM","text":"Join forces with your fellow adventurers, complete the quest as often as you desire, and revel in the splendor of Nanapasi's creation as it takes full form!"}],"reward":{"items":[{"id":9900},{"id":10088}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":34}],"quests":[66035]},"next":[66037]},"partials":[{"type":"npc","id":"1011781","obj":{"i":1011781,"n":"Disciplined Domestic","l":40,"q":1}},{"type":"item","id":"9900","obj":{"i":9900,"n":"Thorne Dynasty Map","l":40,"c":25940,"t":61,"p":200}},{"type":"item","id":"10088","obj":{"i":10088,"n":"Nanapasi's Happy Smile Super Wish Bag","l":1,"c":21294,"t":85}},{"type":"item","id":"10089","obj":{"i":10089,"n":"Moth-eaten Doll Parts","l":1,"c":26109,"t":85}},{"type":"quest","id":"66035","obj":{"i":66035,"n":"A Thorne-y Relationship","g":198,"l":"Ul'dah","s":77}},{"type":"quest","id":"66037","obj":{"i":66037,"n":"A Father's Folly","g":198,"l":"Ul'dah","s":79}}]}