{"quest":{"name":"Better Left Unfound","location":"Limsa Lominsa","id":66032,"patch":2.55,"sort":22,"icon":100363,"eventIcon":71221,"issuer":1009153,"target":1011652,"involved":[1006266,1006279,1006283,1006305,1011650,1011651],"genre":77,"journal":["The postmoogle's quizzical brow suggests he has an unusual delivery for you.","The deputy postmoogle has entrusted you with an anonymous missive for Landenel, captain of the Sixth Spear, in Camp Tranquil. He sends you on your way, but not before warning you of recent rumors that the good captain has been acting strange of late. Nevertheless, the deputy postmoogle bids you safe travels, that the letter makes it safely to the hands of Captain Landenel.","You deliver the letter to Landenel, who greets you with a warm smile. However, the smile does not last, for the letter bears ill news: his beloved mentor, the former leader of the Company of Heroes, has passed away, and a memorial service is to be held in his honor. In a baffling development, the service will be hosted by none other than Wheiskaet, who had but recently agreed to help Landenel search for their commander. Landenel expresses his intent to go to Costa del Sol to demand an explanation from Wheiskaet, and requests your presence at the meeting lest he do something he will later regret.","Landenel is awaiting your arrival at Costa del Sol, seemingly calm yet exasperated. To his surprise and relief, Wheiskaet can only express bewilderment as he reads the anonymous missive, claiming to have no knowledge of the commander's death nor any plans for a memorial service. Landenel is relieved to hear this news, and reaffirms his intention to resign from the Wood Wailers to search for their commander. However, Landenel's renewed fervor to abandon his duties forces Wheiskaet to reconsider the purpose of the letter. Nearly certain of the missive's writer and their intent, he refuses to assist Landenel. Now blinded by anger, Landenel readies his spear to run his former captain through. Try reasoning with him to /soothe his temper.","Your words have reached Landenel, and he sheathes his spear with reluctance. Wheiskaet is disappointed by his friend's behavior, but before he can reason with his troubled comrade, Landenel storms off in search of better prospects for aid in his search. With a heavy heart, Wheiskaet confides in you the truth of Landenel's sorrowful past, making it clear why the distraught Wood Wailer holds his leader and mentor in such high regard. Though Landenel made no mention of where he would go, Wheiskaet knows him all too well, and suspects he has gone to Wineport in search of Shamani, a former member of the Company of Heroes. Follow him to Wineport, and see if he has found the counsel he needs.","You quickly confirm Wheiskaet's suspicions, finding Landenel recounting his visit to Costa del Sol to Shamani. Landenel is convinced that Wheiskaet no longer cares for their former commander, but Shamani can only disagree with his assumptions. Considering all that has transpired, he deduces who is behind the invitation, and is disappointed to find Landenel still remains oblivious to who would be so concerned for his well-being. Shamani then reminds him of who, above all others, was there to guide him in the Company of Heroes─their leader. A mention of his old company motto calls to mind his first meeting with the commander, and a hint to his whereabouts. Follow him to Costa del Sol, and see if his intuition is on the mark.","You reach the cliff south of Costa del Sol, but find only Landenel and an abandoned spear. Though the commander is nowhere to be found, Landenel at last understands his intentions, and resolves to live up to the words of his former company. With a newfound fervor for his duties, the future looks bright as the former mercenary returns to his chosen place among the Wood Wailers."],"objectives":["Deliver the letter to Landenel at Camp Tranquil.","Speak with Landenel in Costa del Sol.","/soothe the enraged Landenel.","Speak with Landenel in Wineport.","Speak with Landenel south of Costa del Sol."],"dialogue":[{"name":"LETTERMOOGLE","text":"Ah, <span class=\"highlight\">Forename</span>! You've come not a moment too soon, kupo. I have a letter addressed to Landenel over in Camp Tranquil that wants for immediate delivery. "},{"name":"LETTERMOOGLE","text":"I hope he isn't inclined to send a reply, though, because there's no return address to be seen. But one task at a time, kupo. First of all, we─and by that I mean <span class=\"emphasis\">you</span>─must see the letter safely to Landenel's hands."},{"name":"LETTERMOOGLE","text":"I must warn you, though: rumor has it the good captain of the Sixth Spear has been acting strange of late. Perhaps this letter has something to do with it. At any rate, best not to keep him waiting. Now off you go, kupo."},{"name":"LETTERMOOGLE","text":"We may not know who wrote the message, but so long as there is a recipient, the delivery must be made. Be it joyous news or grave, the good captain will surely want to know of it, kupo."},{"name":"LANDENEL","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. It has been too long. Still gallivanting about on endless adventures, I shouldn't doubt. Ah, what I wouldn't give to be doing the same... But enough about my suppressed desires. What business brings you here?"},{"name":"LANDENEL","text":"A letter? Well, what have we here? This... This cannot be... It's an invitation from Wheiskaet to a memorial service...for the commander of the Company of Heroes!"},{"name":"LANDENEL","text":"The commander went missing some five years ago, shortly before the Calamity. As if in anticipation of his disappearance, he disbanded the company and sent us all our separate ways. It was all so sudden, we knew not what to make of it at the time."},{"name":"LANDENEL","text":"Some believed he feared for the lives that would be lost at the hands of primals. Others believe he was convinced the Calamity would mean our end, and dismissed us that we might enjoy what little time remained."},{"name":"LANDENEL","text":"His final request was that, wherever life should lead us next, we live up to the words of our company creed: “The duty of the strong is to protect the weak.”"},{"name":"LANDENEL","text":"To that end, I returned here to Gridania and joined the Wood Wailers. I've done my best to honor that promise. But if truth be told, I was never truly happy at my post. Often did I dream of fighting at my commander's side once more."},{"name":"LANDENEL","text":"...And so I have decided to resign from the Wood Wailers. Indeed, I have already made my decision known to my superior, and but await an official discharge. Once released from my post, I had intended to search for the commander with Wheiskaet, with whom I had been in contact about my plans. But now this letter arrives with talk of a memorial service!"},{"name":"LANDENEL","text":"I simply cannot believe it. There was no one stronger, more resourceful. What is more, Wheiskaet himself <span class=\"emphasis\">agreed</span> to help me find the commander. Why would he do this if he knew that the man had died?"},{"name":"LANDENEL","text":"Whatever the hells is going on, I will get to the bottom of it. I will go to Wheiskaet and demand an explanation, and depending on what he says, former comrade or no, I may well spit the bastard on my lance! You'd best be on hand when I talk to him, adventurer, lest I do something I may regret."},{"name":"LANDENEL","text":"I shall make my way to Costa del Sol as soon as the matter of my resignation is settled. Pray join me there. I shan't approach Wheiskaet until you have arrived."},{"name":"LANDENEL","text":"It should not be much longer before the matter of my resignation is resolved. I shall join you at Costa del Sol as soon as my business is finished here."},{"name":"DETOHMOSHROCA","text":"Captain Landenel has always been so calm and collected. For this letter to vex him so, I can only imagine what tragedy has befallen him."},{"name":"WHEISKAET","text":"Ah, good to see you again, <span class=\"highlight\">Forename</span>. Landenel arrived but a moment ago, and in a right foul mood. Said he has some business to discuss, and insisted on waiting for your arrival."},{"name":"LANDENEL","text":"Good, you're finally here. Now we can get down to business."},{"name":"LANDENEL","text":"You agreed to help me search for the commander, but then you send me this invitation! What is the meaning of this?"},{"name":"WHEISKAET","text":"“Captain Wheiskaet of the Company of Heroes requests the honor of your presence at the memorial service for...” ...Is this some crude joke?"},{"name":"WHEISKAET","text":"I'm sorry Landenel, but I've heard no news of the commander, let alone his passing, and I certainly have no plans of holding a service for him. I am as baffled as you are by the letter. I should like to know who penned it."},{"name":"LANDENEL","text":"I see... I'm relieved to hear that you had no part in this absurdity. A great many mysteries yet remain, to be sure, but so long as we can find the commander, I shan't bestir myself over them."},{"name":"LANDENEL","text":"I trust I can rely on your aid still, old friend? With the commander back at the helm, the Company of Heroes shall be reunited once more! And good riddance to my tedious life as a Wood Wailer!"},{"name":"WHEISKAET","text":"Hmmm... I believe I have an inkling as to the sender's identity and intent. Knowing this, I cannot in good conscience help you in your search. I'm sorry, my friend."},{"name":"LANDENEL","text":"Wh-What!? This is not what we agreed upon! The letter, the memorial service─what do they matter if we know them to be false? You said you'd help me─you can't simply go back on your word, gods damn you!"},{"name":"LANDENEL","text":"He has some nerve planning a memorial service behind my back. Magnificent bastard indeed. I have half a mind to skewer him on principle. If he should even suggest going back on his word... I'd rather not think of it."},{"name":"LANDENEL","text":"Wheiskaet, you bastard! Hells take you and your thrice-damned lies!"},{"name":"WHEISKAET","text":"&lt;sigh&gt; He did always have a quick temper... I'm sorry to impose, my friend, but could I ask you to try and <span class=\"highlight\">soothe</span> him? Right now, I am the last person in the world to whom he will listen."},{"name":"LANDENEL","text":"I know full well! Skewering Wheiskaet won't get me any closer to finding the commander, but...but..."},{"name":"WHEISKAET","text":"Look, Landenel, I understand your desire to find the commander. However, I must remind you of your promise to him. You will never live up to your word chasing after shadows of the past."},{"name":"LANDENEL","text":"My promise does not preclude me from searching for the commander. If you will not help me, I will simply find someone who will!"},{"name":"WHEISKAET","text":"It's as though he's reverted to his old savage self... I suppose I shouldn't be surprised─the commander was as a father to him."},{"name":"WHEISKAET","text":"Truth be told, Landenel's real father was a criminal, or so the story goes. Sad, really. He was just a child, and yet the townsfolk assumed the worst of him. Bore the sins of his father, you could say. His poor mother reached the end of her tether─at least that's what they said when they found her hanging from the rafters."},{"name":"WHEISKAET","text":"Landenel was not completely alone, though─he became fast friends with Ywain, now master of the Lancers' Guild in Gridania. They were nigh inseparable back then. But the townsfolk's disdain for Landenel did not cease, and he feared their ire would soon turn toward Ywain. Rather than risk the well-being of his dear friend, Landenel abandoned what little remained of his world."},{"name":"WHEISKAET","text":"Landenel was convinced the world hated him, and he returned the feeling in kind. He'd become a monster. That is, until he met the commander, and was taken in by the company. I dare not think what would have happened had they never crossed paths. It was not an easy feat to be sure, but the commander helped Landenel set aside the anger that had taken control of his life."},{"name":"WHEISKAET","text":"It was Landenel's love and respect for the commander that brought him peace. But that selfsame love may cost him everything he has achieved."},{"name":"WHEISKAET","text":"The man who wrote that letter suspected as much, and used this ruse of a memorial service to bring Landenel to me."},{"name":"WHEISKAET","text":"But I fear he's not like to understand why that letter was sent to him. I realize you were only entrusted with a simple delivery, but it would mean a lot to me if you could keep an eye on him. If he seems to be losing his way, please give him a gentle reminder of our company motto."},{"name":"WHEISKAET","text":"Knowing him, he will next go to Wineport. Whenever he was in trouble, he would always seek out Shamani for advice. Godsspeed, friend. Make sure he doesn't hurt himself, or anyone else for that matter."},{"name":"LANDENEL","text":"I refuse to give up on finding the captain. I...I just need some time to think, is all. Mayhap I should speak with Shamani. He would know what to do."},{"name":"WHEISKAET","text":"Odds are Landenel will seek Shamani's counsel. If you go to Wineport, Landenel is bound to show up before long."},{"name":"SHAMANILOHMANI","text":"I see. So you're the one who delivered the invitation."},{"name":"LANDENEL","text":"I simply do not understand, Shamani. How could Wheiskaet put aside our search like that? Does he no longer care for the commander?"},{"name":"SHAMANILOHMANI","text":"...No longer care? I must disagree. Choosing not to search for the commander and not caring for him are two rather different things."},{"name":"LANDENEL","text":"Then what of this so-called memorial service? Wheiskaet seemed willing enough to help me...but then he read the letter. Whoever sent the accursed thing wants us to give up the search."},{"name":"SHAMANILOHMANI","text":"I suspect your meeting with Wheiskaet is what the sender had intended."},{"name":"SHAMANILOHMANI","text":"Like as not, your coming here was also anticipated. From everything you've told me, it is clear the man who penned that letter cares a great deal about you. And understands you quite well to know you would come to us."},{"name":"LANDENEL","text":"Who in the seven hells would be worried about the likes of me? Wheiskaet said he suspected who delivered the missive, but I haven't the faintest idea! "},{"name":"SHAMANILOHMANI","text":"It saddens me to hear you say that. We may have gone our separate ways, but in our hearts we are still all of us brothers. Now, tell me, who of our members cared most for you? Who was always there to offer you a guiding hand?"},{"name":"LANDENEL","text":"Why, that could only be the commander..."},{"name":"SHAMANILOHMANI","text":"Precisely. And it was out of the desire to see you move forward that he sent the letter to you."},{"name":"SHAMANILOHMANI","text":"Contrary to what it seems, the commander is alive and well, and even now he watches over you. That, I believe, was the message he wished to convey."},{"name":"LANDENEL","text":"Argh! I tire of these games! If he's still alive as you say, where in the seven hells is he!?"},{"name":"Q1","text":"What will you say to the fretful Landenel?"},{"name":"A1","text":"Remember, the duty of the strong is to protect the weak."},{"name":"A1","text":"..."},{"name":"LANDENEL","text":"As if I would ever forget our company words. The commander taught them to me when I first met him. To this day, I remember that moment vividly. We were standing atop the point overlooking─"},{"name":"SHAMANILOHMANI","text":"You remember our company words, I do not doubt. But do you remember the first time you learned them?"},{"name":"LANDENEL","text":"But of course! They were practically the first words out of the commander's mouth when I first met him. To this day, I remember that moment vividly. We were standing atop the point overlooking─"},{"name":"LANDENEL","text":"&lt;gasp&gt; ...Costa del Sol! If the commander had meant to verify whether I sought out Wheiskaet after receiving his letter, that is where he would have been!"},{"name":"LANDENEL","text":"The odds are slim, I'll admit, but it's the best chance I have of finding him! I must make haste!"},{"name":"SHAMANILOHMANI","text":"I wasn't quite finished, if truth be told, but I suppose it cannot be helped. The commander meant that much to him."},{"name":"SHAMANILOHMANI","text":"From wielding a spear to living an honorable life, Landenel learned all he knows from the commander."},{"name":"SHAMANILOHMANI","text":"Naught gave Landenel greater joy than to meet the commander's expectations, and he went on to distinguish himself among our ranks."},{"name":"SHAMANILOHMANI","text":"After disbanding the company, I believe that the commander continued to watch over Landenel. And upon sensing his growing discontent, he decided to take action and sent the letter."},{"name":"SHAMANILOHMANI","text":"The road has been bumpy, but Landenel has finally arrived at the truth. But the final leg of his journey remains, and I should be grateful if you were to accompany him."},{"name":"SHAMANILOHMANI","text":"The point he mentioned rises just south of Costa del Sol. I cannot say whether he'll find what he seeks, but I have no doubt that he will find what he needs."},{"name":"LANDENEL","text":"I'll soon be off to the point south of Costa del Sol, where I first met the commander. There's a chance that he may still be near."},{"name":"WHEISKAET","text":"So Landenel has finally learned the truth... My thanks for watching over him, <span class=\"highlight\">Forename</span>. When my shift is over, I will go and check on the fellow myself."},{"name":"LANDENEL","text":"<span class=\"highlight\">Forename</span>, I might have known you would come as well. Behold, my friend─this spear belongs to the commander. Alas, the man himself is nowhere to be seen..."},{"name":"LANDENEL","text":"Why? Why does he refuse to meet me?"},{"name":"WHEISKAET","text":"Because you are not ready. And by now you ought to know the reason why."},{"name":"LANDENEL","text":"It took me long enough, but I think I'm beginning to understand now. As he would always tell us: “The duty of the strong is to protect the weak.” He wanted us to venture out into the realm and live up to those words, each in his own way."},{"name":"LANDENEL","text":"Like you, Wheiskaet. You were a mercenary of unquestionable renown─the world was yours for the taking. Yet you chose to stand as the humble protector of Costa del Sol and all who call her home."},{"name":"LANDENEL","text":"Shamani had a hand in revitalizing the Bacchus wine industry, and both U'odh and Brayflox have become leaders among their people."},{"name":"LANDENEL","text":"We serve the realm better as individuals than as a single entity. That is why the commander disbanded our company."},{"name":"LANDENEL","text":"Though I never forgot our words, I did not understand them fully until now. Instead of doing my best as a Wood Wailer, I had my head in the clouds, dreaming of a return to the glory days of old."},{"name":"WHEISKAET","text":"We did much good for the realm, aye, and had the time of our lives in the process, but it was past time for us to pass the torch. And the torch, you must agree, has been taken up by a most worthy individual."},{"name":"WHEISKAET","text":"The realm has no further need of the Company of Heroes. The commander believes thus, and I agree with his assessment. That is why I chose not to search for him."},{"name":"LANDENEL","text":"And neither shall I anymore. As you said, Wheiskaet, I am not ready─or worthy─to face the commander."},{"name":"LANDENEL","text":"Ahhh, what a fool I've been all these years. There is much to be done if I'm to make up for lost time."},{"name":"LANDENEL","text":"Commander... If you are watching, you need worry about me no longer."},{"name":"LANDENEL","text":"I will live up to our words and do you proud. This I swear."},{"name":"LANDENEL","text":"Your journeys take you far and wide, I believe. Should you happen to cross paths with the commander, please see to it that he knows my mind."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":1947,"items":[{"num":3,"id":4606,"one":1},{"num":3,"id":4608,"one":1},{"num":3,"id":5824,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1011652","obj":{"i":1011652,"n":"Landenel","l":32,"q":1}},{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"npc","id":"1006279","obj":{"i":1006279,"n":"Landenel","l":56,"q":7}},{"type":"npc","id":"1006283","obj":{"i":1006283,"n":"Detoh Moshroca","l":56,"q":2}},{"type":"npc","id":"1006305","obj":{"i":1006305,"n":"Shamani Lohmani","l":32,"q":9}},{"type":"npc","id":"1011650","obj":{"i":1011650,"n":"Landenel","l":32,"q":1}},{"type":"npc","id":"1011651","obj":{"i":1011651,"n":"Landenel","l":32,"q":1}},{"type":"item","id":"4606","obj":{"i":4606,"n":"Mega-Potion of Vitality","l":50,"c":20666,"t":44,"p":950}},{"type":"item","id":"4608","obj":{"i":4608,"n":"Mega-Potion of Mind","l":50,"c":20669,"t":44,"p":950}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}