{"quest":{"name":"The World of Darkness","location":"Mor Dhona","id":66030,"patch":2.5,"sort":7,"icon":100378,"unlocksFunction":1,"eventIcon":71341,"issuer":1006725,"target":1006725,"involved":[1007754,1007761,1007762,1007763,1011638,1011639,1011640],"genre":15,"journal":["Rammbroes has a furrowed brow and the look of one with ill tidings.","Rammbroes and G'raha have been hard at work finding a way to rescue Unei, Doga, and Nero from the World of Darkness. However, their research has revealed a more pressing problem: Emperor Xande's covenant with the voidsent known as the Cloud of Darkness remains in effect, and his orders still control the Crystal Tower. Thus, the Allagan structure continues amassing energy to open a voidgate, and unleash the Cloud upon Eorzea. Should this come to pass, all that is will be destroyed. However, even amidst such dire circumstance, there is a sliver of hope. If NOAH can retrieve Unei and Doga from the dark realm, then the tower can be halted and the covenant broken. Garlond Ironworks has labored to make a machine able to open a small rift, through which a brave band of adventurers can enter the World of Darkness. Cid arrives to inform you the preparations are nearly complete, and bids you speak with Wedge at the Eight Sentinels.","Wedge ushers you to the throne room of Syrcus Tower. In the moments before opening the rift, G'raha Tia falls into a strange mood, and tells you of a band of heroes in ancient Allag who sought to dethrone Xande. Ultimately, though, they did not succeed in stopping the emperor. History aside, Cid receives word that the Ironworks' machine is ready. With a devilish glint in his eye, the engineer orders the voidgate opened. Lights flash and power hums, and before your very eyes a rift appears. Rammbroes now lays the burden of rescuing your friends from the World of Darkness upon you. As you turn to go, G'raha Tia asks for a moment of your time. Speak with him at the Eight Sentinels to discover what is on his mind.","G'raha Tia reveals his inner struggle. Though he has learned the hue of his eye marks him as close to Allag, he does not know why. However, he feels instinctively that he must accompany you beyond the rift. You gladly accept his offer of company, and ready yourself to pass through the voidgate to rescue your three lost comrades.<br><br>※The World of Darkness can be accessed via the Duty Finder.","After vanquishing the Cloud of Darkness, you find your lost companions safe. You discover that Unei and Doga's royal blood offers them protection from the shadowy realm, and learn of their will: to stay behind and sever Xande's covenant. The Cloud of Darkness suddenly rears up around you, harrowing you. G'raha is hit...and mysteriously unharmed. Astounded, Unei proclaims that the royal blood of Allag flows in G'raha─though only through some tremendous technological feat. The two clones then tell the historian he can control the Crystal Tower, and bid you all hasten back to Eorzea. Concealing a deep sadness at the loss of friends, G'raha begins the race homewards. You and Nero follow.","After nearly losing Nero to the dark realm, you have safely returned to the Crystal Tower. Rammbroes and Cid are saddened at the loss of Unei and Doga, but they are both happy to learn that your venture into the World of Darkness was a success. G'raha now holds the royal blood of Allag in concentration great enough to control the tower and put an end to the threat it poses. However, Rammbroes realizes─with some prodding─how tiring your journey truly was. So before beginning, he bids you rest for a spell, and speak with him briefly at Saint Coinach's Find.","You have spoken with Rammbroes, who thanks you for your service to both NOAH and the realm. He concludes that the saga of the Crystal Tower is nearly finished, and that it will be but a short time before Allag's sad history may be laid to rest."],"objectives":["Speak with Wedge at the Eight Sentinels.","Speak with G'raha Tia at the Eight Sentinels.","Enter the World of Darkness.","Speak with Rammbroes at Saint Coinach's Find."],"dialogue":[{"name":"RAMMBROES","text":"Ah, <span class=\"highlight\">Forename</span>, it is good you are come. I have news you must be made aware of."},{"name":"RAMMBROES","text":"Alas, none of it bodes well for us, nor for Unei, Doga, and Nero imprisoned in the dark realm."},{"name":"GRAHATIA","text":"Think back upon our last foray into Syrcus Tower, if you will. The Calamity stirred the place from its long slumber and awoke Emperor Xande. But you, <span class=\"highlight\">Forename</span>, you ensured he was laid to rest permanently."},{"name":"GRAHATIA","text":"Yet the emperor had sealed a binding covenant with the terrible voidsent known as the Cloud of Darkness. Even as Doga and Unei labored to annul this contract, the entity reached through a rift and dragged the pair of them─and Nero─out of our realm."},{"name":"RAMMBROES","text":"Since that day, NOAH has devoted itself to rescuing Unei, Doga, and Nero from beyond the rift. Our research, however, has exposed a far more dire problem."},{"name":"RAMMBROES","text":"The Crystal Tower still acts upon Emperor Xande's orders, and collects energy to open another voidgate even as we speak. Indeed, the place nigh hums with energy."},{"name":"RAMMBROES","text":"We have done all we can to stop the imperial edict, but to no avail. Just as the gate would open only for Unei and Doga, so too will the tower heed only those with the royal blood of Allag."},{"name":"GRAHATIA","text":"'Tis a most galling design. Granted, this was not always so vexatious, according to the Allagan tomestone Nero presented us."},{"name":"GRAHATIA","text":"During the golden age of Allag, the royalty had some means of bestowing their blood upon others. If they hadn't such a technology, Amon and his underlings could never have controlled the Crystal Tower."},{"name":"RAMMBROES","text":"But we do not have either this art or any with royal blood. Every moment we wait, a vast rift through which the Cloud of Darkness can enter our realm threatens to open."},{"name":"RAMMBROES","text":"Such a disaster cannot be allowed to come to pass. We <span class=\"emphasis\">must</span> seal the Crystal Tower, and annul Xande's covenant with the dark realm."},{"name":"RAMMBROES","text":"If only breaking the latter would suffice... But then what of the energy building in the Crystal Tower? Without suppression, that power could discharge and cause a calamity like to the one that destroyed Allag."},{"name":"RAMMBROES","text":"In truth, we have more than just three lost compatriots to worry about. If we do not act, our very world will fall before the might of this threat."},{"name":"GRAHATIA","text":"We know but one way out of this predicament: rescue those who can control the tower from beyond the dark realm, and seal the rift shut after them. And mercifully, not all our news is quite so bleak."},{"name":"GRAHATIA","text":"'Tis true we cannot stop the voidgate from manifesting within the tower, but this can be to our benefit."},{"name":"GRAHATIA","text":"We can use Syrcus's power for our own purposes, and create a portal to carry us into the dark realm!"},{"name":"RAMMBROES","text":"We have heard this is possible from a man of the Thaumaturges' Guild well versed in otherworldly matters. And with Master Garlond working to create said portal, the final preparations are well underway. Ah, and here comes the man himself."},{"name":"CID","text":"<span class=\"highlight\">Forename</span>! Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> we need!"},{"name":"RAMMBROES","text":"Yes, our fellowship is indeed complete, and all parties privy to our strategy. And you, Master Garlond, how fare your endeavors?"},{"name":"CID","text":"Quite well! The device is nearly ready─though attaching the damnable thing to Syrcus Tower took every onze of ingenuity the Ironworks has got. But it should produce the energy we need."},{"name":"CID","text":"With just a little more fine-tuning, we can open a rift. I'm here to request your presence at the tower."},{"name":"CID","text":"I'll leave Biggs and Wedge at the Eight Sentinels as guides. And do hurry, <span class=\"highlight\">Forename</span>. I'm sure you wouldn't miss another chance to save the world, would you?"},{"name":"GRAHATIA","text":"Well, Cid certainly seems to have a firm hand on the helm. Shall we make our way to the Crystal Tower?"},{"name":"GRAHATIA","text":"Time is of the essence, my friend. We must go to the Eight Sentinels."},{"name":"BIGGS","text":"Has the chief filled you in on the plan, <span class=\"highlight\">Forename</span>? Opening up that voidgate will be a real feat for the Ironworks."},{"name":"BIGGS","text":"But I'm worried about what comes afterwards. I've never heard of anyone going through a rift, let alone coming back. I don't relish the idea of getting stuck there ourselves..."},{"name":"WEDGE","text":"<span class=\"highlight\">Forename</span>! I'll bet you're here to watch us pry open a rift between worlds, eh?"},{"name":"WEDGE","text":"We're almost ready. Syrcus Tower is full of engineers scurrying around and making adjustments. We're dealing with a lot of power, and if a single coupling's off... Well, <span class=\"emphasis\">boom</span>!"},{"name":"WEDGE","text":"B-But it should be fine. Really! Anyway, you'd best wait at the top. The chief's there overseeing the whole operation."},{"name":"CID","text":"My friends, you've arrived. I'm just waiting for my engineers to give the signal. Then, we'll see if we can't open a gateway to another world!"},{"name":"CID","text":"Hm? Is there something amiss, G'raha?"},{"name":"CID","text":"...Ahhh, Emperor Xande's throne─how the mighty have fallen, eh? Once, it stood as a symbol of Allag's art and power. Now, it's nothing more than an empty chair."},{"name":"CID","text":"Just imagine if Allagan civilization had lived on, and a just emperor still sat on that throne. How different would our history be, how much further would we have advanced? &lt;sigh&gt; Unfortunately, there was no stopping Xande and his ambition."},{"name":"GRAHATIA","text":"There...there were those who tried."},{"name":"GRAHATIA","text":"Xande's war of dominion left no one unscathed. Unable to abide the horrors inflicted upon the people, warriors young and brave took up the sword against Allag."},{"name":"GRAHATIA","text":"These men and women became as beacons of hope to those who had suffered─not unlike the Warriors of Light in our age."},{"name":"GRAHATIA","text":"But all this merely hastened the destruction. Just as they moved towards Allag's heart for the kill, Xande lashed out in anger and frustration...as trapped beasts are wont to do."},{"name":"GRAHATIA","text":"In his desperation, Xande desired that a great rift be opened to hasten the Cloud of Darkness's coming. To this end, he commanded the sun's power held within Dalamud be emptied into Syrcus Tower at once."},{"name":"GRAHATIA","text":"The act bore terrible consequences. The tower only withstood the blast by flooding the land below with energy. Syrcus was swallowed by the very earth upon which it once stood."},{"name":"CID","text":"The Fourth Umbral Calamity... I'd learned of its cause from Unei and Doga. I had no idea that rebellion incited Xande to rashness, though."},{"name":"CID","text":"Your knowledge of Allagan history is astounding, G'raha. Why, a man could study for two lifetimes and only learn half of what you know."},{"name":"GRAHATIA","text":"Mayhap... 'Tis strange, though─I cannot seem to remember where I learned such things..."},{"name":"CID","text":"Yes? Ah, Biggs, are you ready?"},{"name":"BIGGS","text":"Ready and raring to open up that voidgate, Chief!"},{"name":"BIGGS","text":"We reckon when this machine's up and running, she'll be able to float five airships the size of the <span class=\"emphasis\">Agrius</span>. So just give us the word, and we'll start channeling energy into the tower."},{"name":"CID","text":"Good! Then let's get started!"},{"name":"CID","text":"Our preparations are complete. Everyone, step away from the throne."},{"name":"CID","text":"All right, let's see what this machine can do. Now, Biggs!"},{"name":"RAMMBROES","text":"Ahhh, a rift to the World of Darkness, as Unei called it. Splendid work, Master Garlond!"},{"name":"CID","text":"We can't break out the mead just yet. The tough part's still ahead. We've broken into the dark realm, but the gate's not all that stable: it won't stay open forever, and only a few can use it."},{"name":"CID","text":"I, for one, will remain here to ensure the voidgate stays open."},{"name":"RAMMBROES","text":"As will the Sons of Saint Coinach. This rift is our sole path to salvation─if it closes, we are all truly lost."},{"name":"RAMMBROES","text":"Which leaves...<span class=\"highlight\">Forename</span>. My friend, 'tis a heavy burden I must task you with, but there are none more able. Pray lead the adventurers beyond the rift."},{"name":"RAMMBROES","text":"I do not know what awaits you, save the Cloud of Darkness and our three comrades. But you must go, for the fate of our world now rests upon your shoulders."},{"name":"RAMMBROES","text":"This is our only gambit, but I have every faith you will succeed."},{"name":"RAMMBROES","text":"It will be no small feat to return after you have passed beyond the rift. Make certain you are prepared before leaving."},{"name":"GRAHATIA","text":"...Might I have a moment of your time, <span class=\"highlight\">Forename</span>? There is a matter of import we must needs discuss ere you leave."},{"name":"GRAHATIA","text":"<span class=\"highlight\">Forename</span>, I wished to speak to you about my eye. As you are no doubt aware, 'tis a trait seen only amongst Allagan royalty. "},{"name":"GRAHATIA","text":"Long I have pondered why such is my inheritance. The sanguine hue must have some bearing upon my destiny─this much Doga himself admitted. But what?"},{"name":"GRAHATIA","text":"In truth, the more I learn of the Crystal Tower, the less I am myself. Somehow, meeting those two clones has wrought great change in me."},{"name":"GRAHATIA","text":"I am consumed with remembering...something. Something ancient, but ever so important."},{"name":"GRAHATIA","text":"And my father's words echo in my mind, the selfsame ones his father told him: the truth of our eye rests with Allag."},{"name":"GRAHATIA","text":"Mayhap what I wish to remember and these words are related. Mayhap not. But I know I must learn the truth that history hides from me. I would see this journey─<span class=\"emphasis\">our</span> journey─through to the very end with mine own two eyes."},{"name":"GRAHATIA","text":"So I implore you: allow me to join you beyond the rift!"},{"name":"GRAHATIA","text":"You have my thanks, my friend. Now, let us venture into the World of Darkness, to save our comrades and our realm!"},{"name":"GRAHATIA","text":"If you have prepared yourself, let us waste no time in rescuing our comrades from the darkness."},{"name":"GRAHATIA","text":"Where in the seven hells are they!? Without them to stem the energy in the tower, our defeat of the Cloud aids our cause little."},{"name":"GRAHATIA","text":"Doga! Unei! Can you hear me? Nero!"},{"name":"NERO","text":"(-???-)<span class=\"emphasis\">Must</span> you be so infernally loud!? Are you so keen to attract more voidsent?"},{"name":"NERO","text":"...Though I don't blame you for missing my company."},{"name":"GRAHATIA","text":"Thank the Twelve! Are you all right?"},{"name":"NERO","text":"As all right as can be expected. Unei has simply passed out."},{"name":"GRAHATIA","text":"Nero, by the gods... What's happened to you?"},{"name":"DOGA","text":"Alas, his wounds were too deep, and allowed this foul place entry to his body. Now, the darkness claws at the aether of his very form. Would that we could have protected him..."},{"name":"DOGA","text":"The Cloud of Darkness was bound by Xande's unholy covenant to bring prosperity to Allagan royalty. The same blood that sealed this contract gives us a measure of protection."},{"name":"DOGA","text":"I say “a measure,” for this vow does not protect us from other voidsent. The Cloud imprisoned us here precisely to unleash fiends upon us. We would be dead had Nero not defended us so valiantly."},{"name":"NERO","text":"Mistake not my actions for kindness. I have use for you yet in Eorzea, and simply couldn't let harm befall you here."},{"name":"UNEI","text":"Wh-Where...?"},{"name":"DOGA","text":"Unei! You are safe─our friends have come for us."},{"name":"UNEI","text":"H-Have they? Then perhaps, Doga, there is yet hope we may fulfill our purpose."},{"name":"CLOUDOFDARKNESS","text":"Mortals! You have dared to challenge me, and now must feel my wrath!"},{"name":"CLOUDOFDARKNESS","text":"Did you think to destroy me in <span class=\"emphasis\">my</span> realm? Here, I am eternal! I will smother your light and entomb your bones amongst my shadows!"},{"name":"GRAHATIA","text":"A-Are we truly so powerless here?"},{"name":"DOGA","text":"As long as we fight the Cloud in this realm, I fear so."},{"name":"DOGA","text":"And yet...though we may not be able to destroy it, this may be our chance to stop it. If we strike now whilst the Cloud can barely hold her form, mayhap we can sever Xande's covenant!"},{"name":"UNEI","text":"Yes, and raze the bridge between the Crystal Tower and this foul place once and for all! <span class=\"highlight\">Forename</span>, G'raha─you must flee!"},{"name":"GRAHATIA","text":"You...you and Doga mean to <span class=\"emphasis\">stay</span> here!?"},{"name":"GRAHATIA","text":"'Tis madness! You must return with us! No one but you can save the world from the threat of the Crystal Tower!"},{"name":"CLOUDOFDARKNESS","text":"What is this trickery? ...Your blood! You too gain protection from Xande's blood!"},{"name":"UNEI","text":"G'raha Tia... You <span class=\"emphasis\">are</span> possessed of royal blood! That is why the Royal Eye runs in your line!"},{"name":"UNEI","text":"'Tis a gift you have inherited. G'raha─<span class=\"emphasis\">you</span> have been granted authority over the Crystal Tower!"},{"name":"DOGA","text":"...I had thought time would consume all of Allag that was. That a man should still live with his forebears' blood in this age can be no coincidence."},{"name":"DOGA","text":"Some person must have planted this gift in your line, and used the highest of Allagan technology to do so."},{"name":"DOGA","text":"True, the Crystal Tower is not like to recognize you as Allagan, not as you are now. But your Royal Eye bespeaks a simple truth: within you dwells one feeble glitter that will illuminate all, the light of hope!"},{"name":"GRAHATIA","text":"But...how should I use this light? Pray, tell me!"},{"name":"UNEI","text":"You must gain control of the Crystal Tower. We will share our blood with you, G'raha. Though its effects will be but ephemeral, it will bolster the Allagan presence within you."},{"name":"DOGA","text":"This is our gift to you, that you may fulfill your destiny. All with the Royal Eye are bound by fate to Allag. Our part in this journey is to bury Xande's dark ambitions in the past. This was the true Unei and Doga's purpose, one we have carried into the future."},{"name":"DOGA","text":"Know that as long as this light of hope survives in you, our souls will still remain─even if our bodies are lost."},{"name":"DOGA","text":"You must leave us as well, Nero. I am sorry we could not live up to your expectations."},{"name":"UNEI","text":"I must return to you what is yours, though. You dropped it whilst defending us."},{"name":"UNEI","text":"What you seek by this instrument may not be possible, Nero. But do not give up. There are many other paths that await you."},{"name":"NERO","text":"...Of <span class=\"emphasis\">course</span> they do."},{"name":"GRAHATIA","text":"Doga, Unei, I... Thank you. We shall never forget you. Now, <span class=\"highlight\">Forename</span>, Nero, let us quit this place."},{"name":"CLOUDOFDARKNESS","text":"You shall not escape me, impudent children of light!"},{"name":"UNEI","text":"No, <span class=\"emphasis\">you</span> shall not escape <span class=\"emphasis\">us</span>.<br>Here, Xande's bloodstained dreams of glory end."},{"name":"GRAHATIA","text":"There! The glint of light!"},{"name":"GRAHATIA","text":"It...it grows faint! Then the bridge between realms grows fragile by the covenant's annulment!"},{"name":"GRAHATIA","text":"If that light dies, we are stranded here! Hurry!"},{"name":"GRAHATIA","text":"Nero, no! You must move!"},{"name":"NERO","text":"Leave me!"},{"name":"NERO","text":"I don't need you! If I die here, it'll be because I bloody well decided to!"},{"name":"NERO","text":"I failed to master darkness. I'll not suffer watching a green boy master the tower."},{"name":"NERO","text":"Do what you will with it. But remember me, <span class=\"emphasis\">son of Allag</span>!"},{"name":"NERO","text":"I am Nero tol Scaeva, the man who'll yet outdo Allag <span class=\"emphasis\">and</span> Garlond!"},{"name":"GRAHATIA","text":"<span class=\"emphasis\">That</span> was what you hoped to─"},{"name":"SALINA","text":"May the Crystal Tower...<br>again be a beacon of hope for mankind."},{"name":"NERO","text":"Go, damn you!"},{"name":"NERO","text":"&lt;cough&gt; Must move onwards... Th-This is <span class=\"emphasis\">not</span> where I come to rest!"},{"name":"NERO","text":"But how did...?<br>...So those damn clones did it, after all."},{"name":"NERO","text":"Now, onwards!"},{"name":"NERO","text":"Aaaaaaaaah!"},{"name":"CID","text":"You owe me, Nero."},{"name":"NERO","text":"The hells I do!"},{"name":"RAMMBROES","text":"You are returned unharmed, thank the gods!"},{"name":"WEDGE","text":"When that voidgate started to close... I had never felt so powerless in all my life!"},{"name":"BIGGS","text":"We were running about like madmen, trying to keep the gate open─and then the chief actually went and dived in! But if you're all sa─ Hm?"},{"name":"WEDGE","text":"Wh-Where are Unei and Doga? They're not...?"},{"name":"RAMMBROES","text":"...I see. I will miss the two of them dearly, but I am happy they fulfilled their purpose."},{"name":"RAMMBROES","text":"We who live on must still attend to the Crystal Tower...though we now have no one able to seal it."},{"name":"GRAHATIA","text":"That is not true, my friend. Unei and Doga have entrusted me with their blood. I can now control the Crystal Tower."},{"name":"RAMMBROES","text":"G'raha... Yes, I can see it in your eyes. Good. Then let us put an end to this, and seal away the tower."},{"name":"GRAHATIA","text":"I understand your instinct, Rammbroes, but please, give us a moment to rest. I am weary to the bone, and Nero and <span class=\"highlight\">Forename</span> are both emerged from long battle."},{"name":"RAMMBROES","text":"Of course, of course, you have the right of it. Come, we shall leave this place for a spell, and repair to Saint Coinach's Find."},{"name":"GRAHATIA","text":"No one but you could have succeeded in the World of Darkness, <span class=\"highlight\">Forename</span>."},{"name":"GRAHATIA","text":"Would that I could have been of more use beyond the rift. As it stands, I was but a vessel for Doga and Unei's blood..."},{"name":"GRAHATIA","text":"Hm? Have I remembered what I wished to?"},{"name":"GRAHATIA","text":"...Yes, something has come back to me. Gaining royal blood and witnessing true bravery has reminded me of my forebears' dearest wish."},{"name":"GRAHATIA","text":"But we need not speak of these things now. It was not my place to keep you. Pray go on ahead of me; there is something small I would do before I return."},{"name":"GRAHATIA","text":"I could not have asked for a better comrade. If only I could have been a part of your adventures for longer, <span class=\"highlight\">Forename</span>... Alas, fate dictates I have a different role to play."},{"name":"GRAHATIA","text":"A wish hidden for millennia, and brought to light by the good people of NOAH..."},{"name":"GRAHATIA","text":"Now, finally, 'tis my time to see it realized."},{"name":"CID","text":"Nero never would've made it back without you, <span class=\"highlight\">Forename</span>, and for that you have my thanks. I doubt he will hatch any more dastardly schemes for the present. He owes me his life, after all."},{"name":"BIGGS","text":"I'll tell you, that rift started closing up <span class=\"emphasis\">fast</span>. Waiting for you three to pop out was the tensest few moments of my life!"},{"name":"WEDGE","text":"No matter how many other clones are still out there, our Unei and Doga were special. I'm going to miss them..."},{"name":"RAMMBROES","text":"I cannot express how glad I am you returned safely, <span class=\"highlight\">Forename</span>─and with the means to dispel the threat of the Crystal Tower for good!"},{"name":"RAMMBROES","text":"Rest if you will, and then let us free ourselves from the specter of the Allagans!"}],"reward":{"gil":3752,"xp":0,"instance":30020},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67010]},"next":[66031]},"partials":[{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1007754","obj":{"i":1007754,"n":"Cid","l":67,"q":2}},{"type":"npc","id":"1007761","obj":{"i":1007761,"n":"Biggs","l":67,"q":2}},{"type":"npc","id":"1007762","obj":{"i":1007762,"n":"Wedge","l":67,"q":2}},{"type":"npc","id":"1007763","obj":{"i":1007763,"n":"G'raha Tia","l":67,"q":4}},{"type":"npc","id":"1011638","obj":{"i":1011638,"n":"Wedge","l":67,"q":1}},{"type":"npc","id":"1011639","obj":{"i":1011639,"n":"Biggs","l":67,"q":1}},{"type":"npc","id":"1011640","obj":{"i":1011640,"n":"G'raha Tia","l":67,"q":1}},{"type":"instance","id":"30020","obj":{"i":30020,"n":"The World of Darkness","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":90}},{"type":"quest","id":"67010","obj":{"i":67010,"n":"Syrcus Tower","g":15,"l":"Mor Dhona","s":6,"f":1}},{"type":"quest","id":"66031","obj":{"i":66031,"n":"The Light of Hope","g":15,"l":"Mor Dhona","s":8,"f":1}}]}