{"quest":{"name":"A Hero in the Making","location":"The Waking Sands","id":66047,"patch":2.0,"sort":106,"icon":100077,"eventIcon":71201,"issuer":1005116,"target":1005122,"involved":[1001029,1003785,1004883,1004884,1004885],"genre":1,"journal":["Minfilia is wearing a wry smile. Might it have something to do with your newfound fame?","It would seem your recent exploits have garnered the attention of all three of the Grand Companies of Eorzea. Now each one is intent upon adding you to its ranks, going so far as to send a representative to the Waking Sands to court you. Though Minfilia does not seem best pleased by this turn of events, she concedes that joining a Grand Company would yield certain benefits. But which one will you choose? That you might make an informed decision, she suggests that you attend the forthcoming remembrance services and listen to each Grand Company leader's address. Tataru will be able to furnish you with the particulars.","Tataru has apprised you as to where the remembrance services are due to be held. Visit Mih Khetto's Amphitheatre in Gridania, the Royal Promenade in Ul'dah, and finally the Stateroom in Limsa Lominsa, and hear what the Grand Company leaders have to say.","You have now attended all three of the remembrance services. Based on the words of the Grand Company leaders and the traveling twins, Alphinaud and Alisaie, it would appear that each of Eorzea's city–states is beset with problems. Clearly, all three would benefit from your aid, but which of them deserves it most? Make your way back to the Waking Sands, and share your thoughts with Minfilia.","Minfilia confirms that all three city–states are sorely in need of assistance, and laments the fact that there is only one of you. A difficult choice awaits. Weigh your decision well, and give your answer to the officer of the Grand Company you would join."],"objectives":["Speak with Tataru.","Attend the remembrance service at Mih Khetto's Amphitheatre in Gridania.","Attend the remembrance service at the Royal Promenade in Ul'dah.","Attend the remembrance service at the Stateroom in Limsa Lominsa.","Report to Minfilia at the Waking Sands."],"dialogue":[{"name":"MINFILIA","text":"Until not so very long ago, you were but one of the many adventurers seeking to make their way in Eorzea."},{"name":"MINFILIA","text":"But for your character and courage, you were raised to the esteemed post of envoy. Thereafter, you traveled the realm, aiding those in need without thought of reward, confirming to <span class=\"alternative-container\"><span class=\"alternative\">Y'shtola</span><span class=\"alternative\">Yda and Papalymo</span><span class=\"alternative\">Thancred</span></span> that the Scions would benefit from your aid. And no sooner had you joined us than you personally bested the primal Ifrit."},{"name":"MINFILIA","text":"You have achieved a great deal in a short time, and won fame in so doing. Alas, fame does not come without a price, as you will soon discover."},{"name":"MINFILIA","text":"We have guests, <span class=\"highlight\">Forename</span>─or rather...<span class=\"emphasis\">you</span> have guests."},{"name":"THREEOFFICER","text":"(-???-)Beg pardons!"},{"name":"FLAMEOFFICER","text":"Ahhh, Lady Minfilia. Radiant as always!"},{"name":"SERPENTOFFICER","text":"I am given to understand that the Scions of the Seventh Dawn have but recently welcomed a new hero into their midst! "},{"name":"STORMOFFICER","text":"I am here on behalf of the Maelstrom, Grand Company of Limsa Lominsa, to offer said hero a place of honor within our ranks!"},{"name":"MINFILIA","text":"As you can see, <span class=\"highlight\">Forename</span>, your recent exploits have garnered you the attentions of the Grand Companies of Eorzea."},{"name":"MINFILIA","text":"Each organization would have Ifrit's bane for its own. To this end, all three have sent officers to <span class=\"emphasis\">court</span> you."},{"name":"MINFILIA","text":"They would not ordinarily go to such lengths to enlist a new recruit. That they <span class=\"emphasis\">have</span> is evidence of their high regard for you."},{"name":"MINFILIA","text":"I find myself wondering how word of <span class=\"highlight\">Forename</span>'s deeds spread so quickly. That the Immortal Flames should know of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> triumph is to be expected...but what of the <span class=\"emphasis\">other</span> Grand Companies?"},{"name":"TATARU","text":"Eep!"},{"name":"SERPENTOFFICER","text":"Your reputation precedes you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! 'Tis no ordinary <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who can face a primal and emerge the victor!"},{"name":"SERPENTOFFICER","text":"And imagine our pride when we learned that you began your journey as an adventurer in our own Gridania! Know that the people hold you in high esteem, and that you will always be welcome among us."},{"name":"SERPENTOFFICER","text":"The Order of the Twin Adder has need of valiant <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> such as you. Join your strength to ours, friend, and together let us ensure that peace ever reigns over the Twelveswood!"},{"name":"FLAMEOFFICER","text":"What a pleasure it is to finally meet you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! My comrades speak of you in the most glowing terms!"},{"name":"FLAMEOFFICER","text":"Why, even before you aided us against the Amalj'aa and their dread primal, yours was already a respected name in Ul'dah. Our people know you and love you well."},{"name":"FLAMEOFFICER","text":"A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talent belongs with the Immortal Flames. Join your strength to ours, friend, and together let us secure a prosperous future for Ul'dah!"},{"name":"STORMOFFICER","text":"The Admiral was not exaggerating when she said you have the look of a hero! Full often does she speak of you, friend."},{"name":"STORMOFFICER","text":"...As do many others in Limsa. Long before the rest of Eorzea took note, your name was well known to us, owing to your valorous deeds on behalf of our citizens."},{"name":"STORMOFFICER","text":"It is only natural that we should want you for the Maelstrom. Join your strength to ours, and together let us see the grand vessel of Limsa Lominsa to the shores of glory!"},{"name":"THREEOFFICER","text":"(-Grand Company Officers-)Lady Minfilia!"},{"name":"MINFILIA","text":"&lt;sigh&gt; Very well..."},{"name":"MINFILIA","text":"Though I am quite sure you need no reminding, mayhap a brief summary of the situation would help to clarify your thoughts on this matter. As you know, the Grand Companies are all-encompassing organizations empowered to call upon the martial, economic, and technological resources of their respective city–states in times of strife."},{"name":"MINFILIA","text":"There are presently three such organizations in Eorzea: the Maelstrom of Limsa Lominsa, the Order of the Twin Adder of Gridania, and the Immortal Flames of Ul'dah."},{"name":"MINFILIA","text":"Serving a Grand Company means serving the nation to which it belongs. You will be charged with its defense, and tasked with advancing its cause."},{"name":"MINFILIA","text":"In return for your faithful service, you will be furnished with various rewards, some of which may well prove useful to you in your other endeavors."},{"name":"MINFILIA","text":"If you are agonizing over which of the Grand Companies best deserves your loyalty, be at ease─the commitment you make this day need not be permanent. Should you wish to shift your allegiance at a later date, you are entitled to do so. And yet...I concede that it is no small choice you face..."},{"name":"MINFILIA","text":"Ah! A thought occurs to me! You will, of course, recall that the three city–states are planning to hold remembrance services."},{"name":"MINFILIA","text":"Well, as part of the proceedings, I am given to understand that the leader of each Grand Company will deliver an address."},{"name":"MINFILIA","text":"Hearing these addresses ought to help you make an informed decision. What say you, my dear officers?"},{"name":"SERPENTOFFICER","text":"A fine suggestion!"},{"name":"FLAMEOFFICER","text":"You are as wise as you are beautiful, my lady!"},{"name":"STORMOFFICER","text":"Very well! Let <span class=\"highlight\">Forename</span> hear our leaders speak, then return here with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> decision."},{"name":"THREEOFFICER","text":"(-Grand Company Officers-)We eagerly await your answer!"},{"name":"MINFILIA","text":"I know full well that adventurers are by their nature a liberty-loving breed, and not best suited to the discipline of military service, but I strongly urge you to join a Grand Company nonetheless. While the promise of reward is enticing in itself, it is not the only benefit."},{"name":"MINFILIA","text":"You are possessed of great power, <span class=\"highlight\">Forename</span>, and with it you are capable of doing untold good. Yet know that great power is wont to attract attention─not all of it friendly."},{"name":"MINFILIA","text":"There will be those who wish you ill, and you must needs be on the lookout for them. Yet however vigilant you are, you are but one <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. In the midst of a Grand Company, however, you will be one <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> amongst many─a friend amongst friends. Your achievements will be shared, and so will the danger. I can think of no better arrangement."},{"name":"MINFILIA","text":"Of course, joining one organization need not mean leaving another. I hope that we can continue to rely upon your aid─the Twelve know that we will have need of it in the days ahead."},{"name":"MINFILIA","text":"The Grand Companies seek to protect their own nations. We Scions, on the other hand, seek to preserve the future of Eorzea as a whole. Similar, yet not quite the same."},{"name":"MINFILIA","text":"Now then, I expect that you will be afield more often in the future."},{"name":"MINFILIA","text":"As such, I would have you carry this linkpearl with you at all times. It will allow us to stay in touch regardless of location."},{"name":"MINFILIA","text":"Eorzea is changing, <span class=\"highlight\">Forename</span>, and you have the power to help shape it anew."},{"name":"MINFILIA","text":"None can say what the morrow will bring, but so long as we believe in ourselves, there is naught we cannot achieve."},{"name":"MINFILIA","text":"Now, it is time you made ready for your journey. Before you depart, be sure to speak to Tataru. She will apprise you as to where and when the remembrance services are due to take place."},{"name":"FLAMEOFFICER","text":"The Flame General is a passionate man, and his words never fail to light a fire in the belly of those who listen. I am sure you will be no exception!"},{"name":"SERPENTOFFICER","text":"The Elder Seedseer speaks only truth, and her words have the power to touch the soul. At the sound of her voice, all fall silent and attend her."},{"name":"STORMOFFICER","text":"When the Admiral speaks, even pirates listen, and that is no small thing. She is a born leader─the kind one would gladly follow to the seventh hell!"},{"name":"TATARU","text":"I, um... I'm sorry about all the attention you're getting, <span class=\"highlight\">Forename</span>... I might have sung your praises a little too loudly...and often...to a few too many people. Ahem. Next time, I'll be sure to hold my tongue─literally, if necessary."},{"name":"TATARU","text":"Anyway, I expect you want to know where and when the remembrance services are taking place?"},{"name":"TATARU","text":"If all goes to plan, Gridania's Grand Company, the Order of the Twin Adder, will hold the first of the three services, and Elder Seedseer Kan–E–Senna will deliver her address at Mih Khetto's Amphitheatre."},{"name":"TATARU","text":"I should probably mention at this point that due to the organizational challenges involved in assembling all of the involved parties, it's possible that the order of the services might change... Still, there's not much we can do about that, so make Gridania your first port of call."},{"name":"TATARU","text":"Next, you'll need to go to Ul'dah, where Flame General Raubahn Aldynn will be addressing the masses at the Royal Promenade. Oh, and it's rumored there's to be a special guest! How exciting."},{"name":"TATARU","text":"Last but not least, you must make your way to the Stateroom in Limsa Lominsa, where Maelstrom Chief Admiral Merlwyb Bloefhiswyn will be giving her address."},{"name":"TATARU","text":"The room is accessible via the Admiral's Lift. Identify yourself to the sentry, Zanthael, and he will admit you. Got all that?"},{"name":"TATARU","text":"Well, off you go, then. I hope you find the remembrance services suitably educational! I suggest visiting the city–states in my prescribed order, though with your record of <span class=\"emphasis\">impeccable</span> timing and luck, the schedule may well change in favor of your preferred travel plans. Farewell!"},{"name":"CLATTERM","text":"Behold, it is the Sultana Nanamo herself!"},{"name":"CLATTERF","text":"And Raubahn as well!"},{"name":"RAUBAHN","text":"Hark you, souls of flame, drawn to the bosom of the desert, where the fire burns brightest and shall rage forevermore!"},{"name":"CLATTERM","text":"HURRAH!"},{"name":"CLATTERM","text":"RAUBAHN!"},{"name":"RAUBAHN","text":"Where since antiquity, under the sage and judicious rule of the Ul Dynasty, we have wrought sand into gold!"},{"name":"RAUBAHN","text":"Where by the Grace and Glory of Nald'thal have our brave sons and daughters flourished and prospered─I speak of Ul'dah!"},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)There, at the Flame General's back flies the Grand Company's standard."},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)Note the sigil. The golden scales of order balance the jewel of prosperity with the flame of might."},{"name":"RAUBAHN","text":"Great and many are the gifts our nation has given the realm."},{"name":"RAUBAHN","text":"In Eorzea's darkest hour, on the killing fields of Carteneau, none spent more in blood and gold than we."},{"name":"RAUBAHN","text":"Thus was the VIIth Imperial Legion laid low!"},{"name":"CLATTERM","text":"Raaah!"},{"name":"CLATTERM","text":"Yaaah!"},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)So <span class=\"emphasis\">that's</span> how it happened! How soon history forgets."},{"name":"RAUBAHN","text":"Yet many left our gates, never to return."},{"name":"RAUBAHN","text":"Let us pray for our absent brothers and sisters, that they might know happiness in the great beyond, as Thal's honored guests."},{"name":"RAUBAHN","text":"If the fates were fair, the price we paid that day would have bought us victory. Alas, they are not."},{"name":"RAUBAHN","text":"And now, but five years into this Seventh Umbral Era, the spirit of sacrifice which granted us our strength is all but dead."},{"name":"RAUBAHN","text":"Look around you. What do you see? A people divided, downtrodden and enthralled!"},{"name":"RAUBAHN","text":"Where are the merciful alms of the rich? Where is the just steel of the righteous?"},{"name":"CLATTERM","text":"That's not really fair..."},{"name":"CLATTERF","text":"It is as he says."},{"name":"RAUBAHN","text":"I ask you: is this the great nation our brothers and sisters gave their lives to save?"},{"name":"RAUBAHN","text":"You who call this “living” dishonor the name of the Immortal Flames─it is but a slow death!"},{"name":"RAUBAHN","text":"Our enemies surround us. The savage hordes of the Amalj'aa wait beside our roads, strangling the lifelines of trade."},{"name":"RAUBAHN","text":"Meanwhile, the Garleans make mock of our borders, and despoil our land of its natural wealth."},{"name":"RAUBAHN","text":"We stand on a precipice...yet we do not act."},{"name":"RAUBAHN","text":"Whether trader or soldier, Monetarist or Royalist, all must recognize that a divided Ul'dah stands to fall."},{"name":"RAUBAHN","text":"Victory and Fortune walk hand in hand!"},{"name":"RAUBAHN","text":"Ye who seek glory and wealth! Look not to what little you can snatch from your neighbor, but to the boundless wealth of the world beyond!"},{"name":"RAUBAHN","text":"Now is the time to unite! Now is the time to ride forth!"},{"name":"RAUBAHN","text":"In the name of the sultana, I beseech you!"},{"name":"RAUBAHN","text":"Line not your own coffers, but those of the Immortal Flames! Seek not to prosper from Ul'dah, but to restore her to prosperity!"},{"name":"RAUBAHN","text":"As the realm prospers, so shall Ul'dah. As Ul'dah prospers, so shall her people!"},{"name":"CLATTERM","text":"Yah! For Ul'dah!"},{"name":"CLATTERF","text":"Together we are one!"},{"name":"RAUBAHN","text":"Your Grace."},{"name":"NANAMOULNAMO","text":"Raubahn."},{"name":"NANAMOULNAMO","text":"People of Ul'dah! I, Nanamo, seventeenth in the line of Ul, address you."},{"name":"NANAMOULNAMO","text":"Much has been made of the wealth of Ul'dah."},{"name":"NANAMOULNAMO","text":"Yet those who measure that wealth in coins and carats are gravely deceived."},{"name":"NANAMOULNAMO","text":"For the true wealth of Ul'dah lies in the health, happiness, and hopes of her people."},{"name":"NANAMOULNAMO","text":"Beloved subjects, I bid you raise aloft the torch of Ul'dah, that her Flames might serve as a beacon for all Eorzea to see!"},{"name":"CLATTERM","text":"Long live Nanamo!"},{"name":"CLATTERM","text":"Glory to the sultana!"},{"name":"RAUBAHN","text":"For Victory and Fortune, stride fearless into the inferno, for we are by fire reborn!"},{"name":"CLATTERM","text":"Forsooth!"},{"name":"CLATTERM","text":"The time is now!"},{"name":"CLATTERM","text":"I believe!"},{"name":"ALPHINAUD","text":"If you'll permit me. Alphinaud."},{"name":"ALPHINAUD","text":"...And my sister, Alisaie, at your service."},{"name":"ALPHINAUD","text":"I saw at a glance that you were a fellow traveler."},{"name":"ALPHINAUD","text":"You might call us students of history, sampling the realm's remembrances in pursuit of...enlightenment."},{"name":"ALPHINAUD","text":"Fancy meeting you again."},{"name":"ALPHINAUD","text":"The Ul'dahns have a long history of conflict with the Amalj'aa, the beast tribe that worships the primal Ifrit."},{"name":"ALPHINAUD","text":"Judging by your look of distaste, I take it you have encountered them."},{"name":"ALPHINAUD","text":"The Ul'dahns do not shy from confrontation. If aught threatens their precious prosperity, they <span class=\"emphasis\">will</span> seek to crush it."},{"name":"ALPHINAUD","text":"So have they dealt with Ifrit thus far, smothering his flames each time he is stoked to life."},{"name":"ALPHINAUD","text":"Yet he is but one of several problems. Though they have been quiet these past five years, the Garleans have not gone away."},{"name":"ALPHINAUD","text":"Meanwhile, refugees continue to arrive in droves, and Ul'dah has no clear policy on how to deal with them."},{"name":"ALPHINAUD","text":"After all, not even the sultanate's coffers are bottomless. And even assuming they had the coin, resources will ever be finite."},{"name":"ALPHINAUD","text":"Which brings me back to the subject of Ifrit. It has been observed that the Amalj'aa are summoning him with ever-increasing frequency."},{"name":"ALPHINAUD","text":"Every time they do so, the Ul'dahns send their forces to smite the primal, and though they invariably succeed, each victory is bought with blood. It is a war of attrition which they cannot well sustain."},{"name":"ALPHINAUD","text":"Small wonder, then, that the Immortal Flames are eager to recruit more members."},{"name":"ALPHINAUD","text":"At such a desperate hour, an adventurer of your experience would be a most welcome addition to their ranks."},{"name":"ALPHINAUD","text":"For their sake, I hope that the Flame General's words struck a chord with you."},{"name":"CLATTERM","text":"I lost my son to the Calamity..."},{"name":"CLATTERM","text":"Some say you couldn't take a step without stumbling over a body."},{"name":"CLATTERF","text":"The three Seedseers are all together!"},{"name":"KANESENNA","text":"Our forebears were once strangers in the Twelveswood."},{"name":"KANESENNA","text":"Fearful of the greenwrath, they hid themselves in the dark recesses of the earth. Yet they dreamed of basking in the dappled sunlight of the forest."},{"name":"KANESENNA","text":"Through great effort, they proved their worth to the elementals, and were granted a place beneath the boughs. So it was that Gridania was born, some five centuries ago."},{"name":"KANESENNA","text":"Working hand in hand, the Hyur and the Elezen settlers sowed the seeds of our civilization. And soon they were joined by folk of all races."},{"name":"KANESENNA","text":"So nourished by the waters of unity and blessed by the light of the Matron, Gridania flourished into the great nation it is today."},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)Do you see the Gridanian standard? There, hanging behind the Elder Seedseer."},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)The entwined serpents represent the unity between Hyur and Elezen. An elegant symbol, do you not agree?"},{"name":"KANESENNA","text":"In accordance with the will of the elementals, we have embraced a life of peace. Alas, our neighbors have not always sought the same for themselves─nor for us."},{"name":"KANESENNA","text":"Though we Gridanians have no love for war, we have still less for those who would threaten our way of life. Ever have we fought to protect the sanctity of the Twelveswood."},{"name":"KANESENNA","text":"When the Garlean Empire brought its war of conquest to Eorzea, we rallied under the noble standard of the Twin Adder, that we might push back the encroaching darkness."},{"name":"KANESENNA","text":"And it was we who prepared the ground for the reformation of the Eorzean Alliance, that all the peoples of this realm might stand united against the common threat."},{"name":"KANESENNA","text":"Five years ago, the Alliance met the armies of the Empire upon the fields of Carteneau."},{"name":"KANESENNA","text":"It would prove the bloodiest battle in recent memory. Countless Gridanian lives were lost."},{"name":"KANESENNA","text":"As supreme commander of the Order of the Twin Adder, ever shall I bear the weight of our people's sacrifice."},{"name":"KANESENNA","text":"Alas, their loss was not the only tragedy to befall us that day, for soon came the Calamity."},{"name":"KANESENNA","text":"The scars borne by our forest are a constant reminder of its violence. Our lives have been irrevocably changed, each waking hour a struggle to survive."},{"name":"KANESENNA","text":"Driven to desperation, some among us have strayed from the path of righteousness, resorting to banditry, poaching, and other unconscionable deeds."},{"name":"KANESENNA","text":"To compound our woes, the Ixal have returned in force, emboldened by our suffering. They test our defenses nigh without cease, and prey upon the vulnerable."},{"name":"KANESENNA","text":"So beleaguered from within and without, it is of little wonder that our unity now falters. Dark times are upon us."},{"name":"CLATTERM","text":"Time was a man could walk the highroads without fear."},{"name":"CLATTERM","text":"A pox on the bloody Ixal!"},{"name":"KANESENNA","text":"On this day, five years ago, countless Eorzeans laid down their lives that we might behold another dawn. Please join with me in honoring their memory."},{"name":"ALISAIE","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Cynical Girl</span><span class=\"alternative\">Alisaie</span></span>-)And how do you propose to honor the memory of those you cannot remember, pray tell?"},{"name":"KANESENNA","text":"The destruction wrought by the Calamity was indiscriminate─it dealt death to Eorzean and Garlean alike."},{"name":"KANESENNA","text":"Yet while we have labored to rebuild our homes─to rebuild our lives─the Empire has set about raising steel fortresses here in the Twelveswood."},{"name":"KANESENNA","text":"Let none be mistaken─the Garleans remain the greatest threat to our survival. If we are to stand against them, we must remember what it is to be united."},{"name":"KANESENNA","text":"Our many troubles blind us to the woes of our fellow man. Thence is harmony lost. Yet harmony is the founding principle of Gridania."},{"name":"KANESENNA","text":"We are gathered here to honor the fallen."},{"name":"KANESENNA","text":"Let them be honored not only in word and thought, but through concerted action!"},{"name":"KANESENNA","text":"I bid you join hands with me once more beneath the Twin Adder standard!"},{"name":"KANESENNA","text":"And together, let us heal the forest's wounds, that our progeny might live in harmony beneath these ancient boughs. For serenity, purity, and sanctity!"},{"name":"CLATTERF","text":"We must think of the children!"},{"name":"CLATTERM","text":"Wood's Will Be Done!"},{"name":"CLATTERM","text":"It's up to us to protect the forest!"},{"name":"CLATTERM","text":"For the elementals!"},{"name":"ALPHINAUD","text":"If you'll permit me. Alphinaud."},{"name":"ALPHINAUD","text":"...And my sister, Alisaie, at your service."},{"name":"ALPHINAUD","text":"I saw at a glance that you were a fellow traveler."},{"name":"ALPHINAUD","text":"You might call us students of history, sampling the realm's remembrances in pursuit of...enlightenment."},{"name":"ALPHINAUD","text":"Fancy meeting you again."},{"name":"ALPHINAUD","text":"The Gridanians are unfortunate enough to have to contend with two beast tribes."},{"name":"ALPHINAUD","text":"The Ixal are unquestionably the more troublesome, being of a naturally warlike disposition, and wont to summon their bloodthirsty primal, Garuda."},{"name":"ALPHINAUD","text":"The sylphs, by contrast, are peaceful in nature, being mischievous rather than malevolent, and have long been on friendly terms with the Gridanians─until recently, at least. Alas, they have grown aloof, a change observed at roughly the time they summoned the primal Ramuh."},{"name":"ALPHINAUD","text":"The Gridanians have no love for war, and they consider open conflict a last resort."},{"name":"ALPHINAUD","text":"Though they clash with the Ixal ever more regularly, you may be assured that they do so in self-defense. As for the sylphs...they are as yet bound by a peace treaty, though one wonders how long it will be before it is broken."},{"name":"ALPHINAUD","text":"The Twelveswood was grievously wounded during the Calamity, leaving Gridania vulnerable to attack. The people are hopeful that restoring the wood─and thereby the power of the elementals─will put an end to their woes. Yet how long will that take? <span class=\"emphasis\">Centuries</span>, I'd wager."},{"name":"ALPHINAUD","text":"Meanwhile, the Ixal will continue their incursions, spurred on by Garuda and her insatiable appetite for destruction."},{"name":"ALPHINAUD","text":"Whether the Gridanians like it or not, sooner or later it will come to all-out war. And when it does, the Order of the Twin Adder will need all the help it can muster."},{"name":"ALPHINAUD","text":"...How valuable might the aid of a capable adventurer prove to them then?"},{"name":"ALPHINAUD","text":"Well, perhaps we will find out─if the Elder Seedseer's words fell on fertile ground..."},{"name":"ZANTHAEL","text":"Here to attend the remembrance service? Be quick─the Admiral is due to give her address at any moment."},{"name":"Q1","text":"Proceed to the Stateroom?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"ZANTHAEL","text":"If you're not interested in attending, make way for those who are."},{"name":"CLATTERM","text":"The Garleans are another matter altogether."},{"name":"CLATTERF","text":"So much for our alliance."},{"name":"CLATTERM","text":"It's sunk beyond the seabed."},{"name":"MERLWYB","text":"Brothers and sisters of the sea, hearken unto me! Look upon this, our mighty crimson standard, and tell me your hearts do not swell with pride!"},{"name":"CLATTERM","text":"Yaaaaaargh!"},{"name":"MERLWYB","text":"Seven hundred summers have come and gone since our forefathers first ran aground in this fertile bay."},{"name":"MERLWYB","text":"In that time, guided by the Mother of Oceans, Limsa Lominsa has grown from humble fishing village to uncontested ruler of the five seas and beyond!"},{"name":"CLATTERM","text":"Huzzah!"},{"name":"CLATTERM","text":"Raaaaaarrr!"},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)Did you look, as the Admiral bid you? It <span class=\"emphasis\">is</span> a rather stirring standard, I must say."},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)The crimson field is meant to signify the blood of fallen crewmates, while the black longship represents a pirate vessel."},{"name":"MERLWYB","text":"When the Garlean Empire marched upon Eorzea, we assembled beneath the Maelstrom's standard, and our Grand Company was reborn."},{"name":"MERLWYB","text":"All answered the call, from the Knights of the Barracuda to Hyllfyr's Bloody Executioners, and together we met our would-be conquerors upon the field of Carteneau."},{"name":"MERLWYB","text":"That day, the world bore witness to the united strength of Limsa Lominsa!"},{"name":"MERLWYB","text":"I swear to you─no army ever fought harder, or with more courage. Yet many of ours did not survive."},{"name":"MERLWYB","text":"Join me now in remembering those who fought in the name of freedom, and fell. May their souls be returned to the sea."},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)Freedom... Yes, they have always been rather fond of their freedom."},{"name":"ALPHINAUD","text":"(-<span class=\"alternative-container\"><span class=\"alternative\">Self-assured Youth</span><span class=\"alternative\">Alphinaud</span></span>-)Much as the beast tribes have. Small wonder─beneath the surface, one would struggle to tell them apart."},{"name":"MERLWYB","text":"It has been five long years since the Calamity struck. Five long years of tireless rebuilding."},{"name":"MERLWYB","text":"Yet still the wounds of the Calamity fester and weep."},{"name":"MERLWYB","text":"But when I stand atop the Mizzenmast, and gaze out upon our battered and broken vessel, I see an undying spirit. Did we not build all this from the wreck of the <span class=\"emphasis\">Galadion</span> all those centuries ago? Shall we not do so again!?"},{"name":"MERLWYB","text":"Yet there are those who would see this ship of ours sink beneath the waves of the restless Rhotano."},{"name":"MERLWYB","text":"The Sahagin creep ashore seeking blood for their accursed god."},{"name":"CLATTERM","text":"Those fishback bastards..."},{"name":"CLATTERF","text":"The Sahagin have risen?"},{"name":"MERLWYB","text":"While the mines of O'Ghomoro spew forth kobolds who push ever south, despoiling our lands as they go."},{"name":"MERLWYB","text":"These savage beast tribes will be the first waves to crash against our creaking hull."},{"name":"MERLWYB","text":"And behind them swells the grim tide of the Garlean Empire."},{"name":"MERLWYB","text":"Even now, the curs fly their flags within our borders. Doubt not but that they will be upon us ere long."},{"name":"MERLWYB","text":"We are well-nigh surrounded. Yet there are those among us who would rather turn their swords against their crewmates than our cannons against our foes."},{"name":"MERLWYB","text":"How can we hope to repel our many enemies when mutiny breeds below deck?"},{"name":"MERLWYB","text":"There is but one course left to us!"},{"name":"MERLWYB","text":"One bearing that will bring us victory over the beast hordes and the Empire both, and see this ship safe to port."},{"name":"MERLWYB","text":"We must mend the rift the Calamity has reopened 'twixt pirate and Maelstrom, and stand fast with our adventurer brothers against the coming tempest!"},{"name":"MERLWYB","text":"Mark ye well: a crew without unity is no crew at all─'tis but a mass of drowned men."},{"name":"MERLWYB","text":"To me, then, brothers and sisters of the sea! Gather beneath the undying crimson standard and pledge me your strength, your skill, your wisdom!"},{"name":"MERLWYB","text":"And with the guidance of the Navigator, this great vessel of ours shall ride the waves till sea swallows all!"},{"name":"CLATTERM","text":"Long live the Admiral!"},{"name":"CLATTERM","text":"Admiral Merlwyb!"},{"name":"CLATTERF","text":"Gather the lads!"},{"name":"CLATTERM","text":"Where's me cutlass!?"},{"name":"CLATTERM","text":"I'll follow ye to the seven hells, Admiral!"},{"name":"ALPHINAUD","text":"If you'll permit me. Alphinaud."},{"name":"ALPHINAUD","text":"...And my sister, Alisaie, at your service."},{"name":"ALPHINAUD","text":"I saw at a glance that you were a fellow traveler."},{"name":"ALPHINAUD","text":"You might call us students of history, sampling the realm's remembrances in pursuit of...enlightenment."},{"name":"ALPHINAUD","text":"Fancy meeting you again."},{"name":"ALPHINAUD","text":"As the Admiral mentioned in her address, Limsa Lominsa is plagued by two beast tribes."},{"name":"ALPHINAUD","text":"The first are the fishlike Sahagin, worshipers of the primal Leviathan."},{"name":"ALPHINAUD","text":"The second are the kobolds, who dwell beneath the earth, and take the primal Titan for their god."},{"name":"ALPHINAUD","text":"As if the beast tribes' presence weren't troublesome enough, the Garleans have also chosen to erect a fortress right in the Lominsans' backyard."},{"name":"ALPHINAUD","text":"And that is to say naught of internal strife. As a nation of pirates, there is no end to the blood feuds between the various factions. And while they fight amongst themselves, the Garleans whet their blades and watch."},{"name":"ALPHINAUD","text":"If the Lominsans are to have any hope of withstanding the Empire, they must first resolve their own affairs. Differences must be set aside, and the primal threat dealt with once and for all."},{"name":"ALPHINAUD","text":"To this end, I expect that they will soon take decisive action against the beast tribes. Mark my words, the Maelstrom standard will be drenched a deeper shade of crimson ere long."},{"name":"ALPHINAUD","text":"That a capable adventurer like you would be a valuable addition to their crew is beyond question."},{"name":"ALPHINAUD","text":"But will you sail with the Admiral?"},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>, this is Minfilia. You are well, I hope? Would I be correct in thinking that the final remembrance service has now concluded?"},{"name":"MINFILIA","text":"A moment ago, you say? What a coincidence!"},{"name":"MINFILIA","text":"Jesting aside, I trust you remember our guests from the Grand Companies? Well, <span class=\"emphasis\">delighted</span> though we are to have them here at the Waking Sands, it would not do to keep them in suspense any longer than necessary. In short: hurry back!"},{"name":"MINFILIA","text":"Welcome back, <span class=\"highlight\">Forename</span>. Were the Grand Company leaders' words as illuminating as you had hoped?"},{"name":"MINFILIA","text":"Aye, each nation is beset with problems. I trust you see now why your services are in such demand. Would that there were more of you, <span class=\"highlight\">Forename</span>."},{"name":"MINFILIA","text":"But you must be tired from your journey. Why don't you rest awhile, and take a moment to reflect on your decision? Once your mind is made up, pray give the Grand Company officers your answer."},{"name":"ALPHINAUD","text":"The gods only know what “grand” company our adventurer friend will keep."},{"name":"ALPHINAUD","text":"Hmph. The wheels of change are in motion regardless."},{"name":"ALISAIE","text":"Brother, are you certain this course is best?"},{"name":"ALPHINAUD","text":"Whatever do you mean, dear sister?"},{"name":"ALISAIE","text":"The so-called “remembrance” ceremonies were little more than standard-waving rallies."},{"name":"ALISAIE","text":"...As though the Calamity and Seventh Umbral Era warranted scarcely a mention!"},{"name":"ALPHINAUD","text":"Well, of course they were “standard-waving rallies.”"},{"name":"ALPHINAUD","text":"Since you are so observant, mayhap you noticed what mention was made of the Warriors of Light? <span class=\"emphasis\">None</span>."},{"name":"ALPHINAUD","text":"I suppose they must have forgotten the heroes who spared Eorzea a fate worse than the Calamity?"},{"name":"ALPHINAUD","text":"No, dear Alisaie, they haven't “forgotten” these details. They have elected to omit them."},{"name":"ALPHINAUD","text":"Deep are the wounds the Calamity inflicted upon Eorzea. So deep, in fact, that the realm still bleeds."},{"name":"ALPHINAUD","text":"Needless to say, the beast tribes and their primals do little to alleviate the pain."},{"name":"ALPHINAUD","text":"So the task of salving Eorzea's wounds falls to the Scions of the Seventh Dawn─with a little help from our friends the Grand Companies."},{"name":"ALPHINAUD","text":"Remembrance will yield no remedy. If our world is to heal, we must put the horrors of the Calamity behind us."},{"name":"ALISAIE","text":"Our grandfather would never entrust the fate of the realm to despots who rewrite history to their convenience!"},{"name":"ALISAIE","text":"There must be another way to cure what ails this world─and I mean to find it!"},{"name":"ALPHINAUD","text":"You are most welcome to try. Our paths may differ, but our destination is the same. In time, I daresay we will see eye to eye."},{"name":"ALISAIE","text":"I should hope so."},{"name":"BODYGUARDA","text":"M-M'lady!"},{"name":"BODYGUARDB","text":"We are to escort you!"},{"name":"ALPHINAUD","text":"Hope does not come into it. We share the burden of this fate, dear sister, and will prevail together or not at all."},{"name":"ALPHINAUD","text":"The salve will serve not only to close up our present wounds..."},{"name":"ALPHINAUD","text":"...but prevent old ones from opening anew."}],"reward":{"gil":968,"xp":8120},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[65879]},"next":[66216,66217,66218]},"partials":[{"type":"npc","id":"1005116","obj":{"i":1005116,"n":"Minfilia","l":356,"q":4}},{"type":"npc","id":"1005122","obj":{"i":1005122,"n":"Minfilia","l":356,"q":1}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1003785","obj":{"i":1003785,"n":"Tataru","l":42,"q":5}},{"type":"npc","id":"1004883","obj":{"i":1004883,"n":"Flame Officer","l":356,"q":4}},{"type":"npc","id":"1004884","obj":{"i":1004884,"n":"Serpent Officer","l":356,"q":4}},{"type":"npc","id":"1004885","obj":{"i":1004885,"n":"Storm Officer","l":356,"q":4}},{"type":"quest","id":"65879","obj":{"i":65879,"n":"Lord of the Inferno","g":1,"l":"The Waking Sands","s":105}},{"type":"quest","id":"66216","obj":{"i":66216,"n":"The Company You Keep (Twin Adder)","g":1,"l":"The Waking Sands","s":107}},{"type":"quest","id":"66217","obj":{"i":66217,"n":"The Company You Keep (Maelstrom)","g":1,"l":"The Waking Sands","s":108}},{"type":"quest","id":"66218","obj":{"i":66218,"n":"The Company You Keep (Immortal Flames)","g":1,"l":"The Waking Sands","s":109}}]}