{"quest":{"name":"Where Did Our Loves Go","location":"Gridania","id":66048,"patch":2.5,"sort":72,"icon":100382,"eventIcon":71221,"issuer":1011731,"target":1011732,"genre":196,"journal":["Lisette de Valentione seeks the assistance of an experienced adventurer in her labors of love.<br>※This quest is available for a limited time only.","Lisette de Valentione and her band of loyal retainers have once again journeyed from Ishgard to bring the passionate spirit of their noble house's motto─<span class=\"emphasis\">ardor and affection</span>─to all Eorzea. However, in their efforts to aid those Eorzeans unable to confess their love in person, the party has met with an unforeseen obstacle that only an experienced adventurer can overcome. Lisette bids you speak with Hortefense, the man spearheading the mission, to learn more.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Hortefense explains how he and his emissaries have been tasked with delivering tokens of love in petitioners' steads. However, while the service was intended to aid those shackled by shyness, they have received requests from another, unexpected source: those who would gladly present their gifts directly, if only they knew where their loved ones were. Hortefense has pledged to locate these absent sweethearts, but as a stranger to these lands, he has thus far met with little success. Hence does he seek the assistance of learned adventurers to find these missing men, and ensure that no love goes unspoken this Valentione's Day."],"objectives":["Speak with Hortefense."],"dialogue":[{"name":"LISSETE","text":"Well, well, what have we here? Another adventurer come to bask in my splendor? I am Lady Lisette of House Valentione, but should you be willing and able enough to serve as my retainer, I give you leave to call me Lissie!♪"},{"name":"LISSETE","text":"Ah, but I know you! The fashions may change, but I could never forget the name that goes with <span class=\"emphasis\">that</span> face. How glad am I to see you again, <span class=\"highlight\">Forename</span>, and on this day more than any!"},{"name":"LISSETE","text":"Tell me, my dear: might I tempt you into lending yourself to our cause? We need all the bodies we can claim, and most gladly would I lay my hands on yours. A <span class=\"alternative-container\"><span class=\"alternative\">spirited girl</span><span class=\"alternative\">strapping chap</span></span> such as yourself would make a fine bedfellow!"},{"name":"LISSETE","text":"For today is Valentione's Day, and once again we of House Valentione come bearing a simple message: ardor and affection for all! Such is the solemn vow of our house, ever since the days of my uncountably great grandmother, the Countess Arabelle, who braved every hardship in a lifelong quest for love!"},{"name":"LISSETE","text":"So it is that we too have journeyed from our homeland to herald her heroic message. For too long have Eorzean hearts been stifled by the miasmata of apathy and abashment. Ours shall be the wind that dispels these poisonous fogs, and sweeps every shrinking violet into the arms of their beloved!"},{"name":"LISSETE","text":"Or at least, so was the plan. We sought to lend our strength to those unable to confess their feelings in person, yet it seems there are some whose inability stems not from diffidence, but from ignorance. And honestly, how do they expect our arrows of love to find their target, when they themselves cannot?"},{"name":"LISSETE","text":"Thus do we seek the assistance of worldly–wise adventurers in the aid of these helpless souls. If you consider yourself a fair match for the task, then go to my man Hortefense─he will tell you more of our predicament. Oh, and don't forget to tell him that Lissie sent you!♪"},{"name":"LISSETE","text":"Do not dally here all <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>, <span class=\"highlight\">Forename</span>─there is work to be done! If you have a heart to aid those who suffer without, then speak with my man Hortefense. Oh, and don't forget to tell him that Lissie sent you!♪"},{"name":"HORTEFENSE","text":"Happy Valentione's Day, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>! ...You say that a “Lissie” sent you? There must be some mistake─I know no one by that name. Unless─dare I dream?─I have a secret admirer!? Tell me, adventurer: does the lady send a note? Chocolate? A ring, perhaps?"},{"name":"HORTEFENSE","text":"Oh ho ho! So it was Lady <span class=\"emphasis\">Lisette</span> who sent you! Pray pardon my misunderstanding. I am most grateful for any assistance you can offer. As my lady informed you, we have run into something of an impasse in our efforts to ensure that no love remains unspoken across Eorzea."},{"name":"HORTEFENSE","text":"Allow me to explain: every year, a delegation led by House Valentione departs from Ishgard to travel the length and breadth of Eorzea, urging the people to air their passions─to confess their true feelings to their beloved with a word of affection, or a sentimental gift of some kind."},{"name":"HORTEFENSE","text":"Yet there are some who struggle to do such a simple thing, their hearts silenced by shyness. It is to these poor souls that I and my emissaries have come to offer our services. We lubricate the wheels of love, so to speak, by delivering heartfelt missives on a timid suitor's behalf."},{"name":"HORTEFENSE","text":"However, there are some who have sought out our services for another reason: they lack not the confidence to confess their love, but merely the knowledge of where their loved ones are. Sworn as we are to bring succor to every pining soul, we have pledged ourselves to their cause."},{"name":"HORTEFENSE","text":"Yet I fear we Ishgardians have been cloistered in our own lands too long to be of any use in tracking these missing sweethearts down. We lack the knowledge of Eorzean geography that would allow us to deduce their locations from the scant clues the petitioners can provide."},{"name":"HORTEFENSE","text":"Which is precisely where you come in. No doubt you have traveled much in your adventures, and have a better idea as to the lay of the land. And if Lady Lisette herself recommends you, who am I to disagree? With you aboard, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>, none shall go unloved this day!"}],"reward":{"gil":286,"items":[{"num":6,"id":7569}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66051,66059,66063]},"partials":[{"type":"npc","id":"1011731","obj":{"i":1011731,"n":"Lisette De Valentione","l":53,"q":2}},{"type":"npc","id":"1011732","obj":{"i":1011732,"n":"Hortefense","l":53,"q":5}},{"type":"item","id":"7569","obj":{"i":7569,"n":"Aetheryte Ticket","l":1,"c":25918,"t":63}},{"type":"quest","id":"66051","obj":{"i":66051,"n":"Love in the Woods","g":196,"l":"Gridania","s":73}},{"type":"quest","id":"66059","obj":{"i":66059,"n":"Hearts in the Sand","g":196,"l":"Gridania","s":74}},{"type":"quest","id":"66063","obj":{"i":66063,"n":"Ardor in the Harbor","g":196,"l":"Gridania","s":75}}]}