{"quest":{"name":"The Gridanian Envoy","location":"Gridania","id":66043,"patch":2.0,"sort":86,"icon":100067,"eventIcon":71201,"issuer":1003027,"target":1001821,"involved":[1000100,1000106,1000460,1001029,1002693,1002695,1002703,1004336,1004434],"genre":1,"journal":["Kan–E–Senna would entrust you with a task of great import.","Appointing you her personal envoy, Kan–E–Senna bids you deliver a missive to the other two leaders of the Eorzean Alliance. In order to facilitate your journey, she bestows upon you an airship pass, which will allow you to travel by air between the three allied nations. Before making your way to the airship landing, be sure to quiz Miounne as to what awaits beyond the boundaries of the Twelveswood.","In addition to Gridania, the Eorzean Alliance encompasses the city–states of Limsa Lominsa and Ul'dah. The airship landing is situated on the lower floor of the Carline Canopy. Make your final preparations for the journey, then speak with Lionnellais at the entrance lobby.","You are now ready to embark upon the first leg of your journey, which will take you to Limsa Lominsa. Make your way to the landing area and await departure.","Having safely arrived in Limsa Lominsa, you must now seek an audience with the Admiral. Ask the storm honor guard for assistance.","The Admiral awaits you in her command room on the Bridge. Take the Crow's Lift to Bulwark Hall, and present Kan–E–Senna's missive to Zanthael before the Admiral's Lift to gain admission.","Admiral Bloefhiswyn is receptive to the proposal detailed in Kan–E–Senna's missive. It appears the Garlean Empire still poses a grave threat to Eorzea, with the XIVth Imperial Legion, led by Legatus Gaius van Baelsar, deeply entrenched in the border regions. Your business in Limsa Lominsa successfully concluded, make your way to the airship landing and speak with L'nophlo.","You are now ready to embark upon the second leg of your journey, which will take you to Ul'dah. Make your way to the landing area and await departure.","Having safely arrived in Ul'dah, you must now seek an audience with the Flame General. Ask the flame honor guard for assistance.","The Flame General awaits you at the Royal Promenade. Present Kan–E–Senna's missive to Bartholomew on the Hustings Strip to gain admission.","Having now passed on Kan–E–Senna's message to the leaders of both Limsa Lominsa and Ul'dah, you have discharged your duty as the Elder Seedseer's envoy, and learned of the various threats facing Eorzea in the process. Given the immensity of the forces at work, you are moved to wonder what meaningful contribution a lone adventurer might make to the realm's preservation. Perhaps the answer will be revealed to you in the days to come."],"objectives":["Speak with Miounne.","Speak with Lionnellais at the airship landing.","Board the airship.","Speak with the storm honor guard.","Present Kan–E–Senna's missive to Zanthael at Bulwark Hall.","Speak with L'nophlo at the airship landing.","Board the airship.","Speak with the flame honor guard.","Present Kan–E–Senna's missive to Bartholomew on the Hustings Strip."],"dialogue":[{"name":"KANESENNA","text":"Thank you for hearing me out."},{"name":"KANESENNA","text":"I have written a letter to my counterparts in the Eorzean Alliance."},{"name":"KANESENNA","text":"The Battle of Carteneau and the Calamity that followed claimed countless souls, and left countless more bereft and alone. In the dark days that followed, many were the survivors who thought themselves less fortunate than the dead."},{"name":"KANESENNA","text":"Five years have come and gone, but the land and the people still bear the wounds of the devastation."},{"name":"KANESENNA","text":"Nor are we any closer to learning the fate of the Warriors of Light."},{"name":"KANESENNA","text":"Yet so long as we live, never must we give up hope. We owe this to those who laid down their lives that we might behold another dawn."},{"name":"KANESENNA","text":"In remembrance of them, a memorial service will soon be held upon the anniversary of the Battle of Carteneau. This missive bears the details of that service."},{"name":"KANESENNA","text":"You graciously accepted the part of Emissary in the recent ceremony."},{"name":"KANESENNA","text":"Should you be so willing, I would now make you my envoy, and have you bear my message to our allies."},{"name":"KANESENNA","text":"Your dedication to the people of Gridania rouses fond memories in me, and I would choose no other for the role. Will you do me this favor?"},{"name":"KANESENNA","text":"Humbly, I thank you."},{"name":"KANESENNA","text":"As you are no doubt aware, our partners in the Eorzean Alliance lie some considerable distance away. Nor are Ul'dah and Limsa Lominsa close to one another."},{"name":"KANESENNA","text":"Yet fear not, for I have no intention of subjecting you, mine own newly anointed envoy, to a journey which would take weeks by land."},{"name":"KANESENNA","text":"No, I mean for you to travel by air. Receive of me this airship pass. With it, you may make use of the skyways that connect the three city–states of the Alliance."},{"name":"KANESENNA","text":"The airship landing is situated upon the lower floor of the Carline Canopy. Simply show your pass, and you will be admitted to the departure area. Before you embark upon your journey, however, you would do well to seek the worldly wisdom of Miounne. Few forestborn Gridanians know more of the lands beyond the Twelveswood than she."},{"name":"KANESENNA","text":"In better times, airships were available for the convenience of one and all. Alas, the risk that our crafts may fall to imperial attack has forced a reduction in the number of flights."},{"name":"KANESENNA","text":"Consequently, it has become necessary to restrict air travel only to those whose need is great. Such individuals may petition the relevant parties to be issued an airship pass. As you may have deduced, I myself am one such party."},{"name":"KANESENNA","text":"...Yet I was not <span class=\"emphasis\">alone</span> in desiring that you be granted the privilege of air travel."},{"name":"KANESENNA","text":"Such is the potential you show."},{"name":"KANESENNA","text":"We have no doubt but that you will reward our faith in you, <span class=\"highlight\">Forename</span>."},{"name":"KANESENNA","text":"By the power vested in me, I bid you journey forth as my envoy into the great realm of Eorzea."},{"name":"KANESENNA","text":"Walk her fields, brave her seas, and strive to know her better."},{"name":"KANESENNA","text":"And wheresoever you go, go without fear, for the path shall ever be revealed to those who are true of heart."},{"name":"KANESENNA","text":"Guided by the Crystal's light, set forth, and discover your destiny."},{"name":"MIOUNNE","text":"'Tis good to see you up and about again, <span class=\"highlight\">Forename</span>. Tell me, did you pay the Elder Seedseer a visit as I bade?"},{"name":"MIOUNNE","text":"Appointed personal envoy!?"},{"name":"MIOUNNE","text":"And now you are to bear the Elder Seedseer's missive to our allies..."},{"name":"MIOUNNE","text":"Well! It seems you've made an impression on the great woman! I can't argue with her judgment, though. You've <span class=\"emphasis\">earned</span> this honor with tireless hard work, and anyone who says you don't deserve it had better not do so in my hearing!"},{"name":"MIOUNNE","text":"I find myself praising you often of late, but Mother is <span class=\"emphasis\">truly</span> proud of you."},{"name":"MIOUNNE","text":"Short of a Warrior of Light, I can imagine no better adventurer to represent us─and that, my <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">lad</span></span>, is some compliment!"},{"name":"MIOUNNE","text":"But I've flattered you enough for one day. And I don't want your head to get <span class=\"emphasis\">too</span> big, or you'll struggle to lug it around the realm. Speaking of which, Eorzea is a big old place."},{"name":"MIOUNNE","text":"Now that you have an airship pass, you can really start to broaden your horizons. The sky's quite literally the limit."},{"name":"MIOUNNE","text":"Even if your errand didn't call for it, I would strongly suggest visiting the two other city–states of the Alliance before you go anywhere else. They are, of course, Limsa Lominsa, city of pirates, and Ul'dah, jewel of the desert."},{"name":"MIOUNNE","text":"Once you've acquainted yourself with them, you can turn your sights on whichever lesser-trodden region takes your fancy."},{"name":"MIOUNNE","text":"The Calamity changed the face of Eorzea, and much of her now lies in shadow, beyond man's ken. It's a veritable playground for a wide-eyed adventurer like your good self."},{"name":"MIOUNNE","text":"Mind you, it won't all be fun and games."},{"name":"MIOUNNE","text":"Each nation faces its fair share of problems, from internal strife to conflict with the beast tribes and their primals. So don't be too surprised if you find yourself embroiled in the odd unsavory situation on your travels."},{"name":"MIOUNNE","text":"But no matter what difficulties you encounter, I am confident that you will pull through, and emerge the stronger for the experience."},{"name":"MIOUNNE","text":"These are interesting times for Eorzea, <span class=\"highlight\">Forename</span>. It's been five years now since the Calamity, but folk are finally beginning to look to the future."},{"name":"MIOUNNE","text":"A period of great change is upon us, and you have a part to play in it. And if <span class=\"emphasis\">that</span> prospect doesn't excite you, I don't know what will!"},{"name":"LIONNELLAIS","text":"Greetings, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. This is the reservation counter for Limsa Lominsa-bound flights."},{"name":"LIONNELLAIS","text":"Oh, are you not <span class=\"highlight\">Forename Surname</span>, the Elder Seedseer's personal envoy? We at Highwind Skyways are honored to serve you! Will you be flying with us today?"},{"name":"Q1","text":"Proceed to the landing area?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"LIONNELLAIS","text":"Very well. When you are ready to board, please let me know."},{"name":"Q2","text":"Board the airship?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"CABINCREW","text":"Do you wish to leave the landing area?"},{"name":"Q5","text":"Leave the landing area?"},{"name":"A5","text":"Yes"},{"name":"A5","text":"No"},{"name":"CABINCREW","text":"We hope you have a pleasant voyage."},{"name":"LIONNELLAIS","text":"The airship bound for Limsa Lominsa will be departing shortly. Are you ready to board, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"LIONNELLAIS","text":"Thank you for using Highwind Skyways. The airship to Ul'dah will be departing shortly."},{"name":"Q6","text":"Proceed to the landing area?"},{"name":"A6","text":"Yes"},{"name":"A6","text":"No"},{"name":"LIONNELLAIS","text":"Very well. When you are ready to board, please let me know."},{"name":"ANNOUNCE","text":"Attention, all passengers: the airship bound for Limsa Lominsa is about to depart. Please make your way to the boarding gate."},{"name":"MIOUNNE","text":"Farewell, <span class=\"highlight\">Forename</span>."},{"name":"MIOUNNE","text":"One day, minstrels will sing of your deeds."},{"name":"MIOUNNE","text":"May you ever walk in the light of the Crystal."},{"name":"GAIUS","text":"(-???-)It has been fifteen years, but the bitter taste of defeat lingers still..."},{"name":"GAIUS","text":"(-???-)Fifteen years since the imperial fleet set course for Mor Dhona, led by the <span class=\"emphasis\">Agrius</span>, mightiest of all vessels."},{"name":"GAIUS","text":"(-???-)Silvertear Lake lay ripe for the taking, and all of Eorzea would soon be ours...or so we believed."},{"name":"GAIUS","text":"(-???-)But an innumerable host of dragons met us that day, at the heart of which flew the great Midgardsormr."},{"name":"GAIUS","text":"(-???-)Though we succeeded in slaying that lord among wyrms, the dread serpent's defeat was bought at too high a price."},{"name":"GAIUS","text":"(-???-)Our invincible flagship was lost, and all hope of victory with her. So ended our glorious conquest."},{"name":"GAIUS","text":"(-???-)Eorzea... A blighted realm, riddled with false gods..."},{"name":"GAIUS","text":"(-???-)Twice now it has eluded the Empire's grasp."},{"name":"GAIUS","text":"(-???-)For all the destruction it wrought, even Meteor, the Great Sin, failed to yield us control over it."},{"name":"GAIUS","text":"(-???-)And for this failure, the realm has sunk deeper into depravity."},{"name":"GAIUS","text":"(-???-)It is twisted beyond all reckoning─rotten nigh to the core."},{"name":"GAIUS","text":"(-???-)Yet it must be saved."},{"name":"GAIUS","text":"(-???-)Only Garlean rule can bring order to Eorzea. It falls to us to deliver the misguided masses from their ignorance."},{"name":"HUKUKANS","text":"(-All-)We are of one mind, Lord van Baelsar."},{"name":"ANNOUNCE","text":"Senior engineers, please report to magitek research following the scheduled inspection."},{"name":"ENGINEERA","text":"Hey. Is the legatus really planning to take another tilt at Eorzea?"},{"name":"ENGINEERB","text":"Eh!? What hole have you been hiding in? We're in the midst of preparing for a new campaign, and a huge one at that!"},{"name":"ENGINEERA","text":"But...I thought the Emperor had given up the western lands for lost after Carteneau. What could the legatus possibly hope to gain by acting alone?"},{"name":"NERO","text":"(-???-)I sense you harbor certain doubts over the wisdom of the legatus's plan."},{"name":"ENGINEERA","text":"M-My lord!"},{"name":"NERO","text":"Please, call me Nero. Tell me, where were you born?"},{"name":"ENGINEERB","text":"Othard, milord!"},{"name":"ENGINEERA","text":"Ala Mhigo, my lord!"},{"name":"NERO","text":"Ah, Codename Hummingway, I presume?"},{"name":"ENGINEERA","text":"I-I don't know what you─"},{"name":"NERO","text":"Silence. Your denials will not change your fate."},{"name":"NERO","text":"I assure you─Frumentarium sees all."},{"name":"ENGINEERA","text":"Argh..."},{"name":"NERO","text":"Clean up this mess. And do not miss any, or I shall be <span class=\"emphasis\">most</span> displeased."},{"name":"ENGINEERB","text":"A-At once, milord!"},{"name":"NERO","text":"Garlond... Soon you will be made to know the true power of magitek."},{"name":"CABINCREW","text":"Ah, you must be the envoy from Gridania! Welcome to Limsa Lominsa, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. Admiral Bloefhiswyn awaits your arrival."},{"name":"Q7","text":"Leave the landing area?"},{"name":"A7","text":"Yes"},{"name":"A7","text":"No"},{"name":"CABINCREW","text":"Please let me know if you require any assistance."},{"name":"STORMA","text":"You are the Gridanian envoy? Welcome to Limsa Lominsa."},{"name":"STORMA","text":"The Admiral has been looking forward to your arrival."},{"name":"STORMA","text":"Please proceed to the Crow's Lift at your earliest convenience. It will take you to Bulwark Hall."},{"name":"STORMA","text":"Once there, pray speak with Zanthael. He will be pleased to show you in to the Admiral's command room on the Bridge."},{"name":"STORMA","text":"Pray speak with Zanthael in Bulwark Hall. He will be pleased to show you in to the Admiral's command room on the Bridge."},{"name":"ZANTHAEL","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, and welcome to our fair city. If you would permit me to examine the seal on the missive you carry..."},{"name":"ZANTHAEL","text":"Yes, everything seems to be in order. My apologies. We cannot afford to be complacent, you understand. Please, step this way."},{"name":"MERLWYB","text":"(-???-)Enter."},{"name":"MERLWYB","text":"I did not expect the Gridanian envoy to be an adventurer. It speaks highly of your character that the Elder Seedseer would choose an outsider to represent her nation's interests."},{"name":"MERLWYB","text":"This way."},{"name":"MERLWYB","text":"I bid you welcome."},{"name":"MERLWYB","text":"I am Merlwyb Bloefhiswyn, Admiral of Limsa Lominsa, and commander of the Maelstrom."},{"name":"MERLWYB","text":"Now, what news from the Black Shroud?"},{"name":"MERLWYB","text":"Before you begin, I would know your name."},{"name":"MERLWYB","text":"Strange. I would readily have sworn that I knew you, but it seems I was mistaken."},{"name":"MERLWYB","text":"I may not recall old friends' faces, but I surely remember my enemies'. Woe betide the Admiral who fails in <span class=\"emphasis\">that</span>!"},{"name":"MERLWYB","text":"But I jest. Please, do continue."},{"name":"MERLWYB","text":"Hm. A memorial service to honor the fallen."},{"name":"MERLWYB","text":"Seven hells... Has it been five years?"},{"name":"MERLWYB","text":"Five years since the Garlean Empire sought to wrest Eorzea from our grasp..."},{"name":"MERLWYB","text":"It was in answer to the imperial threat that the city–states formed the Grand Companies, and forged the Eorzean Alliance anew. But Garlemald was not content to wager all on a simple contest of martial might. They had other plans─the Meteor project."},{"name":"MERLWYB","text":"Legatus Nael van Darnus─hells take him─intended to “cleanse” our realm by snatching the lesser moon, Dalamud, from the heavens and casting it down upon our heads. Desperate to prevent this lunatic scheme, we marched our forces to the Carteneau Flats and there met the VIIth Imperial Legion in battle."},{"name":"MERLWYB","text":"<span class=\"emphasis\">Never</span> have I seen a fight like the Battle of Carteneau─and I have seen full many."},{"name":"MERLWYB","text":"But though we gave no quarter, spared not one <span class=\"emphasis\">onze</span> of effort...we could not prevent what followed."},{"name":"MERLWYB","text":"From inside the shell of Dalamud came a winged nightmare─a dragon the size of a bloody city. 'Twas the elder primal Bahamut, bent on making an eighth hell of Eorzea."},{"name":"MERLWYB","text":"In the space of a breath, the legions of the Empire were set aflame, while our own armies fared little better. 'Twas as if the whole world was burning... Words cannot well describe the scene."},{"name":"MERLWYB","text":"And yet...by some miracle, a few among us were spared."},{"name":"MERLWYB","text":"Even as I steeled myself for death, a blinding white light enveloped me, robbing me of my senses."},{"name":"MERLWYB","text":"When I regained them, the dragon was gone, and the still-smoldering land was warped beyond all knowing."},{"name":"MERLWYB","text":"Were Archon Louisoix still with us, he would doubtless shed some light on these unfathomable happenings. Alas, he is not, and I fear we will want for his wisdom in the days to come."},{"name":"MERLWYB","text":"For while our nations struggle to recover from the devastation, the beastmen call forth their damned primals to torment us anew."},{"name":"MERLWYB","text":"Unless we put aside our differences and rebuild <span class=\"emphasis\">now</span>, our foes will catch us unprepared."},{"name":"MERLWYB","text":"And I speak not only of the beastmen. Do not imagine that the Empire has forsaken its claim on Eorzea. The imperials crowd our borders, waiting to strike."},{"name":"MERLWYB","text":"Damn it all, we need champions to replace those we lost..."},{"name":"MERLWYB","text":"But such thoughts are worse than worthless. Time is short, and none will save us, save ourselves. It is the duty of every soul who survived the Calamity to work together for the good of Eorzea...and this memorial service may be the very thing to unite us."},{"name":"MERLWYB","text":"Aye, Kan–E–Senna has the right of it. I accept her proposal."},{"name":"MERLWYB","text":"Your duty is done here, adventurer─I will see to it that the Elder Seedseer receives my reply."},{"name":"MERLWYB","text":"You travel next to Ul'dah, yes?"},{"name":"MERLWYB","text":"Pray give my regards to General Raubahn. Oh, and tell him the wolf has been sniffing around the stables. A private jest─and one in poor taste─but I would have you tell it all the same."},{"name":"MERLWYB","text":"Fare you well, <span class=\"highlight\">Forename</span>. May the Navigator guide you on your journey."},{"name":"LNOPHLO","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. This is the counter for passengers traveling to Ul'dah."},{"name":"LNOPHLO","text":"A pleasure to serve you again, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Are you ready to board the airship to Ul'dah?"},{"name":"Q3","text":"Proceed to the landing area?"},{"name":"A3","text":"Yes"},{"name":"A3","text":"No"},{"name":"LNOPHLO","text":"Very well, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I'll be glad to assist you when you are."},{"name":"CABINCREW","text":"Do you wish to leave the landing area?"},{"name":"Q8","text":"Leave the landing area?"},{"name":"A8","text":"Yes"},{"name":"A8","text":"No"},{"name":"CABINCREW","text":"We hope you have a pleasant voyage."},{"name":"LNOPHLO","text":"Are you ready to depart, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? The airship bound for Ul'dah will be leaving shortly."},{"name":"Q9","text":"Proceed to the landing area?"},{"name":"A9","text":"Yes"},{"name":"A9","text":"No"},{"name":"LNOPHLO","text":"Very well, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I'll be glad to assist you when you're ready."},{"name":"Q4","text":"Board the airship?"},{"name":"A4","text":"Yes"},{"name":"A4","text":"No"},{"name":"CABINCREW","text":"Ah, you must be the envoy from Gridania! Welcome to Ul'dah, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. The Flame General awaits your arrival."},{"name":"Q10","text":"Leave the landing area?"},{"name":"A10","text":"Yes"},{"name":"A10","text":"No"},{"name":"CABINCREW","text":"Please let me know if you require any assistance."},{"name":"FLAMEA","text":"Welcome to Ul'dah, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. We have been expecting you."},{"name":"FLAMEA","text":"Flame General Raubahn will receive you in the Fragrant Chamber. Please take the lift down to the Hustings Strip and speak with Bartholomew at the Royal Promenade."},{"name":"FLAMEA","text":"The lift over yonder will take you to the Hustings Strip. From there, proceed south to the Royal Promenade, and speak with Bartholomew to gain admittance to the Fragrant Chamber."},{"name":"BARTHOLOMEW","text":"The Gridanian envoy, I presume? Would you be so good as to allow me to inspect the missive you bear, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? My thanks."},{"name":"BARTHOLOMEW","text":"Ah yes, the seal of the Elder Seedseer. Please proceed."},{"name":"RAUBAHN","text":"Ah, a guest from Gridania. I thought I smelled leaf mold."},{"name":"RAUBAHN","text":"I won't hold it against you. If you're half the warrior Kan-E says, 'tis a wonder you don't reek of dead Ixal."},{"name":"RAUBAHN","text":"Welcome to the sultanate of Ul'dah. I am Raubahn Aldynn, General of the Immortal Flames."},{"name":"RAUBAHN","text":"But you did not come all this way to trade formalities."},{"name":"RAUBAHN","text":"There's something familiar about you... For a moment, I mistook you for an old <span class=\"alternative-container\"><span class=\"alternative\">sister-in-arms</span><span class=\"alternative\">brother-in-arms</span></span>."},{"name":"RAUBAHN","text":"Like <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, you have the eyes of a hero. Eyes that have looked upon the horrors of battle, unblinking."},{"name":"RAUBAHN","text":"I've no doubt Kan-E saw them, too. Mayhap there is hope for Gridania yet! Come, let us talk."},{"name":"RAUBAHN","text":"...Carteneau. Aye, I remember bloody Carteneau."},{"name":"RAUBAHN","text":"Do you know what happened that day, adventurer? When we took the field against the Garleans?"},{"name":"RAUBAHN","text":"So my counterparts have educated you."},{"name":"RAUBAHN","text":"Hm? Oh. Trust Merlwyb to make light of our wolf problem. Woman always did have a black sense of humor."},{"name":"RAUBAHN","text":"Wolves are bloodthirsty beasts upon which one cannot turn one's back. 'Tis only a matter of time before they bite."},{"name":"RAUBAHN","text":"So it was with the Garleans, fifty years ago."},{"name":"RAUBAHN","text":"No sooner had they learned how to use magitek than they began seizing territory from their neighbors."},{"name":"RAUBAHN","text":"Led by then legatus Solus zos Galvus, they swiftly brought the other nations of Ilsabard to heel. And so the legatus became an emperor, and his republic an empire..."},{"name":"RAUBAHN","text":"An empire which then set its sights upon Eorzea."},{"name":"ROAILLE","text":"But the conquering emperor is now an old man of four score winters. His health is failing, and he has no clear successor. Like as not, this is why the Garleans have been quiet of late."},{"name":"RAUBAHN","text":"But the XIVth Imperial Legion is still entrenched within our borders."},{"name":"RAUBAHN","text":"And their commander, Legatus Gaius van Baelsar, has long harbored ambitions of conquest."},{"name":"RAUBAHN","text":"Were he to strike now, I fear we would fall like so many others before us. And not only Ul'dah, but Gridania and Limsa Lominsa as well."},{"name":"RAUBAHN","text":"For the Calamity brought the lot of us to our knees, and we've yet to get up. We barely have the strength to stand against the beast tribes, never mind the primals they mean to summon."},{"name":"RAUBAHN","text":"We are a realm divided, adventurer. An alliance in name only."},{"name":"RAUBAHN","text":"But the wolf cares not for the plight of its prey."},{"name":"RAUBAHN","text":"The Garleans stir, and the Admiral would not let it go unnoticed."},{"name":"RAUBAHN","text":"All other concerns pale in comparison to the Empire─even the beast tribes and their bloody primals."},{"name":"RAUBAHN","text":"We must stand united once more, that much is clear. And if we're to do so, we must remember the cause which last brought us together. Kan–E will have her memorial."},{"name":"RAUBAHN","text":"We will honor the memory of the fallen. We will remind the people what their brothers and sisters fought and died for."},{"name":"ROAILLE","text":"Shall I inform the sultana and the Syndicate?"},{"name":"RAUBAHN","text":"I will speak with Her Grace myself."},{"name":"ROAILLE","text":"Very good, sir."},{"name":"RAUBAHN","text":"The Elder Seedseer will have my reply anon."},{"name":"RAUBAHN","text":"My thanks to you, adventurer."},{"name":"SYSTEM","text":"You may now make use of the airship routes connecting the three nations. Before you may board an airship, you must pay the requisite fare in gil."},{"name":"Q11","text":"Proceed to the Lotus Stand?"},{"name":"A11","text":"Yes"},{"name":"A11","text":"No"}],"reward":{"gil":286,"items":[{"id":6213}],"xp":6720},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65985]},"next":[65970,66210,67677,67960,68669,68743,69499,69532,69590,70120,70263]},"partials":[{"type":"npc","id":"1003027","obj":{"i":1003027,"n":"Kan-E-Senna","l":347,"q":9}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000106","obj":{"i":1000106,"n":"Lionnellais","l":52,"q":6,"t":"Airship Ticketer"}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1002693","obj":{"i":1002693,"n":"Storm Honor Guard","l":28,"q":2}},{"type":"npc","id":"1002695","obj":{"i":1002695,"n":"L'nophlo","l":28,"q":3,"t":"Airship Ticketer"}},{"type":"npc","id":"1002703","obj":{"i":1002703,"n":"Arrivals Attendant","l":28,"q":2}},{"type":"npc","id":"1004336","obj":{"i":1004336,"n":"Flame Honor Guard","l":40,"q":2}},{"type":"npc","id":"1004434","obj":{"i":1004434,"n":"Arrivals Attendant","l":40,"q":2}},{"type":"item","id":"6213","obj":{"i":6213,"n":"Wind-up Airship","l":1,"c":59445,"t":81}},{"type":"quest","id":"65985","obj":{"i":65985,"n":"Renewing the Covenant","g":1,"l":"Gridania","s":75}},{"type":"quest","id":"65970","obj":{"i":65970,"n":"It Could Happen to You","g":93,"l":"Ul'dah","s":141,"f":1}},{"type":"quest","id":"66210","obj":{"i":66210,"n":"Call of the Sea","g":1,"l":"Ul'dah","s":90}},{"type":"quest","id":"67677","obj":{"i":67677,"n":"A Complete Game Changer","g":207,"l":"Ul'dah","s":116}},{"type":"quest","id":"67960","obj":{"i":67960,"n":"Golden Rain","g":200,"l":"Ul'dah","s":136}},{"type":"quest","id":"68669","obj":{"i":68669,"n":"Trouble in Paradise","g":200,"l":"Ul'dah","s":156}},{"type":"quest","id":"68743","obj":{"i":68743,"n":"The Sabotender Shimmy","g":200,"l":"Ul'dah","s":177}},{"type":"quest","id":"69499","obj":{"i":69499,"n":"Caught Shorthanded","g":200,"l":"Ul'dah","s":196}},{"type":"quest","id":"69532","obj":{"i":69532,"n":"A Delivery of Love","g":197,"l":"Gridania","s":200}},{"type":"quest","id":"69590","obj":{"i":69590,"n":"The Great Horn Heist","g":200,"l":"Ul'dah","s":198}},{"type":"quest","id":"70120","obj":{"i":70120,"n":"A Prickly Plaint","g":200,"l":"Ul'dah","s":201}},{"type":"quest","id":"70263","obj":{"i":70263,"n":"A Golden Opportunity","g":200,"l":"Ul'dah","s":202}}]}