{"quest":{"name":"A Wild Rose by Any Other Name","location":"The Waking Sands","id":66046,"patch":2.0,"sort":97,"icon":100074,"eventIcon":71201,"issuer":1003783,"target":1003929,"involved":[1005015,1005119],"genre":1,"journal":["Minfilia is waiting to hear whether or not you will pledge your support to the Scions of the Seventh Dawn.","Taken by an inexplicable urge to wax lyrical, you decide to signify your commitment to the cause by incorporating the order's password, “wild rose,” into a line of improvised verse. Betraying no embarrassment, Minfilia accepts your whimsical utterance in the spirit it was intended, and welcomes you to the Scions. She then introduces you to its leading members: the scholars of Sharlayan, some of whom are familiar to you. Without further ado, you are assigned your first task─to investigate a series of crimes committed in Ul'dah, which the Scions suspect to be primal-related. Speak with Thancred, the debonair bard, to learn the details of your mission.","Thancred believes that the caravan robbery and the recent spate of disappearances are connected. He suggests that you begin your investigation by visiting the scene of the suspected abductions. Make your way to Camp Drybone in eastern Thanalan, and seek the cooperation of a man named Isembard.","Arriving at Camp Drybone, you speak with Isembard, who offers you his full cooperation in the investigation."],"objectives":["Speak with Thancred.","Speak with Isembard at Camp Drybone."],"dialogue":[{"name":"MINFILIA","text":"We Scions have but one objective: to safeguard the future of Eorzea. Among our gravest concerns are the godlike beings known as the primals. Long have we striven to find a lasting solution to the threat they pose."},{"name":"MINFILIA","text":"I know not what it is you desire for yourself, nor what it was that first brought you to Eorzea, but I firmly believe that the power we possess was given to us for a purpose. Pray consider this when you give me your answer, <span class=\"highlight\">Forename</span>."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I will go whither the <span class=\"emphasis\">wild rose</span> blooms."},{"name":"A1","text":"Yours is no small endeavor..."},{"name":"A1","text":"The dangers are great..."},{"name":"A1","text":"Nothing."},{"name":"MINFILIA","text":"Small? No. Worthy? Undeniably. We labor for the good of all the realm."},{"name":"MINFILIA","text":"They are. Yet the risks we take are justified, given that which is at stake."},{"name":"MINFILIA","text":"I take it you will help us."},{"name":"MINFILIA","text":"Wonderful! I knew you wouldn't let us down!"},{"name":"MINFILIA","text":"Forgive me for treating you as a stranger. I know you deserve better than this, considering all you've done for the realm."},{"name":"MINFILIA","text":"It remains unclear why no one remembers you. We can only assume that it is a consequence of the power that Louisoix invoked to save your life."},{"name":"MINFILIA","text":"But irrespective of the cause, know that whatever shroud has fallen upon people's memories, there will surely be a way to lift it."},{"name":"MINFILIA","text":"Thank you for understanding."},{"name":"MINFILIA","text":"But come, I would introduce you to your friends in the order."},{"name":"MINFILIA","text":"Tell me, does the name Sharlayan ring any bells?"},{"name":"MINFILIA","text":"It used to be one of Eorzea's six city–states, and was situated in the northwest of Aldenard."},{"name":"MINFILIA","text":"The Sharlayans were the keepers of wisdom both old and new. Their mastery over magic and aether was unsurpassed, and even the Garleans knew to fear them."},{"name":"MINFILIA","text":"Among their number, there were a noble few who devoted their lives to safeguarding the future of Eorzea."},{"name":"MINFILIA","text":"When the realm began its descent into chaos, and their countrymen fled for the motherland, they alone chose to remain here. These noble men and women were called the Archons."},{"name":"MINFILIA","text":"Those same brave souls stand before you now."},{"name":"MINFILIA","text":"The masked woman is Yda, and beside her is Papalymo. The two are charged with surveying the Twelveswood."},{"name":"YDA","text":"Hello there!"},{"name":"PAPALYMO","text":"Well come!"},{"name":"PAPALYMO","text":"I had every confidence that you would agree to help us."},{"name":"YDA","text":"Me too!"},{"name":"YDA","text":"Okay, my turn to introduce someone! That there is Thancred!"},{"name":"PAPALYMO","text":"He is our man here in Ul'dah, jewel of the desert."},{"name":"THANCRED","text":"Welcome to the team!"},{"name":"THANCRED","text":"I never doubted that you'd come!"},{"name":"THANCRED","text":"If I may, the lovely maiden beside me is named Y'shtola. Limsa Lominsa has the pleasure of being under her care."},{"name":"YSHTOLA","text":"Greetings."},{"name":"YSHTOLA","text":"I have been expecting you."},{"name":"YSHTOLA","text":"Last but not least is Urianger, who presides over all affairs within these halls. Pray seek him out whenever you have questions."},{"name":"URIANGER","text":"<span class=\"emphasis\">Dawn may banish even the darkest night...</span>"},{"name":"URIANGER","text":"...The words of a dear friend. I am glad of our meeting."},{"name":"YSHTOLA","text":"At the Battle of Carteneau, our leader was taken from us. But we did not stray from our purpose."},{"name":"YSHTOLA","text":"We sought out Minfilia and others with her talent, and together established the Scions of the Seventh Dawn."},{"name":"MINFILIA","text":"Along with the Archons, those blessed with the Echo play a pivotal role in our endeavor to forge a brighter tomorrow for the realm."},{"name":"MINFILIA","text":"Oh, I should also introduce you to Tataru, our clerk. She ensures that everything runs smoothly."},{"name":"TATARU","text":"Pleased to make your acquaintance!"},{"name":"MINFILIA","text":"In time, I hope you will come to think of us as family."},{"name":"MINFILIA","text":"But without further ado..."},{"name":"MINFILIA","text":"I would assign you your first task."},{"name":"MINFILIA","text":"Urianger. Have the documents arrived from the Students of Baldesion?"},{"name":"URIANGER","text":"Aye, my lady, they arrived but recently."},{"name":"MINFILIA","text":"We have received a request for aid from the Immortal Flames."},{"name":"MINFILIA","text":"Thancred, would you do the honors?"},{"name":"THANCRED","text":"It would be my pleasure."},{"name":"THANCRED","text":"Some days ago, a crystal caravan registered to Amajina & Sons Mineral Concern was waylaid and divested of its cargo."},{"name":"THANCRED","text":"But there is more. Within a bell of the robbery, several people were reported missing from the shantytown outside the city."},{"name":"MINFILIA","text":"At a glance, one would assume the involvement of bandits, kidnappers, and coincidence."},{"name":"MINFILIA","text":"Such crimes are hardly uncommon, and the Immortal Flames deal with their like almost every day."},{"name":"MINFILIA","text":"However, this time we have reason to believe that a primal is involved."},{"name":"THANCRED","text":"Aye, the evidence left behind implicates the Amalj'aa, who are known worshipers of Ifrit."},{"name":"THANCRED","text":"If we then consider the objects that were taken, there is no room left for doubt─the crimes were committed in the name of a primal."},{"name":"MINFILIA","text":"That you may better understand the nature of our struggle with the primals, I would have you play the leading role in this investigation."},{"name":"MINFILIA","text":"You have my thanks."},{"name":"MINFILIA","text":"If there is aught you wish to know, I recommend you speak with Thancred. He is well versed in the affairs of Ul'dah."},{"name":"THANCRED","text":"Ever at your service, <span class=\"alternative-container\"><span class=\"alternative\">fair lady</span><span class=\"alternative\">dear fellow</span></span>!"},{"name":"THANCRED","text":"Ready to begin, are we? That's the spirit!"},{"name":"THANCRED","text":"So then, your mission is to investigate a crystal robbery and a spate of abductions."},{"name":"THANCRED","text":"...Crimes which we believe to be connected. Assuming we are correct, it is like that any discoveries we make in relation to one will further our understanding of the other."},{"name":"THANCRED","text":"Now, since the attack on their caravan, our friends at Amajina & Sons Mineral Concern have doubled security over all their shipments."},{"name":"THANCRED","text":"In light of this, it is my judgment that the abductions should be our priority."},{"name":"THANCRED","text":"According to our preliminary findings, the majority of the missing were last seen in the vicinity of Camp Drybone, so that would seem a fine place to begin."},{"name":"THANCRED","text":"A fellow by the name of Isembard serves as the camp's de facto leader. Pay him a visit, and see that he gives us his full cooperation."},{"name":"ISEMBARD","text":"Aye, I'm Isembard. Here to search for the missing folk, I take it?"},{"name":"ISEMBARD","text":"Minfilia sent word that an adventurer fitting your description would be along."},{"name":"ISEMBARD","text":"She also warned us to be wary of the Amalj'aa. It seems we know who the culprits are, at the very least."},{"name":"ISEMBARD","text":"Now, I bear no official title at this camp, but the people here have come to look to me for leadership. You have my word that I'll do all I can to help see the victims safely returned."}],"reward":{"gil":203,"items":[{"id":7621}],"xp":7280},"reqs":{"jobs":[{"lvl":17,"id":130}],"quests":[66045]},"next":[66154]},"partials":[{"type":"npc","id":"1003783","obj":{"i":1003783,"n":"Minfilia","l":356,"q":2}},{"type":"npc","id":"1003929","obj":{"i":1003929,"n":"Isembard","l":44,"q":8}},{"type":"npc","id":"1005015","obj":{"i":1005015,"n":"Thancred","l":356,"q":1}},{"type":"npc","id":"1005119","obj":{"i":1005119,"n":"Thancred","l":356,"q":1}},{"type":"item","id":"7621","obj":{"i":7621,"n":"Glamour Dispeller","l":30,"c":26228,"t":60,"p":500}},{"type":"quest","id":"66045","obj":{"i":66045,"n":"The Scions of the Seventh Dawn","g":1,"l":"Ul'dah","s":96}},{"type":"quest","id":"66154","obj":{"i":66154,"n":"Unsolved Mystery","g":1,"l":"Eastern Thanalan","s":98}}]}