{"quest":{"name":"The Scions of the Seventh Dawn","location":"Ul'dah","id":66045,"patch":2.0,"sort":96,"icon":100073,"eventIcon":71201,"issuer":1001353,"target":1005012,"involved":[1004603],"genre":1,"journal":["Momodi is ready to tell you what she knows about the Scions of the Seventh Dawn.","According to Momodi, the men and women who call themselves the Scions of the Seventh Dawn have made it their mission to safeguard Eorzea's future. Given the multitude of problems facing the realm, they are always looking for capable individuals to join their cause, and it appears your recent exploits have drawn their attention. The Scions are headquartered in an establishment called the Waking Sands, located in Vesper Bay, out in western Thanalan. Make your way there and identify yourself to the guardsman at the entrance.","At the entrance to the Waking Sands, you find not a guardsman but a singing Lalafell by the name of Tataru, who informs you that the Antecedent awaits within. Let the door guard know when you are ready to be shown through.","You meet with Minfilia, the leader of the Scions of the Seventh Dawn, who expresses her belief that your power─the Echo─is the key to solving the primal problem facing Eorzea. At the end of a lengthy exposition, she implores you to lend your strength to the Scions' cause, and entrusts you with the order's password: “wild rose.”"],"objectives":["Go to the Waking Sands in Vesper Bay.","Speak with the Scion of the Seventh Dawn."],"dialogue":[{"name":"MOMODI","text":"So you want to know more, then, do you? Well, ain't <span class=\"emphasis\">that</span> a surprise... I swear, if I painted “CERTAIN DEATH” on one door and “LIMITLESS WEALTH” on another, nine out of ten adventurers would go through the first, and the other bloke wouldn't be able to choose, on account of bein' Ul'dahn. Anyway, don't say I didn't warn you."},{"name":"MOMODI","text":"First of all, if you're wonderin' whether you can trust these “Scions of the Seventh Dawn,” you can. They're good people who've made it their mission to solve some of Eorzea's most pressin' problems. 'Course, that ain't no small task, and so they're always lookin' for dependable individuals to join 'em─individuals like <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>."},{"name":"MOMODI","text":"Now, I've been given leave to tell you where to find the Scions, but you must promise to keep this information to yourself. As you can probably imagine, it's somethin' Eorzea's enemies would very much like to know."},{"name":"MOMODI","text":"The Scions are headquartered in Vesper Bay, out in western Thanalan. The place you're lookin' for is called the Wakin' Sands. Give your name to whoever's at the entrance, and you'll be let in."},{"name":"MOMODI","text":"You're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> in demand, <span class=\"highlight\">Forename</span>, and the days ahead promise to be busy, but I hope you won't forget <span class=\"alternative-container\"><span class=\"alternative\">about them as helped make you into the adventurer you are</span><span class=\"alternative\">your old friend Momodi</span></span>. Drop in and tell <span class=\"alternative-container\"><span class=\"alternative\">'em</span><span class=\"alternative\">me</span></span> how you're farin' from time to time, you hear? Right, well, I've said my piece. Off you go."},{"name":"TATARU","text":"Deep in the desert of my heart,♪<br>A lonely flower blooms...♪"},{"name":"TATARU","text":"Yearning for the heavens above♪<br>To quench my thirst for you.♪"},{"name":"TATARU","text":"Trololololo～lololo～♪"},{"name":"TATARU","text":"Uwaaah!"},{"name":"TATARU","text":"&lt;cough&gt;"},{"name":"TATARU","text":"I would thank you not to sneak up on me like that!"},{"name":"TATARU","text":"Now, please be advised that this is private property. Unless you have pertinent business here, I must ask you to─"},{"name":"TATARU","text":"Here at the behest of Yda and Papalymo!?"},{"name":"TATARU","text":"Here at the behest of Thancred!?"},{"name":"TATARU","text":"Here at the behest of Y'shtola!?"},{"name":"TATARU","text":"My sincerest apologies! May I please have your name?"},{"name":"TATARU","text":"<span class=\"highlight\">Forename Surname</span>...<span class=\"highlight\">Forename Surname</span>... Ah, here you are."},{"name":"TATARU","text":"Um...where have I heard your name before?"},{"name":"TATARU","text":"Have we...? Have we met?"},{"name":"TATARU","text":"Wait a minute! Weren't you the shady merchant who tried to sell me imitation Fen–Yll wares the other day? No? Then...are you the persistent peddler who wouldn't leave Lady Minfilia alone, and received a slap for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> troubles?"},{"name":"TATARU","text":"Not <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> either? Oh well, my mistake!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename Surname</span>...<span class=\"highlight\">Forename Surname</span>... Ah, here you are."},{"name":"TATARU","text":"Ahem! I bid you welcome to the Waking Sands, headquarters of the Scions of the Seventh Dawn!"},{"name":"TATARU","text":"My name is Tataru, and I look forward to assisting you during your time with us."},{"name":"TATARU","text":"The Antecedent is within the solar. I shall let her know to expect you."},{"name":"TATARU","text":"The Antecedent awaits downstairs, within the solar. You may enter whenever you are ready."},{"name":"GUIDE","text":"I take it you are <span class=\"highlight\">Forename Surname</span>. Tataru sent word that you had arrived."},{"name":"GUIDE","text":"Lady Minfilia has eagerly awaited your coming. This way, if you please."},{"name":"MINFILIA","text":"(-???-)So you are the adventurer of whom I've heard so much."},{"name":"MINFILIA","text":"Well met, friend. My name is Minfilia, and I lead the Scions of the Seventh Dawn."},{"name":"MINFILIA","text":"I have awaited your coming."},{"name":"MINFILIA","text":"After five long years...you've come back to us, just as Louisoix said you would..."},{"name":"MINFILIA","text":"Words cannot describe the joy I feel at this moment. Welcome home."},{"name":"MINFILIA","text":"Aye, I remember you still, and everything you fought for. Know that you are not entirely forgotten."},{"name":"MINFILIA","text":"If Louisoix is watching us, as I choose to believe, he may now rest in peace, his mission finally fulfilled."},{"name":"MINFILIA","text":"Please, be at ease. You are among friends here."},{"name":"MINFILIA","text":"No doubt you're ripe to burst with questions, but have patience─all will be revealed in time."},{"name":"MINFILIA","text":"First, let me begin by telling you who we are and what we do."},{"name":"MINFILIA","text":"We are the Scions of the Seventh Dawn, an order that transcends political boundaries. Our single objective is the preservation of the future of Eorzea."},{"name":"MINFILIA","text":"Among our gravest concerns are the godlike beings known as the primals."},{"name":"MINFILIA","text":"Their existence is a bane upon Eorzea─nay, the world at large, and we have striven to find a lasting solution to the threat they pose."},{"name":"MINFILIA","text":"Our order is home to a number of individuals who, like you, possess a rare and special talent."},{"name":"MINFILIA","text":"This talent takes various forms, but one holds particular interest for us."},{"name":"MINFILIA","text":"Tell me, have you ever experienced a sudden, inexplicable loss of consciousness?"},{"name":"MINFILIA","text":"Have you ever had the sensation of being pulled away from reality? Felt as though you were hovering in space, a mind without a body?"},{"name":"MINFILIA","text":"All these things are the manifestations of your talent. Yours is the power to transcend the boundaries of the soul─a power known as the Echo."},{"name":"MINFILIA","text":"The Echo allows you to pass through the walls of a man's soul, and hear the resonations of his past."},{"name":"MINFILIA","text":"You will be there in his memories, and see things as he saw them. You may even interact with that which you see, though you cannot change the outcome of events."},{"name":"MINFILIA","text":"For another blessing, the Echo will enable you to know a man's mind even if you cannot comprehend his words."},{"name":"MINFILIA","text":"In short, the Echo is a truly extraordinary power. And this power is strong within you."},{"name":"MINFILIA","text":"It is only a shame that we cannot use it whensoever we choose."},{"name":"MINFILIA","text":"That's right. I too possess the Echo."},{"name":"MINFILIA","text":"With that established, let us return to the subject of the primals."},{"name":"MINFILIA","text":"So long as they exist, the realm cannot take so much as a single step towards true peace."},{"name":"MINFILIA","text":"Measures must be taken─measures which transcend boundaries, be they of faction, race, language, or creed. And to do so, the Scions require the aid of those with our talent."},{"name":"MINFILIA","text":"Make no mistake─the Echo will be instrumental in dealing with the primal threat. Without it, we cannot hope to save the realm."},{"name":"MINFILIA","text":"I know not what it is you desire for yourself, nor what it was that first brought you to Eorzea."},{"name":"MINFILIA","text":"But I firmly believe that the power we possess was given to us for a purpose."},{"name":"MINFILIA","text":"Why else would the gods entrust man with a gift so extraordinary, if not to have him use it?"},{"name":"MINFILIA","text":"And so I implore you: lend us your power."},{"name":"MINFILIA","text":"Naturally, your aid will not go unrewarded. We are fortunate to have a number of influential allies, and at a word from me, they will gladly afford you certain privileges that might otherwise be denied you."},{"name":"MINFILIA","text":"The right to employ retainers, for example. Are you familiar with them? They are individuals who may be relied upon to manage your assets and belongings on your behalf."},{"name":"TATARU","text":"The papers you requested, my lady."},{"name":"MINFILIA","text":"Thank you, Tataru."},{"name":"TATARU","text":"The pleasure is mine, my lady!"},{"name":"MINFILIA","text":"By way of a welcoming gift, I have taken the liberty of adding your name to the retainers' registry. As of now, you are entitled to employ the services of a retainer."},{"name":"MINFILIA","text":"You will need to consult a retainer vocate regarding the particulars of this arrangement, but believe me when I say that retainers will prove invaluable to you in your adventuring endeavors."},{"name":"MINFILIA","text":"Let this gesture serve as evidence of our commitment to do all in our power to facilitate your personal objectives."},{"name":"MINFILIA","text":"In return, we ask that you aid us to the fullest extent of your talents."},{"name":"MINFILIA","text":"A mutually beneficial relationship, I am sure you will agree, and one which serves the greater good besides."},{"name":"MINFILIA","text":"Well, that was a veritable lecture, was it not? Forgive me, but it is important that all concerned are aware of what is expected of them. Now you know our purpose, and what we can offer you, I invite you to consider joining us. When you have come to a decision, you may tell me without fear of censure."},{"name":"MINFILIA","text":"In good faith, I shall entrust you with our order's password, which our members use to reach one another when afield."},{"name":"MINFILIA","text":"It is “wild rose.” Pray keep it safe."}],"reward":{"items":[{"num":12,"id":30362},{"id":3550,"one":1},{"id":3552,"one":1},{"id":3547,"one":1},{"num":3,"id":5824,"one":1}],"xp":7280},"reqs":{"jobs":[{"lvl":17,"id":130}],"quests":[66196]},"next":[66046,67114]},"partials":[{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1005012","obj":{"i":1005012,"n":"Scion Of The Seventh Dawn","l":356,"q":5}},{"type":"npc","id":"1004603","obj":{"i":1004603,"n":"Tataru","l":42,"q":2}},{"type":"item","id":"30362","obj":{"i":30362,"n":"Vesper Bay Aetheryte Ticket","l":1,"c":25918,"t":63}},{"type":"item","id":"3550","obj":{"i":3550,"n":"Decorated Bronze Mitt Gauntlets","l":17,"c":48318,"t":37,"p":598}},{"type":"item","id":"3552","obj":{"i":3552,"n":"Goatskin Mitts","l":17,"c":44068,"t":37,"p":498}},{"type":"item","id":"3547","obj":{"i":3547,"n":"Hard Leather Ringbands","l":16,"c":48239,"t":37,"p":365}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66196","obj":{"i":66196,"n":"Into a Copper Hell","g":1,"l":"Ul'dah","s":95}},{"type":"quest","id":"66046","obj":{"i":66046,"n":"A Wild Rose by Any Other Name","g":1,"l":"The Waking Sands","s":97}},{"type":"quest","id":"67114","obj":{"i":67114,"n":"The Ties That Bind","g":206,"l":"East Shroud","s":1}}]}