{"quest":{"name":"The Black Wolf's Ultimatum","location":"Ul'dah","id":66058,"patch":2.0,"sort":241,"icon":100164,"eventIcon":71201,"issuer":1006573,"target":1006690,"involved":[1001821,1004433],"genre":1,"journal":["Minfilia is greatly concerned by recent developments concerning the council of the Alliance leaders.","In urgent tones, Minfilia reveals to you that Gaius van Baelsar has issued the Alliance leaders with an ultimatum. Even now, they are discussing how best to respond. Lest they make an uninformed decision and inadvertently seal Eorzea's doom, it is imperative that Minfilia be given an opportunity to plead her case. Make haste to the Royal Promenade and ask Bartholomew to admit you to the Fragrant Chamber.","Owing to your timely intervention, Eorzea's leaders have resolved to fight the Empire to the last. Return to the Waking Sands in Vesper Bay, and speak with Minfilia.","The path ahead is now clear─all that remains is to walk it. Join your fellow Scions in preparing for the battle to decide the future of the realm."],"objectives":["Speak with Bartholomew on the Royal Promenade.","Speak with Minfilia at the Waking Sands."],"dialogue":[{"name":"MINFILIA","text":"Grim tidings, <span class=\"highlight\">Forename</span>. It seems that word of the Ultima Weapon's existence has already reached the Alliance leaders...in the form of an ultimatum. They have gathered in the Fragrant Chamber, and are deliberating their answer even as we speak."},{"name":"MINFILIA","text":"Beleaguered as they are, I fear they may well elect to lay down their arms in the belief that surrender will spare their people untold suffering. Yet nothing could be further from the truth."},{"name":"MINFILIA","text":"That which the Black Wolf offers will doom Eorzea, not deliver it, and the leaders must be made aware of this. Let us hurry to them, <span class=\"highlight\">Forename</span>, and ensure that they do not act in ignorance of the consequences."},{"name":"BARTHOLOMEW","text":"The council of the Alliance leaders is presently in progress in the Fragrant Chamber. I must ask that you step away from the doors, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"BARTHOLOMEW","text":"...I'm sorry? You're here on behalf of the <span class=\"emphasis\">Scions of the Seventh Dawn</span>!? A thousand pardons, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>! Of course you may enter!"},{"name":"RAUBAHN","text":"Bah! We keep treading the same ground."},{"name":"MERLWYB","text":"Van Baelsar's demands are clear..."},{"name":"KANESENNA","text":"Alas, our minds are not."},{"name":"RAUBAHN","text":"I've never been one to shy from a fight. But if this weapon of theirs can do all they claim..."},{"name":"KANESENNA","text":"It has been five years since the Calamity, and our people have scarce begun to rebuild their lives."},{"name":"KANESENNA","text":"Can we now, in good conscience, call upon them to risk what little they have left? I would spare them the pain of further conflict."},{"name":"KANESENNA","text":"Conflict, I say, though that would imply forces set in opposition. If the combined might of three primals could not stay Garlemald's new terror..."},{"name":"KANESENNA","text":"What meaningful resistance can we offer? We who struggle to quell the foes who rise up within our own borders..."},{"name":"MERLWYB","text":"Long have we fought the primals, but to what end? We strike them down at no small cost, only for them to rise again and again."},{"name":"MERLWYB","text":"Are we to play this profitless game for the rest of days? I for one grow tired of it."},{"name":"MERLWYB","text":"Mistake me not, I do not propose to trade one tyranny for another."},{"name":"MERLWYB","text":"I love liberty. But conciliation need not mean oppression."},{"name":"RAUBAHN","text":"By the Twelve... Though neither of you cried “surrender,” your every word betokened it."},{"name":"RAUBAHN","text":"Not that I deny there is truth in what you say. Nor can I rightly claim that Ul'dah is ready to fight."},{"name":"RAUBAHN","text":"Refugees flood our gates, and beastmen swarm our land, while the great and the good do nothing. My Flames struggle to bear the burden."},{"name":"RAUBAHN","text":"I put on a grand show at the remembrance service, made all manner of lofty promises... I've made good on not a bloody one."},{"name":"NANAMOULNAMO","text":"Do not blame yourself, Raubahn. You said only that which the people needed to hear. All present have done the same."},{"name":"NANAMOULNAMO","text":"Our citizens had become lost to hope. If our words served to kindle it in them anew, better we speak than remain silent."},{"name":"NANAMOULNAMO","text":"Our enemy condemns us for failing our people, yet what does he care for their well-being?"},{"name":"NANAMOULNAMO","text":"While we labored to rebuild their lives, the Black Wolf built instruments of murder with which to <span class=\"emphasis\">end</span> them."},{"name":"KANESENNA","text":"Her Majesty speaks true. For all our failings, the people's well-being has ever been our foremost priority."},{"name":"KANESENNA","text":"While none among us ever doubted that the Empire would one day resume its war, we scarcely had means enough to solve the problems of the present."},{"name":"MERLWYB","text":"Aye, which is why we looked to others to safeguard our future─"},{"name":"MERLWYB","text":"The Scions of the Seventh Dawn. Alas, they are gone, and the Black Wolf is at our door."},{"name":"ALPHINAUD","text":"Admiral, I fear you are mistaken!"},{"name":"MERLWYB","text":"Alphinaud? Minfilia? And─seven hells─MASTER GARLOND!"},{"name":"KANESENNA","text":"And you, dear friend..."},{"name":"RAUBAHN","text":"By Rhalgr... You're alive! <span class=\"emphasis\">All</span> of you!"},{"name":"ALPHINAUD","text":"As we approached, I would swear I heard talk of surrender, but I know that cannot be! It is not the Eorzean way!"},{"name":"MINFILIA","text":"Hear me, my friends! Accepting the Garleans' offer to vanquish the primals would be folly."},{"name":"MINFILIA","text":"Folly, I say, for might is not the answer to the primal threat. Indeed, the more the Empire exerts its strength, the worse matters will become."},{"name":"MINFILIA","text":"Primals enter this world when mortals call upon them, and mortals are wont to appeal to a higher power when they are desperate."},{"name":"MINFILIA","text":"Nothing is more certain to breed desperation in the beast tribes than the Garleans' proposed solution."},{"name":"ALPHINAUD","text":"The true answer lies in a lasting peace, but the Garleans only know war and conquest. Should Eorzea fall into their hands, there will be such suffering as none can imagine."},{"name":"MINFILIA","text":"We are not blind to the many challenges that each of your nations face. Yet you must not give in."},{"name":"ALPHINAUD","text":"Aye! Remember five years ago, when you wagered all for the sake of the realm! Remember what you fought for, what you were willing to die for!"},{"name":"ALPHINAUD","text":"Let the memories rekindle the fire in your heart, for Eorzea has need of it again!"},{"name":"MINFILIA","text":"Come what may, we Scions will never give up the fight."},{"name":"MINFILIA","text":"And so I bid you stand with us, and together we shall safeguard the future of the realm!"},{"name":"CID","text":"A great man once said that a shrewd merchant grasps not for the quick profit, but invests in the future. Wise words...eh, Raubahn?"},{"name":"RAUBAHN","text":"Cid... I..."},{"name":"KANESENNA","text":"Your words stir...and shame me in equal measure. How could I contemplate surrender...?"},{"name":"KANESENNA","text":"I know full well that all we have, we owe to the sacrifices of those who went before us. Yet the seeming hopelessness of our plight robbed me of my insight."},{"name":"KANESENNA","text":"We Gridanians have no love for war..."},{"name":"KANESENNA","text":"Yet we have still less for those who would threaten our homeland. Ever have we fought to protect those things we hold dear, and this shall never change."},{"name":"KANESENNA","text":"Gridania will go to war. We will fight the Empire, for the sake of the realm and all who abide here!"},{"name":"NANAMOULNAMO","text":"Ahaha... Ahahahaha!"},{"name":"NANAMOULNAMO","text":"Hahaha! Hear, hear!"},{"name":"MERLWYB","text":"Hahahaha..."},{"name":"RAUBAHN","text":"Hah hah hah hah!"},{"name":"NANAMOULNAMO","text":"At long last, I hear words worthy of a founder of the Alliance!"},{"name":"NANAMOULNAMO","text":"Raubahn! Are we to be outdone!?"},{"name":"RAUBAHN","text":"I lost one homeland. The thought of losing another had blunted my resolve."},{"name":"RAUBAHN","text":"But no man knows better than I that if you want aught, you'd best be ready to die for it."},{"name":"RAUBAHN","text":"With great danger comes the chance for great glory, and great profit─we Ul'dahns, who have turned sand into gold, know this well."},{"name":"RAUBAHN","text":"How many times have we fallen into the pit of despair, only to have you pluck us out? I've fair lost count."},{"name":"MERLWYB","text":"Reckless, the lot of you─like bloody pirates! Well, I won't waste my breath trying to talk you 'round..."},{"name":"MERLWYB","text":"...On account of being a pirate myself. And the pirate who shrinks from a challenge is no pirate at all!"},{"name":"MERLWYB","text":"Those who would pick a quarrel with us must choose: back down, or go down with all hands."},{"name":"MERLWYB","text":"Let the Garleans come. The united strength of Limsa Lominsa will be waiting for them!"},{"name":"NANAMOULNAMO","text":"If our realm is to be free of this pall of darkness, let it be by our own hands!"},{"name":"LEADERS","text":"(-Leaders-)For Eorzea!"},{"name":"KANESENNA","text":"We must needs consider how the weapon may be brought to bear against us."},{"name":"MERLWYB","text":"The Maelstrom will secure strategic points along the coastline."},{"name":"RAUBAHN","text":"In the meantime, the Flames will deploy at..."},{"name":"NANAMOULNAMO","text":"Be at ease, my friends. You have banished our doubts."},{"name":"NANAMOULNAMO","text":"Pray leave the military matters to us, and retire to the Waking Sands. We will send word anon."},{"name":"MINFILIA","text":"No text"},{"name":"MINFILIA","text":"I cannot well express my relief. To think that the Alliance came so close to surrender..."},{"name":"CID","text":"But the fire in their hearts has been rekindled, and they will fight to the last."},{"name":"ALPHINAUD","text":"This warmth inside... Did you feel it too, Grandfather?"},{"name":"ALPHINAUD","text":"I would know something─was that your power at work earlier?"},{"name":"MINFILIA","text":"Nothing of the sort. The leaders of Eorzea had lost their way─I merely helped them to find it again."},{"name":"MINFILIA","text":"Oh, hello!<br>...Yes, our party returned just a moment ago. How close are you?"},{"name":"MINFILIA","text":"It's all right, Cid."},{"name":"ALPHINAUD","text":"We must needs plan our next move. Pray continue liaising with your respective nations. Cid, would you be our man in Ul'dah?"},{"name":"CID","text":"I'll be whatever and wherever you need me to be!"},{"name":"YSHTOLA","text":"We haven't a moment to waste."},{"name":"YDA","text":"All right! Let's do this!"},{"name":"MINFILIA","text":"Thancred's fate weighs heavy on my mind. I cannot bear to think of him in thrall to an Ascian."},{"name":"MINFILIA","text":"Mayhap you know this already, but the Ascians are immortal beings without physical form. Since time immemorial, they have fanned the flames of chaos from the shadows."},{"name":"MINFILIA","text":"That they might work unseen, the Ascians entrap and possess mortal men by means of malign artifacts known as Crystals of Darkness."},{"name":"MINFILIA","text":"One such Crystal may yet be the key to saving Thancred."},{"name":"ALPHINAUD","text":"This is a Crystal of Darkness?"},{"name":"YSHTOLA","text":"A mere replica, created using data obtained from anomalous crystals found across Eorzea."},{"name":"MINFILIA","text":"It comes to us courtesy of the Students of Baldesion, our distant allies."},{"name":"MINFILIA","text":"Even for an Archon, Thancred's talents are exceptional. We all had complete confidence in him."},{"name":"MINFILIA","text":"It was for this reason that none among us foresaw the danger in sending him to investigate the Ascians alone."},{"name":"PAPALYMO","text":"Thancred had been striving to fill the void left by Louisoix. Yet it was plain that he was overtaxing himself."},{"name":"YDA","text":"Yeah... He would volunteer for everything and work till he was dizzy."},{"name":"ALPHINAUD","text":"And the toll taken by his exertions made him vulnerable to Ascian influence..."},{"name":"MINFILIA","text":"The Crystal that binds Thancred must be somewhere on his person. If we could but destroy it, his Ascian possessor would be compelled to relinquish control over him."},{"name":"MINFILIA","text":"You have proven the stoutest of allies, standing with us through thick and thin."},{"name":"MINFILIA","text":"Yet the most perilous struggle is still to come. For the sake of the realm─and Thancred─I ask that you lend us your strength once more."},{"name":"Q1","text":"Will you lend your strength?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MINFILIA","text":"Thank you. From the bottom of my heart."},{"name":"MINFILIA","text":"As I am sure you are aware, the realm was saved from certain doom five years ago by heroes known as the Warriors of Light."},{"name":"MINFILIA","text":"What you may <span class=\"emphasis\">not</span> be aware of is that your many feats in service to the Scions have prompted folk to make certain...comparisons."},{"name":"MINFILIA","text":"I must confess, you do remind me of them."},{"name":"MINFILIA","text":"One can only wonder at their insight. Perhaps a touch of the Echo resides in everyone."},{"name":"MINFILIA","text":"Yet remember this: however glorious the past, it is the hero's lot to be judged on the deeds of the present."},{"name":"MINFILIA","text":"A new darkness threatens the realm, and the people cry out for a savior."},{"name":"MINFILIA","text":"I believe that <span class=\"emphasis\">you</span> are <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>─a Warrior of Light, here in the present, guided by the Crystal's will."},{"name":"MINFILIA","text":"Come, my friends! Let us fight to safeguard the future of our beloved Eorzea!"},{"name":"MINFILIA","text":"I meant to ask you. Are you, perchance, in possession of your own chocobo? I would be remiss to send you into a battle of this scale without a mount."},{"name":"MINFILIA","text":"If you do not, I would encourage you to procure one from your Grand Company as soon as you are able. I can guarantee you that it will serve you well to have your own steed."},{"name":"SISTEM","text":"In order to undertake the next main scenario quest, you must first complete the quest “My Little Chocobo  (MaelstromTwin AdderImmortal Flames).”"},{"name":"SISTEM","text":"You may accept the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames)” by speaking with R'ashaht Rhiki at Maelstrom CommandVorsaile Heuloix at the Adders' NestCommander Swift at the Hall of Flames."},{"name":"ELYENORA","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Do you wish to proceed to your vessel?"},{"name":"Q2","text":"Proceed to the landing area?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"}],"reward":{"gil":1808,"items":[{"num":8,"id":30362}],"xp":25850},"reqs":{"jobs":[{"lvl":46,"id":130}],"quests":[66057]},"next":[66543,66551,66552,66561,66572,67089,70057]},"partials":[{"type":"npc","id":"1006573","obj":{"i":1006573,"n":"Minfilia","l":40,"q":2}},{"type":"npc","id":"1006690","obj":{"i":1006690,"n":"Minfilia","l":356,"q":2}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1004433","obj":{"i":1004433,"n":"Elyenora","l":40,"q":6,"t":"Airship Ticketer"}},{"type":"item","id":"30362","obj":{"i":30362,"n":"Vesper Bay Aetheryte Ticket","l":1,"c":25918,"t":63}},{"type":"quest","id":"66057","obj":{"i":66057,"n":"Escape from Castrum Centri","g":1,"l":"Mor Dhona","s":240}},{"type":"quest","id":"66543","obj":{"i":66543,"n":"Primal Fear","g":93,"l":"The Waking Sands","s":460,"f":1}},{"type":"quest","id":"66551","obj":{"i":66551,"n":"A Kobold Initiative","g":93,"l":"The Waking Sands","s":470}},{"type":"quest","id":"66552","obj":{"i":66552,"n":"Can't Do It without U","g":0,"l":"The Waking Sands","s":470}},{"type":"quest","id":"66561","obj":{"i":66561,"n":"Into the Valley of the Skull","g":93,"l":"The Waking Sands","s":480}},{"type":"quest","id":"66572","obj":{"i":66572,"n":"Operation Archon","g":0,"l":"The Waking Sands","s":242}},{"type":"quest","id":"67089","obj":{"i":67089,"n":"Can't Do It without U","g":93,"l":"The Waking Sands","s":470}},{"type":"quest","id":"70057","obj":{"i":70057,"n":"Operation Archon","g":1,"l":"The Waking Sands","s":242}}]}