{"quest":{"name":"Love in the Woods","location":"Gridania","id":66051,"patch":2.5,"sort":73,"icon":100383,"eventIcon":71221,"issuer":1011732,"target":1011733,"genre":196,"journal":["Hortefense would have you assist his man in Gridania in a search for an absent adventurer.<br>※This quest is available for a limited time only.","Hortefense asks you to assist his mission in Gridania by tracking down a local lady's missing swain. The emissary in charge of the case awaits you by the amphitheatre gates. He will introduce you to the lady in question, so that you might listen to her plea.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The troubled maiden explains how her love is an adventurer, who recently departed on yet another mission. Unfortunately, the absent-minded fellow left no word of his destination. All that the lady can recall is that he often spoke of <span class=\"alternative-container\"><span class=\"alternative\">chocobos</span><span class=\"alternative\">the Central Shroud</span></span> in the days before his disappearance. She would be most grateful if you could track down her roving beau, and deliver to him a fragrant charm of her own design.<br><br>※Please note that the adventurer you seek will not be marked on the map, nor will any identifying symbol appear above the character's head. Share your information with other players, and try to find him.","You present the charm to Frageorloix in Bentbranch Meadows. He recognizes its craftsmanship as that of his sweetheart, confirming that he is indeed the swain you seek. He returns to Gridania to be reunited with his lady love, and to prepare a gift of his own. All that remains is to return to Mih Khetto's Amphitheatre, and report your success to the emissary.","The emissary thanks you for your efforts in finding Frageorloix, and for passing on the maiden's token of affection. But there is another whose suit remains unanswered: it seems that Ser Hortefense searches for his own lost love─a “noblewoman of paramount virtue.” Might this fit the description of anyone you know?"],"objectives":["Speak with the House Valentione emissary in Gridania.","Locate the absent adventurer and give him the fragrant charm.","Report to the House Valentione emissary in Gridania."],"dialogue":[{"name":"HORTEFENSE","text":"A lady from this very city came to us, requesting our help to deliver a Valentione's gift to her roving swain. Yet, try as we might, we have been unable to pick up his trail in this labyrinth of trees. Why, if not for the bread crumbs I scattered in my wake, I might very well have been lost myself!"},{"name":"HORTEFENSE","text":"Mayhap a <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> such as yourself, who is more familiar with these parts, will find some insight in what little information the lady can provide. Pray speak with my man at the amphitheatre gates─he will introduce you to the lady in question."},{"name":"HORTEFENSE","text":"I could find my way through a blizzard in a snowfield by the merest undulation of the ice, yet in these forests I cannot tell one tree from the other. Pray meet with my man by the gates, and listen to the poor maiden's story. No doubt there is some vital clue in her words that we have overlooked."},{"name":"MISSIONARY00515","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. Might you be one of the assistants of whom Lord Hortefense informed me? Very good. I shall fetch the lady forthwith."},{"name":"GIRLA00515","text":"I am most grateful for your assistance, adventurer. If my darling doesn't receive my gift before Valentione's Day is over, we shall be doomed to part. It may seem like mere superstition to you, but for me it is painfully real! Please find him, I beg you!"},{"name":"GIRLA00515","text":"My love is an adventurer like yourself. He set out on an expedition some days ago, but he has yet to return. I'm sure no harm can have come to him─he's so strong, and brave, and handsome─but I <span class=\"emphasis\">do</span> wish he would have told me where he was going."},{"name":"GIRLA00515","text":"This is my gift for him─a charm I prepared from a cutting of the most fragrant tree in the Twelveswood. I agonized for hours over selecting the perfect spray, and poured my heart and soul into whittling it just so. If he could only see it, I am sure he would understand just how much I care..."},{"name":"GIRLA00515","text":"...Do I have any idea where he might have gone? Well...I can't be sure it's related, but he oft spoke of chocobos before he left. I'm sorry─it isn't much to go on, I know..."},{"name":"GIRLA00515","text":"...Do I have any idea where he might have gone? Well...I can't be sure it's related, but he oft spoke of the Central Shroud before he left. I'm sorry─it isn't much to go on, I know..."},{"name":"GIRLA00515","text":"Forgive me for burdening you with my troubles, but I simply must have him know of my love before it is too late. If you could find him for me and deliver my gift, I would be eternally grateful!"},{"name":"MISSIONARY00515","text":"So there you have it. That is the information we have to go on. Do you think you will be able to find this adventuring sweetheart of hers before Valentione's Day is over?"},{"name":"MISSIONARY00515","text":"Should you find the task too daunting, perhaps you might discuss the matter with your fellow adventurers. They may have bumped into this fellow on their travels, or gleaned some other clue as to his current location."},{"name":"MISSIONARY00515","text":"I am afraid that all <span class=\"emphasis\">I</span> can offer is a redoubled request: please do whatever you can to find this man, and deliver the charm unto him. For this is Valentione's Day, and as a loyal servant of House Valentione, it pains me to see such a gift go undelivered. I am counting on you, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>!"},{"name":"SYSTEM","text":"During this quest, the location of the absent adventurer will not be marked on the map, nor will any identifying symbol appear above the character's head. Speak with other players and share your information, and try to find him!"},{"name":"MISSIONARY00515","text":"It seems the gentleman in question was talking about chocobos before he left. Might he be looking to hire one...or purchase one, perhaps? I fear I would not know where to go were I to attempt the same. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00515","text":"It seems the gentleman in question was talking about the Central Shroud before he left. ...Which way is that again? Forgive me, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>─I fear I know too little of these forests to be of any use to you. Perhaps your fellow adventurers might be of more help?"},{"name":"HORTEFENSE","text":"What ho, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>! How fares your search? I must make a little confession: you are not the only adventurer I have asked to assist us in this matter. When it comes to finding loved ones, the more the merrier, I say!"},{"name":"LOVER00515","text":"Ah, a fellow adventurer! <span class=\"highlight\">Forename</span>, is it? Might you be interested in joining my party? I was just about to head down into─<br>...What? You have a Valentione's Day gift for me?"},{"name":"LOVER00515","text":"A charm...? Why, this is a gift from my darling! I would recognize her craftsmanship anywhere. Thank you for bringing it to me, <span class=\"highlight\">Forename</span>...but however did you find me? I don't recall telling anyone that I was coming to Bentbranch."},{"name":"LOVER00515","text":"I see... Then I thank you again for the trouble you've taken. Did you know that these charms have become something of a Valentione's Day tradition in Gridania? Superstition has it that couples who fail to exchange them are fated to separate, and my lady has quite convinced herself this is true."},{"name":"LOVER00515","text":"...A fact that I had quite forgotten. Forgive me, <span class=\"highlight\">Forename</span>, but I had best return to Gridania─I have a charm to prepare. Thank you once more for seeking me out, my friend─if not for you, chances are I would be sleeping in the stables tonight!"},{"name":"MISSIONARY00515","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and congratulations on finding the missing man! He passed through the city gates not a few minutes ago, the charm at his belt. There they are over there, do you see? Reunited at last, and displaying every evidence of happiness!"},{"name":"MISSIONARY00515","text":"Thanks to your magnificent efforts, their devotion to each other has flowered anew! You have done a great service for House Valentione this day."},{"name":"MISSIONARY00515","text":"...And speaking of services to House Valentione, did you happen to come across a “noblewoman of paramount virtue” on your travels?"},{"name":"MISSIONARY00515","text":"Prithee, do not misunderstand─I do not seek one for myself. Lord Hortefense requested that I search for such a lady. If you happen to know of anyone who fits the description, I am sure he would be most grateful for the information."},{"name":"MISSIONARY00515","text":"But for now, your work in Gridania is complete! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>─without <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> like you, the world would be a less passionate place!"},{"name":"HORTEFENSE","text":"How goes the search, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>? ...You have already located the missing man!? Oh, but that is wonderful news! I knew that I could rely on you!"},{"name":"SYSTEM","text":"You have successfully assisted the emissaries of House Valentione in all three city–states! Return to Hortefense in Mih Khetto's Amphitheatre to report your success."}],"reward":{"gil":286,"items":[{"num":10,"id":6996}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66048]},"next":[66083]},"partials":[{"type":"npc","id":"1011732","obj":{"i":1011732,"n":"Hortefense","l":53,"q":5}},{"type":"npc","id":"1011733","obj":{"i":1011733,"n":"House Valentione Emissary","l":53,"q":1}},{"type":"item","id":"6996","obj":{"i":6996,"n":"Prismatic Heart (Left)","l":1,"c":22630,"t":85,"p":8}},{"type":"quest","id":"66048","obj":{"i":66048,"n":"Where Did Our Loves Go","g":196,"l":"Gridania","s":72}},{"type":"quest","id":"66083","obj":{"i":66083,"n":"Now That We've Found Love","g":196,"l":"Gridania","s":76}}]}