{"quest":{"name":"Escape from Castrum Centri","location":"Mor Dhona","id":66057,"patch":2.0,"sort":240,"icon":100163,"eventIcon":71201,"issuer":1006555,"target":1006573,"involved":[1004433,1006530,1006531,1007537],"genre":1,"usedItems":[6223,6224],"journal":["Cid awaits confirmation of your readiness to undertake the rescue mission.","After much painstaking preparation, the time has finally come to infiltrate Castrum Centri and rescue your fellow Scions. Don your imperial pot helm and short robe, and proceed to the rendezvous point east of the stronghold.","You have succeeded in entering the castrum undetected. Next, you must gather information on where your comrades are being held. Approach three imperial soldiers and greet each with a disarming /imperialsalute.","Based on what you have learned, Minfilia and the others are being held within the storage tower. Accessing this tower requires a special identification key, which you must somehow obtain from the imperial centurion. Approach the forbidding fellow and win his good opinion with a perfectly executed /imperialsalute.","Through deft use of the magic word, you succeed in convincing the centurion to loan you his identification key. Biggs will know what to do with it.","Using the identification key, you have gained access to the sector in which the storage tower stands. Enter the tower via the steel gate, and set your friends free.","Though the rescue mission was a success, the shocking revelation that Thancred has been possessed by Lahabrea has cast a dark pall over the Scions. Painful though this blow may be, you have no choice but to take it on the chin and forge on for the sake of Eorzea.","You have safely arrived in Ul'dah. Speak with Minfilia to learn her mind.","None can say how the Alliance leaders may respond to the threat posed by the Ultima Weapon, but Minfilia is certain of one thing: so long as it exists, Eorzea shall never know peace."],"objectives":["Speak with Cid while disguised as an imperial soldier.","Perform an /imperialsalute to imperial soldiers.","Perform an /imperialsalute to the centurion.","Give Biggs the imperial identification key.","Examine the steel door.","Speak with Minfilia."],"dialogue":[{"name":"CID","text":"How go your preparations, <span class=\"highlight\">Forename</span>? We leave as soon as you're ready."},{"name":"CID","text":"Glaumunt! You came!"},{"name":"GLAUMUNT","text":"Aye─thought I'd give you all a roarin' send-off. 'Tis the least I can do for the fine men an' women what're about to make my lifelong wish come true."},{"name":"CID","text":"Well, we'll do our best! Hmmm... It occurs to me, for all the help you've afforded us, we know little and less about you. What did the Empire do to earn your ire? ...Ah, but I fear I've put curiosity before consideration. I quite understand if you'd rather not relive those memories."},{"name":"GLAUMUNT","text":"No, no, I don't mind, really. Truth be told, a part o' me was itchin' to tell you my tale. Mind you, 'tis hardly novel─I ain't the first to suffer at imperial hands."},{"name":"GLAUMUNT","text":"Like most folk, I used to have a mother. She was a sweet, carin' woman with a smile never far from her face. There was a sister too. Pretty little thing, she was─gentle as a lamb, but tough as nails. We were poor folk livin' simple lives, but we knew happiness just the same."},{"name":"GLAUMUNT","text":"An' then the imperials came an' took it all away. When Ala Mhigo fell, they put my family in a camp. Bein' a lad, I was made to do hard labor, while my mother an' sister were forced to do far worse... They hid their sufferin' from me as best they could, but I <span class=\"emphasis\">knew</span>, an' the thought of it drove me mad. We had to escape. An' so I hatched a plan to get us out o' the city."},{"name":"GLAUMUNT","text":"We were pickin' our way around a gorge not far outside the walls when they caught up with us... An' rather than allow 'emselves to be taken again, my mother an' sister leaped over the edge before my very eyes. Heartbroken as I was, I didn't put up a fight when the imperials clapped me in chains an' dragged me back."},{"name":"GLAUMUNT","text":"'Twas some years after that I escaped again, an' that time, I got away. I swore then that I'd get revenge on the Empire, an' became an adventurer so as to hone my skills an' earn the coin I needed. But nigh on two decades've since gone by, an' what've I achieved? Bugger all, that's what."},{"name":"GLAUMUNT","text":"Not like you lot. You ain't been here ten minutes, an' you've already done more'n I managed in ten bloody <span class=\"emphasis\">years</span>."},{"name":"CID","text":"You give us too much credit, Glaumunt. We seek only to rescue our friends."},{"name":"GLAUMUNT","text":"Well, what's more important than that? An' anyroad, after you've got your friends back, you're plannin' on goin' after the Empire, an' don't pretend you ain't."},{"name":"GLAUMUNT","text":"I've helped a few folk take on the imperials over the years, an' every time I have, it's helped stave off my appetite for revenge. But summat tells me I won't be goin' hungry for a while what with everythin' you've got planned."},{"name":"CID","text":"And you are sure that will satisfy you? If you wish to strike back at the Empire with your own hand, you need only say the word. We would be glad to have you with us."},{"name":"GLAUMUNT","text":"Temptin' though your offer is, I'm afeared I must decline."},{"name":"GLAUMUNT","text":"I swore I'd get revenge on the Empire, 'tis true, but I've long since realized that the front lines are no place for a man like me."},{"name":"GLAUMUNT","text":"Aye, there's some as would call me craven, but I prefer to think o' myself as a realist. My talents lie in schemin', ye see, not swordplay. Helpin' folk like you is how I can make the most difference."},{"name":"GLAUMUNT","text":"...But that's quite enough storytellin' for one day. Best not keep your friends waitin' any longer. I'll be prayin' for your safety an' success. May Rhalgr give you strength!"},{"name":"CID","text":"Wherever the Empire goes, misery invariably follows in its wake."},{"name":"CID","text":"For the sake of all who call Eorzea home, we must put an end to Gaius's ambitions."},{"name":"CID","text":"But first, we have friends to rescue."},{"name":"CID","text":"Biggs, Wedge, and I will lie in wait east of Castrum Centri, just outside the stronghold's patrol perimeter."},{"name":"CID","text":"Join us when you're ready.<br>Oh, and don't forget to wear your disguise, or this will be the shortest rescue mission in history."},{"name":"SLAFBORN","text":"Want to go in? It hardly needs saying, but try not to be seen."},{"name":"EVENTAREA","text":"Proceed to Cid's workshop?"},{"name":"EVENTAREA","text":"Yes"},{"name":"EVENTAREA","text":"No"},{"name":"CID","text":"There you are. A patrol should be heading back to the castrum any moment now, so for gods' sakes, don your disguise."},{"name":"CID","text":"If you've misplaced your disguise, hurry back to Revenant's Toll. Glaumunt told me that he'd acquired some additional helms and robes for just such an eventuality. Whatever you do, though, do it <span class=\"emphasis\">swiftly</span>. We need you here and in imperial uniform if this plan is going to work."},{"name":"GLAUMUNT","text":"...Eh? Lost your imperial disguise? You daft sod! 'Tis lucky I thought to acquire some spares... In case you've forgotten, these ain't exactly easy to get hold of. Be more careful with 'em this time."},{"name":"CID","text":"This is it, <span class=\"highlight\">Forename</span>. Time to rescue our comrades."},{"name":"Q1","text":"Infiltrate Castrum Centri?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"CID","text":"Forgive me for saying so, but you <span class=\"alternative-container\"><span class=\"alternative\">look rather fine</span><span class=\"alternative\">cut quite a dashing figure</span></span> in imperial black and crimson! <span class=\"emphasis\">Definitely</span> your colors! Ahhh, but now is not the time for jests."},{"name":"CID","text":"Let's review the infiltration plan. Castrum Centri lies just beyond."},{"name":"CID","text":"A short while ago, an imperial patrol left to do its rounds."},{"name":"CID","text":"Alphinaud and I will create a diversion out here and keep them occupied for as long as we are able. Meanwhile, the three of you will enter the stronghold, posing as the patrol returning from duty."},{"name":"CID","text":"Should Alphinaud and I prove less distracting than hoped, I will contact you via linkpearl. Be ready to beat a hasty retreat."},{"name":"CID","text":"Wedge will lead the way in the reaper. Stay close to him."},{"name":"CID","text":"And I hardly need tell you this, but don't do anything suspicious!"},{"name":"CID","text":"Oh, and lest you wonder, Yda and Y'shtola left shortly before you arrived. We had planned that they should linger in the vicinity, to cover our retreat in the event that Alphinaud and I attracted too much attention─but the approach of an imperial vehicle forced us to improvise."},{"name":"CID","text":"Don't be too disappointed─they did at least leave a message for you. Something along the lines of “don't do anything reckless,” if memory serves. Wise words."},{"name":"CID","text":"All right, the imperial patrol should be returning any moment now. You'd best be off."},{"name":"CID","text":"Good luck, <span class=\"highlight\">Forename</span>! May the Twelve keep you!"},{"name":"LIVIA","text":"You have spirit, that I will allow. Yet you struggle to the benefit of none, least of all yourself."},{"name":"MINFILIA","text":"Ugh!"},{"name":"LIVIA","text":"This “Echo” of yours intrigues us. We desire only to understand it. And for that, we need your help."},{"name":"LIVIA","text":"You wish to be rid of the eikons, do you not?"},{"name":"LIVIA","text":"You would have saved yourself a great deal of torment had you accepted our aid from the beginning."},{"name":"MINFILIA","text":"Ugh! Ugggh..."},{"name":"LIVIA","text":"Tell me everything, and I shall end it quickly. Refuse, and though you beg for death, you shall not have it."},{"name":"LIVIA","text":"Which will it be?"},{"name":"MINFILIA","text":"Ugggh! Ugh..."},{"name":"LIVIA","text":"As you wish, my dear Minfilia."},{"name":"LIVIA","text":"Unpleasant though it will be for all concerned, you leave us no choice but to employ more rigorous methods of study."},{"name":"LIVIA","text":"Be so kind as to deliver the prisoners to Castrum Meridianum."},{"name":"IMPERIALSOLDIER","text":"Yes, milady!"},{"name":"MINFILIA","text":"&lt;whimper&gt; &lt;moan&gt;"},{"name":"IMPERIALSOLDIER","text":"Part of the maintenance crew from Occidens, are you? I don't know what they teach you over there, but being an engineer does <span class=\"emphasis\">not</span> exempt you from saluting your superiors!"},{"name":"IMPERIALSOLDIER","text":"Why aren't you in uniform!? Dressed as you are, you're like to be mistaken for an adventurer!"},{"name":"IMPERIALSOLDIER","text":"Part of the maintenance crew from Occidens, you say? I don't know what they teach you over there, but being an engineer does <span class=\"emphasis\">not</span> exempt you from saluting your superiors!"},{"name":"IMPERIALSOLDIER","text":"Hm, that's a fine salute. Part of the maintenance crew from Occidens, are you? Welcome to Castrum Centri, engineer."},{"name":"IMPERIALSOLDIER","text":"Hm, that's a fine salute...but why aren't you in uniform? As you are, you're like to be mistaken for an adventurer!"},{"name":"IMPERIALSOLDIER","text":"What? Prisoners? Ah, you've heard the rumors, then. Yes, they're being held in the storage tower─but I <span class=\"emphasis\">strongly</span> suggest you pay them no mind."},{"name":"IMPERIALSOLDIER","text":"You were summoned here to work, not to gawp at Eorzea's defeated heroes. Now show a bit of enthusiasm, or I'll have you reported."},{"name":"IMPERIALSOLDIER","text":"What was that supposed to be? A salute? I'll have you know, being an engineer does <span class=\"emphasis\">not</span> give you license to be sloppy! Do it till you get it right!"},{"name":"IMPERIALSOLDIER","text":"Huh? Doesn't your senior officer have anything to say about your outfit? Not that I'm complaining, by the way─I for one would appreciate a bit more variety. I'm so used to seeing this uniform, I've caught myself saluting reflective surfaces."},{"name":"IMPERIALSOLDIER","text":"I'd best get back to my duties. The supplies aren't going to move themselves─and neither are the prisoners, come to that."},{"name":"IMPERIALSOLDIER","text":"Oh, my apologies! I didn't notice you there, so engrossed was I in my task. You'd be engrossed, too, had the tribunus commanded you to arrange for the prisoners to be transported."},{"name":"IMPERIALSOLDIER","text":"Ah, your spirited salute reminds me that, uniform or no, we are all proud soldiers of the Garlean Empire. Everything we do is for the greater glory of Garlemald, be it scrubbing the privy floor or arranging for prisoners to be transported."},{"name":"IMPERIALSOLDIER","text":"What prisoners do I speak of? ...You mean you haven't heard? Only the infamous “Scions of the Seventh Dawn,” captured by the tribunus herself! If you don't believe me, have a look in the storage tower when next you pass that way."},{"name":"IMPERIALSOLDIER","text":"The officers constantly tell me that I have the sloppiest salute in all the western lands, but in you I'd say I've finally met my match. Perhaps we could practice together?"},{"name":"IMPERIALSOLDIER","text":"Whoa... Where did you leave your uniform!? If one of the brass hats sees you, you'll be in for the dressing-down of your life!"},{"name":"IMPERIALSOLDIER","text":"Hm? Shouldn't I be at my post? &lt;sigh&gt; I suppose so, but such things don't seem to matter anymore. I've...I've fallen for one of the prisoners. She's all I can think about of late. Am I...am I a deviant for wanting her to salute me?"},{"name":"IMPERIALSOLDIER","text":"Greetings, comrade. Forgive me for asking, but you haven't visited the storage tower recently, have you? I only ask because I dropped something in there, and...um... Oh, who am I fooling!? I've fallen for one of the prisoners, all right!? I daresay you know the one I mean. ...Eh? The svelte blonde? Goodness, no!"},{"name":"IMPERIALSOLDIER","text":"It's the Lalafellin lass I'm smitten with! She's so adorable, it hurts! I want to sweep her up into my arms and squeeze her till my arms ache!<br>What do you reckon it would take to convince the centurion to lend me the key so I can see her?"},{"name":"IMPERIALSOLDIER","text":"No, no, no! You're doing it all wrong! Unless you can master a good old-fashioned imperial salute, you'll never amount to anything in this army. Take the centurion, for example: his every salute's the same. It's no wonder he's been entrusted with such responsibility. Which is probably why he's been trusted with the keys to the storage tower."},{"name":"IMPERIALSOLDIER","text":"Why are you not at your post? If you have business, salute me before opening your mouth."},{"name":"IMPERIALSOLDIER","text":"Unless you can explain why you are not in uniform, and during a period of heightened security, to boot, you have earned yourself time in a black cell."},{"name":"IMPERIALSOLDIER","text":"What's this? You need access to the storage tower? What business have you there?"},{"name":"IMPERIALSOLDIER","text":"What's this? You need access to the storage tower? What business have you there?"},{"name":"IMPERIALSOLDIER","text":"...At the tribunus's behest, you say? This is highly irregular, but it would not do to make my lady wroth. Take my identification key. See that it is returned when your errand is concluded."},{"name":"IMPERIALSOLDIER","text":"What mummery is this? You have just earned yourself a fortnight in a black cell. Report to detention at the end of your shift."},{"name":"BIGGS","text":"Security's tight, just as we expected. We're going to need a special key if we want to get past this bulkhead."},{"name":"MINFILIA","text":"No!"},{"name":"BIGGS","text":"Minfilia...and the rest! Thank goodness they're safe!"},{"name":"MINFILIA","text":"I am the one you want! Leave the others be!"},{"name":"MINFILIA","text":"If you harm my friends, I <span class=\"emphasis\">swear</span> I shall take my own life─and you shall answer to your mistress!"},{"name":"WEDGE","text":"&lt;gasp&gt; T-Tataru! We must do something!"},{"name":"BIGGS","text":"We risk letting the entire castrum know we're here."},{"name":"BIGGS","text":"Aye...you're right. We may not get a better chance."},{"name":"IMPERIALGUARD","text":"This is the third squadron. What is it?"},{"name":"IMPERIALGUARD","text":"...A reaper? Seized <span class=\"emphasis\">when</span>?"},{"name":"IMPERIALGUARD","text":"...And this came to light only NOW!?"},{"name":"IMPERIALGUARD","text":"The culprits will have left a trail. Take as many men as you need and scour the area! I want that reaper found!"},{"name":"BIGGS","text":"Now's our chance!"},{"name":"IMPERIALGUARD","text":"What the─!? Strike my last!"},{"name":"IMPERIALGUARD","text":"Eliminate the intruders!"},{"name":"TATARU","text":"&lt;whimper&gt; <span class=\"highlight\">Forename</span>! I was so scared!"},{"name":"MINFILIA","text":"It was foolish of you to come here. You might have been killed!"},{"name":"MINFILIA","text":"But...thank you. I shudder to think what might have happened had you not arrived when you did."},{"name":"PAPALYMO","text":"I say, did you not see Thancred anywhere? I'm beginning to fear for the fellow..."},{"name":"PAPALYMO","text":"To linger here shall yield us no answer. Let us away, ere the window to our liberty closes shut."},{"name":"LIVIA","text":"...What did you say? <span class=\"emphasis\">Escaped</span>?"},{"name":"LIVIA","text":"Then <span class=\"emphasis\">recapture them</span>! Fail and I shall have your head."},{"name":"LIVIA","text":"...And what have we here?"},{"name":"YSHTOLA","text":"...The tribunus herself, just as you said. You have the eye of an ahriman, Yda."},{"name":"YDA","text":"Well...she's kind of hard to miss in that showy armor of hers."},{"name":"LIVIA","text":"Accursed Scions... How did you slip our defenses?"},{"name":"YSHTOLA","text":"With unexpected ease, if truth be told. There chanced to be a commotion outside the castrum's walls which allowed us to avail ourselves of the comforts of your vehicle."},{"name":"YDA","text":"Y'shtola's just being polite. That was one of the most uncomfortable things I've <span class=\"emphasis\">ever</span> stowed away in. It's no wonder it's called the <span class=\"emphasis\">Phantom Train</span>─no passenger would be seen dead on it!"},{"name":"LIVIA","text":"So you scuttled in amidst the freight, like the vermin you are. I shall be sure to have words with our ratcatcher. Such negligence is unforgivable."},{"name":"YSHTOLA","text":"That is far from your most pressing concern. First, you must answer for your <span class=\"emphasis\">own</span> wrongdoing, Livia sas Junius."},{"name":"YSHTOLA","text":"'Twas you who led the raid on the Waking Sands─you who butchered unarmed men and women for the crime of being unworthy of capture."},{"name":"YDA","text":"You killed our friends! We'll never forgive you!"},{"name":"YSHTOLA","text":"Nor shall we suffer you to plague Eorzea a day longer. Betake you to your guard."},{"name":"IMPERIALGUARD","text":"More intruders! Protect the tribunus!"},{"name":"YSHTOLA","text":"Confound it! Yda, with me!"},{"name":"IMPERIALGUARD","text":"After them!"},{"name":"LIVIA","text":"Where is His Excellency?"},{"name":"IMPERIALGUARD","text":"In the hangar, my lady─in discussion with our guest!"},{"name":"LIVIA","text":"Alert him at once!"},{"name":"IMPERIALGUARD","text":"Yes, my lady!"},{"name":"LIVIA","text":"No! No, no, NO!"},{"name":"IMPERIALGUARD","text":"There they are! Fan out and surround them!"},{"name":"WEDGE","text":"Must...protect...Tataru! Biggs─I'm going in! See everyone to safety!"},{"name":"BIGGS","text":"No! Wedge─don't do it!"},{"name":"BIGGS","text":"Oh, no... <span class=\"highlight\">Forename</span>─hold them off! I'll look after Minfilia and Tataru!"},{"name":"IMPERIALSOLDIER","text":"Take the leader! Kill the rest!"},{"name":"IMPERIALSOLDIER","text":"What the─!?"},{"name":"MINFILIA","text":"Y'shtola!"},{"name":"YSHTOLA","text":"Pray forgive us our delay!"},{"name":"YDA","text":"Papalymo! Minfilia!"},{"name":"MINFILIA","text":"Yda!"},{"name":"PAPALYMO","text":"What took you so long!?"},{"name":"YDA","text":"Well, it's nice to see you too!"},{"name":"YSHTOLA","text":"The reunion must wait!"},{"name":"YDA","text":"Right! First things first!"},{"name":"PAPALYMO","text":"Yes, let's get back to being heavily outnumbered..."},{"name":"WEDGE","text":"Uwaaaaaah!"},{"name":"BIGGS","text":"You ditched your magitek armor!? Fool of a Lalafell!"},{"name":"WEDGE","text":"Well, excuse <span class=\"emphasis\">me</span>! She's all yours if you think you can do any better!"},{"name":"IMPERIALSOLDIER","text":"&lt;gasp&gt;"},{"name":"IMPERIALSOLDIER","text":"But there's no one in there!"},{"name":"CID","text":"This is Cid! Can you hear me!?"},{"name":"CID","text":"I need you to count to five, then jump! Understood!?"},{"name":"YSHTOLA","text":"One..."},{"name":"YDA","text":"Two!"},{"name":"PAPALYMO","text":"Three!"},{"name":"MINFILIA","text":"Four!"},{"name":"GAIUS","text":"I know not which is more pitiful: the charlatans who rule Eorzea..."},{"name":"GAIUS","text":"...or the masses that clamor for their implausible panaceas."},{"name":"GAIUS","text":"I see that which they cannot. This realm founders for want of a ruler with true power─the power to cast down eikons."},{"name":"GAIUS","text":"If you continue to deny this truth, it is the people who will suffer. Embrace reason."},{"name":"CID","text":"&lt;gasp&gt;"},{"name":"CID","text":"What in the seven hells─!?"},{"name":"ALPHINAUD","text":"Oh no... It's here!"},{"name":"MINFILIA","text":"Twelve preserve us... They finished it. Ultima Weapon..."},{"name":"ALPHINAUD","text":"So it has a name..."},{"name":"MINFILIA","text":"It is a relic of ancient Allag, excavated from its resting place deep beneath Ala Mhigo."},{"name":"MINFILIA","text":"The Allagans used it to crush primal and foe alike...and now the Garleans mean to do the same!"},{"name":"CID","text":"Damn you, Gaius!"},{"name":"ALPHINAUD","text":"Look! There, beside the Black Wolf!"},{"name":"ALPHINAUD","text":"An Ascian!"},{"name":"ALPHINAUD","text":"An overlord, no less. His garb attests to that."},{"name":"MINFILIA","text":"Lahabrea! It could only be him!"},{"name":"MINFILIA","text":"Thancred!"},{"name":"MINFILIA","text":"<span class=\"emphasis\">He</span> was Lahabrea...? No... No, this cannot be!"},{"name":"CID","text":"We have to go now! Hang on!"},{"name":"MINFILIA","text":"Thancred! NOOOOOO!"},{"name":"LAHABREAEORZEA","text":"Ahahaha... Muahahahahaha!"},{"name":"ALPHINAUD","text":"All that time, the enemy was beside me, and I never even suspected."},{"name":"ALPHINAUD","text":"And to think that it was I who suggested that Thancred investigate the Ascians! How could I have been so blind!?"},{"name":"ALPHINAUD","text":"Small wonder the enemy knew our every move─<span class=\"emphasis\">and</span> where to find us! Confound it all!"},{"name":"ALPHINAUD","text":"No... No, this is not the time for self-doubt. The Alliance leaders staked their hopes on the Scions, but now they believe us all dead or missing."},{"name":"ALPHINAUD","text":"When they learn of the Empire's new weapon, we cannot be certain what they will do."},{"name":"ALPHINAUD","text":"We must go and offer them what assurances we can that defeat is not inevitable!"},{"name":"MINFILIA","text":"Krile? This is Minfilia. I am in some haste, so forgive me if I seem brusque. The item I requested─is it ready? Wonderful! I am sorry to press, but we need it urgently. How soon can it be delivered?<br>...I am in your debt, my friend."},{"name":"ALPHINAUD","text":"The situation may have taken an ill turn..."},{"name":"ALPHINAUD","text":"But the battle is far from over. And so long as we stand together, there shall ever be hope of victory."},{"name":"ALPHINAUD","text":"The people of Eorzea falter for want of such hope. Let <span class=\"emphasis\">us</span> provide it. Let us bear to them the tidings that the Scions of the Seventh Dawn are returned!"},{"name":"ALPHINAUD","text":"Matters are coming to a head. I hope we can count on you."},{"name":"MINFILIA","text":"...My regards to Grandfather."},{"name":"MINFILIA","text":"I am ready. Let us pay a visit to the council of the Alliance leadership."},{"name":"RAUBAHN","text":"Hells take the Black Wolf and his new toy..."},{"name":"MERLWYB","text":"Rally all available forces. I want them ready to move upon my word."},{"name":"MERLWYB","text":"And relay to Slafyrsyn the order to sail. That is all."},{"name":"MERLWYB","text":"The Maelstrom stands ready. What of the Flames?"},{"name":"RAUBAHN","text":"Ready as we're like to be. I need only give the word to Roaille."},{"name":"KANESENNA","text":"Has there been no word from Ishgard?"},{"name":"RAUBAHN","text":"None. The dragons have got their tongues."},{"name":"KANESENNA","text":"Silent to the last. I was unwise to hope for better."},{"name":"MERLWYB","text":"What would stir the archbishop to open his holy mouth, if not this!? And he claims the Fury for his god... 'Tis bad comedy!"},{"name":"NANAMOULNAMO","text":"The Holy See has made its choice. We will proceed without its cooperation."},{"name":"NANAMOULNAMO","text":"I believe we are all acquainted with the terms of the Black Wolf's ultimatum."},{"name":"NANAMOULNAMO","text":"We must agree upon a course of action. Naught less than the fate of Eorzea hangs upon the decision of this council."},{"name":"RAUBAHN","text":"Van Baelsar claims to wield the power to smite primals."},{"name":"KANESENNA","text":"Should we yield to him, he pledges to rid the realm of its false gods. Yet offer resistance, and he swears that we shall share the primals' fate."},{"name":"MERLWYB","text":"Pardon me my bluntness, but I like not these choices."},{"name":"NANAMOULNAMO","text":"This is too great a decision for any one of our nations to make alone."},{"name":"NANAMOULNAMO","text":"Choose we surrender or resistance, we must answer as one, for if but one surrenders, the rest shall surely fall. Let us pray for the wisdom to do right by <span class=\"emphasis\">all</span> our peoples."},{"name":"MINFILIA","text":"Thancred's plight troubles us all, yet we cannot allow anything to come between us and our goal."},{"name":"MINFILIA","text":"So long as the Ultima Weapon exists, Eorzea will never know peace."},{"name":"MINFILIA","text":"Let us go to the Alliance leaders, <span class=\"highlight\">Forename</span>, and help them to make the right decision."},{"name":"ELYENORA","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Do you wish to proceed to your vessel?"},{"name":"Q2","text":"Proceed to the landing area?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"QIB","text":"Unbind Papalymo and Urianger!"},{"name":"QIB","text":"Defeat the enemy and rescue the Scions!"},{"name":"QIB","text":"Defeat the enemy and escape from Castrum Centri!"},{"name":"MINFILIA","text":"You came!"},{"name":"URIANGER","text":"Unbind us, <span class=\"highlight\">Forename</span>. Together we may yet win free."},{"name":"PAPALYMO","text":"<span class=\"highlight\">Forename</span>! Get these shackles off us, quickly!"},{"name":"IMPERIALSOLDIER","text":"Take them, whatever the cost!"},{"name":"IMPERIALSOLDIER","text":"All units, to emergency stations! Do <span class=\"emphasis\">not</span> let the prisoners escape!"},{"name":"URIANGER","text":"This infernal creation is shielded by energies not its own."},{"name":"PAPALYMO","text":"Whatever is generating its shield must be near! Find it, <span class=\"highlight\">Forename</span>!"},{"name":"PAPALYMO","text":"Ack! There's no end to them!"},{"name":"URIANGER","text":"We labor in vain! Till the beast be divested of its shield, our blows shall not find their mark."},{"name":"IMPERIALGUARD","text":"You're not getting away! Bring forth the colossus!"},{"name":"BIGGS","text":"What in the hells...? A new design!"},{"name":"MINFILIA","text":"Have care!"},{"name":"URIANGER","text":"Ware the unknown foe."},{"name":"PAPALYMO","text":"So that's a colossus, is it!? More like a colossal waste of iron!"},{"name":"PAPALYMO","text":"Ungh... Confound it..."},{"name":"URIANGER","text":"Mine eyes...darken..."},{"name":"WEDGE","text":"Tataru... Forgive me..."},{"name":"BIGGS","text":"I...I couldn't... Ungh..."}],"reward":{"gil":3313,"xp":25850},"reqs":{"jobs":[{"lvl":46,"id":130}],"quests":[66541]},"next":[66058]},"partials":[{"type":"npc","id":"1006555","obj":{"i":1006555,"n":"Cid","l":67,"q":3}},{"type":"npc","id":"1006573","obj":{"i":1006573,"n":"Minfilia","l":40,"q":2}},{"type":"npc","id":"1004433","obj":{"i":1004433,"n":"Elyenora","l":40,"q":6,"t":"Airship Ticketer"}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1006531","obj":{"i":1006531,"n":"Glaumunt","l":67,"q":5}},{"type":"npc","id":"1007537","obj":{"i":1007537,"n":"Cid","l":67,"q":1}},{"type":"item","id":"6223","obj":{"i":6223,"n":"Mended Imperial Pot Helm","l":1,"c":40128,"t":34,"p":100}},{"type":"item","id":"6224","obj":{"i":6224,"n":"Mended Imperial Short Robe","l":1,"c":42345,"t":35,"p":100}},{"type":"quest","id":"66541","obj":{"i":66541,"n":"Every Little Thing She Does Is Magitek","g":1,"l":"Mor Dhona","s":239}},{"type":"quest","id":"66058","obj":{"i":66058,"n":"The Black Wolf's Ultimatum","g":1,"l":"Ul'dah","s":241}}]}