{"quest":{"name":"Lady of the Vortex","location":"Gridania","id":66055,"patch":2.0,"sort":226,"icon":100161,"eventIcon":71201,"issuer":1006492,"target":1006730,"involved":[1000106,1004433,1007690],"genre":1,"journal":["With Cid's modifications now installed, the <span class=\"emphasis\">Enterprise</span> is finally ready to make the journey to the Howling Eye.","Stirred by the familiar roar of the <span class=\"emphasis\">Enterprise</span>'s engines, Cid endeavors to recall his past; try though he might, he is unable to navigate the dark corridors of his mind alone. But what if he had company? Wielding the power of the Echo, you guide him through a series of forgotten memories, detailing the path that led the once-loyal engineer to turn his back on Garlemald and flee to Eorzea. When you finally awake from the visions, Cid triumphantly declares that he remembers everything─his name, his people, and his purpose. Shortly thereafter, he guides the <span class=\"emphasis\">Enterprise</span> through Garuda's wall of wind without incident, delivering you to the Howling Eye at long last. Speak with Alphinaud before proceeding into the primal's sanctuary.","Alphinaud declares that the end is at hand─be it Garuda's or your own. Strike fear into the hearts of beastmen across Eorzea by defeating the Lady of the Vortex.<br><br>※Challenge the Howling Eye with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the trial's entrance point.","Amidst the whirling winds, you succeed in striking down the Lady of the Vortex, only to see her rise once more, reinvigorated by the belief of her Ixali disciples. Yet the beastmen's prayers come to naught when Garuda's attempt to temper you fails, prompting a mysterious force to tear a Crystal of Light from her breast. It is at this moment that Gaius van Baelsar enters the fray, seemingly bent on goading the defeated primal into one final act of defiance. Garuda duly obliges, slaughtering her captive kobolds and Amalj'aa, whose cries of agony serve to summon their own patron deities. As Garuda prepares to consume the aether of her lesser brethren, the Black Wolf calls forth an unknown imperial weapon which summarily dispatches and seemingly <span class=\"emphasis\">absorbs</span> all three primals. Wholly unprepared to face this awe-inspiring new foe, you have no choice but to flee for your life.","Safely back aboard the <span class=\"emphasis\">Enterprise</span>, with the imperial forces now fast-diminishing specks upon the horizon, Cid and Alphinaud begin to discuss how to address this grave new threat. Believing the best course of action is to reform the Scions of the Seventh Dawn, they decide to return to the Waking Sands. Having safely arrived in Ul'dah, speak with Alphinaud prior to continuing on to Vesper Bay.","Alphinaud reiterates that the beast tribes and their primals are no longer a threat, and that all efforts must now be focused upon destroying the Empire's ultimate weapon. But having seen what you have seen, it is plain that this task will ask far more of you than any you have undertaken thus far. For Eorzea's sake, you must hope that you are up to the challenge."],"objectives":["Speak with Alphinaud.","Confront Garuda in the Howling Eye.","Speak with Alphinaud."],"dialogue":[{"name":"CID","text":"According to my tests, the device is now functioning in perfect harmony with the crystal─meaning we can leave whenever you're ready."},{"name":"CID","text":"But you must understand: tests can only tell one so much."},{"name":"CID","text":"Until we approach the Howling Eye─until we attempt to breach the barrier itself...I cannot be sure that this will work."},{"name":"CID","text":"I think it only fair to tell you that there is a small but statistically significant chance that the crystal could trigger a massive..."},{"name":"CID","text":"Hmmm... Mayhap it is better that we remain positive."},{"name":"CID","text":"<span class=\"highlight\">Forename</span>, I want to thank you. For reuniting me with my ship, for trusting in me to develop this plan...for everything. You've helped me to rediscover a part of myself I'd forgotten. I am not the man I once was, and I do not know if I ever shall be...but I <span class=\"emphasis\">do</span> know one thing: this feels right."},{"name":"CID","text":"...My apologies for the sudden outpouring of sentiment. I would have waited until after the mission, but...well, you understand."},{"name":"CID","text":"There...she's ready..."},{"name":"ALPHINAUD","text":"Ah, she stirs..."},{"name":"ALPHINAUD","text":"To Coerthas! And an audience with the harpy queen Garuda!"},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Enterprise</span>...engage!"},{"name":"CID","text":"Phew..."},{"name":"CID","text":"Damn it!"},{"name":"CID","text":"I...I once flew in this airship. And I was not alone."},{"name":"CID","text":"There were adventurers on board...adventurers like you."},{"name":"CID","text":"Just how long have I worn these damn goggles?"},{"name":"CID","text":"Ah, yes. I fancied myself a trendsetter in my younger days."},{"name":"CID","text":"The young prodigy, admired by all...exactly like his father."},{"name":"CID","text":"Born and raised in Garlemald..."},{"name":"CID","text":"It was only natural that the precocious young student should become an engineer. Had his father not done the same?"},{"name":"CID","text":"Father... When did we stop seeing eye to eye?"},{"name":"CID","text":"When did Meteor become your everything, and your loved ones cease to matter?"},{"name":"CID","text":"You abandoned us all. But he was there for me, Father─there for me when you were not."},{"name":"CID","text":"Though he proved no better in the end. Gaius was just another man with an all-consuming obsession."},{"name":"CID","text":"And so I ran─left the Empire behind and came to Eorzea, where I built the Ironworks."},{"name":"CID","text":"Ah, yes! It was then that I first donned these goggles."},{"name":"CID","text":"Eorzea opened my eyes. It was home to so many manner of people, each with their own hopes and dreams. People worth saving. And so I fought beside them."},{"name":"CID","text":"I wanted to prove that my knowledge could serve a nobler purpose."},{"name":"CID","text":"I wanted to prove that there was another way..."},{"name":"CID","text":"And it all began that day, when I found my new home..."},{"name":"CID","text":"I had forgotten how wonderful it was. The wind in your hair, the endless sky..."},{"name":"CID","text":"That light─it was you, wasn't it?"},{"name":"CID","text":"It's surprising how few people know this, but <span class=\"emphasis\">all</span> pureblood Garleans have a third eye."},{"name":"CID","text":"Perhaps mine helped me recognize you─or perhaps it was just a lucky guess."},{"name":"CID","text":"The <span class=\"emphasis\">Enterprise</span> was made for this! To carry Eorzea's protectors into battle!"},{"name":"CID","text":"I am proud to be able to call her my own."},{"name":"ALPHINAUD","text":"Cid─what exactly do you remember?"},{"name":"CID","text":"Alphinaud, my boy─sorry to have been such a burden."},{"name":"CID","text":"I remember everything..."},{"name":"CID","text":"My name, my people, and my purpose. Everything."},{"name":"CID","text":"Come! It would be rude to keep Garuda waiting!"},{"name":"CID","text":"It took a while for the memory to return, but I remember you."},{"name":"CID","text":"The floating isle, van Darnus... We ended it, that day─or so we thought."},{"name":"CID","text":"Listen─let's keep this between the two of us, for the time being."},{"name":"CID","text":"If word got out that one of the Warriors of Light had returned, the eyes of the world would soon be upon us─our enemies' included. And that's the kind of attention we could well do without."},{"name":"CID","text":"What, isn't it enough that <span class=\"emphasis\">I</span> know the truth?"},{"name":"CID","text":"Don't worry. A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents won't go unnoticed for long. Someday, they <span class=\"emphasis\">will</span> remember you─and you'll never know another moment's peace!"},{"name":"CID","text":"There, up ahead! Ready, old friend?"},{"name":"CID","text":"Hah! Some things never change! We're going in!"},{"name":"ALPHINAUD","text":"All our efforts...all our travails...all of it was for this."},{"name":"ALPHINAUD","text":"Make ready, <span class=\"highlight\">Forename</span>, for the end is nigh─be it hers or our own."},{"name":"ALPHINAUD","text":"Beyond those gates awaits our foe. Are you prepared to meet with her?"},{"name":"GARUDA","text":"(-???-)Who dares intrude upon my sanctuary!?"},{"name":"GARUDA","text":"(-???-)Your insolence shall not go unpunished, landwalkers!"},{"name":"ALPHINAUD","text":"Twelve preserve...she's...she's <span class=\"emphasis\">huge</span>!"},{"name":"CID","text":"As I live and breathe..."},{"name":"CID","text":"Over there─look."},{"name":"CID","text":"Amalj'aa and kobold prisoners. But why would the Ixal bring them here...?"},{"name":"GARUDA","text":"Heehee HAHA hahaha HEEHEE haha HEEEEEE!!!"},{"name":"GARUDA","text":"Wherefore come you hither, foolish mortals!?"},{"name":"ALPHINAUD","text":"Garuda! We are come to put an end to your reign of terror!"},{"name":"GARUDA","text":"Hear you this blasphemy, my children? These landwalkers would bring me low!"},{"name":"GARUDA","text":"You who are bound to crawl upon the earth should revere me─FOR I AM THE WIND!"},{"name":"CID","text":"Did we not take to the skies, and slip your defenses!? We are bound by <span class=\"emphasis\">nothing</span>, Garuda!"},{"name":"GARUDA","text":"You think your playthings give you strength?"},{"name":"GARUDA","text":"They will not help you here, landwalker. This is <span class=\"emphasis\">my</span> realm, where none can challenge my supremacy! Struggle though you may─I shall slake the roots with your blood, and festoon the canopy with your ENTRAILS! HAHAHAHAHAAA!"},{"name":"IXALGURU","text":"Squaaawk! Slay the unfeathered ones, we shall! As an offering to Garuda, they will serve!"},{"name":"CID","text":"Leave the Ixal to us, <span class=\"highlight\">Forename</span>! We will keep them distracted while you deal with her!"},{"name":"ALPHINAUD","text":"Do not fail, <span class=\"highlight\">Forename</span>! Remember: you fight for the Scions! For Eorzea!"},{"name":"GARUDA","text":"This worm would die by mine own hand! Come, then...I shall grant you that which you seek!"},{"name":"GARUDA","text":"No... Nooo! NO! NO!!!"},{"name":"CID","text":"What!? How in the hells─!?"},{"name":"GARUDA","text":"HAHAHAHAHAAA! This...is...MY REALM! You have no hope here! None! NONNNE!!!"},{"name":"GARUDA","text":"Did you truly believe you could defy a god, landwalkers!?"},{"name":"GARUDA","text":"My power is limitless! My children legion!"},{"name":"GARUDA","text":"And they have rendered unto me a wealth of crystals."},{"name":"GARUDA","text":"Their gifts sustain me, their faith empowers me!"},{"name":"GARUDA","text":"None save my children will escape the reckoning, mortals! And those who would use <span class=\"emphasis\">my</span> crystals to waken the rest shall realize the folly of their faith!"},{"name":"GARUDA","text":"Then all shall worship none but me! The one <span class=\"emphasis\">true</span> god! HEE HEE HEE HEE HEEEEEE!!!"},{"name":"ALPHINAUD","text":"...Of course! <span class=\"emphasis\">Worship</span>! So long as the Ixal keep praying, she will never fall!"},{"name":"CID","text":"Then let's stop them!"},{"name":"ALPHINAUD","text":"Ugh!"},{"name":"GARUDA","text":"HAHA hahaha HEEHEE heehee HAHAHA!!!<br>No harm will come to you, my children!"},{"name":"GARUDA","text":"This is only the beginning, landwalkers! All who oppose me shall suffer for their defiance!"},{"name":"GARUDA","text":"Soon, the worms of the forest shall receive my judgment! The desert vermin next─their walls of stone will not shield them from the tempest!"},{"name":"GARUDA","text":"And then will I take vengeance on the sea lice! Their wooden boats cannot outrun the wind!"},{"name":"GARUDA","text":"Tremble, mortals, for I shall visit you all in time! And all shall be mine! ALL MIIINE!!!"},{"name":"GARUDA","text":"You, landwalker─you who <span class=\"emphasis\">dared</span> to raise your hand against me─you shall be the first to pay for your sins! Not with your death─but with your LIFE!"},{"name":"GARUDA","text":"You will serve me, landwalker...to your last breath!"},{"name":"GARUDA","text":"No, NO!!! I claimed you! You should be MINE!"},{"name":"GARUDA","text":"What...what <span class=\"emphasis\">are</span> you? What have you done to me!?"},{"name":"GARUDA","text":"No mortal should possess such power! This...this is impossible!"},{"name":"GARUDA","text":"Why do you not tremble at my might? Why do you not beg for mercy!? Why do you not DIE!?"},{"name":"ALPHINAUD","text":"We've done it!"},{"name":"IXAL","text":"Squaaak! Impossible, it is!"},{"name":"IXAL","text":"Garuda, kill you all!"},{"name":"GAIUS","text":"Is that all!?"},{"name":"GAIUS","text":"O Lady of the Vortex! O mighty Garuda!"},{"name":"GAIUS","text":"Of all primals, the most terrible. I say again...IS─THAT─ALL!?"},{"name":"CID","text":"Gaius!?"},{"name":"GAIUS","text":"Ah, Cid, my boy. You look well─for one who has forsaken <span class=\"emphasis\">kin</span> and country. I wonder, what else you will forsake before the day is done."},{"name":"CID","text":"What!?"},{"name":"GAIUS","text":"What exactly did you hope to accomplish here this day?"},{"name":"CID","text":"I..."},{"name":"GAIUS","text":"Well, I shall accomplish far more!"},{"name":"GARUDA","text":"...Is that all? IS THAT ALL!?"},{"name":"GARUDA","text":"Insolent mortal! I shall make you suffer!"},{"name":"GARUDA","text":"That foul stench... I see now... <span class=\"emphasis\">She</span> has touched you!"},{"name":"GARUDA","text":"Very well..."},{"name":"CID","text":"Seven hells, does she still mean to fight!?"},{"name":"ALPHINAUD","text":"What is she─ Twelve preserve, she cannot mean to─"},{"name":"AMALJAA","text":"(-Amalj'aa-)O Lord of the Inferno! Almighty Ifrit! Grant us succor in our hour of need!"},{"name":"KOBOLD","text":"(-Kobolds-)Save us, Titan, Lord of Crags! Ah, it hurts us so, the pain, the pain..."},{"name":"ALPHINAUD","text":"No... No, this is all wrong..."},{"name":"CID","text":"Stop gawping, boy! We must <span class=\"emphasis\">run</span>!"},{"name":"GARUDA","text":"Surrender yourselves unto me... I would feast upon your aether. NONE SHALL STAND AGAINST THE WIND!"},{"name":"GAIUS","text":"BEAR WITNESS TO THE GLORY OF THE EMPIRE!"},{"name":"GAIUS","text":"It is <span class=\"emphasis\">you</span> who will suffer, Garuda!"},{"name":"GAIUS","text":"Ancient Allag had ways of dealing with your kind. Now, look on their ultimate weapon, eikon, and despair!"},{"name":"GARUDA","text":"No... Nooo! NOOO!"},{"name":"GAIUS","text":"Magnificent! It exceeds all expectation!"},{"name":"LAHABREAEORZEA","text":"With each primal it consumes, it grows more powerful. A marvel, is it not?"},{"name":"GAIUS","text":"Such is the fate of those who oppose the Empire!"},{"name":"GAIUS","text":"There will be no Warriors of Light to save you this time."},{"name":"GAIUS","text":"If your leaders are as wise as they are reported, they will surrender."},{"name":"GAIUS","text":"Your skills are impressive, but they will not be enough."},{"name":"ALPHINAUD","text":"Twelve have mercy! What chance have we against such an ungodly creation!?"},{"name":"ALPHINAUD","text":"And who was that armored devil!?"},{"name":"CID","text":"That was Gaius van Baelsar, legatus of the XIVth Imperial Legion, and supreme commander of the Garlean invasion force in Eorzea."},{"name":"ALPHINAUD","text":"Of course, the Black Wolf─how could I not realize? Grandfather mentions him in his journal!"},{"name":"CID","text":"I was never so naive as to think the man would abandon his ambitions, but these developments are beyond my worst expectations..."},{"name":"CID","text":"What have you been doing these past five years? How could something of this magnitude have escaped the Alliance's attention?"},{"name":"ALPHINAUD","text":"We heard no whispers, saw no signs. In the wake of the Calamity, the Empire seized land and built outposts, but that was the extent of their aggression."},{"name":"CID","text":"Damn it, Gaius, where in the seven hells did you find that thing?"},{"name":"ALPHINAUD","text":"It has been a day of unexpected developments, but the fact remains: Garuda is no longer a threat."},{"name":"ALPHINAUD","text":"While I take no comfort in the manner of her downfall, it <span class=\"emphasis\">does</span> mean that we may safely put the matter of the primals to one side─for the time being, at least."},{"name":"CID","text":"Which just leaves the matter of Gaius's new toy."},{"name":"ALPHINAUD","text":"Indeed. That weapon poses the greatest threat to Eorzea. It must be destroyed."},{"name":"ALPHINAUD","text":"But first, we must needs find out all we can."},{"name":"ALPHINAUD","text":"Let us make for Vesper Bay. We shall rebuild the Scions."},{"name":"ALPHINAUD","text":"All is not yet lost, my friend─for we bear the light, and shall surely lead our people from the darkness."},{"name":"ALPHINAUD","text":"Well, that was an experience I would rather not have again."},{"name":"ALPHINAUD","text":"Something has been troubling me, <span class=\"highlight\">Forename</span>. Shortly before the Black Wolf took center stage, when Garuda attempted to claim you as her own, I could have sworn I saw..."},{"name":"ALPHINAUD","text":"Ah, but I'm sure I was mistaken. In times of great stress, the evidence of the eye is apt to be misread by even the most inquiring mind. Forget I mentioned it."},{"name":"ALPHINAUD","text":"Returning to the subject of our earlier discussion, we may consider the matter of the primals closed until further notice. No beast tribe will <span class=\"emphasis\">dare</span> summon their god so long as that weapon exists."},{"name":"ALPHINAUD","text":"Truly, a more effective deterrent I could not imagine. It almost seems a shame to plot its destruction..."},{"name":"CID","text":"You know, it's not easy guiding the <span class=\"emphasis\">Enterprise</span> through a ceaselessly swirling wall of wind. I would rather not risk our lives again until you're sure─meaning absolutely <span class=\"emphasis\">certain</span>─that you're ready. Are you?"},{"name":"Q2","text":"Travel to the Howling Eye?"},{"name":"LIONNELLAIS","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Do you wish to proceed to your vessel?"},{"name":"Q3","text":"Proceed to the landing area?"},{"name":"ELYENORA","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Do you wish to proceed to your vessel?"},{"name":"Q4","text":"Proceed to the landing area?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"}],"reward":{"gil":3208,"items":[{"id":27643,"one":1},{"id":27657,"one":1},{"id":2832,"one":1},{"id":5826,"one":1}],"xp":24380,"instance":20003},"reqs":{"jobs":[{"lvl":44,"id":130}],"quests":[66511]},"next":[66056]},"partials":[{"type":"npc","id":"1006492","obj":{"i":1006492,"n":"Cid","l":52,"q":3}},{"type":"npc","id":"1006730","obj":{"i":1006730,"n":"Alphinaud","l":40,"q":2}},{"type":"npc","id":"1000106","obj":{"i":1000106,"n":"Lionnellais","l":52,"q":6,"t":"Airship Ticketer"}},{"type":"npc","id":"1004433","obj":{"i":1004433,"n":"Elyenora","l":40,"q":6,"t":"Airship Ticketer"}},{"type":"npc","id":"1007690","obj":{"i":1007690,"n":"Alphinaud","l":459,"q":1}},{"type":"item","id":"27643","obj":{"i":27643,"n":"Altered Woolen Hat","l":43,"c":41055,"t":34}},{"type":"item","id":"27657","obj":{"i":27657,"n":"Altered Mythril Chain Coif","l":44,"c":40051,"t":34}},{"type":"item","id":"2832","obj":{"i":2832,"n":"Woolen Cavalier's Hat","l":44,"c":41128,"t":34}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"instance","id":"20003","obj":{"i":20003,"n":"The Howling Eye","c":61804,"t":"Trials","min_lvl":44,"max_lvl":46}},{"type":"quest","id":"66511","obj":{"i":66511,"n":"Better Late than Never","g":1,"l":"Gridania","s":225}},{"type":"quest","id":"66056","obj":{"i":66056,"n":"Reclamation","g":1,"l":"Ul'dah","s":227}}]}