{"quest":{"name":"Hearts in the Sand","location":"Gridania","id":66059,"patch":2.5,"sort":74,"icon":100384,"eventIcon":71221,"issuer":1011732,"target":1011734,"genre":196,"journal":["Hortefense would have you assist his man in Ul'dah to track down a traveling trader.<br>※This quest is available for a limited time only.","Hortefense dispatches you to Ul'dah to assist his subordinate in sifting the sands for love gone astray. He bids you meet with the House Valentione emissary there, who will introduce you to one of the ladies who requires your services.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The <span class=\"alternative-container\"><span class=\"alternative\">troubled</span><span class=\"alternative\">flustered</span></span> maiden explains that the object of her affections is a traveling trader, who has selected a most inopportune time to head out into the desert. The only clue to his destination is a snippet of half-heard conversation: the lady recalls him mentioning <span class=\"alternative-container\"><span class=\"alternative\">“copper”</span><span class=\"alternative\">“gates”</span><span class=\"alternative\">a “king”</span><span class=\"alternative\">a “mine”</span><span class=\"alternative\">a “saloon”</span><span class=\"alternative\">the Sunway</span></span> while discussing his route with a fellow merchant. She hands you a tearstained love letter and bids you locate her darling, that you might deliver it to him.<br><br>※Please note that the trader you seek will not be marked on the map, nor will any identifying symbol appear above the character's head. Share your information with other players, and try to find him.","You hand the letter to <span class=\"alternative-container\"><span class=\"alternative\">Shashagun</span><span class=\"alternative\">Wowotazi</span></span> in <span class=\"alternative-container\"><span class=\"alternative\">Black Brush Station</span><span class=\"alternative\">Horizon</span></span>, who recognizes the hand and scent of his sweetheart. He vows to return to Ul'dah forthwith, to repay his darling for her heartfelt gift. Follow him back to the city, and report your success to the emissary.","You report to the emissary, who welcomes you with open arms. Thanks to your efforts, the <span class=\"alternative-container\"><span class=\"alternative\">troubled</span><span class=\"alternative\">flustered</span></span> maiden is <span class=\"alternative-container\"><span class=\"alternative\">troubled</span><span class=\"alternative\">flustered</span></span> no more. However, there is less welcome news for Hortefense─the “noble lady of Ishgard” for whom he searches has not been found in Thanalan. Perhaps he might have more luck hunting a little closer to home?"],"objectives":["Speak with the House Valentione emissary in Ul'dah.","Locate the traveling trader and give him the lumpy envelope.","Report to the House Valentione emissary in Ul'dah."],"dialogue":[{"name":"HORTEFENSE","text":"My man in Ul'dah has met with a similarly sticky situation: a number of traders have picked a most inopportune time to go on their travels, leaving their lovers bereft. Sadly, my assistant has met with no more success than I in tracking down the missing men."},{"name":"HORTEFENSE","text":"Prithee go to him, and see if you can make head or tail─or better yet, both─of the information his petitioners can provide. You shall find him at the Ruby Road Exchange. I shall send word to him of your imminent arrival: he will be gratified to know that succor is on its way!"},{"name":"HORTEFENSE","text":"Prithee go to my man in Ul'dah, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>, and offer him your assistance. Let it be the heat of the deserts of Thanalan, and not their desolation, that finds its way into the people's hearts!"},{"name":"MISSIONARY00523","text":"So you're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> Ser Hortefense sent to assist me, are you? Let's see if you're as shrewd as he claims. Wait right here─I'll fetch the girl."},{"name":"GIRLA00523","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, you've got to help me! It's Valentione's Day, and me old feller's nowhere to be found!"},{"name":"GIRLA00523","text":"I don't reckon nothing's happened to him─he's always going missing. Me darling's a trader, you see. Going to get himself on the Syndicate one day, but till then, he's out plying the trade routes. Sometimes he'll be gone for weeks, then turn up on me doorstep out of the blue, laden with presents!"},{"name":"GIRLA00523","text":"But the minute I try to give <span class=\"emphasis\">him</span> something, he bloody well disappears again! Here's the letter I wrote him─poured me heart and soul into it, I did. Slipped in a little chunk of topaz and all. If you could track him down and hand it over to him, I'd be ever so grateful!"},{"name":"GIRLA00523","text":"...Did he say where he was going? Not bloody likely─trade secrets, ain't it? I did hear him talking to a merchant friend of his before he left, though─something to do with “copper.” Does that mean anything to you?"},{"name":"GIRLA00523","text":"...Did he say where he was going? Not bloody likely─trade secrets, ain't it? I did hear him talking to a merchant friend of his before he left, though─something to do with some “gates.” Does that mean anything to you?"},{"name":"GIRLA00523","text":"...Did he say where he was going? Not bloody likely─trade secrets, ain't it? I did hear him talking to a merchant friend of his before he left, though─something to do with a “king.” Does that mean anything to you?"},{"name":"GIRLA00523","text":"I know it's a lot to ask, but if you could find me darling and give him me letter, I'd be much obliged. Why, if he don't get it, he might die of heartbreak! Or even worse, go broke! Our future happiness depends on you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"GIRLB00523","text":"Oh, hello. Are you the adventurer who is helping the Ishgardian emissaries deliver presents? Thank you for offering your assistance. The gentleman here has been ever so kind, but sadly he seems woefully ill equipped to locate my darling."},{"name":"GIRLB00523","text":"My love is a highly successful trader, always traveling about Thanalan, negotiating with his clients. Why, he's out there now, somewhere in the desert... All alone... Ah, but it breaks my heart to think of him like that on this day of romance! He must know that he is loved!"},{"name":"GIRLB00523","text":"I stayed up all night to draft this letter. The words simply poured out of my heart and settled on the page! Would you be able to deliver it for me? Be careful how you hold it─I put a small piece of topaz in the envelope. A token of my most heartfelt wish..."},{"name":"GIRLB00523","text":"...Did he say where he might be going? Not to me. Not directly, anyway. I did overhear something of his conversation with another trader, the day before he departed─something about a “mine.” I'm afraid that's all I remember..."},{"name":"GIRLB00523","text":"...Did he say where he might be going? Not to me. Not directly, anyway. I did overhear something of his conversation with another trader, the day before he departed─something about a “saloon.” I'm afraid that's all I remember..."},{"name":"GIRLB00523","text":"...Did he say where he might be going? Not to me. Not directly, anyway. I did overhear something of his conversation with another trader, the day before he departed─something about the Sunway. I'm afraid that's all I remember..."},{"name":"GIRLB00523","text":"Forgive me for placing this burden on you, but I would be ever so grateful if you could find my darling, and hand him my letter. I cannot bear the thought of my beloved spending Valentione's Day alone, without a word of love to soothe his aching heart!"},{"name":"MISSIONARY00523","text":"Is there anything more beautiful than a woman in love? Gladly would I sift through every grain of sand in the desert to reunite her with her darling! Yet without some firm idea of where to begin the search, I fear the man may not be found before the festival is over."},{"name":"MISSIONARY00523","text":"If only we had a better idea as to his destination... Perhaps your fellow adventurers might have gleaned some other clue from the lady's words? Pray speak with them─there must be at least one among your number who knows where the man can be found."},{"name":"MISSIONARY00523","text":"The reputation of House Valentione rests on your shoulders, adventurer. Should you fail in this mission, the very foundations of our house might crumble, and our honor collapse! You must find this man, or die trying!"},{"name":"SYSTEM","text":"During this quest, the location of the traveling trader will not be marked on the map, nor will an identifying marker appear above the character's head. Speak with other players and share your information, and try to find him!"},{"name":"MISSIONARY00523","text":"The missing trader was heard speaking of “copper” before he set out...though I'm afraid it means less than a little to me, stranger to these lands that I am. Does the word give <span class=\"emphasis\">you</span> any inkling as to where the man might be found?"},{"name":"MISSIONARY00523","text":"The missing trader was heard speaking of “gates” before he set out...though I'm afraid it means less than a little to me, stranger to these lands that I am. Does the word give <span class=\"emphasis\">you</span> any inkling as to where the man might be found?"},{"name":"MISSIONARY00523","text":"The missing trader was heard speaking of a “king” before he set out...though I'm afraid it means less than a little to me, stranger to these lands that I am. Does the word give <span class=\"emphasis\">you</span> any inkling as to where the man might be found?"},{"name":"MISSIONARY00523","text":"The missing trader was heard speaking of a “mine” before he set out...though I'm afraid it means less than a little to me, stranger to these lands that I am. Does the word give <span class=\"emphasis\">you</span> any inkling as to where the man might be found?"},{"name":"MISSIONARY00523","text":"The missing trader was heard speaking of a “saloon” before he set out...though I'm afraid it means less than a little to me, stranger to these lands that I am. Does the word give <span class=\"emphasis\">you</span> any inkling as to where the man might be found?"},{"name":"MISSIONARY00523","text":"The missing trader was heard speaking of a “Sunway” before he set out...though I'm afraid it means less than a little to me, stranger to these lands that I am. Does the word give <span class=\"emphasis\">you</span> any inkling as to where the man might be found?"},{"name":"LOVER00523","text":"You're an adventurer, aren't you? If you're looking for a trade, I'm afraid you've come to the wrong feller─I only deal wholesale. ...What!? You think I'm the “darling” you've been searching for?"},{"name":"LOVER00523","text":"Oh, you mean <span class=\"emphasis\">her</span> darling! You had me worried there for a minute, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">lad</span></span>. Aye, I'm your man, alright. I'd recognize that handwriting anywhere, and that scent... Ahhh! Oh, and what's this in the envelope─a little bit of topaz? She's a girl after my own heart!"},{"name":"LOVER00523","text":"For a few years now, it's been a tradition in Ul'dah to send some kind of precious stone with your Valentione's Day letters. Something the Miners' Guild dreamed up, and not a bad little gil–spinner, either. I wish I'd thought of something like it myself."},{"name":"LOVER00523","text":"The way they've set it up, all the different stones have got different meanings. And if I'm not mistaken─which I'm not─topaz stands for “prosperity.” By giving me this, she's wishing me success in all my commercial transactions."},{"name":"LOVER00523","text":"And I think her wish is already coming true. Why, I've just signed and sealed my biggest deal in years! I'll head back to Ul'dah to give her my thanks, and a ruby as big as my fist! Thanks to you, too, adventurer, for coming all this way to find me─you've made me a very happy man!"},{"name":"LOVER00523","text":"You're an adventurer, aren't you? Sorry, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">lad</span></span>, but I'm not that kind of trader─I only deal wholesale. ...You've got a letter for me?"},{"name":"LOVER00523","text":"Let's see... “From your darling”... Begging your pardon, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">lad</span></span>, but <span class=\"emphasis\">my</span> darling's handwriting doesn't look anything like that, and that ghastly fragrance... Pooh! I think you must have got me mixed up with somebody else."},{"name":"SYSTEM","text":"This is not the trader you are looking for. Try searching somewhere else."},{"name":"MISSIONARY00523","text":"I've been waiting for you, adventurer! It seems Ser Hortefense's judgment was sound─you truly are a most discerning <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> indeed. Pray observe the fruits of your labor..."},{"name":"MISSIONARY00523","text":"As you can well see, the lady's plea has been answered. My heart is afire to see such affection─whether through joy or jealousy, I know not...and care not! All that matters is that two more souls have found love this day─a love that could not have found its mark without your guidance."},{"name":"MISSIONARY00523","text":"Pray return to Lord Hortefense, and tell him that our obstacles in Ul'dah are overcome. Oh, and could I ask you to relay a further message? Please inform him that I have as yet found no trace of the lady he seeks."},{"name":"MISSIONARY00523","text":"I am sure he will be disappointed by the news, but hardly surprised. Ser Hortefense seeks a lady of the Ishgardian nobility, whom he met just once many years ago, and has been searching for ever since. Halone knows what such a lady would be doing all the way down here in Thanalan."},{"name":"MISSIONARY00523","text":"But at least one love has been found this day, and it is all thanks to you, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>! The doors of House Valentione shall ever remain open to you!"},{"name":"SYSTEM","text":"You have successfully assisted the emissaries of House Valentione in all three city–states! Return to Hortefense in Mih Khetto's Amphitheatre to report your success."}],"reward":{"gil":286,"items":[{"num":10,"id":6997}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66048]},"next":[66083]},"partials":[{"type":"npc","id":"1011732","obj":{"i":1011732,"n":"Hortefense","l":53,"q":5}},{"type":"npc","id":"1011734","obj":{"i":1011734,"n":"House Valentione Emissary","l":40,"q":1}},{"type":"item","id":"6997","obj":{"i":6997,"n":"Prismatic Heart (Right)","l":1,"c":21294,"t":85,"p":8}},{"type":"quest","id":"66048","obj":{"i":66048,"n":"Where Did Our Loves Go","g":196,"l":"Gridania","s":72}},{"type":"quest","id":"66083","obj":{"i":66083,"n":"Now That We've Found Love","g":196,"l":"Gridania","s":76}}]}