{"quest":{"name":"Into the Beast's Maw","location":"South Shroud","id":66050,"patch":2.0,"sort":129,"icon":112005,"eventIcon":71201,"issuer":1000590,"target":1000590,"involved":[1000393],"genre":1,"journal":["Buscarron has reliable information regarding the whereabouts of the sylph elder.","Fleeing from Garlean soldiers, the sylph elder, Frixio, has ventured into the Thousand Maws of Toto–Rak. Were any misfortune to befall him, the effort to secure peace between man and sylph would surely be undone. You must find Frixio before the unthinkable comes to pass. Make haste to the dungeon, explain the situation to Bloisirant, and obtain his permission to enter.","You have been granted entry into the Thousand Maws of Toto–Rak. Hurry within and find Frixio before he falls prey to fell fiends.<br><br>※Challenge the Thousand Maws of Toto–Rak with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","Within the bowels of Toto–Rak, you encounter Lahabrea of the Ascians, who unleashes a gigantic banemite upon you. Having successfully fended off the beast, you find Frixio, shaken but unharmed. Grateful for your timely intervention, he agrees to speak with you regarding Ramuh, and bids you meet him later at Little Solace.","Buscarron will wish to know of your success. Before you do anything else, report back to him at the Druthers.","Owing to your efforts, peace between man and sylph is now within reach."],"objectives":["Speak with Bloisirant.","Enter the Thousand Maws of Toto–Rak.","Report to Buscarron.","Speak with Dellexia."],"dialogue":[{"name":"BUSCARRON","text":"It's taken us a fair old while, but we've finally got our hands on some reliable information concerning the whereabouts of your missing green friend."},{"name":"PAPALYMO","text":"Ahem! His name is <span class=\"emphasis\">Frixio</span>, and he is the eldest amongst the sylphs of Little Solace. Long has he represented his kind in dialogue with the Gridanians."},{"name":"YDA","text":"Yes, he's like a bridge between us and them─a small, leafy, green bridge that we can't find at the moment. And bridges are no use if you don't know where they are. That's why it's so important that we find him!"},{"name":"BUSCARRON","text":"There's an abandoned dungeon called the Thousand Maws of Toto–Rak here in the South Shroud."},{"name":"BUSCARRON","text":"'Twas by the entrance to the place that Frixio was seen─and not long ago, neither. If you hurry, I reckon you'll find him."},{"name":"KNOLEXIA","text":"Walking ones, please help this one! This one needs help! Needs help to help elder one! Poor Frixio! Poor, poor Frixiooo!!!"},{"name":"BUSCARRON","text":"Whoa, whoa, whoa! Hooold your chocobos. Take a deep breath and tell us what's wrong, nice and slow."},{"name":"KNOLEXIA","text":"Elder one went into Toto–Rak, but has not returned! This one is worried, so very worried!"},{"name":"BUSCARRON","text":"And you're right to be... The place fair crawls with nasties waiting to make a meal of anyone daft enough to wander in."},{"name":"BUSCARRON","text":"What in the seven hells was he thinking, entering that bloody death trap?"},{"name":"KNOLEXIA","text":"Elder one had no choice! Imperial ones were chasing elder one! Please! Walking ones must help elder one─help elder one <span class=\"emphasis\">now</span>!"},{"name":"PAPALYMO","text":"Argh! The fates conspire against us... Forgive my pragmatism, but Frixio is our best hope of reaching an accord with the sylphs. Were we to lose him, all our efforts thus far will have been for naught."},{"name":"PAPALYMO","text":"I will tend to her wounds. Yda, make haste to the Adders' Nest and request assistance."},{"name":"YDA","text":"Understood!"},{"name":"PAPALYMO","text":"<span class=\"highlight\">Forename</span>─go to the Thousand Maws of Toto–Rak and see that Frixio comes to no harm. Peace between man and sylph rests upon your success."},{"name":"BLOISIRANT","text":"By order of the Elder Seedseer, the dungeon known as the Thousand Maws of Toto–Rak has been placed under the control of─"},{"name":"BLOISIRANT","text":"...What? The <span class=\"emphasis\">sylph elder</span> is inside? And you are sure of this? How in the seven hells did he manage to sneak by? Gods strike me down for a purblind fool!"},{"name":"BLOISIRANT","text":"You must find the sylph elder before he falls prey to the fiends within. Entrance to Toto–Rak is ordinarily restricted, but these are exceptional circumstances. Pray assemble a rescue party, and enter as soon as you are ready."},{"name":"BLOISIRANT","text":"Entrance to the Thousand Maws of Toto–Rak is ordinarily restricted, but in light of the elder sylph's plight, I shall make an exception. Pray assemble a rescue party, and enter as soon as you are ready."},{"name":"HYDAELYN","text":"Darkness..."},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">Hahahaha...</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">The mighty slayer of Ifrit comes now to me.</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">...With a countenance that bespeaks understanding.</span>"},{"name":"LAHABREAANCIENT","text":"(-???-)<span class=\"highlight-purple\">An intriguing power, the Echo. I must needs choose my words with care.</span>"},{"name":"LAHABREAEORZEA","text":"(-???-)Mayhap I might if I deign to speak in my guest's crude tongue. We meet at last."},{"name":"LAHABREAEORZEA","text":"I am Lahabrea of the Ascians, servant to the one true god."},{"name":"LAHABREAEORZEA","text":"Yours is a most fantastical tale. Truly absorbing."},{"name":"LAHABREAEORZEA","text":"It is a tale to tell Eorzea's children before bedtime. And it will soon be dark, Bringer of Light."},{"name":"HYDAELYN","text":"...The Dark Minions..."},{"name":"LAHABREAEORZEA","text":"All that stands between this world and Darkness is an irksome anomaly in the aether─the Echo."},{"name":"LAHABREAEORZEA","text":"Yes...yours is a most fascinating tale."},{"name":"LAHABREAEORZEA","text":"Alas, like all good tales, it must needs come to an end. But fear not..."},{"name":"HYDAELYN","text":"Hear... Feel... The presence...of evil..."},{"name":"LAHABREAEORZEA","text":"For the end of your tale is but the beginning of another... The tale of the Crystal's demise!"},{"name":"FRIXIO","text":"(-???-)&lt;gasp&gt; Finally, fresh air!"},{"name":"FRIXIO","text":"(-???-)&lt;sniff&gt; &lt;sniff&gt; Mayhap not so fresh...but better than before."},{"name":"FRIXIO","text":"(-???-)Ah, sinister one is gone! This one can leave this awful place!"},{"name":"FRIXIO","text":"(-???-)Hm? Did walking one vanquish the many-legged one? This one is grateful to walking one!"},{"name":"FRIXIO","text":"This one is called Frixio, eldest of these ones of Little Solace."},{"name":"IMPERIALRUNNER","text":"Alpha squad reporting, sir! Nothing of note at Larkscall, sir!"},{"name":"IMPERIALCENTURION","text":"Understood. Return to area twelve.<br>Damn it all...where is that accursed eikon hiding?"},{"name":"NERO","text":"No sign of our wizened friend?"},{"name":"IMPERIALCENTURION","text":"I'm afraid not, my lord. Shall I order that the search perimeter be expanded?"},{"name":"NERO","text":"Absolutely not. We risk alerting the Gridanians to our presence. His Excellency bid us avoid unnecessary confrontation."},{"name":"NERO","text":"Loath though I am to admit it, I have found no evidence to suggest that Ramuh will be gracing the mortal realm in the near future."},{"name":"NERO","text":"I ask you...what good is a god who does not grant one's wishes? Were I a sylph, I should <span class=\"emphasis\">strongly</span> consider finding myself another idol."},{"name":"NERO","text":"Which reminds me─what of the sylphs we captured? A handful of them seemed to be in reasonably good health when last I looked."},{"name":"IMPERIALCENTURION","text":"Ah. A-Apologies, my lord. I fear we may have been...overzealous in our efforts to compel them to summon their eikon."},{"name":"NERO","text":"&lt;sigh&gt; ...Really, Centurion─were you not aware that vegetables bruise easily? It is well that I did not entrust you with the important task of making my dinner."},{"name":"NERO","text":"Well, mayhap it was a kindness. Better dead in truth than dead to one's own god, I suppose...if you believe in such things."},{"name":"NERO","text":"Dawn is upon us. Make ready to withdraw."},{"name":"NERO","text":"Hmph, useless..."},{"name":"NERO","text":"We are so close to completion, I can fair taste it, but at this rate..."},{"name":"NERO","text":"No, I must be patient. Our efforts will bear fruit in due time."},{"name":"NERO","text":"...What was it you always said? Ah, yes: “Though it mean bringing down the very heavens, who shall challenge the limits of possibility if not we?” In that alone were you right...Garlond."},{"name":"NERO","text":"But your star is long fallen, while mine doth begin to rise."},{"name":"NERO","text":"And it shall burn so bright─<span class=\"emphasis\">so</span> bright that Lord van Baelsar's ultimate weapon will seem a mere candle beside it! Ahahahaha!"},{"name":"NORAXIA","text":"Those walking ones did for Noxia! This one is certain of it!"},{"name":"FRIXIO","text":"This one fears that other taken ones also suffered the same fate..."},{"name":"NORAXIA","text":"This one is convinced! Walking ones have black hearts, seek only to harm these ones! Walking ones are not to be trusted!"},{"name":"FRIXIO","text":"Now, now, Noraxia...do not pass judgment too hastily. Not <span class=\"emphasis\">all</span> walking ones are alike. Though there are evil ones among the walking ones, there are good ones also."},{"name":"FRIXIO","text":"Hm? Does walking one feel unwell?"},{"name":"FRIXIO","text":"This one would know, what brings walking one to this place?"},{"name":"FRIXIO","text":"Came to this one's rescue at Noraxia's bidding? Then this one owes walking one a debt of gratitude!"},{"name":"FRIXIO","text":"Hm? Walking one has questions about Lord Ramuh? Then this one will provide answers."},{"name":"FRIXIO","text":"But first, let these ones quit this lightless place."},{"name":"FRIXIO","text":"This one will return to Little Solace. When walking one is ready, please come and see this one. These ones may speak properly then."},{"name":"FRIXIO","text":"Then it is settled! Let this one accompany walking one outside!"},{"name":"BUSCARRON","text":"Ah, you're back! Tell me the sylph elder is well!"},{"name":"BUSCARRON","text":"...Thank the gods for that! I don't rightly know what to make of the rest of your tale, but I'm full glad Frixio didn't come to any harm."},{"name":"BUSCARRON","text":"Ah, but there I go tempting fate. Run over to Little Solace and secure us peace with the sylphs before aught else befalls us, eh? Rest assured, I'll send word to our friends of Sharlayan and the Twin Adder both."},{"name":"BUSCARRON","text":"You've done Gridania a great service this day, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─and earned yourself a place of honor here at the Druthers in so doing. Be sure and come by whenever you feel like a drop of Qiqirn firewater!"}],"reward":{"gil":3032,"items":[{"id":3057,"one":1},{"id":3060,"one":1},{"id":3062,"one":1},{"id":5825,"one":1}],"xp":9240,"instance":1},"reqs":{"jobs":[{"lvl":24,"id":130}],"quests":[69398]},"next":[66278,66279,66281]},"partials":[{"type":"npc","id":"1000590","obj":{"i":1000590,"n":"Buscarron","l":56,"q":14,"t":"Alehouse Proprietor"}},{"type":"npc","id":"1000393","obj":{"i":1000393,"n":"Bloisirant","l":56,"q":1}},{"type":"item","id":"3057","obj":{"i":3057,"n":"Iron Scale Mail","l":23,"c":43063,"t":35,"p":1647}},{"type":"item","id":"3060","obj":{"i":3060,"n":"Cotton Trapper's Tunic","l":23,"c":42091,"t":35,"p":1372}},{"type":"item","id":"3062","obj":{"i":3062,"n":"Cotton Robe","l":24,"c":42053,"t":35,"p":1257}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"instance","id":"1","obj":{"i":1,"n":"The Thousand Maws of Toto-Rak","c":61801,"t":"Dungeons","min_lvl":24,"max_lvl":27}},{"type":"quest","id":"69398","obj":{"i":69398,"n":"Nouveau Riche","g":1,"l":"South Shroud","s":128}},{"type":"quest","id":"66278","obj":{"i":66278,"n":"Shadows of the Empire","g":92,"l":"South Shroud","s":240}},{"type":"quest","id":"66279","obj":{"i":66279,"n":"A Simple Gift","g":1,"l":"South Shroud","s":130}},{"type":"quest","id":"66281","obj":{"i":66281,"n":"The Blood Price","g":92,"l":"East Shroud","s":240}}]}