{"quest":{"name":"Eyes on Me","location":"Eastern Thanalan","id":66054,"patch":2.0,"sort":189,"icon":100160,"eventIcon":71201,"issuer":1006672,"target":1006355,"genre":1,"journal":["Marques believes he is being watched.","Marques cannot shake the feeling that he is being watched. Apparently, the sensation comes and goes, but he felt it quite strongly not long ago. Put his fears to rest by searching the surrounding area for hidden onlookers.","While patrolling the lichyard, you come under attack from an unknown assailant. After slaying the man in self-defense, you note that his sword is unlike any you have seen before, and retrieve it in the hope that it might serve to identify him. Inform Marques that his fears were justified.","Marques has no idea why the man would be monitoring his activities, but he suspects it may have something to do with his past─a past which he still cannot recall, despite his best efforts. As this may not be the last time dangerous men come in search of Marques, he asks that you inform Father Iliud of everything that has transpired. Perhaps you should show him the unusual sword you discovered as well.","Recognizing the sword you found to be Garlean steel, Father Iliud concludes that the man observing Marques was an imperial soldier. Before he can dispatch you to inform the authorities, Alphinaud Leveilleur strides into the church and declares Marques to be none other than Master Cid Garlond, who has been missing since the Calamity five years ago. While he has yet to recover his lost memories, Cid senses that the boy speaks the truth, and decides to join him. Resigned, Father Iliud produces Cid's belongings, which the priest had stored for safekeeping. Alphinaud then reveals that the Ixal have summoned Garuda, and that Cid's lost airship, the <span class=\"emphasis\">Enterprise</span>, will be required if the surviving Scions are to reach the primal. Together with Cid and Alphinaud, make for Gridania, where the <span class=\"emphasis\">Enterprise</span> was last seen."],"objectives":["Search the lichyard for unseen observers.","Speak with Marques.","Show the sword to Father Iliud."],"dialogue":[{"name":"MARQUEZ","text":"I...I'm not imagining it, <span class=\"highlight\">Forename</span>. I <span class=\"emphasis\">know</span> I'm being watched..."},{"name":"MARQUEZ","text":"This is different─sinister. It is as if I am...under observation."},{"name":"MARQUEZ","text":"The feeling comes and goes...but I felt it when last I ventured outside. Yes. I know I felt it. Will you look outside for me...<span class=\"emphasis\">please</span>? It will only take a moment."},{"name":"MARQUEZ","text":"You were attacked, weren't you? Are you unharmed? Thank the gods."},{"name":"MARQUEZ","text":"I knew it. He <span class=\"emphasis\">was</span> watching me. ...But why was he watching me?"},{"name":"MARQUEZ","text":"What did he <span class=\"emphasis\">want</span> with me? Did he, perhaps...know something of my past? If only I could have asked him..."},{"name":"MARQUEZ","text":"I...I need to think. Please, allow me a moment alone. Wait. Father Iliud must hear of this. Will you tell him for me? It's important. I think others may come for me again."},{"name":"ILIUD","text":"Heavens forfend... That such a thing should happen on holy ground! Do you have any idea who this man was? Did you notice anything distinctive about his garb or possessions?"},{"name":"ILIUD","text":"This...this is Garlean steel. Which means the man who was watching Marques was..."},{"name":"ILIUD","text":"Make haste to Camp Drybone at once! We must summon the Immortal Flames before more imperials come!"},{"name":"ALPHINAUD","text":"Hmph. I fondly hoped that I might be the first to speak with you... Would that I had been so fortunate."},{"name":"ALPHINAUD","text":"At ease, adventurer─I come not on behalf of the Empire. On the contrary, I mean to revive the Scions of the Seventh Dawn."},{"name":"ALPHINAUD","text":"And to that end..."},{"name":"ALPHINAUD","text":"I have come in search of a legend─the greatest engineer of our time. Master Cid Garlond─I have come for <span class=\"emphasis\">you</span>."},{"name":"PRIEST","text":"I fear you are mistaken, child. He is but a poor soul who bore witness to the horrors at Carteneau."},{"name":"PRIEST","text":"I beg of you, leave us in peace..."},{"name":"MARQUEZ","text":"Wait... I..."},{"name":"MARQUEZ","text":"&lt;groan&gt;"},{"name":"ALPHINAUD","text":"Hear me, Cid! Eorzea needs you!"},{"name":"MARQUEZ","text":"You... So familiar... We... It's... all a blur. "},{"name":"MARQUEZ","text":"&lt;groan&gt;"},{"name":"PRIEST","text":"Cid, was it? Here...these belong to you."},{"name":"PRIEST","text":"I thought you bore the mark of greatness... It seems that I was right."},{"name":"PRIEST","text":"Our time together was all too brief, but it felt as though my son had returned to me. You have brought joy to an old man's life."},{"name":"PRIEST","text":"But it is time for you to help those who truly need you."},{"name":"CID","text":"(-Cid-)Who...are you?"},{"name":"ALPHINAUD","text":"Alphinaud Leveilleur, at your service."},{"name":"ALPHINAUD","text":"As a Scion of the Seventh Dawn, I stand against our primal and imperial foes─as my grandfather once did."},{"name":"ALPHINAUD","text":"'Tis no secret what befell our order at the Waking Sands. Word has already spread across Eorzea."},{"name":"ALPHINAUD","text":"The repercussions are far greater than you realize. In the wake of the Calamity, the three city–states focused their efforts solely on reconstruction."},{"name":"ALPHINAUD","text":"Leaving the Scions to combat the primal threat unaided."},{"name":"ALPHINAUD","text":"And lo, we are all but destroyed. Yet even as the nations mourn our demise, and abandon what little hope they have left, we cannot forsake our duty─now least of all."},{"name":"ALPHINAUD","text":"The Ixal have summoned Garuda once more, and she torments the people of Coerthas as we speak."},{"name":"ALPHINAUD","text":"Her appetite for destruction far exceeds that of other primals."},{"name":"ALPHINAUD","text":"Worse, in her present incarnation, our Baldesion colleagues believe she surpasses both Ifrit and Titan in strength."},{"name":"ALPHINAUD","text":"Yet therein lies an opportunity. Were we somehow to defeat Garuda, it would serve as a warning to the other beast tribes that even their mightiest gods can be felled."},{"name":"ALPHINAUD","text":"If we are to face our foe, we must first circumvent the tempest that shields her sanctuary."},{"name":"ALPHINAUD","text":"And for that, we need an airship─<span class=\"emphasis\">your</span> airship, Cid."},{"name":"CID","text":"(-Cid-)I...I have...an airship?"},{"name":"ALPHINAUD","text":"Yes, Cid, you do. Your very own airship."},{"name":"ALPHINAUD","text":"It was last seen in the skies over Gridania, not long before the Calamity, so let us begin our search there."},{"name":"CID","text":"(-Cid-)A-An airship...? My airship...?"},{"name":"CID","text":"(-Cid-)W-Wait..."},{"name":"ALPHINAUD","text":"Come, let us put an end to the primals! Together, we will show the world that the Scions are still a force to be reckoned with!"},{"name":"CID","text":"They need my airship... They need...me."},{"name":"POP","text":"You are being watched... "}],"reward":{"items":[{"id":27640,"one":1},{"id":3844,"one":1},{"num":5,"id":5825,"one":1}],"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":130}],"quests":[66414]},"next":[66419]},"partials":[{"type":"npc","id":"1006672","obj":{"i":1006672,"n":"Marques","l":44,"q":4}},{"type":"npc","id":"1006355","obj":{"i":1006355,"n":"Iliud","l":44,"q":9}},{"type":"item","id":"27640","obj":{"i":27640,"n":"Altered Boarskin Thighboots","l":35,"c":46101,"t":38}},{"type":"item","id":"3844","obj":{"i":3844,"n":"Toadskin Duckbills","l":35,"c":46327,"t":38,"p":2764}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66414","obj":{"i":66414,"n":"Bury Me Not on the Lone Prairie","g":1,"l":"Eastern Thanalan","s":188}},{"type":"quest","id":"66419","obj":{"i":66419,"n":"He Who Waited Behind","g":1,"l":"Eastern Thanalan","s":190}}]}