{"quest":{"name":"Way of the Pugilist","location":"Ul'dah","id":66069,"patch":2.0,"sort":11,"icon":100059,"unlocksFunction":1,"eventIcon":71341,"issuer":1001286,"target":1003817,"genre":128,"journal":["Gagaruna wishes you to reaffirm your desire to join the Pugilists' Guild.","You have been referred to Hamon, the master of the Pugilists' Guild. Seek him out by the training area.","Having formally accepted you into the Pugilists' Guild, Guildmaster Hamon instructs you to go forth and slay three shrews, three hornets, and three marmots.","You have succeeded in slaying the specified creatures. Report back to Hamon at the Pugilists' Guild.","Hamon is pleased with your showing against Thanalan's vermin population, and bids you apply yourself to your training.<br><br>※The next pugilist quest will be available from Hamon upon reaching level 5."],"objectives":["Speak with Hamon, the master of the Pugilists' Guild.","Slay star marmots.","Slay huge hornets.","Slay snapping shrews.","Report to Hamon at the Pugilists' Guild."],"dialogue":[{"name":"GAGARUNA","text":"So, are you ready to present yourself for the guildmaster's inspection?"},{"name":"GAGARUNA","text":"Master Hamon is among the greatest pugilists of our time. For long years the man ruled the bloodsands as the <span class=\"emphasis\">Holyfist</span>, though he has since retired in favor of training aspiring fighters."},{"name":"GAGARUNA","text":"You will find him overseeing his charges yonder. Go now and show to him the fighting spirit that burns within you!"},{"name":"GAGARUNA","text":"Oh? You do not wish to join us, after all? The decision is ultimately yours, but know that few would spurn the opportunity to train under Hamon Holyfist."},{"name":"HAMON","text":"Heh heh... Past time you got your arse back here. Well? What did the dancer have to say about my...<span class=\"emphasis\">proposition</span>?"},{"name":"HAMON","text":"Eh!? Y-You're not my errand boy! There's no dancer─there never was! I'm not doing anything indecent, I swear to the gods!"},{"name":"HAMON","text":"...What? You're here to enroll? Ohoho, well, why didn't you say so sooner!? In my capacity as guildmaster, I would be glad to give you a primer on the art of hand-to-hand combat!"},{"name":"HAMON","text":"Doubtless you already know this, but we pugilists fight with our fists and feet. While these don't deal as much damage as a blade, it hardly matters when you can land several blows for each swing of the sword. What we lack in destructive force, we more than make up for in speed and cunning. Under my guidance, not only will you master striking techniques..."},{"name":"HAMON","text":"You'll also learn to string them together to deliver an endless flurry of blows! Only through such fierce combinations can a pugilist realize his potential! Yaaarrrgh!"},{"name":"HAMON","text":"&lt;cough&gt; &lt;wheeze&gt; Crikey, I'm spent from all this talking. You ought to speak more, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>─it'd give me a chance to catch my breath. But where was I?"},{"name":"HAMON","text":"Ah, right. Joining the guild. Before you do so, I must warn you that the path of the pugilist is long and arduous. Do you believe you've got what it takes to go the distance? Be honest with yourself, now!"},{"name":"Q1","text":"Can you go the distance?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"HAMON","text":"Yes, you have fighting spirit─I can see it in your eyes. I see no reason to deny you a place in these halls. Welcome to the guild, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>."},{"name":"HAMON","text":"For your first lesson, I want you to test your fledgling skills against the vermin of Thanalan. Get out there and put down three marmots, three hornets, and three shrews. Return here when the deed is done. "},{"name":"HAMON","text":"Eh!? You are...shockingly honest, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>. 'Tis truly a shame you feel unready─I happen to like frankness in my charges."},{"name":"HAMON","text":"Ah, you're back, and none the worse for the exertion. Youthful vigor's a truly blessed thing!"},{"name":"HAMON","text":"You've gotten off to a fine start, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>. To help you on your way, I want you to have this hunting log."},{"name":"HAMON","text":"Within you'll find the names of various creatures─opponents that you might hone your skills against."},{"name":"HAMON","text":"If you want to become strong, you mustn't neglect your training. Indeed, a pugilist is only as good as the number of strikes he's dealt."},{"name":"HAMON","text":"Get out there, <span class=\"highlight\">Forename</span>, and let your fists fly. When the time is ripe, I'll teach you something new."},{"name":"HAMON","text":"There's no limit to the potential of youth. I look forward to seeing you come into your own! Hah hah hah!"},{"name":"SYSTEM","text":"The next pugilist quest will be available from Hamon upon reaching level 5."}],"reward":{"job":2,"items":[{"num":5,"id":4639}],"xp":100},"reqs":{"jobs":[{"lvl":1,"id":3}]},"next":[66090,66091]},"partials":[{"type":"npc","id":"1001286","obj":{"i":1001286,"n":"Gagaruna","l":40,"q":5,"t":"Guild Receptionist"}},{"type":"npc","id":"1003817","obj":{"i":1003817,"n":"Hamon","l":40,"q":11,"t":"Guildmaster"}},{"type":"item","id":"4639","obj":{"i":4639,"n":"Marmot Steak","l":5,"c":24355,"t":46,"p":9}},{"type":"quest","id":"66090","obj":{"i":66090,"n":"Harder than Rock","g":128,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"66091","obj":{"i":66091,"n":"Burning Up the Quarter Malm","g":128,"l":"Ul'dah","s":100,"f":1}}]}