{"quest":{"name":"Ardor in the Harbor","location":"Gridania","id":66063,"patch":2.5,"sort":75,"icon":100385,"eventIcon":71221,"issuer":1011732,"target":1011735,"genre":196,"journal":["Hortefense would have you assist his man in Limsa Lominsa to hunt for a wayward wagoner.<br>※This quest is available for a limited time only.","Hortefense asks you to help his man in La Noscea, who has been inundated with requests to deliver gifts to missing beaus. The nobleman bids you travel to Limsa Lominsa to meet with his assistant by the Aftcastle. This emissary will introduce you to one of his careworn clients, so that she might relate to you any clues she has to the location of her lost love.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak with the <span class=\"alternative-container\"><span class=\"alternative\">troubled</span><span class=\"alternative\">flustered</span><span class=\"alternative\">shy</span></span> maiden, who explains how her wagon-pulling beloved has gone out to find work, and cannot be traced. She has prepared a batch of his favorite confection─an especially minty chocolate─that must be delivered to him before Valentione's Day is out. However, she has but one clue as to his location: the <span class=\"alternative-container\"><span class=\"alternative\">“fruit”</span><span class=\"alternative\">“ships”</span><span class=\"alternative\">“booze”</span><span class=\"alternative\">“settlement”</span><span class=\"alternative\">“construction”</span><span class=\"alternative\">“tidegate”</span><span class=\"alternative\">“pirates”</span><span class=\"alternative\">“lighthouse”</span><span class=\"alternative\">“lockup”</span><span class=\"alternative\">“plantation”</span><span class=\"alternative\">“salt”</span><span class=\"alternative\">“Sahagin”</span></span> she recalls him speaking of before he departed. She begs you to search for her missing sweetheart and deliver her gift to him.<br><br>※Please note that the wagoner you seek will not be marked on the map, nor will any identifying symbol appear above the character's head. Share your information with other players, and try to find him.","You meet with <span class=\"alternative-container\"><span class=\"alternative\">Berndan</span><span class=\"alternative\">Philippe</span><span class=\"alternative\">Thrydwulf</span></span> <span class=\"alternative-container\"><span class=\"alternative\">at Summerford Farms</span><span class=\"alternative\">at the Moraby Drydocks</span><span class=\"alternative\">in Aleport</span></span>. He recognizes his sweetheart from your descriptions, and accepts the gift with unrestrained delight. Return to the Aftcastle and report your success to the emissary.","The emissary thanks you profusely for bringing together the <span class=\"alternative-container\"><span class=\"alternative\">troubled</span><span class=\"alternative\">flustered</span><span class=\"alternative\">shy</span></span> maiden and her wayward swain. However, he has less welcome words for Hortefense: the hunt for the nobleman's lost love has met with the expected lack of success. For how is one to find a lady when one knows neither her name nor her face? If only there were some other clue as to her identity..."],"objectives":["Speak with the House Valentione emissary in Limsa Lominsa.","Locate the wayward wagoner and give him the piece of mint chocolate.","Report to the House Valentione emissary in Limsa Lominsa."],"dialogue":[{"name":"HORTEFENSE","text":"My man in La Noscea reports a veritable surfeit of ladies who seek our services in locating their absent swains. Despite the increased numbers, we have met with no more success in finding these men. I do hope that they haven't succumbed to the waves...or the sharp side of a pirate's cutlass."},{"name":"HORTEFENSE","text":"Pray go to Limsa Lominsa, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>, and introduce yourself to my subordinate─you will find him by the Aftcastle. He will present one of these wanting women to you, so that you might listen to her tale of love and woe, and gather what clues you can."},{"name":"HORTEFENSE","text":"The emissary awaits you in Limsa Lominsa, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>. Prithee go to him and assist him in his mission, lest the city itself be washed away by a flood of lonely tears!"},{"name":"MISSIONARY00527","text":"Might you be the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> Ser Hortefense sent to assist me? I am most grateful for your help. To be honest, I was quite at a loss how to proceed... Allow me to introduce you to one of the ladies who requires our services."},{"name":"GIRLA00527","text":"'Ere, are you the 'venturer who reckons <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">'e</span></span> can ferret out me feller? Ye don't look too “worldly-wise” to me, but I suppose ye'll do. Any 'elp ye can give me's better than a slap in the chops with a wet fish."},{"name":"GIRLA00527","text":"Me feller works a wagon, carryin' whatever comes in at the docks to wherever it needs takin'. It ain't a glamorous life, but it's regular work, and at least it keeps 'im out of 'arm's way. Only problem is, I got no way o' knowin' where 'e's got to 'alf the time."},{"name":"GIRLA00527","text":"If ye manage to track 'im down, give 'im this, will ye? It's a bit o' mint chocolate─'is favorite. Cooked it up meself, I did. One whiff o' this, and even a daft bastard like 'im'll realize how much I love 'im."},{"name":"GIRLA00527","text":"...Do I know where 'e went? Do I bugger. I never reckoned 'e'd be gone this long, so I weren't payin' much attention to what 'e were blatherin' on about before 'e left. All I remember's 'im sayin' somethin' about “fruit.” Does that mean anythin' to ye?"},{"name":"GIRLA00527","text":"...Do I know where 'e went? Do I bugger. I never reckoned 'e'd be gone this long, so I weren't payin' much attention to what 'e were blatherin' on about before 'e left. All I remember's 'im sayin' somethin' about a “settlement.” Does that mean anythin' to ye?"},{"name":"GIRLA00527","text":"...Do I know where 'e went? Do I bugger. I never reckoned 'e'd be gone this long, so I weren't payin' much attention to what 'e were blatherin' on about before 'e left. All I remember's 'im sayin' somethin' about “pirates.” Does that mean anythin' to ye?"},{"name":"GIRLA00527","text":"...Do I know where 'e went? Do I bugger. I never reckoned 'e'd be gone this long, so I weren't payin' much attention to what 'e were blatherin' on about before 'e left. All I remember's 'im sayin' somethin' about a “plantation.” Does that mean anythin' to ye?"},{"name":"GIRLA00527","text":"It ain't much to go on, but if ye can somehow get that chocolate to 'im, ye'll 'ave me thanks. The poor ol' bastard probably thought I was ignorin' 'im, but I weren't! I were just too busy thinkin' up what to make to show 'ow much I love 'im! If 'e ends the day with naught, we'll be finished!"},{"name":"GIRLB00527","text":"Are you the adventurer who thinks <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> can find my man? I should be ever so grateful if you could."},{"name":"GIRLB00527","text":"My man isn't <span class=\"emphasis\">missing</span>, per se─I just don't know where he is. He's a wagoner by trade, so he travels about a great deal, delivering goods to wherever they need to go. He doesn't have a fixed route─it all depends on what comes into the docks that day."},{"name":"GIRLB00527","text":"If you <span class=\"emphasis\">do</span> happen to find him, could you give him this piece of chocolate? I made it especially for him. It's his favorite─<span class=\"emphasis\">choc</span>–full of galago mint. He might not be the sharpest knife in the pantry, but if he can get a taste of this, I'm sure he'll understand how I feel about him."},{"name":"GIRLB00527","text":"...Do I have any idea where he might be? It might not be anything, but when I last saw him, I recall him mentioning something about “ships.” Perhaps that had something to do with his next assignment?"},{"name":"GIRLB00527","text":"...Do I have any idea where he might be? It might not be anything, but when I last saw him, I recall him mentioning something about “construction.” Perhaps that had something to do with his next assignment?"},{"name":"GIRLB00527","text":"...Do I have any idea where he might be? It might not be anything, but when I last saw him, I recall him mentioning something about a “lighthouse.” Perhaps that had something to do with his next assignment?"},{"name":"GIRLB00527","text":"...Do I have any idea where he might be? It might not be anything, but when I last saw him, I recall him mentioning something about “salt.” Perhaps that had something to do with his next assignment?"},{"name":"GIRLB00527","text":"I <span class=\"emphasis\">do</span> hope you can find him and give him my gift. I spent so long making sure the chocolate was just right, I'm not sure I could do it again. If he doesn't get to taste this batch, he might never know how I truly feel about him..."},{"name":"GIRLC00527","text":"Well, aren't you a pretty little thing. You look like you've got what it takes to find my man, and more besides. <span class=\"alternative-container\"><span class=\"alternative\">Just remember, if you <span class=\"emphasis\">do</span> manage to track him down, you keep your hands to yourself!</span><span class=\"alternative\">Why, if I wasn't already spoken for, I'd gobble you up myself!</span></span>"},{"name":"GIRLC00527","text":"<span class=\"emphasis\">My</span> darling boy works as a wagoner. The coin isn't much to write home about, but all that heavy lifting pays dividends, if you follow my meaning. The only real downside is that he's always out traveling, so it's difficult to lay my hands on him when I really, <span class=\"emphasis\">really</span> want to."},{"name":"GIRLC00527","text":"If you're able to find my darling, would you give this to him? Mint chocolate of my own special recipe: two–thirds kukuru solids, with a lavish handful of fresh galago mint, and a dash of pure, unadulterated passion. As soon as it touches his lips, he'll know exactly how I feel about him."},{"name":"GIRLC00527","text":"...Do I have any clue as to where he might have gone? I'm afraid not. When last we met, I was too busy drowning in his eyes to pay much attention to his words. There was one thing I remember, though: something about “booze”... Could he have been talking about his work?"},{"name":"GIRLC00527","text":"...Do I have any clue as to where he might have gone? I'm afraid not. When last we met, I was too busy drowning in his eyes to pay much attention to his words. There was one thing I remember, though: something about a “tidegate”... Could he have been talking about his work?"},{"name":"GIRLC00527","text":"...Do I have any clue as to where he might have gone? I'm afraid not. When last we met, I was too busy drowning in his eyes to pay much attention to his words. There was one thing I remember, though: something about a “lockup”... Could he have been talking about his work?"},{"name":"GIRLC00527","text":"...Do I have any clue as to where he might have gone? I'm afraid not. When last we met, I was too busy drowning in his eyes to pay much attention to his words. There was one thing I remember, though: something about the Sahagin... Could he have been talking about his work?"},{"name":"GIRLB00527","text":"I'm really very timid when it comes to expressing my love... If he doesn't get my gift now, will my darling boy ever know of my burgeoning passion? Of the flames he kindles in my racing heart? Please find him, adventurer, and let him know how much he means to me!"},{"name":"MISSIONARY00527","text":"...So there you have it. Forgive me for burdening you with this impossible task, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, but I have tried and failed to find the man myself. It is my one slim hope that an adventurer such as yourself might divine some clue to his location from the lady's words."},{"name":"MISSIONARY00527","text":"Did they mean anything to you? Some connection to a local landmark, perhaps? Should you find yourself at a loss, pray speak with your fellow adventurers. We have enlisted many of your kind in our cause─mayhap the lady revealed some other information to them that she neglected to mention to you."},{"name":"MISSIONARY00527","text":"Go, then, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and seek out this missing wagoner. I shall remain here to comfort the lonely ladies of Limsa Lominsa in their darkest hour. Together, we shall await word of your success!"},{"name":"SYSTEM","text":"During this quest, the location of the wayward wagoner will not be marked on the map, nor will any identifying symbol appear above the character's head. Speak with other players and share your information, and try to find him!"},{"name":"MISSIONARY00527","text":"“Fruit,” the lady said... The only clue we have to her lover's location. I am afraid my own attempts to find the man have borne little enough of it. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“Ships,” the lady said... The only clue we have to her lover's location. I'm afraid I'm all at sea when it comes to naval matters. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“Booze,” the lady said... The only clue we have to her lover's location. I must admit, I am entirely befuddled by it. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“A settlement,” the lady said... The only clue we have to her lover's location. Long have I racked my brains at what it might mean, yet my thoughts have failed to settle on any definitive answer. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“Construction,” the lady said... The only clue we have to her lover's location. Long have I racked my brains at what it might mean, yet I have failed to construct any definitive answer. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“A tidegate,” the lady said... The only clue we have to her lover's location. Yet rack my brains as I might, the gates of my understanding remain obstinately closed. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“Pirates,” the lady said... The only clue we have to her lover's location. I'm afraid my ignorance of the local area has plundered me of any possible insight. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“A lighthouse,” the lady said... The only clue we have to her lover's location. Yet I remain entirely unenlightened as to where he might be found. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“A lockup,” the lady said... The only clue we have to her lover's location. Yet when it comes to finding the man, I'm afraid I am a prisoner to my ignorance of the local area. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“A plantation,” the lady said... The only clue we have to her lover's location. Yet I fear it has failed to plant any seed of understanding in my mind. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“Salt,” the lady said... The only clue we have to her lover's location. Unfortunately, I can make neither head nor tail of it, unseasoned as I am to these climes. Perhaps your fellow adventurers might have some better idea?"},{"name":"MISSIONARY00527","text":"“The Sahagin,” the lady said... The only clue we have to her lover's location. Yet the creatures inspire only loathing in me, and not a whit of insight. Perhaps your fellow adventurers might have some better idea?"},{"name":"LOVER00527","text":"All right, that's that job done. Now...what's next? Oh, hello there, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">feller</span></span>─you'll be one of those adventurers, right? Say, if you've something needs delivering, I'd be happy to take it for you."},{"name":"LOVER00527","text":"What's this...? A piece of mint chocolate? And it's from <span class=\"emphasis\">her</span>!? Gods be good, this is the best Valentione's Day ever!"},{"name":"LOVER00527","text":"I don't know what they get up to elsewhere, but in La Noscea, there's nothing that beats a bit of chocolate when it comes to Valentione's Day."},{"name":"LOVER00527","text":"And if a girl gives a feller some chocolate, it can only mean one thing: she truly and honestly loves him. Do you hear that? She truly and honestly loves me!"},{"name":"LOVER00527","text":"Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">feller</span></span>, but whatever you'd have me deliver, it'll have to wait. I'm going to head back to town, and into the ever–loving arms of my beautiful girl! Thanks a million, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">lad</span></span>!"},{"name":"LOVER00527","text":"Phew... That was a heavy one. Still, there's no time to be hanging around─I better get asking after another job. Oh, hello there, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">feller</span></span>. You're one of those adventurers, ain't you? Say, if you've something needs delivering, I'd be happy to carry it."},{"name":"LOVER00527","text":"...And those were her exact words? That's funny... It don't sound like anyone I know, and certainly not my sweetheart. Sorry, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">lad</span></span>, but I think you've got the wrong feller."},{"name":"LOVER00527","text":"This is not the wagoner you are looking for. Try searching somewhere else."},{"name":"MISSIONARY00527","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>! I see that your efforts have succeeded where mine failed. How can I ever repay you? Ah, but perhaps the love you have brought into bloom is reward enough. Look, over there, at the fruits of your accomplishment!"},{"name":"MISSIONARY00527","text":"Ah, how it warms my heart to see the lady's passions reciprocated! I thank you, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. Without your insight and endeavor, this love may forever have been stifled into silence, instead of breaking forth into song."},{"name":"MISSIONARY00527","text":"However, there is one love of which I have heard nothing: when you return to Ser Hortefense, pray inform him that the lady he seeks has yet to be found."},{"name":"MISSIONARY00527","text":"And honestly, how could he hope for me to find her? He knows not the lady's name, nor her face, only something of her “spirit”... While he may be disappointed by the information─or lack thereof─I doubt he will find it unexpected."},{"name":"MISSIONARY00527","text":"But your other news he will find most welcome indeed: that thanks to you, Limsa Lominsa basks in the warmth of reciprocated passion! Our house is forever in your debt, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and we shall not forget it."},{"name":"SYSTEM","text":"You have successfully assisted the emissaries of House Valentione in all three city–states! Return to Hortefense in Mih Khetto's Amphitheatre to report your success."}],"reward":{"gil":286,"items":[{"id":9735}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66048]}},"partials":[{"type":"npc","id":"1011732","obj":{"i":1011732,"n":"Hortefense","l":53,"q":5}},{"type":"npc","id":"1011735","obj":{"i":1011735,"n":"House Valentione Emissary","l":28,"q":1}},{"type":"item","id":"9735","obj":{"i":9735,"n":"Valentione's Cake","l":90,"c":53057,"t":78}},{"type":"quest","id":"66048","obj":{"i":66048,"n":"Where Did Our Loves Go","g":196,"l":"Gridania","s":72}}]}