{"quest":{"name":"Lurkers in the Grotto","location":"Middle La Noscea","id":66079,"patch":2.0,"sort":18,"icon":100080,"eventIcon":71201,"issuer":1002626,"target":1002626,"genre":1,"journal":["Staelwyrn, the owner of Summerford Farms, has a task for a competent adventurer.","The farmhands report that a gang of savage-looking men with tattooed faces has been loitering in the vicinity of the farm, watching. The farmhands believe the unwelcome visitors to be the rumored kidnappers, and the resulting atmosphere of unease has taken a considerable toll on the farm's productivity. Make your way to Seasong Grotto, and investigate the area reported to be the tattooed thugs' den.","At Seasong Grotto, your encounter with a woman bearing a strange contraption is suddenly interrupted by the charge of an enraged goobbue.","After discovering a seafarer's knife lodged in the defeated creature's back, the woman seems convinced that the perpetrators of the kidnappings are pirates. Return to Summerford Farms and present your findings to Staelwyrn.","Staelwyrn assures you that the lady you encountered at the grotto is unconnected with the abductions, and concurs with her theory concerning the likely involvement of pirates. After thanking you for your part in the investigation, the farmer bids you to continue helping those in need for the good of Limsa Lominsa."],"objectives":["Investigate Seasong Grotto.","Deliver the blunt sailor's knife to Staelwyrn at Summerford Farms."],"dialogue":[{"name":"STAELWYRN","text":"Ah, <span class=\"highlight\">Surname</span>. That aura of confidence tells me you've not been idle since last we met."},{"name":"STAELWYRN","text":"I hope I've read you aright, for I've a task that requires the attention of a capable adventurer. Might that adventurer be you?"},{"name":"STAELWYRN","text":"Good to hear. Then I shall lay before you the sorry tale."},{"name":"STAELWYRN","text":"You will have heard rumors of the abductions. Aye, citizens have been disappearin' from every corner of Limsa Lominsa, as if plucked from the face of Hydaelyn, boots and all, by an unseen hand."},{"name":"STAELWYRN","text":"And what's this got to do with Summerford Farms, you might ask. Well, that remains to be seen, but it seems a collection of right unsavory fellows with azure-tattooed faces has been creepin' up to the edges of the fields and spyin' on my yeomen."},{"name":"STAELWYRN","text":"Now, I doubt anyone would enjoy bein' scrutinized by such savages at the best of times, but the farmhands are convinced that they're the kidnappers of rumor, come for their hides."},{"name":"STAELWYRN","text":"Needless to say, they're beside 'emselves with worry, and their work's sufferin' for it─which is the very last thing I need when my old crewmen are still gettin' used to their new jobs. 'Tis a struggle to get 'em to leave the farmhouse of a mornin'."},{"name":"STAELWYRN","text":"That is, as they say, where you come in. Would you be willin' to investigate these tattooed thugs for me?"},{"name":"STAELWYRN","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. The sooner we get to the bottom of this, the sooner this place will start to resemble a workin' farm again."},{"name":"STAELWYRN","text":"I suggest you begin by havin' a look around Seasong Grotto. If reports are to be believed, our unwelcome visitors have occupied the place."},{"name":"STAELWYRN","text":"Be careful, though, <span class=\"highlight\">Surname</span>─I couldn't say for sure what manner of miscreants we're dealin' with here. If they <span class=\"emphasis\">are</span> the kidnappers...well, just be on your guard, all right?"},{"name":"SYSTEM","text":"You are about to enter an instanced battle. Instanced battles only occur during certain quests and missions."},{"name":"SYSTEM","text":"Take a moment to read the information displayed in the active help window before answering the call of duty."},{"name":"Q1","text":"Duty calls. Do you wish to proceed with<br>“Lurkers in the Grotto”?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"YSHTOLA","text":"(-???-)<span class=\"emphasis\">I am the waves that bear.<br>I am the winds that guide.</span>"},{"name":"YSHTOLA","text":"(-???-)<span class=\"emphasis\">I am the evening stars.<br>I am the morning sky.<br>I am born of the sea.<br>And there shall I die.</span>"},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Thus reads the Sailors' Requiem carved into yonder stone."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Such words well describe the manner in which the citizens of Limsa Lominsa live their lives."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)It is both a litany against misfortune for those out on the waves..."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)...and a prayer that the souls of those who perish on land might find their way back to the sea."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)We meet again."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Or do we? My apologies, I fear I have mistaken you for another."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Something about you... Your gait, perhaps? Well, no matter."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)What brings you to this sacred place of seafarers, if I may ask?"},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Ah, you are the adventurer I've seen around Summerford Farms."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)I thought myself on the trail of the kidnappers, but it would seem I have missed my mark."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)...Or perhaps not."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)As I suspected, the aetheric disturbance here is no natural occurrence."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Nor is it a coincidence that the two of us should come here in search of those responsible for the disappearances only to be attacked."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)But who stands to benefit from the keeping of this secret?"},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Such thoughts must wait. Let us attend to the task at hand, unpleasant though it be."},{"name":"QIB","text":"Defeat the frenzied creatures!"},{"name":"YSHTOLA","text":"I sense something awry with this creature. Be on your guard."},{"name":"YSHTOLA","text":"Ware! The disruption of the aether draws others to the fray!"},{"name":"YSHTOLA","text":"Keep your focus on the battle!<br>Leave the tending of wounds to me."},{"name":"YSHTOLA","text":"More unwelcome visitors?<br>Slay them quickly lest we be overwhelmed."},{"name":"YSHTOLA","text":"The creature falters.<br>Press the attack and the battle will soon be won."},{"name":"YSHTOLA","text":"Mayhap we are overmatched..."},{"name":"YSHTOLA","text":"..."},{"name":"MOTHERCRYSTAL","text":"Hear... Feel... Think..."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Awake again, are we?"},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Aha. The poor creature's fury was kindled with cruel forethought."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)See this blade? I found it in the goobbue's back."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)I have seen knives of this kind before─they are most commonly used for the cutting of rope."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)It would appear our culprits are seafaring men of some persuasion...piratical being the most probable."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)In any event, you seem much recovered from your sudden...affliction."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)I confess, I was rather taken aback when you collapsed at the very moment of our victory. Mayhap a surfeit of aether...?"},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)I beg your pardon? A “towering crystal”? I'm sure I don't─ Oh."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)Well, well... This <span class=\"emphasis\">has</span> been a day of unexpected revelations."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)I must continue my investigation."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)In the meantime, I suggest you deliver this knife to your patron, along with a warning concerning the pirates' probable involvement in this murky business."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)The days ahead promise little rest, I fear..."},{"name":"YSHTOLA","text":"(-Cultured Conjurer-)May our paths cross again under the light of the Crystal."},{"name":"STAELWYRN","text":"<span class=\"highlight\">Surname</span>! Right glad am I to see you safely returned!"},{"name":"STAELWYRN","text":"My lads were all gabbin' about hearin' what sounded like all seven hells breakin' loose near the grotto, and I feared I'd sent you to your death."},{"name":"STAELWYRN","text":"If you were in the middle of that commotion, I hope it yielded somethin' of interest. I'd hate to think you'd risked your life for naught."},{"name":"STAELWYRN","text":"Hmmm... A blade pulled from the back of a creature you slew at the cave, eh?"},{"name":"STAELWYRN","text":"Aye, I'd agree that such a knife would be part of any seafarin' man's kit."},{"name":"STAELWYRN","text":"I'm startin' to think that these ruffians are pirates, come to lure my farmhands back to a life of plunder. Chances are, they didn't take kindly to your appearance on their doorstep, and set a maddened goobbue on you."},{"name":"STAELWYRN","text":"Aye, the pirates <span class=\"emphasis\">have</span> been addin' to their numbers of late. I'd best warn the lads and lasses in my employ to be on guard against their schemes."},{"name":"STAELWYRN","text":"...Hm? You met someone else at the grotto? A woman with a strange contraption...? Ah...Y'shtola!"},{"name":"STAELWYRN","text":"She's been in Limsa Lominsa for a good while now. Her studies of the aether often bring her out to Summerford, so her presence at the grotto is hardly unusual."},{"name":"STAELWYRN","text":"She's an odd-lookin' lass, I grant you, but she's not the kind to associate with kidnappers. You may take my word for that."},{"name":"STAELWYRN","text":"Where trust should be lackin' is in those yeomen of mine who have yet to wholly relinquish their pirate pasts. The temptation to return to the free and easy life of a buccaneer may prove too strong to resist."},{"name":"STAELWYRN","text":"You have my thanks, <span class=\"highlight\">Surname</span>. If it weren't for the efforts of stalwart adventurers like yourself, this farm would be in a far worse state than it is."},{"name":"STAELWYRN","text":"Just you keep on lendin' your talents to those in need, eh? Help bring Limsa the brighter future she deserves."}],"reward":{"gil":128,"items":[{"num":5,"id":4565},{"num":3,"id":4551,"one":1},{"num":3,"id":4555,"one":1}],"xp":1120},"reqs":{"jobs":[{"lvl":5,"id":130}],"quests":[65999]},"next":[66000,66001]},"partials":[{"type":"npc","id":"1002626","obj":{"i":1002626,"n":"Staelwyrn","l":30,"q":10}},{"type":"item","id":"4565","obj":{"i":4565,"n":"Eye Drops","l":5,"c":20642,"t":44,"p":19}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"quest","id":"65999","obj":{"i":65999,"n":"Dressed to Call","g":1,"l":"Middle La Noscea","s":17}},{"type":"quest","id":"66000","obj":{"i":66000,"n":"Further Afield","g":0,"l":"Middle La Noscea","s":28}},{"type":"quest","id":"66001","obj":{"i":66001,"n":"Washed Up","g":1,"l":"Middle La Noscea","s":22}}]}