{"quest":{"name":"Growing Apart","location":"Gridania","id":66072,"patch":2.0,"sort":350,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000125],"genre":136,"usedItems":[1917],"journal":["Timbermaster Beatin seems to be smirking in your general direction.","Gairhard, the Twin Adder captain for whom you crafted a walnut cane, has once again requested your services. Craft an oak longbow of the highest quality and present it to Beatin for inspection.","Your work elicits nary a complaint from Beatin. Deliver the longbow to Gairhard at the Adders' Nest.","Gairhard thanks you for the bow, explaining that his squad cannot compromise on the quality of their equipment, due to the demanding nature of their reconnaissance missions. Unfortunately, it is because of one such mission that Gairhard will once again be unable to visit the Carpenters' Guild in person. Deliver the news to Beatin.","Though he understands the responsibilities Gairhard has as a Twin Adder captain, he nevertheless exhibits an uncharacteristic worry upon hearing of his friend's latest mission. Brushing aside his concerns, he states that you will speak again when next he receives a commission for you.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 40."],"objectives":["Present an oak longbow <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Beatin.","Deliver the oak longbow <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Gairhard.","Report to Beatin."],"dialogue":[{"name":"BEATINE","text":"Well, well, if it isn't <span class=\"highlight\">Forename</span>! You grow more popular with every commission."},{"name":"BEATINE","text":"Take that walnut cane, for example. You remember, don't you? The one you crafted not long ago."},{"name":"BEATINE","text":"It must have left quite the impression on Gairhard, because he has once again requested your services."},{"name":"BEATINE","text":"This time, he would have you craft an oak longbow─a <span class=\"emphasis\">quality</span> longbow, but I presume you already knew that."},{"name":"BEATINE","text":"Gairhard's squad is considered one of the finest units in the Yellow Serpents. They are oft tasked with dangerous missions which carry them deep into hostile territory."},{"name":"BEATINE","text":"Our soldiers should never want for the best materiel. I trust you will not disappoint, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"Have you the longbow, <span class=\"highlight\">Forename</span>?"},{"name":"BEATINE","text":"Marvelous, simply marvelous!"},{"name":"BEATINE","text":"Some carpenters claim that oak is ill-suited for use in longbows, and that other woods are far preferable."},{"name":"BEATINE","text":"But I would say you've chosen your materials well. This particular specimen is both hard and elastic, and I see no reason to believe it will take a permanent bend."},{"name":"BEATINE","text":"Of course, we have <span class=\"emphasis\">you</span> to thank for that. The finest materials are nothing without a skilled craftsman to mold them."},{"name":"BEATINE","text":"Indeed, this longbow is a testament to your ever-growing skills."},{"name":"BEATINE","text":"Gairhard will approve. You may take it to him at the Adders' Nest."},{"name":"GAIRHARD","text":"Ah, <span class=\"highlight\">Forename</span>! Do you have that longbow I requested?"},{"name":"GAIRHARD","text":"My word! I see my faith in you was not misplaced."},{"name":"GAIRHARD","text":"I have a young archer under my command who will be thrilled to receive this."},{"name":"GAIRHARD","text":"It's of critical importance that my squad keeps its weapons and armor in good shape. Our reconnaissance missions often require that we spend weeks in isolation, without any form of support."},{"name":"GAIRHARD","text":"In fact, we leave for our next mission on the morrow. Unfortunately, this means I must once again postpone my visit to the guild."},{"name":"GAIRHARD","text":"If Beatin complains, just give him a piece of quality lumber on my behalf. That should provide ample distraction. He's always been more passionate about his work than anything else..."},{"name":"GAIRHARD","text":"But I imagine you learned that long ago. Until we meet again, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"Gairhard was satisfied, then? Good, good..."},{"name":"BEATINE","text":"Hm? Another mission?"},{"name":"BEATINE","text":"I...I understand. We are both professionals, with responsibilities that cannot be ignored. Even so, it always gives me cause for worry."},{"name":"BEATINE","text":"I do not question his ability as a commander or as an archer. But, irrational as it may be, I..."},{"name":"BEATINE","text":"Ah, forgive me. I am cursed with an overactive imagination. It is nothing, never mind."},{"name":"BEATINE","text":"We shall speak again when next I have a commission for you."}],"reward":{"items":[{"id":2322},{"id":2769,"one":1},{"id":3130,"one":1},{"id":3607,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":9}],"quests":[65705]},"next":[66073]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000125","obj":{"i":1000125,"n":"Gairhard","l":52,"q":4}},{"type":"item","id":"2322","obj":{"i":2322,"n":"Crosscut Saw","l":34,"c":35007,"t":12,"p":4033}},{"type":"item","id":"2769","obj":{"i":2769,"n":"Mythril Magnifiers","l":34,"c":40901,"t":34,"p":2953}},{"type":"item","id":"3130","obj":{"i":3130,"n":"Apprentice's Smock","l":36,"c":42185,"t":35}},{"type":"item","id":"3607","obj":{"i":3607,"n":"Linen Halfgloves","l":33,"c":44161,"t":37,"p":2195}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"1917","obj":{"i":1917,"n":"Oak Longbow","l":35,"c":32226,"t":4,"p":5616}},{"type":"quest","id":"65705","obj":{"i":65705,"n":"Between Captain and Conjurer","g":136,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66073","obj":{"i":66073,"n":"Memento Mori","g":136,"l":"Gridania","s":400,"f":1}}]}