{"quest":{"name":"Saving Captain Gairhard","location":"Gridania","id":66075,"patch":2.0,"sort":500,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000162,1003072,1003073],"genre":136,"usedItems":[5376,1942],"journal":["Timbermaster Beatin is in great distress.","Beatin has been inconsolable since the discovery of Gairhard's broken bow. Believing his dear friend to be deceased, he asks that you give him time to be alone. Speak with Nicoliaux and see if he has any ideas as to how you can comfort the timbermaster.","Nicoliaux tells you of how the timbermaster flew into a terrible rage upon receiving word of Gairhard's presumed death, breaking anything within reach with his bare hands. Although Nicoliaux believes the situation to be hopeless, he suggests that you present a length of high-quality rosewood lumber to Beatin, in an effort to distract the timbermaster with work.","Your attempt to distract Beatin unexpectedly triggers the revelation that Gairhard and his squad must still be alive. However, the timbermaster fears that his friend is in dire need of assistance. Unable to grip a saw due to the injuries he incurred while rampaging through the workshop, he asks you to craft a quality crab bow and meld to it a grade three savage aim materia. Once you have prepared the bow, track down Gairhard in the North Shroud and see that he receives the help he needs.","You fortuitously stumble upon Gairhard's squad, which is locked in battle with the Ixal. Amazed by the inexplicable appearance of a carpenter in the middle of a battlefield, he is shocked to receive the crab bow. After sparing the briefest of thanks, he turns his attention to the Ixal and promptly slays their leader with a single arrow. Their forces in disarray, the Ixal are forced to retreat. Return to Gridania and inform Beatin of all that has transpired.","Beatin thanks you profusely for saving Gairhard's life, and states that he owes you a debt that can never be repaid. He furthermore declares that you have grown into a master artisan, and that he has nothing else to teach you. Inspired by your example, the timbermaster resolves to refine his own skills, and wishes you luck in your never-ending journey to become a better carpenter.<br><br>※The next carpenter quest will be available from Beatin once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Nicoliaux.","Present a length of rosewood lumber <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Beatin.","Deliver a crab bow <img class=\"hq-icon small\" src=\"images/item/hq.png\"> melded with a savage aim materia III to Gairhard in the North Shroud.","Report to Beatin."],"dialogue":[{"name":"BEATINE","text":"Oh, <span class=\"highlight\">Forename</span>! It's horrible! It's so horrible!"},{"name":"BEATINE","text":"An officer from the Adders' Nest came to speak with me. In the North Shroud, near Ixali territory, they...they found..."},{"name":"BEATINE","text":"Gairhard's longbow!"},{"name":"BEATINE","text":"I saw the fragments myself. It was the selfsame maple longbow I made all those years ago. Which means..."},{"name":"BEATINE","text":"He... Gairhard is..."},{"name":"BEATINE","text":"I wish to be alone right now, <span class=\"highlight\">Forename</span>. Go... Be with your loved ones, or play with the younglings in the Acorn Orchard."},{"name":"NICOLIAUX","text":"Hey, <span class=\"highlight\">Forename</span>. It's good you weren't here earlier when Beatin heard the news. He went on a rampage in the workshop, howling like an animal and breaking anything within reach with his bare hands!"},{"name":"NICOLIAUX","text":"I don't think we can help him this time... But if you want to try, you could give him some really, <span class=\"emphasis\">really</span> good wood─like, say, the <span class=\"emphasis\">best</span> length of rosewood lumber you can make. Maybe that would work?"},{"name":"BEATINE","text":"Why...why have you returned? I told you, I wish to be alone."},{"name":"BEATINE","text":"This...this is..."},{"name":"BEATINE","text":"This is an exquisite length of rosewood lumber. Truly, the culmination of decades of growth and maturation..."},{"name":"BEATINE","text":"&lt;sigh&gt; I know you mean well, <span class=\"highlight\">Forename</span>, but it is no use. My thoughts remain with Gairhard."},{"name":"BEATINE","text":"Like a young sapling, he matured into a magnificent tree...only to be cut down before his─"},{"name":"BEATINE","text":"...Wait, what am I saying? Gairhard was no <span class=\"emphasis\">sapling</span>. He was one of our finest. And the scouts...the scouts found signs of a skirmish, but no bodies!"},{"name":"BEATINE","text":"Do you not see? He must still be alive! He and his squad are out there somewhere, isolated and likely low on supplies. I know for a fact that he only carries one bow, so if that weapon has been broken... Matron forfend, he could be defenseless!"},{"name":"BEATINE","text":"He must needs be sent a new one straightaway! But...I fear I am in no condition to craft it. In my earlier foolish tantrum, I injured my hand, and have not the strength to grip a saw."},{"name":"BEATINE","text":"<span class=\"emphasis\">You</span> must be the one to craft Gairhard's bow, <span class=\"highlight\">Forename</span>. I beg of you, make him a peerless crab bow and affix to it a savage aim materia of the third grade."},{"name":"BEATINE","text":"Once finished, seek out Gairhard and his men in the North Shroud. The fragments of his old longbow were found not far from Alder Springs. If the Matron is merciful, you will find him not far from there."},{"name":"BEATINE","text":"Please, <span class=\"highlight\">Forename</span>. You are my one and only hope."},{"name":"GAIRHARD","text":"What do you think you're doing here!? Take cover, you fool─there are Ixal about!"},{"name":"GAIRHARD","text":"Dammit, <span class=\"highlight\">Forename</span>, this is no place for a carpenter!"},{"name":"GAIRHARD","text":"A <span class=\"emphasis\">bow</span>? Did Beatin send you all this way just to deliver a <span class=\"emphasis\">bow</span>?"},{"name":"GAIRHARD","text":"That... He... Gods bless that stubborn fool!"},{"name":"GAIRHARD","text":"I should have listened when he said my maple longbow was at its limit."},{"name":"GAIRHARD","text":"My thanks, <span class=\"highlight\">Forename</span>. If it weren't for you, I don't know what I would've done."},{"name":"GAIRHARD","text":"Now keep your head down! I've a chieftain to slay!"},{"name":"GAIRHARD","text":"Ngaaah!"},{"name":"GAIRHARD","text":"You saved lives this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">day</span></span>. I cannot thank you enough, <span class=\"highlight\">Forename</span>. Please let Beatin know that we are fine, and that I will see him again soon."},{"name":"BEATINE","text":"I could kiss you, <span class=\"highlight\">Forename</span>! He lives! Gairhard lives!"},{"name":"BEATINE","text":"I owe you a debt that can never be repaid. A thousand times over, I thank you."},{"name":"BEATINE","text":"You came to us as a seedling, yet now you are as a heavenspillar. There is naught else I have to teach you."},{"name":"BEATINE","text":"In fact, you have inspired <span class=\"emphasis\">me</span> to reflect on mine own deficiencies."},{"name":"BEATINE","text":"Minor though they may be, I would be remiss if I neglected personal development. Though you are no longer under my tutelage, I trust you will continue to hone your craft as well. Best of luck to you, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"This concludes the carpenter quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next carpenter quest will be available from Beatin."}],"reward":{"items":[{"id":2327},{"id":2920,"one":1},{"id":3706,"one":1},{"id":3927,"one":1},{"num":3,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":9}],"quests":[66074]},"next":[67533]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000162","obj":{"i":1000162,"n":"Nicoliaux","l":52,"q":5}},{"type":"npc","id":"1003072","obj":{"i":1003072,"n":"Gairhard","l":57,"q":1}},{"type":"npc","id":"1003073","obj":{"i":1003073,"n":"Gairhard","l":57,"q":1}},{"type":"item","id":"2327","obj":{"i":2327,"n":"Ullikummi","l":55,"c":35012,"t":12,"p":1000}},{"type":"item","id":"2920","obj":{"i":2920,"n":"Carpenter's Hood","l":55,"c":41140,"t":34}},{"type":"item","id":"3706","obj":{"i":3706,"n":"Carpenter's Gloves","l":55,"c":44195,"t":37}},{"type":"item","id":"3927","obj":{"i":3927,"n":"Carpenter's Workboots","l":55,"c":46355,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"5376","obj":{"i":5376,"n":"Rosewood Lumber","l":45,"c":22464,"t":50}},{"type":"item","id":"1942","obj":{"i":1942,"n":"Crab Bow","l":49,"c":32217,"t":4}},{"type":"quest","id":"66074","obj":{"i":66074,"n":"Gone till the Sixth Astral Moon","g":136,"l":"Gridania","s":450,"f":1}},{"type":"quest","id":"67533","obj":{"i":67533,"n":"Lance of a Lifetime","g":136,"l":"Gridania","s":502,"f":1}}]}