{"quest":{"name":"Memento Mori","location":"Gridania","id":66073,"patch":2.0,"sort":400,"icon":100062,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000125],"genre":136,"usedItems":[1925],"journal":["Timbermaster Beatin is staring at you quite intently.","Gairhard has once again named you as his carpenter of choice and requested that you craft an oak composite bow. Beatin speculates that the bow is for Gairhard himself, and will therefore settle for nothing less than absolute perfection. Craft a quality oak composite bow and present it to the timbermaster.","Despite his best efforts, Beatin is unable to find flaw with your craftsmanship. Thus satisfied, he bids you deliver the bow to Gairhard at the Adders' Nest.","Somewhat surprised by Beatin's presumption, Gairhard explains that the bow you crafted is intended for another archer under his command. The captain still wields the same maple longbow that the timbermaster crafted for him many years ago. Return to the Carpenters' Guild and speak with Beatin.","Beatin displays mixed emotions upon learning that Gairhard still carries his old longbow. He muses on the revelation briefly, before remembering your presence and subsequently dismissing you.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 45."],"objectives":["Present an oak composite bow <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Beatin.","Deliver the oak composite bow <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Gairhard.","Report to Beatin."],"dialogue":[{"name":"BEATINE","text":"<span class=\"highlight\">Forename</span>, you <span class=\"alternative-container\"><span class=\"alternative\">minx</span><span class=\"alternative\">devil</span></span>! If I didn't know better, I'd say Gairhard was smitten with you."},{"name":"BEATINE","text":"He's given you another commission─this time for an oak composite bow. In case you were unaware, such a bow can only be wielded by a master archer, with years upon years of experience in the field."},{"name":"BEATINE","text":"Don't you see? You are to craft a bow for Gairhard himself!"},{"name":"BEATINE","text":"You are to give this commission your undivided attention, <span class=\"highlight\">Forename</span>. While simply crafting an oak composite bow is no small feat, I will <span class=\"emphasis\">not</span> permit you to present anything less than <span class=\"emphasis\">perfection</span>."},{"name":"BEATINE","text":"Have I made myself clear? Good. Now, go."},{"name":"BEATINE","text":"Only <span class=\"emphasis\">perfection</span> will suffice, <span class=\"highlight\">Forename</span>. If you have it, then show me."},{"name":"BEATINE","text":"Even experienced carpenters can find constructing a composite bow to be a daunting task, given the complexity of the design and the variety of materials required."},{"name":"BEATINE","text":"But the resulting product is well worth the price."},{"name":"BEATINE","text":"This union of wood, bone, and sinew possesses the power of a self bow more than twice its size."},{"name":"BEATINE","text":"This makes it ideal for archers who must travel with minimal supplies and cannot afford to carry heavier equipment."},{"name":"BEATINE","text":"No matter how much I search, I cannot find flaw with your craftsmanship. Your materials, your execution...it is all, for want of a better word, perfect."},{"name":"BEATINE","text":"It comforts me to know that Gairhard will wield this formidable weapon. Deliver it to him with my blessings."},{"name":"GAIRHARD","text":"Greetings, <span class=\"highlight\">Forename</span>. I believe you have a delivery for me?"},{"name":"GAIRHARD","text":"Now this is a fine bow, worthy of the Bowlord himself! The girl will be pleased."},{"name":"GAIRHARD","text":"What's that? Beatin thought this was for me? Oh no, this is for another one of my archers."},{"name":"GAIRHARD","text":"I have a perfectly serviceable bow which has served me for many years. Beatin ought to know─he made it."},{"name":"GAIRHARD","text":"Ah, those were the days. He the young initiate, I the aspiring Serpent. He wasn't always so damn cocksure, you know. Back then, he was full of doubts and questions..."},{"name":"GAIRHARD","text":"The maple longbow he made me might not look like much to you, but to me it's the perfect weapon. I intend to use it until the day I die."},{"name":"GAIRHARD","text":"Not that I intend to die any time soon, of course! Now then, I believe I have a delivery of my own to make. If you'll excuse me, <span class=\"highlight\">Forename</span>."},{"name":"BEATINE","text":"Welcome back, <span class=\"highlight\">Forename</span>. Was Gairhard well?"},{"name":"BEATINE","text":"What!? He still uses that longbow I made as an initiate?"},{"name":"BEATINE","text":"I didn't think he kept it..."},{"name":"BEATINE","text":"But a Twin Adder captain deserves a far finer weapon. I should offer to craft him a new one."},{"name":"BEATINE","text":"“Until the day I die.” Hmph. What nonsense."},{"name":"BEATINE","text":"Surely that longbow is no more than a mangled stick at this point. If it were to break during battle, he would only have himself to blame."},{"name":"BEATINE","text":"Ugh, but I cannot stand idly by while he... &lt;sigh&gt; No, no, I will give this no more thought. He is an experienced soldier; he would never be so reckless..."},{"name":"BEATINE","text":"Oh! I did not realize you were still here, <span class=\"highlight\">Forename</span>. You may go. I have nothing else for you today."}],"reward":{"items":[{"id":2336},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":9}],"quests":[66072]},"next":[66074]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000125","obj":{"i":1000125,"n":"Gairhard","l":52,"q":4}},{"type":"item","id":"2336","obj":{"i":2336,"n":"Apprentice's Claw Hammer","l":40,"c":35053,"t":13}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"1925","obj":{"i":1925,"n":"Oak Composite Bow","l":40,"c":32214,"t":4,"p":7776}},{"type":"quest","id":"66072","obj":{"i":66072,"n":"Growing Apart","g":136,"l":"Gridania","s":350,"f":1}},{"type":"quest","id":"66074","obj":{"i":66074,"n":"Gone till the Sixth Astral Moon","g":136,"l":"Gridania","s":450,"f":1}}]}