{"quest":{"name":"Duty, Honor, Country","location":"Ul'dah","id":66087,"patch":2.0,"sort":83,"icon":100089,"eventIcon":71201,"issuer":1001353,"target":1004003,"involved":[1004002,1004005],"genre":1,"journal":["Momodi wishes to enlist the aid of a trusted friend of Ul'dah.","Having sworn you to secrecy, Momodi reveals that the royal crown has been stolen. According to her, if the theft were to be made public, it would tarnish the sultana's reputation. She suspects that the missive which Fufulupa found amongst Baldewyn's possessions was written by the perpetrators of this crime. Momodi bids you bear the letter to its intended recipient, Owyne of the Sultansworn, and offer your assistance.","Owyne confirms that the letter is a ransom note from the thieves, stating their demands for the return of the crown. Believing there to be no other way, the guilt-ridden Sultansworn decides to give the criminals what they want. Rendezvous with him at the Unholy Heir in central Thanalan and ensure the exchange goes as planned.","Having taken receipt of their payment, the thieves rather predictably attempt to murder you, but with the aid of Papashan and a band of Sultansworn, you defeat them.","After the Sultansworn leave, you find yourself alone with the masked mage who orchestrated the theft, and another battle ensues. Fortunately, Thancred comes to your aid, and together you emerge triumphant. Though the motives of this “Ascian” remain a mystery, his schemes now lie in ruin. Return to the Heart of the Sworn and find out if the Sultansworn have recovered the crown.","The sultana visits the Heart of the Sworn to thank you personally for helping to recover the crown, and to request your presence at the forthcoming banquet as her guest of honor. Though her gesture leaves you speechless, you gather your composure and accept, already looking forward to your next meeting."],"objectives":["Deliver the letter to Owyne.","Rendezvous with Owyne at the Unholy Heir.","Speak with Papashan in the Heart of the Sworn."],"dialogue":[{"name":"MOMODI","text":"Can I count on your discretion, <span class=\"highlight\">Forename</span>? If so, then listen closely..."},{"name":"MOMODI","text":"The outside world believes Ul'dah to be a sultanate, ruled by Sultana Nanamo Ul Namo. Truth is, though, it's the six wealthiest citizens that hold the most sway─the Syndicate."},{"name":"MOMODI","text":"Be that as it may, the sultana's still got the support of the people..."},{"name":"MOMODI","text":"But she might struggle to keep even that if a certain incident becomes public knowledge."},{"name":"MOMODI","text":"It pains me to say it, but Her Grace's crown, the symbol of the royal dynasty, has been stolen."},{"name":"MOMODI","text":"And Owyne...Owyne's the Sultansworn who was charged with guardin' it that night."},{"name":"MOMODI","text":"I'd bet anythin' this letter was written by the bastards who made off with the crown."},{"name":"MOMODI","text":"It can't be a coincidence that a man we know to have been fraternizin' with thieves had a letter for Owyne of all people, at this of all times."},{"name":"MOMODI","text":"You need to take this to the man himself, <span class=\"highlight\">Forename</span>. Tell him Momodi sent you, and that it concerns a lost heirloom."},{"name":"MOMODI","text":"If it looks as though the fellow needs help, I want you to lend it to him. The future of our fair city may depend on it."},{"name":"SULTANSWORMA","text":"The Heart of the Sworn lies beyond. State your business."},{"name":"SULTANSWORMA","text":"...Pardon? Did you say a <span class=\"emphasis\">lost heirloom</span>? Ahem. Proceed."},{"name":"Q1","text":"Proceed into the Heart of the Sworn? "},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"SULTANSWORMA","text":"What are you playing at, adventurer? Did Momodi truly send you? If this is some sort of prank, there <span class=\"emphasis\">will</span> be consequences!"},{"name":"OWYNE","text":"Well met, adventurer. What business brings you here this day?"},{"name":"OWYNE","text":"...A letter? Very well, let's see it."},{"name":"OWYNE","text":"...Have you read this, adventurer?"},{"name":"OWYNE","text":"I see. But you have some inkling as to its contents, I think."},{"name":"OWYNE","text":"Mistress Momodi has doubtless explained to you the significance of the crown, and what its loss could mean for Her Grace the sultana... &lt;sigh&gt; This theft shames the Sultansworn─and me most of all."},{"name":"OWYNE","text":"The blame is mine, you see. I grew lax in my duties, and in a moment of carelessness..."},{"name":"OWYNE","text":"No, it will do no good to recount the tale now.<br>Since the hour of the theft, we've searched frantically for any signs, any whispers as to the whereabouts of the crown. We have found nothing."},{"name":"OWYNE","text":"The identity of the thieves, and their motives, seemed fated to remain a mystery─until you arrived, bearing this ransom note."},{"name":"OWYNE","text":"In it, the criminals state their price for the return of Her Grace's crown."},{"name":"OWYNE","text":"And though it pains me to say it, I fear I have no choice but to acquiesce to their demands. Too much is at stake to do otherwise. The crown symbolizes Her Grace's birthright, and identifies her as the custodian of the Ul legacy. It <span class=\"emphasis\">must</span> be recovered."},{"name":"OWYNE","text":"I will travel to the Unholy Heir and pay them their ransom."},{"name":"OWYNE","text":"Though I am not foolish enough to meet these men alone as they stipulate, I dare not bring a host of my comrades lest the thieves take fright. Friend─would <span class=\"emphasis\">you</span> consent to be present for the exchange?"},{"name":"OWYNE","text":"Mistress Momodi has always spoken of you in the most glowing terms, and I have never yet had reason to question her judgment."},{"name":"OWYNE","text":"On behalf of all those still loyal to the sultana, I beseech you─help us in our hour of need."},{"name":"OWYNE","text":"Pray meet me at the Unholy Heir in central Thanalan, east of Black Brush Station. If the gods are good, the exchange will proceed without incident..."},{"name":"INSTANCE","text":"Duty calls. Do you wish to proceed with<br>“MANWIL007”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"OWYNE","text":"I've come as agreed! Now, show me the crown!"},{"name":"GARIBALD","text":"Aye, you'll have your precious crown─once we've been duly compensated."},{"name":"OWYNE","text":"Do you think me a fool!? What assurance have I that you will honor your part of the agreement?"},{"name":"GARIBALD","text":"Now, now, Owyne...you're the least trustworthy man here. Not only was the crown stolen on <span class=\"emphasis\">your</span> watch, but it looks to me as if you've violated the terms of our exchange. Did we not say that you were to come alone?"},{"name":"GARIBALD","text":"And given that you are <span class=\"emphasis\">not</span> alone, what guarantee have we that there isn't a company of archers surrounding us even as we speak, ready to feather me and my men the moment they catch a glimpse of the crown?"},{"name":"GARIBALD","text":"You have made mock of our trust. The deal is off."},{"name":"OWYNE","text":"Wait! Here's your payment, as promised!"},{"name":"GARIBALD","text":"&lt;sniff&gt; &lt;sniff&gt; ...Aye, 'tis the real thing."},{"name":"GARIBALD","text":"Ahahaha! A thousand thanks to you, boy! You've succeeded where scores of thieves have failed!"},{"name":"GARIBALD","text":"And now, at long last, we have it! The power to create an army of undying soldiers─<span class=\"emphasis\">The Traders' Spurn</span>!"},{"name":"OWYNE","text":"No...no, it can't be! What have I done!?"},{"name":"GARIBALD","text":"Surely you must have wondered what it was that you were handing over─what it was that seemed as valuable to us as the crown seemed to you? Or did you assume we were feeling <span class=\"emphasis\">charitable</span>?"},{"name":"GARIBALD","text":"Ah, but you must feel terrible, knowing that you've brought us the doom of Sil'dih. Worry not, boy─we'll grant you a quick death and spare you further ignominy."},{"name":"OWYNE","text":"There's too many, <span class=\"highlight\">Forename</span>! Run! Run while you still can! I...I will do my duty."},{"name":"PAPASHAN","text":"(-???-)It's your duty to serve the sultana, lad─and you'll be doing it for a good while yet!"},{"name":"PAPASHAN","text":"Sultansworn! Put these thieves to the sword and secure the crown!"},{"name":"GARIBALD","text":"Sultansworn!? Hah! No matter! Kill them all!"},{"name":"OWYNE","text":"Master Papashan! But why...? How...?"},{"name":"PAPASHAN","text":"The General saw you sneak into the vaults, Owyne."},{"name":"PAPASHAN","text":"He suspected something was afoot and ordered us to keep an eye on you."},{"name":"OWYNE","text":"The Flame General...? He ordered you to look after me?"},{"name":"SULTANSWORM","text":"Master Papashan! More of them to the north!"},{"name":"PAPASHAN","text":"After them, Sultansworn─they have the crown! This lot sought only to delay us!"},{"name":"OWYNE","text":"Let us speak again back in the city!"},{"name":"MASKEDMAGUS","text":"The source of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength becomes clear..."},{"name":"MASKEDMAGUS","text":"You may have bested the golem, but you will not fare so well this day."},{"name":"MASKEDMAGUS","text":"<span class=\"highlight-purple\">O mournful voice of creation! Send unto me a creature of the abyss, my thrall to command, that I may smite mine enemies!</span>"},{"name":"MASKEDMAGUS","text":"Your very being imperils the plan. You cannot be suffered to live."},{"name":"MASKEDMAGUS","text":"Unnngh... That the wisdom of the Paragons should be brought low...by mere mortals..."},{"name":"THANCRED","text":"Paragons? This is indeed a disturbing revelation..."},{"name":"THANCRED","text":"We had long suspected the involvement of the Bringers of Chaos─<span class=\"emphasis\">Ascians</span>, to give them their true name."},{"name":"THANCRED","text":"But we could not be sure they were responsible for the recent disturbances until now. As if the sultanate needed any more enemies..."},{"name":"THANCRED","text":"Hm? Have we Sharlayans crossed paths with Ascians before? Well, we've certainly─ Wait. I don't recall telling you about my homeland."},{"name":"THANCRED","text":"Ah, yes, that's right─you're one of the gifted."},{"name":"THANCRED","text":"You know, this marks the third time I've found you in the midst of trouble. If I didn't know any better, I'd say you're a lodestone for it!"},{"name":"THANCRED","text":"Anyway, I'm glad I started following you around. Who knows what grand conspiracy you'll stumble upon next!?"},{"name":"THANCRED","text":"I jest, I jest... Had I truly been watching your every move, I wouldn't have taken so long to intervene in your latest altercation."},{"name":"THANCRED","text":"But all's well that ends well, eh? Our masked friend is no more, and while I very much doubt we've seen the last of his kind, his demise will likely grant us at least <span class=\"emphasis\">some</span> respite. And on that note, I must away. Until next time, <span class=\"highlight\">Forename</span>."},{"name":"SULTANSWORMA","text":"Everyone is waiting for you, adventurer."},{"name":"SULTANSWORMA","text":"Pray do not keep my comrades waiting."},{"name":"PAPASHAN","text":"Does it surprise you to see me dressed so, <span class=\"highlight\">Forename</span>? I was once a Sultansworn, you know, though it's been fifteen years since I put down my sword, and took up the role of stationmaster."},{"name":"PAPASHAN","text":"It is a capacity in which I am no less proud to serve, lest you doubt. Whenever Her Grace ventures outside the gates, I have the honor of protecting her person."},{"name":"PAPASHAN","text":"Never before had I seen her so despondent as when news of the crown's theft reached her ears."},{"name":"PAPASHAN","text":"But thanks to your valiant efforts, she is returned to her former vibrant self. You have the gratitude of every Sultansworn, <span class=\"highlight\">Forename</span>."},{"name":"LADYSMAID","text":"Exalted vessel of Nald'thal, guardian of Thanalan, seventeenth ascendant to the throne of Ul'dah, Her Royal Majesty Nanamo Ul Namo presides!"},{"name":"SULTANSWORM","text":"Long live Nanamo! Glory to the Sultana! Forever may she reign!"},{"name":"SULTANSWORM","text":"Long live Nanamo! Glory to the Sultana! Forever may she reign!"},{"name":"NANAMOULNAMO","text":"They regaled me with tales of a champion amongst champions, one whose tireless service to the crown merited the highest honor we might bestow."},{"name":"NANAMOULNAMO","text":"Never did it occur to me that it might be you. Bring it forth!"},{"name":"NANAMOULNAMO","text":"Betokening our gratitude and esteem, I, Nanamo Ul Namo, Sultana of Ul'dah, confer upon you this gift."},{"name":"NANAMOULNAMO","text":"Raubahn."},{"name":"RAUBAHN","text":"Your Grace."},{"name":"NANAMOULNAMO","text":"See to it that our champion is my personal guest at the banquet."},{"name":"RAUBAHN","text":"As you command, Your Grace."},{"name":"RAUBAHN","text":"If what they say is true, Ul'dah owes you a great debt."},{"name":"RAUBAHN","text":"Strange that we should not have met before this day..."},{"name":"RAUBAHN","text":"...I sense we are kindred spirits."},{"name":"RAUBAHN","text":"I am not given to superstition, but I'll be sworn our tales belong in the same saga."},{"name":"RAUBAHN","text":"I am Raubahn Aldynn. With the consent of Her Grace, I oversee the affairs of the sultanate."},{"name":"RAUBAHN","text":"Brave souls are few and far between in these times. I count my blessings when I find one."},{"name":"RAUBAHN","text":"Her Grace invites you to join her at the coming banquet. I trust I will see you there."},{"name":"SULTANSWORM","text":"An honor indeed!"},{"name":"SULTANSWORM","text":"Huzzah! Come, hero!"},{"name":"RAUBAHN","text":"Until then."},{"name":"RAUBAHN","text":"For the sake of Her Grace, and the glory of the sultanate, may you walk in the light of the Crystal."},{"name":"OWYNE","text":"You have my thanks, <span class=\"highlight\">Forename</span>, for helping to defend Her Grace's good name, and for sparing the Sultansworn further dishonor. I believe Master Papashan would like to thank you personally."},{"name":"QIB","text":"Defeat Garibald the Fargone and his minions!"},{"name":"QIB","text":"Fight for your sultana, boy! Fight for Ul'dah!"},{"name":"QIB","text":"Yield or be slain, thief! I will not ask again!"},{"name":"QIB","text":"As you command, Master Papashan!<br>With me, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Ugh...there are so many..."},{"name":"QIB","text":"Old men shouldn't play with swords!"},{"name":"QIB","text":"I will cut your heart out, old man!"},{"name":"QIB","text":"Stand your ground, Sultansworn!"},{"name":"QIB","text":"Is that a <span class=\"emphasis\">voidsent</span>!?"},{"name":"QIB","text":"Meddlesome fools! You know not whom you face!"},{"name":"QIB","text":"Hearken to me, denizen of the abyss!<br>Slay these interlopers and feast upon their souls!"},{"name":"QIB","text":"Whatever happens, do not let them escape with the crown!"},{"name":"QIB","text":"Ugh...I have failed you..."},{"name":"QIB","text":"The crown... We must..."},{"name":"QIB","text":"I...I cannot..."},{"name":"QIB","text":"Forgive me, brothers..."},{"name":"QIB","text":"Defeat the masked mage!"},{"name":"QIB","text":"Soon, you shall take your vile gifts to the grave!"},{"name":"QIB","text":"Mwahahaha!<br>Writhe as the venom eats its way through your veins!"},{"name":"QIB","text":"An unwelcome guest. No matter, all shall fall before me!"},{"name":"QIB","text":"Whence springs this preternatural might!?"},{"name":"QIB","text":"You certainly have a knack for getting into trouble!"},{"name":"QIB","text":"No mortal should possess such strength!"},{"name":"QIB","text":"Keep it up, <span class=\"highlight\">Forename</span>!<br>We almost have him!"}],"reward":{"gil":220,"items":[{"id":4429}],"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[66164]},"next":[66177]},"partials":[{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1004003","obj":{"i":1004003,"n":"Papashan","l":354,"q":1}},{"type":"npc","id":"1004002","obj":{"i":1004002,"n":"Owyne","l":354,"q":2}},{"type":"npc","id":"1004005","obj":{"i":1004005,"n":"Sultansworn Elite","l":41,"q":2}},{"type":"item","id":"4429","obj":{"i":4429,"n":"Ul'dahn Ring","l":15,"c":54414,"t":43,"p":100}},{"type":"quest","id":"66164","obj":{"i":66164,"n":"Secrets and Lies","g":1,"l":"Western Thanalan","s":82}},{"type":"quest","id":"66177","obj":{"i":66177,"n":"A Matter of Tradition","g":1,"l":"Ul'dah","s":84}}]}