{"quest":{"name":"A Royal Reception","location":"Ul'dah","id":66088,"patch":2.0,"sort":85,"icon":100090,"eventIcon":71201,"issuer":1001353,"target":1004004,"involved":[1001821,1004093],"genre":1,"usedItems":[4196],"journal":["Momodi wants to see you off to the banquet.","The banquet is soon to begin. Put on the Voice of the Just and make for the Royal Promenade where Bartholomew awaits.","At the banquet, Raubahn recounts the deeds of the half-remembered heroes whom Eorzeans now call the Warriors of Light. The tale triggers inside your mind a vision of the final moments of the Battle of Carteneau. When you subsequently come to your senses, you are surprised to find yourself in a room at the Hourglass, with no idea how you got there. Betraying a mixture of relief and glee, Momodi explains that you collapsed, and mentions that the General would like to see you. Make your way to the Hall of Flames and seek an audience with him.","The Flame General declares that there is work to be done─and that he would have you do it. Speak to him again when you are ready to begin."],"objectives":["Put on the Voice of the Just and speak with Bartholomew.","Speak with Raubahn in the Hall of Flames."],"dialogue":[{"name":"MOMODI","text":"This is it, <span class=\"highlight\">Forename</span>─your big debut in Ul'dahn high society!"},{"name":"MOMODI","text":"The banquet is bein' held in the Fragrant Chamber. Head over to the Royal Promenade and Bartholomew will show you in. Oh, but be sure to put on your earrin's first, or he'll send you packin'."},{"name":"MOMODI","text":"Right, well, I reckon that's everythin'. Try not to let all the pomp and ceremony get to you. Just be yourself and you'll be fine!"},{"name":"BARTHOLOMEW","text":"A banquet hosted by Her Grace the sultana is due to begin shortly. Attendance is by invitation only. Please make way for arriving guests."},{"name":"BARTHOLOMEW","text":"We are honored to receive you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. Please proceed inside."},{"name":"BARTHOLOMEW","text":"Ahem. I must ask that you step away from the doors, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. If you have received an invitation, pray consider the terms of admission."},{"name":"BARTHOLOMEW","text":"And Twelve save you if you have misplaced the relevant articles! I can only imagine how horrified Mistress Serendipity would be if she had to furnish you with another pair..."},{"name":"RAUBAHN","text":"All hail the sultana!"},{"name":"RAUBAHN","text":"Your Grace."},{"name":"NANAMOULNAMO","text":"Raubahn."},{"name":"NANAMOULNAMO","text":"By right of the Royal House of Ul, I, Nanamo, seventeenth of my line, have summoned you here."},{"name":"NANAMOULNAMO","text":"We are graced this day by the presence of a hero to Ul'dah, and dear friend to the crown."},{"name":"NANAMOULNAMO","text":"Honored guests, I give you our champion!"},{"name":"NANAMOULNAMO","text":"And with that, I bid you enjoy the feast."},{"name":"RAUBAHN","text":"Not to spoil your appetite, but Ul'dah is hardly so bountiful as this meal would have you believe. While we gorge ourselves, children starve in the streets."},{"name":"RAUBAHN","text":"Nor can Her Grace do aught to help them. She is thwarted at every turn by those on the Syndicate who derive their wealth from the workers' poverty."},{"name":"RAUBAHN","text":"Beneath her mask of stately serenity, she is aghast at the plight of her subjects."},{"name":"RAUBAHN","text":"But there will be no hope for the masses until the crown is restored to power."},{"name":"RAUBAHN","text":"I am truly grateful for all you have done for Ul'dah. But there is so much more to do."},{"name":"RAUBAHN","text":"That light─what is it?"},{"name":"RAUBAHN","text":"So bright... Almost like... By the Twelve!"},{"name":"RAUBAHN","text":"Tell me true─have you been troubled by strange dreams of late? Visions─of the Crystal?"},{"name":"RAUBAHN","text":"Mayhap you put them down to an excess of aether?"},{"name":"RAUBAHN","text":"Yes. You are like <span class=\"emphasis\">they</span> were..."},{"name":"RAUBAHN","text":"Allow me to explain. Before you came to Eorzea, there were others like you who fought the primals."},{"name":"RAUBAHN","text":"Though they were not of this land, when the Garlean Empire threatened the realm, they helped bring together the three Grand Companies."},{"name":"RAUBAHN","text":"And they stood with us at Carteneau, that fateful day five years ago..."},{"name":"RAUBAHN","text":"...The day we lost them."},{"name":"RAUBAHN","text":"None who survived have forgotten the heroes' sacrifice, nor would any man deny they fought alongside us..."},{"name":"RAUBAHN","text":"But the names of these heroes come not to our lips. The once-familiar pages of their story are now blank to us."},{"name":"RAUBAHN","text":"And in our mind's eye, their faces are naught but silhouettes amid a blinding glare..."},{"name":"RAUBAHN","text":"It is for this reason that we have come to call them the Warriors of Light."},{"name":"RAUBAHN","text":"When I look at you, I cannot help but think of them, and of what you might achieve."},{"name":"RAUBAHN","text":"You must protect that crystal at all costs."},{"name":"RAUBAHN","text":"It is a gift from Hydaelyn, Mother of all─and one She gave to you for a reason."},{"name":"RAUBAHN","text":"Yours is no ordinary tale. If I am right, the fate of the realm may yet hang upon your deeds."},{"name":"RAUBAHN","text":"Only heroes and martyrs are fit to bear such a burden. Let us pray you are the former."},{"name":"MOMODI","text":"How you feelin', <span class=\"highlight\">Forename</span>?"},{"name":"MOMODI","text":"They said you fainted in the middle of one of the General's stories. I had to have you carried back to the Hourglass."},{"name":"MOMODI","text":"I reckon you made quite an impression on your fellow guests─though probably not the sort you intended."},{"name":"MOMODI","text":"You sure you're gettin' enough rest, <span class=\"highlight\">Forename</span>? The life of an adventurer can be pretty taxin'."},{"name":"MOMODI","text":"Anyroad, I'm glad to see you're back to normal. No offense, but lookin' after you was gettin' a bit tiresome."},{"name":"MOMODI","text":"Oh, 'fore I forget, the General left a message for you. Said that when you're feelin' up to it, you should come and see him at the Hall of Flames."},{"name":"MOMODI","text":"Probably wants to finish the story he was tellin' you when you fell asleep."},{"name":"RAUBAHN","text":"I've been waiting for you, <span class=\"highlight\">Forename</span>. I trust you are fully recovered?"},{"name":"RAUBAHN","text":"Good, because there is much work to be done─work that I would have you do..."},{"name":"SERENDIPITY","text":"You want <span class=\"emphasis\">what</span>!? You can't be serious! <span class=\"emphasis\">Gods</span>..."},{"name":"SERENDIPITY","text":"Just this once, but remember─life is not a minstrel's song, and you aren't some chosen hero. So don't go around expecting people to forgive you no matter the reckless, irresponsible things you do."}],"reward":{"gil":319,"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[66177]},"next":[66064,66961,66962,66963]},"partials":[{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1004004","obj":{"i":1004004,"n":"Raubahn","l":40,"q":2}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"4196","obj":{"i":4196,"n":"Voice of the Just","l":1,"c":55213,"t":41,"p":100}},{"type":"quest","id":"66177","obj":{"i":66177,"n":"A Matter of Tradition","g":1,"l":"Ul'dah","s":84}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}},{"type":"quest","id":"66961","obj":{"i":66961,"n":"Saw That One Coming","g":92,"l":"Gridania","s":140}},{"type":"quest","id":"66962","obj":{"i":66962,"n":"Good for What Ales You","g":91,"l":"Limsa Lominsa","s":140}},{"type":"quest","id":"66963","obj":{"i":66963,"n":"Help Me, Lord of the Dance","g":93,"l":"Ul'dah","s":140}}]}