{"quest":{"name":"A Mizzenmast Repast","location":"Limsa Lominsa","id":66081,"patch":2.0,"sort":80,"icon":100082,"eventIcon":71201,"issuer":1000972,"target":1002694,"involved":[1001029,1003355],"genre":1,"usedItems":[3760],"journal":["Baderon wants you to let him know when you are ready to depart for the banquet.","The banquet is soon to begin. Put on your dress shoes, and speak with Zanthael in Bulwark Hall.","At the banquet, Merlwyb recounts the deeds of the half-remembered heroes whom Eorzeans now call the Warriors of Light. The tale triggers inside your mind a vision of the final moments of the Battle of Carteneau. When you subsequently come to your senses, you are surprised to find yourself in a room at the Drowning Wench, with no idea how you got there. Baderon, who apparently carried you back from the Bridge himself, explains that you collapsed, and mentions that the Admiral would like to see you. Make your way to Bulwark Hall, and request admission to the command room.","Merlwyb has a task for you─one which she would entrust to no other. Speak to her again when you are ready to hear what it entails."],"objectives":["Put on the dress shoes and speak with Zanthael.","Speak with Merlwyb in the command room."],"dialogue":[{"name":"BADERON","text":"Yer ready, then, are ye? Good. The banquet'll be startin' soon. If ye'd waited any longer, I'd've considered it me civic duty to 'it ye over the 'ead an' drag ye there."},{"name":"BADERON","text":"Now, make sure yer <span class=\"emphasis\">wearin'</span> them fancy shoes when ye turn up, all right? Carryin' 'em won't do no good. They're meant to make ye look like a <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span>, remember, not a <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span>'s bleedin' lackey."},{"name":"BADERON","text":"As fer directions, the feast's bein' 'eld on the Bridge, in the Admiral's briefin' room."},{"name":"BADERON","text":"Speak with Zanthael in Bulwark Hall, an' 'e'll show ye the way."},{"name":"BADERON","text":"Just keep that 'ead 'eld 'igh, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. After everythin' ye've done fer Limsa, ye've good reason to be proud─an' don't let no 'ighborn bugger tell ye different."},{"name":"ZANTHAEL","text":"Dress shoes... Fancy dress shoes. An adventurer wearing fancy dress shoes..."},{"name":"ZANTHAEL","text":"Godsdammit, Baderon, why could you not have told me this mysterious guest's name, or their hair color, or even their bloody <span class=\"emphasis\">gender</span>!? I'd have settled for a distinctive facial scar! I know nothing about shoes, much less fancy─ What? You say <span class=\"emphasis\">you're</span> the adventurer I'm looking for?"},{"name":"ZANTHAEL","text":"Then where are these “fancy dress shoes” that Baderon described to me in such <span class=\"emphasis\">excruciatingly</span> unhelpful detail? Surely you didn't...? Ahem. He mentioned that if you were so careless as to misplace them, I was supposed to tell you to “get your arse back to J'nasshym, and beg fer another pair.” I never imagined I'd actually have to say it, though..."},{"name":"ZANTHAEL","text":"Oh! Now <span class=\"emphasis\">those</span> are some fancy dress shoes. Come, adventurer, I will show you to the briefing room."},{"name":"MERLWYB","text":"Brothers and sisters of the sea!"},{"name":"MERLWYB","text":"Join me now in honoring this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> services to our great nation!"},{"name":"MERLWYB","text":"May the Navigator guide and protect <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> journey till sea swallows all!"},{"name":"MERLWYB","text":"These pirates you encountered with the tattooed faces... They call themselves the “Serpent Reavers.” Their ranks are formed of cutthroats and madmen who have pledged themselves body and soul to the primal Leviathan."},{"name":"MERLWYB","text":"From what we have gathered, they sought to swell their numbers by spiriting away any soul unfortunate enough to cross their path."},{"name":"MERLWYB","text":"I need not tell you the depth of the animosity between us and the Sahagin. How any seaman worth his salt could devote himself to the fishbacks' god is a question for a more temperate mind than mine."},{"name":"MERLWYB","text":"But thanks to you, our citizens may once more go about their daily lives, safe in the knowledge that they will not be dragged into the darkness by those execrable curs."},{"name":"YSHTOLA","text":"Such an extraordinary glow..."},{"name":"YSHTOLA","text":"This...is one of the Crystals of Light."},{"name":"MERLWYB","text":"By the Navigator..."},{"name":"YSHTOLA","text":"After our encounter with the goobbue, you had a vision, did you not? Of a towering crystal?"},{"name":"YSHTOLA","text":"You bathed in Her Light..."},{"name":"MERLWYB","text":"Y'shtola's conclusion is clear, and I see no reason to doubt it. You are the vessel of a higher power."},{"name":"MERLWYB","text":"This...being from your vision was the Mothercrystal. Your description matches what little we know of Her."},{"name":"MERLWYB","text":"And if She has chosen you, then your deeds may yet shape the fate of nations."},{"name":"MERLWYB","text":"As once did the deeds of the Warriors of Light."},{"name":"MERLWYB","text":"Know you the tale? Like you, they were not of these lands, yet they fought to protect us all 'gainst the corruption of the primals."},{"name":"MERLWYB","text":"When the Garlean Empire began its conquest of the realm, these heroes joined the Grand Companies, and helped reforge the Eorzean Alliance."},{"name":"MERLWYB","text":"And at the Battle of Carteneau, they took the field beneath our banners, to fight for everything we hold dear."},{"name":"MERLWYB","text":"It was on that day, in the midst of that hell...that we lost them."},{"name":"MERLWYB","text":"Every soul who survived that battle will never forget how it was to fight beside them. We are proud to call them our comrades."},{"name":"MERLWYB","text":"Yet, whenever we try to shout their names, the sound dies in our throats."},{"name":"MERLWYB","text":"And whenever we strain to see their faces with our mind's eye, naught but their shadows appear to us, set against a blinding light."},{"name":"MERLWYB","text":"Ask any true Eorzean who knew them, and the story will be the same. It is for this reason that we call them “the Warriors of Light.”"},{"name":"MERLWYB","text":"When I look upon you, I cannot help but be reminded of them."},{"name":"MERLWYB","text":"Keep that Crystal safe."},{"name":"MERLWYB","text":"In time, I believe the Mothercrystal will make clear Her reasons for bestowing it upon you."},{"name":"MERLWYB","text":"Heed well Her words, adventurer. For it is Hydaelyn Herself who speaks."},{"name":"BADERON","text":"Mornin', sunshine. All a bit much fer ye, was it?"},{"name":"BADERON","text":"...What 'appened? Ah, ye don't remember, then."},{"name":"BADERON","text":"Ye keeled over in the middle o' the banquet, an' caused a right stir. 'Ad to carry ye back to the Wench meself. Well, I say “carry”...'twas more a matter o' draggin' an' rollin'. Too much cake, I reckon."},{"name":"BADERON","text":"Anyroad, don't fret─'tis little wonder ye was exhausted after everythin' ye've been through lately."},{"name":"BADERON","text":"Yer little nap seems to 'ave put some color back in yer cheeks, though, so I'll leave ye to it."},{"name":"BADERON","text":"...Bugger! I almost forgot: the Admiral wants to 'ave a word with ye."},{"name":"BADERON","text":"When ye feel up to it, talk to Zanthael an' 'e'll let ye in to the command room. Oh, an' stay awake, eh? I'm told ol' Merlwyb was in the middle o' tellin' ye a story when ye started snorin' last time, an' I doubt she'd look kindly on it if ye repeated the trick!"},{"name":"ZANTHAEL","text":"Greetings, <span class=\"highlight\">Forename</span>. Admiral Bloefhiswyn awaits you in the command room. Shall I announce you?"},{"name":"Q1","text":"Enter the command room?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"ZANTHAEL","text":"Still not recovered from your...er...sudden illness? I find a brisk walk along the waterfront always helps to blow away the cobwebs. The smell down there could wake the dead..."},{"name":"MERLWYB","text":"Ah, <span class=\"highlight\">Forename</span>, it is good to see you on your feet again. You are recovered?"},{"name":"MERLWYB","text":"Then let us waste no time. I have a task that needs doing─one I would entrust to no other."},{"name":"JNASSHYM","text":"What's this? Are you struggling to tell me you have <span class=\"emphasis\">lost</span> the fine pair of shoes I chose <span class=\"emphasis\">especially</span> for you?"},{"name":"JNASSHYM","text":"Fortunately, I have another such pair available. You may have them out of the kindness of my heart...and the loathing in my soul I bear for your usual “attire.”"}],"reward":{"gil":319,"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[66226]},"next":[66082,66961,66962,66963]},"partials":[{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1003355","obj":{"i":1003355,"n":"J'nasshym","l":29,"q":3,"t":"Brugaire Consortium"}},{"type":"item","id":"3760","obj":{"i":3760,"n":"Dress Shoes","l":1,"c":46329,"t":38,"p":100}},{"type":"quest","id":"66226","obj":{"i":66226,"n":"High Society","g":1,"l":"Limsa Lominsa","s":79}},{"type":"quest","id":"66082","obj":{"i":66082,"n":"The Lominsan Envoy","g":1,"l":"Limsa Lominsa","s":87}},{"type":"quest","id":"66961","obj":{"i":66961,"n":"Saw That One Coming","g":92,"l":"Gridania","s":140}},{"type":"quest","id":"66962","obj":{"i":66962,"n":"Good for What Ales You","g":91,"l":"Limsa Lominsa","s":140}},{"type":"quest","id":"66963","obj":{"i":66963,"n":"Help Me, Lord of the Dance","g":93,"l":"Ul'dah","s":140}}]}