{"quest":{"name":"Underneath the Sultantree","location":"Central Thanalan","id":66086,"patch":2.0,"sort":20,"icon":100088,"eventIcon":71201,"issuer":1003995,"target":1003995,"involved":[1003996],"genre":1,"journal":["Papashan is in dire need of your assistance.","The stationmaster explains that he and the Sultansworn are in fact searching for Lady Lilira, a young noblewoman who has run away from home. He asks you to search for Lilira in the area to the south, near the Sultantree.","At the Sultantree, you find the young runaway, along with a sarcastic fellow who seems to know her well. Moments later, voidsent attack, forcing you to work together to protect Lady Lilira.","No sooner have you bested the creatures than you are overcome by strange visions, the meaning of which eludes you. When you subsequently come to your senses, you are relieved to find that Lady Lilira is safe, and apparently eager to return to the city. Head back to the Ul'dah Dispatch Yard and report all that has occurred to Papashan.","Papashan explains that the young man was most likely Thancred, a scholar conducting research on aether-related subjects. The stationmaster then thanks you for protecting Lady Lilira and asks that you show that same kindness to the other people of Thanalan."],"objectives":["Search for Lilira near the Sultantree.","Report to Papashan."],"dialogue":[{"name":"PAPASHAN","text":"<span class=\"highlight\">Forename</span>, I have just this moment─ No! No, the time for concealment is past! The truth is, even before I had you deliver those pretzels, I was privy to some most unsettling news!"},{"name":"PAPASHAN","text":"...Which is the <span class=\"emphasis\">real</span> reason I sent you to meet those Sultansworn."},{"name":"PAPASHAN","text":"A young noblewoman from a <span class=\"emphasis\">very</span> prestigious family has run away from home, and I have been ordered to see to her safe return."},{"name":"PAPASHAN","text":"The Sultansworn you met earlier are assisting with the search. Alas, it seems they have found no trace of her."},{"name":"PAPASHAN","text":"I apologize for not being frank with you from the start, but we must proceed with caution─should word of her disappearance spread, I fear others with less honorable motives may join the hunt."},{"name":"PAPASHAN","text":"And should we allow her to come to any harm, not even a hundred beheadings would be punishment enough..."},{"name":"PAPASHAN","text":"That cannot happen, <span class=\"highlight\">Forename</span>. It <span class=\"emphasis\">must</span> not!"},{"name":"PAPASHAN","text":"I need you to help me find her!"},{"name":"PAPASHAN","text":"Praise the Twelve, I knew I could count on you!"},{"name":"PAPASHAN","text":"I've instructed the others to expand the search, but Thanalan is vast and there are only so many of us."},{"name":"PAPASHAN","text":"The young noblewoman's name is Lady Lilira. I want you to go south and look for her in the vicinity of the Sultantree. Good luck!"},{"name":"LILILA","text":"O Sultantree..."},{"name":"LILILA","text":"O Sultantree, hallowed spirit of my line, forgive my weakness. My failings have cost us dear..."},{"name":"LILILA","text":"Show yourself!"},{"name":"THANCRED","text":"(-???-)As you command, O Lilira."},{"name":"THANCRED","text":"(-???-)Forgive my selfish desire to assure your welfare."},{"name":"LILILA","text":"I don't recall requesting an escort! Simply pretend we never met and continue on your way."},{"name":"THANCRED","text":"(-???-)We both know I can do no such thing. It isn't safe for you here alone."},{"name":"THANCRED","text":"(-???-)It isn't safe for <span class=\"emphasis\">anyone</span>─not with this aetheric disturbance... It's as though the dead are watching us..."},{"name":"THANCRED","text":"(-???-)And I'd prefer not to join them, if it's all the same to you."},{"name":"THANCRED","text":"(-???-)Ah, you must be the one that Papashan mentioned. Congratulations on finding our elusive young charge."},{"name":"THANCRED","text":"(-???-)You'll have to forgive Her Impetuousness. What she lacks in discipline, she makes up for in stubbornness."},{"name":"THANCRED","text":"(-???-)How peculiar... I could swear we've met, but haven't the faintest recollection as to where or when."},{"name":"THANCRED","text":"(-???-)Must be the damned heat playing tricks on me. I'd best retire before I start having visions."},{"name":"THANCRED","text":"(-???-)You should return with us. The stationmaster will be eager to thank Lady Lilira's protector in person."},{"name":"THANCRED","text":"(-???-)Alas, the stationmaster will have to wait."},{"name":"THANCRED","text":"(-???-)Dear Lilira, for my sake, please stay out of harm's way."},{"name":"THANCRED","text":"(-???-)As for you, dear friend─for Lilira's sake─please stay <span class=\"emphasis\">in</span> harm's way!"},{"name":"THANCRED","text":"(-???-)..."},{"name":"MOTHERCRYSTAL","text":"Hear... Feel... Think..."},{"name":"THANCRED","text":"(-???-)Ah, coming around now."},{"name":"LILILA","text":"Would you mind telling me what that was?"},{"name":"THANCRED","text":"(-???-)If I only knew. A denizen of the void, at any rate."},{"name":"LILILA","text":"The voidsent? Here? But how?"},{"name":"THANCRED","text":"(-???-)The question isn't “how,” but “who”─we're not dealing with bookless bandits."},{"name":"THANCRED","text":"(-???-)Don't suppose the answer came to you in a dream?"},{"name":"THANCRED","text":"(-???-)No sooner did you fell the beast than you fell asleep. Too much aether, no doubt."},{"name":"THANCRED","text":"(-???-)Interesting... I hadn't considered the Crystal."},{"name":"THANCRED","text":"(-???-)But of course... This changes everything."},{"name":"THANCRED","text":"(-???-)Hm? Oh, just thinking aloud. At any rate, we haven't a moment to spare. I must return and report this at once."},{"name":"THANCRED","text":"(-???-)I leave Lady Lilira in your capable hands!"},{"name":"LILILA","text":"How <span class=\"emphasis\">dare</span> you pass me about like a swaddled babe!"},{"name":"LILILA","text":"I shall return and tell them <span class=\"emphasis\">myself</span>!"},{"name":"THANCRED","text":"(-???-)As you wish, Your Impetuousness."},{"name":"THANCRED","text":"(-???-)I suspect we shall meet again before long."},{"name":"THANCRED","text":"(-???-)Until then, do try and stay awake!"},{"name":"PAPASHAN","text":"Thank the gods you've returned! You had us all so worried!"},{"name":"PAPASHAN","text":"You <span class=\"emphasis\">do</span> realize what would happen if a person of your noble stature were to be injured─or worse?"},{"name":"PAPASHAN","text":"Why, Her Grace the sultana would be <span class=\"emphasis\">beside herself</span> with grief─and so would her subjects! I daresay they'd be weeping in the streets!"},{"name":"LILILA","text":"But I have already given you cause to weep, Papashan...you and the people of Ul'dah..."},{"name":"PAPASHAN","text":"Please, Your─ You're not to say such things! We will find it, I swear to you!"},{"name":"PAPASHAN","text":"It is not my place to make demands, m-my lady, but I beg you, <span class=\"emphasis\">please</span> stay out of harm's way."},{"name":"LILILA","text":"...I apologize for causing you undue worry, Papashan. I shall refrain from traveling unescorted in future."},{"name":"PAPASHAN","text":"I cannot thank you enough, <span class=\"highlight\">Forename</span>!"},{"name":"PAPASHAN","text":"I understand you fought bravely to protect Lady Lilira from voidsent fiends."},{"name":"PAPASHAN","text":"For your gallant service, you deserve all the riches in the royal vaults. Alas, a small token of my gratitude is the best I can offer."},{"name":"PAPASHAN","text":"...Hm? A sarcastic man with a strange contraption strapped to his shoulder?"},{"name":"PAPASHAN","text":"I see you met Thancred. He's a scholar who spends his days investigating oddities in the aether. Rather too fond of the sound of his own voice for my liking, but perfectly harmless."},{"name":"PAPASHAN","text":"As for you, <span class=\"highlight\">Forename</span>─you're just the sort of adventurer we need around here."},{"name":"PAPASHAN","text":"I pray you show the same kindness to the people of Thanalan as you did to us today."},{"name":"SCENE00002","text":"Duty calls. Do you wish to proceed with<br>“MANWIL005”?"},{"name":"SCENE00002","text":"Yes"},{"name":"SCENE00002","text":"No"},{"name":"SYSTEM","text":"You are about to enter an instanced battle. Instanced battles only occur during certain quests and missions."},{"name":"SYSTEM","text":"Take a moment to read the information displayed in the active help window before answering the call of duty."},{"name":"QIB","text":"Defeat the blangas!"},{"name":"THANCRED","text":"Come, let's attend to our uninvited guest!"},{"name":"THANCRED","text":"Lovely, it brought friends!"},{"name":"THANCRED","text":"Leave the big one to me! You handle the rest!"},{"name":"THANCRED","text":"Stay close if you want me to heal you!"},{"name":"THANCRED","text":"More of them!?<br>Really now, there are limits to our hospitality!"},{"name":"THANCRED","text":"Just a little more..."},{"name":"THANCRED","text":"Pull yourself together!"}],"reward":{"gil":132,"xp":1120},"reqs":{"jobs":[{"lvl":4,"id":130}],"quests":[66207]},"next":[65839,65857]},"partials":[{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"npc","id":"1003996","obj":{"i":1003996,"n":"Hooded Lalafell","l":43,"q":1}},{"type":"quest","id":"66207","obj":{"i":66207,"n":"Nothing to See Here","g":1,"l":"Central Thanalan","s":19}},{"type":"quest","id":"65839","obj":{"i":65839,"n":"Step Nine","g":1,"l":"Central Thanalan","s":23}},{"type":"quest","id":"65857","obj":{"i":65857,"n":"The Slaying of the Shrews","g":93,"l":"Central Thanalan","s":60}}]}