{"quest":{"name":"Eggs Pluribus Unum","location":"Ul'dah","id":66095,"patch":2.55,"sort":82,"icon":100392,"eventIcon":71221,"issuer":1011801,"target":1011871,"genre":199,"usedItems":[10087],"journal":["Nonotta is keen to put the past behind her, and move on to the final part of the prophecy.<br>※This quest is available for a limited time only.","After securing your silence regarding the strange exchange you witnessed between her and the leader of the Shellshockers, Nonotta bids you head to Limsa Lominsa to defend the auspicious spriggan from the ruffians' assuredly evil plans. Motte, the Dreamer in charge of the Hatching–tide festivities in La Noscea, awaits you by the Aftcastle.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Motte is pleased to reveal that the auspicious spriggan has indeed been sighted in Limsa Lominsa. At least, she thinks he has: three similar spriggans, each carrying an unusual egg, have been seen scurrying around the upper decks. She bids you speak with her sylphic helper, who has a cunning plan to expose the suspicious spriggans' true nature.","The sylphic sorceress has laid in store an arsenal of sylphic scalebombs that can break through the strongest of illusory magicks. Transforming you into spriggan form so that you might blend into the crowd, she entrusts you with three bombs─one for each of the suspicious spriggans. Seek out a spriggan holding an unusual egg, and toss a truesight scalebomb at the creature before it can get away.<br><br>※If the transfiguration should fade, speak with the sylphic sorceress again to be changed back into spriggan form.","You toss a truesight scalebomb at the first of the suspicious spriggans, stripping a Shellshocker of his disguise. The boastful brigand escapes, leaving you with two suspicious spriggans remaining. Hunt down another, and use a truesight scalebomb to expose its true nature.<br><br>※If the transfiguration should fade, speak with the sylphic sorceress again to be changed back into spriggan form.","The second suspicious spriggan was another Shellshocker in disguise, leaving just one of their number still at large. Could this be the real auspicious spriggan? Track down the creature, and throw a truesight scalebomb at him to make sure.<br><br>※If the transfiguration should fade, speak with the sylphic sorceress again to be changed back into spriggan form.","The truesight scalebomb has no effect on the creature, confirming that it is indeed the auspicious spriggan of Jihli Aliapoh's vision. The spriggan departs, leaving you with a fragmentary message of big eggs and lucky treasure. Could he have been speaking of the wondrous treasure revealed to Jihli by the Archons of yore? Return to Motte, to see if she can divine any meaning from the spriggan's words.","The spriggan's words strike a chord with Motte. Jihli did not only dream of spriggans in the cities; she saw spriggans out in the wilds, too─dancing around giant, floating eggs, and trying to crack them open. Her Dreamers managed to track down the locations of these scenes, and found the very eggs Jihli dreamed of. Sylphic sorceresses have been dispatched to each location, to bring the scenes from Jihli's vision to life: to crack open the eggs, and win whatever prizes hide inside. Win a lucky egg by participating in the FATE “Gloria in Eggcelsis,” and give it to Motte. The FATE can be found at the following locations: southwest of Summerford Farms in middle La Noscea; east of the Salt Strand in lower La Noscea; south of Hyrstmill in the North Shroud; southeast of the Ul'dah Dispatch Yard in central Thanalan; and east of Camp Drybone in eastern Thanalan.<br><br>※To participate in the FATE, you must first be transfigured into spriggan form by the nearby sylphic sorceress.","Motte's hands tremble with anticipation as you hand over the lucky egg that she is sure contains the prophesied treasure. But as Jihli arrives to witness the crowning glory of her festival, so too does the auspicious spriggan, who is clearly not all he seems. Motte is forced into a confession: the events of the day were nothing but a drama staged by her and the other Dreamers. The auspicious spriggan, the Shellshockers, the treasure inside the lucky egg─all were false. At Jihli's angry insistence, Motte explains how the play was to end: she was to substitute the lucky egg's contents with a treasure map guiding Jihli to the Bismarck. By way of apology, Motte bids you come to the Bismarck too, to partake in the “wondrous treasure” that she and her accomplices have prepared. Speak to the one-eyed wretch in the restaurant to witness the unveiling.","You and Jihli arrive at the Bismarck to find that her Dreamers have organized a surprise nameday party for her. Jihli is moved to see so many well-wishers joining together to share the warmth of their hearts, and recalls the words the Archons of yore spoke unto her in her dream─how she was to follow a bearer of fortune and tour the wonders of the land, to overcome a grave peril and find a wondrous treasure. She realizes that the prophecy has indeed come true: she has overcome the peril posed by her friends' deceit, and gained the wondrous treasure of a closer understanding with her friends, and a renewed determination to make Hatching–tide a day of great joy. The “bearer of fortune” can only be you: the one who has toured the land in pursuit of the treasure, and led Jihli to such a happy conclusion.<br><br>Sated with the night's revelries, you prepare to depart the Bismarck, but just as you are about to leave, you are called to a halt by Baderon Tenfingers, proprietor of the Adventurers' Guild. To your surprise, he congratulates you for saving the realm from imminent destruction. Unbeknownst to you or the Dreamers, the enormous eggs from Jihli's vision were actually Allagan doomsday devices, relics of the ancient empire that would have reduced Eorzea to ruins had they been left unattended. Realizing with some discomfort that it was luck alone that led to the weapons' discovery and deactivation, Baderon bids you never to speak of this knowledge to anyone, lest they live their lives in fear of what other unholy menaces sleep unnoticed beneath the soil."],"objectives":["Speak with Motte in Limsa Lominsa.","Speak with the sylphic sorceress in Limsa Lominsa.","While transfigured, use a truesight scalebomb on a suspicious spriggan.","While transfigured, use a truesight scalebomb on a second suspicious spriggan.","While transfigured, use a truesight scalebomb on the third suspicious spriggan.","Report to Motte.","<span class=\"alternative-container\"><span class=\"alternative\">Complete the FATE “Gloria in Eggcelsis” to obtain a lucky egg.</span><span class=\"alternative\">Present a lucky egg to Motte.</span></span>","Speak with the one-eyed wretch in the Bismarck."],"dialogue":[{"name":"NONOTTA","text":"That Shellshocker was a piece of work, wasn't he? Acting as if he knew me... Do you know what I think we should do? Forget all about it, and never speak of his impudence to anybody─ever! ...Do you promise that you won't tell Jihli? Cross your heart and hope to die?"},{"name":"NONOTTA","text":"Thank you, <span class=\"highlight\">Forename</span>. Well, now that little unpleasantness is out of the way, let us return to business! Hatching Hour is nearly upon us, and there is much and more to be done before the prophecy is realized."},{"name":"NONOTTA","text":"As the Archons of yore revealed it to Jihli, the “bearer of fortune” shall guide the realm to a “wondrous treasure.” Do you see? We must track down the auspicious spriggan once again, so that he might lead us to our prize!"},{"name":"NONOTTA","text":"In Jihli's dream, she first saw the spriggan in the dappled light of the Gridanian forests. Then the air became heavy with heat and incense, and she saw it scurry down the cobbled streets of Ul'dah─just as we witnessed it but a few moments ago."},{"name":"NONOTTA","text":"It is the final part of her vision that interests us now: how the sands grew brighter beneath the creature's toes, and the air around him rang with the voices of gulls and shantymen. It can only mean that the auspicious spriggan is to reappear in Limsa Lominsa!"},{"name":"NONOTTA","text":"If so, he may be in mortal danger once more. Do you remember what my friend─ ...I mean─that awful, evil Shellshocker said? That he was to <span class=\"emphasis\">see you later</span> in Limsa Lominsa! He must mean to follow the auspicious spriggan there, to follow through on his murderous plot!"},{"name":"NONOTTA","text":"So I beg you, <span class=\"highlight\">Forename</span>: head to Limsa Lominsa, and save the spriggan from the clutches of those abominable bandits. I must remain here to attend to the festivities in Ul'dah, but my dear friend Motte will be able to help you. May the Archons of yore bless you and keep you both!"},{"name":"NONOTTA","text":"If the Shellshockers have their wicked way with the auspicious spriggan, all hope of the prophecy being fulfilled will be lost. Go to Limsa Lominsa, my friend, and speak with Motte by the Aftcastle. It is she who leads the revelries there, and will gladly grant you any aid you need."},{"name":"MOTTE","text":"Welcome, adventurer. Might you be <span class=\"highlight\">Forename</span>, the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> who saved the day in Ul'dah? Nono told me you would be coming, and I should be most grateful for your assistance."},{"name":"MOTTE","text":"If it is news of the auspicious spriggan you are after, I have it in two varieties: good and bad. Let us begin with the good news: just as Jihli's vision predicted, a spriggan carrying an unusual egg had indeed been sighted in the city."},{"name":"MOTTE","text":"And now for the bad news: there is more than one. Several spriggans, each with an egg unlike our sorceresses' illusions, have been spotted around the town. There can be no doubt that all but one are fakes─men using magicks of their own device to disguise themselves as the auspicious spriggan."},{"name":"MOTTE","text":"It can only be those wicked Shellshockers from Ul'dah. They mean to distract our attentions from the true auspicious spriggan, and snatch it away from right under our noses!"},{"name":"MOTTE","text":"But when it comes to sneaky tricks, no man can match a sylph, and it just so happens that my sylphic helper has a cunning plan to expose these brigands. We only awaited a brave adventurer to put the plan into action, and now here you are! Speak with her, <span class=\"highlight\">Forename</span>, and she will explain all."},{"name":"MOTTE","text":"The sylphic sorceress over by the steps is an expert in the arts of illusion. She has come up with the perfect method of exposing those fiendish Shellshockers for the scoundrels they are. Heed well her plan, for it may be our only chance of finding the true auspicious spriggan."},{"name":"FRIENDLYSYLPH00559","text":"Happy hunting, walking one! This one has a clever plan to find out which furry one is the lucky one, and which are the shocking ones! Let this one tell walking one all about it."},{"name":"FRIENDLYSYLPH00559","text":"There are shocking ones in the city, using these ones' skin-changing tricks to look just like furry ones, and holding lucky eggs to look like the lucky one. So how can walking one tell which one is the real lucky one? With more of these ones' tricks, of course!"},{"name":"FRIENDLYSYLPH00559","text":"Take a look at these, walking one─magick–breaking scalebombs that can see through the most powerful sylphic tricks. All walking one needs to do is find the lucky-looking ones, and toss a scalebomb at each one. Then walking one will see what walking one will see!"},{"name":"FRIENDLYSYLPH00559","text":"Dreaming one says there are three suspicious ones that look like the lucky one around the upper decks. Dreaming one thinks one is the real lucky one, but they might all be shocking ones in disguise! Throw scalebombs at all three to find out which one is which!"},{"name":"FRIENDLYSYLPH00559","text":"But if shocking ones see walking one coming, shocking ones might get a shock, and run away! Better to change into a furry one again, to catch shocking ones unawares. This one will magick walking one into a furry one right away!"},{"name":"SYSTEM","text":"Three spriggans carrying unusual eggs have been sighted on the upper decks of Limsa Lominsa. Disguise yourself as a spriggan, and throw a scalebomb at each of the suspicious spriggans to discover if the auspicious spriggan is among their number."},{"name":"SYSTEM","text":"Should you succeed in uncovering the true auspicious spriggan, report back to Motte. If your transfiguration should fade before you have completed the task, speak to the sylphic sorceress again to be magicked back into spriggan form."},{"name":"FRIENDLYSYLPH00559","text":"When walking one sees a lucky-looking one, get the lucky-looking one's attention, and throw a scalebomb before it can run away. If the lucky-looking still looks lucky after the bomb goes off, it must be the real lucky one!"},{"name":"MOTTE","text":"<span class=\"highlight\">Forename</span>, is that you? Did my sorceress friend give you the...<span class=\"emphasis\">merchandise</span>? Excellent. Seek out the suspicious spriggans, and use the scalebombs on them. Oh, and do try to stay in disguise─if the Shellshockers see you reaching for another gift, they're sure to run for their lives!"},{"name":"FRIENDLYSYLPH00559","text":"Happy Hatching–tide, walking one! Ah, but walking one should be disguised as a furry one, otherwise shocking ones will see walking one coming! This one will change walking one back straightaway."},{"name":"MOTTE","text":"Do you have the scalebombs, <span class=\"highlight\">Forename</span>? Good. Before you commence the operation, ask my sylphic assistant to transfigure you again. In spriggan form, those nasty Shellshockers won't know you from any other Hatching–tide reveler─until you spring the trap!"},{"name":"SPRIGGANA00559","text":"Eggy, eggy, eggyyy! I'm a lucky Spriggy! Lucky, lucky Spriggyyyyyy!"},{"name":"SPRIGGANA00559","text":"Eggy, eggy, eggyyy! I'm a lucky Spriggy! Lucky, lucky Spriggyyyyyy!"},{"name":"Q1","text":"Use a truesight scalebomb?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"EGGCRUSHERC00557","text":"Aaagh! Oi, you! What d'you think you're─ ...Er, I mean...whatty, whatty, whattyyy─ ...Stone me, what's happened to my disguise!?"},{"name":"EGGCRUSHERC00557","text":"Grrr... Looks like the jig's up. You got me, bang to rights─I ain't the real auspicious spriggan, I'm a Shellshocker through and through. But while you're wasting your time on me, the lads are closing the net! Happy hunting, big ears!"},{"name":"MOTTE","text":"One of the spriggans <span class=\"emphasis\">was</span> a Shellshocker after all? Then there's no doubt that another must be, too...if not both! Hurry, <span class=\"highlight\">Forename</span>, and track the two remaining suspicious spriggans down─we must find the real auspicious spriggan before they do!"},{"name":"SPRIGGANB00559","text":"Eggy, eggy, eggyyy! Who's a lucky Spriggyyyyyy!?"},{"name":"SPRIGGANB00559","text":"Eggy, eggy, eggyyy! Who's a lucky Spriggy? Are you a lucky Spriggyyyyyy!?"},{"name":"EGGCRUSHERA00557","text":"Agh! What in the seven hells was that!?"},{"name":"EGGCRUSHERC00557","text":"My disguise, it's gone! Sod this for a lark─they never told me I'd be taking a bomb to the face, let alone two... I ain't sticking around for a third!"},{"name":"MOTTE","text":"You found a second suspicious spriggan, and he was a fake, too? Then the only one left must be the real auspicious spriggan! ...Provided it's not another bandit in disguise. You had better drop a scalebomb on him, too─it's the only way to be sure."},{"name":"SPRIGGAN00556","text":"Spriggy find egg! Eeeeeegg! Spriggy find treasuuuuuure!!!"},{"name":"SPRIGGAN00556","text":"Spriggy egg! Biggy egg! Big treasure! Treasuuuuuure!!!"},{"name":"SPRIGGAN00556","text":"Spriggy egg! Biggy egg! Big, big, biiig! Lucky treasure! Luckyyyyyy!!!"},{"name":"SPRIGGAN00556","text":"Big, big eggies in the wild! The wiiiiiild! Lucky eggies! Lucky treasuuuuuure!!!"},{"name":"FRIENDLYSYLPH00559","text":"Walking one found the real lucky one!? Hooray for walking one! Dreaming one will want to hear about this right away!"},{"name":"MOTTE","text":"Welcome back, <span class=\"highlight\">Forename</span>...if that <span class=\"emphasis\">is</span> you under all that fluff. Allow me to dispel your disguise. Oh, don't worry─I'll just use a sprinkling of truesight scales. No cause for a bomb this time!"},{"name":"MOTTE","text":"So tell me: did you track down the third suspicious spriggan? ...You did? And it really was the auspicious spriggan from the prophecy─the same one you met in Ul'dah!? Thank goodness it was you who found him first, and not the hated Shellshockers, sworn enemies of Dreamers near and far!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Enemies? They seemed rather friendly with Nonotta..."},{"name":"A1","text":"I aim to please."},{"name":"MOTTE","text":"Wh-Wh-What!? Surely you can't suspect Nono of being in league with those villains? Why, the very idea is absurd! So absurd that it doesn't bear repeating...to anyone. Ever. But enough of this silliness─tell me, <span class=\"highlight\">Forename</span>: did the auspicious spriggan say anything to you?"},{"name":"MOTTE","text":"And please you have! Rest assured, when this day is done, you shall be the guest of honor at─ ...But we can talk about that later. We have more important matters to discuss at present: the auspicious spriggan first and foremost. Tell me, <span class=\"highlight\">Forename</span>, did he say anything to you?"},{"name":"MOTTE","text":"“Big eggs, big treasure,” or words to that effect? The image they conjure seems somehow familiar... Of course! The enormous eggs from Jihli's vision!"},{"name":"MOTTE","text":"Did she mention them to you? It wasn't just the cities of Eorzea that Jihli saw bustling with spriggans enjoying the Hatching–tide revelries, but the fields and valleys, too. Out in the wilds, she saw the creatures dancing around immense, floating eggs."},{"name":"MOTTE","text":"From her descriptions, we were able to divine the very locations she had seen in her dream, and what do you know? There they were! Giant, decorated eggs, buried beneath the topsoil! We had only to prise them free from the ground, and they took off into the air."},{"name":"MOTTE","text":"It was just as Jihli described it to us...excepting the lack of spriggans. So just as we have done in the cities, sylphic sorceresses have been posted to each location where the giant eggs were found. There they are conducting a special Hatching–tide event that we call the enormous egg hunt!"},{"name":"MOTTE","text":"Once our sylphic assistants transfigure adventurers into spriggan form to match Jihli's vision, they are free to cavort around the floating eggs─striking at them, and trying to crack them open. Whosoever lays an egg low is permitted to claim the prize inside."},{"name":"MOTTE","text":"Could the wondrous treasure from the prophecy be contained in one of these eggs? What in the world could it be...? If I gave you a list of all the places we found the eggs, would you go there, join in the enormous egg hunt, and bring whatever you find inside back to me?"},{"name":"SYSTEM","text":"Bring the scenes from Jihli Aliapoh's prophetic dream to life by participating in the FATE “Gloria in Eggcelsis.” Crack open the giant, floating eggs to obtain the lucky eggs within."},{"name":"SYSTEM","text":"The locations where the FATE will appear are noted in your journal. Complete the FATE in any of the listed locations to proceed in the quest."},{"name":"SYSTEM","text":"In order to participate in the FATE, you will need to be transfigured into spriggan form. Speak with the sylphic sorceress at the FATE location to be transfigured."},{"name":"SYSTEM","text":"When the enormous egg appears, attack it using the skill “Quickchant,” which can be activated from the pet hotbar. Continue to attack the egg until it cracks, and you will be rewarded with lucky eggs. There is no limit to the number of lucky eggs you can collect."},{"name":"SYSTEM","text":"To open a lucky egg and collect the prize inside, simply <span class=\"highlight\">use</span> it from your inventory."},{"name":"SYSTEM","text":"Alternatively, lucky eggs can be exchanged for special items by speaking with the Hatching–tide Dreamers in any of the three city–states."},{"name":"FRIENDLYSYLPH00559","text":"Out in the wilds, adventuring ones are dressing as furry ones, and cracking open giant floating ones! Will walking one be joining in too?"},{"name":"FRIENDLYSYLPHFIELD","text":"Greetings, walking one, and welcome to the enormous egg hunt! This one will turn walking one into a furry one, then walking one can join in too. Crack open the giant egg to win what's inside! Just be careful it doesn't crack walking one open first!"},{"name":"FRIENDLYSYLPHFIELD","text":"Now walking one is ready to join the hunt! If walking one cracks open the enormous egg, walking one will win a wonderful prize. If the magick fades, come back to this one, and this one will magick walking one into a furry one again."},{"name":"MOTTE","text":"Greetings once again, my friend. How went the egg hunt? My sylphic sorceresses tell me that the floating giants are yielding lucky eggs to their victors. Were you rewarded with the same?"},{"name":"MOTTE","text":"You were! Is the great treasure that shall bring great joy to all the realm contained within this unassuming orb? My fingers itch to open it, but I promised Jihli that I would wait until─ ...Ah, but here she comes now."},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename</span>, I came as soon as I received word! Does Motte speak true? Have you found the wondrous treasure the prophecy spoke of?"},{"name":"MOTTE","text":"Indeed <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has, and it dwells within this very egg I hold in my hands. The auspicious spriggan guided <span class=\"highlight\">Forename</span> to the enormous eggs from your vision, and this was the prize <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> found inside. It can only be the prophesied treasure!"},{"name":"JIHLIALIAPOH","text":"A lucky egg that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> won from the enormous egg hunt? But didn't we prepare all those prizes ourselves? The treasure from my vision was supposed to be a gift from the Archons of─ ...Hmmm?"},{"name":"SPRIGGANA00559","text":"Spriggy done job, now Spriggy want pay! Paaaaaay! Give me eggiiies! Eggiiiiiies!!!"},{"name":"MOTTE","text":"Not now, Spriggy! I'll give you all the eggs you want, but only when the festival is over, and not a moment earlier. Until then, you're the <span class=\"emphasis\">auspicious spriggan</span>, and don't you forget it!"},{"name":"MOTTE","text":"Quickly now, there's a good boy! And don't let me catch you in the city until─ ...Ah."},{"name":"JIHLIALIAPOH","text":"Motte! What is the meaning of this!? That was the auspicious spriggan that I saw in my dream, I am sure of it─but how do <span class=\"emphasis\">you</span> know him? And what is this talk of pretense and payment? <span class=\"highlight\">Forename</span>, please, tell me: what in the world is going on!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"They've faked the whole thing."},{"name":"A1","text":"I don't know. Maybe Motte can explain..."},{"name":"JIHLIALIAPOH","text":"What!? You mean it's not only Motte and the auspicious spriggan, but Nonotta, and the Shellshockers too...? Why, Motte? Why would you try to fool me like this?"},{"name":"MOTTE","text":"I'm sorry, Jihli... I can't keep the truth from you any longer."},{"name":"MOTTE","text":"Jihli, <span class=\"highlight\">Forename</span>... The truth is, we've been deceiving you both. Everything that has happened─the auspicious spriggan appearing, being chased by the Shellshockers, guiding you to the giant eggs─none of it was real. We staged it all."},{"name":"MOTTE","text":"The auspicious spriggan is actually my friend. Spriggy is his name. I made an egg for him, just like the one you described in your vision, and asked him to pose as the auspicious spriggan in exchange for a hundred Hatching–tide eggs..."},{"name":"MOTTE","text":"As for the Shellshockers─they're Nonotta's friends from the Weavers' Guild. When they're not acting as bandits, they make the most adorable quilts. And the enormous eggs─we <span class=\"emphasis\">did</span> find them buried in the ground in the places you dreamed of, I swear, but they were ugly, metallic things.<br>We decorated them to match the Archon eggs from your vision, and filled them with lucky eggs to act as the prophesied treasure..."},{"name":"JIHLIALIAPOH","text":"So it was all a lie? You, Nonotta, and the other Dreamers...you staged everything to make it match my vision? Why would you do this!?"},{"name":"MOTTE","text":"Because we were worried about you! Every time we saw you, you were so very anxious─frightened that this year, your dream wouldn't come true. So we pledged to do whatever it took to make sure that it would!"},{"name":"JIHLIALIAPOH","text":"But it hasn't! My visions are blessings from the Archons of yore, not mere pantomimes to be acted out by a band of second-rate mummers! I wished for us to set the stage for the prophecy to be fulfilled, not act it out ourselves! Now the whole thing is ruin─ ...Hm?"},{"name":"JIHLIALIAPOH","text":"Wh-What is this...this feeling? It is as if I have witnessed this scene before... Yes, yes! It was in my dream! I saw myself...and you, Motte. I saw us quarreling..."},{"name":"JIHLIALIAPOH","text":"I...I saw it through your eyes, <span class=\"highlight\">Forename</span>! All of it─the auspicious spriggan in Gridania, the Shellshockers in Ul'dah, the scalebombs in Limsa Lominsa, <span class=\"emphasis\">and</span> the enormous egg hunt!"},{"name":"MOTTE","text":"Jihli, do you know what this means? Your dream was indeed a vision of the future─it is not so much that we staged the events of your vision, but that you envisioned the events that we were to stage! Your vision has come true, and so shall the prophecy!"},{"name":"JIHLIALIAPOH","text":"Perhaps... But still, <span class=\"highlight\">Forename</span> was unaware of your secret plans─you have been quite beastly to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, treating <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> as an unwitting pawn in your games. My vision ended here, so tell me, Motte: what was to be the denouement of your little drama?"},{"name":"MOTTE","text":"Well, if you promise not to be angry... My sylphic friend taught me another of her tricks─no magicks, or explosives, just a little sleight of hand. I do not know what <span class=\"highlight\">Forename</span>'s lucky egg contains, but it is no great treasure─I was planning to substitute its contents with this map."},{"name":"JIHLIALIAPOH","text":"...With a cross over the Bismarck. So if I go there, I'll discover what “wondrous treasure” you've laid in store for me?"},{"name":"MOTTE","text":"Yes. <span class=\"highlight\">Forename</span>, you must come too─a share in the treasure is the least I can offer for all we've put you through. Speak with the fellow with the eyepatch by the restaurant entrance. I'm sure you'll find you have much to discuss..."},{"name":"MOTTE","text":"I do hope you can find it in your heart to forgive us, and meet with us at the Bismarck. If you do decide to come, a...<span class=\"emphasis\">friend</span> will be waiting for you by the entrance."},{"name":"FRIENDLYSYLPH00559","text":"This one, and the lucky one, and the shocking ones, and the dreaming ones... These ones were all in it together! This one is sorry this one didn't tell walking one anything, but these ones wanted to keep it a secret..."},{"name":"MOTTE","text":"<span class=\"highlight\">Forename</span>, thank you for coming. And welcome to the party!"},{"name":"NONOTTA","text":"Happy nameday, Jihli!"},{"name":"MOTTE","text":"(-All-)HAPPY NAMEDAY!"},{"name":"EGGCRUSHERC00557","text":"Good to finally have you with us, Miss Aliapoh! ...Miss Aliapoh? Ha ha! Looks like we've really knocked her off her feet!"},{"name":"NONOTTA","text":"Well, it wouldn't be a surprise party if it wasn't a surprise! We saw that you were worried about the festival, and your nameday was coming up, so we thought we'd kill two birds with one stone! We all worked together to make it happen!"},{"name":"EGGCRUSHERC00557","text":"And I got the short end of the stick! D'you remember me, adventurer? Aye, I'm the Shellshocker who took a couple of your scalebombs to the mug! No harm done, though. Jihli's always so kind, laying in all these gifts for the smallfolk. It was well worth it to give a little something back."},{"name":"MOTTE","text":"We're sorry for keeping you in the dark, <span class=\"highlight\">Forename</span>. We were so fixated on making the plan work─recreating the scenes from Jihli's vision, and leading her to a surprise party at the end of it, we didn't think of the strain we'd be putting on the adventurer who found the spriggan..."},{"name":"JIHLIALIAPOH","text":"Y-You mean...you did all this for me? I'm honored, truly I am...but─"},{"name":"JIHLIALIAPOH","text":"But this isn't how it should be! Hatching–tide should be about joining hands with adventurers to bring the will of the Archons to life, not tricking them into following our own secret schemes! It should be about bringing joy to all, not just to me..."},{"name":"EGGCRUSHERC00557","text":"Aye, and that's what we've brung! You've done so much to raise the spirits of the smallfolk since the Calamity, it lifts all our hearts to do something for you in return. And anyway, this party ain't just for you and us, Miss Aliapoh─everyone's welcome to join the revelry as they please!"},{"name":"NONOTTA","text":"And when the party's over, we'll return to our posts, and get back to running the Hatching–tide festivities─the <span class=\"emphasis\">real</span> festivities─with all our hearts! We'll fulfill this prophecy if it's the last thing we do!"},{"name":"JIHLIALIAPOH","text":"Thank you, Nonotta─everyone... But perhaps the prophecy is already fulfilled. In my vision, I saw the arrival of the auspicious spriggan, and the drama that you laid in store to lead me here, but there was more: the Archons of yore also delivered a message unto me."},{"name":"JIHLIALIAPOH","text":"“Arise, young Dreamer,” they said, “follow in the footsteps of the bearer of fortune, who will tour the wonders of this blessed land. Only by this may you surmount a grave peril, and find a wondrous treasure.”"},{"name":"JIHLIALIAPOH","text":"At first, I thought that the bearer of fortune must be the auspicious spriggan, and the peril the Shellshockers, but if all was an act, that can scarce be so..."},{"name":"JIHLIALIAPOH","text":"Instead, I have come to quarrel with my dearest friends─a grave peril that could have spelled the end of the festival. But by the warmth of your hearts, we have overcome these troubles, and together we vow once more to make Hatching–tide as joyous as it can be."},{"name":"JIHLIALIAPOH","text":"It is this that is the wondrous treasure! The scenes that I saw in my vision may have been mere mummery, but nonetheless, the prophecy has been fulfilled! We have overcome a grave peril, and found a wondrous treasure, all guided by the bearer of fortune: not the auspicious spriggan..."},{"name":"JIHLIALIAPOH","text":"...But you, <span class=\"highlight\">Forename</span>! It is through your eyes that I witnessed the scenes from my vision, and by your hands that the drama reached its finale. Thanks to you, the will of the Archons has been brought to fruition once more!"},{"name":"BADERON","text":"(-???-)'Ere, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─where d'ye think <span class=\"emphasis\">you're</span> off to?"},{"name":"BADERON","text":"I been after ye all evenin', <span class=\"highlight\">Forename</span>. Don't worry yerself, now─I ain't lookin' fer the last dance. I've got a little somethin' fer ye, on behalf o' the guild."},{"name":"BADERON","text":"A little bird tells me ye 'elped save the realm from a worse lickin' than a kiss with a fishback. 'Tis only right ye get yer reward fer findin' them Allagan killin' machines, and doin' away with 'em afore they did away with us!"},{"name":"BADERON","text":"Don't be so modest, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! You an' yer mates might've hushed it up, but the guild's got ways an' means o' findin' these things out. We both know what them “enormous eggs” really were."},{"name":"BADERON","text":"If them 'oary ol' contraptions'd been left to linger, they would've blown all Eorzea to kingdom come! Small wonder ye kept it to yerselves─if the smallfolk caught wind of the 'orrors lurkin' 'neath their feet, we would've 'ad a panic on our 'ands."},{"name":"BADERON","text":"That was yer thinkin', weren't it? Dress it all up as part of the Hatchin'–tide revelries, an' take the buggers out quick an' quiet afore rumor can spread. Ye've got a wise 'ead on them shoulders, <span class=\"highlight\">Forename</span>, an' the guild's seen fit to grant ye a fittin' meed."},{"name":"BADERON","text":"What? Ye were only goin' along with that lass's dream? Followin' a bearer o' fortune to find a great treasure? An' ye reckoned that bit in the middle about “tourin' the wonders” was talkin' about travelin' 'round Eorzea?"},{"name":"BADERON","text":"No, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, no─it were those enormous eggs it were goin' on about! Ye saved us from the peril o' those Allagan abominations, an' as fer the wondrous treasure─well, what more can a feller ask fer than to wake up in the mornin' an' find he ain't been blown up in 'is bed?"},{"name":"BADERON","text":"An' the way ye tell it, ye never even 'ad the faintest glimmer ye were savin' the realm from a right royal keelhaulin'... If that ain't the work of a <span class=\"emphasis\">bearer o' fortune</span>, I don't know what is."},{"name":"BADERON","text":"So it seems to me, at least, but what does a rum-soaked ol' bandit know 'bout visions an' prophecies? Let's you an' me keep this between ourselves, eh? When it comes to learnin' the realm's been saved by luck and luck alone...ignorance is bliss!"},{"name":"SYSTEM","text":"In order to progress further in the quest, you must be under the transfigured status."}],"reward":{"gil":1500,"items":[{"id":10067}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66093]}},"partials":[{"type":"npc","id":"1011801","obj":{"i":1011801,"n":"Nonotta","l":40,"q":2}},{"type":"npc","id":"1011871","obj":{"i":1011871,"n":"One-eyed Wretch","l":28,"q":1}},{"type":"item","id":"10067","obj":{"i":10067,"n":"Egg Earrings","l":1,"c":55318,"t":41,"p":42}},{"type":"item","id":"10087","obj":{"i":10087,"n":"Lucky Egg","l":1,"c":21308,"t":85}},{"type":"quest","id":"66093","obj":{"i":66093,"n":"Poaching the Poachers","g":199,"l":"Gridania","s":81}}]}