{"quest":{"name":"The Spirit Is Willing","location":"Ul'dah","id":66094,"patch":2.0,"sort":150,"icon":100059,"unlocksFunction":1,"eventIcon":71341,"issuer":1003817,"target":1003827,"involved":[1001445,1001578,1003822,1004147,1004148,1004149,1004150],"genre":128,"journal":["Guildmaster Hamon believes you are ready for your next lesson.","In order to train you to deal with immense foes, Hamon bids you challenge the toxic toads that nest at the Unholy Heir. As proof of this feat, you are required to obtain five toad legs.","You have obtained five toad legs. Present them to Hamon, who awaits you at Black Brush Station.","You learn that an illicit drug called somnus is being smuggled into Ul'dah via Black Brush Station. Instead of the lesson he had planned, Hamon bids you track down and apprehend the smugglers. Begin by gathering information from the people of the station.","You have acquired sufficient information on the smugglers. Report your findings to Hamon.","In all likelihood, the smugglers are operating out of an abandoned Qiqirn lair west of the Coffer & Coffin. Make your way to the lair, and there lie in wait for the criminals.","To everyone's surprise, it turns out that one of the smugglers is in fact Rurukuta, the missing pugilist. Upon discovering that his master had grown feeble, Rurukuta became disillusioned and decided to leave the guild. Speak with your guildmaster and learn his side of the story.","Beaten and despondent, Hamon admits that the ravages of age have robbed him of his former ability. There seems to be nothing you can do for your guildmaster at the moment. For now, make your way back to the guild, and discuss matters further with Chuchuto.","Despite having learned the truth of Hamon's condition, Chuchuto does not respect him any less. Determined to help her master and benefactor regain his former strength, she asks for your aid. Keep applying yourself to your training, that your improvement might rekindle the fires of passion within the guildmaster.<br><br>※The next pugilist quest will be available from Hamon upon reaching level 20."],"objectives":["Defeat toxic toads and obtain their legs.","Deliver toad legs to Hamon at Black Brush Station.","Gather information at Black Brush Station.","Report to Hamon.","Lie in wait at the designated location.","Speak with Hamon.","Speak with Chuchuto at the Pugilists' Guild.","Defeat the Alacran henchmen!"],"dialogue":[{"name":"HAMON","text":"Ah, there you are, <span class=\"highlight\">Forename</span>! I hope you've come prepared for a lesson. Today, I want you to go and fight the toxic toads that nest at the Unholy Heir."},{"name":"HAMON","text":"Make no mistake, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>─these toads are huge, which means they have huge guts. But that's beside the point. The point is, you'll need to use your head to overcome them."},{"name":"HAMON","text":"Thanks to their immense girth, these toads hit <span class=\"emphasis\">hard</span>. Fortunately, they tend to hit wild as well, so bide your time and wait for an opening. And when that opening shows...thwack! Rip and tear through your foe with your fists!"},{"name":"HAMON","text":"As proof that you've defeated the toads, I want you to bring me five of their legs. Chuchuto and I will be waiting for you at Black Brush Station. Your lesson continues there."},{"name":"HAMON","text":"Defeat the toxic toads that nest at the Unholy Heir, and bring me five of their legs. Chuchuto and I will be waiting for you at Black Brush Station."},{"name":"CHUCHUTO","text":"I'm taking part in today's lesson as well. Good luck to the both of us!"},{"name":"HAMON","text":"So, did you bring me the toad legs?"},{"name":"HAMON","text":"Aye, this is the stuff all right! &lt;slurp&gt; Now, I just need some butter, a slice of sun lemon, and a pinch of─"},{"name":"CHUCHUTO","text":"Um...Master?"},{"name":"HAMON","text":"...Ahem. What I meant to say was, you've done well to defeat the toxic toads, <span class=\"highlight\">Forename</span>. For the next part of your lesson, you'll be putting your endurance to the test against─"},{"name":"NANAJAPI","text":"&lt;gasp&gt; The talk was true! Hamon Holyfist is really here!"},{"name":"HAMON","text":"Hah hah hah! I can take nary a step outside the guild without being flocked by fans. Such is the price of fame!"},{"name":"NANAJAPI","text":"Please, sir! I have grave need of your legendary skills! Somnus is being smuggled through Black Brush Station! I reported this to the Brass Blades and the Stone Torches─asked them to put an end to it─but they both turn a blind eye!"},{"name":"CHUCHUTO","text":"Somnus... That's the mind-warping substance made from dream flowers. Those who overindulge are said to fall into an eternal slumber."},{"name":"NANAJAPI","text":"A dear friend suffered that very fate─that's why I want to put an end to the smuggling. But I'm just an ordinary person, and there's precious little I can do..."},{"name":"HAMON","text":"Hah hah hah! You've done enough to bring word to me, friend. For as surely as Hamon Holyfist is my name, I'll see the smuggler scum thrown in the dungeon before the bell is through!"},{"name":"NANAJAPI","text":"Twelve bless you, sir! You truly are a hero to us all!"},{"name":"HAMON","text":"Hah hah hah! Slight change of plans, <span class=\"highlight\">Forename</span>. In place of the endurance test, we're going to find and apprehend the smugglers."},{"name":"HAMON","text":"But first, we must gather information. You two, find out what you can from the people of Black Brush Station. Report back once you've learned something."},{"name":"HAMON","text":"Find out what you can from the people of Black Brush Station. Report back once you've learned something."},{"name":"ZUZUMEDA","text":"Searching for somnus smugglers, you say? Word is they are associated with the Alacran, a coalition of cold-blooded criminals. But beware─they always act in alliance!"},{"name":"OSBERT","text":"There is an abandoned Qiqirn lair a short distance west of the Coffer & Coffin. Decent folk tend to give that place a wide berth. Ideal for a smuggling operation, wouldn't you say?"},{"name":"CHUCHUTO","text":"It appears a silver-haired Lalafell was seen skulking about the station recently. He was headed west, bearing a suspicious burden..."},{"name":"CHUCHUTO","text":"A silver-haired Lalafell... It couldn't possibly be <span class=\"emphasis\">him</span>...could it?"},{"name":"HAMON","text":"The Alacran, a likely hideout, and a silver-haired Lalafell... I don't like the sound of this. Not one bit."},{"name":"HAMON","text":"Like as not, the smugglers operate out of the abandoned Qiqirn lair west of the Coffer & Coffin. We'll lie in wait for them there."},{"name":"HAMON","text":"Like as not, the smugglers operate out of the abandoned Qiqirn lair west of the Coffer & Coffin. We'll lie in wait for them there."},{"name":"CHUCHUTO","text":"The silver-haired Lalafell─I must see who he is with my own eyes. Let us go to the abandoned Qiqirn lair!"},{"name":"HAMON","text":"Thal's balls! Th-That's..."},{"name":"ZANTOU","text":"Gahaha... We've really outdone ourselves this time. Master Weggfarr's bound to be pleased."},{"name":"RURUKUTA","text":"(-Silver-haired Lalafell-)Save the talk. We have crates to move."},{"name":"CHUCHUTO","text":"Rurukuta! It <span class=\"emphasis\">is</span> you, isn't it!?"},{"name":"RURUKUTA","text":"Chuchuto...and Master. It's been a while."},{"name":"CHUCHUTO","text":"You vanish from the guild with nary a word, and we find you here smuggling somnus with those villains!? What is the meaning of this!?"},{"name":"HAMON","text":"Rurukuta, my boy. I didn't teach you how to fight so that you could become a pox on society. My student or no, you must be held accountable."},{"name":"HAMON","text":"Chuchuto, <span class=\"highlight\">Forename</span>, your lesson begins! Apprehend the smugglers!"},{"name":"RURUKUTA","text":"You lot, take care of these meddlers!"},{"name":"ZANTOU","text":"(-Servant of the Alacran-)Hamon Holyfist!? Just our luck..."},{"name":"HAMON","text":"If you know who I am, then you'll know what's good for you. Come quietly, or there will be trouble."},{"name":"RURUKUTA","text":"<span class=\"emphasis\">Holyfist</span>? Don't make me laugh! You're being fooled, all of you!"},{"name":"CHUCHUTO","text":"Who's fooling who? What in the world are you talking about?"},{"name":"RURUKUTA","text":"It was a dark night several moons ago. I was out in the wilds, training alone."},{"name":"RURUKUTA","text":"From a distance, I caught sight of Master leaving the tavern and turning for the city. Thinking to accompany him back, I followed on his heels, and was about to call out when I...when I saw...<span class=\"emphasis\">this</span>."},{"name":"HAMON","text":"Hm? You would challenge the Holyfist? You have fighting spirit, I'll grant you that, but you'd do well to know your limits."},{"name":"HAMON","text":"So be it! Yaaarrrgh!"},{"name":"CHUCHUTO","text":"M-Master?"},{"name":"HAMON","text":"&lt;huff&gt; &lt;puff&gt; You read my every move... You're no ordinary marmot..."},{"name":"CHUCHUTO","text":"Master!!!"},{"name":"HAMON","text":"&lt;gasp&gt; All I wanted...was to be surrounded by scantily clad maidens...when my time came... &lt;sigh&gt; The gods are cruel..."},{"name":"CHUCHUTO","text":"Master! What is the meaning of this!? Explain yourself!"},{"name":"RURUKUTA","text":"Now you've seen it with your own eyes! Master was beaten by a marmot─a common bleeding marmot! He would remind us how strong he was at every turn, but he was lying through his teeth!"},{"name":"ZANTOU","text":"(-Servant of the Alacran-)Gahaha! I can scarce believe my eyes! Wait till Master Weggfarr learns of this!"},{"name":"HAMON","text":"Forgive me, Chuchuto, <span class=\"highlight\">Forename</span>... I didn't mean to deceive anyone...least of all my students."},{"name":"HAMON","text":"Hamon Holyfist conquered every foe that stood before him, but he couldn't conquer old age. My strength, my reflexes, my endurance─they've all left me. There's nothing here but a decrepit old man."},{"name":"HAMON","text":"I would be alone for a while. I'll make my own way back to the guild. From now on, you're to do as Chuchuto bids, <span class=\"highlight\">Forename</span>."},{"name":"CHUCHUTO","text":"I can't believe it... When─<span class=\"emphasis\">how</span> did Master become so weak?"},{"name":"HAMON","text":"I would be alone for a while. I'll make my own way back to the guild. From now on, you're to do as Chuchuto bids, <span class=\"highlight\">Forename</span>."},{"name":"CHUCHUTO","text":"I've been doing some thinking, <span class=\"highlight\">Forename</span>. While 'tis true that Master had been deceiving us, he meant us no harm."},{"name":"CHUCHUTO","text":"Besides, I owe him my life. Had he not taken me in all those years ago, I would have died in some ditch. I could never bring myself to hate him. Even if he were an ordinary old man, I would still respect him."},{"name":"CHUCHUTO","text":"Alas, with the truth of his condition revealed, Master Hamon has lost his sense of purpose─his will to teach. I cannot bear to see him like this. I want him to regain his confidence, but for this he needs to regain his former strength."},{"name":"CHUCHUTO","text":"Listen, <span class=\"highlight\">Forename</span>. Master ever said that you remind him of his younger self. Were you to continue showing rapid improvement, I dare to hope that it would rekindle his fighting spirit."},{"name":"CHUCHUTO","text":"To this end, I will teach you a new technique, one which Master Hamon used to great effect during his prizefighting days."},{"name":"CHUCHUTO","text":"Steel Peak, it's called, and it sees you channel your gathered chakra into a powerful attack performed with your entire body."},{"name":"CHUCHUTO","text":"Make this technique your own, <span class=\"highlight\">Forename</span>, and strive to grow stronger still. When next Master Hamon beholds you, he will surely be moved to action!"},{"name":"QIB","text":"Show them the fruit of your training, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Have no fear! We're students of Hamon Holyfist!"},{"name":"QIB","text":"The marmots are all yours, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Ware the marauders' sweeping swings!"},{"name":"QIB","text":"The enemy pugilists hit hard! Stay light on your feet!"},{"name":"QIB","text":"Useless, the whole bloody lot of them...<br>Best we flee for now."},{"name":"SCENE00012","text":"Duty calls. Do you wish to proceed with<br>“The Spirit Is Willing”?"},{"name":"SCENE00012","text":"Yes"},{"name":"SCENE00012","text":"No"}],"reward":{"action":3546,"items":[{"id":1685},{"id":3022,"one":1},{"id":2677,"one":1},{"id":3546,"one":1},{"id":3780,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":3}],"questsType":"any","quests":[66091,66234]},"next":[66098]},"partials":[{"type":"npc","id":"1003817","obj":{"i":1003817,"n":"Hamon","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1003827","obj":{"i":1003827,"n":"Chuchuto","l":40,"q":5}},{"type":"npc","id":"1001445","obj":{"i":1001445,"n":"Osbert","l":43,"q":2}},{"type":"npc","id":"1001578","obj":{"i":1001578,"n":"Zuzumeda","l":43,"q":2}},{"type":"npc","id":"1003822","obj":{"i":1003822,"n":"Hamon","l":43,"q":1}},{"type":"npc","id":"1004147","obj":{"i":1004147,"n":"Chuchuto","l":43,"q":1}},{"type":"npc","id":"1004148","obj":{"i":1004148,"n":"Chuchuto","l":43,"q":1}},{"type":"npc","id":"1004149","obj":{"i":1004149,"n":"Hamon","l":43,"q":1}},{"type":"npc","id":"1004150","obj":{"i":1004150,"n":"Chuchuto","l":43,"q":1}},{"type":"action","id":"3546","obj":{"i":3546,"n":"Meditation","c":2534,"j":2,"t":4,"l":15}},{"type":"item","id":"1685","obj":{"i":1685,"n":"Hard Leather Himantes","l":14,"c":31008,"t":1,"p":598}},{"type":"item","id":"3022","obj":{"i":3022,"n":"Cotton Shirt","l":14,"c":42105,"t":35,"p":424}},{"type":"item","id":"2677","obj":{"i":2677,"n":"Hunting Hat","l":16,"c":41046,"t":34,"p":513}},{"type":"item","id":"3546","obj":{"i":3546,"n":"Fingerless Hard Leather Gloves","l":15,"c":44061,"t":37,"p":420}},{"type":"item","id":"3780","obj":{"i":3780,"n":"Hard Leather Crakows","l":15,"c":46155,"t":38,"p":384}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66091","obj":{"i":66091,"n":"Burning Up the Quarter Malm","g":128,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"66234","obj":{"i":66234,"n":"Burning Up the Quarter Malm","g":128,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"66098","obj":{"i":66098,"n":"Keeping the Spirit Alive","g":128,"l":"Ul'dah","s":200,"f":1}}]}