{"quest":{"name":"Great Eggspectations","location":"Gridania","id":66092,"patch":2.55,"sort":80,"icon":100390,"eventIcon":71221,"issuer":1011800,"target":1011800,"genre":199,"journal":["Jihli Aliapoh has a dream, and hopes that an adventurer like yourself might help it come true.<br>※This quest is available for a limited time only.","Jihli Aliapoh asks that you join her in celebrating the coming of Hatching–tide, a festival born from a vision bestowed on her by the Twelve Archons of yore; a vision that came to reality a twelvemoon prior. However, this year's event is to be no mere memorial, for Jihli has again been visited by the Archons: in her most recent dream, she saw adventurers in spriggan form following an auspicious spriggan, who guided them to a wondrous treasure. She bids you speak with her sylphic helper by the amphitheatre gates, so that you too might be transfigured into the shape of a spriggan, and bring her vision to life.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The sorceress, a sylph in Lalafellin clothing, transfigures you into spriggan form with illusory magicks. She bids you remain in disguise as you hunt for Archon eggs around Old Gridania, and collect three of the cards contained within, that you might exchange them with Jihli for a special prize.<br><br>※If the transfiguration should fade, speak with the sylphic sorceress again to be changed back into spriggan form.","You successfully hunt for three Archon eggs, and collect the cards within. Return to Jihli Aliapoh in Mih Khetto's Amphitheatre to collect your reward.","You deliver the Archon cards to Jihli Aliapoh, who is amazed to find a platinum card among your collection. She asks how you could have discovered the egg that contained this rarest of prizes, and you relate how an unusual spriggan holding a checkered egg drew your attention to it. Jihli is delighted to hear your news, recognizing the auspicious spriggan from her vision in your words. Convinced once more that the Archons' prophecy is coming true, she asks for your assistance in tracking down the auspicious spriggan, that he might guide you to the wondrous treasure of which the Archons spoke."],"objectives":["Speak with the sylphic sorceress.","While transfigured, collect three Archon cards from Archon eggs.","Present the Archon cards to Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Come one, come all, and bear witness to the miracle of Hatching–tide! There are eggs to be hunted, high jinks to be had, and wondrous treasures to be found! The Archons of yore have spoken once again, and invite you to join the revelry!"},{"name":"JIHLIALIAPOH","text":"Blessed be... <span class=\"highlight\">Forename</span>, is that you? The Archon who returned anew, has returned anew! With your good self on board, this year's festivities are sure to be as rousing a success as the last."},{"name":"JIHLIALIAPOH","text":"I shall never forget how you appeared before me that day, towering heroically above the shining vessels we had prepared for Hatching Hour. It was as if I had been transported back to that fateful moment when the Twelve Archons came to me in my dreams, prophesying their return. And return you have..."},{"name":"JIHLIALIAPOH","text":"Greetings, young Dreamer. <span class=\"highlight\">Forename</span>, is it? Might you be interested in partaking in this year's hunt? My Dreamers and I have hidden a multitude of eggs abroad, each containing a fabulous prize."},{"name":"JIHLIALIAPOH","text":"Why eggs, you ask? It is a strange history, but every word the truth. Some years back, the Twelve Archons of ages past blessed me with a vision. In my dream, they descended from the heavens atop vividly patterned eggs, and bid me ready the vessels for their return.<br>Every year since, my loyal band of Dreamers and I have painstakingly decorated eggs to match those from my vision, in the sure knowledge that one day they would summon the Archons to life. And would you believe that last year, the prophecy finally came to pass!"},{"name":"JIHLIALIAPOH","text":"But pray, do not think that I hold the festival again in mere mimicry of last year's wondrous events. The memory is too dear to my heart to desecrate it so. No, <span class=\"highlight\">Forename</span>─the Archons have seen fit to bless me with a new vision, with the promise of great happiness for all!"},{"name":"JIHLIALIAPOH","text":"In my dream, the towns and fields of Eorzea were thronged with spriggans─the habitual enemies of Hatching–tide, who have bedeviled festivals past with their obsessive egg theft─but no nightmare, this. For they were not <span class=\"emphasis\">real</span> spriggans, but adventurers in spriggan form!<br>All excepting one, that is─a mysterious auspicious spriggan, who guided the joyful masses to a glorious treasure!"},{"name":"JIHLIALIAPOH","text":"My Dreamers and I have done all in our power to set the stage for my vision to come to life─we have even found a means to transform men into beasts, just as they were in my dream─yet there is one matter that weighs heavily on my heart: the auspicious spriggan has yet to make its appearance."},{"name":"JIHLIALIAPOH","text":"But the <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span> is still young, and the more adventurers who partake in the hunt, the greater the chances that one will happen upon the creature. If you would join in the revelry, pray speak with the sylphic sorceress by the amphitheatre gates─she will grant you the necessary disguise."},{"name":"JIHLIALIAPOH","text":"If my dream is to come true, we need every able–bodied adventurer we can muster to join the hunt. Should you vouchsafe to partake in the day's festivities, speak with my sorceress friend by the amphitheatre gates. She will be only too happy to magick you into spriggan form."},{"name":"FRIENDLYSYLPH00556","text":"Happy Hatching–tide, fellow walking one! Ha ha! This one tricked walking one! This one isn't really a walking one, this one is really a sylph! Sylphs are experts at skin-changing tricks!"},{"name":"FRIENDLYSYLPH00556","text":"Dreaming one asked these ones to help make dreaming one's dreams come true, by using these ones' magicks to make walking ones look like furry ones. Does walking one want to turn into a furry one too?"},{"name":"FRIENDLYSYLPH00556","text":"Dreaming one has hidden Archon eggs all around Old Gridania. Once this one has magicked walking one into a furry one, walking one can hunt for the eggs, and collect the Archon cards inside. Take three cards back to dreaming one and dreaming one will exchange them for a wonderful prize."},{"name":"FRIENDLYSYLPH00556","text":"But cards are not all walking one might find! Dreaming one dreamed there was a lucky furry one─a <span class=\"emphasis\">real</span> furry one─somewhere in the city. If walking one sees the lucky furry one, make sure to tell dreaming one right away!"},{"name":"FRIENDLYSYLPH00556","text":"Dreaming one tries to keep a brave face, but deep down inside, dreaming one's thoughts are scrambled. Dreaming one is very worried that the lucky furry one might not appear, and if the lucky furry one doesn't appear, dreaming one's dreams will be scotched!"},{"name":"SYSTEM","text":"Using her magicks, the sylphic sorceress will transfigure you into a spriggan. While transfigured, hunt for Archon eggs in Old Gridania, and collect the cards inside. When you have collected three cards, present them to Jihli Aliapoh, and she will offer you a prize in exchange."},{"name":"SYSTEM","text":"While transfigured, you can only use certain actions. If you wish to return back to normal, simply leave the area or cancel the transfigured status effect."},{"name":"SYSTEM","text":"Should the transfiguration fade, you can change back into spriggan form by speaking to the sylphic sorceress once more."},{"name":"FRIENDLYSYLPH00556","text":"Dreaming one has hidden Archon eggs around Old Gridania, with special Archon cards inside. Collect three cards and take them back to dreaming one, and dreaming one will give walking one a wonderful prize!"},{"name":"JIHLIALIAPOH","text":"Oh no, it's a naughty spriggan, come to steal my lovely eggs! How lucky that I hid those ones with special cards inside around the town. Don't try to escape, or I'll have my sorceress magick you into <span class=\"alternative-container\"><span class=\"alternative\">a Hyur</span><span class=\"alternative\">an Elezen</span><span class=\"alternative\">a Lalafell</span><span class=\"alternative\">a Miqo'te</span><span class=\"alternative\">a Roegadyn</span><span class=\"alternative\">an Au Ra</span><span class=\"alternative\">a Hrothgar</span><span class=\"alternative\">a Viera</span></span>! Tee hee!"},{"name":"FRIENDLYSYLPH00556","text":"Happy Hatching–tide, furry─ Wait a moment, walking one isn't a furry one anymore. Did this one's skin–changing magicks wear off?"},{"name":"FRIENDLYSYLPH00556","text":"Don't worry, walking one. This one will turn walking one into a furry one again. See if walking one can find the Archon eggs dreaming one has hidden around Old Gridania. The eggs have special cards hidden inside, which dreaming one will swap for a wonderful prize!"},{"name":"JIHLIALIAPOH","text":"How did you enjoy being a spriggan, <span class=\"highlight\">Forename</span>? I must admit, I relished it immensely─it was just as I saw it in my vision! Pray speak with my sylphic assistant if you would like to try the disguise again, and don't forget to join in the egg hunt."},{"name":"SPRIGGAN00556","text":"Spriggy egg! Lucky egg! Lucky, lucky eeeeeegg!!!"},{"name":"SPRIGGAN00556","text":"Lucky egg! Lucky card! Shiny, shiny caaaaaard!!!"},{"name":"FRIENDLYSYLPH00556","text":"Walking one has collected three Archon cards, and one is a platinum card? Walking one is a lucky one indeed! Take them to dreaming one, and dreaming one will give walking one an extra-special reward!"},{"name":"JIHLIALIAPOH","text":"Greetings, my friend. It brings joy to my heart to see you partaking in the egg hunt. If you have collected any cards, I should be only too happy to reward you with a prize─one for every three you find."},{"name":"JIHLIALIAPOH","text":"Oh, but forgive me─I'm sure you wouldn't wish to remain a spriggan for the rest of your days. Allow me to dispel that enchantment for you..."},{"name":"JIHLIALIAPOH","text":"Goodness gracious! This is a platinum Archon card─the rarest of all the prizes my Dreamers prepared for the hunt. The eggs containing them were secreted in such secluded spots I was beginning to fear they would never be discovered. I can't believe you actually found one!"},{"name":"JIHLIALIAPOH","text":"What!? A strange spriggan holding a checkered egg was standing over its basket? B-But that means─ ...Yes, it must be! The auspicious spriggan that the Archons of yore revealed to me has finally shown himself!"},{"name":"JIHLIALIAPOH","text":"Oh, how wonderful! You never fail to astound me, <span class=\"highlight\">Forename</span>─or should I call you <span class=\"emphasis\">Archon</span> <span class=\"highlight\">Forename</span>? Once again you are making my dreams come true!"},{"name":"JIHLIALIAPOH","text":"Oh, how wonderful! Then my vision <span class=\"emphasis\">is</span> coming true, after all. Thank the Twelve..."},{"name":"JIHLIALIAPOH","text":"After last year's successes, my Dreamers have quite convinced themselves that my vision would again come true, and have devoted themselves utterly to preparing this year's festivities. I could never have forgiven myself had my dream proved to be no more than a fantasy."},{"name":"JIHLIALIAPOH","text":"But now the auspicious spriggan is discovered, and all is proceeding as the Archons of yore revealed it to me. If we can only keep track of the creature, he is sure to lead us to the wondrous treasure of which the prophecy spoke."},{"name":"JIHLIALIAPOH","text":"Hatching–tide is about to begin in earnest! If I might further impose on your kindness, could I ask for your assistance with the next stage of proceedings? Come and speak to me again whenever you are ready. Until then, <span class=\"highlight\">Forename</span>, may the Archons of yore bless you and keep you."},{"name":"SYSTEM","text":"In order to proceed further in the quest, you must be under the transfigured status."}],"reward":{"items":[{"num":3,"id":5824}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66093]},"partials":[{"type":"npc","id":"1011800","obj":{"i":1011800,"n":"Jihli Aliapoh","l":53,"q":2}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66093","obj":{"i":66093,"n":"Poaching the Poachers","g":199,"l":"Gridania","s":81}}]}