{"quest":{"name":"Keeping the Spirit Alive","location":"Ul'dah","id":66098,"patch":2.0,"sort":200,"icon":100059,"unlocksFunction":1,"eventIcon":71341,"issuer":1003817,"target":1003817,"involved":[1003827],"genre":128,"journal":["Hamon is in dire need of cheering up.","Recent events have left Hamon deeply depressed. Unable to muster up the will to train you, he bids you seek out Chuchuto for your next lesson.","Chuchuto believes that if you go about your training the way that Hamon once did, you might serve to stoke the fires of his fighting spirit. To this end, she bids you go to the southern part of Drybone, and there perform a Bootshine combo on the trees that bear indentations. Doing so will stir hornet clouds from their hives. Defeat them and claim three of their stingers.","You have obtained the required number of hornet stingers. Present them to Hamon at the Pugilists' Guild.","As Chuchuto had expected, the hornet stingers remind Hamon of his younger days, and the man expresses his fervent desire to relive them again. Rather unexpectedly, however, he demands that you now fight him. Let your guildmaster know when you are ready to begin.","No sooner does your bout with the guildmaster end than his old rival, Weggfarr Wideaxe, arrives on the scene with Rurukuta in tow. Having made a mockery of Hamon's efforts, Weggfarr challenges him to a public rematch, with the Pugilists' Guild itself as the prize for the winner. Speak with your guildmaster and learn his mind on the matter.","Much to Chuchuto's dismay, Hamon is determined to face Weggfarr again. Back in his prime, the guildmaster defeated the hulking marauder, and he believes he can repeat the feat─with your help. Keep up your training, that your progress might inspire Hamon to regain his former strength.<br><br>※The next pugilist quest will be available from Hamon upon reaching level 25."],"objectives":["Speak with Chuchuto.","Use Bootshine on the indentations and obtain hornet stingers.","Present the hornet stingers to Hamon.","Train with Hamon.","Speak with Hamon.","Defeat Hamon Holyfist!"],"dialogue":[{"name":"HAMON","text":"Oh, it's you, <span class=\"highlight\">Forename</span>. I'm sorry, but I don't have anything to teach you...if I ever did at all. You're far better off training under Chuchuto. You'll find her over yonder. Just... Just leave me be."},{"name":"CHUCHUTO","text":"Hrmmm... I was so hopeful that seeing you improve in leaps and bounds would spur Master Hamon out of his doldrums. It seems more must be done."},{"name":"CHUCHUTO","text":"Perhaps the end result is not so important as the manner in which you get there. In other words, if you were to train <span class=\"emphasis\">precisely</span> as Master Hamon once did─overcome the selfsame challenges that he did in his youth─I daresay it would stoke the fires of his fighting spirit!"},{"name":"CHUCHUTO","text":"Listen well, <span class=\"highlight\">Forename</span>. Master once told me that he used to refine his combinations by provoking deadly creatures into unleashing their fury upon him. For this purpose, he often went to the southern part of Drybone to fight the hornet clouds there."},{"name":"CHUCHUTO","text":"To this day, the tree trunks that he struck to stir the vilekin from their hives bear the mark of his fists. I want you to seek out these trees, and do as Master Hamon once did─strike them with a Bootshine combo, and fight the hornet clouds that emerge."},{"name":"CHUCHUTO","text":"Once you have felled enough of the creatures to collect three of their stingers, return here and present them to Master Hamon. They will remind him of better days, I am sure of it!"},{"name":"SYSTEM","text":"Use Bootshine on the indentations and obtain hornet stingers from the hornet clouds that appear."},{"name":"HAMON","text":"What is it now? Can't you leave a feeble old man in peace?"},{"name":"HAMON","text":"Thal's balls, these are hornet stingers! You...you trained as I once did out in Drybone!?"},{"name":"HAMON","text":"Heh, those hornet clouds were right pesky buggers. I fair lost count of the times they stung me, though I remember the, er...<span class=\"emphasis\">places</span> well enough. The pain was nigh unbearable, but I always stood my ground!"},{"name":"HAMON","text":"Ah, the memories of my younger days come flooding back! What I wouldn't give to relive them!"},{"name":"HAMON","text":"<span class=\"highlight\">Forename</span>! I want you to fight me, right here, right now! Make me remember what it's like to be young again─to have nothing to lose and everything to gain!"},{"name":"INSTANCE","text":"Duty calls. Proceed with<br>“Keeping the Spirit Alive”?"},{"name":"INSTANCE","text":"Yes"},{"name":"INSTANCE","text":"No"},{"name":"HAMON","text":"Hah hah hah! Gods, I haven't felt this invigorated since...since <span class=\"emphasis\">forever</span>! When I'm fighting you, it's as though I'm fighting my younger self! Mayhap there's still hope for these old bones! I'll make my comeback yet, see if I don't!"},{"name":"WEGGFARR","text":"(-???-)Gahahaha! What are ye doin', old man? Learnin' how to walk?"},{"name":"WEGGFARR","text":"&lt;gasp&gt; Y-You're...Weggfarr Wideaxe!"},{"name":"WEGGFARR","text":"Ain't none called me that in ages... Nay, not since the day ye defeated me on the bloodsands..."},{"name":"WEGGFARR","text":"I gave up prizefightin' after that for the humiliation, but it weren't long till I found a place in the Alacran. Yer boy Rurukuta works for me now. Imagine me surprise when I learned he used to train under the <span class=\"emphasis\">mighty</span> Holyfist."},{"name":"WEGGFARR","text":"But Holyfist ain't nothin' but a name these days, so I'm told. How do ye sleep at night, knowin' how flaccid ye've become?"},{"name":"WEGGFARR","text":"'Course, if yer havin' trouble noddin' off, ye could always try a whiff o' somnus. I'll even give ye a complimentary sample. But like as not, a dodderin' old sort like you won't ever wake up again! Gahahaha!"},{"name":"HAMON","text":"Shut your mouth, Weggfarr, or I'll shut it for you!"},{"name":"WEGGFARR","text":"Now, now, let's be civilized for a moment, eh? We're old friends, after all, an' friends help each other out. Ye mentioned makin' a comeback just now. If yer serious about it, I'd be <span class=\"emphasis\">glad</span> to lend a helpin' hand."},{"name":"WEGGFARR","text":"By way o' motivatin' ye, how's about we have us a rematch? O' course, it'd take place in public, jus' like old times. Oh, an' there should be a fittin' purse as well. Let's say...the winner gets the Pugilists' Guild."},{"name":"CHUCHUTO","text":"What!? That's ridiculous! Master, you're not obligated to take him up on this!"},{"name":"WEGGFARR","text":"Ah, this must be yer little nursemaid! Rest assured, after I've taken over the guild, I'll keep her on as me <span class=\"emphasis\">personal</span> assistant! Gahahaha!"},{"name":"CHUCHUTO","text":"D-Do you really mean to fight him?"},{"name":"HAMON","text":"Have no fear, Chuchuto."},{"name":"CHUCHUTO","text":"Master..."},{"name":"HAMON","text":"<span class=\"highlight\">Forename</span>. I don't mean to put undue pressure on you..."},{"name":"HAMON","text":"But the fate of the guild rests upon your shoulders!"},{"name":"CHUCHUTO","text":"I don't believe this!"},{"name":"HAMON","text":"Listen to me, Chuchuto. I know I can do this. I just need <span class=\"highlight\">Forename</span> to keep getting stronger, as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s been doing so far. Fighting <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> reminds me of who I used to be. I'm confident I can be that man again."},{"name":"POP","text":"A maddening buzzing fills your ears!"},{"name":"HAMON","text":"If you're feeling apprehensive about this rematch business, I don't blame you. I'm not blind to reality. If I were to face Weggfarr as I am now, I'd be down for the count in a matter of heartbeats, if not lying dead in a pool of my own blood."},{"name":"HAMON","text":"But I'm determined to win, and I <span class=\"emphasis\">can</span> with your help. Your presence sets my fighting spirit to raging, <span class=\"highlight\">Forename</span>!"},{"name":"HAMON","text":"So keep at your training─I promise to do the same. When you've grown stronger, return here, and we'll <span class=\"emphasis\">both</span> continue our lessons!"},{"name":"QIB","text":"Ready or not, here I come!"},{"name":"QIB","text":"Make me feel good, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Ugh... That'll leave a bruise..."},{"name":"QIB","text":"Yes! It's starting to come back to me!"},{"name":"QIB","text":"You won't have it so easy this round, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Hah hah hah! There's no stopping the Holyfist!"},{"name":"QIB","text":"I...I can't bear to watch..."},{"name":"QIB","text":"Ngaaah! Have you no respect for the elderly!?"},{"name":"QIB","text":"Yes! <span class=\"emphasis\">Yes</span>! My strength returns!"},{"name":"QIB","text":"Come on! Let's go it one more round!"},{"name":"QIB","text":"Again!?"},{"name":"QIB","text":"Get ready to feel the power of <span class=\"emphasis\">Hamooon HOLYFIIIST</span>!"},{"name":"QIB","text":"I'm just getting started!"},{"name":"QIB","text":"More, <span class=\"highlight\">Forename</span>! Give me more!"},{"name":"QIB","text":"Urgh! I...I feel so...so <span class=\"emphasis\">alive</span>!"}],"reward":{"items":[{"id":1688},{"id":3043,"one":1},{"id":2710,"one":1},{"id":3559,"one":1},{"id":3791,"one":1},{"num":5,"id":5824,"one":1}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":3}],"quests":[66094]},"next":[66102]},"partials":[{"type":"npc","id":"1003817","obj":{"i":1003817,"n":"Hamon","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1003827","obj":{"i":1003827,"n":"Chuchuto","l":40,"q":5}},{"type":"item","id":"1688","obj":{"i":1688,"n":"Goatskin Cesti","l":19,"c":31009,"t":1,"p":915}},{"type":"item","id":"3043","obj":{"i":3043,"n":"Goatskin Jacket","l":20,"c":43030,"t":35,"p":877}},{"type":"item","id":"2710","obj":{"i":2710,"n":"Goatskin Eyepatch","l":20,"c":40891,"t":34,"p":708}},{"type":"item","id":"3559","obj":{"i":3559,"n":"Goatskin Armguards","l":20,"c":48324,"t":37,"p":630}},{"type":"item","id":"3791","obj":{"i":3791,"n":"Goatskin Leg Guards","l":20,"c":46321,"t":38,"p":720}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66094","obj":{"i":66094,"n":"The Spirit Is Willing","g":128,"l":"Ul'dah","s":150,"f":1}},{"type":"quest","id":"66102","obj":{"i":66102,"n":"Star-crossed Rivals","g":128,"l":"Ul'dah","s":250,"f":1}}]}