{"quest":{"name":"Star-crossed Rivals","location":"Ul'dah","id":66102,"patch":2.0,"sort":250,"icon":100059,"unlocksFunction":1,"eventIcon":71341,"issuer":1003817,"target":1003817,"involved":[1003827,1003829],"genre":128,"journal":["Hamon appears to be in higher spirits.","In his eagerness to regain his former strength, Hamon has overtrained and injured himself. Once again, he bids you seek out Chuchuto for your next lesson.","Chuchuto has a challenge in mind that you should find stimulating. Make ready for your lesson, and rendezvous with her at Little Ala Mhigo in southern Thanalan.","It turns out your training is to help prepare for Master Hamon's training. Take the striking dummies Chuchuto has entrusted to you, and deploy them at the specified locations.","You have deployed all the striking dummies. Report back to Chuchuto.","Upon returning to Little Ala Mhigo, you are suddenly assailed by Rurukuta and his minions. With Chuchuto's aid, you succeed in subduing him, and finally learn his true agenda. Rurukuta only wants his master to live, even if it means swallowing his pride and running from the impending fight. Satisfied that Hamon is in good hands, Rurukuta takes his leave. Return to the Pugilists' Guild and report all that transpired to your guildmaster.","While appreciative of Rurukuta's sentiments, Hamon is more determined than ever to confront Weggfarr. He bids you keep up your training, lest you be left behind in his dusty wake.<br><br>※The next pugilist quest will be available from Hamon upon reaching level 30."],"objectives":["Speak with Chuchuto.","Meet Chuchuto at Little Ala Mhigo.","Deploy striking dummies.","Report to Chuchuto.","Report to Hamon at the Pugilists' Guild.","Defeat Rurukuta and his minions!"],"dialogue":[{"name":"HAMON","text":"Hah hah hah! I swear, each time I see you, you remind me more and more of my younger self. At this rate, you're like to transform into a handsome devil before the moon's over!"},{"name":"HAMON","text":"Now then, I believe you're here to learn. Unfortunately, I'm in no condition to teach."},{"name":"HAMON","text":"This is rather embarrassing to admit...but in my eagerness to prepare for the big rematch, I've overtrained and thrown my back out. &lt;groan&gt; I tell you, old age is hells... I fear Chuchuto will have to tend to you in my stead."},{"name":"CHUCHUTO","text":"It seems the prospect of facing his old rival has lit a veritable fire under Master Hamon's backside. I am so relieved to see that he has a purpose again. The trick now is to keep a lid on his zeal, lest he injure himself!"},{"name":"CHUCHUTO","text":"But let us speak of your lesson. When you are ready, come and meet me at Little Ala Mhigo. I have a challenge in mind that you are certain to find...<span class=\"emphasis\">stimulating</span>!"},{"name":"CHUCHUTO","text":"I've been waiting for you, <span class=\"highlight\">Forename</span>. Today, your training will be...to prepare for Master Hamon's training!"},{"name":"CHUCHUTO","text":"I've brought with me a set of striking dummies, and I want you to deploy them at certain locations."},{"name":"CHUCHUTO","text":"Lest you think this task to be drudgery, the locations are rife with peril. Your skills will most certainly be put to the test."},{"name":"CHUCHUTO","text":"By way of advice, if you must approach dangerous fiends, lightness of foot is your greatest ally."},{"name":"CHUCHUTO","text":"Off with you now, <span class=\"highlight\">Forename</span>─go set up those striking dummies. I shall await your return!"},{"name":"CHUCHUTO","text":"How goes it? Let me know when you have deployed all the striking dummies."},{"name":"SCENE00012","text":"Duty calls. Proceed with<br>“Star-crossed Rivals”?"},{"name":"SCENE00012","text":"Yes"},{"name":"SCENE00012","text":"No"},{"name":"CHUCHUTO","text":"Excellent work, <span class=\"highlight\">Forename</span>! All that's left is to have Master Hamon come and train!"},{"name":"CHUCHUTO","text":"What are <span class=\"emphasis\">you</span> doing here!?"},{"name":"RURUKUTA","text":"That adventurer is a negative influence on Master Hamon. I'm going to see to it <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> never bothers him again."},{"name":"CHUCHUTO","text":"What are you talking about!? <span class=\"highlight\">Forename</span>'s the best thing that's happened to Master in years! If you want a piece of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, you'll need to deal with <span class=\"emphasis\">me</span>, too!"},{"name":"CHUCHUTO","text":"Why, Rurukuta? Why are you so bent on bringing down Master Hamon and seeing the guild in ruins?"},{"name":"RURUKUTA","text":"You have it all wrong! I'm doing this for Master's own sake!"},{"name":"RURUKUTA","text":"It's true I left the guild for the shock of seeing Master in that pathetic state. And it's true I got involved with some unsavory types. But where else was I supposed to go? <span class=\"emphasis\">Me</span>, a refugee without a gil to his name!"},{"name":"RURUKUTA","text":"But for all the ungrateful things I've done, I've never forgotten how Master Hamon took me in and instructed me in the ways of the fist. This is why I want him to give up his foolish notion of facing Weggfarr."},{"name":"RURUKUTA","text":"You don't know that man like I do, Chuchuto. Should this fight come to pass, I fear Master won't walk away with his life."},{"name":"RURUKUTA","text":"It doesn't matter that Master has grown weak and feeble. I just want him to live, even if it means having him swallow his pride."},{"name":"CHUCHUTO","text":"Oh, Rurukuta... Why didn't you just say so?"},{"name":"CHUCHUTO","text":"But now that I know your mind, I can say with confidence that you have no cause to fear."},{"name":"CHUCHUTO","text":"<span class=\"highlight\">Forename</span> is not the plague that you think <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is. It's <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> will to succeed that's inspiring Master to regain his former strength. And when the day of the rematch finally comes, I've no doubt he will wallop that odious Weggfarr to the seventh hell and back!"},{"name":"RURUKUTA","text":"I pray you're right. But whatever happens, know that I cannot help you, not where I am. Chuchuto, <span class=\"highlight\">Forename</span>...I leave Master Hamon in your care."},{"name":"CHUCHUTO","text":"Gods, that felt <span class=\"emphasis\">liberating</span>! Trading blows with Rurukuta and learning his true agenda─a great burden has been lifted off my chest!"},{"name":"CHUCHUTO","text":"Let us return to the guild, <span class=\"highlight\">Forename</span>. You've had your training, and now it's time for Master Hamon's!"},{"name":"HAMON","text":"Welcome back, <span class=\"highlight\">Forename</span>. I'm told you've kindly set up some dummies for me."},{"name":"HAMON","text":"But gods, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, did you have to put them in such dangerous places!?"},{"name":"HAMON","text":"To make matters worse, Chuchuto's hidden my grog and says I won't see a drop of it till I've finished training! How the hells am I supposed to loosen my phlegm now!? &lt;cough&gt; &lt;cough&gt;"},{"name":"HAMON","text":"&lt;sigh&gt; That girl will make a fine guildmaster when the time comes..."},{"name":"HAMON","text":"I heard about Rurukuta as well, of course. For all his shortcomings, the boy has a good heart."},{"name":"HAMON","text":"But while his concern is touching, I won't run from Weggfarr! Not today, and not ever!"},{"name":"HAMON","text":"On that note, I'd best get ready for my little jaunt to Little Ala Mhigo. If I can't face down a few mindless beasts, I'm in no shape to challenge Weggfarr. Don't slack off, <span class=\"highlight\">Forename</span>, or I'll leave you in my dusty wake!"},{"name":"QIB","text":"Out of my way, Chuchuto!"},{"name":"QIB","text":"No! I won't let you hurt <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Hounds! Tear that <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> apart!"},{"name":"QIB","text":"The war hound is trouble, <span class=\"highlight\">Forename</span>! Finish it quick as you can!"},{"name":"QIB","text":"Grrr... You leave me no choice!"},{"name":"QIB","text":"A bastet!? Where did you find that thing!?"},{"name":"QIB","text":"That creature will sap your strength! Avoid its gaze!"},{"name":"QIB","text":"Urgh... You've grown strong, Rurukuta!"},{"name":"QIB","text":"Y-You leave <span class=\"highlight\">Forename</span>...alone..."}],"reward":{"items":[{"id":1697},{"id":3066,"one":1},{"id":3576,"one":1},{"id":3349,"one":1},{"id":27638,"one":1},{"num":2,"id":5825,"one":1}],"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":3}],"quests":[66098]},"next":[66103]},"partials":[{"type":"npc","id":"1003817","obj":{"i":1003817,"n":"Hamon","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1003827","obj":{"i":1003827,"n":"Chuchuto","l":40,"q":5}},{"type":"npc","id":"1003829","obj":{"i":1003829,"n":"Chuchuto","l":45,"q":1}},{"type":"item","id":"1697","obj":{"i":1697,"n":"Toadskin Cesti","l":26,"c":31012,"t":1,"p":2274}},{"type":"item","id":"3066","obj":{"i":3066,"n":"Velveteen Shirt","l":25,"c":42226,"t":35,"p":1428}},{"type":"item","id":"3576","obj":{"i":3576,"n":"Fingerless Goatskin Gloves","l":25,"c":44062,"t":37,"p":1282}},{"type":"item","id":"3349","obj":{"i":3349,"n":"Velveteen Sarouel","l":25,"c":45178,"t":36,"p":1099}},{"type":"item","id":"27638","obj":{"i":27638,"n":"Altered Velveteen Bandana","l":25,"c":41774,"t":34}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66098","obj":{"i":66098,"n":"Keeping the Spirit Alive","g":128,"l":"Ul'dah","s":200,"f":1}},{"type":"quest","id":"66103","obj":{"i":66103,"n":"Return of the Holyfist","g":128,"l":"Ul'dah","s":300,"f":1}}]}