{"quest":{"name":"Close to Home","location":"Ul'dah","id":66104,"patch":3.1,"sort":9,"icon":100087,"eventIcon":71201,"issuer":1003988,"target":1001353,"involved":[1002277,1003908],"genre":1,"journal":["Momodi, the proprietress of the Quicksand, wants you to perform three tasks that will help you learn the fundamentals of adventuring.","Momodi has given you three tasks to perform. Should you encounter any citizens who seem to be in need of help as you make your way around Ul'dah, why not offer your services?","You have completed all three tasks. Report back to Momodi at the Quicksand.","Momodi explains that the three locations you visited will feature prominently in your adventuring life. Heed well her advice, and travel further afield as your experience grows."],"objectives":["Attune yourself to the aetheryte found inside the city.","Visit the Gladiators' Guild.","Listen to Seseroga's explanation of the markets.","Report to Momodi at the Quicksand."],"dialogue":[{"name":"MOMODI","text":"Before you go chargin' off to find your fortune, I've a few basic tasks I'd like you to perform so as to help you get to know the place."},{"name":"MOMODI","text":"First of all, I want you to visit the aetheryte plaza. To get there, head west from here till you reach Emerald Avenue, then look to the north. You should see a giant, floatin' crystal called an aetheryte."},{"name":"MOMODI","text":"If it weren't for aetherytes, travelin' around Eorzea would be a damn sight more troublesome than it is. 'Course, you still need to attune with 'em before you can use 'em, so be sure to do that with the one in the plaza. You ever attuned with an aetheryte before, <span class=\"highlight\">Forename</span>? If not, just lay your hand on the thing and you'll see what I mean."},{"name":"MOMODI","text":"When you've done that, I want you to pay a visit to the Gladiators' Guild, over at the Coliseum."},{"name":"MOMODI","text":"Assumin' that sword ain't just for show, you might consider trainin' there."},{"name":"MOMODI","text":"And finally, I want you to visit the Sapphire Avenue Exchange, over on the Steps of Thal."},{"name":"MOMODI","text":"Goods from all across Eorzea and beyond turn up there every day. You'll have no trouble findin' armor, weapons, or anythin' else a fledglin' adventurer like yourself might need."},{"name":"MOMODI","text":"You might say that <span class=\"emphasis\">everythin's</span> for sale here in Ul'dah─as long as you've got the gil."},{"name":"MOMODI","text":"Just make sure as you don't pay more than you ought, <span class=\"highlight\">Forename</span>."},{"name":"MOMODI","text":"There's plenty as won't scruple to swindle unsuspectin' foreigners like yourself, 'specially if they think no one's lookin' out for their best interests."},{"name":"MOMODI","text":"Which is why I'm givin' you this letter. When you visit the exchange, find a gentleman named Seseroga and give it to him. He'll be happy to tell you about the markets once he's read it."},{"name":"MOMODI","text":"In short, then: visit the aetheryte plaza, the Gladiators' Guild, and the Sapphire Avenue Exchange. Simple."},{"name":"MOMODI","text":"Oh, but before you go, a word of advice: while there're more than a few unsavory characters out there who'll try to take advantage of you, there are also some with honest-to-goodness problems who you should consider offerin' a helpin' hand to."},{"name":"MOMODI","text":"A lot of folk are lured to this city by the promise of wealth and power. What many of 'em fail to realize is that instead of chasin' after gil the moment they get here, they ought to be makin' friends."},{"name":"MOMODI","text":"Let it be known that you're willin' to give as much as you get, and opportunities will come your way."},{"name":"MOMODI","text":"Speakin' of which, you should speak with the Smith over yonder─those lads always have some good advice for up-and-comin' adventurers. Otherwise, that's about it from me. It's past time you got goin'. Oh, and let me know when you've finished, will you? That way, I won't spend my days worryin' that you're down to your smallclothes without a gil to your name."},{"name":"LULUTSU","text":"Welcome to the Gladiators' Guild, friend!"},{"name":"LULUTSU","text":"Tell me, are you new to the thrills of mortal combat? Well, whether you are or not, you are new to us!"},{"name":"LULUTSU","text":"If you would take your place in these hallowed halls, you must be willing and ready to undergo the most rigorous training. You must endure cuts and bruises beyond counting, and like as not far worse."},{"name":"LULUTSU","text":"A daunting prospect, I concede─but there is no other way if you mean to take to the bloodsands one day. And why wouldn't you? The Coliseum is only the most celebrated place of public entertainment in all of Ul'dah!"},{"name":"LULUTSU","text":"Where else could a poor man amass a fortune so vast as to one day allow him to claim a seat on the Syndicate?"},{"name":"LULUTSU","text":"Ahhh...there's not an Ul'dahn alive who isn't inspired by the rise of the self-made man."},{"name":"LULUTSU","text":"And there is no truer embodiment of this than the gladiator who wins riches and fame with his sword."},{"name":"LULUTSU","text":"Throughout its long and storied history, this guild has nurtured countless champions."},{"name":"LULUTSU","text":"Our training methods are second to none, and our members ever strive to develop new techniques."},{"name":"LULUTSU","text":"If you desire true glory─to fight and triumph, 'midst the roar of ten thousand voices─then this is where you belong, adventurer."},{"name":"LULUTSU","text":"...Think of it. Think of your legacy. And if your soul stirs...join us."},{"name":"NENEBARU","text":"Hail, adventurer! Might you have come at the behest of Miss Momodi of the Quicksand?"},{"name":"NENEBARU","text":"Excellent. Which brings us to the matter of the attunement fee─that will be one hundred thousand gil, if you please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"NENEBARU","text":"...AHAHAHAHAHA! Apologies, but I do so relish the opportunity to make that jest. The look on your face was absolutely priceless! Ah, but the fact that you were so easily deceived suggests to me that you are unfamiliar with the use of aetherytes. Allow me to explain."},{"name":"NENEBARU","text":"These crystalline agglomerations tap into aetherial energies, and are primarily used as a means to travel swiftly from one place to another."},{"name":"NENEBARU","text":"Perchance you have heard of Return and Teleport? Well, these transportation spells make direct use of the aetherytes and their connection to the flow of aether."},{"name":"NENEBARU","text":"Given that there is an aetheryte in almost every corner of Eorzea, any adventurer with a mind to explore the realm will wish to seek out and attune <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> to each and every one!"},{"name":"NENEBARU","text":"But even if you have no intention of wandering beyond the sultanate's borders, it would be prudent for you to attune yourself to any aetherytes you encounter from now on."},{"name":"NENEBARU","text":"I pray you found that informative. Should you wish to learn more about aetherytes or transportation magic, I should be happy to answer your questions."},{"name":"SYSTEM","text":"You attune with the aetheryte.<br>You are now able to use the Return spell!"},{"name":"SESEROGA","text":"And you are?<br>...Ho, a newly come adventurer. But of course. Yes, I am Seseroga. What can I do for you?"},{"name":"SESEROGA","text":"Ah, you would have me teach you the ways of the marketplace? Very wise. As for my fee... What? You expect me to do it for <span class=\"emphasis\">free</span>!? Surely you jest."},{"name":"SESEROGA","text":"My dear adventurer, when you ask an Ul'dahn for a favor, you should at least <span class=\"emphasis\">try</span> to make it worth his while. Judging by your garb, I rather doubt you could afford my services, but the fact you offer nothing is laughable."},{"name":"SESEROGA","text":"Oh. Mistress Momodi instructed you to seek me out, did she? Hmph. Consider yourself fortunate to have such influential friends."},{"name":"SESEROGA","text":"I shall be brief, and you shall be attentive."},{"name":"SESEROGA","text":"You stand in the Sapphire Avenue Exchange, the busiest and most profitable marketplace in the sultanate."},{"name":"SESEROGA","text":"Being advantageously situated in relation to the other city–states, Ul'dah's markets have ever served as both the literal and figurative centers of Eorzean commerce."},{"name":"SESEROGA","text":"All the great overland trade routes lead to our city, and the majority of maritime trade between Vylbrand and Aldenard passes through our ports."},{"name":"SESEROGA","text":"Because of this, countless companies and consortia have chosen Ul'dah as their base of operations. They see to it that this marketplace is awash with merchants and moneylenders, day and night."},{"name":"SESEROGA","text":"Anything a man could ever desire can be purchased here─provided as he has sufficient funds."},{"name":"SESEROGA","text":"Surely there's something you seek, adventurer? A deadlier sword, perhaps, or a shinier trinket? Whatever it is you want, the exchange will have it."},{"name":"SESEROGA","text":"To the north, you will find merchants peddling armor and accessories, curatives and crafting materials."},{"name":"SESEROGA","text":"And to the south, you will find weapons, tools, and an assortment of other useful items for sale."},{"name":"SESEROGA","text":"Seek out a particular merchant, or browse to your heart's content. But do try to remain aloof should you find something that piques your interest. Decisions made in the heat of the moment are usually unwise, especially where coin is concerned."},{"name":"SESEROGA","text":"Ahem. That is all the complimentary aid you shall have from me─and <span class=\"emphasis\">far too much</span> for my taste."},{"name":"SESEROGA","text":"My regards to Momodi. Now, off with you!"},{"name":"MOMODI","text":"How was your tour of the city, <span class=\"highlight\">Forename</span>? Get lost, did you?"},{"name":"MOMODI","text":"Aye, well, Ul'dah's a big place with lots to see and do─but wanderin' around aimlessly don't pay the bills. If you're serious about makin' a livin' here, you'll need to remember where things are."},{"name":"MOMODI","text":"So when you go explorin', explore like you've got a purpose, eh?"},{"name":"MOMODI","text":"All right, then! All that's left is for you to work hard, make money, and spend it here at the Quicksand!"}],"reward":{"gil":107,"job":1,"xp":100},"reqs":{"jobs":[{"lvl":1,"id":130}],"quests":[66130]},"next":[65925,65926,66131]},"partials":[{"type":"npc","id":"1003988","obj":{"i":1003988,"n":"Momodi","l":40,"q":4,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1002277","obj":{"i":1002277,"n":"Lulutsu","l":41,"q":6,"t":"Guild Receptionist"}},{"type":"npc","id":"1003908","obj":{"i":1003908,"n":"Seseroga","l":41,"q":5}},{"type":"quest","id":"66130","obj":{"i":66130,"n":"Coming to Ul'dah","g":93,"l":"Ul'dah","s":1}},{"type":"quest","id":"65925","obj":{"i":65925,"n":"Fantastic Voyage","g":93,"l":"Ul'dah","s":40}},{"type":"quest","id":"65926","obj":{"i":65926,"n":"Catch Your Breath","g":93,"l":"Ul'dah","s":40}},{"type":"quest","id":"66131","obj":{"i":66131,"n":"We Must Rebuild","g":1,"l":"Ul'dah","s":14}}]}