{"quest":{"name":"Beet Red Beetles Beat Red","location":"Ul'dah","id":66107,"patch":2.0,"sort":30,"eventIcon":71221,"issuer":1003896,"target":1003896,"genre":93,"journal":["Wolkan of the Gladiators' Guild is muttering frantically to himself about an infestation of ladybugs in the region.","Travel to western Thanalan and slay four of the pestilent ladybugs.","You have bravely slain four unsuspecting ladybugs. Return to the Gladiators' Guild and tell Wolkan of your heroic deed.","By felling several nefarious ladybugs, you have made the road through Thanalan a deal safer for traveling merchants."],"objectives":["Slay ladybugs in western Thanalan.","Report to Wolkan at the Gladiators' Guild."],"dialogue":[{"name":"WOLKAN","text":"Carried yer arse in here lookin' for work, eh? Well, yer in luck. Just so happens I've a deed what needs doin'."},{"name":"WOLKAN","text":"Wild ladybugs've been wreakin' bloody havoc on the outskirts of town. Somethin' in the air of late's made 'em ornery as an aurochs in rut."},{"name":"WOLKAN","text":"Ain't much for fightin' on their own, but in numbers they're more than a match for any merchant who's seen more days at the teat than he has on the battlefield."},{"name":"WOLKAN","text":"Well, what'll it be? Fancy puttin' down four or so of the bloody buggers, or don't ye?"},{"name":"WOLKAN","text":"Back in one piece, are ye? It's about bloody time. "},{"name":"WOLKAN","text":"I admit, ye look as though ye just picked up a sword yesterday. But ye handle yerself well enough, I'll give ye that."},{"name":"WOLKAN","text":"And here, I'll give ye this, as well. Ain't worth a night in Ul'dah's finest pillowhouse, but I'm sure ye'll find a use for it."}],"reward":{"items":[{"id":3530,"one":1},{"id":3531,"one":1},{"id":5824,"one":1}],"xp":147}},"partials":[{"type":"npc","id":"1003896","obj":{"i":1003896,"n":"Wolkan","l":41,"q":3}},{"type":"item","id":"3530","obj":{"i":3530,"n":"Fingerless Leather Gloves","l":5,"c":44060,"t":37,"p":126}},{"type":"item","id":"3531","obj":{"i":3531,"n":"Leather Lightmitts","l":5,"c":44065,"t":37,"p":126}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}}]}