{"quest":{"name":"In the Name of Science","location":"Ul'dah","id":66108,"patch":2.0,"sort":30,"eventIcon":71221,"issuer":1003897,"target":1003897,"genre":93,"journal":["Erasmus of the Thaumaturges' Guild is preoccupied with his studies, but his brow is furrowed in a way that cries out for help.","To further the Order of Nald'thal's knowledge of life and death, Erasmus has tasked you with gathering five bottles of marmot blood. Marmots are prolific outside the Gate of the Sultana, in western Thanalan.","You have gathered all the marmot blood Erasmus requires. Return to the Thaumaturges' Guild and present him with the bottles.","You have completed the task at hand, confident that five marmot lives are a small price to pay to advance the dark arcana."],"objectives":["Collect bottles of marmot blood.","Report back to Erasmus at the Thaumaturges' Guild."],"dialogue":[{"name":"ERASMUS","text":"I am Erasmus of the Order of Nald'thal, and I am charged with studying the anatomy of this region's fauna and the environs in which they dwell. For the dark art of our Order is death itself, and power over death can come only through knowledge of life."},{"name":"ERASMUS","text":"One day, I shall publish my findings in a single, comprehensive volume: <span class=\"emphasis\">The Many Breaths of Thanalan</span>. But there is much work to be done before that day."},{"name":"ERASMUS","text":"Aid me, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Bring me five bottles of marmot blood, and perhaps I shall name you in a footnote."},{"name":"ERASMUS","text":"Marmots are hardy creatures that thrive nigh everywhere. You will most certainly find them just outside the city in western Thanalan, by way of the Gate of the Sultana."},{"name":"ERASMUS","text":"Do take care. They can be feisty little critters when threatened."},{"name":"ERASMUS","text":"The blood, have you brought it?"},{"name":"ERASMUS","text":"Yes, yes, this shall serve nicely."},{"name":"ERASMUS","text":"By virtue of your toil, I am one step closer to publishing <span class=\"emphasis\">The Many Breaths of Thanalan</span>. Thank you."},{"name":"ERASMUS","text":"Take this as recompense. Go now, and may the Traders smile upon you."}],"reward":{"items":[{"id":2653,"one":1},{"id":2655,"one":1},{"num":4,"id":5823,"one":1}],"xp":147}},"partials":[{"type":"npc","id":"1003897","obj":{"i":1003897,"n":"Erasmus","l":40,"q":2}},{"type":"item","id":"2653","obj":{"i":2653,"n":"Leather Eyepatch","l":5,"c":40914,"t":34,"p":141}},{"type":"item","id":"2655","obj":{"i":2655,"n":"Hempen Hat","l":5,"c":41015,"t":34,"p":113}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}}]}