{"quest":{"name":"The Second Principle","location":"Ul'dah","id":66114,"patch":2.0,"sort":50,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[4564],"journal":["It appears that Guildmaster Severian has all but forgotten your existence.","Guildmaster Severian has assigned you a task to assist in your understanding of another fundamental alchemical principle. Synthesize three bottles of antidote and deliver them to your eccentric instructor.","You have delivered your synthesized antidote, much to the satisfaction of the obsessive guildmaster. Delve further into the world of alchemy, and learn such joy of discovery that you scarce remember to eat or sleep.<br><br>※The next alchemist quest will be available from Severian upon reaching level 10."],"objectives":["Deliver bottles of antidote to Severian."],"dialogue":[{"name":"SEVERIAN","text":"What!? What is it now!? Gil for the poor? Another cursed love philter? Ah, you're that wretch that insists on dusting my bench, aren't you?"},{"name":"SEVERIAN","text":"No? Then who─ Oh, my new assistant! No, no, do not bother me with more names! My mind shall not be cluttered with trivial details unrelated to alchemical processes!"},{"name":"SEVERIAN","text":"I trust you have busied yourself with the mastery of your discipline? I have scant moments to spare on lessons, but I suppose I must invest a modicum of time in your training if you are to be of any use to me."},{"name":"SEVERIAN","text":"Let us move on to the second fundamental principle of alchemy. Your understanding of this principle will be best facilitated by creating three bottles of antidote."},{"name":"SEVERIAN","text":"For this task, you must needs acquire the stipulated number of grass vipers as well as a chunk of rock salt. I believe the guild often has the poisonous snakes in stock, so you need only purchase them from...that supplier lass. Ah, yes! Esmenet!"},{"name":"SEVERIAN","text":"As for the rock salt...I believe she can supply that, too. And for a reasonable price. I rather suggest seeing her for all your simple ingredient needs, unless you fancy the idea of scrabbling in the sand to find them yourself."},{"name":"SEVERIAN","text":"In any case, I am not terribly concerned with how you procure the materials. What is most important is that you experience this fundamental principle firsthand as you concoct the three bottles of antidote. Return to me with the bliss of new knowledge stamped upon your features."},{"name":"SEVERIAN","text":"Have you completed the three bottles of antidote as I asked? Gods help you if you've interrupted me for anything less."},{"name":"SEVERIAN","text":"Aha! An excellent result, my precarious protégé! I see you have attained the optimum viscosity without clouding the crimson hue."},{"name":"SEVERIAN","text":"It will be most interesting to see how well these mixtures perform on live test subjects. Well, of course they'll be poisoned! How else would I gauge the efficacy of your work?"},{"name":"SEVERIAN","text":"But never mind that. What have you learned of the second alchemical principle? You have produced a helpful compound by combining otherwise mundane or lethally harmful substances! Has this not expanded your awareness of what is attainable with this profession?"},{"name":"SEVERIAN","text":"Just as it is possible for a medicine to act as a poison in sufficient amounts, so it is possible for a poison to be utilized as a cure. Your successful creation of these antidotes is evidence of this very fact."},{"name":"SEVERIAN","text":"Those without a knowledge of alchemy would spare not a second glance for the venomous grass viper. But mix its venom with the appropriate amount of rock salt, and people will flock to your door to purchase your miraculous remedy."},{"name":"SEVERIAN","text":"Study, experiment, and reveal worth in the most unexpected of places! The desire for sustenance and rest will become as minor annoyances once you have learned the joy of such discoveries."},{"name":"SEVERIAN","text":"It is time you added this amateur's mortar to your repertoire of alchemical devices. The mortar is oft referred to as a secondary tool, but used in conjunction with a primary tool such as the alembic, you will soon come to appreciate its value in your work."},{"name":"SEVERIAN","text":"Heh heh heh... I foresee much practical use for your growing skills, my eager apprentice... Now run along and find a use for your new toy. I have further research to conduct!"},{"name":"SYS","text":"Certain gear grants bonuses to your <span class=\"highlight\">craftsmanship</span>, <span class=\"highlight\">control</span>, and <span class=\"highlight\">CP</span> values."},{"name":"SYS","text":"A higher craftsmanship rating hastens the progress of synthesis; greater control increases the chance of creating high-quality items; and additional CP improves your crafting stamina."},{"name":"SYS","text":"Outfitting yourself with an eye to your current objective will increase the efficiency of your crafting endeavors."}],"reward":{"gil":194,"items":[{"num":200,"id":7},{"num":150,"id":6},{"id":2481},{"id":2652,"one":1},{"id":3309,"one":1},{"id":3763,"one":1},{"num":3,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":15}],"quests":[66113]},"next":[66116]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"2481","obj":{"i":2481,"n":"Amateur's Mortar","l":5,"c":35651,"t":25,"p":147}},{"type":"item","id":"2652","obj":{"i":2652,"n":"Hempen Bandana","l":5,"c":41540,"t":34,"p":85}},{"type":"item","id":"3309","obj":{"i":3309,"n":"Hempen Chausses","l":5,"c":45048,"t":36,"p":94}},{"type":"item","id":"3763","obj":{"i":3763,"n":"Maple Pattens","l":5,"c":46122,"t":38,"p":129}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"4564","obj":{"i":4564,"n":"Antidote","l":10,"c":20641,"t":44,"p":39}},{"type":"quest","id":"66113","obj":{"i":66113,"n":"My First Alembic","g":142,"l":"Ul'dah","s":11,"f":1}},{"type":"quest","id":"66116","obj":{"i":66116,"n":"All of Your Beeswax","g":142,"l":"Ul'dah","s":100,"f":1}}]}