{"quest":{"name":"My First Alembic","location":"Ul'dah","id":66113,"patch":2.0,"sort":11,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[5487],"journal":["Guildmaster Severian wants you to use the weathered alembic to perform your first alchemic miracle.","Guildmaster Severian has instructed you to use your alembic to create a bottle of distilled water. The pail of muddy water required for this task can be purchased from the supplier by the guild's entrance. Once you have successfully synthesized a bottle of distilled water, you are to deliver it to the imposing alchemist at his workbench.","You have delivered the distilled water to Guildmaster Severian, thus completing your first task as a novice alchemist. He excitedly bids you continue your training, and revel in the joy of each small alchemical miracle.<br><br>※The next alchemist quest will be available from Severian upon reaching level 5."],"objectives":["Deliver a bottle of distilled water to Severian."],"dialogue":[{"name":"SEVERIAN","text":"Ah, I see you've managed to take hold of the alembic without injuring yourself. An auspicious beginning!"},{"name":"SEVERIAN","text":"Let us see if we can continue this trend of unexpected success. For your first lesson, I want you to use your weathered alembic there and make me a bottle of distilled water."},{"name":"SEVERIAN","text":"Distilled water is simply the end result of purifying a murkier sample of life's most vital element. As such, it provides the perfect introduction to one of alchemy's most fundamental processes: taking a material and refining it into a purer form."},{"name":"SEVERIAN","text":"To perform this rudimentary exercise, you shall require a pail of muddy water and a water shard. The impure water can be purchased from the supplier standing near the entrance to the guild. The name momentarily escapes me... Esmenet? Yes, that was it."},{"name":"SEVERIAN","text":"If it happens that you find this basic task beyond your abilities, then mayhap alchemy is not the discipline for you. Which would be quite upsetting, as I detest the thought of having to select a new...assistant. Try not to disappoint me."},{"name":"SYS","text":"To synthesize a bottle of distilled water for Guildmaster Severian, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>."},{"name":"SEVERIAN","text":"Your task is to provide me with one bottle of distilled water. Come, come, we are wasting time. Purchase a pail of muddy water from Esmenet, if you must."},{"name":"SEVERIAN","text":"Hm hm hm. Heh heh heh. Mwahahahahaha! Magnificent! Your transformation into an alchemist has begun!"},{"name":"SEVERIAN","text":"Do you understand the liquid treasure you have made? Yes, it is still simply water, but now possessed of almost limitless potential! In a properly distilled state, water provides the base ingredient for all manner of wondrous concoctions."},{"name":"SEVERIAN","text":"On the other hand, a potion created with impure water is not only unlikely to have the desired effect─it may very well poison the imbiber!"},{"name":"SEVERIAN","text":"Look well upon the substance you have refined. See how crystal clear it has become. Not the most flavorful of libations, but still refreshing to pour over one's head on a stifling summer afternoon!"},{"name":"SEVERIAN","text":"Tell me, how did you feel in the instant of its purification? Such a fine result must have sent thrills of excited satisfaction down your spine. Yes...I know well that sensation."},{"name":"SEVERIAN","text":"To glean a pristine drop from filthy swill─it is a miracle born of mortal artifice. Nothing can compare to that rush of triumph in the moment when physical laws bend to one's will! Nothing!"},{"name":"SEVERIAN","text":"The greater your mastery of alchemy, the more ecstatic that feeling becomes. Go, fill your chambers with bottles of distilled water and revel in each success!"},{"name":"SEVERIAN","text":"I return now to my experiments. When next you disturb me I shall expect your skills to be worthy of a guildmaster's chosen assistant."},{"name":"SYS","text":"The next alchemist quest will be available from Severian upon reaching level 5."}],"reward":{"items":[{"num":150,"id":7},{"num":100,"id":6},{"num":10,"id":5488},{"id":2961}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":15}],"quests":[66111]},"next":[66114]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"5488","obj":{"i":5488,"n":"Muddy Water","l":10,"c":22637,"t":54,"p":14}},{"type":"item","id":"2961","obj":{"i":2961,"n":"Hempen Kurta","l":1,"c":42233,"t":35}},{"type":"item","id":"5487","obj":{"i":5487,"n":"Distilled Water","l":1,"c":22614,"t":54,"p":3}},{"type":"quest","id":"66111","obj":{"i":66111,"n":"Way of the Alchemist","g":142,"l":"Ul'dah","s":10,"f":1}},{"type":"quest","id":"66114","obj":{"i":66114,"n":"The Second Principle","g":142,"l":"Ul'dah","s":50,"f":1}}]}