{"quest":{"name":"Practical Alchemy","location":"Ul'dah","id":66119,"patch":2.0,"sort":250,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[5522],"journal":["Guildmaster Severian's foul mood hints at another unwanted task awaiting your assistance.","The guildmaster concludes that the duty forced upon him by his colleagues is more suitable for his assistant's continued education. Synthesize a high-quality pinch of natron and deliver it to your manic instructor.","After inspecting your pinch of powdery magnificence, the duly impressed guildmaster launches into an explanation of the practical applications of natron, and alchemy in general. Should you perform one last task for Severian, he promises to permit you to assist him as he seeks to uncover the ultimate secret of alchemy. Until that time comes, you must endeavor to attain ever-loftier heights of skill in your chosen discipline.<br><br>※The next alchemist quest will be available from Severian upon reaching level 30."],"objectives":["Deliver a pinch of natron <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Severian."],"dialogue":[{"name":"SEVERIAN","text":"Argh! You disturb me at a most delicate stage in my experiments! Your timing is─ Hmmm... That is to say, my dear assistant, your timing could not be more fortuitous!"},{"name":"SEVERIAN","text":"For you see, once again, my incorrigible colleagues have foisted upon me a most unstimulating assignment."},{"name":"SEVERIAN","text":"You can imagine my consternation at this continued effrontery! But when I consider the ease with which you performed your prior task and my desire to find a greater challenge to test your alchemical aptitude, the solution to this onerous situation becomes glaringly obvious."},{"name":"SEVERIAN","text":"Thus do I turn over this misappointed duty to a more fitting recipient. Your task this day is to manufacture a pinch of the highest-quality natron."},{"name":"SEVERIAN","text":"You do understand that this order cannot be filled with any average sample, yes? But I feel I must warn you─the quest for greater quality may ensnare you with an entirely new level of obsession!"},{"name":"SYS","text":"The higher the <span class=\"highlight\">quality</span> achieved during synthesis, the greater the chance that the finished item will be of a higher grade (<span class=\"highlight\">HQ</span>)."},{"name":"SYS","text":"To be deleted."},{"name":"SEVERIAN","text":"How fare you in your quest for quality natron? I understand only too well the lure of attaining perfection, but for an alchemist, the timing of results must also be a consideration."},{"name":"SEVERIAN","text":"Let us inspect the fruits of your labor. Yes, the substance is indeed natron, and what a pinch of powdery magnificence it is!"},{"name":"SEVERIAN","text":"With this level of quality, it will perform wonders in any field of application. I would not be surprised to see our client return time and again for more and more. You shall be doomed to create nothing but your wondrous powder for the rest of your living years!"},{"name":"SEVERIAN","text":"Lest you think that a jest, I would have you realize the sheer range of practical use for this material. It is found in the manufacture of glass, the treatment of wool, and even in the mixing bowls of culinarians!"},{"name":"SEVERIAN","text":"Though alchemy is required to produce natron, the substance is of far greater value to many other disciplines."},{"name":"SEVERIAN","text":"In this way, the benefits of alchemical discovery find their way into every facet of civilized life. The era when we alchemists were branded as crazed heretics is now all but a forgotten page in the history books."},{"name":"SEVERIAN","text":"Not that I am overly concerned with such opinions. The current attitude of acceptance merely allows me to continue my research with relative freedom, you understand."},{"name":"SEVERIAN","text":"The manner in which my work might eventually be put to use is of little interest to me compared to the results themselves. I do not seek to contribute to the well-being of society, nor amass a glittering fortune overnight."},{"name":"SEVERIAN","text":"No, my entire being is focused upon one thing, and one thing only. Soon, I will have one last task for you to perform. Once done, I shall permit you to assist me during my ascent to the absolute pinnacle of alchemy!"}],"reward":{"gil":557,"items":[{"id":2485},{"id":2731,"one":1},{"id":3065,"one":1},{"id":3575,"one":1},{"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":15}],"quests":[66118]},"next":[66120]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"2485","obj":{"i":2485,"n":"Initiate's Mortar","l":24,"c":35652,"t":25,"p":1321}},{"type":"item","id":"2731","obj":{"i":2731,"n":"Silver Magnifiers","l":25,"c":40895,"t":34,"p":1314}},{"type":"item","id":"3065","obj":{"i":3065,"n":"Initiate's Gown","l":24,"c":42034,"t":35}},{"type":"item","id":"3575","obj":{"i":3575,"n":"Velveteen Halfgloves","l":24,"c":44027,"t":37,"p":902}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5522","obj":{"i":5522,"n":"Natron","l":13,"c":22616,"t":54}},{"type":"quest","id":"66118","obj":{"i":66118,"n":"The Arcanist's Tome","g":142,"l":"Ul'dah","s":200,"f":1}},{"type":"quest","id":"66120","obj":{"i":66120,"n":"Baleful Brews","g":142,"l":"Ul'dah","s":300,"f":1}}]}