{"quest":{"name":"All of Your Beeswax","location":"Ul'dah","id":66116,"patch":2.0,"sort":100,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[5515],"journal":["It seems some unexpected matter has Guildmaster Severian more agitated than usual.","Severian has placed you square in the path of an incoming guild task meant for his workbench. Synthesize twelve lumps of beeswax and deliver them to the guildmaster.","Able to focus on his personal research undisturbed, Guildmaster Severian seems overjoyed at your competent handling of his “bothersome” task. Continue to improve your skills through the completion of tradecraft leves, and prepare for whatever role the unpredictable alchemist has in store for you.<br><br>※The next alchemist quest will be available from Severian upon reaching level 15."],"objectives":["Deliver lumps of beeswax to Severian."],"dialogue":[{"name":"SEVERIAN","text":"Ah, I remember your face <span class=\"emphasis\">this</span> time, my most helpful assistant! And it is most fortuitous that I do, for the irksome effort I have expended in grooming your budding skills is about to be rewarded!"},{"name":"SEVERIAN","text":"My mewling subordinates have requested that I put aside my personal research “for but a moment or two” and shoulder a portion of the guild's workload, even going so far as to force upon me some other alchemist's petty task."},{"name":"SEVERIAN","text":"What fools to think I am the sort of guildmaster that contributes in such a mundane capacity! If they had wanted an accommodating drudge to head the guild, then they should not have elected me to the post!"},{"name":"SEVERIAN","text":"Gods know there are others about the Phrontistery who would have been better suited to the leadership position. &lt;sigh&gt; It is times such as these that I curse my blood ties to the Syndicate. I would personally be content to eschew such tedious duties in favor of mine own work."},{"name":"SEVERIAN","text":"...Which, of course, brings us to this moment! It is with great relief that I entrust this matter of beeswax to you. Twelve lumps of beeswax, to be precise."},{"name":"SEVERIAN","text":"Haha, yes... I knew you would prove your worth before long. Now, to work, to work!"},{"name":"SEVERIAN","text":"Mwahaha! Such bliss that my research might progress unhindered by bothersome requests! Speaking of which, have you created the beeswax as I asked?"},{"name":"SEVERIAN","text":"Hmmm... These will never be used for the sultana's bedchamber candles, but the quality is passable, I suppose."},{"name":"SEVERIAN","text":"This is indeed a wonderful arrangement! Perhaps I should pass on to <span class=\"emphasis\">you</span> the mantle of guildmaster in its vexatious entirety..."},{"name":"SEVERIAN","text":"Now, the beeswax you have brought me is, as you must surely realize, the purified form of the substance honeybees use to build their hives."},{"name":"SEVERIAN","text":"Candles are the most obvious use for this refined material, but beeswax may also be used to enhance leather goods, or be mixed with dye to create painting supplies."},{"name":"SEVERIAN","text":"It is not the most difficult material to create, though keeping the quality consistent for such a large batch speaks well of your attention to detail."},{"name":"SEVERIAN","text":"I had thought to be content with naught more than a convenient lackey at hand, but mayhap with further training... Hmmm."},{"name":"SEVERIAN","text":"We must somehow supplement your studies, but I am loath to be parted from my workbench. Thankfully, I am aware of the perfect solution to this quandary: tradecraft leves."},{"name":"SEVERIAN","text":"A selection of alchemical odd jobs should be available to you at the Adventurers' Guild. Simply speak with...the fellow at the desk. Eustace, I think it was? In any case, you should be provided with ample opportunity to practice your discipline, and even receive payment while doing so. Remember: your improvement is my utmost concern!"}],"reward":{"gil":289,"items":[{"num":250,"id":7},{"num":200,"id":6},{"id":2468},{"id":2660,"one":1},{"id":3014,"one":1},{"id":3536,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":15}],"quests":[66114]},"next":[66117]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"2468","obj":{"i":2468,"n":"Bronze Alembic","l":8,"c":35601,"t":24,"p":240}},{"type":"item","id":"2660","obj":{"i":2660,"n":"Amateur's Headgear","l":10,"c":40420,"t":34,"p":283}},{"type":"item","id":"3014","obj":{"i":3014,"n":"Amateur's Kurta","l":9,"c":42233,"t":35,"p":246}},{"type":"item","id":"3536","obj":{"i":3536,"n":"Amateur's Smithing Gloves","l":10,"c":44071,"t":37,"p":252}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5515","obj":{"i":5515,"n":"Beeswax","l":10,"c":22608,"t":54,"p":14}},{"type":"quest","id":"66114","obj":{"i":66114,"n":"The Second Principle","g":142,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"66117","obj":{"i":66117,"n":"For Fair Love","g":142,"l":"Ul'dah","s":150,"f":1}}]}