{"quest":{"name":"For Fair Love","location":"Ul'dah","id":66117,"patch":2.0,"sort":150,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"involved":[1003926],"genre":142,"usedItems":[4597,4595],"journal":["Guildmaster Severian appears to be losing the battle against exhaustion.","The sleepy-eyed guildmaster has assigned you another task. Create a potion of intelligence and a potion of dexterity and bring them to Severian.","You have brought the two potions to the guildmaster, as requested. Severian praises your alchemical brilliance, explaining that the concoctions you have created would be beyond the skills of most novice alchemists. At his further behest, you are to take the potions to the Coliseum and deliver them directly to Ardara, the expectant customer.","You have delivered the potions to Ardara. The gladiator fan seems relieved that it was you, and not the guildmaster, who was in charge of concocting her gifts for Franz the Fair. Return to Severian, and inform him that your task is complete.","You rouse the guildmaster from his slumber with your report. What all-consuming alchemical goal drives Severian to work himself to the point of exhaustion? Now mindful to not allow yourself to become too absorbed in your studies, you return to your mastering of alchemy.<br><br>※The next alchemist quest will be available from Severian upon reaching level 20."],"objectives":["Present a potion of intelligence and a potion of dexterity to Severian.","Deliver the potion of intelligence and the potion of dexterity to Ardara.","Return to Guildmaster Severian."],"dialogue":[{"name":"SEVERIAN","text":"&lt;snore&gt; ...then mix the...&lt;grunt&gt;...too volatile... &lt;snort&gt;"},{"name":"SEVERIAN","text":"...Wha─ Oh, it's you. Hm? Have you not yet learned to concoct potions in your sleep? Admittedly, the results are not always what one dreamed they would be."},{"name":"SEVERIAN","text":"Now, might I deduce from your unrequested presence that you deem your skills sufficiently sharpened and seek further instruction? Or do you simply derive some perverted sense of enjoyment from my irritable reaction?"},{"name":"SEVERIAN","text":"Whichever the case may be, alchemy is certainly a discipline for the curious...and the curious of nature."},{"name":"SEVERIAN","text":"Allow me then to assign you another of my dut─another task. This time, I require you to create one potion of intelligence and one potion of dexterity."},{"name":"SEVERIAN","text":"I am at a critical juncture in my research, so I shall dispense with any lengthy explanations. Surely, you need not have me list every eye of newt and fang of bat you need at this point in your education?"},{"name":"SEVERIAN","text":"Are the potions concocted and bottled? I shall field no questions or queries until this is done."},{"name":"SEVERIAN","text":"Hm. Considering the lack of guidance on my part, you have done tolerably well."},{"name":"SEVERIAN","text":"As you have discovered, the main catalyst of a potion of intelligence is the primal essence of life such as that found in the blood of beastkin─coeurls and wolves and the like. The effect is diminished should the blood be allowed to clot, but you seem to have avoided that novice mistake."},{"name":"SEVERIAN","text":"Potions of dexterity, on the other hand, make use of finely ground bat fangs. The practice of using the powdered form of fang, horn, or tusk in the creation of alchemical mixtures is an eastern technique that I am glad to see you have willingly adopted."},{"name":"SEVERIAN","text":"Either of these concoctions is beyond the skill of most neophyte alchemists─it comes as something of a surprise that my sporadic bouts of instruction are proving so effective!"},{"name":"SEVERIAN","text":"In fact, in celebration of your achievement, it is only fitting that you deliver these triumphs to the guild's customer in person. I shall regretfully remain behind, ensconced in my work."},{"name":"SEVERIAN","text":"Your delivery will take you to the Coliseum, where you should seek a lady by the name of...er... What was her name...? Ah, yes! Ardara. And pray return to me once your task is complete."},{"name":"ARDARA","text":"Oooh, are you from the Alchemists' Guild?"},{"name":"ARDARA","text":"I thought my order would never arrive! You do have the potions, don't you?"},{"name":"ARDARA","text":"Are...are these the ones I asked for? I don't know, I just...I thought the vials would be more <span class=\"emphasis\">ornate</span>. Well, I must do something to pretty them up before I present them to Franz the Fair!"},{"name":"ARDARA","text":"I suppose I should be glad it was you in charge of my request, and not the guildmaster."},{"name":"ARDARA","text":"I mean, one hears <span class=\"emphasis\">stories</span> about the head of the Alchemists' Guild. To be honest, I was half expecting the potions to hold some foul liquid, if they held anything at all."},{"name":"ARDARA","text":"They say Severian has powerful connections and more gil than he can count, but all he does is waste away at his workbench performing <span class=\"emphasis\">experiments</span>. What kind of research could possibly be so important that he would spend every moment chained to his alchemical devices?"},{"name":"ARDARA","text":"But listen to me, gossiping away when I have gifts to prepare! I do hope my beloved Franz will be impressed!"},{"name":"ARDARA","text":"Franz has a rather large following. One must go the extra malm to stand out in a crowd of gladiator spectators!"},{"name":"SEVERIAN","text":"&lt;snore&gt;"},{"name":"SEVERIAN","text":"&lt;snort&gt; Eh? Oh, my loyal assistant. Hm? “The task is done”? I'm sure I made not the slightest mention of any task."},{"name":"SEVERIAN","text":"But now that you mention it, I do seem to recall dropping some niggling irritation into your capable hands. And what, then, has transpired?"},{"name":"SEVERIAN","text":"I see. More concerned with the vessel than the contents, was she? Hmph, I don't expect much more from those who are not intimately acquainted with alchemy's true beauty. Of course, I'm finding that I can no longer count you among that rabble."},{"name":"SEVERIAN","text":"Should you continue down this path of mastery, the day might come when you, too, might join me in the...quest for...alchemy's...ultimate... &lt;snore&gt;"},{"name":"SEVERIAN","text":"...Wha─!? Yes? Oh, yes! I almost forgot the matter of payment. Now, we both best be returning to our work."}],"reward":{"gil":382,"items":[{"id":2483},{"id":3019,"one":1},{"id":3779,"one":1},{"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":15}],"quests":[66116]},"next":[66118]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1003926","obj":{"i":1003926,"n":"Ardara","l":41,"q":1}},{"type":"item","id":"2483","obj":{"i":2483,"n":"Recruit's Mortar","l":16,"c":35651,"t":25}},{"type":"item","id":"3019","obj":{"i":3019,"n":"Hempen Doublet Vest of Crafting","l":12,"c":42116,"t":35,"p":436}},{"type":"item","id":"3779","obj":{"i":3779,"n":"Ash Pattens","l":15,"c":46123,"t":38,"p":432}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4597","obj":{"i":4597,"n":"Potion of Intelligence","l":20,"c":20668,"t":44,"p":108}},{"type":"item","id":"4595","obj":{"i":4595,"n":"Potion of Dexterity","l":20,"c":20667,"t":44,"p":108}},{"type":"quest","id":"66116","obj":{"i":66116,"n":"All of Your Beeswax","g":142,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"66118","obj":{"i":66118,"n":"The Arcanist's Tome","g":142,"l":"Ul'dah","s":200,"f":1}}]}