{"quest":{"name":"Dressed to Deceive","location":"Eastern Thanalan","id":66110,"patch":2.0,"sort":103,"icon":100099,"eventIcon":71201,"issuer":1003929,"target":1005116,"involved":[1003947,1004324,1004325,1004327,1004330,1004506,1004556],"genre":1,"usedItems":[2995,3306],"journal":["Isembard wants to help you identify and apprehend the false priest.","Thancred suggests that the two of you pose as impoverished souls in order to ensnare the false priest. By way of laying the foundation for this plan, you must first make it known that vagrants have newly arrived at Camp Drybone. Don a weathered shepherd's tunic and a pair of weathered shepherd's slops, and beg the residents of the camp for work.","You have made a sufficient nuisance of yourself to draw the attention of the false priest. Report back to Thancred.","It would seem that the poor have established a commune by a pond north of Sandgate, to the east of Camp Drybone. Owing to its isolation, Thancred believes it an ideal place for kidnappers to do their work. Don your disguise once more, and rendezvous with Thancred at said pond.","The false priest turns out to be none other than Ungust, the obnoxious merchant whom you first found preying upon a refugee woman in Ul'dah. The man reveals that he has been abducting people at the behest of the Amalj'aa. Take this knowledge back to Minfilia, who awaits at the Waking Sands in Vesper Bay.","Praising your investigative work, Minfilia tells you that an encounter with the Amalj'aa is inevitable. Be prepared to answer the call to arms when the time comes."],"objectives":["Speak with the locals while garbed in a weathered shepherd's tunic and a pair of weathered shepherd's slops.","Speak with Thancred.","Speak with Thancred while garbed in a weathered shepherd's tunic and a pair of weathered shepherd's slops.","Speak with Minfilia at the Waking Sands."],"dialogue":[{"name":"ISEMBARD","text":"I'm afraid I have not seen any unusual activity. Nor have any at this camp given me cause to doubt them. But unless we can identify the culprit, and soon, more innocents will fall victim..."},{"name":"THANCRED","text":"Do not despair just yet, my friend. An idea occurs to me."},{"name":"THANCRED","text":"Our suspect has been posing as a priest, using leaflets bearing false promises to lure the poor. Let <span class=\"highlight\">Forename</span> and me serve like with like by posing as impoverished souls in need of succor."},{"name":"ISEMBARD","text":"Ah, I dare to hope that this will yield us the answers we seek. It will be a dangerous undertaking, but you two are more than capable of looking after yourselves."},{"name":"ISEMBARD","text":"I'm next to useless in a battle, but I <span class=\"emphasis\">can</span> supply the garments for the disguise. These old tunics and slops should serve your needs, so long as you don't mind the smell and the stains."},{"name":"THANCRED","text":"These will serve very well. You have my thanks."},{"name":"THANCRED","text":"Listen, <span class=\"highlight\">Forename</span>. So as to lay the foundation for our little ploy, we must make it widely known that more vagrants have arrived at camp and are desperate for coin."},{"name":"THANCRED","text":"To this end, I want you to don the old garments Isembard has lent us, and beg for work around the camp. Before long, the false priest should catch wind and approach us."},{"name":"THANCRED","text":"I want you to don the old garments Isembard has lent us, and beg for work around the camp. Before long, the false priest should catch wind and approach us."},{"name":"THANCRED","text":"In case you misplace the tunic and the slops, you'll need to ask Isembard for another set."},{"name":"KNERL","text":"Hm? And you are...?"},{"name":"KNERL","text":"Hmph, another refugee, by the looks of you. The Immortal Flames have neither work nor coin for your like. Begone, and see to it you don't make a nuisance of yourself."},{"name":"KNERL","text":"Ah, an adventurer. You are welcome at Camp Drybone, friend. I hope we can rely on your aid to preserve the peace in the area."},{"name":"SWAENHYLT","text":"I preach the teachings of Azeyma, the Warden. Hast thou come to partake of the honey of Her wisdom?"},{"name":"SWAENHYLT","text":"Azeyma is keeper of the sun and goddess of inquiry. All is laid bare beneath the light of Her divine countenance. Open thy heart to this light, needy child, and thou shalt want for naught till the end of days!"},{"name":"SWAENHYLT","text":"Azeyma is keeper of the sun and goddess of inquiry. All is laid bare beneath the light of Her divine countenance. Open thy heart to this light, adventurer, and thou shalt know true fulfillment!"},{"name":"AURILDIS","text":"What is it?"},{"name":"AURILDIS","text":"Gods, not again... Look, being poor doesn't give you the right to pester whomsoever you like. Why don't you keep with your own kind out by that muddy pond of yours at Drybone?"},{"name":"AURILDIS","text":"If you don't mind, I'm rather busy at the moment. Go and find someone else to pester."},{"name":"ERMEGARDE","text":"Greetings, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Is there aught I might assist you with?"},{"name":"ERMEGARDE","text":"...Oh. I...don't believe there is. I'm afraid our wares are <span class=\"emphasis\">very</span> expensive. Mayhap you should rejoin your fellows out at the pond north of Sandgate."},{"name":"ERMEGARDE","text":"We stock only the finest wares. If you wish to make a purchase, our attendant at the counter will be glad to serve you."},{"name":"ADELSTAN","text":"&lt;sigh&gt; And I was about to get to the good part..."},{"name":"ADELSTAN","text":"Looking for work, you say? Sorry, but we don't have any openings. Now, get out of here so I can finish my story."},{"name":"ADELSTAN","text":"You've got a hunger, adventurer? Then you've come to the right place. You won't find better hot meals for malms around."},{"name":"THANCRED","text":"You have quite a knack for being a nuisance, <span class=\"highlight\">Forename</span>. The camp is abuzz with talk of newly arrived vagrants."},{"name":"THANCRED","text":"And though we were unable to attract our wayward transgressor, we <span class=\"emphasis\">were</span> able to learn that the poor have a commune by the pond north of Sandgate, to the east of here. The eyes of the authorities do not reach that place─rather ideal for spiriting away hapless souls."},{"name":"THANCRED","text":"Let us go there and wait for the kindly priest to come and offer us aid and comfort. Needless to say you'll need to remain in disguise."},{"name":"THANCRED","text":"A fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> for catching false priests, wouldn't you say?"},{"name":"THANCRED","text":"Hm? Why aren't you wearing the lovely soiled garments Isembard gave you? Dressed as you are, our quarry will sense that something is amiss before he's within nabbing distance."},{"name":"THANCRED","text":"In case you've accidentally disposed of the tunic and slops, you'll need to ask Isembard for another set."},{"name":"THANCRED","text":"You look absolutely smashing, <span class=\"highlight\">Forename</span>─positively dressed for deception. All that's left, then, is to wait for our quarry to appear."},{"name":"UNGUST","text":"(-???-)Oh, you poor, unfortunate souls. This is no way for men to live. No way at all."},{"name":"THANCRED","text":"Who are you? What do you want?"},{"name":"UNGUST","text":"(-???-)Be at ease, child, for I mean you no harm. I am a priest of the Order of Nald'thal, and I come to offer you succor."},{"name":"UNGUST","text":"(-???-)This leaflet bears the teachings of Nald. Trust to them, and they will surely set you free from the shackles of penury!"},{"name":"THANCRED","text":"Hmmm... A tempting offer, but I'm afraid I must decline..."},{"name":"THANCRED","text":"...On account of that <span class=\"emphasis\">atrocious</span> performance. You would have made a gods–awful mummer, <span class=\"emphasis\">Ungust</span>."},{"name":"UNGUST","text":"Wh-What!? How did you know─!? Y-You bastards tricked me!"},{"name":"UNGUST","text":"P-Please don't hurt me! I was only doing it to protect my people!"},{"name":"THANCRED","text":"Is that so? Do continue."},{"name":"UNGUST","text":"V-Very well...<br>I'm a man of the Golden Bazaar. Raised there, if not born."},{"name":"UNGUST","text":"Some moons ago, the Amalj'aa raids began. They would appear sudden as a sandstorm, and plunder and pillage at will. Our defenders couldn't stand against them, few as they were. Everyone lived in fear."},{"name":"UNGUST","text":"I wanted to save my people, but being a merchant was all I knew. And so I did the only thing a merchant could─I approached the Amalj'aa in hopes of brokering a deal."},{"name":"UNGUST","text":"In return for sparing the Golden Bazaar, they made demands─outrageous ones."},{"name":"THANCRED","text":"Demands? Of what kind, pray tell?"},{"name":"UNGUST","text":"First of all, they wanted the schedule for crystal shipments from the Nanawa Mines. For this, I bribed one of the workers to leak me the information."},{"name":"UNGUST","text":"Next, they wanted me to bring them people. So, I posed as a priest to lure in the vulnerable and give them over to the Amalj'aa. I...I didn't have a choice..."},{"name":"THANCRED","text":"Protecting one's home is a noble thing...but at the cost of innocents? You could have sought the aid of the Immortal Flames, yet you did not. I suspect you are not telling me the full story. What made you sell out your own people? Speak!"},{"name":"UNGUST","text":"The...&lt;mumble&gt;...was good..."},{"name":"THANCRED","text":"What did you say?"},{"name":"UNGUST","text":"The <span class=\"emphasis\">coin</span> was good, I said! I could sell mole meat for a score of lifetimes and not see even a fraction of what the Amalj'aa pay me!"},{"name":"THANCRED","text":"You sacrificed innocents so that you could line your own pockets? Words fail to express the contempt I feel for you."},{"name":"UNGUST","text":"Spare me your contempt! If you want to blame someone for the mess the world's in, then blame yourselves or the gods!"},{"name":"UNGUST","text":"Uwaaah! Not <span class=\"emphasis\">you</span> again!"},{"name":"THANCRED","text":"Were you the one leaking the Immortal Flames' patrol routes to the enemy as well? Spit it out!"},{"name":"UNGUST","text":"Nooo! I know nothing about that! I swear it!"},{"name":"THANCRED","text":"At this stage, I'm rather disinclined to believe aught that leaves your mouth. But no matter. There'll be time enough to learn the truth."},{"name":"UNGUST","text":"&lt;sob&gt;"},{"name":"THANCRED","text":"<span class=\"highlight\">Forename</span>. Be a <span class=\"alternative-container\"><span class=\"alternative\">dear</span><span class=\"alternative\">good man</span></span> and take word of these developments to Minfilia, would you?"},{"name":"THANCRED","text":"I shall prise everything I can out of this filth."},{"name":"THANCRED","text":"The abductees are still somewhere out there. Our foremost priority is to rescue them."},{"name":"MINFILLIA","text":"Welcome back, <span class=\"highlight\">Forename</span>. I am pleased that you and Thancred have been getting along."},{"name":"MINFILLIA","text":"I see... You have done well to uncover the truth. My thanks for the report."},{"name":"MINFILLIA","text":"As Thancred said, we must ascertain where the abducted were taken...and none but the Amalj'aa know the answer."},{"name":"MINFILLIA","text":"Suffice it to say they will not willingly part with this information. I fear blood will be spilled before all is said and done."},{"name":"ISEMBARD","text":"Misplaced your disguise, you say? I will give you loan of another set, but do take better care of it."}],"reward":{"gil":453,"xp":7840},"reqs":{"jobs":[{"lvl":19,"id":130}],"quests":[66158]},"next":[65808,66233]},"partials":[{"type":"npc","id":"1003929","obj":{"i":1003929,"n":"Isembard","l":44,"q":8}},{"type":"npc","id":"1005116","obj":{"i":1005116,"n":"Minfilia","l":356,"q":4}},{"type":"npc","id":"1003947","obj":{"i":1003947,"n":"Knerl","l":44,"q":1,"t":"Flame Captain"}},{"type":"npc","id":"1004324","obj":{"i":1004324,"n":"Thancred","l":44,"q":1}},{"type":"npc","id":"1004325","obj":{"i":1004325,"n":"Swaenhylt","l":44,"q":1}},{"type":"npc","id":"1004327","obj":{"i":1004327,"n":"Aurildis","l":44,"q":1}},{"type":"npc","id":"1004330","obj":{"i":1004330,"n":"Thancred","l":44,"q":1}},{"type":"npc","id":"1004506","obj":{"i":1004506,"n":"Ermegarde","l":44,"q":3}},{"type":"npc","id":"1004556","obj":{"i":1004556,"n":"Adelstan","l":44,"q":2}},{"type":"item","id":"2995","obj":{"i":2995,"n":"Weathered Shepherd's Tunic","l":1,"c":42178,"t":35}},{"type":"item","id":"3306","obj":{"i":3306,"n":"Weathered Shepherd's Slops","l":1,"c":45144,"t":36}},{"type":"quest","id":"66158","obj":{"i":66158,"n":"Amalj'aa Wrong Places","g":1,"l":"Eastern Thanalan","s":102}},{"type":"quest","id":"65808","obj":{"i":65808,"n":"Life, Materia and Everything","g":1,"l":"The Waking Sands","s":104}},{"type":"quest","id":"66233","obj":{"i":66233,"n":"Hallo Halatali","g":93,"l":"Western Thanalan","s":200,"f":1}}]}