{"quest":{"name":"The Arcanist's Tome","location":"Ul'dah","id":66118,"patch":2.0,"sort":200,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[2149],"journal":["Guildmaster Severian wishes to test your growing proficiency with a new task.","You have been entrusted with the request of an arcanist, a man of whose name you are likely to remain ignorant should you be forced to rely on Guildmaster Severian's selective memory. Construct the materia-enhanced engraved hard leather grimoire and deliver it to your forgetful tutor. Yew logs, one of the materials required in the creation of the tome, must either be obtained through gathering, or purchased from the market boards of the Sapphire Avenue Exchange. And should you wish for a more patient explanation on materia, Severian suggests that you would be better served traveling to the Bonfire in central Thanalan and visiting the camp of the goblin Mutamix.","You have delivered an engraved hard leather grimoire to Severian. Despite being left little choice but to visit the guild in person to collect his order, the arcanist seems overjoyed with the grimoire's quality. Bask in the warm glow of the client's praise as you nevertheless remain focused on upholding your new reputation as a “master alchemist.”<br><br>※The next alchemist quest will be available from Severian upon reaching level 25."],"objectives":["Deliver a materia-enhanced engraved hard leather grimoire to Severian."],"dialogue":[{"name":"SEVERIAN","text":"Heh heh heh... Ah, my able assistant, I recognize that look of intense hunger─you wade waist-deep in the mire of alchemy!"},{"name":"SEVERIAN","text":"Well it is that you display such desire, for I stand ready with a task that will further test and expand your proficiency."},{"name":"SEVERIAN","text":"I have a request from an arcanist by the name of...uh... Well, I have a request from a certain arcanist. He requires an alchemist to construct for him an engraved hard leather grimoire."},{"name":"SEVERIAN","text":"But as is so often the case, the matter is not as simple as it first appears. Yew logs, one of the materials used in the creation of the tome, will not be found in any local Ul'dahn stall."},{"name":"SEVERIAN","text":"Thus it falls to you to─ugh─take up botany and gather the material yourself, or─almost as bothersome─scour the market boards of the Sapphire Avenue Exchange."},{"name":"SEVERIAN","text":"And as if this endeavor were not already sufficiently laborious, the client also requests that the tome be enhanced with materia."},{"name":"SEVERIAN","text":"Must I explain materia to you? &lt;sigh&gt; Very well. Materia is the crystallized essence of a well-used piece of gear─the physical manifestation of an item's history with its wielder, if you will. It is not well understood exactly how these crystals work, but they have the effect of improving the properties of the objects to which they are attached."},{"name":"SEVERIAN","text":"Do not expect me to provide a lecture on the intricacies of crafting materia! There is a goblin at the Bonfire in central Thanalan who is more than willing to babble on about such things. Mixa...mute? Hm. Muta...mix? Yes! That was his name. Mutamix."},{"name":"SEVERIAN","text":"As for the type of materia, the arcanist was specific in his lack of specificity. You are free to experiment with whichever kind you wish! Glorious!"},{"name":"SEVERIAN","text":"Bring the materia-enhanced tome to me once it is complete. Meanwhile, I shall be sifting through my memory for the name of our expectant client..."},{"name":"SEVERIAN","text":"I have every confidence in your aptitude for these time-consuming errands! You do recall your task, yes? I shall be needing that leather-bound tome─with materia attached─if I am to strike this undesirable duty from my list of distractions."},{"name":"SEVERIAN","text":"Ah, and not a moment too soon. You may see for yourself the arcanist's reaction to your undoubtedly fine work─I sent word that he should visit the guild forthwith, thus avoiding the tiresome business of delivery."},{"name":"CLIENT","text":"Great Thaliak, is this masterful creation to be my grimoire!? And look! It is bound with materia, just as I asked!"},{"name":"SEVERIAN","text":"Would you expect aught less from the assistant to the guildmaster himself? Now, arcanist, before you depart, perhaps you might favor the creator of your new tome with an explanation of its nature."},{"name":"CLIENT","text":"Eh? The nature of my grimoire? I...well, yes, of course."},{"name":"CLIENT","text":"For an arcanist to weave his spells, he must conjure in his mind the image of distinct mystical diagrams known as arcane geometries. These geometries are inscribed upon the pages of a grimoire, such as the one you constructed at my request."},{"name":"CLIENT","text":"The most important aspect of any grimoire is the quality of the ink used to illustrate its pages. Geometries drawn with ink that is especially conducive to the flow of aether allow the arcanist to more effectively channel his magical strength."},{"name":"CLIENT","text":"Thus when one is in need of a new grimoire, one must turn to an expert in the making of this liquid gold─an alchemist. And, Thaliak be praised, I was blessed with the attentions of a true artist."},{"name":"CLIENT","text":"Should I ever wish to add to or enhance my tome, I know exactly to whom I will turn. Thank you, Master Alchemist."},{"name":"SEVERIAN","text":"Master Alchemist now, is it? I suppose you must appear so to the uninitiated."},{"name":"SEVERIAN","text":"Faulty perspective though it may be, it is cause for exaltation! You should cast aside modesty and bask in the glow of your accomplishment─but do not let your ambition wither in the shadow of satisfaction! Unless, of course, you wish to remain an assistant forever."}],"reward":{"gil":470,"items":[{"id":2471},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":15}],"quests":[66117]},"next":[66119]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"2471","obj":{"i":2471,"n":"Initiate's Alembic","l":19,"c":35602,"t":24,"p":715}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"2149","obj":{"i":2149,"n":"Engraved Hard Leather Grimoire","l":20,"c":33405,"t":10,"p":1098}},{"type":"quest","id":"66117","obj":{"i":66117,"n":"For Fair Love","g":142,"l":"Ul'dah","s":150,"f":1}},{"type":"quest","id":"66119","obj":{"i":66119,"n":"Practical Alchemy","g":142,"l":"Ul'dah","s":250,"f":1}}]}