{"quest":{"name":"That Velveteen Dress","location":"Ul'dah","id":66128,"patch":2.0,"sort":250,"icon":100063,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1003821,1003823,1003913],"genre":141,"usedItems":[5326],"journal":["Redolent Rose has need of your assistance yet again.","A sudden deluge of orders has the Weavers' Guild working at full stretch, and Redolent Rose cannot spare the time to attend a consultation with one of his clients. Go in the guildmaster's stead to the Gold Court and speak with Babawai and his daughter Kokomo.","Your meeting does not prove as enlightening as you had hoped due to the complete disinterest of your young client. Return to the Weavers' Guild and tell Redolent Rose what you have learned.","After a moment's consideration, Redolent Rose decides to craft a velveteen dress. Conscious of Babawai's reputation for exacting standards, he concludes that only the finest fabric will suffice. Weave a bolt of high-quality velveteen and deliver it to the guildmaster.","The guildmaster praises your velveteen, and assures you that it will make a most magnificent dress─albeit one which he suspects Kokomo has no intention of wearing.<br><br>※The next weaver quest will be available from Redolent Rose upon reaching level 30."],"objectives":["Speak with Kokomo.","Speak with Babawai.","Speak with Redolent Rose.","Deliver a bolt of undyed velveteen <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"This is indeed an unfortunate development..."},{"name":"REDOLENTROSE","text":"Oh, <span class=\"highlight\">Forename</span>! Thank Nymeia you're here. I need your help."},{"name":"REDOLENTROSE","text":"The entire guild is presently engaged in dealing with a sudden deluge of orders. Amongst them was a commission for a bespoke dress, all aspects of which I had intended to handle personally. Alas, I have just this moment received yet another request─this time from Her Grace─which must, naturally, take precedence."},{"name":"REDOLENTROSE","text":"Since you have some experience engaging with customers, I would send you to speak with the client, Babawai, in my stead. We had arranged to meet at the Gold Court later this─ Ah, where has the time gone? Ahem. We had arranged to meet <span class=\"emphasis\">now</span>."},{"name":"REDOLENTROSE","text":"Babawai will be bringing his daughter Kokomo, for whom the dress is intended. Be sure to speak to her as well."},{"name":"KOKOMO","text":"You're from the Weavers' Guild? I'm terribly sorry you had to come all this way."},{"name":"KOKOMO","text":"Truth to tell, I don't really want another dress. But Father insisted, and when Father insists... &lt;sigh&gt; I just want this over and done with, so please, ask my father what he prefers, and I shall defer to his wishes."},{"name":"BABAWAI","text":"And who might you be? I was under the impression I would be meeting with the guildmaster. Well, it is of little matter, I suppose─provided the famous Redolent Rose still intends to design my daughter's dress."},{"name":"BABAWAI","text":"As for what manner of dress... Simply put, I'll not have my Kokomo garbed in common cotton. A jeweler's daughter must be refined─<span class=\"emphasis\">resplendent</span>. A ruby amongst the riffraff."},{"name":"BABAWAI","text":"Her mere presence should reassure my customers as to the quality of my─ Ahem. I believe I have made myself clear. Pray relay my requirements to your guildmaster."},{"name":"WAWARUKKA","text":"&lt;sigh&gt;"},{"name":"REDOLENTROSE","text":"Ah, you're back. So then, what manner of dress does our client desire?<br>...Something “resplendent,” which isn't made of cotton, you say? &lt;sigh&gt; I might have known. His commissions rarely stipulate anything beyond “ostentatiously expensive.”"},{"name":"REDOLENTROSE","text":"And all for a poor girl who would rather the eyes of the world look the other way."},{"name":"REDOLENTROSE","text":"Well, vanya silk would achieve the desired effect, though I doubt she would feel comfortable wearing such an extravagant dress. Velveteen, though...yes, velveteen might work."},{"name":"REDOLENTROSE","text":"A fine weave of cotton yarn and diremite silk with a short, soft pile─beautiful yet subdued, like our modest maiden."},{"name":"REDOLENTROSE","text":"It will be painstaking to prepare, but so be it."},{"name":"REDOLENTROSE","text":"I shall see to the patterns. The velveteen, I leave in your capable hands."},{"name":"REDOLENTROSE","text":"Know, though, that Babawai will not be satisfied with any ordinary fabric."},{"name":"REDOLENTROSE","text":"Only the very best will suffice. In short, I require a bolt of the finest velveteen you can weave."},{"name":"REDOLENTROSE","text":"Oh, have you woven the velveteen already?"},{"name":"REDOLENTROSE","text":"...It's been far too long since I last worked with quality velveteen."},{"name":"REDOLENTROSE","text":"You've truly outdone yourself, <span class=\"highlight\">Forename</span>."},{"name":"REDOLENTROSE","text":"Babawai's daughter shall have a most magnificent dress."},{"name":"REDOLENTROSE","text":"A pity she is no more like to wear it than her father..."},{"name":"REDOLENTROSE","text":"Though nothing would please me more than to be proven wrong."},{"name":"REDOLENTROSE","text":"But I rather suspect another dress is the last thing that girl needs."},{"name":"KOKOMO","text":"Father knows best. And the guildmaster always produces such wonderful designs. No doubt I will be delighted as always."},{"name":"BABAWAI","text":"Kokomo is my treasure. I would have the world see her for the shining jewel that she is."}],"reward":{"gil":557,"items":[{"id":2460},{"id":2731,"one":1},{"id":3065,"one":1},{"id":3575,"one":1},{"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":14}],"quests":[66127]},"next":[66129]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003821","obj":{"i":1003821,"n":"Kokomo","l":41,"q":1}},{"type":"npc","id":"1003823","obj":{"i":1003823,"n":"Babawai","l":41,"q":1}},{"type":"npc","id":"1003913","obj":{"i":1003913,"n":"Wawarukka","l":41,"q":1}},{"type":"item","id":"2460","obj":{"i":2460,"n":"Elm Spinning Wheel","l":23,"c":35553,"t":23,"p":1239}},{"type":"item","id":"2731","obj":{"i":2731,"n":"Silver Magnifiers","l":25,"c":40895,"t":34,"p":1314}},{"type":"item","id":"3065","obj":{"i":3065,"n":"Initiate's Gown","l":24,"c":42034,"t":35}},{"type":"item","id":"3575","obj":{"i":3575,"n":"Velveteen Halfgloves","l":24,"c":44027,"t":37,"p":902}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5326","obj":{"i":5326,"n":"Undyed Velveteen","l":24,"c":21604,"t":51,"p":169}},{"type":"quest","id":"66127","obj":{"i":66127,"n":"Materia Concerns","g":141,"l":"Ul'dah","s":200,"f":1}},{"type":"quest","id":"66129","obj":{"i":66129,"n":"Miner on a Mission","g":141,"l":"Ul'dah","s":300,"f":1}}]}