{"quest":{"name":"Materia Concerns","location":"Ul'dah","id":66127,"patch":2.0,"sort":200,"icon":100063,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1003820,1003825],"genre":141,"usedItems":[3039],"journal":["Redolent Rose has a momentous task in mind for you.","The guildmaster believes you are finally ready to undertake your first Sunsilk commission. Your client awaits you outside Sunsilk Tapestries on the Steps of Nald.","Your client, a wealthy Lalafell named Mamajaru, bids you make a materia-enhanced cotton acton that will not hinder his training in the gladiatorial arts. However, he neglects to specify the type of materia he needs. Consult with the guildmaster to determine the best course of action.","The guildmaster expresses doubt as to Mamajaru's ability to distinguish between different types of materia, and suggests you use whichever kind comes readily to hand. He adds that if you wish to learn more about materia, you should seek the counsel of a scholar who dwells in a camp near the Bonfire in central Thanalan. Prepare the materia-enhanced cotton acton and deliver it to Redolent Rose.","In what apparently passes for a show of approval, Mamajaru takes your acton and departs with nary a word of thanks. Redolent Rose, however, is happy to praise your work, adding that it is a weaver's task to make the world see the client as the client wishes to be seen─even if that wish has no basis in reality.<br><br>※The next weaver quest will be available from Redolent Rose upon reaching level 25."],"objectives":["Speak with Mamajaru on the Steps of Nald.","Speak with Redolent Rose.","Deliver a materia-enhanced cotton acton to Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"Your time has come, <span class=\"highlight\">Forename</span>. Today you will work on behalf of Sunsilk Tapestries."},{"name":"REDOLENTROSE","text":"Your client is heir to a vast fortune─a <span class=\"emphasis\">rare</span> sort of individual in this city, I know."},{"name":"REDOLENTROSE","text":"Like many men of means, ever does he seek new epicurean delights. I can only imagine what he desires this time."},{"name":"REDOLENTROSE","text":"I thought it best for you to go and meet with the man yourself, so I've taken the liberty of scheduling an appointment for you at the Sunsilk Tapestries shop on the Steps of Nald. As I'm sure you're aware, that's on the other side of the city─and men like Mamajaru are not fond of waiting. In short: <span class=\"emphasis\">hurry</span>."},{"name":"MAMAJARU","text":"No, I can <span class=\"emphasis\">not</span> spare a gil, you disgusting parasite! Really, if your kind put <span class=\"emphasis\">half</span> as much effort into finding a job as sponging off upstanding─"},{"name":"MAMAJARU","text":"...Oh, the weaver. Ahem. 'Twas a reflex. I have had to fend off far too many beggars this day."},{"name":"MAMAJARU","text":"I should warn you that I have very specific requirements which must needs be fulfilled to the letter. I but recently discovered that I possess a prodigious talent for the gladiatorial arts, and am reliably informed that only the most expertly crafted equipment will allow me to realize my full potential."},{"name":"MAMAJARU","text":"I want a cotton acton─but not just any! It must be enhanced with materia. The ordinary kind is fit to be worn only by peasants."},{"name":"MAMAJARU","text":"Understood? Good."},{"name":"MAMAJARU","text":"Now then, I believe you have a job to do."},{"name":"REDOLENTROSE","text":"Back so soon? Tell me, what would our esteemed client have you make for him?<br>...I see. When did materia-enhanced garments become essential for gladiators, I wonder... Mayhap the talents of the exceedingly wealthy differ from those of the rest of us. Yes, that must be the way of it."},{"name":"REDOLENTROSE","text":"And you say he didn't even bother to specify what <span class=\"emphasis\">type</span> of materia he'd prefer?"},{"name":"REDOLENTROSE","text":"Feel free to use any kind─I highly doubt he will be able to tell the difference. Ah, but a question occurs to me: are <span class=\"emphasis\">you</span> familiar with materia?"},{"name":"REDOLENTROSE","text":"If not, consider paying a visit to the Bonfire in central Thanalan. A goblin scholar resides there who is well versed in the ways of materia. I, meanwhile, am but a simple weaver and wholly <span class=\"emphasis\">unversed</span> in the ways of materia, so you can expect no such wisdom from me."},{"name":"REDOLENTROSE","text":"Oh, and in case it wasn't obvious, I'm afraid we shan't be able to provide you with all of the necessary materials."},{"name":"REDOLENTROSE","text":"I suggest you search the markets. Or you could travel all the way to Vylbrand, I suppose. There's no shortage of dodos there..."},{"name":"REDOLENTROSE","text":"I leave the matter in your capable hands, <span class=\"highlight\">Forename</span>."},{"name":"MAMAJARU","text":"I've come for my acton, weaver, and I do not care to be kept waiting."},{"name":"REDOLENTROSE","text":"Pray do not keep your honored client waiting any longer than necessary─for both our sakes."},{"name":"REDOLENTROSE","text":"Sir, your acton is ready. If you would..."},{"name":"MAMAJARU","text":"Well...it appears to be satisfactory. I only hope it will survive my rigorous training regimen."},{"name":"MAMAJARU","text":"I shall have one of my manservants deliver the payment on the morrow."},{"name":"REDOLENTROSE","text":"...In lieu of your customer's gratitude, allow me to express mine. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"REDOLENTROSE","text":"I don't doubt that this has been an unenjoyable experience for you. But remember: while we are under no obligation to respect such clients, we must always be seen to respect their wishes."},{"name":"REDOLENTROSE","text":"As I suspect you have begun to realize, appearances are akin to reality in this city. It is for this reason that our work is in such great demand. It is, after all, the weaver's task to make the world see the client as the client wishes to be seen."},{"name":"REDOLENTROSE","text":"With that in mind, I must congratulate you on a job well done. When I watched that little turd saunter out of here, I almost mistook him for a gladiator."}],"reward":{"gil":470,"items":[{"id":2446},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":14}],"quests":[66126]},"next":[66128]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003820","obj":{"i":1003820,"n":"Mamajaru","l":40,"q":1}},{"type":"npc","id":"1003825","obj":{"i":1003825,"n":"Mamajaru","l":41,"q":1}},{"type":"item","id":"2446","obj":{"i":2446,"n":"Brass Needle","l":20,"c":35506,"t":22,"p":594}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"3039","obj":{"i":3039,"n":"Cotton Acton","l":18,"c":43014,"t":35,"p":752}},{"type":"quest","id":"66126","obj":{"i":66126,"n":"Practical Needs","g":141,"l":"Ul'dah","s":150,"f":1}},{"type":"quest","id":"66128","obj":{"i":66128,"n":"That Velveteen Dress","g":141,"l":"Ul'dah","s":250,"f":1}}]}