{"quest":{"name":"Baleful Brews","location":"Ul'dah","id":66120,"patch":2.0,"sort":300,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"involved":[1003927],"genre":142,"usedItems":[4575],"journal":["Guildmaster Severian wishes to once more gauge the progress of your alchemical mastery.","Your task from the guildmaster requires you to concoct a harmful agent. Synthesize three high-quality flasks of weak blinding potion and deliver them to your distracted superior.","Guildmaster Severian praises the potential for chaos present in the baleful brews you have created. Your task now requires you to deliver the blinding potions to the client─a Miqo'te lass affiliated with one of Ul'dah's less savory groups. You will find her awaiting your arrival somewhere in Pearl Lane.","After accepting the flasks, the Miqo'te reveals herself to be a Sultansworn by the name of W'bulea. She had previously infiltrated the gang known as the Velvet Hands after learning of their scheme to rob the palace. Disappointed with Severian's eagerness to accommodate the gang's plans, she asks you to convey a message back to the guildmaster.","You deliver W'bulea's message to Severian, but the guildmaster flatly refuses to consider her demand for the return of her sister, W'nahja. Further contradicting the Sultansworn's wishes, the determined Severian bids you prepare for your role as his assistant as the culmination of his great and mysterious alchemical endeavor draws near.<br><br>※The next alchemist quest will be available from Severian upon reaching level 35."],"objectives":["Present flasks of weak blinding potion <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Severian.","Deliver the flasks of weak blinding potion <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the client.","Speak with Guildmaster Severian."],"dialogue":[{"name":"SEVERIAN","text":"Aha! I see you have further immersed yourself in the bog of alchemical pursuit! The time is ripe to once more gauge the degree of mastery you have thus far attained!"},{"name":"SEVERIAN","text":"And as if by divine providence, a task suited to just such a purpose has but recently landed on my workbench. The client requests the creation of three high-quality flasks of weak blinding potion─a sublime toxin indeed."},{"name":"SEVERIAN","text":"Do not flinch from the mention of poison. If one means to learn the art of preserving life, one must also become intimate with death and destruction! Yes, with but a single spoonful of a chosen concoction, alchemy can restore health or cause grievous harm."},{"name":"SEVERIAN","text":"Mwahahaha! This is the perfect initiation into the deeper secrets of our discipline. Do not tarry a moment longer! To work!"},{"name":"SEVERIAN","text":"Take care that the blinding potions you concoct are especially efficacious. Ah, the creation of such exquisitely dangerous substances is a reward in itself!"},{"name":"SEVERIAN","text":"Gently, now, gently... Yes, one could almost grasp the strands of inky darkness swirling within these baleful brews."},{"name":"SEVERIAN","text":"Though it may appear lethal, this concoction is not designed to steal life, only sight. An unpleasant mix of bat remnants and quicksilver─my eyes begin to water at just the thought of the ingredients!"},{"name":"SEVERIAN","text":"Such potions as you have created hold the potential for all manner of dastardly deeds! Bear the flasks with pride as you deliver them into the hands of the Miqo'te lass who awaits you in Pearl Lane."},{"name":"SEVERIAN","text":"And, no, I have not forgotten her name! She apparently did not give one when she left the order. I know only that the lass is affiliated with one of Ul'dah's resident bandit gangs. Swiftly now, let us not test their patience!"},{"name":"WBULEA","text":"You're the head potion brewer's lackey, are you? Let's have the goods, then."},{"name":"WBULEA","text":"Bah, I see Severian did nothing to put a stop to this. He should know full well the consequences of handing over such dangerous substances to a criminal organization."},{"name":"WBULEA","text":"Confused? I am W'bulea of the Sultansworn. I infiltrated the notorious robber gang, the Velvet Hands, after learning of their plans to attempt a bloodless heist at the palace─an attempt I can only assume is meant to emulate Mistbeard and his legendary act of larceny. These blinding potions were to be a key element in their scheme."},{"name":"WBULEA","text":"Wondering how your guildmaster would handle a request from such unsavory elements, I insinuated myself into a position to receive the delivery. His lack of restraint is...disappointing, but not entirely unexpected."},{"name":"WBULEA","text":"He is not the man he once was. Oh, certainly, Severian has always had a passion for his work, but ever since the tragic events of the Calamity, it has become an all-consuming obsession."},{"name":"WBULEA","text":"Your superior may as well have upended one of these flasks over his own head for the little he sees of the world that flows unnoticed around him."},{"name":"WBULEA","text":"Would you take a message back to the guild for me? I want you to tell Severian to cease this insane quest of his."},{"name":"WBULEA","text":"At first, I thought the distraction of his research might prove beneficial, but he has lost all sense of self-control. No, my sister would never countenance this destructive behavior... I will have W'nahja returned to me."},{"name":"WBULEA","text":"I shall dispose of this blinding agent. You need only concern yourself with conveying my message to the guildmaster."},{"name":"SEVERIAN","text":"You were absent too long. Too long! Your delivery was well received, yes?"},{"name":"SEVERIAN","text":"...She demanded that I return W'nahja? Ah, I see you have met the cold-hearted and conniving W'bulea!"},{"name":"SEVERIAN","text":"I have not the slightest intention of giving up on W'nahja now. I must remain focused on the successful culmination of my greatest experiment, so that finally she might─ So that I might tell her..."},{"name":"SEVERIAN","text":"Bah, but these matters have no place in our discussion. Once again you have spared me a bothersome interruption, and proven your alchemical expertise in so doing."},{"name":"SEVERIAN","text":"From this day forth, I shall think of you no longer as my lackey, but as an assistant in truth. Soon...soon shall we achieve the ultimate expression of alchemy. I bid you return to your studies and prepare for that glorious moment!"}],"reward":{"gil":639,"items":[{"id":2473},{"id":2750,"one":1},{"id":3104,"one":1},{"id":3583,"one":1},{"num":6,"id":5824,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":15}],"quests":[66119]},"next":[66183]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1003927","obj":{"i":1003927,"n":"W'bulea","l":41,"q":2}},{"type":"item","id":"2473","obj":{"i":2473,"n":"Conical Alembic","l":28,"c":35605,"t":24,"p":2232}},{"type":"item","id":"2750","obj":{"i":2750,"n":"Velveteen Beret","l":29,"c":41032,"t":34}},{"type":"item","id":"3104","obj":{"i":3104,"n":"Velveteen Gown","l":30,"c":42071,"t":35,"p":2499}},{"type":"item","id":"3583","obj":{"i":3583,"n":"Velveteen Shortgloves","l":28,"c":44081,"t":37,"p":1453}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4575","obj":{"i":4575,"n":"Weak Blinding Potion","l":20,"c":20685,"t":44}},{"type":"quest","id":"66119","obj":{"i":66119,"n":"Practical Alchemy","g":142,"l":"Ul'dah","s":250,"f":1}},{"type":"quest","id":"66183","obj":{"i":66183,"n":"Cease and Assist","g":142,"l":"Ul'dah","s":350,"f":1}}]}