{"quest":{"name":"Duty and the Beast","location":"Upper La Noscea","id":66122,"patch":3.0,"sort":520,"icon":100434,"unlocksFunction":1,"eventIcon":71341,"issuer":1013279,"target":1013279,"involved":[1006746,1013280,1014199],"genre":149,"journal":["Broken Mountain seems to have reservations about digging deeper into this newfound knowledge.","Before he will share his latest findings regarding Mythril Heart with you, Broken Mountain asks you to accompany Curious Gorge to the Coerthas central highlands and slay a fearsome beast. Though it appears to be unrelated to his research, Broken Mountain assures you that this request is of the utmost importance. Rendezvous with him at the Weeping Saint and see the deed done.","While defending his brother from the beast's sudden attack, Curious Gorge succumbs to his inner beast, and you have no choice but to subdue him. As you land your final blow, your own inner beast rouses from its slumber with such ferocity that you lose consciousness momentarily. Afterwards, Broken Mountain forbids his brother from assisting you further in your quest, for fear of him losing control again. Though clearly distressed, Curious Gorge accepts his brother's judgment. Rest and visit Broken Mountain in Camp Bronze Lake when you are ready to continue your conversation.","Merely recalling your duel with Curious Gorge causes your inner beast to stir─a revelation which leads Broken Mountain to remember a passage he came across in his research: “Only the flames of animosity may temper a warrior's soul.” He interprets this to mean that the inner beast stirs when a warrior faces an opponent who pushes him to surpass his physical and mental limits, and that only in that moment can he attain mastery of new techniques. Believing this to be the means by which the heroes of eld achieved their legendary feats, he implores you to challenge yourself as they did.<br><br>※The next warrior quest will be available from Broken Mountain upon reaching level 54."],"objectives":["Speak with Broken Mountain at the Weeping Saint.","Speak with Broken Mountain.","Defeat Curious Gorge!"],"dialogue":[{"name":"BROKENMOUNTAIN","text":"I can tell you have not neglected your training, <span class=\"highlight\">Forename</span>, which is good. I have continued my research into the tales of Mythril Heart and his legendary feats, and I believe I've come across a passage which may guide your next step."},{"name":"BROKENMOUNTAIN","text":"Before I share my findings with you, however, there is...another matter of pressing importance that must be resolved before we continue..."},{"name":"BROKENMOUNTAIN","text":"A ferocious beast has been sighted near the Weeping Saint in the Coerthas central highlands, and I would have you, me, and my brother go and slay it, as it poses a threat to any who venture nearby. I realize that this may seem like a trivial matter, but I assure you that it is of the utmost importance."},{"name":"CURIOUSGORGE","text":"What is he thinking, asking us to deal with such a trivial matter at a time like this?"},{"name":"CURIOUSGORGE","text":"I can't...resist..."},{"name":"BROKENMOUNTAIN","text":"Thank the Twelve you made it! The beast caught us unawares. My brother leapt to my defense and slew it, but in that moment..."},{"name":"BROKENMOUNTAIN","text":"He was overcome by his inner beast, as before in Wineport!"},{"name":"BROKENMOUNTAIN","text":"I <span class=\"emphasis\">knew</span> it was folly to bring him here. I beg of you, stop him before he hurts himself!"},{"name":"QIB","text":"The beast...it's...uuugahhh!"},{"name":"QIB","text":"He has almost succumbed to the beast within! Stop him before he is forever lost!"},{"name":"QIB","text":"Graaaghhh!"},{"name":"QIB","text":"Each attack only serves to goad the beast!"},{"name":"QIB","text":"Fleas...insignificant whelps!"},{"name":"QIB","text":"What has he become!?"},{"name":"BROKENMOUNTAIN","text":"<span class=\"highlight\">Forename</span>! Speak to me!"},{"name":"BROKENMOUNTAIN","text":"Thank the gods you're awake. When your final blow landed, you and my brother both collapsed. What happened, <span class=\"highlight\">Forename</span>? Do you remember anything?"},{"name":"BROKENMOUNTAIN","text":"Your inner beast lashed out as if trying to escape!?"},{"name":"BROKENMOUNTAIN","text":"I see... The lingering numbness is likely your body recovering from the shock. Otherwise, you appear to be unharmed and in full control of your faculties."},{"name":"CURIOUSGORGE","text":"I owe you an apology, <span class=\"highlight\">Forename</span>. Once again I lost control..."},{"name":"BROKENMOUNTAIN","text":"I have already tended to my brother's wounds. You needn't worry."},{"name":"BROKENMOUNTAIN","text":"Alas, as I suspected, my brother yet lacks the strength to control his inner beast. As you may have guessed, I called you both here to see if my fears were unfounded."},{"name":"CURIOUSGORGE","text":"I did not wish to give you cause to worry, Brother, but...when the beast stirs, my mind grows clouded, and my will falters..."},{"name":"CURIOUSGORGE","text":"Or perhaps I remained silent to avoid facing the bitter truth: who would trust a protector that could turn on them at any moment?"},{"name":"BROKENMOUNTAIN","text":"It pains me to do this, but I cannot allow you to accompany <span class=\"highlight\">Forename</span> any longer. The risk is far too great to you both."},{"name":"BROKENMOUNTAIN","text":"Mayhap it is best we continue this conversation in the safety of Camp Bronze Lake."},{"name":"CURIOUSGORGE","text":"Godsdammit! <span class=\"highlight\">Forename</span>, you've...you've grown so much stronger...while I've hardly grown at all."},{"name":"CURIOUSGORGE","text":"Show Eorzea what it means to be a true warrior. I know...I know you can."},{"name":"CURIOUSGORGE","text":"Go on without me, <span class=\"highlight\">Forename</span>. I will burden you no longer."},{"name":"BROKENMOUNTAIN","text":"So, my brother has been in a dour mood ever since we returned from the Weeping Saint? Well, that is only natural given his lack of progress─and it may be for the best."},{"name":"BROKENMOUNTAIN","text":"The teachings of our people are too dangerous for those who lack control. That is why I chose to focus my studies on how to tame the inner beast."},{"name":"BROKENMOUNTAIN","text":"For the sake of my brother, I wanted naught more than to solve this dilemma...but then fate intervened, and I stumbled upon the tales of Mythril Heart."},{"name":"BROKENMOUNTAIN","text":"But mayhap we need not forsake one pursuit for the other, though. In seeking the techniques of eld, we may discover the reason why you can hold the beast in check so easily while my brother and I fumble about like children."},{"name":"BROKENMOUNTAIN","text":"However, I am still concerned about what you told me before─about your inner beast lashing out during your duel with my brother. Can you tell me of that once more?"},{"name":"BROKENMOUNTAIN","text":"Simply recalling the duel rouses your inner beast from its slumber!? Wait─it all makes sense."},{"name":"BROKENMOUNTAIN","text":"“Only the flames of animosity may temper a warrior's soul.” I came across these words in a passage, and I did not understand their meaning until now."},{"name":"BROKENMOUNTAIN","text":"The inner beast stirs when we face an opponent who pushes us to surpass our physical and mental limits. Only in that moment can we attain mastery of new techniques."},{"name":"BROKENMOUNTAIN","text":"This must be how the heroes of eld like Mythril Heart became such legends! They traveled the realm, testing their mettle against the fiercest foes they could find. Your path is clear, then, <span class=\"highlight\">Forename</span>: you must challenge yourself as they did. You must grow stronger and hone your skills to new heights!"}],"reward":{"gil":1439,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":22}],"quests":[66121]},"next":[66124]},"partials":[{"type":"npc","id":"1013279","obj":{"i":1013279,"n":"Broken Mountain","l":34,"q":7}},{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1013280","obj":{"i":1013280,"n":"Curious Gorge","l":63,"q":1}},{"type":"npc","id":"1014199","obj":{"i":1014199,"n":"Broken Mountain","l":63,"q":1}},{"type":"quest","id":"66121","obj":{"i":66121,"n":"Better Axe Around","g":149,"l":"Eastern La Noscea","s":500,"f":1}},{"type":"quest","id":"66124","obj":{"i":66124,"n":"The Bear Necessity","g":149,"l":"Upper La Noscea","s":540,"f":1}}]}