{"quest":{"name":"Coming to Ul'dah","location":"Ul'dah","id":66130,"patch":2.0,"sort":1,"icon":100086,"eventIcon":71221,"issuer":1003987,"target":1003988,"genre":93,"journal":["To be recognized as an adventurer in the city–state of Ul'dah, you must register yourself with the Adventurers' Guild.","Wymond suggests that you speak with Quicksand proprietress Momodi before you begin exploring.","Now that you have successfully registered yourself as an adventurer, you are almost ready to begin exploring Ul'dah. Speak with Momodi again to learn more about the city and the basics of adventuring."],"objectives":["Speak with Momodi."],"dialogue":[{"name":"WYMOND","text":"'Tis plain to anyone with eyes that you don't know your way around here."},{"name":"WYMOND","text":"If I let you go wanderin' off down the nearest dark alley, you're certain to get mugged or worse, an' I don't want that on my conscience."},{"name":"WYMOND","text":"So before you do anythin' else, you'll want to head over to the Quicksand, an' speak with Momodi. She's the master of the Adventurers' Guild, an' can set you on the right path."},{"name":"WYMOND","text":"Just take those steps over yonder an' pass through the double doors. You'll find her inside."},{"name":"WYMOND","text":"...An' that's as much as you're gettin' for free. Good luck with the adventurin', adventurer."},{"name":"SYSTEM","text":"You have begun a quest!"},{"name":"SYSTEM","text":"Use the <span class=\"highlight\">duty list</span> to help you complete your task."},{"name":"MOMODI","text":"Why, hello there! Who might you be?"},{"name":"MOMODI","text":"If you're lookin' to join the Adventurers' Guild, you've come to the right place."},{"name":"MOMODI","text":"My name's Momodi, and─ Pardon me, have we met before? There's somethin' awfully familiar about you..."},{"name":"MOMODI","text":"&lt;sigh&gt; I don't know if it's the Calamity, or just the march of the bleedin' years, but I'm findin' it harder and harder to keep track of all the names and faces. Anyway, forget I mentioned it─I daresay I will... Ahem."},{"name":"MOMODI","text":"Name's Momodi, and I own this fine establishment, if it please you."},{"name":"MOMODI","text":"I also manage the Adventurers' Guild here in Ul'dah. So you might say that lookin' after green adventurers like yourself is my vocation."},{"name":"MOMODI","text":"And lucky for you that it is. Without someone like me to steer you right, you'd soon find yourself out in the middle of nowhere, caught up in business you don't understand."},{"name":"MOMODI","text":"Like our conflict with the Amalj'aa, for example. They've been plaguin' the sultanate for nigh on, oooh...<span class=\"emphasis\">forever</span> now."},{"name":"MOMODI","text":"Then there's the Garlean Empire. None can say for sure what they're plottin' these days, only that they <span class=\"emphasis\">are</span>."},{"name":"MOMODI","text":"Aye, the people drink and make merry...but underneath it all, there's worry. Worry and a lingerin' feelin' of loss."},{"name":"MOMODI","text":"And little wonder. It's scarce been five years since the lesser moon cracked open like a giant egg, releasin' an abomination intent on turnin' the realm into an eighth hell..."},{"name":"MOMODI","text":"So much was lost in the blink of an eye. 'Twas like the end of the world had come at last."},{"name":"MOMODI","text":"But then things begin to get foggy. Everyone's got their own version of what happened next─some of 'em, two or three..."},{"name":"MOMODI","text":"You'd think people would remember somethin' like that─but the fact is, they don't. Nobody does."},{"name":"MOMODI","text":"There is one thing the survivors agree on, though: the part played by a band of adventurers who laid down their lives for a realm that wasn't their own."},{"name":"MOMODI","text":"They fought valiantly, and like so many others, they never returned. Deeds worth rememberin', I'm sure you'll agree. It's just a shame our recollections of those brave heroes are as jumbled as those of the Calamity itself."},{"name":"MOMODI","text":"Whenever we try to call their faces to mind, it's like they're standin' between us and the midday sun, permanently silhouetted... I'll bet that sounds poetic to you, doesn't it? Well it's not. It's bloody infuriatin'."},{"name":"MOMODI","text":"But even if we can't remember them, we'll not let 'em be forgotten, and so we call 'em the Warriors of Light."},{"name":"MOMODI","text":"And they'll forever stand as a shinin' example of what adventurers can achieve. That's why I welcome new arrivals like yourself to our fair city."},{"name":"MOMODI","text":"All I ask is that you lend a helpin' hand, and try to leave Ul'dah in a better state than you found her. If you can promise that, I'd be happy to let you join the guild."},{"name":"MOMODI","text":"All right, then! A promise is a promise, now!"},{"name":"MOMODI","text":"I'm countin' on your help to put the past behind us. We need people workin' and spendin' and bickerin' like the old days!"},{"name":"MOMODI","text":"And a happy and prosperous Ul'dah means more business for the Quicksand, too!"},{"name":"MOMODI","text":"Anyroad, let's make this official."},{"name":"MOMODI","text":"Go ahead and write your name in the register─neat as you can."},{"name":"MOMODI","text":"...<span class=\"highlight\">Forename Surname</span>. Well, ain't that a charmin' name. Just rolls off the tongue, it does."},{"name":"MOMODI","text":"All right, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Surname</span>! On behalf of the Adventurers' Guild, I officially─"},{"name":"SHABBYMAN","text":"Please, sir, be merciful! Twelve as my witness, I swear to you, I'll bring you your money!"},{"name":"BILLCOLLECTOR","text":"In the East, it is said that even a merciful god might be driven to vengeance if thrice blasphemed."},{"name":"BILLCOLLECTOR","text":"Be grateful you were given a fourth chance to offend. You two, attend to this scum."},{"name":"SHABBYMAN","text":"No, please! Mercy!"},{"name":"MOMODI","text":"Well, ain't that a sorry sight. Nor an uncommon one, if I'm honest. Don't worry, though─if you work hard, I doubt you'll end up like him."},{"name":"MOMODI","text":"Just the same, if you ever need a bit of advice about one thing or another, pay me a visit. Just don't go botherin' me every time you stub your bloody toe, all right?"},{"name":"MOMODI","text":"'Course, I <span class=\"emphasis\">do</span> enjoy hearin' <span class=\"alternative-container\"><span class=\"alternative\">a lady muse on the many manhoods of her acquaintance</span><span class=\"alternative\">tell of a gentleman's woes with the womenfolk</span></span> from time to time..."},{"name":"MOMODI","text":"Anyroad, welcome to Ul'dah, <span class=\"highlight\">Forename</span>!"},{"name":"MOMODI","text":"Take a moment to catch your breath, and I'll teach you a little about our fair city."},{"name":"SYSTEM","text":"This concludes the introductory game tutorial."},{"name":"SYSTEM","text":"You have taken the first step as an adventurer in the city of Ul'dah."},{"name":"SYSTEM","text":"Listen well to the wisdom of Momodi Modi, then go forth and discover the incredible adventures that await you!"}],"reward":{"gil":103,"xp":50},"next":[66104,66105,66106]},"partials":[{"type":"npc","id":"1003987","obj":{"i":1003987,"n":"Wymond","l":40,"q":1}},{"type":"npc","id":"1003988","obj":{"i":1003988,"n":"Momodi","l":40,"q":4,"t":"Quicksand Proprietress"}},{"type":"quest","id":"66104","obj":{"i":66104,"n":"Close to Home","g":1,"l":"Ul'dah","s":9}},{"type":"quest","id":"66105","obj":{"i":66105,"n":"Close to Home","g":1,"l":"Ul'dah","s":10}},{"type":"quest","id":"66106","obj":{"i":66106,"n":"Close to Home","g":1,"l":"Ul'dah","s":11}}]}