{"quest":{"name":"We Must Rebuild","location":"Ul'dah","id":66131,"patch":2.0,"sort":14,"eventIcon":71201,"issuer":1001353,"target":1003995,"genre":1,"journal":["Momodi of the Quicksand wants to introduce you to a certain someone at the Ul'dah Dispatch Yard.","According to Momodi, a Lalafell named Papashan may have some work for a burgeoning adventurer. Exit the city through the Gate of Nald and travel east. Find this Papashan at the Ul'dah Dispatch Yard and speak with him.","Papashan is seeking able adventurers to help rebuild Ul'dah in the wake of the great ruin brought about by the Calamity. Do what you can to aid the good people of Ul'dah in their efforts to restore their proud city to its former glory."],"objectives":["Speak with Papashan at the Ul'dah Dispatch Yard."],"dialogue":[{"name":"MOMODI","text":"Well, younglin', how are you findin' our fine Ul'dah, then? Got your bearin's about you yet? "},{"name":"MOMODI","text":"If so, mayhap it's time you ventured beyond the city walls. The bustlin' streets of Ul'dah are one thing, but the wilds of Thanalan─that's another altogether."},{"name":"MOMODI","text":"I know a bloke you might fancy speakin' to, and he you. Name of Papashan. You'll find him over at the Ul'dah Dispatch Yard. No doubt he'll have some work for you."},{"name":"MOMODI","text":"The Dispatch Yard's over in central Thanalan. Just head out the door across the hall and you'll see the Gate of Nald staring right back at you. Pass through it and head east. You'll come upon it 'fore long."},{"name":"MOMODI","text":"There's dangers beyond the wall, though. More than I'd care to count. Nothin' too terrible, mind you, but feisty enough to attack if you draw near. Don't say nobody cared enough to warn you."},{"name":"PAPASHAN","text":"Well, you certainly look the part of an adventurer, my friend. Might you be the good soul Momodi advised me to expect, hm?"},{"name":"PAPASHAN","text":"I am Papashan, stationmaster of this humble Dispatch Yard."},{"name":"PAPASHAN","text":"An empty title, I assure you. I truly am no more than a tired old Lalafell passing his final years in quiet and solitude."},{"name":"PAPASHAN","text":"Twelve know there have been plenty of both these last five years since the Calamity struck. The devastation...was vast."},{"name":"PAPASHAN","text":"Yet now true Ul'dahns work together, doing all in our power to rebuild what was laid to ruin. By the sweat of our brows and the love of our home, we have rebuilt Ul'dah to the grandeur and majesty that you see today."},{"name":"PAPASHAN","text":"The railways which run through this Dispatch Yard, too, were born of the noble efforts of a great many souls."},{"name":"PAPASHAN","text":"But there is still much work to be done. The wounds left by the Calamity run deep. Isolated areas beyond our lines of supply remain, and there are places yet wanting for relief and restoration."},{"name":"PAPASHAN","text":"Ul'dah needs the aid of you and your brethren, friend. In fact, never has our need been <span class=\"emphasis\">more</span> dire."},{"name":"PAPASHAN","text":"Which brings me to the point, I suppose. I do believe I may have some work suited to one of your ability."}],"reward":{"gil":127,"items":[{"id":27634,"one":1},{"id":27665,"one":1},{"id":5824,"one":1}],"xp":910},"reqs":{"jobs":[{"lvl":4,"id":130}],"questsType":"any","quests":[66104,66105]},"next":[66207]},"partials":[{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"item","id":"27634","obj":{"i":27634,"n":"Altered Thighboots","l":5,"c":49077,"t":38}},{"type":"item","id":"27665","obj":{"i":27665,"n":"Altered Leather Thighboots","l":5,"c":46102,"t":38}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66104","obj":{"i":66104,"n":"Close to Home","g":1,"l":"Ul'dah","s":9}},{"type":"quest","id":"66105","obj":{"i":66105,"n":"Close to Home","g":1,"l":"Ul'dah","s":10}},{"type":"quest","id":"66207","obj":{"i":66207,"n":"Nothing to See Here","g":1,"l":"Central Thanalan","s":19}}]}