{"quest":{"name":"Know Thy Land","location":"Ul'dah","id":66136,"patch":2.0,"sort":50,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"genre":144,"usedItems":[5432],"journal":["Adalberta wants to teach you the importance of knowing the land.","In recognition of your progress, Adalberta has set you a new task. Wishing to impress upon you the importance of knowing the land, the guildmaster bids you procure ten bone chips. Mine the required quantity beyond the Gate of Nald and deliver them to her.","After counting your bone chips, Adalberta explains that knowledge acquired through practical experience is what allows a miner to grow. With your trusty gathering log to guide you, venture forth into the wilderness in search of further riches, and amass a wealth of knowledge in so doing.<br><br>※The next miner quest will be available from Adalberta upon reaching level 10."],"objectives":["Deliver bone chips to Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"Hello there, <span class=\"highlight\">Forename</span>. 'Tis good to see you again."},{"name":"ADALBERTA","text":"Judging by the blisters on your hands, it's plain you've been hard at it with your pickaxe. Good. You're ready for the next stage of your training."},{"name":"ADALBERTA","text":"Eorzea's a vast realm filled with diverse environments, and her mineral wealth varies from region to region."},{"name":"ADALBERTA","text":"Even within Thanalan, there's a marked difference between east and west."},{"name":"ADALBERTA","text":"If you want to be a successful miner, it's essential that you know where to look for what."},{"name":"ADALBERTA","text":"And for that, you have to become intimate with Eorzea. How else can you expect her to reveal her innermost secrets to you?"},{"name":"ADALBERTA","text":"Getting to know her every square malm is no small undertaking, of course, but the yalms soon add up─as I'm sure you'll find with my next task. I'd like you to seek out ten bone chips for me."},{"name":"ADALBERTA","text":"Just so you don't go about it completely blind, here's a hint: you'll find these just beyond the Gate of Nald. Off you go now, and happy digging!"},{"name":"ADALBERTA","text":"Remember, that's ten bone chips I want you to bring. Good luck!"},{"name":"ADALBERTA","text":"Ah, yes. Precisely ten bone chips. You've done well, <span class=\"highlight\">Forename</span>."},{"name":"ADALBERTA","text":"No doubt you had trouble tracking these down at first, but each chip you found added to your understanding."},{"name":"ADALBERTA","text":"For your efforts, you've come to know where best to search for bone chips. And so it goes for everything else we mine."},{"name":"ADALBERTA","text":"Now, in addition to learning <span class=\"emphasis\">where</span> to find materials, you should also make a point of knowing who needs them."},{"name":"ADALBERTA","text":"For instance, armorers and blacksmiths are our best customers when it comes to ores, while goldsmiths would struggle to ply their trade if we didn't supply them with gold and gemstones."},{"name":"ADALBERTA","text":"Oh, and I mustn't forget the alchemists. Those fellows can never have too much rock salt and cinnabar, and we often rub shoulders with them."},{"name":"ADALBERTA","text":"In short: know whence it comes, and whither it goes. To be sure, you still have much and more to learn, and there's no substitute for hard work."},{"name":"ADALBERTA","text":"Oh, don't look so glum! Just be thankful you don't have to bleeding <span class=\"emphasis\">memorize</span> all that information─you have a gathering log for such stuff. Make good use of it, and you can't go wrong."},{"name":"ADALBERTA","text":"That's all for now. Keep up your efforts, and visit me again when you've spent more time in the wilds, with pickaxe in hand. I'll have another task for you when you've perfected your swing."},{"name":"SYSTEM","text":"For every fifth level you reach as a miner, you will gain the ability to detect higher-level mineral deposits. When this occurs, any new items that are available through gathering will be added to your <span class=\"highlight\">gathering log</span>."},{"name":"SYSTEM","text":"You can use the <span class=\"highlight\">Lay of the Land</span> miner action to help you locate the nearest mineral deposits within your skill range."}],"reward":{"gil":194,"items":[{"id":2520},{"id":3310,"one":1},{"id":3532,"one":1},{"num":2,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":17}],"quests":[66135]},"next":[66138]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"item","id":"2520","obj":{"i":2520,"n":"Bronze Pickaxe","l":8,"c":38001,"t":28,"p":263}},{"type":"item","id":"3310","obj":{"i":3310,"n":"Leather Culottes","l":5,"c":45127,"t":36,"p":135}},{"type":"item","id":"3532","obj":{"i":3532,"n":"Hempen Work Gloves","l":6,"c":44022,"t":37,"p":145}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"5432","obj":{"i":5432,"n":"Bone Chip","l":1,"c":22201,"t":53,"p":5}},{"type":"quest","id":"66135","obj":{"i":66135,"n":"My First Pickaxe","g":144,"l":"Ul'dah","s":11,"f":1}},{"type":"quest","id":"66138","obj":{"i":66138,"n":"The Cutting Edge","g":144,"l":"Ul'dah","s":100,"f":1}}]}