{"quest":{"name":"Pirates of Shallow Water","location":"Upper La Noscea","id":66132,"patch":3.0,"sort":560,"icon":100434,"unlocksFunction":1,"eventIcon":71341,"issuer":1013279,"target":1013282,"involved":[1006266,1006746,1013285,1013287,1013290,1013292,1013295,1013334,1013336,1013337,1013338],"genre":149,"journal":["Broken Mountain knows someone in need of a legendary adventurer.","Wheiskaet informs you that pirates in thrall to the Sahagin have started brazen attacks along the La Noscean coasts, further straining the already-limited resources of the Maelstrom. He has requested that you aid him in the defense of Limsa Lominsa, and promises fierce battles that will test even <span class=\"emphasis\">your</span> battle-worn axe. Report to Aleport and speak with the storm captain for details of your mission.","The storm captain begins the mission briefing, informing you that the Serpent Reavers plan to mount an offensive from the sea, using the Isles of Umbra as a foothold. Determining that the best course of action is to scatter the pirates before they have a chance to carry out their attack, he instructs you to make haste to the isles. Speak with the captain once you have landed ashore the Isles of Umbra.","The captain's assault against the Serpent Reavers on the Isles of Umbra has begun. Speak to the storm captain to join in the fray.","The troops are making steady progress into the pirate foothold. Speak with the storm captain to find out where to proceed to next.","Although several allies have fallen to the Reavers' blades, you manage to cut through their next line of defense. The storm captain's face has a look of desperate determination─speak with him to find out where the next step of pirate killing begins.","The remnants of the Maelstrom outfit have suffered through several waves of relentless Serpent Reavers, but the pirate encampment is finally in sight. Speak with the storm captain once more before proceeding.","The Serpent Reaver captain is in sight, with his ferocious beast in tow. Save the storm captain from the pirate's barrage and steel yourself for the final battle.","The Reaver captain and his pet monster are no match for a warrior who follows in the path of Mythril Heart. Rescue the storm captain and scatter the last remnants of the Serpent Reavers.","You've rescued the storm captain, who expresses his gratitude for your help in repelling the Serpent Reavers. However, he is hesitant to remain on the Isles of Umbra for a second longer than he has to, and bids the party meet up again at Aleport. Speak with the storm captain again once everyone is safely out of those haunted isles.","The morale and strength the troops gained from your presence was key to your victory, and despite the relative weakness of the Serpent Reavers, the souls of the warriors' ancestors bestow upon you a new technique, indicating that the resolve to defend your allies is just as effective as resolving to kill your enemies. After you have recovered from your ordeal, speak with the captain again."],"objectives":["Speak with the storm captain at Aleport.","Speak with the storm captain at the Isles of Umbra.","Speak with the storm captain and defeat the pirates.","Speak with the storm captain.","Speak with the storm captain and defeat more pirates.","Speak with the storm captain.","Speak with the Serpent Reaver captain and defeat him if he attacks.","Rescue the storm captain.","Speak with the storm captain."],"dialogue":[{"name":"BROKENMOUNTAIN","text":"<span class=\"highlight\">Forename</span>, you couldn't have come at a better time. Wheiskaet has just arrived and looks eager to speak with you."},{"name":"WHEISKAET","text":"Ah, <span class=\"highlight\">Forename</span>, just the warrior I wanted to see! The nation of Limsa Lominsa is in dire need of your aid. The Maelstrom is shorthanded and the beast tribes' attacks only grow more ferocious. I'm here searching for skilled fighters─and there aren't many more skilled than you!"},{"name":"BROKENMOUNTAIN","text":"As you know, my brother has already answered the call, helping the Maelstrom defend from the relentless kobold assaults."},{"name":"WHEISKAET","text":"Kobolds aren't the only thorn in our sides. Pirates serving the Sahagin have been pillaging along the coasts of La Noscea."},{"name":"WHEISKAET","text":"That's why we need your axe, <span class=\"highlight\">Forename</span>. They may be mere pirates, but their blades cut as deep as any I've seen. Limsa Lominsa will be grateful to have your prowess on their side."},{"name":"WHEISKAET","text":"Once you've made your preparations, hurry to Aleport and speak with the storm captain on duty for the details of the mission."},{"name":"CURIOUSGORGE","text":"You're joining the Maelstrom's defense against the beast tribes? Now neither the kobolds nor Sahagin will escape the warrior's fury!"},{"name":"BROKENMOUNTAIN","text":"This mission entails more than just your journey on the warrior's path. Use your burgeoning strength in the aid of Limsa Lominsa, and your inner beast may be tempered even further."},{"name":"WHEISKAET","text":"Limsa Lominsa is grateful for your aid."},{"name":"YOUHEI00596","text":"You're the warrior here at Wheiskaet's behest? He has a high opinion of you─let's see if you live up to it!"},{"name":"CAPTAIN00596","text":"Adventurer, the Maelstrom thanks you for your aid. A band of pirates flying the flag of the Serpent Reavers has landed ashore the Isles of Umbra, and all reports indicate they plan to use that as a foothold to attack Aleport."},{"name":"CAPTAIN00596","text":"Our walls only defend from inland assaults. I shudder to think of what might happen were the pirates to bombard us with cannons from the sea. Our course of action has been decided: we will take the fight to them, before they have a chance to mount an offensive."},{"name":"CAPTAIN00596","text":"Our rendezvous point is at the Isles of Umbra. The pirates shall not weather the wrath of the Maelstrom!"},{"name":"YOUHEI00596","text":"So you're the one Wheiskaet sent? He's said much of your prowess. I look forward to seeing you in the fray!"},{"name":"CAPTAIN00596","text":"Good, now that our troops are gathered, we shall move out at once. Our objective is to slay the pirate captain. Without a head to lead them, the Serpent Reavers will scuttle back to their moldy ships."},{"name":"CAPTAIN00596","text":"However, the task ahead of us should not be taken lightly. Reports tell of a fearsome beast under the captain's thrall. Take care not to let your guard down, lest you become the beast's next meal!"},{"name":"YOUHEI00596","text":"This place is not meant for the living..."},{"name":"CAPTAIN00596","text":"Fight back before we're overwhelmed!"},{"name":"YOUHEI00596","text":"These're no ordinary pirates!"},{"name":"CAPTAIN00596","text":"The pirates attacked as if possessed... Thank the Twelve your axe cut them down! We shall press forward. For Aleport!"},{"name":"YOUHEI00596","text":"I've never seen such ferocity. Wheiskaet's praise was not unfounded!"},{"name":"CAPTAIN00596","text":"The main camp will soon be within our sights! I'll protect the wounded─<span class=\"highlight\">Forename</span>, give the pirates a taste of your steel!"},{"name":"YOUHEI00596","text":"Godsdammit... The main camp is just ahead... Our strength must not falter..."},{"name":"CAPTAIN00596","text":"The pirates think they have strength in numbers, but a storm captain is worth a dozen of them! We shall leave the wounded to recover here─<span class=\"highlight\">Forename</span>, to me!"},{"name":"YOUHEI00596","text":"We've come this far, but our strength dwindles. I will not...die here..."},{"name":"SENCHO00596","text":"<span class=\"emphasis\">Stop</span> the Serpent Reavers!? Har har har! Well, if yer hells-bent on tryin', it's been a long time since me pup had fresh corpses to feast on!"},{"name":"CAPTAIN00596","text":"Don't let his bloody beast catch you off guard!"},{"name":"YOUHEI00596","text":"Forge ahead... We won't be far behind!"},{"name":"YOUHEI00596","text":"I could not wish for a stronger ally. To think such a beast could be felled so easily..."},{"name":"CAPTAIN00596","text":"Such fine axemanship I've never seen! However, now is not the time to dally about in awe─this place fills me with foreboding. Let us meet again at Aleport!"},{"name":"YOUHEI00596","text":"I could not wish for a stronger ally. To think such a beast could be felled so easily..."},{"name":"CAPTAIN00596","text":"<span class=\"highlight\">Forename</span>, now that we are safely out of those cursed isles, I would like to thank you for your aid once again. Without the courage your fighting spirit bestowed upon us, we would have been overwhelmed. The Maelstrom is honored to count you amongst our allies."},{"name":"YOUHEI00596","text":"The captain speaks for us all. Your ferocity inspired us to carry on in the face of the pirate onslaught. What drove you to fight with such fury?"},{"name":"YOUHEI00596","text":"...And here I thought that axe was just for killing! But instead, you wielded it in our defense, and your will to protect us gave you the strength to surpass the limits of your mind and body... Seven hells, I've been fighting all wrong!"},{"name":"CAPTAIN00596","text":"I've seen nary a battle so fierce, or a protector more stalwart. <span class=\"highlight\">Forename</span>, I would like to hear more of our skirmish from your eyes. After you have recovered from the fight, pray speak to me again."}],"reward":{"gil":844,"action":3551,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":22}],"quests":[66124]},"next":[67213]},"partials":[{"type":"npc","id":"1013279","obj":{"i":1013279,"n":"Broken Mountain","l":34,"q":7}},{"type":"npc","id":"1013282","obj":{"i":1013282,"n":"Storm Captain","l":33,"q":2}},{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1013285","obj":{"i":1013285,"n":"Former Company Hero","l":33,"q":2}},{"type":"npc","id":"1013287","obj":{"i":1013287,"n":"Storm Captain","l":33,"q":1}},{"type":"npc","id":"1013290","obj":{"i":1013290,"n":"Former Company Hero","l":33,"q":1}},{"type":"npc","id":"1013292","obj":{"i":1013292,"n":"Storm Captain","l":33,"q":1}},{"type":"npc","id":"1013295","obj":{"i":1013295,"n":"Former Company Hero","l":33,"q":1}},{"type":"npc","id":"1013334","obj":{"i":1013334,"n":"Storm Captain","l":33,"q":1}},{"type":"npc","id":"1013336","obj":{"i":1013336,"n":"Former Company Hero","l":33,"q":1}},{"type":"npc","id":"1013337","obj":{"i":1013337,"n":"Storm Captain","l":33,"q":1}},{"type":"npc","id":"1013338","obj":{"i":1013338,"n":"Serpent Reaver Captain","l":33,"q":1}},{"type":"action","id":"3551","obj":{"i":3551,"n":"Raw Intuition","c":2559,"j":21,"t":4,"l":56}},{"type":"quest","id":"66124","obj":{"i":66124,"n":"The Bear Necessity","g":149,"l":"Upper La Noscea","s":540,"f":1}},{"type":"quest","id":"67213","obj":{"i":67213,"n":"How to Train Your Warrior","g":149,"l":"Western La Noscea","s":561,"f":1}}]}