{"quest":{"name":"My First Pickaxe","location":"Ul'dah","id":66135,"patch":2.0,"sort":11,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"genre":144,"usedItems":[5106],"journal":["Adalberta wants to assign you your first task.","Having admitted you to the Miners' Guild, Adalberta assigns you a task intended to help you get to grips with your pickaxe. Use the venerable tool to gather ten chunks of copper ore outside either the Gate of the Sultana or the Gate of Nald, and deliver them to the guildmaster.","After expressing her satisfaction with your inaugural haul of copper ore, Adalberta advises you to focus your efforts on refining your technique. She pledges to assign you another task when you have become more proficient.<br><br>※The next miner quest will be available from Adalberta upon reaching level 5."],"objectives":["Deliver chunks of copper ore to Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"You look good with a pickaxe, <span class=\"highlight\">Forename</span>."},{"name":"ADALBERTA","text":"Now that you're suitably equipped, your training can commence!"},{"name":"ADALBERTA","text":"A miner learns <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> craft best in the wilderness, with pickaxe in hand."},{"name":"ADALBERTA","text":"To begin, let's see how you fare with good old copper ore. Bring me, say...ten chunks."},{"name":"ADALBERTA","text":"There are deposits of the stuff throughout Thanalan. I doubt you'll have to go very far outside the city."},{"name":"ADALBERTA","text":"Seek out some promising locations outside the Gate of the Sultana and the Gate of Nald, and swing away!"},{"name":"ADALBERTA","text":"The motion may feel awkward at first, but in time it'll become second nature."},{"name":"SYSTEM","text":"Miners use pickaxes and other tools to extract the mineral wealth of Eorzea and gather materials used in crafting."},{"name":"SYSTEM","text":"Locations that can be mined for resources are known as <span class=\"highlight\">mineral deposits</span>."},{"name":"SYSTEM","text":"To locate mineral deposits, make your way out of the city and then use the miner action known as <span class=\"highlight\">Prospect</span>."},{"name":"ADALBERTA","text":"It's ten chunks of copper ore I want. The metal is common enough in Thanalan. You shouldn't have trouble finding suitable deposits just outside the Gate of the Sultana and the Gate of Nald."},{"name":"ADALBERTA","text":"Let's see here... Ten chunks, just as I ordered. Well done, <span class=\"highlight\">Forename</span>."},{"name":"ADALBERTA","text":"Tell me, is being a miner aught like you imagined? Harder than expected, is it? Heh! All new recruits say as much."},{"name":"ADALBERTA","text":"It takes a combination of knowledge, experience, and instinct to know where to dig. Yet it's ultimately backbreaking labor that yields you your prize."},{"name":"ADALBERTA","text":"Make no mistake, <span class=\"highlight\">Forename</span>─mining is grueling work, and you'll be dog-tired most of your waking hours. But tell me, did you not feel invigorated each time your pickaxe struck home?"},{"name":"ADALBERTA","text":"Did you not experience a thrill of triumph when the earth finally yielded up your prize? <span class=\"emphasis\">That</span> is what we miners live for."},{"name":"ADALBERTA","text":"You may be ripe to collapse, your face caked in week-old dirt, but the promise of discovery drives you on. And the instant you find that which you have long sought─in that sparkling instant─you feel like a god among men."},{"name":"ADALBERTA","text":"You've made a fine start, and I would see you maintain your efforts. Practice swinging your pickaxe till your arms have learned the motion, then return here. I'll have another little task for you."},{"name":"SYSTEM","text":"The next miner quest will be available from Adalberta upon reaching level 5."}],"reward":{"gil":115,"items":[{"id":2959}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":17}],"quests":[66133]},"next":[66136]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"item","id":"2959","obj":{"i":2959,"n":"Hempen Dalmatica of Gathering","l":1,"c":42016,"t":35}},{"type":"item","id":"5106","obj":{"i":5106,"n":"Copper Ore","l":1,"c":21209,"t":48,"p":2}},{"type":"quest","id":"66133","obj":{"i":66133,"n":"Way of the Miner","g":144,"l":"Ul'dah","s":10,"f":1}},{"type":"quest","id":"66136","obj":{"i":66136,"n":"Know Thy Land","g":144,"l":"Ul'dah","s":50,"f":1}}]}