{"quest":{"name":"Getting in Deep","location":"Ul'dah","id":66139,"patch":2.0,"sort":150,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1003909,"genre":144,"usedItems":[5519],"journal":["Adalberta would like you to meet a prominent member of the mining community.","It would seem your recent efforts have attracted the attention of Deep Canyon, vice foreman of Amajina & Sons Mineral Concern. According to Adalberta, he is eager to meet with you, and has come to the guild for that very purpose. Seek him near the entrance, and introduce yourself.","Wishing to assess your reported potential for himself, Deep Canyon bids you procure ten onzes of cinnabar. For the sake of formality, report back to Adalberta prior to beginning your task.","According to Adalberta, ten onzes of cinnabar will not be easy to find. Nevertheless, the guildmaster believes you equal to the task. Search for the elusive mineral in the vicinity of Horizon in western Thanalan, and when you have found the requisite quantity, deliver the lot to Deep Canyon.","Deep Canyon is impressed that you were able to find the quantity of cinnabar he requested, and promises you more work from the Concern. Now convinced of your potential, he advises you to invest in better gear, arguing that the benefits of quality equipment far outweigh the initial cost.<br><br>※The next miner quest will be available from Adalberta upon reaching level 20."],"objectives":["Speak with Deep Canyon.","Speak with Adalberta.","Deliver onzes of cinnabar to Deep Canyon."],"dialogue":[{"name":"ADALBERTA","text":"<span class=\"highlight\">Forename</span>! I've been searching high and low for you!"},{"name":"ADALBERTA","text":"You have a visitor, and no ordinary one at that! I speak of Deep Canyon, vice foreman of Amajina & Sons Mineral Concern."},{"name":"ADALBERTA","text":"It seems word of your sizable haul of obsidian has reached his ears, and now he wishes to meet with you."},{"name":"ADALBERTA","text":"I can only speculate as to his intentions, I'm afraid. We haven't spoken much of late."},{"name":"ADALBERTA","text":"Truth be told, I've scarcely seen him. You'd never know it, but we used to be close..."},{"name":"ADALBERTA","text":"<span class=\"emphasis\">Anyway</span>, I suggest you go and see the man─find out what he wants of you. He's waiting by the entrance."},{"name":"DEEPCANYON","text":"You must be <span class=\"highlight\">Forename Surname</span>. I've been waitin' for you."},{"name":"DEEPCANYON","text":"I'm Deep Canyon, vice foreman of the Concern."},{"name":"DEEPCANYON","text":"I must say, you're not what I was expectin'. I was sure Adalberta's newest protégé would be an Ala Mhigan─like every other miner this place produces these days. But I'll wager you're from even farther afield...an' that you're an <span class=\"emphasis\">adventurer</span>. Hmph."},{"name":"DEEPCANYON","text":"No offense, but in these parts, adventurers are known for bein' fickle buggers who break pledges like the rest of us break bread. Truth be told, I've always wondered whether you lot are actually good for Ul'dah."},{"name":"DEEPCANYON","text":"But it seems you're not like the others. It takes more than a jobbin' miner to deliver on an order from the Concern."},{"name":"DEEPCANYON","text":"I've a mind to assign you work─<span class=\"emphasis\">real</span> work. But before I do, I'm obliged to test you."},{"name":"DEEPCANYON","text":"I want you to procure ten onzes of cinnabar for me. Do this, an' we'll talk about more lucrative undertakin's."},{"name":"DEEPCANYON","text":"'Course, a bit of cinnabar shouldn't pose much trouble for the guild's risin' star. 'Tis but a formality."},{"name":"DEEPCANYON","text":"An' speakin' of formalities, be sure to tell the guildmaster about your little test."},{"name":"DEEPCANYON","text":"She's the one in charge 'round here, after all. I won't have it said that I'm underminin' her authority."},{"name":"ADALBERTA","text":"A test from Deep Canyon, you say? I thought as much..."},{"name":"ADALBERTA","text":"In case you don't know, cinnabar's the mineral used to make quicksilver. It's found in certain types of rock, and you invariably need a sledgehammer to get at it."},{"name":"ADALBERTA","text":"Now, I don't mean to dampen your spirits, but contrary to what you were told, cinnabar <span class=\"emphasis\">isn't</span> easy to find. In fact, it's known to elude even experienced miners. And here you are, tasked with procuring ten onzes of the stuff!"},{"name":"ADALBERTA","text":"Safe to say, this test is no mere formality. Hmmm...I may not be able to help you dig, but I <span class=\"emphasis\">can</span> point you in the right direction. Search just outside the Sunrise Gate─the rocky outcrops thereabouts are known to yield cinnabar."},{"name":"ADALBERTA","text":"Ten onzes may sound like nothing, but take it from me: you'll have to work for every one. This is a big task, <span class=\"highlight\">Forename</span>, but I believe you're equal to it."},{"name":"DEEPCANYON","text":"I want ten onzes of cinnabar, an' not one less. Oh, an' make it quick─I've got other commissions that want seein' to."},{"name":"DEEPCANYON","text":"Well, well...the full amount. Congratulations, <span class=\"highlight\">Forename</span>─you've passed the test."},{"name":"DEEPCANYON","text":"Seems you've got even more potential than I'd been led to believe. This guild's no place for a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> of your talent."},{"name":"DEEPCANYON","text":"I'd make you my personal assistant, but sadly for you, the position's not open to adventurers. Why? 'Cause the Concern only employs those whose roots're firmly planted in Ul'dah."},{"name":"DEEPCANYON","text":"Our nation owes much of its prosperity to the minin' trade, but more an' more, we see outsiders growin' fat off the knowledge of our forebears."},{"name":"DEEPCANYON","text":"Oh, I know full well that there're decent foreigners out there who give as much as they get─yourself, for one─but ultimately, what belongs to Ul'dah should stay in Ul'dahn hands."},{"name":"DEEPCANYON","text":"'Course, the current guildmaster doesn't share our way of thinkin'─which is somethin' I daresay we'll need to see about correctin' before long. Might be as business is good, but 'tis better to be shorthanded than to watch outsiders make off with our wealth."},{"name":"DEEPCANYON","text":"...But we were talkin' about you, <span class=\"highlight\">Forename</span>. You've proven yourself capable, an' the Concern'll have more work for you in the comin' days. Depend on it."},{"name":"DEEPCANYON","text":"Before I go, here's some free advice from me: pay more attention to your gear."},{"name":"DEEPCANYON","text":"What you wear an' wield affects how well you work. Even a decent pair of gloves can make a world of difference, take my word for it."},{"name":"DEEPCANYON","text":"These things cost money, 'tis true, but what's the price of a pair of gloves compared to the untold wealth that lies out there, waitin' to be dug up? Bugger all, that's what."},{"name":"DEEPCANYON","text":"An' on that note, I'll be off. I don't doubt we'll meet again soon─assumin' you stick with the trade long enough, that is."},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">gathering</span>, <span class=\"highlight\">perception</span>, and <span class=\"highlight\">GP</span> values."},{"name":"SYSTEM","text":"A higher gathering rating improves your chances of obtaining an item; greater perception raises the amount of items obtained; and additional GP increases your extracting stamina."},{"name":"SYSTEM","text":"Outfitting yourself with an eye to your objectives will increase the efficiency of your gathering endeavors."},{"name":"DEEPCANYON","text":"Don't forget to tell the guildmaster about your little task. She's the one in charge 'round here, after all."}],"reward":{"gil":382,"items":[{"id":2535},{"id":3023,"one":1},{"id":3322,"one":1},{"id":3549,"one":1},{"id":3774,"one":1},{"num":2,"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":17}],"quests":[66138]},"next":[66140]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003909","obj":{"i":1003909,"n":"Deep Canyon","l":41,"q":2}},{"type":"item","id":"2535","obj":{"i":2535,"n":"Recruit's Sledgehammer","l":16,"c":38051,"t":29}},{"type":"item","id":"3023","obj":{"i":3023,"n":"Cotton Shepherd's Tunic","l":15,"c":42173,"t":35,"p":468}},{"type":"item","id":"3322","obj":{"i":3322,"n":"Cotton Shepherd's Slops","l":15,"c":45139,"t":36,"p":360}},{"type":"item","id":"3549","obj":{"i":3549,"n":"Goatskin Wristguards","l":16,"c":48231,"t":37,"p":365}},{"type":"item","id":"3774","obj":{"i":3774,"n":"Hard Leather Espadrilles","l":15,"c":46185,"t":38,"p":384}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5519","obj":{"i":5519,"n":"Cinnabar","l":1,"c":22629,"t":54,"p":3}},{"type":"quest","id":"66138","obj":{"i":66138,"n":"The Cutting Edge","g":144,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"66140","obj":{"i":66140,"n":"Old Wisdom, New Ways","g":144,"l":"Ul'dah","s":200,"f":1}}]}