{"quest":{"name":"The Cutting Edge","location":"Ul'dah","id":66138,"patch":2.0,"sort":100,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"genre":144,"usedItems":[5124],"journal":["Adalberta needs you to undertake a task in the name of the Miners' Guild.","The guild has received an order from Amajina & Sons Mineral Concern for ten chunks of obsidian. Procure the requisite number in the vicinity of the Hammers in western Thanalan, and deliver them to Adalberta.","You learn that the fruits of your labors will be utilized in the crafting of macuahuimeh, a type of wooden sword which predates metalworking. Although obsidian is no longer widely used, there are still some who will pay good coin for it. Adalberta encourages you to be aware of the needs of such customers, as the demand for materials with highly specific applications often outstrips supply.<br><br>※The next miner quest will be available from Adalberta upon reaching level 15."],"objectives":["Deliver chunks of obsidian to Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"Ah, there <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is─the rising star of the Miners' Guild!"},{"name":"ADALBERTA","text":"Oh, don't be like that. I'm only teasing! Which is not to say that it isn't <span class=\"emphasis\">true</span>. Heh heh!"},{"name":"ADALBERTA","text":"The fact is, you've been working tirelessly, and you've improved more quickly than I could have hoped. Indeed, I think you're ready to handle a task in the name of the guild."},{"name":"ADALBERTA","text":"As you probably know, we receive orders from various parties, but most come from Amajina & Sons Mineral Concern."},{"name":"ADALBERTA","text":"The Concern actually owns this hall, but they've kindly given us the loan of it. In return, they get first pick of guild talent to work their mines."},{"name":"ADALBERTA","text":"On occasion, they send requests for us to procure less widely used minerals─commodities required in quantities too small to warrant anything beyond an ad hoc arrangement."},{"name":"ADALBERTA","text":"One such request happens to have arrived just now, and I want you to take care of it, <span class=\"highlight\">Forename</span>."},{"name":"ADALBERTA","text":"This time, the Concern needs ten pieces of obsidian, and I'd like you to procure them. You'll have the best luck searching around the Hammers in western Thanalan."},{"name":"ADALBERTA","text":"Remember: it's ten pieces of obsidian we need. You'll have the best luck searching around the Hammers in western Thanalan."},{"name":"ADALBERTA","text":"Oooh, this is some fine obsidian! The Concern will be well pleased."},{"name":"ADALBERTA","text":"In case you're wondering, the spoils of your labor are bound for the Coliseum."},{"name":"ADALBERTA","text":"I'm told there's to be an exhibition featuring ancient arms. One of these is the macuahuitl, a wooden sword with shards of obsidian embedded in its edge."},{"name":"ADALBERTA","text":"Before man learned to work metal, he used various kinds of stone to craft blades for his weapons. Obsidian was among the most coveted, thanks to the razor-sharp edge it could achieve."},{"name":"ADALBERTA","text":"These days, of course, blades are commonly forged of steel, and obsidian has fallen out of favor. But there're still folk out there willing to pay good coin for it, nevertheless."},{"name":"ADALBERTA","text":"As an ambitious young miner, you'd do well to pay attention to such customers. Make the effort to stay abreast of demand, and your efforts will be more richly rewarded."},{"name":"ADALBERTA","text":"You continue to impress with your progress, <span class=\"highlight\">Forename</span>. It's past time you learned how to use a sledgehammer."},{"name":"ADALBERTA","text":"It's a secondary tool we use in conjunction with the pickaxe. Thus equipped, you'll be able to break outcrops of bedrock and get to the precious minerals within."},{"name":"ADALBERTA","text":"Well, what are you waiting for? Go and find a rocky outcrop and give that sledgehammer of yours a swing!"}],"reward":{"gil":289,"items":[{"id":2534},{"id":2658,"one":1},{"id":3771,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":17}],"quests":[66136]},"next":[66139]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"item","id":"2534","obj":{"i":2534,"n":"Bronze Sledgehammer","l":11,"c":38051,"t":29,"p":296}},{"type":"item","id":"2658","obj":{"i":2658,"n":"Straw Hat","l":10,"c":41037,"t":34,"p":226}},{"type":"item","id":"3771","obj":{"i":3771,"n":"Hard Leather Shoes","l":11,"c":46167,"t":38,"p":256}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5124","obj":{"i":5124,"n":"Obsidian","l":5,"c":21452,"t":48,"p":6}},{"type":"quest","id":"66136","obj":{"i":66136,"n":"Know Thy Land","g":144,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"66139","obj":{"i":66139,"n":"Getting in Deep","g":144,"l":"Ul'dah","s":150,"f":1}}]}