{"quest":{"name":"Throw Some Rings on It","location":"Ul'dah","id":66149,"patch":2.0,"sort":100,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"involved":[1004097],"genre":139,"usedItems":[5086],"journal":["Serendipity believes you are ready for a new kind of challenge.","Serendipity has tasked you with your first official commission. Craft a dozen handfuls of copper rings and present them to her for inspection.","In a surprising turn of events, Gigi compliments your craftsmanship, albeit in a tremendously condescending manner. Serendipity bids you deliver the copper rings to the client, a Sultansworn named Robert, who should be waiting just outside the Goldsmiths' Guild.","Robert thanks you for the delivery, and states that the full payment will be delivered to the guild in short order. Relay his words to Serendipity.","Serendipity's eyes light up with joy upon hearing the Sultansworn's words. After regaining her composure, she suggests that you start accepting independent commissions by speaking with Eustace at the Quicksand, as a means of earning gil and building your reputation as a goldsmith.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 15."],"objectives":["Present handfuls of copper rings to Serendipity.","Deliver the copper rings to Robert.","Report to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"I'm so sorry, sir! Please don't─ Oh, it's only you, <span class=\"highlight\">Forename</span>! For a moment there, I thought my heart was about to fail me!"},{"name":"SERENDIPITY","text":"I thought the angry miner had returned. Gigi wasn't pleased with the ore the miner brought in, you see, and he made this sentiment clear...in the only way he knows how. There was mention of the miner's mother and an aldgoat─"},{"name":"SERENDIPITY","text":"A-Ahem! Never mind all that─I have an urgent task for you. We've just received an order for a prodigious quantity of copper rings, and I'd like you to handle it."},{"name":"SERENDIPITY","text":"Now, this is an honest-to-gods commission, <span class=\"highlight\">Forename</span>. You'll have to satisfy a paying customer, not your kind and lovely guildmaster."},{"name":"SERENDIPITY","text":"But I believe that you can do more than simply satisfy. Now, the customer's waiting, so you'd best get started on those copper rings. When they're ready, come and show them to me, just for good measure."},{"name":"SERENDIPITY","text":"So, are the rings ready yet?"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>CoPpEr...RiNgS...eH, i HaVe SeEn WoRsE."},{"name":"SERENDIPITY","text":"Oh, Gigi, must you always be so─"},{"name":"SERENDIPITY","text":"...Wait a minute. Did you just say that you've seen worse?"},{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! That's as good as a compliment, coming from him!"},{"name":"SERENDIPITY","text":"I mean, when you consider what a scathing critic he usually is, perhaps the fact he's not saying anything more insulting is a sign he likes it?"},{"name":"SERENDIPITY","text":"After all, he's called your previous work “utter garbage” and “an affront to the gods themselves.” I half expected him to call these rings abysmal failures!"},{"name":"SERENDIPITY","text":"Oh, I probably should take this opportunity to teach you a thing or two about what you made. Copper rings are...er, rings made out of copper. They can be used to make chains and...er, chainmail! &lt;sigh&gt; You probably already knew all that."},{"name":"SERENDIPITY","text":"Anyway, <span class=\"highlight\">Forename</span>, I would like you to deliver these rings to the client personally. I would handle it myself, but I...I believe it's very important that you learn how to deal with customers firsthand!"},{"name":"SERENDIPITY","text":"The client is a Sultansworn named Robert, who should be waiting outside the guild right about now."},{"name":"SERENDIPITY","text":"I told him he could wait inside, but he said he didn't want to distract the goldsmiths at their work. Not that <span class=\"emphasis\">I</span> would mind a distraction like that..."},{"name":"ROBERT","text":"You're a goldsmith, aren't you? Did Mistress Serendipity send you?"},{"name":"ROBERT","text":"Yes, these shall serve nicely! Keeping the sultana from harm is perilous business, you see, and we Sultansworn can never have enough supplies to keep our equipment in serviceable condition."},{"name":"ROBERT","text":"You may inform Serendipity that she can expect full payment soon...and that I send her my <span class=\"emphasis\">fondest</span> regards."},{"name":"SERENDIPITY","text":"How did it go, <span class=\"highlight\">Forename</span>? What did he say about me─I mean, about your work?"},{"name":"SERENDIPITY","text":"...Oh. Ahem. Anyway, seeing how well your very first commission went, I have high hopes for those to come."},{"name":"SERENDIPITY","text":"In fact, why don't you speak with Eustace down at the Quicksand and see what work is available for a goldsmith?"},{"name":"SERENDIPITY","text":"Yes, I believe you're quite ready to handle commissions independent of my supervision. Take yourself to the Adventurers' Guild, and try taking on a task or two!"},{"name":"ROBERT","text":"Do remember to send Mistress Serendipity my <span class=\"emphasis\">fondest</span> regards. My thanks again for the copper rings."}],"reward":{"gil":289,"items":[{"num":250,"id":4},{"num":200,"id":2},{"id":2392},{"id":2660,"one":1},{"id":3014,"one":1},{"id":3536,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":12}],"quests":[66147]},"next":[66150]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1004097","obj":{"i":1004097,"n":"Robert","l":41,"q":3}},{"type":"item","id":"2392","obj":{"i":2392,"n":"Bronze Chaser Hammer","l":8,"c":35302,"t":18,"p":263}},{"type":"item","id":"2660","obj":{"i":2660,"n":"Amateur's Headgear","l":10,"c":40420,"t":34,"p":283}},{"type":"item","id":"3014","obj":{"i":3014,"n":"Amateur's Kurta","l":9,"c":42233,"t":35,"p":246}},{"type":"item","id":"3536","obj":{"i":3536,"n":"Amateur's Smithing Gloves","l":10,"c":44071,"t":37,"p":252}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"5086","obj":{"i":5086,"n":"Copper Rings","l":4,"c":20912,"t":49}},{"type":"quest","id":"66147","obj":{"i":66147,"n":"Gorgets Rising","g":139,"l":"Ul'dah","s":50,"f":1}},{"type":"quest","id":"66150","obj":{"i":66150,"n":"Objectively Speaking","g":139,"l":"Ul'dah","s":150,"f":1}}]}