{"quest":{"name":"Gorgets Rising","location":"Ul'dah","id":66147,"patch":2.0,"sort":50,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"genre":139,"usedItems":[4305],"journal":["Serendipity has a new task for you.","Your next lesson requires that you craft three copper gorgets, for which you will need several copper ingots. Craft and deliver the gorgets to Serendipity.","Yet again your craftsmanship satisfies Serendipity, and yet again Gigi sees nothing worthy of praise. As a reward for your efforts, the guildmaster gives you a grinding wheel, which will aid you in your future goldsmithing endeavors.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 10."],"objectives":["Deliver copper gorgets to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>! I'm honestly a bit surprised to see you─most newcomers find Gigi's evaluations so harsh that we never hear from them again."},{"name":"SERENDIPITY","text":"I'm so glad that you didn't take him seriously when he said your copper wasn't fit for a chamber pot. I mean, really, it doesn't even make sense─you could make a chamber pot out of <span class=\"emphasis\">anything</span>!"},{"name":"SERENDIPITY","text":"Anyway, I hope you've been working hard, because your next task won't be nearly as easy as the last!"},{"name":"SERENDIPITY","text":"Listen well, <span class=\"highlight\">Forename</span>. I want you to make me three copper gorgets."},{"name":"SERENDIPITY","text":"For this, you'll need copper ingots, which you very conveniently learned to make last time."},{"name":"SERENDIPITY","text":"Now, I directed you to purchase ore from Aistan before, but there are other ways to obtain it."},{"name":"SERENDIPITY","text":"You could dig it up yourself, or perhaps befriend a lonely miner and convince him to share some with you."},{"name":"SERENDIPITY","text":"However you choose to obtain your materials, I'm sure you'll put them to good use."},{"name":"SERENDIPITY","text":"Are the gorgets ready yet, <span class=\"highlight\">Forename</span>? Don't keep me waiting too long!"},{"name":"SERENDIPITY","text":"Hmmm... Well, in my opinion─"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>GoRgEtS...yOuR gOrGeTs ArE gOrGeOuS, gReEnHoRn. Oh WaIt, I mEaNt GrOtEsQuE. uNgOdLy. An AfFrOnT tO tHe GoDs ThEmSeLvEs. FoR sHaMe."},{"name":"SERENDIPITY","text":"Beg your pardon, <span class=\"highlight\">Forename</span>. I'm afraid that constructive criticism isn't one of Gigi's strong points."},{"name":"SERENDIPITY","text":"But where was I? Ah, yes. Your gorgets are well made─strong and functional."},{"name":"SERENDIPITY","text":"And that's the least they should be, as they're meant to protect one's throat."},{"name":"SERENDIPITY","text":"When it comes to basic pieces like these, we don't have much creative freedom. Still, this doesn't mean we should put in less effort─especially since the techniques used to craft simple accessories are the same ones used to craft elaborate ones."},{"name":"SERENDIPITY","text":"Now then, you've learned how to handle your hammer, but there's another tool I'd like you to get acquainted with."},{"name":"SERENDIPITY","text":"With this grinding wheel, you'll find it easier to add the finishing touches when you craft. Try using it, and you'll see what I mean."},{"name":"SERENDIPITY","text":"Keep your nose to that grinding wheel, and you'll be ready for your next challenge in no time at all."},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">craftsmanship</span>, <span class=\"highlight\">control</span>, and <span class=\"highlight\">CP</span> values."},{"name":"SYSTEM","text":"A higher craftsmanship rating hastens the progress of synthesis; greater control increases the chance of creating high-quality items; and additional CP improves your crafting stamina."},{"name":"SYSTEM","text":"Outfitting yourself with an eye to your current objective will increase the efficiency of your crafting endeavors."}],"reward":{"gil":194,"items":[{"num":200,"id":4},{"num":150,"id":2},{"id":2405},{"id":2652,"one":1},{"id":3309,"one":1},{"id":3763,"one":1},{"num":3,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":12}],"quests":[66146]},"next":[66149]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"2405","obj":{"i":2405,"n":"Amateur's Grinding Wheel","l":5,"c":35352,"t":19,"p":151}},{"type":"item","id":"2652","obj":{"i":2652,"n":"Hempen Bandana","l":5,"c":41540,"t":34,"p":85}},{"type":"item","id":"3309","obj":{"i":3309,"n":"Hempen Chausses","l":5,"c":45048,"t":36,"p":94}},{"type":"item","id":"3763","obj":{"i":3763,"n":"Maple Pattens","l":5,"c":46122,"t":38,"p":129}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"4305","obj":{"i":4305,"n":"Copper Gorget","l":8,"c":54801,"t":40,"p":176}},{"type":"quest","id":"66146","obj":{"i":66146,"n":"My First Chaser Hammer","g":139,"l":"Ul'dah","s":11,"f":1}},{"type":"quest","id":"66149","obj":{"i":66149,"n":"Throw Some Rings on It","g":139,"l":"Ul'dah","s":100,"f":1}}]}