{"quest":{"name":"Water from Stone","location":"Ul'dah","id":66141,"patch":2.0,"sort":250,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"genre":144,"usedItems":[5491],"journal":["Adalberta needs you to take on the work of an indisposed guild member.","One of your fellow miners has been taken ill, and Adalberta needs you to procure fifteen bottles of effervescent water in his stead. For your search, she recommends you head to Buscarron's Scar in Gridania's South Shroud. Once you have the required number, deliver them to the guildmaster.","Adalberta thanks you for your timely assistance. Owing to your efforts, the guild can now fulfill an urgent order from a major client. With the guildmaster's praise still ringing in your ears, you continue along your chosen path.<br><br>※The next miner quest will be available from Adalberta upon reaching level 30."],"objectives":["Deliver bottles of effervescent water to Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"<span class=\"highlight\">Forename</span>! You couldn't have come at a better time!"},{"name":"ADALBERTA","text":"One of our number has been taken ill, you see, and I need someone to handle the work assigned to him."},{"name":"ADALBERTA","text":"Tell me, are you familiar with effervescent water? Alchemists use it to make a substance called natron."},{"name":"ADALBERTA","text":"And bakers use natron for leavening─that is, raising dough."},{"name":"ADALBERTA","text":"Without it, there'd be no ginger cookies, crumpets, blood currant tarts..."},{"name":"ADALBERTA","text":"...Ahem. As you may have gathered, I'm fond of the odd sweet or three."},{"name":"ADALBERTA","text":"'Course, effervescent water's good for more than just baking. A lot of miners ask for a drop of it in their drinks─makes the stronger stuff that bit more refreshing, see."},{"name":"ADALBERTA","text":"And let me tell you, there's nothing better to wash away the dust of a hard day's mining."},{"name":"ADALBERTA","text":"But you didn't come here to hear my thoughts on food and drink, you came here to learn about mining. And so you shall─by procuring some effervescent water for me."},{"name":"ADALBERTA","text":"The Alchemists' Guild needs fifteen bottles of the stuff, and <span class=\"emphasis\">urgently</span>─they couldn't stress that enough."},{"name":"ADALBERTA","text":"From what I can make out, they themselves are scrambling to fulfill an urgent order for natron from the Bismarck in Limsa Lominsa. It's one of Eorzea's finest restaurants, in case you didn't know."},{"name":"ADALBERTA","text":"Anyway, you'd best get going. You'll need to work fast to make up for all the time I wasted chattering about sweets and grog. Oh, and you'll have the best luck mining around Buscarron's Scar, over in the Black Shroud."},{"name":"ADALBERTA","text":"Fifteen bottles of effervescent water, quick as you can. And remember, you're like to find it in Buscarron's Scar, over in Gridania's South Shroud."},{"name":"ADALBERTA","text":"Right in the nick of time! My thanks, <span class=\"highlight\">Forename</span>!"},{"name":"ADALBERTA","text":"I'll see to it that these are sent over immediately. Ah, but before I do, I should probably expand a bit on what we were talking about earlier..."},{"name":"ADALBERTA","text":"Specifically, the part about mixing spirits with effervescent water... See, I wasn't lying when I told you a lot of folk find the combination refreshing. It <span class=\"emphasis\">is</span> refreshing. In fact, adding a bit of bubbly water makes the stuff go down so easily, you have to be careful not to drink yourself under the table."},{"name":"ADALBERTA","text":"I say this partly for your own good...and partly because the lad whose task you just took care of <span class=\"emphasis\">wasn't</span> careful."},{"name":"ADALBERTA","text":"Daft sod threw up right where you're standing. Oh, but it didn't end there..."},{"name":"ADALBERTA","text":"He then slipped in his own puke and split his head open on the bar on his way down. Suffice it to say, he won't be working for a while."},{"name":"ADALBERTA","text":"Thankfully, you took up the slack, and all is well with the guild once more. I could do with a few more like you, <span class=\"highlight\">Forename</span>. Keep up the good work, you hear?"}],"reward":{"gil":557,"items":[{"id":2538},{"id":3092,"one":1},{"id":3351,"one":1},{"id":3578,"one":1},{"id":3810,"one":1},{"num":4,"id":5825,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":17}],"quests":[66140]},"next":[66142]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"item","id":"2538","obj":{"i":2538,"n":"Novice's Sledgehammer","l":27,"c":38052,"t":29}},{"type":"item","id":"3092","obj":{"i":3092,"n":"Velveteen Coatee of Gathering","l":27,"c":42198,"t":35,"p":1812}},{"type":"item","id":"3351","obj":{"i":3351,"n":"Velveteen Sarouel of Gathering","l":25,"c":45178,"t":36,"p":1099}},{"type":"item","id":"3578","obj":{"i":3578,"n":"Fingerless Goatskin Gloves of Gathering","l":25,"c":44062,"t":37,"p":1282}},{"type":"item","id":"3810","obj":{"i":3810,"n":"Goatskin Crakows of Gathering","l":25,"c":46156,"t":38,"p":1172}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5491","obj":{"i":5491,"n":"Effervescent Water","l":11,"c":22614,"t":54}},{"type":"quest","id":"66140","obj":{"i":66140,"n":"Old Wisdom, New Ways","g":144,"l":"Ul'dah","s":200,"f":1}},{"type":"quest","id":"66142","obj":{"i":66142,"n":"Obsidian Race","g":144,"l":"Ul'dah","s":300,"f":1}}]}