{"quest":{"name":"My First Chaser Hammer","location":"Ul'dah","id":66146,"patch":2.0,"sort":11,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"genre":139,"usedItems":[5062],"journal":["Serendipity would like to officially begin your training as a goldsmith.","For your first lesson, the guildmaster bids you craft for her a single copper ingot. If needed, you may purchase the copper ore from Aistan, though wind shards must be obtained elsewhere.","Although Serendipity is pleased with your copper ingot, her assistant, Gigi, declares it unfit to bear night soil. Nevertheless, the guildmaster declares that you have talent, and that you should return once you have gained more experience.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 5."],"objectives":["Deliver a copper ingot to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"Great, let's get started! Though to be honest, I'd swear you've done this before by the way you wear that hammer on your hip."},{"name":"SERENDIPITY","text":"Mind you, even if you <span class=\"emphasis\">do</span> have some experience, a <span class=\"emphasis\">responsible</span> guildmaster must ensure that her charges have a firm grasp of the fundamentals. Therefore, I command you to craft me a copper ingot!"},{"name":"SERENDIPITY","text":"It's simple, really─all you need is copper ore and a wind shard."},{"name":"SERENDIPITY","text":"Our guild supplier, Aistan, can supply you with copper ore. And I gave you a few wind shards along with your hammer. At least, I think I did. If it turns out you don't have any, you'll need to get some yourself."},{"name":"SERENDIPITY","text":"Isn't this exciting, <span class=\"highlight\">Forename</span>? Your first real challenge as a member of the Goldsmiths' Guild! Show me the ingot when you're done. Good luck!"},{"name":"SYSTEM","text":"To synthesize a copper ingot for Serendipity, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>."},{"name":"SERENDIPITY","text":"A farewell to cut tags."},{"name":"SERENDIPITY","text":"Oh, did you forget what materials you need? Aistan over there can sell you copper ore, but I'm afraid he doesn't stock wind shards. Don't think too hard, <span class=\"highlight\">Forename</span>. Just give it a try and see what happens!"},{"name":"SERENDIPITY","text":"Hmmm... You know, I think this is quite─"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>GIGIGI☆...BZZZT."},{"name":"GIGI","text":"UtTeR gArBaGe. ThE wOrSt. NoT eVeN fIt FoR mAkInG a ChAmBeR pOt."},{"name":"SERENDIPITY","text":"Quiet, Gigi! <span class=\"emphasis\">I'm</span> the guildmaster. <span class=\"emphasis\">I</span> get to decide what's fit for a chamber pot!"},{"name":"SERENDIPITY","text":"Ahem, please excuse me! He gets a bit overzealous at times."},{"name":"SERENDIPITY","text":"Gigi is my assistant, but he has a habit of butting in with his opinions."},{"name":"SERENDIPITY","text":"Most mammets are rather simple, capable of no more than rudimentary speech. They can be relied upon for menial tasks, but little else."},{"name":"SERENDIPITY","text":"Gigi, on the other hand, is quite intelligent. And quite <span class=\"emphasis\">stubborn</span>, I might add."},{"name":"SERENDIPITY","text":"I suspect that's due to his age. He's been with the guild for an <span class=\"emphasis\">eternity</span>, ever attending each guildmaster. But recently, he's been coming and going as he pleases."},{"name":"SERENDIPITY","text":"NE※GIGIGI★※...<br>KnEeL bEfOrE GiGi, ThE oNe TrUe GuIlDmAsTeR. rEsPeCt My AuThOrItY, iGnOrAnT mOrTaL, oR sUfFeR mY wRaTh!"},{"name":"SERENDIPITY","text":"&lt;sigh&gt; It's like this <span class=\"emphasis\">every</span> day, <span class=\"highlight\">Forename</span>. I'm afraid the experience he's accumulated over a century of assisting guildmasters has made him arrogant."},{"name":"SERENDIPITY","text":"It's quite intimidating, really. I may be the guildmaster, but he's like a walking, talking archive of all knowledge to do with our craft."},{"name":"SERENDIPITY","text":"Oh! I completely forgot about your ingot! Sorry, sorry..."},{"name":"SERENDIPITY","text":"As I was about to say, I think this is very, very good for a beginner! It's reasonably pure and well formed."},{"name":"SERENDIPITY","text":"I daresay you've got a knack for this, <span class=\"highlight\">Forename</span>. What you need now is <span class=\"emphasis\">practice</span>."},{"name":"SERENDIPITY","text":"So keep practicing with your hammer, and come back here when you've gotten more comfortable using it."},{"name":"SERENDIPITY","text":"NE※GIGIGI★※...<br>BuGgEr OfF, gReEnHoRn."},{"name":"SYSTEM","text":"The next goldsmith quest will be available from Serendipity upon reaching level 5."}],"reward":{"items":[{"num":150,"id":4},{"num":100,"id":2},{"num":30,"id":5106},{"id":2961}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":12}],"quests":[66144]},"next":[66147]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"5106","obj":{"i":5106,"n":"Copper Ore","l":1,"c":21209,"t":48,"p":2}},{"type":"item","id":"2961","obj":{"i":2961,"n":"Hempen Kurta","l":1,"c":42233,"t":35}},{"type":"item","id":"5062","obj":{"i":5062,"n":"Copper Ingot","l":1,"c":20813,"t":49,"p":9}},{"type":"quest","id":"66144","obj":{"i":66144,"n":"Way of the Goldsmith","g":139,"l":"Ul'dah","s":10,"f":1}},{"type":"quest","id":"66147","obj":{"i":66147,"n":"Gorgets Rising","g":139,"l":"Ul'dah","s":50,"f":1}}]}