{"quest":{"name":"Obsidian Race","location":"Ul'dah","id":66142,"patch":2.0,"sort":300,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"involved":[1003910,1003911],"genre":144,"usedItems":[5125],"journal":["Adalberta has a mind to assign you a challenging commission.","You learn that the guild has received an order for a quantity of wyvern obsidian, an extremely rare mineral. Conscious of the difficulty you are like to encounter in procuring it, Adalberta has accepted another miner's offer of assistance, and would have the two of you work together. Seek out the miner in question─one Wide Gulley─and discuss the task at hand.","To your dismay, Wide Gulley greets you with open hostility. He has no intention of cooperating with you, and instead proposes a contest to see who can procure superior-quality wyvern obsidian. In light of your relative inexperience, Wide Gulley offers you all the time you require, and even suggests that you consult the client, Hrodger, should you require more information on the mineral.","Hrodger tells you that deposits of wyvern obsidian have previously been discovered around Thal's Respite. In addition, he reveals that Wide Gulley is in fact Vice Foreman Deep Canyon's son, and a miner of tremendous talent in his own right. Armed with this information, procure fifteen chunks of the purest wyvern obsidian you can find, and deliver them to Wide Gulley.","After examining the fruits of your labors, Wide Gulley grudgingly concedes that your wyvern obsidian is purer than his own. Brooking no argument, he tells you that he will deliver your haul to Hrodger, and bids you report back to the guildmaster.","Adalberta is troubled to learn that Wide Gulley turned an already difficult task into a contest. Upon hearing that you <span class=\"emphasis\">bested</span> him, however, her dismay swiftly gives way to astonishment. She proceeds to lavish you with praise, even confessing to a hint of envy, and encourages you to continue exceeding expectations.<br><br>※The next miner quest will be available from Adalberta upon reaching level 35."],"objectives":["Speak with Wide Gulley.","Speak with Hrodger.","Deliver chunks of wyvern obsidian to Wide Gulley.","Report to Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"Ah, <span class=\"highlight\">Forename</span>. Just the person. I was about to send for you."},{"name":"ADALBERTA","text":"There's an order I want your help with, see. It comes from the Gladiators' Guild, via the vice foreman himself."},{"name":"ADALBERTA","text":"You recall the time I had you procure obsidian? Well, this time I need you to find <span class=\"emphasis\">wyvern</span> obsidian, which is a good deal rarer."},{"name":"ADALBERTA","text":"How rare, you ask? Hm. Let's just say I've handled the stuff no more than a dozen times in my life."},{"name":"ADALBERTA","text":"So, yes, it'll be a bugger to find. But don't worry─you won't be working alone."},{"name":"ADALBERTA","text":"It just so happens that one of your guildmates has volunteered for the task."},{"name":"ADALBERTA","text":"And considering how difficult it's like to be, I've decided to have the two of you work together."},{"name":"ADALBERTA","text":"Your partner's name is Wide Gulley, and he's waiting for you on the far side of the stage. Go over and introduce yourself, and he'll tell you everything you need to know. Run along, now. Oh, and good luck!"},{"name":"WIDEGULLEY","text":"You must be <span class=\"highlight\">Forename</span>, the guildmaster's pet. Aye, I've heard much an' more about <span class=\"emphasis\">you</span>."},{"name":"WIDEGULLEY","text":"They tell me you've got talent. Trouble is, you're an <span class=\"emphasis\">adventurer</span>, an' anyone with an onze of sense knows adventurers can't be trusted. Adalberta's sorely mistaken if she thinks you're any different."},{"name":"WIDEGULLEY","text":"Likewise, she's sorely mistaken if she thinks I'm gonna help you find fifteen chunks of wyvern obsidian. I'd sooner fall on my own pickaxe than see you take the credit for my hard work."},{"name":"WIDEGULLEY","text":"That said, I'm not about to risk gettin' kicked out of the guild for disobeyin' a direct order. Luckily, there're other ways to handle this. What do you say to a contest?"},{"name":"WIDEGULLEY","text":"It's nigh on as good as cooperatin', an' so long as the client gets what he wants, Adalberta won't have cause to complain, will she?"},{"name":"WIDEGULLEY","text":"So here's the deal: we mine for wyvern obsidian separately, an' whoever brings back the better haul─that's to say, the <span class=\"emphasis\">purer</span> haul─is the winner. Simple, yes?"},{"name":"WIDEGULLEY","text":"Now, we both know I've been doin' this a lot longer'n you, an' I won't have it said that I trounced a novice..."},{"name":"WIDEGULLEY","text":"So, to make this more interestin', I'll give as long as you want.<br>...For all the good it'll do you."},{"name":"WIDEGULLEY","text":"Oh, an' you can even go an' talk to the client if you like. His name's Hrodger, an' you'll find him outside the Gladiators' Guild. Might be as he can tell you somethin' useful."},{"name":"HRODGER","text":"Aye, I'm Hrodger. What can I do for you?"},{"name":"HRODGER","text":"Got yourself into a contest with Wide Gulley, you say? Oof! I don't envy you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mate</span></span>..."},{"name":"HRODGER","text":"I don't know much about mining myself, but I <span class=\"emphasis\">do</span> know that Wide Gulley is good at his job."},{"name":"HRODGER","text":"You can't be Deep Canyon's son without knowing a thing or two about being a miner."},{"name":"HRODGER","text":"Anyway, I've no idea whose idea this contest of yours was, but if it means I get goods of better quality, you won't hear any complaints from me."},{"name":"HRODGER","text":"Now, you wanted to ask me about wyvern obsidian, didn't you? Well, I'll tell you what little I know, but remember: I'm a gladiator, not a miner."},{"name":"HRODGER","text":"Saying that, I haven't graced the bloodsands for a while. Took a nasty blow to the knee, you see. Rest assured, the fellow that dealt it got far worse."},{"name":"HRODGER","text":"Anyway, I'm all mended and ready to make my return, and I want it to be glorious─something that'll be sung by the bards."},{"name":"HRODGER","text":"So I thought a shiny new sword was in order, and there's nothing like a plumed oak macuahuitl to draw a crowd."},{"name":"HRODGER","text":"Why? Because it doesn't have a single piece of metal in it! Macuahuimeh don't as a rule."},{"name":"HRODGER","text":"Aye...not a speck of metal, but if you wield it right, the shards of wyvern obsidian embedded in the blade will cut armor like a hot knife through butter. Ah, but I'm rambling. You wanted to know where to find the stuff, not what I plan to do with it."},{"name":"HRODGER","text":"Hmmm...I vaguely recall a conversation I had with a miner a while back. We were talking about macuahuimeh─ Oh, did I mention that's what you call more than one macuahuitl? Well, it is. Uh, where was I? Ah, yes─we were chatting about macuahuimeh, and the fellow said that he'd previously dug up wyvern obsidian around Thal's Respite in eastern Thanalan. And that's all I know. Hope it helps!"},{"name":"WIDEGULLEY","text":"What's the matter? Don't tell me you're havin' trouble findin' a paltry fifteen chunks of wyvern obsidian."},{"name":"WIDEGULLEY","text":"Oh? Managed to scrape together the required amount, did you? Well then, let's see your sorry specimens, just for the sake of formali─ &lt;gasp&gt; Bugger me!"},{"name":"WIDEGULLEY","text":"They're black as night! This is some of the purest stuff I've ever seen..."},{"name":"WIDEGULLEY","text":"How in the seven hells did you find these!? You, a mere adventurer!"},{"name":"WIDEGULLEY","text":"Grrr... I'm loath to admit it, but your obsidian's superior to mine."},{"name":"WIDEGULLEY","text":"Well, it might be as you've bested me on quality, but there's more to bein' a miner than that."},{"name":"WIDEGULLEY","text":"You need to be able to give the client what he wants, when he wants it. In other words, you need speed─without it, quality counts for naught."},{"name":"WIDEGULLEY","text":"I was by far the faster man, so we'll call it a draw. But mark my words, I'll best you next time, both on speed <span class=\"emphasis\">and</span> quality."},{"name":"WIDEGULLEY","text":"I'll see to it the obsidian gets to Hrodger. In the meantime, why don't you go an' tell the guildmaster all about it. I care not what you say."},{"name":"ADALBERTA","text":"Ah, <span class=\"highlight\">Forename</span>! How did you find working with Wide Gulley? ...What? He challenged you to a <span class=\"emphasis\">contest</span>? As if the task weren't difficult enough!"},{"name":"ADALBERTA","text":"I'm terribly sorry, <span class=\"highlight\">Forename</span>. That was hardly fair of him. He's a born miner."},{"name":"ADALBERTA","text":"...What's that? You <span class=\"emphasis\">beat</span> him? Truly!? But he's one of the guild's very best! Well done, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">my lad</span></span>!"},{"name":"ADALBERTA","text":"Eh? He claimed he was faster, did he? Well, speed <span class=\"emphasis\">is</span> important. But Wide Gulley set the rules, and by those rules, you won, fair and square."},{"name":"ADALBERTA","text":"You've come a long way, <span class=\"highlight\">Forename</span>. A long way. You make me proud to be your mentor."},{"name":"ADALBERTA","text":"At the same time, though, I must admit that the miner in me can't help feeling some envy. But it's that which keeps a veteran like me on my toes─lights a fire in my belly."},{"name":"ADALBERTA","text":"And I wouldn't have it any other way. Keep doing what you're doing, <span class=\"highlight\">Forename</span>, and I'll do my damndest to keep up! Ha ha ha!"},{"name":"WIDEGULLEY","text":"Take all the time you want. You can even try talkin' to Hrodger, though I doubt he'll be of any help."},{"name":"HRODGER","text":"You still here? Listen, I don't mind you having this little contest, but I'd like my wyvern obsidian <span class=\"emphasis\">before</span> my next bout, if it's all the same to you."}],"reward":{"gil":639,"items":[{"id":2526},{"id":2758,"one":1},{"id":3369,"one":1},{"id":3601,"one":1},{"id":3829,"one":1},{"num":3,"id":5825,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":17}],"quests":[66141]},"next":[66179]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003910","obj":{"i":1003910,"n":"Wide Gulley","l":41,"q":5}},{"type":"npc","id":"1003911","obj":{"i":1003911,"n":"Hrodger","l":41,"q":1}},{"type":"item","id":"2526","obj":{"i":2526,"n":"Steel Pickaxe","l":29,"c":38006,"t":28,"p":2718}},{"type":"item","id":"2758","obj":{"i":2758,"n":"Steel Goggles","l":31,"c":40902,"t":34,"p":2539}},{"type":"item","id":"3369","obj":{"i":3369,"n":"Toadskin Culottes","l":30,"c":45281,"t":36,"p":2403}},{"type":"item","id":"3601","obj":{"i":3601,"n":"Velveteen Work Gloves","l":30,"c":44160,"t":37,"p":2242}},{"type":"item","id":"3829","obj":{"i":3829,"n":"Toadskin Workboots","l":30,"c":46146,"t":38,"p":2563}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5125","obj":{"i":5125,"n":"Wyvern Obsidian","l":30,"c":21467,"t":48}},{"type":"quest","id":"66141","obj":{"i":66141,"n":"Water from Stone","g":144,"l":"Ul'dah","s":250,"f":1}},{"type":"quest","id":"66179","obj":{"i":66179,"n":"Amethysts Are Forever","g":144,"l":"Ul'dah","s":350,"f":1}}]}