{"quest":{"name":"A Melding of the Minds","location":"Ul'dah","id":66151,"patch":2.0,"sort":200,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"genre":139,"usedItems":[2111],"journal":["Serendipity would like to resume giving you proper lessons.","Brushing aside the loss of her precious apple tart, the guildmaster decides to give you your first proper lesson since the past two commissions. Craft a staghorn staff, enhance it with a single materia of any type, then present it to Serendipity for inspection.","Though she is forced to correct Gigi's apparent misconceptions about materia, it appears both the guildmaster and her assistant approve of your latest creation.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 25."],"objectives":["Deliver a materia-enhanced staghorn staff to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! Oh gods, you should've seen it. It was glorious!"},{"name":"SERENDIPITY","text":"A golden brown apple tart, freshly baked by a Bismarck-trained chef! I was saving it for an afternoon snack, but the moment I turned my back..."},{"name":"SERENDIPITY","text":"That little terror ate it─<span class=\"emphasis\">Gigi</span> ate it! Mammets can't even <span class=\"emphasis\">taste</span> food! And then he had the nerve to criticize my diet, saying it would “lead to further deviation from conventional standards of beauty”! Gods, I just..."},{"name":"SERENDIPITY","text":"&lt;sigh&gt; Pardon my outburst. That's not why you're here. Keeping your skills sharp, I trust? You know, it occurs to me that the past two tasks I gave you weren't proper lessons. How about I teach you something new?"},{"name":"SERENDIPITY","text":"What do you know about materia? Wait, don't answer that. Even if you're familiar with it, 'tis my duty as guildmaster to instruct you in its applications to our craft."},{"name":"SERENDIPITY","text":"So let's review the basics: materia are special crystals you can use to enhance the properties of items."},{"name":"SERENDIPITY","text":"Now, attaching these crystals requires an artisan's touch. So for this lesson, I want you to attach materia to an item."},{"name":"SERENDIPITY","text":"Not any item, mind you, but a staghorn staff, which I would have you craft yourself. This particular staff may prove difficult to construct, if only because the requisite horns must be cut from antelopes, which are not native to Thanalan."},{"name":"SERENDIPITY","text":"If you wish to purchase some, you might have some luck searching over at the Sapphire Avenue Exchange. If that doesn't yield what you seek, a trip to Gridania may be in order."},{"name":"SERENDIPITY","text":"There're numerous types of materia out there, but it's entirely up to you what you use. I'm only concerned with your ability to attach it, after all."},{"name":"SERENDIPITY","text":"Oh, and I almost forgot the most important part! If all this talk of materia makes absolutely no sense, you could go to central Thanalan and learn from Master Mutamix himself! Though, to be honest, I didn't understand a word he said..."},{"name":"SERENDIPITY","text":"No questions? Splendid! Off you go, <span class=\"highlight\">Forename</span>!"},{"name":"SERENDIPITY","text":"How goes your endeavor to attach materia, <span class=\"highlight\">Forename</span>?"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>ThE cRyStAlLiZeD eSsEnCe Of PaSt ExPeRiEnCe...So EaSiLy InHeRiTeD..."},{"name":"GIGI","text":"ThIs Is AlL rAtHeR sIlLy! WoUlD iT nOt Be MoRe SiMpLe To AtTaCh MaTeRiA dIrEcTlY tO sElF? gIgI wOuLd Be GlAd To TrY iNsErTiNg CrYsTaLs InTo GrEeNhOrN's SkUlL!"},{"name":"SERENDIPITY","text":"No! Bad Gigi! That <span class=\"emphasis\">isn't</span> how materia works! Oh, please don't misunderstand him, <span class=\"highlight\">Forename</span>. I'm certain that he means well."},{"name":"SERENDIPITY","text":"As for your staff...it's very well made, and the materia is perfectly melded. Nicely done."},{"name":"SERENDIPITY","text":"Perhaps you're wondering who would prefer a staff with a headpiece of bone over one studded with jewels. Well, the thaumaturges favor such equipment."},{"name":"SERENDIPITY","text":"Fangs and horns are the weapons of beasts, used to kill and defend. Few materials are better suited than these for channeling the dark arts, or so I understand."},{"name":"SERENDIPITY","text":"I'm the furthest thing there is from a trained thaumaturge, but even I can sense the arcane magicks residing within this staff."},{"name":"SERENDIPITY","text":"Anyway, I trust you've learned something today about the importance of searching the markets and about how to handle materia. I hope this knowledge serves you well in your future endeavors."}],"reward":{"gil":470,"items":[{"id":2395},{"id":2714,"one":1},{"id":3562,"one":1},{"id":3336,"one":1},{"num":4,"id":5824,"one":1}],"xp":28420},"reqs":{"jobs":[{"lvl":20,"id":12}],"quests":[66150]},"next":[66152]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"2395","obj":{"i":2395,"n":"Iron Chaser Hammer","l":18,"c":35303,"t":18,"p":725}},{"type":"item","id":"2714","obj":{"i":2714,"n":"Initiate's Headgear","l":20,"c":40421,"t":34,"p":708}},{"type":"item","id":"3562","obj":{"i":3562,"n":"Initiate's Gloves","l":20,"c":44001,"t":37,"p":630}},{"type":"item","id":"3336","obj":{"i":3336,"n":"Cotton Breeches of Crafting","l":19,"c":45038,"t":36,"p":499}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"2111","obj":{"i":2111,"n":"Staghorn Staff","l":20,"c":33003,"t":7,"p":1170}},{"type":"quest","id":"66150","obj":{"i":66150,"n":"Objectively Speaking","g":139,"l":"Ul'dah","s":150,"f":1}},{"type":"quest","id":"66152","obj":{"i":66152,"n":"Or Ever the Silver Cord Be Loosed","g":139,"l":"Ul'dah","s":250,"f":1}}]}