{"quest":{"name":"A Proper Burial","location":"Eastern Thanalan","id":66156,"patch":2.0,"sort":100,"eventIcon":71201,"issuer":1003929,"target":1003929,"involved":[1003969,1005136],"genre":1,"journal":["Isembard would like you to learn what you can from the clergy.","Isembard has asked that you visit the Church of Saint Adama Landama to inter a corpse he has prepared for burial, and to speak to the priests about the missing commonfolk. Seek out Marques in the lichyard.","Marques has directed you to an empty grave atop the nearby ridge. Bear the embalmed corpse to the gravesite.","You have gently placed the embalmed body at the foot of the grave. Perform one final duty for the deceased and provide him a proper burial.","You have interred the dearly departed as Isembard requested. Return to Marques and tell him the deed is done.","Marques admits to knowing little of the commonfolk. He suggests you speak to Sister Ourcen within the church.","Sister Ourcen informs you that while the commonfolk confide a great many things in her, she has not heard anything that might help your investigation. Return to Camp Drybone and speak to Isembard once more.","Upon your return to Isembard at Camp Drybone, the ever-dashing Thancred appears to greet you. To Isembard's dismay, he suspects that the only person who could take the vigilant commonfolk by surprise is the very Sister Ourcen who takes their confession. Isembard, however, is not so easily convinced."],"objectives":["Speak with Marques outside the Church of Saint Adama Landama.","Lay the embalmed corpse at the gravesite.","Bury the embalmed corpse.","Report back to Marques.","Speak with Sister Ourcen.","Speak with Isembard at Camp Drybone."],"dialogue":[{"name":"ISEMBARD","text":"If we would know what the commonfolk speak of to their gods, we've no better place to ask than at the Church of Saint Adama Landama. It is a small and humble church, found to the northwest of here."},{"name":"ISEMBARD","text":"And so long as you are headed there...might I ask you to deliver this embalmed corpse? A morbid request, I grant you, but it must be borne to burial, and I trust none more than you to see it done."},{"name":"ISEMBARD","text":"Seek out a man named Marques─he tends the graves of the lichyard. He will tell you where the body is to be interred."},{"name":"MARQUEZ","text":"I am Marques, yes. A body? Of course...<br>There...there have been...so many bodies of late..."},{"name":"MARQUEZ","text":"I... I apologize, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. If you seek a place of burial, then there is an empty grave atop the ridge. Take the path and lay him to rest there."},{"name":"MARQUEZ","text":"Bury him well and give his soul peace. Then we will talk."},{"name":"MARQUEZ","text":"Did you bury him? You must pack the earth tight, or they will come... The mongrels will come and defile the body..."},{"name":"MARQUEZ","text":"May they all walk in Thal's realm...<br>...What? Missing people? I...I'm afraid I cannot help you."},{"name":"MARQUEZ","text":"But maybe Sister Ourcen can. She has been kind to me. Everyone...everyone has been so kind."},{"name":"MARQUEZ","text":"I don't know why, though. I...<br>Pardon me. You will find Sister Ourcen within the church walls."},{"name":"MARQUEZ","text":"It's all wrong. I...I should have..."},{"name":"OURCEN","text":"I hear you have done us the service of burying a fallen soul. Please accept our gratitude, and extend it to Isembard when next you see him."},{"name":"OURCEN","text":"Hm? You seek knowledge of missing Drybone inhabitants? It is true I am closer to the people than any other of the Order. I confide in them, and they in me. When they wish to speak to their keeper, Thal, I am the medium through which they do."},{"name":"OURCEN","text":"Should I learn anything pertinent, I will be sure to share the information with you. &lt;sigh&gt; I only wish Marques would be more helpful in the matter. I pray he did nothing to offend. He saw...terrible things during the Calamity... His scars run deep. Indeed, he seems to now prefer the company of the dead over the living."},{"name":"OURCEN","text":"While tragic, I fear such behavior ill befits the church. I received word not long ago that one of our recent visitors─a man called Thancred, I believe─took offense at his conduct. I must have words with Marques, and soon."},{"name":"OURCEN","text":"Please extend my gratitude to Isembard on behalf of the Order."},{"name":"ISEMBARD","text":"Thank you, <span class=\"highlight\">Forename</span>. A burial is no easy thing─even when the departed is a stranger. Were you able to learn aught of the missing commonfolk?"},{"name":"THANCRED","text":"You've been keeping yourself rather busy of late, haven't you, <span class=\"highlight\">Forename</span>?"},{"name":"THANCRED","text":"A pleasure, my dear Isembard. The name is Thancred, and I share a passion with you and our mutual friend here for learning what has become of these missing persons and why."},{"name":"THANCRED","text":"I, too, spoke with Ungust─more times than I care to count. There seems to be some truth to this notion of the commonfolk speaking their secrets only to those in service to the gods."},{"name":"THANCRED","text":"Prostration, prayer, penance. Abject deeds done behind closed doors, away from prying eyes. Who better to take the pious unawares than she who takes confession─the good Sister Ourcen herself?"},{"name":"ISEMBARD","text":"Ourcen!? She wouldn't... She <span class=\"emphasis\">couldn't</span>!"},{"name":"THANCRED","text":"Even the most beautiful roses have thorns, my friend. And you would be wise to keep an eye to <span class=\"emphasis\">this</span> rose."},{"name":"THANCRED","text":"Still, the lichkeeper Marques... I'd swear to the Twelve I've seen that face elsewhere before..."}],"reward":{"items":[{"id":3039,"one":1},{"id":27666,"one":1},{"num":5,"id":5825,"one":1}],"xp":7560},"reqs":{"jobs":[{"lvl":18,"id":130}],"quests":[66155]},"next":[66157,66167]},"partials":[{"type":"npc","id":"1003929","obj":{"i":1003929,"n":"Isembard","l":44,"q":8}},{"type":"npc","id":"1003969","obj":{"i":1003969,"n":"Ourcen","l":44,"q":1}},{"type":"npc","id":"1005136","obj":{"i":1005136,"n":"Marques","l":44,"q":1}},{"type":"item","id":"3039","obj":{"i":3039,"n":"Cotton Acton","l":18,"c":43014,"t":35,"p":752}},{"type":"item","id":"27666","obj":{"i":27666,"n":"Altered Cotton Dalmatica","l":18,"c":42657,"t":35}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66155","obj":{"i":66155,"n":"What Poor People Think","g":1,"l":"Eastern Thanalan","s":99}},{"type":"quest","id":"66157","obj":{"i":66157,"n":"For the Children","g":1,"l":"Eastern Thanalan","s":101}},{"type":"quest","id":"66167","obj":{"i":66167,"n":"Steaking Claims","g":93,"l":"Eastern Thanalan","s":190}}]}