{"quest":{"name":"Serendipity Now","location":"Ul'dah","id":66153,"patch":2.0,"sort":300,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"involved":[1004098],"genre":139,"usedItems":[4218],"journal":["Serendipity needs your help to resolve an unfortunate situation.","A meeting between Serendipity and a traveling merchant was rudely interrupted by Gigi, who drove off the man with his usual scathing insults. In order to make amends with the merchant, Serendipity would like to gift him a pair of high-quality malachite earrings. Craft and present them to the guildmaster for inspection.","The guildmaster is deeply impressed by the quality of your craftsmanship. Hopeful that the offended merchant will feel similarly, Serendipity asks you to track down Roroton in the Ruby Road Exchange and present the earrings to him.","Roroton marks you as an exemplary artisan, and considers the events leading to your meeting to be a blessing in disguise. He bids you deliver his card and a message to Serendipity.","Serendipity is delighted by the tidings. She believes that the merchant was swayed by your gift for goldsmithing, and tells you to work hard in preparation for when Roroton requests your services once more.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 35."],"objectives":["Present a pair of malachite earrings <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Serendipity.","Deliver the malachite earrings <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Roroton.","Report to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! Something awful has happened!"},{"name":"SERENDIPITY","text":"It's Gigi. Instead of behaving better, he's acting even worse!"},{"name":"SERENDIPITY","text":"A traveling merchant was here not a bell ago to discuss a potential contract with us. In the midst of negotiations, Gigi commented on the man's jewelry, claiming “such tawdry baubles are beneath even a Lominsan whore.” Unsurprisingly, the man became quite upset and stormed off."},{"name":"SERENDIPITY","text":"Our members understand that Gigi can be a harsh critic, but this foreign gentleman Roroton was visiting us for the first time."},{"name":"SERENDIPITY","text":"Aye, if it were a guild member, we might have overlooked the incident, but he was a potential business partner! Gods, this is a disaster for the guild."},{"name":"SERENDIPITY","text":"We must make it up to him. Can you help me, <span class=\"highlight\">Forename</span>?"},{"name":"SERENDIPITY","text":"Before Gigi offended him, we were discussing a bulk order of malachite earrings. By way of an apology, I'd like to gift Roroton a pair of these─the finest we can craft. If the gods are good, he will forgive us for the incident."},{"name":"SERENDIPITY","text":"You're one of our best, so I'd like you to craft the earrings. When they are ready, please present them to me for inspection."},{"name":"SERENDIPITY","text":"Are the earrings ready yet?"},{"name":"SERENDIPITY","text":"Such rich, vibrant greens... Even I couldn't have done a better job of cutting the stones."},{"name":"SERENDIPITY","text":"Despite being relatively commonplace, malachite is quite sought after, owing to its supposed power to ward off evil. Pieces bearing swirls that resemble an eye are especially popular."},{"name":"SERENDIPITY","text":"Superstitions notwithstanding, it does indeed have some mild thaumaturgical properties."},{"name":"SERENDIPITY","text":"I must say, I think you've really outdone yourself, <span class=\"highlight\">Forename</span>. I pray that Roroton will feel the same..."},{"name":"SERENDIPITY","text":"Much as I would like to apologize in person, I'm not sure he would be willing to hear me out, so I would like you to deliver the earrings."},{"name":"SERENDIPITY","text":"Before he left, Roroton mentioned that he had other business to conduct at the Ruby Road Exchange. Chances are you'll find him there."},{"name":"ROROTON","text":"Oh gods, not a guild goldsmith. Let me make myself clear─I just wanted to discuss a potential partnership. I do not know what I have done to offend your guildmaster and her...assistant, but I understand that I am no longer welcome. Now please, leave me in peace."},{"name":"ROROTON","text":"Really now, I don't want to hear it. Just leave me─"},{"name":"ROROTON","text":"By the Twelve, I've never seen such fine craftsmanship!"},{"name":"ROROTON","text":"...From Mistress Serendipity? I'm speechless. I never imagined the guildmaster would go so far as to personally craft─"},{"name":"ROROTON","text":"Wait, <span class=\"emphasis\">you</span> are the one who crafted these? Not the fair guildmaster?"},{"name":"ROROTON","text":"The gods do indeed work in mysterious ways!"},{"name":"ROROTON","text":"I don't believe I have properly introduced myself. I am Roroton, a traveling entrepreneur. I go wherever opportunity beckons, buying for a gil and selling for two."},{"name":"ROROTON","text":"Long I have wandered the realm in search of fine accessories, as well as the talented goldsmiths who craft them."},{"name":"ROROTON","text":"And <span class=\"emphasis\">you</span> are precisely the sort of artisan I endeavor to meet!"},{"name":"ROROTON","text":"I would be honored if you allowed me to purchase more of your fine merchandise. Permit me to sell your wares, and we will both be wealthy in no time."},{"name":"ROROTON","text":"Ah, but forgive my impetuousness. You are a guild goldsmith, and I must go through the proper channels. Very well! I will meet with Mistress Serendipity once more."},{"name":"ROROTON","text":"Please give my card to your guildmaster, and inform her that I shall contact her again soon to resume contract negotiations."},{"name":"SERENDIPITY","text":"Welcome back, <span class=\"highlight\">Forename</span>! While you were gone, I performed some basic maintenance on Gigi. I'm not sure if I fixed the problem─or if there was even a problem to begin with, but─"},{"name":"SERENDIPITY","text":"Oh, but what about Roroton? Did you find him?"},{"name":"SERENDIPITY","text":"This is wonderful news, <span class=\"highlight\">Forename</span>!"},{"name":"SERENDIPITY","text":"Not only has he forgiven us, he desires a business partnership even more than before!"},{"name":"SERENDIPITY","text":"I knew I was right to count on you, <span class=\"highlight\">Forename</span>. There's something about your work that moves people, something that touches the soul."},{"name":"SERENDIPITY","text":"It's a gift, and it can't be taught, much as I wish it could. No, you've always had it in you. And as you grow more skilled, you'll only become better at expressing it."},{"name":"SERENDIPITY","text":"I'm certain that was part of Roroton's decision. Since we know he'll request your services when he next visits, you'd best work hard until the time comes!"},{"name":"ROROTON","text":"It was a pleasure meeting you. I believe we will have a most profitable relationship in the days to come."}],"reward":{"gil":639,"items":[{"id":2398},{"id":2750,"one":1},{"id":3104,"one":1},{"id":3583,"one":1},{"num":6,"id":5824,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":12}],"quests":[66152]},"next":[66191]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1004098","obj":{"i":1004098,"n":"Roroton","l":40,"q":3}},{"type":"item","id":"2398","obj":{"i":2398,"n":"Steel Chaser Hammer","l":29,"c":35306,"t":18,"p":2718}},{"type":"item","id":"2750","obj":{"i":2750,"n":"Velveteen Beret","l":29,"c":41032,"t":34}},{"type":"item","id":"3104","obj":{"i":3104,"n":"Velveteen Gown","l":30,"c":42071,"t":35,"p":2499}},{"type":"item","id":"3583","obj":{"i":3583,"n":"Velveteen Shortgloves","l":28,"c":44081,"t":37,"p":1453}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4218","obj":{"i":4218,"n":"Malachite Earrings","l":29,"c":55210,"t":41,"p":2544}},{"type":"quest","id":"66152","obj":{"i":66152,"n":"Or Ever the Silver Cord Be Loosed","g":139,"l":"Ul'dah","s":250,"f":1}},{"type":"quest","id":"66191","obj":{"i":66191,"n":"Mammets on Fire","g":139,"l":"Ul'dah","s":350,"f":1}}]}