{"quest":{"name":"Unsolved Mystery","location":"Eastern Thanalan","id":66154,"patch":2.0,"sort":98,"eventIcon":71201,"issuer":1003929,"target":1003929,"involved":[1003942,1003943,1003944],"genre":1,"journal":["Isembard of Camp Drybone is seeking help to solve a mystery of missing persons.","Isembard informs you that the Amalj'aa have butchered a number of commonfolk, and asks that you retrieve the ripe corpses so that he may see them properly interred.","You have recovered the remains of the fallen. Take them back to Isembard at Camp Drybone.","Outward appearances being what they are, it is impossible that the Amalj'aa have been acting alone in the recent wave of disappearances. Isembard cannot help but wonder if another conspirator has had a hand in these troubling incidents."],"objectives":["Retrieve ripe corpses.","Deliver the corpses to Isembard at Camp Drybone."],"dialogue":[{"name":"ISEMBARD","text":"Let us get right to it, then. Minfilia names the Amalj'aa culprits in all this. You would do well to investigate them, first."},{"name":"ISEMBARD","text":"Much harm has been levied on these lands by Amalj'aa hands. The Flames burn where they might, but their light cannot stay the darkness in all places at all times."},{"name":"ISEMBARD","text":"There have been brutal murders of callers at the Church of Saint Adama Landama─innocents wishing no more than to pay their respects to the dead."},{"name":"ISEMBARD","text":"The poor souls deserve a proper burial. I would see to the deed before mongrels catch their scent, but I know not if the Amalj'aa still linger."},{"name":"ISEMBARD","text":"Would you secure their remains for me, friend? You will find them on the eastern road."},{"name":"ISEMBARD","text":"Twelve willing, you may even come to learn something of what the Amalj'aa seek in this area."},{"name":"ISEMBARD","text":"It is good to see you returned. Were you able to secure the remains of our fallen?"},{"name":"ISEMBARD","text":"With the bodies given back proper to the earth, the souls will find their way across to the other side. You have done a noble deed this day. I thank you."},{"name":"ISEMBARD","text":"Now, then, what of the Amalj'aa? Did you see any? Surely such massive monstrosities as they cannot conceal their presence, much less take their quarry unawares."},{"name":"ISEMBARD","text":"Ah, so there <span class=\"emphasis\">were</span> Amalj'aa remaining, after all... I feared as much. Their part in the lowborn disappearing is all but confirmed. But I sense there is more to this than meets the eye."},{"name":"ISEMBARD","text":"The occasional Amalj'aa raiding party would not account for people going missing in these kinds of numbers. The total is too great, and the questions too many. It would not surprise me in the least to learn of another hand in this."},{"name":"ISEMBARD","text":"But whose? Countless travelers pass through Drybone every day. And even if it were one among them, how would we best discover who may be implicit in these vanishings?"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":235,"xp":7280},"reqs":{"jobs":[{"lvl":17,"id":130}],"quests":[66046]},"next":[66155]},"partials":[{"type":"npc","id":"1003929","obj":{"i":1003929,"n":"Isembard","l":44,"q":8}},{"type":"npc","id":"1003942","obj":{"i":1003942,"n":"Ripe Corpse","l":44,"q":1}},{"type":"npc","id":"1003943","obj":{"i":1003943,"n":"Ripe Corpse","l":44,"q":1}},{"type":"npc","id":"1003944","obj":{"i":1003944,"n":"Ripe Corpse","l":44,"q":1}},{"type":"quest","id":"66046","obj":{"i":66046,"n":"A Wild Rose by Any Other Name","g":1,"l":"The Waking Sands","s":97}},{"type":"quest","id":"66155","obj":{"i":66155,"n":"What Poor People Think","g":1,"l":"Eastern Thanalan","s":99}}]}