{"quest":{"name":"Takin' What They're Givin'","location":"Ul'dah","id":66159,"patch":2.0,"sort":45,"eventIcon":71201,"issuer":1001353,"target":1002065,"genre":1,"journal":["Momodi of the Quicksand has word of work for a willing adventurer.","Momodi informs you that Dadanen, a merchant who deals in precious stones, is seeking the aid of an able adventurer. Travel to the settlement of Horizon in western Thanalan and see what work he offers.","Dadanen tells you that Horizon's role as a center for trade means there is always work to be found. Look around the settlement and see what it has to offer."],"objectives":["Speak with Dadanen at Horizon."],"dialogue":[{"name":"MOMODI","text":"Look what the coeurl dragged in. Good to see you, <span class=\"highlight\">Forename</span>. I'd ask what brings you, but I reckon we both know the answer to that already."},{"name":"MOMODI","text":"Well, have I ever let you down before? Wait, don't answer that... "},{"name":"MOMODI","text":"So happens I know a fella by the name of Dadanen who needs a hand. He's a merchant by trade, sellin' precious stones to those in Ul'dah with the means to buy them."},{"name":"MOMODI","text":"He's asked that I send any lookin' for work his way. You can find him over in Horizon, if you fancy."},{"name":"MOMODI","text":"That's in western Thanalan, mind you. Just cross the bridge north of Scorpion Crossing and the road will take you there."},{"name":"MOMODI","text":"Knowin' the circles he deals in, might be he'll have some talk of the royal family that'll interest you, as well."},{"name":"MOMODI","text":"And why not make use of a chocobo porter for the journey to Horizon? If you've the gil for it, that is."},{"name":"MOMODI","text":"You'll find the chocobo stables just across the way from my Quicksand. Find Mimigun─he'll set you straight."},{"name":"MOMODI","text":"Well, off you go, then. I haven't got all day to be holdin' your bloody hand!"},{"name":"DADANEN","text":"<span class=\"highlight\">Forename</span>, I presume? Aye, Momodi said to expect you, and so I have."},{"name":"DADANEN","text":"Welcome to Horizon. Ours is a trading settlement that sees goods in from the port of Vesper Bay to the west─and trade we do. Nary a day goes by that Horizon isn't bustling with some manner of merchants and officials."},{"name":"DADANEN","text":"They keep us running about busy, they do. Enough so that I wish I had chocobo legs in place of my own. And that's why I've asked Momodi to send me any souls looking for work."},{"name":"DADANEN","text":"Twelve know there is plenty of it to be done around here. Speak to me again when you are ready to make yourself of some use."}],"reward":{"items":[{"num":23,"id":5},{"id":3318,"one":1},{"id":3316,"one":1},{"num":2,"id":5824,"one":1}],"xp":3420},"reqs":{"jobs":[{"lvl":10,"id":130}],"quests":[65856]},"next":[65864]},"partials":[{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1002065","obj":{"i":1002065,"n":"Dadanen","l":42,"q":4}},{"type":"item","id":"3318","obj":{"i":3318,"n":"Hempen Trousers","l":10,"c":45015,"t":36,"p":270}},{"type":"item","id":"3316","obj":{"i":3316,"n":"Amateur's Breeches","l":10,"c":45035,"t":36,"p":216}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"65856","obj":{"i":65856,"n":"Way Down in the Hole","g":1,"l":"Central Thanalan","s":39}},{"type":"quest","id":"65864","obj":{"i":65864,"n":"Supply and Demands","g":1,"l":"Western Thanalan","s":46}}]}