{"quest":{"name":"Objectively Speaking","location":"Ul'dah","id":66150,"patch":2.0,"sort":150,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"involved":[1004097],"genre":139,"usedItems":[4204,4309],"journal":["Serendipity appears to be in great distress.","The guildmaster abruptly recalls that she had another commission to assign you─once again for Robert of the Sultansworn. Craft a pair of fang earrings and a brass gorget and present them to Serendipity for inspection.","Gigi somehow manages to praise your handiwork and deeply offend Serendipity. In any case, both the guildmaster and her assistant judge the items fit for delivery. Take them to Robert outside the Goldsmiths' Guild.","Robert is surprised to learn that the goldsmith who prepared his order was in fact you, not Mistress Serendipity. He apologizes for the misunderstanding, and mentions that he will be keeping his eye on you from now on. Return to the guildmaster and tell her that the commission is complete.","While bemused at first, Serendipity quickly decides that Robert's mistake is proof of your tremendous growth as a goldsmith.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 20."],"objectives":["Present a pair of fang earrings and a brass gorget to Serendipity.","Deliver the fang earrings and the brass gorget to Robert.","Report to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"You would not <span class=\"emphasis\">believe</span> what just happened, <span class=\"highlight\">Forename</span>! Gigi touched my...my <span class=\"emphasis\">bottom</span>!"},{"name":"SERENDIPITY","text":"I was assisting one of my goldsmiths when he reached out and grabbed it without warning! Then he has the gall to say that my bottom “lacks sufficient shape and tone!”"},{"name":"SERENDIPITY","text":"I feel so violated...and insulted. I'm glad Robert wasn't here to─"},{"name":"SERENDIPITY","text":"Oh, that reminds me! Robert was back again with another commission. This time, he wants a pair of fang earrings and a brass gorget made."},{"name":"SERENDIPITY","text":"And not by just any goldsmith, mind you. He specifically requested the artisan who crafted the copper rings─that's <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>! He must be really impressed by your work!"},{"name":"SERENDIPITY","text":"When the accessories are ready, pray present them for my inspection. I want to ensure that Robert's <span class=\"emphasis\">completely</span> satisfied."},{"name":"SERENDIPITY","text":"How are the earrings and the gorget coming along? I don't want to keep Robert waiting."},{"name":"SERENDIPITY","text":"Impressive work, <span class=\"highlight\">Forename</span>! You clearly have an affinity for brass. The fine touches on these earrings, in particular, are─"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>FaNgS...bRaSs...ThIs PrEsEnTs A dIlEmMa. I sHoUlD nOt LiKe ThEsE iTeMs, BuT tHeY fEel...FrEsH. yOuR nUmErOuS mIsTaKeS, wHeN tAkEn ToGeThEr, gIvE tHeM aN eNdEaRiNg QuAlItY."},{"name":"GIGI","text":"I aM rEmInDeD oF sErEnDiPiTy. HeR mEaGeR bOsOm AnD uNtOnEd BuTtOcKs ArE─"},{"name":"SERENDIPITY","text":"GIGI! I'll have you know that my bosom is <span class=\"emphasis\">quite</span> ample, and my bottom is...is as firm as can be! I simply don't wear clothing that─"},{"name":"SERENDIPITY","text":"Wait, this has nothing to do with anything! And I refuse to be party to a debate over my own...body parts!"},{"name":"SERENDIPITY","text":"We were talking about the earrings and the gorget you made, <span class=\"highlight\">Forename</span>. Both called for brass, which is more useful than you may realize."},{"name":"SERENDIPITY","text":"While it isn't the fanciest metal around, it can be made to resemble gold in appearance if shaped and polished well."},{"name":"SERENDIPITY","text":"And despite Gigi's comments, I believe you've done an excellent job. Robert will doubtless agree."},{"name":"SERENDIPITY","text":"Since he requested that you make these items, I suppose <span class=\"emphasis\">you</span> should be the one to deliver them... &lt;sigh&gt; You'll find him outside, as before."},{"name":"ROBERT","text":"Good to see you again, <span class=\"highlight\">Forename</span>. I take it the earrings and the gorget are ready?"},{"name":"ROBERT","text":"By the gods, the craftsmanship is exquisite! This isn't gear to be worn...but art to be admired!"},{"name":"ROBERT","text":"It is of little wonder that Serendipity was named guildmaster at such a young age. She is a woman of incomparable talent, and a rare beauty besides."},{"name":"ROBERT","text":"...What? It was <span class=\"emphasis\">you</span> who crafted these!? Well now...this is an unexpected development. I will have to keep my eye on both you and your lovely guildmaster. My thanks, <span class=\"highlight\">Forename</span>."},{"name":"SERENDIPITY","text":"He thought it was <span class=\"emphasis\">my</span> handiwork? I don't know what to say..."},{"name":"SERENDIPITY","text":"For a customer to mistake your work for mine speaks to your growth as a goldsmith. At the rate you're improving, I can only imagine what customers will be saying about you years from now!"},{"name":"ROBERT","text":"Apologies for the misunderstanding, <span class=\"highlight\">Forename</span>. I'll be sure to request you by name next time. Oh, and do tell your lovely guildmaster that I look forward to seeing her again."}],"reward":{"gil":382,"items":[{"id":2407},{"id":3019,"one":1},{"id":3779,"one":1},{"id":5824,"one":1}],"xp":15120},"reqs":{"jobs":[{"lvl":15,"id":12}],"quests":[66149]},"next":[66151]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1004097","obj":{"i":1004097,"n":"Robert","l":41,"q":3}},{"type":"item","id":"2407","obj":{"i":2407,"n":"Recruit's Grinding Wheel","l":17,"c":35352,"t":19}},{"type":"item","id":"3019","obj":{"i":3019,"n":"Hempen Doublet Vest of Crafting","l":12,"c":42116,"t":35,"p":436}},{"type":"item","id":"3779","obj":{"i":3779,"n":"Ash Pattens","l":15,"c":46123,"t":38,"p":432}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4204","obj":{"i":4204,"n":"Fang Earrings","l":15,"c":55233,"t":41,"p":384}},{"type":"item","id":"4309","obj":{"i":4309,"n":"Brass Gorget","l":16,"c":54802,"t":40,"p":410}},{"type":"quest","id":"66149","obj":{"i":66149,"n":"Throw Some Rings on It","g":139,"l":"Ul'dah","s":100,"f":1}},{"type":"quest","id":"66151","obj":{"i":66151,"n":"A Melding of the Minds","g":139,"l":"Ul'dah","s":200,"f":1}}]}