{"quest":{"name":"Secrets and Lies","location":"Western Thanalan","id":66164,"patch":2.0,"sort":82,"eventIcon":71201,"issuer":1002058,"target":1001353,"genre":1,"journal":["Fufulupa would entrust you with a matter of grave import.","Fufulupa reveals that he has found a sealed letter addressed to Sultansworn Owyne among his disgraced predecessor's belongings. Uncertain of what to make of his discovery, he bids you deliver the letter to Momodi of the Quicksand, a steadfast supporter of the royal family.","Momodi does not hesitate to brush aside your concerns, assuring you that Owyne would never betray the sultana. However, she has her own suspicions regarding the letter..."],"objectives":["Show the letter to Momodi."],"dialogue":[{"name":"FUFULUPA","text":"I salute you, honored friend. As acting captain, I should be much obliged if you would grant me a personal request."},{"name":"FUFULUPA","text":"In our efforts to ascertain the full extent of the former captain's corruption, we have been poring over his personal correspondence."},{"name":"FUFULUPA","text":"Our search unearthed this sealed letter addressed to a man named Owyne."},{"name":"FUFULUPA","text":"But he is one of the Sultansworn elite! I can think of no reason why he should have any dealings with Baldewyn!"},{"name":"FUFULUPA","text":"We now know that the former captain was consorting with a coalition of criminals... Could it be that Owyne was, too!?"},{"name":"FUFULUPA","text":"This letter may well serve as evidence of their collusion, and so I dare not tamper with it myself."},{"name":"FUFULUPA","text":"But given the events of recent days, I knew not whom to trust with this information─until now."},{"name":"FUFULUPA","text":"I have chosen you, <span class=\"highlight\">Forename</span>. Pray bear the letter to Mistress Momodi of the Quicksand, and relate the circumstances of its discovery."},{"name":"FUFULUPA","text":"Not only is she a staunch supporter of the sultana, but she is well acquainted with the Sultansworn. She will know how best to proceed."},{"name":"MOMODI","text":"Ah, <span class=\"highlight\">Forename</span>! It's been too long! Dadanen tells me you've been keepin' busy in Horizon."},{"name":"MOMODI","text":"I want you to know that I'm grateful for everythin' you've done for the people of Ul'dah."},{"name":"MOMODI","text":"Even though you've seen the seedier side of our city, you've continued to help your fellow man. Believe me, the folk around here love you for it."},{"name":"MOMODI","text":"Hmmm? What is it? You look like you've got somethin' to say."},{"name":"MOMODI","text":"...So <span class=\"emphasis\">that's</span> what this is all about."},{"name":"MOMODI","text":"Fufulupa's thinkin' Owyne might've been in league with Baldewyn─that this letter could be proof of somethin' shady."},{"name":"MOMODI","text":"Well he needn't worry. Owyne's as loyal a Sultansworn as I've ever known. I haven't the foggiest what this says, but─"},{"name":"MOMODI","text":"Wait a minute. Wasn't Owyne the one who...?"},{"name":"MOMODI","text":"Oh, hells... I've got a bad feelin' about this."},{"name":"MOMODI","text":"Listen, <span class=\"highlight\">Forename</span>─I think I know what this is all about, but I need you to swear to keep it quiet."},{"name":"MOMODI","text":"If you'd rather wash your hands of this business, I won't hold it against you. But if you're determined to see it through to the bitter end, say the word and I'll explain."}],"reward":{"gil":220,"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65872]},"next":[66087]},"partials":[{"type":"npc","id":"1002058","obj":{"i":1002058,"n":"Fufulupa","l":42,"q":9}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"quest","id":"65872","obj":{"i":65872,"n":"Oh Captain, My Captain","g":1,"l":"Western Thanalan","s":81}},{"type":"quest","id":"66087","obj":{"i":66087,"n":"Duty, Honor, Country","g":1,"l":"Ul'dah","s":83}}]}