{"quest":{"name":"Steaking Claims","location":"Eastern Thanalan","id":66167,"patch":2.0,"sort":190,"eventIcon":71221,"issuer":1003932,"target":1003939,"genre":93,"journal":["Caitlyn of Camp Drybone looks like a woman in need of meat.","Caitlyn has asked that you obtain five chunks of tuco–tuco meat and deliver them to her late fiancé's brother Beneger at the Golden Bazaar.","You have obtained the five chunks of tuco-tuco meat. Deliver them to Beneger at the Golden Bazaar.","Beneger is happy to receive the tuco-tuco meat, as he will soon need it to feed to a group of hungry miners. He is also dismayed at the idea of Caitlyn remaining in Camp Drybone for the sole purpose of ensuring the annihilation of mongrels. Beneger admits that the death of his brother is tragic, but believes that it is past time Caitlyn moved on with her life."],"objectives":["Obtain chunks of tuco-tuco meat.","Deliver the tuco-tuco meat to Beneger."],"dialogue":[{"name":"CAITLYN","text":"It's you again! What impeccable timing. Oh, you needn't worry. I'm not going to ask you to put down any more mongrels on my dead fiancé's behalf."},{"name":"CAITLYN","text":"My fiancé is survived by a brother, though. He puts up at the Golden Bazaar, and he's asked that I bring him a load of tuco-tuco meat."},{"name":"CAITLYN","text":"I'd see to it myself, but as you well know, I must stay here to send adventurers on mongrel hunts until every last one of the bloody beasts in Eorzea is dead!"},{"name":"CAITLYN","text":"I suppose what I'm trying to say is, would you care to fell some tuco-tucos and obtain five chunks of their meat? Once you have enough, please deliver them to my late fiancé's brother, Beneger, at the Golden Bazaar."},{"name":"BENEGER","text":"Where is that damned tuco-tuco meat I asked Caitlyn to bring? It won't be long before my patrons arrive."},{"name":"BENEGER","text":"Caitlyn has sent you? Excellent! This is more than enough tuco-tuco meat."},{"name":"BENEGER","text":"Some miners have come to stay at the Bazaar while they prospect the area for mythril deposits. They value quantity over quality, so I'll be serving them a feast of this piss-poor meat."},{"name":"BENEGER","text":"By the by, <span class=\"emphasis\">please</span> don't tell me Caitlyn is still standing at that same spot in Drybone sending adventurers out to slay mongrels."},{"name":"BENEGER","text":"&lt;sigh&gt; I told her no number of mongrel pelts or heads will bring my brother back to us. I've moved on with my life. It's past time she did the same."}],"reward":{"gil":250,"items":[{"id":4100,"one":1},{"id":4430,"one":1},{"id":4433,"one":1},{"num":2,"id":5824,"one":1}],"xp":3920},"reqs":{"jobs":[{"lvl":19,"id":1}],"questsType":"all","quests":[66156,66161]},"next":[66168]},"partials":[{"type":"npc","id":"1003932","obj":{"i":1003932,"n":"Caitlyn","l":44,"q":2}},{"type":"npc","id":"1003939","obj":{"i":1003939,"n":"Beneger","l":44,"q":4}},{"type":"item","id":"4100","obj":{"i":4100,"n":"Coral Armillae","l":19,"c":55632,"t":42}},{"type":"item","id":"4430","obj":{"i":4430,"n":"Brass Ring","l":18,"c":54402,"t":43,"p":416}},{"type":"item","id":"4433","obj":{"i":4433,"n":"Coral Ring","l":19,"c":54432,"t":43,"p":349}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66156","obj":{"i":66156,"n":"A Proper Burial","g":1,"l":"Eastern Thanalan","s":100}},{"type":"quest","id":"66161","obj":{"i":66161,"n":"All Dogs Go to Hell","g":93,"l":"Eastern Thanalan","s":180}},{"type":"quest","id":"66168","obj":{"i":66168,"n":"Now Hiring","g":93,"l":"Eastern Thanalan","s":190}}]}