{"quest":{"name":"Now Hiring","location":"Eastern Thanalan","id":66168,"patch":2.0,"sort":190,"eventIcon":71221,"issuer":1003939,"target":1003939,"involved":[1003952,1003953,1003954,1003955,1003956],"genre":93,"journal":["Beneger of the Golden Bazaar needs help finding help.","Beneger wants to recruit hands to aid in the building of a new inn. Post his hiring notices in five locations.","You have posted the hiring notices. Report back to Beneger.","Beneger is glad that his notices have been posted, but he does not want to leave anything to chance. To this end, he has given you five more of his hiring notices to hand out directly to random passersby.","You have distributed the hiring notices. Report back to Beneger.","Beneger seems determined to revitalize the Golden Bazaar with his new business endeavor."],"objectives":["Post hiring notices in prime locations.","Speak with Beneger.","Distribute hiring notices.","Report to Beneger."],"dialogue":[{"name":"BENEGER","text":"How in the hells can you be wandering about without aught to do? There's opportunity here at the Golden Bazaar as there hasn't been in years!"},{"name":"BENEGER","text":"I speak of the massive mythril deposit, of course. The miners I fed before are only the beginning. More and more of them will flock here in the coming week, mark my words."},{"name":"BENEGER","text":"Until now, we've been nothing more than a small settlement. But now the sky's the limit! An inn for the mythril miners to come to would be worth a <span class=\"emphasis\">fortune</span>─mark my words!"},{"name":"BENEGER","text":"And I mean for that fortune to be mine. The problem I've had is that I need bodies to help me build the inn, but I can't seem to find any who are willing."},{"name":"BENEGER","text":"I've drawn up these hiring notices, hoping that they might help. Would you mind helping to get me started by posting five of them up in prime locations?"},{"name":"BENEGER","text":"You've posted all five? You're a Twelvesend! But...I <span class=\"emphasis\">truly</span> don't want to let this chance pass by."},{"name":"BENEGER","text":"Here, take five more hiring notices, and see them straight to the hands of whatever folk you see loitering about."},{"name":"MOBA","text":"Ugggh, I'm bored out of my gourd. Is there <span class=\"emphasis\">no</span> work to be had in this godsforsaken place?"},{"name":"MOBA","text":"Beneger is looking for able bodies, is he? I've done some woodworking in my day. Might be as he'll have some use for me."},{"name":"MOBA","text":"I've done some woodworking in my day. Might be as Beneger'll have some use for me."},{"name":"MOBB","text":"What is it? Can't you see I'm busy?"},{"name":"MOBB","text":"Beneger needs work done, does he? Seen more miners in the Bazaar of late. I reckon that's got something to do with it."},{"name":"MOBB","text":"Rumor has it there's mythril in the ground 'round here. Wonder if there's any truth to it."},{"name":"MOBB","text":"Beneger needs work done, does he? I reckon it has something to do with all the miners I've seen in the Bazaar of late."},{"name":"MOBC","text":"What's this now? Ugh, letters. Never learned them. Can't you just read it to me?"},{"name":"MOBC","text":"Beneger is building a new inn? No doubt to accommodate all the new people coming to the Bazaar in recent days."},{"name":"MOBC","text":"Taking advantage of the new foot traffic is a right fine idea. Hm? Oh, I have no intention of helping Beneger, of course. But perhaps there's even <span class=\"emphasis\">greater</span> profit to be had in stocking up the food stores..."},{"name":"MOBC","text":"Beneger's idea is a good one...but there's like to be <span class=\"emphasis\">more</span> profit in the stocking up of food stores."},{"name":"MOBD","text":"No, I don't have a moment to talk about Tha─ Wait, what's this, then?"},{"name":"MOBD","text":"Hiring hands to build a new inn? Well, that's bloody welcome news."},{"name":"MOBD","text":"I came here after hearing there might be mythril in these parts, but the inn's all full and I've been living out of a tent. Suppose I could lend a hand building inns till I start digging mines."},{"name":"MOBD","text":"Suppose I could lend a hand building inns till I start digging mines."},{"name":"MOBE","text":"You have work?"},{"name":"MOBE","text":"Carpenters? Thank the gods! I was afraid there'd be naught but mining jobs here. It's my vocation, to be sure, but a man needs some variety now and then! I'll go have myself a word with this Beneger fellow."},{"name":"MOBE","text":"I'll go have myself a word with this Beneger fellow."},{"name":"BENEGER","text":"Well done, <span class=\"highlight\">Forename</span>! Thanks to you, I've a feeling I'll have the hands I need to see my inn built."},{"name":"BENEGER","text":"I was in a dark place after my brother died, but <span class=\"emphasis\">now</span> I'm going to breathe life back into this Bazaar!"}],"reward":{"gil":215,"xp":3920},"reqs":{"jobs":[{"lvl":19,"id":1}],"quests":[66167]},"next":[66170]},"partials":[{"type":"npc","id":"1003939","obj":{"i":1003939,"n":"Beneger","l":44,"q":4}},{"type":"npc","id":"1003952","obj":{"i":1003952,"n":"Bored Burgher","l":44,"q":1}},{"type":"npc","id":"1003953","obj":{"i":1003953,"n":"Sunbaked Madam","l":44,"q":1}},{"type":"npc","id":"1003954","obj":{"i":1003954,"n":"Loose-tongued Madam","l":44,"q":1}},{"type":"npc","id":"1003955","obj":{"i":1003955,"n":"Hardened Miner","l":44,"q":1}},{"type":"npc","id":"1003956","obj":{"i":1003956,"n":"Burly Miner","l":44,"q":1}},{"type":"quest","id":"66167","obj":{"i":66167,"n":"Steaking Claims","g":93,"l":"Eastern Thanalan","s":190}},{"type":"quest","id":"66170","obj":{"i":66170,"n":"There's Mythril in Them Thar Hills","g":93,"l":"Eastern Thanalan","s":190}}]}