{"quest":{"name":"There's Mythril in Them Thar Hills","location":"Eastern Thanalan","id":66170,"patch":2.0,"sort":190,"eventIcon":71221,"issuer":1003939,"target":1003939,"genre":93,"journal":["Beneger has another task that needs to be done.","To meet the request of an influential miner, Beneger would like you to gather five slabs of cloud marble from near the ruins of the Invisible City.","You have gathered the cloud marble. Take them back to Beneger at the Golden Bazaar.","If the glimmer found within the cloud marble indeed proves to be mythril, it could spell the revival of the Golden Bazaar. All of Beneger's hopes for the future are riding on these slabs of rock."],"objectives":["Obtain slabs of cloud marble.","Deliver the cloud marble to Beneger."],"dialogue":[{"name":"BENEGER","text":"There's work to be done, <span class=\"highlight\">Forename</span>. You haven't let me down so far─don't start now. A miner recently come from Amajina & Sons wants a sample of stone from the eastern ruins."},{"name":"BENEGER","text":"I've a mind to give him five slabs of cloud marble from the Invisible City, and I need you to get them. Showing these to him would nigh guarantee a continued influx of miners to the Bazaar."},{"name":"BENEGER","text":"Have you gotten all the cloud marble samples I need, <span class=\"highlight\">Forename</span>?"},{"name":"BENEGER","text":"So this is the cloud marble I've heard so much about. Gods, look at the glimmer in this stone... I must admit I'd never seen it for myself, I had only heard tell of it. I see now why the mythril rumors have risen."},{"name":"BENEGER","text":"Now, you listen to me, you bloody rock! The Golden Bazaar is counting on you. If this talk of mythril turns out to be a farce, I swear by the Twelve I'll dig up every last pebble of you myself, grind you to powder, and sell you to the chocobo stables to sop up piss and runny shite!"},{"name":"BENEGER","text":"Ahem... Yes, well, sorry about that. It's just that ever since the war saw the road to Ala Mhigo cut off, the Bazaar has fallen on tough times. It is a waypoint choked off from its way, and is now little more than a point."},{"name":"BENEGER","text":"But I will not let it be so. I'm going to make the Golden Bazaar golden once more. From there, I'll become one of the richest men in Thanalan. Then I'll finally be able to give Caitlyn the life those mongrels stole from her."},{"name":"BENEGER","text":"She's held on to the memory of my brother for so long, she's become blind to the people who care for her. People like...well... Er, I don't suppose you could keep that last bit from Caitlyn, could you?"}],"reward":{"gil":210,"xp":3920},"reqs":{"jobs":[{"lvl":19,"id":1}],"quests":[66168]}},"partials":[{"type":"npc","id":"1003939","obj":{"i":1003939,"n":"Beneger","l":44,"q":4}},{"type":"quest","id":"66168","obj":{"i":66168,"n":"Now Hiring","g":93,"l":"Eastern Thanalan","s":190}}]}