{"quest":{"name":"Amethysts Are Forever","location":"Ul'dah","id":66179,"patch":2.0,"sort":350,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1003910,"genre":144,"usedItems":[5138],"journal":["Adalberta has an order she would like you to handle.","Adalberta has asked you to obtain twenty raw amethysts. Confessing that the gemstones are not her specialty, she bids you speak with Wide Gulley to learn where they might be found.","Wide Gulley obliges you with the information, but only because he is certain that you will fail at your task. Being careful to avoid the fearsome creatures in the area, make your way to Hopeseed Pond in the Central Shroud, and obtain twenty raw amethysts. Once you have the required quantity, present them to Wide Gulley.","Wide Gulley cannot hide his surprise that you were able to brave the dangers to procure the amethysts. To your credit, the man has come to see you as a rival, and expresses his intent to redouble his efforts. Keep working at your craft, that you might be prepared when the next contest inevitably comes.<br><br>※The next miner quest will be available from Adalberta upon reaching level 40."],"objectives":["Speak with Wide Gulley.","Deliver raw amethysts to Wide Gulley."],"dialogue":[{"name":"ADALBERTA","text":"Good to see you again, <span class=\"highlight\">Forename</span>. You'll be pleased to know that Hrodger was deeply impressed with the obsidian you got for him."},{"name":"ADALBERTA","text":"More so than that, he was impressed that you bested Wide Gulley in the contest. 'Tis no ordinary miner who can outdo the vice foreman's own son."},{"name":"ADALBERTA","text":"Lest you wonder, I knew full well who Wide Gulley's father was when I tried to pair you both up. I also know for a fact that he has his sights on my position."},{"name":"ADALBERTA","text":"There're some who whisper in my ear that I should expel him from the guild, but I can't help but think that shortsighted. After all, it's hardly a crime to want to be guildmaster."},{"name":"ADALBERTA","text":"What's more, Wide Gulley is a tremendously gifted miner, and I'm not in the business of punishing excellence. To be sure, I'm still better overall, but I'm not above admitting there are certain areas in which he's more knowledgeable."},{"name":"ADALBERTA","text":"I tell you this because you'll need to speak with him again for your next task. We've received an order for twenty raw amethysts, you see, and none among us know more about the stones than he does."},{"name":"ADALBERTA","text":"Now, I realize you didn't exactly get off on the right foot with Wide Gulley, but the two of you are guildmates, and guildmates help one another no matter their differences."},{"name":"WIDEGULLEY","text":"Strollin' on over, bold as you please, after humiliatin' me the other day... You've got some gall, adventurer."},{"name":"WIDEGULLEY","text":"Aye, I know why you're here; I heard about the order for raw amethysts, too. No doubt you're wonderin' where to find 'em, and you're after my hard-earned knowledge."},{"name":"WIDEGULLEY","text":"Well, I'll <span class=\"emphasis\">gladly</span> share it with you."},{"name":"WIDEGULLEY","text":"Why so obligin', you ask? 'Cause the knowledge ain't gonna be worth a damn to you, that's why."},{"name":"WIDEGULLEY","text":"You'll find all the raw amethysts you can carry near about Hopeseed Pond, over in the Central Shroud. The <span class=\"emphasis\">problem</span> has to do with the beasties inhabitin' the place more'n aught else. Lindwurms, stropers, sprites...I hear tell even Jaded Jody's made her home there."},{"name":"WIDEGULLEY","text":"Even Raubahn would have trouble takin' a stroll through <span class=\"emphasis\">that</span> neck o' the woods, let alone a common adventurer playin' at miner. I don't expect to see you back here with twenty hairs on your head, much less twenty o' them stones! Gahaha!"},{"name":"WIDEGULLEY","text":"You'll find your raw amethysts near about Hopeseed Pond over in the Central Shroud. Let's see how much you're willin' to risk for twenty of 'em! Gahaha!"},{"name":"WIDEGULLEY","text":"&lt;gasp&gt; Bugger me! <span class=\"emphasis\">You</span> mined these amethysts!? I...I can't believe you made it past all them nasty creatures..."},{"name":"WIDEGULLEY","text":"Though might be as it's time I stopped bein' so surprised. You godsdamned adventurers come through more often than I care to admit."},{"name":"WIDEGULLEY","text":"Anyroad, it's one thing to find the amethysts, but do you even know aught about 'em? Their properties? What they represent?<br>...Hmph, thought not. Well, here's a free lesson."},{"name":"WIDEGULLEY","text":"Amethysts are lightnin'-aspected gemstones, prized as embodiments of calmness, decisiveness, an' intuition. In comin' back with such a large haul of 'em...it would seem you've got all these things."},{"name":"WIDEGULLEY","text":"I might've been hasty to pass judgment. The more I see you work, the more I see why the guildmaster's so fond of you."},{"name":"WIDEGULLEY","text":"I never imagined an adventurer would give me my toughest competition. And I was learned better than that─to take every adversary earnestly."},{"name":"WIDEGULLEY","text":"Seems I'll have to redouble my efforts if I'm to secure my place as the best in the business."},{"name":"WIDEGULLEY","text":"Don't you worry about the precious amethysts you brought. I'll see them safe to the guild's stores."},{"name":"WIDEGULLEY","text":"I look forward to our next contest, adventurer. That's when I'll drive the pickaxe home that <span class=\"emphasis\">I</span> am the better miner."}],"reward":{"items":[{"id":2527},{"id":3129,"one":1},{"id":2778,"one":1},{"id":3613,"one":1},{"id":3843,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":17}],"quests":[66142]},"next":[66180]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003910","obj":{"i":1003910,"n":"Wide Gulley","l":41,"q":5}},{"type":"item","id":"2527","obj":{"i":2527,"n":"Steel Dolabra","l":34,"c":38012,"t":28,"p":3869}},{"type":"item","id":"3129","obj":{"i":3129,"n":"Apprentice's Doublet","l":36,"c":42006,"t":35,"p":4410}},{"type":"item","id":"2778","obj":{"i":2778,"n":"Angler's Hat","l":35,"c":41124,"t":34,"p":2721}},{"type":"item","id":"3613","obj":{"i":3613,"n":"Fingerless Boarskin Gloves of Gathering","l":35,"c":44101,"t":37,"p":3024}},{"type":"item","id":"3843","obj":{"i":3843,"n":"Boarskin Crakows of Gathering","l":35,"c":46217,"t":38,"p":2764}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5138","obj":{"i":5138,"n":"Raw Amethyst","l":31,"c":21453,"t":48}},{"type":"quest","id":"66142","obj":{"i":66142,"n":"Obsidian Race","g":144,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"66180","obj":{"i":66180,"n":"To Die For","g":144,"l":"Ul'dah","s":400,"f":1}}]}