{"quest":{"name":"The Intervention","location":"Ul'dah","id":66189,"patch":2.0,"sort":450,"icon":100063,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1003919,1003920],"genre":141,"usedItems":[3176,3429,2829],"journal":["Redolent Rose appears to be in high spirits.","Redolent Rose has decided that the best way to help Wawarukka is to ignore the miner's terrible taste in clothing. To that end, he has taken the liberty of changing Wawarukka's commission. Before you can proceed, you must first obtain approval from the miner. Speak with Wawarukka and obtain his permission.","While surprised by the guildmaster's proposal, Wawarukka is willing to accept it, acknowledging that his ignorance of fashion has been the cause of his previous failures. Craft a woolen beret, gown, and gaskins of the highest quality and present them to Redolent Rose.","During the fitting, a depressed Wawarukka reveals that he saw Kokomo in the company of a wealthy suitor not long ago. Convinced that all is lost, he flees the guild in a fit of despair, proclaiming himself unworthy of Kokomo's affections. Resigned, Redolent Rose states that if Wawarukka is determined to give up, then there is nothing either of you can do to help.<br><br>※The next weaver quest will be available from Redolent Rose upon reaching level 50."],"objectives":["Speak with Wawarukka.","Deliver a woolen beret <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a woolen gown <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a pair of woolen gaskins <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"Hah hah hah! It was all so simple! I've conceived of a plan to help poor Wawarukka!"},{"name":"REDOLENTROSE","text":"He came to me again with another ridiculous commission, and I was completely at a loss as to how to proceed. But then, a stroke of genius!"},{"name":"REDOLENTROSE","text":"We simply change his order and dress him as we see fit!"},{"name":"REDOLENTROSE","text":"If we ignore his terrible taste in clothing and give him a stylish outfit, Babawai will have no cause to chase him away, and he will finally have his chance to speak with Kokomo!"},{"name":"REDOLENTROSE","text":"And I've just the outfit in mind for this occasion: a beret, gown, and gaskins, all made from the finest wool. I daresay he'll be a man reborn when we've finished!"},{"name":"REDOLENTROSE","text":"Of course, it is necessary that we gain his approval before changing his commission like this, but I am confident that he will see the wisdom in my proposal."},{"name":"WAWARUKKA","text":"Hm? <span class=\"highlight\">Forename</span>? What're you doin' here? I already told Big Rose what I wanted this time."},{"name":"WAWARUKKA","text":"Oh...he wants to change my order? Well, I s'pose that's alright."},{"name":"WAWARUKKA","text":"I know I'm a fool when it comes to fashion an' all that. Seems I only make things worse when I try harder, too."},{"name":"WAWARUKKA","text":"A woolen beret, gown, and gaskins, was it? Yeah, that sounds nice. I'll meet you there, <span class=\"highlight\">Forename</span>."},{"name":"WAWARUKKA","text":"Well...I'm here. We doin' this or no?"},{"name":"REDOLENTROSE","text":"I must confess, I am rather eager to see how this particular commission turns out. Are Wawarukka's garments ready yet?"},{"name":"REDOLENTROSE","text":"Excellent. I've no doubt these will suit him well."},{"name":"REDOLENTROSE","text":"I think we've outdone ourselves, <span class=\"highlight\">Forename</span>! Just look at him standing there, a vision of grace and refinement!"},{"name":"WAWARUKKA","text":"No, I ain't..."},{"name":"REDOLENTROSE","text":"Is something wrong, sir? I believe they fit you perfectly, but if you desire adjustments─"},{"name":"WAWARUKKA","text":"No, no, the clothes are great, Big Rose. Really. It's just, I─ I'm sorry, this was a mistake."},{"name":"REDOLENTROSE","text":"What ever are you saying? You look marvelous! Kokomo would be thrilled to receive such a dashing young caller!"},{"name":"WAWARUKKA","text":"It's too late. On the way here, I saw her walkin' with this wealthy-lookin' fella. Just the two of 'em."},{"name":"WAWARUKKA","text":"Watchin' 'em together, in their fancy clothes...it looked <span class=\"emphasis\">right</span>, Big Rose. Like they were made for each other."},{"name":"WAWARUKKA","text":"I ain't one of them, don't you see!? You can dress me in your finest silks, but I've still got more dirt under me nails than that girl has in her whole bleedin' manse!"},{"name":"WAWARUKKA","text":"I was a fool to think she could care for someone like me! I'll <span class=\"emphasis\">never</span> be part of her world!"},{"name":"REDOLENTROSE","text":"Leave him be, <span class=\"highlight\">Forename</span>. If he is determined to give up, then there is naught we can do for him."},{"name":"REDOLENTROSE","text":"Though he would be far better served by letting Kokomo decide for herself, Wawarukka must first find the courage to carry on. Only then will he stand a chance."}],"reward":{"items":[{"id":2452},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":14}],"quests":[66188]},"next":[66190]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003919","obj":{"i":1003919,"n":"Wawarukka","l":41,"q":1}},{"type":"npc","id":"1003920","obj":{"i":1003920,"n":"Wawarukka","l":41,"q":1}},{"type":"item","id":"2452","obj":{"i":2452,"n":"Thousand Needle","l":43,"c":35508,"t":22,"p":4028}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3176","obj":{"i":3176,"n":"Woolen Gown","l":43,"c":42220,"t":35}},{"type":"item","id":"3429","obj":{"i":3429,"n":"Woolen Gaskins","l":44,"c":45182,"t":36,"p":3808}},{"type":"item","id":"2829","obj":{"i":2829,"n":"Woolen Beret","l":43,"c":41122,"t":34}},{"type":"quest","id":"66188","obj":{"i":66188,"n":"A Subtle Inquiry","g":141,"l":"Ul'dah","s":400,"f":1}},{"type":"quest","id":"66190","obj":{"i":66190,"n":"A Miner Reborn","g":141,"l":"Ul'dah","s":500,"f":1}}]}