{"quest":{"name":"A Subtle Inquiry","location":"Ul'dah","id":66188,"patch":2.0,"sort":400,"icon":100063,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1003917,1003918],"genre":141,"usedItems":[3413],"journal":["Redolent Rose has a commission for you, as well as a private request.","Redolent Rose has tasked you with a commission for Kokomo, the object of Wawarukka's affections. Seeing an opportunity, he has also asked you to subtly inquire as to her feelings towards the miner. Speak with Kokomo at the Gold Court to learn more of the commission and of her heart.","Kokomo knows full well who Wawarukka is, and appears to harbor no ill will towards him. As for the commission, she has asked you to craft a pair of quality woolen tights. Prepare the item as requested and deliver it to Redolent Rose.","During the fitting, Kokomo unintentionally reveals that she has feelings for her secret admirer. Now knowing that Wawarukka's efforts will not be in vain, the guildmaster ponders how he can prevent Wawarukka from botching another attempt to win the young woman's heart.<br><br>※The next weaver quest will be available from Redolent Rose upon reaching level 45."],"objectives":["Speak with Kokomo.","Deliver a pair of woolen tights <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"Ah, <span class=\"highlight\">Forename</span>, good of you to come. We have an opportunity to help that fool of a miner Wawarukka, but it will require some discretion."},{"name":"REDOLENTROSE","text":"The guild has received another commission from Kokomo. That is to say, from her father, most likely."},{"name":"REDOLENTROSE","text":"Now, while I obviously expect you to craft her high-quality garments that meet our exceptionally high standards, there is one more thing I would have you do."},{"name":"REDOLENTROSE","text":"When you meet with Kokomo at the Gold Court, I would have you <span class=\"emphasis\">subtly</span> direct the conversation to the topic of Wawarukka. Try and discern what she thinks of the man."},{"name":"KOKOMO","text":"Hello. I believe we met once before─<span class=\"highlight\">Forename</span>, was it? Thank you for coming. I'm sure you must be terribly busy with your many commissions."},{"name":"KOKOMO","text":"...Excuse me, did you say Wawarukka? He's one of your clients?"},{"name":"KOKOMO","text":"Ahahaha, what a coincidence! He visited the shop the other day! You should have seen Father's face when he chased him away─thankfully, he didn't recognize him. What ever possessed him to wear such a ridiculous outfit?"},{"name":"KOKOMO","text":"It's a shame, really. It feels like he hasn't visited in forever! I would have liked to have spoken with him..."},{"name":"KOKOMO","text":"Ahem, yes, the commission! I am in need of a pair of quality woolen tights. I should meet you at the guild for the fitting, correct? Then until we meet again, <span class=\"highlight\">Forename</span>."},{"name":"KOKOMO","text":"I'm sure your tights will be excellent, but I know Master Rose would insist upon inspecting them first. I will wait here until he says that they are ready."},{"name":"REDOLENTROSE","text":"Have you the tights, <span class=\"highlight\">Forename</span>?"},{"name":"REDOLENTROSE","text":"Miss, if you would come with me..."},{"name":"KOKOMO","text":"They're so soft and warm...I don't think I've ever worn such comfortable tights."},{"name":"KOKOMO","text":"This is just what I needed for all those evening parties Father makes me attend. The cold was becoming unbearable..."},{"name":"KOKOMO","text":"I could wear these tights underneath my gowns and Father would never be the wiser."},{"name":"REDOLENTROSE","text":"I realize he expects a great deal of you, but could you not simply refuse to attend? Surely, you do not wish to devote your entire life to his business."},{"name":"KOKOMO","text":"I appreciate your concern, Master Rose, but it's not possible. He's my father..."},{"name":"REDOLENTROSE","text":"In that case, why not view it as an opportunity? Perhaps, some enchanted evening, you'll meet a charming young man."},{"name":"KOKOMO","text":"Master Rose, don't be absurd! Wawarukka would never attend one of these dreadful parties!"},{"name":"REDOLENTROSE","text":"Ah, forgive me─I had no idea that you had already made the acquaintance of one such gentleman."},{"name":"KOKOMO","text":"I...I... Th-Thank you for the leggings, <span class=\"highlight\">Forename</span>! I believe I must be going now!"},{"name":"KOKOMO","text":"As if Father would ever accept him..."},{"name":"REDOLENTROSE","text":"Well...at least we now know that Wawarukka's efforts were not in vain."},{"name":"REDOLENTROSE","text":"Now if only we could convince the buffoon to wear something relatively normal next time..."}],"reward":{"items":[{"id":2463},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":14}],"quests":[66187]},"next":[66189]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003917","obj":{"i":1003917,"n":"Kokomo","l":41,"q":1}},{"type":"npc","id":"1003918","obj":{"i":1003918,"n":"Kokomo","l":41,"q":1}},{"type":"item","id":"2463","obj":{"i":2463,"n":"Apprentice's Spinning Wheel","l":37,"c":35552,"t":23}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3413","obj":{"i":3413,"n":"Woolen Tights","l":41,"c":45172,"t":36,"p":2954}},{"type":"quest","id":"66187","obj":{"i":66187,"n":"Designed by Committee","g":141,"l":"Ul'dah","s":350,"f":1}},{"type":"quest","id":"66189","obj":{"i":66189,"n":"The Intervention","g":141,"l":"Ul'dah","s":450,"f":1}}]}