{"quest":{"name":"To Die For","location":"Ul'dah","id":66180,"patch":2.0,"sort":400,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"involved":[1003910],"genre":144,"usedItems":[5168],"journal":["Adalberta would like to entrust you with a difficult task. ","You learn from Adalberta that Deep Canyon has placed an outrageous order for no fewer than twenty pieces of jade. It seems the precious stones can only be found naturally in Coerthas. Adalberta beseeches you to not do anything for which you are not prepared. In the meantime, however, you are told that Wide Gulley has something to discuss. Seek him out in the guild before making any rash decisions.","Somewhat expectedly, Wide Gulley proposes another contest─the first to fulfill Deep Canyon's order wins. Make your way to Haldrath's March in Coerthas, and there obtain twenty pieces of jade. Once you have the required quantity, present them to Adalberta.","Delivering the jade to Adalberta, you learn to your surprise that you have won the contest by default. Wide Gulley was attacked by a monster and could not complete the order. While the guildmaster applauds your success, she cannot help but feel concerned for your recuperating comrade, who she says is deeply depressed.<br><br>※The next miner quest will be available from Adalberta upon reaching level 45."],"objectives":["Speak with Wide Gulley.","Deliver pieces of jade to Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"Have you heard, <span class=\"highlight\">Forename</span>? The latest tally has you tied with Wide Gulley as the guild's highest earner!"},{"name":"ADALBERTA","text":"You started as a novice with a rusty pickaxe─now you're one of our stoutest pillars. You've truly come a long way, my friend."},{"name":"ADALBERTA","text":"I find myself turning to you more often for difficult orders, the bulk of which have been coming from Deep Canyon. As you should well know from past expeditions, these tend to entail going to dangerous locales."},{"name":"ADALBERTA","text":"I'm loath to put my people in harm's way, but the Concern owns us─in truth, if not in name. It'd be ill done to refuse their requests, no matter how onerous."},{"name":"ADALBERTA","text":"But just this once, I've a mind to do just that. I can't in good conscience order you to a wild place like Coerthas merely for the sake of twenty pieces of jade."},{"name":"ADALBERTA","text":"Aye, that's what Deep Canyon is requesting this time. And if I <span class=\"emphasis\">have</span> to send someone, you've rightly proven yourself the best candidate. But you should understand how risky the endeavor. Think long and hard before you do something we <span class=\"emphasis\">both</span> regret."},{"name":"ADALBERTA","text":"While you're mulling it over, though, I should let you know that Wide Gulley wanted a word. You'll find him in the usual place."},{"name":"WIDEGULLEY","text":"I take it you've heard about the job. An' I can tell from the look in your eyes that you're already on board with givin' it a go."},{"name":"WIDEGULLEY","text":"When you came back with the amethysts that last time, I came to realize somethin'─a true miner must be prepared to risk life an' limb for his prize."},{"name":"WIDEGULLEY","text":"Minin' for jade at no less a place than Haldrath's March in Coerthas would be the perfect way to put my conviction to the proof."},{"name":"WIDEGULLEY","text":"I challenge you to another contest. The first to find twenty pieces of jade and deliver them to Adalberta is the winner! The superior miner by all objective measures!"},{"name":"ADALBERTA","text":"&lt;sigh&gt; I understand Wide Gulley has challenged you yet again. I know the temptation is to seek out victory whatever the cost, but winning isn't everything. You do what's right for <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>."},{"name":"ADALBERTA","text":"By the Twelve, this is the jade... And such fine samples, too! Congratulations are in order─you've won the contest!"},{"name":"ADALBERTA","text":"...By default, that is. Wide Gulley never got his twenty pieces, you see. As he went about his work, he lowered his guard and was attacked by a fell fiend. His wounds were such that it was all he could do to run to safety."},{"name":"ADALBERTA","text":"He's whole of body, if somewhat worse for wear. He's like to be out of action for a while."},{"name":"ADALBERTA","text":"But that's not the worst of it. More than the wounds you can <span class=\"emphasis\">see</span>, I worry for his state of mind. He saw you as a rival to surpass, but he ended up losing in a contest he himself devised."},{"name":"ADALBERTA","text":"That kind of disappointment is enough to break most people. Trust me, I know."},{"name":"ADALBERTA","text":"But I pray that Wide Gulley has the strength to get back on his feet and take up the pickaxe once more. It'd be a shame to lose one so gifted."},{"name":"ADALBERTA","text":"Let's return to the matter before us, though. I wasn't exaggerating about the quality of this jade. Its purity and strength allow you to see why it's thought of as the embodiment of immortality."},{"name":"ADALBERTA","text":"Since ancient times, man has chosen to adorn his tools and garb with it. Imbuing yourself with the everlasting is certainly an attractive notion."},{"name":"ADALBERTA","text":"And no one is more aware of that tradition than Wide Gulley. It's for that very reason I intend to create for him a gift of jade."},{"name":"ADALBERTA","text":"The stone bears my hopes that he will rise again, no matter how often the Spinner might see fit to test him, and bring him to his knees."}],"reward":{"items":[{"id":2541},{"id":2819,"one":1},{"id":3410,"one":1},{"id":3627,"one":1},{"id":3853,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":17}],"quests":[66179]},"next":[66181]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003910","obj":{"i":1003910,"n":"Wide Gulley","l":41,"q":5}},{"type":"item","id":"2541","obj":{"i":2541,"n":"Apprentice's Sledgehammer","l":39,"c":38053,"t":29}},{"type":"item","id":"2819","obj":{"i":2819,"n":"Mythril Mesail","l":42,"c":40411,"t":34}},{"type":"item","id":"3410","obj":{"i":3410,"n":"Woolen Sarouel of Gathering","l":40,"c":45180,"t":36,"p":3240}},{"type":"item","id":"3627","obj":{"i":3627,"n":"Fingerless Peisteskin Gloves of Gathering","l":40,"c":44102,"t":37,"p":3780}},{"type":"item","id":"3853","obj":{"i":3853,"n":"Peisteskin Crakows of Gathering","l":40,"c":46218,"t":38,"p":3456}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5168","obj":{"i":5168,"n":"Jade","l":40,"c":21252,"t":48}},{"type":"quest","id":"66179","obj":{"i":66179,"n":"Amethysts Are Forever","g":144,"l":"Ul'dah","s":350,"f":1}},{"type":"quest","id":"66181","obj":{"i":66181,"n":"Gulley of Woes","g":144,"l":"Ul'dah","s":450,"f":1}}]}