{"quest":{"name":"Momentary Miracle","location":"Ul'dah","id":66186,"patch":2.0,"sort":500,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"involved":[1001301,1001309,1001354,1003927],"genre":142,"usedItems":[1987],"journal":["Guildmaster Severian appears to have isolated the missing element in his work.","Severian explains that his previous attempt to resurrect his lost love failed to take into account the necessity for a spiritual anchor. Speak with W'bulea in Pearl Lane, and ask if she might spare the guildmaster an object that W'nahja held dear.","W'bulea is unable─or unwilling─to give you any items that her sister might have treasured. Though thoroughly out of patience with Severian's experiments, she suggests visiting W'nahja's admirers to see if they can help you in your quest. Speak with adventurers in the Quicksand and merchants at the Ruby Road Exchange to learn of any objects that could suit the guildmaster's needs.","After speaking with W'nahja's admirers, you learn that the conjurer was fond of a certain wand. Recreate her high-quality budding rosewood wand and affix to it a grade three quicktongue materia, before delivering the weapon to Severian at the Alchemists' Guild.","With the final component of the process in place, Severian finally succeeds in resurrecting W'nahja. The reunion, however, is short-lived─after dispelling the guildmaster's lingering feelings of guilt, the conjurer fades into the aether. Speak with the guildmaster and learn what he intends to do now.","Freed at last from his years-long obsession, the master alchemist urges you to join him in his continuing exploration of the limitless realm of alchemy.<br><br>※The next alchemist quest will be available from Severian once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with W'bulea in Pearl Lane.","Learn more about W'nahja from her admirers.","Deliver a budding rosewood wand <img class=\"hq-icon small\" src=\"images/item/hq.png\"> melded with a quicktongue materia III to Severian.","Speak with Severian."],"dialogue":[{"name":"SEVERIAN","text":"Ahahaha, is that you, my loyal assistant? I've done it. I've isolated the flaw!"},{"name":"SEVERIAN","text":"My understanding of the process was incomplete. Simply reviving W'nahja's corporeal form was insufficient."},{"name":"SEVERIAN","text":"In order to call her spirit and bind it to her body, I need an anchor of sorts. Some manner of memento that she would recognize..."},{"name":"SEVERIAN","text":"But I have no such physical memories; no material object that she might have treasured."},{"name":"SEVERIAN","text":"That is why I would have you visit her sister, W'bulea, and ask if she might spare me a keepsake. Meanwhile, I will start on the prepar─"},{"name":"SEVERIAN","text":"A moment of...ungh...dizziness, nothing more. If I must, I shall work in my sleep."},{"name":"SEVERIAN","text":"It would not be the first time. But if all goes to plan, such extremes should not be necessary."},{"name":"WBULEA","text":"Severian needs something of W'nahja's? Something she treasured? &lt;sigh&gt; He yet persists in this madness of his."},{"name":"WBULEA","text":"I do not, as Severian believes, seek to forget my dear sister. There are still nights when I lie awake, wishing I had the power to change the past."},{"name":"WBULEA","text":"W'nahja and I were once insatiable wanderers, you see. We traveled the world, practicing the arts of conjury. It was in Ul'dah, however, where we found a home. And where W'nahja found Severian."},{"name":"WBULEA","text":"Though the son of a wealthy noble house, he spoke constantly of mastering the secrets of alchemy. My sister thought his childlike passion endearing, and he was smitten by her gentle attentions. I wished them naught but happiness."},{"name":"WBULEA","text":"Yet as was true for many an Eorzean, the night of the Calamity brought a brutal end to their joy. I had volunteered to join the Allied forces, and, perhaps feeling a twinge of our old wanderlust, W'nahja chose to join me. It became her last adventure..."},{"name":"WBULEA","text":"I have nothing left to remember her by. And even if I did, I would not give it to <span class=\"emphasis\">you</span>. But to forestall Severian's inevitable insistence, I will at least provide you with a direction for your futile quest."},{"name":"WBULEA","text":"You might try speaking with adventurers in the Quicksand, or merchants at the Ruby Road Exchange. My sister had her fair share of admirers─perhaps one of them will hold the key you seek."},{"name":"WBULEA","text":"If you would know more of W'nahja, try speaking with adventurers in the Quicksand, or merchants at the Ruby Road Exchange."},{"name":"WBULEA","text":"Though, personally, I care not <span class=\"emphasis\">what</span> your deluded guildmaster has planned. I am done with this interminable waiting. I <span class=\"emphasis\">will</span> have my sister returned to me for a proper interment."},{"name":"MEMENARU","text":"Did I know W'nahja? My, it's been some time since I last heard that name!"},{"name":"MEMENARU","text":"W'nahja and W'bulea, the famous conjurer sisters. I thought myself quite the fortunate fellow indeed to have run across them in my travels."},{"name":"MEMENARU","text":"I heard that the elder did not survive the Calamity. I should have liked to see her wield that wand of hers one more time. Such grace. Such beauty."},{"name":"VIANNE","text":"W'nahja? Oh my, yes, I knew her."},{"name":"VIANNE","text":"I always envied her her effortless talent. If I had tried to actually <span class=\"emphasis\">use</span> the wand of which she was so fond, I would likely have fainted from the exertion."},{"name":"VIANNE","text":"She did let me hold it once, though. The exact name of the weapon escapes me, but I could tell it was enhanced with quicktongue materia. It was a grade three stone, if it matters."},{"name":"LALAYOMA","text":"Who? Ah, the elder of the conjurer sisters. Spoke with her once or twice, I did."},{"name":"LALAYOMA","text":"I was interested in the wand she carried─budding rosewood, if I recall, and not the standard model, neither. Seems she had it specially made."},{"name":"LALAYOMA","text":"She cut a stunning figure in that robe of hers, too! I meant to ask her about it the next time we met, but I never got that chance. Such a shame..."},{"name":"SEVERIAN","text":"Have you acquired a suitable memento to act as W'nahja's anchor? I am sure her sister, W'bulea, would know if any such object existed."},{"name":"SEVERIAN","text":"This...this is W'nahja's rosewood wand. I would recognize it anywhere! Hm? You say you <span class=\"emphasis\">crafted</span> this weapon?"},{"name":"SEVERIAN","text":"My wonderful assistant, you are truly full of surprises. Though my love may never have held this particular wand, it is similar enough to the original to serve our purpose."},{"name":"SEVERIAN","text":"Yes, yes, I could spend the remainder of the day explaining to you the underlying principle of aetherial anchors, but let us carry on with the alchemy, shall we?"},{"name":"SEVERIAN","text":"Now that we have <span class=\"emphasis\">all</span> the necessary materials, I will once again begin the painstaking process. Stay with me this time, my patient apprentice. You deserve to see the fruits of our labor firsthand."},{"name":"SEVERIAN","text":"The components are in place. We should see a result within moments..."},{"name":"WBULEA","text":"It will not be the result you desire."},{"name":"SEVERIAN","text":"W'bulea!"},{"name":"WBULEA","text":"Return to me my sister's remains. You have had your chance, Severian."},{"name":"SEVERIAN","text":"The process was a success. Everything went perfectly! Even now, W'nahja struggles free from death's covetous grasp!"},{"name":"WBULEA","text":"Why do you persist in deluding yourself? The gift of life is not within alchemy's power to give; that miracle belongs only to the gods."},{"name":"SEVERIAN","text":"I will not forsake W'nahja's memory as you have! The limitless potential of alchemy is beyond your understanding!"},{"name":"WBULEA","text":"Ugh! You foolish, stubborn man!"},{"name":"WNAHJA","text":"(-???-)Stop..."},{"name":"WNAHJA","text":"Stop fighting...the both of you..."},{"name":"WBULEA","text":"W'nahja!? Is it truly you!?"},{"name":"WNAHJA","text":"Severian? You look awful. Have you been up all night again? Some new subject of research?"},{"name":"SEVERIAN","text":"W'nahja, I..."},{"name":"SEVERIAN","text":"I was working on something important. Terribly important. But I'm done with that now. I need to... I must tell you how sorry I am."},{"name":"SEVERIAN","text":"When I think back on the days we spent together, I remember naught but your quiet smile as you listened to me blather on and on about my work. It was ever the same scene, repeated over and over."},{"name":"SEVERIAN","text":"There was so much more I could have done for you. So many ways I could have made you happy. Please, forgive me..."},{"name":"WNAHJA","text":"But my dear Severian. That passion is what I love most about you..."},{"name":"WBULEA","text":"She... She's gone..."},{"name":"SEVERIAN","text":"No, she will never be gone. Not while I am here to remember her."},{"name":"SEVERIAN","text":"Do you mind if W'bulea has the wand? Though a poor substitute for her sister's body, it has been touched by W'nahja's spirit."},{"name":"SEVERIAN","text":"As for myself, my regrets have been laid to rest. I may even sleep in a bed this night."},{"name":"SEVERIAN","text":"It is strange. Though it has been scant moments since I stood at the very peak of my discipline, I am filled with an inexplicable ambition."},{"name":"SEVERIAN","text":"I stand free to devote myself to new alchemical pursuits; I might even consider shouldering a portion of the guild's commissions."},{"name":"SEVERIAN","text":"Without your help, I don't know that I would have survived my obsession. You were, without a doubt, the finest assistant any alchemist could have. I thank you."},{"name":"SEVERIAN","text":"Now that you have conquered this mountain with me, what will be your next endeavor? The realm of alchemy has no boundaries─the possibilities are endless!"},{"name":"SYSTEM","text":"This concludes the alchemist quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next alchemist quest will be available from Severian."}],"reward":{"items":[{"id":2480},{"id":2926,"one":1},{"id":3712,"one":1},{"id":3933,"one":1},{"num":2,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":15}],"quests":[66185]},"next":[67601]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1001301","obj":{"i":1001301,"n":"Memenaru","l":40,"q":3}},{"type":"npc","id":"1001309","obj":{"i":1001309,"n":"Elviane","l":40,"q":2}},{"type":"npc","id":"1001354","obj":{"i":1001354,"n":"Lalayoma","l":40,"q":1}},{"type":"npc","id":"1003927","obj":{"i":1003927,"n":"W'bulea","l":41,"q":2}},{"type":"item","id":"2480","obj":{"i":2480,"n":"Paracelsus","l":55,"c":35610,"t":24,"p":1000}},{"type":"item","id":"2926","obj":{"i":2926,"n":"Alchemist's Monocle","l":55,"c":40905,"t":34}},{"type":"item","id":"3712","obj":{"i":3712,"n":"Alchemist's Gloves","l":55,"c":44196,"t":37}},{"type":"item","id":"3933","obj":{"i":3933,"n":"Alchemist's Thighboots","l":55,"c":46356,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"1987","obj":{"i":1987,"n":"Budding Rosewood Wand","l":49,"c":32412,"t":8}},{"type":"quest","id":"66185","obj":{"i":66185,"n":"Ultimate Alchemy","g":142,"l":"Ul'dah","s":450,"f":1}},{"type":"quest","id":"67601","obj":{"i":67601,"n":"Without a Trace","g":142,"l":"Ul'dah","s":502,"f":1}}]}