{"quest":{"name":"Gulley of Woes","location":"Ul'dah","id":66181,"patch":2.0,"sort":450,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1003910,"genre":144,"usedItems":[5115],"journal":["Adalberta has a personal favor to ask of you.","Ever since losing to you in the latest contest, Wide Gulley has been taking on tasks like a man possessed. However, Adalberta suspects that more is driving him than simply the sting of defeat. Concerned for his health, she bids you speak with Wide Gulley in order to learn the truth of the matter.","Wide Gulley reveals to you that his father has been tampering with official records in order to enhance his standing in the guild. Deeply ashamed, he has taken on a throng of tasks in the hopes of turning Deep Canyon's lies into truths. Unfortunately, he has bitten off more than he can chew, and begs you to fulfill an order in his stead. Make your way to Camp Bronze Lake in upper La Noscea, and obtain twenty chunks of electrum ore on your guildmate's behalf.","You have delivered the electrum ore to a grateful Wide Gulley, who goes on to compare himself to brass─pretty to behold, but worth little. Will the man ever be able to meet the high expectations he has of himself?<br><br>※The next miner quest will be available from Adalberta upon reaching level 50."],"objectives":["Speak with Wide Gulley.","Deliver chunks of electrum ore to Wide Gulley."],"dialogue":[{"name":"ADALBERTA","text":"Ah, <span class=\"highlight\">Forename</span>. I was hoping you'd come by. I need your help with something─it concerns Wide Gulley."},{"name":"ADALBERTA","text":"He's recovered from the wounds suffered in Coerthas and resumed his mining for the guild. Wonderful news, to be sure, but one thing yet troubles me."},{"name":"ADALBERTA","text":"You see, Wide Gulley has been taking on far more tasks than a single man should. Some attribute his newfound fervor to the sting of losing that ill-conceived jade contest, but I suspect there's more to the tale."},{"name":"ADALBERTA","text":"I tried to broach the subject with him, but he's as stubborn as an aurochs, insisting it's naught but my imagination. But I know there's <span class=\"emphasis\">something</span>, and where I've failed, you might succeed. Strange though this may sound, you're the closest thing he has to a friend here."},{"name":"ADALBERTA","text":"So I beg you, <span class=\"highlight\">Forename</span>, speak with Wide Gulley and try to learn what ails him. Do what you can to ease his burdens."},{"name":"WIDEGULLEY","text":"Hmph, no doubt Adalberta sent you. She's been on me somethin' fierce since I came back. But it doesn't matter why you're here or at whose request. The simple truth is I need your help."},{"name":"WIDEGULLEY","text":"I've got a secret that would be sure to bring great shame on my family, but I need to tell <span class=\"emphasis\">someone</span>, and I know that you're an honest sort."},{"name":"WIDEGULLEY","text":"Ledgers at the Concern have been tampered with, and I'm bein' credited for work I didn't do. Wasn't keen on believin' it, but the culprit is...my own father."},{"name":"WIDEGULLEY","text":"I first suspected somethin' was off when I received my last evaluation. I know better'n anyone what I do 'round here, and I knew I wasn't workin' <span class=\"emphasis\">that</span> much."},{"name":"WIDEGULLEY","text":"I looked over the Concern's records of its dealin's with the guild, and, sure as day, I found some right damnin' evidence. Heh...didn't know whether to laugh or cry."},{"name":"WIDEGULLEY","text":"I <span class=\"emphasis\">never</span> wanted it said that I had a leg up in the guild 'cause I'm the vice foreman's son. If I was to succeed, I wanted it to be by my <span class=\"emphasis\">own</span> hands. Learnin' that my old man was falsifyin' my accomplishments was like a punch to the gut."},{"name":"WIDEGULLEY","text":"An' that's why I've been workin' so feverishly of late. By fulfillin' enough orders, I'm hopin' to turn my father's lies into truths. But I've taken on more jobs than I've got hands to juggle 'em with."},{"name":"WIDEGULLEY","text":"So, like I said, adventurer, I need your help. I'd say I'm swallowin' my pride to ask you this, but I've got no pride left. Whatever happens from here on out, I'm a miner first and foremost, and I just want to do my job."},{"name":"WIDEGULLEY","text":"Right now, the order givin' me the biggest headache is one for twenty chunks of electrum ore. You can find the stuff south of Camp Bronze Lake, over in upper La Noscea. Please hurry. And...thanks."},{"name":"WIDEGULLEY","text":"Have you got the twenty chunks of electrum ore yet? 'Case you've forgotten, you'll find them south of Camp Bronze Lake, over in upper La Noscea. Please hurry."},{"name":"WIDEGULLEY","text":"I couldn't have mined better ore myself. You've done me a great kindness."},{"name":"WIDEGULLEY","text":"Hm? Gratitude rolls queerly off my lips, does it? Mayhap that's something that comes more natural with time... 'Twas only my pride that held it back before, and as I said, I've naught of that left."},{"name":"WIDEGULLEY","text":"I have to work harder than ever now to make my fictionalized accomplishments more'n just ink on parchment. As of now, I'm a fraud, plain an' simple. Not unlike this electrum, really. 'Tis impure stuff─gold mixed up with silver an' other metals..."},{"name":"WIDEGULLEY","text":"Bah, what am I sayin'? That comparison ain't fair to electrum. At least this alloy is <span class=\"emphasis\">worth</span> somethin'."},{"name":"WIDEGULLEY","text":"You see, when refined, electrum takes on an opulent whitish hue not seen in other metals. An' there're certain things that can't be made without it, so it's prized by crafters."},{"name":"WIDEGULLEY","text":"No... No, if I'm to liken myself to any metal, it'd have to be common brass."},{"name":"WIDEGULLEY","text":"Stuff's pretty enough to look at when polished, but worth little and less."},{"name":"WIDEGULLEY","text":"Gah! I had dreams of bein' special─a one-of-a-kind type of miner everyone respected. But now...now I just..."},{"name":"WIDEGULLEY","text":"...Enough. Enough of this broodin'. I hate myself as it is─no need to add bein' a whiny sop to my list of failin's. You saved my hide today, <span class=\"highlight\">Forename</span>, an' I'll find a way to repay the debt. Mark my words."}],"reward":{"items":[{"id":2529},{"id":2837,"one":1},{"id":3909,"one":1},{"id":3188,"one":1},{"id":3653,"one":1},{"num":2,"id":5826,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":17}],"quests":[66180]},"next":[66182]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003910","obj":{"i":1003910,"n":"Wide Gulley","l":41,"q":5}},{"type":"item","id":"2529","obj":{"i":2529,"n":"Cobalt Dolabra","l":43,"c":38005,"t":28,"p":5737}},{"type":"item","id":"2837","obj":{"i":2837,"n":"Felt Coif of Gathering","l":45,"c":41598,"t":34,"p":4158}},{"type":"item","id":"3909","obj":{"i":3909,"n":"Raptorskin Workboots","l":48,"c":46215,"t":38,"p":5900}},{"type":"item","id":"3188","obj":{"i":3188,"n":"Woolen Doublet","l":46,"c":42219,"t":35,"p":6680}},{"type":"item","id":"3653","obj":{"i":3653,"n":"Fingerless Raptorskin Gloves of Gathering","l":45,"c":44103,"t":37,"p":4620}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"5115","obj":{"i":5115,"n":"Electrum Ore","l":42,"c":21217,"t":48}},{"type":"quest","id":"66180","obj":{"i":66180,"n":"To Die For","g":144,"l":"Ul'dah","s":400,"f":1}},{"type":"quest","id":"66182","obj":{"i":66182,"n":"Canyon of Regret","g":144,"l":"Ul'dah","s":500,"f":1}}]}