{"quest":{"name":"Designed by Committee","location":"Ul'dah","id":66187,"patch":2.0,"sort":350,"icon":100063,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1003915,1003916],"genre":141,"usedItems":[3125],"journal":["Redolent Rose has received another commission from a regular customer.","Wawarukka has requested your services as a weaver once more. Speak with him on Onyx Lane to learn more about the commission.","The miner explains that his previous attempt to woo Kokomo ended in failure. However, he refuses to give up, and intends to approach her wearing a new ensemble. He bids you prepare a high-quality linen shirt for this purpose. Craft the item as requested and deliver it to Redolent Rose.","To compensate for his ignorance of Ul'dahn fashion, Wawarukka enlisted the help of his friends when preparing his new outfit. Alas, the end result is a veritable hodgepodge of conflicting designs, and your linen shirt is no exception. Unable to stop the miner yet again, Redolent Rose falls to his knees and cries out in despair, only to rise to his feet moments later and excuse himself. Though it is likely a futile effort, you can only assume he wishes to pretend that the preceding events simply never occurred...<br><br>※The next weaver quest will be available from Redolent Rose upon reaching level 40."],"objectives":["Speak with Wawarukka.","Deliver a linen shirt <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"Greetings, <span class=\"highlight\">Forename</span>. If you've the time to spare, there is a task I would like to assign you."},{"name":"REDOLENTROSE","text":"Wawarukka has requested your services once more. It seems his previous attempt to woo Kokomo met with disastrous results, as I predicted."},{"name":"REDOLENTROSE","text":"It would be best if he told you the rest. Now run along. You know where to find him."},{"name":"WAWARUKKA","text":"Hey there, <span class=\"highlight\">Forename</span>. So what'd Big Rose tell you? That the Brass Blades chased me all over town? Well, it wasn't <span class=\"emphasis\">that</span> bad, but Kokomo's pa did run me off, callin' me a disgustin' pervert an' whatnot."},{"name":"WAWARUKKA","text":"But I ain't givin' up on her that easily, no sir! She's something else, my darlin' Kokomo..."},{"name":"WAWARUKKA","text":"See, one day I was makin' a delivery to Babawai's shop, when these two boys walk in an' start hasslin' the customers an' staff. So I confront the youngin's, and it gets a little heated. Long story short, I have to make 'em leave."},{"name":"WAWARUKKA","text":"I'm a little roughed up at this point, as you might expect. Then here comes Kokomo, all grace an' splendor, thankin' me for what I done. An' when our eyes meet, I suddenly realize that I can't hear a word she's sayin', 'cause my heart's poundin' harder an' fiercer than the Hammers."},{"name":"WAWARUKKA","text":"Till then, she was just a nice young girl helpin' her father. But then she had to go an' look at me like that, an' I─ &lt;sigh&gt; I wanted to say somethin', but my words left me that day. But I can do it, <span class=\"highlight\">Forename</span>! I just...I just need to do it properly─like a gentleman!"},{"name":"WAWARUKKA","text":"After talkin' with me mates in the bar, I'm thinkin' a more conservative approach is in order. If I wore, say, a quality linen shirt, it would show that I'm a responsible, respectable man. I'll meet you at the guild for the fittin' as usual, alright?"},{"name":"REDOLENTROSE","text":"Have you made your client's shirt yet? He seems quite eager to try it on."},{"name":"WAWARUKKA","text":"I've got it all worked out, <span class=\"highlight\">Forename</span>. Me mates helped me put together this new ensemble, an' your shirt will be the piece what brings it all together!"},{"name":"REDOLENTROSE","text":"Well, I think we can all agree this is far more appropriate than a leather harness!"},{"name":"WAWARUKKA","text":"Cor! This is perfect! I never knew fancy clothes could be so comfortable!"},{"name":"REDOLENTROSE","text":"SIR! Could...could you please explain how you chose those other garments!?"},{"name":"WAWARUKKA","text":"Well, the hat belongs to a goldsmith I know. Says it makes me look smarter an' whatnot."},{"name":"WAWARUKKA","text":"The subligar is courtesy of another miner. He reckons that us men what work the mines ought to flaunt our chiseled bodies─like this─an' that trousers are overrated."},{"name":"WAWARUKKA","text":"The gauntlets an' boots are the best-sellin' wares at me armorer friend's shop. Bit gaudy if you ask me, but if everyone else thinks 'em fashionable, who am I to tell 'em different?"},{"name":"WAWARUKKA","text":"Impressive, ain't it? You don't have to tell me─I can see you think the same."},{"name":"WAWARUKKA","text":"Gods, I've been such a fool! I should've asked me mates for advice from the start!"},{"name":"REDOLENTROSE","text":"BUT, SIR─I SAY, SIR!"},{"name":"REDOLENTROSE","text":"How can he be so blind!? It's absolutely, totally, and in all other ways <span class=\"emphasis\">inconceivable</span>!"},{"name":"REDOLENTROSE","text":"He's hopeless! Utterly hopeless!"},{"name":"REDOLENTROSE","text":"...Ahem. Beg your pardon, I don't know what came over me. If you'll excuse me."}],"reward":{"items":[{"id":2449},{"id":2769,"one":1},{"id":3130,"one":1},{"id":3607,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":14}],"quests":[66129]},"next":[66188]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003915","obj":{"i":1003915,"n":"Wawarukka","l":41,"q":1}},{"type":"npc","id":"1003916","obj":{"i":1003916,"n":"Wawarukka","l":41,"q":1}},{"type":"item","id":"2449","obj":{"i":2449,"n":"Worm Fang Needle","l":32,"c":35508,"t":22,"p":2460}},{"type":"item","id":"2769","obj":{"i":2769,"n":"Mythril Magnifiers","l":34,"c":40901,"t":34,"p":2953}},{"type":"item","id":"3130","obj":{"i":3130,"n":"Apprentice's Smock","l":36,"c":42185,"t":35}},{"type":"item","id":"3607","obj":{"i":3607,"n":"Linen Halfgloves","l":33,"c":44161,"t":37,"p":2195}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"3125","obj":{"i":3125,"n":"Linen Shirt","l":35,"c":42227,"t":35,"p":3369}},{"type":"quest","id":"66129","obj":{"i":66129,"n":"Miner on a Mission","g":141,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"66188","obj":{"i":66188,"n":"A Subtle Inquiry","g":141,"l":"Ul'dah","s":400,"f":1}}]}