{"quest":{"name":"Ultimate Alchemy","location":"Ul'dah","id":66185,"patch":2.0,"sort":450,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[4607,4608,4606],"journal":["Guildmaster Severian appears in frantic need of your assistance.","It seems that Severian's long-awaited alchemical process has failed to yield the expected results. Without offering an explanation, the frenzied alchemist demands you bring him a number of high-quality concoctions. Create three extraordinary mega-potions─one of intelligence, one of mind, and one of vitality─and deliver the completed substances to the guildmaster.","You have delivered the three mega-potions to the agitated guildmaster. After inspecting your superb creations and regaining a measure of composure, Severian finally explains the reason behind his obsessive research─he means to resurrect W'nahja, the love he lost to the Calamity. With a new batch of components in hand, the determined alchemist returns to his workbench to begin a new attempt. Once more, you are helpless to do anything but await the results...<br><br>※The next alchemist quest will be available from Severian upon reaching level 50."],"objectives":["Deliver a mega-potion of intelligence <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a mega-potion of mind <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a mega-potion of vitality <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Severian."],"dialogue":[{"name":"SEVERIAN","text":"This is beyond comprehension! My experiments were conclusive, and yet there remains some fatal flaw in the process..."},{"name":"SEVERIAN","text":"Where does the fault lie? The method? The materials? My interpretation of the results? Must I resort to thaumaturgy, after all...? No, such energies will raise naught but a mockery of life."},{"name":"SEVERIAN","text":"Agh, what an utter failure! I must retrace my steps─start again from the beginning. No matter how many times it takes, I will see my alchemy succeed!"},{"name":"SEVERIAN","text":"<span class=\"emphasis\">You</span>! Assistant! Bring me three mega-potions: one each of intelligence, mind, and vitality! And they <span class=\"emphasis\">must</span> be of unquestionable quality!"},{"name":"SEVERIAN","text":"I care not for excuses! I need─ I need you to..."},{"name":"SEVERIAN","text":"Please, my friend... I need your help."},{"name":"SEVERIAN","text":"The mega-potions, dear assistant, please! Intelligence! Mind! Vitality! And do not think to fool me with some batch of mediocre marvels."},{"name":"SEVERIAN","text":"Yes! ...Yes. These are suitably superb. As ever, your work is swift, precise, and uncommonly brilliant."},{"name":"SEVERIAN","text":"Black scorpion to sharpen one's wit; ahriman membrane for the mind; boiled grenade ash to fuel vitality."},{"name":"SEVERIAN","text":"All are necessary components in the alchemical process I attempted earlier─the selfsame one that ended so abominably... On that matter, I offer my apologies. I was so unwaveringly confident of success that my failure put me in a frenzy to gather a new batch of reagents posthaste."},{"name":"SEVERIAN","text":"And to manage such a feat quickly meant I could not do it alone. I <span class=\"emphasis\">was</span> able, however, to prepare another incomparable mega-potion of strength while you were at work on these potations."},{"name":"SEVERIAN","text":"Properly combined, these four of the primary attributes─strength, vitality, intelligence, and mind─can effect <span class=\"emphasis\">mortal resurrection</span>. And now, my dear assistant, you understand what I hope to achieve with this highest of alchemy."},{"name":"SEVERIAN","text":"Does this revelation shock you? Did you think the dead beyond our reach? That is certainly the common perception. And even <span class=\"emphasis\">I</span> am forced to acknowledge the seeming insanity of my actions."},{"name":"SEVERIAN","text":"But I believe in alchemy's unlimited potential. It was the cause of my regret, and it shall be the source of my salvation. I have spent too long on this path to veer from it now."},{"name":"SEVERIAN","text":"Do you recall the time we spoke of W'nahja? She was the elder sister of W'bulea, the Miqo'te to whom you delivered those potions of blindness. W'nahja was...is...my one and only love. She was taken from me during the Calamity."},{"name":"SEVERIAN","text":"But I <span class=\"emphasis\">will</span> see her live again. I will not rest until the day I can tell her the one thing she must know..."}],"reward":{"items":[{"id":2477},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":15}],"quests":[66184]},"next":[66186]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"2477","obj":{"i":2477,"n":"Electrum Alembic","l":43,"c":35602,"t":24,"p":5249}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4607","obj":{"i":4607,"n":"Mega-Potion of Intelligence","l":50,"c":20668,"t":44,"p":950}},{"type":"item","id":"4608","obj":{"i":4608,"n":"Mega-Potion of Mind","l":50,"c":20669,"t":44,"p":950}},{"type":"item","id":"4606","obj":{"i":4606,"n":"Mega-Potion of Vitality","l":50,"c":20666,"t":44,"p":950}},{"type":"quest","id":"66184","obj":{"i":66184,"n":"Might Made Right","g":142,"l":"Ul'dah","s":400,"f":1}},{"type":"quest","id":"66186","obj":{"i":66186,"n":"Momentary Miracle","g":142,"l":"Ul'dah","s":500,"f":1}}]}