{"quest":{"name":"Canyon of Regret","location":"Ul'dah","id":66182,"patch":2.0,"sort":500,"icon":100058,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1002298,"involved":[1003909,1003910],"genre":144,"usedItems":[5121],"journal":["Adalberta is gravely concerned for the fate of an old friend.","The flustered Adalberta reveals to you that Wide Gulley has reported his father's abuse of power to the Concern's upper management. The guildmaster bids you speak with Wide Gulley and learn all you can of the situation, that she might help her old friend and mentor.","Wide Gulley admits that he has filed an official complaint to the Concern, so ashamed he was of his father's actions. He suggests you speak with the accused in order to hear his side of the story.","Deep Canyon reveals that his actions were fueled by the long-standing desire to bring down Adalberta for her betrayal years ago. Deliver this shocking revelation to your guildmaster.","According to Adalberta, Deep Canyon's belief that she betrayed him is nothing but a misunderstanding. Loath to see him destroy his career due to this perceived slight, she bids you speak with Wide Gulley, and with him find a way to save his father.","In order to prove that he is fit to remain vice foreman, Deep Canyon must demonstrate to the Concern that he still has the confidence of guild members. To this end, you must procure three chunks of darksteel ore, an extremely rare metal found only from unspoiled mineral deposits in Coerthas. You are warned that these deposits only appear during certain times of day. Use the technique Truth of Mountains to locate darksteel ore that appears in the Coerthas central highlands at 1:00 a.m. (Eorzea time), mine the required quantity, and return it to Adalberta as quickly as you are able.","Owing to your intervention, Deep Canyon has been given a chance to redeem himself. With the matter now laid to rest, speak once more with the relieved Adalberta, who awaits you in the Miners' Guild.","Adalberta thanks you for the part you played in sparing Deep Canyon a fate of ignominy, and lavishes you with praise for your growth as a miner. She bids you go forth and practice your craft for the benefit of all. May your toils never go unrewarded!<br><br>※The next miner quest will be available from Adalberta once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Wide Gulley.","Speak with Deep Canyon.","Speak with Adalberta.","Speak with Wide Gulley.","Deliver chunks of darksteel ore to Adalberta.","Speak with Adalberta."],"dialogue":[{"name":"ADALBERTA","text":"<span class=\"highlight\">Forename</span>, thank the gods you're here! It's Wide Gulley... He's gone and filed a complaint against his father to the Concern, citing an abuse of power!"},{"name":"ADALBERTA","text":"It has forced Deep Canyon into a difficult position, to say the least. And though the two of us haven't exactly seen eye to eye of late, I still owe the man a great debt. I would go to him and offer what aid I could, but he's like to spurn even the attempt."},{"name":"ADALBERTA","text":"I know full well how much I've already asked of you, but I would be <span class=\"emphasis\">eternally</span> grateful if you'd lend Deep Canyon aid in my stead. To get started, it might be best to see what possessed his son to inform on his own flesh and blood."},{"name":"WIDEGULLEY","text":"Here at the guildmaster's biddin' again? Well, I see no reason not to tell you about the situation. You know most everythin', anyroad."},{"name":"WIDEGULLEY","text":"My old man was foistin' dangerous jobs on the guild, forcin' its members to risk life and limb fer his own agenda. If that ain't the very definition of abuse, I don't know what is. You yourself were on the receivin' end o' this, I'm sure you'll recall."},{"name":"WIDEGULLEY","text":"Kin or no, I couldn't stand by an' watch my guildmates bein' used like pawns in his game. So I went to the Concern's upper management an' filed a complaint."},{"name":"WIDEGULLEY","text":"He hasn't said a word to me since, but I'd have a guess that he might be willin' to speak with <span class=\"emphasis\">you</span>. You've certainly done your fair share fer the guild. He's out by the entrance right now, 'case you want to hear his side of the story."},{"name":"DEEPCANYON","text":"It's been some time, <span class=\"highlight\">Forename</span>. You're doubtless here as regards my son's accusations. Well, it's just as he claims."},{"name":"DEEPCANYON","text":"Now, this ain't gonna spare me what's comin', but I had a reason for my actions: vengeance. <span class=\"emphasis\">I</span> was supposed to become master of the Miners' Guild. Everyone knew I had the best claim. But Adalberta robbed me of the honor─<span class=\"emphasis\">me</span>, the man who taught her nigh everythin' she knows about her trade!"},{"name":"DEEPCANYON","text":"She went behind my back and conspired with her predecessor! An' then <span class=\"emphasis\">fancy</span> who ended up bein' chosen to lead... By way of payback, ever since I became vice foreman, I've striven to make Adalberta's life harder than tryin' to mine with a dull pickaxe."},{"name":"DEEPCANYON","text":"All those outrageous demands? To make her look incompetent. At the same time, I went about ensurin' my son was well placed to take over as guildmaster. An' my plan was about to bear fruit, too...till <span class=\"emphasis\">you</span> came along and ruined it all by bein' my son's better."},{"name":"DEEPCANYON","text":"Heh... By your expression, I take it you're doubtful of the tale. Well, you need only ask your dear guildmaster. She can vouch for everythin' I've said."},{"name":"WIDEGULLEY","text":"If you're wonderin' where my father vanished to, he's been summoned to an inquest. The chairman of the Concern himself, Master Fyrgeiss, will be in attendance. An' that's just the beginnin'."},{"name":"WIDEGULLEY","text":"The chief foreman's sons will be present as well─the twins Popokkuli and Seserukka. It'll be a sight to behold, all the guild's top players in one spot. An' it won't go easy for him, you can be sure of that."},{"name":"ADALBERTA","text":"What!? Deep Canyon believes <span class=\"emphasis\">I</span> cheated him out of becoming guildmaster!? That's not it at all! I <span class=\"emphasis\">never</span> aspired to this position..."},{"name":"ADALBERTA","text":"Gods, I was only an Ala Mhigan refugee, working as hard as I could to get by... I never even <span class=\"emphasis\">dreamed</span> that I could rise as I did. And I suspected even less that it was that selfsame dedication to my work that would lead to me being chosen."},{"name":"ADALBERTA","text":"If I had known that accepting the mantle would tear us apart... &lt;sigh&gt; Lamenting the past won't avail us. I only know that I wouldn't be where I am without the man. I <span class=\"emphasis\">can't</span> allow this misunderstanding to cost Deep Canyon everything."},{"name":"ADALBERTA","text":"I simply couldn't bear it. I'm not sure there's aught we can still do for him at this point, but we must try."},{"name":"ADALBERTA","text":"Listen. Wide Gulley is the one who filed the complaint. If you were to throw your own weight behind some of my concerns, then maybe...maybe he could yet do something. Please, <span class=\"highlight\">Forename</span>. It would mean so much."},{"name":"WIDEGULLEY","text":"Adalberta wants to help my old man? &lt;sigh&gt; Truth be told, it ain't my wish to see his career destroyed neither. I only wanted to teach him a lesson─make him know that he can't just use people for his own ends."},{"name":"WIDEGULLEY","text":"But now that the Concern knows, it's been taken out o' my hands. In their eyes, my father's actions've jeopardized relations with the Miners' Guild, an' nothin' could be worse."},{"name":"WIDEGULLEY","text":"So, they've given him a test. If he's to remain vice foreman, he must prove at the inquest that he still has the confidence of the guild."},{"name":"WIDEGULLEY","text":"An' they ain't interested in no words─they want hard evidence. That is to say, they're demandin' that someone from the guild show him loyalty by goin' an' diggin' up three of the toughest damn chunks of ore there is to find: darksteel."},{"name":"WIDEGULLEY","text":"Problem is, he's got no allies in the guild, on account of his own behavior. I certainly don't qualify for the task, bein' his son. An' Adalberta can't do it neither, 'cause she's the bleedin' guildmaster─that's just how it works."},{"name":"WIDEGULLEY","text":"This leaves you, <span class=\"highlight\">Forename</span>. We don't have much time before the inquest begins, so you'll have to hurry. An' I wasn't exaggeratin' afore─darksteel's elusive as all hells, located in the snowy reaches o' Coerthas an' nowhere else."},{"name":"WIDEGULLEY","text":"To actually find the stuff, you'll first need to use your Truth of Mountains technique to locate unspoiled mineral deposits. Then─an' gods know why─you'll have to survive a night in the cold for the deposits to reveal 'emselves. Finally, you dig...an' you pray."},{"name":"WIDEGULLEY","text":"When you have enough chunks of darksteel ore, take 'em to Adalberta. I'll make sure she knows what's goin' on."},{"name":"SYSTEM","text":"Use the technique Truth of Mountains to locate darksteel ore that appears in the Coerthas central highlands at 1:00 a.m. (Eorzea time), mine the required quantity, and return it to Adalberta as quickly as you are able."},{"name":"ADALBERTA","text":"Wide Gulley's told me all about the situation. Be sure you bring in the darksteel ore as soon as you've got it."},{"name":"ADALBERTA","text":"Now, I feel this bears mentioning, but regarding how to go about obtaining the ore... It may sound ridiculous, but it's exactly as Wide Gulley says."},{"name":"ADALBERTA","text":"You'll need the endurance to survive a night in Coerthas, and the technique Truth of Mountains to locate unspoiled mineral deposits. Twelve speed your way!"},{"name":"ADALBERTA","text":"Incredible, <span class=\"highlight\">Forename</span>! Your talents are truly boundless. Hopefully, these will suffice to spare Deep Canyon. But let's make haste to the inquest. Wide Gulley is already on his way."},{"name":"POPOKKULI","text":"Well, did you get a guild member to bring you darksteel ore? 'Cause make no mistake, Deep Canyon, if you came to this inquest empty-handed, we will <span class=\"emphasis\">end</span> you. Your time with the Concern will be just a memory."},{"name":"DEEPCANYON","text":"Ungh, I... Well..."},{"name":"ADALBERTA","text":"We have the ore right here, procured by <span class=\"highlight\">Forename Surname</span> of the Miners' Guild!"},{"name":"SESERUKKA","text":"Twelve be good, she isn't lying! This is darksteel, and some of the finest I've ever seen."},{"name":"POPOKKULI","text":"Hmph. It's no ordinary miner who can find darksteel, let alone stuff that looks this good. Seems your reputation is well earned."},{"name":"POPOKKULI","text":"That said, we're hardly here to question your ability. Though I find myself wondering as to your motives. Why did you bring the ore?"},{"name":"SESERUKKA","text":"Aye, I'd know the same. Why stick your neck out for <span class=\"emphasis\">him</span>? He's given you nothing but trouble!"},{"name":"DEEPCANYON","text":"What in the seven hells're you tryin' to pull, Adalberta!? I don't need anyone's pity, yours least of all!"},{"name":"ADALBERTA","text":"I'm not here to give you my pity, but to clear up the misunderstanding between us!"},{"name":"DEEPCANYON","text":"Misunderstandin'...?"},{"name":"ADALBERTA","text":"Listen to me, Deep Canyon. I never wanted to become guildmaster! The responsibility was thrust upon me, and there was naught to be done for it."},{"name":"ADALBERTA","text":"Gods, when my name was being bandied about for the position, my first instinct was to take myself out of consideration. Aye, I spoke to the guildmaster in private, as you say. But it wasn't to connive against you─it was to give up my claim!"},{"name":"DEEPCANYON","text":"Y-You expect me to believe that!?"},{"name":"ADALBERTA","text":"If I had truly betrayed you back then, would I have bothered to come here?"},{"name":"DEEPCANYON","text":"B-But...if that's true, then everythin' I've done... By the Twelve, to have taken this so far..."},{"name":"WIDEGULLEY","text":"You didn't want to admit defeat, Father. Adalberta beat you out on her own merits. You knew this in your heart, but you refused to accept it."},{"name":"WIDEGULLEY","text":"In your pride, you convinced yourself that she betrayed you. But by doin' so, you only validated why you were passed over for guildmaster in the first place."},{"name":"WIDEGULLEY","text":"Please, Father, let go of the past. Accept that you were beaten, as I have with <span class=\"highlight\">Forename</span>, and let's start over."},{"name":"ADALBERTA","text":"You have it in you to do so, Deep Canyon─to begin anew. I know of your love for mining more than anyone."},{"name":"ADALBERTA","text":"If you would be willing to try again, I promise you the guild's full cooperation."},{"name":"SESERUKKA","text":"Full cooperation? Are you <span class=\"emphasis\">sure</span> about this?"},{"name":"ADALBERTA","text":"Aye, I would leave the past where it belongs─in the past. The guild wants only to look forward, and to continue working with the Concern."},{"name":"ADALBERTA","text":"<span class=\"highlight\">Forename</span> was the biggest victim in this whole affair, yet <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is willing to give Deep Canyon another chance. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> wouldn't have brought the darksteel ore otherwise."},{"name":"POPOKKULI","text":"That's well and good, but what about <span class=\"emphasis\">you</span>? Can you really forget everything he's done?"},{"name":"ADALBERTA","text":"...I can. Above all else, I miss my old friend and mentor. To get him back, I would forgive much and more."},{"name":"DEEPCANYON","text":"A-Adalberta..."},{"name":"POPOKKULI","text":"Well, I'm inclined to lay this matter to rest. Any objections, Sese?"},{"name":"SESERUKKA","text":"If you're satisfied, Brother, then so am I."},{"name":"FYRGEISS","text":"Then it is settled! Vice Foreman Deep Canyon, by request of the Miners' Guild, you shall retain your present office at Amajina & Sons Mineral Concern. Through hard work, I trust that you will make amends for past transgressions."},{"name":"ADALBERTA","text":"&lt;sigh&gt; I'm full glad that it's over... <span class=\"highlight\">Forename</span>, I would have a word with you in private. Would you mind returning to the guild with me?"},{"name":"ADALBERTA","text":"I asked you here so that I might thank you properly."},{"name":"ADALBERTA","text":"Had you not been on hand to help, Deep Canyon's career would have ended prematurely, and in disgrace."},{"name":"ADALBERTA","text":"Worse, I might have lost my dear friend forever. I owe you a debt that I'll likely never be able to repay."},{"name":"ADALBERTA","text":"Ah, but look at you. In no time at all, you've grown into a miner who can make the earth yield up even darksteel ore, the rarest of metals. There's nothing left for me to teach you."},{"name":"ADALBERTA","text":"As an adventurer, you're like to find yourself in all corners of the realm. But wherever your road takes you, I want you to practice our craft for the good of all."},{"name":"ADALBERTA","text":"Go well, <span class=\"highlight\">Forename</span>, and may your toils never go unrewarded!"},{"name":"SYSTEM","text":"This concludes the miner quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next miner quest will be available from Adalberta."}],"reward":{"items":[{"id":2532},{"id":2928,"one":1},{"id":3489,"one":1},{"id":3714,"one":1},{"id":3935,"one":1},{"num":3,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":17}],"quests":[66181]},"next":[67616]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1003909","obj":{"i":1003909,"n":"Deep Canyon","l":41,"q":2}},{"type":"npc","id":"1003910","obj":{"i":1003910,"n":"Wide Gulley","l":41,"q":5}},{"type":"item","id":"2532","obj":{"i":2532,"n":"Mammon","l":55,"c":38013,"t":28,"p":1000}},{"type":"item","id":"2928","obj":{"i":2928,"n":"Hamlet Digger's Helmet","l":55,"c":40060,"t":34}},{"type":"item","id":"3489","obj":{"i":3489,"n":"Miner's Slops","l":55,"c":45331,"t":36}},{"type":"item","id":"3714","obj":{"i":3714,"n":"Miner's Gloves","l":55,"c":44189,"t":37}},{"type":"item","id":"3935","obj":{"i":3935,"n":"Miner's Workboots","l":55,"c":46349,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"5121","obj":{"i":5121,"n":"Darksteel Ore","l":55,"c":21205,"t":48}},{"type":"quest","id":"66181","obj":{"i":66181,"n":"Gulley of Woes","g":144,"l":"Ul'dah","s":450,"f":1}},{"type":"quest","id":"67616","obj":{"i":67616,"n":"Breaking New Ground","g":144,"l":"Ul'dah","s":502,"f":1}}]}