{"quest":{"name":"Might Made Right","location":"Ul'dah","id":66184,"patch":2.0,"sort":400,"icon":100047,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"genre":142,"usedItems":[4599],"journal":["Guildmaster Severian appears beside himself with excitement.","Severian claims to have finally uncovered the recipe he needs to move forward with the ultimate alchemical process. Assist the eccentric alchemist with preparing the necessary ingredients by concocting three unusually potent hi-potions of strength.","Your extraordinary vials of vigor have been received with Severian's customary enthusiasm. Though remaining somewhat vague as to the actual result he hopes to achieve with this ambitious alchemical undertaking, the guildmaster states that he is ready to begin the long and demanding process. There is little left to do but return to your studies while you await its completion...<br><br>※The next alchemist quest will be available from Severian upon reaching level 45."],"objectives":["Deliver hi-potions of strength <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Severian."],"dialogue":[{"name":"SEVERIAN","text":"Hm hm hm. Heh heh heh. Mwahahahahaha!"},{"name":"SEVERIAN","text":"Where have you been, my tardy assistant!? I feared I would have to begin applauding myself. Did you bring the wine to toast this momentous occasion? No? Well, no matter. Let us not waste time with such extraneous celebrations!"},{"name":"SEVERIAN","text":"The ecstatic rush of triumph within my breast has me sufficiently intoxicated. For I have, at long last, unlocked the secrets of the ultimate expression of alchemy!"},{"name":"SEVERIAN","text":"After countless hours of research and experiments too numerous to mention, I finally hold in my hand the exact recipe required to effect my heart's desire!"},{"name":"SEVERIAN","text":"Come, my astute apprentice, together we shall swing wide the gates of alchemical history. You will aid me by concocting a share of the necessary ingredients."},{"name":"SEVERIAN","text":"Your task entails the creation of three hi-potions of strength. And, as you have most likely deduced, they should be brews of extraordinary potency."},{"name":"SEVERIAN","text":"While you are mixing those vials of vigor, I will be occupied with my own preparations. There is much work to be done for the both of us!"},{"name":"SEVERIAN","text":"Well? Do you have those hi-potions of strength for me? Remember: only the most splendid samples are suitable for a process this demanding and delicate."},{"name":"SEVERIAN","text":"Hmmm... I shall have to improve the quality of the materials I prepared if they are to be successfully combined with yours."},{"name":"SEVERIAN","text":"Merely holding on to the vials, I can feel tendrils of might seeping into my weary frame. You have done well to preserve the power inherent in the limbs of a bog yarzon."},{"name":"SEVERIAN","text":"Why, these concoctions would imbue even the scrawniest of men with a strength to rival Rhalgr Himself. If all of the ingredients match this level of quality, our success in this endeavor is assured!"},{"name":"SEVERIAN","text":"...Ah, did I perhaps fail to mention exactly <span class=\"emphasis\">what</span> this most ambitious of alchemical processes was intended to achieve?"},{"name":"SEVERIAN","text":"Well, rather than inconvenience us both with an extremely lengthy and technical explanation, it may be faster for me to simply exhibit the results. This is, after all, the culmination of years of dedication and sacrifice."},{"name":"SEVERIAN","text":"It may very well be that my efforts will end in misery. But one must at least make the attempt...or suffer the endless guilt of inaction."},{"name":"SEVERIAN","text":"The time for talk is at an end. I shall now begin the process."},{"name":"SEVERIAN","text":"From this moment onwards, I must needs have unbroken concentration and solitude. Your devoted assistance has been most appreciated─aside from myself, you shall be the first to discover what the ultimate alchemical technique has achieved."}],"reward":{"items":[{"id":2489},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":15}],"quests":[66183]},"next":[66185]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"item","id":"2489","obj":{"i":2489,"n":"Apprentice's Mortar","l":40,"c":35655,"t":25}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4599","obj":{"i":4599,"n":"Hi-Potion of Strength","l":35,"c":20665,"t":44}},{"type":"quest","id":"66183","obj":{"i":66183,"n":"Cease and Assist","g":142,"l":"Ul'dah","s":350,"f":1}},{"type":"quest","id":"66185","obj":{"i":66185,"n":"Ultimate Alchemy","g":142,"l":"Ul'dah","s":450,"f":1}}]}