{"quest":{"name":"A Miner Reborn","location":"Ul'dah","id":66190,"patch":2.0,"sort":500,"icon":100063,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1003921,1003924],"genre":141,"usedItems":[3215,3475,2895],"journal":["Redolent Rose is furrowing his brow most furiously.","Mamajaru, the wealthy Lalafell for whom you once crafted an acton, intends to propose to Kokomo. Upon learning of this, Wawarukka rushes to the guild, exclaiming that he must tell the girl how he feels before it's too late. To that end, he begs you and Redolent Rose for a set of fine garments so he can make the best possible impression. Craft and deliver a high-quality pair of patrician's bottoms, a high-quality patrician's wedge cap, and a high-quality patrician's coatee to Redolent Rose─the guildmaster will prepare the other pieces.","Wawarukka is overjoyed by the ensemble you and the guildmaster have prepared. However, it may all be for naught─Kokomo is currently in the company of Mamajaru, and the guildmaster suspects that the proposal may be imminent. Wawarukka quickly departs for the Gold Court to see Kokomo, and Redolent Rose bids you follow to observe what transpires.","Though hesitant at first, Wawarukka rushes to Kokomo's side when Mamajaru attempts to strike her in a fit of anger. Filled with newfound confidence, he confronts the wealthy heir, who then flees. Now alone, Wawarukka and Kokomo stare deep into each other's eyes and begin a long-overdue conversation. Having observed that things are proceeding smoothly, you quietly excuse yourself. Return to the Weavers' Guild and tell Redolent Rose what you saw.","Upon hearing your account, Redolent Rose cannot help but laugh. Though clearly pleased to have helped the two young Lalafells, he asserts that he has acted only as a professional serving his clients. The future of Wawarukka and Kokomo's relationship is hardly certain, but he nevertheless compliments you on a job well done.<br><br>※The next weaver quest will be available from Redolent Rose once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Deliver a pair of patrician's bottoms <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a patrician's wedge cap <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a patrician's coatee <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Redolent Rose.","Follow Wawarukka to the Gold Court.","Speak with Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"If you've come in search of work, <span class=\"highlight\">Forename</span>, I'm afraid I have nothing for you."},{"name":"REDOLENTROSE","text":"However, there is something I would like to discuss with you. It concerns Kokomo, and the young man currently courting her."},{"name":"REDOLENTROSE","text":"You see, it is none other than─"},{"name":"WAWARUKKA","text":"<span class=\"highlight\">Forename</span>! Big Rose! Please, you gotta help me!"},{"name":"WAWARUKKA","text":"&lt;pant&gt; &lt;pant&gt; Clothes! I need new clothes!"},{"name":"REDOLENTROSE","text":"Please, sir, you must get hold of yourself. Tell us what has driven you into this frenzy."},{"name":"WAWARUKKA","text":"He's gonna... &lt;pant&gt; He's gonna propose to Kokomo! Mamajaru─he's gonna propose!"},{"name":"WAWARUKKA","text":"I know it ain't my place, an' I might just be gettin' in the way─but dammit, I've gotta tell her how I feel before it's too late!"},{"name":"WAWARUKKA","text":"But if I meet her wearin' my usual duds, she'll reject me without a second thought!"},{"name":"WAWARUKKA","text":"I need a fightin' chance! I need you two to do what you do best an' make me the finest clothes you can!"},{"name":"REDOLENTROSE","text":"One would have to possess a heart of stone to refuse an impassioned plea like that. Wouldn't you agree, <span class=\"highlight\">Forename</span>?"},{"name":"REDOLENTROSE","text":"If we are to send him against Mamajaru, we must furnish him with such garments as befit his passion."},{"name":"REDOLENTROSE","text":"Prepare a pair of patrician's bottoms, a patrician's wedge cap, and a patrician's coatee. I will see to his gloves and shoes. Each piece must be flawless, without exception. Together, we shall fashion a suit of armor for our young warrior."},{"name":"WAWARUKKA","text":"Thank you both so much! I...I know I won't fail with you two on my side!"},{"name":"WAWARUKKA","text":"Please hurry, <span class=\"highlight\">Forename</span>! I've gotta say my piece before it's too late!"},{"name":"REDOLENTROSE","text":"I trust you understand what's at stake, <span class=\"highlight\">Forename</span>. Bring me a pair of patrician's bottoms, a patrician's wedge cap, and a patrician's coatee of the finest quality."},{"name":"REDOLENTROSE","text":"Your garments are ready, good sir. Allow me to assist you."},{"name":"WAWARUKKA","text":"Gods almighty, is this really me...?"},{"name":"REDOLENTROSE","text":"If I may be so bold, I think this is quite possibly our finest work yet!"},{"name":"WAWARUKKA","text":"I feel like I'm someone else, like a prince at a fancy ball, or─"},{"name":"REDOLENTROSE","text":"Hah! Sir, I have known princes. I am pleased to say that you are <span class=\"emphasis\">nothing</span> like they."},{"name":"WAWARUKKA","text":"Big Rose, I...I don't know what to say. Thank you. I think I'm finally ready to see Kokomo."},{"name":"REDOLENTROSE","text":"Ah, yes. About that─I would advise you to make haste. I suspect Mamajaru will make his intentions known ere long."},{"name":"WAWARUKKA","text":"What!? Are you sure!?"},{"name":"REDOLENTROSE","text":"I cannot say for certain, but a little bird tells me that Mamajaru and Kokomo are at present in the Gold Court. An ideal location for a romantic proposal, wouldn't you agree?"},{"name":"WAWARUKKA","text":"&lt;gasp&gt; I gotta hurry, while there's still time! Thanks, Big Rose!"},{"name":"REDOLENTROSE","text":"<span class=\"highlight\">Forename</span>, be a dear and follow him. I would very much like to know how this all plays out."},{"name":"MAMAJARU","text":"And then the idiot had the gall to say that I knew nothing of business! To which I replied, of course I don't─why bother when you know the men who <span class=\"emphasis\">own</span> them!"},{"name":"KOKOMO","text":"Uh..."},{"name":"MAMAJARU","text":"When I speak to you, I expect your full attention! I'll teach you how to behave, woman!"},{"name":"MAMAJARU","text":"No, don't!"},{"name":"WAWARUKKA","text":"How dare you raise your hand against a lady!"},{"name":"WAWARUKKA","text":"Kokomo, are you alright?"},{"name":"KOKOMO","text":"Do...do I know you, sir?"},{"name":"WAWARUKKA","text":"It's me, Kokomo. Wawarukka. I made a few deliveries to your father's shop. Not recently, I suppose, but─"},{"name":"KOKOMO","text":"Wawarukka!? But...why are you here? And why are you dressed like that?"},{"name":"WAWARUKKA","text":"For you, Kokomo. There's somethin' I've been meanin' to tell you─"},{"name":"MAMAJARU","text":"I don't know who you are, but you will turn around and face me right this─"},{"name":"MAMAJARU","text":"Y-You've made a powerful enemy today, my friend!"},{"name":"KOKOMO","text":"I've never seen anyone stand up to Mamajaru like that before..."},{"name":"WAWARUKKA","text":"I s'pose they lacked the proper motivation."},{"name":"KOKOMO","text":"I was hoping you would come visit again. But then you kept wearing such strange outfits..."},{"name":"KOKOMO","text":"Promise me you won't do that again."},{"name":"WAWARUKKA","text":"A-As you wish."},{"name":"REDOLENTROSE","text":"Ah, <span class=\"highlight\">Forename</span>. Tell me everything."},{"name":"REDOLENTROSE","text":"Hah! I would have liked to have seen that."},{"name":"REDOLENTROSE","text":"Hm? How did I learn of Mamajaru's plans, you ask? From the man himself, of course. He's not the sort to keep his grand designs private."},{"name":"REDOLENTROSE","text":"Do not misunderstand. I am not some rank sentimentalist. I have acted only in my capacity as a weaver to help a client─just as you have."},{"name":"REDOLENTROSE","text":"As for our young couple...well, to be frank, calling them a couple is a tad premature. Babawai will doubtless have objections given Wawarukka's modest origins. Nevertheless, I think our young gentleman has finally found the courage to stand up for himself."},{"name":"REDOLENTROSE","text":"You should be proud. This could be the beginning of a beautiful relationship─one which would owe much to your skill."},{"name":"REDOLENTROSE","text":"Well done, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Well done indeed."},{"name":"SYSTEM","text":"This concludes the weaver quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next weaver quest will be available from Redolent Rose."}],"reward":{"items":[{"id":2455},{"id":2925,"one":1},{"id":3711,"one":1},{"id":3932,"one":1},{"num":2,"id":5826,"one":1}],"xp":432000},"reqs":{"jobs":[{"lvl":50,"id":14}],"quests":[66189]},"next":[67538]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003921","obj":{"i":1003921,"n":"Wawarukka","l":41,"q":1}},{"type":"npc","id":"1003924","obj":{"i":1003924,"n":"Wawarukka","l":41,"q":1}},{"type":"item","id":"2455","obj":{"i":2455,"n":"Clotho","l":55,"c":35511,"t":22,"p":1000}},{"type":"item","id":"2925","obj":{"i":2925,"n":"Weaver's Gibus","l":55,"c":41143,"t":34}},{"type":"item","id":"3711","obj":{"i":3711,"n":"Weaver's Gloves","l":55,"c":44190,"t":37}},{"type":"item","id":"3932","obj":{"i":3932,"n":"Weaver's Thighboots","l":55,"c":46350,"t":38}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"3215","obj":{"i":3215,"n":"Patrician's Coatee","l":50,"c":42340,"t":35,"p":6177}},{"type":"item","id":"3475","obj":{"i":3475,"n":"Patrician's Bottoms","l":50,"c":45359,"t":36,"p":4752}},{"type":"item","id":"2895","obj":{"i":2895,"n":"Patrician's Wedge Cap","l":50,"c":41177,"t":34,"p":4989}},{"type":"quest","id":"66189","obj":{"i":66189,"n":"The Intervention","g":141,"l":"Ul'dah","s":450,"f":1}},{"type":"quest","id":"67538","obj":{"i":67538,"n":"The Social Knitwork","g":141,"l":"Ul'dah","s":502,"f":1}}]}