{"quest":{"name":"The Horns of the Green","location":"Ul'dah","id":66192,"patch":2.0,"sort":400,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"involved":[1004098],"genre":139,"usedItems":[2125],"journal":["Serendipity has another commission for you.","Once again, Roroton has decided to request your services by name. Craft a high-quality horn staff and present it to Serendipity for inspection.","Gigi and Serendipity both agree that your growth as a goldsmith is undeniable. Since you have not spoken with Roroton in some time, Serendipity suggests that you deliver the staff in person. Seek out the merchant at the Ruby Road Exchange in the Steps of Nald.","Roroton is happy to see you again, and is surprised that you have already finished the staff. Your conversation soon turns to the topic of the Jade Fox, a legendary thief and master of disguise rumored to have come to Ul'dah. Roroton urges you and your guildmates to be careful, as the Jade Fox is known to have a penchant for fine jewelry. Report to Serendipity at the Goldsmiths' Guild and inform her that the commission is complete.","Serendipity congratulates you on another successful assignment, and echoes Roroton's warning about the Jade Fox. However, she states that you need not worry about any commissions made through the Goldsmiths' Guild, as she will personally scrutinize each and every customer. Whether or not her confidence is justified remains to be seen...<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 45."],"objectives":["Present a horn staff <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Serendipity.","Deliver the horn staff <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Roroton.","Report to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"Good to see you again! You'll be pleased to know that Gigi is completely back to normal. Why, when Roroton was here not too long ago, he only had to contend with Gigi's traditional repertoire of insults."},{"name":"SERENDIPITY","text":"You know what I mean, I'm sure─that Roroton was a hopeless fool, that he was completely devoid of artistic sensibilities, that he smelt of rolanberries─that sort of thing."},{"name":"SERENDIPITY","text":"Oh, don't get me wrong; it was still terribly distressing. <span class=\"emphasis\">But</span>, at least there was no more talk of fires."},{"name":"SERENDIPITY","text":"Anyway, as for why Roroton was here in the first place, he wished to commission you once more─this time, for a horn staff. It goes without saying that he desires a staff of the highest quality, so please bear that in mind before you present your work to me for inspection. Good luck!"},{"name":"SERENDIPITY","text":"Oh, have you finished the horn staff already?"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>HoRn...StAfF...aHa! So ThIs Is GrEeNhOrN's StAfF! yOu ArE iMpRoViNg."},{"name":"GIGI","text":"PeRhApS gReEnHoRn HaS fInAlLy OuTgRoWn <span class=\"alternative-container\"><span class=\"alternative\">HeR</span><span class=\"alternative\">HiS</span></span> tItLe! I mUsT tHiNk Of A mOrE sUiTaBlE oNe─SoMeThInG tHaT aCkNoWlEdGeS yOuR rEcEnT gRoWtH, bUt StIlL cOnVeYs DiSdAiN fOr ThE mAjOrItY oF yOuR wOrK."},{"name":"SERENDIPITY","text":"Hm. That's extremely high praise! At least, I think it is..."},{"name":"SERENDIPITY","text":"But there is one thing that I can say with certainty: this particular commission has made it even easier than usual to evaluate your growth. After all, the fire brand you made before required you to work with many of the same materials, so this is a perfect opportunity to see how your technique has improved since then."},{"name":"SERENDIPITY","text":"Although both were carved from aldgoat horn and adorned with an eye of fire, I would say that this staff is much more refined by comparison."},{"name":"SERENDIPITY","text":"The wolf fangs flaring from the tip are the coup de grâce, not only strengthening the thaumaturgical properties of the weapon, but also improving the wielder's ability to cut an imposing figure!"},{"name":"SERENDIPITY","text":"Why don't you deliver this commission to Roroton at the Ruby Road Exchange personally? It's been a while since you last met, so I'm sure he'd be happy to see you."},{"name":"ROROTON","text":"Why, if it isn't <span class=\"highlight\">Forename</span>! You're a hard <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to find. As it happens, I had another commission for you. Mistress Serendipity has the details. Or would you prefer that I tell you?"},{"name":"ROROTON","text":"You've already crafted the horn staff!? Beg your pardon, I had no idea!"},{"name":"ROROTON","text":"I appreciate that you came to deliver it. I was dreading the inevitable encounter with that irrepressible mammet."},{"name":"ROROTON","text":"Don't misunderstand─it's not that I'm offended. On the contrary, his assessment of my abilities is harsh but fair. He reminds me that I have much and more to learn before I can call myself a connoisseur of the fine arts."},{"name":"ROROTON","text":"And in times like these, ignorance can be a fatal failing─especially if the rumors sweeping the markets are to be given credence."},{"name":"ROROTON","text":"Surely you've heard them as well. This talk of the Jade Fox?"},{"name":"ROROTON","text":"Aye, the legendary thief has come to Ul'dah at last. A master of disguise, whose identity is a complete mystery. There is but one thing on which everyone can agree: that his lust for fine jewelry is insatiable!"},{"name":"ROROTON","text":"So you must understand why a merchant like me would feel ill at ease. There is no greater enemy to the industrious businessman than a dastardly thief who would steal his wares without compunction."},{"name":"ROROTON","text":"You and your fellow goldsmiths should take care. In fact, it would not surprise me in the slightest if the Jade Fox were to turn his attentions toward <span class=\"emphasis\">you</span>."},{"name":"ROROTON","text":"Do be careful, <span class=\"highlight\">Forename</span>. This Jade Fox character is out there somewhere, and any one of us could be his next target."},{"name":"SERENDIPITY","text":"Welcome back, <span class=\"highlight\">Forename</span>! I hope the staff was to Roroton's satisfaction."},{"name":"SERENDIPITY","text":"Congratulations on a job well done, then! Oh, but before you go, I've recently been informed that a dangerous thief has come to Ul'dah, and that we goldsmiths might be the target of his machina─"},{"name":"SERENDIPITY","text":"What? You've already heard about the Jade Fox!? Well now, aren't <span class=\"emphasis\">we</span> well-informed!"},{"name":"SERENDIPITY","text":"Anyway, I must urge you to be cautious when dealing with new customers. The Jade Fox may disguise himself as one in an attempt to defraud you! As for the guild, rest assured that I will personally scrutinize anyone who seeks to commission our goldsmiths. And I am an <span class=\"emphasis\">excellent</span> judge of character!"},{"name":"SERENDIPITY","text":"What was that? Did I just hear you <span class=\"emphasis\">snicker</span>, <span class=\"highlight\">Forename</span>!? And I thought you respected your kind and lovely guildmaster..."}],"reward":{"items":[{"id":2412},{"id":2816,"one":1},{"id":3162,"one":1},{"id":3639,"one":1},{"num":6,"id":5825,"one":1}],"xp":163415},"reqs":{"jobs":[{"lvl":40,"id":12}],"quests":[66191]},"next":[66193]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1004098","obj":{"i":1004098,"n":"Roroton","l":40,"q":3}},{"type":"item","id":"2412","obj":{"i":2412,"n":"Apprentice's Grinding Wheel","l":39,"c":35353,"t":19}},{"type":"item","id":"2816","obj":{"i":2816,"n":"Linen Deerstalker","l":41,"c":41131,"t":34,"p":3545}},{"type":"item","id":"3162","obj":{"i":3162,"n":"Linen Smock","l":41,"c":42231,"t":35,"p":4389}},{"type":"item","id":"3639","obj":{"i":3639,"n":"Boarskin Smithy's Gloves","l":41,"c":44025,"t":37,"p":3939}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"2125","obj":{"i":2125,"n":"Horn Staff","l":39,"c":33003,"t":7,"p":6723}},{"type":"quest","id":"66191","obj":{"i":66191,"n":"Mammets on Fire","g":139,"l":"Ul'dah","s":350,"f":1}},{"type":"quest","id":"66193","obj":{"i":66193,"n":"The Fox in the Hen House","g":139,"l":"Ul'dah","s":450,"f":1}}]}