{"quest":{"name":"The Fox in the Hen House","location":"Ul'dah","id":66193,"patch":2.0,"sort":450,"icon":100055,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1004093,"involved":[1004097,1004098],"genre":139,"usedItems":[2872,2876,2878],"journal":["Serendipity is in desperate need of your assistance.","The guild is awash with commissions on account of the upcoming gala to celebrate the sultana's nameday. Serendipity has asked you to lend a hand by crafting three electrum circlets of the highest quality possible─one with amber, one with spinel, and one with zircon. Prepare the items as requested and present them to the guildmaster for inspection.","The guildmaster approves of your circlets and bids you deliver them to Roroton, but not before speaking with Robert, who should be returning to speak with you any moment. Search for him outside the Goldsmiths' Guild and see what he has to say.","Robert reveals to you that the Jade Fox may be plotting to infiltrate the nameday festivities and rob the guests in attendance. To prevent this, the Sultansworn have been discreetly investigating the invited guests to determine if one might be the legendary thief. To your surprise, it seems that Roroton has become a prime suspect. Whatever the truth may be, you have a commission to complete. Deliver the circlets to Roroton at the Ruby Road Exchange.","Unable to resist the temptation, you inquire as to Roroton's true motives for coming to Ul'dah. He confides in you that he is more of an altruist than a businessman, and that his purpose in life is to share the beauty of fine art with others. Return to the Goldsmiths' Guild and report to Serendipity.","Serendipity has also learned of the rumors regarding the Jade Fox and the nameday celebration. Disgusted that a thief would consider ruining what should be a happy occasion, she hopes that Robert catches the fiend and personally teaches him a lesson.<br><br>※The next goldsmith quest will be available from Serendipity upon reaching level 50."],"objectives":["Present an electrum circlet (amber) <img class=\"hq-icon small\" src=\"images/item/hq.png\">, an electrum circlet (spinel) <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and an electrum circlet (zircon) <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Serendipity.","Speak with Robert.","Deliver the electrum circlet (amber) <img class=\"hq-icon small\" src=\"images/item/hq.png\">, the electrum circlet (spinel) <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and the electrum circlet (zircon) <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Roroton.","Report to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"Come lend a hand, <span class=\"highlight\">Forename</span>! We have a mountain of commissions to fill!"},{"name":"SERENDIPITY","text":"It's because of the upcoming gala to celebrate the sultana's nameday. Everyone who's anyone has received an invitation, and <span class=\"emphasis\">all</span> of them intend to be seen wearing the finest garments and jewelry."},{"name":"SERENDIPITY","text":"Some of our more popular requests have been for headwear, and that's where I'd like <span class=\"emphasis\">your</span> help, especially. We'll need three electrum circlets of the highest quality possible─one set with amber, one set with spinel, and one set with zircon."},{"name":"SERENDIPITY","text":"You can handle that, can't you?"},{"name":"SERENDIPITY","text":"And if you're at all curious as to why I'm giving <span class=\"emphasis\">you</span> this particular commission─it's from Roroton, your biggest fan! He's acting as the middleman for many of our transactions, you see."},{"name":"SERENDIPITY","text":"I knew he was ambitious, but I never expected him to rise to prominence so quickly. He's become the talk of Ul'dahn high society, what with his impressive knowledge of the fine arts and his talent for obtaining anything his customers desire."},{"name":"SERENDIPITY","text":"Of course, what most are unaware of is that his talent is largely dependent on <span class=\"emphasis\">yours</span>. In case you've yet to realize it, it is <span class=\"emphasis\">your</span> creations that have helped him to build his reputation."},{"name":"SERENDIPITY","text":"You haven't let him down once, <span class=\"highlight\">Forename</span>, so don't make this the first time! Be the best goldsmith you can be and bring me the circlets when they're ready!"},{"name":"SERENDIPITY","text":"Remember, Roroton requested one circlet set with amber, one set with spinel, and one set with zircon."},{"name":"SERENDIPITY","text":"Whenever they're ready, bring them here and I'll take a look."},{"name":"GIGI","text":"NE※GIGIGI★※...<br>ElEcTrUm...CiRcLeTs...HmPh. I wIlL nOt BoRe YoU wItH fLaTtErY, gReEnHoRn. I wIlL sImPlY sTaTe ThAt YoU dId WeLl. "},{"name":"SERENDIPITY","text":"If YoU wIlL nOt PeRmIt GiGi To FiLl YoUr HeAd WiTh MaTeRiA, tHeN hE wIlL nOt DeIgN tO fIlL iT wItH pRaIsE─fAiNt Or OtHeRwIsE."},{"name":"SERENDIPITY","text":"That's awfully petty of you. These circlets certainly deserve more than that!"},{"name":"SERENDIPITY","text":"Take this one set with amber. Now, amber isn't a gemstone in the traditional sense, since it's composed of fossilized resin and not a mineral. As a result, it requires different techniques to bring out its true potential."},{"name":"SERENDIPITY","text":"But you've managed to do just that, creating a piece which is both pleasing to the eye and beneficial to the wearer─especially one who wishes to more effectively channel his earth magicks."},{"name":"SERENDIPITY","text":"In contrast to the natural vibrance of amber, the zircon in this circlet imparts a sense of wisdom and worldliness."},{"name":"SERENDIPITY","text":"Of course, it also improves one's affinity with ice-aspected aether. Now that I think about it, zircon is not unlike ice, in that the presence of impurities can radically alter its appearance..."},{"name":"SERENDIPITY","text":"As for this circlet set with spinel...I would say it strikes me as a symbol of confidence and power."},{"name":"SERENDIPITY","text":"Though perhaps I'm only saying that because I know that spinel is elementally aspected to lightning..."},{"name":"SERENDIPITY","text":"You've brought out the best in your materials and crafted three different yet equally magnificent circlets. I would go so far as to say that you've attained a level of skill rivaling that of our best goldsmiths!"},{"name":"SERENDIPITY","text":"All that's left is for you to head to the Ruby Road Exchange and deliver them to Roroton!"},{"name":"SERENDIPITY","text":"Actually, I take that back. There is one more thing you should probably attend to. Do you remember our friend from the Sultansworn, Robert? He was just here asking to speak with you."},{"name":"SERENDIPITY","text":"I must confess I am somewhat jealous of this special attention. In any case, he should be returning any moment, so perhaps you will find him outside. I've no idea what's on his mind, but you might as well speak with him before making your delivery to Roroton."},{"name":"GIGI","text":"NE※GIGIGI★※...<br>SeCrEtS aNd LiEs, SeCrEtS aNd LiEs! ThE mAn Is NaUgHt MoRe ThAn A mIsErAbLe PiLe Of SeCrEtS aNd LiEs!"},{"name":"SERENDIPITY","text":"Please, Gigi, show some restraint. I know you dislike Roroton, but this is too much."},{"name":"SERENDIPITY","text":"You must learn to treat our customers with respect. This kind of behavior is inexcusable."},{"name":"SERENDIPITY","text":"&lt;sigh&gt; Don't concern yourself with him, <span class=\"highlight\">Forename</span>. Pray give my regards to Roroton and Robert."},{"name":"ROBERT","text":"<span class=\"highlight\">Forename</span>, there you are! I'm glad that I finally found you."},{"name":"ROBERT","text":"I understand you're helping Mistress Serendipity with some of the orders for the sultana's nameday celebration. I know you must be busy, so I'll get to the point."},{"name":"ROBERT","text":"The Sultansworn have learned that the Jade Fox, a notorious thief, may be plotting to infiltrate the festivities and rob our distinguished guests."},{"name":"ROBERT","text":"We will not allow this to happen, of course. However, the identity of the thief has yet to be determined."},{"name":"ROBERT","text":"Therefore, we have decided to <span class=\"emphasis\">discreetly</span> investigate several of our guests."},{"name":"ROBERT","text":"Including your patron, Roroton."},{"name":"ROBERT","text":"He has no ties to the Seventy-Seven Caravans or any other major trade organization. We can find no relatives, and his activities prior to his arrival in the city are unknown."},{"name":"ROBERT","text":"You've met with this so-called merchant several times and filled numerous commissions for him, have you not? Yet I wager he has shared little─if any─personal information. Can you honestly say that you know the man?"},{"name":"ROBERT","text":"I tell you this because, if he is indeed the Jade Fox, I fear you may be a part of his plans. Do not turn your back on him, <span class=\"highlight\">Forename</span>."},{"name":"ROROTON","text":"Greetings, <span class=\"highlight\">Forename</span>! Always a pleasure to see you. Have you brought the circlets I commissioned?"},{"name":"ROROTON","text":"They're spectacular, simply <span class=\"emphasis\">spectacular</span>! The women who wear these works of art will be the toast of Ul'dah, I guarantee it!"},{"name":"ROROTON","text":"Hm? You're more quiet than usual, <span class=\"highlight\">Forename</span>... Is there something troubling you?"},{"name":"Q1","text":"What will you ask?"},{"name":"A1","text":"Why did you really come to Ul'dah?"},{"name":"A1","text":"Are you the Jade Fox?"},{"name":"ROROTON","text":"Because I so deeply respect you as an artisan, I shall be perfectly honest. I confess that I am not exactly the dedicated entrepreneur that I claim to be."},{"name":"ROROTON","text":"In truth, I am a man besotted with the trappings of the material world. I wander the realm in search of artistic masterpieces─not as a businessman, but as an <span class=\"emphasis\">altruist</span>."},{"name":"ROROTON","text":"Some men covet and hoard their treasures, but I would sooner share mine with my fellow man. I would go so far as to say that I consider this my sacred duty."},{"name":"ROROTON","text":"Which is why I'm absolutely thrilled to have discovered a talented goldsmith like you! As a purveyor of luxury goods, I couldn't have asked for a better supplier!"},{"name":"ROROTON","text":"Now, I must insist that this conversation remain between us. In this city, it's unbecoming for a merchant to have any motive other than profit, you know."},{"name":"ROROTON","text":"Are you serious!? Do you really think that I might be the Jade Fox!?"},{"name":"ROROTON","text":"Heh. Heh heh."},{"name":"ROROTON","text":"Ahahaha! B-By the Twelve, I never realized you had such a delightful sense of humor! I almost thought you serious!"},{"name":"ROROTON","text":"We are all richer for your presence, <span class=\"highlight\">Forename</span>. I pray that you continue to share your artistic gifts with the world."},{"name":"SERENDIPITY","text":"Welcome back, <span class=\"highlight\">Forename</span>. I'd ask if Roroton approved of your circlets, but I've no reason to believe he didn't."},{"name":"SERENDIPITY","text":"By the way, I spoke with Robert after you left. He told me of this rumor that the Jade Fox might target the sultana's nameday celebration."},{"name":"SERENDIPITY","text":"It's terrible that the rogue would even consider ruining a royal gala. Gods, what is the world coming to? I hope Robert catches the fiend and personally teaches him a lesson."},{"name":"SERENDIPITY","text":"But let's not dwell on that, shall we? A nameday should be a happy occasion! I'm sure that everything will turn out for the best!"}],"reward":{"items":[{"id":2401},{"id":2854,"one":1},{"id":3187,"one":1},{"id":3668,"one":1},{"num":8,"id":5825,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":12}],"quests":[66192]},"next":[66194]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1004097","obj":{"i":1004097,"n":"Robert","l":41,"q":3}},{"type":"npc","id":"1004098","obj":{"i":1004098,"n":"Roroton","l":40,"q":3}},{"type":"item","id":"2401","obj":{"i":2401,"n":"Mythril Lapidary Hammer","l":43,"c":35211,"t":18,"p":5737}},{"type":"item","id":"2854","obj":{"i":2854,"n":"Woolen Deerstalker","l":46,"c":41132,"t":34}},{"type":"item","id":"3187","obj":{"i":3187,"n":"Woolen Smock","l":46,"c":42232,"t":35,"p":5344}},{"type":"item","id":"3668","obj":{"i":3668,"n":"Raptorskin Smithy's Gloves","l":46,"c":44006,"t":37,"p":4796}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"2872","obj":{"i":2872,"n":"Electrum Circlet (Zircon)","l":48,"c":40605,"t":34}},{"type":"item","id":"2876","obj":{"i":2876,"n":"Electrum Circlet (Amber)","l":48,"c":40602,"t":34}},{"type":"item","id":"2878","obj":{"i":2878,"n":"Electrum Circlet (Spinel)","l":48,"c":40604,"t":34}},{"type":"quest","id":"66192","obj":{"i":66192,"n":"The Horns of the Green","g":139,"l":"Ul'dah","s":400,"f":1}},{"type":"quest","id":"66194","obj":{"i":66194,"n":"Jaded","g":139,"l":"Ul'dah","s":500,"f":1}}]}