{"quest":{"name":"Soothing the Savage Siren","location":"Limsa Lominsa","id":66198,"patch":2.0,"sort":40,"eventIcon":71221,"issuer":1000919,"target":1000919,"involved":[1000918],"genre":91,"journal":["O'kalkaya has advice for any adventurers headed to the Missing Member.","O'kalkaya warns you that Captain Rhoswen, leader of the Sanguine Sirens and proprietress of the Missing Member, is in no mood to entertain customers. If you insist upon visiting, O'kalkaya strongly suggests that you first pay your respects and /kneel to the captain.","Rhoswen explains that the Sanguine Sirens are struggling to capture imperial vessels because their rivals, the Kraken's Arms, are seizing them first. Show Captain Rhoswen that you are /disappointed with this turn of events.","Brushing aside your gesture of sympathy, Rhoswen muses on how she might motivate her crew to redouble their efforts. Demonstrate to her how you would /rally their spirits.","Though your gesturing nearly earns you a gruesome death, you unintentionally inspire Rhoswen to embrace her piratical proclivities and steal better ships so that the Sirens can plunder Garlean outposts. Let O'kalkaya know that her captain is in higher spirits.","O'kalkaya thanks you for improving Captain Rhoswen's mood and ensuring that the Siren's deckswabs were not disposed of prematurely."],"objectives":["/kneel before Rhoswen.","Show Rhoswen that you are /disappointed.","/rally Rhoswen's spirits.","Speak with O'kalkaya."],"dialogue":[{"name":"OKALKAYA","text":"If yer lookin' fer a place to wet yer whistle, scrag, I'd advise ye to turn tail an' run."},{"name":"OKALKAYA","text":"Cap'n Rhoswen's in no mood to be entertainin' customers <span class=\"alternative-container\"><span class=\"alternative\">this eve</span><span class=\"alternative\">this morn'</span><span class=\"alternative\">this day</span></span>, an' even when she is, she ain't particularly good at it."},{"name":"OKALKAYA","text":"Though...maybe dealin' with a customer's the sort o' shite what might shake 'er from 'er doldrums."},{"name":"OKALKAYA","text":"But if ye mean to venture inside the Missin' Member, ye best remember to pay yer proper respects to the cap'n─'less ye ain't afraid o' goin' <span class=\"emphasis\">missin'</span>. <span class=\"highlight\">Kneelin'</span> afore 'er would be a good start."},{"name":"RHOSWEN","text":"The 'ells ye want, drylander!? We're closed! If ye don't want me Sirens to toss ye out on yer arse, show some respect an' <span class=\"highlight\">kneel</span>, scrag!"},{"name":"RHOSWEN","text":"Oho, so <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">'e</span></span> knows <span class=\"alternative-container\"><span class=\"alternative\">'er</span><span class=\"alternative\">'is</span></span> place! Good!"},{"name":"RHOSWEN","text":"If only the Krakens 'ad the same sense o' propriety! Bastards keep seizin' every Garlean ship before we can take a crack at 'em!"},{"name":"RHOSWEN","text":"'Tis a sorry state of affairs when yer crew's reduced to preyin' on the leavin's o' that mangy bunch o' man-boys. Me younger self would be right <span class=\"highlight\">disappointed</span> to see 'ow far we've fallen."},{"name":"RHOSWEN","text":"Can't ye see I'm wallowin' in self-pity, scrag!? Ye couldn't possibly understand 'ow <span class=\"highlight\">disappointed</span> I am in meself."},{"name":"RHOSWEN","text":"Hmph, so ye do know somethin' o' me pain. But yer sympathy ain't worth more'n a pint o' piss."},{"name":"RHOSWEN","text":"It's well an' good we got the Admiral's permission to capture Garlean ships, but what's the use if ye keep on gettin' beat to yer prey!?"},{"name":"RHOSWEN","text":"We built our reputation reavin' right off the coasts o' Vylbrand, not sailin' a dozen malms into the bleedin' sea. The few imperial dogs found in Lominsan territory get snatched by Krakens 'unting in open waters."},{"name":"RHOSWEN","text":"I <span class=\"highlight\">rallied</span> me crew's spirits when I said we were revivin' the old ways, but after all our struggles, they seem resigned to lettin' those bastards 'ave all the fun..."},{"name":"RHOSWEN","text":"There's got to be a way to <span class=\"highlight\">rally</span> me Sirens' spirits again..."},{"name":"RHOSWEN","text":"Huh? Ye tryin' to make light o' me dilemma? Don't push yer luck, scrag, or I'll gut ye with a hook, like a regular pirate!"},{"name":"RHOSWEN","text":"Wait─that's it! We're pirates, godsdammit, so we should think like pirates! Bugger keepin' Lominsan waters safe─we'll raid supply shipments to the Garlean outposts along the coasts of Aldenard!"},{"name":"RHOSWEN","text":"Ahahaha! It's so bleedin' simple, I don't know why I didn't think o' this afore! Thank ye for yer unintended inspiration, scrag. To think I almost 'ad ye fed to the sharks!"},{"name":"OKALKAYA","text":"I gather yer meetin' with the cap'n went well? I could 'ear 'er cacklin' all the way out 'ere."},{"name":"OKALKAYA","text":"Well, whatever ye did, thank ye for doin' it. Last thing we needed was 'er goin' on another rampage, ruinin' deckswabs an' leavin' us with less meat."},{"name":"OKALKAYA","text":"'Tain't easy playin' by the Admiral's rules, but if anyone can find a way, Cap'n Rhoswen can!"}],"reward":{"gil":122,"xp":227}},"partials":[{"type":"npc","id":"1000919","obj":{"i":1000919,"n":"O'kalkaya","l":28,"q":2}},{"type":"npc","id":"1000918","obj":{"i":1000918,"n":"Rhoswen","l":28,"q":4}}]}