{"quest":{"name":"Fire in the Gloom","location":"Gridania","id":66213,"patch":2.0,"sort":93,"icon":100071,"eventIcon":71201,"issuer":1000100,"target":1000100,"involved":[1004612,1004613,1004614,1004615,1004619,1004620],"genre":1,"journal":["Miounne is waiting to brief you on your task.","It would seem that a cult known as the Lambs of Dalamud has been engaging in suspicious activity in the Tam–Tara Deepcroft. Make your way to the burial site and ask the Quiverman posted at the entrance for further instructions.","You learn that the Lambs of Dalamud believe in the divinity of the lesser moon whose descent ushered in the Seventh Umbral Era. Since Dalamud's apparent destruction─for which they blame the people of Eorzea─it seems they have been seeking a means to avenge their god. Purge the Deepcroft of cultists before they can put their deranged schemes into action.<br><br>※Challenge the Tam–Tara Deepcroft with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","While scouring the depths of the Tam–Tara Deepcroft, you are assailed by a vengeful spirit who had been awakened in the corse of Galvanth the Dominator. After a titanic struggle, you succeed in sending this dark being back to the abyss, thus foiling the cultists' plot. Make haste back to Gridania, and report all that has transpired to Miounne.","Miounne reveals that death is becoming an ever more common occurrence within the adventuring fraternity. She attributes this unfortunate trend to the burgeoning demand for adventurers' services, which has allowed unprepared individuals to take on tasks which are beyond them. Confident that you will give her no cause to worry, Miounne informs you that the Adventurers' Guild in Ul'dah is recruiting. Speak with her again if you would know more."],"objectives":["Speak with the Quiverman at the entrance to the Tam–Tara Deepcroft.","Enter the Tam–Tara Deepcroft.","Report to Miounne."],"dialogue":[{"name":"MIOUNNE","text":"Ready for that briefing? Good! Now then, here's the long and short of it..."},{"name":"LEWIN","text":"Beg pardons for interrupting, Miounne, but our need grows ever more pressing. Have none stepped forward?"},{"name":"MIOUNNE","text":"And good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you too, Bowlord! Your need must be pressing indeed for you to honor us with a visit. The good news is: your journey hasn't been wasted. I'm pleased to report that we have a volunteer at last, and one who comes highly recommended, at that."},{"name":"LEWIN","text":"Well, if it isn't our very own <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for all seasons! You certainly have a knack for appearing when you're most needed, <span class=\"highlight\">Forename</span>. My thanks for answering the call."},{"name":"LEWIN","text":"My thanks for answering the call, friend. My name is Lewin, and I lead the men and women of the Gods' Quiver."},{"name":"LEWIN","text":"Now, time is of the essence, so I shall proceed directly to the heart of the matter. We wish for you to nip a potential threat to Gridania in the bud."},{"name":"MIOUNNE","text":"Beneath the Central Shroud, there lies an underground burial site called the Tam–Tara Deepcroft."},{"name":"MIOUNNE","text":"The place was once a Gelmorran settlement, but we Gridanians have long interred our dead there."},{"name":"LEWIN","text":"Of late, however, shadowy figures have been seen skulking about the Deepcroft, and with ever-increasing regularity."},{"name":"LEWIN","text":"Based on the accounts of various witnesses, we suspect that these individuals belong to the Lambs of Dalamud, a doomsday cult which sprung up prior to the Calamity."},{"name":"LEWIN","text":"These zealots have proven themselves dangerous in the past, and we leave them to their own devices at our peril."},{"name":"LEWIN","text":"Ordinarily, I would have dispatched my best men to scour the Deepcroft with orders to flush the cultists out."},{"name":"LEWIN","text":"Alas, the Calamity decimated our ranks, and the limited forces at my disposal are constantly required to keep the Ixal at bay."},{"name":"LEWIN","text":"Since we thwarted their attack on the Guardian Tree, the birdmen have not allowed us a moment's respite. They have probed every ilm of our defenses in search of a weakness, compelling me to spread our forces far more thinly than I would like."},{"name":"LEWIN","text":"The situation so being, we have no choice but to entrust the task of dealing with the Lambs of Dalamud to others. Can we rely on you to handle this matter, <span class=\"highlight\">Forename</span>?"},{"name":"LEWIN","text":"The birdmen have grown restless of late, and I fear a storm may be brewing. In anticipation of this, I have been compelled to spread our forces throughout the Twelveswood, lest we be taken unawares."},{"name":"LEWIN","text":"The situation so being, we must turn to others to deal with the Lambs of Dalamud. Can we rely on you to undertake this task, friend?"},{"name":"LEWIN","text":"You have my gratitude."},{"name":"LEWIN","text":"Once you've seen to your preparations, pray make your way to the Deepcroft, and identify yourself to the guard posted at the entrance. He will apprise you of the latest developments. That is all."},{"name":"MIOUNNE","text":"Be careful out there, you hear? May the Crystal guide you and keep you!"},{"name":"GODSQUIVERBOW","text":"You're <span class=\"highlight\">Forename Surname</span>, I take it? Thanks for helping us out, friend."},{"name":"GODSQUIVERBOW","text":"No doubt the Bowlord has already informed you, but your task is to enter the Deepcroft and purge it of the Lambs of Dalamud."},{"name":"GODSQUIVERBOW","text":"In case you're unfamiliar with them, the cult emerged shortly before the Calamity put an end to the Sixth Astral Era."},{"name":"GODSQUIVERBOW","text":"The cultists took the lesser moon, Dalamud, for their god, believing that it would deliver them from the devastation."},{"name":"GODSQUIVERBOW","text":"And so they were rather disappointed when Dalamud exploded into a thousand flaming pieces before it could complete its descent."},{"name":"GODSQUIVERBOW","text":"Now, having seen their god turn to ash, one would think that the cultists might feel moved to question their faith. On the contrary, it served only to stoke the flames of their fanaticism."},{"name":"GODSQUIVERBOW","text":"The Lambs of Dalamud are convinced that “heretics”─that is to say, <span class=\"emphasis\">everyone but them</span>─interfered with the coming of their lord and savior, and that it's now their sacred duty to avenge him."},{"name":"GODSQUIVERBOW","text":"Whatever it is they're doing in the Deepcroft, you may be sure that no good will come of it. For the sake of Gridania, and Eorzea at large, put an end to their madness."},{"name":"DOLOROUSBEAR","text":"So we meet again! I cannot say I'm surprised to see you here."},{"name":"DOLOROUSBEAR","text":"You took the prize back in Limsa, but this time we will give you better sport, or I am no true adventurer!"},{"name":"EMANAFA","text":"Gods, I <span class=\"emphasis\">hate</span> mausoleums... It's not right to disturb the dead in their slumber..."},{"name":"KIKINA","text":"Think of our goal, sister! One day, our adventures will be the stuff of song, and it will all be worth it!"},{"name":"ISILDAURE","text":"&lt;pant&gt; &lt;pant&gt; ...Childish curiosity prompted me to commit the most elementary of blunders."},{"name":"ISILDAURE","text":"Were it not for the fruit that Alianne found, my adventures may well have ended in this forbidding place."},{"name":"ISILDAURE","text":"Always look before you leap... In my haste, this most fundamental rule of adventuring slipped my mind. &lt;sigh&gt; I do believe I shall rest here awhile."},{"name":"ALIANNE","text":"I shudder to think what might have happened to Isildaure had I not thought to pick the fruit I stumbled across on the way here."},{"name":"ALIANNE","text":"Sometimes he has too much vigor for his own good. Age is supposed to mellow us, but if anything it has made him more impetuous."},{"name":"ALIANNE","text":"I understand his desire to make use of the time left to him, but one misstep, and there won't <span class=\"emphasis\">be</span> any."},{"name":"GODSQUIVERBOW","text":"The Lambs of Dalamud are hells-bent on avenging their imaginary god, and will stop at nothing till their dark work is done."},{"name":"GODSQUIVERBOW","text":"They must not be suffered to desecrate the Deepcroft. For the sake of the souls laid to rest here, and all of Gridania, put an end to their madness."},{"name":"MIOUNNE","text":"Welcome back, <span class=\"highlight\">Forename</span>! I'm reliably informed that your foray into the Deepcroft was a success."},{"name":"MIOUNNE","text":"Nor did I expect anything less. You've made such a habit of succeeding that it's difficult not to take your talents for granted. Rest assured, however: Mother <span class=\"emphasis\">is</span> impressed, even if she isn't surprised."},{"name":"MIOUNNE","text":"Nor did I expect anything less. Baderon's ringing endorsement left me in little doubt as to your capabilities. Even so, you are to be commended."},{"name":"MIOUNNE","text":"Bowlord Lewin asked me to pass on his thanks."},{"name":"MIOUNNE","text":"I must say, it's something of a relief to be able to call upon such a capable adventurer."},{"name":"MIOUNNE","text":"Sadly, death has become an ever more common occurrence within our fraternity of late. Times being what they are, the guild is constantly inundated with petitions, and we are hard-pressed to find enough hands to deal with them all."},{"name":"MIOUNNE","text":"While this means no shortage of work for able souls such as yourself, it also provides ample opportunity for the inexperienced to overreach themselves─with predictable consequences. Ah...as if to illustrate the point..."},{"name":"LIAVINNE","text":"Avere's gone, and it's all your fault! If it hadn't taken you an age to heal him, he would still be alive!"},{"name":"EDDA","text":"&lt;sniff&gt; B-But I tried! He bolted out of range before I could finish the spell!"},{"name":"EDDA","text":"&lt;sob&gt; He shouldn't have been so hard-pressed in the first place... We should've done more to lighten his burden..."},{"name":"PAIYOREIYO","text":"Bah! To the hells with this pathetic excuse for a party! I'm leaving, and it'd be too soon if I never see your faces again! Good-bye, and good riddance!"},{"name":"LIAVINNE","text":"I'm leaving as well. I doubt this comes as any surprise, but I <span class=\"emphasis\">never</span> liked you. I only suffered you for your healing, but you couldn't even do that one thing right. Cruel though this may sound, you brought this upon yourself."},{"name":"LIAVINNE","text":"Oh, and by way of some parting advice...get rid of Avere's head! Bury it, cremate it, do whatever the hells you like with it─but for gods' sakes, stop carrying it around! It's...it's just... Just get rid of it, all right!?"},{"name":"EDDA","text":"W-Wait! Don't leave me alone! Please!"},{"name":"EDDA","text":"&lt;sob&gt; I'm so sorry, Avere... Please forgive me..."},{"name":"MIOUNNE","text":"Scenes like this have become all too common. That makes a dozen times in half as many days..."},{"name":"MIOUNNE","text":"Now you see why I'm grateful for adventurers of your experience. I can send <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> like you on a mission without worrying that you might not return─well, not so much, at any rate."},{"name":"MIOUNNE","text":"Speaking of missions, I would entrust you with another."},{"name":"MIOUNNE","text":"About a bell ago, I received a message from my counterpart in Ul'dah. She seeks the services of a reliable adventurer, and you are nothing if not reliable."},{"name":"MIOUNNE","text":"If you think you might be interested in this task, say the word, and I will be glad to share the details with you."}],"reward":{"items":[{"num":3,"id":4552},{"num":3,"id":4555}],"xp":7000,"instance":2},"reqs":{"jobs":[{"lvl":16,"id":130}],"quests":[66212]},"next":[66214]},"partials":[{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1004612","obj":{"i":1004612,"n":"Gods' Quiver Bow","l":54,"q":1}},{"type":"npc","id":"1004613","obj":{"i":1004613,"n":"Dolorous Bear","l":54,"q":1}},{"type":"npc","id":"1004614","obj":{"i":1004614,"n":"E'manafa","l":54,"q":1}},{"type":"npc","id":"1004615","obj":{"i":1004615,"n":"Kikina","l":54,"q":1}},{"type":"npc","id":"1004619","obj":{"i":1004619,"n":"Isildaure","l":54,"q":1}},{"type":"npc","id":"1004620","obj":{"i":1004620,"n":"Alianne","l":54,"q":1}},{"type":"item","id":"4552","obj":{"i":4552,"n":"Hi-Potion","l":25,"c":20602,"t":44,"p":146}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"instance","id":"2","obj":{"i":2,"n":"The Tam-Tara Deepcroft","c":61801,"t":"Dungeons","min_lvl":16,"max_lvl":19}},{"type":"quest","id":"66212","obj":{"i":66212,"n":"Call of the Forest","g":1,"l":"Limsa Lominsa","s":92}},{"type":"quest","id":"66214","obj":{"i":66214,"n":"Call of the Desert","g":1,"l":"Gridania","s":94}}]}