{"quest":{"name":"The Company You Keep (Immortal Flames)","location":"The Waking Sands","id":66218,"patch":2.0,"sort":109,"icon":100092,"eventIcon":71201,"issuer":1004883,"target":1002391,"involved":[1004884,1004885,1004887],"genre":1,"journal":["The Immortal Flames recruitment officer seems eager to welcome you to Ul'dah's Grand Company.","You have confirmed your intention to join the ranks of the Immortal Flames. Visit the Hall of Flames in Ul'dah, and speak with the personnel officer to be formally inducted into the Grand Company.","Your formal induction into the Immortal Flames is interrupted by an urgent report concerning an imperial attack on a Highwind Skyways airship. Head to Horizon's Edge and determine the fate of the crippled vessel and its crew.","You have defeated the imperial soldiers intent on requisitioning the downed airship. You learn that the vessel's crew, Biggs and Wedge, are engineers from Garlond Ironworks, and that Master Garlond himself has been missing since the Calamity. Return to the Hall of Flames and report to the personnel officer.","Back at the Hall of Flames, the personnel officer praises your efforts, and reassures you that the two engineers you encountered were able to continue on their way. He then expresses his eagerness to complete your induction into the ranks of the Immortal Flames. Speak with him once more when you are ready to attend to the formalities."],"objectives":["Speak with the personnel officer at the Hall of Flames.","Head to Horizon's Edge and determine the fate of the airship and its crew.","Speak with the personnel officer at the Hall of Flames.","Defeat the imperial soldiers!"],"dialogue":[{"name":"FLAMEOFFICER","text":"Welcome back, adventurer! I take it General Raubahn's words kindled a fire within you?"},{"name":"Q1","text":"Join the Immortal Flames?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"FLAMEOFFICER","text":"Excellent! I feared that the incident with the traitor may have soured your opinion of us. It gladdens me to see that isn't the case."},{"name":"FLAMEOFFICER","text":"But before we can count you as one of our own, you must be formally inducted into our ranks."},{"name":"FLAMEOFFICER","text":"Please proceed to <span class=\"alternative-container\"><span class=\"alternative\">the Hall of Flames on Ul'dah's Merchant Strip</span><span class=\"alternative\">the Hall of Flames</span></span> and identify yourself to the personnel officer. I will notify him of your coming."},{"name":"FLAMEOFFICER","text":"With your strength joined to ours, we shall surely prevail over our enemies, be they beastmen or imperials."},{"name":"FLAMEOFFICER","text":"What? You cannot seriously be considering joining another Grand Company! Why, they are not nearly as <span class=\"emphasis\">grand</span> as ours!"},{"name":"SERPENTOFFICER","text":"I will not deny that I am disappointed, but I take comfort in the knowledge that individuals are permitted to transfer between Grand Companies. Know that the Order of the Twin Adder would be proud to have you should you undergo a change of heart."},{"name":"FLAMEOFFICER","text":"Before you may take your place within our ranks, you must speak with the personnel officer at the Hall of Flames in Ul'dah. Pray do so at your earliest convenience. I, meanwhile, will bear word of your <span class=\"emphasis\">excellent</span> decision to General Raubahn."},{"name":"STORMOFFICER","text":"So you have decided to cast your lot with the Flames. Well, there is no help for it. Just remember that it's never too late to sign on with a different crew."},{"name":"FLAMEPERSONNEL","text":"What brings you to the Hall of Flames this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>, adventurer?"},{"name":"Q2","text":"How will you respond?"},{"name":"A2","text":"My name is <span class=\"highlight\">Forename Surname</span>. I believe you are expecting me."},{"name":"A2","text":"I am here to enlist, if you will have me."},{"name":"FLAMEPERSONNEL","text":"Ah, I thought as much! You are just as our man at the Waking Sands described! It is an honor to meet you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"},{"name":"FLAMEPERSONNEL","text":"Is that so? Well then, I must ask you for your name. Ah, but let me guess. It is <span class=\"highlight\">Forename Surname</span>, is it not? Yes, you are just as our man at the Waking Sands described. Thank you for electing to join us."},{"name":"FLAMEPERSONNEL","text":"Now, in order to formalize your─"},{"name":"FLAMEPRIVATE","text":"Sir!"},{"name":"FLAMEPERSONNEL","text":"Speak, Private."},{"name":"FLAMEPRIVATE","text":"Imperials, sir! They've fired on a Highwind Skyways airship!"},{"name":"FLAMEPRIVATE","text":"Scouts say she's coming down to the west, near Horizon's Edge!"},{"name":"FLAMEPERSONNEL","text":"Bloody hells! Of all the times for this to happen!"},{"name":"FLAMEPERSONNEL","text":"<span class=\"highlight\">Forename</span>, there's no time for formalities! The Immortal Flames need your help <span class=\"emphasis\">now</span>!"},{"name":"FLAMEPERSONNEL","text":"We're in the midst of a large-scale operation against the Amalj'aa, and we have no one to spare in western Thanalan. You must get to that ship before the Garleans do!"},{"name":"FLAMEPERSONNEL","text":"If there are any survivors, see that they do not come to further harm. Now go!"},{"name":"Q3","text":"Duty calls. Do you wish to proceed with<br>“The Company You Keep (Immortal Flames)”?"},{"name":"A3","text":"Yes"},{"name":"A3","text":"No"},{"name":"BIGGS","text":"(-Airship Crewman-)An adventurer!? What're you doing out here? No, wait─let's find some cover first..."},{"name":"BIGGS","text":"(-Airship Crewman-)The Immortal Flames sent you? How do I know you're not an imperial spy? You don't even have a uniform!"},{"name":"FLAMELIEUTENANT","text":"Are you all right, sir? Our scouts reported the attack on your craft. We've come to rescue you."},{"name":"FLAMELIEUTENANT","text":"<span class=\"highlight\">Forename Surname</span>, yes? Glad to have you with us."},{"name":"IMPERIALSOLDIER","text":"I have not seen a craft of this design before... That traitor Garlond has been busy."},{"name":"IMPERIALSOLDIER","text":"The secrets of magitek are ours by right. They are not to be squandered upon the savages of this land."},{"name":"IMPERIALSOLDIER","text":"We are taking this craft back to the fortress! Dismantle it if you must! And bring the engineer! Someone must pay for Garlond's crimes."},{"name":"FLAMELIEUTENANT","text":"They mean to take the ship back to Castrum Meridianum, along with your friend."},{"name":"BIGGS","text":"(-Airship Crewman-)Wedge! You have to help him! That fool of a Lalafell was hiding <span class=\"emphasis\">inside</span> the <span class=\"emphasis\">Tiny Bronco</span>!"},{"name":"FLAMELIEUTENANT","text":"Nice-looking ship─though not the best place to have taken shelter, I agree."},{"name":"BIGGS","text":"(-Airship Crewman-)It's the first airship we've built since the Calamity─the first since Master Garlond...well, since he went missing."},{"name":"BIGGS","text":"(-Airship Crewman-)After years of work, she was finally ready for her first test flight. And she was <span class=\"emphasis\">soaring</span>, she really was─till those bastards blasted her out of the sky!"},{"name":"FLAMELIEUTENANT","text":"We attack on my command. Kill them quickly, and save the Lalafell if possible."},{"name":"FLAMELIEUTENANT","text":"Is that clear, <span class=\"highlight\">Forename</span>?"},{"name":"FLAMELIEUTENANT","text":"Show them what becomes of those who play with fire! Charge!"},{"name":"IMPERIALSOLDIER","text":"We're under attack! To arms!"},{"name":"WEDGE","text":"Biggs!"},{"name":"BIGGS","text":"Wedge! You shouldn't have stayed with the ship!"},{"name":"WEDGE","text":"Th-That was a close one!"},{"name":"BIGGS","text":"Too damn close. So...how's she look, anyway?"},{"name":"WEDGE","text":"The auxiliary propeller is a dead loss, but I think we can wring enough thrust from the main propeller to get us airborne."},{"name":"BIGGS","text":"A few minor modifications and we should be able to fly the <span class=\"emphasis\">Tiny Bronco</span> home."},{"name":"FLAMELIEUTENANT","text":"The imperials will come looking for their scouts, but we can defend this position until the engineers leave."},{"name":"FLAMELIEUTENANT","text":"You should go, <span class=\"highlight\">Forename</span>. You still have unfinished business to attend to at the Hall of Flames."},{"name":"FLAMELIEUTENANT","text":"You're not quite one of us yet, though anyone who'd seen you in action today would be forgiven for thinking otherwise."},{"name":"BIGGS","text":"I, um...just wanted to say sorry...you know, for calling you an imperial spy and all that... Got <span class=\"emphasis\">that</span> one wrong, didn't I!? Ha ha! Seriously, though─if it hadn't been for you and the Immortal Flames lads there, we'd be chained up in a dungeon by now. I'm in your debt, friend─we both are."},{"name":"BIGGS","text":"Wedge!"},{"name":"WEDGE","text":"Thank you! We're very grateful!"},{"name":"FLAMEPERSONNEL","text":"Welcome back, <span class=\"highlight\">Forename</span>. Word of your deeds in the field reached me not long ago. Exemplary service!"},{"name":"FLAMEPERSONNEL","text":"Rest assured that the Garlond Ironworks engineers are fine. They were able to get their vessel back in the air before imperial reinforcements arrived."},{"name":"FLAMEPERSONNEL","text":"Your willingness to assist us on such short notice is to be commended. Clearly, your reputation is well deserved. "},{"name":"FLAMEPERSONNEL","text":"Now then, I believe we have some unfinished business."},{"name":"FLAMEPERSONNEL","text":"Shall we continue from where we left off and induct you into the Immortal Flames?"},{"name":"FLAMELT","text":"Give them no quarter, Flames!"},{"name":"IMPERIALCENTURION","text":"Defend the airship! Kill the savages!"},{"name":"IMPERIALCENTURION","text":"What are you doing!? Kill them, I said!"},{"name":"IMPERIALCENTURION","text":"Where's that bloody vanguard!? We need it NOW!"},{"name":"IMPERIALCENTURION","text":"Hahaha! Show them no mercy!"},{"name":"FLAMELT","text":"Keep fighting, damn it... Don't...let them..."},{"name":"FLAMEPRIFIRST","text":"S-Sir...I don't think I can..."},{"name":"QIB","text":"Not now! Not like this..."}],"reward":{"items":[{"num":3,"id":5734}],"xp":8120},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[66047]},"next":[66221]},"partials":[{"type":"npc","id":"1004883","obj":{"i":1004883,"n":"Flame Officer","l":356,"q":4}},{"type":"npc","id":"1002391","obj":{"i":1002391,"n":"Flame Personnel Officer","l":40,"q":3}},{"type":"npc","id":"1004884","obj":{"i":1004884,"n":"Serpent Officer","l":356,"q":4}},{"type":"npc","id":"1004885","obj":{"i":1004885,"n":"Storm Officer","l":356,"q":4}},{"type":"npc","id":"1004887","obj":{"i":1004887,"n":"Airship Crewman","l":42,"q":1}},{"type":"item","id":"5734","obj":{"i":5734,"n":"Soot Black Dye","l":30,"c":22807,"t":55,"p":216}},{"type":"quest","id":"66047","obj":{"i":66047,"n":"A Hero in the Making","g":1,"l":"The Waking Sands","s":106}},{"type":"quest","id":"66221","obj":{"i":66221,"n":"For Coin and Country","g":1,"l":"Ul'dah","s":112}}]}