{"quest":{"name":"Wood's Will Be Done","location":"Gridania","id":66219,"patch":2.0,"sort":110,"icon":100069,"eventIcon":71201,"issuer":1002394,"target":1005012,"genre":1,"journal":["The personnel officer stands ready to complete your induction into the ranks.","You have been sworn into the service of Gridania's Grand Company, the Order of the Twin Adder. Mere moments after you are assigned your new rank, Minfilia contacts you by linkpearl and requests your presence. Return to the Waking Sands.","Back at the Waking Sands, Minfilia announces that Biggs and Wedge, the Garlond Ironworks engineers, are now under the protection of the Scions of the Seventh Dawn. With new allies at your side, set forth once more to fight for the good of all Eorzea."],"objectives":["Speak with the Scion of the Seventh Dawn at the Waking Sands."],"dialogue":[{"name":"SERPENTPERSONNEL","text":"Protocol requires that I apprise you of who we are and what we do, after which I will invite you to swear an oath of your own free will. Ahem!"},{"name":"SERPENTPERSONNEL","text":"The Order of the Twin Adder is the Grand Company of Gridania."},{"name":"SERPENTPERSONNEL","text":"It brings together the martial, economic, and technological resources of our nation, that we might stand strong in times of direst adversity, when our very survival hangs in the balance."},{"name":"SERPENTPERSONNEL","text":"Our order was formed in the days before the Calamity, in readiness to fight the Garlean Empire, and to combat the beast tribes and their primals. Needless to say, our struggle continues to this day."},{"name":"SERPENTPERSONNEL","text":"Elder Seedseer Kan–E–Senna is the supreme commander of our forces. Under her wise leadership, we protect the people of Gridania and the sanctity of the Twelveswood."},{"name":"SERPENTPERSONNEL","text":"As the entwined serpents that grace our standard, let forestborn strive as one with friends from afar to ensure that peace shall ever reign in Gridania."},{"name":"SERPENTPERSONNEL","text":"In so doing, we honor the will of the elementals, and theirs is the will of the wood."},{"name":"SERPENTPERSONNEL","text":"Now then, <span class=\"highlight\">Forename Surname</span>, I ask that you give unto us your oath of allegiance, in whatever fashion you see fit."},{"name":"Q1","text":"What oath will you swear?"},{"name":"A1","text":"Wood's will be done!"},{"name":"A1","text":"I shall strike down our enemies and drink of their blood!"},{"name":"A1","text":"My life for the Elder Seedseer!"},{"name":"A1","text":"..."},{"name":"SERPENTPERSONNEL","text":"So you know the words of our Grand Company. That is well. Bound by this common belief, let us strive to preserve all that is good in this great nation."},{"name":"SERPENTPERSONNEL","text":"Uh...quite. Your fervor is duly noted. May it lend you strength as you strive to preserve all that is good in this great nation."},{"name":"SERPENTPERSONNEL","text":"The Elder Seedseer is a kind and gentle soul who holds the welfare of her people above all else. Your faith in her is well placed."},{"name":"SERPENTPERSONNEL","text":"The elementals need not words to know your heart, and there is no doubt in mine own that you will prove a stalwart servant to them."},{"name":"SERPENTPERSONNEL","text":"By the power vested in me, I assign you the rank of serpent private third class."},{"name":"SERPENTPERSONNEL","text":"You are now a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the Order of the Twin Adder. Go forth, Private <span class=\"highlight\">Surname</span>, and do that which brings peace to the Twelveswood and honor to our name."},{"name":"MINFILIA","text":"Can you hear me, <span class=\"highlight\">Forename</span>? This is Minfilia."},{"name":"MINFILIA","text":"An officer of the Order of the Twin Adder contacted me with news of your enlistment. My congratulations, Private <span class=\"highlight\">Surname</span>."},{"name":"MINFILIA","text":"I have no doubt that you are eager to make the acquaintance of your new comrades, but I would ask that you pay a visit to your old ones first. Remember: though you are now a Serpent of Gridania, you are no less a Scion! Pray return to the Waking Sands at your earliest convenience. There are some friends here whom I would very much like you to meet. We shall be waiting!"},{"name":"SERPENTPERSONNEL","text":"The distant call of a friend in need, perhaps?"},{"name":"SERPENTPERSONNEL","text":"As you are needed elsewhere, I shall not keep you any longer. I would, however, suggest speaking with High Serpent Commander Vorsaile Heuloix before you depart. He may provide you with assistance on the journey ahead."},{"name":"SYSTEM","text":"You may now accept the quest “My Little Chocobo (Twin Adder)” by speaking with Vorsaile Heuloix."},{"name":"SYSTEM","text":"This quest must be completed in order to proceed to the end of the main scenario for A Realm Reborn."},{"name":"MINFILIA","text":"Welcome back! It seems you wasted no time putting your skills to work!"},{"name":"MINFILIA","text":"How do I know? Why, the recruitment officer called to regale me with the tale of your heroics. The pride in his voice was palpable!"},{"name":"MINFILIA","text":"We Scions are truly fortunate to have you with us, <span class=\"highlight\">Forename</span>."},{"name":"MINFILIA","text":"Now, when last we spoke, I said that I wanted you to meet some friends, did I not? Well, I neglected to mention that you have already met."},{"name":"MINFILIA","text":"Tataru─please show them in."},{"name":"TATARU","text":"This way, sirs!"},{"name":"BIGGS","text":"Thanks again for getting us out of that mess. We owe you our lives."},{"name":"BIGGS","text":"But I don't think we've properly introduced ourselves. I'm Biggs."},{"name":"WEDGE","text":"A-And I'm...I'm..."},{"name":"BIGGS","text":"Gods, man, spit it out, will you!?"},{"name":"WEDGE","text":"W-Wedge, at your service!"},{"name":"MINFILIA","text":"I am pleased to say that Biggs and Wedge will be staying with us for a while."},{"name":"MINFILIA","text":"Magitek-driven contraptions such as airships grow ever more vital to the city–states of Eorzea. As a neutral party, it was judged that we Scions should serve as the keepers of this technology."},{"name":"MINFILIA","text":"Of course, for this we needed the knowledge of experts. And so we requested the assistance of Garlond Ironworks, who very kindly sent us two of their finest engineers."},{"name":"MINFILIA","text":"Our happy family continues to grow. On behalf of the Scions, I bid you welcome to the Waking Sands!"},{"name":"MINFILIA","text":"Like every soul here, I love Eorzea."},{"name":"MINFILIA","text":"And I count myself blessed to have been given this chance to stand with you all and fight for the future of the realm."},{"name":"MINFILIA","text":"Never have I known such fulfillment─such happiness."},{"name":"GUIDE","text":"Welcome back, <span class=\"highlight\">Forename</span>! Lady Minfilia awaits you within."},{"name":"MINFILIA","text":"Welcome back! It seems you wasted no time putting your skills to work!"},{"name":"SYS","text":"And so Minfilia welcomes you to the next chapter of your tale..."},{"name":"SYS","text":"This concludes the main scenario for the Beta Version."},{"name":"SYS","text":"Though your journey has come to an end for now, exciting new experiences yet remain, including a wide range of quests and dungeons."},{"name":"SYS","text":"We hope you will continue to enjoy FINAL FANTASY XIV: A Realm Reborn Beta Version! Thank you for playing!"}],"reward":{"gil":1025,"gcseal":300,"xp":8120},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[66216]},"next":[66049]},"partials":[{"type":"npc","id":"1002394","obj":{"i":1002394,"n":"Serpent Personnel Officer","l":52,"q":3}},{"type":"npc","id":"1005012","obj":{"i":1005012,"n":"Scion Of The Seventh Dawn","l":356,"q":5}},{"type":"quest","id":"66216","obj":{"i":66216,"n":"The Company You Keep (Twin Adder)","g":1,"l":"The Waking Sands","s":107}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}}]}