{"quest":{"name":"It's Probably Pirates","location":"Limsa Lominsa","id":66211,"patch":2.0,"sort":91,"icon":100070,"eventIcon":71201,"target":1000972,"genre":0,"journal":["Baderon, the proprietor of the Drowning Wench, has need of a capable adventurer.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Baderon at the Drowning Wench.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Make your way north of Aleport, and speak with the Yellowjacket stationed outside the entrance to Sastasha.","The Yellowjackets are concerned that the unsavory-looking men seen entering Sastasha may belong to the Serpent Reavers, the pirate allies of the Sahagin. Search the caves and ascertain whether or not such suspicions are well founded.<br><br>※Sastasha can be accessed via the Duty Finder.","You have discovered a pirate den in the depths of Sastasha. Just as the Yellowjackets feared, it would appear the Serpent Reavers and their Sahagin masters are using the caves as a base for their nefarious operations. Return to Limsa Lominsa without delay, and report your findings to Baderon at the Drowning Wench.","Having listened to your findings, Baderon expresses his satisfaction with your work, and mentions another task which might be of interest to you. It seems the Adventurers' Guild in Gridania wishes to employ the services of a seasoned adventurer. Prepare your gear, then speak with Baderon when you are ready to embark on the next stage of your journey."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Baderon at the Drowning Wench.</span>"],"dialogue":[{"name":"BADERON","text":"I thank ye fer takin' the time to 'elp me out. Now, I'm sure yer busy, so I'll come straight to the point."},{"name":"BADERON","text":"Word 'as it some suspicious-lookin' buggers 'ave been sneakin' in an' out o' the Sastasha Seagrot, an' I need a trustworthy sort to 'ead up north of Aleport an' find out who they are an' what they're up to."},{"name":"BADERON","text":"Don't sound like much, I know..."},{"name":"BADERON","text":"But since that nasty business over in Swiftperch, folk've been a bit uneasy. Well, I say “a bit”... 'Tis all they can do not to soil 'emselves every time the bloody floorboards creak."},{"name":"BADERON","text":"But it weren't so long ago as the fishbacks' pet pirates paid us an unwelcome visit, an' folk are feelin' a bit nervous."},{"name":"REYNER","text":"If you would permit me, Master Baderon, I should be happy to elaborate."},{"name":"BADERON","text":"Well, well, if it ain't the chief Yellowjacket 'imself. To what do I owe this rare honor, Commodore Reyner? Come to make sure me patrons are behavin'─or just thirsty?"},{"name":"REYNER","text":"Neither, in fact. I came to welcome <span class=\"highlight\">Forename</span> back to Limsa Lominsa. It is well you have returned."},{"name":"REYNER","text":"Neither, in fact. I was informed that you had requested an adventurer to assist in my investigation, and I came to offer what information I could sift from recent reports."},{"name":"REYNER","text":"Over the course of the past moon, there have been several sightings of an unfamiliar vessel off the coast of Aleport, in the vicinity of the Isles of Umbra."},{"name":"REYNER","text":"This information came to my attention no more than a few weeks after a squad of my own soldiers had completed a routine patrol of the region, the Sastasha Seagrot included."},{"name":"REYNER","text":"Their search revealed little, save that a family of coeurls had taken up residence in the caves. Nothing to concern us, in short."},{"name":"REYNER","text":"In light of recent developments, however, it would seem wise to search Sastasha again."},{"name":"REYNER","text":"But with the Sahagin testing our defenses daily, I am loath to assign the task to the limited forces at my disposal. Our line is stretched as it is."},{"name":"REYNER","text":"Thus I sought the services of a competent adventurer to conduct an investigation in our stead. Any aid you can offer in this matter would be greatly appreciated."},{"name":"REYNER","text":"Then it is settled."},{"name":"REYNER","text":"Sastasha is located in western La Noscea. For more detailed instructions on how to reach the place, I suggest you consult V'mellpa. She can be found at the ferry docks on the lower decks."},{"name":"BADERON","text":"You 'eard the man! Good luck to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"},{"name":"VMELLPA","text":"You're here about Commodore Reyner's investigation? Then you'll want to board a ferry bound for Aleport."},{"name":"VMELLPA","text":"Once you arrive in western La Noscea, head to the north and you'll come across the Sastasha Seagrot soon enough. We have a scout stationed by the entrance to the cave with orders to brief you on the situation."},{"name":"VMELLPA","text":"Whatever else he tells you, be ready for pirates. There's never any shortage of the bastards. This <span class=\"emphasis\">is</span> Limsa Lominsa we're talking about..."},{"name":"YELLOWJACKET","text":"Please tell me you're here on Yellowjacket duty, and not some daft sod out for a stroll. I can't take any more of this blasted waiting. You are? Thank the gods."},{"name":"YELLOWJACKET","text":"I assume you already know about the ship seen slipping around the Isles of Umbra?"},{"name":"YELLOWJACKET","text":"We've been on the lookout for pirate activity ever since that vessel was sighted, thinking a crew of cutthroats might have a den nearby."},{"name":"YELLOWJACKET","text":"So when we received word that men of questionable quality had been seen passing in and out of Sastasha here, we weren't entirely surprised."},{"name":"YELLOWJACKET","text":"I've yet to see them for myself, but if this lot belongs to those fishback-fancying Serpent Reavers..."},{"name":"YELLOWJACKET","text":"Well, you can imagine the panic it'll cause. The kidnappings are still fresh in people's minds."},{"name":"YELLOWJACKET","text":"Anyway, your task is to poke around in the caves, and find out exactly who we're dealing with. While you do that, I'll be keeping watch out here...praying you don't spot any blue face tattoos."},{"name":"SYSTEM","text":"Enter Sastasha."},{"name":"AVERE","text":"What took ye so bloody long, Edda? If me purse was too light, ye might've considered usin' some of yer own bleedin' coin to get us what we need!"},{"name":"AVERE","text":"Ye've only ever been as useful as the contents o' yer pockets─the gods know ye can barely 'eal a scratch!"},{"name":"AVERE","text":"We took up the 'venturin' life to take on the big jobs an' claim the big rewards. How're we meant to do that if ye can't even get our supplies in order?"},{"name":"AVERE","text":"Hm? It's <span class=\"emphasis\"><span class=\"alternative-container\"><span class=\"alternative\">'er</span><span class=\"alternative\">'im</span></span></span>─the one Baderon was talkin' to!"},{"name":"AVERE","text":"Well, we'll see who gets the glory! This job should've been ours in the first place!"},{"name":"LIAVINNE","text":"Bwahahaha! Edda, you're so slow, you'd lose a footrace to a tree slug."},{"name":"PAIYOREIYO","text":"This is perfect for our inaugural outing as a party─wandering around in the caves, turning over a few rocks... How difficult could it possibly be?"},{"name":"PAIYOREIYO","text":"I never expected our first visit to the Adventurers' Guild would yield such a straightforward way to win fame and fortune."},{"name":"EDDA","text":"&lt;gasp&gt; I-I'm sorry, Avere! I came as fast as I could!"},{"name":"EDDA","text":"I tried haggling with the merchant, but two potions was the best I could get with the money you gave me. I had no idea how <span class=\"emphasis\">expensive</span> they were!"},{"name":"ISILDAURE","text":"Ah, a fellow adventurer. You, too, are here to unravel the mysteries of Sastasha?"},{"name":"ISILDAURE","text":"I have adventured across this wide realm for more seasons than I dare to count, yet still Eorzea manages to surprise me with her beauty and splendor."},{"name":"ISILDAURE","text":"Our journeys are not ended by the attainment of riches or fame. It is an unquenchable thirst for the unknown that drives us into the wilds time and again."},{"name":"ISILDAURE","text":"Even if I explored the world for a thousand years, I would never grow weary of this life."},{"name":"ALIANNE","text":"Grandfather and I are companions on the road."},{"name":"ALIANNE","text":"We travel where the wind takes us, and drink in all the wonders this world has to offer."},{"name":"ALIANNE","text":"Only an adventurer can understand the joy of such freedom─of discovering hidden places and experiencing sights and sounds that few may ever know."},{"name":"ALIANNE","text":"The passing years have begun to take their toll on the old man, but no force save death itself will sate his appetite for adventure!"},{"name":"YELLOWJACKET","text":"The fishbacks and their Serpent Reaver lackeys cannot be allowed to establish a permanent base in these lands."},{"name":"YELLOWJACKET","text":"You must uncover the truth behind who or what is lurking in these caves, adventurer. The peace of western La Noscea may depend on it!"},{"name":"BADERON","text":"Aye, such a task was on the books. “Was,” mind. I'm afraid that ship 'as already sailed, friend."},{"name":"DOLOROUSBEAR","text":"Ah. Might you be the adventurer who accepted the job of investigating Sastasha?"},{"name":"DOLOROUSBEAR","text":"Hmph. It would seem that ship has not only sailed, but now returns to harbor, none the worse for its voyage. A pity. We dragged our boots too long on this one."},{"name":"EMANAFA","text":"No matter. The wheel will turn and our chance will come."},{"name":"DOLOROUSBEAR","text":"You are right, of course. But there shall be no rest till we have attained our goal, lofty though it may be!"},{"name":"KIKINA","text":"Not a wink of sleep, great leader!"},{"name":"DOLOROUSBEAR","text":"Our aim, lest you wonder, is to perform such feats of heroism as will earn us a place in the songs of every alehouse in Eorzea. We mean to write a legend which will inspire adventurers as yet unborn to follow our shining example."},{"name":"DOLOROUSBEAR","text":"Do you have such a goal? Large or small, it matters not. Only have a star to reach for and you <span class=\"emphasis\">will</span> reach higher."},{"name":"DOLOROUSBEAR","text":"Purpose can sustain you through times of hardship. Keep your eye on the prize, and all obstacles will be overcome in time."},{"name":"DOLOROUSBEAR","text":"You would not think to stride into battle unclad, would you? Well, goals are as arms and armor for the spirit! I wish you fortune in your endeavors, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>!"},{"name":"BADERON","text":"Back then, are ye? With all yer limbs, an' a tale to tell, I'll wager."},{"name":"BADERON","text":"Fishbacks? An' there I was thinkin' ye'd only 'ave to crack a pirate skull or three. Seven hells... Ye turn yer back fer five bloody minutes, an' the scaly bastards've set up shop on yer bleedin' doorstep..."},{"name":"BADERON","text":"Still, sounds like ye left 'em in pieces, so I don't s'pose they'll be carryin' out whatever mischief they was plannin'─unless they was plannin' on feedin' 'emselves to the fauna o' Sastasha, o' course. Anyroad, all's well that ends well!"},{"name":"BADERON","text":"Thanks fer sheddin' some light on this mystery. I knew ye'd get the job done, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─ye always do!"},{"name":"BADERON","text":"On behalf o' Limsa, I thank ye fer sheddin' some light on this mystery. Ye've lived up to yer reputation, an' I couldn't ask fer no more'n that."},{"name":"BADERON","text":"Now, I'll bet yer dyin' fer a rest, but just in case yer not, I was wonderin' if ye might be interested in takin' on another job? It just so 'appens that I've 'ad a request from our sister guild in Gridania, see."},{"name":"BADERON","text":"Seems the forest folk're in need of a 'venturer what can get things done."},{"name":"BADERON","text":"Fer them to ask fer 'elp like this, ye can bet the task won't be no skip through a sunny glade. But after the way ye dealt with our fishback infestation, I doubt it's anythin' ye can't 'andle."},{"name":"BADERON","text":"Give us a shout when yer ready, an' I'll lay it out fer ye."},{"name":"TALK","text":"Temp: Duty calls. Do you wish to proceed with<br>“It's Probably Pirates”?"}],"reqs":{"jobs":[{"lvl":15,"id":130}],"questsType":"any","quests":[66209,66210]},"next":[67084,68547,68618,68705,68741,69204,69288,69531,70190]},"partials":[{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"quest","id":"66209","obj":{"i":66209,"n":"Call of the Sea","g":1,"l":"Gridania","s":89}},{"type":"quest","id":"66210","obj":{"i":66210,"n":"Call of the Sea","g":1,"l":"Ul'dah","s":90}},{"type":"quest","id":"67084","obj":{"i":67084,"n":"In a Manor of Spooking","g":203,"l":"Gridania","s":119,"f":1}},{"type":"quest","id":"68547","obj":{"i":68547,"n":"An Othardian Wolfman in Gridania","g":203,"l":"Gridania","s":144}},{"type":"quest","id":"68618","obj":{"i":68618,"n":"Lessons in Love","g":196,"l":"Gridania","s":150,"f":1}},{"type":"quest","id":"68705","obj":{"i":68705,"n":"The Sinister Soirée","g":203,"l":"Gridania","s":162}},{"type":"quest","id":"68741","obj":{"i":68741,"n":"A Many-splendored Thing","g":196,"l":"Gridania","s":170,"f":1}},{"type":"quest","id":"69204","obj":{"i":69204,"n":"Fear and Delight","g":203,"l":"Gridania","s":181}},{"type":"quest","id":"69288","obj":{"i":69288,"n":"Of Ardor and Argument","g":196,"l":"Gridania","s":187,"f":1}},{"type":"quest","id":"69531","obj":{"i":69531,"n":"All Clowns' Wake","g":203,"l":"Gridania","s":218}},{"type":"quest","id":"70190","obj":{"i":70190,"n":"Suited for Affection","g":196,"l":"Gridania","s":220,"f":1}}]}