{"quest":{"name":"Till Sea Swallows All","location":"Limsa Lominsa","id":66220,"patch":2.0,"sort":111,"icon":100085,"eventIcon":71201,"issuer":1002388,"target":1005012,"genre":1,"journal":["The personnel officer stands ready to complete your induction into the ranks.","You have been sworn into the service of Limsa Lominsa's Grand Company, the Maelstrom. Mere moments after you are assigned your new rank, Minfilia contacts you by linkpearl and requests your presence. Return to the Waking Sands.","Back at the Waking Sands, Minfilia announces that Biggs and Wedge, the Garlond Ironworks engineers, are now under the protection of the Scions of the Seventh Dawn. With new allies at your side, set forth once more to fight for the good of all Eorzea."],"objectives":["Speak with the Scion of the Seventh Dawn at the Waking Sands."],"dialogue":[{"name":"STORMPERSONNEL","text":"Let us start afresh, shall we?"},{"name":"STORMPERSONNEL","text":"You are welcome here, <span class=\"highlight\">Forename Surname</span>. That such a well-respected adventurer would choose to join our ranks is most heartening. Before you swear your allegiance to us, however, it is only right that I tell you exactly what it is that you will be joining."},{"name":"STORMPERSONNEL","text":"A Grand Company is more than simply a collection of soldiers. It is an all-encompassing organization which draws upon the resources of an entire city–state to form a united military force capable of standing against a nation's deadliest enemies."},{"name":"STORMPERSONNEL","text":"We of the Maelstrom are charged with meeting the threats posed by the primals and the Garlean Empire, and solving the many problems caused by the Calamity."},{"name":"STORMPERSONNEL","text":"Every man and woman who serves under our colors has a role to play in keeping the great warship that is Limsa Lominsa afloat, and on whatever heading Chief Admiral Merlwyb Bloefhiswyn sees fit to set."},{"name":"STORMPERSONNEL","text":"As part of this grand vessel's crew, you will be expected to take your turn at the oars─for the winds do not look favorable, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, and strength of arm may be all that sees us safe to port."},{"name":"STORMPERSONNEL","text":"...If I've lost you with talk of ship and oar, let me put it another way: a Maelstrom soldier labors till <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> last breath, fights till <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> last drop of blood. We give our all in service to this nation, and no less is expected of you."},{"name":"STORMPERSONNEL","text":"<span class=\"highlight\">Surname</span>─it is customary for new recruits to swear an oath of their own choosing upon entering the Maelstrom's ranks. Is there aught you'd like to say?"},{"name":"Q1","text":"What oath will you swear?"},{"name":"A1","text":"You have my sword till sea swallows all!"},{"name":"A1","text":"What skills I have are yours, till sea swallows all!"},{"name":"A1","text":"I will follow the Admiral to the very bottom of the abyss!"},{"name":"A1","text":"..."},{"name":"STORMPERSONNEL","text":"And I've no doubt we'll need it! Keep your weapons close to hand, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"STORMPERSONNEL","text":"Ah yes, the many and varied skills of the adventurer! I've no doubt that your travels have furnished you with such knowledge as will prove invaluable to our cause."},{"name":"STORMPERSONNEL","text":"As would we all! A capable crew is one thing, but unswerving loyalty is a trait that cannot be trained or bought. Well said, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"STORMPERSONNEL","text":"No love for grandiose proclamations, eh? Ha! Such silent resolve is not uncommon among the brothers and sisters of the sea. "},{"name":"STORMPERSONNEL","text":"<span class=\"highlight\">Forename Surname</span>, I hereby assign you the rank of storm private third class. You are now officially a soldier of the Maelstrom."},{"name":"STORMPERSONNEL","text":"Welcome aboard, Private. May you serve Limsa Lominsa well, till sea swallows all."},{"name":"MINFILIA","text":"Can you hear me, <span class=\"highlight\">Forename</span>? This is Minfilia."},{"name":"MINFILIA","text":"An officer of the Maelstrom contacted me with news of your enlistment. My congratulations, Private <span class=\"highlight\">Surname</span>."},{"name":"MINFILIA","text":"I have no doubt that you are eager to make the acquaintance of your new comrades, but I would ask that you pay a visit to your old ones first. Remember: though you are now a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the Storm, you are no less a Scion! Pray return to the Waking Sands at your earliest convenience. There are some friends here whom I would very much like you to meet. We shall be waiting!"},{"name":"STORMPERSONNEL","text":"No rest for the wicked, eh?"},{"name":"STORMPERSONNEL","text":"Before you make yourself scarce, I recommend having a word with Commander Rhiki. Might be worth your while..."},{"name":"SYSTEM","text":"You may now accept the quest “My Little Chocobo (Maelstrom)” by speaking with R'ashaht Rhiki."},{"name":"SYSTEM","text":"This quest must be completed in order to proceed to the end of the main scenario for A Realm Reborn."},{"name":"GUIDE","text":"Welcome back, <span class=\"highlight\">Forename</span>! Lady Minfilia awaits you within."},{"name":"MINFILIA","text":"Welcome back! It seems you wasted no time putting your skills to work!"},{"name":"SYS","text":"And so Minfilia welcomes you to the next chapter of your tale..."},{"name":"SYS","text":"This concludes the main scenario for the Beta Version."},{"name":"SYS","text":"Though your journey has come to an end for now, exciting new experiences yet remain, including a wide range of quests and dungeons."},{"name":"SYS","text":"We hope you will continue to enjoy FINAL FANTASY XIV: A Realm Reborn Beta Version! Thank you for playing!"}],"reward":{"gil":1025,"gcseal":300,"xp":8120},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[66217]},"next":[66049]},"partials":[{"type":"npc","id":"1002388","obj":{"i":1002388,"n":"Storm Personnel Officer","l":28,"q":3}},{"type":"npc","id":"1005012","obj":{"i":1005012,"n":"Scion Of The Seventh Dawn","l":356,"q":5}},{"type":"quest","id":"66217","obj":{"i":66217,"n":"The Company You Keep (Maelstrom)","g":1,"l":"The Waking Sands","s":108}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}}]}