{"quest":{"name":"Leves of Camp Drybone","location":"Eastern Thanalan","id":66224,"patch":2.0,"sort":150,"unlocksFunction":1,"eventIcon":71341,"issuer":1001799,"target":1001799,"genre":93,"journal":["Poponagu, the local levequest representative in Camp Drybone, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves he has to offer, Poponagu requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Poponagu in Camp Drybone.","Poponagu is now confident that you are capable of handling any of the trials and tribulations you might encounter around Camp Drybone. Prove your worth as an adventurer, and continue to undertake the guildleves he has to offer."],"objectives":["Complete Poponagu's trial guildleve.","Report to Poponagu."],"dialogue":[{"name":"POPONAGU","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, adventurer. I am Poponagu, representative of the Adventurers' Guild."},{"name":"POPONAGU","text":"I have a number of fine guildleves in my possession, which I will gladly allow you to undertake─if you prove yourself sufficiently capable, that is."},{"name":"POPONAGU","text":"You see, protocol dictates that I administer a trial guildleve. Until you complete it, I can grant you no more."},{"name":"POPONAGU","text":"How about this task? Review the details and tell me if you are up for the challenge."},{"name":"POPONAGU","text":"Very good. You need merely <span class=\"highlight\">beckon</span> to the gullible goblin, Guttrix Sliverpicks, to help lead him to his destination."},{"name":"SYS","text":"Use the <span class=\"highlight\">beckon</span> emote to lead Guttrix Sliverpicks safely to the destination. You may find it convenient to add the emote to your hotbar before beginning the guildleve."},{"name":"POPONAGU","text":"You may begin the levequest at any time."},{"name":"POPONAGU","text":"I see the desert heat wasn't too much for you. Here is your reward. See that you don't spend it all at the pub!"},{"name":"POPONAGU","text":"Oh, haven't you already initiated the trial? Shouldn't you attend to your goblin ward, then?"},{"name":"POPONAGU","text":"And with that, you have fulfilled the requirements. You are free to partake of my guildleves at will."},{"name":"POPONAGU","text":"There is always work to be done here in Camp Drybone. Whatever your talents, I have no doubt that you will find someone in need and willing to pay."}],"reward":{"gil":239,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1001799","obj":{"i":1001799,"n":"Poponagu","l":44,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}