{"quest":{"name":"Men of the Blue Tattoos","location":"Lower La Noscea","id":66225,"patch":2.0,"sort":77,"eventIcon":71201,"issuer":1002237,"target":1000972,"genre":1,"journal":["Ghimthota wishes to entrust you with an important task.","Among the possessions of Ahtzapfyn, the pirate behind the plot to sabotage the <span class=\"emphasis\">Victory</span>, a missive written in some manner of code has been discovered. Unable to find anyone capable of deciphering the curious lettering, Ghimthota wishes to enlist the help of Baderon and his colorful circle of acquaintance. Deliver the missive to the proprietor of the Drowning Wench.","After reading the contents of the missive, a visibly worried Baderon bids you prepare for the worst. Summon up your courage, and speak with him once more."],"objectives":["Deliver the arcane epistle to Baderon in Limsa Lominsa."],"dialogue":[{"name":"GHIMTHOTA","text":"<span class=\"highlight\">Forename</span>. In light of your role in recent events, there are few others to whom I would entrust this task."},{"name":"GHIMTHOTA","text":"Since last we spoke, a curious missive has been discovered amongst the personal effects of Ahtzapfyn, the pirate behind the plot to sabotage the <span class=\"emphasis\">Victory</span>."},{"name":"GHIMTHOTA","text":"This missive was penned in the most unusual script─a script we believe to be some manner of code."},{"name":"GHIMTHOTA","text":"Needless to say, anything which a proven enemy of Limsa Lominsa deems worthy of enciphering is like to be of great interest to the Maelstrom. Unfortunately, none among us can make any sense of the message."},{"name":"GHIMTHOTA","text":"In cases such as this, I am told the Yellowjackets are wont to turn to Baderon and his convenient...connections."},{"name":"GHIMTHOTA","text":"Thus I would have you deliver this missive to the proprietor of the Drowning Wench. Into his hand, and no other, do you understand?"},{"name":"BADERON","text":"Ahoy there, <span class=\"highlight\">Forename</span>! I've been 'earin' about your deeds at the Drydocks!"},{"name":"BADERON","text":"Ahtbyrm laid out the entire tale fer me. Poor sod was still reelin' at 'is old man's part in the business, but at least ye kept the <span class=\"emphasis\">Victory</span> from bein' sunk afore she'd sailed."},{"name":"BADERON","text":"An' fer that, I owe ye me thanks!"},{"name":"BADERON","text":"Ye've really made a name fer yerself 'ere in Limsa, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Folk know that when they need summat doin'─"},{"name":"BADERON","text":"Eh? <span class=\"emphasis\">You</span> need summat doin'? An' what might that be?"},{"name":"BADERON","text":"...Ye want someone to read a message writ in funny letters fer ye? An' Ghimthota thought I might know a man as could? Well, let's see it, then!"},{"name":"BADERON","text":"Aye..."},{"name":"BADERON","text":"...I reckon I might know a canny bugger what can read stuff like this. Ugly sod by the name o' Baderon."},{"name":"BADERON","text":"Ye know, yer like one o' me regulars now, <span class=\"highlight\">Forename</span>."},{"name":"BADERON","text":"Ye've never let me down yet, an', Navigator 'elp me, I reckon I can trust ye."},{"name":"BADERON","text":"Ghimthota was right to want this message deciphered... We've got us some trouble brewin', 'ere, an' no mistake. Get ready fer action, an' I'll explain."}],"reward":{"gil":239,"xp":6440},"reqs":{"jobs":[{"lvl":14,"id":130}],"quests":[65950]},"next":[66080]},"partials":[{"type":"npc","id":"1002237","obj":{"i":1002237,"n":"Ghimthota","l":31,"q":4,"t":"Storm Captain"}},{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"quest","id":"65950","obj":{"i":65950,"n":"Victory in Peril","g":1,"l":"Lower La Noscea","s":76}},{"type":"quest","id":"66080","obj":{"i":66080,"n":"Feint and Strike","g":1,"l":"Limsa Lominsa","s":78}}]}