{"quest":{"name":"Leves of Little Ala Mhigo","location":"Southern Thanalan","id":66228,"patch":2.0,"sort":250,"unlocksFunction":1,"eventIcon":71341,"issuer":1002365,"target":1002365,"genre":93,"journal":["Esmond, the local levequest representative in Little Ala Mhigo, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves he has to offer, Esmond requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Esmond in Little Ala Mhigo.","Esmond is now confident that you are capable of handling any of the trials and tribulations you might encounter around Little Ala Mhigo. Prove your worth as an adventurer, and continue to undertake the guildleves he has to offer."],"objectives":["Complete Esmond's trial guildleve.","Report to Esmond."],"dialogue":[{"name":"ESMOND","text":"Greetings and welcome to Little Ala Mhigo. My name is Esmond, and I represent the Adventurers' Guild."},{"name":"ESMOND","text":"The people here need any and all help that happens their way. Might you have come to lend a hand?"},{"name":"ESMOND","text":"If so, you must first undertake a trial levequest to prove yourself capable of surviving the many terrors of Thanalan."},{"name":"ESMOND","text":"This task should serve as an adequate test. What say you, adventurer?"},{"name":"ESMOND","text":"Be warned that the voidsent will tear free of its prison once all the pages have been assembled. Prepare yourself well."},{"name":"ESMOND","text":"You have your task. Pray begin when ready."},{"name":"ESMOND","text":"You appear to have been through a great deal. This reward should help lift your spirits."},{"name":"ESMOND","text":"So it's begun, has it? Best of luck to you, adventurer."},{"name":"ESMOND","text":"Remember that the voidsent will tear free of its prison once all the pages have been assembled. Prepare yourself well."},{"name":"ESMOND","text":"It's clear that you should have no difficulty completing my other guildleves. I see no need to test you further."},{"name":"ESMOND","text":"Little Ala Mhigo will benefit from any aid you can provide. Pray come to me should you desire more work."}],"reward":{"gil":2112,"xp":4760},"reqs":{"jobs":[{"lvl":25,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1002365","obj":{"i":1002365,"n":"Esmond","l":45,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}