{"quest":{"name":"For Coin and Country","location":"Ul'dah","id":66221,"patch":2.0,"sort":112,"icon":100093,"eventIcon":71201,"issuer":1002391,"target":1005012,"genre":1,"journal":["The personnel officer stands ready to complete your induction into the ranks.","You have been sworn into the service of Ul'dah's Grand Company, the Immortal Flames. Mere moments after you are assigned your new rank, Minfilia contacts you by linkpearl and requests your presence. Return to the Waking Sands.","Back at the Waking Sands, Minfilia announces that Biggs and Wedge, the Garlond Ironworks engineers, are now under the protection of the Scions of the Seventh Dawn. With new allies at your side, set forth once more to fight for the good of all Eorzea."],"objectives":["Speak with the Scion of the Seventh Dawn at the Waking Sands."],"dialogue":[{"name":"FLAMEPERSONNEL","text":"Are you ready, <span class=\"highlight\">Forename</span>? Then let us begin."},{"name":"FLAMEPERSONNEL","text":"<span class=\"highlight\">Forename Surname</span>─you stand poised to enter a sacred trust."},{"name":"FLAMEPERSONNEL","text":"The Flames of Ul'dah burn bright, casting light where there is dark and purging evil wheresoever it lurks."},{"name":"FLAMEPERSONNEL","text":"We are ever ready to meet the nation's enemies in battle, be they beastmen, Garleans, or worse."},{"name":"FLAMEPERSONNEL","text":"And at a word from Flame General Raubahn Aldynn, we would gladly lay down our lives to maintain the peace and prosperity of Ul'dah."},{"name":"FLAMEPERSONNEL","text":"To join our ranks, you must forsake all other nations. Only then may you commit yourself to the fire and be reborn as an Immortal Flame."},{"name":"FLAMEPERSONNEL","text":"Burn as one of us, <span class=\"highlight\">Forename Surname</span>, and together we shall chase the darkness from Ul'dah!"},{"name":"FLAMEPERSONNEL","text":"Will you swear an oath to mark this occasion?"},{"name":"Q1","text":"What oath do you swear?"},{"name":"A1","text":"My sword belongs to Ul'dah!"},{"name":"A1","text":"What skills I have belong now to Ul'dah!"},{"name":"A1","text":"I will follow the Flame General unto death!"},{"name":"A1","text":"..."},{"name":"FLAMEPERSONNEL","text":"Spoken like a soldier! You'll do well here."},{"name":"FLAMEPERSONNEL","text":"And Ul'dah will have need of them in the days ahead. The knowledge and experience of well-traveled adventurers are valuable assets."},{"name":"FLAMEPERSONNEL","text":"Hah! The Flame General would lead the van in every battle if he could. 'Twouldn't surprise me if you had the chance to fight by his side one day!"},{"name":"FLAMEPERSONNEL","text":"I take it you would rather be judged by your deeds. I respect that. We want a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action, not words."},{"name":"FLAMEPERSONNEL","text":"Very well. Your resolve is plain.<br><span class=\"highlight\">Forename Surname</span>─I hereby confer upon you the rank of flame private third class.<br>Welcome to the Immortal Flames, Private."},{"name":"FLAMEPERSONNEL","text":"May you fight to the last for coin and country."},{"name":"MINFILIA","text":"Can you hear me, <span class=\"highlight\">Forename</span>? This is Minfilia."},{"name":"MINFILIA","text":"An officer of the Immortal Flames contacted me with news of your enlistment. My congratulations, Private <span class=\"highlight\">Surname</span>."},{"name":"MINFILIA","text":"I have no doubt that you are eager to make the acquaintance of your new comrades, but I would ask that you pay a visit to your old ones first. Remember: though you are now a Flame of Ul'dah, you are no less a Scion! Pray return to the Waking Sands at your earliest convenience. There are some friends here whom I would very much like you to meet. We shall be waiting!"},{"name":"FLAMEPERSONNEL","text":"It seems your presence is required elsewhere."},{"name":"FLAMEPERSONNEL","text":"But before you leave, perhaps you could find a moment to speak with Commander Swift. He is not one to see new recruits go into the field unprepared."},{"name":"SYSTEM","text":"You may now accept the quest “My Little Chocobo (Immortal Flames)” by speaking with Swift."},{"name":"SYSTEM","text":"This quest must be completed in order to proceed to the end of the main scenario for A Realm Reborn."},{"name":"GUIDE","text":"Welcome back, <span class=\"highlight\">Forename</span>! Lady Minfilia awaits you within."},{"name":"MINFILIA","text":"Welcome back! It seems you wasted no time putting your skills to work!"},{"name":"SYS","text":"And so Minfilia welcomes you to the next chapter of your tale..."},{"name":"SYS","text":"This concludes the main scenario for the Beta Version."},{"name":"SYS","text":"Though your journey has come to an end for now, exciting new experiences yet remain, including a wide range of quests and dungeons."},{"name":"SYS","text":"We hope you will continue to enjoy FINAL FANTASY XIV: A Realm Reborn Beta Version! Thank you for playing!"}],"reward":{"gil":1025,"gcseal":300,"xp":8120},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[66218]}},"partials":[{"type":"npc","id":"1002391","obj":{"i":1002391,"n":"Flame Personnel Officer","l":40,"q":3}},{"type":"npc","id":"1005012","obj":{"i":1005012,"n":"Scion Of The Seventh Dawn","l":356,"q":5}},{"type":"quest","id":"66218","obj":{"i":66218,"n":"The Company You Keep (Immortal Flames)","g":1,"l":"The Waking Sands","s":109}}]}