{"quest":{"name":"Leves of Costa del Sol","location":"Eastern La Noscea","id":66232,"patch":2.0,"sort":300,"unlocksFunction":1,"eventIcon":71341,"issuer":1004344,"target":1004344,"genre":91,"journal":["Nahctahr, the Adventurers' Guild representative for local levequests in Costa del Sol, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves he has to offer, Nahctahr requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Nahctahr in Costa del Sol.","Nahctahr is now confident that you are capable of handling any of the trials and tribulations you might encounter around Costa del Sol. Prove your worth as an adventurer, and continue to undertake the guildleves he has to offer."],"objectives":["Complete Nahctahr's trial guildleve.","Report to Nahctahr."],"dialogue":[{"name":"NAHCTAHR","text":"Are you looking to make yourself useful? I'm Nahctahr, a representative of the Adventurers' Guild."},{"name":"NAHCTAHR","text":"As the levemete stationed here in Costa del Sol, it's my job to match capable adventurers to the tasks that come in from the locals."},{"name":"NAHCTAHR","text":"I'd start loading you up with dangerous fieldwork immediately, but I'm <span class=\"emphasis\">required</span> to assess your suitability for handling the sort of threats you might encounter."},{"name":"NAHCTAHR","text":"Take a good look at the task outlined in this guildleve. Are you willing to try your hand at this trial?"},{"name":"NAHCTAHR","text":"Very well. I'm certain you're already aware of this, but you'll likely encounter hostile creatures in the area─be sure you're properly armed and armored before beginning your task."},{"name":"NAHCTAHR","text":"You're free to begin the guildleve whenever your preparations are complete."},{"name":"NAHCTAHR","text":"As I expected, you managed the task without too much difficulty. Don't forget to collect your reward!"},{"name":"NAHCTAHR","text":"You've started the trial guildleve, have you? It's just a formality, aye, but try not to make a mess of it, adventurer."},{"name":"NAHCTAHR","text":"See? I knew that trial was a waste of time. I have plenty of other tasks that a hardy soul such as yourself should have little trouble with."},{"name":"NAHCTAHR","text":"Costa del Sol welcomes your continued cooperation!"}],"reward":{"gil":2416,"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1004344","obj":{"i":1004344,"n":"Nahctahr","l":32,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}