{"quest":{"name":"My Little Chocobo (Maelstrom)","location":"Limsa Lominsa","id":66237,"patch":2.0,"sort":200,"unlocksFunction":1,"eventIcon":71341,"issuer":1003281,"target":1001027,"involved":[1006002],"genre":91,"usedItems":[6017],"journal":["R'ashaht Rhiki suggests you look into having a personal chocobo issued.","To obtain your personal chocobo, you must present Fraegeim with a Storm Chocobo Issuance. This document can be obtained by exchanging company seals with the storm quartermaster. Here's hoping you have been setting aside your seals...","Fraegeim brings you your bird, and it is love at first sight. Name your new companion, and make it official.","After much deliberation, you decide on a name worthy of the noblest steed. Inform Fraegeim to complete the last of the formalities.","And so begins the adventures of <span class=\"highlight\">Forename Surname</span> and <span class=\"highlight\">Companion</span>. May their friendship last for eternity!"],"objectives":["Present a Storm Chocobo Issuance to Fraegeim.","Name your chocobo.","Speak with Fraegeim."],"dialogue":[{"name":"Rashaht","text":"Well, if it isn't [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! I must say, the tales of your deeds have been an inspiration to the troops."},{"name":"Rashaht","text":"Our duties take us far and wide, and I'll wager you've slogged across quite a few malms of countryside on naught but your own two feet."},{"name":"Rashaht","text":"Such a sterling soldier of the Maelstrom deserves <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own steed. Let us see about having one issued for you."},{"name":"Rashaht","text":"All you need do is obtain a Storm Chocobo Issuance by exchanging company seals with the quartermaster. Once you have this deed, present it to Fraegeim, and she will see you saddled up on one of our trusty birds."},{"name":"Rashaht","text":"To be issued a personal chocobo, you must first obtain a Storm Chocobo Issuance by exchanging company seals with the quartermaster. Once you have this deed, present it to Fraegeim, and she will see you saddled up on one of our trusty birds."},{"name":"Fraegeim","text":"Want a bird issued, you say? Then I'll need to see your Storm Chocobo Issuance."},{"name":"Fraegeim","text":"Yes, everything appears to be in order."},{"name":"Fraegeim","text":"A moment please. I'll be right back with your chocobo."},{"name":"Fraegeim","text":"And here he is! The fellow has been in high spirits the past few bells. He must have sensed that his master was coming!"},{"name":"Fraegeim","text":"Now then, to make it official, you'll want to give your noble steed a name."},{"name":"Fraegeim","text":"Want a bird issued, you say? Then I'll need to see your Storm Chocobo Issuance. You can get one from the storm quartermaster, over at Maelstrom Command."},{"name":"Fraegeim","text":"Of course, you will need to exchange Storm Seals for it. You can earn these by completing tasks for the Maelstrom, Limsa Lominsa's Grand Company."},{"name":"CHOCOBO","text":"Kweh!"},{"name":"Fraegeim","text":"Now then, to make it official, you'll want to give your noble steed a name."},{"name":"Fraegeim","text":"Heh heh! I daresay he likes his name!"},{"name":"Fraegeim","text":"Here is your very own chocobo whistle. Simply blow into it, and your feathered friend will come bounding to your side."},{"name":"Fraegeim","text":"But do forgive him if he doesn't respond when summoned in crowded city areas or monster-infested lairs. Chocobos are stout-hearted creatures, but they have their limits."},{"name":"Fraegeim","text":"And lastly, I present you with your chocobo rider's license, as is required by law."},{"name":"Fraegeim","text":"And that concludes all the formalities! I wish you and your chocobo long years of fulfilling companionship!"},{"name":"CHOCOBO","text":"Name Your Chocobo"},{"name":"CHOCOBO","text":"Name"},{"name":"CHOCOBO","text":"Names must be between 2 and 20 alphabetic characters."}],"reward":{"items":[{"id":6001}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":1}],"gc":1},"next":[66698]},"partials":[{"type":"npc","id":"1003281","obj":{"i":1003281,"n":"R'ashaht Rhiki","l":28,"q":13,"t":"Storm Commander"}},{"type":"npc","id":"1001027","obj":{"i":1001027,"n":"Fraegeim","l":29,"q":1,"t":"Chocobokeep"}},{"type":"npc","id":"1006002","obj":{"i":1006002,"n":"Chocobo","l":29,"q":1}},{"type":"item","id":"6001","obj":{"i":6001,"n":"Chocobo Whistle","l":1,"c":26012,"t":63}},{"type":"item","id":"6017","obj":{"i":6017,"n":"Storm Chocobo Issuance","l":1,"c":26191,"t":63}},{"type":"quest","id":"66698","obj":{"i":66698,"n":"My Feisty Little Chocobo","g":92,"l":"South Shroud","s":300,"f":1}}]}