{"quest":{"name":"Color Your World","location":"Western Thanalan","id":66235,"patch":2.0,"sort":150,"unlocksFunction":1,"eventIcon":71341,"issuer":1004990,"target":1004990,"genre":93,"usedItems":[4745],"journal":["Swyrgeim wants to show you a whole new world of colors.","Swyrgeim is dismayed at your appearance, and offers to help you remedy it. Before she will do so, however, she requires that you purchase a bottle of orange juice from the merchant by the northern gates and bring it to her so that her thirst might be sated.","Thanking you for the orange juice, Swyrgeim proceeds to teach you how to go about dyeing your gear. Armed with this knowledge, go forth and fill your life with color."],"objectives":["Deliver a bottle of orange juice to Swyrgeim."],"dialogue":[{"name":"SWYRGEIM","text":"You there! Yes, <span class=\"emphasis\">you</span>, the decisively unfashionable adventurer!"},{"name":"SWYRGEIM","text":"Gods be good, never in my life have I seen such unapologetic focus on function at extreme cost to form. The mere sight of you fair makes my eyes bleed!"},{"name":"SWYRGEIM","text":"As a lover of all things aesthetically pleasing, I cannot in good conscience allow you to continue roaming the realm in that sorry state. I believe your appearance can yet be salvaged...through the use of color."},{"name":"SWYRGEIM","text":"I will teach you how to go about dyeing your outfit, but first I must have a drink. The heat has given me a vicious thirst, and I won't be able to talk for any length of time."},{"name":"SWYRGEIM","text":"Be a dear and buy me a bottle of orange juice at the stall by the northern gates, would you? Once I have moistened my throat, we shall see to the business of remedying your appearance."},{"name":"SWYRGEIM","text":"Pray tell, have you brought my orange juice? Lest you have forgotten, the merchant who sells it can be found just inside the northern gates."},{"name":"SWYRGEIM","text":"&lt;gulp&gt; Phew... That's a relief. Finally, I can teach you how to bring color into your life. Listen well."},{"name":"SWYRGEIM","text":"There are handy items called <span class=\"emphasis\">colorants</span> which allow folk to dye their outfits a veritable rainbow of colors. These colorants are so simple to use, adventurers have no excuse to be fashion-unconscious."},{"name":"SWYRGEIM","text":"Lest you worry that dyeing will affect your garment's precious properties, you may rest assured it will not. The practicality you adventurers love so much will not suffer for the change in appearance─a change for the better!"},{"name":"SWYRGEIM","text":"It should also gladden you to know that garments can be dyed repeatedly, so there is no fear of getting locked into one color. The garish pink that seemed like such a wonderful idea after a dozen glasses of red <span class=\"emphasis\">can</span> be undone!"},{"name":"SWYRGEIM","text":"And that is all you need to know about dyeing gear. Now, what are you waiting for? Get out there and bring some color into your life!"},{"name":"SWYRGEIM","text":"Hurry, else I am like to die of thirst!"}],"reward":{"items":[{"num":3,"id":5735},{"num":3,"id":5762},{"num":3,"id":5788}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67094]},"partials":[{"type":"npc","id":"1004990","obj":{"i":1004990,"n":"Swyrgeim","l":42,"q":3}},{"type":"item","id":"5735","obj":{"i":5735,"n":"Rose Pink Dye","l":1,"c":22805,"t":55,"p":40}},{"type":"item","id":"5762","obj":{"i":5762,"n":"Bone White Dye","l":1,"c":22806,"t":55,"p":40}},{"type":"item","id":"5788","obj":{"i":5788,"n":"Ice Blue Dye","l":1,"c":22804,"t":55,"p":40}},{"type":"item","id":"4745","obj":{"i":4745,"n":"Orange Juice","l":6,"c":24401,"t":46,"p":7}},{"type":"quest","id":"67094","obj":{"i":67094,"n":"Simply to Dye For","g":95,"l":"Mor Dhona","s":10,"f":1}}]}