{"quest":{"name":"Leves of Moraby","location":"Lower La Noscea","id":66231,"patch":2.0,"sort":200,"unlocksFunction":1,"eventIcon":71341,"issuer":1004347,"target":1004347,"genre":91,"journal":["Ourawann, the Adventurers' Guild representative for local levequests at the Moraby Drydocks, is seeking an adventurer to undertake guildleves.","In order to gauge your ability to handle the various guildleves he has to offer, Ourawann requires that you carry out a preliminary task.","You have successfully completed the trial guildleve. Report to Ourawann at the Moraby Drydocks.","Ourawann is now confident that you are capable of handling any of the trials and tribulations you might encounter around the Moraby Drydocks. Prove your worth as an adventurer, and continue to undertake the guildleves he has to offer."],"objectives":["Complete Ourawann's trial guildleve.","Report to Ourawann."],"dialogue":[{"name":"OURAWANN","text":"Greetings, adventurer. I am Ourawann, a representative of the Adventurers' Guild."},{"name":"OURAWANN","text":"As the levemete stationed here at the Moraby Drydocks, I'm responsible for assigning the various tasks that come in from the beleaguered locals."},{"name":"OURAWANN","text":"The work is not necessarily simple or safe, thus I would first gauge the limits of your abilities by setting you a trial assignment."},{"name":"OURAWANN","text":"Take a moment to peruse the task outlined in this guildleve. Do you believe yourself up to the challenge?"},{"name":"OURAWANN","text":"Very well, let's see what you can do. Ah, before you begin, I have a word of advice: acquire some cores from the lightning sprites."},{"name":"OURAWANN","text":"Use the cores on the crabs, and you'll soon discover which creatures are the big claws."},{"name":"SYS","text":"You can obtain the necessary cores by defeating lightning sprites."},{"name":"SYS","text":"Use these cores on the crabs to identify─and simultaneously weaken─your guildleve objective."},{"name":"OURAWANN","text":"Pray begin the levequest once you are ready."},{"name":"OURAWANN","text":"Completed the task, have you? Then you need only collect your reward."},{"name":"OURAWANN","text":"You've begun the trial guildleve, then? I wish you fortune in your task."},{"name":"OURAWANN","text":"You have performed admirably. I have no qualms about assigning you further work."},{"name":"OURAWANN","text":"With a Maelstrom warship under construction here, the military is eager to keep the Drydocks safe and secure. They'd be glad to know a stalwart adventurer like you is around, cleaning up these problems one at a time."}],"reward":{"gil":1795,"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":34}],"questsType":"any","quests":[66229,65756]}},"partials":[{"type":"npc","id":"1004347","obj":{"i":1004347,"n":"Ourawann","l":31,"q":1,"t":"Levemete"}},{"type":"quest","id":"66229","obj":{"i":66229,"n":"Leves of Swiftperch","g":91,"l":"Limsa Lominsa","s":100,"f":1}},{"type":"quest","id":"65756","obj":{"i":65756,"n":"Leves of Bentbranch","g":92,"l":"Gridania","s":100,"f":1}}]}