{"quest":{"name":"We Come in Peace","location":"Gridania","id":66244,"patch":2.0,"sort":114,"icon":100111,"eventIcon":71201,"target":1006188,"involved":[1000257,1000766],"genre":0,"journal":["Commander Vorsaile Heuloix has been awaiting the aid of the Scions.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Vorsaile Heuloix in the Adders' Nest.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Mitainie has instructed you to take the ferry from Westshore Pier to reach the East Shroud. Once there, you will only need to head due east to find the Hawthorne Hut. Before going there, however, stop off along the way at Fullflower Comb and pay your regards to Rosa Hawthorne.","Rosa Hawthorne has a sticky situation on her hands, what with killer hornets assailing her precious honeybees. Slay three hornet clouds to put her heart at ease.","You have triumphed over the killer hornets. Report your success to Rosa.","Rosa thanks you for having protected her beehives from the swarm of hornets. To express her gratitude, she has given you a pot of fresh honey, which she knows will help loosen the lips of the serpent officer you are seeking, Amelain. Proceed to the Hawthorne Hut and deliver the honey as bade.","The sweet-toothed Amelain has informed you that Rosa's husband, Rolfe Hawthorne, is well versed in sylphic culture and should hold the answers you seek."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Vorsaile Heuloix in the Adders' Nest.</span>"],"dialogue":[{"name":"VORSAILE","text":"Well! If it isn't [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>, reporting for duty. That's the zeal I like to see from an enterprising young Serpent."},{"name":"VORSAILE","text":"Hail, adventurer. I bid you welcome to the Adders' Nest. Do you seek to entwine your destiny with the Twin Adder?"},{"name":"YDA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Morning</span><span class=\"alternative\">Good day</span></span>, Commander! Sorry to disappoint you, but other business brings us here today."},{"name":"VORSAILE","text":"Yda and Papalymo, always a pleasure to see the two of you. My men tell me you quest in the name of the Scions of late."},{"name":"PAPALYMO","text":"Quite so, Commander. A little bird told us that the Twin Adder was in need of our adventuring prowess."},{"name":"VORSAILE","text":"Aye, your little bird sings true. No doubt you've heard that we're investigating the sylphs─that curious beast tribe that calls the depths of the Twelveswood home."},{"name":"VORSAILE","text":"The sylphs are, for the most part, a peaceable bunch─much to the delight of the Elder Seedseer, who has no desire to see her people embroiled in yet another fruitless war."},{"name":"VORSAILE","text":"The Twin Adder is of the same mind, and 'tis precisely for this reason that the sylphs' relation to the primal Ramuh has raised a flag of warning amongst our ranks."},{"name":"VORSAILE","text":"Friendly as they may appear, beastmen will be beastmen."},{"name":"VORSAILE","text":"Should there be even a sliver of a chance that the summoning of the primal might disturb the balance between Gridania and the sylphic tribes, it is a possibility we cannot ignore."},{"name":"PAPALYMO","text":"Better to be safe than sorry, indeed."},{"name":"VORSAILE","text":"Do we strike at Ramuh, or leave the sylphs to their own ways? That is the question, yet I find myself lacking ample knowledge to arrive at an answer."},{"name":"VORSAILE","text":"Opinions abound within Gridania, but to listen only to one's own is among the greatest mistakes a commander can make."},{"name":"VORSAILE","text":"I would hear from the other side─the sylphs themselves─and seek an impartial party to serve as my liaison. That is where you Scions come in."},{"name":"VORSAILE","text":"The sylphs of Little Solace remain untempered, and have held many a productive dialogue with our people. I would hear their candid thoughts on their tempered brethren."},{"name":"VORSAILE","text":"That said, I urge you to exercise due caution. Sylphic tradition and etiquette bear little resemblance to our own. It would not do to have any cross-cultural <span class=\"emphasis\">faux pas</span> get in the way of a productive parley."},{"name":"VORSAILE","text":"En route to Little Solace, you will come upon the Hawthorne Hut. Our officer stationed there can enlighten you as to how to win the sylphs' favor. May your expedition be a worthwhile one."},{"name":"PAPALYMO","text":"A friendly palaver with the sylphs? This should be a pleasant enough diversion."},{"name":"PAPALYMO","text":"The Hawthorne Hut, was it? Why, I believe the ferry departing from Westshore Pier should take us straight there."},{"name":"YDA","text":"A friendly palaver, indeed! I hope this will be as straightforward as you say, Papalymo."},{"name":"MITAINIE","text":"Aye, the ferry docked at the base of this hill will carry you across the lake to the East Shroud."},{"name":"MITAINIE","text":"Once you're ashore, head due east and you should find the Hawthorne Hut without much trouble."},{"name":"MITAINIE","text":"The Hawthornes are most welcoming folk who have shown us no small measure of goodwill. Still, a bit of courtesy goes a long way: I would encourage you to stop by Fullflower Comb and introduce yourself to Rosa before you travel on."},{"name":"ROSA","text":"An adventurer! Thank the Twelve! You couldn't have come at a more opportune time. Please, you must help us!"},{"name":"ROSA","text":"Why, it's our bees! The poor little dears are under attack by a murderous swarm of hornets!"},{"name":"ROSA","text":"These beehives are our livelihood. You must save them!"},{"name":"ROSA","text":"Thank you, friend! Finally, our bees can make their honey in peace. I knew you were Twelvesent the moment I laid eyes upon you."},{"name":"ROSA","text":"Hm? You travel to our hut, you say? And would speak with the serpent officer there?"},{"name":"ROSA","text":"There is one who goes by Amelain. He is a sentry at Josselin's Spire, but makes regular excursions to our hut. He's quite enamored of our honey and the tales of my husband, Rolfe. Though I've found him to be tight-lipped around those he's unfamiliar with."},{"name":"ROSA","text":"...Ooh! I know what we might try. Why don't you take a jar of fresh honey to him? I reckon you'll find him <span class=\"emphasis\">more</span> than talkative then."},{"name":"AMELAIN","text":"Indeed, I am Amelain of the Twin Adder. Your face is unfamiliar to─hm? You have a present for me, you say?"},{"name":"AMELAIN","text":"A jar of Rosa's honey, and freshly harvested to boot! You certainly know how to make a first impression, friend!"},{"name":"AMELAIN","text":"Ah, so <span class=\"emphasis\">you</span> are the adventurer of whom the commander spoke! Do forgive me for being curt; my stomach was rumbling something fierce. My word, this honey...like liquid gold... Mmmmmm..."},{"name":"AMELAIN","text":"A-Ahem... Forgive me. You have come to discuss not honey, but sylphs. For all their whimsy, they are a wary lot. Particularly since the Empire has come to the Shroud..."},{"name":"AMELAIN","text":"Earn their trust, however, and they're as friendly as any folk. They have their quirks, but so do we all, no?"},{"name":"AMELAIN","text":"Would you know more, you'd do well to speak to Rosa's husband here, Rolfe. He's <span class=\"emphasis\">forgotten</span> more about the sylphs than I'll ever know."},{"name":"POP","text":"A deafening buzzing assaults your ears!"}],"reward":{"xp":8120},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[66049]}},"partials":[{"type":"npc","id":"1006188","obj":{"i":1006188,"n":"Amelain","l":55,"q":3}},{"type":"npc","id":"1000257","obj":{"i":1000257,"n":"Mitainie","l":53,"q":2}},{"type":"npc","id":"1000766","obj":{"i":1000766,"n":"Rosa Hawthorne","l":55,"q":2}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}}]}