{"quest":{"name":"Meat of the Matter","location":"East Shroud","id":66248,"patch":2.0,"sort":200,"eventIcon":71221,"issuer":1000615,"target":1000615,"genre":92,"journal":["Ysabel seeks to catch wild game and needs someone to lay traps.","Ysabel has run out of fresh meat to prepare hot meals for frontier sentries. Take the box of hunting tools to the Bramble Patch, and there lay traps in her stead.","You have set all the traps. Report back to Ysabel at the Hawthorne Hut.","Ysabel expresses her admiration for the men and women who willingly shed blood that peace might reign in the Twelveswood. You silently join her in praying for a bountiful catch."],"objectives":["Lay traps in the Bramble Patch.","Report to Ysabel."],"dialogue":[{"name":"YSABEL","text":"You are an adventurer, are you not? Aye, you have the same air about you as Father. He used to be an adventurer like you, though he has long since retired, and now finds pleasure in welcoming travelers to this humble hut. We also serve hot meals to the brave men and women who protect our borders─a small token of our appreciation for their efforts."},{"name":"YSABEL","text":"Speaking of which, our meat stocks are running perilously low yet again, and I must head into the Bramble Patch to trap some game. Sorry to cut short our conversation, but duty calls, and no one else is going to─"},{"name":"YSABEL","text":"Oh! I do hate to impose, but might I trouble you to take this box of hunting tools and lay the traps in my stead? It is for a good cause, as I mentioned. There are only so many hours in the day, you understand, and every bell I spend on this task would be a bell spent neglecting another."},{"name":"SYSTEM","text":"Lay traps in the Bramble Patch."},{"name":"SYSTEM","text":"Lay traps in the Bramble Patch."},{"name":"SYSTEM","text":"Lay traps in the Bramble Patch."},{"name":"YSABEL","text":"Thank you ever so much! Now, all that remains is for us to wait, and to pray for a bountiful catch. I shall have the Wood Wailers check the traps on the morrow. They are more than happy to do so, knowing that the meat will end up in their own bellies, like as not!"},{"name":"YSABEL","text":"But if I might be permitted to speak seriously for a moment, it is not an easy time to be a frontier sentry. Fearsome beasts abound in these parts, and there is the imperial threat besides."},{"name":"YSABEL","text":"Thus am I glad that I, who cannot wield a sword, may yet play my part by preparing hearty meals for those brave men and women who willingly endure hurts that simple folk like me might enjoy peace."}],"reward":{"items":[{"num":3,"id":5773},{"id":2712,"one":1},{"id":2708,"one":1},{"id":2703,"one":1},{"num":4,"id":5824,"one":1}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":1}],"quests":[66245]}},"partials":[{"type":"npc","id":"1000615","obj":{"i":1000615,"n":"Ysabel Hawthorne","l":55,"q":2}},{"type":"item","id":"5773","obj":{"i":5773,"n":"Lime Green Dye","l":1,"c":22810,"t":55,"p":216}},{"type":"item","id":"2712","obj":{"i":2712,"n":"Iron Celata","l":20,"c":40002,"t":34,"p":992}},{"type":"item","id":"2708","obj":{"i":2708,"n":"Iron Sallet","l":20,"c":40022,"t":34,"p":708}},{"type":"item","id":"2703","obj":{"i":2703,"n":"Ash Mask (Lapis Lazuli)","l":20,"c":40415,"t":34,"p":425}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66245","obj":{"i":66245,"n":"Sylphic Studies","g":1,"l":"East Shroud","s":115}}]}