{"quest":{"name":"The Weaponsmith of Legend","location":"Western Thanalan","id":66241,"patch":2.0,"sort":500,"icon":100166,"unlocksFunction":1,"eventIcon":71341,"issuer":1005021,"target":1003075,"involved":[1001304],"genre":93,"journal":["Nedrick appears concerned about your equipment.","Nedrick has introduced you to Rowena, an artifact collector who has set up shop at Revenant's Toll in Mor Dhona. If you are serious about your equipment, he recommends paying her a visit.","Rowena tells you about a weaponsmith of no small repute named Gerolt, who she claims is skilled in the restoration of ancient relics. Find Gerolt at Hyrstmill in the North Shroud, and show him the promise of payment that Rowena has given you.","You meet and speak with Gerolt. Shamelessly exploiting the prodigious debt he owes Rowena, you coerce the man into lending you his expertise in the restoration of a relic weapon. Do as Gerolt directs if you wish to become the proud owner of a legendary arm of yore."],"objectives":["Speak with Rowena at Revenant's Toll.","Show the promise of payment to Gerolt."],"dialogue":[{"name":"NEDRICK","text":"How fares the adventuring of late? Your gear holding up against the rigors of the trade? Make no mistake, my friend, the quality of your weapon may well prove the difference between life and death."},{"name":"NEDRICK","text":"If you're serious about such things, there's someone I can introduce you to. Her name is Rowena, and she is a collector of all manner of rare artifacts. She just might have something in her stock to suit your martial prowess."},{"name":"NEDRICK","text":"Rowena used to do business in Ul'dah, but has since relocated to Revenant's Toll so as to be nearer to the ancient ruins from which she derives her livelihood. Should you ever have reason to go there, you'd do well to pay her a call."},{"name":"ROWENA","text":"A friend o' Nedrick's, are you? Then you must be an adventurer o' some skill. My business relies on capable people such as you. As a gesture o' goodwill, I'm goin' to share with you a morsel of information."},{"name":"ROWENA","text":"There's this bloke named Gerolt. Makes his livin' in weapons and armor and whatnot. They say his skill is the finest in all the realm. Might be as it's gone to his head, though. Folks don't take to the man, if you get my meanin'. Oh, and he likes a drink, and all."},{"name":"ROWENA","text":"Bloody Byregot Himself in the forge, though. As a young lad, he was cast out on his ear by his master for the crime o' craftin' finer wares─and that while piss-drunk. Ever since, he's roamed here and there, earnin' his keep day to day."},{"name":"ROWENA","text":"Aye, I've known Gerolt ever since I landed in this business. Ain't seen him for a while, though. And the last time I <span class=\"emphasis\">did</span>, the ol' fool had tears in his eyes and snot drippin' from his nose. “Fallen on hard times,” he said. Asked for a bit o' coin to tide him over. Never paid me back, neither."},{"name":"ROWENA","text":"Couldn't say for sure where he is now. Seem to remember hearin' he was in the Black Shroud, puttin' up at Hyrstmill or some such place. You might do well to commission his work. He'll even reforge the relics of old if you make it worth his while, and there ain't no other in Eorzea as can do that."},{"name":"ROWENA","text":"If it's relics you care to know about, I've a promise o' payment what might catch your fancy. It don't look like much, but it'll get ol' Gerolt to fire up his forge. That much I promise."},{"name":"GEROLT","text":"Got business with me, have ye, adventurer? Then there'd better be coin or drink in it. Elsewise, bugger off back to wherever it was ye came from.<br>...Restoration work on an old weapon, ye say? Hah! What makes ye think I'd fire up the forge for a grimy old─"},{"name":"GEROLT","text":"Egads! Wh-Where in the seven hells did ye get that promise of payment!? I ain't got no coin, I tell ye! Nay, not a single bloody gil!"},{"name":"GEROLT","text":"Gods, jus' look at me...at how far I've fallen! Me, the greatest weaponsmith of our age, hammerin' out dints in kettles to pay off a tavern debt! &lt;sob&gt;"},{"name":"GEROLT","text":"Can ye even begin to grasp me humiliation? Can ye!? Bah, 'course ye can't! Why did I even bother askin'!?"},{"name":"GEROLT","text":"&lt;sigh&gt; All right, all right... I'll restore yer bloody weapon. Jus' get that godsdamned slip of paper out of me sight."},{"name":"SYSTEM","text":"The quest “A Relic Reborn” is now available from Gerolt."},{"name":"SYSTEM","text":"This quest can only be undertaken when playing as one of the following jobs: Paladin, warrior, monk, dragoon, bard, ninja, black mage, summoner, white mage, or scholar."},{"name":"SYSTEM","text":"In order to accept “A Relic Reborn,” you must first complete the level 50 quest for one of the previously mentioned jobs. Each job has its own “A Relic Reborn” quest, the completion of which will earn you the relic weapon for that job."},{"name":"SYSTEM","text":"Please note that you can only undertake one “A Relic Reborn” quest at any given time. If you wish to acquire a different relic weapon, you must either complete or abandon the current quest."}],"reward":{"gil":1659,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":1}],"quests":[70058]},"next":[66655,66656,66657,66658,66659,66660,66661,66662,66663,67115]},"partials":[{"type":"npc","id":"1005021","obj":{"i":1005021,"n":"Nedrick Ironheart","l":42,"q":5}},{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"66655","obj":{"i":66655,"n":"A Relic Reborn (Bravura)","g":149,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66656","obj":{"i":66656,"n":"A Relic Reborn (Curtana)","g":147,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66657","obj":{"i":66657,"n":"A Relic Reborn (Sphairai)","g":148,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66658","obj":{"i":66658,"n":"A Relic Reborn (Gae Bolg)","g":150,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66659","obj":{"i":66659,"n":"A Relic Reborn (Stardust Rod)","g":154,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66660","obj":{"i":66660,"n":"A Relic Reborn (Thyrus)","g":153,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66661","obj":{"i":66661,"n":"A Relic Reborn (Artemis Bow)","g":151,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66662","obj":{"i":66662,"n":"A Relic Reborn (The Veil of Wiyu)","g":155,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"66663","obj":{"i":66663,"n":"A Relic Reborn (Omnilex)","g":156,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67115","obj":{"i":67115,"n":"A Relic Reborn (Yoshimitsu)","g":152,"l":"North Shroud","s":11,"f":1}}]}