{"quest":{"name":"First Contact","location":"East Shroud","id":66251,"patch":2.0,"sort":117,"icon":100112,"eventIcon":71201,"issuer":1000540,"target":1000580,"involved":[1006188],"genre":1,"journal":["Rolfe Hawthorne has gift wrapped your offering in preparation for your journey into the sylphs' demesne.","Rolfe has kindly gift wrapped the milkroot for the sylphs, and wishes you luck in your envoy endeavors. Before you leave, however, he bids you speak with Amelain.","Amelain has entrusted you with a missive penned by the Elder Seedseer herself. Deliver it safely to Komuxio at Little Solace.","You have found Komuxio in Little Solace, but he seems unmoved by your words of greeting alone. Perform a sprightly /dance for him as a show of goodwill.","Pleased by your dance, Komuxio now seems more willing to hear you out. Present him with the milkroot and the letter to the elder as proof that you come in peace.","Despite accepting your gifts, Komuxio remains unconvinced as to your intentions. Is there no way to gain the sylph's trust and secure an audience with the elder of Little Solace?"],"objectives":["Speak with Amelain.","Speak with Komuxio at Little Solace.","Perform a /dance for Komuxio.","Deliver the milkroot and letter to Komuxio."],"dialogue":[{"name":"ROLFE","text":"I've taken the liberty of wrapping your milkroot well and good. This should keep it nice and fresh, not to mention spare you from that gods-awful stench."},{"name":"ROLFE","text":"The sylphs love the stuff, but me, I'd rather bury my nose in chocobo dung. I daresay the reek even rivals the breath of the morbol that put an end to my adventuring days!"},{"name":"ROLFE","text":"But I can tell you <span class=\"emphasis\">that</span> story another time. You've more important matters to attend to today, yes? The sylphs are an eccentric bunch, but I've shared their company enough to know they're kind at heart. They'll not shun one whose intentions are true."},{"name":"ROLFE","text":"May your parley be a fruitful one, friend. And do stop by on your return─there's a flagon of Fullflower mead with your name on it if you'd regale me with your adventuring tales."},{"name":"ROLFE","text":"Ah, and afore I forget, don't go traipsing off just yet. Amelain here would have a word with you. Travel in safety, friend, and do pass along my regards to the winged ones."},{"name":"AMELAIN","text":"It's good to see your knowledge of sylphic culture has matured. I see no reason to delay your mission any further."},{"name":"AMELAIN","text":"Upon your arrival at Little Solace, seek out a young sylph by the name of Komuxio. He has served as an intermediary between our peoples on many an occasion, and has the close ear of his tribe's elder."},{"name":"AMELAIN","text":"I see that Hawthorne has furnished you with some of that malodorous root the sylphs so adore. I have something of far greater import for you to deliver─a missive from the Elder Seedseer herself."},{"name":"AMELAIN","text":"To summarize the letter's contents in brief, it vouches for the integrity of our envoy─that would be you─and restates Gridania's desire to maintain a harmonious relationship with our long-standing friends of the forest."},{"name":"AMELAIN","text":"The war with the Ixal has taken a toll on our resources; we can ill afford to get mired in another conflict. I need not impress upon you any further the importance of this mission. May the Twelve see you return with good tidings."},{"name":"KOMUXIO","text":"Walking one is not familiar to this one. This one does not trust strange walking ones. Strange <span class=\"emphasis\"><span class=\"highlight\">dancing</span></span> ones might be a different story, but this one expects no such thing. Walking one should go home, and leave this one be."},{"name":"KOMUXIO","text":"Walking one would talk to this one? This one does not talk to rude ones. Walking one comes to the abode of these ones, walking one should pay proper respects."},{"name":"KOMUXIO","text":"This one would welcome walking one who moves like these ones. If walking one would talk to this one, this one will answer. This one is a busy one, so walking one should speak with quick tongue."},{"name":"KOMUXIO","text":"This walking one is foolish one. Walking one should go home before this one becomes angry."},{"name":"KOMUXIO","text":"Walking one would bring gift to this one? Walking one is most kind."},{"name":"KOMUXIO","text":"Walking one brings milkroot! Milkroot fills this one with great joy!"},{"name":"KOMUXIO","text":"This one gives thanks. Gives many, many thanks."},{"name":"KOMUXIO","text":"Walking one carries message for elder one? This one will deliver the message to elder one. Walking one should not worry."},{"name":"YDA","text":"Hello there! We're envoys from Gridania, and we're here to treat with your people!"},{"name":"PAPALYMO","text":"Aye. We come to pay our respects to your elder, and to learn from him more of your Lord Ramuh."},{"name":"KOMUXIO","text":"Who are <span class=\"emphasis\">these</span> ones? These walking ones come from <span class=\"emphasis\">Gridania</span>?"},{"name":"KOMUXIO","text":"Walking one became a dancing one and brought milkroot, but walking one tricks this one! This one does not like tricks!"},{"name":"KOMUXIO","text":"This one will speak no more. Elder one is busy. Walking ones should go home."},{"name":"YDA","text":"G-Go <span class=\"emphasis\">home</span>, you say!? But the sylphs of Little Solace have always welcomed Gridanian envoys with open wings!"},{"name":"PAPALYMO","text":"The letter carried by <span class=\"highlight\">Forename</span> here is an oath of peace penned by the Elder Seedseer herself! Still you would refuse us?"},{"name":"KOMUXIO","text":"This one's reasons are no business of walking ones. Elder one has no words for Gridania. Walking ones waste every one's time."},{"name":"YDA","text":"Well, I never! Turned away at the gates! Whatever did we do to deserve such a rude welcome? Was <span class=\"highlight\">Forename</span>'s jig insufficiently jiggy?"},{"name":"PAPALYMO","text":"I'm as baffled as you, but something tells me recent events have our erstwhile fluttery friends feeling uncommonly wary. It would seem we've no choice but to ask around and see how we might earn their trust."}],"reward":{"gil":1109,"items":[{"num":3,"id":4576,"one":1},{"num":3,"id":4577,"one":1},{"num":3,"id":4578,"one":1}],"xp":8400},"reqs":{"jobs":[{"lvl":21,"id":130}],"quests":[66246]},"next":[66253,69393]},"partials":[{"type":"npc","id":"1000540","obj":{"i":1000540,"n":"Rolfe Hawthorne","l":55,"q":4}},{"type":"npc","id":"1000580","obj":{"i":1000580,"n":"Komuxio","l":55,"q":10}},{"type":"npc","id":"1006188","obj":{"i":1006188,"n":"Amelain","l":55,"q":3}},{"type":"item","id":"4576","obj":{"i":4576,"n":"Weak Silencing Potion","l":20,"c":20684,"t":44}},{"type":"item","id":"4577","obj":{"i":4577,"n":"Weak Sleeping Potion","l":20,"c":20683,"t":44}},{"type":"item","id":"4578","obj":{"i":4578,"n":"Weak Paralyzing Potion","l":20,"c":20682,"t":44}},{"type":"quest","id":"66246","obj":{"i":66246,"n":"First Impressions","g":1,"l":"East Shroud","s":116}},{"type":"quest","id":"66253","obj":{"i":66253,"n":"Dance Dance Diplomacy","g":0,"l":"East Shroud","s":118}},{"type":"quest","id":"69393","obj":{"i":69393,"n":"Dance Dance Diplomacy","g":1,"l":"East Shroud","s":118}}]}