{"quest":{"name":"Dance Dance Diplomacy","location":"East Shroud","id":66253,"patch":2.0,"sort":118,"eventIcon":71201,"target":1006674,"involved":[1000277,1000437,1000563,1000576,1000578,1000584,1000585,1000587],"genre":0,"journal":["Yda has a notion of how one might earn the sylphs' trust.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Yda in Little Solace.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","That was certainly exhausting. Return to Yda and tell her that you have danced as you have never danced before.","Your dancing has won many a smile, but have you truly succeeded in winning the hearts of the sylphs of Little Solace? This remains to be seen."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Yda in Little Solace.</span>"],"dialogue":[{"name":"YDA","text":"Say, <span class=\"highlight\">Forename</span>. Are you in the mood for dancing?"},{"name":"YDA","text":"That's right: dancing! You went through all that trouble to learn the sylphs' traditional greeting, but you've greeted hardly any of them."},{"name":"YDA","text":"While you're at it, why not dance for the Gridanians around here, as well? Why, if I were a sylph, I'd be beside myself with delight to see an adventurer sharing my culture with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own kind! Me? Of course I'd be happy to join─ow, ow! There go those bloody leg cramps of mine acting up again!"},{"name":"AMEEXIA","text":"This one is weaving cloth. Walking one would know more? This one does not trust walking ones who do not show respect."},{"name":"AMEEXIA","text":"Walking one would be a friend to these ones? This one is overjoyed! But this one keeps the ways of weaving a secret. Even if walking one learned the secret, walking one could not weave in the same way."},{"name":"AMEEXIA","text":"Walking one is strange. This one has nothing to teach to strange ones."},{"name":"ZACHEUS","text":"Looking to befriend the sylphs, are you? I've spent my fair share of time in these parts. Go ahead, greet me as you would a sylph─I'll let you know if your moves are up to scratch."},{"name":"ZACHEUS","text":"That's some fine dancing, friend. Why, if you were half as tall and twice as green, I might have mistaken you for a sylph myself! Anyroad, the sylphs are a peaceful folk. Approach them with an open mind and heart, and they'll open up to you in turn."},{"name":"ZACHEUS","text":"Gods help me! Are you supposed to be a sylph, or a lemur in heat? You'd best work on your greeting skills, lest you frighten the poor sylphs clear out of the Shroud."},{"name":"KNOLEXIA","text":"Walking one's belly is rumbling? This one is not making a meal! This one is boiling bark and flower seeds to dye thread. Color must be jolly, and so must greet-making."},{"name":"KNOLEXIA","text":"Oooh, walking one knows jolly dance! Jolly dance fills this one with good cheer! Let these two be friends!"},{"name":"KNOLEXIA","text":"Walking one makes strange motions. Strange motions make this one ill at ease. Go away! Shoo, shoo!"},{"name":"PELIXIA","text":"This one cannot follow walking one's words. This one begins to feel...sleepy... Does walking one not know proper greeting?"},{"name":"PELIXIA","text":"Walking one has sprightly steps! This one is amused! Tee hee! But this one is still...sleepy... Zzzzzzzzzzzz..."},{"name":"PELIXIA","text":"This one knows not what walking one means. This one...tries to...stay...awake...but... Zzzzzzzzzzzz..."},{"name":"IMEDIA","text":"So you're greeting all in Little Solace in traditional sylphic fashion? A lovely gesture, I must agree! Would you be so kind as to show me? Sylphic greetings never fail to bring a smile to my face."},{"name":"IMEDIA","text":"How charming! You'll fit right in here in Little Solace. Be forewarned, though: such pleasantries will get you nowhere with the sylphs who dwell in the homeland."},{"name":"IMEDIA","text":"I'm not entirely certain what that was, but it's more likely to frighten the sylphs than befriend them. You'd best brush up on your sylphic greetings if you intend to accomplish anything here."},{"name":"DELLEXIA","text":"What does walking one want with this one? Elder one warned this one not to get too friendly with walking ones..."},{"name":"DELLEXIA","text":"Ah, walking one is a friend to these ones! Friendly like gracious elder one of forest city. Knows how to dance into these ones' hearts!"},{"name":"DELLEXIA","text":"Is that how walking ones greet other walking ones? If walking one wants to find other walking ones, maybe walking one should go home."},{"name":"MARINTERRE","text":"In these times, Gridania can never have too many friends. As such, your enthusiasm in befriending the sylphs is admirable indeed. Very well, then, let's see how you intend to do it."},{"name":"MARINTERRE","text":"Magnificent! You'd make an excellent ambassador to Little Solace, friend. Mind you, not all sylphs are so welcoming of outsiders. The woodland sprites would gut you before you got your feet off the ground."},{"name":"MARINTERRE","text":"Ye gads, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Thank the Twelve I'm not a sylph, or we'd have a diplomatic disaster on our hands. Try that again, will you?"},{"name":"NATHAXIO","text":"Nasty ones live beyond here. Is walking one nasty one, or happy one?"},{"name":"NATHAXIO","text":"Ah, this walking one is a dancing one! This one is always happy to see dancing ones. Tee hee hee! "},{"name":"NATHAXIO","text":"This walking one does scary thing. This walking one is nasty one, yes? Go away! Go away, nasty walking one!"},{"name":"YDA","text":"<span class=\"highlight\">Forename</span>! Would you like to hear the good news, or the better news? The good news is that your lovely dancing has brought smiles and high spirits to all of Little Solace! The better news? Why, I've thoroughly recovered from those accursed leg cramps! Onward to our next adventure!"}],"reward":{"xp":8400},"reqs":{"jobs":[{"lvl":21,"id":130}],"quests":[66251]},"next":[66254]},"partials":[{"type":"npc","id":"1006674","obj":{"i":1006674,"n":"Yda","l":55,"q":2}},{"type":"npc","id":"1000277","obj":{"i":1000277,"n":"Nathaxio","l":55,"q":3}},{"type":"npc","id":"1000437","obj":{"i":1000437,"n":"Zacheus","l":55,"q":2}},{"type":"npc","id":"1000563","obj":{"i":1000563,"n":"Ameexia","l":55,"q":3}},{"type":"npc","id":"1000576","obj":{"i":1000576,"n":"Knolexia","l":55,"q":3}},{"type":"npc","id":"1000578","obj":{"i":1000578,"n":"Marinterre","l":55,"q":1}},{"type":"npc","id":"1000584","obj":{"i":1000584,"n":"Imedia","l":55,"q":2}},{"type":"npc","id":"1000585","obj":{"i":1000585,"n":"Pelixia","l":55,"q":2}},{"type":"npc","id":"1000587","obj":{"i":1000587,"n":"Dellexia","l":55,"q":4}},{"type":"quest","id":"66251","obj":{"i":66251,"n":"First Contact","g":1,"l":"East Shroud","s":117}},{"type":"quest","id":"66254","obj":{"i":66254,"n":"Forest Friend","g":0,"l":"East Shroud","s":119}}]}