{"quest":{"name":"Forest Friend","location":"East Shroud","id":66254,"patch":2.0,"sort":119,"eventIcon":71201,"target":1000580,"involved":[1000584],"genre":0,"journal":["Papalymo has a notion of how you might endear yourself to the sylphs of Little Solace.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Papalymo in Little Solace.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","As Imedia would tell it, the sylphs live in constant fear of attacks by ill-tempered forest creatures. She bids you slay five ziz gorlins and five gall gnats, that the residents of Little Solace might rest easy, and suggests that procuring five brownie brushes in the process would also go far to curry the sylphs' favor.","You have dispatched the invasive fauna, and obtained brownie brushes for the sylphs. Report to Komuxio of Little Solace and impress upon him your good intentions.","Komuxio expresses gratitude for your efforts on behalf of Little Solace. It would seem the sylphs have begun to warm to your presence, albeit gradually."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Papalymo in Little Solace.</span>"],"dialogue":[{"name":"PAPALYMO","text":"<span class=\"highlight\">Forename</span>. As an adventurer, you're no stranger to helping distressed folk, I'd wager."},{"name":"PAPALYMO","text":"Tales of good deeds are quick to spread. The adventurer who comes to the aid of the local populace can go from stranger to hero o'ernight."},{"name":"PAPALYMO","text":"No doubt you see what I'm getting at. The sylphs who make their home in Little Solace do so having been driven from their woodland home. Surely, they have their fair share of troubles."},{"name":"PAPALYMO","text":"Seek out troubled sylphs, and see what might be done to ease their worries. A sound plan, would you not say?"},{"name":"PAPALYMO","text":"That said, the sylphs are not known to share their worries with outsiders. You would be better off inquiring with Hearer Imedia; of the Gridanians who reside here, she is most like to be privy to the sylphs' troubles."},{"name":"IMEDIA","text":"Ah, you've returned. Praise be to the elementals─I cannot express how happy I am to see an adventurer with a truly gentle heart. The sylphs of Little Solace are sorely in need of aid. Pray hear me out."},{"name":"IMEDIA","text":"Being a temporary settlement, Little Solace wants for amenities, not least a stout set of defenses. Consequently, beasts from malms around are free to wander in and terrorize the hapless residents."},{"name":"IMEDIA","text":"If you could put down the ziz gorlins and gall gnats that roam these parts─five of each should suffice─the sylphs and I would be eternally grateful."},{"name":"IMEDIA","text":"Furthermore, perhaps you could gather five brownie brushes as well. They play an important role in sylphic culture─I do not claim to know the details─and what with such feral beasts prowling the forests, they are not easily come by."},{"name":"IMEDIA","text":"When you are done with the deeds, seek out Komuxio. He is slow to warm to outsiders, but your good intentions will not be lost on him. My own experience speaks to this."},{"name":"KOMUXIO","text":"Dancing one is still here? Dancing one can dance all <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>─this one's trust is not so easily earned."},{"name":"KOMUXIO","text":"Hm? Dancing one brings brownie brushes for this one? This one can dye thread once more. This one is pleased."},{"name":"KOMUXIO","text":"Dancing one kills bitey, buzzy ones? This one hates, hates, hates bitey, buzzy ones! Dancing one is kind... Too kind."},{"name":"KOMUXIO","text":"Many walking ones come to these ones' abode, but few are friendly like dancing one. Perhaps this one was wrong not to trust dancing one, after all."}],"reward":{"xp":8400},"reqs":{"jobs":[{"lvl":21,"id":130}],"quests":[66253]}},"partials":[{"type":"npc","id":"1000580","obj":{"i":1000580,"n":"Komuxio","l":55,"q":10}},{"type":"npc","id":"1000584","obj":{"i":1000584,"n":"Imedia","l":55,"q":2}},{"type":"quest","id":"66253","obj":{"i":66253,"n":"Dance Dance Diplomacy","g":0,"l":"East Shroud","s":118}}]}