{"quest":{"name":"Potsherds for Posterity","location":"South Shroud","id":66267,"patch":2.0,"sort":220,"eventIcon":71221,"issuer":1000439,"target":1000439,"genre":92,"journal":["Rolandaix seeks a helping hand in his examination of Issom–Har.","Rolandaix is surveying the ruins of Gelmorra, but finds that he has overestimated the amount of ground he can cover alone. Aid the researcher in his work by scouring the area around Issom–Har for domestic artifacts.","You have uncovered a number of domestic relics. Present the objects to Rolandaix for examination.","Rolandaix reveals that the items you uncovered were pieces of Gelmorran tableware, confirming his theory that the ruins are indeed what remains of Gelmorra's residential district. He goes on to express his fervent hope that the remnants of the city can one day be reestablished as a settlement for the displaced Duskwight Elezen."],"objectives":["Scour the area for possible relics.","Deliver the muddy potsherds to Rolandaix."],"dialogue":[{"name":"ROLANDAIX","text":"Ah, you are an adventurer, are you not? Tell me, have you any experience in the field of relic hunting? I am currently attempting to catalog all of the artifacts in this area, you see, but am finding the task rather more time-consuming than I had initially anticipated..."},{"name":"ROLANDAIX","text":"I am all but convinced that we stand in what was once Gelmorra's residential district. Alas, I have yet to recover a sufficiency of domestic objects to confirm my theory. Should you happen upon any such items while wandering the area, I would be most grateful if you'd bring them to me."},{"name":"ROLANDAIX","text":"Back so soon? Are you quite certain you exercised the appropriate amount of care and delicacy in your search? These artifacts are hundreds of years─oh, never mind. Show me what you found."},{"name":"ROLANDAIX","text":"<span class=\"emphasis\">Yes</span>...these are most certainly examples of Gelmorran tableware. Judging by the shape and ornamentation, they appear to be cups of the kind once used to serve herbal infusions...or possibly vegetable broth. Perfect!"},{"name":"ROLANDAIX","text":"My work here is far from done, but this discovery brings me one tantalizing step closer to realizing my dream: the restoration of these ruins, and their reestablishment as a settlement for the Duskwight Elezen."},{"name":"ROLANDAIX","text":"Gridanians have long perceived my people as outcasts and brigands, yet if we Duskwights can return a measure of prosperity to this fallen city, we would no longer need to resort to common theft or banditry in order to make ends meet. Imagine it!<br>...But I am rambling. Thank you for your help."}],"reward":{"items":[{"id":7621},{"id":3800,"one":1},{"num":3,"id":4594,"one":1},{"num":3,"id":4595,"one":1},{"num":3,"id":4596,"one":1},{"num":2,"id":5824,"one":1}],"xp":4340},"reqs":{"jobs":[{"lvl":22,"id":1}],"quests":[66265]}},"partials":[{"type":"npc","id":"1000439","obj":{"i":1000439,"n":"Rolandaix","l":56,"q":2}},{"type":"item","id":"7621","obj":{"i":7621,"n":"Glamour Dispeller","l":30,"c":26228,"t":60,"p":500}},{"type":"item","id":"3800","obj":{"i":3800,"n":"Cotton Dress Shoes","l":22,"c":46194,"t":38,"p":783}},{"type":"item","id":"4594","obj":{"i":4594,"n":"Potion of Strength","l":20,"c":20665,"t":44,"p":108}},{"type":"item","id":"4595","obj":{"i":4595,"n":"Potion of Dexterity","l":20,"c":20667,"t":44,"p":108}},{"type":"item","id":"4596","obj":{"i":4596,"n":"Potion of Vitality","l":20,"c":20666,"t":44,"p":108}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66265","obj":{"i":66265,"n":"No Guts, No Glory","g":92,"l":"South Shroud","s":220}}]}