{"quest":{"name":"Enemy Mine","location":"South Shroud","id":66275,"patch":2.0,"sort":230,"eventIcon":71221,"issuer":1000598,"target":1000598,"involved":[1006197,1006198],"genre":92,"journal":["Auphiliot is worried about Buscarron in light of recent events.","Buscarron is vexed by the appearance of Garleans in the Twelveswood. To ease his mind, Auphiliot would have you speak with a Coeurlclaw poacher and a flyer for the Redbelly Wasps, and ask that they keep an eye out for any Garleans they might spy.","You have asked for the vigilant eyes of both poachers and Wasps alike. Take word of your deeds back to Auphiliot at Buscarron's Druthers.","It turns out that Auphiliot had more in mind than assuring Buscarron that the Garleans are being kept in check. He also had you meet the poacher and the flyer so that they would know who you are, and that you do not fear them. He hopes such meetings will serve to make you ever more useful to the proprietor and clientele of Buscarron's Druthers."],"objectives":["Speak with a Coeurlclaw poacher.","Speak with a flyer for the Redbelly Wasps.","Report to Auphiliot."],"dialogue":[{"name":"AUPHILIOT","text":"Yer word o' Garleans in the wood's got ol' Buscarron beside himself with worry."},{"name":"AUPHILIOT","text":"So, I came up with a bit of an idea, I did. Might be ye heard, there's a place near to here where poachers an' all other manner o' scum gather."},{"name":"AUPHILIOT","text":"They're no friends o' Gridania, to be sure, but they've even less love for Garlemald. So I got to thinkin', why not ask 'em to keep an eye on any Garleans in the wood? Enemy o' my enemy, an' all that."},{"name":"MITSURYO","text":"Buscarron is worried by Garleans in the wood, is he? Then the situation must be dire. Very well, I will see to it any imperials are watched with a close eye."},{"name":"MITSURYO","text":"By the by, you are the [Race] making a name for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>self of late, are you not? It is good to finally put a face to the name."},{"name":"READBERRY","text":"Garleans in the wood? Buscarron would not lie of such things. Nor, I think, would you. Worry not─the Wasps are watching."},{"name":"READBERRY","text":"Tell me, are you the [Job] rumors speak of? Aye, I suspected as much."},{"name":"READBERRY","text":"Many Wasps are looking forward to the day they cross paths with you─myself included. Until then, friend."},{"name":"AUPHILIOT","text":"So, how's the hospitality of our enemies? Left a sour taste in yer mouth, did it? Pity, that."},{"name":"AUPHILIOT","text":"They've no respect for land or law, but they're not without their uses. Now they know who ye are, an' that ye ain't scared of 'em."},{"name":"AUPHILIOT","text":"Yer name's gettin' known o' late, for better or worse. Lotta folk takin' an interest in ye."},{"name":"AUPHILIOT","text":"Thought it best if ye went lookin' for 'em before they came lookin' for <span class=\"emphasis\">you</span>."}],"reward":{"items":[{"num":3,"id":5801},{"id":3574,"one":1},{"id":3570,"one":1},{"id":3572,"one":1},{"num":2,"id":5824,"one":1}],"xp":4480},"reqs":{"jobs":[{"lvl":23,"id":1}],"quests":[66274]}},"partials":[{"type":"npc","id":"1000598","obj":{"i":1000598,"n":"Auphiliot","l":56,"q":4}},{"type":"npc","id":"1006197","obj":{"i":1006197,"n":"Coeurlclaw Poacher","l":56,"q":1}},{"type":"npc","id":"1006198","obj":{"i":1006198,"n":"Redbelly Flyer","l":56,"q":1}},{"type":"item","id":"5801","obj":{"i":5801,"n":"Royal Blue Dye","l":30,"c":22804,"t":55,"p":216}},{"type":"item","id":"3574","obj":{"i":3574,"n":"Iron Scale Fingers","l":23,"c":48377,"t":37,"p":1182}},{"type":"item","id":"3570","obj":{"i":3570,"n":"Cotton Bracers","l":23,"c":44051,"t":37,"p":985}},{"type":"item","id":"3572","obj":{"i":3572,"n":"Goatskin Lightmitts","l":23,"c":44068,"t":37,"p":985}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66274","obj":{"i":66274,"n":"Sylphish Concerns","g":1,"l":"South Shroud","s":127}}]}