{"quest":{"name":"A Simple Gift","location":"South Shroud","id":66279,"patch":2.0,"sort":130,"eventIcon":71201,"issuer":1000590,"target":1000576,"genre":1,"journal":["Buscarron has something he wants delivered to the sylphs.","Buscarron would like to send a peace offering to the sylphs of Little Solace in hopes of reinforcing the current spirit of cooperation. With this thought in mind, see Buscarron's phial of Azeyma rose oil to Knolexia in Little Solace.","Buscarron's thoughtful gift has moved Knolexia. With any luck, this act and similar future gestures will serve to further strengthen relations between Gridanians and sylphs."],"objectives":["Deliver the Azeyma rose oil to Knolexia at Little Solace."],"dialogue":[{"name":"BUSCARRON","text":"Say, friend, there's something I'd like to ask you to see delivered to the sylphs of Little Solace─this Azeyma rose oil."},{"name":"BUSCARRON","text":"It's a gift to celebrate the safe return of their tribe's elder─and a token of Gridania's desire to unite."},{"name":"BUSCARRON","text":"The wood is not what it once was. The Calamity changed the elementals─weakened them. Until their strength is returned, we must lend them ours to keep the wood safe. But ours alone will not be enough. We must have the strength of the sylphs, as well."},{"name":"BUSCARRON","text":"Only by working together and fighting together will we survive together─and the Twelveswood with us. The gift I ask you to bear is a symbol of the hope that both Gridanian and sylph alike will live to see the light beyond this darkness."},{"name":"KNOLEXIA","text":"A gift from walking one Buscarron? A gift for these ones?"},{"name":"KNOLEXIA","text":"Such a lovely scent! This one has never smelled anything like this before!"},{"name":"KNOLEXIA","text":"Walking one Buscarron and adventuring one are very kind. Know that this one is deeply grateful."},{"name":"KNOLEXIA","text":"Many walking ones are scary. Many walking ones utter many lies and much deception. But this one is moved. Let all these ones be friends forever!"}],"reward":{"gil":1201,"items":[{"id":3804,"one":1},{"id":3802,"one":1},{"id":3806,"one":1},{"id":5825,"one":1}],"xp":9240},"reqs":{"jobs":[{"lvl":24,"id":130}],"quests":[66050]},"next":[66280]},"partials":[{"type":"npc","id":"1000590","obj":{"i":1000590,"n":"Buscarron","l":56,"q":14,"t":"Alehouse Proprietor"}},{"type":"npc","id":"1000576","obj":{"i":1000576,"n":"Knolexia","l":55,"q":3}},{"type":"item","id":"3804","obj":{"i":3804,"n":"Iron Scale Greaves","l":23,"c":46869,"t":38,"p":1351}},{"type":"item","id":"3802","obj":{"i":3802,"n":"Iron-plated Jackboots","l":23,"c":46833,"t":38,"p":1126}},{"type":"item","id":"3806","obj":{"i":3806,"n":"Goatskin Duckbills","l":24,"c":46117,"t":38,"p":1031}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66050","obj":{"i":66050,"n":"Into the Beast's Maw","g":1,"l":"South Shroud","s":129}},{"type":"quest","id":"66280","obj":{"i":66280,"n":"Believe in Your Sylph","g":1,"l":"East Shroud","s":131}}]}