{"quest":{"name":"The Blood Price","location":"East Shroud","id":66281,"patch":2.0,"sort":240,"eventIcon":71221,"issuer":1000576,"target":1000576,"genre":92,"journal":["Knolexia wishes to show you her immense gratitude.","Knolexia wishes to present you with a gift, but first asks that you bring her three bottles of djigga blood. Do so by using the bottles she provided you with on weakened swollen djiggas.","You have procured the three bottles of djigga blood Knolexia requested. Deliver them to her at Little Solace.","Using the djigga blood you have provided, Knolexia has created for you an enchanted garment to serve as a token of her appreciation. However, while you appreciate the gesture, it may take some time to get used to the idea of wearing vilekin blood as a good-luck charm."],"objectives":["Use the empty blood bottles on weakened djiggas.","Deliver the djigga blood to Knolexia.","Obtain three vials of fresh blood from djiggas.<br>(Use the empty vial on a djigga with only 25% or less HP remaining.)"],"dialogue":[{"name":"KNOLEXIA","text":"This one wishes to thank the adventuring one. Adventuring one saved the elder one."},{"name":"KNOLEXIA","text":"But this one must ask a favor first. Will adventuring one bring three bottles of fresh blood? Is morbid favor, this one knows. But must have fresh blood from vile ones known as djiggas."},{"name":"KNOLEXIA","text":"Here, adventuring one take blood bottles. Use on almost dead vile ones to take fresh blood. "},{"name":"KNOLEXIA","text":"Did adventuring one bring blood from vile ones?"},{"name":"KNOLEXIA","text":"This goes here, and that there... Then stitch like this... Then put that together..."},{"name":"KNOLEXIA","text":"Done! This one has made a garment for adventuring one."},{"name":"KNOLEXIA","text":"Is enchanted garment. Will protect adventuring one from scary ones."},{"name":"KNOLEXIA","text":"And is token of this one's thanks. These ones owe adventuring one many, many thanks."}],"reward":{"gil":1399,"items":[{"id":3062}],"xp":4620},"reqs":{"jobs":[{"lvl":24,"id":1}],"quests":[66050]}},"partials":[{"type":"npc","id":"1000576","obj":{"i":1000576,"n":"Knolexia","l":55,"q":3}},{"type":"item","id":"3062","obj":{"i":3062,"n":"Cotton Robe","l":24,"c":42053,"t":35,"p":1257}},{"type":"quest","id":"66050","obj":{"i":66050,"n":"Into the Beast's Maw","g":1,"l":"South Shroud","s":129}}]}