{"quest":{"name":"Shadow of Darkness","location":"The Waking Sands","id":66283,"patch":2.0,"sort":133,"icon":100118,"eventIcon":71201,"issuer":1006688,"target":1006196,"involved":[1004576],"genre":1,"journal":["Minfilia would have you investigate the mysterious Lahabrea.","The Immortal Flames reportedly have information regarding Lahabrea. Make your way to the Hall of Flames in Ul'dah, and speak with Commander Swift.","According to Commander Swift, a Brass Blade stationed at Highbridge has reported seeing a suspicious masked man, but the sentry has since died in the line of duty. Even so, you may still be able to learn something of use from the people in the area. Take yourself to Highbridge in eastern Thanalan, and speak with a merchant named Hihibaru.","Hihibaru hints at knowing of the masked man, but his mannerisms do not instill you with much confidence. Nonetheless, your investigation must begin somewhere..."],"objectives":["Speak with Swift at the Hall of Flames.","Speak with Hihibaru at Highbridge."],"dialogue":[{"name":"MINFILIA","text":"I am afraid there is no rest for the weary, <span class=\"highlight\">Forename</span>. We must delve further into the motivations of the masked man─the Ascian known as Lahabrea. This is an ideal moment to do so, while our hands are not bound dealing with another primal."},{"name":"MINFILIA","text":"At present, we know little and less about the Ascians─only that destruction follows in their wake."},{"name":"MINFILIA","text":"I should not be surprised if these beings are behind the chaos that racks the realm. If my fears prove to be reality, we must do all in our power to stop them."},{"name":"MINFILIA","text":"Earlier, I sent word to each Grand Company to solicit cooperation. The Immortal Flames responded to the effect that they have information on a potential sighting."},{"name":"MINFILIA","text":"This is intelligence that we can ill afford to ignore. Go speak with Flame Commander Swift at the Hall of Flames in Ul'dah to inquire further. How you go about the investigation thereafter, I leave wholly to your discretion."},{"name":"MINFILIA","text":"But whatever you do, never forget that we are dealing with the unknown. You cannot take too many precautions. Be safe, <span class=\"highlight\">Forename</span>."},{"name":"SWIFT","text":"The masked man? Ah, you are come on behalf of the Scions, of course. Yes, as we've already relayed to Lady Minfilia, there has been a sighting of this rogue near about eastern Thanalan."},{"name":"SWIFT","text":"A Brass Blade stationed at Highbridge described him in detail when he alerted us to suspicious activity. I would point you to the witness, but I'm afraid he died not two days ago, slain by a marauding horde of Qiqirn. Fate can be a cruel mistress."},{"name":"SWIFT","text":"But do not be too quick to despair. Being situated on a trade route, Highbridge sees its fair share of travelers. Folk are always coming and going, and some among them may well have caught a glimpse of your target."},{"name":"SWIFT","text":"You could do worse than to speak with a merchant named Hihibaru. The fellow's always starved for customers, and he'd no doubt welcome your attention, whether or not you have coin or the mind to spend it."},{"name":"HIHIBARU","text":"Welcome to Highbridge, adventurer! Whatever you seek, I, Hihibaru, can provide it.<br>...Probably!"},{"name":"HIHIBARU","text":"You're after a masked man? Hmmm, I'm not sure I have one of those in stock..."},{"name":"HIHIBARU","text":"Ohhh, you're <span class=\"emphasis\">after</span> a masked man! Why didn't you say so sooner? Such an individual <span class=\"emphasis\">might</span> have featured in one of the many rumors I've heard. If you linger awhile, mayhap you'll learn a thing or two, eh?"}],"reward":{"gil":1201,"xp":9240},"reqs":{"jobs":[{"lvl":24,"id":130}],"quests":[66282]},"next":[66284]},"partials":[{"type":"npc","id":"1006688","obj":{"i":1006688,"n":"Minfilia","l":356,"q":8}},{"type":"npc","id":"1006196","obj":{"i":1006196,"n":"Hihibaru","l":44,"q":7}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"quest","id":"66282","obj":{"i":66282,"n":"Back from the Wood","g":1,"l":"Gridania","s":132}},{"type":"quest","id":"66284","obj":{"i":66284,"n":"Highbridge Times","g":1,"l":"Eastern Thanalan","s":134}}]}