{"quest":{"name":"Back from the Wood","location":"Gridania","id":66282,"patch":2.0,"sort":132,"icon":100117,"eventIcon":71201,"issuer":1000168,"target":1006688,"involved":[1003785],"genre":1,"journal":["Commander Heuloix appears to have more to say.","Mere moments after Commander Heuloix bids you send his regards to Minfilia, she contacts you via linkpearl. The Antecedent expresses relief that the matter of Ramuh has been laid to rest, and requests your presence at the Waking Sands.","After giving you a characteristically warm welcome, Tataru informs you that Minfilia is waiting in the solar. Enter at your leisure.","Minfilia's exposition is interrupted by a frightened yelp from without. Rushing to the source of the commotion, you find yourself face-to-face with the sylph Noraxia, who has come to offer her aid to the Scions. Safe in the knowledge that there is no cause for alarm, resume your conversation with Minfilia.","Though Minfilia is heartened by the continued growth of her “family” of Scions, she cannot help but wonder at the appearance of the Ascians. What might their presence portend?"],"objectives":["Speak with Tataru.","Enter the Waking Sands.","Speak with Minfilia."],"dialogue":[{"name":"VORSAILE","text":"The sylphic folk have long been friends to Gridania. The mere thought of being at war with them pained the Elder Seedseer to no end."},{"name":"VORSAILE","text":"But owing to your efforts, she will be able to rest easier. Being the benevolent soul that she is, my lady will surely try to find a way to reverse the tempering process."},{"name":"VORSAILE","text":"Once again, I thank you. Had the Scions of the Seventh Dawn not offered to mediate between our peoples, suspicion and doubt may well have led us into needless conflict. Pray pass on my regards to Lady Minfilia."},{"name":"MINFILIA","text":"...Hello? Hello, <span class=\"highlight\">Forename</span>? Can you hear me? It is I, Minfilia."},{"name":"MINFILIA","text":"Yda and Papalymo returned some little while ago. And they wasted no time in regaling me with the tale of your exploits."},{"name":"MINFILIA","text":"Thanks in large part to you, the name of one primal may be struck from our list of enemies, and the Gridanians may turn their attention to more pressing matters. Well done!"},{"name":"MINFILIA","text":"Yet the end of one tale is but the start of another. Pray return to the Waking Sands at your earliest convenience. I would apprise you of the present situation in person."},{"name":"TATARU","text":"Well, if it isn't my favorite adventurer! Welcome back, <span class=\"highlight\">Forename</span>!"},{"name":"TATARU","text":"Lady Minfilia awaits you within the solar. Please enter at your leisure."},{"name":"ALPHINAUD","text":"I am given to understand that the matter of Ramuh has finally been resolved."},{"name":"MINFILIA","text":"Hm. I fear “resolved” bespeaks a permanence we cannot rightly claim. Yet I am well satisfied that the Lord of Levin will not trouble us in the foreseeable future."},{"name":"ALPHINAUD","text":"Your satisfaction is assurance enough for me."},{"name":"MINFILIA","text":"How fares the investigation?"},{"name":"ALPHINAUD","text":"Well enough. Thancred is sparing no effort."},{"name":"ALPHINAUD","text":"They are many and one, just as you suspected. Their purpose, however, eludes us still."},{"name":"MINFILIA","text":"I see."},{"name":"MINFILIA","text":"Ah, I have been meaning to ask, but is Alisaie quite well? I feel as if I have scarcely seen her in recent days."},{"name":"ALPHINAUD","text":"Oh, you haven't─and nor have I, alas. Alisaie has chosen to walk her own path─stubborn girl─but you may be assured that our destination remains the same."},{"name":"ALPHINAUD","text":"And on that note, I take my leave of you. I trust the Baldesion report will serve you well."},{"name":"MINFILIA","text":"I take it we can proceed as discussed?"},{"name":"ALPHINAUD","text":"Why do you ask? You scarce need <span class=\"emphasis\">my</span> permission to act."},{"name":"MINFILIA","text":"It is good to see you again, <span class=\"highlight\">Forename</span>!"},{"name":"MINFILIA","text":"I have been looking forward to congratulating you on your triumph in the Twelveswood. Owing to your efforts, conflict has been averted. Truly, you have done the Scions proud."},{"name":"PAPALYMO","text":"With that, we can strike Ramuh from the list."},{"name":"YDA","text":"So who's next? The Sahagin and Leviathan?"},{"name":"PAPALYMO","text":"The Lord of the Whorl has not answered his minions' call of late, nor is he expected to do so in the near future."},{"name":"PAPALYMO","text":"While the Sahagin remain as aggressive as ever, they lack the quantity of crystals required to call forth their god. As with the sylphs, we can leave them to their own devices...for a time, at least."},{"name":"YSHTOLA","text":"“For a time” bears repeating. We can ill afford to fall complacent."},{"name":"PAPALYMO","text":"It is as Y'shtola says. Unless we know the minds of the beast tribes, we cannot predict with any certainty when next a primal will return to plague the land."},{"name":"PAPALYMO","text":"This being the case, we must proceed with as much haste as prudence allows."},{"name":"YDA","text":"Any word on Titan?"},{"name":"YSHTOLA","text":"The Maelstrom keeps the kobolds under constant observation."},{"name":"YSHTOLA","text":"We shall hear from them ere long, you may depend upon it."},{"name":"PAPALYMO","text":"Indeed. So, then─of all the known primals that have been active in recent times, we are left with..."},{"name":"YDA","text":"Gridania! Wait, I meant <span class=\"emphasis\">Garuda</span>─who is the primal of the Ixal who <span class=\"emphasis\">live</span> near Gridania. Yes, that's what I meant."},{"name":"MINFILIA","text":"So many malms to cover... Would that there were a more efficient way to conduct our surveys."},{"name":"MINFILIA","text":"Were <span class=\"emphasis\">he</span> still with us, we should not long have wanted for a more practicable solution..."},{"name":"BIGGS","text":"She's not wrong there... &lt;sigh&gt; Where in the world <span class=\"emphasis\">are</span> you, Chief?"},{"name":"MINFILIA","text":"...But one sure step at a time!"},{"name":"MINFILIA","text":"Henceforth, the Order of the Twin Adder will handle all matters pertaining to the sylphs, under the sage guidance of the Seedseers."},{"name":"MINFILIA","text":"I bid you all enjoy a moment's respite. You have earned it!"},{"name":"MINFILIA","text":"Is there something else, <span class=\"highlight\">Forename</span>?"},{"name":"MINFILIA","text":"Beg pardon? A man named Lahabrea, sporting a red mask and robed in black...? Twelve preserve..."},{"name":"MINFILIA","text":"Prior to the Calamity, the Ascians took great pains to remain hidden... Why would they choose to cast off their veil of secrecy now? Gods, this bodes ill..."},{"name":"MINFILIA","text":"We must take advantage of the present lull in primal hostilities and investigate this Lahabrea─learn all we can of him and his designs. I dread to thi─"},{"name":"TATARU","text":"EEEEEEK!"},{"name":"MINFILIA","text":"Tataru!"},{"name":"MINFILIA","text":"A sylph...in Thanalan?"},{"name":"NORAXIA","text":"At long last, this one finds walking one <span class=\"highlight\">Forename</span>!"},{"name":"NORAXIA","text":"This one is most dependable of these ones! Is sent by elder one Frixio to help walking ones!"},{"name":"NORAXIA","text":"This one is called Noraxia. This one comes as a friend. Let these ones be friends!"},{"name":"TATARU","text":"P-Pleasure to meet you...Noraxia."},{"name":"MINFILIA","text":"Yes, Tataru is as ready to express her fright as she is to express...everything else! Not all of us are forged of the same steel as you, I'm afraid."},{"name":"MINFILIA","text":"But it takes all kinds to make a family, and it pleases me to no end to see ours continue to grow. One by one, the people of Eorzea are beginning to unite, <span class=\"highlight\">Forename</span>, drawn to the hope that shines within you."},{"name":"MINFILIA","text":"Yet a darkness threatens to engulf this light. Never have I doubted the Ascians' presence, but that they have grown so brazen as to carry out their work in plain sight fills me with a sense of deep foreboding."}],"reward":{"gil":1201,"items":[{"num":10,"id":30362}],"xp":9240},"reqs":{"jobs":[{"lvl":24,"id":130}],"quests":[66280]},"next":[66283]},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1006688","obj":{"i":1006688,"n":"Minfilia","l":356,"q":8}},{"type":"npc","id":"1003785","obj":{"i":1003785,"n":"Tataru","l":42,"q":5}},{"type":"item","id":"30362","obj":{"i":30362,"n":"Vesper Bay Aetheryte Ticket","l":1,"c":25918,"t":63}},{"type":"quest","id":"66280","obj":{"i":66280,"n":"Believe in Your Sylph","g":1,"l":"East Shroud","s":131}},{"type":"quest","id":"66283","obj":{"i":66283,"n":"Shadow of Darkness","g":1,"l":"The Waking Sands","s":133}}]}