{"quest":{"name":"Foot in the Door","location":"Southern Thanalan","id":66298,"patch":2.0,"sort":139,"eventIcon":71201,"issuer":1006217,"target":1006688,"genre":1,"journal":["Gisilbehrt would offer you some advice regarding your investigation.","In order to win the trust of the Ala Mhigan refugees, Gisilbehrt suggests that you find a compatriot of theirs who would be willing to vouch for you. Return to Vesper Bay in western Thanalan, and consult Minfilia within the Waking Sands.","Minfilia informs you that there is an Ala Mhigan native among the Scions. Hopefully, this will lead to a breakthrough in your investigation."],"objectives":["Speak with Minfilia."],"dialogue":[{"name":"GISILBEHRT","text":"So you're determined to press on with your investigation? Then I have some advice to offer."},{"name":"GISILBEHRT","text":"As I said before, you won't get far without the Ala Mhigans' trust. And the best way to win that trust is to get a compatriot of theirs─someone they respect─to vouch for you."},{"name":"GISILBEHRT","text":"Coin does the talking in Ul'dah, but the Ala Mhigans are bound by something far stronger, if not as tangible: a common purpose. That purpose is, of course, the liberation of their home from the Garleans."},{"name":"GISILBEHRT","text":"Gundobald belongs to the Ala Mhigan Resistance, so your best bet would be someone who's part of the same crew. If you know any well-connected people, you might want to start by asking them."},{"name":"MINFILIA","text":"Welcome back, <span class=\"highlight\">Forename</span>! How fares the investigation?"},{"name":"MINFILIA","text":"...I see. Given all that they have suffered, it is of little wonder the Ala Mhigan refugees have lost faith in their fellow man."},{"name":"MINFILIA","text":"They have had their homeland taken from them, and for the past two decades have had to see it remain in the enemy's clutches."},{"name":"MINFILIA","text":"To compound matters, none of the three city–states have the means to take in all those who were displaced. As a result, a great many Ala Mhigans now live on the margins of society, suffering poverty and discrimination."},{"name":"MINFILIA","text":"&lt;sigh&gt; Would that more could be done to ease their hardships. I fear that nothing short of reclaiming their homeland would be a lasting solution."},{"name":"MINFILIA","text":"But let us deal with one problem at a time. Returning to the matter of your investigation, it just so happens there is an Ala Mhigan native among the Scions. I should be pleased to introduce him to you."}],"reward":{"items":[{"num":3,"id":5795},{"id":3352,"one":1},{"id":3349,"one":1},{"id":3354,"one":1},{"id":5825,"one":1}],"xp":9520},"reqs":{"jobs":[{"lvl":25,"id":130}],"quests":[66297]},"next":[66299]},"partials":[{"type":"npc","id":"1006217","obj":{"i":1006217,"n":"Gisilbehrt","l":45,"q":4,"t":"Flame Commander"}},{"type":"npc","id":"1006688","obj":{"i":1006688,"n":"Minfilia","l":356,"q":8}},{"type":"item","id":"5795","obj":{"i":5795,"n":"Woad Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"3352","obj":{"i":3352,"n":"Heavy Iron Flanchard","l":25,"c":45291,"t":36,"p":2748}},{"type":"item","id":"3349","obj":{"i":3349,"n":"Velveteen Sarouel","l":25,"c":45178,"t":36,"p":1099}},{"type":"item","id":"3354","obj":{"i":3354,"n":"Striped Velveteen Slops","l":25,"c":45297,"t":36,"p":1099}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66297","obj":{"i":66297,"n":"Tea for Three","g":1,"l":"Southern Thanalan","s":138}},{"type":"quest","id":"66299","obj":{"i":66299,"n":"Meeting with the Resistance","g":1,"l":"The Waking Sands","s":140}}]}