{"quest":{"name":"Potable Perils","location":"North Shroud","id":66324,"patch":2.0,"sort":280,"eventIcon":71221,"issuer":1006245,"target":1002804,"genre":92,"journal":["Somerhild of Fallgourd Float would ask your aid on behalf of a forgetful friend.","A drinking companion of Somerhild's has misplaced the key to his room at the Bobbing Cork. Recover it to rescue the poor sop from a hard night sleeping on the streets.","You have recovered the misplaced key. Deliver it to Aeluuin of the Bobbing Cork.","Aeluuin thanks you for recovering the key lost by one of his drunken customers. What with a mysterious masked figure skulking about the surroundings of late, he is concerned for the safety of his patrons."],"objectives":["Search for the missing key.","Return the key to Aeluuin."],"dialogue":[{"name":"SOMERHILD","text":"How do you fancy Fallgourd Float, traveler? Fine tea, warm beds, good ale, and good company at the Bobbing Cork. Small wonder that it's many a wayfarer's favorite stop on the road to Coerthas."},{"name":"SOMERHILD","text":"Speaking of the Bobbing Cork, I was sharing a drink and a tale with a traveler just a few bells ago. Apparently, the poor fellow imbibed a bit too heavily, and when he came to, the key to his room was nowhere to be found."},{"name":"SOMERHILD","text":"What with all the rumors of late, both my friend and the innkeep are worried sick. If you happen to stumble across the key, would you be kind enough to return it to the Cork? You'd be saving more than one man a sleepless night."},{"name":"SOMERHILD","text":"//: find key"},{"name":"AELUUIN","text":"Bloody souse! That's why I always say, if you can't hold your liquor, stick to tea! I'm sorry, do you have something for me?"},{"name":"AELUUIN","text":"Why, I've been searching everywhere for that key! You're a godssend, friend."},{"name":"AELUUIN","text":"You must forgive me. There're rumors of late of a suspicious masked man in these parts, and they've got both me and my customers on edge."},{"name":"AELUUIN","text":"Anyroad, thanks to you, that ale-swilling fool can sleep soundly in his bed tonight. You'd do well to find safe lodgings as well, friend."}],"reward":{"items":[{"id":3365,"one":1},{"id":3355,"one":1},{"id":5825,"one":1}],"xp":6290},"reqs":{"jobs":[{"lvl":28,"id":1}]},"next":[66328]},"partials":[{"type":"npc","id":"1006245","obj":{"i":1006245,"n":"Somerhild","l":57,"q":2}},{"type":"npc","id":"1002804","obj":{"i":1002804,"n":"Aeluuin","l":57,"q":6}},{"type":"item","id":"3365","obj":{"i":3365,"n":"Velveteen Trousers","l":28,"c":45065,"t":36,"p":1947}},{"type":"item","id":"3355","obj":{"i":3355,"n":"Velveteen Tights","l":27,"c":45088,"t":36,"p":1220}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66328","obj":{"i":66328,"n":"Cleaning House","g":92,"l":"North Shroud","s":280}}]}