{"quest":{"name":"Terror at Fallgourd","location":"The Waking Sands","id":66320,"patch":2.0,"sort":149,"icon":100125,"eventIcon":71201,"target":1006240,"involved":[1006241,1007417],"genre":0,"usedItems":[4674],"journal":["Minfilia has another lead for you to pursue.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Noraxia tells you that a miner named Medrod witnessed an unsavory masked character in the wood. Take yourself to Fallgourd Float in the North Shroud, and learn all you can from him.","You find Medrod at Fallgourd Float, but the man is too perturbed to speak of his experience. Perhaps his companion at the table can help to settle him down.","According to Aideen, nothing calms Medrod like a serving of lentils and chestnuts, his mother's specialty. Obtain a sample of this dish and bring it to him.","You have brought Medrod his favorite dish, but it will take a bit more effort on your part to calm his frayed nerves. For want of a better idea, try to /soothe the man.","Medrod finally settles down and recounts his bloodcurdling experience seeing the masked man, who he swears is death incarnate. As Minfilia mentioned, it appears that this individual is indeed connected to the recent spate of mysterious deaths."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span>"],"dialogue":[{"name":"MINFILIA","text":"While you were tending to business in Thanalan, some new information arrived courtesy of our friends the sylphs."},{"name":"MINFILIA","text":"An individual fitting Lahabrea's description has been sighted in the North Shroud. This sighting comes in the wake of a series of mysterious deaths in the selfsame area. My instincts tell me that our man is involved."},{"name":"MINFILIA","text":"I would have you continue your investigation where you left off. Twelve willing, we will pick up Lahabrea's trail once more."},{"name":"MINFILIA","text":"Noraxia can furnish you with the details. Pray speak with her, and take it from there. As always, be careful out there, <span class=\"highlight\">Forename</span>."},{"name":"NORAXIA","text":"Walking one is to investigate sinister one? Then heed well this one's words."},{"name":"NORAXIA","text":"This one is friends with a walking one in the Ashcrown Consortium. According to friendly one, a digging one named Medrod had an encounter with a scary masked one. This masked one is most certainly sinister one!"},{"name":"NORAXIA","text":"Walking one should go and speak with digging one Medrod. Digging one is to be found at Fallgourd Float in the North Shroud."},{"name":"MEDROD","text":"P-Please leave me be... I'm not long for this world..."},{"name":"MEDROD","text":"I...I looked death in the face... 'Tis only a matter of time before he comes for me, just like he came for that poor woman..."},{"name":"MEDROD","text":"&lt;sob&gt; Mummyyy! I'm sorry I wasn't a better son! I'm sorry I didn't eat my greens and do my chores! Waaaaaah!"},{"name":"AIDEEN","text":"You wanted words with Medrod? Well, as you can see, that might be...tricky. He's been this way near a fortnight. If you need him to make sense in a hurry, might be as I can give you some advice. Though he looks a man grown, Medrod's still a little boy on the inside."},{"name":"AIDEEN","text":"You might try feeding him a serving of lentils and chestnuts, his mother's specialty. Stuff should be easy enough to find in Gridania. Oh, and a few <span class=\"highlight\">soothing</span> words wouldn't go astray either. Nothing like Mummy's cooking and her expert ministrations for a skinned knee, as it were."},{"name":"MEDROD","text":"It was horrible...a waking nightmare... Cannot unsee... Oh, gods, what have I done to deserve this? MUMMYYY! &lt;sob&gt;"},{"name":"MEDROD","text":"&lt;gasp&gt; You...you found it! This is my favoritest dish in the whole world! Mum made this for me whenever I felt glum, and it never failed to make me forget my─ <span class=\"emphasis\">Wait a minute</span>! You're trying to make me tell you...tell you...about <span class=\"emphasis\">that</span>, aren't you!? No... Too <span class=\"emphasis\">horrible</span>..."},{"name":"MEDROD","text":"I don't care how much of my favoritest dish you give me! Nothing on Hydaelyn is worse than what I saw... Nothing!"},{"name":"MEDROD","text":"...Y-You're right. It's not as bad as it seems. I saw something terrible, that's true, but that hardly means I'm going to suffer the same fate. Thanks to you, I can think straight again. I believe I can even recount what I saw without losing it."},{"name":"MEDROD","text":"It was just another ordinary day. I was headed back to the Float when I noticed a suspicious character in the distance─a masked man garbed head to toe in black. He had a hideous fiend in tow, a winged creature that was all eyeball and jagged teeth. Taken by curiosity, I crept as near as I dared..."},{"name":"MEDROD","text":"...To see the corpse of a woman! One glimpse was enough to tell me that she'd died a gruesome death!"},{"name":"MEDROD","text":"In that instant, I knew right away that the masked man was a minion of Thal, come to claim her soul for His realm."},{"name":"MEDROD","text":"What!? You're investigating this same masked man!?"},{"name":"AIDEEN","text":"If that's the case, we'll help you in whatever way we can!"},{"name":"IVAURAULT","text":"Aye, anything to ensure that we won't have to suffer Medrod's hysteria ever again."},{"name":"MEDROD","text":"All right, teamwork! That's what I wanted to─wait, I haven't been <span class=\"emphasis\">that</span> bad, have I...? At any rate, I'm all for helping this adventurer. It's the least I can do to repay <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> for bringing me lentils and chestnuts!"},{"name":"MEDROD","text":"Wh-What are you playing at!? If you're trying to <span class=\"highlight\">soothe</span> me, you're going about it all wrong!"}],"reward":{"xp":11520},"reqs":{"jobs":[{"lvl":27,"id":130}],"quests":[66319]},"next":[66321]},"partials":[{"type":"npc","id":"1006240","obj":{"i":1006240,"n":"Medrod","l":57,"q":3}},{"type":"npc","id":"1006241","obj":{"i":1006241,"n":"Aideen","l":57,"q":4}},{"type":"npc","id":"1007417","obj":{"i":1007417,"n":"Noraxia","l":356,"q":1}},{"type":"item","id":"4674","obj":{"i":4674,"n":"Lentils and Chestnuts","l":16,"c":24106,"t":46,"p":34}},{"type":"quest","id":"66319","obj":{"i":66319,"n":"Back to Square One","g":1,"l":"Southern Thanalan","s":148}},{"type":"quest","id":"66321","obj":{"i":66321,"n":"Ziz Is So Ridiculous","g":0,"l":"North Shroud","s":150}}]}