{"quest":{"name":"A Welcome Overstayed","location":"North Shroud","id":66330,"patch":2.0,"sort":280,"eventIcon":71221,"issuer":1002800,"target":1002800,"involved":[1006251],"genre":92,"journal":["Gogolata doesn't want to go home.","Gogolata is enjoying the comforts of life on the road, and seeks to delay his return home for as long as possible. Present Gogolata's envelope to the haughty houseboy who has come to find him.","Upon opening Gogolata's envelope to discover reservation papers for a stay at the Bobbing Cork, the hired hand dashes off in delight. Return to speak with Gogolata.","According to Gogolata, the hired hand expressed his gratitude, then rushed straight to his room where he now sleeps soundly. It would seem Gogolata is not the only one less than eager to return to Ul'dah."],"objectives":["Deliver the envelope to the haughty houseboy.","Speak with Gogolata."],"dialogue":[{"name":"GOGOLATA","text":"A cozy bed, warm meals, fine spirits... I tell you, friend, ever since I came here it's like I've died and gone to Nophica's bosom!"},{"name":"GOGOLATA","text":"Go home to Ul'dah? To that ramshackle hovel where nothing awaits but my gil-pinching wife and her endless whinging? Never!"},{"name":"GOGOLATA","text":"Perhaps you can help me. My wife's hired some poor sop to bring me home, but I reckon this'll give him a change of heart."},{"name":"GOEI","text":"Wh-Whaddaya want!? The missus paid me good coin to bring her good-for-nothin' husband home."},{"name":"GOEI","text":"Your gil don't mean nothin' to me. The missus paid me─hm? What in the hells? A room o' me own here at the Cork─plus all the ale I can drink─fully paid, courtesy o' Gogolata?"},{"name":"GOEI","text":"G-Get out of me way! I'm goin' to go give that man a piece of me mind!"},{"name":"GOGOLATA","text":"Hah hah! It would seem your efforts were a success. My wife's associate just stopped by a moment ago."},{"name":"GOGOLATA","text":"Seems he wanted to express his gratitude in person. Downed a pint of ale and dashed right off to his room, where he's sleeping quite soundly, if his rather conspicuous snoring is any guide. Ahhh...the comforts of life on the road!"}],"reward":{"items":[{"id":4117,"one":1},{"id":4111,"one":1},{"id":4119,"one":1},{"num":2,"id":5825,"one":1}],"xp":6290},"reqs":{"jobs":[{"lvl":28,"id":1}]},"next":[66331]},"partials":[{"type":"npc","id":"1002800","obj":{"i":1002800,"n":"Gogolata","l":57,"q":2}},{"type":"npc","id":"1006251","obj":{"i":1006251,"n":"Haughty Houseboy","l":57,"q":1}},{"type":"item","id":"4117","obj":{"i":4117,"n":"Fluorite Bracelet","l":28,"c":55614,"t":42,"p":2544}},{"type":"item","id":"4111","obj":{"i":4111,"n":"Danburite Bracelet","l":28,"c":55613,"t":42,"p":2544}},{"type":"item","id":"4119","obj":{"i":4119,"n":"Lapis Lazuli Bracelet","l":28,"c":55610,"t":42,"p":2544}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66331","obj":{"i":66331,"n":"No Place Like Home","g":92,"l":"North Shroud","s":280}}]}