{"quest":{"name":"Skeletons in Her Closet","location":"Gridania","id":66337,"patch":2.0,"sort":155,"icon":112006,"eventIcon":71201,"issuer":1006263,"target":1006688,"genre":1,"journal":["Ursandel has a confession to make regarding the mysterious murders.","In grim tones, Ursandel reveals to you how Lady Amandine, his once beautiful mistress, was disfigured in the Calamity, and how she subsequently began to hold rites of rejuvenation at the urging of masked men. It would seem these rites involve the spilling of maiden blood. Knowing that this madness must end, Ursandel bids you do whatever is necessary to stop Amandine from claiming another victim. Make your way to Haukke Manor, situated on the western edge of the Central Shroud, and seek a way in.","You are now able to enter Haukke Manor. Fight your way through to the innermost chambers, and put an end to Lady Amandine's madness.<br><br>※Challenge Haukke Manor with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","No sooner have you defeated Lady Amandine than two masked men appear, their ominous exchange suggesting that it was they who masterminded the atrocities committed within the manor. Before you can bring them to account for their crimes, they vanish, leaving you with still more unanswered questions. Just who are these Ascians, and what is it that they seek to achieve?","Owing to your valor, no more innocent blood need be spilled. Make your way back to Gridania and report the glad tidings to Ursandel.","Upon hearing your tale, Ursandel implores you to visit harsh retribution upon the masked men, before pledging to surrender himself to justice for failing to prevent his former mistress's crimes. Your work in the Twelveswood now done, return to the Waking Sands and report all that has transpired to Minfilia.","In light of the recent incidents fomented by the Ascians, Minfilia declares her intent to recommend that each nation tighten security. Your investigation having yielded up all the information it is like to for the present, she bids you prepare yourself for a different challenge."],"objectives":["Seek entry into Haukke Manor.","Enter Haukke Manor.","Return to the Central Shroud.","Report to Ursandel.","Report to Minfilia."],"dialogue":[{"name":"URSANDEL","text":"I was once a manservant in the employ of one of the oldest and proudest families in Gridania─the Dartancours. During that time, I had the honor of waiting upon Lady Amandine, mistress of the household. Fair as summer was she, and possessed of a heart befitting her radiance."},{"name":"URSANDEL","text":"Alas, the Calamity wrought a great change in her. Though my lady escaped with her life, death may well have been a kinder fate. Never will I forget the day her bandages were removed, and she beheld her disfigured face for the first time. At that moment, the kindly woman I knew ceased to be."},{"name":"URSANDEL","text":"Unable to bear the thought of being seen, my lady sequestered herself within her chambers and refused all company. This continued for many uneasy moons, until one day, without warning, she began receiving queer guests. None among us knew whence they came, these masked men, but my lady believed that they would help her to regain that which she had lost. So began the “rites of rejuvenation.”"},{"name":"URSANDEL","text":"These rituals seemed innocent enough in the beginning, but grew ever more grotesque as time went by. Eventually, there came a day when my lady bound one of her handmaidens to her bed, and...and proceeded to mutilate the poor girl's face. Suffice it to say, she did not survive the ordeal. It fell to me to dispose of her body."},{"name":"URSANDEL","text":"I performed the dreadful task as bade, obedient servant that I was, but when the time came to return to the house, my legs refused to move. I knew then that I could not go back to that place, not after the nightmare I had witnessed. So it was that I left Haukke Manor, my home for nigh on half a century."},{"name":"URSANDEL","text":"Long did I weep for the girl who was slain, and longer still for the woman that Lady Amandine had been. Yet one cannot weep forever, and I endeavored to put the matter behind me. Indeed, I had resolved never to speak of my experience...until you appeared before me."},{"name":"URSANDEL","text":"My lady's madness must be ended, lest more innocent lives be lost. Lay her tormented soul to rest, as you swore to me you would. She awaits you at Haukke Manor, on the western edge of the Central Shroud. Go now. Go and do what must be done."},{"name":"DUMMY","text":"(Touch gate, gain access)"},{"name":"DUMMY","text":"(Raid the hell out of Haukke Manor)"},{"name":"ASCIANSWORD","text":"(-???-)<span class=\"highlight-purple\">Darkness has taken root within these halls...</span>"},{"name":"ASCIANSCEPTER","text":"(-???-)<span class=\"highlight-purple\">...Sprung from the most unlikely of seeds.</span>"},{"name":"ASCIANSWORD","text":"(-???-)<span class=\"highlight-purple\">One cannot help but admire the irrepressible spirit that quickened it to life.</span>"},{"name":"ASCIANSCEPTER","text":"It is a pleasure to meet you at last, adventurer. You are every bit as intriguing as our master gave us to believe."},{"name":"ASCIANSWORD","text":"It is no ordinary mortal who can acquire one Crystal of Light...much less <span class=\"emphasis\">three</span>."},{"name":"ASCIANSWORD","text":"The Crystals make you strong, and it is to that strength that the Light is drawn."},{"name":"ASCIANSCEPTER","text":"Hydaelyn chose well."},{"name":"ASCIANSWORD","text":"...A pity that your existence is irreconcilable with our own. We cannot well allow you to continue upon your present course."},{"name":"ASCIANSCEPTER","text":"Alas, we came here not to play, but to take the measure of your strength for Master Lahabrea. That task now accomplished, we take our leave of you."},{"name":"ASCIANSWORD","text":"Fare you well, Bringer of Light."},{"name":"URSANDEL","text":"You are returned! What sights awaited you within the manor? What has become of Lady Amandine? You must tell me all!"},{"name":"URSANDEL","text":"...So she went so far as to consort with devils. Would that I could have done more to prevent her fall. May she finally find peace in the beyond."},{"name":"URSANDEL","text":"I know not whether the masked men you encountered are the same pair that first led my lady astray, but it is plain that they are of the same vile brood. Should the chance ever present itself, <span class=\"emphasis\">promise me</span> that you will visit upon them tenfold the woe they have brought upon others."},{"name":"URSANDEL","text":"But who am I to speak of punishment? By my silence, I allowed I know not how many innocent young women to die in unspeakable circumstances... It matters not wherefore─through misplaced loyalty, cowardice, or both, I am an abettor to a gross crime. I will surrender myself to the authorities and accept whatever punishment they deem just. I only pray that the gods will have mercy on my soul."},{"name":"MINFILIA","text":"Welcome back, <span class=\"highlight\">Forename</span>. Full glad am I to see you safely returned. Tell me, how fared you on your sojourn in the Twelveswood?"},{"name":"MINFILIA","text":"...Two of Lahabrea's minions? ...And they sought to measure your strength...<span class=\"emphasis\">by their own admission</span>?"},{"name":"MINFILIA","text":"The devils taunt us... It is beyond doubt, then─the Ascians have begun to move in earnest. Would that we knew to what end."},{"name":"MINFILIA","text":"Yet I will not bemoan our plight. Thanks to your tireless efforts, we are at least <span class=\"emphasis\">aware</span> of the encroaching Darkness."},{"name":"MINFILIA","text":"Alas, we can only do so much. It is clear to me now that we Scions are too few to protect the realm against this threat unaided."},{"name":"MINFILIA","text":"We must needs alert the three nations to the presence of this elusive enemy, and recommend that they heighten their vigil."},{"name":"MINFILIA","text":"There is no shortage of misery in the world that the Ascians might exploit. We have an arduous struggle ahead of us."},{"name":"MINFILIA","text":"Yet come what may, we must not allow ourselves to become lost to hope, for that is precisely what the enemy desires."},{"name":"MINFILIA","text":"We have gleaned all we can from the information available to us. Let us set this investigation aside for the present."},{"name":"MINFILIA","text":"Another matter has arisen that requires your attention. Let me know when you are ready to be briefed, and I will summon the others."}],"reward":{"items":[{"id":31332}],"xp":12580,"instance":6},"reqs":{"jobs":[{"lvl":28,"id":130}],"quests":[66336]},"next":[66052]},"partials":[{"type":"npc","id":"1006263","obj":{"i":1006263,"n":"Ursandel","l":53,"q":4}},{"type":"npc","id":"1006688","obj":{"i":1006688,"n":"Minfilia","l":356,"q":8}},{"type":"item","id":"31332","obj":{"i":31332,"n":"Level 28 Weapon Coffer","l":1,"c":26557,"t":61}},{"type":"instance","id":"6","obj":{"i":6,"n":"Haukke Manor","c":61801,"t":"Dungeons","min_lvl":28,"max_lvl":31}},{"type":"quest","id":"66336","obj":{"i":66336,"n":"Secret of the White Lily","g":1,"l":"North Shroud","s":154}},{"type":"quest","id":"66052","obj":{"i":66052,"n":"Wrath of the Titan","g":1,"l":"The Waking Sands","s":156}}]}