{"quest":{"name":"Costa Beach Party","location":"Eastern La Noscea","id":66349,"patch":2.0,"sort":300,"eventIcon":71221,"issuer":1006273,"target":1006273,"involved":[1006274,1006275,1006276,1006277,1006278],"genre":91,"journal":["This <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morn</span><span class=\"alternative\">day</span></span> finds Master Gegeruju, the brightest jewel in the glittering high society of Costa del Sol, in an unaccountably pensive mood.","You have learned from Gegeruju that a quartet of dancing girls who were due to arrive have not yet presented their lissome selves. The driver of their carriage is certain to be nearby. Find him and discover the whereabouts of the fair guests.","According to the driver, the dancers have gone spinning off towards the beach, exclaiming over the beauty of the sea. Track down the four girls.","You have spoken to each of the dancers, but have found them loath to cut short their play among the surf. Bear the tale back to Master Gegeruju.","Though you are initially fearful of the Lalafell's reaction, Gegeruju surprises you by being completely understanding of the situation. How could any child of verdant Gridania or arid Ul'dah resist the blue ocean that cradles Costa del Sol? Always generous, Gegeruju has declared that he will wait until the girls have had their fill of the beach."],"objectives":["Speak with the carriage driver.","Find the dancing girls.","Report to Gegeruju."],"dialogue":[{"name":"GEGERUJU","text":"Oh, where are they? Has something─something less than delightful and more than awful─befallen the new dancing girls who were to arrive today?"},{"name":"GEGERUJU","text":"This is <span class=\"emphasis\">most</span> inconvenient... I do so ever wish that <span class=\"emphasis\">someone</span> would find the driver who was to bring my divine danseuses. That <span class=\"emphasis\">someone</span> would be healthily rewarded for it, I shouldn't doubt. Ahem."},{"name":"BASHA","text":"The guv'nor sent ye, did he? I was afraid he wasn't goin' to wait no more... D–Don't be givin' me the sack, now! 'Tain't my fault, I swear!"},{"name":"BASHA","text":"I brought the girls jus' like I was s'posed to. An' we got as far as here afore they caught sight o' the ocean. An' <span class=\"emphasis\">that's</span> the moment they start cryin' like coeurls an' hoppin' like spriggans. Soon as I stopped the wagon, they were off an' runnin' to the beach!"},{"name":"BASHA","text":"Now, I yelled at them ladies to get back in the carriage so we could get where we were s'posed to, but they didn't pay me no never mind! You'd go talk some sense to them, wouldn't ye? Workin' stiffs, the both of us─<span class=\"emphasis\">you</span> understand! Ye'll help me out?"},{"name":"BASHA","text":"I'm beggin' ye, tell those shimmyin' she-devils to go to the guv'nor's. I ain't gettin' the sack jus' 'cause they have a mind to build sand castles!"},{"name":"GALA","text":"Excuse me, who are you? Not the boss of me, that's right. This is my first time on the beach, and nobody's going to tell me how long I can and can't have, got it?"},{"name":"GALB","text":"I just feel so blessed to be here. This is so beautiful and inspiring, don't you think? I'm feeling so many things─I just need to drink it all in and channel it into my art."},{"name":"GALC","text":"Oh, <span class=\"emphasis\">honey</span>...I've never seen anything like this. It's all dunes where I come from, you know. I'm <span class=\"emphasis\">sure</span> Master Gegeruju wouldn't mind a bit if we stretched our legs before coming to see him."},{"name":"GALD","text":"Shells're right fancy 'n' pricey back home. Betcha gil to goobbue poop that I can sell a beauty like <span class=\"emphasis\">this</span> to Master Gegeruju. Need to find a way to get it <span class=\"emphasis\">to</span> him, though... You go wait while I find me a wagon or some such."},{"name":"GEGERUJU","text":"Overcome by the ocean, are they? Seduced by the sand? With <span class=\"emphasis\">me</span> waiting? <span class=\"emphasis\">Me</span>, who paid so dearly to see their unparalleled undulations...?<br>Well, how delightful! They are true artistes, as beautiful inside as they are out!"},{"name":"GEGERUJU","text":"Gridania is green, Ul'dah is golden, but only Costa del Sol is blue and white. Yes, I should have thought of it earlier and given them leave to play upon the beach!"},{"name":"GEGERUJU","text":"Ah, happy it is to be a wealthy man. I shall wait because...well, because I can! I am no drudge quaking at the sound of a master's step. Nor am I a knuckle-biter who needs a bottle of brandewine to keep the tremors at bay. I shall enjoy the anticipation and the fulfillment alike!"}],"reward":{"gil":1377,"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[66387]},"partials":[{"type":"npc","id":"1006273","obj":{"i":1006273,"n":"Gegeruju","l":32,"q":7}},{"type":"npc","id":"1006274","obj":{"i":1006274,"n":"Carriage Driver","l":32,"q":1}},{"type":"npc","id":"1006275","obj":{"i":1006275,"n":"Leggy Dancer","l":32,"q":1}},{"type":"npc","id":"1006276","obj":{"i":1006276,"n":"Burly Dancer","l":32,"q":1}},{"type":"npc","id":"1006277","obj":{"i":1006277,"n":"Hearty Dancer","l":32,"q":1}},{"type":"npc","id":"1006278","obj":{"i":1006278,"n":"Ungainly Dancer","l":32,"q":1}},{"type":"quest","id":"66387","obj":{"i":66387,"n":"The Wind, It Passes","g":91,"l":"Eastern La Noscea","s":330}}]}