{"quest":{"name":"Shocking Discoveries","location":"Central Shroud","id":66341,"patch":2.0,"sort":290,"eventIcon":71221,"issuer":1006261,"target":1006261,"genre":92,"journal":["Marcette would put you to work again, whether you like it or not.","The genius naturalist Marcette has deigned to appoint you to the most honorable position of Research Assistant Six, and promptly ordered you to procure a live lightning spark for her research. Weaken the creature and capture it in the receptacle she has provided for you.","You have captured a live lightning spark. Despite your concerns for the creature's fate, you have agreed to deliver it to Marcette.","Marcette is on the verge of another pioneering discovery. Despite your continued contributions to her research, she has yet to remember your number, let alone your name."],"objectives":["Use the thick glass jar on a weakened lightning spark.","Deliver the live lightning spark to Marcette."],"dialogue":[{"name":"MARCETTE","text":"Research Assistant Six. Yes, I am speaking to <span class=\"emphasis\">you</span>, Research Assistant Six─that is the title I have deigned to bestow upon you after your humble contribution to my latest scientific breakthrough."},{"name":"MARCETTE","text":"Mind you, now that you are officially my slave─er, <span class=\"emphasis\">research assistant</span>─there will be no slacking off. I require a live lightning spark. Here is a jar. Now hurry─I haven't all day!"},{"name":"MARCETTE","text":"The mere fact that you dare to interrupt me means that you must have the live lightning spark I require. Well, hand it over, then!"},{"name":"MARCETTE","text":"Oooh, aren't you a cute little one!? Just think of all the fun I can have with you! The next assistant who dares shirk <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> duties is in for quite a shock! Muahahaha!!!"},{"name":"MARCETTE","text":"Now, where was I? Ah, yes, toadstools! If my theories are correct, sending a shock through the toadstools will trigger a sense of danger, causing them to reproduce with unheard-of speed!"},{"name":"MARCETTE","text":"Truly, my genius knows no bounds! To think of the discoveries I could make if I had but a single competent assistant! ...You! Assistant Seven! Or was it Four!? Oh, who<span class=\"emphasis\">ever</span> you are, begone from my sight and let me concentrate for once!"}],"reward":{"gil":1580,"xp":7220},"reqs":{"jobs":[{"lvl":29,"id":1}],"quests":[66340]},"next":[66342,66343]},"partials":[{"type":"npc","id":"1006261","obj":{"i":1006261,"n":"Marcette","l":54,"q":4}},{"type":"quest","id":"66340","obj":{"i":66340,"n":"Fungal Frolic","g":92,"l":"Central Shroud","s":290}},{"type":"quest","id":"66342","obj":{"i":66342,"n":"In Too Deep","g":92,"l":"Central Shroud","s":290}},{"type":"quest","id":"66343","obj":{"i":66343,"n":"Doing the Dirty Work","g":92,"l":"Central Shroud","s":290}}]}