{"quest":{"name":"The Drake Exception","location":"Southern Thanalan","id":66356,"patch":2.0,"sort":165,"icon":100130,"eventIcon":71201,"target":1004917,"genre":0,"journal":["U'odh Nunh is attempting to ignore you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to U'odh Nunh at Forgotten Springs.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You now possess the blood of seven ferocious sundrakes. Return to Forgotten Springs and present the blood to U'odh Nunh.","Although U'odh Nunh now recognizes you as a passable hunter, he still refuses to tell you of the ingredient. This may take a while..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to U'odh Nunh at Forgotten Springs.</span>"],"dialogue":[{"name":"UODHNUN","text":"Perrrsistent bugger. Very well, let's have a look at you."},{"name":"UODHNUN","text":"...You've seen your share of battle, there's no mistaking that. And you did manage to obtain that adamantoise egg. However, that was naught more than a display of brrrute force and blind courage."},{"name":"UODHNUN","text":"The nunh I once fought also believed that his strrrength would save him. He was wrong, and now I am nunh."},{"name":"UODHNUN","text":"Many years ago, I joined the Company of Heroes to hone my skills, instead of challenging my predecessor before I was ready. Even when I was young, I understood that victorrry goes to the patient, the cunning, the pragmatic."},{"name":"UODHNUN","text":"That is why I claimed my position, and it is why I still hold it. And it is why I will not help an unprrroven whelp."},{"name":"UODHNUN","text":"The Children of the Sands do not offer aid to strangers. To do so is a sign of weakness. However, if you were rrrecognized as a skilled hunter in your own right, it would be permissible to assist you."},{"name":"UODHNUN","text":"A child who wishes to become a hunterrr must collect the blood of seven sundrakes. You are not a child, so you may find this to be easy. But you are not of the U tribe, so perhaps not."},{"name":"UODHNUN","text":"I will consider your rrrequest once you have brought me the blood, and not a moment sooner."},{"name":"UODHNUN","text":"I will not help an unproven whelp. Brrring me the blood, or we have nothing to discuss."},{"name":"UODHNUN","text":"You are a hunterrr of beasts. This much I now know to be true."},{"name":"UODHNUN","text":"But Titan is no mere beast. If you mean to hunt a god, you must prove much more to me."}],"reward":{"xp":15200},"reqs":{"jobs":[{"lvl":31,"id":130}],"quests":[66355]}},"partials":[{"type":"npc","id":"1004917","obj":{"i":1004917,"n":"U'odh Nunh","l":45,"q":12}},{"type":"quest","id":"66355","obj":{"i":66355,"n":"Trial by Turtle","g":0,"l":"South Shroud","s":164}}]}