{"quest":{"name":"A Modest Proposal","location":"Eastern La Noscea","id":66350,"patch":2.0,"sort":161,"eventIcon":71201,"issuer":1006266,"target":1006279,"genre":1,"journal":["Wheiskaet has an important mission for you.","Two highly distinguished individuals are scheduled to visit Costa del Sol, and Master Gegeruju wishes to welcome them with an elaborate banquet. Wheiskaet bids you assist in this endeavor by bringing him the ingredients required for this exotic feast. To obtain the first ingredient, you must seek out Landenel at Camp Tranquil in the South Shroud.","You learn that the first ingredient is the egg of a giant adamantoise. Though Landenel will not assist you directly, he will tell you how you can obtain an egg yourself."],"objectives":["Speak with Landenel."],"dialogue":[{"name":"WHEISKAET","text":"Two highly distinguished individuals are scheduled to visit Costa del Sol in the near future, and Master Gegeruju wishes to welcome them with an elaborate banquet."},{"name":"WHEISKAET","text":"But while money is no object, not everything Master Gegeruju desires can be so easily purchased."},{"name":"WHEISKAET","text":"It is to be an extremely exotic feast. And so, <span class=\"highlight\">Forename</span>, your mission is to seek out and obtain the rare ingredients our chef requires."},{"name":"WHEISKAET","text":"Naturally, such fine dining must be accompanied with a suitable wine. And by “suitable,” I mean “the very best there is.” That, however, can wait for the time being, as I believe you have enough on your plate as it is."},{"name":"WHEISKAET","text":"It will be a long and arduous journey, but you need not toil alone. Many of the mercenaries who once served under my command still live, and they will guide you in your quest. For the first ingredient, I would have you travel to the South Shroud and speak with Landenel at Camp Tranquil."},{"name":"WHEISKAET","text":"...What? Do you mean to tell me that you cannot afford to waste time, as your associate did?"},{"name":"WHEISKAET","text":"Adventurer, if you have not the endurance to complete this mission, how do you expect me to believe you can outlast the Lord of Crags? Either do it or don't─I have work to do."},{"name":"LANDENEL","text":"Do you require assistance, adventurer?"},{"name":"LANDENEL","text":"...So this is the one who would challenge Titan. I've been expecting you, <span class=\"highlight\">Forename</span>."},{"name":"LANDENEL","text":"The ingredient you seek is the egg of a giant adamantoise."},{"name":"LANDENEL","text":"The method of acquisition should be obvious─you steal it from the beast's nest, of course. Simple in theory, but difficult in execution. Most who try die in the attempt."},{"name":"LANDENEL","text":"Will I help you get it? Hah, you amuse me. I will not jeopardize my position by openly assisting you. From me you will receive only information. What you do with it is your choice."}],"reward":{"items":[{"id":21800}],"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":130}],"quests":[66348]},"next":[66351,66353,66354,69401]},"partials":[{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"npc","id":"1006279","obj":{"i":1006279,"n":"Landenel","l":56,"q":7}},{"type":"item","id":"21800","obj":{"i":21800,"n":"Glamour Prism","l":35,"c":26235,"t":60}},{"type":"quest","id":"66348","obj":{"i":66348,"n":"Nix That","g":1,"l":"Eastern La Noscea","s":160}},{"type":"quest","id":"66351","obj":{"i":66351,"n":"The Penitent Man","g":0,"l":"South Shroud","s":162}},{"type":"quest","id":"66353","obj":{"i":66353,"n":"We'll Always Have Ul'dah","g":92,"l":"South Shroud","s":300}},{"type":"quest","id":"66354","obj":{"i":66354,"n":"A Burning Request","g":92,"l":"South Shroud","s":300}},{"type":"quest","id":"69401","obj":{"i":69401,"n":"Trial by Turtle","g":1,"l":"South Shroud","s":164}}]}