{"quest":{"name":"Changing of the Guard","location":"South Shroud","id":66352,"patch":2.0,"sort":163,"eventIcon":71201,"target":1006279,"involved":[1006280,1006281,1006282],"genre":0,"journal":["Landenel has an urgent request for a kind adventurer.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Landenel at Camp Tranquil.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","All three sentries have departed for the Lower Paths. Return to Camp Tranquil and speak with Landenel.","The adamantoise breeding grounds will not remain unguarded for long. Landenel urges you to act quickly if you intend to obtain one of the precious giant eggs."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Landenel at Camp Tranquil.</span>"],"dialogue":[{"name":"LANDENEL","text":"This agaric fly infestation requires our full attention. I thank you for bringing it to my attention, adventurer."},{"name":"LANDENEL","text":"If I may impose upon your kindness further, I would ask you to inform my subordinates of this dire development."},{"name":"LANDENEL","text":"I have three Wailers currently standing guard in Rootslake. Inform each man that they are to proceed to the Lower Paths and search for agaric fly swarms until further notice."},{"name":"KIKOKUTAIA","text":"Agaric flies? In the Lower Paths? Then I mustn't delay! Thank you for relaying Captain Landenel's orders, adventurer!"},{"name":"KIKOKUTAIB","text":"A message from the captain?<br>Damn, those vilekin are a danger to travelers on the road. I will depart immediately."},{"name":"KIKOKUTAIC","text":"What's that? Everyone is to search the Lower Paths for agaric flies? Hmmm...I know we haven't had to deal with poachers recently, but I cannot help but worry that they will strike in our absence. &lt;sigh&gt; But an order is an order."},{"name":"LANDENEL","text":"...I take it you have informed my men, then? Excellent work, <span class=\"highlight\">Forename</span>."},{"name":"LANDENEL","text":"However, I cannot keep the roosters distracted for too long. If you wish to pillage the hen house, you must do so now."}],"reward":{"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":130}],"quests":[66351]},"next":[66355]},"partials":[{"type":"npc","id":"1006279","obj":{"i":1006279,"n":"Landenel","l":56,"q":7}},{"type":"npc","id":"1006280","obj":{"i":1006280,"n":"Honest Wood Wailer","l":56,"q":1}},{"type":"npc","id":"1006281","obj":{"i":1006281,"n":"Brazen Wood Wailer","l":56,"q":1}},{"type":"npc","id":"1006282","obj":{"i":1006282,"n":"Stodgy Wood Wailer","l":56,"q":1}},{"type":"quest","id":"66351","obj":{"i":66351,"n":"The Penitent Man","g":0,"l":"South Shroud","s":162}},{"type":"quest","id":"66355","obj":{"i":66355,"n":"Trial by Turtle","g":0,"l":"South Shroud","s":164}}]}