{"quest":{"name":"The Penitent Man","location":"South Shroud","id":66351,"patch":2.0,"sort":162,"icon":100129,"eventIcon":71201,"target":1006279,"genre":0,"journal":["Landenel needs to explain a few things to you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Landenel at Camp Tranquil.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","As Landenel feared, agaric flies have already taken notice of the brownie brushes. Having slain a swarm of the vilekin, collect a brownie brush as evidence.","You harvest a single succulent brownie brush. Deliver it to Landenel and tell him of the agaric fly infestation.","Landenel is unsurprisingly horrified to hear that you encountered agaric flies in the Lower Paths. All that remains is to inform his sentries..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Landenel at Camp Tranquil.</span>"],"dialogue":[{"name":"LANDENEL","text":"Let me be clear: this business between you, me, and the captain must remain a secret."},{"name":"LANDENEL","text":"See, I don't regret my time spent with the Company in the slightest. Traveling the world, meeting interesting people, killing them─it was all jolly good fun."},{"name":"LANDENEL","text":"Alas, Gridanians are, by and large, an unforgiving lot─Detoh here being a rare exception."},{"name":"LANDENEL","text":"I've had to go to great lengths to ensure that I am seen as a model citizen, with no taste for drinking, whoring, gambling, and all those other activities I so dearly miss."},{"name":"LANDENEL","text":"So understand that if you ruin my little charade by wagging your tongue, I'll fashion a noose with your entrails and hang you from the nearest heavenspillar."},{"name":"LANDENEL","text":"Now then, where were we...ah, yes, the egg. The first thing you must do is deal with the sentries patrolling the adamantoise breeding grounds. Poaching is illegal in Gridania, in case you were unaware."},{"name":"LANDENEL","text":"A shame we have so few Wailers to spare─especially with brownie brushes almost in season. Matron forfend if agaric flies claim the crop before we receive additional sentries..."},{"name":"LANDENEL","text":"Aye, we will also soon need barrels of stingbrew to weaken and ward off the pests."},{"name":"LANDENEL","text":"But if any of the vilekin were found near the shrooms before we can take preventative measures, we would be forced to shift our patrols immediately..."},{"name":"LANDENEL","text":"You will, of course, notify me if you encounter any agaric flies in the vicinity of the Lower Paths, yes?"},{"name":"LANDENEL","text":"I pray this year's crop of brownie brushes comes late..."},{"name":"LANDENEL","text":"Oh my, is this a brownie brush? And you say you slew a whole swarm of agaric flies!?"},{"name":"LANDENEL","text":"Matron's teats, we cannot wait for reinforcements! We must do something!"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":130}],"quests":[66350]},"next":[66352]},"partials":[{"type":"npc","id":"1006279","obj":{"i":1006279,"n":"Landenel","l":56,"q":7}},{"type":"quest","id":"66350","obj":{"i":66350,"n":"A Modest Proposal","g":1,"l":"Eastern La Noscea","s":161}},{"type":"quest","id":"66352","obj":{"i":66352,"n":"Changing of the Guard","g":0,"l":"South Shroud","s":163}}]}