{"quest":{"name":"When the Worm Turns","location":"Southern Thanalan","id":66358,"patch":2.0,"sort":167,"eventIcon":71201,"issuer":1004917,"target":1004917,"genre":1,"journal":["U'odh Nunh is finally willing to tell you of the ingredient you seek.","The ingredient you seek is the meat of a Wellwick worm. The creatures are exceedingly rare and must be lured out before they can be slain. To this end, U'odh Nunh suggests you slay an angler and use its carcass as bait.","You have obtained the requisite angler carcass. Place it atop the sand ridge to the east in the midst of Wellwick worm territory.","The trap is set, and now all that remains is for you to wait. When the Wellwick worm appears, slay it and collect its meat.","Though the beast was indeed fearsome, it was no match for you. Return to Forgotten Springs and present your prize to U'odh Nunh.","U'odh Nunh must first prepare the meat, but he promises to send it to Wheiskaet in time for the banquet. Because he does not know the location of the third ingredient, you must return to Costa del Sol and speak with the former captain for more information. However, before you can depart, U'odh Nunh has one final favor to ask."],"objectives":["Slay an angler and collect its carcass.","Place the carcass in Wellwick worm territory.","Lie in wait for a Wellwick worm.","Present your prize to U'odh Nunh."],"dialogue":[{"name":"UODHNUN","text":"A shame we did not meet when I was still with the Company of Heroes. You would have made a fine rrrecruit."},{"name":"UODHNUN","text":"But no point dwelling on what cannot be. You have a Wellwick worm to hunt."},{"name":"UODHNUN","text":"Sandworms slither brrrazenly across the desert dunes, but Wellwick worms are far fewer in number. Rarity brrreeds demand, and so their meat is highly prized as a delicacy."},{"name":"UODHNUN","text":"The only way to catch your quarry is to entice it with something it cannot rrresist."},{"name":"UODHNUN","text":"These worms prrrey on the smaller creatures of the Sagolii. A freshly slaughtered angler carcass would be my choice of bait."},{"name":"UODHNUN","text":"There is an area teeming with anglers to the east. I will mark it upon your map, along with the location where Wellwick worms are most frrrequently sighted."},{"name":"UODHNUN","text":"Be warned─the blood will drive the worm into a feeding frrrenzy. If your skills are lacking, it will devour you as well."},{"name":"UODHNUN","text":"You look well. Have you caught your quarry, then?"},{"name":"UODHNUN","text":"Your skills as a hunter rrrival those of our best. I applaud your success, <span class=\"highlight\">Forename</span>."},{"name":"UODHNUN","text":"The meat will need to be heavily smoked before I ship it to Wheiskaet. Worry not─you have my word that he will rrreceive it in time for the banquet."},{"name":"UODHNUN","text":"You must be eager to obtain the third ingrrredient. I regret to say that I know naught of its location. For the nonce, you should return to Costa del Sol and seek Wheiskaet's counsel."},{"name":"UODHNUN","text":"Ah, but hold a moment. Since you will be meeting the captain again soon, there is something I would like you to deliver to him for me."},{"name":"POP","text":"The sand surrounding the angler carcass begins to pulse and throb..."}],"reward":{"items":[{"id":3599,"one":1},{"id":27670,"one":1},{"id":3597,"one":1},{"num":3,"id":5825,"one":1}],"xp":15200},"reqs":{"jobs":[{"lvl":31,"id":130}],"quests":[66357]},"next":[66367]},"partials":[{"type":"npc","id":"1004917","obj":{"i":1004917,"n":"U'odh Nunh","l":45,"q":12}},{"type":"item","id":"3599","obj":{"i":3599,"n":"Steel Gauntlets","l":30,"c":48303,"t":37,"p":3139}},{"type":"item","id":"27670","obj":{"i":27670,"n":"Velveteen Gloves","l":31,"c":44734,"t":37}},{"type":"item","id":"3597","obj":{"i":3597,"n":"Toadskin Armguards","l":30,"c":48329,"t":37,"p":2242}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66357","obj":{"i":66357,"n":"The Perfect Prey","g":1,"l":"Southern Thanalan","s":166}},{"type":"quest","id":"66367","obj":{"i":66367,"n":"There and Back Again","g":1,"l":"Southern Thanalan","s":168}}]}