{"quest":{"name":"Minority Rapport","location":"Southern Thanalan","id":66362,"patch":2.0,"sort":310,"eventIcon":71221,"issuer":1006290,"target":1006294,"genre":93,"journal":["Riridesu seems to need help with a delivery.","Speaking to Riridesu elicits a small diatribe detailing the woes he incurred in his attempt to open a shop within Forgotten Springs. Apparently, the nunh of the U tribe forbade the shop due to cultural differences. Business must continue, however, so the Lalafellin merchant has bid you deliver a package to Odinel in Byregot's Strike.","You have delivered the package to Odinel, who goes on to bemoan the inconvenient location of Riridesu's shop. Though he is not alone in his frustration about the nunh's decision, it seems as though there is little to be done to change the U tribe leader's mind in matters of tradition."],"objectives":["Deliver the bundle of wrapped merchandise to Odinel."],"dialogue":[{"name":"RIRIDESU","text":"&lt;sigh&gt; I was <span class=\"emphasis\">all</span> set to open a shop in Forgotten Springs. Would've been glorious. An amazing location. A string of customers lined up. A bevy of beauties about. But the nunh of the tribe, U'odh Nunh, up and forbade it. Just like that."},{"name":"RIRIDESU","text":"Now, in a way, I understand it. The U kill or gather most of their own food, so they don't need what I'm offering. But surely, the nunh <span class=\"emphasis\">has</span> to see there's more to his oasis than his own tribe. Prospectors, adventurers, Flames...we just don't live or eat as they do!"},{"name":"RIRIDESU","text":"...But there I go again, getting on my soapbox. I might as well talk to you about something you <span class=\"emphasis\">can</span> help with. Could you take this package to Byregot's Strike, and get it to a fellow called Odinel?"},{"name":"ODINEL","text":"Well met, adventurer. A package! Came from the Minotaur Malm, did you?"},{"name":"ODINEL","text":"Thank you most kindly. The Malm's a poky kind of place─small as the dickens, and all manner of isolated to boot. Makes it tough to get up there and give Riridesu the custom he's due. Right shame about the nunh's decision. A store in the Springs would have been a kindness."},{"name":"ODINEL","text":"It's just a crying shame. And the worst part is there's no changing that old Miqo'te's mind─mostly on account of the fact he hasn't one."}],"reward":{"gil":1404,"xp":7600},"reqs":{"jobs":[{"lvl":31,"id":1}]}},"partials":[{"type":"npc","id":"1006290","obj":{"i":1006290,"n":"Riridesu","l":45,"q":2}},{"type":"npc","id":"1006294","obj":{"i":1006294,"n":"Odinel","l":45,"q":2}}]}