{"quest":{"name":"Who Moved My Headcheese","location":"Eastern La Noscea","id":66369,"patch":2.0,"sort":320,"eventIcon":71221,"issuer":1006269,"target":1006269,"genre":91,"journal":["Many a quarrel has been started over empty larders, and Kuzai Tazai fears that soon, acrimony will be the order of the day in Costa del Sol.","Kobolds have been making free with Costa del Sol's food supply, pilfering those morsels tastiest to their fastidious palates. Set a trap for them using the bloodstained sacks that Kuzai Tazai has given you.","You have laid the bloody trap. Wait at the specified location and strike when the kobolds come for the meaty bounty.","The kobolds perished hungry and surprised─not the worst way to go, all things considered. Return to Kuzai Tazai and tell him that the deed is done.","Kuzai Tazai is relieved to hear your report, but he is not as happy as you expected. There is news far more disturbing than a few missing bits of headcheese: the kobolds are apparently arming themselves for war."],"objectives":["Place bloodstained sacks at the specified locations.","Lie in wait and defeat the kobolds.","Report to Kuzai Tazai."],"dialogue":[{"name":"KUZAITAZAI","text":"I'm sorry, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>, we've no headcheese today. Why ever not? Because the kobolds are stealing food everywhere in Costa del Sol, that's why! The tomato pies, the mashed popotoes, and now the headcheese to boot!"},{"name":"KUZAITAZAI","text":"Now, I've an idea for ambushing those beady-eyed furballs, but I can't go off in case Master Dyrstweitz needs me. And I can't stand here and do nothing about it, either, as <span class=\"emphasis\">I'm</span> the one getting blamed for the missing eats!"},{"name":"KUZAITAZAI","text":"Might you be willing to solve this problem for me, adventurer? You look to have some spare time! I've placed the meats the kobolds like best in these five sacks. Line them up along the pier to the north, and they should come scurrying."},{"name":"KUZAITAZAI","text":"Those filthy ground dwellers fell for it? Hah, I knew it! I owe you a debt. Master Dyrstweitz will be pleased, too. And, more importantly, he shan't be hitting me with the pickle ladle so much!"},{"name":"KUZAITAZAI","text":"...Though between the two of us, it was I who ate the tomato pies... &lt;cough&gt; If Master Dyrstweitz actually knew anything about the kobolds, he would never have believed the creatures would eat such a thing!"},{"name":"KUZAITAZAI","text":"I do hope this is the end of their mischief...but I think not. From what I've observed, they seem to be readying for battle. And considering we've already got the Sahagin to deal with, I don't know that we need <span class=\"emphasis\">that</span> kind of trouble."},{"name":"POP","text":"Ravenous kobolds have found the meat!"}],"reward":{"gil":1690,"xp":7995},"reqs":{"jobs":[{"lvl":32,"id":1}],"quests":[66368]},"next":[66370]},"partials":[{"type":"npc","id":"1006269","obj":{"i":1006269,"n":"Kuzai Tazai","l":32,"q":2}},{"type":"quest","id":"66368","obj":{"i":66368,"n":"The Things We Do for Cheese","g":1,"l":"Eastern La Noscea","s":169}},{"type":"quest","id":"66370","obj":{"i":66370,"n":"Get a Grip","g":91,"l":"Eastern La Noscea","s":320}}]}