{"quest":{"name":"Survey Says","location":"Southern Thanalan","id":66360,"patch":2.0,"sort":310,"eventIcon":71221,"issuer":1006288,"target":1006288,"involved":[1006290,1006291,1006292],"genre":93,"journal":["People are talking, and U'khuba Tia would know what it is that they say.","As the time of the Choosing draws ever nearer, U'khuba Tia does not favor the notion that U'tykha Tia is seen by many as the next chief of the U tribe. He bids you speak with immigrants, and discover their hopes for Forgotten Springs.","You have spoken with three citizens newly immigrated to Forgotten Springs, and have found they all share some amount of discontentment at the lack of change. Return to U'khuba Tia and share with him their complaints.","U'khuba Tia responds to your words as though he has heard them before, acknowledging that the U tribe will have to break with tradition in order to evolve. Whether the incorporation of such changes will result in positive growth, however, is a question to which no one has an answer."],"objectives":["Speak with the people of Forgotten Springs.","Report your findings to U'khuba Tia."],"dialogue":[{"name":"UKHUBATIA","text":"I wouldn't spend too much time with U'tykha, adventurer. His strain of foolish cheer can be catching, and I've found it wise to never become <span class=\"emphasis\">too</span> happy. Happiness begets complacency, and it's only through discontentment that one rises to become more."},{"name":"UKHUBATIA","text":"This brings us to the issue of which one of us will next lead our tribe. Unlike U'tykha, the matter of who becomes the next nunh is one I take most seriously. Each of us represents a distinct vision for what lies ahead."},{"name":"UKHUBATIA","text":"You see, I am fascinated with the future. We cannot create it─but we <span class=\"emphasis\">can</span> be prepared for it. We <span class=\"emphasis\">can</span> profit from it. Or we <span class=\"emphasis\">can</span> perish by it. I need you to speak with immigrants, for they see Forgotten Springs through the eyes of opportunity, not loyalty."},{"name":"RIRIDESU","text":"I say more trade, fewer hindrances. Forgotten Springs is <span class=\"emphasis\">ideally</span> situated to be the waypoint for trade routes across the desert. If only the nunh would think to woo us merchants instead of outright <span class=\"emphasis\">rejecting</span> us..."},{"name":"DRIFTINGCLOUD","text":"Never did understand why they've so few bunks here. Ye see them miners pitchin' their tents down at Byregot's Strike? Ye think they <span class=\"emphasis\">want</span> to be holed up there? 'Course not! It's jus' they couldn't find an inn hereabouts that weren't full up."},{"name":"SIDIMUND","text":"A full-scale Amalj'aa attack would breach the defenses here within a day. With the lizardmen making so free of Zanr'ak of late, it would be for the good of all to have the Immortal Flames bolster the outpost here in Forgotten Springs."},{"name":"UKHUBATIA","text":"Fascinating, adventurer, very fascinating. They speak much truth to you, these immigrants. You are my ears on the street."},{"name":"UKHUBATIA","text":"All the voices cry out for Forgotten Springs to open its gates. If our tribe is to prosper, we must enjoy the coin and protection of immigrants and outlanders. When I am nunh, the old ways will have to give way to the new."}],"reward":{"gil":1404,"xp":7600},"reqs":{"jobs":[{"lvl":31,"id":1}]},"next":[66361]},"partials":[{"type":"npc","id":"1006288","obj":{"i":1006288,"n":"U'khuba Tia","l":45,"q":4}},{"type":"npc","id":"1006290","obj":{"i":1006290,"n":"Riridesu","l":45,"q":2}},{"type":"npc","id":"1006291","obj":{"i":1006291,"n":"Drifting Cloud","l":45,"q":1}},{"type":"npc","id":"1006292","obj":{"i":1006292,"n":"Sidimund","l":45,"q":1,"t":"Flame Captain"}},{"type":"quest","id":"66361","obj":{"i":66361,"n":"Tools of Office","g":93,"l":"Southern Thanalan","s":310}}]}