{"quest":{"name":"The Things We Do for Cheese","location":"Eastern La Noscea","id":66368,"patch":2.0,"sort":169,"icon":112007,"eventIcon":71201,"issuer":1006266,"target":1006266,"involved":[1006267,1006268],"genre":1,"journal":["Wheiskaet would like to tell you about the final ingredient needed for the banquet.","In truth, Wheiskaet never intended for you to collect the final ingredient. Brayflox, his former quartermaster, was planning to deliver it to Costa del Sol herself. However, something appears to have befallen Brayflox and her people, and Wheiskaet would have you travel to their settlement and offer your assistance. Speak with Ozun Nazun at Hidden Falls docks to receive directions to Raincatcher Gully, where Brayflox's Longstop can be found.","Ozun Nazun tells you to ride the ferry to the Raincatcher Gully docks, and from there make your way west towards the goblin settlement. Follow his instructions and see if you can locate Brayflox or one of her people.","Having been informed of your impending arrival, Brayflox quickly explains that a large flying beast has driven the goblins from their lands. If you wish to obtain the final ingredient, you must first help the goblins reclaim their territory.<br><br>※Challenge Brayflox's Longstop with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","In an epic battle that shall be forever remembered by goblin historians, you slay the invading dragon and return the displaced goblins to their beloved homes. Speak with Brayflox once more to claim your reward.","Brayflox proudly presents to you a hunk of gobbie gouda. Its unassuming appearance belies its powerful odor. Despite your overwhelming desire to throw it into the nearest river, endure the foul stench and bear it back to Wheiskaet at Costa del Sol.","Wheiskaet struggles to keep his composure as he accepts the goblin cheese. When pressed as to how the cheese is made, he replies that some things are best left unknown."],"objectives":["Speak with Ozun Nazun.","Speak with Brayflox Alltalks.","Enter Brayflox's Longstop.","Speak with Brayflox Alltalks.","Deliver the goblin cheese to Wheiskaet."],"dialogue":[{"name":"WHEISKAET","text":"Truth be told, I never intended for you to collect this last ingredient. Brayflox, my old quartermaster, wished to bring it to Costa del Sol herself."},{"name":"WHEISKAET","text":"However, not long ago, she sent word that there's been some trouble at the Longstop, and that the delivery would be delayed indefinitely. She told me nothing of the incident itself, but I fear the situation may be dire."},{"name":"WHEISKAET","text":"Though I would like nothing more than to aid her myself, I have no choice but to turn to you and your allies. Make haste to Hidden Falls docks and speak with Ozun Nazun. He will direct you to Raincatcher Gully, where Brayflox and her people have made their home."},{"name":"OZUNNAZUN","text":"What's the hurry, 'venturer? Eh? Somethin' happen over at the gobbie settlement?"},{"name":"OZUNNAZUN","text":"I dunno why yer so eager to help a bunch of beastmen, but go an' talk to the skipper over yonder. She'll ferry ye to Raincatcher Gully."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Tongueflaps of Wheiskaet be reaching ears of Brayflox. Uplander is come for tastyfresh gobbietreats, yes?"},{"name":"BRAYFLOX","text":"Questprize of uplander deep in Longstop. Flighty-beast chased gobbieflock from homes. Gobbieflock needs goodly uplander give safety to Longstop with much hand-lending!"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Brayflox cannot give what Brayflox does not have! Uplander and gobbieflock must first backtake Longstop!"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Goodly uplander has thanks of gobbieflock!"},{"name":"BRAYFLOX","text":"Flighty-beast was tricksy foe, but uplander outwitted with plansmaking. Uplander has goodly head for fighty-think."},{"name":"BRAYFLOX","text":"Brayflox happygives tastyfresh gobbietreats to clever uplander!"},{"name":"BRAYFLOX","text":"Cheese is stinkysweet gobbietreat! Specialmake with secret gobbiearts!"},{"name":"BRAYFLOX","text":"No party complete without gobbie gouda, Brayflox everysay!"},{"name":"WHEISKAET","text":"&lt;sniff&gt; &lt;sniff&gt; ...I gather you solved Brayflox's little problem?"},{"name":"WHEISKAET","text":"By the gods, that unholy stench! This is─ugh─definitely goblin cheese."},{"name":"WHEISKAET","text":"Judging from the smell, this should be quite flavorful."},{"name":"WHEISKAET","text":"Hm? How is it made? Ah...it's best you remain ignorant of such things. I still remember when I learned what kind of milk they use... &lt;shudder&gt;"}],"reward":{"gil":3802,"items":[{"id":3825,"one":1},{"id":27672,"one":1},{"id":3827,"one":1},{"num":2,"id":5825,"one":1}],"xp":15990,"instance":8},"reqs":{"jobs":[{"lvl":32,"id":130}],"quests":[66367]},"next":[66369,66371,66372,66375,66377,66378,69402]},"partials":[{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"npc","id":"1006267","obj":{"i":1006267,"n":"Ozun Nazun","l":32,"q":1}},{"type":"npc","id":"1006268","obj":{"i":1006268,"n":"Brayflox Alltalks","l":32,"q":2}},{"type":"item","id":"3825","obj":{"i":3825,"n":"Steel Sabatons","l":30,"c":46807,"t":38,"p":3588}},{"type":"item","id":"27672","obj":{"i":27672,"n":"Toadskin Boots","l":31,"c":49071,"t":38}},{"type":"item","id":"3827","obj":{"i":3827,"n":"Toadskin Leg Guards","l":30,"c":46323,"t":38,"p":2563}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"instance","id":"8","obj":{"i":8,"n":"Brayflox's Longstop","c":61801,"t":"Dungeons","min_lvl":32,"max_lvl":34}},{"type":"quest","id":"66367","obj":{"i":66367,"n":"There and Back Again","g":1,"l":"Southern Thanalan","s":168}},{"type":"quest","id":"66369","obj":{"i":66369,"n":"Who Moved My Headcheese","g":91,"l":"Eastern La Noscea","s":320}},{"type":"quest","id":"66371","obj":{"i":66371,"n":"Unrefined Methods","g":91,"l":"Eastern La Noscea","s":320}},{"type":"quest","id":"66372","obj":{"i":66372,"n":"Buffaloed All the Way","g":91,"l":"Eastern La Noscea","s":320}},{"type":"quest","id":"66375","obj":{"i":66375,"n":"What Do You Mean You Forgot the Wine","g":0,"l":"Eastern La Noscea","s":170}},{"type":"quest","id":"66377","obj":{"i":66377,"n":"Raptor 'round Your Little Finger","g":91,"l":"Eastern La Noscea","s":320}},{"type":"quest","id":"66378","obj":{"i":66378,"n":"Put a Cork in It","g":91,"l":"Eastern La Noscea","s":320}},{"type":"quest","id":"69402","obj":{"i":69402,"n":"What Do You Mean You Forgot the Wine","g":1,"l":"Eastern La Noscea","s":170}}]}