{"quest":{"name":"An Offer You Can Refuse","location":"Eastern La Noscea","id":66376,"patch":2.0,"sort":171,"eventIcon":71201,"issuer":1006305,"target":1006305,"involved":[1006306],"genre":1,"journal":["Shamani Lohmani would like to discuss wine with you.","Shamani Lohmani tells you that the only suitable wines for Master Gegeruju's banquet are in the possession of Byrglaent, who owns and operates the largest winery in Vylbrand. Introduce yourself to Byrglaent and explain your request.","Byrglaent is less than receptive to your requests, and instead offers to serve you goobbue urine. Deliver the bad news to Shamani Lohmani.","The neophyte vintner is disappointed but not surprised by Byrglaent's harsh refusal. It seems you must find another way to acquire wine for the banquet."],"objectives":["Speak with Byrglaent.","Speak with Shamani Lohmani."],"dialogue":[{"name":"SHAMANILOHMANI","text":"Life can be so delightfully unpredictable. I always had a passion for wine, but it wasn't until I was forced to retire that I could pursue it as more than a mere hobby."},{"name":"SHAMANILOHMANI","text":"It wouldn't have been possible if not for the savings I amassed during my time as a mercenary, of course. Say what you will about the nature of that work─none can deny that it pays well."},{"name":"SHAMANILOHMANI","text":"Ah, but you grow impatient, and Wheiskaet must have his wine. Herein lies the problem: nothing in my possession is of sufficient quality for this occasion."},{"name":"SHAMANILOHMANI","text":"The best vintages in town are hoarded by Byrglaent, who owns and operates the largest winery in Vylbrand."},{"name":"SHAMANILOHMANI","text":"Somehow, I doubt he will be receptive to your request, but given these circumstances we must needs beg his assistance."},{"name":"BYRGLAENT","text":"What rank amateur bottled this wine? The impurities have rendered it nigh undrinkable. Dismissal is too good for the man responsible─he should be made to drink every drop of his polluted swill!"},{"name":"BYRGLAENT","text":"What is it? I am in the middle of an important discussion, and I do not care for interruptions.<br>Hm? That neophyte vintner bid you speak with me? Hah!"},{"name":"BYRGLAENT","text":"Neither you nor your friend has the palate to appreciate the subtle qualities of my private stock."},{"name":"BYRGLAENT","text":"I would sooner serve you goobbue urine than sell you my worst vintage. Begone from my sight."},{"name":"SHAMANILOHMANI","text":"I take it he said no?<br>...Really, in those words? Hm, well, I cannot say that I am surprised."},{"name":"SHAMANILOHMANI","text":"While there's no denying his passion and skill, the Wine Baron of Limsa Lominsa is not a man known for his tact."},{"name":"SHAMANILOHMANI","text":"Very well. We shall have to take an alternative approach."}],"reward":{"gil":2000,"xp":15990},"reqs":{"jobs":[{"lvl":32,"id":130}],"quests":[69402]},"next":[66379]},"partials":[{"type":"npc","id":"1006305","obj":{"i":1006305,"n":"Shamani Lohmani","l":32,"q":9}},{"type":"npc","id":"1006306","obj":{"i":1006306,"n":"Byrglaent","l":32,"q":3}},{"type":"quest","id":"69402","obj":{"i":69402,"n":"What Do You Mean You Forgot the Wine","g":1,"l":"Eastern La Noscea","s":170}},{"type":"quest","id":"66379","obj":{"i":66379,"n":"It Won't Work","g":1,"l":"Eastern La Noscea","s":172}}]}