{"quest":{"name":"What Do You Mean You Forgot the Wine","location":"Eastern La Noscea","id":66375,"patch":2.0,"sort":170,"eventIcon":71201,"target":1006305,"involved":[1006272],"genre":0,"journal":["Wheiskaet would like to congratulate you on a job well done.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Wheiskaet in Costa del Sol.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Dyrstweitz gives you an order slip and bids you speak with Shamani Lohmani, a mercenary turned vintner, in Wineport. Travel to the settlement and search for the supplier.","Shamani Lohmani immediately deduces your intent with his impressive sense of smell. Having explained why he did so, he is now ready to discuss business."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Wheiskaet in Costa del Sol.</span>"],"dialogue":[{"name":"WHEISKAET","text":"Bravo, <span class=\"highlight\">Forename</span>. Thanks to you, our guests shall be honored with a marvelous banquet."},{"name":"WHEISKAET","text":"But what good is an exotic feast without an equally exquisite aperitif?"},{"name":"WHEISKAET","text":"Aye, your work is not yet finished. Before we can discuss Titan, you must first bring us a suitable wine. Speak with Dyrstweitz over yonder─he is overseeing preparations for the banquet, and will tell you what you must do."},{"name":"DYRSTWEITZ","text":"Beg your pardon, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but I've got my hands full with─ Oh, you're the adventurer sent to pick up the wine! Thank the gods, we've nothing on hand that will meet with Master Gegeruju's approval."},{"name":"DYRSTWEITZ","text":"Take this order slip and run along to Wineport. One of Wheiskaet's friends from the old days, Shamani Lohmani, is our supplier."},{"name":"DYRSTWEITZ","text":"Who'd've thought that a former mercenary would have such refined tastes, eh? Everyone here agrees that he's a natural vintner. If you're lucky, maybe he'll let you have a taste!"},{"name":"SHAMANILOHMANI","text":"...Sweat, grime, and blood. Aye, you reek of blood. An adventurer, unless I am mistaken. What brings you to Wineport?"},{"name":"SHAMANILOHMANI","text":"An order? Let me guess─a request for the finest vintage I can muster."},{"name":"SHAMANILOHMANI","text":"&lt;sniff&gt; &lt;sniff&gt; The paper smells of loam and perfume. Costa del Sol. And there is also the─&lt;cough&gt;─unmistakable odor of goblin cheese..."},{"name":"SHAMANILOHMANI","text":"Yes, Master Gegeruju would not settle for anything less than the best. Dyrstweitz and his crew must be quite busy preparing an exotic feast, hence his decision to rely on an adventurer."},{"name":"SHAMANILOHMANI","text":"Ah, but perhaps you are confused. This display of deduction was not intended to impress you."},{"name":"SHAMANILOHMANI","text":"When one loses his vision, he is forced to compensate in other ways. But you've no interest in my affairs─you wish only to discuss the wine, I suspect."}],"reward":{"xp":15990},"reqs":{"jobs":[{"lvl":32,"id":130}],"quests":[66368]}},"partials":[{"type":"npc","id":"1006305","obj":{"i":1006305,"n":"Shamani Lohmani","l":32,"q":9}},{"type":"npc","id":"1006272","obj":{"i":1006272,"n":"Dyrstweitz","l":32,"q":2}},{"type":"quest","id":"66368","obj":{"i":66368,"n":"The Things We Do for Cheese","g":1,"l":"Eastern La Noscea","s":169}}]}