{"quest":{"name":"Put a Cork in It","location":"Eastern La Noscea","id":66378,"patch":2.0,"sort":320,"eventIcon":71221,"issuer":1006306,"target":1006306,"genre":91,"journal":["Byrglaent, the master vintner of Wineport, is having difficulty acquiring good cork.","Byrglaent is nearly apoplectic over the quality of the cork he has been supplied. Not willing to settle for anything less than first-rate, he has bid you slay five cork bulbs.","You have slain five cork bulbs and ripped the quality cork from their lifeless corpses. Deliver the haul to Byrglaent in Wineport.","The master vintner extols the virtues of the high-quality cork you have acquired. However, he cannot help but lament over his own staff's lack of ability when it comes to gathering the material themselves."],"objectives":["Gather impeccable cork from cork bulbs.","Give the cork to Byrglaent."],"dialogue":[{"name":"BYRGLAENT","text":"You call this cork? Pah! This sad, squelchy thing isn't fit to kiss my back end, let alone my fine whites and reds. I'd say you should try again, except that I wouldn't trust you with the <span class=\"emphasis\">worst</span> of vintages now. You're dead to me!"},{"name":"BYRGLAENT","text":"<span class=\"emphasis\">You</span>! Adventurer! I've had it trying to get quality from my own lot. Show this oaf how it's done and bring me the materials you find off cork bulbs. Harvesting five of them should do. Time flies and uncorked wine sours! Go, go!"},{"name":"BYRGLAENT","text":"Where is that cork I asked for? If you believe that loitering will secure you a glass of something, you are very much mistaken. <span class=\"emphasis\">And</span> possibly dead to me!"},{"name":"BYRGLAENT","text":"Now <span class=\"emphasis\">this</span> seems like some fine cork. Hmmm, just the right amount of give...some air comes through, but not the moisture. I should be so lucky as to have barrels full of this. If only <span class=\"emphasis\">my</span> people were as efficient at finding it..."}],"reward":{"items":[{"id":3835,"one":1},{"id":3833,"one":1},{"num":3,"id":5825,"one":1}],"xp":7995},"reqs":{"jobs":[{"lvl":32,"id":1}],"quests":[66368]}},"partials":[{"type":"npc","id":"1006306","obj":{"i":1006306,"n":"Byrglaent","l":32,"q":3}},{"type":"item","id":"3835","obj":{"i":3835,"n":"Steel Scale Greaves","l":32,"c":46870,"t":38}},{"type":"item","id":"3833","obj":{"i":3833,"n":"Steel-plated Jackboots","l":32,"c":46836,"t":38,"p":2982}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66368","obj":{"i":66368,"n":"The Things We Do for Cheese","g":1,"l":"Eastern La Noscea","s":169}}]}