{"quest":{"name":"Bird's-eye View","location":"Eastern La Noscea","id":66388,"patch":2.0,"sort":330,"eventIcon":71221,"issuer":1006273,"target":1006273,"involved":[1006320],"genre":91,"journal":["Ever capricious, Master Gegeruju demands to know how his colibri are faring.","It seems poachers are luring the colibri northward with feed. Speak with them, but beware, for they bear you little love.","The poachers say they are well within their rights to hunt the birds. Place the roselles along the specified trail to lure the colibri back.","You have placed the flowers along the specified trail. Speak with the angry poachers again.","Costa del Sol, jewel of the coast─and once a pioneer town built by the selfsame men now reduced to poaching colibri. Report the discovery to Master Gegeruju.","The clash over the colibri is over. Both sides have their story, and each are convinced of the other's baseness. You are of course simply the messenger─or have you unknowingly chosen a side?"],"objectives":["Speak with the pitiless poacher.","Place bouquets of Oschon roselles along the specified trail.","Speak with the pitiless poacher.","Report to Master Gegeruju."],"dialogue":[{"name":"GEGERUJU","text":"You see all those wild colibri? Not one of them was originally here─though the alchemical question of where <span class=\"emphasis\">here</span> is, that's something we can munch many almonds over. 'Twas I that bred, fed, and released the birds."},{"name":"GEGERUJU","text":"So of course, they are still <span class=\"emphasis\">mine</span>. Or, if they belong to themselves, certainly no one else owns them. At least not more than I own them. Where was I? Oh yes, <span class=\"emphasis\">my</span> colibri are being poached!"},{"name":"GEGERUJU","text":"The miscreants hang just outside the boundary of Costa del Sol─sly, sly─and entice the colibri with feed. They should not be doing such a thing, such an ungentlemanly thing. Won't you parley with them?"},{"name":"GEGERUJU","text":"And if you can't talk sense to them, we'll just have to lure the birds back using these flowers. My colibri love roselle nectar, I happen to know. Why? Because I bred them and fed them!"},{"name":"POACHER","text":"Back off, this is Bloodshore. We're not in Costa del Sol, and that means we don't have to live by your master's say-so!"},{"name":"POACHER","text":"Yeah, Bloodshore's not a part of his little fiefdom! We're free folk here, not bought 'n' paid for like the lot in Costa."},{"name":"POACHER","text":"Damn that Gegeruju... He thinks he can buy everything. We built Costa del Sol by the sweat of our brows, did he tell you that? I know every cobble of the streets, laid 'bout half of them myself. It was a pioneer town, a good town."},{"name":"POACHER","text":"Then that moneybags swooped in and took it all. Stay as a lackey or leave as a free man, those were the pickings. Then he took the beach─no more fishing without his say-so. And now he takes the colibri."},{"name":"POACHER","text":"He leaves us nothing. We came out here with a bit, built a town, and now we have nothing. Know why the poor get poorer? It's because the rich get a <span class=\"emphasis\">notion</span> to get richer. Every time Gegeruju gets that notion, he sends out someone like you to take another thing away from us."},{"name":"GEGERUJU","text":"Ha, that settles their hash. And now, they have yet another bone to pick with me. The Twelve know I have many a skeleton in my closet─don't read too much into that, m'dear─but those settlers have quite the ossuary!"},{"name":"GEGERUJU","text":"Costa del Sol was Admiral Merlwyb's hobby-horse. She had an idea to settle this area and so brought a number of folk on indenture. The terms were <span class=\"emphasis\">very</span> generous. Hardly anyone died, a credit to her leadership."},{"name":"GEGERUJU","text":"Yes, very creditable. But she had no head for business─kept trying to farm this salty land. I stepped in and saved her from ruin. You see Costa del Sol now, a jewel of commerce and culture, but I assure you it was not thus when I purchased it."},{"name":"GEGERUJU","text":"Many of the settlers have stayed and prospered! Why, a good third of my household was once raw pioneer. But, some people are like figs─they want to stay the same. Tiresome, I say. They've no one to blame but themselves."}],"reward":{"items":[{"id":27654,"one":1},{"id":2767,"one":1},{"id":27668,"one":1},{"num":4,"id":5825,"one":1}],"xp":8190},"reqs":{"jobs":[{"lvl":33,"id":1}],"quests":[66387]}},"partials":[{"type":"npc","id":"1006273","obj":{"i":1006273,"n":"Gegeruju","l":32,"q":7}},{"type":"npc","id":"1006320","obj":{"i":1006320,"n":"Pitiless Poacher","l":32,"q":1}},{"type":"item","id":"27654","obj":{"i":27654,"n":"Steel Headgear","l":32,"c":40543,"t":34}},{"type":"item","id":"2767","obj":{"i":2767,"n":"Skull Eyepatch","l":33,"c":40892,"t":34,"p":3087}},{"type":"item","id":"27668","obj":{"i":27668,"n":"Silver Monocle","l":32,"c":40906,"t":34}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66387","obj":{"i":66387,"n":"The Wind, It Passes","g":91,"l":"Eastern La Noscea","s":330}}]}