{"quest":{"name":"Not My War","location":"Eastern La Noscea","id":66383,"patch":2.0,"sort":175,"eventIcon":71201,"target":1006312,"genre":0,"journal":["Drest has calmed down and is now willing to talk.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Drest at the Severed String.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have successfully skinned four jungle coeurls. Deliver their hides to Drest.","The hermit confesses that he is an imperial deserter, though he himself is not Garlean. The Empire conquered his native lands, and he holds no ill will towards the people of Eorzea. Nevertheless, he had no choice but to come to Vylbrand, where he now toils in secret so that one day he might return home."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Drest at the Severed String.</span>"],"dialogue":[{"name":"DREST","text":"Do...do you have any children? I've a...a son and a daughter. They were so little when I left... They probably think I'm dead."},{"name":"DREST","text":"I've been saving for years to...to buy passage back home somehow. But...still not enough. Maybe...maybe you could bring me some jungle coeurl skins? I...I can sell them. I just...I just want to go home..."},{"name":"DREST","text":"Please... Even a few skins would help..."},{"name":"DREST","text":"You...you helped me. Even after what my comrades and I did to your country..."},{"name":"DREST","text":"We were on a reconnaissance mission when the Maelstrom caught us by surprise. We tried to escape, but the others... N-No one else survived."},{"name":"DREST","text":"I didn't ask for this, dammit! I'm not even Garlean! They conquered my lands just like they tried to conquer yours!"},{"name":"DREST","text":"I...I don't want to die in some blasted jungle halfway around the world..."},{"name":"DREST","text":"I just...I just want to go home..."}],"reward":{"xp":16380},"reqs":{"jobs":[{"lvl":33,"id":130}],"quests":[66382]}},"partials":[{"type":"npc","id":"1006312","obj":{"i":1006312,"n":"Drest","l":32,"q":6}},{"type":"quest","id":"66382","obj":{"i":66382,"n":"That Weight","g":1,"l":"Eastern La Noscea","s":174}}]}