{"quest":{"name":"In the Company of Heroes","location":"Eastern La Noscea","id":66391,"patch":2.0,"sort":179,"icon":100132,"eventIcon":71201,"issuer":1006676,"target":1006676,"involved":[1006266,1006314,1006316,1006317,1006318,1006319],"genre":1,"journal":["Y'shtola is concerned for your well-being.","In a wholly unexpected turn of events, Wheiskaet reveals that the banquet preparations were but an excuse for his comrades to evaluate your worthiness to face Titan. The other former members of the Company of Heroes are also in attendance, and the five warriors all agree that you have the necessary qualities to defeat the Lord of Crags. Their assessment now formally concluded, Wheiskaet decrees that all present should enjoy the festivities. Be sure to thank the bronze-skinned beauty for the dazzling performance being given by her troupe.","After congratulating you on your accomplishments, the troupe leader encourages you to partake of the feast with the other guests.","It would seem Dyrstweitz's reputation as a culinarian is well founded, as the feast exceeds all expectation. Having sated your hunger, converse with the former members of the Company of Heroes.","You listen carefully to the parting words of each former mercenary, and accord them due respect. All present seem to have enjoyed themselves immensely, save perhaps for Y'shtola who seems loath to carouse with the other guests. Maybe you should inquire as to the cause of her reticence.","Y'shtola observes that the festivities were as much for the benefit of the Company of Heroes as they were for you. Nevertheless, you have satisfied Wheiskaet's conditions, and may now ask him how to reach Titan's lair."],"objectives":["Speak with the bronze-skinned beauty.","Partake of the feast.","Speak with the former members of the Company of Heroes.","Speak with Y'shtola."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"YSHTOLA","text":"...You have the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who has been to the seventh hell and back."},{"name":"YSHTOLA","text":"That a guest should be expected to supply the victuals for a banquet held in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own honor... And this while the shadow of Titan looms over us all! It beggars belief."},{"name":"YSHTOLA","text":"I can only applaud your stoicism. Had I been asked to endure such ignominy, I fear I should have accepted my lot with less grace."},{"name":"GEGERUJU","text":"Lady Y'shtola! <span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Surname</span>!"},{"name":"GEGERUJU","text":"A thousand pardons for this extreme discourtesy! I was wholly unaware of your true identity, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Had I known, I would <span class=\"emphasis\">never</span> have permitted my man to subject you to such unspeakable ordeals!"},{"name":"WHEISKAET","text":"(-???-)Come now, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> must have sensed something was amiss."},{"name":"WHEISKAET","text":"You didn't seriously think I would send you running the length and breadth of Eorzea for a <span class=\"emphasis\">banquet</span>, did you?"},{"name":"YSHTOLA","text":"Spare <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> your mockery, Captain. Your intent was unclear to me until this moment. And unlike me, <span class=\"highlight\">Forename</span> has no knowledge of your traditions. Mayhap you would be so good as to enlighten <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"WHEISKAET","text":"Aye, aye...fair's fair. There's no sense hiding it any longer."},{"name":"WHEISKAET","text":"We five were chosen by our brothers and sisters, and before the Company of Heroes disbanded, we each swore a solemn oath..."},{"name":"WHEISKAET","text":"That any who would follow in our footsteps must be weighed and measured─not by their reputation, but by their deeds."},{"name":"WHEISKAET","text":"Each man would judge these would-be god-slayers by his own criteria. If even one found <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> wanting, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would be rejected without a second thought."},{"name":"WHEISKAET","text":"But if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> proved <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> worthy, we swore that we would do our utmost to support <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> cause."},{"name":"WHEISKAET","text":"The world has ever been full of brave souls eager to give their lives for a righteous cause, but all too few capable of making a difference with their sacrifice. To send wave after wave of hapless adventurers into the jaws of a foe against whom they have no hope of victory is worse than futile. Titan is not one to be challenged lightly, and we will not be complicit in the deaths of the unworthy."},{"name":"YSHTOLA","text":"Which is why the five of you deigned to test <span class=\"highlight\">Forename</span> with such <span class=\"emphasis\">commendable</span> thoroughness. Time well spent, I am sure. But tell us, Captain: what is the assessment of you and your fellows?"},{"name":"LANDENEL","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s a brave one, that much is certain. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> willingly walked into the midst of danger, despite my repeated warnings that it could cost <span class=\"alternative-container\"><span class=\"alternative\">her her</span><span class=\"alternative\">him his</span></span> life."},{"name":"UODHNUN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> skill is undeniable. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> stalked <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> prrrey as relentlessly as any child of the sands, and struck with precision when an opportunity presented itself."},{"name":"SHAMANILOHMANI","text":"Too many adventurers these days care only for fortune and glory. <span class=\"highlight\">Forename</span>, however, is a kind and generous soul. I am certain <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has no shortage of loyal allies who will gladly fight at <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> side."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Wily uplander is talentful plansmaker. Tricksy foe for mighty rockman!"},{"name":"WHEISKAET","text":"I can only concur with my colleagues' assessments."},{"name":"WHEISKAET","text":"We five of the Company of Heroes hereby judge you a worthy challenger. Cast down the Lord of Crags, <span class=\"highlight\">Forename Surname</span>, and write a new chapter in the history of Eorzea."},{"name":"WHEISKAET","text":"With the formalities out of the way, let the festivities begin! Summon the dancers, pour the wine!"},{"name":"WHEISKAET","text":"Eat, drink, and be merry, my friends, for today we celebrate the birth of a new legend─<span class=\"highlight\">Forename Surname</span>, Titan's Bane!"},{"name":"COMPANYOFHEROES","text":"(-Company of Heroes-)<span class=\"highlight\">Forename Surname</span>, Titan's Bane!"},{"name":"LANDENEL","text":"Seeing everyone again like this brings back such fond memories. Hmmm...I wonder if any of them would be interested in reforming the Company?"},{"name":"UODHNUN","text":"It has been too long since I last set foot outside Forgotten Springs. Passing the time with old frrriends and old wine... Aye, today is a good day indeed."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Tastyfresh treats are plentiful in belly of Brayflox!"},{"name":"SHAMANILOHMANI","text":"It feels wonderful to be with the others again. I wish this day would never end..."},{"name":"NPC","text":"(Your Elezen friend is quite the dashing rogue. Any chance you could introduce me?)"},{"name":"NPC","text":"Congratulations, sweetling! Now relax and enjoy the show─it's only just begun!"},{"name":"SYSTEM","text":"Tasting the exotic feast triggers a divine revelation. In that brief, transcendent moment, you glimpse the true form of reality, comprehend its fleeting nature, and cry out to the heavens in celebration."},{"name":"WHEISKAET","text":"You are blessed with a fortitude to rival the earth itself. Titan will struggle to break you, I think."},{"name":"LANDENEL","text":"Ah, <span class=\"highlight\">Forename</span>, you brave fool! Promise me that when you meet Titan, you'll look him in the eye and tell him Landenel sends his regards!"},{"name":"UODHNUN","text":"You are a veteran of countless battles, <span class=\"highlight\">Forename</span>. This is but one more. Trrrust in your experience, and you will prevail."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Goodly uplander must be facing mighty rockman with clever fighty-think. Gobbieflock cannot be coming to rescue this time!"},{"name":"SHAMANILOHMANI","text":"When you face the Lord of Crags, think not of Limsa Lominsa, Eorzea, or anything beyond his chamber. Think only of the men and women by your side."},{"name":"SHAMANILOHMANI","text":"Fight for them, and they will fight for you. Remember that no great victory was ever achieved alone."},{"name":"YSHTOLA","text":"...You are kind to indulge them, <span class=\"highlight\">Forename</span>. This banquet is as much for the Company as it is for you, whatever they may claim."},{"name":"YSHTOLA","text":"I do not deny that they mean well, but now is scarcely the time for celebration. Though they have all but pronounced you the victor, the battle with Titan has yet to begin. The hour has come for the good captain to make good on his promise. We must speak with him again."}],"reward":{"gil":1377,"xp":16380},"reqs":{"jobs":[{"lvl":33,"id":130}],"quests":[66386]},"next":[66392]},"partials":[{"type":"npc","id":"1006676","obj":{"i":1006676,"n":"Y'shtola","l":32,"q":1}},{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"npc","id":"1006314","obj":{"i":1006314,"n":"Bronze-skinned Beauty","l":32,"q":1}},{"type":"npc","id":"1006316","obj":{"i":1006316,"n":"U'odh Nunh","l":32,"q":1}},{"type":"npc","id":"1006317","obj":{"i":1006317,"n":"Landenel","l":32,"q":1}},{"type":"npc","id":"1006318","obj":{"i":1006318,"n":"Brayflox Alltalks","l":32,"q":1}},{"type":"npc","id":"1006319","obj":{"i":1006319,"n":"Shamani Lohmani","l":32,"q":1}},{"type":"quest","id":"66386","obj":{"i":66386,"n":"It Was a Very Good Year","g":1,"l":"Eastern La Noscea","s":177}},{"type":"quest","id":"66392","obj":{"i":66392,"n":"As You Wish","g":1,"l":"Eastern La Noscea","s":180}}]}