{"quest":{"name":"A Final Ignominy","location":"Eastern La Noscea","id":66390,"patch":2.0,"sort":178,"eventIcon":71201,"target":1006266,"involved":[1006272],"genre":0,"journal":["Wheiskaet requires your assistance with the banquet.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Y'shtola in Costa del Sol.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Dyrstweitz has asked you to lay out the food, drink, and decorations for the banquet. Do your utmost to create an aesthetically pleasing floral arrangement.","Given the skill with which you decorated the feasting table, none would fault you if you chose to abandon adventuring and become a professional florist. Next, unleash your inner tavernkeep and position the bottles in ideal locations.","Dyrstweitz eyes you with suspicion as you arrange the wine with alarming alacrity. Perhaps he believes you to have designs on his job. In any case, it may be best for you to portion out the feast quickly so you may excuse yourself before things become awkward.","The banquet is ready, and your work is complete. Report to Wheiskaet, and pray that he has no further requests to make.","Wheiskaet declares that since both guests are now present, the banquet can be held as planned. Noting your confusion, he suggests that you speak with the scholarly associate seated on the bench nearby."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Y'shtola in Costa del Sol.</span>"],"dialogue":[{"name":"WHEISKAET","text":"I hate to impose further after everything you've done, but would you mind helping Dyrstweitz lay out the banquet?"},{"name":"WHEISKAET","text":"Our guests of honor are already here in Costa del Sol, and so Master Gegeruju has demanded that we finish preparations immediately."},{"name":"WHEISKAET","text":"Hm? The guests? Oh, I'm told that one is a beautiful Miqo'te scholar. Personally, I'm more curious about her companion, some famous adventurer with an endless list of accomplishments."},{"name":"WHEISKAET","text":"But you can judge for yourself soon enough."},{"name":"WHEISKAET","text":"Anyway, go and lend Dyrstweitz a hand. The poor man is liable to collapse from the stress."},{"name":"DYRSTWEITZ","text":"Perfect timing, <span class=\"highlight\">Forename</span>! Take all of this and arrange it on the counter!"},{"name":"DYRSTWEITZ","text":"No time to chat─they'll be here any minute!"},{"name":"WHEISKAET","text":"Excellent timing, <span class=\"highlight\">Forename</span>. Now that both our guests are present, the feast can begin!"},{"name":"WHEISKAET","text":"Where are they, you ask? Why don't you ask your associate? I'm sure she'll be happy to explain."}],"reward":{"xp":16380},"reqs":{"jobs":[{"lvl":33,"id":130}],"quests":[66386]}},"partials":[{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"npc","id":"1006272","obj":{"i":1006272,"n":"Dyrstweitz","l":32,"q":2}},{"type":"quest","id":"66386","obj":{"i":66386,"n":"It Was a Very Good Year","g":1,"l":"Eastern La Noscea","s":177}}]}