{"quest":{"name":"Lord of Crags","location":"Upper La Noscea","id":66393,"patch":2.0,"sort":181,"icon":100133,"eventIcon":71201,"issuer":1006341,"target":1006343,"involved":[1007712],"genre":1,"journal":["Riol is waiting for you to give him your undivided attention.","Riol reveals that the Company of Heroes reached Titan not by fighting their way through the mines of O'Ghomoro, but by using a beastman aetheryte. In this way, they bypassed the kobolds' defenses and traveled to the heart of Titan's sanctuary, aided by an unnamed Sharlayan. Search for the beastman aetheryte in Zelma's Run.","In the absence of Sharlayan technology, Y'shtola must remain behind to amplify the power of the aetheryte in Zelma's Run. At long last, the time has come for you to follow in the footsteps of the Company of Heroes and face the Lord of Crags.<br><br>※Challenge the Navel with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the trial's entrance point.","In a moment that shall forever be enshrined in the annals of Eorzean history, you slay the Lord of Crags and spare Limsa Lominsa his terrible vengeance. In the aftermath, you sense a dark, stifling presence watching you. The feeling does not last long, however, and you are left to wonder if it was anything more than the fancy of a weary mind. Just then, Y'shtola appears to teleport you back to the beastman aetheryte, instructing you to rendezvous with her at Camp Bronze Lake.","You return to Camp Bronze Lake to find Y'shtola waiting for you. Ever businesslike, she promptly suggests that the two of you discuss how best to proceed."],"objectives":["Examine the beastman aetheryte.","Confront Titan in the Navel.","Rendezvous with Y'shtola at Camp Bronze Lake."],"dialogue":[{"name":"RIOL","text":"Years ago, when we was weighin' up how to get to Titan, one of our scouts stumbled across this beastman aetheryte, see..."},{"name":"RIOL","text":"Eh? What's that look for? Not familiar with 'em?"},{"name":"YSHTOLA","text":"He speaks of an unamplified aetheryte which has been claimed by a beast tribe. Lest you wonder, there is no fundamental difference between such aetherytes and those which you have used on countless occasions, <span class=\"highlight\">Forename</span>."},{"name":"RIOL","text":"Ah, well if it ain't the Sharlayan lass. Welcome back."},{"name":"YSHTOLA","text":"Forgive me for interrupting. I had planned to await your report, but I succumbed to curiosity."},{"name":"YSHTOLA","text":"The tunnels beneath O'Ghomoro form a bewildering labyrinth that no outsider has ever fully explored. How the Company of Heroes managed to navigate it is a mystery I have long pondered."},{"name":"RIOL","text":"Ha! Give us a bit of credit, love! We weren't daft enough to try goin' in the front."},{"name":"RIOL","text":"The kobolds are always diggin' new tunnels an' fillin' the old ones with traps. One wrong step, an' the next thing you know, ye've got a hundred tonzes o' rock on your noggin. Suicide to even try, see?"},{"name":"RIOL","text":"Funny thing was, the kobolds didn't seem to have no trouble findin' their way 'round─an' it was <span class=\"emphasis\">that</span> as got us thinkin'. I mean, U'Ghamaro Mines are like a bleedin' <span class=\"emphasis\">city</span>, ain't they? An' gettin' around in a city that big would be a right pain in the arse if you didn't have an Aethernet, wouldn't it? So it stood to reason that the kobolds must have one, didn't it?"},{"name":"YSHTOLA","text":"Hm. Even if there were aetheryte shards in the depths of O'Ghomoro, you would have needed to attune yourselves to them before you could identify their signatures within the Lifestream."},{"name":"RIOL","text":"Ah, well, that's where yer wrong, love. We had this Sharlayan bloke to help us, see. Delivered us right into Titan's bedchamber, he did."},{"name":"RIOL","text":"I don't rightly know how he did it, but I <span class=\"emphasis\">do</span> remember him sayin' it weren't nothin' any Sharlayan scholar worth her salt couldn't manage."},{"name":"YSHTOLA","text":"<span class=\"emphasis\">...Did he now</span>? Hmph.<br>Locating a beacon in the absence of a known signature might be possible if the aetherytes in question happened to be... Ah, yes. But in order to guide a traveler to said beacon safely, a second party would be required to... Hmmm."},{"name":"YSHTOLA","text":"It is possible─in theory at least. Yet I cannot be certain until I try. Plainly, all will depend upon whether or not I am “worth my salt.”"},{"name":"RIOL","text":"Oh, you are, lass! Don't you worry about that! Have a bit o' faith in yerself!"},{"name":"RIOL","text":"Why don't we all go to Zelma's Run an' take a closer look at the aetheryte? It ain't far─though there's sure to be a few kobolds blockin' the way. Naught ye can't handle, mind!"},{"name":"YSHTOLA","text":"So this is the aetheryte the Company of Heroes used to gain access to Titan's sanctuary."},{"name":"YSHTOLA","text":"Hm. It is as Papalymo speculated."},{"name":"YSHTOLA","text":"In its present state, this aetheryte's signal will not be strong enough for our purposes. I may, however, be able to use my own energies to amplify it. Alas, the task will monopolize my attention for the duration."},{"name":"YSHTOLA","text":"It seems you will have to proceed without me, <span class=\"highlight\">Forename</span>. I must needs remain here and supplement this beacon's power, lest you be denied your only path of escape."},{"name":"YSHTOLA","text":"Fear not: I will summon the Maelstrom forces stationed nearby to protect us."},{"name":"YSHTOLA","text":"With effort, it is possible that I may be able to stabilize the aetheryte's signal and thereby join you, albeit belatedly. Until such time as I do, you will be on your own."},{"name":"YSHTOLA","text":"Now...let us see if I <span class=\"emphasis\">am</span> worth my salt."},{"name":"YSHTOLA","text":"I have located another beacon─one far below the mountain. I can only speculate as to what you will find there, so stint not in your preparation."},{"name":"SCAREDKOBOLD","text":"Look, an overdweller! Yes, yes, an invader from above! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> uses our aetherytes against us!"},{"name":"ANGRYKOBOLD","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has defiled Titan's sacred sanctuary─trespassed, violated, defiled!"},{"name":"KOBOLDS","text":"(-Kobolds-)Overdwellers must leave! Overdwellers must fly!"},{"name":"ZADA","text":"Brothers and sisters, fear <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> not! <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> fate shall be decided by the Lord of Crags!"},{"name":"ZADA","text":"Hear me, overdweller! You and your treacherous brethren must be held to account for the breaking of the covenant!"},{"name":"ZADA","text":"You shall be first to face judgment! Then Limsa Lominsa and her oathbreakers─liars, betrayers, oathbreakers!"},{"name":"ZADA","text":"O Great Father, Lord of Crags! Titan, we summon You! Titan, we summon You!<br>O Great Father, Lord of Crags! Titan, we summon You! Titan, we summon You!"},{"name":"KOBOLDS","text":"(-Kobolds-)He is come! He is come! The Lord of Crags, Titan is come!"},{"name":"TITAN","text":"Overdweller...art thou deaf to their weeping?"},{"name":"TITAN","text":"Thy vile kind coveteth ever the blessing of the land and murdereth my children by the score─all in service to greed. Such sins are beyond pardon."},{"name":"TITAN","text":"Ah...but I am not the first to suffer thy defiance. Thou didst bring Ifrit low."},{"name":"TITAN","text":"Godless overdweller! Thy myriad heresies shall not go unpunished! Upon thee shall I wreak a terrible vengeance!"},{"name":"KOBOLDS","text":"(-Kobolds-)The Lord of Crags, Great Father Titan has fallen!"},{"name":"ZADA","text":"The crimes of the overdwellers shall never be forgiven! Never be forgotten! No, no, never!"},{"name":"ZADA","text":"'Twas your kin who broke the covenant! We have acted only in defense of our lands!"},{"name":"ZADA","text":"Cease your aggression, or never will there be peace! Until our dying breaths, we shall defy you─deny, decry, defy!"},{"name":"NERO","text":"Now <span class=\"emphasis\">these</span> are the readings one would expect of an eikon..."},{"name":"NERO","text":"I have seen enough. We proceed as planned."},{"name":"RHITAHTYN","text":"(-???-)Are you sure that is wise, my lord? Your...curiosity is untested and unproven. We do not yet know its true capabilities."},{"name":"NERO","text":"Then trust in mine, Rhitahtyn. My <span class=\"emphasis\">curiosity</span>, as you so eloquently put it, would have bested Titan in the blink of an eye."},{"name":"NERO","text":"Why, if there be truth to the legends, it could readily subjugate the whole of Eorzea given but a little while longer. Is that not so?"},{"name":"LAHABREAEORZEA","text":"It is. No greater single power has ever been conceived, much less realized."},{"name":"RHITAHTYN","text":"What you say may well be true. But while such devices may win battles, I do not believe they will serve to change the course of this war."},{"name":"NERO","text":"Oh but they will. Have a little faith, my friend."},{"name":"RHITAHTYN","text":"...I cannot endorse this course of action."},{"name":"LAHABREAANCIENT","text":"<span class=\"highlight-purple\">...Fool.</span>"},{"name":"LAHABREAANCIENT","text":"<span class=\"highlight-purple\">And now <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has a fourth. Fascinating.</span>"},{"name":"LAHABREAANCIENT","text":"<span class=\"highlight-purple\">Carry on, crystal bearer. Far though you have come, your work is far from done.</span>"},{"name":"YSHTOLA","text":"And naught remained to mark his passing..."},{"name":"YSHTOLA","text":"Well, the Ascians are nothing if not elusive. It is of little wonder that they should cast advanced teleportation magicks at will."},{"name":"YSHTOLA","text":"But that they would choose to consort with the <span class=\"emphasis\">Empire</span>..."},{"name":"YSHTOLA","text":"What common goal could they possibly share...? "},{"name":"YSHTOLA","text":"I feared I might arrive too late, but I see you had the matter well in hand."},{"name":"YSHTOLA","text":"I have taken measures to ensure that we are not pursued, yet I cannot say how long they will hold."},{"name":"YSHTOLA","text":"Take your leave while the kobolds are still in disarray. I will follow anon. There is something I must investigate before I depart."},{"name":"YSHTOLA","text":"I will teleport you to the aetheryte in Zelma's Run, and we will rendezvous at Camp Bronze Lake. Agreed?"},{"name":"YSHTOLA","text":"I am relieved to see you well. But come, let us discuss our next step."},{"name":"YSHTOLA","text":"I must needs remain here to ensure that you have a means of egress. As I told you, we have no way of knowing what awaits you at the beacon, so be sure to prepare yourself prior to departing."}],"reward":{"gil":2653,"items":[{"num":3,"id":4552},{"num":3,"id":4556}],"xp":16770,"instance":20002},"reqs":{"jobs":[{"lvl":34,"id":130}],"quests":[66392]},"next":[66053,66394,66396,66398,66402,66403]},"partials":[{"type":"npc","id":"1006341","obj":{"i":1006341,"n":"Riol","l":34,"q":2}},{"type":"npc","id":"1006343","obj":{"i":1006343,"n":"Y'shtola","l":34,"q":2}},{"type":"npc","id":"1007712","obj":{"i":1007712,"n":"Y'shtola","l":34,"q":1}},{"type":"item","id":"4552","obj":{"i":4552,"n":"Hi-Potion","l":25,"c":20602,"t":44,"p":146}},{"type":"item","id":"4556","obj":{"i":4556,"n":"Hi-Ether","l":35,"c":20622,"t":44,"p":432}},{"type":"instance","id":"20002","obj":{"i":20002,"n":"The Navel","c":61804,"t":"Trials","min_lvl":34,"max_lvl":36}},{"type":"quest","id":"66392","obj":{"i":66392,"n":"As You Wish","g":1,"l":"Eastern La Noscea","s":180}},{"type":"quest","id":"66053","obj":{"i":66053,"n":"All Good Things","g":1,"l":"Upper La Noscea","s":182}},{"type":"quest","id":"66394","obj":{"i":66394,"n":"One Swallow Does Not a Victory Make","g":91,"l":"Upper La Noscea","s":340}},{"type":"quest","id":"66396","obj":{"i":66396,"n":"Dead or Sumfin' Like It","g":91,"l":"Outer La Noscea","s":340}},{"type":"quest","id":"66398","obj":{"i":66398,"n":"Deduce, Reuse, Recycle","g":91,"l":"Outer La Noscea","s":340}},{"type":"quest","id":"66402","obj":{"i":66402,"n":"The Monster of Bronze Lake","g":91,"l":"Upper La Noscea","s":340}},{"type":"quest","id":"66403","obj":{"i":66403,"n":"Red, Red Wine","g":91,"l":"Upper La Noscea","s":340}}]}