{"quest":{"name":"Trauma Queen","location":"Western Thanalan","id":66406,"patch":2.0,"sort":500,"icon":112010,"unlocksFunction":1,"eventIcon":71341,"issuer":1006340,"target":1006356,"genre":93,"journal":["There is an impish, conspiratorial look about Allene. If her injuries allowed, she would sidle.","Allene tells you of the Wanderer's Palace, a glittering trove of treasures uncovered by the Calamity. She burns to return there, that much is obvious. Speak with Abazi Charazi down at the docks west of Camp Bronze Lake.","Unhinged by the loss of her lover to a tonberry's blade, Allene has been luring adventurers out to the palace with a tale much embroidered. Abazi Charazi offers to take you there, if you are prepared and so inclined.<br><br>※The Wanderer's Palace can be accessed via the Duty Finder.","dummt"],"objectives":["Speak with Abazi Charazi."],"dialogue":[{"name":"ALLENE","text":"Heard we're in the same trade! You're in better shape than me, though. A mishap at the Wanderer's Palace nearly did me in, but boy, was it worth it!"},{"name":"ALLENE","text":"The Calamity drained near half the water from Bronze Lake, and there it was, an ancient temple of Oschon. Why's it called a palace, then? Beats me, I just went in looking for the treasure, me and my feller."},{"name":"ALLENE","text":"It was like a dream, that's what it was like. The water hadn't done a thing. There were gold-framed mirrors bright as the moon. We gazed 'pon ourselves draped in chains of pearl, dancing on a floor of marble and malachite... Like a king and queen, me and my feller."},{"name":"ALLENE","text":"A derring-do adventurer like yourself wouldn't say no to a chance like that now, would ye? Tell you what, go down to the docks west of Camp Bronze Lake and talk to Abazi Charazi. Used to be a boon companion of mine─he'll ferry you to the palace!"},{"name":"ABAZICHARAZI","text":"Yer one of Allene's, aren't ye? That one's got a ghost in her attic, ye know. Keeps sending other 'venturers to that damn place she calls a palace, thinking yer going to bring her feller back."},{"name":"ABAZICHARAZI","text":"'Twas seven of us that day, one of them her feller. My best friend was another. Soon as we walked in, a tonberry attacked. It was dark, and we couldn't get purchase on the floor for 'twas covered in lake slime...then in blood."},{"name":"ABAZICHARAZI","text":"What more's there to say? Only Allene and I made it out by the grace of the Twelve. Everyone else is dead. Think I'd leave him behind─leave my brother by another blood─if I hadn't seen what the tonberry left? I saw no treasure there─only death."},{"name":"ABAZICHARAZI","text":"I've said my piece. Ye still want to see for yerself, that's yer business. I'll ferry ye there, for my adventurin' days are over and I'm the boatman of this lake."},{"name":"ABAZICHARAZI","text":"She thinks they all live, ye see, all five of them hidin' from the tonberry somewhere in the palace. She tried to flee the infirmary; she told folk 'bout her friends needin' rescuin'─then she got sly. Ah, poor, lost Allene..."},{"name":"SYSTEM","text":"You have unlocked the Duty Finder! This feature allows you to undertake multiplayer duties without having to form a party on your own."},{"name":"SYSTEM","text":"To bring up the Duty Finder interface, select <span class=\"highlight\">Duty Finder</span> under <span class=\"highlight\">Duty</span> from the <span class=\"highlight\">main menu</span>."}],"reward":{"gil":5368,"instance":10,"items":[{"id":4508,"one":1},{"id":4502,"one":1},{"id":4506,"one":1},{"id":4514,"one":1},{"num":2,"id":5826,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":47,"id":1}]}},"partials":[{"type":"npc","id":"1006340","obj":{"i":1006340,"n":"Allene","l":42,"q":1}},{"type":"npc","id":"1006356","obj":{"i":1006356,"n":"Abazi Charazi","l":34,"q":2}},{"type":"instance","id":"10","obj":{"i":10,"n":"The Wanderer's Palace","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":45,"max_ilvl":110}},{"type":"item","id":"4508","obj":{"i":4508,"n":"Amber Ring","l":49,"c":54424,"t":43}},{"type":"item","id":"4502","obj":{"i":4502,"n":"Rubellite Ring","l":49,"c":54421,"t":43}},{"type":"item","id":"4506","obj":{"i":4506,"n":"Tourmaline Ring","l":49,"c":54423,"t":43}},{"type":"item","id":"4514","obj":{"i":4514,"n":"Black Pearl Ring","l":49,"c":54429,"t":43}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}}]}