{"quest":{"name":"Looking for Trouble","location":"Outer La Noscea","id":66400,"patch":2.0,"sort":340,"eventIcon":71221,"issuer":1006325,"target":1006325,"genre":91,"journal":["Clearly, Commander Bloeidin has come to trust your skill and discretion.","Storm Commander Bloeidin tells of recent kobold sightings close to Camp Overlook, and would send you off to investigate. Search the specified spots near the camp, and slay any kobold so unfortunate as to encounter you.","You have adorned the hillside with the remains of vanquished foes. However, it is time to cut short this braggarts' sport and report to Commander Bloeidin.","The storm commander's regard for you grows with every mission. Yet he is uneasy, for the kobold scouts stir a memory still as yet vague..."],"objectives":["Search the specified locations and slay kobolds. ","Report to Bloeidin."],"dialogue":[{"name":"BLOEIDINL","text":"Well met, <span class=\"highlight\">Forename</span>. Thanks for the other times─you're not soft, I'll give you that. I've a job that needs a hard <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> to kill─searching for kobold scouts."},{"name":"BLOEIDINL","text":"My boys say there are at least three of them somewhere on the hill. You can handle yourself, can't you?"},{"name":"BLOEIDINL","text":"I put a glass on you soon as I heard there was fighting. I had you pegged for a <span class=\"alternative-container\"><span class=\"alternative\">hellcat</span><span class=\"alternative\">bruiser</span></span>! Sure you don't want to give up the road and join us here? There's enough kobolds to go around!"},{"name":"BLOEIDINL","text":"There's something a touch familiar about those kobolds you saw to. I've seen some what move that way before, I could swear to it. It'll come to me─if we have even that much time."},{"name":"POP","text":"You catch a whiff of earth and metal!"}],"reward":{"gil":1580,"xp":8385},"reqs":{"jobs":[{"lvl":34,"id":1}],"quests":[66397]},"next":[66401]},"partials":[{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"quest","id":"66397","obj":{"i":66397,"n":"Return to Your Dust","g":91,"l":"Outer La Noscea","s":340}},{"type":"quest","id":"66401","obj":{"i":66401,"n":"Helm Me You Love Me","g":91,"l":"Outer La Noscea","s":340}}]}