{"quest":{"name":"The Adventure of the Fainting Goldsmith","location":"Upper La Noscea","id":66404,"patch":2.0,"sort":340,"eventIcon":71221,"issuer":1006332,"target":1006332,"involved":[1006695],"genre":91,"journal":["Rukusa Farusa seems to be near the end of his tethers.","Nearly inchoate with anger, Rukusa Farusa tells you that Godbert the goldsmith has swooned from the heat of the bath. See if a determined /poke will rouse him.","Godbert remains insensate despite the potent prod. Do as the physicians do and douse him with a bottle of ice-cold lake water.","Godbert does not respond. This calls for another dose of ice-cold lake water.","Godbert stirs ever so slightly. Perhaps another dose of ice-cold lake water will do the trick.","Godbert has regained his foot with surprising alacrity. How efficacious these tricks of physicking are! Report the happy development to Rukusa Farusa.","Godbert is homebound, a man reborn. Rukusa Farusa ponders over how a man may be a figure both comic and tragic. Godbert has left you a precious ring, a strangely moving memento of the Calamity. Wear it with humility."],"objectives":["Give Godbert a firm /poke.","Dump the freezing lake water on Godbert.","Dump the freezing lake water on Godbert again.","Dump the freezing lake water on Godbert yet again.","Report to Rukusa Farusa."],"dialogue":[{"name":"RUKUSAFARUSA","text":"First one thing, then another! That goldsmith passed out from too much heat. We have warned him time and again this past week not to stay in so long!"},{"name":"RUKUSAFARUSA","text":"Honestly, I do not trust myself to tend to this fool, for I've a mind to strangle him. If a <span class=\"highlight\">poke</span> revives him not, throw a bucket of lake water on him. There was ice on it this morning!"},{"name":"GODBERT","text":"..."},{"name":"GODBERT","text":"..."},{"name":"GODBERT","text":"Hrrrm...?"},{"name":"GODBERT","text":"Hreee!!! Wrath of Rhalgr, what are you <span class=\"emphasis\">doing</span>!?"},{"name":"GODBERT","text":"Oh, it's you! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> of strong-yet-tender fingers!"},{"name":"GODBERT","text":"I was lost, I freely confess it! I came to this retreat an artisan whose craft had lost its savor, enriching myself by indulging customers' grossest tastes. I was ready to suffer privations, and I did! But today..."},{"name":"GODBERT","text":"Several hours into the ordeal of the scalding water, my life flashed before my eyes. There, I saw forms exquisite─filigree masks, steel cut to shine like diamonds, graceful galleries of electrum where emeralds took the air with pearly suitors... I must return to Ul'dah, to my workshop!"},{"name":"RUKUSAFARUSA","text":"Our goldsmith has departed for home, I am glad to say. He left you this ring─a token of his appreciation, he says. "},{"name":"RUKUSAFARUSA","text":"The stone is taken from a fragment of Dalamud itself, created in abiding faith that out of the worst may come beauty."},{"name":"RUKUSAFARUSA","text":"It sounded as though he lost something─or someone─in the Calamity. “The ring is the only thing I have made in the last five years,” he said, “and now I would like <span class=\"highlight\">Forename</span> to have it.” Extraordinary."},{"name":"RUKUSAFARUSA","text":"A very unexpected turn of events, I must say. I still think him utterly mad, but no doubt he is a more fascinating one. I don't suppose he'd have given me the ring even if I'd... Well, no use fretting over a song already sung."}],"reward":{"gil":1311,"items":[{"id":6138}],"xp":8385},"reqs":{"jobs":[{"lvl":34,"id":1}],"quests":[66402]}},"partials":[{"type":"npc","id":"1006332","obj":{"i":1006332,"n":"Rukusa Farusa","l":34,"q":3}},{"type":"npc","id":"1006695","obj":{"i":1006695,"n":"Godbert","l":34,"q":1}},{"type":"item","id":"6138","obj":{"i":6138,"n":"Meteor Survivor Ring","l":36,"c":54510,"t":43,"p":100}},{"type":"quest","id":"66402","obj":{"i":66402,"n":"The Monster of Bronze Lake","g":91,"l":"Upper La Noscea","s":340}}]}