{"quest":{"name":"Red, Red Wine","location":"Upper La Noscea","id":66403,"patch":2.0,"sort":340,"eventIcon":71221,"issuer":1006333,"target":1006333,"involved":[1006334,1006335,1006336,1006337],"genre":91,"journal":["The healer A'rhunlika greets you with a smile and a chore, as she is wont to do. Who could mind when the cause is good and the smile so fair?","A'rhunlika has prepared some mulled wine, redolent of Wineport sunshine and rich with herbs, and she needs it warmed. Take the bottles to the hot spring and submerge them.","From the gentle steam and the heady fragrance, you judge the mulled wine well and truly warmed. Collect the warmwine from where you left it.","In your hand, you hold a nectar most healthful, hot as the southern desert and deep as the northern sea. Deliver the wine to soldiers who heal their hurts under A'rhunlika's ministrations.","The warmwine has been served to the wounded women and men. Speak with A'rhunlika.","A'rhunlika listens, her smile tinged with sorrow. She is no bright-eyed young thing maudlin with hero worship. She knows too well what awaits us all─yet she would still raise a glass to all that is good and fair."],"objectives":["Submerge the mulled wine in the hot spring.","Take the bottles of warmwine from the hot spring.","Give the warmwine to the convalescing soldiers.","Report to A'rhunlika.","Interact with the wine bottle to acquire 4 servings of warmwine."],"dialogue":[{"name":"ARHUNLIKA","text":"We use mulled wine from Wineport to treat the war wounded. It restores the bodily humours and gives vigor to hearts made weary by fever."},{"name":"ARHUNLIKA","text":"Why don't you put yourself to some good use, adventurer? I prepared some mulled wine earlier, and need it heated to make warmwine. Will you submerge these bottles in the hot spring over yonder, and serve them to those that need it sorely?"},{"name":"IMUMU","text":"Damn...I can barely remember a time when everything didn't hurt. I feel like I've always been here."},{"name":"IMUMU","text":"Thank you, and cheers...oh! Hot and spicy─just like the horn we raised when the sergeant was wedded, when the little red-haired private fell. All my friends! I'll be back, ye steel-chewing roughnecks!"},{"name":"HBHOWAKA","text":"My wounds heal, for sure and certain. Not so stiff and sore no more, neither."},{"name":"HBHOWAKA","text":"Obliged, adventurer! That's a mugful of good medicine there. Wouldn't mind taking some of that back to the front!"},{"name":"OSTSYGG","text":"Ow, that smarts. I know, I'm countin' my blessin's, don't you make those eyes at me. Jus' sayin' it <span class=\"emphasis\">smarts</span>."},{"name":"OSTSYGG","text":"Omph, that hits the spot. I don't mind that kind of a burn! It's a fine thing, bein' alive. And don't mind me none, I like ye all. Jus' like my own levy more, been through a lot together."},{"name":"SWAENLONA","text":"Look at that, I do believe I can move that foot a little more! Sure helps with the hurt, too."},{"name":"SWAENLONA","text":"Thank you, adventurer! You'll see, we'll be on our feet and halfway to being the Warriors of Light before you're done warming another bottle!"},{"name":"ARHUNLIKA","text":"Thank you for your kindness, adventurer. Those soldiers you met─they may be champions for our way of life, but here, they are sisters and brothers, sons and daughters. They are so young, most of them, and so hurt in spirit and body."},{"name":"ARHUNLIKA","text":"Most will return to the front, and some will not even survive to come under my care again. It's what they want and what we need of them, I know. But I tell myself that I heal them so they can become farmers and smiths, alchemists and rangers, mothers and fathers.<br>For a few, it will be true─that will have to be enough."}],"reward":{"gil":1492,"xp":8385},"reqs":{"jobs":[{"lvl":34,"id":1}],"quests":[66393]}},"partials":[{"type":"npc","id":"1006333","obj":{"i":1006333,"n":"A'rhunlika","l":34,"q":1}},{"type":"npc","id":"1006334","obj":{"i":1006334,"n":"Imumu","l":34,"q":1}},{"type":"npc","id":"1006335","obj":{"i":1006335,"n":"H'bhowaka","l":34,"q":1}},{"type":"npc","id":"1006336","obj":{"i":1006336,"n":"Ostsygg","l":34,"q":1}},{"type":"npc","id":"1006337","obj":{"i":1006337,"n":"Swaenlona","l":34,"q":1}},{"type":"quest","id":"66393","obj":{"i":66393,"n":"Lord of Crags","g":1,"l":"Upper La Noscea","s":181}}]}