{"quest":{"name":"Plagued by Indecision","location":"Eastern Thanalan","id":66409,"patch":2.0,"sort":350,"eventIcon":71221,"issuer":1006355,"target":1006355,"involved":[1006359],"genre":93,"journal":["The ache you carry cannot have escaped Father Iliud's sharp eyes, yet he makes no note of it.","Iliud bids you go to Lost Hope, a raft of exiles lashed to the graceful ship of Ul'dah, and deliver four sticks of vilekin repellent to Zazawaka.","Immediately wary and just as immediately courteous, Zazawaka asks you to apply the repellent. Take the sticks and use them at the appointed locations.","You have applied the repellent. Report your success to Zazawaka.","Grateful for your assistance, Zazawaka shares his private worries with you. You have no words of comfort, for the exile speaks true. Return to the Church of Saint Adama Landama and report to Father Iliud.","You speak with Father Iliud, and sense the depth of his grief for the fate of these people. On your own cares too, he gives a brief and gentle counsel."],"objectives":["Show Zazawaka the sticks of vilekin repellent.","Sprinkle the repellent at the destinations.","Speak with Zazawaka.","Return to the church and report to Iliud."],"dialogue":[{"name":"ILIUD","text":"Death begets death, especially in those places where privation is the sovereign. A corse left unburied is as a rich field to vilekin, where they may sow pestilence and water it with their miasma."},{"name":"ILIUD","text":"Nowhere is the rule of privation so apparent as in Lost Hope. A man may die upon the roadside there and go unclaimed, for no ties bind these unhappy folk together except a common misfortune: their homelands are no more."},{"name":"ILIUD","text":"But as long as they live, some hope remains, and so we must thwart pestilence ere it begins. Will you deliver this repellent to that den of sorrow?"},{"name":"ZAZAWAKA","text":"What business do you have here, stranger? Oh, you come from the Church of Saint Adama Landama?"},{"name":"ZAZAWAKA","text":"Ah, the vilekin repellent. The good father told me last moon of this plan. He is a man that keeps his word, and 'twas kind of him to have you deliver it."},{"name":"ZAZAWAKA","text":"Did he tell you where─and how─these are to be used? I fear I have little knowledge of alchemy."},{"name":"ZAZAWAKA","text":"Thank you, stranger. This place may seem wretched to you, and none here would deny it is. But last year, it had the look of a charnel house, so fiercely did the pestilence rage. Tell Father Iliud we owe him a debt of life."},{"name":"ZAZAWAKA","text":"I confess, though, I wonder if we are saved from a plague only to perish in war. We have little love for Garlemald here, and news of them who burned our homes travels fast."},{"name":"ZAZAWAKA","text":"What chance does Lost Hope have against a force that plucked Ala Mhigo like a ripe peach? Fight or flee, we must make plans. Yet few have ears to listen to me. They have too much to fear already, too many demons to slay every hour."},{"name":"ILIUD","text":"Thank you, <span class=\"highlight\">Forename</span>. Sometimes for what ails us in thinking, we find relief in doing."},{"name":"ILIUD","text":"The ministration to exiles is one of the duties of the Church of Saint Adama Landama. I pray that someday, with the grace of the gods, they may find again what they have lost."}],"reward":{"gil":1518,"xp":9020},"reqs":{"jobs":[{"lvl":35,"id":1}],"quests":[66053]}},"partials":[{"type":"npc","id":"1006355","obj":{"i":1006355,"n":"Iliud","l":44,"q":9}},{"type":"npc","id":"1006359","obj":{"i":1006359,"n":"Zazawaka","l":43,"q":2}},{"type":"quest","id":"66053","obj":{"i":66053,"n":"All Good Things","g":1,"l":"Upper La Noscea","s":182}}]}