{"quest":{"name":"Bury Me Not on the Lone Prairie","location":"Eastern Thanalan","id":66414,"patch":2.0,"sort":188,"icon":100135,"eventIcon":71201,"issuer":1003958,"target":1003958,"involved":[1000580],"genre":1,"journal":["Sister Eluned wishes to discuss one of the Scions who perished at the Waking Sands.","The Church of Saint Adama Landama can perform rites for most of the fallen Scions. However, Noraxia, a sylph from Little Solace, is an exception. Sister Eluned believes that it would be best if the sylph's body was returned to her home in the Black Shroud, and she asks that you accept this responsibility.","The sylphs thank you for bringing Noraxia's remains back home. Though her death has been cause for great sadness in Little Solace, it has also sparked anger against the imperials. When the time comes to confront the forces responsible, it would be wise to seek the aid of the humble forest dwellers. Return to Sister Eluned at the Church of Saint Adama Landama.","Upon your return, Sister Eluned informs you that the last of your comrades has finally been laid to rest in the lichyard. Sister Eluned further implores you to set aside your burdens and take a rest, as you have already done so much on behalf of the fallen Scions."],"objectives":["Return Noraxia to Little Solace.","Return to Eluned."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"ELUNED","text":"Although we can perform rites for most of the Scions, there is one whom we cannot accept. We would like you to return this one to her people, the sylphs of Little Solace."},{"name":"ELUNED","text":"It is only proper that she be given into the care of her friends and family, so that they may mourn her in accordance with sylphic traditions."},{"name":"KOMUXIO","text":"This one is surprised to see walking one in Little Solace. How can these ones assist walking one?"},{"name":"KOMUXIO","text":"&lt;gasp&gt; Noraxia!? But...this one does not understand..."},{"name":"FRIXIO","text":"Komuxio, this one has heard much wailing. This one would know what has caused such distress."},{"name":"KOMUXIO","text":"Terrible news, elder one! Awful news!"},{"name":"FRIXIO","text":"Walking one has returned to Little Solace? But why? These ones have not requested further aid."},{"name":"FRIXIO","text":"Noraxia!? How did this happen? Explain everything to this one, at once!"},{"name":"FRIXIO","text":"So...not only Noraxia, but many of walking one's friends were lost as well."},{"name":"KOMUXIO","text":"&lt;sob&gt; Noraxia..."},{"name":"FRIXIO","text":"Noraxia went to Thanalan at the behest of this one..."},{"name":"FRIXIO","text":"Walking one was with Noraxia at the end... Tell this one that Noraxia was brave. Tell this one that Noraxia did not suffer."},{"name":"FRIXIO","text":"This one is glad to hear walking one's words."},{"name":"FRIXIO","text":"Thank you for bringing Noraxia home, walking one."},{"name":"FRIXIO","text":"These ones also wish to thank praying ones. Tell praying ones these ones will remember this kindness."},{"name":"KOMUXIO","text":"This one demands vengeance! Imperial ones must pay! Imperial ones must suffer!"},{"name":"KOMUXIO","text":"When the time comes for walking ones to face imperial ones, do not forget these ones! These ones would not have Noraxia's death be for naught! These ones will fight!"},{"name":"ELUNED","text":"We thank you for your service to the church and to the sylphs. You may be pleased to know that, in your absence, we interred the remaining Scions in the lichyard."},{"name":"ELUNED","text":"Perhaps you still wish to do more for your friends. If so, I would remind you that you have already done so much on their behalf. Please, take a rest and set aside your burdens for now, <span class=\"highlight\">Forename</span>."}],"reward":{"items":[{"id":27639,"one":1},{"id":2774,"one":1},{"num":5,"id":5825,"one":1}],"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":130}],"quests":[66412]},"next":[66054]},"partials":[{"type":"npc","id":"1003958","obj":{"i":1003958,"n":"Eluned","l":44,"q":5}},{"type":"npc","id":"1000580","obj":{"i":1000580,"n":"Komuxio","l":55,"q":10}},{"type":"item","id":"27639","obj":{"i":27639,"n":"Linen Bandana","l":35,"c":41729,"t":34}},{"type":"item","id":"2774","obj":{"i":2774,"n":"Mythril Spectacles","l":35,"c":40900,"t":34,"p":3099}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66412","obj":{"i":66412,"n":"Bringing out the Dead","g":1,"l":"Eastern Thanalan","s":186}},{"type":"quest","id":"66054","obj":{"i":66054,"n":"Eyes on Me","g":1,"l":"Eastern Thanalan","s":189}}]}