{"quest":{"name":"A Tall Drink of Aqua del Sol","location":"Eastern Thanalan","id":66417,"patch":2.0,"sort":185,"eventIcon":71201,"target":1006672,"genre":0,"journal":["Ilcum would like to offer succor to the priests at the Church of Saint Adama Landama.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Eluned at the Church of Saint Adama Landama.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","As is often the case in your adventures, you quickly hunt down and slay your quarry. Deliver the brazo del sol to Ilcum at the lichyard.","Wasting no time, Ilcum prepares a sample of Aqua del Sol─but not for you. She insists that Marques be the first to receive the drink, and asks that you give it to him on her behalf.","Marques is puzzled by the gesture, but grateful. However, believing that Father Iliud is in greater need of the juice, he decides to offer it to the priest instead."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Eluned at the Church of Saint Adama Landama.</span>"],"dialogue":[{"name":"ILCUM","text":"Excuse me, <span class=\"highlight\">Forename</span>. You don't know me, but I've observed you assisting the priests with their work. I too would like to offer what succor I might."},{"name":"ILCUM","text":"Since tending the lichyard in this heat can quickly sap one's energies, perhaps a restorative drink made to combat fatigue would be ideal."},{"name":"ILCUM","text":"Of course, Aqua del Sol! That would surely do the trick!"},{"name":"ILCUM","text":"To make it, I would need a freshly cut brazo del sol. I've not the skill at arms to slay a wild sabotender del sol─but you do, so..."},{"name":"ILCUM","text":"You need only go as far as the spring east of Camp Drybone─the beasts are often sighted in that vicinity. If you brought me one of their arms, I could make enough Aqua del Sol for everyone!"},{"name":"ILCUM","text":"Have you considered my request, <span class=\"highlight\">Forename</span>?"},{"name":"ILCUM","text":"I never imagined that you would return so quickly! Thank you so much."},{"name":"ILCUM","text":"It's an incredibly simple beverage to prepare. If you would wait but one moment..."},{"name":"ILCUM","text":"There! This should serve as a sample of─wait, don't drink it! I mean, I...I was hoping you might give the first glass to Marques on my behalf."},{"name":"ILCUM","text":"Of course, I intend to provide everyone with a glass eventually. It's just that Marques is so..."},{"name":"ILCUM","text":"<span class=\"alternative-container\"><span class=\"alternative\">Well, surely you've noticed what a handsome man he is...</span><span class=\"alternative\">He's such a...hard worker, don't you think?</span></span>"},{"name":"MARQUEZ","text":"Oh, <span class=\"highlight\">Forename</span>. What is it?"},{"name":"MARQUEZ","text":"For me? I... Thank you."},{"name":"MARQUEZ","text":"Was it perhaps the girl who...? No, no, it couldn't have been her."},{"name":"MARQUEZ","text":"I appreciate Ilcum's kind gesture, but Father Iliud is in far greater need of this juice. His work places great strain on his body and soul, yet he continues to neglect his health..."},{"name":"POP","text":"You hear the pitter-patter of tiny feet..."}],"reward":{"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":130}],"questsType":"all","quests":[66407,66408]}},"partials":[{"type":"npc","id":"1006672","obj":{"i":1006672,"n":"Marques","l":44,"q":4}},{"type":"quest","id":"66407","obj":{"i":66407,"n":"With a Little Elbow Grease","g":0,"l":"Eastern Thanalan","s":183}},{"type":"quest","id":"66408","obj":{"i":66408,"n":"You Can't Take It with You","g":0,"l":"Eastern Thanalan","s":184}}]}