{"quest":{"name":"Mr. Slipshod and Ms. Uptight","location":"Eastern Thanalan","id":66415,"patch":2.0,"sort":350,"eventIcon":71221,"issuer":1006363,"target":1006363,"involved":[1006364],"genre":93,"journal":["Fuandrec is a breath of fresh air in this house of tears and melancholy─very angry air. She needs you to find someone, and quick.","Fuandrec's feckless cousin is late for a burial, not the first time he has failed to mark the time. There is naught to do but for you to look for a suitably slipshod person near Halatali.","Near the ruin of training grounds, you encounter a pair of escaped Coliseum soulkin about to slice a wayfarer to pieces. Rather than wax philosophical, you dispatch the doctores and save Fuandrec's cousin. Report the happy news to her.","You speak with Fuandrec and tactfully leave out her cousin's mention of her “overtight” corset lacing. However, judging from Fuandrec's own barbs, they are a two of a kind."],"objectives":["Find a slipshod wayfarer.","Report to Fuandrec."],"dialogue":[{"name":"FUANDREC","text":"Where <span class=\"emphasis\">is</span> that turnip-head? We have already waited some hours for my cousin, and still he dallies Thal knows where. He is ever late, I do not understand why he cannot simply depart early!"},{"name":"FUANDREC","text":"Still, I confess, I am fond of the fool. I would go look for him but his route winds close to the Halatali training grounds, and they say 'tis a romp of beasts there─beasts of the most dangerous kind."},{"name":"FUANDREC","text":"You <span class=\"emphasis\">are</span> an adventurer, and surely this is the sort of thing that, oh, I don't know, makes your blood sing, heart boil, or some such piffle. Will you look for my feckless cousin?"},{"name":"NPC","text":"Thank you, thank you, and thank you thrice! Saw those rather nasty brutes coming and thought...well, nothing much really beyond “AAARGH!” They really should take old Halatali down─the place has absolutely gone to pot."},{"name":"NPC","text":"Oh, look at the time. Mustn't keep the burial waiting too much longer. I s'pose my cousin Fuandrec, she of the overtight corset, is none too pleased."},{"name":"FUANDREC","text":"Oh, thank you! He is absolutely incorrigible, but to think we might have had to bury him as well! Then again, that's one burial he wouldn't have been late for. There's a thought."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"ACCESS","text":"The enemy is still about!"}],"reward":{"gil":1518,"xp":9020},"reqs":{"jobs":[{"lvl":35,"id":1}],"quests":[66053]}},"partials":[{"type":"npc","id":"1006363","obj":{"i":1006363,"n":"Fuandrec","l":44,"q":1}},{"type":"npc","id":"1006364","obj":{"i":1006364,"n":"Slipshod Wayfarer","l":44,"q":1}},{"type":"quest","id":"66053","obj":{"i":66053,"n":"All Good Things","g":1,"l":"Upper La Noscea","s":182}}]}