{"quest":{"name":"The Voyage of the Goobbue","location":"Eastern Thanalan","id":66410,"patch":2.0,"sort":350,"eventIcon":71221,"issuer":1006360,"target":1006360,"genre":93,"journal":["Rousing himself from a considerable gloom, Barryn seems thankful for your presence.","It seems that a mourner was attacked near an unusually verdant patch of wildflowers growing on a fallen goobbue. Barryn bids you investigate the scene and slay the creatures responsible.","You have slain the Shroud mandragoras who had apparently claimed the goobbue mound as their own. Report your success to Barryn.","Barryn thanks you, and emboldened, you ask about the goobbue. The Calamity has driven from their homes men and beasts alike, and Barryn broods that before long, few may be spared the fate of exile."],"objectives":["Investigate the spot and slay the foes.","Report to Barryn."],"dialogue":[{"name":"BARRYN","text":"The sun has shone upon a terrible sight today. One of the bereaved wished to place upon the grave of his beloved a sprig of Althyk lavender. He strayed far, for the flower is sparse in these parts─and was grievously wounded by fiends."},{"name":"BARRYN","text":"Grief makes us all slow in wits and limb, and I fear that these attacks will not cease until the creatures are gone. I pray you, banish the foul things. They were last seen to the east, near the remains of a goobbue."},{"name":"BARRYN","text":"When the Calamity struck, it sundered life everywhere─and not only among our races. Look around, and you will see how things have fallen apart. Feet, claws, roots─all have been torn from the earth they were planted on."},{"name":"BARRYN","text":"The dead goobbue was a child of Coerthas. The Calamity shattered its native mountains, and it fled before destruction as a caravan flies before a sandstorm. Years, it wandered. We found it dying and received its memories."},{"name":"BARRYN","text":"It had gathered seeds from every land it passed through, and they flower upon its corpse, a living map of its loss and exile. North to south, mountains to the desert...cloudberry and shooting stars, marybells and cliff roses, Althyk lavender from lower Thanalan, even roselles from Bloodshore."},{"name":"BARRYN","text":"To wander is a dream and a nightmare. Adventurers such as yourself must know it better than I, but I imagine there are days when the flame of adventure gutters, and you feel yourself to be as bereft as those in Lost Hope...and upon us, no flowers grow."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":1518,"xp":9020},"reqs":{"jobs":[{"lvl":35,"id":1}],"quests":[66053]},"next":[66411]},"partials":[{"type":"npc","id":"1006360","obj":{"i":1006360,"n":"Barryn","l":44,"q":2}},{"type":"quest","id":"66053","obj":{"i":66053,"n":"All Good Things","g":1,"l":"Upper La Noscea","s":182}},{"type":"quest","id":"66411","obj":{"i":66411,"n":"Scent of Cinnamon","g":93,"l":"Eastern Thanalan","s":350}}]}