{"quest":{"name":"Bringing out the Dead","location":"Eastern Thanalan","id":66412,"patch":2.0,"sort":186,"eventIcon":71201,"issuer":1003958,"target":1003958,"involved":[1006344,1006345,1006346,1006347,1006348,1006349,1006350,1006351,1006355,1006361,1006362],"genre":1,"journal":["Sister Eluned is staring at you with great sadness in her eyes...","Having recognized you as Father Iliud's guest, Sister Eluned offers her condolences for the lives lost in the attack on the Waking Sands. She then informs you that the bodies of your fallen comrades are currently being prepared for transport from Vesper Bay to the lichyard. Believing that it might help you find closure, she suggests that you travel to Vesper Bay and assist with this task.","While many bodies have already been sent to the lichyard, many still remain outside the Waking Sands. Suppress whatever distaste you may harbor for the task at hand, and gather as many corpses as you can carry.","Trying best not to think of who these brave men and women once were, you gingerly gather four of your fallen comrades. Bear their bodies to the chocobo carriage waiting at the east gate of Vesper Bay.","You load the four bodies into the back of the chocobo carriage. Alas, four still remain outside the Waking Sands.","With a heavy heart, you have gathered the final four bodies. As before, take them to the chocobo carriage at the east gate.","The last of the fallen Scions are now ready to be taken to the lichyard. Return to Sister Eluned and tell her she can expect the bodies to arrive soon.","Sister Eluned tells you that the first carriage from Vesper Bay arrived prior to your return, and that your fallen comrades are already being prepared for burial. She tells you to take comfort in the fact that death came quickly to most, and assures you that they will be afforded the utmost respect so that they may find peace in Thal's realm."],"objectives":["Speak with the merchant outside the Waking Sands.","Gather the corpses.","Carry the corpses to the carriage.","Gather the remaining corpses.","Carry the remaining corpses to the carriage.","Speak with Eluned."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"ELUNED","text":"I recognize you now, <span class=\"highlight\">Forename</span>. Allow me to express my deepest condolences for those who lost their lives in the attack."},{"name":"ELUNED","text":"I apologize if discussing this upsets you, but...you should know that the bodies of your comrades are presently being removed from the Waking Sands and prepared for transport here."},{"name":"ELUNED","text":"If you wish to leave this work to others, I understand. However, taking part might help you to find closure."},{"name":"NPCA","text":"Eh? Ye don't look like one of them church fellas. Not that I'll turn ye away, no sir."},{"name":"NPCA","text":"As ye can see, we've got a pile of unidentified bodies over yonder. No one's come to claim 'em, so off to the lichyard they go."},{"name":"NPCA","text":"Be thankful ye didn't have to go inside and see the carnage for yerself. 'Twas the stuff of nightmares, I tell ye. Godsdamned imperials. &lt;spit&gt;"},{"name":"NPCA","text":"I don't know what quarrel they had with these folks, and I sure as hells don't want to know. The sooner we put this behind us, the better."},{"name":"NPCA","text":"Say...ain't I seen you 'round here afore? Or do ye just have one of them faces? Ah, never mind..."},{"name":"NPCA","text":"Anyroad, there's a carriage come to haul the bodies to the lichyard, out by the east gate."},{"name":"NPCA","text":"There's only eight left to load up, but seein' as I'm exhausted from carryin' all the others, I've a mind to leave the remainder to you."},{"name":"NPCA","text":"Might want to cover yer nose while ye work. Some of these folk're startin' to turn..."},{"name":"NPCB","text":"What happened to the big fella? Ah, forget it. Just bring the next batch and toss 'em in the back─ain't like they'll complain if you're rough!"},{"name":"NPCB","text":"Well, ain't you a strong one. Four in one trip! Reckon there's no need for me to lend you a hand with the rest, then."},{"name":"NPCB","text":"Come on, come on! Let's finish this before <span class=\"emphasis\">I</span> die of old age."},{"name":"NPCB","text":"That should be all of 'em! Thanks for the help."},{"name":"NPCB","text":"Reckon it won't take too long to deliver all the corpses to the lichyard. Even so, you might want to hurry back an' tell 'em that our work here is done."},{"name":"NPCB","text":"What? Wondering why I'm still here? Hells, I don't need to rush. Ain't like these folk have pressing appointments to keep, you know."},{"name":"ELUNED","text":"I see that you decided to heed my advice. I pray that, in doing so, you found some small measure of peace."},{"name":"ELUNED","text":"The first carriage from Vesper Bay arrived not long ago, and we have begun preparing your comrades for burial. I had a hand in the initial rites, and I...I would like you to know that, for many, death came quickly."},{"name":"ELUNED","text":"Rest assured that we will treat them with the utmost respect, and do everything we can to shepherd them to Thal's realm."}],"reward":{"gil":1791,"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":130}],"quests":[69403]},"next":[66413,66414]},"partials":[{"type":"npc","id":"1003958","obj":{"i":1003958,"n":"Eluned","l":44,"q":5}},{"type":"npc","id":"1006344","obj":{"i":1006344,"n":"Fallen Sylph","l":42,"q":1}},{"type":"npc","id":"1006345","obj":{"i":1006345,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006346","obj":{"i":1006346,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006347","obj":{"i":1006347,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006348","obj":{"i":1006348,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006349","obj":{"i":1006349,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006350","obj":{"i":1006350,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006351","obj":{"i":1006351,"n":"Fallen Scion","l":42,"q":1}},{"type":"npc","id":"1006355","obj":{"i":1006355,"n":"Iliud","l":44,"q":9}},{"type":"npc","id":"1006361","obj":{"i":1006361,"n":"Vesper Bay Shopkeep","l":42,"q":1}},{"type":"npc","id":"1006362","obj":{"i":1006362,"n":"Disconcerted Coachman","l":42,"q":1}},{"type":"quest","id":"69403","obj":{"i":69403,"n":"You Can't Take It with You","g":1,"l":"Eastern Thanalan","s":184}},{"type":"quest","id":"66413","obj":{"i":66413,"n":"The Warden Works in Mysterious Ways","g":0,"l":"Eastern Thanalan","s":187}},{"type":"quest","id":"66414","obj":{"i":66414,"n":"Bury Me Not on the Lone Prairie","g":1,"l":"Eastern Thanalan","s":188}}]}