{"quest":{"name":"The Unending War","location":"Coerthas Central Highlands","id":66422,"patch":2.0,"sort":192,"icon":100136,"eventIcon":71201,"issuer":1006372,"target":1006377,"involved":[1006376,1006731],"genre":1,"journal":["Ser Ludovoix is doing his utmost to intimidate you into leaving.","Ser Ludovoix declares that if you are intent upon remaining in the area, you might as well make yourself useful by helping him locate a missing sentry, whom Ser Ludovoix instructed to patrol the lands west of the Observatorium.","You locate the missing man with little difficulty, but are forced to defend yourself against several unknown assailants. With malice in his voice, the Ishgardian names the attackers as heretics─those who have pledged their allegiance to the dragons. Report to Ser Ludovoix and tell him of what transpired.","Ser Ludovoix is pleasantly surprised by your success in finding and rescuing his knight. He states that he will inform the astrologians of your intent and directs you to speak with a woman named Edmelle.","Though she is surprised to receive a foreigner, Edmelle directs you to speak with Chief Astrologian Forlemort, who can be found up above.","As Chief Astrologian Forlemort berates you for daring to make such a ridiculous request, an Ishgardian inquisitor named Guillaime appears, seeking an audience with the chief astrologian. Apologizing for the interruption, the inquisitor quickly takes his leave, but not before subtly cautioning you against becoming involved in Ishgardian affairs. Nevertheless, you may have no choice but to do just that if you wish to find the <span class=\"emphasis\">Enterprise</span>."],"objectives":["Search for the missing knight.","Report to Ludovoix.","Speak with Edmelle.","Speak with Forlemort."],"dialogue":[{"name":"LUDOVOIX","text":"Halone have mercy, are you still here? You may take shelter within our walls if you insist, but do not distract me while I am on duty. We're stretched thin as it is."},{"name":"LUDOVOIX","text":"And where in the hells is that knight I sent out on patrol? He should have returned ages ago!"},{"name":"LUDOVOIX","text":"Hmmm... Perhaps I have a use for you, after all. If you still wish to aid us, search the wilds to the west for my missing man. You will know him by his uniform─that of House Durendaire, as is mine."},{"name":"NPC","text":"If it wasn't for you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, I reckon they would've finished me off."},{"name":"NPC","text":"Despicable dragon-loving bastards. &lt;spit&gt; Death was a mercy they didn't deserve."},{"name":"NPC","text":"I prayed the rumors were mistaken, but this confirms the worst. I must immediately inform my superiors that the heretics are operating within this region. Fare thee well, friend."},{"name":"LUDOVOIX","text":"I must say, I didn't actually expect you to find my knight, much less rescue him! I see I may have been premature in my judgment, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"LUDOVOIX","text":"We are a proud people, beholden to tradition, but that does not mean we are without humility."},{"name":"LUDOVOIX","text":"I shall instruct the astrologians to entertain your request. However, understand that it is ultimately their decision whether or not you may peruse their records. Pray proceed to the Observatorium and introduce yourself to Edmelle."},{"name":"EDMELLE","text":"Ah, the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> come in search of the airship. This is highly unorthodox... What ever could Ser Ludovoix be thinking?"},{"name":"EDMELLE","text":"It is true that we maintain meticulous records which stretch back generations. However, because this information is used to chart Dravanian activity, access is strictly controlled. One can never be too careful with heretics and their sympathizers lurking about."},{"name":"EDMELLE","text":"If you would persist with your inquiries, pray seek an audience with Chief Astrologian Forlemort up above."},{"name":"FORLEMORT","text":"No. Absolutely not. Have you any inkling what it is you ask?"},{"name":"FORLEMORT","text":"Were our records to fall into the wrong hands, it could change the course of a war which has raged for generations! I speak not of some mere spat between southron nations. Ours is a holy crusade, and we are the arbiters of Halone's will!"},{"name":"FORLEMORT","text":"I will <span class=\"emphasis\">not</span> put our great nation at risk─certainly not to help a foreigner locate a missing airship, of all things!"},{"name":"GUILLAIME","text":"Pardon the intrusion, Forlemort. I wished to speak with you regarding the recent─ Oh, I did not realize you had a guest."},{"name":"FORLEMORT","text":"Inquisitor Guillaime! Y-You honor us with your presence, sir. The <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> was just leaving."},{"name":"GUILLAIME","text":"Ahhh, you must be the one who rescued House Durendaire's knight from those heretics. Doubtless they feel indebted to you. I am told you seek an airship last seen in Coerthas five years ago, yes?"},{"name":"GUILLAIME","text":"You come to us at an inconvenient time, I fear. Much has changed in the intervening years, and little for the better. While I wish you the best of luck in your search, I would also strongly advise caution."},{"name":"GUILLAIME","text":"The snows can come quickly in Coerthas. One moment you may feel as though you have a firm grasp on your surroundings, safe and secure in your knowledge, and the next you may find yourself in a wholly unfamiliar situation, blind to the dangers hidden by the blizzard. It would be wise for you to focus on a <span class=\"emphasis\">single</span> landmark whilst traveling. Do not give in to temptation and deviate from your course."},{"name":"FORLEMORT","text":"I was not aware you aided House Durendaire in that fashion. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Nevertheless, my decision stands. I cannot give you what you seek."},{"name":"POP","text":"The sound of snow crunching underneath sabatons grows louder..."},{"name":"ACCESS","text":"The knight does not respond."}],"reward":{"xp":18900},"reqs":{"jobs":[{"lvl":36,"id":130}],"quests":[66420]},"next":[66423]},"partials":[{"type":"npc","id":"1006372","obj":{"i":1006372,"n":"Ludovoix","l":63,"q":2}},{"type":"npc","id":"1006377","obj":{"i":1006377,"n":"Forlemort","l":63,"q":6}},{"type":"npc","id":"1006376","obj":{"i":1006376,"n":"Edmelle","l":63,"q":2}},{"type":"npc","id":"1006731","obj":{"i":1006731,"n":"Keeled-over Knight","l":63,"q":1}},{"type":"quest","id":"66420","obj":{"i":66420,"n":"Cold Reception","g":1,"l":"North Shroud","s":191}},{"type":"quest","id":"66423","obj":{"i":66423,"n":"Men of Honor","g":1,"l":"Coerthas Central Highlands","s":193}}]}