{"quest":{"name":"Hunger Is the Best Sauce","location":"North Shroud","id":66421,"patch":2.0,"sort":360,"eventIcon":71221,"issuer":1006375,"target":1006375,"genre":92,"journal":["Idristan is searching for an adventurer to undertake a distasteful task.","You learn that voracious jackals have been spotted near Florentel's Spire. Having fled from snow-covered Coerthas, they are likely to be a danger to travelers. Idristan has given you a chunk of fetid dodo flesh to be used to draw out the beasts. Find a suitable place to set down the meat, and slay the jackals that appear.","You have slain the jackals and made the area that much safer. Return to Idristan and inform him the deed is done.","Idristan is pleased at the outcome, but remains frustrated about the situation. The Calamity has left Coerthas nigh uninhabitable, and the local wildlife have become more dangerous as a result. If you plan on heading northwest, the Quiverman warns you to be prepared."],"objectives":["Use the dodo meat as bait and slay jackals.","Report to Idristan. "],"dialogue":[{"name":"IDRISTAN","text":"The freeze that came in the Calamity's wake has rendered Coerthas nigh inhospitable. Many of the creatures that once made their homes there have been forced to migrate lest they starve."},{"name":"IDRISTAN","text":"Some arrive on our doorstep with naught else on their mind but to feed. The worst of the beasts are the jackals, who've been spotted not far from this very spire."},{"name":"IDRISTAN","text":"Adventurer, we call upon your skill to dispatch these beasts before they make a meal of some unguarded traveler. This f-fet<span class=\"emphasis\">urrrgh</span>─begging your pardons─<span class=\"emphasis\">fetid</span> dodo meat will serve admirably as bait."},{"name":"IDRISTAN","text":"We are most grateful. This kind of situation would not have arisen ere the Calamity came and made Coerthas nigh uninhabitable to its local fauna."},{"name":"IDRISTAN","text":"With their water hoarded in vaults of ice and their herbage held under the snow, the larger beasts have become positively infernal in their need to survive. Take heed if you head northbound, for know that you are riding into battle."},{"name":"POP","text":"A pair of ravenous jackals approach!"}],"reward":{"items":[{"id":3399,"one":1},{"id":27990,"one":1},{"num":4,"id":5825,"one":1}],"xp":9450},"reqs":{"jobs":[{"lvl":36,"id":1}]}},"partials":[{"type":"npc","id":"1006375","obj":{"i":1006375,"n":"Idristan","l":57,"q":2}},{"type":"item","id":"3399","obj":{"i":3399,"n":"Linen Trousers","l":36,"c":45184,"t":36}},{"type":"item","id":"27990","obj":{"i":27990,"n":"Altered Linen Chausses","l":36,"c":45280,"t":36}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}}]}