{"quest":{"name":"The Rose and the Unicorn","location":"Coerthas Central Highlands","id":66426,"patch":2.0,"sort":195,"icon":100138,"eventIcon":71201,"issuer":1006382,"target":1006384,"involved":[1006383],"genre":1,"journal":["Ser Carrilaut has something very important to tell you.","Ser Carrilaut tells you in hushed whispers that Lord Francel could not possibly be a heretic, and that these accusations could prove disastrous for House Haillenarte. He bids you deliver a warning to Lord Francel at Skyfire Locks, adding further that you should speak to him of an edelweiss so that he knows you can be trusted.","Lord Francel laments that this is only the latest in a series of incessant accusations against House Haillenarte. Alas, he will likely have to answer to the inquisitors, even if the charges are without merit. Given these circumstances, he cannot assist you in your search for the airship. Instead, he furnishes you with a letter of introduction to House Fortemps, assuring you that Lord Haurchefant of Camp Dragonhead will offer you his full support.","Lord Haurchefant's face darkens as he reads the contents of the missive and learns of the charges against Lord Francel. Putting his frustrations aside, he invites you to stay in Camp Dragonhead as a guest of House Fortemps, and states that he will make inquiries on your behalf. Having found a powerful friend in Coerthas, it may be wise to repay his kindness."],"objectives":["Speak with Francel.","Deliver the letter to Haurchefant."],"dialogue":[{"name":"CARRILAUT","text":"(Come closer, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, and listen well. This is for your ears only.)"},{"name":"CARRILAUT","text":"(Lord Francel is no heretic. He is a goodly, righteous man, wholly dedicated to the cause.)"},{"name":"CARRILAUT","text":"(I know this because I served House Haillenarte for years prior to the Calamity.)"},{"name":"CARRILAUT","text":"(You must go to Skyfire Locks and warn him of the coming storm. The inquisitors are ruthless and will spare him no mercy.)"},{"name":"CARRILAUT","text":"(Speak to him of an edelweiss, and he will know you for a friend. Now, go.)"},{"name":"FRANCEL","text":"Yes? You look as though you have something to say. Do you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I seek an audience with the bearers of the <span class=\"emphasis\">white lily</span>."},{"name":"A2","text":"I will go whither the <span class=\"emphasis\">wild rose</span> blooms."},{"name":"A3","text":"Is that an <span class=\"emphasis\">edelweiss</span> in your pocket, or are you happy to meet me?"},{"name":"A4","text":"Nothing."},{"name":"FRANCEL","text":"Then you have come to the wrong place, for we of House Haillenarte bear the rose. Mayhap you should journey to Gridania? I believe an ancient Duskwight house was said to use the white lily as its sigil."},{"name":"FRANCEL","text":"...What an odd thing to say. Did you perchance receive a blow to the head not long ago? Or is this some queer southron jest?"},{"name":"FRANCEL","text":"I see Ser Carrilaut has not forgotten my mother's favorite flower. A pity it has not been seen in Coerthas since the Calamity. You may speak freely here, friend."},{"name":"FRANCEL","text":"That's...that's absurd! I would sooner die than become a thrall of the dragons!"},{"name":"FRANCEL","text":"Alas, it matters little what I say at this point. Although the draconian rosary was not found in my possession, it will still be considered by many to be proof of my “heresy.” I must do my utmost to prove my innocence to the inquisitors, for if they harbor even the slightest doubt..."},{"name":"FRANCEL","text":"&lt;sigh&gt; This will only add weight to the incessant accusations our house has suffered of late. It's as though the gods themselves are plotting our fall..."},{"name":"FRANCEL","text":"You risk much by coming here. It is only proper that I recompense you for this deed. Tell me what you desire, and I shall do my best to provide."},{"name":"FRANCEL","text":"A missing airship? I see. It may require a prolonged effort to locate your quarry. I shall direct you to one in a better position to assist you."},{"name":"FRANCEL","text":"Lord Haurchefant of House Fortemps commands the garrison at Camp Dragonhead. Present to him this letter of introduction, and he will surely be receptive to your needs."},{"name":"HAURCHEFANT","text":"Ah, the unmistakable swagger of a well-traveled adventurer. If you are come to pay your respects, be at ease, friend. I am not one to stand on formality."},{"name":"HAURCHEFANT","text":"Truth be told, I would gladly welcome many and more brave souls like yourself. But enough chatter─pray tell me why you have come."},{"name":"HAURCHEFANT","text":"If there is any justice in this world, these charges will receive no serious consideration."},{"name":"HAURCHEFANT","text":"It is beyond inconceivable... Ah, yes. The letter made mention of a pressing matter for which you required assistance. What might that be?"},{"name":"HAURCHEFANT","text":"So this <span class=\"emphasis\">Enterprise</span> you speak of was last seen above Coerthas before the Calamity five years ago. I fear it may prove difficult to find any eyewitnesses to these events, for while Ishgard did not participate in the Battle of Carteneau, we were embroiled in our own internal conflicts at the time."},{"name":"HAURCHEFANT","text":"Nevertheless, I will make inquiries on your behalf and share with you my findings in the future."},{"name":"HAURCHEFANT","text":"In the meantime, please enjoy the hospitality of Camp Dragonhead. I will see that you are afforded every courtesy as a guest of House Fortemps."}],"reward":{"gil":1544,"items":[{"id":3386,"one":1},{"id":27990,"one":1},{"id":3383,"one":1},{"num":5,"id":5825,"one":1}],"xp":18900},"reqs":{"jobs":[{"lvl":36,"id":130}],"quests":[66425]},"next":[66432,66433,66434,66435,66437,66438,66439]},"partials":[{"type":"npc","id":"1006382","obj":{"i":1006382,"n":"Carrilaut","l":63,"q":2}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006383","obj":{"i":1006383,"n":"Francel","l":63,"q":2}},{"type":"item","id":"3386","obj":{"i":3386,"n":"Heavy Steel Flanchard","l":35,"c":45293,"t":36,"p":6480}},{"type":"item","id":"27990","obj":{"i":27990,"n":"Altered Linen Chausses","l":36,"c":45280,"t":36}},{"type":"item","id":"3383","obj":{"i":3383,"n":"Linen Sarouel","l":35,"c":45179,"t":36,"p":2592}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66425","obj":{"i":66425,"n":"Three for Three","g":1,"l":"Coerthas Central Highlands","s":194}},{"type":"quest","id":"66432","obj":{"i":66432,"n":"Feats of Strength","g":0,"l":"Coerthas Central Highlands","s":196}},{"type":"quest","id":"66433","obj":{"i":66433,"n":"The Talk of Coerthas","g":1,"l":"Coerthas Central Highlands","s":197}},{"type":"quest","id":"66434","obj":{"i":66434,"n":"Papa Do Preach","g":94,"l":"Coerthas Central Highlands","s":370}},{"type":"quest","id":"66435","obj":{"i":66435,"n":"Dead Is Dead","g":94,"l":"Coerthas Central Highlands","s":370}},{"type":"quest","id":"66437","obj":{"i":66437,"n":"Sebastian vs. the Ogre","g":94,"l":"Coerthas Central Highlands","s":380}},{"type":"quest","id":"66438","obj":{"i":66438,"n":"Dark and Stormy Night","g":94,"l":"Coerthas Central Highlands","s":370}},{"type":"quest","id":"66439","obj":{"i":66439,"n":"Too Many Enemies","g":94,"l":"Coerthas Central Highlands","s":370}}]}