{"quest":{"name":"Speak Softly to Me","location":"Coerthas Central Highlands","id":66424,"patch":2.0,"sort":360,"eventIcon":71221,"issuer":1006381,"target":1006381,"genre":94,"journal":["Maucolyn's teeth are chattering from something other than cold, and he has the beseeching look of one seeking an adventurer's cure to a nasty ill.","Maucolyn's visit to the snowhouse has given him a bad fright. A voice without a mouth is troubling indeed, and you have been tasked with discovering what it is that speaks in the icy shelter.","The speaker is a melting snowman, built by some knight in a carefree moment. Its sorrow at the impending thaw has given it voice. Reach across the vast gulf of common sense and /rally the snowman.","Your discomfort with this relationship is all too obvious. The snowman is affronted, and you fear the anger will further unfreeze his flesh. /soothe him or you shall be responsible for his sad demise.","Your attempt to comfort the man of snow is well played─desperation has birthed many great moments in acting. The snowman is in an expansive mood, though still melancholy. Unearth your inner lickspittle and /cheer him with all your heart.","Sometimes, passions burn the brightest when the end is near. His ardor enkindled by your lusty cheer, the snowman demands you /blowkiss to him as proof of your fondness.","In a few minutes with you, the snowman has lived a lifetime─and now he is ready to go quietly into that good night. Tell him /goodbye.","The snowman subsides into silence. Tears prickle your eyelids but you do not weep, for you know the pain of frostbitten cheeks. Maucolyn will learn the truth, and mayhap weep in your stead.","Maucolyn happily dismisses the talking snowman as a youthful prank. A happy customer means a job well done, but your heart tells you it was no mummery."],"objectives":["Locate the source of the voice.","/rally the snowman.","/soothe the snowman.","/cheer the snowman.","/blowkiss at the snowman.","Say /goodbye to the snowman.","Report to Maucolyn."],"dialogue":[{"name":"MAUCOLYN","text":"I need to talk to you, adventurer. I was down in the snowhouse, keepin' outta the wind, when I heard whispers─I swear it on the lives of my chocobos. I couldn't see anyone in there, but I'm sure I heard somethin'!"},{"name":"MAUCOLYN","text":"Go an' see who 'twas, else I don't know how I'll sleep tonight."},{"name":"SNOWMAN","text":"(-Snowman-)Hello, I are snowman, man of snow; dripping we is, our hold on life slipping..."},{"name":"SNOWMAN","text":"(-Snowman-)Sad I are so many dreams we had; <span class=\"highlight\">rally</span> my spirits, won't you, ere the finale..."},{"name":"SNOWMAN","text":"(-Snowman-)Profane you do our pain with a rally so mundane! As to shelter with a booth, my icebound heart do <span class=\"highlight\">soothe</span>."},{"name":"SNOWMAN","text":"(-Snowman-)Willing I are to take the top billing; a battery of gallantry from the artillery of flattery; <span class=\"highlight\">cheer</span> us until dry are the tears..."},{"name":"SNOWMAN","text":"(-Snowman-)Like me you do really twice does lightning strike? <span class=\"highlight\">Kiss</span> me, friend, if us you'll miss! Throw it, though, not nice to smooch on snow."},{"name":"SNOWMAN","text":"(-Snowman-)Farewell, adventurer, so many troubles you quell. Peace we is at, drunk we have life to the lees. <span class=\"highlight\">Bye-bye</span>, world, all that lives must someday die..."},{"name":"SNOWMAN","text":"(-Snowman-)...Must someday die."},{"name":"SNOWMAN","text":"(-Snowman-)Lackluster you are, no energy can you muster. Pfeph!"},{"name":"SNOWMAN","text":"(-Snowman-)Bye-bye, cruel world, love is a lie and adventurers soon die."},{"name":"SNOWMAN","text":"(-Snowman-)..."},{"name":"MAUCOLYN","text":"Did ye find out who was talkin'? I can see from your aspect ye did!"},{"name":"MAUCOLYN","text":"A snowman? Ye don't say. An' speakin' in rude poesy? I see now, someone's havin' a bit o' fun with the both of us, likely some young'uns. Haha! I'll rest easy now, I can tell ye that."}],"reward":{"gil":3000,"items":[{"id":15}],"xp":9450},"reqs":{"jobs":[{"lvl":36,"id":1}]}},"partials":[{"type":"npc","id":"1006381","obj":{"i":1006381,"n":"Maucolyn","l":63,"q":2}}]}