{"quest":{"name":"White Mischief","location":"Coerthas Central Highlands","id":66427,"patch":2.0,"sort":360,"eventIcon":71221,"issuer":1006385,"target":1006385,"genre":94,"journal":["Wild-eyed and near wordless with shock, a deeply shaken Duvicauroix seeks an intrepid sword to hunt a ravening horror.","A creature both large and vicious has attacked a caravan, leaving all but Duvicauroix dead. You judge that whatever it is, it will return to the scene of the slaughter to feed. Lurk near the bloodstained snow and strike when the creature appears.","The slaughterer of the caravan turns out to be the diminutive white death, whose size belies its vast appetite for blood. From this day on, you can claim to have vanquished death, though many will be nonplussed by the jest. Tell Duvicauroix that the deed is done.","Duvicauroix hears your report with amazement. While the size of the white death causes him some consternation, he is glad to hear that his companions are avenged and the road to the Observatorium is safe again."],"objectives":["Lurk near the bloodstained snow and slay the unknown terror.","Report to Duvicauroix."],"dialogue":[{"name":"DUVICAUROIX","text":"Help me, for the ruth of Halone, help me! My caravan─all are slain! Something huge and savage lunged out of the storm─the screams, I..."},{"name":"DUVICAUROIX","text":"You got to go and kill the swivin' thing, kill it as it did my traveling companions! As long as that monster's out there, every one of our arses will be hanging out in the wind."},{"name":"DUVICAUROIX","text":"Look sharp, eh, adventurer, as adept as you are with your steel. Whatever it was, it seemed to be everywhere at once, red murder wreathed in white storm..."},{"name":"DUVICAUROIX","text":"All killed...by this wee thing? Huh, I took the span of its leap for the span of a giant's limbs. A corrupt little rotter, killing far more than it could hope to eat. Where's the gain in that?"},{"name":"DUVICAUROIX","text":"Well, I'm obliged to you. You get to know them who travel the trade routes with you. Good men they were, every last one─maybe not that tall fellow from Gridania, we could've spared him easy─and I'm glad to have settled the hash of that murdering pocket fiend."},{"name":"POP","text":"You sense death, ready to pounce!"}],"reward":{"gil":1544,"xp":9450},"reqs":{"jobs":[{"lvl":36,"id":1}]}},"partials":[{"type":"npc","id":"1006385","obj":{"i":1006385,"n":"Duvicauroix","l":63,"q":4}}]}