{"quest":{"name":"Sheep to the Slaughter","location":"Coerthas Central Highlands","id":66429,"patch":2.0,"sort":360,"eventIcon":71221,"issuer":1006387,"target":1006387,"involved":[1006388,1006389,1006390,1006391],"genre":94,"journal":["A man may die of want in a fort as well as a hovel, and Sylvaintel has need of an adept hunter to help victual the Locks.","Some Locks at Skyfire have little in the way of extra supplies laid in for hungry, shivering masses. Fortunately, the karakuls are dinner and dress in one. Cull them and collect their meat and skin.","What does not ache of your hands is numb with cold, but the work is done. Deliver three each of the mutton slices and sheepskin to the four sentries at the Locks.","You deliver the meat and skin to the four sentries, to varying responses. It is a curious fact that while Ishgard may worship one god, they no more speak in one voice than those who follow the Twelve, as is right and proper. Inform Sylvaintel that your task is complete.","Clearly, Sylvaintel has come to trust not only your abilities but your discretion. He shares his fear that Ishgard faces an existential challenge─and while grateful for your aid, already he begins to ponder further preparations against the shadows of future tribulations."],"objectives":["Collect skin and meat from karakuls.","Deliver the supplies to sentries.","Report to Sylvaintel."],"dialogue":[{"name":"SYLVAINTEL","text":"The commonfolk of Ishgard know to seek shelter in Skyfire Locks whenever the dragons attack in force. Each stronghold must be victualed with these extra mouths in mind."},{"name":"SYLVAINTEL","text":"Will you help secure meat and sheepskin from the karakuls that roam the snowy plains? These stockpiles will mean the difference between life and death for the helpless folk under our protection."},{"name":"SYLVAINTEL","text":"When the sheep are skinned and dressed, make your deliveries to the strongholds and watchtowers. Every morsel and every shield against the cold counts, no matter how small."},{"name":"PRAIRILLOT","text":"How like Sylvaintel to entrust as important a task as this to an adventurer. You, at least, can be trusted to complete the work you are given, but still...<br>I thank you for the delivery, you may go."},{"name":"SAISTENIOUX","text":"I thank you for these─'tis miserable work dressing so many beasts in a cold such as this. Would that this meat were for a feast to celebrate a victory! I hear the unbelievers grow bold, hampered as we are by the snow. I pray that we are not defeated by cold and hunger ere we can meet the dragons in battle."},{"name":"TIRAULAND","text":"Thank you kindly, <span class=\"highlight\">Forename</span>! We are without the men we need to lay in extra supplies, so thin are we stretched by the terrors of this winter. Adventurers such as yourself were sent by Halone Herself─would that the commanders saw the truth of it."},{"name":"MARTIALLAIS","text":"What do they expect us to do with such paltry─forgive me, I speak out of turn. You have done your duty, and a great service it is to us for we are short of men. It is the enemy that weighs on me─snow, rather than fire."},{"name":"SYLVAINTEL","text":"My gratitude, adventurer. The rocks upon which Ishgard is built are less stalwart than we could ever have thought, five years ago. There has never been such a time as this. The shadows gather with alacrity, and we must make whatever preparations we can."}],"reward":{"items":[{"id":4335,"one":1},{"id":4124,"one":1},{"num":5,"id":5825,"one":1}],"xp":9450},"reqs":{"jobs":[{"lvl":36,"id":1}]}},"partials":[{"type":"npc","id":"1006387","obj":{"i":1006387,"n":"Sylvaintel","l":63,"q":2}},{"type":"npc","id":"1006388","obj":{"i":1006388,"n":"Prairillot","l":63,"q":2}},{"type":"npc","id":"1006389","obj":{"i":1006389,"n":"Saistenioux","l":63,"q":1}},{"type":"npc","id":"1006390","obj":{"i":1006390,"n":"Tirauland","l":63,"q":1}},{"type":"npc","id":"1006391","obj":{"i":1006391,"n":"Martiallais","l":63,"q":1}},{"type":"item","id":"4335","obj":{"i":4335,"n":"Mythril Gorget","l":36,"c":54805,"t":40}},{"type":"item","id":"4124","obj":{"i":4124,"n":"Mythril Wristlets","l":36,"c":55605,"t":42}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}}]}