{"quest":{"name":"Don't Light My Fire","location":"Coerthas Central Highlands","id":66436,"patch":2.0,"sort":370,"eventIcon":71221,"issuer":1006400,"target":1006400,"genre":94,"journal":["Ser Corentiaux wishes to discuss with you the latest difficulties at Dragonhead.","A patrol of knights, fresh from triumph on the front, has been led astray by will-o'-the-wykes in the blizzard. Of those that returned, many are badly frostbitten. There is only one thing to be done: four wykes must be dispatched by your capable hands.","The wykes are slain. The lowly adventurer succeeds where the High Houses have failed, though you should keep the thought to yourself if you enjoy owning a tongue. Return to Ser Corentiaux and give him the good news.","Your report of the wykes' demise was heard with much delight. Adding the reward to your growing purse, you wonder why as insightful a man as Ser Corentiaux does not see what every child of the road does: the land itself has turned inimical, and lays siege to the hosts of Ishgard."],"objectives":["Slay will-o'-the-wykes.","Report to Corentiaux."],"dialogue":[{"name":"CORENTIAUX","text":"A word, if I may. Have you the inclination to undertake another commission? I would not ask if you did not look rested and refreshed."},{"name":"CORENTIAUX","text":"You may have heard whispers of it, but a patrol lost its way in the blizzard and wandered into the Ogre's Belly. Needless to say, not all of them returned alive, and the sawbones have been carving all manner of bits off of those that did."},{"name":"CORENTIAUX","text":"They mistook will-o'-the-wykes for the light of the camp and were lured to the cave. We've enough perils around us without those quizzing devils amusing themselves thus."},{"name":"CORENTIAUX","text":"We cannot have men gainsaying their own eyes, afraid to trust the lights they see in the distance. Will you take yourself to the Ogre's Belly and dispatch those wykes?"},{"name":"CORENTIAUX","text":"Back so soon, and with full success? Those wykes never knew what struck them, I'll wager! By Halone, it is good to have something go well!"},{"name":"CORENTIAUX","text":"Ah, forgive my outburst. It has been a difficult week...moon...some longer span of time. Like a siege though none exists...and man cannot live in a constant state of unhappy strain. The success you convey back to me means a great deal."}],"reward":{"gil":1861,"xp":9660},"reqs":{"jobs":[{"lvl":37,"id":1}],"quests":[66435]}},"partials":[{"type":"npc","id":"1006400","obj":{"i":1006400,"n":"Corentiaux","l":63,"q":2}},{"type":"quest","id":"66435","obj":{"i":66435,"n":"Dead Is Dead","g":94,"l":"Coerthas Central Highlands","s":370}}]}