{"quest":{"name":"I'd Rather Be Cannon Fodder","location":"Coerthas Central Highlands","id":66430,"patch":2.0,"sort":360,"eventIcon":71221,"issuer":1006386,"target":1006386,"involved":[1006387],"genre":94,"journal":["Stephannot has no love for adventurers, but beggars cannot be choosers and your help is urgently needed.","One of Stephannot's young recruits has gone missing after leaving for Camp Dragonhead. He is likely lost on the north road where wild creatures sometimes stalk soft prey. Follow the recruit's trail while it is still fresh.","After a brutal battle in which you nearly lost <span class=\"alternative-container\"><span class=\"alternative\">the source of your roguish charm</span><span class=\"alternative\">your most precious appendage</span></span>, the croc is dispatched. Like any good sleuth, you search the body and find a scarred silver ring, the least unspeakable of the creature's visceral cargo. See it to Stephannot's hands.","Stephannot confirms that the ring belonged to the young recruit. You are surprised to initially find him so resistant to the obvious truth, for he struck you as a pragmatic man. It seems that in Ishgard, being devoured by beastkin shames the eaten..."],"objectives":["Follow the recruit's trail.","Deliver the ring to Stephannot."],"dialogue":[{"name":"STEPHANNOT","text":"He should be back by now, even if he had to wait out the worst of this storm. Could he have wandered onto the north road? That way roam feral crocs..."},{"name":"STEPHANNOT","text":"Ahem...adventurer. I sent a runner to Camp Dragonhead, but he is many hours overdue. I fear he has lost his way, green recruit that he is. I would prevail upon you to fetch him back."},{"name":"STEPHANNOT","text":"Ah, adventurer. Where is the tomfool? If he's lost something to frostbite, he has none to blame but himself."},{"name":"STEPHANNOT","text":"This is the boy's ring. What is the meaning of this? A feral croc... Are you certain? He could simply have dropped it! I'll not stand for surmise when the boy's honor...what? Yes. He had ginger hair. Oh, for the ruth of Halone..."},{"name":"STEPHANNOT","text":"He was a good lad, afire to take his place in the war against the dragons. To die so ignominiously instead...I cannot tell his sire, yet to lie to a fellow knight about his own son─'tis more than I can tease out right now."},{"name":"POP","text":"You sense a creature swift and massive!"}],"reward":{"gil":1826,"xp":9450},"reqs":{"jobs":[{"lvl":36,"id":1}],"quests":[66428]},"next":[66431]},"partials":[{"type":"npc","id":"1006386","obj":{"i":1006386,"n":"Stephannot","l":63,"q":3}},{"type":"npc","id":"1006387","obj":{"i":1006387,"n":"Sylvaintel","l":63,"q":2}},{"type":"quest","id":"66428","obj":{"i":66428,"n":"Adding Fuel to the Fire","g":94,"l":"Coerthas Central Highlands","s":360}},{"type":"quest","id":"66431","obj":{"i":66431,"n":"Death Becomes You","g":94,"l":"Coerthas Central Highlands","s":360}}]}