{"quest":{"name":"Feats of Strength","location":"Coerthas Central Highlands","id":66432,"patch":2.0,"sort":196,"eventIcon":71201,"target":1006384,"involved":[1007715],"genre":0,"journal":["Lord Haurchefant has a humble request.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Haurchefant at Camp Dragonhead.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","The veteran wastes no time, immediately calling out to three young knights under his command, who attack you without warning. However, their greater numbers are no match for your superior skill. Inform Lord Haurchefant that you have done as requested.","Lord Haurchefant praises your performance, admitting that he observed everything from the stronghold's walls. Remarking that you are doubtless a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action, he proposes that you take a more active role in his inquiries into the whereabouts of the <span class=\"emphasis\">Enterprise</span>."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Haurchefant at Camp Dragonhead.</span>"],"dialogue":[{"name":"HAURCHEFANT","text":"It may take some time before I receive any information regarding your missing airship. While you wait, mayhap you might indulge me a small favor?"},{"name":"HAURCHEFANT","text":"It is obvious to me that you know much and more of the ways of war. I ask that you share that knowledge with our knights, so that they might be better prepared when next the Dravanian Horde strikes."},{"name":"HAURCHEFANT","text":"One of my veteran knights is presently conducting a training session just beyond our western gate. Pray seek him out and introduce yourself. He will explain how you can help."},{"name":"NPC","text":"A fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Lord Haurchefant tells me you possess a great deal of experience─certainly more than the green boys I mean to test today. If you will allow, I would like to even the odds by setting all three against you. No objections, yes? Then let us begin─knights, to arms!"},{"name":"NPC","text":"Hah! You certainly live up to Lord Haurchefant's expectations! 'Twas a privilege to watch you fight, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"HAURCHEFANT","text":"I observed everything from the western wall. Splendid performance, <span class=\"highlight\">Forename</span>!"},{"name":"HAURCHEFANT","text":"Mayhap you have discerned this during your short time here, but House Fortemps regards outsiders differently than the other High Houses. We have no objections to employing adventurers and sellswords, for example, whereas the others have, for all intents and purposes, forbidden the practice."},{"name":"HAURCHEFANT","text":"They do so at their peril. To disregard a man's talents solely because of the circumstances of his birth is shortsighted and foolish."},{"name":"HAURCHEFANT","text":"You know...after watching you spar with our knights, I am reminded that you are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action. Doubtless you would rather take a more active role in my inquiries, yes? Then let us discuss how you can do just that."},{"name":"POP","text":"A trio of battle cries assaults your ears!"}],"reward":{"xp":19320},"reqs":{"jobs":[{"lvl":36,"id":130}],"quests":[66426]}},"partials":[{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1007715","obj":{"i":1007715,"n":"Storied Knight","l":63,"q":1}},{"type":"quest","id":"66426","obj":{"i":66426,"n":"The Rose and the Unicorn","g":1,"l":"Coerthas Central Highlands","s":195}}]}