{"quest":{"name":"Following the Evidence","location":"Coerthas Central Highlands","id":66447,"patch":2.0,"sort":199,"eventIcon":71201,"issuer":1006384,"target":1006384,"involved":[1006412,1006413,1006414],"genre":1,"journal":["Lord Haurchefant suspects that someone is conspiring against Lord Francel.","Upon learning of the circumstances in which the draconian rosary said to be Lord Francel's was discovered, Lord Haurchefant has begun to suspect that the evidence may have been planted. He advises you to speak with Rickeman, a man in service to House Haillenarte, whom Lord Haurchefant thinks might have knowledge of how such an act could be accomplished.","Rickeman explains that if the shipments were indeed tampered with, the only possible culprits are porters and those who inspect their shipments. As the inspectors are all Ishgardian knights and inquisitors, Rickeman is forced to conclude that only the porters could be responsible. He reluctantly suggests that you question a crew of porters that should be arriving in Camp Dragonhead shortly.","Your intentions are misinterpreted by the porters, who take offense at being accused of tampering with shipments. One porter bids you search the parcels to your heart's content, as he is confident you will find nothing unusual.","Rifling through the shipments yields a startling discovery: the two parcels bound for Skyfire Locks both contained a draconian rosary! Present your findings to the porter and see what he has to say.","The porter denies any knowledge of the draconian rosaries, asserting that it would make no sense for him to allow you to search the parcels had he known what they contained. Consult with Lord Haurchefant to determine the best course of action.","Lord Haurchefant concludes that the rosaries are a blatant attempt to sully House Haillenarte's reputation. Having acquired what he believes is sufficient evidence, he exclaims that you and he must act quickly to stop Lord Francel's trial before it is too late."],"objectives":["Speak with Rickeman.","Speak with the porter.","Search the shipments.","Show the draconian rosaries to the porter.","Show the draconian rosaries to Haurchefant."],"dialogue":[{"name":"HAURCHEFANT","text":"As I see it, the key to proving Lord Francel's innocence is discrediting the evidence against him. I speak of the draconian rosary found in the chest you yourself recovered. If you would, please tell me of the incident in question."},{"name":"HAURCHEFANT","text":"...So it was found in a locked chest labeled as the property of Lord Francel. If the rosary was not his, then someone else with access <span class=\"emphasis\">must</span> have planted it. Here is what you must do: return to Skyfire Locks and speak with Rickeman. He works closely with the porters who ferry goods across Coerthas, so he may have some inkling of who could be responsible."},{"name":"RICKEMAN","text":"Eh? Someone tamperin' with shipments? Fury strike me down, if all them rosaries found in our people's possessions were planted... Hey now, don't you give me that look, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! I'm a House Haillenarte man through an' through. This heresy nonsense is bad for me an' my family too!"},{"name":"RICKEMAN","text":"I ain't sayin' the porters what were bringin' the shipment did it, though. I know most of them what work the trade routes, an' I've never had cause to question their faith. But if it wasn't them neither, then your guess is as good as mine. After all, most every shipment is thoroughly inspected before it─"},{"name":"RICKEMAN","text":"Eh? Could it've been the fellas what were responsible for the inspections? Hah! Ishgardian knights and inquisitors, the lot of them. As if they'd ever turn their cloaks. &lt;sigh&gt; Reckon that means the porters are your most likely suspects."},{"name":"RICKEMAN","text":"Hate to think it, but maybe you should question them. There's a crew comin' to Camp Dragonhead from Whitebrim Front <span class=\"alternative-container\"><span class=\"alternative\">this eve</span><span class=\"alternative\">this morn</span><span class=\"alternative\">today</span></span>. You might consider havin' a word with them."},{"name":"NPCA","text":"No time to talk─we're on a tight schedule. Once we've made our deliveries here, we're to deliver parcels to Skyfire Locks."},{"name":"NPCB","text":"&lt;yawn&gt; Say what you will. My conscience is clear."},{"name":"NPCB","text":"Beg your pardon? You suspect that we porters have been planting draconian rosaries in House Haillenarte shipments!? What nerve! If you truly believe such nonsense, search our parcels and see what you find!"},{"name":"SYSTEM","text":"You find a draconian rosary hidden inside the parcel."},{"name":"NPCB","text":"Are we finished? If so, I would appreciate an apology."},{"name":"NPCB","text":"But...but that's impossible! Once the knight at Whitebrim Front concluded her inspection, I loaded the parcels into the wagon myself!"},{"name":"NPCB","text":"And if I <span class=\"emphasis\">had</span> been the culprit, I would have <span class=\"emphasis\">never</span> allowed you to search my shipments! Say what you will to Lord Haurchefant─I will <span class=\"emphasis\">not</span> be held accountable for this!"},{"name":"HAURCHEFANT","text":"Did something happen outside? I thought I heard shouting... Ah, but more importantly, what did Rickeman have to say?"},{"name":"HAURCHEFANT","text":"More draconian rosaries!? In every single parcel bound for Skyfire Locks? That beggars belief!"},{"name":"HAURCHEFANT","text":"Even the inquisitors must acknowledge that this is no more than a crass attempt to sully House Haillenarte's reputation. Whoever is responsible has overplayed his hand."},{"name":"HAURCHEFANT","text":"And praise Halone that he did! Lord Francel's trial is upon us, and we must act now if we are to clear his name!"}],"reward":{"gil":1544,"xp":20210},"reqs":{"jobs":[{"lvl":38,"id":130}],"quests":[66446]},"next":[66448]},"partials":[{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006412","obj":{"i":1006412,"n":"Rickeman","l":63,"q":1}},{"type":"npc","id":"1006413","obj":{"i":1006413,"n":"Apathetic Porter","l":63,"q":1}},{"type":"npc","id":"1006414","obj":{"i":1006414,"n":"Plain-spoken Porter","l":63,"q":1}},{"type":"quest","id":"66446","obj":{"i":66446,"n":"Road to Redemption","g":1,"l":"Coerthas Central Highlands","s":198}},{"type":"quest","id":"66448","obj":{"i":66448,"n":"In the Eyes of Gods and Men","g":1,"l":"Coerthas Central Highlands","s":200}}]}