{"quest":{"name":"In the Eyes of Gods and Men","location":"Coerthas Central Highlands","id":66448,"patch":2.0,"sort":200,"icon":100139,"eventIcon":71201,"issuer":1006384,"target":1006384,"involved":[1006415,1006416],"genre":1,"journal":["Lord Haurchefant needs your help to clear Lord Francel's name.","With Lord Francel's trial close at hand, Lord Haurchefant bids you inform the inquisitors of your findings and petition them on behalf of House Fortemps to postpone the trial indefinitely. Relay Lord Haurchefant's words to Inquisitor Brigie at Camp Dragonhead.","Inquisitor Brigie informs you that Inquisitor Guillaime is already overseeing Lord Francel's trial at Witchdrop, and that it is impossible to call a halt to proceedings. Inform Lord Haurchefant of this development.","Refusing to abandon Lord Francel to his fate, Lord Haurchefant bids you rendezvous with one of his knights at Witchdrop, and do whatever is necessary to prevent Lord Francel from coming to harm. With Ser Hourlinet's aid, protect Lord Francel until Lord Haurchefant arrives.","Inquisitor Guillaime ignores your pleas and instead commands his knights to slay you then and there. Even Lord Haurchefant is unable to convince the inquisitor to yield─until you reveal that one of the Temple Knights was a heretic in disguise. Forced to acknowledge that there is merit to Lord Haurchefant's claims of a conspiracy, Inquisitor Guillaime agrees to withdraw his charges and departs─though not before reminding you to stay focused on your search for the <span class=\"emphasis\">Enterprise</span>. Now that Lord Francel's good name has been redeemed, return to Camp Dragonhead and ask Lord Haurchefant to summon his reluctant witness.","Lord Haurchefant thanks you for saving the young lordling's life, and indeed his own, at Witchdrop. Like you, he is eager to return to the matter of the <span class=\"emphasis\">Enterprise</span>, and none too soon..."],"objectives":["Speak with Brigie.","Speak with Haurchefant.","Speak with Hourlinet.","Speak with Haurchefant."],"dialogue":[{"name":"HAURCHEFANT","text":"From the very first, I <span class=\"emphasis\">knew</span> it could not be that so many members of House Haillenarte were heretics. At last, we can give the lie to these poisonous allegations, and put an end to this travesty!"},{"name":"HAURCHEFANT","text":"I will need to prepare a formal statement regarding these developments for the Holy See. In the meantime, I would have you bear my words to Inquisitor Brigie. Tell her that House Fortemps asks─nay, <span class=\"emphasis\">demands</span> that Lord Francel's trial be postponed until a full investigation has been conducted!"},{"name":"BRIGIE","text":"What is it, my child? Hm? Lord Haurchefant would have the inquisitors do what?"},{"name":"BRIGIE","text":"But that is not possible. Inquisitor Guillaime presides over Lord Francel's trial at Witchdrop even as we speak."},{"name":"BRIGIE","text":"Fear not: if Lord Francel is indeed innocent, he shall walk in Halone's halls with the fallen heroes of Ishgard."},{"name":"HAURCHEFANT","text":"They have taken Lord Francel to <span class=\"emphasis\">Witchdrop</span>!? This is madness! The inquisitor does not have sufficient grounds to subject him to that manner of trial!"},{"name":"HAURCHEFANT","text":"I will not stand idly by and allow an innocent man to die. <span class=\"highlight\">Forename</span>, I would dispatch you and one of my knights to Witchdrop to forestall the proceedings until such time as I am able to join you and petition Inquisitor Guillaime in person. I will endeavor not to keep you waiting too long."},{"name":"HAURCHEFANT","text":"Do whatever you must to keep Lord Francel alive!"},{"name":"HOURLINET","text":"Hail, <span class=\"highlight\">Forename</span>. As you can see, Lord Francel yet lives. We must try to reason with the inquisitor─but if his guards judge us a threat, we must also be prepared to defend ourselves."},{"name":"GUILLAIME","text":"Joacin Charlemend Francel de Haillenarte─you stand accused of heresy against the Holy See of Ishgard. Is there aught you wish to say in your defense?"},{"name":"FRANCEL","text":"Hear me, brothers─these charges are false! The men and women of my line have ever opposed the Dravanians, and I am no different! Since the very birth of our nation, we have gladly shed blood in service to the Holy See! Condemn me and you will strike a blow for the enemies of Ishgard!"},{"name":"GUILLAIME","text":"It is for Halone to judge if you speak the truth."},{"name":"GUILLAIME","text":"Prove your innocence in the eyes of gods and men. Leap from the cliff and entrust your fate to the Fury."},{"name":"GUILLAIME","text":"The righteous shall take their place in Halone's halls, while the wicked shall reveal their drachen forms and be put to the sword!"},{"name":"HOURLINET","text":"In the name of House Fortemps, I beseech you─stay your hand!"},{"name":"HOURLINET","text":"Inquisitor, we are come on behalf of Lord Haurchefant. My lord has uncovered evidence which suggests that the charges against Lord Francel are without merit."},{"name":"HOURLINET","text":"We humbly request that these proceedings be suspended until such time as a full reexamination of the facts has been conducted."},{"name":"GUILLAIME","text":"Lord Haurchefant has allowed his personal relationship with the accused to cloud his judgment. That he should harbor private doubts, I might have allowed...but that he would <span class=\"emphasis\">dare</span> interfere in legal proceedings sanctioned by the Holy See, I cannot."},{"name":"GUILLAIME","text":"To defy the will of an inquisitor is to commit heresy! A crime for which there is but one punishment!"},{"name":"HOURLINET","text":"We must hold them until Lord Haurchefant arrives, <span class=\"highlight\">Forename</span>! And remember─no harm can come to the inquisitor!"},{"name":"HAURCHEFANT","text":"It is not our intention to defy the will of the archbishop."},{"name":"HAURCHEFANT","text":"But this trial─like many others, I fear─has been orchestrated by enemies of House Haillenarte. They have used you and your fellows to sow discord, Inquisitor─to set brother against brother, that we may tear ourselves apart."},{"name":"GUILLAIME","text":"...The fevered imaginings of a desperate man. What proof have you of this?"},{"name":"HAURCHEFANT","text":"By the Fury...a draconian rosary! Then the knight who refused to yield─it was <span class=\"emphasis\">he</span> who summoned the wyvern!"},{"name":"GUILLAIME","text":"A heretic in the ranks of the Temple Knights. This has grave implications..."},{"name":"GUILLAIME","text":"Your claims...would appear to have merit, Lord Haurchefant. I shall withdraw my charges against Lord Francel, pending further investigation."},{"name":"GUILLAIME","text":"I trust you have not lost sight of that which first brought you to Coerthas, <span class=\"highlight\">Forename</span>. Pray locate your errant airship...and use it."},{"name":"FRANCEL","text":"Lord Haurchefant, I have not the words to express my gratitude. But why would you risk your reputation to save mine?"},{"name":"HAURCHEFANT","text":"Because I know you, boy. You're too loyal to betray Ishgard, and too devout to question your sentence. Had we been any slower, you'd have jumped of your own free will."},{"name":"FRANCEL","text":"I...I would have done whatever it took to redeem House Haillenarte."},{"name":"HAURCHEFANT","text":"Praise Halone it did not come to that. But it profits us little to dwell on what might have been."},{"name":"HAURCHEFANT","text":"Let us quit this place, <span class=\"highlight\">Forename</span>. Pray visit me at Camp Dragonhead once you have recuperated."},{"name":"HAURCHEFANT","text":"You look well, <span class=\"highlight\">Forename</span>. May I say what a pleasure it was to fight alongside such a fearless and skillful warrior."},{"name":"HAURCHEFANT","text":"Were it not for you, Lord Francel would surely have died defending the honor of his house─and I might well have perished at the hands of a heretic and his wyvern."},{"name":"HAURCHEFANT","text":"House Fortemps and House Haillenarte shall never forget your service. Now, let us return to the matter of your missing <span class=\"emphasis\">Enterprise</span>!"},{"name":"QIB","text":"Defeat Inquisitor Guillaime's guards!"},{"name":"QIB","text":"Pick up Alderique's rosary."},{"name":"HOURLINET","text":"Your shield bears no sigil, ser! Do you serve the Holy See or one of the High Houses?"},{"name":"ALDERIQUE","text":"I serve a <span class=\"emphasis\">higher</span> power!"},{"name":"HOURLINET","text":"Look, look! Lord Haurchefant is come!"},{"name":"HAURCHEFANT","text":"In the name of House Fortemps, I demand that you lay down your arms!"},{"name":"GUILLAIME","text":"By this deed, you do disgrace your line, Lord Haurchefant!"},{"name":"HAURCHEFANT","text":"A wyvern!? But there were no reports of Dravanian activity!"},{"name":"GUILLAIME","text":"You would call upon your allies to save you!? At last, your treachery is laid bare!"},{"name":"ALDERIQUE","text":"This...this will not be forgotten..."},{"name":"HAURCHEFANT","text":"Ugh... It cannot end this way...it mustn't..."},{"name":"FRIEND","text":"Forgive my weakness..."},{"name":"FRIEND","text":"Ishgardian scum! Today you shall answer for your sins!"}],"reward":{"gil":2878,"xp":20210},"reqs":{"jobs":[{"lvl":38,"id":130}],"quests":[66447]},"next":[66449,66453,69404]},"partials":[{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006415","obj":{"i":1006415,"n":"Brigie","l":63,"q":1}},{"type":"npc","id":"1006416","obj":{"i":1006416,"n":"Hourlinet","l":63,"q":1}},{"type":"quest","id":"66447","obj":{"i":66447,"n":"Following the Evidence","g":1,"l":"Coerthas Central Highlands","s":199}},{"type":"quest","id":"66449","obj":{"i":66449,"n":"A Cup of Joy","g":94,"l":"Coerthas Central Highlands","s":380}},{"type":"quest","id":"66453","obj":{"i":66453,"n":"The Final Flight of the Enterprise","g":0,"l":"Coerthas Central Highlands","s":201}},{"type":"quest","id":"69404","obj":{"i":69404,"n":"The Final Flight of the Enterprise","g":1,"l":"Coerthas Central Highlands","s":201}}]}