{"quest":{"name":"Stand and Quiver","location":"Coerthas Central Highlands","id":66441,"patch":2.0,"sort":370,"eventIcon":71221,"issuer":1006403,"target":1006404,"genre":94,"journal":["Belmont requires your service, and his air of command is hard to resist.","Belmont desires contact with his former comrade in the Gods' Quiver in order to quickly begin a campaign against the Ixal in Coerthas. Travel to the North Shroud and take Belmont's letter to Isaudorel at the Bobbing Cork in Fallgourd Float.","The White Rams appear to have a particular interest in the Ixal, and Isaudorel is quick to pledge the levy to Belmont's campaign. Isaudorel also lets drop that Belmont inexplicably traded an honored place in the White Rams for the life of a sellsword..."],"objectives":["Deliver the letter to Isaudorel in Fallgourd Float."],"dialogue":[{"name":"BELMONT","text":"The Ixal are moving into Coerthas in a lasting way. It's no small task to bring those logs from the Twelveswood this far west."},{"name":"BELMONT","text":"They must be using their cursed balloons, those shite–birds. Even their supplies have wings, and what comes out of the balloons goes into the ground of Coerthas. We need to hit 'em now before their settlement gets bigger."},{"name":"BELMONT","text":"The Ishgardians won't give a swive till it's too late. I need my own people. Take this letter to a reprobate named Isaudorel; we fought together in the Quiver, once. His levy's garrisoned at Fallgourd Float."},{"name":"BELMONT","text":"I fight not for Ishgard in this matter, but if they want to consider it a debt, fine by me. It goads me that the Ixal are waltzing into Coerthas right under my nose."},{"name":"ISAUDOREL","text":"Damn and blast, that hurts! I hate being wounded worse than being dead! They call me “the Ram that batters,” not the “battered sheep”!<br>...<span class=\"highlight\">Forename</span>, eh? Well, state your business."},{"name":"ISAUDOREL","text":"A letter for me? From Belmont, well, well! I tell you, how the best tactics officer the White Rams ever had can suffer to be a moilin' sellsword, that one I'll never understand."},{"name":"ISAUDOREL","text":"Hm, the roads haven't rusted that bucket of his. If he says the shite–birds are moving into Coerthas, that's good enough. We White Rams owe the Ixal pain─tell him whatever we can do, just name it."}],"reward":{"gil":1478,"xp":9660},"reqs":{"jobs":[{"lvl":37,"id":1}],"quests":[66440]},"next":[66442]},"partials":[{"type":"npc","id":"1006403","obj":{"i":1006403,"n":"Belmont","l":63,"q":4}},{"type":"npc","id":"1006404","obj":{"i":1006404,"n":"Isaudorel","l":57,"q":2}},{"type":"quest","id":"66440","obj":{"i":66440,"n":"The Forest for the Trees","g":94,"l":"Coerthas Central Highlands","s":370}},{"type":"quest","id":"66442","obj":{"i":66442,"n":"Tit for Tat","g":92,"l":"North Shroud","s":370}}]}