{"quest":{"name":"From Gridania, with Love","location":"North Shroud","id":66445,"patch":2.0,"sort":370,"eventIcon":71221,"issuer":1006406,"target":1006403,"genre":92,"journal":["The incomparable body language of her people says loud and clear that Molkot requires one adventurer, ready to travel, right meow.","With much hissing and spitting, Molkot has decided to commit the White Rams to a struggle that sprawls beyond the Twelveswood into Coerthas. Give her letter to Belmont, and inform the sellsword that the Rams are with him.","You deliver the letter to Belmont, who is thunderstruck to receive word from the leader of the Rams herself. As he in turn pledges himself to the fight, you can almost see the louche swagger of the sellsword fall away from him..."],"objectives":["Deliver the letter to Belmont at Camp Dragonhead."],"dialogue":[{"name":"MIAHMOLKOT","text":"Coerthas and the Twelveswood... Busy little birdies they've been, filling their crop with all manner of juicy worms."},{"name":"MIAHMOLKOT","text":"Or a juicy something else? How now, there's a thought. They could be extracting <span class=\"emphasis\">crystals</span> from those trees─treats for their big bird, the primal Garuda..."},{"name":"MIAHMOLKOT","text":"Adventurer! Are you as fleet as they say? I've a letter going to Coerthas, for Belmont."},{"name":"MIAHMOLKOT","text":"And tell that by–blow he can count on us─and that he'd better be as good a tactician as he used to be, even if he sleeps on feathered beds now with a strumpet on each side o' him!"},{"name":"BELMONT","text":"Back, in one piece! Pardon me if I don't ask about the journey, but what did Isaudorel say? Think he can get the White Rams interested?"},{"name":"BELMONT","text":"A letter from Molkot? By the Twelve, the Ixal <span class=\"emphasis\">are</span> cutting down trees in the Twelveswood! And to offer the crystals to Garuda─'tis worse than I thought."},{"name":"BELMONT","text":"She said that, eh? S'pose I've been soft long enough. I've eaten my fine table scraps and slept on a feather bed or two, though I won't swear to the other thing. It's the will of the Twelve, is what this is."},{"name":"BELMONT","text":"The White Rams in the Twelveswood, me in Coerthas...with whoever will join me. The high and mighty houses of Ishgard can go swive 'emselves. We'll stop the Ixal with or without 'em."}],"reward":{"gil":1478,"xp":9660},"reqs":{"jobs":[{"lvl":37,"id":1}],"quests":[66444]}},"partials":[{"type":"npc","id":"1006406","obj":{"i":1006406,"n":"Miah Molkot","l":57,"q":5}},{"type":"npc","id":"1006403","obj":{"i":1006403,"n":"Belmont","l":63,"q":4}},{"type":"quest","id":"66444","obj":{"i":66444,"n":"Don't Shut Me Out","g":92,"l":"North Shroud","s":370}}]}