{"quest":{"name":"Dishonor Before Death","location":"Ul'dah","id":66457,"patch":2.0,"sort":380,"icon":112011,"unlocksFunction":1,"eventIcon":71341,"issuer":1006440,"target":1007818,"genre":93,"journal":["Sibold has but little time left, and would confide to you his burdens.","The advancing years spell the end of Sibold's annual pilgrimage to Cutter's Cry. Along with Nymeia lilies for the burial mound, the famed sellsword entrusts you with the tale of his companions' death─and of his own survival.","Time has gentled the contours of the earth raised over the dead. You place the lilies and say your young <span class=\"alternative-container\"><span class=\"alternative\">woman's</span><span class=\"alternative\">man's</span></span> orisons before espying Private Norman guarding the entrance of the cave. Speak with him.","Norman affirms that the chimera still lives. The sound he bade you listen to seems to grow stronger, melding with the beat of your own heart...<br><br>※Cutter's Cry can be accessed via the Duty Finder."],"objectives":["Place the lilies on the burial mound at Cutter's Cry.","Speak with Norman."],"dialogue":[{"name":"SIBOLD","text":"Time heals all wounds, or so say those who have never experienced true pain. More'n thirty summers've passed since I carried the standard of the Darklight Raiders into Cutter's Cry, but not a day goes by that I don't see the faces of the friends I lost that fateful day─Gerbald the Red and his loyal second, Aubriest Stillwater; Symon the Sweet, always armed with a jab and jest; our ever ireful mage Chiran Zabran, as quick to cast as he was to temper; Thormoen Thousandgil, never has there lived a man with a tighter grip, be it on his sword or his coin; and let us not forget One-ilm Alesone..."},{"name":"SIBOLD","text":"Though it's hard to fathom now, what with all the adventurers scamperin' about like rabbits in the spring, there was once a time when bands of mercenaries were who the city–states turned to when in need of a blade─the Darklight Raiders being the biggest and best of them bands. Ishgardian-funded forays into hellish pits like the Aurum Vale would earn us a king's ransom in a matter of days, though it would only take a night of devil's play at the Mirage to see it gone from our purses. But so was the life of a Raider. That is, until we took that job at Cutter's Cry."},{"name":"SIBOLD","text":"My brothers and I had stood against herds of giant buffaloes on O'Ghomoro, snurble infestations on the Pearl, legions of cold-blooded Sahagin from the abyssal depths of the Indigo Deep, but none of that prepared us for the horrors we would face in Hellsbrood Holes. None of it prepared us for the <span class=\"emphasis\">chimera</span>. The bards still sing of the day seven of the realm's finest warriors set off into the bowels of that forsaken place...but only saw one return─Sibold the Stoic, spared by the beast so that he may warn all others who would be foolish enough to attempt to despoil the chimera's lair..."},{"name":"SIBOLD","text":"Ah, my apologies. You did not come to hear the guilt-ridden ramblings of an old man...but, if you have a moment, I was wondering if I could ask of you a favor. The final wish of an ailing soul seeking peace with his past before departing on his journey through the Seven Gates. In each of the thirty summers since escaping from the maws of that terrible beast, I have returned to its lair to pay the proper respects to my fallen compatriots."},{"name":"SIBOLD","text":"However, the years have finally caught up with old Sibold, and try as I might, no longer can these bones make the trek alone. If it is not too much to ask, would you travel to Cutter's Cry in my stead, and place this bouquet of flowers upon the resting place of the Darklight Raiders?"},{"name":"NORMAN","text":"This is Cutter's Cry, a labyrinth of sand-ridden caverns. And you hear that? That sound like the whuffing snort when a fire catches? <span class=\"emphasis\">That's</span> the chimera...not that I've seen it. Sure, go right on in, if you're that certain of your ability to make it out in one piece. Just don't expect me to go trotting in there after you...no matter how hard you wail and holler."},{"name":"NORMAN","text":"Ah, you promised old Sibold the Stoic, did you? He's what's called a man of principle, he is. A little <span class=\"emphasis\">too</span> much principle, I'd say. What's wrong with wanting to live when you've a wife at home big with child? Aye, the tale goes that rather than facing the fate spun for him by Nymeia, he hid beneath the mangled body of his leader and watched as his companions were torn apart, one by one...all so that he might return home to see his son born."},{"name":"NORMAN","text":"Should he have died a hero rather than lived a coward? Was being able to see his son worth having the boy grow knowing his father was a craven, a disgrace to his friends and family? Should I ever find myself faced with a similar decision, would I have the courage to walk the righteous path? Now you know the true reason I will never step into that cave."}],"reward":{"gil":4352,"instance":12,"items":[{"id":27656,"one":1},{"id":27641,"one":1},{"id":2790,"one":1},{"num":8,"id":5825,"one":1}],"xp":10105},"reqs":{"jobs":[{"lvl":35,"id":1}]}},"partials":[{"type":"npc","id":"1006440","obj":{"i":1006440,"n":"Sibold","l":41,"q":1}},{"type":"npc","id":"1007818","obj":{"i":1007818,"n":"Norman","l":43,"q":1,"t":"Flame Private"}},{"type":"instance","id":"12","obj":{"i":12,"n":"Cutter's Cry","c":61801,"t":"Dungeons","min_lvl":38,"max_lvl":40}},{"type":"item","id":"27656","obj":{"i":27656,"n":"Altered Mythril Elmo","l":38,"c":40341,"t":34}},{"type":"item","id":"27641","obj":{"i":27641,"n":"Altered Boarskin Pot Helm","l":37,"c":40351,"t":34}},{"type":"item","id":"2790","obj":{"i":2790,"n":"Mythril Circlet (Rubellite)","l":38,"c":40606,"t":34}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}}]}