{"quest":{"name":"A Fool and His Life Are Soon Parted","location":"Coerthas Central Highlands","id":66451,"patch":2.0,"sort":370,"eventIcon":71221,"issuer":1006432,"target":1006432,"genre":94,"journal":["The Sharlayans say there are no greater generals than old women with naught to lose, and Meduil's steely gaze says she means to send you to war.","Meduil's son perished in the Ogre's Belly, and she will have no others robbed by his killer. Spill the karakul blood as bait, then slay the ravening gorgotaur drawn by the scent.","The gorgotaur, grown fat on easy kills in the blizzard, is no match for your skills. Yet you are still heartsore, for a dead killer is cold comfort. You find a mythril rosary among the moldering bones; give it to Meduil.","In Ishgard, the measure of honor accorded to those killed by Dravanians is the measure of scorn heaped on those slain otherwise. Against that stark truth, your small act of kindness appears to mean all the more to Meduil."],"objectives":["Spill karakul blood on the bait spot and slay the gorgotaur.","Deliver the mythril rosary to Meduil."],"dialogue":[{"name":"MEDUIL","text":"I had a son once, a fine boy. Maybe if he'd lived, he would have <span class=\"alternative-container\"><span class=\"alternative\">found a fine girl like you and I'd be dandling a grandchild on my knee.</span><span class=\"alternative\">been around your age by now─I'm not sure, my memory's not so good these days.</span></span> But he wandered into the Ogre's Belly in a blizzard, and one of the beasts in there killed him."},{"name":"MEDUIL","text":"I'm neither a knight nor a maid, but I tell you my heart cries out for vengeance─nay, justice─even after all these years. I won't go to my grave knowing that creature will blight another life as it did mine. Take all that I have left, but slay the gorgotaur."},{"name":"MEDUIL","text":"Here, this is a bottle of karakul blood. Pour it out and the scent will draw the creature. It doesn't care what kind of blood it is, you see. Once it senses prey... You'll be ready, won't you?"},{"name":"MEDUIL","text":"Thank the Fury, you're safe! I thought my revenge had been the death of you, but you say it's the monster that's dead. Thank you, kind <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. "},{"name":"MEDUIL","text":"And would you look at that─you found his rosary! As bright as the day his father put it around his neck... They say mythril never loses its luster. Not like life, eh?"},{"name":"MEDUIL","text":"<span class=\"emphasis\">Fall to a dragon, go to heaven.</span><br><span class=\"emphasis\">Fall to aught else, who gives two hells?</span><br>...That's the Ishgard way."},{"name":"MEDUIL","text":"He was a scout, and a good one I'm told. But he died a fool's death and fools deserve no justice. They found him, and left his things where they lay─left <span class=\"emphasis\">him</span> where he lay. His own comrades."},{"name":"MEDUIL","text":"But you didn't, did you? You picked this up and brought it to me. A good heart and a noble soul, to keep your promise and do a kind thing unbidden. You are the justice I sought, adventurer, and now I may live out my days in peace."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":1571,"xp":9660},"reqs":{"jobs":[{"lvl":37,"id":1}]}},"partials":[{"type":"npc","id":"1006432","obj":{"i":1006432,"n":"Meduil","l":63,"q":1}}]}