{"quest":{"name":"Burn Before Reading","location":"Coerthas Central Highlands","id":66452,"patch":2.0,"sort":380,"eventIcon":71221,"issuer":1006433,"target":1006433,"genre":94,"journal":["Ser Eugennoix is looking more vexed than usual as his eyes scan the camp for a very special someone─namely you.","Dragons have been sighted near the broken husk of the Steel Vigil, and Ser Eugennoix is keen to seek traces of their presence. See what you can find in the abandoned stronghold.","You have found an ancient tome, its cover now worn and faded. It has a peculiar silken warmth, like the pate of a sleeping babe. Deliver the almanac to Eugennoix before its charm grows upon you.","The tome is apparently much beloved of unbelievers and forbidden by the Holy See. Ser Eugennoix indicates that the Dravanians and unbelievers are making a concerted effort to prevent the rebuilding of the Steel Vigil."],"objectives":["Investigate the Steel Vigil.","Give the almanac to Eugennoix."],"dialogue":[{"name":"EUGENNOIX","text":"I have it on good authority that dragons have once again been spotted around the Steel Vigil."},{"name":"EUGENNOIX","text":"Yet it would not serve to send knights to the area, considering the...the <span class=\"emphasis\">entirely</span> disgraceful hurly-burly over Lord Francel. Will you investigate the Steel Vigil in our stead?"},{"name":"EUGENNOIX","text":"You have some dark news; it is writ large upon your aspect. Come, speak."},{"name":"EUGENNOIX","text":"This tome...it is notorious. Forbidden by the Holy See, of course, and a frequent trophy in the inquisitors' raids on unbelievers."},{"name":"EUGENNOIX","text":"If you found <span class=\"emphasis\">this</span> in the Steel Vigil, it can only mean that the unbelievers infest the ruins."},{"name":"EUGENNOIX","text":"They must have been tasked by the Dravanians to keep watch and thwart any attempts to rebuild the Vigil. Traitorous to their blood! I would that they had but one black heart; my sword would pierce its rotten core and forever rid us of their kind."},{"name":"POP","text":"Something winged this way comes!"},{"name":"ACCESS","text":"The enemy still lives! "}],"reward":{"items":[{"id":4139,"one":1},{"id":4133,"one":1},{"id":4143,"one":1},{"id":5826,"one":1}],"xp":10105},"reqs":{"jobs":[{"lvl":38,"id":1}]}},"partials":[{"type":"npc","id":"1006433","obj":{"i":1006433,"n":"Eugennoix","l":63,"q":1}},{"type":"item","id":"4139","obj":{"i":4139,"n":"Heliodor Bracelet","l":38,"c":55620,"t":42}},{"type":"item","id":"4133","obj":{"i":4133,"n":"Garnet Bracelet","l":38,"c":55617,"t":42}},{"type":"item","id":"4143","obj":{"i":4143,"n":"Aquamarine Bracelet","l":38,"c":55618,"t":42}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}}]}