{"quest":{"name":"Rubble Rouser","location":"Coerthas Central Highlands","id":66467,"patch":2.0,"sort":390,"eventIcon":71221,"issuer":1006456,"target":1006456,"genre":94,"journal":["Ser Chaunollet believes that removing debris is beneath an Ishgardian's dignity.","The once-proud Gates of Judgement have taken another dragon strike, and a spew of rubble makes the roads both dangerous and disheartening to travel. Refusing to soil gallant hands with such a task, Ser Chaunollet bids you remove the rubble.","The rubble has been cleared, and the ground now bears no trace of the recent dragon attack─though the Gates themselves are another matter altogether. Ser Chaunollet will no doubt be pleased to hear of the former.","Under the requisite fervor of the knights of Ishgard, Ser Chaunollet clearly has a deeper well of feeling; his grief at the disfigurement of the Gates of Judgement is genuine─as is his longing to eradicate dragonkind for this crime."],"objectives":["Remove rubble.","Report to Chaunollet."],"dialogue":[{"name":"CHAUNOLLET","text":"A brother knight has recently explained your kind to me. As a sellsword lacks honor, so does an adventurer lack discernment; no task is too menial, yet no cause is worthy enough. I have need of one such as you."},{"name":"CHAUNOLLET","text":"In their boundless depravity, the Dravanians have lashed out against the Gates of Judgement. Pawing at the rubble would be more than any true Ishgardian could bear, yet removed it must be. This shall be your task."},{"name":"CHAUNOLLET","text":"You have served well, though I fear the state of these gates is still disquieting."},{"name":"CHAUNOLLET","text":"You should have seen them as they were, adventurer, not battered and wounded as they are now. The Dravanians are set on breaking my heart─my faith, I meant to say─with their assaults. They must quit this world..."}],"reward":{"items":[{"id":4474,"one":1},{"id":4468,"one":1},{"id":4480,"one":1},{"id":4478,"one":1},{"id":5826,"one":1}],"xp":10800},"reqs":{"jobs":[{"lvl":39,"id":1}],"quests":[66464]},"next":[66468]},"partials":[{"type":"npc","id":"1006456","obj":{"i":1006456,"n":"Chaunollet","l":63,"q":6}},{"type":"item","id":"4474","obj":{"i":4474,"n":"Heliodor Ring","l":39,"c":54418,"t":43}},{"type":"item","id":"4468","obj":{"i":4468,"n":"Garnet Ring","l":39,"c":54415,"t":43}},{"type":"item","id":"4480","obj":{"i":4480,"n":"Pearl Ring","l":39,"c":54427,"t":43}},{"type":"item","id":"4478","obj":{"i":4478,"n":"Aquamarine Ring","l":39,"c":54416,"t":43}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"66464","obj":{"i":66464,"n":"Cleaning Out the Dead","g":94,"l":"Coerthas Central Highlands","s":390}},{"type":"quest","id":"66468","obj":{"i":66468,"n":"Salving the Wounds","g":94,"l":"Coerthas Central Highlands","s":390}}]}