{"quest":{"name":"Salving the Wounds","location":"Coerthas Central Highlands","id":66468,"patch":2.0,"sort":390,"eventIcon":71221,"issuer":1006456,"target":1006456,"genre":94,"journal":["Ser Chaunollet would have you perform another bit of gathering to aid the knights' plight.","With a slightly histrionic imperiousness, Ser Chaunollet bids you bring him the fat from chinchillas. You know too little of Ishgardian cookery to know the reason why, but slay four chinchillas and collect their rich leaf fat.","The chinchillas were curiously abundant and well fed for dainty beasts in the dead of winter. Coerthas is full of mysteries such as these, but forbear in your sleuthing for now, and place the creamy fat in the hands of Ser Chaunollet.","His domineering mien momentarily forgotten, Ser Chaunollet professes delight at the quality of the fat. In light of the beasts' unaccountable plumpness, you are pleased to hear that the fat is destined for chocobo feet, rather than the stew pot."],"objectives":["Harvest fat from chinchillas.","Deliver the chinchilla fat to Chaunollet."],"dialogue":[{"name":"CHAUNOLLET","text":"You look eager to serve, adventurer. Do not deny it─the fire in your eyes betrays you. There <span class=\"emphasis\">is</span> something you can do: slay the chinchillas that dwell near at hand and reap their fat."},{"name":"CHAUNOLLET","text":"How many of the beasts? I see the task excites you! Four of goodly size will do. Now, be as my tiercel and hunt the chinchillas thither!"},{"name":"CHAUNOLLET","text":"Ah, the tiercel of the Temple! Have you what I bid you bring?"},{"name":"CHAUNOLLET","text":"This is most excellent fat, and well pulled. I see you have some skill at dressing beasts. Once rendered, it shall be fortified into a frostbite balm for our chocobos."},{"name":"CHAUNOLLET","text":"Alone among beasts, the chocobos are to be honored. For every knight of Ishgard that has perished in the crusade, as many of the noble birds have died. None who witness a chocobo meet its end can fail to be moved."}],"reward":{"items":[{"id":4241,"one":1},{"id":4235,"one":1},{"id":4237,"one":1},{"id":5826,"one":1}],"xp":10800},"reqs":{"jobs":[{"lvl":39,"id":1}],"quests":[66467]}},"partials":[{"type":"npc","id":"1006456","obj":{"i":1006456,"n":"Chaunollet","l":63,"q":6}},{"type":"item","id":"4241","obj":{"i":4241,"n":"Amethyst Earrings","l":39,"c":55221,"t":41}},{"type":"item","id":"4235","obj":{"i":4235,"n":"Goshenite Earrings","l":39,"c":55220,"t":41}},{"type":"item","id":"4237","obj":{"i":4237,"n":"Peridot Earrings","l":39,"c":55218,"t":41}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"66467","obj":{"i":66467,"n":"Rubble Rouser","g":94,"l":"Coerthas Central Highlands","s":390}}]}