{"quest":{"name":"Ye of Little Faith","location":"Coerthas Central Highlands","id":66460,"patch":2.0,"sort":202,"icon":100140,"eventIcon":71201,"issuer":1006435,"target":1006444,"involved":[1006441,1006442,1006443],"genre":1,"journal":["Ser Brunadier seems ill inclined to help you...","Ser Brunadier has informed you that it is not his responsibility to escort visitors within Whitebrim Front. After returning to you your letters, he suggests that you speak with Ser Alboise in the storeroom.","Ser Alboise cannot fathom why Ser Brunadier directed you to her, for she is but a low-ranking knight. She directs you to head chirurgeon Astidien, as Lord Drillemont is known to be fond of the man.","Head chirurgeon Astidien is bemused by your request, explaining that you can proceed directly to the barracks by virtue of the letters you carry. He recommends that you first speak with Ser Goudernoux to confirm that Lord Drillemont is present and available.","Ser Goudernoux bids you address Lord Drillemont yourself, but cautions you to treat the lord with respect and not to waste his time. Head upstairs and present Lord Drillemont your letters.","As you, Alphinaud, and Cid begin to petition Lord Drillemont for aid, Inquisitor Guillaime suddenly appears and accuses you of lying about your identities and your intentions. Lord Drillemont heeds the inquisitor's warning and refuses to listen to your protestations. Alas, it seems that it will take significant time and effort to obtain Lord Drillemont's trust..."],"objectives":["Speak with Alboise.","Speak with Astidien.","Speak with Goudernoux.","Speak with Drillemont."],"dialogue":[{"name":"BRUNADIER","text":"Your timing could not have been worse, traveler. Lord Drillemont's attentions are focused solely on the Stone Vigil at present."},{"name":"BRUNADIER","text":"In any case, it is not my responsibility to escort visitors. Take your letters and show them to...Ser Alboise. Yes, Ser Alboise can surely accommodate you─seek her in the storeroom on the opposite side of the yard."},{"name":"ALBOISE","text":"Ser Brunadier bade you speak with me, did he? I know not why he presumed I would be in a better position to help, but I assure you that he is mistaken."},{"name":"ALBOISE","text":"Lord Drillemont hasn't the time to spend speaking with low-ranking knights such as I. However, he always has a moment to spare for head chirurgeon Astidien. Why not visit the infirmary upstairs and show your letters to him?"},{"name":"ASTIDIEN","text":"Are you here to visit a patient, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? What's this? Letters of introduction from House Fortemps and Haillenarte..."},{"name":"ASTIDIEN","text":"With documents such as these, you needn't seek an escort. Pray proceed to the barracks and speak with Ser Goudernoux. He should know Lord Drillemont's current whereabouts."},{"name":"GOUDERNOUX","text":"What reason have you for barging into─ Oh, I see. Well, you are in luck─Lord Drillemont is just up these stairs."},{"name":"GOUDERNOUX","text":"Letters or no, though, I would not expect much. House Durendaire as a whole does not hold adventurers in high regard."},{"name":"GOUDERNOUX","text":"You had best state your intentions quickly and succinctly. Show proper respect, and it shall be returned in kind."},{"name":"DRILLEMONT","text":"Ser Goudernoux permitted your passage? Very well. Speak."},{"name":"DRILLEMONT","text":"You wish to brave a ruined outpost filled with scalekin to secure an airship that may or may not be there. Are you the avatar of the Fury Herself?"},{"name":"ALPHINAUD","text":"We are the Scions of the Seventh Dawn, Lord Drillemont. You know our name, and you know our deeds."},{"name":"ALPHINAUD","text":"We are come to Coerthas to slay Garuda, Lady of the Vortex. To that end, we seek the <span class=\"emphasis\">Enterprise</span>, the airship of Master Cid nan Garlond, who stands before you now."},{"name":"DRILLEMONT","text":"Master Garlond, you're <span class=\"emphasis\">alive</span>!? But that's impossible!"},{"name":"GUILLAIME","text":"Indeed it is, my lord."},{"name":"GUILLAIME","text":"Do not be deceived by their honeyed words. These foreigners are not to be trusted."},{"name":"GUILLAIME","text":"At this critical moment in Ishgardian history, as House Durendaire marshals its forces to retake the Stone Vigil, who should appear in Whitebrim Front but three mysterious strangers..."},{"name":"GUILLAIME","text":"Cid Garlond─missing and presumed dead since before the Calamity, and two Scions of the Seventh Dawn─a defunct band of misfits recently exterminated by the Empire."},{"name":"GUILLAIME","text":"The lesser houses may have been duped by these grandiose lies, but I should hope that House Durendaire would have greater sense. I know not why these three seek the Stone Vigil, but I know that we cannot permit them to pass."},{"name":"DRILLEMONT","text":"Thank you for your counsel, Inquisitor. For a moment, I nearly believed this mummer's farce."},{"name":"DRILLEMONT","text":"You three will <span class=\"emphasis\">not</span> enter the outpost until we have reclaimed it─and until you declare your <span class=\"emphasis\">true</span> intentions as well."},{"name":"ALPHINAUD","text":"It could be <span class=\"emphasis\">moons</span> before House Durendaire purges the dragons from the Stone Vigil. We cannot afford to wait that long!"},{"name":"ALPHINAUD","text":"Cid, <span class=\"highlight\">Forename</span>─we must do whatever it takes to earn Lord Drillemont's trust. Understood?"}],"reward":{"gil":1527,"xp":21600},"reqs":{"jobs":[{"lvl":39,"id":130}],"quests":[69404]},"next":[66461,66462,66463,66464,66465,66469,66470,66471,66472]},"partials":[{"type":"npc","id":"1006435","obj":{"i":1006435,"n":"Brunadier","l":63,"q":3}},{"type":"npc","id":"1006444","obj":{"i":1006444,"n":"Drillemont","l":63,"q":13}},{"type":"npc","id":"1006441","obj":{"i":1006441,"n":"Alboise","l":63,"q":2}},{"type":"npc","id":"1006442","obj":{"i":1006442,"n":"Astidien","l":63,"q":2}},{"type":"npc","id":"1006443","obj":{"i":1006443,"n":"Goudernoux","l":63,"q":1}},{"type":"quest","id":"69404","obj":{"i":69404,"n":"The Final Flight of the Enterprise","g":1,"l":"Coerthas Central Highlands","s":201}},{"type":"quest","id":"66461","obj":{"i":66461,"n":"Opportunity Knocks","g":0,"l":"Coerthas Central Highlands","s":203}},{"type":"quest","id":"66462","obj":{"i":66462,"n":"All by Ourselves","g":0,"l":"Coerthas Central Highlands","s":204}},{"type":"quest","id":"66463","obj":{"i":66463,"n":"Factual Folklore","g":1,"l":"Coerthas Central Highlands","s":205}},{"type":"quest","id":"66464","obj":{"i":66464,"n":"Cleaning Out the Dead","g":94,"l":"Coerthas Central Highlands","s":390}},{"type":"quest","id":"66465","obj":{"i":66465,"n":"A Few Good Men","g":94,"l":"Coerthas Central Highlands","s":390}},{"type":"quest","id":"66469","obj":{"i":66469,"n":"Run, Fido, Run","g":94,"l":"Coerthas Central Highlands","s":390}},{"type":"quest","id":"66470","obj":{"i":66470,"n":"An Augury of Innocence","g":94,"l":"Coerthas Central Highlands","s":390}},{"type":"quest","id":"66471","obj":{"i":66471,"n":"Love's Hard Labor","g":94,"l":"Coerthas Central Highlands","s":390}},{"type":"quest","id":"66472","obj":{"i":66472,"n":"The King Rat Must Die","g":94,"l":"Coerthas Central Highlands","s":390}}]}