{"quest":{"name":"Physician, Find Yourself","location":"Coerthas Central Highlands","id":66479,"patch":2.0,"sort":400,"eventIcon":71221,"issuer":1006442,"target":1006442,"involved":[1006474,1006475,1007636],"genre":94,"journal":["Head chirurgeon Astidien would have you escort a most valuable prize from Camp Dragonhead. ","Overrun with patients for many moons, the infirmary at the Front has finally persuaded the powers-that-be to assign them another chirurgeon. Astidien bids you escort this welcome new addition from Camp Dragonhead.","Alas, you and the chirurgeon have somehow missed each other. It is likely that he is dying slowly out in the snow even as you bemoan his foolishness. Find the lost chirurgeon and dose him with the life-saving maddening potion.","You find the chirurgeon and restore him to health─or at least to some version of it that will get him to the Front. On a second thought, it was possibly a poor decision to let loose a recently frozen naif under the influence of anything described as “maddening.” It would behoove you to find him again.","You appear in the nick of time to strike down two dragonflies attacking the chirurgeon. Disaster seems to love this man, but still, speak to him.","You allow the chirurgeon to go his way, for he seemed calm enough. Besides, it is known that a man who escapes death twice in one day will escape it the third time as well. Take yourself to Astidien and tell him the tale.","As you predicted, the chirurgeon not only reached the Front, but is cheating death for the third time as you make your report to Astidien. The head chirurgeon may feel otherwise, but your road sense tells you the naif will do much good here."],"objectives":["Speak with Braitognieux.","Find the lost chirurgeon and use the maddening potion.","Find the lost chirurgeon again.","Speak with the lost chirurgeon.","Report to Astidien."],"dialogue":[{"name":"ASTIDIEN","text":"As you may have noticed, this area is much troubled by many a wild and savage creature. This is of course in addition to dragons, which are all the enemy that Ishgard acknowledges, by and large."},{"name":"ASTIDIEN","text":"This has taxed the infirmary beyond all natural limits, and the healers show signs of becoming patients."},{"name":"ASTIDIEN","text":"After some doing, I have managed to secure a chirurgeon from Camp Dragonhead. From the reluctance they evinced at the transfer order, he must have great promise. I would be easier in my mind if you would escort him here."},{"name":"BRAITOGNIEUX","text":"The one being transferred to Whitebrim? He left many bells ago!"},{"name":"BRAITOGNIEUX","text":"You did not meet him upon the road? It is as clear as day and straight as an arrow. Tcha, he must have taken some other way, and now wanders lost."},{"name":"BRAITOGNIEUX","text":"His curiosity is boundless and he never hesitates to risk himself, tcha. It makes him a wonder at physicking but a complete and utter fool on a winter road. Adventurer, you must find him before it is too late."},{"name":"BRAITOGNIEUX","text":"Here, take this bottle of maddening potion, for he is like to be frozen. Tcha, we cannot have this recklessness when he is tasked with saving lives!"},{"name":"NURSE","text":"C–C–Cold... Bad idea, bad idea, no more detours if I make it to the Front... Wh–Wh–Why didn't I bring the m–m–maddening potion...?"},{"name":"NURSE","text":"How now, ow, ow! The blood surges! So many ideas, like a swarm of wasps...making the mind race. I must go! Wasps, wasps, bees in my bonnet..."},{"name":"NURSE","text":"Hail, well met, fare thee well, my [Race] savior! Off to the Front, yes, off to the Front!"},{"name":"NURSE","text":"Off to the Fron─yooowt! There's a thing, a–a–a fleet <span class=\"emphasis\">thing</span>! Heeeeeelp!"},{"name":"NURSE","text":"Gak! Ack! Heeelp! Heeelp! Get it<span class=\"emphasis\"> off</span> me...nowish!"},{"name":"NURSE","text":"Oh dear, I do take a lot of saving, don't I? Thank you. I'm sorry, I didn't get your name. <span class=\"highlight\">Forename</span>? That's lovely. I think I'm forgetting something, but..."},{"name":"NURSE","text":"Anyway, should you ever need physicking, come to the Whitebrim infirmary. You won't find a chirurgeon more devoted to making you well, I assure you! Till then, farewell!"},{"name":"ASTIDIEN","text":"Ah, adventurer. You'll be pleased to know the new chirurgeon arrived safe and sound. He said you saved him from certain ruin!"},{"name":"ASTIDIEN","text":"Of course, he collapsed from the effects of the maddening potion mid-babble. Not surprising considering his journey here. One of the other chirurgeons ministers to him as we speak."},{"name":"ASTIDIEN","text":"It bodes not well that he failed to prepare himself for the potion's aftereffects. I begin to think that taking on new staff is not the panacea I had hoped for..."},{"name":"POP","text":"The air comes alive with the beating of wings!"}],"reward":{"gil":1650,"items":[{"num":3,"id":4553,"one":1},{"num":3,"id":4556,"one":1}],"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":1}],"quests":[66477]}},"partials":[{"type":"npc","id":"1006442","obj":{"i":1006442,"n":"Astidien","l":63,"q":2}},{"type":"npc","id":"1006474","obj":{"i":1006474,"n":"Braitognieux","l":63,"q":1}},{"type":"npc","id":"1006475","obj":{"i":1006475,"n":"Lost Chirurgeon","l":63,"q":1}},{"type":"npc","id":"1007636","obj":{"i":1007636,"n":"Lost Chirurgeon","l":63,"q":1}},{"type":"item","id":"4553","obj":{"i":4553,"n":"Mega-Potion","l":45,"c":20603,"t":44,"p":528}},{"type":"item","id":"4556","obj":{"i":4556,"n":"Hi-Ether","l":35,"c":20622,"t":44,"p":432}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}}]}