{"quest":{"name":"The Heretic among Us","location":"Coerthas Central Highlands","id":66477,"patch":2.0,"sort":210,"icon":100143,"eventIcon":71201,"issuer":1006444,"target":1006467,"involved":[1006469],"genre":1,"journal":["Lord Drillemont requires your assistance in bringing the heretic masquerading as Inquisitor Guillaime to justice.","Lord Drillemont has asked you to accompany him to Snowcloak, where the heretic masquerading as Inquisitor Guillaime is said to be conducting another interrogation. If the impostor refuses to surrender, Lord Drillemont intends to use force. Prepare for the worst and rendezvous with the knights at Snowcloak.","Faced with Lord Drillemont's accusations, the false inquisitor declares that he cannot betray that which he owes no allegiance, and that all Ishgardians must be held to account for their persecution of the heretics. With that, he summons his Dravanian allies and endeavors to defend himself, going so far as to use his magicks to assume the form of a dragon. The ruse serves only to anger Lord Drillemont, however, and with his aid you dispel the heretic's glamour and slay his scalekin accomplices. Defiant to the last, the nameless heretic rejoices in the vengeance he wreaked, predicting with his dying breath that you will meet your end in the Stone Vigil. Return to Whitebrim Front and inform Alphinaud of the impostor's demise.","Alphinaud refuses to revel in your victory over the false inquisitor, declaring that there will be time enough to celebrate when the <span class=\"emphasis\">Enterprise</span> has been secured. Happily, your path into the Stone Vigil now seems clear. All that remains is for you and your companions to pay one final visit to Lord Drillemont."],"objectives":["Speak with the knight of House Durendaire.","Speak with Alphinaud."],"dialogue":[{"name":"DRILLEMONT","text":"That thrice-damned heretic has murdered countless innocents, and made a mockery of our laws! Hells take him and his Dravanian allies!"},{"name":"DRILLEMONT","text":"I am told he makes for Snowcloak even now, intending to pass judgment upon yet another poor soul whom he has branded heretic. If we hurry, there may still be time to prevent further tragedy."},{"name":"DRILLEMONT","text":"Lend me your strength, <span class=\"highlight\">Forename</span>! Together, let us put an end to this impostor's heresy once and for all!"},{"name":"NPCA","text":"Good to have you with us, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. When Lord Drillemont arrives, we are to confront the inquisitor. If he refuses to go quietly, we will need to use force. Are you prepared for that eventuality?"},{"name":"GUILLAIME","text":"You needn't tremble so, my child. The righteous shall enjoy everlasting peace in Halone's halls. Only the wicked─"},{"name":"NPCB","text":"But why!? Why must I die!? By all that is holy, I swear to you that I have <span class=\"emphasis\">never</span> questioned the teachings of Halone!"},{"name":"DRILLEMONT","text":"Inquisitor! Release the maid and come with us!"},{"name":"GUILLAIME","text":"My lord Drillemont─what is the meaning of this interruption? You are aware that I am at present conducting an interrogation, are you not?"},{"name":"DRILLEMONT","text":"Silence, villain! I name thee <span class=\"emphasis\">heretic</span>, murderer of Inquisitor Guillaime and countless innocents!"},{"name":"DRILLEMONT","text":"You are a traitor to Ishgard, to your own kith and kin! Your sins are beyond measure─beyond redemption!"},{"name":"GUILLAIME","text":"Ah...grave allegations indeed. But you will find your logic is flawed. How can I betray that which I owe no allegiance? No, Lord Drillemont─my conscience is quite clear, I assure you."},{"name":"GUILLAIME","text":"I wonder...can you say the same? You whose hands are black with the blood of those whose only <span class=\"emphasis\">sin</span> was to question your nation's crazed crusade!"},{"name":"GUILLAIME","text":"You speak to me of Ishgardian <span class=\"emphasis\">innocents</span>? Hah! <span class=\"emphasis\">All</span> are complicit in these crimes, for <span class=\"emphasis\">all</span> live their lives by the archbishop's lies."},{"name":"GUILLAIME","text":"But I know you will not hear me, deafened by dogma as you are. If you desire retribution, Lord Drillemont, then come─let us see how Ishgardian steel fares against Dravanian fang and claw!"},{"name":"GUILLAIME","text":"My glamours...dispelled..."},{"name":"DRILLEMONT","text":"Your plans lie in ruin, heretic. Choose your words wisely, for they will be your last."},{"name":"GUILLAIME","text":"&lt;cough&gt; &lt;wheeze&gt; Hah hah... You may not recall the many Ishgardians I have sentenced, but the families of the dead will <span class=\"emphasis\">never</span> forget. Blood has been repaid with blood, and for that I am content."},{"name":"GUILLAIME","text":"My...my only regret is that <span class=\"emphasis\">you</span> yet live..."},{"name":"GUILLAIME","text":"But your end is nigh, foreigner. The dragons within the Stone Vigil will rend you asunder. And when you are dead, Whitebrim Front shall fall..."},{"name":"DRILLEMONT","text":"Defiant to the last. Leave the body for the crows─his ilk deserves naught better."},{"name":"DRILLEMONT","text":"<span class=\"highlight\">Forename</span>, I must apologize for involving you in this sordid business. You should never have been asked to intervene in Ishgardian affairs of state."},{"name":"DRILLEMONT","text":"Rest assured, I have not forgotten the matter which first brought you into our midst. It is past time that you were reunited with your airship."},{"name":"DRILLEMONT","text":"But this is not the place to discuss such matters. Pray visit me at Whitebrim Front─and bring your associates."},{"name":"ALPHINAUD","text":"Where have you been, <span class=\"highlight\">Forename</span>? ...Hm? The false inquisitor has been slain, has he? Yes, well, his was a tale always like to end in bloodshed."},{"name":"ALPHINAUD","text":"Though you have overcome the latest in a long line of unfortunate impediments, I would ask you not to revel in your victory just yet."},{"name":"ALPHINAUD","text":"We can celebrate once we have secured the <span class=\"emphasis\">Enterprise</span>!"},{"name":"QIB","text":"Defeat Inquisitor Guillaime!"},{"name":"DRILLEMONT","text":"Show the heretic no mercy! He must pay for the innocent blood he has spilled!"},{"name":"GUILLAIME","text":"Ignorant swine! Soon you will know the futility of your faith!"},{"name":"DRILLEMONT","text":"Do you see, heretic? You and your allies are no match for the might of Ishgard!"},{"name":"GUILLAIME","text":"How wrong you are, Ishgardian! I have been blessed with power far beyond your ken!"},{"name":"GUILLAIME","text":"Come, my brothers─grant me the strength to smite our enemies!"},{"name":"GUILLAIME","text":"I...am...<span class=\"emphasis\">reborn</span>!"},{"name":"DRILLEMONT","text":"Stand your ground─'tis but an illusion!"},{"name":"GUILLAIME","text":"A <span class=\"emphasis\">dragon</span> stands before you, yet still you do not flee!?"},{"name":"DRILLEMONT","text":"Your magicks have no power over me, heretic!"},{"name":"GUILLAIME","text":"No, NO! It cannot be!"},{"name":"DRILLEMONT","text":"Ugh...I swear by the Fury, I will bury my blade into...your..."},{"name":"FOLLOWER","text":"For Ish...ga...ahhh..."},{"name":"FOLLOWER","text":"Ugh, not by a godsdamned heretic..."}],"reward":{"gil":2988,"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":130}],"quests":[66476]},"next":[66478,66479,66480,66481,66482,66484,66486,66487,66488]},"partials":[{"type":"npc","id":"1006444","obj":{"i":1006444,"n":"Drillemont","l":63,"q":13}},{"type":"npc","id":"1006467","obj":{"i":1006467,"n":"Alphinaud","l":63,"q":5}},{"type":"npc","id":"1006469","obj":{"i":1006469,"n":"House Durendaire Knight","l":63,"q":1}},{"type":"quest","id":"66476","obj":{"i":66476,"n":"Blood for Blood","g":1,"l":"Coerthas Central Highlands","s":209}},{"type":"quest","id":"66478","obj":{"i":66478,"n":"It Tolls for Us","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66479","obj":{"i":66479,"n":"Physician, Find Yourself","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66480","obj":{"i":66480,"n":"Blood Sacrifice","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66481","obj":{"i":66481,"n":"The Bone Collector","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66482","obj":{"i":66482,"n":"Ice Ice Daily","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66484","obj":{"i":66484,"n":"When a Man Loves a Woman","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66486","obj":{"i":66486,"n":"Days of Brandewine and Behemoths","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66487","obj":{"i":66487,"n":"Living on the Edge","g":94,"l":"Coerthas Central Highlands","s":400}},{"type":"quest","id":"66488","obj":{"i":66488,"n":"In Pursuit of the Past","g":1,"l":"Coerthas Central Highlands","s":211}}]}