{"quest":{"name":"It Tolls for Us","location":"Coerthas Central Highlands","id":66478,"patch":2.0,"sort":400,"eventIcon":71221,"issuer":1006473,"target":1006473,"involved":[1006445,1006451,1007565],"genre":94,"journal":["Ser Liautroix has heard of your growing repute and wishes to engage you.","Ser Liautroix has it in his mind to repair the outpost's bell, the very same that serves as the sigil of House Durendaire. To this end, the dragoons must be persuaded to hand over their discarded weapons.","No persuasion proves necessary, for the fighting men and women of the Front are all eager to see their bell restored to its former glory. You hope that Tuatkk the smith will feel as they do, especially when he sees the arms you have collected.","It must be your nameday for everyone to fall in so eagerly with your requests. Tuatkk promises to begin work before the <span class=\"alternative-container\"><span class=\"alternative\">evening stars clamber much farther over the horizon</span><span class=\"alternative\">morning mist is gone</span><span class=\"alternative\">day grows riper</span></span>. Ser Liautroix will want to know the good news as soon as possible.","Ser Liautroix is moved to discover that others are with him in this endeavor. Cold are the winds that blow on the Front, and from a green recruit to a seasoned smith, all who dwell there must hold fast to one another..."],"objectives":["Collect discarded weapons.","Give the weapons to Tuatkk.","Report to Liautroix."],"dialogue":[{"name":"LIAUTROIX","text":"Long has this bell marked the time at our keep, but as you can see, it was ill used by dragons and has been silent since."},{"name":"LIAUTROIX","text":"Others of this keep have naught but praise for your work, adventurer. I wonder if you are the ideal confederate for this enterprise... Will you assist me in repairing the bell?"},{"name":"LIAUTROIX","text":"We need a goodly amount of metal, and arms damaged in battle are in plentiful supply. Yet, 'twould not do for one dragoon to ask another for his arms. Will you collect them and take them around to Tuatkk the smith?"},{"name":"BENEDICT","text":"You want what? Oh, to repair the bell! I cannot well recall its peal─I was still falling off chocobos when the dragons cleft it thus. Here, will this do?"},{"name":"IGNEMORTEL","text":"Ha, repairs are to finally move forward! Metal hither, metal thither! Take it, take it away and let the anvil ring!"},{"name":"TUATKK","text":"You seek a smith? What can I do for you? "},{"name":"TUATKK","text":"Repair the bell? Ah! A worthy endeavor, 'specially with such a shadow as this over Whitebrim Front. A dragoon must needs see and hear what <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> fights for, or the heart'll go out of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"TUATKK","text":"There's more than enough metal here to cast a new clapper and make the other repairs. I'll start as soon as I'm done hammering out this breastplate. Tell Ser Liautroix that we'll make this place ring, will you?"},{"name":"LIAUTROIX","text":"Tuatkk said this? The Fury bless him, to see it as I do!"},{"name":"LIAUTROIX","text":"Ishgard is at war, and we hoard our resources with an almost...Dravanian avidity. All must fuel the crusade, while removing as little from the battlefield as possible."},{"name":"LIAUTROIX","text":"We at Whitebrim Front live between the anvil of winter and the hammer of the dragons. We have been tested much, and not found wanting, I believe. This is our keep and our home─it must have a measure of beauty, else it becomes a gaol."}],"reward":{"gil":1650,"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":1}],"quests":[66477]}},"partials":[{"type":"npc","id":"1006473","obj":{"i":1006473,"n":"Liautroix","l":63,"q":1}},{"type":"npc","id":"1006445","obj":{"i":1006445,"n":"Benedict","l":63,"q":1}},{"type":"npc","id":"1006451","obj":{"i":1006451,"n":"Ignemortel","l":63,"q":2}},{"type":"npc","id":"1007565","obj":{"i":1007565,"n":"Tuatkk","l":63,"q":1}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}}]}