{"quest":{"name":"Influencing Inquisitors","location":"Coerthas Central Highlands","id":66474,"patch":2.0,"sort":207,"icon":100142,"eventIcon":71201,"issuer":1006461,"target":1006467,"involved":[1006441,1006448,1006466,1007585],"genre":1,"journal":["Cid is concerned about Inquisitor Guillaime.","The incident with the alembic has convinced Cid that Inquisitor Guillaime will continue to interfere with your efforts to prove yourself to the people of Whitebrim Front. Therefore, Cid suggests that you speak with the people of the stronghold in order to learn more about the inquisitor, in the hope that you will find a way to convince him to change his mistaken opinions.","After speaking with a variety of residents, you feel as though you have a much clearer picture of the inquisitor. Share your findings with Alphinaud, who awaits you in the square.","Alphinaud suspects that the inquisitor may have a hidden agenda, one which may be revealed should you review the testimonials you obtained..."],"objectives":["Question the people of Whitebrim Front.","Speak with Alphinaud."],"dialogue":[{"name":"CID","text":"Before we can persuade Lord Drillemont to help us, it seems we must convince Inquisitor Guillaime that we are not his enemy. But just how might we go about doing that...?"},{"name":"CID","text":"We know little and less about the good inquisitor, despite him being such a prominent figure in Coerthas. Perhaps we should learn more by speaking with the people of Whitebrim Front."},{"name":"CID","text":"Share your findings with Alphinaud in the square. I'm sure he can formulate a strategy from there."},{"name":"JOELLAUT","text":"Inquisitor Guillaime? Yes, of course, I know of him. Alas, I have not seen him since the day he came to Whitebrim Front, several moons ago."},{"name":"JOELLAUT","text":"My memory is somewhat muddled, but I recall that a blizzard nearly buried us in snow that day, and I had the ill fortune of being assigned to the night's watch. While the stronghold slept, we walked the walls and patrolled the exterior in a darkness black as pitch. "},{"name":"JOELLAUT","text":"My route took me outside the eastern gate at one point, where I caught sight of a silhouette illuminated by the light of the city. Thinking it was a wayward traveler, I cried out and gave chase, but slipped and took a terrible fall. When I woke, it was days later in this very bed, where I have lain recuperating from my injuries ever since."},{"name":"JOELLAUT","text":"I had tried to rescue him, but in the end Inquisitor Guillaime rescued <span class=\"emphasis\">me</span>, carrying my unconscious body to the gates. I owe him my life, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, and I hope to one day repay his kindness."},{"name":"ALBOISE","text":"Inquisitor Guillaime? I haven't the foggiest of whom you speak...<span class=\"emphasis\">unbeliever</span>. Aye, we have learned of your deeds at Witchdrop. I will not be party to whatever dastardly schemes you've hatched against the inquisitor! Away with you!"},{"name":"HAUSTEFORT","text":"The Holy See has decreed that the inquisitors are the arbiters of Halone's will. They are to be afforded every courtesy and the utmost respect."},{"name":"PATRICK","text":"Under Inquisitor Guillaime's watchful gaze, unprecedented numbers of heretics have been unmasked and brought to justice."},{"name":"PATRICK","text":"They say he goes days without sleep, so great is his devotion. Blessed are we to have such a goodly, righteous man to protect us."},{"name":"ALPHINAUD","text":"... &lt;shiver&gt;"},{"name":"ALPHINAUD","text":"In case you have yet to notice, my attire is ill-suited to this climate."},{"name":"ALPHINAUD","text":"I realized it soon after our arrival, but paid it no mind as I had hoped we might find the <span class=\"emphasis\">Enterprise</span> far faster. Instead, we've wasted far too much time meddling in local affairs. &lt;sigh&gt;"},{"name":"ALPHINAUD","text":"Never mind. Our journey is almost at an end. All that remains is to deal with this irksome inquisitor. Cid tells me you have been busy making inquiries, yes?"},{"name":"ALPHINAUD","text":"...Hm. It should come as no surprise that he is held in high regard. Even so, I am beginning to suspect he has other reasons for hindering us now."},{"name":"ALPHINAUD","text":"Let us more closely review the testimonials you obtained, <span class=\"highlight\">Forename</span>. Mayhap they will provide insight into Inquisitor Guillaime's motivations."}],"reward":{"gil":329,"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":130}],"quests":[69405]},"next":[66475]},"partials":[{"type":"npc","id":"1006461","obj":{"i":1006461,"n":"Cid","l":63,"q":3}},{"type":"npc","id":"1006467","obj":{"i":1006467,"n":"Alphinaud","l":63,"q":5}},{"type":"npc","id":"1006441","obj":{"i":1006441,"n":"Alboise","l":63,"q":2}},{"type":"npc","id":"1006448","obj":{"i":1006448,"n":"Haustefort","l":63,"q":2}},{"type":"npc","id":"1006466","obj":{"i":1006466,"n":"Joellaut","l":63,"q":2}},{"type":"npc","id":"1007585","obj":{"i":1007585,"n":"Patrick","l":63,"q":1}},{"type":"quest","id":"69405","obj":{"i":69405,"n":"The Best Inventions","g":1,"l":"Coerthas Central Highlands","s":206}},{"type":"quest","id":"66475","obj":{"i":66475,"n":"By the Lights of Ishgard","g":1,"l":"Coerthas Central Highlands","s":208}}]}