{"quest":{"name":"Blood for Blood","location":"Coerthas Central Highlands","id":66476,"patch":2.0,"sort":209,"eventIcon":71201,"issuer":1006467,"target":1006444,"involved":[1006466,1006468],"genre":1,"journal":["Alphinaud is determined to discover Inquisitor Guillaime's true identity.","Although you have discovered proof that Inquisitor Guillaime is an impostor, Alphinaud wishes to determine his true identity before speaking with Lord Drillemont. Confront Ser Joellaut with the bloody encyclical and see what he has to say.","Ser Joellaut refuses to consider the possibility that Inquisitor Guillaime is not who he claims to be. He bids you speak with Ser Prunilla, the knight who helped the inquisitor carry his unconscious body to the infirmary that night, if you still doubt his story.","Ser Prunilla claims to know nothing of the bloody encyclical, but her nervous fidgeting suggests otherwise. As time is of the essence, you should cease with the pleasantries and /doubt her account with fervor. ","Ser Prunilla confesses that she knew of Inquisitor Guillaime's true identity, but was unable to reveal the truth out of fear for her loved ones. She was also aware that the inquisitor was framing innocent Ishgardians and sentencing them to death, but could not bring herself to act─until Lord Francel came under suspicion. Even then, she could only afford to tamper with shipments bound for Skyfire Locks, in the hopes that the draconian rosaries she stole from the inquisitor's chest and hid within the parcels would be discovered and used as evidence of a conspiracy against House Haillenarte. Having learned of the inquisitor's hidden supply of draconian rosaries, search the area southeast of Whitebrim Front and see if you can locate the chest.","You find the hidden chest as Ser Prunilla described. Open it and see what secrets it contains.","The chest is filled with draconian rosaries, which Inquisitor Guillaime has doubtless used to condemn countless innocent Ishgardians to death. Having obtained incontrovertible proof that the inquisitor is in fact a heretic, you can now approach Lord Drillemont and convince him of the truth.","Lord Drillemont is devastated by the revelation, and wastes no time apologizing for misjudging you. But before he agrees to grant you permission to enter the Stone Vigil, he asks that you help him bring the false inquisitor to justice."],"objectives":["Show the bloody encyclical to Joellaut.","Show the bloody encyclical to Prunilla.","Confront Prunilla and cast /doubt on her account.","Search the area southeast of Whitebrim Front.","Search the suspicious box.","Present your findings to Drillemont."],"dialogue":[{"name":"ALPHINAUD","text":"Since Lord Drillemont has already been turned against us, I fear that this encyclical alone will not serve to convince him of our claims."},{"name":"ALPHINAUD","text":"But what might persuade a man so quick to disregard the endorsements of two High Houses?"},{"name":"ALPHINAUD","text":"The cook did say that the lord listens to and respects the opinions of his knights. If a certain knight were to provide testimony that supports our claim..."},{"name":"ALPHINAUD","text":"Yes, mayhap that is the only way left to us. Confront Ser Joellaut with the evidence you discovered and see if it helps him to recall the truth of that night."},{"name":"ALPHINAUD","text":"As a man of faith, he may find it difficult to cope with such a horrifying revelation. Nevertheless, we must do everything within our power to secure the <span class=\"emphasis\">Enterprise</span>."},{"name":"JOELLAUT","text":"Oh, you have returned. Is there something else you wanted to ask?"},{"name":"JOELLAUT","text":"The inquisitor is an impostor? Don't be preposterous, that could not possibly be true!"},{"name":"JOELLAUT","text":"He is a paragon of virtue, a dedicated servant of the Fury! You would have me believe that is all a lie!?"},{"name":"JOELLAUT","text":"If you are so certain that your ludicrous story is true, then go and speak with Ser Prunilla! She was at the eastern gate that night, and she helped the inquisitor carry me here. But I will <span class=\"emphasis\">never</span> speak against the man who saved my life!"},{"name":"PRUNILLA","text":"<span class=\"emphasis\">You</span>! I...I do not believe I know you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Pray move along and trouble me no more."},{"name":"PRUNILLA","text":"Are you in the habit of handing bloody documents to strangers? Why would you show me such a dreadful thing? I know naught of it, naught at all!"},{"name":"PRUNILLA","text":"...What? Do you <span class=\"highlight\">doubt</span> my words? Away with you─I will suffer your slander no more."},{"name":"PRUNILLA","text":"You <span class=\"emphasis\">know</span>, don't you? Fury take me, I prayed this day would come..."},{"name":"PRUNILLA","text":"When Ser Joellaut gave chase, I followed close behind. He didn't fall─one of those Dravanian abominations lashed out at him, nearly killed him right then and there. I drew my sword and rushed to his side, straining to see the enemy. But what came from the dark was not a beast, but a voice."},{"name":"PRUNILLA","text":"He...he <span class=\"emphasis\">knew</span> things about me, about my family. Secrets I had never told another. He said that if I kept his confidence, Ser Joellaut and I would be spared. But, if I defied him...everyone I loved would suffer unimaginable horrors before they died."},{"name":"PRUNILLA","text":"When at last I agreed to his terms, the man came forward. His robes marked him as an inquisitor, but I knew him to be false. Together, we carried Ser Joellaut to the infirmary, and on his first night in Whitebrim Front “Inquisitor Guillaime” was heralded as a hero..."},{"name":"PRUNILLA","text":"Soon after came the accusations─countless men and women of good moral standing, seized whilst in possession of draconian rosaries. As I feared, he was condemning the innocent to death. I wanted to confess to Lord Drillemont, wanted to put an end to the madness─but then I would remember the inquisitor's threats. And so I did nothing...until Lord Francel was accused."},{"name":"PRUNILLA","text":"Some time ago, I followed the inquisitor and found that he kept draconian rosaries in a chest hidden southeast of Whitebrim Front. So, I took several from his chest and planted them in shipments bound for Skyfire Locks. As I hoped, they were discovered and considered evidence of a conspiracy against House Haillenarte, thus exonerating Lord Francel and casting doubt on the other recent trials. And that is the entire truth, I swear. Halone forgive me for not acting sooner..."},{"name":"PRUNILLA","text":"Whatever is the matter with you? Can you not take a <span class=\"emphasis\">hint</span>? I do not care if you <span class=\"highlight\">doubt</span> my words, stranger. I told you, I know naught of that encyclical. Now, away with you!"},{"name":"PRUNILLA","text":"Do not make me say it aloud again, I beg of you. Even now he could be watching, listening to every word. It may already be too late for us..."},{"name":"DRILLEMONT","text":"Why do you persist in this folly? I will <span class=\"emphasis\">not</span> grant you three access to the Stone Vigil. Do not make me repeat myself."},{"name":"DRILLEMONT","text":"There had better be a <span class=\"emphasis\">very</span> good explanation for why you were carrying these rosaries. And where did you find this papal encyclical?"},{"name":"DRILLEMONT","text":"Fury take me, the inquisitor is a <span class=\"emphasis\">heretic</span>!? Never before have I heard such an unbelievable tale...but this evidence and your testimony could have no other explanation..."},{"name":"DRILLEMONT","text":"I have misjudged you and your friends, <span class=\"highlight\">Forename</span>, and for that I deeply apologize. I will permit you to enter the outpost─but first, I must needs beg your assistance. Help me and my knights bring this infernal impostor to justice!"}],"reward":{"items":[{"id":3854,"one":1},{"id":3851,"one":1},{"id":3856,"one":1},{"num":6,"id":5825,"one":1}],"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":130}],"quests":[66475]},"next":[66477]},"partials":[{"type":"npc","id":"1006467","obj":{"i":1006467,"n":"Alphinaud","l":63,"q":5}},{"type":"npc","id":"1006444","obj":{"i":1006444,"n":"Drillemont","l":63,"q":13}},{"type":"npc","id":"1006466","obj":{"i":1006466,"n":"Joellaut","l":63,"q":2}},{"type":"npc","id":"1006468","obj":{"i":1006468,"n":"Prunilla","l":63,"q":1}},{"type":"item","id":"3854","obj":{"i":3854,"n":"Mythril Sabatons","l":40,"c":46885,"t":38,"p":6048}},{"type":"item","id":"3851","obj":{"i":3851,"n":"Peisteskin Crakows","l":40,"c":46218,"t":38,"p":3456}},{"type":"item","id":"3856","obj":{"i":3856,"n":"Boarskin Duckbills","l":40,"c":46331,"t":38,"p":3456}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66475","obj":{"i":66475,"n":"By the Lights of Ishgard","g":1,"l":"Coerthas Central Highlands","s":208}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}}]}