{"quest":{"name":"In Pursuit of the Past","location":"Coerthas Central Highlands","id":66488,"patch":2.0,"sort":211,"eventIcon":71201,"issuer":1006467,"target":1006491,"involved":[1000106,1006444,1006490],"genre":1,"journal":["Alphinaud is eager to enter the Stone Vigil.","Now that the matter of the false inquisitor has been resolved, naught remains to prevent you from entering the Stone Vigil. Alphinaud instructs you to seek an audience with Lord Drillemont, vowing that he and Cid will follow shortly.","Lord Drillemont confirms that according to Ishgardian records the <span class=\"emphasis\">Enterprise</span> was indeed seized by the troops garrisoned at the Stone Vigil shortly after the Calamity. However, it has now been some time since the outpost fell to the dragons, and he cannot vouch for the airship's preservation or even its presence. Though it may all be for naught, you have little choice but to search the ruins regardless. Make your way to the entrance to the Stone Vigil, which stands to the northwest of Whitebrim Front, and speak with Ser Nathelain to gain admission.","Ser Nathelain confirms that you may enter the Stone Vigil whenever you wish.<br><br>※Challenge the Stone Vigil with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","While fighting your way through the Stone Vigil, you stumble upon the <span class=\"emphasis\">Enterprise</span>, which appears to be in one piece. Unfortunately, that piece is situated dangerously close to a vast sleeping dragon. Leaving you to keep an eye on the beast, Cid and Alphinaud sneak aboard the airship and begin preparing it for departure. It is at this moment that Lahabrea appears. After remarking that you of all mortals may well have the strength to defeat Garuda, the Ascian uses his magicks to awaken the dragon, and you are soon locked in a desperate struggle with the creature as Cid and Alphinaud look on.","After a titanic struggle, you somehow succeed in slaying the dragon, earning yourself the praise of Alphinaud in so doing. Your elation at having survived the encounter is dampened somewhat by the revelation that the <span class=\"emphasis\">Enterprise</span> is more badly damaged than had been hoped. Thankfully, Cid manages to make sufficient repairs to the ship to enable you to make the flight back to Gridania. Speak with Alphinaud, and together determine how best to proceed.","Despite Alphinaud's claim that recovering the <span class=\"emphasis\">Enterprise</span> would be a cause for celebration, the young Sharlayan seems disinclined to revel. Instead, he reminds you that your work is far from done, and that the airship was only ever a means to an end. Next, you must find a way to restore the <span class=\"emphasis\">Enterprise</span> to its former glory."],"objectives":["Speak with Drillemont.","Speak with Nathelain.","Enter the Stone Vigil.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"As I am sure you will agree, it is past time we entered the Stone Vigil. Pay Lord Drillemont a visit and remind him of his obligation to us─Cid and I will follow anon."},{"name":"DRILLEMONT","text":"We owe you all a great debt of gratitude. Had it not been for you, the heretic masquerading as Inquisitor Guillaime would still be among us, free to prey upon the innocent."},{"name":"DRILLEMONT","text":"I see now that I was a fool to dismiss your claims out of hand... But you must understand, it seemed too much to hope that the Scions of the Seventh Dawn still lived, to say nothing of Master Garlond!"},{"name":"DRILLEMONT","text":"Never have I been happier to be proven wrong."},{"name":"ALPHINAUD","text":"Well, it is gratifying to know that <span class=\"emphasis\">someone</span> has derived a measure of enjoyment from your error."},{"name":"ALPHINAUD","text":"Now, if you have no further objections, we would appreciate it if you would permit us to enter the Stone Vigil and retrieve our airship."},{"name":"DRILLEMONT","text":"Yes! Yes, of course. It is the very least I can do, given all that you have done for us."},{"name":"DRILLEMONT","text":"But entering the outpost is the least of your concerns, I fear..."},{"name":"ALPHINAUD","text":"You speak of the Dravanians that now hold the ruin."},{"name":"DRILLEMONT","text":"...In part, yes. I should explain: shortly after you first arrived, I had my men scour the old records. They confirmed that an abandoned airship had been seized by the soldiers garrisoned at the Stone Vigil in the days following the Calamity."},{"name":"DRILLEMONT","text":"As far as we have been able to ascertain, it was still in their custody when the outpost was overrun by the dragons. Whether it was damaged or destroyed during the battle, I cannot say, nor can I give you any assurances that it has not been removed in the intervening years."},{"name":"DRILLEMONT","text":"For far too long, the ruin has served as a Dravanian foothold in Coerthas, from which they have struck out at us with depressing regularity."},{"name":"DRILLEMONT","text":"Though we have pushed them back behind the walls, we have as yet been unable to drive them out, and I cannot say when the situation will change."},{"name":"ALPHINAUD","text":"Or <span class=\"emphasis\">how</span> it will change. Forgive me, Lord Drillemont, but there is no guarantee that you will prevail. In any event, we have not the time to wait. We will secure our property without Ishgardian aid."},{"name":"DRILLEMONT","text":"I see. Well, that may be for the best."},{"name":"DRILLEMONT","text":"I will inform Ser Nathelain of your impending visit. May Halone guide you, Scions."},{"name":"NATHELAIN","text":"Hail, <span class=\"highlight\">Forename</span>! Lord Drillemont has apprised me of the situation. You may enter the Stone Vigil whensoever you will."},{"name":"NATHELAIN","text":"Every knight in Whitebrim Front is praying for your success. May the Fury guide and protect you."},{"name":"ALPHINAUD","text":"Look! It's the <span class=\"emphasis\">Enterprise</span>!"},{"name":"CID","text":"Yes...just beyond that enormous sleeping dragon."},{"name":"ALPHINAUD","text":"The dragon is not our concern. We have come for the airship, and only the airship."},{"name":"ALPHINAUD","text":"Cid─you and I will sneak aboard the <span class=\"emphasis\">Enterprise</span> and prepare it for launch."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>─you stay here and keep an eye on the beast."},{"name":"ALPHINAUD","text":"If it wakes, we may need you to provide a distraction until we are ready to depart. You can manage that, can't you?"},{"name":"ALPHINAUD","text":"That settles it, then. Shall we, Cid?"},{"name":"CID","text":"As you command..."},{"name":"LAHABREAEORZEA","text":"...So you mean to slay Garuda next? Interesting. Most interesting."},{"name":"LAHABREAEORZEA","text":"And you are aware that her strength greatly exceeds that of your previous primal conquests? ...A testament to the fanatical devotion of her followers. The Ixal are nothing if not zealous."},{"name":"LAHABREAEORZEA","text":"In spite of your past achievements, I labor to believe that you will best this foe."},{"name":"LAHABREAEORZEA","text":"Yet only a fool would underestimate the great Bringer of Light, slayer of Ifrit, bane of Titan..."},{"name":"LAHABREAEORZEA","text":"If any mortal is capable of defeating the Lady of the Vortex, it is you."},{"name":"LAHABREAEORZEA","text":"Win or lose, the battle should at least make for an entertaining spectacle.<br>...Assuming, of course, you live that long."},{"name":"CID","text":"Alphinaud! The dragon!"},{"name":"ALPHINAUD","text":"Confound it all!"},{"name":"LAHABREAEORZEA","text":"Let us see how well your blasphemous gifts serve you this time, crystal bearer!"},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>! <span class=\"highlight\">Forename</span>! Are you all right? Speak to me!"},{"name":"ALPHINAUD","text":"Twelve be praised, I feared the beast had injured you."},{"name":"ALPHINAUD","text":"I see now why the others rated you so highly. When you were caught in the midst of that aetheric bubble with the dragon, I was all but certain my next mission would be to find a new champion."},{"name":"ALPHINAUD","text":"Thank the gods for sparing me that inconvenience. I have quite enough to do already. Which reminds me─Cid is working on the <span class=\"emphasis\">Enterprise</span> as we speak. Let us go and see what he has to say."},{"name":"ALPHINAUD","text":"What say you, Cid? Will she fly?"},{"name":"CID","text":"Yes...though it will not be a pleasant ride."},{"name":"ALPHINAUD","text":"Well, I daresay it will be no more unpleasant than staying here. 'Tis a pity the <span class=\"emphasis\">Enterprise</span> is not in a better state, but if she will allow us to quit this place, I shall not complain."},{"name":"ALPHINAUD","text":"If all are in agreement, let us return to Gridania."},{"name":"ALPHINAUD","text":"Though I would like nothing more than to set course for the Howling Eye, it is plain the <span class=\"emphasis\">Enterprise</span> is in no condition to weather the storm. She must needs be repaired if we are to proceed with our mission."},{"name":"CID","text":"This is all so familiar. I...I <span class=\"emphasis\">know</span> this airship. If I could just..."},{"name":"CID","text":"Bah, it's no use."},{"name":"CID","text":"...Let's go."},{"name":"ALPHINAUD","text":"Ah, how I have longed for the more agreeable climate of the Twelveswood."},{"name":"ALPHINAUD","text":"Yet I will not deny the Holy See had its charms. Endless detours aside, our Ishgardian jaunt proved quite an adventure!"},{"name":"ALPHINAUD","text":"Alas, our work is far from done. We still have an airship to repair and a primal to slay. No rest for the heroic, eh?"},{"name":"LIONNELLAIS","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Do you wish to proceed to your vessel?"},{"name":"Q1","text":"Proceed to the landing area?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"}],"reward":{"gil":4616,"xp":23000,"instance":11},"reqs":{"jobs":[{"lvl":41,"id":130}],"quests":[66477]},"next":[66489,66753,66788,66856,66910,67022]},"partials":[{"type":"npc","id":"1006467","obj":{"i":1006467,"n":"Alphinaud","l":63,"q":5}},{"type":"npc","id":"1006491","obj":{"i":1006491,"n":"Alphinaud","l":52,"q":2}},{"type":"npc","id":"1000106","obj":{"i":1000106,"n":"Lionnellais","l":52,"q":6,"t":"Airship Ticketer"}},{"type":"npc","id":"1006444","obj":{"i":1006444,"n":"Drillemont","l":63,"q":13}},{"type":"npc","id":"1006490","obj":{"i":1006490,"n":"Nathelain","l":63,"q":2}},{"type":"instance","id":"11","obj":{"i":11,"n":"The Stone Vigil","c":61801,"t":"Dungeons","min_lvl":41,"max_lvl":43}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}},{"type":"quest","id":"66489","obj":{"i":66489,"n":"Into the Eye of the Storm","g":1,"l":"Gridania","s":212}},{"type":"quest","id":"66753","obj":{"i":66753,"n":"Peace for Thanalan","g":34,"l":"Ul'dah","s":0,"f":1}},{"type":"quest","id":"66788","obj":{"i":66788,"n":"Seeking Solace","g":36,"l":"Gridania","s":0,"f":1}},{"type":"quest","id":"66856","obj":{"i":66856,"n":"Highway Robbery","g":38,"l":"Limsa Lominsa","s":0,"f":1}},{"type":"quest","id":"66910","obj":{"i":66910,"n":"They Came from the Deep","g":40,"l":"Limsa Lominsa","s":0,"f":1}},{"type":"quest","id":"67022","obj":{"i":67022,"n":"A Bad Bladder","g":42,"l":"Gridania","s":1,"f":1}}]}