{"quest":{"name":"When a Man Loves a Woman","location":"Coerthas Central Highlands","id":66484,"patch":2.0,"sort":400,"eventIcon":71221,"issuer":1006481,"target":1006481,"genre":94,"journal":["When lovers call, an adventurer must answer─for along with art, truth, and justice, love is one of life's great adventures. Will you hear Lancefer's plea?","Behind the western face of Snowcloak are entombed villagers of Falcon's Nest, and Lancefer begs you to free one body in particular from its icy embrace. Use the iron pick on the weak spot on the western face.","Your efforts are rewarded by a frozen corpse. If this is Lancefer's wife, she should have a ring of troth upon her hand. Check the body for the ring.","You find a ring. This, then, is the mortal remain of the woman Lancefer calls his heart, for whom he returned to this perilous place. Tarry not in this icy crypt, and take the ring back to Lancefer.","They say Ishgardian wives are adept at waiting─for their men to return from the Front, for the scorched earth to sprout again, for happiness to find them─but Lancefer's wife need wait no more. In this act of love, surely he will find some peace."],"objectives":["Use the iron pick on the target area.","Check the frozen corpse and collect the ring.","Give the ring to Lancefer."],"dialogue":[{"name":"LANCEFER","text":"You are our new protector, is that not so? I must have your help in laying something to rest."},{"name":"LANCEFER","text":"There are bodies entombed in the ice, over there to the west. When the freeze came, the folk of Falcon's Nest fled, but not all of them in time. One of them was my wife."},{"name":"LANCEFER","text":"To search for the corse of my beloved among those of folk I knew all my life─'tis more than I can bear. I beg you to go in my stead. Here is a pick. Find her for me, and bring back her ring of troth."},{"name":"LANCEFER","text":"You are back so soon... Could you not find her? "},{"name":"LANCEFER","text":"Ah...that is the ring, the same I slipped on her hand when we were wed. Thank you, adventurer. You are a worker of wonders. In my heart, I had not expected to see this again."},{"name":"LANCEFER","text":"The freeze came quickly on the heels of the Calamity, but there was as yet a narrow defile. The entire hamlet gathered at its mouth, and we began to pass through it, to safety..."},{"name":"LANCEFER","text":"Not even half of us were through before a snowslide struck. In the confusion, her hand slipped from mine. The surge of snow and the crowd carried me to this side, and she was left behind. <span class=\"emphasis\">I</span> left her behind."},{"name":"LANCEFER","text":"When a widowed man or woman takes back the ring of troth, the dead are free to wed again in the afterlife. She was young still and merry of heart. I would that she finds a mate again, though my heart cries out for her to wait for me..."}],"reward":{"gil":1549,"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":1}],"quests":[66477]}},"partials":[{"type":"npc","id":"1006481","obj":{"i":1006481,"n":"Lancefer","l":63,"q":2}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}}]}