{"quest":{"name":"The Bone Collector","location":"Coerthas Central Highlands","id":66481,"patch":2.0,"sort":400,"eventIcon":71221,"issuer":1006478,"target":1006478,"genre":94,"journal":["Ser Berengeoit strikes you as a man with a sizable chip upon his shoulder, and such men are often ready to spend handsomely.","Ser Berengeoit insists that one dark night, he slew a wounded dragon with a well-aimed shot from a ballista. Alas, without a trophy, none will call him aught but a fevered fool. Someone must find the carcass and bring back a bone.","To your mild surprise, you find a dead dragon on a gorge floor as the young knight insisted, and collect from it a fine bone. This trophy will mean more to Ser Berengeoit than all the fish in the Sea of Clouds.","Ser Berengeoit receives the dragon bone with something resembling ecstasy. If even half the knights of Ishgard are as covetous of a kill, there is little to stop the war from continuing to rage..."],"objectives":["Find the dragon bone.","Deliver the dragon bone to Berengeoit."],"dialogue":[{"name":"BERENGEOIT","text":"Adventurer, how would you like to assist a dragonslayer? I put a bolt through a dragon while manning the ballistas overlooking the gorges. I saw its death throes, and then it plunged..."},{"name":"BERENGEOIT","text":"But nobody will believe me! I had not the time to collect a trophy before I was relieved, and they will not credit what they do not see!"},{"name":"BERENGEOIT","text":"The carcass is out there in the bottom of a gorge, just waiting to be claimed. I hear you can find <span class=\"emphasis\">anything</span>, and I need a dragon bone to show the others!"},{"name":"BERENGEOIT","text":"Did you get my dragon bone? That was my <span class=\"emphasis\">first</span> dragon, you know... It's <span class=\"emphasis\">special</span>..."},{"name":"BERENGEOIT","text":"Yes! Yes! Dragon bone! Who's spinning yarns now, huh? By the Fury!"},{"name":"BERENGEOIT","text":"Berengeoit Dragonslayer, blessed in the eyes of Halone... I have <span class=\"emphasis\">dreamed</span> of this. Do you realize that I shall be commended by the archbishop himself?"}],"reward":{"items":[{"id":4247,"one":1},{"id":4245,"one":1},{"id":5826,"one":1}],"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":1}],"quests":[66477]}},"partials":[{"type":"npc","id":"1006478","obj":{"i":1006478,"n":"Berengeoit","l":63,"q":1}},{"type":"item","id":"4247","obj":{"i":4247,"n":"Mythril Ear Cuffs","l":40,"c":55205,"t":41}},{"type":"item","id":"4245","obj":{"i":4245,"n":"Pearl Earrings","l":39,"c":55228,"t":41}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}}]}