{"quest":{"name":"Ice Ice Daily","location":"Coerthas Central Highlands","id":66482,"patch":2.0,"sort":400,"eventIcon":71221,"issuer":1006479,"target":1006480,"genre":94,"journal":["Rumor has it that Forsemart has a job that involves travel.","Forsemart reveals that he is one of those searching for answers in Snowcloak, but the expedition faces an uncertain future after its sellswords abandoned their posts. If you are interested in seeing this wondrous ice wall, Ourdilic is the one to speak to.","Ourdilic notes with some acerbity that the dragoons claimed to be able to spare not a single man. Knowing the situation at Whitebrim Front, you suspect this was naught but the stark truth..."],"objectives":["Speak with Ourdilic."],"dialogue":[{"name":"FORSEMART","text":"I am a part of the expedition to Snowcloak. Know you that great ice wall that swells like a braggart's tale? There is much danger in those parts, and so 'twas that my group took on sellswords."},{"name":"FORSEMART","text":"However, affrighted by the creatures that stalk the wilderness, they abandoned their posts and fled. Now, what manner of cravenness is this? It beggars all belief!"},{"name":"FORSEMART","text":"You leave no stone unturned to complete your mission, they say. What say you? Will you guard the expedition? We are sore in need of a sword arm."},{"name":"FORSEMART","text":"You'll know more from Ourdilic at Snowcloak. Be well, adventurer. Keep my people safe."},{"name":"OURDILIC","text":"<span class=\"highlight\">Forename</span>, is it? Oh, Forsemart sent you! By the ruth of Halone, you are welcome here. We had even contemplated abandoning the expedition, for lack of guards."},{"name":"OURDILIC","text":"The dragoons can be of no help, they say, stretched thin as they are with the dragon wars. Your presence is truly fortuitous!"}],"reward":{"gil":1549,"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":1}],"quests":[66477]},"next":[66483]},"partials":[{"type":"npc","id":"1006479","obj":{"i":1006479,"n":"Forsemart","l":63,"q":1}},{"type":"npc","id":"1006480","obj":{"i":1006480,"n":"Ourdilic","l":63,"q":4}},{"type":"quest","id":"66477","obj":{"i":66477,"n":"The Heretic among Us","g":1,"l":"Coerthas Central Highlands","s":210}},{"type":"quest","id":"66483","obj":{"i":66483,"n":"A Heart Divided","g":94,"l":"Coerthas Central Highlands","s":400}}]}