{"quest":{"name":"Into the Eye of the Storm","location":"Gridania","id":66489,"patch":2.0,"sort":212,"icon":100144,"eventIcon":71201,"issuer":1006492,"target":1006493,"involved":[1000106],"genre":1,"journal":["Cid appears to be deep in thought.","In its current condition, the <span class=\"emphasis\">Enterprise</span> cannot endure the tumultuous winds which encircle the Howling Eye, Garuda's sanctuary. To breach the barrier, Cid has devised a plan to harness the power of a corrupted crystal. While he himself has no idea where to find one, he knows a man who might─the scholar, Lamberteint, who resides in Camp Drybone.","After learning of your shared interest in corrupted crystals, Professor Lamberteint seems eager to discuss his work. With any luck, your time in Thanalan will be brief and forgettable."],"objectives":["Speak with Lamberteint in Camp Drybone."],"dialogue":[{"name":"CID","text":"It calms me to look at her."},{"name":"CID","text":"It's as though I've been reunited with a part of me I never knew was missing..."},{"name":"ALPHINAUD","text":"Hardly surprising. You <span class=\"emphasis\">did</span> design and build her."},{"name":"ALPHINAUD","text":"I bear good news! The Seedseers have granted our request to house the <span class=\"emphasis\">Enterprise</span>. We may take as long as we require to repair her."},{"name":"ALPHINAUD","text":"Of course, it would be rank folly to take one moment <span class=\"emphasis\">more</span> than we require. Garuda, lest we forget, grows stronger by the hour. If we are to have any hope of wresting this benighted realm from her talons, it must needs be <span class=\"emphasis\">soon</span>."},{"name":"ALPHINAUD","text":"Though I am no expert on the workings of airships, it seems plain to me that the <span class=\"emphasis\">Enterprise</span> suffered much from her time in the wilderness. Am I not correct, Cid?"},{"name":"CID","text":"You are. Frankly, it's a miracle she carried us this far."},{"name":"ALPHINAUD","text":"As you know, the Howling Eye is encircled by a raging tempest, apt to turn proud trees to matchwood. Our battle will end before it begins if the <span class=\"emphasis\">Enterprise</span> cannot weather the storm."},{"name":"CID","text":"Given time, I believe I can fully repair her..."},{"name":"CID","text":"But if this tempest is as fearsome as you say, even that may not be enough."},{"name":"ALPHINAUD","text":"&lt;sigh&gt; Confound it. There <span class=\"emphasis\">must</span> be a way...a way to brave the fury of the elements..."},{"name":"CID","text":"...The <span class=\"emphasis\">elements</span>. But of course! That's it!"},{"name":"CID","text":"We work upon the element itself! Using the power of a corrupted crystal, we could clear a path through the storm, and spare the <span class=\"emphasis\">Enterprise</span> a battering!"},{"name":"ALPHINAUD","text":"I see! You propose to utilize the properties of a crystal to alter the elemental aspect of the barrier! It seems so <span class=\"emphasis\">childishly</span> simple in retrospect!"},{"name":"ALPHINAUD","text":"Though mayhap not to <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>. We speak of the manifestations of over-aspected aether that can be found throughout Eorzea."},{"name":"ALPHINAUD","text":"Since the Calamity disrupted the land's aetheric currents, such crystals have become comparatively commonplace."},{"name":"ALPHINAUD","text":"...Which has been a cause of great woe, as they are known to warp aetheric energies, including those of living organisms."},{"name":"CID","text":"The point is, we could theoretically use a corrupted crystal to convert the wind-aspected aether comprising Garuda's barrier into aether of another aspect─one she cannot control."},{"name":"CID","text":"With certain modifications, the <span class=\"emphasis\">Enterprise</span> should be able to deliver us to the Howling Eye in comfort, however hard Garuda blows..."},{"name":"ALPHINAUD","text":"But we are getting ahead of ourselves. All of this rests upon our ability to procure a crystal with the necessary properties. Have you any idea where we might acquire one?"},{"name":"CID","text":"No. But I know a man who might. A scholar by the name of Lamberteint, who resides in Camp Drybone."},{"name":"CID","text":"Strange as it may sound, I met him during my time at the church. Well, <span class=\"emphasis\">Marques</span> met him, I suppose. Whether out of pity, or for want of a more willing listener, he would talk to me for hours at a time about his aetheric studies, corrupted crystals being his pet subject. It was as a result of these conversations that poor Marques was observed to possess an uncommon knack for theoretical science..."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, I need you to return to Thanalan and seek out this scholar. Cid and I will set about repairing the <span class=\"emphasis\">Enterprise</span> in your absence."},{"name":"LAMBERTEINT","text":"Hm? Why yes, I am Professor Lamberteint. Beg pardon? You wish to hear about my research on corrupted crystals? ...<span class=\"emphasis\">Truly</span>? Well, nothing would give me greater pleasure than to discuss my work with a fellow <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of science!"},{"name":"LIONNELLAIS","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Do you wish to proceed to your vessel?"},{"name":"Q1","text":"Proceed to the landing area?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"}],"reward":{"gil":1676,"items":[{"id":2812,"one":1},{"id":27674,"one":1},{"id":2810,"one":1},{"num":6,"id":5825,"one":1}],"xp":23000},"reqs":{"jobs":[{"lvl":41,"id":130}],"quests":[66488]},"next":[66490,66491]},"partials":[{"type":"npc","id":"1006492","obj":{"i":1006492,"n":"Cid","l":52,"q":3}},{"type":"npc","id":"1006493","obj":{"i":1006493,"n":"Lamberteint","l":44,"q":6}},{"type":"npc","id":"1000106","obj":{"i":1000106,"n":"Lionnellais","l":52,"q":6,"t":"Airship Ticketer"}},{"type":"item","id":"2812","obj":{"i":2812,"n":"Mythril Celata","l":40,"c":40122,"t":34,"p":5953}},{"type":"item","id":"27674","obj":{"i":27674,"n":"Altered Mythril Magnifiers","l":41,"c":40901,"t":34}},{"type":"item","id":"2810","obj":{"i":2810,"n":"Woolen Turban","l":40,"c":41601,"t":34,"p":3402}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66488","obj":{"i":66488,"n":"In Pursuit of the Past","g":1,"l":"Coerthas Central Highlands","s":211}},{"type":"quest","id":"66490","obj":{"i":66490,"n":"All Due Precautions","g":0,"l":"Eastern Thanalan","s":213}},{"type":"quest","id":"66491","obj":{"i":66491,"n":"Sealed with Science","g":1,"l":"Eastern Thanalan","s":214}}]}