{"quest":{"name":"Tresses in Distress","location":"Eastern Thanalan","id":66493,"patch":2.0,"sort":410,"eventIcon":71221,"issuer":1006209,"target":1006209,"genre":93,"journal":["Helmhart has it in his head that you are his mane man, and returns to you with an even more hair-raising request.","Helmhart's malady has taken a turn for the worse, and he begins girding his loins for what may well be the final battle. Stalk the golden fleeces near the Burning Wall, and obtain five vials of snurble blood.","You have drained the blood from your vanquished prey. Rush the crimson cargo to Helmhart whilst he still has the strength to make use of it.","Seizing the fresh snurble blood, Helmhart concocts a tonic even more noxious than the previous one. Apply a generous amount and think of Eorzea.","You have fulfilled your duties with admirable stolidity. While Helmhart's ecstatic cries indicate a certain kind of efficacy, you fear that, like the tide, his receding hairline waits for no man."],"objectives":["Slay golden fleeces and obtain snurble blood.","Give the blood to Helmhart.","Apply the snurble tonic to Helmhart's head."],"dialogue":[{"name":"HELMHART","text":"Oh no, no, no, nooo! It's not working─my jaded scalp turns its nose up at the phurble potation!"},{"name":"HELMHART","text":"You! You're that trusty adventurer, <span class=\"highlight\">Forename</span>! I need you to fetch something with all haste!"},{"name":"HELMHART","text":"Time is short and the comb is a cruel mistress. Long have I feared this day would come...but I am ready! The phurble tonic is dead; long live the snurble tonic!"},{"name":"HELMHART","text":"You know where to get snurble blood, don't you?<br>...Snurbles, you say? Wrong! You get snurble blood from <span class=\"emphasis\">golden fleece</span>! Don't think about it─just go to the Burning Wall and kill five!"},{"name":"HELMHART","text":"Is this...the end? I thought we would always have each other, my hair and I..."},{"name":"HELMHART","text":"Snurble blood! You, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, are a lifesaver. Now, for the tonic. Uncork the sea pickles─mind the effluvia─and a widdle of this, a pizzle of that...and there!"},{"name":"HELMHART","text":"Don't stand on ceremony, tick-tock, tick-tock! Put your back into it and <span class=\"emphasis\">work</span> my scalp!"},{"name":"HELMHART","text":"Ooh! Ahhh! Feel that, my precious tresses? Papa's coming to save yooouuu!"},{"name":"HELMHART","text":"Once again, I am in your debt. Now that we know each other better, I can reveal the truth: this hair keeps me alive. I feel a great enervation of spirit whenever a strand is left on my comb. Surely, that is proof enough!"}],"reward":{"gil":1993,"xp":11500},"reqs":{"jobs":[{"lvl":41,"id":1}],"quests":[66287]}},"partials":[{"type":"npc","id":"1006209","obj":{"i":1006209,"n":"Helmhart","l":44,"q":2}},{"type":"quest","id":"66287","obj":{"i":66287,"n":"Hair Club for Hyur","g":93,"l":"Eastern Thanalan","s":240}}]}