{"quest":{"name":"It's Probably Not Pirates","location":"Western La Noscea","id":66496,"patch":2.0,"sort":217,"eventIcon":71201,"issuer":1006497,"target":1006497,"involved":[1006498,1006499,1006500],"genre":1,"journal":["Ceana is frustrated with the progress of her research.","Ceana is certain that the area surrounding Pharos Sirius on the Isles of Umbra is replete with corrupted crystals. However, she has yet to test this hypothesis, as all access to the isles is prohibited at present. As she lacks your charming wit and way with words, she bids you question the Yellowjackets of Aleport in her stead, and attempt to discover the reason behind the travel restrictions.","The three Yellowjackets you elect to question speak of spirits and undead infesting the Isles of Umbra. Relay this disturbing news to Ceana.","Ceana is quite perturbed by the revelation that undead abominations are the cause of her troubles. Hopefully this will not deter her from aiding you in your quest..."],"objectives":["Question the Yellowjackets of Aleport.","Report to Ceana."],"dialogue":[{"name":"CEANA","text":"As I told the professor in my many missives, I believe that the area surrounding Pharos Sirius is replete with corrupted crystals of exceptional strength."},{"name":"CEANA","text":"Unfortunately, I've yet to test my hypothesis, as all access to the Isles of Umbra is prohibited at present, for reasons unknown to me. You see, my attempts to acquire this information are often met with annoyance and disdain. It's rather puzzling, since I always take the time to explain my motivations in great detail to the subjects of my questioning."},{"name":"CEANA","text":"Mayhap you will have better luck wresting information from these Yellowjackets. I've all but given up at this point."},{"name":"FIRKMANN","text":"Yer keen on travelin' to the Isles of Umbra? Bloody 'ells, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, are ye drunk or jus' crazy? Ain't nothin' there but death, death, an' more death!"},{"name":"QAHNEBB","text":"Ah, you startled me! Don't you know better than to sneak up on a person at a time like this, what with all this fatuous gossip of spirits and specters haunting the Isles of Umbra!? Just because I know it's nonsense doesn't make it any less frightening!"},{"name":"ALZAGAMILZA","text":"The Isles of Umbra? What interest have you in that godsforsaken place? Ever since we were forced to abandon Pharos Sirius, the isles have become naught more than a graveyard for ships unable to navigate the shores─and a purgatory for the souls dragged down to the depths with 'em."},{"name":"CEANA","text":"Ah, <span class=\"highlight\">Forename</span>, you've returned! Tell me of your findings."},{"name":"CEANA","text":"R-R-Really!? Infested with the undead, you say. That...that is a very, <span class=\"emphasis\">very</span> interesting development. Excuse me for a moment while I gather my thoughts."}],"reward":{"gil":1676,"xp":23460},"reqs":{"jobs":[{"lvl":42,"id":130}],"quests":[66495]},"next":[66497]},"partials":[{"type":"npc","id":"1006497","obj":{"i":1006497,"n":"Ceana","l":33,"q":6}},{"type":"npc","id":"1006498","obj":{"i":1006498,"n":"Alza Gamilza","l":33,"q":1}},{"type":"npc","id":"1006499","obj":{"i":1006499,"n":"Firkmann","l":33,"q":1}},{"type":"npc","id":"1006500","obj":{"i":1006500,"n":"Q'ahnebb","l":33,"q":1}},{"type":"quest","id":"66495","obj":{"i":66495,"n":"A Promising Prospect","g":1,"l":"Eastern Thanalan","s":216}},{"type":"quest","id":"66497","obj":{"i":66497,"n":"Representing the Representative","g":1,"l":"Western La Noscea","s":218}}]}