{"quest":{"name":"Sweet Somethings","location":"Western La Noscea","id":66499,"patch":2.0,"sort":220,"eventIcon":71201,"issuer":1006503,"target":1006503,"involved":[1006505,1006506,1007639],"genre":1,"journal":["Davyd has a simple proposal for you.","In exchange for furnishing you with the corrupted crystal you seek, Davyd wants you to help him resolve the undead situation. To that end, he would have you first discover the cause behind the sudden influx of shambling corpses. Begin your inquiries by speaking with the party of adventurers who have made camp on the eastern shore.","The adventurers speak of a beautiful, irresistible voice heard at the Ship Graveyard, which may be connected to the undead. Report your findings to Davyd.","Although Davyd appears to have an inkling of what the cause might be, he does not deign to share it with you. Perhaps you should pressure him to voice his thoughts."],"objectives":["Speak with the adventurers.","Report to Davyd."],"dialogue":[{"name":"DAVYD","text":"The writ Master Mimidoa gave you may grant you access to the island, but only authorized personnel may proceed past this point. Why, you ask? Look up and see for yourself."},{"name":"DAVYD","text":"When that giant mass of crystal struck the lighthouse, it caused severe damage to both the structure and the machinery within that once powered the beacon."},{"name":"DAVYD","text":"Aye, contrary to what the smallfolk would have you believe, the fires of Pharos Sirius were not the product of a mage's thaumaturgy or a colossal arcane bomb, but an elaborate contraption fueled by aetherial energy."},{"name":"DAVYD","text":"Repairs are still ongoing, but it's anyone's guess when they'll be complete. What's worse, all work has ceased since rumors of the walking dead drove off our entire crew."},{"name":"DAVYD","text":"Not that those rumors are incorrect─I've observed the fiends from a distance, at the Ship Graveyard to the south. What's drawn them to our shores is still a mystery, though."},{"name":"DAVYD","text":"I'll make you a deal, <span class=\"highlight\">Forename</span>: help me unravel this mystery, and I'll bring you your corrupted crystal. In fact, I shall begin searching for one that satisfies your requirements."},{"name":"DAVYD","text":"As for where to begin your inquiries into the situation, it so happens that a party of three adventurers came ashore not long ago, seeking to scavenge valuable trinkets at the Ship Graveyard. I'd be surprised if they knew nothing of the undead infestation, so it might behoove you to question them."},{"name":"AHLDUWIL","text":"Itsh all there fer the takin'! Five bleedin' yearsh worth of wrecksh and their cargo. But thoshe queer dead thingsh...and that voice... Actually, the voice was quite nice..."},{"name":"ERAPITAROPI","text":"You saw 'em too, right? <span class=\"emphasis\">Dead people</span>. Just shambling about, without a care in the world. Except when they <span class=\"emphasis\">do</span> seem to care, that is, and start shuffling towards the water..."},{"name":"LOUIS","text":"Gods, that voice, that single fleeting verse... I can still hear it... Stay clear of the southern shore, friend. It took every onze of my strength to resist."},{"name":"DAVYD","text":"Hmmm... This talk of an alluring voice is disturbingly familiar, as if... But that's impossible, they're all dead...aren't they?"}],"reward":{"gil":1597,"xp":23460},"reqs":{"jobs":[{"lvl":42,"id":130}],"quests":[66498]},"next":[66503]},"partials":[{"type":"npc","id":"1006503","obj":{"i":1006503,"n":"Davyd","l":33,"q":4}},{"type":"npc","id":"1006505","obj":{"i":1006505,"n":"Ahlduwil","l":33,"q":2}},{"type":"npc","id":"1006506","obj":{"i":1006506,"n":"Erapi Taropi","l":33,"q":2}},{"type":"npc","id":"1007639","obj":{"i":1007639,"n":"Louis","l":33,"q":1}},{"type":"quest","id":"66498","obj":{"i":66498,"n":"The Reluctant Researcher","g":1,"l":"Western La Noscea","s":219}},{"type":"quest","id":"66503","obj":{"i":66503,"n":"History Repeating","g":1,"l":"Western La Noscea","s":221}}]}