{"quest":{"name":"Representing the Representative","location":"Western La Noscea","id":66497,"patch":2.0,"sort":218,"eventIcon":71201,"issuer":1006497,"target":1006497,"involved":[1006501,1006502],"genre":1,"journal":["Ceana seems to have regained her composure.","While you were questioning the Yellowjackets, Ceana was enjoying a pint at the local pub, where she heard tell of a man named Skyfryn, recently returned from the Isles of Umbra, who was detained for unknown reasons. She asks that you speak with Skyfryn in an effort to learn how he obtained permission to travel to the isles.","Skyfryn does not respond to your questions and instead rambles incoherently about a woman he desires desperately to see again. In a rare moment of lucidity, he gives you a golden feather and bids you give it to a man named Mimidoa, along with his apologies. Return to Ceana and see what she makes of Skyfryn's words.","Ceana knows Mimidoa, and states that he grabbed her arse at the pub the other day. Refusing to have any further interaction with the man, it falls to you to discover his connection to Skyfryn.","Mimidoa was dispatched to Aleport so that he might oversee the work being performed at Pharos Sirius. However, the craftsmen have all abandoned their work or simply vanished, presumably due to the rumors of an undead infestation. Upon learning that you wish to visit the Isles of Umbra for your own purposes, Mimidoa offers you a writ of passage, on the condition that you look into the rumors on his behalf. Share this good news with Ceana.","Though skeptical of Mimidoa's claims at first, Ceana recognizes that the writ of passage is genuine. She wishes you well on your journey to the Isles of Umbra, as she has no intention of accompanying you herself."],"objectives":["Speak with Skyfryn.","Speak with Ceana.","Show the golden feather to Mimidoa.","Show the parchment to Ceana."],"dialogue":[{"name":"CEANA","text":"W-W-Worry not, my friend! I've given your findings some thought, and I've concluded that this talk of spirits is naught more than local folklore. As for why all travel to the Isles of Umbra is restricted, well...mayhap it's considered too dangerous, owing to the abandonment of Pharos Sirius?"},{"name":"CEANA","text":"Yes, well, anyway─while you were questioning those Yellowjackets, I paid a visit to the local pub, since even an esteemed scholar like myself enjoys dulling her wits on occasion."},{"name":"CEANA","text":"It was there that I heard tell of a man named Skyfryn, who was recently detained after returning from─wait for it─the <span class=\"emphasis\">Isles of Umbra</span>!"},{"name":"CEANA","text":"This is the first I've heard of someone actually traveling to and from there, so I'm curious as to how he obtained permission. Mind having a chat with him in my stead? He was arrested, after all, so I'm somewhat reticent to approach him myself..."},{"name":"SKYFRYN","text":"I...I have to go back. She calls to me...<span class=\"emphasis\">sings</span> to me..."},{"name":"SKYFRYN","text":"Ugh... Tell Mimidoa I'm sorry. Give him this. He was...he was right..."},{"name":"SKYFRYN","text":"Or...or you could release me? Yes...yes...release me. I will go and tell her... Let me...let me go to her..."},{"name":"SKYFRYN","text":"I...I hear you, my love. Wait for me..."},{"name":"CEANA","text":"What did Skyfryn have to say? Hm, that's not terribly helpful. I couldn't care less how much he misses his favorite bar wench. But what was that about a man named Mimidoa?"},{"name":"CEANA","text":"Wait...I <span class=\"emphasis\">know</span> that name! That's that bastard who grabbed my arse the other day at the pub! Well, if you want to give him that feather, be my guest─I'm not going anywhere near him and his wandering hands."},{"name":"MIMIDOA","text":"'Nother 'nitiate, are ye? No? Then what are ye? Speak up, <span class=\"alternative-container\"><span class=\"alternative\">missy</span><span class=\"alternative\">son</span></span>, I can't hear ye!"},{"name":"MIMIDOA","text":"Eh!? Bugger me, is this what I think it is? Nah, couldn't be... Ye found this, ye say? Where'd ye say ye found it?"},{"name":"MIMIDOA","text":"<span class=\"emphasis\">Skyfryn</span>, ye say? Was hopin' to have a word with the lad, but it sounds like there's naught left 'twixt his ears. He was s'posed to help patch up Pharos Sirius, he was. Company sent me to supervise the lot of 'em."},{"name":"MIMIDOA","text":"Weren't gettin' work done on their own, see─half of 'em walked off, half of 'em <span class=\"emphasis\">ran</span> off, an' half of 'em up an' vanished."},{"name":"MIMIDOA","text":"What's that? Ye be lookin' fer passage to the Isles of Umbra!? Why didn't ye say so─I've been thinkin' o' dispatchin' someone to take a look on behalf of ol' Mimidoa. Tell him how the land lies."},{"name":"MIMIDOA","text":"Ain't nobody been interested till you came a-callin'. Whole port's up in arms 'bout spirits an' so forth. If I had the gil, I'd hire some sellswords an' let 'em sort it out..."},{"name":"MIMIDOA","text":"But ye'll do in a pinch, ye will. Show this parchment to the skipper an' he'll see ye there an' back."},{"name":"MIMIDOA","text":"Eh? What's that? Speak up, now─or better yet, <span class=\"emphasis\">don't</span>. Till ye find out what's the cause o' this commotion, there ain't no call for chitchat."},{"name":"CEANA","text":"So you went and had a word with Mimidoa. I hope the valuable time you saw fit to waste amounted to something."},{"name":"CEANA","text":"You mean that disgusting creature was Skyfryn's <span class=\"emphasis\">superior</span>? I find that hard to believe. But this writ of passage does appear to be genuine, so it must be true..."},{"name":"CEANA","text":"I must say, it is a relief to work with such an industrious <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> as you. I look forward to hearing of the discoveries you will make on the Isles of Umbra...without me."}],"reward":{"gil":1703,"xp":23460},"reqs":{"jobs":[{"lvl":42,"id":130}],"quests":[66496]},"next":[66498]},"partials":[{"type":"npc","id":"1006497","obj":{"i":1006497,"n":"Ceana","l":33,"q":6}},{"type":"npc","id":"1006501","obj":{"i":1006501,"n":"Mimidoa","l":33,"q":1}},{"type":"npc","id":"1006502","obj":{"i":1006502,"n":"Skyfryn","l":33,"q":1}},{"type":"quest","id":"66496","obj":{"i":66496,"n":"It's Probably Not Pirates","g":1,"l":"Western La Noscea","s":217}},{"type":"quest","id":"66498","obj":{"i":66498,"n":"The Reluctant Researcher","g":1,"l":"Western La Noscea","s":219}}]}