{"quest":{"name":"D Is for Dead","location":"Eastern Thanalan","id":66494,"patch":2.0,"sort":410,"eventIcon":71221,"issuer":1006496,"target":1006496,"genre":93,"journal":["A rolling stone such as yourself will surely find some business in common with a fellow called Floating Stone, if you would but speak to the miner.","The area surrounding Burgundy Falls has a unique species of coblyn called the quartz doblyn, found only in certain parts of Thanalan. Floating Stone bids you slay five of these rare creatures for the sole purpose of harvesting clear quartz from them.","You have enough clear quartz to satisfy Floating Stone's thirst for crystals. Return to Burgundy Falls and deliver them to the Roegadyn miner.","Floating Stone seems less than heartbroken by the Calamity, which makes a refreshing change from nearly everybody else on the subject. The hills are still a candy shop, and he a child with a sweet tooth and a pickaxe..."],"objectives":["Slay quartz doblyns and obtain clear quartz.","Deliver the clear quartz to Floating Stone."],"dialogue":[{"name":"FLOATINGSTONE","text":"You know about quartz doblyns? Didn't expect you to; they're only found in the most dangerous reaches of Thanalan. Type of coblyn they are, just kind of...crunchier."},{"name":"FLOATINGSTONE","text":"Oh, yes, they eat crystals, you know, and 'round these parts, there's a king's feast to be had. Makes the doblyns grow pure, clear quartz right in their bodies. Think you can get some for me?"},{"name":"FLOATINGSTONE","text":"Good huntin'? Bag any clear quartz there?"},{"name":"FLOATINGSTONE","text":"Them's what I was after! Clear as a god's piss─no offense intended─and a ring like a bell's."},{"name":"FLOATINGSTONE","text":"The Calamity's changed a lot of things 'round here, that's true enough, but it's still a treasure trove. You can't ask for much more as a miner!"}],"reward":{"gil":1993,"xp":11500},"reqs":{"jobs":[{"lvl":41,"id":1}]}},"partials":[{"type":"npc","id":"1006496","obj":{"i":1006496,"n":"Floating Stone","l":44,"q":1}}]}