{"quest":{"name":"Some Seedy Business","location":"East Shroud","id":66506,"patch":2.0,"sort":430,"eventIcon":71221,"issuer":1000617,"target":1006715,"involved":[1000587],"genre":92,"journal":["What drives Jeulerand to seek an adventurer's help─the sweet smell of success or the acrid stench of failure?","Jeulerand confesses that he finds the sylphs discomfiting to talk to. Go in his stead to present Dellexia with sweetrose perfume.","The sylphs complain that Jeulerand is discomfiting to talk to, but are delighted with the gift. Leave the sylphs oohing and aahing over the atomizer, and head to Larkscall to collect sylvan lily seeds.","As Dellexia said, you need both luck and a keen eye to find the seeds. Luckily, you have both by the caskful. Now that you have the seeds, place them in the hands of Kain, the master botanist at the Sanctum of the Twelve.","Kain seems serenely aware of his apprentice's disinclination to work. You see the beautiful garden that he has grown to exalt the Twelve, and wonder if mayhap there is more divinity outside the Sanctum than inside."],"objectives":["Give the sweetrose perfume to Dellexia.","Obtain sylvan lily seeds while warding off attackers.","Give the seeds to Kain."],"dialogue":[{"name":"JEULERAND","text":"My master sent me to these parts to bring back the seeds of the sylvan lily, but look, it's really difficult to find something in a place you don't even know."},{"name":"JEULERAND","text":"So I thought I'd go to the sylphs. First I asked Selaine what gift I should get, and since I couldn't find any o' that sweetrose stuff, I asked Selaine to get me some..."},{"name":"JEULERAND","text":"...And then I thought about how much <span class=\"emphasis\">better</span> it would be to have an envoy─you know, someone not me─talk to the sylphs. I mean, they're <span class=\"emphasis\">very</span> strange. So I asked Selaine to find me a good adventurer."},{"name":"JEULERAND","text":"Look, I'm doin' the best I can here. Yes, I could be doing it myself, but then Master probably won't get his seeds. So will you please give the perfume to the sylphs and find out where the lily seeds are? That's all!"},{"name":"JEULERAND","text":"And when you're done with that, could you collect the seeds? And deliver them to Master Botanist Kain at the Sanctum of the Twelve? That's <span class=\"emphasis\">all</span>. I'll ask Selaine to do the rest."},{"name":"DELLEXIA","text":"Gathering one does not observe common courtesies. This one thinks gathering one must learn manners!"},{"name":"DELLEXIA","text":"This one likes the scent of the sweetrose! The bottle makes a scented mist this one also likes. Walking one brings good gifts!"},{"name":"DELLEXIA","text":"Walking one seeks seeds of the sylvan lily? Walking one shall find it in Larkscall if lucky. Lucky and looking at the ground!"},{"name":"DELLEXIA","text":"This one warns walking one, Larkscall is full of touched ones. Touched ones not kind like these ones. Walking one will be careful, yes?"},{"name":"KAIN","text":"Good, good... All I need is a bed of sylvan lilies there."},{"name":"KAIN","text":"These are seeds of the sylvan lily! How did you know...? Ah, I see. Jeulerand. Had you do all the work, did he?"},{"name":"KAIN","text":"Out of these seeds will come white flowers─the tint of pure light without even a hint of color. That is what faith is, you see. There are twelve hues, twelve paths to travel to a place where all walls fall and all hues become as one."},{"name":"KAIN","text":"But I am a botanist, 'twould be a poor garden that has but one hue. I hope you will take respite here and see the beauty we have wrought."},{"name":"POP","text":"An appalling screech assaults your ears!"}],"reward":{"gil":2500,"xp":11960},"reqs":{"jobs":[{"lvl":43,"id":1}],"quests":[66505]},"next":[66508]},"partials":[{"type":"npc","id":"1000617","obj":{"i":1000617,"n":"Jeulerand","l":55,"q":2}},{"type":"npc","id":"1006715","obj":{"i":1006715,"n":"Kain","l":55,"q":2}},{"type":"npc","id":"1000587","obj":{"i":1000587,"n":"Dellexia","l":55,"q":4}},{"type":"quest","id":"66505","obj":{"i":66505,"n":"Adventurer for Hire","g":92,"l":"Gridania","s":430}},{"type":"quest","id":"66508","obj":{"i":66508,"n":"This One's for the Lovers","g":92,"l":"East Shroud","s":430}}]}