{"quest":{"name":"Windy Wedding","location":"East Shroud","id":66509,"patch":2.0,"sort":430,"eventIcon":71221,"issuer":1006717,"target":1006717,"genre":92,"journal":["Elfleda needs help preparing for the social event of the season.","All aglow over her attendance at the forthcoming nuptials, Elfleda enlists your help in obtaining wind sprite cores. Slay some wind sprites and collect four cores.","You have obtained four wind sprite cores. If you would know why Elfleda needs such a thing for a Ceremony of Eternal Bonding, return to the Sanctum and place the cores in her hands.","Elfleda happily confides her plans to create a storm of rose petals for her friend. Imagining shattered windows and an airborne brigade of samite-clad ladies, you suggest she use just the one core..."],"objectives":["Slay wind sprites for their cores.","Give the wind sprite cores to Elfleda."],"dialogue":[{"name":"ELFLEDA","text":"The Sanctum feels so very...<span class=\"emphasis\">sanctified</span>, don't you find? A very good friend of mine─practically sisters, we are─is to be joined to her beloved here, and I've been invited. It is such an honor─you ought to see her trousseau!"},{"name":"ELFLEDA","text":"But I digress! So easy to do that about dresses, don't you find? Especially about Meracydian samite and this <span class=\"emphasis\">wonderfully</span> fine lace made by tiny Lalafellin children. There I go again! I meant to ask you about wind sprites, do pardon me."},{"name":"ELFLEDA","text":"Well, not really wind sprites so much as their cores. I need four of them. Why? Oh, I can't tell you! Not until you get them. Secrets are so much fun, don't you find?"},{"name":"ELFLEDA","text":"You have the cores? Wonderful! Oh, this <span class=\"emphasis\">will</span> be the social event of the season. So exciting! My friend and I are very close─practically sisters, you know!"},{"name":"ELFLEDA","text":"Thank you ever so much! Shall I tell you my little secret? Well, since you've been so very helpful... I'm going to use these when it's time to throw the rose petals. It will be quite the flower storm, to be sure!"},{"name":"ELFLEDA","text":"Four is too many? Are you sure? Oh. Well, I suppose I <span class=\"emphasis\">should</span> try it beforehand once, perhaps on my own estate. It <span class=\"emphasis\">is</span> the social event of the season."}],"reward":{"items":[{"num":3,"id":4553,"one":1},{"num":3,"id":4556,"one":1}],"xp":11960},"reqs":{"jobs":[{"lvl":43,"id":1}]}},"partials":[{"type":"npc","id":"1006717","obj":{"i":1006717,"n":"Elfleda","l":55,"q":1}},{"type":"item","id":"4553","obj":{"i":4553,"n":"Mega-Potion","l":45,"c":20603,"t":44,"p":528}},{"type":"item","id":"4556","obj":{"i":4556,"n":"Hi-Ether","l":35,"c":20622,"t":44,"p":432}}]}