{"quest":{"name":"Too Many Cooks","location":"Western La Noscea","id":66502,"patch":2.0,"sort":420,"eventIcon":71221,"issuer":1006506,"target":1006506,"genre":91,"journal":["The haunted wrecks contain all manner of precious cargo, and Erapi Taropi believes he can find just the spice to take his soup from bland to grand.","Forced to wait out the ongoing haunting of the Isles of Umbra, the reluctant looter Erapi Taropi busies himself with supper. While his fish chowder smells just fine to you, he would have you help him improve it all the same. Venture into the Ship Graveyard and bring back a handful of Far Eastern spices from an abandoned spice box.","You have located the box and grabbed a handful of its contents. Are spices usually so squishy? They certainly do things differently in the Far East. Deliver the spices to Erapi Taropi's more capable hands.","You hand the spices to Erapi Taropi, who discovers that they are a moldy mess...<span class=\"emphasis\">after</span> stirring them into the chowder. Your appetite departs abruptly at the smell, and poor Erapi Taropi begins to gloomily count his gil for fresh supplies."],"objectives":["Collect Far Eastern spices from the spice box.","Give the spices to Erapi Taropi."],"dialogue":[{"name":"ERAPITAROPI","text":"Well, I'm certainly up a creek without an oar. <span class=\"emphasis\">Easy</span> coin, they said. Waltz right in, grab the washed-up goods, then be on my way. “Everyone'll think you a ghost!” Bah! Might've worked 'cept for the <span class=\"emphasis\">real</span> walkin'-dead spirits about."},{"name":"ERAPITAROPI","text":"'Tis a damn shame, but ain't nothin' worth rousin' the wrath o' them skeletons. All that booty up for grabs, but I got nothin' to grab but a ladle."},{"name":"ERAPITAROPI","text":"...What? A man's gotta eat while he waits for restless spirits to go wanderin' elsewise. You look hungry yourself. Fancy some of this here chowder? Made it myself!"},{"name":"ERAPITAROPI","text":"Had nothin' to season it with but salt, though, so it's on the bland side. While I tend it, why don't you go to the Graveyard right quick and bring back spices? I saw some nice-lookin' Far Eastern stuff before I had to scarper on account of a phantom."},{"name":"ERAPITAROPI","text":"You got 'em? Chowder's comin' along nice, like. I could always cook a fine chowder..."},{"name":"ERAPITAROPI","text":"Aha! See, what'd I tell you? Knew they were there, I did. I'll just toss 'em right in, and this'll be a meal fit for an Admi─"},{"name":"ERAPITAROPI","text":"&lt;sniff&gt; Ugggh, this smells like <span class=\"emphasis\">feet</span>! How long's that spice been left in the Graveyard, anyway? &lt;sigh&gt; Now I ain't got no supper, neither."},{"name":"ERAPITAROPI","text":"I told 'em it were a bad idea. Easy money, they said. Sure will be...for the folk on this island. I'll have to pay 'em for more popotoes and cream."}],"reward":{"gil":1703,"xp":11730},"reqs":{"jobs":[{"lvl":42,"id":1}]}},"partials":[{"type":"npc","id":"1006506","obj":{"i":1006506,"n":"Erapi Taropi","l":33,"q":2}}]}