{"quest":{"name":"History Repeating","location":"Western La Noscea","id":66503,"patch":2.0,"sort":221,"icon":100145,"eventIcon":71201,"issuer":1006503,"target":1006497,"involved":[1006507,1007716],"genre":1,"journal":["Davyd is sweating profusely...","Davyd informs you that Mimidoa has come to the Isles of Umbra in search of you. Return to the northern shore and greet the old man.","According to Mimidoa, a siren is behind the recent troubles. Declaring that the two of you must stop the creature, he furnishes you with a pair of brass earplugs and bids you follow him to the Ship Graveyard.","You arrive at the Ship Graveyard to find that the grizzled Lalafell has prepared a large campfire. Convinced that the flames will draw the siren to shore, he instructs you to wait with him by the fire until she appears.","Just as you and Mimidoa are about to drift off to sleep, the siren emerges and begins to sing her beguiling song. Shocked into wakefulness, you plug your ears just in time to prevent the creature from luring you to a watery grave. Finding that her words have fallen on hastily deafened ears, she proceeds to send wave after wave of undead thralls to assail you in vain, before at last relenting and retreating to the depths whence she came. Find out if Mimidoa is still in possession of his wits.","To your great relief, Mimidoa is unharmed and in good spirits. The redoubtable old Lalafell applauds you on your performance, and proclaims that the siren will not risk returning to the Isles of Umbra for some time. Return to Davyd and tell him that the siren is no longer a threat.","Davyd is both shocked and relieved to hear your tale, and he rewards you with the corrupted shard as promised. Return to Aleport and present the shard to Ceana.","Betraying no hint of sympathy, Ceana reveals that the corrupted shard is the manifestation of an over-abundance of the element of fire, and that it will do little if anything to tame the element of wind. It would seem that your adventures in Aleport have been a waste of time."],"objectives":["Speak with Mimidoa.","Follow Mimidoa to the Ship Graveyard.","Wait by the campfire.","Speak with Mimidoa.","Speak with Davyd.","Show the corrupted crystal to Ceana."],"dialogue":[{"name":"DAVYD","text":"...But if they <span class=\"emphasis\">have</span> returned, that would mean─ Oh, beg your pardon, I was just, um...thinking about something."},{"name":"DAVYD","text":"Which reminds me─I received word that Master Mimidoa would be arriving any moment."},{"name":"DAVYD","text":"Apparently, he grew <span class=\"alternative-container\"><span class=\"alternative\">frustrated waiting for the “sweet young lass with skin as soft as phoenix down”</span><span class=\"alternative\">tired of waiting for the “lanky young lad with the thousand-yalm stare”</span></span> to return─which I'm assuming is you."},{"name":"DAVYD","text":"I don't know what sort of arrangement you had, but you should probably go and explain yourself."},{"name":"MIMIDOA","text":"What's been keepin' ye, 'nitiate? I ain't gettin' any younger, ye know..."},{"name":"MIMIDOA","text":"Eh? Some honey-voiced harlot's been callin' out to folk what wander near the Ship Graveyard? An' it's stirred up the dead an' all?"},{"name":"MIMIDOA","text":"Bloody hells... This takes me back to me days as a cannonboy, sailin' under ol' Mistbeard...<br>...But they wouldn't dare, would they? Not after the lesson we learned 'em last time... Bah, they bloody <span class=\"emphasis\">would</span>, though, wouldn't they, brazen ol' biddies..."},{"name":"MIMIDOA","text":"&lt;sigh&gt; Some folk said as the first purge would be the last, but I knew...knew deep down in me bones as this day would come. An' come it has. Aye...I'd bet me bum ear a siren's behind all this."},{"name":"MIMIDOA","text":"Nay, not one o' the Sanguine variety, 'nitiate. I speak o' the <span class=\"emphasis\">other</span> kind─them what's got feathers, an' lure sailors to a watery grave with their sweet, sweet song."},{"name":"MIMIDOA","text":"Ohhh, but it don't end there... No, drownin's just the start. See, even in death, a man stays bound to the beast, forced to do her biddin' till his corpse can't do it no more."},{"name":"MIMIDOA","text":"'Tis a fate I wouldn't wish on me worst enemy─'cept maybe in drink, an' I'd regret it after. Anyroad, 'tis up to <span class=\"emphasis\">us</span> to stop this hells-born hussy afore she takes another soul!"},{"name":"MIMIDOA","text":"'Course, we can't send ye marchin' off to war without these. The siren don't have no power o'er a man as can't hear her song. 'Tis lucky fer you I carry a spare pair─an' lucky fer the <span class=\"emphasis\">both</span> of us I'm a superstitious ol' sod, eh?"},{"name":"MIMIDOA","text":"Well, she ain't comin' to us, so we'd best head o'er to her. To the Ship Graveyard, 'nitiate!"},{"name":"MIMIDOA","text":"If she passes near the shore, she's sure to spy the campfire an' come lookin'... Just a matter o' waitin', now."},{"name":"SYSTEM","text":"? tag ID says system but not showing as of 8/05"},{"name":"MIMIDOA","text":"&lt;yawn&gt; Hmph. I'm beginnin' to wonder if some sly bugger ain't spun us a yarn, here..."},{"name":"MIMIDOA","text":"Quiet! D'ye hear that? 'Tis her!"},{"name":"MIMIDOA","text":"Look! Out o'er the water! She's come, 'nitiate! She's <span class=\"emphasis\">come</span>!"},{"name":"MIMIDOA","text":"Quick, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─shove them plugs in yer ears, an' get ready fer a fight! Soon as she realizes yer deaf to her ditties, she'll call on her thralls, an' we'll be up to our necks in corpses afore ye know it!"},{"name":"MIMIDOA","text":"Eh? Am I all right? Hah! I'm better'n that, 'nitiate! Happy as a sailor in a whorehouse, I am! ...'Course, I'd be happy as a sailor with two wotsits if we'd gutted the songstress─but ye can't have everythin', can ye?"},{"name":"MIMIDOA","text":"She'll not come croonin' 'round here again, though─not fer a while, anyroad. An' if she does...well, we know what to do, don't we?"},{"name":"MIMIDOA","text":"Thanks for the help, uh... Bugger me, I've clean forgot yer name! Remind me. <span class=\"highlight\">Forename</span>? Don't recall havin' no 'nitiate by that name. But if yer not me ol' mate, er...wossname, why've ye been so bloody helpful? Ah, never mind. Be seein' ye, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">lad</span></span>."},{"name":"DAVYD","text":"You mean it <span class=\"emphasis\">was</span> a siren!? But how were you able to resist her song? ...I see. I had heard that Master Mimidoa was involved in the first purge, but I never actually... Hm."},{"name":"DAVYD","text":"Having survived an ordeal like that, I can't blame him for carrying earplugs around with him..."},{"name":"DAVYD","text":"Anyway, I have something for you: the corrupted crystal you wanted, safely sealed within the pot, just as you requested. Please, take it with my compliments."},{"name":"CEANA","text":"Oh, it's you! Welcome back, <span class=\"highlight\">Forename</span>. You're looking remarkably hale, I must say─and, more importantly, alive! You <span class=\"emphasis\">are</span> alive, aren't you?"},{"name":"CEANA","text":"Aha! The conquering hero returns bearing a gift! Might I have a closer look?"},{"name":"CEANA","text":"Impressive...<span class=\"emphasis\">very</span> impressive indeed. Yes...I think you'll be <span class=\"emphasis\">quite</span> pleased with this specimen."},{"name":"CEANA","text":"Congratulations, <span class=\"highlight\">Forename</span>! Seldom if ever have I encountered a corrupted crystal composed of such a <span class=\"emphasis\">volatile</span> overabundance of fire-aspected aether."},{"name":"CEANA","text":"What? You wanted a corrupted crystal composed of <span class=\"emphasis\">ice</span>-aspected aether to counteract the effects of a raging wind? Ah...ahaha. Well, this specimen won't help you there. Anyone who knows <span class=\"emphasis\">anything</span> about the elements could tell you that. You'll just have to keep looking, I suppose!"},{"name":"QIB","text":"Defeat the siren!"},{"name":"QIB","text":"Defeat the siren's thralls!"},{"name":"SEIREN","text":"...hither...embrace...mine everything...all...♪"},{"name":"SEIREN","text":"...true love spurned...<span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> cruelty's reward...♪"},{"name":"SEIREN","text":"Cast out...callous soul...dead to desire...♪"},{"name":"SEIREN","text":"Spare...mournful mistress...distress...♪"},{"name":"SEIREN","text":"...melody...last breath...of death...the rhythm...♪"},{"name":"SEIREN","text":"Dost thou not...to relent...regret...forever alone...♪"},{"name":"SEIREN","text":"My love...a river...one look...soul shiver...♪"},{"name":"SEIREN","text":"No more...dark...eclipse...the heart...♪"}],"reward":{"gil":3098,"xp":23460},"reqs":{"jobs":[{"lvl":42,"id":130}],"quests":[66499]},"next":[66504,69406]},"partials":[{"type":"npc","id":"1006503","obj":{"i":1006503,"n":"Davyd","l":33,"q":4}},{"type":"npc","id":"1006497","obj":{"i":1006497,"n":"Ceana","l":33,"q":6}},{"type":"npc","id":"1006507","obj":{"i":1006507,"n":"Mimidoa","l":33,"q":1}},{"type":"npc","id":"1007716","obj":{"i":1007716,"n":"Mimidoa","l":33,"q":1}},{"type":"quest","id":"66499","obj":{"i":66499,"n":"Sweet Somethings","g":1,"l":"Western La Noscea","s":220}},{"type":"quest","id":"66504","obj":{"i":66504,"n":"The Curious Case of Giggity","g":0,"l":"Western La Noscea","s":222}},{"type":"quest","id":"69406","obj":{"i":69406,"n":"The Curious Case of Giggity","g":1,"l":"Western La Noscea","s":224}}]}