{"quest":{"name":"The Curious Case of Giggity","location":"Western La Noscea","id":66504,"patch":2.0,"sort":222,"eventIcon":71201,"target":1000580,"involved":[1006710],"genre":0,"journal":["Ceana knows where the corrupted crystal that you seek can be found.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ceana in Aleport.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","According to Hedyn, ascertaining the precise location of the crystal at any given moment is difficult, due to the fact that it has been devoured by a notorious spriggan named Giggity. The creature has grown so fearsome that other spriggans, fearing for their safety, have begun to petition the kinder inhabitants of the Twelveswood for aid. One such spriggan recently visited Little Solace, and Hedyn suggests that you journey there and attempt to track down the wayward creature.","Komuxio confirms that a spriggan did indeed come to Little Solace, though he is deeply concerned for the creature's safety. It may be in your best interests to locate the spriggan quickly..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ceana in Aleport.</span>"],"dialogue":[{"name":"CEANA","text":"Don't fret, now─I know exactly where to find a corrupted crystal comprised of <span class=\"emphasis\">ice</span>-aspected aether. An associate of mine in Gridania has been studying the effects of one such crystal on living beings."},{"name":"CEANA","text":"Eh? What's with that expression? I thought you would be pleased to hear this news! This is <span class=\"emphasis\">not</span> another wild-dodo chase, I assure you!"},{"name":"CEANA","text":"And what's even better is that <span class=\"emphasis\">this</span> time, you needn't use that warded pot of yours to protect yourself from this crystal's energies. Hedyn's findings suggest that it is quite safe."},{"name":"CEANA","text":"Why, you ask? Well...let's just say that it has undergone a <span class=\"emphasis\">unique</span> process that has rendered such precautions unnecessary."},{"name":"CEANA","text":"Anyway, do not let me keep you. It has been a pleasure, <span class=\"highlight\">Forename</span>. Come back and see me sometime, all right?"},{"name":"HEDYN","text":"Greetings and salutations. <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Surname</span>, I presume? Ceana informed me of your adventures in Aleport. Terribly sorry about the misunderstanding. Though, as Professor Lamberteint is fond of saying, “No action taken in the name of science is ever truly wasteful.”"},{"name":"HEDYN","text":"To the matter at hand─corrupted crystals possessing the properties you seek could be found in abundance at the Standing Corses following the Calamity."},{"name":"HEDYN","text":"Alas, that is no longer the case...and while there is at least one suitable crystal that remains to be found within the Twelveswood, precisely where it is at any given moment is more difficult to say."},{"name":"HEDYN","text":"Permit me to explain. You are familiar with spriggans, yes? The furry little rascals that are wont to seek out ores and other stones? Well, one such creature with an infamously insatiable appetite has single-handedly devoured every corrupted crystal in the Twelveswood. Fortunately for you, these crystals take an eternity to digest─assuming they can even <span class=\"emphasis\">be</span> digested─and I am reasonably confident that one still resides within his gut."},{"name":"HEDYN","text":"It's quite fascinating, really. My theory is that this “Giggity” first consumed a corrupted crystal when... &lt;sigh&gt; You couldn't care less about all this, could you?"},{"name":"HEDYN","text":"To the point, then. Giggity has grown so ravenous that even his fellow spriggans now fear for their safety. Some have gone so far as to petition the other inhabitants of the Twelveswood for succor."},{"name":"HEDYN","text":"In fact, the other day, I heard that a spriggan had been spotted in the vicinity of Little Solace. I propose that you find this wayward creature and use him to track down and slay Giggity. I can think of no better method to locate the rampaging beast, can you?"},{"name":"KOMUXIO","text":"This one is pleased to see walking one! Has time come for this one to wreak furious vengeance upon imperial ones!?"},{"name":"KOMUXIO","text":"Oh, so walking one seeks furry ones? This one just saw furry one wandering about. Was very worried for furry one─worried for furry one's safety!"}],"reward":{"xp":23920},"reqs":{"jobs":[{"lvl":43,"id":130}],"quests":[66503]},"next":[66507]},"partials":[{"type":"npc","id":"1000580","obj":{"i":1000580,"n":"Komuxio","l":55,"q":10}},{"type":"npc","id":"1006710","obj":{"i":1006710,"n":"Hedyn","l":53,"q":5}},{"type":"quest","id":"66503","obj":{"i":66503,"n":"History Repeating","g":1,"l":"Western La Noscea","s":221}},{"type":"quest","id":"66507","obj":{"i":66507,"n":"Of Sylphs and Spriggans","g":0,"l":"East Shroud","s":223}}]}