{"quest":{"name":"Of Sylphs and Spriggans","location":"East Shroud","id":66507,"patch":2.0,"sort":223,"eventIcon":71201,"target":1006716,"involved":[1006714,1007573],"genre":0,"journal":["Komuxio fears that the wayward spriggan may be in danger.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ceana in Aleport.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You come upon the spriggan desperately trying to escape the wrath of a tempered sylph. In typical heroic fashion, you rescue the creature, who promises to return to the safety of Little Solace. Return to the settlement and speak with Komuxio to ensure that the spriggan kept his word.","Tiggy, the wayward spriggan, had petitioned the sylphs of Little Solace to put an end to Giggity's reign of terror. However, Komuxio observes that the notorious spriggan is clever and cautious, and will likely not reveal itself unless it is tempted by an especially rare ore. While Komuxio knows little and less of ore, he remarks that a goldsmith helping to restore the Sanctum of the Twelve surely does. Journey to the Sanctum and speak with Maerwynn.","Giggity's deeds are known even to Maerwynn the goldsmith. After a moment's thought, she states that she may have a way to lure out the rampaging spriggan, though she warns you that the idea is both unorthodox and convoluted."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Ceana in Aleport.</span>"],"dialogue":[{"name":"KOMUXIO","text":"Furry one came to Little Solace in search of helpful ones. Asked these ones for aid and succor."},{"name":"KOMUXIO","text":"But these ones could not do what furry one asked, so furry one went elsewhere─went north into Larkscall."},{"name":"KOMUXIO","text":"This one tried to warn furry one, but furry one would not listen! Many vile ones lurk to the north, and touched ones too!"},{"name":"TIGGY","text":"Tiggy greet sylph! Sylph bad sylph! Friend save Tiggy! Frieeeeeend!<br>Tiggy go back! Back to good sylph!"},{"name":"KOMUXIO","text":"Walking one is ever most helpful one! Furry one Tiggy spoke highly of walking one's bravery. But this one wonders why walking one first sought to find furry ones."},{"name":"KOMUXIO","text":"Walking one seeks furry one Giggity!? Even these ones have heard tell of hungry one!"},{"name":"KOMUXIO","text":"Furry one Tiggy asked these ones to hunt hungry one. But these ones have not means to do so."},{"name":"KOMUXIO","text":"Furry ones crave ores, yes? But hungry one is clever─clever and cautious."},{"name":"KOMUXIO","text":"If walking one wishes to catch hungry one, walking one must use very rare, very special ore."},{"name":"KOMUXIO","text":"This one knows little and less of ore, but walking one Maerwynn at Sanctum of Twelve knows much. Walking one should seek aid of goldsmithing one."},{"name":"TIGGY","text":"Giggity hungry! Always hungry! Huuuuuungry!<br>Tiggy run far! Far away! Awaaaaaay!"},{"name":"MAERWYNN","text":"Yes? What is it? Ah, so you wish to lure out that rampaging spriggan with a rare ore."},{"name":"MAERWYNN","text":"Hmmm... I have an idea, although it is a bit unorthodox and convoluted..."},{"name":"POP","text":"The spriggan cries out for aid!"},{"name":"ACCESS","text":"The spriggan refuses to budge."}],"reward":{"xp":23920},"reqs":{"jobs":[{"lvl":43,"id":130}],"quests":[66504]},"next":[66510]},"partials":[{"type":"npc","id":"1006716","obj":{"i":1006716,"n":"Maerwynn","l":55,"q":1}},{"type":"npc","id":"1006714","obj":{"i":1006714,"n":"Tiggy","l":55,"q":1}},{"type":"npc","id":"1007573","obj":{"i":1007573,"n":"Tiggy","l":55,"q":1}},{"type":"quest","id":"66504","obj":{"i":66504,"n":"The Curious Case of Giggity","g":0,"l":"Western La Noscea","s":222}},{"type":"quest","id":"66510","obj":{"i":66510,"n":"Crazy Enough to Work","g":0,"l":"East Shroud","s":224}}]}