{"quest":{"name":"Footprints in the Snow","location":"Coerthas Central Highlands","id":66517,"patch":2.0,"sort":230,"icon":100148,"eventIcon":71201,"issuer":1006518,"target":1006521,"involved":[1006519],"genre":1,"journal":["Ser Pierremons wants to share with you what he knows of the two fugitives.","At the entrance to the Aurum Vale, Ser Pierremons confirms that two prisoners escaped from the airship when it made its forced landing. Evidence strongly suggests that the pair came in this direction. Search the area for footprints.","You have found a set of footprints. Search the area for another.","You have found another set of footprints. Search the area for more.","You have found a third set of footprints. They seem to be taking you northerly. Continue your search.","You have discovered a fourth set of footprints. Search the area for another.","Straining your ears, you hear the sound of teeth clattering interspersed with the occasional whimper. The noises seem to be emanating from the nearby bridge. Perhaps you should go and investigate.","Much to your relief, you find Wedge cowering under the bridge, frightened, cold, and hungry, but otherwise unharmed. Make your way to Monument Tower and await Cid's arrival.","Arriving at Monument Tower, you and Wedge receive a heartfelt welcome from Abelie. While the lure of warmth and rest is great, you are loath to sit idle while Biggs is still alone out there."],"objectives":["Search the area for footprints.","Search under the bridge.","Make your way to Monument Tower."],"dialogue":[{"name":"PIERREMONS","text":"There were prisoners aboard the airship, it seems, and they seized the opportunity to flee when the vessel was forced to land."},{"name":"PIERREMONS","text":"The Garleans who were deployed formed search parties and proceeded to scour the wilderness. In order to alert our forces, I returned to my post..."},{"name":"PIERREMONS","text":"...To find evidence that someone had been here in my absence. Whoever they were, they tried the door to no avail, and decided to go elsewhere."},{"name":"PIERREMONS","text":"In all, I marked two sets of footprints─one large and one small. If you search the area, mayhap you will be able to follow the prints to their owners."},{"name":"DUMMY","text":"//: /lookout for footprints."},{"name":"DUMMY","text":"//: /lookout for footprints."},{"name":"DUMMY","text":"//: /lookout for footprints."},{"name":"DUMMY","text":"//: /lookout for footprints."},{"name":"DUMMY","text":"//: /lookout for footprints."},{"name":"WEDGE","text":"Brrr... So...c-c-cold... I w-w-want to go home..."},{"name":"WEDGE","text":"Uwaaaaaah! P-Please don't eat me! I'm not nearly as succulent as I look! It's all skin and bones underneath, I swear!"},{"name":"WEDGE","text":"&lt;gasp&gt; <span class=\"highlight\">Forename</span>, it's you! Thank goodness you're here! It's been...it's been <span class=\"emphasis\">awful</span>!"},{"name":"WEDGE","text":"The Garleans were snapping at our heels like a hungry pack of wolves! I was so hells-bent on evading them, I almost ran headlong into a monster's gaping maw...<span class=\"emphasis\">thrice</span>! And when I finally found cover, it hit me how cold and hungry I was!"},{"name":"WEDGE","text":"B-Biggs? He...he isn't here. He went off in a different direction to lure our pursuers away."},{"name":"CID","text":"It's me, Cid. Have you had any success?"},{"name":"CID","text":"...Tracked down Wedge!? That's wonderful news! Now, what of Biggs?"},{"name":"CID","text":"...I see. Well, it hardly surprises me that the big fellow went off as he did. For all the tongue-lashings he gives Wedge, he's always taken care of him."},{"name":"CID","text":"I've scoured the area surrounding the Darkhold, but have nothing to show for it. At any rate, we know for a fact that Biggs headed west. With both Yda and Y'shtola helping out, I'm sure he'll turn up soon."},{"name":"CID","text":"Now then, I'll make my way over to your position while keeping an eye out for Biggs."},{"name":"CID","text":"If memory serves, there should be an Ishgardian fortification not far to your west─Monument Tower, I believe it's called. Let us meet there."},{"name":"WEDGE","text":"Dare I hope...? Was that...Master Garlond you spoke with!?"},{"name":"WEDGE","text":"&lt;sniff&gt; After five long years... &lt;sob&gt; Thank goodness he's alive..."},{"name":"WEDGE","text":"I'm feeling better now, <span class=\"highlight\">Forename</span>! Let's go to Monument Tower and wait for the chief to arrive!"},{"name":"ABELIE","text":"Well met and welcome, adventurer. What brings you to this frozen corner of the realm?"},{"name":"ABELIE","text":"Oh? It would seem your companion has caught a chill. Come and warm yourself by the fire. I will bring you a hot broth."},{"name":"ABELIE","text":"How are we feeling now, then? Stay here as long as you need."},{"name":"ABELIE","text":"The same goes for you, friend. 'Tis plain you have a hard journey ahead of you. You must find rest when you can."}],"reward":{"gil":1756,"xp":24380},"reqs":{"jobs":[{"lvl":44,"id":130}],"quests":[66516]},"next":[66518]},"partials":[{"type":"npc","id":"1006518","obj":{"i":1006518,"n":"Pierremons","l":63,"q":3}},{"type":"npc","id":"1006521","obj":{"i":1006521,"n":"Abelie","l":63,"q":2}},{"type":"npc","id":"1006519","obj":{"i":1006519,"n":"Wedge","l":63,"q":1}},{"type":"quest","id":"66516","obj":{"i":66516,"n":"Eyes on the Empire","g":1,"l":"Coerthas Central Highlands","s":229}},{"type":"quest","id":"66518","obj":{"i":66518,"n":"Monumental Hopes","g":1,"l":"Coerthas Central Highlands","s":231}}]}