{"quest":{"name":"Casing the Castrum","location":"The Waking Sands","id":66514,"patch":2.0,"sort":228,"icon":100147,"eventIcon":71201,"issuer":1007473,"target":1006380,"genre":1,"journal":["Y'shtola wishes to discuss the fate of the prisoners being held at Castrum Centri.","Y'shtola states that before a rescue plan can be devised, the Scions must first gather intelligence on the stronghold of Castrum Centri. With this in mind, she suggests traveling to the Observatorium in Coerthas, and there petitioning Lord Portelaine for aid.","Lord Portelaine confirms that four prisoners matching the descriptions of Minfilia, Urianger, Papalymo, and Tataru were observed being led into Castrum Centri. Furthermore, he informs you that two men─likely Biggs and Wedge─escaped from a downed imperial airship not long ago. After a brief discussion, Y'shtola decrees that the Scions will immediately begin searching for the missing engineers, conscious that the Garleans are not like to spare their lives a second time."],"objectives":["Speak with Portelaine at the Observatorium."],"dialogue":[{"name":"YSHTOLA","text":"The rescue of our allies will be no small undertaking, <span class=\"highlight\">Forename</span>."},{"name":"YSHTOLA","text":"Even under normal circumstances, breaching the defenses of an imperial castrum would be a highly dangerous proposition."},{"name":"YSHTOLA","text":"But now that Castrum Centri houses prisoners whom the Garleans deem valuable, we may be confident that they have taken additional measures to ensure the stronghold's security."},{"name":"YSHTOLA","text":"If we are to free our friends, we will require an effective strategy. And if we are to formulate an effective strategy, we will require intelligence."},{"name":"YSHTOLA","text":"I believe I know a man who may be able to assist us in this: Lord Portelaine of House Durendaire. He is stationed at the Observatorium in Coerthas. Let us go to him, and beseech his aid."},{"name":"PORTELAINE","text":"Ah, <span class=\"highlight\">Forename</span>─the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who unmasked the heretic in our midst! To what do I owe the pleasure of your company?"},{"name":"PORTELAINE","text":"You are an associate of Y'shtola? But of course. Lord Drillemont confided to me that you were a Scion of the Seventh Dawn..."},{"name":"PORTELAINE","text":"Castrum Centri? What interest have you all in the imperials?"},{"name":"YSHTOLA","text":"They hold several of our number─whom we intend to free. Any information you can provide would be greatly appreciated."},{"name":"PORTELAINE","text":"I see. That might explain our scouts' reports..."},{"name":"PORTELAINE","text":"They observed four prisoners being led into the castrum: a Hyuran woman, an Elezen man, and two Lalafells─one male, one female."},{"name":"YDA","text":"It's them! It has to be! Minfilia, Urianger, Papalymo, and Tataru!"},{"name":"PORTELAINE","text":"If that scant morsel is of use to you, you may also be interested to hear about a more recent incident."},{"name":"YSHTOLA","text":"Incident?"},{"name":"PORTELAINE","text":"An imperial airship made an emergency landing here in Coerthas not long ago. Two men believed to be prisoners─a Roegadyn and a Lalafell─were seen fleeing the craft."},{"name":"CID","text":"What did you say?"},{"name":"PORTELAINE","text":"A Roegadyn and a Lalafell, Master Garlond. Neither wore imperial dress, and both seemed disinclined to wait for rescue, hence our assumption that they were prisoners."},{"name":"CID","text":"Well, I'll be damned...it's Biggs and Wedge! Trust those two rascals to escape..."},{"name":"CID","text":"We must find them, <span class=\"highlight\">Forename</span>, and <span class=\"emphasis\">soon</span>!"},{"name":"CID","text":"The imperials will not rest until they are captured or killed, and if Biggs were given the choice, I fear he'd take the latter."},{"name":"PORTELAINE","text":"Freeing those held in Castrum Centri will require substantial planning and preparation. As such, it is an endeavor that will admit some slight delay."},{"name":"PORTELAINE","text":"The matter of the escapees, by contrast, will not. Shortly after the prisoners vacated the airship, our scouts observed imperial troops setting off in pursuit. It is likely only a matter of time before they catch them."},{"name":"PORTELAINE","text":"If you wish to see your comrades again, you had best act now."},{"name":"YSHTOLA","text":"If, as has been suggested, the Garleans took our fellow Scions prisoner in hopes of understanding the Echo, it seems reasonable to assume that they will not be executed until such time as the study is complete."},{"name":"YSHTOLA","text":"But Biggs and Wedge are <span class=\"emphasis\">not</span> Scions, nor do they know aught of the Echo. As Lord Portelaine said, this may prove our only chance to rescue them. I say we seize it."},{"name":"CID","text":"Thank you, everyone! You won't regret this."},{"name":"NERO","text":"Final preparations are almost complete, my lord."},{"name":"NERO","text":"There stands the culmination of five long years of painstaking work. But all our efforts will be vindicated when the Emperor's vision becomes reality."},{"name":"GAIUS","text":"At last, we have the power to purge this land of its false gods."},{"name":"GAIUS","text":"We shall give the ignorant children of Eorzea the security and stability they so desperately crave─and which their spineless leaders have so palpably failed to provide."},{"name":"NERO","text":"As you say, my lord. Rest assured, our engineers will not rest until the weapon is fully armed and operational."},{"name":"GAIUS","text":"Rhitahtyn. You depart for Castrum Occidens at midnight."},{"name":"GAIUS","text":"You will command the western front in Vylbrand."},{"name":"GAIUS","text":"The Eorzeans will attempt to interfere with our plans. You will see that they do not."},{"name":"RHITAHTYN","text":"My lord, if this be your will, I shall carry it out to the best of my ability. I live only to serve the Empire."},{"name":"RHITAHTYN","text":"Yet...forgive my impudence, but is it proper to give command of half our forces to a─"},{"name":"GAIUS","text":"I have given you nothing, Praefectus. You have earned it.<br>That will be all. Dismissed."},{"name":"RHITAHTYN","text":"Yes, my lord!"},{"name":"GAIUS","text":"...My quarters, one hour."}],"reward":{"gil":1646,"items":[{"id":3649,"one":1},{"id":27645,"one":1},{"id":5826,"one":1}],"xp":24380},"reqs":{"jobs":[{"lvl":44,"id":130}],"quests":[66056]},"next":[66516]},"partials":[{"type":"npc","id":"1007473","obj":{"i":1007473,"n":"Y'shtola","l":356,"q":1}},{"type":"npc","id":"1006380","obj":{"i":1006380,"n":"Portelaine","l":63,"q":5}},{"type":"item","id":"3649","obj":{"i":3649,"n":"High Mythril Gauntlets","l":44,"c":48389,"t":37,"p":6221}},{"type":"item","id":"27645","obj":{"i":27645,"n":"Altered Woolen Bracers","l":43,"c":44054,"t":37}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"66056","obj":{"i":66056,"n":"Reclamation","g":1,"l":"Ul'dah","s":227}},{"type":"quest","id":"66516","obj":{"i":66516,"n":"Eyes on the Empire","g":1,"l":"Coerthas Central Highlands","s":229}}]}