{"quest":{"name":"Notorious Biggs","location":"Coerthas Central Highlands","id":66519,"patch":2.0,"sort":232,"icon":100149,"eventIcon":71201,"issuer":1006520,"target":1006520,"involved":[1006522,1006524,1006525],"genre":1,"journal":["Wedge is determined to find Biggs.","Wedge has again implored you to search for Biggs. Though Abelie's suggestion yielded nothing, it is possible that one of the other Ishgardians stationed at Monument Tower might be able to point you in a more fruitful direction.","Ignace suggests that Biggs may have attempted to reach Whitebrim Front. If true, he would have needed to make his way through Daniffen Pass, whose southern entrance is found to the northeast of Monument Tower.","With the aid of Yda and Y'shtola, you succeed in rescuing Biggs from a detachment of imperial troops. Make your way back to Monument Tower and speak with Wedge.","With Biggs's safe return, the three core members of Garlond Ironworks are together again, and the future seems brighter for their reunion. Now it is time to turn your thoughts to the next challenge: rescuing Minfilia and the remaining Scions."],"objectives":["Speak with Ignace.","Head to Daniffen Pass.","Report to Wedge."],"dialogue":[{"name":"WEDGE","text":"We can't give up, <span class=\"highlight\">Forename</span>! We must find Biggs before he succumbs to the cold or is recaptured!"},{"name":"WEDGE","text":"There must be <span class=\"emphasis\">someone</span> in this tower who can help us, even if it's only to tell us where else to look!"},{"name":"WEDGE","text":"Ask them for me! Ask anyone who'll listen! And <span class=\"emphasis\">hurry</span>! Biggs's chances of survival grow slimmer by the moment!"},{"name":"IGNACE","text":"Your friend is lost in the wilderness, you say?"},{"name":"IGNACE","text":"If he's not to be found around here or in the vicinity of the Darkhold, it is possible he made for Whitebrim."},{"name":"IGNACE","text":"To reach it, one must travel through Daniffen Pass, the southern end of which lies to the north and east of here."},{"name":"IGNACE","text":"While I make no guarantee that your search will bear fruit, it is surely better than worrying in idleness. I wish you luck."},{"name":"IGNACE","text":"...Oh, and one more thing. Do tread warily when climbing the stairs here. Not a moon ago, I near broke my neck when I slipped and took a tumble."},{"name":"YDA","text":"<span class=\"highlight\">Forename</span>! We've found Biggs, but he's in trouble!"},{"name":"IMPERIALSOLDIER","text":"Our orders are to take you back, <span class=\"emphasis\">dead or alive</span>! Which will it be, Engineer?"},{"name":"BIGGS","text":"Why don't you come and find out, tin-head!?"},{"name":"YSHTOLA","text":"Ah, <span class=\"highlight\">Forename</span>, it is well that you are here. The situation is grave."},{"name":"YDA","text":"Biggs is in a bad way! We need to do something, right <span class=\"emphasis\">now</span>!"},{"name":"YSHTOLA","text":"Yda has the right of it. He will perish if we delay."},{"name":"YSHTOLA","text":"With me!"},{"name":"IMPERIALSOLDIER","text":"He's not alone! Kill them all!"},{"name":"DUMMY","text":"(QIB)"},{"name":"BIGGS","text":"&lt;pant&gt; M-My thanks... &lt;pant&gt; Another m-moment, and...I-I would have... &lt;grunt&gt;"},{"name":"YSHTOLA","text":"He has been too long in the cold. We must find shelter for him."},{"name":"YSHTOLA","text":"...Monument Tower, you say? Very well, Yda and I shall bear him there with all haste."},{"name":"YDA","text":"Cid will be <span class=\"emphasis\">so</span> happy to see Biggs and Wedge again! Awww, I love reunions!"},{"name":"WEDGE","text":"I cannot thank you enough, <span class=\"highlight\">Forename</span>─and the same goes for the rest of you! Thank you all so much!"},{"name":"YDA","text":"Oh, don't mention it!"},{"name":"YSHTOLA","text":"We are a family, are we not?"},{"name":"WEDGE","text":"Well...well, yes. It's just─ &lt;sniff&gt; It's just, I didn't think─ &lt;sniff&gt; I didn't think I'd ever see him again. &lt;sob&gt;"},{"name":"BIGGS","text":"I owe the lot of you my life."},{"name":"BIGGS","text":"And you saved Wedge's too, <span class=\"highlight\">Forename</span>. I'm losing count of how many I owe you."},{"name":"CID","text":"Biggs! Wedge! Gods, it's good to see the two of you again!"},{"name":"WEDGE","text":"Chief! It's you! It's really you!"},{"name":"BIGGS","text":"In our hearts, we knew you were still alive... But to finally see you in the flesh... &lt;sniff&gt;"},{"name":"CID","text":"When Alphinaud told me of the raid on the Waking Sands, I feared the worst. What happened?"},{"name":"BIGGS","text":"The enemy struck with nary a warning. We didn't stand a chance."},{"name":"BIGGS","text":"Wedge and I were in the workshop when they came. Before we knew what was happening, the imperials had us at gunpoint."},{"name":"YDA","text":"It must have been awful... There's one thing I don't understand, though: how did the Garleans get there so fast? I mean, the Immortal Flames should have seen them coming, right?"},{"name":"YSHTOLA","text":"I myself have asked the same question. That day, when I returned to the carnage at the Waking Sands, I noted naught amiss in Horizon─nothing at all to suggest the passing of an imperial force. From this, I conclude that the Garleans came neither by land nor by air. Nay, they were borne there by potent teleportation magicks─magicks of the kind used by the Ascians."},{"name":"CID","text":"Carry on."},{"name":"WEDGE","text":"We were bound and blindfolded, and bundled into the cargo bay of a waiting airship."},{"name":"WEDGE","text":"I can't rightly say how long we were aboard, but when the time came for us to disembark, we found ourselves in the midst of an imperial stronghold─Castrum Centri."},{"name":"WEDGE","text":"Upon arrival, we were marched off into the main complex. Biggs and I were thrown into a detainment cell together, while Minfilia and the others were taken elsewhere. That was the last we heard from them."},{"name":"CID","text":"Castrum Centri..."},{"name":"CID","text":"What happened next?"},{"name":"WEDGE","text":"Well, we were held in isolation for what felt like years, but was probably moons...or maybe only weeks. And then, without warning, the imperials collected the pair of us, and put us on another vessel, which we found out was bound for Garlemald, much to our dread. We knew that if we were taken back there, we weren't like to leave again."},{"name":"WEDGE","text":"So, risky though it was, we sabotaged the ship's altitude control and thereby forced an emergency landing. And in the midst of the ensuing chaos, we managed to slip our captors. The rest, as they say, is history."},{"name":"CID","text":"Hah! If I didn't know better, I'd call that a likely story! Sabotaging the altitude controls of an airborne vessel!? That will have been Biggs's handiwork, like as not. You always were resourceful in a tight spot, my friend!"},{"name":"CID","text":"<span class=\"highlight\">Forename</span>─thank you for returning my dear assistants to me. It would seem I owe you yet another debt of gratitude."},{"name":"CID","text":"There are still many questions in my mind, but the answers can wait─Minfilia and the others still want for rescue."},{"name":"CID","text":"All right, you lot─Garlond Ironworks is back in business! Let's go and give the imperials what for!"},{"name":"BIGGSWEDGE","text":"(-Biggs and Wedge-)Hurrah!"},{"name":"QIB","text":"Protect Biggs and defeat the imperial troops!"},{"name":"BIGGS","text":"H-How did you know where to find me?"},{"name":"IMPERIALLEADER","text":"Hold your ground! Reinforcements are coming!"},{"name":"YDA","text":"The more the merrier! I'll pound you all into the next Umbral Era!"},{"name":"YSHTOLA","text":"Yda! Less provoking and more pummeling, if you would be so kind!"},{"name":"IMPERIALLEADER","text":"Vanguards, destroy them!"},{"name":"YSHTOLA","text":"<span class=\"highlight\">Forename</span>! Stay close to Biggs!"},{"name":"YDA","text":"Ack! How many of them are there!?"},{"name":"YSHTOLA","text":"...More than are conducive to merriment.<br>Next time, Yda, have a care what you wish for."},{"name":"BIGGS","text":"This is the last of them!"},{"name":"YSHTOLA","text":"I cannot...go on..."},{"name":"YDA","text":"I need to rest...just for a little...while..."},{"name":"BIGGS","text":"Ungh... Not here...not now..."}],"reward":{"gil":3208,"xp":24380},"reqs":{"jobs":[{"lvl":44,"id":130}],"quests":[66518]},"next":[66520,66521]},"partials":[{"type":"npc","id":"1006520","obj":{"i":1006520,"n":"Wedge","l":63,"q":2}},{"type":"npc","id":"1006522","obj":{"i":1006522,"n":"Ignace","l":63,"q":1}},{"type":"npc","id":"1006524","obj":{"i":1006524,"n":"Yda","l":63,"q":1}},{"type":"npc","id":"1006525","obj":{"i":1006525,"n":"Y'shtola","l":63,"q":1}},{"type":"quest","id":"66518","obj":{"i":66518,"n":"Monumental Hopes","g":1,"l":"Coerthas Central Highlands","s":231}},{"type":"quest","id":"66520","obj":{"i":66520,"n":"Come-Into-My-Castrum","g":1,"l":"Coerthas Central Highlands","s":233}},{"type":"quest","id":"66521","obj":{"i":66521,"n":"Doubt Truth to Be a Liar","g":94,"l":"Coerthas Central Highlands","s":440}}]}