{"quest":{"name":"Getting Even with Garlemald","location":"Mor Dhona","id":66522,"patch":2.0,"sort":234,"icon":100151,"eventIcon":71201,"issuer":1006531,"target":1006535,"involved":[1006534],"genre":1,"journal":["Glaumunt would like to aid in your mission to rescue the captured Scions.","Prior to launching your rescue mission, Glaumunt recommends that you first ascertain your comrades' presence at Castrum Centri. He tells you of a drainage pipe that leads from the stronghold's command tower and down into the southwestern corner of the adjoining swampland called the Tangle. Find the pipe and investigate.","You have put down all the chigoes that issued forth from the drainage pipe. Take their place within and listen to what sounds may be heard.","You have heard enough to confirm that your comrades are indeed being held at Castrum Centri. Bear word back to Revenant's Toll, where the Scions await.","You return to Revenant's Toll and report all you have learned to Alphinaud. Glad for your tidings, he bids you speak with Cid for the details of the rescue mission.","Ever enthused, Glaumunt is currently looking into the procurement of a suit of magitek armor. In the meantime, Cid requires your assistance for some preparation of his own."],"objectives":["Investigate the drainage pipe.","Eavesdrop at the drainage pipe.","Speak with Alphinaud.","Speak with Cid."],"dialogue":[{"name":"GLAUMUNT","text":"...So you have friends at Castrum Centri what want for rescue. That Slafborn knows me too well─aye, you can count on my help."},{"name":"GLAUMUNT","text":"I've got a score to settle with the imperials, an' I <span class=\"emphasis\">never</span> pass on an opportunity to get back at the whoresons. But enough about me, let's talk strategy."},{"name":"GLAUMUNT","text":"Rescuin' folk from captivity's right delicate business. A single oversight─just one little blunder─an' it's all over. You can't leave any room for uncertainty."},{"name":"GLAUMUNT","text":"For starters, you need to confirm beyond the shadow of a doubt that your friends're where you think they are. You don't want to risk your neck only to discover they've been moved elsewhere. But how can you find out, you ask? By followin' these instructions:"},{"name":"GLAUMUNT","text":"If you approach Centri from the east, you'll see a swampland to your left called the Tangle. Get in there, never mind all the morbols, an' navigate your way to the southwestern corner."},{"name":"GLAUMUNT","text":"You'll come upon some drainage pipes comin' down from the stronghold. Don't ask me how I know, but one o' them leads back up to the command tower. If you listen closely, might be as you can eavesdrop on some o' the happenin's within."},{"name":"GLAUMUNT","text":"Once we know for certain your friends're there, we'll move to the next stage o' the operation. Now, get goin', and godsspeed!"},{"name":"DUMMY","text":"(Examine drainage pip. Four chigres pop.)"},{"name":"SYSTEM","text":"The faint sound of conversation echoes down the pipe."},{"name":"IMPERIALSOLDIER","text":"(-Collected Voice-)What of the captive? Does she still refuse to speak?"},{"name":"IMPERIALSOLDIER","text":"(-Youthful Voice-)She may as well be a deaf-mute for all the information we've gotten out of her."},{"name":"IMPERIALSOLDIER","text":"(-Gruff Voice-)The others aren't much better. The Elezen gets on my nerves most of all. Every time he opens his mouth, it's only to spout gibberish."},{"name":"IMPERIALSOLDIER","text":"(-Youthful Voice-)I do wonder, why <span class=\"emphasis\">is</span> the tribunus so obsessed with this Minfilia woman?"},{"name":"IMPERIALSOLDIER","text":"(-Gruff Voice-)They say she possesses some mystical power. Something we Garleans don't have."},{"name":"IMPERIALSOLDIER","text":"(-Youthful Voice-)Mystical power? Like the kind the beastmen use?"},{"name":"IMPERIALSOLDIER","text":"(-Gruff Voice-)How am I supposed to bloody know? If you're so curious, why don't you ask the tribunus yourself?"},{"name":"IMPERIALSOLDIER","text":"(-Youthful Voice-)As well try to tumble her! I like my head where it is, thank you very much!"},{"name":"IMPERIALSOLDIER","text":"(-Collected Voice-)Our break is over. Best we get back to our stations."},{"name":"SYSTEM","text":"The footfalls grow fainter until all is silent."},{"name":"ALPHINAUD","text":"'Tis good to see you again, <span class=\"highlight\">Forename</span>. I'm given to understand you have conducted some reconnaissance. Tell me, what were you able to learn?"},{"name":"ALPHINAUD","text":"...So Minfilia and the others are indeed at Castrum Centri! Their presence thus confirmed, we may proceed with the mission. While you were afield, Cid took the liberty of devising a plan of action. Pray have the details from him."},{"name":"CID","text":"Good work, <span class=\"highlight\">Forename</span>. As Alphinaud has already told you, we've plotted out a course for the rescue."},{"name":"CID","text":"The gist of it is unchanged: we disguise ourselves as imperial soldiers and infiltrate the stronghold."},{"name":"CID","text":"Glaumunt is looking into ways to procure a suit of magitek armor. In the meantime, I need your assistance for some preparation of my own."},{"name":"CID","text":"Minfilia and the others are counting on us, <span class=\"highlight\">Forename</span>. Let's not keep them waiting any longer than necessary!"},{"name":"POP","text":"A maddening buzzing fills your ears!"}],"reward":{"gil":2090,"xp":24380},"reqs":{"jobs":[{"lvl":44,"id":130}],"quests":[66520]},"next":[66537,66538]},"partials":[{"type":"npc","id":"1006531","obj":{"i":1006531,"n":"Glaumunt","l":67,"q":5}},{"type":"npc","id":"1006535","obj":{"i":1006535,"n":"Cid","l":67,"q":2}},{"type":"npc","id":"1006534","obj":{"i":1006534,"n":"Alphinaud","l":67,"q":1}},{"type":"quest","id":"66520","obj":{"i":66520,"n":"Come-Into-My-Castrum","g":1,"l":"Coerthas Central Highlands","s":233}},{"type":"quest","id":"66537","obj":{"i":66537,"n":"Drowning Out the Voices","g":1,"l":"Mor Dhona","s":235}},{"type":"quest","id":"66538","obj":{"i":66538,"n":"Acting the Part","g":1,"l":"Mor Dhona","s":236}}]}