{"quest":{"name":"The Sons Also Rise","location":"Mor Dhona","id":66526,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006677,"target":1006545,"genre":95,"journal":["According to Kakamehi, there is work and ready coin to be had from the Sons of Saint Coinach, if you would but present yourself there.","The Sons of Saint Coinach, the learned men and women who would penetrate the secrets of the ancient Allagan Empire, have set up camp to the southeast of Revenant's Toll. With fellow adventurer Kakamehi's hearty recommendation buoying your reputation, go speak with one Nazyl Duzyl.","Nazyl Duzyl greets you with open arms and, you suspect, purse strings. There is much to be done, it seems, and your long experience tells you that your oilstone may be getting extra use..."],"objectives":["Speak with Nazyl Duzyl."],"dialogue":[{"name":"KAKAMEHI","text":"<span class=\"highlight\">Forename</span>, right? I hear you get around! I'm an adventurer myself. The name's Kakamehi.<br>...Hey, we can't all have an interesting name like yours. Look, I can cut you in on something fair, if you're interested."},{"name":"KAKAMEHI","text":"There's a camp set up east of here by an outfit called the Sons of Saint Coinach. Scholarly types, you know, studying the─what do you call it─Allagan Empire. It's apparently some sort of ancient civilization!"},{"name":"KAKAMEHI","text":"Talk to a fellow called Nazyl Duzyl there and he'll have something for you. Good folks, them. Tell 'em I sent you."},{"name":"NAZYLDUZYL","text":"Well met, adventurer! Any comrade of Kakamehi is certain to be of great help to us. You <span class=\"emphasis\">are</span> interested in helping, I trust?"},{"name":"NAZYLDUZYL","text":"We Sons of Saint Coinach have had our share of troubles of late, and your assistance would be most welcome. I think <span class=\"emphasis\">you</span> will find it an equally rewarding enterprise."}],"reward":{"gil":1668,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}]}},"partials":[{"type":"npc","id":"1006677","obj":{"i":1006677,"n":"Kakamehi","l":67,"q":2}},{"type":"npc","id":"1006545","obj":{"i":1006545,"n":"Nazyl Duzyl","l":67,"q":3}}]}