{"quest":{"name":"Doubt Truth to Be a Liar","location":"Coerthas Central Highlands","id":66521,"patch":2.0,"sort":440,"eventIcon":71221,"issuer":1006538,"target":1006518,"involved":[1006528,1006540],"genre":94,"journal":["In times of simmering hostility, Ser Cailean would undoubtedly appreciate the aid of an unsuspected adventurer.","The Garlean Empire is making a long arm across the border from Mor Dhona, stirring the grass around Monument Tower. Seek traces of Garlemald in three locations, and drive away any Garleans you encounter.","Your vigilance has driven out all the Garleans in the area without a confrontation between the forces of Ishgard and Garlemald. Report to Ser Pierremons that the work is done.","Ser Pierremons is aghast at how thick the Garleans are upon the ground. All evidence points to a Garlean outpost in Mor Dhona, a place in which even an adventurer may find it no easy task to escape deadly scrutiny..."],"objectives":["Search for signs of Garleans.","Report to Pierremons at the Aurum Vale."],"dialogue":[{"name":"CAILEAN","text":"I say, are you the─ Forgive me, I am Cailean, a bannerman of House Haillenarte. Are you not the adventurer who proved our liege lord's innocence?"},{"name":"CAILEAN","text":"Ah, it <span class=\"emphasis\">is</span> you! You are forged of metal true, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, and I rejoice to meet you, for there is a delicate mission that only a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> most steadfast may be trusted with."},{"name":"CAILEAN","text":"From high upon Monument Tower, we keep watch over the doings of the Garlean outpost. They have been far too active for our hearts' ease lately, and we must discourage these forays without resorting to outright hostility."},{"name":"CAILEAN","text":"Make a round of the three hot spots and look for any trace of the Garleans. Ser Pierremons awaits at the Aurum Vale for your report. The speed of the Fury to you, and Her ruth as well."},{"name":"IMPERIALSOLB","text":"You ask if I'm a soldier of Garlemald? Why, this savage land is outside the fold of the Empire! 'Twould be strange indeed for you to see a Garlean here. You <span class=\"highlight\">doubt</span> me? I care not!"},{"name":"IMPERIALSOLB","text":"Why would a soldier of Garlemald venture into enemy territory? An enemy foolish as well as barbaric, for none can resist our─what I mean to say is the mighty Garl─damn it, retreat, <span class=\"emphasis\">retreat</span>!"},{"name":"IMPERIALSOLB","text":"What lowly adventurer dares pluck at my coat thus? I am a soldier, and therefore your better. I've no call to tell you any more, and a pout would suit you better than that pitiful <span class=\"highlight\">doubt</span>."},{"name":"PIERREMONS","text":"What? All three? You found Garleans at <span class=\"emphasis\">all</span> three locations?"},{"name":"PIERREMONS","text":"We'd espied them slipping over the border from Mor Dhona to survey something, but... These forays must be more frequent than we thought."},{"name":"PIERREMONS","text":"We must increase patrols in the area. I bid you beware, adventurer, if your footloose ways lead you to Mor Dhona. Return safely, and be our eyes in the wilderness again."},{"name":"POP","text":"Strangers are nearby...and they smell of engine oil!"}],"reward":{"gil":2090,"xp":12190},"reqs":{"jobs":[{"lvl":44,"id":1}],"quests":[66519]}},"partials":[{"type":"npc","id":"1006538","obj":{"i":1006538,"n":"Cailean","l":63,"q":1}},{"type":"npc","id":"1006518","obj":{"i":1006518,"n":"Pierremons","l":63,"q":3}},{"type":"npc","id":"1006528","obj":{"i":1006528,"n":"Cid","l":63,"q":2}},{"type":"npc","id":"1006540","obj":{"i":1006540,"n":"Garlean-like Man","l":63,"q":1}},{"type":"quest","id":"66519","obj":{"i":66519,"n":"Notorious Biggs","g":1,"l":"Coerthas Central Highlands","s":232}}]}