{"quest":{"name":"Hit the Hippogryphs","location":"Mor Dhona","id":66528,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006725,"target":1006725,"genre":95,"journal":["Rammbroes has reasons to look concerned, for even a single hippogryph attack is no joke─let alone three.","Several members of the Sons of Saint Coinach excavation have been attacked by hippogryphs on the crystallized plain, and the injuries show these were no frisky bumps. Rammbroes bids you cull three of the churlish creatures.","You have slain three hippogryphs, and are forced to agree with Rammbroes that they had unusual fleetness of foot and ferity of spirit. Let Rammbroes know the deed is done.","The ruins under excavation by the Sons have barely begun giving up their secrets. If the site is indeed home to the builders of the Crystal Tower, it should serve to offer an invaluable insight into the distant past."],"objectives":["Slay hippogryphs.","Report to Rammbroes."],"dialogue":[{"name":"RAMMBROES","text":"You are the adventurer <span class=\"highlight\">Forename</span>, are you not? Several of our surveyors have been wounded by hippogryphs in the crystallized area to the north. It is astonishing how fleet and fierce they are in this region."},{"name":"RAMMBROES","text":"Yet we must teach them to flee, not charge, when the Sons of Saint Coinach are about their scholarly business. I suggest you cull a few of the hippogryphs that they might learn this lesson."},{"name":"RAMMBROES","text":"Ah, our protector returns! Thank you for performing your duties with such speed. We will be able to plan a survey <span class=\"alternative-container\"><span class=\"alternative\">first thing on the morrow</span><span class=\"alternative\">this very afternoon</span><span class=\"alternative\">this very evening</span></span>."},{"name":"RAMMBROES","text":"These ruins of ancient Allag represent entire branches of lost knowledge. It was the Allagans who built the Crystal Tower, or so the best theories say."},{"name":"RAMMBROES","text":"If that is the case, could these ruins not be the remains of a village, nay, a town for workers and their families? Does it hold the record of their lives, spent erecting the shining edifice that beguiles us today?"},{"name":"RAMMBROES","text":"All research on the tower is at a standstill. They are stymied by its perfection. But here...we may learn something here. At least, that is what we hope."}],"reward":{"gil":2121,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}]}},"partials":[{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}}]}