{"quest":{"name":"Playing the Postman","location":"Mor Dhona","id":66527,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006545,"target":1006545,"involved":[1006546,1006547,1006548],"genre":95,"journal":["Nazyl Duzyl has a gentle task in mind for your first service to the Sons of Saint Coinach.","Many Sons of Saint Coinach are far from home, toiling to uncover ancient secrets while hundreds of malms away from family and friends. Take the letters that have traveled that distance, and place them in the Sons' hands.","Every letter has reached the person it was intended for, but you are somewhat crestfallen, for the letters seemed to leave everyone more vexed than they were before. Speak with Nazyl Duzyl and see what he thinks.","The worthy bone sifter explains that, vexing or not, the letters remind the naturalists that there is life beyond the dig. You also learn that the Sons are a Sharlayan order, and that their leader is the famed anthropogeographer Rammbroes. Should you have any further questions on the organization's activities, you would do well to seek out his wisdom."],"objectives":["Deliver the letter to the sightly Son.","Deliver the letter to the kindly Son.","Deliver the letter to the stony Son.","Report to Nazyl Duzyl."],"dialogue":[{"name":"NAZYLDUZYL","text":"The Sons of Saint Coinach draw together the finest minds in Eorzea in order to bend their combined strength upon the Allagan question."},{"name":"NAZYLDUZYL","text":"With such a lofty mission come certain sacrifices─we all have left our homes, our friends, and our families to be here, you see. Many a sob has been stifled in this camp, I am sure."},{"name":"NAZYLDUZYL","text":"Some of us will be here for moons, others for years. We know not what we shall find, or when. Until then, there are the letters, full of news from home."},{"name":"NAZYLDUZYL","text":"Will you take these letters to the Sons? Hardly a task for an adventurer, but it will give you an opportunity to see the camp and speak with some of our party."},{"name":"NPCA","text":"A letter from home? Thank you, adventurer."},{"name":"NPCA","text":"Oh, we were at the Phrontistery together. What does she want?"},{"name":"NPCA","text":"She's to be wed! How ni─what!? She's worth two of him, the great galumphing oaf! Oh, that'll <span class=\"emphasis\">never</span> last..."},{"name":"NPCA","text":"A curious Allagan artifact, gracefully shaped... What function could it have served?"},{"name":"NPCB","text":"Nophica be praised, a letter from Gridania! It must be from my wife."},{"name":"NPCB","text":"All well and prospering. She says that...what?"},{"name":"NPCB","text":"She writes that she has taught our daughter to say “Papa home soon.” She can talk...and I missed her first words. But it has only been three moons since I saw them last!"},{"name":"NPCB","text":"Yes, I shall be home soon! With a discovery that atones for my absence..."},{"name":"NPCC","text":"A letter? That's a first. I would that 'tis no ill news..."},{"name":"NPCC","text":"From the pater? Surely, the mater is not ill again."},{"name":"NPCC","text":"Hm, quite the contrary. She's recovered from her dropsy...and demanding I return home and give her grandchildren."},{"name":"NPCC","text":"&lt;sigh&gt; The pater and mater paid for my studies at the Phrontistery, and they hold it over my head every chance they get. Perhaps I'll find some ancient Allagan secret to minting my own gil..."},{"name":"NAZYLDUZYL","text":"Thank you, <span class=\"highlight\">Forename</span>. Even a vexing letter serves the noble purpose of keeping the Sons moored to their lives, you see. I have known other digs where we lost all sense of the world beyond the day's grid."},{"name":"NAZYLDUZYL","text":"The Sons of Saint Coinach claim their genesis in Sharlayan, that shining city of learning."},{"name":"NAZYLDUZYL","text":"We are all races and clans, united by our passion for the truth about the ancient Allagan civilization. The anthropogeographer Rammbroes is the leader of this endeavor. If you've a mind to stay awhile, it might behoove you to speak with him sooner rather than later."}],"reward":{"gil":1782,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}]},"next":[66532]},"partials":[{"type":"npc","id":"1006545","obj":{"i":1006545,"n":"Nazyl Duzyl","l":67,"q":3}},{"type":"npc","id":"1006546","obj":{"i":1006546,"n":"Sightly Son","l":67,"q":1}},{"type":"npc","id":"1006547","obj":{"i":1006547,"n":"Kindly Son","l":67,"q":1}},{"type":"npc","id":"1006548","obj":{"i":1006548,"n":"Stony Son","l":67,"q":1}},{"type":"quest","id":"66532","obj":{"i":66532,"n":"Dropping Out","g":95,"l":"Mor Dhona","s":450}}]}