{"quest":{"name":"Problem with Plasma","location":"Mor Dhona","id":66523,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006542,"target":1006542,"genre":95,"journal":["Everyone has need of an adventurer sometimes, even among the brethren, and Aganbold has a most shocking request.","Aganbold has a need of catalytic ectoplasm for reasons unknown, or possibly unmentionable. Slay plasmoids and obtain three samples of catalytic plasma.","You successfully collect the plasma. Is that acrid taste in your mouth guilt, or are you just happy to see so many crystals? Spread the plasma on the large crystallized tree in Rathefrost.","The plasma is spread, and now your lurking begins. When the ectoplasm appears, attack it without provocation.","At long last, you have the catalytic ectoplasm. The metallic taste in your mouth has gone, and the ectoplasm in your hands sends up a pleasant hum like a purring kitten. Deliver it to Aganbold.","In Aganbold's hands, the ectoplasm is less a contented cat and more a vexed porcupine. Behind the cheerful mien, Aganbold has a secret sorrow─he is averse to lightning, but favored by learned customers with galvanic interests..."],"objectives":["Collect samples of catalytic plasma from plasmoids.","Spread the catalytic plasma on the crystallized bark.","Lurk at the ambush point, and slay the ectoplasm.","Deliver the catalytic ectoplasm to Aganbold."],"dialogue":[{"name":"AGANBOLD","text":"<span class=\"alternative-container\"><span class=\"alternative\">Sister</span><span class=\"alternative\">Brother</span></span> adventurer, hear me out. I need me a sample of catalytic ectoplasm, but I'm not having much luck."},{"name":"AGANBOLD","text":"It's no great shakes, mind you. First, you go to Rathefrost, slay yourself some plasmoids, then collect three samples of catalytic plasma."},{"name":"AGANBOLD","text":"Douse the large crystallized tree with that, wait a spell, and the bark'll start crackling from the lightning that surges in the plasma."},{"name":"AGANBOLD","text":"After that, it's like gardening on a goobbue─the ectoplasm comes scampering over without a care in the world. Hit that right quick, and you've got yourself some catalytic ectoplasm."},{"name":"AGANBOLD","text":"Why do I want <span class=\"emphasis\">you</span> to get it? Come now, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>, let's not go prying into the unmentionables drawer! All in good time, all in good time."},{"name":"AGANBOLD","text":"Got the little shocker? That's what I call an adventurer! You're a fearless one, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>!"},{"name":"AGANBOLD","text":"Ooowww, swivin' sons of─! Seven hells for seven brothers, that hurts like a troll marryin' my daughter!"},{"name":"AGANBOLD","text":"&lt;sigh&gt; Now you see why <span class=\"emphasis\">I</span> was none too keen on getting the bugger myself. I don't know what it is, but I always end up getting shocked. Maybe I'm lightning-aspected...or straight lightning-<span class=\"emphasis\">disrespected</span>, even."},{"name":"AGANBOLD","text":"Just my luck that I keep getting commissions from these learned types, and about half of them and half of the rest are studying lightning. I should give up adventuring and be an agent, at this rate."},{"name":"POP","text":"The hair begins to rise on your arms!"}],"reward":{"gil":1782,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}],"quests":[66535]}},"partials":[{"type":"npc","id":"1006542","obj":{"i":1006542,"n":"Aganbold","l":67,"q":3}},{"type":"quest","id":"66535","obj":{"i":66535,"n":"The Trickster of the Toll","g":95,"l":"Mor Dhona","s":450}}]}