{"quest":{"name":"Moon Sliver and Me","location":"Mor Dhona","id":66530,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006550,"target":1006550,"genre":95,"journal":["Klynthota has a theory that is out of this world.","Obsessed with the lesser moon since it fell to earth five years ago, Klynthota found, then lost, a fragment of the hammer of the Calamity in the Singing Shards. Lurk there and ambush the elder hapalit with a pepper bomb, and thus regain the fragment.","The bomb proved even more effective than you had hoped, and the fragment is yours. It is an odd thing to hold a piece of the moon in your hands, and an ill one at that. It would be best to pass it on to Klynthota as soon as possible.","Overjoyed at her specimen's return, Klynthota reveals a startling find─that Dalamud was made of the same curious material as those abundantly found in Allagan artifacts. If she is not mistaken, the implications are dizzying..."],"objectives":["Wait at the specified location, then use the pepper bomb on the elder hapalit.","Deliver the Dalamud fragment to Klynthota."],"dialogue":[{"name":"KLYNTHOTA","text":"You are <span class=\"highlight\">Forename</span>? I am called Klynthota. Is it true that adventurers are bound to secrecy whenever they undertake a commission? Excellent! You see, I am here for a reason of my own─the lesser moon, Dalamud."},{"name":"KLYNTHOTA","text":"The others may burrow ever deeper in the ground, but I look to the sky. Five years ago, Dalamud flushed like the face of an old king most wroth before its swelling bulk fell to earth. I am...consumed by the desire to know more."},{"name":"KLYNTHOTA","text":"One of the fragments of the baleful satellite landed in the Singing Shards, and there I took myself and have been excavating ever since...until an elder hapalit came and seized the precious artifact!"},{"name":"KLYNTHOTA","text":"<span class=\"highlight\">Forename</span>, I must have it back! It means everything. You must slay this hated hapalit and return the fragment to me."},{"name":"KLYNTHOTA","text":"I know its weakness well enough from that most dismal encounter. Here is a pepper bomb to use on the fell creature─it was only by flinging a basket of the same peppers in its face that I escaped with my life."},{"name":"KLYNTHOTA","text":"<span class=\"highlight\">Forename</span>! Did you retrieve it? Have you the fragment?"},{"name":"KLYNTHOTA","text":"Ah, my precious specimen! There is much to learn, but see you this earth-shaking discovery of mine..."},{"name":"KLYNTHOTA","text":"The fragment is made of no material known to Eorzea─save for that which has been unearthed in those Allagan ruins!"},{"name":"KLYNTHOTA","text":"What if Dalamud was a thing man-made, created by the sons and daughters of Allag, then cast into the sky? This is a powerful piece of evidence I hold again in my hand..."},{"name":"KLYNTHOTA","text":"First the Crystal Tower, now Dalamud. That a civilization could exist capable of such creations makes my calculations shiver and all jadedness shrivel. Ah, it is a good time to be alive, <span class=\"highlight\">Forename</span>! Thank you for all you have done."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":1782,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}]}},"partials":[{"type":"npc","id":"1006550","obj":{"i":1006550,"n":"Klynthota","l":67,"q":3}}]}