{"quest":{"name":"Drowning Out the Voices","location":"Mor Dhona","id":66537,"patch":2.0,"sort":235,"eventIcon":71201,"issuer":1006535,"target":1006535,"genre":1,"journal":["Cid requires your assistance for his rescue preparation.","In order to hinder communication among imperial forces, Cid declares his intent to put together a makeshift jamming device. To this end, he lends you his electromagnetic reader, which he bids you use at the hill-sized cluster of corrupted crystals to the west of Revenant's Toll.","You have taken sufficient readings. Return to Revenant's Toll and report to Cid.","Cid is satisfied that the crystals will suit his needs, though he expresses his reluctance to harness their power."],"objectives":["Use the electromagnetic reader at prime locations.","Report to Cid."],"dialogue":[{"name":"CID","text":"While Glaumunt goes about devising his plan, we need to see to some preparation of our own."},{"name":"CID","text":"It wouldn't do if the imperials were to discover that they're short an armor."},{"name":"CID","text":"To prevent this from happening, I'm going to put together a makeshift communications-jamming device. The explanation is like to get a bit technical, so bear with me."},{"name":"CID","text":"Imperial forces communicate at a distance via electromagnetic waves. Simply put, voices are borne upon aetheric lightning energy that permeates the air."},{"name":"CID","text":"Now, the hill-sized cluster of corrupted crystals to the west has been observed to amplify the selfsame energy. By making use of this property, we should be able to drown out imperial voices."},{"name":"CID","text":"To ensure that we have enough amplification, we must identify the most potent crystals among the cluster. For this, I need you to go there and use this device to take readings. I'll mark the likely places on your map."},{"name":"CID","text":"Oh, and just so you know, plasmoids are drawn to lightning energy. Don't be surprised if you run into a few."},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"DUMMY","text":"(Use electromagnetic reader)"},{"name":"CID","text":"You have the readings? Excellent. Here, let me see the numbers."},{"name":"CID","text":"...Yes, four of these crystals should suit our purpose, though I pray that we won't have need of their power. My thanks, <span class=\"highlight\">Forename</span>."},{"name":"POP","text":"The air nearby bursts into sparks!"}],"reward":{"gil":353,"xp":25850},"reqs":{"jobs":[{"lvl":45,"id":130}],"quests":[66522]},"next":[66540]},"partials":[{"type":"npc","id":"1006535","obj":{"i":1006535,"n":"Cid","l":67,"q":2}},{"type":"quest","id":"66522","obj":{"i":66522,"n":"Getting Even with Garlemald","g":1,"l":"Mor Dhona","s":234}},{"type":"quest","id":"66540","obj":{"i":66540,"n":"Fool Me Twice","g":1,"l":"Mor Dhona","s":238}}]}