{"quest":{"name":"Heart of Cermet","location":"Mor Dhona","id":66536,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006544,"target":1006544,"involved":[1006549],"genre":95,"journal":["Guolgeim has a mind to send you to the Garlean crash site to the east.","According to Guolgeim, the wreck of the Garlean airship continues to yield small prizes for scavengers such as herself, from time to time. Go southeast and comb the crash site for pieces of airship hull.","You collect eight hull fragments, all of good weight. Do as Guolgeim bid and show them to Wandering Breeze over at Saint Coinach's Find.","What you found were pieces of Garlean armor plating made of cermet, an alloy unknown to Eorzea─and all but proof against anything she could hurl against it. Report what you learned to Guolgeim.","It seems Guolgeim has excellent armor herself, for she is indifferent to the importance of unlocking the secret of the alloy. However, the adventurer is delighted by the prospect of profit, for she is in arrears─and to Wandering Breeze, of all people."],"objectives":["Collect pieces of airship hull.","Show the hull fragments to Wandering Breeze.","Report to Guolgeim."],"dialogue":[{"name":"GUOLGEIM","text":"Ever gone a few paces east? It's not much to look at, but there're pieces from the Garlean wreck for the taking. Rust held together with a prayer most of the time, but now and then, there's a nice plate off an airship."},{"name":"GUOLGEIM","text":"Time was, adventurers sallied out to Revenant's Toll thinking the Garlean salvage'd make them rich. Sore disappointed they were. Thomfred at the bakery, he was one. Came for the magitek, stayed for the marzipan, I tell him."},{"name":"GUOLGEIM","text":"But now that hardly anyone bothers, there's steady pickings. Go on, give it a try. I'll pay you top gil if you can find eight good bits."},{"name":"GUOLGEIM","text":"If you find something likely, go to Wandering Breeze over at Saint Coinach's Find and ask him what the stuff's worth. He knows his Garlean relics, that one."},{"name":"WANDERINGBREEZE","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you. Is there something you require?"},{"name":"WANDERINGBREEZE","text":"You want to know what these are? Well, well. So there <span class=\"emphasis\">is</span> still meat left to pick off the bone..."},{"name":"WANDERINGBREEZE","text":"This is made of cermet, a Garlean alloy. Greatly resistant─some might say impervious─to cannon fire, and beyond our capacity to create."},{"name":"WANDERINGBREEZE","text":"If we could produce our own, there would be cermet pouring out of every metalworks in every city. Or mayhap if we knew what metals sired this alloy, we could use the knowledge in other ways..."},{"name":"WANDERINGBREEZE","text":"Are you not wanting us to study these, then? Just information─ah. Let me guess, Guolgeim. Here are the pieces back, and tell her again that the Sons are not here to provide free appraisals!"},{"name":"GUOLGEIM","text":"Well, is it to be magitek or marzipan? Did you find anything good?"},{"name":"GUOLGEIM","text":"Well, well, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">laddie</span></span>! All Garlean cermet, huh? That will fetch something high, wide, <span class=\"emphasis\">and</span> handsome from a trader!"},{"name":"GUOLGEIM","text":"What? They can change the tide of war? Your problem, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, is that you think too much. These are worth a good bit of gil, and the only tide you should worry about is the tide of ale you can summon with your share of it."},{"name":"GUOLGEIM","text":"But you're right about something─I should learn more about these 'lloys so I don't have to go to the Sons, hat in hand. Here, that's your share. Remember what I said about ale!"},{"name":"GUOLGEIM","text":"If I find more of these cermet pieces, who knows, maybe I'll be able to pay back Wandering Breeze what I owe in a couple of moons..."}],"reward":{"gil":1782,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}],"quests":[66534]}},"partials":[{"type":"npc","id":"1006544","obj":{"i":1006544,"n":"Guolgeim","l":67,"q":4}},{"type":"npc","id":"1006549","obj":{"i":1006549,"n":"Wandering Breeze","l":67,"q":3}},{"type":"quest","id":"66534","obj":{"i":66534,"n":"The Organ of Choice","g":95,"l":"Mor Dhona","s":450}}]}