{"quest":{"name":"The Trickster of the Toll","location":"Mor Dhona","id":66535,"patch":2.0,"sort":450,"eventIcon":71221,"issuer":1006542,"target":1006542,"genre":95,"journal":["Every successful adventurer plays to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength, and you have some inkling of what Aganbold's might be after a few commissions in his stead.","According to the smooth-talking Aganbold, the mare's tail root is a field physick that every adventurer should carry. Since neither he nor you have any on hand, it would be best for you to go west into the Tangle and bring back eight roots.","You locate the mare's tail, and harvest eight roots. The flesh has a pleasant, spicy scent to it; you can well believe it would make a soothing concoction, to the senses at least. As for the festering...end your wool-gathering and speak with Aganbold.","You deliver the roots to Aganbold and escape further work by declining to take your share of the harvest. Uncharitable it may be, but you suspect that Aganbold has cozened you into performing another commission for him..."],"objectives":["Collect mare's tail roots.","Report to Aganbold."],"dialogue":[{"name":"AGANBOLD","text":"<span class=\"alternative-container\"><span class=\"alternative\">Sister</span><span class=\"alternative\">Brother</span></span>, can you spare some mare's tail roots? I've none on account of those young cadgers from the Black Shroud. I told them, “The root tea'll settle that belly of yours,” and the next thing, I've given them all I have!"},{"name":"AGANBOLD","text":"You don't have any either? Why, every adventurer working these parts ought to carry some with them! A poultice of mare's tail keeps wounds from festering, and you look a festering sort of <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">fellow</span></span> if ever I saw one."},{"name":"AGANBOLD","text":"Since we're both short, how about you go and get us some? Eight roots should do it, I'd say."},{"name":"AGANBOLD","text":"There you are, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! Got what we need?"},{"name":"AGANBOLD","text":"One, two...seven and eight. Now, they'll need to be prepared and seeing as how we're both─are you fair certain? You'll want one when that festering starts. Well, if you say so. I'll keep the lot, and much appreciate the kindness!"}],"reward":{"gil":1782,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}],"quests":[66533]},"next":[66523]},"partials":[{"type":"npc","id":"1006542","obj":{"i":1006542,"n":"Aganbold","l":67,"q":3}},{"type":"quest","id":"66533","obj":{"i":66533,"n":"Passing the Smell Test","g":95,"l":"Mor Dhona","s":440}},{"type":"quest","id":"66523","obj":{"i":66523,"n":"Problem with Plasma","g":95,"l":"Mor Dhona","s":450}}]}