{"quest":{"name":"Every Little Thing She Does Is Magitek","location":"Mor Dhona","id":66541,"patch":2.0,"sort":239,"icon":100153,"eventIcon":71201,"issuer":1006555,"target":1006555,"involved":[1004093,1006530,1006557,1006558,1006559,1006560,1006561],"genre":1,"journal":["Cid would have you assist in the repair of the magitek armor.","According to Cid, the magitek core at the heart of the reaper's servomechanism is worn beyond use. Unfortunately, a replacement will not be easy to come by in Eorzea. Speak with Wedge and learn of his proposed solution.","Wedge believes that a mammet heart may serve as a substitute for the worn magitek core. Make your way to the Goldsmiths' Guild in Ul'dah, and collect a mammet heart from Guildmaster Serendipity.","You have acquired a shiny new mammet heart. Return to Cid's workshop in Revenant's Toll, and deliver it to Wedge.","Having installed the mammet heart, Wedge asks you to put the fully repaired magitek armor through its paces. Speak with him when you are ready to begin, and he will help you into the pilot's seat.","You are now in control of the magitek armor. First, make your way to the camp ruins, and climb to the top of the adjoining crystal mound. In the event that you need to dismount, speak with Wedge again to restart the test run.","The feet appear to be in good working order. Next, jump down from your vantage point and make your way to the northern edge of the camp ruins.","The shock absorbers appear to be in sound condition. Make your way back to where Wedge and the others await.","You have put the magitek armor through its paces. Speak with Wedge to hear his full diagnosis.","According to Wedge, the servomechanism is not as responsive as it should be. He posits that the mammet heart may be possessed of emotions, and suggests that you all give the magitek armor a warm /welcome. While the notion sounds positively absurd, for want of a better idea, you may as well do as requested.","Did the armor respond to your vigorous welcoming, or was it all in your mind? Speak with Biggs to learn his thoughts on the matter.","Soon after Wedge's bizarre welcoming ritual, you are discovered by imperial troops bent on reclaiming or destroying the magitek armor. Disinclined to relinquish your prize, you repel the enemy, at which time the reaper seemingly responds to your presence. While the workings of advanced machina are foreign to you, Cid and the others take this awakening to mean that the servomechanism is now fully functional. If the experts are convinced, who are you to say otherwise? Time to make your way back to Cid's workshop in Revenant's Toll.","After countless unforeseen difficulties, and through no small amount of effort, you are now the proud owner of a fully functional suit of magitek armor. At long last, the time is come to infiltrate Castrum Centri and rescue the imprisoned Scions."],"objectives":["Speak with Wedge.","Speak with Serendipity at the Goldsmiths' Guild.","Deliver the mammet heart to Wedge at Cid's workshop.","Speak with Wedge.","Pilot the magitek armor to the crystal mound.","Pilot the magitek armor north of the crystal mound.","Pilot the magitek armor back to Wedge.","Speak with Wedge.","Extend the magitek armor a warm /welcome.","Speak with Biggs.","Report to Cid."],"dialogue":[{"name":"CID","text":"The repairs are proceeding apace. It shouldn't be long now before Biggs and Wedge complete their work. There is, however, one small problem..."},{"name":"CID","text":"As you may recall, the machina's servomechanism was discovered to be faulty. Wedge has subsequently ascertained that the magitek core which drives it is worn beyond use."},{"name":"CID","text":"Such cores are rather fragile devices which must be replaced at regular intervals. Thanks to the negligence of our imperial colleagues, however, the one used in this reaper was long overdue."},{"name":"CID","text":"Alas, we do not have access to a ready replacement here in Mor Dhona. But all is not lost: Wedge thinks he may have identified an alternative solution. Go and see him, would you? He'll explain the details to you."},{"name":"SLAFBORN","text":"Want to go in? It hardly needs saying, but try not to be seen."},{"name":"Q1","text":"Proceed to Cid's workshop?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"WEDGE","text":"As I believe the chief has already informed you, the magitek core is worn beyond use. We need to find a replacement."},{"name":"WEDGE","text":"I thought about having you appropriate more reapers, but even if the dunderhead maintenance engineers of Castrum Centri <span class=\"emphasis\">had</span> remembered to replace their cores, we would risk arousing imperial suspicion."},{"name":"WEDGE","text":"But do not despair, for I believe there is a solution: to substitute the magitek core with a mammet heart!"},{"name":"WEDGE","text":"In case you don't know, a mammet heart can be used to grant sentience to an automaton. By my reckoning, such a device should be more than capable of regulating the armor's servomechanism. We'll just need to make some minor modifications to the housing unit."},{"name":"WEDGE","text":"I've already placed an order for a first-rate mammet heart with the Goldsmiths' Guild. All that remains is for someone to go to Ul'dah and collect it! Oh...and to <span class=\"emphasis\">pay</span> for it. Ahem. Did I...mention how much they cost? No? W–Well, they typically cost something in the order of, um... &lt;mumble&gt; I hope you don't mind footing the bill─it's for a good cause!"},{"name":"SERENDIPITY","text":"Hello there! Come to collect a mammet heart, you say?"},{"name":"SERENDIPITY","text":"Then you must be here on behalf of Garlond Ironworks! I've taken the liberty of picking the finest example we have─a heart fit for a prince among mammets!"},{"name":"SERENDIPITY","text":"...Payment? Oh, that won't be necessary. The heart is for Master Alphinaud's personal use, after all. He notified us a short while ago that his manservant would be coming to collect it."},{"name":"SERENDIPITY","text":"Tender in years though he may be, Master Alphinaud has been a benefactor of ours since my predecessor's time. The Goldsmiths' Guild wouldn't dream of charging him."},{"name":"SERENDIPITY","text":"But here is the mammet heart! May it serve you well! Oh, and please do pass on my compliments to your master!"},{"name":"WEDGE","text":"Do you have the mammet heart? I can't wait to see if it works!"},{"name":"WEDGE","text":"Hurrah! Thank you so much!"},{"name":"WEDGE","text":"&lt;gasp&gt; But this...this is <span class=\"emphasis\">magnificent</span>! It must have cost an emperor's ransom!"},{"name":"WEDGE","text":"...Free of charge, courtesy of Alphinaud!? Coming from an influential family certainly has its advantages!"},{"name":"WEDGE","text":"But without further ado, let's give it a try! I've already modified the housing unit, so it <span class=\"emphasis\">should</span> slot right in!"},{"name":"WEDGE","text":"There! She's ready! Magitek armor...engage!"},{"name":"WEDGE","text":"...Or not.<br>Haha...hah... She just needs a loving tap, I'll wager."},{"name":"WEDGE","text":"Yes! She's...she's ALIVE!"},{"name":"WEDGE","text":"Let's take her outside and put her through her paces! <span class=\"highlight\">Forename</span>, would you care to do the honors?"},{"name":"WEDGE","text":"Hop into the pilot's seat! We'll begin as soon as you're ready!"},{"name":"WEDGE","text":"First, I'd like you to try climbing that tangle of crystals yonder─as far up as you can go, if you please."},{"name":"WEDGE","text":"Oh, and if for some reason you need to dismount, simply come back here and we'll start again."},{"name":"WEDGE","text":"(-Wedge-)No anomalous movements evident from either leg. Good. Next, jump back down and then sprint north, quick as you can!"},{"name":"WEDGE","text":"Let's try that again, shall we? Hop back in, <span class=\"highlight\">Forename</span>!"},{"name":"WEDGE","text":"(-Wedge-)Um...a fine effort, <span class=\"highlight\">Forename</span>, but you seem to have left Maggie behind─I-I mean the reaper. Come back here so we can start again."},{"name":"BIGGS","text":"I've overseen a hundred such tests, but they still play hells with my nerves. And that's <span class=\"emphasis\">without</span> the chief watching..."},{"name":"CID","text":"This is the Ironworks' first major project since my return. I mean to see that it's a success."},{"name":"WEDGE","text":"(-Wedge-)Leg joints absorbing all impact without incident... Excellent. Please make your way back, <span class=\"highlight\">Forename</span>."},{"name":"WEDGE","text":"(-Wedge-)The torso remains stable during vigorous motion... Excellent. And that concludes our test. Thank you for your cooperation!"},{"name":"WEDGE","text":"Here is a summary of my findings. The drivetrain is in sound condition. With some fine-tuning, we can expect a noticeable improvement in performance. As for the servomechanism..."},{"name":"WEDGE","text":"I'm afraid it's not nearly as responsive as it should be, and I'm at a loss to explain why. The mammet heart is in pristine condition, and should be installed correctly. Perhaps its inner workings are simply too different to operate harmoniously with the armor's other mechanisms?"},{"name":"WEDGE","text":"Whereas magitek cores serve only to conduct impulses, mammet hearts enable automata to process the information collected by their sensors as feeli─ &lt;gasp&gt; <span class=\"emphasis\">Feelings</span>! Maybe she just doesn't feel like part of the team!? In which case, we should all do our best to make her feel <span class=\"highlight\">welcome</span>!"},{"name":"WEDGE","text":"Come on, everyone! Let's give Maggie here a warm <span class=\"highlight\">welcome</span>! Really make her feel at home!"},{"name":"BIGGS","text":"...You're not serious. You want us to <span class=\"emphasis\">welcome</span> an inanimate object?"},{"name":"CID","text":"I take it Wedge's suggestion has given you pause. Well, I don't blame you. The lad <span class=\"emphasis\">does</span> have some rather unorthodox ideas. Still, orthodoxy did not give us language, tools, clothes...or machina. Short of a better idea, I don't suppose it would hurt to try."},{"name":"MAGITEKARMOR","text":"..."},{"name":"MAGITEKARMOR","text":"&lt;click&gt;"},{"name":"MAGITEKARMOR","text":"..."},{"name":"BIGGS","text":"Daft as it felt, I gave it my best. I've welcomed myself to a bloody standstill. What were you expecting it to do anyway? Bob us a curtsy?"},{"name":"CID","text":"No doubt you're wondering why the servomechanism is so important as to warrant this silliness."},{"name":"CID","text":"Without it, the pilot would be required to control the armor's every movement manually. This would be an onerous task at the best of times, and wholly impractical during battle."},{"name":"CID","text":"Using a mammet heart in place of the worn magitek core seemed a promising solution. Alas, the device does not appear to be compatible with Garlean technology."},{"name":"CID","text":"Wedge, are there no other ways we might demonstrate our appreciation to our friend here?"},{"name":"WEDGE","text":"I'm at my wit's end, Chief. She just...doesn't seem convinced. We <span class=\"emphasis\">could</span> try a little dance, perhaps, or cheer our heads off...?"},{"name":"BIGGS","text":"Imperials! They've come for the armor!"},{"name":"CID","text":"Damn it! They have us cornered!"},{"name":"IMPERIALCENTURION","text":"There's the reaper!"},{"name":"IMPERIALCENTURION","text":"Taken by the traitor Garlond─and is that the <span class=\"emphasis\">eikon-slayer</span>!? Oh, bollocks..."},{"name":"IMPERIALCENTURION","text":"Call for reinforcements!"},{"name":"CID","text":"The hells you will!"},{"name":"IMPERIALRUNNER","text":"We've located the stolen reaper! Requesting immediate assistance! Respond! <span class=\"emphasis\">Respond</span>!"},{"name":"IMPERIALRUNNER","text":"It's no use, sir! There's some sort of interference!"},{"name":"IMPERIALCENTURION","text":"Curse you, Garlond!"},{"name":"IMPERIALCENTURION","text":"No matter! If we can't reclaim it, destroy it!"},{"name":"CID","text":"Bloody hells... <span class=\"highlight\">Forename</span>─protect the armor at all costs!"},{"name":"BIGGS","text":"QIB"},{"name":"BIGGS","text":"(Ncut after battle)"},{"name":"WEDGE","text":"Chief, look! She moved!"},{"name":"CID","text":"Ah, <span class=\"emphasis\">now</span> she deigns to grace us with her presence!"},{"name":"CID","text":"It took us a good while, but we're finally ready."},{"name":"CID","text":"It's time to infiltrate Castrum Centri and rescue our comrades!"},{"name":"WEDGE","text":"There, the finishing touch!"},{"name":"CID","text":"The servomechanism is now fully functional─and all it took was a simple fight to the death. Remind me <span class=\"emphasis\">not</span> to install a mammet heart aboard the <span class=\"emphasis\">Enterprise</span>, would you? Much as I love her, I would rather not be required to profess it before boarding. But enough of that. Let us see to our final preparations."},{"name":"CID","text":"Thanks to Biggs and Wedge, the reaper is as good as new. We're as prepared as we're like to get!"},{"name":"QIB","text":"Protect the magitek armor and defeat the enemy!"},{"name":"TEIKOKU","text":"We cannot suffer the enemy to use our weapons against us!"},{"name":"CID","text":"You're not undoing our hard work!"},{"name":"WEDGE","text":"Uwaaah! Keep them away from Maggie!"},{"name":"WEDGE","text":"Oh no! She's taking damage!"},{"name":"WEDGE","text":"Sh-She's in a bad way! Somebody, do <span class=\"emphasis\">something</span>!"},{"name":"WEDGE","text":"No! Maggie! Why? WHYYY!? &lt;sob&gt;"},{"name":"BIGGS","text":"They're on their own! We can take them!"},{"name":"CID","text":"Don't...let them take... Ungh..."}],"reward":{"gil":3313,"xp":25850},"reqs":{"jobs":[{"lvl":46,"id":130}],"quests":[66540]},"next":[66057]},"partials":[{"type":"npc","id":"1006555","obj":{"i":1006555,"n":"Cid","l":67,"q":3}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1006557","obj":{"i":1006557,"n":"Wedge","l":67,"q":1}},{"type":"npc","id":"1006558","obj":{"i":1006558,"n":"Cid","l":67,"q":1}},{"type":"npc","id":"1006559","obj":{"i":1006559,"n":"Wedge","l":67,"q":1}},{"type":"npc","id":"1006560","obj":{"i":1006560,"n":"Biggs","l":67,"q":1}},{"type":"npc","id":"1006561","obj":{"i":1006561,"n":"Magitek Reaper","l":67,"q":1}},{"type":"quest","id":"66540","obj":{"i":66540,"n":"Fool Me Twice","g":1,"l":"Mor Dhona","s":238}},{"type":"quest","id":"66057","obj":{"i":66057,"n":"Escape from Castrum Centri","g":1,"l":"Mor Dhona","s":240}}]}