{"quest":{"name":"The Dark Divinity","location":"Gridania","id":66545,"patch":2.0,"sort":460,"unlocksFunction":1,"eventIcon":71341,"issuer":1003061,"target":1006585,"involved":[1000423,1006584],"genre":92,"journal":["Bowlord Lewin would seek the counsel of others.","Bowlord Lewin suspects that the dark horseman is none other than Odin, the Dark Divinity, as told in the ancient scriptures. Travel to Quarrymill and seek counsel from O–App–Pesi.","According to Brother O–App–Pesi, the Dark Divinity slumbers within Urth's Fount, where a great Allagan hero confined him in a gaol of crystal. Inspect Urth's Seal to see that the crystal fetters still hold. The cleansing water provided to you should avail you if any malicious spirits take issue with your presence.","The wayward soul of the Allagan hero that assailed you has been delivered to eternal rest. You are free to examine Urth's Seal more closely.","You have obtained what appears to be a remnant of the crystal that once enfettered the Dark Divinity. Deliver your findings to Brother O–App–Pesi.","There can be no more doubt. O–App–Pesi's worst fears have been realized─Odin rides again. Share your findings with Simmie.","Simmie thanks you for your aid, and says she will immediately incorporate your findings into the report she is drafting for her superiors."],"objectives":["Speak with O–App–Pesi in Quarrymill.","Inspect Urth's Seal and use cleansing water to defeat evil spirits.","Obtain the sundered binding stone from Urth's Seal.","Deliver the sundered binding stone to O–App–Pesi.","Report to Simmie."],"dialogue":[{"name":"LEWIN","text":"A ghostly knight atop his baleful steed... It is as I feared─the rumors bear a most inauspicious resemblance to the references in ancient scripture describing Odin, the Dark Divinity."},{"name":"LEWIN","text":"It is my suspicion that the dark horseman of rumor is indeed Odin, and furthermore, that this malevolent presence is a primal. And yet before the Gods' Quiver takes action, I would seek the counsel of one versed in the holy writings."},{"name":"LEWIN","text":"Make for Quarrymill and seek out Brother O–App–Pesi─I would know what he knows. And be swift, <span class=\"highlight\">Surname</span>. If Odin is truly come to the Shroud, time is not on our side."},{"name":"OAPPPESI","text":"I am O–App–Pesi. And <span class=\"emphasis\">you</span> must be the adventurer I've been expecting."},{"name":"OAPPPESI","text":"Ah, yes...Odin, the Dark Divinity. Bowlord Lewin is understandably distressed at his arrival. As one who has read the scriptures, however, I am not entirely surprised."},{"name":"OAPPPESI","text":"Odin, as the ancient writings have it, rode forth into our world, wielding a dark blade capable of cleaving earth and the heavens. By his fell blade did perish Urth herself, and countless multitudes of her people."},{"name":"OAPPPESI","text":"At long last a great hero of Allag did arise to do battle with the dark god. Odin was slain, and his spirit sealed within a forest spring."},{"name":"OAPPPESI","text":"For years, this was thought to be a mere wives' tale─a ghost story told by mothers to frighten their young ones into obedience. But recent archaeological studies at Allagan ruins have unearthed damning evidence to the contrary. And now, these rumors..."},{"name":"OAPPPESI","text":"The scriptures claim that the Dark Divinity slumbers in Urth's Fount, deep in the heart of the Shroud, where the power of a crystal confines him."},{"name":"OAPPPESI","text":"I have ventured into the forest and seen the crystal with my own eyes, but this was many years ago. It is entirely within the realm of possibility that something has gone terribly awry, and the fetters of crystal confine the Dark Divinity no longer."},{"name":"OAPPPESI","text":"I would send you to Urth's Fount to investigate the matter, but be forewarned: your path will not be an easy one. Should any evil spirits stand in your way, this water of cleansing should avail you."},{"name":"OAPPPESI","text":"Be safe, adventurer. If the Dark Divinity truly rides anew, dark days are upon our realm indeed..."},{"name":"DUMMY","text":"//: kill evil spirits, get crystal"},{"name":"OAPPPESI","text":"The crystalline gaol that held the Dark Divinity in check─were you able to ascertain what has become of it?"},{"name":"OAPPPESI","text":"Magical energy still remains in this stone, though its powers have grown dim. What's more, behold how the stone has been cleaved clear in twain─by Odin's fell blade, there can be no doubt."},{"name":"OAPPPESI","text":"Yes, there can be no doubt as to the identity of our unwelcome guest. And yet, it is all most curious─if the Dark Divinity rides free, why does he tarry in the Shroud?"},{"name":"OAPPPESI","text":"Anyroad, you are to be commended for your bravery, adventurer. Simmie is preparing a report on this very matter as we speak. I would be most grateful if you could share your findings with her as well."},{"name":"OAPPPESI","text":"The rumors were true after all─the Dark Divinity rides again. Pray share your findings with Simmie as well, adventurer."},{"name":"SIMMIE","text":"...So it is indeed as we feared. The seal of Urth's Fount has been broken, and the Dark Divinity rides again. I must draft a report immediately."},{"name":"Q1","text":"Proceed to the Seat of the First Bow?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"POP","text":"A chill wind rustles the leaves about you..."}],"reward":{"items":[{"id":4361,"one":1},{"id":4150,"one":1},{"id":5826,"one":1}],"xp":12925},"reqs":{"jobs":[{"lvl":46,"id":1}],"quests":[66544]},"next":[66548]},"partials":[{"type":"npc","id":"1003061","obj":{"i":1003061,"n":"Lewin","l":346,"q":6}},{"type":"npc","id":"1006585","obj":{"i":1006585,"n":"Simmie","l":56,"q":2}},{"type":"npc","id":"1000423","obj":{"i":1000423,"n":"Gods' Quiver Bow","l":52,"q":6}},{"type":"npc","id":"1006584","obj":{"i":1006584,"n":"O-App-Pesi","l":56,"q":1}},{"type":"item","id":"4361","obj":{"i":4361,"n":"Electrum Gorget","l":46,"c":54804,"t":40}},{"type":"item","id":"4150","obj":{"i":4150,"n":"Electrum Wristlets","l":46,"c":55604,"t":42}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"66544","obj":{"i":66544,"n":"Who Was That Man in Black","g":92,"l":"Gridania","s":460,"f":1}},{"type":"quest","id":"66548","obj":{"i":66548,"n":"All You Wanted to Know about Odin","g":92,"l":"South Shroud","s":460,"f":1}}]}