{"quest":{"name":"Claiming the Booty","location":"Outer La Noscea","id":66556,"patch":2.0,"sort":470,"eventIcon":71221,"issuer":1006325,"target":1007487,"involved":[1003281],"genre":91,"journal":["Bloeidin would have you deliver a message.","Bloeidin has drafted a full report on the success of Operation Crucible Down, along with a proposition. Deliver the missive to R'ashaht Rhiki at Maelstrom Command.","R'ashaht Rhiki is pleased to hear of the operation's success, and promises to negotiate with Command as to Bloeidin's requests. Your task complete, return to the Waking Sands and deliver Bloeidin's regards to Slafswys.","Slafswys recounts her past experiences with Bloeidin, and expresses her admiration for Bloeidin's efforts, despite fate having sent the two along separate paths. In any event, the kobold threat to Limsa has been quelled for the foreseeable future."],"objectives":["Deliver the report to R'ashaht Rhiki.","Report to Slafswys at the Waking Sands."],"dialogue":[{"name":"BLOEIDIN","text":"Aye─the pirates of Limsa have added another chapter to our legend, and we couldn't have done it without you. On behalf of my entire crew, you have my thanks, adventurer."},{"name":"BLOEIDIN","text":"In a perfect world, the mere word of our triumph would convince any pirate captain still sailing aimlessly in search of treasure to quit their plundering and fight the good fight. But I know as well as any that coin is the quickest─and ofttimes the only, aye─way to a pirate's heart."},{"name":"BLOEIDIN","text":"I've drafted a full report of the operation, along with the suggestion that the Maelstrom institute generous rewards for any pirate─be he captain, cook, or swab─who contributes to their cause. I'd be most obliged if you could deliver it to Commander Rhiki."},{"name":"BLOEIDIN","text":"And after you do that, send my regards to Slafswys. Tell her...I'm waiting for her."},{"name":"RASHAHT","text":"Did you, by any chance, come from the direction of Camp Overlook? There seems to have been quite the commotion there."},{"name":"RASHAHT","text":"A report from Commander Bloeidin? What's this? The kobolds' crucible is no more!? Those damned scurvy fools! Loose cannons, to the last─and I'm glad they're on our side."},{"name":"RASHAHT","text":"I'll gladly issue them a special commendation, and...hm!? A hundred thousand gil for each crewman who contributed to the effort!? The nerve of the man!"},{"name":"RASHAHT","text":"&lt;sigh&gt; While the exact amount will have to be negotiated, I see no reason to be stingy with our coffers if a bounty here or there would convince capable men to join our cause. I shall take Commander Bloeidin's proposition to Command."},{"name":"SLAFSWYS","text":"The seas have carried ye back to me, I see. I've caught wind of me erstwhile mateys' triumph, and yer contributions as well. Ye'd have made for a fine pirate yerself, aye."},{"name":"SLAFSWYS","text":"Bringin' the pirates together with promises of treasure and glory─that's the Bloeidin I know, aye. And from what I hear, it's already caught the ear of many a buccaneer."},{"name":"SLAFSWYS","text":"Bloeidin and I go back a ways, we do. We were comrades, friends, and─aye─even more than that on occasion, if me memory serves."},{"name":"SLAFSWYS","text":"I've got nothing but respect for the man, but buildin' a proper army out of old buccaneers won't be easy. Any idea he comes up with, you can bet Admiral Merlwyb's already had it."},{"name":"SLAFSWYS","text":"Treasure and glory are all well and good, but do ye know what truly calls a pirate to the open sea? Freedom. And that's somethin' that the Maelstrom can never offer."},{"name":"SLAFSWYS","text":"But I can only hope that others of me kind answer the call, aye. Then─and only then─can I be sure that me decision to part with me Yellowjacket comrades was the right one."}],"reward":{"gil":1716,"xp":13160},"reqs":{"jobs":[{"lvl":47,"id":1}],"quests":[66555]}},"partials":[{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"npc","id":"1007487","obj":{"i":1007487,"n":"Slafswys","l":356,"q":2}},{"type":"npc","id":"1003281","obj":{"i":1003281,"n":"R'ashaht Rhiki","l":28,"q":13,"t":"Storm Commander"}},{"type":"quest","id":"66555","obj":{"i":66555,"n":"Operation Crucible Down","g":91,"l":"Outer La Noscea","s":470}}]}