{"quest":{"name":"A Pirate's Life for Me","location":"Outer La Noscea","id":66553,"patch":2.0,"sort":470,"eventIcon":71221,"issuer":1006325,"target":1006325,"involved":[1006590,1006591,1006592,1006593],"genre":91,"journal":["Commander Bloeidin has an idea as to how you might win over his men.","Commander Bloeidin believes that the former pirates under his command might be swayed to fight the beastmen by offers of fortune and glory. Convey the message to four of the erstwhile buccaneers.","As Bloeidin suspected, the prospect of coin and fortune has lit a fire in the belly of his men. Inform the commander of your success.","Commander Bloeidin is pleased to see his men stirred to action, and seems most confident that the former pirates will prove a force to be reckoned with in the battle against the kobolds."],"objectives":["Speak with Bloeidin's crew.","Report to Bloeidin."],"dialogue":[{"name":"BLOEIDIN","text":"We may fly the flag of the Maelstrom now, but in years past, me and my crew were some of the scurviest pirates to sail the seas. Traded in our Jolly Rogers for the crimson and black when Merlwyb assumed the admiralship, aye."},{"name":"BLOEIDIN","text":"Our days of pillaging and plundering may be behind us, but a pirate never loses his nose for treasure and glory."},{"name":"BLOEIDIN","text":"If you can convince my crew that there's a fortune to be had in fighting the kobolds, I suspect you'd find them most agreeable to joining your cause."},{"name":"BLOEIDIN","text":"Say, for instance...if there were a healthy bounty for any buccaneer who made a name for him or herself in the kobold war."},{"name":"BLOEIDIN","text":"I believe something like that just might be arranged, aye. Why don't you convey the message to my men? "},{"name":"ENPC1","text":"A bounty for fightin' the kobolds? Well, why'd ye not say so sooner!? I've never cared much for the scurvy beasts. Tell the cap'n I'll be sailin' east on the morrow."},{"name":"ENPC2","text":"A bounty on the kobolds? Cups o' grog flowin' over, bottomless bowls of grub, and buxom wenches on each arm. Aye, that sounds like a right tasty proposition. Now where did I put me cutlass?"},{"name":"ENPC3","text":"I swore to myself that my pirating days were through─but deep within, I've always longed to sail the open seas again. Aye, this is the chance I've been waiting for."},{"name":"ENPC4","text":"Arrr! I've been meanin' to buy a new peg leg for me hobbled mate, and this bounty ye speak of will let me do just that. Raise the mast! Tomorrow I set sail for kobold territory!"},{"name":"BLOEIDIN","text":"I see you had little trouble winning over my crew. Aye...once a pirate, always a pirate."},{"name":"BLOEIDIN","text":"The skull and crossbones of Limsa set sail once more, and I pity any beastman caught in their wake."}],"reward":{"gil":1716,"xp":13160},"reqs":{"jobs":[{"lvl":47,"id":1}],"quests":[66551]},"next":[66555]},"partials":[{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"npc","id":"1006590","obj":{"i":1006590,"n":"Red Swallow Private First Class","l":350,"q":1}},{"type":"npc","id":"1006591","obj":{"i":1006591,"n":"Red Swallow Private Third Class","l":350,"q":1}},{"type":"npc","id":"1006592","obj":{"i":1006592,"n":"Red Swallow Private Second Class","l":350,"q":1}},{"type":"npc","id":"1006593","obj":{"i":1006593,"n":"Red Swallow Corporal","l":350,"q":1}},{"type":"quest","id":"66551","obj":{"i":66551,"n":"A Kobold Initiative","g":93,"l":"The Waking Sands","s":470}},{"type":"quest","id":"66555","obj":{"i":66555,"n":"Operation Crucible Down","g":91,"l":"Outer La Noscea","s":470}}]}