{"quest":{"name":"A Kobold Initiative","location":"The Waking Sands","id":66551,"patch":2.0,"sort":470,"eventIcon":71221,"issuer":1007487,"target":1006325,"genre":93,"journal":["Slafswys has a plan that requires an adventurer's aid.","Slafswys would carry out a preemptive strike against the kobolds, and would recruit the pirates of Limsa to the cause. Convey her message to Commander Bloeidin at Camp Overlook.","Commander Bloeidin expresses his admiration for Slafswys's courage and ingenuity, and appears willing to offer his aid in the operation."],"objectives":["Speak with Bloeidin at Camp Overlook."],"dialogue":[{"name":"SLAFSWYS","text":"Read the riptides and the winds, and brace yerself for the comin' storm... Learned as much when I sailed as a Yellowjacket, aye."},{"name":"SLAFSWYS","text":"The wisdom of the seas has served me just as well on land. The beast tribes are a storm in the brewin', and neither the Scions nor the city–states can allow themselves to be caught unawares."},{"name":"SLAFSWYS","text":"Nay, we must strike first and nip the storm in the bud. I'd start with the kobolds─I reckon they've grown a bit too big for their breeches of late."},{"name":"SLAFSWYS","text":"One more thing I learned as a Yellowjacket is that yer ship is only as steady as yer crew. Before takin' on the kobolds, I've a mind to round up some new allies."},{"name":"SLAFSWYS","text":"In Camp Overlook, ye'll find a crew of pirates who've given up pillagin' and plunderin', and now fly the flag of the Maelstrom."},{"name":"SLAFSWYS","text":"I'd bring them onboard to fight the kobold menace, but I've a notion that an honest plea from yerself would be more convincin'. Might ye travel to Camp Overlook and speak to Commander Bloeidin in my stead? Ye'd be doin' us a great service, aye."},{"name":"BLOEIDIN","text":"Adventurer, eh? With a message from Slafswys, you say?"},{"name":"BLOEIDIN","text":"Eh? A preemptive strike to take the wind out of the kobolds' sails before they can mount an attack?"},{"name":"BLOEIDIN","text":"And she'd recruit old buccaneers like <span class=\"emphasis\">us</span> for the effort? This, when even Admiral Merlwyb has her hands full with the damn beasts? Why, that's either the most barnacle-brained idea I've heard...or the most bloody brilliant!"},{"name":"BLOEIDIN","text":"Gahaha! I'll confess─I had my doubts when I heard she was leaving the Yellowjackets, but I see that wench's as salty a sea dog as ever. Aye, this should prove most interesting."}],"reward":{"xp":13160},"reqs":{"jobs":[{"lvl":47,"id":1}],"quests":[66058]},"next":[66553,66554]},"partials":[{"type":"npc","id":"1007487","obj":{"i":1007487,"n":"Slafswys","l":356,"q":2}},{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"quest","id":"66058","obj":{"i":66058,"n":"The Black Wolf's Ultimatum","g":1,"l":"Ul'dah","s":241}},{"type":"quest","id":"66553","obj":{"i":66553,"n":"A Pirate's Life for Me","g":91,"l":"Outer La Noscea","s":470}},{"type":"quest","id":"66554","obj":{"i":66554,"n":"Honor the Fallen","g":91,"l":"Outer La Noscea","s":470}}]}