{"quest":{"name":"Can't Do It without U","location":"The Waking Sands","id":66552,"patch":2.0,"sort":470,"eventIcon":71221,"target":1004917,"genre":0,"journal":["Arenvald would seek your aid in putting a plan of his into motion.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Wigstan at the Waking Sands.</span>","U'odh Nunh has heard your plea. Though the nunh himself is not averse to the plan, he doubts his fellow tribesmen will be so eager to cooperate."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Wigstan at the Waking Sands.</span>"],"dialogue":[{"name":"ARENVALD","text":"My dear friends, A'aba and Aulie, came to the Scions with a burning passion to deliver this realm from darkness─a passion that I could never muster. They fought bravely, and with honor...until they could fight no more."},{"name":"ARENVALD","text":"Me, I was never worth much on the battlefield. I wanted nothing more than to honor my fallen comrades─to carry on their fight─but how?"},{"name":"ARENVALD","text":"One day, it struck me. I may be woefully lacking on the battlefield, but my mind is sharp enough. I resolved to plot a course of action and recruit capable allies to our cause."},{"name":"ARENVALD","text":"One thing is clear to me─we can ill afford to be distracted by the beast tribes with more ominous storm clouds gathering on the horizon. To that end, we must find strong and loyal allies to quell the beastman menace."},{"name":"ARENVALD","text":"You are familiar with the U, perhaps? A tribe of fearsome hunters and huntresses, I am convinced that they would prove invaluable allies in the battle against the Amalj'aa, if only they could be won over."},{"name":"ARENVALD","text":"The U respect strength above all─I fear they'd sooner gut me than listen to my tale. But you... If <span class=\"emphasis\">you</span> spoke, they would listen─I am certain of it. And so I ask, friend: travel to Forgotten Springs and speak to U'odh Nunh in my stead."},{"name":"UODHNUN","text":"The slayer of Titan rrreturns. The slayer seeks something of the U, yes? What is it that you seek?"},{"name":"UODHNUN","text":"So you would have us join your fight against the Amalj'aa. Hmph. The U do not care for the lizardmen, this is true. But the U fight no battles but our own."},{"name":"UODHNUN","text":"...That is what my tribesmen will say. I am not unwilling to help you, but I know you better than they."}],"reqs":{"jobs":[{"lvl":47,"id":1}],"quests":[66058]},"next":[66557,66558]},"partials":[{"type":"npc","id":"1004917","obj":{"i":1004917,"n":"U'odh Nunh","l":45,"q":12}},{"type":"quest","id":"66058","obj":{"i":66058,"n":"The Black Wolf's Ultimatum","g":1,"l":"Ul'dah","s":241}},{"type":"quest","id":"66557","obj":{"i":66557,"n":"What's It to U","g":93,"l":"Southern Thanalan","s":470}},{"type":"quest","id":"66558","obj":{"i":66558,"n":"Zombies Are People Too","g":93,"l":"Southern Thanalan","s":470}}]}