{"quest":{"name":"Long Walk off a Short Pier","location":"Western La Noscea","id":66563,"patch":2.0,"sort":480,"eventIcon":71221,"issuer":1006618,"target":1006614,"involved":[1006619,1006621,1006624,1006631,1006632],"genre":91,"journal":["Ururu Kogururu has tidings regarding the shipment of crystals.","Ururu Kogururu informs you that the crystal-carrying ship has docked. Make your way to the pier and speak with Dawson.","No sooner do you speak with Dawson than a merchant rushes up breathless with grim news that Serpent Reavers are at Aleport's gates. Dawson bids you recover the lost cargo and vanquish the Serpent Reavers.","You defeated the Serpent Reavers and reclaimed the cargo. Return to the pier and report your success to Dawson.","You arrive at the pier to find that the ship has sailed. It turns out that the Dawson you were dealing with was an impostor all this time. Make your way to Camp Skull Valley and inform Falkbryda that the Serpent Reavers have stolen the crystals.","Now that the culprit has been identified as the dread pirate Drysnagl, there looms the daunting task of bringing the villain to justice."],"objectives":["Speak with Dawson.","Examine the dropped cargo and slay the Serpent Reavers.","Speak with Dawson.","Report to Falkbryda."],"dialogue":[{"name":"URURUKOGURURU","text":"Your ship's come in! Head over to the pier and see to it those crystals reach their destination."},{"name":"DAWSON","text":"She's all restocked and ready to go! Hop aboard! ...If you think that's best."},{"name":"NPCA","text":"Heeelp! Serpent Reavers are at the gates! "},{"name":"DAWSON","text":"Serpent Reavers!? Those traitorous whoresons! What ever in Eorzea could they possibly be doing here?"},{"name":"NPCA","text":"I cut bait with my cargo to escape with my life, but they're still out there!"},{"name":"DAWSON","text":"Hmph, waiting for us to try and reclaim the consignment, no doubt. Lucky for you, this adventurer here is going to give those bastards what for!"},{"name":"DAWSON","text":"I'll hang back here and make sure no one lays a hand on the Maelstrom freight. The ship will stay docked until you're done taking care of the Reavers."},{"name":"DAWSON","text":"Off you go! The Serpent Reavers are just outside the gates. Needless to say, the ship will still be here when you get back!"},{"name":"DAWSON","text":"What in the name of the Navigator happened here? You must be the adventurer the Scions sent. My name is Dawson. I was sent from Mealvaan's Gate to oversee the freight here at Aleport, yet the freight is nowhere to be seen."},{"name":"DAWSON","text":"Another Dawson? You mean to say an impostor has been handling my freight!? "},{"name":"DAWSON","text":"And now the ship is missing... This was no mere prank─treachery is afoot! You must notify Falkbryda without delay!"},{"name":"DAWSON","text":"That explains the suspicious delays and farcical harassment I encountered on my way here─all part of their plot."},{"name":"NPCB","text":"&lt;pant&gt; Afraid I couldn't put up much of a fight... That duplicate Dawson may be a fake...&lt;pant&gt;...but the axe he wields is plenty real..."},{"name":"NPCC","text":"Come to think of it, “Dawson” is no sort of name for a Roegadyn... I was a fool not to realize earlier..."},{"name":"NPCD","text":"Ugh... Fret not over my wounds! The ship is all that matters!"},{"name":"FALKBRYDA","text":"Word of our folly has beaten you to me. So consumed were we with the dangers of the Sahagin at sea that we left ourselves open on land."},{"name":"FALKBRYDA","text":"Though this scalawaggery took place onshore, I haven't any doubt 'twas the Reavers' doing. We've pieced together the identity of our fraudulent freight-bearer─the dread pirate Drysnagl."},{"name":"FALKBRYDA","text":"It's only fitting that the silver-tongued snake calls the Serpent's Tongue home."},{"name":"FALKBRYDA","text":"The Sahagin we were prepared for, but not the Serpent Reavers. We steeled ourselves against the danger on the horizon only to fall to the danger at our very feet."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":2218,"xp":13965},"reqs":{"jobs":[{"lvl":48,"id":1}],"quests":[66562]},"next":[66564,66565,66566,66571]},"partials":[{"type":"npc","id":"1006618","obj":{"i":1006618,"n":"Ururu Kogururu","l":33,"q":2,"t":"Storm Lieutenant"}},{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1006619","obj":{"i":1006619,"n":"Dawson","l":33,"q":1}},{"type":"npc","id":"1006621","obj":{"i":1006621,"n":"Dawson","l":33,"q":2}},{"type":"npc","id":"1006624","obj":{"i":1006624,"n":"Injured Storm Private","l":33,"q":1}},{"type":"npc","id":"1006631","obj":{"i":1006631,"n":"Injured Storm Private","l":33,"q":1}},{"type":"npc","id":"1006632","obj":{"i":1006632,"n":"Dismayed Sailor","l":33,"q":1}},{"type":"quest","id":"66562","obj":{"i":66562,"n":"Pier Review","g":91,"l":"Western La Noscea","s":480}},{"type":"quest","id":"66564","obj":{"i":66564,"n":"To Catch a Cutthroat","g":91,"l":"Western La Noscea","s":480}},{"type":"quest","id":"66565","obj":{"i":66565,"n":"Serpent's Tongue-lashing","g":91,"l":"Western La Noscea","s":480}},{"type":"quest","id":"66566","obj":{"i":66566,"n":"Culling the Horde","g":91,"l":"Western La Noscea","s":480}},{"type":"quest","id":"66571","obj":{"i":66571,"n":"The Way the Crystals Crumble","g":91,"l":"Western La Noscea","s":480}}]}