{"quest":{"name":"Sibling Rivalry","location":"Western La Noscea","id":66567,"patch":2.0,"sort":480,"eventIcon":71221,"issuer":1006617,"target":1006617,"involved":[1006626,1006627],"genre":91,"journal":["Eilis requires you to supply the lines of Tidegate.","Eilis has asked you to deliver rations to the two tidegates. See one serving to the hands of Nortmoen in the north, and Sthalrhet to the south.","You have delivered both servings of rations and borne witness to the sibling rivalry forewarned. Notify Eilis that the provisions have reached their destinations.","While Eilis bemoans the brothers' bickering, she trusts the pair will work in lockstep when war comes to the wall."],"objectives":["Deliver Maelstrom rations to Nortmoen.","Deliver Maelstrom rations to Sthalrhet.","Report to Eilis."],"dialogue":[{"name":"EILIS","text":"Guarding a wall so vast as Tidegate requires the manpower of two brigades, and maintaining a unified defense requires they act in tandem."},{"name":"EILIS","text":"This task has been entrusted to the brigades of the brothers Nortmoen and Sthalrhet, yet I fear they hold each other in esteem far from fraternal, bickering over the slightest of unintended slights."},{"name":"EILIS","text":"And so I need ask an outsider, namely you, to bring provisions to Nortmoen of the north side and Sthalrhet of the south side, to allay any appearance of impropriety."},{"name":"EILIS","text":"We've set aside two perfectly equal sets of rations for them, though you'll likely have your hands full convincing them of that."},{"name":"NORTMOEN","text":"Aye, I am Nortmoen, adventurer. What business have you here?"},{"name":"NORTMOEN","text":"Ah, rations? An adventurer bearing rations is always welcome...but I cannot help but think you bear even more rations for my brother's men."},{"name":"STHALRHET","text":"If you have come looking for Sthalrhet, you've found him. Now, what of it?"},{"name":"STHALRHET","text":"Ah, but what is this you have brought us? Salted fish? You insult my men with brine-soaked brill while my brother dines on the fresh fruits of the sea?"},{"name":"EILIS","text":"I take it you witnessed their silly sibling rivalry firsthand, and now understand why some wonder whether the two can cooperate long enough to hold the wall."},{"name":"EILIS","text":"But nothing unites like a common enemy, and I have no doubt the brothers will set aside their petty differences when faced with the greater danger."}],"reward":{"gil":1857,"xp":13965},"reqs":{"jobs":[{"lvl":48,"id":1}],"quests":[66565]},"next":[66568]},"partials":[{"type":"npc","id":"1006617","obj":{"i":1006617,"n":"Eilis","l":33,"q":3,"t":"Storm Commander"}},{"type":"npc","id":"1006626","obj":{"i":1006626,"n":"Nortmoen","l":33,"q":4,"t":"Storm Captain"}},{"type":"npc","id":"1006627","obj":{"i":1006627,"n":"Sthalrhet","l":33,"q":3,"t":"Storm Captain"}},{"type":"quest","id":"66565","obj":{"i":66565,"n":"Serpent's Tongue-lashing","g":91,"l":"Western La Noscea","s":480}},{"type":"quest","id":"66568","obj":{"i":66568,"n":"Wag the Sea Dogs","g":91,"l":"Western La Noscea","s":480}}]}