{"quest":{"name":"All upon the Watchtowers","location":"Northern Thanalan","id":66578,"patch":2.0,"sort":245,"eventIcon":71201,"target":1006646,"involved":[1006644,1006645],"genre":0,"journal":["Sergeant Cracked Fist would make a parting request of you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Cracked Fist at Camp Bluefog.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have successfully delivered the message to both watchtowers. Continue on to the Ceruleum Processing Plant and report to Lieutenant Edelstein.","You have spoken with Lieutenant Edelstein, who informs you that the Flame General himself has arrived at the plant."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Cracked Fist at Camp Bluefog.</span>"],"dialogue":[{"name":"CRACKEDFIST","text":"Before you continue on your way, there is one more favor I would ask of you."},{"name":"CRACKEDFIST","text":"North of Camp Bluefog, approximately halfway to the Ceruleum Processing Plant, there stand two Alliance watchtowers. I would be grateful if you could bear a message to our sentries at each."},{"name":"CRACKEDFIST","text":"When the next phase of the operation commences, linkshell communications may be disrupted for a time. Should this happen, messages must be conveyed the old-fashioned way─on foot, or with fire."},{"name":"CRACKEDFIST","text":"The west watchtower is under the care of one Private Wymund, while the east is held by Private Hopeful Dawn. On my behalf, please remind them to be fully prepared for this eventuality."},{"name":"CRACKEDFIST","text":"Once you have visited both, continue north and then west to the Ceruleum Processing Plant. Lieutenant Edelstein, commander of the garrison, will be expecting you. Twelve speed your way."},{"name":"WYMUND","text":"Why, if it isn't [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! What brings you to my humble watchtower?"},{"name":"WYMUND","text":"...Linkpearls may cease to function, you say? Rest assured, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, we have an ample supply of torches and swift legs to spare. If there's a message that needs sending, it will be sent."},{"name":"HOPEFULDAWN","text":"&lt;gasp&gt; 'Tis an honor to meet ye in the flesh, [GC Rank][GC Rank][GC Rank]! Is there aught I can do fer ye?"},{"name":"HOPEFULDAWN","text":"...Provisions fer when the linkshell's out o' commission? I always make sure we've got a good store o' torches an' well-rested legs. The east watchtower's ready fer anythin', never ye fear!"},{"name":"EDELSTEIN","text":"Ah, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. Well met and welcome to my garrison."},{"name":"EDELSTEIN","text":"Battle preparations are proceeding well, I am pleased to say. The Flame General himself arrived a short while ago, and has been inspecting our troops."}],"reward":{"xp":28420},"reqs":{"jobs":[{"lvl":49,"id":130}],"quests":[66575]},"next":[66579]},"partials":[{"type":"npc","id":"1006646","obj":{"i":1006646,"n":"Edelstein","l":46,"q":8,"t":"Flame Lieutenant"}},{"type":"npc","id":"1006644","obj":{"i":1006644,"n":"Wymund","l":46,"q":1,"t":"Flame Private"}},{"type":"npc","id":"1006645","obj":{"i":1006645,"n":"Hopeful Dawn","l":46,"q":1,"t":"Flame Private"}},{"type":"quest","id":"66575","obj":{"i":66575,"n":"The Ladle in the Darkness","g":0,"l":"Northern Thanalan","s":244}},{"type":"quest","id":"66579","obj":{"i":66579,"n":"Hearts on Fire","g":0,"l":"Northern Thanalan","s":246}}]}