{"quest":{"name":"The Way the Crystals Crumble","location":"Western La Noscea","id":66571,"patch":2.0,"sort":480,"icon":100154,"eventIcon":71221,"issuer":1006614,"target":1007488,"genre":91,"journal":["Falkbryda would summon you to action.","Falkbryda asks you to infiltrate the Serpent's Tongue and use makeshift bombs to destroy the crystals, so that the Sahagin will have no means by which to summon Leviathan.","You have blown the crystals into a thousand thousand fragments. Report your success to Falkbryda.","Falkbryda thanks you for your part in preserving the peace. Let Radolf know that the Sahagin advance has been halted.","Now that the Sahagin menace has abated, the Scions may seek to remedy the other maladies of the realm."],"objectives":["Use the makeshift bombs to destroy the boxes of crystals.","Report to Falkbryda.","Report to Radolf."],"dialogue":[{"name":"FALKBRYDA","text":"The Serpent Reavers leave us no choice. The risk of the crystals falling into Sahagin hands is too great for us to remain idle. It comes time to act."},{"name":"FALKBRYDA","text":"So many are the crystals that we have no means of recovering them. We can only hope to destroy them."},{"name":"FALKBRYDA","text":"While losing the crystals is regrettable, we have far more to lose should Leviathan be summoned."},{"name":"FALKBRYDA","text":"Our forces will bombard the Reavers, drawing them out of their den so that you might slip in with these makeshift bombs and destroy the crystals."},{"name":"FALKBRYDA","text":"The Serpent's Tongue lies beyond Tidegate and the Sahagin Landbase, at the very heart of the enemy encampment."},{"name":"FALKBRYDA","text":"Our comrades will do their utmost to distract the enemy, but the explosions will surely draw the attention of nearby forces. Be prepared to defend yourself."},{"name":"FALKBRYDA","text":"Our triumphant hero returns! And I imagine it will be some time before the Serpent Reavers and the Sahagin rear their ugly heads again."},{"name":"FALKBRYDA","text":"More importantly, we needn't worry about Leviathan rearing his head."},{"name":"FALKBRYDA","text":"The Maelstrom, and indeed all of Limsa Lominsa, owes you a debt of gratitude. And please send my regards to Radolf!"},{"name":"RADOLF","text":"Ah, <span class=\"highlight\">Forename</span>, so good of you to return. Tales of your deeds precede you!"},{"name":"RADOLF","text":"Knowing Limsa Lominsa lay in good hands allowed us to tend to matters of import elsewhere, but I am relieved to have you back with us all the same. Much work remains for the realm."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"gil":1857,"items":[{"id":4264,"one":1},{"id":4258,"one":1},{"id":4262,"one":1},{"num":2,"id":5826,"one":1}],"xp":13965},"reqs":{"jobs":[{"lvl":48,"id":1}],"quests":[66563]}},"partials":[{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1007488","obj":{"i":1007488,"n":"Radolf","l":356,"q":2}},{"type":"item","id":"4264","obj":{"i":4264,"n":"Amber Earrings","l":49,"c":55225,"t":41}},{"type":"item","id":"4258","obj":{"i":4258,"n":"Rubellite Earrings","l":49,"c":55222,"t":41}},{"type":"item","id":"4262","obj":{"i":4262,"n":"Tourmaline Earrings","l":49,"c":55224,"t":41}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"66563","obj":{"i":66563,"n":"Long Walk off a Short Pier","g":91,"l":"Western La Noscea","s":480}}]}