{"quest":{"name":"No Sea Wasp for You","location":"Western La Noscea","id":66570,"patch":2.0,"sort":480,"eventIcon":71221,"issuer":1006627,"target":1006627,"genre":91,"journal":["Sthalrhet hopes to send you out on a hunt.","Sthalrhet asks you to eradicate sea wasps so that his brother will not have the opportunity to delight in them.","Deliver the sea wasps you have culled to Sthalrhet.","Sthalrhet savors his brother's misfortune, and is happy to give the sea wasps to anyone who is not Nortmoen."],"objectives":["Slay sea wasps and obtain their rotting umbrellas.","Deliver the rotting umbrellas to Sthalrhet."],"dialogue":[{"name":"STHALRHET","text":"You seem an adventurer in need of work, and here I am a man in need of dead sea wasps. Perhaps we might help each other."},{"name":"STHALRHET","text":"Mind you, I've no interest in chewing on the viscous vermin myself, but my brother can't seem to get enough of them, the uncouth cad."},{"name":"STHALRHET","text":"I'll not stand to watch him stuff his gob full of those prickly pests one more day! Ah, what I wouldn't give to see the look on his face when I tell him you've hunted down all his precious sea wasps! But don't expect me to reward you without proof─I'll need to see their rotting carcasses first."},{"name":"STHALRHET","text":"I trust you're busy delivering those sea wasp souls to the deep? Just make sure you don't give their corpses to my brother!"},{"name":"STHALRHET","text":"Now this is what I deem a proper slaughter! Excellent."},{"name":"STHALRHET","text":"All that remains is to determine how to dispose of the wretched things. I suppose there must be somebody in my brigade that can stomach them..."}],"reward":{"items":[{"id":4164,"one":1},{"id":4166,"one":1},{"id":4158,"one":1},{"num":2,"id":5826,"one":1}],"xp":13965},"reqs":{"jobs":[{"lvl":48,"id":1}]}},"partials":[{"type":"npc","id":"1006627","obj":{"i":1006627,"n":"Sthalrhet","l":33,"q":3,"t":"Storm Captain"}},{"type":"item","id":"4164","obj":{"i":4164,"n":"Spinel Bracelet","l":48,"c":55628,"t":42}},{"type":"item","id":"4166","obj":{"i":4166,"n":"Turquoise Bracelet","l":48,"c":55624,"t":42}},{"type":"item","id":"4158","obj":{"i":4158,"n":"Zircon Bracelet","l":48,"c":55627,"t":42}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}}]}