{"quest":{"name":"A Hero in Need","location":"Western Thanalan","id":66573,"patch":2.0,"sort":243,"icon":100156,"eventIcon":71201,"issuer":1006578,"target":1006638,"genre":1,"journal":["The Allied communications officer has a task that can only be performed by a hero of the Alliance.","The Allied communications officer informs you that the Alliance garrison at Camp Bluefog is in low spirits and would be better for a hero's visit. Make your way to the camp in northern Thanalan, and make yourself at the disposal of Sergeant Cracked Fist.","Arriving at Camp Bluefog, you present yourself to Sergeant Cracked Fist, who wastes no time beseeching your help in raising the morale of the garrison. The duty of a hero is truly manifold."],"objectives":["Report to Cracked Fist at Camp Bluefog."],"dialogue":[{"name":"KANRIKAN","text":"Phase two of the operation is presently in motion. Our brothers and sisters of the Maelstrom are holding their own against Garlean forces upon Vylbrand and the Rhotano Sea. Ere long, the third phase will begin and you must take to the field once more."},{"name":"KANRIKAN","text":"The Immortal Flames shall strike at Castrum Meridianum by way of a diversionary maneuver. While the Garleans are thus locked in battle, you are to infiltrate the stronghold and bring down the magitek field that surrounds the Praetorium."},{"name":"KANRIKAN","text":"The staging point for the mission lies in the shadow of Castrum Meridianum in northern Thanalan, and that is where you must go. On your way there, however, I would ask that you make a brief stop at Camp Bluefog, one of our key outposts in the area."},{"name":"KANRIKAN","text":"The garrison, I am told, is in low spirits, and it would do our troops well to see the hero of Cape Westwind appear before them. For the good of our cause, please stoke the fire in their hearts."},{"name":"KANRIKAN","text":"En route to Castrum Meridianum, please make a brief stop at Camp Bluefog. Our troops there are in low spirits, and it would give them heart if the hero of Cape Westwind were to appear before them."},{"name":"CRACKEDFIST","text":"Ah, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! Yours is a most welcome presence here at Camp Bluefog!"},{"name":"CRACKEDFIST","text":"Logistically speaking, we are ready to march on Castrum Meridianum at a moment's notice. Alas, while our troops are here in body, their minds are anywhere but."},{"name":"CRACKEDFIST","text":"The garrison's mood is dark, so daunting is the prospect of joining what may prove to be the bloodiest battle in history. But with a hero such as you walking among them, we may yet rekindle the dwindling embers within their souls."}],"reward":{"items":[{"id":31337}],"xp":28420},"reqs":{"jobs":[{"lvl":49,"id":130}],"quests":[70057]},"next":[66575,69408]},"partials":[{"type":"npc","id":"1006578","obj":{"i":1006578,"n":"Allied Communications Officer","l":42,"q":4}},{"type":"npc","id":"1006638","obj":{"i":1006638,"n":"Cracked Fist","l":46,"q":3,"t":"Flame Sergeant"}},{"type":"item","id":"31337","obj":{"i":31337,"n":"Level 49 Weapon Coffer","l":1,"c":26557,"t":61}},{"type":"quest","id":"70057","obj":{"i":70057,"n":"Operation Archon","g":1,"l":"The Waking Sands","s":242}},{"type":"quest","id":"66575","obj":{"i":66575,"n":"The Ladle in the Darkness","g":0,"l":"Northern Thanalan","s":244}},{"type":"quest","id":"69408","obj":{"i":69408,"n":"Hearts on Fire","g":1,"l":"Northern Thanalan","s":246}}]}