{"quest":{"name":"The Ladle in the Darkness","location":"Northern Thanalan","id":66575,"patch":2.0,"sort":244,"eventIcon":71201,"target":1006638,"involved":[1006578,1006639,1006640,1006641],"genre":0,"journal":["Sergeant Cracked Fist needs a hero to make a stew.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Cracked Fist at Camp Bluefog.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have obtained enough basilisk meat. Take it to the cookfire just outside Camp Bluefog's northern gate, and add it to the bubbling cauldron.","It will take a little while for the meat to be cooked through. Watch the cauldron until the stew is ready.","Your keen instincts tell you that the basilisk stew is now ready. Scoop it from the bubbling cauldron.","You have three steaming bowls of basilisk stew expertly balanced in your hands. Make your way around Camp Bluefog and give them to the neediest soldiers.","You have doled out all of the basilisk stew, which seems to have had the desired effect. Report your success to Sergeant Cracked Fist.","A jubilant Sergeant Cracked Fist thanks you for inspiriting his troops. They now remember their purpose, and stand ready to do their part in the impending phase of the operation."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Cracked Fist at Camp Bluefog.</span>","(Obtain three pieces of basilisk meat)","(Put meat in the stew pot)","(Interact with stew pot)","(Take stew)"],"dialogue":[{"name":"CRACKEDFIST","text":"I have a favor to ask of you, as a fellow comrade of the Alliance. As I mentioned, the garrison's mood is dark. The fault, it pains me to admit, is partly mine."},{"name":"CRACKEDFIST","text":"I am no veteran of large-scale campaigns, you see, and the men and women under me are nervous for this knowledge."},{"name":"CRACKEDFIST","text":"Seeking to lift their spirits, I remembered the tale of a Gridanian general from a century past. Vainchelon was his name, and he was a lancer of great renown. History holds that, in spite of his rank, he would regularly cook meals for his troops while afield."},{"name":"CRACKEDFIST","text":"Most generals know to break bread with their own men on occasion to foster camaraderie, but Vainchelon took it one step further. By actually <span class=\"emphasis\">making</span> that bread, he showed that he was truly one of them─a hero <span class=\"emphasis\">and</span> a comrade."},{"name":"CRACKEDFIST","text":"Though I wouldn't presume to compare myself to a man of his stature, I thought it might be well to at least emulate the deed. To be sure, this is a testament to my desperation."},{"name":"CRACKEDFIST","text":"I had begun making preparations for basilisk stew, all the while wondering whether it would be any good, when an honest-to-gods hero appeared. I speak of <span class=\"emphasis\">you</span>, of course."},{"name":"CRACKEDFIST","text":"My gratitude would know no bounds if you could take up the ladle in my stead. The stew is just about ready─all it needs is some basilisk meat, which can be readily had north of here. Please procure the meat and add it to the cauldron bubbling just outside the camp."},{"name":"CRACKEDFIST","text":"When the stew is ready, I would ask that you also distribute it among our troops. Receiving the stew from you is certain to give them heart. I doubt I can say the same were it to come from my hands."},{"name":"ZEZERAGI","text":"Brrr... It's always so dark here...and <span class=\"emphasis\">cold</span>... Maybe I shouldn't have enlisted... It's not like killing Garleans will bring my friend back..."},{"name":"ZEZERAGI","text":"Mmmmmm, this smells <span class=\"emphasis\">good</span>...<br>&lt;gasp&gt; Aren't you the adventurer who triumphed at Cape Westwind? To think that a hero fights beside us! And this stew, it whets my appetite for vengeance! Just you wait, you Garlean whoresons! I'm coming for your heads! Muahahaha!"},{"name":"ADELENA","text":"Gods, this is all so hopeless! The Garleans are going to crush us with their steel monstrosities! We're all going to die! &lt;sob&gt;"},{"name":"ADELENA","text":"I'm...I'm so sorry. I don't know what came over me. Your words and this hearty stew have given me courage. Yes, a fire positively <span class=\"emphasis\">burns</span> in my belly! ...Or is it just the basilisk venom?"},{"name":"BETYN","text":"I-I think I'll pretend to be sick. That way I won't have to fight. Maybe they'll even send me home to my family. It's not as if one man would make a difference, right?"},{"name":"BETYN","text":"<span class=\"emphasis\">You</span> made this stew...for <span class=\"emphasis\">me</span>? I...I never dreamed that I would share a meal with a hero, let alone partake of something <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> <span class=\"emphasis\">made</span>. I wanted to be a hero, too, you know─to my family. I took up arms because I wanted to protect them...and I <span class=\"emphasis\">will</span>! I won't run─not today, nor any other!"},{"name":"CRACKEDFIST","text":"Your basilisk stew has done wonders for our troops' morale! I cannot thank you enough!"},{"name":"CRACKEDFIST","text":"The seeming hopelessness of the situation─not to mention this accursed gloom─had dampened their spirits, and for a time they had forgotten their purpose. But your presence and culinary skills helped them to remember, and I'm confident they will do their part to protect the realm and their loved ones."}],"reward":{"xp":28420},"reqs":{"jobs":[{"lvl":49,"id":130}],"quests":[66573]},"next":[66576,66578]},"partials":[{"type":"npc","id":"1006638","obj":{"i":1006638,"n":"Cracked Fist","l":46,"q":3,"t":"Flame Sergeant"}},{"type":"npc","id":"1006578","obj":{"i":1006578,"n":"Allied Communications Officer","l":42,"q":4}},{"type":"npc","id":"1006639","obj":{"i":1006639,"n":"Zezeragi","l":46,"q":1,"t":"Flame Private"}},{"type":"npc","id":"1006640","obj":{"i":1006640,"n":"Adelena","l":46,"q":1,"t":"Flame Private"}},{"type":"npc","id":"1006641","obj":{"i":1006641,"n":"Betyn","l":46,"q":1,"t":"Flame Private"}},{"type":"quest","id":"66573","obj":{"i":66573,"n":"A Hero in Need","g":1,"l":"Western Thanalan","s":243}},{"type":"quest","id":"66576","obj":{"i":66576,"n":"Crate Expectations","g":93,"l":"Northern Thanalan","s":490}},{"type":"quest","id":"66578","obj":{"i":66578,"n":"All upon the Watchtowers","g":0,"l":"Northern Thanalan","s":245}}]}