{"quest":{"name":"Setting the Stage","location":"Northern Thanalan","id":66582,"patch":2.0,"sort":247,"eventIcon":71201,"target":1006657,"genre":0,"journal":["Lieutenant Edelstein has an urgent request ahead of the next phase of the operation.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Edelstein at the Ceruleum Processing Plant.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have sufficiently thinned out the imperial presence at Raubahn's Push. Proceed to the operation's staging point and report to Raubahn.","You find the Flame General standing in the shadow of Castrum Meridianum. The final battle for the future of Eorzea will soon be joined."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Edelstein at the Ceruleum Processing Plant.</span>","Defeat three magitek vanguards and three imperial soldiers."],"dialogue":[{"name":"EDELSTEIN","text":"A short while ago, the Flame General struck for Castrum Meridianum. Alas, no sooner did his contingent gain the resistance line than an imperial patrol fell upon them."},{"name":"EDELSTEIN","text":"We are informed that they successfully won through, but enemy patrols yet linger in the area. Our main host could easily crush their like, to be sure, but we dare not deploy them at this juncture lest we prematurely stir the hornet's nest."},{"name":"EDELSTEIN","text":"That the operation might proceed unhampered, I would have you thin out the imperial presence at Raubahn's Push. It should suffice if you were to vanquish three each of their vanguards and foot soldiers."},{"name":"EDELSTEIN","text":"Once you have accomplished this, pray join the Flame General at the operation's staging point. May Rhalgr give you strength!"},{"name":"RAUBAHN","text":"I see you've cleared the way for the main host. My thanks. I might've given the task to another rather than risk your neck before the mission, but what's done is done. Besides, it probably served to loosen up your joints."},{"name":"RAUBAHN","text":"This is it, <span class=\"highlight\">Forename</span>─the moment of reckoning. Eorzea's future hinges upon our deeds this day."}],"reward":{"xp":28420},"reqs":{"jobs":[{"lvl":49,"id":130}],"quests":[66579]},"next":[66672]},"partials":[{"type":"npc","id":"1006657","obj":{"i":1006657,"n":"Raubahn","l":46,"q":4}},{"type":"quest","id":"66579","obj":{"i":66579,"n":"Hearts on Fire","g":0,"l":"Northern Thanalan","s":246}},{"type":"quest","id":"66672","obj":{"i":66672,"n":"Rock the Castrum","g":0,"l":"Northern Thanalan","s":248}}]}