{"quest":{"name":"Curious Gorge Goes to Wineport","location":"Eastern La Noscea","id":66587,"patch":2.0,"sort":3,"icon":100109,"unlocksFunction":1,"eventIcon":71341,"issuer":1006746,"target":1006746,"involved":[1006764,1006768,1006783],"genre":149,"journal":["Curious Gorge would share with you a shocking revelation about his tribe's past.","Curious Gorge has revealed to you his tribe's tragic history. It turns out that his ancestors came to be shunned when the people they would protect came to view the warriors themselves as beasts more savage than the fiends they would slay. Vowing to win back his tribe's good name by his own hand, Curious Gorge asks you to assist him in the defense of the village of Wineport. Travel there and receive a briefing from the militia captain.","Curious Gorge will lead the defense at the west gate, while you have been tasked with defending the east. Keep lookout and let not a single fiend into the village!","The fiends have been driven off and the east gate secured. Report to the militia captain.","Despite his efforts on the village's behalf, Curious Gorge received not a hero's welcome, but a reception worthy of the most terrible of monsters. Might the captain have some insight into the source of the people's fear?","The militia captain expresses his gratitude for your efforts and assures you that he will clear up the villagers' misunderstanding regarding Curious Gorge. Return to Hidden Falls and reunite with your mentor.","Having regained his composure, Curious Gorge theorizes that a misunderstanding like unto that which arose at Wineport might be at the root of his tribe's disgrace. He would ask you to continue training while he continues to scour the ancient words for further insight.<br><br>※The next warrior quest will be available from Curious Gorge upon reaching level 45."],"objectives":["Speak with the militia captain in Wineport.","Defend the eastern gate from attackers.","Report to the militia captain.","Consult with the militia captain.","Speak with Curious Gorge."],"dialogue":[{"name":"CURIOUSGORGE","text":"Hello again, my friend. It is quite obvious that you have been anything but idle in your training since last we met. Your progress is heartening to look upon, truly...but it also serves to remind me that each hour I spend poring over ancient texts is an hour not spent honing my skills.<br>I fear my worth on the battlefield is diminishing by the day."},{"name":"CURIOUSGORGE","text":"Yet I am certain that my studies of the chronicles will yield something of use. In fact, just last night, I discovered how the warriors of my tribe came to be shunned by the outside world."},{"name":"CURIOUSGORGE","text":"Upon witnessing my people's prowess with the axe, the armies of the city–states began to incorporate similar techniques into their own training regimens. These are the selfsame techniques I have been instructing <span class=\"emphasis\">you</span> in, <span class=\"highlight\">Forename</span>─ones which call upon the inner beast."},{"name":"CURIOUSGORGE","text":"The consequences, of course, were dire. Yes, their soldiers became nigh on unstoppable, but they also became wholly uncontrollable...and both friend and foe fell prey to the ensuing carnage. Of course, the heads of the city–states laid the blame for these atrocities solely at the feet of my kind, promptly banning the ancient art and imprisoning anyone suspected of teaching it. Or so the chronicles say..."},{"name":"CURIOUSGORGE","text":"What I find hard to grasp, though, is that never once during my training did my brother hint at this dark history. Nor have I myself ever seen one of my tribe succumb to the rage that the chronicles describe."},{"name":"CURIOUSGORGE","text":"Could it be that the tales are mere falsehoods? Stories concocted by some long-forgotten enemy who would poison our heritage and befoul our tribe's name? Who in their right mind would seek to sully something so pure...and why would my ancestors simply bow their heads and suffer such ignominy!?"},{"name":"CURIOUSGORGE","text":"That my people should be so <span class=\"emphasis\">weak</span>─so utterly bereft of pride─is inexplicable. I refuse to believe it!"},{"name":"CURIOUSGORGE","text":"It matters not if these claims are groundless─if they prompted my tribe's art to fade into obscurity, then the damage has already been done. Well, I for one will not turn a blind eye to this injustice! If none of my people will give the lie to the stories that have so tarnished our reputation, it shall have to be me!"},{"name":"CURIOUSGORGE","text":"Ah, but once again I lose myself in history and forget the present. If you recall, I spoke to you of my former comrade from the Company of Heroes, and the great wooly beast we have been pursuing."},{"name":"CURIOUSGORGE","text":"The beast remains on the loose, and to toss a ponze of salt on the wound, fell creatures that appear to be its minions have been wreaking havoc on the innocent residents of Wineport."},{"name":"CURIOUSGORGE","text":"Were you and I to succeed in quelling the threat, surely the people would see that warriors are no fearsome beasts, but valuable allies. Together, <span class=\"highlight\">Forename</span>, we will win back our proud name! Now, let us away to Wineport to meet with the captain of the militia!"},{"name":"LAEDER","text":"My friends. Wineport is much obliged for your aid. The fiends come relentlessly, and what few able-bodied men we have find themselves hopelessly overmatched. Indeed, the western gates have been so besieged that they are currently left without any manned defense."},{"name":"CURIOUSGORGE","text":"Leave the defense to us, my good man! I will secure the western gate."},{"name":"CURIOUSGORGE","text":"<span class=\"highlight\">Forename</span>, you defend the town from the east. Together, we will form a bulwark that not a single fiend can penetrate!"},{"name":"CURIOUSGORGE","text":"Once the enemy has been driven back, we return here to back up the captain. Got it, <span class=\"highlight\">Forename</span>?"},{"name":"LAEDER","text":"<span class=\"highlight\">Forename</span>, was it? I will stand guard here. You head north and cut the monsters off at the pass."},{"name":"LAEDER","text":"Thank the Twelve you're safe! We have need of your skills yet. I just heard a scream, and I fear that one of the beasts might be loose within the village. Come with me!"},{"name":"SARRA","text":"You monster! Get away! Get away!"},{"name":"CURIOUSGORGE","text":"M-Monster...? But I... I..."},{"name":"CURIOUSGORGE","text":"Come no closer, <span class=\"highlight\">Forename</span>!"},{"name":"CURIOUSGORGE","text":"I...beg of you..."},{"name":"CURIOUSGORGE","text":"I... I must return to the Falls."},{"name":"LAEDER","text":"Whatever has gotten into Curious Gorge?"},{"name":"LAEDER","text":"'Tis true that he fought like a man possessed, but to mistake him for the very beast he hunts─methinks the child's parents have been feeding her a few too many ghost stories for her own good."},{"name":"LAEDER","text":"Worry not, friend. I shall speak to the villagers and clear up this most unfortunate misunderstanding. Do return to the Falls and assure Curious Gorge that Wineport is indebted to him for his aid."},{"name":"CURIOUSGORGE","text":"<span class=\"highlight\">Forename</span>... Please forgive me for leaving so abruptly earlier."},{"name":"CURIOUSGORGE","text":"It was a hasty reaction to a situation for which I was completely unprepared."},{"name":"CURIOUSGORGE","text":"While both you and I know that I was in complete control of my inner beast, I now realize that to the layman's eye, it may have seemed that...well, the opposite was true."},{"name":"CURIOUSGORGE","text":"Mayhap it was this very misapprehension that lent weight to the lies which led to my tribe's disgrace. And if that is the case, then perhaps I should return once more to the chronicles, and endeavor to reassess their message in light of this discovery."},{"name":"CURIOUSGORGE","text":"Speaking of light... Your soul crystal, <span class=\"highlight\">Forename</span>...it sparkles."},{"name":"CURIOUSGORGE","text":"Does the Soul of the Warrior have aught to reveal to you?<br>Any whispers of...of import?"},{"name":"CURIOUSGORGE","text":"&lt;sigh&gt; If only they hadn't forsaken me, as they did my brother..."},{"name":"CURIOUSGORGE","text":"Ahem! Yes, well, I suppose that is that. I must continue my studies, and you your training. I hope to have something new for both of us very soon. Until then, my friend."},{"name":"SYSTEM","text":"The warriors of ages past have borne witness to your stone-like tenacity.<br>They now grant you their undying strength!"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":16462,"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":22}],"quests":[66586]},"next":[66588]},"partials":[{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1006764","obj":{"i":1006764,"n":"Wineport Militia Captain","l":32,"q":1}},{"type":"npc","id":"1006768","obj":{"i":1006768,"n":"Wineport Militia Captain","l":32,"q":1}},{"type":"npc","id":"1006783","obj":{"i":1006783,"n":"Wineport Militia Captain","l":32,"q":1}},{"type":"action","id":"16462","obj":{"i":16462,"n":"Mythril Tempest","c":2565,"j":21,"t":3,"l":40}},{"type":"quest","id":"66586","obj":{"i":66586,"n":"Embracing the Beast","g":149,"l":"Eastern La Noscea","s":2,"f":1}},{"type":"quest","id":"66588","obj":{"i":66588,"n":"Looking the Part","g":149,"l":"Eastern La Noscea","s":4,"f":1}}]}