{"quest":{"name":"Embracing the Beast","location":"Eastern La Noscea","id":66586,"patch":2.0,"sort":2,"icon":100109,"unlocksFunction":1,"eventIcon":71341,"issuer":1006746,"target":1006746,"involved":[1004962,1006288,1006735],"genre":149,"journal":["Curious Gorge is struggling to decipher the ancient texts.","Curious Gorge has been unable to glean much wisdom from the ancient tome, but would proceed with your training nonetheless. He has tasked you with the slaying of a giant sandworm rumored to reside in the Sagolii Desert. Stop off at Forgotten Springs and ask the inhabitants there if they have seen the creature.","According to the residents of Forgotten Springs, the sandworm you seek was last seen preying on a band of unfortunate merchants in the Sagolii Desert. Seek out an area that shows vestiges of a massacre and fell the immense beast.","The sandworm is no more. Return to Hidden Falls and inform Curious Gorge that you have completed your trial.","In the course of your battle with the sandworm, your inner beast has awakened further, imparting to you yet another technique of your forebears. Master the newfound skill at your disposal, that you will be prepared to continue your training once your mentor has deciphered the ancient texts.<br><br>※The next warrior quest will be available from Curious Gorge upon reaching level 40."],"objectives":["Speak with residents of Forgotten Springs.","Slay the giant sandworm in the Sagolii Desert.","Report to Curious Gorge."],"dialogue":[{"name":"CURIOUSGORGE","text":"Welcome back, my friend. I can see that you've not neglected your training. For my part, I fear that deciphering the ancient chronicles of my people is proving to be a much more demanding task than I had imagined."},{"name":"CURIOUSGORGE","text":"Mind you, it hasn't helped that I've been somewhat preoccupied of late. A comrade of mine from my days in the Company of Heroes asked me to do a favor, and it's taken me back and forth across the realm like some bloody ferry."},{"name":"CURIOUSGORGE","text":"I'm on a hunt for some mysterious feral beast that's been terrorizing smallfolk. People don't know where this monstrosity came from, but witnesses say its thirst for blood is unlike anything they've ever seen."},{"name":"CURIOUSGORGE","text":"Unfortunately, the time I have spent in pursuit of the beast is time I have not spent studying the chronicles, and I am sorry to say I have made little progress."},{"name":"CURIOUSGORGE","text":"However, while on the road, I was able to decipher one passage that may be of interest to us both. From what I can gather, the chronicles tell of an ancient set of armor forged by my ancestors in the flames of the seven hells, and inscribed with the same arcane incantations that adorn the Soul of the Warrior."},{"name":"CURIOUSGORGE","text":"It would seem that this mighty armor was passed down from hero to apprentice for centuries, until one man, driven by rage and vainglory, cast all five pieces from Abalathia's highest peak. Since that day, the armor has remained lost...and with it, the power that it harbors."},{"name":"CURIOUSGORGE","text":"As far as I can make out, the next passage in the chronicles concerns the whereabouts of these missing artifacts...though I have only been able to make sense of the odd word thus far. Still, I must confess to some excitement. Imagine what a warrior clad in such garb could achieve!"},{"name":"CURIOUSGORGE","text":"Ah, if only my brother were here... We could decipher the text together and spread the teachings of our people to the entire realm!"},{"name":"CURIOUSGORGE","text":"Alas, he is not. His whereabouts are as hidden to me as those of the ancient armor. I would have liked you to meet him...if only so that you could have looked upon a true warrior."},{"name":"CURIOUSGORGE","text":"Well, perhaps you still shall. Eorzea is not as large as most people perceive. Paths cross, fates intertwine. Such is the will of the Spinner. It may be that my brother has chosen a similar path to mine... But I have rambled long enough. You are here to take the next step in your training, and so I shall oblige."},{"name":"CURIOUSGORGE","text":"In the southern reaches of Thanalan is the Sagolii Desert, a godsforsaken wasteland of naught but sand that stretches as far as the eye can see. It is here that the leviathan of the dunes lurks─a sandworm of gargantuan proportions."},{"name":"CURIOUSGORGE","text":"When facing this mammoth creature, you will soon realize that the feeble hacks and slashes of your puny axe are ill-suited to the task of felling such a foe...but do not let this dissuade you. Wake the slumbering beast within and summon forth a strength that transcends the limits of your physical form."},{"name":"CURIOUSGORGE","text":"Mind you, first you'll have to <span class=\"emphasis\">find</span> the beast, and that might prove a tall order in itself. The U tribe that inhabits Forgotten Springs is wise to the movements of the denizens of the desert. Should you want for guidance, I'd wager they could set you in the right direction."},{"name":"URALKA","text":"Aye, I've seen the beast. Stands three malms high, he does, and stirs up sandstorms with each writhe and wriggle. Showed up in my hunting fields some years ago, and has been swallowing up my would-be prey in that gaping maw of his ever since."},{"name":"UGOROMULI","text":"The leviathan of the dunes? Saw the fearsome bugger not a week ago, preying on a group of merchants south of Byregot's Strike. The smart ones dropped their wares, turned tail, and ran. The dumb ones, well, at least they can say they died rich."},{"name":"UKHUBATIA","text":"Sandworms are particularly sensitive to vibrations in the earth, such as those made by running. If you're looking to summon one of the beasts, then I suggest you search for their tracks, then run about making as much of a clamor as possible. I would also suggest you seek a cure for your madness."},{"name":"CURIOUSGORGE","text":"Ah, <span class=\"highlight\">Forename</span>. Your crystal grows ever stronger. In felling the raging sandworm, the beast within you slowly but surely rouses to wakefulness."},{"name":"CURIOUSGORGE","text":"When next you do battle, methinks you will find yourself capable of movements heretofore unfamiliar to you. When you have mastered your new talents, return to me. In the meanwhile, I shall continue my study of the ancient texts."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":49,"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":22}],"quests":[66585]},"next":[66587]},"partials":[{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1004962","obj":{"i":1004962,"n":"U'goromuli","l":45,"q":2}},{"type":"npc","id":"1006288","obj":{"i":1006288,"n":"U'khuba Tia","l":45,"q":4}},{"type":"npc","id":"1006735","obj":{"i":1006735,"n":"U'towali","l":45,"q":1}},{"type":"action","id":"49","obj":{"i":49,"n":"Inner Beast","c":2553,"j":21,"t":3,"l":35}},{"type":"quest","id":"66585","obj":{"i":66585,"n":"Pride and Duty (Will Take You from the Mountain)","g":149,"l":"Limsa Lominsa","s":1,"f":1}},{"type":"quest","id":"66587","obj":{"i":66587,"n":"Curious Gorge Goes to Wineport","g":149,"l":"Eastern La Noscea","s":3,"f":1}}]}