{"quest":{"name":"Pride and Duty (Will Take You from the Mountain)","location":"Limsa Lominsa","id":66585,"patch":2.0,"sort":1,"icon":100109,"unlocksFunction":1,"eventIcon":71341,"issuer":1000927,"target":1006746,"involved":[1006761,1006762,1006763],"genre":149,"journal":["Axemaster Wyrnzoen needs an adventurer he can trust.","An old comrade of Wyrnzoen's, now in the employ of Master Gegeruju of Costa del Sol, has sent an urgent call for reinforcements, and the axemaster believes you to be the only marauder up to the task. Travel to Costa del Sol and rendezvous with your guildmate Solkwyb.","Solkwyb explains that Costa del Sol has been beset by a fearsome horde of turtles, and that the creatures seem to be originating from the northern shore. Investigate any possible cause of the beasts' burgeoning numbers.","With the assistance of a formidable Roegadyn calling himself Curious Gorge, you have driven back the turtle horde that appeared to have been summoned forth by a suspicious figure. Speak to your guildmate Solkwyb, who appears unnerved by what she has seen.","Solkwyb suspects that Curious Gorge's true identity is that of a gifted young marauder who disappeared when the Company of Heroes was disbanded. Should you wish to train in the lost art of the warrior, seek out Curious Gorge at Hidden Falls.","Duly impressed by your strength, Curious Gorge presents you with the Soul of the Warrior. When your inner beast awakens, he explains, the runes will resonate, granting you such strength as you never thought possible. Hone your skills until such time as Curious Gorge can decipher the chronicles of his ancestors that he carries with him, and thereby continue your training.<br><br>※The next warrior quest will be available from Curious Gorge upon reaching level 35."],"objectives":["Speak with Solkwyb in Costa del Sol.","Investigate the northern shore.","Speak with Solkwyb.","Speak with Curious Gorge.","Fend off the crazed archelons!"],"dialogue":[{"name":"WYRNZOEN","text":"Ah, <span class=\"highlight\">Forename</span>. Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see. Aye, it's plain as day that you've no equal in our guild, and I've a task that I'd entrust to no ordinary marauder."},{"name":"WYRNZOEN","text":"To wit: I just received a message from an old comrade-in-arms of mine who now serves as a guardsman in Costa del Sol. It would seem the fighting's grown fierce in those parts, and he finds himself in dire need of reinforcements."},{"name":"WYRNZOEN","text":"Mind you, this man is no white-livered whelp. He can wield an axe with the best of them, as evidenced by Master Gegeruju's paying good coin for the services of he and his men. No, any enemy who could fluster that bunch is not one to be trifled with."},{"name":"WYRNZOEN","text":"I've sent Solkwyb on ahead to tend to the wounded. Seek her out upon your arrival and she'll apprise you of the situation at hand."},{"name":"SOLKWYB","text":"<span class=\"highlight\">Forename</span>! Ever the sight for sore eyes. A nasty bale of turtles has been preying on this area of late, snapping and gnashing at everything in sight. Why, even the best men that Master Gegeruju could buy find themselves no match for the creatures."},{"name":"SOLKWYB","text":"Word has it that the beasts have been sighted swimming in from the lightly guarded northern shore. I would send you there to investigate the cause behind their burgeoning numbers."},{"name":"SOLKWYB","text":"Ugh, damn it all! <span class=\"highlight\">Forename</span>, we must see to these beasts!"},{"name":"SOLKWYB","text":"Seven hells, there's no end to them! Prepare to fall back!"},{"name":"CURIOUSGORGE","text":"(-???-)I'll see to the shellbacks! You whelps just try not to end up as turtle grub!"},{"name":"SOLKWYB","text":"That axe! I've not seen its like in..."},{"name":"SOLKWYB","text":"<span class=\"highlight\">Forename</span>! We must do what we can!"},{"name":"CURIOUSGORGE","text":"That should send 'em scuttling back to their nests. You can call me Curious Gorge─one remark about the name and I'll rip yer ugly heads from your shoulders and suck the marrow out of your twitching spines. You two are guards from Costa del Sol, I reckon?"},{"name":"SOLKWYB","text":"Not as such. We are of the Marauders' Guild, sent here by Axemaster Wyrnzoen to assist in the defense. I am Solkwyb, and this is my comrade <span class=\"highlight\">Forename</span>."},{"name":"CURIOUSGORGE","text":"From the guild, you say? Well, blow me down and call me a bogy! Had you told me sooner, I'd have introduced myself with proper respect."},{"name":"CURIOUSGORGE","text":"You're <span class=\"highlight\">Forename</span>, right? We've only just met, but I see in you a strength not found in ordinary <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span>. What say you unleash the beast within and become a <span class=\"emphasis\">warrior</span> with me?"},{"name":"SOLKWYB","text":"A <span class=\"emphasis\">warrior</span>, you say!? So it <span class=\"emphasis\">was</span> you I saw, brandishing battle techniques I had thought lost to the sands of time..."},{"name":"CURIOUSGORGE","text":"Lost? Gahaha! Perhaps in <span class=\"emphasis\">these</span> parts. But where I come from, the way of the warrior is alive and well! My tribe has been handing them down for thousands of years."},{"name":"CURIOUSGORGE","text":"Yet our numbers dwindle with every new summer, and this is why I left the mountain where I was raised to come here. What say you, <span class=\"highlight\">Forename</span>? If you would walk the path of the warrior with me, seek me out at Hidden Falls."},{"name":"SOLKWYB","text":"The warriors of old... We have all heard the tales, but never once did I dream that I would meet one in the flesh."},{"name":"SOLKWYB","text":"My memory is cloudy, but many years ago, it was said there was a young marauder in the Company of Heroes who would unleash crushing blows theretofore unseen by his comrades. When the Company disbanded, he vanished, never to be seen again─might that be this Curious Gorge?"},{"name":"SOLKWYB","text":"I cannot vouch for the man's identity, but there can be no denying the display of strength we saw today, nor that he has taken a liking to <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>. This could be an opportunity for the ages. Hidden Falls, was it? Were I in your boots, I would head off there without delay."},{"name":"CURIOUSGORGE","text":"I knew you would come, <span class=\"highlight\">Forename</span>. Let us begin."},{"name":"CURIOUSGORGE","text":"Any <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> can take up an axe and call <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> a marauder, but to become a true warrior, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> must prove <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> can tame the inner beast that guides the blade."},{"name":"CURIOUSGORGE","text":"I witnessed your battle with the turtles, and I must say that I was impressed. You have proven yourself far more worthy of this than I could have imagined."},{"name":"CURIOUSGORGE","text":"In your hands lies the Soul of the Warrior─a crystal within which the deeds of a thousand thousand warriors from history are recorded. For countless generations, the Soul has been passed on to those in my tribe who choose the path of the warrior, to guide them and aid them on their journey."},{"name":"CURIOUSGORGE","text":"When your inner beast awakens, the runes will resonate, further empowering your will, and granting you such strength as you never thought possible."},{"name":"CURIOUSGORGE","text":"Today, there is cause for celebration, my friend! For through you, I have ensured that my tribe's legacy will endure. Yes, it is for this day, this moment, that I came down from the mountain."},{"name":"CURIOUSGORGE","text":"Yet however earnestly I pursue my goal, I cannot deny the fear inside me that my mission will ultimately end in failure. For you see, while I style myself a warrior, the truth is that I left the mountains before my training was complete."},{"name":"CURIOUSGORGE","text":"And while I carry with me the chronicles of my ancestors, detailing the ancient arts of war, I lack the ability to fully decipher the texts."},{"name":"CURIOUSGORGE","text":"Yet, there may still be hope, for there is another who fled my village─one who shared my dream of passing on the teachings of the tribe, and <span class=\"emphasis\">can</span> read the tome... My brother."},{"name":"CURIOUSGORGE","text":"Without him, I fear there is little more I can teach you at this time. But that will not discourage me from continuing my studies of the chronicles, nor shake my belief that further secrets will soon reveal themselves to me."},{"name":"CURIOUSGORGE","text":"Until then, I ask that you use the knowledge I've passed on to you, and continue your training. You must strive to harden your will so that it may endure the strain of future burdens. Good luck, my friend."},{"name":"SYSTEM","text":"The next warrior quest will be available from Curious Gorge upon reaching level 35."},{"name":"QIB","text":"My battle ends here...<br>Forgive me, <span class=\"highlight\">Forename</span>."}],"reward":{"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":4}],"questsType":"all","quests":[65855,66049]},"next":[66586]},"partials":[{"type":"npc","id":"1000927","obj":{"i":1000927,"n":"Wyrnzoen","l":28,"q":12,"t":"Guildmaster"}},{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1006761","obj":{"i":1006761,"n":"Solkwyb","l":32,"q":1}},{"type":"npc","id":"1006762","obj":{"i":1006762,"n":"Solkwyb","l":32,"q":1}},{"type":"npc","id":"1006763","obj":{"i":1006763,"n":"Fell Demon","l":32,"q":1}},{"type":"quest","id":"65855","obj":{"i":65855,"n":"Bringing Down the Mountain","g":129,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66586","obj":{"i":66586,"n":"Embracing the Beast","g":149,"l":"Eastern La Noscea","s":2,"f":1}}]}