{"quest":{"name":"Keeping the Oath","location":"Ul'dah","id":66596,"patch":2.0,"sort":6,"icon":100106,"unlocksFunction":1,"eventIcon":71341,"issuer":1006747,"target":1006747,"involved":[1007829],"genre":147,"journal":["Jenlyns wishes to bid you farewell.","Although his captaincy is a sham, Jenlyns has decided that he will use what power he has to strike back at the cabal. For the showdown, he has chosen Snowcloak in Coerthas─but before you can offer your assistance, he commands you to stay away and find a safe haven. Jenlyns also mentions that Solkzagyl wishes to speak with you, and the captain directs you to a tunnel in central Thanalan where Solkzagyl will be waiting.","Solkzagyl states plainly that Jenlyns will die if he faces the Monetarists' assassins alone, and he all but declares his intention to follow Jenlyns to Snowcloak before departing. What you do next is up to you and your conscience.","When you arrive at the battleground that Jenlyns has chosen to launch his campaign against the cabal, you find him and Solkzagyl facing off against the minions of the Monetarists. Together, the three of you manage to defeat the assassins and deal the Monetarists a crushing blow. Afterwards, despite the captain's objections, Solkzagyl leaves the Sultansworn in Jenlyns's hands and returns to his paladin's journey. Return to Ul'dah, find Jenlyns at his station near the Royal Promenade in the Hustings Strip, and talk to him once more.","As Solkzagyl continues to search for the fabled Oathkeeper, Jenlyns will continue to serve Ul'dah as one of the Sultansworn. In recognition of your deeds, he bestows upon you the gallant surcoat, sacred armor normally reserved for the most courageous of the Sultansworn. Although this is a violation of long-standing tradition, he believes there is no paladin more deserving of the honor. Wear your new armor with pride, free paladin, and continue to defend the people of Eorzea.<br><br>※The next paladin quest will be available from Jenlyns once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Meet with Solkzagyl.","Follow Jenlyns to Snowcloak.","Speak with Jenlyns in Ul'dah.","Defeat the Death's Embrace assassins!","Locate the Death's Embrace master!"],"dialogue":[{"name":"JENLYNS","text":"Well come, paladin. I had hoped to see you before I left. You remained a true friend, even after the wrongs I did to you, and I owe you my trust. So I will tell you everything I have learned."},{"name":"JENLYNS","text":"After our encounter in the hills, I spent some time in the care of Solkzagyl, recovering from my wounds. As I convalesced, he gave me the true account of what happened these last few years in his solitary war against the Monetarists."},{"name":"JENLYNS","text":"After he went into hiding, he tried to get word to me about what was happening, but I was surrounded by agents in the pay of the Monetarists who kept me isolated and ignorant."},{"name":"JENLYNS","text":"They planted the lie that Solkzagyl was a traitor, and tricked me into tracking him down. I was their puppet, twitching obediently at the end of the strings they pulled."},{"name":"JENLYNS","text":"But when I discovered that Death's Embrace had been behind the demise of my brothers and sisters, they panicked―especially when they found out I had shared the information with you. They set a trap for us, and baited it with the promise of a “parley” with Solkzagyl."},{"name":"JENLYNS","text":"Solkzagyl was no traitor, as I should well have known. But I allowed myself to be deceived by the whispers of mummers and flatterers, and... No. That was not the way of it. It was not their lies that made me blind, but my desire─nay, <span class=\"emphasis\">obsession</span>─to restore our honor."},{"name":"JENLYNS","text":"For the Sultansworn, and all paladins who have bent the knee to a higher cause, honor is a means to an end, not the end itself. I lost sight of that, and in so doing, lost sight of my true duty."},{"name":"JENLYNS","text":"Solkzagyl understood what was happening, and that is why he gave you the Soul of the Paladin."},{"name":"JENLYNS","text":"It was a remonstration, a message. Look how adventurers live, he was telling me. Where does their honor, their authority come from?"},{"name":"JENLYNS","text":"I owe my position to the machinations of the Monetarists. They calculated that a young captain, eager to prove his loyalty, bound by unquestioning fealty, would be all the easier to control. They were right."},{"name":"JENLYNS","text":"I am a sham and a fake. But the world does not know that, and even the illusion of power is a power of sorts. I can use it to fight back."},{"name":"JENLYNS","text":"I will tell my subordinates that I'm fleeing to Snowcloak in Coerthas. When the Monetarists hear of this, as they surely will, they will send assassins after me again."},{"name":"JENLYNS","text":"But when they show their hand, I will stand my ground and fight back."},{"name":"JENLYNS","text":"I realize you may wish to offer your assistance. However, I cannot in good conscience put you in harm's way anymore. You, too, have become a target of the cabal's assassins."},{"name":"JENLYNS","text":"The odds will be against me, that much is certain. But Solkzagyl has taught me much, and if I am brave and vigilant, I know I can triumph."},{"name":"JENLYNS","text":"I am sorry you have been caught up in our own political struggles. But now, as a paladin, it is time you traveled your own path."},{"name":"JENLYNS","text":"Ah, yes─Solkzagyl wished to have a word with you as well. You will find him in central Thanalan─allow me to mark the location on your map."},{"name":"SOLKZAGYL","text":"Thank you for coming, <span class=\"highlight\">Forename</span>. We haven't much time, so I will be blunt. Jenlyns <span class=\"emphasis\">will</span> die if he faces Death's Embrace alone."},{"name":"SOLKZAGYL","text":"I know what I must do─and I suspect you do as well. If you are the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I believe you to be, then we shall meet again soon."},{"name":"JENLYNS","text":"You as well? I told you to go to ground―this isn't your fight!"},{"name":"JENLYNS","text":"First Solkzagyl, now you. Are you both so eager to die?"},{"name":"SOLKZAGYL","text":"You forget that we are <span class=\"emphasis\">paladins</span>! Wheresoever our duty leads us, we go─and do so of our own free will."},{"name":"SOLKZAGYL","text":"To abide by one's own sense of justice is to embrace the paladin's creed."},{"name":"SOLKZAGYL","text":"Sworn or unsworn, we are paladins true, and the only true oath we swear is the one we swear to ourselves."},{"name":"SOLKZAGYL","text":"Now, come! Let us stand shoulder to shoulder and show the blackhearts the mettle of our souls, and the steel of our swords!"},{"name":"SOLKZAGYL","text":"You've done well. You never flinched from your duty, you followed the path you knew you had to take, and you showed us what it means to be a paladin."},{"name":"SOLKZAGYL","text":"And you even managed to prise the scales from Jenlyns's eyes while you were at it. It's been an honor to know you, and to watch you grow."},{"name":"SOLKZAGYL","text":"In any case, today's battle should blunt the Monetarists' dagger, at least for a while. They'll think twice before sending assassins after the Sultansworn again."},{"name":"SOLKZAGYL","text":"I trust you will see to this mess, Jenlyns?"},{"name":"JENLYNS","text":"Yes, sir! I mean, Captain! Please, sir, return to the capital...take up your command again. The burden─it is too much for the likes of me..."},{"name":"SOLKZAGYL","text":"The Monetarists may have stolen Oathkeeper, but oaths are not forged in steel―they are sworn in the heart."},{"name":"SOLKZAGYL","text":"You never betrayed your oaths, Jenlyns. And as for your leadership, well, ask this paladin if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> learned anything from you."},{"name":"SOLKZAGYL","text":"No matter what the circumstances, once a man has left the Sultansworn, he cannot return. No, I followed my own path, and on it I will stay."},{"name":"JENLYNS","text":"...I have followed you since the day I vowed to join the ranks of the Sultansworn. Has the time come for me to stop following, and begin to lead...?"},{"name":"JENLYNS","text":"Thank you for coming. Once again, you have placed me in your debt. See me in the city when you return―I will have something for you."},{"name":"JENLYNS","text":"Well come, paladin. These have been troubled times for the Sultansworn, and you have served us loyally."},{"name":"JENLYNS","text":"You did what was just, followed the paladin way, and defended the weak and needy. You are a true oathkeeper."},{"name":"JENLYNS","text":"Honor and right were yours from the very beginning, and that is what made you strong. Strong enough to defeat me."},{"name":"JENLYNS","text":"The sword Oathkeeper has yet to be found, but I have come to realize that I do not need it─nay, not to lead the Sultansworn nor to restore our good name. The oaths we keep are in our hearts, not in hallowed blades."},{"name":"JENLYNS","text":"Solkzagyl has left to wander the nations of Eorzea. He is a man of honor, and unless I am very much mistaken, he will continue to look for the sword that was gifted by our ruler centuries ago."},{"name":"JENLYNS","text":"I shall continue to serve Ul'dah as one of the Sultansworn. You shall defend the people of Eorzea as a free paladin."},{"name":"JENLYNS","text":"Our paths diverge now, but we shall forever be bound by the oaths we keep in our hearts..."},{"name":"JENLYNS","text":"Ah, but listen to me! Noble words aren't much good to an adventurer who has to face monsters and menaces out in the real world. Fortunately, I have something that will serve you rather better..."},{"name":"JENLYNS","text":"This sacred armor has been kept within the Sultansworn for many generations. It was given only to those Sultansworn who had, through feats of arms and deeds of great courage, earned the privilege to wear it."},{"name":"JENLYNS","text":"But something tells me that, for the first time since it left the armorer's forge, this armor should go to someone who is not of the Sultansworn. If I allowed myself to be a slave to tradition, the paladin who deserves it the most would never wear it!"},{"name":"JENLYNS","text":"Now wouldn't that be a waste of fine plate?"},{"name":"JENLYNS","text":"Just one thing―if anyone asks where you got it, you mustn't say it was me!"},{"name":"SYSTEM","text":"This concludes the paladin quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next paladin quest will be available from Jenlyns."},{"name":"QIB","text":"I suspected they would send minions, but voidsent!?"},{"name":"QIB","text":"Hah! Hardly a challenge for a trio of paladins!"},{"name":"QIB","text":"Surely the Monetarists would go to greater lengths than this..."},{"name":"QIB","text":"Those voidsent were called forth by a mage─a mage who I suspect is observing as we speak."},{"name":"QIB","text":"Spread out and search for anything unusual. But tread lightly─this could very well be a trap."},{"name":"QIB","text":"What sorcery is this!?"},{"name":"QIB","text":"Likely the work of our mage."},{"name":"QIB","text":"It pulses with a queer light..."},{"name":"QIB","text":"Up above, it's the mage! The grimoire─it's a trap!"},{"name":"QIB","text":"Ugh, damn you! Solkzagyl, <span class=\"highlight\">Forename</span>─are you injured!?"},{"name":"QIB","text":"How disappointing. I had hoped to finish this quickly."},{"name":"QIB","text":"Not that I expect you will live much longer!"},{"name":"QIB","text":"Cut down the assassins quickly, but ware that mage!"},{"name":"QIB","text":"His magicks are not to be trifled with!"},{"name":"QIB","text":"Where did that monstrosity come from!?"},{"name":"QIB","text":"Over there, look! That grimoire is the source!"},{"name":"QIB","text":"I will hold the beasts at bay! Jenlyns, <span class=\"highlight\">Forename</span>─destroy the grimoire!"},{"name":"QIB","text":"Captain...for...give..."},{"name":"QIB","text":"&lt;cough&gt; &lt;wheeze&gt; So...so be it..."}],"reward":{"action":30,"items":[{"id":3220},{"id":20642}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":20}],"quests":[66595]},"next":[66656,67568]},"partials":[{"type":"npc","id":"1006747","obj":{"i":1006747,"n":"Jenlyns","l":41,"q":9}},{"type":"npc","id":"1007829","obj":{"i":1007829,"n":"Solkzagyl","l":43,"q":1}},{"type":"action","id":"30","obj":{"i":30,"n":"Hallowed Ground","c":2502,"j":19,"t":4,"l":50}},{"type":"item","id":"3220","obj":{"i":3220,"n":"Gallant Surcoat","l":55,"c":43091,"t":35,"p":1000}},{"type":"item","id":"20642","obj":{"i":20642,"n":"Valor Armor Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66595","obj":{"i":66595,"n":"Parley in the Sagolii","g":147,"l":"Ul'dah","s":5,"f":1}},{"type":"quest","id":"66656","obj":{"i":66656,"n":"A Relic Reborn (Curtana)","g":147,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67568","obj":{"i":67568,"n":"An Exemplary Example","g":147,"l":"Ul'dah","s":500,"f":1}}]}