{"quest":{"name":"Paladin's Pledge","location":"Ul'dah","id":66591,"patch":2.0,"sort":1,"icon":100106,"unlocksFunction":1,"eventIcon":71341,"issuer":1002277,"target":1006747,"genre":147,"journal":["Lulutsu wishes to share with you some exciting news.","Lulutsu of the Coliseum has given you some interesting news. For the first time in their history, the elite of the Sultansworn are prepared to teach the secret arts of the paladin to outsiders. If you wish to learn these skills, seek out the captain of the Sultansworn elite. His name is Jenlyns, and he can be found near the Royal Promenade, in Ul'dah's Hustings Strip.","You have spoken to Jenlyns, captain of the Sultansworn. He is prepared to teach you the paladin skills, but only after you have proven yourself worthy. To that end, he tells you to travel to the ruins south of Little Ala Mhigo in southern Thanalan, light the brazier within, and face the undead monsters drawn to the flame.","The foul abominations are no more. Feed their hearts to the flame so that you might obtain proof of your triumph.","As you complete the trial, you are approached by a free paladin. He hands you a strange crystal and asks that you give it to Captain Jenlyns. Report back to Jenlyns at his station near the Royal Promenade, in Ul'dah's Hustings Strip.","Jenlyns teaches you the basics of the paladin arts, and bequeaths to you the Soul of the Paladin. However, you observe that it bears a striking resemblance to the crystal given to you by the free paladin at the ruins. Show the crystal to Jenlyns and see what he has to say.","Jenlyns is enraged to learn that the crystal you bore was indeed another Soul of the Paladin. He explains that the free paladin you met is a traitor and a thief, and asks that you assist the Sultansworn in bringing the oathbreaker to justice. Your path now clear, you resolve to hone your skills until the time comes.<br><br>※The next paladin quest will be available from Jenlyns upon reaching level 35."],"objectives":["Speak with Jenlyns on the Hustings Strip.","Light the brazier and slay the undead drawn to the flame.","Feed the ashkin hearts to the flame.","Present the ashkin remains to Jenlyns.","Give the engraved crystal to Jenlyns."],"dialogue":[{"name":"LULUTSU","text":"Oh, there you are, <span class=\"highlight\">Forename</span>. Perfect timing! I've just heard a juicy bit of gossip that I <span class=\"emphasis\">know</span> you're going to be interested in..."},{"name":"LULUTSU","text":"Apparently─and remember, you heard this first from me─the Sultansworn elite are sharing the secret skills and training of paladins! Incredible, I know."},{"name":"LULUTSU","text":"The Sultansworn have an exclusive monopoly on the instruction of paladin skills. Once upon a time, if you weren't one of those officer-track elites, then you had no chance to learn the arts. And competition to get to the top was <span class=\"emphasis\">very</span> fierce indeed, let me tell you."},{"name":"LULUTSU","text":"But anyone who joined had to swear an oath of fealty to the Ul'dahn sultanate. Which meant no more adventuring, no more derring-do, and no more Coliseum─just languishing about in the palace all day polishing plate mail."},{"name":"LULUTSU","text":"That's why this news is so big. Now anyone with a bit of commitment can learn the skills of a paladin, and no memorizing the Fifty-Five Commandments of the Sworn or any other nonsense, either."},{"name":"LULUTSU","text":"This is a golden─no, a <span class=\"emphasis\">platinum</span> opportunity that comes but once in a lucky adventurer's lifetime. Let this slip through your fingers and regret will be your just deserts."},{"name":"LULUTSU","text":"You need to go to the Royal Promenade in the Hustings Strip. Find the captain of the Sultansworn elite─Jenlyns is his name─and tell him how you're just <span class=\"emphasis\">dying</span> to become a paladin."},{"name":"JENLYNS","text":"Yes, I am Jenlyns, member of the Sultansworn elite and servant to the Ul'dahn sultanate. Unless my instincts deceive me, you have come to inquire about training as a paladin. If so, I would have your name, good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">sir</span></span>."},{"name":"JENLYNS","text":"...<span class=\"highlight\">Forename</span>? A fine name. I bid you welcome, and salute your noble resolve. But if you aspire to paladinhood, you should understand what it means."},{"name":"JENLYNS","text":"A paladin swears allegiance to the sultanate. A paladin shall be the sword and shield of the sultanate. A paladin defends the people of the realm. "},{"name":"JENLYNS","text":"Sellswords and gladiators and others of their ilk wield their blades for themselves, but a paladin serves the greater good. Do you understand me?"},{"name":"JENLYNS","text":"The battle arts that the paladin learns have been held secret, nurtured, and perfected within the ranks of the Sultansworn elite for nigh on these six hundred years."},{"name":"JENLYNS","text":"Of all those sworn to protect the sultanate─the soldiers, the mounted guards, and the knights─we are the elite of the elite. Our conviction unwavering, our hearts true, our sword skills without peer."},{"name":"JENLYNS","text":"But the glory of the Sultansworn... Well, much of it is buried in the past now. Our brotherhood grows smaller by the year, we are a shadow of what we once were, and the sultana turns to sellswords to defend her palace."},{"name":"JENLYNS","text":"All this, because of one traitor─no, because of a blot of dishonor left by one who shall not be named... And because of him, we have been forced to seek the help of able-bodied adventurers."},{"name":"JENLYNS","text":"And here you are. We shall instruct you in the paladin military arts. You will not be inducted into the Sultansworn, but serve as a free paladin."},{"name":"JENLYNS","text":"However, first you will show us that both your sword and heart have mettle, and you are worthy of the honor."},{"name":"JENLYNS","text":"In the ruins to the south of Little Ala Mhigo, you will find an iron brazier. Light it, and the undead nearby will be drawn to the flame. Slay these monsters and give their hearts to the fire. Return and present to me their ashes as proof of your deed."},{"name":"JENLYNS","text":"Now, would-be paladin, show me the mettle in your heart and steel in your blade!"},{"name":"SOLKZAGYL","text":"(-???-)If you are in this place, searching for the undead, then you must be a petitioner seeking the secrets of the paladin arts."},{"name":"SOLKZAGYL","text":"(-???-)But make no mistake. Simply learning paladin swordplay does not make you a paladin─nor does the armor you wear, or the status you claim."},{"name":"SOLKZAGYL","text":"(-???-)I am just another aging free paladin, but you would do well to heed my counsel. Strike off the shackles that bind your spirit, lift the visor that blinds, and find the true path of the paladin."},{"name":"SOLKZAGYL","text":"(-???-)Here, you will be returning to the captain, yes? Then give him this crystal."},{"name":"SOLKZAGYL","text":"(-???-)The way you use that sword reminds me of a man I used to know..."},{"name":"SOLKZAGYL","text":"(-???-)Mine eyes may be old, but they can see the truth well enough. Be a paladin strong and true. Devote yourself to the way and become a beacon of light."},{"name":"JENLYNS","text":"Face the undead monsters who infest the ruins south of Little Ala Mhigo in southern Thanalan. Defeat them and return with proof of your deed."},{"name":"JENLYNS","text":"Yes, that's what I needed. Proof that you have defeated the undead. You have shown that your heart is true and your sword has mettle."},{"name":"JENLYNS","text":"I've no doubt that you will prove to be an attentive pupil. That is well, for there is much to learn. First and foremost is this: you are a paladin now─a custodian of traditions ancient and noble."},{"name":"JENLYNS","text":"A free paladin has no master. Instead <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> travels all lands, and in every place takes up the cause of the unarmed and defenseless. You swear fealty not to a lord, but to yourself─you are nobility amongst adventurers."},{"name":"JENLYNS","text":"You have taken your first steps on a new path, and you have earned the right to bear this, the Soul of the Paladin. Upon its surface are carved the deeds of paladins of eras past. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> who bears it commands the respect of all knights of honor."},{"name":"JENLYNS","text":"Bahamut's fang! You already possess a crystal? And you say it was given to you by an unknown free paladin, who told you to hand it to me?"},{"name":"JENLYNS","text":"Where is this crystal of which you speak? I demand you show it to me at once!"},{"name":"JENLYNS","text":"Curse him, he has made a mockery of the trial. That crystal you bear is indeed the Soul of the Paladin. But it is disgraced, impure. It was stolen from the Sultansworn."},{"name":"JENLYNS","text":"The man who gave you this soul is the very traitor whom I have been seeking these many moons."},{"name":"JENLYNS","text":"He is an oathbreaker who bent the knee to the Ul'dahn sultanate and who swore allegiance to the Sultansworn, but then single-handedly sullied our name, and trampled it underfoot until it was lost, perhaps forever. How dare he give counsel on honor, on the paladin way!?"},{"name":"JENLYNS","text":"This soul is polluted, and I must dispose of it. When you come to wield your sword as a paladin, the only soul you may wear is that which is bestowed by a captain of the Sultansworn."},{"name":"JENLYNS","text":"That traitor is no Sultansworn, still less a captain. By giving you a soul, he insulted not only the brotherhood, but you, too."},{"name":"JENLYNS","text":"Perhaps an adventurer like yourself finds our rules nothing more than a nuisance. But through reigns long and short, our forebears in the Sultansworn have preserved its rituals and traditions, and we are duty-bound to uphold them─even if men and women within our own ranks scorn them as relics."},{"name":"JENLYNS","text":"It has been my fate to be named captain of the Sultansworn in these troubled times. Though I did not ask for this honor, I have bent my knee to the sultana and sworn fealty, and I will fight to restore our honor and name."},{"name":"JENLYNS","text":"You wield a skilled blade, and more importantly, you have met the traitor face-to-face. Your great task as a paladin will be to help me bring him to justice."},{"name":"JENLYNS","text":"You must ready yourself, marshal your resources, and hone your skills until the time comes when you are able to discharge your duty. The journey will be long, but you are a paladin now, and honor binds you as surely as an oath."},{"name":"SYSTEM","text":"The next paladin quest will be available from Jenlyns upon reaching level 35."},{"name":"POP","text":"The moans of the undead grow louder..."}],"reward":{"action":29,"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":2}],"questsType":"all","quests":[65801,66049]},"next":[66592]},"partials":[{"type":"npc","id":"1002277","obj":{"i":1002277,"n":"Lulutsu","l":41,"q":6,"t":"Guild Receptionist"}},{"type":"npc","id":"1006747","obj":{"i":1006747,"n":"Jenlyns","l":41,"q":9}},{"type":"action","id":"29","obj":{"i":29,"n":"Spirits Within","c":2503,"j":19,"t":4,"l":30}},{"type":"quest","id":"65801","obj":{"i":65801,"n":"The Rematch","g":127,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66592","obj":{"i":66592,"n":"Honor Lost","g":147,"l":"Ul'dah","s":2,"f":1}}]}