{"quest":{"name":"How to Quit You","location":"Eastern La Noscea","id":66590,"patch":2.0,"sort":6,"icon":100109,"unlocksFunction":1,"eventIcon":71341,"issuer":1006746,"target":1006746,"involved":[1006771,1006774],"genre":149,"journal":["Curious Gorge has received an urgent distress call.","The village of Wineport is under attack once more, this time by the vicious beast that Curious Gorge had been tracking. Hasten to the village and receive a briefing from the captain of the militia.","After the captain finishes telling you the situation, you immediately begin your defense of the hamlet from the invading fiends. Though you make short work of the crazed beasts, you are given little time to celebrate, as you hear further sounds of trouble within Wineport. Heading in, you are unexpectedly challenged by Curious Gorge, whom you are then forced to defeat. Thankfully, your blows knocked the sense back into him, and he has realized the folly of his ways. With the fighting at an end, speak with the militia captain before taking your leave.","The militia captain expresses his thanks for your aid, and assures you that the people of Wineport bear no ill will against Curious Gorge. Rather, they have a newfound respect for warriors and would ask for his continued protection. Return to your mentor and tell him that all has ended well.","Curious Gorge is deeply repentant for his misdeeds, and resolves to devote himself anew to the way of the warrior. His soul crystal shining once more, he vows to never again allow anger or thirst for power to cause him to lose sight of who he is. Recognizing you as the worthy successor of his ancestors and a truer warrior than he could ever be, he entrusts to you the final piece of his ancestors' armor, urging you to go forth and do his people proud.<br><br>※The next warrior quest will be available from Curious Gorge once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with the Wineport militia captain.","Speak with the militia captain.","Speak with Curious Gorge.","Defend Wineport from the fiends!","Defeat Curious Gorge!"],"dialogue":[{"name":"CURIOUSGORGE","text":"<span class=\"highlight\">Forename</span>! There is much we must discuss, but now is not the time!"},{"name":"CURIOUSGORGE","text":"You surely recall my mention of the hunt for the bloodthirsty creature terrorizing the smallfolk. I've just received word that selfsame monster has been sighted near Wineport!"},{"name":"CURIOUSGORGE","text":"What is more, according to those who managed to escape the carnage, the creature appeared more man than beast."},{"name":"CURIOUSGORGE","text":"If this is true, then our quarry could be far more dangerous than any wild animal. We must find a way to stop it... <span class=\"emphasis\">I</span> must find a way."},{"name":"CURIOUSGORGE","text":"This is my chance! To prove to the people of Wineport─nay, the world─that my tribe and my art have been wrongly judged!"},{"name":"CURIOUSGORGE","text":"Perhaps <span class=\"emphasis\">then</span> my ancestors will deem me worthy! I think even my brother would, too!"},{"name":"CURIOUSGORGE","text":"There is no time to lose. We must arrive in the hamlet before any of the villagers fall prey to the beast. Let us leave at once!"},{"name":"LAEDER","text":"Thank the gods for your presence! Wineport is in your debt once more."},{"name":"LAEDER","text":"Fell creatures bear down upon our village in hordes, as if drawn by that great hairy beast. You must stop them!"},{"name":"CURIOUSGORGE","text":"<span class=\"highlight\">Forename</span>! You fend off these creatures!"},{"name":"CURIOUSGORGE","text":"I will see to the beast. This is my battle to fight."},{"name":"VILLAGERA","text":"(-Panicked Villager-)It's the m-monster!"},{"name":"VILLAGERB","text":"(-Fleeing Villager-)It's the beast! Run for your lives!"},{"name":"CURIOUSGORGE","text":"Stop! These people are not your enemy! The enemy lies within!"},{"name":"CURIOUSGORGE","text":"You are stronger than this! Take control of the beast! Do not let it consume you!"},{"name":"CURIOUSGORGE","text":"Brother!"},{"name":"CURIOUSGORGE","text":"Look what you are doing! You are destroying all that I worked to restore! The fate of our people rests in our hands, brother! Your weakness would cost us everything!"},{"name":"CURIOUSGORGE","text":"I cannot let that happen! I <span class=\"emphasis\">will</span> not! Our ancestors have chosen <span class=\"emphasis\">me</span> to lead our people to glory...and no one shall stop me!"},{"name":"CURIOUSGORGE","text":"No one... No one... No one..."},{"name":"CURIOUSGORGE","text":"It was I who unlocked the secrets of the chronicles; I who trained you in their ways; I who uncovered the locations of the legendary artifacts..."},{"name":"CURIOUSGORGE","text":"...I who defeated my tribe's greatest warrior! <span class=\"emphasis\">I</span> am the master now!<br><span class=\"emphasis\">I am the master</span>! Return to me what is rightfully mine!"},{"name":"CURIOUSGORGE","text":"Give me the armor!"},{"name":"CURIOUSGORGE","text":"Or I shall tear it from your bloody corpse!"},{"name":"CURIOUSGORGE","text":"I have failed..."},{"name":"CURIOUSGORGE","text":"I failed you, I failed my people, I failed my ancestors...and I failed my own kin..."},{"name":"CURIOUSGORGE","text":"I found out long ago what had become of my brother, but did everything I could to deny it."},{"name":"CURIOUSGORGE","text":"I thought that if only I could prove myself stronger than he, the people would see his madness as the product of a weak mind... That they would believe the problem lay in him, not in our tribe."},{"name":"CURIOUSGORGE","text":"Yet, all the while, my own soul was growing weaker and weaker... The inner beast had taken hold, and it would not let go. It drove me, as it drove my ancestors, the keeper of the armor, and my brother."},{"name":"CURIOUSGORGE","text":"Our tribe had lost sight of who we were. In seeking ever more strength, we allowed ourselves to fall victim to that which we had long scorned in others as weakness. Instead of learning to harden our wills with resolve, we steeled them with anger─and therein lay our folly."},{"name":"CURIOUSGORGE","text":"Like a bonfire, anger burns hot and bright, but when the fuel that feeds it is spent, all that remains is ash. By accepting anger as our guide, we left our wills at the mercy of the inner beast."},{"name":"CURIOUSGORGE","text":"But not you. Your will is more akin to the lava which courses through the mountains of my homeland. It burns as strong─nay, <span class=\"emphasis\">stronger</span>─than any bonfire, and when it cools, it becomes hard and firm, unbreakable. This quality allowed you to keep your inner beast at bay."},{"name":"CURIOUSGORGE","text":"My people were once as you are now, <span class=\"highlight\">Forename</span>...and I believe that is why my ancestors chose to speak to you."},{"name":"CURIOUSGORGE","text":"They sensed true strength within you. Such strength as could rightly represent our people and our art."},{"name":"CURIOUSGORGE","text":"Had I but realized that myself...none of this need have happened. &lt;sigh&gt; Well, what's done is done. If I am to have any hope of restoring my people's name, I must start over from the beginning..."},{"name":"CURIOUSGORGE","text":"...And this time, I mustn't try to do it alone."},{"name":"CURIOUSGORGE","text":"It may take time, but together, my brother and I will restore our village to its former glory. And when we have, I shall remember <span class=\"highlight\">Forename</span>, my friend and fellow warrior, and how <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> saved me from myself, that my dream might become reality."},{"name":"LAEDER","text":"Wineport is in your debt once more, <span class=\"highlight\">Forename</span>. And what is more, we have seen the truth with our own eyes."},{"name":"LAEDER","text":"Pray tell Curious Gorge as much, and that we will be relying on him for his protection. He is a true warrior, and our humble hamlet would be lost without his strength."},{"name":"LAEDER","text":"Tell Curious Gorge that the people of Wineport have seen the truth, and are indebted to him for his protection. He is a true warrior, and our humble hamlet would be lost without his strength."},{"name":"CURIOUSGORGE","text":"Welcome back, <span class=\"highlight\">Forename</span>. Hm? Despite all that transpired, the captain at Wineport would entrust his village's defenses to me? I... I know not what to say."},{"name":"CURIOUSGORGE","text":"It has been a long road, but thanks to you, I have rediscovered what I lost so many years ago. I will see to my brother's wounds, and once he is well, we will embark on the path of the warrior again─engraving the lessons we have learned in our souls, never to be forgotten."},{"name":"CURIOUSGORGE","text":"Curiously, the moment I did avow this to myself, my soul crystal began to shimmer anew. I see yours, too, grows stronger than ever. It would seem my ancestors have once more bestowed their knowledge upon you."},{"name":"CURIOUSGORGE","text":"This... This power. Why, this is a power that I have only read about in the tomes─nay, a power entirely beyond my comprehension."},{"name":"CURIOUSGORGE","text":"To think that I once doubted your resolve. No, you have truly conquered your inner beast, and become a truer warrior than I could ever hope to be."},{"name":"CURIOUSGORGE","text":"Know that you stand before me the equal of my tribe's greatest heroes. Ever steel your resolve, <span class=\"highlight\">Forename</span>, and go forth into the realm and protect those who need your strength. With you representing us, the redemption of my people─the new era I seek─is surely close at hand."},{"name":"SYSTEM","text":"This concludes the warrior quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next warrior quest will be available from Curious Gorge."},{"name":"QIB","text":"Urgh! Who heals...the healers?"},{"name":"QIB","text":"Wineport... I have failed you..."},{"name":"QIB","text":"Your strength is no match for mine, <span class=\"highlight\">Forename</span>!<br>I am the true warrior!"},{"name":"QIB","text":"Graaaghhh! The beast rages within me!<br>I can fight it no longer!"},{"name":"QIB","text":"Gaaarrrghhh! <span class=\"highlight\">Forename</span>!<br>You must...stop me!"}],"reward":{"action":52,"items":[{"id":3222},{"id":20644}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":22}],"quests":[66589]},"next":[66121,66655]},"partials":[{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1006771","obj":{"i":1006771,"n":"Wineport Militia Captain","l":32,"q":1}},{"type":"npc","id":"1006774","obj":{"i":1006774,"n":"Wineport Militia Captain","l":32,"q":1}},{"type":"action","id":"52","obj":{"i":52,"n":"Infuriate","c":2555,"j":21,"t":4,"l":50}},{"type":"item","id":"3222","obj":{"i":3222,"n":"Fighter's Cuirass","l":55,"c":43089,"t":35,"p":1000}},{"type":"item","id":"20644","obj":{"i":20644,"n":"Warrior's Armor Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66589","obj":{"i":66589,"n":"Proof Is the Pudding","g":149,"l":"Eastern La Noscea","s":5,"f":1}},{"type":"quest","id":"66121","obj":{"i":66121,"n":"Better Axe Around","g":149,"l":"Eastern La Noscea","s":500,"f":1}},{"type":"quest","id":"66655","obj":{"i":66655,"n":"A Relic Reborn (Bravura)","g":149,"l":"North Shroud","s":7,"f":1}}]}