{"quest":{"name":"Parley in the Sagolii","location":"Ul'dah","id":66595,"patch":2.0,"sort":5,"icon":100106,"unlocksFunction":1,"eventIcon":71341,"issuer":1006747,"target":1006747,"genre":147,"journal":["Jenlyns wishes to know if you are ready to face Solkzagyl.","Through intermediaries, Jenlyns has arranged a parley with Solkzagyl in order to negotiate the return of Oathkeeper. However, the meeting could be a trap, and Jenlyns has asked you to accompany him. The parley will be held south of Forgotten Springs, in the Sagolii Desert.","When you arrive at the parley, Jenlyns suddenly turns his sword against you and accuses you of being in league with Solkzagyl and the Monetarists. You have no time to explain or persuade him otherwise, and are forced to fight Jenlyns and his soldiers. Defiant to the bitter end, Jenlyns refuses to believe your pleas of innocence, until one of his own men attempts to take his life. However, Solkzagyl suddenly appears and saves the captain's life, and the man once believed to be a traitor reveals that he has always been loyal to the crown. Although Jenlyns loses consciousness due to his injuries, Solkzagyl assures you that it is nothing serious, and he pledges to deliver him safely back to Ul'dah. Nevertheless, you should see if Jenlyns is well when next you return to the city.","Jenlyns has accepted that he was an unwitting dupe of the Monetarists. Now that his true enemy has been revealed to him, he will bide his time until the time is ripe to strike.<br><br>※The next paladin quest will be available from Jenlyns upon reaching level 50."],"objectives":["Rendezvous with Jenlyns.","Speak with Jenlyns in Ul'dah.","Defeat Jenlyns Straightblade!"],"dialogue":[{"name":"JENLYNS","text":"The recovery of Oathkeeper will be the first step in restoring the honor of the Sultansworn."},{"name":"JENLYNS","text":"I have told Solkzagyl that if he returns the sword, we will give him a fair trial."},{"name":"JENLYNS","text":"Otherwise, he shall be captured and thrown at the feet of the sultana for judgment."},{"name":"JENLYNS","text":"The parley is to take place south of Forgotten Springs in the Sagolii Desert. Give me your map and I will mark the location."},{"name":"JENLYNS","text":"While I believe he is acting alone, we must be prepared for anything─you may be certain that the Monetarists will not take kindly to his surrender."},{"name":"JENLYNS","text":"In fact, I believe that should the Monetarists discover Solkzagyl is willing to parley, they will surely try to intervene. Therefore, we must not speak of what we do, not to anyone."},{"name":"JENLYNS","text":"We should travel separately, so as not to attract attention. We shall meet again at the parley."},{"name":"JENLYNS","text":"So you dared to come. You are a brazen one, I will grant you that. But did you really think I wouldn't find out?"},{"name":"JENLYNS","text":"Come, come, confess. My allies within the Sultansworn have told me the truth. I know you are working in league with the traitor and the Monetarists."},{"name":"JENLYNS","text":"Confess! With your dying breath, you will tell me where I can find Oathkeeper and the traitor who stole it!"},{"name":"JENLYNS","text":"Do you dare accuse my own Sultansworn of lying? We are comrades-in-arms, every one of us, bound in brotherhood by our oath. I would trust them with my life. What is your word, when set against theirs? We know the meaning of honor!"},{"name":"JENLYNS","text":"You are a naive fool. I suspected you from the beginning, ever since you showed me the Soul of the Paladin that the traitor Solkzagyl gave you."},{"name":"JENLYNS","text":"You were, no matter how briefly, a paladin, and as such, you are bound by a code of honor that is as unforgiving as it is noble."},{"name":"JENLYNS","text":"Traitor! I sentence you to death, and decree that your body shall lie here and feed the crows."},{"name":"JENLYNS","text":"You...you cannot do this. I am the greater swordsman. Your superior...in every way..."},{"name":"SOLKZAGYL","text":"You were blinded, Jenlyns─by your own conviction."},{"name":"SOLKZAGYL","text":"Jenlyns, remember your own lesson! A paladin does not exist to defend his position or the honor of his fellow Sultansworn."},{"name":"SOLKZAGYL","text":"Those men were assassins, in service to the Monetarists. The moment you outlived your usefulness, you were to be killed. You and this free paladin of yours."},{"name":"JENLYNS","text":"Liar! You are their agent! You betrayed us for them..."},{"name":"SOLKZAGYL","text":"You were always naive, Jenlyns─too willing to trust your fellow man. It's one of your virtues, but you have a deplorable habit of turning your virtues into vices..."},{"name":"SOLKZAGYL","text":"Think! The information you uncovered─how did you come by it? Did it fall into your lap, as if―oh, I don't know―someone was <span class=\"emphasis\">feeding</span> it to you for their own purposes? You and the paladins under your command are the Monetarists' lapdogs."},{"name":"SOLKZAGYL","text":"Jenlyns, you've been led a merry dance, and followed their lead at every step."},{"name":"JENLYNS","text":"Then...you were never a traitor? You were innocent? I...I have wronged you..."},{"name":"SOLKZAGYL","text":"Easy now. Your wounds aren't mortal, but you still need to rest."},{"name":"SOLKZAGYL","text":"I'll take care of the captain. He's had worse, and we'll have him back on his feet soon enough."},{"name":"SOLKZAGYL","text":"You've become a fine warrior, and learned all there is to know about the way of the paladin. I think perhaps that you are not aware just how much you've grown. Well! 'Tis time you were <span class=\"emphasis\">made</span> aware─paladin!"},{"name":"SOLKZAGYL","text":"When the captain's recovered, keep an eye on him for me, will you? He needs someone like you to watch his back."},{"name":"JENLYNS","text":"Paladin, I have done you a great wrong. I allowed myself to be hoodwinked, accused you of treason, and even turned my sword against you. I hope that you can find it in your heart to forgive me."},{"name":"JENLYNS","text":"As for me, yes, I am recovered from my wounds, at least those that will heal. But far more important than that, Solkzagyl is innocent, after all."},{"name":"JENLYNS","text":"He was never a traitor, and the dream that I followed in my youth was not a lie."},{"name":"JENLYNS","text":"I remain captain of the elite, although a poor substitute for my predecessor. I am now working on a plan to strike back at the Monetarists and restore the Sultansworn to its former strength."},{"name":"JENLYNS","text":"No, do not be afraid for me. We've unmasked the foe and he cannot hide behind his deceptions anymore. The assassins won't find it easy to reach me."},{"name":"JENLYNS","text":"For now, I will bide my time, marshal my strength, and, when the time is ripe, strike hard at our enemies."},{"name":"QIB","text":"Save whatever dignity you have left and accept your fate!"},{"name":"QIB","text":"How dare you use our arts against us!"},{"name":"QIB","text":"Confess, damn you, <span class=\"emphasis\">confess</span>!"}],"reward":{"action":27,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":20}],"quests":[66594]},"next":[66596]},"partials":[{"type":"npc","id":"1006747","obj":{"i":1006747,"n":"Jenlyns","l":41,"q":9}},{"type":"action","id":"27","obj":{"i":27,"n":"Cover","c":2501,"j":19,"t":4,"l":45}},{"type":"quest","id":"66594","obj":{"i":66594,"n":"Poisoned Hearts","g":147,"l":"Ul'dah","s":4,"f":1}},{"type":"quest","id":"66596","obj":{"i":66596,"n":"Keeping the Oath","g":147,"l":"Ul'dah","s":6,"f":1}}]}