{"quest":{"name":"Brother from Another Mother","location":"Ul'dah","id":66597,"patch":2.0,"sort":1,"icon":100105,"unlocksFunction":1,"eventIcon":71341,"issuer":1001286,"target":1006749,"genre":148,"journal":["Gagaruna has work for a willing pugilist.","You have been charged with seeing to the safety of one of Eorzea's most prominent military historians. Visit the Goldsmiths' Guild, and there speak with Professor Erik─the body you will be guarding.","Professor Erik tells you that in the midst of his studies, his previously assigned bodyguard left his side and has not returned. Without protection, the professor cannot continue his research, which is why you must aid in carrying out the crucial fieldwork. Travel ahead of him to the Sil'dih excavation site in central Thanalan and set up the aetherometer he has placed in your care.","The aether flowing through the field of battle has opened one of the chakra within you. Upon witnessing this, a senior monk named Widargelt gifts you with a soul crystal─the mark of a member of the monkhood. He explains that with it, you will come to learn the skills of those monks who bore it before you, but only after your chakra have opened further. For now, retrieve the aetherometer.","Having secured the forgotten aetherometer, return to the Goldsmiths' Guild and deliver it to Professor Erik.","Professor Erik warns that you require further preparation before undertaking the next task that he has for you.<br><br>※The next monk quest will be available from Erik upon reaching level 35."],"objectives":["Speak with Erik at the Goldsmiths' Guild.","Place the aetherometer at the Sil'dih excavation site.","Retrieve the aetherometer.","Deliver the aetherometer to Erik.","Defeat the imps!"],"dialogue":[{"name":"GAGARUNA","text":"Tell me, do you know of Professor Erik? He is a scholar of Eorzean military history whose genius is second to none! And he is among our most valued clients."},{"name":"GAGARUNA","text":"Some find him to be...verbose. Tedious. Haughty. But never mind all that! The man spends more gil on a moon's research than most people see in a lifetime! Hence our amicable relations!"},{"name":"GAGARUNA","text":"His latest work has him visiting the sites of ancient battlefields. He insists on surveying lands plagued by savage beasts."},{"name":"GAGARUNA","text":"According to him, the beasts keep man away, and less intrusion by man means greater preservation."},{"name":"GAGARUNA","text":"Whatever his reasons, should the professor meet an untimely fate, we will be unable to collect the gil he has borrowed, much less the interest! Oh, and it would be a terrible loss for the academic community and so on and so forth, yes, yes."},{"name":"GAGARUNA","text":"The point is the man must needs be guarded. To that end, I sent a monk of Ala Mhigo to see to his safety, but it turns out the bloody oaf has no work ethic about him─just like an Ala Mhigan."},{"name":"GAGARUNA","text":"The professor cannot focus on his work if he feels endangered, and so has demanded we assign him a new bodyguard."},{"name":"GAGARUNA","text":"That's why I'm so glad to see you, <span class=\"highlight\">Forename</span>. The professor is awaiting his new escort as we speak, and I'd like for it to be you."},{"name":"GAGARUNA","text":"You are yet a mere pugilist. Perhaps this task would provide some insight into what it is the monkhood does around here."},{"name":"GAGARUNA","text":"Make for the Goldsmiths' Guild, and there seek out our good Professor Erik."},{"name":"GAGARUNA","text":"The professor claims he will pay his debt and the fees for his protection once his research is complete. See to it our investment doesn't end up under the paw or in the maw of some nasty beast."},{"name":"ERIK","text":"Ah, my punch-prone <span class=\"alternative-container\"><span class=\"alternative\">maidservant</span><span class=\"alternative\">manservant</span></span>, I presume? You may and shall call me Erik. You are to guard my life, even at the cost of your own, and aid in my revolutionary research whenever and however asked."},{"name":"ERIK","text":"Know that my primary endeavor is to reconstruct the military histories of old through the aetherial analysis of ancient battlegrounds."},{"name":"ERIK","text":"I assume the words conjure in your simple mind romantic images of vast plains and open valleys, with armies charging blindly at one another. False!"},{"name":"ERIK","text":"I seek to know where the armies of old were deployed. Where they made camp and marched. No doubt you think such lands to be those sung of in the songs of bards. False! They are <span class=\"emphasis\">here</span>, beneath our very feet! And to find them and determine <span class=\"emphasis\">precisely</span> how events unfolded upon them is my purpose."},{"name":"ERIK","text":"No doubt you jumped at the chance to aid in my work. Tell me, which of my treatises have you read? All of th─<span class=\"emphasis\">none</span>!? Gods, I knew you adventurers had a reputation for being unlettered. I didn't know you actually made efforts to remain so. &lt;sigh&gt; It matters not. "},{"name":"ERIK","text":"I require only that you work with diligence─unlike that Widargelt buffoon. The man proved to be sloth itself. Alas, he <span class=\"emphasis\">is</span> a monk of Ala Mhigo. I suppose the fool was too busy opening his <span class=\"emphasis\">chakra</span> or whatever it is those barbarians do all day."},{"name":"ERIK","text":"I admit, he seemed keenly interested in my research, but now he's gone off to Twelve know where and has yet to return. Do you understand the sheer magnitude of this inconvenience?"},{"name":"ERIK","text":"Good, good. You show that much promise, at least. But let us speak more of my work. Our first destination is the Sil'dih excavation site in central Thanalan. I believe events of great import to the history of Sil'dih transpired there."},{"name":"ERIK","text":"Hm? Surely if you have ears you have heard of Sil'dih? Or are you deaf as well as dull? &lt;sigh&gt; Very well. I see you require some instruction. It would be remiss of me as an academic to allow you to wallow in such ignorance."},{"name":"ERIK","text":"Sil'dih was plunged into chaos in the wake of King Lalawefu's demise─or the King of Springs, as he was known. Despite the success of economic reforms...&lt;babble&gt;...fomented unrest among the people...&lt;babble&gt;...resulting in violent outbreaks throughout the kingdom."},{"name":"ERIK","text":"Sil'dih was...&lt;babble&gt;...sultan at the time...&lt;babble&gt;...distant descendant...&lt;babble&gt;...attack was ordered... &lt;babble&gt;"},{"name":"ERIK","text":"And so...&lt;babble&gt;...irony of ironies...&lt;babble&gt;...hadn't been for that horse... &lt;babble&gt;"},{"name":"ERIK","text":"Fascinating, is it not? It is enough to convince one things could not have happened any other way, no? False! One among my colleagues disagreed with this interpretation of events. He claimed to have evidence suggesting otherwise, but all trace of it disappeared before it was published."},{"name":"ERIK","text":"Mine own research shall unearth any such evidence should it truly exist! I shall know the truth! Granted, you are not the brightest coal in the brazier, but surely such a prospect entices even you."},{"name":"ERIK","text":"And so, we make for the Sil'dih excavation site in central Thanalan. Travel the way before me to see that it is safe, and once there set up this aetherometer."},{"name":"ERIK","text":"And, should you ever care to know more of the Eorzean military history, do come and see me. It is a personal crusade of mine to guide the dullards of this realm towards some modicum of enlightenment."},{"name":"ERIK","text":"Well done! Now, we need only wait for the aetherometer to gauge the─ Hm?"},{"name":"ERIK","text":"There are fiends about, <span class=\"highlight\">Forename</span>. They are often drawn to the lingering scents of blood and death. Well, this is what you're here for. Have at it."},{"name":"ERIK","text":"Widargelt! So good of you to drag yourself all this way, you purblind sluggard! Ah, and <span class=\"highlight\">Forename</span>. You have far exceeded what admittedly low expectations I had of you."},{"name":"ERIK","text":"I suppose introductions are in order. Far be it from me to deny the realm's unread the comfort of one another's company. Widargelt, <span class=\"highlight\">Forename</span>. <span class=\"highlight\">Forename</span>, Widargelt─the monk I spoke of sent to me by Gagaruna."},{"name":"ERIK","text":"I tried to make a pupil of Widargelt as well, but he has little mind for history. His primitive beliefs in the witchcraft of chakra and spiritual energies have a tenacious hold on him."},{"name":"ERIK","text":"Oh? Truly!? <span class=\"emphasis\">This</span> is the area where there have been sightings of walking dead!? I have heard the tales. Some claim they've seen an apparition wearing the garb of an ancient commander!"},{"name":"WIDARGELT","text":"Careful. There are still dangers about."},{"name":"WIDARGELT","text":"His work is dear to him. That is good. He thirsts for knowledge. For truth. Discovery awakens him. You too have awoken, friend. Can you not feel it?"},{"name":"WIDARGELT","text":"Do not be frightened. Here was a battle. Long ago. Much energy remains. It has found you. It flows through you. Your chakra has been opened. This was the light that shone from you."},{"name":"WIDARGELT","text":"It is as Erik said. Widargelt is my name. I am a brother of the monkhood. My order is the Fist of Rhalgr. Our way is to train the body and mind. "},{"name":"WIDARGELT","text":"The fist is our weapon. With it, we put down our enemies. The energy within us moves the fist. The chakra is the seat of that energy. It is a sacred place. It can be opened, and the life force within controlled."},{"name":"WIDARGELT","text":"Chakra exist in all that lives─in all beings. Yet not all beings can open them."},{"name":"WIDARGELT","text":"Much training is needed. And great discipline. With these, the life force be commanded."},{"name":"WIDARGELT","text":"There are those who require no training. Their inner strength is such that it forces the chakra open. I have heard of this happening. But never have I seen it─until now."},{"name":"WIDARGELT","text":"I see in you great conviction. You mean to walk the monk's path. And so I will give you this─a soul crystal. The mark of my order."},{"name":"WIDARGELT","text":"None but a monk may hold it. And only then with the order's leave. But your chakra is awakened. That is clear. And so you are worthy."},{"name":"WIDARGELT","text":"Many bore that crystal before you. It remembers them. Their breath and their movement. They will one day be yours. But your chakra must open further. Only then can the crystal's memories enter you."},{"name":"WIDARGELT","text":"This is no more than the beginning. Now you must train. Learn to control the life force within you. With time, you will master it."},{"name":"WIDARGELT","text":"We stand on an ancient battleground. A great war was waged here. The spirit of the fight lingers. The aether reaches for the chakra. It aids in their opening. That is why we monks seek such lands."},{"name":"WIDARGELT","text":"Erik seeks these lands for reasons of his own. The fates favor you in this. Follow him. Your chakra will grow ever more."},{"name":"WIDARGELT","text":"Hm? Professor Erik is leaving. Fear not. I will see to his safety. Please, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>, the aetherometer. Gather it and bring it to the Goldsmiths' Guild."},{"name":"ERIK","text":"Well, look who has decided to grace us with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> presence. Did you enjoy the saunter back? I was just about to begin my analysis, so if you've matters you wish to speak on, I'd ask that you save it for─"},{"name":"ERIK","text":"You've brought the aetherometer! Excellent. I had a feeling you might not be entirely useless. Now, let us see what discoveries await."},{"name":"ERIK","text":"Hm? Widargelt passed along a soul crystal to you? Moved to join the monkhood by the bone-headed clod, were you? &lt;sigh&gt; Well, I suppose it is for the best that my pupils get along."},{"name":"ERIK","text":"But I do believe I will see to it you are sent to separate locations for the next round of measurements. And I daresay the land to which I intend to send you is fraught with dangers. You had best tread the monk's path quickly if you mean to defend yourself─and me, besides!"},{"name":"SYSTEM","text":"The next monk quest will be available from Erik upon reaching level 35."},{"name":"QIB","text":"Beat the bloody hells out of the blasted things! There are measurements to be taken!"},{"name":"QIB","text":"Yes, <span class=\"emphasis\">yes</span>, that's it! The data is flowing now!"},{"name":"QIB","text":"Ahhh, here comes a <span class=\"emphasis\">true</span> foe!"},{"name":"QIB","text":"Most fascinating! This data will prove invaluable!"}],"reward":{"action":70,"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":3}],"questsType":"all","quests":[66103,66049]},"next":[66598]},"partials":[{"type":"npc","id":"1001286","obj":{"i":1001286,"n":"Gagaruna","l":40,"q":5,"t":"Guild Receptionist"}},{"type":"npc","id":"1006749","obj":{"i":1006749,"n":"Erik","l":41,"q":9}},{"type":"action","id":"70","obj":{"i":70,"n":"Rockbreaker","c":2529,"j":20,"t":3,"l":30}},{"type":"quest","id":"66103","obj":{"i":66103,"n":"Return of the Holyfist","g":128,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66598","obj":{"i":66598,"n":"Insulted Intelligence","g":148,"l":"Ul'dah","s":2,"f":1}}]}