{"quest":{"name":"Fatal Seduction","location":"Coerthas Central Highlands","id":66607,"patch":2.0,"sort":5,"icon":100104,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1006748,"genre":150,"journal":["Ser Alberic would ask you to reaffirm your commitment to do battle with the great wyrm.","After telling you the tale of how he came to abandon the power of the dragon and warning you against being consumed by the same, Ser Alberic sends you off to further your skill with the lance. Play the flute at the specified location and slay the dragon that it summons forth.","You have slain the winged terror Archaeoaevis in a battle you will not soon forget. Return the flute to Ser Alberic and recount to him every last detail.","The soul of the dragon having fully awakened within you, you now stand as a full-fledged Azure Dragoon. Make your newfound powers your own, that you may be fully prepared to join Estinien in battle with the great wyrm.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 50."],"objectives":["Use the flute to summon a dragon and slay it.","Return the flute to Alberic."],"dialogue":[{"name":"ALBERIC","text":"So you would join your strength to Estinien's, that Ishgard might be free from the rage of the great wyrm forevermore?"},{"name":"ALBERIC","text":"Then I shall honor my promise. You shall have full use of your powers by the time we are done."},{"name":"ALBERIC","text":"Before we begin, there is something I must needs confess. You will recall the tale of my battle with Nidhogg twenty years past, and how the power of the dragon left me on account of the injuries I sustained."},{"name":"ALBERIC","text":"What I said was an untruth. The power did not abandon me, <span class=\"highlight\">Forename</span>. It was I who abandoned it."},{"name":"ALBERIC","text":"Being derived from our mortal enemies, the power of the Azure Dragoon is a double-edged sword. Even as it lends us the strength we need to smite dragons, it heightens our communion with the creatures, rendering our minds more susceptible to their seduction than ordinary men."},{"name":"ALBERIC","text":"Even as I buried my lance in Nidhogg's flesh, our gazes locked, and mine eyes met then with a look that would fair impale a man. In that instant, I found myself assailed by a torrent of emotions not mine own..."},{"name":"ALBERIC","text":"Sorrow... Rancor... Pity... They threatened to drown the man in me and leave behind a dragon."},{"name":"ALBERIC","text":"Fearing that I might turn traitor, I chose to purge myself of the power that the Eye had bestowed upon me."},{"name":"ALBERIC","text":"Thus regaining lucidity, I was able to rout the grievously wounded Nidhogg."},{"name":"ALBERIC","text":"Alas, countless of his brethren yet remained. As if to mock me, they fell upon Ferndale with a vengeance. Bereft of my power, it was all I could do to save but one child."},{"name":"ALBERIC","text":"Nary a soul knows of this. Nay, not even Estinien...but I can keep him in the dark no longer."},{"name":"ALBERIC","text":"At our last meeting, Estinien said that protecting Ishgard and exacting revenge upon Nidhogg are as one to him."},{"name":"ALBERIC","text":"That frame of mind, I fear, may well lead to his demise. The desire to protect and the desire to avenge are opposing forces that can ill be reconciled. Worse, the latter serves only to cloud his sense of self."},{"name":"ALBERIC","text":"When next Estinien and I meet, I intend to confess all, though it mean the loss of his good opinion. The outcome of the coming battle─and his very life─may well depend upon his readiness to relinquish his powers."},{"name":"ALBERIC","text":"Never allow yourself to forget the origin of your strength. Ever does the dragon lurk behind your eyes, biding its time, ready to claim you for its own."},{"name":"ALBERIC","text":"Aught less than complete conviction, and you will find yourself in its vicelike clutches. So forewarned, let us return to our present endeavor."},{"name":"ALBERIC","text":"My promise to Estinien was that I would impart unto you the technique that will mark you as a true Azure Dragoon. If you would know the truth, however, this knowledge is not within my power to bestow."},{"name":"ALBERIC","text":"No, you must claim the technique much as you claimed the fourth piece of the armor you bear─by proving yourself in battle with the dragons whose power you would unite with your own."},{"name":"ALBERIC","text":"I entrust you with this flute once more. Take it to the southwest of Providence Point and blow a single note. By locking wills with your adversary and prevailing, you will prove yourself worthy to champion the cause to which your lance is sworn. The dragon within you shall then awaken."},{"name":"ALBERIC","text":"It is good to see you safely returned. I take from your bearing that the engagement went favorably?"},{"name":"ALBERIC","text":"You left this place as a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, <span class=\"highlight\">Forename</span>, but you return as a dragon. There is no more for me to teach you. From here, your battle is yours and yours alone."},{"name":"ALBERIC","text":"Now, you might recall me saying that the fifth and final piece of the drachen armor was not mine to give... However, that is not wholly true. Aye, I could guide you in the direction of that which you seek."},{"name":"ALBERIC","text":"That said, I yet have reservations. The sheer power of the dragon housed within is such that a great many of your Azure forebears─myself among them─have proven hopelessly incapable of wielding it."},{"name":"ALBERIC","text":"But I do not doubt what I see. Aye, within you has awakened a strength that forever eluded the likes of me. If you are not worthy of wearing the armor, then I know none who are."},{"name":"ALBERIC","text":"Remember my warning to you, <span class=\"highlight\">Forename</span>, and heed it well. Nidhogg is a lord among his kind. Aught less than complete conviction, and you will surely fall under his thrall."},{"name":"ALBERIC","text":"Before you can master your foe, you must needs master yourself. Hone your lance arm till it can bear no further honing, and then present yourself to me. When the time is come, I will tell you what you need to know."},{"name":"ALBERIC","text":"I look forward to our next meeting, my young dragoon."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":95,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":23}],"quests":[66606]},"next":[66608]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"action","id":"95","obj":{"i":95,"n":"Spineshatter Dive","c":2580,"j":22,"t":4,"l":45}},{"type":"quest","id":"66606","obj":{"i":66606,"n":"Double Dragoon","g":150,"l":"Coerthas Central Highlands","s":4,"f":1}},{"type":"quest","id":"66608","obj":{"i":66608,"n":"Into the Dragon's Maw","g":150,"l":"Coerthas Central Highlands","s":6,"f":1}}]}