{"quest":{"name":"The Pursuit of Power","location":"Ul'dah","id":66600,"patch":2.0,"sort":4,"icon":100105,"unlocksFunction":1,"eventIcon":71341,"issuer":1006749,"target":1006749,"genre":148,"journal":["Professor Erik would have you do his bidding yet again.","Professor Erik is ill pleased to discover that you and Widargelt gave him aetheric readings from the same location in your last outing. However, he has decided that this one error should not prevent you both from continuing in your capacity as his assistants. Once again, take the aetherometer given to you and travel to Larkscall in the East Shroud to record more field data.","You have dispatched the aetherbound kerns summoned forth by the presence of the aetherometer and finished taking the desired readings. Retrieve the professor's device.","You have gathered up the aetherometer. Head back to the Goldsmiths' Guild to deliver the latest batch of data to Professor Erik.","The professor can scarcely contain himself at the prospect of analyzing the results you have returned to him. However, he still seems to be harboring concerns over Widargelt. Speak with him again to learn more."],"objectives":["Set the aetherometer at Larkscall.","Retrieve the aetherometer.","Deliver the aetherometer to Erik at the Goldsmiths' Guild."],"dialogue":[{"name":"ERIK","text":"You two played me for a fool. The data the simpleton monk brought me was absolutely <span class=\"emphasis\">astounding</span>. Groundbreaking. Revolutionary. Yet I remained objective in my analysis, as a scholar must."},{"name":"ERIK","text":"Poring over the data, I finally arrived at a disheartening conclusion: the two of you took measurements of the same area! The values were near identical─equivalences mocking me as I struggled to reconcile them."},{"name":"ERIK","text":"I could neither sleep nor eat lest I waste time not drawing nearer the truth. And for what? Tell me. What is it you two were doing in the field?"},{"name":"ERIK","text":"Bah, not this bloody chakra nonsense again! How many times must I tell you? It is naught but imperceptible aether. Call it what it is!"},{"name":"ERIK","text":"And to think I had a mind to put your names under mine when my hypothesis was published! "},{"name":"ERIK","text":"This life force, this spiritual energy, this godsforsaken eternal soul essence─I care not what primitive nomenclature those backward monks wish to assign it. It is <span class=\"emphasis\">aether</span>, plain and simple!"},{"name":"ERIK","text":"They claim they are able to manipulate and amplify it through discipline and the opening of the so-called chakra. False! This is nothing more than the aetherial regulation of organisms─a basic and natural concept. In an attempt to explain that which science does not yet fully understand, the monks have erected an institution of control."},{"name":"ERIK","text":"Their preachings are unassailable by design─for none can disprove the existence of the unknowable. They promise power in return for abjection and servitude. Control and power, indeed! Only that of man! It is the very essence of a religion, and should be treated with contempt, as all religion should."},{"name":"ERIK","text":"Aether resides in all living things, as do natural mechanisms with the capacity to regulate it. This is simply life─not some mystical, supernatural endowment. "},{"name":"ERIK","text":"I concede, of course, that the heightened mental faculties of man allow for the potential to gain conscious control over those mechanisms. Indeed, it would appear that you and the simpleton monk have already achieved that end."},{"name":"ERIK","text":"&lt;sigh&gt; The indiscretion and impertinence of youth... I suppose it can be forgiven─<span class=\"emphasis\">once</span>. In my own youth, I was not the model of perfection you see before you. I too have made what some might call mistakes. Not myself, but some."},{"name":"ERIK","text":"In our talks together, the simpleton monk often spoke of the seventh chakra. Its awakening is thought to be the highest achievement among the monkhood. Aye, I make it a habit to know the tenets of my intellectual enemies."},{"name":"ERIK","text":"It was the flow of the aether within the two of you which betrayed your falsehood. The <span class=\"emphasis\">whispering of your chakra</span>, as I'm sure the monks would rush to call it."},{"name":"ERIK","text":"But serendipity most often visits the industrious! Just so, it is precisely these aetherial <span class=\"emphasis\">whispers</span> that proved to be most intriguing. The waves of these sounds resonated perfectly with the aether of the battleground!"},{"name":"ERIK","text":"I can see by your vapid expression that you are missing my point. Allow me to spell it out─it follows that if one were to visit a battlefield with a certain aetherial wave amplitude and frequency, it would resonate with one's <span class=\"emphasis\">own</span> aether!"},{"name":"ERIK","text":"This is the phenomenon responsible for the initial <span class=\"emphasis\">opening</span> of your own <span class=\"emphasis\">chakra</span>. &lt;sigh&gt; I cannot believe I am being reduced to speaking in these terms."},{"name":"ERIK","text":"It stands to reason that for any aetherial wave, there may be a location that will resonate with it. Think of the implications, <span class=\"highlight\">Forename</span>!"},{"name":"ERIK","text":"If the seventh chakra the monks speak of truly exists, then so, too, must an ultimate battleground to bond with it. The concentration of aether in such a place would be unlike anything ever recorded!"},{"name":"ERIK","text":"I forgive your past treachery, guide me as it did to this great discovery. That, and I need you to do more work for me. Here, take this new aetherometer."},{"name":"ERIK","text":"Make for Larkscall in the East Shroud. My research indicates it is a very promising tract indeed."},{"name":"ERIK","text":"Set up the aetherometer as you have others in the past, and then kill whatever you must to obtain a strong reading."},{"name":"ERIK","text":"Slaying beasts there will release the aether of the land they are steeped in, and it may then resonate with your own. I suppose in the primitive terms of the monkhood, that would translate to the expansion of your chakra."},{"name":"ERIK","text":"Oh, and you'll not be crossing paths with the simpleton monk this time. I will be sending him to take readings at East End. I've no intentions of allowing you two to conspire to impede my research again."},{"name":"ERIK","text":"If you care to know more about the events that have transpired at Larkscall, I suggest you pay a visit to your local library. East End, on the other hand, is a fascinating subject of which I never tire speaking. Ask me about it any time if your curiosity ever gets the better of you."},{"name":"ERIK","text":"I very much look forward to the readings of both your and Widargelt's aetherometers. What's this? You've already finished!? Then what are you standing there talking for? Come, come, give me the aetherometer!"},{"name":"ERIK","text":"Amazing... Simply amazing! And your soul crystal... It's glowing more vibrantly than ever before, is it not?"},{"name":"ERIK","text":"I will begin my analysis of the data with all haste! You've come to be quite the model pupil, <span class=\"highlight\">Forename</span>. Would that I could say the same of the monk simpleton. &lt;sigh&gt;"},{"name":"ERIK","text":"I can see the feeble gears turning in your mind. Come, there is no need to feel shame at your ignorance. If you wish to know what has transpired, you need only ask. I promise to use small words."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":16473,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":21}],"quests":[66599]},"next":[66601]},"partials":[{"type":"npc","id":"1006749","obj":{"i":1006749,"n":"Erik","l":41,"q":9}},{"type":"action","id":"16473","obj":{"i":16473,"n":"Four-point Fury","c":2544,"j":20,"t":3,"l":45}},{"type":"quest","id":"66599","obj":{"i":66599,"n":"A Slave to the Aether","g":148,"l":"Ul'dah","s":3,"f":1}},{"type":"quest","id":"66601","obj":{"i":66601,"n":"Good Vibrations","g":148,"l":"Ul'dah","s":5,"f":1}}]}