{"quest":{"name":"Good Vibrations","location":"Ul'dah","id":66601,"patch":2.0,"sort":5,"icon":100105,"unlocksFunction":1,"eventIcon":71341,"issuer":1006749,"target":1006749,"involved":[1007875,1007877],"genre":148,"usedItems":[3459,3683,3890,2898],"journal":["Professor Erik wishes to speak with you about Widargelt.","Widargelt has asked that you come see him. He awaits you at Little Ala Mhigo in southern Thanalan.","Widargelt explains to you how the war garb of a monk can strengthen the inner energy of the wearer and aid in opening the chakra. Though they are normally awarded only to those monks who pass prescribed trials, there is a set that was recently stolen. Widargelt is willing to gift these relics to you should you retrieve them. Two have been tracked to southern Thanalan, at the Sepulchre and the Circle of the Tempered, and the third to northern Thanalan, at the abandoned Amajina mythril mine.","You have obtained the three stolen relics. Return to Little Ala Mhigo in southern Thanalan and speak with Widargelt.","Widargelt tells you that the Fist of Rhalgr has tracked down the fourth stolen monk's relic. Travel to the Gods' Grip in lower La Noscea and track down the Qiqirn black market trader who has it.","You have defeated the thugs summoned to put an end to your prying. Interrogate the Qiqirn trader to learn what he knows.","You have gathered the fourth monk's relic. Return to Little Ala Mhigo and speak with Widargelt once more.","Professor Erik has made a revolutionary discovery based on the aetherial data he has collected. Widargelt anticipates that his work will mark the emancipation of Ala Mhigo from Garlean rule. Return to the Goldsmiths' Guild in Ul'dah and speak with Erik about this new development.","Erik intends to present his thesis to a conference of his academic peers upon its completion. Continue to travel the path of the monk until that day comes.<br><br>※The next monk quest will be available from Erik upon reaching level 50."],"objectives":["Speak with Widargelt at Little Ala Mhigo.","Retrieve the monk's relic from the Sepulchre.","Retrieve the monk's relic from the Circle of the Tempered.","Retrieve the monk's relic from the abandoned Amajina mythril mine.","Speak with Widargelt.","Speak with the Qiqirn trader at the Gods' Grip.","Speak with the Qiqirn trader.","Speak with Widargelt.","Speak with Erik at the Goldsmiths' Guild."],"dialogue":[{"name":"ERIK","text":"The simpleton monk asked that I send you his way should I see you. He waits for you at Little Ala Mhigo in southern Thanalan."},{"name":"ERIK","text":"Surely you see Widargelt for the danger he is. His is the most dangerous type of mind─one blinded by revolution and revenge."},{"name":"ERIK","text":"I do wish you'd tell him yourself that people should live for the future rather than the past."},{"name":"ERIK","text":"You thought I did not know he was of the Ala Mhigan Resistance? How saddening it is that on the rare occasions you <span class=\"emphasis\">do</span> trouble yourself to think, you are wrong. Of course I know. What manner of imbecile do you take me for?"},{"name":"ERIK","text":"No doubt Widargelt thinks <span class=\"emphasis\">me</span> the idiot. False! These two eyes see far more than you know. I, too, am an Ala Mhigan, and love my homeland every bit as much as he."},{"name":"ERIK","text":"Go now, hurry to Little Ala Mhigo. I will keep you no longer. No doubt Widargelt is already awaiting your arrival."},{"name":"WIDARGELT","text":"You spoke to Erik. Do not lie to me, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. You told him who I am─what I seek to do."},{"name":"WIDARGELT","text":"I am not angered. He tried to sway me from my path. He believes resistance will only leave more dead. I expected as much from him."},{"name":"WIDARGELT","text":"I feigned understanding. He asked much of me. Of the monkhood and the Fist. He asked of the seventh chakra."},{"name":"WIDARGELT","text":"My answers excited him. He said they would advance his studies. I too learned from him. I am nearer the seventh chakra now."},{"name":"WIDARGELT","text":"Soon the Resistance will rise. You too will see. Very soon."},{"name":"WIDARGELT","text":"Others do not understand. Ala Mhigo tried to protect them. We were the shield of the realm. <span class=\"emphasis\">We</span> bled to fend off Garlemald."},{"name":"WIDARGELT","text":"None here know our suffering! None here can imagine it. The lives we led after the fall. After the shield was sundered."},{"name":"WIDARGELT","text":"I have traveled far and wide. I have met many souls. But none are as you. You have a gift."},{"name":"WIDARGELT","text":"Yours is a great strength. Unite it to ours, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>."},{"name":"WIDARGELT","text":"Help us reclaim our home. Your efforts will be rewarded."},{"name":"WIDARGELT","text":"Look upon my garments. This is the war garb of the monkhood. It attunes to the wearer's chakra. Enables it to realize its fullest expression."},{"name":"WIDARGELT","text":"The cloth is imbued with the power of Rhalgr. Only monks of His Fist may don it. Only those who overcome many trials."},{"name":"WIDARGELT","text":"I will tell you how it can be yours. Fear not. I require you to speak no vows. "},{"name":"WIDARGELT","text":"I ask only that you fight with us. Give yourself to our cause."},{"name":"WIDARGELT","text":"You long for adventure. I understand. But such longings can wait. This cannot. See Ala Mhigo freed. Then enjoy your own freedoms. What say you, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>?"},{"name":"Q1","text":"Give yourself to Widargelt's cause?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"WIDARGELT","text":"Your decision saddens me. But know that my offer stands. I pray you change your mind."},{"name":"WIDARGELT","text":"You have the heart of a true monk. You are different from the others in this realm."},{"name":"WIDARGELT","text":"Hear this. A set of our war garb was stolen. The Fist has tracked the bandits. We know now where three of the relics are."},{"name":"WIDARGELT","text":"Here in southern Thanalan, the Sepulchre and the Circle of the Tempered. And in northern Thanalan, the abandoned Amajina mythril mine."},{"name":"WIDARGELT","text":"Your soul crystal will react to the relics. Draw near them, and they will glow. By this power, you can find them."},{"name":"WIDARGELT","text":"The Fist's honor has been trampled upon. Make the heretics you find pay for their sins."},{"name":"WIDARGELT","text":"Erik has sold his soul to this land. But he is a knowledgeable man. He knows more than I of the monkhood. And of the Fist."},{"name":"WIDARGELT","text":"Speak with him if you would know more of our way. The man revels in hearing himself speak."},{"name":"WIDARGELT","text":"I await the day we fight side by side, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Go now, and go well."},{"name":"WIDARGELT","text":"Travel to the Sepulchre and the Circle of the Tempered here in southern Thanalan. And to the abandoned Amajina mythril mine in northern Thanalan. There will you find the relics you seek."},{"name":"WIDARGELT","text":"You have returned. The first three relics are yours. And now, the Fist has located the fourth. "},{"name":"WIDARGELT","text":"There is a Qiqirn merchant who deals in contraband. The fourth relic is among his wares. Hurry to lower La Noscea. Find this Qiqirn. Take back that which is now yours by right."},{"name":"KIKIOROON","text":"Stinky [Race]! Come to stop Kikiroon's business. Come to take shinies! Kill <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>! Kill the stinky!"},{"name":"KIKIOROON","text":"Don't kill Kikiroon. P-Please don't kill! Take back monk circle. Take and spare!"},{"name":"WIDARGELT","text":"The fourth relic is now yours. You have done well, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. But know this. There is another relic. A fifth and final piece."},{"name":"WIDARGELT","text":"It will be yours. A gift, from brother to <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Given on the day Ala Mhigo stands free once more. That day is near."},{"name":"WIDARGELT","text":"Erik sent word not long ago. He claims his revolution has begun, as well. He has made a grand discovery. And is now setting it to paper."},{"name":"WIDARGELT","text":"I look forward to his work. With it, we will know all we must. The day he finishes will be the day Ala Mhigo is reborn."},{"name":"WIDARGELT","text":"Return to him now, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Ask for yourself when that day will be. May Rhalgr watch over you."},{"name":"ERIK","text":"I'm afraid I haven't time for you now, <span class=\"highlight\">Forename</span>. I am penning my thesis based on the aetherial data you and the simpleton collected. There have been significant developments since last we spoke. Or, rather, since last I spoke and you stood before me with that ever vapid expression."},{"name":"ERIK","text":"Soon, I will complete my work and present it at a conference of my peers. Surely you can pass the time until then punching and kicking and pursuing other monkly interests, yes? Go do that, then."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":21}],"quests":[66600]},"next":[66602]},"partials":[{"type":"npc","id":"1006749","obj":{"i":1006749,"n":"Erik","l":41,"q":9}},{"type":"npc","id":"1007875","obj":{"i":1007875,"n":"Widargelt","l":45,"q":1}},{"type":"npc","id":"1007877","obj":{"i":1007877,"n":"Qiqirn Trader","l":31,"q":1}},{"type":"item","id":"3459","obj":{"i":3459,"n":"Temple Gaskins","l":50,"c":45193,"t":36,"p":1000}},{"type":"item","id":"3683","obj":{"i":3683,"n":"Temple Gloves","l":50,"c":48341,"t":37,"p":1000}},{"type":"item","id":"3890","obj":{"i":3890,"n":"Temple Boots","l":50,"c":46846,"t":38,"p":1000}},{"type":"item","id":"2898","obj":{"i":2898,"n":"Temple Circlet","l":50,"c":40618,"t":34,"p":1000}},{"type":"quest","id":"66600","obj":{"i":66600,"n":"The Pursuit of Power","g":148,"l":"Ul'dah","s":4,"f":1}},{"type":"quest","id":"66602","obj":{"i":66602,"n":"Five Easy Pieces","g":148,"l":"Ul'dah","s":6,"f":1}}]}