{"quest":{"name":"Five Easy Pieces","location":"Ul'dah","id":66602,"patch":2.0,"sort":6,"icon":100105,"unlocksFunction":1,"eventIcon":71341,"issuer":1006749,"target":1007899,"involved":[1007887],"genre":148,"journal":["Professor Erik looks overjoyed.","Widargelt disappeared immediately after hearing Professor Erik reveal his revolutionary discovery. The professor suspects he may have made for Silvertear Falls in Mor Dhona─the location he believes capable of unlocking the seventh chakra. Find Widargelt and try to speak some sense to him.","As a result of the epic struggle to deny Widargelt his seventh chakra, it is yours that has fully opened. Speak with the defeated and devastated Widargelt, and see if the veil of vengeance which blinded him has at last been lifted.","Widargelt gifts you the fifth and final relic, completing your monk's war garb. He has realized the error of his ways, and learned the most important lesson of all from Professor Erik: the true responsibility of the monk is to fight for life, not revenge. Take to heart Erik's words as Widargelt did, and wield your arts so that the realm might one day know peace.<br><br>※The next monk quest will be available from Erik once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Find Widargelt south of Revenant's Toll.","Speak with Widargelt.","Defeat Widargelt!"],"dialogue":[{"name":"ERIK","text":"Muahahahaha! My theory was correct! Correct, I tell you!"},{"name":"ERIK","text":"This will be the greatest academic breakthrough of my lifetime! Perhaps of <span class=\"emphasis\">all</span> lifetimes!"},{"name":"ERIK","text":"I shall spare you the details of my experiment─as you are not like to comprehend their significance anyway─and proceed directly to the all-important conclusion!"},{"name":"ERIK","text":"The announcement of my theory before a council of my peers was met with thunderous applause!"},{"name":"ERIK","text":"And to think I owe it all to a vacant-eyed adventurer and a simpleton monk! Both you and the Pugilists' Guild that sent you are due a debt of gratitude."},{"name":"ERIK","text":"Speaking of the monk, where in Eorzea has the semiliterate oaf wandered off to? I took note of his attendance among the spectators at the conference, but he has yet to present himself and offer his congratulations."},{"name":"ERIK","text":"<span class=\"emphasis\">...Aaahhh</span>!"},{"name":"ERIK","text":"What have I done!? <span class=\"highlight\">Forename</span>, I fear the words I offered may have driven Widargelt to attempt the insane."},{"name":"ERIK","text":"I analyzed the aetherial waves of your bodies, second by second. I was able to isolate and identify those of the final aetherial regulation mechanism─the so-called seventh chakra! From that, I was able to find the land which was most likely to resonate with those waves."},{"name":"ERIK","text":"Silvertear Falls! I went to the site myself to investigate, and it was there that I made my great discovery─the discovery of the century!"},{"name":"ERIK","text":"&lt;sigh&gt; It occurs to me that you shall never accomplish such a feat of the mind, <span class=\"highlight\">Forename</span>, and I find myself pitying you. But I digress."},{"name":"ERIK","text":"Do you not see what I have done, <span class=\"highlight\">Forename</span>! I told him <span class=\"emphasis\">precisely</span> where he must go to unlock the seventh chakra!"},{"name":"ERIK","text":"He has given his life to the fight to reclaim Ala Mhigo from the Empire. More than anything, he desires the power needed to achieve that end─the power to combat the might of all Garlemald."},{"name":"ERIK","text":"Any fool can see that─ Ahem, <span class=\"emphasis\">almost</span> any fool can see that he imagines the seventh chakra to be that power!"},{"name":"ERIK","text":"Yet battling the Empire on such terms will only result in another tragedy like that which befell Ala Mhigo. I pray you do not mean to follow him in this fool's crusade."},{"name":"ERIK","text":"He has gone to Silvertear Falls in Mor Dhona. I am certain of it! You must go, <span class=\"highlight\">Forename</span>! You must stop him!"},{"name":"ERIK","text":"My words will not sway him─just as they could not sway my son. Perhaps yours will. "},{"name":"WIDARGELT","text":"You claim the power of Garlemald? Fools. Power outside your own cannot be trusted. You had no hope of defeating me."},{"name":"WIDARGELT","text":"The seventh chakra swells within me. Soon it will open. When it does, the Empire will burn."},{"name":"WIDARGELT","text":"The power of magitek... The power of Garlemald..."},{"name":"WIDARGELT","text":"They are nothing."},{"name":"WIDARGELT","text":"Ala Mhigo fell to these!?"},{"name":"WIDARGELT","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. You are late."},{"name":"WIDARGELT","text":"But perhaps that is best. I have just attended our Garlean guests."},{"name":"WIDARGELT","text":"I wanted us to be alone. "},{"name":"WIDARGELT","text":"Erik was right. This is the place. You have come. Our chakra beat as drums..."},{"name":"WIDARGELT","text":"Do you not feel it, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>?"},{"name":"WIDARGELT","text":"Living in constant fear of death. Struggling to stay warm enough to sleep. Eating crumbs to fight hunger."},{"name":"WIDARGELT","text":"Garlemald took everything from Ala Mhigo! They left us <span class=\"emphasis\">nothing</span>! Not even our pride. Look to the craven teacher. He is proof of the truth I speak."},{"name":"WIDARGELT","text":"I will reclaim it. <span class=\"emphasis\">All</span> of it. But I need great power to do so. That power rests in the seventh chakra."},{"name":"WIDARGELT","text":"I made you a promise. I have not forgotten. The fifth and final piece. It is yours to claim. But only if you defeat me."},{"name":"WIDARGELT","text":"I told you when we first met. We monks seek sacred ground. There we train. That is how the chakra are opened."},{"name":"WIDARGELT","text":"The teacher told me himself. <span class=\"emphasis\">This</span> is where the seventh chakra opens. This is my sacred battleground. The ground of battle between you and me. Your strength has peaked. Through it, mine will grow."},{"name":"WIDARGELT","text":"Do not despair. Your death will have purpose. It will be for Ala Mhigo."},{"name":"WIDARGELT","text":"Rejoice, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>..."},{"name":"WIDARGELT","text":"You shall die a martyr!"},{"name":"WIDARGELT","text":"So close... Why? Why will you not yield your power? For the greater good..."},{"name":"WIDARGELT","text":"Stay back! This power...is mine!"},{"name":"WIDARGELT","text":"The others of Eorzea ignore our suffering. Why should I care for their lives? Why should I care for yours?"},{"name":"WIDARGELT","text":"I <span class=\"emphasis\">must</span> have that power. I must protect my people. "},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>... That power..."},{"name":"ERIK","text":"That light! Never have I seen any like it. Is this the opening of the seventh chakra? Fascinating! Simply fascinating!"},{"name":"ERIK","text":"You have no mind for study, but your gift for fieldwork is extraordinary indeed."},{"name":"WIDARGELT","text":"Wh-Why!?"},{"name":"WIDARGELT","text":"Why did you strike me?"},{"name":"ERIK","text":"Silence, you bloody fool! You oaf! You idiot! "},{"name":"ERIK","text":"I would strike you a thousand times more if it did not pain my hand so. Next time, I shall bring a stick!"},{"name":"ERIK","text":"Bugger opening your infernal chakra, and open your bloody <span class=\"emphasis\">ears</span> for once! Cid Garlond of the Ironworks that bear his name once wrote that these Silvertear Falls lie at the center of our world."},{"name":"ERIK","text":"Our world is round, and we live on its surface. Even you should see, then, that he did not speak of a center in the physical sense."},{"name":"ERIK","text":"I am no astrologian, nor a biologist, but I have studied enough of the various sciences to say this:"},{"name":"ERIK","text":"The vital energy of Hydaelyn, that which is called aether, is one and the same as the life force in which you monks believe. As the center of our world, these Silvertear Falls are connected to what you call chakra in an inexplicably profound way."},{"name":"ERIK","text":"We all share in the same existence. We are neither separate nor distinct from the world. Our energy and its energy are one. "},{"name":"ERIK","text":"At times, that energy may wreak havoc and destruction, but it plays a far grander and more significant role."},{"name":"ERIK","text":"To bring forth life! As part of this world, you must endeavor to do the same."},{"name":"ERIK","text":"You sought only to gain power by force. In that, you are no different than the very Garleans you seek to destroy. Is this what you truly wish to be?"},{"name":"WIDARGELT","text":"You speak pretty words. But would you speak them to our people? To every soul who has suffered?"},{"name":"WIDARGELT","text":"To children with empty bellies? To wives made widows?"},{"name":"ERIK","text":"I would."},{"name":"ERIK","text":"To every last soul among them. "},{"name":"ERIK","text":"Even if they failed to grasp their meaning, as you do now. I would, and <span class=\"emphasis\">will</span>, speak those words until they are understood."},{"name":"ERIK","text":"Long have I studied the history of this realm's wars. If there is aught I have learned, it is that there is no future for Eorzea should her people struggle and vie for power without considering the consequences of their doing so."},{"name":"ERIK","text":"With great power comes great responsibility. To seize the former and deny the latter is to beget despair."},{"name":"ERIK","text":"The duty we owe to one another, and to this world as part of it, is to use what power we possess to deliver a future full of life─not death. Can you truly not see the right in this?"},{"name":"ERIK","text":"You have done the realm, indeed the world, a great service, <span class=\"highlight\">Forename</span>."},{"name":"ERIK","text":"As a scholar, as a teacher, as an Ala Mhigan, as a man─I offer you my deepest thanks."},{"name":"ERIK","text":"Widargelt is stubborn, as most monks are. I do not know if it will be possible for him to change his mind. But I pray he does. For his own sake, and for the world's."},{"name":"ERIK","text":"He calls you his <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Go now. Speak to him as one."},{"name":"WIDARGELT","text":"Not long ago, I spoke with a man. An Ala Mhigan. He too was of the Resistance. He asked me a simple question. Why do I fight?"},{"name":"WIDARGELT","text":"I did not hesitate. I did not think. The word came of its own will─<span class=\"emphasis\">revenge</span>."},{"name":"WIDARGELT","text":"He said revenge is in all our hearts. That it is the most common of reasons. The easiest. And the most dangerous."},{"name":"WIDARGELT","text":"I did not think on it then. Perhaps now I should."},{"name":"WIDARGELT","text":"I thought of nothing else. But you thought of me, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. You and the teacher. For that I thank you both."},{"name":"WIDARGELT","text":"I made a promise. I will keep it. The fifth piece is yours. It is meant for you. For one whose seventh chakra is open."},{"name":"WIDARGELT","text":"Ala Mhigo fought to protect itself. To protect all Eorzea from the Empire."},{"name":"WIDARGELT","text":"And yet we are despised. Ignored. Worse, we are forgotten."},{"name":"WIDARGELT","text":"Even so, the teacher preached peace. For a long time, I did not understand. I hated him for it."},{"name":"WIDARGELT","text":"Ala Mhigans are a proud people. This pride is strong in me. And in the teacher. As it was in his son."},{"name":"WIDARGELT","text":"He fought in the Resistance. Yet it cost him his life. He, too, cursed his father for being a coward."},{"name":"WIDARGELT","text":"I wish I could speak to him. I wish to tell him this is not so."},{"name":"WIDARGELT","text":"Farewell, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. May Rhalgr watch over you."},{"name":"SYSTEM","text":"This concludes the monk quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next monk quest will be available from Erik."},{"name":"TALK","text":"コンプリート"},{"name":"QIB","text":"The seventh chakra must be opened. And only your death will serve. Ala Mhigo thanks you, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>."},{"name":"QIB","text":"The seventh chakra... Yours has begun to open."},{"name":"QIB","text":"But only one can─and it will be mine. The future of Ala Mhigo depends on it!"},{"name":"QIB","text":"The energy wells within me. Come. Let us end this <span class=\"emphasis\">now</span>!"},{"name":"QIB","text":"Hahaha! Such power! Nothing can stop me!"}],"reward":{"action":69,"items":[{"id":3221},{"id":20643}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":21}],"quests":[66601]},"next":[66657,67562]},"partials":[{"type":"npc","id":"1006749","obj":{"i":1006749,"n":"Erik","l":41,"q":9}},{"type":"npc","id":"1007899","obj":{"i":1007899,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1007887","obj":{"i":1007887,"n":"Erik","l":67,"q":1}},{"type":"action","id":"69","obj":{"i":69,"n":"Perfect Balance","c":217,"j":20,"t":4,"l":50}},{"type":"item","id":"3221","obj":{"i":3221,"n":"Temple Cyclas","l":55,"c":43092,"t":35,"p":1000}},{"type":"item","id":"20643","obj":{"i":20643,"n":"Melee Attire Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66601","obj":{"i":66601,"n":"Good Vibrations","g":148,"l":"Ul'dah","s":5,"f":1}},{"type":"quest","id":"66657","obj":{"i":66657,"n":"A Relic Reborn (Sphairai)","g":148,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67562","obj":{"i":67562,"n":"The Legend Continues","g":148,"l":"Ul'dah","s":500,"f":1}}]}