{"quest":{"name":"Eye of the Dragon","location":"Gridania","id":66603,"patch":2.0,"sort":1,"icon":100104,"unlocksFunction":1,"eventIcon":71341,"issuer":1000254,"target":1006748,"involved":[1006375,1007564],"genre":150,"journal":["Ywain seeks your aid in assisting an old friend.","An Ishgardian friend of Ywain's requires aid, and the guildmaster would have you provide it. Make your way to the Observatorium and seek out the man, a knight by the name of Ser Alberic.","Ser Alberic has enlisted your aid in tracking down the Eye, a priceless Ishgardian relic that has been spirited away by a rogue dragoon named Estinien. Consult with Logedanrel for insight as to where the fugitive may have traveled.","Logedanrel suggests that you speak to the sentry Idristan at Florentel's Spire and inquire as to whether he has seen a man matching Estinien's description.","Idristan of Florentel's Spire insists that no dragoon in black armor has crossed the border. Return to Logedanrel and inform him that your trip was unfruitful.","Logedanrel suspects that the fugitive might still be in hiding within Ishgardian borders. Search the cavern east of the Observatorium for signs of a visitor.","Upon searching the campfire, you were ambushed by a dragoon clad in black steel. Return to Ser Alberic and tell him of your encounter.","Upon hearing of your encounter, Ser Alberic confesses to you the truth. The dragoon you encountered was indeed Estinien, who is no ordinary thief, but rather the Azure Dragoon─the chosen one─and a former pupil of Ser Alberic's. Convinced that you have been chosen by the Eye, Ser Alberic tasks you with retrieving the relic from Estinien.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 35."],"objectives":["Speak with Ser Alberic at the Observatorium.","Speak with Logedanrel.","Speak with Idristan at Florentel's Spire.","Speak with Logedanrel at the Observatorium.","Examine the campfire.","Report to Alberic."],"dialogue":[{"name":"YWAIN","text":"Ah, I daresay you might just be the right <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job. The guild has urgent need of a capable lancer for a mission beyond our nation's borders. Hear me out, if you will."},{"name":"YWAIN","text":"I've received word from an Ishgardian friend to the effect that he requires our aid. I would have you go and provide that aid."},{"name":"YWAIN","text":"As you may already know, due to her ongoing conflict with the dragons, Ishgard has kept her gates closed to outsiders for some time. The occasional dragoon on patrol duty is about all folk see these days."},{"name":"YWAIN","text":"In spite of her self-imposed isolation, however, the Holy See has never failed to honor her obligations to her allies."},{"name":"YWAIN","text":"It is only fitting that we answer the call and lend what assistance we can. To this end, we offered to dispatch a contingent of Wood Wailers with all haste─but were politely informed that they would not be welcome, much to our initial confusion."},{"name":"YWAIN","text":"It was later explained that we are dealing with a matter of some sensitivity, best handled by individuals who are capable and trustworthy, yet unbound by allegiance─and who fits that description save adventurers?"},{"name":"YWAIN","text":"Secrecy being paramount, I can provide no details as to the nature of the task. All you need to know will be revealed at the rendezvous point."},{"name":"YWAIN","text":"Should you accept the mission, take yourself to the Observatorium. A knight by the name of Ser Alberic will receive you upon arrival."},{"name":"ALBERIC","text":"Ah, you must be the adventurer of whom Ywain sent word. Greetings and well met."},{"name":"ALBERIC","text":"I am Ser Alberic Bale, knight of Ishgard. The Holy See is much obliged to you for your aid."},{"name":"ALBERIC","text":"Time being of the essence, I shall proceed straight to the heart of the matter. The Eye, an Ishgardian relic of immeasurable worth, has been stolen, and we have reason to believe the culprit has come this way. So it is that we ask your assistance in its recovery."},{"name":"ALBERIC","text":"The thief has been identified as a man named Estinien, a dragoon sworn to the service of the Holy See. Aye, you heard true: the crime was perpetrated by one of our own; an individual in a position of trust and no little honor... You may be assured that a fate worse than death awaits him upon capture."},{"name":"ALBERIC","text":"My duties to the See afford me little opportunity to travel far beyond the walls of Ishgard. I must confess to a grave ignorance of recent Gridanian affairs."},{"name":"ALBERIC","text":"I was told that a sentry by the name of Logedanrel might have knowledge of routes oft taken by Ishgardian fugitives. I would prefer to keep my identity a secret, and thus would have you gather what information you can from the man."},{"name":"ALBERIC","text":"We must act quickly. For you see, Estinien is..."},{"name":"ALBERIC","text":"...But I have already said too much. What matters is that we find our thief and the Eye with all haste. When last sighted, Estinien was clad in black armor. Now go, and speak not a word of what I have told you to anyone."},{"name":"LOGEDANREL","text":"Routes favored by Ishgardian fugitives? Now that's a question I don't hear every day. You aren't plotting some unsavory act yourself, are you?"},{"name":"LOGEDANREL","text":"Even if you were, I doubt you'd make it far. Anyroad, we've caught a few fleeing to the North Shroud. What with Gridania being home to nearly as many Elezen as Ishgard, it is no easy task to identify outsiders."},{"name":"LOGEDANREL","text":"If you're on the hunt for someone, you could do worse than to visit Florentel's Spire in the North Shroud and speak with a man named Idristan. If any suspicious persons have crossed the border in recent days, he'd be the first to know."},{"name":"IDRISTAN","text":"Hail, adventurer. Yes, I am the one tasked with monitoring those who would enter our lands by way of Coerthas. Hm? An Ishgardian knight clad in black armor?"},{"name":"IDRISTAN","text":"No, I recall nothing of the sort─and such a striking visitor would be difficult to forget. My apologies, friend. I can only suggest that you return to Logedanrel and see if he has any other theories."},{"name":"LOGEDANREL","text":"No luck, you say? Most curious. Why, it is nigh impossible that a fugitive could make it this far without being espied from Florentel's Spire."},{"name":"LOGEDANREL","text":"Which leaves the possibility that your man is still in Ishgard. It runs counter to good sense─would the fugitive not want to put a distance of grounds between him and his pursuers?─but by the process of deduction, it is a possibility."},{"name":"LOGEDANREL","text":"The climes of Ishgard are not kind to drifters and vagabonds. That said, there has been talk of curious smoke wafting from a cave east of here, at night. Were I you, I might begin my search there."},{"name":"ESTINIEN","text":"That Ishgard would resort to sending coin-starved adventurers after me... I know not whether to laugh or feel insulted."},{"name":"ESTINIEN","text":"Th-The Eye! It rouses...for another!?"},{"name":"ESTINIEN","text":"Preposterous..."},{"name":"ESTINIEN","text":"Our paths shall cross again. You can be sure of it."},{"name":"ALBERIC","text":"A dragoon clad in black, you say!? Tell me all that transpired!"},{"name":"ALBERIC","text":"By the Fury... That the Eye would choose another..."},{"name":"ALBERIC","text":"I had not thought it possible. In light of recent events, it would seem an explanation is in order."},{"name":"ALBERIC","text":"The Eye is no ordinary relic. It harbors the power of the dragon, which it bestows upon a single chosen soul─the strongest and wisest dragoon."},{"name":"ALBERIC","text":"He who is chosen is possessed of the power to fight our mortal foes, the dragons of Dravania, on equal footing, soaring the firmament as if it were an extension of the land. That man is known as the Azure Dragoon."},{"name":"ALBERIC","text":"The Azure Dragoon is the light of hope for all Ishgardians, and the paragon of all dragoons."},{"name":"ALBERIC","text":"...For this reason, you may imagine how it pains me to have to confess that the man you encountered, the <span class=\"emphasis\">thief</span>, is none other than the Azure Dragoon...and that <span class=\"emphasis\">I</span> was once his teacher."},{"name":"ALBERIC","text":"Needless to say, I acknowledge myself accountable for Estinien's misdeeds, and mean to do all in my power to find him and recover the Eye. But I cannot do this alone."},{"name":"ALBERIC","text":"I require your help, <span class=\"highlight\">Forename</span>─you, who have received the power of the dragon."},{"name":"ALBERIC","text":"You may labor to believe it, but there can be no mistake. The Soul of the Dragoon I bear glows in your presence─irrefutable proof that you are chosen. What I can ill explain, however, is the why of it."},{"name":"ALBERIC","text":"Never before in Ishgard's long history has the Eye roused to more than one individual in a single generation. But it avails us naught to cudgel our brains about it."},{"name":"ALBERIC","text":"The fact of the matter is that you are now a vessel for the power of the dragon. That dragon lies yet in slumber, however, and you must needs possess the means to wake it: the Soul of the Dragoon. I would entrust you with mine, <span class=\"highlight\">Forename</span>."},{"name":"ALBERIC","text":"Like Estinien, I once ruled the skies as the Azure Dragoon, although that power has since become lost to me. It was simply by force of habit that I have hitherto kept the soul upon my person."},{"name":"ALBERIC","text":"I have no inkling as to why the Eye has seen fit to choose a second, and an outsider at that."},{"name":"ALBERIC","text":"Yet one thing is clear: none can challenge the Azure Dragoon and conceivably prevail save another Azure Dragoon."},{"name":"ALBERIC","text":"You are our only hope of bringing Estinien to justice and reclaiming the Eye. Of course, I do not ask that you do this unaided. I may be a dragoon no more, but what knowledge I have, I shall gladly impart to you."},{"name":"ALBERIC","text":"For indeed, when the time comes that you must face the Azure Dragoon, naught less than complete mastery over the power of the dragon will avail you."},{"name":"ALBERIC","text":"That a perilous road lies ahead of you, I shall not deny. Knowing this, if you would still lend me your lance, I will teach you to harness the power that has chosen you."},{"name":"ALBERIC","text":"Go forth, my young dragoon, and rouse the dragon within. I look forward to your return."},{"name":"SYSTEM","text":"The next dragoon quest will be available from Alberic upon reaching level 35."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"ACCESS","text":"The enemy is still about!"}],"reward":{"action":92,"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":5}],"questsType":"all","quests":[65975,66049]},"next":[66604]},"partials":[{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1006375","obj":{"i":1006375,"n":"Idristan","l":57,"q":2}},{"type":"npc","id":"1007564","obj":{"i":1007564,"n":"Logedanrel","l":63,"q":1}},{"type":"action","id":"92","obj":{"i":92,"n":"Jump","c":2576,"j":22,"t":4,"l":30}},{"type":"quest","id":"65975","obj":{"i":65975,"n":"Proof of Might","g":130,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66604","obj":{"i":66604,"n":"Lance of Fury","g":150,"l":"Coerthas Central Highlands","s":2,"f":1}}]}