{"quest":{"name":"Lance of Fury","location":"Coerthas Central Highlands","id":66604,"patch":2.0,"sort":2,"icon":100104,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1006748,"involved":[1007856],"genre":150,"journal":["Ser Alberic would have you undertake a trial.","The fugitive Estinien is known to be one of the most formidable dragoons in Ishgardian history. To fully prepare you for the pursuit of such a dangerous opponent, Ser Alberic would have you undergo further training. Make your way to Witchdrop in the central highlands of Coerthas, and seek out the knight Ser Brucemont.","You have successfully passed the surprise trial set on you by Ser Brucemont. Speak with the knight once more to see what he has to say.","Your passing the trial has earned you Ser Brucemont's grudging respect. Return to the Observatorium and inform Ser Alberic of what has transpired.","Ser Alberic observes that the soul of the dragon grows ever stronger within you. Continue to hone your skills, that one day you may face Estinien as his equal.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 40."],"objectives":["Speak with Brucemont.","Report to Alberic."],"dialogue":[{"name":"ALBERIC","text":"It is pleasing to see how readily the dragon stirs within you. You show great potential, <span class=\"highlight\">Forename</span>─a potential that may well prove the difference between victory and defeat."},{"name":"ALBERIC","text":"Estinien is no ordinary dragoon. Even when set against the legendary Azures of ages past, the man is considered second to none. Such is his prowess, in fact, that the day he was chosen by the Eye, it was proclaimed that Haldrath the Dragonseye had been reborn."},{"name":"ALBERIC","text":"I mean not to disparage your skills, <span class=\"highlight\">Forename</span>, but to pursue Estinien in your current state would be tantamount to suicide. As promised, I shall train you in the way of the dragoon, that you might face Estinien as an equal."},{"name":"ALBERIC","text":"Before we commence, however, it is only fitting that you are edified regarding our origins. It all began a millennium past, when our forebears resided in the southern plains in humble circumstances."},{"name":"ALBERIC","text":"The Fury, impressed by the spirit of our ancestors, decided it was meet that She make them Her own. So did She appear before Haldrath's sire, a man of courage and integrity named Thordan, and bade him lead Her people to the Promised Land─to what would become the great nation of Ishgard."},{"name":"ALBERIC","text":"Their journey brought them to a wide chasm, whereupon Thordan and his people set to building a bridge. It was then that a dark shadow descended upon them─the great wyrm Nidhogg. Heedless of his own safety, Thordan fearlessly charged at the colossal beast. Alas, he was pushed into the chasm by one of his own, a man seduced by the wyrm, and fell to his death."},{"name":"ALBERIC","text":"Taking up his slain sire's lance, Haldrath hurled himself at Nidhogg, even as tears streamed down his face. The confrontation ended when the young man, his hand guided by Halone, landed a mighty thrust that prised out Nidhogg's eye. With a terrible roar of pain, the great wyrm took wing and fled, while jubilation reigned below."},{"name":"ALBERIC","text":"Ishgard's priceless relic is none other than the eye taken from Nidhogg that day. It is a veritable wellspring of dragon power─even so removed from its owner, it can exert control over the hearts of men."},{"name":"ALBERIC","text":"Haldrath himself felt its malign influence, but his love of justice brooked no corruption, and he prevailed over the power, claiming it for his own. And so it was that the first Azure Dragoon was born."},{"name":"ALBERIC","text":"Being derived from our foe, the power of the dragon is a thing to be loathed."},{"name":"ALBERIC","text":"But as Haldrath proved to us all, so long as our hearts burn with justice, we need not fear being taken in its thrall."},{"name":"ALBERIC","text":"Ah, but what is justice, precisely? Justice assumes many shapes and forms, <span class=\"highlight\">Forename</span>, and none can say that one is greater than another. So long as you hold fast to your beliefs and stay true to yourself, you leave no room for the power of the dragon to master you."},{"name":"ALBERIC","text":"But enough of history─let us return our attention to the present. A knight by the name of Ser Brucemont will see to the next stage of your training. Seek him out at Witchdrop."},{"name":"BRUCEMONT","text":"So the adventurer seeks to become a dragoon. Hah! Ser Alberic speaks of legends and chosen ones, but I would see you prove yourself in a more practical fashion─with your lance. Defend yourself!"},{"name":"BRUCEMONT","text":"You have some skill─I will give you that. And the glow of your soul crystal...perhaps Ser Alberic was not wrong about you, after all. Now return to him─your training here is complete."},{"name":"ALBERIC","text":"The soul of the dragon grows ever stronger within you, <span class=\"highlight\">Forename</span>. Clearly, your trial was a rousing success─I need only observe your crystal to know as much."},{"name":"ALBERIC","text":"Yes. Though you have only just begun to walk the path of the dragoon, it is clear you possess the talent to become Estinien's equal. Go forth and make the powers you have obtained your own. When the time is right, we shall proceed with your training."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":94,"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":23}],"quests":[66603]},"next":[66605]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1007856","obj":{"i":1007856,"n":"Brucemont","l":63,"q":1}},{"type":"action","id":"94","obj":{"i":94,"n":"Elusive Jump","c":2577,"j":22,"t":4,"l":35}},{"type":"quest","id":"66603","obj":{"i":66603,"n":"Eye of the Dragon","g":150,"l":"Gridania","s":1,"f":1}},{"type":"quest","id":"66605","obj":{"i":66605,"n":"Unfading Skies","g":150,"l":"Coerthas Central Highlands","s":3,"f":1}}]}