{"quest":{"name":"Taking the Black","location":"Ul'dah","id":66609,"patch":2.0,"sort":1,"icon":100102,"unlocksFunction":1,"eventIcon":71341,"issuer":1002279,"target":1006752,"genre":154,"journal":["Yayake has need of a talented thaumaturge.","Yayake of Arrzaneth Ossuary has asked you to ascertain the truth of a prophecy being spoken by one Ququruka, a prisoner who claims to hear the voice of Nald'thal. To do this, proceed to Highbridge in eastern Thanalan and investigate the planar fissure that is said to be there. Once looked into, fell any fiends that emerge, and secure a vial of their blood.","You have obtained a vial of fresh blood. Pour it into the planar fissure that remains.","After pouring the voidsent blood into the planar fissure, an Amalj'aa named Kazagg Chah appears and presents you with the Gem of Shatotto. Take the gem and word of your feat back to Yayake at the Thaumaturges' Guild.","Yayake is surprised to see that the so-called “prophecy” carried with it some legitimacy, but is even more surprised when the prophecy maker himself, Ququruka, makes an appearance in the guild. After hurling a few well-timed insults in Yayake's general direction, the self-proclaimed black mage bids you proceed to Milvaneth Sacrarium. Once there, speak with his companion, Lalai.","Upon arriving at the Sacrarium, you learn that Ququruka is preoccupied with his meditations, and has entrusted Lalai with guiding you along the path of the black mage. Continue your study into the black arts, and return when you feel the arcane might within you has grown.<br><br>※The next black mage quest will be available from Lalai upon reaching level 35."],"objectives":["Investigate the planar fissure at Highbridge and procure the blood of any fiends that emerge.","Pour the voidsent blood into the planar fissure.","Speak with Yayake at the Thaumaturges' Guild.","Report to Lalai at Milvaneth Sacrarium."],"dialogue":[{"name":"YAYAKE","text":"<span class=\"highlight\">Forename</span>. I've been waiting for you─in a way. Please, let me explain. Do you know of the Marasaja Pit? It is a prison, here in Ul'dah."},{"name":"YAYAKE","text":"In prison, a man will do most anything to keep his mind occupied. Of late, one inmate claims to hear the voice of Nald'thal. No doubt he has lost his mind after serving one hundred years of a life sentence."},{"name":"YAYAKE","text":"But, he knew of you by name, <span class=\"highlight\">Forename</span>, and maintains the Traders demand you win the Gem of Shatotto and exchange it for his release."},{"name":"YAYAKE","text":"A farce, no doubt. I make it for nothing more than the maniacal ravings of a cell–crazed, sweaty–toothed madman. But I fear the only way to be sure is to free him of the Pit."},{"name":"YAYAKE","text":"The prisoner's name is Ququruka Tataruka, and as if his story were not proof enough of his lunacy, he also styles himself a black mage."},{"name":"YAYAKE","text":"But such magic was lost to Eorzea centuries ago. Who does this senile charlatan think he will fool with such rubbish?"},{"name":"YAYAKE","text":"&lt;sigh&gt; Nevertheless, he has invoked the name of Nald'thal, and so the Order feels it unwise to ignore his words. Though I am still no believer, you have come, as he said you would."},{"name":"YAYAKE","text":"So let us get to the bottom of this, shall we? It may be that you are an agent of fate, or perhaps you are merely a crooked old man's accomplice."},{"name":"YAYAKE","text":"In either case, I ask that you travel to Highbridge in eastern Thanalan. Seek out the planar fissure─a rift between this world and the next. Fell whatever beasts might lurk there, and water the earth with their blood."},{"name":"YAYAKE","text":"According to our gaoled mummer, doing so will give rise to the Gem of Shatotto."},{"name":"YAYAKE","text":"The gem is no more than a pretty stone oft mentioned in bedtime stories and the tales of faeries. We shall see if it truly exists."},{"name":"YAYAKE","text":"I shall await your findings here. Return to me when the deed is done."},{"name":"KAZAGGCHAH","text":"(-???-)[Job], hear me."},{"name":"KAZAGGCHAH","text":"Put up your weapon, friend. Kazagg Chah means you no harm."},{"name":"KAZAGGCHAH","text":"So you are the one of whom Ququruka's prophecy speaks."},{"name":"KAZAGGCHAH","text":"By your hand was the blood of these creatures spilt upon this earthen vein, was it not?"},{"name":"KAZAGGCHAH","text":"Then you have earned this Gem of Shatotto. Take it. You will know what to do with it when the time comes."},{"name":"KAZAGGCHAH","text":"With this, my part is done. Farewell, for now."},{"name":"YAYAKE","text":"Well, you certainly <span class=\"emphasis\">smell</span> as though you've been off spilling blood. But it will take more than a waft of foulness to convince me you are an agent of divine will. I take it yours was an eventful journey?"},{"name":"YAYAKE","text":"&lt;gasp&gt; I-It is exactly as described in the tales! Could it truly be...? The Gem of Shatotto?"},{"name":"YAYAKE","text":"Twelve be good, I can <span class=\"emphasis\">feel</span> the magic pulsing within it!"},{"name":"YAYAKE","text":"The tales tell that only souls blessed by the grace of Nald'thal are entrusted with the keeping of the gem."},{"name":"YAYAKE","text":"This is beyond mere coincidence. I must investigate further."},{"name":"YAYAKE","text":"And you must assist me, <span class=\"highlight\">Forename</span>. This now involves you as much as any other."},{"name":"YAYAKE","text":"Still, I cannot shake my inner skeptic. If Ququruka somehow made contact with the outside world, he may be manipulating adventurers such as yourself for ends yet unknown to us."},{"name":"YAYAKE","text":"I will call an emergency council of the Order. Please, wait here."},{"name":"QUQURUKA","text":"(-???-)That will not be necessary."},{"name":"YAYAKE","text":"Ququruka!? What are you doing here? How have you escaped the Pit?"},{"name":"LALAI","text":"Watch your tongue, you insolent fool! Master has passed a century in meditation communing with Nald'thal. You will address him with the proper respect!"},{"name":"QUQURUKA","text":"The gaolers of the Marasaja Pit are very different from the heretics of your Order. Suffice it to say they had wisdom enough to listen."},{"name":"QUQURUKA","text":"Must I remind you again? The will I speak is that of Nald'thal Himself. The true criminal is he who ignores the words of a god."},{"name":"YAYAKE","text":"Beware, Ququruka. The Twelve seldom spare those who claim Their voice. This mummer's farce will bring disaster to us all."},{"name":"QUQURUKA","text":"The cause of the disaster to come will be no words of mine─of that be sure."},{"name":"QUQURUKA","text":"Nald'thal spoke unto me. By His own declaration, the seal on the voidgate <span class=\"emphasis\">will</span> be broken."},{"name":"QUQURUKA","text":"Once thrown open, it can be closed once more by none but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who bears the Gem of Shatotto."},{"name":"QUQURUKA","text":"I speak of you, <span class=\"highlight\">Forename Surname</span>."},{"name":"QUQURUKA","text":"The gem you hold is the mark of a mage of the black. With it in hand, you must now set forth to gather the keys needed to seal the voidgate."},{"name":"YAYAKE","text":"Wait! You can't─ I mean, you don't have the right to─ I...I can't just let this happen!"},{"name":"QUQURUKA","text":"Silence, you hollow-pated prig! Those who do not listen shall not be heard!"},{"name":"QUQURUKA","text":"You take for yourself the title of thaumaturge, and so I will not suffer you to claim ignorance. You know as well as any of the existence of a netherworld rife with shadow and monstrosity─the void."},{"name":"QUQURUKA","text":"As the power of the void waxes, the barrier between it and our own world wanes. Eventually, that barrier will falter, and the voidgate will open."},{"name":"QUQURUKA","text":"Once it has, only the black magic of eld can reseal it."},{"name":"YAYAKE","text":"This... This is sacrilege!"},{"name":"QUQURUKA","text":"As one who now commands the forces of destruction, I bid you go forth, <span class=\"emphasis\">black mage</span>."},{"name":"QUQURUKA","text":"The Gem of Shatotto is our sigil─the mark of the magi devoted to the true dark art. In it, you already possess the first key required to see the voidgate sealed."},{"name":"QUQURUKA","text":"You have taken the black, but time is needed before the black takes you─before it permeates mind and body, and colors every fiber of your being dark as pitch."},{"name":"QUQURUKA","text":"Visit Milvaneth Sacrarium, and there hear the words of Lalai."},{"name":"QUQURUKA","text":"Do not fear the power to destroy. Master it, and with it destroy that which would destroy you."},{"name":"LALAI","text":"Master is meditating in his chambers. For Nald'thal always speaks, and Master must listen. He has entrusted me with guiding you on your path─but you must walk alone yet. Come again when the black has grown stronger within you."},{"name":"SYSTEM","text":"The next black mage quest will be available from Lalai upon reaching level 35."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":158,"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":8}],"questsType":"all","quests":[65889,66049]},"next":[66610]},"partials":[{"type":"npc","id":"1002279","obj":{"i":1002279,"n":"Yayake","l":40,"q":9,"t":"Guild Receptionist"}},{"type":"npc","id":"1006752","obj":{"i":1006752,"n":"Lalai","l":41,"q":16}},{"type":"action","id":"158","obj":{"i":158,"n":"Manafont","c":2651,"j":25,"t":4,"l":30}},{"type":"quest","id":"65889","obj":{"i":65889,"n":"Facing Your Demons","g":134,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66610","obj":{"i":66610,"n":"You'll Never Go Back","g":154,"l":"Ul'dah","s":2,"f":1}}]}