{"quest":{"name":"The Voidgate Breathes Gloomy","location":"Eastern Thanalan","id":66612,"patch":2.0,"sort":4,"icon":100102,"unlocksFunction":1,"eventIcon":71341,"issuer":1006753,"target":1006753,"involved":[1007866,1007867],"genre":154,"journal":["Kazagg Chah would see you undertake another challenge to strengthen your dark powers.","According to Dozol Meloc, the Gloom emanating from the voidgate is reacting to the power that has awoken within you. The ancient black magic that will aid you lies hidden in the South Shroud, sealed within a pillar by mages of old. Seek out this now-mossy pillar in Urth's Gift and see what secrets it holds.","Investigating the pillar sparks the appearance of a rash of planar fissures, which you and Mendicant Da Za subsequently dispatch with your usual flair. Speak with the mendicant to see how he is holding up after the battle.","Seemingly none the worse for wear, Da Za instructs you to return to Burgundy Falls to inform Dozol Meloc of your success.","Dozol Meloc is thrilled that the mysterious Gloom has been eliminated. Now speak with Kazagg Chah, who awaits you in his usual location behind Burgundy Falls.","Kazagg Chah is relieved that the Gloom has been scattered, and is greatly pleased by the power of darkness that has grown within you. "],"objectives":["Investigate the mossy pillar in Urth's Gift.","Speak with 269th Order Mendicant Da Za.","Speak with Dozol Meloc at Burgundy Falls.","Speak with Kazagg Chah.","Repel the Gloom's advance!"],"dialogue":[{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename</span>. It is well you are here. My colleagues Dozol Meloc and Da Za would have words with you. Wait here while I fetch them."},{"name":"DOZOLMELOC","text":"To close voidgate, strong black magic you need. Ready for test, are you?"},{"name":"Q1","text":"Are you ready?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"DOZOLMELOC","text":"Very good. Squaaawk! You have sharp sense, like Dozol. Noticed, have you? Your aura. Strangeness, it has."},{"name":"DOZOLMELOC","text":"Fool! Squaaawk! But no matter. Sharp sense, Dozol has. Your aura. Strangeness, it has."},{"name":"DOZOLMELOC","text":"Now, the voidgate. Gloom, it makes. Like black breath. Gloom drawn to black magic. Drawn to you. Like moth to flame. Black magic, it seeks, to corrupt and make own."},{"name":"DOZOLMELOC","text":"Losing strength, seal is. Black magic and voidgate share bond. Very deep. But must not leave be too long. Else other side maybe take you! Squaw-aw-awk."},{"name":"DOZOLMELOC","text":"No fear yet! Still weak, Gloom is. Time, you have. Strong <span class=\"highlight\">Forename</span> find next key!"},{"name":"DOZOLMELOC","text":"Teach you, Dozol will, what must do."},{"name":"DOZOLMELOC","text":"Many black mages, there were. Long ago. One more powerful than rest. Very powerful. Epic, even. Epic black mage."},{"name":"DOZOLMELOC","text":"Black magic too powerful. Too dangerous. Wrong hands must not have. Know this, he did. Ciphered spells. Hid secrets. Dark way passed to few. Very few."},{"name":"DOZOLMELOC","text":"Teaching, writing, spread over realm. Lost to time, they were. Forgotten. One carved in stone. Stone of mossy pillar. Pillar in South Shroud. Squaaawk!"},{"name":"DOZOLMELOC","text":"Chosen <span class=\"highlight\">Forename</span> is chosen! Unleash power of this black magic, you can. Key, it is! Key to end of Gloom!"},{"name":"DOZOLMELOC","text":"Knowledge of my line, this is. Passed to Dozol from mother. From mother of mother. From mother of mother of mother. Four hatchings past. Strong mage, she was. Epic, even. Epic mage!"},{"name":"DOZOLMELOC","text":"Great love for dark art. More than anything. Joined with lizardmen to learn all. Named betrayer, she was. Chased from village. Squaaawk! Her words, Dozol keeps. Teach to strong <span class=\"highlight\">Forename</span> now."},{"name":"DOZOLMELOC","text":"“Four magi meet, in barren land,<br>Old black powers have they, in hand.<br>Fate of all wicked, be made stark.<br>Path to light then lit by squaaawk!”<br>That her squawk. Not Dozol squawk. Should be <span class=\"emphasis\">dark</span>, Dozol thinks."},{"name":"DOZOLMELOC","text":"Good words. Deep words. Bring Dozol here, they did. To pass on. Not Dozol alone. Others come too. Other mages."},{"name":"DOZOLMELOC","text":"Birdman. Lizardman. No matter. All wait for strong <span class=\"highlight\">Forename</span>. Strong mind, you have, and heart. Help you, Dozol will."},{"name":"DOZOLMELOC","text":"Go to Gridania, you must. To Urth's Gift. Near pillar lurking beasts, there are. Slay them, you must. No need fear beast. Strong <span class=\"highlight\">Forename</span> is strong!"},{"name":"DOZOLMELOC","text":"Da Za! Squaaawk!"},{"name":"DAZA","text":"I, too, am here to lend you my aid─help, hand, aid."},{"name":"DOZOLMELOC","text":"Wood danger for Dozol. For Ixal, Wailers wait. Wait with sharp spears. Go in place of Dozol, Da Za will."},{"name":"DOZOLMELOC","text":"Decided, it is. Go now, you will! Squaaawk!"},{"name":"SYSTEM","text":"A stone pillar covered in moss rises here."},{"name":"SYSTEM","text":"The Gem of Shatotto shines bright, revealing an inscription in the stone. As you approach it, you hear a voice ring out..."},{"name":"SEKIHI","text":"(-???-)By the gem thou bearest shall the great and dark power of eld be bestowed upon thee. But those who seek this power must first prove their worth. Behold, the Gloom that would be thine undoing cometh!"},{"name":"SEKIHI","text":"(-???-)Stay the Gloom's encroach by thy hand. Only then shall the umbral wisdom of the ages be gifted unto thee."},{"name":"DAZA","text":"That voice spoke true. Look! The Gloom gathers, <span class=\"highlight\">Forename</span>. I sense there are fiends of evil about─nearby, close, about."},{"name":"DAZA","text":"Well fought! The Gloom is scattered! Scattered is the Gloom!"},{"name":"DAZA","text":"Let us return to Burgundy Falls. Yes, yes, Dozol Meloc awaits us─you, me, us."},{"name":"DOZOLMELOC","text":"Gone from you, Gloom is. Worry for nothing, Dozol did!"},{"name":"DOZOLMELOC","text":"Squaaawk! Now go see Kazagg Chah, you must. Awaiting you, he is."},{"name":"KAZAGGCHAH","text":"The gods are good to return you unharmed. The Gloom which threatened to taint this world does so no more. And I sense the darkness within you is reborn with a new power."},{"name":"KAZAGGCHAH","text":"Wield it well, <span class=\"highlight\">Forename</span> of the black, and make of it a tool for our ends. Do that, and as the prophecy speaks, the way to light shall be lit by dark before you."},{"name":"QIB","text":"The Gloom will change into great horrors if left unchecked. You must stop it with your black magic─spells, sorcery, magic."},{"name":"QIB","text":"The Gloom has birthed fiends, <span class=\"highlight\">Forename</span>. Be careful─cautious, wary, careful."},{"name":"QIB","text":"More fiends come! Worry not, the tide will turn─shift, change, turn."},{"name":"QIB","text":"Do not falter, <span class=\"highlight\">Forename</span>. We must endure─rally, persevere, endure!"},{"name":"QIB","text":"Forgive me, <span class=\"highlight\">Forename</span>. My powers are gone─spent, exhausted, gone."}],"reward":{"action":153,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":26}],"quests":[66611]},"next":[66613]},"partials":[{"type":"npc","id":"1006753","obj":{"i":1006753,"n":"Kazagg Chah","l":44,"q":7}},{"type":"npc","id":"1007866","obj":{"i":1007866,"n":"269th Order Mendicant Da Za","l":56,"q":1}},{"type":"npc","id":"1007867","obj":{"i":1007867,"n":"Dozol Meloc","l":44,"q":1}},{"type":"action","id":"153","obj":{"i":153,"n":"Thunder III","c":459,"j":25,"t":2,"l":45}},{"type":"quest","id":"66611","obj":{"i":66611,"n":"International Relations","g":154,"l":"Ul'dah","s":3,"f":1}},{"type":"quest","id":"66613","obj":{"i":66613,"n":"The Blood Must Flow","g":154,"l":"Eastern Thanalan","s":5,"f":1}}]}