{"quest":{"name":"The Blood Must Flow","location":"Eastern Thanalan","id":66613,"patch":2.0,"sort":5,"icon":100102,"unlocksFunction":1,"eventIcon":71341,"issuer":1006753,"target":1006753,"involved":[1006754,1006755],"genre":154,"usedItems":[3690,3464,3895,2903],"journal":["Kazagg Chah wishes to guide you further along the path of the black mage.","Da Za tells you that he set out from his kobold homeland of O'Ghomoro to pursue the same legend recounted by Kazagg Chah and Dozol Meloc. He holds a stone tablet passed down to him from his ancestor Da Gu. Upon showing it to you, the light from your Gem of Shatotto reveals writing carved into its surface indicating that closing the voidgate requires certain <span class=\"emphasis\">garb</span>. To locate three of the pieces, pour the blood of Kazagg Chah into the planar fissure at the Zanr'ak encampment in southern Thanalan, the blood of Dozol Meloc into the planar fissure at the Ixali logging grounds in the North Shroud, and the blood of Da Za into the planar fissure at O'Ghomoro in outer La Noscea.","Your blood-pouring activities have netted you three pieces of wizard's garb. Return to Burgundy Falls and show Kazagg Chah your new duds.","During your absence, Kazagg Chah and his companions have tracked down the location of the fourth garment mentioned in the tablet. Travel to Thal's Respite in eastern Thanalan, investigate the planar fissure that has opened there, and procure the blood of any fiends that emerge from it.","You have obtained the voidsent's blood. Pour it into the planar fissure that yet remains.","You have obtained the fourth piece of wizard's garb. Take word of your accomplishment to Kazagg Chah at Burgundy Falls in eastern Thanalan.","You learn from Kazagg Chah that a fifth piece of wizard's garb yet remains, and that its location is a mystery. The only clue the ancient tablet gives is that the body armor rests in the <span class=\"emphasis\">Solace of the Gods</span>. The Amalj'aa black mage tells you he will continue researching the matter. In the meantime, carry on with your studies, and make preparations to seal the voidgate once and for all.<br><br>※The next black mage quest will be available from Kazagg Chah upon reaching level 50."],"objectives":["Pour Kazagg Chah's blood into the planar fissure at the Zanr'ak encampment.","Pour Dozol Meloc's blood into the planar fissure at the Ixali logging grounds.","Pour Da Za's blood into the planar fissure at O'Ghomoro.","Speak with Kazagg Chah at Burgundy Falls.","Investigate the planar fissure at Thal's Respite and obtain the blood of any fiends that emerge.","Pour the fiend's blood into the planar fissure and obtain the black mage relic armor.","Speak with Kazagg Chah at Burgundy Falls."],"dialogue":[{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename</span> of the black, our brother Da Za has words for you. Pray wait a moment for him to arrive."},{"name":"DAZA","text":"You have reclaimed the key from the depths of the Shroud─wood, forest, Shroud. Yes, you have done well. Very, very well. You are truly the black mage foretold by legend─oracle, prophecy, legend."},{"name":"DAZA","text":"It was such a legend of my people that brought me to this Thanalan. Such is what legends do."},{"name":"DAZA","text":"“When four magi meet in a barren land,<br>Black powers of eld woven by their hand,<br>Shall see the fate of wickedness made stark,<br>And the path to light shall be lit by dark.” Black, shadow, dark."},{"name":"DAZA","text":"You have heard these words before. Yes, yes, here I found Kazagg Chah and Dozol Meloc. The words that brought us to Thanalan are the same─equal, identical, same. "},{"name":"DAZA","text":"It was one hundred years ago that a kobold first deciphered the legend─decrypted, decoded, deciphered. The great mage who did it was my own ancestor, 1st Order Patriarch Da Gu. Yes, yes, my very own."},{"name":"DAZA","text":"But he broke kobold law. The first patriarch must never leave O'Ghomoro. No, no, never. But leave he did. He set out from La Noscea to pursue this legend. And for that he was named traitor─betrayer, turncloak, traitor."},{"name":"DAZA","text":"None were drawn to the words of Da Gu. No, no, not a single kobold soul. They ignored his words. But when first I heard them, I felt strange─peculiar, odd, strange."},{"name":"DAZA","text":"I felt I must do something. I could not simply be idle. I, too, left La Noscea, just as Da Gu before me. Yes, and I have come here to Thanalan."},{"name":"DAZA","text":"Now I see the legend is real. Yes, the words kept by Kazagg Chah, Dozol Meloc, and myself are true. <span class=\"emphasis\">You</span> have appeared. That is no coincidence. No, no, none at all."},{"name":"DAZA","text":"I am a kobold. Yes, yes, I am, and we kobolds are good at finding things─treasures, trinkets, things. I will help you where I can."},{"name":"DAZA","text":"Da Gu left behind many things when he left. Yes, many, many things. I was given a stone tablet. The others in my family thought it rubbish─dross, refuse, rubbish. Its surface has many scratches, you see. Yes, many, many. But I sense in it a great power."},{"name":"DAZA","text":"Here, it may give some─ Your gem! The light! It is illuminating the tablet. The scratches are...growing!? Mighty Titan, those are no scratches! No, no, not scratches at all. They are carvings! Words!"},{"name":"DAZA","text":"“Know thee, brave keeper of Shatotto's light,<br>As these very words wax plain to thy sight,<br>The seal what was cast doth shudder and sigh,<br>And the voidgate's dread sundering draws nigh.”"},{"name":"DAZA","text":"“To ward against the creeping of the Gloom,<br>Thou needest great garb to stay any doom,<br>To this sacred wear thy thoughts must now tend,<br>Unto thy black command darkness shall bend.”"},{"name":"DAZA","text":"This tablet was more important than I ever imagined. Yes, yes, much more. It seems to say one who would close the voidgate must first find this sacred garb─gear, armor, garb!"},{"name":"DAZA","text":"And the names of places are written here as well. Yes, yes, these four places I know. You would do well to set out and gather the first three relics."},{"name":"KAZAGGCHAH","text":"Legend speaks of this. It holds that an offering of blood must be given to the planar fissures─the blood of those who have lived life steeped in the black. Only then can the relics be won. Here, take with you an offering of my blood, <span class=\"highlight\">Forename</span>."},{"name":"DOZOLMELOC","text":"Need Dozol's blood too, you do. Take. Take quick! Squaaawk! Before change mind."},{"name":"DAZA","text":"And here is mine─my, me, mine. I would entrust it to no other."},{"name":"DAZA","text":"But be warned─one does not simply walk into these places. There are great dangers waiting. Do be careful. Yes, yes, very, very careful."},{"name":"DAZA","text":"I had no doubt you would return triumphant. Yes, yes, no doubt at all."},{"name":"DOZOLMELOC","text":"Braved the logging grounds, you did. Great, great strength, you have. Squaaawk!"},{"name":"KAZAGGCHAH","text":"I have awaited your return, <span class=\"highlight\">Forename</span>. I have learned where it is that the fourth relic of our forebears rests─the land known as Thal's Respite."},{"name":"KAZAGGCHAH","text":"There, too, lies a planar fissure into which the blood of the fiends it births must be poured. "},{"name":"KAZAGGCHAH","text":"The first four relics are now in your keeping. Yet the final piece remains, and our efforts to learn where it rests have been to no avail. "},{"name":"KAZAGGCHAH","text":"The dark which empowers at times obscures─such is its nature. Da Za claims his tablet names the <span class=\"emphasis\">Solace of the Gods</span> as the location we seek, but none among us have ever heard tell of such a name."},{"name":"KAZAGGCHAH","text":"“When a power worthy to relics claim,<br>Takes root in one of righteous end and name,<br>The <span class=\"emphasis\">Solace of the Gods</span> will be made known,<br>And the last seed of the black mage be sown.”"},{"name":"KAZAGGCHAH","text":"Da Za insists his reading is correct, and both Dozol Meloc and I trust in his ability. We will endeavor to decode these words, that you might see your quest to its end. The day of the void's opening shall come. Until then, <span class=\"highlight\">Forename</span>, I ask only that you continue to walk the path of the black."},{"name":"POP","text":"Fiends emerge from the planar fissure!"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":26}],"quests":[66612]},"next":[66614]},"partials":[{"type":"npc","id":"1006753","obj":{"i":1006753,"n":"Kazagg Chah","l":44,"q":7}},{"type":"npc","id":"1006754","obj":{"i":1006754,"n":"269th Order Mendicant Da Za","l":44,"q":1}},{"type":"npc","id":"1006755","obj":{"i":1006755,"n":"Dozol Meloc","l":44,"q":1}},{"type":"item","id":"3690","obj":{"i":3690,"n":"Wizard's Gloves","l":50,"c":44104,"t":37,"p":1000}},{"type":"item","id":"3464","obj":{"i":3464,"n":"Wizard's Tonban","l":50,"c":45190,"t":36,"p":1000}},{"type":"item","id":"3895","obj":{"i":3895,"n":"Wizard's Crakows","l":50,"c":46220,"t":38,"p":1000}},{"type":"item","id":"2903","obj":{"i":2903,"n":"Wizard's Petasos","l":50,"c":41134,"t":34,"p":1000}},{"type":"quest","id":"66612","obj":{"i":66612,"n":"The Voidgate Breathes Gloomy","g":154,"l":"Eastern Thanalan","s":4,"f":1}},{"type":"quest","id":"66614","obj":{"i":66614,"n":"Always Bet on Black","g":154,"l":"Eastern Thanalan","s":6,"f":1}}]}