{"quest":{"name":"Yearn for the Urn","location":"South Shroud","id":66619,"patch":2.0,"sort":5,"icon":100110,"unlocksFunction":1,"eventIcon":71341,"issuer":1006751,"target":1006751,"involved":[1007853,1007861],"genre":153,"journal":["Raya–O–Senna would have you recover the stolen ashes of A–Towa–Cant.","Distressed at the theft of A–Towa–Cant's ashes, Raya–O–Senna sent her best moogleservant in search of the thieves. Having now returned, speak with Kupcha Kupa and see if his search has borne fruit.","Kupcha Kupa informs you that one of his kind caught sight of an urn being carted away by a band of Redbelly Wasps. Venture to the bandits' den northwest of Quarrymill in the South Shroud, and speak with the moogle eyewitness, Pukno Poki.","Pukno Poki tells you that he saw the bandits haul the urn off toward Redbelly Hive on a wain carelessly overloaded with stolen loot. Carefully navigate your way around the skulking Redbelly Wasps and recover the stolen remains.","After tracking down the overloaded wain and dispatching a trio of Redbellies, you have successfully recovered the remains of A–Towa–Cant. Return them to Raya–O–Senna at Camp Tranquil.","Though relieved at the return of the great mage's remains, Raya–O–Senna has unfortunate news for you. Uprooted from their resting place, the ashes have been drained of their powers, rendering them unsuitable for enchanting your garb. She asks you to continue your training while she consults her brother as to the best course of action.<br><br>※The next white mage quest will be available from Raya–O–Senna upon reaching level 50."],"objectives":["Speak with Kupcha Kupa.","Speak with Pukno Poki.","Search the overloaded wain.","Deliver the urn to Raya–O–Senna."],"dialogue":[{"name":"RAYAOSENNA","text":"Grave robbery is a loathsome enough crime in its own right, but to defile the final resting place of a Padjal! Such an act could only be performed by the lowliest of bandit scum."},{"name":"RAYAOSENNA","text":"Though I would like to think that the elementals have already delivered due justice to the villain, we must take no chances in allowing an escape."},{"name":"RAYAOSENNA","text":"Whilst you were away, I put my best moogle on the hunt, searching for any sign of the culprit or the stolen remains. I daresay he should have a clue or two for us by now."},{"name":"RAYAOSENNA","text":"...At least, he <span class=\"emphasis\">better</span>, if he values that little ball on his head. Suffice it to say, though many forestborn think of the moogles as blessed, my own personal experience has found them to be more <span class=\"emphasis\">touched</span> than anything else."},{"name":"KUPCHAKUPA","text":"&lt;sigh&gt; Oh, Mistress. You shouldn't say such hurtful things. It's most unbecoming of a Seedseer, kupo... But fine, <span class=\"emphasis\">don't</span> listen to me."},{"name":"KUPCHAKUPA","text":"Why, I told her just the other day that this is why she remains, shall we say, unspoken for. She might not react to that phrasing at present, but her ire was indeed fierce, kupo..."},{"name":"KUPCHAKUPA","text":"Of course, you have not come to discuss my mistress's temper, but the grave robbery. A most unforgivable act of villainy, if I do say so myself─which I believe I just did, kupo!"},{"name":"KUPCHAKUPA","text":"I am pleased to say─and you will be pleased to hear─that the culprit did not escape moogle eyes, kupo!"},{"name":"KUPCHAKUPA","text":"Well, <span class=\"emphasis\">my</span> eyes, he did escape. My associate Pukno Poki, however, claims to have seen a band of ruffians skulking off in the direction of Redbelly Hive with various and sundry stolen goods in tow─among them, a rather conspicuously elaborate urn, kupo."},{"name":"KUPCHAKUPA","text":"I do not know what the Redbellies are up to, but surely it can be nothing good. Please, <span class=\"highlight\">Forename</span>, go quickly! If the urn is lost, I...I fear Raya–O's ire will be the <span class=\"emphasis\">least</span> of my worries, kupo."},{"name":"PUKNOPOKI","text":"Those thieving crooks! Those crooked thieves! Defiling the resting place of a Padjal? Why, no amount of thrashings, lashings, and bashings would suffice!"},{"name":"PUKNOPOKI","text":"Kupopo? Why, if it isn't the <span class=\"alternative-container\"><span class=\"alternative\">lovely</span><span class=\"alternative\">dashing</span></span> white mage Kupcha Kupa spoke of. And not a moment too soon!"},{"name":"PUKNOPOKI","text":"Why, I was just about to swoop in and give them their comeuppance myself! Now that you're here, however, I believe I'll just sit back and enjoy the show, kupo."},{"name":"PUKNOPOKI","text":"Those vile Redbellies tossed the urn onto some ramshackle wagon─a most ignoble fate for a Padjali legend, I do declare─and carted it northwise toward their hive. You will retrieve it safe and sound, won't you, kupo?"},{"name":"RAYAOSENNA","text":"Thank you, <span class=\"highlight\">Forename</span>. The remains of our exalted forebear hauled away by brigands like a sack of loot... Is that what our land has come to?"},{"name":"RAYAOSENNA","text":"There can be no doubt. It is the great one's fury that brings such chaos to the Twelveswood. The situation is grave indeed."},{"name":"RAYAOSENNA","text":"I shall have our Wood Wailers deal with the Redbellies. We have more important matters before us."},{"name":"RAYAOSENNA","text":"And yet, I fear we have hit another snag. Though the urn has been safely recovered, the harsh treatment it suffered at the hands of the bandits has taken its toll. Uprooted from its proper resting place, the power of A–Towa–Cant once housed within has grown dim."},{"name":"RAYAOSENNA","text":"I shall return the urn to its rightful home. Perhaps, over time, it will return to its former state."},{"name":"RAYAOSENNA","text":"And yet I fear time is a luxury we do not have. We must explore other means to enchant the ritual garb."},{"name":"RAYAOSENNA","text":"I will consult with my brother to see what knowledge he might have to offer. In the meantime, I would ask that you master your newfound skills as best you can. There is no telling when the great one's fury might grow too strong to contain─we must ever be prepared."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"ACCESS","text":"The enemy is still about!"}],"reward":{"action":139,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":25}],"quests":[66618]},"next":[66620]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1007853","obj":{"i":1007853,"n":"Pukno Poki","l":56,"q":1}},{"type":"npc","id":"1007861","obj":{"i":1007861,"n":"Kupcha Kupa","l":56,"q":1}},{"type":"action","id":"139","obj":{"i":139,"n":"Holy","c":2629,"j":24,"t":2,"l":45}},{"type":"quest","id":"66618","obj":{"i":66618,"n":"Following in His Footsteps","g":153,"l":"South Shroud","s":4,"f":1}},{"type":"quest","id":"66620","obj":{"i":66620,"n":"Heart of the Forest","g":153,"l":"South Shroud","s":6,"f":1}}]}