{"quest":{"name":"O Brother, Where Art Thou","location":"South Shroud","id":66617,"patch":2.0,"sort":3,"icon":100110,"unlocksFunction":1,"eventIcon":71341,"issuer":1006751,"target":1006751,"involved":[1007852],"genre":153,"journal":["Raya–O–Senna would ask a favor of you.","A–Ruhn–Senna, unconvinced by his sister's words, has run off to the Bramble Patch on his own to prove that your powers are not needed. Raya–O–Senna, fearing for her brother's safety, asks you to go look for him.","Despite suffering injury in his foolhardy quest to placate the forest single-handedly, A–Ruhn–Senna remains as stubborn as ever. Placate the tree in his stead.","By communing with an elemental before A–Ruhn–Senna's eyes, you have grudgingly won the trust of the proud young Padjal. Return to Camp Tranquil and speak with Raya–O–Senna.","Raya–O–Senna informs you that her brother, despite his misgivings, has finally come to accept your participation in the Quieting. To commune with the great one, however, no ordinary powers will suffice. Continue to hone your skills, that you might join the two Seedseers in healing the forest.<br><br>※The next white mage quest will be available from Raya–O–Senna upon reaching level 45."],"objectives":["Speak with A–Ruhn–Senna in the Bramble Patch.","Placate the tree.","Speak with Raya–O–Senna at Camp Tranquil."],"dialogue":[{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>... I owe you an apology."},{"name":"RAYAOSENNA","text":"When last we spoke, I promised that I would find a way to convince my brother to accept you, but I fear he intently refuses to heed my words."},{"name":"RAYAOSENNA","text":"Why, the more I try to reason with him, the more he shuts his ears to me. All pride and no common sense, that one─I can scarce believe we are kin!"},{"name":"RAYAOSENNA","text":"So intent is he to prove that you are unneeded that he dashed out into the forest all alone, boasting that he would placate every last elemental and save the forest all by himself!"},{"name":"RAYAOSENNA","text":"Needless to say, such a task is far beyond his powers. There is a part of me that would like nothing more than to see the foolish boy learn his lesson, and yet...as his sister, I fear for him."},{"name":"RAYAOSENNA","text":"Would you go look after him, <span class=\"highlight\">Forename</span>? Seedseer or no, he is in many ways still a child, and the forest grows ever more unsafe these days."},{"name":"RAYAOSENNA","text":"I thought to go myself, but...if <span class=\"emphasis\">you</span> were to save my brother from his own recklessness, perhaps he might finally see how fatuous he has been."},{"name":"RAYAOSENNA","text":"When last I spoke with him, he announced his intentions to begin his efforts in the Bramble Patch─with any luck, you may still find him there. Now please go in haste, before some ill fate befalls him..."},{"name":"ARUHNSENNA","text":"Hmph! If it isn't my sister's favorite adventurer. Come to show me up, have you?"},{"name":"ARUHNSENNA","text":"Well, you can march right back and tell Sister that I am doing just fine. I am only...ungh...<span class=\"emphasis\">resting</span>."},{"name":"ARUHNSENNA","text":"&lt;cough&gt; Even if I <span class=\"emphasis\">were</span> hurt and unable to placate this tree...what could a run–of–the–mill adventurer like you do about it?"},{"name":"ARUHNSENNA","text":"Hmph! Beginner's luck."},{"name":"ARUHNSENNA","text":"If you think healing a sapling or two is going to convince me that <span class=\"emphasis\">you</span> are a worthy inheritor to the teachings of Master A–Towa..."},{"name":"RAYAOSENNA","text":"A–Ruhn, you <span class=\"emphasis\">yourself</span> do not believe those words!"},{"name":"ARUHNSENNA","text":"Sister! What are you doing here!?"},{"name":"RAYAOSENNA","text":"Seeing to my pigheaded brother's safety─what do you <span class=\"emphasis\">think</span> I am doing? For better or worse, it would appear you suffer only from bruises to your leg and your pride."},{"name":"RAYAOSENNA","text":"A–Ruhn. For all your obstinacy, I know that deep down you are no fool."},{"name":"RAYAOSENNA","text":"No, you are wise beyond your years. You realize as well as I the dire fate that will befall Gridania if we do not quell the great one's fury and restore peace to the wood."},{"name":"RAYAOSENNA","text":"The adventurer is not Padjali─this is true. But what of it? Would you blindly trumpet tradition as the very forest turns against us and brings ruin to our home? We have a greater calling to answer─you know this!"},{"name":"ARUHNSENNA","text":"I... I do, Sister."},{"name":"RAYAOSENNA","text":"Oh, my dear A–Ruhn... What are sisters for, if not to forgive their little brothers' fits of folly? "},{"name":"RAYAOSENNA","text":"Now, <span class=\"highlight\">Forename</span>, I believe the most important task of all still awaits us. Let us return to Camp Tranquil."},{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>, thank you. I knew it was only a matter of time before A–Ruhn came around to reason. And yet, his hesitance to accept you was not entirely unfounded."},{"name":"RAYAOSENNA","text":"When we first met, I promised that one day I would share with you the tale of how white magic came to be regarded as a forbidden art. Well, I suppose this is as good a day as any for the telling."},{"name":"RAYAOSENNA","text":"The tale begins some three millennia ago, in the Fifth Astral Era. It was the time of the Endless Frost, when a barren wasteland of snow and rime stretched as far as the eye could see."},{"name":"RAYAOSENNA","text":"Food was scarce, and warmth scarcer. The histories hold many a grim tale of those who died in their beds, starving and benumbed. So did our ancestors discover magic, born out of the most fundamental instinct─survival."},{"name":"RAYAOSENNA","text":"In time, the winter thawed, and magic was no longer essential for survival. But once awakened to its conveniences, there was no returning to how things once were. Ere long, the people discovered all the myriad ways in which magic could be employed, and civilization flourished."},{"name":"RAYAOSENNA","text":"But prosperity breeds contempt, and nations warred for power and riches. So did the people seek greater and greater power, to rain destruction down upon their enemies. So was born black magic, the most devastating form of sorcery the world had seen."},{"name":"RAYAOSENNA","text":"At the same time, another form of magic emerged, brought forth by those who would keep this immense destructive power in check. That is white magic─our magic. Does this surprise you? Just as there can be no dawn without the night, the white and black are but two sides of the same coin."},{"name":"RAYAOSENNA","text":"War raged on, and magic was used and abused with little concern for the consequences. And consequences there were─unchecked use of magic soon dried the flow of aether, threatening to bring blight to the land."},{"name":"RAYAOSENNA","text":"The magic of healing? It made little difference. If used with no concern for the aether, our magic could prove as ruinous to the land as the most devastating black magic spell. And so it was that the practicing of white magic was forbidden...with one exception."},{"name":"RAYAOSENNA","text":"...The Padjal. Our kind were entrusted as sole shepherds of the now-forbidden art, to serve as healers and bringers of peace while ensuring that this great power would never again be misused."},{"name":"RAYAOSENNA","text":"Though he is still young, A–Ruhn feels this profound sense of responsibility as strongly as any of us, thus his hesitance to accept you. But having seen your abilities─and the sincerity of your intentions─you can rest assured his doubts have been dispelled."},{"name":"RAYAOSENNA","text":"With the three of us united in place and purpose, and your skills ever growing, the day that we may perform the Quieting draws near. To our fortune, the great one has not yet been entirely consumed by fury, but our time remains short."},{"name":"RAYAOSENNA","text":"To commune with the great one, and restore the Twelveswood to its former state of harmony, we must truly be one of heart, one of mind."},{"name":"RAYAOSENNA","text":"It is to this end that A–Towa–Cant has guided you to us. Further your mastery of our art, <span class=\"highlight\">Forename</span>, and let us mend the wounds of the wood together."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"ACCESS","text":"The enemy is still about!"}],"reward":{"action":131,"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":25}],"quests":[66616]},"next":[66618]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1007852","obj":{"i":1007852,"n":"A-Ruhn-Senna","l":55,"q":1}},{"type":"action","id":"131","obj":{"i":131,"n":"Cure III","c":407,"j":24,"t":2,"l":40}},{"type":"quest","id":"66616","obj":{"i":66616,"n":"Only You Can Prevent Forest Ire","g":153,"l":"South Shroud","s":2,"f":1}},{"type":"quest","id":"66618","obj":{"i":66618,"n":"Following in His Footsteps","g":153,"l":"South Shroud","s":4,"f":1}}]}