{"quest":{"name":"International Relations","location":"Ul'dah","id":66611,"patch":2.0,"sort":3,"icon":100102,"unlocksFunction":1,"eventIcon":71341,"issuer":1006752,"target":1006753,"involved":[1007863,1007864,1007865],"genre":154,"journal":["Lalai has another task to strengthen your connection to the black.","Lalai has handed down yet another prophecy from her Master. You are to travel to eastern Thanalan, and once there, enter a cave located behind Burgundy Falls. In its depths, locate and speak with Kazagg Chah, the Amalj'aa who first gifted you with the Gem of Shatotto.","Kazagg Chah believes that you are the [Race] of prophecy, but would have you face death once again so as to prove your readiness to serve your final purpose. When you are fully prepared, journey to the Silent King in western Thanalan and speak with Dozol Meloc.","The Ixal Dozol Meloc has commanded you to close the nearby planar fissure. As before, investigate the fissure and obtain the blood of whatever fiends might emerge from it.","You have slain the dread ahriman which spawned from the fissure. Pour the blood obtained from the voidsent into the remaining planar fissure.","You have closed the planar fissure. Speak again with Dozol Meloc.","The Ixal seems impressed at your skill with the dark magicks. For the next stage of your trial, Dozol Meloc bids you seek out 269th Order Mendicant Da Za north of the Silent King.","It would seem yet another planar fissure exists which must be sealed. Do for Da Za what you did for Dozol Meloc: investigate the fissure and slay any fiends that emerge.","Once again, you have slain the ahriman that came forth from the void and taken a measure of its blood. Pour the liquid into the remaining planar fissure.","You have sealed yet another of the dark voids. Speak with Da Za to hear his thoughts.","Da Za seems to share Dozol Meloc's high opinion of your arcane skills. Report your successes to Kazagg Chah, who has been overseeing the trial.","Kazagg Chah expresses his approval of your showing in the latest trial. He bids you return to Burgundy Falls in eastern Thanalan so that you and he might speak further of the challenges to come.","Having borne witness to both your ability and resolve, Kazagg Chah confides in you the prophetic words of his forebears, and vows to aid however he might in the fulfillment of your purpose.<br><br>※The next black mage quest will be available from Kazagg Chah upon reaching level 45."],"objectives":["Speak with Kazagg Chah at Burgundy Falls.","Speak with Dozol Meloc at the Silent King.","Investigate the planar fissure and procure the blood of any fiends that emerge.","Pour the voidsent blood into the planar fissure.","Speak with Dozol Meloc.","Speak with 269th Order Mendicant Da Za.","Investigate the planar fissure and procure the blood of any fiends that emerge.","Pour the voidsent blood into the planar fissure.","Speak with 269th Order Mendicant Da Za.","Speak with Kazagg Chah.","Report to Kazagg Chah at Burgundy Falls."],"dialogue":[{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, I see in your eyes the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> prepared to take on the daunting responsibilities of the black mage."},{"name":"LALAI","text":"There are few who know of our existence, even among those versed in the ways of magic. You will not even find mention of us in all but the most esoteric of texts."},{"name":"LALAI","text":"Yet the secrets of our dark art lie encrypted here, within the forbidden library of this Sacrarium."},{"name":"LALAI","text":"Master himself deciphered and read the texts, some hundred years past. It is said the first of our kind were the favored of Nald'thal, and it was He who entrusted them with the duty of sealing the voidgate."},{"name":"LALAI","text":"But as you well know, the power of black magic lies in its great potential for destruction. The slightest errancy in its use may give rise to the most tragic of disasters."},{"name":"LALAI","text":"Of the disappearance of the black mages from Eorzea, Master says only, “We must not repeat the errors of the past.”"},{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, Master has made known to me what it is you must next do. Listen to his words now, with all your being..."},{"name":"LALAI","text":"..."},{"name":"LALAI","text":"“The land has drunk deep of the blood you spilled, and by this act, three souls of three races to Thanalan have come."},{"name":"LALAI","text":"“The fires of our Order once burned black and full. Yet long ago they were left to wane and very nearly die. These three souls are the keepers of the embers that remain─of all that we now are."},{"name":"LALAI","text":"“In the hands of one who will usher our return, the Gem of Shatotto, testimony of our creed, will shine with new light. And by that light, the three keepers will be made your allies."},{"name":"LALAI","text":"“An Amalj'aa by the name of Kazagg Chah awaits at Burgundy Falls in the east of Thanalan. Go to him.”"},{"name":"LALAI","text":"...That is all. Dwell not on the fact that the Amalj'aa are the sworn enemies of Ul'dah. It is not your place to question Master's will─for it is the will of Nald'thal Himself."},{"name":"LALAI","text":"Go forth, black mage, and see the voidgate sealed."},{"name":"KAZAGGCHAH","text":"Well come, [Race], chosen of Ququruka and bearer of the Gem of Shatotto."},{"name":"KAZAGGCHAH","text":"By the gem's power do our paths cross once more. At last the time spoken of in the prophecy has come, and yet I know nothing of <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who would guide us. Come, tell me your name."},{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename Surname</span>. I am Kazagg Chah, a sorcerer of the Amalj'aa, as were my forebears. I am the fourth of my line to walk this path, which brings me now to this land."},{"name":"KAZAGGCHAH","text":"As you well know, my kind bear the scorn of the Ul'dahns. It is for that reason that I must remain here, far from the city walls."},{"name":"DOZOLMELOC","text":"Great power, this one has. But enough, is it? Squaaawk!"},{"name":"DAZA","text":"Kazagg Chah is terrifying to behold. Yes, yes, but he is both wise and kind─good, warm, kind."},{"name":"KAZAGGCHAH","text":"These are my brethren in the black, <span class=\"highlight\">Forename</span>, and now they are yours, as well. Before you stand the Ixal, Dozol Meloc, and the 269th Order mendicant of the kobolds, Da Za."},{"name":"KAZAGGCHAH","text":"You have fed the aetherial currents with the blood of fiends. That the Gem of Shatotto radiates as it does in your presence is proof of your deeds, and a sign of what must yet be done. It falls to me to bear witness to your awakening, and to pass on to you the knowledge entrusted to me."},{"name":"KAZAGGCHAH","text":"Know that you must face death before your purpose can be fulfilled."},{"name":"KAZAGGCHAH","text":"It is to the Silent King in western Thanalan that you must next journey. There, too, lies a planar fissure, and there, too, must you slake the land's thirst with the blood of the fiends which surge forth from it."},{"name":"KAZAGGCHAH","text":"Fear not, each of us shall journey to the Silent King, and there convene once more. Seek out first the Ixal Dozol Meloc, for your path is destined to first cross with his."},{"name":"KAZAGGCHAH","text":"When the deed before you is done, the Gem of Shatotto shall shine with new brilliance."},{"name":"DOZOLMELOC","text":"To close planar fissure, strong black magic you need. You close, then come to Dozol Meloc once more. Squaaawk!"},{"name":"DOZOLMELOC","text":"Squaaawk! Kazagg Chah spoke true! Black is strong in <span class=\"highlight\">Forename</span>. You go now. Go see Da Za."},{"name":"DAZA","text":"Here lies the planar fissure─rift, tear, fissure. Use the power within you to seal it."},{"name":"DAZA","text":"It is as Kazagg Chah foretold. You are chosen, <span class=\"highlight\">Forename</span>. You must return to him now. Yes, yes, return and tell Kazagg Chah the deed is done─ended, over, done."},{"name":"KAZAGGCHAH","text":"Fell whatever fiends emerge from the planar fissures, and let the land drink deep of their blood."},{"name":"KAZAGGCHAH","text":"When the deed before you is done, the Gem of Shatotto shall shine with new brilliance."},{"name":"KAZAGGCHAH","text":"You have done well, <span class=\"highlight\">Forename</span>─as I knew you would. Come, it is time now to return to Burgundy Falls."},{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename Surname</span> of the black, you return to me victorious."},{"name":"KAZAGGCHAH","text":"The Gem of Shatotto burns bright. You are indeed the <span class=\"alternative-container\"><span class=\"alternative\">heiress</span><span class=\"alternative\">heir</span></span> to a dark and ancient power, as Ququruka foretold. I am reminded of a prophecy my great-grandfather uttered long ago:"},{"name":"KAZAGGCHAH","text":"“When four magi meet in a barren land,<br>Black powers of eld woven by their hand,<br>Shall see the fate of wickedness made stark,<br>And the path to light shall be lit by dark.”"},{"name":"KAZAGGCHAH","text":"The <span class=\"emphasis\">black powers of eld</span> require no explanation. And know that <span class=\"emphasis\">wickedness</span> refers to the evil birthed by the void."},{"name":"KAZAGGCHAH","text":"That the seal holding the voidgate shut will falter and fail is beyond doubt. Yet your deeds speak of determination and ability, and in them I spy hope. I have learned all of you that I must."},{"name":"KAZAGGCHAH","text":"I bestow upon you the knowledge kept by my line. Here and now, I speak an oath to discard old grudges. By our power combined, the voidgate will be sealed anew."},{"name":"KAZAGGCHAH","text":"You have brought this old Amalj'aa much happiness. Few believed the words of my great-grandfather. He was mocked and ridiculed, and worse, ignored. Yet your coming has fulfilled the prophecy he spoke."},{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename</span>, the dark magic coursing through you shares a deep bond with the voidgate. Should that portal be cast open, you will come to great peril."},{"name":"KAZAGGCHAH","text":"Temper yourself, in both mind and body. When you are ready, return to this land and seek me out once more. Then, and only then, will I speak to you of your next task."},{"name":"POP","text":"A fiend emerges from the planar fissure!"}],"reward":{"action":159,"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":26}],"quests":[66610]},"next":[66612]},"partials":[{"type":"npc","id":"1006752","obj":{"i":1006752,"n":"Lalai","l":41,"q":16}},{"type":"npc","id":"1006753","obj":{"i":1006753,"n":"Kazagg Chah","l":44,"q":7}},{"type":"npc","id":"1007863","obj":{"i":1007863,"n":"Kazagg Chah","l":42,"q":1}},{"type":"npc","id":"1007864","obj":{"i":1007864,"n":"Dozol Meloc","l":42,"q":1}},{"type":"npc","id":"1007865","obj":{"i":1007865,"n":"269th Order Mendicant Da Za","l":42,"q":1}},{"type":"action","id":"159","obj":{"i":159,"n":"Freeze","c":2653,"j":25,"t":2,"l":40}},{"type":"quest","id":"66610","obj":{"i":66610,"n":"You'll Never Go Back","g":154,"l":"Ul'dah","s":2,"f":1}},{"type":"quest","id":"66612","obj":{"i":66612,"n":"The Voidgate Breathes Gloomy","g":154,"l":"Eastern Thanalan","s":4,"f":1}}]}