{"quest":{"name":"Seer Folly","location":"Gridania","id":66615,"patch":2.0,"sort":1,"icon":100110,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1006751,"involved":[1007850],"genre":153,"journal":["E–Sumi–Yan has a task for a skilled adventurer.","Raya–O–Senna and A–Ruhn–Senna, siblings of the Elder Seedseer, are en route to Everschade, where they would perform a ritual to quell the fury of the great elemental that dwells within the Guardian Tree. Brother E–Sumi–Yan fears for their safety, and tasks you with their protection.","Joining up with the two Seedseers, you assist them in their battle with hostile forest creatures. Raya–O–Senna bids you seek her out at Camp Tranquil, where she would speak with you further.","Convinced that your arrival has been ordained by the legendary mage A–Towa–Cant, Raya–O–Senna would have you join her and her brother in performing the Quieting and restoring peace to the Twelveswood. Hone your skills, that you might be capable of the task before long.<br><br>※The next white mage quest will be available from Raya–O–Senna upon reaching level 35."],"objectives":["Seek out Raya-O-Senna in Everschade.","Speak with Raya-O-Senna at Camp Tranquil.","Defeat the enraged creatures!"],"dialogue":[{"name":"ESUMIYAN","text":"<span class=\"highlight\">Forename</span>, I am glad you have come. I have a task of a most urgent and confidential nature, and I can think of none other to whom I can entrust it."},{"name":"ESUMIYAN","text":"You are doubtless familiar with the Seedseers, yes? Kan–E–Senna─Elder Seedseer, leader of the Order of the Twin Adder, and guardian of our fair nation─clearly needs no introduction, but know you also of her siblings?"},{"name":"ESUMIYAN","text":"The two young Padjals, Sister Raya–O–Senna and Brother A–Ruhn–Senna, make for Everschade as we speak, where they will perform a ritual of great import. Verily, such import that it would be no overstatement to say that the very fate of Gridania hangs in the balance."},{"name":"ESUMIYAN","text":"As you well know, we dwell in this forest by the good graces of the elementals, eternal guardians of the Twelveswood, and most of all the great one who dwells within the Guardian Tree. Yet our ceaseless warring and ill treatment of the trees that shelter us have aroused the great one's ire, and it is only by the Quieting─the ritual of which I spoke─that he may be placated."},{"name":"ESUMIYAN","text":"Thus did the two Seedseers set out for Everschade, with nary a guard to accompany them. Therein lies the rub, and the nature of the favor I ask of you."},{"name":"ESUMIYAN","text":"By no means would I question the powers of the Seedseers, but with the great one's anger mounting, the Twelveswood becomes a threatening domain for even the most puissant of conjurers."},{"name":"ESUMIYAN","text":"Pray hasten to Everschade and see that no harm befalls the two."},{"name":"RAYAOSENNA","text":"Curses! How can we hope to make it to the Guardian Tree with these ghastly creatures bursting forth like rampant weeds?"},{"name":"RAYAOSENNA","text":"If I'd known what we were in for, I'd have brought along a Wood Wailer or two. In fact, I daresay we should return and do exactly that!"},{"name":"ARUHNSENNA","text":"Oh, do not be such a coward, Sister. We are Seedseers─these overgrown vermin are no match for us."},{"name":"RAYAOSENNA","text":"Bold words, Brother. But were they <span class=\"emphasis\">true</span> words, we would have dispatched our enemies and arrived safely at our destination bells ago."},{"name":"RAYAOSENNA","text":"Hm? A conjurer, are you...? Brother E–Sumi, ever the worrier. For once, however, his solicitude is most welcome. Might you help us dispose of these fell creatures?"},{"name":"ARUHNSENNA","text":"Have you no pride, Sister!? A Seedseer does not beg the aid of some common adventurer!"},{"name":"RAYAOSENNA","text":"Enough, Brother! We have a duty to perform─a duty that takes precedence over your silly notions of pride. Now, enough talk! Let us see to these pests."},{"name":"RAYAOSENNA","text":"That crystal! Do my eyes deceive me, or does this adventurer inherit the legacy of A–Towa–Cant?"},{"name":"RAYAOSENNA","text":"It was none other than A–Towa himself who last performed the Quieting. No, I do not believe this adventurer's arrival is mere coincidence."},{"name":"RAYAOSENNA","text":"Bearer of the soul crystal, inheritor of arcane knowledge long since forbidden to those not of our kind... I know not why it is <span class=\"emphasis\">you</span> he chose, but I believe our great forefather has led you to us today."},{"name":"RAYAOSENNA","text":"Ancient tradition dictates that the Quieting be performed by three Padjals─ah, but I misspeak. The ritual is to be performed by three <span class=\"emphasis\">white mages</span>. If Master A–Towa truly has chosen this adventurer as his successor..."},{"name":"ARUHNSENNA","text":"Y-You speak madness, Sister! Surely, you have not forgotten that Padjali tradition strictly forbids sharing the teachings with those not of our kind. The power of white magic is far too great to risk it falling into the wrong hands!"},{"name":"RAYAOSENNA","text":"And so you would uphold tradition merely for tradition's sake? Even at the risk of incurring the great one's wrath and bringing disaster upon our forest home?"},{"name":"ARUHNSENNA","text":"Have you so little faith in your own abilities, Sister? We are Seedseers─more than capable of slaying any beasts in our way and carrying out the ritual on our own."},{"name":"RAYAOSENNA","text":"&lt;sigh&gt; This petty bickering is getting us nowhere..."},{"name":"RAYAOSENNA","text":"Adventurer! I am sorry to trouble you with our silly sibling squabbles... If you've the time, I would speak with you further. But not here. Come to Camp Tranquil, and come quickly; time is of the essence."},{"name":"RAYAOSENNA","text":"Thank you for coming, adventurer. Forgive my brother's rudeness─he cannot help that he was born with a head of solid stone. Anywise, I do not believe we have been properly introduced. I am Raya–O–Senna, a Padjal─as you can see─and sister of the Elder Seedseer."},{"name":"RAYAOSENNA","text":"You are <span class=\"highlight\">Forename</span>, yes? Brother E–Sumi has spoken of you─and most highly, at that."},{"name":"RAYAOSENNA","text":"As you no doubt have heard, my brother, A–Ruhn, and I were en route to the Guardian Tree. There, the great one, by whose graces we dwell here, resides."},{"name":"RAYAOSENNA","text":"The gentlest of guardians when at peace, a destructive force that knows no bounds when angered─as the great one goes, so goes our fate. The creatures you helped us dispatch─doubtless they, too, were roused to hostility by the great one in his anger."},{"name":"RAYAOSENNA","text":"You need only look around you to see. The forest grows more and more threatening with each passing hour. So it is that we traveled here to quell the great one's fury─to perform the Quieting."},{"name":"RAYAOSENNA","text":"In days of old, the ritual was, without fail, performed by three white mages. With our elder sister occupied with her many duties, my brother and I thought to attempt it on our own. A–Ruhn was quite confident, but I had my doubts..."},{"name":"RAYAOSENNA","text":"It was then that <span class=\"emphasis\">you</span> arrived, and shortly thereafter became one of the chosen few to be gifted with a white mage's soul crystal. 'Tis no small honor; that gem marks you as an inheritor of the magic of our ancestors."},{"name":"RAYAOSENNA","text":"My brother's pride may blind him, but the signs are clear as day to me. You are not Padjali, but A–Towa–Cant meant for you to be here today, to perform the ritual with us."},{"name":"RAYAOSENNA","text":"A–Towa–Cant is known to all as one of the greatest mages in our history, but even more so, he was known for being something of an eccentric. In defiance of tradition, he bid farewell to his forest home, wandering the realm and healing the wounds of the land and its people wheresoever he went."},{"name":"RAYAOSENNA","text":"A most admirable cause, yes? But alas, A–Towa was never to return. He perished in a far–off land, and having taken no apprentices, his legendary powers were lost to us for eternity. Or so I believed...until I met you."},{"name":"RAYAOSENNA","text":"And yet, for all his stubbornness, there is some truth to my brother's words. Ancient laws forbid us from sharing the teachings of white magic outside of our own kind. There are reasons for this, which I would share with you when the time is right."},{"name":"RAYAOSENNA","text":"There are many who would not approve of this arrangement. Still, I am convinced that it is A–Towa's will that we bring you into the fold. And so I welcome you, <span class=\"highlight\">Forename</span> of the white."},{"name":"RAYAOSENNA","text":"I can feel the great one's fury welling up even now. Time is short, and yet, while you may have been chosen by A–Towa, I fear your journey as a white mage has just begun. Return to me when you have further honed your skills, and we shall proceed with your training."},{"name":"SYSTEM","text":"The next white mage quest will be available from Raya–O–Senna upon reaching level 35."},{"name":"QIB","text":"The great one does not approve of our presence here..."},{"name":"QIB","text":"I'll thank you to stay out of my way, adventurer."},{"name":"QIB","text":"Bring down as many of the creatures as you can!"},{"name":"QIB","text":"We never should have tried to fight this battle alone... Brother, forgive me..."},{"name":"QIB","text":"I am A-Ruhn-Senna! I will not...fall...to these...urghhh..."}],"reward":{"action":136,"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":7}],"questsType":"all","quests":[65977,66049]},"next":[66616]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1007850","obj":{"i":1007850,"n":"Raya-O-Senna","l":54,"q":1}},{"type":"action","id":"136","obj":{"i":136,"n":"Presence of Mind","c":2626,"j":24,"t":4,"l":30}},{"type":"quest","id":"65977","obj":{"i":65977,"n":"In Nature's Embrace","g":133,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66616","obj":{"i":66616,"n":"Only You Can Prevent Forest Ire","g":153,"l":"South Shroud","s":2,"f":1}}]}