{"quest":{"name":"Following in His Footsteps","location":"South Shroud","id":66618,"patch":2.0,"sort":4,"icon":100110,"unlocksFunction":1,"eventIcon":71341,"issuer":1006751,"target":1006751,"genre":153,"usedItems":[3687,3894,3463,2902],"journal":["Raya–O–Senna would send you on a pilgrimage.","Raya–O–Senna explains that in order to withstand the fury of the great one while performing the Quieting, you must clad yourself in garb imbued with the powers of your forebear. Take the items of clothing she has given you and /pray before three of A–Towa–Cant's resting places─in the Serpent's Tongue, the Tangle, and Raubahn's Push─that you might obtain the great mage's blessing.","Your prayers have been answered, and you have received the blessing of A–Towa–Cant for the three pieces of garb entrusted to you. Return to Camp Tranquil and speak with Raya–O–Senna.","Pleased by your success, Raya–O–Senna goes on to tell you of a fourth location where an urn of A–Towa-Cant's ashes has been laid to rest. Take the fresh set of white mage's robes you've been given, and pay your respects to the grave near Proud Creek in the North Shroud.","The grave by Proud Creek has been defiled and A–Towa–Cant's remains stolen, leaving you unable to obtain the great mage's blessing. Return the unenchanted robe to Raya–O–Senna.","Incensed upon hearing that A–Towa–Cant's grave has been robbed, Raya–O–Senna nevertheless sends you on the last leg of your pilgrimage. Travel to the Kobold Dig in outer La Noscea, where the great mage is said to have perished.","After bowing your head in solemn prayer one last time, you have received another of the great Padjal's blessings, making the healer's circlet yours. Head back to Raya–O–Senna at Camp Tranquil and inform her of your progress.","Raya–O–Senna explains her reasons for sending you on the pilgrimage. It was not merely for the purpose of enchanting your ritual garb, but also because she wished for you to see with your own eyes the beauty and suffering of the realm, as A–Towa–Cant once did. Angered by the defilement of the great mage's resting place, she has vowed to find the culprit."],"objectives":["/pray before the grave of A–Towa–Cant in the Serpent's Tongue.","/pray before the grave of A–Towa–Cant in the Tangle.","/pray before the grave of A–Towa–Cant in Raubahn's Push.","Speak with Raya–O–Senna at Camp Tranquil.","Examine the grave of A–Towa–Cant near Proud Creek.","Return the unenchanted robe to Raya–O–Senna.","/pray before the grave of A–Towa–Cant near the Kobold Dig.","Report to Raya–O–Senna at Camp Tranquil."],"dialogue":[{"name":"RAYAOSENNA","text":"Your command of white magic has advanced considerably, <span class=\"highlight\">Forename</span>. Yes, the time draws near─let us begin our preparations for the Quieting."},{"name":"RAYAOSENNA","text":"At its roots, the ritual is no different from the acts of pacifying that you have already performed. The difference lies only in the difficulty of the effort─the great one possesses a power unfathomably more immense than the elementals you have communed with thus far."},{"name":"RAYAOSENNA","text":"Power so immense that a mage might be easily overwhelmed by the sheer force of its will. To prevent such a catastrophic fate, our tradition decrees that especial garb must be donned before performing the ritual."},{"name":"RAYAOSENNA","text":"I have prepared for you these pieces, but I fear they will not avail you in their current state. So it is that I would send you on a journey."},{"name":"RAYAOSENNA","text":"I trust you know the story of A–Towa–Cant. Rare among the Padjal, he left the forest behind to travel the realm, healing the land and its people. As tribute to his wanderlust, after he passed, his ashes were divided among several urns, which were in turn carried to the far reaches of the realm."},{"name":"RAYAOSENNA","text":"And it was there, in the distant lands that the great mage so loved, that his ashes were buried, and monuments erected in his honor. You are to go on a pilgrimage to these sites, and receive the blessings of your forebear. Only then will the garb I've gifted you be imbued with his divine powers."},{"name":"RAYAOSENNA","text":"Mind you, you will find that these places are not as welcoming as they might have been in Master A–Towa's time. The first site is on the shores of western La Noscea, in a place now feared as the Serpent's Tongue, home to a band of vile pirates."},{"name":"RAYAOSENNA","text":"The next is to be found in Mor Dhona, in that overgrown labyrinth of roots and vines so affectionately known as the Tangle. I do hope that Master A–Towa's ashes have survived those most oppressive environs."},{"name":"RAYAOSENNA","text":"The third site I would have you visit is perhaps the most treacherous location of the lot─Raubahn's Push in northern Thanalan, a stone's throw from an imperial stronghold. I urge you to exercise extreme caution."},{"name":"SYSTEM","text":"The gravestone is inscribed with an epitaph paying tribute to the life and deeds of the great mage, A–Towa–Cant."},{"name":"RAYAOSENNA","text":"Your safe return heartens me, <span class=\"highlight\">Forename</span>. I can feel newfound power emanating from the garb I gave you. I trust that this stage of your pilgrimage was a success."},{"name":"RAYAOSENNA","text":"Now that you have traveled the realm and seen the land as Master A–Towa did, I would share with you the rest of his tale. The histories claim that A–Towa–Cant disappeared in the mountains of O'Ghomoro, the kobold motherland. This is not untrue, but there is more to the story."},{"name":"RAYAOSENNA","text":"When the great mage did not return from his journey, one of his most devoted students went in search of him. As the legends have it, the young mage single-handedly fought off veritable legions of kobolds while scouring the mountains for any sign of his master."},{"name":"RAYAOSENNA","text":"Sadly, it was as all had feared. Though the young mage eventually found his master, the great A–Towa–Cant lived no more."},{"name":"RAYAOSENNA","text":"As if the death of the man were not enough, Thyrus─A–Towa–Cant's great staff, a mighty relic passed down by his ancestors─was lost to the shadows."},{"name":"RAYAOSENNA","text":"Undeterred, the young mage fought off the kobold hordes to carry his master's remains back to the surface. A ceremony was held to honor Master A–Towa's life and deeds, and urns housing his ashes were carried off to the far-reaching frontiers of which he was so fond in his living years."},{"name":"RAYAOSENNA","text":"All the urns, that is, except for one. Yes, though the precise location is known to only a few, Master A–Towa also rests closer to home. Here in the Twelveswood, not far from Proud Creek, you will find yet another monument to the great mage.<br>Take with you this habit, and pay your respects as before. If you keep pure intentions in your heart and in your mind, then the healer's robe shall be your reward."},{"name":"SYSTEM","text":"The grave has been defiled, and its contents appear to have been stolen."},{"name":"SYSTEM","text":"The power of A–Towa–Cant has been lost here. Return to Camp Tranquil and seek counsel from Raya–O–Senna."},{"name":"RAYAOSENNA","text":"The urn holding Master A–Towa's ashes was stolen!? This cannot be!"},{"name":"RAYAOSENNA","text":"Grave robbery is a damnable enough crime in itself, but what manner of scoundrel would dare defile the resting place of a Padjal?"},{"name":"RAYAOSENNA","text":"Rest assured that I will investigate this heinous crime immediately. In the meantime, your pilgrimage demands you travel to one last destination."},{"name":"RAYAOSENNA","text":"This final leg of your journey will take you to the very place that Master A–Towa drew his last breath: O'Ghomoro, the homeland of the kobolds in outer La Noscea. It is there, in plain sight of the Kobold Dig, that the student of whom I spoke did erect a monument to his fallen master."},{"name":"RAYAOSENNA","text":"Welcome back, <span class=\"highlight\">Forename</span>. The journey was not an easy one, I trust, and yet I knew that Master A–Towa would guide you safely back to me."},{"name":"RAYAOSENNA","text":"In your travels, you have received the blessings of our great ancestor. And yet, this was not the sole reason I sent you on this pilgrimage. Perhaps you sensed something of my intentions during your trip."},{"name":"RAYAOSENNA","text":"Yes, <span class=\"highlight\">Forename</span>. As <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who would inherit Master A–Towa's legacy, I wanted you to truly walk in his footsteps."},{"name":"RAYAOSENNA","text":"To see the realm─in both its beauty and its suffering─with your own eyes, as the great mage did so long ago."},{"name":"RAYAOSENNA","text":"And yet it is strange, no? A pirate's lair, a rampant jungle, mountains of fire─of all the hostile environs to which you journeyed, the single grave despoiled was that which rests right here in our forest home."},{"name":"RAYAOSENNA","text":"I suspect this was the handiwork of no witless grave robber, but rather someone who knew all too well the value of that which was buried within."},{"name":"RAYAOSENNA","text":"We must uncover the truth behind this crime and return Master A–Towa's ashes to their rightful resting place, and quickly. You are with me, yes?"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":25}],"quests":[66617]},"next":[66619]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"item","id":"3687","obj":{"i":3687,"n":"Healer's Gloves","l":50,"c":48242,"t":37,"p":1000}},{"type":"item","id":"3894","obj":{"i":3894,"n":"Healer's Boots","l":50,"c":46219,"t":38,"p":1000}},{"type":"item","id":"3463","obj":{"i":3463,"n":"Healer's Culottes","l":50,"c":45189,"t":36,"p":1000}},{"type":"item","id":"2902","obj":{"i":2902,"n":"Healer's Circlet","l":50,"c":40616,"t":34,"p":1000}},{"type":"quest","id":"66617","obj":{"i":66617,"n":"O Brother, Where Art Thou","g":153,"l":"South Shroud","s":3,"f":1}},{"type":"quest","id":"66619","obj":{"i":66619,"n":"Yearn for the Urn","g":153,"l":"South Shroud","s":5,"f":1}}]}