{"quest":{"name":"Austerities of Flame","location":"Limsa Lominsa","id":66627,"patch":2.0,"sort":1,"icon":100108,"unlocksFunction":1,"eventIcon":71341,"issuer":1000909,"target":1006756,"involved":[1006786],"genre":155,"journal":["Acting Guildmaster Thubyrgeim has news of a task which might interest you.","Thubyrgeim has told you of a request made to the guild that asks for an arcanist of uncommon experience. If you would answer this request, you are to travel to Apkallu Falls in Gridania and speak with Y'mhitra.","Y'mhitra, a member of the scholarly Sons of Saint Coinach, explains the recent discovery that led to her requesting your cooperation. Seek out the researcher in the west of Byregot's Strike, and follow her instructions for conducting the Austerities of Flame.","You have successfully tamed the egi spawned by the summoning ritual. Speak with Y'mhitra once more to learn what must next be done.","After praising your performance during the battle to subdue the egi, Y'mhitra bids you meet with her back at Apkallu Falls in Gridania.","You return to where you first met Y'mhitra, and she explains to you the nature of the entity you now command. The next stage of her research will culminate in the Austerities of Earth─a ritual that demands the summoner to have once toppled the primal Titan. Even with such experience, however, you will first need to accustom yourself to your newfound abilities.<br><br>※The next summoner quest will be available from Y'mhitra upon the successful defeat of the primal Titan, and upon reaching level 35."],"objectives":["Speak with Y'mhitra at Apkallu Falls.","Speak with Y'mhitra west of Byregot's Strike.","Speak with Y'mhitra.","Return to Y'mhitra at Apkallu Falls.","Defeat Ifrit-Egi!"],"dialogue":[{"name":"THUBYRGEIM","text":"Greetings, <span class=\"highlight\">Forename</span>. You might be interested to know that the guild has received an intriguing request. The task, however, specifically requires an arcanist that has faced and defeated the primal Ifrit."},{"name":"THUBYRGEIM","text":"If you would consider undertaking this duty, then you must first travel to Ul'dah and participate in an expedition to slay the Lord of the Inferno."},{"name":"SYSTEM","text":"The first summoner quest will become available from Thubyrgeim upon the successful defeat of the primal Ifrit."},{"name":"THUBYRGEIM","text":"Greetings, <span class=\"highlight\">Forename</span>. It is well you have come, for we have an intriguing matter to discuss."},{"name":"THUBYRGEIM","text":"A request has come to our guild from the Sons of Saint Coinach─an organization of some of the finest minds in Eorzea─and they have asked for you by name."},{"name":"THUBYRGEIM","text":"It appears that the research the Sons are currently conducting would benefit from the assistance of an arcanist─specifically one who has had the tempering experience of defeating the primal Ifrit."},{"name":"THUBYRGEIM","text":"Though I must admit to some curiosity as to how these scholars knew the extent of your heroic exploits, I suppose the source of their knowledge is of little relevance..."},{"name":"THUBYRGEIM","text":"If you would answer this request, then you will find your contact, a researcher by the name of Y'mhitra, at Apkallu Falls in the nation of Gridania."},{"name":"YMHITRA","text":"You are <span class=\"highlight\">Forename Surname</span>, I assume? Well met, and thank you for coming. My name, as you have obviously surmised, is Y'mhitra."},{"name":"YMHITRA","text":"I am a member of the Sons of Saint Coinach. Ours is a Sharlayan order that seeks the lost knowledge of the Allagan Empire."},{"name":"YMHITRA","text":"And in that regard, we have recently made a singularly important discovery at our dig site in Mor Dhona."},{"name":"YMHITRA","text":"We salvaged from the ruins a set of ancient texts describing the existence of a sect of Allagan mages known as “summoners.” These were arcane practitioners said to have the ability to siphon the essences of the primals and manifest this stolen energy as a biddable ally known as an “egi.”"},{"name":"YMHITRA","text":"Should we succeed in resurrecting such arts, then we might well hold in our hands the power to bring this age of conflict to an end. There is, however, as there always must be, one monumental obstacle to realizing this reality."},{"name":"YMHITRA","text":"In order to manifest these obedient incarnations of the beastmen's savage deities, one must first defeat a primal and capture its aetheric essence."},{"name":"YMHITRA","text":"Thus, only one who can boast such a daunting achievement under <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> belt may even begin on the path to becoming a summoner. Do you understand now why I called upon you?"},{"name":"YMHITRA","text":"If you wish to contribute to my research, then come to me in the west of Byregot's Strike, in southern Thanalan. There shall we conduct a ritual of summoning: the Austerities of Flame."},{"name":"YMHITRA","text":"Greetings to you once more, <span class=\"highlight\">Forename</span>. I had a feeling this unique opportunity would be nigh impossible for you to ignore. Let us proceed directly to the ritual, shall we?"},{"name":"YMHITRA","text":"According to the records we recovered, the summoners of old would perform these rites in a land in which the naturally dominant element matched the aspect of the avatar they wished to call forth. Only in such a place might one sufficiently shift one's aetheric balance in the desired direction."},{"name":"YMHITRA","text":"The element of fire is especially strong here in the Sagolii Desert─I can think of no land more fitting in which to summon an incarnation of the Lord of the Inferno."},{"name":"YMHITRA","text":"Before we begin, I must insist that you accept this gem. It may appear of little worth, but within its faceted depths dwell the memories of long-deceased summoners."},{"name":"YMHITRA","text":"Now, you must focus. Visualize the aether flowing through you, a vibrant current of energy transforming into living fire. Hold this image in your mind, and the raging heat of your life force shall spawn an egi wreathed in flames!"},{"name":"YMHITRA","text":"Be aware, however, that this nascent entity will appear before you unbound and hostile. It is your charge to overpower the avatar, and establish yourself as its master. The path of the summoner is naught if not fraught with peril!"},{"name":"YMHITRA","text":"Most impressive, <span class=\"highlight\">Forename</span>! The fire-born egi has submitted to your will!"},{"name":"YMHITRA","text":"You have mastered the Austerities of Flame, and that is no small feat. Pray let us return to Apkallu Falls that we might further discuss your achievement!"},{"name":"YMHITRA","text":"This is truly a momentous occasion! You have rescued the lost art of summoning from the grasping mire of forgotten history."},{"name":"YMHITRA","text":"But you must know more of the avatar you have bound. In the ancient tongue of the Allagan Empire, it would be known as “Ifrit-Egi,” where “egi” translates approximately to “pure” or “the essence of.”"},{"name":"YMHITRA","text":"In short, you have tamed a willful manifestation of Ifrit's raging fires."},{"name":"YMHITRA","text":"As you might expect from an entity born of the Lord of the Inferno, this avatar and its capacity for destruction should serve you well in your battles to come."},{"name":"YMHITRA","text":"With such an ally at your command, it is not too soon to take upon yourself the title of “summoner.” You have proven yourself more than worthy of the soul crystal you now possess."},{"name":"YMHITRA","text":"Yet be that as it may, the road before you is long and arduous. If you would triumph in this age of conflict, you must needs master more than just the egi of fire. I suggest you next fix your gaze upon claiming a servant of unyielding stone."},{"name":"YMHITRA","text":"You once seized victory against the primal Titan, did you not? Though I admit I am eager to progress directly to the Austerities of Earth, we must be careful not to overtax your reserves of strength."},{"name":"YMHITRA","text":"Rest well, and spend some time to grow accustomed to your newfound abilities. Once you feel prepared to continue with our historic research, you will find me here awaiting your arrival with barely constrained impatience!"},{"name":"YMHITRA","text":"This will, of course, necessitate you joining an expedition to defeat the primal known as Titan. This beloved divinity of the kobolds poses the greatest threat to Limsa Lominsa, and it is there that you shall find allies in your cause."},{"name":"YMHITRA","text":"The risks are great, but so, too, are the rewards! Topple the Lord of Crags, and we may progress to the next stage of our historic research! Fair fortune to you, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"The next summoner quest will be available from Y'mhitra upon reaching level 35."},{"name":"QIB","text":"The heat is almost intolerable.<br>Pray defeat this entity swiftly, <span class=\"highlight\">Forename</span>."},{"name":"QIB","text":"Ifrit-Egi has summoned sprites to do its bidding!<br>Have a care they do not surround you!"},{"name":"QIB","text":"You must shatter the crimson nails!<br>They amplify the egi's powers!"},{"name":"QIB","text":"The crimson nails are destroyed!<br>Now is the time to press your attack!"},{"name":"QIB","text":"My apologies, I... Combat is not my forte..."}],"reward":{"action":25805,"items":[{"id":4549}],"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":27}],"instances":[20001],"questsType":"all","quests":[65997,66049]},"next":[66628]},"partials":[{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006786","obj":{"i":1006786,"n":"Y'mhitra","l":45,"q":1}},{"type":"action","id":"25805","obj":{"i":25805,"n":"Summon Ifrit","c":2680,"j":27,"t":2,"l":30}},{"type":"item","id":"4549","obj":{"i":4549,"n":"Soul of the Summoner","l":30,"c":26010,"t":62}},{"type":"instance","id":"20001","obj":{"i":20001,"n":"The Bowl of Embers","c":61804,"t":"Trials","min_lvl":20,"max_lvl":22}},{"type":"quest","id":"65997","obj":{"i":65997,"n":"Sinking Doesmaga","g":135,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66628","obj":{"i":66628,"n":"Austerities of Earth","g":155,"l":"Gridania","s":2,"f":1}}]}