{"quest":{"name":"Heart of the Forest","location":"South Shroud","id":66620,"patch":2.0,"sort":6,"icon":100110,"unlocksFunction":1,"eventIcon":71341,"issuer":1006751,"target":1006751,"involved":[1007854,1007855],"genre":153,"journal":["Raya–O–Senna is wearing a concerned expression.","With time running out, and yet lacking the means to complete the enchantment of your ritual garb, the Seedseer siblings have come to the decision that the three of you must attempt the Quieting nonetheless. Make for Everschade and quell the fury of the Guardian Tree.","As you begin the ritual, the great one's wrath descends upon you in the form of a bevy of enraged forest creatures. However, before all hope is lost, A–Towa–Cant himself appears from out of the aether to fight alongside you. After a grueling battle, the great mage is again forced back into his aetherial slumber, but not before entrusting the future of the Twelveswood to you and the Seedseers. With peace returned at last, return to Camp Tranquil and speak with Raya–O–Senna.","Raya–O–Senna expresses her profound gratitude for your assistance in the ritual. In recognition of your accomplishments as a white mage, she bestows upon you the last piece of your garb─now imbued with the power of the departed A–Towa–Cant─and imparts unto you the most powerful incantation she knows. Expressing her confidence that you will bring succor to the realm and do her people proud, she wishes you well in your journeys.<br><br>※The next white mage quest will be available from Raya–O–Senna once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Quell the fury of the Guardian Tree in Everschade.","Speak with Raya–O–Senna at Camp Tranquil.","Quell the great one's fury and heal the Guardian Tree!"],"dialogue":[{"name":"RAYAOSENNA","text":"Forgive me, <span class=\"highlight\">Forename</span>. Brother and I have considered every possibility, and attempted every incantation at our disposal, but I fear the task of completing the enchantment has proven beyond our abilities."},{"name":"ARUHNSENNA","text":"No living Padjal─not even our sister─possesses such power. Without the blessing of A–Towa–Cant, there is nothing we can do."},{"name":"RAYAOSENNA","text":"With the ashes returned to their rightful resting place, A–Towa–Cant's spirit will return. Surely, it is only a matter of time!"},{"name":"ARUHNSENNA","text":"Look around you, Sister. Open your eyes and ears. <span class=\"emphasis\">Time</span> is one thing we do not have."},{"name":"RAYAOSENNA","text":"A–Ruhn?"},{"name":"ARUHNSENNA","text":"The fury of the great one mounts with each passing moment─it will not be contained much longer. No, the time for waiting is long past. Now is the time for action."},{"name":"RAYAOSENNA","text":"But...<span class=\"highlight\">Forename</span>'s garb! The enchanting is not yet complete!"},{"name":"ARUHNSENNA","text":"The situation is far from ideal. Yet we have no choice─we must trust in <span class=\"highlight\">Forename</span>'s powers and do what we can."},{"name":"RAYAOSENNA","text":"Do I hear you right, A–Ruhn? Why, it was not long ago that you objected to <span class=\"highlight\">Forename</span>'s very presence at the ritual!"},{"name":"ARUHNSENNA","text":"I may be stubborn, Sister, but I am no fool. I have witnessed <span class=\"highlight\">Forename</span>'s abilities with my own eyes. There can be no doubting that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is a mage of the white, one as worthy as you and I."},{"name":"RAYAOSENNA","text":"A–Ruhn...if you would place your trust in <span class=\"highlight\">Forename</span> so, I see no reason why I should not. Very well, let us hasten for Everschade!"},{"name":"RAYAOSENNA","text":"Is something the matter, <span class=\"highlight\">Forename</span>? This is no time to lose faith in your abilities! Hurry and take your place by the Guardian Tree!"},{"name":"ARUHNSENNA","text":"<span class=\"highlight\">Forename</span>... I speak to you now as my peer. The fate of Gridania lies in the balance─we can ill afford to fail."},{"name":"ARUHNSENNA","text":"The great one's rage is too strong! I cannot reach him!"},{"name":"RAYAOSENNA","text":"Stay focused, A–Ruhn! If we fall, who will rise to take our place!?"},{"name":"ARUHNSENNA","text":"But, Sister...the forest itself turns against us!"},{"name":"RAYAOSENNA","text":"If we can only reach the great one, his minions will relent. Cast away your worries, and focus your mind on the ritual!"},{"name":"RAYAOSENNA","text":"No! <span class=\"highlight\">Forename</span>!"},{"name":"ATOWACANT","text":"(-???-)Stand strong, <span class=\"highlight\">Forename</span>! Are you going to let some overgrown shrub ruffle your feathers?"},{"name":"ATOWACANT","text":"(-???-)And the two of you! Don't you have a ritual to perform?"},{"name":"ARUHNSENNA","text":"D-Do... Do my eyes deceive me!?"},{"name":"ATOWACANT","text":"This is no time for chitchat! Raya–O, A–Ruhn, <span class=\"highlight\">Forename</span>─focus your energies on the Guardian Tree!"},{"name":"ATOWACANT","text":"We must quell the great one's fury! Dispatch its minions and resume the Quieting!"},{"name":"ATOWACANT","text":"Now! Focus your powers on the Guardian Tree!"},{"name":"RAYAOSENNA","text":"Is it...over?"},{"name":"ATOWACANT","text":"The great one's anger abates. You have done well, my children."},{"name":"ARUHNSENNA","text":"Master A–Towa. Do you truly...live?"},{"name":"ATOWACANT","text":"Live...? Not as you would define the word. Mayhap in the heart of <span class=\"highlight\">Forename</span> here, whose strength I borrowed to join you."},{"name":"RAYAOSENNA","text":"It's...a miracle."},{"name":"ATOWACANT","text":"Aye, it may very well be. Or perhaps the Mothercrystal heard this old soul's wish..."},{"name":"ATOWACANT","text":"I lived a long and fruitful life. But when I drew my last breath in O'Ghomoro that day, I did so with one profound regret─that I would pass from this realm without finding a worthy inheritor to bequeath my knowledge in full."},{"name":"ATOWACANT","text":"My spirit left my lifeless body to abide in this soul crystal, with the hope that one day it would find its way into the hands of my successor."},{"name":"ATOWACANT","text":"For years, my consciousness slumbered in the darkness...until I met <span class=\"highlight\">Forename</span>."},{"name":"ATOWACANT","text":"From the moment you took my crystal in hand, I knew. Padjal or no, I had at long last found one to whom I could truly pass on my knowledge."},{"name":"ATOWACANT","text":"Yes, <span class=\"highlight\">Forename</span>, I knew... Urrrgh!"},{"name":"ARUHNSENNA","text":"Master A–Towa!?"},{"name":"ATOWACANT","text":"The power of the crystal grows faint... It would seem my all–too–brief sojourn here has come to an end."},{"name":"ATOWACANT","text":"Farewell, <span class=\"highlight\">Forename</span> of the white. Farewell, my children. I leave my forest home in your capable hands..."},{"name":"RAYAOSENNA","text":"Master A–Towa... He has left us."},{"name":"ARUHNSENNA","text":"And yet by his power─and that of his successor, <span class=\"highlight\">Forename</span>─the great one's fury is quelled, and the Twelveswood is safe."},{"name":"ARUHNSENNA","text":"Though Master A–Towa traveled the world, no doubt his heart always remained here. In the forest home he loved, he waited for us..."},{"name":"RAYAOSENNA","text":"Why, Brother...for once, you almost sound wise beyond your years."},{"name":"ARUHNSENNA","text":"Strange, is it not? Perhaps I have finally learned something from you, dear sister."},{"name":"RAYAOSENNA","text":"As I could learn something from you, A–Ruhn. Your pride as a Padjal, your deep respect for our past─these are traits to be admired. The same can be said for Master A–Towa's liberality. Yes, I believe there is a place for both beliefs among our kind."},{"name":"RAYAOSENNA","text":"The road was a long and winding one, but at long last our work is done. Let us return to Camp Tranquil."},{"name":"RAYAOSENNA","text":"To meet Master A–Towa in the flesh! Well, not <span class=\"emphasis\">flesh</span>, perhaps... I am still shaking from the experience...and from the pure joy of seeing peace return to my forest home at last."},{"name":"RAYAOSENNA","text":"I will be forever grateful to you, <span class=\"highlight\">Forename</span>. I am honored that we were able to heal the wood together."},{"name":"RAYAOSENNA","text":"I speak not only for myself; my brother has expressed the same sentiments. Were Master A–Towa here, I am sure he would say the same."},{"name":"RAYAOSENNA","text":"Though...perhaps he <span class=\"emphasis\">is</span> still here in some form. Behold! The final piece of your garb now pulses with his ancient power."},{"name":"RAYAOSENNA","text":"Yes, there can be no doubt that Master A–Towa intended this as his parting gift to you."},{"name":"RAYAOSENNA","text":"Take it, and wear it with pride...<span class=\"highlight\">Forename</span> of the white."},{"name":"RAYAOSENNA","text":"Before we part, I would bestow unto you a present of my own."},{"name":"RAYAOSENNA","text":"By the ancient powers vested in me as a Seedseer, I bestow upon you the greatest incantation known to our kind. May you ever heed the will of the elementals, and use it in wisdom and compassion."},{"name":"RAYAOSENNA","text":"Phew! I'm not given to formalities. I swear, I do not know how my sister manages..."},{"name":"RAYAOSENNA","text":"In the short time I have known you, <span class=\"highlight\">Forename</span>, you have grown into a fine white mage. I am honored to call you my peer. Use your powers in moderation, and let compassion be your guide, and I have no doubt that you will bring succor and solace wherever your journey takes you."},{"name":"SYSTEM","text":"This concludes the white mage quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next white mage quest will be available from Raya–O–Senna."},{"name":"QIB","text":"The great one is consumed by grief and anger.<br>Our words will not reach him in this state."},{"name":"QIB","text":"Fear not, my children─I will protect you.<br>Focus your energies on the Quieting!"},{"name":"QIB","text":"Out of my way, foul creature!<br>I cannot concentrate on the ritual!"},{"name":"QIB","text":"That's the spirit, my children!<br>I feel the great one responding..."},{"name":"QIB","text":"No! It can't...end like this..."},{"name":"QIB","text":"Sister... Forgive me..."},{"name":"QIB","text":"My strength grows dim, my children...<br>I must...return..."},{"name":"QIB","text":"We must quell the great one's fury!<br>Focus on the Guardian Tree!"}],"reward":{"action":140,"items":[{"id":3225},{"id":20648}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":25}],"quests":[66619]},"next":[66660,67255]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1007854","obj":{"i":1007854,"n":"Raya-O-Senna","l":54,"q":1}},{"type":"npc","id":"1007855","obj":{"i":1007855,"n":"A-Ruhn-Senna","l":54,"q":1}},{"type":"action","id":"140","obj":{"i":140,"n":"Benediction","c":2627,"j":24,"t":4,"l":50}},{"type":"item","id":"3225","obj":{"i":3225,"n":"Healer's Robe","l":55,"c":42236,"t":35,"p":1000}},{"type":"item","id":"20648","obj":{"i":20648,"n":"Cleric's Attire Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66619","obj":{"i":66619,"n":"Yearn for the Urn","g":153,"l":"South Shroud","s":5,"f":1}},{"type":"quest","id":"66660","obj":{"i":66660,"n":"A Relic Reborn (Thyrus)","g":153,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67255","obj":{"i":67255,"n":"Taint Misbehaving","g":153,"l":"South Shroud","s":500,"f":1}}]}