{"quest":{"name":"Doing It the Bard Way","location":"South Shroud","id":66624,"patch":2.0,"sort":4,"icon":100103,"unlocksFunction":1,"eventIcon":71341,"issuer":1006750,"target":1006750,"genre":151,"journal":["Jehantel assents to sing for you the Ballad of the Vainglorious Fool.","After singing the ballad for you, Jehantel asks that you travel to the Gelmorra Ruins in the North Shroud. Once there, you are to lay a bouquet of Nymeia lilies at the resting place of the fallen.","You have laid the flowers at the resting place as instructed by Jehantel. Return to the South Shroud and speak with the bard at his camp west of Quarrymill.","You have returned to Jehantel at his camp. You learn from the tormented bard that the vainglorious fool of the ballad is none other than himself. With the deaths of his companions weighing heavily on his soul, Jehantel could never again summon the will to bend back his bow. He also regrets exposing you to danger, but nevertheless has a further request to make of you. Speak with the bard once more when you have steeled your resolve."],"objectives":["Lay the bouquet of Nymeia lilies at the resting place of the fallen at the Gelmorra Ruins.","Speak with Jehantel at his camp west of Quarrymill.","Defeat the Ixali sabreur!"],"dialogue":[{"name":"JEHANTEL","text":"Welcome back, <span class=\"highlight\">Forename</span>. By your tranquil countenance, it is plain that both your body and soul are in readiness for the next stage of your journey."},{"name":"JEHANTEL","text":"Very well. The time is ripe that I teach you the Ballad of the Vainglorious Fool."},{"name":"JEHANTEL","text":"The song tells the tale of an archer of the Gods' Quiver whose peerless skill was surpassed only by his hubris."},{"name":"JEHANTEL","text":"Alas, that hubris led to the annihilation of his entire regiment at the battle which has come to be called the Massacre of Griffin Crossing. Ahem!"},{"name":"JEHANTEL","text":"Standing guard in dead of night,♪<br>An archer, wearying of the sight,♪"},{"name":"JEHANTEL","text":"Drunk on pride and starved of glory,♪<br>Forsook his post to claim victory.♪"},{"name":"JEHANTEL","text":"Ten score yalms had the archer crept,♪<br>When shrieks rang out whence his comrades slept,♪"},{"name":"JEHANTEL","text":"For he was not there to see the knives,♪<br>Nor to ring the bell and save friends' lives.♪"},{"name":"JEHANTEL","text":"Tell me, <span class=\"highlight\">Forename</span>, what lessons can be learned from this tale?"},{"name":"JEHANTEL","text":"Ah, but hold that thought─what your tongue claims to understand interests me not."},{"name":"JEHANTEL","text":"As before, I'd sooner have you demonstrate the fruits of your learning with bow in hand. This time, however, you shall have the pleasure of my company."},{"name":"JEHANTEL","text":"I would have you escort me to the Gelmorra Ruins in the North Shroud. It is there that some few fallen from the Massacre of Griffin Crossing have been laid to rest. Pray honor this place of remembrance with a bouquet of lilies."},{"name":"JEHANTEL","text":"Heed me, O Puissant Althyk! Cast Thee back the rains to the firmament, that we might gaze upon the battles of yore!"},{"name":"JEHANTEL","text":"The enemy van!?"},{"name":"JEHANTEL","text":"No... I...I cannot..."},{"name":"JEHANTEL","text":"Why? Why do I still draw breath?"},{"name":"JEHANTEL","text":"That a sin of the past would beget another...<br>Forgive me, <span class=\"highlight\">Forename</span>."},{"name":"JEHANTEL","text":"As you have doubtless noticed, I am no longer capable of wielding a bow─I, whom they call the Godsbow."},{"name":"JEHANTEL","text":"I had hoped that the years would take the edge off the memories...but I hoped in vain. Absolution does not come so easily. Heed me well, <span class=\"highlight\">Forename</span>, for I shall reveal all to you."},{"name":"JEHANTEL","text":"The man sung of in the Ballad of the Vainglorious Fool, whose hubris doomed an entire regiment─he and I are one and the same."},{"name":"JEHANTEL","text":"Being no stranger to the bow, you will know that the archer's role in battle is that of support. His charge is to thin out the enemy line, that his comrades might gain ground in the field of battle."},{"name":"JEHANTEL","text":"By that most basic of criteria, I was unfit to hold a bow from the first."},{"name":"JEHANTEL","text":"In my pride and lust for glory, I sent countless souls to a bloody grave─good men and women all, with loved ones and bright futures awaiting them. I lost the will to live that day, becoming an empty husk of a man, tormented in sleep and wakefulness both by the memories of my crime."},{"name":"JEHANTEL","text":"But the gods were not without mercy. They gifted me with song, that I might find a measure of solace in my wretched existence."},{"name":"JEHANTEL","text":"A new melody resounds within you, I see. Though this outing was rather far departed from what I had in mind, that it still bore fruit gives me comfort."},{"name":"JEHANTEL","text":"On that note, let us conclude the lesson. I daresay I have no cause to worry that you will repeat the selfsame mistake as the vainglorious fool."},{"name":"JEHANTEL","text":"<span class=\"highlight\">Forename</span>, I would be alone for a while. Take yourself back to camp─I shall make my own way there presently."},{"name":"JEHANTEL","text":"I am glad to see you safely returned. Though I rasp my voice hoarse through the saying of it, I cannot tell you enough times how much I regret dragging you into such danger."},{"name":"JEHANTEL","text":"...And yet, there is more I would ask of you. If you would do me the kindness of lending your ear, then pray speak now."}],"reward":{"action":117,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":24}],"quests":[66623]},"next":[66625]},"partials":[{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"action","id":"117","obj":{"i":117,"n":"Rain of Death","c":2605,"j":23,"t":4,"l":45}},{"type":"quest","id":"66623","obj":{"i":66623,"n":"Bard's-eye View","g":151,"l":"South Shroud","s":3,"f":1}},{"type":"quest","id":"66625","obj":{"i":66625,"n":"Pieces of the Past","g":151,"l":"South Shroud","s":5,"f":1}}]}