{"quest":{"name":"A Song of Bards and Bowmen","location":"Gridania","id":66621,"patch":2.0,"sort":1,"icon":100103,"unlocksFunction":1,"eventIcon":71341,"issuer":1000200,"target":1006750,"involved":[1007834],"genre":151,"journal":["Guildmaster Luciane wishes to speak to you about learning new skills.","Luciane informs you that the legendary archer-turned-bard, Jehantel the Godsbow, has recently returned to the Twelveswood. Aspiring to transcendent mastery of the bow, several members of the Gods' Quiver have presented themselves as pupils to the legend. Alas, all have returned disappointed, as Jehantel offers only to teach poetry and verse. If you would learn from the man nonetheless, make your way west of Quarrymill in the South Shroud, where he is said to have made his camp.","Having exchanged pleasantries with Jehantel, you astonish the kindly old bard by taking him up on his offer to teach you poetry and verse. He excitedly instructs you to present yourself to a moogle named Pukno Poki, who can often be found in an area situated east of Quarrymill.","Speaking with Pukno Poki, the moogle prevails upon you to recover a stolen charm that was meant for Jehantel. The thief was last seen fleeing to the east of Quarrymill towards Takers' Rot.","You have succeeded in reclaiming the stolen charm. Return it to Pukno Poki, who is likely in the last place you saw him, to the south of Takers' Rot.","You show the charm to Pukno Poki. Impressed by your resourcefulness, the moogle requests that you deliver the strangely shaped crystal to Jehantel in his camp to the west of Quarrymill.","You deliver both Pukno Poki's message and the charm to Jehantel. The legendary archer explains to you that the item you recovered is known as the Soul of the Bard. Jehantel bids you embrace your new calling, and become a bard who exceeds even Pukno Poki's wildest expectations.<br><br>※The next bard quest will be available from Jehantel upon reaching level 35."],"objectives":["Speak with Jehantel to the west of Quarrymill.","Speak with Pukno Poki.","Search for the charm.","Show the charm to Pukno Poki.","Deliver Pukno Poki's charm to Jehantel."],"dialogue":[{"name":"LUCIANE","text":"Well met, <span class=\"highlight\">Forename</span>. Would that we had the time for banter, but we're all up in arms here. Yet another Ixali dirigible has been spotted over the Twelveswood, you see."},{"name":"LUCIANE","text":"Their reappearance calls to my mind the Battle of Griffin Crossing. Well, I say “Battle”─most are agreed that “Massacre” would be rather more apt. Aye, the Ixal dealt us a crushing defeat that day. Right around this time of year, it was, more than two decades past."},{"name":"LUCIANE","text":"A humiliating episode in our history, to be sure, but heavens forbid that we ever forget it. Failure is the finest─if not the kindest─of teachers, and few things drive a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> better than its sting."},{"name":"LUCIANE","text":"Ah, but do let's speak of cheerier matters. Mayhap you've already heard, but a renowned archer has recently returned to the Twelveswood─the one they call the “Godsbow.”"},{"name":"LUCIANE","text":"That's just a title, of course. His birthname is Jehantel, and he was once of the Gods' Quiver. The man was a legend even then, and there was no honor greater than being taken under his tutelage."},{"name":"LUCIANE","text":"But that's not all there is to him, mind you. Jehantel was also a skilled bard, one of the rare few capable of inspiring others to great feats through song."},{"name":"LUCIANE","text":"Upon learning that the Godsbow had returned, dozens of us flocked to him in hopes of training under a legend, yours truly included."},{"name":"LUCIANE","text":"Alas, the meetings haven't unfolded quite as we had hoped. Jehantel has refused to teach each and every suitor that has approached him thus far."},{"name":"LUCIANE","text":"Though, it should be mentioned that the topics he is reluctant to instruct us in do not include poetry and song. He seems <span class=\"emphasis\">exceedingly</span> keen to teach us all about <span class=\"emphasis\">them</span>. Some few of us were tempted to take him up on the offer...save that we have a nation to defend."},{"name":"LUCIANE","text":"Far be it from my intent to belittle all those bards out there, but I like my chances rather better charging into battle with a quiver than a harp. &lt;sigh&gt; And here we were hoping that transcendent mastery of the bow might be ours..."},{"name":"LUCIANE","text":"Hm? By the sparkle in your eyes, I'd wager you have an interest in that selfsame poetry and song. Come now, there is no call for shyness, and there <span class=\"emphasis\">is</span> more to life than battle. If you would present yourself as a pupil to Jehantel, I happen to know his whereabouts."},{"name":"LUCIANE","text":"I'm given to understand that he has made his camp somewhere west of Quarrymill in the South Shroud. Jehantel is an agreeable sort of fellow, and should be willing enough to meet with you."},{"name":"LUCIANE","text":"Truth be told, I'm still holding on to hope. If you could find a way into Jehantel's confidence, mayhap he can yet be persuaded to train us."},{"name":"LUCIANE","text":"I wish you the best of luck, friend."},{"name":"JEHANTEL","text":"Ah, another guest. You are kind to pay me visit, young one."},{"name":"JEHANTEL","text":"Naught gives us elderly folk more pleasure than the company of the young. Add to that a steaming pot of tea and the beauty of the Twelveswood, and we could want for little more!"},{"name":"JEHANTEL","text":"Ah. But the curl of your lip tells me that tea and scenery are not what you desire. You seek knowledge of archery, I take it? In which case, I'm afraid I must disappoint you...<span class=\"highlight\">Forename</span>, was it?"},{"name":"JEHANTEL","text":"Yes, yes, I am Jehantel, the one they called the Godsbow─but that was in another life. I have long cast aside my bow, taking instead a harp to my breast. For years, I have lived as a bard, going wherever the wind blows, exulting in the beauty of creation through song."},{"name":"JEHANTEL","text":"To be sure, I still have the eyes to recognize a promising archer when I see one. And you, young one, have promise. Keep your nose to the grindstone, and one day you may count yourself a virtuoso of the bow."},{"name":"JEHANTEL","text":"Yet know that virtuosity is worthless without virtue. Aye, the words of the Ballad of the Vainglorious Fool tell us this much."},{"name":"JEHANTEL","text":"...You truly wish to remain and learn poetry and verse? Well, well, well...I must admit to being rather taken aback."},{"name":"JEHANTEL","text":"In uncertain days such as these, there are few indeed who would devote their time to song as opposed to more “tangible” endeavors."},{"name":"JEHANTEL","text":"You intrigue me, young one. I find myself growing curious as to how the melodies of old might find expression through you."},{"name":"JEHANTEL","text":"I do believe a certain friend of mine would be of the selfsame opinion. Aye, that would be as good a place as any for us to begin."},{"name":"JEHANTEL","text":"Listen well, <span class=\"highlight\">Forename</span>. There is a moogle named Pukno Poki, who can oft be found wandering an area situated east of here. I would have you present yourself to him."},{"name":"JEHANTEL","text":"Pukno Poki is possessed of a discerning eye for talent. If he sees potential in you, I should be well satisfied that you indeed have the makings of a bard."},{"name":"JEHANTEL","text":"Heed me, O Puissant Althyk! Turn Thee over the hourglass of time, that we might gaze upon the battles of yore!"},{"name":"PUKNOPOKI","text":"Kupoarrrgh! How could this have happened? It's just so...embarrassing! A blunder for the ages, kupo!"},{"name":"PUKNOPOKI","text":"Hm? You understand what I'm saying, don't you?"},{"name":"PUKNOPOKI","text":"That's a rare talent, I'll allow, but you've caught me at a bad time, kupo. Now, be a good adventurer and show yourself out─"},{"name":"PUKNOPOKI","text":"Jehantel sent you!? You should have said so sooner, kupo!"},{"name":"PUKNOPOKI","text":"You <span class=\"emphasis\">do</span> know that Jehantel is no ordinary bard, yes? His songs can salve your heart and strengthen your resolve. They can banish your fears and fill you with hope...and that's not even scratching the surface!"},{"name":"PUKNOPOKI","text":"Why, to hear him perform is like bathing in sunbeams, kupo!"},{"name":"PUKNOPOKI","text":"I've asked, begged, and pled more times than I care to count for Jehantel to stay and sing in the forest. Only now has he deigned to set foot here again...but he's refusing to sing for us. That's a blatant breach of promise, kupo!"},{"name":"PUKNOPOKI","text":"...But what's this? Why, your being resonates with a chord similar to Jehantel's! Perhaps even identical, kupo!"},{"name":"PUKNOPOKI","text":"By the Twelve, this means that things may yet turn out as planned! Why, you might even have it in you to surpass the man, and that's saying a <span class=\"emphasis\">lot</span>, kupo!"},{"name":"PUKNOPOKI","text":"Egads! Your coming had so excited me, my predicament nigh escaped my mind!"},{"name":"PUKNOPOKI","text":"There's a charm that I had meant to give to Jehantel, you see, but it was stolen as I napped, kupo! I roused just in time to espy the thief and attempted to give chase. Alas, drowsiness robbed me of my balance and I was...<span class=\"emphasis\">delayed</span> by this tree."},{"name":"PUKNOPOKI","text":"Last I saw of that overbold brigand, he─or possibly she─was scurrying towards Takers' Rot, kupo. Now, I realize we've only just met, but would you mind recovering the charm and delivering it to Jehantel in my stead?"},{"name":"PUKNOPOKI","text":"Last I saw of that overbold brigand, he─or possibly she─was scurrying towards Takers' Rot, kupo. Now, I realize we've only just met, but would you mind recovering the charm and delivering it to Jehantel in my stead?"},{"name":"PUKNOPOKI","text":"Have you recovered the charm?"},{"name":"PUKNOPOKI","text":"You did it, kupo! Please, you must now deliver it to Jehantel. Tell him that Pukno Poki thinks him a cunning rogue, but is excited nonetheless! So excited, in fact, that he cannot help but sing!<br>Kupololololo～♪"},{"name":"JEHANTEL","text":"Welcome back, <span class=\"highlight\">Forename</span>. Hm? You have a charm and a message for me from Pukno Poki, you say?"},{"name":"JEHANTEL","text":"A cunning rogue, am I? Hah hah hah!"},{"name":"JEHANTEL","text":"I suppose I must explain. Pukno Poki and I go back a long way, to when first I took up the harp. I made a promise to him then, one that I have yet to make good on."},{"name":"JEHANTEL","text":"Pukno Poki has long desired that I remain in the Twelveswood to sing for the rest of my days. Regrettably, I have been ill able to oblige him."},{"name":"JEHANTEL","text":"Duty called, you see─I had battlefields to stand upon and comrades to protect. Moreover, an event came to pass that rendered my being in the Twelveswood...problematic."},{"name":"JEHANTEL","text":"I thought that by taking eager souls such as you under my wing, mayhap it would suffice to appease Pukno Poki."},{"name":"JEHANTEL","text":"Of course, he saw straight through my little ruse. What the moogles lack in grace, they amply make up for in wit."},{"name":"JEHANTEL","text":"The creatures are great lovers of song. That you return with this charm is proof positive of his high regard for your potential as bard and archer both."},{"name":"JEHANTEL","text":"The charm is a crystal known as the Soul of the Bard. Pukno Poki asked that you bring it to me, aye, but he meant for you to have it. It is a gift from the moogles, bestowed upon those they deem worthy of walking the path of the true bard."},{"name":"JEHANTEL","text":"The Soul of the Bard harbors memories of the past─verses and refrains sung by the bards of old."},{"name":"JEHANTEL","text":"As you gain in worldly experience, more of these memories will find expression through your being, imbuing your song with powers untold."},{"name":"JEHANTEL","text":"Now, it may surprise you to hear that bowmen and bards are as next of kin. By the same token, mastery of song is dependent upon one's prowess as an archer."},{"name":"JEHANTEL","text":"The sense in this will be lost upon you at first, but in time the realization will dawn that bow and harp are but stringed instruments played by the same hand."},{"name":"JEHANTEL","text":"Go now, <span class=\"highlight\">Forename</span>, and let your body and soul drink deep of the melodies of old."},{"name":"JEHANTEL","text":"When next we meet, I hope to see a fully fledged bard standing before me...one who exceeds even Pukno Poki's wildest expectations."},{"name":"SYSTEM","text":"The next bard quest will be available from Jehantel upon reaching level 35."},{"name":"SYSTEM","text":"The quest to learn the action “Perform” is now available from Simpkin at Mih Khetto's Amphitheatre in Old Gridania."}],"reward":{"action":114,"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":6}],"questsType":"all","quests":[65612,66049]},"next":[66622,68555]},"partials":[{"type":"npc","id":"1000200","obj":{"i":1000200,"n":"Luciane","l":52,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"npc","id":"1007834","obj":{"i":1007834,"n":"Pukno Poki","l":56,"q":1}},{"type":"action","id":"114","obj":{"i":114,"n":"Mage's Ballad","c":2602,"j":23,"t":4,"l":30}},{"type":"quest","id":"65612","obj":{"i":65612,"n":"The One That Got Away","g":131,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66622","obj":{"i":66622,"n":"The Archer's Anthem","g":151,"l":"South Shroud","s":2,"f":1}},{"type":"quest","id":"68555","obj":{"i":68555,"n":"Plucking the Heartstrings","g":0,"l":"Old Gridania","s":0,"f":1}}]}