{"quest":{"name":"Requiem for the Fallen","location":"South Shroud","id":66626,"patch":2.0,"sort":6,"icon":100103,"unlocksFunction":1,"eventIcon":71341,"issuer":1006750,"target":1007891,"genre":151,"journal":["Jehantel wishes to bestow upon you the final garment of the choral attire.","Jehantel has asked of you one final request. You are to meet him at the site of his regiment's demise to the west of the Observatorium in the Coerthas central highlands. Once you arrive, lay a bouquet of Nymeia lilies at the specified location.","You have honored the fallen with a bouquet of lilies. Speak with Jehantel and learn how the old bard fares.","Faced with the prospect of losing another dear companion, Jehantel finds himself once more able to draw back his bow. And after long years of regret and crushing guilt, the bard is finally able to sing a requiem for his fallen comrades. Thanks to your inspiring presence, Jehantel has decided to lend what aid he may to the Gods' Quiver, and live fully the years that remain to him.<br><br>※The next bard quest will be available from Jehantel once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Lay the bouquet of Nymeia lilies at the specified location in the Coerthas central highlands.","Speak with Jehantel.","Defeat the Ixal and their wolves!"],"dialogue":[{"name":"JEHANTEL","text":"You have done well, my young apprentice. In returning with the choral attire, you have reaffirmed my faith in you."},{"name":"JEHANTEL","text":"I see no further reason to withhold from you the existence of the final piece in the set...the piece that has brought us together."},{"name":"JEHANTEL","text":"Listen well, <span class=\"highlight\">Forename</span>. When I put down my bow, I vowed never again to set foot in the Twelveswood. That I now forsake my oath is for no other reason than to impart my knowledge to one who would succeed me."},{"name":"JEHANTEL","text":"Lest you wonder why I should deem that so important, permit me to relate to you an event which brought about a great change in me."},{"name":"JEHANTEL","text":"My most recent journey had taken me to Ul'dah, where I found myself ambling through the marketplace early one morn."},{"name":"JEHANTEL","text":"Browsing the wares on display, mine eyes were met with a relic from my past: a piece from the choral attire that I had discarded decades before, countless malms away."},{"name":"JEHANTEL","text":"I felt at once that it was not mere chance that had reunited me with it, and put forth the coin with nary a pause. Holding the garment in my hands, I resolved to find a worthy heir to my legacy."},{"name":"JEHANTEL","text":"Alas, no sooner had I arrived in the Twelveswood than I found myself mobbed by archers seeking to hone their skills. Amongst those who came, not a one showed the least interest in poetry and verse."},{"name":"JEHANTEL","text":"Sorely discouraged and regretting my decision, I made to strike camp and leave the Twelveswood once more, never to return."},{"name":"JEHANTEL","text":"It was then that you appeared, young one."},{"name":"JEHANTEL","text":"When you expressed your desire to learn song, I could scarce contain my joy."},{"name":"JEHANTEL","text":"Looking back, I am fully convinced that our meeting had been preordained."},{"name":"JEHANTEL","text":"Your coming has instilled me with the courage to attend that matter of which I spoke earlier. I am ready─ready to make a pilgrimage to the scene of my regiment's demise."},{"name":"JEHANTEL","text":"Ever since that fateful day, I have been haunted by visions of my fallen comrades, torment graven upon their bloodied faces."},{"name":"JEHANTEL","text":"Lost to hope but too craven to end my own life, I wandered the land aimlessly, seeking a place to die. But the heavens denied me even that."},{"name":"JEHANTEL","text":"Yet just when it seemed that despair would draw me wholly into its black abyss, never to emerge again, a melody resounded within me."},{"name":"JEHANTEL","text":"It was then that I awakened to the power of song and found new purpose in life."},{"name":"JEHANTEL","text":"I embarked upon a journey to master such verses as would bestow peace upon the fallen, that I might lay the tortured souls of my comrades to rest."},{"name":"JEHANTEL","text":"It has taken long years, but now I believe I can offer a requiem worthy of my comrades. To do so, however, I require one last favor of you, <span class=\"highlight\">Forename</span>."},{"name":"JEHANTEL","text":"I would have you escort me to the west of the Observatorium, in the Coerthas central highlands."},{"name":"JEHANTEL","text":"It is there that we shall find the scene of my regiment's demise."},{"name":"JEHANTEL","text":"Your presence kindles within me a courage I had thought lost. I would have none other by my side as I undertake this pilgrimage─now, as I enter the most daunting stage of my life."},{"name":"JEHANTEL","text":"Once you arrive, I ask that you pay your respects with another bouquet of Nymeia lilies. When my requiem is sung, you shall have the final piece of the choral attire."},{"name":"JEHANTEL","text":"Heed me, O Puissant Althyk! Reverse Thee the dance of the stars athwart the night sky, that we might ease the suffering of souls long departed!"},{"name":"JEHANTEL","text":"We are surrounded! And our foes seem disinclined to listen to parley."},{"name":"JEHANTEL","text":"You must survive this, <span class=\"highlight\">Forename</span>! My soul is overburdened with the deaths of too many dear companions."},{"name":"JEHANTEL","text":"<span class=\"highlight\">Forename</span>. Without you, I would not be standing here this day. I thank you from the bottom of my heart."},{"name":"JEHANTEL","text":"Forgive me, my friends. I have kept you waiting overlong."},{"name":"JEHANTEL","text":"The Keeper be praised... I...I can wield a bow once more..."},{"name":"JEHANTEL","text":"It was you, young one, who helped me to remember how."},{"name":"JEHANTEL","text":"I had known this for some time, but your presence is as a salve for the wounds of my soul. Your coming has delivered me from the nightmares of my past."},{"name":"JEHANTEL","text":"My worthy successor. To you I entrust the final piece of the choral attire. Don it, and go forth to fill the hearts of men with courage and purpose."},{"name":"JEHANTEL","text":"Though the seasons may turn, bending a man's back and dimming his eye, so long as there is life, there is reason to hope. Thank you, <span class=\"highlight\">Forename</span>, for showing me the truth of this."},{"name":"JEHANTEL","text":"With the blood of my comrades upon my hands, to simply draw breath racked me with such guilt as I could not bear. But the time for mourning is past."},{"name":"JEHANTEL","text":"I shall take up the bow once more and lend what aid I can to the Gods' Quiver. In fighting for those who yet live, I do my fallen comrades the greatest honor."},{"name":"JEHANTEL","text":"Yet another melody resounds within you, I see. Then there is naught more I can impart to you. As equals, let us together give praise to life and all the joy that it brings!"},{"name":"JEHANTEL","text":"Heed me, O Puissant Althyk! Turn Thee over the hourglass of time, that we might exult in the glory of all creation!"},{"name":"JEHANTEL","text":"In Thine exalted name we sing, that the living may savor life and the departed know true peace!"},{"name":"JEHANTEL","text":"I thank you again, <span class=\"highlight\">Forename</span>. You have blessed this old fool with the gentle touch of salvation."},{"name":"JEHANTEL","text":"Eorzea awaits! Go forth now, and inspire endless hope and courage with the beauty of your songs. May we one day meet again."},{"name":"SYSTEM","text":"This concludes the bard quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next bard quest will be available from Jehantel."},{"name":"QIB","text":"My bow... I cannot..."},{"name":"QIB","text":"Does cruel fate seek to stain my hands once more?"},{"name":"QIB","text":"Have I not drank deep enough of bitter regret?"},{"name":"QIB","text":"I shall aid you as best I can."},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>! To my side!"},{"name":"QIB","text":"No more lives will be lost to my folly!<br>May my songs envelop and protect you!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>! You must not fall!<br>Hear my song, and be invigorated!"},{"name":"QIB","text":"Mayhap in the sleep of death I shall know peace..."}],"reward":{"action":118,"items":[{"id":3224},{"id":20646}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":24}],"quests":[66625]},"next":[66661,67249]},"partials":[{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"npc","id":"1007891","obj":{"i":1007891,"n":"Jehantel","l":63,"q":1}},{"type":"action","id":"118","obj":{"i":118,"n":"Battle Voice","c":2601,"j":23,"t":4,"l":50}},{"type":"item","id":"3224","obj":{"i":3224,"n":"Choral Shirt","l":55,"c":43090,"t":35,"p":1000}},{"type":"item","id":"20646","obj":{"i":20646,"n":"Bard's Attire Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66625","obj":{"i":66625,"n":"Pieces of the Past","g":151,"l":"South Shroud","s":5,"f":1}},{"type":"quest","id":"66661","obj":{"i":66661,"n":"A Relic Reborn (Artemis Bow)","g":151,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67249","obj":{"i":67249,"n":"On the Road Again","g":151,"l":"South Shroud","s":500,"f":1}}]}