{"quest":{"name":"Austerities of Earth","location":"Gridania","id":66628,"patch":2.0,"sort":2,"icon":100108,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1006787],"genre":155,"journal":["Y'mhitra, the researcher at Apkallu Falls, wishes you to proceed with the next summoning ritual.","You have chosen to perform the Austerities of Earth. Speak with Y'mhitra southwest of Alder Springs in the North Shroud to begin the ritual, and attempt to bind a new egi to your will.","After following Y'mhitra's instructions, you summon and defeat the entity known as Titan-Egi. However, before you are able to celebrate, you find yourself under assault by a man who also appears to be a summoner. Though you manage to force the stranger to retreat, you are left bewildered by the unprovoked attack. Speak with Y'mhitra to see how she is faring in the aftermath.","You have spoken to Y'mhitra and confirmed that she is sound of body. Return with her to Apkallu Falls in Gridania to discuss the encounter further.","Y'mhitra, still somewhat shaken, wonders what could have motivated the haughty stranger's sudden attack. The researcher suggests that you spend some time exploring the capabilities of your new egi ally while she makes use of the Sons' resources to investigate the identity of the murderous summoner.<br><br>※The next summoner quest will be available from Y'mhitra upon reaching level 40."],"objectives":["Speak with Y'mhitra to the southwest of Alder Springs.","Speak with Y'mhitra.","Speak with Y'mhitra at Apkallu Falls.","Defeat Titan-Egi!","Defeat the dark summoner!"],"dialogue":[{"name":"YMHITRA","text":"By all accounts, the primal Titan is a dire threat to the people of Limsa Lominsa. If you would face the Lord of Crags and continue with our historic research, then you must travel to the maritime nation and join a primal-hunting expedition."},{"name":"YMHITRA","text":"There is little point in beginning the Austerities of Earth until you have bathed in the aether released upon Titan's defeat."},{"name":"SYSTEM","text":"The next summoner quest will be available from Y'mhitra upon the successful defeat of the primal Titan."},{"name":"YMHITRA","text":"Titan's essence infuses your aura, <span class=\"highlight\">Forename</span>. I foresee no further obstacles preventing us from attempting the next ritual."},{"name":"YMHITRA","text":"Shall we proceed with the Austerities of Earth? I have every confidence that you will succeed in binding Titan-Egi to your will."},{"name":"YMHITRA","text":"According to my research, the most suitable location for the ritual is a place found to the southwest of Alder Springs in the North Shroud. A heretofore buried layer of ancient rock exposed by the violent upheavals of the Calamity has lent the surrounding area an overwhelming earthen aspect."},{"name":"YMHITRA","text":"The conditions will be perfect. I will await you at our destination, <span class=\"highlight\">Forename</span>."},{"name":"YMHITRA","text":"The ritual you are about to perform is, essentially, no different from the Austerities of Flame."},{"name":"YMHITRA","text":"Instead of fire, however, you will be concentrating on shifting your aetheric balance towards the spectrum of earth. Once you have achieved the required state of earthen affinity, the primal's captured essence will tumble forth and coalesce into the stony form of Titan-Egi."},{"name":"YMHITRA","text":"As before, you must demonstrate unflinching authority if you would convince the newborn avatar to heed your commands. Let us begin!"},{"name":"YMHITRA","text":"Oh, well done, <span class=\"highlight\">Forename</span>!"},{"name":"TRISTAN","text":"(-???-)I come in search of Allagan relics, and what do I find but a pair of incompetent dabblers. By what jest of fate did you chance across such undeserved power?"},{"name":"YMHITRA","text":"And who might you be, sir, to so boldly question our accomplishments?"},{"name":"TRISTAN","text":"(-???-)If you have, indeed, unlocked the secrets of summoning, then you must be in possession of the very treasure I seek."},{"name":"TRISTAN","text":"(-???-)How terribly convenient. I need only slay you both and take what I need from your bloody corpses."},{"name":"YMHITRA","text":"Gods below! A summoner!? But how!?"},{"name":"TRISTAN","text":"(-Dark Summoner-)Cease your infantile prattle! The continuation of my divine work far outweighs the worth of your pitiful lives!"},{"name":"TRISTAN","text":"(-Dark Summoner-)Why do you struggle so?"},{"name":"TRISTAN","text":"(-Dark Summoner-)Your unwillingness to accept oblivion but delays the inevitable!"},{"name":"TRISTAN","text":"(-Dark Summoner-)Heed me, avatar of infernal flame! Incinerate these fools in all-consuming hellfire!"},{"name":"TRISTAN","text":"(-Dark Summoner-)What!?"},{"name":"YMHITRA","text":"Feel nature's fury, you vile blackguard!"},{"name":"TRISTAN","text":"(-Dark Summoner-)&lt;grunt&gt; I tire of this childish game. Thank your gods for granting you another day of miserable existence!"},{"name":"YMHITRA","text":"He's gone... What a decidedly unpleasant fellow."},{"name":"YMHITRA","text":"Well, I suggest we return to Apkallu Falls─I have no desire to linger here and chance another encounter with...whomever that deranged mage was. "},{"name":"YMHITRA","text":"I must say, I did not expect to meet another practitioner of the summoning arts."},{"name":"YMHITRA","text":"And I also did not expect to be suddenly fighting for my life. What precious treasure do we carry that this callous stranger was so willing to kill us to possess it?"},{"name":"YMHITRA","text":"Such mysteries aside, I am most glad you were able to secure Titan-Egi before the summoner decided to unleash his fiery avatar. Without its protection, I doubt we would have survived that conflagration."},{"name":"YMHITRA","text":"The egi of earth─as was so aptly demonstrated─is not a force to be trifled with. You should certainly take the time to explore its capabilities, as well as its limitations. Be careful, however, not to neglect other magicks at your disposal."},{"name":"YMHITRA","text":"Meanwhile, I shall confer with my colleagues in the Sons of Saint Coinach, and see what I might learn of that hostile summoner. We shall meet anon."},{"name":"QIB","text":"The mere presence of this egi is suffocating.<br>It is as if the weight of a mountain presses upon my chest!"},{"name":"QIB","text":"The entity has summoned allies of earth!"},{"name":"QIB","text":"The aetheric flow...it shakes the very ground."},{"name":"QIB","text":"How fortunate to die by my hand!<br>Naught but ash shall remain of your wretchedness!"},{"name":"QIB","text":"Defend yourself, <span class=\"highlight\">Forename</span>!<br>His words are no empty threat!"},{"name":"QIB","text":"You think to stand against me?<br>Foolish bravado. You will burn nonetheless."},{"name":"QIB","text":"Be on your guard!<br>His power is building!"},{"name":"QIB","text":"...How can this be?"},{"name":"QIB","text":"The art of summoning was lost...<br>I should have known if there were others..."}],"reward":{"action":25806,"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":28}],"instances":[20002],"quests":[66627]},"next":[66629]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006787","obj":{"i":1006787,"n":"Y'mhitra","l":57,"q":1}},{"type":"action","id":"25806","obj":{"i":25806,"n":"Summon Titan","c":2755,"j":27,"t":2,"l":35}},{"type":"instance","id":"20002","obj":{"i":20002,"n":"The Navel","c":61804,"t":"Trials","min_lvl":34,"max_lvl":36}},{"type":"quest","id":"66627","obj":{"i":66627,"n":"Austerities of Flame","g":155,"l":"Limsa Lominsa","s":1,"f":1}},{"type":"quest","id":"66629","obj":{"i":66629,"n":"Shadowing the Summoner","g":155,"l":"Gridania","s":3,"f":1}}]}