{"quest":{"name":"Pieces of the Past","location":"South Shroud","id":66625,"patch":2.0,"sort":5,"icon":100103,"unlocksFunction":1,"eventIcon":71341,"issuer":1006750,"target":1006750,"genre":151,"usedItems":[3462,3686,3893,2901],"journal":["Jehantel has a request for you.","The bard known as the Godsbow has bid you gather the four parts of the choral attire. Search the sacks at Halfstone in western La Noscea, Urth's Gift in the South Shroud, Raubahn's Push in northern Thanalan, and the Goldleaf Dais in the East Shroud.","You have gathered the four parts of the choral attire. Return to Jehantel's camp west of Quarrymill in the South Shroud.","You have returned to Jehantel bearing the garments he once surrendered to fate. Now fully convinced of your destiny to don the choral attire, it appears that the bard has come to a decision. He asks for time to make certain preparations, and sends you away to focus on your training<br><br>※The next bard quest will be available from Jehantel upon reaching level 50."],"objectives":["Find choral attire at Halfstone.","Find choral attire at Urth's Gift.","Find choral attire at Raubahn's Push.","Find choral attire at the Goldleaf Dais.","Return to Jehantel at his camp west of Quarrymill."],"dialogue":[{"name":"JEHANTEL","text":"You will listen to my request though you know me for the vainglorious fool I am? I am humbled."},{"name":"JEHANTEL","text":"The boon I ask of you is simple: I would have you sing for me."},{"name":"Q1","text":"Will you sing for Jehantel?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"JEHANTEL","text":"A heartfelt performance, masterfully delivered. You have come far in such a short time, my young apprentice."},{"name":"JEHANTEL","text":"Hearing your song this day, I am convinced that you are well on your way to surpassing me, as bard and archer both. Soon there will be naught left for me to impart to you."},{"name":"JEHANTEL","text":"<span class=\"highlight\">Forename</span>. You have proven yourself worthy of the consecrated garments worn by the true bards of old to honor the Keeper. I speak of the choral attire."},{"name":"JEHANTEL","text":"The attire was entrusted to me when Pukno Poki and I first met, deep within the Twelveswood. The moogle and I had traded scarce more than a handful of words when he proffered to me the attire along with the Soul of the Bard."},{"name":"JEHANTEL","text":"At that time, I knew not the true power of song, and so declined the gifts...but Pukno Poki would not be denied. For all his good humor, the moogle can be as unmoving as a rock. “The attire chooses the wearer, not the other way 'round,” he insisted, and I found myself yielding to his will."},{"name":"JEHANTEL","text":"In mastering the verses of war, I won acclaim beyond my wildest dreams upon the field of battle, and for a time I was well pleased."},{"name":"JEHANTEL","text":"Alas, my lust for glory knew no bounds, the consequence of which you are already aware. It was in the wake of the Massacre of Griffin Crossing. Stricken with guilt, I wanted naught more than the earth to open up to swallow me whole. I had lost the will to live, aye, but I was too craven to end it myself."},{"name":"JEHANTEL","text":"And so I took to wandering aimlessly, in search of a place to die, far away from the judging eyes of men."},{"name":"JEHANTEL","text":"Disillusioned with the power of song, I committed an act of folly: I scattered the choral attire across the realm. “If truly the attire chooses its wearer,” I challenged, “then let it find its way back to me.”"},{"name":"JEHANTEL","text":"Determined that I would not be proven wrong, I went to great pains to ensure that the attire would never again see the light of day, and the pieces now rest in places of peril. Being the proud fool that I was, it never crossed my mind that mayhap another was meant to don it."},{"name":"JEHANTEL","text":"I would entrust the choral attire to you, <span class=\"highlight\">Forename</span>. But as you can see, you must needs brave the dangers to claim it. I shall mark its whereabouts on your map, but I can afford you no further aid beyond that."},{"name":"JEHANTEL","text":"I am deeply sorry that my folly of years past has entailed this burden upon you. But Althyk works in mysterious ways─in His wisdom, it may be that He has sent this trial to test your spirit."},{"name":"JEHANTEL","text":"I mean not for my sentiments to encumber you, but I am convinced that you are the one chosen by the choral attire."},{"name":"JEHANTEL","text":"But pray do not take that as license for complacency. Trials wouldn't be called such if they failed to tax one's ability. Stay ever on your toes, <span class=\"highlight\">Forename</span>. I would have you return whole of body, and bearing the four parts of my surrendered raiment."},{"name":"JEHANTEL","text":"Heed me, O Puissant Althyk! Reverse Thee the seasons' turning, that we might gaze upon the battles of yore!"},{"name":"JEHANTEL","text":"So, you have returned─sound of body and mind, I trust? And you bear the four parts of the choral attire!"},{"name":"JEHANTEL","text":"I knew you for the true owner of these garments ere I heard your song. Since the day we met, your determination has reminded me of much that I have lost...and would have again."},{"name":"JEHANTEL","text":"I have at last settled my heart on a matter that has plagued me for some decades. When my preparations are complete, you shall know of my decision. Until then, may your song lift the spirits of your allies, and your arrows seek the hearts of your foes."}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":24}],"quests":[66624]},"next":[66626]},"partials":[{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"item","id":"3462","obj":{"i":3462,"n":"Choral Tights","l":50,"c":45191,"t":36,"p":1000}},{"type":"item","id":"3686","obj":{"i":3686,"n":"Choral Ringbands","l":50,"c":48243,"t":37,"p":1000}},{"type":"item","id":"3893","obj":{"i":3893,"n":"Choral Sandals","l":50,"c":46221,"t":38,"p":1000}},{"type":"item","id":"2901","obj":{"i":2901,"n":"Choral Chapeau","l":50,"c":41135,"t":34,"p":1000}},{"type":"quest","id":"66624","obj":{"i":66624,"n":"Doing It the Bard Way","g":151,"l":"South Shroud","s":4,"f":1}},{"type":"quest","id":"66626","obj":{"i":66626,"n":"Requiem for the Fallen","g":151,"l":"South Shroud","s":6,"f":1}}]}