{"quest":{"name":"Bard's-eye View","location":"South Shroud","id":66623,"patch":2.0,"sort":3,"icon":100103,"unlocksFunction":1,"eventIcon":71341,"issuer":1006750,"target":1006750,"genre":151,"journal":["Jehantel would help you to learn yet another melody of the bard.","You have learned from Jehantel a method for acquiring a new melody. Travel to Wellwick Wood in eastern Thanalan, and wait at the specified destination. Slay the aldgoats that appear and liberate them from their grief.","You have slain the aldgoats and felt the echoes of their sadness resonate within your soul. Return to the South Shroud and report to Jehantel at his camp west of Quarrymill.","You have reported your success to Jehantel. The bard approves of your new understanding of anguish, and declares you almost ready to hear the Ballad of the Vainglorious Fool. First, however, you must train your body to match the ever-growing resilience of your heart.<br><br>※The next bard quest will be available from Jehantel upon reaching level 45."],"objectives":["Defeat the aldgoats of Wellwick Wood.","Report to Jehantel at his camp west of Quarrymill."],"dialogue":[{"name":"JEHANTEL","text":"'Tis good to see you return, <span class=\"highlight\">Forename</span>, and more seasoned still for your time in the world. Call me a spoony bard, but as a man in the winter of his years, it gives me great joy to observe an adventurer in the spring of <span class=\"alternative-container\"><span class=\"alternative\">hers</span><span class=\"alternative\">his</span></span>."},{"name":"JEHANTEL","text":"This is an odd time for recollection, but it was a spring day when a bard first came to my hometown. He played the most sorrowful chords, even as his words tantalized the ear like the breath of one's first love. Many a maiden's heart was stolen during his visit...and doubtless more besides."},{"name":"JEHANTEL","text":"<span class=\"highlight\">Forename</span>. Would you believe that common bards, too, were born of archers? This may seem far-fetched upon first hearing, but it isn't so far a stretch."},{"name":"JEHANTEL","text":"Ask yourself this: what becomes of soldiers when conflict gives way to peacetime? Some have lives they might return to, aye, but most must needs take up a new trade to make ends meet. Well, it so happened that many who had once bent the bow took to strumming the harp."},{"name":"JEHANTEL","text":"They wandered the realm, singing passionately and earnestly of the war as seen through their own eyes─of sweet victories and bitter defeats, of sacrifice and cowardice. Their songs so captured the imagination of the people, nary a day passed that a bard was not called to perform, be it in a humble tavern or some great lord's hall."},{"name":"JEHANTEL","text":"Alas, their popularity proved their downfall. Intoxicated by the attentions of the masses, the bards took to embellishing their songs in a bid to outdo one another."},{"name":"JEHANTEL","text":"And over time, each song was shorn of verity, till the bard's repertoire contained not one shred of truth."},{"name":"JEHANTEL","text":"By now you will know that such songs have no purchase upon men's hearts. Certainly, a bawdy tune may set off fits of laughter in a sailor, and a sorrowful ballad summon tears from the eyes of a soft-hearted maiden. Yet these are but pale shadows of what songs can achieve."},{"name":"JEHANTEL","text":"For a blessing, this decline did not escape the notice of the moogles. As great patrons of the arts, they feared that the true power of song might be lost to mankind."},{"name":"JEHANTEL","text":"So it was that they labored to gather and safeguard those crystals known as Souls of the Bard, that they might be bestowed upon worthy men and women."},{"name":"JEHANTEL","text":"Now, well as I know you relish listening to my sermons, I daresay it's past time we moved on to the practical side of the lesson. I know I have mentioned this previously, but tell me, are you perchance familiar with the Ballad of the Vainglorious Fool?"},{"name":"JEHANTEL","text":"Nay? Well, that won't do at all. We must remedy this posthaste."},{"name":"JEHANTEL","text":"The song recounts the Massacre of Griffin Crossing, a battle that took place decades past, wherein countless Gridanian lives came to a premature end."},{"name":"JEHANTEL","text":"Ah, but do forgive me─I seem to have mistaken the proper order of things. Before I begin, I must be convinced that the point of the tale will not be lost upon you. Elsewise I will have wasted my breath in the telling of it."},{"name":"JEHANTEL","text":"Now, heed well these instructions. You must make your way to Wellwick Wood, where resides a mated pair of aldgoats that have but recently lost a kid. The pair has been driven mad with grief, and only death will put an end to the uncontrolled rampages."},{"name":"JEHANTEL","text":"Linger in their territory until you encounter the beasts, then let fly your arrows of mercy. As you liberate them from their sorrow, so too shall your soul resonate with the echoes of poignant melody."},{"name":"JEHANTEL","text":"Welcome back, <span class=\"highlight\">Forename</span>. I can almost hear the cries of mourning that have seared themselves into your soul. That you remain unbowed by such anguish is a testament to your spirit's fortitude."},{"name":"JEHANTEL","text":"Yet even as your heart swells to contain these new experiences, you must not neglect your skills with the bow."},{"name":"JEHANTEL","text":"A resilient heart must needs have a robust body in which to beat. Once you have trained both to equal strength, then shall I perform for you the Ballad of the Vainglorious Fool."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"action":116,"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":24}],"quests":[66622]},"next":[66624]},"partials":[{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"action","id":"116","obj":{"i":116,"n":"Army's Paeon","c":2603,"j":23,"t":4,"l":40}},{"type":"quest","id":"66622","obj":{"i":66622,"n":"The Archer's Anthem","g":151,"l":"South Shroud","s":2,"f":1}},{"type":"quest","id":"66624","obj":{"i":66624,"n":"Doing It the Bard Way","g":151,"l":"South Shroud","s":4,"f":1}}]}