{"quest":{"name":"Primal Burdens","location":"Gridania","id":66632,"patch":2.0,"sort":6,"icon":100108,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1006793,1006794,1006795],"genre":155,"journal":["Y'mhitra has some terrible news to tell you.","Shocked and dismayed, Y'mhitra tells you of the sudden attack that took the lives of several researchers at Saint Coinach's Find. Speak with a survivor at the dig site, and confirm your suspicions that Tristan was behind the brutal murders.","You have spoken with a survivor of the attack, and learned that Tristan struck down the excavation team and took an Allagan soul crystal into his possession. Confer with Y'mhitra, and plan your next move.","After hearing Y'mhitra's thoughts on Tristan's bloody motivations, you resolve to chase down the cold-blooded summoner and wring some answers from the man himself. Search the Singing Shards for Tristan, and confront him with his crimes.","You locate the power-hungry murderer, and best him in a climactic battle in which Tristan brings to bear the might of an elder primal. Speak with Y'mhitra, and discuss the aftermath of the conflict.","The weary researcher laments the path that drove Tristan to madness, and wonders if, had he chosen differently, he would have proven a potential ally. Y'mhitra warns you to remain wary of power's corrupting influence, and suggests you both return to Apkallu Falls to recover from the ordeal.","Though the dark summoner that wreaked such havoc is no more, Y'mhitra bids you to maintain vigilance against the shadowy Ascians' destructive machinations. As a symbol of gratitude from the researchers of Saint Coinach's Find, you receive the final piece of the evoker's attire. And to further prepare you for the inevitable conflict with the Paragons, Y'mhitra opens your mind to the powerful technique known as Enkindle─an ability that allows you to unlock the true might of your egi.<br><br>※The next summoner quest will be available from Y'mhitra once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with the surviving researcher at Saint Coinach's Find.","Speak with Y'mhitra.","Confront Tristan.","Speak with Y'mhitra.","Speak with Y'mhitra at Apkallu Falls.","Defeat Tristan!"],"dialogue":[{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>, there has been a terrible incident!"},{"name":"YMHITRA","text":"My poor colleagues at Saint Coinach's Find...murdered. The reports are confused, but they all mention the same black-robed attacker."},{"name":"YMHITRA","text":"You know as well as I do that Tristan is behind this massacre. He has indeed grown bold─or desperate─to commit such a brazen act."},{"name":"YMHITRA","text":"We should set off to Mor Dhona at once and speak with any survivors."},{"name":"YMHITRA","text":"It may be that we can glean some idea of what that cold-hearted monster was after, or where he might strike next. We must stop him, <span class=\"highlight\">Forename</span>!"},{"name":"SEEKER500","text":"Yes. Yes, I am absolutely certain. It was the same dark summoner whom Y'mhitra described to us."},{"name":"SEEKER500","text":"We were celebrating a recent find─the soul crystal of an Allagan summoner─when a man in black robes suddenly appeared and demanded we surrender the gem."},{"name":"SEEKER500","text":"Naturally, we objected to this arrogant imposition, but he simply sneered at our refusal. The next moment the world exploded into flame. Through a haze of agony, I saw him snatch up the soul crystal from a smoldering body and stride off towards the Singing Shards."},{"name":"SEEKER500","text":"That bastard slaughtered my friends! There was no warning...no negotiation... If the gods grant you the chance to exact vengeance, then I pray you show him the same mercy he afforded us..."},{"name":"YMHITRA","text":"Though the necessity pains me, we must ask this man what he remembers of the attack. Tristan cannot be allowed to escape the consequences of his unrepentant savagery."},{"name":"YMHITRA","text":"Another soul crystal... Yes, it makes sense that he would shift his attention to a more easily obtainable gem. After all your progress, you would now make for a most formidable opponent."},{"name":"YMHITRA","text":"Ah, I must apologize for not sharing my theory earlier─I suspected that Tristan might desire the soul crystal you carry, but did not wish to draw any premature conclusions without sufficient evidence."},{"name":"YMHITRA","text":"I am at a loss, however, to explain why he seeks to collect more of these Allagan relics."},{"name":"YMHITRA","text":"We shall just have to ask the villain himself after we corner him in the Singing Shards. Let us be on our way!"},{"name":"TRISTAN","text":"I have brought you the soul crystals, as promised."},{"name":"ASCIANS","text":"Hmmm... Yes, these appear to be authentic Allagan artifacts."},{"name":"ASCIANS","text":"Very well. I shall honor our bargain. From within these gems I will draw forth the memories of the ancient summoners...and the slumbering essence of an elder primal. All the attendant knowledge and power shall be yours."},{"name":"TRISTAN","text":"Aaargh!"},{"name":"TRISTAN","text":"&lt;pant&gt; &lt;pant&gt; &lt;pant&gt; Oh gods, the pain... Hm hm hm... Mwahahaha!"},{"name":"TRISTAN","text":"Ah, the bumbling summoner and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> incompetent lackey make an appearance at last. You think to capture me? Fools. I have orchestrated your every move."},{"name":"TRISTAN","text":"You have grown much in the art, it is true. But through the wisdom of the Paragons, I now command the power of an elder primal."},{"name":"YMHITRA","text":"You made a deal with the Paragons!? And you call <span class=\"emphasis\">us</span> fools! The Ascians will never relinquish their hold on you!"},{"name":"TRISTAN","text":"A small price to pay. If you could but <span class=\"emphasis\">feel</span> the strength that fills my entire being! It is indescribable!"},{"name":"TRISTAN","text":"I will use this power to annihilate the beast tribes, and put an end to their insufferable rituals once and for all! The primals will rise no more!"},{"name":"TRISTAN","text":"Hear me, Demon King of Devouring Flame! Feed on my ever-burning anguish and be reborn!"},{"name":"TRISTAN","text":"The culmination of my sacred duty is at hand!"},{"name":"TRISTAN","text":"But first... There is one more soul crystal that must be mine. I will tolerate its wasted potential no longer!"},{"name":"TRISTAN","text":"By all the memories of summoners past... I should have been unstoppable..."},{"name":"TRISTAN","text":"I <span class=\"emphasis\">will</span> sear the disease of beastmen from the face of the land! Deprived of worshipers, the primal that tempered my weak-willed sibling will wither into oblivion!"},{"name":"YMHITRA","text":"So, I see my order's records were accurate."},{"name":"YMHITRA","text":"Though it was buried deep in the archives, I but recently uncovered a report that described how you slew your own brother. He was corrupted during your ill-fated encounter with Ifrit, was he not? I imagine your superiors in the Immortal Flames thought it a mercy to conceal that inglorious detail."},{"name":"TRISTAN","text":"Once the soft-headed fool had been tempered, there was no saving him... And thus I took it upon myself to expunge the stain of embarrassment."},{"name":"TRISTAN","text":"But my work is left undone! The primal─ No, <span class=\"emphasis\">all</span> primals must suffer for that insult! After I killed my brother, I found myself liberated, my vision clear. No deed was too vile if it promised to add to the power I required."},{"name":"TRISTAN","text":"How can you not see!? I am the sword of vengeance! And I shall wrest that soul crystal from your blasted corpse!"},{"name":"YMHITRA","text":"I wonder which struck the first blow to his sanity: the despair at his brother's tempering, or the guilt from slaying his own kin?"},{"name":"YMHITRA","text":"It is ironic to think that, discounting the means, our purposes were fundamentally one and the same. A summoner employs the savagery of the primals to conquer the primals themselves."},{"name":"YMHITRA","text":"Had Tristan approached us as an ally, we might have found ourselves aiding his cause. Alas, he chose to walk the path of bloodshed."},{"name":"YMHITRA","text":"Each vicious act must have pushed the man deeper into madness until, eventually, the lust for power and vengeance was all that drove him."},{"name":"YMHITRA","text":"The might of the primals carries with it a burden of responsibility─and a measure of danger."},{"name":"YMHITRA","text":"I hope never to see you corrupted by the potent energies you wield, <span class=\"highlight\">Forename</span>."},{"name":"YMHITRA","text":"It is time we returned to Apkallu Falls. The dark summoner is no more."},{"name":"YMHITRA","text":"Oh, how I would love to declare our troubles at an end. But I fear the Ascian with whom Tristan made his bargain is yet afoot."},{"name":"YMHITRA","text":"These so-called Paragons prey upon men and women who are at their weakest, speaking honeyed words to lead them down the road to destruction. In this manner, they seek to plunge the realm of Eorzea into chaos."},{"name":"YMHITRA","text":"It is reassuring to know that heroes like you exist to foil their never-ending schemes and foul plots."},{"name":"YMHITRA","text":"An outright war against the Ascians looms closer day by day. Thus, would I have you armor yourself with this last piece of the evoker's attire."},{"name":"YMHITRA","text":"It was discovered at the same dig site whence Tristan seized the soul crystal, and the Saint Coinach's Find researchers, grateful for your actions in bringing the murderous summoner to justice, insisted that you complete your set."},{"name":"YMHITRA","text":"One can never be over-prepared when heading into battle against a Paragon. Wear it proudly, <span class=\"highlight\">Forename</span>."},{"name":"YMHITRA","text":"Speaking of preparations... Were you aware of the deeper layer of power hidden within your avatars?"},{"name":"YMHITRA","text":"A technique exists that allows you to tap into the full potential of your egi. You must have seen Tristan employing this ability."},{"name":"YMHITRA","text":"During the final battle with the dark summoner, you would have heard a whisper emanating from the soul crystal."},{"name":"YMHITRA","text":"Still your mind now, <span class=\"highlight\">Forename</span>, and you will hear the voices of the ancient summoners instructing you in their greatest achievement. The true power of the egi will be yours!"},{"name":"SYSTEM","text":"This concludes the summoner quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next summoner quest will be available from Y'mhitra."},{"name":"QIB","text":"Behold the might of Belias!"},{"name":"QIB","text":"I have never before sensed such power...<br>All the more reason to defeat this madman!"},{"name":"QIB","text":"No...it is not enough!<br>Belias! I must have it all!"},{"name":"QIB","text":"Aaah!<br>The tendrils of Darkness...I feel them!"},{"name":"QIB","text":"None can withstand this tenebrous aether!"},{"name":"QIB","text":"I didn't think it possible...<br>He's absorbed the egi's power!"},{"name":"QIB","text":"Hehe... Bwahahaha!<br>The power! I am a god amongst men!"},{"name":"QIB","text":"My dear colleagues...I have failed you.<br>Forgive me, <span class=\"highlight\">Forename</span>..."}],"reward":{"items":[{"id":3227},{"id":20650}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":28}],"quests":[66631]},"next":[66662,67636,67896]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006793","obj":{"i":1006793,"n":"Surviving Researcher","l":67,"q":1}},{"type":"npc","id":"1006794","obj":{"i":1006794,"n":"Y'mhitra","l":67,"q":1}},{"type":"npc","id":"1006795","obj":{"i":1006795,"n":"Y'mhitra","l":67,"q":1}},{"type":"item","id":"3227","obj":{"i":3227,"n":"Evoker's Doublet","l":55,"c":42330,"t":35,"p":1000}},{"type":"item","id":"20650","obj":{"i":20650,"n":"Summoner's Attire Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66631","obj":{"i":66631,"n":"Austerities of Wind","g":155,"l":"Gridania","s":5,"f":1}},{"type":"quest","id":"66662","obj":{"i":66662,"n":"A Relic Reborn (The Veil of Wiyu)","g":155,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67636","obj":{"i":67636,"n":"A Fitting Tomestone","g":155,"l":"Gridania","s":500,"f":1}},{"type":"quest","id":"67896","obj":{"i":67896,"n":"An Egi by Any Other Name","g":91,"l":"Limsa Lominsa","s":520,"f":1}}]}