{"quest":{"name":"For Your Fellow Man","location":"Limsa Lominsa","id":66637,"patch":2.0,"sort":5,"icon":100107,"unlocksFunction":1,"eventIcon":71341,"issuer":1006757,"target":1006757,"involved":[1006332,1007840,1007841,1007842,1007843,1007844],"genre":156,"journal":["Alka Zolka wishes to propose another way you might rekindle your faerie's memories.","Much of what Alka Zolka has learned of scholars pertains to their roles in the Nymian military. However, his most recent translations offer insight into their activities during times of peace. Apparently, scholars would use their talents to help the sick and infirm, and they were even instrumental in combating a virulent plague which once threatened to engulf all of Nym. For these reasons, Alka Zolka believes that tending to the patients recuperating at Camp Bronze Lake might rekindle the memories of your faerie. Journey to the Warmwine Sanitorium in upper La Noscea and offer your services to Rukusa Farusa.","Rukusa Farusa is happy to accept your assistance, and tells you of five patients suffering from a variety of lingering conditions. Rather than treat their symptoms with restorative magicks, he implores you to address the underlying cause by <span class=\"emphasis\">leeching</span> the impurities from their bodies.","As instructed, you worked your scholarly magicks on each patient to varying degrees of efficacy. Inform Rukusa Farusa that your work is complete.","Rukusa Farusa's final words of gratitude elicit a reaction from your tiny companion. Return to the Coral Tower and tell Alka Zolka that his idea seems to have worked.","Alka Zolka is pleased to see you and your faerie have made such great strides. Confident that the Nymian tablets contain far more than the secrets of the scholarly arts, he resumes his translations.<br><br>※The next scholar quest will be available from Alka Zolka upon reaching level 50."],"objectives":["Speak with Rukusa Farusa in upper La Noscea.","Cast Esuna on the invalids.","Speak with Rukusa Farusa.","Speak with Alka Zolka at the Marauders' Guild."],"dialogue":[{"name":"ALKAZOLKA","text":"Ah, yes, I forgot to mention that while I was awaiting your return, I made considerable progress with the deciphering of my Nymian tablets."},{"name":"ALKAZOLKA","text":"Much of what I have learned until now has pertained to the roles of scholars within the military. However, these latest texts offer insight into a scholar's activities during times of peace."},{"name":"ALKAZOLKA","text":"As you can imagine, they were not the sort to let their restorative magicks go to waste."},{"name":"ALKAZOLKA","text":"One particularly stirring account describes their selfless efforts to combat the spread of a virulent plague which at one point threatened to engulf all of Nym."},{"name":"ALKAZOLKA","text":"Naturally, they did so with the aid of their faeries, which is why I believe that similar acts of charity may serve to further awaken your winged companion."},{"name":"ALKAZOLKA","text":"If you are of a mind to test my theory, why not journey to Camp Bronze Lake? You will find no shortage of the sick and wounded there."},{"name":"ALKAZOLKA","text":"Rukusa Farusa would doubtless welcome your services were you to offer them. He presides over the Warmwine Sanitorium, so be sure to have a word with him if you decide to go."},{"name":"RUKUSAFARUSA","text":"Hello, and welcome to Bronze Lake. If you desire treatment, I─ Pardon, you wish to <span class=\"emphasis\">administer</span> treatment? Are you even qualified to─"},{"name":"RUKUSAFARUSA","text":"Wait, you must be <span class=\"highlight\">Forename</span>, the scholar! We are happy to accept any assistance you can provide."},{"name":"RUKUSAFARUSA","text":"I am told you possess magicks which can cleanse the body of toxins, impurities, and maladies."},{"name":"RUKUSAFARUSA","text":"At the present, we have five patients visiting the springs who would benefit from this care. Pray attend to these individuals and return to me when finished."},{"name":"RUKUSAFARUSA","text":"The five patients I would have you attend to are all suffering from a variety of lingering conditions."},{"name":"RUKUSAFARUSA","text":"Traditional restorative magicks may treat the symptoms, but not the underlying cause. To balance their humours, you must <span class=\"emphasis\">leech</span> the impurities from their bodies."},{"name":"KAOIRONOWARUISHOUBYOUHEI","text":"What's...what's wrong with me? My wounds have closed, but still I feel so weak..."},{"name":"KAOIRONOWARUISHOUBYOUHEI","text":"Eh!? What did you do? You took something from me...something bad. I don't know what you did, but I'm glad you did it. Thank you."},{"name":"NEMUSOUNASHOUBYOUHEI","text":"Can't sleep, mummer will eat me. Can't sleep, mummer will eat me."},{"name":"NEMUSOUNASHOUBYOUHEI","text":"You...you've set me free! I no longer feel his eyes upon me..."},{"name":"INNKISOUNASHOUBYOUHEI","text":"Me arm ain't been the same since Carteneau. Chirurgeon says the flesh is willing, but the spirit is weak. I say he's a superstitious git."},{"name":"INNKISOUNASHOUBYOUHEI","text":"What...what's this warmth? Did you do that? I...I... Thank you, whoever you are."},{"name":"TURASOUNASHOUBYOUHEI","text":"&lt;pant&gt; &lt;pant&gt; Are...are you here to help me? I...I don't know what's wrong, I just...can't..."},{"name":"TURASOUNASHOUBYOUHEI","text":"&lt;gasp&gt; My lungs, I...I can breathe again! Bless you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, <span class=\"emphasis\">bless you</span>!"},{"name":"YOTTASHOUBYOUHEI","text":"Gahaha─hic─hahaha! Try takin' a wound sometime, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Sure, it hurts like hells at first, but then ye get to drink away the pain!"},{"name":"YOTTASHOUBYOUHEI","text":"Huh? What the... Why'd ye have to go an' do <span class=\"emphasis\">that</span>!? Ah, bugger. Now they'll take me wine away..."},{"name":"RUKUSAFARUSA","text":"Incredible, absolutely incredible. What you did for those patients was nothing short of miraculous."},{"name":"RUKUSAFARUSA","text":"Their commanding officers will be pleased to hear that they can return to active duty. You and Alka Zolka have my deepest thanks, <span class=\"highlight\">Forename</span>."},{"name":"ALKAZOLKA","text":"Ah, <span class=\"highlight\">Forename</span>. Rukusa Farusa tells me that your potent magicks exceed all expectation."},{"name":"ALKAZOLKA","text":"Had a good time, did you? Aye, I thought you might."},{"name":"ALKAZOLKA","text":"It warms my heart to see the two of you making such great strides. And it reminds me that I must work harder to see that I am not left behind!"},{"name":"ALKAZOLKA","text":"For the nonce, I will resume deciphering the Nymian tablets. Though they have yielded an immense quantity of information on the scholarly arts, I remain confident that they contain an equally impressive wealth of tactical information."},{"name":"POP","text":"The corruption lingers..."}],"reward":{"action":189,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":29}],"quests":[66636]},"next":[66638]},"partials":[{"type":"npc","id":"1006757","obj":{"i":1006757,"n":"Alka Zolka","l":28,"q":11}},{"type":"npc","id":"1006332","obj":{"i":1006332,"n":"Rukusa Farusa","l":34,"q":3}},{"type":"npc","id":"1007840","obj":{"i":1007840,"n":"Wan-faced Invalid","l":34,"q":1}},{"type":"npc","id":"1007841","obj":{"i":1007841,"n":"Heavy-eyed Invalid","l":34,"q":1}},{"type":"npc","id":"1007842","obj":{"i":1007842,"n":"Dark-spirited Invalid","l":34,"q":1}},{"type":"npc","id":"1007843","obj":{"i":1007843,"n":"Short-breathed Invalid","l":34,"q":1}},{"type":"npc","id":"1007844","obj":{"i":1007844,"n":"Wine-soaked Invalid","l":34,"q":1}},{"type":"action","id":"189","obj":{"i":189,"n":"Lustrate","c":2805,"j":28,"t":4,"l":45}},{"type":"quest","id":"66636","obj":{"i":66636,"n":"In the Image of the Ancients","g":156,"l":"Limsa Lominsa","s":4,"f":1}},{"type":"quest","id":"66638","obj":{"i":66638,"n":"The Beast Within","g":156,"l":"Limsa Lominsa","s":6,"f":1}}]}