{"quest":{"name":"Forgotten but Not Gone","location":"Limsa Lominsa","id":66633,"patch":2.0,"sort":1,"icon":100107,"unlocksFunction":1,"eventIcon":71341,"issuer":1000895,"target":1006757,"involved":[1000911,1007835,1007836],"genre":156,"journal":["Murie has knowledge of an intriguing opportunity.","Though marauders are not known for their academic pursuits, one such marauder named Alka Zolka seeks an arcanist to assist him with his archaeological research. Should curiosity overwhelm you, he can be found at the Coral Tower in Limsa Lominsa.","Alka Zolka's interest in history is a practical one, as he seeks to research the military tactics of Nym, an ancient civilization said to have repulsed would-be invaders time and time again. He had hoped that an arcanist might help analyze any text pertaining to magical arts─that is, if he were in possession of any texts to translate. Alas, the Nymian tablets he purchased were stolen en route to Limsa Lominsa. Journey to the Raincatcher Gully docks in eastern La Noscea, where he suspects the thieves may be found, and help him recover his stolen relics.","As predicted, the thieves and the relics were both found at the docks. However, Alka Zolka had not anticipated the appearance of an otherworldly creature, one which seemingly burst forth from a crystal you found with the tablets. Hastily translating one of the tablets, Alka Zolka explains that the creature is a faerie, one which once served as the companion of a Nymian scholar. Ask the shocked marauder what he would like to do next.","Eager to discover what other secrets the tablets contain, Alka Zolka quickly departs for Limsa Lominsa. Perhaps by the time you return to the Coral Tower, he will have learned something new.","Alka Zolka explains that the crystal you found was the Soul of the Scholar, and that with it, you can call upon the faerie at will. Reasoning that an experienced arcanist would be in a better position to preserve the lost arts, he decides to entrust the crystal to you. Do your utmost to gain mastery over your newfound powers as the marauder continues to decipher the ancient tablets.<br><br>※The next scholar quest will be available from Alka Zolka upon reaching level 35."],"objectives":["Speak with Alka Zolka at the Marauders' Guild.","Speak with Alka Zolka in eastern La Noscea.","Speak with Alka Zolka.","Speak with Alka Zolka at the Marauders' Guild.","Defeat the bandits and reclaim the stolen relics!"],"dialogue":[{"name":"MURIE","text":"Hmmm... <span class=\"highlight\">Forename</span>, have you any interest in history? If so, I would share with you an opportunity to study the ways of the ancients."},{"name":"MURIE","text":"A curiously refined and well-read marauder visited the guild the other day in the hopes he might meet an arcanist of exceptional skill."},{"name":"MURIE","text":"He claims that the assistance of one such individual would be invaluable for the success of his archaeological research. I say “claims,” because despite his eloquence, the thought of a marauder with academic ambitions still strikes me as odd..."},{"name":"MURIE","text":"You are, of course, free to formulate your own opinions. His name is Alka Zolka, and he can be found at the Marauders' Guild should curiosity overwhelm you."},{"name":"ALKAZOLKA","text":"Thank you for setting aside your preconceptions, <span class=\"highlight\">Forename</span>. I am acutely aware how unusual it is for a marauder to “conduct research,” as it were."},{"name":"ALKAZOLKA","text":"However, you shall soon understand that I am not at all like my more muscular brethren. Rather than rush blindly into the enemy's maw, I formulate and execute stratagems to great effect."},{"name":"ALKAZOLKA","text":"My archaeological pursuits are but an extension of this practice, for at present I am researching the military tactics of ancient Nym."},{"name":"ALKAZOLKA","text":"'Twould not surprise me if you were unfamiliar with Nym. The civilization flourished some fifteen-odd centuries ago, during the Fifth Astral Era."},{"name":"ALKAZOLKA","text":"The Nymians lived during an age of wonders, when the magical arts flourished. But magicks can be wielded for weal or for woe, and this period of peace eventually gave way to the great War of the Magi."},{"name":"ALKAZOLKA","text":"The nations of that bygone era brought earth-shattering magicks to bear against one another. Yet Nym, with only a handful of mages to support its army of mariners, repulsed would-be invaders time and time again."},{"name":"ALKAZOLKA","text":"Precisely how a military force of this composition could defy its stronger neighbors is a mystery which has long puzzled military historians. By translating extant Nymian tablets which I have recently purchased, I mean to solve the riddle at long last."},{"name":"ALKAZOLKA","text":"As my knowledge of arcanima is cursory at best, I require an experienced arcanist to assist me with my analysis of any text pertaining to the magical arts. Will you be that arcanist, <span class=\"highlight\">Forename</span>?"},{"name":"ALKAZOLKA","text":"There is, however, a complication. The Nymian tablets and other assorted relics─for which I paid an <span class=\"emphasis\">exceedingly</span> large amount of money─were stolen en route to Limsa Lominsa."},{"name":"ALKAZOLKA","text":"The information inscribed upon those tablets could be of untold significance! I will not allow thieves to sell it to some rich Ul'dahn collector for a pittance. Pray accompany me to the Raincatcher Gully docks and help me reclaim my relics. I have strong reason to believe the perpetrators can be found there."},{"name":"ALKAZOLKA","text":"We must have those tablets, <span class=\"highlight\">Forename</span>. Though I did not seek you out for your combat acumen, pray lend me your magicks this once."},{"name":"ALKAZOLKA","text":"As I suspected. They are naught more than broken men who have seized the docks and taken to robbing every passing ship. Come, let us put an end to their banditry and take back what is ours!"},{"name":"ALKAZOLKA","text":"Yes, <span class=\"emphasis\">yes</span>! This is it! A treatise on Nymian military tactics, just as I had hoped!"},{"name":"ALKAZOLKA","text":"...Hello there."},{"name":"ALKAZOLKA","text":"M-Mayhap the tablet can explain this..."},{"name":"ALKAZOLKA","text":"&lt;mumble&gt; &lt;mumble&gt; Scholars...familiars...<span class=\"emphasis\">faeries</span>!?"},{"name":"ALKAZOLKA","text":"“The sunlight of Eos doth soothe and shield.”"},{"name":"ALKAZOLKA","text":"“The moonlight of Selene doth silence and strengthen.”"},{"name":"KOKORONIHIBIKUKOE","text":"(-???-)<span class=\"highlight\">Forename</span>..."},{"name":"ALKAZOLKA","text":"By the Twelve, have you any idea what this means!? We have rediscovered the long-lost magical arts of Nymian scholars!"},{"name":"ALKAZOLKA","text":"Faeries. Honest-to-gods faeries. Well, now I have seen everything!"},{"name":"ALKAZOLKA","text":"Anyway, I shall return to the guild and begin translating the tablet. I cannot wait to see what other secrets it contains!"},{"name":"ALKAZOLKA","text":"Excellent timing, <span class=\"highlight\">Forename</span>. I have just finished transcribing a section which will doubtless be of interest to you."},{"name":"ALKAZOLKA","text":"According to the tablet, the crystal from which the faerie sprang forth is called the Soul of the Scholar, and it contains the wisdom of those long-dead Nymian mages."},{"name":"ALKAZOLKA","text":"With it, you can call upon the faerie as you did before and bind her to your will."},{"name":"ALKAZOLKA","text":"As I said before, I have little knowledge of arcanima, so unless you have some objections, I would like to entrust the crystal to you. Oh, and you needn't recompense me─simply knowing that the lost arts are being preserved is enough."},{"name":"ALKAZOLKA","text":"I shall devote my energies to deciphering the remaining text. Should I discover anything new, I promise that you will be the first to know."},{"name":"SYSTEM","text":"The next scholar quest will be available from Alka Zolka upon reaching level 35."},{"name":"SYSTEM","text":"With the Soul of the Scholar equipped, you can summon a faerie to aid you in battle! When called forth, she will assume the form of a healer-type pet."},{"name":"QIB","text":"Have at thee, knaves!"},{"name":"QIB","text":"I may have miscalculated..."},{"name":"QIB","text":"Do you see any others? No? Excellent!<br>Now, help me search for the tablets!"}],"reward":{"action":185,"items":[{"id":4550}],"xp":14820},"reqs":{"jobs":[{"lvl":30,"id":27}],"questsType":"all","quests":[65997,66049]},"next":[66634]},"partials":[{"type":"npc","id":"1000895","obj":{"i":1000895,"n":"Murie","l":29,"q":5,"t":"Guild Receptionist"}},{"type":"npc","id":"1006757","obj":{"i":1006757,"n":"Alka Zolka","l":28,"q":11}},{"type":"npc","id":"1000911","obj":{"i":1000911,"n":"Mozon Dalazon","l":29,"q":1}},{"type":"npc","id":"1007835","obj":{"i":1007835,"n":"Alka Zolka","l":32,"q":1}},{"type":"npc","id":"1007836","obj":{"i":1007836,"n":"Alka Zolka","l":32,"q":1}},{"type":"action","id":"185","obj":{"i":185,"n":"Adloquium","c":2801,"j":28,"t":2,"l":30}},{"type":"item","id":"4550","obj":{"i":4550,"n":"Soul of the Scholar","l":30,"c":26011,"t":62}},{"type":"quest","id":"65997","obj":{"i":65997,"n":"Sinking Doesmaga","g":135,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66634","obj":{"i":66634,"n":"The Last Remnants","g":156,"l":"Limsa Lominsa","s":2,"f":1}}]}