{"quest":{"name":"Allagan Attire","location":"Gridania","id":66630,"patch":2.0,"sort":4,"icon":100108,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1006725,1006789,1006790,1006791],"genre":155,"usedItems":[3465,3688,3896,2904],"journal":["Y'mhitra wishes to share with you her thoughts on dealing with Tristan.","In order to prepare for the inevitable clash with the dark summoner, Y'mhitra suggests that you enhance your powers with the ancient Allagan garments unearthed in the ruins of Mor Dhona. Travel to Saint Coinach's Find and speak with Rammbroes.","Rammbroes is sympathetic to your plight, but claims that you will have to aid his excavation team before they will consider surrendering their pieces of the evoker's attire. Speak first with the muddled researcher, and defeat the mirrorknight that is distracting the scholar from her tasks.","You have defeated the distracting mirrorknight. Speak with the muddled researcher once more.","The grateful researcher rewards you with a piece of the evoker's attire. Speak next with the unmanned researcher, and defeat the mirrorknight that has him quaking in his boots.","You have defeated the fear-inspiring mirrorknight. Speak with the unmanned researcher once more.","The grateful researcher rewards you with a piece of the evoker's attire. Speak next with the seemingly unmoved researcher, and defeat the mirrorknight that is perturbing him.","You have defeated the bothersome mirrorknight. Speak with the seemingly unmoved researcher once more.","The grateful researcher rewards you with a piece of the evoker's attire. With all the mirrorknights thus defeated, it is time you returned to Rammbroes to report your success.","Praising your efforts to secure the safety of the dig sites, Rammbroes gladly rewards you with the summoner's garment he himself uncovered in the ruins. Thus weighted down with Allagan garb, you are ready to return to Y'mhitra where she awaits you at Apkallu Falls.","Y'mhitra makes note of the fact that your newly obtained equipment bears a strong resemblance to the garments worn by the dark summoner, Tristan. In order to guarantee your supremacy in summoning, the researcher appears eager to conduct the Austerities of Wind─a ritual that requires the captured aetheric essence of the Lady of the Vortex. While Y'mhitra seeks an appropriate place to call forth the wind-aspected egi, she bids you make certain of your own preparations.<br><br>※The next summoner quest will be available from Y'mhitra upon the successful defeat of the primal Garuda."],"objectives":["Speak with Rammbroes at Saint Coinach's Find in Mor Dhona.","Speak with the muddled researcher and defeat the mirrorknight.","Speak with the muddled researcher.","Speak with the unmanned researcher and defeat the mirrorknight.","Speak with the unmanned researcher.","Speak with the seemingly unmoved researcher and defeat the mirrorknight.","Speak with the seemingly unmoved researcher.","Report to Rammbroes.","Return to Y'mhitra at Apkallu Falls."],"dialogue":[{"name":"YMHITRA","text":"Greetings, <span class=\"highlight\">Forename</span>. Though it is good to see you, I am afraid I have yet to ascertain Tristan's ultimate objective. I only know that he is cunning and brutal, and will stop at nothing to achieve his purpose."},{"name":"YMHITRA","text":"As matters stand, we but chase after this man's shadow. Such a straightforward pursuit will, I believe, leave us ever one step behind."},{"name":"YMHITRA","text":"Our sole advantage is the “treasure” we possess that Tristan appears to covet. Eventually, his desire will bring him to us."},{"name":"YMHITRA","text":"Where and when Tristan will strike, I cannot say, but it is unlikely to be on a field of our choosing. Thus, I suggest we prepare for this inevitable conflict as best we may."},{"name":"YMHITRA","text":"As fortune would have it, the ruins of Mor Dhona may have provided us with a new source of strength: word among the Sons is that a set of evoker's attire has been unearthed."},{"name":"YMHITRA","text":"Made during the reign of the Allagan Empire, these enchanted garments were sewn for the exclusive use of summoners. I can only imagine the degree to which they will enhance your already impressive powers."},{"name":"YMHITRA","text":"The man supervising the excavation efforts at Saint Coinach's Find─Rammbroes─is a dear friend of mine. In light of our circumstances, I am certain that he will consent to a request that you be allowed to don the attire. Shall we pay him a visit?"},{"name":"RAMMBROES","text":"Ah, Y'mhitra! I suspected you would make an appearance before long. And I presume this <span class=\"alternative-container\"><span class=\"alternative\">fine lady</span><span class=\"alternative\">fine gentleman</span></span> is the new summoner I've heard so much about?"},{"name":"YMHITRA","text":"Yes─hopefully the first of many. Now, pray tell me, Rammbroes, has the discovery of Allagan-made evoker's attire been confirmed?"},{"name":"RAMMBROES","text":"It has. Truly an historical find!"},{"name":"YMHITRA","text":"Then...I would ask a boon of you, my friend. You recall the predicament of which I spoke? Our chances of survival would be greatly improved if you would consider allowing <span class=\"highlight\">Forename</span> to wear the Allagan garments."},{"name":"RAMMBROES","text":"Hmmm. Well, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> <span class=\"emphasis\">is</span> a summoner, after all. And I must confess to no small degree of scholarly curiosity as to the effect the attire will have on one with the appropriate training."},{"name":"RAMMBROES","text":"These finds are, however, the result of much sweat and even a few tears on the part of our excavation team. 'Tis a frustrating task at times, and I fear they will be loath to part with the garments without some measure of recompense for their efforts."},{"name":"RAMMBROES","text":"Allow me, though, to offer a solution. Metallic monstrosities of Allagan construction known as “mirrorknights” have risen from the dig sites scattered across Mor Dhona. Needless to say, they pose a dangerous threat to our excavators."},{"name":"RAMMBROES","text":"I suggest you speak with my three field researchers, and dispose of any such nasty hindrances to their work. I daresay they will then gladly surrender the pieces of the attire they hold."},{"name":"RAMMBROES","text":"Once I have confirmed our dig sites suitably empty of armored horrors, I will see you rewarded with the garment that I myself recovered from the ruins."},{"name":"SEEKER450A","text":"A mirrorknight lurks just over yonder. I can scarce think straight with that <span class=\"emphasis\">thing</span> wandering about! Oh gods... It approaches!"},{"name":"SEEKER450A","text":"Phew! You have my thanks. Now I might finally be able to concentrate on my tasks."},{"name":"SEEKER450A","text":"...If I'm not mistaken, you were in search of the evoker's attire? I have one of its wondrous pieces right here─you are most welcome to it!"},{"name":"SEEKER450B","text":"P-Praise the g-gods! R-Rammbroes said an adventurer w–would be along. P–Please! Y–You must destroy that h-horrid construction!"},{"name":"SEEKER450B","text":"Thank you for eliminating the source of my recent nightmares. I do not ordinarily stutter so, you see, but abject terror has that effect on folk."},{"name":"SEEKER450B","text":"Now, I hear from Y'mhitra that you have need of this Allagan garment. I should be glad to see it put to practical use, rather than shut away in some dusty vault."},{"name":"SEEKER450C","text":"Mirrorknights? Yes, they have become quite bothersome. I would be most appreciative were you to eliminate the creaking pest that has been plaguing me of late."},{"name":"SEEKER450C","text":"Fascinating. I never thought I would be fortunate enough to observe a conflict against an Allagan construction at such close quarters."},{"name":"SEEKER450C","text":"This has been a deeply enriching experience. If the price is to be my piece of the evoker's attire, then so be it."},{"name":"RAMMBROES","text":"Ah, the champion of my researchers returns!"},{"name":"RAMMBROES","text":"With the ruins now free of mirrorknights, the excavations can proceed at a far more satisfying pace. Trembling in fear for one's life makes it astonishingly difficult to handle ancient artifacts that have a tendency to crumble into dust."},{"name":"RAMMBROES","text":"You have performed a valuable duty for us, <span class=\"highlight\">Forename</span>. As promised, you shall have the summoner's garment uncovered by my own hand as your reward."},{"name":"RAMMBROES","text":"Ah, yes. Y'mhitra mentioned she would await you at Apkallu Falls. It seems there was no doubt in her mind that you would succeed here."},{"name":"YMHITRA","text":"So, this was how the summoners of old were clad. Well, more or less. It is unfortunate that the ruins have yet to surrender the final piece to the Sons."},{"name":"YMHITRA","text":"These garments... Aside from the coloring, they are identical to the garb Tristan wore."},{"name":"YMHITRA","text":"He will find no edge against you through his equipment. When next you face that murderous cad, victory will be decided purely by who is the more talented summoner."},{"name":"YMHITRA","text":"To that end, it is time you drew on your experience of defeating the primal Garuda. Yes, her aura of fickle violence is palpable upon you."},{"name":"YMHITRA","text":"It is daunting to imagine an egi born of the Lady of the Vortex... Such unpredictable ferocity should serve you well!"},{"name":"YMHITRA","text":"I will search for a suitably...airy...location in which to perform the Austerities of Wind. You, my dear summoner, must needs prepare yourself body and mind for the trials ahead. I shall be waiting."},{"name":"YMHITRA","text":"To that end, I would soon proceed with the Austerities of Wind to secure you another potent ally. Though...it seems that you do not yet count the Lady of the Vortex amongst your triumphs."},{"name":"YMHITRA","text":"The primal Garuda is as a glowering stormfront, ever poised to unleash her merciless gales upon Gridania. If you would capture her aetheric essence, then you must find yourself an expedition to join."},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":28}],"quests":[66629]},"next":[66631]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1006789","obj":{"i":1006789,"n":"Muddled Researcher","l":67,"q":1}},{"type":"npc","id":"1006790","obj":{"i":1006790,"n":"Unmanned Researcher","l":67,"q":1}},{"type":"npc","id":"1006791","obj":{"i":1006791,"n":"Seemingly Unmoved Researcher","l":67,"q":1}},{"type":"item","id":"3465","obj":{"i":3465,"n":"Evoker's Waistclout","l":50,"c":45333,"t":36,"p":1000}},{"type":"item","id":"3688","obj":{"i":3688,"n":"Evoker's Ringbands","l":50,"c":44191,"t":37,"p":1000}},{"type":"item","id":"3896","obj":{"i":3896,"n":"Evoker's Thighboots","l":50,"c":46351,"t":38,"p":1000}},{"type":"item","id":"2904","obj":{"i":2904,"n":"Evoker's Horn","l":50,"c":41172,"t":34,"p":1000}},{"type":"quest","id":"66629","obj":{"i":66629,"n":"Shadowing the Summoner","g":155,"l":"Gridania","s":3,"f":1}},{"type":"quest","id":"66631","obj":{"i":66631,"n":"Austerities of Wind","g":155,"l":"Gridania","s":5,"f":1}}]}