{"quest":{"name":"The Beast Within","location":"Limsa Lominsa","id":66638,"patch":2.0,"sort":6,"icon":100107,"unlocksFunction":1,"eventIcon":71341,"issuer":1006757,"target":1007849,"involved":[1007838,1007846,1007847,1007848],"genre":156,"journal":["Alka Zolka has an urgent request.","Another knife-wielding denizen of the Wanderer's Palace has emerged to terrorize the people of Vylbrand, and once again it falls to the Marauders' Guild to find and slay it. Determined not to repeat the mistakes of the past, Alka Zolka has enlisted the aid of two other marauders. He would also like you to join as well─but only if you can promise to keep your faerie in check. If you can, rendezvous with him and the others in Bronze Lake, at the same ruins where you fought the first tonberry.","You pursue the tonberry to the Wanderer's Palace, leaving many of its brethren slain in your wake. As the creature grows weaker, Alka Zolka once again raises his axe to deliver the final blow─and once again is prevented from doing so by your faerie. At last understanding her intent, the two of you turn your restorative magicks upon the tonberry. Rejuvenated, it rises to its feet, and reveals that it was once a man named Surito Carito, one of countless Nymians transformed by a mysterious sickness, and imprisoned within the Wanderer's Palace by their own countrymen. Like his fellow Nymians, Surito was driven mad by his fate─until you returned with his dear companion Lily and cleansed him of his rancor. This shocking revelation has doubtless affected the marauders, so it may be wise to see how they are faring.","After exchanging a few words, the three marauders depart for Limsa Lominsa, leaving you alone with Surito Carito, the scholar turned tonberry. Seek the wisdom of your predecessor.","Alas, the sickness which transformed Surito Carito has rendered him incapable of summoning Lily. By what providence you came to possess his Soul of the Scholar he does not know, but he is nevertheless pleased to see his dear companion in good hands. Declaring that only you are fit to wield the magicks now, he bequeaths to you a scholar's gown, as well as knowledge of the spell Sacred Soil. He then bids you farewell, embarking on a quest to rid his countrymen of their rancor. Carry on the traditions of your Nymian colleagues and share your scholarly gifts with the people of Eorzea!<br><br>※The next scholar quest will be available from Alka Zolka once you have completed the main scenario quest “Before the Dawn.”"],"objectives":["Speak with Alka Zolka in upper La Noscea.","Speak with Alka Zolka.","Speak with the hardened marauder.","Speak with the soft marauder.","Speak with Surito Carito.","Defeat the tonberry wanderer!","Heal the tonberry wanderer!"],"dialogue":[{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>, you must come with me at once! Another tonberry has emerged from the Wanderer's Palace!"},{"name":"ALKAZOLKA","text":"A traveling peddler caught sight of the fiend and fled to Camp Bronze Lake. Once again, it falls to the Marauders' Guild to find and slay it."},{"name":"ALKAZOLKA","text":"This time, we will hunt the tonberry in greater numbers, so that we might surround it and cut off all avenues of escape."},{"name":"ALKAZOLKA","text":"I have not forgotten our previous attempt to slay one of the foul creatures."},{"name":"ALKAZOLKA","text":"Nor have you, I trust. I have your assurances that you will keep your faerie in line <span class=\"emphasis\">this</span> time, yes?"},{"name":"ALKAZOLKA","text":"Then let us make for Bronze Lake at once. Our comrades have already departed, and I do not wish to fall behind. We will rendezvous with them at the same place we battled the first tonberry."},{"name":"ALKAZOLKA","text":"Go on ahead to Bronze Lake, <span class=\"highlight\">Forename</span>. I will follow once I have attended to a few pressing matters here."},{"name":"ALKAZOLKA","text":"Thank the gods you have come, <span class=\"highlight\">Forename</span>! Any later and we might have had to proceed without you!"},{"name":"ALKAZOLKA","text":"The tonberry appears to be in some sort of trance and is oblivious to our presence."},{"name":"ALKAZOLKA","text":"Is everyone ready?"},{"name":"ALKAZOLKA","text":"Excellent! Remember: we must surround the fiend─it cannot be allowed to flee!"},{"name":"TONBERI","text":"My sun, my dear sun... Stay away... I cannot..."},{"name":"ALKAZOLKA","text":"Damn it, not again! It seeks sanctuary inside the Wanderer's Palace!"},{"name":"ALKAZOLKA","text":"Come! Let us follow and finish this once and for all!"},{"name":"ALKAZOLKA","text":"What? <span class=\"emphasis\">Again</span>!? Why do you protect this demon?"},{"name":"TONBERI","text":"The rancor...it... I..."},{"name":"TONBERI","text":"Lily, my <span class=\"emphasis\">sun</span>! Why are you here? Who has summoned you?"},{"name":"TONBERI","text":"Then Nym...Nym is no more? Fifteen hundred years... Can it truly be so?"},{"name":"SURITOCARITO","text":"(-Surito Carito-)I am...I <span class=\"emphasis\">was</span> Surito Carito, before the sickness from the sea transformed me."},{"name":"SURITOCARITO","text":"(-Surito Carito-)The traders, they were the first. As their ears and noses began to atrophy, their limbs grew shorter, and their skin..."},{"name":"SURITOCARITO","text":"(-Surito Carito-)We scholars tried to halt the spread, tried to find a cure. But in time, we too fell ill."},{"name":"SURITOCARITO","text":"(-Surito Carito-)Sympathy turned to fear, and fear to anger. Monsters, they called us. Abominations!"},{"name":"ALKAZOLKA","text":"Then...then you were once a <span class=\"emphasis\">man</span>!?"},{"name":"SURITOCARITO","text":"(-Surito Carito-)They sealed the sick within the temple with magicks─tried to drown us...tried to forget us..."},{"name":"SURITOCARITO","text":"(-Surito Carito-)Though our bodies had been changed, our minds remained intact."},{"name":"SURITOCARITO","text":"(-Surito Carito-)But within every man lurks a beast. When those whom you call kin deny you, come to hate you and despise you..."},{"name":"SURITOCARITO","text":"(-Surito Carito-)I too succumbed to the rancor─until you reunited me with Lily, my dearest sun."},{"name":"SURITOCARITO","text":"(-Surito Carito-)Long has my mind been clouded with hatred. But by the resplendent light of Lily, at long last, I am free..."},{"name":"ALKAZOLKA","text":"&lt;sniffle&gt; &lt;sob&gt; I...I nearly killed him! Thank the gods that faerie stopped me."},{"name":"ALKAZOLKA","text":"I wonder...did she know it was Surito from the beginning, or was it only..."},{"name":"ALKAZOLKA","text":"In any case, she has regained a good portion of her memories, if not all of them, I suspect."},{"name":"ALKAZOLKA","text":"Well, if you would excuse me─I need to take some time to put my thoughts in order, and decide how I might explain this to the axemaster..."},{"name":"MRDA","text":"So wait a bleedin' moment─that tonberry used to be a scholar like you? So...does that mean you'll turn into one of 'em if you keep slingin' those spells? Or did I misunderstand what he said back there? Ah, the hells with it..."},{"name":"MRDB","text":"I came expectin' to fight one tonberry, not a whole bloody mess of 'em. If it wasn't for you an' yer flyin' friend, I reckon we'd not have left there alive."},{"name":"MRDB","text":"Gotta say, you and Alka make a great team. Shame there ain't more of you scholarly types around, 'cause I could use a partner like you. Take care, <span class=\"highlight\">Forename</span>."},{"name":"SURITOCARITO","text":"(-Surito Carito-)That the traditions of my people have not been lost to the ages is of great comfort to me."},{"name":"SURITOCARITO","text":"(-Surito Carito-)I do not know how that soul crystal came into your possession, but I am glad that it did. For the sickness robbed me not only of my body, but of Lily as well."},{"name":"SURITOCARITO","text":"(-Surito Carito-)The Soul of the Scholar no longer resonates with my aether. I cannot summon her─only you can. Only you are fit to wield the magicks now."},{"name":"SURITOCARITO","text":"(-Surito Carito-)Here─a gown as befits a scholar of your standing. I bequeath it to you, along with the knowledge of Sacred Soil, my most versatile art."},{"name":"SURITOCARITO","text":"(-Surito Carito-)I cannot thank you enough for purging the rancor from my heart. But there are still countless others who have yet to see the light. I cannot abandon them to their fate. I will not."},{"name":"SURITOCARITO","text":"(-Surito Carito-)And so I bid you farewell, <span class=\"highlight\">Forename</span>. Carry on our traditions with pride!"},{"name":"SYSTEM","text":"This concludes the scholar quests for FINAL FANTASY XIV: A Realm Reborn. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Before the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next scholar quest will be available from Alka Zolka."},{"name":"QIB","text":"Do not dally, <span class=\"highlight\">Forename</span>! We need your magicks!"},{"name":"QIB","text":"Have you gone mad!? That thing is a monster! It must be put down!"}],"reward":{"action":188,"items":[{"id":3228},{"id":20651}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":29}],"quests":[66637]},"next":[66663,67207]},"partials":[{"type":"npc","id":"1006757","obj":{"i":1006757,"n":"Alka Zolka","l":28,"q":11}},{"type":"npc","id":"1007849","obj":{"i":1007849,"n":"Surito Carito","l":34,"q":1}},{"type":"npc","id":"1007838","obj":{"i":1007838,"n":"Alka Zolka","l":34,"q":1}},{"type":"npc","id":"1007846","obj":{"i":1007846,"n":"Hardened Marauder","l":34,"q":1}},{"type":"npc","id":"1007847","obj":{"i":1007847,"n":"Soft Marauder","l":34,"q":1}},{"type":"npc","id":"1007848","obj":{"i":1007848,"n":"Peculiar Tonberry","l":34,"q":1}},{"type":"action","id":"188","obj":{"i":188,"n":"Sacred Soil","c":2804,"j":28,"t":4,"l":50}},{"type":"item","id":"3228","obj":{"i":3228,"n":"Scholar's Gown","l":55,"c":42325,"t":35,"p":1000}},{"type":"item","id":"20651","obj":{"i":20651,"n":"Argute Attire Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"66637","obj":{"i":66637,"n":"For Your Fellow Man","g":156,"l":"Limsa Lominsa","s":5,"f":1}},{"type":"quest","id":"66663","obj":{"i":66663,"n":"A Relic Reborn (Omnilex)","g":156,"l":"North Shroud","s":7,"f":1}},{"type":"quest","id":"67207","obj":{"i":67207,"n":"The Green Death","g":156,"l":"Limsa Lominsa","s":500,"f":1}}]}