{"quest":{"name":"Austerities of Wind","location":"Gridania","id":66631,"patch":2.0,"sort":5,"icon":100108,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1006792],"genre":155,"journal":["Y'mhitra wishes you to attempt the next summoning ritual.","You are ready to perform the Austerities of Wind. Travel to the Floating City of Nym in outer La Noscea and speak with Y'mhitra to begin the ritual.","You have succeeded in controlling the storm that is Garuda-Egi. Speak with Y'mhitra and celebrate your victory.","After praising your skills as a summoner and showing her gratitude for your contribution to her research, Y'mhitra suggests a return to Apkallu Falls.","Y'mhitra explains to you the nature of the ally you have gained. While the researcher continues to investigate the mysterious Tristan, she bids you experiment with your egi, and master their abilities in preparation for the coming confrontation.<br><br>※The next summoner quest will be available from Y'mhitra upon reaching level 50."],"objectives":["Speak with Y'mhitra in the Floating City of Nym.","Speak with Y'mhitra.","Speak with Y'mhitra at Apkallu Falls.","Defeat Garuda-Egi!"],"dialogue":[{"name":"YMHITRA","text":"You should have little trouble finding an expedition here in Gridania that seeks to challenge the keening winds of the Lady of the Vortex."},{"name":"YMHITRA","text":"Remember: we can only proceed with the next summoning ritual once you have grounded Garuda and captured her aetheric essence."},{"name":"SYSTEM","text":"The next summoner quest will be available from Y'mhitra upon the successful defeat of the primal Garuda."},{"name":"YMHITRA","text":"I sense Garuda's restless essence railing within the confines of your aetheric channels. It is time we granted it release with the Austerities of Wind."},{"name":"YMHITRA","text":"Thankfully, I already have in mind a location that well suits our elemental purposes."},{"name":"YMHITRA","text":"You are familiar with the Floating City of Nym in outer La Noscea? As you might imagine, the aspect of wind is entirely dominant in the area of those suspended isles."},{"name":"YMHITRA","text":"Pray make your way there as soon as you feel prepared─I am quite excited to see this new egi!"},{"name":"YMHITRA","text":"Shall we begin? I assume that as this is your third such experience, you have by now grown familiar with the steps of the ritual."},{"name":"YMHITRA","text":"Thus, as before, I would have you concentrate on shifting your aetheric balance. Imagine the energy within you howling through your veins─an incessant gale of screeching wrath."},{"name":"YMHITRA","text":"Garuda's essence will be only too eager to harness those raging currents, and shape them into a worldly avatar. Once Garuda-Egi has appeared, it falls to you to tame its fury."},{"name":"YMHITRA","text":"Masterfully done, <span class=\"highlight\">Forename</span>! Garuda-Egi's power is now yours to wield!"},{"name":"YMHITRA","text":"Your aptitude for the art of summoning has exceeded my highest expectations. I honestly could not have found a more valuable partner for my research!"},{"name":"YMHITRA","text":"Let us return to Apkallu Falls. I am sure you must be exhausted after this ordeal."},{"name":"YMHITRA","text":"With the addition of Garuda-Egi, you now command three powerful avatars."},{"name":"YMHITRA","text":"As you have no doubt realized, however, each of these entities has a particular role in which it excels."},{"name":"YMHITRA","text":"For Garuda-Egi, that role is unleashing magic to strike down distant foes. I must admit to feeling equal parts joy and apprehension at how faithfully the summoned being displays the original primal's volatile disposition."},{"name":"YMHITRA","text":"Experiment with your egi allies, and the most effective use of their individual abilities will soon become clear. With such mastery of the art at your disposal, I shall almost pity Tristan when next he chooses to confront you."},{"name":"YMHITRA","text":"Before that time comes, however, I will endeavor to pierce the mystery of his motivations. May your discoveries bring you new confidence, <span class=\"highlight\">Forename</span>."},{"name":"QIB","text":"Such powerful winds!<br>There can be no doubt we face Garuda's spawn!"},{"name":"QIB","text":"Beware the avatar's feathers!"},{"name":"QIB","text":"Do my eyes deceive me!?<br>I am certain you summoned but one egi!"},{"name":"QIB","text":"I feel so battered and bruised...<br>It is past time we calmed this storm!"},{"name":"QIB","text":"I thought...I thought myself ready..."}],"reward":{"action":25807,"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":28}],"instances":[20003],"quests":[66630]},"next":[66632]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006792","obj":{"i":1006792,"n":"Y'mhitra","l":350,"q":1}},{"type":"action","id":"25807","obj":{"i":25807,"n":"Summon Garuda","c":2756,"j":27,"t":2,"l":45}},{"type":"instance","id":"20003","obj":{"i":20003,"n":"The Howling Eye","c":61804,"t":"Trials","min_lvl":44,"max_lvl":46}},{"type":"quest","id":"66630","obj":{"i":66630,"n":"Allagan Attire","g":155,"l":"Gridania","s":4,"f":1}},{"type":"quest","id":"66632","obj":{"i":66632,"n":"Primal Burdens","g":155,"l":"Gridania","s":6,"f":1}}]}