{"quest":{"name":"The Consequences of Anger","location":"Limsa Lominsa","id":66635,"patch":2.0,"sort":3,"icon":100107,"unlocksFunction":1,"eventIcon":71341,"issuer":1006757,"target":1006757,"involved":[1007837,1007845],"genre":156,"journal":["Alka Zolka looks pleased to see you.","The time has come at last to revive the Nymian tradition of marauder and scholar fighting side by side. A tonberry has been sighted in Bronze Lake, and Alka Zolka would have the two of you slay it. To further tempt you into accepting his request, he states that the experience may rekindle the memories of your faerie, as he theorizes that tonberries once plagued the people of Nym. Rendezvous with Alka Zolka outside the Wanderer's Palace so that you might hunt the creature together.","Finding the tonberry was surprisingly easy. Slaying it, however, was not. As Alka Zolka prepared to deliver the final blow, your faerie inexplicably came to the tonberry's defense, providing it with ample time to escape. Do what you can to console the downcast Alka Zolka.","Alka Zolka understands that you are still inexperienced in the ways of a scholar and cannot be expected to control the faerie flawlessly. Nevertheless, you sense that he may still be cross with you. Speak with him again at the Coral Tower when he has had time to calm down.","In retrospect, Alka Zolka declares that your success against the tonberry, as well as the rekindling of your faerie's memories, is cause enough to celebrate. Even so, he politely requests that you strive to gain greater control over your faerie so the incident does not repeat itself.<br><br>※The next scholar quest will be available from Alka Zolka upon reaching level 45."],"objectives":["Speak with Alka Zolka in upper La Noscea.","Speak with Alka Zolka.","Speak with Alka Zolka at the Marauders' Guild.","Defeat the tonberry wanderer!"],"dialogue":[{"name":"ALKAZOLKA","text":"How curious that you always come at the most opportune time, <span class=\"highlight\">Forename</span>. 'Tis divine providence, almost."},{"name":"ALKAZOLKA","text":"Doubly so since we have both been blessed with a chance to refine our respective arts."},{"name":"ALKAZOLKA","text":"You see, in your absence, I have been studying a section of the Nymian treatise detailing marauder fighting techniques. The fundamentals do not differ much from modern methods, but there are slight variations in footwork and grip, as well as the distinctions between the various ranges, and the attacks best employed when─"},{"name":"ALKAZOLKA","text":"Forgive me, I lost sight of the more pertinent point. Nymian scholars and marauders fought side by side, yes? Well, now you and I have an opportunity to do the same. A tonberry has been spotted in Bronze Lake, and the Marauders' Guild has been asked to dispatch it."},{"name":"ALKAZOLKA","text":"Since tonberries dwell within the Wanderer's Palace─an ancient Nymian temple recently discovered in the wake of the Calamity─there is a strong possibility that the creatures have resided there since <span class=\"emphasis\">before</span> the fall of Nym."},{"name":"ALKAZOLKA","text":"Do you follow my reasoning, <span class=\"highlight\">Forename</span>? These malevolent creatures may have overrun the temple and claimed it for their own at the height of Nymian civilization. They may have posed a major threat to the ancient people, even."},{"name":"ALKAZOLKA","text":"If so, then surely facing one in battle would rekindle the memories of your faerie."},{"name":"ALKAZOLKA","text":"Even if I am mistaken, the tonberry poses a threat to the locals. Moreover, I would very much like to put my newly learned Nymian techniques to the test. So, we will rendezvous outside the Wanderer's Palace, yes?"},{"name":"ALKAZOLKA","text":"Facing the tonberry is sure to rekindle the memories of your faerie. And even should my theory prove incorrect, there is value to be had in refining our Nymian arts, do you not think?"},{"name":"ALKAZOLKA","text":"Well met, <span class=\"highlight\">Forename</span>. I had only just arrived myself."},{"name":"ALKAZOLKA","text":"'Twas in this vicinity that the tonberry was last sighted. With luck, it will not have gone far."},{"name":"ALKAZOLKA","text":"Look, atop the stairs!"},{"name":"TONBERI","text":"My sun! My dear sun! At long last, I... I..."},{"name":"TONBERI","text":"The...the rancor... It rises... It rises!"},{"name":"ALKAZOLKA","text":"It comes!"},{"name":"ALKAZOLKA","text":"Raaargh!"},{"name":"ALKAZOLKA","text":"What are you doing!? Move, damn you!"},{"name":"TONBERI","text":"My..."},{"name":"ALKAZOLKA","text":"Confound it all!"},{"name":"ALKAZOLKA","text":"Bah! What happened, <span class=\"highlight\">Forename</span>!? I thought you could control her!"},{"name":"ALKAZOLKA","text":"&lt;sigh&gt; I apologize. I know you have only just begun to work with the faerie. Some...disobedience is to be expected."},{"name":"ALKAZOLKA","text":"Axemaster Wyrnzoen will be disappointed, but there is naught we can do. The tonberry is long gone. Let us return to Limsa Lominsa."},{"name":"ALKAZOLKA","text":"Ah, <span class=\"highlight\">Forename</span>. Permit me to apologize a second time. Earlier, I...I was flustered and not myself."},{"name":"ALKAZOLKA","text":"In the aftermath of the tonberry's escape, I completely overlooked our accomplishments. We confirmed the viability of Nymian tactics, and proved that a scholar and marauder working in tandem is a force to be reckoned with, would you not say?"},{"name":"ALKAZOLKA","text":"And correct me if I am mistaken, but your faerie regained some of her memory, yes?"},{"name":"ALKAZOLKA","text":"With that in mind, I feel comfortable claiming that this was a worthwhile endeavor. However, do try and gain greater mastery over your minion, <span class=\"highlight\">Forename</span>. I would hate for a repeat of that incident."},{"name":"QIB","text":"I shall draw his ire, <span class=\"highlight\">Forename</span>! Lend me your support!"},{"name":"QIB","text":"Did the tonberry summon those abominations!?"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, I can't..."}],"reward":{"xp":22540},"reqs":{"jobs":[{"lvl":40,"id":29}],"quests":[66634]},"next":[66636]},"partials":[{"type":"npc","id":"1006757","obj":{"i":1006757,"n":"Alka Zolka","l":28,"q":11}},{"type":"npc","id":"1007837","obj":{"i":1007837,"n":"Alka Zolka","l":34,"q":1}},{"type":"npc","id":"1007845","obj":{"i":1007845,"n":"Alka Zolka","l":34,"q":1}},{"type":"quest","id":"66634","obj":{"i":66634,"n":"The Last Remnants","g":156,"l":"Limsa Lominsa","s":2,"f":1}},{"type":"quest","id":"66636","obj":{"i":66636,"n":"In the Image of the Ancients","g":156,"l":"Limsa Lominsa","s":4,"f":1}}]}