{"quest":{"name":"A Pup No Longer (Twin Adder)","location":"Gridania","id":66641,"patch":2.1,"sort":300,"unlocksFunction":1,"eventIcon":71341,"issuer":1000168,"target":1005184,"genre":191,"journal":["Vorsaile Heuloix would have you begin your training in earnest.","High Serpent Commander Vorsaile Heuloix has great hopes for your future in the Order of the Twin Adder, and would send you for training to see your potential fulfilled. Board the ferry from the Moraby Drydocks in lower La Noscea to get to the Wolves' Den. Once there, seek out Storm Captain Berkoeya Loetahlsyn.","After seeing fit to batter every last shred of confidence and self-respect out of you with a brutal tongue-lashing, Storm Captain Berkoeya Loetahlsyn reluctantly grants you permission to begin your training at the Wolves' Den."],"objectives":["Speak with Berkoeya Loetahlsyn at the Wolves' Den."],"dialogue":[{"name":"VORSAILE","text":"Listen well, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. The Order of the Twin Adder does not just welcome glory-seekers willy-nilly into our ranks."},{"name":"VORSAILE","text":"You stand here today because we believe in your potential. We believe that you will go forth as a Serpent and help restore order to a world gone mad."},{"name":"VORSAILE","text":"...And yet, potential alone will not carry you far. Indeed, the road to glory is littered with the bodies of would-be <span class=\"alternative-container\"><span class=\"alternative\">heroines</span><span class=\"alternative\">heroes</span></span> who lacked the determination and diligence to hone their innate talents."},{"name":"VORSAILE","text":"But you will not suffer the same fate─I am certain of it. It is with such high hopes for your future that I would send you to begin the next phase of your training."},{"name":"VORSAILE","text":"The venue shall be the Wolves' Den, a proving ground established by the Eorzean Alliance to prepare Grand Company recruits for the battles that lie ahead."},{"name":"VORSAILE","text":"The Wolves' Den is to be found just off the shores of La Noscea. The ferry at the Moraby Drydocks in lower La Noscea will grant you passage there."},{"name":"VORSAILE","text":"Upon your arrival, seek out Storm Captain Berkoeya Loetahlsyn. I have already taken the liberty of submitting a letter of recommendation on your behalf."},{"name":"BERKOEYA","text":"I don't recall seein' yer ugly mug around here before. Hm? Ye say that <span class=\"emphasis\">Heuloix</span> sent ye!?"},{"name":"BERKOEYA","text":"He said he was sendin' a new wolf to the Den─bah! More like the runt of the litter, if ye ask me."},{"name":"BERKOEYA","text":"Ye barely have fangs for the honin', but I guess I'm feelin' godsdamned generous, so I'll throw ye a bone─start yerself off with Crystalline Conflict. Them trainin' bouts are made special for feckless adventurin' types who can't tell sound strategy from a horse's arse."},{"name":"BERKOEYA","text":"I still reckon it won't be <span class=\"alternative-container\"><span class=\"alternative\">dawn</span><span class=\"alternative\">midday</span><span class=\"alternative\">sundown</span></span> before ye run home with yer tail between yer legs, cryin' for yer mum, but ye can have a word with Lieutenant Gungi Zelungi if ye insist on givin' it a go. Ye'll find him outside, assumin' ye can work up the nerve."},{"name":"BERKOEYA","text":"And stand up straight, maggot! This ain't no place for the weak of spine. Dismissed!"}],"reward":{"gcseal":1438,"xp":0},"reqs":{"jobs":[{"lvl":30,"id":34}],"gc":2},"next":[67063,67064,67065,67819,68543,70121]},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1005184","obj":{"i":1005184,"n":"Berkoeya Loetahlsyn","l":358,"q":4,"t":"Storm Captain"}},{"type":"quest","id":"67063","obj":{"i":67063,"n":"Like Civilized Men and Women (Twin Adder)","g":191,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"67064","obj":{"i":67064,"n":"Like Civilized Men and Women (Maelstrom)","g":190,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"67065","obj":{"i":67065,"n":"Like Civilized Men and Women (Immortal Flames)","g":192,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"67819","obj":{"i":67819,"n":"A Seat at the Feast","g":95,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"68543","obj":{"i":68543,"n":"Earning Your Wings","g":91,"l":"Wolves' Den Pier","s":0,"f":1}},{"type":"quest","id":"70121","obj":{"i":70121,"n":"The Crystal (Line's) Call","g":91,"l":"Wolves' Den Pier","s":0,"f":1}}]}