{"quest":{"name":"A Pup No Longer (Immortal Flames)","location":"Ul'dah","id":66642,"patch":2.1,"sort":300,"unlocksFunction":1,"eventIcon":71341,"issuer":1004576,"target":1005184,"genre":192,"journal":["Swift would have you begin your training in earnest.","High Flame Commander Swift has great hopes for your future in the Immortal Flames, and would send you for training to see your potential fulfilled. Board the ferry from the Moraby Drydocks in lower La Noscea to get to the Wolves' Den. Once there, seek out Storm Captain Berkoeya Loetahlsyn.","After seeing fit to batter every last shred of confidence and self-respect out of you with a brutal tongue-lashing, Storm Captain Berkoeya Loetahlsyn reluctantly grants you permission to begin your training at the Wolves' Den."],"objectives":["Speak with Berkoeya Loetahlsyn at the Wolves' Den."],"dialogue":[{"name":"SWIFT","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. I have been keeping a close eye on you of late. Your efforts on behalf of Ul'dah do us all proud."},{"name":"SWIFT","text":"Yes, I understand now what the Flame General saw in you. It would not be an understatement to say that the future of our Grand Company is riding on your capable shoulders."},{"name":"SWIFT","text":"And yet, it is also clear to me that you have only begun to tap into the depths of your potential."},{"name":"SWIFT","text":"Your flame burns strong, but it may yet grow stronger. Yes, I would see you become a blazing inferno that reduces all that oppose Ul'dah into smoldering embers."},{"name":"SWIFT","text":"It is with such hopes that I have made arrangements for you to receive training at the Wolves' Den─a proving ground established by the Eorzean Alliance for the training of Grand Company recruits. Mayhap you are familiar with it?"},{"name":"SWIFT","text":"That look in your eye tells me you are eager to take to the road. I knew I had not misjudged you."},{"name":"SWIFT","text":"The Wolves' Den is to be found just off the shores of La Noscea. The ferry at the Moraby Drydocks in lower La Noscea will grant you passage there."},{"name":"SWIFT","text":"Upon your arrival, seek out Storm Captain Berkoeya Loetahlsyn. I have already taken the liberty of submitting a letter of recommendation on your behalf."},{"name":"BERKOEYA","text":"I don't recall seein' yer ugly mug around here before. Hm? Ye say that <span class=\"emphasis\">Swift</span> sent ye!?"},{"name":"BERKOEYA","text":"He said he was sendin' a new wolf to the Den─bah! More like the runt of the litter, if ye ask me."},{"name":"BERKOEYA","text":"Ye barely have fangs for the honin', but I guess I'm feelin' godsdamned generous, so I'll throw ye a bone─start yerself off with Crystalline Conflict. Them trainin' bouts are made special for feckless adventurin' types who can't tell sound strategy from a horse's arse."},{"name":"BERKOEYA","text":"I still reckon it won't be <span class=\"alternative-container\"><span class=\"alternative\">dawn</span><span class=\"alternative\">midday</span><span class=\"alternative\">sundown</span></span> before ye run home with yer tail between yer legs, cryin' for yer mum, but ye can have a word with Lieutenant Gungi Zelungi if ye insist on givin' it a go. Ye'll find him outside, assumin' ye can work up the nerve."},{"name":"BERKOEYA","text":"And stand up straight, maggot! This ain't no place for the weak of spine. Dismissed!"}],"reward":{"gcseal":1438,"xp":0},"reqs":{"jobs":[{"lvl":30,"id":34}],"gc":3},"next":[67063,67064,67065]},"partials":[{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1005184","obj":{"i":1005184,"n":"Berkoeya Loetahlsyn","l":358,"q":4,"t":"Storm Captain"}},{"type":"quest","id":"67063","obj":{"i":67063,"n":"Like Civilized Men and Women (Twin Adder)","g":191,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"67064","obj":{"i":67064,"n":"Like Civilized Men and Women (Maelstrom)","g":190,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"67065","obj":{"i":67065,"n":"Like Civilized Men and Women (Immortal Flames)","g":192,"l":"Ul'dah","s":300,"f":1}}]}