{"quest":{"name":"My First Fishing Rod","location":"Limsa Lominsa","id":66644,"patch":2.0,"sort":11,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000857,"genre":146,"usedItems":[4870],"journal":["Sisipu would like to assign you your first task.","In order to test your understanding of the basics, Sisipu has bid you catch five Lominsan anchovies. These fish can be found in the waters surrounding Limsa Lominsa, including those directly outside the Fishermen's Guild.","Before Sisipu can appraise your anchovies, Guildmaster Wawalago makes an appearance to do it for her. The fisherwoman takes the opportunity to chide the netmaster for neglecting his duties, but Wawalago remains unfazed. In any case, the two of them acknowledge your mastery of the fishing fundamentals, and encourage you to expand your horizons.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 5."],"objectives":["Deliver Lominsan anchovies to Sisipu."],"dialogue":[{"name":"SISIPU","text":"You're looking quite formidable. Let's hope you don't scare all the fish away."},{"name":"SISIPU","text":"Now, the first rule of fishing is to hold on to your rod: take care of your rod, and your rod will take care of you. Let me know if I'm going too fast for you."},{"name":"SISIPU","text":"Since you're new here, we're going to start small, and they don't come much smaller than anchovies."},{"name":"SISIPU","text":"You'll find schools of anchovies swimming around outside in Galadion Bay, so you can catch your meager supper without even walking ten yalms."},{"name":"SISIPU","text":"Anchovies are hardly the most cunning fish in the sea, making them an ideal first assignment. Simply bait a hook with some of those lugworms I gave you, dip it in the water, and the fish will practically catch themselves."},{"name":"SYSTEM","text":"To catch Lominsan anchovies for Sisipu, first select a suitable lure using the <span class=\"highlight\">Bait</span> action. Next, approach the water and use the <span class=\"highlight\">Cast</span> action to begin fishing."},{"name":"SYSTEM","text":"When you feel a tug on your line, use the <span class=\"highlight\">Hook</span> action to reel in your catch."},{"name":"SISIPU","text":"Anchovies swim off every shore of Limsa Lominsa, so you can bring them back from anywhere you like...so long as it's not the fishmongers'."},{"name":"WAWALAGO","text":"(-???-)Here 'chovy, 'chovy! Here 'chovy, 'chovy! Fair flock of feisty fish you've got, giddy guppy! Careful they don't slip out of sight!"},{"name":"SISIPU","text":"W-Wawalago!? To what do we owe the...pleasure?"},{"name":"WAWALAGO","text":"A guildmaster's got to get after the guppies─dividing up the daily drudgery, picking out a proper potable, and some such support and service."},{"name":"SISIPU","text":"And who gets after the guildmaster? We have books to balance, you know─books <span class=\"emphasis\">you</span> should be balancing!"},{"name":"WAWALAGO","text":"I did my best to balance the books, but the bilge keel bent the bow back, bouncing the whole batch off the boat!"},{"name":"SISIPU","text":"That's not what─ You <span class=\"emphasis\">know</span> it was just an expression!"},{"name":"SISIPU","text":"&lt;sigh&gt; But that's neither here nor there. So long as you keep at the bit, <span class=\"highlight\">Forename</span>, our books will balance themselves."},{"name":"SISIPU","text":"Don't let that go to your head, of course. Any beginner can snag some anchovies, but you'll need to experiment with different lures and explore new waters if you want to catch the big ones."},{"name":"WAWALAGO","text":"Fundamentals are fine, but the fun is fishing for new finds. Like my uncle always said, “Fishing's like philanderin'─ye never know what ye'll catch!”"},{"name":"SISIPU","text":"...And with those well-spoken words of <span class=\"emphasis\">wisdom</span>, we will leave you to your wiles."},{"name":"SYSTEM","text":"The next fisher quest will be available from Sisipu upon reaching level 5."}],"reward":{"gil":115,"items":[{"id":2959}],"xp":150},"reqs":{"jobs":[{"lvl":1,"id":19}],"quests":[66643]},"next":[66645,69379]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"item","id":"2959","obj":{"i":2959,"n":"Hempen Dalmatica of Gathering","l":1,"c":42016,"t":35}},{"type":"item","id":"4870","obj":{"i":4870,"n":"Lominsan Anchovy","l":3,"c":29034,"t":47,"p":7}},{"type":"quest","id":"66643","obj":{"i":66643,"n":"Way of the Fisher","g":146,"l":"Limsa Lominsa","s":10,"f":1}},{"type":"quest","id":"66645","obj":{"i":66645,"n":"Bigger Fish to Fry","g":146,"l":"Limsa Lominsa","s":50,"f":1}},{"type":"quest","id":"69379","obj":{"i":69379,"n":"All the Fish in the Sea","g":91,"l":"Limsa Lominsa","s":10,"f":1}}]}