{"quest":{"name":"The Princess and the Fish","location":"Limsa Lominsa","id":66646,"patch":2.0,"sort":100,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000857,"genre":146,"usedItems":[4930],"journal":["For your next lesson, Sisipu would send you off into the wild.","Seeing the desire for bigger fish in your eyes, Sisipu has given you your greatest challenge yet. With crayfish balls in hand, you are to venture to the Nym River in middle La Noscea and catch a plump and juicy princess trout.","During a heated debate with Wawalago over the proper way to prepare princess trout, Sisipu lets slip that she may have had ulterior motives for sending you to the Nym. Putting that to one side, she states that this task should have shown the importance of perseverance in your trade.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 15."],"objectives":["Deliver a princess trout to Sisipu."],"dialogue":[{"name":"SISIPU","text":"What's that in your eye, <span class=\"highlight\">Forename</span>? I know that glimmer! It's the...Eye of the Fisher! It's the thrill of the bite! Rising up to the challenge of our rival!"},{"name":"SISIPU","text":"Keep that spark alive, friend. You don't want to end up like Wawalago."},{"name":"SISIPU","text":"Not that I'm worried about you. Oh yes, I can see it. There is a fire inside you, burning for fish. More fish. Bigger fish. It is time to feed that fire."},{"name":"SISIPU","text":"Today is the day─the day you catch your first big one. No one ever forgets their first."},{"name":"SISIPU","text":"Journey forth to the banks of the Nym in middle La Noscea. There you will find her, the princess trout. Take the princess and return here <span class=\"alternative-container\"><span class=\"alternative\">triumphant</span><span class=\"alternative\">a man</span></span>."},{"name":"SISIPU","text":"Her Royal Highness is drawn to crayfish balls."},{"name":"SYSTEM","text":"Certain gear grants bonuses to your <span class=\"highlight\">perception</span>. Greater perception raises the probability of catching larger fish."},{"name":"SYSTEM","text":"Although fish can be of different sizes at the time they are caught, all fish of the same type become identical items once in your inventory."},{"name":"SISIPU","text":"You'll find the princess trout in the Nym River, <span class=\"highlight\">Forename</span>. Don't forget to take your crayfish balls!"},{"name":"SISIPU","text":"Depending on your perspective, you've either rescued or abducted the princess..."},{"name":"WAWALAGO","text":"A prim and proper princess she is! We'll ready her as a royal roast, a feast fit for a king!"},{"name":"SISIPU","text":"The king can keep his fancy feast. Any fisherman worth her salt prefers her trout prepared simply!"},{"name":"WAWALAGO","text":"Said like a surly, salty-mouthed sea hag! Hand her over here, and heed how the cultured classes cook."},{"name":"SISIPU","text":"A fine day it will be when I take culture lessons from you! Besides, I didn't send <span class=\"highlight\">Forename</span> out to that river to fetch a fish for you, I sent <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> out to fetch a fish for me!"},{"name":"SISIPU","text":"Ahem. For my <span class=\"emphasis\">lesson</span>, that is. Yes, of course, that was the purpose of the expedition."},{"name":"SISIPU","text":"Anyway, as you should have learned, catching a proper fish requires perseverance, plain and simple."},{"name":"SISIPU","text":"And this plump princess trout can testify to that."},{"name":"SISIPU","text":"Continue to apply the lessons I've taught you, and before you know it, you'll be swimming in fish! Doesn't that sound appetizing?"}],"reward":{"gil":289,"items":[{"id":2573},{"num":99,"id":2590},{"id":2658,"one":1},{"id":3771,"one":1},{"num":2,"id":5824,"one":1}],"xp":5899},"reqs":{"jobs":[{"lvl":10,"id":19}],"quests":[66645]},"next":[66647]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"item","id":"2573","obj":{"i":2573,"n":"Amateur's Fishing Rod","l":12,"c":38202,"t":32,"p":439}},{"type":"item","id":"2590","obj":{"i":2590,"n":"Bloodworm","l":10,"c":27006,"t":33,"p":3}},{"type":"item","id":"2658","obj":{"i":2658,"n":"Straw Hat","l":10,"c":41037,"t":34,"p":226}},{"type":"item","id":"3771","obj":{"i":3771,"n":"Hard Leather Shoes","l":11,"c":46167,"t":38,"p":256}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4930","obj":{"i":4930,"n":"Princess Trout","l":5,"c":29285,"t":47,"p":10}},{"type":"quest","id":"66645","obj":{"i":66645,"n":"Bigger Fish to Fry","g":146,"l":"Limsa Lominsa","s":50,"f":1}},{"type":"quest","id":"66647","obj":{"i":66647,"n":"Every Fish Has a Silver Lining","g":146,"l":"Limsa Lominsa","s":150,"f":1}}]}