{"quest":{"name":"A Pup No Longer (Maelstrom)","location":"Limsa Lominsa","id":66640,"patch":2.1,"sort":300,"unlocksFunction":1,"eventIcon":71341,"issuer":1003281,"target":1005184,"genre":190,"journal":["R'ashaht Rhiki would have you begin your training in earnest.","High Storm Commander R'ashaht Rhiki has great hopes for your future in the Maelstrom, and would send you for training to see your potential fulfilled. Board the ferry from the Moraby Drydocks in lower La Noscea to get to the Wolves' Den. Once there, seek out Storm Captain Berkoeya Loetahlsyn.","After seeing fit to batter every last shred of confidence and self-respect out of you with a brutal tongue-lashing, Storm Captain Berkoeya Loetahlsyn reluctantly grants you permission to begin your training at the Wolves' Den."],"objectives":["Speak with Berkoeya Loetahlsyn at the Wolves' Den."],"dialogue":[{"name":"RASHAHTRHIKI","text":"Ah, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>─just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see. Your exploits of late have been the talk of Limsa."},{"name":"RASHAHTRHIKI","text":"Don't let this puff your sails up too much, but I've heard some of the higher–ups saying that the Maelstrom would be lost at sea without you."},{"name":"RASHAHTRHIKI","text":"But I suspect you're not the type to rest on your laurels. Nay, the tempest raging in your eyes tells me you're looking for new waters to navigate."},{"name":"RASHAHTRHIKI","text":"Fortunately, we have just the place for people like you. Have you perchance heard of the Wolves' Den?"},{"name":"RASHAHTRHIKI","text":"It's a proving ground of sorts established by the Eorzean Alliance─a place where the most promising of Grand Company recruits are sent to hone their skills."},{"name":"RASHAHTRHIKI","text":"The Wolves' Den is to be found just off the shores of La Noscea. The ferry at the Moraby Drydocks in lower La Noscea will grant you passage there."},{"name":"RASHAHTRHIKI","text":"Upon your arrival, seek out Storm Captain Berkoeya Loetahlsyn. I've let him know that you'll be coming, so you can count on a warm welcome."},{"name":"BERKOEYA","text":"I don't recall seein' yer ugly mug around here before. Hm? Ye say that <span class=\"emphasis\">Rhiki</span> sent ye!?"},{"name":"BERKOEYA","text":"She said she was sendin' a new wolf to the Den─bah! More like the runt of the litter, if ye ask me."},{"name":"BERKOEYA","text":"Ye barely have fangs for the honin', but I guess I'm feelin' godsdamned generous, so I'll throw ye a bone─start yerself off with Crystalline Conflict. Them trainin' bouts are made special for feckless adventurin' types who can't tell sound strategy from a horse's arse."},{"name":"BERKOEYA","text":"I still reckon it won't be <span class=\"alternative-container\"><span class=\"alternative\">dawn</span><span class=\"alternative\">midday</span><span class=\"alternative\">sundown</span></span> before ye run home with yer tail between yer legs, cryin' for yer mum, but ye can have a word with Lieutenant Gungi Zelungi if ye insist on givin' it a go. Ye'll find him outside, assumin' ye can work up the nerve."},{"name":"BERKOEYA","text":"And stand up straight, maggot! This ain't no place for the weak of spine. Dismissed!"}],"reward":{"gcseal":1438,"xp":0},"reqs":{"jobs":[{"lvl":30,"id":34}],"gc":1},"next":[67819,68543,70121]},"partials":[{"type":"npc","id":"1003281","obj":{"i":1003281,"n":"R'ashaht Rhiki","l":28,"q":13,"t":"Storm Commander"}},{"type":"npc","id":"1005184","obj":{"i":1005184,"n":"Berkoeya Loetahlsyn","l":358,"q":4,"t":"Storm Captain"}},{"type":"quest","id":"67819","obj":{"i":67819,"n":"A Seat at the Feast","g":95,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"68543","obj":{"i":68543,"n":"Earning Your Wings","g":91,"l":"Wolves' Den Pier","s":0,"f":1}},{"type":"quest","id":"70121","obj":{"i":70121,"n":"The Crystal (Line's) Call","g":91,"l":"Wolves' Den Pier","s":0,"f":1}}]}