{"quest":{"name":"Bigger Fish to Fry","location":"Limsa Lominsa","id":66645,"patch":2.0,"sort":50,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000857,"genre":146,"usedItems":[4874],"journal":["Sisipu has a trial in mind for you.","Sisipu explains that different fish are drawn to different bait. To illustrate her point, she has instructed you to use pill bugs to catch three harbor herring, which can be found in the waters surrounding the lower decks.","By delivering three harbor herring, you have demonstrated to Sisipu that you can delve inside the mind of a fish. She bids you continue thinking fishlike thoughts, that you might be ready for your next lesson.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 10."],"objectives":["Deliver harbor herring to Sisipu."],"dialogue":[{"name":"SISIPU","text":"Hmm... I smell that you haven't been neglecting your duties."},{"name":"SISIPU","text":"A commendable attitude. No one's ever gotten worse at anything by practicing. No one I know, at least."},{"name":"SISIPU","text":"Then again, you can't expect the same old tricks to work with new fish. Big ones don't grow to be that way chasing everything that wiggles on a hook."},{"name":"SISIPU","text":"To catch the fish you want, you must first know what the fish wants. Only once their prize is at stake can you tantalize and tempt your prey to taste the forbidden tackle."},{"name":"SISIPU","text":"Anchovies may be willing to settle for lugworms, but harbor herring have a discerning palate that prefers pill bugs."},{"name":"SISIPU","text":"But don't take my word for it; go and see for yourself. Pick up some pill bugs from Syneyhil over in West Hawkers' Alley, then use them to catch three local harbor herring. Like anchovies, they can be caught right outside."},{"name":"SISIPU","text":"In case you've a mind to return to your previous spot, you should know that fish aren't as foolish as most might think. Keep casting your line in the same waters, and you'll find that fewer folk'll take the bait."},{"name":"SISIPU","text":"Bring me three harbor herring, <span class=\"highlight\">Forename</span>. This will test both your ability to use pill bugs as bait, and your ability to count."},{"name":"SISIPU","text":"There's nothing better than salted harbor herring. Save for perhaps fried harbor herring. Or grilled...no, definitely salted."},{"name":"WAWALAGO","text":"You know, in the yesteryears of my youth, I used to use every fish I yanked out to yield a bigger one. A good gamble until the game got gargantuan! I guess I got greedy."},{"name":"SISIPU","text":"Wh-Where did you─ <span class=\"emphasis\">Well</span>, sometimes it's best to throw back the big ones."},{"name":"WAWALAGO","text":"Good gods, what's a guildmaster got to do to garner a grain of gratitude?"},{"name":"SISIPU","text":"Acting respectable would be a start!"},{"name":"WAWALAGO","text":"Respectable!? I sailed the seas and snared everything that swam in them!"},{"name":"SISIPU","text":"And that would be an accomplishment, if by “everything that swam in them” you meant “fish,” and not “lady divers.” All you ever brought back were stories about carousing with trollops!"},{"name":"SISIPU","text":"&lt;sigh&gt; But chauvinism is just a red herring. The <span class=\"emphasis\">harbor</span> herring are what's important, namely the lesson of thinking from the perspective of the fish when selecting bait."},{"name":"SISIPU","text":"In that regard, I can say you truly have the mind of a fish, so here is a treat."},{"name":"SISIPU","text":"Some of it might seem like gibberish at first, but as you make observations and jot down notes, eventually, all of it will be gibberish!"},{"name":"SISIPU","text":"Well, take some time to study up, but be careful not to fry your fish brain─you'll need it for your next lesson."},{"name":"SYSTEM","text":"The <span class=\"highlight\">fishing log</span> is a chronicle of your experiences as a fisher."},{"name":"SYSTEM","text":"Peruse the <span class=\"highlight\">Fish Guide</span> for fishing locations and detailed fish data, or reflect upon your accomplishments by reviewing your <span class=\"highlight\">Records</span>."}],"reward":{"items":[{"id":2572},{"num":99,"id":2588},{"id":3310,"one":1},{"id":3532,"one":1},{"num":2,"id":5823,"one":1}],"xp":1148},"reqs":{"jobs":[{"lvl":5,"id":19}],"quests":[66644]},"next":[66646]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"item","id":"2572","obj":{"i":2572,"n":"Maple Fishing Rod","l":8,"c":38202,"t":32,"p":274}},{"type":"item","id":"2588","obj":{"i":2588,"n":"Crayfish Ball","l":5,"c":27008,"t":33,"p":2}},{"type":"item","id":"3310","obj":{"i":3310,"n":"Leather Culottes","l":5,"c":45127,"t":36,"p":135}},{"type":"item","id":"3532","obj":{"i":3532,"n":"Hempen Work Gloves","l":6,"c":44022,"t":37,"p":145}},{"type":"item","id":"5823","obj":{"i":5823,"n":"Allagan Tin Piece","l":5,"c":26001,"t":61}},{"type":"item","id":"4874","obj":{"i":4874,"n":"Harbor Herring","l":7,"c":29044,"t":47}},{"type":"quest","id":"66644","obj":{"i":66644,"n":"My First Fishing Rod","g":146,"l":"Limsa Lominsa","s":11,"f":1}},{"type":"quest","id":"66646","obj":{"i":66646,"n":"The Princess and the Fish","g":146,"l":"Limsa Lominsa","s":100,"f":1}}]}