{"quest":{"name":"A Game of Cat and Fish","location":"Limsa Lominsa","id":66649,"patch":2.0,"sort":250,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000857,"genre":146,"usedItems":[4963],"journal":["Sisipu would have you learn a new technique.","Using the technique the acting guildmaster has termed “fishwheeling” (more widely known as mooching), you are to use a crayfish ball to catch a striped goby, and then recast the goby in order to catch a shadow catfish. The fish can be found in the waters surrounding Fallgourd Float in the North Shroud.","Sisipu expresses her gratitude for the shadow catfish and seems genuinely impressed by how far you have come in the field of fishing.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 30."],"objectives":["Deliver a shadow catfish to Sisipu."],"dialogue":[{"name":"SISIPU","text":"You're familiar with the Culinarians' Guild, aren't you, <span class=\"highlight\">Forename</span>? If you couldn't tell by its supercilious name, their members are a finicky bunch, particularly the fussy Master Lyngsath."},{"name":"SISIPU","text":"So when he comes asking for shadow catfish, no other fish will do, even if I kindly explain that fishing one out involves an arduous journey to Fallgourd Float followed by grueling labor. Naturally, I thought of you for the task."},{"name":"SISIPU","text":"This will likely require a bit of “fishwheeling,” if you know what I mean, though I imagine you do not, as I just invented that word. It means recasting a fish you've just caught as bait for a yet larger fish."},{"name":"SISIPU","text":"In my wisdom, I have deemed that your fishing prowess, land-faring acumen, and physical presence directly in front of me qualify you as the ideal candidate for the job."},{"name":"SISIPU","text":"I have no doubts you'll be more than amply capable of fishwheeling or any other new terms I see fit to conjure up, for that matter."},{"name":"SISIPU","text":"Simply use crayfish balls to catch a striped goby, then recast that to catch the shadow catfish."},{"name":"SISIPU","text":"Take it from the inventor of fishwheeling: since the striped goby will become your lure, you'll want to catch the biggest, shiniest one you can find."},{"name":"SISIPU","text":"A long journey lies ahead of you, and I fear the guild will not be the same in your absence. However, I choose to think of it not as losing a friend, but gaining a shadow catfish. Good luck!"},{"name":"SYSTEM","text":"Fishwheeling, or <span class=\"highlight\">mooching</span> as it is more widely known, involves catching a large fish and then recasting your line with the fish still on it in an attempt to land even larger prey. A high <span class=\"highlight\">perception</span> rating will increase your chances of catching fish of large size."},{"name":"SISIPU","text":"You'll find the catfish you seek at Fallgourd Float in the North Shroud. Mayhap it's a tad presumptuous to say you <span class=\"emphasis\">will</span> find one, but that's where they are, at any rate."},{"name":"SISIPU","text":"Lyngsath ought to crack a smile when he glimpses this beauty."},{"name":"SISIPU","text":"They say never to look a gift fish in the mouth, but one can't help but stare at that gaping grimace─it looks like it could swallow a person whole!"},{"name":"SISIPU","text":"I'm sure the fish of Gridania are none too displeased to see this one leave the water."},{"name":"SISIPU","text":"I heard that yarzons covet the fish too, sometimes migrating north and attacking fishermen in hopes of stealing the catch. Suppose I should've warned you about that ahead of time."},{"name":"SISIPU","text":"Still, I don't see what all the fuss is about. For all the lengths one need travel and dangers one need brave, the fish tastes little better than mud..."},{"name":"WAWALAGO","text":"Pssst! Pardon me, but perhaps I might persuade you to prepare them in a proper bath? Water washes off the waste you can wipe away, but the invisible vapors only vanish with vinegar! You must mind the mud you can't see."},{"name":"SISIPU","text":"Speaking of the mud you can't see, where did you come out of all of a sudden!?"},{"name":"WAWALAGO","text":"A good guildmaster gusts in and goes out a gale. Now you see me, now you don't!"},{"name":"SISIPU","text":"Actually, I think we both still see you standing right there."},{"name":"SISIPU","text":"But that is neither here nor there. <span class=\"highlight\">Forename</span>─there are few fishermen who could haul in the catch you did today."},{"name":"SISIPU","text":"Frankly, I've started to wonder how we ever got along without you!"}],"reward":{"gil":557,"items":[{"id":2576},{"num":99,"id":2595},{"id":3092,"one":1},{"id":3351,"one":1},{"id":3578,"one":1},{"id":3810,"one":1},{"num":4,"id":5824,"one":1}],"xp":47600},"reqs":{"jobs":[{"lvl":25,"id":19}],"quests":[66648]},"next":[66650]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"item","id":"2576","obj":{"i":2576,"n":"Yew Fishing Rod","l":25,"c":38206,"t":32,"p":1795}},{"type":"item","id":"2595","obj":{"i":2595,"n":"Bass Ball","l":25,"c":27010,"t":33,"p":6}},{"type":"item","id":"3092","obj":{"i":3092,"n":"Velveteen Coatee of Gathering","l":27,"c":42198,"t":35,"p":1812}},{"type":"item","id":"3351","obj":{"i":3351,"n":"Velveteen Sarouel of Gathering","l":25,"c":45178,"t":36,"p":1099}},{"type":"item","id":"3578","obj":{"i":3578,"n":"Fingerless Goatskin Gloves of Gathering","l":25,"c":44062,"t":37,"p":1282}},{"type":"item","id":"3810","obj":{"i":3810,"n":"Goatskin Crakows of Gathering","l":25,"c":46156,"t":38,"p":1172}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"item","id":"4963","obj":{"i":4963,"n":"Shadow Catfish","l":27,"c":29249,"t":47}},{"type":"quest","id":"66648","obj":{"i":66648,"n":"A Fish in Hot Water","g":146,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"66650","obj":{"i":66650,"n":"Like Fish Passing in the Night","g":146,"l":"Limsa Lominsa","s":300,"f":1}}]}