{"quest":{"name":"A Fish out of Water","location":"Limsa Lominsa","id":66651,"patch":2.0,"sort":350,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1003628,"involved":[1004962],"genre":146,"usedItems":[5033],"journal":["Sisipu would send you to Thanalan to aid Tocktix once more.","The merchant Tocktix has returned to the Fishermen's Guild once more, this time in search of a desert catfish, which is a key ingredient in one of his favorite dishes. Unaware how a fisher might pull anything from sand, Sisipu recommends that you seek out U'goromuli, a dunefishing acquaintance of Tocktix's and a resident of Forgotten Springs in southern Thanalan.","Though she would never eat desert catfish herself, U'goromuli is more than happy to assist you. She advises you to seek out a fishing hole east of Byregot's Strike, near an Amalj'aa encampment, and use sand leeches to catch your quarry. Once acquired, deliver the fish to Tocktix outside the Fishermen's Guild.","Tocktix is ecstatic to receive his prized gourmet catfish. He promptly informs you that he shall waste no time in taking it to the Bismarck, where he has reserved a table for one after closing.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 40."],"objectives":["Speak with U'goromuli at Forgotten Springs.","Deliver a desert catfish to Tocktix."],"dialogue":[{"name":"SISIPU","text":"Your goblin friendlyfriend was looking for you earlier. He was hoping you'd make his fishiest fantasies come true."},{"name":"SISIPU","text":"He recalled a dish that tickled his fancy some years ago, and now needs you to procure the necessary fish for him."},{"name":"SISIPU","text":"This desert catfish, as it is apparently called, is indigenous to─and this is the truly mind-boggling part─the desert, of all places."},{"name":"SISIPU","text":"Tocktix spoke of a trapper named U'goromuli who'd fished one out of Forgotten Springs in the southern reaches of Thanalan. If you want that catfish, you'd best go and speak with her."},{"name":"UGOROMULI","text":"Friend of Tocktix, you say? Sure, dunefished my fair share of desert catfish. "},{"name":"UGOROMULI","text":"Never eat them, though, know that much. Only ever use them as sandworm bait."},{"name":"UGOROMULI","text":"Thought of eating desert catfish hadn't occurred to me until the goblin devoured it before my eyes. Still wouldn't touch them myself."},{"name":"UGOROMULI","text":"Different fish for different folk, as they say. No problem fishing them out, though. Can even tell you how it's done."},{"name":"UGOROMULI","text":"Just comes down to the right bait in the right place. Nothing to it, really. "},{"name":"UGOROMULI","text":"Easy as dropping a line with some sand leeches at the fishing hole east of Byregot's Strike, near the Amalj'aa encampment."},{"name":"UGOROMULI","text":"Not the same as sea fishing here in the dunes, mind you. Real test of your reel out here."},{"name":"UGOROMULI","text":"Trick is to hold on when it flails. Only takes one to make a day's haul. Good hunting."},{"name":"TOCKTIX","text":"Pshhh... Shkohhh...<br>Fishbringer find tastyfresh fishcat in sandylands for friendlyfriend Tocktix?"},{"name":"TOCKTIX","text":"Pshhh... Shkohhh...<br>Tocktix is thanksgiving to fishbringer for lipsmacking fishcat!"},{"name":"TOCKTIX","text":"Fishcat nosestrings make for strengthful satchelstrands."},{"name":"TOCKTIX","text":"Tocktix trades tongueflaps with Lyngsath for fancycooking of fishcat in Bismarck! Lyngsath only fancycooks after shoplock because of strengthful fishcat odor. Fishbringer makes Tocktix one happygobbie!"}],"reward":{"items":[{"id":2579},{"num":99,"id":2599},{"id":3129,"one":1},{"id":2778,"one":1},{"id":3613,"one":1},{"id":3843,"one":1},{"num":4,"id":5825,"one":1}],"xp":117260},"reqs":{"jobs":[{"lvl":35,"id":19}],"quests":[66650]},"next":[66652]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1003628","obj":{"i":1003628,"n":"Tocktix","l":29,"q":2}},{"type":"npc","id":"1004962","obj":{"i":1004962,"n":"U'goromuli","l":45,"q":2}},{"type":"item","id":"2579","obj":{"i":2579,"n":"Horn Fishing Rod","l":37,"c":38209,"t":32,"p":4641}},{"type":"item","id":"2599","obj":{"i":2599,"n":"Honey Worm","l":35,"c":27018,"t":33,"p":8}},{"type":"item","id":"3129","obj":{"i":3129,"n":"Apprentice's Doublet","l":36,"c":42006,"t":35,"p":4410}},{"type":"item","id":"2778","obj":{"i":2778,"n":"Angler's Hat","l":35,"c":41124,"t":34,"p":2721}},{"type":"item","id":"3613","obj":{"i":3613,"n":"Fingerless Boarskin Gloves of Gathering","l":35,"c":44101,"t":37,"p":3024}},{"type":"item","id":"3843","obj":{"i":3843,"n":"Boarskin Crakows of Gathering","l":35,"c":46217,"t":38,"p":2764}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"5033","obj":{"i":5033,"n":"Desert Catfish","l":37,"c":29609,"t":47}},{"type":"quest","id":"66650","obj":{"i":66650,"n":"Like Fish Passing in the Night","g":146,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"66652","obj":{"i":66652,"n":"Fishing in the Rain","g":146,"l":"Limsa Lominsa","s":400,"f":1}}]}