{"quest":{"name":"I Believe Fish Can Fly","location":"Limsa Lominsa","id":66653,"patch":2.0,"sort":450,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000857,"involved":[1003629,1006804],"genre":146,"usedItems":[5040],"journal":["Sisipu wishes to assign to you another commission from the Brugaire Consortium.","Sisipu hopes that you haven't forgotten your humble roots, despite your recent successes. One such success has earned you a repeat customer, as Sybell of the Brugaire Consortium has come to the guild once more and is waiting outside to commission your services.","The Consortium's latest request is for five cloud cutters, a curious flying fish said to thrive within the Sea of Clouds in Ishgard. So that you might learn how to catch your quarry, Sybell instructs you to seek the advice of Firminnant at Whitebrim Front in the Coerthas central highlands.","Though he clearly does not think you will succeed, Firminnant instructs you to bait your hook with hoverworms, then cast your line into the Sea of Clouds. Should you manage to catch five cloud cutters, return to Limsa Lominsa and deliver them to Sisipu.","Sisipu is intrigued that the cloud cutters truly exist, and that you were able to catch them. Her awe quickly turns to annoyance as the incorrigible Wawalago appears and shares with her one of many rumors regarding the mysterious past of the Consortium's client. Never one to be distracted by rumormongering, however, Sisipu declares that she will simply deliver the fish.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 50."],"objectives":["Speak with Sybell.","Speak with Firminnant at Whitebrim Front.","Deliver cloud cutters to Sisipu."],"dialogue":[{"name":"SISIPU","text":"Oh, so you haven't forgotten the old Fishermen's Guild? Good to see that all the prestige and glamour that accompanies fishing stardom hasn't gone to your head."},{"name":"SISIPU","text":"It's a wonder your head hasn't popped, what with all the sardine and catfish fables inflating your legend to prodigious proportions."},{"name":"SISIPU","text":"And to think, I knew you when you were still dredging anchovies out of the muck!"},{"name":"SISIPU","text":"Rest assured that whatever greatness you go on to achieve, you'll always be the sorry scrap of kelp that floated into the guild one fateful day, as far as I'm concerned."},{"name":"SISIPU","text":"Now, go speak with Sybell and see to her request. Didn't you notice her waiting for you outside?"},{"name":"SYBELL","text":"Ah, <span class=\"highlight\">Forename</span>! The libidinous lords of Ul'dah were terribly excited by the raincallers you reeled in, sending our profits soaring accordingly!"},{"name":"SYBELL","text":"And so I come to lay yet another challenge before you."},{"name":"SYBELL","text":"You have conquered the waves and dunes, but what of the clouds? Only you are heavenly enough to fish the cloud cutters that swim the low skies of Ishgard, within the Sea of Clouds. "},{"name":"SYBELL","text":"I, too, doubted my ears upon hearing of such a fish, but Carvallain's resolve was adamant, and he will hear no protests. Besides, I've never been one to say “no.” "},{"name":"SYBELL","text":"Luckily for us, the Brugaire Consortium has friends in high places─namely, the highlands of Coerthas."},{"name":"SYBELL","text":"You'll want to seek out Firminnant at Whitebrim Front. He will tell you all you need know."},{"name":"SYBELL","text":"Confident you will prevail in your conquest, I have rendered full payment to Sisipu in advance. You need only bring her five cloud cutters to satisfy me."},{"name":"FIRMINNANT","text":"Greetings, traveler. Visitors from Limsa Lominsa are rare to these climes."},{"name":"FIRMINNANT","text":"I am told you seek to fish the magnificent cloud cutters that grace the Sea of Clouds..."},{"name":"FIRMINNANT","text":"As squires, we practice catching our dinner, but the task is trying for even the most experienced among us."},{"name":"FIRMINNANT","text":"How one unaccustomed to the chore might hope to succeed where so many accomplished fishermen have failed is beyond me. But mine is not to stand in the way of foolhardy endeavors."},{"name":"FIRMINNANT","text":"The fish float upon inflating pockets of vapor, allowing them to ride currents of air. They are thus able to escape predators and take refuge in the clouds. Moreover, an aerial fish requires an aerial worm, in this case hoverworms."},{"name":"FIRMINNANT","text":"Such is the extent of the knowledge that I will confer unto you. I fear the remainder is a matter of experience and skill. I should wish you good luck─you will surely need it."},{"name":"SISIPU","text":"So, you're to pluck five cloud cutters from the skies of Coerthas. Are we certain these aren't birds?"},{"name":"SISIPU","text":"The fabled cloud cutters! It turns out they weren't birds, after all!"},{"name":"WAWALAGO","text":"Just like jellyfish, they jump, jerk, and jolt to jiggle themselves up."},{"name":"SISIPU","text":"Well! Speaking of things that float around aimlessly..."},{"name":"WAWALAGO","text":"Ishgardians consider the cloud cutter a crest of class and character, and confer them to commemorate and congratulate countrymen who commit conduct “a cut above the clouds,” if you will."},{"name":"SISIPU","text":"I won't. But what use would it be to Carvallain?"},{"name":"WAWALAGO","text":"Local lore alleges that a legendary Elezen in Limsa Lominsa is actually an Ishgardian lord. I wonder what you'd do if it were Carvallain?"},{"name":"SISIPU","text":"I would do what I'm going to do anyway─deliver the fish!"}],"reward":{"items":[{"id":2581},{"num":99,"id":2621},{"id":2837,"one":1},{"id":3909,"one":1},{"id":3188,"one":1},{"id":3653,"one":1},{"num":2,"id":5826,"one":1}],"xp":204930},"reqs":{"jobs":[{"lvl":45,"id":19}],"quests":[66652]},"next":[66654]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1003629","obj":{"i":1003629,"n":"Sybell","l":29,"q":3}},{"type":"npc","id":"1006804","obj":{"i":1006804,"n":"Firminnant","l":63,"q":1}},{"type":"item","id":"2581","obj":{"i":2581,"n":"Rosewood Fishing Rod","l":43,"c":38210,"t":32}},{"type":"item","id":"2621","obj":{"i":2621,"n":"Krill Cage Feeder","l":40,"c":27053,"t":33,"p":9}},{"type":"item","id":"2837","obj":{"i":2837,"n":"Felt Coif of Gathering","l":45,"c":41598,"t":34,"p":4158}},{"type":"item","id":"3909","obj":{"i":3909,"n":"Raptorskin Workboots","l":48,"c":46215,"t":38,"p":5900}},{"type":"item","id":"3188","obj":{"i":3188,"n":"Woolen Doublet","l":46,"c":42219,"t":35,"p":6680}},{"type":"item","id":"3653","obj":{"i":3653,"n":"Fingerless Raptorskin Gloves of Gathering","l":45,"c":44103,"t":37,"p":4620}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"item","id":"5040","obj":{"i":5040,"n":"Cloud Cutter","l":48,"c":29655,"t":47}},{"type":"quest","id":"66652","obj":{"i":66652,"n":"Fishing in the Rain","g":146,"l":"Limsa Lominsa","s":400,"f":1}},{"type":"quest","id":"66654","obj":{"i":66654,"n":"So Long, and Thanks for All the Fish","g":146,"l":"Limsa Lominsa","s":500,"f":1}}]}