{"quest":{"name":"A Relic Reborn (Stardust Rod)","location":"North Shroud","id":66659,"patch":2.0,"sort":7,"icon":100165,"unlocksFunction":1,"eventIcon":71341,"issuer":1003075,"target":1003075,"involved":[1001304,1004582,1008161],"genre":154,"usedItems":[2102,2135,6267],"journal":["Gerolt has the air of a man defeated.","Gerolt has reluctantly agreed to lend his expertise to the restoration of a legendary arm of yore. For the first step, the weaponsmith bids you venture within U'Ghamaro Mines in outer La Noscea to retrieve the lost Stardust Rod. Search for a vessel in which the valuable relic might be kept.","You have obtained the timeworn Stardust Rod. Make your way back to Hyrstmill and present the relic to Gerolt.","According to Gerolt, the restoration process involves merging the old with the new─that is, embedding the original relic in a new host weapon. To this end, you must bring him a sanguine scepter melded with two grade three savage might materia.","You have delivered the materia-enhanced sanguine scepter to Gerolt. The weaponsmith next directs you to go to the Weeping Saint in the Coerthas central highlands, and obtain alumina salts from the dhorme chimera.<br><br>※The dhorme chimera can be confronted via the Duty Finder upon examining the quest destination.<br>※This objective must be completed as a black mage.","You have painstakingly obtained the pinch of alumina salts. Make your way back to Hyrstmill and deliver it to Gerolt.","Using the alumina salts you brought him, Gerolt adds the finishing touches to your relic weapon. Even as he declares his work over, however, the man believes that there is still something incomplete about it. In order to shed light upon the mystery, Gerolt suggests that you seek out literature surrounding the hero associated with the relic. Perhaps the trader Rowena back at Revenant's Toll will be able to assist you in this endeavor.","You have consulted Rowena, who agrees to procure the literature you seek...for a price. For your part of the deal, you must obtain for her an Amdapor glyph. Make your way through Amdapor Keep in the South Shroud, and procure this artifact.<br><br>※Amdapor Keep can be accessed via the Duty Finder.<br>※This objective must be completed as a black mage.","You have successfully obtained an Amdapor glyph. Make your way back to Revenant's Toll and deliver it to Rowena.","You give the Amdapor glyph to Rowena, who upholds her promise and furnishes you a copy of <span class=\"emphasis\">On Verdant Pond</span>. You now possess literature on the hero who once wielded the relic weapon. Gerolt the weaponsmith will be keen to peruse it.","After a cursory examination of the text, Gerolt declares that he will require some time to make sense of its contents. In the meantime, you are to familiarize yourself with the restored weapon in its current state. Arm yourself with the unfinished Stardust Rod, make your way to U'Ghamaro Mines in outer La Noscea, and there slay eight U'Ghamaro quarrymen, eight U'Ghamaro priests, and eight U'Ghamaro bedesmen.","You have defeated the specified kobolds. Return to Hyrstmill and report your success to Gerolt.","Upon your return, Gerolt deduces that you must face mightier adversaries if you are to experience a revelation pertaining to your relic. To this end, he bids you challenge the hydra within Halatali, the abandoned training grounds situated in eastern Thanalan. Armed with the unfinished Stardust Rod, enter Halatali and defeat the hydra.<br><br>※The hydra can be confronted via the Duty Finder upon examining the quest destination.","You have overcome the hydra. Take word of your accomplishment back to Gerolt at Hyrstmill.","Combining information gleaned from the text with your firsthand experience, Gerolt has ascertained what must be done next. Hand over the unfinished Stardust Rod to the weaponsmith.","Gerolt declares that but one step remains in the restoration. In order to create the raging fire that he needs, the weaponsmith bids you fetch him a white-hot ember, a howling gale, and a chunk of hyperfused ore. The first of these can be obtained by defeating Ifrit within the Bowl of Embers (Hard).<br><br>※The Bowl of Embers (Hard) can be accessed via the Duty Finder.<br>※This objective must be completed as a black mage.","You have extinguished the Lord of the Inferno and obtained a white-hot ember. Next, take on Garuda in the Howling Eye (Hard) and defeat her to obtain a howling gale.<br><br>※The Howling Eye (Hard) can be accessed via the Duty Finder.<br>※This objective must be completed as a black mage.","You have silenced the Lady of the Vortex and obtained a howling gale. Next, take on Titan in the Navel (Hard) and defeat him to obtain a chunk of hyperfused ore.<br><br>※The Navel (Hard) can be accessed via the Duty Finder.<br>※This objective must be completed as a black mage.","You have buried the Lord of Crags and obtained a chunk of hyperfused ore. Deliver it along with the white-hot ember and the howling gale to Gerolt.","You have delivered the three items Gerolt requires to create a raging fire. Now he only wants for a bottle of Radz–at–Han quenching oil to complete the restoration of your relic. Obtain this item and deliver it to the weaponsmith.","You have delivered the bottle of Radz–at–Han quenching oil to Gerolt, who promptly sees to the final stage of the restoration process. After no small amount of effort and perseverance, you are now the proud owner of the Stardust Rod. May it serve you well in your adventures to come!"],"objectives":["Obtain the timeworn Stardust Rod from a treasure coffer in U'Ghamaro Mines.","Deliver the timeworn Stardust Rod to Gerolt.","Deliver a materia-enhanced sanguine scepter to Gerolt.","Examine the destination at the Weeping Saint and, as a black mage, use the Duty Finder to complete the trial “A Relic Reborn: The Chimera.”","Deliver the alumina salts to Gerolt.","Speak with Rowena at Revenant's Toll.","Obtain an Amdapor glyph by completing Amdapor Keep as a black mage.","Deliver the Amdapor glyph to Rowena.","Deliver the copy of <span class=\"emphasis\">On Verdant Pond</span> to Gerolt.","Slay U'Ghamaro quarrymen while equipped with the unfinished Stardust Rod.","Slay U'Ghamaro priests while equipped with the unfinished Stardust Rod.","Slay U'Ghamaro bedesmen while equipped with the unfinished Stardust Rod.","Speak with Gerolt.","Examine the destination outside Halatali and, with the unfinished Stardust Rod equipped, use the Duty Finder to complete the trial “A Relic Reborn: The Hydra.”","Speak with Gerolt.","Give the unfinished Stardust Rod to Gerolt. ","Obtain a white-hot ember in the Bowl of Embers (Hard) as a black mage.","Obtain a howling gale in the Howling Eye (Hard) as a black mage.","Obtain a chunk of hyperfused ore in the Navel (Hard) as a black mage.","Deliver the requested items to Gerolt.","Deliver a bottle of Radz–at–Han quenching oil to Gerolt."],"dialogue":[{"name":"GEROLT","text":"Jus' let me make one thing clear: it might be as I'm repairin' kettles to pay for yesterday's mead, but I still got me pride as a master weaponsmith. Ye'll get no less than the finest out of me forge."},{"name":"GEROLT","text":"An' it might be as ye've got that godsdamned slip of paper, but it'll only get ye so much. Restorin' relics like these calls for some rare ol' materials, an' I ain't got none. So if you want the job done, ye'll have to run along an' fetch 'em for me."},{"name":"GEROLT","text":"So, what is it ye want restored?"},{"name":"GEROLT","text":"What? A relic weapon for...black magic, the arcane art of destruction? Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, but that's a new one on me. Hm? What's that ye say?"},{"name":"GEROLT","text":"Uh-huh... So this Ququruka bloke had a rod what looked like a comet, did he?"},{"name":"GEROLT","text":"Well, that could only be a Stardust Rod─assumin' yer admirably vivid description was accurate. A number o' these were made, accordin' to tomes datin' back to the Fifth Astral Era."},{"name":"GEROLT","text":"Ages ago, there lived a female mage of no small repute who was known by all sorts of unsavory epithets. “Death's Handmaiden” was one, “The Black Witch” was another...an' the proper half-wits called her “She-Devil.” Her name was, er...Shantotto. Or was it Shatoto? Ah, right─<span class=\"emphasis\">Shatotto</span>. Aye, that's the one."},{"name":"GEROLT","text":"The woman's credited with devisin' countless destructive magicks, an' for a pastime indulged in creatin' enchanted arms, the most famous among 'em bein' the Stardust Rod."},{"name":"GEROLT","text":"This goes without sayin', but none save their creator knows how they were made. Lucky for us, though, I have an inklin' as to where we might find one of the <span class=\"emphasis\">actual</span> relics. An' once I've got one in me hands, I doubt it'll take me long to unravel its secrets."},{"name":"GEROLT","text":"Some years ago, a Stardust Rod was put up for sale at a Lominsan auction for plundered goods."},{"name":"GEROLT","text":"No one knew for sure if it was the genuine article, but it didn't take long for the various bidders to talk 'emselves into thinkin' it was, an' a proper scramble looked to be in the offin'."},{"name":"GEROLT","text":"Ah, but ye'll never guess what happened: scarcely a bell afore the auction was due to start, kobolds attacked the pirates' storehouse an' plundered all the plunder. Irony at its finest, eh!?"},{"name":"GEROLT","text":"Anyroad, in all likelihood, the rod now rests inside U'Ghamaro Mines, collectin' dust. So that's where ye'll need to take yerself."},{"name":"GEROLT","text":"Some years ago, a Stardust Rod was put up for sale at a Lominsan auction for plundered goods."},{"name":"GEROLT","text":"No one knew for sure if it was the genuine article, but it didn't take long for the various bidders to talk 'emselves into thinkin' it was, an' a proper scramble looked to be in the offin'."},{"name":"GEROLT","text":"Ah, but ye'll never guess what happened: scarcely a bell afore the auction was due to start, kobolds attacked the pirates' storehouse an' plundered all the plunder. Irony at its finest, eh!?"},{"name":"GEROLT","text":"Anyroad, in all likelihood, the rod now rests inside U'Ghamaro Mines, collectin' dust. So that's where ye'll need to take yerself."},{"name":"GEROLT","text":"Well, bugger me... Never in me wildest, drunkest dreams did I imagine ye'd actually find the bloody thing... Bah, so I'll have to fire up the forge, after all."},{"name":"GEROLT","text":"Havin' said that, the relic's in far worse shape than I thought. It ain't like to survive much poundin' in this state. Truth be told, I'd be worried about sneezin' near it."},{"name":"GEROLT","text":"&lt;sigh&gt; We're gonna need a new host what'll give itself for the restoration."},{"name":"GEROLT","text":"Bring me a sanguine scepter, one with two grade three savage might materia melded to it. This'll serve as the vessel for the restored relic."},{"name":"GEROLT","text":"Remember, that's <span class=\"emphasis\">two</span> grade three savage might materia. Aught less, an' ye'll get naught from me, no matter how many slips of paper ye wave in me face."},{"name":"GEROLT","text":"Ye need to bring me a sanguine scepter, one with two grade three savage might materia melded to it. This'll serve as the vessel for the restored relic."},{"name":"GEROLT","text":"Hm? Aye, I could hammer one out in me sleep, but then I could wipe yer arse without much trouble, an' I ain't plannin' on doin' that neither! Seems ye'll jus' have to do both yerself, eh?"},{"name":"GEROLT","text":"Ah, 'tis a fine base ye've brought me. Aye, jus' the thing to host yer relic."},{"name":"GEROLT","text":"I've merged what was left of the relic with the host weapon, so the groundwork's done. But don't go jumpin' for joy jus' yet─there's still more to do."},{"name":"GEROLT","text":"I need to work on the finishin' touches, but due to the reinforcement work I've had to do, the weapon's provin' rather stubborn to shape."},{"name":"GEROLT","text":"To get 'round this, we'll be needin' some alumina salts, a substance made by grindin' a rock called alumina into fine grains. Unlucky for ye, though, it ain't easy to get hold of."},{"name":"GEROLT","text":"Mayhap ye already know this, but there's beasties out there what devour their prey whole. An' some of 'em swallow rocks so as to aid with digestion."},{"name":"GEROLT","text":"The dhorme chimera what terrorizes the central highlands o' Coerthas happens to swallow alumina salts for this purpose."},{"name":"GEROLT","text":"Slay the bugger an' bring me the alumina salts, an' I'll see to the finishin' touches on yer weapon."},{"name":"SYSTEM","text":"The dhorme chimera can be confronted via the Duty Finder upon examining the quest destination situated at the Weeping Saint in the Coerthas central highlands."},{"name":"SYSTEM","text":"Please note that the trial “A Relic Reborn: The Chimera” must be completed as a black mage."},{"name":"GEROLT","text":"Jus' a dozen more kettles, then it's off to the tav─<br><span class=\"emphasis\">You</span> again!? What in the seven hells do ye want this time!?"},{"name":"GEROLT","text":"Forgotten what to bring, eh? Gods' sake, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, ye've got the memory of a bleedin' whatsit!"},{"name":"GEROLT","text":"Slay the dhorme chimera an' bring me alumina salts, an' I'll see to the finishin' touches on yer weapon."},{"name":"SYSTEM","text":"The dhorme chimera can be confronted via the Duty Finder upon examining the quest destination situated at the Weeping Saint in the Coerthas central highlands."},{"name":"SYSTEM","text":"Please note that the trial “A Relic Reborn: The Chimera” must be completed as a black mage."},{"name":"GEROLT","text":"...An' o' course, the adventurer comes back triumphant. &lt;sigh&gt; Should've bloody known not even the chimera would be able to put ye out o' me misery."},{"name":"GEROLT","text":"Hand over those alumina salts, an' I'll get right to work."},{"name":"GEROLT","text":"There, the deed's done. I've squeezed out every onze of me skill to restore yer weapon, an' I think ye'll agree it looks the part."},{"name":"GEROLT","text":"Yet there's summat...missin' somehow, though I'm buggered if I know what. The piece jus' lacks a certain <span class=\"emphasis\">glow</span>, as it were."},{"name":"GEROLT","text":"We need to learn more about the relic. Literature surroundin' the hero associated with it would be a fine place to begin...but I ain't exactly a scholarly an' haven't the slightest inklin' where to get me hands on such stuff."},{"name":"GEROLT","text":"As much as I hate to say this, Rowena's probably the one to talk to. Thing is, I'd sooner shove hot kettles up me arse sideways than owe that thrice-damned harridan another debt."},{"name":"GEROLT","text":"Yer gonna have to make yerself useful once again. Take yerself to Rowena an' ask for her help, an' return here once ye've learned summat what might be of use."},{"name":"ROWENA","text":"You're lookin' a bit more run-down than before. Your dealin's with Gerolt takin' their toll? Actually, forget I even asked. My mouth tastes o' bile if I so much as <span class=\"emphasis\">think</span> o' that sorry specimen. So, is there somethin' you need?"},{"name":"ROWENA","text":"...Literature on the hero of old who once wielded your weapon?"},{"name":"ROWENA","text":"Hm, I reckon I can find what you need. Might take a bit o' time, is all."},{"name":"ROWENA","text":"'Course, this ain't a charity I'm runnin' here. I can get you what you want, but you'll have to do likewise for me."},{"name":"ROWENA","text":"I'll track down literature on Death's Handmaiden, Shatotto."},{"name":"ROWENA","text":"For your part, you're to bring me an Amdapor glyph. You'll find this inside Amdapor Keep, a ruined castle situated in the South Shroud."},{"name":"ROWENA","text":"Clear on the deal? Then run along and fulfill your part of it."},{"name":"ROWENA","text":"Ah, good <span class=\"alternative-container\"><span class=\"alternative\">on you</span><span class=\"alternative\">lad</span></span>! This is exactly what I was after. You've honored your part o' the bargain, and so I'll do the same."},{"name":"GEROLT","text":"Back to pester me so soon? Judgin' from that smirk on yer face, I take it ye've found what ye need?"},{"name":"GEROLT","text":"Aye, this text is about Death's Handmaiden, Shatotto, all right. But gods, would it have killed the bugger that wrote it to use normal bloody words!?"},{"name":"GEROLT","text":"It'll take me bleedin' <span class=\"emphasis\">moons</span> to get through this lot─time I could be spendin' on kettles! Gah...while I try to make head or tail of it all, why don't ye take this here unfinished Stardust Rod an' try it out?"},{"name":"GEROLT","text":"As I mentioned before, it's still missin' summat, but it's all there shape-wise, meanin' it should serve ye jus' fine as an ordinary weapon."},{"name":"GEROLT","text":"Seein' as yer a ripe ol' black mage, mayhap ye'll be able to feel out exactly what it wants for."},{"name":"GEROLT","text":"That's to say, get out there an' fight some nasty foes, as Shatotto herself must've done back in the day."},{"name":"GEROLT","text":"U'Ghamaro Mines over in outer La Noscea oughta serve yer needs─aye, the same place ye found the rod. Pit yerself against some U'Ghamaro quarrymen, bedesmen, an' priests─eight of each, say─then come back an' tell me what ye've gleaned."},{"name":"GEROLT","text":"With the information in the text an' yer firsthand experience, I reckon we'll solve this puzzle yet."},{"name":"GEROLT","text":"I want ye to get out there an' fight some nasty foes, as Shatotto herself must've done back in the day."},{"name":"GEROLT","text":"U'Ghamaro Mines over in outer La Noscea oughta serve yer needs. Pit yerself against some U'Ghamaro quarrymen, priests, an' bedesmen─eight of each, say─then come back an' tell me what ye've gleaned."},{"name":"EPICMOOGLE","text":"You mustn't lose your relic, kupo! I went to great pains to retrieve it, so promise me you'll take better care of it!"},{"name":"GEROLT","text":"Back already? By the frown yer wearin', I take it ye've got nothin' to show for yer time with the kobolds."},{"name":"GEROLT","text":"Hmmm, might be as ye want for better sport. An' I know jus' the creature what'll give it to ye─the hydra what reigns over the fiends within Halatali. A nasty piece of work, that. Try not to piss yer britches when ye see it."},{"name":"SYSTEM","text":"The hydra can be confronted via the Duty Finder upon examining the quest destination situated by the entrance to Halatali in eastern Thanalan."},{"name":"SYSTEM","text":"Please note that the trial “A Relic Reborn: The Hydra” must be completed while equipped with the unfinished Stardust Rod."},{"name":"FAFAJONI","text":"We Immortal Flames have managed to cull most of the feral denizens of Halatali, but the hydra still remains. Frankly, we're out of our─"},{"name":"FAFAJONI","text":"What!? You mean to face the fell creature!? To be sure, we would be grateful if you could rid us of it, but I must warn you of the dangers. Survival is <span class=\"emphasis\">not</span> guaranteed."},{"name":"SYSTEM","text":"In order to challenge the hydra, you must be equipped with the unfinished Stardust Rod."},{"name":"GEROLT","text":"Bloody hells, not <span class=\"emphasis\">you</span> again! Can't a man have a moment's bleedin' rest!? I've barely had time to <span class=\"emphasis\">piss</span> since you gave me that damnable text."},{"name":"GEROLT","text":"Readin' the thing's given me a fierce bloody headache...which yer makin' worse by houndin' me!"},{"name":"GEROLT","text":"Do me a favor an' make yerself scarce, will ye? Go an' play with yer bloody Stardust Rod or summat."},{"name":"EPICMOOGLE","text":"You mustn't lose your relic, kupo! I went to great pains to retrieve it, so promise me you'll take better care of it!"},{"name":"GEROLT","text":"Yer... Yer still alive! Why the hells do you adventurers have to be so godsdamned sturdy!? I was bloody <span class=\"emphasis\">sure</span> ye'd be hydra dung by now... &lt;sigh&gt;"},{"name":"GEROLT","text":"But what's done is done...or in this case, <span class=\"emphasis\">not</span> done. Anyroad, let's talk about that text ye brought. It contains endless anecdotes of Shatotto's spine-chillin' endeavors."},{"name":"GEROLT","text":"As ye likely know, the woman was unsurpassed in her gift for destructive magicks. What ye might <span class=\"emphasis\">not</span> know is that she was also prone to fits of boredom─a fine recipe for mayhem."},{"name":"GEROLT","text":"Durin' one of her many bouts of ennui, Shatotto thought it'd be a jolly jape to cast Meteor, the ancient spell used to bring down a star. An' cast it she did..."},{"name":"GEROLT","text":"When even <span class=\"emphasis\">that</span> didn't cure her bloody boredom, she decided to forge a rod usin' fragments of the fallen star─which is how the Stardust Rod came to be born."},{"name":"GEROLT","text":"If we're to do a proper job of restorin' the rod, we're gonna need fragments of a star. But even assumin' we <span class=\"emphasis\">could</span> bring one down, I ain't sure we <span class=\"emphasis\">should</span>─like as not the bloody thing would fall on our heads."},{"name":"GEROLT","text":"Ah, but don't despair, 'cause the text goes on to reveal more. It says that the star what fell shattered into a million pieces, each of which merged with whatever it touched. Aye, ye guessed it─dark matter."},{"name":"GEROLT","text":"'Course, I used plain ol' metal to patch the rod up, which is clearly where I went wrong."},{"name":"EPICMOOGLE","text":"You mustn't lose your relic, kupo! I went to great pains to retrieve it, so promise me you'll take better care of it!"},{"name":"GEROLT","text":"As ye can see, I've done me research. I trust ye've also been pullin' yer weight, puttin' the relic to use like I said. Well, go on, then─tell me what ye've learned."},{"name":"GEROLT","text":"Is that so? Aye...I'd wondered about that."},{"name":"GEROLT","text":"Based on what we've gleaned from the text an' yer firsthand experience, I'll rework the relic so as to improve yer affinity with it. Hand it over for a second, will ye?"},{"name":"GEROLT","text":"Based on what we've gleaned from the text an' yer firsthand experience, I'll rework the relic so as to improve yer affinity with it. Hand it over for a second, will ye?"},{"name":"GEROLT","text":"There, the deed's done. That leaves us with one last step."},{"name":"GEROLT","text":"That is, fully mergin' the old relic, the new host, an' the soul of the bearer─aye, that's <span class=\"emphasis\">you</span>. Only then can the weapon be restored to its former glory."},{"name":"GEROLT","text":"But to do this, I need a fire what's hotter than the seventh hell. An' to keep such a fire alive an' ragin', I need a wind what's fiercer than the...than the...er, hangover I had last week. Gah, ye know what I mean!"},{"name":"GEROLT","text":"Jus' get me a white-hot ember, a howlin' gale, an' a chunk o' hyperfused ore, an' I'll finish yer bloody weapon! Ah, an' I need me a bottle o' Radz–at–Han quenchin' oil as well to cool it off!"},{"name":"SYSTEM","text":"The white-hot ember, the howling gale, and the chunk of hyperfused ore can be obtained by defeating Ifrit in the Bowl of Embers (Hard), Garuda in the Howling Eye (Hard), and Titan in the Navel (Hard), respectively."},{"name":"SYSTEM","text":"The bottle of Radz–at–Han quenching oil can be obtained by exchanging 15 Allagan Tomestone of Poetics with Auriana, one of Rowena's assistants at Revenant's Toll."},{"name":"GEROLT","text":"In order to restore yer weapon to its former glory, we need to fully merge the relic with the new host. Oh, aye─an' yer soul. Don't worry, though─it might not hurt much."},{"name":"GEROLT","text":"Get me a white-hot ember, a howlin' gale, an' a chunk of hyperfused ore, an' I'll finish yer bloody weapon."},{"name":"SYSTEM","text":"The white-hot ember, the howling gale, and the chunk of hyperfused ore can be obtained by defeating Ifrit in the Bowl of Embers (Hard), Garuda in the Howling Eye (Hard), and Titan in the Navel (Hard), respectively."},{"name":"SYSTEM","text":"The bottle of Radz–at–Han quenching oil can be obtained by exchanging 15 Allagan Tomestone of Poetics with Auriana, one of Rowena's assistants at Revenant's Toll."},{"name":"GEROLT","text":"So yer back... Never doubted for a second ye'd trounce all three primals an' come back to pester me again."},{"name":"GEROLT","text":"All right, then, let's see the white-hot ember, the howling gale, an' the hyperfused ore."},{"name":"GEROLT","text":"Aye, these oughta get me the levels o' heat I need. Which leaves just the Radz–at–Han quenchin' oil for coolin' things off afterwards. Ye've got that, too, I assume?"},{"name":"SYSTEM","text":"The bottle of Radz–at–Han quenching oil can be obtained by exchanging 15 Allagan Tomestone of Poetics with Auriana, one of Rowena's assistants at Revenant's Toll."},{"name":"GEROLT","text":"Ye've done yer part, an' so I'll do mine."},{"name":"GEROLT","text":"Watch now, an' try not to bat yer eyelids─ain't every day ye get to see a relic reborn!"},{"name":"GEROLT","text":"Muahahaha... MUAHAHAHAHAHA! These gods-given hands've worked yet another miracle! Feast yer eyes on the Stardust Rod, jus' as it was in days of yore! 'Tis a sight to move a man to tears...ye lucky bastard. Ye'd better bloody well take care of it!"},{"name":"SYSTEM","text":"In order to progress further in the quest, you must complete the objectives of Amdapor Keep."},{"name":"SYSTEM","text":"In order to gain access to Amdapor Keep, you must complete the quest “Ghosts of Amdapor.”"},{"name":"SYSTEM","text":"In order to progress further in the quest, you must complete the objectives of the Bowl of Embers (Hard)."},{"name":"SYSTEM","text":"Please note that gaining access to the Bowl of Embers (Hard) requires that you make sufficient progress in the main scenario."},{"name":"SYSTEM","text":"In order to progress further in the quest, you must complete the objectives of the Howling Eye (Hard)."},{"name":"SYSTEM","text":"Please note that gaining access to the Howling Eye (Hard) requires that you make sufficient progress in the main scenario."},{"name":"SYSTEM","text":"In order to progress further in the quest, you must complete the objectives of the Navel (Hard)."},{"name":"SYSTEM","text":"Please note that gaining access to the Navel (Hard) requires that you make sufficient progress in the main scenario."},{"name":"GEROLT","text":"Gods, I've been dry as a bone for the past six bells. M-Mead... Jus' give me enough mead to wet me lips..."},{"name":"SYSTEM","text":"Please note that you can only undertake one “A Relic Reborn” quest at any given time. If you wish to acquire a different relic weapon, you must either complete or abandon the current quest."},{"name":"QIB","text":"Defeat the dhorme chimera!"},{"name":"QIB","text":"Defeat the hydra!"}],"reward":{"items":[{"id":2140}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":26}],"questsType":"all","quests":[66614,66241]}},"partials":[{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1004582","obj":{"i":1004582,"n":"Fafajoni","l":44,"q":11,"t":"Flame Private"}},{"type":"npc","id":"1008161","obj":{"i":1008161,"n":"Portly Moogle","l":57,"q":10}},{"type":"item","id":"2140","obj":{"i":2140,"n":"Stardust Rod","l":80,"c":33012,"t":7,"p":1000}},{"type":"item","id":"2102","obj":{"i":2102,"n":"Sanguine Scepter","l":55,"c":32846,"t":6}},{"type":"item","id":"2135","obj":{"i":2135,"n":"Unfinished Stardust Rod","l":50,"c":33013,"t":7}},{"type":"item","id":"6267","obj":{"i":6267,"n":"Radz-at-Han Quenching Oil","l":1,"c":22636,"t":54}},{"type":"quest","id":"66614","obj":{"i":66614,"n":"Always Bet on Black","g":154,"l":"Eastern Thanalan","s":6,"f":1}},{"type":"quest","id":"66241","obj":{"i":66241,"n":"The Weaponsmith of Legend","g":93,"l":"Western Thanalan","s":500,"f":1}}]}