{"quest":{"name":"Like Fish Passing in the Night","location":"Limsa Lominsa","id":66650,"patch":2.0,"sort":300,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000857,"involved":[1000856,1003628],"genre":146,"usedItems":[4898],"journal":["Sisipu would have you attend to another incomprehensible customer.","Word of your skill with the rod has spread throughout Limsa Lominsa, leading many to seek your services. One such would-be customer is a goblin named Tocktix, though the details of his commission are as yet unknown. Speak with Tocktix to learn more.","Tocktix describes to you the circumstances under which he glimpsed the desired fish, though he himself is unsure what kind it is. Relay Tocktix's description of the fish to Wawalago to ascertain what needs to be done.","Wawalago posits that fullmoon sardines are the fish of which Tocktix speaks─a fish that can only be caught after sunset. Use spoon worms to catch ten sardines along Bloodshore and deliver them to Tocktix at the Fishermen's Guild.","Tocktix is delighted to receive the fullmoon sardines, and in a fit of joy he proclaims you a legendary fishbringer. Let Sisipu know the commission is complete.","Sisipu concurs with Tocktix that your exploits merit a title, but believes there may be an alternative preferable to fishbringer.<br><br>※The next fisher quest will be available from Sisipu upon reaching level 35."],"objectives":["Speak with Tocktix.","Speak with Wawalago.","Deliver fullmoon sardines to Tocktix.","Report to Sisipu."],"dialogue":[{"name":"SISIPU","text":"The catfish you fetched for Lyngsath has raised quite a stir. He was so pleased with the quality and quickness of the delivery that he's been raving about you to anyone in earshot."},{"name":"SISIPU","text":"And now the word swirling around Limsa of a fabled fisher<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> has reached the ears of your fellow guildmates."},{"name":"SISIPU","text":"Though most of them have no idea who you are, it doesn't stop the lazy sunbathers from fabricating folk stories about you."},{"name":"SISIPU","text":"Meanwhile, Chuchuroon's done his part to add to your fame, singing your praises well beyond the walls of the guild."},{"name":"SISIPU","text":"So well beyond the walls, in fact, that goblins have come to enlist your help."},{"name":"SISIPU","text":"Tocktix is a friend of Chuchuroon's, so we're somewhat obligated to hear him out, though I don't expect him to be much more intelligible. Loath though I am to admit it, we'll most likely need Wawalago again."},{"name":"TOCKTIX","text":"Pshhh... Shkohhh...<br>Chuchuroon told many glorytales of mighty fishbringer to Tocktix."},{"name":"TOCKTIX","text":"Tocktix is friend. Chuchuroon is friend. Fishbringer is friendlyfriend, yes? "},{"name":"TOCKTIX","text":"Moon was shining on easterseas of La Noscea when most lovelyfish appeared!"},{"name":"TOCKTIX","text":"Tocktix wonder if friendlyfriend fishbringer can bring back lovelyfish from moonsea?"},{"name":"WAWALAGO","text":"So a goblin gets a glimpse of some gills, and I'm to guess the game?"},{"name":"WAWALAGO","text":"Hah hah! Naturally, I know what you need to net! I'm only surprised you saw fit to solicit my support."},{"name":"WAWALAGO","text":"The moment you mentioned the moon on the easterseas of La Noscea, I figured out the frisky fish you're fixing to fetch."},{"name":"WAWALAGO","text":"Fullmoon sardines!"},{"name":"WAWALAGO","text":"Schools of striplings migrate under moonlight through the Strait of Merlthor to return to their mothers─or meet their makers."},{"name":"WAWALAGO","text":"Tastiest time to take them, too─pluck them plum in their prime."},{"name":"WAWALAGO","text":"From dusk to dawn, droves dip and dive down Bloodshore."},{"name":"WAWALAGO","text":"Spinning spoon worms in the water will snag you some sardines and sate your sponsor."},{"name":"TOCKTIX","text":"Pshhh... Shkohhh...<br>A tenfish of moonfull is for Tocktix?"},{"name":"TOCKTIX","text":"Pshhh... Shkohhh...<br>Yes, fishbringer has brought lovelyfish from moonsea!"},{"name":"TOCKTIX","text":"Ah, first eyecatch of lovelyfish is still fresh in braincase of Tocktix."},{"name":"TOCKTIX","text":"Tocktix has dreamings to taste lovelyfish..."},{"name":"TOCKTIX","text":"Friendlyfriend fishbringer has made true Tocktix's bigdreams!"},{"name":"TOCKTIX","text":"Glorytales of Chuchuroon are no sillybabble. Fishbringer is fishbringer of faerielegends!"},{"name":"TOCKTIX","text":"Tocktix make sure everygobbie knows fishbringer faerielegend!"},{"name":"SISIPU","text":"Congratulations, fishbringer! Fame with fast-trading goblins is liable to bring you fortune."},{"name":"SISIPU","text":"Although you might want to find a less pungent title, so as not to drive away other prospective patrons."},{"name":"SISIPU","text":"But what's in a title? That which we call a fishbringer by any other name would smell as...sweet."}],"reward":{"gil":639,"items":[{"id":2577},{"num":99,"id":2596},{"id":2758,"one":1},{"id":3369,"one":1},{"id":3601,"one":1},{"id":3829,"one":1},{"num":3,"id":5825,"one":1}],"xp":81510},"reqs":{"jobs":[{"lvl":30,"id":19}],"quests":[66649]},"next":[66651]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"npc","id":"1003628","obj":{"i":1003628,"n":"Tocktix","l":29,"q":2}},{"type":"item","id":"2577","obj":{"i":2577,"n":"Staghorn Fishing Rod","l":29,"c":38209,"t":32,"p":2834}},{"type":"item","id":"2596","obj":{"i":2596,"n":"Spoon Worm","l":30,"c":27015,"t":33,"p":7}},{"type":"item","id":"2758","obj":{"i":2758,"n":"Steel Goggles","l":31,"c":40902,"t":34,"p":2539}},{"type":"item","id":"3369","obj":{"i":3369,"n":"Toadskin Culottes","l":30,"c":45281,"t":36,"p":2403}},{"type":"item","id":"3601","obj":{"i":3601,"n":"Velveteen Work Gloves","l":30,"c":44160,"t":37,"p":2242}},{"type":"item","id":"3829","obj":{"i":3829,"n":"Toadskin Workboots","l":30,"c":46146,"t":38,"p":2563}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"4898","obj":{"i":4898,"n":"Fullmoon Sardine","l":34,"c":29055,"t":47}},{"type":"quest","id":"66649","obj":{"i":66649,"n":"A Game of Cat and Fish","g":146,"l":"Limsa Lominsa","s":250,"f":1}},{"type":"quest","id":"66651","obj":{"i":66651,"n":"A Fish out of Water","g":146,"l":"Limsa Lominsa","s":350,"f":1}}]}