{"quest":{"name":"Gilding the Bilious (Twin Adder)","location":"Gridania","id":66668,"patch":2.0,"sort":470,"unlocksFunction":1,"eventIcon":71341,"issuer":1000168,"target":1000168,"involved":[1007625],"genre":191,"journal":["Vorsaile Heuloix would give you an opportunity to raise your standing in the Twin Adder.","Vorsaile Heuloix tasks you with responding to a petition for aid from the Holy See of Ishgard. Make for the southwestern reaches of the central highlands of Coerthas and seek out Ser Willielmus at the Aurum Vale.","Delve into the Aurum Vale and purge the deathly cavern of the foul fronds that inhabit its depths. Mind the vast pools of goldbile, a lethal ooze that─despite its glitter─offers not riches, but an excruciating demise for the unwary.<br><br>※The Aurum Vale can be accessed via the Duty Finder.","Your mission was a rousing success. Report back to Vorsaile Heuloix at the Adders' Nest.","Vorsaile Heuloix commends you on your triumph. Your reputation in the Twin Adder has risen to new heights."],"objectives":["Speak with Willielmus at the Aurum Vale.","Enter the Aurum Vale.","Report to Vorsaile Heuloix at the Adders' Nest."],"dialogue":[{"name":"VORSAILE","text":"Ah, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>─ever the shining example to your fellow Serpents."},{"name":"VORSAILE","text":"Time and again, you have risen to the call. Today, I would give you the opportunity to add to your growing list of accomplishments."},{"name":"VORSAILE","text":"In return for battle chocobos provided to us, the Holy See has petitioned our aid in purging the cavern known as the Aurum Vale of its most foul inhabitants. Our contact from Ishgard, Ser Willielmus, will apprise you of the particulars of the mission upon your arrival."},{"name":"WILLIELMUS","text":"From the Order of the Twin Adder, I presume? Yes, I suppose you should suffice. The Holy See is not wont to beseech assistance from foreign armies, but the task before us is a daunting one, and our own knights are occupied with matters of greater import."},{"name":"WILLIELMUS","text":"Mayhap you have already heard rumors of the Aurum Vale. Many a miner has been lured into its cavernous recesses by promises of vast fortunes to find only death, and doubly so."},{"name":"WILLIELMUS","text":"If the noxious fumes don't get them, the carnivorous fronds that lurk are happy to oblige. Little we can do about the former, but dispatching the latter would go far in sparing the lives of unfortunate treasure seekers. So it is that we turn to you. "},{"name":"VORSAILE","text":"I had no doubts that you would triumph, [GC Rank][GC Rank][GC Rank], but the swiftness and surety with which you have done so is impressive indeed."},{"name":"VORSAILE","text":"As leader of the Yellow Serpents, I have never been prouder of an adventurer under my command."},{"name":"VORSAILE","text":"Rest assured that your deeds have been conveyed to the powers that be. I look forward to the day when I can congratulate you on a well-deserved promotion."}],"reward":{"gcseal":1366,"xp":0},"reqs":{"jobs":[{"lvl":47,"id":1}],"gc":2,"gcrank":8,"quests":[66665]}},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1007625","obj":{"i":1007625,"n":"Willielmus","l":63,"q":4}},{"type":"quest","id":"66665","obj":{"i":66665,"n":"Shadows Uncast (Twin Adder)","g":191,"l":"Gridania","s":440,"f":1}}]}