{"quest":{"name":"Mountains out of Molehills","location":"Western La Noscea","id":66679,"patch":2.0,"sort":150,"eventIcon":71221,"issuer":1003359,"target":1003359,"genre":91,"journal":["Storm Private S'nairoh smells of salt, malt, and bad ideas, and appears intent on securing your services again.","Despite your misgivings, you accept a task from S'nairoh. Leave her to her dubious schemes, and slay five hedgemoles.","With the grace of the Twelve, you prevailed against these mostly harmless creatures. Report the happy news to S'nairoh.","The hedgemoles had no designs on Aleport. They must be commended for fighting so bravely for their lives. Not all is lost, since the good private will now spend her diminished coin on leeches rather than ale."],"objectives":["Dispatch hedgemoles.","Report to S'nairoh."],"dialogue":[{"name":"SNAIROH","text":"Well, I made a right mess of things the other day. Commander Falkbryda said she'd dock my pay if I pulled something like that again. At least I didn't get tossed in the brig like C'mell."},{"name":"SNAIROH","text":"I have been very chary since, you can be certain of that. I've little enough coin as is in the pay purse to slake my thirst with. But this time, aye, there's a real attack on Aleport, and off I go to arm the cannon!"},{"name":"SNAIROH","text":"Save Aleport from those bloodbaths on four legs, and we'll see what the commander has to say about my pay then!"},{"name":"SNAIROH","text":"Adventurer, for Aleport and glory, slow down the horde! I'm certain to be ready by the time you slaughter five!"},{"name":"SNAIROH","text":"Well slayed! Or do I mean slain? I shall need to know these things if I'm to be officer! I've got the powder and ball loaded and primed! Now for the slow match─hark, a dispatch!"},{"name":"SNAIROH","text":"“Stand down forthwith”? Not again! But surely these adamantoises are a clear and present─<br>...Hedgemoles? You're certain? Well, but, that's like an adamantoise except, ah, weak and not at all dangerous..."},{"name":"SNAIROH","text":"Why, oh why? Perhaps I have been cursed by some enemy? Not very likely for a mere storm private, second class or no. Now the commander will dock my pay and leave my whistle dry as dust."},{"name":"SNAIROH","text":"Well, <span class=\"alternative-container\"><span class=\"alternative\">my lady most gallant</span><span class=\"alternative\">my good man</span></span>, it <span class=\"emphasis\">is</span> called Aleport. I've spent a deal of time admiring the undersides of many a tavern table, I can tell you that!"},{"name":"SNAIROH","text":"What? It could be that my humours are out of balance from a surfeit of ale? And thus─I see it now─there is excess blood, which has overfed my martial zeal! <span class=\"highlight\">Forename</span>, your learned ways have shown me the light! Much thanks─I go now to receive a leeching!"}],"reward":{"gil":239,"items":[{"id":3325,"one":1},{"id":3321,"one":1},{"id":3327,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66678]},"next":[66680]},"partials":[{"type":"npc","id":"1003359","obj":{"i":1003359,"n":"S'nairoh","l":33,"q":3}},{"type":"item","id":"3325","obj":{"i":3325,"n":"Padded Hempen Trousers","l":15,"c":45015,"t":36,"p":450}},{"type":"item","id":"3321","obj":{"i":3321,"n":"Cotton Sarouel","l":14,"c":45107,"t":36,"p":326}},{"type":"item","id":"3327","obj":{"i":3327,"n":"Cotton Tights","l":15,"c":45083,"t":36,"p":315}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66678","obj":{"i":66678,"n":"Keep Your Day Job","g":91,"l":"Western La Noscea","s":150}},{"type":"quest","id":"66680","obj":{"i":66680,"n":"Walk of Shame","g":91,"l":"Western La Noscea","s":150}}]}