{"quest":{"name":"So You Want to Be a Fisher","location":"Limsa Lominsa Lower Decks","id":66670,"patch":2.0,"sort":0,"icon":100101,"unlocksFunction":1,"eventIcon":71341,"issuer":1000859,"target":1000859,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"NNMULIKA","text":"Well, a well-wishing welcome to you, adventurer friend! You've worked your way to Fisherman's Bottom."},{"name":"NNMULIKA","text":"When you want fish for just a day, you can call a culinarian, but we fishermen feast for life!"},{"name":"NNMULIKA","text":"I've set the bait. Think you're ready to bite?"},{"name":"Q1","text":"Do you wish to join the Fishermen's Guild?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"NNMULIKA","text":"Oh? Here I hastily hoped to hook you in, but I suppose I'll find other fish in the sea."},{"name":"NNMULIKA","text":"Feel free to swim back if ever fish fit your fancy!"},{"name":"NNMULIKA","text":"Oops! I hooked you only to find a snag─it appears you're on course for a different dock."},{"name":"NNMULIKA","text":"I really hate to release such a considerable catch, but here's to hoping you swim back once you've grown into your gills!"},{"name":"SYSTEM","text":"Before you can take up another discipline, you must first complete the level 10 quest of your starting class."},{"name":"NNMULIKA","text":"Hooray, hooray! Looks like we've got a live one! Let me walk you through the life of a fisherman in Limsa Lominsa."},{"name":"NNMULIKA","text":"Since we're surrounded by the seas, the fishing sites are a fisherman's delight. If you can't fish it here, you can't fish it anywhere!"},{"name":"NNMULIKA","text":"While some of us rope our fish in with rods and reels, others skim the seabed with nets for creepy-crawly critters."},{"name":"NNMULIKA","text":"You might say we cast a wide net─people prattle about our pullers just about everywhere in Limsa."},{"name":"NNMULIKA","text":"And there's much and more I haven't mentioned. We shepherd the ships, preside over the ports, manage the mongers, all while making sure not to leave any adventurers out to sea."},{"name":"NNMULIKA","text":"I'll wager you prefer to work alone, so we'll start you off with the rod and reel."},{"name":"NNMULIKA","text":"Now, you may not necessarily net the numbers net-fishing yields, but pole-fishing positively pulls prettier prizes."},{"name":"NNMULIKA","text":"And that's the long and short of it! When you're ready for another bite of bait, I'll reel you in before the guildmaster!"}],"next":[66643]},"partials":[{"type":"npc","id":"1000859","obj":{"i":1000859,"n":"N'nmulika","l":29,"q":2,"t":"Guild Receptionist"}},{"type":"quest","id":"66643","obj":{"i":66643,"n":"Way of the Fisher","g":146,"l":"Limsa Lominsa","s":10,"f":1}}]}