{"quest":{"name":"One Man's Trash","location":"North Shroud","id":66676,"patch":2.28,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1009381,"target":1006981,"genre":92,"journal":["Ealdwine, treasure hunter extraordinaire, appears somewhat out of sorts.","Through slurred speech, Ealdwine kindly offers to give you his last mysterious map, before remembering that he isn't at liberty to do so; instead, he bids you deliver it to his mother at Revenant's Toll. See the map safely to Brangwine, lest poor Ealdwine be on the receiving end of a bloody flogging.","Brangwine informs you that mysterious maps work like a charm on kitchen stains, and expresses her willingness to part with some from her stores. To be king of your kitchen, you must bring her the object of her morbid desires."],"objectives":["Deliver the map to Brangwine at Revenant's Toll."],"dialogue":[{"name":"EALDWINE","text":"Bah, nothin' worth a damn─jusht thish shtupid bloody rock...<span class=\"emphasis\">again</span>. Ain't good for─hic!─half a pint o' pish... &lt;sigh&gt;"},{"name":"EALDWINE","text":"Byregot'sh buttock, if it ain't the ashpirin'─hic!─treasure hunterer from Bronshe Lake! What bringsh ye here, friend?"},{"name":"EALDWINE","text":"...Hm? Ye need shomethin', 'venturer?"},{"name":"EALDWINE","text":"Wait, don't tell me... Ye was drawn to the─hic!─shweet shmell o' treasure, ain't that right?"},{"name":"EALDWINE","text":"Well then, treat yer noshtrilsh to <span class=\"emphasis\">thish</span>! A myshterioush map what pointsh the way to─hic!─an ancient cache of untold worth!"},{"name":"EALDWINE","text":"Now, I know what yer thinkin': only a fool would reveal shuch─hic!─lucrarative informationsh to othersh─and I ain't no fool. But I like ye, 'venturer, and I wantsh ye to have this map─me very lasht one."},{"name":"EALDWINE","text":"Problem ish, me ma collectsh 'em. Why? I don't remember, but if I don't give 'em to her, she'll─hic!─flog me bloody. Ye wouldn't want me to get flogged bloody, would ye? Of courshe not!"},{"name":"EALDWINE","text":"Yer a good sort, that'sh plain to shee. Ye wantsh to <span class=\"emphasis\">help</span> Ealdwine, and ye can do jusht that by─hic!─runnin' the map over to Ma over at Revenant'sh Toll. Brangwine'sh her name."},{"name":"EALDWINE","text":"Who knowsh? When she shees ye, might be as she'll take a likin' to ye and─hic!─let ye have the map. Don't quote me on that, though!"},{"name":"EALDWINE","text":"May the godsh─hic!─shpeed yer way, 'venturer! And while they're at it, they can shpeed mine, too─to lotsh of treasuresh and grog!"},{"name":"EALDWINE","text":"Have ye taken the myshterioush map to me ma over at Revenant'sh Toll yet? Brangwine'sh her name. When she shees ye, might be as she'll take a likin' to ye and─hic!─let ye have the map. Don't quote me on that, though!"},{"name":"BRANGWINE","text":"Why, hello there, young one. What can old Brangwine do for you, hmmm?"},{"name":"BRANGWINE","text":"Oh my, a mysterious map! My drunken lout of a son has you running errands, I see. For that, I apologize. Rest assured he will be suitably <span class=\"emphasis\">disciplined</span> for his indiscretion."},{"name":"BRANGWINE","text":"Why do I collect these maps, you ask? Well, it just so happens they remove kitchen stains like a charm. Something to do with the special ink they bear, I believe."},{"name":"BRANGWINE","text":"If you want your kitchen to be spotless like mine, I wouldn't be averse to parting with a map or three. My son keeps my stores constantly replenished, you see."},{"name":"BRANGWINE","text":"In exchange, I ask that you bring me...oh, let us say, articles found upon adventurers who <span class=\"emphasis\">mis</span>adventured. The gods know they have no further need of their worldly possessions, so you need not feel guilty."},{"name":"BRANGWINE","text":"Where are these articles like to be found? Why, where the deadliest creatures prowl, of course. Adventurers are drawn to them like moths to a flame, are they not?"},{"name":"BRANGWINE","text":"By your questioning look, I take it you're wondering what interest I have in such <span class=\"emphasis\">salvaged</span> items. You have secrets that you would sooner take to the grave, do you not? Let me keep mine, young one, and I will let you keep yours."},{"name":"SYSTEM","text":"A repeatable quest is now available from Brangwine at Revenant's Toll."},{"name":"SYSTEM","text":"Completing the quest will earn you a mysterious map."}],"reward":{"gil":517,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66998]},"next":[65896,66677]},"partials":[{"type":"npc","id":"1009381","obj":{"i":1009381,"n":"Ealdwine","l":57,"q":1}},{"type":"npc","id":"1006981","obj":{"i":1006981,"n":"Brangwine","l":67,"q":3}},{"type":"quest","id":"66998","obj":{"i":66998,"n":"Celestial Radiance","g":73,"l":"North Shroud","s":3,"f":1}},{"type":"quest","id":"65896","obj":{"i":65896,"n":"A Treasured Mother","g":73,"l":"Mor Dhona","s":10,"r":1,"f":1}},{"type":"quest","id":"66677","obj":{"i":66677,"n":"Morbid Motivation","g":95,"l":"Mor Dhona","s":500,"r":1,"f":1}}]}