{"quest":{"name":"Rock the Castrum","location":"Northern Thanalan","id":66672,"patch":2.0,"sort":248,"icon":112016,"eventIcon":71201,"target":1006657,"involved":[1007682,1007683],"genre":0,"journal":["Raubahn stands ready to commence the penultimate phase of Operation Archon.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Edelstein at the Ceruleum Processing Plant.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have successfully disabled the magitek field generator protecting the Praetorium, and defeated Livia sas Junius into the bargain. Though you are eager to press on with the fourth and final phase of Operation Archon, you will require the use of an airship if you are to reach the Ultima Weapon's resting place. For now, make your way back outside and report to Raubahn.","After gruffly reaffirming his trust in your abilities, Raubahn declares the third phase of Operation Archon a success. All that remains is the small matter of finding and destroying the Ultima Weapon."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Edelstein at the Ceruleum Processing Plant.</span>"],"dialogue":[{"name":"RAUBAHN","text":"Brothers and sisters of the Alliance! I would share with you glad tidings!"},{"name":"RAUBAHN","text":"Doubtless spurred on by news of the siege of Castrum Oriens, the Maelstrom has struck a double blow! Castrum Occidens and Castrum Marinum are now under blockade!"},{"name":"RAUBAHN","text":"Phase two of Operation Archon is a success!"},{"name":"RAUBAHN","text":"Reports tell us that the Garleans offered fierce resistance─but that the Admiral yielded them not one ilm."},{"name":"RAUBAHN","text":"With Occidens, Marinum, and Oriens thus suppressed, the third phase may begin in earnest!"},{"name":"RAUBAHN","text":"Even as we speak, the Order of the Twin Adder moves to block the railway leading hither from Castrum Centri. And that can mean but one thing..."},{"name":"RAUBAHN","text":"The hour is come to strike at the heart of the Garlean invasion force!"},{"name":"RAUBAHN","text":"...Castrum Meridianum, the den of the Black Wolf!"},{"name":"MINFILIA","text":"My fellow Eorzeans. I am Minfilia, Mistress of the Scions of the Seventh Dawn."},{"name":"MINFILIA","text":"There exist myriad barriers that divide us─those of race and nation, language and creed, to name but a few."},{"name":"MINFILIA","text":"Such barriers serve to isolate us from our neighbors...yet they <span class=\"emphasis\">also</span> serve to define who we are. Shorn of them, there would be little to distinguish one from another, and the rich variety of our lives would give way to sterile orthodoxy."},{"name":"MINFILIA","text":"These barriers can never <span class=\"emphasis\">truly</span> be broken down, of course─not so long as there is liberty in the world─but they <span class=\"emphasis\">can</span> be transcended!"},{"name":"MINFILIA","text":"Verily, we do so now in coming together for this grand endeavor, to fight side by side in defense of our shared home!"},{"name":"ALPHINAUD","text":"Before me stands the adventurer <span class=\"highlight\">Forename Surname</span>. You all know <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> as the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who will lead the unit tasked with destroying the Ultima Weapon."},{"name":"ALPHINAUD","text":"We Scions know a different <span class=\"highlight\">Forename</span>, however. We know <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> as a dear friend who has endured untold hardship on our behalf─a true hero who has ever blazed a path for us to follow. And why do I tell you this? I tell you, friends, because it is time for <span class=\"emphasis\">us</span> to blaze a path for <span class=\"emphasis\"><span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span></span>!"},{"name":"RAUBAHN","text":"Our objective is to wreak such havoc outside the walls of Meridianum as to afford <span class=\"highlight\">Forename</span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> comrades the time they need to disable the magitek field generator within."},{"name":"RAUBAHN","text":"With the path thus cleared, we may finally turn our minds to the true goal of this operation─the destruction of the Ultima Weapon! All troops, prepare for battle!"},{"name":"CID","text":"I fear I can't accompany you this time. The unenviable task of facilitating communications between our forces has been entrusted to the Ironworks, you see. Know, though, that I will be praying for your safe return."},{"name":"MINFILIA","text":"See that you come back to us, my friend. May the Crystal bless you and keep you."},{"name":"RAUBAHN","text":"We will suffer the Black Wolf to prowl our lands no more! Let us teach the hunter what it is to be hunted!"},{"name":"RAUBAHN","text":"Forward, comrades! For Eorzea!"},{"name":"ALLIEDARMIES","text":"(-All-)FOR EORZEA!"},{"name":"ALPHINAUD","text":"Go now, <span class=\"highlight\">Forename</span>, and bring us one step closer to the dawn!"},{"name":"RAUBAHN","text":"We will suffer the Black Wolf to prowl our lands no more! Let us teach the hunter what it is to be hunted!"},{"name":"CID","text":"If I didn't know better, I'd swear you had a personal grudge against magitek armor."},{"name":"CID","text":"What can I say? I couldn't bear to let you have all the fun."},{"name":"CID","text":"Don't worry─Biggs and Wedge have everything in hand. Truth be told, I think they <span class=\"emphasis\">like</span> having the work of three men."},{"name":"CID","text":"Wedge wasn't exactly pleased to be left behind, though, and made quite sure I knew it. I must say, our recent struggles have done <span class=\"emphasis\">wonders</span> for the lad's spirit."},{"name":"CID","text":"Given the size of this place, I suspected there might be an armor or three to be had. And here we are."},{"name":"CID","text":"Hmmm...not as bad as I thought. If I have <span class=\"emphasis\">half</span> Marques's talent for mending things, I should be able to get it working again."},{"name":"CID","text":"Listen, <span class=\"highlight\">Forename</span>─we intercepted an imperial communication indicating that the Ultima Weapon is indeed being housed within the Praetorium."},{"name":"CID","text":"We also learned that the field which protects the compound is powered by no fewer than three generator towers."},{"name":"CID","text":"If you're to deactivate the field, you'll need to locate and disable them all."},{"name":"CID","text":"And I'm here to help you do just that."},{"name":"CID","text":"See that chute? It leads to waste disposal."},{"name":"CID","text":"Somewhere nearby, there will be a ceruleum facility supplying fuel to the closest of the three towers."},{"name":"CID","text":"Find the place and break things."},{"name":"CID","text":"Go on ahead, <span class=\"highlight\">Forename</span>. I'll be along as soon as I finish my repairs."},{"name":"CID","text":"There you are!"},{"name":"CID","text":"I didn't have the patience to take the long way 'round."},{"name":"CID","text":"I see you've disabled the first generator. That leaves us with two."},{"name":"CID","text":"Ah, bugger. That was me, wasn't it?"},{"name":"CID","text":"Well, there's nothing for it but to press on. We must see to the remaining generators before the enemy has the chance to regroup!"},{"name":"CID","text":"You go on ahead, <span class=\"highlight\">Forename</span>! I'll bring up the rear!"},{"name":"CID","text":"Let's raise some hell!"},{"name":"CID","text":"Fine work, <span class=\"highlight\">Forename</span>!"},{"name":"CID","text":"Stand clear. I have a mind to loose some fireworks."},{"name":"CID","text":"Diverting all power to cannons!"},{"name":"CID","text":"Damn it. There goes the core. I fear I may have overestimated its maximum operating capacity...by a few orders of magnitude. I blame Marques."},{"name":"CID","text":"Ahem. We'll need to find another way to bring down the third generator."},{"name":"CID","text":"Well, well...the traitor himself. And with his meddlesome friend for company."},{"name":"CID","text":"You go on ahead, <span class=\"highlight\">Forename</span>. I need to get to the bottom of something."},{"name":"CID","text":"It's me! Are you all right!?"},{"name":"CID","text":"That's an assault craft you're up against! You don't stand a chance with conventional weapons!"},{"name":"CID","text":"You're going to need something big to bring it down. A mortar, a cannon─anything!"},{"name":"CID","text":"Hold on, <span class=\"highlight\">Forename</span>! I'm on my way!"},{"name":"LIVIA","text":"Fools! If you are resolved to die here, you might at least have done so without first making a mess of the place!"},{"name":"LIVIA","text":"I see that Garlond is not with you. More's the pity, I had hoped to slay him myself. But never mind the traitor for now."},{"name":"LIVIA","text":"I have so looked forward to this meeting...<span class=\"highlight\">Forename Surname</span>."},{"name":"LIVIA","text":"Yes, I know much and more about you. About your strength...and your hidden <span class=\"emphasis\">talents</span>."},{"name":"LIVIA","text":"I would sample them firsthand─and you <span class=\"emphasis\">will</span> indulge me."},{"name":"LIVIA","text":"My lord was quite taken with you and the power you possess─the “Echo.” Naturally, I could not help but wonder whom this <span class=\"alternative-container\"><span class=\"alternative\">princess among women</span><span class=\"alternative\">prince among men</span></span> might be..."},{"name":"LIVIA","text":"Only to discover that you are but another adventurer. No better than the multitude."},{"name":"LIVIA","text":"Yet in spite of this, the masses hold you their champion, and shower honors upon your head. It defies all reason."},{"name":"LIVIA","text":"How is it that <span class=\"emphasis\">you</span> could be such a thorn in our side? Wherever you appear, you leave havoc in your wake. You even slew Rhitahtyn, one of our very finest."},{"name":"LIVIA","text":"Well...I will not speculate. Truth be told, I couldn't care less how you have done these things. What matters to me is the fact that you have done them."},{"name":"LIVIA","text":"If you are allowed to continue, you will eventually deprive me of all that I have toiled for─all that is mine by right!"},{"name":"LIVIA","text":"My minions, my comrades...even my lord Gaius!"},{"name":"LIVIA","text":"Well, <span class=\"emphasis\">you cannot have him</span>!"},{"name":"LIVIA","text":"His dreams and ambitions, his body and soul─they are <span class=\"emphasis\">mine</span>, do you hear me!? <span class=\"emphasis\">All mine</span>!"},{"name":"LIVIA","text":"I lost everything once before! I will <span class=\"emphasis\">not</span> suffer it to happen again!"},{"name":"LIVIA","text":"I will kill you, adventurer! Only your death can bring me peace!"},{"name":"LIVIA","text":"No... &lt;sob&gt; It's happening...all over again..."},{"name":"LIVIA","text":"Please... I cannot bear it... &lt;sob&gt; Don't take him...away from me..."},{"name":"LIVIA","text":"My lord Gaius!!!"},{"name":"CID","text":"Another poor fool who craved Gaius's affection over all else... May her soul know rest."},{"name":"CID","text":"'Tis a miracle no harm has come to you, my friend. One for which I will happily give thanks."},{"name":"CID","text":"And thanks to your fine diversionary work, we've succeeded in bringing down the generator tower─and with it, the magitek field!"},{"name":"CID","text":"The way to the Praetorium now lies open. The only problem is, we can't reach it on foot."},{"name":"CID","text":"Nay, we'll need to take the <span class=\"emphasis\">Enterprise</span>. I left her at the Ceruleum Processing Plant, so let's regroup there."},{"name":"CID","text":"This is it, <span class=\"highlight\">Forename</span>! The final confrontation awaits!"},{"name":"RAUBAHN","text":"I knew you wouldn't let us down, soldier!"},{"name":"RAUBAHN","text":"With the Praetorium stripped of its defenses, the way to the Ultima Weapon lies open."},{"name":"RAUBAHN","text":"The time is come for the final phase of Operation Archon!"},{"name":"ALPHINAUD","text":"Go now, <span class=\"highlight\">Forename</span>, and bring us one step closer to the dawn!"},{"name":"MINFILIA","text":"See that you come back to us, my friend. May the Crystal bless you and keep you."}],"reward":{"xp":4800,"instance":15},"reqs":{"jobs":[{"lvl":50,"id":130}],"quests":[66582]}},"partials":[{"type":"npc","id":"1006657","obj":{"i":1006657,"n":"Raubahn","l":46,"q":4}},{"type":"npc","id":"1007682","obj":{"i":1007682,"n":"Minfilia","l":46,"q":1}},{"type":"npc","id":"1007683","obj":{"i":1007683,"n":"Alphinaud","l":46,"q":1}},{"type":"instance","id":"15","obj":{"i":15,"n":"Castrum Meridianum","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":42,"max_ilvl":60}},{"type":"quest","id":"66582","obj":{"i":66582,"n":"Setting the Stage","g":0,"l":"Northern Thanalan","s":247}}]}