{"quest":{"name":"On a Wing and a Prayer","location":"Western La Noscea","id":66681,"patch":2.0,"sort":150,"eventIcon":71221,"issuer":1003393,"target":1003393,"genre":91,"journal":["<span class=\"alternative-container\"><span class=\"alternative\">The first stars flash their pale bellies in the depth of the sky</span><span class=\"alternative\">A fresh morning breeze makes the pennons snap</span><span class=\"alternative\">A clear, strong light is on the quay</span></span>, and Ahldfoet the sailor is in a mood to yarn.","Ahldfoet has a slightly grisly request, though you are now an old hand at dismemberment. Hunt dusk bats and collect from them five wings.","You have liberated the wings from less-than-cooperative dusk bats. Deliver the leathery trophies to Ahldfoet.","The talismans tucked away in his cavernous pocket, Ahldfoet finally gives free rein to his tongue. While you itch to hear more of this tale, it seems clear that for now, the teller is content to let it lie."],"objectives":["Harvest wings from dusk bats.","Give the dusk bat wings to Ahldfoet."],"dialogue":[{"name":"AHLDFOET","text":"Ahoy, adventurer. My tub sails soon and I have to have me a little something for the journey. The dusk bats are flying─think yerself lightsome enough to bring me five wings? Four won't do and six is no good, mind ye."},{"name":"AHLDFOET","text":"Welcome you are to keep any surfeits, 'slong as ye know what to do with 'em. You'll bring me the wings?"},{"name":"AHLDFOET","text":"Ahoy there. Keep your voice down, nobody's business but ours, innit? You got what I asked for?"},{"name":"AHLDFOET","text":"Them's the ones, and that's as pretty a job as I've seen. Know your way 'round a battle, eh? Well, that's just fine, thank ye."},{"name":"AHLDFOET","text":"Why? We sailors can be a superstitious lot, ye know. Some of the crew might look at me odd-like for carrying bat parts. When the wind's done died and the water casks are dry, it's <span class=\"emphasis\">odd</span> one day, <span class=\"emphasis\">overboard</span> the next."},{"name":"AHLDFOET","text":"What? No superstition about <span class=\"emphasis\">that</span>. The dusker's been my luck since I was a boy. Survived more'n two weeks once on three bats I caught, trapped at the top of an abandoned watchtower. Even ate a wing off one afore I made up my mind up to climb down the wall."},{"name":"AHLDFOET","text":"This journey, we'll be sailing past the Isles of Umbra and I can feel the sea honing those reefs. The lights at Pharos Sirius burn dim since the Calamity, and I've always found it a mite too much like that old watchtower for comfort."},{"name":"AHLDFOET","text":"I ain't been that affrighted boy for a long time─ill-used, starved, and more'n half-mad, inching down that sandstone wall on handholds no bigger than a fingertip. But I'll have me five bat wings on every journey, just the same as that boy had."}],"reward":{"items":[{"id":3544,"one":1},{"id":3542,"one":1},{"id":3546,"one":1},{"num":3,"id":5824,"one":1}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66210,66209]},"next":[66682]},"partials":[{"type":"npc","id":"1003393","obj":{"i":1003393,"n":"Ahldfoet","l":33,"q":3}},{"type":"item","id":"3544","obj":{"i":3544,"n":"Bronze Gauntlets","l":15,"c":48301,"t":37,"p":588}},{"type":"item","id":"3542","obj":{"i":3542,"n":"Hard Leather Lightmitts","l":14,"c":44067,"t":37,"p":380}},{"type":"item","id":"3546","obj":{"i":3546,"n":"Fingerless Hard Leather Gloves","l":15,"c":44061,"t":37,"p":420}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66210","obj":{"i":66210,"n":"Call of the Sea","g":1,"l":"Ul'dah","s":90}},{"type":"quest","id":"66209","obj":{"i":66209,"n":"Call of the Sea","g":1,"l":"Gridania","s":89}},{"type":"quest","id":"66682","obj":{"i":66682,"n":"Mummy Dearest","g":91,"l":"Western La Noscea","s":150}}]}