{"quest":{"name":"Walk of Shame","location":"Western La Noscea","id":66680,"patch":2.0,"sort":150,"eventIcon":71221,"issuer":1003359,"target":1006614,"genre":91,"journal":["A wan and listless S'nairoh has for you a new request, the first that does not involve slaying half a dozen beasts.","After the fireworks comes paperwork. S'nairoh has completed a report on the sordid incident of the hedgemoles. It falls upon you to deliver it to Commander Falkbryda at Camp Skull Valley.","The report is safely in the hands of Commander Falkbryda, whose steel-grey eyes appear to miss very little of the goings-on in Aleport. The docked pay and the hard words will, you hope, prompt S'nairoh to mend her ways."],"objectives":["Deliver the report to Commander Falkbryda."],"dialogue":[{"name":"SNAIROH","text":"Greetings, <span class=\"highlight\">Forename</span>. Will you deliver this in my stead to Camp Skull Valley? It's, er, my report to Commander Falkbryda."},{"name":"SNAIROH","text":"I was as plain spoken as I could be, and I <span class=\"emphasis\">was</span> going to report in person but...for some reason, I've barely the strength to visit the barber for leechings, let alone make the trip to Skull Valley."},{"name":"SNAIROH","text":"I don't suppose I'd be spared a dock in pay. You don't think they'd clap me in the brig, do you?"},{"name":"FALKBRYDA","text":"Ah, an adventurer, and one whose name rings a bell. You have been of service to the Maelstrom, I hear. What brings you to Skull Valley?"},{"name":"FALKBRYDA","text":"A report from Private S'nairoh? It does her little credit that she did not make the trip herself. Stay while I peruse this."},{"name":"FALKBRYDA","text":"Hm... She does not prevaricate at least, that one. Unfortunate how she has gone to rack and ruin since she was posted to Aleport. She was among the first in her shoal to be promoted to second class, yet now..."},{"name":"FALKBRYDA","text":"Do you know what a soldier's greatest enemy is, <span class=\"highlight\">Forename</span>? Boredom. I suspect S'nairoh has played the craven in fighting this foe."},{"name":"FALKBRYDA","text":"I shall order the paymaster to dock her pay, but I'll not sign a censure. If she can stay out of the taverns and learn to keep herself busy, she may yet earn her salt."}],"reward":{"gil":200,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66679]},"next":[66683]},"partials":[{"type":"npc","id":"1003359","obj":{"i":1003359,"n":"S'nairoh","l":33,"q":3}},{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"quest","id":"66679","obj":{"i":66679,"n":"Mountains out of Molehills","g":91,"l":"Western La Noscea","s":150}},{"type":"quest","id":"66683","obj":{"i":66683,"n":"Nest We Forget","g":91,"l":"Western La Noscea","s":160}}]}