{"quest":{"name":"Toxic Avenger","location":"Western La Noscea","id":66684,"patch":2.0,"sort":160,"eventIcon":71221,"issuer":1003450,"target":1003450,"genre":91,"journal":["It is a cool and collected Sergeant Wiltswys who seeks an obliger today, rather than the heartsore fire-eater of the other day.","Wiltswys's meticulous scrutiny has discovered an unacceptable shortfall in the poison cabinet. Whilst she checks the other deadly yet life-saving items in the camp's inventory, you have a task to perform: stalk the majestic Rothlyt pelicans and extract three vials' worth of poison.","Exactly <span class=\"emphasis\">where</span> the poison is secreted is a matter too discomfiting to discuss. It must suffice to say that the pelicans did not survive your exertions. Return to Wiltswys and give her the pelican poison.","It seems that the way to Sergeant Wiltswys's heart is through a job well done. Listening to her tale of the Sahagin and the lost settlement, you see that she has no home but this vale and no family but the Maelstrom─and she will fight to the death to defend both..."],"objectives":["Collect poison from Rothlyt pelicans.","Deliver the vials of pelican poison to Wiltswys."],"dialogue":[{"name":"WILTSWYS","text":"Weapons and armor...in order. Saltpeter, in order. Basic provisions...all in order. Poisons─oh? This vial's near gone."},{"name":"WILTSWYS","text":"Uh, adventurer─<span class=\"highlight\">Forename</span>, was it? Mayhap we can let bygones be bygones. You are skilled in wrangling beasts, I hear, and I have a need of pelican poison."},{"name":"WILTSWYS","text":"The poison can be readily gathered from pelicans in the area, but I must continue my duties here. Are you so minded to undertake the task?"},{"name":"WILTSWYS","text":"I welcome your return, adventurer. Have you what I asked for?"},{"name":"WILTSWYS","text":"Ah, I see you were not stinting in filling the vials! The last adventurer returned with each barely half-full and had the cheek to demand full payment. I have had a low opinion of adventurers since, but..."},{"name":"WILTSWYS","text":"You know of our past with the kobolds, but they are not the foe we fight today. Nay, all our guns are trained on the fishbacks."},{"name":"WILTSWYS","text":"Such a wee thing, this vial─but this too is a gun. So susceptible the Sahagin are to pelican poison that even the rawest recruit may, with a poison-tipped arrow, find herself a fisher of beastmen."},{"name":"WILTSWYS","text":"There was a settlement here once, near Halfstone. Then the primal Leviathan rose, and the Sahagin invaded. Work of generations was undone in a season, and whole families perished."},{"name":"WILTSWYS","text":"I never knew the Halfstone settlement, but I believe it to be a home worth fighting for. And so we fight, with steel, fire, and even poison to reclaim that which is ours."}],"reward":{"gil":197,"xp":3500},"reqs":{"jobs":[{"lvl":16,"id":1}],"quests":[66682]},"next":[66685,66686]},"partials":[{"type":"npc","id":"1003450","obj":{"i":1003450,"n":"Wiltswys","l":33,"q":3,"t":"Storm Sergeant"}},{"type":"quest","id":"66682","obj":{"i":66682,"n":"Mummy Dearest","g":91,"l":"Western La Noscea","s":150}},{"type":"quest","id":"66685","obj":{"i":66685,"n":"My Brother's Not a Keeper","g":91,"l":"Western La Noscea","s":160}},{"type":"quest","id":"66686","obj":{"i":66686,"n":"Flowers for Aerghaemr","g":91,"l":"Western La Noscea","s":160}}]}