{"quest":{"name":"For the Winsome","location":"Limsa Lominsa","id":66689,"patch":2.1,"sort":1,"icon":100168,"eventIcon":71221,"issuer":1008262,"target":1008262,"genre":207,"usedItems":[5942],"journal":["Petyr Winsome, a reporter for the <span class=\"emphasis\">Harbor Herald</span> in Limsa Lominsa, wishes to interview an adventurer.<br>※This quest is available for a limited time only.","Petyr Winsome wishes you to participate in one of the monster-culling operations taking place at Three-malm Bend in middle La Noscea and Quarterstone in western La Noscea, and regale him with an account of your firsthand experience.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","During your efforts to whittle down the rising numbers of monstrous wildlife, you encounter an enigmatic knight who introduces herself as “Lightning.” After retrieving an odd parcel she left behind after the battle, you return to Limsa Lominsa to share your experiences with Petyr Winsome. At the reporter's insistence, you both tear open the strange parcel to reveal gloves of highly unusual design. Petyr, more than pleased with your contribution to his article, gladly places the handwear into your keeping. You are left wondering, however, who Lightning truly is, and whence the warrior has come."],"objectives":["Present evidence of your experiences to Petyr Winsome."],"dialogue":[{"name":"PETYRWINSOME","text":"Greetings, friend. I am Petyr Winsome, reporter for the <span class=\"emphasis\">Harbor Herald</span>. Could you spare a moment to aid me with an article I hope to pen?"},{"name":"PETYRWINSOME","text":"It is nothing scandalous or unseemly, I assure you. I simply wish to interview an adventurer about <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> firsthand experiences dealing with the recent and inexplicable profusion of monstrous wildlife beyond the city gates."},{"name":"PETYRWINSOME","text":"I am especially curious about the spawning megalocrabs out at Three-malm Bend, and a particularly ravenous dodo dubbed Gertrude running rampant at Quarterstone. Should you encounter any of these creatures, I would greatly appreciate aught you might share with me!<br>...And though I doubt not your integrity, would you mind returning with some physical evidence of your efforts? I have a reputation as a seeker of truth to maintain, you understand!"},{"name":"PETYRWINSOME","text":"A delight to speak with you again, adventurer. So, tell me: have you discovered aught to share with the <span class=\"emphasis\">Harbor Herald</span>'s readership? Any tales to mesmerize─and inform, of course─the masses? Hm?"},{"name":"PETYRWINSOME","text":"A lady warrior, you say? And she left behind this parcel?"},{"name":"PETYRWINSOME","text":"Allow me to confirm the facts. A puissant and powerful woman in exotic raiment appears, introducing herself as “Lightning.” And after the battle is won, she vanishes like a bolt of the very stuff for which she was named."},{"name":"PETYRWINSOME","text":"Finally, left in her blinding wake, you find what can be described as naught else but an “otherworldly” package. <span class=\"emphasis\">Incredible</span>! I say we peel back the wrapping and have a peek at what's inside!"},{"name":"PETYRWINSOME","text":"...I have never before seen such craftsmanship. I imagine even the famed artisans of Gridania would struggle to reproduce this degree of quality."},{"name":"PETYRWINSOME","text":"A mysterious knight of unknown origin wielding a weapon of equally enigmatic design. Yes, this shall become a most interesting article indeed. Your contribution has been invaluable!"},{"name":"PETYRWINSOME","text":"With your profession in mind, I believe the contents of this parcel are best left in your hands. After all, I have need of no other accoutrements but my mighty quill!"}],"reward":{"items":[{"id":6046},{"id":6042}],"xp":2625},"reqs":{"jobs":[{"lvl":12,"id":1}]},"next":[66690]},"partials":[{"type":"npc","id":"1008262","obj":{"i":1008262,"n":"Petyr Winsome","l":29,"q":1}},{"type":"item","id":"6046","obj":{"i":6046,"n":"Bohemian's Gloves","l":13,"c":44208,"t":37}},{"type":"item","id":"6042","obj":{"i":6042,"n":"Guardian Corps Gauntlets","l":13,"c":44207,"t":37}},{"type":"item","id":"5942","obj":{"i":5942,"n":"Otherworldly Parcel","l":1,"c":21005,"t":85}},{"type":"quest","id":"66690","obj":{"i":66690,"n":"Seeking the Scoop","g":207,"l":"Ul'dah","s":2}}]}