{"quest":{"name":"Primal Awakening","location":"The Waking Sands","id":66695,"patch":2.0,"sort":1,"icon":100167,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1007627,"involved":[1007685],"genre":14,"journal":["Urianger would speak with you regarding the unidentified primal.","Cryptic as ever, Urianger informs you that the as-yet-unidentified primal may soon awaken. He then reveals that an equally unidentified individual who is known to the Scions has taken it upon herself to investigate the being, and would solicit your assistance. Make your way to Wineport in eastern La Noscea, where the mystery maiden awaits.","You arrive at Wineport to find Alphinaud's twin sister, Alisaie, who has been conspicuous by her absence throughout your struggles thus far. She reveals to you that Castrum Occidens straddles a cavern formed in the wake of the Calamity, and expresses her desire to probe its uncharted depths. Fight your way through the imperial stronghold and seek a path down into the darkness.","You have found the entrance to the cavern in the innermost sector of Castrum Occidens. Report your success to Storm Private J'brohka.","J'brohka reveals to you that she is in the service of Alisaie, although she has enlisted with the Maelstrom for reasons of convenience. Her affiliations thus declared, J'brohka urges you to spare neither preparation nor caution for your expedition. Alisaie believes the truth of the Calamity sleeps within the cavern's unknown depths...but will she find the answers she seeks?<br><br>※The Binding Coil of Bahamut can be accessed via the Duty Finder."],"objectives":["Report to the mystery individual at Wineport.","Fight your way through Castrum Occidens.","Report to J'brohka."],"dialogue":[{"name":"URIANGER","text":"When the senary moon did wane, there sounded a bloodcurdling roar. A new primal had roused, the portents gave us to believe, one whose identity yet lieth beyond our ken."},{"name":"URIANGER","text":"By thy hand, three primals have since been vanquished. As each returned to the aether, 'twas observed that tremors foreshadowing this fourth grew in strength and frequency both."},{"name":"URIANGER","text":"The being doth quicken, and in time it shall become a scourge upon the land."},{"name":"URIANGER","text":"Yet even as we pondered a course of action, a benevolent soul did arise, one who would forestall this threat. Though she be tender in years, she is true of heart and steadfast of resolve."},{"name":"URIANGER","text":"She would solicit thine aid, if thou art willing to proffer it. Lest thou wonder, this maiden is of our order. Thus did the Antecedent straightways consent that thou shouldst assist her howsoever thou mayest."},{"name":"URIANGER","text":"As soon as thou art able, hie thee to Wineport, where thy petitioner doth await thee even now. Thou shalt for a certainty find her visage strikingly familiar."},{"name":"ALISAIE","text":"It has been a while, adventurer. As I recall, my brother Alphinaud took the liberty of introducing us when first─and last─we met."},{"name":"ALISAIE","text":"But for the sake of propriety...Alisaie Leveilleur. I thank you for coming."},{"name":"ALISAIE","text":"I have heard much and more of your exploits. By your hand, the Black Wolf is slain, and his Ultima Weapon destroyed."},{"name":"ALISAIE","text":"You are possessed of great strength and courage, that much is plain. I shall have need of one such as you if I am to see my mission through to its conclusion."},{"name":"ALISAIE","text":"As you may be aware, the violence of Dalamud's fall changed not only the face of the realm, but also the <span class=\"emphasis\">base</span> of the realm. Specifically, it played havoc with the aetheric currents, creating vast confluences of aether below the surface. Among other phenomena, this led to the formation of subterranean caverns at key points of stress."},{"name":"ALISAIE","text":"One such cavern lies beneath Castrum Occidens, and extends to only the gods know where."},{"name":"ALISAIE","text":"Despite appearances, Castrum Occidens is as much a research facility as it is a fortress. Gaius van Baelsar chose the site for no other reason than to probe the caverns without interference."},{"name":"ALISAIE","text":"As you went about vanquishing the returned primals, I observed a repeating wave pattern in the aether, corresponding exactly to the dates on which you were reported to have felled Ifrit, Titan, and Garuda. Upon closer examination, it became clear that these unique waveforms emanated from deep beneath the aforementioned stronghold."},{"name":"ALISAIE","text":"Crucially, I recorded the <span class=\"emphasis\">same</span> pattern during the recent celebrations, and have since been given to understand that this phenomenon bears a disquieting similarity to one observed shortly prior to the Calamity."},{"name":"ALISAIE","text":"Five years ago, my grandfather invoked the power of the Twelve that he might contain Bahamut."},{"name":"ALISAIE","text":"Alas, his efforts failed, and he vanished, together with his foe."},{"name":"ALISAIE","text":"I would know the truth of what transpired that day─of Grandfather's fate, and of the metamorphosis that swept across the land."},{"name":"ALISAIE","text":"In casting light upon these mysteries, we will find a way to cure what ails this world."},{"name":"ALISAIE","text":"It is my belief that the answers I seek lie hid within the depths of the cavern. I would have you accompany me on an expedition to find them, <span class=\"highlight\">Forename</span>."},{"name":"ALISAIE","text":"If truth be told, I am not wont to rely upon others, and have thus far handled matters alone. Yet I am not blind to my limitations. Unescorted, I cannot hope to succeed in this endeavor."},{"name":"ALISAIE","text":"I swore that I would find a way to restore peace to Eorzea. If you desire the selfsame, then aid me, as you aided my brother and the Scions."},{"name":"ALISAIE","text":"I am in your debt. You are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of action, and I sense that we will accomplish much together."},{"name":"ALISAIE","text":"But let us not waste any more time. As I mentioned, Castrum Occidens straddles the cavern I wish to explore. If I am to have a hope of reaching it alive, I will need you to infiltrate the stronghold first and locate a path into the depths."},{"name":"ALISAIE","text":"Once you have done so, pray report your success to Storm Private J'brohka. You may consider her my assistant here in Wineport."},{"name":"ALISAIE","text":"I have every faith that you will not fail me. Twelve speed your way, <span class=\"highlight\">Forename</span>."},{"name":"ALISAIE","text":"As I mentioned, Castrum Occidens straddles the cavern I wish to explore. If I am to have a hope of reaching it alive, I will need you to infiltrate the stronghold first and locate a path into the depths."},{"name":"JBROHKA","text":"I've been expecting you, <span class=\"highlight\">Forename</span>. By your coming, I take it you have successfully located the cavern entrance inside Castrum Occidens?"},{"name":"JBROHKA","text":"...So that's where it's to be found! Marvelous! Oh, but allow me to properly introduce myself. J'brohka is my name, and it is my honor to serve Lady Alisaie. Though, for reasons of convenience, at present I also serve the Maelstrom."},{"name":"JBROHKA","text":"This uniform accords me certain privileges, you see─in particular, ready access to the Maelstrom's regional scouting reports. They provide a wealth of local knowledge, including information on <span class=\"emphasis\">secret passages</span>."},{"name":"JBROHKA","text":"...But enough about me. I shall notify Lady Alisaie of your discovery, that she may prepare for the expedition."},{"name":"JBROHKA","text":"Though I don't doubt your abilities, none can say what dangers lurk beneath Castrum Occidens. For my lady's sake as well as your own, please spare neither preparation nor caution. Pray choose your companions well."},{"name":"SYSTEM","text":"You now have access to the Binding Coil of Bahamut. The subterranean labyrinth can be accessed by speaking with J'brohka."},{"name":"SYSTEM","text":"Details such as the conditions of entry may also be had by speaking with the storm private."},{"name":"ALISAIE","text":"The scars left by the Calamity..."},{"name":"ALISAIE","text":"I can scarce breathe for the surfeit of aether..."},{"name":"ALISAIE","text":"Tell me, have you ever seen corrupted crystals such as these?"},{"name":"ALISAIE","text":"Such crystals manifested across the realm when the course of the great river of aether was irrevocably altered five years ago."},{"name":"ALISAIE","text":"Behold one of the objects that caused that alteration: a fragment of the lesser moon, Dalamud."},{"name":"ALISAIE","text":"Ancient Allag created Dalamud─or Meteor, to use the Garlean name─to serve as a celestial prison for Bahamut."},{"name":"ALISAIE","text":"Its fall inflicted grievous wounds upon the land─wounds that have yet to heal, as is evident from the corrupted crystals."},{"name":"ALISAIE","text":"Amazing... Dalamud's internal defenses still function in spite of everything─a testament to the ingenuity of the Allagans."},{"name":"ALISAIE","text":"The Garleans seek to appropriate their advanced technology, I am certain of it."},{"name":"ALISAIE","text":"We are about to come face-to-face with secrets that have long lain buried within the sands of time."},{"name":"ALISAIE","text":"Great dangers may lie beyond, but we have come too far to turn back. The truth of the Calamity is within reach."},{"name":"ALISAIE","text":"&lt;gasp&gt; Gods preserve..."},{"name":"ALISAIE","text":"Dark wings that would engulf the very heavens..."},{"name":"ALISAIE","text":"These could only belong to Bahamut, the primal who laid Eorzea to waste five years ago."},{"name":"ALISAIE","text":"At Carteneau, my grandfather sought to imprison Bahamut anew by invoking the power of the Twelve."},{"name":"ALISAIE","text":"Alas, the dreadwyrm proved too powerful, and he soon broke free of his confines."},{"name":"ALISAIE","text":"Yet instead of resuming the destruction he had begun, Bahamut vanished. Whither to, no one knew...until this day."},{"name":"ALISAIE","text":"But I do not understand... If Bahamut is truly a primal, how is it that he retains his physical form?"},{"name":"ALISAIE","text":"Did Grandfather defeat him? Or is there some other explanation?"},{"name":"ALISAIE","text":"We must press on if we are to learn the truth."},{"name":"ALISAIE","text":"This is going rather more smoothly than I expected. It is indeed convenient to have a hero on hand."},{"name":"ALISAIE","text":"Gods... That the cavern should open up <span class=\"emphasis\">again</span>, even at this depth..."},{"name":"ALISAIE","text":"Hah! This resembles a finger..."},{"name":"ALISAIE","text":"&lt;gasp&gt; And so it should! This is Bahamut's hand!"},{"name":"ALISAIE","text":"As with the wings, it seems to be frozen, and for that I count my blessings. But again I find myself wondering, how is it able to retain physical form?"},{"name":"ALISAIE","text":"I had assumed that Bahamut's reversion to aether was the cause of the widespread changes to the realm. But if he is still here, then that theory no longer holds."},{"name":"ALISAIE","text":"What was it, then, that brought about the realm's sudden regeneration? There is still so much we do not know about Carteneau..."},{"name":"ALISAIE","text":"I haven't the slightest inkling how deep these caverns run, but we must continue."},{"name":"ALISAIE","text":"This contraption... Is it used to control the saturation of aether?"},{"name":"ALISAIE","text":"I suppose there is only one way to find out."},{"name":"ALISAIE","text":"The dragon you vanquished earlier─doubtless you noticed the peculiar contraption about its neck."},{"name":"ALISAIE","text":"It was likely a receptor of some description, used to enslave the creature."},{"name":"ALISAIE","text":"Ancient Allag possessed the means to control dragons, it would seem. The Ishgardians would kill for this knowledge, though to be sure, it could as easily be brought to bear against them."},{"name":"ALISAIE","text":"An army of dragons could turn the tide of any battle, as the Garleans once learned to their sorrow. I would not be the least bit surprised if they now sought to exploit this power."},{"name":"ALISAIE","text":"Whatever their plans, this serves as another reminder of the might of the Allagans. One cannot help but wonder how so advanced a civilization came to fall."},{"name":"ALISAIE","text":"Gods be good..."},{"name":"ALISAIE","text":"This is...this is Bahamut's head!"},{"name":"ALISAIE","text":"And that enormous crystal─it pulsates as if...as if it were a heart! Then the primal that had awakened...was Bahamut all this time!?"},{"name":"ALISAIE","text":"No! No, no, <span class=\"emphasis\">NO</span>! This cannot be true! This...this would mean that Grandfather died for naught!"},{"name":"ALISAIE","text":"Confound it! We do not know enough to strike at it now! We must withdraw!"},{"name":"ALISAIE","text":"Who...? Who is that? No...it can't be..."},{"name":"ALISAIE","text":"Grandfather? Is it truly you?"},{"name":"ALISAIE","text":"No... Don't leave me again... Please..."},{"name":"ALISAIE","text":"Grandfather!!!"},{"name":"ALISAIE","text":"I-I know... We can do no more for now..."},{"name":"ALISAIE","text":"Hm? But this looks like..."},{"name":"ALISAIE","text":"How did we come to be in northern Thanalan of all places?"},{"name":"ALISAIE","text":"Oh, but such details matter little!"},{"name":"ALISAIE","text":"Grandfather's alive, <span class=\"highlight\">Forename</span>!"},{"name":"ALISAIE","text":"Bahamut did <span class=\"emphasis\">not</span> defeat him!"},{"name":"ALISAIE","text":"But why won't he return to us? I don't understand..."},{"name":"ALISAIE","text":"This expedition has yielded more questions than it did answers."},{"name":"ALISAIE","text":"At any rate, we would both be better for a rest. Let us return to the Waking Sands and reflect upon what we have seen."},{"name":"ALISAIE","text":"Thank you, <span class=\"highlight\">Forename</span>. Without you, none of this would have been possible."}],"reward":{"gil":1659,"instance":30002,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[20005],"quests":[66694]},"next":[66696]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1007627","obj":{"i":1007627,"n":"J'brohka","l":32,"q":1,"t":"Storm Private"}},{"type":"npc","id":"1007685","obj":{"i":1007685,"n":"Alisaie","l":32,"q":1}},{"type":"instance","id":"30002","obj":{"i":30002,"n":"The Binding Coil of Bahamut - Turn 1","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":70}},{"type":"instance","id":"20005","obj":{"i":20005,"n":"The Navel (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":57}},{"type":"quest","id":"66694","obj":{"i":66694,"n":"In a Titan Spot","g":13,"l":"The Waking Sands","s":2,"f":1}},{"type":"quest","id":"66696","obj":{"i":66696,"n":"Alisaie's Pledge","g":14,"l":"The Waking Sands","s":2,"f":1}}]}