{"quest":{"name":"The Knight's Passage","location":"Gridania","id":66691,"patch":2.1,"sort":3,"icon":100168,"eventIcon":71221,"issuer":1008260,"target":1008260,"genre":207,"usedItems":[5944],"journal":["Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>, wishes to enlist the aid of an adventurer.<br>※This quest is available for a limited time only.","Kipih Jakkya would like nothing more than to write an article about Lightning, the lady–knight with whom the public has developed an unhealthy obsession. To that end, she bids you seek Lightning out in the Coerthas central highlands, where the knight was last seen headed. Should you encounter the enigmatic figure, the reporter would like to hear of your experiences, as well as examine any evidence of her passing you might acquire.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You encounter the lady–knight Lightning as well as an unfamiliar mechanical enemy. After besting the gargantuan construct, she once again leaves behind an otherworldly parcel, which you bring back on your return to Gridania. After handing the parcel over to Kipih Jakkya, you are suddenly approached by Lightning herself. Though it appears the warrior has been sent to Eorzea against her will, she nevertheless expresses a growing fondness for the realm's vibrant beauty. Kipih Jakkya believes the parcel Lightning left behind is actually a gift meant for you─a sign of the lady–knight's gratitude for your timely assistance. Could this be the last you will see of the mysterious visitor?"],"objectives":["Present evidence of your experiences to Kipih Jakkya."],"dialogue":[{"name":"KIPIHJAKKYA","text":"Greetings, adventurer. I'm Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>. You <span class=\"emphasis\">have</span> heard of Gridania's leading tabloid, I trust?"},{"name":"KIPIHJAKKYA","text":"And I assume that you have heard the rumors of the lady–knight known as Lightning? It seems she is everywhere at once!"},{"name":"KIPIHJAKKYA","text":"The public's obsession with this mystery warrior grows with each passing day, and the publications of each city–state feed the frenzy with endless feature articles."},{"name":"KIPIHJAKKYA","text":"“Lightning Drools over the Bismarck's Delightful Grilled Dodo!”<br>That's a headline from the <span class=\"emphasis\">Harbor Herald</span>."},{"name":"KIPIHJAKKYA","text":"“The Trinkets of Eshtaime's Lapidaries Fail to Strike Lightning's Fancy!”<br>That one's a groan-inducing pun typical of the <span class=\"emphasis\">Mythril Eye</span> and its mediocre reporting."},{"name":"KIPIHJAKKYA","text":"Any gazette that includes an article on Lightning─no matter how trivial the details─is guaranteed to sell down to the last copy. And <span class=\"emphasis\">The Raven</span> needs to seize its own share of the potential profits!"},{"name":"KIPIHJAKKYA","text":"The word around town is that Lightning was last seen traveling towards Coerthas. I ask that you seek out any evidence of her passage, and learn for me some tasty morsel of gossip!"},{"name":"KIPIHJAKKYA","text":"How fared you in your travels, adventurer? Were you able to track down any sign of the lady–knight who has captured the imagination of the masses? Pray tell me you learned some heretofore unknown snippet of news!"},{"name":"KIPIHJAKKYA","text":"Lightning fought against a magitek-like machine? But it was not, to your knowledge, of Garlean origin?"},{"name":"KIPIHJAKKYA","text":"Hmmm, well, I know little of such matters, but the tale of a battle with a mysterious mechanical opponent shall make for a riveting article nonetheless! I'll just grab my quill and─"},{"name":"KIPIHJAKKYA","text":"Hello, who have we here? A friend of yours?"},{"name":"LIGHTNING","text":"I thought you looked familiar."},{"name":"LIGHTNING","text":"So you're one of those so-called adventurers, right? Free to go where you want, and do as you please? Must be nice."},{"name":"LIGHTNING","text":"I always seem to be at the mercy of some power or fate I can't control. In fact, I'm probably only here as part of an insane god's trial."},{"name":"LIGHTNING","text":"To be tested and tempered like some unthinking weapon, so that I might be ready to fight..."},{"name":"LIGHTNING","text":"I'll fight, all right, but it'll be on my own terms. No one pulls my strings anymore."},{"name":"LIGHTNING","text":"Although if I had to be sent somewhere, I could do worse than this place."},{"name":"LIGHTNING","text":"So beautiful, so full of life. My sister, my friends...they would love it here."},{"name":"LIGHTNING","text":"...Heh, I'm starting to sound soft. I better get going."},{"name":"KIPIHJAKKYA","text":"J-Just a moment, now! Was that <span class=\"emphasis\">the</span> Lightning!?"},{"name":"KIPIHJAKKYA","text":"Ugh! I'm such a fool! I might have snared an exclusive interview with her!"},{"name":"KIPIHJAKKYA","text":"But how astonishing to see the rumor in the flesh! All that we have to mark the occasion is this parcel...and the garment I found within."},{"name":"KIPIHJAKKYA","text":"She must have wanted you to have it, in appreciation for the aid you rendered during her struggles. Here. Be sure to treasure this memento, adventurer."}],"reward":{"items":[{"id":6048},{"id":6044}],"xp":10105},"reqs":{"jobs":[{"lvl":38,"id":1}],"quests":[66690]},"next":[66692]},"partials":[{"type":"npc","id":"1008260","obj":{"i":1008260,"n":"Kipih Jakkya","l":53,"q":2}},{"type":"item","id":"6048","obj":{"i":6048,"n":"Bohemian's Boots","l":13,"c":46365,"t":38}},{"type":"item","id":"6044","obj":{"i":6044,"n":"Guardian Corps Boots","l":13,"c":46364,"t":38}},{"type":"item","id":"5944","obj":{"i":5944,"n":"Simple Otherworldly Parcel","l":1,"c":21005,"t":85}},{"type":"quest","id":"66690","obj":{"i":66690,"n":"Seeking the Scoop","g":207,"l":"Ul'dah","s":2}},{"type":"quest","id":"66692","obj":{"i":66692,"n":"Wonder and Lightning","g":207,"l":"Gridania","s":4}}]}