{"quest":{"name":"Wonder and Lightning","location":"Gridania","id":66692,"patch":2.1,"sort":4,"icon":100168,"eventIcon":71221,"issuer":1008260,"target":1008260,"genre":207,"usedItems":[5945],"journal":["Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>, has some urgent news for you.<br><br>※This quest is available for a limited time only.","Kipih Jakkya has learned that Lightning, the lady–knight with whom you have crossed paths several times before, is being pursued by fell demons. The intrepid reporter implores you to journey to Mor Dhona and offer your assistance to the enigmatic warrior. Should you encounter Lightning, Kipih Jakkya would like to hear of your experiences, as well as examine any evidence of her passing you might acquire.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After fighting alongside Lightning and helping her vanquish her black-hearted pursuers, you once again come into possession of an otherworldly parcel. You return to Gridania and hand the parcel to Kipih Jakkya, at which point Lightning once more appears at your side. The lady–knight speaks of her desire to remain in Eorzea, but your bravery has rekindled her own sense of determination. Drawn away by inexorable forces, Lightning returns to a world besieged by chaos and destruction. In whatever distant land she calls home, you are certain that her struggles continue."],"objectives":["Present evidence of your experiences to Kipih Jakkya."],"dialogue":[{"name":"KIPIHJAKKYA","text":"Hee hee hee! Have you perused the latest edition of <span class=\"emphasis\">The Raven</span>, good adventurer? My feature on Lightning is selling like honey cakes!"},{"name":"KIPIHJAKKYA","text":"After our previous conversation, I searched through the city for our famous warrior friend...and I found her! I finally had my exclusive interview, and the resulting article has our readership enthralled!"},{"name":"KIPIHJAKKYA","text":"I compensated her for her time, of course. Lightning seemed quite fascinated by our culture and dress, so I gifted her with the traditional garb of the Miqo'te clans."},{"name":"KIPIHJAKKYA","text":"Hee hee! Those other reporters must be choking on their quills at my good fortune. I─ Oh, but what am I saying!? There is far more important news afoot!"},{"name":"KIPIHJAKKYA","text":"According to the latest alehouse gossip, fell demons were seen converging on Lightning's location. It would be safe to assume they bear her naught but ill."},{"name":"KIPIHJAKKYA","text":"Accounts place the lady–knight in the region of Mor Dhona! You must hurry to her side, and help her fend off these black-hearted fiends! ...Oh, and if you happen to acquire another one of those odd parcels, I should like to see what it contains."},{"name":"KIPIHJAKKYA","text":"You seem weary, adventurer! Did you see battle? How does Lightning fare? Did you acquire any more unusual packages?"},{"name":"KIPIHJAKKYA","text":"Thank the gods. I'd feared the worst, but you've set my mind at ease."},{"name":"LIGHTNING","text":"I thought I might find you here."},{"name":"KIPIHJAKKYA","text":"Mistress Lightning! It is good to see you hale! What brings you back to Gridania?"},{"name":"LIGHTNING","text":"I wanted to say my good-byes."},{"name":"LIGHTNING","text":"Can we talk somewhere else?"},{"name":"LIGHTNING","text":"The time I've spent in Eorzea has been a welcome respite. I'm grateful for the peace I've found...when I've not been fighting monsters and fiends, of course."},{"name":"LIGHTNING","text":"Believe it or not, the place I come from is far more grim and dark. But it is still my home, and there are some things too precious to abandon."},{"name":"LIGHTNING","text":"If things were different, I wouldn't mind living out the rest of my days here..."},{"name":"LIGHTNING","text":"But watching you follow your heart and fight of your own free will has reminded me that I must do the same."},{"name":"LIGHTNING","text":"So, I've decided to head back, blade swinging."},{"name":"LIGHTNING","text":"I'm ready to return...and ready to finish this."},{"name":"LIGHTNING","text":"Hmph. God or not, <span class=\"emphasis\">someone's</span> going to regret putting me through these trials..."},{"name":"LIGHTNING","text":"...And it looks like that someone was listening─just waiting to hear my declaration of war."},{"name":"LIGHTNING","text":"I'm being called back. It's a shame; my memories of this world probably won't last..."},{"name":"LIGHTNING","text":"Keep them for me."},{"name":"KIPIHJAKKYA","text":"She's gone..."},{"name":"PETYRWINSOME","text":"&lt;gasp&gt; ...Heard word that... &lt;pant&gt; Lightning was on her way... &lt;huff&gt; to Gridania. Came as swiftly as I could..."},{"name":"DURALTHARAL","text":"Confound it! Are you telling me we were too tardy!? The fighter fair has faded forever!?"},{"name":"KIPIHJAKKYA","text":"She was such an intriguing character..."},{"name":"KIPIHJAKKYA","text":"But it seems she had unfinished business elsewhere─people to protect, and a home to save."},{"name":"KIPIHJAKKYA","text":"I wonder if the odd parcels she left behind were not some material manifestation of her determination... 'Twas a strange phenomenon, to say the least."},{"name":"KIPIHJAKKYA","text":"Well, I must be off to craft these events into another article! I hope I might beg some more of your time for another interview, my dear adventurer!"},{"name":"DURALTHARAL","text":"You mean to monopolize <span class=\"emphasis\">all</span> the most momentous material!? Are you not satisfied with your stunning success thus far!?"},{"name":"PETYRWINSOME","text":"I, too, must criticize this unseemly avarice! <span class=\"emphasis\">The Raven</span> has not the right to deny my publication a slice of the glory! After all, 'twas <span class=\"emphasis\">we</span> who published the story which started it all..."},{"name":"LIGHTNING","text":"<span class=\"emphasis\">Maybe we'll meet again...in another time, another place.</span>"}],"reward":{"items":[{"id":6045},{"id":6041}],"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":1}],"quests":[66691]}},"partials":[{"type":"npc","id":"1008260","obj":{"i":1008260,"n":"Kipih Jakkya","l":53,"q":2}},{"type":"item","id":"6045","obj":{"i":6045,"n":"Bohemian's Coat","l":13,"c":42342,"t":35}},{"type":"item","id":"6041","obj":{"i":6041,"n":"Guardian Corps Coat","l":13,"c":42341,"t":35}},{"type":"item","id":"5945","obj":{"i":5945,"n":"Stunning Otherworldly Parcel","l":1,"c":21005,"t":85}},{"type":"quest","id":"66691","obj":{"i":66691,"n":"The Knight's Passage","g":207,"l":"Gridania","s":3}}]}