{"quest":{"name":"In for Garuda Awakening","location":"The Waking Sands","id":66693,"patch":2.0,"sort":2,"icon":112023,"unlocksFunction":1,"eventIcon":71341,"issuer":1007531,"involved":[1000168,1007534],"genre":13,"journal":["Papalymo would have you vanquish Garuda, who has returned, stronger and bloodthirstier than before.","On the heels of the Amalj'aa, the Ixal have also succeeded in summoning their primal. Report to the Adders' Nest and speak with Commander Heuloix to learn how you might arrange an encounter with Garuda.","According to Commander Heuloix, a beastman aetheryte leading to Garuda's domain, the Howling Eye, has been discovered within Natalan in the central highlands of Coerthas. Fight your way to the innermost depths of the Ixali stronghold, and attune to the aetheryte.","You have successfully attuned yourself to the Natalan aetheryte, and the path to the Howling Eye lies wide open. Assemble your stoutest adventuring comrades, and vanquish the Lady of the Vortex.<br><br>※The Howling Eye (Hard) can be accessed via the Duty Finder."],"objectives":["Speak with Vorsaile Heuloix at the Adders' Nest.","Attune to the aetheryte at Natalan."],"dialogue":[{"name":"PAPALYMO","text":"Ah, <span class=\"highlight\">Forename</span>, I hear you have triumphed over Ifrit! Of course, this is no less a feat than I would expect of a Warrior of Light, but well done all the same!"},{"name":"PAPALYMO","text":"Now, I full had a mind to crack open a bottle of 1547 Bacchus, but the celebration must keep. Garuda, I am afraid to say, has also returned."},{"name":"PAPALYMO","text":"As you well know, Garuda's appetite for destruction far exceeds that of other primals. Not to dishearten you, but in her latest incarnation, that appetite has become nigh <span class=\"emphasis\">insatiable</span>."},{"name":"PAPALYMO","text":"In the short time since her return, she has already wreaked tremendous havoc. You must send her back to the aether before she can do any more damage."},{"name":"PAPALYMO","text":"In the meantime, Yda and I will assist the Order of the Twin Adder in their recovery effort."},{"name":"PAPALYMO","text":"When you previously faced Garuda, 'twas the <span class=\"emphasis\">Enterprise</span> that bore you through the storm that shielded her domain. Well, that storm is as a spring breeze beside what she has raised this time; no airship could hope to penetrate it."},{"name":"PAPALYMO","text":"And so we must count ourselves fortunate that the Order of the Twin Adder chanced to discover a beastman aetheryte leading to the Howling Eye."},{"name":"PAPALYMO","text":"Before you do aught else, I suggest you pay a visit to the Adders' Nest and have words with Commander Heuloix. He will be able to tell you about the said aetheryte, among other things."},{"name":"PAPALYMO","text":"Make no mistake, the Lady of the Vortex will prove a formidable opponent, but I believe that you can weather the storm. May the Twelve keep you safe!"},{"name":"VORSAILE","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>! We are grateful for your aid!"},{"name":"VORSAILE","text":"As you will already know, the accursed Ixal have summoned Garuda once more. Since her return, she has wasted no time unleashing her fury upon the region. Extensive damage has been reported in both the Twelveswood and Coerthas."},{"name":"VORSAILE","text":"She must be stopped, and soon, lest more lives be lost. In the name of the Elder Seedseer, I humbly request you put an end to her reign of terror. "},{"name":"VORSAILE","text":"As in the past, Garuda keeps her court within the Howling Eye, which is perpetually protected by a raging tempest. Fortunately, we have learned of an alternate way into her domain."},{"name":"VORSAILE","text":"The Ixal have constructed an aetheryte within Natalan, their stronghold in the central highlands of Coerthas. This aetheryte will take you to Garuda's tempestuous realm."},{"name":"VORSAILE","text":"We owe this discovery to the Ishgardians, who the Elder Seedseer says desired to repay the kindness you showed them. For the sake of our people as well as theirs, may your mission be met with success."}],"reward":{"gcseal":719,"instance":20006,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[20004],"quests":[66584]},"next":[66694]},"partials":[{"type":"npc","id":"1007531","obj":{"i":1007531,"n":"Papalymo","l":356,"q":2}},{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1007534","obj":{"i":1007534,"n":"Thancred","l":356,"q":4}},{"type":"instance","id":"20006","obj":{"i":20006,"n":"The Howling Eye (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":52}},{"type":"instance","id":"20004","obj":{"i":20004,"n":"The Bowl of Embers (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":49}},{"type":"quest","id":"66584","obj":{"i":66584,"n":"Ifrit Bleeds, We Can Kill It","g":13,"l":"The Waking Sands","s":1,"f":1}},{"type":"quest","id":"66694","obj":{"i":66694,"n":"In a Titan Spot","g":13,"l":"The Waking Sands","s":2,"f":1}}]}