{"quest":{"name":"Seeking the Scoop","location":"Ul'dah","id":66690,"patch":2.1,"sort":2,"icon":100168,"eventIcon":71221,"issuer":1008261,"target":1008261,"genre":207,"usedItems":[5943],"journal":["Dural Tharal, a reporter for the <span class=\"emphasis\">Mythril Eye</span> in Ul'dah, wishes to enlist the aid of an adventurer.<br>※This quest is available for a limited time only.","You have been tasked with tracking down the suddenly famous lady-knight known as Lightning. According to rumor, the mysterious warrior is said to be hunting a monstrosity in the wilds beyond the walls of Ul'dah. Conduct your search near Highbridge in eastern Thanalan, or in the vicinity of Little Ala Mhigo in southern Thanalan.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have successfully located and fought alongside Lightning in the wilds of Thanalan, and recovered another parcel which she left behind. After giving your account of events to an enthralled Dural Tharal, the reporter eagerly suggests opening the strange package. Inside, he discovers an unusual garment that he graciously returns to your possession. If the gossip Dural Tharal describes is any indication, Lightning's appearances seem to have become the favored subject of every rumormonger and tale-teller in Eorzea."],"objectives":["Provide a souvenir of your experiences to Dural Tharal."],"dialogue":[{"name":"DURALTHARAL","text":"A hearty hail to you, adventurer. I am Dural Tharal, renowned reporter for the <span class=\"emphasis\">Mythril Eye</span>. It is the experiences of esteemed explorers such as yourself that I have come to collect and collate."},{"name":"DURALTHARAL","text":"Are you aware of the latest object of many an Ul'dahn adolescent's ardent attention? Aye, it is that lady-warrior Lightning and her awe-inspiring appearances across the land."},{"name":"DURALTHARAL","text":"Ever since the <span class=\"emphasis\">Harbor Herald</span> printed its infamous article, the feisty fighter has found herself quite the following. And to add fuel to the fire, she has been witnessed, most recently, wielding her weapon out in the wilds of Thanalan."},{"name":"DURALTHARAL","text":"The knight was said to be on course to clash with a creature of nightmare incarnate."},{"name":"DURALTHARAL","text":"As for the specific “where,” the rumors suggest several sites, such as Highbridge in eastern Thanalan, and Little Ala Mhigo in southern Thanalan. Would you care to confirm these sightings, and indulge my career-driven curiosity? Some form of souvenir would be sufficient."},{"name":"DURALTHARAL","text":"So, were you successful in sighting the soldierly siren and securing a souvenir of the experience? You must tell me the tale in its terrible totality!"},{"name":"DURALTHARAL","text":"Be still, my beating heart! You battled a beast that bore resemblance to a behemoth? And Lightning fearlessly flung herself into the fray?"},{"name":"DURALTHARAL","text":"How heroic! But this bewildering box that Lightning left behind... Such a mysterious memento merits immediate investigation!"},{"name":"DURALTHARAL","text":"What curious contents we have uncovered! In all the meandering markets of this merchant metropolis, never have I gazed upon more enigmatic garments..."},{"name":"DURALTHARAL","text":"Whence does this hearty heroine hail? You opine that her origin is otherworldly? A jolly jest, but I'm afraid facts, and not flights of fancy, are my forte."},{"name":"DURALTHARAL","text":"Your eyewitness account, however, shall accord my article the required amount of authenticity. The next issue of the <span class=\"emphasis\">Mythril Eye</span> will sail off the shelves!"},{"name":"DURALTHARAL","text":"Here. I appreciate that adventurers enjoy acquiring such uncommon apparel. It is past time that I put pen to parchment!"}],"reward":{"items":[{"id":6047},{"id":6043}],"xp":5075},"reqs":{"jobs":[{"lvl":26,"id":1}],"quests":[66689]},"next":[66691]},"partials":[{"type":"npc","id":"1008261","obj":{"i":1008261,"n":"Dural Tharal","l":40,"q":1}},{"type":"item","id":"6047","obj":{"i":6047,"n":"Bohemian's Trousers","l":13,"c":45361,"t":36}},{"type":"item","id":"6043","obj":{"i":6043,"n":"Guardian Corps Skirt","l":13,"c":45360,"t":36}},{"type":"item","id":"5943","obj":{"i":5943,"n":"Strange Otherworldly Parcel","l":1,"c":21005,"t":85}},{"type":"quest","id":"66689","obj":{"i":66689,"n":"For the Winsome","g":207,"l":"Limsa Lominsa","s":1}},{"type":"quest","id":"66691","obj":{"i":66691,"n":"The Knight's Passage","g":207,"l":"Gridania","s":3}}]}