{"quest":{"name":"My Feisty Little Chocobo","location":"South Shroud","id":66698,"patch":2.0,"sort":300,"unlocksFunction":1,"eventIcon":71341,"issuer":1002754,"target":1000471,"genre":92,"usedItems":[4868],"journal":["Docette appears to have caught scent of something.","Having correctly guessed that you have your own chocobo, Docette suggests that you seek the counsel of Luquelot on how to attain even greater affinity with your trusty steed. Take yourself to Bentbranch Meadows and speak with the Ishgardian native.","Satisfied that you will not mistreat your bird, Luquelot agrees to help you train it in the ways of combat. To begin, he bids you bring him a fresh bunch of gysahl greens from the nearby field.","You have picked a fresh bunch of gysahl greens. Deliver it to Luquelot.","Luquelot explains to you the basics of fighting with your chocobo at your side. To put theory into practice, he bids you make your way to Sorrel Haven, and there put down three brood ziz with the aid of your feathered companion.","You have dispatched three brood ziz. Report your success to Luquelot.","There are numerous ways in which you and your companion can complement each other in battle. Experiment, and find the approach that serves you best."],"objectives":["Speak with Luquelot at Bentbranch Meadows.","Obtain a fresh bunch of gysahl greens.","Deliver gysahl greens to Luquelot.","Dispatch brood ziz with your companion.","Report to Luquelot."],"dialogue":[{"name":"DOCETTE","text":"&lt;sniff&gt; &lt;sniff&gt; The unmistakable smell of chocobo clings to you, adventurer. Would I be correct in assuming that you have your own trusty steed?"},{"name":"DOCETTE","text":"Aye, I thought so. Now tell me, is your bird battle-trained? If not, you might consider seeking the advice of Luquelot, over at Bentbranch Meadows."},{"name":"DOCETTE","text":"The Ishgardian native is something of a prodigy in all matters concerning our fine feathered friends. He should be able to help you attain greater affinity with your bird."},{"name":"LUQUELOT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Greetings, adventurer</span><span class=\"alternative\">Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"highlight\">Forename</span></span></span>. Is there something you need?"},{"name":"LUQUELOT","text":"You wish to have your chocobo trained in combat? This is no small request you make. Riding your bird is one thing; asking it to take hurts in your name is quite another. I will help train your chocobo, but on the promise that you will never unduly expose it to danger. Do I have your word?"},{"name":"LUQUELOT","text":"...Very well. To begin, we will need a bunch of gysahl greens. You have my leave to pick one from the fields yonder. Return here when you have it."},{"name":"LUQUELOT","text":"Have you acquired the greens?"},{"name":"LUQUELOT","text":"Superb. Then we shall get straight to it. Doubtless you already know this, but chocobos are highly fond of gysahl greens. They love the leafy vegetable so much, in fact, that they will completely forget their fears in the face of danger."},{"name":"LUQUELOT","text":"Thus, by feeding your bird the greens, you can prevail upon it to fight beside you. And then, once called, it will be up to you to direct its actions as you see fit."},{"name":"LUQUELOT","text":"You will find that your chocobo innately responds to a number of general commands. Give your bird an order, and it will act accordingly, and to the best of its ability. This simple-yet-effective methodology was developed by the Fortemps family, one of the foremost houses in Ishgard."},{"name":"LUQUELOT","text":"...And that concludes your lesson. Of course, it is not enough to merely hear about a practice; one must venture forth and attempt it oneself!"},{"name":"LUQUELOT","text":"Summon your chocobo with a bunch of gysahl greens, and together make your way to Sorrel Haven. The brood ziz that prowl the area ought to be a suitable challenge for you and your companion. Put down three of them and return here."},{"name":"LUQUELOT","text":"And lastly, by way of advice, I would recommend you keep an ample supply of gysahl greens on your person at all times. Our resident vendor will be able to provide you with as much as you can carry."},{"name":"LUQUELOT","text":"So you have successfully negotiated your first few battles with your chocobo? Well done."},{"name":"LUQUELOT","text":"Tell me, how did it feel? Was it not supremely reassuring, fighting with your feathered companion?"},{"name":"LUQUELOT","text":"Your chocobo can make up for your shortcomings, or build upon your strengths. Indeed, there are countless ways the two of you might complement one another. Through some experimentation, you will come to find the approach that serves you best."},{"name":"LUQUELOT","text":"Ah, before I forget, I have one last parting gift: a saddlebag for your chocobo. Carrying gysahl greens about can be quite cumbersome, after all, and there should be sufficient room for your personal belongings should the need arise. I pray it serves you well on your travels."},{"name":"SYSTEM","text":"You can now access your chocobo's saddlebag. This supplementary storage window can be accessed by selecting <span class=\"highlight\">Chocobo Saddlebag</span> located under <span class=\"highlight\">Character</span> in the main menu."}],"reward":{"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":1}],"mount":1,"questsType":"any","quests":[66236,66237]},"next":[67096,67653]},"partials":[{"type":"npc","id":"1002754","obj":{"i":1002754,"n":"Docette","l":56,"q":1}},{"type":"npc","id":"1000471","obj":{"i":1000471,"n":"Luquelot","l":54,"q":5}},{"type":"item","id":"4868","obj":{"i":4868,"n":"Gysahl Greens","l":20,"c":25218,"t":61,"p":36}},{"type":"quest","id":"66236","obj":{"i":66236,"n":"My Little Chocobo (Twin Adder)","g":92,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"66237","obj":{"i":66237,"n":"My Little Chocobo (Maelstrom)","g":91,"l":"Limsa Lominsa","s":200,"f":1}},{"type":"quest","id":"67096","obj":{"i":67096,"n":"Bird in Hand","g":92,"l":"Central Shroud","s":300,"f":1}},{"type":"quest","id":"67653","obj":{"i":67653,"n":"I Believe I Can Fly","g":0,"l":"???","s":15201,"f":1}}]}