{"quest":{"name":"Alisaie's Pledge","location":"The Waking Sands","id":66696,"patch":2.0,"sort":2,"icon":100230,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1007684,"genre":14,"journal":["Urianger would speak with you regarding your experience inside the Binding Coil.","Having thanked you for keeping Alisaie safe from harm, Urianger bids you join the young Scion in reflecting upon all that you witnessed within the Binding Coil.","After laying Eorzea to waste in the catastrophic event now known as the Calamity, Bahamut was sealed deep beneath the Carteneau Flats seemingly by Louisoix, who was presumed dead. Even in his imprisoned slumber, however, the primal continues to drink of the land's aether, and in time will awaken to cast his dark shadow over Eorzea once more. In order to prevent a repeat of the Calamity─and to be reunited with her grandfather─Alisaie declares that she will investigate the two other enormous fragments of Dalamud that fell to earth. Aid her in this endeavor, that the realm might know true peace."],"objectives":["Speak with Alisaie."],"dialogue":[{"name":"URIANGER","text":"Full glad am I for thy safe return. Lady Alisaie hath apprised me of thy many experiences."},{"name":"URIANGER","text":"As thou wilt doubtless be aware, Master Louisoix was my lady's grandsire. Gravely concerned was I for her safety, but 'twould seem I need not have been so. With all my heart, I do thank thee for watching over her."},{"name":"URIANGER","text":"But come, thou must speak with Mistress Alisaie upon that which transpired within the Binding Coil. May it serve to bring us closer to the truth of the Calamity."},{"name":"ALISAIE","text":"I am pleased to see you again, <span class=\"highlight\">Forename</span>. I have already shared the fruits of our expedition with Urianger. Let us together ponder their implications."},{"name":"ALISAIE","text":"Shall we begin, then? Urianger, I understand you have a report of your own to share with us."},{"name":"URIANGER","text":"Aye, my lady. Even as thou didst emerge from the depths, an aetheric disturbance betokening primal activity was observed."},{"name":"URIANGER","text":"In Mor Dhona was it marked first. By comparison of time and magnitude, we have since deduced its origin: the Carteneau Flats."},{"name":"ALISAIE","text":"Strange... There have been no reports of primal activity in that region... It could only have been Bahamut."},{"name":"ALISAIE","text":"That would certainly explain how we came to be in northern Thanalan. Somehow, the cavern took us all the way from Vylbrand to the heart of Aldenard."},{"name":"URIANGER","text":"'Twould seem so, my lady."},{"name":"ALISAIE","text":"It is all but certain, then... After Bahamut disappeared five years ago, he hid himself deep beneath Carteneau, and has since lain dormant, regenerating."},{"name":"URIANGER","text":"Aye, my lady. Taken together with thine own account of Bahamut's continued presence, the land's slowness to heal and the disorder of the aetheric currents do point to one conclusion..."},{"name":"URIANGER","text":"Bahamut stirreth. If left unchecked, the primal shall drink of Eorzea's life force till he doth waken to rain ruin upon the land."},{"name":"ALISAIE","text":"Rest assured, I do not mean to give up, <span class=\"highlight\">Forename</span>. Bahamut may still live, but so too does Grandfather."},{"name":"ALISAIE","text":"For the past five years, he has been keeping vigil over his nemesis, making certain that the primal does not escape."},{"name":"URIANGER","text":"Master Louisoix...doth yet live? I...I durst not hope... And thou art certain 'twas no mere manifestation of thine all too sorely felt grief?"},{"name":"ALISAIE","text":"I know how desperate this may sound, Urianger, but I saw him with my own two eyes─as did <span class=\"highlight\">Forename</span>."},{"name":"ALISAIE","text":"But he vanished deeper into the labyrinth before we had the chance to speak."},{"name":"ALISAIE","text":"Two more like fragments of Dalamud pierced the earth when the lesser moon fell. One we have seen. If we can but find the other two, I am certain that we will find Grandfather as well."},{"name":"URIANGER","text":"If thou so believest, my lady, then I too shall have faith. If it please you, I shall notify the Grand Companies of this development. All Eorzea must stand united if we are to avert a repeat of the Calamity."},{"name":"ALISAIE","text":"That will not be necessary, Urianger. Being the great conciliator that he is, Alphinaud will seek to unite Eorzea of his own accord. If rumors are true, that endeavor is already well underway."},{"name":"ALISAIE","text":"So let us leave the diplomacy to the diplomat, while we continue our investigation of Bahamut."},{"name":"ALISAIE","text":"I swear to you, no matter what it takes, we will find my grandfather and uncover the whole truth of the Calamity."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>─you have heard me swear to do these things, but without your strength, I cannot hope to make good on my word."},{"name":"ALISAIE","text":"The danger to Eorzea is not passed. For the sake of all who abide here, I pray that you will ever be our sword in the darkness."},{"name":"SYSTEM","text":"You may view the opening cutscene for the Binding Coil of Bahamut before accepting this quest."},{"name":"Q1","text":"View the opening cutscene?"}],"reward":{"gil":3752,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[30006],"quests":[66695]},"next":[66849]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1007684","obj":{"i":1007684,"n":"Alisaie","l":356,"q":1}},{"type":"instance","id":"30006","obj":{"i":30006,"n":"The Binding Coil of Bahamut - Turn 5","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":82}},{"type":"quest","id":"66695","obj":{"i":66695,"n":"Primal Awakening","g":14,"l":"The Waking Sands","s":1,"f":1}},{"type":"quest","id":"66849","obj":{"i":66849,"n":"Another Turn in the Coil","g":14,"l":"The Waking Sands","s":3,"f":1}}]}