{"quest":{"name":"In a Titan Spot","location":"The Waking Sands","id":66694,"patch":2.0,"sort":2,"icon":112022,"unlocksFunction":1,"eventIcon":71341,"issuer":1007533,"involved":[1003281,1007534],"genre":13,"journal":["Y'shtola would entrust you with the titanic task of defeating a greatly strengthened Titan.","As if on cue, the kobolds have succeeded in summoning Titan. According to Y'shtola, in his current incarnation, Titan now surpasses even Garuda in strength. Report to Maelstrom Command and speak with Commander Rhiki to learn how you might arrange a confrontation with the Lord of Crags.","According to Commander Rhiki, a beastman aetheryte leading to Titan's domain, the Navel, has been discovered within U'Ghamaro Mines in outer La Noscea. Fight your way to the innermost depths of the kobold stronghold, and attune to the aetheryte.","You have successfully attuned yourself to the U'Ghamaro aetheryte, and the path to the Navel lies wide open. Assemble your stoutest adventuring comrades, and vanquish the Lord of Crags.<br><br>※The Navel (Hard) can be accessed via the Duty Finder."],"objectives":["Speak with R'ashaht Rhiki at Maelstrom Command.","Attune to the aetheryte within U'Ghamaro Mines."],"dialogue":[{"name":"YSHTOLA","text":"So both Ifrit and Garuda are now vanquished by your hands. Truly, you have earned yourself a rest. Would that you had the luxury of time to enjoy it."},{"name":"YSHTOLA","text":"It pains me to say that Titan is also returned, and with a vengeance. As was the case with his primal brethren, he is grown stronger than he was before."},{"name":"YSHTOLA","text":"When I went about my investigation, all indications suggested that the kobolds were nowhere near ready to resume their summoning rites."},{"name":"YSHTOLA","text":"But it turns out they were deceiving us. I should have known better."},{"name":"YSHTOLA","text":"The kobolds' subterranean domain runs deep, and they can easily hoard crystals with our being none the wiser. And a vast hoard it must have been."},{"name":"YSHTOLA","text":"Till now, Garuda was the most powerful among the three recently active primals. But according to our latest readings, Titan has usurped that honor."},{"name":"YSHTOLA","text":"A primal's might is determined by two factors: the amount of crystals it has gorged upon, and the fervor of its believers. I would like nothing more than to measure precisely how strong the Lord of Crags has become, but I fear the time for such prudence has run out."},{"name":"YSHTOLA","text":"We have already received an official request for assistance from the Maelstrom. And as you might expect, it is addressed to <span class=\"emphasis\">you</span>."},{"name":"YSHTOLA","text":"For your previous encounter with Titan, you traveled to his demesne by way of the aetheryte first discovered by the Company of Heroes. Sad to say, this aetheryte no longer seems to respond."},{"name":"YSHTOLA","text":"But do not despair, for the Maelstrom has reportedly found another in its place. You will want to speak with Commander Rhiki at Maelstrom Command for the details."},{"name":"YSHTOLA","text":"I cannot stress this enough, but Titan has grown fearsome strong. See to it you spare no preparation."},{"name":"RASHAHT","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span></span>, your presence is most welcome. I'm chagrined that we must turn to you again to lay Titan low."},{"name":"RASHAHT","text":"No doubt this is yesterday's news to you, but the Lord of Crags has returned more ferocious and formidable than he was before."},{"name":"RASHAHT","text":"We cannot fathom how the kobolds were able to obtain such vast stores of crystals, and in so short a time. We will learn the answer in the coming moons, I suspect, but first things first."},{"name":"RASHAHT","text":"We need you to vanquish Titan before he and the kobolds have a chance to wreak havoc on Limsa Lominsa. You have felled the primal before, and we believe that you can emerge victorious once more."},{"name":"RASHAHT","text":"We've learned of a new aetheryte that will take you to the Navel. It's situated deep within U'Ghamaro Mines─not the most convenient of locations, admittedly─so you will have cut yourself a path."},{"name":"RASHAHT","text":"Please make all haste─Titan's mere presence emboldens the kobolds, and 'tis only a matter of time before they move in force against us. May the Navigator guide you on your way, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>."}],"reward":{"gcseal":719,"instance":20005,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[20006],"quests":[66693]},"next":[66695,66730]},"partials":[{"type":"npc","id":"1007533","obj":{"i":1007533,"n":"Y'shtola","l":356,"q":2}},{"type":"npc","id":"1003281","obj":{"i":1003281,"n":"R'ashaht Rhiki","l":28,"q":13,"t":"Storm Commander"}},{"type":"npc","id":"1007534","obj":{"i":1007534,"n":"Thancred","l":356,"q":4}},{"type":"instance","id":"20005","obj":{"i":20005,"n":"The Navel (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":57}},{"type":"instance","id":"20006","obj":{"i":20006,"n":"The Howling Eye (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":52}},{"type":"quest","id":"66693","obj":{"i":66693,"n":"In for Garuda Awakening","g":13,"l":"The Waking Sands","s":2,"f":1}},{"type":"quest","id":"66695","obj":{"i":66695,"n":"Primal Awakening","g":14,"l":"The Waking Sands","s":1,"f":1}},{"type":"quest","id":"66730","obj":{"i":66730,"n":"Primal Nature","g":13,"l":"The Waking Sands","s":3,"f":1}}]}