{"quest":{"name":"Show Me the Candy","location":"Ul'dah","id":66708,"patch":3.1,"sort":14,"icon":100171,"eventIcon":71221,"issuer":1005487,"target":1005490,"genre":203,"usedItems":[6108],"journal":["The Impresario would invite you to participate in a devilishly delightful All Saints' Wake celebration.<br>※This quest is available for a limited time only.","In order to fully enjoy the All Saints' Wake festivities, the Impresario has gifted you with a costume befitting the occasion. Don the guise to take your place among the terrors of the night, then speak with him anew.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Now that you look the part, the Impresario encourages you to travel to each of the three city–states and put a scare in the performers found within, for which you will be rewarded with toothsome treats. Begin by seeking out a skittish acrobat in Ul'dah who will serve as the first test of your spooking skills.","Thoroughly spooked by your actions, the zombie-like acrobat dropped the cookies that he was using to patch up the gaping holes in his body. Retrieve the moldy, maggot-infested confections from the ground.","You have recovered the cookies. Be a kind soul and return them to their owner.","In return for your kindness, the acrobat rewards you with a piece of earth candy. Proceed to Limsa Lominsa and seek out a mucose mummer.","Genuinely frightened by your casual threat to practice your culinary skills on him, the mucose mummer offers you a piece of fire candy in hopes of sating your appetite. Continue on your way to Gridania, and seek out a spirited thespian and his oversized sidekick.","The performer informs you that while he is clean out of candy, his partner─a strongman most convincingly disguised as an ogre─still has a full supply, and happens to be more skittish than he appears. Try spooking him with a /clap of your hands.","The ogre of a strongman appears unimpressed by your efforts. Take his partner at his word and pretend to /congratulate the hulking brute to see if a rousing round of applause might do the trick.","Sufficiently spooked, the strongman rewards you with a piece of wind candy. Having completed your set of candy, return to Ul'dah and feed the earth candy to the magic pot.","The magic pot appears pleased. Feed it a piece of fire candy.","The magic pot is delighted. Feed it a piece of wind candy to complete the set.","The magic pot is overjoyed, and returns your kindness with a batch of pumpkin cookies. What further treats and terrors await you before the festivities are through? Seek out the Impresario after sundown to delve deeper into the shadows of the night."],"objectives":["While in costume, speak with the Impresario.","While in costume, spook the skittish acrobat in Ul'dah.","Retrieve the cookies.","While in costume, present the cookies to the acrobat.","While in costume, speak with the mucose mummer in Limsa Lominsa.","While in costume, speak with the spirited thespian in Gridania.","While in costume, /clap for the somber strongman.","While in costume, /congratulate the somber strongman.","While in costume, feed earth candy to the magic pot in Ul'dah.","While in costume, feed fire candy to the magic pot.","While in costume, feed wind candy to the magic pot."],"dialogue":[{"name":"IMPHEAD","text":"We humbly ask that all adventurers don their costumes before taking part in the festivities."},{"name":"IMPHEAD","text":"Superstitions aside, let me assure you that dressing up as one of the dead is half the fun. Cling not to life! Cast off your worries and take your place among the terrors of the night!"},{"name":"IMPHEAD","text":"Those tattered rags are most becoming on you, friend. Had I not known otherwise, I would have suspected you were long since dead. Heh heh heh... Now, with no further ado, let the hauntings begin!"},{"name":"IMPHEAD","text":"My troupe has prepared a spine-tingling diversion worthy of the occasion. Thespians under my direction have disguised themselves as ghastly gremlins of all stripes and taken to the streets of the three city–states to haunt the local populace."},{"name":"IMPHEAD","text":"It is your task, dear adventurer, to outspook the spooks, as it were. Give my troupers a good scare, and you shall be rewarded with candy."},{"name":"IMPHEAD","text":"Feed this candy to the magic pot you see just across the way to my left, and you will be rewarded in kind for your efforts."},{"name":"IMPHEAD","text":"Oh, and do take your time, friend. For the night is long, and full of most delightful terrors..."},{"name":"IMPHEAD","text":"What's the matter, friend? Have you misplaced your costume? I fear I cannot allow you to participate in the festivities unless you are dressed for the part."},{"name":"ZOMBIE","text":"Y-Ye gads!"},{"name":"ZOMBIE","text":"Wh-What's the big idea!? An adventurer like you might not understand, but we zombies are delicate creatures. Why, the last time someone t-tapped me on the shoulder, my arm fell clean off!"},{"name":"ZOMBIE","text":"Now look at what you've done! You gave me such a fright that my worm-eaten heart dropped into where my stomach used to be, and the moldy, maggot-infested cookies I was using to patch up the gaping holes in my body are scattered everywhere! The least you could do is apologize."},{"name":"ZOMBIE","text":"But noooooo, <span class=\"emphasis\">you</span> just want my candy. Well, too bad─you're not getting <span class=\"emphasis\">anything</span> from me. If you're starving for sweets, eat those cookies. I'll carry on...&lt;sniff&gt;...somehow."},{"name":"ZOMBIE","text":"Wh-Whaaa...!?<br>An adventurer!? Y-You don't scare me! Besides, the boss told me only to answer to my fellow undead."},{"name":"ZOMBIE","text":"&lt;sob&gt; Holes, holes everywhere. How could anyone ever love me?"},{"name":"ZOMBIE","text":"M-My...my cookies! You're really giving them back to me? Maybe you adventurers aren't so bad, after all."},{"name":"ZOMBIE","text":"Sadly, I've no candy to my name...save for this piece that I've been using as a makeshift eyeball. Just give me one moment to pop it out and wipe the pus off, and... Voilà, good as new!"},{"name":"PUDDING","text":"I don't got no candy for you. So get lost!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm from the Culinarians' Guild, and..."},{"name":"A2","text":"Nice costume you have there."},{"name":"A3","text":"A talking...pudding?"},{"name":"PUDDING","text":"I told you to get... &lt;gulp&gt; The C-C-Culinarians' Guild!?"},{"name":"PUDDING","text":"P-P-Please don't eat me! I swear on every onze of jelly in my body, I taste disgusting! Why, just look at this sickly color! And have you taken a whiff of me? You'll have the entire realm throwing up in their chamberpots!"},{"name":"PUDDING","text":"H-Here, take this instead! You have my word, it tastes a hundred times better than I ever could! Now, <span class=\"emphasis\">really</span>, get lost─you're giving me the creeps!"},{"name":"PUDDING","text":"Costume...? What cos─ I mean, thank you! But flattery won't get you any treats from me, if that's your plan. Now shoo!"},{"name":"PUDDING","text":"That's right! You got a problem with that!?"},{"name":"PUDDING","text":"I got nothin' to say to adventurers. Come back in costume, or shoo!"},{"name":"IMPB","text":"Well, hullo there. Looking for a treat, are you? Had you come a few bells earlier, I'd have been happy to oblige, but I fear I'm clean out of stock."},{"name":"IMPB","text":"My oversized companion here, on the other hand, still has plenty to dole out. For <span class=\"emphasis\">some</span> reason, it would appear that you adventurers are hesitant to try your scare tactics on <span class=\"emphasis\">him</span>. Hee hee hee..."},{"name":"IMPB","text":"Because I'm so nice, I'll clue you in on a secret. My partner might look imposing, but the truth is he's scared to death of loud noises. Don't believe me? Just start <span class=\"highlight\">clapping</span> and see for yourself."},{"name":"IMPB","text":"Hm? Oh, let me guess: you're dressed up as an <span class=\"emphasis\">adventurer</span> for All Saints' Wake. That's cute─really, it is─but I've got my orders: no costume, no candy."},{"name":"IMPB","text":"Oh, don't let him frighten you─his bark is far worse than his bite. Why, he hasn't eaten an adventurer in almost three moons! Now give him a rousing round of applause, as if to congratulate him on his aplomb. That'll put the fear of the gods in him, I guarantee."},{"name":"OGRE","text":"&lt;grunt&gt; Urrrgh...?"},{"name":"OGRE","text":"You keep clapping, little <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">man</span></span>, I...I crush you like ant!"},{"name":"IMPB","text":"Oh, don't let him frighten you─his bark is far worse than his bite. Why, he hasn't eaten an adventurer in almost <span class=\"emphasis\">three moons</span>! Now give him a rousing round of applause, as if to <span class=\"highlight\">congratulate</span> him on his aplomb. That'll put the fear of the gods in him, I guarantee."},{"name":"OGRE","text":"No...costume? No...candy! Grrraaaghhh!"},{"name":"OGRE","text":"Little <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">man</span></span> clap...clap...clapping... I must...crush. I..."},{"name":"OGRE","text":"No...n-no hurt me! Scary ghost t-take candy! Take candy and go far, far away!"},{"name":"MAGICPOT","text":"Gimme an elixir! No, that's not right..."},{"name":"MAGICPOT","text":"Gimme some candy! Yes, you heard me─I clamor for candy!"},{"name":"MAGICPOT","text":"Now that's a tasty treat! Got any more?"},{"name":"MAGICPOT","text":"No costume? No cookies for you!"},{"name":"MAGICPOT","text":"I'm still hungry! More, I say!"},{"name":"MAGICPOT","text":"Delightfully delectable! I want more!"},{"name":"MAGICPOT","text":"More! More, I say!"},{"name":"MAGICPOT","text":"Earth, wind, and fire～♪<br>That's what I desire～♪<br>Here, this is for you!"}],"reward":{"gil":400,"items":[{"num":3,"id":4743}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66707]},"next":[66709]},"partials":[{"type":"npc","id":"1005487","obj":{"i":1005487,"n":"Impresario","l":40,"q":4}},{"type":"npc","id":"1005490","obj":{"i":1005490,"n":"Magic Pot","l":40,"q":1}},{"type":"item","id":"4743","obj":{"i":4743,"n":"Years-old Pumpkin Cookie","l":7,"c":24067,"t":46}},{"type":"item","id":"6108","obj":{"i":6108,"n":"The Wailing Spirit","l":1,"c":43578,"t":35,"p":98}},{"type":"quest","id":"66707","obj":{"i":66707,"n":"Not-so-evil Dead","g":203,"l":"Ul'dah","s":13}},{"type":"quest","id":"66709","obj":{"i":66709,"n":"I Burn for You","g":203,"l":"Ul'dah","s":15}}]}