{"quest":{"name":"Better Late than Sever","location":"Mor Dhona","id":66717,"patch":2.1,"sort":9,"eventIcon":71201,"target":1006544,"involved":[1007741,1007742,1007746,1007747,1007748,1007749],"genre":0,"journal":["A supply carriage to Revenant's Toll is late, and Guolgeim will know the reason why.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","The Wood Wailer you speak with is somewhat distracted, having just received word of an Ixali attack on a carriage. The duty officer doubts that it is the selfsame carriage you seek, but you know there are no coincidences in the North Shroud. Another of Fallgourd Float's finest is on the scene, if you wish to inquire further.","You arrive only to be informed that it was indeed a supply carriage that was attacked, and both the cargo and the coachmen were captured. Your suspicions are vindicated, but now a difficult rescue-and-recovery mission is indicated. To the logging grounds you must go, to free the captives and recover whatever provisions remain.","You successfully liberate several crates of cargo, as well as the two coachmen. Only they can tell you whether Revenant's Toll will get its provisions. Return to the carriage and speak with the Elezen coachman.","You discover that the carriage is in no condition to continue on to Revenant's Toll. Though Guolgeim will not be pleased to hear it, the result could have been much worse. Return with due optimism to Revenant's Toll and give your report to Guolgeim.","Your optimism turns out to have been justified, for Guolgeim was not surprised in the slightest. As a denizen of Revenant's Toll, she is privy to all manner of rumors, including persistent whispers of the primals' inevitable return..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"GUOLGEIM","text":"Well, now. In the nick you are, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, again showing up just when you're needed."},{"name":"GUOLGEIM","text":"I'm waiting on a supply carriage from Gridania. It should've been here by now, even if they stopped a spell in Fallgourd Float to wet their whistles."},{"name":"GUOLGEIM","text":"The carriages always pass through the North Shroud. Here, stretch those <span class=\"alternative-container\"><span class=\"alternative\">strong</span><span class=\"alternative\">long</span><span class=\"alternative\">chubby</span><span class=\"alternative\">pretty</span><span class=\"alternative\">thewy</span><span class=\"alternative\">scaly</span><span class=\"alternative\">brawny</span><span class=\"alternative\">dainty</span></span> legs some, why don't you? Go and ask the Wood Wailers over in the Float if they've seen something."},{"name":"GUOLGEIM","text":"The supply route runs through the North Shroud. One of the Wood Wailers over in Fallgourd Float ought to know something."},{"name":"WOODWAILERA","text":"A supply carriage bound for Revenant's Toll? Hasn't come through here, I can tell you that."},{"name":"WOODWAILERA","text":"But...maybe it's the same one? We just received word of an Ixali attack on a carriage, you see."},{"name":"WOODWAILERA","text":"Seems like too much of a coincidence, but you never know."},{"name":"WOODWAILERA","text":"May as well have a look, eh? You'll find one of our men on the scene─the carriage was waylaid on the road just east of here."},{"name":"WOODWAILERA","text":"The carriage should still be stopped on the road east of here, if you want to poke around."},{"name":"WOODWAILERB","text":"Hell-o, what have we here? An adventurer, by the Twelve, and a suitably gaunt one!"},{"name":"WOODWAILERB","text":"As you can see, a few gentlemen of the road─er, gentlebirds if you must─ambushed this carriage. Took the cargo and both coachmen─how's <span class=\"emphasis\">that</span> for a day's work?"},{"name":"WOODWAILERB","text":"The tracks lead to the Ixali logging grounds to the north. You look a hungry sort─how about it? Will you rescue the coachmen and recover those provisions?"},{"name":"WOODWAILERB","text":"Looks like the Ixal took their spoils to the logging grounds north of Eugenia's Spire. <span class=\"emphasis\">Someone</span> needs to rescue the two captives and recover those provisions, if you take my meaning."},{"name":"WOODWAILERB","text":"I knew you could save them! Well done!"},{"name":"ELEZENCOACHMAN","text":"Thank you for freeing me, stranger. I can manage alone from here on."},{"name":"ELEZENCOACHMAN","text":"I shall await your safe return at the carriage. Twelve speed your way, adventurer."},{"name":"HYURCOACHMAN","text":"Whew, I thought I was done for! These supply runs are getting a little too interesting for my tastes."},{"name":"HYURCOACHMAN","text":"I'd best get out of here before the birdmen come back in force. Many thanks, and try not to get killed!"},{"name":"ELEZENCOACHMAN","text":"We are both in your debt, good adventurer. I shudder to think what fate the Ixal had in mind for us."},{"name":"ELEZENCOACHMAN","text":"You seek the provisions meant for Revenant's Toll? It pains me to say, but this is all that remains."},{"name":"ELEZENCOACHMAN","text":"The carriage is in no state to resume the journey, nor are the chocobos. We shall have to arrange another transport. Would you take word back to Guolgeim?"},{"name":"HYURCOACHMAN","text":"I'd say it's time we <span class=\"emphasis\">all</span> made haste, before someone else gets captured. Then where would we be? Our heads lopped off and lining the road, likely."},{"name":"ELEZENCOACHMAN","text":"With the carriage in this condition, we would not survive the journey to the Toll. What is more, the provisions you recovered were only a fraction of what we intended to deliver."},{"name":"GUOLGEIM","text":"Attacked? By the Ixal!? Well, roll me in stardust and dash me from the sky!"},{"name":"GUOLGEIM","text":"Not that I ought to be s'prised, mind you. Gossip's fleet where adventurers sleep, and I've heard the talk of the primals waking. Beastmen won't let a sleeping primal lie, will they?"},{"name":"GUOLGEIM","text":"But never mind that, you did well enough saving those two coachmen. I'd go put some meat on your bones with that reward─looking far too thin, you are."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66716]},"next":[66720,67097]},"partials":[{"type":"npc","id":"1006544","obj":{"i":1006544,"n":"Guolgeim","l":67,"q":4}},{"type":"npc","id":"1007741","obj":{"i":1007741,"n":"Wood Wailer","l":57,"q":1}},{"type":"npc","id":"1007742","obj":{"i":1007742,"n":"Wood Wailer","l":57,"q":1}},{"type":"npc","id":"1007746","obj":{"i":1007746,"n":"Elezen Coachman","l":57,"q":1}},{"type":"npc","id":"1007747","obj":{"i":1007747,"n":"Hyuran Coachman","l":57,"q":1}},{"type":"npc","id":"1007748","obj":{"i":1007748,"n":"Elezen Coachman","l":57,"q":1}},{"type":"npc","id":"1007749","obj":{"i":1007749,"n":"Hyuran Coachman","l":57,"q":1}},{"type":"quest","id":"66716","obj":{"i":66716,"n":"Laying the Foundation","g":0,"l":"The Waking Sands","s":6}},{"type":"quest","id":"66720","obj":{"i":66720,"n":"Hest of the Best","g":0,"l":"Mor Dhona","s":10}},{"type":"quest","id":"67097","obj":{"i":67097,"n":"Welcome to Morbol Country","g":0,"l":"Mor Dhona","s":10}}]}