{"quest":{"name":"The Price of Principles","location":"The Waking Sands","id":66711,"patch":2.1,"sort":1,"icon":100172,"eventIcon":71201,"issuer":1006693,"target":1007722,"involved":[1007478,1007530,1007531,1007533,1007534],"genre":2,"journal":["Minfilia appears to be lost in thought.","Ever since your famous victory over Gaius van Baelsar, the halls of the Waking Sands have been thronged with petitioners seeking to engage the Scions' services for personal gain. Although Minfilia is loath to entertain their dubious proposals, she wonders if accepting such patronage might ultimately empower the order to do greater good. Before making any decision, she would like to hear the opinions of your fellow Scions. Speak with Thancred, Y'shtola, Yda, Papalymo, and Urianger.","As expected, the other Scions are deeply concerned about the ideological implications of accepting conditional support. Perhaps Alphinaud can offer a different perspective on the matter?","Alphinaud seizes the opportunity to make a bold counter-proposal: move the Scions' headquarters to Mor Dhona, beyond the borders of Ul'dah and the other great nations. Though Minfilia makes a show of listening to the young Elezen's reasoning, she is not to be convinced, decrying his idea as reckless beyond words before unceremoniously dismissing him. As you silently watch Alphinaud take his leave, you sense that, beneath their heated words, another conversation was taking place..."],"objectives":["Speak with Y'shtola.","Speak with Thancred.","Speak with Papalymo.","Speak with Yda.","Speak with Urianger.","Speak with Alphinaud."],"dialogue":[{"name":"MINFILIA","text":"...Hm? <span class=\"highlight\">Forename</span>. It pleases me to see you well."},{"name":"TATARU","text":"Do excuse me for interrupting, <span class=\"highlight\">Forename</span>. My lady, the gentleman from Ashgana Exports has just left."},{"name":"TATARU","text":"&lt;sigh&gt; I understand now why you didn't want to receive him."},{"name":"MINFILIA","text":"You did well, Tataru. Please inform the guards that we will not be receiving any further guests this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>."},{"name":"TATARU","text":"Thank you, my lady!"},{"name":"MINFILIA","text":"Ever since we defeated Gaius van Baelsar and destroyed his ultimate weapon, the eyes of the world have followed our every move, scarce remembering to blink."},{"name":"MINFILIA","text":"Where once we worked in secret─with precious few friends and all too many enemies─we are now besieged by benefactors, each one more eager than the last to offer us his complete support."},{"name":"MINFILIA","text":"A true embarrassment of riches..."},{"name":"MINFILIA","text":"Of course, every promise of patronage comes with a price."},{"name":"MINFILIA","text":"Some make their intentions known from the start, while others endeavor to engage us more subtly. Dress it how they will, the message is ever the same: we shall help you, but only if you help us."},{"name":"MINFILIA","text":"The gentleman Tataru spoke of was more brazen than most. In exchange for certain supplies, he would have us <span class=\"emphasis\">resolve</span> a business dispute."},{"name":"MINFILIA","text":"Naturally, I refused him, as I have every other merchant of his ilk... Alas, the Syndicate's overtures are not so easily rejected..."},{"name":"MINFILIA","text":"When we formed the Scions of the Seventh Dawn, it was with the goal of serving Eorzea, not the interests of individual Eorzeans. Our neutrality is fundamental to our cause."},{"name":"MINFILIA","text":"In my heart, I <span class=\"emphasis\">know</span> this to be true, and yet... And yet... If accepting these offers of patronage could empower us to do greater good, might they not warrant greater consideration?"},{"name":"MINFILIA","text":"Our Baldesion colleagues have been generous beyond measure, but we cannot expect them to─"},{"name":"MINFILIA","text":"Forgive me. I did not mean to burden you so."},{"name":"MINFILIA","text":"Yet...my urge to share this dilemma may not be wholly misguided... Might I impose upon you to consult the others? They are like to have their own opinions on this matter."},{"name":"MINFILIA","text":"I confess, I am...conflicted. It may be wise to consult with the others."},{"name":"THANCRED","text":"Fortune begets power, and power fortune. That we─and especially <span class=\"emphasis\">you</span>─have power is beyond doubt. The question is what to do with it..."},{"name":"THANCRED","text":"You may be interested to know that there is a growing belief amongst the refugees that Ala Mhigo could be liberated...if only the Scions would commit their strength to the cause."},{"name":"THANCRED","text":"Yet theirs is but one of many causes. We stand at a crossroads, <span class=\"highlight\">Forename</span>. Each path is paved with good intentions, but where they lead is far from clear."},{"name":"YSHTOLA","text":"Recall you our meeting with the Admiral, shortly after the Lominsans sent word of the summoning of Titan?"},{"name":"YSHTOLA","text":"Then mayhap you also recall my words to our host. I said unto Merlwyb that her people had broken their treaty with the kobolds, and that the beastmen had justly responded─that we had been called to intervene in a conflict which she herself had invited. I spoke, in short, the truth."},{"name":"YSHTOLA","text":"And wherefore did I speak it? Because, owing no allegiance to Limsa, I felt no compulsion to allow the Lominsans to distort the facts to fit a narrative which justified their actions and absolved them of guilt."},{"name":"YSHTOLA","text":"Upon this subject, Minfilia can expect a similar reply. Our many dalliances with the city–states have already weakened our claim to neutrality, but the path she contemplates would see us relinquish it entirely."},{"name":"PAPALYMO","text":"None can deny that we would benefit from more support, but if it comes at the cost of our principles?"},{"name":"PAPALYMO","text":"Neutrality was ever a delicate matter. I've lost count of the times I've had to explain to people that our allegiances need not <span class=\"emphasis\">necessarily</span> lie in the same place as our headquarters. Mind you, if we <span class=\"emphasis\">are</span> to sell our services for gil, we might as well declare our fealty to Ul'dah now, and have done with it. I'm quite sure Yda would enjoy the bribes..."},{"name":"YDA","text":"I've been receiving a <span class=\"emphasis\">lot</span> of gifts lately, but Papalymo keeps making me send them back."},{"name":"YDA","text":"It wouldn't be so bad, but some of them are <span class=\"emphasis\">really</span> nice! I mean, very nearly abandon-your-principles nice, you know?"},{"name":"URIANGER","text":"'Tis the lot of the powerful to attract the covetous as well as the needy. Thus doth prudence dictate that those with power proffer aid with one hand whilst the other resteth ever on their hilt."},{"name":"URIANGER","text":"Alas, we have not the luxury of time to decipher our petitioners' machinations─nay, not while the beast tribes do labor unseen, defiant in defeat, to raise up their fallen primals once more."},{"name":"URIANGER","text":"Doubt not that they shall return─stronger and bolder both─nor that we shall be the ones to meet them. This sacred charge shall ever be ours. 'Tis but a pity we are so few, and our fortune so finite..."},{"name":"ALPHINAUD","text":"Hm. This situation is not wholly unexpected."},{"name":"ALPHINAUD","text":"I too have given much thought to our organization's future...though it would seem I have reached a different conclusion."},{"name":"ALPHINAUD","text":"Mayhap it is time I made my feelings known to the Antecedent. Come along, <span class=\"highlight\">Forename</span>."},{"name":"MINFILIA","text":"Alphinaud, <span class=\"highlight\">Forename</span>? Is aught amiss?"},{"name":"ALPHINAUD","text":"You desired counsel, and so you shall have it. Minfilia─the Scions of the Seventh Dawn must leave Ul'dah."},{"name":"MINFILIA","text":"We must do <span class=\"emphasis\">what</span>?"},{"name":"ALPHINAUD","text":"So long as we remain within Ul'dahn territory, we will never be free to act with impunity."},{"name":"ALPHINAUD","text":"Moving our headquarters to Vesper Bay only delayed the inevitable."},{"name":"ALPHINAUD","text":"We have demonstrated our capabilities, and the Syndicate has taken note. They will not suffer our organization to remain independent now. We are far too dangerous for that."},{"name":"ALPHINAUD","text":"Surely you realize they are the reason Vesper Bay still lacks an aetheryte?"},{"name":"ALPHINAUD","text":"They know full well how beneficial one would be to our cause..."},{"name":"ALPHINAUD","text":"Which is why it and other favors will be denied us unless we cooperate."},{"name":"MINFILIA","text":"If Ul'dah is no longer suitable, where would you have us go?"},{"name":"ALPHINAUD","text":"Experience has taught us that the appearance of neutrality is as important as the reality."},{"name":"ALPHINAUD","text":"Accordingly, we must keep each of the great nations at arm's length, and plant our banner in a place which all agree to be beyond their borders."},{"name":"ALPHINAUD","text":"Mor Dhona."},{"name":"ALPHINAUD","text":"Revenant's Toll, to be precise. It lies within neutral territory, and offers all the essential facilities we require. By way of an additional benefit, it is also frequented by a veritable legion of adventurers who may serve to supplement our ranks."},{"name":"ALPHINAUD","text":"I am, of course, conscious of the fact that we have developed a certain bond with Ul'dah and her people over the years..."},{"name":"ALPHINAUD","text":"But I truly believe this to be the best course of action."},{"name":"MINFILIA","text":"As you yourself observed, we have invaluable ties to the local community, forged through years of concerted effort. Ul'dah...Ul'dah is our <span class=\"emphasis\">home</span>, Alphinaud! To cast aside everything we have built and start anew in that desolate wasteland would be beyond reckless!"},{"name":"ALPHINAUD","text":"The decision is yours to make, Antecedent. I ask only that you recall the shared purpose which first moved us to found the Scions of the Seventh Dawn─and which moved you to found the Path of the Twelve ere that."},{"name":"ALPHINAUD","text":"We aspire to an ideal, you and I. Just as my grandfather did. That makes us more than mere comrades-in-arms."},{"name":"ALPHINAUD","text":"We are as much your family as─"},{"name":"MINFILIA","text":"That will be all, Alphinaud."},{"name":"MINFILIA","text":"I am sure you have some familial affairs of your own to attend to."},{"name":"ALPHINAUD","text":"Your concern is <span class=\"emphasis\">most</span> generous, but no─I have left them in the hands of men better suited to the task than I. I could not very well allow my personal affairs to come before the needs of the order, after all."}],"reward":{"gil":939,"items":[{"id":4523,"one":1},{"id":4524,"one":1},{"id":4520,"one":1},{"num":3,"id":5824,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[70058]},"next":[66712,69410]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1007722","obj":{"i":1007722,"n":"Alphinaud","l":356,"q":3}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1007530","obj":{"i":1007530,"n":"Yda","l":356,"q":1}},{"type":"npc","id":"1007531","obj":{"i":1007531,"n":"Papalymo","l":356,"q":2}},{"type":"npc","id":"1007533","obj":{"i":1007533,"n":"Y'shtola","l":356,"q":2}},{"type":"npc","id":"1007534","obj":{"i":1007534,"n":"Thancred","l":356,"q":4}},{"type":"item","id":"4523","obj":{"i":4523,"n":"Darklight Band of Fending","l":70,"c":54499,"t":43}},{"type":"item","id":"4524","obj":{"i":4524,"n":"Darklight Band of Maiming","l":70,"c":54508,"t":43}},{"type":"item","id":"4520","obj":{"i":4520,"n":"Darklight Band of Striking","l":70,"c":54498,"t":43}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"66712","obj":{"i":66712,"n":"Moving On","g":0,"l":"The Waking Sands","s":2}},{"type":"quest","id":"69410","obj":{"i":69410,"n":"Moving On","g":2,"l":"The Waking Sands","s":3}}]}