{"quest":{"name":"Monstrous Mummery","location":"Ul'dah","id":66710,"patch":3.1,"sort":16,"icon":100171,"eventIcon":71221,"issuer":1005487,"target":1005487,"involved":[1001353],"genre":203,"usedItems":[6108],"journal":["The Impresario has yet another task for you. He just isn't quite sure what it is yet.<br>※This quest is available for a limited time only.","The Impresario, pleased with your honest efforts on his troupe's behalf, has entrusted you with the most vital task of placing one final warding lantern in a dimly lit area of town. Speak once more to the shifty thespian to obtain the necessary supplies.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have obtained the final warding lantern and the means by which to light it. Proceed to place it as directed.","The lantern having been successfully placed, proceed to light it with the bomb digit.","Upon lighting the final warding lantern, a curious voice speaks to you, raising doubts as to the true identity of the Impresario and his men, and encouraging you to seek the truth from the troupe's purported patrons. Begin your investigation by speaking to Flame Captain Ambric at the Hall of Flames.","Ambric insists that the Immortal Flames have had no dealings with the Impresario and his dubious band, saying that he hears they were personally summoned to Ul'dah by the sultana herself. Seek the truth from Raragun at the Gladiators' Guild.","Raragun is adamant that the Sultansworn know nothing of the Impresario and his troupe, saying that he heard that they were invited by the Adventurers' Guild. Make for the Quicksand and see what Momodi might know of the matter.","Hearing your words, Momodi concludes that the Impresario is not who he claims to be. Use the sparkler she has given you to spook the dubious troupemaster into showing his true colors.","Spooked clean out of his costume, the Impresario is revealed to be an actual imp. As he tells it, he and his monstrous minions cooked up their scheme in hopes for a return to the old days, when All Saints' Wake afforded an opportunity for his kind to frolic and purvey mischief in town. Assuring you that he means no harm, you agree to keep his secret. All told, this has proven to be an eventful All Saints' Wake─though the true identity of the disembodied voice that guided you to the truth remains cloaked in shadows..."],"objectives":["While in costume, speak with the shifty thespian.","While in costume, place the warding lantern in the specified location.","While in costume, light the warding lantern.","Speak with Ambric at the Hall of Flames.","Speak with Raragun at the Gladiators' Guild.","Speak with Momodi at the Quicksand.","While in costume, use the spooky sparkler to frighten the Impresario."],"dialogue":[{"name":"IMPHEAD","text":"Back again? I thought I'd given you enough work to keep you out of our─ Ahem! Your efforts on my troupe's behalf have so impressed me that I would entrust to you the most important task of all. What manner of task, you ask? Why, that would be, ah...erm..."},{"name":"IMPHEAD","text":"Ah, yes! This lantern here!"},{"name":"IMPHEAD","text":"Yes, I am certain there is some unlit nook or cranny of this city that is in dire need of illumination, and you are unquestionably the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job!"},{"name":"IMPHEAD","text":"Now, procure the necessary supplies from my associate over there, and hop to it. I have more important matters to attend to! Heh heh heh..."},{"name":"IMPA","text":"One final lantern? How odd, I could have sworn that we had lit them all..."},{"name":"IMPA","text":"But who am I to question the Impresario? Very well, take this bomb digit and do with it as you will."},{"name":"IMPA","text":"Is it truly wise to be walking around without your costume like that? These streets aren't safe for adventurers...heh heh."},{"name":"PUMPKIN","text":"(-Disembodied Voice-)<span class=\"emphasis\">Don your guise, living one... 'Tis unsafe to reveal yourself here...</span>"},{"name":"PUMPKIN","text":"(-Disembodied Voice-)<span class=\"emphasis\">Ah, the flames warm my belly. Thank you, living one...</span>"},{"name":"PUMPKIN","text":"(-Disembodied Voice-)<span class=\"emphasis\">The monstrous troupers you consort with...do you not wonder whence they truly hail?</span>"},{"name":"PUMPKIN","text":"(-Disembodied Voice-)<span class=\"emphasis\">Should you be curious, you would do well to speak with their purported patrons. But be warned, friend─some secrets are best left to dwell in the darkness...</span>"},{"name":"AMBRIC","text":"Ah, those performers. Their guises are a bit <span class=\"emphasis\">too</span> convincing, if you ask me. All Saints' Wake or no, I am ill pleased to see such baleful creatures skulking about the streets of our fair nation."},{"name":"AMBRIC","text":"It is the sworn duty of the Immortal Flames to safeguard Ul'dah and its people. I must admit to having my reservations about encouraging such idle revelry in these trying times."},{"name":"AMBRIC","text":"But the summons came directly from the sultana herself─or so I've heard─and it is far from my place to question Her Grace. If you would know more, Raragun of the Sultansworn might be able to enlighten you."},{"name":"RARAGUN","text":"Ambric said <span class=\"emphasis\">what</span>!? That the sultana herself invited that troupe to Ul'dah!? Preposterous!"},{"name":"RARAGUN","text":"No, this was all the Adventurers' Guild's doing, if I've heard true. I suggest you take it up with Momodi─hells, I've a mind to do so myself!"},{"name":"MOMODI","text":"You were told what? That it was the Adventurers' Guild─and me in particular─that brought that ghastly troupe to Ul'dah?"},{"name":"MOMODI","text":"Utterly ridiculous! After all, with that troupe taking in all the proceeds, what profit could possibly be in it for me?"},{"name":"MOMODI","text":"No, I've seen enough thieves and tricksters in my day to know when someone's pullin' a fast one on me."},{"name":"MOMODI","text":"Why don't you take this and give that self-styled Impresario a scare of his own? I reckon that'll spook the truth out of him."},{"name":"IMPHEAD","text":"Wh-What in the─!?"},{"name":"IMPHEAD","text":"M-My disguise! It's ruined! What did ya have to do that for!?"},{"name":"IMPHEAD","text":"Bah, seven hells! All right, ya got me. That's right, the self-styled Impresario is a real, honest-to-goodness imp."},{"name":"IMPHEAD","text":"Whoa! Settle down, <span class=\"alternative-container\"><span class=\"alternative\">little lady</span><span class=\"alternative\">big fella</span></span>! So the whole traveling circus thing was a sham─ya got me there. But, cross my wings and hope to die, I swear we didn't mean ya no harm."},{"name":"IMPHEAD","text":"Back in the old days, when celebratin' All Saints' Wake was in fashion, it was the one time a year when we could leave the dank ol' dungeons we called home, stretch our wings a bit, and mingle with the city folk."},{"name":"IMPHEAD","text":"Sure, we caused our share of mischief─and occasionally spooked some ol' grandma half to death─but we never hurt no one. Not on purpose, at least..."},{"name":"IMPHEAD","text":"Ever since the Calamity, though, everyone's so godsdamned <span class=\"emphasis\">serious</span>. Can't even come within eyeshot of the city limits without some overzealous adventurer like yourself wavin' a weapon at me, out for blood. Can ya blame us for wantin' to bring back the old customs?"},{"name":"IMPHEAD","text":"Ah, but what does it matter now? Thanks to your meddlin', our charade is through. And I know exactly what happens next."},{"name":"IMPHEAD","text":"Yep, you're going to tear off the costume I so kindly provided for you─free of charge, I might add─slip into your favorite suit of armor, and hack my poor little wings off. All for the <span class=\"emphasis\">crime</span> of trying to have a little fun."},{"name":"IMPHEAD","text":"Truly? You'll...you'll keep our secret?"},{"name":"IMPHEAD","text":"Who'd've thunk it? You adventurers aren't all so bad. Me and my minions, we'll not forget this kindness. "},{"name":"IMPHEAD","text":"That said, ya have to admit that our ruse was quite the clever one. Just tell me this: however did ya manage to see through it all?"},{"name":"IMPHEAD","text":"A pumpkin spilled our secrets, ya say? Hah, that's a good one!"},{"name":"IMPHEAD","text":"Listen, the Great Gourd was just a tall tale that I cooked up to give adventurers like you a good fright! Are you suggesting that some overgrown pumpkin could truly...?"},{"name":"IMPHEAD","text":"Well, this is All Saints' Wake. Who knows what mysteries the night still holds?"},{"name":"IMPHEAD","text":"So tread carefully, adventurer! And do be wary of the shadows. Heh heh heh..."},{"name":"PUMPKIN","text":"(-Disembodied Voice-)<span class=\"emphasis\">Adventurers and monsters, reveling as one～♪<br>And with this, my work is done～♪</span>"},{"name":"IMPHEAD","text":"What's the matter, friend? Have you misplaced your costume? I fear I cannot allow you to participate in the festivities unless you are dressed for the part."}],"reward":{"items":[{"id":6107}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66709]}},"partials":[{"type":"npc","id":"1005487","obj":{"i":1005487,"n":"Impresario","l":40,"q":4}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"item","id":"6107","obj":{"i":6107,"n":"The Howling Spirit","l":1,"c":43579,"t":35,"p":98}},{"type":"item","id":"6108","obj":{"i":6108,"n":"The Wailing Spirit","l":1,"c":43578,"t":35,"p":98}},{"type":"quest","id":"66709","obj":{"i":66709,"n":"I Burn for You","g":203,"l":"Ul'dah","s":15}}]}