{"quest":{"name":"Moving On","location":"The Waking Sands","id":66712,"patch":2.1,"sort":2,"eventIcon":71201,"target":1006355,"involved":[1007722,1007740],"genre":0,"journal":["Once again, Minfilia appears to be lost in thought.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","According to Alphinaud, the Antecedent's blind refusal to contemplate leaving Ul'dah stems from the empty hope that her late mother F'lhaminn still lives. For whatever reason, rumors have recently begun to circulate that the famed songstress did not perish in the fires of the Calamity. Convinced that Minfilia will not see sense until these rumors have been proven false, Alphinaud has resolved to determine their origin, and asks that you assist him. Speak with Father Iliud at the Church of Saint Adama Landama to learn the source of one such rumor.","Father Iliud makes no claim to have seen F'lhaminn himself, only to have met someone who claims to have done so... Fortunately, the fellow in question is close at hand. Seek him out in the lichyard and hear his testimony.","The visitor seems supremely confident that the woman he spied in Costa del Sol was indeed F'lhaminn, despite having only seen the famous performer once before─a full seven years ago. It may be prudent to ask Father Iliud whether he believes this man's tale should be taken seriously.","Without proof, it is impossible to determine whom the visiting mourner did or did not see. Nevertheless, you now know the location of an alleged sighting, and Father Iliud believes it merits further investigation."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span>"],"dialogue":[{"name":"MINFILIA","text":"Leave Ul'dah... Has it truly come to this?"},{"name":"MINFILIA","text":"...Hm? Oh. <span class=\"highlight\">Forename</span>. Pray attend to Alphinaud."},{"name":"MINFILIA","text":"He is engaged in some business or other and requires your assistance."},{"name":"MINFILIA","text":"Pray be on your way. Alphinaud waits upon you, and I have much to think about."},{"name":"MINFILIA","text":"Oh, and...tell him he shall have my answer in due time."},{"name":"ALPHINAUD","text":"Confound it. She knows what must be done, and still she hesitates."},{"name":"ALPHINAUD","text":"All because of these fanciful rumors."},{"name":"ALPHINAUD","text":"Hm. I should explain. Minfilia's mother─well, adoptive mother─was among the great many who perished during the Calamity."},{"name":"ALPHINAUD","text":"F'lhaminn was her name, though you may know her better as the “Songstress of Ul'dah.” She was a performer of singular talent, and much beloved by the people of Eorzea─not to mention a certain Sharlayan minstrel."},{"name":"ALPHINAUD","text":"As you may imagine, the news of her passing was greeted with shock and disbelief by her adoring followers, many of whom refused to acknowledge what had happened. That her body was never found only served to encourage speculation."},{"name":"ALPHINAUD","text":"Minfilia, too, struggled at first to accept the truth, but as F'lhaminn's absence stretched from months into years, she saw that there could be no other explanation."},{"name":"ALPHINAUD","text":"Until recently, at any rate. For whatever reason, rumors have once again begun to circulate that F'lhaminn is alive and well."},{"name":"ALPHINAUD","text":"Alas, they have served to rekindle an irrational hope in Minfilia which now clouds her judgment. This talk of Ul'dah as our home, and of the insurmountable difficulties of moving to Mor Dhona─it is no more than an expression of her unwillingness to let go. Nonsense, in a word. But until the tales of F'lhaminn's miraculous preservation have been categorically disproved, I fear she will remain lost to reason."},{"name":"ALPHINAUD","text":"That being the case, I propose we set about disproving them posthaste. Let's see how these fanciful claims stand up to investigation."},{"name":"ALPHINAUD","text":"One of the most recent of this latest crop of rumors comes to us by way of Father Iliud. Question him for me. I shall look into another alleged sighting and follow anon."},{"name":"ILIUD","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, <span class=\"highlight\">Forename</span>. Alphinaud told me to expect you."},{"name":"ILIUD","text":"Now, you are doubtless eager to ask me certain questions, but before you do, I must stress that I myself did not see F'lhaminn─though I very much wish I had. I merely hearkened unto the tale of a mourner who came to stay with us."},{"name":"ILIUD","text":"He is still here, if you wish to hear it for yourself. You will find him in the lichyard, I should think."},{"name":"GRAVEMAN","text":"...Aye, I saw F'lhaminn─just as clearly as I see you now. And yes, I'm sure it was her, before you ask. I could <span class=\"emphasis\">never</span> forget a woman like that!"},{"name":"GRAVEMAN","text":"'Twas nigh on seven summers ago I first set eyes on her, and I still remember it as if it were yesterday."},{"name":"GRAVEMAN","text":"I'm happy to report that the years have only made her more beautiful!"},{"name":"GRAVEMAN","text":"Where did I─? Oh, Costa del Sol! She was giving lessons to Gegeruju's women, and her voice─gods, her voice... That soft tinkling of bells resonated in my very soul."},{"name":"GRAVEMAN","text":"I dare not say how her songs touched me..."},{"name":"GRAVEMAN","text":"I didn't think I'd ever feel this way again─not when I lost you, my dear... And it's not the same, it really isn't... But it's been over a year now, and I've been so lonely..."},{"name":"ILIUD","text":"...Do I believe the man's tale? Well...I believe that he believes it. Though I do wonder..."},{"name":"ILIUD","text":"I doubt I would recognize someone I barely knew whom I hadn't seen in seven years."},{"name":"ILIUD","text":"But if there is even the slightest possibility that F'lhaminn yet lives, do we not owe it to Minfilia to pursue it?"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66711]},"next":[66713]},"partials":[{"type":"npc","id":"1006355","obj":{"i":1006355,"n":"Iliud","l":44,"q":9}},{"type":"npc","id":"1007722","obj":{"i":1007722,"n":"Alphinaud","l":356,"q":3}},{"type":"npc","id":"1007740","obj":{"i":1007740,"n":"Lichyard Visitor","l":44,"q":1}},{"type":"quest","id":"66711","obj":{"i":66711,"n":"The Price of Principles","g":2,"l":"The Waking Sands","s":1}},{"type":"quest","id":"66713","obj":{"i":66713,"n":"Flowers for One","g":0,"l":"Eastern Thanalan","s":3}}]}