{"quest":{"name":"Flowers for One","location":"Eastern Thanalan","id":66713,"patch":2.1,"sort":3,"eventIcon":71201,"target":1007752,"involved":[1006273,1006305,1006306,1006309,1007738,1007739],"genre":0,"journal":["Father Iliud wishes to say a few words before you depart for Costa del Sol.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","A heartbroken Gegeruju is further dismayed to learn that the object of his affections, who only recently left, was none other than the famed Songstress of Ul'dah. Though he recalls her expressing a desire to visit Wineport, he assures you that F'lhaminn will soon tire of her rough style of living and return to his waiting arms. Providing you do not share his optimism, journey to Wineport and question the local residents.","Your cursory investigation yields a promising lead, provided by the incorrigible Wine Baron of Limsa Lominsa. Apparently, a woman matching F'lhaminn's description visited Byrglaent's winery very recently, but, finding her perfume to be intolerable, he expelled her from the premises. Though he has no inkling as to where she went next, the Wine Baron suggests that you solicit the aid of Shamani Lohmani, reasoning that his unique talents may enable him to track the perfumed lady.","Shamani Lohmani vividly recalls the woman's scent, as well as the conversation he had with her. After observing that her perfume was reminiscent of a local species of flower, she asked him where she might find the most pristine specimens, and he duly told her. Assuming she followed his directions, she would then have proceeded south into Raincatcher Gully. With luck, she may still be there.","You succeed in locating your quarry mere moments before a ravenous goobbue emerges from the forest, seemingly intent on devouring you both. Undeterred, you set about the beast, and it soon succumbs to your onslaught. All that remains is to verify the identity of the perfumed lady.","Your attempts to ascertain the perfumed lady's identity succeed only in arousing her suspicion, but when Alphinaud subsequently enters the scene, she has no choice but to admit that she is indeed F'lhaminn. With much to discuss, the three of you agree to adjourn to Wineport, where you may continue your conversation in safety.","Alphinaud informs you that, despite his best efforts, F'lhaminn will not be persuaded to accompany you to Vesper Bay until she has completed her perfume. Left with no better option, he asks that you hasten the process by assisting her in whatever way necessary."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span>"],"dialogue":[{"name":"ILIUD","text":"If this woman resembling F'lhaminn was employed at Costa del Sol, then that is where you should go."},{"name":"ILIUD","text":"I will inform Alphinaud of these latest developments. You need only concern yourself with the search."},{"name":"ILIUD","text":"Master Gegeruju should remember you from your past engagements, so I suggest you waste no time and approach him directly."},{"name":"GEGERUJU","text":"&lt;sigh&gt; O sweet siren of the sands, my Miqo'te muse! Why have you forsaken me...?"},{"name":"GEGERUJU","text":"T-Titan's Bane! I mean, <span class=\"highlight\">Forename</span>! What brings you to my humble resort?"},{"name":"GEGERUJU","text":"<span class=\"emphasis\">F'lhaminn</span>!? You mean to tell me the goddess-made-flesh who dwelt among us until so very recently was <span class=\"emphasis\">the</span> Songstress of Ul'dah!? Egads, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>─if I had known that, I would've chained her to my bedpost and never let her leave!"},{"name":"GEGERUJU","text":"Ahem! An exaggeration for dramatic effect. As to her current whereabouts, I recall she mentioned Wineport. Ah, but there is no need to pursue her, my friend! When she tires of her rough way of living, she will make straight for Costa del Sol, and fling herself into my waiting arms, flushed and breathless..."},{"name":"JUNGHBHAR","text":"...Eh? You want to know if I've seen a Miqo'te lass by the name of F'lhaminn? I wish! I haven't seen a lass of <span class=\"emphasis\">any</span> description for far too bloody long... Er, excepting yourself, of course."},{"name":"BYRGLAENT","text":"Well, if it isn't <span class=\"highlight\">Forename</span>, the savior of Wineport! To what do we owe the pleasure?"},{"name":"BYRGLAENT","text":"Ah, yes, we did receive a customer matching that description. She was a delight to behold, to give the woman her due, but her perfume was so ghastly, I had no choice but to eject her from the premises. Interfering with tastings, you understand."},{"name":"BYRGLAENT","text":"If she is your quarry, why not consult your blind associate? His olfactory perception is without peer. Given that <span class=\"emphasis\">I</span> could smell the woman from a malm away, I daresay he could smell her from <span class=\"emphasis\">ten</span>."},{"name":"SHAMANILOHMANI","text":"&lt;sniff&gt; &lt;sniff&gt; I see you have had many grand adventures since last we spoke, <span class=\"highlight\">Forename</span>. You must share them with me sometime."},{"name":"SHAMANILOHMANI","text":"The girl from a little while ago? One does not forget a perfume like that. So robust and intoxicating...yet simultaneously familiar. Reminiscent of a bloom native to these parts, in fact."},{"name":"SHAMANILOHMANI","text":"I said as much when we spoke. She complimented my powers of observation and asked me where she might find some of the flowers."},{"name":"SHAMANILOHMANI","text":"So I told her to follow the road south into Raincatcher Gully and then head east after crossing the second bridge. The flowers which grow in the shade of the cliff have the strongest scent, you see. If you make haste, you may yet find her there."},{"name":"SHAMANILOHMANI","text":"The lady you seek did not leave all that long ago. Make haste to the second bridge, then head due east. Look for the flowers which grow in the shade of the cliff, and with luck you may yet find her."},{"name":"FLHAMINN","text":"I am in your debt, stranger. I did not realize my activities had aroused the goobbue's ire until it was too late."},{"name":"FLHAMINN","text":"Their oils can be used to make a perfume, you see, and I─"},{"name":"FLHAMINN","text":"<span class=\"emphasis\">F'lhaminn</span>? I'm... I don't..."},{"name":"FLHAMINN","text":"Who are you? Whom do you serve?"},{"name":"ALPHINAUD","text":"Typical. Of all the many leads, yours <span class=\"emphasis\">obviously</span> had to be the one which bore fruit. I don't know why I bother..."},{"name":"ALPHINAUD","text":"The Songstress of Ul'dah, I presume? Minfilia─or should I say, Ascilia─is looking for you."},{"name":"FLHAMINN","text":"Ascilia!?"},{"name":"ALPHINAUD","text":"You are the very picture of health, milady─yet the world thinks you dead."},{"name":"ALPHINAUD","text":"I can only conclude that this was by design. The question is: why?"},{"name":"FLHAMINN","text":"Not everyone who endeavors to find me does so with the best intentions, child."},{"name":"FLHAMINN","text":"You will be pleased to know that I fully intend to reveal myself to Minfilia─when the time is right."},{"name":"ALPHINAUD","text":"Oh! Well...that does please me. More than you know. But tell me: sojourns in the forests of La Noscea aside, when exactly <span class=\"emphasis\">will</span> the time be right?"},{"name":"FLHAMINN","text":"When I deem it so. Do you imagine I traveled all this way on a whim? As I was telling your associate prior to your intrusion, I came here to harvest these flowers for use in a perfume. Does that satisfy your curiosity, or would you interrogate me further?"},{"name":"ALPHINAUD","text":"M-My apologies for the interruption. Anyway─now that we all have that which we came for, might we continue this conversation in a safer locale? Wineport, say?"},{"name":"ALPHINAUD","text":"Then it's settled. To Wineport, <span class=\"highlight\">Forename</span>!"},{"name":"FLHAMINN","text":"Yes, this will do nicely..."},{"name":"ALPHINAUD","text":"This...this is not <span class=\"emphasis\">at all</span> how I had envisioned it."},{"name":"ALPHINAUD","text":"Ahem. Having been apprised of our situation, Lady F'lhaminn has consented to plead our case to Minfilia regarding the proposed move to Mor Dhona."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">However</span>, she will only do so once her perfume is complete. Moreover, she <span class=\"emphasis\">insists</span> that we aid her in obtaining the final ingredient."},{"name":"ALPHINAUD","text":"She will not be swayed. I assure you, I tried."},{"name":"ALPHINAUD","text":"...Let's just get this over with, shall we?"},{"name":"FLHAMINN","text":"Rescued yet again from the jaws of a ravenous goobbue. How quickly we forget the lessons of the past."},{"name":"FLHAMINN","text":"&lt;sigh&gt; Though I was not solely to blame for that foolishness..."},{"name":"POP","text":"Something massive this way trundles!"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66712]},"next":[66714]},"partials":[{"type":"npc","id":"1007752","obj":{"i":1007752,"n":"Alphinaud","l":32,"q":3}},{"type":"npc","id":"1006273","obj":{"i":1006273,"n":"Gegeruju","l":32,"q":7}},{"type":"npc","id":"1006305","obj":{"i":1006305,"n":"Shamani Lohmani","l":32,"q":9}},{"type":"npc","id":"1006306","obj":{"i":1006306,"n":"Byrglaent","l":32,"q":3}},{"type":"npc","id":"1006309","obj":{"i":1006309,"n":"Junghbhar","l":32,"q":2}},{"type":"npc","id":"1007738","obj":{"i":1007738,"n":"F'lhaminn","l":32,"q":1}},{"type":"npc","id":"1007739","obj":{"i":1007739,"n":"F'lhaminn","l":32,"q":2}},{"type":"quest","id":"66712","obj":{"i":66712,"n":"Moving On","g":0,"l":"The Waking Sands","s":2}},{"type":"quest","id":"66714","obj":{"i":66714,"n":"All Things in Time","g":0,"l":"Eastern La Noscea","s":4}}]}