{"quest":{"name":"All Things in Time","location":"Eastern La Noscea","id":66714,"patch":2.1,"sort":4,"icon":100173,"eventIcon":71201,"target":1006693,"involved":[1007752],"genre":0,"journal":["F'lhaminn awaits your assistance.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to F'lhaminn in Wineport.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Gazing upon the foul-smelling pugil carcasses is enough to deprive you of any lingering appetite. You can only hope that the gurangatch will regard them more favorably. Place the bait at the water's edge in gurangatch territory and find out if your quarry's tastes truly are so different from your own.","The trap now set, you can but wait and hope. Retreat to a safe distance and bide your time.","As if to confirm the fundamental differences between the palates of your respective species, the pugil carcasses prove irresistible to a truly gigantic gurangatch, which you duly slay. While you set about the nauseating task of scraping the creature's belly oil into a flask, you ponder what manner of individual first thought to use the secretions in a perfume... Push such irrelevant musings aside and deliver the fetid fruits of your labors to F'lhaminn in Wineport.","F'lhaminn requires only a brief moment to finish her perfume. Her preparations complete, she agrees to accompany you and Alphinaud to Vesper Bay. Return to the Waking Sands and seek an audience with Minfilia.","Upon seeing Alphinaud escort F'lhaminn into the solar, Minfilia rushes forward to embrace her long-lost mother, overjoyed to learn that reports of her death were indeed exaggerated. During their tearful reunion, Minfilia explains that her father was once a member of the Ala Mhigan Resistance, and that following his death in a tragic accident, F'lhaminn raised her as her own. After praising Minfilia for her victories over the Empire, F'lhaminn states that the Scions must leave Ul'dah behind if they are to continue their work. Agreeing at last to Alphinaud's proposal, a reinvigorated Minfilia declares that the order will quit Vesper Bay and establish a new headquarters in Revenant's Toll."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to F'lhaminn in Wineport.</span>"],"dialogue":[{"name":"FLHAMINN","text":"Believe me when I tell you that I am every bit as eager to return to Vesper Bay as you are. There is work to be done ere that, however, so listen well."},{"name":"FLHAMINN","text":"I require pristine salamander oil to complete my perfume."},{"name":"FLHAMINN","text":"Oil this pure can only be obtained from the belly of a gurangatch, a notoriously elusive species of wavekin native to Bronze Lake."},{"name":"FLHAMINN","text":"Elusive, I say, yet no less sensible to the allure of the right bait. In this instance, that would be freshly slain mud pugils. Three placed at the water's edge should be sufficient to tempt any gurangatch lurking nearby."},{"name":"FLHAMINN","text":"They are aggressive when startled, and will attack on sight. Yet given the ease with which you dispatched that goobbue, I doubt they will trouble you unduly."},{"name":"ALPHINAUD","text":"Despite her years of nomadism, it would seem Lady F'lhaminn has kept a close eye on the affairs of our order. Surprisingly close, in fact. Suffice to say, she is nothing if not resourceful."},{"name":"ALPHINAUD","text":"One does not develop such skills without effort─or without reason."},{"name":"FLHAMINN","text":"Understand it is of the utmost importance that I finish this perfume before I accompany you to Vesper Bay. Please bring me the oil as soon as possible."},{"name":"FLHAMINN","text":"Once again, I am in your debt."},{"name":"FLHAMINN","text":"I distilled the flowers' oils in your absence, so all that remains is to...<br>There. It is ready."},{"name":"FLHAMINN","text":"And so am I. It is time we went to see my daughter."},{"name":"FLHAMINN","text":"We've no reason to stay here. Why do you delay? I have kept my daughter waiting long enough."},{"name":"ALPHINAUD","text":"Antecedent─you have a guest."},{"name":"MINFILIA","text":"<span class=\"emphasis\">Lhaminn</span>!?"},{"name":"FLHAMINN","text":"Ascilia..."},{"name":"TATARU","text":"(I haven't seen her like this in years, <span class=\"highlight\">Forename</span>!)"},{"name":"MINFILIA","text":"I...I never truly believed it when they told me you were dead. But...what kept you away for so long?"},{"name":"FLHAMINN","text":"The imperials came for me, as I always knew they would. And so I resolved to stay as far away from you as I could, lest their pursuit of me endanger you and our cause. I could think of no better way to grant you the freedom to continue our work."},{"name":"FLHAMINN","text":"And continue it you did, achieving things I would not have imagined possible. I followed your every success, and celebrated in secret."},{"name":"FLHAMINN","text":"I'm so proud of you, Ascilia."},{"name":"MINFILIA","text":"I learned from the best."},{"name":"FLHAMINN","text":"I have a gift for you."},{"name":"MINFILIA","text":"Celsettia perfume! You remembered."},{"name":"FLHAMINN","text":"How could I ever forget? You wore it all the time. If ever I lost sight of you, I could find you again, just by following my nose."},{"name":"MINFILIA","text":"I did not think it was made anymore. You must have gone to so much trouble..."},{"name":"FLHAMINN","text":"It was no trouble to me, my darling. I fear I cannot say the same for <span class=\"highlight\">Forename</span>, however. I could not have made it without <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"MINFILIA","text":"Thank you, <span class=\"highlight\">Forename</span>. Thank you both."},{"name":"FLHAMINN","text":"There's something else."},{"name":"MINFILIA","text":"This...this is the cat's-eye I found! All these years you kept it..."},{"name":"MINFILIA","text":"My father was a member of the Ala Mhigan Resistance."},{"name":"MINFILIA","text":"When I was yet a child, he brought me here to Ul'dah. The accident which claimed his life happened shortly after our arrival."},{"name":"MINFILIA","text":"It was Lhaminn who took care of me then. She raised me as her own─taught me everything I needed to know to survive."},{"name":"ALPHINAUD","text":"Hmm. I am no stranger to the facts of your history, yet I fear I have failed to grasp their implications. It is clear that there is much I do not know─about you and your mother both."},{"name":"MINFILIA","text":"One of her first lessons to me concerned mining─and I was a <span class=\"emphasis\">very</span> dedicated student."},{"name":"MINFILIA","text":"This cat's-eye was the first stone I unearthed. It wasn't much, of course, but I was exceedingly proud to have found it nonetheless."},{"name":"MINFILIA","text":"So I gave it to Lhaminn as a gift. She said it was beautiful...<br>But there I am at a loss. Why are you returning this to me? Is something amiss?"},{"name":"FLHAMINN","text":"No, Ascilia, nothing is amiss! Quite the opposite! I need you to realize how far you've come, and how much further you may still─<span class=\"emphasis\">must</span> still go."},{"name":"FLHAMINN","text":"You and your allies have accomplished more than I could ever have hoped. You have succeeded where I failed, and made me so <span class=\"emphasis\">proud</span> that...that words fail me."},{"name":"FLHAMINN","text":"But even as I marvel at the woman you've become, and at all the many things you've done, I cannot help but think of that which you have yet to do, and of what it may entail. Ascilia...Daughter─you cannot stay here anymore. You and the Scions <span class=\"emphasis\">must</span> leave Ul'dah."},{"name":"MINFILIA","text":"Lhaminn..."},{"name":"FLHAMINN","text":"You built it once, Ascilia. You can build it again. And this time, we'll do it together."},{"name":"MINFILIA","text":"Truly?"},{"name":"MINFILIA","text":"Alphinaud. The time has come for the Scions to leave Vesper Bay."},{"name":"MINFILIA","text":"We shall establish a new headquarters in Revenant's Toll, as you proposed."},{"name":"MINFILIA","text":"Much work lies ahead of us. Inform our fellow Scions, and send word to the Students of Baldesion: preparations begin at once!"},{"name":"POP","text":"Ripples in the water catch your eye..."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66713]},"next":[66715]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1007752","obj":{"i":1007752,"n":"Alphinaud","l":32,"q":3}},{"type":"quest","id":"66713","obj":{"i":66713,"n":"Flowers for One","g":0,"l":"Eastern Thanalan","s":3}},{"type":"quest","id":"66715","obj":{"i":66715,"n":"The Resolute","g":0,"l":"The Waking Sands","s":5}}]}