{"quest":{"name":"Rock-solid Protection","location":"Mor Dhona","id":66718,"patch":2.1,"sort":7,"eventIcon":71201,"target":1006530,"involved":[1006220],"genre":0,"journal":["When it comes to keeping its home fires burning, the Adventurers' Guild is no stranger to caution. What fuel does Slafborn intend for you to gather today? ","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Bibimu welcomes you to the temple with a slightly funereal air. Plumb the ruin's depths and obtain a wardstone.<br><br>※The Sunken Temple of Qarn can be accessed via the Duty Finder.","You have gained a wardstone, as well as a few more nightmares to carry to the end of your days. Deliver the precious find to Slafborn at Revenant's Toll and be done with it.","Slafborn is happy to add the stone to the settlement's considerable defenses. If safety is an illusion, there is much magic in the Roegadyn..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"SLAFBORN","text":"There is much work to be done right here in Revenant's Toll, and we hope you can help."},{"name":"SLAFBORN","text":"The Toll grows and prospers─and attracts the jealous attention of Garleans and low creatures. We must see to our fortifications if we are not to be overrun."},{"name":"SLAFBORN","text":"The perimeter wall is solid enough. What we lack is less perceptible─magical defenses that will repel our enemies, the sort scholars of antiquity say were powered by ancient wardstones."},{"name":"SLAFBORN","text":"I am told there are many such stones in the ruins at Qarn─the Sunken Temple. More than a few temple raiders have been foiled by their magicks, no doubt."},{"name":"SLAFBORN","text":"It seems a fine jest that we adventurers are now to be guarded by the same magic that protected the treasures of Qarn against our too-adroit fingers!"},{"name":"SLAFBORN","text":"The temple is in southern Thanalan, as you may know. A lass by the name of Bibimu is the resident naturalist there. She will grant you entry, for she owes a favor or two to our guild."},{"name":"SLAFBORN","text":"I've no doubt you'll come across a wardstone as you make your way through the ruins. Bear in mind that your success will serve to strengthen relations between the Adventurers' Guild and the Scions."},{"name":"SLAFBORN","text":"In southern Thanalan lies the Sunken Temple of Qarn. Speak to the scholar Bibimu to enter the place."},{"name":"SLAFBORN","text":"Penetrate the mysteries of the ruins and the wardstone will be yours. Think of the protection that Revenant's Toll will gain...and of the agreement which must be fulfilled."},{"name":"BIBIMU","text":"Behold the magnificent ruin of the Sunken Temple of Qarn! We know it was used by the Belah'dians for the greater glory of Azeyma the sun goddess... As for the rest of it, you'll hear <span class=\"emphasis\">that</span> when I'm good and ready to publish."},{"name":"BIBIMU","text":"Oh, you're the adventurer that Slafborn sent word about?"},{"name":"BIBIMU","text":"Yes, no doubt there are wardstones to be had deep inside the ruins."},{"name":"BIBIMU","text":"I regret to remind you, however, that this temple has been the death of many an adventurer─Slafborn wasn't too specific about that, was he? These ruins are practically the antechamber to Thal's workroom. But do not let me deter you from your task! If you wish to proceed, be my guest."},{"name":"SYSTEM","text":"You must complete the Sunken Temple of Qarn to proceed. Please note that completion of the Sunken Temple of Qarn (Hard) will not affect your progress in this quest."},{"name":"SLAFBORN","text":"You'll have to explore the Sunken Temple of Qarn if you're to find a wardstone. Succeed, and you earn the undying gratitude of the Adventurers' Guild. Fail...and Thal will reward you in the next life."},{"name":"SLAFBORN","text":"You found a wardstone? Incredible! Ahhh, can you not feel the power that emanates from this humble stone?<br>...Eh? Not really?"},{"name":"SLAFBORN","text":"Ha! Just like <span class=\"alternative-container\"><span class=\"alternative\">a Lominsan</span><span class=\"alternative\">a Gridanian</span><span class=\"alternative\">an Ul'dahn</span></span>, practical to a fault! Let me tell you, there is more true magic than you credit in taking all possible precautions."},{"name":"SLAFBORN","text":"One thing's for certain: that temple managed to stymie more explorers than ordinary dangers can account for. If any of that can be attributed to this stone, then it's Garleans and beastmen who'll have to settle their accounts with the gods!"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66716]},"next":[66720,67097]},"partials":[{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1006220","obj":{"i":1006220,"n":"Bibimu","l":45,"q":3}},{"type":"quest","id":"66716","obj":{"i":66716,"n":"Laying the Foundation","g":0,"l":"The Waking Sands","s":6}},{"type":"quest","id":"66720","obj":{"i":66720,"n":"Hest of the Best","g":0,"l":"Mor Dhona","s":10}},{"type":"quest","id":"67097","obj":{"i":67097,"n":"Welcome to Morbol Country","g":0,"l":"Mor Dhona","s":10}}]}