{"quest":{"name":"The Resolute","location":"The Waking Sands","id":66715,"patch":2.1,"sort":5,"icon":100174,"eventIcon":71201,"target":1006693,"involved":[1006294,1006357,1007723],"genre":0,"journal":["Minfilia wishes to discuss plans for the forthcoming move to Mor Dhona.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","The cause of F'lhaminn's sudden sadness appears to be a damaged earring. Though she would like to have it repaired, she cannot bring herself to set foot in the Goldsmiths' Guild for reasons she refuses to explain. Take the earring to Ul'dah in her stead and seek the services of a guild goldsmith.","At the Goldsmiths' Guild, you meet a Lalafell by the name of Memedesu, who immediately recognizes the earring as F'lhaminn's Aria, a famous design created by the master goldsmith Niellefresne. Honored to be entrusted with the task of repairing the legendary piece, he refuses payment─asking only that you attend to a minor errand in his stead so that he may focus on his work. Travel to Byregot's Strike in southern Thanalan and collect a shipment of ores from Memedesu's supplier, Odinel.","A surprised Odinel is more than happy to give you the ores, remarking that doing so will spare him the tedium of one of Memedesu's time-consuming inspections. Deliver the shipment to the Goldsmiths' Guild and see if the earrings are ready.","Memedesu accepts the ores with a cursory glance, before assuring you that he took every precaution when handling F'lhaminn's Aria. Deliver the restored earrings to F'lhaminn at the Waking Sands.","F'lhaminn grows somber at the sight of the earrings, and grimly recounts the tale of their creator's fate. Murdered with a magicked blade, his body refuses to decay, and to this day she still prays that his soul finds peace in Thal's realm. Regaining her composure, she insists that Minfilia has no need to worry about her, and that you should both concentrate on more important matters. Visit Minfilia in the solar and inform her of all that has transpired.","With everyone assembled in the solar, Alphinaud proclaims that negotiations with the Adventurers' Guild have concluded, and that the Scions of the Seventh Dawn will soon have a new home: the Rising Stones. Minfilia follows this momentous announcement with the news that the Alliance leaders have pledged to support the Scions' plans, before finally declaring that the time is now right for the order to cast off the remaining vestiges of its former secrecy, that none may ever doubt its independence again. Though these plans entail significant risks, she is confident that the Scions will rise to the challenge, and together overcome."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span>"],"dialogue":[{"name":"MINFILIA","text":"As ever, your enthusiasm is greatly appreciated."},{"name":"MINFILIA","text":"Our first step will be to secure the cooperation of the Adventurers' Guild representatives in Revenant's Toll."},{"name":"MINFILIA","text":"Were it not for the guild's considerable efforts, the original Camp Revenant's Toll would have never been established, much less its more heavily fortified successor."},{"name":"MINFILIA","text":"However, with construction still ongoing, and resources in short supply, it seems certain that the guild will require something in return for their support, sympathetic to our cause though they may be."},{"name":"MINFILIA","text":"Whatever they ask, I shall not begrudge it. To be plain, we need them more than they need us. Without their assistance, such essential tasks as securing new facilities, cultivating relationships with local merchants, and recruiting adventurers would prove difficult, if not impossible."},{"name":"ALPHINAUD","text":"You need not concern yourself with such matters, Antecedent."},{"name":"MINFILIA","text":"Really, Alphinaud─if I need concern myself with <span class=\"emphasis\">anything</span>, it is surely matters such as these."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Indirectly</span>, perhaps. I submit that you might instead concern yourself with a different matter: namely, to whom the resolution of such matters might best be entrusted. And here I am! Nor do I come alone. May I present the esteemed emissary of the Adventurers' Guild at Revenant's Toll."},{"name":"ADVEMISSARY","text":"It is an honor, Antecedent. Upon receiving word of your intentions from Master Alphinaud, we thought it best to begin talks at the earliest available opportunity."},{"name":"ADVEMISSARY","text":"Know that my associates at Revenant's Toll hold the Scions of the Seventh Dawn in the highest regard. We should be honored to welcome your organization."},{"name":"ALPHINAUD","text":"There are, of course, certain provisions which must needs be negotiated. If it please you, I would do so."},{"name":"MINFILIA","text":"It does."},{"name":"ADVEMISSARY","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, unless I am much mistaken, you are the one known as <span class=\"highlight\">Forename</span>, are you not? May I say what a pleasure it is to make your acquaintance."},{"name":"ADVEMISSARY","text":"Slafborn spoke of you in the most glowing terms. To steal an imperial reaper and then use it to infiltrate a Garlean castrum is an undertaking few would contemplate─and fewer still survive."},{"name":"ADVEMISSARY","text":"You shall always be welcome at Revenant's Toll. We hope you will favor us with your presence again ere long."},{"name":"MINFILIA","text":"Well, well! It would seem your reputation precedes you, <span class=\"highlight\">Forename</span>! Mayhap I <span class=\"emphasis\">should</span> dispatch you to Revenant's Toll with all haste, as first intended..."},{"name":"MINFILIA","text":"But there is something else I would ask of you first─not as a Scion, but as a friend."},{"name":"MINFILIA","text":"My mother is troubled."},{"name":"MINFILIA","text":"I have seen her behave this way before, and I know she will dismiss my concerns if I inquire. Despite our closeness, she has ever been unwilling to burden me with her problems."},{"name":"MINFILIA","text":"It may be that she will welcome <span class=\"emphasis\">your</span> concern, however. She likes you, <span class=\"highlight\">Forename</span>. And more importantly, you are not family. Do not bother with subterfuge─she will know I sent you─simply do what you can to help her. That is all I ask."},{"name":"MINFILIA","text":"I am in your debt."},{"name":"FLHAMINN","text":"Hmph. Have I become an open book, or has she acquired still greater powers of insight? I shall choose to believe the latter."},{"name":"FLHAMINN","text":"If you must know, one of my earrings is damaged. I am not wont to sigh for such trifles, but...they were a gift."},{"name":"FLHAMINN","text":"Here─you wish to help, yes? Then do what I cannot. Take them to the Goldsmiths' Guild in Ul'dah, and see if anything can be done."},{"name":"FLHAMINN","text":"There are places to which one must never return. Grasping, insatiable places. They strip us of our wisdom, our worldliness─reduce us to our lesser selves..."},{"name":"FLHAMINN","text":"And leave us cold and shivering."},{"name":"MEMEDESU","text":"Yes, what is it? Earrings, you say? Very well, let me see them..."},{"name":"MEMEDESU","text":"By the Twelve, I <span class=\"emphasis\">know</span> this design! ...Humble cat's-eyes polished and set so exquisitely as to make the clearest of diamonds seem dour and dull..."},{"name":"MEMEDESU","text":"F'lhaminn's Aria! A-And if I am any judge of quality─crafted by Master Niellefresne himself!"},{"name":"MEMEDESU","text":"...Oh! Oh dear me... Ahaha! And I thought myself above sentiment. Look at my hands! They're <span class=\"emphasis\">shaking</span>!"},{"name":"MEMEDESU","text":"I require no payment, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. To be entrusted with this duty is reward enough!"},{"name":"MEMEDESU","text":"But since I must needs devote my full attention to the task at hand, mayhap you could attend to a small matter while I work?"},{"name":"MEMEDESU","text":"I have an appointment to meet one of my suppliers─a fellow by the name of Odinel─at Byregot's Strike in southern Thanalan. He has prepared a shipment of ores for me, you see. If you would collect it in my stead, I should be most grateful."},{"name":"MEMEDESU","text":"Breathe. <span class=\"emphasis\">Concentrate</span>! Remember your training. It's just another piece. It's just...another...piece..."},{"name":"ODINEL","text":"...You came all this way on Memedesu's account? Well, bloody hells! Can't deny as I'm a bit surprised by that."},{"name":"ODINEL","text":"He's normally a right pain in the arse, see. <span class=\"emphasis\">Always</span> comes to collect his goods in person, and then spends the gods know how long inspectin' 'em. It'd take somethin' serious to stop him. Hey, he's not on his deathbed, is he? ...No? Strange."},{"name":"ODINEL","text":"Here's his ore, anyway. We're square, right? Then give the man my regards."},{"name":"MEMEDESU","text":"You've returned at the perfect time, friend! Ah, yes─may I have my ores?"},{"name":"MEMEDESU","text":"Good, good. I shall sort through these later."},{"name":"MEMEDESU","text":"Now─the Aria! Fortunately, only the clasp was damaged─the rest seemed remarkably well maintained. You may be sure that I took every possible precaution when replacing the broken section. Oh, and I also took the liberty of polishing the piece, as you can see."},{"name":"MEMEDESU","text":"No, no, I require no payment. Truth be told, I would happily have paid <span class=\"emphasis\">you</span> for the privilege of laying hands on such a masterpiece. To have attended to its restoration may well be the defining achievement of my career thus far. My sincerest thanks."},{"name":"FLHAMINN","text":"Well? Did you do as I bid you? Pray tell me your trip was not for naught."},{"name":"FLHAMINN","text":"<span class=\"highlight\">Forename</span>, I... Thank you. They sparkle as they did the day Nielle gave them to me."},{"name":"FLHAMINN","text":"...My Nielle, who sleeps even now─looking for all the world as if that cursed blade had taken his young life mere moments ago...not years. Ye gods, I could almost bear it if he were truly gone...but here he lingers."},{"name":"FLHAMINN","text":"Can the soul be at peace while the flesh yet remains? Every day I pray that he has entered Thal's realm. I pray and I pray and I pray."},{"name":"FLHAMINN","text":"To love is to lose, child. One can but postpone the moment of parting."},{"name":"FLHAMINN","text":"And so I shall. My daughter will not lose me again─not for a long while yet, gods willing."},{"name":"FLHAMINN","text":"Tell Ascilia that I am quite well, <span class=\"highlight\">Forename</span>. She should concentrate on more important matters─and so should you."},{"name":"MINFILIA","text":"Ah, <span class=\"highlight\">Forename</span>. Were you able to get some rest? I would ask you to come with me to the solar. Alphinaud has just returned, and it would seem there is something he would share with us."},{"name":"ALPHINAUD","text":"You're here. Good. I come bearing news."},{"name":"ALPHINAUD","text":"The negotiations are concluded."},{"name":"MINFILIA","text":"And?"},{"name":"ALPHINAUD","text":"Our friends at the Adventurers' Guild have agreed to furnish us with new facilities and material support in exchange for our assistance in the ongoing defense and development of Revenant's Toll."},{"name":"ALPHINAUD","text":"The Scions of the Seventh Dawn shall have a new home in Mor Dhona: the Rising Stones."},{"name":"YSHTOLA","text":"A bittersweet victory, if truth be told. I cannot deny that I had come to look forward to Tataru's tales of our many guests and their many, many demands."},{"name":"THANCRED","text":"From the Waking Sands to the Rising Stones... <span class=\"emphasis\">Passably</span> poetic. That wasn't your doing, was it?"},{"name":"MINFILIA","text":"I too have news to share. In expectation of this momentous day, I personally informed the Alliance leaders of our plans, and they have each pledged their full support─General Raubahn included."},{"name":"MINFILIA","text":"Moreover, I have decided that the time is right for us to cast off the vestiges of our order's veil of secrecy and announce ourselves to the world."},{"name":"ALPHINAUD","text":"Are you sure that is wise, Antecedent?"},{"name":"MINFILIA","text":"If anything, it is a mere formality. Our existence is quite possibly the worst kept secret in Eorzea."},{"name":"MINFILIA","text":"Let us affirm our identity, proclaim our achievements, that all may know what the Scions of the Seventh Dawn stand for!"},{"name":"PAPALYMO","text":"Well...obvious risks apart, it <span class=\"emphasis\">would</span> be nice to receive a little more recognition..."},{"name":"YDA","text":"And the people have a right to know who saved them!"},{"name":"MINFILIA","text":"It is my hope that this gesture will encourage the people of Eorzea to place their trust in us. I would reveal to them the true extent of our power, yes, but in so doing, I would show them that it is a power accountable to no one, and at once to all."},{"name":"MINFILIA","text":"...And what of us? We who have felled primals and faced down the Empire. To you, my fellow Scions, I would say this: prepare for the challenges which lie ahead, for they will be great indeed."},{"name":"MINFILIA","text":"Great, I say, yet no greater than us. And we <span class=\"emphasis\">will</span> rise to them, as we have time and again...united as one!"},{"name":"TATARU","text":"Hmm... There must be some way I can─ Wait, that area is said to be rich in minerals. Maybe I should ask F'lhaminn to teach me the basics of mining too..."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66714]},"next":[66716]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1006294","obj":{"i":1006294,"n":"Odinel","l":45,"q":2}},{"type":"npc","id":"1006357","obj":{"i":1006357,"n":"Memedesu","l":41,"q":3}},{"type":"npc","id":"1007723","obj":{"i":1007723,"n":"F'lhaminn","l":356,"q":1}},{"type":"quest","id":"66714","obj":{"i":66714,"n":"All Things in Time","g":0,"l":"Eastern La Noscea","s":4}},{"type":"quest","id":"66716","obj":{"i":66716,"n":"Laying the Foundation","g":0,"l":"The Waking Sands","s":6}}]}