{"quest":{"name":"Crate Go Kaboom","location":"Mor Dhona","id":66719,"patch":2.1,"sort":8,"eventIcon":71201,"target":1006552,"genre":0,"journal":["Sark Malark is a man of mystery. Where did he come from? How did he get here? And what does he want from you today?","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","The explosives had the last word in that encounter. Report to Sark Malark that the crates are no more.","Sark Malark was appreciative, but not confiding. It seems he means to keep his old life a secret, even─or especially─from a fellow adventurer."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"SARKMALARK","text":"Ah, <span class=\"highlight\">Forename</span>! It is most welcome to see you again."},{"name":"SARKMALARK","text":"Look at the hustle and bustle of adventurers, where there were but rocks not long ago! As one of those who has been here since the beginning, I am humbled by the sight."},{"name":"SARKMALARK","text":"Yet none of us can be full glad, for the Garlean forces nearby like not our bustle at all, and our hustle even less. They seek to move on us soon, we are all but certain."},{"name":"SARKMALARK","text":"This is no idle speculation, <span class=\"highlight\">Forename</span>. Three steel-bound crates of the familiar type were delivered to Castrum Centri not two days ago."},{"name":"SARKMALARK","text":"The contents are no doubt arms. To defend the land they hold? To take what we hold? Neither is a particularly attractive prospect, you must admit."},{"name":"SARKMALARK","text":"I propose a third outcome that is less like to claim lives, if you would aid me─destroy the crates and their contents now."},{"name":"SARKMALARK","text":"Use these explosives I had rushed from the Alchemists' Guild. They will do the job, rest assured."},{"name":"SARKMALARK","text":"Who better to make this attempt than you, who once walked undetected into Castrum Centri? Twelve speed your way, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> adventurer."},{"name":"SARKMALARK","text":"Please, you must destroy the crates being stored in Castrum Centri, before it's too late."},{"name":"SARKMALARK","text":"Those explosives should be more than sufficient for the task. Each one contains twenty-four onzes of firesand and will detonate on impact."},{"name":"SARKMALARK","text":"We could hear the explosions─I knew you would make a success of it!"},{"name":"SARKMALARK","text":"This should draw the Garleans' sting for a while─but not for too long. We must be vigilant, for─"},{"name":"SARKMALARK","text":"...How ever did I afford such quality munitions, you ask? Oh, <span class=\"highlight\">Forename</span>, you needn't concern yourself with such trivial details."},{"name":"SARKMALARK","text":"Nevertheless, your stealth and compassion are appreciated in equal measure! I am a lucky man indeed to be a part of this fellowship─adventurers, one and all!"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66716]}},"partials":[{"type":"npc","id":"1006552","obj":{"i":1006552,"n":"Sark Malark","l":67,"q":3}},{"type":"quest","id":"66716","obj":{"i":66716,"n":"Laying the Foundation","g":0,"l":"The Waking Sands","s":6}}]}