{"quest":{"name":"On the Properties of Primals","location":"South Shroud","id":66727,"patch":2.1,"sort":17,"eventIcon":71201,"issuer":1006751,"target":1006693,"involved":[1000460,1003027,1008272,1008273,1008274],"genre":2,"journal":["Raya–O–Senna wishes to congratulate you on your victory over Good King Moggle Mog XII.","Raya–O–Senna declares that your brave deeds in service to the Twelveswood shall not be forgotten. Certain that her sister will be eager to hear the tale of Good King Moggle Mog XII's defeat from the mouth of the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> responsible, she urges you to return to the Lotus Stand in Old Gridania.","Your eloquent description of the events in Thornmarch serves to confirm the worst fears of the Elder Seedseer and your fellow Scions: like the primals of the beast tribes, Good King Moggle Mog XII was called forth by means of a rite imparted to the Mogglesguard by the Ascians. Papalymo bids you return to the Waking Sands and report these troubling findings to Minfilia while he and Yda discuss the matter of the Scions' compensation with the Elder Seedseer.","Though Minfilia has already received word of your victory, she is nevertheless eager to hear your version of events. After listening to your account, she too is forced to conclude that Ascians were behind both of Good King Moggle Mog XII's recent appearances. Though unquestionably unfortunate, Minfilia reflects that this latest incident did at least provide an opportunity to remind the Elder Seedseer of the Scions' unique role in Eorzea─persuading her to proffer much-needed additional support."],"objectives":["Speak with Kan–E–Senna at the Lotus Stand.","Report to Minfilia in the Waking Sands."],"dialogue":[{"name":"RAYAOSENNA","text":"Your bravery in service to the Twelveswood and her moogles shall not be forgotten, <span class=\"highlight\">Forename</span>."},{"name":"RAYAOSENNA","text":"My sister will doubtless wish to hear the tale of this great victory from the mouth of the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> responsible. Pray return to the Lotus Stand and treat her to a full account of the day's events, while the details are yet fresh in your mind."},{"name":"RAYAOSENNA","text":"I know only too well how modest you are... If you take no pleasure in recounting your deeds, pray think instead of the pleasure others take from hearing about them. Surely <span class=\"emphasis\">that</span> is motivation enough for one so selfless? Good! Off to the Lotus Stand with you."},{"name":"DOORMANLOTUS","text":"The Elder Seedseer is expecting you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. May I show you in?"},{"name":"CHOICE1Q1","text":"Proceed to the Lotus Stand?"},{"name":"CHOICE1A1","text":"Yes"},{"name":"CHOICE1A2","text":"No"},{"name":"YDA","text":"<span class=\"highlight\">Forename</span>! Kuplo Kopp says you killed the king! I'm pleased, of course, but it completely spoiled the end of your story. Silly moogle."},{"name":"PAPALYMO","text":"By Louisoix's definition, the late King Moggle Mog XII was indeed a primal. But how can that be? It defies all precedent."},{"name":"KUPLOKOPP","text":"Everyone wants to hear your tale, kupo! What are you waiting for? Tell them! Tell them!"},{"name":"KANESENNA","text":"<span class=\"highlight\">Forename</span>. You are returned to us, unharmed and victorious. Thus have I two reasons to be glad."},{"name":"KANESENNA","text":"Yet many questions remain unanswered. If you would be so kind as to oblige me, I would fain hear all that occurred in Thornmarch."},{"name":"KANESENNA","text":"...Then it is as we feared."},{"name":"YDA","text":"The king really <span class=\"emphasis\">is</span> a primal..."},{"name":"YDA","text":"...But he really <span class=\"emphasis\">isn't</span>, is he? I mean, the moogles don't worship him, for one thing─he's not even a god to them! That doesn't sound like any primal I've ever heard of."},{"name":"PAPALYMO","text":"Then mayhap the fault lies with the definition. The fact remains that through a combination of the power contained in crystals and the force of their collective faith, the moogles called forth a being that by rights should not exist. Moreover, when slain, said being left no corpse─the aether which comprised him instead being scattered to the four winds."},{"name":"KANESENNA","text":"According to the accepted definition, he may not be a primal...but the mode of his manifestation was in every respect the same."},{"name":"YDA","text":"Which means..."},{"name":"PAPALYMO","text":"Ascians. This whole business <span class=\"emphasis\">reeks</span> of their handiwork!"},{"name":"KUPLOKOPP","text":"Kupopo!? They...they said it was a masked man who had taught them how, years ago─b-but Gridania has no shortage of masked men, and...and I never thought to question..."},{"name":"PAPALYMO","text":"Confound it all! How many more will they ensnare with their tainted gifts...?"},{"name":"KANESENNA","text":"Too many, I fear. So long as there are Paragons to stir the embers, fools to build the pyre, and crystals to feed the flames, ever and again shall we suffer primal visitation. A somber thought, but a salutary one."},{"name":"KANESENNA","text":"My heartfelt thanks, <span class=\"highlight\">Forename</span>. Already, the information you have provided has proven invaluable. The grand serpent marshal and I have much to discuss."},{"name":"YDA","text":"Oh! Before you do, my lady, I was hoping we might finish discussing that <span class=\"emphasis\">other</span> matter?"},{"name":"KANESENNA","text":"The matter of which you speak has even now been settled. The Scions shall not want for support. We shall be glad to send additional supplies to Revenant's Toll."},{"name":"YDA","text":"We knew we could count on you, my lady!"},{"name":"PAPALYMO","text":"While Yda and I remain to discuss the particulars of our arrangement with the Elder Seedseer, mayhap you could return to the Waking Sands and apprise the Antecedent of all that has transpired?"},{"name":"YDA","text":"Thanks to the Elder Seedseer's generous donation, the Rising Stones may actually be worth leaving the Waking Sands for!"},{"name":"PAPALYMO","text":"This business has taught us much, and the Antecedent must needs be informed of our findings. Pray leave matters here to us and return to the Waking Sands."},{"name":"KUPLOKOPP","text":"You don't have to worry about the Mogglesguard anymore, kupo! The chieftain made them apologize in front of absolutely everyone. And just to be sure, we're keeping a close eye on them, too."},{"name":"DOORMANLOTUS","text":"May the elementals see you safely home, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"KANESENNA","text":"Please extend my personal thanks to the Antecedent, along with my best wishes for the Scions' forthcoming move."},{"name":"MINFILIA","text":"It is good to see you hale and healthy, <span class=\"highlight\">Forename</span>. I received word from Yda and Papalymo that you had felled Good King Moggle Mog XII, but I had hoped to hear your version of the tale."},{"name":"MINFILIA","text":"...So it was as they said. Summoned with the same methods used by the beast tribes and taught by the Ascians."},{"name":"MINFILIA","text":"Though unfortunate, this incident did at least serve to remind the Elder Seedseer of our usefulness. Her offer of additional support could not have come at a better time. My thanks, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":2139,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66726]},"next":[66728,66948]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1003027","obj":{"i":1003027,"n":"Kan-E-Senna","l":347,"q":9}},{"type":"npc","id":"1008272","obj":{"i":1008272,"n":"Yda","l":347,"q":2}},{"type":"npc","id":"1008273","obj":{"i":1008273,"n":"Papalymo","l":347,"q":2}},{"type":"npc","id":"1008274","obj":{"i":1008274,"n":"Kuplo Kopp","l":347,"q":2}},{"type":"quest","id":"66726","obj":{"i":66726,"n":"You Have Selected Regicide","g":2,"l":"Gridania","s":16}},{"type":"quest","id":"66728","obj":{"i":66728,"n":"The Gifted","g":2,"l":"The Waking Sands","s":18}},{"type":"quest","id":"66948","obj":{"i":66948,"n":"The King Lives","g":13,"l":"The Waking Sands","s":5,"f":1}}]}