{"quest":{"name":"Hail to the King, Kupo","location":"Gridania","id":66725,"patch":2.1,"sort":15,"icon":100175,"eventIcon":71201,"issuer":1000168,"target":1000692,"involved":[1000460,1003027,1008271,1008272,1008273,1008274],"genre":2,"journal":["Vorsaile Heuloix wishes to brief you on the latest crisis in Gridania.","Claiming to have information on an imminent threat to mooglekind and Gridanian alike, Kuplo Kopp has petitioned the Elder Seedseer for an audience. Speak to the silent conjurer to gain admission to the Lotus Stand, where the moogle will explain all.","Good King Moggle Mog, the Twelfth of His Name, has returned to Gridania after a five-year absence. Though the precise nature of said quasi-mythical being is debatable, all present agree that the danger he poses is akin to that of a primal. Convinced of the need to act, Kan–E–Senna beseeches you to drive the king out of the Twelveswood, urging you to consult Brother E–Sumi–Yan upon the matter of how his magical defenses might be breached.","Brother E–Sumi–Yan takes great comfort in your arrival, observing that the influence of Good King Moggle Mog XII could forever corrupt mooglekind's peaceful nature if nothing is done. Before explaining how you might reach the legendary king, the conjurer bids you see to whatever preparations you feel are necessary for the coming confrontation."],"objectives":["Speak with Kan–E–Senna at the Lotus Stand.","Speak with Brother E–Sumi–Yan."],"dialogue":[{"name":"VORSAILE","text":"Not long ago, the moogle Kuplo Kopp visited the Adders' Nest to request an audience with the Elder Seedseer."},{"name":"VORSAILE","text":"He spoke of an imminent threat to all mooglekind, one which would imperil the entire Twelveswood if left unchecked."},{"name":"VORSAILE","text":"You proved an able ambassador to the sylphs, and we would have you reprise the role in our dealings with the moogles."},{"name":"VORSAILE","text":"The rest you should hear from Kuplo Kopp himself. He awaits you with the Elder Seedseer at the Lotus Stand."},{"name":"DOORMANLOTUS","text":"The other Scions have already arrived, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. May I show you in?"},{"name":"CHOICE1Q1","text":"Proceed to the Lotus Stand?"},{"name":"CHOICE1A1","text":"Yes"},{"name":"CHOICE1A2","text":"No"},{"name":"RAYAOSENNA","text":"Our guest has brought ill tidings which must needs be heeded. Isn't that right, Kuplo Kopp?"},{"name":"KUPLOKOPP","text":"Oh, I don't know about this. I don't know about this at all... &lt;sigh&gt; But I suppose Raya–O's right─they've left us no choice, kupo."},{"name":"PAPALYMO","text":"A threat to mooglekind... Hmph. I had hoped the Antecedent's suspicions were ill founded, but I cannot see who else it could be..."},{"name":"YDA","text":"It must be something bad to have gotten Kuplo Kopp this worried. Have you <span class=\"emphasis\">seen</span> the way his thingummy is bobbing?"},{"name":"KUPLOKOPP","text":"Please, you have to stop them! B-But you mustn't kill them! They're not <span class=\"emphasis\">bad</span> moogles, kupo! They're just...misguided! A gentle─no, <span class=\"emphasis\">firm</span> thrashing is in order, yes, but no─"},{"name":"RAYAOSENNA","text":"Calm yourself, Kuplo Kopp! Can you not see that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> hasn't the faintest idea what you're talking about!? Be quiet this instant!<br>Pray forgive his witless outburst, Sister."},{"name":"KANESENNA","text":"Most grateful am I that you have come, <span class=\"highlight\">Forename</span>, and upon such short notice. Truly, Gridania could not wish for a more stalwart ally."},{"name":"KANESENNA","text":"But you are doubtless eager to know wherefore we summoned you. Our friend Kuplo Kopp has brought to us news of a most unsettling development."},{"name":"KANESENNA","text":"It would seem that Good King Moggle Mog XII has returned to Eorzea."},{"name":"RAYAOSENNA","text":"A curious thing to hear, I know. Truth to tell, I myself cannot say for sure if he is a genuine figure from history or some manifestation of moogle mythology. Kuplo here would have me believe the former."},{"name":"KUPLOKOPP","text":"Once upon a time, we moogles served the gods in the heavens. It was quite nice up there─unspeakably beautiful, unimaginably spacious, and with a literally endless supply of wine, kupo!"},{"name":"KUPLOKOPP","text":"In spite of this, or possibly because of the last part, the gods eventually became discontented and started squabbling, which made life jolly difficult for the poor moogles."},{"name":"KUPLOKOPP","text":"So Good King Moggle Mog XII─may his glorious name live forever─decreed that the time had come to leave, kupo! The realm of man would suffice, he said, so all the moogles should live there instead."},{"name":"KUPLOKOPP","text":"Unfortunately, the two realms are so far apart that we couldn't safely fly down. But Good King Moggle Mog XII─may his miraculous foresight ever be praised─knew exactly what to do, kupo! He had a rope, you see─the longest one ever woven. This he nobly held while his subjects climbed all the way down to the world below."},{"name":"KUPLOKOPP","text":"And that is how we moogles came to this land, kupo! All of us except Good King Moggle Mog XII─may his courageous sacrifice never be forgotten. He alone would remain in the heavens so that mooglekind might at last know peace."},{"name":"PAPALYMO","text":"Except that he has <span class=\"emphasis\">not</span> remained in the heavens, from what I understand─that being your reason for contacting us, yes?"},{"name":"YDA","text":"I'll bet he tied the rope to something! Good thinking! Remind me again what the problem was with him returning to Eorzea?"},{"name":"KANESENNA","text":"The problem, Yda, lies in the fact that he was <span class=\"emphasis\">summoned</span>."},{"name":"KANESENNA","text":"It is our belief that Good King Moggle Mog XII is a myth made manifest via means akin to those employed by the beast tribes in the summoning of their gods."},{"name":"YDA","text":"Waaait... You're saying a handful of moogles with a boatload of crystals wished really, really hard, and he just sort of appeared? ...Would that even work?"},{"name":"PAPALYMO","text":"What I cannot fathom is why they would even <span class=\"emphasis\">try</span>."},{"name":"PAPALYMO","text":"With Garuda humbled and the Ultima Weapon destroyed, what new threat could have prompted them to take so drastic a measure?"},{"name":"RAYAOSENNA","text":"Might that not in itself be the answer? Twice in the last half decade, Eorzea has been brought unto the very brink of destruction, only to be spared at the last by the heroics of a chosen few."},{"name":"RAYAOSENNA","text":"To you who braved those tempests and survived by virtue of your own strength, this latest period of peace will doubtless seem a welcome respite."},{"name":"RAYAOSENNA","text":"But to those who had not the power to defend themselves, who were spared only by another's grace, this is merely the calm before the storm."},{"name":"RAYAOSENNA","text":"I think the Mogglesguard are afraid─afraid of what tomorrow will bring, and that things may not end so well as they did yesterday."},{"name":"RAYAOSENNA","text":"That fear has driven them to call upon a greater power, one they believe can be relied upon to protect their loved ones and their homes come what may."},{"name":"KUPLOKOPP","text":"I assure you, the Mogglesguard only want to protect the forest from outsiders. But ever since the return of Good King Moggle Mog XII─may his boundless grace fill our hearts with love─they've started to get a little carried away, kupo. Verging on a lot, in fact..."},{"name":"YDA","text":"Like the sylphs who summoned Ramuh, you mean?"},{"name":"PAPALYMO","text":"Hmm. We cannot discount the possibility that this...<span class=\"emphasis\">entity</span> is influencing the moogles in a manner similar to that of a primal."},{"name":"KANESENNA","text":"We share the same concern."},{"name":"KANESENNA","text":"Whoever or whatever the king may be, it is our belief that he poses a threat not only to mooglekind, but to Gridania as a whole. Thus do we beseech you, <span class=\"highlight\">Forename</span>─confront Good King Moggle Mog XII and drive him from our midst."},{"name":"KANESENNA","text":"Humbly I do thank you."},{"name":"KANESENNA","text":"The sanctuary of the Mogglesguard and their liege lord is concealed by magical wards. Brother E–Sumi–Yan of the Conjurers' Guild will doubtless be able to offer insight on how they might be dispelled. Pray seek his counsel ere you proceed any further."},{"name":"KANESENNA","text":"If you are to confront Good King Moggle Mog XII, you must needs find a way to defeat his magical defenses. Upon such matters, Brother E–Sumi–Yan is something of an authority. Pray consult him without delay."},{"name":"RAYAOSENNA","text":"My sister is right, <span class=\"highlight\">Forename</span>. For the moogles' sakes─and our own─banish the king from the Twelveswood."},{"name":"KUPLOKOPP","text":"Remember: no killing, kupo! A sound thrashing will more than suffice!<br>Oh dear, oh dear..."},{"name":"DOORMANLOTUS","text":"The Seedseers pray for your success, as do I."},{"name":"ESUMIYAN","text":"Welcome, <span class=\"highlight\">Forename</span>. Welcome. That you should be the one to face Good King Moggle Mog XII is of great comfort─to me and to the elementals, both."},{"name":"ESUMIYAN","text":"As I am sure you know, the moogles are not by their nature a warlike race. Yet should the king be suffered to remain, it is like that his influence will bring about a change in them."},{"name":"ESUMIYAN","text":"Thus does it behoove us to defeat him quickly, before any lasting damage is done. Make whatever preparations you deem necessary and inform me when you are ready to seek the king."}],"reward":{"gil":939,"items":[{"id":4176,"one":1},{"id":4177,"one":1},{"id":4180,"one":1},{"num":3,"id":5824,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69413]},"next":[66726]},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1003027","obj":{"i":1003027,"n":"Kan-E-Senna","l":347,"q":9}},{"type":"npc","id":"1008271","obj":{"i":1008271,"n":"Raya-O-Senna","l":347,"q":1}},{"type":"npc","id":"1008272","obj":{"i":1008272,"n":"Yda","l":347,"q":2}},{"type":"npc","id":"1008273","obj":{"i":1008273,"n":"Papalymo","l":347,"q":2}},{"type":"npc","id":"1008274","obj":{"i":1008274,"n":"Kuplo Kopp","l":347,"q":2}},{"type":"item","id":"4176","obj":{"i":4176,"n":"Darklight Bracelet of Aiming","l":70,"c":55677,"t":42}},{"type":"item","id":"4177","obj":{"i":4177,"n":"Darklight Bracelet of Healing","l":70,"c":55681,"t":42}},{"type":"item","id":"4180","obj":{"i":4180,"n":"Darklight Bracelet of Casting","l":70,"c":55673,"t":42}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"69413","obj":{"i":69413,"n":"It's Possibly a Primal","g":2,"l":"Mor Dhona","s":14}},{"type":"quest","id":"66726","obj":{"i":66726,"n":"You Have Selected Regicide","g":2,"l":"Gridania","s":16}}]}