{"quest":{"name":"You're Gonna Carry That","location":"Mor Dhona","id":66722,"patch":2.1,"sort":12,"eventIcon":71201,"target":1003785,"involved":[1007722],"genre":0,"journal":["Slafborn seems intent on putting you to work yet again.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Upon returning to the Waking Sands, Alphinaud declares that preparations for the move to Mor Dhona have fallen behind. Demonstrating an almost Slafbornian eagerness to put you to work, he then bids you scour the headquarters for any packages labeled for shipment to Revenant's Toll. It would seem your report will have to wait.","A cursory search yields four labeled packages. Though an average [Race] might feasibly struggle to carry them all, the same cannot be said of you. Bluntly, you have faced greater challenges. Take the packages to Tataru who is waiting outside.","No sooner have you washed your hands of one errand than Tataru begs your assistance with another. With luck, it will take no longer than the previous one..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"SLAFBORN","text":"I can't tell you how grateful we all are to have you here─now more than ever. We have a major crisis on our hands, you see─one which will demand your full attention for weeks if not months. I'm sorry, <span class=\"highlight\">Forename</span>. If you've made any other plans, you'll just have to cancel them."},{"name":"SLAFBORN","text":"...Heh heh! You honestly believed me, didn't you? There's such a thing as being <span class=\"emphasis\">too</span> long-suffering, you know? I fear we may have overdone it with the errands, necessary though they were."},{"name":"SLAFBORN","text":"Anyway, your work here is done─for the time being, at least. Master Alphinaud has sent word that you are to report to him at the Waking Sands. I gather he wants to know how you've been getting on. Be sure to tell him how welcome we've made you feel, won't you?"},{"name":"SLAFBORN","text":"As much as I would like to impose upon you further, Alphinaud was insistent that you return to Vesper Bay at once."},{"name":"ALPHINAUD","text":"Ah, <span class=\"highlight\">Forename</span>─you've returned. I trust they kept you busy in Revenant's Toll?"},{"name":"ALPHINAUD","text":"We have had nary a moment's rest since you departed. Despite our best efforts, however, we've begun to fall behind."},{"name":"ALPHINAUD","text":"No matter. We shall soon make up the lost ground with you here to help us. Now, there are a number of packages which must needs be delivered to Revenant's Toll as a matter of urgency."},{"name":"ALPHINAUD","text":"Don't give me that long-suffering look─I only require you to take them upstairs to Tataru. She will handle the rest. The packages are scattered about the halls, but each is clearly labeled, so you should have little trouble finding them. Now, if you will excuse me... Hm? Your report? Later, later..."},{"name":"ALPHINAUD","text":"Of course I wish to hear your report, but you've caught me at an inopportune moment. I daresay I will have some time to talk when you have finished your little errand."},{"name":"TATARU","text":"Uwaaah! So much to do, so much to do! At this rate, we'll <span class=\"emphasis\">never</span> get to Revenant's Toll!"},{"name":"TATARU","text":"Bless your heart, I had completely forgotten about those!"},{"name":"TATARU","text":"Let me check the labels against my list... Oh, these are the last ones! Thank the Twelve, it's almost─"},{"name":"TATARU","text":"Oh dear, I <span class=\"emphasis\">did</span> contact the courier, didn't I? Um..."},{"name":"TATARU","text":"Ah! It just so happens that I had been meaning to contact <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>! I've an important personal request, you see, which I couldn't possibly entrust to anyone else."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"questsType":"any","quests":[66721,67098]},"next":[66723]},"partials":[{"type":"npc","id":"1003785","obj":{"i":1003785,"n":"Tataru","l":42,"q":5}},{"type":"npc","id":"1007722","obj":{"i":1007722,"n":"Alphinaud","l":356,"q":3}},{"type":"quest","id":"66721","obj":{"i":66721,"n":"Pass the Smell Hest","g":0,"l":"Mor Dhona","s":11}},{"type":"quest","id":"67098","obj":{"i":67098,"n":"Answering the Call","g":0,"l":"Mor Dhona","s":11}},{"type":"quest","id":"66723","obj":{"i":66723,"n":"The Things We Do for Tea","g":0,"l":"Western Thanalan","s":13}}]}