{"quest":{"name":"You Have Selected Regicide","location":"Gridania","id":66726,"patch":2.1,"sort":16,"eventIcon":71201,"issuer":1000692,"target":1007862,"involved":[1008275,1008276,1008277],"genre":2,"journal":["Brother E–Sumi–Yan would unfold to you the secrets of Good King Moggle Mog XII's magical defenses.","The sanctuary of Good King Moggle Mog XII is protected by magical wards, which can only be nullified through the use of keystones. Fortuitously, these keystones are in the possession of the selfsame moogle who warned Gridania of the king's coming. Gaining entrance to Thornmarch should thus prove simple─assuming you can persuade Kuplo Kopp to take a more active role in betraying his brethren.","With a heavy heart, Kuplo Kopp consents to your plan, and bids you take the ferry to Sweetbloom Pier. Rendezvous with the moogle in the East Shroud as agreed.","At Sweetbloom Pier, you find Kuplo Kopp being chastised by three members of the Mogglesguard. Fearing that violence may be about to erupt, you rush to Kuplo Kopp's defense. Though the three Mogglesguard eventually leave in peace, one insinuates that all who defy the king's will shall soon face a terrible reckoning─a threat which Kuplo Kopp subsequently confirms, to your dismay. Speak with the moogle once more to learn where the king's sanctuary may be found.","The entrance to Thornmarch lies at the heart of the Bramble Patch. However, the way is guarded by enchanted beasts who can see through moogle magicks. Kuplo Kopp bids you escort him to the warded entrance, fending off any beasts who attempt to do him harm as you go.","At long last, you arrive at your destination, your moogle companion none the worse for wear. Speak with Kuplo Kopp to learn what you must do next.","Kuplo Kopp instructs you to raise your hand towards the entrance and focus, as if you were attuning to an aetheryte. Do as bade so that he can open the way.","Naught remains to bar you from your destination. Steel yourself for a mighty struggle, and venture forth into Thornmarch, where Good King Moggle Mog XII and his loyal Mogglesguard await.<br><br>※Thornmarch (Hard) can be accessed via the Duty Finder.","The loyal Mogglesguard can only watch in horror as their beloved king of legend disintegrates into aether, leaving behind no corpse. Their liege lord fallen, the moogles flee into the forest, leaving you behind to ponder the meaning of what you have just observed.","An ecstatic Kuplo Kopp greets you warmly upon your return, plainly relieved that the king and his Mogglesguard were stopped before their plans could come to fruition. He then asks that you bear word of your victory to Pukni Pakk, who is in the company of Raya–O–Senna at Camp Tranquil in the South Shroud.","Pukni Pakk is also pleased to learn of the king's fall, declaring that all mooglekind owes you a debt of gratitude. Observing that Raya–O–Senna has overheard your report, she moves aside so that you might speak with the Elder Seedseer's younger sister."],"objectives":["Speak with Kuplo Kopp.","Speak with Kuplo Kopp at Sweetbloom Pier.","Speak with Kuplo Kopp.","Escort Kuplo Kopp to the warded entrance.","Speak with Kuplo Kopp.","Attune yourself to the warded entrance.","Confront Good King Moggle Mog XII in Thornmarch (Hard).","Report to Pukni Pakk at Camp Tranquil."],"dialogue":[{"name":"ESUMIYAN","text":"The wards barring access to the king's sanctuary can only be nullified through the use of enchanted keystones─the selfsame method employed five years ago, when first the king was summoned to Eorzea."},{"name":"ESUMIYAN","text":"It was with great regret that we were forced to sanction the slaying of the guardians who then held the keystones, for none were in our possession at the time. By the grace of the elementals, however, we have been spared that burden on this occasion."},{"name":"ESUMIYAN","text":"Kuplo Kopp confided in me that he had been entrusted with a set of keystones by the Mogglesguard themselves. Yet wishing not to betray their confidence, he begged me to find some other means to gain entry to the king's sanctum."},{"name":"ESUMIYAN","text":"Alas, I have been unable to do so, and dare not labor any longer, for fear that the moogles might succumb to the corrupting influence of their liege lord. We must needs have Kuplo Kopp's keystones, <span class=\"highlight\">Forename</span>. Pray go to him, and beg his assistance."},{"name":"ESUMIYAN","text":"He awaits you at Westshore Pier. Impress upon him our great need, and I am certain he will yield."},{"name":"KUPLOKOPP","text":"So? How will you do it, kupo?<br>...Oh, he told you about that."},{"name":"KUPLOKOPP","text":"Well, if there truly is no other way... I'll do it, kupo. Take the ferry to Sweetbloom Pier─I'll go on ahead."},{"name":"KUPTAKAPA","text":"Don't you dare lie to me, kupo! I know what you're planning, and I won't allow it!"},{"name":"KUPLOKOPP","text":"Open your eyes, kupo! The king will <span class=\"emphasis\">never</span> be satisfied, no matter how many crystals you bring him!"},{"name":"KUPLIKIPP","text":"We offered you a choice, and this is how you repay us!? By consorting with this [Race]!?"},{"name":"KUPTAKAPA","text":"Imperials, Gridanians, sylphs─you're no different from the rest of them! Actually─you're <span class=\"emphasis\">worse</span>, kupo!"},{"name":"KUPLIKIPP","text":"Traitor to his kinsmoogles! He plots treason against the crown!"},{"name":"KUPDIKOOP","text":"Enough! Kuplo Kopp will answer for his crimes soon enough, as will all who defy the will of Good King Moggle Mog XII─may he reign forevermore, kupo!"},{"name":"KUPLOKOPP","text":"The king is planning to purge the Twelveswood of his enemies, kupo! We've got to stop him before it's too late!"},{"name":"KUPLOKOPP","text":"The entrance to Thornmarch is deep within the Bramble Patch, kupo! If you take me there, I can nullify the ward. But be warned: the Mogglesguard has set traps to lure enchanted beasts. I can't hide from them, so you'll need to protect me, kupo!"},{"name":"SYSTEM","text":"Escort Kuplo Kopp safely to the warded entrance. Should you fail to defend him, or move too far away, he will return to Sweetbloom Pier, where you may rendezvous with him before trying again."},{"name":"KUPLOKOPP","text":"Let's go, kupo!"},{"name":"KUPLOKOPP","text":"Run away, kupopo! Run awaaay!"},{"name":"SYSTEM","text":"To face Good King Moggle Mog XII, you must successfully escort Kuplo Kopp to the warded entrance. Return to Sweetbloom Pier and speak with Kuplo Kopp to begin once more."},{"name":"SYSTEM","text":"You have lost sight of Kuplo Kopp. Retrace your steps to find them, then escort them safely to the warded entrance."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)We're here, kupo! I don't see any more beasts, do you?"},{"name":"SYSTEM","text":"You have reached your destination, and may end the escort mission if you so choose."},{"name":"SYSTEM","text":"If you do so, any party members who have not reached the destination with you will have their mission judged a failure."},{"name":"SYSTEM","text":"Be sure to confirm the whereabouts of your party members before ending the mission."},{"name":"Q1","text":"Declare the area secure?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"KUPLOKOPP","text":"Are you ready to face the king, kupo? Then step closer to the ward."},{"name":"KUPLOKOPP","text":"Raise your hand and focus─like when you attune to an aetheryte, kupo! I'll open the way for you!"},{"name":"KUPLOKOPP","text":"The rest is up to you, kupo! Now go and teach those foolish moogles a lesson and send the king back whence he came!"},{"name":"KUPLOKOPP","text":"If anyone can slay Good King Moggle Mog XII─may he justly reign till the end of days─and save the Twelveswood from his wrath, it's you, kupo!"},{"name":"KUPLOKOPP","text":"You did it, kupo! You did it! Good King Moggle Mog XII─may his mighty soul rest in peace─is no more!"},{"name":"KUPLOKOPP","text":"I shudder to think what might've happened had you not stopped the Mogglesguard when you did. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"KUPLOKOPP","text":"Perhaps now they'll come to their senses and stop playing at faerie tales. Rest assured that the chieftain will have choice words for them too!"},{"name":"KUPLOKOPP","text":"You should go and tell Pukni Pakk that the king is no more, kupo! She's with Raya–O at Camp Tranquil, and can relay the news to the chieftain."},{"name":"KUPCHAKUPA","text":"Do I dare believe my ears!? Good King Moggle Mog XII─may his magnificent virtue serve as an example to us all─has fallen!?"},{"name":"KUPCHAKUPA","text":"All mooglekind owes you a debt, kupo! Ah, and I sense Raya–O wishes to congratulate you as well. I shall let you two speak without fear of interruption."},{"name":"KUPTAKAPA","text":"Kupo!? Who in the seven hells are they!?"},{"name":"KUPQUKOGI","text":"Meddling adventurers, I'd wager!"},{"name":"KUPDIKOOP","text":"Mogglesguard, to arms! Defend the king, kupo!"},{"name":"POP","text":"You sense a hostile presence, kupo!"}],"reward":{"gil":2842,"xp":4800,"instance":20011},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66725]},"next":[66727]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1007862","obj":{"i":1007862,"n":"Pukni Pakk","l":56,"q":1}},{"type":"npc","id":"1008275","obj":{"i":1008275,"n":"Kuplo Kopp","l":53,"q":1}},{"type":"npc","id":"1008276","obj":{"i":1008276,"n":"Kuplo Kopp","l":55,"q":1}},{"type":"npc","id":"1008277","obj":{"i":1008277,"n":"Kuplo Kopp","l":55,"q":1}},{"type":"instance","id":"20011","obj":{"i":20011,"n":"Thornmarch (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":54}},{"type":"quest","id":"66725","obj":{"i":66725,"n":"Hail to the King, Kupo","g":2,"l":"Gridania","s":15}},{"type":"quest","id":"66727","obj":{"i":66727,"n":"On the Properties of Primals","g":2,"l":"South Shroud","s":17}}]}