{"quest":{"name":"The Gifted","location":"The Waking Sands","id":66728,"patch":2.1,"sort":18,"icon":100176,"eventIcon":71201,"issuer":1006693,"target":1006693,"involved":[1003785,1007478,1007751],"genre":2,"journal":["The time has come at last to leave Vesper Bay, and Minfilia would apprise you of the final details of the move.","Rather than leaving en masse, the Scions will travel to Mor Dhona in several small groups. You are to remain with Minfilia until all the rest have gone. While you await your turn to depart, the Antecedent explains that Urianger will not be joining you at Revenant's Toll, and bids you inquire of him if anything has been left undone.","While discussing the future of the Waking Sands with Urianger, you hear a cry from the solar which could only be Minfilia's. After bursting through the doors, you find the Antecedent collapsed upon the floor, alive─thank the gods─but unmoving. Wielding the power of the Echo, you learn that an Ascian robed in white was present mere moments before, having infiltrated the Scions' inner sanctum unnoticed. As the vision unfolds, the trespasser proclaims himself an emissary, and speaks cryptically of the Echo and its power, asserting that mastery of this gift could end hostilities between the Ascians and the children of Hydaelyn forever. Back in the present, Minfilia rises to her feet, disoriented but unharmed, and commands you to search Vesper Bay for the Ascian, who she suspects may still be lurking nearby.","You are shocked to find the Ascian standing in the center of Vesper Bay, making no attempt to conceal his presence. Although he recognizes you as the one who bested Lahabrea in the Praetorium, he expresses some doubt as to your true capabilities. After declaring that he will walk north, he adds that you may follow, but warns that you will be waylaid should you choose to do so.","A trio of imps ambush you outside the gates of Vesper Bay, precisely as the Ascian predicted. Though he does not appear to be present, you cannot shake the sensation that you are being watched...","You are soon waylaid by another voidsent─a gargoyle, this time─which you duly slay. As before, you feel certain that the battle was observed...","Upon entering Parata's Peace, you are assailed by a pair of gnarled gargoyles, but they are unable to stop you from pressing forward. To the north, you spy the white-robed Ascian standing motionless, as if daring you to approach. Oblige him.","As the white-robed figure watches in silence, four black-clad Ascians appear and engage you in combat. Wielding dire magicks, they push you to your mortal limits, but in the end you claim victory. As the last one falls, you see what looks like a grin flash across the face of your observer. Accost him and find out what he has to say.","\"As it was, so shall it be again.“ The words of Elidibus linger in your memory, simultaneously inviting and eluding interpretation. Intriguingly, the Ascian emissary claims to serve the same god as Lahabrea, yet he appears to bear no ill will towards you and your fellow Scions. Quite why this should be is unclear─if, indeed, it is even true... Return to the Waking Sands and report all that has transpired to Minfilia.","Your tale serves only to confound an already troubled Minfilia, who is at a loss to explain Elidibus's actions. Though it would seem that the white-robed Ascian is no friend to Lahabrea, everything else about him remains a mystery."],"objectives":["Speak with Urianger.","Search for the white-robed Ascian.","Follow the white-robed Ascian.","Approach the white-robed Ascian.","Speak with the white-robed Ascian.","Report to Minfilia at the Waking Sands."],"dialogue":[{"name":"MINFILIA","text":"Owing to the tireless efforts of all concerned, we are, at long last, ready to bid farewell to Vesper Bay."},{"name":"MINFILIA","text":"So as to avoid drawing undue attention, we shall make the journey to Revenant's Toll in small groups, departing at irregular intervals."},{"name":"MINFILIA","text":"Lest you doubt, it is still my intention to conduct future operations openly, but on this particular occasion, the need for caution overrides all other concerns. To move north as one ponderous caravan would only serve to invite attack."},{"name":"MINFILIA","text":"It seemed only right that I should be the last to leave, and I would have you remain with me until the end, <span class=\"highlight\">Forename</span>."},{"name":"MINFILIA","text":"Upon my departure, the Waking Sands will formally cease to be our headquarters, and the premises will be given into the care of Urianger."},{"name":"MINFILIA","text":"I had thought to relinquish the property, but he was quite adamant, and I had not the heart to disagree. These walls have borne witness to some of the brightest...and darkest moments in our order's history. Mayhap it is best that we do not forsake them entirely."},{"name":"MINFILIA","text":"Urianger shall remain here and devote his energies to studying the nature of primals. By the grace of the Twelve, he will one day discover the permanent solution that we have sought for so long."},{"name":"MINFILIA","text":"Of course, he will not be alone─Alisaie shall continue to work closely with him as well."},{"name":"MINFILIA","text":"Should they require our assistance, I have their assurances that they will not hesitate to contact us."},{"name":"MINFILIA","text":"Speaking of Urianger─would you inquire of him if any tasks remain undone? I cannot escape the feeling that I have forgotten something. Something important."},{"name":"URIANGER","text":"Thou art ever welcome, <span class=\"highlight\">Forename</span>, but I require no assistance. Pray take thy leave unburdened by concern for my well-being."},{"name":"URIANGER","text":"Verily, thy countenance bespeaks a desire to quit this place without further delay. Hm. Mayhap thou thinkest this chapter of our tale concluded─that these halls should rightly be consigned to the annals of history...?"},{"name":"URIANGER","text":"In man's eagerness to seize the future, how readily he doth set down the past."},{"name":"URIANGER","text":"Full many a proud pioneer hath bravely stridden into the great unknown, only to find there the banner of his ancestor, faded by the eons. And <span class=\"emphasis\">still</span> man glorieth in his discoveries. 'Tis through his pride that wisdom doth ever give way to ignorance, while they who lurk in shadow remain hidden, lost no sooner than they are found."},{"name":"URIANGER","text":"&lt;sigh&gt; Be not offended, <span class=\"highlight\">Forename</span>. Thy conduct hath ever been beyond reproach. Despite thy surpassing strength, and all thy many victories, thou hast never been so convinced of thine own greatness as to imagine thyself above the failings of thy forebears. Mayhap it is the Echo which hath opened thine eyes to the lessons of history. Would that the same could be said of─"},{"name":"MINFILIA","text":"Aaaaaahhh!"},{"name":"URIANGER","text":"Whence came that cry!? The solar! Twelve forfend─the Antecedent!"},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>... Y-You...you must..."},{"name":"MINFILIA","text":"Tell me, Louisoix... Would you have done the same?"},{"name":"ELIDIBUSANCIENT","text":"(-???-)<span class=\"highlight-purple\">...Louisoix Leveilleur was a remarkable man. Wise beyond mortal measure. Would that I had met him prior to his passing.</span>"},{"name":"MINFILIA","text":"An Ascian, here!? How─!?"},{"name":"ELIDIBUSANCIENT","text":"(-???-)<span class=\"highlight-purple\">How readily you see. You are indeed gifted, Antecedent.</span>"},{"name":"MINFILIA","text":"But you... You are not like the others. Your robes..."},{"name":"ELIDIBUSANCIENT","text":"(-???-)<span class=\"highlight-purple\">Gifted─but ignorant. Yet I shall not judge you harshly. The fault lies with your forebears. It has been...millennia.</span>"},{"name":"ELIDIBUSEORZEA","text":"(-???-)Mine are the robes of an emissary. Unlike he who came before, I have no quarrel with you."},{"name":"MINFILIA","text":"He who─ You speak of Lahabrea?"},{"name":"ELIDIBUSEORZEA","text":"(-???-)Lahabrea is a warrior. He fought. He fell."},{"name":"ELIDIBUSEORZEA","text":"(-???-)He may yet learn from his mistakes."},{"name":"MINFILIA","text":"Then he...he is still..."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Come. I only confirm that which you already knew."},{"name":"ELIDIBUSEORZEA","text":"(-???-)There is no cessation, no oblivion. Only expulsion."},{"name":"MINFILIA","text":"You... What are...?"},{"name":"TATARU","text":"We're ready when you are, my lady! If there's nothing else..."},{"name":"TATARU","text":"...Is something the matter?"},{"name":"TATARU","text":"Ah...I feel the same way. After everything that's happened here, it feels strange to leave. But I'm sure we'll soon get used to Revenant's Toll."},{"name":"TATARU","text":"Well...I'll let you say your good-byes. Take as long as you like, my lady. We shall depart whenever you're ready."},{"name":"ELIDIBUSEORZEA","text":"(-???-)It is only to be expected. She lacks the gift and the knowledge both. To her, we are indistinct."},{"name":"MINFILIA","text":"I...I do not understand."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Shadowless, fleshless, formless... What truth there is in each tale is diluted by time and telling."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Knowledge dictates expectation, and expectation colors perception. Thus did she perceive naught."},{"name":"ELIDIBUSEORZEA","text":"(-???-)So it is with all but a chosen few. Even you, when young, could not yet see with eyes unclouded."},{"name":"MINFILIA","text":"You know nothing about me. <span class=\"emphasis\">Nothing</span>."},{"name":"ELIDIBUSEORZEA","text":"(-???-)The gift grants you clarity; it grants you focus. With it, you may in time come to see us as we are, rather than this crude approximation."},{"name":"MINFILIA","text":"Lahabrea did not think so highly of the Echo."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Lahabrea is wrong about a great many things. The Echo is indeed a gift─albeit one you have yet to master."},{"name":"MINFILIA","text":"And if we did?"},{"name":"ELIDIBUSEORZEA","text":"(-???-)There would be no strife between our peoples─for we would be of one mind."},{"name":"ELIDIBUSEORZEA","text":"(-???-)I leave, as I came, in peace, Antecedent. May we meet again as friends."},{"name":"MINFILIA","text":"Wait! Stay where you are!"},{"name":"MINFILIA","text":"Aaaaaahhh!"},{"name":"ELIDIBUSANCIENT","text":"(-???-)<span class=\"highlight-purple\">Mayhap I was indelicate... 'Tis a mercy She shields Her children from His grace with such resolve.</span>"},{"name":"ELIDIBUSANCIENT","text":"(-???-)<span class=\"highlight-purple\">Was it also by Her hand that you survived the Ardor, I wonder?</span>"},{"name":"MINFILIA","text":"&lt;groan&gt; I...I take it there is no need to explain."},{"name":"MINFILIA","text":"Save your concern. He did me no lasting harm. Whatever his intention was, it was not to kill."},{"name":"TATARU","text":"I heard a cry! What happened!? Are you all right?"},{"name":"TATARU","text":"You look faint─do you need to lie down? I could fetch you a flask of my special tonic─"},{"name":"MINFILIA","text":"Urianger, send word to the Students of Baldesion. Tell them to scour the archives─the forbidden tomes in particular."},{"name":"MINFILIA","text":"If there is <span class=\"emphasis\">any</span> reference to an Ascian robed in white, however oblique, I would know of it."},{"name":"URIANGER","text":"...An Ascian, my lady? Was that what gave you cause to cry out?"},{"name":"URIANGER","text":"I did but moments ago glimpse a figure clad in white set forth from the Waking Sands. Yet Ascians are wont to employ teleportation magicks─why would one be so brazen?"},{"name":"MINFILIA","text":"I know not and care not. Find him, <span class=\"highlight\">Forename</span>! Turn every stone in Vesper Bay if you have to!"},{"name":"URIANGER","text":"Pray attend me, Tataru."},{"name":"MINFILIA","text":"He speaks of peace, but I <span class=\"emphasis\">know</span> his words belie his true intent."},{"name":"MINFILIA","text":"Quickly, <span class=\"highlight\">Forename</span>─do not let him escape!"},{"name":"TATARU","text":"Tell me he's gone, <span class=\"highlight\">Forename</span>. Tell me we're safe. We <span class=\"emphasis\">are</span> safe, aren't we...?"},{"name":"URIANGER","text":"What this visitation doth portend, I cannot say. But that thou must pursue the Ascian is clear. Scour thee Vesper Bay for signs of his passing. And fear not for the Antecedent's well-being─should the fiend be so imprudent as to return to the Waking Sands, he shall not find us unprepared a second time."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Approach when you will. I shall wait."},{"name":"ELIDIBUSEORZEA","text":"(-???-)I am told that you are the Warrior of Light. But I would know for myself."},{"name":"ELIDIBUSEORZEA","text":"(-???-)I shall walk north, and you may choose to follow."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Know, however, that you will be waylaid if you do─you may even perish. Should you survive, we shall speak anon."},{"name":"ELIDIBUSEORZEA","text":"(-???-)I see you live. Good. But your trial is not yet at an end."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Remarkable. Truly remarkable. I thank you for granting me this indulgence."},{"name":"ELIDIBUSEORZEA","text":"(-???-)None save <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who bested Lahabrea could endure such an examination."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Have the laws of man grown so twisted in my absence that it is now permitted to lay hands upon an emissary?"},{"name":"ELIDIBUSEORZEA","text":"(-???-)You bore witness to my audience with the Antecedent, did you not? Then you know I acted only in self-defense."},{"name":"ELIDIBUSEORZEA","text":"(-???-)I realize the same cannot be said of Lahabrea. Even amongst his brethren, he is considered...unique. Nevertheless, I cannot wholly condemn his misdeeds, for through them we discovered you─one so strong in the gift that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> could cast us out."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Your Mother favors you still, that much is plain. But surely you must feel it? Her influence wanes, and Her strength shall soon be spent."},{"name":"ELIDIBUSEORZEA","text":"(-???-)These lands, these people, this world─all shall soon change."},{"name":"ELIDIBUSEORZEA","text":"(-???-)As it was, so shall it be again. As it should always have been."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Doubt my claims and question my motives if you will."},{"name":"ELIDIBUSEORZEA","text":"(-???-)Only believe me when I say this..."},{"name":"ELIDIBUSEORZEA","text":"(-Elidibus-)I am Elidibus, emissary─bearer of the word of the one true god. And we shall meet again."},{"name":"MINFILIA","text":"Thank the gods you've returned, <span class=\"highlight\">Forename</span>! After you left, I began to worry that I might have sent you to your doom. I take it our visitor proved elusive?"},{"name":"MINFILIA","text":"Beg pardon? He was <span class=\"emphasis\">waiting</span> for you!? What did you do? What did he say?"},{"name":"MINFILIA","text":"\"As it was, so shall it be again“? ...Of when does he speak? And of what, exactly?"},{"name":"MINFILIA","text":"The words of this Elidibus portend much but reveal nothing─save perhaps a measure of disdain for Lahabrea."},{"name":"MINFILIA","text":"&lt;sigh&gt; I had hoped for answers, but it seems I shall have to be content with a wealth of additional questions."},{"name":"TATARU","text":"Where were you, <span class=\"highlight\">Forename</span>!? Did you find the man in white? Oh, what am I doing─the Antecedent is waiting for you!"},{"name":"URIANGER","text":"By the Twelve's good grace, thou hast returned. The Antecedent waiteth for thee. Hie thee to her side without further delay."},{"name":"POP","text":"You are being judged... "}],"reward":{"gil":2642,"items":[{"num":2,"id":6154}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66727]},"next":[66729,69414]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1003785","obj":{"i":1003785,"n":"Tataru","l":42,"q":5}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1007751","obj":{"i":1007751,"n":"White-robed Ascian","l":42,"q":1}},{"type":"item","id":"6154","obj":{"i":6154,"n":"Voidsent Blood","l":70,"c":22601,"t":54}},{"type":"quest","id":"66727","obj":{"i":66727,"n":"On the Properties of Primals","g":2,"l":"South Shroud","s":17}},{"type":"quest","id":"66729","obj":{"i":66729,"n":"Build on the Stone","g":0,"l":"The Waking Sands","s":19}},{"type":"quest","id":"69414","obj":{"i":69414,"n":"Build on the Stone","g":2,"l":"The Waking Sands","s":19}}]}