{"quest":{"name":"It's Possibly a Primal","location":"Western Thanalan","id":66724,"patch":2.1,"sort":14,"eventIcon":71201,"target":1000168,"involved":[1004603,1006693],"genre":0,"journal":["Though you would not have thought it possible, Tataru has somehow managed to adopt a countenance still more grim than before.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Evidence suggests that a primal─or an entity resembling one─has been summoned in Gridania, and the Scions are duty-bound to investigate. High Serpent Commander Heuloix of the Order of the Twin Adder has requested you by name, and Minfilia bids you answer his summons. Make for the Adders' Nest with all haste.","You receive a warm welcome from the high serpent commander, who affirms his belief that you are the most qualified for the task at hand. Endeavor to live up to his high opinion and press him for further details."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"TATARU","text":"A messenger from the Twin Adder came to the Waking Sands while you were in Coerthas. I wasn't privy to his conversation with the Antecedent, but I did see the look on her face after he took his leave. Something is definitely amiss."},{"name":"TATARU","text":"Could it be that the Ixal have summoned Garuda again!? Or mayhap imperial forces have been sighted within the Shroud!"},{"name":"TATARU","text":"Well, whatever it may be, I'm absolutely certain it's nothing you can't handle. Now go and ask the Antecedent if there's anything you can do!"},{"name":"TATARU","text":"Pray do not tarry, <span class=\"highlight\">Forename</span>! The Antecedent needs you!"},{"name":"MINFILIA","text":"I knew this day would come, yet I prayed it would not come so soon."},{"name":"MINFILIA","text":"We have reason to believe that another primal─or an entity resembling one─has been summoned in Gridania."},{"name":"URIANGER","text":"Thine arrival is customarily timely, <span class=\"highlight\">Forename</span>. The aetheric waves leave little room for doubt; thy talents will be needed ere long."},{"name":"URIANGER","text":"If there be truth in my suspicions, 'tis a familiar foe we face, though one quite unlike the Lady of the Vortex..."},{"name":"MINFILIA","text":"We dare not draw conclusions without evidence, but as Urianger says, the readings bear a strong resemblance to ones observed more than five years ago."},{"name":"MINFILIA","text":"&lt;sigh&gt; Though I had hoped the Mogglesguard beyond such follies..."},{"name":"MINFILIA","text":"Suffice it to say, this disturbance warrants a full investigation."},{"name":"URIANGER","text":"Thy presence hath been requested by Commander Heuloix. He awaiteth thee at the Adders' Nest."},{"name":"MINFILIA","text":"Pray hasten to Gridania, <span class=\"highlight\">Forename</span>. Yda and Papalymo will rendezvous with you there. May you walk in the light of the Crystal."},{"name":"MINFILIA","text":"We cannot ignore this aetheric disturbance, <span class=\"highlight\">Forename</span>. Journey to Gridania and speak with Commander Heuloix of the Twin Adder. Yda and Papalymo will rendezvous with you anon."},{"name":"VORSAILE","text":"A pleasure to see you as always, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>."},{"name":"VORSAILE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Thank you for coming so swiftly.</span><span class=\"alternative\">Thank you for answering my summons. Quite frankly,</span></span> I could think of no one more qualified to─ Ah, but we're getting ahead of ourselves. Allow me to explain..."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66723]}},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1004603","obj":{"i":1004603,"n":"Tataru","l":42,"q":2}},{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"quest","id":"66723","obj":{"i":66723,"n":"The Things We Do for Tea","g":0,"l":"Western Thanalan","s":13}}]}