{"quest":{"name":"The Things We Do for Tea","location":"Western Thanalan","id":66723,"patch":2.1,"sort":13,"eventIcon":71201,"target":1003785,"involved":[1006428,1006429],"genre":0,"journal":["Tataru regards you with a grim countenance. Whatever could the matter be?","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Medguistl states that her stores of highland tea leaves were depleted but a few bells prior to your arrival. She advises you to seek out Emanuel the wine seller, who plies his wares in the courtyard of Camp Dragonhead.","Recognizing you from your previous escapades in Coerthas, Emanuel regretfully explains that his next shipment of highland tea leaves is unlikely to arrive for some time. This being the case, he proposes that you harvest the leaves yourself from the plants which grow along the riverbanks in Boulder Downs─adding that you may need to mind your surroundings whilst doing so.","Braving all manner of unfriendly wildlife, you succeed in harvesting a sufficiency of highland tea leaves. Deliver your fragrant haul to Tataru, who is waiting outside the Waking Sands, and be done with this second errand.","Tataru wastes no time preparing her tonic, and you listen with mounting disgust as she recites its ingredients in song. For a mercy, you are spared the full horror of the recipe when she abruptly remembers that a crisis has erupted in your absence."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"TATARU","text":"Preparing for the move is taking a terrible toll on everyone's mental and physical well-being. People have been carrying on for days at a time with barely any food or drink, never mind rest. Some have been too busy to visit the <span class=\"emphasis\">privy</span>, for gods' sakes!"},{"name":"TATARU","text":"I try to lift their spirits, but encouraging words simply aren't enough anymore."},{"name":"TATARU","text":"Given that nothing short of hitting them over the head with something heavy will persuade them to rest, my only remaining option is to try improving their diet. I know just how to do it, too: with a special tonic proven to revive flagging spirits."},{"name":"TATARU","text":"But for that, I require highland tea leaves─and the one merchant I know who sells them is completely out of stock. Harvesting them myself isn't an option, either, as the plant only grows in Coerthas, and I'm in no position to leave the Waking Sands at present."},{"name":"TATARU","text":"But <span class=\"emphasis\">you</span> are, <span class=\"highlight\">Forename</span>─and since you now understand how important this is, you'll <span class=\"emphasis\">surely</span> agree to assist me? Great! I'll take that silence as a yes."},{"name":"TATARU","text":"I learned the recipe from an Ishgardian acquaintance of mine who serves at Camp Dragonhead. Medguistl's her name. She'll know where to obtain highland tea leaves, I'm sure of it. Godsspeed!"},{"name":"TATARU","text":"Highland tea leaves don't seem to be a very popular commodity outside of Coerthas, so I doubt you'll find them for sale in these parts. Nevertheless, they are an essential ingredient of this tonic."},{"name":"TATARU","text":"It was my friend Medguistl who gave me the recipe, so she must surely know where the tea leaves can be obtained. Please, hurry to Camp Dragonhead and ask her. You know how important this is!"},{"name":"MEDGUISTL","text":"Now <span class=\"emphasis\">there's</span> a face I shan't soon forget, not after all the chaos you left in your wake. 'Twas for the best, of course, but still..."},{"name":"MEDGUISTL","text":"Tataru sent you in search of <span class=\"emphasis\">highland tea leaves</span>? Ah. Had you come but a few bells sooner, I'd have given you my remaining supply. Alas, you did not, and now I have none."},{"name":"MEDGUISTL","text":"Where did I acquire my stock? Emanuel, where else? He sells more than wines and spirits, after all."},{"name":"EMANUEL","text":"As ever, it is a pleasure to serve such an esteemed personage as yourself. Alas, I cannot furnish you with that which I do not have."},{"name":"EMANUEL","text":"I know not when my next shipment will arrive, but I fear it will not be soon. Assuming you cannot afford to wait, might I humbly suggest that you consider harvesting the leaves yourself? If you travel to Boulder Downs and scour the riverbanks, you should have no trouble finding the plants."},{"name":"EMANUEL","text":"The <span class=\"emphasis\">real</span> challenge will be keeping the local fauna at bay while you set about picking the tea."},{"name":"EMANUEL","text":"But what are mere beasts to the brave adventurer who fought at Lord Haurchefant's side!?"},{"name":"EMANUEL","text":"As I believe I mentioned, I cannot say with any certainty when my next shipment of highland tea leaves will arrive. Rather than resign yourself to what may prove to be a lengthy wait, you might consider visiting Boulder Downs and harvesting the leaves yourself."},{"name":"TATARU","text":"I'm at my wit's end, <span class=\"highlight\">Forename</span>! This tonic is the Scions' only hope! Without it, I don't know <span class=\"emphasis\">what</span> will become of us! Please─you have to find those leaves!"},{"name":"TATARU","text":"You brought them! You really brought them! Thank you so much!"},{"name":"TATARU","text":"There's no time to waste─I shall begin brewing without delay!"},{"name":"TATARU","text":"A dollop of honey, a fresh sprig of mint,♪<br>Aloe extract, just so...♪"},{"name":"TATARU","text":"A tincture of tea, but no more than a hint,♪<br>To buoy my beloved beau...♪"},{"name":"TATARU","text":"Nix eyes and flan flesh ground to a paste,♪<br>Fresh ogre offal for─"},{"name":"TATARU","text":"&lt;gasp&gt; ...The NEWS! Uwaaah! I <span class=\"emphasis\">knew</span> there was something I'd forgotten to mention!"},{"name":"TATARU","text":"Ill tidings, <span class=\"highlight\">Forename</span>! As ill as ill can be! Another crisis in the making!"},{"name":"POP","text":"You sense a hostile presence!"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66722]},"next":[66724]},"partials":[{"type":"npc","id":"1003785","obj":{"i":1003785,"n":"Tataru","l":42,"q":5}},{"type":"npc","id":"1006428","obj":{"i":1006428,"n":"Emanuel","l":63,"q":2}},{"type":"npc","id":"1006429","obj":{"i":1006429,"n":"Medguistl","l":63,"q":2}},{"type":"quest","id":"66722","obj":{"i":66722,"n":"You're Gonna Carry That","g":0,"l":"Mor Dhona","s":12}},{"type":"quest","id":"66724","obj":{"i":66724,"n":"It's Possibly a Primal","g":0,"l":"Western Thanalan","s":14}}]}