{"quest":{"name":"Build on the Stone","location":"The Waking Sands","id":66729,"patch":2.1,"sort":19,"icon":100177,"eventIcon":71201,"target":1007724,"involved":[1007478,1007765],"genre":0,"journal":["Minfilia has a final favor to ask of you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","By curious coincidence, Minfilia contacts you via linkpearl immediately after you deliver the journal to Urianger. She has departed for Revenant's Toll, and bids you follow as soon as you are able. Travel to Mor Dhona, and speak with Tataru inside the Seventh Heaven to gain entrance to the Rising Stones.","Tataru welcomes you as warmly as always, and assures you that the Scions' new headquarters will more than meet with your expectations. Take a moment to explore the Rising Stones, and speak with Minfilia when you are satisfied that you know your way around.","Even as the Scions of the Seventh Dawn celebrate the inauguration of their new headquarters, Urianger arrives unannounced, bearing troubling news. The distant yet dependable Students of Baldesion are no longer responding to his messages. Fearing the worst, Minfilia bids Urianger do everything he can to determine the cause of their uncharacteristic silence. For the time being, however, the Scions have no choice but to continue their work without the aid of one of their closest allies."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Waking Sands.</span>"],"dialogue":[{"name":"MINFILIA","text":"Let us set aside the matter of this Ascian until after we have completed our move to the Rising Stones. There is but one final favor I would ask of you before I depart."},{"name":"MINFILIA","text":"I believe I mentioned before that my father was a member of the Ala Mhigan Resistance. The truth, however, is more complicated than that."},{"name":"MINFILIA","text":"As far as the Empire knew, he was their spy. He maintained the deception for nigh on half a decade, furnishing the Resistance with vital imperial secrets while feeding his paymasters subtly conceived misinformation."},{"name":"MINFILIA","text":"When he died some fifteen years ago, my father left behind his journal, which I have closely guarded ever since. It contains every shred of information he and his agents could steal on what they believed to be the single greatest threat to Eorzea: the primals."},{"name":"MINFILIA","text":"Its wisdom has guided me through the years, though there is much within I still do not understand..."},{"name":"MINFILIA","text":"It is my hope that Urianger will fare better."},{"name":"MINFILIA","text":"Tell him to treat it with care. It is all I have left of my father."},{"name":"MINFILIA","text":"Please, before I reconsider, give my father's journal to Urianger."},{"name":"URIANGER","text":"I thought thee departed. To what end dost thou linger?"},{"name":"URIANGER","text":"The father's final bequest...the daughter's lifelong labor."},{"name":"URIANGER","text":"It is no small thing to surrender such a cherished memento. Well can I imagine the Antecedent's pain. Upon mine honor, I swear to spare no effort in the study of these materials, lest my lady's sacrifice be in vain."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>, this is Minfilia."},{"name":"MINFILIA","text":"Forgive me, but I could wait no longer─I have departed for the Rising Stones."},{"name":"MINFILIA","text":"If...if you have yet to..."},{"name":"MINFILIA","text":"...Once you have given the journal to Urianger, I bid you come to the Seventh Heaven in Revenant's Toll. Tataru will be there to show you inside our new headquarters."},{"name":"MINFILIA","text":"Assuming you have already attuned to it, you may wish to make use of our new aetheryte in Revenant's Toll. After all, it is right on our doorstep!"},{"name":"URIANGER","text":"Thou hast been summoned to the Rising Stones, yes? Then keep not thy fellows waiting."},{"name":"TATARU","text":"Welcome, <span class=\"highlight\">Forename</span>! Welcome! This is your first time here, if I'm not mistaken?"},{"name":"TATARU","text":"I think you're going to like our new home! ...Well, what are you waiting for? Go in and have a look!"},{"name":"TATARU","text":"You're the last to arrive; everyone else is already here."},{"name":"TATARU","text":"Why are you standing around here talking to me? They're waiting for you inside!"},{"name":"MINFILIA","text":"Well, it is certainly spacious."},{"name":"MINFILIA","text":"Today marks a new beginning for the Scions of the Seventh Dawn, for today we declare our independence."},{"name":"ALPHINAUD","text":"We shall henceforth be beholden to no nation, but serve all of Eorzea's people, proudly and openly."},{"name":"ALPHINAUD","text":"But this does not mean that we will sever our ties to the Eorzean Alliance. On the contrary, the Antecedent and I shall endeavor to strengthen them. Rest assured, however, that we shall not permit political considerations to influence our decisions."},{"name":"MINFILIA","text":"Our identity remains unchanged, as does our cause. We are the Scions of the Seventh Dawn, and our single purpose is to safeguard the future of Eorzea."},{"name":"ALL","text":"(-Scions of the Seventh Dawn-)For Eorzea!"},{"name":"MINFILIA","text":"A moment of your time, <span class=\"highlight\">Forename</span>. I would speak of Elidibus─"},{"name":"URIANGER","text":"Pardon the intrusion, my lady, but the matter which bringeth me will admit no delay. Mine every attempt to contact the Students of Baldesion hath been met with silence."},{"name":"MINFILIA","text":"No one will respond?"},{"name":"MINFILIA","text":"How odd. Allow me to try."},{"name":"MINFILIA","text":"...No response. Surely they would not ignore us?"},{"name":"URIANGER","text":"They have never yet, my lady. I fear we must assume the worst."},{"name":"MINFILIA","text":"No. No, I will not believe it. An outpost, perhaps, but not their headquarters."},{"name":"MINFILIA","text":"Their wards are beyond circumvention. Had they come under attack, they would most certainly have raised the alarm. None could penetrate their sanctum unnoticed─"},{"name":"MINFILIA","text":"But for those who lack the gift and the knowledge both. Oh no..."},{"name":"MINFILIA","text":"Contact their agents in the field at once. If aught has befallen the Students of Baldesion, they may know of it."},{"name":"MINFILIA","text":"...Though the thought of it pains me, until such time as we have evidence to the contrary, we can but assume the worst. Accordingly, we must needs seek another source of information on Elidibus."},{"name":"URIANGER","text":"'Tis possible that others in the homeland are possessed of such knowledge. Be fairly warned, however: they are unlike to yield it unconditionally."},{"name":"MINFILIA","text":"Do what you must."},{"name":"MINFILIA","text":"Yet another unforeseen and unwelcome development..."},{"name":"MINFILIA","text":"What could be next, I wonder? A visit from a crimson-clad Ascian, perhaps? Or ocher? Or puce? And which of our allies will then fall silent...?"},{"name":"MINFILIA","text":"...For a time, I thought we had gained the upper hand."},{"name":"MINFILIA","text":"When you shattered the Crystal of Darkness and cast out Lahabrea, I dared to hope that we had found a way to rid ourselves of the Ascian menace."},{"name":"MINFILIA","text":"But I was wrong. He endures, and may yet return. Upon that point, I have no doubt that Elidibus spoke true."},{"name":"MINFILIA","text":"Yet there <span class=\"emphasis\">must</span> be a way to destroy them utterly─a way to spare this world their unholy machinations!"},{"name":"MINFILIA","text":"I dare not consider the alternative..."},{"name":"MINFILIA","text":"There are forces at work we do not understand, <span class=\"highlight\">Forename</span>."},{"name":"MINFILIA","text":"I discern them all around─in disturbances too great and too numerous to be dismissed as mere coincidence. Doubtless the Paragons are involved, but how and to what end is far from clear."},{"name":"MINFILIA","text":"I know not what will come, but I <span class=\"emphasis\">do</span> know that we will rise and meet it as one."},{"name":"MINFILIA","text":"Ah, my stalwart hero... Your face is a picture of resolve."},{"name":"MINFILIA","text":"I know that you will be ready when the time comes. With luck, however, that will not be for a while yet. Pray return to your private affairs with my blessing. Should anything arise, you will be informed."},{"name":"MINFILIA","text":"Krile...where are you?"},{"name":"NABRIALESEORZEA","text":"<span class=\"highlight-purple\">Your intercession was not foretold.</span>"},{"name":"ELIDIBUSEORZEA","text":"(-Elidibus-)<span class=\"highlight-purple\">You object?</span>"},{"name":"NABRIALESEORZEA","text":"<span class=\"highlight-purple\">We question. Our plans are in motion, your intentions unclear.</span>"},{"name":"ELIDIBUSEORZEA","text":"(-Elidibus-)<span class=\"highlight-purple\">They survived the Seventh Ardor and are stronger now in the gift. Does that not intrigue you?</span>"},{"name":"NABRIALESEORZEA","text":"<span class=\"highlight-purple\">...No, it does not.</span>"},{"name":"ELIDIBUSEORZEA","text":"(-Elidibus-)<span class=\"highlight-purple\">Serve as you will. So too shall I. We labor not at cross purposes.</span>"},{"name":"ELIDIBUSEORZEA","text":"(-Elidibus-)<span class=\"highlight-purple\">The wisdom of His plan shall become apparent in time, when the veil is lifted from their eyes...</span>"},{"name":"ELIDIBUSEORZEA","text":"(-Elidibus-)<span class=\"highlight-purple\">And, at long last, they see.</span>"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66728]},"next":[66881]},"partials":[{"type":"npc","id":"1007724","obj":{"i":1007724,"n":"Minfilia","l":481,"q":3}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1007765","obj":{"i":1007765,"n":"Tataru","l":67,"q":1}},{"type":"quest","id":"66728","obj":{"i":66728,"n":"The Gifted","g":2,"l":"The Waking Sands","s":18}},{"type":"quest","id":"66881","obj":{"i":66881,"n":"Still Waters","g":0,"l":"The Rising Stones","s":20}}]}