{"quest":{"name":"Quake Me Up Before You O'Ghomoro","location":"The Waking Sands","id":66732,"patch":2.1,"sort":3,"icon":100133,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1007478,"involved":[1003281],"genre":13,"journal":["Urianger bids you rise to the challenge of another primal threat.","Titan, the Lord of Crags, has made his presence known in Vylbrand with ground-shaking force. Travel to Maelstrom Command in Limsa Lominsa, and speak with High Storm Commander R'ashaht Rhiki to offer your assistance.","Summoned once more by his kobold followers, the primal Titan has settled into his usual abode in the Navel. Infiltrate the kobolds' stronghold in outer La Noscea, and reestablish your link with the U'Ghamaro aetheryte.","You have re-attuned to the aetheryte hidden within U'Ghamaro Mines. Assemble your companions, and storm the domain of the Lord of Crags!<br><br>※The Navel (Extreme) can be accessed via the Duty Finder.","You have defeated the primal Titan and obtained a ritual focus.","Deliver the ritual object to Commander R'ashaht Rhiki at Maelstrom Command in Limsa Lominsa, and inform her of your success against the primal Titan.","Commander R'ashaht Rhiki appears as unsure of the purpose of the ritual focus as her counterpart in Gridania. Return to the Waking Sands in Vesper Bay, and deliver the second trophy of bone to Urianger.","After listening to the tale of your adventures, Urianger begins comparing the common elements surrounding the unusually powerful resurgence of both Garuda and Titan. It appears that the growing strength of the primals neatly coincides with your own steadily burgeoning abilities..."],"objectives":["Speak with R'ashaht Rhiki at Maelstrom Command.","Re-attune to the aetheryte in U'Ghamaro Mines.","Confront Titan in the Navel (Extreme).","Bring the Crag ritual focus to R'ashaht Rhiki at Maelstrom Command.","Deliver the Crag ritual focus to Urianger at the Waking Sands in Vesper Bay."],"dialogue":[{"name":"URIANGER","text":"The Maelstrom has sent word of a mountain-shaking tremor felt by every man and beast in the northern half of Vylbrand."},{"name":"URIANGER","text":"Aye, the kobolds have awoken the Lord of Crags, and this shuddering arrival doth echo with the heightened strength shown by his sister primal."},{"name":"URIANGER","text":"Seek thee out High Storm Commander R'ashaht Rhiki at Maelstrom Command in Limsa Lominsa. Thy path leads once more to the stony feet of Titan."},{"name":"RASHAHT","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span></span>. Glad I am to see you answer our desperate summons."},{"name":"RASHAHT","text":"As you have no doubt heard, the kobolds have, it seems, yet again called forth the primal Titan within their mountain abode."},{"name":"RASHAHT","text":"The recent quaking of the land can be attributed to no other. And, considering the intensity of the tremor, we can be sure that Urianger's warnings concerning the enhanced power of the primals are far from idle."},{"name":"RASHAHT","text":"We Maelstrom officers would, of course, like naught better than to shatter the belligerent old boulder ourselves, but we cannot risk losing our soldiers to tempering. Once again, we must turn to the seasoned veterans of the Scions."},{"name":"RASHAHT","text":"According to our readings, the rumblings are strongest in the Navel─Titan's usual haunt within U'Ghamaro Mines."},{"name":"RASHAHT","text":"You should be able to enter the primal's domain by re-attuning to the beastman aetheryte found within the kobolds' territory in outer La Noscea─after the previous defeat of their Great Father, you can wager they've “recalibrated” their crystal.<br>May you crash against this stubborn rock with the fury of a thousand waves!"},{"name":"ASCIANSCEPTER","text":"<span class=\"highlight-purple\">Titan displayed a most satisfying degree of destructive power. The intensifying effects of the ritual foci are undeniable.</span>"},{"name":"ASCIANSWORD","text":"<span class=\"highlight-purple\">Powerful though this incarnation was, the primal's eventual defeat was not unexpected. The burgeoning strength shown by the Bringer of Light, however, has grown beyond reckoning.</span>"},{"name":"ASCIANSCEPTER","text":"<span class=\"highlight-purple\">Such a demonstration of force serves us still─it invites ever greater retaliation.</span>"},{"name":"ASCIANSWORD","text":"<span class=\"highlight-purple\">Yes... As the Light burns brighter, so, too, are the shadows steeped deeper in Darkness.</span>"},{"name":"RASHAHT","text":"The rumblings have ceased! It seems that no matter how powerful the Lord of Crags becomes, you and your companions are up to the task.<br>...Yes? You found something of interest in the Navel?"},{"name":"RASHAHT","text":"Is this...bone? And such a grotesque design. Honestly, I will never understand the kobolds' sense of aesthetics."},{"name":"RASHAHT","text":"You say you acquired a similar object after your battle with Garuda? Then we must consider the possibility that these trinkets are responsible for the primals' appalling new strength."},{"name":"RASHAHT","text":"But I shall leave such conclusions to those more learned in the subject than I. Pray return to the Waking Sands and convey my greetings to Urianger."},{"name":"URIANGER","text":"So, the Lord of Crags was also possessed of unprecedented vigor. And thou hast returned with yet another curiosity of bone?"},{"name":"URIANGER","text":"The kobolds are not known for fashioning objects in this manner... What is more, its construction doth bear a striking similarity to that of the trophy recovered by thee from Garuda's lair."},{"name":"URIANGER","text":"The fleshless remains of beastman worshipers─this is the material common to both of these foreboding ritual tools. What unsavory sorcery have the Paragons bequeathed to their unsuspecting pawns?"},{"name":"URIANGER","text":"There is yet another commonality to this augmentation of the primals that concerns me─and that is <span class=\"emphasis\">thee</span>, <span class=\"highlight\">Forename Surname</span>."},{"name":"URIANGER","text":"For every mountain thou dost conquer, I am struck by the answering waxing in potency of the primals. The pattern is too clear to ignore."},{"name":"URIANGER","text":"Such a cycle bodes naught but ill for the realm─I must unlock the true nature of these immortal entities ere the land is once more wracked with ruin. And, as always, thou art my stoutest ally in the gathering of the requisite keys."}],"reward":{"gil":2908,"gcseal":2157,"xp":0,"instance":20009},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66731]},"next":[66733]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1003281","obj":{"i":1003281,"n":"R'ashaht Rhiki","l":28,"q":13,"t":"Storm Commander"}},{"type":"instance","id":"20009","obj":{"i":20009,"n":"The Navel (Extreme)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":67}},{"type":"quest","id":"66731","obj":{"i":66731,"n":"Gale-force Warning","g":13,"l":"Gridania","s":3,"f":1}},{"type":"quest","id":"66733","obj":{"i":66733,"n":"Ifrit Ain't Broke","g":13,"l":"The Waking Sands","s":3,"f":1}}]}