{"quest":{"name":"Primal Nature","location":"The Waking Sands","id":66730,"patch":2.1,"sort":3,"icon":100181,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1000168,"genre":13,"journal":["Urianger beseeches your aid in solving the resurgent mystery of the primals.","Urianger has heard word that the primal Garuda has returned. Travel to the Adders' Nest in Gridania, and speak with High Serpent Commander Vorsaile Heuloix to learn more of this seemingly immortal foe.","Commander Heuloix warns you that the tempestuous primal has displayed a degree of power far greater than any of her previous incarnations. Speak with the commander when you are ready to receive a briefing on what promises to be a most demanding and dangerous mission."],"objectives":["Speak with Vorsaile Heuloix at the Adders' Nest."],"dialogue":[{"name":"URIANGER","text":"Of all my tasks, the one by which I am most keenly vexed is the never-ending journey into the heart of the primals' true nature. Each door I fling wide leadeth me, with inevitable anguish, to another such confounding portal."},{"name":"URIANGER","text":"It is in these lands that the keys to the knowledge I seek are found. Many seasons did I toil to fashion a net across this vast realm─a net that catcheth not fish, but nuggets of wisdom more valuable than gold."},{"name":"URIANGER","text":"Much have I learned, but the essence of the primals is ever shifting─no dusty tome doth capture in ink what these terrible beings are now become."},{"name":"URIANGER","text":"It is decided: the stance of the Scions must evolve from shifting sand to unyielding stone. My place, however, is here in this land of unending tragedy. E'er must I remain, until the true nature of the primals is revealed unto me."},{"name":"URIANGER","text":"Many seasons did I toil to fashion a net across this vast realm─a net that catcheth not fish, but nuggets of wisdom more valuable than gold."},{"name":"URIANGER","text":"Yet even possessed of this hoard of knowledge, I cannot purchase all the keys to the confounding doors that bar my passage..."},{"name":"URIANGER","text":"Thus, must I presume to unsheathe the “blade born of light.” Thine is a strength that shattereth the stoutest barriers, and doth pierce that which obfuscates the impotent gaze of ordinary men. We have not the luxury of time required for my measured scholarly pace."},{"name":"URIANGER","text":"For the Adders' Nest is astir, hissing with the news of Garuda's return. Her winds have grown ever more violent, ever more destructive..."},{"name":"URIANGER","text":"What lieth behind this sudden waxing of power? The answer may well prove a vital piece of the puzzle of the primals' existence."},{"name":"URIANGER","text":"Mine eyes perceive a looming wall of strife, poised to crash down upon our cities with unrestrained fury. For the nonce, you must pacify the Lady of the Vortex."},{"name":"URIANGER","text":"Swiftly now, to the Adders' Nest. High Serpent Commander Heuloix will have such details as thou needest to proceed. I shall await thee at the Waking Sands, and pray for thy success."},{"name":"VORSAILE","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>! Might I deduce from your stern expression that you have heard the disturbing news? Aye, Garuda returns once more to plague our nightmares."},{"name":"VORSAILE","text":"I fear this incarnation of the Lady is more tempestuous than aught we have yet witnessed. If you are prepared to face this roiling storm, then I will brief you on what must be done."}],"reward":{"gil":939,"items":[{"num":3,"id":4554,"one":1},{"num":3,"id":4558,"one":1},{"num":3,"id":4560,"one":1},{"id":5825,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[20005],"quests":[66694]},"next":[66731]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"item","id":"4554","obj":{"i":4554,"n":"X-Potion","l":70,"c":20603,"t":44,"p":887}},{"type":"item","id":"4558","obj":{"i":4558,"n":"X-Ether","l":70,"c":20623,"t":44,"p":1108}},{"type":"item","id":"4560","obj":{"i":4560,"n":"Hi-Elixir","l":70,"c":20625,"t":44}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"instance","id":"20005","obj":{"i":20005,"n":"The Navel (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":57}},{"type":"quest","id":"66694","obj":{"i":66694,"n":"In a Titan Spot","g":13,"l":"The Waking Sands","s":2,"f":1}},{"type":"quest","id":"66731","obj":{"i":66731,"n":"Gale-force Warning","g":13,"l":"Gridania","s":3,"f":1}}]}