{"quest":{"name":"For Prosperity","location":"Mor Dhona","id":66739,"patch":2.1,"sort":5,"icon":100180,"unlocksFunction":1,"eventIcon":71341,"issuer":1007763,"target":1006725,"genre":15,"journal":["G'raha Tia is ready to address the assembled fellowship of NOAH.","Now that a path through the Labyrinth of the Ancients has been secured, it is time for the fellowship of NOAH to discuss the next stage of the expedition. Begin by apprising Rammbroes of your progress.","The most significant finding of your initial survey is also the most obvious: namely that the long-dormant mechanisms of the Crystal Tower have somehow been reawakened. In order to ascertain what coaxed them into motion after several thousand years of stillness, there is no recourse but to forge onwards and upwards into the spire itself. Given the danger inherent in this proposition, however, it is agreed that no further forays should be made until Cid and his assistants have conducted an exhaustive analysis of the tower's next line of defense. Faced with the prospect of a lengthy delay, G'raha Tia warns you against idleness, doubtless anticipating that the challenges to come will punish any hint of rustiness in your technique."],"objectives":["Speak with Rammbroes."],"dialogue":[{"name":"GRAHATIA","text":"The fellowship of NOAH being accounted for, it is time this assembly was called to order!"},{"name":"GRAHATIA","text":"Rammbroes will be presiding over the meeting. If you would be so kind as to inform him of your readiness to proceed..."},{"name":"RAMMBROES","text":"Welcome back, <span class=\"highlight\">Forename</span>. I have just been reading about your encounter in the Labyrinth of the Ancients. It pleases me greatly to note that you seem none the worse for the experience."},{"name":"RAMMBROES","text":"For your reference, I have added my own notes to G'raha's preliminary expedition report, and begun compiling a Crystal Tower survey log. The information contained therein will be available to you at all times. Should you have any questions, you need only ask."},{"name":"RAMMBROES","text":"Now, if there are no objections, I shall begin with a summary of the expedition's key accomplishments."},{"name":"RAMMBROES","text":"In the course of this, our first foray into the grounds of the Crystal Tower, we succeeded in neutralizing the structure's outer defenses, before proceeding to secure the maze surrounding the base of the spire."},{"name":"RAMMBROES","text":"According to <span class=\"highlight\">Forename</span>'s account, the labyrinth's defenses were most emphatically active. Disturbingly, <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> report also mentions a violent encounter with a sentry heavily augmented by Allagan technology..."},{"name":"CID","text":"In short: our misgivings were well founded. The Crystal Tower was not simply thrust above ground by the chaotic shifting of earth─it has somehow been <span class=\"emphasis\">reawoken</span>."},{"name":"CID","text":"If, as seems increasingly likely, the tower's secrets should prove too dangerous to share with the world, we will have no choice but to contain them. Short of leveling the place, this will almost certainly involve returning its mechanisms to a state of dormancy. To do <span class=\"emphasis\">that</span>, however, we will first need to address the question of how they work─the answer to which must surely be waiting for us inside the tower itself. In conclusion: that is where we must go."},{"name":"GRAHATIA","text":"A task rather easier said than done, if the perils of the labyrinth are any indication..."},{"name":"RAMMBROES","text":"Then I move that all further exploration of the tower be delayed until such time as an exhaustive analysis of the structure's defenses has been completed. Master Garlond, may I entrust this task to you?"},{"name":"CID","text":"It would be my pleasure."},{"name":"WEDGE","text":"Don't forget about us!"},{"name":"BIGGS","text":"It's like you said, Chief─we founded the Ironworks to make sure that technology was used for the right reasons, and that means making sure it's not used for the wrong ones. We wouldn't be doing our jobs if we didn't see this through to the end."},{"name":"CID","text":"Lads... Well, I hope you're ready for some backbreaking chores!"},{"name":"GRAHATIA","text":"Well, everything seems to be in hand here, so I shall take my leave of you for the present. If I am to witness this valiant tale unfold with mine own eyes, I must needs hone my martial skills ere we ascend the spire!"},{"name":"RAMMBROES","text":"You'll do nothing of the sort, G'raha. Your knowledge may prove useful to Master Garlond's investigation."},{"name":"GRAHATIA","text":"As an observer, I am not, strictly speaking, subject to your authority..."},{"name":"GRAHATIA","text":"Pray do not mistake my intent, <span class=\"highlight\">Forename</span>. I am well aware that I shall never be a match for one with your innate talents, however hard I train. Be that as it may, pray do not allow your skills to rust from disuse during the coming pause."},{"name":"GRAHATIA","text":"We will need you fighting fit if our subsequent forays are to prove as productive as this one. Mark me: we have not yet caught more than the briefest glimpse of that which time has obscured. Soon, however, we shall cast off the veil, and gaze upon the glory of the Allagan Empire!"},{"name":"RAMMBROES","text":"And with that encouraging thought in mind, it is time to bring this assembly to a close. Let us all focus on the tasks at hand, that our next expedition may begin all the sooner. Meeting adjourned!"},{"name":"NERO","text":"Such a terrible mess. Yet it does leave the door wide open, so to speak."},{"name":"NERO","text":"One cannot help but be impressed. I'm beginning to understand the reliance you place on adventurers, old friend."},{"name":"NERO","text":"So...this is the legacy the Allagan Empire left behind."},{"name":"NERO","text":"If my readings are correct, the energy source waiting atop the tower is a match for even the Ultima Weapon. Nay...more than a match."},{"name":"NERO","text":"Heh heh heh... A new toy for me to play with."},{"name":"NERO","text":"I believed the fates had conspired to deny me my just rewards once again...but it would seem they had a greater destiny in mind for me."},{"name":"NERO","text":"And so long as my ambition burns, I shall strive to seize it. The dream lives on, Cid... Do not disappoint me!"}],"reward":{"items":[{"id":5682,"one":1},{"id":5717,"one":1},{"id":5722,"one":1},{"id":5825,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66738]},"next":[67010]},"partials":[{"type":"npc","id":"1007763","obj":{"i":1007763,"n":"G'raha Tia","l":67,"q":4}},{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66738","obj":{"i":66738,"n":"Labyrinth of the Ancients","g":15,"l":"Mor Dhona","s":4,"f":1}},{"type":"quest","id":"67010","obj":{"i":67010,"n":"Syrcus Tower","g":15,"l":"Mor Dhona","s":6,"f":1}}]}