{"quest":{"name":"Ifrit Ain't Broke","location":"The Waking Sands","id":66733,"patch":2.1,"sort":3,"icon":100076,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1007478,"involved":[1004576],"genre":13,"journal":["Urianger seeks to prepare for the coming of the Lord of the Inferno.","Though there have been no overt signs of Ifrit's stirring, Urianger suspects that the situation will soon change. Visit the Hall of Flames in Ul'dah, and warn High Flame Commander Swift of the impending danger.","The disappearance of the Immortal Flames scouting parties deployed into Zahar'ak suggests that Ifrit once more rages within the Bowl of Embers. Commander Swift bids you gather a party of stout-hearted companions, and renew your bond with the Zahar'ak aetheryte in southern Thanalan.","You have re-attuned to the aetheryte at Zahar'ak. Assemble your companions, and confront the Lord of the Inferno in his own domain.<br><br>※The Bowl of Embers (Extreme) can be accessed via the Duty Finder.","You have defeated the primal Ifrit and obtained a ritual focus.","Deliver the ritual object to Commander Swift at the Hall of Flames in Ul'dah, and inform him of your success against the primal Ifrit.","Commander Swift appears eager to devise new tactics for dealing with the strengthened primals. Return to the Waking Sands in Vesper Bay, and deliver the third ritual focus to Urianger along with Swift's hopes for a successful investigation.","You deliver the ritual object to Urianger and describe your encounter with the shadowy Ascians. The Elezen laments that while he is occupied with uncovering a more permanent solution to the primal threat, there is no recourse but to continue slaying the beastman deities whenever they arise. It appears, however, that he may have a means to aid you in this increasingly dangerous endeavor."],"objectives":["Speak with Swift at the Hall of Flames.","Re-attune to the Zahar'ak aetheryte.","Confront Ifrit in the Bowl of Embers (Extreme).","Bring the Inferno ritual focus to Swift at the Hall of Flames.","Deliver the Inferno ritual focus to Urianger at the Waking Sands in Vesper Bay."],"dialogue":[{"name":"URIANGER","text":"We are fortunate that the Lord of the Inferno hath yet to rear his horned head. I fear, however, that reports of his return will not be long in the coming."},{"name":"URIANGER","text":"My quest for knowledge yet remains unfinished...but such a task can only properly be undertaken in a world unwracked by chaos. Let us bow to inevitability, and prepare ourselves for what will undoubtedly turn into another blistering trial."},{"name":"URIANGER","text":"Pray visit High Commander Swift at the Hall of Flames in Ul'dah, and advise him that the fiery primal will likely soon be among us once more. Mayhap with a measure of foresight, we can lessen the impact of Ifrit's arrival."},{"name":"SWIFT","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, your timing is most fortunate. Allow me to brief you on the situation."},{"name":"SWIFT","text":"Both the Maelstrom and the Order of the Twin Adder informed us of their recent troubles with disturbingly powerful primals. And, as these incidents ever occur in threes, we immediately sought to gather intelligence on Amalj'aa activity."},{"name":"SWIFT","text":"We lost contact with the first reconnaissance party assigned to the task. I then deployed one of our elite units to learn the fate of the missing scouts, but they, also, have failed to report back."},{"name":"SWIFT","text":"In their most recent missive, my elite troops declared their intention to investigate the Bowl of Embers. Though they may have been overwhelmed by the lizardmen, we must consider the possibility that the Lord of the Inferno has reclaimed his domain..."},{"name":"SWIFT","text":"It is with some measure of wounded pride, then, that I must request your aid. Assemble a group of your companions, and strike into the heart of Amalj'aa territory in southern Thanalan. If Ifrit has indeed returned, you are to banish him back to the aether by whatever means is necessary."},{"name":"SWIFT","text":"Ah, you will likely have to renew your bond with the Zahar'ak aetheryte to enter the Bowl of Embers─the lizardmen have undoubtedly realigned their crystal since you last felled their god. And, unfortunately, that means cutting your way through a goodly number of their sentries to reach it."},{"name":"SWIFT","text":"The Grand Company of the Immortal Flames is no stranger to sacrifice when it comes to battling the primals. But the struggle costs far too many lives, and often creates a host of new tempered enemies. You and your unique talents, however, can spare the families of our soldiers that grief..."},{"name":"SWIFT","text":"I will pass on news of your involvement in this mission to the Scions myself. Should our primal fears prove substantiated, then I pray your efforts meet with success."},{"name":"ASCIANSWORD","text":"(-???-)<span class=\"highlight-purple\">Ifrit was reborn with the strength of a thousand raging infernos, and yet you vanquished him. I can offer you naught but praise, Bringer of Light.</span>"},{"name":"ASCIANSCEPTER","text":"(-???-)<span class=\"highlight-purple\">Ever prepared for confrontation. Good. Those instincts serve us as well as they serve you.</span>"},{"name":"ASCIANSWORD","text":"<span class=\"highlight-purple\">What meaning hides within this constant pursuit of ever greater strength? Have you paused to dwell on its significance? However you might choose to justify your actions, it seems you have tested the very limits of these three primal avatars.</span>"},{"name":"ASCIANSCEPTER","text":"<span class=\"highlight-purple\">Again, such furious response. Did we not make ourselves clear? As amusing as such might prove, we do not come to trade blows with you.</span>"},{"name":"ASCIANSCEPTER","text":"<span class=\"highlight-purple\">This meeting is at an end. We must thank you for a most enlightening display.</span>"},{"name":"ASCIANSWORD","text":"(-Ascian-)<span class=\"highlight-purple\">We have learned much. The destiny we seek draws closer...ever closer...</span>"},{"name":"ASCIANSWORD","text":"(-Ascian-)<span class=\"highlight-purple\">How much longer can you stem the tide of Darkness, Bringer of Light? How well will you fare against the next god to reawaken? Hm hm hm...</span>"},{"name":"SWIFT","text":"So, the infernal primal had returned, after all─it is well that you set out prepared for the worst! Come now, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, you must describe your epic encounter in detail that we might revise our tactics for future engagements. Any information could prove useful."},{"name":"SWIFT","text":"Well, now, <span class=\"emphasis\">this</span> is an ominous relic. While the Amalj'aa are known for their barbaric trinkets, I sense something is different about this one."},{"name":"SWIFT","text":"...I see, so it is the third such object you have discovered within the domain of a primal. It certainly seems feasible that it played a role in Ifrit's enhanced volatility."},{"name":"SWIFT","text":"Return with your trophy to the Waking Sands, and pray bid Urianger to continue his investigations. Our eternal gratitude to you both."},{"name":"URIANGER","text":"The report from the Immortal Flames hath flown before thee. Dost thou return once more bearing a curious tool of ritual magicks?"},{"name":"URIANGER","text":"Ah, yes, it doth most closely resemble the others in form, and, I daresay, in function. The bone is, of course, Amalj'aa in origin."},{"name":"URIANGER","text":"...The servants of Darkness revealed themselves to thee? I am put in mind of Archon Louisoix's words: “Yet ever shall primal desires burn”...<br>For burn they shall, with the Ascians ever toiling to stoke the fires."},{"name":"URIANGER","text":"We are fortunate─their careless taunting hath provided us with certainty, where before there existed only conjecture."},{"name":"URIANGER","text":"It is <span class=\"emphasis\">un</span>fortunate, however, that thy actions serve the Ascians' purposes so well... Whenever thou slayest our primal foes, the beastmen seek to raise ever more ferocious gods. And now, it seems, their ceaseless ambitions are answered only by living sacrifice."},{"name":"URIANGER","text":"Each ritual object thou didst recover is a manner of focus─a tool fashioned from the bones of a willing worshiper. These foci contained the vast aetheric power generated by the fervent prayers of a beastman zealot in the moment of his death...<br>This power was then poured into each primal during the rite of summoning, thus giving rise to the augmented avatar thou didst engage."},{"name":"URIANGER","text":"To free us from the threat of the primals in truth, we must needs discover an escape from this endlessly escalating cycle of conflict. Such an answer will not, I fear, be readily attainable."},{"name":"URIANGER","text":"So, as long as understanding eludes us, there is no recourse but to continue with the slaying of primals. The aether they invariably hoard <span class=\"emphasis\">must</span> be released back into the land."},{"name":"URIANGER","text":"As the beastman deities wax ever more potent, it is a sad necessity that the nurturing of thine own strength cannot be ignored─an action that thou must take, even though it doth quicken the plans of the Paragons."},{"name":"URIANGER","text":"One of the paths to inexorable might hath ever been the pursuit of sturdy arms and armor. And in that endeavor, I may be able to assist thee..."}],"reward":{"gil":2908,"gcseal":2517,"xp":0,"instance":20008},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66732]},"next":[66734]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"instance","id":"20008","obj":{"i":20008,"n":"The Bowl of Embers (Extreme)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":70}},{"type":"quest","id":"66732","obj":{"i":66732,"n":"Quake Me Up Before You O'Ghomoro","g":13,"l":"The Waking Sands","s":3,"f":1}},{"type":"quest","id":"66734","obj":{"i":66734,"n":"To Tussle with Gods","g":13,"l":"The Waking Sands","s":3,"f":1}}]}