{"quest":{"name":"Gale-force Warning","location":"Gridania","id":66731,"patch":2.1,"sort":3,"icon":100161,"unlocksFunction":1,"eventIcon":71341,"issuer":1000168,"target":1007478,"genre":13,"journal":["Commander Vorsaile Heuloix wishes to send you against the latest incarnation of Garuda.","After briefing you on the unusually potent manifestation of the primal, Commander Heuloix bids you confront Garuda in her domain in the Howling Eye. Travel to the Coerthas central highlands and battle your way to the beastman aetheryte deep within Natalan.","You have fought past the ranks of the Ixal to once more stand before the Natalan aetheryte. Assemble your companions, and do battle with the Lady of the Vortex!<br><br>※The Howling Eye (Extreme) can be accessed via the Duty Finder.","You have defeated the primal Garuda and obtained a strange object fashioned of bone.","Deliver the bone curiosity to Commander Heuloix at the Adders' Nest in Gridania, and inform him of your success against the primal Garuda.","Commander Heuloix surmises that the unsettling memento you retrieved from the Howling Eye is likely some manner of ritual object. Return to the Waking Sands in Vesper Bay, and consult with Urianger on the nature of your grisly trophy.","You deliver the ritual focus to Urianger, and the scholarly Elezen surmises that Garuda's enhanced powers are likely the result of an altered rite of summoning. Doubting the Ixal's willingness to meddle with the traditional ritual, Urianger suspects the involvement of the chaos-breeding Ascians. As if to underscore his suspicions, the Scion prepares to tell you of yet another primal threat..."],"objectives":["Re-attune to the aetheryte at Natalan.","Confront Garuda in the Howling Eye (Extreme).","Bring the Vortex ritual focus to Vorsaile Heuloix at the Adders' Nest in Gridania.","Deliver the Vortex ritual focus to Urianger at the Waking Sands in Vesper Bay."],"dialogue":[{"name":"VORSAILE","text":"We first learned of Garuda's return when the primal fell upon the Blue Badgers as they sought to construct a new watchspire. The devastation was absolute."},{"name":"VORSAILE","text":"According to the report of the one surviving engineer, Garuda invoked the most horrific gale with but a gesture of her taloned hand. The powerful winds tore apart the half-built tower, crushing the workers and scattering their broken bodies like dolls."},{"name":"VORSAILE","text":"By all accounts, it appears the Lady of the Vortex is grown stronger with this summoning. She must be stopped before the casualties are allowed to pile any higher."},{"name":"VORSAILE","text":"But as you might imagine, the Ixal, eager to please their bloodthirsty goddess, are engaging our troops on every front. I have not the soldiers to spare for a primal-hunting expedition."},{"name":"VORSAILE","text":"Thus, I sent word to the Scions to beg the aid of proven champions. You and your companions are our best hope for freeing Gridania of this rampaging fiend."},{"name":"VORSAILE","text":"I ask that you confront Garuda in her customary domain: the Howling Eye. Such a titanic conflict is best confined to Ixali lands, wouldn't you agree?"},{"name":"VORSAILE","text":"Though I imagine the birdmen have since made “adjustments” to their crystal, the beastman aetheryte found within Natalan remains the surest means of entry. May the Twelve strengthen your arm, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>."},{"name":"ASCIANSWORD","text":"<span class=\"highlight-purple\">Our efforts to augment Garuda's powers were met with the predicted success. It is mildly unsatisfying, then, that the primal was thus summarily defeated.</span>"},{"name":"ASCIANSCEPTER","text":"<span class=\"highlight-purple\">Against the Bringer of Light, it appears a heavier hand is required. And now that the focus has been discovered...</span>"},{"name":"ASCIANSWORD","text":"<span class=\"highlight-purple\">It is of no consequence. Even should they understand the significance of its presence, they have no means to prevent the summonings.</span>"},{"name":"ASCIANSCEPTER","text":"<span class=\"highlight-purple\">And the beastmen continue to crave ever more powerful avatars every time their gods fall. With each link forged in this chain of ambition, the shackles of chaos are bound ever tighter.</span>"},{"name":"ASCIANSWORD","text":"<span class=\"highlight-purple\">It is not for us to entertain such speculation. We are bid only to convey what we have witnessed. Let us be gone from here.</span>"},{"name":"VORSAILE","text":"Once more, Garuda has fallen to your might! You have our gratitude, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. We are blessed to count such heroes among our allies.<br>...What's this? Some memento of the battle, mayhap?"},{"name":"VORSAILE","text":"Ugh, what an uncanny arrangement of bone. I have never seen its like."},{"name":"VORSAILE","text":"I could not guess for what foul ritual this object would be used... Might there be some connection to the primal, considering the place in which it was found?"},{"name":"VORSAILE","text":"I must ask that you take this grisly trophy to the Waking Sands and consult with Urianger. Perhaps he can provide some insight."},{"name":"URIANGER","text":"Thou art returned whole from thy grueling trial. Hath the battle with the Lady gifted thee a glimpse into the primals' fortress of inscrutability?"},{"name":"URIANGER","text":"Hmmm... A ritual focus of Ixali bone, home to what tainted powers I cannot say. Pray leave this curiosity with me, that I might dwell further on its nature."},{"name":"URIANGER","text":"Garuda's unseemly strength was not fueled by crystal caches and tempered worship alone. Nay, I fear some new rite of summoning was employed."},{"name":"URIANGER","text":"The rigid culture of the Ixal rarely spawneth such anomaly. Methinks agents more deeply versed in primal lore have meddled here─the Ascians, for a certainty."},{"name":"URIANGER","text":"And if those servants of Darkness are afoot, they will not stop at a single tribe. Such revelations do much to explain my recent communications. Art thou prepared to struggle once more against a beastman god?"}],"reward":{"gil":2908,"gcseal":1798,"xp":0,"instance":20010},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66730]},"next":[66732]},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"instance","id":"20010","obj":{"i":20010,"n":"The Howling Eye (Extreme)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":65}},{"type":"quest","id":"66730","obj":{"i":66730,"n":"Primal Nature","g":13,"l":"The Waking Sands","s":3,"f":1}},{"type":"quest","id":"66732","obj":{"i":66732,"n":"Quake Me Up Before You O'Ghomoro","g":13,"l":"The Waking Sands","s":3,"f":1}}]}