{"quest":{"name":"Sanding It Down","location":"Mor Dhona","id":66736,"patch":2.1,"sort":2,"unlocksFunction":1,"eventIcon":71341,"issuer":1006725,"target":1006725,"involved":[1004093,1007755,1007756,1007759],"genre":15,"journal":["Rammbroes wishes to proceed with the shaping of the flawless crystals.","Rammbroes explains that four varieties of an extremely rare abrasive known as aethersand are required to polish the flawless crystals. Take the purse given to you by the dig supervisor and deliver it to Serendipity, the master of the Goldsmiths' Guild in Ul'dah. It is Rammbroes's hope that the presence of a celebrated adventurer will prompt the goldsmiths to redouble their efforts to procure the required materials.","Upon arriving at the Goldsmiths' Guild, you encounter an old friend: Biggs. By some strange coincidence, it appears that the Roegadyn engineer is also intent on purchasing what little aethersand there is to be had. After a somewhat one-sided negotiation, he relinquishes his questionable claim on the only available batch in exchange for a role in the forthcoming expedition. The fire-aspected aethersand thus secured, inquire as to whether Biggs might know where to obtain the three remaining varieties.","Biggs reveals that his partner, Wedge, has traveled to northern Thanalan to meet with a merchant rumored to be in possession of a quantity of earth-aspected aethersand. Make for Bluefog and seek the Lalafell, who should be accompanied by a hired adventurer bodyguard.","According to the adventurer hired to guard Wedge, she last saw her employer during a bungled attempt to retrieve some aethersand which had been stolen by bandits. Betraying scarcely a hint of shame, the bumbling bodyguard speculates that Wedge may still be trapped inside the abandoned Amajina mythril mine which the bandits call home. Make haste to the site and rescue Biggs's stricken friend before it is too late.","To your great relief, Wedge bears no scars from his recent ordeal. Unfortunately, he also bears no aethersand, having dropped it whilst fleeing from his pursuers. Search the mine and retrieve the precious mineral before the bandits stumble upon it.","You have succeeded in retrieving the lost aethersand. Return to Wedge and inform him of your success.","Wedge is plainly overjoyed to have the aethersand back, but when he hears of your impending expedition, he decides to surrender the precious mineral to you, reasoning that your need is greater. It is time to head back to Saint Coinach's Find, and deliver the fire- and earth-aspected aethersand to Rammbroes.","After delivering the two samples of aethersand, you regale Cid with tales of his indefatigable employees' most recent misadventures. When thoughts subsequently turn to the two outstanding varieties of aethersand, Rammbroes declares that he has made “arrangements” to procure them. Quite what form these arrangements may take is unclear, but his expression betrays no small amount of apprehension..."],"objectives":["Deliver payment for the aethersand to Serendipity in the Goldsmiths' Guild in Ul'dah.","Speak with Biggs.","Speak with the experienced adventurer in Bluefog.","Rescue Wedge from the abandoned Amajina mythril mine.","Find the earth-cradled aethersand.","Return the earth-cradled aethersand to Wedge.","Deliver the aethersand to Rammbroes at Saint Coinach's Find."],"dialogue":[{"name":"RAMMBROES","text":"If the flawless crystals you procured for us are to retain their elemental purity during the shaping process, a very specific set of abrasive substances will be required."},{"name":"RAMMBROES","text":"Well, I say “substances,” but one might just as well call them one substance─namely “aethersand”─which has four elementally aspected varieties. Alas, aethersand is neither common nor cheap. Indeed, it is not unusual for the abrasive to exceed the value of the precious stones it is used to polish."},{"name":"RAMMBROES","text":"Given the rarity of the materials in question, the Goldsmiths' Guild in Ul'dah seemed the likeliest place to purchase the quantity we require. When I contacted the guildmaster, however, I was informed that no aethersand was currently available. Though I requested that word be sent as soon as new stock came in, I have yet to receive aught but apologies. I should mention at this point that I placed the order some time before you procured the flawless crystals..."},{"name":"RAMMBROES","text":"I am well aware that acquiring aethersand is no small feat, of course, and I am not an impatient man─but I fear the more we delay our investigation, the greater the risk that the tower's secrets may fall into the hands of other...less savory parties."},{"name":"RAMMBROES","text":"That is why I wish to entrust you with the payment for our purchase, and send you to speak directly with Guildmaster Serendipity. Mayhap the presence of such a distinguished personage will spur the guild into action. In any event, it is my hope that when next we meet, you will have found at least <span class=\"emphasis\">one</span> of the four varieties of aethersand we require!"},{"name":"SERENDIPITY","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Welcome, welcome! What brings you here, if I may ask?"},{"name":"SERENDIPITY","text":"You're here on behalf of the Sons of Saint Coinach? What fortunate timing─I was just about to contact Master Rammbroes with the news that we've finally managed to acquire a quantity of fire-aspected aethersand."},{"name":"SERENDIPITY","text":"I'm afraid it may be some time before we can supply the other three varieties, but you are welcome to settle accounts for that which we have now. Pray speak with Jemime over th─"},{"name":"SERENDIPITY","text":"Ah. I do beg your pardon. It seems she's assisting another customer."},{"name":"BIGGS","text":"Come on, there must be <span class=\"emphasis\">something</span> you can do! Without that sand, we'll have to rethink our whole design!"},{"name":"JEMIME","text":"I sympathize with your plight, sir, but as I explained the aethersand in question is already spoken for. If you'd like to reserve the next shipment, then I would be happy to accept the funds you've offered as partial payment..."},{"name":"BIGGS","text":"<span class=\"emphasis\">Partial</span>!? Are you saying it's not enough!? I'm already stretching our research budget as it is! &lt;sigh&gt; ...I suppose a man can do without a midday meal for a year or two..."},{"name":"BIGGS","text":"<span class=\"highlight\">Forename</span>! It's been too long! What brings you here, then? Got your eye on something expensive, have you?"},{"name":"JEMIME","text":"Well, now...that is quite a money pouch. The sound of so many gil clinking together is strangely satisfying, is it not? Calming...and yet invigorating at the same time..."},{"name":"BIGGS","text":"Oh no... You're here for the blooming <span class=\"emphasis\">aethersand</span>, aren't you?"},{"name":"BIGGS","text":"Well, I can't deny the Allagan civilization's a subject worth researching. The chief said he was looking into something big, but we never thought to ask him what."},{"name":"BIGGS","text":"Wedge and I have been too busy tinkering with a new airship design to think of much else, see. Well, I say “tinkering”...<span class=\"emphasis\">wrestling</span> would be more like it. Still, after much wringing of hands and gnashing of teeth, we've managed to put together a prototype crystal-powered propulsion system."},{"name":"BIGGS","text":"We got the idea for it when we heard how you lot had used a corrupted crystal on board the <span class=\"emphasis\">Enterprise</span>, as a matter of fact. Anyway, to cut a long story short, our design calls for all four varieties of aethersand."},{"name":"BIGGS","text":"And that's why I can't just relinquish my claim on this batch here─even for you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. How're we meant to usher in a brave new age of technological innovation if not by technologically innovating, eh!?"},{"name":"JEMIME","text":"Ahem. While I hesitate to interrupt such an <span class=\"emphasis\">impassioned</span> speech, duty compels me to point out that this <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> is a representative of the organization that reserved the aethersand in question─to mention nothing of the fact that <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> purse is <span class=\"emphasis\">considerably</span> larger than yours."},{"name":"BIGGS","text":"...Oh, it's like that, is it? &lt;sigh&gt;"},{"name":"BIGGS","text":"All right, all right...this batch is yours. I'll let you have it. But if you're going to take my sand, it's only fair that you grant me a role in this project of yours."},{"name":"BIGGS","text":"I'll take that as a yes. Ahhh, it's not every day you get a chance to experiment with the wonders of the ancients. With any luck, they'll inspire me to think up another technological innovation or two!"},{"name":"BIGGS","text":"Now then, from what you've told me, I'm guessing you'll be needing the other three varieties of elementally aspected aethersand as well, right?"},{"name":"BIGGS","text":"Then rather than sitting on your rump waiting for a shipment that may never come, I reckon your time would be better spent looking for the stuff yourself. And it just so happens that I know of a good place to start..."},{"name":"BIGGS","text":"There is said to be a peddler in northern Thanalan who─very occasionally─handles the earth-aspected variety of aethersand. Wedge is in the process of confirming the rumor as we speak."},{"name":"BIGGS","text":"I know what you're thinking: when did my timid little friend decide he didn't need me to hold his hand anymore? The answer being: just the other day! Seems he's been inspired by a certain adventurer's heroic example. I thought he was joking when he volunteered to go to Thanalan without me. I just hope he manages to stay out of trouble..."},{"name":"BIGGS","text":"Head out to Bluefog and you should find him poking about with his new bodyguard. Oh, did I not mention her? Aye, Wedge thought it might be wise to hire an adventurer to accompany him─just in case your heroic example turned out to be less inspiring than he first thought. Heh heh!"},{"name":"BIGGS","text":"If you mean to go looking for the aethersand yourself, you'd best catch up with Wedge over in Bluefog. As for me, I plan to set out for Mor Dhona, just as soon as I've finished locking up the workshop."},{"name":"NPC","text":"Save your greetings. If you're looking for a hired blade, then you'll have to look elsewhere. After the day I've had, the only company I crave is the squat, silent type─the type that has a handle and holds no less than a pint of ale."},{"name":"NPC","text":"...Hm? You wish to hear my tale? I warn you, 'tis no stirring epic─but as you asked... My employer─a Lalafellin lad─wished to pay a visit to a peddler who deals in some manner of special sand. I forget what it was called but 'tis apparently worth a small fortune. Anyway, when we arrived, the man claimed his stock had been stolen by bandits."},{"name":"NPC","text":"Determined not to return empty-handed, we crept into the bandits' stronghold and set about locating the stolen goods. Long story short, alarums were raised, rogues were awoken, and we fled in a blind panic. I was separated from my employer in the confusion and I've not seen him since. Hm? Oh. A friend of yours, is he?"},{"name":"NPC","text":"Then you'd best be prepared for the worst. 'Tis just possible the poor sod may yet be lost in the old Amajina mythril mine...but I fear the bandits will have caught up with him by now."},{"name":"NPC","text":"If he's still alive, your Lalafellin friend will probably be hiding somewhere inside the abandoned Amajina mythril mine where the bandits make their lair. You'll not catch me going anywhere near the place, though─I barely escaped with my life as it was!"},{"name":"WEDGE","text":"How could I be so <span class=\"emphasis\">stupid</span>? Sneaking into a bandit's lair... It's...it's just...not the sort of thing I do! And now I'm going to <span class=\"emphasis\">die</span> for it!"},{"name":"WEDGE","text":"No. No, I-I just need to calm down. I can do this. I <span class=\"emphasis\">can</span> be brave. I'm going to stand up, and I'm going to walk out of here. Here we go!"},{"name":"WEDGE","text":"YEEEAAARGH! I'm-sorry-I'm-sorry-I'm-sorry! <span class=\"emphasis\">Please</span> don't kill me! I promise I'll leave and never come...back?"},{"name":"WEDGE","text":"<span class=\"emphasis\"><span class=\"highlight\">Forename</span></span>!? Is it really you!? B-But how did you find me? Can you...<span class=\"emphasis\">smell fear</span>?"},{"name":"WEDGE","text":"A-Actually, ignore that smell. Ahem! I expect you're wondering why I'm here? Well, I was just in the process of retrieving some stolen aethersand which Biggs and I need for our research, as it happens. It was, I concede, perhaps a touch foolish─and very nearly fatal─but I <span class=\"emphasis\">did</span> succeed in snatching the stuff before my bodyguard ran away and several dozen bandits came piling after me with knives and axes and what looked very much like a plank with a rusty nail in it."},{"name":"WEDGE","text":"A-Anyway, the important thing is that the stolen aethersand is right here in my po─ In my─ Oh. Oh dear. It must have fallen out when I was, um...taking evasive maneuvers. It seems I won't be leaving this infernal place for a while yet..."},{"name":"WEDGE","text":"...You'll find the aethersand in my stead?"},{"name":"WEDGE","text":"Oh, thank the gods! You're a true friend, <span class=\"highlight\">Forename</span>! I hope the search doesn't prove too troublesome─the bandits don't seem to care much for visitors..."},{"name":"WEDGE","text":"The aethersand must have slipped out of my pocket while I was busy evading the bandits. I'm sure it's somewhere around here..."},{"name":"WEDGE","text":"<span class=\"highlight\">Forename</span>! Have you had any luck locating the aethersand?"},{"name":"WEDGE","text":"Yes, that's it! I must return to the workshop at once and tell Biggs the wonderful news!"},{"name":"WEDGE","text":"What's that? You're also on a mission to collect aethersand? And you're working with the chief? A “treasure trove of Allagan knowledge,” you say? ...I see."},{"name":"WEDGE","text":"Then you should really be the one to have this. Biggs and I are far from exhausting all possible avenues of airship innovation, but it sounds as if your problem can't be solved by any other means."},{"name":"WEDGE","text":"This expedition of yours sounds jolly interesting, I must say... I'm half-inclined to join you. In fact─I think I will! Any venture worth the chief's time must be worth a look!"},{"name":"WEDGE","text":"Right! I'm more than ready to leave this awful place behind! And you should return to Mor Dhona with that aethersand before there are any more, um...little mishaps. Be sure to keep a close eye on your pockets, <span class=\"highlight\">Forename</span>!"},{"name":"RAMMBROES","text":"Ah, <span class=\"highlight\">Forename</span>, you have returned. I take from your presence that you were successful in procuring us some aethersand. Tell me, which variety did you find?"},{"name":"RAMMBROES","text":"...I see! Two varieties. Well, that is two more than could reasonably be expected─and two less than I had hoped you would say. Forgive my flippancy. You have done well, truly. If all goes to plan, we need no longer fear death by fire or earth."},{"name":"RAMMBROES","text":"Master Garlond─if you would be so kind as to prepare the relevant crystals."},{"name":"CID","text":"I shall set to work immediately. Truth be told, I've been looking forward to this. One does not encounter materials like these every day."},{"name":"CID","text":"Speaking of which, how in the seven hells did you find them? Mistake me not, old friend─I know only too well how capable you are, but aethersand isn't something you simply find gathering dust at the back of a merchant's rare gem cabinet."},{"name":"CID","text":"...You had help from Biggs and Wedge?"},{"name":"CID","text":"Hmph! Trust them to design a revolutionary new engine the moment I turn my back. How's a genius meant to rest on his laurels when his employees are so damnably <span class=\"emphasis\">inventive</span>, eh? And now they're determined to join us, are they? Typical!"},{"name":"CID","text":"I jest, of course. It will be good to have them around. Still, as a matter of professional pride, let's endeavor to procure the two remaining varieties of aethersand before they arrive, shall we? Tell me, Rammbroes─have we any information on where the water- and wind-aspected types might be hiding?"},{"name":"RAMMBROES","text":"Naught as of yet, but...I have made certain arrangements. We shall soon see if my efforts have borne fruit."},{"name":"CID","text":"Forgive me for observing, but you seem less than enthusiastic about that prospect. If there's a complication, I'd rather we discuss it now than risk jeopardizing the expedition."},{"name":"RAMMBROES","text":"&lt;sigh&gt; Mayhap an explanation is in order. But first, let us savor the preliminary victory that <span class=\"highlight\">Forename</span> has won for our cause, if only for a moment."}],"reward":{"gil":1220,"items":[{"id":5667,"one":1},{"id":5672,"one":1},{"id":5677,"one":1},{"id":5825,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"any","quests":[66735,67245]},"next":[66737]},"partials":[{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1007755","obj":{"i":1007755,"n":"Biggs","l":41,"q":1}},{"type":"npc","id":"1007756","obj":{"i":1007756,"n":"Experienced Adventurer","l":46,"q":1}},{"type":"npc","id":"1007759","obj":{"i":1007759,"n":"Wedge","l":46,"q":1}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66735","obj":{"i":66735,"n":"Legacy of Allag","g":0,"l":"Mor Dhona","s":1,"f":1}},{"type":"quest","id":"67245","obj":{"i":67245,"n":"Legacy of Allag","g":15,"l":"Mor Dhona","s":1,"f":1}},{"type":"quest","id":"66737","obj":{"i":66737,"n":"A Performance for the Ages","g":15,"l":"Mor Dhona","s":3,"f":1}}]}