{"quest":{"name":"To Tussle with Gods","location":"The Waking Sands","id":66734,"patch":2.1,"sort":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1006951,"involved":[1001304,1004576],"genre":13,"journal":["Urianger wishes to introduce you to a means of acquiring superior arms.","Urianger has arranged for a merchant in Mor Dhona to accept the ritual foci as fair exchange for a unique weapon. Take the three primal trophies you collected, and trade them to Rowena at Revenant's Toll.","After scrutinizing the uncanny objects of bone, Rowena appears satisfied that they will sell for a handsome sum. Deliver the ritual tools to Laraina, the merchant's acquisitions officer, and formalize the transaction.","You deliver the primal trophies to Laraina, and receive three tokens in exchange. With such tokens in your possession, you are now able to make a selection from Rowena's stock of high-quality armaments. Laraina explains that should you wish to obtain more of their weapons, you need only bring her another set of “stomach-churning” ritual foci."],"objectives":["Take the three ritual foci to Rowena at Revenant's Toll in Mor Dhona.","Deliver the three ritual foci to Laraina."],"dialogue":[{"name":"URIANGER","text":"If thou art to weather these constant clashes against ever-more-potent primals, then thou must perforce arm thyself with extraordinary weapons. I have concluded negotiations with one Rowena, a merchant who doth abide at Revenant's Toll."},{"name":"URIANGER","text":"In exchange for the ritual objects thou hast collected, she hath promised to provide thee with a selection from her stock of unique armaments."},{"name":"URIANGER","text":"Why wouldst she consent to purchase these unsavory trophies? It is a simple question of infamy. Certain of her clientele are like to salivate at the very thought of possessing such forbidden items─there are few who can lay claim to the ownership of a ritual tool employed in the summoning of a primal."},{"name":"URIANGER","text":"There is no cause for alarum. Any power the objects once held has long since been surrendered to the summoned deities. And lest thou worry on my account, I have gleaned from them what wisdom we required."},{"name":"URIANGER","text":"I return to thee thy hard-won prizes. Hie thee to Revenant's Toll in Mor Dhona, and see them swiftly into Rowena's hands."},{"name":"ROWENA","text":"Greetin's, adventurer. So, you're the one as hopes to trade some primal curiosities, are you? Urianger's guaranteed their authenticity, so why don't you let ol' Rowena here have a look at these ritual objects o' yours?"},{"name":"ROWENA","text":"Hmmm, carved from beastman bones, just like he described... Well, I'd be lyin' if I said these trinkets didn't make my skin crawl like a diremite in my undergarments."},{"name":"ROWENA","text":"In case you misunderstand, that's an expression o' high praise, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. My customers'll be guttin' each other in the streets for a chance to purchase your trophies! Show them to Laraina, my acquisitions officer, and she'll walk you through the transaction."},{"name":"LARAINA","text":"Gods damn you, Rowena. You promised me a life of excitement in the exotic land of Mor Dhona, and here I am stocking your shelves like a trained opo─ Ahem. May I help you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>?"},{"name":"LARAINA","text":"Ugh! What in the seven unholy hells are those gruesome things!? Beastman ritual tools?"},{"name":"LARAINA","text":"You adventurers and your penchant for stowing the most disgusting souvenirs in your packs! Blech. And that goes twice for Rowena for wanting to stock the stuff, and <span class=\"emphasis\">thrice</span> for her addled customers for begging to buy it!"},{"name":"LARAINA","text":"&lt;sigh&gt; But that's neither here nor there. Whatever it is that drives you folk also fills my purse with coin. Now, were you seeking to trade for aught in particular?"},{"name":"LARAINA","text":"Ah, the special weapons we deal in, is it? Here, take a few of these tokens, and you'll be able to exchange them for any arms you fancy."},{"name":"LARAINA","text":"If you're one of those <span class=\"emphasis\">completionist</span> types, then you'll no doubt want an entire armory of the things! Just bring me another set of those stomach-churning ritual tools, and I'll see you rewarded with more tokens. Best hop to it!"}],"reward":{"gil":1220,"items":[{"num":3,"id":7004}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66733]},"next":[66845]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1006951","obj":{"i":1006951,"n":"Laraina","l":67,"q":2}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"item","id":"7004","obj":{"i":7004,"n":"Rowena's Token","l":1,"c":26171,"t":61}},{"type":"quest","id":"66733","obj":{"i":66733,"n":"Ifrit Ain't Broke","g":13,"l":"The Waking Sands","s":3,"f":1}},{"type":"quest","id":"66845","obj":{"i":66845,"n":"Primal Focus","g":13,"l":"Mor Dhona","s":4,"r":1,"f":1}}]}