{"quest":{"name":"Why So Sirius","location":"Western La Noscea","id":66745,"patch":2.1,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1005525,"target":1005398,"genre":91,"journal":["Diamanda would hear tidings of your battle with the siren.","Diamanda is overjoyed to hear of your triumph over the siren, the brave deed having served to avenge her father and clear the way for the long-overdue restoration of Pharos Sirius. She urges you to convey the good news to Master Mimidoa in Aleport, that the two might commence their work.","Good tidings were met with grim revelations, as Master Mimidoa revealed that the crew of undead seamen in the siren's thrall were none other than the wretched remains of Diamanda's beloved brother and his loyal mates. In hearing the painful truth from her master's mouth, the young smith is finally able to come to terms with that which she had long since suspected, and she resolves to devote herself to the restoration effort to honor the memory of her family."],"objectives":["Speak with Mimidoa."],"dialogue":[{"name":"DIAMANDA","text":"So it is true that you triumphed over the siren!? Words cannot express my gratitude. My only regret is that my dear brother could not be here today to hear that our father's death has been avenged."},{"name":"DIAMANDA","text":"He set sail with his crew three years past, you see, and has yet to return to shore. But I hold out hope that his ship shall come sailing into harbor any day now. And on that day, I shall be the first to share with him the news of your triumph."},{"name":"DIAMANDA","text":"In the meanwhile, however, we can finally press on with the restoration of Pharos Sirius. I must get to work at once. I would be much in your debt if you could inform Master Mimidoa that the coast is clear for us to begin."},{"name":"MIMIDOA","text":"Ye've done it!? Sent the bloody siren screechin' and shriekin' to the murky depths what she came? Ye've done us all a great service today, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. If ye wouldn't mind, regale ol' Mimidoa's ears with a tale o' the foul wench's last song..."},{"name":"MIMIDOA","text":"What's that? Ye had to fend off a ghostly crew wearin' the sea-sodden duds o' Maelstrom men?"},{"name":"MIMIDOA","text":"'Tis as I feared. The poor lass... Me heart goes out to her."},{"name":"MIMIDOA","text":"'Twas three years to the day, give or take a moon. A crew o' the Maelstrom's finest set sail on a routine patrol. But ain't nothin' “routine” in these parts, and they'd not return to shore. Rumors spread quick-like that it was a siren song what led the vessel to a watery grave."},{"name":"MIMIDOA","text":"Maelstrom Command jumped to quiet the talk─ill tidin's were already too easy to come by in those days after the Calamity─but those of us in the know, we knew. Like father, like son... <span class=\"alternative-container\"><span class=\"alternative\">Lass</span><span class=\"alternative\">Lad</span></span>, promise this ol' sod ye'll spare poor Diamanda the truth. Lass's already suffered more'n her share..."},{"name":"MIMIDOA","text":"Diamanda!?"},{"name":"DIAMANDA","text":"Th-This...this cannot be! My brother is still alive at sea! The search effort continues! Master Mimidoa, you yourself have told me the same!"},{"name":"MIMIDOA","text":"F-Forgive me, missy. I never meant to deceive. The Maelstrom made me swear a vow, ye see, that I'd keep the truth buried deep in..."},{"name":"MIMIDOA","text":"Ah, bugger me vow, and bugger me! Truth is, this scurvy coward just couldn't summon the nerve to tell ye the truth. Diamanda...can ye ever forgive a sorry ol' sod?"},{"name":"DIAMANDA","text":"There is no need for forgiveness, Master Mimidoa, for the true coward...is me. In my heart, I have always known. This adventurer's deeds and your words have finally given me the courage to face the truth."},{"name":"DIAMANDA","text":"I am a woman grown. The time for clinging to childish dreams has passed─I must look to the future."},{"name":"DIAMANDA","text":"My smithing skills are still wanting, but I will not falter from the task."},{"name":"DIAMANDA","text":"Pharos Sirius will burn bright once more, a beacon of hope in the darkest of nights. The fell songs of the sea have claimed their last victim─I shall see to it with my own two hands."},{"name":"MIMIDOA","text":"Strong words, lass. I trust ye'll not forget 'em when yer paws are all blebby and blistery."},{"name":"DIAMANDA","text":"My hands? Why, I'll clench my hammer with my teeth if need be. Father, Brother...do you hear me? Your deaths will not be...in...vain..."}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[17],"quests":[66744]},"next":[67737]},"partials":[{"type":"npc","id":"1005525","obj":{"i":1005525,"n":"Diamanda","l":33,"q":2}},{"type":"npc","id":"1005398","obj":{"i":1005398,"n":"Mimidoa","l":33,"q":2}},{"type":"instance","id":"17","obj":{"i":17,"n":"Pharos Sirius","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":48,"max_ilvl":110}},{"type":"quest","id":"66744","obj":{"i":66744,"n":"Sirius Business","g":91,"l":"Western La Noscea","s":500,"f":1}},{"type":"quest","id":"67737","obj":{"i":67737,"n":"Things Are Getting Sirius","g":91,"l":"Limsa Lominsa","s":600,"f":1}}]}