{"quest":{"name":"Where the Heart Is (The Goblet)","location":"Western Thanalan","id":66749,"patch":2.1,"sort":50,"icon":100189,"unlocksFunction":1,"eventIcon":71341,"issuer":1002001,"target":1002001,"involved":[1005531,1005880],"genre":93,"journal":["Imme has information that may interest wealthy adventurers.","Rumor has it that plots within the Goblet are to be auctioned off, and that even foreigners will be permitted to purchase them. Should you wish to learn more, Imme advises you to search for an Immortal Flames representative outside the gates to the Goblet in western Thanalan.","Momoraji explains that only adventurers will be permitted to settle in the Goblet, as part of an initiative to encourage their immigration to Ul'dah. Though it would require substantial funds to build and maintain an estate, he assures you that it would be well worth the expense, and encourages you to visit the Goblet so that you may see the lands for yourself.","As promised, the Goblet exceeds all expectation. To learn more about the residential area, speak with the flame recruit stationed near the entrance.","Alas, the recruit confirms that Ul'dahn citizens are prohibited from purchasing plots in the Goblet. Doubtless many adventurers will flock to the region─and many Ul'dahns like Imme will envy them deeply. Perhaps it would be best if you were the one to deliver the bad news to her.","Imme is understandably disappointed that she cannot participate in the land auctions, though she is aware that in these troubled times Ul'dah must rely on adventurers more than ever. Should you share her dream of home ownership, it would behoove you to speak with the resident caretaker in the Goblet to learn more."],"objectives":["Speak with Momoraji.","Journey to the Goblet.","Speak with the flame recruit.","Report to Imme."],"dialogue":[{"name":"IMME","text":"Have you heard the news about the Goblet?"},{"name":"IMME","text":"All that quality land, so desperately coveted, is to be auctioned off to bidders, regardless of their origins!"},{"name":"IMME","text":"Even <span class=\"emphasis\">adventurers</span> have the right to participate. Just imagine─the entire area could end up owned by wealthy foreign─"},{"name":"IMME","text":"Ah, beg your pardon, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. It isn't that I dislike adventurers, far from it. But when you consider that Ul'dah is still struggling to accommodate countless refugees, the idea that this land is being sold for profit is...not surprising whatsoever, come to think of it."},{"name":"IMME","text":"Still, the least they could do is give preferential treatment to hardworking Ul'dahns like me! I've been saving for years, just waiting for an opportunity like this to come along!"},{"name":"IMME","text":"Say─you wouldn't happen to be curious as well, would you? About the Goblet. My hands are full here, but if you've a moment to head that way and look into this auction business on my behalf, I'd be ever so grateful. There's bound to be an Immortal Flames representative by the gates or in the Goblet who can explain what's going on. This wouldn't happen without General Raubahn's approval, of that much I'm sure!"},{"name":"MOMORAJI","text":"Heard about the auctions, have you? You're not the first to approach me this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">morn</span><span class=\"alternative\">day</span></span>."},{"name":"MOMORAJI","text":"Aye, 'tis true─in an effort to encourage immigration to our great nation, all lands within the Goblet are to be set aside for adventurers like yourself."},{"name":"MOMORAJI","text":"Tragic, some might say, that only adventurers will be permitted to settle within its wards. But such decisions were made by men wiser than I."},{"name":"MOMORAJI","text":"A beautiful place, the Goblet. A man-made oasis, built atop a towering butte..."},{"name":"MOMORAJI","text":"Ah, but why bother explaining when you can see it for yourself? Just head through these gates and follow the road."},{"name":"MOMORAJI","text":"If you wish to know more about the Goblet, speak with the recruit stationed just past the entrance. He will be happy to assist you."},{"name":"SYSTEM","text":"To proceed with the quest “Where the Heart Is (The Goblet),” you may visit any residential ward within the Goblet."},{"name":"MOMORAJI","text":"If you've any significant savings, you really ought to consider owning your own estate."},{"name":"MOMORAJI","text":"Think of it not as a purchase, but as an investment in your future."},{"name":"WHGUIDE","text":"Greetings, adventurer, and welcome to the Goblet."},{"name":"WHGUIDE","text":"Beg your pardon? An Ul'dahn woman asked you to learn more about the auctions?"},{"name":"WHGUIDE","text":"Oh dear. As you may have heard, these plots are reserved exclusively for adventurers. Since your friend is an Ul'dahn citizen, she is ineligible to participate."},{"name":"WHGUIDE","text":"Should you yourself have a mind to purchase a plot, pray speak with the resident caretaker. He can guide you through the process."},{"name":"WHGUIDE","text":"I'm afraid I know little of the purchasing process myself. The resident caretaker is far more qualified to speak on such matters."},{"name":"IMME","text":"You've returned! Tell me, what have you learned of the auctions?"},{"name":"IMME","text":"Eh!? What do you mean it's reserved exclusively for adventurers? I mean sure, times are tough, and every nation is scrambling to attract formidable fighters..."},{"name":"IMME","text":"But what about <span class=\"emphasis\">my</span> needs!? What about my forty acres and a chocobo? Bah, it's just not fair!"},{"name":"SYSTEM","text":"The residential district Aethernet for the Goblet can be accessed through the Ul'dahn aetheryte."}],"reward":{"gil":132,"xp":280},"reqs":{"jobs":[{"lvl":5,"id":1}]}},"partials":[{"type":"npc","id":"1002001","obj":{"i":1002001,"n":"Imme","l":42,"q":2}},{"type":"npc","id":"1005531","obj":{"i":1005531,"n":"Momoraji","l":42,"q":1}},{"type":"npc","id":"1005880","obj":{"i":1005880,"n":"Flame Recruit","l":427,"q":1}}]}