{"quest":{"name":"After Her Own Heart","location":"Ul'dah","id":66742,"patch":2.1,"sort":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1001285,"target":1005716,"involved":[1001691,1005712,1005713,1005715,1005717,1005718],"genre":68,"journal":["Wymond believes it would be best if you assisted Inspector Hildibrand with his investigation.","According to Wymond, the victim Inspector Hildibrand seeks is a wealthy woman named Yellow Moon. Given her taste for the finer things in life, she can often be found in the Weavers' Guild, being fitted for a new garment. Go and speak with Yellow Moon─with luck, Inspector Hildibrand will not be far behind.","Serendipitously, Inspector Hildibrand and Nashu arrive at the Weavers' Guild shortly after you, and together you all learn that Yellow Moon's Pure Heart is but one of several items that have been stolen. Unable to determine precisely when and where the perpetrator struck, Inspector Hildibrand proposes that you retrace Yellow Moon's path on the day of the theft. To that end, speak with him outside the Sunsilk Tapestries shop on the Steps of Nald.","Other than a bizarre incident in which a complete stranger professed his undying love to her, Yellow Moon can recall nothing of note. Proceed to the Coliseum entrance next and see what the wealthy woman remembers.","Other than yet another incident in which a complete stranger professed his undying love to her, Yellow Moon states that nothing out of the ordinary occurred. However, her testimony serves to spark something within Inspector Hildibrand, who demands to be left alone whilst he marshals his mental faculties. Respect his wishes and instead speak with Nashu, who appears to be contemplating the three large crates nearby.","Nashu is overcome with an unbearable desire to learn the contents of the crates. Unable to discern a simple means of opening them, she proposes destroying them with makeshift explosives of her own design, and even offers to let you do the honors. Though such a reckless and dangerous act is wholly unjustified, she will almost certainly take matters into her own hands if you refuse...","Naught remains of the crates save for their contents: three sweltering, terrified men wearing yellow robes, and Yellow Moon's Pure Heart. It would be prudent to bring this to Inspector Hildibrand's attention.","The three men assert that they have followed Yellow Moon only out of a desire to keep her safe, and that the numerous items they stole were instead being kept for safekeeping. This explanation fails to satisfy the enraged woman, who attempts to seize the deviants as they flee for their lives. Inspector Hildibrand congratulates himself on a job well done, and begins to explain how the three men were also responsible for the weapon thefts─only to be corrected by Ellie, a reporter for the <span class=\"emphasis\">Mythril Eye</span>, who reminds Inspector Hildibrand that the thief was also a duelist who defeated his victims in single combat. The reporter then offers to divulge the identity of one such victim, for which the inspector is tremendously grateful. However, as before, he neglects to linger long enough to receive the promised information, leaving you alone with Ellie and her exasperation."],"objectives":["Speak with Yellow Moon at the Weavers' Guild.","Speak with Hildibrand on the Steps of Nald.","Speak with Hildibrand.","Speak with Nashu Mhakaracca.","Destroy the suspicious crates with Nashu's Delight.","Speak with Hildibrand."],"dialogue":[{"name":"WYMOND","text":"Well, <span class=\"highlight\">Forename</span>, you might as well go after him. He'll be disappointed if you don't."},{"name":"WYMOND","text":"The lady in question is named Yellow Moon. She's a woman with a taste for the finer things in life. Safe to say you'll find her gettin' fitted for somethin' in the Weavers' Guild most every day. Good luck with the inspectin', Inspector."},{"name":"YELLOWMOON","text":"My beloved Pure Heart was unlike any wand you've ever seen! Elegant, refined─the perfect accessory for any cultured woman. You will bring it back to me, won't you?"},{"name":"HILDIBRAND","text":"A priceless possession, callously ripped from the hands of its owner..."},{"name":"HILDIBRAND","text":"The lady weeps, and the wind bears her sorrow to his ears. What gentleman could hear this clarion call and not beg the honor of championing her cause?"},{"name":"YELLOWMOON","text":"Wh-What in the world...?"},{"name":"HILDIBRAND","text":"I swear to you, here and now: I, Hildibrand, agent of enquiry, inspector extraordinaire, shall scour all creation─from the deepest pit of the seven hells to the very pinnacle of the heavens─for your Pure Heart!"},{"name":"NASHUMHAKARACCA","text":"What he said!"},{"name":"HILDIBRAND","text":"And you, my fellow servant of justice! I see your instincts are not to be underestimated, having guided you to this fair maiden's side."},{"name":"HILDIBRAND","text":"Now then, Miss Moon─what can you tell us of the theft?"},{"name":"YELLOWMOON","text":"<span class=\"emphasis\">Thefts</span>, sir, to be precise. My Pure Heart was only the most recent item to be taken from me."},{"name":"YELLOWMOON","text":"I─ &lt;sniffle&gt; I'm certain I had it when I left home the other day. After I browsed the latest fashions at Sunsilk and took in a match at the Coliseum, I realized it was gone..."},{"name":"HILDIBRAND","text":"So the time and location of the theft are unknown─essential details, without which we cannot solve the case. There is but one logical course of action, Miss Moon: to coax the hidden clues from your memories, we must reenact that fateful day's excursion. To Sunsilk Tapestries!"},{"name":"YELLOWMOON","text":"&lt;sniffle&gt; &lt;sob&gt; What monster would steal my Pure Heart..."},{"name":"YELLOWMOON","text":"Oh, I don't know... Are you sure this is going to help?"},{"name":"HILDIBRAND","text":"Miss Moon, would you be so kind as to describe your visit in detail on the day in question?"},{"name":"YELLOWMOON","text":"Nothing unusual happened, but if you insist... I was pondering whether or not to purchase a new dress, when a man approached me and confessed his undying love."},{"name":"YELLOWMOON","text":"What sort of man says that to a complete stranger, I ask you? Naturally, I was taken aback. I dropped my purse─in shock, not intentionally─on his foot, and he cried out in pain and fled."},{"name":"HILDIBRAND","text":"If I may be so bold, Miss Moon, that strikes me as a most unusual happening!"},{"name":"HILDIBRAND","text":"In any case, it appears to be completely unrelated to the theft. Let us next proceed to the Coliseum and see what you remember."},{"name":"YELLOWMOON","text":"Where─ &lt;sniffle&gt; &lt;sob&gt; Where could my Pure Heart be?"},{"name":"BOX","text":"(-Conspicuous Crates-)..."},{"name":"NASHUMHAKARACCA","text":"Hmmm... That crate's looking at me funny."},{"name":"HILDIBRAND","text":"Once again, Miss Moon, if you would be so kind as to tell us what you remember..."},{"name":"YELLOWMOON","text":"Well, like before, nothing unusual happened. I felt like gambling that day and was debating which match to observe, when a gladiator approached me from behind and confessed his undying love."},{"name":"YELLOWMOON","text":"Naturally, I was taken aback. I whirled about and struck the man in the face with my purse─in shock, not intentionally. Unfortunately, since I was carrying a tremendous sum of money, my purse weighed about six score ponzes, and the blow was enough to render him unconscious."},{"name":"HILDIBRAND","text":"One hundred and twenty ponzes!? Miss Moon, you are a remarkably strong woman!"},{"name":"HILDIBRAND","text":"...Which is precisely why you were targeted! Oh, it's so obvious in hindsight. The thief bore you a grudge─ No, it's more than that─he <span class=\"emphasis\">hated</span> you with a <span class=\"emphasis\">passion</span>..."},{"name":"NASHUMHAKARACCA","text":"There sure are a lot of giant crates in Ul'dah. At the Weavers' Guild, at Sunsilk Tapestries, and here too..."},{"name":"HILDIBRAND","text":"Stand back! I am on the verge of unraveling this mystery! I must be allowed to focus!"},{"name":"NASHUMHAKARACCA","text":"These crates are everywhere, <span class=\"highlight\">Forename</span>. I wonder what's inside? But I don't see how we can open─"},{"name":"NASHUMHAKARACCA","text":"Ah, of course! I still have plenty of explosives. Here, why don't you try? It'll be fun!"},{"name":"NASHUMHAKARACCA","text":"What's in the crates? What's in the crates!? I can't wait to find out!"},{"name":"SHINEI","text":"&lt;groan&gt; Oh gods, have mercy!"},{"name":"NASHUMHAKARACCA","text":"Wow, there were people in there!? I guess that explains the breathing and─ &lt;gasp&gt; Isn't that Yellow Moon's Pure Heart!? Inspector! Oh, Inspector─look!"},{"name":"HILDIBRAND","text":"At the heart of every crime rests a single, unassailable truth, reached only by navigating a web of falsehoods and contradictions."},{"name":"HILDIBRAND","text":"Hearken to me now, for as a shepherd leads his flock, I shall guide you to my irrefutable conclusion!"},{"name":"HILDIBRAND","text":"A gladiator professes his feelings only to be rejected and physically assaulted in response, wounding his pride as a warrior and man. Resenting her prowess whilst recognizing his weakness, he carries out a more feasible vengeance: he robs Yellow Moon of her weapon, the Pure Heart!"},{"name":"NASHUMHAKARACCA","text":"Inspector, we found the Pure Heart! These strange men sneaking around town in wooden crates had it."},{"name":"SHINEI","text":"It's not what you think! W-We're not thieves─we're <span class=\"emphasis\">devotees</span>!"},{"name":"SHINEI","text":"Yellow Moon is our sun and stars─we only wished to keep her safe from harm! And...should she misplace an item from time to time, we'd collect it─for safekeeping, nothing untoward!"},{"name":"YELLOWMOON","text":"You deviants were behind all the thefts! All this time, you've been stalking me! What...what <span class=\"emphasis\">nerve</span>!"},{"name":"SHINEI","text":"Ah! Such unbridled fury, such righteous indignation! We should be glad to accept the goddess's punishment!"},{"name":"HILDIBRAND","text":"Goddess...? Devotees...? Aaah! B-But of course! That I had you inspect those crates was a stroke of genius indeed!"},{"name":"HILDIBRAND","text":"As I was elucidating but a moment ago, those fiends are obviously the ones responsible for the recent rash of weapon thefts, as─"},{"name":"ELLIE","text":"(-???-)Those thefts were carried out by a single individual, you imbecile."},{"name":"ELLIE","text":"(-Well-informed Woman-)Lest you've forgotten, the culprit is a <span class=\"emphasis\">duelist</span>─he only claims his victims' weapons after defeating them in single combat. If your powers of observation are as great as you claim, you should have deduced that those buffoons in boxes were incapable of such."},{"name":"ELLIE","text":"I should know─I'm a reporter for the <span class=\"emphasis\">Mythril Eye</span>. My name is Ellie, and I've been investigating these incidents for weeks."},{"name":"ELLIE","text":"Inspector Hildibrand, gentleman investigator and agent of enquiry, I presume? You're looking well for a dead man."},{"name":"ELLIE","text":"Would you like to meet one of the duelist's victims? I'll introduce you, with pleasure."},{"name":"HILDIBRAND","text":"You would be willing to share such precious information with me? Your generosity is commendable, Miss Ellie! May this mark the beginning of a long and beautiful friendship!"},{"name":"ELLIE","text":"Yes, yes, very good. The name of the man is─"},{"name":"ELLIE","text":"Huh? Wh-Where in the bloody hells do you think you're going!? I haven't told you anything yet!"}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66741]},"next":[66743]},"partials":[{"type":"npc","id":"1001285","obj":{"i":1001285,"n":"Wymond","l":40,"q":8}},{"type":"npc","id":"1005716","obj":{"i":1005716,"n":"Hildibrand","l":40,"q":1}},{"type":"npc","id":"1001691","obj":{"i":1001691,"n":"Yellow Moon","l":41,"q":4}},{"type":"npc","id":"1005712","obj":{"i":1005712,"n":"Yellow Moon","l":40,"q":1}},{"type":"npc","id":"1005713","obj":{"i":1005713,"n":"Hildibrand","l":40,"q":1}},{"type":"npc","id":"1005715","obj":{"i":1005715,"n":"Yellow Moon","l":40,"q":1}},{"type":"npc","id":"1005717","obj":{"i":1005717,"n":"Nashu Mhakaracca","l":40,"q":1}},{"type":"npc","id":"1005718","obj":{"i":1005718,"n":"Perspiring Man","l":40,"q":1}},{"type":"quest","id":"66741","obj":{"i":66741,"n":"Back in the Saddle","g":68,"l":"Southern Thanalan","s":2,"f":1}},{"type":"quest","id":"66743","obj":{"i":66743,"n":"The Immaculate Deception","g":68,"l":"Ul'dah","s":4,"f":1}}]}