{"quest":{"name":"Back in the Saddle","location":"Southern Thanalan","id":66741,"patch":2.1,"sort":2,"unlocksFunction":1,"eventIcon":71341,"issuer":1005711,"target":1001285,"involved":[1001313,1004331,1004333,1005710],"genre":68,"journal":["A mild concussion will not sway Inspector Hildibrand from his true calling.","Eager to resume his activities as an agent of enquiry, Inspector Hildibrand departs for Ul'dah in search of a new case. Though you would be entirely justified in leaving him to his own devices, it would be understandable if curiosity compelled you to do otherwise. Consider questioning the residents of Ul'dah for any information regarding the inspector's activities or recent incidents which may draw his attention.","Although Inspector Hildibrand has been sighted in the city, the more popular topic of discussion in recent days is a marauding duelist who claims the weapons of his defeated opponents. Having exhausted free sources of information, go and see what Wymond will be willing to part with for a price.","Your conversation with the consummate businessman is interrupted by the arrival of Inspector Hildibrand and Nashu. After recovering from the shock of seeing the man he thought dead alive, Wymond presses the inspector to explain his inconceivable resurrection. Brushing aside his inquiries, Inspector Hildibrand proclaims his desire to catch the thieving duelist, persuading Wymond to part with information regarding an incident which may be related. However, before Wymond can divulge the name of the victim, Inspector Hildibrand and his assistant abruptly depart, leaving you alone with Wymond and his exasperation."],"objectives":["Question the residents of Ul'dah on the Steps of Nald.","Speak with Wymond."],"dialogue":[{"name":"NASHUMHAKARACCA","text":"Amazing, isn't it? He wasn't dead─he was just badly injured, and needed to hibernate! I didn't even know people could do that!"},{"name":"HILDIBRAND","text":"Verily, it could be naught else. Somewhere nearby dastardly doings are afoot, and only I can thwart them!"},{"name":"HILDIBRAND","text":"Copious quantities of sand, unbearable heat... Ah hah! The Sagolii Desert─I'd bet my life on it."},{"name":"HILDIBRAND","text":"Which means Ul'dah is but a short trek away. Yes, it all fits. Only that den of iniquity could so violently trigger my keen investigator's sense."},{"name":"HILDIBRAND","text":"Fear not, law-abiding citizens! Inspector Hildibrand shall soon deliver you from evil!"},{"name":"NASHUMHAKARACCA","text":"Which way did he go, <span class=\"highlight\">Forename</span>!? Did you see? Oh dear, I've got to find him. Ah! And change my outfit too!"},{"name":"SILVERNETTLE","text":"What? Yer lookin' for a half-naked Highlander what likes to catch criminals? I think I'd remember a thing like that!"},{"name":"SILVERNETTLE","text":"If ye do manage to find this inspector friend of yers, tell him to do somethin' 'bout that godsdamned duelist! Me mate's pa's cousin's kid's best friend lost his blade the other day to that bastard!"},{"name":"BOTULF","text":"Hmmm... Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, but if it's information you want, you'd be served best by going to Wymond."},{"name":"BOTULF","text":"The only rumors I've heard are those about the weapon thief. Calls himself a duelist, or so I hear, but when you don't allow your opponents to refuse, well..."},{"name":"AGNYS","text":"Beg your pardon? You wish to question <span class=\"emphasis\">me</span> as to the whereabouts of that deviant running about town dressed in rags?"},{"name":"AGNYS","text":"Do I look like a reporter for the <span class=\"emphasis\">Mythril Eye</span>? I do <span class=\"emphasis\">not</span> consort with perverts!"},{"name":"WYMOND","text":"I take it you've dealt with that zombie problem, eh? So, do tell: just why were they dressin' up like dandies?"},{"name":"HILDIBRAND","text":"Wymond! HEY, WYMOND!"},{"name":"WYMOND","text":"Thal almighty bugger me with a bleedin' spear! The dead've risen, an' they're walkin' the streets of Ul'dah!"},{"name":"HILDIBRAND","text":"No need for melodrama, my good man! As you can see, reports of my death were greatly exaggerated."},{"name":"NASHUMHAKARACCA","text":"It's true─he's not a zombie. I checked."},{"name":"WYMOND","text":"...Aye, you do seem to be hale an' healthy. Which, uh, begs the question: how in the seven hells did you survive that fall!?"},{"name":"HILDIBRAND","text":"Why question divine providence? What matters is that Eorzea's champion has returned, and that he─and by that I mean <span class=\"emphasis\">I</span>─shall bring this thieving duelist to justice!"},{"name":"WYMOND","text":"Heard about that, did you? Might be harder than you think. Even I've got no inklin' of that fellow's current whereabouts."},{"name":"HILDIBRAND","text":"Inconceivable! I refuse to believe that the ever-inquisitive, ever-ambitious, ever-reliable Wymond is without a single shred of information─even one of dubious relevance."},{"name":"WYMOND","text":"Hmmm, well... I make no promises, mind you, but there was some talk of a fair maiden what said her most─"},{"name":"HILDIBRAND","text":"This knave assaulted a young woman as well!? The audacity! I should fly to her side at─"},{"name":"HILDIBRAND","text":"&lt;gasp&gt; Why, if it isn't the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> from the Sagolii!"},{"name":"HILDIBRAND","text":"A serendipitous encounter indeed! Unless...you too seek the belligerent duelist?"},{"name":"HILDIBRAND","text":"Capital! It will be invigorating to engage in a friendly battle of wits. Already the spirit of competition fills me. Come, Nashu! We must away!"},{"name":"WYMOND","text":"Dammit, Hildy─I ain't told you the lass's name yet..."}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66740]},"next":[66742]},"partials":[{"type":"npc","id":"1005711","obj":{"i":1005711,"n":"Hildibrand","l":45,"q":1}},{"type":"npc","id":"1001285","obj":{"i":1001285,"n":"Wymond","l":40,"q":8}},{"type":"npc","id":"1001313","obj":{"i":1001313,"n":"Botulf","l":40,"q":4}},{"type":"npc","id":"1004331","obj":{"i":1004331,"n":"Silver Nettle","l":40,"q":2}},{"type":"npc","id":"1004333","obj":{"i":1004333,"n":"Agnys","l":40,"q":1}},{"type":"npc","id":"1005710","obj":{"i":1005710,"n":"Nashu Mhakaracca","l":45,"q":2}},{"type":"quest","id":"66740","obj":{"i":66740,"n":"The Rise and Fall of Gentlemen","g":68,"l":"Ul'dah","s":1,"f":1}},{"type":"quest","id":"66742","obj":{"i":66742,"n":"After Her Own Heart","g":68,"l":"Ul'dah","s":3,"f":1}}]}