{"quest":{"name":"The Rise and Fall of Gentlemen","location":"Ul'dah","id":66740,"patch":2.1,"sort":1,"icon":100183,"unlocksFunction":1,"eventIcon":71341,"issuer":1001285,"target":1005710,"involved":[1005709],"genre":68,"journal":["An old acquaintance of Wymond is at wit's end, and the businessman would have you help her.","Nashu, former assistant of the late inspector Hildibrand, is investigating rumors regarding unusual zombie behavior. However, she has made little progress thus far, and so Wymond has asked you to seek her out and offer whatever assistance you can. Considering her recent frustrations, Wymond suspects that Nashu can be found praying at the grave of her mentor in Camp Drybone's lichyard.","After waiting five years for her mentor to return, Nashu was devastated by the revelation that Inspector Hildibrand did not survive his journey to Dalamud. She then swore to carry on his legacy as an inspector herself, but has struggled to live up to his example. Her current investigation into a horde of dapper zombies had reached a standstill; however, with your help, she believes she might finally locate the zombies' leader. Travel to southern Thanalan and attempt to befriend any dapper zombies you encounter, or─failing that─slay and search them for clues.","Your attempts to befriend the zombie populace met with dismal failure. However, your efforts were not for naught, as a curious parchment found in their possession appears to be a map of some sort. Return to the lichyard in eastern Thanalan and show the parchment to Nashu.","Nashu confirms your suspicions that the parchment is a map, though she is unable to determine the significance of the phrase, “A gentleman is, rather than does.” In any case, she bids you follow her to the Sagolii Desert in southern Thanalan, to the destination marked on the map.","Deducing that the phrase is a password, you call out to the dapper zombies, who surround you and Nashu with malicious intent. Fortunately, before you are forced to defend yourselves, a disheveled Inspector Hildibrand appears and commands his loyal minions to spare you and Nashu. The reunion between mentor and assistant nearly ends in tragedy, as Nashu resolves to restore Inspector Hildibrand's lost memories via liberal use of explosives. Inexplicably, her plan works. Afterwards, you use the power of the Echo to delve into Inspector Hildibrand's memories in a vain attempt to learn how he survived his fall, as well as being buried alive. Alas, you soon discover that there are mysteries in this world that defy all reason and explanation."],"objectives":["Speak with Nashu Mhakaracca at the lichyard in eastern Thanalan.","Participate in the FATE “Fallen Corpses Writhe in Style” in southern Thanalan.","Show the curious parchment to Nashu Mhakaracca.","Speak with Nashu Mhakaracca in the Sagolii Desert."],"dialogue":[{"name":"WYMOND","text":"I hear you've been busy as a bee, <span class=\"highlight\">Forename</span>. Seems half the whispers what come my way relate to your comin's an' goin's."},{"name":"WYMOND","text":"Bein' the active type you are, I reckon you'd be interested in investigatin' some queer rumors, am I right? But before that, let me ask: ever heard of a man named Hildibrand?"},{"name":"Q1","text":"Have you heard of Hildibrand before?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"WYMOND","text":"To hear him tell it, he was Eorzea's greatest an' most famous inspector. Still, can't say I'm surprised you don't know him."},{"name":"WYMOND","text":"To his credit, Hildibrand an' his assistant had a knack for showin' up when somethin' shady was afoot. As for sussin' out the culprits, well...he had his moments, though I hesitate to give him sole credit."},{"name":"WYMOND","text":"Anyroad, five years ago he gets it in his head that he's “cracked the code” of Mezaya's seventh verse. Dalamud, the Calamity─all of it can be stopped, he says, so long as he finds the hero of prophecy. An' wouldn't you know it─the hero was Hildibrand himself!"},{"name":"WYMOND","text":"So he flies off towards Dalamud. Aye, that's right: he <span class=\"emphasis\">flew</span>. Launches himself straight into the air somehow, ridiculous as it sounds. 'Course, it's only logical that he's got to come back <span class=\"emphasis\">down</span>─though it was only recently that we found his body."},{"name":"WYMOND","text":"Oi, you don't mean to say you <span class=\"emphasis\">knew</span> the bugger!? I know he thought himself famous, but thinkin' it don't make it true."},{"name":"WYMOND","text":"Shame that he had to go an' get himself killed. All that nonsense about stoppin' Dalamud himself─what in the seven hells was he thinkin'!?"},{"name":"WYMOND","text":"Least it was mercifully quick. Still, judgin' from the depth of the crater, he must've fallen from an unfathomable height."},{"name":"WYMOND","text":"Gods only know what was goin' through his mind as he watched the ground rush up to meet him... &lt;shudder&gt; "},{"name":"WYMOND","text":"Amazin' how well the body was preserved, though. Hells, it's amazin' there was a body left to bury at all!"},{"name":"WYMOND","text":"Hmmm... I had reason for bringin' this up... Ah, right. So Nashu, Hildibrand's erstwhile assistant, has since become an inspector in her own right. At present, she's investigatin' the queer rumors I mentioned earlier."},{"name":"WYMOND","text":"She's a sweet lass─a bit daft, but sweet nonetheless. So when I hear she's at wit's end, I want to help. Thing is, I prefer to meddle in the affairs of the <span class=\"emphasis\">livin'</span>─zombies are most definitely <span class=\"emphasis\">not</span> my forte."},{"name":"WYMOND","text":"So, if you're willin', I'd be grateful if you lent her a hand. As for where to find her, she's like to visit Hildibrand's grave in the lichyard when she's frustrated. Try lookin' for her there first."},{"name":"WYMOND","text":"How did <span class=\"emphasis\">I</span> know Hildibrand? Hah! Next you'll be askin' me how he was <span class=\"emphasis\">always</span> in the right place at the right time. You're too clever to be that daft."},{"name":"NASHUMHAKARACCA","text":"Oh, if only you were still alive, Inspector. You'd know how to stop these zombies..."},{"name":"NASHUMHAKARACCA","text":"Ah! You there! Could it be...?"},{"name":"NASHUMHAKARACCA","text":"You've come to offer your services to me!?"},{"name":"NASHUMHAKARACCA","text":"Oh, but where are my manners! Allow me to introduce myself. Ahem. My name is Nashu, agent of inquiries! Extraordinary inspector!"},{"name":"NASHUMHAKARACCA","text":"At least, that's what I'm trying to be. It's not quite as easy as he made it look..."},{"name":"NASHUMHAKARACCA","text":"Inspector Hildibrand was a great man─a real Eorzean hero!"},{"name":"NASHUMHAKARACCA","text":"We traveled the world, me and him, solving cases and thwarting evil! No matter the mystery, you could always count on the inspector to solve it with grace and style!"},{"name":"NASHUMHAKARACCA","text":"But then there was the final case. “The case of the century,” he called it─how to stop the red moon from destroying the world."},{"name":"NASHUMHAKARACCA","text":"To save us all, he flew into the sky, and all I could do was watch..."},{"name":"NASHUMHAKARACCA","text":"But then...then he came back down, and he...he..."},{"name":"NASHUMHAKARACCA","text":"This is all a joke─a big, funny joke. Right, Inspector? Any moment now, you'll burst out of the ground and shout, “Surprise! Had you fooled, eh?” And...and we'll laugh and laugh..."},{"name":"JIMAKU","text":"Hildibrand Manderville<br>Beloved Son"},{"name":"NASHUMHAKARACCA","text":"&lt;sniffle&gt; &lt;sob&gt; They say...they say no one remembers the Warriors of Light. Their names, their faces...all gone forever."},{"name":"NASHUMHAKARACCA","text":"But I remember you, Inspector─no, Gentleman Hero Hildibrand!"},{"name":"NASHUMHAKARACCA","text":"I can never be the hero you were, but I'll do my best to try!"},{"name":"NASHUMHAKARACCA","text":"I, Nashu, inspector extraordinaire, will carry on your legacy!"},{"name":"NASHUMHAKARACCA","text":"...So I told myself, well, Nashu, there must be a leader─a head zombie, who tells the rest what to do! Therefore, all we need to do is kill him─again, that is."},{"name":"NASHUMHAKARACCA","text":"Unfortunately, I don't know where he is, or how to find him. But now that you're here, my faithful assistant, you can try the one good idea I've come up with so far!"},{"name":"NASHUMHAKARACCA","text":"If you go to where these dapper zombies were last seen in southern Thanalan, you might find them! And then you could...um... Ah! You could become their friend and ask to meet their leader! Yes, that's sure to work!"},{"name":"NASHUMHAKARACCA","text":"I've never tried making friends with a zombie, but I don't see why it would be hard. Just moan, groan, and pretend to be dead."},{"name":"NASHUMHAKARACCA","text":"Did you find the zombies? You did!? That's wonderful! I've been busy, too─the head zombie will rue the day he meets me, you'll see. So, tell me: what did you learn?"},{"name":"NASHUMHAKARACCA","text":"Oh, so you weren't able to make new friends. That's a shame. But this parchment... This is a map of the Sagolii Desert. There's a spot marked here in the south, and look─there's something written here."},{"name":"NASHUMHAKARACCA","text":"“A gentleman is, rather than does.”"},{"name":"NASHUMHAKARACCA","text":"That sort of reminds me of...um... Well, no matter─let's see where this map takes us, assistant! Onward, to the Sagolii!"},{"name":"NASHUMHAKARACCA","text":"I don't think I misread the map... Maybe they're just shy, though. I say we call out to them and let them know we come in peace─and when the leader shows himself, we strike!"},{"name":"Q2","text":"What will you call out?"},{"name":"Q2A1","text":"I will go whither the <span class=\"emphasis\">wild rose</span> blooms!"},{"name":"Q2A2","text":"A gentleman is, rather than does!"},{"name":"Q2A3","text":"Show yourselves, foul fiends!"},{"name":"Q2A4","text":"Nothing."},{"name":"NASHUMHAKARACCA","text":"Hmmm... That didn't seem to work. Maybe you should try shouting something else?"},{"name":"ZOMBIEA","text":"Urrrgggh... Hurrrggghhh...! Who summons the Gentle Dead Men?"},{"name":"ZOMBIEB","text":"They live, they <span class=\"emphasis\">live</span>! And we...we hunger..."},{"name":"HILDIBRAND","text":"(-???-)My brothers, lend me your ears! A gentleman does not dine upon his guests!"},{"name":"HILDIBRAND","text":"(-Well-spoken Zombie-)Spare <span class=\"alternative-container\"><span class=\"alternative\">these two fair ladies</span><span class=\"alternative\">this fine gentleman and fair lady</span></span> your mastications. Withdraw, I say, and harass them no more!"},{"name":"NASHUMHAKARACCA","text":"Up in the sky, look! It's a bird─ No, it's an airship─ <span class=\"emphasis\">No</span>! It's the <span class=\"emphasis\">inspector</span>!"},{"name":"ZOMBIEA","text":"(-Gentle Dead Men-)We hear, and we obey!"},{"name":"NASHUMHAKARACCA","text":"It <span class=\"emphasis\">is</span> you, it really is you! I knew nothing could kill the great inspector Hildibrand!"},{"name":"HILDIBRAND","text":"(-Zombibrand-)Hildibrand? Who is this Hildibrand of whom you speak? My name is Zombibrand, devourer of brains! Undead overlord extraordinaire!"},{"name":"NASHUMHAKARACCA","text":"What are you saying!? You're not an undead overlord─you're a gentleman inspector!"},{"name":"HILDIBRAND","text":"(-Zombibrand-)Urrrgggh... Hurrrggghhh...! Inspector... Overlord... Inspector... Overlord..."},{"name":"NASHUMHAKARACCA","text":"Oh, Inspector, you're just confused is all. Don't worry─I'll knock some sense back into that noggin of yours!"},{"name":"HILDIBRAND","text":"(-Zombibrand-)St-Stay your hand, m'lady. You know not what you do..."},{"name":"HILDIBRAND","text":"(-Zombibrand-)Even if I were the esteemed gentleman you purport me to be, the concussive force of the blast is more like to liquefy my─"},{"name":"NASHUMHAKARACCA","text":"If crashing into the ground made you forget, then an explosion of equal force ought to make you remember! I'll save you, Inspector─or kill you trying!"},{"name":"HILDIBRAND","text":"(-Zombibrand-)See!? Even you acknowledge the possibility that this plan will result in my─"},{"name":"HILDIBRAND","text":"(-Zombibrand-)Death..."},{"name":"HILDIBRAND","text":"(-Perturbed Gentleman-)Normally I would applaud your ingenuity, Nashu, but I would have preferred that you found a more elegant solution!"},{"name":"NASHUMHAKARACCA","text":"Ah! He remembers me! Inspector Hildibrand remembers me!"},{"name":"HILDIBRAND","text":"Yes, yes, I remember you, my faithful assistant. What I do not quite remember is how I came to be here..."},{"name":"HILDIBRAND","text":"Ahhh! Such a wonderful dream. I slew a dragon, and─"},{"name":"HILDIBRAND","text":"Hm? What is this place? And for that matter...who am I?"},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, have awoken at last!"},{"name":"NASHUMHAKARACCA","text":"I─ &lt;sniffle&gt; &lt;sob&gt; I always knew you'd come back to us!"},{"name":"HILDIBRAND","text":"Be it red moon or black dragon, no fiend is a match for my legendary might!"},{"name":"HILDIBRAND","text":"And who might this fine <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> be? Hmmm, could <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> perhaps be one of my many admire─"},{"name":"HILDIBRAND","text":"Oh, but what is this faint tingling sensation in my arm!? This ringing in my ears, this dizziness... Could it be...a case?"}],"reward":{"gil":658,"items":[{"id":4570}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[65776,66741]},"partials":[{"type":"npc","id":"1001285","obj":{"i":1001285,"n":"Wymond","l":40,"q":8}},{"type":"npc","id":"1005710","obj":{"i":1005710,"n":"Nashu Mhakaracca","l":45,"q":2}},{"type":"npc","id":"1005709","obj":{"i":1005709,"n":"Nashu Mhakaracca","l":44,"q":1}},{"type":"item","id":"4570","obj":{"i":4570,"n":"Phoenix Down","l":50,"c":20650,"t":44}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"65776","obj":{"i":65776,"n":"Blues on Emerald Avenue","g":77,"l":"Limsa Lominsa","s":22}},{"type":"quest","id":"66741","obj":{"i":66741,"n":"Back in the Saddle","g":68,"l":"Southern Thanalan","s":2,"f":1}}]}