{"quest":{"name":"Sirius Business","location":"Western La Noscea","id":66744,"patch":2.1,"sort":500,"icon":100185,"unlocksFunction":1,"eventIcon":71341,"issuer":1005525,"target":1006503,"involved":[1005398],"genre":91,"journal":["Diamanda's hands are idle, though by no fault of her own.","The smith Diamanda has been dispatched to Pharos Sirius to assist in the restoration effort, only to find the lighthouse infested by a siren and her fell minions. Seek further information about this troubling turn of events from the foreman Mimidoa, who bides his time in Aleport.","Master Mimidoa confirms the dire tidings and implores you to silence the siren's song, that he and his apprentice may get on with their work. Make for Pharos Sirius and speak with Davyd, a guard posted outside.","Heartened by your arrival, Davyd advises you to enter Pharos Sirius via the flood cellar so as to catch your foe off guard. Rid the lighthouse of the siren and her thralls so that the restoration effort might commence in earnest.<br><br>※Pharos Sirius can be accessed via the Duty Finder."],"objectives":["Speak with Mimidoa.","Speak with Davyd at Pharos Sirius."],"dialogue":[{"name":"DIAMANDA","text":"My first genuine assignment under Master Mimidoa, and now <span class=\"emphasis\">this</span>! Whatever did I do to deserve such a fate?"},{"name":"DIAMANDA","text":"Oh, but where are my manners? I am Diamanda, a smith recently in the employ of Naldiq & Vymelli's. I arrived in these parts not a few days past to assist in the restoration of Pharos Sirius."},{"name":"DIAMANDA","text":"Little did I expect my arrival to be greeted by that godsforsaken song. A song I thought confined to my worst nightmares─yes, I speak of the grim serenade of the foul sea witch that lured my poor father into a watery demise so many years ago."},{"name":"DIAMANDA","text":"So I stand here with idle hands. Powerless to avenge his death, powerless to repay my debt to Master Mimidoa─once my father's mentor as he now is mine. The agony of it all! If only my brother were here, he would see to it that..."},{"name":"DIAMANDA","text":"...But alas, my brother remains lost at sea. You are an adventurer, are you not? Perhaps if <span class=\"emphasis\">you</span> were to defeat the siren..."},{"name":"DIAMANDA","text":"Yes, you must! If not for me, then for all the sailors who seek safe passage across threatening seas. Seek out Master Mimidoa at the pier─you'll find him gazing grimly in the direction of Pharos Sirius, lamenting our fate."},{"name":"MIMIDOA","text":"Eh? 'Nother 'nitiate, are ye? ...No? Huh. Ain't no one says “yes” to that. Ye've a familiar face, though. Come to think of it, ye bear a strikin' resemblance to a brave <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">lad</span></span> I once met. Helped us chase one of those godsdamned sirens from Pharos Sirius, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did."},{"name":"MIMIDOA","text":"What's that, ye say!? Speak up, <span class=\"alternative-container\"><span class=\"alternative\">missy</span><span class=\"alternative\">son</span></span>, years o' hammerin' have taken their toll on my ears. Anyroad, ye may not be half the <span class=\"alternative-container\"><span class=\"alternative\">heroine</span><span class=\"alternative\">hero</span></span> yer predecessor was, but ye know the sayin'─any port in a storm."},{"name":"MIMIDOA","text":"Aye, that's right, damned if I can tell ye why, but that hells-born hussy is back, and she's runnin' roughshod o'er the place with a crew of her song-snared flunkies. Me an' Diamanda, we've naught to do but sit on our arses till someone cleans the place out."},{"name":"MIMIDOA","text":"Look, this is more than a reclamation project to me an' the lass. That scurvy witch killed her father─one o' me prized students. I swore a vow to meself to do his name proud an' restore the beacon, but these hands were made for hammerin', not scufflin' with sirens."},{"name":"MIMIDOA","text":"What say ye follow in yer forebear's footsteps and fight this one for ol' Mimidoa? I'll send word to Davyd, the guard at the lighthouse. He'll tell ye all ye need to know."},{"name":"MIMIDOA","text":"Each day that siren's left to roost in Pharos Sirius is another day me hands go idle an' the beacon grows dim. Godsspeed, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">lad</span></span>─promise me ye'll gut the wench good."},{"name":"DAVYDA","text":"Ah, adventurer─you've come not a moment too soon. The siren has holed herself up in the lantern chamber atop the structure."},{"name":"DAVYDA","text":"The most direct route would be through the front door, but I fear the siren is already wise to our intentions, and has posted the most formidable of her thralls to guard the entrance. Our only hope to breach our foe's defenses is to attack from below, through the flood cellar."},{"name":"DAVYDA","text":"If you cannot win this battle for us, I know not who can. Go forth, friend, that Pharos Sirius may shine bright anew!"}],"reward":{"gil":939,"instance":17,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[66745]},"partials":[{"type":"npc","id":"1005525","obj":{"i":1005525,"n":"Diamanda","l":33,"q":2}},{"type":"npc","id":"1006503","obj":{"i":1006503,"n":"Davyd","l":33,"q":4}},{"type":"npc","id":"1005398","obj":{"i":1005398,"n":"Mimidoa","l":33,"q":2}},{"type":"instance","id":"17","obj":{"i":17,"n":"Pharos Sirius","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":48,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"66745","obj":{"i":66745,"n":"Why So Sirius","g":91,"l":"Western La Noscea","s":500,"f":1}}]}