{"quest":{"name":"The Immaculate Deception","location":"Ul'dah","id":66743,"patch":2.1,"sort":4,"icon":100184,"unlocksFunction":1,"eventIcon":71341,"issuer":1005721,"target":1005731,"involved":[1003939,1003940,1004042,1005722,1005723,1005724,1005725,1005727,1005730],"genre":68,"journal":["Having no other recourse, Ellie would instead tell you the identity of the victim.","Judging you to be a friend of Inspector Hildibrand, Ellie elects to share the identity of the weapon thief's victim with you. She mentions in passing that the man is also guilty of a crime, though she does not say what─only that she is curious how the inspector will act when he learns of this fact. For now, seek out the adventurer named Humphrey at the Golden Bazaar, and pray that Inspector Hildibrand somehow finds his way to you.","As usual, Inspector Hildibrand and Nashu arrive at the precise moment you locate Humphrey. To everyone's surprise, the self-proclaimed Warrior of Light claims to have defeated the duelist. His story is quickly disproven by an elderly man named Eleazar, who accuses Humphrey of surrendering an ancient sword he had been asked to deliver to a blacksmith for restoration. His bravado dispelled, Humphrey confesses to the crime and begs the assistance of Inspector Hildibrand. Although Ellie implores him to ignore the boy's pleas, the inspector agrees to help for Eleazar's sake. Assist Inspector Hildibrand by speaking with the residents of the Golden Bazaar.","During the course of your investigation, you learn that Eleazar's sword was an authentic relic, and that many collectors have been fooled by well-crafted imitations. Such a rare weapon would be coveted by many, and it may have been sold for profit. Speak with Jojonpa the traveling merchant to see if he has seen or heard of the blade in question.","Although Jojonpa has no knowledge of an ancient sword, he may have recently disposed of an imitation similar in design to Eleazar's treasured blade. Though it pains him to do so, Inspector Hildibrand proposes furnishing Eleazar with this counterfeit weapon for the time being, so that the elderly man might rest easy while the inspector continues to search for the genuine article. Travel to the spring east of Camp Drybone and ask Hildibrand how you might assist with the search for Jojonpa's discarded sword.","Inspector Hildibrand is hesitant to enter the spring due to his accumulated injuries, which he fears may become infected unless first treated with salamander oil. Fortunately, he has an ample supply of the oil; unfortunately, he cannot apply it himself. Pour the salamander oil on Inspector Hildibrand, and remember that generosity is a virtue.","You may as well finish what you started. Knead the oil into Inspector Hildibrand's weary flesh. This too is a virtue, though one less well defined.","You forget your own strength, and bring the inspector to his knees in agony. Resume your duties with greater care.","Inspector Hildibrand is responding to your ministrations in unexpected ways. Dwell not on his words and press onward, harder and faster.","Keep going. You know what to do.","A sublime golden glow now radiates from the body of Inspector Hildibrand, who fearlessly strides into the spring to search for the sword. Contribute to the effort by collecting anything of marginal interest.","You have gathered three random items which are clearly <span class=\"emphasis\">not</span> the sword you seek. Nevertheless, they should serve as proof of your efforts to Inspector Hildibrand.","The imitation sword is finally discovered by Nashu, who trips over the blade during her search. Inspector Hildibrand begins to congratulate himself on a job well done, only to interrupt himself with a mighty sneeze. Observing that the inspector is in dire need of new clothes, Nashu departs for Ul'dah to purchase garments for Inspector Hildibrand, as well as a supply of hair tonic for Eleazar. With sword in hand, the inspector returns to the Golden Bazaar, bidding you to follow.","Inspector Hildibrand's deception proves flawless, as Eleazar declares the sword to be exactly as he remembers. Mere moments after the inspector presents the imitation blade to the elderly man, Nashu arrives bearing clothes for Inspector Hildibrand and a supply of hair tonic for Eleazar. The matters at hand seemingly resolved, you begin to relax─only to whirl about in time to dodge a flying card, which embeds itself in the inspector's forehead. Upon the card is writ a challenge from the duelist: “I shall come to claim the collector's blade.” Inspector Hildibrand accepts, of course, with requisite grace and style, evoking a variety of reactions from all present. The self-proclaimed agent of enquiry will doubtless do his utmost to catch the duelist, but whether or not he will succeed is another question entirely..."],"objectives":["Speak with Humphrey outside the Golden Bazaar.","Question the people of the Golden Bazaar.","Speak with Jojonpa.","Speak with Hildibrand.","Use the salamander oil on Hildibrand.","Massage Hildibrand.","Massage Hildibrand again.","Massage Hildibrand yet again.","Massage Hildibrand once more.","Search the spring for anything of interest.","Present your findings to Hildibrand.","Report to Eleazar."],"dialogue":[{"name":"ELLIE","text":"&lt;sigh&gt; I suppose since you're the imbecile's friend, you intend to help him."},{"name":"ELLIE","text":"The man you want to find is an adventurer named Humphrey. At present, he can be found at the Golden Bazaar."},{"name":"ELLIE","text":"With luck, the good inspector may find his way there by the time you arrive. If not, then so be it."},{"name":"ELLIE","text":"Hah hah... I wonder what will happen when he discovers that the victim is a perpetrator as well?"},{"name":"ELLIE","text":"I look forward to seeing how the good inspector chooses to handle this case."},{"name":"HUMPHREY","text":"Aye, I'm Humphrey. And you are?"},{"name":"HILDIBRAND","text":"&lt;huff&gt; &lt;puff&gt; At last, I've caught up with you! You there, young sir─I am told you are a victim of the marauding duelist?"},{"name":"HUMPHREY","text":"Me? A victim? Hah hah hah, how amusing─you <span class=\"emphasis\">amuse</span> me! True, I was challenged by the duelist not long ago. But where he thought to find a whelp..."},{"name":"HUMPHREY","text":"He found a Warrior of Light instead! Aye, I defended my honor and my blade─see for yourself!"},{"name":"NASHUMHAKARACCA","text":"You mean you won!? That's amazing!"},{"name":"HUMPHREY","text":"Heh, well, it was nothing compared to what I faced at Carteneau! Magitek to the right of us, magitek to the left of us! Stuck in the middle with Master Lou, we were. Cor, he was a dab hand with the old magic, he was! I tried to save him, of course, but there's a limit to how many giant beasties a man can─"},{"name":"ELLIE","text":"That man is no Warrior of Light!"},{"name":"ELLIE","text":"Tell them, Eleazar! Tell them how he lost and surrendered a sword that was not his own!"},{"name":"ELEAZAR","text":"Liar! Scoundrel! I trusted that bastard with me father's blade, bid him take it to a smitty for restoration─even gave him gil to pay for it! Then he comes crawlin' back snivelin' an' beggin' forgiveness for losin' it in a duel! As if that's enough to set things right!"},{"name":"ELEAZAR","text":"Look at me, ye bleedin' whoreson─<span class=\"emphasis\">look at me</span>! Me flowin' golden locks are no more! I've gone bald from the stress an' heartbreak..."},{"name":"ELEAZAR","text":"I swear to everythin' holy that you'll face a reckonin' if ye don't bring her back to me!"},{"name":"HUMPHREY","text":"All right, all right! He beat the shite out of me and took the old man's sword. I used the gil to pay the chirurgeon. I have no idea where he or the sword is."},{"name":"HUMPHREY","text":"What am I supposed to do, huh? I can't give him what I don't have! Unless... Unless <span class=\"emphasis\">you</span> help me find the sword! That's what you do, right? Help people?"},{"name":"ELLIE","text":"Have you no shame!? First you claim a legacy not your own, then you beg others to help you with problems of your own making! You <span class=\"emphasis\">will</span> refuse this man, won't you, Inspector?"},{"name":"HILDIBRAND","text":"...And what of Eleazar's flowing golden locks? How will forsaking young Humphrey help the man he has wronged?"},{"name":"HILDIBRAND","text":"We shall begin our search for the sword by questioning the people of the Golden Bazaar!"},{"name":"ELLIE","text":"That blade was a rare and ancient relic. He can't possibly think he'll recover it so easily..."},{"name":"HUMPHREY","text":"Do all inspectors dress like that? I've never met one before, so I don't know what to expect."},{"name":"HILDIBRAND","text":"Yet what drives this man to always claim his opponent's weapon? Pride? No, it must be deeper than that..."},{"name":"ELEAZAR","text":"Damn it all to the seventh hell! Someone, anyone─find me father's sword! An' bring me some snurble tonic too, while yer at it!"},{"name":"BENEGER","text":"Eleazar's sword? Wasn't much to look at, but at least it was authentic. More than a few collectors have been tricked into purchasing counterfeit relics."},{"name":"LULULO","text":"That boy should be ashamed of himself! Robbing poor Eleazar of a priceless family heirloom... Just goes to show you should <span class=\"emphasis\">never</span> trust an adventurer who claims to be a Warrior of Light. Thieves and tricksters, the lot of them."},{"name":"LULULO","text":"&lt;sigh&gt; It may not be the most honorable solution, but mayhap you should consider giving Eleazar a counterfeit blade. If the deception brings him peace in his final days, would it be so wrong?"},{"name":"AEBBE","text":"Antique swords? Oh, I haven't the foggiest about that. That traveling merchant Jojonpa is the one you ought to speak with─assuming he hasn't left."},{"name":"JOJONPA","text":"I'm afraid I have no knowledge of an ancient sword─at least, not of one I can guarantee to be authentic."},{"name":"JOJONPA","text":"You see, any wares I determine to be of dubious origins I immediately discard in the spring east of Camp Drybone. Although I have no swords for sale at present, I may have disposed of a facsimile similar in design to the one you describe."},{"name":"HILDIBRAND","text":"This presents a quandary. Though I am loath to deceive an honorable man like Eleazar, a well-intentioned ruse may put his heart at ease, thus spurring the rejuvenation of his flowing golden locks, whilst we continue to search for the genuine article."},{"name":"ELLIE","text":"Well, if there is a sword in that spring, it won't remain there for long. It's one of the more convenient sources of fresh water for the commonfolk in Camp Drybone."},{"name":"HILDIBRAND","text":"Tsk-tsk. You should endeavor to be more optimistic, Miss Ellie─like me! I say we search the spring first before declaring all to be lost."},{"name":"JOJONPA","text":"Ahahaha! Forgive me, I could contain myself no longer. What kind of fool parades about in an outfit like that? Was he some sort of mummer?"},{"name":"HILDIBRAND","text":"It occurs to me that I am not yet fully recovered from my accumulated injuries. It would not be prudent to immerse my body in water..."},{"name":"HILDIBRAND","text":"Not without first coating it with a liberal application of salamander oil, that is! Indeed, on many an occasion my dearest mother tended my childhood scrapes just so."},{"name":"HILDIBRAND","text":"You understand the importance of physical rehabilitation, yes? Then you can assist me by pouring the oil all over my body."},{"name":"HILDIBRAND","text":"The body is but an instrument in occasional need of oiling. So come, my friend! Come and oil me up!"},{"name":"HILDIBRAND","text":"Ahhh, this comforting scent, as though I am a child in her arms... Quickly now, before it dries─knead the oil into my aching flesh!"},{"name":"HILDIBRAND","text":"Ahhh, the rel─ Gah! The pain multiplies manifold! Gently, now─<span class=\"emphasis\">gently</span>!"},{"name":"HILDIBRAND","text":"Oh gods, oh gods, oh gods... Yesss, at last! My muscles slacken and soften, the warmth spreads, and the pain becomes pleasure!"},{"name":"HILDIBRAND","text":"Right there, yes! Keep doing that, just like that, just like─ &lt;groan&gt; Yesss! Now, once more─with <span class=\"emphasis\">feeling</span>!"},{"name":"HILDIBRAND","text":"Ahhh! Never before have I received such splendid ministrations. Now, then─into the spring. You as well, <span class=\"alternative-container\"><span class=\"alternative\">my good woman</span><span class=\"alternative\">my good man</span></span>!"},{"name":"HILDIBRAND","text":"I spy with my inspector's eye..."},{"name":"HILDIBRAND","text":"You've been productive! Excellent. May I see what you've found?"},{"name":"HILDIBRAND","text":"No sign of the sword Jojonpa mentioned, I see..."},{"name":"NASHUMHAKARACCA","text":"Ah!"},{"name":"NASHUMHAKARACCA","text":"Now I'm all wet! What was that, anyway!?"},{"name":"ELLIE","text":"Hm? Did something cause you to─"},{"name":"HILDIBRAND","text":"Once again, my instincts have guided us to our quarry! That I had you search that section of the spring was a stroke of...of... &lt;sneeze&gt;"},{"name":"NASHUMHAKARACCA","text":"Inspector, it's bad for your health to conduct investigations in those clothes! I'll go to Ul'dah and fetch you some new ones."},{"name":"HILDIBRAND","text":"How thoughtful of you, Nashu! While you're there, purchase a few bottles of hair tonic for Eleazar as well─the newest, most potent blend you can find."},{"name":"HILDIBRAND","text":"Is it not wonderful, my friend? Soon all of Eleazar's woes will be no more!"},{"name":"HILDIBRAND","text":"As promised, I return to you your father's ancient blade."},{"name":"ELEAZAR","text":"Aye, it <span class=\"emphasis\">is</span> her! Every chip an' scratch is just as I remember. Gods bless ye, sir!"},{"name":"ELLIE","text":"I never expected you would go to such lengths for two strangers without thought of reward. Altruism is a rare trait these days."},{"name":"HILDIBRAND","text":"'Tis common enough if you know where to look. A gentleman recognizes the good in every soul, and understands that none deserve to be forsaken!"},{"name":"ELLIE","text":"Spoken like a true gentleman─though your garments beg to differ."},{"name":"NASHUMHAKARACCA","text":"Inspector, I've brought your change of clothing! I also bought a supply of tonic from this peddler I met in Pearl Lane!"},{"name":"HILDIBRAND","text":"Excellent work, Nashu! If you would just bring me that case..."},{"name":"ELLIE","text":"...Inspector? Inspector Hildibrand?"},{"name":"HILDIBRAND","text":"There appears to be something lodged in my forehead. Could it be...a missive from an adoring admirer?"},{"name":"HILDIBRAND","text":"Hmmm... The author neglected to pen her name. “I shall come to claim the collector's blade.” Is that supposed to be flattering?"},{"name":"ELLIE","text":"No, you─ It's supposed to be intimidating. The duelist wrote this. He's daring you to stop him!"},{"name":"HILDIBRAND","text":"A <span class=\"emphasis\">challenge</span>! For me! Ho─ At last, the curtain rises..."},{"name":"HILDIBRAND","text":"Very well! If I am to duel the duelist, I must dress for the occasion!"},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, accept your challenge!"},{"name":"HUMPHREY","text":"He's...he's incredible! So bold, so majestic─just like a Warrior of Light!"},{"name":"HUMPHREY","text":"No─a <span class=\"emphasis\">Gentleman</span> of Light!"},{"name":"ELLIE","text":"He is...exceptionally...something."},{"name":"NASHUMHAKARACCA","text":"Cor! Inspector Hildibrand, you look amazing!"},{"name":"BLACKMAN","text":"(-???-)Hildibrand..."},{"name":"HATENA","text":"(-???-)...This is far from the strongest of swords."},{"name":"HATENA","text":"(-???-)Blue, blue skies and the rolling desert..."},{"name":"HATENA","text":"(-???-)How much longer must I seek the blade of legend?"},{"name":"JIMAKU","text":"Challenge accepted, my worthy opponent! You shall not claim the blade!"},{"name":"JIMAKU","text":"With my─let us call it what it is─genius, I shall bring you to justice!"},{"name":"JIMAKU","text":"Wait─you wish to duel with weapons, not wits!?"},{"name":"JIMAKU","text":"This bridge hardly seems appropriate for such an epic battle!"},{"name":"NASHUMHAKARACCA","text":"Hey, I know that spear! That's the one I found buried with the pumpkins!"},{"name":"NASHUMHAKARACCA","text":"Pumpkins sort of remind me of...um... No, it's gone. Never mind!"}],"reward":{"gil":939,"items":[{"num":2,"id":6153}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66742]},"next":[66851]},"partials":[{"type":"npc","id":"1005721","obj":{"i":1005721,"n":"Ellie","l":40,"q":1}},{"type":"npc","id":"1005731","obj":{"i":1005731,"n":"Eleazar","l":44,"q":1}},{"type":"npc","id":"1003939","obj":{"i":1003939,"n":"Beneger","l":44,"q":4}},{"type":"npc","id":"1003940","obj":{"i":1003940,"n":"Lululo","l":44,"q":3}},{"type":"npc","id":"1004042","obj":{"i":1004042,"n":"Aebbe","l":44,"q":1}},{"type":"npc","id":"1005722","obj":{"i":1005722,"n":"Humphrey","l":44,"q":1}},{"type":"npc","id":"1005723","obj":{"i":1005723,"n":"Ellie","l":44,"q":1}},{"type":"npc","id":"1005724","obj":{"i":1005724,"n":"Jojonpa","l":44,"q":1}},{"type":"npc","id":"1005725","obj":{"i":1005725,"n":"Hildibrand","l":44,"q":1}},{"type":"npc","id":"1005727","obj":{"i":1005727,"n":"Hildibrand","l":44,"q":1}},{"type":"npc","id":"1005730","obj":{"i":1005730,"n":"Hildibrand","l":44,"q":1}},{"type":"item","id":"6153","obj":{"i":6153,"n":"Filtered Water","l":70,"c":22614,"t":54}},{"type":"quest","id":"66742","obj":{"i":66742,"n":"After Her Own Heart","g":68,"l":"Ul'dah","s":3,"f":1}},{"type":"quest","id":"66851","obj":{"i":66851,"n":"The Science of Deduction","g":68,"l":"Eastern Thanalan","s":5,"f":1}}]}