{"quest":{"name":"Ranger Rescue","location":"Southern Thanalan","id":66755,"patch":2.1,"sort":0,"icon":100211,"beast":1,"unlocksFunction":1,"eventIcon":71341,"issuer":1005553,"target":1005553,"involved":[1005578,1005581,1005583,1005584,1005585,1008284,1008285,1008286,1008287],"genre":34,"journal":["Hamujj Gah wishes to hurl you into the heart of enemy territory, as he would a spear.","The warleader has received a report from Loonh Gah describing a vicious assault perpetrated by the Flamefangs upon a Forgotten Springs hunting party. Rendezvous with Loonh Gah to the southwest of the Ring of Ash, and rescue the surviving U tribe Miqo'te.","Loonh Gah has devised a rescue plan that requires you to provide an explosive distraction. Mounted upon the Miqo'te warrior's cavalry drake, you are to use the creature's Fiery Breath to destroy the barrels of oil stockpiled about the Zanr'ak encampment.<br><br>※Speak with Loonh Gah southwest of the Ring of Ash to borrow her cavalry drake.","You have destroyed the barrels of oil in a series of spectacular explosions. Make good your escape from the encampment, and rendezvous with Loonh Gah to the southeast.","After charging you with seeing the rescued huntress safely home, Loonh Gah abruptly departs for the Ring of Ash. Speak with U'napa to offer her an escort.","It appears that U'napa has more to tell you about “U'loonh.” Speak with the huntress in the settlement of Forgotten Springs.","U'napa seems convinced that Loonh Gah is the U'loonh she once knew─a Miqo'te who used to dwell in Forgotten Springs. Speak with huntresses around the settlement, and piece together what you can of the Brotherhood warrior's past.","At your prompting, the rangers of Forgotten Springs reveal that U'loonh's tale is one of tragedy and loss. Return to the Ring of Ash and speak with Loonh Gah.","Loonh Gah brusquely explains her decision to become a Brotherhood warrior, and spurns any sympathy at the loss of her Miqo'te heritage. Seemingly unwilling to discuss the subject further, she orders you to make your report to Hamujj Gah.","Hamujj Gah praises your efforts in rescuing the Miqo'te huntress from a nightmarish fate at the hands of the Flamefangs. Restating the warrior creed of the Brotherhood of Ash, the warleader bids you join his soldiers in the traditional Amalj'aa pursuit of honorable strength."],"objectives":["Speak with Loonh Gah.","Use the Fiery Breath of Loonh Gah's cavalry drake to destroy oil barrels.","Rendezvous with Loonh Gah to the southeast of the Zanr'ak encampment.","Speak with U'napa.","Speak with U'napa at Forgotten Springs.","Ask the huntresses of Forgotten Springs about U'loonh.","Speak with Loonh Gah at the Ring of Ash.","Report to Hamujj Gah."],"dialogue":[{"name":"HAMUJIGAH","text":"Do you know of Forgotten Springs, the Miqo'te settlement found to the south in the Sagolii Desert?"},{"name":"HAMUJIGAH","text":"We have just received urgent word from Loonh Gah. She reports that a hunting party from the U tribe village was ambushed by a sizable Amalj'aa force."},{"name":"HAMUJIGAH","text":"Those that were not massacred outright were dragged away by the raiders. They have likely already been tempered. Loonh Gah mentions, however, that one of the Miqo'te was nimble enough to evade capture and flee into hiding."},{"name":"HAMUJIGAH","text":"We have no alliance with the U tribespeople. But we cannot close our eyes to an act perpetrated by the very foe we so greatly despise. For the chance to strike a blow at our enemy, we will go to war for Forgotten Springs."},{"name":"HAMUJIGAH","text":"Be my spear, honored ally, and I shall hurl you into the midst of Zanr'ak. Loonh Gah awaits reinforcements to the southeast. Join your strength to hers, and do what must be done to rescue this lone, courageous Miqo'te ranger."},{"name":"LLOONGAH","text":"Ugh, gods be good! When I requested reinforcements, I did not expect the warleader to send <span class=\"emphasis\">you</span>!"},{"name":"LLOONGAH","text":"And, just as before, you are too slow to respond! While I sat here, grinding my teeth in frustration, I watched as the Flamefangs discovered the ranger's hiding spot and hauled her off to their encampment."},{"name":"LLOONGAH","text":"The encampment is their forward base, and, as such, the place is awash with alert and wary soldiers. The two of us would fare poorly against such numbers."},{"name":"LLOONGAH","text":"...Without a cunning plan, that is. You, my eager outsider, will have the use of my mount to sow a trail of chaos amongst their ranks."},{"name":"LLOONGAH","text":"Listen carefully. The Amalj'aa like to stockpile the oil that they use to light their watchfires and such. Seek out the barrels, and tap the drake's head─that is the command for him to spit a gout of flame."},{"name":"LLOONGAH","text":"The resulting explosions should be enough of a distraction for me to slip in and free the captured Miqo'te. Once you've freed yourself of angry Amalj'aa, meet us beyond the edge of the camp where the desert begins."},{"name":"LLOONGAH","text":"Are you slow of mind as well as of foot? Get back on the drake and incinerate those barrels!"},{"name":"MIQOTEFEMALE","text":"Thank you, I was certain my time had come...<br>The lizardmen fell upon us so swiftly, we had not the time to react. Your companion, the one who freed me, she seems so very familiar..."},{"name":"LLOONGAH","text":"Even riding a drake, you still somehow managed to arrive last. I thought perhaps you had been caught in an explosion and burned to a crisp. A pleasant thought, but apparently not the case."},{"name":"MIQOTEFEMALE","text":"(-U'napa-)U'loonh!? Could that really be you? We had thought you long perished..."},{"name":"LLOONGAH","text":"...Hmph."},{"name":"MIQOTEFEMALE","text":"(-U'napa-)No, I am sure of it! Your voice is unmistakable! I recall the many days we spent laughing and chatting in the springs!"},{"name":"LLOONGAH","text":"I don't know you or your damnable springs. I am Loonh Gah, a warrior of the Brotherhood of Ash."},{"name":"LLOONGAH","text":"My people are the Amalj'aa, proud and strong. You have the wrong Miqo'te."},{"name":"LLOONGAH","text":"I am heading back to camp. See this hunter safely home before you return to the Ring of Ash."},{"name":"MIQOTEFEMALE","text":"No escort will be necessary. I am a hunter of the U tribe─if I cannot cross the sands alone, I do not deserve to return at all."},{"name":"MIQOTEFEMALE","text":"...I would, however, have you visit the Springs in any case, adventurer. There is more to your friend─to U'loonh─that you should know."},{"name":"SYSTEM","text":"(deleted)"},{"name":"MIQOTEFEMALE","text":"(deleted)"},{"name":"MIQOTEFEMALE","text":"(deleted)"},{"name":"SYSTEM","text":"(deleted)"},{"name":"MIQOTEFEMALE","text":"(deleted)"},{"name":"Q1","text":"(deleted)"},{"name":"A1","text":"(deleted)"},{"name":"A1","text":"(deleted)"},{"name":"MIQOTEFEMALE","text":"We meet again, adventurer. I needed to tell you that your companion is, without a doubt, the little Loonh I used to know. There must be some pressing reason for her subterfuge."},{"name":"MIQOTEFEMALE","text":"Many of our tribe were close with U'loonh─they may help you to understand why U'loonh hides behind that mask, and how you might best help her."},{"name":"MIQOTEFEMALE","text":"(deleted)"},{"name":"MIQOTEFEMALE","text":"Speak with the huntresses around the Springs. They may help you to understand why U'loonh hides behind that mask, and what─if anything─can be done to help her."},{"name":"MIQOTEA","text":"U'loonh? Of course I knew her─she was my blood sister. We were both daughters of the former nunh, though our mothers were not the same."},{"name":"MIQOTEA","text":"You find my choice of tense confusing? She is dead, stranger. Slain alongside her mother more than five years ago. I did not witness the incident myself, but I will never forget the sudden pain of their loss..."},{"name":"MIQOTEA","text":"Five long years, yet my memories of her remain so clear..."},{"name":"MIQOTEB","text":"It is not uncommon to hear of skirmishes between our people and the Amalj'aa."},{"name":"MIQOTEB","text":"The lizardmen do not respect our territory, and they interfere with our hunts. The desert suffers for their presence."},{"name":"MIQOTEA","text":"We of the U tribe do not hold favorable relations with the Amalj'aa. They are a dangerous nuisance, and the Sagolii would be better for their absence."},{"name":"MIQOTEC","text":"It is said that a hunting party was set upon by the Amalj'aa. Many of my kin have not returned from the sands...<br>Must the tragedies of the past be so faithfully repeated?"},{"name":"MIQOTEA","text":"You have heard of the party of hunters that was slaughtered at the hands of the lizardmen? Though we often clash with the Amalj'aa, there hasn't been an incident on this scale for more than half a decade..."},{"name":"MIQOTEC","text":"(deleted)"},{"name":"MIQOTED","text":"U'loonh? Yes, I remember the name. She was a quiet girl, too timid to even slap at the biting desert flies. The lizardmen took her away from us, and for that I shall never forgive them."},{"name":"MIQOTEA","text":"Were little Loonh alive today, what a beautiful sleek huntress she might be."},{"name":"LLOONGAH","text":"You are late. I might have thought you delayed by a Wellwick worm, but the cloying pity in your eyes tells the tale. Do they mourn for me in Forgotten Springs? Hmph."},{"name":"LLOONGAH","text":"Look at me, adventurer. This is an Amalj'aa battlemask, given to me by the warleader himself. It is worn only by those who have chosen the path of the warrior."},{"name":"LLOONGAH","text":"You likely heard stories from the rangers, of how I was taken or killed during an Amalj'aa raid all those years ago. They are right...and they are wrong. I know not how I survived the attack, but it was Hamujj Gah who found me as I stumbled through the desert, barely conscious and badly wounded."},{"name":"LLOONGAH","text":"He gazed down upon my battered face, and gave me a simple choice: “Linger here and die, or come with me and fight.”"},{"name":"LLOONGAH","text":"It was then that I made the decision to discard my past─my family, my tribe, my very identity. I was reborn into the Brotherhood of Ash, existing for no other purpose but to feed the fires of my vengeance."},{"name":"LLOONGAH","text":"This mask is a symbol of my resolve; it represents my transformation into an Amalj'aa soldier, strong and proud."},{"name":"LLOONGAH","text":"Hmph. I tell you this not to justify my deceit, but to dam the flood of your foolish questions before it begins. Now, stow your unwanted sympathy, and make your report to the warleader!"},{"name":"HAMUJIGAH","text":"Honored ally, with your continued aid, the Brotherhood of Ash will rekindle the glory of our past."},{"name":"HAMUJIGAH","text":"As once did our ancestors, we shall forge of steel our bodies and spirits, and greet death with honor. To no gods will we beg, nor against the meek raise arms."},{"name":"HAMUJIGAH","text":"We are warriors, walkers of the path of righteous battle. We do not kneel to claim our strength. Live by these words, and your soul, too, shall burn as brightly!"},{"name":"POP","text":"You sense a hostile presence!"},{"name":"AMALJAAENEMY","text":"(deleted)"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Recognized</span> reputation with the Brotherhood of Ash."},{"name":"SYSTEM","text":"New Amalj'aa tribal daily quests are now available from Narujj Boh at the Ring of Ash."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Brotherhood of Ash vendor."}],"reward":{"gil":884,"xp":12925},"reqs":{"beastrank":1,"jobs":[{"lvl":46,"id":34}],"quests":[66754]},"next":[66756]},"partials":[{"type":"npc","id":"1005553","obj":{"i":1005553,"n":"Hamujj Gah","l":45,"q":7}},{"type":"npc","id":"1005578","obj":{"i":1005578,"n":"Loonh Gah","l":45,"q":3}},{"type":"npc","id":"1005581","obj":{"i":1005581,"n":"Loonh Gah","l":45,"q":1}},{"type":"npc","id":"1005583","obj":{"i":1005583,"n":"U'napa","l":45,"q":1}},{"type":"npc","id":"1005584","obj":{"i":1005584,"n":"U'napa","l":45,"q":1}},{"type":"npc","id":"1005585","obj":{"i":1005585,"n":"Loonh Gah","l":45,"q":1}},{"type":"npc","id":"1008284","obj":{"i":1008284,"n":"Cool-eyed Huntress","l":45,"q":1}},{"type":"npc","id":"1008285","obj":{"i":1008285,"n":"Keen-eyed Huntress","l":45,"q":1}},{"type":"npc","id":"1008286","obj":{"i":1008286,"n":"Sweet-smelling Huntress","l":45,"q":1}},{"type":"npc","id":"1008287","obj":{"i":1008287,"n":"Stern Huntress","l":45,"q":1}},{"type":"quest","id":"66754","obj":{"i":66754,"n":"Brotherhood of Ash","g":34,"l":"Southern Thanalan","s":0,"f":1}},{"type":"quest","id":"66756","obj":{"i":66756,"n":"An Eye on the Inside","g":34,"l":"Southern Thanalan","s":0,"f":1}}]}