{"quest":{"name":"Brotherhood of Ash","location":"Southern Thanalan","id":66754,"patch":2.1,"sort":0,"icon":100210,"beast":1,"unlocksFunction":1,"eventIcon":71341,"issuer":1005553,"target":1005553,"involved":[1005578,1005579,1005580],"genre":34,"journal":["Hamujj Gah, warleader of the Brotherhood of Ash, wishes to unleash you upon his craven brethren.","The Flamefangs, a faction of the Zanr'ak Amalj'aa, are on the prowl for fresh victims. Lie in wait at the merchant's location in the Red Labyrinth, and foil the attack.","You have defeated the Flamefang raiding party. Speak with the skittish salesman and see that he has not come to harm.","The merchant thanks you for your timely assistance. Return to the Ring of Ash and speak with Loonh Gah.","Loonh Gah appears to recognize your martial ability, but is still wary of your presence in the camp. Leave the Miqo'te to her mistrust, and report to Hamujj Gah with an account of the battle.","Though you have rescued one traveling peddler from an unpleasant fate, the Flamefangs continue to target the weak and unwary. Deepen your ties with the Brotherhood of Ash, and assist them in opposing their fanatic kin."],"objectives":["Lie in wait for the Flamefangs at the designated location in the Red Labyrinth.","Speak with the skittish salesman.","Speak with Loonh Gah at the Ring of Ash.","Report to Hamujj Gah."],"dialogue":[{"name":"HAMUJIGAH","text":"We, the Amalj'aa, were once simple nomads who roamed the vast plains of Paglth'an. If any sought to impede our path, we relished the challenge to our skill at arms."},{"name":"HAMUJIGAH","text":"For as long as our people have existed, it has been the tradition for aging warriors to make the pilgrimage to the holy land of Zanr'ak, and there confront the specter of death. It is an honor to cast one's time-tempered soul into the sacred flames, and return one's body to ash."},{"name":"HAMUJIGAH","text":"But these craven whelps of Zahar'ak quaver before death's inevitability─they seek not to fortify their spirits, instead groveling before a deity for the strength they do not deserve. "},{"name":"HAMUJIGAH","text":"I have not the words to express my disgust for the manner of this groveling, this...subjugation of the meek by contemptuous weaklings. The path to true greatness lies only in conquering those greater than oneself, and in the doing attaining mastery over one's own failings."},{"name":"AMALJAAFRIEND","text":"Warleader, there is trouble! The Flamefangs have scented fresh prey! We must sound the call to arms!"},{"name":"HAMUJIGAH","text":"It seems you shall have the chance to prove your talents, adventurer. Show the Brotherhood your unbending steel!<br>...Loonh Gah!"},{"name":"LLOONGAH","text":"Your wish, Warleader?"},{"name":"HAMUJIGAH","text":"This warrior is known by the name Loonh Gah. Though her form may be Miqo'te, her soul harbors a raging blaze to match that of any Amalj'aa soldier. We of the Brotherhood know only the struggle for martial perfection. Tribe, clan, gender─these details matter not."},{"name":"HAMUJIGAH","text":"Loonh Gah, you will accompany our newest ally into battle."},{"name":"LLOONGAH","text":"What!? Why choose me for this task? Surely, there are others more fitting! Some hatchling in training, perhaps?"},{"name":"HAMUJIGAH","text":"Enough! I grow weary of your insolence! Shall I have my blade answer your mewling?"},{"name":"LLOONGAH","text":"...No, Warleader. It shall be as you command."},{"name":"LLOONGAH","text":"Now we shall see you for the charlatan you are! Meet me at this spot on your map. I pray your screams are short-lived."},{"name":"MERCHANT","text":"Oh gods, oh gods, save me! Save meee!"},{"name":"LLOONGAH","text":"Where have you been!? I've already felled the forward scout!"},{"name":"LLOONGAH","text":"See the markings? We most certainly face Flamefangs. Take up your position and keep your weapon handy─the rest will soon be upon us!"},{"name":"MERCHANT","text":"Phew, you made short work of those raiders. I don't know who you are or where you came from, but you have my thanks."},{"name":"MERCHANT","text":"I'd heard the Amalj'aa were snatching folk from the trade routes again, but I thought that was just my rivals trying to scare me out of business. After all, the roads had been safe enough until now."},{"name":"MERCHANT","text":"I'll have to hire a guard or two for the next time I pass through here. Damn beastmen. Sellsword wages do so eat into a man's profits..."},{"name":"LLOONGAH","text":"Hmph, I expected you to die here. Come now, we return to the Ring of Ash!"},{"name":"LLOONGAH","text":"You are no hatchling in battle─that much is obvious. But do not think me so easily impressed! There is yet the question of your resolve!"},{"name":"LLOONGAH","text":"The Brotherhood of Ash is a conclave of elite warriors. Under the command of Hamujj Gah, we wage a war of attrition against the zealots of Zanr'ak."},{"name":"LLOONGAH","text":"Those fallen Amalj'aa build altars and pitch camps wherever they please, convincing themselves they are the masters of the holy land. It must feel brave indeed to challenge none but the weak and undefended."},{"name":"LLOONGAH","text":"Recall the raiders you but recently faced. They were members of the Flamefangs─a faction among the Zanr'ak Amalj'aa that, more than any other, delights in kidnappings. Naturally, they also draw the most ire of the Brotherhood."},{"name":"LLOONGAH","text":"It is our mission to see their ambitions ground into dust and their leaders slain! Indeed, it is the duty of all who would call themselves true Amalj'aa warriors."},{"name":"LLOONGAH","text":"And now, a warning: do not seek to meddle too deeply in our affairs. This war is not some distraction to be dabbled in by outsiders such as you!"},{"name":"LLOONGAH","text":"Hm? You think my words unconvincing? You think that I, too, am no Amalj'aa? To the seven hells with what you think!"},{"name":"LLOONGAH","text":"Go, make your report to Hamujj Gah before he has to find himself a new pet adventurer!"},{"name":"HAMUJIGAH","text":"Honored ally, news of your battle has spread through the camp. By all accounts, you fought with uncanny ability. None may now doubt that yours was the hand that slew a raging god."},{"name":"HAMUJIGAH","text":"If our cause rings true in your heart, then I would further welcome your aid. Will you unleash your fury alongside the soldiers of the Brotherhood?"},{"name":"SYSYTEM","text":"Unleash your fury alongside the Brotherhood?"},{"name":"SYSYTEM","text":"I will! Let the zealots fear our coming!"},{"name":"SYSYTEM","text":"I cannot join my cause to yours..."},{"name":"HAMUJIGAH","text":"Well said! Yours is a true warrior's heart!"},{"name":"HAMUJIGAH","text":"Though we differ in many ways, the foe that we would topple is the same. Let us vow death to the Flamefangs! Theirs is a fire that cannot be suffered to burn!"},{"name":"HAMUJIGAH","text":"I am saddened by this outcome. But I understand that you have your own path to walk. Though we part ways in this moment, know that my offer remains unchanged."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Neutral</span> reputation with the Brotherhood of Ash."},{"name":"SYSTEM","text":"Amalj'aa tribal quests are now available from Fibubb Gah at the Ring of Ash."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from the Brotherhood of Ash vendor."}],"reward":{"gil":840,"xp":11960},"reqs":{"jobs":[{"lvl":43,"id":34}],"quests":[66753]},"next":[66755]},"partials":[{"type":"npc","id":"1005553","obj":{"i":1005553,"n":"Hamujj Gah","l":45,"q":7}},{"type":"npc","id":"1005578","obj":{"i":1005578,"n":"Loonh Gah","l":45,"q":3}},{"type":"npc","id":"1005579","obj":{"i":1005579,"n":"Skittish Salesman","l":45,"q":1}},{"type":"npc","id":"1005580","obj":{"i":1005580,"n":"Loonh Gah","l":45,"q":1}},{"type":"quest","id":"66753","obj":{"i":66753,"n":"Peace for Thanalan","g":34,"l":"Ul'dah","s":0,"f":1}},{"type":"quest","id":"66755","obj":{"i":66755,"n":"Ranger Rescue","g":34,"l":"Southern Thanalan","s":0,"f":1}}]}