{"quest":{"name":"Borderline Slaughter","location":"Southern Thanalan","id":66759,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005550,"target":1005550,"genre":35,"journal":["Fibubb Gah wishes you to make an example of some encroaching scouts.","Fibubb Gah has tasked you with slaying enemy scouts who have begun encroaching on the Brotherhood's territory to the north of Zanr'ak. Seek out and eliminate the Amalj'aa thaumaturges and lancers.","You have slain the thaumaturges and lancers that creep near the borders of the Ring of Ash. Report to Fibubb Gah.","Fibubb Gah is pleased with your measured slaughter. Stand ready to slay more scouts should they again grow bold enough to approach the lands of the Brotherhood of Ash."],"objectives":["Slay Amalj'aa lancers.","Slay Amalj'aa thaumaturges.","Report to Fibubb Gah."],"dialogue":[{"name":"FIBUBBGAH","text":"The shadows of Zahar'ak scouts fall upon the boundaries of the Ring of Ash. Though they probe for a weakness in our defense, they will find that the wall of the Brotherhood stands solid against their incursions."},{"name":"FIBUBBGAH","text":"We shall teach these incautious fools what swift and final judgment awaits any who seek to seize the lizard's tail!"},{"name":"FIBUBBGAH","text":"Go forth, honored ally, and cut short the reconnaissance efforts of the Amalj'aa thaumaturges and lancers that you find."},{"name":"FIBUBBGAH","text":"When their brethren spy the carcasses strewn across the approaches to Zanr'ak, they shall know that the borders of the Brotherhood are not to be lightly tested."},{"name":"FIBUBBGAH","text":"The Zahar'ak Amalj'aa test the borders of our domain. Slay their scouts─the thaumaturges and the lancers─and teach them what awaits those who seek to seize the lizard's tail."},{"name":"FIBUBBGAH","text":"Your measured violence has been witnessed, honored ally. Already, the Zahar'ak cravens eye the horizon with mounting fear."},{"name":"FIBUBBGAH","text":"But we will not seek to harry them too far─that may serve to stiffen their resolve. No, first we allow the terror to take root and grow..."}],"reward":{"gil":480,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8970},"reqs":{"beastrank":1,"jobs":[{"lvl":43,"id":34}]}},"partials":[{"type":"npc","id":"1005550","obj":{"i":1005550,"n":"Fibubb Gah","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}