{"quest":{"name":"Maniac Manor","location":"Mor Dhona","id":66751,"patch":2.1,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1005523,"involved":[1006263],"genre":95,"journal":["Lauriane of Revenant's Toll looks as if she's seen a ghost.","Lauriane's words are concerning, indeed. If the stranger she encountered in Gridania is to be believed, Haukke Manor─once cleansed of its demons by your own hand─now houses newfound horrors. Seek out your old acquaintance Ursandel to the northwest of the Lancers' Guild and see if there is any substance to the rumors.","A visibly shaken Ursandel confesses to you that the rumors are all too true: someone─or some<span class=\"emphasis\">thing</span>─has returned to Haukke Manor, and the blood of ill-fated young maidens spills more freely than it did at the height of his lady's reign of madness. Set forth for the manor, that you might witness the horrors with your own eyes.","You have gained entrance to Haukke Manor. Lend your strength to the Wood Wailers who do battle within, and put an end to the tragic horrors of this accursed place once and for all.<br><br>※Haukke Manor (Hard) can be accessed via the Duty Finder."],"objectives":["Speak with Ursandel in Gridania.","Seek entry into Haukke Manor."],"dialogue":[{"name":"LAURIANE","text":"Aaaaaah! ...F-Forgive me, friend. A most chilling encounter has my nerves on edge."},{"name":"LAURIANE","text":"I was traveling through the Shroud when a man accosted me out of nowhere. His eyes darting wildly in fear, he spoke of a haunted mansion from which the tortured screams of young maidens can be heard day and night. Hawkett Manor, was it?"},{"name":"LAURIANE","text":"Ah, Haukke Manor, yes. What's that? You purged the selfsame manse of its unholy inhabitants some time ago? That is curious, indeed─the man recounted the events as if they had happened not days ago."},{"name":"LAURIANE","text":"While it would put my heart at ease to know his tale was but a fancy born of a few too many flagons of mead, the poor soul had not the air of a drunk or a liar. Perhaps you know someone who could shed light on the matter?"},{"name":"URSANDEL","text":"Ah, friend. It is good to see you again─how I wish I could greet you with more joyful tidings. I trust you have heard the rumors. Yes, I fear they are true, and then some. Oh, wherever shall I begin!?"},{"name":"URSANDEL","text":"After you released my lady from her torment─a deed of bravery and kindness that I will remember until the last of my days─I paid visit to the Wood Wailers and told the tale in all its tragedy, that the guardians of the Twelveswood might know the truth."},{"name":"URSANDEL","text":"Though the Wailers did not doubt my words, they insisted on a thorough investigation of the manor. Without witnessing my lady's remains for themselves, I was told, they could hardly vouch for the citizenry's safety. A prudent judgment, I thought, and I did not argue."},{"name":"URSANDEL","text":"It is what happened next that confounded everyone, myself most of all. A contingent of Wood Wailers was dispatched to the manor, and I personally escorted them in. This would be the last I saw of them, for nary a one returned."},{"name":"URSANDEL","text":"Minutes turned to hours, and before long, night surrounded the silent manor. 'Twas then the screams began again─ungodly, heartrending screams that shall be burned in my memory forevermore. Against my better reasoning, I mustered the courage to peer inside."},{"name":"URSANDEL","text":"Oh, how I wish I had not! For what peered back, friend, was someone─nay, some<span class=\"emphasis\">thing</span>, for that which I saw surely possessed no soul like you or I─that has no right to exist in our world!"},{"name":"URSANDEL","text":"The Wailers have dispatched another contingent to investigate the manor. The fools! Do they not see that they have writ their own death sentence!? I cannot save them, but <span class=\"emphasis\">you</span>, friend─you may succeed where I so miserably failed! I implore you, pray come to our aid once more!"}],"reward":{"gil":939,"instance":19,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]}},"partials":[{"type":"npc","id":"1005523","obj":{"i":1005523,"n":"Lauriane","l":67,"q":2}},{"type":"npc","id":"1006263","obj":{"i":1006263,"n":"Ursandel","l":53,"q":4}},{"type":"instance","id":"19","obj":{"i":19,"n":"Haukke Manor (Hard)","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":48,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}