{"quest":{"name":"Out of Sight, Out of Mine","location":"Mor Dhona","id":66752,"patch":2.1,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1005524,"target":1002285,"genre":95,"journal":["Hugubert of Revenant's Toll has news he would share in the strictest of confidence.","In hushed tones, Hugubert speaks of ill tidings from the mines of Copperbell. The fiendish hecatoncheires─believed to have been driven back to the umbral depths─have resurfaced, and many a roseate miner has paid the eternal price for returning to work too hastily. Your informant encourages you to speak to the Stone Torch posted outside the mines, located in western Thanalan, to see if aught can be done about the situation.","The proud Stone Torch grudgingly admits that hecatoncheires have returned to plague the mines and, what is more, have proven far too formidable an opponent for his vaunted unit. Indeed, the entire mining operation is at risk if this new threat is not dealt with, and swiftly. It would seem that Copperbell dost want for an adventurer's succor once more.<br><br>※Copperbell Mines (Hard) can be accessed via the Duty Finder."],"objectives":["Speak with the Stone Torch at Copperbell Mines."],"dialogue":[{"name":"HUGUBERT","text":"I've seen more and more visitors to this godsforsaken place lately, most of them battle-hardened types seeking a worthy test of their mettle. I trust that I might count you among them?"},{"name":"HUGUBERT","text":"Look, you didn't hear this from me, but word has it that Copperbell Mines are looking not unlike the eighth hell in recent days."},{"name":"HUGUBERT","text":"The Stone Torches would have us believe that they have matters under control, but a miner acquaintance of mine would beg to differ. He says the Torches have proven far more adept at quelling rumors than hecatoncheires, if you catch my drift."},{"name":"HUGUBERT","text":"Why do I betray this knowledge to you? I fear for my friend's life, and mine own as well should those hulking monstrosities break free to the surface. If it's a challenge you seek, what say you <span class=\"emphasis\">accidentally</span> find your way to Copperbell and proffer your services?"},{"name":"STONETORCH","text":"An adventurer? Baseless rumors notwithstanding, I can assure you that your meager talents are not needed here. No hecatoncheires have returned to the mines, and even if they <span class=\"emphasis\">had</span>, the Stone Torches would be seeing to the threat swiftly and ably, as is our wont...hm?"},{"name":"STONETORCH","text":"Ahem. I know not what you just heard, but it was most certainly <span class=\"emphasis\">not</span> the tortured scream of some unfortunate miner being consigned to the maw of a bloodthirsty giant birthed from the godsforsaken depths."},{"name":"STONETORCH","text":"...Ah, seven hells! It's true, all of it! We thought we had seen the last of them, but we were wrong! Horribly, dreadfully wrong! Let down our guard, we did, and now Copperbell is overrun with a damned legion of the fiends, each one nastier than the last."},{"name":"STONETORCH","text":"We've already lost scores of our men to the chaos. The few that have returned alive claim that even the once-docile spriggans have gone mad, falling upon the poor miners in droves. So much for being harbingers of wealth and fortune, eh?"},{"name":"STONETORCH","text":"The Stone Torches are loath to lean on the strength of outsiders, but I cannot in good conscience place fool pride before the lives of good men any longer."},{"name":"STONETORCH","text":"You reclaimed these mines once. The Torches─nay, the entire nation of Ul'dah─would be forever in your debt if you could perform the deed again. I beg of you, friend: banish those fiends to the depths, that they may never resurface."}],"reward":{"gil":939,"instance":18,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]}},"partials":[{"type":"npc","id":"1005524","obj":{"i":1005524,"n":"Hugubert","l":67,"q":3}},{"type":"npc","id":"1002285","obj":{"i":1002285,"n":"Stone Torch","l":42,"q":2}},{"type":"instance","id":"18","obj":{"i":18,"n":"Copperbell Mines (Hard)","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":48,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}