{"quest":{"name":"Peace for Thanalan","location":"Ul'dah","id":66753,"patch":2.1,"sort":0,"icon":100209,"unlocksFunction":1,"eventIcon":71341,"issuer":1004576,"target":1005553,"involved":[1005589,1006217],"genre":34,"journal":["Swift has an involved assignment for a veteran adventurer.","High Commander Swift explains that the number of kidnappings perpetrated by the Amalj'aa is once again on the rise. Report to Commander Gisilbehrt, head of security in Little Ala Mhigo in southern Thanalan, and learn what must be done to stem this disturbing escalation in abductions.","According to the briefing you received from Commander Gisilbehrt, the Amalj'aa in southern Thanalan have begun to strike out with ever greater frequency. Hurry to the site of a potential ambush, and prevent the beastmen from claiming yet another victim.","The leader of a small band of Amalj'aa that foiled the kidnapping attempt of their kin has expressed an interest in making your acquaintance. Make your way to the Ring of Ash, and speak with Hamujj Gah.","Hamujj Gah and his Brotherhood of Ash are soldiers that detest the cowardly actions of their fanatic brethren. Recognized for your part in bringing down the Lord of the Inferno, you have been invited to join in their efforts to restore the honor of a once-proud warrior tribe."],"objectives":["Report to Gisilbehrt in Little Ala Mhigo.","Wait for the ambushers to reveal themselves.","Speak with Hamujj Gah at the Ring of Ash."],"dialogue":[{"name":"SWIFT","text":"Yours is a welcome face, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. I have a task for which one of your impeccable record would be well suited. Though perhaps “campaign” would be a more fitting description, given the sheer commitment this mission demands."},{"name":"SWIFT","text":"As you are well aware, the inhabitants of Thanalan have long suffered the hostilities of the Amalj'aa."},{"name":"SWIFT","text":"The lizardmen had been quiet for a time, chastened by your victory over the primal Ifrit. But once again the beastmen stir."},{"name":"SWIFT","text":"There has been a resurgence in kidnappings, and in greater numbers than before. Matters have grown so far out of hand that the local garrisons have petitioned us for reinforcements. That is why I wish you to lead an extended action against the Amalj'aa, and put a stop to these raids."},{"name":"SWIFT","text":"Report to Commander Gisilbehrt, head of security in Little Ala Mhigo, and he will brief you on the details of your duty."},{"name":"GISILBEHRT","text":"Commander Swift said he'd assigned someone to assist with our growing beastman problem. Glad to see the urgency of our situation is being taken seriously."},{"name":"GISILBEHRT","text":"Now, as I'm sure the commander explained, the Amalj'aa activity in the region has grown almost frenzied. Seems like the lizardmen are determined to carry off every peddler and traveler that tries to pass through southern Thanalan."},{"name":"GISILBEHRT","text":"And I'm not speaking of furtive, nighttime raids here─the bastards're striking in full daylight, even against escorted merchant caravans."},{"name":"GISILBEHRT","text":"We've heard reports of raids as far south as the Sagolii Desert, so it's not a simple matter of increasing patrols on the roads into Little Ala Mhigo."},{"name":"GISILBEHRT","text":"We must mount a decisive response, and soon. The next time the Amalj'aa appear, I want you ready to send them howling back into the desert!"},{"name":"GISILBEHRT","text":"Not long before you arrived, in fact, our scouts reported a merchant resting in plain view on one of the trade routes. Make haste to the location I've marked on your map, and see that the fool isn't taken by a raiding party."},{"name":"GISILBEHRT","text":"If that merchant refuses to move along, the Amalj'aa are sure to take notice. Pray make haste to the location I've marked on your map and keep an eye out for raiders."},{"name":"MERCHANTA","text":"What is it, adventurer? I'm not setting up shop here, I simply stopped to give the birds a bit of a r─ Amalj'aa raiders, you say? Kidnapping <span class=\"emphasis\">merchants</span>!? I don't suppose you'd consider waiting around until I've got my chocobos back in the traces, would you?"},{"name":"MERCHANTA","text":"Thank you for not abandoning me to those savages!<br>...Is it not unusual for Amalj'aa to fight amongst themselves? I suppose even the beastmen must have squabbles."},{"name":"HAMUJIGAH","text":"(-Ash-smeared Amalj'aa-)Overconfident fools! You think your raids here go unnoticed?"},{"name":"AMALJAAENEMY","text":"(-Amalj'aa Raider-)What treachery is this!? You...you are of the Brotherhood of Ash!?"},{"name":"HAMUJIGAH","text":"(-Ash-smeared Amalj'aa-)We are. Though we number but few, we shall be your death this day!"},{"name":"AMALJAAENEMY","text":"(-Amalj'aa Raider-)Traitorous heathens! Your victory will come at a price!"},{"name":"AMALJAAENEMY","text":"(-Amalj'aa Raider-)Gaaaaaah!"},{"name":"LLOONGAH","text":"(-Masked Miqo'te-)Attacking when the enemy's back is turned? Your ancestors would turn in their graves!"},{"name":"HAMUJIGAH","text":"(-Ash-smeared Amalj'aa-)A soldier's life is one of peril. And the first rule of war is to understand the mind of your enemy, as well as your own."},{"name":"HAMUJIGAH","text":"(-Ash-smeared Amalj'aa-)Your presence is noted here, adventurer. But this is our battle─you need not become involved!"},{"name":"HAMUJIGAH","text":"I am Hamujj Gah, and I lead the Brotherhood of Ash. We are what remain now that the all-consuming flames have reduced the rest of my people to unthinking zealots."},{"name":"HAMUJIGAH","text":"You interest me, child of Eorzea─be it fortune or fate, I would not ignore the forces that sought to bring us together. I extend to you an invitation to join us at the Ring of Ash."},{"name":"HAMUJIGAH","text":"Welcome to the Ring of Ash, adventurer. This place serves as home for our humble gathering of soldiers."},{"name":"HAMUJIGAH","text":"My brothers and I ever seek to hone our martial prowess, and honor the blood of our ancestors. We keep to the old ways, of the desert nomad and of the warrior. To those who are worthy, we show the proper respect regardless of origin."},{"name":"HAMUJIGAH","text":"&lt;sniff&gt; Your aura...it carries the reek of brimstone. Could you be one of the champions said to have laid low the Lord of the Inferno?"},{"name":"HAMUJIGAH","text":"Then I would have you understand the curse that has befallen our fanatic brethren."},{"name":"HAMUJIGAH","text":"They have forgotten the code that governs our people, the glory that comes with a warrior's death. They spirit away the weak and the feeble, and offer them up in exchange for the barbed blessings of a hoary god."},{"name":"HAMUJIGAH","text":"Day after day, I witness the shameful acts of my kin. The honor of the Amalj'aa is a faded, paltry thing, no longer driven by the righteous fortunes of battle."},{"name":"HAMUJIGAH","text":"It is these kidnappings that most stoke the flames of my fury. Why, the victims often bear no arms at all! What triumph can be found in such cowardly attacks?"},{"name":"HAMUJIGAH","text":"We are hunters, my brothers and I, and the fallen Amalj'aa who huddle in Zanr'ak our prey. If you share my outrage, then I bid you join us in our kin war!"},{"name":"LLOONGAH","text":"(-???-)No, I will not accept this pretender!"},{"name":"LLOONGAH","text":"(-Masked Miqo'te-)You claim to be one of the heroes that felled Ifrit? I've cut down a dozen men who boasted that feat. More likely you slew a guttering fire sprite and convinced yourself it was the king of the seventh hell!"},{"name":"HAMUJIGAH","text":"I did not ask for your counsel, Loonh Gah. I, and I alone, make this decision for the Brotherhood."},{"name":"LLOONGAH","text":"Hmph. Then you better not stray into the path of my arrows, adventurer. We have too many enemies for me to waste ammunition on puffed-up “heroes” like you!"},{"name":"HAMUJIGAH","text":"Forgive this interruption. I shall vouch for the authenticity of your claim. Only one who has faced and defeated Ifrit could have the <span class=\"emphasis\">scent</span> that you do."},{"name":"HAMUJIGAH","text":"Past glories, however, will not impress my soldiers. Prove yourself through your actions, and you might find your reception here improved."},{"name":"HAMUJIGAH","text":"Our foes are the Amalj'aa of Zanr'ak! We shall break the fangs that feast on the helpless! Our target is clear, and our resolve unshakable!"}],"reward":{"gil":592,"xp":11960},"reqs":{"jobs":[{"lvl":43,"id":34}],"quests":[66488]},"next":[66754]},"partials":[{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1005553","obj":{"i":1005553,"n":"Hamujj Gah","l":45,"q":7}},{"type":"npc","id":"1005589","obj":{"i":1005589,"n":"Carefree Merchant","l":45,"q":1}},{"type":"npc","id":"1006217","obj":{"i":1006217,"n":"Gisilbehrt","l":45,"q":4,"t":"Flame Commander"}},{"type":"quest","id":"66488","obj":{"i":66488,"n":"In Pursuit of the Past","g":1,"l":"Coerthas Central Highlands","s":211}},{"type":"quest","id":"66754","obj":{"i":66754,"n":"Brotherhood of Ash","g":34,"l":"Southern Thanalan","s":0,"f":1}}]}