{"quest":{"name":"Martial Perfection","location":"Southern Thanalan","id":66757,"patch":2.1,"sort":0,"icon":100213,"beast":1,"unlocksFunction":1,"eventIcon":71341,"issuer":1005552,"target":1004576,"involved":[1005553,1005578,1008371],"genre":34,"journal":["Yadovv Gah, in stark contrast to his usual stoic warrior demeanor, appears highly agitated.","According to Yadovv Gah, it appears that Loonh Gah has embarked on a reckless quest to claim vengeance against Zagozz Teh. Report her absence to Hamujj Gah.","The warleader seems saddened at Loonh Gah's rash decision, but shows no intention of chasing after her. Convey his words to Yadovv Gah.","After speaking with Yadovv Gah, the distraught Amalj'aa warrior begs you to follow after the impulsive Miqo'te in his stead. Head into Zahar'ak, and find Loonh Gah.","You catch up to Loonh Gah, who, after an initial outburst, tasks you with freeing a prisoner being held deeper within Zahar'ak. Locate Blazehorn Monabb Chah, and liberate the cage key.","You have obtained the cage key from Blazehorn Monabb Chah. Use it to unlock the door of the prisoner's cage.","Loonh Gah's reunion with her tempered mother is interrupted by the arrival of a mocking Zagozz Teh. Before setting off in pursuit of the Flamefang leader, the furious Miqo'te requests that you destroy the three Ifrit's beacons found within Zahar'ak.","You have destroyed Ifrit's beacons. Seek out Loonh Gah that you might stand witness to her confrontation with Zagozz Teh.","With the death of Zagozz Teh, Loonh Gah has finally put her years-long vendetta to rest. Return to the Ring of Ash, and speak with Hamujj Gah.","Coupled with the death of their leader, your tireless efforts have ensured that the Flamefangs are no longer a potent force in the lands of Thanalan. Return to the Hall of Flames in Ul'dah, and report to Commander Swift.","Commander Swift is satisfied that your deeds have freed the people of Thanalan from the constant threat of kidnapping. Though the problems posed by the beastmen are yet many and varied, he bids you enjoy your triumph with a brief respite from the chaos."],"objectives":["Speak with Hamujj Gah.","Speak with Yadovv Gah.","Speak with Loonh Gah in Zahar'ak.","Lie in wait at the designated location, and obtain the cage key from Blazehorn Monabb Chah.","Use the cage key to open the sturdy cage.","Destroy Ifrit's beacons.","Rendezvous with Loonh Gah at the designated location.","Speak with Hamujj Gah at the Ring of Ash.","Report to Swift at the Hall of Flames in Ul'dah."],"dialogue":[{"name":"YADOVVGAH","text":"Loonh Gah is gone! She had no duties that would take her from the camp this day."},{"name":"YADOVVGAH","text":"I fear she rides for Zahar'ak, and her chance at Zagozz Teh's head! The warleader must be told!"},{"name":"HAMUJIGAH","text":"She is gone? The impatient whelp! Reckless action is not martial courage. To charge into battle without certainty of one's self or one's enemy is to court disaster."},{"name":"HAMUJIGAH","text":"Loonh Gah is beyond our help now. This is her battle, and her battle alone. Amalj'aa law forbids intervention in such vendettas."},{"name":"HAMUJIGAH","text":"If she wishes to perish in a blaze of false glory, then that is the path she has chosen. Loonh Gah's decisions define her as a warrior, and thus will end her tale."},{"name":"YADOVVGAH","text":"Hamujj Gah will do nothing!? We have trained Loonh Gah since she was barely more than a hatchling! There must be something we─"},{"name":"YADOVVGAH","text":"Honored ally! Though I risk bringing shame upon myself and the Brotherhood, I beg you hear my plea!"},{"name":"YADOVVGAH","text":"As an Amalj'aa, I am bound by our laws and customs...but you are not. Pray follow Loonh Gah into Zahar'ak and see she survives this madness!"},{"name":"LLOONGAH","text":"Where are you, Zagozz Teh? Your doom is come!"},{"name":"LLOONGAH","text":"Adventurer!? Why are you here? Did you follow me? I told you, I don't need─ Hmph. Since you <span class=\"emphasis\">are</span> here, perhaps you can prove useful."},{"name":"LLOONGAH","text":"There is a cage yet deeper within the stronghold. I thought that perhaps...it might be... Well, just free the prisoner, yes?"},{"name":"LLOONGAH","text":"The key is held by Monabb Chah. He is the Flamefangs' second-in-command, and not to be underestimated! Zagozz Teh is mine, but you will have your share of the glory. Now, go!"},{"name":"LLOONMOTHER","text":"(-White-haired Miqo'te-)Who is it? Who's there!?"},{"name":"LLOONMOTHER","text":"(-White-haired Miqo'te-)St-Stay back! You stay away!"},{"name":"LLOONMOTHER","text":"(-White-haired Miqo'te-)I know why you're here! Filthy kidnappers! You've come for my little Loonh, haven't you!?"},{"name":"LLOONMOTHER","text":"(-White-haired Miqo'te-)Well, you can't have her! No one can have her! She's been promised to the Lord of the Inferno!"},{"name":"LLOONMOTHER","text":"(-White-haired Miqo'te-)Ahahaha! Ahahahahahaha!"},{"name":"LLOONGAH","text":"Mother!? You're alive!"},{"name":"LLOONMOTHER","text":"(-White-haired Miqo'te-)Who is that? No! No, I know you people-snatchers and your dirty tricks! Now, get out before you scare my little Loonh! Out! Out, I said!"},{"name":"LLOONGAH","text":"Gods, no..."},{"name":"ZAGOZZTHE","text":"Gahahaha! There is naught quite as touching as the reunion betwixt mother and child. I can scarce contain my tears of bittersweet joy!"},{"name":"LLOONGAH","text":"Zagozz Teh! You'll pay for what you've done to her...and to me!"},{"name":"ZAGOZZTHE","text":"Some of the tempered, such as this one, are exposed overlong to the sacred flame. They become the walking witless, barely aware of their own existence!"},{"name":"ZAGOZZTHE","text":"Is Lord Ifrit's power not magnificent? Come, now. It is time you were purified in the raging blaze of His blessing!"},{"name":"LLOONGAH","text":"Come back and face me, coward!"},{"name":"LLOONGAH","text":"I go now to put an end to that monster's abominations once and for all. But if I'm to have any chance of victory, I will need you to first destroy Ifrit's beacons. Honor and pride, adventurer."},{"name":"ZAGOZZTHE","text":"Gahahaha! You are as a lost kitten that has wandered into the drake's lair. Surrender this doomed vendetta. Submit to Ifrit's will...as your mother did before you!"},{"name":"LLOONGAH","text":"Hah!"},{"name":"ZAGOZZTHE","text":"Argh, the pain! How is this possible!? My spells are drawn from the searing furnace of Ifrit's might!"},{"name":"LLOONGAH","text":"Wrong. Your power was drawn from the beacons, and those altars of suffering are no more!"},{"name":"LLOONGAH","text":"Without your precious blessing, there's naught to protect you from the sting of my arrows!"},{"name":"ZAGOZZTHE","text":"M-Mercy! Mercy, I beg you! The will of our god is overwhelming! Spare my life, and I shall become your slave instead!"},{"name":"LLOONGAH","text":"Pitiful creature. If any bring shame to the Amalj'aa, Zagozz Teh, then it is you."},{"name":"LLOONGAH","text":"Your power is broken and my vengeance complete─no more of my arrows need be stained by your coward's blood. Crawl back under your rock, lizard!"},{"name":"ZAGOZZTHE","text":"Gahahahahahaha! Gullible fool! Die!"},{"name":"ZAGOZZTHE","text":"Arrrgh!"},{"name":"LLOONGAH","text":"Warleader!"},{"name":"HAMUJIGAH","text":"You forsook all that is sacred to a true warrior of the Amalj'aa, Zagozz Teh. For your cowardice and cruelty, the only reward is death!"},{"name":"HAMUJIGAH","text":"I beheld the entire confrontation, Loonh Gah."},{"name":"HAMUJIGAH","text":"You fought with honor, and with courage! Such was my proud exultation, the dagger flew unbid from my hand─how unfortunate, then, that Zagozz Teh stood in its path. It appears that perfect martial detachment yet eludes even me..."},{"name":"LLOONGAH","text":"Were you watching, Mother? You have been avenged."},{"name":"HAMUJIGAH","text":"With the Flamefangs defeated, the Amalj'aa within Zanr'ak will return to cowering behind their campfires."},{"name":"HAMUJIGAH","text":"And though the embers of Ifrit's blessings yet smolder, we shall fight that fire with the flames we ourselves nurture─a strength born from within!"},{"name":"HAMUJIGAH","text":"But I need not speak to you of strength, for you, perhaps more than any, have neared the peak of perfection. You have earned the highest praise and deepest gratitude of my people."},{"name":"HAMUJIGAH","text":"Even should our races clash in blood-drenched savagery, you, honored ally, will always be welcomed by the Brotherhood of Ash."},{"name":"LLOONGAH","text":"I have seen my mother safely to Forgotten Springs."},{"name":"LLOONGAH","text":"It is unheard of for tempered to ever recover from their primal-induced madness, but it is my hope that she will at least find a measure of peace in our old home..."},{"name":"LLOONGAH","text":"Oh, and a word with you, adventurer."},{"name":"LLOONGAH","text":"I questioned your resolve, and you have answered me as well as any Amalj'aa warrior would. You have my respect..."},{"name":"LLOONGAH","text":"...and my thanks."},{"name":"LLOONGAH","text":"Well, this feels strange. I─ Why are you staring?"},{"name":"LLOONGAH","text":"I cannot help the way I look! My brethren must think me hideous!"},{"name":"HAMUJIGAH","text":"The road calls you, honored ally!"},{"name":"HAMUJIGAH","text":"Though misfortune seeks to waylay us, let us not stray from the path of the strong!"},{"name":"LLOONGAH","text":"My thirst for vengeance is satisfied, but it is too late for me to leave the Brotherhood. I am too steeped in Amalj'aa custom, my skin too stained with ash."},{"name":"LLOONGAH","text":"Fare you well, adventurer. May victory follow in your footsteps!"},{"name":"HAMUJIGAH","text":"Your deeds have been etched within the chambers of my soul, honored ally. Though the road might call you onwards, may the strength you have gained with the Brotherhood serve you well in the battles to come!"},{"name":"SWIFT","text":"Commander Gisilbehrt submitted a detailed report, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. It seems my decision to assign you this duty was the correct one."},{"name":"SWIFT","text":"With the Amalj'aa fanatics thus quelled, Thanalan may enjoy a measure of peace for a time."},{"name":"SWIFT","text":"And though we are never in short supply of beastman-related problems, I believe you've earned a respite from the chaos. Enjoy the rest while you may, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Brotherhood of Ash."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Brotherhood of Ash vendor."}],"reward":{"gil":912,"xp":13965},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}],"quests":[66756]}},"partials":[{"type":"npc","id":"1005552","obj":{"i":1005552,"n":"Yadovv Gah","l":45,"q":13}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1005553","obj":{"i":1005553,"n":"Hamujj Gah","l":45,"q":7}},{"type":"npc","id":"1005578","obj":{"i":1005578,"n":"Loonh Gah","l":45,"q":3}},{"type":"npc","id":"1008371","obj":{"i":1008371,"n":"Loonh Gah","l":45,"q":1}},{"type":"quest","id":"66756","obj":{"i":66756,"n":"An Eye on the Inside","g":34,"l":"Southern Thanalan","s":0,"f":1}}]}