{"quest":{"name":"Thinning the Ranks","location":"Southern Thanalan","id":66769,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005551,"target":1005551,"genre":35,"journal":["Narujj Boh is eager for you to spill the blood of the enemy.","In an effort to weaken the forces of the Flamefangs, Narujj Boh has bid you slay the Zanr'ak lancers and Amalj'aa archers found within the Zanr'ak encampment.","You have slain the soldiers beholden to the Flamefangs. Return to the Ring of Ash and report to Narujj Boh.","Satisfaction was writ plain upon your face, and in an instant did Narujj Boh recognize that your mission was a success. To face the enemy in his own domain and triumph is no small feat, and the Amalj'aa is grateful to have such a competent soldier as you pledged to the Brotherhood of Ash."],"objectives":["Slay Zanr'ak lancers.","Slay Amalj'aa archers.","Report to Narujj Boh."],"dialogue":[{"name":"NARUJIBOH","text":"With their propensity for kidnapping innocents in the name of Ifrit, the Flamefangs have earned their place as our most despised enemy. It is their power and influence that we most avidly desire to crush."},{"name":"NARUJIBOH","text":"I would have you hone your martial skills against the likes of Zanr'ak lancers and Amalj'aa archers, and thin the ranks of the soldiers who answer to Flamefang authority."},{"name":"NARUJIBOH","text":"No assault into the heart of enemy territory is without its risks, but I trust Hamujj Gah has chosen his ally well."},{"name":"NARUJIBOH","text":"Single out the Zanr'ak lancers and Amalj'aa archers, and weaken the forces subject to Flamefang command."},{"name":"NARUJIBOH","text":"Though I am often confounded by the features of other races, your expression cannot be mistaken. Victory over one's foes gives one a most distinct air of satisfaction."},{"name":"NARUJIBOH","text":"You have faced the enemy in his own domain and triumphed. We are fortunate indeed to have been delivered such a competent soldier."}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005551","obj":{"i":1005551,"n":"Narujj Boh","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}