{"quest":{"name":"Blitzing the Beacons","location":"Southern Thanalan","id":66767,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005550,"target":1005550,"genre":35,"journal":["Fibubb Gah wishes to entrust you with a new task.","Fibubb Gah has bid you strike out at the unholy altars of the Brotherhood's hated kin. Locate and destroy the flaming beacons in the west of Zahar'ak.","You have destroyed the flaming beacons. Return to the Ring of Ash and report to Fibubb Gah.","Fibubb Gah praises your worthy display of courage. Though the warrior exults at the blow you have struck for the Brotherhood, he warns that the fallen Amalj'aa will not be so easily dissuaded from their mad pursuit for power."],"objectives":["Destroy flaming beacons around Zanr'ak.","Report to Fibubb Gah."],"dialogue":[{"name":"FIBUBBGAH","text":"Be they ten thousand strong, the mewling whelps of Zahar'ak could not stand before us without the invigorating strength of their deity's flames."},{"name":"FIBUBBGAH","text":"They carefully capture the Lord of the Inferno's searing exhalations, and harness them for their unholy rites."},{"name":"FIBUBBGAH","text":"The god-touched fires are then ensconced within towering altars, which radiate Ifrit's blessings upon all within reach."},{"name":"FIBUBBGAH","text":"These flaming beacons must be destroyed! The Brotherhood of Ash will take from our vile kin every symbol of their undeserved strength!"},{"name":"FIBUBBGAH","text":"(deleted)"},{"name":"FIBUBBGAH","text":"I entrust this task to you, honored ally. But be forewarned: the sentinels that guard these beacons stand closest to the source of their power, and will prove to be most fierce adversaries."},{"name":"FIBUBBGAH","text":"Destroy these flaming beacons, honored ally! The symbols of our honorless kin's madness cannot be suffered to exist!"},{"name":"FIBUBBGAH","text":"A worthy display of courage, honored ally. May our enemies know that even their precious beacons be not safe from our wrath!"},{"name":"FIBUBBGAH","text":"...But lust for power is not so easily dampened. Until our war is won, I fear we will need to break these infernal altars again and again..."}],"reward":{"gil":480,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8970},"reqs":{"beastrank":1,"jobs":[{"lvl":43,"id":34}]}},"partials":[{"type":"npc","id":"1005550","obj":{"i":1005550,"n":"Fibubb Gah","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}