{"quest":{"name":"Rite Where It Hurts","location":"Southern Thanalan","id":66768,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005551,"target":1005551,"genre":35,"journal":["Narujj Boh wishes to capitalize on the panic you have sown.","Narujj Boh bids you infiltrate the Zanr'ak encampment and hunt down the agitated Amalj'aa clergy members. Slay Zanr'ak thaumaturges for their ritual tools, and Zanr'ak pugilists for their ritual offerings.","You have slain the clergy members and their bodyguards. Return to the Ring of Ash, and deliver the ritual materials to Narujj Boh.","Narujj Boh is pleased with the disruption your deeds have caused among the enemy's ranks. Without the necessary ritual materials, the clergy's plans to summon their god have been substantially delayed."],"objectives":["Obtain ritual tools from Zanr'ak thaumaturges.","Obtain ritual offerings from Zanr'ak pugilists.","Deliver the ritual materials to Narujj Boh."],"dialogue":[{"name":"NARUJIBOH","text":"I see panic among the ranks of the Zahar'ak fools. It is your deeds, honored ally, that have sown these seeds of discord."},{"name":"NARUJIBOH","text":"Even the priests who command our enemies have begun to show themselves in plain sight. The disruptions to their summoning preparations do not sit well with them."},{"name":"NARUJIBOH","text":"Let us further stir the pot, fellow warrior. I bid you slay the members of Ifrit's clergy─the Zanr'ak thaumaturges─and their bodyguard pugilists, as well."},{"name":"NARUJIBOH","text":"Seize from their lifeless shells what ritual tools and offerings they carried. Leave their brethren nothing with which to perform their unholy rites."},{"name":"NARUJIBOH","text":"Hunt down the Zanr'ak thaumaturges and pugilists and take from them their ritual materials. With a single act, we thin our foe's numbers and hamper their unholy rites."},{"name":"NARUJIBOH","text":"These weaklings that beseech a god for strength, and earn nothing through honorable battle, deserve <span class=\"emphasis\">nothing</span>! Slaughter Ifrit's priests, and seize from them their ritual tools."},{"name":"NARUJIBOH","text":"You pull the fangs off our enemy, honored ally. The thaumaturges were foolish to so reveal themselves."},{"name":"NARUJIBOH","text":"Every mistake they make shall cost them dearly. And should they endeavor to fashion new tools for their rites? Well, I have the perfect warrior to once more unleash into their midst."}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005551","obj":{"i":1005551,"n":"Narujj Boh","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}