{"quest":{"name":"Arms of the U","location":"Southern Thanalan","id":66766,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005550,"target":1005550,"genre":35,"journal":["Fibubb Gah wishes to salvage the honor taken from his people.","Fibubb Gah, unable to overlook the common thievery of the fallen Amalj'aa, wishes you to reclaim the ancestral weapons of the Forgotten Springs Miqo'te. Recover the unearned spoils of war from the crude gold coffers found in Zanr'ak, and also from the cooling corpses of an Amalj'aa brigand and an Amalj'aa scavenger.","You have retrieved the Miqo'te weapons. Deliver the assorted arms to Fibubb Gah at the Ring of Ash.","Though he claims no ties of fellowship with the U tribe, Fibubb Gah nevertheless feels honor-bound to return the unfairly won weaponry to Forgotten Springs himself. The Brotherhood soldier praises your well-rounded warrior spirit, and is certain that your feet are firmly planted on the path to greatness."],"objectives":["Obtain caches of ranger weapons from crude gold coffers in Zanr'ak.","Obtain a hunter's spear from an Amalj'aa brigand.","Obtain a stalker's bow from an Amalj'aa scavenger.","Deliver the weapons to Fibubb Gah."],"dialogue":[{"name":"FIBUBBGAH","text":"The Brotherhood of Ash strives to return our people to the selfsame glory our ancestors once knew. The fallen Amalj'aa, however, grind our honor into the dust with every misguided and ignoble step they take."},{"name":"FIBUBBGAH","text":"They swagger about like spoiled children, carrying weapons stripped from Miqo'te captives as if they were hard-won trophies of war...when in fact they are naught but garish reminders of craven ambushes and common pillaging."},{"name":"FIBUBBGAH","text":"It is said that the arms of the U tribe are passed down from one generation to the next─that these weapons are revered as highly as the teachings of their ancestors. Though we of the Brotherhood follow a different path, it is anathema to us that the honor of the Miqo'te should be so spat upon."},{"name":"FIBUBBGAH","text":"These Amalj'aa brigands and scavengers have not earned the right to their spoils. Search their camps, and reclaim all there is to be found. And when you have picked their caches clean, recover the rest from their bloody corpses."},{"name":"FIBUBBGAH","text":"Your enemies this day are the brigands and scavengers of the fallen Amalj'aa. Slay these swaggering fools for their affronts, and recover the ancestral weapons of the Miqo'te!"},{"name":"FIBUBBGAH","text":"Have you returned with the arms of the U tribe?"},{"name":"FIBUBBGAH","text":"Yes, the weapons of the Miqo'te are distinct from any the Amalj'aa would craft. I will return these treasures to their Forgotten Springs heirs, and salvage some measure of honor for my people."},{"name":"FIBUBBGAH","text":"Honored ally, once more you show a true warrior's spirit. Words are as wind, but your deeds mark your path into greatness."}],"reward":{"gil":480,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8970},"reqs":{"beastrank":1,"jobs":[{"lvl":43,"id":34}]}},"partials":[{"type":"npc","id":"1005550","obj":{"i":1005550,"n":"Fibubb Gah","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}