{"quest":{"name":"A Sappy Ending","location":"Southern Thanalan","id":66760,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005550,"target":1005550,"genre":35,"journal":["Fibubb Gah seeks aid to replenish the Brotherhood's stock of healing salves.","Fibubb Gah explains that a true warrior needs to be as concerned with the arts of healing as with the arts of war. Seek out succulents within Zanr'ak and harvest their rejuvenating sap.","You have obtained a supply of rejuvenating sap. Return to the Ring of Ash and deliver the healing salve to Fibubb Gah.","You have delivered the rejuvenating sap to Fibubb Gah. The proud warrior commends your efforts, claiming that a Brotherhood soldier would sooner die in battle than on a sickbed."],"objectives":["Obtain vials of rejuvenating sap from succulents in Zanr'ak.","Deliver the rejuvenating sap to Fibubb Gah."],"dialogue":[{"name":"FIBUBBGAH","text":"We of the Brotherhood of Ash are proud soldiers all. Yet even the greatest soldier can starve without sustenance, or be crippled by injury."},{"name":"FIBUBBGAH","text":"We bear our battle wounds as badges of honor, but a festering cut can take one's life as surely as the blade of one's foe. A true warrior neglects not the arts of healing."},{"name":"FIBUBBGAH","text":"My task for you, honored ally, is simple yet needful: gather from the desert plants of Zanr'ak the rejuvenating sap we use to salve our hurts."},{"name":"FIBUBBGAH","text":"Though our foes make no use of such remedies, they will nevertheless be loath to relinquish them to you. Have a care you do not sustain such injuries that you fail to return!"},{"name":"FIBUBBGAH","text":"Gather the clear sap of the Zanr'ak desert plants, and aid us in keeping our warriors hale."},{"name":"FIBUBBGAH","text":"Welcome, honored ally. Have you the sap we require?"},{"name":"FIBUBBGAH","text":"Yes, this will allow our wounded to return to the front lines of battle where a glorious death awaits. No true warrior wishes to wither away on a sickbed..."}],"reward":{"gil":480,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8970},"reqs":{"beastrank":1,"jobs":[{"lvl":43,"id":34}]}},"partials":[{"type":"npc","id":"1005550","obj":{"i":1005550,"n":"Fibubb Gah","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}