{"quest":{"name":"Douse Them While They're Down","location":"Southern Thanalan","id":66774,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005551,"target":1005551,"genre":35,"journal":["Narujj Boh wishes you to deliver an insult to the Flamefangs.","After educating you on the Amalj'aa's distaste for water, Narujj Boh asks that you subject the Brotherhood's foes to a humiliating defeat. Subdue the Flamefang ravagers you encounter in the south of Zanr'ak, and douse them with water from the heavy glass flasks at the moment of your victory.","You have thoroughly soaked a number of defeated Flamefangs. Return to the Ring of Ash and report to Narujj Boh.","Narujj Boh appears almost jovial at the news of your success. Though unable to witness the dousing firsthand, the warriors of the Brotherhood are much heartened by reports of the Flamefangs' defeat and subsequent humiliation."],"objectives":["Seek out Flamefang ravagers and douse them in water upon their defeat.","Report to Narujj Boh."],"dialogue":[{"name":"NARUJIBOH","text":"Do you know, honored ally, what is most distasteful to the Amalj'aa?"},{"name":"NARUJIBOH","text":"Simple water. As a people with an affinity for flame, we require very little of the liquid compared to other races. In fact, ingesting too much water can be as deadly to us as imbibing poison."},{"name":"NARUJIBOH","text":"Among the Amalj'aa, any who drinks water in excess is considered a fool. And, in the same vein, dousing an opponent with the substance constitutes the gravest form of humiliation. Have you perhaps divined my intent?"},{"name":"NARUJIBOH","text":"I mean to subject the Flamefangs to the most crushing manner of defeat! Their flickering spirit for battle will not withstand the insult you shall deliver!"},{"name":"NARUJIBOH","text":"Seek out the strongest Flamefangs in Zanr'ak, and, at the moment they bow to your superior might, pour upon their heads a deluge of freezing water."},{"name":"NARUJIBOH","text":"Subdue our Flamefang foes, and douse their addled heads with water. Such complete and utter defeat will smother what little fighting spirit they have!"},{"name":"AMALJAAENEMYA","text":"Graaagh! S-So cold!"},{"name":"AMALJAAENEMYAB000","text":"Ugh! Was that...was that water!?"},{"name":"AMALJAAENEMYC","text":"Damn you! The shame of it..."},{"name":"AMALJAAENEMYD","text":"Is this water!? Blah! Bluh! Bleh!"},{"name":"NARUJIBOH","text":"You seem surprised, honored ally. Did the intensity of their reactions surprise you? You may as well have soaked them with burning oil, such was their shame!"},{"name":"NARUJIBOH","text":"The mood of our camp is much lightened thanks to your deeds. Though we could not witness their defeat directly, such victories do much to improve morale!"},{"name":"POP","text":"You sense a hostile presence!"},{"name":"POP","text":"The enemy is still about!"}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005551","obj":{"i":1005551,"n":"Narujj Boh","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}