{"quest":{"name":"This Infernal Heat","location":"Southern Thanalan","id":66777,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":1,"eventIcon":71222,"issuer":1005551,"target":1005551,"genre":35,"journal":["Narujj Boh is exhausted by his stubborn kin's single-mindedness.","Narujj Boh tiredly explains that the Amalj'aa in Zanr'ak have constructed yet more of their ominous flame-topped towers. Find the infernal beacons and destroy them.","You have destroyed the infernal beacons. Return to the Ring of Ash and report to Narujj Boh.","Narujj Boh deduces from the stink of ruin that you were successful in your task. He exults in the defeat of his enemies' plans, and thanks you for your contributions to the Brotherhood's cause."],"objectives":["Destroy infernal beacons.","Report to Narujj Boh."],"dialogue":[{"name":"NARUJIBOH","text":"Our fanatic kin are nothing if not persistent. Once more they seek to focus and intensify the blessings of their deity."},{"name":"NARUJIBOH","text":"They have constructed sturdy beacons in Zanr'ak, and consecrated these towering talismans with Ifrit's fire."},{"name":"NARUJIBOH","text":"You will need more than a handful of ash to smother such roaring flames, honored ally. The time for subtlety has passed! Use whatever weapons you have at your disposal, but bring these structures crashing down!"},{"name":"NARUJIBOH","text":"(deleted)"},{"name":"NARUJIBOH","text":"As ever, the Flamefangs will seek to deny you at every turn. Engage them if you must, but do not lose sight of your true task."},{"name":"NARUJIBOH","text":"Find the infernal beacons in Zanr'ak, and leave of them nothing but smoking ruin!"},{"name":"NARUJIBOH","text":"I judge by the smell of smoke and blood that your task was a success. Even my stubborn kin must now feel a flicker of doubt in the strength their vaunted blessings bestow upon them."},{"name":"NARUJIBOH","text":"You, an outsider, have accomplished much for the Brotherhood. We are fortunate indeed to have you as our honored ally."}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005551","obj":{"i":1005551,"n":"Narujj Boh","l":45,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}