{"quest":{"name":"Voyce of Concern","location":"East Shroud","id":66789,"patch":2.1,"sort":0,"icon":100215,"beast":2,"unlocksFunction":1,"eventIcon":71341,"issuer":1005564,"target":1005564,"involved":[1005565,1005570],"genre":36,"journal":["Olmxio is perplexed by your concern for the hapless scholar.","Though unconvinced that searching for the “bumbling one” is worth the trouble, Olmxio nevertheless offers you knowledge that should avail you in your effort. Travel to Larkscall, on the border with the Sylphlands, and survey the area from the specified location.","Your mere presence in the area has scared the malevolent sylphs away, at least for the moment. The danger having abated, return your attention to the scholar Voyce and release him from his bonds.","No sooner did you rescue Voyce from the clutches of his captors than did the skittish scholar flee to the safety of Little Solace. Return and speak with the man to see what he has gleaned in his research of the sylphs.","The scholar Voyce─with some assistance from Elder Frixio─recounts the legend of the Chosen One, a legendary sylph who is reborn once a millennium and is said to possess the power to change the fate of her people. All present fear for what might befall the realm if the Chosen One were to fall into the hands of the malevolent touched sylphs. Speak with Olmxio and see if there is anything that can be done.","Olmxio, expressing grave doubts as to Voyce's abilities, would have you lead the search for the Chosen One. Remain in Little Solace and assist the sylphs as you gather what knowledge you can to prepare for the task ahead."],"objectives":["Travel to Larkscall and survey the area from the specified location.","Rescue Voyce.","Speak with Voyce at Little Solace.","Speak with Olmxio."],"dialogue":[{"name":"OLMXIO","text":"Walking one will truly go in search of bumbling one? This one thought walking one was making joke, like the time this one stole bumbling one's undergarments."},{"name":"OLMXIO","text":"This one does not understand what walking one is thinking. This one would leave bumbling one to bumble on one's own. But oh well...to each one one's own."},{"name":"OLMXIO","text":"This one saw bumbling one stumble off toward Larkscall, between this place and touched ones' home. Bumbling one is probably there shivering in stockings─if bumbling one <span class=\"emphasis\">found</span> stockings anyway, which this one doubts."},{"name":"OLMXIO","text":"Be warned, walking one. The trees have eyes, and report to touched ones. Walking one should not rush too quickly to bumbling one's aid, lest walking one fall into nasty trap."},{"name":"SYLPHENEMY","text":"(-Fawning Sylph-)Walking one scribbles letters! Maybe walking one is smart one that every one was talking about?"},{"name":"DILUXIO","text":"(-Menacing Sylph-)Smart one? Hah! Smart one would not stumble so stupidly into these ones' domain."},{"name":"VOYCE","text":"S-Someone help meeeeee! They'll e-e-eat me alive!"},{"name":"DILUXIO","text":"(-Menacing Sylph-)Shush, stupid one. These ones have no need for eating─or did stupid one not read that in stupid one's paper stacks? Stupid one is even stupider than this one thought."},{"name":"DILUXIO","text":"(-Menacing Sylph-)Now answer this one! Stupid one tries to sneak into these ones' home and kidnap Chosen One's podling, yes? Stupid one will confess, or stupid one will be shocky-sizzly one!"},{"name":"VOYCE","text":"The Ch-Chosen One? P-Podlings...? What are─"},{"name":"DILUXIO","text":"(-Menacing Sylph-)Aha! Did this one know it or did this one know it!?"},{"name":"VOYCE","text":"B-But this one...er, <span class=\"emphasis\">I</span> was just repeating what you─"},{"name":"DILUXIO","text":"(-Menacing Sylph-)Silence! This one hears sneaking one! What one goes there!?"},{"name":"SYLPHENEMY","text":"(-Servile Sylph-)This one knows, boss one! This one has seen walking one in Little Solace! Walking one is strong, not like stupid one!"},{"name":"DILUXIO","text":"(-Menacing Sylph-)Bah! This one will deal with stupid one another day. Let these ones be off."},{"name":"VOYCE","text":"Oh, friend! How can I ever repay you? Why, I thought I was a goner for sure!"},{"name":"VOYCE","text":"Whatever do you suppose got into those sylphs? The bestiaries describe them as such a carefree, fun-loving folk, and my rather limited firsthand experience has been the same."},{"name":"VOYCE","text":"But do tell, to whom do I owe this debt of gratitude? An adventurer, dispatched by the Order of the Twin Adder on behalf of little old me, you say? Hah hah, bless the commander, always looking out for his charge!"},{"name":"VOYCE","text":"While I'd like nothing more than to continue this conversation, would you mind terribly if we did so back at Little Solace? This place is giving me the heebie-jeebies!"},{"name":"VOYCE","text":"Oh, hullo! I say, it's good to see you in one piece, friend. Oh, but where are my manners? I've not even properly introduced myself!"},{"name":"VOYCE","text":"Voyce, Gridania's foremost scholar of sylphic customs and lore, at your service! ...Well, at least that's what I told the commander when I volunteered for this mission. Just between you and me, I'm actually rather new to the field.<br>But I've long been fascinated by the cute little critters, and I thought this the perfect opportunity to make a name for myself."},{"name":"VOYCE","text":"Which reminds me! I was just thumbing through one of the tomes I, ah, borrowed from Stillglade Fane, when I came across a particularly fascinating passage of a legendary sylph who is said to possess such power that she controls the very fate of her people."},{"name":"VOYCE","text":"Now, I realize this might sound crazy, but I couldn't help but wonder if this might be the selfsame “Chosen One” that that frightful sylph was─"},{"name":"FRIXIO","text":"...Chosen One. Yes, well does this one know the legend."},{"name":"FRIXIO","text":"Chosen One...the one who embodies the spirit of all trees that ever have lived or ever will live in these ones' forest home."},{"name":"FRIXIO","text":"Once every ten hundred years does Chosen One sprout forth, to lead these ones into a new era before returning to slumber. Birth and rebirth, such is the cycle of these ones' civilization."},{"name":"VOYCE","text":"Ten hundred years, eh? So if the last recorded sighting of the Chosen One was...yes...that would mean that the next rebirth would occur in...ah, just give me a moment now..."},{"name":"VOYCE","text":"Yes, carry the one, and..."},{"name":"OLMXIO","text":"Elder one! Could it be that rebirth of Chosen One is nigh, and touched ones are plotting something?"},{"name":"VOYCE","text":"Huh! Well, I'll be! I believe our sylph friend here has the right of it!"},{"name":"OLMXIO","text":"This one does not like this at all. Something must be done."},{"name":"VOYCE","text":"Something─yes, <span class=\"emphasis\">something</span> indeed must be done! And yet many questions of import remain to be answered. Such as, where might we find this Chosen One? And what is the true nature of the power she holds?"},{"name":"VOYCE","text":"...And most importantly of all, <span class=\"emphasis\">where</span>, pray tell, did I misplace my underclothes!? I know not if this is related to the coming of the Chosen One, but the Twelveswood is terribly...&lt;cough&gt;...chilly these days."},{"name":"VOYCE","text":"But regardless, I swear now that I shall remain at Little Solace until these mysteries are unraveled! 'Twas not by dumb luck that I was chosen for this task. No, the esteemed leaders of my nation...&lt;cough&gt;...knew that..."},{"name":"VOYCE","text":"No, they knew that... &lt;groan&gt;<br>...My, it <span class=\"emphasis\">is</span> rather cold, isn't it? If you'll allow me a moment's respite..."},{"name":"OLMXIO","text":"This one is worried. If Chosen One falls into the hands of touched ones, it could mean the end for these ones."},{"name":"OLMXIO","text":"This one must see to the safety of Little Solace. The search for Chosen One, this one would trust to walking one."},{"name":"OLMXIO","text":"Coughing one spouts big words, but has not the strength to save these ones─this can be seen by any one. And so this one turns to walking one. Will walking one help these ones?"},{"name":"SYSYTEM","text":"Offer your aid to the sylphs of Little Solace?"},{"name":"SYSYTEM","text":"You can count on this one!"},{"name":"SYSYTEM","text":"You'll have to ask another one."},{"name":"OLMXIO","text":"Thank you, walking one! Walking one is true friend to these ones! This one will not forget friendly one's kindness."},{"name":"OLMXIO","text":"This one thought walking one was a friend. Was this one wrong? If these ones' fate depends on coughing one, these ones are as good as dead ones."},{"name":"VOYCE","text":"D-Don't just stand there! Can't you see I'm in d-danger here!?"},{"name":"VOYCE","text":"Yes, we must search for the...&lt;cough&gt;...Chosen One! Ah, just as soon as my...&lt;cough&gt;...throat clears up."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Neutral</span> reputation with the sylphs of Little Solace."},{"name":"SYSTEM","text":"Sylph tribal quests are now available from Tonaxia at Little Solace."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from the sylphic vendor."}],"reward":{"gil":825,"xp":11730},"reqs":{"jobs":[{"lvl":42,"id":34}],"quests":[66788]},"next":[66790]},"partials":[{"type":"npc","id":"1005564","obj":{"i":1005564,"n":"Olmxio","l":55,"q":5}},{"type":"npc","id":"1005565","obj":{"i":1005565,"n":"Voyce","l":55,"q":6}},{"type":"npc","id":"1005570","obj":{"i":1005570,"n":"Voyce","l":55,"q":1}},{"type":"quest","id":"66788","obj":{"i":66788,"n":"Seeking Solace","g":36,"l":"Gridania","s":0,"f":1}},{"type":"quest","id":"66790","obj":{"i":66790,"n":"Pilfered Podlings","g":36,"l":"East Shroud","s":0,"f":1}}]}