{"quest":{"name":"Seeking Solace","location":"Gridania","id":66788,"patch":2.1,"sort":0,"icon":100214,"unlocksFunction":1,"eventIcon":71341,"issuer":1000168,"target":1005564,"involved":[1005577],"genre":36,"journal":["Commander Vorsaile Heuloix seeks a capable adventurer for a most daunting assignment.","Serpent Commander Heuloix is concerned about troubling movements among the sylph tribes, fearing that the typically benign beastmen are hatching a bodeful plot. With the scholar dispatched to investigate the matter having gone missing, the commander bids you go in search. Travel to Little Solace and speak to the sylph Olmxio.","Olmxio informs you that a bumbling, spineless fool of a “smart one” has been spending much time in the company of the sylph elder. This hardly matches Commander Heuloix's description of the scholar Voyce, but it should suffice as a starting point for your search. Seek out the sylph elder, Frixio, and see what light he might shed on the matter.","Elder Frixio─who seemingly holds Voyce in similarly low esteem─informs you that the scholar set out a few days ago for the Sylphlands. He also expresses considerable doubt as to the likelihood of the scholar returning alive. Return to Olmxio and see if there is anything you might do to rescue the man from harm.","Though failing to understand your preoccupation with Voyce's well-being, Olmxio does not dissuade you from your stated aim. He gives you fair warning that the Sylphlands are fraught with many dangers for walking ones such as yourself, and encourages you to prepare thoroughly for the journey ahead."],"objectives":["Speak with Olmxio at Little Solace.","Speak with Frixio.","Speak with Olmxio."],"dialogue":[{"name":"VORSAILE","text":"Ah, now here is a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who inspires confidence."},{"name":"VORSAILE","text":"It heartens me to see you stride into the Adders' Nest today, for I have a task of considerable breadth and even greater import─a task that calls out for a competent adventurer."},{"name":"VORSAILE","text":"Allow me to elaborate. In recent weeks, my eye has been drawn to unusual movements among the sylphs, those charming-yet-troublesome beastmen with whom we share our forest home."},{"name":"VORSAILE","text":"In hopes of shedding light on their intentions─be they malicious or benign─I dispatched a young researcher to Little Solace to investigate further. The fellow goes by the name of Voyce─mayhap you have heard of him? It would seem he is rather accomplished in his field."},{"name":"VORSAILE","text":"He set out a fortnight ago, and has been sending regular reports ever since─that is, until some three days past. Though he was quick to assure me that his prodigious intellect and survival skills would ensure his safety, I cannot help but fear he has come to harm."},{"name":"VORSAILE","text":"Such is my request to you: travel to Little Solace and inquire as to the well-being of our man. Seek out the sylph Olmxio, who has oft acted as an intermediary between our peoples. Now go in safety, and in haste. The forest holds many dangers─these days more than ever."},{"name":"OLMXIO","text":"Walking one walks with strength and purpose, yes. But this one is a busy one─state one's case, and state it quickly."},{"name":"OLMXIO","text":"Scholar? Walking one is looking for smart one, yes? This one knows no smart one. This one <span class=\"emphasis\">does</span> know bumbling, stumbling one, but what business would any one have with that one?"},{"name":"OLMXIO","text":"Stumbling one's whereabouts? Why, right over─hm? Wherever did that one bumble off to?"},{"name":"OLMXIO","text":"Bumbling one likely stumbled off to see elder one. Stumbling one is always bothering elder one with silly questions. Bothersome one's blathering makes less sense than babbling brook, this one thinks."},{"name":"FRIXIO","text":"Ah, brave one returns to these ones! This one is honored. Word of brave one's deeds comes often to Little Solace. These ones are honored to call brave one friend. Hm? Brave one is searching for scholarly one?"},{"name":"FRIXIO","text":"Brave one cannot possibly mean...<span class=\"emphasis\">that</span> one? This one has met many walking ones, and that one has all the wits of a wingrat."},{"name":"FRIXIO","text":"Three days ago, witless one stumbled off to the Sylphlands, babbling something about research."},{"name":"FRIXIO","text":"This one knows little of research, but this one <span class=\"emphasis\">does</span> know that the Sylphlands are no place for walking ones─and witless walking ones that much the less."},{"name":"FRIXIO","text":"Yes, these ones' ancient home is now the domain of touched ones, and those ones mean danger for these ones and walking ones alike. This one tried to stop witless one, but witless one's ears are stuffed with beeswax."},{"name":"OLMXIO","text":"Bumbling one set off for the Sylphlands!? Bumbling one is even dumber than this one thought."},{"name":"OLMXIO","text":"Touched ones will greet bumbling one with boom and sizzle. Then bumbling one will be crispy one. This one thinks it for the best. These ones will have one less worry."},{"name":"OLMXIO","text":"Walking one would go in search of that one? This one is confused. Take this one's word─that one is not worth the trouble."},{"name":"OLMXIO","text":"...Walking one is certain? &lt;sigh&gt; Then this one will not stand in walking one's way. But heed this one's warning: be wary, or dead ones will number two."},{"name":"FRIXIO","text":"Brave one would travel to the Sylphlands? &lt;sigh&gt; This one hopes brave one is not foolhardy one. Something is not right in our home these days. Listen to the trees, brave one. Elemental ones warn of danger..."}],"reward":{"gil":825,"xp":11730},"reqs":{"jobs":[{"lvl":42,"id":34}],"quests":[66488]},"next":[66789]},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1005564","obj":{"i":1005564,"n":"Olmxio","l":55,"q":5}},{"type":"npc","id":"1005577","obj":{"i":1005577,"n":"Frixio","l":55,"q":4}},{"type":"quest","id":"66488","obj":{"i":66488,"n":"In Pursuit of the Past","g":1,"l":"Coerthas Central Highlands","s":211}},{"type":"quest","id":"66789","obj":{"i":66789,"n":"Voyce of Concern","g":36,"l":"East Shroud","s":0,"f":1}}]}