{"quest":{"name":"Giddy for Goobbues","location":"East Shroud","id":66797,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005561,"target":1005561,"involved":[1008332],"genre":37,"journal":["Tonaxia would introduce you to one of her best friends.","Tonaxia extols the virtues of the goobbue, and encourages to you befriend one of the creatures. Travel to Larkscall and speak with the cheerful sylph who tends to the “mossy ones.”","The goobbue-herding sylph is distressed by the arrival of two touched ones with a mind for mischief. Kill two wingrats with one stone by riding the goobbue and sneezing the troublemakers into oblivion.<br><br>※You may mount the goobbue by speaking to the cheerful sylph.","The goobbue and you proved a formidable team, and the spittle-showered touched ones have fled in fear and disgust. Return and relate the happenings to Tonaxia.","Tonaxia is most pleased to hear that you befriended a goobbue and performed another good deed for Little Solace, nearly going so far as to declare you an honorary sylph."],"objectives":["Speak with the cheerful sylph in Larkscall, and ride the goobbue.","Ride the goobbue and sneeze at the specified locations.","Report to Tonaxia."],"dialogue":[{"name":"TONAXIA","text":"These ones have many friends in the forest, but no better friend than mossy ones."},{"name":"TONAXIA","text":"Mossy ones are old ones─as old as the forest itself. Mossy ones are as big as trees, and twice as strong."},{"name":"TONAXIA","text":"Mossy ones keep these ones safe. When mossy ones go <span class=\"emphasis\">ka-choo</span>, touched ones become scaredy ones."},{"name":"TONAXIA","text":"Does walking one want to become friends with mossy ones, too? Mossy ones look scary, but are gentle ones."},{"name":"TONAXIA","text":"Cheerful one in Larkscall tends to mossy ones. If walking one wants to make friends with mossy ones, walking one should go there."},{"name":"TONAXIA","text":"Cheerful one in Larkscall tends to mossy ones. If walking one wants to make friends with mossy ones, walking one should go there."},{"name":"NYXIA","text":"Walking one! Touched ones are trying to play tricks on these ones! Touched ones spread stinkweed all over these ones' forest!"},{"name":"NYXIA","text":"Walking one wants to make friends with mossy ones? This one is glad! Walking one should sit on top of mossy one, chase after touched ones. When mossy one goes <span class=\"emphasis\">ka-choo</span>, touched ones become fast-flying ones, go flying back home."},{"name":"NYXIA","text":"If walking one falls from mossy one, walking one should return to this one. Walking one will be riding one again."},{"name":"NYXIA","text":"Walking one wants to make friends with mossy ones? This one is glad!"},{"name":"NYXIA","text":"When mossy one goes <span class=\"emphasis\">ka-choo</span>, touched ones go fluttering back home."},{"name":"NYXIA","text":"Oh, thank you, walking one! Mossy one likes walking one, too─this one knows. Walking one and mossy one will be good friends."},{"name":"SYLPHENEMY","text":"(-Spiteful Sylph-)Ick! This one is stinkier than stinkweed!"},{"name":"SYLPHENEMY","text":"(-Cruel Sylph-)Stop it! This one just took a bath!"},{"name":"TONAXIA","text":"Welcome back, friendly one. Hm? Walking one made friends with mossy one, and scared away touched ones too?"},{"name":"TONAXIA","text":"Walking one is becoming more and more like one of these ones every day. Be careful, or walking one might start sprouting wings. Tee hee!"}],"reward":{"gil":420,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8797},"reqs":{"beastrank":1,"jobs":[{"lvl":42,"id":34}]}},"partials":[{"type":"npc","id":"1005561","obj":{"i":1005561,"n":"Tonaxia","l":55,"q":10}},{"type":"npc","id":"1008332","obj":{"i":1008332,"n":"Cheerful Sylph","l":55,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}