{"quest":{"name":"Idle Hands","location":"East Shroud","id":66791,"patch":2.1,"sort":0,"icon":100217,"beast":2,"unlocksFunction":1,"eventIcon":71341,"issuer":1005564,"target":1005564,"involved":[1000277,1005565,1005572,1005577],"genre":36,"journal":["Olmxio has had it up to here with Voyce's utter incompetence.","Olmxio, unable to bear Voyce's utter uselessness, sought to entrust the hapless scholar with various menial tasks, only to watch him fail in spectacular fashion. Olmxio now suspects Voyce is slacking from his latest task, that of leaf collecting. Seek out Nathaxio, who awaits the scholar's harvest.","Nathaxio suspects that the spell of transparency he cast upon Voyce has worn off, and that the scholar is too fearful to return. Seek out the hapless man by the entrance to the Sylphlands.","You find Voyce a bit shaken up, but otherwise no worse for the wear. Return to Olmxio and inform him that the scholar is safe.","Olmxio is perplexed by your presence, saying that you just spoke with him a moment ago en route to check on the Chosen One's cradle. Fearing the worst, he insists that you speak with Elder Frixio immediately.","That which was most feared has come true, as the disguised Diluxio and his lackeys have made off with the Chosen One, whose powers they intend to use to exact revenge on all perceived enemies of sylphkind. Return to Olmxio and report on the grievous state of affairs.","Olmxio is devastated at the news, yet resolves to find a way to retrieve the Chosen One's podling from the clutches of the touched ones. Remain in Little Solace and lend the sylphs what aid you can."],"objectives":["Speak with Nathaxio.","Search for Voyce by the entrance to the Sylphlands.","Speak with Olmxio at Little Solace.","Speak with Frixio.","Report to Olmxio."],"dialogue":[{"name":"OLMXIO","text":"Ah, friendly one. This one would ask a favor."},{"name":"OLMXIO","text":"Bumbling one spends all day sleeping on paper-stack pillow, yes? So this one thought to put that one to work."},{"name":"OLMXIO","text":"This one gives bumbling one needle and thread, but bumbling one pricks finger and starts screaming and sobbing. This one's head still hurts."},{"name":"OLMXIO","text":"So this one finds simpler task, asks bumbling one to go collect leaves for Nathaxio. Simple, yes? But bumbling one does not return. This one has had enough of bumbling one's bumblings, but Nathaxio is concerned. Friendly one should go talk to concerned one."},{"name":"SYLPHFRIEND","text":"This one is Nathaxio, leafcrafter. Walking one is sent by Olmxio, yes? This one is thankful. "},{"name":"SYLPHFRIEND","text":"Olmxio placed four-eyed one in this one's care, asked this one to find work that four-eyed one would not bumble. So this one sent four-eyed one in search of leaves of great shelter tree."},{"name":"SYLPHFRIEND","text":"This one casts see-through spell on four-eyed one for safe return. But <span class=\"alternative-container\"><span class=\"alternative\">day turns to night</span><span class=\"alternative\">night turns to day</span></span> and that one is nowhere to be seen."},{"name":"SYLPHFRIEND","text":"This one suspects that four-eyed one is see-through no more, and shakes and shivers behind tree somewhere. &lt;sigh&gt; Four-eyed one is useless, but does not deserve to die. Please find four-eyed one, friendly one."},{"name":"VOYCE","text":"Oh, friend! Ever a sight for sore eyes, you are!"},{"name":"VOYCE","text":"Pray forgive me. I was just on my way back from collecting leaves for my dear friend Nathaxio─and I must say I harvested quite a haul─when I, ah...somehow lost my way."},{"name":"VOYCE","text":"Next thing I knew, my transparency spell had worn off, and...ah, that means all those nasty forest critters can see us, yes? What say we return to Little Solace, and quickly at that?"},{"name":"OLMXIO","text":"Hm? Friendly one is back so soon? Is Chosen One safe and sound?"},{"name":"OLMXIO","text":"...What? Friendly one only <span class=\"emphasis\">now</span> returns to this one? Saved bumbling one but moments ago? This cannot be."},{"name":"OLMXIO","text":"Friendly one was here moments ago. Told this one that friendly one would go look after..."},{"name":"OLMXIO","text":"Gah! How could this one be so foolish!? This one has terrible feeling! Must see elder one at once!"},{"name":"FRIXIO","text":"...Are this one's eyes to be believed!?"},{"name":"FRIXIO","text":"Chosen One's podling, stolen from this one's care?"},{"name":"FRIXIO","text":"B-Brave one steals Chosen One from us? But...why? Was brave one fooling these ones all along?"},{"name":"DILUXIO","text":"(-???-)This one thinks grey-haired one needs new spectacles."},{"name":"VOYCE","text":"Why, I'll be, friend! You never told me you had a twin <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>!"},{"name":"DILUXIO","text":"(-???-)This one is surrounded by fools. Makes this one's task all the easier..."},{"name":"FRIXIO","text":"Chosen One!"},{"name":"DILUXIO","text":"Foolish ones are foolish indeed to try to outwit this one. But worry not, foolish ones─Chosen One's podling is safe in hands of this one."},{"name":"DILUXIO","text":"...Hm?"},{"name":"DILUXIO","text":"Ah, the podling trembles with power! The time of rebirth draws near!"},{"name":"DILUXIO","text":"Yes, at long last, this one will finally reclaim the forest for these ones. With Chosen One's power, these ones will be pushed aside by walking ones no longer!"},{"name":"DILUXIO","text":"Yes, this one will teach Chosen One the way of almighty one, Lord Ramuh. This one will teach Chosen One of all those who are enemy to these ones─walking ones, steel ones, treacherous ones..."},{"name":"DILUXIO","text":"...This one will destroy every one! Muahahaha!"},{"name":"OLMXIO","text":"If Chosen One is born in Diluxio's care, it is not just these ones who will suffer─<span class=\"emphasis\">every</span> one will be in danger..."},{"name":"OLMXIO","text":"These ones must find Chosen One...but where to look? Curses! If only walking ones had sent <span class=\"emphasis\">real</span> smart one instead of bumbling four-eyed one!"},{"name":"OLMXIO","text":"But this one will think of something. Brave one, please help defend these ones' home against touched ones' attack. These ones have no one else to turn to."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"FRIXIO","text":"As elder one, it is this one's duty to protect these ones from harm. This one must think of something..."},{"name":"VOYCE","text":"I can't thank you enough for saving my skin again, friend. I say, the sylphs seem restless today. What do you suppose has them all aflutter?"},{"name":"VOYCE","text":"I can hardly believe what has happened... I don't even know how they got the podling! Must have been when my back was turned. To think that my unmindful behavior has brought such tragedy to these poor creatures."},{"name":"ACCESS","text":"The enemy is still about!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the sylphs of Little Solace."},{"name":"SYSTEM","text":"New sylph tribal daily quests are now available from Moxia at Little Solace."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the sylphic vendor."}],"reward":{"gil":912,"xp":13965},"reqs":{"beastrank":2,"jobs":[{"lvl":48,"id":34}],"quests":[66790]},"next":[66792]},"partials":[{"type":"npc","id":"1005564","obj":{"i":1005564,"n":"Olmxio","l":55,"q":5}},{"type":"npc","id":"1000277","obj":{"i":1000277,"n":"Nathaxio","l":55,"q":3}},{"type":"npc","id":"1005565","obj":{"i":1005565,"n":"Voyce","l":55,"q":6}},{"type":"npc","id":"1005572","obj":{"i":1005572,"n":"Voyce","l":55,"q":1}},{"type":"npc","id":"1005577","obj":{"i":1005577,"n":"Frixio","l":55,"q":4}},{"type":"quest","id":"66790","obj":{"i":66790,"n":"Pilfered Podlings","g":36,"l":"East Shroud","s":0,"f":1}},{"type":"quest","id":"66792","obj":{"i":66792,"n":"Feathers and Folly","g":36,"l":"East Shroud","s":0,"f":1}}]}