{"quest":{"name":"Pilfered Podlings","location":"East Shroud","id":66790,"patch":2.1,"sort":0,"icon":100216,"beast":2,"unlocksFunction":1,"eventIcon":71341,"issuer":1005565,"target":1005565,"involved":[1005564,1005571],"genre":36,"journal":["Voyce has made a monumental discovery.","The pseudoscholar Voyce has belatedly come to the conclusion that the sylphs who had captured him are in possession of a podling containing the Chosen One. As he neither understands the full implications of this nor possesses the courage to investigate the matter himself, he bids you speak with Olmxio.","Aghast at hearing that the Chosen One is in the hands of the touched sylphs, Olmxio urges you to go in search of the podling at once, casting a spell of transparency upon you to aid in your quest. Infiltrate the Sylphlands and spy upon any ill-intentioned sylphs you might find, that you might ascertain the location of the Chosen One's podling.<br><br>※This task must be completed before Olmxio's enchantment expires. To extend the length of his spell, interact with the fragrant blooms you encounter on your path.","To your fortune, the heedless sylph tasked with transporting the Chosen One's podling has misplaced his charge somewhere near the entrance to the Sylphlands. Hurry and find it before the touched ones do!","You have secured the podling, which is a great deal weightier than you imagined. Transport it safely back to Little Solace while the strength in your arms remains.<br><br>※To bolster your strength while carrying the podling, interact with the patches of moongrass that you find along the way.","The Chosen One's podling now rests safely in Little Solace. Inform Voyce that you were able to succeed in the task without his help.","While relieved that the Chosen One is safe, Elder Frixio does not believe that the touched ones will give up so easily, and warns you that retaliation may come sooner than you think."],"objectives":["Speak with Olmxio.","While transparent, spy on the touched sylphs.","Retrieve the sylph podling.","Deliver the sylph podling to Little Solace.","Speak with Voyce."],"dialogue":[{"name":"VOYCE","text":"Friend, you must listen! I was just perusing my tomes before, when I came across a most fascinating passage."},{"name":"VOYCE","text":"Are you perchance familiar with how baby sylphs are born? Perhaps I can put it in layman's terms. You see, sylphs come into this world in the form of a bulb, not unlike certain types of flora."},{"name":"VOYCE","text":"But these bulbs will not sprout into a sylph of their own volition. No, they must first be incubated within a special pod─forming what is known as a “podling”─and given sufficient warmth and nutrition. Then, and only then, will a newborn sylph emerge."},{"name":"VOYCE","text":"This got me to thinking... Those frightful sylphs who accosted me said something about a podling, yes? I didn't put it together then, but..."},{"name":"VOYCE","text":"Yes, surely the Chosen One slumbers as a podling even as we speak...a podling which they assumed I had come to steal! This must be why they acted so threatened by my presence!"},{"name":"VOYCE","text":"We should continue our search in the Sylphlands straightaway. That is to say, <span class=\"emphasis\">you</span> should continue it. I mean, I'd go with you, of course! It's just, uh... &lt;cough&gt; &lt;cough&gt; ...Still feel so weak... &lt;cough&gt; Ahem. I'm sure Olmxio would agree. You should go see what he thinks."},{"name":"OLMXIO","text":"Bumbling one said <span class=\"emphasis\">what</span>!? Chosen One yet exists as a podling? Why did bumbling one not tell this one sooner!? There is no time to lose!"},{"name":"OLMXIO","text":"Walking one must become running one, and retrieve Chosen One's podling from the Sylphlands with all haste!"},{"name":"OLMXIO","text":"This one can help. This one uses see-through magic, so that walking one becomes hidden one."},{"name":"OLMXIO","text":"But be careful─see-through magic will not last long. If touched ones see walking one, walking one is in trouble. Now hurry, and find Chosen One!"},{"name":"DECRIPT","text":"A sylphic incantation is about to render you transparent. Hurry and find the bulb that houses the slumbering Chosen One before the magic is lifted."},{"name":"DECRIPT","text":"The incantation will expire in fifty seconds. If you become visible, you will be unable to complete your goal. Return to Olmxio and have the spell cast anew."},{"name":"DECRIPT","text":"The fragrant blooms you will encounter on the way will extend the duration of the incantation. Seek them out if the spell's power begins to wane."},{"name":"RECOVER","text":"A fragrant mist envelops you!"},{"name":"NOTRECOVER","text":"（カット）"},{"name":"SYSTEM","text":"It is not safe to perform this action while visible. Return to Olmxio to have the incantation cast anew."},{"name":"SYLPHENEMYA","text":"Phew, this one is exhausted! Who knew that a podling could be so heavy?"},{"name":"SYLPHENEMYB","text":"(-Irritable Sylph-)Lazy one should feel honored, to be trusted by boss one with super-secret mission!"},{"name":"SYLPHENEMYA","text":"Yes, yes...this one is honored, but also tired. So this one hides podling in super-secret place, will carry to boss one when arms and wings are strong again."},{"name":"SYLPHENEMYB","text":"(-Irritable Sylph-)But boss one said not to let podling out of sight for even one eye-blink!"},{"name":"SYLPHENEMYA","text":"Yes, yes... This one was just going to go get it... Now, ah...where did this one put it, again?"},{"name":"SYLPHENEMYB","text":"(-Irritable Sylph-)..."},{"name":"SYLPHENEMYA","text":"Was it near entrance to these ones' home, or...? Ah, this one cannot remember! Oh, what has this one done!? Boss one will pluck this one's wings out one by one!"},{"name":"SYLPHENEMYB","text":"(-Sluggish Sylph-)These ones must search! If these ones do not find Chosen One quickly, this one will not survive boss one's wrath!"},{"name":"SYSTEM","text":"Cool, crisp air fills your lungs, giving your arms and legs new strength!"},{"name":"NOTRECOVER","text":"You are not carrying the specified object. Return to the starting point and reattempt the delivery."},{"name":"DECRIPT","text":"Carry the podling back to Little Solace while your arms and legs still have strength."},{"name":"DECRIPT","text":"You will have fifty seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"DECRIPT","text":"Be wary of attacks from enemies. Should you find yourself tiring, seek out patches of moongrass, which will restore your strength."},{"name":"VOYCE","text":"Could it truly be...the Chosen One's podling? Good show, friend!"},{"name":"VOYCE","text":"Why, it is every bit as beautiful as I would have expected from the tales, and thrice the size!"},{"name":"FRIXIO","text":"Brave one has done it! These ones cannot thank brave one enough!"},{"name":"FRIXIO","text":"By keeping Chosen One out of the hands of touched ones, brave one has saved these ones─no, every one in Eorzea─from a thundery demise!"},{"name":"VOYCE","text":"Oh, let us not engage in hyperbole, friend sylph! Chosen One or no, she is just a wee babe, after all."},{"name":"FRIXIO","text":"Foolish one has four eyes, yet not a one of them sees!"},{"name":"FRIXIO","text":"Has foolish one learned nothing from those paper stacks? From the moment Chosen One emerges from cradle, Chosen One holds the power of a thousand thousand of these ones."},{"name":"FRIXIO","text":"...Power to command primal one with the ease by which walking ones draw breath."},{"name":"FRIXIO","text":"What does four-eyed one think would happen if Chosen One's powers fell into hands of touched ones? Lord Ramuh would come down from the heavens, and walking ones' precious Gridania would go boom!"},{"name":"VOYCE","text":"A primal in Gridania!? H-How frightful! Why, we really must do something about this!"},{"name":"FRIXIO","text":"Does four-eyed one need four ears as well!? That is why this one sent brave one in search of Chosen One! &lt;sigh&gt;"},{"name":"FRIXIO","text":"What matters is that Chosen One is safe now. Under these ones' care, Chosen One will be raised in Little Solace, where Chosen One will know only peace and gentleness."},{"name":"FRIXIO","text":"If raised properly, Chosen One's great powers will bring comfort and solace, not destruction. This one─all of these ones─will see to that."},{"name":"FRIXIO","text":"But brave one must be wary. These ones' enemy will not give up so easily. Should touched ones return for Chosen One, this one would ask for brave one's aid."},{"name":"VOYCE","text":"I say, it's one eye-opening experience after the next with these sylphs! I really must take all this down... Now, where did I put my journal?"},{"name":"SYLPHENEMYA","text":"Phew! This one needs a─hm? Walking one!? Walking ones are not welcome in this place!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Recognized</span> reputation with the sylphs of Little Solace."},{"name":"SYSTEM","text":"New sylph tribal daily quests are now available from Ponnixia at Little Solace."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the sylphic vendor."}],"reward":{"gil":869,"xp":12420},"reqs":{"beastrank":1,"jobs":[{"lvl":45,"id":34}],"quests":[66789]},"next":[66791]},"partials":[{"type":"npc","id":"1005565","obj":{"i":1005565,"n":"Voyce","l":55,"q":6}},{"type":"npc","id":"1005564","obj":{"i":1005564,"n":"Olmxio","l":55,"q":5}},{"type":"npc","id":"1005571","obj":{"i":1005571,"n":"Sluggish Sylph","l":55,"q":1}},{"type":"quest","id":"66789","obj":{"i":66789,"n":"Voyce of Concern","g":36,"l":"East Shroud","s":0,"f":1}},{"type":"quest","id":"66791","obj":{"i":66791,"n":"Idle Hands","g":36,"l":"East Shroud","s":0,"f":1}}]}