{"quest":{"name":"Feed Me","location":"East Shroud","id":66796,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005561,"target":1005561,"genre":37,"journal":["Tonaxia fears for the fate of her fellow sylphs.","Touched sylphs have played a terrible trick on Tonaxia's friends, who now struggle, trapped in the bellies of the fearsome leaf-eating gapemaw plants. To rescue them from a sticky fate, first make for Larkscall and collect sap from deepwood saplings.","You have secured three phials of sap, the sweet scent of which will cause the gapemaws' mouths to open. Rescue the trapped sylphs before the digestive process proceeds any further.","You have successfully freed the sylphs, who were drenched in a sticky secretion but fortunately undigested as yet. Inform Tonaxia that her friends are safe.","Tonaxia is beside herself in gratitude at your deed. It would seem that the sylphs are beginning to recognize you as a true friend to their kind."],"objectives":["Obtain sugary sap from deepwood saplings in Larkscall.","Use the sugary sap to free the trapped sylphs from the gapemaw plants.","Report to Tonaxia."],"dialogue":[{"name":"TONAXIA","text":"&lt;sob&gt; Will this one never see this one's dear friends again?"},{"name":"TONAXIA","text":"Walking one! Listen! Touched ones played terrible, terrible trick─tricked scary gapemaws into swallowing this one's friends whole!"},{"name":"TONAXIA","text":"Poor, poor ones. Walking one must save poor ones before they become dinner ones!"},{"name":"TONAXIA","text":"Sweet smell of sap will open gapemaw's big mouth! Walking one, please, save this one's friends from belly of trouble!"},{"name":"TONAXIA","text":"Sweet smell of sap will open gapemaw's big mouth! Walking one, please, save this one's friends from belly of trouble!"},{"name":"SYLPHA","text":"Oh, thank you! Were it not for walking one, this one would have been compost for sure! Tee hee!"},{"name":"SYLPHA","text":"Touched ones will pay for this! This one will have this one's revenge!"},{"name":"SYLPHA","text":"Phew! What a relief. Belly of gapemaw is stinky and smelly. This one suggests walking one stay away."},{"name":"TONAXIA","text":"This one's friends are safe! How can this one ever thank walking one?"},{"name":"TONAXIA","text":"When walking one first came, this one saw only new target for tricks. Now, this one sees a true friend!"}],"reward":{"gil":420,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8797},"reqs":{"beastrank":1,"jobs":[{"lvl":42,"id":34}]}},"partials":[{"type":"npc","id":"1005561","obj":{"i":1005561,"n":"Tonaxia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}