{"quest":{"name":"Milkroot in Moderation","location":"East Shroud","id":66806,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005562,"target":1005562,"genre":37,"journal":["Some of Ponnixia's friends have been enjoying more than their fair share of milkroot.","A pack of sylphs under the influence of particularly potent milkroot is wreaking havoc in Little Solace. Deliver them a solid beating on Ponnixia's behalf, topped off with a splash of spring water to rouse them from their drunken stupor.","The tipsy sylphs have been dealt with, returning peace to Little Solace. Inform Ponnixia that the deed is done.","Ponnixia expresses her thanks for your efforts, along with a hope that her people will learn that milkroot is best enjoyed in moderation."],"objectives":["Search Little Solace for tipsy sylphs, and splash water on them after weakening them.","Report to Ponnixia."],"dialogue":[{"name":"PONNIXIA","text":"As if this one didn't have enough trouble with touched ones! Some of these ones enjoy milkroot and dreamslime a little too much, and are making a mess of these ones' home!"},{"name":"PONNIXIA","text":"Tipsy ones will not listen to this one, but will listen to a good bashing and splashing─this one knows. Walking one will help, yes?"},{"name":"PONNIXIA","text":"Tipsy ones stagger and stumble around Little Solace in drunken stupor. If walking one hears strange babbling and smells strange stink, that means tipsy one is just around the corner!"},{"name":"PONNIXIA","text":"Friendly one must find tipsy ones, give tipsy ones good bashing and splashing!"},{"name":"PONNIXIA","text":"If walking one hears strange babbling and smells strange stink, that means tipsy one is just around the corner!"},{"name":"SYLPHENEMY","text":"That'sh the best─hic!─milkroot thish one's ever had."},{"name":"SYLPHENEMY","text":"Thish one'sh a mossy one! Mossy one comin'─hic!─through!"},{"name":"SYLPHENEMY","text":"Thish one feels─hic!─ill."},{"name":"PONNIXIA","text":"This one has no end of gratitude for friendly one. This one hopes tipsy ones have learned a lesson: too much milkroot makes crazy one out of any one."},{"name":"POP","text":"A half-crazed sylph staggers drunkenly in your direction!"},{"name":"POP","text":"The enemy is still about!"}],"reward":{"gil":600,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9315},"reqs":{"beastrank":2,"jobs":[{"lvl":45,"id":34}]}},"partials":[{"type":"npc","id":"1005562","obj":{"i":1005562,"n":"Ponnixia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}