{"quest":{"name":"Something to Sneeze At","location":"East Shroud","id":66807,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005562,"target":1005562,"involved":[1008334],"genre":37,"journal":["Ponnixia fears for the safety of the forest.","Explosives strewn about Larkscall by the malevolent sylphs of the Sylphlands threaten the safety of all who call the forest home, and only the formidable team of adventurer and goobbue can set things right. Speak to the amiable sylph in Larkscall and mount the great beast.","Few experiences are as exhilarating as a romp through the forest on goobbueback. But this is no time for idle recreation─employ the goobbue's sneeze to fling the sylphmade bombs into oblivion.","Thanks to the efforts of you and your oversized friend, Larkscall is safe once more. Inform Ponnixia that all is well.","Ponnixia is deeply grateful for your efforts on behalf of her people. She also envies your goobbue ride, expressing a desire to visit Larkscall in the near future so she might enjoy the same."],"objectives":["Speak with the amiable sylph in Larkscall and mount the goobbue.","Use your mount's Big Sneeze to destroy the bombs scattered about the Sylphlands.","Report to Ponnixia."],"dialogue":[{"name":"PONNIXIA","text":"Touched ones grow more dangerous by the day! What are these ones to do?"},{"name":"PONNIXIA","text":"This one saw touched ones setting blast-bombs in Larkscall! Can friendly one believe it?"},{"name":"PONNIXIA","text":"In seeking to protect the forest, touched ones only destroy it. This one weeps."},{"name":"PONNIXIA","text":"But tears will not save these ones' home. These ones must turn to our friends, mossy ones. Brave one is also friend to mossy ones, yes?"},{"name":"PONNIXIA","text":"Mossy ones' <span class=\"emphasis\">ka-choo</span> will blow touched ones' blast-bombs away. Amiable one in Larkscall knows friendly mossy one with big <span class=\"emphasis\">ka-choo</span>. Brave one will make friends with that one, yes?"},{"name":"PONNIXIA","text":"Mossy ones' <span class=\"emphasis\">ka-choo</span> will blow touched ones' blast-bombs away. Amiable one in Larkscall knows friendly mossy one with big <span class=\"emphasis\">ka-choo</span>. Brave one will make friends with that one, yes?"},{"name":"NYXIA","text":"Ah, has friendly one come back to play with mossy one? Both ones are glad, this one and mossy one."},{"name":"NYXIA","text":"Touched ones have brought blast-bombs!? How frightful! Friendly one must be careful."},{"name":"NYXIA","text":"If walking one falls from mossy one, walking one should return to this one. Walking one will be riding one again."},{"name":"NYXIA","text":"Ah, has friendly one come back to play with mossy one? Both ones are glad, this one and mossy one."},{"name":"NYXIA","text":"Touched ones have brought blast-bombs!? How frightful! Please be careful, friendly one. This one could not bear to see this one's friend hurt."},{"name":"NYXIA","text":"(-Amiable Sylph-)Mossy one may look scary, but mossy one has gentle heart...until mossy one sees some one hurt mossy one's home. Then mossy one gets angry. Trust this one─no one wants to see mossy one angry."},{"name":"SYLPHENEMY","text":"These ones have angered mossy one! These ones must flee!"},{"name":"SYLPHENEMY","text":"Our blast-bombs! Meddling one will pay for this!"},{"name":"PONNIXIA","text":"Brave one and mossy one <span class=\"emphasis\">ka-choo</span>ed the blast-bombs out of Larkscall? Brave one is a true friend to the forest."},{"name":"PONNIXIA","text":"This one misses playing with mossy one. Perhaps next time, this one will go oneself!"}],"reward":{"gil":600,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9315},"reqs":{"beastrank":2,"jobs":[{"lvl":45,"id":34}]}},"partials":[{"type":"npc","id":"1005562","obj":{"i":1005562,"n":"Ponnixia","l":55,"q":10}},{"type":"npc","id":"1008334","obj":{"i":1008334,"n":"Amiable Sylph","l":55,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}