{"quest":{"name":"Shocking Developments","location":"East Shroud","id":66808,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005562,"target":1005562,"genre":37,"journal":["Ponnixia wears a disgusted expression on her face.","Ponnixia relates how the giant sporeshooter in the Sylphlands, crafted long ago to purify the forest air, has been modified by the touched sylphs to expel poisonous fumes, and bids you to restore the device to its original benign state. First, use the scalebombs she has provided you to destroy the lightning rods that are generating the sporeshooter's power.","You have succeeded in destroying the lightning rods that were powering the sporeshooter. Use the spring water to purify the crystal housed within.","Thanks to your efforts, the air of the Sylphlands has been restored to its original pristine state. Share tidings of your triumph with Ponnixia.","Ponnixia takes in the fresh air and thanks you profusely for your efforts. The sylphs of Little Solace clearly consider you a valuable ally, and will continue to rely on your protection."],"objectives":["Destroy lightning channelers with scalebombs.","Pour spring water on the tainted crystal.","Report to Ponnixia."],"dialogue":[{"name":"PONNIXIA","text":"This one cries for the forest. Long ago, the great sporeshooter in the Sylphlands spit out cleansing spores that kept the air of these ones' home pure and pristine."},{"name":"PONNIXIA","text":"That was until touched ones worked nastiness, placed sick-making thing inside. Now sporeshooter spits out clouds of sickspores that make these ones choke and gag."},{"name":"PONNIXIA","text":"But did touched ones stop there? Of course not! Touched ones use power of flash and boom to make sporeshooter spit out slews of sick-making spores. Those ones' mischief must be stopped before the whole forest shrivels and dies."},{"name":"PONNIXIA","text":"This one will give brave one scalebombs. First, friendly one must take these and make flashboom sticks go boom."},{"name":"PONNIXIA","text":"Then, brave one must remove sick-making thing from sporeshooter. Friendly one should pour clean water on shiny one inside, till it shines clear again."},{"name":"PONNIXIA","text":"Brave one does all this, sporeshooter will stop spreading sickness. Only then can these ones breathe easy again."},{"name":"PONNIXIA","text":"Friendly one must take scalebombs this one made and make flashboom sticks go boom."},{"name":"PONNIXIA","text":"Then, brave one must pour clean water on shiny one inside, remove sick-making thing from sporeshooter. Only then can these ones breathe easy again."},{"name":"PONNIXIA","text":"Brave one need not say a word. Yes, a single breath tells all this one needs to know!"},{"name":"PONNIXIA","text":"Ahhh! Thanks to brave one, nastiness is gone, and the forest once again smells of fresh leaves and flowers. This one is forever in brave one's debt."},{"name":"SYSTEM","text":"The poisonous spores disperse and the air around you clears!"}],"reward":{"gil":600,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9315},"reqs":{"beastrank":2,"jobs":[{"lvl":45,"id":34}]}},"partials":[{"type":"npc","id":"1005562","obj":{"i":1005562,"n":"Ponnixia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}