{"quest":{"name":"I Dream of Slimy","location":"East Shroud","id":66804,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005562,"target":1005562,"genre":37,"journal":["Ponnixia just wants to take her mind off her troubles.","Ponnixia is finding fun to be elusive in recent days, and seeks to acquire dreamslime to enhance the potency of her beloved milkroot. Unfortunately, the much sought-after substance is being monopolized by selfish touched ones. Acquire four phials of dreamtoad ooze, either straight from the source or from the inebriated sylphs who are already partaking in its pleasures.","You have obtained four phials of the unsightly yet highly treasured ooze. Deliver the goods to Ponnixia.","Ponnixia's eyes light up at the sight of the ooze. While the potent milkroot concoction will not resolve the many troubles that her people face, it will at least serve to return smiles to their faces."],"objectives":["Defeat dreamtoads or sylpheed sighs to obtain phials of dreamtoad ooze.","Deliver the phials of dreamtoad ooze to Ponnixia."],"dialogue":[{"name":"PONNIXIA","text":"Does walking one know what these ones love even more than milkroot? Milkroot mixed with dreamslime! Dreamslime makes milkroot thrice as fun, tee hee!"},{"name":"PONNIXIA","text":"But this one isn't having much fun today. Why? Because touched ones are herding slimy ones and hoarding all the dreamslime!"},{"name":"PONNIXIA","text":"Walking one must punish touched ones and steal dreamslime─teach touched ones not to be greedy ones!"},{"name":"PONNIXIA","text":"...Or just find slimy one and bring dreamslime to this one, so this one can forget one's worries."},{"name":"PONNIXIA","text":"Touched ones are herding slimy ones and hoarding all the dreamslime! Walking one must teach touched ones not to be greedy ones. Or just find slimy one and bring dreamslime to this one, so this one can forget one's worries."},{"name":"PONNIXIA","text":"This one is having no fun, no fun at all! Did friendly one find dreamslime for this one?"},{"name":"PONNIXIA","text":"Friendly one brings dreamslime! At long last, this one can be smiling one again!"},{"name":"PONNIXIA","text":"These ones have many worries these days. Without milkroot and dreamslime, these ones would be frowning and brooding ones, and what would be the fun in that? Tee hee!"}],"reward":{"gil":600,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9315},"reqs":{"beastrank":2,"jobs":[{"lvl":45,"id":34}]}},"partials":[{"type":"npc","id":"1005562","obj":{"i":1005562,"n":"Ponnixia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}