{"quest":{"name":"The Magitek Menace","location":"East Shroud","id":66800,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005561,"target":1005561,"genre":37,"usedItems":[7002],"journal":["Tonaxia is in dire need of an adventurer's aid.","The continued presence of the Garlean Empire in the forest has Tonaxia and her fellow sylphs fearing for their lives. Participate in the FATE “A Wrench in the Works” in east Larkscall, then deliver proof of your triumph to Tonaxia to put the poor sylph's heart at ease.","Tonaxia is profoundly impressed by your triumph over imperial technology, and appears eager to share tidings of your triumph with all in Little Solace. The sylphs cannot rest easy yet, however, and would be greatly heartened were you to sojourn among them a while longer."],"objectives":["Participate in the FATE “A Wrench in the Works” and return with proof of your triumph."],"dialogue":[{"name":"TONAXIA","text":"Friendly one, please! These ones are in terrible, terrible danger!"},{"name":"TONAXIA","text":"This one's friends saw steel ones in the forest! Saw giant, spiky ones ripping trees out of the ground! Those ones barely escaped alive!"},{"name":"TONAXIA","text":"The forest is not safe for these ones with spiky ones crashing and smashing, and there is nothing this one can do."},{"name":"TONAXIA","text":"Friendly one is strong one, yes? Friendly one must smash spiky one, make spiky one go away."},{"name":"TONAXIA","text":"Friendly one will do this, yes? Bring back piece of spiky one, let these ones know that there is nothing to fear."},{"name":"TONAXIA","text":"This one hears no more crashing and bashing. Does this one dare to dream?"},{"name":"TONAXIA","text":"What is this? Friendly one smashed spiky one into bits and pieces?"},{"name":"TONAXIA","text":"This one is in awe of friendly one's strength! This one must show this to all these ones, let all know that friendly one is hero to these ones!"}],"reward":{"gil":420,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8797},"reqs":{"beastrank":1,"jobs":[{"lvl":42,"id":34}]}},"partials":[{"type":"npc","id":"1005561","obj":{"i":1005561,"n":"Tonaxia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"7002","obj":{"i":7002,"n":"Proto Armor Identification Key","l":1,"c":26014,"t":61}}]}