{"quest":{"name":"Fungal Foulness","location":"East Shroud","id":66812,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005562,"target":1005562,"genre":37,"journal":["Ponnixia has a dirty job, but some one has to do it.","Malicious sylphs are polluting the Sylphlands with a particularly unpleasant strain of the banestool, bringing considerable harm to the local flora and fauna. Slay two of the foul fungi to stave off further contamination of the forest.","The greater banestools will stink up the Sylphlands no more. Ponnixia will be pleased to hear of your success.","Ponnixia appreciates your efforts in making the forest a more desirable place for her and her people to reside. She thanks you for your services and urges you to stay close by should she again require your aid."],"objectives":["Slay greater banestools.","Report to Ponnixia."],"dialogue":[{"name":"PONNIXIA","text":"&lt;sigh&gt; Touched ones are making a stink again, planting stink-spores across the Sylphlands."},{"name":"PONNIXIA","text":"The stink spreads, trees wither and die, and these ones' forest friends turn sick and angry. If some one does not put a stop to this, the forest will soon be uninhabitable by any one."},{"name":"PONNIXIA","text":"Brave one must slice up stink-spores and save the forest from a foul fate!"},{"name":"PONNIXIA","text":"But brave one must be wary! Wherever stink-spores go, planting ones and stink-crazed creatures are sure to follow."},{"name":"PONNIXIA","text":"Brave one must slice up stink-spores and save the forest from a foul fate!"},{"name":"PONNIXIA","text":"But brave one must be wary! Wherever stink-spores go, planting ones and stink-crazed creatures are sure to follow."},{"name":"PONNIXIA","text":"These ones thank you, brave one. Since brave one arrived here, the dark cloud hanging over the Sylphlands has begun to lift, little by little."},{"name":"PONNIXIA","text":"...But there is still much work to be done. Pray do not abandon these ones, brave one."}],"reward":{"gil":600,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9315},"reqs":{"beastrank":2,"jobs":[{"lvl":45,"id":34}]}},"partials":[{"type":"npc","id":"1005562","obj":{"i":1005562,"n":"Ponnixia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}