{"quest":{"name":"No Root for You","location":"East Shroud","id":66816,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005563,"target":1005563,"involved":[1008310,1008311,1008312,1008313,1008422,1008423,1008424],"genre":37,"journal":["Moxia's wings are aflutter with unease.","The ever-scheming sylphs of the Sylphlands are using their transformation magic to disguise themselves as influential Gridanians, with the intent of spreading malicious rumors about Little Solace and its inhabitants. See to it that the falsehoods die before they reach the ears of the populace.","The impostors have been revealed for what they are and dealt with accordingly. Assure Moxia that no ill rumors regarding her kind will be spread in Gridania.","Though appreciative of your efforts, Moxia fears that the schemes of her malicious kinsmen will only grow more treacherous in the future. The sylphs of Little Solace continue to depend on your bravery and kindness."],"objectives":["Throw suresight scalebombs at the suspicious Gridanians and slay hostile sylphs.","Report to Moxia."],"dialogue":[{"name":"MOXIA","text":"Touched ones have played many pranks on these ones before, but this is the nastiest one yet!"},{"name":"MOXIA","text":"Brave one, please listen! This one heard that touched ones are using skin-changing spell and disguising ones' selves as walking ones!"},{"name":"MOXIA","text":"Skin-changed ones will go to Gridania and say terrible, awful things about these ones!"},{"name":"MOXIA","text":"Brave one has used see-boom before, yes? Brave one must unmask touched ones before army of walking ones turns pointy-sticks against these ones!"},{"name":"MOXIA","text":"Brave one has used see-boom before, yes? Brave one must unmask touched ones before army of walking ones turns pointy-sticks against these ones!"},{"name":"SYLPHVORSAILE","text":"Well met, adventuring one! In the name of the Order of the Twin Adder, I command you to raze the miserable settlement of Little Solace to the ground and slay every last one of the insufferable sylphs who reside there. This one will reward you well for your services!"},{"name":"SYLPHDOORMANLOTUS","text":"The Elder Seedseer is convinced that all the perils facing Gridania are the doing of those horrible sylphs of Little Solace. May this one show you in?"},{"name":"SYLPHBEATINE","text":"Undamaged lumber is in short supply these days, thanks to the mischief of those nasty beastmen from Little Solace! How will we keep up the buildings of our nation? This one daresays that the sylphs of Little Solace are Gridania's true enemy."},{"name":"SYLPHGEVA","text":"Yes, there's no material so light and durable as sylph hide! What's more, there are so many of the damned critters that one need not worry about letting a square here or there go to waste. Adventurer! Go to Little Solace and bring me back, oh, four score or so, or this one will turn you into a subligar!"},{"name":"SYLPHFUFUCHA","text":"Why, just the other day, the sylphs of Little Solace tore up a whole bed of vegetables and left them to rot at the guild's doorstep. They will not be content until our people go starving, this one is certain."},{"name":"SYLPHMAISENTA","text":"Bah! This one's entire stock of goods was stolen by those nasty sylphs from Little Solace! Won't adventuring one go slaughter the lot of those ones?"},{"name":"SYLPHNICOLIAUX","text":"Oh, an adventurer! Listen, a friend of mine left two days ago for Little Solace and never returned. I'll wager it's those sylphs who did him in. They may look harmless, but they're not to be trusted, I tell you!"},{"name":"SYLPHENEMY","text":"Bah! Meddling one will pay for this!"},{"name":"SYLPHENEMY","text":"This one is angry now!"},{"name":"SYLPHENEMY","text":"Walking one will regret this day!"},{"name":"SYLPHENEMY","text":"This one will pluck seeing one's eyes out!"},{"name":"MOXIA","text":"Oh, thank you, brave one! This one is most relieved to be spared the brunt of touched ones' false talk."},{"name":"MOXIA","text":"Yet this one fears that these ones have not seen the last of it. This one shudders to think at how sneaky ones will employ sneaky magicks next."},{"name":"POP","text":"The impostor's true identity is revealed!"},{"name":"RECTERROR","text":"The enemy is still about!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21075},{"id":5677,"one":1},{"id":5682,"one":1},{"id":5717,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005563","obj":{"i":1005563,"n":"Moxia","l":55,"q":10}},{"type":"npc","id":"1008310","obj":{"i":1008310,"n":"Vorsaile Heuloix","l":55,"q":1,"t":"Shifty Commander"}},{"type":"npc","id":"1008311","obj":{"i":1008311,"n":"Shifty Conjurer","l":55,"q":1}},{"type":"npc","id":"1008312","obj":{"i":1008312,"n":"Shifty Carpenter","l":55,"q":1}},{"type":"npc","id":"1008313","obj":{"i":1008313,"n":"Shifty Leatherworker","l":55,"q":1}},{"type":"npc","id":"1008422","obj":{"i":1008422,"n":"Shifty Botanist","l":55,"q":1}},{"type":"npc","id":"1008423","obj":{"i":1008423,"n":"Shifty Merchant","l":55,"q":1}},{"type":"npc","id":"1008424","obj":{"i":1008424,"n":"Shifty Youngling","l":55,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21075","obj":{"i":21075,"n":"Sylphic Goldleaf","l":1,"c":65051,"t":100}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}}]}