{"quest":{"name":"Ripe for the Picking","location":"East Shroud","id":66813,"patch":2.1,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005563,"target":1005563,"genre":37,"journal":["Moxia believes milkroot is best used in moderation.","Moxia fears that excessive consumption of milkroot by the sylphs of the Sylphlands is contributing to their descent into madness. Get at the root of the problem by chopping down milkroot clusters or milkroot saplings, and harvest six bundles of fresh milkroot to prevent the substance from falling into the hands of those who would misuse it.","You have harvested six bundles of fresh milkroot, decimating the naughty ones' supply in the process. Deliver your haul to Moxia.","Moxia thanks you profusely for the milkroot, praising its exceptional freshness while giving nary a mention of her original aim in sending you to harvest it. For all her talk of moderation, it is evident that Moxia rather enjoys the root herself. Though it may not be the adventurer's place to begrudge the beleaguered sylph the occasional moment of levity, one can only hope that she knows when to say when."],"objectives":["Slay milkroot saplings or milkroot clusters and obtain fresh milkroot.","Deliver the fresh milkroot to Moxia."],"dialogue":[{"name":"MOXIA","text":"This one enjoys milkroot as much as any one. But naughty ones...some naughty ones enjoy milkroot a little too much. Turns naughty ones' minds to muck."},{"name":"MOXIA","text":"Those ones forget once being like these ones, and become naughtier and naughtier. These ones' words no longer reach naughty ones."},{"name":"MOXIA","text":"So these ones must cut this problem off at the─tee hee─root! Harvest milkroot before it falls into naughty ones' hands."},{"name":"MOXIA","text":"Naughty ones' favorite milkroot comes from sappy ones and cluster ones. Brave one has seen those ones, yes? Brave one must bring back six bundles of the freshest, milkiest milkroot─just so this one knows the job is done. Tee hee hee!"},{"name":"MOXIA","text":"Brave one will chop down saplings and clusters, yes? Brave one will bring back six bundles of milkiest milkroot? This one will be waiting with wings aflutter. Tee hee hee!"},{"name":"MOXIA","text":"&lt;sniff&gt; &lt;sniff&gt; ...Does brave one have something for this one?"},{"name":"MOXIA","text":"&lt;sniff&gt; What lovely, milky milkroot! Tee hee! Yes... &lt;sniff&gt; ...This is the milky-wilky-milkiest milk-woot this one has ever milky-wilkied! Tee hee hee!"},{"name":"MOXIA","text":"Naughty ones...? &lt;sniff&gt; Is brave one a naughty one? This one can be naughty, too, tee hee!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21075},{"id":5672,"one":1},{"id":5682,"one":1},{"id":5717,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005563","obj":{"i":1005563,"n":"Moxia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21075","obj":{"i":21075,"n":"Sylphic Goldleaf","l":1,"c":65051,"t":100}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}}]}