{"quest":{"name":"A Horse for Heavensturn","location":"Gridania","id":66828,"patch":2.1,"sort":19,"icon":100195,"eventIcon":71221,"issuer":1005706,"target":1005657,"genre":194,"journal":["The season of Heavensturn has come, and Damaris would tell you of a madcap visitor.<br>※This quest is available for a limited time only.","Damaris informs you that Heavensturn celebrates the changing of the guard among the Twelve─as if any Eorzean of your age would not know such a thing! The conversation was not without profit, however. Enter Mih Khetto's Amphitheatre and receive a souvenir from a certain uma bugyo from the Far East.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You learn that the Easterlings choose a totemic animal for every Heavensturn, and this turn is presided over by something they call the “horse.” A land almost beyond imagining is the East, where mounts <span class=\"emphasis\">neigh</span>, not <span class=\"emphasis\">kweh</span>. The uma bugyo presents you with a horse helm and bids you show the good folk of Gridania, Limsa Lominsa, and Ul'dah the spirit of this animal. No opportunity for professional development is unwelcome to the intrepid adventurer. Embrace your inner horse, or die in the attempt."],"objectives":["Speak with the uma bugyo."],"dialogue":[{"name":"DAMARIS","text":"You would know more about Mih Khetto's Amphitheatre? An adventurer with some culture, I see! This, my dear <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, is where we celebrate Heavensturn."},{"name":"DAMARIS","text":"All is change in this world, and not even the influence of the Twelve remains constant. Who will wax to gain the ascendant position over the other eleven? We shall learn the answer at Heavensturn."},{"name":"DAMARIS","text":"Surely, a rolling stone such as yourself understands the import of this occasion?"},{"name":"DAMARIS","text":"I can see that you do. Marvelous! My heart warms towards you─why not enter the amphitheatre? Have yourself a souvenir of this Heavensturn!"},{"name":"DAMARIS","text":"What is it? Oh, a helm from the Far East. They <span class=\"emphasis\">will</span> send these curious tokens of friendship, those Easterlings."},{"name":"DAMARIS","text":"One of them is in there right now, and she cuts a figure most...unusual. For the love of the Twelve, don't <span class=\"emphasis\">laugh</span>, my dear <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. Or if you must, do it discreetly."},{"name":"HORSEMISSIONARY","text":"In honor and glory do we first lay eyes upon one another. I am that which the betters and worse alike call the uma bugyo, come from the Far East to tend to the fire of friendship with your Eorzea."},{"name":"HORSEMISSIONARY","text":"I see that your eyes wander in wonder to this artful helm! Well and good is your penchant in such matters, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. The selfsame kabuto you shall have."},{"name":"HORSEMISSIONARY","text":"See you the lines of this kabuto, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>? Strange it seems to your Eorzean eyes, but no Easterner would fail to recognize it as the <span class=\"emphasis\">horse</span>, the totem of this coming turn. Proper and customary it is for us of the Far East to choose a totem before every Heavensturn."},{"name":"HORSEMISSIONARY","text":"Now hear me, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and hear me well, lest wonder quickly curdle to derision, as is wont to do with Eorzeans."},{"name":"HORSEMISSIONARY","text":"Hoof to neigh, Eorzea knows not the horse for one reason and one reason only: the horsebird. I speak of that which the slow- and the quick-tongued alike call <span class=\"emphasis\">chocobo</span> in your parlance."},{"name":"HORSEMISSIONARY","text":"The lay of your lands, the cut of your climes, the plumpness of your posterior─the horsebird was admirably suited to Eorzea in every way. But <span class=\"emphasis\">was</span> and <span class=\"emphasis\">is</span> are no more alike than a man bedded and a man wedded, as we say in the Far East."},{"name":"HORSEMISSIONARY","text":"The scent of knowledge is on you, adventuring one, and so it needs but a mention that much has changed in Eorzea. The East would bring the horse to water if Eorzea is ready to drink, if <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span> takes my mixed meaning."},{"name":"HORSEMISSIONARY","text":"Truly and secretly, 'twas my mission to begin the horsing of your fair lands. When the new totem proved the horse, it seemed the Twelve smiled upon us; for even in Eorzea, minds arch high and wide during Heavensturn..."},{"name":"HORSEMISSIONARY","text":"Yet I am stymied, for the laws of your woods say no horse may enter the Black Shroud! If my faithful steed is not to present his noble self, how will Eorzeans know the beauty of the horse?"},{"name":"HORSEMISSIONARY","text":"Assuredly and absurdly, you must be the answer to my prayers. Else, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, I must return to the Far East empty-handed!"},{"name":"HORSEMISSIONARY","text":"No horse may enter the Black Shroud, but an adventurer may. Clear and clandestine is our way─<span class=\"emphasis\">you</span>, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, must don the kabuto and be the horse!"},{"name":"Q1","text":"Embrace your inner horse?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"HORSEMISSIONARY","text":"Nay is but a hoofbeat away from neigh! <span class=\"alternative-container\"><span class=\"alternative\">You are no defeated nag but a high-spirited mare.</span><span class=\"alternative\">Are you a stallion or a gelding?</span></span>"},{"name":"HORSEMISSIONARY","text":"In humility and jocundity do I receive your assent. Don the kabuto, then, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and aid our yoriki three in Gridania, Limsa Lominsa, and Ul'dah."},{"name":"HORSEMISSIONARY","text":"No mere mummery, this that you do, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. You must embrace the equine if the noble horse is to ever canter alongside the strange and off-putting horsebird throughout the breadth of Eorzea."}],"reward":{"items":[{"id":6964}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66829,66830,66831,66832]},"partials":[{"type":"npc","id":"1005706","obj":{"i":1005706,"n":"Damaris","l":53,"q":1}},{"type":"npc","id":"1005657","obj":{"i":1005657,"n":"Uma Bugyo","l":53,"q":2,"t":"Far Eastern Envoy"}},{"type":"item","id":"6964","obj":{"i":6964,"n":"Uma Kabuto","l":1,"c":40139,"t":34,"p":71}},{"type":"quest","id":"66829","obj":{"i":66829,"n":"Turn Around, Beautiful","g":194,"l":"Gridania","s":20}},{"type":"quest","id":"66830","obj":{"i":66830,"n":"Heavens Know You're Fast","g":194,"l":"Ul'dah","s":21}},{"type":"quest","id":"66831","obj":{"i":66831,"n":"Heavenly Power","g":194,"l":"Limsa Lominsa","s":22}},{"type":"quest","id":"66832","obj":{"i":66832,"n":"Thank Heavensturn for You","g":194,"l":"Gridania","s":23}}]}