{"quest":{"name":"Breaking Brick Mountains","location":"Ul'dah","id":66824,"patch":2.1,"sort":18,"icon":100194,"eventIcon":71221,"issuer":1005532,"target":1005533,"genre":207,"journal":["Havak Alvak, an editorialist for the <span class=\"emphasis\">Mythril Eye</span> in Ul'dah, has word of an opportunity for an intrepid adventurer.<br>※This quest is available for a limited time only.","The appearance of golems of unknown geological composition has spurred Amajina & Sons Mineral Concern into hiring a competent adventurer to assess the potential for profit. Meet with the company's representative outside Arrzaneth Ossuary to discuss the nature of your employment.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","According to the Amajina & Sons representative, the unusual golems can be found lumbering about in every corner of Eorzea. Obtain a chunk of one of the blocky constructs by participating in the FATE “Brick by Brick,” followed by the FATE “Brick by Stone Brick” or “Brick by Gold Brick” in one of the following locations: the Sil'dih Excavation Site in central Thanalan; the south of Blind Iron Mines in lower La Noscea; the east of Bronze Lake in upper La Noscea; Spirithold in the Central Shroud; or the south of Finders' Bluff in the North Shroud.","You have obtained a sample of one of the mysterious golems. Return to Arrzaneth Ossuary and deliver it to the waiting Amajina & Sons representative.","You have delivered a piece of one of the lumbering constructs to the Concern's representative. As promised, the ladies of Amajina & Sons treat you to a uniquely refreshing reward."],"objectives":["Speak with the beefy businessman.","Participate in the FATE “Brick by Brick,” followed by the FATE “Brick by Stone Brick” or “Brick by Gold Brick” to obtain a chunk of brickman.","Deliver the chunk of brickman to the beefy businessman."],"dialogue":[{"name":"HAVAKALVAK","text":"I am Havak Alvak, a self-styled student of sundry subjects. Though I am best known, perhaps, for putting pen to parchment for a popular paper, the <span class=\"emphasis\">Mythril Eye</span>."},{"name":"HAVAKALVAK","text":"In these times of trials and tribulations, a subject of singular strangeness has ensnared my senses─magical monstrosities, more commonly known as “golems.”"},{"name":"HAVAKALVAK","text":"But I speak now of no common creation of magecraft. No, these shambling servants of stone have no equivalent in all of Eorzea."},{"name":"HAVAKALVAK","text":"Should these curious constructions contain ores of extraordinary origin...well, I can only imagine the influence it might exert over Ul'dah's economy."},{"name":"HAVAKALVAK","text":"Amajina & Sons Mineral Concern has come to a congruent conclusion, and its superiors seek a savvy adventurer to separate the facts from the fantastic."},{"name":"HAVAKALVAK","text":"A representative of Amajina & Sons awaits outside Arrzaneth Ossuary. If exploring this enigma seems an entertaining endeavor, then I would wander over before this window of opportunity is wasted!"},{"name":"RESEARCHER","text":"Hey! Don't sneak up on me like that! Are ye tryin' to make me soil me breeches!?"},{"name":"RESEARCHER","text":"Hm? Yer here for the job, are ye? Well, I hope ye've experience dismantlin' golems."},{"name":"RESEARCHER","text":"We've been gatherin' reports o' some never-afore-seen constructs what've begun showin' up all over the damn realm."},{"name":"RESEARCHER","text":"Nary a soul knows what the creatures are made of, so Amajina & Sons means to be the first to take a pickaxe to this mystery mother lode!"},{"name":"RESEARCHER","text":"I need ye to get out there, take apart one o' them shamblin' piles o' bricks, an' bring me back a good size chunk o' the remainin' rubble. What do ye say, eh? Will ye give it a shot?"},{"name":"CHOICE1Q1","text":"Give it a shot?"},{"name":"CHOICE1A1","text":"Yes"},{"name":"CHOICE1A2","text":"No"},{"name":"RESEARCHER","text":"No!? Surely, ye can't pass up this once-in-a-lifetime chance!"},{"name":"RESEARCHER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! I'll have a nice “refreshing” reward for ye when ye get back!"},{"name":"RESEARCHER","text":"Have ye taken a sample of one o' them odd golems?"},{"name":"RESEARCHER","text":"Ooh, now ain't that special! That luster... That shine..."},{"name":"RESEARCHER","text":"Can ye smell it? 'Tis the scent o' profit, my friend!"},{"name":"RESEARCHER","text":"That's some fine work ye did, adventurer. Very fine, indeed."},{"name":"RESEARCHER","text":"Now, just as I promised ye, I've prepared a payment yer sure to enjoy!"},{"name":"RESEARCHER","text":"Don't be shy now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. We all need a bit o' <span class=\"emphasis\">pamperin'</span> from time to time!"},{"name":"PAFUPAFUA","text":"Ah, bonjour, <span class=\"alternative-container\"><span class=\"alternative\">my lovely</span><span class=\"alternative\">'ansome</span></span>."},{"name":"PAFUPAFUA","text":"Can we interest you in ze...'ow can I say? Puff-puff?"},{"name":"PAFUPAFUB","text":"Zis way! We show you a good time!"},{"name":"PAFUPAFUC","text":"It will not 'urt, I promise!"},{"name":"CHOICE1Q1","text":"How do you respond?"},{"name":"CHOICE1A1","text":"&lt;gulp&gt; ..."},{"name":"CHOICE1A2","text":"Puff-puff away!"},{"name":"CHOICE1A3","text":"..."},{"name":"PAFUPAFUB","text":"Ah, oui, just relax!"},{"name":"PAFUPAFUA","text":"You will 'ave twice ze fun with ze eyes closed!"},{"name":"PAFUPAFUA","text":"(-Slinky Associate-)Brace yourself! 'Ere it comes!"},{"name":"PAFUPAFUALL","text":"(-Associates-)Puff, puff!<br>Puff-puff! Puff-puff!"},{"name":"PAFUPAFUA","text":"(-Associate-)'Ave you ever felt anything so warm and soft? Just relax and enjoy."},{"name":"PAFUPAFUALL","text":"(-Associates-)Puff, puff!<br>Puff-puff! Puff-puff!"},{"name":"PAFUPAFUC","text":"Feels good, doesn't it? We sometimes indulge in a bit of ze puff-puff ourselves!"},{"name":"RESEARCHER","text":"Me thanks again for yer cooperation, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Here's a little somethin' extra what ain't so...fleetin'."},{"name":"RESEARCHER","text":"Au revoir! Er, I mean... &lt;cough&gt; 'Twas good meetin' ye. Look forward to doin' business with ye again sometime!"},{"name":"HAVAKALVAK","text":"Ah, the adventurer! You were triumphant in your tussle against the towering titans, I trust?"},{"name":"HAVAKALVAK","text":"As it so happens, I have been hired by Amajina & Sons to craft an account of the aforementioned anomaly. I'd best begin before the focus on these fantastical foes falls out of fashion."},{"name":"HAVAKALVAK","text":"My remuneration is promised to be most “refreshing” and perhaps a touch “risqué.” I fear I haven't an inkling as to what is implied, but I shall look forward to it, nonetheless!"}],"reward":{"items":[{"id":6985},{"id":6112}],"xp":1120},"reqs":{"jobs":[{"lvl":7,"id":1}]}},"partials":[{"type":"npc","id":"1005532","obj":{"i":1005532,"n":"Havak Alvak","l":40,"q":1}},{"type":"npc","id":"1005533","obj":{"i":1005533,"n":"Beefy Businessman","l":40,"q":1}},{"type":"item","id":"6985","obj":{"i":6985,"n":"Wind-up Brickman","l":1,"c":59455,"t":81}},{"type":"item","id":"6112","obj":{"i":6112,"n":"Thug's Mug","l":10,"c":40138,"t":34}}]}