{"quest":{"name":"Turn Around, Beautiful","location":"Gridania","id":66829,"patch":2.1,"sort":20,"icon":100196,"eventIcon":71221,"issuer":1005658,"target":1005658,"genre":194,"usedItems":[6964],"journal":["The golden uma yoriki seeks help sharing the joy of horses with a singularly unappreciative audience.<br>※This quest is available for a limited time only.","The golden uma yoriki would like to advertise the beauty of horses. Wear the uma kabuto and seek out his confederate, the golden uma doshin, at Bentbranch Meadows.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The uma doshin would have you do your utmost to prove that horses are more beautiful than chocobos. With your equine head held high, proudly strut into the Moogle's Gift Mounts stables within Bentbranch Meadows and strike a /pose.","Your provocative pose has set the chocobos kweh-ing. Speak with the chocobokeep without losing hold of your inner horse.","You have successfully maneuvered the chocobokeep into praising the beauty of horses. See that your kabuto is at a rakish angle and report to the golden uma doshin.","You have told the doshin that the chocobos are upset. He bids you show the beauty of a horse's nature by donning the kabuto and rousing the nervous birds with a spirited /rally.","Your rallying has been met with much avian excitement. With the kabuto on, speak with the doshin.","Clearly moved by your horsey antics, the doshin has rewarded you with a carrot. Take this proof of success to the golden uma yoriki back in Mih Khetto's Amphitheatre in Gridania.","His mien much thawed, the yoriki presents you with the golden uma kabuto. Gridanians have had their first taste of the beauty of horses. After you have performed the same act for both Limsa Lominsa and Ul'dah, report your success to the uma bugyo."],"objectives":["While wearing the kabuto, speak with the golden uma doshin at Bentbranch Meadows.","While wearing the kabuto, strike a /pose within Moogle's Gift Mounts.","While wearing the kabuto, speak with the chocobokeep.","While wearing the kabuto, speak with the golden uma doshin.","While wearing the kabuto, perform a /rally within Moogle's Gift Mounts.","While wearing the kabuto, speak with the golden uma doshin.","Deliver the carrot to the golden uma yoriki in Gridania."],"dialogue":[{"name":"YELLOWGENERAL","text":"An adventurer of this unkind land who would embrace the horse and assist us? The uma bugyo is a lady most subtle to find such a one."},{"name":"YELLOWGENERAL","text":"How are things, you ask? Quite bad, thank you. Cold shoulders and colder cabbage soup are our rewards for tireless attempts to show the beauty of the horse to these...these ingrates."},{"name":"YELLOWGENERAL","text":"Are they beautiful? What a question, but no matter. I shall have to fill that gaping void in your sensibility that your begetter so unthinkingly left you with. Yes, the horse is more beautiful than your chocobos, and it falls upon you to prove the point."},{"name":"YELLOWGENERAL","text":"Hm? Can we get this show on the road? Do you mean that you are eager to begin the mission? Very good! Don your kabuto and take yourself to Bentbranch Meadows, where the one who serves me with the heart of a son and strength of a brother will guide you."},{"name":"SUBORDINATEA","text":"Judging from the kabuto, I take it you are on our side? Welcome to Bentbranch Meadows. A foolish name, considering most branches are bent! But then again, I am among fools here."},{"name":"SUBORDINATEA","text":"Yes, fools! They have eyes, but will not meet my gaze. They have ears, but will not listen to my petition. The only things they do use in a manner proper are their legs, with which they scurry away like milk-livered children."},{"name":"SUBORDINATEA","text":"To one of their own kind, though, they must turn their gaze and unstopper their ears. So please, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, strike a <span class=\"highlight\">pose</span> and show these galoots the beauty of the horse!"},{"name":"SUBORDINATEA","text":"I have learned that the way to an Eorzean's single-chambered heart is through the chocobo. If you can show the horse in a light favorable to those overgrown fowls, then perhaps you will succeed where I have not."},{"name":"SUBORDINATEA","text":"But for that, you must sally to where the horsebirds gather, and <span class=\"highlight\">pose</span> amongst them! Let the chocobokeeps witness the pose-off and the truth blast the amber from their eyes and the wax from their ears!"},{"name":"SUBORDINATEA","text":"Don you the uma kabuto, and show this benighted land the fearsome beauty of the horse!"},{"name":"CHOCOBO","text":"Kweh? Kweh, kweh, kweh! KWEEEH!"},{"name":"CHOCOBO","text":"Kweh?"},{"name":"CHOCOBO","text":"Kweh?"},{"name":"BREEDER","text":"Eh now, what are you up to!? You're scarin' them is what! Knock it off!"},{"name":"BREEDER","text":"Eh? Do I think the horse a beautiful creature? Don't rightly know what you mean by that, but sure, I guess the real thing would look fair enough. A sight better than that thing on your head, that's for sure."},{"name":"BREEDER","text":"Are you going to stop horsing around now? It's Heavensturn, and look at all the ruffled feathers! You take yourself off to a tavern like a gods-fearing <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>."},{"name":"BREEDER","text":"Whatever you want, I ha'n't the time for you now. Gots to look for some joker in a fleem-ugly mask who was scarin' the chocobos."},{"name":"SUBORDINATEA","text":"Ha! “Comely,” he called the horse? Out of the mouth of foes comes the greatest of compliments! Bitter has been the battle of Bentbranch Meadows, and sweeter for it the victory!"},{"name":"SUBORDINATEA","text":"Afeared, you say? What craven birds are these, to quail so before the overmastering beauty of the horse..."},{"name":"SUBORDINATEA","text":"But lest I forget, the horse is merciful and generous in victory. More generous than <span class=\"emphasis\">I</span> would be, frankly. Go and <span class=\"highlight\">rally</span> these shrink-clawed chocobos, and show that in beauty of mind too, the horse is superior to the bird."},{"name":"CHOCOBO","text":"Kweh! Kweh! KWEEEH!!!"},{"name":"SYSTEM","text":"The chocobos respond with much excitement."},{"name":"SUBORDINATEA","text":"Yes, adventurer, these are tears you see upon my cheek. Seeing you rally those horsebirds so..."},{"name":"SUBORDINATEA","text":"What a curious land you hail from! You are more discomfited by a man's tears than a man's blood. Yet your masterful rally evokes my beloved steed with all the eloquence of the East..."},{"name":"SUBORDINATEA","text":"As unschooled as you are, you have captured the beauty of the horse. The tears you regard with unease are a testament to your empathy most equine."},{"name":"SUBORDINATEA","text":"Nothing more remains to be done in Bentbranch Meadows, so overmastering has been your achievement. Take this carrot to the golden uma yoriki as proof of your success. May the gods speed your way to Gridania!"},{"name":"YELLOWGENERAL","text":"Would I like to hear your report? Yes, I believe we would both be served by it. Well, what says the doshin? Were you able to instruct those chilly chocobokeeps in the beauty of the horse? "},{"name":"YELLOWGENERAL","text":"The doshin's carrot? He gave you this, and wept in a manner most manly? Most lacking in imagination is that one, and for him to see evocations of that which is most precious to him in life..."},{"name":"YELLOWGENERAL","text":"Your inner horse, my dear adventurer, must be a steed of rare beauty. Perhaps the West is not without its own subtlety."},{"name":"YELLOWGENERAL","text":"I, the golden uma yoriki, thank you for your assistance. When the noble hoofbeats of the horse ring through these woods, know that you are ever remembered. And this kabuto, too, shall remind you of the deed."},{"name":"YELLOWGENERAL","text":"What good is it? Your questions have grown less discomfiting as I warm towards you. What good is this kabuto? You shall ever look upon it and remember this Heavensturn─and the inner horse of great beauty that canters through the chambers of your heart."},{"name":"YELLOWGENERAL","text":"You can do no more to persuade <span class=\"alternative-container\"><span class=\"alternative\">these strange Gridanians</span><span class=\"alternative\">your strange countrymen</span></span> of the beauty of the horse. May you have success as great in other lands, and may the uma bugyo find you not wanting."}],"reward":{"gil":286,"items":[{"id":6966}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66828]}},"partials":[{"type":"npc","id":"1005658","obj":{"i":1005658,"n":"Golden Uma Yoriki","l":53,"q":1,"t":"Far Eastern Aide"}},{"type":"item","id":"6966","obj":{"i":6966,"n":"Golden Uma Kabuto","l":1,"c":40141,"t":34,"p":71}},{"type":"item","id":"6964","obj":{"i":6964,"n":"Uma Kabuto","l":1,"c":40139,"t":34,"p":71}},{"type":"quest","id":"66828","obj":{"i":66828,"n":"A Horse for Heavensturn","g":194,"l":"Gridania","s":19}}]}