{"quest":{"name":"Moxia's Magnum Opus","location":"East Shroud","id":66821,"patch":2.15,"sort":0,"interval":"daily","repeatable":1,"beast":2,"eventIcon":71222,"issuer":1005563,"target":1005563,"genre":37,"journal":["Moxia wears a self-satisfied grin on her face.","The ever-enterprising Moxia has devised what she believes to be the key to a nonviolent resolution with her touched kin. Take the so-called “fuddle-bombs” to the Hanging Barbs and souse the touched sylphs into forgetting any hurtful schemes they might be plotting.","The touched sylphs emerged from the clouds of milkroot in a considerably more amiable mood than before. Return to Moxia and inform her that her invention has lived entirely up to expectations.","Moxia is exceedingly pleased─both with herself for the ingenuity of her invention and with you for assisting in the deed. Once again, you have proven yourself a true friend to the sylphs of Little Solace."],"objectives":["Use the bibulous bombs at the designated locations in the Hanging Barbs.","Report to Moxia."],"dialogue":[{"name":"MOXIA","text":"Nasty ones hang about Hanging Barbs, skulking and sneaking. This one is not sure what nasty ones are plotting, but this one is sure it is nothing good."},{"name":"MOXIA","text":"This one wants to stop nasty ones' nastiness, but this one would rather not hurt nasty ones─after all, nasty ones were like these ones not so long ago. What is this one to do?"},{"name":"MOXIA","text":"That was when this one was struck with the idea of this one's lifetime. Can walking one guess what this one did? No? This one made fuddle-bomb from shiny scales and milky milkroot!"},{"name":"MOXIA","text":"It explodes into a cloud so milky that nasty ones will become tipsy ones and forget all about doing nastiness. This one knows─fuddle-bomb exploded in this one's face once, and this one completely forgot what this one was making. Tee hee!"},{"name":"MOXIA","text":"Walking one must travel to Hanging Barbs and fling fuddle-bombs at nasty ones' homes, so nasty ones will be nasty no more!"},{"name":"MOXIA","text":"Brave one must travel to Hanging Barbs and fling fuddle-bombs at nasty ones' homes, so nasty ones will be nasty no more!"},{"name":"SYLPHENEMY","text":"Where is this one? What was this one doing? Does this one even care? This one thinks not─tee hee!"},{"name":"SYLPHENEMY","text":"This one is in the mood for dancing! And prancing! What one wants to dance with this one?"},{"name":"SYLPHENEMY","text":"Tee hee! Tee hee hee! Tee hee hee hee hee hee hee─hic!─hee."},{"name":"SYLPHENEMY","text":"This one is feeling sleepy. This one is going to go home and take a nap."},{"name":"MOXIA","text":"Nasty ones are now happy ones, dancing ones, and sleepy ones? Brave one has done well! This one could not be more pleased. "},{"name":"MOXIA","text":"This one's fuddle-bombs may yet make peace between these ones and those ones. But these ones cannot do this alone. These ones count on brave one for one's help!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21075},{"id":5667,"one":1},{"id":5672,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005563","obj":{"i":1005563,"n":"Moxia","l":55,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21075","obj":{"i":21075,"n":"Sylphic Goldleaf","l":1,"c":65051,"t":100}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}}]}