{"quest":{"name":"Like Cats and Dogs","location":"Western La Noscea","id":66825,"patch":2.1,"sort":150,"eventIcon":71221,"issuer":1005394,"target":1005394,"involved":[1005392,1005393],"genre":91,"journal":["Skribyld seeks the aid of an able-bodied adventurer.","Skribyld has tasked you with investigating the trafficking of coeurls to Vylbrand. Confront R'kontai at the Aleport gates to uncover the truth behind the coeurls' aberrant migration.","You have confronted R'kontai, but she flees before you can ask her any questions. Scour the docks for the merchant.","You have found R'kontai at the end of the pier and trounced the bodyguard who attempted to bar your way. Speak with R'kontai once more, that she may confess the truth of the pirates' schemes.","R'kontai explains that she was but another victim of the pirates, and they are to blame for the coeurls and jackals attacking one another. Report your findings to Skribyld.","You have informed Skribyld of the pirates' plan to eradicate the escaped coeurls using jackals, destroying any evidence of their smuggling in the process. Skribyld believes something must be done before the people of Aleport fall prey to the beasts now roaming Vylbrand."],"objectives":["Speak with R'kontai.","Pursue R'kontai.","Speak with R'kontai.","Report to Skribyld."],"dialogue":[{"name":"SKRIBYLD","text":"You look like an adventurer who gets around. Mayhap you have noticed the coeurls and jackals at each other's throats of late?"},{"name":"SKRIBYLD","text":"I've never seen anything quite like it, and the bloodshed only worsens by the day. If this continues, I daresay that one of these groups will wipe out the other before long."},{"name":"SKRIBYLD","text":"Now, it bears mentioning that this species of coeurl isn't native to Vylbrand. By rights, they shouldn't even be here. Nay, I believe they were <span class=\"emphasis\">smuggled</span>."},{"name":"SKRIBYLD","text":"I know of a merchant who may have a hand in these dealings. Her name is R'kontai, and after some probing, I've come to believe she's somehow involved. I would question her myself, but she is like to flee at the first sight of yellow. That's where you come in."},{"name":"SKRIBYLD","text":"I need you to speak with her and learn all you can. Take a look around─she's bound to be nearby."},{"name":"RKONTAI","text":"What's this? So they've sent ye to do their dirty work? Well, ye'll never take me alive! <span class=\"emphasis\">Neveeer</span>!"},{"name":"RKONTAI","text":"Hmph, stubborn bugger... Well, if yer lookin' for a fight, ye've bloody found one!"},{"name":"RKONTAI","text":"P-Please don't hurt me. I didn't do nothin' wrong. I smuggled in the coeurls for breedin' like ye asked, but that's it! I ain't the one sendin' the jackals into a frenzy, I swear!"},{"name":"RKONTAI","text":"Eh? The Yellowjackets sent ye, an' not no pirates? Why the hells didn't ye say so earlier!?"},{"name":"RKONTAI","text":"&lt;sigh&gt; Well, ye've caught me. I'm behind the coeurls in Aleport. Those good-for-nothin' pirates had me breed jackals for 'em too. With the right trainin', they make for nasty watchdogs an' the like. But the pirates wanted more, an' that's why they asked me for the coeurls, that they did."},{"name":"RKONTAI","text":"I smuggled 'em in, but the pirates took 'em before I could finish the job. S'pose they didn't want to wait for the breedin', but the buggers let 'em escape. Now they have jackals on the loose tryin' to get rid of the coeurls an' clean their mess. "},{"name":"RKONTAI","text":"I'm a victim as well, ye know. Aye, they paid good coin for the animals, but now they got folk chasin' after me. Wantin' to cover their tracks, I'm sure. You hurry an' tell those Yellowjackets I ain't to blame, you hear?"},{"name":"SKRIBYLD","text":"Ah, you're back. What can you tell me of R'kontai's dealings?"},{"name":"SKRIBYLD","text":"She claims to be a victim as well? Hmph! It was her greed that brought the coeurls to Vylbrand, and she is sorely mistaken to think the Yellowjackets will turn a blind eye. Mark my words, she <span class=\"emphasis\">will</span> be held accountable."},{"name":"SKRIBYLD","text":"At any rate, we now know why the coeurls and jackals are trying to tear each other to shreds."},{"name":"SKRIBYLD","text":"The pirates have been quite careful not to leave any clues, but we've managed to capture R'kontai's assailants. They're being questioned as we speak, and it won't be long before we track down the pirates. Don't worry, friend, the Yellowjackets will see them brought to justice."},{"name":"SKRIBYLD","text":"In the meantime, there is still the matter of R'kontai and the beasts running amok in the fields."},{"name":"SKRIBYLD","text":"I shudder to think what may happen should the jackals and coeurls continue fighting for much longer."},{"name":"SKRIBYLD","text":"I have a plan, but your assistance is essential to its success. Let me know when you are ready to begin."},{"name":"POP","text":"An unknown assailant emerges!"}],"reward":{"gil":382,"xp":2520},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66826,66827]},"partials":[{"type":"npc","id":"1005394","obj":{"i":1005394,"n":"Skribyld","l":33,"q":3}},{"type":"npc","id":"1005392","obj":{"i":1005392,"n":"R'kontai","l":33,"q":2}},{"type":"npc","id":"1005393","obj":{"i":1005393,"n":"R'kontai","l":33,"q":1}},{"type":"quest","id":"66826","obj":{"i":66826,"n":"Man's Best Fiend","g":91,"l":"Western La Noscea","s":150}},{"type":"quest","id":"66827","obj":{"i":66827,"n":"Curiosity Killed the Coeurl","g":91,"l":"Western La Noscea","s":150}}]}