{"quest":{"name":"Never Say Farewell","location":"Limsa Lominsa","id":66837,"patch":2.1,"sort":28,"icon":100204,"eventIcon":71221,"issuer":1005591,"target":1005591,"genre":196,"usedItems":[6998,6999],"journal":["Lisette would hear a full report of your efforts as an emissary of love.<br>※This quest is available for a limited time only.","Lisette commends your service on House Valentione's behalf, her ancestral senses telling her that your deeds have provided no small degree of solace to those lost in love. To reward you for your efforts, she deigns to offer you the opportunity to find love of your own. Trade with a <span class=\"alternative-container\"><span class=\"alternative\">dashing gentleman</span><span class=\"alternative\">lovely lady</span></span> to obtain two types of chocolate─bitter and pure heart─and deliver the pair of confections to Lisette.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Lisette gladly accepts your chocolates, seemingly quite relieved that the Valentione's Day festivities may now draw gradually to a close. For all of her efforts on behalf of lovers the realm over, it would appear that the fiery Ishgardian has had considerably less fortune in her own romantic endeavors..."],"objectives":["Deliver bitter heart chocolate and pure heart chocolate to Lisette de Valentione."],"dialogue":[{"name":"LISSETE","text":"I swear, is it always this bloody hot here? No wonder the whole city smells of sweat and watered-down ale."},{"name":"LISSETE","text":"“Oh, Lisette! Pray honor me with a piece of your chocolate!”<br>I'd just as soon <span class=\"emphasis\">honor</span> the lot of them with a swift kick to the face."},{"name":"LISSETE","text":"Hour after tireless hour do I slave to bring the joys of love to these uncultured boors. What, I ask, is in it for <span class=\"emphasis\">me</span>? Hm? Hmmmmmm!?"},{"name":"LISSETE","text":"...Hm?"},{"name":"LISSETE","text":"Well, if it isn't my dutiful adventuring friend! How fare you in spreading my boundless love across the land?♪"},{"name":"LISSETE","text":"...I require no answer, of course! As a lady of House Valentione, I am ever attuned to the hearts of would-be lovers the realm over!"},{"name":"LISSETE","text":"Yes, though not all romances can end in happiness, it is clear that many a heart rests easier after your efforts. I am proud to declare you a worthy retainer to House Valentione!"},{"name":"LISSETE","text":"And what of <span class=\"emphasis\">yourself</span>, adventurer? Do you long for the company of another? As you have served me with such loyalty, I would deign to return the favor."},{"name":"LISSETE","text":"This is my final order to thee: deliver one morsel each of bitter heart and pure heart chocolate to me, and do so with all haste!"},{"name":"LISSETE","text":"And how might you go about this? Why, you need only seek out a <span class=\"alternative-container\"><span class=\"alternative\">strapping lad</span><span class=\"alternative\">fair maiden</span></span> willing to make a trade─a task which I am sure is well within the powers of one as brave and <span class=\"alternative-container\"><span class=\"alternative\">becoming</span><span class=\"alternative\">handsome</span></span> as yourself."},{"name":"LISSETE","text":"What if your offer is spurned, you say? Are you an adventurer or a chocobo chick!? Begone from my sight, and don't return until you have both chocolates in hand!"},{"name":"LISSETE","text":"I command you to bring me one morsel each of bitter heart and pure heart chocolate. Yes, I, the Lady Lisette bestow upon you the perfect opportunity to seek out that special someone. Dishonor my house by wasting it, and I can assure you that you will rue this day!"},{"name":"LISSETE","text":"I command you to bring me one morsel each of bitter heart and pure heart chocolate. Yes, I, the Lady Lisette bestow upon you the perfect opportunity to seek out that special someone. Dishonor my house by wasting it, and I can assure you that you will rue this day!"},{"name":"LISSETE","text":"Well, what have we here? Yes, this is truly a glorious day! Yes, you must tell me all about the special young <span class=\"alternative-container\"><span class=\"alternative\">man</span><span class=\"alternative\">woman</span></span> from whom you obtained this chocolate."},{"name":"LISSETE","text":"...Oh, would you look at the time! I fear I must prepare to be on my way. Yes, time simply flies when you are spreading love to hundreds─nay, thousands!─of solitary, godsforsaken souls."},{"name":"LISSETE","text":"Till next we meet, adventurer, may your days─and nights─never want for ardor and affection!"},{"name":"LISSETE","text":"...Phew. I thought it would never end. I swear, next Valentione's Day will be the one I spend in the company of my <span class=\"emphasis\">own</span> true love, whoever and wherever he might be..."}],"reward":{"gil":382,"items":[{"id":6972},{"id":6973}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"all","quests":[66834,66835]}},"partials":[{"type":"npc","id":"1005591","obj":{"i":1005591,"n":"Lisette De Valentione","l":28,"q":5}},{"type":"item","id":"6972","obj":{"i":6972,"n":"Valentione Apron","l":1,"c":42350,"t":35,"p":59}},{"type":"item","id":"6973","obj":{"i":6973,"n":"Valentione Apron Dress","l":1,"c":42351,"t":35,"p":59}},{"type":"item","id":"6998","obj":{"i":6998,"n":"Bitter Heart Chocolate","l":1,"c":24063,"t":85}},{"type":"item","id":"6999","obj":{"i":6999,"n":"Pure Heart Chocolate","l":1,"c":24065,"t":85}},{"type":"quest","id":"66834","obj":{"i":66834,"n":"Sweet, Sweet Love","g":196,"l":"Limsa Lominsa","s":25}},{"type":"quest","id":"66835","obj":{"i":66835,"n":"Right Here Waiting","g":196,"l":"Limsa Lominsa","s":26}}]}