{"quest":{"name":"Heavens Know You're Fast","location":"Ul'dah","id":66830,"patch":2.1,"sort":21,"icon":100197,"eventIcon":71221,"issuer":1005660,"target":1005660,"genre":194,"usedItems":[6964],"journal":["The black uma yoriki of Ul'dah is in need of a speedy solution to his conundrum.<br>※This quest is available for a limited time only.","The black uma yoriki yearns to show the speed of a horse to the plodding folk of Ul'dah, and has asked you to don the uma kabuto and run to the Silver Bazaar. Under your own power, race to the first marker at the Eighty Sins of Sasamo in western Thanalan.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have passed the first marker. The uma kabuto may lie heavy on your untried head, but be steadfast and run to the second marker in western Thanalan.","You have passed the second marker. Resist the temptation to come up for air from under the kabuto, and run to the third marker in western Thanalan.","You have passed the third marker and persuaded a passing adventurer of the speed of the horse. Know that you have grown into the kabuto, and run to the fourth marker in western Thanalan.","You have passed the fourth marker. Feel anew the graceful contours of the kabuto upon your head, and run to the fifth marker in western Thanalan.","You have passed the fifth marker. Raise your helmed head high and speak with the black uma doshin in the Silver Bazaar.","The black uma doshin has breathlessly praised your efforts and given you a carrot as a token of her approbation. Deliver the carrot to the black uma yoriki in Ul'dah.","The black uma yoriki gleefully exclaims over your achievement and has thrust a black uma kabuto into your tired hands. You seem to have covered yourself in glory, at least in Ul'dah. Seek the same in Limsa Lominsa and Gridania, then present yourself to the uma bugyo back in Mih Khetto's Amphitheatre."],"objectives":["While wearing the kabuto, run to the marker at the Eighty Sins of Sasamo.","While wearing the kabuto, run to the second marker.","While wearing the kabuto, run to the third marker.","While wearing the kabuto, run to the fourth marker.","While wearing the kabuto, run to the fifth marker.","While wearing the kabuto, speak with the black uma doshin.","Deliver the carrot to the black uma yoriki in Ul'dah."],"dialogue":[{"name":"BLACKGENERAL","text":"I mark you as an adventurer come to our aid, lo!"},{"name":"BLACKGENERAL","text":"I am that which the East and the West alike call the black uma yoriki, though, lo, one knows the name by heart and the other by ear alone. To Ul'dah was I sent to tell of the speed that is the birthright of the horse!"},{"name":"BLACKGENERAL","text":"Hoarse have I shouted these tales of fleetness─no pun intended─but a man's voice is poor substitute for a horse a-gallop, alack!"},{"name":"BLACKGENERAL","text":"A man a-run, however, such makes a better substitute, but only a man fleet of foot would do! Hard would I charge if I felt myself equal to the task, but lo! A lifetime on horseback makes a poor runner indeed."},{"name":"BLACKGENERAL","text":"Now, an adventurer in the prime of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> life may achieve the spirit─if not the substance─of the speed that lo, sends manes flying and hearts thundering! Such and that are yours to achieve."},{"name":"BLACKGENERAL","text":"One who whiles her life away in my benevolent shadow has placed markers along the road to the Silver Bazaar. As the winds of the East race to a stormcote you must run, horselike in your speed...from marker to marker and so on to the Silver Bazaar, using naught but your own legs!"},{"name":"SUBORDINATEB","text":"(-Black Uma Doshin-)What travesty is this!? I look upon you, and I see not a horse! Don the uma kabuto for this most important journey!"},{"name":"SUBORDINATEB","text":"(-Black Uma Doshin-)...Question not how I manage to bear witness to your deed from afar. Be as the horse, and leave behind all doubts and bafflement!"},{"name":"SUBORDINATEB","text":"（削除）"},{"name":"SUBORDINATEB","text":"（削除）"},{"name":"NPC","text":"Beg pardon, a moment of your time?"},{"name":"NPC","text":"Now here's a curious sight─a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">fellow</span></span> in a most peculiar helm running up this road like fire through tinder. It's upset this chocobo something fierce."},{"name":"NPC","text":"Embracing the inner horse, you say? Advocating for an Eastern mount? Nonsense! You see a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">fellow</span></span> running <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heart out in an outlandish helm and you think...you think..."},{"name":"NPC","text":"Why, you think there must be a good reason for a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">fellow</span></span> to mortify <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> so, and...and you wonder just how swift this <span class=\"emphasis\">horse</span> must be for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to go to all this trouble and nonsense!"},{"name":"NPC","text":"The revolution comes! A new mount to rival chocobos, even replace them! What does it mean? Whom shall I tell? ...And how might I make a few gil off of this?"},{"name":"NPC","text":"I thank you kindly for the information, horse-<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Spread the word of the horse's speed far and wide. We who adopt the mount early will have a greater joy of it."},{"name":"SUBORDINATEB","text":"You have finished your task, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. Well did you run your appointed course."},{"name":"SUBORDINATEB","text":"I have watched you from afar and near alike, and aye, you were as a charger! Who could fail to be awed by the spittle flying from beneath your kabuto?"},{"name":"SUBORDINATEB","text":"...Your boots as thundering hooves sending up plumes of dust, your taut flanks gleaming with sweat...well! A worthy mount <span class=\"emphasis\">you</span> would make, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>."},{"name":"SUBORDINATEB","text":"I am not the only horse-lover in the Silver Bazaar tonight, I'll wager. I saw many a pair of eyes shining at the sight of flying manes, lips parted as though to drink in the muscular gallop..."},{"name":"SUBORDINATEB","text":"And did you yourself not feel a dim echo of the exhilaration that is the natural gift of riders and mount alike? So long have we of the East partaken of this that we feel the need...the need for speed."},{"name":"SUBORDINATEB","text":"It is our custom to reward a horse with a carrot. Take this, my fleet piebald steed, and present it to the black uma yoriki in Ul'dah."},{"name":"SUBORDINATEB","text":"You will continue to don the kabuto, I hope. With so many eager eyes upon you, it would be a sore disappointment to see the horse revealed as mere <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>."},{"name":"BLACKGENERAL","text":"By the dust upon your coat and lo, the foam upon your chest, I mark the celerity of your journey hither! What have you there?"},{"name":"BLACKGENERAL","text":"A carrot! However did you rouse the doshin to such favor, such fervor? A seeker of pleasure and a spirit most free she is, but since arriving in Eorzea, she has been as watered wine, alack!"},{"name":"BLACKGENERAL","text":"Much do we value speed in the East for lo, life is hard and full of besiegement. We can plod in uncertain safety or...gallop in certain rapture!"},{"name":"BLACKGENERAL","text":"An adventurer carries <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> in much the same way, ha! No wonder it is that you succeeded beyond my wildest hope. This is your reward, lo, a kabuto that is a twin to mine own!"},{"name":"BLACKGENERAL","text":"Never plod, adventurer. Death shall unhorse us, every one, but until then...until then, lo, we shall canter, we shall gallop, we shall leap!"},{"name":"BLACKGENERAL","text":"The word shall spread throughout Ul'dah of the speed of the horse. You have hotfooted and hightailed your way to glory and grace! Continue your work for the uma bugyo, I say, then return to her in Gridania."}],"reward":{"gil":286,"items":[{"id":6967}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66828]}},"partials":[{"type":"npc","id":"1005660","obj":{"i":1005660,"n":"Black Uma Yoriki","l":40,"q":1,"t":"Far Eastern Aide"}},{"type":"item","id":"6967","obj":{"i":6967,"n":"Black Uma Kabuto","l":1,"c":40142,"t":34,"p":71}},{"type":"item","id":"6964","obj":{"i":6964,"n":"Uma Kabuto","l":1,"c":40139,"t":34,"p":71}},{"type":"quest","id":"66828","obj":{"i":66828,"n":"A Horse for Heavensturn","g":194,"l":"Gridania","s":19}}]}