{"quest":{"name":"Heavenly Power","location":"Limsa Lominsa","id":66831,"patch":2.1,"sort":22,"icon":100198,"eventIcon":71221,"issuer":1005662,"target":1005662,"genre":194,"usedItems":[6964],"journal":["The red uma yoriki has a clear, present, and progressive need for a horsey advocate.<br>※This quest is available for a limited time only.","The red uma yoriki would shout of the power of the horse from the rooftops. Don the uma kabuto and speak with the yoriki's vassal, the red uma doshin, at the Red Rooster Stead in lower La Noscea.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have found the doshin unmanned, unhorsed, and unaccented. As the sole wearer of the kabuto, it now falls to you to collect the carrots in the farm.","You have collected the carrots. With your kabuto on, give them to the Stead botanist.","Impressed by your strength, the botanist has asked you to try using your equine-like muscles to bring him an enormous carrot that was left in the field. Let your mane fly in the wind as you hunt for it around the Stead.","You have found the enormous carrot. See it delivered to the botanist, who will readily recognize you with the kabuto on.","Pleased by your delivery of the giant carrot, the botanist has declared himself convinced of the horse's magnificent power. Give the happy news to the doshin, keeping the proud visage of the horse gracefully atop your head.","The doshin praises you through his own pain. Deliver the carrot, the token of your success, to the red uma yoriki in Limsa Lominsa.","The yoriki lauds your achievement and rewards you with a crimson uma kabuto. Tales of the horse's prowess should spread on the next market day. Would that it were so in Gridania and Ul'dah! Offer yourself wherever you are needed, then let the uma bugyo be the final arbiter of your success."],"objectives":["While wearing the kabuto, speak with the red uma doshin at the Red Rooster Stead.","While wearing the kabuto, collect carrots.","While wearing the kabuto, hand the carrots to the Stead botanist.","While wearing the kabuto, collect the enormous carrot.","While wearing the kabuto, hand the enormous carrot to the Stead botanist.","While wearing the kabuto, report to the red uma doshin.","Deliver the carrot to the red uma yoriki in Limsa Lominsa."],"dialogue":[{"name":"REDGENERAL","text":"<span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> knows the role we play in this enterprise, I am hoping."},{"name":"REDGENERAL","text":"Rescuers, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, rescuers. Fair Eorzea, fettered in feathers, shackled to shame. It is sad, no? So on horseback we are riding, to the rescue!"},{"name":"REDGENERAL","text":"I am liking Eorzea. The sights, the food, the people...but not the horsebirds, no. Wretched, kweh-ing things. We of the East must be saving Eorzeans from wretched mounts."},{"name":"REDGENERAL","text":"I am talking of boyish things. <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> will pardon, yes? Let us speak now of your task."},{"name":"REDGENERAL","text":"The harvest, it proceeds at the Red Rooster Stead. They are needing a nice strong horse, but do they know it? No, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>."},{"name":"REDGENERAL","text":"I am thinking, perfect! What chance to show the strength of the horse. I am having a nice cob on the Stead already; you are to help him carry the harvest. Go, go."},{"name":"SUBORDINATEC","text":"&lt;pant&gt; &lt;pant&gt; ...Come to relieve me? Oh, thank the Twelve. Blasted yoriki and his ideas! He's a northeasterner, you know. They're all off their gourd."},{"name":"SUBORDINATEC","text":"&lt;groan&gt; I put my back out! But no matter, we're to transport the harvest from the Stead─some proof of a horse's power."},{"name":"SUBORDINATEC","text":"My back went before I actually collected the vegetables or loaded the wagon. The harvest's still scattered hither and yon."},{"name":"SUBORDINATEC","text":"Gather up the harvest and hand it to a farmer, won't you? Then you can hitch yourself to the wagon and show all that “horse-power” the yoriki blathers on about."},{"name":"SUBORDINATEC","text":"Ow...owww! If I call you <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, will you put that kabuto on?"},{"name":"SUBORDINATEC","text":"(-Red Uma Doshin-)Hold up, you're here to <span class=\"emphasis\">be</span> the horse. Put your uma kabuto on first."},{"name":"FARMER","text":"Good gods, another one of those horse mummers. We can't <span class=\"emphasis\">all</span> be having fun 'n' games during the harvest, ye know."},{"name":"FARMER","text":"What's this? Hauled me some carrots, did ye? Well, that's a useful sort of a mummer now. Not like the last one─man couldn't lift a twig."},{"name":"FARMER","text":"Got a strong back there, do ye? Powerful sort of shoulders? A mummer could make <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> even more useful and carry the giant carrot left there by the field."},{"name":"FARMER","text":"Don't see no horse helm on ye, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. If yer just passing through, then keep on passing. We've vegetables to harvest."},{"name":"FARMER","text":"Well? Hefted the giant carrot, or didn't ye?"},{"name":"FARMER","text":"Oho! Really put yer back into this one, eh, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">fella</span></span>?"},{"name":"FARMER","text":"That oughta do her, at least for this harvest. Don't need ye anymore. All I got to do is to hitch this wagon to a chocobo, and..."},{"name":"FARMER","text":"What? <span class=\"emphasis\">You</span> want to pull the wagon instead?"},{"name":"FARMER","text":"That's my kind of crazy talk. I appreciate that, but no thanks. Believe you <span class=\"emphasis\">would</span> pull the cart, though! Horses are that strong, eh? Or at least you are."},{"name":"SUBORDINATEC","text":"Ungh... Ah, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, you're back. Hm? He said what? “Horses are that strong”?"},{"name":"SUBORDINATEC","text":"Well, there's our task done and nobody had to hitch themselves to a wagon. I call that a win!"},{"name":"SUBORDINATEC","text":"You make a fine horse, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. A sight better than me. Why, if I really were a horse, I'd be for the knacker now."},{"name":"SUBORDINATEC","text":"You've more than earned this carrot. Give it to that beast from the northeast, and my message too..."},{"name":"SUBORDINATEC","text":"“I am thinking the Red Rooster Stead is won, amazing show of horsepower.” Full stop and...owww."},{"name":"REDGENERAL","text":"A good result you are having down at the Red Rooster Stead? Tell me, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>."},{"name":"REDGENERAL","text":"Oh, the doshin's carrot. His back, he is throwing out? Some poultice I am sending, then."},{"name":"REDGENERAL","text":"The vegetables are reaching Limsa Lominsa, but do you know what else, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>? The reputation. Horses, Lominsans are hearing, horses are <span class=\"emphasis\">strong</span>. "},{"name":"REDGENERAL","text":"Now you are taking this crimson kabuto, for all your pains. The doshin? <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> is kind to be remembering him, but a poultice he is already getting."},{"name":"REDGENERAL","text":"The rescue of Eorzea is almost done! I am thinking how pleasant it is to be having a Lominsan lamprey pie now. <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> forgives the notion? <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> has more work to do, and only then is <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> visiting the uma bugyo in Gridania."}],"reward":{"gil":286,"items":[{"id":6965}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66828]}},"partials":[{"type":"npc","id":"1005662","obj":{"i":1005662,"n":"Red Uma Yoriki","l":28,"q":1,"t":"Far Eastern Aide"}},{"type":"item","id":"6965","obj":{"i":6965,"n":"Crimson Uma Kabuto","l":1,"c":40140,"t":34,"p":71}},{"type":"item","id":"6964","obj":{"i":6964,"n":"Uma Kabuto","l":1,"c":40139,"t":34,"p":71}},{"type":"quest","id":"66828","obj":{"i":66828,"n":"A Horse for Heavensturn","g":194,"l":"Gridania","s":19}}]}