{"quest":{"name":"Thank Heavensturn for You","location":"Gridania","id":66832,"patch":2.1,"sort":23,"icon":100199,"eventIcon":71221,"issuer":1005657,"target":1005657,"involved":[1000162,1000248,1000786],"genre":194,"usedItems":[6966,6965,6967,6964],"journal":["Having sent you hotfooted on a mission, the uma bugyo is eager to know the results.<br>※This quest is available for a limited time only.","The uma bugyo bids you advocate for an unknown mount, the horse, in Gridania, Limsa Lominsa, and Ul'dah, and bring back a kabuto from each as a token of your success. You may visit the cities in any order, but the three kabuto must be presented to the uma bugyo starting with Gridania. Obtain and don the golden uma kabuto, and present yourself to the uma bugyo.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have donned the golden uma kabuto, thus proving your success in Gridania. Obtain and don the crimson uma kabuto in Limsa Lominsa, and present yourself to the uma bugyo.","You have donned the crimson uma kabuto, thus proving your success in Limsa Lominsa. Obtain and don the black uma kabuto in Ul'dah, and present yourself to the uma bugyo.","You have donned the black uma kabuto, thus proving your success in Ul'dah. Your advocacy complete in all three city–states, you must now quell opposition by speaking with ordinary Gridanians who are favorably disposed toward the horse. Grace your head with the stately uma kabuto once more, then set about gathering those words.","You have found three Gridanians who support the introduction of horses to their land. Stay in character as the horse, and speak with the head of the Fraternal Order of Chocowackers.","You have relayed the voice of the people, but the chief chocowacker is less than tractable. In fact, she declares she will send for a chocobo fine enough to put the uma bugyo in her place. Diplomatically report the developments to the uma bugyo.","Despite your calm retelling of the chief chocowacker's words, the uma bugyo is much offended, and has accepted the challenge set forth. Hide your dismay behind your kabuto and speak with the chocowacker at Treespeak Stables.","The encounter between the uma bugyo and the chief chocowacker quickly devolves into a war of words. However, a mysterious stranger arrives just in time to avert an escalation from insult to injury. Return to Gridania and speak with the uma bugyo.  ","The uma bugyo thanks you for all you have done, and reveals that she will work with the chocowackers to find a way for horses and chocobos to coexist. Someday, the horse may be a common sight in Eorzea─but the horse that you were will never be forgotten."],"objectives":["While wearing the golden uma kabuto, speak with the uma bugyo.","While wearing the crimson uma kabuto, speak with the uma bugyo. ","While wearing the black uma kabuto, speak with the uma bugyo.","While wearing the uma kabuto, speak of horses in New Gridania.","While wearing the uma kabuto, speak of horses in Old Gridania.","While wearing the uma kabuto, speak with the chief chocowacker.","While wearing the uma kabuto, speak with the uma bugyo.","While wearing the uma kabuto, speak with the chief chocowacker at Treespeak Stables.","Speak with the uma bugyo."],"dialogue":[{"name":"HORSEMISSIONARY","text":"Yours is to advocate for the noble horse in Gridania, Limsa Lominsa, and Ul'dah. They that look to me for wrath and succor already toil in those cities three."},{"name":"HORSEMISSIONARY","text":"If your efforts bear fruit, a kabuto of colors varied you shall have. Gather all three─golden, black, and crimson─and present yourself before me in a manner customary for such occasions. "},{"name":"HORSEMISSIONARY","text":"Now, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, know that in the East, the journey belongs to the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> but the destination to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> master. This pageant of kabuto must follow an order proper, but the quests are yours to order as you like."},{"name":"HORSEMISSIONARY","text":"We must begin with gold, for it opens that chamber of the heart where sings the canary of covetise. Do not be baffled, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>: we of the East make a place for our desires. "},{"name":"HORSEMISSIONARY","text":"I see and mark the golden uma kabuto. Let us agree that Gridania has been tutored in the beauty of the horse. "},{"name":"HORSEMISSIONARY","text":"That which is called beauty by the base and the fine alike is but a dream of a song, and through every one echoes a hoofbeat...in Eorzea now as well as the Far East."},{"name":"HORSEMISSIONARY","text":"Now comes red, for we must remember, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, that where gold goes, blood follows. The crimson uma kabuto of Limsa Lominsa awaits an advocate worthy."},{"name":"HORSEMISSIONARY","text":"I see that your head wears not the golden uma kabuto of Gridania, and so the pageant is not yet complete. Offer yourself in amity and perspicacity to yon golden uma yoriki."},{"name":"HORSEMISSIONARY","text":"I see and mark the crimson uma kabuto. Let us assent that Limsa Lominsa has learned of the power of the horse."},{"name":"HORSEMISSIONARY","text":"Prodigal it is that a doshin fell in the line of duty. Were it not for <span class=\"alternative-container\"><span class=\"alternative\">m'lady's</span><span class=\"alternative\">m'lord's</span></span> assistance, these Lominsans would see not the horse as a helpmeet."},{"name":"HORSEMISSIONARY","text":"The pageant must end in black, betokening a darkling of the senses that the bold and the craven alike call death. <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> knows I speak of the black uma kabuto of Ul'dah."},{"name":"HORSEMISSIONARY","text":"I neither see nor mark the crimson uma kabuto of Limsa Lominsa upon your crown. Such a kabuto will be your due, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, when the red uma yoriki receives your help."},{"name":"HORSEMISSIONARY","text":"I see and mark the black uma kabuto. Let us accept the schooling of Ul'dah as a deed of speed, done and dealt."},{"name":"HORSEMISSIONARY","text":"The speed of the horse is a grace unmatched! That which is named Ul'dah, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, is but a millstone that grinds in the desert. Sorely in need it is of such grace."},{"name":"HORSEMISSIONARY","text":"Gold, crimson, black. Noted and marked, and so the pageant is complete. Let us to another matter attend. Tongues waggle and curiosity piques about the horse, such is <span class=\"alternative-container\"><span class=\"alternative\">m'lady's</span><span class=\"alternative\">m'lord's</span></span> success."},{"name":"HORSEMISSIONARY","text":"Yet, others would deny their fellow Eorzeans even the mildest flirtation with the horse, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and here it is that we must strike."},{"name":"HORSEMISSIONARY","text":"Those they call the “Fraternal Order of Chocowackers”, in the harsh accents of Eorzea, are the fronds that fan the flames. In their iron grip toil the chocobos of burden here in Gridania, and no rivals will they brook."},{"name":"HORSEMISSIONARY","text":"Yet do they not say in the northeast, “the people are speaking, the gods are speaking”? Even the chocowackers dare not resist a groundswell of support."},{"name":"HORSEMISSIONARY","text":"<span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> knows that our Eastern countenance freezes the tongue and hurries the feet. Don the uma kabuto again, for to you falls the task. The people shall speak their minds, straight <span class=\"emphasis\">to</span> the horse's mouth!"},{"name":"HORSEMISSIONARY","text":"Have you the black uma kabuto, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>? It no doubt gathers dust upon the shelf of the black uma yoriki in Ul'dah."},{"name":"NICOLIAUX","text":"That's a horse, right? I know all about that!"},{"name":"NICOLIAUX","text":"It's <span class=\"emphasis\">fast</span>, faster than anything. An adventurer from Ul'dah says he saw one─he just caught a quick look afore it disappeared, that's how fast! I want one so bad..."},{"name":"NICOLIAUX","text":"The lady in the Amphitheatre, she's got a helm like nothing I've seen. Wish I had one..."},{"name":"CEINGULED","text":"Well, I would be lying if I said your helm─kabuto, it is called?─if I said your kabuto was not without some appeal. It...grows on you."},{"name":"CEINGULED","text":"Especially since I hear the actual beast is a powerful creature. It needs some studying of course, but...any tactical advantage against the Garleans would be welcome indeed."},{"name":"CEINGULED","text":"Where is your strange yet glorious helm? Surely, you have one?"},{"name":"MELLAINE","text":"Hm, is that the horse kabuto that's the talk of the town? It puts me in mind of a rare beast I saw in the hinterlands of Coerthas."},{"name":"MELLAINE","text":"A <span class=\"emphasis\">unicorn</span>, they called it. I saw it just that once but you don't forget something that beautiful. Horses are beautiful, too, aren't they? What a fair sight it'd be, to have them here!"},{"name":"MELLAINE","text":"Do you have a kabuto? I'd like to see one up close. I know they me in mind of something."},{"name":"CHOCOBOMISSIONARY","text":"Oh, for the love of the Twelve, the entire <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> spent dealing with inquiries about this <span class=\"emphasis\">horse</span> thing! We deal in chocobos, people!"},{"name":"CHOCOBOMISSIONARY","text":"And what can I help you wi─<br>...Oh! ...Oh. You're one of those horse folk. Come to harass us in person, hm?"},{"name":"CHOCOBOMISSIONARY","text":"You brought the voice of the people? What is that, some sort of a periodical? Oh. “Want one so bad,” “tactical advantage,” “What a fair sight”..."},{"name":"CHOCOBOMISSIONARY","text":"These are just...personal opinions! You're not changing our minds with this dross!"},{"name":"CHOCOBOMISSIONARY","text":"Eorzea has a long and proud tradition of portage. We <span class=\"emphasis\">are</span> a chocobo-based economy, you know! This newfangled horse thing has no place here."},{"name":"CHOCOBOMISSIONARY","text":"Say no to alternative portage! If that uma bugyo insists on waving the horse-head on our turf, we'll bring out the big birds, you can be sure of that."},{"name":"CHOCOBOMISSIONARY","text":"Since you helped <span class=\"emphasis\">them</span>, you're helping us now. I've sent for the finest chocobo Coerthas can breed. Bring that bugyo to Treespeak Stables, and we'll put her in her place."},{"name":"CHOCOBOMISSIONARY","text":"If you need a chocobo porter, you'll have to go next door. Ugh, I hope one of those horse-headed freaks shows up─I'll give 'em a piece of my mind!"},{"name":"HORSEMISSIONARY","text":"<span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> relayed the voice of the people to those high-necked chocowackers? They were suitably humbled, I assume yet ask?"},{"name":"HORSEMISSIONARY","text":"...And I am schooled, that an answer assumed is unlike an asking answered. Irrational and partial these chocowackers are, and they shame even the horsebird in their witlessness."},{"name":"HORSEMISSIONARY","text":"A chocobo-based economy, indeed! A long and proud tradition of <span class=\"emphasis\">non-competition</span>, is what is meant by the left and the right side of her mouth alike."},{"name":"HORSEMISSIONARY","text":"Far have I come to stoke the flames of accord with Eorzea, <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>, and these chocowackers would see it turn to cold ash! Nay─neigh, I say!"},{"name":"HORSEMISSIONARY","text":"This challenge I will accept. <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> will guide me to this Treespeak Stables, and there I will face off against the keeper of horsebirds."},{"name":"HORSEMISSIONARY","text":"Quick, don the kabuto! A horse you must stay, until this labor is complete."},{"name":"HORSEMISSIONARY","text":"In honor and glory do we first lay eyes on each other. You are that which is called the chief of chocowackers by Eorzeans and outlanders alike. I am the uma bugyo."},{"name":"CHOCOBOMISSIONARY","text":"Thank you for coming, esteemed visitor from the Far East. Let's settle this thing once and for all, shall we?"},{"name":"CHOCOBOMISSIONARY","text":"A truly magnificent chocobo is about to arrive in these stables. After that, we can both go home because it will be pretty clear even to you that we've no need of <span class=\"emphasis\">horses</span> in Eorzea!"},{"name":"HORSEMISSIONARY","text":"Your initial courtesy was as a thin soup before a meal of bones. You speak of things becoming clear, m'lady, but there is no clarity in your own mind─only folly."},{"name":"HORSEMISSIONARY","text":"Thanks to this adventurer most beautiful, fleet, and powerful, Eorzea desires to know more of the horse. Is <span class=\"emphasis\">that</span> not clear to you?"},{"name":"CHOCOBOMISSIONARY","text":"Excuse me!? You think a cheap stunt like that means anything? The last <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">guy</span></span> to put on a funny hat and clown about was selling lardy cakes, and people talked about <span class=\"emphasis\">that</span> for a few days, too!"},{"name":"HORSEMISSIONARY","text":"Funny hat!? A work of high art and cunning craft this is, and in the image of mine own courser fair. Oh, the scurrilousness!"},{"name":"CHOCOBOMISSIONARY","text":"The scurry-what!? Nobody in Eorzea even <span class=\"emphasis\">understands</span> what you're saying! As for your precious horses, they're just unicorns with a big empty forehead. Hornless! Hornless!"},{"name":"HAURCHEFANT","text":"(-???-)Abandon your quarrel, your tongues are sharp enough to shave an urchin! "},{"name":"HAURCHEFANT","text":"(-???-)Treespeak sends for the finest chocobo in Coerthas, and I have brought it thus... Now, what ails you that you would keep me waiting?"},{"name":"CHOCOBOMISSIONARY","text":"But that armor is Haurche─<br>...No, that can't be. Excuse me, who are you? I didn't send for a horse-head to deliver my chocobo!"},{"name":"HAURCHEFANT","text":"Well, if you cannot name me, I have no name to claim! The helm I bought off a passing adventurer. It has a certain...vigor that appealed to me."},{"name":"HAURCHEFANT","text":"Esteemed visitor from the East, I have the honor to have been born under the unicorn sigil of a proud house. Horn or no, I know the love you bear for the mount of your homeland."},{"name":"HAURCHEFANT","text":"The supple muscles under the silky coat, the music of the hooves...the velvet of the muzzle, and the inscrutable black sea of their eyes. Ah, the horse!"},{"name":"HAURCHEFANT","text":"But I am also a man of Coerthas, where the love of chocobos runs as deep as their bloodline runs pure. Which is better, bird or horse? I could not say."},{"name":"HORSEMISSIONARY","text":"You could not say? Exactly useless, then, was that soliloquy! M'lord seems not to comprehend that I am now honor-bound to prove the horse superior to this...this chit! "},{"name":"HAURCHEFANT","text":"Then your honor is forfeit, as is hers. The finest creature here is neither the horse nor the chocobo..."},{"name":"HAURCHEFANT","text":"...but this adventurer!"},{"name":"HAURCHEFANT","text":"...but my trusted comrade of many adventures, <span class=\"highlight\">Forename</span>!"},{"name":"HAURCHEFANT","text":"Look at the scars upon <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> kabuto. How mightily <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> must have toiled to <span class=\"emphasis\">become</span> a horse...and against all odds, succeed!"},{"name":"HAURCHEFANT","text":"The docility to accept well-nigh impossible commands, the physical talents to carry them out─to a warrior born such as I, there are no virtues greater in a steed!"},{"name":"HAURCHEFANT","text":"I say, be my personal steed! There will be none greater, furred or feathered. The finest carrots you will have. Your feet I will scrape, and..."},{"name":"CHOCOBOMISSIONARY","text":"Uh, Lord Haur─I mean, Lord No-name, I think you made your point. You can stop now. Please."},{"name":"HORSEMISSIONARY","text":"I must agree with m'lady here. If we agree to discuss the matter at some later and calmer time, m'lord, will you refrain from further flying of fancies?"},{"name":"HAURCHEFANT","text":"Well, if you are in agreement, I see no further need for my presence here. I shall take the chocobo and return north."},{"name":"HAURCHEFANT","text":"Adventurer, we were well met. A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents is welcome at our camp any time."},{"name":"HAURCHEFANT","text":"<span class=\"highlight\">Forename</span>, we were well met again. You will one day make your way back to our camp, I trust? We will sit by the fire and talk of glory and adventure!"},{"name":"HAURCHEFANT","text":"May the new turn be a blessed one!"},{"name":"CHOCOBOMISSIONARY","text":"You! Put that horse helm back on. I want that uma bugyo to know how peaky a horse looks next to a chocobo!"},{"name":"HORSEMISSIONARY","text":"In rue and chagrin do I face you after such fit of temper. I tremble to think what reckless words may have tumbled from this mouth without the Ishgardian lord's interruption."},{"name":"HORSEMISSIONARY","text":"Curious it is how the best of intentions curdle so quickly into an act of spite. <span class=\"alternative-container\"><span class=\"alternative\">M'lady</span><span class=\"alternative\">M'lord</span></span> has much to teach me in the clean-breaking ways of the rolling stone."},{"name":"HORSEMISSIONARY","text":"The chief of chocowackers also regrets her rash words. In tranquility and amity we have determined to meet again, to search for a two-beast solution."},{"name":"HORSEMISSIONARY","text":"The people have seen, the people have spoken─all thanks to <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span>. The way is open for the horse, and someday, with the chocowackers' assent, we shall canter into Eorzea."},{"name":"HORSEMISSIONARY","text":"Much has been asked of <span class=\"alternative-container\"><span class=\"alternative\">m'lady</span><span class=\"alternative\">m'lord</span></span> adventurer, yet more has been given by <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. Accept this Heavensturn dish, traditional in the East, as a token of our friendship and promise."},{"name":"HORSEMISSIONARY","text":"May the new turn be a blessed one for you, for you from the Far East we pray."}],"reward":{"gil":382,"items":[{"id":4680}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66828]}},"partials":[{"type":"npc","id":"1005657","obj":{"i":1005657,"n":"Uma Bugyo","l":53,"q":2,"t":"Far Eastern Envoy"}},{"type":"npc","id":"1000162","obj":{"i":1000162,"n":"Nicoliaux","l":52,"q":5}},{"type":"npc","id":"1000248","obj":{"i":1000248,"n":"Ceinguled","l":53,"q":5}},{"type":"npc","id":"1000786","obj":{"i":1000786,"n":"Mellaine","l":53,"q":3}},{"type":"item","id":"4680","obj":{"i":4680,"n":"Zoni","l":9,"c":24113,"t":46,"p":16}},{"type":"item","id":"6966","obj":{"i":6966,"n":"Golden Uma Kabuto","l":1,"c":40141,"t":34,"p":71}},{"type":"item","id":"6965","obj":{"i":6965,"n":"Crimson Uma Kabuto","l":1,"c":40140,"t":34,"p":71}},{"type":"item","id":"6967","obj":{"i":6967,"n":"Black Uma Kabuto","l":1,"c":40142,"t":34,"p":71}},{"type":"item","id":"6964","obj":{"i":6964,"n":"Uma Kabuto","l":1,"c":40139,"t":34,"p":71}},{"type":"quest","id":"66828","obj":{"i":66828,"n":"A Horse for Heavensturn","g":194,"l":"Gridania","s":19}}]}