{"quest":{"name":"All the Little Ladies (Limsa Lominsa)","location":"Limsa Lominsa","id":66839,"patch":2.1,"sort":30,"icon":100205,"eventIcon":71221,"issuer":1005897,"target":1004093,"genre":198,"journal":["The royal seneschal would see you enjoy the Little Ladies' Day festivities to the fullest.<br>※This quest is available for a limited time only.","As the royal seneschal tells it, a doll contest will be the focal point of this year's Little Ladies' Day. He urges you to participate, suggesting that you speak with Serendipity, mistress of the Goldsmiths' Guild in Ul'dah, about acquiring a doll for the contest.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","As might be expected given the season, the Goldsmiths' Guild already struggles to meet a deluge of doll orders, and cannot accept any further commissions. All hope is not lost, however, as Serendipity appears to have one last trick up her sleeve. Should your heart be set on proving yourself the daintiest doll-dresser in the land, speak with her once more."],"objectives":["Speak with Serendipity at the Goldsmiths' Guild."],"dialogue":[{"name":"BUTLER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, adventurer! I trust that you are enjoying yourself during this most wondrous of celebrations. I do believe <span class=\"emphasis\">this</span> year's Little Ladies' Day will be the most splendrous festival to have graced the realm."},{"name":"BUTLER","text":"What is Little Ladies' Day, you ask? Why, it is a day when the gentlemen of Eorzea assume the role of seneschals, doting upon the needs of Eorzea's fair maidens who are as princesses for the day."},{"name":"BUTLER","text":"The tradition began some three centuries ago with Princess Edvya Thorne of Ul'dah. Mayhap you have heard the tale?"},{"name":"BUTLER","text":"This year, I have the honor of being a <span class=\"emphasis\">royal</span> seneschal, overseeing preparations for the festivities. I take this role quite seriously."},{"name":"BUTLER","text":"Manifold are the delights to revel in during this fair season, but that which captures my fancy most of all is this year's Princess Edvya doll contest."},{"name":"BUTLER","text":"Even as we speak, townsfolk the realm over are tailoring gowns for their dolls in the likeness of Princess Edvya. Once ready, the little ladies of each city–state will cast their votes to determine the fairest figurine of them all."},{"name":"BUTLER","text":"The victor shall be rewarded handsomely for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> efforts, though I daresay the joy of dollcraft is its own reward. Would that I had time to participate, but there is ever so much to do! What say you give it a try? There is no better way to partake in the holiday spirit."},{"name":"BUTLER","text":"What? You lack the manual dexterity required to make a doll for the contest? I will hear no such nonsense!"},{"name":"BUTLER","text":"Still, if you so doubt your aptitude for crafting, you might consider purchasing a doll for the contest. It is not unheard of for those who cannot create their own to use one."},{"name":"BUTLER","text":"The key to this contest is the doll's dressing, so at the very least, you will have a proper foundation for your entry. With a little effort, your own little princess might be judged the most charming in the realm!"},{"name":"BUTLER","text":"Yes, hurry along and place an order with Serendipity at the Goldsmiths' Guild in Ul'dah. There is much to do if you wish to enter the contest in time."},{"name":"SERENDIPITY","text":"Greetings, and welcome to the Goldsmiths' Guild! People call me Mistress Serendipity, but you can call me Sera!"},{"name":"SERENDIPITY","text":"What did you say your name was? Ah, <span class=\"highlight\">Forename</span>, that's right! What can I do for you today?"},{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>! I imagine you've been refining your skills since last we met. What can I do for you today?"},{"name":"SERENDIPITY","text":"A Princess Edvya doll? Oh, dear..."},{"name":"SERENDIPITY","text":"I would like nothing more than to help you─truly, I would─but we're absolutely swamped with commissions. Why, it would take a miracle just to fill the orders we already have!"},{"name":"SERENDIPITY","text":"That said, I'd hate to see you miss out on the festivities."},{"name":"SERENDIPITY","text":"There simply <span class=\"emphasis\">must</span> be a way to get you a doll for the contest."},{"name":"SERENDIPITY","text":"You have your heart set on entering, yes? Then I suppose there is one thing we can try."},{"name":"SERENDIPITY","text":"Let me know when you're ready to get started, and I'll see if we can't get you a nice princess doll."}],"reward":{"gil":286,"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66841]},"partials":[{"type":"npc","id":"1005897","obj":{"i":1005897,"n":"Royal Seneschal","l":28,"q":1}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"quest","id":"66841","obj":{"i":66841,"n":"A Peach by Any Other Name","g":198,"l":"Ul'dah","s":32}}]}