{"quest":{"name":"The Puissance of Love","location":"Limsa Lominsa","id":66833,"patch":2.1,"sort":24,"icon":100200,"eventIcon":71221,"issuer":1005592,"target":1005591,"genre":196,"journal":["Ser Larsonient would see you partake in the Valentione's Day festivities.<br>※This quest is available for a limited time only.","Ser Larsonient, an Ishgardian knight of House Valentione, proudly states that he and his lady have traveled far and wide to bring the gift of love to lonely shores. He exhorts you to speak with Lady Lisette and lend your strength to their efforts.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Lisette de Valentione, a descendant of the legendary Countess Arabelle de Valentione, seeks to honor the memory of her ancestress by sharing the gift of love with the denizens of Eorzea, and seeks adventurers to assist in the task. Should the fair lady's promises of rewards most sweet win you over, you need only converse with her again."],"objectives":["Speak with Lisette de Valentione."],"dialogue":[{"name":"LARSONIENT","text":"Wherefore the dour mien, adventurer? Have your toils and troubles taken such a toll that you can spare not a moment to bask in the fragrance of a beautiful rose?"},{"name":"LARSONIENT","text":"No, this will not do─not in this season, and not in the presence of Larsonient, knight in proud service to House Valentione!"},{"name":"LARSONIENT","text":"<span class=\"emphasis\">Ardor and Affection</span>─so the Valentione house words are writ, and verily, for we do battle with the ever-encroaching specters of sequester and solitude with no less ferocity than we visit upon the dread wyrms that plague our ancestral demesne."},{"name":"LARSONIENT","text":"Not a single lovelorn tear shall be shed, no affection shall go unrequited─such is the noble crusade that brings the Lady Lisette to these far-flung shores."},{"name":"LARSONIENT","text":"If you would truly serve your realm, you would do well to seek her out in haste, and save your mundane adventuring for another day. For truly, there is no greater quest than the quest for love!"},{"name":"LARSONIENT","text":"Lady Lisette of House Valentione has come to this realm on a crusade of love, and awaits those who would lend their strength and passion to her cause. Will you rise to the occasion, or shirk away like <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who lacks the courage to bare <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heart to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> one true love?"},{"name":"LISSETE","text":"My love burns brighter than the sun, and deeper than the sea. Gladly would I share it with thee, and thee, and...ooh, most <span class=\"emphasis\">definitely</span> thee!"},{"name":"WOTA","text":"(-Adoring Fan-)She ain't just beautiful, she's a poetess to boot! M'lady, do say that last “thee” was for me!"},{"name":"LISSETE","text":"Mayhap no, and mayhap so...I fear you'll never know! After all, what is a lady without her secrets? Not a direct descendant of the Countess Arabelle de Valentione, that much is for certain!"},{"name":"LISSETE","text":"No, your ears do not deceive. I, Lisette de Valentione, trace my lineage back to the oft-sung beauty who did traverse the realm in lifelong pursuit of true love."},{"name":"LISSETE","text":"Mind you, my celebrated forebear's pilgrimage of passion was not simply to satisfy her own desires─heavens forbid! No, House Valentione ever seeks to share its riches with those less fortunate in love, and it is in that selfsame spirit of giving that I stand before you, in all my beauty, today!"},{"name":"WOTA","text":"(-Adoring Fan-)M'lady Lisette! Even a whit of yer love'll warm me lonely heart for a fortnight's journey! Chocolate, m'lady, I beg ye for a morsel of yer chocolate!"},{"name":"LISSETE","text":"Oh, the time will come for confections. Until then, mayhap you can content yourself with my affection?"},{"name":"LISSETE","text":"Well! What have we here, if not an adventurer. I imagine you lack not for glory or riches, but what of treasures closer to the heart?"},{"name":"LISSETE","text":"<span class=\"emphasis\">Ardor and Affection</span>, speak the words of House Valentione, and a realm bereft of both is a wretched one indeed. What say you put aside other allegiances for the present and serve as my loyal retainer for a while?"},{"name":"LISSETE","text":"I can promise you the experience will set your heart a–dancing and a–prancing. Serve me well, and I may even see fit to reward you...personally. Tee hee～♪"}],"reward":{"gil":382,"items":[{"id":6975},{"id":6976}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66834,66835,66836]},"partials":[{"type":"npc","id":"1005592","obj":{"i":1005592,"n":"Larsonient","l":28,"q":1}},{"type":"npc","id":"1005591","obj":{"i":1005591,"n":"Lisette De Valentione","l":28,"q":5}},{"type":"item","id":"6975","obj":{"i":6975,"n":"Valentione Trousers","l":1,"c":45392,"t":36,"p":45}},{"type":"item","id":"6976","obj":{"i":6976,"n":"Valentione Skirt","l":1,"c":45393,"t":36,"p":45}},{"type":"quest","id":"66834","obj":{"i":66834,"n":"Sweet, Sweet Love","g":196,"l":"Limsa Lominsa","s":25}},{"type":"quest","id":"66835","obj":{"i":66835,"n":"Right Here Waiting","g":196,"l":"Limsa Lominsa","s":26}},{"type":"quest","id":"66836","obj":{"i":66836,"n":"Love Is a Battleground","g":196,"l":"Limsa Lominsa","s":27}}]}