{"quest":{"name":"A Peach by Any Other Name","location":"Ul'dah","id":66841,"patch":2.1,"sort":32,"icon":100206,"eventIcon":71221,"issuer":1004093,"target":1004093,"genre":198,"journal":["Serendipity would help you procure a doll for Little Ladies' Day.<br>※This quest is available for a limited time only.","Eshtaime's Lapidaries is in need of a trustworthy adventurer who can promote its entry in the Little Ladies' Day doll contest. With the princess doll in tow, Serendipity would have you visit Gridania, offering the gossiping girls there budding blossoms in the spirit of the festival.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.<br><br>※The Princess Edvya doll minion will be lost upon dismissing it or logging out of the game. The doll can be retrieved by speaking with Serendipity.","Delighted by your beautiful blossoms and the Princess Edvya doll, the gossiping girls have chosen to vote for Eshtaime's Lapidaries' contest entry. Head back to Ul'dah and tell Serendipity of the good news.","Although the results are not yet final, Serendipity is pleased to tell you that your efforts have placed the doll from Eshtaime's Lapidaries very high in this year's rankings. Its jubilant demeanor is sure to impress even more little ladies as the contest continues."],"objectives":["With the Edvya doll minion summoned, offer blossoms to gossiping girls in Gridania.","Report to Serendipity at the Goldsmiths' Guild."],"dialogue":[{"name":"SERENDIPITY","text":"Eager to hear my plan, then? Excellent!"},{"name":"SERENDIPITY","text":"As you might imagine, we've received hundreds of orders in the weeks, even months leading up to the contest. Why, our most doll-crazed customers placed their orders not days after last year's festivities ended!"},{"name":"SERENDIPITY","text":"After hearing so many of them boast and brag about their intentions to demolish their opponents, I'm starting to wonder if they've forgotten what Little Ladies' Day is truly about."},{"name":"SERENDIPITY","text":"Yes...I can't put my finger on it, but I am convinced that you will bring something special to this contest─something none of the guild's other clients can."},{"name":"SERENDIPITY","text":"And so this is what I propose: Eshtaime's Lapidaries will submit its own entry to the contest. The goal is to win, then sell the doll at auction."},{"name":"SERENDIPITY","text":"Your job will be to visit each of the city–states, putting this masterwork on display for all to admire and adore."},{"name":"SERENDIPITY","text":"Little ladies of all nations will be casting their votes, after all, and they are not like to vote for a doll they have not seen."},{"name":"SERENDIPITY","text":"I trust that traversing the realm will not overly trouble an accomplished adventurer such as yourself."},{"name":"SERENDIPITY","text":"I've no doubt you're well accustomed to teleporting all about the place. I suppose it's faster, albeit slightly more expensive, but─ Ahem. Where was I? Oh, yes!"},{"name":"SERENDIPITY","text":"An admirable plan, is it not? You get to partake in the festivities, Eshtaime's Lapidaries gets its publicity, and I can get back to filling the several <span class=\"emphasis\">hundred</span> commissions I'm neglecting at this very moment. Everybody wins!"},{"name":"SERENDIPITY","text":"And now, the moment you've been waiting for. Behold, your very own Princess Edvya doll!"},{"name":"SERENDIPITY","text":"Isn't she darling? And if you thought you'd have to carry her, think again! You'll find she's quite capable of getting around on her own. "},{"name":"SERENDIPITY","text":"I recommend you first travel to Gridania. The little ladies there love to gossip, making it the perfect place for your doll's debut. Oh, and take these blossoms as well─a small gift will go a long way toward winning their hearts."},{"name":"SYSTEM","text":"The Princess Edvya doll minion must remain summoned in order to progress in this quest."},{"name":"SYSTEM","text":"The Princess Edvya doll minion will be lost upon dismissing it or logging out of the game."},{"name":"SYSTEM","text":"The doll can be retrieved by speaking with Serendipity."},{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>... I have a feeling I know why you're here..."},{"name":"Q1","text":"Tell Serendipity you lost the doll?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"SERENDIPITY","text":"Haha, no need to fret. She knows to return home when lost. Now off you go, and be sure to enjoy yourself!"},{"name":"SERENDIPITY","text":"Oh? Everything is fine? Wonderful! Well, off you go, then! Be sure to tell me all about your trip to Gridania when you're done."},{"name":"SERENDIPITY","text":"The gossiping girls of Gridania will spread word of the doll for us. Just remember to hand each a blossom for Little Ladies' Day."},{"name":"CHARISMA","text":"Dolls, dolls, dolls...each more beautiful than the next, yet none of them <span class=\"emphasis\">speak</span> to me. Did Princess Edvya concern herself with glory and riches? I think not!"},{"name":"CHARISMA","text":"Dolls, dolls, dolls...each more beautiful than the next, yet none of them <span class=\"emphasis\">speak</span> to me. Did Princess Edvya concern herself with glory and riches? I think not!"},{"name":"CHARISMA","text":"Flowers? For <span class=\"emphasis\">me</span>? That's terribly sweet of you."},{"name":"CHARISMA","text":"Did you know that peach blossoms were in full bloom on the very day that Princess Edvya went missing all those years ago? It is to honor her memory that the flower was adopted as the symbol of Little Ladies' Day, adorning the town as you see today."},{"name":"CHARISMA","text":"'Tis rare to see one who remembers the old traditions in this day and age. Why, even your doll is dressed in traditional garb! Well, <span class=\"emphasis\">I</span> know who <span class=\"emphasis\">I'm</span> voting for this year. Ah, if only I could have a doll like this of my very own!"},{"name":"CHARISMA","text":"What's that, you say? Eshtaime's Lapidaries plans to put this selfsame doll up for sale after the judging is over? It looks like a visit to Ul'dah just might be in order!"},{"name":"CHARISMA","text":"I wish you the best of luck in the contest! Not that you're like to need it, with such a masterpiece as your entry."},{"name":"CHARISMA","text":"This is the one day of the year where I have the chance to be treated like a princess, but all my friends care about is winning that blasted contest. &lt;sigh&gt; So here I am all alone, feeling like a pauper."},{"name":"CHARISMA","text":"This is the one day of the year where I have the chance to be treated like a princess, but all my friends care about is winning that blasted contest. &lt;sigh&gt; So here I am all alone, feeling like a pauper."},{"name":"CHARISMA","text":"Oh, I shall treasure these more than any gem! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"CHARISMA","text":"They say the peach blossom was emblazoned on the royal family's coat of arms during the Thorne Dynasty. It's why the peach blossom has become so deeply entwined with Little Ladies' Day─to remember Sultan Baldric Thorne, and the kindness he showed that poor miller girl in the tale so often retold."},{"name":"CHARISMA","text":"Such a lovely doll─as beautiful as any blossom, I say. If you're competing in the doll contest, rest assured that my vote is yours. It's the least I can do to repay your kindness."},{"name":"CHARISMA","text":"Best of fortune to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. You've certainly earned my vote."},{"name":"CHARISMA","text":"Of all the festivals held here in Gridania, Little Ladies' Day has to be my favorite, although I cannot help but feel something is amiss this year..."},{"name":"CHARISMA","text":"Of all the festivals held here in Gridania, Little Ladies' Day has to be my favorite, although I cannot help but feel something is amiss this year..."},{"name":"CHARISMA","text":"More peach blossoms? But of course! There were <span class=\"emphasis\">far</span> more peach trees in bloom around the Twelveswood last year. It was the perfect way to pay homage to Princess Edvya and the tradition of charity she gave birth to."},{"name":"CHARISMA","text":"What's more, planting saplings gives me reason to use the new gardening kit I purchased a few moons past. You wouldn't believe what a bargain it was, and made with high-quality darksteel to─"},{"name":"CHARISMA","text":"Ahem, excuse me. I got carried away for a moment. Is that a doll for the contest? Why, it's as pretty as a peach. You can count on my vote for the contest. Oh, think nothing of it─thanks to you, I finally have a use for my new gardening tools!"},{"name":"CHARISMA","text":"I pray you do well in the contest. Now where did I put that shovel?"},{"name":"SERENDIPITY","text":"Welcome back, <span class=\"highlight\">Forename</span>! You're just in time. Not long ago I received word of the contest rankings."},{"name":"SERENDIPITY","text":"It looks like you're slowly climbing up to number one! The little ladies of Gridania must have really been taken with you and the doll."},{"name":"SERENDIPITY","text":"She is oft reluctant to express her emotions─as princesses are wont to be─but I'm sure she's excited to hear the news, as well."},{"name":"SERENDIPITY","text":"I've crafted many a doll for this contest, and yet I find myself growing more and more partial to this one. If I had a vote, I daresay it would go to you."},{"name":"SERENDIPITY","text":"And it would appear that this little lady has grown partial to you as well, <span class=\"highlight\">Forename</span>. This is only the beginning, though. Keep up the good work and you're sure to win!"}],"reward":{"gil":286,"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66838,66839]},"next":[66842]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"quest","id":"66838","obj":{"i":66838,"n":"All the Little Ladies (Gridania)","g":198,"l":"Gridania","s":29}},{"type":"quest","id":"66839","obj":{"i":66839,"n":"All the Little Ladies (Limsa Lominsa)","g":198,"l":"Limsa Lominsa","s":30}},{"type":"quest","id":"66842","obj":{"i":66842,"n":"Say It with Peaches","g":198,"l":"Ul'dah","s":33}}]}