{"quest":{"name":"Say It with Peaches","location":"Ul'dah","id":66842,"patch":2.1,"sort":33,"icon":100207,"eventIcon":71221,"issuer":1004093,"target":1004093,"genre":198,"journal":["Serendipity has found another opportunity to garner attention for the princess doll.<br>※This quest is available for a limited time only.","With your trip to Gridania a resounding success, Serendipity would now have you visit Limsa Lominsa, to dazzle the capricious maidens with peach confetti in the spirit of Little Ladies' Day.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.<br><br>※The Princess Edvya doll minion will be lost upon dismissing it or logging out of the game. The doll can be retrieved by speaking with Serendipity.","Impressed by your ardor for tradition and the elegance of your Princess Edvya doll, the capricious maidens have decided to vote for Eshtaime's Lapidaries' contest entry. Make haste to Ul'dah and share the good tidings with Serendipity.","Thanks to your efforts, Eshtaime's Lapidaries' entry has taken the lead in the contest rankings. It seems all but certain that their doll will win the contest and be sold for a handsome sum. Your path to victory is not yet clear, however, as the Princess Edvya doll begins to exhibit unusual behavior."],"objectives":["With the Edvya doll minion summoned, use confetti to impress capricious maidens in Limsa Lominsa.","Report to Serendipity at the Goldsmiths' Guild."],"dialogue":[{"name":"SERENDIPITY","text":"Hello there, <span class=\"highlight\">Forename</span>. All rested up from your excursion to Gridania?"},{"name":"SERENDIPITY","text":"I would hope so, at least. If you would see your doll to victory, your journey has only just begun."},{"name":"SERENDIPITY","text":"Your next opportunity to shine light upon our little princess will be in Limsa Lominsa."},{"name":"SERENDIPITY","text":"It would appear that preparations for Little Ladies' Day have only just begun there."},{"name":"SERENDIPITY","text":"Make a good impression on the little ladies of La Noscea ahead of time, and, like as not, your doll will be the talk of the sea city–state before the competition even shows up!"},{"name":"SERENDIPITY","text":"Let me get your doll and you can be on your way. Now where did she get off to?"},{"name":"SERENDIPITY","text":"Now remember: preparations for Little Ladies' Day are still underway, and the little ladies of Limsa are likely full to bursting with anticipation, waiting for the festivities to begin. Take this pouch of confetti with you, and see if you can't fulfill their need for festival fun until the contest starts. "},{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>... I have a feeling I know why you're here..."},{"name":"Q1","text":"Tell Serendipity you lost the doll?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"SERENDIPITY","text":"Haha, no need to fret. She knows to return home when lost. Now off you go, and be sure to enjoy yourself!"},{"name":"SERENDIPITY","text":"Oh? Everything is fine? Wonderful! Well, off you go, then! Be sure to tell me all about your trip to Limsa Lominsa when you're done."},{"name":"SERENDIPITY","text":"Hurry along, lest another contest participant wins the favor of Limsa's little ladies first!"},{"name":"CHARISMA","text":"Little Ladies' Day is such a dreary affair! Princess, schmincess─you don't see anyone bathing me with blossoms or honeyed words, and that suits me just fine!"},{"name":"CHARISMA","text":"Little Ladies' Day is such a dreary affair! Princess, schmincess─you don't see anyone bathing me with blossoms or honeyed words, and that suits me just fine!"},{"name":"CHARISMA","text":"A celebration in <span class=\"emphasis\">my</span> honor? Tee hee! My loyal seneschal is far too kind! I suppose I could deign to partake in the festivities, if 'twould mean that much to you."},{"name":"CHARISMA","text":"Oh my, your doll is simply gorgeous. Will you be entering it in the contest? If you do, I will be sure to vote for you. You've been so kind to me today, it is the least I can do."},{"name":"CHARISMA","text":"A doll as splendid as yours is sure to win. I wish you luck in the contest!"},{"name":"CHARISMA","text":"Come ashore for Little Ladies' Day, they said. Princesses? Bah! On my ship, I am queen of the seas! City life holds nothing for me─not even a single admirer to welcome me upon my return... &lt;sniffle&gt;"},{"name":"CHARISMA","text":"“Come ashore for Little Ladies' Day,” they said. Princesses? Bah! On my ship, I am queen of the seas! City life holds nothing for me─not even a single admirer to welcome me upon my return... &lt;sniffle&gt;"},{"name":"CHARISMA","text":"Ohoho! <span class=\"emphasis\">Finally</span>, a seneschal come to pay homage to my greatness? Well, perhaps I could stay here a while longer, at least until the doll contest has ended. I would hate to disappoint one who adores me so."},{"name":"CHARISMA","text":"What is that you have there? A doll for the contest, you say? Well, friend, you can count on my vote. Anyone who takes time out to cheer me up the way you did deserves that much."},{"name":"CHARISMA","text":"As soon as voting begins, you can be sure I'll head right over. May Oschon smile upon you!"},{"name":"CHARISMA","text":"Does no one know how to decorate in this town? Honestly, what were they thinking with these drab colors and dreary ornaments? Were I Princess Edvya, I would be rolling about in my grave!"},{"name":"CHARISMA","text":"Does no one know how to decorate in this town? Honestly, what were they thinking with these drab colors and dreary ornaments? Were I Princess Edvya, I would be rolling about in my grave!"},{"name":"CHARISMA","text":"Amaranth, carmine, vermilion, peach! Finally, someone who knows how to coordinate <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> colors. And...what have we here? That's quite the dapper doll you have as well. I don't suppose you'll be entering the contest?"},{"name":"CHARISMA","text":"Well, if the decorations around town are any indication, there will be no competition worth speaking of. You'll have my vote all the same, though. I simply cannot bear the thought of some chromatically challenged doll winning."},{"name":"CHARISMA","text":"It's going to be auctioned off by Eshtaime's Lapidaries after the contest? Hmmm, I may have to save my gil for a trip to Ul'dah."},{"name":"CHARISMA","text":"No need to worry about the contest, friend. I'm sure the other entries will be as laughable as these festival decorations."},{"name":"SERENDIPITY","text":"Oh! Welcome back, <span class=\"highlight\">Forename</span>. I have wonderful news!"},{"name":"SERENDIPITY","text":"The rankings have been updated again, and do you know who stands at the top of the charts? No, not the porcelain doll from Black Rabbit Traders, you silly! <span class=\"emphasis\">You</span> do! I can't believe she's grown so popular in such short time."},{"name":"SERENDIPITY","text":"Why, just look─even <span class=\"emphasis\">she</span> rejoices at the news!<br>...At least, I'm sure she <span class=\"emphasis\">would</span>. If she weren't a doll."},{"name":"SERENDIPITY","text":"A-Ahem, I'm sorry. What was I saying again? Ah, yes, our petite princess seems to enjoy your company, and it shows. At this rate, she's certain to win the heart of every little lady in Eorzea."},{"name":"SERENDIPITY","text":"I can only imagine the rich sum she will fetch when she goes up for auction!"},{"name":"SERENDIPITY","text":"Keep up the good work, <span class=\"highlight\">Forename</span>. She's going to make some little lady very happy once this is all over."},{"name":"SERENDIPITY","text":"Hm? What's this? Unless I'm losing my mind, she looks somehow...different...than a moment ago. Her expression is almost...sad?"}],"reward":{"gil":286,"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66841]},"next":[66843]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"quest","id":"66841","obj":{"i":66841,"n":"A Peach by Any Other Name","g":198,"l":"Ul'dah","s":32}},{"type":"quest","id":"66843","obj":{"i":66843,"n":"A Real Peach","g":198,"l":"Ul'dah","s":34}}]}