{"quest":{"name":"Toss Fit Workout","location":"Coerthas Central Highlands","id":66846,"patch":2.1,"sort":360,"eventIcon":71221,"issuer":1006381,"target":1006385,"genre":94,"journal":["Torn between curiosity and scorn, Maucolyn would report an odd sighting.","Maucolyn has recently observed a local trader capering in the cold, tossing snowballs in what the dour chocobokeep assumes to be a fit of hypothermic hysteria. Speak with this trader, Duvicauroix, and inquire as to his well-being.","Happily, there proves to be a method to Duvicauroix's madness. The trader asserts that playing in the snow can warm the body and heart on a cold winter's day more so than even a fire, and teaches you how to /throw a snowball as the first step toward mastering this invigorating form of play..."],"objectives":["Speak with Duvicauroix."],"dialogue":[{"name":"MAUCOLYN","text":"I can't see as how I oughta care, but I saw a fella out throwin' snowballs at a snowman. Why anyone'd engage in such japery in the cold, I can't rightly say."},{"name":"MAUCOLYN","text":"Went nut gatherin' and lost more'n he found, is my guess. Ye better make sure that don't happen to <span class=\"emphasis\">you</span>, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Not that I know precisely <span class=\"emphasis\">what</span> happened, mind ye."},{"name":"MAUCOLYN","text":"What's that? Me? <span class=\"emphasis\">Ask</span>? I got my chocobos to see to. If Duvicauroix wants to upend his head soup on the snow, I can't see what business o' mine it'd be."},{"name":"MAUCOLYN","text":"Yep, that's his name─Duvicauroix. I don't know, he sells things, goes places. Don't seem like no kind o' life to me, beggin' pardon. Ye want to see him, I reckon he's somewhere about."},{"name":"DUVICAUROIX","text":"Walking softly, eh, adventurer? Those around here think I'm winter–drunk, I'll wager. Hah! Never seen a snow–toss before, the lazy by–blows."},{"name":"DUVICAUROIX","text":"Sit on your arse in front of a poor fire too long, and soon you got the swivin' white–knuckles. You'll sleep the better for tossing snowballs, without needing Lady Mead or Mistress Ale to sing the lullaby."},{"name":"DUVICAUROIX","text":"What do you say, eh? Why not give it a try? It's as simple as you'd imagine. Just reach on down, grab some of the powdery white, and <span class=\"highlight\">throw</span>!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Throw</span>!"}],"reward":{"emote":"Throw","xp":7087},"reqs":{"jobs":[{"lvl":36,"id":1}]},"next":[66847]},"partials":[{"type":"npc","id":"1006381","obj":{"i":1006381,"n":"Maucolyn","l":63,"q":2}},{"type":"npc","id":"1006385","obj":{"i":1006385,"n":"Duvicauroix","l":63,"q":4}},{"type":"quest","id":"66847","obj":{"i":66847,"n":"Rolling with the Snowies","g":94,"l":"Coerthas Central Highlands","s":360}}]}