{"quest":{"name":"The Ultimate Ballad","location":"Mor Dhona","id":66844,"patch":2.1,"sort":501,"icon":100191,"unlocksFunction":1,"eventIcon":71341,"issuer":1006950,"target":1008278,"genre":95,"journal":["Alys would like to introduce you to someone.","A wandering minstrel has come to Revenant's Toll in search of inspiration─namely, tales of heroic feats and derring-do. Alys can think of no one better qualified to quench the traveler's thirst for tales, and urges you regale the minstrel with your greatest exploits.","Your words serve to satisfy the minstrel beyond measure, who at once composes a ballad of your battle with the Ultima Weapon. Alas, his penchant for exaggeration has transformed the trial into something quite unlike what you remember...<br><br>※The Minstrel's Ballad: Ultima's Bane can be accessed via the Duty Finder.","Using the power of your imagination, you relive the events of that fateful day in the Praetorium, as described in the minstrel's ballad. Considering how certain details differ drastically, it may behoove you to correct the minstrel's misconceptions.","The minstrel makes no apologies for embellishing your tale, claiming that others would have done the same in time. A valid point, to be sure, though his artistic license will only serve to hasten the process..."],"objectives":["Speak with the wandering minstrel.","Confront the Ultima Weapon in the Minstrel's Ballad: Ultima's Bane.","Speak with the wandering minstrel."],"dialogue":[{"name":"ALYS","text":"Your reputation precedes you, <span class=\"highlight\">Forename</span>. In fact, it's for that reason that I'd like to introduce you to someone."},{"name":"ALYS","text":"That minstrel at the end of the bar wandered in here the other day─said he was seeking <span class=\"emphasis\">inspiration</span> for a new ballad, the sort only an adventurer of distinction could provide."},{"name":"ALYS","text":"Who better than the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who saved the world to give this minstrel the stories he seeks, eh? Humor the gentleman, I say!"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Dawn may banish even the darkest night,<br>Yet ever shall primal desires burn.</span>"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Two swords shall vie to lay them low─<br>A blade born of light and a blade forged of might.<br>Alas, man may entrust his fate unto but one.</span>"},{"name":"WANDERINGMINSTREL","text":"Lest you wonder, these are the words of Archon Louisoix. While not written as poetry, I find poetry within them nonetheless."},{"name":"WANDERINGMINSTREL","text":"By the gods─<span class=\"highlight\">Forename</span>, it <span class=\"emphasis\">is</span> you! We do indeed share a connection, don't we? Looking at you now, I am reminded of Mezaya's final verse:"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Seven waning moons see seven suns rise,<br>Divine order roils, fallen corpses writhe.</span>"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Souls from aether far, strangers from strange lands,<br>Yester with thine eyes, morrow by thine hands.</span>"},{"name":"WANDERINGMINSTREL","text":"A toast to your triumphant return, familiar stranger."},{"name":"WANDERINGMINSTREL","text":"It is a pleasure to be reunited with you once more. Yours is a tale that was destined to be immortalized in song."},{"name":"WANDERINGMINSTREL","text":"Years ago, when I arrived in this land, I was beset with peril day and night─forced to endure countless trials which tested my mind, my body, and my faith. "},{"name":"WANDERINGMINSTREL","text":"And I am not ashamed to admit that I would have faltered, had it not been for the help of a handful of nameless adventurers. Honest men and women who proffered the hand of friendship to a weary soul and led him safe from the darkness."},{"name":"WANDERINGMINSTREL","text":"When I look upon you, I am reminded of them. I can tell that you are well traveled, and possessed of both constancy and character. You are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the adventuring profession, yes?"},{"name":"WANDERINGMINSTREL","text":"I seek a valiant hero whose deeds might serve as inspiration, and I have reason to believe I have found <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"WANDERINGMINSTREL","text":"After all, was it not you who faced Gaius van Baelsar and his Allagan weapon? You must tell me everything─<span class=\"emphasis\">everything</span>─that happened! Omit nary a single detail, I beg of you!"},{"name":"WANDERINGMINSTREL","text":"...Truly a tale worthy of legend! And so eerily it matches the writings of Archon Louisoix!"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Two swords shall vie to lay them low─<br>A blade born of light and a blade forged of might.<br>Alas, man may entrust his fate unto but one.</span>"},{"name":"WANDERINGMINSTREL","text":"The Black Wolf was a conqueror who aspired to rule through might, and the weapon was key to his ambitions."},{"name":"WANDERINGMINSTREL","text":"Yet in the end, the people of Eorzea entrusted their fates to a brilliant blade─the Warrior of Light."},{"name":"WANDERINGMINSTREL","text":"A rather fitting moniker, in my humble opinion."},{"name":"WANDERINGMINSTREL","text":"Thank you. At last, I have found the inspiration I sought: a battle to decide the fate of a realm!"},{"name":"WANDERINGMINSTREL","text":"The words, the notes─I feel them coming together! Your tale, <span class=\"highlight\">Forename Surname</span>─your <span class=\"emphasis\">song</span>!"},{"name":"WANDERINGMINSTREL","text":"From an era long forgotten,♪<br>A blade of midnight drawn,♪<br>From a battlefield awakened,♪<br>A warrior who bears the dawn...♪"},{"name":"WANDERINGMINSTREL","text":"From an era long forgotten,♪<br>A blade of midnight drawn,♪<br>From a distant land uncharted,♪<br>A warrior who bears the dawn...♪"},{"name":"WANDERINGMINSTREL","text":"That might be my best work yet! Was it not just as you remember, <span class=\"highlight\">Forename</span>?"},{"name":"WANDERINGMINSTREL","text":"...Come now, what's the harm in a little exaggeration? I only changed a few details for dramatic effect."},{"name":"WANDERINGMINSTREL","text":"And even if I had not, others would have done so eventually. 'Tis the nature of every story to grow with each telling."}],"reward":{"gil":939,"xp":0,"instance":20013},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[67095]},"partials":[{"type":"npc","id":"1006950","obj":{"i":1006950,"n":"Alys","l":67,"q":7}},{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"instance","id":"20013","obj":{"i":20013,"n":"The Minstrel's Ballad: Ultima's Bane","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":61}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"67095","obj":{"i":67095,"n":"Sing Me Another Song","g":95,"l":"Mor Dhona","s":502,"f":1}}]}