{"quest":{"name":"Another Turn in the Coil","location":"The Waking Sands","id":66849,"patch":2.2,"sort":3,"icon":100228,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1008538,"involved":[1008539],"genre":14,"journal":["Urianger would have you delve deeper into the mysteries surrounding the elder primal Bahamut.","After sharing their findings with the Sons of Saint Coinach, Urianger and Alisaie have come to a conclusion: that the elder primal Bahamut can be banished into the aether if the colossal devices which hold him captive are deactivated. According to their information, the path to the second mechanism can be found in the North Shroud, where a gigantic fragment of Dalamud impales the ground. Make your way to Fallgourd Float and speak with Alisaie's assistant, Lieutenant Anaelle, to learn what dangers lie ahead.","Lieutenant Anaelle briefs you on the preliminary investigation made into the fragment, then requests that you speak with a colleague stationed nearer to the massive structure. Find the sharp-eyed private in Alder Springs, and listen to his more detailed report.","According to the private, the lack of an imperial presence meant that he and his colleagues were obliged to carve an approach to the fragment themselves. Though the ground itself is now passable, the scout warns you that much peril yet lies in wait. Hurry back to Lieutenant Anaelle, and rendezvous with Alisaie as planned.","You return to the serpent lieutenant's post, but it is Alphinaud, and not Alisaie, who meets you there. Your fellow Scion asks that you watch over his sister, and help her find her true purpose. Wasting little time, he then takes his leave, keen that Alisaie should not learn of his visit. Prepare and provision yourself well, and begin your exploration of the Second Coil of Bahamut.<br><br>※The Second Coil of Bahamut can be accessed via the Duty Finder."],"objectives":["Speak with Anaelle at Fallgourd Float.","Speak with the sharp-eyed serpent private.","Speak with Anaelle."],"dialogue":[{"name":"URIANGER","text":"A crystal-choked abyss lieth beneath the Carteneau Flats─the unholy cradle of an elder primal. And by thy hand were truths great and terrible wrested from those once-celestial depths."},{"name":"URIANGER","text":"Yet, as is oft the case, an answer doth breed a profusion of questions, and the unknown doth beckon with irresistible allure. Ne'er have the mysteries of the red moon lain so neatly within our grasp..."},{"name":"URIANGER","text":"Lady Alisaie hath sent word of her coming. 'Tis time once more to brave the precipice, and leap, unflinching, into the jagged wound that doth gape beneath the land."},{"name":"ALISAIE","text":"Mine apologies. I trust I have not kept you waiting overlong?"},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>. I am both delighted and reassured to have you at my side once more."},{"name":"ALISAIE","text":"I would not waste your time with trivialities─let us proceed directly to the discussion of that which we have learned, and that which we hope to learn anon."},{"name":"ALISAIE","text":"Initially, it was evidence of a new primal that led us to delve into the cavern beneath Castrum Occidens, and to explore the subterranean scars left after the fall of Dalamud."},{"name":"ALISAIE","text":"As you will well recall, what we found was a vast, largely intact fragment of the fallen satellite. And within the depths of that structure, we discovered not the new primal we had expected, but the broken form of Bahamut himself."},{"name":"ALISAIE","text":"...Yet even <span class=\"emphasis\">this</span> great revelation would soon be overshadowed...by the appearance of my own dear grandfather."},{"name":"URIANGER","text":"I have since shared our sundry findings with Rammbroes, preeminent scholar of the Sons of Saint Coinach, and he, in turn, did kindly furnish me with his theory concerning the elder primal's Allagan prison."},{"name":"URIANGER","text":"'Twould seem that Dalamud was constructed to gather unto itself the rays of the sun, and thence channel this radiant bounty unto the Crystal Tower."},{"name":"URIANGER","text":"The ancients saw great potential in Bahamut's capacity to manipulate energies of otherwise unmanageable magnitude─'twas for this reason that they did bind him within the red moon to serve as its living core."},{"name":"ALISAIE","text":"Do you remember the sight that greeted us at the culmination of our journey─the colossal devices that surrounded and seemed to cradle the incomplete form of the elder primal?"},{"name":"ALISAIE","text":"From the information provided to us by the Sons of Saint Coinach, we have learned that these contraptions were termed “internment hulks,” and that each bore the designation “Ragnarok-class.”"},{"name":"ALISAIE","text":"The purpose of these hulks is believed to be twofold. First, they are meant to act as binding coils, rendering Bahamut incapable of escape."},{"name":"ALISAIE","text":"And second...<br>They are meant to <span class=\"emphasis\">feed</span> him. Perversely, the selfsame energy which prevents him from moving also serves to sustain his corporeal manifestation. Bahamut is permitted neither to die, nor to truly live...he merely is allowed to <span class=\"emphasis\">be</span>."},{"name":"URIANGER","text":"For century upon century was the elder primal thus imprisoned─bound about in fetters so subtle in their working, and yet so adamant, that though his cell be destroyed, Bahamut lieth yet at the mercy of his long-departed captors."},{"name":"ALISAIE","text":"...It has long been held that the primals require the prayers of their faithful followers to exist, yet none alive worship Bahamut. Could it be, then, that the Allagans found a way to simulate prayer itself?"},{"name":"ALISAIE","text":"It seems the only logical explanation. I would postulate therefore that the regenerative mechanisms in question also supply something akin to the power of prayer."},{"name":"ALISAIE","text":"Consequently, if all of the internment hulks were to be rendered inactive, Bahamut <span class=\"emphasis\">should</span> dissolve into the aether."},{"name":"URIANGER","text":"Upon the evidence of thy previous foray, we determined that the elder primal is sustained by three such binding coils. Thus did we commence to scour the realm, and found in the Twelveswood an as-yet-unexplored fragment of the lesser moon bearing a most familiar aetheric signature..."},{"name":"ALISAIE","text":"And after conducting a preliminary investigation, we believe we have discovered a point from which this North Shroud fragment─and the second of the internment hulks─can be entered."},{"name":"ALISAIE","text":"As Eorzea's sword in the darkness, I would have you once more lead the charge."},{"name":"ALISAIE","text":"I will, of course, be there at your side."},{"name":"ALISAIE","text":"Once you have made your preparations, head to Fallgourd Float and make yourself known to my assistant, Serpent Lieutenant Anaelle. The fallen fragment is not far from the settlement, and her position provides a convenient rendezvous point."},{"name":"ALISAIE","text":"I <span class=\"emphasis\">will</span> break these Allagan fetters. For they bind my grandfather as surely as they bind Bahamut..."},{"name":"ANAELLE","text":"<span class=\"highlight\">Forename Surname</span>? I have been expecting you. My name is Anaelle."},{"name":"ANAELLE","text":"I have been accorded the rank of lieutenant within the Order of the Twin Adder that I may better assist Lady Alisaie with her endeavors here in the Twelveswood."},{"name":"ANAELLE","text":"Such authority has allowed me to act without interference from the local soldiery, and to conduct a preliminary investigation of the Alder Springs fragment."},{"name":"ANAELLE","text":"From what we have seen of the exterior, the structure shares many common features with the one you explored in La Noscea, and likely plays host to a similar complement of guardians."},{"name":"ANAELLE","text":"But I fear words alone will do little to prepare you for what lies ahead. Pray seek out my comrade to the south and west. He is charged with observing all that occurs in the vicinity of the fragment, and will be well placed to show you the thing if nothing less."},{"name":"FOLLOWER01313","text":"What business brings you to this broken land? Unless you fancy being ground to a bloody pulp under the granite fists of a wandering golem, I suggest you bugger o─"},{"name":"FOLLOWER01313","text":"Oh! My apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Lady Alisaie did send word of your impending arrival, but 'twould seem I've grown rather too accustomed to shooing away curious sellswords and reckless explorers."},{"name":"FOLLOWER01313","text":"Behold, if you will, one of the fallen shards of the red moon, Dalamud."},{"name":"FOLLOWER01313","text":"Our initial survey uncovered no evidence of the Empire's presence, which, while fortunate in itself, meant that the approach to the fragment had yet to be cleared."},{"name":"FOLLOWER01313","text":"After much effort, however, we succeeded in carving out a semblance of a path which should grant you access to the entrance. And that, I'm afraid, is where our progress ended."},{"name":"FOLLOWER01313","text":"The interior? Well, assuming that the architecture of this hulk resembles the first, the master controls you seek will be located on the bottommost layer─past all the ingenious and deadly defenses of which the ancient Allagans seemed so indecently fond."},{"name":"FOLLOWER01313","text":"If you would know more, I'm afraid there is nothing for it but to brave the depths of the fragment yourself."},{"name":"FOLLOWER01313","text":"Lady Alisaie will soon be arriving at Fallgourd. Pray do not tarry on your way back to the lieutenant's post─I imagine our young mistress will be most eager to commence the expedition."},{"name":"FOLLOWER01313","text":"The road ahead promises peril aplenty, and I would humbly suggest that this is not the occasion to stint on preparation or provisions. May the Twelve watch over you..."},{"name":"FOLLOWER01313","text":"Pray return to Fallgourd Float and await Lady Alisaie's arrival. Oh, and...do take care when you're exploring."},{"name":"ANAELLE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I trust the private's explanation was worth the journey?"},{"name":"ANAELLE","text":"Simply securing an approach to the fragment's entrance proved a monumental task. I dare not think what defeating its inner defenses will entail. If there is aught I might do to aid you─"},{"name":"ANAELLE","text":"Ah, Lady Alis─ Oh! My apologies, Master Alphinaud! Has there been a change of plan?"},{"name":"ALPHINAUD","text":"Urianger informed me of the impending expedition. I merely came to exchange a few words with my fellow Scion before <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> disappeared into the depths of the second coil."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>─though I would strenuously deny it were she present, my sister's admiration and affection for our grandsire exceeds even mine own."},{"name":"ALPHINAUD","text":"Upon the matter of his legacy, therefore, Alisaie is wont to go above and beyond the call of duty. In our grandfather's absence, she has made the salvation of Eorzea her personal crusade."},{"name":"ALPHINAUD","text":"'Twas that which prompted her to brave the perils of the first coil. Yet the fact that she risks her life in this manner is not the greatest of my concerns. No, it is her subsequent fixation upon my grandfather's shade that worries me most. This quest to rid the world of Bahamut must not become a quest to “save” a man long dead."},{"name":"ALPHINAUD","text":"My sister must needs have a better reason to fight. A time will come when the fate of the realm rests upon our shoulders, and when it does, we must be strong in our resolve─and certain of the stakes for which we risk all."},{"name":"ALPHINAUD","text":"There is a wide difference between fighting for the good of Eorzea, and fighting for the love of a man who <span class=\"emphasis\">died</span> for the good of Eorzea. Alisaie must choose her own path. She cannot rely on Grandfather to choose it for her, for he is gone."},{"name":"ALPHINAUD","text":"...I am glad that it is you with whom she makes this journey."},{"name":"ALPHINAUD","text":"If Alisaie is to discover a deeper purpose, then where better to find one than at the side of Eorzea's greatest champion? ...'Twas there that I found mine, after all."},{"name":"ALPHINAUD","text":"But 'tis past time I was gone! Fair fortune in your endeavors, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"Ah. Lieutenant Anaelle, was it? I would appreciate you making no mention of my presence here to my sister."},{"name":"ANAELLE","text":"Lady Alisaie is due to arrive at any moment. I shall abide in confident expectation of your triumphant return!"},{"name":"SYSTEM","text":"You now have access to the Second Coil of Bahamut. Begin your expedition into this fragment of Dalamud by speaking with Anaelle."},{"name":"SYSTEM","text":"Details such as the conditions of entry may also be had by speaking with the serpent lieutenant."},{"name":"ALISAIE","text":"How strange. Why could we not see all this before?"},{"name":"ALISAIE","text":"I suppose it is only to be expected that corrupted crystals should accompany a disturbance of this magnitude. After all, the fragment likely pierced the ground to a depth of many hundreds of yalms."},{"name":"ALISAIE","text":"The swirling aether leaking from the wound must warp the very air, creating a veil that hides these formations from view."},{"name":"ALISAIE","text":"Well, it is not as if we expected this to be a straightforward task. Let's tread carefully, shall we, <span class=\"highlight\">Forename</span>?"},{"name":"ALISAIE","text":"'Tis imperative that we win through to the depths of this structure, and disable the mechanism that powers Bahamut's regeneration. Of course, if we should chance to encounter my grandfather upon the way...I shall not let him go again─not while there is hope that he may yet be saved."},{"name":"ALISAIE","text":"...But mayhap we should put such thoughts from our minds until after we have successfully gained entrance to the place. That opening up ahead appears a suitable point of ingress."},{"name":"ALISAIE","text":"That armor─ No, it couldn't be!"},{"name":"ALISAIE","text":"Be on your guard, <span class=\"highlight\">Forename</span>! Though it defies all reason that he should live, <span class=\"alternative-container\"><span class=\"alternative\">you must surely recognize that armor</span><span class=\"alternative\">I know of only one who wears such armor</span></span>."},{"name":"ALISAIE","text":"<span class=\"alternative-container\"><span class=\"alternative\">It belonged to the Black Wolf's equal</span><span class=\"alternative\">He whom the Empire raised as high as the Black Wolf himself</span></span>. The legatus of the VIIth Legion."},{"name":"ALISAIE","text":"I speak of the madman who brought the Meteor project to fruition..."},{"name":"ALISAIE","text":"We face the White Raven, Nael van Darnus─harbinger of the Seventh Umbral Era!"},{"name":"NAEL","text":"(-???-)Nael...van...Darnus?"},{"name":"NAEL","text":"(-???-)Ah... That was the name of the fool who perished upon the eve of the promised age of glory. It should not be uttered within these hallowed halls."},{"name":"NAEL","text":"Out of love for His loyal servant, the one true deity named me Nael deus Darnus."},{"name":"ALISAIE","text":"The “one true deity”? Bahamut! He speaks of Bahamut!"},{"name":"NAEL","text":"O Lord Bahamut! Thy name is as sweet water to parched lips! How my heart swells at Thy sacred touch!"},{"name":"NAEL","text":"This blessed sanctum is the domain of my god and His beloved children. Seek to defile its glory, and you will answer to me."},{"name":"ALISAIE","text":"<span class=\"alternative-container\"><span class=\"alternative\">How is this possible? Alphinaud told me of Nael's final defeat at your hands.</span><span class=\"alternative\">How is this possible? From what Alphinaud has told me, Nael was slain on the eve of the Calamity.</span></span>"},{"name":"ALISAIE","text":"（★未使用／削除予定★）"},{"name":"ALISAIE","text":"Whatever the truth of the matter, we must be on our guard─there can be no reasoning with the worshipers of a primal."},{"name":"ALISAIE","text":"I am reminded of the passages beneath Castrum Occidens. We must have traveled quite some distance below the surface."},{"name":"ALISAIE","text":"More of the same tunnels... Twelve be good! Surely they cannot continue all the way down from the upper floors?"},{"name":"ALISAIE","text":"'Tis difficult to see inside, but I have a terrible feeling those corridors house more of the dreadful guardians you have already faced."},{"name":"ALISAIE","text":"It is said that the Allagans excelled in the creation of chimerical beasts, and that the red moon teemed with a thousand thousand fantastical monstrosities─all to prevent the enemies of the ancient empire from releasing the elder primal."},{"name":"ALISAIE","text":"I wonder, the creatures that prowl these halls─could they be the “beloved children” of which Nael spoke?"},{"name":"ALISAIE","text":"Well, this is yet another mystery to ponder upon our return. Shall we continue onwards?"},{"name":"ALISAIE","text":"That...that surely cannot be Dalamud!? How─ Where are we!?"},{"name":"NAEL","text":"<span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span><span class=\"alternative\">Your companion knows this place well. For it was here that  slew Nael van Darnus.</span><span class=\"alternative\">The final resting place of Nael van Darnus.</span></span>"},{"name":"NAEL","text":"（★未使用／削除予定★）"},{"name":"NAEL","text":"This is a grave for the undeserving."},{"name":"NAEL","text":"And for the crime of trespassing upon my god's sanctuary, this place shall serve as your grave too!"},{"name":"ALISAIE","text":"No!"},{"name":"NAEL","text":"In the hour of his failure, Nael van Darnus felt the currents of aether begin to bear away his essence. But before oblivion could claim the last of him, a divine will reached out...and I was born."},{"name":"NAEL","text":"Then did the words of my god resound in mine ears..."},{"name":"NAEL","text":"“Bring unto mine enemies crushing defeat, that they might know despair without end! And claim thee thus the victory which thou wert once denied!”"},{"name":"ALISAIE","text":"...'Twould seem that little remained of Nael's essence when Bahamut plucked him from the brink of oblivion. And the result was this strange...simulacrum. Nevertheless, her aura bespeaks great power. She channels the rage of the elder primal himself..."},{"name":"NAEL","text":"Lord Bahamut! Thy wish is my command! None shall 'scape Thine unquenchable fury!"},{"name":"NAEL","text":"Come, ye dull, unthinking beasts...bare your teeth!"},{"name":"NAEL","text":"They will avail you naught in the calamity to come!"},{"name":"ALISAIE","text":"Poor creature. Would that you had never been born."},{"name":"ALISAIE","text":"You had surrendered your physical form, and collapsed into aether... But Bahamut denied you death, and imprisoned what little was left of you in an aetherial shell resembling...what, I wonder? Images from your memory, perhaps?"},{"name":"ALISAIE","text":"But that shell is now broken. And your primal deity seems disinclined to sustain your existence."},{"name":"NAEL","text":"My “primal deity”? I kneel to no eikon! What need have I to beg the favor of such filth!?"},{"name":"NAEL","text":"(-Nael van Darnus-)I am Nael van Darnus! Legatus of the VIIth Legion..."},{"name":"NAEL","text":"(-Nael van Darnus-)No... A moment... My thoughts are clouded...and this body is not mine own. Could it be that you spoke the truth? Was I ensorcelled by the lesser moon's ancient prisoner? ...That will not happen again."},{"name":"ALISAIE","text":"You speak as if Bahamut no longer controlled you! But that's impossible! Once a primal ensnares a mind, it cannot be freed!"},{"name":"ALISAIE","text":"Unless... Unless Bahamut simply relinquished his claim. What need has he of a broken spirit bound for the aetherial realm?"},{"name":"NAEL","text":"(-Nael van Darnus-)Ohhh...that I should fall prey to the very influence I sought to purge from the land. The irony is galling."},{"name":"NAEL","text":"(-Nael van Darnus-)But do not assume that all of my actions were chosen for me. It was <span class=\"emphasis\">my</span> will that the Meteor project be resurrected─mine and none other."},{"name":"NAEL","text":"(-Nael van Darnus-)Yet it seems that my grand designs were destined to fail. Even the ungentle release of death was denied me..."},{"name":"ALISAIE","text":"Nael, please. You must tell us more of the Calamity. I must know the truth of what has befallen the world...and what has become of my grandfather, Archon Louisoix."},{"name":"NAEL","text":"(-Nael van Darnus-)You are Louisoix's grandchild? Ah, the fates are generous with their cruelty."},{"name":"NAEL","text":"(-Nael van Darnus-)Continue on, if you would have your answers─they await you at the terminus of your path. But know that this path leads only to despair. The light of truth was ever harsh and unforgiving..."},{"name":"ALISAIE","text":"Why do you say this? Grandfather will be freed once we put a stop to Bahamut's restoration, will he not? What are you not telling us!?"},{"name":"NAEL","text":"(-Nael van Darnus-)Steel yourself, child. Only unbending resolve and merciless strength can conquer what lies ahead."},{"name":"NAEL","text":"(-Nael van Darnus-)The weak can do naught but weep under the pall of their own misery. As did the frail child I once was..."},{"name":"LOUISOIX","text":"(-???-)Silence, chattering raven. Your wretched wings are broken, and you shall soar no more."},{"name":"NAEL","text":"(-Nael van Darnus-)My crimson moon... Your brilliance sears mine eyes..."},{"name":"ALISAIE","text":"I recognize that voice, <span class=\"highlight\">Forename</span>. But never would he say such words..."},{"name":"ALISAIE","text":"Come, let us finish what we came to do. All will be put aright when the final hulk lies dormant. Grandfather will be himself again...I'm sure of it."},{"name":"ALISAIE","text":"Bahamut regenerates more swiftly than I had anticipated. Let us hope that disabling this coil will serve to slow the process."},{"name":"ALISAIE","text":"The display seems...different, but the controls appear to mimic the mechanism we found in the La Noscean hulk. It shouldn't pose a problem."},{"name":"ALISAIE","text":"...<span class=\"highlight\">Forename</span>, forgive me. The moment I beheld Nael's transformation, hope wilted in my heart. I did not believe you could stand against the manifestation of Bahamut's power."},{"name":"ALISAIE","text":"For all your fabled strength and skill, I felt certain then that I was going to lose you─just as I lost my grandfather. Even he, a man for whom naught seemed impossible, was humbled before Bahamut's might."},{"name":"ALISAIE","text":"And yet, look how far we have come."},{"name":"ALISAIE","text":"'Tis incredible the feats of which we are capable─our boundless potential."},{"name":"ALISAIE","text":"'Twas this capacity for greatness, I believe, that Grandfather so dearly wished to protect. With all that has occurred, I have come to understand that much at least."},{"name":"ALISAIE","text":"'Tis done. Shall we make our way back to the surface and gather our thoughts? We have seen much that will benefit from Urianger's learned perspective."},{"name":"ALISAIE","text":"Grandfather!? It <span class=\"emphasis\">is</span> you! Then...why?"},{"name":"LOUISOIX","text":"Abandon this quest, Alisaie. I will not countenance further sabotage of the coils."},{"name":"ALISAIE","text":"“Sabotage”? But...but we must disable the coils if we are to prevent Bahamut's revival!"},{"name":"LOUISOIX","text":"Your defiance seals your fate."},{"name":"ALISAIE","text":"No... No, you are not who I thought you were... My grandfather would <span class=\"emphasis\">never</span>..."},{"name":"LOUISOIX","text":"Foolish girl."},{"name":"LOUISOIX","text":"How could the White Raven allow herself to be bested by such sniveling opponents?"},{"name":"LOUISOIX","text":"Listen well. We all exist at the pleasure of one divine will."},{"name":"LOUISOIX","text":"And the word of Lord Bahamut is absolute!"},{"name":"LOUISOIX","text":"Scurry back into your holes, vermin. You have been granted this one reprieve. But should you be so foolish as to crawl into my lord's domain again, I will crush the life from you myself."},{"name":"ALISAIE","text":"That light in Grandfather's eyes... He has suffered the same fate as Nael."},{"name":"ALISAIE","text":"My grandsire is no more. That was naught but a phantom that profanes his noble memory..."},{"name":"ALISAIE","text":"This mockery must be expunged! I will not rest until I free Grandfather's soul from Bahamut's tyranny."},{"name":"ALISAIE","text":"Do you hear me, Bahamut? Your time is at an end! Eorzea─and my family─will be avenged!"}],"reward":{"gil":2064,"instance":30007,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66696]},"next":[66850]},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1008538","obj":{"i":1008538,"n":"Anaelle","l":57,"q":1,"t":"Serpent Lieutenant"}},{"type":"npc","id":"1008539","obj":{"i":1008539,"n":"Sharp-eyed Serpent Private","l":57,"q":1}},{"type":"instance","id":"30007","obj":{"i":30007,"n":"The Second Coil of Bahamut - Turn 1","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":90}},{"type":"quest","id":"66696","obj":{"i":66696,"n":"Alisaie's Pledge","g":14,"l":"The Waking Sands","s":2,"f":1}},{"type":"quest","id":"66850","obj":{"i":66850,"n":"Alisaie's Resolve","g":14,"l":"Northern Thanalan","s":4,"f":1}}]}