{"quest":{"name":"A Real Peach","location":"Ul'dah","id":66843,"patch":2.1,"sort":34,"icon":100208,"eventIcon":71221,"issuer":1004093,"target":1004093,"genre":198,"journal":["Serendipity has learned of another opportunity to showcase the princess doll.<br>※This quest is available for a limited time only.","Serendipity delightfully informs you that your tour of Eorzea has been a success─the doll she entrusted to you on behalf of Eshtaime's Lapidaries has surged to the top of the princess contest polls. In order to ensure victory, she suggests you put on a show in Ul'dah. With the princess doll in tow, set out to the streets and perform a /dance for crowds of potential voters.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.<br><br>※The Princess Edvya doll minion will be lost upon dismissing it or logging out of the game. The doll can be retrieved by speaking with Serendipity.","Your sure-footed display of festival spirit has Ul'dah's most influential aesthetes abuzz with talk of your princess doll. Head back to the Goldsmiths' Guild and relay the good tiding to Serendipity.","No sooner did Serendipity make mention of your now-commanding lead in the polls, nearly guaranteeing victory, than did your princess doll have a curious fit, ceasing to function before your eyes. Upon closer examination, Serendipity discovers that its core has burned out, and suspects that the princess doll had grown quite fond of you─so much so, that the thought of being sold at auction overwhelmed its systems. The doll may yet be saved, but due to its unique architecture, Serendipity requires peach tree oil before any repairs can be attempted. Gather petals from the peach trees in Ul'dah, that Serendipity may extract the oil needed to save the doll.","You have scoured the flora of Ul'dah for the freshest, most fragrant peach blossoms to be had, and gathered three sackfuls for Serendipity. Deliver them to the Goldsmiths' Guild, that Serendipity may begin making repairs to the doll.","Just when it seemed that all repair efforts were for naught, the doll's eyes lit up again upon hearing Serendipity offer it to you. It would seem the doll feigned a malfunction in order to realize its one true desire: to remain in the company of the adventurer of whom it had grown so fond. The guildmaster then muses that this behavior is not unlike Princess Edvya's own ruse so many years ago. Though the contest has long since been lost, Serendipity is comforted by the knowledge that you, she, and the doll have celebrated the true spirit of Little Ladies' Day in a way that few do these days. She implores you to take the doll as your own, and grant its holiday wish."],"objectives":["With the Edvya doll minion summoned, /dance for the festival gathering at the Gold Court.","With the Edvya doll minion summoned, /dance for the festival gathering near Sunsilk Tapestries.","With the Edvya doll minion summoned, /dance for the festival gathering outside Arrzaneth Ossuary.","Speak with Serendipity at the Goldsmiths' Guild.","Gather petals from the tree at the Gold Court.","Gather petals from the tree near Sunsilk Tapestries.","Gather petals from the tree outside Arrzaneth Ossuary.","Deliver the peach blossom petals to Serendipity."],"dialogue":[{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>. Forgive me, I've been a bit preoccupied with your doll. She's been acting awfully strange lately, though none of her parts seem damaged. I do wonder if something's wrong..."},{"name":"SERENDIPITY","text":"But no matter! She began functioning properly when I mentioned your name. If I didn't know better, I'd say she's taken a fancy to you. Oh, but that would be silly, wouldn't it?"},{"name":"SERENDIPITY","text":"With the contest nearing its end, I daresay it's time for a grand finale─something the little ladies of Eorzea will remember for ages to come."},{"name":"SERENDIPITY","text":"I have it on good authority that a number of dignitaries will be visiting Ul'dah for the festival. They have a bit more sway in the voting, if you know what I mean, so we really have to make a good impression."},{"name":"SERENDIPITY","text":"Though not likely to make an appearance in public, talk of a spectacle in town should make them take notice. I've often heard they foster a love for the arts, so a dance of sorts should be to their liking. If they were to hear a dancer is entering the contest, I'm sure they would look favorably upon your doll."},{"name":"SERENDIPITY","text":"Speaking of which, where did she wander off to this time?"},{"name":"SERENDIPITY","text":"Is it just me, or does she seem...upset about something?"},{"name":"SERENDIPITY","text":"Hm. I must be imagining things. It wouldn't be the first time! But anyway, off with you. I expect good news of your performances around town."},{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>... I have a feeling I know why you're here..."},{"name":"Q1","text":"Tell Serendipity you lost the doll?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"SERENDIPITY","text":"Haha, no need to fret. She knows to return home when lost. Now off you go, and be sure to enjoy yourself!"},{"name":"SERENDIPITY","text":"Oh? Everything is fine? Wonderful! Well, off you go, then! Be sure to tell me all about your performance when you return."},{"name":"SERENDIPITY","text":"There's no need to be nervous. It's not like you'll trip while doing your dance. Why, I remember the time I fell down a flight of stairs practicing a dance for─ Ahem, never mind that. Just do your best and everything will be fine."},{"name":"SYSTEM","text":"Take center stage and excite the crowd with a <span class=\"highlight\">dance</span>."},{"name":"SYSTEM","text":"Retrieve the Princess Edvya doll minion from Serendipity before trying to impress the townsfolk."},{"name":"GUNSHU","text":"(-Dark-haired Elezen-)Well, if that ain't the best dancin' I ever did see! No one said anythin' about dancers in the festival. But wait, what's <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> doin' with a doll?"},{"name":"GUNSHU","text":"(-Enticed Onlooker-)Isn't it delightful? The spitting image of Princess Edvya. Oh, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> must be entering the contest! Just wait until my friends hear about this."},{"name":"GUNSHU","text":"(-Excited Youth-)What a show! I once said the Miqo'te dancers on Ruby Road were the best in Ul'dah, but now I stand corrected."},{"name":"GUNSHU","text":"(-Enthralled Maiden-)Oh, forget the dance... Look at <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> doll! The gentle amaranth pink of its dress, accented with hues of peach and creamy white... A masterpiece of dollcraft to be sure. I best cast my vote before the ballot boxes are closed."},{"name":"GUNSHU","text":"(-Beguiled Archer-)Well, well, it would seem someone's been enjoying <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> this Little Ladies' Day."},{"name":"GUNSHU","text":"(-Enchanted Elezen-)Amazing... The likeness to Princess Edvya is uncanny. And look at her little fan! Have you ever seen anything like it? I know which doll <span class=\"emphasis\">I'm</span> voting for."},{"name":"SERENDIPITY","text":"Welcome back, <span class=\"highlight\">Forename</span>. There's been another update of the rankings, and your lead over the other entries grows with every passing hour. It's beyond belief!"},{"name":"SERENDIPITY","text":"First place is all but assured now, thanks almost entirely to your efforts. As a matter of fact, Eshtaime's Lapidaries has already begun preparations to auction off the princess doll."},{"name":"SERENDIPITY","text":"Wh-What!? Whatever is the matter with her <span class=\"emphasis\">now</span>? I know she was acting a bit odd before, but this..."},{"name":"SERENDIPITY","text":"No, this is not good...not good at all. Why, just look at her core! It may very well be beyond repair..."},{"name":"SERENDIPITY","text":"Gods, I'm going to get an earful for this... Even if victory in the contest is all but assured, who would want to purchase a broken doll? &lt;sigh&gt; I just don't understand what went wrong."},{"name":"SERENDIPITY","text":"She...she was the perfect little princess─so warm and full of life! &lt;sob&gt;<br>...Well, not to say she was actually <span class=\"emphasis\">alive</span>, but you know what I mean. And she always seemed so happy every time you came to─"},{"name":"SERENDIPITY","text":"But...of course! Why did I not realize it sooner?"},{"name":"SERENDIPITY","text":"Little Ladies' Day is the one time of year when every girl can be a princess, and maybe─if fortune smiles upon her─have her heart's desire granted. Our little princess cared not for fame or riches, <span class=\"highlight\">Forename</span>. All she wanted...was to be with you."},{"name":"SERENDIPITY","text":"What a fool I've been! I simply must make amends─yes, we must mend her and set things right. My supplies should be right around...oh, dear. I seem to have exhausted my supply of oil on all of my Little Ladies' Day commissions."},{"name":"SERENDIPITY","text":"It was no ordinary oil, you see─it was prepared specifically for the princess dolls, extracted from only the freshest of peach blossom petals. I fear what might happen if I leave the doll alone in this state... Please, could you go out and gather some more in my stead?"},{"name":"SERENDIPITY","text":"She is very delicate and prone to rust in her current immobile state, so please hurry back. Be sure to pick only the most fragrant blossoms you can find."},{"name":"SERENDIPITY","text":"Please, <span class=\"highlight\">Forename</span>, tell me you've found blossoms for the repairs. Time is of the essence."},{"name":"SERENDIPITY","text":"They're beautiful! Positively perfect for the oil we need. Let's get started, then. There's not a moment to lose."},{"name":"SERENDIPITY","text":"Phew, that should do it. Her core's been reset and gears well lubricated. I only pray we weren't too late to save her..."},{"name":"SERENDIPITY","text":"Oh, please come back to us! Little Ladies' Day just won't be the same without our little princess."},{"name":"SERENDIPITY","text":"This can't be happening... I was so careful with the repairs; how can she not be working? &lt;sniffle&gt; I wish there was more I could do, but...I'm so sorry... I've failed you both."},{"name":"SERENDIPITY","text":"It wasn't supposed to turn out like this, <span class=\"highlight\">Forename</span>! She was destined for fame, fortune, and a lavish, loving home fit for a true princess... Only now do I realize...that was never what she truly wanted."},{"name":"SERENDIPITY","text":"&lt;sigh&gt; In any event, the contest has concluded by now. And since we've heard no news, I can only assume that someone else's doll was crowned prettiest princess. Please forgive me─my thoughtless treatment of my own creation has rendered your hard work for naught."},{"name":"SERENDIPITY","text":"I intend to reimburse Eshtaime's Lapidaries for the doll, but I would ask one last favor of you. Would you...take her with you? I am loath to ask after all you've already done, but I just couldn't bear to see her cast aside, and besides...I'm quite certain that this is what she would have wanted."},{"name":"Q2","text":"Accept the Princess Edvya doll?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"SERENDIPITY","text":"Please don't be that way, <span class=\"highlight\">Forename</span>. After all the time you've spent together, do you mean to say you feel nothing for our little princess? I beg of you, please reconsider."},{"name":"SERENDIPITY","text":"By the Twelve! Is she...?"},{"name":"SERENDIPITY","text":"Oh, joy of joys, <span class=\"highlight\">Forename</span>! Our little princess... She's come back to us!"},{"name":"SERENDIPITY","text":"And she looks no worse for wear despite this whole ordeal. It appears our oh-so-innocent little princess was having a bit of fun with us."},{"name":"SERENDIPITY","text":"I've every reason to be angry, and yet...why, I feel a tear coming to my eye. To think she would resort to such ends, risking her very <span class=\"emphasis\">life</span>─such as it were─to be with you. Yes, it almost reminds me of something..."},{"name":"SERENDIPITY","text":"But of course─the legend of Princess Edvya herself! Longing to see the world beyond the palace walls, she disguised herself as a peasant girl and snuck out undetected. I think she would be proud of our clever little princess here."},{"name":"SERENDIPITY","text":"Every little lady─even if she's just a doll─deserves the chance to make her dreams come true, wouldn't you say? Yes, I can think of no better way to celebrate the true spirit of Little Ladies' Day. <span class=\"highlight\">Forename</span>, I leave our little Princess Edvya in your loving care!"}],"reward":{"items":[{"id":6986}],"xp":1680},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66842]}},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"6986","obj":{"i":6986,"n":"Wind-up Edvya","l":1,"c":59457,"t":81}},{"type":"quest","id":"66842","obj":{"i":66842,"n":"Say It with Peaches","g":198,"l":"Ul'dah","s":33}}]}