{"quest":{"name":"Rolling with the Snowies","location":"Coerthas Central Highlands","id":66847,"patch":2.1,"sort":360,"eventIcon":71221,"issuer":1006385,"target":1006385,"genre":94,"journal":["When there's more snow on the ground than hot meals on the table, all you can do is join Duvicauroix in a little snow–toss.","Duvicauroix wants you to toss a snowball at him. Do as bade and /throw at the merry trader, making sure to aim first.","You have learned that performing a /throw in a snowy spot lets you toss snowballs. Pleased with your zeal but disinclined to continue serving as your target, Duvicauroix suggests you seek out a snowman.","You have found to your astonishment that the snowman seems hungry, but also that he refuses to eat anything that throws as weakly as you do. Prove yourself a worthy snack and /throw another snowball at him.","Your second toss has done nothing to convince the frozen chatterbox. Take aim again and /throw hard to still the stream of criticism.","The third toss has proven to be the charm, and the snowman is finally content with the quality of your throw. While the snowman's final warning to you is mildly unnerving, you take some comfort from the fact that no further mention was made of being eaten. Tell Duvicauroix of what has passed.","Duvicauroix cheerily dismisses as a delusion your tutelage at the icy hands of a snowman. While you have no great desire to be leeched, you may want to consider some physicking if you continue hearing voices..."],"objectives":["/throw a snowball at Duvicauroix.","/throw a snowball at the snowman.","/throw again at the snowman.","/throw once more at the snowman.","Report to Duvicauroix."],"dialogue":[{"name":"DUVICAUROIX","text":"You learned the motion? How about we have ourselves some fun with it, huh? Reach on down into the powder and <span class=\"highlight\">throw</span> a goodly sized lump at me, hard as you can!"},{"name":"DUVICAUROIX","text":"Though, make sure you take aim first, eh? Much as I'd get a good laugh out of it, I doubt Drividot here would fancy a face full of snow."},{"name":"DUVICAUROIX","text":"Just get me in your sights and <span class=\"highlight\">throw</span> your best snowball. No need to hold back─I'm not made of spun glass!"},{"name":"DUVICAUROIX","text":"Just get me in your sights and <span class=\"highlight\">throw</span> your best snowball. No need to hold back─I won't hold a grudge!"},{"name":"DUVICAUROIX","text":"Oof! Ohoho, you've got an arm to write songs about! Bet that felt good, eh? Hah, cold hands, warm heart─that's the secret to long living!"},{"name":"DUVICAUROIX","text":"Really, there ain't much more to it─just <span class=\"highlight\">throw</span> where there's snow underfoot. 'Course, if you try to do the same on other kinds of ground, you'll end up with a fistful of nothing. And where's the gain in that?"},{"name":"DUVICAUROIX","text":"Anyhow, what I like to do is toss snowballs at snowmen. That way, you can hurl 'em as hard as you fancy."},{"name":"DUVICAUROIX","text":"Snowmen don't mind─they're made of the same stuff, eh? Go on, give it a go. Try <span class=\"highlight\">throw</span>ing at the snowman right outside."},{"name":"SNOWMAN","text":"(-Snowman-)..."},{"name":"SNOWMAN","text":"(-Snowman-)..."},{"name":"SNOWMAN","text":"(-Snowman-)...[Race]. Is...throwing? Should I eat...? Maybe I eat."},{"name":"SNOWMAN","text":"(-Snowman-)No, I no eat dummy-dummy. Dummy-dummy throw like zero! Only become yummy-yummy if <span class=\"highlight\">throw</span> like hero!"},{"name":"SNOWMAN","text":"(-Snowman-)Throw it to make show, show of strength! Throw to say, “Nothing to fear, the hero is here!”"},{"name":"SNOWMAN","text":"(-Snowman-)You throw like zero, not hero! Aim for me, dummy-dummy!"},{"name":"SNOWMAN","text":"(-Snowman-)Aim is yummy-yummy! Still much to fear, though, hero not here. <span class=\"highlight\">Throw</span> to me again! "},{"name":"SNOWMAN","text":"(-Snowman-)You're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, aren't you? A grown <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Stop crying and <span class=\"highlight\">throw</span>!"},{"name":"SNOWMAN","text":"(-Snowman-)Mwack, no! That no throw. You do better. You throw throw!"},{"name":"SNOWMAN","text":"(-Snowman-)Uwehehehe! Finally, a throw of a hero, all yummy, no dummy! There's snow on my boots! I happy now!"},{"name":"SNOWMAN","text":"(-Snowman-)Snow tossed, hero made. I tired, need to sleep. Don't worry what they say. They call you crazy..."},{"name":"SNOWMAN","text":"(-Snowman-)Revolutionaries always get called crazy."},{"name":"DUVICAUROIX","text":"There you are. You were at it a while! Nothing like a little hoarfrost on the nose hair, eh?"},{"name":"DUVICAUROIX","text":"Snowman talked, you say? Don't see how... I rolled the thing myself, and it wasn't like I engaged a swivin' white mage."},{"name":"DUVICAUROIX","text":"Now, you go lie down a spell and don't go saying nothing to them inside. They'll figure you a winter–drunk for sure. They might even put you in for a leeching."},{"name":"DUVICAUROIX","text":"Come by for another snow-toss when you're feeling less fanciful! This damned winter can't last forever. But if it does, maybe I'll start a snow–toss tourney, see if I can make a gil or two."}],"reward":{"xp":7087},"reqs":{"jobs":[{"lvl":36,"id":1}],"quests":[66846]}},"partials":[{"type":"npc","id":"1006385","obj":{"i":1006385,"n":"Duvicauroix","l":63,"q":4}},{"type":"quest","id":"66846","obj":{"i":66846,"n":"Toss Fit Workout","g":94,"l":"Coerthas Central Highlands","s":360}}]}