{"quest":{"name":"Alisaie's Resolve","location":"Northern Thanalan","id":66850,"patch":2.2,"sort":4,"icon":100229,"unlocksFunction":1,"eventIcon":71341,"issuer":1008540,"target":1007478,"genre":14,"journal":["Alisaie is keen to seek Urianger's learned opinion on the disturbing events which unfolded during your expedition into the second coil.","Alisaie bids you return to the Waking Sands and deliver your initial report to Urianger, promising that she will join you as soon as she has set her troubled thoughts in order. Make for Vesper Bay.","Alisaie appears at the Waking Sands even as you complete your summary of events for Urianger. In the discussion which follows, the Archon focuses his attention on the unexpected presence of Nael van Darnus, the defeated imperial legatus who once sought to bring the red moon Dalamud crashing down upon Eorzea. Urianger surmises that van Darnus's early efforts to establish control of the Allagan satellite inadvertently awoke the sleeping Bahamut, exposing the White Raven to the elder primal's irresistible will. Given the role played by such thralls in perpetuating Bahamut's existence, Alisaie declares that all must be found and eliminated─Louisoix's aetherial shade included. With that, she thanks you and departs, leaving Urianger to muse upon the value of uncovering a truth that promises so much anguish and sorrow..."],"objectives":["Speak with Urianger at the Waking Sands."],"dialogue":[{"name":"ALISAIE","text":"Truly, it is wonderful to escape that stifling air, and return to...northern Thanalan again, it would appear."},{"name":"ALISAIE","text":"I must thank you, <span class=\"highlight\">Forename</span>. Were it not for your bravery, I strongly doubt that I would be standing here now. Ah, but you need not tarry on my account─the danger has passed. Pray go on ahead, and apprise Urianger of all that has occurred."},{"name":"ALISAIE","text":"I will join you anon. My thoughts are yet unruly, and I would rest here a while..."},{"name":"ALISAIE","text":"Pray return to the Waking Sands, and report our success to Urianger. I shall follow in due course."},{"name":"URIANGER","text":"The triumphant hero doth return! Thine eyes speak of the dread task's completion: the second coil now lieth dormant!"},{"name":"URIANGER","text":"...Yet I sense the tidings thou bearest are not altogether glad. Pray tell me: what ill hath cast the shadow which falleth now across thy brow?"},{"name":"URIANGER","text":"An old foe and an old friend..."},{"name":"URIANGER","text":"So 'twas but the aetherial shadow of Master Louisoix that Lady Alisaie beheld─an unnatural conjuration in thrall to the elder primal."},{"name":"URIANGER","text":"That the fiend should deign to choose him of all men... Even in full knowledge of the shade's true nature, I would be hard-pressed to weather such a confrontation."},{"name":"URIANGER","text":"Yet what agonies must the young mistress have endured? Such torment did she ne'er deserve. Mayhap 'twere better if the Lady Alisaie did absent herself from future forays unto the coils."},{"name":"ALISAIE","text":"(-???-)I have come too far to surrender to grief, Urianger."},{"name":"URIANGER","text":"My lady..."},{"name":"ALISAIE","text":"I am resolved to defeat these fiends─and naught shall sway me from my path. Now, let us peer more deeply into the well of our discoveries."},{"name":"URIANGER","text":"As you wish, my lady."},{"name":"URIANGER","text":"By your leave, I would speak first of the coil's late guardian, Nael van Darnus."},{"name":"URIANGER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Fear not. No lengthy history shall I give to thee of this man whom thou hast now defeated twice. Or man <span class=\"emphasis\">and maid</span>, I should rather say, through Bahamut's queer oversight.</span><span class=\"alternative\">Van Darnus was a legatus of the Garlean Empire who strove to bring about Eorzea's final destruction, only to fall even as the sixth sun did set... If thou hast heard tales of the “White Raven,” then it is he of whom they speak. Aye, “he,” I say, for Nael was for a certainty no maid.</span></span>"},{"name":"URIANGER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Recallest thou the lunar transmitter? The device which thou didst lay to waste was but a crude substitute for the Crystal Tower of the ancients. As a means to command the red moon, it wanted for both subtlety and safety.</span><span class=\"alternative\">The noble house of van Darnus, as we discovered all too late, had long safeguarded the wisdom of ancient Allag. 'Twas thus that the legatus came to learn the true nature of Dalamud, and to seek to employ the red moon as a weapon against Eorzea.</span></span>"},{"name":"URIANGER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Ere the transmitter was complete, 'tis my belief that Nael sought to make contact with Dalamud, only to rouse the satellite's slumbering prisoner. And thenceforth did the White Raven's soul belong to Bahamut.</span><span class=\"alternative\">But the Crystal Tower─and the mechanisms required to command the satellite─yet lay hidden beneath the ground, compelling Nael to construct a far less subtle mechanism. And in his first faltering attempts to communicate with Dalamud, he did likely rouse the satellite's slumbering prisoner. Thenceforth did the White Raven's soul belong to Bahamut.</span></span>"},{"name":"URIANGER","text":"（★未使用／削除予定★）"},{"name":"URIANGER","text":"（★未使用／削除予定★）"},{"name":"URIANGER","text":"（★未使用／削除予定★）"},{"name":"ALISAIE","text":"He was fortunate indeed to acquire so powerful a thrall by chance."},{"name":"ALISAIE","text":"'Tis little wonder he was so loath to part with him. Why let a simple thing like death deprive one of so useful a pawn? ...Though we may accuse him of bungling van Darnus's resurrection, I daresay Bahamut was as content to have a handmaiden as a manservant."},{"name":"ALISAIE","text":"I only hope that the two thralls we encountered were the extent of his flock."},{"name":"ALISAIE","text":"Yet I cannot help but dwell on Nael's words─those “beloved children” of whom he spoke."},{"name":"ALISAIE","text":"I assumed at first that he referred to the moon's beastly guardians...but should Bahamut have enslaved other mortals, we must needs remove this source of worship. Otherwise, our efforts to disable the coils shall be for naught."},{"name":"URIANGER","text":"Forgive me mine indelicacy, my lady... Thou art wise indeed to speak of expunging the primal's thralls...but canst thou truly pursue a course which would cost thee thine own grandsire?"},{"name":"ALISAIE","text":"My heart and mind are as one on this matter. Grandfather's salvation can be won but by a single method: the destruction of Bahamut, and aught that might serve to sustain him."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>─while Urianger and I endeavor to ascertain the existence of any further thralls, I suggest you grant yourself a moment's respite. Rest assured that I will contact you the moment I have need of your inimitable talents."},{"name":"ALISAIE","text":"That we have achieved so much, I owe to you. I fear, however, that our trials have barely begun..."},{"name":"URIANGER","text":"Though time had dulled the pain of thy passing, I find that I am wounded afresh."},{"name":"URIANGER","text":"Master Louisoix... What good shall come of this unending search for knowledge and truth?"},{"name":"URIANGER","text":"Long have I believed the pursuit of such treasures to be the duty of every true Sharlayan."},{"name":"URIANGER","text":"Yet when each new revelation serveth only to heap further anguish upon those whom we would fain protect, must we truly reach for more?"},{"name":"ALPHINAUD","text":"So, you have found your resolve, dear sister."},{"name":"ALPHINAUD","text":"Will you now find a use for the secret─for the key that only you and I hold?"},{"name":"ALPHINAUD","text":"Given our familial propensity for curiosity, you would do well to remember that keys may serve to seal doors as well as to unlock them. And Bahamut is a most unwelcome guest, to whom the door should never have been opened."},{"name":"SYSTEM","text":"You may view the opening cutscene for the Second Coil of Bahamut before accepting this quest."},{"name":"Q1","text":"View the opening cutscene?"}],"reward":{"gil":3752,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[30010],"quests":[66849]},"next":[65579]},"partials":[{"type":"npc","id":"1008540","obj":{"i":1008540,"n":"Alisaie","l":46,"q":1}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"instance","id":"30010","obj":{"i":30010,"n":"The Second Coil of Bahamut - Turn 4","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":105}},{"type":"quest","id":"66849","obj":{"i":66849,"n":"Another Turn in the Coil","g":14,"l":"The Waking Sands","s":3,"f":1}},{"type":"quest","id":"65579","obj":{"i":65579,"n":"Fragments of Truth","g":14,"l":"The Waking Sands","s":5,"f":1}}]}