{"quest":{"name":"The Kobold and the Beautiful","location":"Outer La Noscea","id":66859,"patch":2.2,"sort":0,"icon":100237,"beast":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1005931,"target":1005931,"involved":[1005927,1006325,1007941,1008947],"genre":38,"journal":["Recent reports from Camp Overlook have Skaetswys ill at ease.","As Skaetswys tells it, officers at Camp Overlook are gravely concerned about the recent movements of Zo Ga and his followers in light of your recent sabotage efforts. Fearing the wrath of her superior, she asks you to report to Commander Bloeidin in her stead.","Commander Bloeidin chews out you and Skaetswys for fanning the flames in U'Ghamaro, demanding that the two of you take responsibility for the resulting chaos. Return to the 789th Order Dig and consult with Skaetswys as to the best course of action.","Your conversation with Skaetswys is interrupted by a frantic Gi Gu, who is concerned about the fate of his beloved Bi Bi, yet─as expected─far too cowardly to take any action of his own. Make for the Kobold Dig before any dire fate befalls her.","You spot Bi Bi in the clutches of a particularly nasty group of kobolds. Dispatch her tormentors and free the poor kobold lass from her bonds.","Though grateful to be rescued, the loss of something she was carrying has Bi Bi in a fluster. Search the Kobold Dig for her missing plans.","You have managed to find what appear to be plans for a new prototype furnace. Deliver the plans to Bi Bi and see if this is indeed her missing property.","A tearful Bi Bi explains that the plans you found were drafted by her at Zo Ga's behest, under threat of exile if she did not comply with his wishes. Furthermore, she makes a shocking confession that she shares Gi Gu's affections, and wishes only to see him show signs of courage before making her feelings known. She bids you deliver a letter that she hopes will stir Gi Gu to action.","Bi Bi's missive explains in detail Zo Ga's plan to employ a new furnace to wreak havoc upon all who oppose him, as well as the punishment that awaits the kobold lass should she refuse to lend the fugleman her aid. His beloved's life in danger, Gi Gu is spurred to uncommon action─which involves walking a few yalms to where Ba Go stands and asking the acolyte to take care of the rest. Meanwhile, Skaetswys fears that Zo Ga's cravings for death and destruction might mean trouble for more than just the 789th Order. She vows to join the hapless kobolds in their fight, and hopes that you will do the same.","Ever unimpressed by the hapless Gi Gu, Skaetswys nevertheless is convinced that it is in everyone's best interests that Zo Ga be stopped once and for all. Continue to lend your strength to the 789th Order, that the brutal bully might be cut down to size."],"objectives":["Speak with Bloeidin at Camp Overlook.","Speak with Skaetswys at the 789th Order Dig.","Search the Kobold Dig for signs of 175th Order Alchemist Bi Bi.","Rescue 175th Order Alchemist Bi Bi.","Search the Kobold Dig for the missing furnace plans.","Deliver the furnace plans to 175th Order Alchemist Bi Bi.","Deliver Bi Bi's letter to 789th Order Pickman Gi Gu at the 789th Order Dig.","Speak with Skaetswys."],"dialogue":[{"name":"SKAETSWYS","text":"Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was 'opin' to see. I fear ill tidin's drift in from Camp Overlook. Zo Ga and 'is scurvy crew 'ave been quiet─<span class=\"emphasis\">too</span> quiet for the commander's likin', if ye catch me drift."},{"name":"SKAETSWYS","text":"Aye, our scouts 'ave reason to believe that they've recovered from their recent setback, and are gatherin' strength for a retaliatory strike."},{"name":"SKAETSWYS","text":"I'd speak to Commander Bloeidin meself, but it'd seem 'e's none too pleased with me efforts on the 789th Order's behalf."},{"name":"SKAETSWYS","text":"If I know the commander, 'e's far more like to cut an adventurer like yerself some slack. Ye'll travel to Camp Overlook in my stead, won't ye?"},{"name":"SKAETSWYS","text":"I fear for the safety of me comrades, but Commander Bloeidin's more likely to gut me than greet me if I show me face at Camp Overlook. You'll go in me stead, won't ye?"},{"name":"BLOEIDIN","text":"Oi, <span class=\"highlight\">Forename</span>. You haven't <span class=\"emphasis\">happened</span> to see my favorite lieutenant around, have you?"},{"name":"BLOEIDIN","text":"I'm afeared dear Skaetswys has steered us right into the eye of a storm. &lt;sigh&gt; Our creed might be “till sea swallows all,” but I wouldn't mind if it swallowed <span class=\"emphasis\">her</span> first..."},{"name":"BLOEIDIN","text":"Anyroad, you've been workin' with her up till now, right? Good! That means <span class=\"emphasis\">you</span> can help clean up this mess! Now listen, and listen well."},{"name":"BLOEIDIN","text":"Me scouts just returned from U'Ghamaro─it seems our friend Zo Ga was so enamored of yer little prank that he's united the most powerful orders in the tunnels under his black flag."},{"name":"BLOEIDIN","text":"That's right─scores upon scores o' the buggers haulin' sulphur, saltpeter, and the gods know what else to all corners o' the mountain."},{"name":"BLOEIDIN","text":"Aye, there's no doubt in me mind─the bombs that they brandished the last time were only the start of it."},{"name":"BLOEIDIN","text":"You and Skaetswys started this by castin' yer lot with the 789th─now ye can get us out o' this. Whatever it takes to keep Zo Ga off our backs until we can bolster our defenses, ye make it happen. Understood?"},{"name":"BLOEIDIN","text":"I've seen enough of those bilge rats and their bloody alchemy to last me a lifetime. I'm countin' on ye to clean up this mess, <span class=\"highlight\">Forename</span>."},{"name":"SKAETSWYS","text":"So it's as I feared. Zo Ga's taken the 'elm at U'Ghamaro, and is brewin' a most nasty sort of revenge."},{"name":"SKAETSWYS","text":"But the commander's right. Our fingerprints are all over this mess, so it's our duty to 'elp wipe it up. Yes, we must─"},{"name":"GIGU","text":"Oh, woe is me─misfortune, misery, woe! Please help me, adventurer! Yes, yes, you must!"},{"name":"SKAETSWYS","text":"Gah! What are ye yappin' about this time!?"},{"name":"GIGU","text":"My beloved Bi Bi─my dear, my darling, my beloved. She said she would meet me hours ago, but she is nowhere to be found! No, no, nowhere at all!"},{"name":"GIGU","text":"She said she would come by way of the Kobold Dig. If she was caught by Zo Ga, I shudder to think what would happen─tremble, shiver, shudder. You must save her! Yes, yes, you must!"},{"name":"SKAETSWYS","text":"You spineless coward! She's <span class=\"emphasis\">yer</span> girl─go yer bloody self!"},{"name":"SKAETSWYS","text":"Bah, I'd 'ave better luck squeezin' ale from a stone than talkin' sense into this one. Let's go, <span class=\"highlight\">Forename</span>."},{"name":"GIGU","text":"Oh, Bi Bi, be safe. Yes, yes, you must. Without you, I am lost─adrift, astray, lost!"},{"name":"SKAETSWYS","text":"Let's go, <span class=\"highlight\">Forename</span>. With any fortune, this Bi Bi can shed some light on Zo Ga and 'is dark designs."},{"name":"KOBOLDA01323","text":"(-Kobold Outlaw-)Looking for trouble, are you? Yes, yes, you are!"},{"name":"KOBOLDB01323","text":"(-Kobold Outlaw-)We'll gut you─slice you, slash you, gut you!"},{"name":"BIBI","text":"Free at last! You are Gi Gu's adventurer friend, yes? Yes, yes, you are."},{"name":"BIBI","text":"Hmph! I <span class=\"emphasis\">knew</span> that coward wouldn't have the courage to save me himself. He is useless─hapless, hopeless, useless!"},{"name":"BIBI","text":"So scared was I! Yes, yes, I was petrified. I came to deliver these plans, and─hm? The plans! They are gone─missing, vanished, gone!"},{"name":"BIBI","text":"What plans? Why, the plans for Zo Ga's new furnace! I must find them, or Zo Ga will punish me. Yes, yes, his wrath knows no bounds!"},{"name":"BIBI","text":"Oh, whatever shall I do? Without those plans, I'm as good as dead─slaughtered, butchered, dead!"},{"name":"BIBI","text":"Could it be!? Yes, yes, you have found them! This is twice you have saved me, adventurer. So brave you are─daring, dauntless, brave. So different from a certain kobold I know... So different from...me."},{"name":"BIBI","text":"Harsh I am to Gi Gu─unkind, unfeeling, harsh─but the truth is, I too lack the heart to stand up to Zo Ga. Yes, yes, I too am a coward."},{"name":"BIBI","text":"I too am an alchemist, you see. A skilled one, yes, yes, I am. So what did Zo Ga do? He threatened to exile the 175th from U'Ghamaro unless I did his dirty work."},{"name":"BIBI","text":"A furnace, he wanted, but not just any furnace. No, no, a fiery, fearsome, formidable one. A furnace to end all furnaces."},{"name":"BIBI","text":"I have no wish to serve Zo Ga. No, no, none at all. What I truly wish is to be happy with Gi Gu─cheerful, content, happy. And yet...and yet..."},{"name":"BIBI","text":"...I simply cannot stand to see him grovel so! No, no, I cannot bear it. I am no better, this I know, but Gi Gu is different. Yes, Gi Gu is a leader of kobolds!"},{"name":"BIBI","text":"I beg of you, adventurer. Yes, yes, I do. Take this to Gi Gu, that it might stir his heart─rouse, shake, stir. If this fails, there is no hope for him. No, no, none at all."},{"name":"GIGU","text":"&lt;sniff&gt; Bi Bi, my beloved─my fair, my darling, my beloved. Will I never gaze upon you again?"},{"name":"GIGU","text":"My Bi Bi is safe? Oh, joy─glee, happiness, joy! And what is this...? A letter?"},{"name":"GIGU","text":"...What!? Threatening my beloved Bi Bi!? This time Zo Ga has gone too far! This is unforgivable─inexcusable, unpardonable, unforgivable!"},{"name":"GIGU","text":"I will not take this sitting down. No, no, I will take this letter straight to Ba Go, and have him do something immediately!"},{"name":"GIGU","text":"Bi Bi shall see that I am a kobold of action─decision, resolve, action!"},{"name":"GIGU","text":"Gi Gu and the 789th will be a laughingstock no more. No, no, no longer!"},{"name":"GIGU","text":"The scary woman you call friend─she will stand up to Zo Ga with us, yes? Yes, yes, she will."},{"name":"SKAETSWYS","text":"Hm, well, I suppose <span class=\"emphasis\">some</span> sign o' life out of 'im is a start."},{"name":"SKAETSWYS","text":"Though it'd 'ave been nice if somethin' 'ad put the wind in 'is sails before the poor kobold lass got <span class=\"emphasis\">kidnapped</span>. I swear, what she sees in that one..."},{"name":"SKAETSWYS","text":"Don't get me wrong, now─I've fallen for me share of milksops and cravens in me day, always 'opin' they'd make somethin' of 'emselves... An' each time, those selfsame 'opes were betrayed."},{"name":"SKAETSWYS","text":"To tell ye the truth, I've 'ad more than me fill of 'elpin' the 'opeless. But one thing's clear─if Zo Ga's plot comes to fruition, it won't just be Gi Gu and 'is lot that pay the price."},{"name":"SKAETSWYS","text":"Aye, I say we cut that big bully down to size─not simply for the kobolds' sake, but for our own! Are ye with me, <span class=\"highlight\">Forename</span>!?"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the 789th Order."},{"name":"SYSTEM","text":"New kobold tribal daily quests are now available from 789th Order Dustman Bo Bu."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the 789th Order vendor."},{"name":"POPMESSAGE","text":"You sense a hostile presence!"}],"reward":{"gil":776,"xp":13965},"reqs":{"beastrank":2,"jobs":[{"lvl":48,"id":34}],"quests":[66858]},"next":[66860]},"partials":[{"type":"npc","id":"1005931","obj":{"i":1005931,"n":"Skaetswys","l":350,"q":5,"t":"Storm Lieutenant"}},{"type":"npc","id":"1005927","obj":{"i":1005927,"n":"789th Order Pickman Gi Gu","l":350,"q":9}},{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"npc","id":"1007941","obj":{"i":1007941,"n":"175th Order Alchemist Bi Bi","l":350,"q":1}},{"type":"npc","id":"1008947","obj":{"i":1008947,"n":"175th Order Alchemist Bi Bi","l":350,"q":1}},{"type":"quest","id":"66858","obj":{"i":66858,"n":"No-good Zo Ga's Ambition","g":38,"l":"Outer La Noscea","s":0,"f":1}},{"type":"quest","id":"66860","obj":{"i":66860,"n":"Revenge of the Furred","g":38,"l":"Outer La Noscea","s":0,"f":1}}]}