{"quest":{"name":"How Low Can You Go","location":"Outer La Noscea","id":66857,"patch":2.2,"sort":0,"icon":100235,"beast":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1005927,"target":1005927,"involved":[1005931],"genre":38,"journal":["789th Order Pickman Gi Gu looks your way with pleading eyes.","Gi Gu shares with you the sad tale of the 789th Order─unable to meet the demanding quotas imposed upon them by their betters, they have been exiled from the tunnels and forced to eke out a meager existence on the fringes of kobold society. While the only route to redemption is to improve their mining output, this is easier said than done, for the ore veins in their new home are as good as barren. Answer Gi Gu's sad plea by traveling to the Kobold Dig and retrieving the dregs cast aside by his more accomplished peers, that the 789th might salvage even a scrap of dignity.","You retrieved a few misshapen chunks of low-grade ore─not much to look at, but still a fair sight more than Gi Gu and his men have been able to muster for quite some time. Deliver your haul to Gi Gu, that he might have some chance of appeasing his superiors at his forthcoming evaluation.","Gi Gu welcomes your contributions, and begs you to keep him company until the conclusion of his evaluation that he might be spared the wrath of Zo Ga─a particularly intimidating superior who has little patience for the underperforming 789th. Stand off and observe the inner workings of kobold society from the shadows.","13th Order Fugleman Zo Ga haughtily dismisses not merely the mining efforts of the 789th Order, but their very right to exist. It would seem that Zo Ga's ideal vision of kobold society takes the concept of survival of the fittest to rather unforgiving extremes. Speak with the visibly shaken Gi Gu and offer what comfort you can.","Your heart-to-heart with Gi Gu was interrupted by Lieutenant Skaetswys, herself having just returned from Camp Overlook. Appalled at the pickman's utter lack of pride and dignity, she has sworn to lend her strength to the 789th, that they might stand up to their oppressors. Speak once more with Gi Gu and see how he feels about the offer.","Equally as afraid of Skaetswys as he is of Zo Ga, the faltering Gi Gu would ask you to remain close by and lend your services to the 789th Order. The pickman, for his part, seems quite content to shrink in the shadows while others do the dirty work, but mayhap your efforts on the dig's behalf will embolden him yet..."],"objectives":["Obtain worthless ore from the Kobold Dig.","Deliver worthless ore to 789th Order Pickman Gi Gu.","Wait just out of sight.","Speak with 789th Order Pickman Gi Gu.","Speak again with 789th Order Pickman Gi Gu."],"dialogue":[{"name":"GIGU","text":"You are still here, yes? Yes, yes, you are. You would hear the sad tale of Gi Gu and the 789th? Then listen, listen and weep─sob, cry, weep."},{"name":"GIGU","text":"You think you people have it tough? You know nothing. No, nothing at all. Ours is a world of kobold–eat–kobold. Yes, ours is a constant struggle─a labor, a toil, a struggle for survival."},{"name":"GIGU","text":"Dig and dig, we do─dig for ore and riches. Dig well, and we are rewarded. Better digs are given us, and more weight do our words carry. Dig poorly...and we are shunned─reviled, scorned, shunned."},{"name":"GIGU","text":"You know that kobold orders have numbers, yes? Yes, yes, you know. The smaller the number, the greater the order. You find this curious, but this is the kobold way."},{"name":"GIGU","text":"How many orders, you ask? Yes, yes, how many? Seven hundred and eighty-nine we have, and not one more. We exist at the backside of kobold society─the bottom, the rear, the backside."},{"name":"GIGU","text":"And so from the tunnels we are driven. Dig more, find more, make more wealth for your betters. Then you can come home, they say. But this dry vein holds no treasures. No, no, nothing. Meanwhile, our kin in U'Ghamaro hoard treasures so great that they toss gold away─toss it away like garbage."},{"name":"GIGU","text":"Yes, their trash is our treasure! Any moment now, we will be judged on our haul, but our sack is empty─barren, bare, empty. You must go down to the dig and bring back something, anything for us. I beg of you─yes, yes, even the shabbiest scraps will do!"},{"name":"GIGU","text":"From dawn till dusk, dusk till dawn we dig, and yet our barrows are empty─bare, barren, empty. We are not welcome down below, but you, you will find something for us, yes? Yes, yes, you must!"},{"name":"GIGU","text":"Could it be? Yes, yes, it could! Why, these dirty lumps─chunks, scraps, lumps─exceed our haul from the past three moons! You have my thanks, adventurer, and my gratitude."},{"name":"GIGU","text":"Oh, but you must not leave so soon! No, no, longer you must stay─persist, sojourn, stay. Until Zo Ga has come and gone!"},{"name":"GIGU","text":"Who is Zo Ga, you ask? Zo Ga is a giant among kobolds─a beast, a brute, a giant! So smart, so smart and strong is Zo Ga, that his order surges to the top of the ranks. Zo Ga would lead us all into a new era of prosperity...or so Zo Ga claims."},{"name":"GIGU","text":"But this is a sham. Yes, Zo Ga cares only for Zo Ga. Weak you are? Zo Ga will use you, then throw you away. Yes, Zo Ga stomps all over us─tramples, stamps, stomps. This is why you must stay, adventurer! Stay, and watch over us from the shadows."},{"name":"GIGU","text":"The ground trembles─quakes, shakes, trembles! Zo Ga will soon arrive! You must hide and watch over us from the shadows!"},{"name":"GIGU","text":"&lt;gulp&gt;"},{"name":"KOBOLDGALA01321","text":"(-Comely Kobold Lass-)This place reeks─stinks, smells, reeks!"},{"name":"KOBOLDGALB01321","text":"(-Fetching Kobold Lass-)You said you were takin' us to a steam bath! You're a big fat liar─a cheat, a fraud, a liar!"},{"name":"ZOGA","text":"(-Swaggering Kobold-)Stop your bloody squealing! Work before pleasure─or do you want to join the riffraff in their rotten trash heap? No, no, I thought not."},{"name":"GIGU","text":"G-Greetings, Zo Ga! How kind of you to visit our humble dig! I must say, you're looking especially impressive today─imposing, overpowering, overwhelming, overbearing, ah..."},{"name":"ZOGA","text":"Yeah, yeah, and you're looking as scruffy as ever...whatever your name was."},{"name":"ZOGA","text":"But enough talk─my time's worth more than your sorry hide. Now let's see what you've got for me..."},{"name":"ZOGA","text":"Is this your monthly haul, or what popped out of your arsehole this morning? Once a sluggard, always a sluggard─stragglers, sloths, sluggards, the lot of you!"},{"name":"GIGU","text":"The 789th are no sluggards, Zo Ga. No, no, not a one! Every day do we toil in the mines─slave, sweat, toil from dawn, dawn until dusk! Yes, we set down our pickaxes only to eat, to eat and sleep..."},{"name":"ZOGA","text":"Eat...? Sleep...? It seems we have a misunderstanding here─a mistake, a misconception, a misunderstanding..."},{"name":"ZOGA","text":"Sleep? Food? These are luxuries─comforts, indulgences, luxuries."},{"name":"ZOGA","text":"And luxuries, yes, luxuries are for kobolds who can dig their own weight. You earn nothing, you deserve nothing, you <span class=\"emphasis\">are</span> nothing! No rations for a month or until you increase your haul a hundredfold, whichever comes last!"},{"name":"GIGU","text":"B-But, Zo Ga! We are already weak─weak, weak and hungry! Cut off our food supply, and we will starve, wither, die..."},{"name":"ZOGA","text":"Then die─yes, yes, die! Each day you live, you breathe our air and eat our food, and give nothing in return! You're a parasite, Gi Gu─a leech, a sponge, a parasite. Your very existence keeps us from achieving our potential!"},{"name":"ZOGA","text":"But I can think of one way you might be of use. Yes, yes, the shriveled carcasses of you and your lot could feed our furnaces─fodder, fuel, feed for your betters!"},{"name":"GIGU","text":"Y-You cannot mean what you say, Zo Ga! No, no, this must be some cruel joke─a jest, a..."},{"name":"ZOGA","text":"The only joke around here is <span class=\"emphasis\">you</span>, Gi Gu. I'll not repeat myself this time─a hundredfold! An onze less, and you'll be the first to burn─singe, sizzle, burn!"},{"name":"ZOGA","text":"Let's go, ladies. Yes, yes, the stench of sloth─sloth and stupidity─in this dump is making me sick."},{"name":"ZOGA","text":"Remember, ladies: this is the fate of those who don't dig their own weight. Now, I do believe it's time for that steam bath. Heh heh heh..."},{"name":"GIGU","text":"&lt;whimper&gt;"},{"name":"GIGU","text":"Oh, woe is me─misery, misfortune, woe!"},{"name":"SKAETSWYS","text":"What in the seven 'ells just 'appened? I come back from Camp Overlook, only to see some overstuffed kobold struttin' around like 'e owns the place."},{"name":"GIGU","text":"You are not so wrong. No, no, your words are true. Zo Ga leads the 13th, yes, and has many friends and followers in U'Ghamaro. His power grows with each day. With each day, one less kobold challenges the word of Zo Ga. Soon none will be left to oppose him. No, no, not a one."},{"name":"SKAETSWYS","text":"So what're ye sayin'? That yer just goin' to let that self-styled tyrant walk all over ye?"},{"name":"GIGU","text":"Y-Y-Yes? We have no choice─no recourse, no refuge..."},{"name":"SKAETSWYS","text":"What kind of an answer is that!? Ain't ye got a shred o' dignity in yer whole body!?"},{"name":"GIGU","text":"&lt;sigh&gt; No, no, I do not..."},{"name":"SKAETSWYS","text":"Look, I don't know yer kobold 'ierarchies from an 'ole in the ground. What I <span class=\"emphasis\">do</span> know is that if anyone talked to <span class=\"emphasis\">me</span> like that, I'd go to the seventh 'ell and back to cut 'im down to size."},{"name":"GIGU","text":"But you are strong─bold, brave, strong─and I am..."},{"name":"SKAETSWYS","text":"Llymlaen 'ave mercy! I can't stand to look at the sorry lot of ye! Are ye kobolds, or dormice!?"},{"name":"SKAETSWYS","text":"Look... Ye might not 'ave the spine to stand up for yerselves, but <span class=\"highlight\">Forename</span> 'ere and I sure as 'ells do. Ain't that right, <span class=\"highlight\">Forename</span>? Just tell us where we can find this Zo Ga!"},{"name":"GIGU","text":"You know not what you say! No, no, you know nothing. It is pure madness to oppose Zo Ga─folly, insanity, madness!"},{"name":"SKAETSWYS","text":"The only thing what's drivin' me mad is yer endless wailin'!"},{"name":"SKAETSWYS","text":"That settles it! I'm not leavin' this stinkin' 'ole till Zo Ga falls on 'is 'ands and knees before me beggin' for mercy─no ifs, ands, or buts about it!"},{"name":"GIGU","text":"B-But..."},{"name":"SKAETSWYS","text":"Did ye just say somethin'!?"},{"name":"GIGU","text":"N-No... No, nothing at all... &lt;sigh&gt;"},{"name":"SKAETSWYS","text":"I tell ye, until this day, I'd 'ave sooner skewered a kobold than befriended one, but you lot are just too pathetic to let lie. But don't get too comfortable! If ye don't shape up, I'll throw ye into Zo Ga's furnace meself!"},{"name":"GIGU","text":"Zo Ga does not suffer opposition lightly. No, not in the least. If we cross him, he will crush us. We are doomed─cursed, damned, doomed!"},{"name":"GIGU","text":"Oh, adventurer, do not leave us! No, no, you must not go! The Roegadyn woman frightens me even more than Zo Ga─horrifies, terrifies, frightens!"},{"name":"GIGU","text":"But we have no choice. No, no, we have none. You will protect us from Zo Ga's bullying, yes? Yes, yes, you will...?"},{"name":"Q1","text":"Will you ally with the 789th?"},{"name":"A1","text":"Eagerly, emphatically, wholeheartedly!"},{"name":"A1","text":"No, no, not today."},{"name":"GIGU","text":"Oh, adventurer, you are too kind─gracious, generous, kind! Yes, yes, kind, and possessing the strength of a hundred kobolds!"},{"name":"GIGU","text":"Yes, yes, a hundred kobolds! You do not need Gi Gu's help. No, no, you do not! Good luck fighting Zo Ga, adventurer! I await word of your triumph, your victory, your success!"},{"name":"GIGU","text":"...Gi Gu knew it. Gi Gu is alone─abandoned, forsaken, alone."},{"name":"GIGU","text":"Leave us to our misery, adventurer. Yes, we will find some way to manage, we will. But first, Gi Gu needs a nap..."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Neutral</span> reputation with the 789th Order."},{"name":"SYSTEM","text":"Kobold tribal quests are now available from 789th Order Dustman Bo Zu."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from the 789th Order vendor."}],"reward":{"gil":691,"xp":11500},"reqs":{"jobs":[{"lvl":41,"id":34}],"quests":[66856]},"next":[66858]},"partials":[{"type":"npc","id":"1005927","obj":{"i":1005927,"n":"789th Order Pickman Gi Gu","l":350,"q":9}},{"type":"npc","id":"1005931","obj":{"i":1005931,"n":"Skaetswys","l":350,"q":5,"t":"Storm Lieutenant"}},{"type":"quest","id":"66856","obj":{"i":66856,"n":"Highway Robbery","g":38,"l":"Limsa Lominsa","s":0,"f":1}},{"type":"quest","id":"66858","obj":{"i":66858,"n":"No-good Zo Ga's Ambition","g":38,"l":"Outer La Noscea","s":0,"f":1}}]}