{"quest":{"name":"Manderville Men","location":"Northern Thanalan","id":66853,"patch":2.2,"sort":7,"icon":100232,"unlocksFunction":1,"eventIcon":71341,"issuer":1008722,"target":1008735,"involved":[1008710,1008727,1008729,1008730,1008734],"genre":68,"journal":["The time has come for you to do what only a Manderville can.","Having shared with you the secrets of House Manderville, Inspector Hildibrand now asks that you do what he cannot. Stand before the fallen chimera and dance as only a Manderville can.","A half-naked Highlander answers your summons and announces himself as Godbert the goldsmith. As he ponders how you came to learn the Manderville, he and Hildibrand lock eyes momentarily, causing the inspector to inexplicably flee the scene. All is explained after Godbert catches up to Hildibrand, though, as the goldsmith proceeds to berate his son in front of all present. Brushing aside his father's legitimate complaints, Hildibrand convinces Godbert to reconstruct the shattered vase. Though the results are less than ideal, perhaps Lady Durilda will be satisfied. Return to Vesper Bay so that Maria can present the vase to her mother.","Lady Durilda is dissatisfied with the vase until Godbert unexpectedly arrives and reveals that he was the one who reconstructed it. This fact, coupled with the knowledge that he, a member of the Syndicate, is also Hildibrand's father, is enough to convince the noblewoman to grant the inspector permission to assist with Briardien's investigation. Not only is Inspector Hildibrand unaware of his father's recent rise to power, he is also completely oblivious to how he personally benefited from it, as he simply states that you all must review the facts of the case with Inspector Briardien.","In between sighs and shrugs, Inspector Briardien explains his plan to lure out and catch the duelist using counterfeit Treaty-Blades being transported from Coerthas. Reluctantly, he states that you and your comrades might serve as additional “smallfolk,” watching the roads in and out of the Observatorium for anything suspicious. This suggestion pleases Inspector Hildibrand, who states with confidence that the duelist should be easy to find in snowy Coerthas, given his large frame and garish red clothing─a description he subsequently misremembers when reunited with a certain warrior and his rooster."],"objectives":["Summon the goldsmith.","Give the reconstructed vase to Maria in Vesper Bay.","Speak with Briardien."],"dialogue":[{"name":"HILDIBRAND","text":"We are as siblings now, my constant comrade, for I have shared with you the secrets of House Manderville."},{"name":"HILDIBRAND","text":"Now you must use that knowledge. Go to the fallen chimera and dance like only a Manderville can!"},{"name":"HILDIBRAND","text":"I shall maintain my distance for now, but fear not! Should aught go awry, I will fly to your side at once."},{"name":"GILGAMESH","text":"What manner of man can be summoned only through dance?"},{"name":"NASHUMHAKARACCA","text":"Are you really going to do the Manderville? Oooh, I can't wait!"},{"name":"GODBERT","text":"(-???-)Fancy yourself a Manderville man?♪<br>You would do what only a Manderville can?♪<br>Then lift your legs, and put up your hands,♪<br>Be a Mander-Mander-Manderville, man!♪"},{"name":"GILGAMESH","text":"He comes!"},{"name":"GODBERT","text":"(-???-)Ho ho ho! You have naught to fear from me, naught at all! The only accounts I came to settle were with the chimera."},{"name":"GODBERT","text":"But you were not drawn here by some coincidence, were you? No, you came in search of me, Godbert! Why else would you gyrate your hips in such a gentlemanly fashion, if not that?"},{"name":"GODBERT","text":"Wait, I know you! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> of strong-yet-tender fingers!"},{"name":"GODBERT","text":"But, more importantly, how in the hells did you learn the Manderville? If I did not teach you, then who...?"},{"name":"HILDIBRAND","text":"（★未使用／削除予定★）"},{"name":"GODBERT","text":"By the grace of Thal, what sorcery is this? He... He yet lives!?"},{"name":"GODBERT","text":"HILDIBRAND HELIDOR MAXIMILIAN MANDERVILLE!!!"},{"name":"GODBERT","text":"Ten years, Hildibrand, <span class=\"emphasis\">ten years</span> since you left home! And five since I learned of your trip to Dalamud!"},{"name":"GODBERT","text":"How long were you planning to allow your mother and father to suffer under the illusion that their beloved son was dead!?"},{"name":"GILGAMESH","text":"<span class=\"emphasis\">Son</span>!? You are Hildy's father!?"},{"name":"GODBERT","text":"Godbert the goldsmith's a Manderville man,♪<br>Smithing as only a Manderville can,♪<br>Oil him up and give him a tan,♪<br>Fit for a Mander-Manderville man!♪"},{"name":"HILDIBRAND","text":"Please, Father, cease your undulations at once! There are more pressing matters at hand!"},{"name":"HILDIBRAND","text":"This antique vase must be made whole once more, for the sake of Miss Maria!"},{"name":"GODBERT","text":"Hah! Do not worry, little one─I deal with worse cases before my morning bowel movement!"},{"name":"GODBERT","text":"Hold your applause until the end! Byregot, guide my hammer!"},{"name":"GODBERT","text":"Look how it sparkles in the twilight, how it radiates elegance! Would you all not agree that it is a work of art?"},{"name":"HILDIBRAND","text":"You've completely destroyed a priceless antique's historical value!"},{"name":"GODBERT","text":"Nonsense! I have taken a dull, unremarkable vase and transformed it into something far superior! I hope you were paying attention, Hildy. How long has it been since you last held a hammer?"},{"name":"HILDIBRAND","text":"Father, I... That is not my path. I am an agent of enquiry─an inspector! It is my duty to help those in need."},{"name":"HILDIBRAND","text":"Miss Maria is one such person. There are others, too─innocent people whose weapons were callously ripped from their hands by a thieving duelist."},{"name":"GODBERT","text":"I thought you had put away childish dreams. No matter─you will understand in due time."},{"name":"HILDIBRAND","text":"No, I will not! I am an inspector, Father! I can be naught else!"},{"name":"MARIA","text":"Um... Mister Godbert, sir─I don't think my mother's going to like what you did. She probably won't let Mister Hildibrand help with the investigation..."},{"name":"GILGAMESH","text":"We cannot say that for certain, can we? Mayhap she will take a liking to this...reimagining."},{"name":"GILGAMESH","text":"You spoke of a thieving duelist, did you not? It so happens I am something of a duelist myself."},{"name":"GILGAMESH","text":"Were we to cross paths with this fellow, I would welcome the opportunity to pit my skills against his. Enkidu as well, I should think!"},{"name":"HILDIBRAND","text":"I see you too possess a strong sense of justice. Full glad am I to have met you, Greg. Now, let us return to Vesper Bay and see how our vase is received."},{"name":"GODBERT","text":"Vesper Bay, you say? What a coincidence! I shall be traveling there on business once I have finished gathering materials."},{"name":"GILGAMESH","text":"Ho, I think I might have seen the demon bird which took my weapon! Go on without me─I shall follow anon."},{"name":"MARIA","text":"I hope she likes it..."},{"name":"HILDIBRAND","text":"Mayhap Miss Maria should be the one to present the vase."},{"name":"MARIA","text":"Mother, I brought you the vase..."},{"name":"DURILDA","text":"By the gods, have you all no shame!? How dare you make my daughter complicit in your chicanery!"},{"name":"DURILDA","text":"I don't know where you found this gaudy trash, but it bears no resemblance whatsoever to the vase I purchased!"},{"name":"ELLIE","text":"Now see here, Lady Durilda! Not only did you send Maria to fetch your priceless vase <span class=\"emphasis\">alone</span>, placing her in considerable danger should bandits or wild beasts attack─which they <span class=\"emphasis\">did</span>─but─"},{"name":"GODBERT","text":"(-???-)Gaudy trash?"},{"name":"DURILDA","text":"L-Lord Manderville, sir, I did not realize you had arrived!"},{"name":"DURILDA","text":"Though I know it is nothing compared to the lavish accommodations an esteemed gentleman such as yourself must enjoy, I pray my humble abode meets with your satisfaction."},{"name":"GODBERT","text":"Oh, it does, my lady, it does indeed─especially that exquisite vase over yonder. Although I gather from your previous comments that you do not like my reconstruction?"},{"name":"DURILDA","text":"<span class=\"emphasis\">Your</span> reconstruction?"},{"name":"DURILDA","text":"Ohoho, I don't <span class=\"emphasis\">like</span> it─I <span class=\"emphasis\">love</span> it! I would go so far as to call it the new centerpiece of my Thorne Dynasty collection!"},{"name":"GODBERT","text":"Ah, what a relief! I would have been most distressed had you said otherwise. We Mandervilles do so take pride in our work and ever strive for professional perfection."},{"name":"GODBERT","text":"Oh, but why am I repeating what my son Hildibrand doubtless told you when he offered to investigate the duelist's threats? Enough expository banter, I say!"},{"name":"DURILDA","text":"I-I cannot recall if your son used those precise words, but I do remember thinking that his help would be most welcome! You <span class=\"emphasis\">will</span> be helping us, Inspector Hildibrand, will you not?"},{"name":"ELLIE","text":"Wait a minute─your father is Lord Godbert Manderville, the man who took Eolande Quiveron's seat on the Syndicate?"},{"name":"HILDIBRAND","text":"It appears there have been a great many developments over the past ten years of which I was completely unaware..."},{"name":"HILDIBRAND","text":"In any case, we must redirect our energies towards the investigation of the thieving duelist!"},{"name":"HILDIBRAND","text":"Our first order of business will be to review all the facts with <span class=\"emphasis\">consenting</span> Inspector Briardien."},{"name":"HILDIBRAND","text":"Come, we have a thief to catch! Let us seek out Inspector Briardien at once!"},{"name":"GODBERT","text":"I hope I did not speak overmuch earlier! My wife would describe it as a “proclivity to pontificate,” but I prefer to think of it as an earnest desire to establish rapport with my fellow man."},{"name":"MARIA","text":"(I think she likes it!)"},{"name":"BRIARDIEN","text":"...Why are you still here?"},{"name":"HILDIBRAND","text":"Allow me to elucidate: Lady Durilda has asked that we assist with the investigation! Now kindly share with us all your information."},{"name":"BRIARDIEN","text":"...Fine. Our plans have advanced to a stage that even you couldn't ruin them anyway."},{"name":"BRIARDIEN","text":"I commissioned several reproductions of the Treaty-Blade through a merchant named Jojonpa, who traffics in counterfeit antiques."},{"name":"BRIARDIEN","text":"These blades have been delivered to the Observatorium, where they are being distributed amongst Lady Durilda's sellswords. Once I give the order, they will transport them via alternate routes to Vesper Bay."},{"name":"NASHUMHAKARACCA","text":"Ohhh, I think I get it. You're hiding the real transport with a bunch of decoys, right?"},{"name":"BRIARDIEN","text":"They're all decoys. The moment the thief strikes, all our forces will converge on his location─including those disguised as smallfolk along each route. The real Treaty-Blade will remain in the original owner's vault until the thief has been apprehended."},{"name":"BRIARDIEN","text":"Everything has been accounted for. You are superfluous."},{"name":"BRIARDIEN","text":"...Mayhap we could use more “smallfolk” to watch the roads in and out of the Observatorium─assuming you have the capacity to conduct yourself in an unassuming fashion."},{"name":"HILDIBRAND","text":"Fear not, my fellow inspector, for I am a master of disguise! Have you any information regarding the duelist himself? A description?"},{"name":"ELLIE","text":"You never thought to ask Humphrey, did you? &lt;sigh&gt; The thief is said to be a towering brute dressed in red who wields a halberd."},{"name":"HILDIBRAND","text":"Hah hah hah! A man so garishly dressed should be easy to find in snowy Coerthas!"},{"name":"BRIARDIEN","text":"Then I suppose we don't need your help, after all, do we? Come or don't─I couldn't care less."},{"name":"ELLIE","text":"Be seeing you."},{"name":"GILGAMESH","text":"Pray forgive my lateness!"},{"name":"HILDIBRAND","text":"Greg, my good man! What a pleasure to see you again! We just received new information regarding the weapon thief!"},{"name":"HILDIBRAND","text":"A victim described him as a halberd-wielding brute dressed in...dressed in..."},{"name":"HILDIBRAND","text":"A ridiculous outfit!"},{"name":"GILGAMESH","text":"A ridiculous outfit? Ho, now I am intrigued. What reasons would a warrior have for wearing impractical clothing?"},{"name":"HILDIBRAND","text":"Hah hah, what reasons indeed? It is enough to make a gentleman laugh!"}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66852]},"next":[66854]},"partials":[{"type":"npc","id":"1008722","obj":{"i":1008722,"n":"Hildibrand","l":46,"q":2}},{"type":"npc","id":"1008735","obj":{"i":1008735,"n":"Briardien","l":42,"q":1}},{"type":"npc","id":"1008710","obj":{"i":1008710,"n":"Hildibrand","l":42,"q":1}},{"type":"npc","id":"1008727","obj":{"i":1008727,"n":"Nashu Mhakaracca","l":46,"q":1}},{"type":"npc","id":"1008729","obj":{"i":1008729,"n":"Gilgamesh","l":46,"q":1}},{"type":"npc","id":"1008730","obj":{"i":1008730,"n":"Maria","l":42,"q":1}},{"type":"npc","id":"1008734","obj":{"i":1008734,"n":"Godbert","l":42,"q":1}},{"type":"quest","id":"66852","obj":{"i":66852,"n":"The Hammer","g":68,"l":"Western Thanalan","s":6,"f":1}},{"type":"quest","id":"66854","obj":{"i":66854,"n":"The Three Collectors","g":68,"l":"Western Thanalan","s":8,"f":1}}]}