{"quest":{"name":"The Three Collectors","location":"Western Thanalan","id":66854,"patch":2.2,"sort":8,"icon":100233,"unlocksFunction":1,"eventIcon":71341,"issuer":1008736,"target":1008788,"involved":[1008738,1008739,1008741,1008744,1008746,1008747,1008748,1008749,1008750,1008751,1008752,1008753,1008754,1008755,1008756],"genre":68,"journal":["Inspector Hildibrand would have you accompany him to Coerthas.","Having received the blessings of Lady Durilda and Inspector Briardien, Inspector Hildibrand wishes to depart for Coerthas at once. Journey to the Observatorium and seek out any sellswords in Lady Durilda's employ.","Hildibrand quickly identifies one of Lady Durilda's sellswords, though the man is quick to deny the inspector's assertions. Inspector Briardien subsequently appears and explains the situation, much to the sergeant's chagrin. Recognizing you to be the most competent member of your party, the sergeant then asks that you assist one of his subordinates near the Observatorium's east gates.","The snows of Coerthas can play tricks on one's eyes, as you soon observe. While the sellsword watchman ventures outside to investigate something suspicious, Inspector Hildibrand nearly mistakes Gilgamesh for the thieving duelist. Electing to search a different area, Hildibrand and Nashu wander off. Follow them and see if their search yields anything of interest.","Ellie astutely observes that Inspector Hildibrand is unlikely to find the duelist <span class=\"emphasis\">inside</span> the walls of the Observatorium. That being said, it would be dangerous to survey the wilderness unarmed─which is why Hildibrand is grateful when Nashu returns with a curious “spear” in her possession. The inspector immediately recognizes the weapon as the selfsame one which helped him journey to Dalamud five years ago. Precisely what inexplicable series of circumstances led to this reunion would doubtless make for an engrossing tale─alas, there are more pressing matters at hand. Survey the wilderness east of the Observatorium with the inspector and his assistant.","Fate can be ever so cruel. The budding friendship between Hildibrand and Gilgamesh is torn asunder when the warrior recognizes the inspector's spear as his own cherished weapon. What small hopes for reconciliation remain are further crushed when Ellie and Inspector Briardien arrive and identify Gilgamesh as the nefarious thieving duelist─a charge the warrior both confirms and denies. Distraught at being misunderstood by those whom he had come to trust, Gilgamesh flees to the south as Hildibrand gives chase─and so must you.","Outside the gates to Griffin Crossing, you find an incapacitated Inspector Hildibrand. Imploring you to stop his misguided former friend, you begin to search the bridge, and quickly find Gilgamesh waiting for you. The warrior proposes what he deems a duel─though his terms allow for you to summon allies. Triumph, and he will yield the spear. But should you fail, your weapons will be forfeit.<br><br>※Battle on the Big Bridge can be accessed via the Duty Finder.","Declaring that you have received a sufficient beating, Gilgamesh withdraws without claiming your weapon. Inform Inspector Briardien of all that has transpired.","Annoyed by yet resigned to Gilgamesh's escape, Inspector Briardien deems it safe to proceed with the Treaty-Blade's delivery. Proceed to Vesper Bay so that you may be present for the occasion.","Lady Durilda gleefully accepts the Treaty-Blade and takes her leave─only to appear a second time inquiring as to the whereabouts of her weapon. Inspector Briardien immediately deduces that the first Lady Durilda was in fact the thief who sent the challenge in disguise, and that Gilgamesh was a different thief who had no interest in the Treaty-Blade. The flying card which then embeds itself in the inspector's forehead appears to substantiate this theory, as the words writ upon it match the style of the previous challenge. “I shall come to claim the lapis maiden's virtue,” it reads, a bold challenge Inspector Briardien is glad to accept─until Inspector Hildibrand preempts his declaration, driving his rival into a frenzy. As the two men circle Lord Lolorito's statue in the square, Maria bursts into laughter, and her normally stern mother soon does the same. Despite failing to protect the Treaty-Blade, it would seem Inspector Hildibrand achieved an arguably more worthwhile measure of success."],"objectives":["Speak with the sellsword sergeant at the Observatorium.","Speak with the sellsword watchman.","Speak with Hildibrand.","Survey the wilderness east of the Observatorium.","Speak with Hildibrand.","Confront Gilgamesh in the Battle on the Big Bridge.","Speak with Briardien.","Speak with Durilda in Vesper Bay."],"dialogue":[{"name":"HILDIBRAND","text":"Allow me to summarize our current plan of action! Our destination is the Observatorium, and our mission is to pose as goodly smallfolk, in accordance with Inspector Briardien's instructions."},{"name":"HILDIBRAND","text":"Naturally, should the situation demand improvisation, we are to disregard those instructions. Any questions? No? Then let us sally forth at once!"},{"name":"HILDIBRAND","text":"My redoubtable confederate! You are an experienced traveler, are you not? Why don't you lead the way to Coerthas?"},{"name":"GILGAMESH","text":"That damnable demon bird continues to elude me, but no longer! Soon I shall claim my revenge and weapon both..."},{"name":"HILDIBRAND","text":"Hail to thee, fellow servant of justice! I take it you are one of the many tasked with transporting a counterfeit Treaty-Blade?"},{"name":"HEISHI01318","text":"...Clearly, you've mistaken me for someone else, sir."},{"name":"BRIARDIEN","text":"At ease, Sergeant. They're with us─more “smallfolk.”"},{"name":"BRIARDIEN","text":"Keep an eye on them. Or else."},{"name":"HEISHI01318","text":"B-But, sir, I─<br>...Bugger me."},{"name":"HEISHI01318","text":"Don't you bloody move until I get back!"},{"name":"GILGAMESH","text":"I say, is this land always so inhospitable? The biting winds, the endless snows..."},{"name":"GILGAMESH","text":"Mayhap keeping active will help me to stay warm. Oh, and should I chance to find the thieving duelist, I will of course summon you─after administering the requisite beating, hah hah!"},{"name":"HEISHI01318","text":"Good, you're still─ Hm? Wasn't there someone else with you a moment ago?"},{"name":"HILDIBRAND","text":"Ah, you speak of Greg! He ventured outside the gates mere moments before your arrival, full eager to catch the thief─as are we! Come, Nashu! We too must answer the call of duty!"},{"name":"HEISHI01318","text":"...You look like you might actually be useful. Why don't you have a word with my man near the east gates? We're undermanned over there."},{"name":"HEISHI01318","text":"Remember: we're looking for a brute in red who wields a halberd. You see the bastard, you come to me─no heroics. We take him together, understand?"},{"name":"HILDIBRAND","text":"Any halberd-wielding mummers shall answer to me!"},{"name":"MIMAWARI01318","text":"Ye see that just now? No? Hmmm..."},{"name":"MIMAWARI01318","text":"I don't think me eyes were playin' tricks on me, but there's only one way to be sure. You wait here."},{"name":"NASHUMHAKARACCA","text":"Inspector! Over there, look!"},{"name":"HILDIBRAND","text":"What is it, Nashu!? Pray tell me what you see!"},{"name":"GILGAMESH","text":"Ah hah! I see you, demon bird! You will not escape me this time!"},{"name":"GILGAMESH","text":"Why, hello there, my friends! Is aught amiss?"},{"name":"HILDIBRAND","text":"Oh, it's just Greg! For a moment, I thought you might have spotted our thief. Come, Nashu, we have lingered here overlong. We must egress posthaste!"},{"name":"HILDIBRAND","text":"Hm. There is naught out of the ordinary here either..."},{"name":"ELLIE","text":"No luck, hm?"},{"name":"HILDIBRAND","text":"We have scoured every ilm of this area to no avail. I can only conclude that, having learned that his opponent was to be the legendary inspector Hildibrand, the duelist renounced his criminal ways and retreated into hiding."},{"name":"ELLIE","text":"Or perhaps he is waiting patiently <span class=\"emphasis\">outside</span> the walls for more wagons to leave? That being said, should you decide to venture into the wilderness, you had best arm yourself with more than your...wits."},{"name":"HILDIBRAND","text":"I appreciate your concern, Miss Ellie, but a gentleman should abstain from violence unless absolutely necessary."},{"name":"NASHUMHAKARACCA","text":"I'll fight for you, Inspector! I even found a weapon to use!"},{"name":"HILDIBRAND","text":"By the Twelve, is that the selfsame spear which propelled me to the red moon!? Wherever did you find it?"},{"name":"NASHUMHAKARACCA","text":"It was buried in the snow!"},{"name":"HILDIBRAND","text":"Well, one cannot ignore the will of destiny! Return it to me, Nashu!"},{"name":"HILDIBRAND","text":"Though I will still endeavor to avoid fisticuffs, I will be duly armed should worse come to worst. Now then─we begin our search for the duelist to the east of the Observatorium!"},{"name":"ELLIE","text":"Come now, how hard can it be to find a large man dressed in red in <span class=\"emphasis\">Coerthas</span>?"},{"name":"HILDIBRAND","text":"Take your post, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, and entrust your safety to me! Inspector Hildibrand is ready for battle!"},{"name":"NASHUMHAKARACCA","text":"Cor, it's cold out here!"},{"name":"HILDIBRAND","text":"...Wherefore art thou, my nefarious nemesis?"},{"name":"GILGAMESH","text":"'Twas not the selfsame creature, but one of many. Nevertheless, I <span class=\"emphasis\">know</span> that my weapon is close by."},{"name":"GILGAMESH","text":"You sense it, too, don't you?"},{"name":"HILDIBRAND","text":"Greg, I've been meaning to ask─why do you covet this weapon so?"},{"name":"GILGAMESH","text":"If you but beheld it, you would understand. In some ways it bore resemblance to a spear, but in other respects it was quite different."},{"name":"GILGAMESH","text":"It was crowned with a magnificent axe blade..."},{"name":"GILGAMESH","text":"To which was welded a musket barrel..."},{"name":"GILGAMESH","text":"'Twas one of the first weapons I added to my collection after arriving in these lands. Ah, how I yearn to reclaim it─the strongest of spears!"},{"name":"GILGAMESH","text":"That weapon of yours bears a striking...a striking resemblance to...to..."},{"name":"GILGAMESH","text":"The strongest of spears!"},{"name":"HILDIBRAND","text":"I-I claimed this weapon five years ago! Surely, you can't be serious!?"},{"name":"GILGAMESH","text":"Grrr... Now you call me <span class=\"emphasis\">Shirley</span>!? No matter─give it to me! GIVE IT TO ME!"},{"name":"HILDIBRAND","text":"This spear and I have traveled together to the very heavens! I will not relinquish it again!"},{"name":"GILGAMESH","text":"This spear and I have bested many a man together! <span class=\"emphasis\">I</span> will not relinquish it again!"},{"name":"HILDIBRAND","text":"Then we are at an impasse..."},{"name":"ELLIE","text":"I-I can't believe I'm saying this, but...well done, Inspector!"},{"name":"ELLIE","text":"Thanks to you, we've caught the weapon thief in the act!"},{"name":"HILDIBRAND","text":"M-Miss Ellie, you are grossly misreading our dispute. Greg is a good, honest man, who I am certain has never stolen a weapon in his life!"},{"name":"GILGAMESH","text":"Indeed, I have not! Every weapon I have claimed was by rights mine!"},{"name":"GILGAMESH","text":"Each was a trophy for besting my opponent in single combat!"},{"name":"BRIARDIEN","text":"I believe that constitutes a confession. Seize him."},{"name":"GILGAMESH","text":"A confession to what!? I have done naught wrong! Bah, you all are beyond reason!"},{"name":"HILDIBRAND","text":"Aaah! Yes, my plan to secure Greg's confession was utterly flawless, and his capture will be the coup de grâce!"},{"name":"BRIARDIEN","text":"Well, <span class=\"emphasis\">my</span> plan is thus far flawless. Griffin Crossing is still impassable."},{"name":"BRIARDIEN","text":"I know who you are, even if that imbecile doesn't, so let's not mince words. Only you have the skill to face the duelist in battle."},{"name":"BRIARDIEN","text":"Even so, your strength alone will likely not suffice. I suggest you muster what allies you can."},{"name":"BRIARDIEN","text":"Lest you find my advice unsporting, I remind you that our duty supersedes any misbegotten notions of honor you may possess."},{"name":"NASHUMHAKARACCA","text":"Which way did he go, <span class=\"highlight\">Forename</span>!? Did you see?"},{"name":"ELLIE","text":"...His name isn't really “Greg,” is it?"},{"name":"HILDIBRAND","text":"Nashu? Miss Ellie? ...Ah! My good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, it is a relief to hear your footfalls!"},{"name":"HILDIBRAND","text":"As you have doubtless deduced, I was unable to prevent Greg from escaping through the doors. I must leave the rest to you!"},{"name":"GILGAMESH","text":"Yes, it was <span class=\"emphasis\">I</span> behind these doors the whole time! You took so long to arrive, I was getting worried you might have gotten lost!"},{"name":"GILGAMESH","text":"Long did I wonder what your role in this play was. A silent guardian, content to watch events unfold with minimal interaction. At the last, I understand─we were fated to duel, you and I!"},{"name":"GILGAMESH","text":"Best me, and you may have the spear. Fail, and your weapons are forfeit! Fair terms, do you not think? I will even extend them to your allies. Aye, I grant you leave to summon others. After all, it will avail you no advantage, heh heh..."},{"name":"GILGAMESH","text":"For Gilgamesh... It is embiggening time!"},{"name":"HILDIBRAND","text":"Do not worry about me, my friend! I shall─nnngh─extricate myself in due time!"},{"name":"GILGAMESH","text":"cut"},{"name":"GILGAMESH","text":"cut"},{"name":"GILGAMESH","text":"cut"},{"name":"BRIARDIEN","text":"Alone yet still armed. Hmph."},{"name":"BRIARDIEN","text":"In any case, he seemed satisfied with the halberd. We will proceed with the delivery."},{"name":"BRIARDIEN","text":"If you wish to be present, I won't object. Meet me in Vesper Bay."},{"name":"HILDIBRAND","text":"&lt;groan&gt; Why, Greg, why...?"},{"name":"NASHUMHAKARACCA","text":"Are you dead again, Inspector?"},{"name":"ELLIE","text":"How many swords did he drop while─ Wait, doesn't that one there look just like Eleazar's sword?"},{"name":"ELLIE","text":"But...even to my untrained eye, this is obviously a counterfeit blade. And so is this one, and this one! What in the world...?"},{"name":"DURILDA","text":"Ahhh... 'Tis more magnificent than I imagined. 'Twill make a fine addition to my collection..."},{"name":"BRIARDIEN","text":"And with that, our business is concluded. Cheers."},{"name":"BRIARDIEN","text":"I genuinely mean that in your case, by the way."},{"name":"NASHUMHAKARACCA","text":"All's well that ends well, right, Inspector? Though it's a shame that Greg turned out to be the thief."},{"name":"DURILDA","text":"There you are, Inspector Briardien! Why did you not wait for me at the docks?"},{"name":"DURILDA","text":"Hm? Why are you all staring at me so? Oh, never mind that─where is my Treaty-Blade?"},{"name":"NASHUMHAKARACCA","text":"But...didn't we just give you the Treaty-Blade?"},{"name":"BRIARDIEN","text":"Disguise yourself as the client and let the Treaty-Blade come to you..."},{"name":"BRIARDIEN","text":"Take advantage of an existing situation to distract us from the real crime. Brilliant."},{"name":"ELLIE","text":"The man in red never spoke of the Treaty-Blade─only the halberd."},{"name":"ELLIE","text":"Moreover, he always issued his challenges in person..."},{"name":"BRIARDIEN","text":"Dear gods, isn't it obvious? What is it like in your funny little brains? It must be so <span class=\"emphasis\">boring</span>."},{"name":"ELLIE","text":"...If the man in red did not send the challenge, then who did?"},{"name":"HILDIBRAND","text":"I believe this is addressed to me, <span class=\"emphasis\">condescending</span> Inspector Briardien."},{"name":"BRIARDIEN","text":"Piss off."},{"name":"BRIARDIEN","text":"“Four hundred years have I slept, one thousand faces do I wear. What is yours will be mine. I shall come to claim the lapis maiden's virtue.”"},{"name":"BRIARDIEN","text":"A many-faced phantom thief. Interesting."},{"name":"ELLIE","text":"The design and the wording are the same as before. The thief who stole the Treaty–Blade sent this!"},{"name":"BRIARDIENHILDIBRAND","text":"cut"},{"name":"HILDIBRAND","text":"Very well! I─and I alone─Hildibrand, agent of enquiry, inspector extraordinaire, once more accept your challenge!"},{"name":"BRIARDIEN","text":"You want a challenge, huh? Stand and face me, you buffoon!"},{"name":"MARIA","text":"Ahahahahahaha!"},{"name":"DURILDA","text":"How dare you all laugh at a time like this, after allowing my precious Treaty–Blade to be stolen!"},{"name":"DURILDA","text":"And you, Maria─"},{"name":"DURILDA","text":"...Well, I suppose it is a little funny, isn't it? The two of them dashing to and fro─a pair of gentleman mummers."},{"name":"DURILDA","text":"Ahaha... Ahahahaha!<br>You know, it's been far too long since we've seen a show. We should head into the city later─just you and me..."},{"name":"GODBERT","text":"Not bad, Hildy, not bad at all. You are indeed a Manderville man."},{"name":"HILDIBRAND","text":"&lt;huff&gt; &lt;puff&gt; Mark...mark <span class=\"emphasis\">my</span> face, O phantom of many faces! For it is the...the face of the...of the... &lt;huff&gt; &lt;puff&gt;"},{"name":"HILDIBRAND","text":"The fiend dares lay claim to the fair maiden's virtue!"},{"name":"HILDIBRAND","text":"As seeds of jealousy quicken within an inspector's soul!"},{"name":"HILDIBRAND","text":"Can true love bloom on this battlefield?"},{"name":"HILDIBRAND","text":"Will this Manderville man find his Manderville wife?"},{"name":"NASHUMHAKARACCA","text":"Hey, what's with the goggles those men were wearing? They look special!"},{"name":"NASHUMHAKARACCA","text":"Maybe if I ask nicely, they'll give me a pair? I guess we'll find out next time!"}],"reward":{"gil":1642,"items":[{"num":5,"id":4559}],"xp":0,"instance":20021},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66853]},"next":[66974]},"partials":[{"type":"npc","id":"1008736","obj":{"i":1008736,"n":"Hildibrand","l":42,"q":2}},{"type":"npc","id":"1008788","obj":{"i":1008788,"n":"Durilda","l":42,"q":1}},{"type":"npc","id":"1008738","obj":{"i":1008738,"n":"Gilgamesh","l":42,"q":1}},{"type":"npc","id":"1008739","obj":{"i":1008739,"n":"Sellsword Sergeant","l":63,"q":1}},{"type":"npc","id":"1008741","obj":{"i":1008741,"n":"Sellsword Watchman","l":63,"q":1}},{"type":"npc","id":"1008744","obj":{"i":1008744,"n":"Hildibrand","l":63,"q":1}},{"type":"npc","id":"1008746","obj":{"i":1008746,"n":"Hildibrand","l":63,"q":1}},{"type":"npc","id":"1008747","obj":{"i":1008747,"n":"Ellie","l":63,"q":1}},{"type":"npc","id":"1008748","obj":{"i":1008748,"n":"Hildibrand","l":63,"q":1}},{"type":"npc","id":"1008749","obj":{"i":1008749,"n":"Nashu Mhakaracca","l":63,"q":1}},{"type":"npc","id":"1008750","obj":{"i":1008750,"n":"Ellie","l":63,"q":1}},{"type":"npc","id":"1008751","obj":{"i":1008751,"n":"Briardien","l":63,"q":1}},{"type":"npc","id":"1008752","obj":{"i":1008752,"n":"Hildibrand","l":63,"q":1}},{"type":"npc","id":"1008753","obj":{"i":1008753,"n":"Hildibrand","l":63,"q":1}},{"type":"npc","id":"1008754","obj":{"i":1008754,"n":"Nashu Mhakaracca","l":63,"q":1}},{"type":"npc","id":"1008755","obj":{"i":1008755,"n":"Ellie","l":63,"q":1}},{"type":"npc","id":"1008756","obj":{"i":1008756,"n":"Briardien","l":63,"q":1}},{"type":"item","id":"4559","obj":{"i":4559,"n":"Elixir","l":50,"c":20624,"t":44}},{"type":"instance","id":"20021","obj":{"i":20021,"n":"Battle on the Big Bridge","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":50}},{"type":"quest","id":"66853","obj":{"i":66853,"n":"Manderville Men","g":68,"l":"Northern Thanalan","s":7,"f":1}},{"type":"quest","id":"66974","obj":{"i":66974,"n":"The Business of Betrothal","g":68,"l":"Western Thanalan","s":9,"f":1}}]}