{"quest":{"name":"The Hammer","location":"Western Thanalan","id":66852,"patch":2.2,"sort":6,"unlocksFunction":1,"eventIcon":71341,"issuer":1008716,"involved":[1008715,1008719,1008721,1008722],"genre":68,"journal":["A shattered antique vase will not deter Inspector Hildibrand from his mission.","According to Inspector Hildibrand, the vase could be reconstructed with the aid of a certain master goldsmith─a man as fearsome as he is skilled, capable of wielding his hammer as both a tool of creation and destruction. The goldsmith is like to be found in Bluefog, where he often goes to gather his materials. With the aid of your comrades─including the newly recruited Gilgamesh and his loyal companion, Enkidu─begin your search there.","You find Nashu poking a dead doblyn, which was likely slain by the goldsmith given its wounds. A trail of bloody footprints leads to the north...","The trail leads you to a dead basilisk, which Gilgamesh observes was slain with a single blow to the head. Fresh tracks lead to the north─and gods only know what else.","At the end of the trail, you find a dead ahriman and chimera, but naught else, leading Inspector Hildibrand to conclude that the goldsmith is nearby, possibly concealing himself until the party makes its intentions known. Though it pains him greatly, the inspector proclaims that he must perform the dance of House Manderville in order to declare your peaceful intent, and begins to do so at once. Alas, a sudden injury renders him unable to continue, and, left with no other option, he bequeaths knowledge of the dance to you."],"objectives":["Search for the goldsmith in northern Thanalan.","Follow the trail of destruction."],"dialogue":[{"name":"HILDIBRAND","text":"There is but one person in all Eorzea capable of reconstructing this vase. A man whose skill with the hammer has brought rival goldsmiths low, so breathtaking are his works, so fearsome his competitive spirit."},{"name":"GILGAMESH","text":"(-Flamboyant Oaf-)This man is no mere goldsmith. You speak of him as one would of a great warrior."},{"name":"HILDIBRAND","text":"...Once, a notorious gang of thieves perpetrated a series of robberies in Ul'dah, targeting establishments which sold luxury goods. One such shop was owned by the humble lapidary of whom I speak."},{"name":"HILDIBRAND","text":"His was the last shop the thieves struck, for the following morning they were found beaten, bound, and gagged in the Gold Court."},{"name":"HILDIBRAND","text":"The Brass Blades never learned who was responsible. The only information they had was the testimony of a thief, who kept muttering the words, “The hammer... The hammer...”"},{"name":"MARIA","text":"He sounds dangerous..."},{"name":"GILGAMESH","text":"(-Flamboyant Oaf-)Aye, that he does! And I do so enjoy the company of dangerous men..."},{"name":"GILGAMESH","text":"But where are my manners? I have yet to properly introduce myself. I am Gilgamesh, and that is my companion, Enkidu!"},{"name":"GILGAMESH","text":"...Well, not really. It has been many moons since last I saw her, so to ease the burden of loneliness, I tamed a rooster and painted it green."},{"name":"GILGAMESH","text":"In any case, you mean to search for this goldsmith, yes? If so, it would be my pleasure to help."},{"name":"HILDIBRAND","text":"The pleasure is all mine, Gilligan! I, Hildibrand, agent of enquiry, inspector extraordinaire, bid you welcome!"},{"name":"GILGAMESH","text":"...If it is that hard for you to remember, I give you leave to call me Gil."},{"name":"HILDIBRAND","text":"Excellent suggestion, Greg! Playful monikers are an effective means of building camaraderie. Call me Hildy!"},{"name":"HILDIBRAND","text":"Now then, from what I know of the goldsmith's propensity to procure his materials himself, I have deduced that he is most like to be found in the vicinity of Bluefog in northern Thanalan. It is there we shall begin our search!"},{"name":"GILGAMESH","text":"What manner of solution could he have? The vase looks to be beyond all hope to me."},{"name":"SYSTEM","text":"The doblyn's wounds indicate that it was felled with a hammer. A trail of bloody footprints leads to the north..."},{"name":"NASHUMHAKARACCA","text":"(-Nashu Mhakaracca-)I don't think it's been dead long. Maybe whoever did it is still around?"},{"name":"NASHUMHAKARACCA","text":"If a doblyn became a zombie, would that make it a zomblyn...or a dombie?"},{"name":"SYSTEM","text":"The basilisk's wounds indicate that it was felled with a hammer. A trail of bloody footprints leads to the north..."},{"name":"GILGAMESH","text":"(-Gilgamesh-)A single blow to the head. Impressive."},{"name":"GILGAMESH","text":"This goldsmith is not to be trifled with."},{"name":"HILDIBRAND","text":"His handiwork is unmistakable. Hmmm... The corpse is still quite warm."},{"name":"HILDIBRAND","text":"The doblyn, the basilisk, this ahriman─all were slain with a hammer. As was that beast over yonder, unless I am mistaken."},{"name":"HILDIBRAND","text":"That chimera must be his latest prize, which means he must still be about."},{"name":"HILDIBRAND","text":"Mayhap he is watching us at this very moment, attempting to ascertain our intentions. He was ever a cautious man when on the hunt..."},{"name":"HILDIBRAND","text":"Alas, it comes to this! Though every fiber of my being cries out in rebellion, I must break my oath and do the unspeakable!"},{"name":"GILGAMESH","text":"Wh-What must you do that is so terrible?"},{"name":"HILDIBRAND","text":"I... I must DANCE!"},{"name":"HILDIBRAND","text":"I'm a Mander-Mander-Manderville man,♪<br>Doing what only a Manderville can,♪<br>From the peaks of Coerthas to Thanalan,♪<br>Mander-Mander-Manderville man...♪"},{"name":"GILGAMESH","text":"I... I cannot avert mine eyes!"},{"name":"HILDIBRAND","text":"That... &lt;pant&gt; &lt;pant&gt; That is the dance of House Manderville, passed down from father to son."},{"name":"HILDIBRAND","text":"Were I to perform it within sight of our quarry, he would not be able to resist revealing himself."},{"name":"HILDIBRAND","text":"Alas, I─&lt;gasp&gt;─I neglected to properly stretch my legs beforehand. My good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, I see no other solution; <span class=\"emphasis\">you</span> must dance in my stead! Though it be a gross─nay, <span class=\"emphasis\">unconscionable</span>─violation of my family's traditions, I must bequeath to you the Manderville!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Manderville Dance</span>!"}],"reward":{"gil":658,"emote":"Manderville Dance","xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66851]},"next":[66853]},"partials":[{"type":"npc","id":"1008716","obj":{"i":1008716,"n":"Hildibrand","l":42,"q":2}},{"type":"npc","id":"1008715","obj":{"i":1008715,"n":"Flamboyant Oaf","l":42,"q":2}},{"type":"npc","id":"1008719","obj":{"i":1008719,"n":"Nashu Mhakaracca","l":46,"q":1}},{"type":"npc","id":"1008721","obj":{"i":1008721,"n":"Gilgamesh","l":46,"q":1}},{"type":"npc","id":"1008722","obj":{"i":1008722,"n":"Hildibrand","l":46,"q":2}},{"type":"quest","id":"66851","obj":{"i":66851,"n":"The Science of Deduction","g":68,"l":"Eastern Thanalan","s":5,"f":1}},{"type":"quest","id":"66853","obj":{"i":66853,"n":"Manderville Men","g":68,"l":"Northern Thanalan","s":7,"f":1}}]}