{"quest":{"name":"No-good Zo Ga's Ambition","location":"Outer La Noscea","id":66858,"patch":2.2,"sort":0,"icon":100236,"beast":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1005927,"target":1005927,"involved":[1005932,1005960,1005968,1005969,1007935,1007936,1007937,1008883],"genre":38,"journal":["789th Order Pickman Gi Gu is not through imposing on your generosity.","Your efforts on behalf of the hapless 789th Order have endeared you to its leader, Gi Gu, who would repay this kindness the only way he knows how─by delegating additional tasks to you. His latest imposition, however, is interrupted by Skaetswys, who urgently requests your support in driving off a particularly vicious horde of kobolds that have set upon Camp Overlook with a particularly potent new weapon at their disposal.","You arrive at Camp Overlook to find the kobold attack has been repelled, but at great cost. Unless the kobolds' new weapon is dealt with, the brave men and women of the Maelstrom have slim hope of surviving the next attack. At Skaetswys's behest, return to the 789th Order and inquire with Gi Gu as to the best course of action.","The unreliable Gi Gu suspects that the kobolds who attacked Camp Overlook were none other than the 13th Order, and their fearsome firepower is the product of Zo Ga's dastardly new weapon. Ever quick to delegate responsibility, he sends you in search of an acolyte of the 789th Order, one Ba Go.","The eccentric Ba Go, a former associate of Zo Ga's who was relieved of his position, is eager─perhaps a bit too eager─to create mass mayhem by blowing the top off the 13th Order's new furnace. Locate the entrance to their workshop in northern Iron Lake, and seek passage from the alchemist Ga Zi.","With the help of a reluctant Ga Zi, you have successfully infiltrated the alchemical workshop of the 13th Order. Rendezvous with Ba Go before the prototype furnace.","Ba Go requires additional time to prepare for the sabotage of the furnace, but fears being caught in the act by Zo Ga's lackeys. Stand watch by the entrance and see to any foes who would interrupt the sabotage operation.","You have dispatched the ill-fated kobolds who wandered into the workshop. Return to Ba Go and assure him that there is no fear of being interrupted.","Ba Go entrusts to you some of his so-called beauties, seemingly intelligent bombs designed for the express purpose of rendering a furnace unusable. Pop the top and toss them in, then stand back and enjoy the fireworks.","The sparks and smoke exuded by the furnace suggest that it is no longer functioning in any real capacity. It would appear that your work here is done. Make for the exit and speak once more with the gleeful Ba Go.","Eager to return to his research, Ba Go dashes hastily back to the 789th Order Dig. Follow suit and deliver word of your success to Gi Gu.","No sooner did you share the news of your triumph than did a comely young kobold by the name of Bi Bi arrive to express her displeasure at Gi Gu's actions, fearing for his safety. Eager to defer to the wishes of his apparent love, yet fearing Skaetswys's wrath if he backs down, Gi Gu succeeds only in underwhelming all present with his utter lack of anything resembling decisive leadership. It would appear the pusillanimous pickman will be dependent on your aid for the foreseeable future..."],"objectives":["Speak with Skaetswys at Camp Overlook.","Speak with 789th Order Pickman Gi Gu at the 789th Order Dig.","Speak with 789th Order Acolyte Ba Go.","Speak with 13th Order Alchemist Ga Zi in northern Iron Lake.","Speak with 789th Order Acolyte Ba Go at the 13th Order workshop.","Keep watch at the specified location and dispatch 13th Order kobolds.","Speak with 789th Order Acolyte Ba Go.","Use the smart bombs on the prototype furnace.","Speak with 789th Order Acolyte Ba Go.","Speak with 789th Order Pickman Gi Gu at the 789th Order Dig."],"dialogue":[{"name":"GIGU","text":"Oh, adventurer, do honor me with your company for a moment. Yes, yes, let us speak for a while. You have been an absolute godssend to our order─a savior, a saint, a godssend!"},{"name":"GIGU","text":"Our barrows have been overflowing with ore since you arrived. Yes, yes, full to the brim. At this pace, a moon from now, you may be speaking to─dare I dream?─788th Order Pickman Gi Gu!"},{"name":"GIGU","text":"We shall be the butt of kobold society no more─no, no, never again! Keep up the diligent work, adventurer!"},{"name":"SKAETSWYS","text":"Can a kobold get any more pathetic!? Maybe if ye got off yer arse and 'elped <span class=\"highlight\">Forename</span> for once, ye could dream a little bigger!"},{"name":"GIGU","text":"B-But, surely you know the old kobold saying? Yes, yes, slow and steady─"},{"name":"SKAETSWYS","text":"Bah, enough of yer blatherin'! <span class=\"highlight\">Forename</span>─ye must come with me, and quickly!"},{"name":"SKAETSWYS","text":"Why, ye say!? I'll tell ye why─Camp Overlook is under attack by the nastiest 'orde o' kobolds I've ever laid eyes on!"},{"name":"SKAETSWYS","text":"And that's not the least of it. Word 'as it they've got some newfangled weapon that's got Commander Bloeidin and 'is men tearin' their beards out."},{"name":"SKAETSWYS","text":"I'm off to join the defense. We can count on ye as well, aye, <span class=\"highlight\">Forename</span>?"},{"name":"GIGU","text":"A kobold attack? How terrifying─frightful, horrifying, terrifying! What is it that angers them so? Yes, yes, I wonder..."},{"name":"GIGU","text":"Lucky we are that you are attacked, and not us. Yes, yes, we are fortunate indeed. Well, ah...good luck up there, adventurer!"},{"name":"SKAETSWYS","text":"There ye are, <span class=\"highlight\">Forename</span>! We drove the buggers off, but I fear the damage 'ad already been done..."},{"name":"SKAETSWYS","text":"Saw the kobolds' new weapon with me own eyes, I did. A right vicious breed o' bomb that could blow a good-sized vessel out o' the water."},{"name":"SKAETSWYS","text":"The sheer 'ate in the beastmen's eyes got me to wonderin'─do ye reckon this is somehow our fault, <span class=\"highlight\">Forename</span>?"},{"name":"SKAETSWYS","text":"No sooner do we start lendin' our strength to Gi Gu and 'is sorry lot than Camp Overlook suffers its worst kobold assault in years."},{"name":"SKAETSWYS","text":"Aye, call it me mariner's intuition, but I'd wager a pirate's booty that Zo Ga is at the 'elm of all this."},{"name":"SKAETSWYS","text":"I must remain behind and tend to me comrades. I ask of ye, <span class=\"highlight\">Forename</span>─return to Gi Gu and see if me suspicions are true."},{"name":"SKAETSWYS","text":"Camp Overlook can't bear to suffer another attack like the last. <span class=\"highlight\">Forename</span>, get yerself back to Gi Gu and see what that sorry excuse for a kobold knows about this new breed o' bomb."},{"name":"KOKKADANA01322","text":"Me ears! The blast was so deafenin' I fear I'll never again hear the sound o' the sea..."},{"name":"KOKKADANB01322","text":"I'm no new recruit─aye, I've seen me share o' bombs in me days. Nothing in me worst nightmares could 'ave prepared me for what we faced..."},{"name":"KOKKADANC01322","text":"S-Such strength! If this is the new face of our foe, we're as good as done for..."},{"name":"GIGU","text":"Great losses, your camp suffered? This is a pity─a shame, a crime, a pity. Good thing it was not us. Yes, yes, we are lucky indeed."},{"name":"GIGU","text":"A secret new weapon? Such rumors have come our way before. Yes, yes, one of our acolytes overheard Zo Ga speaking of just such a thing."},{"name":"GIGU","text":"You should seek him out. Yes, yes, you must speak to Ba Go. But I warn you, he is an odd one─curious, eccentric, odd..."},{"name":"GIGU","text":"Worry not that Ba Go has been relegated to this forsaken order; his alchemical prowess knows few equals. Once he was a favorite of Zo Ga. Yes, yes, his prized researcher. But then he became a bit too attached to his work..."},{"name":"BAGO","text":"Ba Go has been awaiting you─expecting, anticipating, awaiting. Zo Ga's furnace is firing, and you seek Ba Go's aid? Yesss, yesss, you do!"},{"name":"BAGO","text":"Zo Ga's furnace spits out bombs of prodigious power. Brilliant bombs─breathtaking, beautiful, brilliant! And Ba Go is an old friend of Zo Ga. Yes, yes, old friends, we are..."},{"name":"BAGO","text":"But Ba Go will help you. Yes, yes, he will. Why? Because Ba Go enjoys nothing more than watching things go kaboom─kablam, kapow, kaboom! Hahaha! Heeheahhahaha!"},{"name":"BAGO","text":"Ba Go knows the way to the 13th Order's workshop deep in the bowels of U'Ghamaro. Yes, yes, Ba Go knows of a hidden passage─secret, secluded, hidden."},{"name":"BAGO","text":"The passage is guarded closely─guarded night and day. Yet Ba Go has friends in high places. Yes, yes, he does."},{"name":"BAGO","text":"Ba Go will gather his lovelies─his beauties, his dears, his lovelies. You will go ahead, to northern Iron Lake, and seek out one Ga Zi. Yes, yes, you will."},{"name":"BAGO","text":"My lovelies─my beauties, my dears, my lovelies─it is time to come out and play. Yes, yes, the time for madness and mayhem is nigh! Haha! Heeaheaheahaha!"},{"name":"DOKANKUN","text":"Shush! Last time someone woke Zo Ga from his <span class=\"alternative-container\"><span class=\"alternative\">beauty rest</span><span class=\"alternative\">afternoon nap</span></span>, he had the offender mine an entire ore vein with his fingernails. Yunz wouldn't want that to happen, nuh-uh, nuh-uh."},{"name":"DOKANKUN","text":"Ba Go told me to expect yunzes. Zo Ga's workshop is on the other side of this exhaust pipe. Yunz'll go quickly and quietly─silently, soundlessly, quietly, that sort of thing─and tell no one that I's opened the door, yunz listening?"},{"name":"Q1","text":"Enter the 13th Order workshop?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."},{"name":"DOKANKUN","text":"Then begone─run, flee, begone, that sort of thing. If Zo Ga catches me talking to an adventurer, bwom bwom, and yunz won't be seeing Ga Zi no more. Nuh-uh, nuh-uh."},{"name":"DOKANKUN","text":"Ba Go may be surrounded by simpletons, but he knows his craft, uh-huh, uh-huh. Used build his beauties for Zo Ga himself. Yes, that was before the fumes began to take their toll, and he got a bit unbalanced, unhinged, touched in the head."},{"name":"BAGO","text":"Ba Go has come, and his lovelies with him. Yes, yes, we have arrived. And yet...what is this? Ba Go hears Zo Ga's lackeys scurrying about."},{"name":"BAGO","text":"Ba Go's lovelies are trembling in fear─shivering, shaking, trembling. This will not do─no, no, it will not. You must see to Zo Ga's men before we have our fun. Yes, yes, you must..."},{"name":"BAGO","text":"What a shiny furnace─smooth, shimmery, shiny! And what booming, beautiful bombs it must make. Yes, yes, a great invention indeed..."},{"name":"BALOON","text":"Intruder! Trespasser,<br>interloper, intruder!"},{"name":"BALOON","text":"You will not leave this place!<br>No, no, not alive!"},{"name":"BAGO","text":"Are you ready, my lovelies? Yes, yes, you are... Take them, and gently place them in the furnace─sweetly, tenderly, gently. Then stand back quickly. Yes, yes, with haste."},{"name":"BAGO","text":"Take my lovelies, and gently place them in the furnace─sweetly, tenderly, gently. Then stand back quickly. Yes, yes, with haste."},{"name":"BAGO","text":"Ahhh, nothing like the smell of a burnt-out furnace in the morning! Or was it the evening? Does it even matter? No, no, it does not."},{"name":"BAGO","text":"Ba Go cannot bear to be parted from his lovelies any longer. His heart weeps─cries, sobs, weeps. Yes, yes, we must leave as we came."},{"name":"BAGO","text":"This is the way to the surface. Ba Go will return to his lovelies. Yes, yes, he will."},{"name":"GIGU","text":"Are my ears to be believed, adventurer? Zo Ga's furnace sputters─fizzles, smokes, sputters. This is your and Ba Go's doing? Yes, yes, it is!"},{"name":"SKAETSWYS","text":"Brilliant work, <span class=\"highlight\">Forename</span>! With their source of ammunition knocked out o' commission, I reckon the 13th Order won't be comin' back to wreak 'avoc on Camp Overlook any time soon."},{"name":"SKAETSWYS","text":"But we've only begun to fight! Aye, we'll not rest until Zo Ga and 'is lickspittles 'ave been driven from U'Ghamaro entirely. Who's with me!?"},{"name":"BIBI","text":"Gi Gu! Have you gone mad─barmy, balmy, mad!?"},{"name":"GIGU","text":"B-Bi Bi! What a lovely surprise─a pleasure, a delight, a surprise!"},{"name":"SKAETSWYS","text":"Hm? Who's this now?"},{"name":"GIGU","text":"Oh, my beloved Bi Bi! How I have longed─yearned, pined, longed─to look upon your delicate whiskers, your dainty paws..."},{"name":"BIBI","text":"Gi Gu! You and your friends sabotaged Zo Ga's prized furnace, yes? You cannot fool me. No, no, I can see it in your eyes!"},{"name":"SKAETSWYS","text":"Aye, the girl's a sharp one..."},{"name":"BIBI","text":"Zo Ga is on a rampage─a fury, a frenzy, a rampage! He says he'll find the culprit, and toss him into a vat of acid. He will kill you, Zo Ga─yes, yes, he will!"},{"name":"GIGU","text":"&lt;gulp&gt; But I'm too young to die! Yes, yes, I am!"},{"name":"BIBI","text":"Then you must abandon this madness and flee this place─run, take flight, flee!"},{"name":"GIGU","text":"Y-Yes, yes, I think I will. It was nice knowing you all. Good–bye, good luck, farewell─"},{"name":"SKAETSWYS","text":"Gah! Are ye out o' yer bloody mind!? Ye've come this far, and yer just goin' to leave yer comrades behind? Take one cowardly step, and I'll skewer ye where ye stand!"},{"name":"GIGU","text":"Y-Yes, of c-course! I-I will stand and do battle─clash, brawl, battle!"},{"name":"BIBI","text":"&lt;sigh&gt; You have not changed one bit, Gi Gu. No, no, you are as weak and wishy-washy as ever. Can you not make up your own mind?"},{"name":"GIGU","text":"You are right, Bi Bi. Yes, yes, you are! I will fight, and then run─no, no, run and then fight...?"},{"name":"BIBI","text":"I've seen enough of this. Yes, yes, I am through with you. Do what you want, and do it alone─abandoned, unaccompanied, alone."},{"name":"GIGU","text":"Wait, Bi Bi! No, no, you must not go! &lt;sigh&gt; Oh dear, I'm in trouble now..."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Recognized</span> reputation with the 789th Order."},{"name":"SYSTEM","text":"New kobold tribal daily quests are now available from 789th Order Craftsman Bo Gu."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the 789th Order vendor."},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"BAGO","text":"Yes, nothing like the smell of napalm in the morning─or was it the evening? But who can even tell down here in the depths!? Haha! Heaheahehaehahaha!"},{"name":"DOKANKUN","text":"Ba Go told me to expect yunzes. Zo Ga's workshop is on the other side of this exhaust pipe. Yunz'll go quickly and quietly─silently, soundlessly, quietly, that sort of thing─and tell no one that I's opened the door, yunz listening?"}],"reward":{"gil":729,"xp":12190},"reqs":{"beastrank":1,"jobs":[{"lvl":44,"id":34}],"quests":[66857]},"next":[66859]},"partials":[{"type":"npc","id":"1005927","obj":{"i":1005927,"n":"789th Order Pickman Gi Gu","l":350,"q":9}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"npc","id":"1005960","obj":{"i":1005960,"n":"13th Order Alchemist Ga Zi","l":350,"q":7}},{"type":"npc","id":"1005968","obj":{"i":1005968,"n":"Wounded Storm Private","l":350,"q":1}},{"type":"npc","id":"1005969","obj":{"i":1005969,"n":"Wounded Storm Sergeant","l":350,"q":1}},{"type":"npc","id":"1007935","obj":{"i":1007935,"n":"Wounded Red Swallow","l":350,"q":1}},{"type":"npc","id":"1007936","obj":{"i":1007936,"n":"Skaetswys","l":350,"q":1,"t":"Storm Lieutenant"}},{"type":"npc","id":"1007937","obj":{"i":1007937,"n":"789th Order Acolyte Ba Go","l":350,"q":1}},{"type":"npc","id":"1008883","obj":{"i":1008883,"n":"789th Order Acolyte Ba Go","l":350,"q":1}},{"type":"quest","id":"66857","obj":{"i":66857,"n":"How Low Can You Go","g":38,"l":"Outer La Noscea","s":0,"f":1}},{"type":"quest","id":"66859","obj":{"i":66859,"n":"The Kobold and the Beautiful","g":38,"l":"Outer La Noscea","s":0,"f":1}}]}