{"quest":{"name":"Mothers of All Bombs","location":"Outer La Noscea","id":66865,"patch":2.2,"sort":14,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005928,"target":1005928,"genre":39,"journal":["789th Order Dustman Bo Zu is looking for an adventurer to defuse a problem of burgeoning proportions.","Angered by the attention Ba Go lavishes upon his younger, prettier creations, a trio of breeding bombs has broken free from the acolyte's workshop and are wreaking havoc around Iron Lake. Quell their rage with a good beating and return their cores to Bo Zu.","You have defused the threat and acquired the three cores. Return to the 789th Order Dig and hand the fruits of your labor to Bo Zu.","Bo Zu expresses his gratitude for your efforts. Though it was originally his intention to return the cores to Ba Go, the dustman has reconsidered, fearing that this would further fan the flames of jealousy harbored by the acolyte's volatile beauties..."],"objectives":["Slay breeding bombs and obtain their cores.","Deliver bomb cores to 789th Order Dustman Bo Zu."],"dialogue":[{"name":"BOZU","text":"They're going to blow─burst, blast, blow! Who? Three of Ba Go's beauties, yes, yes, that is who!"},{"name":"BOZU","text":"And not just any beauties─no, no, they are the mothers of all beauties. Ba Go's very first creations. Ba Go spends too much time with his newest creations, and their mothers are not happy─no, no, not happy at all."},{"name":"BOZU","text":"They escape to Iron Lake, where they seethe with anger─fume, swell, seethe─and Ba Go is too smitten with his newfound lovelies to notice. You must cool their ire, yes, and bring their cores back to me. You bring them to me, and I bring them to Ba Go, that gentler beauties may be born."},{"name":"BOZU","text":"Three of Ba Go's beauties have escaped to Iron Lake. Yes, they seethe with anger─fume, swell, seethe─and Ba Go is too smitten with his newfound lovelies to notice. You must cool their ire, yes, and bring their cores back to me, that gentler beauties may be born."},{"name":"BOZU","text":"You return with the cores─yes, yes you do?"},{"name":"BOZU","text":"You have my gratitude, adventurer─my thanks, my appreciation, my gratitude. The last time Ba Go's beauties escaped, they almost burned poor Bo Zu's nose off. Yes, yes, they did."},{"name":"BOZU","text":"Bo Zu thinks Ba Go has more beauties than he knows what to do with. Maybe these cores are better kept here─yes, kept safe and quiet in the hands of Bo Zu..."},{"name":"POPMESSAGE","text":"The breeding bomb fumes with jealousy!"},{"name":"BALLOON","text":"&lt;huff&gt; &lt;puff&gt;"},{"name":"BALLOON","text":"Hurrrgh!"}],"reward":{"gil":360,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8625},"reqs":{"beastrank":1,"jobs":[{"lvl":41,"id":34}]}},"partials":[{"type":"npc","id":"1005928","obj":{"i":1005928,"n":"789th Order Dustman Bo Zu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}