{"quest":{"name":"Revenge of the Furred","location":"Outer La Noscea","id":66860,"patch":2.2,"sort":0,"icon":100238,"beast":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1005927,"target":1003550,"involved":[1005931,1005932,1007942,1007943,1007944,1007946,1007947,1007949],"genre":38,"journal":["As is his wont, 789th Order Pickman Gi Gu is fretting and fidgeting.","A visibly harried Gi Gu stammers to you some incoherent babbling about his beloved Bi Bi urging him to flee the dig. Pressed for a reason, Gi Gu confesses that he was too frightened to ask. Seek out Bi Bi for yourself and see what is amiss.","Bi Bi had only begun to reveal the latest plan of the scheming Zo Ga when the ever-intimidating 13th Order Fugleman came storming to the scene. Enraged at all those plotting against him, he accosted Bi Bi, demanding that she lend her alchemical prowess to his odious plot. Speak with Gi Gu─who is unlikely to offer any constructive advice─and decide on a course of action.","A rousing rally from Lieutenant Skaetswys has seemingly instilled Gi Gu with the courage to strike back at Zo Ga's oppression. The operation will require a healthy quantity of explosives, which you have agreed to procure from the alchemist Ba Go in the labor-shy Gi Gu's stead.","The eccentric Ba Go, concerned about little more than seeing things go boom, has entrusted to you a veritable arsenal of bombs for the assault on U'Ghamaro. Infiltrate the mines and set limpet bombs at suitable locations.","The first set of bombs has been successfully placed. Report to Lieutenant Skaetswys for further instructions.","Your task continues. Head deeper into the mines and place three more limpet bombs while Skaetswys stands on the lookout for Zo Ga's men.","You have succeeded in placing the remaining bombs. Inform Skaetswys that the deed is done.","With the groundwork for the operation successfully laid, Skaetswys suggests that you pay a visit to the 13th Order workshop to ensure that Gi Gu holds up his end of the agreement. Speak again with the lieutenant, who stands before the workshop's front door.","You have successfully infiltrated the workshop, yet it appears Gi Gu is taking his precious time with his duties. Seek him out and give him a word or two of encouragement.","For the first time since you met him─if not in his entire life─789th Order Pickman Gi Gu has followed through on his word. With the final bomb set directly on Zo Ga's prized furnace, you and your comrades can take your leave. Speak with Lieutenant Skaetswys by the workshop exit.","When your escape from the workshop was intercepted, the heretofore–hapless 789th Order Pickman Gi Gu summoned a measure of courage from gods–know–where, defeating the formidable 13th Order Fugleman Zo Ga and sending all present into a state of utter disbelief in the process. Return to the 789th Order Dig and congratulate the unlikely hero on his startling victory.","Instilled with courage from his victory over his longtime oppressor, 789th Order Pickman Gi Gu has vowed to channel his newfound strength into leading his kobolds into a new age of prosperity─after he indulges in a well-deserved rest, of course. Despite lingering doubts, Lieutenant Skaetswys expresses her relief at this turn of events, and encourages you to deliver news of your success to Lieutenant Trachraet in Limsa.","Lieutenant Trachraet applauds your efforts in the Kobold Dig on behalf of Maelstrom. With Zo Ga removed from power and the 789th poised to rise to a position of influence, the day that Lominsans and kobolds live in peace may not be as far off as once thought."],"objectives":["Speak with 175th Order Alchemist Bi Bi at the 789th Order Dig.","Speak with 789th Order Pickman Gi Gu.","Speak with 789th Order Acolyte Ba Go.","Set limpet bombs at the specified locations in U'Ghamaro Mines.","Speak with Skaetswys in U'Ghamaro Mines.","Set additional limpet bombs at the specified locations in U'Ghamaro Mines.","Speak with Skaetswys in U'Ghamaro Mines.","Speak with Skaetswys at the entrance to the 13th Order workshop.","Speak with 789th Order Pickman Gi Gu.","Speak with Skaetswys.","Speak with Gi Gu at the 789th Order Dig.","Report to Trachraet at Maelstrom Command in Limsa Lominsa."],"dialogue":[{"name":"GIGU","text":"Aiyeeeeee! We must flee this place, adventurer─run, dash, flee for our lives!"},{"name":"GIGU","text":"Why? Because Bi Bi said so, and dare I disobey my dear Bi Bi again? No, no, I dare not."},{"name":"GIGU","text":"<span class=\"emphasis\">Why</span> must we flee? She tried to tell me, but I was too horrified to listen─terrified, petrified, horrified! If you would know more, find her and ask yourself. I will be holding my paws over my ears. Yes, yes, I will."},{"name":"GIGU","text":"It is not like my Bi Bi to panic so. No, no, it is rare indeed. Whatever has happened, it must be dire─grim, dreadful, dire!"},{"name":"BIBI","text":"Adventurer! D-Did you not flee with Gi Gu!? You must leave this place. No, no, it is not safe for─"},{"name":"BIBI","text":"Eeek!"},{"name":"ZOGA","text":"Well, well...looky what we have here. Stragglers, eh─laggards, strayers, stragglers..."},{"name":"KOBOLDGALA01321","text":"(-Comely Kobold Lass-)Ewww, a hairless one! Just looking at <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> makes me want to retch─gag, heave, retch!"},{"name":"ZOGA","text":"Bi Bi. I warned you what would happen if you betrayed me, but did you listen? No, no, you didn't..."},{"name":"SKAETSWYS","text":"<span class=\"highlight\">Forename</span>! Are ye─ &lt;gulp&gt; This doesn't look good..."},{"name":"GIGU","text":"Z-Zo Ga, please listen─hear, hark, listen!"},{"name":"ZOGA","text":"Gi Gu! You and your mangy lot weren't content with a bunch of spongers─leeches, scroungers, spongers. No, no, you would drag down your betters to your sorry standing."},{"name":"GIGU","text":"N-No, Zo Ga! No, no, this is not so!"},{"name":"ZOGA","text":"Shut your maw! I see the adventurer standing beside you. You are a traitor to the tunnels─a turncoat, a treasonist, a traitor!"},{"name":"GIGU","text":"Please, Zo Ga! I...I only wanted to go home!"},{"name":"ZOGA","text":"Oh, I have a new home for you. Yes, yes, I do... It's cozy, and oh-so-warm─scorching, scalding, warm. Yes, you'll make fine fuel for our flames..."},{"name":"BIBI","text":"Zo Ga! Have mercy─"},{"name":"ZOGA","text":"You disappoint me, Bi Bi. Yes, yes, you do. By my side, you could have had power and riches beyond your wildest dreams. Yet you cast your lot with this weakling─this sop, this doormat, this weakling."},{"name":"BIBI","text":"Please, Zo Ga! I will do anything you say! Yes, yes, anything at all! Just spare poor Gi Gu's life!"},{"name":"GIGU","text":"Bi Bi! No, no, you must not!"},{"name":"ZOGA","text":"Anything, you say? Anything at all...? Now here's an astute girl─smart, sharp, astute. Zo Ga can find a job for you. Yes, yes, I can..."},{"name":"ZOGA","text":"A skilled alchemist, you are. Yes, yes, and quite the looker, too. You will slave in my workshop by day and keep me warm by night. Yes, you will."},{"name":"ZOGA","text":"And if I ever catch you slacking off, I'll feed you to the furnace and blast your whole order into the sea. Bwahahaha!"},{"name":"BIBI","text":"Gi Gu... Promise you will come for me─swear, vow, promise...?"},{"name":"GIGU","text":"Bi Bi! Bi Biiiiii! &lt;sniff&gt;"},{"name":"SKAETSWYS","text":"That Zo Ga... Talk about gettin' too big for yer britches. Still, I fear for the kobold lass's well-bein'..."},{"name":"GIGU","text":"Bi Bi! This is unfair─unreasonable, unjust, unfair!"},{"name":"SKAETSWYS","text":"And it's yer bloody fault as much as anyone's! If ye moved yer legs and paws 'alf as much as ye do yer mouth, maybe ye could 'ave saved the girl from 'er fate."},{"name":"GIGU","text":"Bi Bi... &lt;sniff&gt; You speak true─verily, assuredly, true. At last─long, long last─I see the error of my ways. Yes, to save his love, Gi Gu will follow wherever you go."},{"name":"SKAETSWYS","text":"Finally, yer talkin' some sense! Now, round up yer best men─we're off to U'Ghamaro to take the battle to Zo Ga."},{"name":"GIGU","text":"What!? Y-You cannot be serious. This is madness─craziness, lunacy, madness!"},{"name":"SKAETSWYS","text":"“Follow wherever ye go,” eh!? Bloody worthless, ye are! What in the seven 'ells does Bi Bi even see in ye!?"},{"name":"GIGU","text":"B-But...you do not understand... No, no, you do not see. Round up my best men? No, no...no kobold will follow a leader as pathetic as me. I am alone─helpless, hopeless, alone."},{"name":"BOZU","text":"It is you who speaks madness, Gi Gu─craziness, lunacy, madness. You know nothing. No, no, nothing at all."},{"name":"BOBU","text":"Listen to us, Gi Gu. Yes, yes, listen well. We are with you─we have always been with you."},{"name":"BOGU","text":"Bo Zu and Bo Bu speak true. Are we jealous of Bi Bi's love for you? Yes, yes, we are. But you are our leader, and you have always led us well. Wherever you go, we will follow faithfully─dutifully, loyally, faithfully."},{"name":"GIGU","text":"Bo Zu... Bo Bu... Bo Gu... But I am...I am─"},{"name":"SKAETSWYS","text":"Yer the leader of the 789th, that's what ye are, and it's 'igh time ye bloody acted the part! Yer friends are countin' on ye, and Bi Bi all the more so! The choice is yers to make─now, what do ye say!?"},{"name":"GIGU","text":"I...I will go. Yes, yes, yes, yes, yes, YES! Just wait, my precious Bi Bi─Gi Gu is coming to save you!"},{"name":"SKAETSWYS","text":"Music to my bloody ears! I guess men─er, kobolds─can change, after all."},{"name":"SKAETSWYS","text":"Now listen up! <span class=\"highlight\">Forename</span> and I will storm U'Ghamaro from the fore and create a diversion. Gi Gu─ye'll sneak into the workshop the back way and put Zo Ga's new furnace out of commission. Yer fruitcake of a friend Ba Go should be able to furnish us with the tools for the task, aye?"},{"name":"SKAETSWYS","text":"Amidst all the smoke and clatter, we'll find Bi Bi and return 'er to safety. Now listen, Gi Gu─<span class=\"highlight\">Forename</span> and I stand with ye, but this is yer battle. The life and livelihood of you, yer friends, and yer love─it's all in yer grubby paws. Got it? Good! Now let's hear yer battle cry!"},{"name":"GIGU","text":"&lt;gulp&gt; I... I... Mammyyyyyyyyy! F-Forgive me. You will speak to Ba Go for me, yes? I need a moment to reflect─meditate, contemplate, reflect."},{"name":"GIGU","text":"You will go to Ba Go and ask him to ready our tools, yes? I need a moment to gather my strength─my courage, my power, my strength."},{"name":"SKAETSWYS","text":"Looks like our words finally got through to gutless ol' Gi Gu. It's about bloody time, I say!"},{"name":"SKAETSWYS","text":"Ready yerself, <span class=\"highlight\">Forename</span>─there'll be some fireworks in U'Ghamaro tonight. Aye, I've been waitin' for a mission like this ever since I joined the Maelstrom. "},{"name":"BAGO","text":"You and Gi Gu will make things go boom? Make mayhem─madness, massacre, mayhem? Ba Go will help. Oh, yesss, yesss, he will!"},{"name":"BAGO","text":"Ba Go will give you the biggest, burstingest of Ba Go's beauties. They make very big booms, they do. Yesss, yesss, indeed!"},{"name":"BAGO","text":"Zo Ga's workshop...no, no, not just his workshop. All of U'Ghamaro will be reduced to rubble─wreckage, ruin, rubble!"},{"name":"BAGO","text":"You will distract Zo Ga's lackeys, help Gi Gu do his deed, yes? Ba Go has a present for you as well─a gift, a boon, a present."},{"name":"BAGO","text":"Take these lovely, lovely little ones. Their size may be trifling, but do not be fooled. No, no. Set them off in succession, and they will make lovely, lovely sparks. Yesss, yesss, they will."},{"name":"BAGO","text":"Ba Go has waited long, long for this day. You will take my lovelies and make big booms and blasts? Make U'Ghamaro go boom, yes?"},{"name":"GIGU","text":"Gi Gu has been thinking─pondering, contemplating, thinking. Maybe we can just call this off and stay home, stay safe? No, no, we can't?"},{"name":"SKAETSWYS","text":"Ye've brought the bombs, aye, <span class=\"highlight\">Forename</span>? Good! Let's begin. Ye've got more experience 'andlin' these things than I, so I'll leave the technical side to you. I'll keep lookout for Zo Ga and 'is scurvy 'enchmen."},{"name":"SKAETSWYS","text":"Aye, that should do the trick 'round 'ere. Now to delve a bit deeper. Follow me!"},{"name":"SKAETSWYS","text":"I'll keep watch, just as before. When yer done plantin' the bombs, ye just say the word."},{"name":"SKAETSWYS","text":"Looks like our job 'ere is done. The rest is up to Gi Gu─a right 'orrifyin' thought, that."},{"name":"SKAETSWYS","text":"Zo Ga's workshop lies right beyond this door, and I've already taken the liberty of knockin' out the doorman and relievin' 'im of 'is key. Let's 'op to it, then, eh, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"Enter the 13th Order workshop?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"GIGU","text":"Adventurer! You have come to see Gi Gu do his job, yes? Yes, behold─gaze, regard, behold!"},{"name":"GIGU","text":"Ah, that should do it, probably...possibly...maybe? You are proud of Gi Gu, yes? Yes, yes, you should be!"},{"name":"GIGU","text":"Oh, if only Bi Bi could see me now! Yes, she would be smitten─swooning, struck, smitten!"},{"name":"GIGU","text":"Wh-What was that noise!? Oh, adventurer, we must flee─run, fly, flee─before scary, scary Zo Ga finds us!"},{"name":"SKAETSWYS","text":"What's keepin' that bloody Gi Gu!? That worthless pile o' shite best 'ave found the furnace. 'Cause if 'e's off cowerin' in some corner instead..."},{"name":"SKAETSWYS","text":"That craven kobold did 'is job, eh? It's a bloody miracle! Now let's get out of 'ere before the whole place comes tumblin' down."},{"name":"Q2","text":"Leave the 13th Order workshop?"},{"name":"A2","text":"Yes."},{"name":"A2","text":"No."},{"name":"GIGU","text":"Gi Gu's job is done. Now, we must leave before Zo Ga returns or we are dead for sure─doomed, deceased, dead!"},{"name":"GIGU","text":"Back to the dig! Yes, quickly, swiftly, briskly!"},{"name":"ZOGA","text":"Gi Guuuuuu! I will crush you─smash you, squash you, crush you!"},{"name":"ZOGA","text":"In all my years, I have never suffered such indignity! You are finished, Gi Gu! Yes, yes, your bones will feed my furnace!"},{"name":"GIGU","text":"Stand back, adventurer. No, no, no further."},{"name":"GIGU","text":"This is... This is my battle─my fight, my struggle, my battle."},{"name":"ZOGA","text":"Feel the pain, Gi Gu! The hurt...the suffering...the pain!"},{"name":"GIGU","text":"Ow! Ow! Have mercy, Zo Ga. Yes, yes, have mercy!"},{"name":"ZOGA","text":"There will be no mercy for you, Gi Gu! No, no, not ever! You will feel the full brunt of my wrath─my anger, my rage, my wrath!"},{"name":"GIGU","text":"Zo... &lt;heave&gt; Ga... &lt;cough&gt; P-Please..."},{"name":"ZOGA","text":"Die─perish, croak, die─like the worthless dreg you are!"},{"name":"GIGU","text":"Zo... Ga..."},{"name":"ZOGA","text":"A sucker for punishment, eh? Yes, yes, you are..."},{"name":"BIBI","text":"Zo Ga! Please stop this─I beg you, beseech you, implore you!"},{"name":"BIBI","text":"Gi Gu has suffered enough. Yes, yes, he has."},{"name":"BIBI","text":"You are strong, Zo Ga. Yes, strong and skilled with the pick. You should be leading us to greater heights! Why waste your strength on poor, weak Gi Gu!?"},{"name":"GIGU","text":"&lt;cough&gt; ...Silent..."},{"name":"GIGU","text":"...be...silent..."},{"name":"BIBI","text":"Gi Gu...?"},{"name":"GIGU","text":"Yes, yes, be silent! Shut up! Close your bloody maw!"},{"name":"SKAETSWYS","text":"Gi Gu?"},{"name":"ZOGA","text":"Gi Gu...?"},{"name":"BIBI","text":"(-Everyone-)Gi Gu!?"},{"name":"GIGU","text":"Stand back! Hands off! Get lost! Yes, yes, all of you! I never asked for your help─no, no, not a one of you! This is Gi Gu's battle!"},{"name":"GIGU","text":"See this, Zo Ga? Yes, yes, you do! This is Ba Go's life's work─his magnum opus! It brims with the power to blast you and the whole 13th Order into dust─debris, detritus, dust!"},{"name":"GIGU","text":"This is for all those years of oppression─insult, abuse, oppression! Yes, yes, Zo Ga...you have walked over Gi Gu for the last time!"},{"name":"GIGU","text":"Zo Gaaaaaa! I'll see you, see you in the seventh hell!"},{"name":"ZOGA","text":"<span class=\"emphasis\">Wh-What!? Gi Gu, what have you...</span>!?"},{"name":"GIGU","text":"Gaaaaaaaaahhhhhh!!!"},{"name":"ZOGA","text":"Urk─!"},{"name":"GIGU","text":"I'm finished─done, complete, finished."},{"name":"GIGU","text":"Thank you, my friends─my comrades, my allies, my friends. It is you─yes, yes, all of you─who gave me the courage to fight that battle. Yes, a battle I should have fought long ago."},{"name":"SKAETSWYS","text":"Hahaha! I 'ad me doubts, I must admit, but I'm 'appy to say ye proved me wrong. And you, <span class=\"highlight\">Forename</span>─this wouldn't 'ave been possible without ye."},{"name":"SKAETSWYS","text":"With Zo Ga out of the way, the kobolds of U'Ghamaro should quiet down─a development which should please Commander Bloeidin and the Red Swallows. Spent more time in those tunnels than I'd 'ave liked, but all's well that ends well."},{"name":"BIBI","text":"..."},{"name":"GIGU","text":"Bi Bi! You have come! You are proud of me, yes? Yes, yes, what do you think of your Gi Gu now!?"},{"name":"BIBI","text":"You...you are <span class=\"emphasis\">horrible</span>─terrible, miserable, <span class=\"emphasis\">horrible</span>! I've never been told such hurtful things─no, no, never! What happened to the sweet Gi Gu I used to know!? Good-bye, Gi Gu...&lt;sniff&gt;...farewell..."},{"name":"GIGU","text":"I cannot win. No, no, not with her."},{"name":"GIGU","text":"But do not worry about Gi Gu─do not fret, do not fuss, do not worry. "},{"name":"GIGU","text":"Yes, for my battle with Zo Ga has given me new courage─strength, confidence, courage."},{"name":"GIGU","text":"I will win back Bi Bi's heart, yes. I will increase our productivity a hundredfold. I will not rest─slack, slumber, rest─until the 789th becomes the 1st!"},{"name":"GIGU","text":"I will do all this─yes, all this and more! Yes, yes...&lt;yawn&gt;...as soon as I awake from my nap."},{"name":"SKAETSWYS","text":"...Perhaps I spoke too soon. Anyroad, there's little more that we can do, <span class=\"highlight\">Forename</span>. I'll stop off at Camp Overlook. Would ye mind goin' on ahead to Maelstrom Command?"},{"name":"SKAETSWYS","text":"Aye, the Red Swallows should be right pleased to 'ear of Zo Ga's demise. I'll deliver the news to Commander Bloeidin. In the meantime, what say ye to reportin' back to Maelstrom Command?"},{"name":"GIGU","text":"Gi Gu is relieved that the battle is over─at ease, at peace, relieved. Yes, yes, I think it is time for a well-deserved rest..."},{"name":"TRACHRAET","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>! I feared we'd lost ye to the tunnels."},{"name":"TRACHRAET","text":"To think that a single missin' shipment would lead ye on such a circuitous journey through the bowels of U'Ghamaro. I shudder at the thought."},{"name":"TRACHRAET","text":"And yet, though there is still a long road ahead, I daresay yer efforts 'ave gone far in leadin' us down the path o' peace with the kobolds."},{"name":"TRACHRAET","text":"Aye, ye've done Limsa proud this day, my friend─accept this as remuneration for yer deeds. On behalf of the Maelstrom and the Admiral 'erself, I commend ye!"},{"name":"SKAETSWYS","text":"Never 'ad much of a fondness for kobolds, but after gettin' to know the little buggers better, I must say they're not all 'alf bad. Aye, there may be 'ope for an understandin' between our peoples yet... Mind ye, I wouldn't 'old me breath waitin'."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the 789th Order."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the 789th Order vendor."},{"name":"SKAETSWYS","text":"Zo Ga's workshop is just beyond this door. Come, <span class=\"highlight\">Forename</span>─we'd best go and make sure Gi Gu isn't off cowerin' in a corner somewhere."}],"reward":{"gil":1184,"xp":13965},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}],"quests":[66859]}},"partials":[{"type":"npc","id":"1005927","obj":{"i":1005927,"n":"789th Order Pickman Gi Gu","l":350,"q":9}},{"type":"npc","id":"1003550","obj":{"i":1003550,"n":"Trachraet","l":28,"q":8,"t":"Storm Lieutenant"}},{"type":"npc","id":"1005931","obj":{"i":1005931,"n":"Skaetswys","l":350,"q":5,"t":"Storm Lieutenant"}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"npc","id":"1007942","obj":{"i":1007942,"n":"Skaetswys","l":350,"q":1,"t":"Storm Lieutenant"}},{"type":"npc","id":"1007943","obj":{"i":1007943,"n":"Skaetswys","l":350,"q":1,"t":"Storm Lieutenant"}},{"type":"npc","id":"1007944","obj":{"i":1007944,"n":"Skaetswys","l":350,"q":1,"t":"Storm Lieutenant"}},{"type":"npc","id":"1007946","obj":{"i":1007946,"n":"789th Order Pickman Gi Gu","l":350,"q":1}},{"type":"npc","id":"1007947","obj":{"i":1007947,"n":"Skaetswys","l":350,"q":1,"t":"Storm Lieutenant"}},{"type":"npc","id":"1007949","obj":{"i":1007949,"n":"175th Order Alchemist Bi Bi","l":350,"q":1}},{"type":"quest","id":"66859","obj":{"i":66859,"n":"The Kobold and the Beautiful","g":38,"l":"Outer La Noscea","s":0,"f":1}}]}