{"quest":{"name":"Finger Licking Good","location":"Outer La Noscea","id":66863,"patch":2.2,"sort":12,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005928,"target":1005928,"involved":[1005932],"genre":39,"journal":["789th Order Dustman Bo Zu's all-too-healthy appetite has gotten him into hot water.","Bo Zu fears that he will incur the ire of the 789th's hot–tempered acolyte, Ba Go, for munching on─of all things─the appendages of the latter's precious bombs. Travel to Iron Lake and pluck three digits from the hands of the grenades hovering about the area, that you might make amends for the gluttonous dustman's misdeeds.","Three grenade digits are yours. Deliver them to Ba Go at the 789th Order Dig before he visits flaming destruction upon the rueful Bo Zu.","Ba Go was already wise to Bo Zu's misdeeds, having suffered similar antics before. He accepts the digits you have procured for him, but has little intention of forgiving his friend. Fortunately for Bo Zu, the acolyte is more concerned with mending his beauties than seeking revenge.","Sufficiently shaken by Ba Go's threats, Bo Zu will endeavor not to feast on the acolyte's beauties in the future. With the vain hope that the dustman's brain is stronger than his belly, you take your leave..."],"objectives":["Defeat grenades to obtain grenade digits.","Deliver grenade digits to 789th Order Acolyte Ba Go.","Report to 789th Order Dustman Bo Zu."],"dialogue":[{"name":"BOZU","text":"Oh, I've done it this time! Yes, yes, I have. He will roast me─burn me, scorch me, roast me alive!"},{"name":"BOZU","text":"Who will? Ba Go will, with cackles, cackles and glee, for I snacked on the fingers of some of his beauties. Yes, yes, I did. But who can blame poor, hungry Bo Zu? Not you─no, no, not you."},{"name":"BOZU","text":"Please, adventurer! You must bring fiery fingers to Ba Go's workshop before he comes hunting for Bo Zu. You would not want to see poor Bo Zu burn, would you? No, no, you...probably shouldn't answer that."},{"name":"BOZU","text":"Please, adventurer! You must bring fiery fingers to Ba Go's workshop before he comes hunting for Bo Zu. You would not want to see poor Bo Zu burn, would you? No, no, you...probably shouldn't answer that."},{"name":"BAGO","text":"My beauties, dismembered again! I will burn every last hair from Bo Zu's body─yes, yes, Bo Zu will sear, sizzle, burn!"},{"name":"BAGO","text":"Fire fingers, you bring? To me, you say, from Bo Zu? Hah! That is a good laugh─cackle, chortle, laugh. In many, many years I have not seen Bo Zu lift a paw in the name of honest work. No, no, not a one."},{"name":"BAGO","text":"I will not so easily forgive Bo Zu─no, no, never─but my poor, fingerless beauties demand my attention. Deliver to Bo Zu a warning─a caution, a threat, a warning. The next time he snacks in my workshop will be the last!"},{"name":"BOZU","text":"Oh, thank you, adventurer! Ba Go said what!? &lt;gulp&gt; Tell me you jest─joke, tease, jest."},{"name":"BOZU","text":"But Bo Zu has learned his lesson. Besides, fire fingers are not easy on Bo Zu's belly─no, no, they make Bo Zu's belly burn. Yes, yes, Bo Zu's mind understands, but will his belly listen? This Bo Zu does not know..."}],"reward":{"gil":360,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8625},"reqs":{"beastrank":1,"jobs":[{"lvl":41,"id":34}]}},"partials":[{"type":"npc","id":"1005928","obj":{"i":1005928,"n":"789th Order Dustman Bo Zu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}