{"quest":{"name":"Misery Loves Company","location":"Outer La Noscea","id":66867,"patch":2.2,"sort":18,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005928,"target":1005928,"involved":[1005932],"genre":39,"journal":["789th Order Dustman Bo Zu will not stand for enterprise or ingenuity─no, no, he will not.","Much to Bo Zu's chagrin, the 639th─a heretofore–hapless order which inhabits the neighboring tunnels─has invented a new digger with the potential to open prodigiously profitable veins of ore for the mining. In this kobold–eat–kobold world, fortune for the 639th would entrench the 789th even deeper into their current rut. At Bo Zu's urgent behest, speak with the acolyte Ba Go and acquire the means to dash the 639th's dreams of a better life.","Eager as always to send waves of chaos and destruction through the tunnels, Ba Go furnishes you with supplies that should be sufficient to end the 639th's hopes of productivity and promotions. Set glowing coals about the prototype digger and prepare to stand back.","The coals having been set, walk a safe distance away, then release the smart bombs at the ill–fated apparatus and enjoy the sparks.","Their digger no more, the 639th is destined for a return to humiliation and ignominy, a development which will certainly please Bo Zu. Return to the 789th Order Dig and relay the good tidings.","Bo Zu praises your efforts, pleased to hear that he and his compatriots will no longer be alone at the arse end of kobold society. You have little doubt that he will seek your aid the next time an overly ambitious order employs ingenuity and inventiveness to get ahead in this subterranean rat race."],"objectives":["Speak with 789th Order Acolyte Ba Go.","Set glowing coals by the 639th Order digger.","Release the smart bombs from a safe location.","Report to 789th Order Dustman Bo Zu."],"dialogue":[{"name":"BOZU","text":"Those cheats─tricksters, fraudsters, cheats! They must pay for this. Yes, yes, pay they must, and pay they will!"},{"name":"BOZU","text":"Who are they? The 639th is who! Once, they were as devoted to idleness and indolence as us─yes, yes, they were. Now, they dig and dig. Dig for riches, and for the favor of Zo Ga!"},{"name":"BOZU","text":"They use new rock eater to open walls, find metals so shiny they would blind Bo Zu's eyes. A shameless display of effort─brazen, flagrant, shameless! No, no, Bo Zu will not stand for this."},{"name":"BOZU","text":"I will teach them that hard work does not pay. <span class=\"emphasis\">I</span>, meaning <span class=\"emphasis\">you</span>. Yes, yes, you and Ba Go. The two of you will know what to do."},{"name":"BOZU","text":"I will teach the 639th that hard work does not pay. <span class=\"emphasis\">I</span>, meaning <span class=\"emphasis\">you</span>. Yes, yes, you and Ba Go. The two of you will know what to do."},{"name":"BOZU","text":"Bo Zu would make 639th's new rock eater go boom? So it is with Bo Zu. No respect for the work of others─no esteem, no regard, no respect."},{"name":"BOZU","text":"Ba Go does not like Bo Zu─no, no, not in the least─but he does like making things go boom. Yesss, yesss, he <span class=\"emphasis\">does</span>!"},{"name":"BOZU","text":"Ba Go will give you the most potent of his beauties─yes, yes, he will. Place these fire rocks near the rock eater, and let Ba Go's beauties do the rest. Oh, and remember to stand back─far, far, back. Or maybe─mayhap, possibly, maybe─you want to go boom, too? Heaheahehaehahaha!"},{"name":"BOZU","text":"Ba Go will give you the most potent of his beauties─yes, yes, he will. Place these fire rocks near the rock eater, and let Ba Go's beauties do the rest. Oh, and remember to stand back─far, far, back. Or maybe─mayhap, possibly, maybe─you want to go boom, too? Heaheahehaehahaha!"},{"name":"BOZU","text":"The sound of the digger going boom woke me up from my nap. Never─no, never─have I been happier to have my rest disturbed─disrupted, interrupted, disturbed!"},{"name":"BOZU","text":"Bo Zu bears no ill will for the 639th─no, no, none at all. I only wish for them to remember the merits of sluggardy─idleness, sloth, sluggardy. Is this so much to ask?"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"BALLOON","text":"Trespasser!<br>Interloper, intruder, trespasser!"}],"reward":{"gil":360,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8625},"reqs":{"beastrank":1,"jobs":[{"lvl":41,"id":34}]}},"partials":[{"type":"npc","id":"1005928","obj":{"i":1005928,"n":"789th Order Dustman Bo Zu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}