{"quest":{"name":"Ill-gotten Gains","location":"Outer La Noscea","id":66868,"patch":2.2,"sort":15,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005928,"target":1005928,"genre":39,"journal":["789th Order Dustman Bo Zu has an uncharacteristically eager glint in his eyes.","In one of the more shocking developments of the Seventh Astral Era, legendary laggard Bo Zu states a desire to turn over a new leaf and do some work for a change, though he would ask your aid in summoning the necessary resolve. To that end, travel to the Kobold Dig and fetch a handful of electrum from the 639th Order, that the dustman might witness firsthand the fruit of honest labor with his own eyes.","You have succeeded in “borrowing” a quantity of pristine electrum from the 639th's stock. Deliver it to Bo Zu, that it might serve to boost the dustman's morale.","To the surprise of absolutely no one, Bo Zu decides to appropriate the borrowed electrum in the 789th's name. Though the dustman's methods are questionable, no doubt it is the abuse and oppression he and his peers suffer at the hands of Zo Ga that has driven them to such desperate measures..."],"objectives":["Search 639th Order pots for high-grade electrum ore.","Deliver high-grade electrum ore to 789th Order Dustman Bo Zu."],"dialogue":[{"name":"BOZU","text":"Bo Zu has been a sluggard─a loafer, a slacker, a sluggard. But Bo Zu would be a sluggard no more─no, no, no more!"},{"name":"BOZU","text":"Gi Gu says that the 639th finds shiny metals─yes, yes, the shiniest. Could this be true? The 639th was once as shabby as us─ratty, scruffy, shabby."},{"name":"BOZU","text":"If the 639th can find shinies, then why not me? Yes, yes, why not me? Bo Zu can strike it rich, too!"},{"name":"BOZU","text":"But I would know for certain─for true, for sure, for certain. You will go to the dig, yes? Bring back proof of the 639th's accomplishments for Bo Zu? Yes, yes, this you must do!"},{"name":"BOZU","text":"I would know for certain─for true, for sure, for certain. You will go to the dig, yes? Bring back proof of the 639th's accomplishments for Bo Zu? Yes, yes, this you must do!"},{"name":"BOZU","text":"Adventurer brings back shinies, yes? From the 639th to Bo Zu?"},{"name":"BOZU","text":"See how it sparkles─shines, glimmers, sparkles! The 639th has dug up a fortune. Yes, yes, they strike true!"},{"name":"BOZU","text":"Surely...they will not miss a shiny─no, no, not a shiny or two. Thank you─yes, thank you, adventurer! For today, wealth has also come to Bo Zu!"}],"reward":{"gil":360,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8625},"reqs":{"beastrank":1,"jobs":[{"lvl":41,"id":34}]}},"partials":[{"type":"npc","id":"1005928","obj":{"i":1005928,"n":"789th Order Dustman Bo Zu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}