{"quest":{"name":"No Such Thing as a Free Lunch","location":"Outer La Noscea","id":66862,"patch":2.2,"sort":11,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005928,"target":1005928,"genre":39,"journal":["789th Order Dustman Bo Zu wants his dinner, but he'll be damned if he's going to work for it.","The labor–averse Bo Zu has caught word of generous meals being distributed by Zo Ga to those industrious kobolds who have earned the fugleman's favor, and has concluded that the 789th is equally deserving of gustatory gratification despite their decided lack of productivity. Head to Iron Lake and appropriate three lavish lunchpots so that Bo Zu and his friends can feast like their hard–working peers for a day.","You have managed to secure three piping hot lunchpots. Deliver the feast to the 789th Order Dig in hopes that it will sate the stomach of the slavering Bo Zu.","Bo Zu revels in the fruits of your success, though any hopes that the dustman has learned a lesson about the value of hard work are promptly dashed when he shamelessly expresses his eagerness to impose upon you similarly again. You can only hope that the idle–handed kobold's stomach remains sated for the foreseeable future."],"objectives":["Acquire lavish lunchpots from Iron Lake.","Deliver lavish lunchpots to 789th Order Dustman Bo Zu."],"dialogue":[{"name":"BOZU","text":"The unfairness─injustice, iniquity, unfairness of it all!"},{"name":"BOZU","text":"While the 789th goes famished─starving, hungry, famished─Zo Ga and his cronies feast! Feast on lunchpots packed, yes, so packed with tasty treats that a single one could feed our entire dig for a week."},{"name":"BOZU","text":"Should Zo Ga and his hardworking cronies get all the rewards? No, no, a hundred times no! Yes, our tummies are rumbling─grumbling, mumbling, rumbling─as much as theirs!"},{"name":"BOZU","text":"Why, I have a notion─a thought, a mind, a notion─to walk right over to Iron Lake and snatch one or three for myself. But walking is hard work. Yes, yes, and your legs are so much <span class=\"alternative-container\"><span class=\"alternative\">stronger</span><span class=\"alternative\">longer</span></span> than mine..."},{"name":"BOZU","text":"You will walk to Iron Lake and bring back three of Zo Ga's luscious lunchpots, yes? I am beside myself in drooling anticipation─dribbling, driveling, drooling anticipation!"},{"name":"BOZU","text":"Do I smell what I think I smell? Yes, yes, I believe I do!"},{"name":"BOZU","text":"Freshly plucked lava toad legs? Earthworms that still wriggle and squirm? This is more than a meal, it is a feast─a banquet, a spread, a feast for the senses!"},{"name":"BOZU","text":"Does sampling the delights of his peers inspire Bo Zu to work harder? No, no, never! Why would it, when I have <span class=\"alternative-container\"><span class=\"alternative\">strong-legged</span><span class=\"alternative\">long-legged</span></span> friends like you?"}],"reward":{"gil":360,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8625},"reqs":{"beastrank":1,"jobs":[{"lvl":41,"id":34}]}},"partials":[{"type":"npc","id":"1005928","obj":{"i":1005928,"n":"789th Order Dustman Bo Zu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}