{"quest":{"name":"Bo Zu's Blown Cover","location":"Outer La Noscea","id":66870,"patch":2.2,"sort":19,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005928,"target":1005928,"involved":[1005927,1005932],"genre":39,"journal":["789th Order Dustman Bo Zu fears that not all of his peers share an appreciation for slopwork and subterfuge.","Showing once again that he will spare no effort in shirking honest work, 789th Order Dustman Bo Zu has padded his sack with rubbish and refuse to meet his daily mining quota. None the wiser, the 411th Order plans to smelt the 789th's yield in their furnace, and Bo Zu fears that his ingenuity will not be well received. At Bo Zu's request, consult with the acolyte Ba Go, that you might lay waste to the furnace before the dustman's duplicity comes to light.","Ever eager to see destruction and disorder arise around him, Ba Go furnishes you with a bomb of considerable explosive power, along with instructions to carry it to your target─the 411th Order's furnace in the vicinity of Iron Lake─with all haste.<br><br>※Fail to complete your objective in the allotted span of time, and the limpet bomb will detonate, causing damage to you in the process.","The 411th's furnace is no more, and Bo Zu's secret remains safe for another day. Search the embers that you might return the bomb core to its creator, though you have a suspicion the spirited fireball will not come quietly...","You have successfully quelled the limpet bomb's temper and extracted its core. Return it to Ba Go at the 789th Order Dig, with the futile hope that his future creations will not prove so hot to handle.","Delighted to hear that his prized creation was every ilm as destructive as he had foreseen, Ba Go resolves to redouble his efforts in building bombs of even greater destructive power. For better or for worse, share the news of your success with Bo Zu.","Bo Zu breathes a sigh of relief, your efforts having ensured that his chicanery will go undetected and unpunished. Convinced that any effort to extol the virtues of honest labor would fall upon deaf ears, you take your leave, hoping against hope that the dawdling dustman's next imposition on your services will be a more constructive one..."],"objectives":["Speak with 789th Order Acolyte Ba Go.","Set a limpet bomb at the 411th Order furnace near Iron Lake.","Obtain a limpet bomb core from the embers.","Deliver the limpet bomb core to 789th Order Acolyte Ba Go.","Report to 789th Order Dustman Bo Zu."],"dialogue":[{"name":"BOZU","text":"Shiny metals are not easy to find─no, no, hide from Bo Zu's pick, they do. When I tire of working, I fill my sack with rocks and rubble instead. Does inspector notice? Not until Bo Zu is far away─far, far in the distance. Yes, Bo Zu is sharp like that─smart, quick, sharp."},{"name":"BOZU","text":"411th Order metalworkers are not so sharp. No, no, they are dull indeed. They would smelt my ore in their furnace. Do they not realize the perils of such an action─the dangers, the risks, the perils?"},{"name":"BOZU","text":"No, no, their recklessness must be stopped─halted, disrupted, stopped─and now. Fortunately, Bo Zu knows exactly what must be done─precisely, specifically, exactly."},{"name":"BOZU","text":"We must use Ba Go's beauties to make furnace go boom. That will teach the futility of expecting real work from Bo Zu─the pointlessness, the fruitlessness, the futility. Yes, yes, that will teach them to let Bo Zu be Bo Zu."},{"name":"BOZU","text":"We must use Ba Go's beauties to make furnace go boom. That will teach the futility of expecting real work from Bo Zu─the pointlessness, the fruitlessness, the futility. Yes, yes, that will teach them to let Bo Zu be Bo Zu."},{"name":"BAGO","text":"Bo Zu would make furnace go boom, hide his trickery? Ba Go cares not for the dustman's fate─no, no, cares not at all─but needs no excuse for fiery fulminations. Yes, yes, Ba Go will help you."},{"name":"BAGO","text":"Ba Go will introduce you to his most buxom beauty. Beautiful indeed she is, yes, if a bit testy─ill-tempered, irascible, testy."},{"name":"BAGO","text":"You would be wise to escort her to your destination with speed─haste, quickness, speed. Yes, yes─you will be wise, or you will be the one to go boom. Haha! Heaheaheahehahaha!"},{"name":"BAGO","text":"And your task does not end when the furnace blows its top─no, no, it has only begun. You must bring Ba Go's beauty back, bring back what remains of her─her essence, her soul, her core."},{"name":"BAGO","text":"But be forewarned─advised, cautioned, forewarned─Ba Go's beauties often have a mind of their own. Yes, yes, they do..."},{"name":"BAGO","text":"You must bring Ba Go's beauty to your destination with speed─haste, quickness, speed. Yes, yes─you will go quickly, or you will go boom. Haha! Heaheaheahehahaha!"},{"name":"BAGO","text":"But your task does not end when the furnace blows its top─no, no, it has only begun. You must bring Ba Go's beauty back, bring back what remains of her─her essence, her soul, her core. But be forewarned: she has a mind of her own. Yes, yes, she does."},{"name":"BAGO","text":"Adventurer is looking ashen─dusty, smoldery, ashen. Ba Go's beauty went boom on adventurer? Yes, yes, she did? Haha! Heahehaheaehahaha! Ba Go will give adventurer another beauty, if adventurer would make more booms. Yes, yes, more booms!"},{"name":"BAGO","text":"Adventurer returns empty-handed? Yes, yes, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does? Adventurer would suffer same fate as Bo Zu? No, no, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would not? Then adventurer should retrace <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> steps─retread, repeat, retrace─and return with Ba Go's beauty."},{"name":"BAGO","text":"Where is she? Yes, where is Ba Go's beauty?"},{"name":"BAGO","text":"Ba Go's beauty returns─yes, yes, she does. Many booms were had, yes? Many shouts, many cries, many screams?"},{"name":"BAGO","text":"And who are you again? You are who? Bo Zu's friend? Go back to Bo Zu, and tell him next time he bothers me, he will be the one to go boom. Heahehahehaehahaha!"},{"name":"BOZU","text":"The 411th's furnace is no more? Bo Zu thanks you for your aid. You are a friend to slugs and slubbers everywhere─an ally, a patron, a friend."},{"name":"BOZU","text":"Yes, yes, Bo Zu can look forward to many, many days of rest─rest and relaxation. You will linger close by, yes─stay, sojourn, linger? Today is a happy day, happy indeed!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POPMESSAGE","text":"There is a rush of heat from among the embers!"},{"name":"POPMESSAGE","text":"Your fiery trial continues!"},{"name":"BALLOON","text":"Hurrrgh!"},{"name":"SYSTEM","text":"You are not carrying the specified object. Return to the starting point and reattempt the delivery."},{"name":"SYSTEM","text":"Transport the limpet bomb to the specified location at Iron Lake before it detonates."},{"name":"SYSTEM","text":"You will have sixty seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength. Should you fail to complete the task in time, the bomb will explode and you will suffer damage."},{"name":"Q1","text":"Commence transport?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."}],"reward":{"gil":360,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":8625},"reqs":{"beastrank":1,"jobs":[{"lvl":41,"id":34}]}},"partials":[{"type":"npc","id":"1005928","obj":{"i":1005928,"n":"789th Order Dustman Bo Zu","l":350,"q":10}},{"type":"npc","id":"1005927","obj":{"i":1005927,"n":"789th Order Pickman Gi Gu","l":350,"q":9}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}