{"quest":{"name":"The Sly Salvages","location":"Outer La Noscea","id":66876,"patch":2.2,"sort":23,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005929,"target":1005929,"involved":[1005960],"genre":39,"journal":["There is a peevish avidity about Bo Gu that you recognize too well─a purpose most petty is yours to serve.","Cobalt golems stand between Bo Gu and what he feels is his rightful salvage. The insane kobold logic notwithstanding, go speak with alchemist Ga Zi of the 13th, who has ever been an accessory in crimes and misdemeanors against his own order.","The blunt-spoken alchemist finds a flaw in Bo Gu's plan, and instructs you in the finer points of destroying the golem-controlling swaystone. By dispatching four golems in the workshop near the swaystone, you can weaken it to a sufficient level.","Ga Zi's analogy of a clenched fist was apt; with the fall of each golem, the force binding together the swaystone weakens. A fist half-clenched only harms the hand. Use the small waymaker bomb and destroy the stone.","The swaystone is no more, and the golems it controlled have lost their lease on an existence never-ending─so perhaps you did them a favor as well. But of course, nobody will be as pleased by the outcome as Bo Gu, to whom you owe a courtesy report.","The craftsman is indeed pleased, and salivates over the coming pillage. A seasoned adventurer once told you that in this life, you would serve the mediocre more than you would the great, but that with luck, some of the mediocre would prove diverting. How lucky you are to be at the behest of Bo Gu and the 789th."],"objectives":["Speak with 13th Order Alchemist Ga Zi.","Dispatch cobalt golems near the swaystone in the 13th Order workshop.","Use the waymaker bomb on the swaystone.","Report to 789th Order Craftsman Bo Gu."],"dialogue":[{"name":"BOGU","text":"Adventurer, oh, adventurer! We have been most ill used! I was recovering supplies from the 13th Order workshop─retrieving, salvaging, recovering─and I was attacked by cobalt golems!"},{"name":"BOGU","text":"After the recent trouble, those supplies are wasted on the 13th, yes, yes. But the golems are too powerful, oh–so–unkillable─never subdued, ever–regenerating, oh–so–unkillable. Bo Gu fought valiantly but he was forced to withdraw!"},{"name":"BOGU","text":"The adventurer can handle a golem or two, yes? Yes, yes. Maybe even two and some─more, several, and some! Go to the 13th Order workshop and smash the swaystone─that interfering rock must be blown to bits!"},{"name":"BOGU","text":"The stone holds sway over the golems, the golems are its to command. Destroy the stone with this wee waymaker, and any fallen golem shall stay down!"},{"name":"BOGU","text":"The 13th has Ga Zi posted as sentry, he'll not bar our way, no, no. Ga Zi will allow the adventurer to make free with the workshop!"},{"name":"BOGU","text":"What will happen to the supplies without our welly-well meddling? I shudder to think of the scavengers─marauders, filchers, scavengers! The adventurer must brave the 13th Order workshop and smash the swaystone!"},{"name":"GAJI","text":"Yunz here to make trouble for Zo Ga? That's what I's like to hear, uh-huh, uh-huh. The swaystone, though─that's tough to bugger up. Won't get nowhere up its crack, yunz won't, not with that piddly bomb."},{"name":"GAJI","text":"Those stones, they's always clenched, yunz get that? That's how to <span class=\"emphasis\">hold</span> sway over something, golems or kobolds, uh-huh, uh-huh. Yunz got to pry it open first. Beating on its golems'll do that."},{"name":"GAJI","text":"Yunz take out a few golems, slip that bomb in when the stone's roughed up but good─moused up, weakened, roughed up, that sort of thing."},{"name":"GAJI","text":"A swaystone needs softening up before yunz can bugger it up, yunz won't do much with the waymaker otherwise, nuh-uh, nuh-uh. Beat on the golems but good, that'll loosen up that rock, yunz listening?"},{"name":"GAJI","text":"So what I's saying is, yunz take out a few golems and slip that bomb in when the stone's roughed up but good, and bwom!─'splosion, fire in the hole, bwom, that sort of thing."},{"name":"BOGU","text":"I smell gunpowder stink, I see smears of slickens...my senses are keen, yes, yes! Does this mean the adventurer has shattered the swaystone?"},{"name":"BOGU","text":"Happy, happy news! The stone gone, the golems so–very–killable! The 13th Order's supply can be salvaged now─saved, rescued, salvaged!"},{"name":"SCENE00023","text":"Enter the 13th Order workshop?"},{"name":"SCENE00023","text":"Yes"},{"name":"SCENE00023","text":"No"},{"name":"POPMESSAGE","text":"You feel a stony gaze fixed upon you!"},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"SYSTEM","text":"The swaystone is not sufficiently weakened. Dispatch more cobalt golems to ready the stone for the waymaker bomb."}],"reward":{"gil":540,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":2,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005929","obj":{"i":1005929,"n":"789th Order Craftsman Bo Gu","l":350,"q":10}},{"type":"npc","id":"1005960","obj":{"i":1005960,"n":"13th Order Alchemist Ga Zi","l":350,"q":7}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}