{"quest":{"name":"Contents Unknown","location":"Outer La Noscea","id":66878,"patch":2.2,"sort":25,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005929,"target":1005929,"involved":[1005960],"genre":39,"journal":["Greed and envy go together like canker and mange, and Bo Gu has a mind to scratch both itches with a little help from his friends.","Zo Ga's trusted watchmen have hidden beguiling objects in the 13th Order workshop, and Bo Gu feels his quarters are much the better place for the mystery treasure. Let Ga Zi guide you to the workshop so that you may seize the contents of the fugleman's silverpots.","The silverpots prove to contain an enigma wrapped in a riddle. Whatever it is you found inside, you cannot dally, for surely the 13th Order is home to kobolds who do not share Ga Zi's inclination to bugger up the place. Deliver the contents of the silverpots to Bo Gu.","Bo Gu receives the contents of the silverpots with much interest and very little comprehension. He is well pleased however, for envy is his great work and greed a mere diversion. If the stolen items bring him no profit, he is still a happy kobold for having deprived Zo Ga of what he values."],"objectives":["Overcome any and all obstacles to acquire the contents of the 13th Order silverpots.","Deliver the contents of the silverpots to Bo Gu."],"dialogue":[{"name":"BOGU","text":"Shiny things they have in the 13th Order Dig, nice things they hide from the rest of us. Surely this is not right, no, no."},{"name":"BOGU","text":"There are watchmen in the 13th Order, Zo Ga's favorites, much loved by the fugleman, yes, yes. These watchmen have hidden pretty things in the workshop─alluring, inviting, pretty!"},{"name":"BOGU","text":"Silverpots they are, absolutely oozing with worth and gorgeousness. And watchmen conceal them, how suspicious and ungenerous! The adventurer must seize their contents, and teach Zo Ga a lesson, yes, yes!"},{"name":"BOGU","text":"13th Order Alchemist Ga Zi will guide you. Yes, yes, Ga Zi was the one who saw the silverpots."},{"name":"BOGU","text":"Zo Ga and his watchmen have silverpots hidden in the 13th Order workshop, treasures they would conceal from Bo Gu and his deserving comrades! The adventurer will bring away the silverpots─spirit, whisk, bring them away!"},{"name":"BOGU","text":"Adventurer, oh, adventurer! Did you find shiny things? Yes, are the precious silverpots' contents in our hands?"},{"name":"BOGU","text":"Hem and haw, haw and hem. This is alchemical, yes, yes. But beyond that? Bo Gu is knowledgeable, but not an expert in alchemy, no, no."},{"name":"BOGU","text":"What exactly this is, I do not know. What is it worth? Worth hiding─stashing, secreting, hiding! So, worth a lot, yes, yes."},{"name":"BOGU","text":"Nobody likes to miss such a thing─the loss of these mystery packets they will bemoan. Anything that vexes Zo Ga gladdens us─elates, heartens, gladdens!"},{"name":"SCENE00021","text":"Enter the 13th Order workshop?"},{"name":"SCENE00021","text":"Yes"},{"name":"SCENE00021","text":"No"},{"name":"POPMESSAGE","text":"You feel a watchful gaze─and murderous intent!"},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"BALLOON","text":"This area is forbidden to outsiders, yes, yes!"},{"name":"BALLOON","text":"Intruder─interloper, trespasser, intruder!"},{"name":"BALLOON","text":"Stop right there─halt, stay, stop!"},{"name":"GAJI","text":"Yunz got designs on the 13th's workshop? Bo Gu thinks there's a treasure in those silverpots I spotted─gems, exotic poisons, treasure, that sort of thing. Go and bugger up the place good now."}],"reward":{"gil":540,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":2,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005929","obj":{"i":1005929,"n":"789th Order Craftsman Bo Gu","l":350,"q":10}},{"type":"npc","id":"1005960","obj":{"i":1005960,"n":"13th Order Alchemist Ga Zi","l":350,"q":7}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}