{"quest":{"name":"Armed and Dangerous","location":"Outer La Noscea","id":66873,"patch":2.2,"sort":21,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005929,"target":1005929,"involved":[1005932],"genre":39,"journal":["In a different life, Bo Gu may well have made a mediocre manager rather than a terrible craftsman. This day, the kobold is looking for a subcontractor for some dismemberment work.","Bo Gu has promises to keep, but a gouty knee─or two─keeps him from them. Surely an aching joint can be salved with a little joint venture, if you would care to speak to 789th Order Acolyte Ba Go.","You have spoken with the acolyte, and heard slightly more than you could bear. But an adventurer must go where there is a need, and the mad bombcrafter needs you to take the coal to the brazier at Iron Lake. The bonfire will draw warm grenades, then light their slaughter. When the hot grenade appears, slay it and lop off its arm.","You have acquired the arm of a hot grenade. By the lurid light of the fire are many strange deeds done. Take the unpleasant package to Ba Go at the 789th Order Dig.","Ba Go is much pleased, and so are you, for you successfully avoided any talk of what he plans to do with the arm. As difficult as it is not to imagine what the mention of “limb that goes boom” might presage, put a spring in your step and report to Bo Gu.","After enjoying a brief holiday as an upset stomach, Bo Gu's gout returns with a vengeance. The shellfish–y story notwithstanding, the kobold is proving to be a reliable customer."],"objectives":["Speak with 789th Order Acolyte Ba Go.","Use the smoky coal to light a brazier and defeat the voidsent. Slay the hot grenade that appears and acquire its arm.","Deliver the hot grenade arm to 789th Order Acolyte Ba Go.","Report to 789th Order Craftsman Bo Gu."],"dialogue":[{"name":"BOGU","text":"Bo Gu's bad knee is hurting so─aching, throbbing, hurting. Bo Gu cannot go hither and thither <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">today</span></span>, no inclination have I to move an ilm, no!"},{"name":"BOGU","text":"This causes a problem, a problem we must solve, yes. 789th Order Acolyte Ba Go was promised help, I swore to do a service for him. The adventurer will not let Ba Go and Bo Gu down? No, the adventurer will not!"},{"name":"BOGU","text":"Bo Gu's poor elbow, the gout─what? The adventurer is unkind, all knees are elbows for the children of Titan! A good job you must do for the acolyte now, to make up for questioning my honesty─improbity, mendacity, honesty!"},{"name":"BOGU","text":"The adventurer must do for Acolyte Ba Go what Bo Gu cannot, yes, yes! We must protect my poor, gouty joints lest they burst like rotten fruit─plorp, splat, burst!"},{"name":"BAGO","text":"Ba Go knew someone would be shirking─dodging, malingering, shirking, Ba Go knows everything. Yes, yes, Ba Go has special powers. Haha! Heehea!"},{"name":"BAGO","text":"Ba Go had a dream, a sweet dream about limbs that go boom. Ba Go wants an arm of a hot grenade. The grenades don't like Ba Go, though, they are scared of Ba Go's experiments─affrighted, daunted, scared..."},{"name":"BAGO","text":"So Ba Go made a brazier out of castoffs. Ba Go knows how it feels to be used and discarded─a friend he is to cast-offs, haha! And this brazier you will light while Ba Go waits right here."},{"name":"BAGO","text":"Use this live coal on the steel brazier at Iron Lake, yes, yes. To Iron Lake you will go to make a bonfire, and draw the warm grenades. Haha! Heeheahhahaha!"},{"name":"BAGO","text":"Now the pretty part, yes, yes. You'll slay the warm grenades in a blistering fray, make a nice hot zone for the hot grenade. When it comes, lop off its arm, its arm I must have, yes, yes. Why are hot grenades drawn to a hot mess? Why do the Qiqirn suck eggs?"},{"name":"BAGO","text":"A steel brazier at Iron Lake, you must light it with this bit of smoldering coal, yes, yes. The bonfire will draw cranky warm grenades, make things hot and red─crimson, bloody, red..."},{"name":"BAGO","text":"It's the hot grenade Ba Go wants, the hot grenade will come when the mayhem's primed. Do you want to die in a fire? No, no? Then don't ask nicely, just cut off its arm─chop, slice, cut!"},{"name":"BAGO","text":"Does Ba Go have long to wait? Is the hot grenade arm coming soon? Haha! Heeheahhahaha!"},{"name":"BAGO","text":"An arm of the hot grenade, a limb that goes boom, yes, yes. Heeheahhaha, you're not scared of Ba Go and his lovelies, are you? Bo Gu is, though, Ba Go can tell. The craftsman knows that Ba Go has funny dreams about him..."},{"name":"BOGU","text":"We helped the acolyte, our promise is kept, yes, yes. And the adventurer is unscathed─unsinged, conscious, unscathed! If only Bo Gu hadn't eaten that bad shrimp, and been able to fetch the arm himself!"},{"name":"BOGU","text":"Eh? Ignorant adventurer! Shrimp causes gout, everybody knows, yes, yes. Dangerous, nasty things they are, and I work hard to keep them out of others' reach. Now Bo Gu must bid you farewell, the <span class=\"alternative-container\"><span class=\"alternative\">dinner</span><span class=\"alternative\">breakfast</span><span class=\"alternative\">lunch</span></span> gong will sound, and there is precious little food to go around!"},{"name":"POPMESSAGE","text":"It's getting warmer!"},{"name":"BALLOON","text":"Ghllgh-ghllgh-ghllgh..."},{"name":"BALLOON","text":"Ghllgh-ghlllggh! Ghlllggh...ghllllgggh!"},{"name":"POPMESSAGE","text":"Your fiery trial continues!"}],"reward":{"gil":540,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":2,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005929","obj":{"i":1005929,"n":"789th Order Craftsman Bo Gu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}