{"quest":{"name":"Belles of the Ball","location":"Outer La Noscea","id":66877,"patch":2.2,"sort":24,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005929,"target":1005929,"involved":[1005932,1005960],"genre":39,"journal":["The world may know 789th Order Craftsman Bo Gu as a lazy bag of bones, but you know the truth: few are as industrious when it comes to foiling a hated rival's plans.","Intent on frustrating the ambitious Zo Ga, 789th Order Craftsman Bo Gu has concocted a plot to halt the planned upgrades to the 13th Order's prototype furnace. Since the plot is of a flammable nature─as is Bo Gu's wont─you will need to consult the bombsmith Ba Go on the best way to incinerate Zo Ga's wain full of upgrade parts.","Ba Go is as helpful as he is raving mad─that is to say, exceedingly so. The first thing is to mark the wain with bright coal. The alchemist Ga Zi will serve as your guide into the 13th Order workshop.","The alchemy wain looks quite festive with the bright coal, though not quite the fair figure of Ba Go's fevered imaginings. Release the advanced smart bombs from a safe location nearby, and let the fireworks begin.","The wain and its contents are thoroughly crisped; whatever Ba Go lacks in sanity, he makes up for in his knowledge of explosives. If you do not wish to share the wain's fate, obey the Acolyte's wishes and find the bomb core among the embers, subduing the still-active bomb.","The advanced smart bomb is no more. You are the proud guardian of a smart bomb core, and it <span class=\"emphasis\">is</span> a beauty. You are beginning to understand something of what Ba Go sees in these things. Suppress a momentary pang and hand over the core to Ba Go.","In Ba Go's twitchy-yet-capable hands, the core will be reborn as a brand-new bomb. Your part in this glorious cycle of life complete, return to the 789th Order Dig and make your report to Bo Gu.","With the wain full of parts up in smoke, Zo Ga will not be upgrading his furnace for some time. Bo Gu is overjoyed at the success of the plot, and looks at you with new respect─or something that passes for it among his ilk."],"objectives":["Speak with the 789th Order Acolyte Ba Go.","Place bright coal on the alchemy wain in the 13th Order workshop.","Release the advanced smart bombs from a safe location.","Overcome any and all obstacles to rummage through the embers and retrieve an advanced smart bomb core.","Hand the advanced smart bomb core to 789th Order Acolyte Ba Go.","Report to 789th Order Craftsman Bo Gu."],"dialogue":[{"name":"BOGU","text":"That Zo Ga is at it again! Upgrading the prototype furnace I heard, yes, upgrading─tweaking, improving, upgrading. A nice day I was having, a warm worm of a day it was, and now it's gone sour─tart, curdled, sour!"},{"name":"BOGU","text":"Oh, this is absolutely intolerable, unbearable to the honor of Bo Gu and his comrades. Zo Ga boasts he has forgotten more about efficiency than other orders remember, yes, yes! The braggart admits he is senile─past it, gaga, senile!"},{"name":"BOGU","text":"Doddering Zo Ga's advantage is most unfair─unjust, unmerited, unfair! The adventurer must correct this rank inequity in the most expedient way, by blowing the 13th's alchemy wain sky-high!"},{"name":"BOGU","text":"Such a course is expedient and wise, for a certain someone cannot go long without a good kabloom, no, no. The adventurer will seek the help of 789th Order Acolyte Ba Go, Ba Go will assist and sate his appetite for destruction, yes, yes."},{"name":"BOGU","text":"789th Order Acolyte Ba Go will help, Ba Go enjoys blowing things sky-high, yes, yes. Perhaps too much─excessive, inordinate, too much...but the adventurer will make no mention of this, no, no!"},{"name":"BAGO","text":"Bo Gu sent you, yes? Bo Gu is afraid Ba Go will have one of his little spells soon. An alchemy wain, you say? Which beauties will dance in that ball, Ba Go wonders─muses, mulls, wonders. Aha! The smart bombs, the advanced smart bombs! Haha! Heeheahhahaha!"},{"name":"BAGO","text":"Three bright coals to mark the wain, make a handsome prince of the unlovely drudge. Ba Go's little beauties will rush to him, plant on him their fiery kisses─frenzied, ardent, fiery. Haha! Heeheahhahaha!"},{"name":"BAGO","text":"You'll check the embers afterwards, though the beauties will be angry─fuming, seething, angry. A bomb core you must retrieve─Ba Go will not have his beauties seen in dishabille, no, no."},{"name":"BAGO","text":"You want to get into the 13th Order workshop, sneak in without cutting and flaying? Ga Zi will let you in, yes, yes. He has his reasons, does Ga Zi. Haha! Heeheahha!"},{"name":"BAGO","text":"Take the smart bombs to the ball, yes, yes. Only one dance though, then you must go among the embers and bring home a bomb core. She will pout, for too long has she stayed home, but you know what to do with wayward beauties...haha!"},{"name":"BAGO","text":"Did my beauties enjoy the ball? Did the prince dance with them? Did he burn─blackening, twisting? I smell screams. Heeheahhahaha!"},{"name":"BAGO","text":"Look at her, a babe in arms again. Ba Go will take good care of his beauty, nurse and bathe and feed her he will. Make new beauty of her─fresh, terrible, new!"},{"name":"BAGO","text":"Good of you to escort my beauty home, yes, yes. You are wanted by Craftsman Bo Gu, your report he will want to hear. Much kaboom there was. Heeheahhaha!"},{"name":"BOGU","text":"Just deserts, deserved and delivered! May Zo Ga singe his arse on what's left of the wain, yes, yes! "},{"name":"BOGU","text":"The adventurer is a friend to the 789th, the right kind of diligence and disregard for others' property has <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>. Together we shall go far─the distance, all the way, far. This I must think deeply on, yes, yes."},{"name":"SCENE00018","text":"Enter the 13th Order workshop?"},{"name":"SCENE00018","text":"Yes"},{"name":"SCENE00018","text":"No"},{"name":"SCENE00030","text":"Enter the 13th Order workshop?"},{"name":"SCENE00030","text":"Yes"},{"name":"SCENE00030","text":"No"},{"name":"SCENE00060","text":"Enter the 13th Order workshop?"},{"name":"SCENE00060","text":"Yes"},{"name":"SCENE00060","text":"No"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POPMESSAGE","text":"The embers are suddenly alive with danger!"},{"name":"KOBOLD01341","text":"(-13th Order Watchman-)This is Zo Ga's workshop, you ain't Zo Ga, no, no. So it follows, someone who ain't Zo Ga's got no business here!"},{"name":"KOBOLD01341","text":"(-13th Order Watchman-)Here now, where did you come from anyway? Seems to me this is an inside job─black treachery, dissension in the ranks, an inside job!"},{"name":"KOBOLD01341","text":"(-13th Order Watchman-)Intruder, yes, yes! None who breach the 13th Order Dig shall live to tell, no, no!"},{"name":"BALLOON","text":"Our alchemy wain! You'll die for this─drop, croak, die!"},{"name":"BALLOON","text":"Ghllllllgggh!"},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"GAJI","text":"Yunz want to muck up the 13th's workshop? Can hardly say no, seeing as how I's done my share of gumming up the works there. Go on through, yunz got to do what yunz got to do, uh-huh, uh-huh."}],"reward":{"gil":540,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":2,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005929","obj":{"i":1005929,"n":"789th Order Craftsman Bo Gu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"npc","id":"1005960","obj":{"i":1005960,"n":"13th Order Alchemist Ga Zi","l":350,"q":7}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}