{"quest":{"name":"The Lode Warrior","location":"Outer La Noscea","id":66872,"patch":2.2,"sort":27,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005929,"target":1005929,"genre":39,"usedItems":[7797],"journal":["Just because 789th Order Craftsman Bo Gu can't be bothered to mine a vein does not mean someone else can, no, no!","There is a pickman of rare talent in the 59th Order Dig, and 789th Order Craftsman Bo Gu would like him dead for the sin of success─his own as well as that of his associate, 13th Order Fugleman Zo Ga. Oblige him by completing the FATE “The Miner in the Mirror” and presenting the resulting proof of your deed to Bo Gu.","You deliver the Titan mythrilshield to Bo Gu, though in truth, the craftsman need not have suspected you of reticence. The now-dead pickman was hardly the maestro of the mines that Bo Gu made him out to be, and was a nasty piece of work you were happy to put six fulms under."],"objectives":["Deliver the Titan mythrilshield obtained in the FATE “The Miner in the Mirror” to Bo Gu."],"dialogue":[{"name":"BOGU","text":"Zo Ga do I hate, yes, yes, that Zo Ga is truly worthy of my loathing. It is unfair─inequitable, deranged, unfair─that he should have so much gil for all that work he does. Ugh!"},{"name":"BOGU","text":"Now I hear he has recruited a pickman of note─renown, respect, note! This Be Ze is not like miners of our dear 789th, no. This one has struck vein after vein of soft and shiny gold! Gold is his gift, yes, yes."},{"name":"BOGU","text":"They say he'll not work for just any fugleman. They say he serves only kobolds of great acumen. Well, <span class=\"emphasis\">they</span> can go sup on hot candle wax and die in the privy! With this master pickman serving him, Zo Ga will prosper─flourish, thrive, prosper!"},{"name":"BOGU","text":"We cannot allow this, no, no. But lucky for us, a dead master has no gifts! No difference between clever dead and dafty dead, except it vexes more to lose a good thing. Yes, Zo Ga will be vexed─chagrined, annoyed, vexed!"},{"name":"BOGU","text":"The adventurer is not convinced, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is not persuaded to this cause. Will the adventurer take the gil but not do the deed? A proof, yes, yes, a proof you shall bring!"},{"name":"BOGU","text":"Loathsome Zo Ga paid Be Ze a healthy sum─yes, yes, one Titan mythrilshield─when the pesky pickman joined his dig, a gift he gave him for the seams he would find. The adventurer will bring this coin─perhaps covered in innocent ichor?"},{"name":"BOGU","text":"The adventurer returns from the slaughter, from the killing <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is coming! Does <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> bring a token─sign, proof, token?"},{"name":"BOGU","text":"The proof, yes, yes! As good as your word you have been, yes, you are to be trusted with murders most foul! Perhaps even Zo Ga himself someday..."},{"name":"BOGU","text":"Horrible, he is, that Zo Ga! Burrows in the richest seams like a tick at a teat, and won't share with us who come late and do no work!"},{"name":"BOGU","text":"But the adventurer has given me some food for thought...food, yummy food. Everything Zo Ga has can go splat or boom, smooth or chunky. There is much hope, yes, yes, Zo Ga has much cause for concern!"}],"reward":{"gil":540,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":2,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005929","obj":{"i":1005929,"n":"789th Order Craftsman Bo Gu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"7797","obj":{"i":7797,"n":"Titan Mythrilshield","l":1,"c":26261,"t":61}}]}