{"quest":{"name":"Ambushing the Assessors","location":"Outer La Noscea","id":66871,"patch":2.2,"sort":20,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005929,"target":1005929,"genre":39,"journal":["Nothing ever goes smoothly at the 789th Order Dig, and Craftsman Bo Gu knows exactly whom you have to kill to keep it that way.","Watchmen of the 271st Order are due at the 789th Order Dig for an inspection, a mission Bo Gu feels is fundamentally incompatible with the dig's dedication to sloth and slapdashery. Derail the inspection using a bang toss at three locations at Iron Lake, then dispatch the watchmen so that they never inspect so much as a nailhead again.","You have relieved a sufficient number of watchmen from their duties and successfully prevented significant improvements to the dig's productivity and safety. Report the happy news to 789th Order Craftsman Bo Gu.","The shiftless craftsman is delighted by the outcome, and plans to resort to murder for the next inspection as well. Accept it as high praise of your effectiveness, and know that you have served a client well today."],"objectives":["Use the bang tosses on target points at Iron Lake, then dispatch at least three 271st Order watchmen.","Report to 789th Order Craftsman Bo Gu."],"dialogue":[{"name":"BOGU","text":"Adventurer, oh, adventurer, we are in trouble, yes, trouble─a pickle, a mess, trouble! Inspectors from the 271st Order are coming to see that all is well with this dig."},{"name":"BOGU","text":"Pointless it is to turn diligent now, yes, yes. But the adventurer can distract the inspectors, make them too busy being dead to pry into our business!"},{"name":"BOGU","text":"Bo Gu has been thinking in between breaks and lunches─plotting, scheming, thinking! This bang toss of Bo Gu's own making, the adventurer will toss as the skulking inspectors pass near─sniffing, prying, skulking!"},{"name":"BOGU","text":"After the toss comes a bang, yes, yes! The inspectors will come running, the running inspectors will come! Then, confusion─havoc, tumult, confusion! A quick slice and dice, and no more inspection!"},{"name":"BOGU","text":"Adventurer will set off the bang toss! When the inspectors come running, ambush them, yes, yes! Much ambush will there be, of those who dare come to look and see!  "},{"name":"BOGU","text":"Oh, the adventurer knows the art of the kill─slice, dice, kill! Bo Gu should not have worried, no. Inspectors deserve to die again for making Bo Gu's nights sleepless!"},{"name":"BOGU","text":"How welly-well that went─clean, smooth, welly-well. Much better than putting nose to grindstone or cooking the books. Bo Gu feels much better about the next inspection! We will kill again, yes, yes!"},{"name":"POPMESSAGE","text":"The quarry is near!"},{"name":"POPMESSAGE","text":"The inspection still continues!"},{"name":"BALLOON","text":"Who's setting off bombs on company time? Who!?"},{"name":"BALLOON","text":"This is highly irregular!"},{"name":"BALLOON","text":"What's the meaning of this─the gist, intent, meaning!?"}],"reward":{"gil":540,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":2,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005929","obj":{"i":1005929,"n":"789th Order Craftsman Bo Gu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}