{"quest":{"name":"Still Waters","location":"The Rising Stones","id":66881,"patch":2.2,"sort":20,"icon":100219,"eventIcon":71201,"target":1008597,"involved":[1002058,1008546,1008595,1008596,1008702],"genre":0,"journal":["Minfilia has a new assignment for you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Rising Stones.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You find Y'shtola preoccupied and unwilling to converse at length. Speak to Fufulupa, the Brass Blade leading the investigation, to learn more about the thefts.","Fufulupa informs you that a heavily laden carriage recently broke through a checkpoint on the Royal Allagan Sunway. Convinced that it must belong to the thieves, he bids you share this news with Y'shtola forthwith.","Though plainly unconvinced by Fufulupa's assertion that the incident at the checkpoint and the crystal thefts are connected, Y'shtola cannot wholly discount the possibility. Accordingly, she bids you rendezvous with Thancred in eastern Thanalan, where the carriage was said to be headed.","Thancred reports that the carriage was filled with somnus, not crystals, and that the coachman appears to have no ties to the crystal thieves. Although the Brass Blades are more than satisfied with the seizure, Y'shtola will likely not be so pleased. Return to Horizon and see what other information Thancred has to offer.","According to Thancred, there is nothing to suggest that the Amalj'aa have come into possession of significant quantities of crystals. As he communicates his findings to Urianger via linkpearl, you cannot help but wonder who is behind the crystal thefts, and what their designs might be."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Rising Stones.</span>"],"dialogue":[{"name":"MINFILIA","text":"Truly, there is no rest for the weary. Scarce had I begun to make myself at home when I received a request for assistance from Amajina & Sons Mineral Concern."},{"name":"MINFILIA","text":"It would appear their storehouse in Horizon has been the target of a series of covert robberies."},{"name":"MINFILIA","text":"Minor as they seemed in isolation, occasional discrepancies in the manifests were long dismissed as clerical errors. It was only during the Concern's annual audit that a pattern became apparent..."},{"name":"MINFILIA","text":"Significant quantities of crystals─and only crystals─were missing."},{"name":"MINFILIA","text":"I need hardly tell you what that may imply."},{"name":"MINFILIA","text":"The Brass Blades charged with investigating the thefts believe that someone within the Concern is selling the crystals for profit. Alas, they have as yet been unable to identify a likely suspect, and the Concern's proprietors have grown frustrated by their lack of progress."},{"name":"MINFILIA","text":"Needless to say, I would not have agreed to intervene had the stolen goods been of merely monetary value. If there is even a possibility that the thief acts not out of self-interest but in service to a primal, we can ill afford to wait for the Blades to realize their mistake."},{"name":"MINFILIA","text":"Pray depart for Horizon at your earliest convenience."},{"name":"MINFILIA","text":"Rendezvous with Y'shtola when you arrive. She and Thancred have already begun a preliminary investigation."},{"name":"MINFILIA","text":"I have every confidence that the three of you will get to the bottom of these thefts. I only hope our fears prove unfounded when you do."},{"name":"MINFILIA","text":"When you arrive in Horizon, be sure to speak with Y'shtola. She will inform you as to the latest developments. For my part, I shall continue to speak with the Concern's representatives. They may have additional information which could be of use."},{"name":"YSHTOLA","text":"Ah, <span class=\"highlight\">Forename</span>. Your assistance is most welcome."},{"name":"YSHTOLA","text":"I have already spoken at length with the Brass Blades of the Rose─albeit to little avail. It would seem that the thieves took great pains to conceal their activities."},{"name":"YSHTOLA","text":"I could go into further detail, but your time might better be spent in conversation with Fufulupa. He is the officer charged with leading the investigation, and I would only be repeating that which he related to me. If aught eluded my attention, mayhap it will not elude yours."},{"name":"YSHTOLA","text":"We shall speak anon, <span class=\"highlight\">Forename</span>. I have a number of theories which I must needs consider further."},{"name":"FUFULUPA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Oh, hello there! <span class=\"highlight\">Forename</span>, was it?</span><span class=\"alternative\"><span class=\"highlight\">Forename</span>! What a pleasure to see you again.</span></span> Y'shtola said to expect you."},{"name":"FUFULUPA","text":"Terrible business, these thefts. We have yet to confirm the quantity of crystals stolen, but I daresay it may be greater than─"},{"name":"FUFULUPA","text":"Ah, but never mind that! I have news to share! A short while ago, the driver of a heavily laden carriage refused to halt for inspection and broke through one of our checkpoints on the Royal Allagan Sunway."},{"name":"FUFULUPA","text":"Alas, my colleagues had no mounts with which to give chase. However, our scouts have reported seeing a cart of the same description bound for eastern Thanalan. These could be our thieves, don't you think!? We must inform Y'shtola at once!"},{"name":"YSHTOLA","text":"...A speeding carriage? That would seem a curious choice for thieves of such proven cunning."},{"name":"YSHTOLA","text":"...Yet the Amalj'aa do have a foothold in eastern Thanalan. Hmmm."},{"name":"YSHTOLA","text":"Thancred is already afield with a unit of Brass Blades. I shall instruct him to take up a position to the east of the beastmen's encampment. Pray join him there."},{"name":"YSHTOLA","text":"Pray do not tarry, <span class=\"highlight\">Forename</span>. Should violence erupt, Thancred may require your assistance."},{"name":"THANCRED","text":"Ah, <span class=\"highlight\">Forename</span>. For once it is <span class=\"emphasis\">you</span> who is fashionably late. We seized the errant carriage and its excitable coachman not long ago."},{"name":"THANCRED","text":"In all my years, I have never seen such a prodigious quantity of somnus. The Blades were calling it one of the greatest─"},{"name":"THANCRED","text":"...Hm? Ah, sadly not. The coachman had no hand in the crystal thefts─and judging by my survey of their encampment, neither did the Amalj'aa. But let's discuss this in Y'shtola's presence, shall we? I'll see you back in Horizon."},{"name":"YSHTOLA","text":"...And so we find ourselves back where we began. &lt;sigh&gt; What have I overlooked...?"},{"name":"THANCRED","text":"Against all expectation, it would seem the Amalj'aa are innocent of this particular spate of crimes. By all indications, they have yet to replenish the stores of crystals exhausted during their last attempt to summon Ifrit."},{"name":"THANCRED","text":"What I can't fathom is why anyone <span class=\"emphasis\">else</span> would go to such lengths to obtain crystals─and in such quantities."},{"name":"THANCRED","text":"It cannot be that we are dealing with simple thieves. If their motive were profit, why would they limit their trade to crystals alone...? Plainly, we are missing something."},{"name":"THANCRED","text":"While you think about what it might be, I shall inform Urianger of our progress─or lack thereof."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66729]}},"partials":[{"type":"npc","id":"1008597","obj":{"i":1008597,"n":"Thancred","l":42,"q":4}},{"type":"npc","id":"1002058","obj":{"i":1002058,"n":"Fufulupa","l":42,"q":9}},{"type":"npc","id":"1008546","obj":{"i":1008546,"n":"Minfilia","l":481,"q":1}},{"type":"npc","id":"1008595","obj":{"i":1008595,"n":"Y'shtola","l":42,"q":1}},{"type":"npc","id":"1008596","obj":{"i":1008596,"n":"Thancred","l":44,"q":1}},{"type":"npc","id":"1008702","obj":{"i":1008702,"n":"Y'shtola","l":42,"q":2}},{"type":"quest","id":"66729","obj":{"i":66729,"n":"Build on the Stone","g":0,"l":"The Waking Sands","s":19}}]}