{"quest":{"name":"Yugiri's Game","location":"Western Thanalan","id":66886,"patch":2.2,"sort":25,"icon":100221,"eventIcon":71201,"target":1008626,"involved":[1008628,1008635,1008636,1008637],"genre":0,"journal":["Hozan has another favor to ask of you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Quicksand.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Hozan is proud of his son, and with good reason: Yozan has already instructed the other children to make their preparations. The only ones who have yet to be located are a trio who were engaged in a game of hide-and-seek. It would seem that the children are very serious when it comes to the game, and will not move from their hiding spots unless found, leaving you with no choice but to find them yourself.","Despite their dedication to the game, the three remaining children were not particularly good at it. Inform Hozan that your work is finished.","You learn that Yugiri is responsible for the children's regular practice of hide-and-seek, as she deemed it necessary to ensure their survival in the event of an imperial attack. Many would consider it a valuable skill, to be sure─albeit one Hozan hopes the children never need to use."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Quicksand.</span>"],"dialogue":[{"name":"HOUZAN","text":"While you were seeing to that crate, the other members of my group finished preparing their belongings for shipment. Once all of the carriages arrive, we can begin loading."},{"name":"HOUZAN","text":"Oh, but you needn't concern yourself with that! We can manage with the coachmen's help."},{"name":"HOUZAN","text":"Rather, I would like you to help round up the children that have been given into my care. My son Yozan can tell you more."},{"name":"HOUZAN","text":"These have been trying times, but Yozan has handled himself well. I only wish there were more I could do for him."},{"name":"YOUZAN","text":"Oh, hello there! I'm Yozan, son of Hozan. Will you be coming with us to Ul'dah? I hear we're traveling by horsebird-drawn carriage!"},{"name":"YOUZAN","text":"But...don't you think they're <span class=\"emphasis\">queer</span>? Giant birds that people ride like horses? I still want to try riding one, but─"},{"name":"YOUZAN","text":"What's that? You're looking for the others? Don't worry. I already told them to get ready for the carriages."},{"name":"YOUZAN","text":"I'll need your help, though. We were just finishing a game of hide-and-seek. Three players are still in hiding, and since Lady Yugiri told us to take it <span class=\"emphasis\">really</span> seriously, they won't move until they're found. But Vesper Bay isn't that big, so I bet you can find them in no time!"},{"name":"KOHARU","text":"Hey! You're not Yozan! Who're you?"},{"name":"KOHARU","text":"(-Koharu-)I'm Koharu. <span class=\"highlight\">Forename Surname</span>, eh? I didn't know anyone else was─ Waaait a minute! You're one of those, um, Stallions, aren't you!?"},{"name":"KOHARU","text":"(-Koharu-)No─ Scions, <span class=\"emphasis\">Scions</span>! Then you must know Lady Yugiri, right? Isn't she great!? She's <span class=\"emphasis\">really</span> good at hide-and-seek, too! Oh, right─ It's almost time to go. Nice meeting you, <span class=\"highlight\">Forename Surname</span>!"},{"name":"CHILD01350A","text":"How'd you find me!? Bah! Guess I need to practice more."},{"name":"CHILD01350A","text":"Or maybe you're just good at this? I mean, the Garleans didn't find me..."},{"name":"CHILD01350B","text":"Um... Are you playing? Ahhh! No fair! Yozan didn't say anything about adults!"},{"name":"CHILD01350B","text":"Huh? We get to ride a horsebird carriage? I don't know... It sounds scary. But if Yozan says it's safe, I'll go."},{"name":"HOUZAN","text":"Wonderful! All the children are accounted─ Hide-and-seek? Ah, I see that you are curious. It is quite simple, really."},{"name":"HOUZAN","text":"Lady Yugiri thought it best that the children know what to do in case the Garleans found us."},{"name":"HOUZAN","text":"I should hope that those days are behind us, but I nevertheless take comfort in knowing that we are prepared."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66885]},"next":[66887]},"partials":[{"type":"npc","id":"1008626","obj":{"i":1008626,"n":"Hozan","l":42,"q":2}},{"type":"npc","id":"1008628","obj":{"i":1008628,"n":"Yozan","l":42,"q":1}},{"type":"npc","id":"1008635","obj":{"i":1008635,"n":"Hiding Child","l":42,"q":1}},{"type":"npc","id":"1008636","obj":{"i":1008636,"n":"Hiding Child","l":42,"q":1}},{"type":"npc","id":"1008637","obj":{"i":1008637,"n":"Hiding Child","l":42,"q":1}},{"type":"quest","id":"66885","obj":{"i":66885,"n":"A Small-scale Operation","g":0,"l":"Ul'dah","s":24}},{"type":"quest","id":"66887","obj":{"i":66887,"n":"If Wishes Were Horsebirds","g":0,"l":"Western Thanalan","s":26}}]}