{"quest":{"name":"A Final Temptation","location":"Western Thanalan","id":66882,"patch":2.2,"sort":21,"eventIcon":71201,"issuer":1008597,"target":1002058,"involved":[1008598,1008599,1008702],"genre":2,"journal":["Thancred wishes to discuss how to proceed with the investigation.","For want of a better idea, Thancred suggests consulting Fufulupa once more. Speak with the Brass Blade and find out if he has aught to offer.","Upon learning that someone within the Brass Blades' ranks may be involved in the crystal thefts, Thancred and Y'shtola devise a plan to lure the thieves into the open. Posing as a courier in possession of crystals, Y'shtola will act as bait, while you and Thancred observe from a distance. Should the thieves appear, you are to subdue them by any means necessary.","Y'shtola's ruse succeeds in drawing the thieves out into the open, but when the trap is sprung, it quickly becomes clear that they will not be taken alive. Left with no other choice, you fight till each lies dead. Report all that has occurred to Y'shtola.","Although the thieves had naught in their possession to indicate their allegiance, Thancred notes that all were Sea Wolves, and that each of them sported distinctive blue facial tattoos. This observation appears to prompt a revelation in Y'shtola, who immediately takes her leave to make inquiries. Having been placed in charge of matters in Thanalan, Thancred invites you to return with him to Horizon and report to Fufulupa.","Fufulupa informs you that the traitorous Brass Blade was identified while you were away, but that the Lominsan-born Sea Wolf subdued the unit sent to detain him and took flight. Though he assures you that his comrades will soon hunt down the fugitive, you wonder if the task might better be entrusted to one more capable. Before you can volunteer, however, Thancred is informed via linkpearl that your services are needed elsewhere."],"objectives":["Speak with Fufulupa.","Lie in wait for the thieves.","Speak with Y'shtola.","Speak with Fufulupa."],"dialogue":[{"name":"THANCRED","text":"Any bright ideas? A solitary flash of insight?"},{"name":"THANCRED","text":"...No? Well then, for want of a better suggestion, I say we try picking Fufulupa's brain again."},{"name":"THANCRED","text":"Who knows, if we work together, we may yet find something of use nestled away within it."},{"name":"YSHTOLA","text":"Mayhap a more <span class=\"emphasis\">subtle</span> approach is in order..."},{"name":"THANCRED","text":"I'm flattered that you enjoy my company so much, <span class=\"highlight\">Forename</span>, but talking to me isn't going to get us anywhere. Come, let's have a word with Fufulupa."},{"name":"FUFULUPA","text":"Oh, but it is good to see you return! I have given some thought to the matter, and I have just hit upon a most disturbing possibility! How could I have been so blind...!?"},{"name":"YSHTOLA","text":"Calm yourself, Fufulupa. What is this disturbing possibility of which you speak?"},{"name":"FUFULUPA","text":"I was contemplating as to how the thieves' activities escaped our notice for so long, and then it came to me! What if there is someone among our own ranks conspiring with them─a traitor in our own midst!?"},{"name":"THANCRED","text":"...It would be most unfortunate if your fears proved well founded, Fufulupa."},{"name":"YSHTOLA","text":"Indeed. If, for reasons of security, the Concern decided to transfer the remaining crystals stored in Horizon to another location, their plans would be discovered the moment the Brass Blades were informed."},{"name":"THANCRED","text":"Ah, but such a shipment would surely be well guarded. Would thieves as wily as ours risk open confrontation?"},{"name":"YSHTOLA","text":"Mayhap not. But neither would the Concern be eager to present them with such an obvious target. Nay, they might instead elect to carry out the transfer in <span class=\"emphasis\">secret</span>─to entrust the goods to, let us say, a lone Miqo'te miner, traveling without escort so as not to attract undue attention."},{"name":"FUFULUPA","text":"But who─ Ahhh, I <span class=\"emphasis\">see</span>! Yes, the Concern may <span class=\"emphasis\">well</span> elect to do that. But to travel with so much cargo would be a strenuous task indeed, and this miner would <span class=\"emphasis\">certainly</span> need to rest upon the way. Mayhap...north of the bridge to Hammerlea?"},{"name":"THANCRED","text":"A fine spot for a rest─would you not agree, <span class=\"highlight\">Forename</span>? <span class=\"alternative-container\"><span class=\"alternative\">...Alas, the role of the Miqo'te miner is taken, so you will lie in wait to the north, and I will do the same to the south</span><span class=\"alternative\">You lie in wait to the north, and I shall do the same to the south</span></span>."},{"name":"FUFULUPA","text":"Ahem! Forgive me, my friends, but I have received new orders! I must inform my men at once!"},{"name":"THANCRED","text":"Call me a cynic, but I would be surprised if these thieves lay down their arms and surrender. See that you come prepared to offer them some encouragement."},{"name":"THANCRED","text":"What are you doing, <span class=\"highlight\">Forename</span>!? If the thieves approach from the north, there will be no one there to stop them!"},{"name":"YSHTOLA","text":"Meanin' no offense, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─<span class=\"emphasis\">I'd sooner be left in peace</span>."},{"name":"POP","text":"Movement in the distance catches your eye..."},{"name":"BALLOON","text":"Guards!? No matter. Kill 'em all!"},{"name":"BALLOON","text":"I ain't dyin' in this godsforsaken 'ell'ole!"},{"name":"THANCRED","text":"Bumped into the thieves, did you? I don't suppose any of them are still breathing, are they? Hm. I thought not. Well, no sense keeping our miner friend waiting, then."},{"name":"YSHTOLA","text":"Stubborn to the last, as expected. You are unharmed?"},{"name":"THANCRED","text":"A gang of Sea Wolf thieves, and in Thanalan, no less. I suppose there's a first time for everything..."},{"name":"YSHTOLA","text":"Sea Wolves? All of them?"},{"name":"THANCRED","text":"Aye, and all with the same taste in facial tattoos. Blue, in case you were wondering."},{"name":"YSHTOLA","text":"...Our thieves are a long way from home."},{"name":"YSHTOLA","text":"Thancred─if you would be so good as to attend to the outstanding matters in Horizon... I have inquiries to make."},{"name":"THANCRED","text":"To Horizon, then. Fufulupa will want to hear about your meeting with the thieves."},{"name":"THANCRED","text":"This tale does not require a bard's embellishment. Simply tell Fufulupa what transpired."},{"name":"FUFULUPA","text":"On behalf of the Brass Blades of the Rose, I thank you for your service to Horizon!"},{"name":"FUFULUPA","text":"Ah, but we have not been idle! While you were afield, we succeeded in identifying the traitor within our ranks!"},{"name":"THANCRED","text":"Is that so? Then, by your leave, I should very much like to have a word with the fellow in private."},{"name":"FUFULUPA","text":"Ah...no. I am afraid that will not be possible. Regrettably, he, um...managed to subdue the unit of Blades dispatched to detain him, and made good his escape."},{"name":"THANCRED","text":"Oh, for the love of─ And how did he manage that, exactly? Your men haven't been sampling that somnus we confiscated, have they? <span class=\"emphasis\">Or was he a giant in disguise</span>?"},{"name":"FUFULUPA","text":"N-No...but he was quite strong! A Sea Wolf─Lominsan born and raised, I believe. But do not worry─we <span class=\"emphasis\">will</span> find him, you have my word on that!"},{"name":"THANCRED","text":"I see... Pray keep me apprised of any developments."},{"name":"THANCRED","text":"Yes? ...<span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> standing next to me. ...Understood."},{"name":"THANCRED","text":"I fear our time together is at an end, my friend. Your services are required elsewhere. Awfully disappointing, I know, but one must follow where duty leads."},{"name":"THANCRED","text":"...You might try to look a <span class=\"emphasis\">little</span> disappointed! Or do you mean to give me another one of your stoic nods? You do, don't you? &lt;sigh&gt;"}],"reward":{"gil":939,"items":[{"id":6240,"one":1},{"id":6241,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69415]},"next":[66883]},"partials":[{"type":"npc","id":"1008597","obj":{"i":1008597,"n":"Thancred","l":42,"q":4}},{"type":"npc","id":"1002058","obj":{"i":1002058,"n":"Fufulupa","l":42,"q":9}},{"type":"npc","id":"1008598","obj":{"i":1008598,"n":"Y'shtola","l":42,"q":1}},{"type":"npc","id":"1008599","obj":{"i":1008599,"n":"Thancred","l":42,"q":1}},{"type":"npc","id":"1008702","obj":{"i":1008702,"n":"Y'shtola","l":42,"q":2}},{"type":"item","id":"6240","obj":{"i":6240,"n":"Hero's Earrings of Casting","l":90,"c":55297,"t":41}},{"type":"item","id":"6241","obj":{"i":6241,"n":"Hero's Earrings of Healing","l":90,"c":55297,"t":41}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69415","obj":{"i":69415,"n":"Still Waters","g":2,"l":"The Rising Stones","s":20}},{"type":"quest","id":"66883","obj":{"i":66883,"n":"The Mother of Exiles","g":2,"l":"Western Thanalan","s":22}}]}