{"quest":{"name":"If Wishes Were Horsebirds","location":"Western Thanalan","id":66887,"patch":2.2,"sort":26,"eventIcon":71201,"target":1008639,"involved":[1004096,1008611,1008632,1008638],"genre":0,"journal":["Hozan requires your assistance with another personal matter.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Hozan in Vesper Bay.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Folclind has taken to eschewing carriages entirely, and thus cannot offer a foolproof solution. What she <span class=\"emphasis\">can</span> offer is a vial of peach blossom perfume, and the dubious suggestion that you douse the chocobos with it.","The nearby coachman is less than pleased with your experiment, but states that what is done is done. That being said, the efficacy of your approach is yet unknown. For the sake of Hozan's father, you must press your face against the chocobo and breathe deep of its musk.","As the pungent odor fills your sinuses─and the coachman's laughter fills your ears─you realize at once that you have made a huge mistake. After taking pleasure at your expense, the coachman advises you to try a different method─one utilized by goblins, it would seem. Press him for further information.","The coachman explains that goblins pack their masks with herbs and other fragrant compounds in order to filter the surrounding air. He then proposes a similar method utilizing a scarf and your perfume, which upon cursory inspection seems more than satisfactory. Deliver the perfumed scarf to Hozan.","Hozan is delighted with your solution and leaves at once to present the scarf to his father. Follow Hozan to the docks so that you may see if the scarf meets with his father's approval.","As his father breathes deep of the peach-scented scarf and recalls cherished memories, Hozan speaks fondly of the great orchards of Doma. However, he soon falls silent, and states that it is time to move on."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Hozan in Vesper Bay.</span>"],"dialogue":[{"name":"HOUZAN","text":"All of the carriages have arrived, but my father... &lt;sigh&gt; Stubborn to the last, he is refusing to leave."},{"name":"HOUZAN","text":"'Tis the smell of the chocobos. Many of us find it difficult to bear, but he cannot abide it."},{"name":"HOUZAN","text":"To be honest, I find it odd that I've yet to meet an Eorzean who shares our sentiments─other than the waitress at the Pissed Peiste."},{"name":"HOUZAN","text":"Hmmm... Mayhap she has a means to address the smell. Might you go and see what she knows?"},{"name":"HOUZAN","text":"Any advice you can glean would be of great value. As I said, my father is not alone in his revulsion."},{"name":"FOLCLIND","text":"The Domans are sickened by how chocobos smell? Hah, I know just how they feel! Carriage rides make me more queasy than boat rides because of that alone."},{"name":"FOLCLIND","text":"Why not try using this perfume to mask the smell? I can't promise it'll help, though. I swore off carriages ages ago. Too much vomiting."},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)Oi! What in the seven hells're ye doin' to me birds!? Dousin' 'em with gods-know-what alchemical concoctions... That ain't right!"},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)They're skittish creatures at heart! Get 'em riled up, an' they're liable to go every which way but the one ye want. Explain yerself!"},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)...Hmph. Well, what's done is done. Reckon ye'd best make sure it did the trick afore ye call the old man over, though. Get in there an' take a good, long whiff. Don't be shy now."},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)What are ye waitin' fer, an invitation? Go on an' sniff that chocobo. Make sure ye take a nice, deep breath─really suck it all in. Gotta be sure now."},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)Bwahahaha! Like some vial o' flower water'd cover up a chocobo's musk! Bless yer heart, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">son</span></span>."},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)Yer goin' 'bout this the wrong way. Rather than pourin' perfume on everythin' what offends yer olfactory senses, just do it like the gobbies do."},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)What, ye don't ken me meanin', or ye ain't never traded tongueflaps with a gobbie trader?"},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)I'm talkin' 'bout their <span class=\"emphasis\">masks</span>, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">son</span></span>. Gobbies don't care much fer the air 'round these parts, hence why they wear 'em contraptions. They pack 'em with herbs an' whatnot."},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)Here, take this scarf, splash a few drops of that there perfume on it, an' tell the old man to tie it 'round his face like so. 'Course, ye'd better hope he doesn't hate the perfume, too!"},{"name":"GYOSHA01348","text":"(-Hyuran Coachman-)It ain't a proper gobbie mask, but it's a damn sight better than nothin'."},{"name":"HOUZAN","text":"Try as I might, I cannot convince my father to board the carriage. Have you any ideas how we might deal with the chocobos' smell?"},{"name":"HOUZAN","text":"Of course, why did I not think of that? Such a simple, elegant solution."},{"name":"HOUZAN","text":"We should take this to my father at once!"},{"name":"HOUMEI","text":"&lt;sniff&gt; &lt;sniff&gt; If I close my eyes, I can remember what it was like before. &lt;sniff&gt; &lt;sniff&gt; Yes... Just like that..."},{"name":"HOUZAN","text":"'Twas happy coincidence that Folclind's perfume was made from peach blossoms. At first my father scoffed, but one sniff was enough to put his mind at ease."},{"name":"HOUZAN","text":"Oh, if only you could have seen our orchards. So vast, so vibrant. Foreign merchants clamored for our fruits, so great was our reputation."},{"name":"HOUZAN","text":"...It is past time that we move on. The carriages are waiting."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66886]}},"partials":[{"type":"npc","id":"1008639","obj":{"i":1008639,"n":"Hozan","l":42,"q":3}},{"type":"npc","id":"1004096","obj":{"i":1004096,"n":"Folclind","l":42,"q":4}},{"type":"npc","id":"1008611","obj":{"i":1008611,"n":"Chocobo","l":42,"q":1}},{"type":"npc","id":"1008632","obj":{"i":1008632,"n":"Hyuran Coachman","l":42,"q":2}},{"type":"npc","id":"1008638","obj":{"i":1008638,"n":"Homei","l":42,"q":2}},{"type":"quest","id":"66886","obj":{"i":66886,"n":"Yugiri's Game","g":0,"l":"Western Thanalan","s":25}}]}