{"quest":{"name":"All Due Respect","location":"Ul'dah","id":66889,"patch":2.2,"sort":28,"eventIcon":71201,"target":1008547,"involved":[1006530,1008656,1008657,1008658,1008659,1008660,1008661],"genre":0,"journal":["Alphinaud would have you and Yugiri depart for Revenant's Toll without delay.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Quicksand.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Slafborn warmly welcomes Yugiri to Revenant's Toll, insisting that they dispense with unnecessary formality and treat each other as equals. Having paid your respects to the guild representative, ask Yugiri if she is ready to meet with Minfilia.","Deep in thought, Yugiri requests a moment's privacy, assuring you that she will join you anon. Enter the Rising Stones and look for Minfilia in the solar.","You find Minfilia attempting to contact the Students of Baldesion via linkpearl─more, you suspect, out of habit than hope. After briefly speculating upon their fate, she changes the subject and asks about the Domans─to which you reply that Yugiri will arrive at any moment. In the subsequent meeting, Minfilia assures Yugiri that she will do her utmost to accommodate her people, as well as any others who may follow. With formal introductions now complete, all present part ways to make ready for the imminent arrival of the first carriages."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Quicksand.</span>"],"dialogue":[{"name":"ALPHINAUD","text":"It is past time Lady Yugiri met with the guild representatives in Revenant's Toll."},{"name":"ALPHINAUD","text":"Since I do not foresee any further matters arising here in Thanalan which might require your personal attention, I would instead have you serve as an escort to the Doman delegation for the duration of the journey."},{"name":"ALPHINAUD","text":"Speak first with Slafborn upon your arrival. He is the one with whom the Domans will be working most closely, I should think."},{"name":"ALPHINAUD","text":"Afterwards, introduce Lady Yugiri to Minfilia and the guild emissary. If both meetings go well, the resulting ties should stand the Domans in good stead for that which is to come. Safe travels, <span class=\"highlight\">Forename</span>."},{"name":"YUGIRI","text":"We are ready to depart at your earliest convenience. But say the word and we shall follow."},{"name":"KSASAGI","text":"Many great and terrible beasts roam the wastes of Mor Dhona, yes? Then we must needs keep a closer eye on the children."},{"name":"KIKYOU","text":"I hope this proves to be the final leg of our journey... The malms have taken their toll."},{"name":"SLAFBORN","text":"And this must be the esteemed Lady Yugiri and her associates. I greet you all as friends, and bid you welcome to the Toll."},{"name":"SLAFBORN","text":"I hope you do not find our dearth of fineries off-putting. Poor though we may seem, we have a wealth of spirit─and camaraderie to spare!"},{"name":"SLAFBORN","text":"You see, race and creed don't enter into it here. We welcome all sorts─provided they are willing to earn their keep, of course."},{"name":"YUGIRI","text":"We are no strangers to hard work, Master Slafborn. You may rest assured that we will carry out your orders with due diligence."},{"name":"SLAFBORN","text":"Oh, not for a moment did I doubt your commitment, my lady! Pray understand, I give the same speech to all new arrivals. And you needn't bow your head or call me “Master” either. We are both frontier hands, as far as I'm concerned."},{"name":"YUGIRI","text":"As you wish...Slafborn. May this meeting mark the beginning of a long and fruitful relationship."},{"name":"SLAFBORN","text":"Our guests have yet to meet the Antecedent? Seven hells, <span class=\"highlight\">Forename</span>, why are you wasting time with me!? See them to the Rising Stones!"},{"name":"KSASAGI","text":"The sentries appear more than capable... Even so, it may be best to forbid people from venturing beyond the walls unescorted─for the time being, at least."},{"name":"KIKYOU","text":"At long last, we have an opportunity to prove our worth. You shan't regret this, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"YUGIRI","text":"To whom much is given, much is expected..."},{"name":"YUGIRI","text":"Forgive me─I require a moment to compose my thoughts before meeting with your leader. We shall join you at the Rising Stones anon."},{"name":"YUGIRI","text":"The Rising Stones is in the Seventh Heaven, yes? We shall follow anon."},{"name":"MINFILIA","text":"'Tis no use..."},{"name":"MINFILIA","text":"Our attempts to reach the Students of Baldesion continue to meet with failure. Urianger has explored other avenues of inquiry, but they too have yielded naught."},{"name":"MINFILIA","text":"We will persevere, of course...yet within our hearts, the truth is clear. We are but awaiting confirmation of that which we already know."},{"name":"MINFILIA","text":"How fare the Domans? I am given to understand you were kept quite busy in Vesper Bay."},{"name":"MINFILIA","text":"Mayhap you question the wisdom of aiding refugees when the primal threat remains unresolved."},{"name":"MINFILIA","text":"I should not blame you if you did. Nor would I deny that this matter falls outside our normal purview. Be that as it may, I could not ignore the plight of these refugees─not when it was within our power to help them."},{"name":"MINFILIA","text":"Lady Yugiri is here? Please, show her in. I should very much like to meet her."},{"name":"MINFILIA","text":"We have no objections. Pray do so with our blessing."},{"name":"YUGIRI","text":"Your answer pleases me beyond words, my lady─but are you quite certain? We have no way of knowing how many might answer my summons."},{"name":"YUGIRI","text":"In the event that Revenant's Toll could not accommodate us all, we would need to find an alternative solution."},{"name":"MINFILIA","text":"Should that come to pass, we will find it together."},{"name":"SISHA01353","text":"As ever, it has been a pleasure, Antecedent. Alas, we must take our leave as the first carriages are due to arrive at any moment."},{"name":"SISHA01353","text":"Should you require aught else, pray speak with Slafborn. Lady Yugiri, <span class=\"highlight\">Forename</span>."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66888]},"next":[66890]},"partials":[{"type":"npc","id":"1008547","obj":{"i":1008547,"n":"Minfilia","l":481,"q":1}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1008656","obj":{"i":1008656,"n":"Yugiri","l":40,"q":2}},{"type":"npc","id":"1008657","obj":{"i":1008657,"n":"Kasasagi","l":40,"q":2}},{"type":"npc","id":"1008658","obj":{"i":1008658,"n":"Kikyo","l":40,"q":2}},{"type":"npc","id":"1008659","obj":{"i":1008659,"n":"Yugiri","l":67,"q":1}},{"type":"npc","id":"1008660","obj":{"i":1008660,"n":"Kasasagi","l":67,"q":1}},{"type":"npc","id":"1008661","obj":{"i":1008661,"n":"Kikyo","l":67,"q":1}},{"type":"quest","id":"66888","obj":{"i":66888,"n":"Why We Adventure","g":2,"l":"Western Thanalan","s":27}},{"type":"quest","id":"66890","obj":{"i":66890,"n":"Full Belly, Happy Heart","g":0,"l":"The Rising Stones","s":29}}]}