{"quest":{"name":"Lord of the Whorl","location":"Lower La Noscea","id":66897,"patch":2.2,"sort":36,"icon":100226,"eventIcon":71201,"issuer":1008693,"target":1002694,"involved":[1001029,1005409,1008676,1008677,1008678,1008679,1008691,1008891,1008892,1008893,1008894,1008895],"genre":2,"journal":["Eynzahr stands ready to send you off to your encounter with the Lord of the Whorl.","With little more than a look, you signal your readiness to do battle with Leviathan. At your command, the twin vessel <span class=\"emphasis\">Whorleater</span> will be towed out onto the open sea, where the Lord of the Whorl awaits you. The fate of Limsa Lominsa rests upon your shoulders. Do not falter.<br><br>※The <span class=\"emphasis\">Whorleater</span> (Hard) can be accessed via the Duty Finder.","Following a titanic struggle on the high seas, you succeed in vanquishing Leviathan. Make your way to Limsa Lominsa, that you might bask in the Admiral's gratitude. As always, speak with Zanthael in Bulwark Hall to be admitted to the command room.","You report your victory over Leviathan to a grateful Merlwyb, who pronounces you her nation's greatest ally. Apparently inspired by your philanthropic endeavors, she subsequently pledges to send provisions to the Doman refugees at Revenant's Toll. Keen to repay this act of kindness, Yugiri, in turn, offers to share knowledge of her Far Eastern martial art with any who would learn. In response to her concern that the style may seem outlandish to Eorzeans, Thancred reveals that there are individuals in Limsa Lominsa who are more than capable of adapting to the techniques. Though the details yet remain hazy, you sense that interesting times lie ahead for you and your fellow adventurers."],"objectives":["Confront Leviathan on the <span class=\"emphasis\">Whorleater</span> (Hard).","Report to Merlwyb in the command room in Limsa Lominsa."],"dialogue":[{"name":"MERLWYB","text":"In order to build the <span class=\"emphasis\">Whorleater</span>, we had to decommission two perfectly serviceable galleons. Suffice it to say, their captains weren't best pleased with the notion. But when I offered them the chance to keep their ships and face Leviathan in our stead, they magnanimously withdrew their complaints.<br>“We must all make sacrifices for the greater good,” they said."},{"name":"MINFILIA","text":"&lt;sigh&gt; Would that we had armed ourselves with more knowledge beforehand... Well, it cannot now be helped. I take comfort in the fact that you have faced worse odds in the past, and have ever prevailed. You will do so again, of that I have no doubt."},{"name":"THANCRED","text":"To complete the twin vessel in so short a time, and with limited materials... The people of Naldiq & Vymelli's have won an admirer in me."},{"name":"YSHTOLA","text":"It will require no small amount of helmsmanship to tow the <span class=\"emphasis\">Whorleater</span>. I daresay delivering you safely to Leviathan will be a battle in itself."},{"name":"YUGIRI","text":"When first Master Eynzahr proposed the twin vessel, I must confess that I had my doubts. Only now that the <span class=\"emphasis\">Whorleater</span> is complete do I see the elegance of this solution."},{"name":"EYNZAHRSLAFYRSYN","text":"Ah...I know that look. You are ready!"},{"name":"EYNZAHRSLAFYRSYN","text":"Having been constructed in some haste, the <span class=\"emphasis\">Whorleater</span> may not be pretty, but I assure you she's capable."},{"name":"EYNZAHRSLAFYRSYN","text":"She has been fitted with what our friends at Naldiq & Vymelli's are calling an “elemental converter.” Assuming the thing works, it will use the power of the corrupted crystals on board to rob Leviathan of his hold over water."},{"name":"EYNZAHRSLAFYRSYN","text":"Depending on how the battle unfolds, you may well need to activate the device manually. Keep that in mind."},{"name":"MINFILIA","text":"It is expected that the Sahagin and their thralls will attempt to come to Leviathan's defense. Accordingly, the Maelstrom will once again employ diversions. Thancred and Y'shtola, I would have you assist in this effort."},{"name":"YUGIRI","text":"If it is to fulfill its purpose, your diversionary force must not want for numbers. By your leave, I too would volunteer my blade."},{"name":"MERLWYB","text":"We would welcome it. Having seen you fight in Sapsa, I daresay the fishbacks will find your presence <span class=\"emphasis\">highly</span> diverting. Thancred and Y'shtola, if you would join the 3rd Levy, and Lady Yugiri, the 5th."},{"name":"MERLWYB","text":"...But what words have I for the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who has made a sport of slaying gods? Only these: go warily, for the sea is an unforgiving place to wage war. May the Navigator guide you through the storm, Warrior of Light."},{"name":"MINFILIA","text":"I would echo the Admiral's sentiments, and add a few words of mine own. Know that we all have the utmost faith in you, <span class=\"highlight\">Forename</span>. May the Crystal bless and keep you!"},{"name":"EYNZAHRSLAFYRSYN","text":"When the battle is won and Leviathan's waves are stilled, we must partake of a barrel of something, you and I! I care not what, so long as it's strong enough to daze a primal, and plentiful enough to drown him! Har har!"},{"name":"STYRNLONA","text":"Storm Sergeant Styrnlona, at your service! The <span class=\"emphasis\">Whorleater</span> is loaded and ready, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I'll give the signal for the towing vessel to weigh anchor as soon as you're aboard."},{"name":"STYRNLONA","text":"There's not a soul among us who wouldn't lay down his life to ensure you reach your target, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>─so you just concentrate on skewering that overgrown sea snake, and leave the rest to us!"},{"name":"STYRNLONA","text":"By the Navigator...you did it! You defeated Leviathan in his own domain! I witnessed the battle from afar, saw the beast sink lifeless beneath the waves...and <span class=\"emphasis\">still</span> I labor to believe it!"},{"name":"STYRNLONA","text":"The Admiral had hoped to thank you the moment you came ashore, but she thought it meet to accompany the fleet back to Limsa. Pray present yourself to her at your earliest convenience. She will be eager to hear your account of the day's events!"},{"name":"EYNZAHRSLAFYRSYN","text":"A number of things did not go exactly to plan, I will admit. Leviathan denied us the luxury of ramming him, for one. But let's not quibble over the manner of the victory, eh? If Limsa is safe, and we are yet undrowned, I conclude that it has been a good day. Now go and bask in the Admiral's gratitude, will you? You have certainly earned the right!"},{"name":"MINFILIA","text":"So often do you achieve the impossible that I fear my words of congratulations will begin to sound repetitive─if, indeed, they have not already... With this in mind, I shall say only that I am glad of your safe return."},{"name":"THANCRED","text":"Another notch on the old belt, is it? Well done, my friend! Were I a god, I daresay I would tremble at <span class=\"emphasis\">your</span> summoning."},{"name":"YSHTOLA","text":"My congratulations, <span class=\"highlight\">Forename</span>. This victory will serve to quiet the Sahagin...for a time, at least."},{"name":"YUGIR","text":"That such beings can be defeated runs contrary to all I know... Whence comes your strength and sense of purpose?"},{"name":"ZANTHAEL","text":"Knowing the urgency of your business, I thought it best to refrain from making conversation during your past few visits. But today I will permit myself a few words. Ahem. I feel truly privileged to have had the honor of admitting a hero such as you. You are an inspiration to us all, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! And on that note...<br>The Admiral awaits you in the command room. &lt;wink&gt;"},{"name":"Q1","text":"Proceed to the command room?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"}],"reward":{"gil":2908,"items":[{"num":5,"id":7060}],"xp":4800,"instance":20017},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66896]},"next":[66898]},"partials":[{"type":"npc","id":"1008693","obj":{"i":1008693,"n":"Eynzahr Slafyrsyn","l":31,"q":2,"t":"Storm Marshal"}},{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1005409","obj":{"i":1005409,"n":"Styrnlona","l":31,"q":3,"t":"Storm Sergeant"}},{"type":"npc","id":"1008676","obj":{"i":1008676,"n":"Minfilia","l":351,"q":3}},{"type":"npc","id":"1008677","obj":{"i":1008677,"n":"Thancred","l":351,"q":2}},{"type":"npc","id":"1008678","obj":{"i":1008678,"n":"Y'shtola","l":351,"q":2}},{"type":"npc","id":"1008679","obj":{"i":1008679,"n":"Yugiri","l":351,"q":2}},{"type":"npc","id":"1008691","obj":{"i":1008691,"n":"Eynzahr Slafyrsyn","l":351,"q":2,"t":"Storm Marshal"}},{"type":"npc","id":"1008891","obj":{"i":1008891,"n":"Merlwyb","l":31,"q":2}},{"type":"npc","id":"1008892","obj":{"i":1008892,"n":"Minfilia","l":31,"q":2}},{"type":"npc","id":"1008893","obj":{"i":1008893,"n":"Thancred","l":31,"q":2}},{"type":"npc","id":"1008894","obj":{"i":1008894,"n":"Y'shtola","l":31,"q":2}},{"type":"npc","id":"1008895","obj":{"i":1008895,"n":"Yugiri","l":31,"q":2}},{"type":"item","id":"7060","obj":{"i":7060,"n":"Durability Draught","l":45,"c":20644,"t":44}},{"type":"instance","id":"20017","obj":{"i":20017,"n":"The Whorleater (Hard)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":60}},{"type":"quest","id":"66896","obj":{"i":66896,"n":"Into the Heart of the Whorl","g":2,"l":"Western La Noscea","s":35}},{"type":"quest","id":"66898","obj":{"i":66898,"n":"When Yugiri Met the Fraternity","g":2,"l":"Limsa Lominsa","s":37}}]}