{"quest":{"name":"Into the Heart of the Whorl","location":"Western La Noscea","id":66896,"patch":2.2,"sort":35,"icon":100225,"eventIcon":71201,"issuer":1008803,"target":1008693,"involved":[1001029,1002694,1008676,1008677,1008678,1008679,1008691,1008692,1008891,1008892,1008893,1008894,1008895],"genre":2,"journal":["Merlwyb is brooding over Leviathan's return.","Conceding that little can be done to thwart Leviathan's plans so long as he remains in the open sea, Merlwyb bids you join her in Limsa Lominsa to assess the available options. As always, speak with the guardsman Zanthael in Bulwark Hall to be admitted to the command room.","Before a hushed audience, Merlwyb recounts the tale of Halfstone, a hamlet obliterated by a tidal wave of Leviathan's making. The need for action is plain, but it soon becomes clear that neither the Admiral nor your fellow Scions know of any means to vie with the Lord of the Whorl upon the open sea. It is then that Storm Marshal Eynzahr steps forward with a most unorthodox proposal: to use the power of corrupted crystals, borne upon an improvised twin vessel, to rob Leviathan of his command over the element of water. Being the best─and only─plan available, all involved swiftly agree to support the endeavor, yet you cannot help but wonder at its ambition. Perhaps it would be useful to ask Yugiri for her opinion on the matter.","The Maelstrom has caught wind of a man who claims to have felled the mighty Leviathan. Though it seems unlikely that there is any truth to this rumor, thoroughness demands that you determine its authenticity. Make your way to the Grey Fleet in lower La Noscea, and seek out the fellow in question.","You arrive at the Grey Fleet to find your old friend Trachtoum being his usual blustering self. Though it is immediately clear that your time has indeed been wasted, you cannot help but feel a sense of relief. After all, had the fanciful claims come from a more artful liar's lips, it might have taken you <span class=\"emphasis\">days</span> to disprove them. No sooner have you had this thought than Minfilia contacts you via linkpearl with news that the twin vessel is ready. Proceed to the Moraby Drydocks and report to Eynzahr.","Eynzahr confirms that the moment of truth is at hand. You need but signal your readiness and the <span class=\"emphasis\">Whorleater</span> will bear you forth to your meeting with Leviathan. Brace yourself, for this voyage shall take you through the heart of the maelstrom."],"objectives":["Speak with Merlwyb in the command room in Limsa Lominsa.","Speak with Yugiri in the command room.","Speak with the storm private at the Grey Fleet.","Report to Eynzahr at the Moraby Drydocks."],"dialogue":[{"name":"MERLWYB","text":"Though our plight cries out for action, we must take thought."},{"name":"MERLWYB","text":"So long as Leviathan remains in the open sea, he is effectively beyond our reach. Our fleet is second to none, of that you may be sure─but Llymlaen Herself would struggle to best the Lord of the Whorl in his element. In a straight fight, he would make meat and matchwood of us."},{"name":"MERLWYB","text":"We need another plan, that much is plain. Let us return to Limsa and see if we cannot think of one. I shall await you in the command room."},{"name":"ZANTHAEL","text":"You are expected in the command room. Pray do not keep the Admiral waiting."},{"name":"Q1","text":"Proceed to the command room?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MERLWYB","text":"I have my people working triple shifts on the twin vessel, but it will take some time yet. Time we may not have. Seven hells...this waiting is liable to drive the lot of us mad."},{"name":"MINFILIA","text":"The Sahagin elder claimed to have become “eternal,” yet he was summarily consumed by Leviathan. What might this imply...?"},{"name":"THANCRED","text":"Being the observant adventurer that you are, you will doubtless have noticed my dagger work back at Sapsa. You know me, <span class=\"highlight\">Forename</span>─I like to dabble in a bit of this and a bit of that."},{"name":"YSHTOLA","text":"To confront the Lord of the Whorl in his watery domain is far from ideal, yet he is not like to come to us. &lt;sigh&gt; Would that he lacked the means to strike us from afar..."},{"name":"YUGIRI","text":"When I saw Leviathan rise from the depths, I cannot well describe what I felt. No words could prepare one for such a sight."},{"name":"EYNZAHRSLAFYRSYN","text":"If Leviathan is allowed to unleash a tidal wave, nothing within ten malms of the coast will be safe, let alone Limsa. I trust you see what's at stake here."},{"name":"YUGIRI","text":"Beings held as gods also exist in what you call the Far East."},{"name":"YUGIRI","text":"Legends tell us that they walked among us in days of yore, but I confess that I never truly believed them. That I should live to behold one is...humbling and horrifying in equal measure."},{"name":"YUGIRI","text":"Now that I have come face-to-face with a primal, I do begin to understand why the Garleans fear them so."},{"name":"MERLWYB","text":"What is it?"},{"name":"MAELSTROM01360","text":"A message, Admiral! I judged it best that it be delivered at once!"},{"name":"MERLWYB","text":"I am listening."},{"name":"MAELSTROM01360","text":"According to the Yellowjackets, a man has appeared who claims to have defeated Leviathan."},{"name":"MERLWYB","text":"...One of the Company of Heroes?"},{"name":"MAELSTROM01360","text":"The details are yet hazy, Admiral. We have dispatched one of our own to question the individual."},{"name":"MERLWYB","text":"Hm. I am disinclined to put any store by this claim. And even should it be true, it is as Y'shtola said: none save the Company of Heroes have bested Leviathan, and we know how they went about it. If this man is of their number, what could he tell us that we do not know already?"},{"name":"MERLWYB","text":"...And yet, having wagered Limsa's survival on two ships, some rope, and a pile of crystals, can we afford to ignore this man? If his testimony could yield us any manner of advantage, should we not hear it? Damn it all..."},{"name":"MERLWYB","text":"The twin vessel will soon be ready. We have no time to wait for the Maelstrom's report on this supposed primal-slayer's claims. <span class=\"highlight\">Forename</span>─seek him out and learn what he knows. At the very least, it will spare you the torment of waiting for the reckoning in idleness."},{"name":"MAELSTROM01360","text":"The man you are looking for is believed to be a resident of the Grey Fleet, in lower La Noscea. The storm private sent to question him should already be in the vicinity. May your journey prove fruitful!"},{"name":"MERLWYB","text":"Were our plight any less grim, I should not ask this of you, <span class=\"highlight\">Forename</span>─but grim it is, and here we are. Go to the Grey Fleet, and find out what your fellow primal-slayer knows─if primal-slayer he be. Oh, and you have my permission to <span class=\"emphasis\">break his bloody legs</span> if he's lying."},{"name":"TRACHTOUM","text":"Now look here, you! Ye'll have yer bloody story...right after ye carry those sacks of grain over to the mill!"},{"name":"STORMPRIVATE01360","text":"B-But, <span class=\"emphasis\">sir</span>...that's what you said before you had me pick those oranges for you. And before I mucked out the chocobo stables. <span class=\"emphasis\">And</span> before I rolled that millstone over to the mill. And also before─"},{"name":"TRACHTOUM","text":"Gods, man! I've worked three days straight without a wink of sleep! <span class=\"emphasis\">Three days</span>! An' do ye hear me complainin'!?"},{"name":"TRACHTOUM","text":"Bah... I s'pose some of us just ain't made for the rougher stuff. All right, all right...I'll give ye what ye want. Never let it be said that ol' Trachtoum ain't a generous soul."},{"name":"TRACHTOUM","text":"Now prick up yer ears, 'cause I won't be repeatin' meself. Too modest, see? Besides, there's only so much epicness a man can take in one sittin', ye ken?"},{"name":"TRACHTOUM","text":"Ahem! The tale of Trachtoum's epic victory over the dread primal Leviabeetus!"},{"name":"TRACHTOUM","text":"Now, Leviabeetus's <span class=\"emphasis\">huge</span>, make no mistake. To give ye an idea how big, each of his scales is about as wide across as me member's long─an' that's no mean feat, let me tell ye!"},{"name":"TRACHTOUM","text":"When I fought him, I could barely see fer all the brine he was peltin' me with. Must've been a lagoon's worth at least. He even knocked me trusty axe out of me hands at one stage... 'Course, that proved to be a <span class=\"emphasis\">grave</span> mistake... Heh heh heh..."},{"name":"STORMPRIVATE01360","text":"Wh-What happened next!?"},{"name":"TRACHTOUM","text":"Why, I grabbed him by the tail an' tied him up in knots! But not wantin' to take all the glory fer meself, I let me mates in the Company of Heroes handle the rest. Like I said, I'm modest as well as heroic! Mayhap <span class=\"emphasis\">too</span> modest... Now, there's some as say ye can never <span class=\"emphasis\">truly</span> beat Leviabeetus─that ye've got to learn to live with him an' make the best of a bad situation. Not the Company, though!"},{"name":"TRACHTOUM","text":"Uwaaaaaah! It...it's <span class=\"emphasis\">you</span>!"},{"name":"TRACHTOUM","text":"I'm sorry! I didn't mean it! I was just enjoyin' the attention, is all! I take back everythin' I said!"},{"name":"TRACHTOUM","text":"I was never part of the Company of Heroes! I'm no marauder! I'm actually a complete coward! I'm nothin'! I'm chocobo dung! No, I'm the <span class=\"emphasis\">maggots</span> ye find wrigglin' in chocobo dung! I have to lie to women to tumble 'em, an' that don't happen much! Me member's tiny, it's pathetic!"},{"name":"TRACHTOUM","text":"I sure as hells didn't fight Leviabeetus...but...but I <span class=\"emphasis\">have</span> seen him with me own eyes!"},{"name":"TRACHTOUM","text":"'Twas a fair few years back, when I was workin' as a baker's hand. I was shirkin' me duties one day, loiterin' about the harbor, when I saw it..."},{"name":"TRACHTOUM","text":"...A great big massive sea serpent some malms off the coast, with a fleet of galleons makin' straight for it, cannons firin'... I was so bloody scared, I soiled meself right there an' then!"},{"name":"TRACHTOUM","text":"Wha─? Oh, gods... Jus' rememberin' that day made me soil meself all over again!"},{"name":"TRACHTOUM","text":"H-Hey, wait... If yer here askin' after Leviabeetus...it means yer plannin' to fight him, ain't ye?"},{"name":"TRACHTOUM","text":"Well...take care! He really is terrible! Dreadful, I tell ye! If yer not careful, ye'll end up in his gullet or at the bottom of the sea!"},{"name":"STORMPRIVATE01360","text":"Why, you worthless, lying whoreson! I can't <span class=\"emphasis\">believe</span> you made me handle chocobo dung!"},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>, this is Minfilia. Were you able to learn aught of use against Leviathan?"},{"name":"MINFILIA","text":"...I beg your pardon? “Levia<span class=\"emphasis\">beetus</span>”? I see. That is unfortunate."},{"name":"MINFILIA","text":"At any rate, I have tidings for you: the twin vessel is now complete."},{"name":"MINFILIA","text":"We await you at the Moraby Drydocks. Pray make your way here as soon as you are able."},{"name":"EYNZAHRSLAFYRSYN","text":"I'm told your jaunt to the Grey Fleet proved fruitless. My sympathies, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I'll wager it served to take your mind off the events of recent days, though... But enough of that nonsense. The moment of truth is upon us."},{"name":"EYNZAHRSLAFYRSYN","text":"The twin vessel─the <span class=\"emphasis\">Whorleater</span>, I call her─is complete, and she surpasses all my expectations. In addition to her prodigious tonzage, she has been fitted with a platform, that you and yours might maneuver freely in battle. I would mention also that she is nigh unsinkable, but I'm not one to tempt fate."},{"name":"EYNZAHRSLAFYRSYN","text":"The <span class=\"emphasis\">Whorleater</span> and her crew stand ready, my friend. Just give the word, and we shall bear you to Leviathan."},{"name":"MERLWYB","text":"In order to build the <span class=\"emphasis\">Whorleater</span>, we had to decommission two perfectly serviceable galleons. Suffice it to say, their captains weren't best pleased with the notion. But when I offered them the chance to keep their ships and face Leviathan in our stead, they magnanimously withdrew their complaints.<br>“We must all make sacrifices for the greater good,” they said."},{"name":"MINFILIA","text":"&lt;sigh&gt; Would that we had armed ourselves with more knowledge beforehand... Well, it cannot now be helped. I take comfort in the fact that you have faced worse odds in the past, and have ever prevailed. You will do so again, of that I have no doubt."},{"name":"THANCRED","text":"To complete the twin vessel in so short a time, and with limited materials... The people of Naldiq & Vymelli's have won an admirer in me."},{"name":"YSHTOLA","text":"It will require no small amount of helmsmanship to tow the <span class=\"emphasis\">Whorleater</span>. I daresay delivering you safely to Leviathan will be a battle in itself."},{"name":"YUGIRI","text":"When first Master Eynzahr proposed the twin vessel, I must confess that I had my doubts. Only now that the <span class=\"emphasis\">Whorleater</span> is complete do I see the elegance of this solution."}],"reward":{"gil":1580,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66895]},"next":[66897]},"partials":[{"type":"npc","id":"1008803","obj":{"i":1008803,"n":"Merlwyb","l":33,"q":2}},{"type":"npc","id":"1008693","obj":{"i":1008693,"n":"Eynzahr Slafyrsyn","l":31,"q":2,"t":"Storm Marshal"}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"npc","id":"1008676","obj":{"i":1008676,"n":"Minfilia","l":351,"q":3}},{"type":"npc","id":"1008677","obj":{"i":1008677,"n":"Thancred","l":351,"q":2}},{"type":"npc","id":"1008678","obj":{"i":1008678,"n":"Y'shtola","l":351,"q":2}},{"type":"npc","id":"1008679","obj":{"i":1008679,"n":"Yugiri","l":351,"q":2}},{"type":"npc","id":"1008691","obj":{"i":1008691,"n":"Eynzahr Slafyrsyn","l":351,"q":2,"t":"Storm Marshal"}},{"type":"npc","id":"1008692","obj":{"i":1008692,"n":"Storm Private","l":31,"q":1}},{"type":"npc","id":"1008891","obj":{"i":1008891,"n":"Merlwyb","l":31,"q":2}},{"type":"npc","id":"1008892","obj":{"i":1008892,"n":"Minfilia","l":31,"q":2}},{"type":"npc","id":"1008893","obj":{"i":1008893,"n":"Thancred","l":31,"q":2}},{"type":"npc","id":"1008894","obj":{"i":1008894,"n":"Y'shtola","l":31,"q":2}},{"type":"npc","id":"1008895","obj":{"i":1008895,"n":"Yugiri","l":31,"q":2}},{"type":"quest","id":"66895","obj":{"i":66895,"n":"The Gift of Eternity","g":2,"l":"Western La Noscea","s":34}},{"type":"quest","id":"66897","obj":{"i":66897,"n":"Lord of the Whorl","g":2,"l":"Lower La Noscea","s":36}}]}