{"quest":{"name":"Full Belly, Happy Heart","location":"The Rising Stones","id":66890,"patch":2.2,"sort":29,"eventIcon":71201,"target":1008663,"involved":[1006950,1008559],"genre":0,"journal":["The plight of the refugees weighs heavily on Minfilia's mind.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Quicksand.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","F'lhaminn informs you that the Seventh Heaven is responsible for preparing the meals, and that all should be proceeding according to plan. However, it would seem she too is a proponent of excess caution. You are to speak with Alys to confirm the state of the meals─but not before collecting several bottles of wine which are to be delivered as well.","Wine bottles in hand, you are now ready to speak with Alys. Venture outside and inquire as to the status of the meals.","Alys willfully misinterprets your concern as an offer to deliver the meals in her stead, placing them on the counter and waiting expectantly for you to pick them up. Refusing at this point would accomplish little; collect the meals as bade.","In a remarkable display of dexterity, you secure the plates of food without the use of trays, bags, cases, or anything of the sort. Deliver the meals and wine to the Adventurers' Guild assistant outside the northern gates.","The assistant is bemused to see that it is none other than the legendary Warrior of Light who brought her the Domans' food. Regardless of the circumstances which led to your arrival, she is nonetheless grateful for your presence, as there is a situation which would benefit from your personal attention."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Alphinaud at the Quicksand.</span>"],"dialogue":[{"name":"MINFILIA","text":"I pray the Domans' journey has been uneventful. They have endured too much hardship, and for far too long..."},{"name":"MINFILIA","text":"Ah, forgive me─there was another matter I wished to discuss."},{"name":"MINFILIA","text":"My mother was to see to it that the Domans received a welcome supper. Now that the first group is nearly here, would you go and see if she is in need of assistance?"},{"name":"MINFILIA","text":"I should think that Lhaminn has everything well in hand, but it would put my mind at ease if you were to go and check on her."},{"name":"FLHAMINN","text":"Hello again, <span class=\"highlight\">Forename</span>. To what do I owe the pleasure?"},{"name":"FLHAMINN","text":"Ah, ever the worrier, my Ascilia. The Seventh Heaven should have the meals ready by now, though I believe they have yet to be delivered."},{"name":"FLHAMINN","text":"Would you mind speaking with Alys to be sure? Oh, and take this wine with you─the adults will appreciate it."},{"name":"FLHAMINN","text":"You should speak to Alys about those meals. And don't forget to take the wine with you!"},{"name":"ALYS","text":"What'll it be? Wine, or something stronger?"},{"name":"ALYS","text":"How very kind of you to volunteer your help! Here, take these meals to the emissary's assistant outside the northern gates. She'll handle distribution."},{"name":"ALYS","text":"Best deliver those meals while they're hot. And don't you dare take any for yourself!"},{"name":"HONBUBOUKENSHA01354","text":"As you can see, the Domans but recently arrived. I was assured we would have food and drink by now, but we've yet to receive aught from the Seventh Heaven."},{"name":"HONBUBOUKENSHA01354","text":"Ah, excellent. Many thanks, <span class=\"highlight\">Forename</span>. While they had rations to sate their hunger during the journey, there is no substitute for a freshly cooked meal."},{"name":"HONBUBOUKENSHA01354","text":"I must say, I was not expecting <span class=\"emphasis\">you</span> of all people to deliver these. Far be it from me to question your organization's delegation of duties, but surely there are other tasks better suited to your talents..."},{"name":"HONBUBOUKENSHA01354","text":"Though, on further consideration, I should probably consider this a blessing. We've a situation which would benefit from your personal attention."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66889]},"next":[66891]},"partials":[{"type":"npc","id":"1008663","obj":{"i":1008663,"n":"Adventurers' Guild Assistant","l":67,"q":1}},{"type":"npc","id":"1006950","obj":{"i":1006950,"n":"Alys","l":67,"q":7}},{"type":"npc","id":"1008559","obj":{"i":1008559,"n":"F'lhaminn","l":481,"q":1}},{"type":"quest","id":"66889","obj":{"i":66889,"n":"All Due Respect","g":0,"l":"Ul'dah","s":28}},{"type":"quest","id":"66891","obj":{"i":66891,"n":"Writhing in the Dark","g":0,"l":"Mor Dhona","s":30}}]}