{"quest":{"name":"The Gift of Eternity","location":"Western La Noscea","id":66895,"patch":2.2,"sort":34,"icon":100224,"eventIcon":71201,"issuer":1006614,"target":1008803,"involved":[1008698,1008706],"genre":2,"journal":["Falkbryda awaits the commencement of the operation with barely concealed rage.","Having made her final assessment of the situation, Merlwyb gives the order for the operation to commence. According to the scout you rescued, the summoning ritual is being held at the beastman aetheryte situated deep within the Sapsa Spawning Grounds. Accompany Y'shtola into the Sahagin lair, and fight your way to the aetheryte.","Upon passing the first checkpoint, you are assailed by Sahagin guards, whom you swiftly vanquish. Make haste now for the next checkpoint.","You have made your way through the next checkpoint, dispatching the Sahagin that barred your way. Make haste now for the final checkpoint.","Leaving a river of Sahagin blood in your wake, you have made it through the final checkpoint. Continue on and rejoin Y'shtola.","Despite your best efforts, the summoning ritual is completed and Leviathan is come once more. But no sooner did the primal manifest than he bent his course for the open sea. Her voice laden with dread, Merlwyb expresses her fear that Leviathan means to unleash a tidal wave. Speak with her again, that you might better understand the impending danger.","According to Merlwyb, the destructive potential of Leviathan's tidal wave far surpasses anything that occurs in nature. If the primal is not stopped, whole settlements will be laid waste. But with the Lord of the Whorl already far out to sea, how can such a disaster be prevented?"],"objectives":["Go through the first checkpoint and defeat any Sahagin that appear.","Go through the second checkpoint and defeat any Sahagin that appear.","Go through the final checkpoint and defeat any Sahagin that appear.","Rejoin Y'shtola.","Speak with Merlwyb at the Sapsa Spawning Grounds."],"dialogue":[{"name":"FALKBRYDA","text":"Thrice-damned fishback bastards... I'll kill them slowly and then chase their rotten souls through all seven hells!"},{"name":"MERLWYB","text":"Peace, Commander. We are here for a purpose─and vengeance is <span class=\"emphasis\">not it</span>. I want your mind on the task at hand, savvy?"},{"name":"FALKBRYDA","text":"M-My apologies, Admiral. You may count on me to keep a clear head."},{"name":"MERLWYB","text":"Good. According to our sole surviving scout, the Sahagin and their thralls have already begun to amass at the aetheryte in the depths of Sapsa. If we are to act, it must be now."},{"name":"FALKBRYDA","text":"The men are ready. We but await your orders, Admiral. As predicted, the Sahagin have tightened security in and around the spawning grounds. A frontal assault is like to be met with fierce resistance."},{"name":"MERLWYB","text":"Ah, but we are not so artless as that, Commander. We shall divide our forces and strike them hard and fast at key locations. Remember: our ultimate objective is to take the Sapsa aetheryte and eliminate the Sahagin priest presiding over the summoning─we are not here to kill them all."},{"name":"MERLWYB","text":"The Maelstrom shall engage and distract the Sahagin's legion of drowned pirates at the Serpent's Tongue. Commander, you have charge over this effort."},{"name":"MERLWYB","text":"Be mindful that the lay of the land there is devilish for attacking forces. Let the Foreign Levy spearhead the assault, and have subsequent units fan out to cover their flanks."},{"name":"MERLWYB","text":"At the selfsame moment, a diversionary squadron formed of galleons from the Crimson Fleet shall harry the enemy from offshore."},{"name":"MINFILIA","text":"In like wise, we Scions shall form smaller units in hopes of confusing the Sahagin defensive effort."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span> and Y'shtola, the two of you are to make your way to the site of the summoning ritual."},{"name":"MINFILIA","text":"The Admiral's diversions should serve to thin the enemy's defenses, rendering your path less perilous."},{"name":"MINFILIA","text":"A small party, I believe, should be able to win through without drawing unwarranted attention."},{"name":"MINFILIA","text":"Thancred and Yugiri, your mission is to lure as many Sahagin as possible out of the spawning grounds."},{"name":"MINFILIA","text":"Having done so, take to your heels and circle 'round to join the infiltration unit of Y'shtola and <span class=\"highlight\">Forename</span>."},{"name":"MERLWYB","text":"When all has been set in motion, I myself shall cut a path to the aetheryte, accompanied by Lady Minfilia, as was agreed."},{"name":"MERLWYB","text":"Well, don't let me keep you, friends! ...TO BATTLE!"},{"name":"YSHTOLA","text":"...When last did we fight side by side, <span class=\"highlight\">Forename</span>? Too long ago, I warrant. But come, let us away!"},{"name":"KOKKAGUNNSOU01359","text":"To get to the fishbacks' aetheryte, ye'll need to fight yer way through three checkpoints in all. No small task, that...but at least ye won't have so many drowned pirate curs to worry about. Me an' the lads'll be keepin' 'em niiice an' busy for ye!"},{"name":"POP","text":"The Sahagin have been alerted to your presence!"},{"name":"BALLOON","text":"Pshhh! Intrudersss!"},{"name":"BALLOON","text":"You shall not passssss!"},{"name":"BALLOON","text":"Summon reinforcementsss!"},{"name":"BALLOON","text":"You will pay with your livesss!"},{"name":"BALLOON","text":"For Lord Leviathan!"},{"name":"YSHTOLA","text":"Pray do not concern yourself─'twas but a glancing blow. Come, the aetheryte is close at hand─let us press on!"},{"name":"MERLWYB","text":"Understand─I speak of no normal wall of water. That which Leviathan makes ready to conjure carries more destructive power than aught seen in nature."},{"name":"MERLWYB","text":"...Enough to raze entire coastal settlements, if his last attempt is any guide. We <span class=\"emphasis\">cannot</span> suffer history to be repeated...yet how in the seven hells are we to prevent it?"}],"reward":{"gil":2283,"items":[{"id":6250,"one":1},{"id":6251,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66894]},"next":[66896]},"partials":[{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1008803","obj":{"i":1008803,"n":"Merlwyb","l":33,"q":2}},{"type":"npc","id":"1008698","obj":{"i":1008698,"n":"Storm Sergeant","l":33,"q":1}},{"type":"npc","id":"1008706","obj":{"i":1008706,"n":"Y'shtola","l":33,"q":1}},{"type":"item","id":"6250","obj":{"i":6250,"n":"Hero's Bracelet of Casting","l":90,"c":55701,"t":42}},{"type":"item","id":"6251","obj":{"i":6251,"n":"Hero's Bracelet of Healing","l":90,"c":55701,"t":42}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66894","obj":{"i":66894,"n":"Scouts in Distress","g":2,"l":"Western La Noscea","s":33}},{"type":"quest","id":"66896","obj":{"i":66896,"n":"Into the Heart of the Whorl","g":2,"l":"Western La Noscea","s":35}}]}