{"quest":{"name":"When Yugiri Met the Fraternity","location":"Limsa Lominsa","id":66898,"patch":2.2,"sort":37,"eventIcon":71201,"issuer":1001029,"target":1008694,"involved":[1008695],"genre":2,"journal":["Zanthael has orders to point you in the direction of the Lominsan underworld.","Zanthael gives you a letter of introduction from Merlwyb, which should grant Yugiri access to the Lominsan underworld. Take the letter to the southern area of the lower decks, and show it to the inconspicuous man.","Despite Zanthael's earlier warnings, the inconspicuous man extends Yugiri the warmest of Lominsan welcomes. Duly heartened, she declares her intent to study the fighting techniques employed by his fraternity, and expresses her hope that you will be her student when the time is ripe."],"objectives":["Deliver the Admiral's letter of introduction to the inconspicuous man."],"dialogue":[{"name":"ZANTHAEL","text":"The Admiral has informed me of the <span class=\"emphasis\">arrangement</span>. I have in my keeping a letter of introduction for Lady Yugiri."},{"name":"ZANTHAEL","text":"To the south stands a gate leading to a pier for smaller fishing vessels. Look for an <span class=\"emphasis\">inconspicuous</span> Hyuran man there, and present the letter to him. He serves as a gatekeeper of sorts."},{"name":"ZANTHAEL","text":"Now, before you go, I am obliged to remind you that the members of the, ahem, <span class=\"emphasis\">fraternity</span> to which you would be introduced abide in the shadows of Lominsan society."},{"name":"ZANTHAEL","text":"They value their independence more highly than pirates, and are united by a bond stronger than mythril. To wit, they are <span class=\"emphasis\">invariably</span> wary of new faces."},{"name":"ZANTHAEL","text":"Though it be penned by the Admiral herself, mere words on parchment will get you only so far into their confidence. You must work for every onze of trust they place in you."},{"name":"ZANTHAEL","text":"But here is the letter. Go to the aforementioned place, and show it to the aforementioned man. Oh, and...<span class=\"emphasis\">good luck</span>."},{"name":"UNDERGROUNDB01362","text":"What? Didn't your mammy teach you it's rude to stare?"},{"name":"UNDERGROUNDA01362","text":"...Hm? Got business with me, 'venturer?"},{"name":"UNDERGROUNDA01362","text":"So you're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> the Admiral sent word of."},{"name":"UNDERGROUNDA01362","text":"I was hopin' I might catch a glimpse of Thancred, too─been a while since I saw his shite-eatin' grin. But what with all the doe–eyed wenches about, I 'spect he's got his hands full."},{"name":"UNDERGROUNDA01362","text":"Ah, and you must be the Far Easterner what Merlwyb says wants to train with us. Welcome to Limsa, milady!"},{"name":"YUGIRI","text":"I am Yugiri of Doma. 'Tis an honor to make your acquaintance."},{"name":"YUGIRI","text":"I must confess, when first I learned of your organization, I had certain...preconceptions as to the nature of your membership. It would seem I was mistaken."},{"name":"UNDERGROUNDA01362","text":"You're not the first person to say that, lass. Limsa's a city of pirates, to be sure, and pirates don't give two farts about keepin' a spotless reputation. They hardly need a secret society to do their dirty work."},{"name":"UNDERGROUNDA01362","text":"Might be as my people and I keep to the shadows, but we've got nothin' to be ashamed of. It's simply better for business that we remain unseen."},{"name":"YUGIRI","text":"And so you have developed fighting techniques suited to this purpose. I see. Know that the practitioners of my art, too, are denizens of shadow. 'Tis in stealth that our strength lies. There is much we might learn from one another, I think."},{"name":"UNDERGROUNDA01362","text":"Then what in the seven hells are we waitin' for? If you'd come with us, Yugerry of Do–whatsit, we can get acquainted in more <span class=\"emphasis\">private</span> surrounds... Hah, that didn't come out right, did it!?"},{"name":"YUGIRI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. I shall remain with these people for a time, that I might study their ways."},{"name":"YUGIRI","text":"Though I am loath to be separated from my countrymen, I take solace in the knowledge that they are in the best of hands."},{"name":"YUGIRI","text":"You have been a true friend to us Domans. No words would suffice to express my gratitude."},{"name":"YUGIRI","text":"Ere long, I hope to begin imparting my martial knowledge to the people of Eorzea. When that time comes, it would be my honor to welcome you as a student."}],"reward":{"gil":1517,"items":[{"id":31696}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66897]},"next":[66899]},"partials":[{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1008694","obj":{"i":1008694,"n":"Inconspicuous Man","l":29,"q":2}},{"type":"npc","id":"1008695","obj":{"i":1008695,"n":"Shadowy Woman","l":29,"q":2}},{"type":"item","id":"31696","obj":{"i":31696,"n":"Level 50 Weapon Coffer (IL 90)","l":1,"c":26557,"t":61}},{"type":"quest","id":"66897","obj":{"i":66897,"n":"Lord of the Whorl","g":2,"l":"Lower La Noscea","s":36}},{"type":"quest","id":"66899","obj":{"i":66899,"n":"Through the Maelstrom","g":2,"l":"Limsa Lominsa","s":38}}]}