{"quest":{"name":"The Sea Rises","location":"The Rising Stones","id":66892,"patch":2.2,"sort":31,"eventIcon":71201,"issuer":1008542,"target":1006614,"involved":[1001029,1002694,1008676],"genre":2,"journal":["Minfilia wishes to share some final words on the coming mission prior to departing for Limsa Lominsa.","Minfilia impresses upon you the urgency of your mission to prevent Leviathan's return. Make for Limsa Lominsa without delay, and report to Admiral Merlwyb in her command room. Speak with Zanthael at Bulwark Hall to be granted admittance.","In the command room, the Admiral informs you that Maelstrom scouts have been dispatched to reconnoiter Sahagin movement within the Sapsa Spawning Grounds. Make your way to Camp Skull Valley in western La Noscea, and request the latest intelligence from Commander Falkbryda.","You have arrived at Camp Skull Valley, the operation's staging point. Be at ease for now and await further instructions."],"objectives":["Speak with Merlwyb at the command room in Limsa Lominsa.","Speak with Falkbryda at Camp Skull Valley."],"dialogue":[{"name":"MINFILIA","text":"Plainly, should the worst come to pass, and Leviathan is summoned, our only recourse will be to face him in battle. Given past experience, you may very well think that eventuality inevitable..."},{"name":"MINFILIA","text":"Yet so long as there is even a chance that the primal's return might be prevented, we must needs bend all our efforts toward achieving that goal."},{"name":"MINFILIA","text":"Before we do aught else, let us hasten to Limsa Lominsa and meet with the Admiral."},{"name":"MINFILIA","text":"She will not have been idle in the intervening time, and will doubtless have valuable information to share."},{"name":"MINFILIA","text":"So long as there is even a chance that the primal's return might be prevented, we must needs bend all our efforts toward achieving that goal."},{"name":"MINFILIA","text":"Before we do aught else, let us hasten to Limsa Lominsa and meet with the Admiral. As I am sure you recall, her command room is accessible via the Admiral's Lift at Bulwark Hall."},{"name":"ZANTHAEL","text":"You are expected. Pray take this lift to the command room."},{"name":"Q1","text":"Proceed to the command room?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MERLWYB","text":"Welcome, friends. I take it Y'shtola has apprised you of the situation?"},{"name":"MERLWYB","text":"Let us waste no time, then. According to our best intelligence, the Sahagin had not crystals enough to summon their god."},{"name":"MERLWYB","text":"Alas, we did not count on the Serpent Reavers venturing as far as Thanalan to supplement their cache. For our shortsightedness, we are faced with the grim prospect of Leviathan's imminent return."},{"name":"MERLWYB","text":"Needless to say, I am not inclined to let the fishbacks have their way. Even as we speak, the Maelstrom makes ready to launch a large-scale operation to thwart the summoning, and we would welcome the Scions' support in this endeavor."},{"name":"MERLWYB","text":"...But if, gods forbid, our efforts should come to naught, I will need to trouble you for more than mere support─much as I did when Titan last walked these lands."},{"name":"MERLWYB","text":"Lady Minfilia, I am given to understand that you mean to accompany our soldiers to the front lines. I can only assume that you have sound reasons for doing so?"},{"name":"MINFILIA","text":"I do, Admiral. But I would rather not be drawn on their nature. I will say only that there is something I would see with mine own eyes."},{"name":"MERLWYB","text":"Is that so? ...Well, I am not so stubborn as to deny the wish of one whose aid I require─but precautions must be taken. I shall require that you remain by my side at all times. With that <span class=\"emphasis\">settled</span>, let us speak of the operation."},{"name":"MERLWYB","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>─<span class=\"alternative-container\"><span class=\"alternative\">our</span><span class=\"alternative\">Maelstrom</span></span> scouts are currently reconnoitering Sahagin movements within the Sapsa Spawning Grounds."},{"name":"MERLWYB","text":"Upon completing their mission, they will return to the operation's staging point at Camp Skull Valley. I want you to make your way there forthwith, that you might be apprised of the latest intelligence. Commander Falkbryda has charge of the garrison."},{"name":"MERLWYB","text":"In case I wasn't clear: time is short, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. Make haste to Camp Skull Valley and request the latest intelligence from Commander Falkbryda."},{"name":"MINFILIA","text":"There may not be a better chance to learn the true nature of the Echo. I cannot well allow the opportunity to pass me by."},{"name":"FALKBRYDA","text":"I've been expecting you, Scion of the Seventh Dawn. On behalf of the men and women here, I thank you for your cooperation."},{"name":"FALKBRYDA","text":"The safety of our citizens is paramount. With your aid, we will prevent Leviathan's return."}],"reward":{"gil":1080,"items":[{"id":6245,"one":1},{"id":6246,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69418]},"next":[66893,66894]},"partials":[{"type":"npc","id":"1008542","obj":{"i":1008542,"n":"Minfilia","l":481,"q":1}},{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"npc","id":"1008676","obj":{"i":1008676,"n":"Minfilia","l":351,"q":3}},{"type":"item","id":"6245","obj":{"i":6245,"n":"Hero's Necklace of Casting","l":90,"c":54896,"t":40}},{"type":"item","id":"6246","obj":{"i":6246,"n":"Hero's Necklace of Healing","l":90,"c":54896,"t":40}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69418","obj":{"i":69418,"n":"All Due Respect","g":2,"l":"Ul'dah","s":30}},{"type":"quest","id":"66893","obj":{"i":66893,"n":"Fireworks and Fish Don't Mix","g":0,"l":"Western La Noscea","s":32}},{"type":"quest","id":"66894","obj":{"i":66894,"n":"Scouts in Distress","g":2,"l":"Western La Noscea","s":33}}]}