{"quest":{"name":"Scouts in Distress","location":"Western La Noscea","id":66894,"patch":2.2,"sort":33,"eventIcon":71201,"issuer":1006614,"target":1006614,"involved":[1008683,1008684,1008685],"genre":2,"journal":["Falkbryda is growing ever more agitated by the minute.","Falkbryda's scouts are late to return, and she is beginning to fear for them. She bids you ascertain their fate, and furnishes you with a flask of restorative on the chance that her men are injured. Start your search by focusing on the entrance to the Sapsa Spawning Grounds, and treat any wounded you find.","You have located one of the scouts and given him the restorative. According to the soldier, he alone managed to flee from an ambush, while his comrades were captured and taken to the Serpent's Tongue. Though Falkbryda expressly forbade venturing too deep into enemy territory, in the name of camaraderie, you resolve to find and rescue the remaining scouts.","You are assailed by a trio of Serpent Reavers, but succeed in vanquishing them. Alas, you have arrived too late to save two of the scouts, who were slain in captivity. The coast being clear, you are free to pick up the corpses of the hapless soldiers, unpleasant though the task may be.","You have collected the soldiers' corpses. See them returned to Falkbryda at Camp Skull Valley, that they might receive a proper burial.","Falkbryda cannot hide her anguish at the brutal end her soldiers met, and hopes that the men still missing did not suffer the same fate. Though the price was dear, the Maelstrom now has the intelligence it sought, and the operation may commence. See to your preparations, and be ready to move out at a moment's notice."],"objectives":["Use the Maelstrom restorative on the wounded storm private.","Find the missing scouts within the Serpent's Tongue.","Collect the soldiers' corpses.","Deliver the soldiers' corpses to Falkbryda."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"FALKBRYDA","text":"As you may already know, Maelstrom scouts have been dispatched to reconnoiter the Sapsa Spawning Grounds."},{"name":"FALKBRYDA","text":"Though it pains me to admit it, the Maelstrom has never faced a foe the likes of this before. We must proceed with all due caution."},{"name":"FALKBRYDA","text":"Among other things, they have orders to determine where Leviathan might emerge...assuming it comes to that."},{"name":"FALKBRYDA","text":"And yet...their return is long overdue. I fear that ill may have befallen them."},{"name":"FALKBRYDA","text":"For better or worse, we must ascertain their fate. If it is not too much to ask, I would have you aid us in the search."},{"name":"FALKBRYDA","text":"Five scouts ventured into Sapsa all told. Here, take this flask of restorative to tend those who may have been wounded."},{"name":"FALKBRYDA","text":"Though it pains me to even consider the notion, if they have perished, circumstances permitting, I ask that you recover their bodies. By no means venture too deep into enemy territory, however─we can ill afford to lose you at this juncture."},{"name":"FALKBRYDA","text":"Five scouts ventured into Sapsa all told. Use the restorative to tend to those who may have been wounded."},{"name":"FALKBRYDA","text":"Should it come to light that they have perished, circumstances permitting, I ask that you recover their bodies. By no means venture too deep into enemy territory, however─we can ill afford to lose you at this juncture."},{"name":"FALKBRYDA","text":"Help... Somebody... Of all the times...to forget the restorative... Urgh..."},{"name":"FALKBRYDA","text":"Thank you... I owe you my life..."},{"name":"FALKBRYDA","text":"We were ambushed by the Serpent Reavers. Lightly armed as we are, we didn't stand a chance."},{"name":"FALKBRYDA","text":"I was able to flee this far, but the others were captured. They were taken to the Serpent's Tongue, I'm certain of it."},{"name":"FALKBRYDA","text":"I can make my own way back to camp, but I fear the worst for my comrades... Save them, I beg you!"},{"name":"POP","text":"You sense a hostile presence!"},{"name":"POP","text":"The enemy is still about!"},{"name":"BALLOON","text":"Looky 'ere, lads! Fresh<br>meat fer the larder!"},{"name":"FALKBRYDA","text":"You're returned, thank the Navigator! When I learned that you went to the Serpent's Tongue by yourself, I feared you would meet an untimely demise! But tell me, what became of the others?"},{"name":"FALKBRYDA","text":"Dear gods... &lt;sob&gt; These wounds were not intended to kill, but to torture and maim... Does their savagery know no bounds!? Enemies or no, they go too far!"},{"name":"FALKBRYDA","text":"I dread to think what may have become of the two who remain unaccounted for... I pray that they haven't suffered the same evil fate."},{"name":"FALKBRYDA","text":"At the very least, one of my men came back alive, and for that I owe you my thanks. The price we paid was dear, but we have the intelligence we need."},{"name":"FALKBRYDA","text":"Even as we speak, the Admiral finalizes the details of the operation. The warhorns will sound any moment now. Be ready to sally forth when they do."}],"reward":{"gil":1502,"items":[{"num":5,"id":7059},{"id":6247,"one":1},{"id":6248,"one":1},{"id":6249,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66892]},"next":[66895]},"partials":[{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1008683","obj":{"i":1008683,"n":"Storm Private","l":33,"q":1}},{"type":"npc","id":"1008684","obj":{"i":1008684,"n":"Soldier's Corpse","l":33,"q":1}},{"type":"npc","id":"1008685","obj":{"i":1008685,"n":"Soldier's Corpse","l":33,"q":1}},{"type":"item","id":"7059","obj":{"i":7059,"n":"Spiritbond Potion","l":55,"c":20645,"t":44}},{"type":"item","id":"6247","obj":{"i":6247,"n":"Hero's Bracelet of Fending","l":90,"c":55701,"t":42}},{"type":"item","id":"6248","obj":{"i":6248,"n":"Hero's Bracelet of Slaying","l":90,"c":55701,"t":42}},{"type":"item","id":"6249","obj":{"i":6249,"n":"Hero's Bracelet of Aiming","l":90,"c":55701,"t":42}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66892","obj":{"i":66892,"n":"The Sea Rises","g":2,"l":"The Rising Stones","s":31}},{"type":"quest","id":"66895","obj":{"i":66895,"n":"The Gift of Eternity","g":2,"l":"Western La Noscea","s":34}}]}