{"quest":{"name":"Fireworks and Fish Don't Mix","location":"Western La Noscea","id":66893,"patch":2.2,"sort":32,"eventIcon":71201,"target":1006614,"involved":[1006616],"genre":0,"journal":["Falkbryda would have you assist in diversionary maneuvers.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Falkbryda at Camp Skull Valley.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You offer your services to U'jughal, who is at first reluctant to have an irreplaceable hero risk <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>self for a trifling matter. However, she relents under your insistence, and bids you go to Halfstone and destroy Sahagin pavises with the explosives provided. If detected, you are at liberty to engage the enemy.","You have successfully blown up the Sahagin pavises and vanquished the sentries that were drawn to the commotion. Return to Camp Skull Valley and report your success to Falkbryda.","Falkbryda thanks you for your part in ensuring the scouts' safety. All that remains now is to await their safe return."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Falkbryda at Camp Skull Valley.</span>"],"dialogue":[{"name":"FALKBRYDA","text":"As you may already know, Maelstrom scouts have been dispatched to reconnoiter the Sapsa Spawning Grounds."},{"name":"FALKBRYDA","text":"Among other things, they have orders to determine where Leviathan might emerge...assuming it comes to that."},{"name":"FALKBRYDA","text":"That our scouts might move unhindered and return unscathed, diversionary maneuvers are presently underway."},{"name":"FALKBRYDA","text":"In charge of these maneuvers is U'jughal. If you are otherwise unoccupied, mayhap you would be willing to offer her your aid."},{"name":"FALKBRYDA","text":"That our scouts might move unhindered and return unscathed, diversionary maneuvers are presently underway. If you would lend a hand, pray speak with U'jughal."},{"name":"UJUGHAL","text":"You're here to help with the <span class=\"emphasis\">diversions</span>? Aren't you supposed to be that irreplaceable adventurer the success of the operation is hinging on?"},{"name":"UJUGHAL","text":"I'm inclined to say it's not worth risking your neck for something so trifling such as this, but if the hero insists, who am I to argue?"},{"name":"UJUGHAL","text":"Here, take these explosives! Use them to blow the Sahagin pavises sky-high, and create a commotion in Halfstone the likes of which the fishbacks have never seen! That ought to keep them good and occupied."},{"name":"UJUGHAL","text":"Oh, and in the event that the Sahagin come after you, there's no need to be shy. Stay around, get yourselves acquainted─whatever it takes to buy more time for our scouts."},{"name":"POP","text":"The Sahagin have been alerted to your presence!"},{"name":"BALLOON","text":"Intruder! Kill <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"BALLOON","text":"You'll pay for this,<br>shhhorewalker!"},{"name":"BALLOON","text":"Tonight you'll sssleep<br>with the fishhhes!"},{"name":"FALKBRYDA","text":"It sounds like the diversion was a success. Aye, I heard the fireworks all the way over here. My thanks, friend."},{"name":"FALKBRYDA","text":"We've done all we can for our scouts. All that's left is to pray that they return safely."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66892]}},"partials":[{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1006616","obj":{"i":1006616,"n":"U'jughal","l":33,"q":2,"t":"Storm Lieutenant"}},{"type":"quest","id":"66892","obj":{"i":66892,"n":"The Sea Rises","g":2,"l":"The Rising Stones","s":31}}]}