{"quest":{"name":"Glutton for Punishment","location":"Outer La Noscea","id":66902,"patch":2.2,"sort":33,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005930,"target":1005930,"genre":39,"journal":["789th Order Dustman Bo Bu is not enamored with the eating habits of his digmate.","Bo Bu's dream of serving a feast atop his treasured doblyn-shell plate has been dashed by his fellow dustman Bo Zu, who─his already-lacking wits further addled by hunger─has greedily gorged himself upon the selfsame plate. While Bo Bu looks into his digmate's well-being, head to U'Ghamaro, scare doblyns from their shadows with the boom tosses furnished to you by Bo Bu, and retrieve their shells, that the dustman may restore his tableware.","You have swiftly and efficiently relieved three doblyns of their carapaces. Return to the 789th Order Dig and deliver the fruits of your labor to Bo Bu.","Heartened by your return and the knowledge that his fellow dustman is paying the price for his gluttony, Bo Bu takes the doblyn shells into hand. Will the day soon come when the 789th Order feasts in triumph?"],"objectives":["Use boom tosses on the shadows, then slay shard doblyns for their shells.","Deliver doblyn shells to 789th Order Dustman Bo Bu."],"dialogue":[{"name":"BOBU","text":"Stupid Bo Zu─brainless, witless, stupid Bo Zu! That plate was my prized possession. Yes, yes, my treasure!"},{"name":"BOBU","text":"At this dig, we do not eat well. No, no, we are near to starving. But some of us hold out hope that better days still await us. It is for the feasts to come─and come they will─that I fashioned that plate from a doblyn shell─crafted, shaped, fashioned with care..."},{"name":"BOBU","text":"And what does Bo Zu do? He swallows my work whole─engulfs, ingests, swallows! I care not how hungry you are─no, no, not at all─surely you can tell the difference between food and food-vessel."},{"name":"BOBU","text":"You will take boom toss, yes? Scare doblyns from the shadows, cut shells from their backs? I must give Bo Zu a good talking to─a pummeling, a beating, a talking to."},{"name":"BOBU","text":"You will take boom toss, yes? Scare doblyns from the shadows, cut shells from their backs? I must give Bo Zu a good talking to─a pummeling, a beating, a talking to."},{"name":"BOBU","text":"You return from the depths with the shells I seek, yes? Yes, yes, say you do."},{"name":"BOBU","text":"Such exquisite shells─beautiful, elegant, exquisite! These will make lovely plates, indeed. Yes, yes, the finest utensils our dig has seen."},{"name":"BOBU","text":"Bo Zu suffers from stomach pains most severe─wrenching, stinging, severe. That will teach him a lesson. Yes, yes, teach him not to take others' handiwork for his dinner."},{"name":"POPMESSAGE","text":"With a chitter and a clack, the shadows shift before your eyes..."}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21078},{"id":5667,"one":1},{"id":5677,"one":1},{"id":5717,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005930","obj":{"i":1005930,"n":"789th Order Dustman Bo Bu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21078","obj":{"i":21078,"n":"Titan Cobaltpiece","l":1,"c":65052,"t":100}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}}]}