{"quest":{"name":"A Coblyn Catastrophe","location":"Outer La Noscea","id":66900,"patch":2.2,"sort":37,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005930,"target":1005930,"genre":39,"usedItems":[7802],"journal":["789th Order Dustman Bo Bu would see the tunnels freed from the terror of a heinous holy man and his horrific experiments.","Allying himself with the hated Zo Ga, a depraved bedesman has given life to a horde of alchemically augmented coblyns with a proclivity for feeding upon work-shy kobolds. Rightfully fearing for the safety of his dig, Bo Bu would see the holy man and his frightful creations sent home. Oblige this request by participating in the FATE “Full Metal Alchemist” in U'Ghamaro and bringing back proof of your triumph.","Bo Bu rejoices upon seeing the Titan steelshield─recompense from Zo Ga for the bedesman's foul work─knowing that he and his digmates will not be devoured by the ravenous creatures. Eager to do his part to lead his order to a new era of respectability, the dustman will no doubt have need of your services again..."],"objectives":["Deliver the Titan steelshield obtained in the FATE “Full Metal Alchemist” to 789th Order Dustman Bo Bu."],"dialogue":[{"name":"BOBU","text":"Friend, you must stop him! Yes, yes, you must bring an end to his most heinous experiments─hideous, hateful, heinous."},{"name":"BOBU","text":"Whose experiments? Bo Bu will not say. No, no, the name must not be so much as whispered─not spoken, not uttered, not whispered."},{"name":"BOBU","text":"I say only this─yes, yes, this alone: he is a bedesman of the 59th Order. Known for creating terrible, terrible things, he is─things that prowl the tunnels thirsting for our ore. Yes, yes, our ore and our flesh!"},{"name":"BOBU","text":"He is favored by Zo Ga, yes, yes, he is, for his creations feed on the weak and the suffering. It is but a matter of time─minutes, even moments─until our dig is overrun! You will help us, yes, yes?"},{"name":"BOBU","text":"I beg of you, friend─you must put an end to the experiments of this hateful holy one. We would live in fear of his ghastly creations no longer. No, no, no longer!"},{"name":"BOBU","text":"Did you triumph over the baleful bedesman─succeed, prevail, triumph?"},{"name":"BOBU","text":"Felled, felled is our foe, and carnage-crazed coblyns trouble our dig no more! Huzzah─hurrah, hooray, huzzah!"},{"name":"BOBU","text":"He who must not be named will rise again. Rise, rise, he will. But until then, you have won us a respite from danger─a rest, a reprieve, a respite."},{"name":"BOBU","text":"Well do I understand Gi Gu's fears─yes, yes, I do. Zo Ga is a fearsome foe, but will Bo Bu throw up his paws in surrender? No, no, perhaps the others, but not Bo Bu!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21078},{"id":5667,"one":1},{"id":5677,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005930","obj":{"i":1005930,"n":"789th Order Dustman Bo Bu","l":350,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21078","obj":{"i":21078,"n":"Titan Cobaltpiece","l":1,"c":65052,"t":100}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"item","id":"7802","obj":{"i":7802,"n":"Titan Steelshield","l":1,"c":26262,"t":61}}]}