{"quest":{"name":"Angry Angry Acolyte","location":"Outer La Noscea","id":66909,"patch":2.2,"sort":39,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005930,"target":1005930,"involved":[1005932,1008890],"genre":39,"journal":["789th Order Dustman Bo Bu would soothe the flames of a certain acolyte's ire.","789th Order Acolyte Ba Go is fuming about something, and Bo Bu values the fur on his back and the whiskers on his face too dearly to inquire as to why. Speak to the eccentric alchemist in the young dustman's stead, to see what might be done to calm the flames of his fury.","A brief conversation reveals the reason for Ba Go's anger. It appears the crooked Zo Ga has confiscated the most potent of the acolyte's creations, which he now employs to do his own dirty work. This affront to science will not be tolerated─Ba Go will have his beauties back, and his revenge as well. Delve into U'Ghamaro Mines and retrieve the Mark II limpet bombs from Zo Ga's prototype bomb incubator, bearing in mind that they have a job to do before they return home.","You have freed the first of Ba Go's beauties from its fiery prison. Take it on a tour of the facilities, dropping it off at one of the 13th Order's finest furnaces, which is about to be put out of commission.<br><br>※Fail to complete your objective in the allotted span of time, and the limpet bomb will detonate, causing damage to you in the process.","Ba Go's beauty made short work of the furnace, but its revenge has only just begun. Search the embers, quiet the bomb's rage and secure its core.","With core in hand, return to the incubator and claim the second of Ba Go's bombs, that you might reduce Zo Ga's vaunted workshop to even greater depths of chaos and confusion.","With the second bomb now in hand, it is time to blast another furnace into the seventh hell. Hurry to your destination before the feisty beauty takes out its anger on its carrier.<br><br>※Fail to complete your objective in the allotted span of time, and the limpet bomb will detonate, causing damage to you in the process.","With a boom and blast, another furnace has been rendered unfit for use. Search the embers and quell the bomb's rage, that you might retrieve its core and bring it quietly back to its creator.","You have collected the second core of Ba Go's two beauties, and your task is─at long last─done. Return to the 789th Order Dig and inform the acolyte that revenge has been served.","Ba Go quickly dismisses your accomplishments and hurries back to his research, a sure sign that his mood has returned to normal─or whatever passes for such as far as a mad genius is concerned. Report back to 789th Order Dustman Bo Bu and assure him that the acolyte's fury has been duly doused.","Though Bo Bu is relieved at the turn of events, the flames of the dustman's own anger have been fanned, and he swears revenge on Zo Ga for angering Ba Go and putting the lives of all in the 789th Order Dig in peril in the process. You take your leave, while wondering deep down if the greatest peril to the 789th Order's safety lies in the billowing bomb within..."],"objectives":["Speak with 789th Order Acolyte Ba Go.","Obtain a Mark II limpet bomb from the prototype bomb incubator.","Set the Mark II limpet bomb at the first 13th Order furnace.","Search the embers and obtain a Mark II limpet bomb core.","Obtain another Mark II limpet bomb from the prototype bomb incubator.","Set the Mark II limpet bomb at the second 13th Order furnace.","Search the embers and obtain a Mark II limpet bomb core.","Deliver the Mark II limpet bomb cores to 789th Order Acolyte Ba Go.","Report to 789th Order Dustman Bo Bu."],"dialogue":[{"name":"BOBU","text":"You must listen, yes! Our dig is in grave peril─danger, risk, peril!"},{"name":"BOBU","text":"Zo Ga? No, no, our own acolyte's fury do we face! Ba Go's rage seethes─simmers, smolders, seethes─threatening to raze us all!"},{"name":"BOBU","text":"What angers Ba Go so? I do not know─no, into the flames of his anger I dare not go. But you, yes you may face the fires and emerge unscathed─intact, unharmed, unscathed!"},{"name":"BOBU","text":"I would know what angers Ba Go so, but no─into the flames of his anger I dare not go. You, yes you may face the fires and emerge unscathed─intact, unharmed, unscathed!"},{"name":"BAGO","text":"Flame will devour all─swallow, consume, devour! Neither friend nor foe─no, no, none shall escape my rage!"},{"name":"BAGO","text":"My beauties! My poor, poor beauties! &lt;sob&gt; My most dazzling─magnificent, ravishing, dazzling─beauties have been spirited away to Zo Ga's loathsome forge, where they toil and trouble in ignominy!"},{"name":"BAGO","text":"Zo Ga must pay for this─yes, yes, Zo Ga must suffer! It may not be possible to bring back Ba Go's beauties whole...but they can at least be used to leave a present for Zo Ga─a gift, a memento, a present."},{"name":"BAGO","text":"Ba Go's beauties rage and seethe from within Zo Ga's fiery prison. You will free them, yes, and channel their rage to Zo Ga's most precious machineworks. You will move quickly─hastily, speedily, quickly─or you will be the one to suffer their wrath. Hehaeheahheahahaha!"},{"name":"BAGO","text":"But then, you will still not be done! Again must Zo Ga be made to suffer! Zo Ga's furnaces, once numbered two, will number none. Nothing, nothing, none."},{"name":"BAGO","text":"Ba Go will reunite with his beauties, and all will be quiet and calm, yes. Or you will fail, and the whole mountain will fall to Ba Go's wrath─crash, crumble, fall!"},{"name":"BAGO","text":"Zo Ga must suffer for his villainy. It may not be possible to bring back Ba Go's beauties whole...but they can at least be used to leave a present for Zo Ga─a gift, a memento, a present."},{"name":"BAGO","text":"Ba Go's beauties rage and seethe from within Zo Ga's fiery prison. You will free them, yes, and channel their rage to Zo Ga's most precious machineworks. You will move quickly─hastily, speedily, quickly─or you will be the one to suffer their wrath. Hehaeheahheahahaha!"},{"name":"BAGO","text":"But then, you will still not be done! Again must Zo Ga be made to suffer! Zo Ga's furnaces, once numbered two, will number none. Nothing, nothing, none."},{"name":"BAGO","text":"You return with the cores that make up Ba Go's beauties? Yesss, yesss, for your own sake, I hope you do!"},{"name":"BAGO","text":"As lovely as ever, you return to Ba Go! And you left a lovely gift for Zo Ga─yeeesss, yeeesss, you did!"},{"name":"BAGO","text":"...But what are you still doing here!? Can you not see that my beauties demand my attention? Go play with Bo Bu and leave me, begone, get out!"},{"name":"BOBU","text":"You need say nothing, no. Ba Go's words are heard even here, much to Bo Bu's comfort."},{"name":"BOBU","text":"My master's rage cools from a boil to a slow burn, a simmer. Bo Bu will stay away for now, just to be certain─safe, sure, certain."},{"name":"BOBU","text":"For when angered, Ba Go is more fearsome than a score, a hundred, a thousand of Zo Ga's strongest. Bo Bu's heart rages with the anger of a thousand of Ba Go's beauties. Zo Ga will pay for angering my master, for putting all our lives in danger."},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POPMESSAGE","text":"There is a rush of heat from among the embers!"},{"name":"POPMESSAGE","text":"Flames still rage about you!"},{"name":"BALLOON","text":"Hurrr...urrrgh!"},{"name":"SYSTEM","text":"You are not carrying the specified object. Return to the starting point and reattempt the delivery."},{"name":"SYSTEM","text":"Take the bomb into hand and carry it to your destination before it detonates."},{"name":"SYSTEM","text":"You will have fifty seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"You will have one minute and fifty seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength. If you fail to complete the task in time, the bomb will explode and you will suffer damage."},{"name":"Q1","text":"Commence transport?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21078},{"id":5632,"one":1},{"id":5682,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005930","obj":{"i":1005930,"n":"789th Order Dustman Bo Bu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"npc","id":"1008890","obj":{"i":1008890,"n":"Prototype Bomb Incubator","l":350,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21078","obj":{"i":21078,"n":"Titan Cobaltpiece","l":1,"c":65052,"t":100}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}}]}