{"quest":{"name":"A Meal Fit for a Fugleman","location":"Outer La Noscea","id":66905,"patch":2.2,"sort":35,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005930,"target":1005930,"involved":[1005960],"genre":39,"journal":["789th Order Dustman Bo Bu would have a taste of luxury, if only for a day.","The indomitable Bo Bu expresses his envy for the 13th Order─not for their wealth or prestige so much as for the sumptuous feasts afforded them by their fugleman Zo Ga. Bo Bu has no intention of betraying his friends at the dig, but he would slake his curiosity regarding the delicacies in which his more accomplished peers delight. Pay a visit to the most approachable member of Zo Ga's order─the alchemist Ga Zi─to see what might be done.","Harboring no great affection for Zo Ga's overbearing ways, Ga Zi willingly reveals the location of the food stores, as well as the means by which to acquire one of the necessary keys. As a growing young kobold's stomach hangs in the balance, delve into U'Ghamaro and locate one of the keyholder pots, slaying any patrolman fool enough to interfere.","The expired patrolman probably wishes he had stayed in bed this morning. Pay his sacrifice little heed and pop the top off the nondescript pot to retrieve a key.","With a goldpot key in your possession, you─and Bo Bu─are now one step closer to epicurean ecstasy. Make for any of the 13th Order's goldpots and examine it, dispatching its would-be guardian that you might safely extract the contents.","The guardian defeated, nothing stands between you and the 13th Order's greatest culinary creations. Unlock one of the pots and see what all the fuss is about.","Upon opening the goldpot, you find a similarly colored wriggling worm. Though it appears distinctly unappetizing to <span class=\"emphasis\">you</span>, you recall the old Lominsan saying, “There's no accounting for the taste of half-wits.” Bring the unfortunate writhing creature back to Bo Bu.","Bo Bu devours the writhing mass with delight, savoring every squirm and wiggle─a sight that you very much wish you could unsee. As Bo Bu swears revenge against Zo Ga for abusing the food supply, go on your way with the hope that the young dustman's stomach will remain sated for the foreseeable future."],"objectives":["Speak with 13th Order Alchemist Ga Zi.","Examine a dingy pot and slay the 13th Order patrolman that appears.","Open the dingy pot and retrieve a goldpot key.","Examine a 13th Order goldpot and slay the U'Ghamaro guardian that appears.","Unlock a 13th Order goldpot and retrieve its contents.","Deliver the writhing thing to 789th Order Dustman Bo Bu."],"dialogue":[{"name":"BOBU","text":"My glasses, my cap, the fur off my back─yes, yes, what I would not give to join the 13th Order for a day!"},{"name":"BOBU","text":"Do not take me wrong! No affection for Zo Ga do I bear─no love, no fondness, no affection. No, no, it is only my stomach that harbors such ambitions."},{"name":"BOBU","text":"The 789th Order dines on dirt and dry coblyn husks...when we dine at all. Meanwhile, Zo Ga fills his belly with the tastiest treats the tunnels have to offer."},{"name":"BOBU","text":"Bo Bu would never think of betraying his friends─no, no─but loyalty is much more easily maintained on a full stomach, yes? Yes, yes, we both know this is so."},{"name":"BOBU","text":"The alchemist Ga Zi serves Zo Ga, but not willingly. Yes, perhaps he could be persuaded─convinced, enticed, persuaded─to share a secret or two about his master's food stash. You are curious too, yes? You will go, yes?"},{"name":"BOBU","text":"The alchemist Ga Zi serves Zo Ga, but not willingly. Yes, perhaps he could be persuaded─convinced, enticed, persuaded─to share a secret or two about his master's food stash. You are curious too, yes? You will go, yes?"},{"name":"BALLOON","text":"Thief! Filcher, pilferer, thief!"},{"name":"GAJI","text":"Yunz have a mind to fill yunz's tummy with Zo Ga's yum-yums? That sounds like bugger for Zo Ga─and what's bugger for Zo Ga is bully for Ga Zi. A few too many 'splosions between us─booms, bwoms, 'splosions, that sort of thing."},{"name":"GAJI","text":"Now yunz be listening, 'cause I's going to direct yunz straight to Zo Ga's yummiest yum-yums."},{"name":"GAJI","text":"Firstly, yunz'll be needing a key─any one will do. Zo Ga keeps 'em in dingy old pots deep in U'Ghamaro, thinking they're safe there like the bugger-brain he is. Like as not, his bootlickers are guarding the place, but yunz shouldn't have a problem relieving them of their duties, nuh-uh, nuh-uh."},{"name":"GAJI","text":"Yunz take the key, go searching for one of Zo Ga's stash pots. Yunz should find them quickly, on account of them being all gold and shiny─glossy, sheeny, shiny, that sort of thing. Now, that bugger Zo Ga likes his yum-yums, so his stashes might be guarded a bit more heavily. But that's yunz's problem, uh-huh, uh-huh."},{"name":"BOBU","text":"&lt;sniff&gt; &lt;sniff&gt; What is this scrumptious aroma─this scent, this savor, this aroma!?"},{"name":"BOBU","text":"C-Could it be...!? Yes, yes, it could! A gold wriggler, still wriggling with life. A meal fit for kobold kings, but today it is for Bo Bu!"},{"name":"BOBU","text":"Om nom nom nom... &lt;gulp&gt; Oh, it still wriggles in my belly─worms, writhes, wriggles. The gall of Zo Ga, hoarding such delights as we go hungry. He will pay for his covetousness─yes, yes, pay he will!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POPMESSAGE","text":"The enemy is still about!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21078},{"id":5632,"one":1},{"id":5682,"one":1},{"id":5717,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005930","obj":{"i":1005930,"n":"789th Order Dustman Bo Bu","l":350,"q":10}},{"type":"npc","id":"1005960","obj":{"i":1005960,"n":"13th Order Alchemist Ga Zi","l":350,"q":7}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21078","obj":{"i":21078,"n":"Titan Cobaltpiece","l":1,"c":65052,"t":100}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}}]}