{"quest":{"name":"Ba Go's Behest","location":"Outer La Noscea","id":66907,"patch":2.2,"sort":32,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005930,"target":1005930,"involved":[1005932],"genre":39,"journal":["789th Order Dustman Bo Bu would come to the aid of his order's resident genius.","Bo Bu, convinced that he is Ba Go's favorite apprentice despite the latter's unwillingness to speak so much as a word to him, would come to his self-proclaimed master's aid─or have you do so in his stead. Speak with the acolyte and see what manner of task he would see done.","789th Order Acolyte Ba Go seeks a pair of rare ingredients for prototype bombs he would fashion─namely, a golem soulstone and a hard doblyn shell. No ordinary stone or shell will do, however. Dispatch two ordinary U'Ghamaro golems and two synthetic doblyns to lure their masters out of hiding, then slay these formidable foes to acquire the materials that Ba Go seeks.","Your opponents having fallen, you have the rare soulstone and doblyn shell sought by Ba Go in hand. Deliver them to Bo Bu, whose ability to identify the materials will be the test that determines whether he can truly serve as Ba Go's trusted assistant, or simply as the target of the acolyte's next detonation test.","Bo Bu gleefully takes the bombcrafting materials in hand despite giving no indication that he has the slightest idea regarding their nature. The young dustman's ambition is admirable, however, and one can only hope that his master will be gentle..."],"objectives":["Speak with 789th Order Acolyte Ba Go.","Defeat two U'Ghamaro golems, then slay Number 132 when it appears to acquire its soulstone.","Defeat two synthetic doblyns, then slay the greater doblyn that appears and acquire its shell.","Deliver the materials to 789th Order Dustman Bo Bu."],"dialogue":[{"name":"BOBU","text":"I know it, I sense it, I feel it in my bones. Master Ba Go has a task for his trusted apprentice Bo Bu!"},{"name":"BOBU","text":"A trying task he has, and yet he fears for Bo Bu's safety─worries, frets, fears. Yet he worries for nothing. Yes, yes, for naught!"},{"name":"BOBU","text":"For Bo Bu is ever loyal and brave─courageous, valiant, brave! Bo Bu shrinks not from his duty─no, never─but sends you straight to Ba Go in his stead. Yes, friend, go forth! Go forth and do Bo Bu proud!"},{"name":"BOBU","text":"Bo Bu shrinks not from his duty─no, never─but sends you straight to Ba Go in his stead. Yes, friend, go forth! Go forth and do Bo Bu proud!"},{"name":"BAGO","text":"You return to Ba Go, yesss? Excellent. Ba Go feared that Bo Bu would come stumbling in─bungling, bumbling, stumbling. All talk and no action, that one."},{"name":"BAGO","text":"But you have served Ba Go well before, and you will serve Ba Go again. Yeeesss, yesss, you will. "},{"name":"BAGO","text":"Ba Go would build his most lethal beauties yet, yet Ba Go lacks for the materials he needs. A soulstone and a doblyn shell, though not any will do, no, no!"},{"name":"BAGO","text":"The stone and shell Ba Go seeks must be taken straight from the guardians of depths most dark─shadowy, murky, dark. Slay golem and doblyn underlings, and their masters will come─yes, oh yes, will they come! Heahehaheahaha!"},{"name":"BAGO","text":"When you have what I seek, deliver it to Bo Bu. If he can tell me what it is, he may serve me, yes. If he cannot, I shall set his whiskers alight─aflame, ablaze, alight."},{"name":"BAGO","text":"Ba Go would build his most lethal beauties yet, yet Ba Go lacks for the materials he needs. A soulstone and a doblyn shell, though not any will do, no, no!"},{"name":"BAGO","text":"The stone and shell Ba Go seeks must be taken straight from the guardians of depths most dark─shadowy, murky, dark. Slay golem and doblyn underlings, and their masters will come─yes, oh yes, will they come! Heahehaheahaha!"},{"name":"BOBU","text":"You have come to the aid of Master Ba Go, yes, yes?"},{"name":"BOBU","text":"Incredible─astounding, amazing, incredible! Why, these are the most spectacular...whatsits...that Bo Bu has ever seen!"},{"name":"BOBU","text":"I shall bring them to Master Ba Go at once, and he shall rejoice! Yes, yes, he will be beside himself with joy at seeing his prize pupil deliver these remarkable...things!"},{"name":"BOBU","text":"Yes, no doubt he will be quick to share with me the fruits of his latest research─the results, the products, the fruits! I am in for a hair-raising experience, yes, yes, I am!"},{"name":"POPMESSAGE","text":"Ancient slabs of stone spring to life around you!"},{"name":"POPMESSAGE","text":"With a chitter and a whir, the creature is upon you!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21078},{"id":5632,"one":1},{"id":5672,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005930","obj":{"i":1005930,"n":"789th Order Dustman Bo Bu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21078","obj":{"i":21078,"n":"Titan Cobaltpiece","l":1,"c":65052,"t":100}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}}]}