{"quest":{"name":"Spread the Wealth","location":"Outer La Noscea","id":66906,"patch":2.2,"sort":36,"interval":"daily","repeatable":1,"beast":3,"eventIcon":71222,"issuer":1005930,"target":1005930,"involved":[1005932],"genre":39,"journal":["789th Order Dustman Bo Bu would take issue with Zo Ga's wealth distribution, or lack thereof.","Bo Bu is incensed at Zo Ga's mining methods, which involve the fugleman employing his considerable resources and influence to open new veins of ore and bleed them dry before handing them over to lesser orders. In the latest effort to that end, he has employed diggers fashioned for him under duress by the accomplished metalworkers of the 86th Order. At the dustman's request, consult with Ba Go and find a way to thwart Zo Ga's efforts and narrow the gap between the haves and have–nots.","Caring little for Zo Ga's aspirations but much for making things go boom, Ba Go gleefully furnishes you with some of his beauties, as well as pieces of flickering coal that will serve to guide the bombs to their target. Seek out the Model 86 digger in U'Ghamaro and lay the coals beside it.","With the coals in place, Ba Go's beauties will surely not mistake their target. Back away to a safe location, let them fly, and enjoy the fireworks to follow.","You have generated an explosion that would have made Ba Go proud. Make your way back to the 789th Order Dig and report the deed to Bo Bu.","Bo Bu is overjoyed to hear of your success, relishing the knowledge that the 789th will be competing on even terms with Zo Ga's favored ones, at least for the day. Though the young dustman at times suffers from overzealousness, you would not be averse to seeing his ambition rub off on his peers..."],"objectives":["Speak with 789th Order Acolyte Ba Go.","Place flickering coals beside the Model 86 digger.","From a safe location, release the smart bombs.","Report to 789th Order Dustman Bo Bu."],"dialogue":[{"name":"BOBU","text":"Sneaky, shifty Zo Ga will stop at nothing to tighten his grip on the tunnels. No, no, his twisted ambition knows no bounds."},{"name":"BOBU","text":"Zo Ga knows his mining abilities are ordinary─average, middling, ordinary. And so he monopolizes the richest veins, bleeds them dry before others can so much as sniff the treasures within."},{"name":"BOBU","text":"Machinists of the 86th make new rock eaters for Zo Ga, but they are not to blame. No, no, Zo Ga threatens to take their food if his bidding is not done."},{"name":"BOBU","text":"Every tunnel, every vein Zo Ga opens, one path, one dream is closed to us. You will speak to Ba Go and see what can be done. You will─yes, yes, you must!"},{"name":"BOBU","text":"Every tunnel, every vein Zo Ga opens, one path, one dream is closed to us. You will speak to Ba Go and see what can be done. You will─yes, yes, you must!"},{"name":"BAGO","text":"Zo Ga wants more shinies? Zo Ga can have them. Ba Go has his beauties, and that is enough─yes, yes, more than enough for Ba Go."},{"name":"BAGO","text":"But will Ba Go say no to making booms in Zo Ga's tunnels? No, no, Ba Go who says no would not be Ba Go. So Ba Go gives you brightstones and beauties. You have seen these before, yes? Yes, yes, you know what to do."},{"name":"BAGO","text":"Put down brightstones, stand back, and let beauties fly free. Beauties fly, fly into the light, and Zo Ga's metal beast goes boom. Zo Ga's friends will not be happy, but Ba Go will be! Haha! Haheaheaheahaeheah!"},{"name":"BAGO","text":"Put down brightstones, stand back, and let beauties fly free. Beauties fly, fly into the light, and Zo Ga's metal beast goes boom. Zo Ga's friends will not be happy, but Ba Go will be! Haha! Haheaheaheahaeheah!"},{"name":"BOBU","text":"You have done well, friend! A blast and a boom, and the playing field is leveled─flattened, evened, leveled. Yes, yes, now skill and smarts will win out over chicanery."},{"name":"BOBU","text":"It is only a matter of time─moons, days, time─until Bo Bu rises to his rightful position of power. Yes, yes, before long you will be calling me 1st Order Exemplar Bo Bu!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"KOBOLD01370","text":"(-13th Order Patrolman-)This is Zo Ga's! Keep your dirty paws off!"},{"name":"KOBOLD01370","text":"(-13th Order Patrolman-)Hands off! Don't touch! Keep back!"},{"name":"KOBOLD01370","text":"(-13th Order Patrolman-)Overdweller! I'll bring your head to Zo Ga on a platter─a dish, a plate, a platter!"},{"name":"BALLOON","text":"You won't return alive!<br>No, no, you won't!"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21078},{"id":5672,"one":1},{"id":5677,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005930","obj":{"i":1005930,"n":"789th Order Dustman Bo Bu","l":350,"q":10}},{"type":"npc","id":"1005932","obj":{"i":1005932,"n":"789th Order Acolyte Ba Go","l":350,"q":16}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21078","obj":{"i":21078,"n":"Titan Cobaltpiece","l":1,"c":65052,"t":100}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}}]}