{"quest":{"name":"Spawning Ground Salvation","location":"Western La Noscea","id":66919,"patch":2.2,"sort":18,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005938,"target":1005938,"involved":[1008816,1008817,1008818,1008819,1008820,1008821,1008822,1008823,1008824,1008825],"genre":41,"journal":["Fyuu has news of an incident that could escalate the ongoing conflict with the Maelstrom.","According to one of Fyuu's skulking spawnbrothers, the Coral Tridents have captured a number of Maelstrom soldiers. With naught but death or “drowning” awaiting such prisoners, the young Sahagin expects the soldiers' comrades to mount a retaliatory expedition. In order to prevent a violent disruption to the spawning grounds, Fyuu asks that you free the captured troops yourself. Approach the Sahagin sentries guarding the area, and obtain their keys─by peaceful means if possible, forceful means if necessary.","You have obtained the manacle keys from the Sahagin sentries. Locate the captive soldiers in the west of the Sahagin Landbase, and set them free of their shackles.","You have freed the captive storm recruits. Return to Novv's Nursery and report to Fyuu.","Though certain that the Coral Tridents curse the lone shorewalker who freed their captives, Fyuu is relieved that your actions have forestalled any retaliation by the Maelstrom. The young Sahagin, echoing the teachings of his clutchfather, appears determined to end the pointless cycle where vengeance begets only further vengeance."],"objectives":["Obtain manacle keys from Sahagin sentries.","Free captive storm recruits.","Report to Fyuu."],"dialogue":[{"name":"FYUU","text":"Pshhh... One of my ssspawnbrothers has ssspied Coral Trident warriors gloating over a catch of shhhorewalker sssoldiers. If they did not kill these captives outright, then they mean to have them “drowned.”"},{"name":"FYUU","text":"Ordinarily, I would not concern myssself with the fate of a few finless fighters...but enssslaving them to Lord Leviathan's will is shhhure to invite retaliation. And we do not need a sssquad of wrathful troopsss clanking through the middle of our ssspawning grounds."},{"name":"FYUU","text":"They ssslay sssome of ours, and we ressspond by ssslaying more of theirs─it achieves nothing. It would be bessst for all involved if you were to ssset these prisoners free, yesss?"},{"name":"FYUU","text":"The Tridentsss have posssted sssentries to guard the captives and keep watch for ressscue parties. Each will likely have a key that fitsss but one ssset of manacles─all the better to prevent an easy essscape. I sssuppose you might firssst try asssking the guards to sssurrender their keys..."},{"name":"FYUU","text":"...And when they inevitably attack you, none can sssay that they didn't deserve their fate!"},{"name":"FYUU","text":"You will need the manacle keys if you are to free the captive finless ones. Approach the Sssahagin sssentries and make an attempt to reason with them. When that invariably fails, you shhhall sssimply have to take the keys from their corpssses!"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"HORYOA01383","text":"Thank the Tw─ Oh, just the one of ye, is there? Well, do ye think ye can take them sentries? They've the keys to these blasted shackles!"},{"name":"HORYOB01383","text":"Come to set us free, have you? Be sure to snatch enough keys, because I'm not leaving without my squad mates!"},{"name":"HORYOC01383","text":"I'd rather drown than be, well, “drowned”...but I'll accept a last-moment rescue over either of those. Be sure to give our captors my “regards” when you pry the keys from their cold claws..."},{"name":"SAHAGINA01383","text":"Pshhh... An ally of our prisoners!? Then you shhhall shhhare their fate as one of Lord Leviathan's thralls!"},{"name":"SAHAGINB01383","text":"Shhhurrender my key? You mock the might of the Coral Tridentshhh, shhhorewalker!"},{"name":"SAHAGINC01383","text":"Pshhhahaha! No, you may not have my key, finless one. My ssspear, however, is yours for the asssking!"},{"name":"HORYOA01383","text":"Me thanks..."},{"name":"HORYOB01383","text":"Aye, now we can make a run for it!"},{"name":"HORYOC01383","text":"Free...<br>You'll be in my prayers this night, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"FYUU","text":"Pshhh... The Tridentsss howl and curssse your finless hide, but you have sssaved the ssspawning grounds from a retaliatory ssstrike."},{"name":"FYUU","text":"...A ssstrike that our warriors would then have felt the need to anssswer. And ssso it goes, back and forth, blood for blood. If we do not act to ssstop this madness, then who will?"}],"reward":{"gil":540,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":1,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005938","obj":{"i":1005938,"n":"Fyuu","l":33,"q":11}},{"type":"npc","id":"1008816","obj":{"i":1008816,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008817","obj":{"i":1008817,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008818","obj":{"i":1008818,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008819","obj":{"i":1008819,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008820","obj":{"i":1008820,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008821","obj":{"i":1008821,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008822","obj":{"i":1008822,"n":"Sahagin Sentry","l":33,"q":1}},{"type":"npc","id":"1008823","obj":{"i":1008823,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"npc","id":"1008824","obj":{"i":1008824,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"npc","id":"1008825","obj":{"i":1008825,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}