{"quest":{"name":"Like Clutchfather, Like Son","location":"Western La Noscea","id":66914,"patch":2.2,"sort":0,"icon":100243,"beast":4,"unlocksFunction":1,"eventIcon":71341,"issuer":1005937,"target":1003281,"involved":[1005946,1006614,1008921,1008922,1008923],"genre":40,"journal":["Novv is clearly agitated by a recent development concerning the Coral Tridents.","Novv informs you that Zugg and his Coral Trident fanatics have abducted a high-ranking Lominsan official from the deck of a navy vessel. Visibly distressed by the implications, the clutchfather asks that you speak with a Maelstrom officer to learn if there is any chance to avert the seemingly inevitable plunge into full-scale war. Make your way to Camp Skull Valley and attempt a parley with Commander Falkbryda.","You attempt to dissuade Falkbryda from her course, but it appears the actions of the Coral Tridents have finally pushed the Maelstrom too far. It is only a matter of time before the cannon-laden warships of the Lominsan navy set sail for Sahagin territory on the orders of the Admiral herself. Return to Novv's Nursery and report the distressing news to Novv.","In a desperate effort to defuse the volatile situation, the clutchfather suggests that you and he attempt to rescue the abducted councillor yourselves. Your first task will be to uncover exactly where the Coral Tridents are keeping their prisoner. Infiltrate the Serpent's Tongue in western La Noscea, and search the pirates' abode for any written records that appear to document the ambitious plan.","You have found an ale-stained parchment that illustrates what you believe to be the raid on the councillor's ship. Return to Novv's Nursery and have Novv peruse the crumpled document.","After poring over the soiled parchment you retrieved from the Serpent's Tongue, Novv believes he has identified the location of the pirate vessel where the Lominsan official is being held. Speak with Pahh, the seabeast tamer, and borrow an elbst to carry you to the <span class=\"emphasis\">Lost Duchess</span>.","You have successfully slipped aboard the <span class=\"emphasis\">Lost Duchess</span> and located Councillor Turstin. Though shackled─and somewhat shocked at Novv's unexpected appearance─the official appears mercifully unharmed. The clutchfather offers to protect Turstin while you search for a means to free him from his bonds. Defeat the enemies aboard the ship until you find the key to the manacles.","You have liberated the manacle key from the body of a slain Sahagin. Return to Councillor Turstin and unlock his shackles.","After a tense and emotional confrontation, Novv at last convinces Zugg─the leader of the Coral Tridents and Novv's wayward son─of the futility of his warmongering. At Zugg's command, the <span class=\"emphasis\">Lost Duchess</span> sets sail for the nearest shorewalker settlement, and lowers a lifeboat for you and the councillor to row into the western La Noscean port. Speak with Turstin in Aleport, and learn what he intends to do next.","Councillor Turstin expresses his gratitude towards you and Novv for his timely rescue. It appears that the recent experience has changed his perception of the Sahagin as simple, bloodthirsty brutes, and he sympathizes with the clutchfather's trials as a parent. After promising to convince the Admiral to stand down the troops, the Lominsan official hands you a gull feather trinket that is said to represent home and happiness. Deliver the feather to Novv at Novv's Nursery.","You hand the gull feather trinket to Novv, compliments of Councillor Turstin. The clutchfather thanks you for your role in averting war with Limsa Lominsa, and once more speaks fervently of his desire to see a cessation of hostilities between the two long-standing enemies. Though his son Zugg has apparently left on a journey for distant waters, Novv hopes that both he─and you─will someday return to visit the nursery. Return to Maelstrom Command in Limsa Lominsa and make your final report to Commander R'ashaht Rhiki.","Relieved that the need for large-scale conflict has been avoided, R'ashaht Rhiki commends you for your efforts in rescuing the councillor and addressing the Sahagin threat. The commander seems cautiously optimistic about the possibility of brokering a peace with the scaled beastmen, but warns that the looming specter of Leviathan requires the Maelstrom to remain in a constant state of vigilance. You are dismissed for now, but the call to duty may sound at a moment's notice..."],"objectives":["Speak with Falkbryda at Camp Skull Valley.","Speak with Novv at Novv's Nursery.","Search the Serpent's Tongue for a clue to Councillor Turstin's whereabouts.","Deliver the ale-stained parchment to Novv at Novv's Nursery.","Speak with Pahh.","Defeat enemies aboard the ship, and obtain the manacle key from the Coral Sahagin.","Use the manacle key to free Turstin.","Speak with Turstin in Aleport.","Deliver the gull feather trinket to Novv at Novv's Nursery.","Report to R'ashaht Rhiki at Maelstrom Command."],"dialogue":[{"name":"NOVV","text":"Our effortsss to achieve peace may have all been in vain, <span class=\"highlight\">Forename</span>. By undermining Zugg's leadershhhip at that farce of a parley, I'm afraid I have ssstripped away what little ressstraint he had left."},{"name":"NOVV","text":"The Coral Tridentsss have attacked yet another shhhip...and this time they have taken a prisoner."},{"name":"NOVV","text":"Pshhh... While the raid itssself is sssufficient cause for concern, the fools have abducted a high-ranking Lominsan official."},{"name":"NOVV","text":"Now the sssituation is political. If the threat posed by the return of Lord Leviathan weren't enough, then this incident will shhhurely put pressure on the shhhorewalker elders to essscalate their engagement to full-ssscale war!"},{"name":"NOVV","text":"<span class=\"highlight\">Forename</span>, I beg you: you mussst ssspeak with a Maelssstrom commander. It is vital that we learn what plans have been ssset in motion, and if there is aught we can do to contain the damage caused by Zugg's insssanity."},{"name":"NOVV","text":"The nearessst officer of rank will be in Camp Ssskull Valley. You are a mighty hero─perhapsss your words will sssway the Maelssstrom from a path they doubtless do not wishhh to tread."},{"name":"NOVV","text":"Pshhh... Zugg, you arrogant fool. Will you not be sssatisfied until the corpses of our entire race litter the shhhore?"},{"name":"FALKBRYDA","text":"I have no tasks for you at present, adventurer. A recent crisis is demanding our full attention, and it is no simple matter of ousting a nest of belligerent dodos."},{"name":"FALKBRYDA","text":"The Scarlet Sea Devil, an infamous fishback pirate we had long thought perished, has had the temerity to lead an assault on a Lominsan warship. In addition to the heavy casualties they inflicted on the crew, the Sahagin reportedly took prisoner our councillor of coin."},{"name":"FALKBRYDA","text":"Councillor Turstin is one of the Admiral's most trusted advisors, and an essential figure in the day-to-day running of the thalassocracy. His abduction is a blatant act of hostility to which the Maelstrom must give answer─we go to war!"},{"name":"FALKBRYDA","text":"Hm? Have we considered an alternate course of action? There is only one response to this kind of attack─Admiral Bloefhiswyn has already instructed our troops to make ready for a full-scale retaliation."},{"name":"FALKBRYDA","text":"The warships of the armada are assembled and await but the order to set sail."},{"name":"FALKBRYDA","text":"Those savages won't know what hit them! The charts will need to be redrawn after our cannons are done bombarding their shore! Then we'll send in the ground levy─that's us─to mop up any fishbacks that survive the cannons."},{"name":"FALKBRYDA","text":"...Save your breath, adventurer. The fishbacks forfeited any right to negotiation when they laid their slimy talons on a navy vessel. Brute force is the only language they understand!"},{"name":"FALKBRYDA","text":"And while we're rescuing the councillor, mayhap we take the head of the Scarlet Sea Devil into the bargain! Make no mistake─the Maelstrom will see justice done, swift and sure!"},{"name":"NOVV","text":"Pshhh... Ssso, the finless ones will not be deterred from their righteousss courssse."},{"name":"NOVV","text":"No matter who emerges the victor in the coming conflict, ssslaughter will be anssswered with ssslaughter, and our ssspawning grounds shall give birth to naught but death..."},{"name":"NOVV","text":"I can sssee but one way to sssteer us clear of this abyss, <span class=\"highlight\">Forename</span>: you and I rescue the shhhorewalker official ourssselves."},{"name":"NOVV","text":"Before we can attempt to undo this madness, however, we mussst firssst dissscover where the councillor is being held."},{"name":"NOVV","text":"An ambitiousss ssscheme such as this would have required extensssive planning, and Zugg likely provided his Ssserpent Reaver lackeys with sssome manner of written instruction."},{"name":"NOVV","text":"A sssearch of the Ssserpent's Tongue may provide usss with the information we need. Quickly now, <span class=\"highlight\">Forename</span>! Time is of the essence!"},{"name":"NOVV","text":"Make your way to the Ssserpent's Tongue, and sssearch the abode of the finless piratesss for any record of the assault plans. We mussst learn where Zugg is holding the Lominsan!"},{"name":"NOVV","text":"Pshhh... Your sssearch, <span class=\"highlight\">Forename</span>, was it successful?"},{"name":"NOVV","text":"Ah, yesss─the parchment is sssoiled, but I can ssstill make out the words. They planned to keep the councillor prisoner aboard the <span class=\"emphasis\">Lost Duchess</span>, one of the Reavers' own shhhips."},{"name":"NOVV","text":"I do not know if these were Zugg's final inssstructions, but we have no time to assume otherwise. Ride an elbssst out to where the pirate vessel is sssaid to have dropped anchor, and take the crew by sssurprise!"},{"name":"NOVV","text":"Though I do not ssswim quite so ssswiftly as one of Pahh's ssseabeasts, trussst that I will not be far behind."},{"name":"NOVV","text":"Pshhh... Take an elbssst from the nursssery, and make hassste for the <span class=\"emphasis\">Lost Duchess</span>. I will sssoon join you on the deck."},{"name":"TAMER01376","text":"The clutchfather bid me ready my swiftessst elbssst. Be sure to hold on tightly, shhhorewalker!"},{"name":"Q1","text":"Mount the elbst?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"TURSTIN","text":"Release me, you fiends! Do you know who I am!?"},{"name":"SAHUAGIN01377","text":"(-Coral Trident Warrior-)Pshhh... Shhhilence, shhhorewalker! Try to eshhhcape, and I'll shhhlice gills into your neck! Maybe then you'll be able to breathe underwater! Pshhhahaha!"},{"name":"TURSTIN","text":"You think me cowed by simple threats? We Lominsans will not be intimidated by your base savagery!"},{"name":"SAHUAGIN01377","text":"(-Coral Trident Warrior-)You try my patience, finleshhh one! Continue your shhhquawking, and I'll drop you over the rail!"},{"name":"SAHUAGIN01377","text":"(-Coral Trident Warrior-)Pshhh! You!? But how...!?"},{"name":"TURSTIN","text":"Aha! My rescuers have arrived...at...last... Wh–Who are you!? You're not a Maelstrom soldier. What in the Navigator's name is going on here!?"},{"name":"NOVV","text":"Pshhh... <span class=\"highlight\">Forename</span>!"},{"name":"NOVV","text":"I will defend the councillor while you liberate the key to his shhhackles. One of these Coral Trident zealotsss mussst carry it!"},{"name":"BALLOON","text":"Your bloated corpshhhe will feed the shhharks, shhhorewalker!"},{"name":"BALLOON","text":"Ceashhhe your shhhtruggling, finleshhh one!"},{"name":"Q2","text":"Return to Novv's Nursery?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"NOVV","text":"I will defend the councillor while you liberate the key to his shhhackles. One of these Coral Trident zealotsss mussst carry it!"},{"name":"TURSTIN","text":"Why has this Sahagin come to my aid? Am I to trade one captor for another?"},{"name":"TURSTIN","text":"My thanks! Those manacles were beginning to chafe! Now, I can see that you are some manner of sellsword, but I'm not quite sure what to make of this, er, scaled gentleman. A friend of yours?"},{"name":"NOVV","text":"We are not free of thisss yet! Ssstay clossse to me, lessst you be tossed overboard!"},{"name":"ZUUG","text":"Pshhh... It ssseems that the mantle of the Ssscarlet Sssea Devil will not sssit firmly upon my shhhoulders until I have sssent you to the depthsss..."},{"name":"NOVV","text":"Zugg... Do you realize what is at ssstake here? Your reckless ambition endangers the fate of our entire tribe! The shhhorewalkers ready their armada even as we ssspeak!"},{"name":"ZUUG","text":"Does the thought of war with the finless ones now frighten you ssso? Let them come! My anticsss are as a ssspawnling's missschief compared to the mayhem you once committed!"},{"name":"ZUUG","text":"Pshhh! Ready your ssspear, old one! Let us sssee if the years have ssstolen your ssskill as well as your ssspine!"},{"name":"ZUUG","text":"Hurk!"},{"name":"NOVV","text":"Pshhh... The wound is not fatal...though it might leave a nasssty ssscar."},{"name":"ZUUG","text":"Pshhh! I do not asssk...for your pity! &lt;gasp&gt; Finishhh it now! Kill me!"},{"name":"NOVV","text":"Shhhow me a parent who can kill his own child. Sssahagin blood ties run deeper than the mossst abyssal sssea trench."},{"name":"NOVV","text":"You beg for the impossible─I will not ssslay my own ssson."},{"name":"ZUUG","text":"I rejected you...as my clutchfather!"},{"name":"ZUUG","text":"Why? Why did you...throw away all that you had become? &lt;gasp&gt; Why did you not ssseek vengeance on the shhhorewalkers who wronged us!?"},{"name":"NOVV","text":"You know the anssswers to those quessstions."},{"name":"NOVV","text":"Shhhurely you have not forgotten what befell your ssspawnbrothers? At my ssside you ssstood, the only sssurviving hatchling, and shhhed a river of tears for your ssslain clutchmatesss."},{"name":"ZUUG","text":"Pshhh... Yesss, I wept for them! And made them a promissse!"},{"name":"ZUUG","text":"I would avenge their deathsss with the blood of a thousand shhhorewalkers! &lt;gasp&gt; I would grow into a warrior both mighty and terrible to behold─the Ssscarlet Sssea Devil reborn! I would do what <span class=\"emphasis\">you</span> would not..."},{"name":"NOVV","text":"You cannot protect that which you love with a name, no matter how fearful. It took the greatessst tragedy of my life to open my eyes to that truth."},{"name":"NOVV","text":"Pshhh... Zugg. I would ssspare you that pain again. I would have you be the future our people need."},{"name":"NOVV","text":"I only want what is bessst...for <span class=\"emphasis\">all</span> my sssons."},{"name":"ZUUG","text":"Clutchfather..."},{"name":"ZUUG","text":"Pshhh... Weigh anchor and take the helm. We make for the nearessst shhhorewalker port. Prepare a boat to take our...guessst ashore."},{"name":"TURSTIN","text":"<span class=\"highlight\">Forename</span>, was it? My thanks again. Were it not for you and your Sahagin acquaintance, I would still be rubbing my wrists raw trying to escape those infernal shackles!"},{"name":"TURSTIN","text":"'Twould seem I have been laboring under a misconception: I was convinced that all Sahagin─all beastmen, in fact─were naught but bloodthirsty, murdering savages, with not the slightest concept of peace or compromise."},{"name":"TURSTIN","text":"But after meeting...Novv, did you call him? Intriguing fellow. Yes, well, after witnessing his exchange with his son, I see now that our “fishback” enemies are far more complicated than our bedtime tales of horror would lead us to believe."},{"name":"TURSTIN","text":"I have three younglings of my own, you see. And I am quite eager to hurry home and reassure them that their father is very much alive and well."},{"name":"TURSTIN","text":"Before I do so, however, I shall contact the Admiral and convince her to rescind the order to attack. 'Twill not be an easy task, but as the man who holds the nation's purse strings, my words carry a certain weight. Hm hm. ...Oh, and here."},{"name":"TURSTIN","text":"Gulls are often a welcome sight on ships, as their presence means land─and home─is close by. La Noscean sailors began gathering the feathers dropped on deck, and fashioning them into trinkets to give to their children as a symbol of hearth and happiness.<br>I would be grateful if you could see that feather into your Sahagin friend's hands."},{"name":"TURSTIN","text":"Beastman or no, I have seen that any father wishes the same things for his offspring. Perhaps, in time, we shall find more common ground between our peoples. I only hope that it will not require the threat of imminent war to bring such future revelations to light! Ahahaha!"},{"name":"NOVV","text":"<span class=\"highlight\">Forename</span>, I have no words to thank you. Without your aid, I do not think war with the shhhorewalkers could have been avoided."},{"name":"NOVV","text":"Pshhh... Zugg has disbanded the Coral Tridentsss, and is ssset on traveling for a time. Among all of my offssspring, he is the mossst like me─the mossst determined and ssstubborn. I sssense he is hesssitant to return to the nursssery."},{"name":"NOVV","text":"But return he will, in time. And when he does, I hope to sssee him a ssstronger and wiser Sahagin than I ever was. Sssuch pleasant thoughtsss will sssustain me while I raise his unruly ssspawnbrothers."},{"name":"NOVV","text":"Pshhh... The councillor wished me to have this? I sssee... A gift from parent to child─a symbol of joy and family."},{"name":"NOVV","text":"Ssso many of my offssspring were ssslain by shhhorewalkers. The rage ssspawned by that act will never fully leave me."},{"name":"NOVV","text":"But it is as nothing compared to the desire I feel to protect my sssurviving ssspawnlings."},{"name":"NOVV","text":"I pray that this trinket can one day represent not just the bond between parent and child, but also the birth of underssstanding between our peoples."},{"name":"NOVV","text":"Pshhh... You have achieved more for this cause than I could have dared hope."},{"name":"NOVV","text":"In the days to come, I only asssk that you do not forget usss, finless one. Whenever thoughts of vengeance ssseek to consssume you, remember this nursssery, and remember me and my ssspawnlings."},{"name":"NOVV","text":"And shhhould you choose to visit, you will always be welcome here. You are no longer sssome ssstrange shhhorewalker─to us, you are “clutchmate.”"},{"name":"NOVV","text":"Pshhh... Visit us from time to time, <span class=\"highlight\">Forename</span>, and fill my ssspawnlings' heads with tales of the wider world. Perhapsss you will even develop a tassste for Sssahagin feasssts, yesss? Pshhhahaha!"},{"name":"RASHAHT","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>! It seems that business with the Sahagin became rather more involved than anyone expected, eh? Maelstrom Command very much resembled the writhing chaos of our namesake once word of Councillor Turstin's abduction sparked the call to war."},{"name":"RASHAHT","text":"'Tis fortunate that our marching orders were rescinded ere we launched our attack. There are none in our ranks that fear to step upon the field of battle, but any day that ends without bloodshed is a good day."},{"name":"RASHAHT","text":"And I hear that you yourself were responsible for the councillor's timely release. I like to think that my eye for enlisting talented veterans played some small part in the way events played out!"},{"name":"RASHAHT","text":"So, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>, you've averted a war, and rescued a high-ranking official─not a bad result, all told."},{"name":"RASHAHT","text":"But we must remain vigilant. While we welcome the possibility of peaceful coexistence with the Sahagin, we cannot ignore the threat that the primal Leviathan yet presents."},{"name":"RASHAHT","text":"For the nonce, however, you have earned a respite from duty. On behalf of the Maelstrom, I commend you for your courageous actions and judicious diplomacy. ...Ah, might you consider a bath during your well-deserved rest? I seem to detect the <span class=\"emphasis\">slightest</span> scent of rotting crabmeat..."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with Novv's Clutch."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Novv's Clutch vendor."},{"name":"POPMESSAGE","text":"The sounds of battle have drawn out a Sahagin superior from belowdecks!"},{"name":"TAMER01376","text":"The clutchfather bid me ready my swiftessst elbssst. Be sure to hold on tightly, shhhorewalker!"}],"reward":{"gil":1184,"xp":13965},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}],"quests":[66913]}},"partials":[{"type":"npc","id":"1005937","obj":{"i":1005937,"n":"Novv","l":33,"q":8,"t":"Clutchfather"}},{"type":"npc","id":"1003281","obj":{"i":1003281,"n":"R'ashaht Rhiki","l":28,"q":13,"t":"Storm Commander"}},{"type":"npc","id":"1005946","obj":{"i":1005946,"n":"Pahh","l":33,"q":13,"t":"Seabeast Tamer"}},{"type":"npc","id":"1006614","obj":{"i":1006614,"n":"Falkbryda","l":33,"q":14,"t":"Storm Commander"}},{"type":"npc","id":"1008921","obj":{"i":1008921,"n":"Novv","l":33,"q":1,"t":"Clutchfather"}},{"type":"npc","id":"1008922","obj":{"i":1008922,"n":"Councillor Turstin","l":33,"q":1}},{"type":"npc","id":"1008923","obj":{"i":1008923,"n":"Councillor Turstin","l":33,"q":1}},{"type":"quest","id":"66913","obj":{"i":66913,"n":"Watching the Spawn","g":40,"l":"Western La Noscea","s":0,"f":1}}]}