{"quest":{"name":"Clutch and Kin","location":"Western La Noscea","id":66911,"patch":2.2,"sort":0,"icon":100240,"beast":4,"unlocksFunction":1,"eventIcon":71341,"issuer":1005937,"target":1005937,"involved":[1005940,1008897],"genre":40,"journal":["Clutchfather Novv needs your help to rein in one of his spawnlings.","Novv is concerned that his foolish son, Pyuu, has set off to reason with the notoriously violent Coral Tridents. With his claws full minding the rest of the clutch, the clutchfather asks that you save his offspring in his stead. Speak with Seww, another of Novv's spawnlings, and learn where you must go to rescue the reckless Pyuu.","Seww fears that his younger clutchmate, Pyuu, heads to almost certain death at the spears of the Coral Tridents. Make your way towards the Sahagin Landbase found near Halfstone in western La Noscea, and find the wayward spawnling.","Just as his clutchmate had feared, Pyuu's clumsy attempt to parley with the Coral Tridents has erupted into violence. Defeat the Trident warriors, and extricate the young Sahagin from his unpleasant predicament.","You have rescued Pyuu from his savage kin. According to the contrite spawnling, he merely wished to practice the teachings of his clutchfather, and did not expect such a brutally dismissive reception. Return to Novv's Nursery and report your success to Novv himself.","After thanking you for your kindness, Novv explains the dilemma that threatens the future of his race. The clutchfather is adamant that conflict with the “shorewalkers” will only hinder his people's efforts to secure a safe spawning ground in which to raise the next generation of Sahagin. Help bring about a more peaceful future for beastmen and shorewalkers alike by aiding Novv and his clutch in their struggles to contain the Coral Trident fanatics."],"objectives":["Speak with Seww.","Search for Pyuu.","Rescue Pyuu.","Speak with Novv."],"dialogue":[{"name":"NOVV","text":"Pshhh... You witnessed the aftermath of the attack in the Ssstrait of Merlthor? Yesss, it was indeed perpetrated by Sssahagin."},{"name":"NOVV","text":"The individuals resssponsible are called the Coral Tridents. They reside in the Sssapsa Ssspawning Grounds, and are known among our people as a volatile and fanatical faction."},{"name":"NOVV","text":"We had hoped to prevent them from ever reaching that vessel, but alasss, the current was not in our favor. Foolishness... Their actions only invite further violence through retaliation."},{"name":"NOVV","text":"And what of Novv and his clutch, you ask? We live apart from the ssspawning grounds, and pursssue a ssseparate agenda."},{"name":"NOVV","text":"I do not claim to underssstand the ssstructure of your civilization, but for us Sahagin, each clan of clutchmatesss is led by a single clutchfather."},{"name":"NOVV","text":"The Indigo Matriarch─what you might call our “queen”─bessstows each clutch of her eggs upon only the bravest and most ssseasoned warriors. It is then a clutchfather's duty to raise and inssstruct his charges in the ways of our people."},{"name":"NOVV","text":"Pshhh... But for this cycle to continue, the matriarch must have a sssecure environment in which to bear her offssspring. That is why we chose to make this land our home."},{"name":"NOVV","text":"It is unfortunate, then, that the Sssapsa Ssspawning Grounds have become the locus of sssuch conflict. If only more shhhorewalkers were like you, and ssspent a moment to understand our sssitua─"},{"name":"SEWW","text":"Clutchfather! I need your counshhhel!"},{"name":"NOVV","text":"Pshhh... What have I taught you, Seww? A Sssahagin does not flail and sssplash about so─he rolls with the waves, and rides the currentsss."},{"name":"SEWW","text":"Forgive me, Clutchfather, I─ Pshhh. It is Pyuu, our sixth-youngeshhht brother."},{"name":"NOVV","text":"What of him?"},{"name":"SEWW","text":"Pshhh! He has left the nurshhhery without permishhhion! He shhhpoke of talking shhhense into the Coral Tridents!"},{"name":"NOVV","text":"Pshhh... His brain is as sssoft as his ssspawnling ssscales. And this at a time when I cannot afford to take my eyes off the ressst of the clutch."},{"name":"NOVV","text":"Though our ssstance towards each other is not yet clear, shhhorewalker, I would ask a boon of you: sssave my foolish ssson. Seww here will have more to say on the sssubject, I am sure."},{"name":"NOVV","text":"Let us ssspeak more on the fate of our peoples when you return. Seww will explain where you are likely to find my disssobedient offssspring...or what remains of him, at least."},{"name":"SEWW","text":"You have no shhhcales, and yet the clutchfather shhheems to trust you. I shall do the shhhame."},{"name":"SEWW","text":"As you just heard, my brother Pyuu has taken it upon himshhhelf to educate the Coral Tridents."},{"name":"SEWW","text":"He is one of our more impetuous shhhpawnbrothers, and yet young─he does not realize the peril he puts himshhhelf in! The Tridents will not listen to Pyuu's reasoning. They will laugh as they impale him on their shhhpears!"},{"name":"SEWW","text":"Please, bring Pyuu back shhhafely to the nurshhhery. By now, he must be some distance across the Landbase, closer to North Tidegate."},{"name":"SEWW","text":"Pshhh! Pyuu likely believes himshhhelf the clutchfather's shhhpecial emishhhary. I fear his reception will be far less diplomatic than he anticipates!"},{"name":"BALOON","text":"（★未使用／削除予定★）"},{"name":"BALOON","text":"（★未使用／削除予定★）"},{"name":"BALOON","text":"（★未使用／削除予定★）"},{"name":"BALOON","text":"（★未使用／削除予定★）"},{"name":"SAHUAGINA01375","text":"(-Halfstone Shoalscale-)Away with you, finless one!"},{"name":"SAHUAGINB01375","text":"(-Halfstone Shoalclaw-)This concerns you not, shhhorewalker!"},{"name":"BALOON","text":"（★未使用／削除予定★）"},{"name":"PYUU","text":"Ressscued by a shhhorewalker... What am I to tell Clutchfather Novv? Hm? Ssspawnbrother Ssseww bid you come to my aid?"},{"name":"PYUU","text":"Pshhh... I do not underssstand these Coral Trident warriors. I ssscarce opened my maw before they proceeded to beat me bloody!"},{"name":"PYUU","text":"The clutchfather always sssays that the currentsss of discussion carry us to enlightenment, but it ssseems the words of a ssspawnling count for little and less."},{"name":"PYUU","text":"I sssimply wanted to put into practice what my clutchmatesss and I had been taught. Now, I shhhurely face a punishhhment in addition to my beating..."},{"name":"NOVV","text":"Welcome back, shhhorewalker. You are kind to endanger yourssself, though you owe us no sssuch loyalty. Pyuu will be appropriately disciplined for his reckless actionsss."},{"name":"NOVV","text":"Now, more than ever, the Sssahagin must act with caution and wisdom. Many of our people reside peacefully within our city in the Indigo Deep, but our civilization faces a sssteady and treacherousss decline."},{"name":"NOVV","text":"We <span class=\"emphasis\">must</span> venture onto land to sssecure ssspawning grounds to lay our eggs, and build nurssseries to raise our young. It is an essential element of our breeding cycle─an inssstinct too powerful to ignore."},{"name":"NOVV","text":"Our traditional ssspawning grounds were, however, annihilated in the Calamity. Thus were we forced to seize this new location─the region the finless ones call “wessstern La Noscea.”"},{"name":"NOVV","text":"Pshhh... It is not sssurprising that the shhhorewalkers view our sssudden aggressive expansion as naught more than an invasion. But this ssseemingly unprovoked attack on their territory is, in truth, a desperate ssstruggle for sssurvival."},{"name":"NOVV","text":"Without this land, without a place to rear offspring, the Sssahagin race is doomed. We are in no position to wage war againssst the shhhorewalkers! We mussst attempt a parley, and learn to exist ssside by ssside!"},{"name":"NOVV","text":"The Coral Tridentsss, as you have no doubt realized, do not comprehend the meritsss of a diplomatic approach. They ssseek only to control the weak of mind─those like their brutal Ssserpent Reavers─and ssslaughter all others who oppose them."},{"name":"NOVV","text":"Pshhh... Do not missstake me as a traitor to my kind─I hold no love for finless ones. I shhhed no sssalty tears when the great Leviathan is sssummoned and the Lord of the Whorl gathers new drowned shhhorewalkers to His fold."},{"name":"NOVV","text":"But conflict with your peoples is not the answer to our woes! We mussst look beyond the present, and enshhhure calmer waters─waters in which the future of our race can thrive."},{"name":"NOVV","text":"Shhhorewalker, your arrival is a precious gift. I would have you become the first ssstone in the bridge I hope to build between our peoples...and the rock which bluntsss the mindless ssspears of the Coral Tridentsss. I pray you, lend us your aid."},{"name":"Q1","text":"Lend your aid to Novv's Clutch?"},{"name":"A1","text":"I swear myself to your noble cause. Pshhh."},{"name":"A1","text":"I don't believe I can trust you."},{"name":"NOVV","text":"Your presence is mossst welcome, shhhorewalker! My warriors are eager, but lack the experience to engage such vicious opponentsss as the Coral Tridents."},{"name":"NOVV","text":"We will halt the zealots' advance at the shhhoreline, and begin to repair the damage they have done to our chance at peace. There is much work ahead, but together we can put an end to this meaningless bloodshhhed!"},{"name":"NOVV","text":"Pshhh... It is unfortunate you harbor sssuch doubts."},{"name":"NOVV","text":"But I underssstand your position─my kind has done much to earn your missstrust. It is my hope that one day you will return that we might prove our willingness to prevent thisss war-driven plunge into oblivion."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Neutral</span> reputation with Novv's Clutch."},{"name":"SYSTEM","text":"Sahagin tribal quests are now available from Fyuu at Novv's Nursery."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from the Novv's Clutch vendor."},{"name":"POP","text":"（★未使用／削除予定★）"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"RECTERROR","text":"（★未使用／削除予定★）"}],"reward":{"gil":729,"xp":12190},"reqs":{"jobs":[{"lvl":44,"id":34}],"quests":[66910]},"next":[66912]},"partials":[{"type":"npc","id":"1005937","obj":{"i":1005937,"n":"Novv","l":33,"q":8,"t":"Clutchfather"}},{"type":"npc","id":"1005940","obj":{"i":1005940,"n":"Seww","l":33,"q":13}},{"type":"npc","id":"1008897","obj":{"i":1008897,"n":"Pyuu","l":33,"q":1}},{"type":"quest","id":"66910","obj":{"i":66910,"n":"They Came from the Deep","g":40,"l":"Limsa Lominsa","s":0,"f":1}},{"type":"quest","id":"66912","obj":{"i":66912,"n":"The Scarlet Bloodletter","g":40,"l":"Western La Noscea","s":0,"f":1}}]}