{"quest":{"name":"Enemy at the Tidegates","location":"Western La Noscea","id":66917,"patch":2.2,"sort":13,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005938,"target":1005938,"involved":[1005937],"genre":41,"journal":["Fyuu wishes to recruit you for a spot of sabotage.","It appears the Coral Tridents have developed a new form of siege weaponry through the sorcerous transformation of giant, lightning-spitting shellfish. Infiltrate the Sahagin Landbase, and destroy these organic ballistas before they can be used to bring down the tidegates.","You have destroyed the whelk ballistas. Return to Fyuu at Novv's Nursery and report your success.","Fyuu is relieved to hear that the siege weapons of the Coral Tridents have been neutralized. The young Sahagin laments the shortsightedness of his violent kin, claiming that the existence of the tidegates allows them to continue peaceful cultivation of the spawning grounds by preventing full-scale engagements with their enemies."],"objectives":["Destroy whelk ballistas.","Report to Fyuu."],"dialogue":[{"name":"FYUU","text":"The territories of the Sssahagin and the shhhorewalkers are firmly divided by the north and sssouth tidegatesss."},{"name":"FYUU","text":"If my kin ever hope to expand their hold on this land, they will need to bring those towering walls crashhhing down. This is, in fact, the firssst and mossst crucial objective for the Coral Tridentsss."},{"name":"FYUU","text":"Thusss they have developed a new kind of...what is the shhhorewalker word? Ah, “ballisssta.” There are giant shhhellfish that sssubdue their prey with shhhocking bolts of energy, and the Tridentsss have used foul sssorcery to warp these creatures into devastating sssiege weapons!"},{"name":"FYUU","text":"They have already transssported a number of these weapons to the Landbase, and plan to commence a full-ssscale assault. Pshhh... You must dessstroy the ballissstas before they are put into position."},{"name":"FYUU","text":"Naturally, the Tridentsss will not easily sssurrender their new toys. Do what you mussst, but we cannot allow them to realize their shhhortsighted ambitions!"},{"name":"FYUU","text":"Pshhh... Dessstroy those ballissstas before they are put into position! Cut down any Coral Tridentsss that ssseek to bar your path!"},{"name":"FYUU","text":"Fine work, finless one! The tidegates are sssafe from the Tridentsss for the time being."},{"name":"FYUU","text":"Those foolish warmongers underssstand not what they ssseek to dessstroy. While those barriers are in place, neither ssside can commit their full forces─leaving us free to complete the cultivation of our ssspawning grounds."},{"name":"FYUU","text":"Pshhh... Progress towards peace will come at a trickle, not a sssudden flood. For now, we mussst preserve anything that keepsss our peoples at a comfortable dissstance."}],"reward":{"gil":540,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":1,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005938","obj":{"i":1005938,"n":"Fyuu","l":33,"q":11}},{"type":"npc","id":"1005937","obj":{"i":1005937,"n":"Novv","l":33,"q":8,"t":"Clutchfather"}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}