{"quest":{"name":"A Killer Strategy","location":"Western La Noscea","id":66915,"patch":2.2,"sort":17,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005938,"target":1005938,"genre":41,"usedItems":[7798],"journal":["Fyuu wishes to make some lethal adjustments to the battle plans of the Coral Tridents.","Fyuu has learned that Voll the Sharkskinned, a proven tactical genius, has been recruited to the Coral Trident cause. Surmising that the Tridents plan to launch a major assault on their finless enemies, the young Sahagin requests that you disrupt their schemes by slaying their new strategist. Participate in the FATE “Sharknado” in Halfstone, and present proof of your deed to Fyuu.","You deliver the coral armband to Fyuu. Satisfied that Voll the Sharkskinned is no more, the spawnling praises the courage you have shown in sabotaging the plans of the Tridents."],"objectives":["Deliver the coral armband obtained in the FATE “Sharknado” to Fyuu."],"dialogue":[{"name":"FYUU","text":"Pshhh... Matters have taken a turn for the worssse, shhhorewalker. The Coral Tridentsss have sssecured the ssservices of Voll the Sharkssskinned, a Sssahagin known for his tactical brilliance."},{"name":"FYUU","text":"The only reason they would employ a ssstrategist of his caliber would be to plan a major assault on the shhhorewalker position."},{"name":"FYUU","text":"Fortunately, sssuch ssschemes are easily disssrupted. Ssslay Voll, and their ambitious attack is dessstined to fail."},{"name":"FYUU","text":"The tactician shhhould be in possession of a coral armband─a physical sssymbol of his new allegiance. Bring the bracelet to me, and I shhhall know you have sssucceeded in your tasssk."},{"name":"FYUU","text":"Pshhh... Ssslay Voll, and bring me the armband he wears!"},{"name":"FYUU","text":"Pshhh! There are patches of scarlet on this bracelet, shhhorewalker. I hope this is Voll's blood and not your own!"},{"name":"FYUU","text":"With the loss of their tactician, the Coral Tridentsss will have no choice but to rethink their attack plans. I am...impressed. What you lack in fins, you make up for in courage."}],"reward":{"gil":540,"reputation":10,"items":[{"num":5,"id":28},{"id":21072}],"xp":9142},"reqs":{"beastrank":1,"jobs":[{"lvl":44,"id":34}]}},"partials":[{"type":"npc","id":"1005938","obj":{"i":1005938,"n":"Fyuu","l":33,"q":11}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"7798","obj":{"i":7798,"n":"Coral Armband","l":1,"c":55632,"t":61}}]}