{"quest":{"name":"Ballista Bust-up","location":"Western La Noscea","id":66929,"patch":2.2,"sort":24,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"genre":41,"journal":["The gears of war turn inexorably in the Sapsa Spawning Grounds, but Houu hopes that an opportune act of sabotage may gum up the works.","New siege engines stand under guard at the Sapsa Spawning Grounds, bound for the front and destined to claim scores of lives. Houu has chosen you among all others to destroy at least two of these fresh whelk ballistas, no matter the cost.","You have obliterated two of the ballistas, though you cannot help but worry that more will soon take their place. Return at once to Houu to hear his opinion on the matter.","Though Houu is well pleased at the success of your mission, he is less enthused when he learns that the Tridents have gathered a larger force in the area than first thought. He hopes that your deeds will give the Tridents pause, but you get the distinct impression that there will be much more to do to maintain the peace..."],"objectives":["Destroy fresh whelk ballistas.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"Pshhh... Pshhh... The Coral Tridents have built new shhhiege engines. A whelk on the wheeled base built by the Shhherpent Reavers. Just one will devastate shhhorewalker defenses, but there are shhheveral..."},{"name":"HOUU","text":"I have heard tell of these shhhellfish. An incredible shhhight it is shhhaid to be, the energy bolts they throw lighting up the Indigo Deep in a shhhearing flash."},{"name":"HOUU","text":"The ballistas have only just been unloaded, but to the front they will go, and shhhoon. They must be destroyed now before they can be used. I shhhudder to think of the devastation they will wreak. Pshhh..."},{"name":"HOUU","text":"It falls to you to wreck the ballistas. They will be guarded and I fear bloodshed cannot be avoided. Pshhh..."},{"name":"HOUU","text":"Pshhh... Destroy at least two of the fresh whelk ballistas in the Sapsa Spawning Grounds. There will be guards, but...do what you mushhht."},{"name":"HOUU","text":"Pshhh! Your return can only mean the ballistas have been─<br>...What's thishhh, you shhhay? More were there than even I shhhaid? These are ill tidings, shhhorewalker."},{"name":"HOUU","text":"I would like to think your actions have instilled shhhome amount of fear in the Coral Tridentshhh, and that is what we need. If even a closely guarded weapon is not shhhafe, how shhhafe can their warriors be? But shhhtill, it would shhheem we yet have a long way to go..."}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}