{"quest":{"name":"Get a Lode of This","location":"Western La Noscea","id":66928,"patch":2.2,"sort":23,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"genre":41,"journal":["Houu may prefer not to deal with finless ones, but he has wisdom enough to see the merits of employing one shorewalker to kill another.","Serpent Reavers have been guiding the Coral Tridents to trading vessels, and Houu does not like what easy prey these ships have become. An ambush point has been staked out at the approach to the Sapsa Spawning Grounds, where these seamen are due to appear. Slay three drowned seamen.","You have dealt with the drowned seamen accordingly. Return to Houu in Novv's Nursery and inform him that the trading vessels should sail in more safety for the time being.","Houu receives the news of the Reavers' deaths with a gladness most lugubrious. You may be a shorewalker, but as long as you are available to dispatch the more belligerent members of your species, you will be welcome at Novv's Nursery."],"objectives":["Lie in wait for Serpent Reaver seamen at the approach to the Sapsa Spawning Grounds.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"It is a fact that the Shhherpent Reavers aid the Coral Tridents to attack trading shhhips... They guide the Tridents right to where the shhhips will be moshhht vulnerable."},{"name":"HOUU","text":"The Reavers and these prey may be shhhorewalkers both, but...it lies ill with me and my shhhpawnbrothers when the Tridents profit in any way. Pshhh..."},{"name":"HOUU","text":"These Reaver shhheamen who bespeak the Tridents...they are due to shhhojourn from the Shhherpent's Tongue to the Shhhapsa Shhhpawning Grounds. Shhhuitable for an ambush, I think...right at the approach to the grounds..."},{"name":"HOUU","text":"Pshhh... Lay an ambush at the approach to the Shhhapsa Shhhpawning Grounds... It shhherves us both to see those Reaver shhheamen shhhilenced."},{"name":"HOUU","text":"The Reavers shhhleep with the fishes? Good... They will guide no more Trident attacks. Pshhh..."},{"name":"HOUU","text":"Shhhodden or dry, I say shhhorewalkers are not to be trusted. I weep not for any shhhorewalker shhhips lost, but...the clutchfather shhhpeaks of keeping our eye on the prize..."},{"name":"HOUU","text":"War is the enemy, and these ties between the Tridents and shhhorewalker pirates lash the shhhea to greater tumult... Pshhh..."},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"BALLOON","text":"We'll make mincemeat out o' ye!"},{"name":"BALLOON","text":"A landlubber, aye? Drag ye into the sea, we will!"},{"name":"BALLOON","text":"I'll see ye to a watery grave!"}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}