{"quest":{"name":"One Night in Amdapor","location":"Gridania","id":66925,"patch":2.2,"sort":500,"icon":112042,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1008543,"involved":[1006751],"genre":92,"journal":["Brother E–Sumi–Yan would like a word on behalf of a most illustrious client.","The magicks entombing the Lost City of Amdapor have recently faded, and the darkness within grows restless. Brother E–Sumi–Yan would have you still its stirring, and in his subtlety, has sent you to consult with Seedseer Raya–O–Senna. Make your way to Camp Tranquil in the South Shroud, where the Padjal awaits.","The Seedseers Raya–O–Senna and her brother, A–Ruhn–Senna, apprise you of the darkness that has emerged within Amdapor. Suffice it to say, it falls to you to vanquish the fell presence. To venture into the lost city, speak with Alphene, the Wood Wailer stationed at the entrance in the South Shroud.","From Alphene, you learn that the great gates he guards offer a way into the lost city. By all accounts, what awaits you is hideously dangerous and likely to be revolting. Meet the corruption in Amdapor with your loins girt!<br><br>※The Lost City of Amdapor can be accessed via the Duty Finder."],"objectives":["Speak with Raya–O–Senna at Camp Tranquil.","Speak with Alphene outside the Lost City of Amdapor."],"dialogue":[{"name":"ESUMIYAN","text":"It is well that you are here, <span class=\"highlight\">Forename</span>. An ancient darkness is arisen in these woods, and we shall need all your arts to counter it."},{"name":"ESUMIYAN","text":"We are like to need your courage, <span class=\"highlight\">Forename</span>, for the woods are unquiet and the earth turns sour."},{"name":"ESUMIYAN","text":"It is well that you are here, <span class=\"highlight\">Forename</span>. Some burdens are too heavy to bear even for those so favored to abide. Know that you were chosen as much for your true heart as your skill."},{"name":"ESUMIYAN","text":"I speak to you in the name of the three Seedseers. The eldest, Kan–E–Senna, you will already know as the guardian of our fair land. Two siblings has she."},{"name":"ESUMIYAN","text":"It is the younger of this pair, A–Ruhn–Senna, who hears the voice of the elementals with greatest clarity. And what he has heard lately is troubling indeed..."},{"name":"ESUMIYAN","text":"These dark stirrings we have traced to the Lost City of Amdapor in the South Shroud. The city once throve in the fullness of magic during the Fifth Astral Era, but it was sealed in the wake of its demise."},{"name":"ESUMIYAN","text":"Alas, the Twelveswood has been out of balance since the Calamity. So riotous has its aspect become that the seal was severely weakened. When this happened, the forest surrounding the city began to wither and die. We would enjoin you to investigate the cause."},{"name":"ESUMIYAN","text":"Now, I must confess that this is a task for the Twin Adder...normally. But you are the heir to Master A–Towa's legacy, and the Seedseers were unanimous in the belief that no one is better suited to the undertaking. Will you not assist?"},{"name":"ESUMIYAN","text":"Now, I must confess that this is a task for the Twin Adder...normally. But we do not live in normal times, <span class=\"highlight\">Forename</span>. The company is spread thin, and you are stout with success. Will you not assist?"},{"name":"ESUMIYAN","text":"It is well that you assent, for the need is great! Go now to Seedseer Raya–O–Senna at Camp Tranquil, and listen well to what she says of her brother's divination."},{"name":"RAYAOSENNA","text":"Ah, a white mage after my own heart, come to help get to the bottom of this noisome business!"},{"name":"RAYAOSENNA","text":"Ah, a white mage come to help get to the bottom of this noisome business!"},{"name":"RAYAOSENNA","text":"Ah, here about that cursed pile of rocks they call the Lost City of Amdapor, I assume? I am Raya–O–Senna, sister to the Elder Seedseer."},{"name":"RAYAOSENNA","text":"Hm, Brother E–Sumi–Yan hasn't told you much, has he? Discretion is the better part of <span class=\"emphasis\">his</span> valor! Well, aside from Amdapor Keep, the city is all that remains of an advanced magical civilization from the Fifth Astral Era."},{"name":"RAYAOSENNA","text":"No records survive of how the city met its end, but the elementals tell us all was undone by what the great one calls “an unclean presence.”"},{"name":"RAYAOSENNA","text":"I fear that what my brother senses is this very thing, its satedness drained away after so many centuries. If it hungers for another city to slake its thirst on..."},{"name":"ARUHNSENNA","text":"(-???-)I'll take it from here, Sister!"},{"name":"RAYAOSENNA","text":"Manners, A–Ruhn─we've spoken of this. <span class=\"highlight\">Forename</span>, you've met my younger brother, A–Ruhn–Senna. You will have to excuse him, forestborn lout that he is at times."},{"name":"RAYAOSENNA","text":"There you are, Brother! Why must you dawdle so and leave the tedious explanations to me? Now, convey all you've felt to this artful adventurer!"},{"name":"RAYAOSENNA","text":"My apologies for the urgent summons, <span class=\"highlight\">Forename</span>, but the darkness that stirs in Amdapor behind the barrier waits not on our convenience."},{"name":"ARUHNSENNA","text":"My sister paints me as a bumbling rustic, but I assure you, I'm nothing of the sort! I'm simply <span class=\"emphasis\">attuned</span> to something greater. Which brings us to that darkness stirring in Amdapor behind the barrier..."},{"name":"ARUHNSENNA","text":"Something has kindled there, and daily it grows. And how distrait the elementals are! I've not seen the like of it. They show me what feels like <span class=\"emphasis\">awakening</span>, and...<span class=\"emphasis\">nightmares</span>."},{"name":"ARUHNSENNA","text":"I fear this calls for a more prosaic sensing than that of my rare gift. Some disaster slouches towards us. Might you discover the source of these dark visions and nip it in the bud?"},{"name":"RAYAOSENNA","text":"You are our best hope, <span class=\"highlight\">Forename</span>! Surely, you can find the will to journey to Amdapor. You shall find a Wood Wailer by the name of Alphene keeping vigil at the barrier."},{"name":"RAYAOSENNA","text":"And don't worry about returning here to tell us of your findings; the elementals will doubtless keep us apprised. But enough talk. Good luck, <span class=\"highlight\">Forename</span>!"},{"name":"RAYAOSENNA","text":"You'll listen to what Alphene says, won't you? He stands guard at the barrier over Amdapor Keep. Worry not─he shall know you."},{"name":"ALPHENE","text":"The Seedseers have sent word of your coming. You are bold indeed to willingly glimpse into the darkness. The lost city festers more and more by the day, and they say you're to lance the boil, eh?"},{"name":"ALPHENE","text":"Beyond this gate lies a land out of balance, its earth aspect sapped by the Calamity."},{"name":"ALPHENE","text":"You had best be prepared before proceeding further. Rot and wrong, that's what you'll see! Creatures run mad, tormented by hooked burrs that clutch and burrow..."},{"name":"ALPHENE","text":"...Ahem. Well, good luck with that! No doubt you'll prevail, being favored of the Seedseers and all. Fight well!"}],"reward":{"gil":939,"instance":22,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[67818]},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1008543","obj":{"i":1008543,"n":"Alphene","l":56,"q":3}},{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"instance","id":"22","obj":{"i":22,"n":"The Lost City of Amdapor","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":55,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"67818","obj":{"i":67818,"n":"One More Night in Amdapor","g":92,"l":"Gridania","s":500,"f":1}}]}