{"quest":{"name":"Ain't Got Time to Breed","location":"Western La Noscea","id":66927,"patch":2.2,"sort":21,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"genre":41,"journal":["It seems the Sapsa Spawning Grounds are producing more than baby Sahagin, and Houu requests a little groundskeeping.","The Coral Tridents have established a breeding program for elbst, but there is only one stud animal. Instinct being what it is, anyone slaying a couple of young Sapsa elbst should find <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> in the company of the irate sire. With this knowledge in the back of your mind, proceed into Trident territory and start dispatching elbst. When the sire arrives, use the milky vitriol given to you against the steely skinned creature and lay it low.","You have made a burial ground of Sapsa today, with both the sire and the young dead by your hands. Console yourself that the sea and the shore are safer for it, and report your success to Houu.","Houu has no doubt that your actions have saved lives─certainly in Novv's Nursery, and perhaps among the Tridents as well, though they seem to offer their lives willingly in the cause of ultimate ascendancy. Things are definitely not better under this sea, and there may be calls on your service again."],"objectives":["Dispatch two Sapsa elbst, use milky vitriol on the big flipper when it appears, then slay it.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"We cannot shhhwallow whole the Coral Tridents, but we can nibble at that which makes them shhhtrong. Many creatures they use for their fell purpose, among them elbst. Shhhorewalker, might you aid ushhh in removing thishhh threat?"},{"name":"HOUU","text":"There are in the Shhhapsa Shhhpawning Grounds elbst young and frisky. They will not be easy to shhhlay, but shhhlay them you must..."},{"name":"HOUU","text":"Doing so will bring down the wrath of their shhhire, the big flipper. This is the shhhtud for the Tridents' elbst stable, and with it gone, the breeding will shhhtop."},{"name":"HOUU","text":"Take this milky vitriol and use it on the big flipper. Even your shhhorewalker arms are no match for the hide of a mature elbst... The shhhea forgives only the shhhoftest and the hardest. Pshhh..."},{"name":"HOUU","text":"First, shhhtrike at the young Shhhapsa elbst in the shhhpawning grounds."},{"name":"HOUU","text":"The big flipper will rushhh to their defense. This milky vitriol you shall use to shhhlay him and end the Tridents' breeding stable."},{"name":"HOUU","text":"Pshhh... You have done well to dispatch the elbst. A nibble there, a nibble here... It keeps us shhhafe from the Tridents' warring ways."},{"name":"HOUU","text":"They had but one shhhtud, procured at great cost, or so the waves tell me. There will be no elbst hatchlings for a while. Pshhh..."},{"name":"HOUU","text":"You shhhorewalkers have no elbst; you have grounded gulls instead. Shhhtrange it shhheems to ride a gull that cannot even fly, but the clutchfather teaches us that there are as many ways as there are grains of shhhand."},{"name":"POPMESSAGE","text":"The big flipper demands satisfaction!"}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}