{"quest":{"name":"Move Along, Nothing to Heal Here","location":"Western La Noscea","id":66926,"patch":2.2,"sort":20,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"genre":41,"journal":["Houu has had troubling news of late, and desires a shorewalker's help in calming the waters.","Warlike ways call for healing hands, and the Coral Tridents have added more sorcerers to their ranks. Houu asks you to remove at least three of them from their ranks, and thus put a damper on the Tridents' bellicose plans.","Leaving the practice of medicine is a painful experience, and you are glad that the healers are not alive to dwell on it. The peaceable Houu will no doubt share your relief when you return to Novv's Nursery and report all.","Houu seems glad to hear of the three sorcerers' departure, though it is never easy to tell with a Sahagin. Without healers to tend to their wounded, the Coral Tridents will surely be less likely to attack in the near future─another reprieve for Novv's people."],"objectives":["Slay shoaltooth Sahagin.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"Pshhh... My eyes and ears among the waves shhhay the Coral Tridents fetched shhhorcerers from the Indigo Deep."},{"name":"HOUU","text":"With shhhuch potent healers in their ranks, they will shhhurely launch an even greater onshhhlaught. This we cannot have...not me, not my shhhpawnbrothers, and certainly not the clutchfather."},{"name":"HOUU","text":"Shhhorewalker, you must persuade these shhhorcerers to depart. Pshhh... I do not understand why they would not shhheek to shhhtay closer to home."},{"name":"HOUU","text":"Pshhh... Wade in the waters of the Shhhapsa Shhhpawning Grounds and turn back the Coral Tridents' new healers. They shhhould never have left the Indigo Deep..."},{"name":"HOUU","text":"The waves brought news of your shhhuccess. We are in your debt. How you manage in the shhhea without any...anything is beyond me. Pshhh..."},{"name":"HOUU","text":"Without the aid of shhhorcerers, the Coral Tridents dare not shhhtrike in force. The clutchfather will find the water shhhweeter for it."}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}