{"quest":{"name":"An Enthralling Engagement","location":"Western La Noscea","id":66938,"patch":2.2,"sort":31,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005940,"target":1005940,"involved":[1008808,1008809,1008810,1008811,1008812,1008813,1008814],"genre":41,"journal":["Seww needs your help to prevent more needless conflict.","Seww has informed you that the Serpent Reavers have been seen moving prisoners deeper into the Sapsa Spawning Grounds. Certain that the captive soldiers will be─or possibly already have been─subjected to “drowning,” Novv's spawnling is concerned that the incident will trigger an aggressive Maelstrom response. Head to the spawning grounds and free as many imprisoned soldiers as possible, and, failing that, defeat any drowned thralls.","You have freed all of the imprisoned soldiers─in one way or another. Return to Novv's Nursery and report to Seww.","Upon hearing your report, Seww muses on the origins of the Sahagin's Serpent Reaver allies. Though the tattooed pirates are willing followers of Leviathan, the young beastman warrior has witnessed the destructive consequences of their efforts to force others into their faith. Continue to aid Seww when he calls upon you, and do what can be done to limit the damage caused by these kidnapping raids."],"objectives":["Free imprisoned soldiers and defeat any drowned thralls among them.","Report to Seww."],"dialogue":[{"name":"SEWW","text":"Pshhh... The Shhherpent Reavers have been shhheen in the shhhpawning grounds, herding prisoners to the water's edge. I do not doubt that they mean to offer the captives' shhhouls to the Lord of the Whorl."},{"name":"SEWW","text":"This act of “drowning” our enemies provokeshhh the moshhht volatile reprisals from the shhhorewalkers─I shhhuspect we might react in a shhhimilar manner were our kin forced to worshhhip one of your finleshhh gods."},{"name":"SEWW","text":"Needleshhh to shhhay, avoiding shhhuch reprisals is the very reason you mushhht free as many of these prisoners as you can."},{"name":"SEWW","text":"Pshhh... It is poshhhible that the ceremony has already claimed a number of the shhhorewalkers. Shhhould you find any drowned among the captives, do not hesitate to shhhtrike─for they shhhurely will not."},{"name":"SEWW","text":"Navigate your way through the shhhpawning grounds until you find the captives of which I shhhpeak. Give them what aid they need to eshhhcape."},{"name":"SEWW","text":"But be warned: those that have already shhhuccumbed to drowning will not reshhhpond favorably to a reshhhcue attempt. Shhhlay them─or be shhhlain."},{"name":"HURAN","text":"You...you're not a thrall! The bastards took us while we were on patrol, and I've been waiting for the chance to escape ever since. I'd say now is that time! My thanks, friend."},{"name":"HURAN","text":"'Ey, yer not one of them crazy-eyed Reavers! I thought me luck'd run out, but I'm more'n 'appy to be proven wrong! Tidegates, 'ere I come!"},{"name":"BALLOON","text":"Guide my blade, Lord Leviathan!"},{"name":"BALLOON","text":"All shall fear the divine ruler of the sea!"},{"name":"BALLOON","text":"Lord of the Whorl! Yer 'umble servant draws blood in Yer name!"},{"name":"HURAN","text":"（★未使用／削除予定★）"},{"name":"HURAN","text":"（★未使用／削除予定★）"},{"name":"HURAN","text":"（★未使用／削除予定★）"},{"name":"POP","text":"You are under attack!"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"POP","text":"（★未使用／削除予定★）"},{"name":"SEWW","text":"Pshhh... It is a shhhtrange thing to be allied with these tattooed shhhorewalkers. Though the Reavers revere the shhhame deity as we, there are many differences in the way we expreshhh our faith."},{"name":"SEWW","text":"I hear that even among the finleshhh ones there was once a religious shhhect that promoted worshhhip of Lord Leviathan and a fearful reshhhpect of the shhhea. Many Shhherpent Reavers are shhhaid to have been fervent believers of thishhh creed, and willingly joined forces with our tribe."},{"name":"SEWW","text":"But now they force their beliefs upon unbelievers, and drag victims kicking and shhhcreaming into the fold. Is it any wonder that our conflict with the Lominsans worshhhens with every pashhhing day?"}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21077},{"id":5632,"one":1},{"id":5672,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005940","obj":{"i":1005940,"n":"Seww","l":33,"q":13}},{"type":"npc","id":"1008808","obj":{"i":1008808,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"npc","id":"1008809","obj":{"i":1008809,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"npc","id":"1008810","obj":{"i":1008810,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"npc","id":"1008811","obj":{"i":1008811,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"npc","id":"1008812","obj":{"i":1008812,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"npc","id":"1008813","obj":{"i":1008813,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"npc","id":"1008814","obj":{"i":1008814,"n":"Imprisoned Soldier","l":33,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21077","obj":{"i":21077,"n":"Rainbowtide Psashp","l":1,"c":65053,"t":100}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}}]}