{"quest":{"name":"Put a Shhhock in It","location":"Western La Noscea","id":66931,"patch":2.2,"sort":22,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"genre":41,"journal":["Houu is much troubled by the state of the spawning grounds, and seeks a handy shorewalker for some light poison control.","Any egg laid at the Sapsa Spawning Grounds faces the prospect of noxious neighbors, and that is something that Houu would rather avoid. Moon jellyfish are pliant and uncomplaining, and would surely not mind being used to stuff the gas-spraying orifices of noxious barnacles. Stopper five barnacles, and should the territorial Sapsa pugil appear, stop it with something a mite harder.","You have crammed the jellyfish into the barnacles and taken out the pugil who was ill pleased at your molestations. You have done fine work this day. Before you get too wrapped up in your own self-satisfaction, however, it might be best to head back to Novv's Nursery to tell Houu what has transpired.","Your barnacle-stuffing having been reported, the talk turns to the future of the Sahagin. Houu has real fear that neglect of the spawning grounds due to war will spell the end of his kind. Should the Sahagin live only for the spawning, as Houu says? Should you? One thing you both can agree on is that war is not the way."],"objectives":["Use moon jellyfish on noxious barnacles in the Sapsa Spawning Grounds, and slay any pugils that appear.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"Pshhh... We ventured onto land shhholely to shhhecure a place for the Indigo Matriarch to shhhpawn."},{"name":"HOUU","text":"But the shhhpawning grounds remain untamed, for too many of our people see more honor in a shhhpear than a mattock. Shhhuch is our need that we must turn to a shhhorewalker for aid..."},{"name":"HOUU","text":"Chief among our concerns is the gas shhhprayed from the local barnacles. Their noxious fumes would harm our eggs. The moshhht effective way of dealing with thishhh is to stuff their shhhpraying orifices with moon jellyfish."},{"name":"HOUU","text":"But beware the Shhhapsa pugils while you shhhtopper the barnacles. They do not take kindly to shhhtrangers manhandling their favored shhhnacks. Pshhh..."},{"name":"HOUU","text":"Pshhh... The gas shhhprayed by noxious barnacles harms our eggs. You must shhhtuff their orifices with jellyfish, and make the Shhhapsa Shhhpawning Grounds safe..."},{"name":"HOUU","text":"But beware the Shhhapsa pugil. They regard the barnacles as you shhhorewalkers would shhheep, and do not like them to be molested. Pshhh..."},{"name":"HOUU","text":"The barnacles are shhhtoppered? Good... I was beginning to fear that the shhhpawning itself may be in peril. I am grateful. Pshhh..."},{"name":"HOUU","text":"If we do not shhhpawn, it is the end for our people. What use to shhhtride off to war if there are no shhhpawnlings to return to, no matriarch to continue the line? But young males never listen. Pshhh..."},{"name":"POPMESSAGE","text":"You detect an angry, hungry presence!"}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}