{"quest":{"name":"Better Ash than Blood","location":"Western La Noscea","id":66930,"patch":2.2,"sort":25,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"genre":41,"journal":["The path to war is littered with brute and ugly things, and it seems Houu has stumbled over yet more of those.  ","Four crates of stolen armaments have been deposited in the Sapsa Spawning Grounds by the Serpent Reavers, and they await collection by the Coral Tridents. The armaments need but a spark to go up in flames, and Houu has given you several flint stones to accomplish this purpose. Should guards of the shelftooth, shelfclaw, or shelfspine persuasion attempt to interfere, lay them low.","All four crates of weapons and armor have been reduced to ashes, with much the same to be said of the guards unwise enough to attack you. At your earliest convenience, return to Houu in Novv's Nursery and report on your successful pyromania.","Pleased with your performance, Houu is nevertheless harsh in his condemnation of shorewalker ways, the very notion of crafting being repugnant to the Sahagin. There does seem, however, to be some strange sympathy for the devil in that slow-beating heart..."],"objectives":["Use flint stones on stolen armaments in the Sapsa Spawning Grounds, and slay any Coral Tridents that appear.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"Pshhh... A shorewalker trading vessel was raided by Shhherpent Reavers. The cargo was arms and armor, and a great deal of it."},{"name":"HOUU","text":"Though clumsy in the shhhea, your shorewalker arms are devastating on land. They cannot be allowed to pass into the Coral Tridents' hands. Pshhh..."},{"name":"HOUU","text":"Put the crates of stolen armaments to the flame, shorewalker. All you need are these flint shhhtones, for they are volatile things. Be warned, the Coral Tridents may be in the area. Pshhh..."},{"name":"HOUU","text":"Pshhh... Take these flint shhhtones and put the shhhtolen armaments in the Shhhapsa Shhhpawning Grounds to the flame. The Coral Tridents must not have them."},{"name":"HOUU","text":"You burned every last crate? Good. Good. Unnatural thing, fire. It shhheems pointless to fight water. It needs no fuel... Yes, it is patient."},{"name":"HOUU","text":"You shhhorewalkers have no patience, it shhheems to me. You interfere with trees and earth, forcing the wood and metal into arms. You are impatient and cruel...and very lonely. Pshhh..."},{"name":"HOUU","text":"That last quality of your kind...it moves me. That is a shhhurprise. Pshhh..."},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"BALLOON","text":"Pshhh... Paws off!"},{"name":"BALLOON","text":"Shhhorewalker shhhcum!"},{"name":"BALLOON","text":"Our armaments! How dare you meddle!"}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}