{"quest":{"name":"Shellfish Schemes","location":"Western La Noscea","id":66937,"patch":2.2,"sort":33,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005940,"target":1005940,"genre":41,"journal":["Seww would have you delve deep into the spawning grounds.","According to Seww, the Coral Tridents have been hard at work perfecting an even more powerful version of their shellfish siege weaponry. He requests that you act immediately to protect the tidegates from the devastating force of these unnatural creations. Delve deep into the spawning grounds, and destroy the reinforced whelk ballistas before they are transported to the front lines.","You have successfully destroyed the latest and most powerful versions of the whelk ballistas. Return to Novv's Nursery and report to Seww.","After hearing your report, a relieved Seww reiterates the importance of the tidegates' function in keeping the warring peoples separate. But though the Coral Tridents have once more been thwarted by your actions, it seems they are intent on strangling themselves with Seww's graphically described chain of retaliation."],"objectives":["Destroy reinforced whelk ballistas.","Report to Seww."],"dialogue":[{"name":"SEWW","text":"Pshhh... There is word that the Coral Tridentshhh have perfected more powerful versions of their unnatural whelk ballishhhtae."},{"name":"SEWW","text":"It appears that much effort has been shhhpent in breeding larger, more robushhht shhhellfish─the Tridentshhh mean to take no chances when they next attack the tidegateshhh."},{"name":"SEWW","text":"Fortunately for ushhh, these unnatural weapons are yet being teshhhted deeper within the shhhpawning grounds. Now is our chance to deshhhtroy them before they can be transhhhported to the front lines!"},{"name":"SEWW","text":"Any attack on the ballishhhtae will likely bring shhhwift reprisals, so be ready to defend yourshhhelf against the guards."},{"name":"SEWW","text":"Thishhh is the perfect opportunity to deshhhtroy these shhhiege weapons before they are brought to bear upon the tidegateshhh! But be wary─the ballishhhtae will not be left unguarded."},{"name":"SEWW","text":"Pshhh! Another victory for our cause! Shhhould the tidegateshhh fall, there would be no end to our battles with the shhhorewalkers."},{"name":"SEWW","text":"We attack, they counterattack, and the unbroken chain of retaliation pulls more tightly around all our neckshhh. A shhhimple truth, but one that my fanatic kin shhheem unable to grashhhp..."}],"reward":{"gil":780,"reputation":20,"items":[{"num":10,"id":28},{"id":21077},{"id":5672,"one":1},{"id":5677,"one":1},{"id":5722,"one":1}],"xp":10473},"reqs":{"beastrank":3,"jobs":[{"lvl":48,"id":34}]}},"partials":[{"type":"npc","id":"1005940","obj":{"i":1005940,"n":"Seww","l":33,"q":13}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21077","obj":{"i":21077,"n":"Rainbowtide Psashp","l":1,"c":65053,"t":100}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}}]}