{"quest":{"name":"Clutchfather Knows Best","location":"Western La Noscea","id":66932,"patch":2.2,"sort":27,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"involved":[1005938],"genre":41,"usedItems":[7804],"journal":["Houu is expert at weighing lesser evils against greater goods, and would see where you fit into the equation.","Houu asks you to defeat Worr the Whalefin, a strategos in thrall to the Coral Tridents. Achieve victory in the FATE “Tail of a Whale” in the Sapsa Spawning Grounds to acquire Worr's coral band, and then present it as proof of your deed to Houu.","Houu receives the coral band and is greatly impressed by your martial skills. You have apparently made an equally strong impression on other Sahagin. Let us hope they will no longer be so quick to follow the Tridents' incitement to take on shorewalkers in open warfare..."],"objectives":["Deliver the coral band obtained in the FATE “Tail of a Whale” to Houu."],"dialogue":[{"name":"HOUU","text":"Pshhh... Have you heard of the strategoi of the Shhhapsa Shhhpawning Grounds? They are leaders among Shhhahagin warriors, possessed of great influence."},{"name":"HOUU","text":"Alas, the Shhhcarlet Shhhea Devil has been inflaming their pride with visions of easy victory. Shhhubtle and shhhly are the Coral Tridents. If nothing is done, their aggression will soon lead to all-out war with you shhhorewalkers..."},{"name":"HOUU","text":"The strategoi must see that the shhhorewalker is a foe shhhkilled and dangerous. You will fight the most boastful among them. Worr the Whalefin is his name, and he must die this day. Pshhh..."},{"name":"HOUU","text":"Worr has a coral band, given him as an ally shhhworn of the Coral Tridents. Bring me this bauble as proof that Worr died as shhhamefully as he lived. Pshhh..."},{"name":"HOUU","text":"Pshhh... Shhhlay Worr the Whalefin and seize from him the coral band of the Tridents."},{"name":"HOUU","text":"Pshhh... Worr's coral band, by all that's indigo! The clutchfather always chooses wisely... Little did I expect a shhhorewalker to best the Whalefin."},{"name":"HOUU","text":"A strategos is a leader of minds as well as shhhpears. Worr's defeat at a shhhorewalker's hands is an object lesson that will shhhpread throughout the Shhhapsa Shhhpawning Grounds. Pshhh..."}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"npc","id":"1005938","obj":{"i":1005938,"n":"Fyuu","l":33,"q":11}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"7804","obj":{"i":7804,"n":"Coral Band","l":1,"c":54432,"t":61}}]}