{"quest":{"name":"A Nap Before Drowning","location":"Western La Noscea","id":66933,"patch":2.2,"sort":28,"interval":"daily","repeatable":1,"beast":4,"eventIcon":71222,"issuer":1005939,"target":1005939,"involved":[1008877,1008878,1008879,1008880],"genre":41,"journal":["Houu has a nose for noxious happenings in the spawning grounds─especially where the Coral Tridents are involved.","Maelstrom recruits have been captured by the Coral Tridents, and rendered helpless by noxious gas from paralysis pots. Houu has given you stoppers to use on the pots.","The stoppers proved to be a perfect fit, and the reeling recruits are back on their feet and out of the Sapsa Spawning Grounds. Report the successful mission to Houu.","A Sahagin of peace, Houu reveals that he is caught between two faiths. He would not deny Leviathan his rightful oblations, but would not have a war fought over the “drowning” of shorewalkers, either. It is unfortunate that your two peoples will yet be caught up in this struggle for the foreseeable future..."],"objectives":["Use pot stoppers on paralysis pots in the Sapsa Spawning Grounds.","Report to Houu."],"dialogue":[{"name":"HOUU","text":"Pshhh... The waves bring news of shhhorewalkers held captive by the Coral Tridents. They are of the Maelstrom─mere recruits."},{"name":"HOUU","text":"They are certain to be “drowned”─their minds twisted by Leviathan's aweshhhome powers. Unleshhh something is done, the Maelstrom may feel it necessary to shhhtrike back. Go to their rescue, shhhorewalker."},{"name":"HOUU","text":"Deep within the shhhpawning grounds, you will find them lying insensate. The gas shhhpewing forth from the Tridents' paralysis pots comes from noxious barnacles, and it renders them helpleshhh."},{"name":"HOUU","text":"Pshhh... Use these shhhtoppers to plug the pots stationed by the recruits. They should come to shhhortly thereafter once the air clears."},{"name":"HOUU","text":"Use the shhhtoppers on the paralysis pots to restore the captive shhhorewalkers to their shhhenses. But beware the Coral Tridents along the way... Pshhh..."},{"name":"KOKKA01397","text":"Row, row, row your boat..."},{"name":"KOKKA01397","text":"Fishies... Here, fishies..."},{"name":"KOKKA01397","text":"Mother...?"},{"name":"KOKKA01397","text":"Llymlaen... Halone... Thaliak... I...I can't remember which god to call to..."},{"name":"KOKKA01397","text":"Ungh... I'm not... What's...? What in the Navigator's name am I doing? We have to get out of here!"},{"name":"KOKKA01397","text":"Wh-Where am I!? What is this!? We were attacked! Taken by the Sahagin! Must! Report!"},{"name":"KOKKA01397","text":"What a dream! Home, before the Calamity. Had it pretty good, didn't I? But my home's with the Maelstrom now... I'd better get back."},{"name":"KOKKA01397","text":"Adventurer, you have saved my sanity! Those cursed fishbacks would part me from mine own mind!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"HOUU","text":"The captive shhhorewalkers swim free? Good... The drowned have their place, for Lord Leviathan must have His due, but..."},{"name":"HOUU","text":"Shhhorewalkers are a vengeful people. For every Maelstrom won for Lord Leviathan, there will be retribution in kind and more. Not worth the trouble, I shhhould think. Pshhh..."},{"name":"SAHUAGIN01397","text":"(-Shelfclaw Guard-)Pshhh! You dare take what belongs to Lord Leviathan!?"},{"name":"SAHUAGIN01397","text":"(-Shelfclaw Guard-)Another shhhoul that shhheeks to be drowned! Your innermost wish I shhhall grant!"},{"name":"SAHUAGIN01397","text":"(-Shelfclaw Guard-)The Coral Tridents take no prisoners! Well, except this lot. But never you mind that─prepare to die!"}],"reward":{"gil":660,"reputation":14,"items":[{"num":7,"id":28},{"id":21072}],"xp":9693},"reqs":{"beastrank":2,"jobs":[{"lvl":46,"id":34}]}},"partials":[{"type":"npc","id":"1005939","obj":{"i":1005939,"n":"Houu","l":33,"q":10}},{"type":"npc","id":"1008877","obj":{"i":1008877,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"npc","id":"1008878","obj":{"i":1008878,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"npc","id":"1008879","obj":{"i":1008879,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"npc","id":"1008880","obj":{"i":1008880,"n":"Captive Storm Recruit","l":33,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}