{"quest":{"name":"Curds and Slay","location":"Mor Dhona","id":66947,"patch":2.2,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1006975,"target":1006268,"involved":[1006266],"genre":95,"journal":["As Bloezoeng eyes you from his corner, you get the impression that he has a dangerous task in mind.","Your wanderings have led you into the company of one Bloezoeng, a local chef in the Seventh Heaven. As it turns out, you and he share a mutual acquaintance: Dyrstweitz, the owner of the Flying Shark in Costa del Sol. Dyrstweitz, it would seem, has sent out a call for help on behalf of his own friend, Wheiskaet. For friendship's sake, seek out Wheiskaet in eastern La Noscea to see what is troubling him.","Wheiskaet has pointed you in the direction of yet another old acquaintance, Brayflox Alltalks from the Company of Heroes. Proceed to Brayflox's Longstop, and assist the goblin in any way you are able.","You speak with Brayflox and discover that her camp is under attack by the Illuminati, a secretive fraternity of goblin scholars. This enigmatic band may well have good reasons for their assault, but in the name of friendship, you must brush such doubts aside as you prepare to stand with Brayflox.<br><br>※Brayflox's Longstop (Hard) can be accessed via the Duty Finder."],"objectives":["Speak with Wheiskaet at Costa del Sol.","Speak with Brayflox at her Longstop."],"dialogue":[{"name":"BLOEZOENG","text":"You're <span class=\"highlight\">Forename Surname</span>, by the onion! The very <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I seek at Dyrstweitz's behest!"},{"name":"BLOEZOENG","text":"How do I know the potbanger? Why, we trained together in the Culinarians' Guild. He has a place in Costa del Sol now─the Flying Shark."},{"name":"BLOEZOENG","text":"Not the sharpest knife in the block is Dyrst the Daft, but he's loyal. He's got a friend out there by the name of Wheiskaet, and he seems to be in need of your help. What say you go look him up, eh?"},{"name":"WHEISKAET","text":"<span class=\"highlight\">Forename Surname</span>! I shall have to thank Dyrstweitz, for he was as good as his word. He promised he'd find you."},{"name":"WHEISKAET","text":"I'm lucky to have such friends? What can I say, in the Company of Heroes, you keep good company, haha! And that's what I need your help with. I'm sure you'll remember Brayflox─in a bit of trouble, she is."},{"name":"WHEISKAET","text":"As the captain of the guards here, I can hardly go charging off to her rescue. Yet, would I forsake a friend? Never! And so I thought of you, <span class=\"highlight\">Forename</span>."},{"name":"WHEISKAET","text":"Truly, your timing is fortuitous, and your fortitude unmatched. If there is any who can help our mutual gobbie friend, it is you. Now, off you go, then─to Brayflox's Longstop!"},{"name":"WHEISKAET","text":"Help Brayflox, old friend. You shall find her at the Longstop, as you did before."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh...<br>Goodly uplander is here to give lenthand to gobbieflock of Brayflox? Uplander's tongueflaps make for happy gobbie!"},{"name":"BRAYFLOX","text":"Brayflox ear-catch enemy footnoise! Illuminati want Brayflox's secret. Dirty-take they try and try, pshhh!"},{"name":"BRAYFLOX","text":"Stinkysweet secret recipe, Brayflox can give to gobbie friend! Brayflox's cheese is most tastyfresh, and now Brayflox is a hunted gobbie!"},{"name":"BRAYFLOX","text":"Brayflox is no <span class=\"emphasis\">cheesemaker</span>─Brayflox <span class=\"emphasis\">free</span> cheese recipe from Illuminati. Cheese is gobbie birthright, no gobbie die make Illuminati cheeselords. But now they want to make Brayflox dead gobbie!"},{"name":"BRAYFLOX","text":"Brayflox give uplander lenthand in past-time, yes? Mighty rockman fall with gobbiehelp, yes? Now time is come for lenthand to be Brayflox's ironfist! <span class=\"emphasis\">Shkohhh</span>!"}],"reward":{"gil":939,"instance":20,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]}},"partials":[{"type":"npc","id":"1006975","obj":{"i":1006975,"n":"Bloezoeng","l":67,"q":5}},{"type":"npc","id":"1006268","obj":{"i":1006268,"n":"Brayflox Alltalks","l":32,"q":2}},{"type":"npc","id":"1006266","obj":{"i":1006266,"n":"Wheiskaet","l":32,"q":20}},{"type":"instance","id":"20","obj":{"i":20,"n":"Brayflox's Longstop (Hard)","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":55,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}