{"quest":{"name":"The King Lives","location":"The Waking Sands","id":66948,"patch":2.2,"sort":5,"icon":112050,"unlocksFunction":1,"eventIcon":71341,"issuer":1007478,"target":1008544,"involved":[1000168,1008545],"genre":13,"journal":["Urianger wishes to speak with you about the royal return of Good King Moggle Mog XII.","Urianger informs you that the Mogglesguard have once more succeeded in calling forth the daunting avatar of Good King Moggle Mog XII. Make your way to the Adders' Nest in Gridania, and report to High Serpent Commander Vorsaile Heuloix.","In somewhat pained tones, Vorsaile Heuloix explains how Kuplo Kopp attempted to chastise the Mogglesguard for their previous folly in summoning the king. Unfortunately, Kuplo's words did not have the desired effect─fueled by fear and righteous indignation, the Mogglesguard proceeded to summon an even more potent incarnation of their maniacal monarch. Make haste to the Bramble Patch in the East Shroud, and rendezvous with your frantic moogle acquaintance.","Kuplo Kopp has called upon you to depose “Great” King Moggle Mog XII, and to give the Mogglesguard a sound thrashing. Enter Thornmarch through the nullified ward, and defeat this royal menace!<br><br>※Thornmarch (Extreme) can be accessed via the Duty Finder."],"objectives":["Speak with Vorsaile Heuloix at the Adders' Nest.","Speak with Kuplo Kopp in the Bramble Patch."],"dialogue":[{"name":"URIANGER","text":"Amongst mooglekind, the legend of Good King Moggle Mog XII doth tell of a wise and magnanimous ruler. Alas, the entity thus summoned put the lie to this imagining with his brief and decidedly unpeaceful reign."},{"name":"URIANGER","text":"'Twas most disturbing for me to learn, then, that the Mogglesguard have once more succeeded in placing their manic potentate upon his thorny throne..."},{"name":"URIANGER","text":"Only with the Ascians' guileful intervention could they have called the king back from the aether with such haste. I am afeared that, as was the case with Ifrit and his primal ilk, the ritual thus employed hath empowered the avatar with a strength far beyond that of his previous incarnation."},{"name":"URIANGER","text":"Methinks the agents of chaos doth lurk in the shadows of this deed. Only with the Ascians' guileful intervention could they have called the king back from the aether with such haste."},{"name":"URIANGER","text":"As ever, it falls to thee─to the blade born of light─to banish the Paragons' dark ambition from our realm. The Twelve only know what dire power doth corrupt the “savior” of these gentle forest folk..."},{"name":"URIANGER","text":"Thy name hast been called, <span class=\"highlight\">Forename</span>. The more moderate faction of the moogles hath joined with the Order of the Twin Adder in an effort to open thee a path to the Good King's domain."},{"name":"URIANGER","text":"I bid thee make haste to the Adders' Nest, and once more pledge thine aid in deposing this royal myth made flesh."},{"name":"VORSAILE","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, glad I am to see you. I assume you have been apprised of the situation regarding the moogle monarch?"},{"name":"VORSAILE","text":"After your previous deposal of the king, Kuplo Kopp approached the Mogglesguard and attempted to convince them of the error of their ways."},{"name":"VORSAILE","text":"...Unfortunately, it appears his efforts at persuasion had rather the opposite effect. The royal sentries reportedly flew into a frenzy, and focused their righteous indignation into a new summoning ritual."},{"name":"VORSAILE","text":"Mayhap it was the unwavering intensity of the Mogglesguard's prayers, but the king has returned to the forest enveloped in an almost blinding aura of majesty."},{"name":"VORSAILE","text":"Kuplo Kopp tells us that this dauntingly maniacal avatar has now taken to calling himself <span class=\"emphasis\">Great</span> King Moggle Mog XII. Suffice it to say that the Elder Seedseer is willing to condone the necessary act of regicide."},{"name":"VORSAILE","text":"For the safety of all who dwell within the Twelveswood, it has been decided that the king must fall. A certain member of the Elder Seedseer's personal guard has already escorted Kuplo Kopp to the ward that shields the monarch's domain."},{"name":"VORSAILE","text":"Those among us with the ability to see moogles are often in high demand, but, considering the urgency of your mission, our leader felt it best to expedite matters."},{"name":"VORSAILE","text":"Pray make your preparations and set out as soon as you are able. Kuplo Kopp awaits you in the Bramble Patch in the East Shroud."},{"name":"VORSAILE","text":"Though I wish it were otherwise, the unenviable duty of dragging “Great” King Moggle Mog XII from his throne falls to you. Head to the Bramble Patch in the East Shroud, and Kuplo Kopp will open the way to Thornmarch."},{"name":"KUPLOKOPP","text":"Oh, I knew you'd come! At least, I was hoping, kupo!"},{"name":"KUPLOKOPP","text":"Not long ago, I had a stern word with the Mogglesguard about the dangers of turning pleasant faerie tales into disturbing reality. But they insisted that the intimidating force that is Good King Moggle Mog XII─may his scepter of judgment ever command our respect─is exactly the sort of savior we need."},{"name":"KUPLOKOPP","text":"The Mogglesguard are afraid, kupo. Afraid of how the forest has changed, afraid of the never-ending conflict, afraid that we moogles have no place in this new world..."},{"name":"KUPLOKOPP","text":"I am scared of all those things, too. But the thought of unleashing our royal menace upon the Twelveswood scares me even more, kupo!"},{"name":"KUPLOKOPP","text":"Please, you must deal with them firmly before this goes too far! A measured thrashing, of course─nothing too brutal!"},{"name":"KUPLOKOPP","text":"You can enter Thornmarch here, through the tear I've made in the ward. Take care, good fortune, and in the meantime I'll go let the others know that Great King Moggle Mog XII─may his reign end with minimal bloodshed─will be vacating his throne, kupo!"},{"name":"BODYGUARD01412","text":"Kuplo Kopp has nullified the ward in anticipation of your arrival. I pray this royal nightmare is not beyond your abilities..."}],"reward":{"gil":1220,"instance":20012,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66727]}},"partials":[{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1008544","obj":{"i":1008544,"n":"Kuplo Kopp","l":55,"q":1}},{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1008545","obj":{"i":1008545,"n":"Keeper Of The Entwined Serpents","l":55,"q":1}},{"type":"instance","id":"20012","obj":{"i":20012,"n":"Thornmarch (Extreme)","c":61804,"t":"Trials","min_lvl":50,"max_lvl":50,"min_ilvl":80}},{"type":"quest","id":"66727","obj":{"i":66727,"n":"On the Properties of Primals","g":2,"l":"South Shroud","s":17}}]}