{"quest":{"name":"Egg-hunting We Will Go (Gridania)","location":"Gridania","id":66950,"patch":2.2,"sort":35,"icon":100244,"eventIcon":71221,"issuer":1007900,"target":1007900,"genre":199,"usedItems":[2659],"journal":["Jihli Aliapoh would have you experience the miracle of Hatching–tide.<br>※This quest is available for a limited time only.","Jihli Aliapoh teaches you the origins of Hatching–tide, a fledgling festival born from a vision she claims was bestowed upon her by the Twelve Archons of the Sixth Umbral Era. Eager to have you partake in the celebration, Jihli bids you speak with one of her Dreamers to acquire a pristine egg cap. Retrieve a cap from one of the Dreamers, then speak with her again when you've made yourself presentable.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","There is still time before Hatching Hour, the final ceremony heralding the Twelve Archons' return to Eorzea. To that end, Jihli Aliapoh encourages you to try your hand at egg hunting, a popular Hatching–tide festival activity. She informs you of the different kinds of eggs which can be opened to reveal a gift, or exchanged for eggs of higher quality with richer rewards.<br><br>As you prepare to set out on an egg–hunting adventure, however, she asks that you pay her a visit when you've had your fill of festival games. Though preparations appear to be going as planned, perhaps this year's Hatching–tide is beset with more troubles than she would have you believe."],"objectives":["Equip a pristine egg cap, then speak with Jihli Aliapoh."],"dialogue":[{"name":"SYSTEM","text":"Eorzea is currently celebrating Hatching–tide. Adventurers wishing to partake in the festivities may do so in Limsa Lominsa, Gridania, or Ul'dah."},{"name":"SYSTEM","text":"The rewards will be the same regardless of venue, so do not hesitate to join the celebration in the nation of your choice."},{"name":"JIHLIALIAPOH","text":"Greetings, friend. I take it the vibrant assortment of eggs here has piqued your curiosity."},{"name":"JIHLIALIAPOH","text":"Allow me to introduce myself. My name is Jihli Aliapoh, and these eggs are for the celebration of Hatching–tide, which is nigh upon us."},{"name":"JIHLIALIAPOH","text":"The tradition began several years ago, after I was blessed with a vision by the Twelve Archons of ages past. These heroes are said to have lived through the Sixth Umbral Calamity, fighting bravely against an encroaching darkness that would have otherwise seen to the realm's destruction."},{"name":"JIHLIALIAPOH","text":"Descending from the heavens atop brilliantly colored eggs, they delivered a message unto me which, to this day, burns brightly in my mind:<br>“Rise, young Dreamer, and make ready the vessel for our return.”"},{"name":"JIHLIALIAPOH","text":"My purpose in life was made clear, and so I set out to prepare their vessels─beautiful eggs bedecked with the same exquisite designs as seen in my vision. A laborious task for one person, to be sure, but I would not be alone in this endeavor for long."},{"name":"JIHLIALIAPOH","text":"In time, other believers would join my cause, and come to be known as Dreamers. Years have passed since our vigil began, and still they remain by my side, awaiting the return of those fabled Archons of yore."},{"name":"JIHLIALIAPOH","text":"And so every year during Hatching–tide, we gather here with eggs to serve as their vessels. They have yet to appear before us, but I believe this year will be different. For it was by their grace the realm survived the Sixth Umbral Calamity, and I am sure they had a hand in our survival of the Seventh."},{"name":"JIHLIALIAPOH","text":"That's right, my friend, the time has come for the Twelve Archons to return, and their vessels will soon be ready!"},{"name":"JIHLIALIAPOH","text":"If you would join in our celebration, you must first acquire a traditional headpiece. Though this tradition is still quite young, it is an integral part of the proceedings, as you will soon discover."},{"name":"JIHLIALIAPOH","text":"There are several to choose from, but let us start with something simple yet festive─a pristine egg cap should suit you nicely."},{"name":"JIHLIALIAPOH","text":"But do not worry, there is no need for payment. Simply speak with the Dreamers and they will be more than happy to supply you with a headpiece. "},{"name":"JIHLIALIAPOH","text":"Are you not excited? To think your first celebration of Hatching–tide will herald the return of such legendary heroes! Now, run along and retrieve an egg cap from one of the Dreamers. I will be here waiting for you."},{"name":"SHOPGURIDANIA","text":"I heard, I heard! You have come to join in the festivities! Haha, haha! Here, take this pristine egg cap to start you on your way. And may the Archons of yore bless you and keep you!"},{"name":"POPMESSAGE","text":"You obtain a pristine egg cap."},{"name":"SHOPLIMSA","text":"I take it you have decided to join in the festivities? Excellent! Here is a pristine egg cap to start you on your way. May the Archons of yore bless you and keep you."},{"name":"SHOPURUDAHA","text":"I take it you have decided to join in the festivities? Excellent! Here is a pristine egg cap to start you on your way. May the Archons of yore bless you, and keep you."},{"name":"JIHLIALIAPOH","text":"This year's Hatching–tide is sure to be an unforgettable experience, so you'll want to be prepared."},{"name":"JIHLIALIAPOH","text":"One of my fellow Dreamers will gladly lend you a pristine egg cap, so there is no need to be shy."},{"name":"JIHLIALIAPOH","text":"Now, hurry along. You want to look your best at Hatching Hour, do you not?"},{"name":"JIHLIALIAPOH","text":"Well, well! Don't <span class=\"emphasis\">we</span> look splendid with our festival cap?"},{"name":"JIHLIALIAPOH","text":"I think we're just about ready to begin! But before we do, I would ask the name of the budding Dreamer who stands before me. <span class=\"highlight\">Forename Surname</span>, is it?"},{"name":"JIHLIALIAPOH","text":"Well, <span class=\"highlight\">Forename</span>, there is still time until Hatching Hour. Might I suggest a bit of egg hunting to pass the time? This is Hatching–tide, after all, and no one can truly say they have celebrated this day without partaking in an egg hunt."},{"name":"JIHLIALIAPOH","text":"Bear in mind, however, this is no simple ramble about Gridania. Eggs have been hidden in fields all across Eorzea, each containing a different prize."},{"name":"JIHLIALIAPOH","text":"Three types have been hidden for the hunt: bronze, silver, and golden! Bronze eggs are the most common of the three, and it will be a laborious task to obtain the rarer sort. Golden eggs are without question the rarest, with rewards as precious as the gilded containers that bear them."},{"name":"JIHLIALIAPOH","text":"Feel free to open any eggs you come across, but if you seek eggs of higher quality, bring what you have to one of my Dreamers. In exchange for bronze, they will offer you silver eggs, and for silver they will offer you golden eggs."},{"name":"JIHLIALIAPOH","text":"When you are not too busy hunting eggs, however, I would ask for your help in preparing for Hatching Hour. Although preparations are proceeding as planned, the welcoming of the Twelve Archons must be perfect, and the assistance of an able–bodied adventurer would put my mind at ease."},{"name":"JIHLIALIAPOH","text":"But for now, I bid you safe travels as you partake of our Hatching–tide revelry. When you are ready to hear my request, I will be here waiting for you. May the Archons of yore bless you and keep you."}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66953]},"partials":[{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}},{"type":"quest","id":"66953","obj":{"i":66953,"n":"Eggsigent Circumstances","g":199,"l":"Gridania","s":38}}]}