{"quest":{"name":"The Yolks on Us","location":"Gridania","id":66955,"patch":2.2,"sort":40,"icon":100247,"eventIcon":71221,"issuer":1007900,"target":1007900,"genre":199,"usedItems":[2659,2809],"journal":["Jihli Aliapoh has gleaned the location of yet another set of eggs, and would ask for your aid in retrieving them.<br>※This quest is available for a limited time only.","Jihli Aliapoh has been granted a vision of what she claims to be the last set of stolen Archon eggs in southern Thanalan. With Dreamers dispatched to retrieve them, she wishes to ensure their security, and would have you speak with Orselfaux in Ul'dah to confirm they have arrived without incident. Travel to Ul'dah and speak with Orselfaux to discern the status of the Archon eggs.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You learn from Orselfaux that Augustiniel has once again volunteered to help in the delivery of the eggs in spite of his recent exertions. With a group of spriggans now roaming the halls of Ul'dah, Orselfaux is concerned that Augustiniel is not fit to watch the eggs, and would ask that you seek him out to ensure they are secure. Orselfaux suspects the eggs may need to be moved to a safer location, and suggests you seek the aid of another adventurer to assist you in Augustiniel's stead. Team up with a like–minded adventurer and search for Augustiniel and the eggs on the Steps of Thal.","You find Augustiniel in the Steps of Thal, too weak to go on and in desperate need of assistance. Having collapsed after reaching the Gate of Thal, his partner ran off in search of assistance, leaving him to care for both eggs on his own. No longer fit to continue with the delivery, he implores you and your friend to carry them to the Gold Court where they may be protected until the spriggans are driven out of Ul'dah. One of you must carry the pristine Archon egg, and the other the midnight Archon egg. Wearing your respective caps, carry the eggs together with your companion to the Gold Court.","See that your Archon egg is carried safely to the Gold Court, avoiding any spriggans that may cross your path.","Carefully maneuvering through the corridors of the Steps of Thal, you deliver the Archon eggs to the Dreamers waiting in the Gold Court. Report to Orselfaux and tell him the eggs are now in safe hands.","Orselfaux is glad to hear the Archon eggs have been safely delivered to the Gold Court, and thanks you for your efforts. With time still remaining until Hatching Hour, he returns to the affairs of the celebration, and bids you speak with Jihli Aliapoh to assure her that the eggs are safe.","With all of the Archon eggs back in the possession of her Dreamers, Jihli Aliapoh is at a loss for words in expressing her gratitude for your efforts. Though you must now part ways until the long–awaited egg ceremony, she assures you it will be an unforgettable experience."],"objectives":["Speak with Orselfaux in Ul'dah while equipped with a pristine egg cap.","Form a party of two, then speak with Augustiniel while wearing an appropriate egg cap.","Pick up the Archon egg matching your cap.","Deliver the Archon egg to the Gold Court.","Speak with Orselfaux.","Report to Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Greetings, <span class=\"highlight\">Forename</span>! I hope you are well rested from your run through Limsa."},{"name":"JIHLIALIAPOH","text":"It gives me great pleasure to inform you of my most recent vision─a vision of the final set of Archon eggs waylaid by the spriggans!"},{"name":"JIHLIALIAPOH","text":"Buried in sand, I nearly mistook their location for a beach along Lominsan shores...but then I saw turtles! Monstrous beasts the size of a small cottage. Consultation with Dreamers far more knowledgeable of wildlife than I revealed they were hidden in Zanr'ak in southern Thanalan."},{"name":"JIHLIALIAPOH","text":"I received word not long ago that they have been retrieved, though not without interference by the spriggans. I can think of no one better to see to the security of the eggs, and so I would ask that you make haste to Ul'dah and speak with Orselfaux. He oversees the Hatching–tide festivities there."},{"name":"JIHLIALIAPOH","text":"He will be expecting you, but I would suggest wearing your pristine egg cap, that he may readily know of your intentions."},{"name":"JIHLIALIAPOH","text":"We must secure the last set of eggs before Hatching Hour! Please make haste to Ul'dah and speak with Orselfaux."},{"name":"JIHLIALIAPOH","text":"Tarry not, <span class=\"highlight\">Forename</span>! Orselfaux is expecting your arrival in Ul'dah. And be sure to wear your headpiece when you greet him!"},{"name":"ORSELFAUX","text":"I would love to chat, but I'm waiting on someone for important business. I do wonder where <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> could be..."},{"name":"ORSELFAUX","text":"Ah, welcome, welcome. I take it Miss Aliapoh has sent you regarding the Archon eggs."},{"name":"ORSELFAUX","text":"Well, you'll be happy to know they arrived in Ul'dah <span class=\"alternative-container\"><span class=\"alternative\">just this afternoon</span><span class=\"alternative\">just last night</span><span class=\"alternative\">just this morning</span></span>, although I wish Augustiniel would not push himself so."},{"name":"ORSELFAUX","text":"He was injured in Limsa Lominsa, was he not? You would think the man would see his wounds heal before undertaking more duties, but he insisted on helping deliver the eggs to Ul'dah."},{"name":"ORSELFAUX","text":"I know he means well, but it sounds as though he could barely stand. Having traveled such a long way, in the heat of Thanalan? I would say his chances of success were slim at best."},{"name":"ORSELFAUX","text":"To make matters worse, a band of spriggans has breached the gates of Ul'dah, and I suspect he and his partner are in no condition to keep the eggs safe. I would ask that you seek him out on the Steps of Thal and, if necessary, move the eggs in their stead."},{"name":"ORSELFAUX","text":"They were charged with delivery of a pristine Archon egg and a midnight Archon egg, so you will need another adventurer to assist you. A cap matching the eggs is required, yes? You may purchase one from one of my fellow Dreamers if need be, then proceed to the Steps of Thal."},{"name":"ORSELFAUX","text":"Augustiniel should be somewhere on the Steps of Thal guarding the pristine Archon egg and midnight Archon egg."},{"name":"ORSELFAUX","text":"When you and your partner each have a cap, please see that both Augustiniel and the eggs are safe."},{"name":"AUGUSTINIEL","text":"Well, hello there. I take it Orselfaux sent you to find me."},{"name":"AUGUSTINIEL","text":"The eggs are safe for the moment, but they've yet to reach their destination at the Gold Court, and I'm in no condition to move them. If you're looking to assist, you'll need to find a friend to help carry one of the eggs."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are too far away."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members must equip the appropriate egg cap."},{"name":"AUGUSTINIEL","text":"Thank heavens! You are just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wanted to see. And you have a friend with you, excellent."},{"name":"AUGUSTINIEL","text":"As you can see behind me, we retrieved another set of eggs for the celebration, but in the process, a group of spriggans gave chase into the city before we could reach a safe location."},{"name":"AUGUSTINIEL","text":"My partner and I would have done the job ourselves, but before I knew it, my legs had given out from under me, and he has since gone in search of aid, though where he went I cannot say. So here I sit, guarding the eggs."},{"name":"AUGUSTINIEL","text":"Please say you will help us. I fear there is little time before the spriggans find out this location."},{"name":"AUGUSTINIEL","text":"You and your friend will need to carry the pristine Archon egg and midnight Archon egg to the Gold Court. I trust you have the proper caps for the job. There should be two Dreamers there awaiting your arrival. Stay safe, and be wary of the spriggans here on the Steps of Thal."},{"name":"SYSTEM","text":"Carry the Archon egg back to the Gold Court while your arms and legs still have strength."},{"name":"SYSTEM","text":"Beware the spriggans lying in wait around the Steps of Thal. Being caught en route to the Gold Court will result in failure."},{"name":"SYSTEM","text":"You have 180 seconds to reach your destination. Should you fail, return to the starting location and begin anew."},{"name":"AUGUSTINIEL","text":"No need to concern yourself with me. Just make sure the eggs make it safely to the Gold Court."},{"name":"AUGUSTINIEL","text":"The spriggans could be anywhere, so be careful."},{"name":"SYSTEM","text":"You must be wearing a pristine egg cap to carry this egg."},{"name":"SYSTEM","text":"You must be wearing a midnight egg cap to carry this egg."},{"name":"SPRIGAN","text":"You have shiny egg! Shiny pretty egg! Give shiny pretty eeeeeegg! Eeeeeegg!"},{"name":"POPMESSAGE","text":"You lose the Archon egg."},{"name":"SPRIGAN","text":"Shiiiiiiny! Preeeeeetty! Need more eeeeeeggs! Eeeeeeggs!"},{"name":"SYSTEM","text":"This basket seems suitable to hold a pristine Archon egg."},{"name":"SYSTEM","text":"This basket seems suitable to hold a midnight Archon egg."},{"name":"TAMAGOGARD","text":"Hello <span class=\"alternative-container\"><span class=\"alternative\">good lady</span><span class=\"alternative\">good sir</span></span>. Perchance you have seen someone carrying a rather large egg nearby? I am to keep watch over one of the Archon eggs for this year's celebration, but it has yet to be delivered. I pray it arrives soon."},{"name":"TAMAGOGARD","text":"Oh, thank heavens you have arrived. I was beginning to worry the Archon eggs had been lost to those horrible spriggans. I will see that this egg remains secure. Please let Orselfaux know that it is in good hands now."},{"name":"TAMAGOGARD","text":"Fear not, friend. I am much more formidable than I may appear. The spriggans will not lay a furry finger on this egg."},{"name":"ORSELFAUX","text":"Welcome back! I see you managed to outmaneuver the spriggans scurrying about the Steps of Thal."},{"name":"ORSELFAUX","text":"Thanks to you, we now have the last set of Archon Eggs required for Hatching Hour, and our timing today could not be better. These eggs have yet had time to be warmed by the good wishes of the Dreamers here in Ul'dah. When the time is right, we will see them safely shipped to Gridania."},{"name":"ORSELFAUX","text":"Once the spriggans have been expelled from Ul'dah, there will finally be time to look after the egg stocks for this year's festivities."},{"name":"ORSELFAUX","text":"Perhaps now I can also persuade Augustiniel to rest until preparations for the ceremony are complete. "},{"name":"ORSELFAUX","text":"Anyroad, as much as I would love to see Miss Aliapoh's face upon hearing of today's success, I will leave that honor to you, friend. I must ensure the eggs remain safe until sent to Gridania, as well as take care of a certain overzealous Dreamer."},{"name":"ORSELFAUX","text":"Thank you again for your assistance today, friend. Give my regards to Miss Aliapoh in Gridania."},{"name":"JIHLIALIAPOH","text":"My dear <span class=\"highlight\">Forename</span>! It gladdens my heart to see you safe and sound. I could not believe my ears when I heard the news, but your presence proves the messenger's words to be true."},{"name":"JIHLIALIAPOH","text":"Ahahaha! I simply cannot wait! Soon the Archons of ages past will return, and at long last the realm may know peace. There are no words to express my gratitude."},{"name":"JIHLIALIAPOH","text":"Time still remains until Hatching Hour, but it might be best if you remained close at hand. I am certain this is a celebration you wish to be present for."}],"reward":{"gil":382,"items":[{"num":10,"id":7063}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66954]},"next":[66956]},"partials":[{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"7063","obj":{"i":7063,"n":"Bronze Decorative Egg","l":1,"c":21322,"t":85}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}},{"type":"item","id":"2809","obj":{"i":2809,"n":"Midnight Egg Cap","l":40,"c":41102,"t":34,"p":170}},{"type":"quest","id":"66954","obj":{"i":66954,"n":"Nothing to Yolk About","g":199,"l":"Gridania","s":39}},{"type":"quest","id":"66956","obj":{"i":66956,"n":"Hard-boiled","g":199,"l":"Gridania","s":41}}]}