{"quest":{"name":"Egg-hunting We Will Go (Limsa Lominsa)","location":"Limsa Lominsa","id":66951,"patch":2.2,"sort":36,"icon":100244,"eventIcon":71221,"issuer":1007901,"target":1007900,"genre":199,"usedItems":[2659],"journal":["Oscarlet would have you experience the miracle of Hatching–tide.<br>※This quest is available for a limited time only.","Oscarlet teaches you the origins of Hatching–tide, a fledgling festival founded by Jihli Aliapoh, who claims to have been blessed with a vision from the Twelve Archons of the Sixth Umbral Era. Eager to have you partake in the revelry, Oscarlet bids you speak with the celebration's founder, but not before acquiring a pristine egg cap from one of his fellow Dreamers. After donning your festival cap, proceed to Gridania and seek out Jihli Aliapoh, that you may learn more about Hatching–tide.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","There is still time before Hatching Hour, the final ceremony heralding the Twelve Archons' return to Eorzea. To that end, Jihli Aliapoh encourages you to try your hand at egg hunting, a popular Hatching–tide festival activity. She informs you of the different kinds of eggs which can be opened to reveal a gift, or exchanged for eggs of higher quality with richer rewards.<br><br>As you prepare to set out on an egg–hunting adventure, however, she asks that you pay her a visit when you've had your fill of festival games. Though preparations appear to be going as planned, perhaps this year's Hatching–tide is beset with more troubles than she would have you believe."],"objectives":["Equip a pristine egg cap, then speak with Jihli Aliapoh."],"dialogue":[{"name":"SYSTEM","text":"Eorzea is currently celebrating Hatching–tide. Adventurers wishing to partake in the festivities may do so in Limsa Lominsa, Gridania, or Ul'dah."},{"name":"SYSTEM","text":"The rewards will be the same regardless of venue, so do not hesitate to join the celebration in the nation of your choice."},{"name":"OSCARLET","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Can you not sense the excitement in the air? The winds of change sweeping across the fields of Eorzea?"},{"name":"OSCARLET","text":"It is the time of Hatching–tide, and soon the heroes of eld will walk among us once more! Surely, you know the prophecy of which I speak?"},{"name":"OSCARLET","text":"Several years ago, Jihli Aliapoh was blessed with a vision from the Twelve Archons of ages past, sages said to have spared the realm from destruction during the Sixth Umbral Calamity."},{"name":"OSCARLET","text":"In this vision, the Archons spoke unto her words that would change our lives as we knew them:<br>“Rise, young Dreamer, and make ready the vessel for our return.”"},{"name":"OSCARLET","text":"Can you imagine what would happen if these Archons returned to Eorzea?"},{"name":"OSCARLET","text":"Truth be told, I thought very little of this vision when I first caught wind of it. But seeing her work with such spirit─such passion─intrigued me, to say the least. Before long, I too would become a Dreamer, and now I work to spread the good word."},{"name":"OSCARLET","text":"Although we have yet to see the Twelve Archons, we have reason to believe this will be the year they make themselves known to us!"},{"name":"OSCARLET","text":"I find it no coincidence that Jihli Aliapoh's vision occurred shortly before the Seventh Umbral Calamity. If they have indeed returned, then surely they played some part in saving us from the most recent Calamity. Trust me when I say that this year's Hatching–tide will see the Twelve Archons' return."},{"name":"OSCARLET","text":"You will join us in the celebration, won't you? If so, you will need to wear a traditional festival cap. Even though Hatching–tide is a relatively new tradition, there will be no leniency for those who fail to adhere to its rules."},{"name":"OSCARLET","text":"Simply speak with my fellow Dreamers, and they will be more than happy to offer you a pristine egg cap for the celebration."},{"name":"OSCARLET","text":"As for what festivities to expect during Hatching–tide, I can think of no one better than Jihli Aliapoh herself to explain the finer details."},{"name":"OSCARLET","text":"I suggest donning your cap before speaking with her, though, that she may know your intentions right away. She can be found in Gridania─arms ever open to those who would welcome the return of the Twelve Archons of yore."},{"name":"OSCARLET","text":"I would not linger about for too long, lest you miss the return of the Twelve Archons."},{"name":"OSCARLET","text":"Make your way to Gridania, and be sure to put on your pristine egg cap before speaking with Jihli Aliapoh."},{"name":"OSCARLET","text":"My fellow Dreamers will gladly supply you with one."},{"name":"SHOPGURIDANIA","text":"You have come to join in the festivities!? Haha, haha! Here, take this pristine egg cap to start you on your way. And may the Archons of yore bless you and keep you!"},{"name":"POPMESSAGE","text":"You obtain a pristine egg cap."},{"name":"SHOPLIMSA","text":"I take it you have decided to join in the festivities? Excellent! Here is a pristine egg cap to start you on your way. May the Archons of yore bless you and keep you."},{"name":"SHOPURUDAHA","text":"I take it you have decided to join in the festivities? Excellent! Here is a pristine egg cap to start you on your way. May the Archons of yore bless you, and keep you."},{"name":"JIHLIALIAPOH","text":"Greetings, friend. Have you come to join us in the celebration of Hatching–tide?"},{"name":"JIHLIALIAPOH","text":"If so, you will need a proper headpiece before you can partake of the festivities. There are several to be seen over the course of the celebration, but I believe a pristine egg cap will suffice to start."},{"name":"JIHLIALIAPOH","text":"Simply speak with one of my Dreamers and they will gladly offer one to you."},{"name":"JIHLIALIAPOH","text":"Ah, I take it you are interested in the celebration of Hatching–tide."},{"name":"JIHLIALIAPOH","text":"Allow me to introduce myself. My name is Jihli Aliapoh, and mine is the vision that foresaw the return of the Twelve Archons from ages past. Oscarlet told me you would be coming, but he failed to mention your name."},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename Surname</span>, is it? Well, <span class=\"highlight\">Forename</span>, there is still time until Hatching Hour. Might I suggest a bit of egg hunting to pass the time? This is Hatching–tide, after all, and no one can truly say they have celebrated this day without partaking in an egg hunt."},{"name":"JIHLIALIAPOH","text":"Bear in mind, however, this is no simple ramble about Gridania. Eggs have been hidden in fields all across Eorzea, each containing a different prize."},{"name":"JIHLIALIAPOH","text":"Three types have been hidden for the hunt: bronze, silver, and golden! Bronze eggs are the most common of the three, and it will be a laborious task to obtain the rarer sort. Golden eggs are without question the rarest, with rewards as precious as the gilded containers that bear them."},{"name":"JIHLIALIAPOH","text":"Feel free to open any eggs you come across, but if you seek eggs of higher quality, bring what you have to one of my Dreamers. In exchange for bronze, they will offer you silver eggs, and for silver they will offer you golden eggs."},{"name":"JIHLIALIAPOH","text":"When you are not too busy hunting eggs, however, I would ask for your help in preparing for Hatching Hour. Although preparations are proceeding as planned, the welcoming of the Twelve Archons must be perfect, and the assistance of an able–bodied adventurer would put my mind at ease."},{"name":"JIHLIALIAPOH","text":"But for now, I bid you safe travels as you partake of our Hatching–tide revelry. When you are ready to hear my request, I will be here waiting for you. May the Archons of yore bless you and keep you."}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[66953]},"partials":[{"type":"npc","id":"1007901","obj":{"i":1007901,"n":"Oscarlet","l":28,"q":1}},{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}},{"type":"quest","id":"66953","obj":{"i":66953,"n":"Eggsigent Circumstances","g":199,"l":"Gridania","s":38}}]}