{"quest":{"name":"Submission Impossible","location":"Mor Dhona","id":66958,"patch":2.2,"sort":150,"unlocksFunction":1,"eventIcon":71341,"issuer":1006969,"target":1006969,"involved":[1001304],"genre":95,"journal":["Wiscard has a once-in-a-lifetime opportunity for you. How could you <span class=\"emphasis\">possibly</span> pass it up?","Wiscard confides that there are energies at work in every action, which constrain him from seeking payment for a very valuable skill he would teach you. But of course, you are happy to perform a small errand for him in return, and deliver a letter to Rowena.","Rowena receives the message with ill grace. Her facility for curses is impressive, but you are left wondering why anyone would fall into arrears with this daughter of the Fury. Your ears still ringing with invectives, return now to Wiscard.","From Wiscard's reaction, you get an inkling of what all this talk of energy exchange might mean, and ponder over public persona and private predilections. Rather than go down this primrose path, it might be best to simply purchase whatever tomes from Tataroga you find desirable; only then can you learn the master crafting recipes held within..."],"objectives":["Deliver the letter to Rowena.","Report to Wiscard."],"dialogue":[{"name":"WISCARD","text":"Let me guess─no, not guess─let me <span class=\"emphasis\">tell</span> you why you're not happy. You, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> adventurer, are not fulfilling your potential as a crafter!"},{"name":"WISCARD","text":"Now, what I'm going to do is teach you how to craft a glamour prism. And I will not accept a single gil. Do you know why? Bad energy!"},{"name":"WISCARD","text":"...No doubt you are ill at ease accepting such a valuable gift without lifting a finger in return. Well, if you feel you <span class=\"emphasis\">must</span> do something, you can take this letter to Rowena─with my undying love!"},{"name":"WISCARD","text":"Worry not! Just let my words be your guide once you stand before Rowena, her arms akimbo, her eyes scornful... Look, adventurer to adventurer, may I tell you something? I'm sure you'll go far in this world! Someday, you may be standing where I am, blazing trails and taking charge.<br>Remember, every delivery is also a <span class=\"emphasis\">deliverance</span>!"},{"name":"ROWENA","text":"You again, messenger <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>? What do you want o' me now?"},{"name":"ROWENA","text":"Not that fool Wiscard again! Undyin' love, he says? In debt to me up to his neck, and writin' to beg for more time to repay... Hah! Not bloody likely!"},{"name":"ROWENA","text":"&lt;sigh&gt; Right delusional, that one. Plays at bein' a man, but he's no more than a worm. I'd spit in his eye and tell the world what a puddle o' piss he is, were he standin' before me!"},{"name":"ROWENA","text":"<span class=\"emphasis\">Undyin</span>'s a good sort o' word, though. Tell him I'm doublin' his interest─his debt's goin' to live just about forever! As far as I'm concerned, he can crawl on all fours, lickin' up crumbs and scrabblin' for dropped gil."},{"name":"ROWENA","text":"What a fool. Got plenty o' good wares, but he won't get off his arse and turn 'em into profit. He could get square with me and then some, if he wanted to."},{"name":"ROWENA","text":"Tell him to fall into his pease porridge and die, for all I care. I'll sell off his corse to the resurrection men for a few coppers."},{"name":"WISCARD","text":"Hahaha, magnificent! I witnessed all! You might not have heard me, but I can assure you I was applauding the entire while!"},{"name":"WISCARD","text":"The cutting words, the enfeebling images! She raises excoriation to the realm of art. A realm...a dominion over which she rules with an iron hand, forcing her wretched subject to grovel in the dirt!"},{"name":"WISCARD","text":"That, my <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> adventurer, is the secret! It's about balancing energies. Dark and light, high and low. But enough of philosophy─on to practical things! The making of glamour prisms you shall learn!"},{"name":"WISCARD","text":"...Though not from me. Alas, Mistress Rowena has yoked me to a truly backbreaking debt. She bids me get down to business, and that is what I must do."},{"name":"WISCARD","text":"But fear not! Everything you need to know about crafting the prism can be found in the tomes Tataroga deals in! And they can all be yours for a special low price! Don't let these deals pass you by!"},{"name":"SYSTEM","text":"You may now purchase master crafting tomes from Tataroga, as well as Goberin in Vesper Bay."},{"name":"SYSTEM","text":"By using the tomes, you can learn the recipes within."}],"reward":{"items":[{"id":7671}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":33}],"quests":[66957]}},"partials":[{"type":"npc","id":"1006969","obj":{"i":1006969,"n":"Wiscard","l":67,"q":2}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"item","id":"7671","obj":{"i":7671,"n":"Clear Prism","l":35,"c":26226,"t":48,"p":200}},{"type":"quest","id":"66957","obj":{"i":66957,"n":"A Self-improving Man","g":95,"l":"Mor Dhona","s":150,"f":1}}]}