{"quest":{"name":"Eggsigent Circumstances","location":"Gridania","id":66953,"patch":2.2,"sort":38,"icon":100245,"eventIcon":71221,"issuer":1007900,"target":1007900,"genre":199,"usedItems":[2659,2707],"journal":["Jihli Aliapoh seeks an adventurer's aid in preparing for Hatching Hour.<br>※This quest is available for a limited time only.","Jihli Aliapoh tells you of her vision which inspired the designs for this year's Hatching–tide eggs. However, because the celebration requires eggs, both great and small, in seemingly unreasonable quantities, the frequent delivery of these goods has caught the eye of local spriggans. Ever wont to procure all things small and round, they now work to make all the eggs their own, stealing the Archon eggs in the process.<br><br>Maisenta of Black Rabbit Traders dispatched men to retrieve two of the eggs, which have since been delivered to the Yellow Serpent Gate. With spriggans now forcing their way into Gridania, however, she can spare no one to bring them further into town. Jihli implores you to retrieve the eggs, that they may serve as vessels for the Twelve Archons.<br><br>Before you set off to retrieve them, however, she offers you a warning: the Archon eggs may only be touched by one who bears their mark. In order to transport both eggs to a safe location in a timely manner, join forces with another adventurer. One of you must wear a pristine egg cap, the other a vibrant egg cap. When you have found a comrade-in-arms, and are both wearing an appropriate cap, speak with Augustiniel at the Yellow Serpent Gate.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have arrived at the Yellow Serpent Gate, relieved to find Augustiniel and the Archon eggs safe and sound. Although ill equipped to deliver the eggs to Jihli Aliapoh himself, Augustiniel is confident that you and your friend can outwit the spriggans that have managed to find their way into town. Together with your comrade, don your respective caps to transport the pristine Archon egg and vibrant Archon egg to Mih Khetto's Amphitheatre.","You have picked up one of the Archon eggs. See that it is carried safely to Mih Khetto's Amphitheatre, avoiding any spriggans that may cross your path.","Averting the fuzzy grasp of the spriggans, you have safely transported your Archon egg to its rightful place at Mih Khetto's Amphitheatre. Trust your faithful companion to have done the same, and speak with Jihli Aliapoh to inform her of the good news.","Jihli Aliapoh is beside herself with joy to hear that two of the Archon eggs have been returned. Thanks to your selfless actions, this year's Hatching–tide may still yet prove to be a success. Until all of the eggs have been retrieved, however, it might be best to stay close to Jihli in case your talents are needed once more."],"objectives":["Form a party of two, then speak with Augustiniel while wearing an appropriate egg cap.","Pick up the Archon egg matching your cap.","Deliver the Archon egg to Mih Khetto's Amphitheatre.","Report to Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Hello there, <span class=\"highlight\">Forename</span>! Have you had your fill of egg hunting? I certainly hope so, because I have much and more to discuss with you."},{"name":"JIHLIALIAPOH","text":"Hmmm... The question now is where to begin? You see, before I began preparations for this year's celebration, I was granted another vision. Long has it been since the Twelve Archons have seen fit to bless me with their foresight."},{"name":"JIHLIALIAPOH","text":"I dreamt of a resplendent ring of eggs, shining with an intensity that would inspire jealousy from the stars. From within this ring arose a figure bathed in light. Although I could not clearly discern who it was, I knew it was one of the heroes of yore for whom I have waited all these years."},{"name":"JIHLIALIAPOH","text":"I immediately put to paper the egg designs from my vision, that our finest craftsmen could prepare the vessels we require. They were finished not long ago, and were to be shipped here in time for the ceremony, but..."},{"name":"MAISENTA","text":"(-???-)It would appear a band of spriggans has made off with the Archon eggs."},{"name":"MAISENTA","text":"Pardon the intrusion. I take it you are here to assist in the recovery of our eggs? I am Maisenta of Black Rabbit Traders. I've been assisting with the distribution of goods for the egg hunt."},{"name":"MAISENTA","text":"As you can imagine, a great number of eggs have been transported back and forth between the three city–states in preparation for Hatching–tide. The spriggans─with their insatiable need for small, ovoid objects─have taken notice, and are stealing any eggs they can find, including the Archon eggs."},{"name":"JIHLIALIAPOH","text":"Have my Dreamers not yet ascertained their whereabouts?"},{"name":"MAISENTA","text":"Well, two of the eggs were recovered in Treespeak not long ago and were carried to the Yellow Serpent Gate. Unsurprisingly, however, the spriggans who stole the eggs in the first place immediately gave chase, and have since infiltrated Gridania. I can only assume they mean to take them back."},{"name":"JIHLIALIAPOH","text":"Ah! <span class=\"highlight\">Forename</span>, we cannot let them have the vessels! You must retrieve the Archon eggs and bring them here for safekeeping. Though, before you go, there is something you must know... It concerns the festival headpiece you received from my Dreamers."},{"name":"JIHLIALIAPOH","text":"In the vision that blessed me with patterns to be used for the Archon eggs, there was also a warning: the vessels may only be touched by those who bear their mark."},{"name":"MAISENTA","text":"We thought it prudent to adhere to this warning when bringing the eggs to the Yellow Serpent Gate, and two of my men retrieved them wearing caps provided by the Dreamers. Unfortunately, our hands are now full handling the spriggan incursion."},{"name":"MAISENTA","text":"If you'd help us, we need you to retrieve a pristine and a vibrant Archon egg, so make sure you're equipped with the right headgear. If you're lacking the proper cap, you can purchase one from the Dreamers."},{"name":"MAISENTA","text":"As for the spriggans that still linger here in Gridania, I have an idea. Because you may only carry the egg which bears the pattern of your cap, attempting to carry both will make you an easy target for the spriggans."},{"name":"MAISENTA","text":"But if you were to join forces with another adventurer, I imagine the spriggans would have trouble chasing you both. Before you make your way to the Yellow Serpent Gate, one of you will need to wear a pristine egg cap, and the other a vibrant egg cap."},{"name":"JIHLIALIAPOH","text":"Ha! Truly, this is to be a chase long remembered! Now, off you go, and speak with Augustiniel when you arrive at the Yellow Serpent Gate. He's been charged with protecting the eggs, but I fear it will not be long before the spriggans find him."},{"name":"MAISENTA","text":"We're counting on you, adventurer! There can be no Hatching–tide without those eggs."},{"name":"JIHLIALIAPOH","text":"When you have found a companion to assist you, please make haste to the Yellow Serpent Gate."},{"name":"JIHLIALIAPOH","text":"If you require a pristine egg cap or vibrant egg cap to carry the sacred vessels, speak with one of my Dreamers."},{"name":"AUGUSTINIEL","text":"I apologize, friend, but I have no time for small talk. I have been charged with the protection of these eggs until their carriers arrive."},{"name":"AUGUSTINIEL","text":"If you should come across a pair of adventurers, one wearing a pristine egg cap and the other a vibrant egg cap, direct them here immediately. Time is of the essence!"},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are too far away."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are not equipped with the appropriate egg cap."},{"name":"AUGUSTINIEL","text":"Welcome, comrades! By your headwear, there is no doubt my dear Miss Aliapoh sent you, and not a moment too soon. I trust, then, you have heard the good word."},{"name":"AUGUSTINIEL","text":"Hmmm? I can't say I follow your friend there, but surely <span class=\"emphasis\">you</span> must know of the word."},{"name":"AUGUSTINIEL","text":"No, not birds, my friend, the eggs─the Archon eggs to be precise. They were retrieved from Treespeak without a scratch, and are ready for transport to their final destination."},{"name":"AUGUSTINIEL","text":"I have managed to keep the eggs safe thus far, but for lack of an assistant and a pair of egg caps, I dare not attempt to take them further. You and your friend here certainly seem capable of outmaneuvering a few spriggans, though."},{"name":"AUGUSTINIEL","text":"I leave the eggs in your hands. But be mindful of your caps, lest you offend the heroes for which this day was founded."},{"name":"SYSTEM","text":"Carry the Archon egg back to Mih Khetto's Amphitheatre while your arms and legs still have strength."},{"name":"SYSTEM","text":"Beware the spriggans lying in wait around Old Gridania. Being caught en route to the amphitheatre will result in failure."},{"name":"SYSTEM","text":"You have 180 seconds to reach your destination. Should you fail, return to the starting location and begin anew. "},{"name":"AUGUSTINIEL","text":"Make haste to the amphitheatre, friend. There is no telling when those fuzzy fiends will come for the eggs."},{"name":"AUGUSTINIEL","text":"So long as your cap bears the mark of the egg you mean to carry, the Archons of yore will see you safely through."},{"name":"JIHLIALIAPOH","text":"I am relieved to hear that Augustiniel has returned safely to Gridania, but I fear the spriggans will find the Archon eggs before long. Please hurry and retrieve them from the Yellow Serpent Gate."},{"name":"SYSTEM","text":"You must be wearing a pristine egg cap to carry this egg."},{"name":"SYSTEM","text":"You must be wearing a vibrant egg cap to carry this egg."},{"name":"SPRIGAN","text":"You have shiny egg! Shiny pretty egg! You give shiny pretty eeeeeegg! Eeeeeegg!"},{"name":"POPMESSAGE","text":"You lose the Archon egg."},{"name":"SPRIGAN","text":"Shiiiiiiny! Preeeeeetty! Need more eeeeeeggs! Eeeeeeggs!"},{"name":"SYSTEM","text":"This basket seems suitable to hold the pristine Archon egg."},{"name":"SYSTEM","text":"This basket seems suitable to hold the vibrant Archon egg."},{"name":"JIHLIALIAPOH","text":"Welcome back, <span class=\"highlight\">Forename</span>. Please tell me the spriggans did not escape with the Archon eggs."},{"name":"JIHLIALIAPOH","text":"Blessed be! They are safe and sound? Oh, what wonderful news!"},{"name":"JIHLIALIAPOH","text":"With but two vessels for the Archons, however, there can be no celebration just yet. "},{"name":"JIHLIALIAPOH","text":"My Dreamers are searching high and low for the remaining vessels as we speak. It should not be long before their locations are made known."},{"name":"JIHLIALIAPOH","text":"Fortune has smiled upon me this day, to have encountered such an exceptional adventurer! I bid you safe travels till fate should choose we cross paths once more. May the Archons of yore bless you and keep you."}],"reward":{"gil":382,"items":[{"num":10,"id":7063}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66950,66951]},"next":[66954]},"partials":[{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"7063","obj":{"i":7063,"n":"Bronze Decorative Egg","l":1,"c":21322,"t":85}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}},{"type":"item","id":"2707","obj":{"i":2707,"n":"Vibrant Egg Cap","l":20,"c":41104,"t":34,"p":28}},{"type":"quest","id":"66950","obj":{"i":66950,"n":"Egg-hunting We Will Go (Gridania)","g":199,"l":"Gridania","s":35}},{"type":"quest","id":"66951","obj":{"i":66951,"n":"Egg-hunting We Will Go (Limsa Lominsa)","g":199,"l":"Limsa Lominsa","s":36}},{"type":"quest","id":"66954","obj":{"i":66954,"n":"Nothing to Yolk About","g":199,"l":"Gridania","s":39}}]}