{"quest":{"name":"Hard-boiled","location":"Gridania","id":66956,"patch":2.2,"sort":41,"icon":100248,"eventIcon":71221,"issuer":1007900,"target":1007900,"genre":199,"usedItems":[2659,2707,2751,2809],"journal":["Jihli Aliapoh seems distressed about Hatching Hour.<br>※This quest is available for a limited time only.","You have arrived at Mih Khetto's Amphitheatre to find Jihli Aliapoh in tears, and the Archon eggs nowhere to be found. With all the eggs assembled together in Gridania, it would seem another gang of spriggans seized the opportunity to steal them all in one fell swoop. As luck would have it, however, Augustiniel and his fellow Dreamers crossed paths with these furry fiends, and managed to reclaim two of the pristine variety. Moreover, Maisenta of Black Rabbit Traders has convinced the Wood Wailers to seal off the city, so that not one spriggan can escape.<br><br>As the hour of the Archons approaches, there is much to do, and too few hands to both prepare for the ceremony and relieve the spriggans of their stolen goods. Four Archon eggs remain in the spriggans' custody, and Maisenta asks that you find three able adventurers to help you retrieve them. Once you have teamed up with three fellow adventurers, speak with Augustiniel to see if the Dreamers have discovered the stolen eggs' whereabouts.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","With three faithful companions in tow, you have arrived back at Mih Khetto's Amphitheatre, where Augustiniel has just received word of the Archon eggs' whereabouts. The Wood Wailers have confirmed that the remaining pristine egg is near the Botanists' Guild, the vibrant egg is outside the Conjurers' Guild, the brilliant egg is at Westshore Pier, and the midnight egg is next to the Leatherworkers' Guild. He asks that you decide amongst yourselves who will retrieve which egg, then bids that you see them delivered before Hatching Hour. Wearing your respective caps, carry one of the four Archon eggs together with your companions, and return it to Mih Khetto's Amphitheatre.","You have picked up one of the Archon eggs. See that it is carried safely to Mih Khetto's Amphitheatre, avoiding any spriggans that may cross your path.","You and your comrades return the Archon eggs to Mih Khetto's Amphitheatre with nary a scratch. With the eggs finally assembled, and Hatching Hour nearly upon you, Jihli Aliapoh instructs her fellow Dreamers to prepare for their final rehearsal. Just as they begin to take their places, Augustiniel asks of you one last favor to help prepare for the ceremony. As one would surely guess, presentation is very important, and so he asks you to assemble the eggs together onstage.<br><br>After placing the final egg in its basket, Jihli Aliapoh is suddenly taken aback by the scene before her. As you stand encircled by the ring of Archon eggs, she comes to the realization that her vision has at last come to pass. It would appear the hero that she foresaw did not appear from within the casing of the eggs, but from within the ring itself. Although the Twelve Archons did not make their return to Eorzea, the celebration has brought people together in the spirit of what they stood for. To that end, Jihli would call this year's Hatching–tide a success.","Although your presence in Gridania has left no need for this year's Hatching Hour, Jihli Aliapoh still wishes to thank you for all you have done for her. To that end, she bestows upon you a gift that she had kept for the hero she dreamed of those many years past."],"objectives":["Form a party of four, then speak with Augustiniel while wearing an appropriate egg cap.","Pick up the Archon egg matching your cap.","Deliver the Archon egg to the amphitheatre stage.","Speak with Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"&lt;sob&gt; Oh, <span class=\"highlight\">Forename</span>... Something... &lt;sniffle&gt; Something horrible has happened."},{"name":"JIHLIALIAPOH","text":"The eggs have been stolen! All of our efforts to retrieve them, wasted... The time of Hatching Hour is nearly upon us, but the Twelve Archons cannot return if they have no vessels. I fear my vision has been proven false."},{"name":"AUGUSTINIEL","text":"(-???-)It may yet be proven true, my dear Miss Aliapoh!"},{"name":"OSCARLET","text":"The spriggans are still up to their usual mischief, but we've managed to retrieve two pristine eggs for the ceremony. There is still time to find the remaining Archon eggs."},{"name":"ORSELFAUX","text":"But it was thanks to Miss Aliapoh's visions that we deduced their locations the first time. There is simply no telling where the spriggans will take them now."},{"name":"MAISENTA","text":"The Wood Wailers have already been informed of the theft. They have agreed to post guards at every entrance to Gridania, leaving the spriggans nowhere to run. All that remains is to find them and take back the eggs."},{"name":"AUGUSTINIEL","text":"Then let us begin the search. Between the four of us and our adventurer friend here, surely we can outsmart a few rogue spriggans."},{"name":"JIHLIALIAPOH","text":"No, no, no! That simply will not do. Augustiniel, you and the others must finish preparations for the ceremony. Even if you <span class=\"emphasis\">were</span> to find the vessels, it would be meaningless if everything is not in order when the Hatching Hour strikes."},{"name":"MAISENTA","text":"The Wood Wailers and I will see to the search, but we will require assistance in moving them once found. This needs to be done swiftly, so it would be prudent to move them all at once."},{"name":"MAISENTA","text":"Adventurer, if you would help us, I need you to find three others willing to join our cause."},{"name":"AUGUSTINIEL","text":"Why, just the pleasure of meeting <span class=\"emphasis\">me</span> should suffice to entice a few hearty adventurers to accompany you!"},{"name":"AUGUSTINIEL","text":"When you are all capped and ready, come speak with me. We should have the locations of the Archon eggs by the time you return."},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename</span>, this is our last chance to retrieve the eggs. The return of the Twelve Archons and this year's celebration depend on your success."},{"name":"AUGUSTINIEL","text":"Just tell your friends they will have the chance to meet me, and I guarantee they will line up from here to Ul'dah."},{"name":"AUGUSTINIEL","text":"We should have ascertained the location of the eggs by the time you return. We must reclaim the eggs before the time of Hatching Hour, so please hurry."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are too far away."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are not equipped with the appropriate egg cap."},{"name":"AUGUSTINIEL","text":"Welcome back. You've done well to gather the numbers we needed in such a short time. Thankfully, we just received word of the Archon eggs' locations."},{"name":"AUGUSTINIEL","text":"The last pristine Archon egg was found just outside of the Botanists' Guild, and the vibrant Archon egg was confirmed to be outside the Conjurers' Guild."},{"name":"AUGUSTINIEL","text":"The brilliant Archon egg is in the vicinity of Westshore Pier, and the midnight Archon egg is near the Leatherworkers' Guild."},{"name":"AUGUSTINIEL","text":"You can decide amongst yourselves who will retrieve which egg, just make sure to bring them back as quickly as possible."},{"name":"AUGUSTINIEL","text":"And beware the spriggans. The city has been closed off, after all, so you are likely to find them lingering about."},{"name":"AUGUSTINIEL","text":"Now, off you go! There is still much I must do before the four of you return with the eggs."},{"name":"SYSTEM","text":"Carry the Archon egg back to Mih Khetto's Amphitheatre while your arms and legs still have strength."},{"name":"SYSTEM","text":"Beware the spriggans lying in wait around Old Gridania. Being caught en route to Mih Khetto's Amphitheatre will result in failure."},{"name":"SYSTEM","text":"You have 180 seconds to reach your destination. Should you fail, return to the starting location and begin anew."},{"name":"AUGUSTINIEL","text":"Which of the Archon eggs were you going to retrieve, again? Was it the brilliant egg near Westshore Pier? Or was it the midnight egg near the Leatherworkers' Guild?"},{"name":"AUGUSTINIEL","text":"Wait, no, don't tell me. It was the pristine egg near the Botanists' Guild! No? Well, the only one left is the vibrant egg near the Conjurers' Guild, so either I was right, or you're playing games with me."},{"name":"AUGUSTINIEL","text":"But we have no time for that now. You and your friends must hurry and bring the remaining eggs back here to Mih Khetto's Amphitheatre."},{"name":"AUGUSTINIEL","text":"I realize it must pain you to do this without me, but there are other matters I must attend to before the ceremony."},{"name":"SYSTEM","text":"You must be wearing a pristine egg cap to carry this egg."},{"name":"SYSTEM","text":"You must be wearing a vibrant egg cap to carry this egg."},{"name":"SYSTEM","text":"You must be wearing a brilliant egg cap to carry this egg."},{"name":"SYSTEM","text":"You must be wearing a midnight egg cap to carry this egg."},{"name":"SPRIGAN","text":"Eeeeeegggggg! Preeettyyy! Shiiinyyy! You give shiiinyyy!"},{"name":"POPMESSAGE","text":"You lose the Archon egg."},{"name":"SPRIGAN","text":"Shiiiiiiny! Preeeeeetty! Need more eeeeeeggs! Eeeeeeggs!"},{"name":"SYSTEM","text":"This is a suitable location to place the pristine Archon egg."},{"name":"SYSTEM","text":"This is a suitable location to place the vibrant Archon egg."},{"name":"SYSTEM","text":"This is a suitable location to place the brilliant Archon egg."},{"name":"SYSTEM","text":"This is a suitable location to place the midnight Archon egg."},{"name":"AUGUSTINIEL","text":"Welcome back, hero! I knew you and your friends would pull through. Now all of the eggs for the celebration are back where they belong."},{"name":"JIHLIALIAPOH","text":"Oh, my dear <span class=\"highlight\">Forename</span>, you know not the great deed you have done this day. Thanks to you, we may begin our final rehearsal before the ceremony."},{"name":"AUGUSTINIEL","text":"Perhaps you were not aware, but I am not just a Dreamer, but also a singer. Soon you shall bear witness to the beauty that is my voice."},{"name":"AUGUSTINIEL","text":"But before we begin, might I ask that you assemble the eggs onstage for us? I realize you must be weary of carrying them to and fro, but we'd like to get an idea of how the stage will appear when everyone is in place."},{"name":"JIHLIALIAPOH","text":"&lt;gasp&gt; By the Twelve!<br>I... I cannot believe it... My vision... It has come to pass!"},{"name":"JIHLIALIAPOH","text":"What I saw years past was only a <span class=\"emphasis\">glimpse</span> of what was to be, but...as I look at you..."},{"name":"JIHLIALIAPOH","text":"It was not until the Calamity was upon us that I could begin to grasp the purport of my first vision several years past. But now that you stand here before us today... <span class=\"highlight\">Forename</span>! It was you all along!"},{"name":"JIHLIALIAPOH","text":"There is no questioning the power possessed by the Archons of yore; that much is true. But I realize now that the notion they would be reborn again here, in the present...is naught but a childish dream."},{"name":"JIHLIALIAPOH","text":"Fitting, I think, that we would come to call ourselves Dreamers. Although we have dreamt of heroes long since past, I see now that the Archons of my vision were heroes in the here and now─heroes who would pull the realm back from the brink of destruction at the hands of the Seventh Calamity."},{"name":"JIHLIALIAPOH","text":"This celebration was founded in the hopes of seeing heroes made manifest, and I believe your actions henceforth will see those hopes bear fruit."},{"name":"JIHLIALIAPOH","text":"Before us stands an Archon come anew. And I have no doubt that you will lead the realm to a brighter future, as you led this Hatching–tide to a rousing success!"},{"name":"JIHLIALIAPOH","text":"Let us take to heart the lessons we have learned this day, that we all may strive toward a better future. For it was through goodwill and unity that we saved Hatching–tide, and it is that same sense of common purpose that shall serve to protect the realm."},{"name":"OSCARLET","text":"This was certainly an unexpected turn of events. But it would seem this year's celebration was a success all the same."},{"name":"MAISENTA","text":"And here I thought the hero would appear from <span class=\"emphasis\">inside</span> the Archon eggs. Though, technically, I suppose you did, didn't you?"},{"name":"AUGUSTINIEL","text":"Hahaha... That you would end up being the hero from her vision... You have certainly outdone yourself this day."},{"name":"OSCARLET","text":"（★未使用／削除予定★）"},{"name":"ORSELFAUX","text":"Perhaps our brave friend here is one of the fabled Warriors of Light."},{"name":"OSCARLET","text":"Who else would strive so hard to save our celebration, uniting the Dreamers of the three great nations? If you were indeed a Warrior of Light, it would not surprise me."},{"name":"MAISENTA","text":"Well, to be honest, I cannot rightly say I believe in this talk of visions, or the return of Archons from the past. That aside, you have ensured the success of this year's Hatching–tide, which I might add has been quite profitable for Black Rabbit Traders. For that, you have my thanks."},{"name":"MAISENTA","text":"And as luck would have it, there is still time to spare until the end of Hatching–tide."},{"name":"JIHLIALIAPOH","text":"Haha, haha! A point that should not be forgotten! Let us make merry and embark on one last egg hunt, in the spirit of Hatching–tide and the newfound hope this day has brought us!"},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)May the Archons of old watch over this newcome <span class=\"alternative-container\"><span class=\"alternative\">heroine</span><span class=\"alternative\">hero</span></span>, that the realm may someday know peace."},{"name":"JIHLIALIAPOH","text":"My dear <span class=\"highlight\">Forename</span>, there is no way I could begin to repay your kindness, but I would still ask that you accept this small gift."},{"name":"JIHLIALIAPOH","text":"I had saved this for the day when I would meet the figure that appeared in my vision...and today is that day, <span class=\"highlight\">Forename</span>. Thank you for everything."}],"reward":{"items":[{"id":7550}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66955]}},"partials":[{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"7550","obj":{"i":7550,"n":"Egg Harness","l":1,"c":58573,"t":63}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}},{"type":"item","id":"2707","obj":{"i":2707,"n":"Vibrant Egg Cap","l":20,"c":41104,"t":34,"p":28}},{"type":"item","id":"2751","obj":{"i":2751,"n":"Brilliant Egg Cap","l":30,"c":41103,"t":34,"p":100}},{"type":"item","id":"2809","obj":{"i":2809,"n":"Midnight Egg Cap","l":40,"c":41102,"t":34,"p":170}},{"type":"quest","id":"66955","obj":{"i":66955,"n":"The Yolks on Us","g":199,"l":"Gridania","s":40}}]}