{"quest":{"name":"Nothing to Yolk About","location":"Gridania","id":66954,"patch":2.2,"sort":39,"icon":100246,"eventIcon":71221,"issuer":1007900,"target":1007900,"genre":199,"usedItems":[2659,2751],"journal":["Jihli Aliapoh has discovered the location of two more Archon eggs, and would once again ask for your aid.<br>※This quest is available for a limited time only.","Jihli Aliapoh has been granted another vision, revealing the location of two more Archon eggs along the beaches of Costa del Sol. She has sent her Dreamers to retrieve the eggs, and asks that you seek out Oscarlet in Limsa Lominsa, and ensure they have been retrieved without incident.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have arrived in Limsa Lominsa to discover the two eggs have been transported unharmed, but their carriers were attacked by a gang of spriggans in the process. What's more, they have forced their way through the city gates and now scour the decks in search of the Archon eggs. Oscarlet informs you that Augustiniel was one of the two tasked with egg delivery, and has since made his way to the Coral Tower, perhaps in the hope of eluding the rogue spriggans now roaming the decks of Limsa Lominsa. Injured and with only one way in or out of the Coral Tower, however, there will be no escape should a second confrontation with the spriggans take place.<br><br>The eggs must be moved as quickly as possible, but both eggs cannot be carried alone. To see the eggs safely back to the Aftcastle, you must seek the aid of another adventurer. One of you must wear a pristine egg cap, and the other a brilliant egg cap. Join forces with a fellow adventurer and make your way to the Coral Tower, where you will prepare to relocate the Archon eggs.","Upon reaching the Coral Tower, you find Augustiniel still weary from his encounter with the spriggans. Although he assures you the eggs are safe at present, the air of disconcertion about him would suggest otherwise. If they are to be delivered without incident, both you and your partner must carry an egg to the Aftcastle. Wearing the cap you have chosen, pick up your matching Archon egg and prepare for some fancy footwork.","You have picked up one of the Archon eggs. See that it is carried safely to the Aftcastle, avoiding any spriggans that may cross your path.","With a watchful eye, you and your comrade have navigated your way to the Aftcastle, delivering the Archon eggs to a safe location. Report to Oscarlet and confirm if there is aught else that needs be done.","With a sigh of relief, Oscarlet thanks you for your deft delivery of the eggs. The matter of invading spriggans remains, but he takes satisfaction in knowing the eggs will be nurtured by the warmth of resident Dreamers until the time of Hatching Hour. Return to Gridania and inform Jihli Aliapoh of your success.","Jihli Aliapoh is all too delighted to hear the Archon eggs in Limsa Lominsa have been secured once more. She informs you that there are but a few eggs left to be recovered, and the tone of excitement in her voice is unmistakable. With time still remaining until the egg ceremony, Jihli bids you take a much-needed rest."],"objectives":["Speak with Oscarlet in Limsa Lominsa while wearing a pristine egg cap.","Form a party of two, then speak with Augustiniel while wearing an appropriate egg cap.","Pick up the Archon egg matching your cap.","Deliver the Archon egg to the Aftcastle.","Speak with Oscarlet.","Report to Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename</span>! Your presence is ever heartening, though I wish we could speak under less adverse conditions."},{"name":"JIHLIALIAPOH","text":"It might be best to start with the description of another of my dreams. In the last one, I had a vision of two Archon eggs nestled in the sands of a beach, where waves of cerulean blue lapped lazily to shore. Glimpsing a lighthouse in the distance, I immediately knew where they were─Costa del Sol."},{"name":"JIHLIALIAPOH","text":"And sure enough, when I sent my Dreamers to check, there they were! They are currently on their way to Limsa proper, and it should not be long before they arrive. I would like you to go and see to their safety."},{"name":"JIHLIALIAPOH","text":"Pray seek out Oscarlet to confirm the whereabouts of the Archon eggs. Like Augustiniel, he currently oversees the Hatching–tide celebration in Limsa."},{"name":"JIHLIALIAPOH","text":"He is expecting your arrival, but make sure to wear your pristine egg cap so he knows you mean to help. Now go, my friend. The success of this year's celebration hinges on retrieval of the eggs."},{"name":"JIHLIALIAPOH","text":"Please make haste to Limsa, and ensure the eggs have been handled with care."},{"name":"JIHLIALIAPOH","text":"And do not forget your pristine egg cap, lest Oscarlet fail to recognize you when you arrive."},{"name":"OSCARLET","text":"Hello there, friend. Are you by chance the adventurer Miss Aliapoh has sent to assist with the eggs? You resemble the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> she described, but she also mentioned a pristine egg cap. Excuse my ramblings, I must be mistaken."},{"name":"OSCARLET","text":"Ah, hello, my <span class=\"alternative-container\"><span class=\"alternative\">dear lady</span><span class=\"alternative\">good sir</span></span>. I take it Miss Aliapoh sent you to ensure the security of the Archon eggs, yes?"},{"name":"OSCARLET","text":"Well, you'll be happy to know we found the two eggs not long ago at Costa del Sol, just as she foresaw them."},{"name":"OSCARLET","text":"Augustiniel, the audacious fellow that he is, insisted that he and his partner be the ones to see them brought into Limsa, although I daresay he's gotten in over his head this time."},{"name":"OSCARLET","text":"Spriggans followed them in through the Tempest Gate, but somehow they managed their way to the Coral Tower. Augustiniel was injured in the process, but I would say he did quite well in comparison to his partner. The poor lad will be in the infirmary for weeks."},{"name":"OSCARLET","text":"At any rate, with only one way in or out of the Coral Tower, it would not bode well for Augustiniel to be found with the eggs in his condition. I need you to bring them here, where I can keep a closer eye on them until such time as they are ready for delivery to Gridania."},{"name":"OSCARLET","text":"I realize this cannot be done alone, but I trust you can find a companion to accompany you, yes? When you are ready, don your respective caps and make your way to Augustiniel. The eggs to be carried are a pristine Archon egg and a brilliant Archon egg, so prepare accordingly."},{"name":"OSCARLET","text":"When you've found your companion, proceed to the Coral Tower and see the eggs are delivered here posthaste."},{"name":"OSCARLET","text":"And please, do not forget to wear your caps. It is important that we abide by Hatching–tide tradition."},{"name":"AUGUSTINIEL","text":"Ah, so we meet again. No doubt you are here to carry on where my partner and I left off."},{"name":"AUGUSTINIEL","text":"Well, you won't be able to do this alone, but I'm sure you can find some daring adventurer to assist you. When you've found a partner, and you're both wearing a proper cap, I'll be waiting here with the eggs."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are too far away."},{"name":"SYSTEM","text":"You cannot proceed. One or more party members are not equipped with the appropriate egg cap."},{"name":"AUGUSTINIEL","text":"Hello again, friend. I would stand to greet you, but my earlier confrontation with the spriggans has left me enervated to say the least."},{"name":"AUGUSTINIEL","text":"The eggs are safe and sound here in the Coral Tower, at least for the moment. The spriggans followed us from Costa del Sol, and a few of them forced their way into the city. I know not why they covet these eggs so dearly, but we cannot let them be taken again."},{"name":"AUGUSTINIEL","text":"The Aftcastle is not far, but there is no telling where the spriggans may be hiding, so stay alert."},{"name":"AUGUSTINIEL","text":"Go quickly, friend, and may the Archons of yore keep you safe."},{"name":"SYSTEM","text":"Carry the Archon egg back to the Aftcastle while your arms and legs still have strength."},{"name":"SYSTEM","text":"Beware the spriggans lying in wait around the upper decks. Being caught en route to the Aftcastle will result in failure."},{"name":"SYSTEM","text":"You have 180 seconds to reach your destination. Should you fail, return to the starting location and begin anew."},{"name":"AUGUSTINIEL","text":"There is no time to waste, friend. You must hurry and deliver the eggs to the Aftcastle before the spriggans find us."},{"name":"AUGUSTINIEL","text":"There can be no celebration if they are stolen a second time. Now go, and see that the spriggans do not catch you."},{"name":"SYSTEM","text":"You must be wearing a pristine egg cap to carry this egg."},{"name":"SYSTEM","text":"You must be wearing a brilliant egg cap to carry this egg."},{"name":"SPRIGAN","text":"You have shiny egg! Shiny pretty egg! Give shiny pretty eeeeeegg! Eeeeeegg!"},{"name":"POPMESSAGE","text":"You lose the Archon egg."},{"name":"SPRIGAN","text":"Shiiiiiiny! Preeeeeetty! Need more eeeeeeggs! Eeeeeeggs!"},{"name":"SYSTEM","text":"This basket seems suitable to hold the pristine Archon egg."},{"name":"SYSTEM","text":"This basket seems suitable to hold the brilliant Archon egg."},{"name":"OSCARLET","text":"Welcome back! It would seem the Archon eggs are finally back where they belong. Excellent work."},{"name":"OSCARLET","text":"I admit this location is not without its dangers until the spriggans are gone, but it will do the people of Limsa well to see the Archon eggs out in the open."},{"name":"OSCARLET","text":"It is believed the eggs are nurtured by the hearts and minds of Dreamers as they bask in the warmth of the sun. No good would come of locking them away in the Coral Tower. If anything, it would dampen the spirits of our resident Dreamers."},{"name":"OSCARLET","text":"Worry not of the spriggans, friend. We will see them driven out. Instead, I would ask you visit Miss Aliapoh in Gridania and relay an account of today's happenings. She is surely beside herself with anticipation of news, and it would do her heart good to know the eggs are safe."},{"name":"OSCARLET","text":"Your work is done here, friend. Be sure to tell Miss Aliapoh of the news, that her mind may be put at ease."},{"name":"JIHLIALIAPOH","text":"Ah, <span class=\"highlight\">Forename</span>, you have returned! Have Oscarlet and his men secured the Archon eggs?"},{"name":"JIHLIALIAPOH","text":"Oh joyous day! There is hope for this year's Hatching–tide yet."},{"name":"JIHLIALIAPOH","text":"There are but a few eggs left to be found for the celebration, and with your assistance, I am sure they will be recovered without incident."},{"name":"JIHLIALIAPOH","text":"Your actions have brought hope to many and more who await the return of our beloved Archons of old. I believe I speak for all of my Dreamers when I say you have earned a respite this day."}],"reward":{"gil":382,"items":[{"num":10,"id":7063}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[66953]},"next":[66955]},"partials":[{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"7063","obj":{"i":7063,"n":"Bronze Decorative Egg","l":1,"c":21322,"t":85}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}},{"type":"item","id":"2751","obj":{"i":2751,"n":"Brilliant Egg Cap","l":30,"c":41103,"t":34,"p":100}},{"type":"quest","id":"66953","obj":{"i":66953,"n":"Eggsigent Circumstances","g":199,"l":"Gridania","s":38}},{"type":"quest","id":"66955","obj":{"i":66955,"n":"The Yolks on Us","g":199,"l":"Gridania","s":40}}]}