{"quest":{"name":"Egg-hunting We Will Go (Ul'dah)","location":"Ul'dah","id":66952,"patch":2.2,"sort":37,"icon":100244,"eventIcon":71221,"issuer":1007902,"target":1007900,"genre":199,"usedItems":[2659],"journal":["Orselfaux would have you experience the miracle of Hatching–tide.<br>※This quest is available for a limited time only.","Orselfaux teaches you the origins of Hatching–tide, a fledgling festival founded by Jihli Aliapoh, who claims to have been blessed with a vision from the Twelve Archons of the Sixth Umbral Era. Eager to have you partake in the revelry, Orselfaux bids you speak with the celebration's founder, but not before acquiring a pristine egg cap from one of his fellow Dreamers. After donning your festival cap, proceed to Gridania and seek out Jihli Aliapoh, that you may learn more about the Hatching–tide celebration.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","There is still time before Hatching Hour, the final ceremony heralding the Twelve Archons' return to Eorzea. To that end, Jihli Aliapoh encourages you to try your hand at egg hunting, a popular Hatching–tide festival activity. She informs you of the different kinds of eggs which can be opened to reveal a gift, or exchanged for eggs of higher quality with richer rewards.<br><br>As you prepare to set out on an egg–hunting adventure, however, she asks that you pay her a visit when you've had your fill of festival games. Though preparations appear to be going as planned, perhaps this year's Hatching–tide is beset with more troubles than she would have you believe."],"objectives":["Equip a pristine egg cap, then speak with Jihli Aliapoh."],"dialogue":[{"name":"SYSTEM","text":"Eorzea is currently celebrating Hatching–tide. Adventurers wishing to partake in the festivities may do so in Limsa Lominsa, Gridania, or Ul'dah."},{"name":"SYSTEM","text":"The rewards will be the same regardless of venue, so do not hesitate to join the celebration in the nation of your choice."},{"name":"ORSELFAUX","text":"Greetings, friend. You seem somewhat bewildered by the decorations here in town. Could it be you know not of the season's festivities?"},{"name":"ORSELFAUX","text":"Why, this is Hatching–tide, a celebration of the legendary heroes that will soon make their return to Eorzea."},{"name":"ORSELFAUX","text":"It started several years ago, when Jihli Aliapoh was touched by the grace of the Twelve Archons from ages past, powerful sages who saved Eorzea from the Sixth Umbral Calamity."},{"name":"ORSELFAUX","text":"Appearing before her in a dream, they delivered unto her a message that would forever change both her life <span class=\"emphasis\">and</span> the lives of many others:<br>“Rise, young Dreamer, and make ready the vessel for our return.”"},{"name":"ORSELFAUX","text":"And with those words, she began gathering eggs to serve as their means of returning to Eorzea, laying the foundation for what we know to be Hatching–tide."},{"name":"ORSELFAUX","text":"I stand here before you a Dreamer, like Jihli Aliapoh and the many others who work to prepare for the Archons' return, and we have reason to believe this will be the year of their rebirth."},{"name":"ORSELFAUX","text":"I realize how outlandish this may sound, but take a moment to consider recent happenings in Eorzea."},{"name":"ORSELFAUX","text":"The realm was spared during the Sixth Umbral Calamity by the power of the Twelve Archons. In light of Jihli Aliapoh's vision, 'twould make sense if they had also played a part in saving us from the Seventh! Truly, this year's celebration will be glorious, and you are welcome to join us in our revelry."},{"name":"ORSELFAUX","text":"But, before you can begin, you will need to don a festival cap. Make no mistake, friend: though the tradition is still quite young, we do not take kindly to those who would make light of its rules."},{"name":"ORSELFAUX","text":"A pristine egg cap should do the trick. You can acquire one from one of my fellow Dreamers, but there is no need for coin. Your enjoyment of Hatching–tide is payment enough."},{"name":"ORSELFAUX","text":"As for <span class=\"emphasis\">how</span> to enjoy oneself during the celebration, I believe that explanation is best left to Jihli Aliapoh herself."},{"name":"ORSELFAUX","text":"You will find her in Gridania, though I would suggest you place your cap firmly atop your head before speaking with her. She is expecting your arrival, and the cap will serve to discern you from other adventurers in town."},{"name":"ORSELFAUX","text":"The return of the Twelve Archons is not an event to be missed. I trust you will not be idling here during Hatching Hour."},{"name":"ORSELFAUX","text":"I have sent word of your departure to Gridania, but do not forget to wear your pristine egg cap when speaking to her."},{"name":"ORSELFAUX","text":"You will need to speak with my fellow Dreamers if you have yet to procure an egg cap."},{"name":"SHOPGURIDANIA","text":"You've come to join in the festivities!? Haha, haha! Here, take this pristine egg cap to start you on your way. And may the Archons of yore bless you and keep you!"},{"name":"POPMESSAGE","text":"You obtain a pristine egg cap."},{"name":"SHOPLIMSA","text":"I take it you have decided to join in the festivities? Excellent! Here is a pristine egg cap to start you on your way. May the Archons of yore bless you and keep you."},{"name":"SHOPURUDAHA","text":"I take it you have decided to join in the festivities? Excellent! Here is a pristine egg cap to start you on your way. May the Archons of yore bless you and keep you."},{"name":"JIHLIALIAPOH","text":"Greetings, friend. Have you come to join us in the celebration of Hatching–tide?"},{"name":"JIHLIALIAPOH","text":"If so, you will need a proper headpiece before you can partake of the festivities. There are several to be seen over the course of the celebration, but I believe a pristine egg cap will suffice to start."},{"name":"JIHLIALIAPOH","text":"Simply speak with one of the Dreamers and they will gladly offer one to you."},{"name":"JIHLIALIAPOH","text":"Ah, I take it you are interested in the celebration of Hatching–tide."},{"name":"JIHLIALIAPOH","text":"Allow me to introduce myself. My name is Jihli Aliapoh, and mine is the vision that foresaw the return of the Twelve Archons from ages past. Orselfaux told me you would be coming, but he failed to mention your name."},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename Surname</span>, is it? Well, <span class=\"highlight\">Forename</span>, there is still time until Hatching Hour. Might I suggest a bit of egg hunting to pass the time? This is Hatching–tide, after all, and no one can truly say they have celebrated this day without partaking in an egg hunt."},{"name":"JIHLIALIAPOH","text":"Bear in mind, however, this is no simple ramble about Gridania. Eggs have been hidden in fields all across Eorzea, each containing a different prize."},{"name":"JIHLIALIAPOH","text":"Three types have been hidden for the hunt: bronze, silver, and golden! Bronze eggs are the most common of the three, and it will be a laborious task to obtain the rarer sort. Golden eggs are without question the rarest, with rewards as precious as the gilded containers that bear them."},{"name":"JIHLIALIAPOH","text":"Feel free to open any eggs you come across, but if you seek eggs of higher quality, bring what you have to one of my Dreamers. In exchange for bronze, they will offer you silver eggs, and for silver they will offer you golden eggs."},{"name":"JIHLIALIAPOH","text":"When you are not too busy hunting eggs, however, I would ask for your help in preparing for Hatching Hour. Although preparations are proceeding as planned, the welcoming of the Twelve Archons must be perfect, and the assistance of an able–bodied adventurer would put my mind at ease."},{"name":"JIHLIALIAPOH","text":"But for now, I bid you safe travels as you partake of our Hatching–tide revelry. When you are ready to hear my request, I will be here waiting for you. May the Archons of yore bless you and keep you."}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1007902","obj":{"i":1007902,"n":"Orselfaux","l":40,"q":1}},{"type":"npc","id":"1007900","obj":{"i":1007900,"n":"Jihli Aliapoh","l":53,"q":7}},{"type":"item","id":"2659","obj":{"i":2659,"n":"Pristine Egg Cap","l":10,"c":41100,"t":34,"p":11}}]}