{"quest":{"name":"The Beast of Brewer's Beacon","location":"Limsa Lominsa","id":66966,"patch":2.2,"sort":510,"eventIcon":71221,"issuer":1000857,"target":1000856,"involved":[1008882],"genre":91,"usedItems":[4924,7693],"journal":["A salty stalwart is the acting guildmaster Sisipu, but today she seems distinctly distrait.","Her tart tongue reasserting itself, Sisipu urges you towards the docks, where Wawalago awaits you with a distinguished visitor.","Wawalago and Ascelyn bend your ear until you can hardly stand straight─such is scholarship. All you need to note is that Wawalago needs a titanic sawfish from you. Take a lugworm to Cape Westwind to catch a Merlthor goby, then perform fishwheeling to net a wahoo. Another round of fishwheeling─or mooching, if you must─will allow you to get your hands on a titanic sawfish.","You present Wawalago with a titanic sawfish, and faced with incontrovertible evidence of your prowess, the guildmaster reveals that an Old One called the Navigator's brand lurks off the coast of the Brewer's Beacon, and can be caught using a yumizuno. Heed his gory tale well and equip yourself with care. Without a high <span class=\"highlight\">gathering</span> value, you will lose this beast ere you can raise it out of the water.","Wawalago regards the Navigator's brand with naked hunger, but has the wherewithal to officially recognize you as a fisher with skill enough to capture an Old One, if such a need were to arise. The guildmaster also reminds you that Eorzea is apparently full of big fish for a self-improving fisher to hone his skill on. Word is that rare fish will fetch a handsome price in equipment at Revenant's Toll, unless you prefer to consume several dozen servings of a lemon herb Old One on a bed of spinach."],"objectives":["Speak with Wawalago.","Deliver a titanic sawfish to Wawalago.","Deliver a Navigator's brand to Wawalago."],"dialogue":[{"name":"SISIPU","text":"There you are, <span class=\"highlight\">Forename</span>! Where've you been? Somebody tell you about the big fish?"},{"name":"SISIPU","text":"No, no, I don't mean <span class=\"emphasis\">him</span>. Wawalago may be the guildmaster, but he's more the big lugworm than the big fish. In fact, he calls <span class=\"emphasis\">you</span> the best fisher in the guild."},{"name":"SISIPU","text":"That's why he wants to see you. Some scholar's raising a hue and cry about a giant fish that needs catching. Refreshing, isn't it? It's actually serious business for a change!"},{"name":"SISIPU","text":"What will the morrow bring? Sharks spilling from the sky in a spectacular shower of scales? Oh, don't look at me like that─I <span class=\"emphasis\">am</span> the acting guildmaster, after all."},{"name":"SISIPU","text":"You'll find Wawalago at his usual spot at the docks. Might as well hear what he has to say─you're not like to lose by it, and I've surely had a bellyful."},{"name":"WAWALAGO","text":"Ah, Ascelyn, the adventurer arrives with alacrity! <span class=\"highlight\">Forename</span>, this fellow you must follow. He is learned in lore and wise in the ways of wyrms."},{"name":"ASCELYN","text":"Er, um. Yes, I am called Ascelyn. And I am indeed learned in lore. That is to say, I study legends throughout Eorzea─legends of what the common man might call “giant fishy things.”"},{"name":"ASCELYN","text":"I recently came across an ancient document which made reference to something called the Nepto Dragon. I should explain that by “dragon,” the ancients probably meant a giant fish. Or possibly a shrubbery of unusual coloring. It's usually one or the other."},{"name":"ASCELYN","text":"But my Nepto Dragon was no plant, for the <span class=\"emphasis\">Book of Three</span> notes it was twice man-size─that is to say, twice as long as a Hyur is tall─and tore through hulls of trading ships with its mighty teeth."},{"name":"ASCELYN","text":"Did it ever live? Does it still? One thing is certain: if I ever find its home waters, it will not be <span class=\"emphasis\">I</span> who hauls the mighty monster out from its depths. I haven't the fortitude."},{"name":"ASCELYN","text":"To clarify, I fear water. <span class=\"emphasis\">Greatly</span>. Even standing on this pier tests my will to its limits... But that is why I am here, that I might petition the aid of one such as yourself who harbors no such fear."},{"name":"WAWALAGO","text":"Terrifically told, and totally true. He came to Wawalago, this learner of lore. But fie, he found this fisher had faults."},{"name":"WAWALAGO","text":"Too old am I to make after this monster of myth! Though I do think that I'm not completely diminished by my dotage. Or do you doubt it? Hm? <span class=\"emphasis\">Hmmm</span>?"},{"name":"WAWALAGO","text":"I thought to myself, “<span class=\"highlight\">Forename</span>'s a game one─one game guppy!” The best of the bunch─barring myself, by the bream!"},{"name":"WAWALAGO","text":"Now then, on to the Old Ones! Hah, I saw that flinch─and the furtive flitting of fingers to some folksy charm!"},{"name":"WAWALAGO","text":"Suffice it to say I speak of fish grown great in gloomy green depths. You've heard chatters about these wily wizards of the water, I am sure!"},{"name":"WAWALAGO","text":"But chatting is not catching. More fishers have heard the history than have hooked the hidden heavyweights, ho!"},{"name":"WAWALAGO","text":"Now, if what this learner of lore tells is true, this Nepto Dragon will need a fisher who can fish an Old One to order!"},{"name":"WAWALAGO","text":"So, it falls to you to prove your prowess, pretty please!"},{"name":"ASCELYN","text":"Ahem, ah. Master Wawalago, you've caught your share of these Elder─that is to say, Old─Ones, have you?"},{"name":"WAWALAGO","text":"Was that a quip or a question? A quick query to yourself, if you please: why even ask when the answer is clear? Of course I have caught an Old One!"},{"name":"WAWALAGO","text":"Notice I stress the singular, hmmm? Even the master fisher of all Eorzea finds the Old Ones a heaving handful of hell!"},{"name":"WAWALAGO","text":"Where to begin, where to begin... Aha! The titanic sawfish, an enigma to entertain even an eclectic expert!"},{"name":"WAWALAGO","text":"It enjoys a certain infamy in its immediate environment, shall I say? Other fish of its fraternity flip their fins and flee from it."},{"name":"WAWALAGO","text":"You can find the titanic sawfish in Cape Westwind. You must mooch the monster if you're primed to pull it, and our cultured companion will couch his corrections."},{"name":"WAWALAGO","text":"Now, ready the reel, coddle the creel! Use a lugworm and catch a Merlthor goby."},{"name":"WAWALAGO","text":"Merlthor gobies are only the first bait to bag the best! Mooch with it to net a wahoo. Now, you must maintain the mooch to manacle a titanic sawfish!"},{"name":"WAWALAGO","text":"A pissy piscis is this titanic sawfish, not a drop of doubt about it. Only appears when all aligns─the hour, the weather, the welkin's color..."},{"name":"WAWALAGO","text":"Should you net the titanic sawfish, no nugget of knowledge will I deny! I had much opportunity to observe Old Ones from an oomiak, and you shall learn every detail."},{"name":"WAWALAGO","text":"No easy feat, I know, I know. But mine eyes have seen you master that mendacious marlin of Mazlaya, and that makes you a fisher second only to Wawalago!"},{"name":"ASCELYN","text":"Ahem, I wish to someday run to earth─that is to say haul out of the water─the Nepto Dragon. As a hydrophobe of the first water, so to speak, I seek skilled fishers to assist me should that day ever dawn."},{"name":"WAWALAGO","text":"Is the deed done, or is the dream dead? Did you catch a titanic sawfish?"},{"name":"WAWALAGO","text":"A titanic sawfish, by the belly bursting with bream! Valiant 'venturer, fine fisher! Now the news!"},{"name":"WAWALAGO","text":"It was but once that I caught an Old One...ten years younger I was."},{"name":"WAWALAGO","text":"Bloody and bruised were my hands afterwards, sliced like sirloin steaks by the rod and line! Was I afraid? Never! Fishing is a fever that burns too fierce for fear!"},{"name":"WAWALAGO","text":"The Old One you seek is known as the Navigator's brand, and she wallows in the waters off the Brewer's Beacon. Mayhaps you hear her? Listen...alas, western La Noscea lacks the proper propinquity."},{"name":"WAWALAGO","text":"I used a yumizuno, if I remember─and I do very vividly, as we do vanished valuables. A clear day it was too, the sun high in the sky. The hour? I know it not, nor need to know."},{"name":"WAWALAGO","text":"The Old One needs all your knowledge and skill to catch, valiant 'venturer! And exceptional equipment is an excellent means to an end, to be sure."},{"name":"WAWALAGO","text":"Go fish, <span class=\"highlight\">Forename</span>, the second-best fisher in Eorzea! Go fish!"},{"name":"SYSTEM","text":"A <span class=\"highlight\">gathering</span> rating of 290 or higher is required to successfully catch an Old One. The fish will escape otherwise, so equip yourself accordingly before performing this task."},{"name":"ASCELYN","text":"Ah, taking on an Old One finally─that is to say, already? You'll excuse me if I observe the process from afar. Master Wawalago's talk of sirloin steaks has put me off my feed."},{"name":"WAWALAGO","text":"Did you do the deed? Mayhap the Old One observed with its oversized orbs the futility of fleeing the ferocious fisher?"},{"name":"WAWALAGO","text":"Wawalago is not worried! Happy happenstance it was that I caught my Old One, and you will also be lucky with your lure!"},{"name":"WAWALAGO","text":"A Navigator's brand! The deed is done, this is the lord of the Brewer's Beacon, by the bream!"},{"name":"WAWALAGO","text":"Still, this success is shocking in its suddenness. Have I been surpassed, slipped to the second spot from the summit?"},{"name":"WAWALAGO","text":"I am not worried, for there is more to fishercraft than obliging Old Ones! Still, <span class=\"highlight\">Forename</span> is skilled to snag <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> second Old One, and I am less lonely at the top for it!"},{"name":"WAWALAGO","text":"A fine fish, this Navigator's brand, firm yet flaky, I fancy."},{"name":"WAWALAGO","text":"Hmm...grilled with garlic and garnished with greens? Or steamed with shallots then served sauced and spiced! A vintage viand this Old One will make..."},{"name":"WAWALAGO","text":"The Old One is an oblation, that much is obvious! Grab the grill pan, let us greet the god of gastronomy!"},{"name":"WAWALAGO","text":"But Wawalago also wants his wet-aged fish, marinating in its marine memories, mmm."},{"name":"WAWALAGO","text":"A dry─no, <span class=\"emphasis\">wizened</span> white wine, I think! Something from the Sixth Astral Era, sleeping in my cellar..."},{"name":"ASCELYN","text":"Ahem, ah. Still here."},{"name":"WAWALAGO","text":"Abject apologies Ascelyn, my admirable academic!"},{"name":"WAWALAGO","text":"I hereby pronounce <span class=\"highlight\">Forename</span> proficient and pugnacious, fit to fish your lurking leviathan!"},{"name":"ASCELYN","text":"Ah, that's a relief. As I said, I will have to avail myself of the services of a skilled fisher once I find the Nepto Dragon. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, I hope you will accept a standing offer to face this hideous monster in my stead."},{"name":"ASCELYN","text":"Fantastic─that is to say, excellent. I shall continue my travels, and discover where legend becomes reality."},{"name":"ASCELYN","text":"I will return when I know more. A fine collaboration this will be─you fish, I publish. Farewell for now─that is to say, see you soon."},{"name":"WAWALAGO","text":"Well, that went well, wouldn't you say? Now for practice! A scholar stops by and suddenly we must supplement our skills!"},{"name":"WAWALAGO","text":"We are often oblivious to Old Ones, but they are all around us in appreciable abundance. Culling them would be quite a quill in your cap, I recommend it readily!"},{"name":"WAWALAGO","text":"You can always take the catch to Mor Dhona. I've been told tales of someone in Revenant's Toll with terrific tools to trade for fearsome fishies."},{"name":"WAWALAGO","text":"Everyone enjoys an excellent exchange, and they say there are many to be had from this trader at the Toll!"},{"name":"WAWALAGO","text":"The three T's, my master called it: technique, tool, and talent. Neglect not the right equipment, if you are obsessed with the Old Ones!"},{"name":"WAWALAGO","text":"Mmm, what a marvelous meal I'll make of this! Should I share with that surly Sisipu, or slight her by just saving a salted slice?"}],"reward":{"gil":1220,"items":[{"num":3,"id":4714},{"num":99,"id":2587,"one":1},{"num":99,"id":2588,"one":1},{"num":99,"id":2594,"one":1},{"num":15,"id":2614,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":19}],"quests":[66654]},"next":[65782]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"npc","id":"1008882","obj":{"i":1008882,"n":"Ascelyn","l":29,"q":2}},{"type":"item","id":"4714","obj":{"i":4714,"n":"Tomato Pie","l":55,"c":24156,"t":46}},{"type":"item","id":"2587","obj":{"i":2587,"n":"Pill Bug","l":5,"c":27005,"t":33,"p":2}},{"type":"item","id":"2588","obj":{"i":2588,"n":"Crayfish Ball","l":5,"c":27008,"t":33,"p":2}},{"type":"item","id":"2594","obj":{"i":2594,"n":"Butterworm","l":20,"c":27019,"t":33,"p":5}},{"type":"item","id":"2614","obj":{"i":2614,"n":"Crow Fly","l":20,"c":27057,"t":33,"p":240}},{"type":"item","id":"4924","obj":{"i":4924,"n":"Titanic Sawfish","l":70,"c":29020,"t":47}},{"type":"item","id":"7693","obj":{"i":7693,"n":"Navigator's Brand","l":70,"c":29071,"t":47}},{"type":"quest","id":"66654","obj":{"i":66654,"n":"So Long, and Thanks for All the Fish","g":146,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"65782","obj":{"i":65782,"n":"Feast of Famine","g":91,"l":"Limsa Lominsa","s":515}}]}