{"quest":{"name":"Help Me, Lord of the Dance","location":"Ul'dah","id":66963,"patch":2.2,"sort":140,"eventIcon":71221,"issuer":1007799,"target":1007798,"involved":[1001697,1007800,1007801],"genre":93,"journal":["When P'molminn approaches, beware, for the impetuous Miqo'te always leads a merry dance.","P'molminn the dancing girl aspires to a professional engagement at one of the grand balls. The legendary dancing master Guillaunaux is her only hope, and his whereabouts may be common knowledge among the uncommon set on the Steps of Thal.","The ladies who lunch─and loure─inform you that Master Guillaunaux is eminently desirable and soon to be unavailable. Unless you catch up to him at the Hustings Strip, he may well slip through P'molminn's slender fingers.","Master Guillaunaux proves less amenable to your overture than you had hoped. The only way to his heart─or even to something resembling a civil conversation─is to /dance for him on the Hustings Strip.","The tormented dancing master praises the rugged potential of your dance, whilst dismissing P'molminn's overseasoned steps with cutting cruelty. Yet the Miqo'te's grit and caprice carry the day, and it is the master and the adventurer who are left staring after the student who never was."],"objectives":["Ask about Guillaunaux on the Steps of Thal.","Speak with Guillaunaux.","/dance for Guillaunaux."],"dialogue":[{"name":"PMOLMINN","text":"Psst, you there! Yes, darlin', you. They say you're the <span class=\"alternative-container\"><span class=\"alternative\">lass with the brass. Well, they call me that too, but for a different reason.</span><span class=\"alternative\">fellow to follow.</span></span> Name's P'molminn, and I earn my keep as a dancing girl in these markets."},{"name":"PMOLMINN","text":"Aye, it's a living─and a good one!─but it's not exactly what I set out to be when I bid farewell to the mudflats. I know, I know─isn't that the way the tail curls!"},{"name":"PMOLMINN","text":"Still, I should like to be one of those dancers dexter. You know, the sort they engage for the grand balls. Mmm, to be a dancer of <span class=\"emphasis\">craft</span>, not mere wiles...and keep company in high society!"},{"name":"PMOLMINN","text":"'Course, I'd have to learn a proper sort of dancing─less shimmy, more stately. And that's where <span class=\"emphasis\">you</span> come in, darlin', because I've got a quarry for you to track down."},{"name":"PMOLMINN","text":"They say a dancing master named Guillaunaux is in town. All the highborn ladies are aflutter wanting to take lessons with him. He's the best, that's the word!"},{"name":"PMOLMINN","text":"This is my chance to be something <span class=\"emphasis\">finer</span> than Minnie the Minx! Go to the Steps of Thal and ask around about him, won't you? "},{"name":"PMOLMINN","text":"It's the dancing master Guillaunaux I need you to find. The fancy folk on the Steps of Thal, they're sure to know where he's about!"},{"name":"WOMENA01427","text":"Master Guillaunaux? Oh, it's lovely what he teaches. But strait is the gate, my good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>─he is very choosy about whom he teaches."},{"name":"WOMENA01427","text":"You must dance for him and show some...innate quality. Why, he wouldn't even accept Master Gegeruju's diamond-crusted crumpet, and she was quite the danseuse already."},{"name":"WOMENA01427","text":"Rather a martinet, Master Guillaunaux. He deigned to teach my milk-sister, and it took her nigh on two years to master a single step. I wonder how you'd fare."},{"name":"SOSOTTA","text":"Oh, of course I know where Master Guillaunaux is. Don't you see these roses on my cheeks? And the ever–so–slight droop in my supple carriage? I've just come from practice!"},{"name":"SOSOTTA","text":"You can stop wondering who the belle of the ball is to be next moon. With what Master Guillaunaux taught me, I've no doubt that I'll dazzle the masses!"},{"name":"SOSOTTA","text":"Where can you find him? Well, I oughtn't say, but...oh, why not! You should find him on the Hustings Strip. He said he was headed to the airship landing."},{"name":"SOSOTTA","text":"If you hurry, you'll probably catch Master Guillaunaux on the Hustings Strip. He had some business or other at the airship landing."},{"name":"WOMENB01427","text":"Are you another one of Master Guillaunaux's camp followers? So cute. You know he's from Coerthas, don't you? Travels the world teaching the art of the dance..."},{"name":"WOMENB01427","text":"They say he was the youngest dancing master ever to leap the lance. That he had a large estate, a fine stable, and a coat of crown sable. Why anyone would leave all that is beyond me."},{"name":"WOMENB01427","text":"When I think about that, it gives me <span class=\"emphasis\">shivers</span>, you know? Why, if he weren't leaving Ul'dah today, I'd consider permitting him the pleasure of my person. Oh, don't look so shocked. Mayhap when he returns..."},{"name":"WOMENB01427","text":"I suppose I must work on my dancing until he returns. You don't think he'd insist on an audition for arts <span class=\"emphasis\">other</span> than dancing, do you? That would be tedious."},{"name":"GUILLAUNAUX","text":"Master Guillaunaux? I am he. That you are an adventurer is apparent, but what business brings an adventurer to a dancing master, I wonder."},{"name":"GUILLAUNAUX","text":"At-tat! You will not answer where no question has been asked! It is the feet that must persuade, not the tongue. Now, <span class=\"highlight\">dance</span> for me!"},{"name":"GUILLAUNAUX","text":"If you will not <span class=\"highlight\">dance</span>, begone! I would no more speak with a stillfoot than I would dwell among tyrants!"},{"name":"GUILLAUNAUX","text":"Plague me not if you have no <span class=\"highlight\">dance</span> to show me. I must leave this place ere long."},{"name":"GUILLAUNAUX","text":"The vessel is rude, but the wine within may yet be fined."},{"name":"GUILLAUNAUX","text":"Unfortunately, there is much call on my time, and I am bound for another land. I will make a dancer of you when next I return to this city."},{"name":"PMOLMINN","text":"There you are! Heard anything good? Hope you're not wasting time with that looker there."},{"name":"PMOLMINN","text":"Oh... <span class=\"emphasis\">Oh</span>!<br>M-Master Guillaunaux, I am P'molminn the dan...danseuse, and I would speak with you."},{"name":"PMOLMINN","text":"It is my greatest desire to become a dancer dexter, and perform at a grand ball. <span class=\"emphasis\">Please</span>, milord, won't you teach me?"},{"name":"GUILLAUNAUX","text":"So. It is not the adventurer who wishes to tread the parquet, but this stammering maiden."},{"name":"GUILLAUNAUX","text":"Child, I sift people to find dancers. Do you understand? Then let us see whether you can master these steps!"},{"name":"PMOLMINN","text":"&lt;gulp&gt; ...That's how they do it in high society, huh?"},{"name":"PMOLMINN","text":"I can be the lass with <span class=\"emphasis\">class</span>! Just watch!"},{"name":"GUILLAUNAUX","text":"Hideous. Grotesque. Your dancing stands alongside the Calamity in its horror."},{"name":"PMOLMINN","text":"W-Well! Those words might cow your highborn ladies, Master Guillaunaux, but where I come from, we take our lumps and keep on twirlin'! Now, what <span class=\"emphasis\">exactly</span> didn't you like?"},{"name":"GUILLAUNAUX","text":"Child, you rely overmuch on appearances. You go from pose to pose, pleasing to pleasing. That is not dance, but crude fascination."},{"name":"GUILLAUNAUX","text":"Adventurer! Look sharp and take your turn on the floor."},{"name":"PMOLMINN","text":"I...I can't take my eyes off of you!"},{"name":"PMOLMINN","text":"I mean, you're not exactly good. You'd be picking rotten orange piths out of your eyebrows if you did that at the market, but..."},{"name":"PMOLMINN","text":"It's...it's a story, isn't it? A dance is a story...and I have nothing to say."},{"name":"PMOLMINN","text":"Because I haven't <span class=\"emphasis\">lived</span>...just made a living."},{"name":"GUILLAUNAUX","text":"Aye, child. Ale-glazed eyes are easy to please, and you have squandered these years striking your poses when you could have learned a craft."},{"name":"GUILLAUNAUX","text":"Still, you have courage, I'll warrant that. I weary of teaching so many who may have lived, but in ways too alike. I wonder if you have courage enough."},{"name":"GUILLAUNAUX","text":"Do you dare start anew? To be a dancing girl no longer─to learn a true craft?"},{"name":"PMOLMINN","text":"I... I..."},{"name":"PMOLMINN","text":"I dare! I will learn the craft...of adventuring!"},{"name":"PMOLMINN","text":"Do you adventure for fun or gain? Do you have to be very good with weapons? Those moves you make with your arms─is that some fighty thing!? "},{"name":"PMOLMINN","text":"I want what you've got, darlin'! The way to the grand ball is through quests and dungeons. I'll learn to slog, I'll learn to slug...and I'll learn to dance!"},{"name":"PMOLMINN","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>, thank you! I'm off to the Adventurers' Guild. You've taught me so much, and I'll never forget that dance you showed me!"},{"name":"GUILLAUNAUX","text":"...Did she choose a mere adventurer over me, master among masters?"},{"name":"GUILLAUNAUX","text":"My airship departs this strange city soon. Dance your rude yet puissant dance, adventurer. Mayhap you will affect more aspirants as you did P'molminn."},{"name":"GUILLAUNAUX","text":"...Hah! And mayhap I shall hang up my dancing shoes and start anew!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Ball Dance</span>!"}],"reward":{"emote":"Ball Dance","xp":2415},"reqs":{"jobs":[{"lvl":14,"id":1}],"questsType":"any","quests":[66088,66081]}},"partials":[{"type":"npc","id":"1007799","obj":{"i":1007799,"n":"P'molminn","l":40,"q":1}},{"type":"npc","id":"1007798","obj":{"i":1007798,"n":"Guillaunaux","l":41,"q":1}},{"type":"npc","id":"1001697","obj":{"i":1001697,"n":"Sosotta","l":41,"q":2}},{"type":"npc","id":"1007800","obj":{"i":1007800,"n":"Willowy Woman","l":41,"q":1}},{"type":"npc","id":"1007801","obj":{"i":1007801,"n":"Luscious Lady","l":41,"q":1}},{"type":"quest","id":"66088","obj":{"i":66088,"n":"A Royal Reception","g":1,"l":"Ul'dah","s":85}},{"type":"quest","id":"66081","obj":{"i":66081,"n":"A Mizzenmast Repast","g":1,"l":"Limsa Lominsa","s":80}}]}