{"quest":{"name":"Lend Me Your Ears Already","location":"Ul'dah","id":66965,"patch":2.2,"sort":90,"eventIcon":71221,"issuer":1001301,"target":1001313,"genre":93,"journal":["A friend in need is a friend indeed, and Memenaru is determined to stay the course despite the object of his kindness making himself scarce.","Memenaru would like you to convey a message to Botulf about the debt owed by the latter. The lender may be unable to see the borrower, but you will surely find the beholden man at the Quicksand.","You have spoken to Botulf, who seems positively haggard with worry over the unpaid debt. With the chat mode in <span class=\"highlight\">Say</span>, enter “Well met!” and make his acquaintance.","You greet Botulf, who recognizes you from your brief tête-à-tête with Memenaru, and draws his own fearful conclusions. What else is there to do but enter the auto–translate option {Hello!}, with the chat mode in <span class=\"highlight\">Say</span>?","The ring of your voice pulls Botulf back from the brink of madness. It is an achievement to be proud of, though you will hardly dine out on this tale. Speak with Botulf and ascertain the reason for his terror.","Botulf believes you to be a debt collector. Desperate must his circumstances be for that thought to strike such unreasoning fear into his heart. With the chat mode in <span class=\"highlight\">Say</span>, enter “You misunderstand.”","You assuaged Botulf's fears and delivered Memenaru's message. With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Good-bye.} and leave Botulf to savor the relief.","You have taken your leave of Botulf. Let us hope that his moment of sudden clarity will persist, and he will refrain from trying to cadge coin from every <span class=\"alternative-container\"><span class=\"alternative\">Hyur</span><span class=\"alternative\">Elezen</span><span class=\"alternative\">Lalafell</span><span class=\"alternative\">Miqo'te</span><span class=\"alternative\">Roegadyn</span><span class=\"alternative\">Au Ra</span><span class=\"alternative\">Hrothgar</span><span class=\"alternative\">Viera</span></span> that drops by."],"objectives":["Speak with Botulf.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Well met!” to greet Botulf.","With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!} and greet Botulf once again.","Speak with Botulf.","With the chat mode in <span class=\"highlight\">Say</span>, enter “You misunderstand.” to allay Botulf's concern. ","With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Good-bye.}"],"dialogue":[{"name":"MEMENARU","text":"Stay a moment, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>; I've an errand for you. I lent some gil to a friend to cover what he owed a drinking hole of ill repute."},{"name":"MEMENARU","text":"Now, this friend─Botulf is his name─feels worse in the borrowing than I do in the lending. I'd tell him he can take as many turns as he likes to pay me back, but with my eyes being what they are and him dodging me at every turn..."},{"name":"MEMENARU","text":"Will you convey my message to him? He won't run from an unfamiliar face, I imagine. Just get him to understand all's right between us, eh?"},{"name":"BOTULF","text":"&lt;sigh&gt; How am I going to get clear? I feel like a man rushing about with a leaking sieve, trying to fill fancy goblets..."},{"name":"SYSTEM","text":"Botulf seems to be on edge."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Well met!”"},{"name":"SYSTEM","text":"Well met!"},{"name":"BOTULF","text":"Well met indeed, adventurer. Making good gil these─oi! You were just speaking to Memenaru, weren't you? Oh no, oh no, oh no..."},{"name":"SYSTEM","text":"Whatever edge Botulf was on, he appears to be going over it."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!} and distract Botulf from his impending brain-fever."},{"name":"BOTULF","text":"Aye, hello to you too. Right, you're just a working <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">fella</span></span> trying to get home to your supper, same as me. Wouldn't be right to saddle you with my woes..."},{"name":"BOTULF","text":"Will you do something for me? Tell Memenaru I'm as sorry as can be, but swear to the Twelve, I don't have his gil. He must be needing it back bad or he'd not hire a debt collector, but ask him to wait a while longer..."},{"name":"SYSTEM","text":"Botulf has clearly misunderstood your purpose here."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “You misunderstand.”"},{"name":"SYSTEM","text":"You misunderstand."},{"name":"BOTULF","text":"What do you mean? You're not collecting on the debt? Memenaru...he said that? Take as long as I need? I'm saved!"},{"name":"BOTULF","text":"Now <span class=\"emphasis\">that's</span> a friend. He even hired an adventurer so as to set my mind at ease. Memenaru's a pal in a thousand!"},{"name":"BOTULF","text":"And it was no small thing for you to get all that through my thick skull. Thank you kindly! I'll find Memenaru myself and thank him too."},{"name":"SYSTEM","text":"It seems your errand is at an end."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Good-bye.}."},{"name":"BOTULF","text":"And farewell to you too...ah, hold on a moment. Can you spot me some gil? I near choked when I mistook you for a collector, and now I'm powerfully thirsty..."},{"name":"BOTULF","text":"...And there's water free for drinking from the well. <span class=\"alternative-container\"><span class=\"alternative\">Lass</span><span class=\"alternative\">Lad</span></span>, I think I just had myself an epiphany: if I can't afford it, I want it, and that gets me into a hole. No more of that, no more."}],"reward":{"gil":183,"items":[{"num":3,"id":4551},{"num":3,"id":4555}]},"reqs":{"jobs":[{"lvl":9,"id":1}],"quests":[65856]}},"partials":[{"type":"npc","id":"1001301","obj":{"i":1001301,"n":"Memenaru","l":40,"q":3}},{"type":"npc","id":"1001313","obj":{"i":1001313,"n":"Botulf","l":40,"q":4}},{"type":"item","id":"4551","obj":{"i":4551,"n":"Potion","l":10,"c":20601,"t":44,"p":28}},{"type":"item","id":"4555","obj":{"i":4555,"n":"Ether","l":15,"c":20621,"t":44,"p":60}},{"type":"quest","id":"65856","obj":{"i":65856,"n":"Way Down in the Hole","g":1,"l":"Central Thanalan","s":39}}]}