{"quest":{"name":"An Ill-conceived Venture","location":"Gridania","id":66968,"patch":2.2,"sort":170,"unlocksFunction":1,"eventIcon":71341,"issuer":1008950,"target":1000233,"involved":[1008951],"genre":92,"journal":["Something weighs heavily on the adventurer's mind...","You have been asked to investigate the disappearance of a retainer gone afield on a so-called “venture.” Journey to Nine Ivies in the East Shroud, her last known location.","You find and rescue the missing retainer from a grisly death at the hands of wild beasts, thus earning her gratitude. Rather than reward you herself, the retainer bids you return to Gridania and speak with her supervisor, Parnell, in the Shaded Bower.","Recognizing that you are unfamiliar with the latest services provided by retainers, Parnell explains that ventures are procurement expeditions which you may ask your retainers to undertake. She then gifts you several ventures, a unique scrip used to pay for these services. Duly informed, you may now speak with your retainers and assign them these tasks at your leisure."],"objectives":["Search Nine Ivies for the missing retainer.","Speak with Parnell in Old Gridania."],"dialogue":[{"name":"SYSTEM","text":"Several adventurers are having difficulty summoning their retainers. Should you wish to offer your assistance, you will find these troubled souls in Limsa Lominsa, Gridania, and Ul'dah."},{"name":"SYSTEM","text":"The rewards will be the same regardless of whom you help, so do not hesitate to aid the adventurer of your choice."},{"name":"MASTER01432","text":"She's never ignored a summons before..."},{"name":"MASTER01432","text":"Beg your pardon, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but would you be willing to aid a fellow adventurer?"},{"name":"MASTER01432","text":"It's about my retainer. She hasn't returned from her latest venture to Nine Ivies, and I fear something terrible may have happened."},{"name":"MASTER01432","text":"I would track her down myself if I could, but I've an important appointment I must needs keep. Mayhap you could go and search in my stead?"},{"name":"MASTER01432","text":"I dispatched my retainer to Nine Ivies not long ago. It was to be a routine venture, but she has yet to return..."},{"name":"RETAINER01432","text":"Twelve bless you, adventurer! So focused was I on my task that I took no notice of the buzzards at my back."},{"name":"RETAINER01432","text":"You seem confused. Have you heard naught of ventures? It is a service in which we retainers carry out procurement expeditions on behalf of our employers."},{"name":"RETAINER01432","text":"Alas, some are not wont to furnish us with sufficient equipment, despite the obvious benefits it would afford both parties─"},{"name":"RETAINER01432","text":"Ah! Has he been summoning me this entire time? Pray excuse me."},{"name":"RETAINER01432","text":"Forgive me, Master, I was waylaid by beasts. ...Yes, by <span class=\"alternative-container\"><span class=\"alternative\">a Hyuran</span><span class=\"alternative\">an Elezen</span><span class=\"alternative\">a Lalafellin</span><span class=\"alternative\">a Miqo'te</span><span class=\"alternative\">a Roegadyn</span><span class=\"alternative\">an Auri</span><span class=\"alternative\">a Hrothgar</span><span class=\"alternative\">a Viera</span></span> [Job]! How did you know? ...Of course, as you wish."},{"name":"RETAINER01432","text":"&lt;sigh&gt; It seems I must take my leave at once. But before I go, pray allow me to thank you."},{"name":"RETAINER01432","text":"I have naught to recompense you with, but should you inform my supervisor, Parnell, of your deeds, I am confident she will see fit to reward you."},{"name":"RETAINER01432","text":"May we meet again, my friend! And do not forget to visit Parnell in the Shaded Bower!"},{"name":"PARNELL","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I have been expecting you. The retainer you rescued was most effusive in her praise."},{"name":"PARNELL","text":"Retainers are of course permitted to refuse a venture which they determine to be too dangerous. Alas, this particular young woman is new to the profession and was thus easily persuaded by her employer to accept."},{"name":"PARNELL","text":"Beg your pardon? You would like to know more about ventures? Certainly, it would be my pleasure to explain!"},{"name":"PARNELL","text":"In cooperation with the Adventurers' Guild, we have established a new system through which retainers may be dispatched to procure items for their employers."},{"name":"PARNELL","text":"Should you wish to avail yourself of this additional service, you will need to pay your retainer in advance with ventures─scrip issued by the Adventurers' Guild. Here, pray accept these complimentary ventures with my thanks."},{"name":"PARNELL","text":"Bear in mind that most retainers lack the skill to carry out all but the most menial of tasks. Of course, as they grow more experienced, that will change. If this sounds daunting, let me assure you that it's simple in practice. Why not speak with your retainers and see what they think?"},{"name":"SYSTEM","text":"You may now dispatch the retainers in your employ on ventures."},{"name":"SYSTEM","text":"Summon the retainer you wish to send afield and follow the instructions to begin."},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"}],"reward":{"gil":418,"items":[{"num":6,"id":21072}],"xp":3640},"reqs":{"jobs":[{"lvl":17,"id":1}]}},"partials":[{"type":"npc","id":"1008950","obj":{"i":1008950,"n":"Troubled Adventurer","l":52,"q":1}},{"type":"npc","id":"1000233","obj":{"i":1000233,"n":"Parnell","l":53,"q":2,"t":"Retainer Vocate"}},{"type":"npc","id":"1008951","obj":{"i":1008951,"n":"Novice Retainer","l":55,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}