{"quest":{"name":"He's Got a Ticket to Ride","location":"Gridania","id":66964,"patch":2.2,"sort":90,"eventIcon":71221,"issuer":1000373,"target":1000373,"genre":92,"journal":["Spinning Blade knows that whatever is lost is always found─as long as somebody is on the lookout. ","Spinning Blade has given you an airship ticket misplaced by a friend. Deliver it to the hapless Raimondaux before he misses his flight.","You find Raimondaux outside the airship landing worrying over his upcoming flight. A friendly greeting is certain to soothe his nerves. With the chat mode in <span class=\"highlight\">Say</span>, enter “Hail fellow well met!” to let him know he's among friends.","Raimondaux gives chilly acknowledgement of your greeting. It would seem you came on too strong. Attempt to subdue your excitement and try something a bit more general. With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!}.","Your second, less flamboyant greeting is better received. Raimondaux confesses that he feels uneasy about something, but he cannot put a finger on it. Clearly, you have the right man.","From his reaction, you surmise that Raimondaux is not expecting a messenger. He is obviously unaware that he is one airship ticket short of a trip. Needless suspense is a gift; with the chat mode in <span class=\"highlight\">Say</span>, enter “Got everything?” and see whether it sends Raimondaux into a fit of anxiety.","Raimondaux is horrified to realize from your question that his airship ticket is missing. How much kinder it would have been to just present him with the misplaced item! But of course, he will be all the happier when you restore the precious ticket─as you will right this moment.","Raimondaux is relieved to see his ticket, and grateful to both you and Spinning Blade. Why exactly he must leave Gridania so urgently is certainly none of your business. It is time to depart gracefully by entering the auto–translate option {Good-bye.} with the chat mode in <span class=\"highlight\">Say</span>.","You can never go wrong with a standard farewell, it seems. With Raimondaux taking to the air, it falls upon you to deliver his words of thanks to Spinning Blade.","Spinning Blade is happy to hear that his old friend is safely out of Gridania, and will say no more about why. Your curiosity is unsatisfied, but if what Spinning Blade said is true, you may have made a valuable ally this day."],"objectives":["Speak with Raimondaux.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Hail fellow well met!” to greet Raimondaux.","With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!} to greet Raimondaux again.","Speak with Raimondaux.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Got everything?”","Give the airship ticket to Raimondaux.","With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Good-bye.}.","Speak with Spinning Blade."],"dialogue":[{"name":"SPINNINGBLADE","text":"Oi, adventurer there, I needs something from you. Gots to deliver this airship ticket to a pal. Raimondaux's his name."},{"name":"SPINNINGBLADE","text":"I'd do it meself, but if Miounne sees me get up to leave, she'll be all over me about my tab."},{"name":"SPINNINGBLADE","text":"Good man, Raimondaux, but careless as a canary. Me ma would say he's the sort of fella who'd put his feet up then forget to take them with him."},{"name":"RAIMONDAUX","text":"Time, time, never enough time. I'd better check to see if I have everything─won't be seeing fair Gridania for a while."},{"name":"SYSTEM","text":"Raimondaux seems busy preparing for his flight."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Hail fellow well met!”"},{"name":"SYSTEM","text":"Hail fellow well met!"},{"name":"RAIMONDAUX","text":"Hail to you, too, adventurer, though I don't recall us being on such intimate terms. Now, if you'll excuse me, I have some travel preparations to make."},{"name":"SYSTEM","text":"Raimondaux is less than receptive to your greeting."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Hello!}."},{"name":"RAIMONDAUX","text":"Hm? Oh! You must forgive my earlier churlishness, adventurer. Travel always sets me on edge. Ever do I feel a niggling fear of forgetting something important..."},{"name":"RAIMONDAUX","text":"...Yes? You rather look as though you have something on your mind."},{"name":"SYSTEM","text":"Raimondaux is waiting for you to answer."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Got everything?”"},{"name":"SYSTEM","text":"Got everything?"},{"name":"RAIMONDAUX","text":"You know, I was just wondering the same thing, but I can't think of─ye gads! My ticket! Where is my airship ticket!? If I don't leave today, I shall never get out!"},{"name":"RAIMONDAUX","text":"Where did I put my ticket? If I can't get on the airship, all my plans are forfeit!"},{"name":"RAIMONDAUX","text":"My ticket! You found it! Nophica must have sent you Herself!<br>...Spinning Blade? Oh! I spoke with him briefly on my way down here. It must have fallen out of my pocket then!"},{"name":"RAIMONDAUX","text":"I am much obliged to you, adventurer, much obliged! A fine mess it would have been, to be refused passage on account of a lost ticket. Especially in my present circumstance...but no matter!"},{"name":"RAIMONDAUX","text":"It's time I head to the landing, lest I be late. I am glad to know you, adventurer!"},{"name":"SYSTEM","text":"It seems Raimondaux will be traveling today, after all."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter the auto–translate option {Good-bye.}."},{"name":"RAIMONDAUX","text":"Fare thee well, adventurer. You've saved my skin today!"},{"name":"RAIMONDAUX","text":"Will you do me one more service? Send my thanks to Spinning Blade. The Twelve willing, we three shall meet again!"},{"name":"SPINNINGBLADE","text":"He get it in time? Good, good. That'll learn him some...I hope."},{"name":"SPINNINGBLADE","text":"Careless as a canary, like I said. I don't know what's got him packing up his unmentionables for parts unknown, but he'll land on his feet, mark my words. Always been that way."}],"reqs":{"jobs":[{"lvl":9,"id":1}],"quests":[65665]}},"partials":[{"type":"npc","id":"1000373","obj":{"i":1000373,"n":"Spinning Blade","l":52,"q":1}},{"type":"quest","id":"65665","obj":{"i":65665,"n":"Spirithold Broken","g":1,"l":"Central Shroud","s":33}}]}