{"quest":{"name":"Seeds of Change","location":"Western Thanalan","id":66960,"patch":2.2,"sort":170,"eventIcon":71221,"issuer":1008758,"target":1008758,"involved":[1008760],"genre":93,"journal":["Following a trying sea voyage, Tatafu could use an adventurer, a mop, and a bath─in that order.","Tatafu's seasick courier being otherwise occupied, you have been charged with delivering cargo to Nanalai in Crescent Cove. You know not to tarry, for these burlap sacks large and small are eagerly awaited.","It turns out the sacks contained soil and seeds that will aid Nanalai in becoming a farmer. As wild as the scheme seems, the soon-to-be former fisher struck you as no fool. Now, hurry back to Vesper Bay, for Tatafu is owed payment for the merchandise.","Tatafu is dubious of the fisherman's chances, but admits to knowing little of the farming trade. While the same could be said of you, you cannot help but find your thoughts wandering back to the extra seeds you were given, and the idea of a small garden all your own..."],"objectives":["Deliver the two sacks to Nanalai.","Deliver Nanalai's payment to Tatafu."],"dialogue":[{"name":"TATAFU","text":"Well, this is a pretty kettle of fish! You'd think Roegadyn would be too damn...big to get seasick!"},{"name":"TATAFU","text":"Oh, adventurer! Yes, you there! Looking for work, perchance? Name's Tatafu. I'm a merchant just back from Limsa Lominsa, and I'm in a spot of trouble."},{"name":"TATAFU","text":"Hired this big lug to make the deliveries, but what I got instead are a couple of chum pails badly in need of emptying."},{"name":"TATAFU","text":"Can't let that stop me, though. Nanalai the fisher out in Crescent Cove needs what I've got. And though this upchucking good-for-nothing'll be up and about by tomorrow, Nanalai isn't like to stand the wait."},{"name":"TATAFU","text":"Well, everything's that much bigger and faster with Roegadyn, I'll grant that. Two chum pails full already! Anyway, what are you still doing here? Nanalai's expecting his goods!"},{"name":"NANALAI","text":"Mrmmm... Isn't here yet... Should be, should be. But isn't..."},{"name":"NANALAI","text":"Ah! You've got my delivery! You've got it, you've got it! Mrm, this sack's got some heft to it, it sure does. And it should, too, being full of soil."},{"name":"NANALAI","text":"What will I do with this soil? Put it on the ground, that's what. The littler bag you gave me is filled with seeds. It's time for some farming!"},{"name":"NANALAI","text":"Calamity's done made the fish stay away from these waters, so if we don't farm, we don't eat."},{"name":"NANALAI","text":"But there I go running my mouth and near forgetting the business. Got the gil for Tatafu right here. Tell her I'm much obliged."},{"name":"NANALAI","text":"I can see your concern, but don't worry none about us. Hells, we didn't always know how to fish, neither. But when you <span class=\"emphasis\">need</span> to learn something, you learn it, eh?"},{"name":"TATAFU","text":"Swiftly done! Was the fisher satisfied with his bits of land?"},{"name":"TATAFU","text":"Ah, the payment, is it? I guess he <span class=\"emphasis\">was</span> satisfied! Thank you. Let's see here... Yan, tan, tether... That's everything."},{"name":"TATAFU","text":"Can't rightly say I feel easy in my mind about this. Fishers have little enough gil as is without squandering it on La Noscean dirt."},{"name":"TATAFU","text":"Though what do I know, eh? The farmer in Limsa I got it from said it'll give the Cove's thin soil the boost it needs. So, hey, maybe they'll at least have a fighting chance."},{"name":"TATAFU","text":"Got to have hope, right? Here, that's some leftover seeds for you. If you come into a bit of land in one of those adventurer districts, go on and set up a vegetable patch or two."}],"reward":{"items":[{"id":7725},{"id":7726}],"xp":1820},"reqs":{"jobs":[{"lvl":17,"id":1}]}},"partials":[{"type":"npc","id":"1008758","obj":{"i":1008758,"n":"Tatafu","l":42,"q":1}},{"type":"npc","id":"1008760","obj":{"i":1008760,"n":"Nanalai","l":42,"q":1}},{"type":"item","id":"7725","obj":{"i":7725,"n":"La Noscean Orange Seeds","l":7,"c":27457,"t":82}},{"type":"item","id":"7726","obj":{"i":7726,"n":"Lowland Grape Seeds","l":11,"c":27457,"t":82}}]}