{"quest":{"name":"Saw That One Coming","location":"Gridania","id":66961,"patch":2.2,"sort":140,"eventIcon":71221,"issuer":1000375,"target":1007792,"involved":[1000153,1007793,1007794,1007795],"genre":92,"journal":["Eral has noticed a rare bit of excitement within the serene city–state and would share with you what he knows.","Eral has espied a lovely maid frolicking in the Acorn Orchard, and would have you discover whether a feast is nigh. Head off toward the play area outside the Carpenters' Guild to see what so pleases the fair Yedythe.","Yedythe proves to be a dancing master, albeit a rather agitated one at the moment. The younglings under her instruction have fled for more congenial pursuits. Yedythe wonders if Timbermaster Beatin may be of assistance in tracking them down.","Beatin's solution is deceptively simple: a toy for each child. Using the skills that won you acclaim as a tracker, find the truant younglings and present them with the toys.","The younglings see the toys through the lens of their hopes, and return to the orchard resolved to give their nervous dance instructor another try. Return to Yedythe and tell her of what transpired.","Yedythe is delighted to realize that she and the younglings have formed a tentative bond. She teaches you the harvest dance, and is impressed at your talent for it. However, before her plaudits can continue, Beatin appears and inadvertently scares off the poor instructor."],"objectives":["Speak with Yedythe.","Speak with Beatin.","Give the toys to the children.","Report to Yedythe."],"dialogue":[{"name":"ERAL","text":"I make no secret about my disinclination toward Gridanians, as you may know. But I just saw a rare sight that I would be remiss not to share with a fellow adventurer."},{"name":"ERAL","text":"Just over yonder in the Acorn Orchard, I saw a comely maiden─new to these benighted parts, I'd wager─dancing with a gaggle of younglings! 'Twas a dance I'd not seen before, and I've seen my fair share."},{"name":"ERAL","text":"Do they perhaps ready themselves for some fresh rite? After so much doom and gloom, I shouldn't mind a day of merrymaking! Ah, just the thought excites me. Would you see what it's all about?"},{"name":"YEADYTHE","text":"A day of <span class=\"emphasis\">merrymaking</span>? Is that all you adventurers think about?"},{"name":"YEADYTHE","text":"I am here to <span class=\"emphasis\">teach</span>, my dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">fellow</span></span>. From me, these younglings are to learn a most sacred, meaningful, and <span class=\"emphasis\">uniquely</span> uplifting dance."},{"name":"YEADYTHE","text":"Now, I realize full well that tradition may not hold much allure for the young, but I didn't think they would up and run away!"},{"name":"YEADYTHE","text":"This manner of disobedience is <span class=\"emphasis\">unprecedented</span>. It's all the more surprising considering they obey the timbermaster without demur."},{"name":"YEADYTHE","text":"What I wouldn't give to know his secrets, but I must wait here for my unruly charges. I wonder, though...might you ask the man how he tamed them?"},{"name":"YEADYTHE","text":"How is it that Timbermaster Beatin can get the children to <span class=\"emphasis\">obey</span> him?"},{"name":"BEATINE","text":"I do not recall summoning you, <span class=\"highlight\">Forename</span>. Is there something you wish me to inspect?"},{"name":"BEATINE","text":"Another green adventurer come to play with saws?"},{"name":"BEATINE","text":"...Apparently not. Speak your mind, child."},{"name":"BEATINE","text":"So the younglings will not heed their dancing master, and <span class=\"emphasis\">I</span> am to provide the solution. &lt;sigh&gt;"},{"name":"BEATINE","text":"Master Yedythe seems able enough, but having no generosity towards herself, she has none for her charges. Give the younglings these on her behalf, and bid them return to their lesson."},{"name":"BOY01425","text":"I ran off because it's boring. All Mistress Yedythe says is how we're doing it wrong!"},{"name":"BOY01425","text":"Hey, that's one of Master Beatin's! If this is supposed to be a bribe...then you've got yourself a deal, adventuring <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>!"},{"name":"GIRL01425","text":"But I don't <span class=\"emphasis\">want</span> to be a dancer. Why can't we just play? I mean, I guess we could dance for fun, but...I don't think Mistress Yedythe knows how! She's so uptight."},{"name":"GIRL01425","text":"Is this one of Master Beatin's toys? Does this mean there's more if I go back to class!? I'm on my way!"},{"name":"BOY201425","text":"Ummm...scoop with both hands, then look left, up, up, right, down... Or is it up, up, down, down, left, right, left, right? I wish she would let me take notes..."},{"name":"BOY201425","text":"Oh! Why, this is made of maple... It's unmistakable! Hah, Master Beatin would tell you the grain of it almost flows...like syrup. Someday, I'll be a timbermaster like him!"},{"name":"BOY201425","text":"...He wants me to go back to Mistress Yedythe's class, doesn't he? &lt;sigh&gt; He always tells us that if you can true a piece of wood, there's no excuse for not truing yourself... <span class=\"emphasis\">All right</span>, I'm going."},{"name":"YEADYTHE","text":"Well, I don't know what <span class=\"emphasis\">sorcery</span> you worked, but the younglings are back...and I do believe we've reached an accommodation! 'Twould seem I was stricter than I imagined...and loosening up a bit has made a <span class=\"emphasis\">great</span> difference!"},{"name":"YEADYTHE","text":"This dance is for the Feast of the Harvest, to give thanks to Nophica and the elementals. There must be <span class=\"emphasis\">no</span> aggression in this dance, lest the Matron be angered. It's very, <span class=\"emphasis\">very</span> important!"},{"name":"YEADYTHE","text":"I do realize I haven't made the <span class=\"emphasis\">best</span> first impression, having you fetch my students for me. To make it up to you, will you let me show you the dance? Think of it as a kind of...peace offering!"},{"name":"YEADYTHE","text":"Why, you are a <span class=\"emphasis\">born</span> dancer, dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>!"},{"name":"BEATINE","text":"(-Sonorous Voice-)And so say weee,♪<br>And so say weee...♪"},{"name":"BEATINE","text":"Comes a sailor from the sea,♪<br>To show the laddies how it's done,♪<br>And so say weee,♪<br>And so say weee...♪"},{"name":"BEATINE","text":"Swings his axe and says remember,♪<br>Shiver, shiver me timbers.♪<br>And so say weee,♪<br>And so say weee...♪"},{"name":"YEADYTHE","text":"<span class=\"emphasis\">Oh</span>... Oh, gods, <span class=\"emphasis\">nooo</span>! Master Beatin, what have you done!? You've brought a <span class=\"emphasis\">weapon</span> to the sacred dance! The Matron forgive us, we are surely <span class=\"emphasis\">doomed</span>!"},{"name":"BOY01425","text":"Master <span class=\"emphasis\">Beatin</span>! You scared her off! We were having fun!"},{"name":"BOY201425","text":"Timbermaster Beatin, wasn't that a sailor's song? How do you know it?"},{"name":"BEATINE","text":"I... Never mind how I know. More to the point, what could have troubled Mistress Yedythe so?"},{"name":"GIRL01425","text":"<span class=\"emphasis\">You</span> did! She said you're supposed to be peaceful or the elementals will be upset! And you know how uptight she gets..."},{"name":"BEATINE","text":"The course of relationships never does run smooth, child. You will all discover this in time."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Harvest Dance</span>!"}],"reward":{"emote":"Harvest Dance","xp":2415},"reqs":{"jobs":[{"lvl":14,"id":1}],"questsType":"any","quests":[66088,66081]}},"partials":[{"type":"npc","id":"1000375","obj":{"i":1000375,"n":"Eral","l":52,"q":3}},{"type":"npc","id":"1007792","obj":{"i":1007792,"n":"Yedythe","l":52,"q":1}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1007793","obj":{"i":1007793,"n":"Bubbly Boy","l":53,"q":1}},{"type":"npc","id":"1007794","obj":{"i":1007794,"n":"Gleeful Girl","l":53,"q":1}},{"type":"npc","id":"1007795","obj":{"i":1007795,"n":"Bashful Boy","l":53,"q":1}},{"type":"quest","id":"66088","obj":{"i":66088,"n":"A Royal Reception","g":1,"l":"Ul'dah","s":85}},{"type":"quest","id":"66081","obj":{"i":66081,"n":"A Mizzenmast Repast","g":1,"l":"Limsa Lominsa","s":80}}]}