{"quest":{"name":"Up in Arms","location":"North Shroud","id":66971,"patch":2.2,"sort":1,"icon":100249,"unlocksFunction":1,"eventIcon":71341,"issuer":1003075,"target":1008948,"genre":73,"journal":["Gerolt appears to be in a spot of bother.","Busy as ever with his kettle mending, Gerolt the weaponsmith would have you entertain an unexpected guest in his stead. Do as bade and speak with the visitor, an elderly gentleman by the name of Jalzahn.","Hailing from the Near Eastern city–state of Radz–at–Han, Jalzahn reveals himself to be none other than the genius mind behind Thavnairian mist, the elixir which you used to enhance your relic. According to the alchemist, your weapon can be raised to new heights of power through the use of crystalline objects he calls atma. Twelve unique pieces are required, and these can be obtained by equipping a relic weapon zenith and participating in FATEs in the following regions:<br>- Central Shroud: Atma of the Maiden<br>- Southern Thanalan: Atma of the Scorpion<br>- Upper La Noscea: Atma of the Water-bearer<br>- East Shroud: Atma of the Goat<br>- Eastern Thanalan: Atma of the Bull<br>- Middle La Noscea: Atma of the Ram<br>- Western Thanalan: Atma of the Twins<br>- Outer La Noscea: Atma of the Lion<br>- Lower La Noscea: Atma of the Fish<br>- North Shroud: Atma of the Archer<br>- Central Thanalan: Atma of the Scales<br>- Western La Noscea: Atma of the Crab<br><br>※Upon collecting all pieces of atma, present them to Jalzahn to complete the enhancement process."],"objectives":["Speak with Jalzahn."],"dialogue":[{"name":"GEROLT","text":"It's <span class=\"emphasis\">you</span>! Gods, I never thought I'd be glad to see ye!"},{"name":"GEROLT","text":"Just the other day, this old bloke from some faraway land suddenly appeared. He's been buggin' me ever since, askin' about puttin' souls in relics or summat. None of it makes a whit o' sense to me."},{"name":"GEROLT","text":"Can't the man see how busy I am, poundin' kettles all bloody day!? I ain't got the time to be humorin' the elderly!"},{"name":"GEROLT","text":"What's more, <span class=\"emphasis\">yer</span> the one with a relic, ain't that right? If there's anyone this Jalzahn bloke oughta be botherin', I reckon it's <span class=\"emphasis\">you</span>! Run along, then, an' keep the old coot off me back!"},{"name":"SYSTEM","text":"In order to receive the quest “Up in Arms,” you must be equipped with a relic weapon zenith. Paladins must be equipped with Curtana."},{"name":"SYSTEM","text":"In order to advance the quest “Up in Arms,” you must be equipped with a relic weapon zenith. Paladins must be equipped with Curtana."},{"name":"JALZAHN","text":"Ah, the impropriety! In my land, the elderly are treated with deference, and visitors received with honor!"},{"name":"JALZAHN","text":"You must excuse me, adventurer. I have endured a trying sea voyage to meet with Eorzea's greatest weaponsmith, only to find that he is the greatest boor I have ever had the displeasure of knowing."},{"name":"JALZAHN","text":"...But what is this? Your weapon─unless I am gravely mistaken, 'tis a relic infused with Thavnairian mist!"},{"name":"JALZAHN","text":"Marvelous, marvelous! Ah, but where are my manners?"},{"name":"JALZAHN","text":"Allow me to introduce myself. My name is Jalzahn, and I hail from the Near Eastern city–state of Radz–at–Han. I am an alchemist by trade."},{"name":"JALZAHN","text":"It has been my life's work to study the enhancement of arms through soul infusion. Verily, Thavnairian mist is one of the fruits of my toils."},{"name":"JALZAHN","text":"Upon learning that the elixir had come to some prominence in Eorzea, I journeyed here with the intent of exploring new possibilities in my research. I want but for a subject to proceed."},{"name":"JALZAHN","text":"If you would be that subject, your weapon will become further enhanced. Will you agree to assist me, adventurer, and for your troubles come to possess a mightier relic?"},{"name":"Q1","text":"Will you assist Jalzahn?"},{"name":"A1","text":"Yes"},{"name":"A2","text":"No"},{"name":"JALZAHN","text":"You answered in the negative, but the yearning in your eyes tells me a different tale. You are doubtful of my endeavor, and small wonder since we have only but met. If you would allow me to explain what my research shall entail, it may well put your doubts to rest."},{"name":"JALZAHN","text":"A decision you will not regret! But without further ado, allow me to explain what my research will entail."},{"name":"JALZAHN","text":"Now, I trust you are aware that aether permeates all things in our world. What you may not know, however, is that aether is found in greater concentrations in Eorzea than elsewhere."},{"name":"JALZAHN","text":"When a weapon infused with a quasi-soul such as your relic is used to slay a living being in this aether-rich land, a peculiar phenomenon occurs."},{"name":"JALZAHN","text":"The aether released by the fallen creature resonates with your weapon, and agglomerates into a crystal which I have dubbed “atma.” It must be noted that this occurs only on rare occasions, due to factors I have yet to identify."},{"name":"JALZAHN","text":"Now, as you may have already gathered, atma is essentially the crystallized soul of a living being. And these crystals hold the key to strengthening your weapon."},{"name":"JALZAHN","text":"According to my research, twelve unique pieces of atma are required, meaning they must be acquired from twelve different foes. See the deed done, adventurer, and you shall hold in your hands such power as you have never known!"},{"name":"SYSTEM","text":"By participating in certain FATEs while equipped with a relic weapon zenith, you may obtain an atma crystal. The locations of the FATEs and the atma yielded are as follows:"},{"name":"SYSTEM","text":"Central Shroud: Atma of the Maiden<br>Southern Thanalan: Atma of the Scorpion<br>Upper La Noscea: Atma of the Water-bearer"},{"name":"SYSTEM","text":"East Shroud: Atma of the Goat<br>Eastern Thanalan: Atma of the Bull<br>Middle La Noscea: Atma of the Ram"},{"name":"SYSTEM","text":"Western Thanalan: Atma of the Twins<br>Outer La Noscea: Atma of the Lion<br>Lower La Noscea: Atma of the Fish"},{"name":"SYSTEM","text":"North Shroud: Atma of the Archer<br>Central Thanalan: Atma of the Scales<br>Western La Noscea: Atma of the Crab"},{"name":"SYSTEM","text":"This information can be reviewed in the completed journal for the quest “Up in Arms,” which can be found under “Weapon Enhancement Sidequests.”"}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]},"next":[66972]},"partials":[{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"quest","id":"66972","obj":{"i":66972,"n":"Trials of the Braves","g":73,"l":"North Shroud","s":2,"f":1}}]}