{"quest":{"name":"Trials of the Braves","location":"North Shroud","id":66972,"patch":2.2,"sort":2,"unlocksFunction":1,"eventIcon":71341,"issuer":1008948,"target":1006976,"involved":[1001304],"genre":73,"journal":["Jalzahn is a man with grand plans for your relic weapon.","According to Jalzahn, your relic weapon still has room to grow. If you would enhance it further, you must recreate the valorous deeds of the Zodiac Braves, revered heroes in Thavnairian legend. So as to take the guesswork out of the process, Jalzahn suggests you acquire the “Trials of the Braves,” a collection of sacred texts that tell of the heroes' deeds. As a known vendor of such literature, perhaps Rowena will have the books in stock.","Rowena believes that she may have the literature you desire. She bids you take your inquiry to G'jusana, one among her burgeoning ranks of underlings.","Much to your delight, G'jusana has the full collection of the Trials of the Braves in stock, and offers to sell you each book for the bargain price of 100 Allagan Tomestone of Poetics. The means to possessing a mightier arm lies before you─you need but reach out and take it.<br><br>※You must be equipped with the relic weapon atma you wish to enhance when making the purchase.<br>※You can possess only one book in a set of nine at any given time.<br>※Upon completing the objectives in all nine books, present your relic weapon atma to Jalzahn to complete the enhancement process."],"objectives":["Speak with Rowena at Revenant's Toll.","Speak with G'jusana."],"dialogue":[{"name":"JALZAHN","text":"Ah, my stout assistant. I trust you are enjoying your atma–infused relic?"},{"name":"JALZAHN","text":"Now, while your newfound might may indeed be impressive...what if I were to tell you that your weapon may grow even mightier still?"},{"name":"JALZAHN","text":"My research leads me to believe that this is a distinct possibility. As before, if you would agree to be my subject, I promise that you will not be the worse for your part. What say you?"},{"name":"Q1","text":"Will you assist Jalzahn again?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"JALZAHN","text":"Come now, there is no need to be coy─'tis man's nature to be desirous of greater power. And though our interest in the subject may differ, we share the selfsame objective. At any rate, pray humor me─lend an ear to the theory I have recently formed."},{"name":"JALZAHN","text":"I knew I could count on you, my friend. Listen, then, to the theory I have recently formed."},{"name":"JALZAHN","text":"Legend tells that, when the world lies upon the brink of destruction, brave souls who bear the Light shall arise to banish the Darkness."},{"name":"JALZAHN","text":"These heroes are known by myriad names, but in my native Radz–at–Han they are called the “Zodiac Braves.”"},{"name":"JALZAHN","text":"The Zodiac Braves were said to wield arms of unparalleled might, that shone with the radiance of a thousand stars."},{"name":"JALZAHN","text":"My ultimate objective, dear adventurer, is no less than the recreation of these legendary arms."},{"name":"JALZAHN","text":"Thavnairian tradition holds that the Zodiac Braves gathered light to their weapons by vanquishing formidable foes. 'Tis my theory that the heroes were in fact absorbing souls."},{"name":"JALZAHN","text":"And now, through the use of atma, your weapon has been transformed into something with the selfsame ability, and it exists as a vessel for souls. At present, however, this vessel holds but a small fraction of its capacity."},{"name":"JALZAHN","text":"If your weapon is to realize its potential, you must have it drink deep of the souls of slain foes."},{"name":"JALZAHN","text":"Of course, not every soul is created equal, and so it follows that not all creatures will serve our purpose. Indeed, the Zodiac Braves themselves were very particular as to which foes they chose to vanquish."},{"name":"JALZAHN","text":"In the interests of efficiency, you would do well to seek out adversaries of like nature. For this, you might refer to the “Trials of the Braves,” a collection of sacred texts that tell of the heroes' deeds."},{"name":"JALZAHN","text":"The books are common enough in Radz–at–Han, but having recently formed my theory, I did not think to bring them with me, alas. Though, with trade flourishing between our lands, mayhap there is a local merchant dealing in imported wares who has them in stock."},{"name":"SYSTEM","text":"In order to receive the quest “Trials of the Braves,” you must be equipped with a relic weapon atma. Paladins must be equipped with either Curtana or the Holy Shield."},{"name":"SYSTEM","text":"In order to advance the quest “Trials of the Braves,” you must be equipped with a relic weapon atma. Paladins must be equipped with either Curtana or the Holy Shield."},{"name":"ROWENA","text":"Eh? Thavnairian literature on heroes who wielded dazzlin' weapons? An' it's called the Trials o' the Braves..."},{"name":"ROWENA","text":"Might be as I've got somethin' what fits your description. G'jusana's the one who deals in tomes an' the like. You'll find her near the north gate o' the Toll."},{"name":"ROWENA","text":"Might be as I have this Trials o' the Braves series in stock. G'jusana's the one who deals in tomes an' the like. You'll find her near the north gate o' the Toll."},{"name":"GJUSANA","text":"...Trials of the Braves? Why, yes, we happen to have the tomes, but why would anyone be interested in moldy old things like─"},{"name":"GJUSANA","text":"Ah! What I meant to say was, they're <span class=\"emphasis\">extremely</span> rare, and you aren't like to find them anywhere else in Eorzea!"},{"name":"GJUSANA","text":"Nine books comprise a set, and each alone is worth a small fortune. But I like you, adventurer, so I'm willing to offer them at a discount."},{"name":"GJUSANA","text":"For the bargain price of 100 Allagan Tomestone of Poetics, you can be the proud owner of a piece of history─a book from the sacred Trials of the Braves!"},{"name":"GJUSANA","text":"Make no mistake, anywhere else and you'll easily pay twice that. When you're keen to make the exchange, just let me know!"},{"name":"SYSTEM","text":"By defeating all the foes listed within a book of the Trials of the Braves, your relic weapon atma will gain in attributes."},{"name":"SYSTEM","text":"Distinct sets of Trials of the Braves exist for each relic. A set is comprised of nine books, of which only four are available for exchange at first."},{"name":"SYSTEM","text":"A paladin's set comprises seven books for Curtana, and two for the Holy Shield. Only six of these are available for exchange at first."},{"name":"SYSTEM","text":"Each book can be purchased from G'jusana. Please note, however, that you can possess only one at any given time."},{"name":"SYSTEM","text":"You must complete all of the objectives in a book before you may obtain another."},{"name":"SYSTEM","text":"Alternately, you may also dispose of it by speaking with G'jusana, or via the Key Items menu."},{"name":"SYSTEM","text":"May your relic drink deep of the souls of your enemies!"}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66971]},"next":[66998]},"partials":[{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"npc","id":"1006976","obj":{"i":1006976,"n":"G'jusana","l":67,"q":1}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"quest","id":"66971","obj":{"i":66971,"n":"Up in Arms","g":73,"l":"North Shroud","s":1,"f":1}},{"type":"quest","id":"66998","obj":{"i":66998,"n":"Celestial Radiance","g":73,"l":"North Shroud","s":3,"f":1}}]}