{"quest":{"name":"The Great Divide","location":"The Rising Stones","id":66978,"patch":2.3,"sort":39,"icon":100250,"eventIcon":71201,"issuer":1008579,"target":1008623,"involved":[1009239],"genre":2,"journal":["Minfilia's thoughts keep returning to the fate of the Students of Baldesion.","Though she is deeply troubled by the fate of the Students of Baldesion, Minfilia concedes that idle speculation will achieve nothing, and resolves to turn her thoughts to matters closer to home. But even as she begins to brief you on recent events in the Twelveswood, F'lhaminn enters the solar and announces that refugees hailing from Ul'dah have come to Revenant's Toll in search of asylum, like the Domans before them. In the ensuing exchange, it becomes apparent that the Scions lack the resources to accommodate additional numbers, however grave the need. In spite of this, Minfilia declares her intention to hear the refugees' petition, and asks that you accompany her to the Seventh Heaven.","As Minfilia struggles to turn away the petitioners, Tataru interrupts the meeting to report that Alphinaud was injured during a riot precipitated by refugees in Ul'dah, and is now receiving care at the Hourglass. Fearing for the lives of his fellow refugees, the chief petitioner begs the Antecedent to intervene─only to be told that those responsible will have to answer for their actions. Paying the man no further heed, Minfilia orders you to make haste for Ul'dah, in case Alphinaud is in need of assistance.","At the Hourglass, you are relieved to find that Alphinaud's condition is not so grave as you were given to believe. Sadly, the same cannot be said of Ul'dah. The riot, it seems, was the result of deep-seated tensions between refugees and Ul'dahn citizens, brought to the fore in the wake of the Domans' failed bid for asylum. To make matters worse, a large contingent of the Immortal Flames is currently engaged in joint training exercises, rendering the Grand Company undermanned at this critical juncture. By the time all forces have been recalled, Alphinaud fears that the situation may have deteriorated beyond mending."],"objectives":["Speak with the refugees in the Seventh Heaven.","Search for Alphinaud in Ul'dah."],"dialogue":[{"name":"MINFILIA","text":"Our friends...the very isle itself...everyone and everything..."},{"name":"MINFILIA","text":"...No. No, it avails us naught to speculate. Urianger will send word if there are any developments. Until such time as he does, we must remain firmly focused on that which is within our power to change. With that in mind, I would speak of a different matter. One closer to home."},{"name":"MINFILIA","text":"It concerns aetheric fluctuations which we had previously attributed to Good King Moggle Mog XII."},{"name":"MINFILIA","text":"That the king is no more is a blessing for which we have you to thank."},{"name":"MINFILIA","text":"Yet all is not well in the Twelveswood. Our latest readings reveal an ongoing aetheric disturbance of considerable magnitude. They may even suggest the presence of a primal."},{"name":"MINFILIA","text":"Needless to say, the mere possibility warrants immediate investigation, and I would have you─"},{"name":"FLHAMINN","text":"Ascilia? I do not wish to interrupt, but we have a problem."},{"name":"MINFILIA","text":"What manner of problem?"},{"name":"FLHAMINN","text":"A band of refugees─hailing from Ul'dah, this time─are come to Revenant's Toll seeking asylum."},{"name":"FLHAMINN","text":"It would seem they expect us to afford them the same treatment we gave the Domans. At present, they are in the Seventh Heaven, awaiting a formal response."},{"name":"MINFILIA","text":"...I see. Mayhap this was to be expected. I shall meet with them at once."},{"name":"FLHAMINN","text":"Ascilia. You know full well we haven't the resources to accommodate many more people. Consider what will happen if you do this. Word will spread, and more will follow."},{"name":"MINFILIA","text":"...Your opinion is duly noted─but I <span class=\"emphasis\">will</span> hear their suit."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>─I should be grateful for your presence at this meeting."},{"name":"MINFILIA","text":"I am well aware that our resources are finite, but we have a responsibility to protect the people of Eorzea."},{"name":"MINFILIA","text":"I apologize for keeping you waiting. My name is Minfilia, and I lead the Scions of the Seventh Dawn."},{"name":"REFUGEE01442","text":"Twelve be praised, it <span class=\"emphasis\">is</span> you!"},{"name":"REFUGEE01442","text":"We're ready and willin' to work, same as the Domans! Just give us a task, and we'll see it done!"},{"name":"MINFILIA","text":"Pray calm yourselves! I appreciate your enthusiasm, but I know naught of your situation."},{"name":"REFUGEE01442","text":"Beg your pardon, Antecedent. I...I ain't so good with words."},{"name":"REFUGEE01442","text":"We've been livin' off the scraps of Ul'dah for years now. Tryin' to piece together a life to replace the one what got took."},{"name":"REFUGEE01442","text":"They say there's work, but there's naught for an honest man. Naught as wouldn't sully his soul sooner than his palms, anyroad. The Flames do what they can for us, o' course, but it ain't near enough."},{"name":"REFUGEE01442","text":"And it's only gettin' worse. When the Calamity brought us to our knees, those rich bastards in the city didn't help us up─they climbed on our backs."},{"name":"REFUGEE01442","text":"I don't pretend to be clever, but even I can see what's comin'. I knew we had to run, the only question was where. And then it came to me: Revenant's Toll!"},{"name":"REFUGEE01442","text":"I mean, you took them foreigners in, didn't you? So you'd surely do the same for us!"},{"name":"MINFILIA","text":"I... I fear the situation is rather more complicated. While it is true that we accepted the Domans' petition for aid, that decision was the product of extraordinary circumstances."},{"name":"MINFILIA","text":"I sympathize deeply with your plight, but pray understand that it is not possible for an organization of our means to aid all who have been affected by the Calamity."},{"name":"MINFILIA","text":"And so it is with great regret that I must deny your request."},{"name":"REFUGEE01442","text":"But... But we've nowhere else to go! You're turnin' your back on us!?"},{"name":"TATARU","text":"If I might have a word..."},{"name":"MINFILIA","text":"Tataru? Is aught amiss?"},{"name":"TATARU","text":"Ill tidings from Ul'dah, my lady. Alphinaud has...Alphinaud has been wounded! "},{"name":"MINFILIA","text":"What!? How? Is it serious?"},{"name":"TATARU","text":"I cannot say for certain, but I fear it might be. According to the Flames, the refugees started a riot. They went wild, apparently─lashing out at any and everyone!"},{"name":"MINFILIA","text":"（★未使用／削除予定★）"},{"name":"REFUGEE01442","text":"That can't be right! Why would they? They must've been provoked! The demonstration was meant to be peaceful!"},{"name":"REFUGEE01442","text":"Seven hells... Now the Blades have an excuse, they'll round us up and kill anyone who tries to resist!"},{"name":"REFUGEE01442","text":"Antecedent, please! If you won't help us build a new life, at least help us keep the ones we've got!"},{"name":"TATARU","text":"My lady..."},{"name":"MINFILIA","text":"We are not ones to stand idly by and watch innocents suffer."},{"name":"MINFILIA","text":"However, until we know more of the circumstances surrounding this riot, I am not certain what aid, if any, we can provide."},{"name":"MINFILIA","text":"If the authorities determine that the refugees attacked without provocation, then those responsible will have to answer for their actions."},{"name":"REFUGEE01442","text":"How can you be so blind...?"},{"name":"MINFILIA","text":"Find Alphinaud, and quickly. If he is in danger─or worse─I would have you and none other by his side."},{"name":"MINFILIA","text":"Thank you. Pray do not concern yourself with the matter we were discussing earlier. Yda and Papalymo will see to it."},{"name":"TATARU","text":"Alphinaud is being treated at the Hourglass. Hurry, <span class=\"highlight\">Forename</span>!"},{"name":"REFUGEE01442","text":"Don't believe what they say! I <span class=\"emphasis\">know</span> these people. They would only take up arms to defend themselves! If there was a riot, I swear to you they didn't start it!"}],"reward":{"gil":658,"items":[{"id":7337,"one":1},{"id":7347,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66899]},"next":[66979]},"partials":[{"type":"npc","id":"1008579","obj":{"i":1008579,"n":"Minfilia","l":481,"q":4}},{"type":"npc","id":"1008623","obj":{"i":1008623,"n":"Alphinaud","l":40,"q":7}},{"type":"npc","id":"1009239","obj":{"i":1009239,"n":"Draggle-tailed Refugee","l":67,"q":1}},{"type":"item","id":"7337","obj":{"i":7337,"n":"Daystar Earrings","l":110,"c":55287,"t":41}},{"type":"item","id":"7347","obj":{"i":7347,"n":"Evenstar Earrings","l":110,"c":55287,"t":41}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66899","obj":{"i":66899,"n":"Through the Maelstrom","g":2,"l":"Limsa Lominsa","s":38}},{"type":"quest","id":"66979","obj":{"i":66979,"n":"Desperate Times","g":2,"l":"Ul'dah","s":40}}]}