{"quest":{"name":"A Case of Indecency","location":"Eastern La Noscea","id":66977,"patch":2.3,"sort":12,"icon":100276,"unlocksFunction":1,"eventIcon":71341,"issuer":1009341,"involved":[1009337,1009345,1009347,1009348,1009351],"genre":68,"journal":["With a maiden's virtue hanging in the balance, Hildibrand would hasten back to Costa del Sol.","His vaunted powers of deduction having afforded him no particular insight into the identity of the phantom thief, Hildibrand is nonetheless infinitely confident that he is fully prepared for the final confrontation with his foe. Return to Costa del Sol and see if Inspector Briardien's investigation has proved more fruitful.","With the phantom thief still on the loose and the banquet about to begin, Inspector Briardien has determined that it is too dangerous to allow Miss Arabella to appear before the crowd at the ceremony. Obtain a set of servant's garb from the Gegeruju Manor retainer that may serve as a suitable disguise for the maiden. In the meantime, Hildibrand has been charged with creating a diversion to distract Vannes from the absence of his betrothed.","The Gegeruju Manor retainer furnishes you with a set of nondescript garb. Deliver it to Lady Arabella outside Costa del Sol, that she might safely hide herself from the thief's eye.","At Inspector Briardien's behest, Miss Arabella changes into the clothes you procured, disguising herself as a servant. He bids you deliver the exquisite garment the maiden had previously been wearing to Hildibrand, that it might avail him in his task somehow.","Though not entirely sure what he is meant to do with the dress you entrusted to him, Hildibrand nevertheless assures you that he has the situation under control, and encourages you to find a seat from which to enjoy the festivities.","Hildibrand's flawless plan, in a nutshell, involved donning the dress and presenting himself as the lapis maiden. When Vannes reacts with utter shock, Hildibrand concludes that he is the phantom thief in disguise, as the true Vannes─who had never before seen Miss Arabella's face─would never have suspected that aught was amiss. His logic failing to find a sympathetic ear, Hildibrand is immediately seized by the Brass Blades of the Gerbera.<br><br>No sooner does this happen than does Vannes recognize Arabella amidst the crowd and grab her by the hand. Inspector Briardien recognizes the glove on Vannes's right hand, but before he can take action, the thief reveals himself in a puff of smoke, summoning the vicious Mandragoras to protect him. A close encounter with Hildibrand sends the rogue vegetables fleeing in terror, but the thief has already made off with his treasure─not the maiden herself, but the neckpiece she wore.<br><br>As Miss Arabella, now free from her betrothal to Vannes, breathes a sigh of relief, a flying card of challenge buries itself in Hildibrand's pate, writ “I shall come to claim the victor's spoils.” Though Inspector Briardien finally deduces that the thief and the mad bombardier who almost claimed his life are not one and the same, the two inspectors nevertheless vow that the thief has stolen his last treasure."],"objectives":["Speak with Briardien in Costa del Sol.","Obtain a set of servant's garb from the Gegeruju Manor retainer.","Deliver the servant's garb to Arabella.","Deliver the breathtaking dress to Hildibrand.","Take your position and wait for the banquet to begin."],"dialogue":[{"name":"HILDIBRAND","text":"We've not a moment to lose, friend! The time of our final confrontation with the fiend is nigh!"},{"name":"HILDIBRAND","text":"Our foe has doubtless assumed a new identity, but have no fear! Upon our return to Costa del Sol, I shall employ the time–tested Manderville art of parley to cut through the fiend's flimsy facade!"},{"name":"HILDIBRAND","text":"'Tis an art that I would impart to you as well, friend, though there will be time enough for that once our foe is in shackles and Miss Arabella is safe."},{"name":"HILDIBRAND","text":"No doubt it shall prove as invaluable in your adventures as it has in my investigations─or failing that, serve to entertain you when you have nothing better to do."},{"name":"HILDIBRAND","text":"...But I digress. A gentleman must away to Costa del Sol─the fair maiden's life hangs in the balance! Nashu, Miss Ellie─with me!"},{"name":"HILDIBRAND","text":"That fellow under the table looks terribly suspicious..."},{"name":"ARABELLA","text":"I must return to the estate to prepare for the banquet. Till we meet again, friend."},{"name":"HILDIBRAND","text":"Inspector Briardien! I have seen to the maiden's safety─Miss Arabella will be along soon. How fares your investigation?"},{"name":"BRIARDIEN","text":"I have canvassed the grounds, but none of the guests are concealing their hands. How can this be!? The thief must be <span class=\"emphasis\">somewhere</span>!"},{"name":"MOB01441","text":"Miss Arabella just left her estate, I hear. I suppose we'll find out soon enough if her beauty is truly a match for our own. Tee hee!"},{"name":"BRIARDIEN","text":"There's no time. Without the thief in custody, we cannot risk allowing Miss Arabella to take the stage."},{"name":"ELLIE","text":"B-But, Inspector, Vannes and his family will not take kindly to his betrothed's absence."},{"name":"BRIARDIEN","text":"Hmph! That is nothing of my concern. Besides, doubtless the <span class=\"emphasis\">inspector</span> here will think of something."},{"name":"HILDIBRAND","text":"M-Me? What do you propose!?"},{"name":"BRIARDIEN","text":"You're the expert at creating diversions. Can't you just knock something over, blow something up, or the like? You know─like you <span class=\"emphasis\">always</span> do?"},{"name":"HILDIBRAND","text":"Inspector Briardien! I knew the day would come that you recognized my many talents! Worry not about Master Vannes! Yes, for the sake of the maiden, a gentleman will do what must needs be done!"},{"name":"BRIARDIEN","text":"...The poor sop lacks even the wits to know when he's being insulted. Now, to the task at hand. We must find a way to conceal Miss Arabella's true identity."},{"name":"ELLIE","text":"Not far from here are the servants' quarters. There should be a change of clothes lying about."},{"name":"BRIARDIEN","text":"...Perfect. <span class=\"highlight\">Forename</span>. Find some suitably ordinary garb and deliver it to Miss Arabella outside the gates. I shall proceed with the investigation."},{"name":"HILDIBRAND","text":"Leave the betrothed and his family to me, my friend! Master Vannes will not suspect for a moment that aught is amiss!"},{"name":"BRIARDIEN","text":"Find some inconspicuous garb from the servants' quarters and deliver it to Miss Arabella outside the gates. I shall proceed with the investigation."},{"name":"SERVANT01441","text":"Has the lapis maiden arrived yet? I simply must look upon her beauty for myself!"},{"name":"SERVANT01441","text":"Servant's garb, you say? I much prefer what you're wearing, but we certainly have enough rags to go around. Here you go─do with them as you will."},{"name":"SERVANT01441","text":"Has the lapis maiden arrived yet? I simply must look upon her beauty for myself!"},{"name":"ARABELLA","text":"Greetings, friend. Oh? What's this you have for me?"},{"name":"ARABELLA","text":"Servant's garb...? But why?"},{"name":"BRIARDIEN","text":"Miss Arabella. With the thief still at large, the risk of letting you be seen is too great. Change into those clothes and promise that you will not leave my sight."},{"name":"ARABELLA","text":"B-But the ceremony! Father will be furious! And Lord Vannes..."},{"name":"BRIARDIEN","text":"We are dealing with a man who tried to blast me to the heavens...and almost succeeded. We cannot exercise enough caution. As for the ceremony, I have entrusted the matter to a certain gentleman. You need only concern yourself with your own safety."},{"name":"LEWENHART","text":"We should do as the inspector says, Miss Arabella. Your life is more important than this marriage, or whatever profits your father stands to gain from it."},{"name":"ARABELLA","text":"Lewen, if Father heard you say such things..."},{"name":"LEWENHART","text":"...I should have said them long ago. By not doing so, I have put your life in danger. But besides, we have not one, but two skilled inspectors on the case. It will not be long until the fiend is brought to justice."},{"name":"ARABELLA","text":"...Very well. I shall retreat to the carriage. Pray wait for me here."},{"name":"ARABELLA","text":"My apologies for the delay. What should I do with my banquet dress, Inspector?"},{"name":"BRIARDIEN","text":"<span class=\"highlight\">Forename</span>. Bring Miss Arabella's dress to that bumbling inspector. I dare not speculate as to how he intends to see to his task, but I would imagine he requires all the help he can get. Now, let us return before the festivities begin."},{"name":"BRIARDIEN","text":"You will not elude me this time, fiend..."},{"name":"HILDIBRAND","text":"Ah, you return! Me? I was in the act of formulating a master plan to distract Master Vannes at the ceremony. Is there aught I might do for you?"},{"name":"HILDIBRAND","text":"Why, this is...Miss Arabella's dress? I must admit to some confusion as to what to do with it... But worry not! I shall take it into safekeeping!"},{"name":"HILDIBRAND","text":"And with that, I must attend to Master Vannes before the ceremony begins."},{"name":"HILDIBRAND","text":"Worry not, friend! I assure you that Inspector Briardien and I have the situation entirely under control! Why not find yourself a seat and enjoy the festivities?"},{"name":"BRIARDIEN","text":"Curses! How am I supposed to find my man with all these people milling about!?"},{"name":"YALTONOLTO","text":"Friends...family...business associates. 'Tis an honor and a pleasure to welcome one and all to Costa del Sol for today's feast, co–hosted by the Brugaire Consortium and the East Aldenard Trading Company."},{"name":"SAINANA","text":"We trust that you've been enjoying fine food, fine spirits, and profitable conversation."},{"name":"MOB01441","text":"The lapis maiden! If even half the tales of her beauty are true, Vannes is the luckiest bastard in the realm!"},{"name":"MORGANT","text":"Yalto Nolto, Sainana...honored guests. It's a great pleasure to announce the betrothal of my son, Vannes─future chair of the Brugaire Consortium─to Arabella, daughter of Master Guguremu of the East Aldenard Tradin' Company."},{"name":"MORGANT","text":"The couple would exchange their eternal vows 'ere today, that the 'appiness that is theirs may usher in a new era of prosperity for one and all."},{"name":"MORGANT","text":"Ladies and gentlemen, may I present my son's lovely bride! The lapis maiden, whose beauty minstrels will sing of for ages to come!"},{"name":"BRIARDIEN","text":"Damn you, Hildibrand Manderville! You had <span class=\"emphasis\">one job</span>!"},{"name":"NASHUMHAKARACCA","text":"She's... She's beautiful!"},{"name":"VANNES","text":"Hmph! Were the rabble expecting otherwise? She is <span class=\"emphasis\">my</span> bride, after all."},{"name":"VANNES","text":"Milady. They say your beauty transcends even the boundaries of time. When we are wed, you will want for nothing. Pray give your hand unto me."},{"name":"HILDIBRAND","text":"(-Hildibella-)My sun and stars! Yes, yes─a thousand times yes! I am yours, and shall be forevermore!"},{"name":"VANNES","text":"Wh-What have you done with my bride, you cross–dressing deviant!?"},{"name":"BRIARDIEN","text":"&lt;groan&gt; ...Not quite what I had intended, but I suppose it serves our purposes."},{"name":"HILDIBRAND","text":"Fear not, ladies and gentlemen, for Miss Arabella is safe and sound! I, Hildibrand, agent of enquiry, inspector extraordinaire, have but assumed the maiden's appearance to ensnare the vile fiend who would take aim at her life!"},{"name":"HILDIBRAND","text":"The fiend who now lies defenselessly before me! The game is up, Vannes! Or shall I call you by another name...the thief of many faces!"},{"name":"HILDIBRAND","text":"今この会場で「怪盗白仮面」が変装している人物……。<br>それは、私の隣にいるヴァンネス殿ですぞ！！"},{"name":"VANNES","text":"M-Me, the thief!? Are you mad?"},{"name":"HILDIBRAND","text":"It appears that my masterful deductions have proved beyond the grasp of your mind. Very well! Allow me to elucidate."},{"name":"HILDIBRAND","text":"While there is not a soul in the realm who has not heard the tales of Miss Arabella's beauty, there are but two men here in Costa del Sol who had gazed upon her lovely visage before today─her father, Guguremu, and her steward, Lewenhart."},{"name":"HILDIBRAND","text":"As you yourself admitted on multiple occasions, Master Vannes, you were to have your first glimpse of your bride-to-be today. Considered in this light, would you not say your reaction upon seeing my face was most...unnatural?"},{"name":"HILDIBRAND","text":"Who else could see through my ingenious disguise? Who could know at a glance that I was not the fair maiden!? None save you─ye of a thousand faces!"},{"name":"ELLIE","text":"(-Ellie-)...And anyone <span class=\"emphasis\">else</span> with half their wits about them!"},{"name":"VANNES","text":"H-How dare you make a mockery of my wedding day!? Guards! Arrest that pervert at once! Lock him up in gaol and throw away the key!"},{"name":"VANNES","text":"Arabella? Oh, thank the gods you're safe! Come with me quickly─there's a dangerous madman about!"},{"name":"BRIARDIEN","text":"A glove on his right hand! Could it be...!?"},{"name":"AMANYFACEDPHANTOMTHIEF","text":"Ahahaha! The man is a fool, but it would have behooved you to listen to him. Alas, you did not, and what is yours is now mine."},{"name":"MOB201441","text":"Th-That's the thief! Stop wasting your time with that imbecile and arrest him!"},{"name":"HILDIBRAND","text":"You came all this way...for me? You love me! You really, <span class=\"emphasis\">really</span> love me!"},{"name":"AMANYFACEDPHANTOMTHIEF","text":"The attention is most flattering, but I have taken what I came for, and now I must away. Milords, miladies─till we meet again!"},{"name":"ELLIE","text":"I hear that the real Vannes was found bound and gagged in a storage room. Truly, Miss Arabella, I am sorry..."},{"name":"ARABELLA","text":"For what, milady? The banquet was more exciting than I ever could have hoped for. Vannes and his father were furious, of course, and our marriage has been called off."},{"name":"ARABELLA","text":"...But perhaps it is for the best. I would find my own way to make Father happy, by living my life as I would live it. It is you, Inspector Hildibrand, who taught me this lesson."},{"name":"ELLIE","text":"For the love of the gods, somebody find him a change of clothes."},{"name":"ELLIE","text":"But one thing still puzzles me. The thief's challenge said he would steal the lapis maiden's virtue. Yet in the end, he took only her neckpiece..."},{"name":"LEWENHART","text":"Now that you mention it, Master Guguremu told me about the clasp when it first arrived. Engraved with the mark of the sun goddess, it is one of the most treasured pieces from the Brugaire collection, known by many as “Azeyma's Virtue”..."},{"name":"BRIARDIEN","text":"The maiden's virtue, indeed. When the next challenge comes, we must take extra care to read between the lines."},{"name":"NASHUMHAKARACCA","text":"Over here, Inspector! It says, er...“Made you look!”"},{"name":"BRIARDIEN","text":"The fiend plays us for fools! Give that to me at once!"},{"name":"BRIARDIEN","text":"“When next we meet, I shall come to claim the victor's spoils.”<br>...Hmph, another riddle."},{"name":"BRIARDIEN","text":"If nothing else, it appears the thief has abandoned any foolish notions of my assassination. Still, we must ever be on guard. The fiend attempted murder once─he may very well do so again."},{"name":"HILDIBRAND","text":"V-Verily, Inspector! I must agree! One can never be too wary when dealing with a murderer!"},{"name":"BRIARDIEN","text":"Hear me, man of a thousand faces. You sealed your fate when you called me out by name. Mark my words: when next we meet, you will be mine."},{"name":"HILDIBRAND","text":"Yes, it was the phantom thief who was to blame for that bomb! Truly, verily, indubitably the phantom thief! Most certainly! Hahaha! Haha... Ha... Ha...?"},{"name":"SYSTEM","text":"You have unlocked the Parley mini-game. Entertain yourself as many a Manderville man has before you by opening the toy chest in any inn room."},{"name":"HILDIBRAND","text":"To the victor goes a priceless treasure!"},{"name":"HILDIBRAND","text":"While the smile of a champion holds secrets untold!"},{"name":"HILDIBRAND","text":"Are eight legs better than two?"},{"name":"HILDIBRAND","text":"Can a Manderville man triumph over terrors and win the day?"},{"name":"NASHUMHAKARACCA","text":"The key to the next case is also the key to the storeroom! Be sure not to lose it!"},{"name":"NASHUMHAKARACCA","text":"...Wait, it's a real key <span class=\"emphasis\">and</span> a figurative one? At the same time?<br>Is that even possible? ...I guess we'll find out next time!"}],"reward":{"gil":714,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66976]},"next":[65702]},"partials":[{"type":"npc","id":"1009341","obj":{"i":1009341,"n":"Hildibrand","l":32,"q":2}},{"type":"npc","id":"1009337","obj":{"i":1009337,"n":"Arabella","l":32,"q":2}},{"type":"npc","id":"1009345","obj":{"i":1009345,"n":"Hildibrand","l":32,"q":1}},{"type":"npc","id":"1009347","obj":{"i":1009347,"n":"Gegeruju Manor Retainer","l":32,"q":1}},{"type":"npc","id":"1009348","obj":{"i":1009348,"n":"Arabella","l":32,"q":1}},{"type":"npc","id":"1009351","obj":{"i":1009351,"n":"Briardien","l":32,"q":2}},{"type":"quest","id":"66976","obj":{"i":66976,"n":"Seeds of Rebellion","g":68,"l":"Western La Noscea","s":11,"f":1}},{"type":"quest","id":"65702","obj":{"i":65702,"n":"Eight-armed and Dangerous","g":68,"l":"Eastern La Noscea","s":13,"f":1}}]}