{"quest":{"name":"Seeds of Rebellion","location":"Western La Noscea","id":66976,"patch":2.3,"sort":11,"icon":100275,"unlocksFunction":1,"eventIcon":71341,"issuer":1009331,"target":1009337,"involved":[1009319,1009321,1009335,1009336,1009341,1009351],"genre":68,"journal":["The tiny trader would ask you to save the realm from a vegetal scourge.","The tiny trader tells the fearsome tale of the Mandragoras, a band of rogue vegetables who will stop at nothing to overthrow their plant–eating oppressors. Upon learning that you are the adventurer who bested the duelist Gilgamesh, he becomes convinced that you are the only one who can quash the vegetable insurrection. This might also afford you the perfect opportunity to reclaim the shipment of vegetables intended for Costa del Sol. Make for the Isles of Umbra, where a tyrannical vegetocracy rules with an iron fist, and pluck mandragora buds to ensure that their numbers do not grow.","Angry screechings and squeakings in the distance give you the sense that someone is ill pleased with your plucking of the sproutlings, but the Mandragoras─and the foodstuffs they stole from Costa del Sol─are nowhere to be found. Perhaps Inspector Hildibrand has had more success in ascertaining their whereabouts.","You find Hildibrand buried arse–up in the ground after a one–sided skirmish with the Mandragoras, and in the next instant, the rogue vegetables are upon you. With the inspector unable to extricate himself in time, you single-handedly depose the vegetocracy and reclaim the pilfered foodstuffs. Return to Costa del Sol and deliver the goods to Lewenhart.","Lewenhart welcomes the return of the stolen foodstuffs, relieved that your efforts have spared him Guguremu's wrath. Confusion ensues upon inspecting the crate's contents, however, as the prized purple dragon peppers sought by Lewenhart are nowhere to be found, with peppers of a vivid blue in their place. Inspector Briardien quickly deduces that Lewenhart is none other than the phantom thief─he saw the peppers through red goggles while still in disguise as a Brass Blade. Before you can apprehend him, the fiend sprints off in the direction of north Bloodshore. Pursue him with all haste.","Your search of the shoreline turns up the true Lewenhart, incapacitated and left for dead by the thief days ago. Though your quarry has eluded you and likely assumed another identity, the maiden's virtue may yet be saved. Upon learning that the fiend suffered a wound to his right hand, Inspector Briardien sets off for Costa del Sol to inspect the hands of the banquet guests. While he investigates, accompany Hildibrand and Lewenhart to Wineport and see to Miss Arabella's safety.","You find Arabella safe and sound, admiring the flowers in the gardens of Wineport. She explains that her betrothal to Vannes was arranged by their families years ago, and that she will be meeting her husband–to–be for the first time at the banquet. Though her heart is conflicted─and notwithstanding Inspector Hildibrand's not–so–subtle advances─she has nevertheless decided to honor the commitment in gratitude to her adoptive father, Guguremu, who took her in from the streets when she was but a babe."],"objectives":["Pluck mandragora buds at the Isles of Umbra.","Reclaim the stolen foodstuffs from the Mandragoras.","Deliver the stolen foodstuffs to Lewenhart in Costa del Sol.","Search for Lewenhart.","Speak with Arabella in Wineport."],"dialogue":[{"name":"MERCHANT01439","text":"To hear most say it, the Mandragoras are a nasty lot─a right pain in the arse to farmers and provisioners the realm over. But let me tell ye, friend, that ain't the least of it."},{"name":"MERCHANT01439","text":"Freein' their fellow fronds from our larders and tables is but the beginning. The bulbous blackguards have a far grander scheme─revolution!"},{"name":"MERCHANT01439","text":"Madness, ye say? Take a ferry to the Isles of Umbra and see with your own eyes! A veritable vegetable kingdom where eggplants and turnips rule with an iron fist!"},{"name":"MERCHANT01439","text":"Hm? This muscle-bound fellow with the dim expression─I could swear I've seen his face somewhere before..."},{"name":"MERCHANT01439","text":"...Bugger me! If it ain't the undead overlord what fancies himself a gentleman inspector!"},{"name":"MERCHANT01439","text":"Which would make you... Aye, could it be? The adventurer what bested the thievin' duelist in single combat!?"},{"name":"Q1","text":"Are you the one who bested the duelist?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"MERCHANT01439","text":"Well, bugger me and call me Inspector! Tell me─is it true the duelist traveled with a demon bird whose crow could split the heavens?"},{"name":"MERCHANT01439","text":"Not just brave, but humble, too. Hells, if it'd been me what did the deed, I'd be shoutin' my name from the top of every mountain in Eorzea."},{"name":"MERCHANT01439","text":"...But that's neither here nor there. Look, I dunno about you, but I ain't so keen on the notion of callin' a bloody tomato <span class=\"emphasis\">Yer Grace</span>."},{"name":"MERCHANT01439","text":"And that's exactly the fate we're in for if we don't nip this revolution in the bud─and I mean that lit'rally."},{"name":"MERCHANT01439","text":"As we speak, the Mandragoras are plantin' themselves a whole army o' their own kind on the Isles of Umbra. You'd be doin' the whole realm a favor if ye could go there and uproot them 'fore the harvest comes."},{"name":"HILDIBRAND","text":"(-Hildibrand-)Many a case have I solved in my day, but I've not matched wits with sentient plant life before. This should prove quite exhilarating! To the Isles of Umbra!"},{"name":"MERCHANT01439","text":"I dunno about you, but I ain't so keen on the notion of callin' a bloody tomato <span class=\"emphasis\">Yer Grace</span>. I'm beggin' ye, friend, make for the Isles of Umbra and nip the vegetable rebellion in the bud."},{"name":"MANDRAGORAA","text":"(-Distant Voice-)○×▽......!<br>◎◎×△□!!!"},{"name":"MANDRAGORAB","text":"(-Distant Voice-)○○......?<br>×□○......"},{"name":"MANDRAGORAC","text":"(-Distant Voice-)×□♪◎×◎.<br>□＄◎×△□◎◎......♪"},{"name":"SYSTEM","text":"You feel a hostile gaze upon you..."},{"name":"HILDIBRAND","text":"Friend! My pursuit of the Mandragoras has led me beneath the surface! Yes, they must be down here...unggghhh...somewhere!"},{"name":"HILDIBRAND","text":"Worry not, for I remain close in pursuit of our quarry! How fare you on the surface?"},{"name":"HILDIBRAND","text":"Impeccably fought, my friend! I only wish I had seen the battle with my own eyes. You may go on ahead to Costa del Sol. I shall be along as soon as I extricate myself."},{"name":"HILDIBRAND","text":"What took you so long, friend? The Isles of Umbra are but a short sprint away. I trust you have brought along the goods we so bravely reclaimed?"},{"name":"LEWENHART","text":"You return! I feared you might end up a tasty snack for a crazed head of cabbage."},{"name":"LEWENHART","text":"The stolen foodstuffs! You've saved my hide today. Oh, but I must see if those purple dragon peppers are intact. Master Guguremu is quite particular about his seasonings..."},{"name":"NASHUMHAKARACCA","text":"Ooh! Can I come, too? I've never seen a purple dragon pepper before!"},{"name":"HILDIBRAND","text":"That wild vegetable chase was a pleasant diversion, but it is time we returned to the case. Now, there must be some clue that yet eludes us..."},{"name":"NASHUMHAKARACCA","text":"Cor! The peppers have changed color!"},{"name":"HILDIBRAND","text":"What's this!? Peppers that possess the same powers of disguise as our many–faced foe? A gentleman must needs investigate!"},{"name":"BRIARDIEN","text":"A striking shade of blue, quite far from the purple that Master Lewenhart described. Perhaps we recovered the wrong crate?"},{"name":"NASHUMHAKARACCA","text":"But look here, Inspector! The crate is clearly marked for Costa del Sol. How curious..."},{"name":"LEWENHART","text":"D-Did I say “purple?” I meant a purplish blue─or a bluish purple? The two colors are really quite similar, when you think about it."},{"name":"BRIARDIEN","text":"These peppers have a most distinctive hue. No man could reasonably mistake it for <span class=\"emphasis\">any</span> shade of purple."},{"name":"BRIARDIEN","text":"...Unless, of course, he was wearing a very particular sort of eyewear at the time."},{"name":"BRIARDIEN","text":"Hah! The charade is up. After the man!"},{"name":"HILDIBRAND","text":"It is as I suspected all along─the goggles have proved the key to cracking the case! With speed, Nashu! The fiend must be brought to justice!"},{"name":"BRIARDIEN","text":"You can run, but you cannot..."},{"name":"HILDIBRAND","text":"Hah hah hah! If you thought you could outsprint this Manderville man, you were sorely mistaken!"},{"name":"HILDIBRAND","text":"For pilfering a priceless blade, threatening a maiden's virtue, and untold crimes against the law–abiding citizens of Eorzea, I, Hildibrand, agent of enquiry, inspector extraordinaire, hereby place you under arrest."},{"name":"BRIARDIEN","text":"Done in by a snipper─a fitting end for an ignoble thief. Let us see what lies behind the mask."},{"name":"LEWENHART","text":"Unghhh... Wh-Where am I...? Who...are you?"},{"name":"HILDIBRAND","text":"Hah! Playing the fool will avail you naught! I suggest you come willingly. A gentleman is not given to violence, but should you attempt to resist, I disavow responsibility for any shattered skulls and broken bones."},{"name":"LEWENHART","text":"W-Wait! I remember now! I was on my way to meet with Miss Arabella, when..."},{"name":"LEWENHART","text":"M-Miss Arabella! I must find her at once! Unggghhh, my head..."},{"name":"BRIARDIEN","text":"Hm. It would seem that <span class=\"emphasis\">this</span> man wears no mask. This is the true Lewenhart."},{"name":"LEWENHART","text":"I swear on my life that it is so! I was en route to the estate in Wineport when one of the Brass Blades on patrol approached me. We exchanged greetings, and in the next instant, he turned on me."},{"name":"LEWENHART","text":"I fought desperately to defend myself, even managing to drive a kitchen knife into the man's right hand. In the end, though, he proved too strong for me..."},{"name":"NASHUMHAKARACCA","text":"Now that you mention it, the impostor was wearing gloves! I knew there was something suspicious about him!"},{"name":"BRIARDIEN","text":"There is still time before the banquet begins. Knowing our quarry, he has doubtless already assumed a new identity."},{"name":"BRIARDIEN","text":"And yet, he could not have foreseen this turn of events. It is unlikely that he had the time to thoroughly research his new target."},{"name":"BRIARDIEN","text":"Most importantly, we now know that the thief suffered a wound to his right hand. We need simply return to Costa del Sol and examine the hands of all present."},{"name":"HILDIBRAND","text":"An excellent plan, Inspector! While you do so, we shall accompany Lewenhart back to the estate, that we might ensure Miss Arabella's safety."},{"name":"AMANYFACEDPHANTOMTHIEF","text":"(-???-)I have found you, my little ones. Let me guess─you seethe with anger at those that took from you what was yours."},{"name":"AMANYFACEDPHANTOMTHIEF","text":"(-???-)...Then it would appear our goals are in accord. Make for Costa del Sol and await my orders. When the time is right, revenge will be yours."},{"name":"AMANYFACEDPHANTOMTHIEF","text":"(-???-)The game is afoot, <span class=\"emphasis\">Inspectors</span>."},{"name":"AMANYFACEDPHANTOMTHIEF","text":"(-???-)Now, what mask shall I wear to the ball?"},{"name":"HILDIBRAND","text":"&lt;gasp&gt; Do I dream? But I must, for such beauty could not be of this world! A gentleman's heart swoons!"},{"name":"LEWENHART","text":"Miss Arabella, what are you doing out here!? You must return to the estate at once!"},{"name":"ARABELLA","text":"&lt;sigh&gt; Oh, Lewen...always the worrier. Your concern is touching, but I am a woman grown. Besides, I just wanted to see the flowers..."},{"name":"HILDIBRAND","text":"Lovely though these flowers may be, they are as unsightly weeds when measured against your beauty! I am Hildibrand, agent of enquiry, inspector extraordinaire. Please, call me Hildy!"},{"name":"ARABELLA","text":"The pleasure is mine, milord. Much have I heard of your deeds. Tell me: are these rumors of a many–faced thief true?"},{"name":"HILDIBRAND","text":"I fear they are, Miss Arabella. But still your gentle heart! For as long as Hildibrand is on the case, the fiend shall not lay a twisted finger upon you! This I swear on the Manderville name!"},{"name":"ARABELLA","text":"The gods smile on me indeed, to send such a strong and handsome gentleman as my champion! And yet... &lt;sigh&gt;"},{"name":"ELLIE","text":"You seem pensive, milady. Is something the matter?"},{"name":"ARABELLA","text":"To tell the truth, this marriage has been arranged against my wishes. I do not love Vannes. Why, I have not even met him..."},{"name":"ARABELLA","text":"He sent me this clasp as a betrothal gift. “A treasure for my treasure─wear it always,” the message said. I do not care how beautiful it is─it might as well be a golden shackle!"},{"name":"LEWENHART","text":"M-Miss Arabella! You must not say such things!"},{"name":"HILDIBRAND","text":"An arranged marriage to a youth you have not even met!? Unconscionable!"},{"name":"ARABELLA","text":"Father says that this marriage must happen, that it is for the future of the family trade."},{"name":"ELLIE","text":"Spoken like a true Ul'dahn. But if I may be bold, milady... Would I be correct in assuming that you and your father are not related by blood?"},{"name":"ARABELLA","text":"Quite so. Father found me amongst the beggars on Pearl Lane when I was just a babe. He took me in and raised me as his own. He took Lewen in as well─though as servant rather than son."},{"name":"ARABELLA","text":"You may think Father a cold and miserly man, but to me, he is the man who gave me warmth and hope where I had none. I will learn to love Vannes, if that will make Father happy."},{"name":"HILDIBRAND","text":"You cannot be serious, Miss Arabella! You are a beautiful young woman with your whole life ahead of you! Surely you would not have to look far to find a gentleman with whom you would rather spend the rest of your days!"},{"name":"ELLIE","text":"...If I have to spend another <span class=\"emphasis\">hour</span> with you, I'm like to lose my wits. But anyway, we should return to Costa del Sol and see how the inspector's investigation fares."},{"name":"ARABELLA","text":"I, as well, must prepare for the banquet. Farewell, friends."}],"reward":{"gil":855,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66975]},"next":[66977]},"partials":[{"type":"npc","id":"1009331","obj":{"i":1009331,"n":"Tiny Trader","l":33,"q":2}},{"type":"npc","id":"1009337","obj":{"i":1009337,"n":"Arabella","l":32,"q":2}},{"type":"npc","id":"1009319","obj":{"i":1009319,"n":"Lewenhart","l":32,"q":2}},{"type":"npc","id":"1009321","obj":{"i":1009321,"n":"Hildibrand","l":32,"q":2}},{"type":"npc","id":"1009335","obj":{"i":1009335,"n":"Hildibrand","l":33,"q":1}},{"type":"npc","id":"1009336","obj":{"i":1009336,"n":"Lewenhart","l":32,"q":1}},{"type":"npc","id":"1009341","obj":{"i":1009341,"n":"Hildibrand","l":32,"q":2}},{"type":"npc","id":"1009351","obj":{"i":1009351,"n":"Briardien","l":32,"q":2}},{"type":"quest","id":"66975","obj":{"i":66975,"n":"A Burst of Inspiration","g":68,"l":"Eastern La Noscea","s":10,"f":1}},{"type":"quest","id":"66977","obj":{"i":66977,"n":"A Case of Indecency","g":68,"l":"Eastern La Noscea","s":12,"f":1}}]}