{"quest":{"name":"A Burst of Inspiration","location":"Eastern La Noscea","id":66975,"patch":2.3,"sort":10,"icon":100274,"unlocksFunction":1,"eventIcon":71341,"issuer":1009326,"target":1009331,"involved":[1001023,1009319,1009323,1009324,1009325,1009327,1009328,1009330],"genre":68,"journal":["Inspector Briardien would share with you his latest findings.","Your and Ellie's plan to steer Briardien clear of the concealed explosives was for naught, as the inspector cut a straight path for that very location, hoping to speak with the two of you where the conversation might not be overheard. Lead him clear of the bombs before disaster ensues.","Ellie's attempt to lead Briardien away from the explosives has the opposite effect when the inspector responds to her shivers by offering to build a fire. A piece of driftwood conveniently left on the beach by Nashu making the process far easier than it should be, in moments Briardien stands before the crates with a flaming torch in his hand.<br><br>The ridiculously inauspicious turn of events has only begun, however, as a sudden gust of wind proceeds to carry three all-too-easily-misread pages of Nashu's journal onto the sands at Briardien's feet. Reading them and believing his life to be in imminent danger, Briardien hurls the flaming torch into the heavens in an uncharacteristic moment of panic. Ellie moves quickly, shoving the inspector out of harm's way, but placing herself into it. Always the gentleman, Hildibrand comes to the rescue of the distressed damsel by attempting to catch the torch, gloriously tripping over his own two feet in the process. The flaming torch comes hurtling down like Dalamud, just evading Hildibrand's desperate grasp before striking the ground between his hands, bouncing up, and somehow landing in perfect balance atop the Manderville man's pate.<br><br>No sooner does everyone breathe a sigh of relief than is Nashu unable to contain a sneeze, causing Hildibrand to flinch, the torch to fall, and everything in sight to be blown to the seventh hell. Miraculously, there are no casualties save for the crates of foodstuffs. Incensed at your meddling, Master Guguremu orders you to have the supplies replaced, with harsh consequences awaiting you should the feast be called off due to your high jinks.","Lewenhart explains that among the foodstuffs lost in the explosion were rare imported vegetables that could not possibly be ordered in time for the feast. Hildibrand, ever quick to act, suggests that the only logical recourse is to reclaim the initial lost shipment from the clutches of the Mandragoras, and goes one step further by boldly volunteering you for the task. Seek out a Yellowjacket by the name of Sundhimal at the Limsa Lominsa lower decks, that you might track down the lair of this band of bloodthirsty flora freedom fighters.","Sundhimal informs you that the Mandragoras were last seen commandeering a poor merchant's boat with which they absconded a haul of stolen produce, almost certainly purloined from Costa del Sol. The hapless victim set sail for Aleport a short while ago. Seek him out and inquire as to the rogue vegetables' destination.","The tiny trader recounts for you the story of his frightening encounter with the Mandragoras, which has left him a ruined man. Lend an ear to the man's tale of woe, that it might lead you in the direction of your quarry."],"objectives":["Speak with Briardien.","Speak with Lewenhart.","Speak with Sundhimal at the Limsa Lominsa lower decks.","Speak with the tiny trader in Aleport."],"dialogue":[{"name":"BRIARDIEN","text":"...So Hildibrand has managed thus far not to destroy anything. Consider me something almost resembling impressed."},{"name":"ELLIE","text":"Haha, i-indeed! But enough about Hildibrand! <span class=\"highlight\">Forename</span> and I have been waiting to hear your latest theories. We should go somewhere quiet and─"},{"name":"BRIARDIEN","text":"An excellent idea, Miss Ellie. Ah, yes─that spot just over there by the crates should suffice."},{"name":"ELLIE","text":"<span class=\"emphasis\">Th-There</span>, of all places? But surely we could find somewhere more scenic!"},{"name":"BRIARDIEN","text":"I am not here on vacation─I am here to solve a case. Besides, we cannot afford to have our conversation overheard. That junk–littered beach should afford us some welcome privacy."},{"name":"ELLIE","text":"Y-Yes, Inspector. Privacy, indeed..."},{"name":"ELLIE","text":"Bloody hells! Don't worry, <span class=\"highlight\">Forename</span>. I'll figure out some way to lead him clear of the bombs."},{"name":"ELLIE","text":"All we have to do is lure him away from these crates. That shouldn't be too difficult...r-right?"},{"name":"HILDIBRAND","text":"Worry not, my friend! Should anything threaten to put you or Miss Ellie in harm's way, Nashu and I stand at the ready!"},{"name":"ELLIE","text":"I think the tide is rising! W-We really should move to higher ground..."},{"name":"ELLIE","text":"Is it just me, or is there a bit of a chill in the air? P-Perhaps we should go someplace warm..."},{"name":"BRIARDIEN","text":"I, for one, welcome a respite from the sweltering heat. Besides, this will not take long."},{"name":"ELLIE","text":"&lt;sigh&gt; If you insist, Inspector..."},{"name":"BRIARDIEN","text":"Through the questioning of a Brass Blade attacked by our quarry, I have identified the three individuals most likely to be our thief in disguise."},{"name":"BRIARDIEN","text":"To wit: Morgant, Yalto Nolto, and Lewenhart. The three of us shall split up, with each of us keeping watch over..."},{"name":"BRIARDIEN","text":"...Ahem. Are the two of you listening?"},{"name":"ELLIE","text":"O-Of course we are! Beg pardon, Inspector."},{"name":"BRIARDIEN","text":"You look unwell, Miss Ellie. Perhaps you were right─I, too, feel a chill wind blowing in. Mayhap we should continue our conversation elsewhere..."},{"name":"BRIARDIEN","text":"...Ah, but there is no need. Wait here, and I shall build us a fire."},{"name":"HILDIBRAND","text":"Hah hah hah! Methinks the inspector has taken leave of his senses! The chance of locating suitable kindling on these barren shores is infinitesimal!"},{"name":"BRIARDIEN","text":"...Here we are. This piece of driftwood should serve perfectly. And as fortune would have it, I just happen to have a flint stone on my person."},{"name":"HILDIBRAND","text":"There is no cause for alarm! 'Tis not blood that courses through the inspector's veins, but ice! I could not fathom a series of events that would lead such a calm and composed individual to lose his firm grip on that fiery torch!"},{"name":"NASHUMHAKARACCA","text":"Remarkable insight, Inspector! I must record these words for posterity!"},{"name":"NASHUMHAKARACCA","text":"Whee! It's flying!"},{"name":"BRIARDIEN","text":"Mm? What have we here?"},{"name":"BRIARDIEN","text":"“Everything is proceeding according to my master plan”...!?"},{"name":"BRIARDIEN","text":"Could this be...? Another challenge from the fiend!?"},{"name":"ELLIE","text":"S-Surely you jest, Inspector! It looks nothing like his usual cards, see? Doubtless it's just the idle ravings of some madman!"},{"name":"BRIARDIEN","text":"Perhaps so, but we must exercise due caution. Ah, there are two more pages."},{"name":"BRIARDIEN","text":"“Give up hope. He of many faces will laugh last. It is not the lapis maiden alone that shall come to harm”...!"},{"name":"BRIARDIEN","text":"It is more direct than his previous challenges, but there can be no doubt as to the sender. But what is this talk of another victim? The final page holds the answer, no doubt."},{"name":"ELLIE","text":"The final...page...?"},{"name":"BRIARDIEN","text":"“Confounding Inspector Briardien will...meet...a...fiery...demise.”"},{"name":"BRIARDIEN","text":"Uwaaaaaah!"},{"name":"BRIARDIEN","text":"You...you saw through the fiend's ruse. But how?"},{"name":"ELLIE","text":"Er, let's just call it reporter's intuition. Are you hurt?"},{"name":"BRIARDIEN","text":"A ringing in my ears, but otherwise no worse for the wear. You...you have my gratitude."},{"name":"BRIARDIEN","text":"...Hildibrand Manderville. Were you able to learn aught of the fiend who made this ignoble attempt on my life?"},{"name":"HILDIBRAND","text":"I exhausted every effort, Inspector, yet I fear our quarry proves ever elusive!"},{"name":"BRIARDIEN","text":"...Excellent. I might have died of shock if you had. At any rate, our foe has revealed himself as no mere thief, but a madman who will resort to cold–blooded murder. We must redouble our vigilance, lest the others come to harm."},{"name":"HILDIBRAND","text":"Vigilance! Yes, vigilance is the order of the day!"},{"name":"GUGUREMU","text":"What in the name of the gods─ Thal's teeth! Those vegetables cost a fortune! And they're ruined! Ruined!"},{"name":"GUGUREMU","text":"Agent of enquiry!? More like agent of injury and incompetence! You are to replace the supplies that you destroyed before the banquet begins, or I will see the entire lot of you rot in gaol!"},{"name":"HILDIBRAND","text":"Thanks to our quick thinking, the bombs are no more and the inspector is none the wiser! 'Tis a shame to see good food go to waste, though─those coconuts looked positively luscious!"},{"name":"BRIARDIEN","text":"Clearly, our thief has decided that my prodigious intellect presents the greatest threat to his schemes. Perhaps he is a more clever man than I thought."},{"name":"NASHUMHAKARACCA","text":"Is that a fish? I'm getting hungry..."},{"name":"ELLIE","text":"I would ask how he survived an explosion at point–blank range, but something tells me that's one more mystery better left unsolved."},{"name":"LEWENHART","text":"What was that terrible explosion coming from the beach!? Is everyone safe?"},{"name":"BRIARDIEN","text":"Fear not─the fiend's artless attempt on my life has been thwarted. Sadly, your food supply did not escape unscathed. Master Guguremu bids that the damaged ingredients be replaced with all speed."},{"name":"LEWENHART","text":"G-Good gods... This is no thief─this is a madman! As for replacing the ingredients, I fear that will prove a difficult task. Those crates contained imported vegetables of considerable rarity, you see."},{"name":"LEWENHART","text":"Vegetables that are in particularly short supply these days, what with the Mandragoras at large. Even if I were to place the order immediately, it would likely take days to arrive."},{"name":"BRIARDIEN","text":"The Mandragoras...? I have heard of that fell band. Tell me: what manner of vegetables did they steal?"},{"name":"LEWENHART","text":"The rarest was an import from the Far East. I do not recall the name, but it very closely resembled the Eorzean dragon pepper─save for its color, which was a deep purple."},{"name":"HILDIBRAND","text":"Methinks you dost worry too much, Master Lewenhart! Our course of action is clear: we need only storm into the den of these overgrown weeds and steal your precious purple dragon peppers right back!"},{"name":"LEWENHART","text":"I would advise against that, Inspector. These are no ordinary mandragoras, but rather a bloodthirsty band of killers given succulent flesh! Even the Brass Blades of the Gerbera proved unable to resist them."},{"name":"HILDIBRAND","text":"Oho─a formidable foe, indeed! Were only there a brave soul in our midst with a wont for taking on fearsome enemies with not a shred of concern for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own well–being..."},{"name":"HILDIBRAND","text":"Your eyes, friend, they speak to me! They say, “I─yes, <span class=\"emphasis\">I</span>─shall vanquish these rogue vegetables and deliver the purloined goods back to their rightful owner!”"},{"name":"LEWENHART","text":"You are truly a godssend, adventurer! One Sundhimal of the Yellowjackets has been charged with defending the roads from the Mandragoras. If anyone would have knowledge of their current whereabouts, it would be him."},{"name":"LEWENHART","text":"Without those ingredients, Master Guguremu is like to cook me instead! Please, friend, you're my only hope!"},{"name":"HILDIBRAND","text":"A gentleman would never let <span class=\"alternative-container\"><span class=\"alternative\">a lady</span><span class=\"alternative\">his comrade</span></span> face danger alone. Let us away to Limsa together!"},{"name":"LEWENHART","text":"One Sundhimal of the Yellowjackets has been charged with defending the roads from the Mandragoras. If anyone had knowledge of their current whereabouts, it would be him."},{"name":"SUNDHIMAL","text":"If you've come for the Mandragoras, I fear you're half a bell too late. As were we, blast it all!"},{"name":"SUNDHIMAL","text":"To hear the poor merchant tell it, no sooner had he opened his cargo hold to check on a shipment of vegetables than did an onion turn on him, screeching bloody murder."},{"name":"SUNDHIMAL","text":"Fled his own vessel in sheer terror, he did. By the time he came to his senses, it had set sail without him."},{"name":"SUNDHIMAL","text":"The merchant left for Aleport, hoping to recoup his losses. If you've a mind to go after the culprits, you might lend an ear to his sad tale."},{"name":"HILDIBRAND","text":"(-Hildibrand-)Ahhh! Is the thrill of the chase not invigorating, friend!? The ferry docked by Fisherman's Bottom will carry us to Aleport. Let us be swiftly on our way!"},{"name":"MERCHANT01439","text":"Eeek! Don't sneak up on me like that! I thought ye were a feral turnip, a murderous eggplant, or summat like that!"},{"name":"MERCHANT01439","text":"Think I jest, do ye? Ye'd be singin' a different tune if a shot o' tomato juice almost took out yer eye, as it did mine! My eye!"},{"name":"MERCHANT01439","text":"By the time I'd regained me wits, they'd already set sail with me ship and me livelihood. I'm ruined─<span class=\"emphasis\">ruined</span>! If I never see another bleedin' onion till the end o' me days, it'll be too soon."}],"reward":{"gil":714,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66974]},"next":[66976]},"partials":[{"type":"npc","id":"1009326","obj":{"i":1009326,"n":"Briardien","l":32,"q":1}},{"type":"npc","id":"1009331","obj":{"i":1009331,"n":"Tiny Trader","l":33,"q":2}},{"type":"npc","id":"1001023","obj":{"i":1001023,"n":"Sundhimal","l":29,"q":2}},{"type":"npc","id":"1009319","obj":{"i":1009319,"n":"Lewenhart","l":32,"q":2}},{"type":"npc","id":"1009323","obj":{"i":1009323,"n":"Hildibrand","l":32,"q":2}},{"type":"npc","id":"1009324","obj":{"i":1009324,"n":"Nashu Mhakaracca","l":32,"q":2}},{"type":"npc","id":"1009325","obj":{"i":1009325,"n":"Ellie","l":32,"q":1}},{"type":"npc","id":"1009327","obj":{"i":1009327,"n":"Ellie","l":32,"q":2}},{"type":"npc","id":"1009328","obj":{"i":1009328,"n":"Briardien","l":32,"q":1}},{"type":"npc","id":"1009330","obj":{"i":1009330,"n":"Hildibrand","l":32,"q":1}},{"type":"quest","id":"66974","obj":{"i":66974,"n":"The Business of Betrothal","g":68,"l":"Western Thanalan","s":9,"f":1}},{"type":"quest","id":"66976","obj":{"i":66976,"n":"Seeds of Rebellion","g":68,"l":"Western La Noscea","s":11,"f":1}}]}