{"quest":{"name":"Desperate Times","location":"Ul'dah","id":66979,"patch":2.3,"sort":40,"eventIcon":71201,"issuer":1008623,"target":1009049,"involved":[1001484,1001605,1004576,1006359,1008700],"genre":2,"journal":["Alphinaud wishes to investigate the circumstances surrounding the riot.","Suspecting that the riot in which he was injured was not, in fact, a spontaneous outpouring of popular discontent, Alphinaud is eager to discuss the incident with General Raubahn. Follow him to the Hall of Flames and speak with the Flame General.","During your conversation with General Raubahn, Alphinaud observes that the refugees were surprisingly well armed and suggests that the riot may have been instigated by outside forces. Before he can finish his thought, however, the Flame General interjects that the restoration of order is paramount, and that any official investigation will have to wait. Undeterred, Alphinaud resolves to conduct an investigation of his own. He suggests that you begin by finding out which settlements the Flames suspect may be harboring belligerents. Perhaps Commander Swift will be willing to share such information with you.","After a moment's hesitation, Commander Swift reveals that the Brass Blades have reported suspicious activity in the vicinity of Lost Hope. Journey to the settlement in central Thanalan and investigate their claims.","Leofric and Amalberga both make mention of a traveling merchant who recently left Lost Hope accompanied by a band of refugees. Apparently, another refugee by the name of Zazawaka was especially concerned by the merchant's behavior. Speak with him to learn more.","You learn that the merchant was a fanatical revolutionary who came to Lost Hope in search of new recruits. Apparently, he offered the refugees a chance to hold the rulers of Ul'dah to account, and attracted no shortage of volunteers. Zazawaka, however, was unconvinced, and refused to go with the other refugees─a decision vindicated when one of them returned, traumatized by the slaughter he had barely escaped. Zazawaka believes there may be more survivors, and implores you to find them before the Flames do. Ask the terrified refugee if he knows where his comrades are.","The survivor mutters to himself and does not respond to your inquiries. Clearly he is still haunted by the atrocity to which he bore witness. Were you to make an effort to /soothe his suffering, he might become more cooperative.","Restored to lucidity by your soothing touch, the survivor reveals that the merchant furnished his fellows with weapons so that they might defend themselves against Ul'dahn forces, and then split them into two groups. Unfortunately for them, the survivor's group encountered an Immortal Flames patrol, who swiftly gave the refugees cause to rue their lack of training. Recalling that the other group has yet to return to Lost Hope, he begs you to seek them out and convince them to return."],"objectives":["Speak with Raubahn at the Hall of Flames.","Speak with Swift.","Speak with the Brass Blades at Lost Hope.","Speak with Zazawaka.","Speak with the terrified refugee.","/soothe the terrified refugee."],"dialogue":[{"name":"ALPHINAUD","text":"As I told you before, it was all but inevitable that an incident of this kind would eventually occur given the rising tensions within the sultanate. Nevertheless, I have reason to believe that this particular riot may not have begun spontaneously."},{"name":"ALPHINAUD","text":"Have I piqued your curiosity? Good. Then you will accompany me to the Hall of Flames. I would hear what General Raubahn has to say upon the matter."},{"name":"RAUBAHN","text":"Now is not a good time, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. My hands are full dealing with the refugees."},{"name":"ALPHINAUD","text":"Precisely the matter we wish to discuss, General."},{"name":"RAUBAHN","text":"Alphinaud... Back on your feet already?"},{"name":"ALPHINAUD","text":"You may credit my swift recovery to your chirurgeons."},{"name":"ALPHINAUD","text":"My memories of the riot are still somewhat muddled. I trust you managed to regain control of the situation?"},{"name":"RAUBAHN","text":"Not entirely. We secured the city soon enough, but not before the unrest had spread to the surrounding territories. Pockets of resistance remain throughout Thanalan."},{"name":"RAUBAHN","text":"We have sent what forces we can spare to root out the last of the belligerents, but progress is slow. They are damnably elusive."},{"name":"ALPHINAUD","text":"I can well imagine. Given that the majority of refugees live outside the walls, it stands to reason that they would know the lay of the land..."},{"name":"ALPHINAUD","text":"What I do not understand is how they came to be so well prepared. Before my little accident, I observed that several of the refugees were armed─and not with butcher's knives or pitchforks, but with martial weaponry. I need hardly add that such equipment is costly."},{"name":"ALPHINAUD","text":"None can deny that tensions between the Ul'dahn citizenry and the refugee population have increased since the Domans were turned away, but would that motivate a starving man to purchase arms in lieu of food? I think not."},{"name":"ALPHINAUD","text":"And what of those who have not even a single gil to spend, who could not survive without the aid provided by the Immortal Flames? Surely they would sooner sell a weapon than bring it to bear against their benefactors."},{"name":"RAUBAHN","text":"Come to the point."},{"name":"ALPHINAUD","text":"...Very well. My point, General, is that this powder keg of discontent was not set alight by chance. These events were <span class=\"emphasis\">deliberately</span> set in motion, and─"},{"name":"RAUBAHN","text":"<span class=\"emphasis\">And now order must be restored.</span> That is my first duty. Until it is done, any investigation can wait."},{"name":"RAUBAHN","text":"I do not have time to discuss this. My scouts will be returning anon."},{"name":"ALPHINAUD","text":"The General is no fool. He keeps his own counsel─and with good cause."},{"name":"ALPHINAUD","text":"Were he to claim, without the necessary proof, that these riots were instigated by outside forces, the Monetarists would accuse him of attempting to shirk responsibility. After all, he and the sultana have been the most outspoken proponents of refugee aid."},{"name":"ALPHINAUD","text":"Regardless, they will face harsh criticism in the days ahead..."},{"name":"ALPHINAUD","text":"Our allies may stumble upon the truth in time, but I have far more faith in your abilities, <span class=\"highlight\">Forename</span>. Therefore, I propose we conduct our own investigation, independent of the authorities."},{"name":"ALPHINAUD","text":"To that end, I would have you make inquiries in the settlements suspected of harboring belligerents. Commander Swift will know which they are. He may balk at a request for such information, but I've no doubt that you can persuade him with your silver tongue."},{"name":"ALPHINAUD","text":"I, meanwhile, shall seek answers in my own way, after which we can regroup and share our findings. Well then, shall we?"},{"name":"SWIFT","text":"You look as though you have something to say, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. Do you?"},{"name":"SWIFT","text":"What you ask is no simple favor. Were such information to fall into the wrong hands, the lives of countless soldiers would be at risk. Even so...there is wisdom in your words. An able individual─even one with ties to the Flames─may be better suited to this task than a regiment."},{"name":"SWIFT","text":"Very well. The Brass Blades have reported suspicious activity in the vicinity of Lost Hope. It may be unrelated to recent events, but we doubt it. I suggest you begin by speaking to the Blades posted there."},{"name":"SWIFT","text":"If you mean to investigate Lost Hope before <span class=\"alternative-container\"><span class=\"alternative\">our</span><span class=\"alternative\">my</span></span> comrades arrive, you had best do it quickly. Forces will be dispatched to the region as soon as the situation allows."},{"name":"AMALBERGA","text":"And what brings you here, adventurer? A search for refugees? Well, then you've come to the right place!"},{"name":"AMALBERGA","text":"Ah, you mean <span class=\"emphasis\">those</span> refugees! Oh no, you won't find them here. Most of the people of Lost Hope have come to accept their situation, and are content to pass their days in peace and quiet."},{"name":"AMALBERGA","text":"Outsiders have trouble understanding that─like that merchant who passed through recently. Gregarious fellow, but awfully opinionated. Can't say I was sad to see him go."},{"name":"AMALBERGA","text":"There's nothing to see here, adventurer. What few troublemakers we have know better than to try anything with Leofric and myself around."},{"name":"LEOFRIC","text":"<span class=\"alternative-container\"><span class=\"alternative\">A friend of the sultanate, are we?</span><span class=\"alternative\">I didn't expect them to send you, <span class=\"highlight\">Forename</span>.</span></span> I take it this means someone has read my report."},{"name":"LEOFRIC","text":"The refugees who left with the merchant have yet to return, and I am increasingly concerned that Zazawaka's suspicions were correct."},{"name":"LEOFRIC","text":"...You haven't the foggiest what I'm talking about, do you? Never mind. Speak with Zazawaka. He will explain everything."},{"name":"LEOFRIC","text":"Do not judge these people too harshly. For them, every day is a struggle. Were you in their position, can you truly say you would have done otherwise?"},{"name":"TREMBLEMAN01443","text":"B-B-Blood... So much blood..."},{"name":"ZAZAWAKA","text":"Ah! Don't hurt me! I'm not one of them!"},{"name":"ZAZAWAKA","text":"Wait, I know your face. Are you not the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> from the Church of Saint Adama Landama?"},{"name":"ZAZAWAKA","text":"A thousand pardons, my friend! I mistook you for one of the thugs who have been tormenting us."},{"name":"ZAZAWAKA","text":"I beg your pardon? <span class=\"alternative-container\"><span class=\"alternative\">You're of the Flames, but you're not <span class=\"emphasis\">with</span> the Flames?</span><span class=\"alternative\">You're not a Flame?</span></span> I see..."},{"name":"ZAZAWAKA","text":"If Leofric bid you speak with me, then I take it you've agreed to help. Twelve be praised for that, because we haven't a moment to waste. Everyone knows the Flames are on the march."},{"name":"ZAZAWAKA","text":"The others have fallen under that fanatic's spell, but not I! Promises of revolution and retribution, of holding the ruling class to account and taking that which is owed─hah! A childish fantasy."},{"name":"ZAZAWAKA","text":"I did everything I could to dissuade the others from leaving, but few would heed my words. Now that one of our idealists has returned, however, the madness of the merchant's plan is plain for all to see. Look behind yonder tent and you will understand why."},{"name":"ZAZAWAKA","text":"Even now, he babbles incoherently, so traumatized is he by the bloodshed he witnessed. Try as I might, I can make little sense of his words beyond the fact that he was not alone in surviving. Yet I've no doubt that merchant will lead the remainder to their doom. I beg of you, find them before he does!"},{"name":"ZAZAWAKA","text":"The man said naught of his surviving comrades' whereabouts─naught I could understand, at least. Mayhap you will be able to extract some sense from him. I wish you good fortune."},{"name":"TREMBLEMAN01443","text":"Wh-What are you doing? Don't...don't draw. Don't draw, don't draw, don't draw─ DON'T DRAW!"},{"name":"TREMBLEMAN01443","text":"...Why didn't you run away with me? We could've escaped together. Then you'd be here, with me─be here to <span class=\"highlight\">soothe</span> me. Why...why did you have to stay and leave me alone?"},{"name":"TREMBLEMAN01443","text":"It's not f-fair. You should be here to <span class=\"highlight\">soothe</span> me. Why didn't you listen to me?"},{"name":"TREMBLEMAN01443","text":"You didn't have to stay and fight! If you hadn't, you'd be here to <span class=\"highlight\">soothe</span> me, instead of...instead of... &lt;sob&gt;"},{"name":"TREMBLEMAN01443","text":"Wh-Who are you? What do you want!?"},{"name":"TREMBLEMAN01443","text":"Aye, it's true. I followed the merchant, and may the gods strike me down for my folly."},{"name":"TREMBLEMAN01443","text":"“What they will not give, you must take,” he said. When we asked how, he revealed a cache of weapons he had brought and implored us to “seize control of our fates.” I thought about running then and there, but the others were so excited... He split us into two groups, sent us off on our own─"},{"name":"TREMBLEMAN01443","text":"B-But when the Flames found us, we didn't know what to do! Our leader tried to parley with theirs, but then they started arguing, and then fighting, and then everyone was fighting, and the Flames were shouting to give no quarter, and─"},{"name":"TREMBLEMAN01443","text":"Oh gods, the other group! They're still out there! If we don't stop them, they'll be massacred like mine was!"}],"reward":{"gil":517,"items":[{"id":7303,"one":1},{"id":7319,"one":1},{"id":7329,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66978]},"next":[66980,69419]},"partials":[{"type":"npc","id":"1008623","obj":{"i":1008623,"n":"Alphinaud","l":40,"q":7}},{"type":"npc","id":"1009049","obj":{"i":1009049,"n":"Terrified Refugee","l":43,"q":3}},{"type":"npc","id":"1001484","obj":{"i":1001484,"n":"Amalberga","l":43,"q":2}},{"type":"npc","id":"1001605","obj":{"i":1001605,"n":"Leofric","l":43,"q":5}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1006359","obj":{"i":1006359,"n":"Zazawaka","l":43,"q":2}},{"type":"npc","id":"1008700","obj":{"i":1008700,"n":"Raubahn","l":40,"q":3}},{"type":"item","id":"7303","obj":{"i":7303,"n":"Noct Ring","l":110,"c":54520,"t":43}},{"type":"item","id":"7319","obj":{"i":7319,"n":"Gloam Ring","l":110,"c":54520,"t":43}},{"type":"item","id":"7329","obj":{"i":7329,"n":"Auroral Ring","l":110,"c":54520,"t":43}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66978","obj":{"i":66978,"n":"The Great Divide","g":2,"l":"The Rising Stones","s":39}},{"type":"quest","id":"66980","obj":{"i":66980,"n":"Shock and Awe","g":0,"l":"Central Thanalan","s":41}},{"type":"quest","id":"69419","obj":{"i":69419,"n":"Shock and Awe","g":2,"l":"Central Thanalan","s":41}}]}