{"quest":{"name":"An Ill-conceived Venture","location":"Ul'dah","id":66970,"patch":3.1,"sort":170,"unlocksFunction":1,"eventIcon":71341,"issuer":1008798,"target":1001963,"involved":[1008799],"genre":93,"journal":["Something weighs heavily on the adventurer's mind...","You have been asked to investigate the disappearance of a retainer gone afield on a so-called “venture.” Journey to Drybone in eastern Thanalan, her last known location.","You find and rescue the missing retainer from a grisly death at the hands of wild beasts, thus earning her gratitude. Rather than reward you herself, the retainer bids you return to Ul'dah and speak with her supervisor, Chachabi, in the Sapphire Avenue Exchange.","Recognizing that you are unfamiliar with the latest services provided by retainers, Chachabi explains that ventures are procurement expeditions which you may ask your retainers to undertake. She then gifts you several ventures, a unique scrip used to pay for these services. Duly informed, you may now speak with your retainers and assign them these tasks at your leisure."],"objectives":["Search Drybone for the missing retainer.","Speak with Chachabi in Ul'dah."],"dialogue":[{"name":"SYSTEM","text":"Several adventurers are having difficulty summoning their retainers. Should you wish to offer your assistance, you will find these troubled souls in Limsa Lominsa, Gridania, and Ul'dah."},{"name":"SYSTEM","text":"The rewards will be the same regardless of whom you help, so do not hesitate to aid the adventurer of your choice."},{"name":"MASTER01434","text":"Hmmm... Is this damn thing working?"},{"name":"MASTER01434","text":"Oh, hello there! Say, you look like you're an old hand when it comes to this adventuring business. Mind helping me with a situation?"},{"name":"MASTER01434","text":"I sent my retainer to Drybone the other day on a venture─hunting, to be precise. Simple enough work, right? Except now she's gone missing!"},{"name":"MASTER01434","text":"Much as I'd like to head out there and look for her, though, I know full well that I'd be feeding the buzzards before long. So, if you're willing, I'd be much obliged if you could go to eastern Thanalan in my stead."},{"name":"MASTER01434","text":"Gods, I knew I shouldn't have sent her on that venture to Drybone. She wasn't ready..."},{"name":"RETAINER01434","text":"You, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, are a saint! I thought I was done for!"},{"name":"RETAINER01434","text":"What's that look for? I take it you've never seen a retainer on a hunting venture before? It's a regular part of my duties these days!"},{"name":"RETAINER01434","text":"Though I admit I'm not very good at it..."},{"name":"RETAINER01434","text":"Oh my, is that who I think it is?"},{"name":"RETAINER01434","text":"Hello? ...Yes, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> arrived in the nick. ...I'll return at once."},{"name":"RETAINER01434","text":"I'm afraid I don't have time to stay and chat. Duty calls."},{"name":"RETAINER01434","text":"But thank you again for saving my life! I wish I could reward you somehow, but─ I know! Go and tell Chachabi, my supervisor, how you helped me!"},{"name":"RETAINER01434","text":"You can find her at the Sapphire Avenue Exchange in Ul'dah. Be sure to pay a visit!"},{"name":"CHACHABI","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Is there aught you require?"},{"name":"CHACHABI","text":"&lt;sigh&gt; I know exactly of whom you speak. This was not the first incident. Mayhap she lacks the fortitude to undertake ventures..."},{"name":"CHACHABI","text":"Oh dear, I know that look. No one has informed you of our latest services, have they?"},{"name":"CHACHABI","text":"In cooperation with the Adventurers' Guild, we have established a new system through which retainers may be dispatched to procure items for their employers."},{"name":"CHACHABI","text":"Should you wish to avail yourself of this additional service, you will need to pay your retainers in advance with ventures, which are scrip issued by the Adventurers' Guild. I gather you have none in your possession, so allow me to give you a token sum."},{"name":"CHACHABI","text":"Your retainers have received basic instruction in a variety of disciplines, but they want for experience. If you would like them to undertake anything more than the most menial of tasks, you will need to furnish them with quality equipment and give them opportunities to hone their skills.<br>So long as you bear that in mind, I should think you will not be disappointed."},{"name":"SYSTEM","text":"You may now dispatch the retainers in your employ on ventures."},{"name":"SYSTEM","text":"Summon the retainer you wish to send afield and follow the instructions to begin."},{"name":"POPMESSAGE","text":"The enemy is still about!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"}],"reward":{"gil":418,"items":[{"num":6,"id":21072}],"xp":3640},"reqs":{"jobs":[{"lvl":17,"id":1}]}},"partials":[{"type":"npc","id":"1008798","obj":{"i":1008798,"n":"Troubled Adventurer","l":40,"q":1}},{"type":"npc","id":"1001963","obj":{"i":1001963,"n":"Chachabi","l":41,"q":1,"t":"Retainer Vocate"}},{"type":"npc","id":"1008799","obj":{"i":1008799,"n":"Novice Retainer","l":44,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}}]}