{"quest":{"name":"A Sylphlands Sting","location":"East Shroud","id":66985,"patch":2.3,"sort":46,"eventIcon":71201,"target":1009100,"involved":[1000580,1009098,1009099,1009101,1009102,1009103,1009104],"genre":0,"journal":["The serpent lieutenant is eager to explain the details of your foray into the Sylphlands.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the serpent lieutenant in Little Solace.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have tended to the stricken scouts. Confront the touched sylph responsible for their suffering.","His sack of mischief seemingly misplaced, the touched sylph retreats into the forest to prepare more stinging scalebombs. Speak with Maxio at the border to the Sylphlands and plan your next move.","Maxio proudly confesses to the theft of his fellow sylph's sack of scalebombs, and suggests that you track down his touched counterpart before he can acquire more of the stinging agent. Offering to render you unseen with his magic, the Little Solace resident hands you a scalebomb with which to incapacitate the touched sylph. Speak with Maxio when you are ready to begin the hunt, and he will cast the spell of invisibility.","You signal your readiness to Maxio, and he uses his “clever trick” to turn you invisible. Track down the touched sylph and use the stolen scalebomb to give him a taste of his own medicine.<br><br>※The spell of invisibility will only last for a limited time. Find and touch the sweet-smelling wildflower to extend the duration of the enchantment.","You treat the touched sylph to an intimate encounter with one of his own stinging scalebombs, forcing your vengeful victim to flee. Report your success to Maxio.","After hearing of your success, Maxio seems confident that the touched sylph will be unable to work any more mischief for a time. Speak with the teary-eyed private, and see if he can shed any light on the whereabouts of your comrades.","Much recovered from his tearful ordeal, the private appears ready to explain the fate of your fellow Scions..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the serpent lieutenant in Little Solace.</span>"],"dialogue":[{"name":"LIEUTENANT01448","text":"Ready, are you? Then allow me to explain the finer details of this foray into the Sylphlands."},{"name":"LIEUTENANT01448","text":"In order that you might treat with the Lord of Levin, we must first learn where the primal is to be found."},{"name":"LIEUTENANT01448","text":"Though we are certain Ramuh was summoned somewhere within the territory of the touched sylphs, his precise whereabouts yet elude us. And aimlessly thrashing around in the undergrowth will only lead to unnecessary conflict."},{"name":"LIEUTENANT01448","text":"We are fortunate, then, to have the expertise of the Scions of the Seventh Dawn at our disposal."},{"name":"LIEUTENANT01448","text":"Mistress Yda and her companions will make use of their Sharlayan devices to measure recent aetheric activity. They assure me that the disturbance caused by the summoning of a primal shall prove a most obvious beacon."},{"name":"LIEUTENANT01448","text":"But we must not get ahead of ourselves. Your first objective will be to join up with your fellow Scions. Time being of the essence, they have already entered the Sylphlands. Fear not, however─they have a Twin Adder escort and a sylph guide for com─"},{"name":"MAXIO","text":"Help! This one needs help!"},{"name":"LIEUTENANT01448","text":"The guide... What has become of our companions!?"},{"name":"MAXIO","text":"These ones were ambushed at the border of touched ones' territory! Touched one tossed a stinging scalebomb, and arrow-shooting ones were left coughing and crying!"},{"name":"LIEUTENANT01448","text":"What of the Scions?"},{"name":"MAXIO","text":"Arrow-shooting ones were in the lead, and took the worst of the stinging. Other walking ones scattered this way and that to escape the same fate..."},{"name":"LIEUTENANT01448","text":"Barely two steps into the Sylphlands and we have already lost our charges! But it will profit us little to go running after them until we know exactly what we're facing. Let us first tend to the scouts and assess the situation."},{"name":"KOMUXIO","text":"This one has cleansing water for walking ones! Splash it over arrow-shooting ones, and rinse away the stinging scales from eyes and nose and mouth."},{"name":"LIEUTENANT01448","text":"My thanks. I will leave this task in <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>'s capable hands."},{"name":"LIEUTENANT01448","text":"'Tis hardly an auspicious beginning, but I must ask that you adhere to the plan, and rendezvous with your fellow Scions."},{"name":"LIEUTENANT01448","text":"If you can get the scouts back on their feet, they may be able to point you towards your companions.<br>Oh, and be on your guard. If this operation is to succeed, we can ill afford any further mishaps."},{"name":"MAXIO","text":"Coughing and crying ones are not far. This one will show walking one the way!"},{"name":"MAXIO","text":"Arrow-shooting ones are just over there!"},{"name":"TEMPEREDSYLPH01449","text":"Hah! Walking ones suffer for trespassing in these ones' domain!"},{"name":"KOMUXIO","text":"Walking one must take cleansing water and rinse the scales away from coughing and crying ones!"},{"name":"MODAE01449","text":"&lt;gasp&gt; &lt;splutter&gt; Oh! Oh, that's so much better!"},{"name":"SEKI01449","text":"&lt;cough&gt; Thank─ &lt;wheeze&gt; Thank you! A sylph...threw some manner of powder..."},{"name":"NAMIDA01449","text":"Ah! Praise Nophica! I thought to claw my own eyes from my skull! Does that bastard sylph yet linger? I can still barely see..."},{"name":"MODAE01449","text":"Please, I─ &lt;wheeze&gt; Just a moment longer..."},{"name":"SEKI01449","text":"&lt;cough&gt; &lt;cough&gt; 'Twas akin to swallowing a dragon pepper whole..."},{"name":"NAMIDA01449","text":"I cannot see for the tears... But that touched sylph must be dealt with!"},{"name":"TEMPEREDSYLPH01449","text":"Another walking one? Hah! This one shall not falter! This one carries an entire sack of─"},{"name":"TEMPEREDSYLPH01449","text":"Hm? This one's sack of scalebombs! It is <span class=\"emphasis\">gone</span>!"},{"name":"TEMPEREDSYLPH01449","text":"N-No matter! This one will fetch more, and then new walking one will suffer as well!"},{"name":"MAXIO","text":"Hee hee! This one stole touched one's sack while touched one was gloating over coughing ones."},{"name":"MAXIO","text":"But this one's clever trick will mean naught if touched one fetches more scalebombs. Walking one must act fast!"},{"name":"MAXIO","text":"This one will use another clever trick to help walking one move unseen. Walking one must sneak up on touched one before this one's trick wears off."},{"name":"MAXIO","text":"Take this scalebomb, and give touched one a taste of touched one's own medicine!"},{"name":"MAXIO","text":"Is walking one ready? This one is eager to make mischief for touched one."},{"name":"MAXIO","text":"Hold still! Walking one will soon be there but not there─just like the wind!"},{"name":"SYSTEM","text":"Maxio's magic will render you invisible. Find the touched sylph and surprise him with the stinging scalebomb before the enchantment fades."},{"name":"SYSTEM","text":"The invisibility spell will last for thirty-five seconds. If you run out of time before achieving the objective, return to Maxio and ask him to refresh the enchantment."},{"name":"SYSTEM","text":"While the invisibility spell is in effect, you can extend its duration by touching the sweet-smelling wildflower found along the way."},{"name":"MAXIO","text":"This one knows how exciting the forest can be, but walking one should try not to become distracted. Let this one weave the clever trick once more..."},{"name":"TEMPEREDSYLPH01449","text":"Ah! The walking one! Hold still while this one prepares walking one's stinging punishment!"},{"name":"MODAE01449","text":"We must... &lt;wheeze&gt; We must regroup and press...on? I could've sworn there was someone..."},{"name":"SEKI01449","text":"Hm? There are eyes upon us! I sense it! &lt;cough&gt;"},{"name":"NAMIDA01449","text":"Who is it!? Who's there!? Blast these stinging tears!"},{"name":"TEMPEREDSYLPH01449","text":"Ow-ow-ow-ow! This one's leaves smart and prickle! But this one was being so careful with the scales!"},{"name":"MAXIO","text":"Did walking one give touched one a stinging surprise? Hee hee hee! Touched one will not bother these ones for a time, this one thinks."},{"name":"MAXIO","text":"And coughing and crying ones seem much better. Perhaps arrow-shooting ones are ready to talk with walking one now."},{"name":"MAXIO","text":"Coughing and crying ones seem much recovered. Will walking one speak with arrow-shooting ones now?"},{"name":"MODAE01449","text":"The sylphs win this round, but I shall be prepared the next time they attempt this trick!"},{"name":"SEKI01449","text":"&lt;cough&gt; 'Tis naught but a tickle in my throat now. I am ready to continue."},{"name":"NAMIDA01449","text":"I can finally see again! Your aid is most appreciated. You are <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span> of the Scions</span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, yes?"},{"name":"NAMIDA01449","text":"Then you will doubtless be eager to know what became of your fellows..."},{"name":"RECOVER","text":"The fading enchantment has been refreshed!"},{"name":"SYSTEM","text":"The enchantment has already faded. Return to Maxio and ask him to cast the invisibility spell again"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66984]},"next":[66986]},"partials":[{"type":"npc","id":"1009100","obj":{"i":1009100,"n":"Teary-eyed Private","l":55,"q":1}},{"type":"npc","id":"1000580","obj":{"i":1000580,"n":"Komuxio","l":55,"q":10}},{"type":"npc","id":"1009098","obj":{"i":1009098,"n":"Maxio","l":55,"q":1}},{"type":"npc","id":"1009099","obj":{"i":1009099,"n":"Maxio","l":55,"q":2}},{"type":"npc","id":"1009101","obj":{"i":1009101,"n":"Suffocating Private","l":55,"q":2}},{"type":"npc","id":"1009102","obj":{"i":1009102,"n":"Wheezing Private","l":55,"q":2}},{"type":"npc","id":"1009103","obj":{"i":1009103,"n":"Hostile Sylph","l":55,"q":1}},{"type":"npc","id":"1009104","obj":{"i":1009104,"n":"Hostile Sylph","l":55,"q":1}},{"type":"quest","id":"66984","obj":{"i":66984,"n":"Lord of Levin","g":2,"l":"The Rising Stones","s":45}},{"type":"quest","id":"66986","obj":{"i":66986,"n":"Scattered Scions","g":0,"l":"East Shroud","s":47}}]}