{"quest":{"name":"Reap the Whirlwind","location":"Ul'dah","id":66981,"patch":2.3,"sort":42,"eventIcon":71201,"target":1004576,"involved":[1001657,1009056,1009175],"genre":0,"journal":["Swift is determined to stop the rabble-rousing merchant from sowing further sedition.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the terrified refugee in Lost Hope.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","It would seem that word has spread of the drubbing you dealt the refugees of Lost Hope... Unsurprisingly, Landebert has no intention of listening to your side of the story, nor less of helping you. Yet in a curious twist of fate, your quarry chooses that exact moment to return to Pearl Lane, presumably hoping to recruit more refugees. As your eyes meet, the merchant grasps the situation and turns to flee. Do not let him escape!","As one would expect, the merchant is quick to deny your accusations, and equally quick to confess when pressed. He offers to divulge all that he knows, only to fall at your feet a moment later, an arrow having pierced his chest. The commotion draws the attention of two Stone Torches, one of whom would like to know why you are standing next to a dead man.","You explain to the Stone Torch that the merchant was felled by an arrow from afar, and that he was the subject of your investigation into the refugee uprisings. Satisfied with your statement, the Stone Torch bids you carry on with your work. Return to the Hall of Flames and report your findings to Commander Swift.","Swift concludes that the merchant was murdered to protect the identity of his employer. Despite this setback, he seems confident that the identity of the uprising's true orchestrator will soon be revealed."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the terrified refugee in Lost Hope.</span>"],"dialogue":[{"name":"SWIFT","text":"This merchant has not only publicly incited sedition within the sultanate, but gone so far as to provide materiel support to would-be belligerents. It galls me that his role in the uprising should have escaped our notice for so long. Yet I can well imagine why it did. Rightly or wrongly, those with whom he consorts do not trust us."},{"name":"SWIFT","text":"Alas, trust is not easily gained, even in times of peace. We must nevertheless try, for I believe it is only with the cooperation of the refugees that we will catch our quarry. And so I would have you to continue your investigation in Pearl Lane."},{"name":"SWIFT","text":"We know that the merchant sought to recruit the people of Lost Hope and Stonesthrow, so it seems reasonable to assume that he may have approached the residents of Pearl Lane as well. After all, the first riots occurred within the city itself."},{"name":"SWIFT","text":"Most, if not all, will refuse to discuss this subject with you, but there is one who may be willing to do so: a man named Landebert. He too has his misgivings about us, but I believe he understands that these riots do little to further his people's cause."},{"name":"SWIFT","text":"Landebert will not let us down, I think. He is well aware of the precariousness of his compatriots' position within the sultanate. Should he happen to forget, of course, you have my permission to remind him."},{"name":"LANDEBERT","text":"First comes a man with the promise of deliverance. Seen your suffering firsthand and will bear it no longer, says he. Your friend, your ally, your comrade-in-arms─take his hand, and he will guide you to a better tomorrow."},{"name":"LANDEBERT","text":"Then comes a soldier with the promise of justice. Follow the man who came before at your peril, says <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>, for they who sow the wind shall reap the whirlwind."},{"name":"LANDEBERT","text":"The man's no saint; any fool can see that. We're but tools for his task, to be used and discarded. As for this <span class=\"emphasis\">soldier</span>, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> thinks only of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> mission. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s more honest than the man, but every bit as ruthless, make no mistake."},{"name":"LANDEBERT","text":"With whom shall I cast my lot? Neither, says I. Far as I'm concerned, you're no better than the bastard you pursue."},{"name":"LANDEBERT","text":"Now the soldier is thinking how else <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> might get what <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> wants. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s tried the diplomatic approach and failed; mayhap a <span class=\"emphasis\">firmer</span> hand is needed."},{"name":"LANDEBERT","text":"Mayhap <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> needs to make an example out of this Ala Mhigan scum like <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did those five fools from Lost Hope!"},{"name":"LANDEBERT","text":"Well you'll get no justification from me, soldier, if that's what you're waiting for. I'll not raise a hand against you."},{"name":"LANDEBERT","text":"But neither will I lend a hand to help you."},{"name":"LANDEBERT","text":"...Not that it makes any difference. Pah! The gods seem bent on granting your every bloody wish."},{"name":"MERCHANT01445","text":"There you are, Landebert! Have you given any thought to my proposal?"},{"name":"MERCHANT01445","text":"<span class=\"emphasis\">You</span>! I... I..."},{"name":"LANDEBERT","text":"There he goes, towards the Gate of Thal! Go and claim your prize for coin and country!"},{"name":"LANDEBERT","text":"Didn't you want justice for Ul'dah? Why are you still here and not scouring central Thanalan? Keen to teach me a lesson before you go?"},{"name":"SWIFT","text":"You found him!? Then why is he not here!? Stop wasting valuable time and go to central Thanalan!"},{"name":"MERCHANT01445","text":"You again!? Wh-Why are you pursuing me!?"},{"name":"MERCHANT01445","text":"Sedition!? Treason!? <span class=\"emphasis\">Revolution</span>!? Th-That's preposterous!"},{"name":"MERCHANT01445","text":"Who has filled your head with these lies? Refugees? The selfsame refugees who terrorized the streets of Ul'dah? Hah!"},{"name":"MERCHANT01445","text":"You have no evidence to prove your accusations! <span class=\"emphasis\">None</span>!"},{"name":"MERCHANT01445","text":"N-No, I will <span class=\"emphasis\">not</span> accompany you to the Hall of Flames. You have no right to detain me..."},{"name":"MERCHANT01445","text":"F-F-For the sake of argument, let us say I <span class=\"emphasis\">did</span> do the things you claim. Surely you don't think I give a Qiqirn's arse about politics? It was business─<span class=\"emphasis\">only</span> business."},{"name":"MERCHANT01445","text":"We both know I am not the one you want. However, if you agree to protect me, I swear I shall tell you everything."},{"name":"GUARD01445","text":"What's all this commotion!?"},{"name":"GUARD01445","text":"Seven hells..."},{"name":"GUARD01445","text":"Tell the others to spread out and search the area. The killer may still be close."},{"name":"GUARDLEADER01445","text":"Hold, adventurer. I would know more about your relationship with the victim, as well as the events leading up to his death."},{"name":"GUARDLEADER01445","text":"This man was responsible for the recent riots? Mayhap we owe his murderer a debt of gratitude."},{"name":"GUARDLEADER01445","text":"In any case, it is obvious you are not the one whom we seek. You may carry on with your investigation, Scion."},{"name":"GUARDLEADER01445","text":"If that arrow was shot from where you indicated, the archer must have a good eye...and a better arm."},{"name":"SWIFT","text":"What news, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>? Where is the merchant?"},{"name":"SWIFT","text":"<span class=\"emphasis\">Murdered</span>!? Damn it all to the seventh hell!"},{"name":"SWIFT","text":"He was not simply murdered, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>─he was <span class=\"emphasis\">silenced</span>. Too many knew his face, and he was ready to divulge his secrets."},{"name":"SWIFT","text":"Do not despair, though. We may be closer to identifying the true orchestrator of these riots than you realize."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66980]}},"partials":[{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1001657","obj":{"i":1001657,"n":"Landebert","l":41,"q":5}},{"type":"npc","id":"1009056","obj":{"i":1009056,"n":"Mistrustful Merchant","l":43,"q":1}},{"type":"npc","id":"1009175","obj":{"i":1009175,"n":"Stone Torch","l":43,"q":1}},{"type":"quest","id":"66980","obj":{"i":66980,"n":"Shock and Awe","g":0,"l":"Central Thanalan","s":41}}]}