{"quest":{"name":"True to Form","location":"East Shroud","id":66987,"patch":2.3,"sort":48,"eventIcon":71201,"target":1009119,"involved":[1009106,1009116,1009117,1009118,1009120,1009121,1009122,1009123],"genre":0,"journal":["Yda is eager to rejoin the other Scions.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the serpent lieutenant in Little Solace.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You finally locate Papalymo, only to find him accompanied by not one, but two Y'shtolas. Confer with Maxio, and devise a strategy to reveal which of the Scions are real and which are impostors.","Maxio suggests that you attempt to unmask any potential impostors all at once. Toss a trueform scalebomb at the suspect Scions, and reveal their true identities.","Maxio's handy gift explodes in a cloud of choking dust, revealing one of the two Y'shtolas to be a skin-changed sylph. Confront the trickster, and show him the error of his ways.","You have defeated the touched sylph's boar ally. It is time to confront the sylvan trickster himself.","Though he has apologized for his mischief, the touched sylph is nevertheless determined to convince you of Lord Ramuh's absence. Return to Papalymo and discuss the obvious deceit.","Based on your tiny antagonist's dubious claims to the contrary and his own aetheric measurements, Papalymo believes he has pinpointed the spot where Lord Ramuh was summoned. Your audience with the Lord of Levin looms ever closer..."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the serpent lieutenant in Little Solace.</span>"],"dialogue":[{"name":"MAXIO","text":"Coughing one is true wise one! Walking one may want to apologize..."},{"name":"YDA","text":"I may not know where Thancred is, but I've got a pretty good idea where Papalymo and Y'shtola will be. They were with me just now."},{"name":"YDA","text":"Y'shtola suggested we split up to cover more ground, and took Papalymo with her. Oh no... Do you think one of them might have been a sylph in disguise as well!?"},{"name":"YDA","text":"We should probably be after them just in case. Come on! They were headed somewhere to the south!"},{"name":"YDA","text":"Ah... Well, I don't fancy making the wrong choice here. I'll let you do the honors!"},{"name":"MAXIO","text":"This one cannot tell the difference between them!"},{"name":"DUMMYYSHTOLA01451","text":"Trust not a word spoken here..."},{"name":"YSHTOLA","text":"&lt;sigh&gt; This is farcical..."},{"name":"PAPALYMO","text":"Thank the Twelve! You've found us at last! Wait. I see Yda, but where is...? &lt;gasp&gt; More impostors! Do not attempt to deceive me, sylph! I see what you are!"},{"name":"PAPALYMO","text":"...But if, by some faint chance, you truly <span class=\"emphasis\">are</span> my good friend <span class=\"highlight\">Forename</span>, mayhap you would consult Maxio over there─if Maxio he truly is─on the subject of how to dispel these infernal sylvan enchantments."},{"name":"PAPALYMO","text":"Caught between a rock and a hard place... Ack! Why did it have to be two Y'shtolas!? I should have been perfectly happy to give any number of Ydas an experimental smack..."},{"name":"MAXIO","text":"Hmmm... This one suggests hitting three wise ones with one stone!"},{"name":"MAXIO","text":"If wise ones suspect walking one is actually skin-changing one, walking one is not likely to get a second opportunity to throw a scalebomb in wise ones' presence. So walking one must aim carefully so that all wise ones are caught in the same scalebomb's boom!"},{"name":"MAXIO","text":"Walking one should throw a scalebomb so it hits all the wise ones! Blow away walking one's doubts all at once!"},{"name":"YSHTOLA","text":"&lt;cough&gt; &lt;splutter&gt; Was that truly necessary?"},{"name":"YDA","text":"Look! That one's the sylph!"},{"name":"DUMMYYSHTOLA01451","text":"&lt;cough&gt; This one's trick has failed! But w-walking ones have not won yet!"},{"name":"DUMMYYSHTOLA01451","text":"This one will not allow walking ones to pass! C-Come any closer, and this one's friends will be angry!"},{"name":"PAPALYMO","text":"So the little rascal means to stand his ground, does he? How very courageous. Would you do the honors, <span class=\"highlight\">Forename</span>?"},{"name":"THANCRED","text":"Greetings! I see you've all found each other. 'Twould seem I was a mite overzealous in my attempts to evade our sylvan ambushers. I was a malm away by the time I realized I was alone."},{"name":"THANCRED","text":"...Is aught amiss? Do I have something on my face?"},{"name":"PAPALYMO","text":"Hmm...<span class=\"emphasis\">reasonably</span> convincing. But one cannot be too careful! Remind me, Thancred: what was the reason for our little excursion into the Sylphlands?"},{"name":"THANCRED","text":"Did you take a tumble and bump your head, old friend? We're here to locate the site of the summoning so that <span class=\"highlight\">Forename</span> might parley with Lord Ramuh."},{"name":"YDA","text":"Hmm... Too easy... A-HA! Why don't you tell us what you think of <span class=\"emphasis\">F'lhaminn</span>?"},{"name":"THANCRED","text":"...Truly? You would have me speak of the Songstress of Ul'dah? As you will. She is as an exquisite rose that withers not with the passing of years─"},{"name":"YSHTOLA","text":"Charming as ever. I daresay you are perpetually beset upon all sides by swooning beauties...?"},{"name":"THANCRED","text":"Please, Y'shtola─I do not seek to make them swoon. Poetry rises unbidden to my lips when I behold a maiden's fair countenance. 'Tis the curse of my minstrel blood."},{"name":"YSHTOLA","text":"Enough. If this is not the real Thancred, then I believe we have found a suitable replacement."},{"name":"PAPALYMO","text":"Indeed.<br>Well, that seems like quite enough entertainment for one day. 'Tis past time we returned to the task at hand."},{"name":"PAPALYMO","text":"<span class=\"highlight\">Forename</span>, would you mind approaching our touched friend? If I'm not very much mistaken, his decision to stand his ground stems from something more than mere bravery."},{"name":"THANCRED","text":"What did she mean, “the <span class=\"emphasis\">real</span> Thancred”? And what's this about replacing me? Hmph! This must be how Yda feels most of the time..."},{"name":"YDA","text":"Sooo...Thancred is Thancred, Papalymo is Papalymo, Y'shtola is Y'shtola, and you are you, right? Well, that's easy enough to remember. This one's name is Yda, in case walking one was wondering.<br>...JOKE! I'm joking! Don't you DARE scalebomb me again!"},{"name":"PAPALYMO","text":"<span class=\"highlight\">Forename</span>, you must needs confront that touched sylph. He's plainly attempting to keep us from something important..."},{"name":"YSHTOLA","text":"I would have words with my diminutive impersonator on the finer details of his portrayal...but the mission must take precedence. Mayhap 'tis best that you approach him alone."},{"name":"MAXIO","text":"Touched one has many dangerous ones as friends. Walking one must be very careful!"},{"name":"DUMMYYSHTOLA01451","text":"This one warned walking ones to stay away!"},{"name":"DUMMYYSHTOLA01451","text":"&lt;gasp&gt; Walking one is too strong! This one surrenders. This one is sorry for playing tricks on wise ones."},{"name":"DUMMYYSHTOLA01451","text":"But great and powerful one, Lord Ramuh, is not here! So there is no need for wise ones to go any further. No, no─no need at all. Wise ones <span class=\"emphasis\">definitely must not go any further</span>. This one would not want wise ones to get lost."},{"name":"YSHTOLA","text":"Hmph. Well, at least the sylph offered some manner of apology for his mischief. But more importantly, his insistence that we proceed no further seems rather revealing, does it not?"},{"name":"MAXIO","text":"Is walking one unharmed? This one would not like to see walking one in pain."},{"name":"PAPALYMO","text":"We overheard your exchange with our tormentor. His clumsy attempt at deceit would almost be endearing if time were not of the essence."},{"name":"PAPALYMO","text":"Happily, I managed to take a reading of the surrounding area while you had his attention. As I suspected, the site of the Lord of Levin's summoning is very close indeed!"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POP","text":"（★未使用／削除予定★）"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66986]},"next":[66988]},"partials":[{"type":"npc","id":"1009119","obj":{"i":1009119,"n":"Papalymo","l":55,"q":1}},{"type":"npc","id":"1009106","obj":{"i":1009106,"n":"Maxio","l":55,"q":2}},{"type":"npc","id":"1009116","obj":{"i":1009116,"n":"Yda","l":55,"q":3}},{"type":"npc","id":"1009117","obj":{"i":1009117,"n":"Maxio","l":55,"q":2}},{"type":"npc","id":"1009118","obj":{"i":1009118,"n":"Papalymo","l":55,"q":1}},{"type":"npc","id":"1009120","obj":{"i":1009120,"n":"Thancred","l":55,"q":2}},{"type":"npc","id":"1009121","obj":{"i":1009121,"n":"Y'shtola","l":55,"q":2}},{"type":"npc","id":"1009122","obj":{"i":1009122,"n":"Y'shtola","l":55,"q":1}},{"type":"npc","id":"1009123","obj":{"i":1009123,"n":"Hostile Sylph","l":55,"q":1}},{"type":"quest","id":"66986","obj":{"i":66986,"n":"Scattered Scions","g":0,"l":"East Shroud","s":47}},{"type":"quest","id":"66988","obj":{"i":66988,"n":"Levin an Impression","g":0,"l":"East Shroud","s":49}}]}