{"quest":{"name":"Revolution","location":"Ul'dah","id":66982,"patch":2.3,"sort":43,"icon":100251,"eventIcon":71201,"issuer":1004576,"target":1001821,"involved":[1009057],"genre":2,"journal":["Swift has a message for you from General Raubahn.","General Raubahn has summoned you to a private meeting in the Fragrant Chamber, at which he wishes to discuss the results of your investigation, as well as his own. Alphinaud has already been notified, and will be waiting for you outside. Proceed to the Royal Promenade and speak with Bartholomew.","There are men and women who will not scruple to set the world ablaze in the pursuit of power. Teledji Adeledji is one such man, having orchestrated the refugee uprising from the start. General Raubahn and the sultana believe that he intends to exploit the chaos in order to gain control of the Carteneau Flats, in which an Allagan creation not unlike the Ultima Weapon has been discovered. Were someone to harness the power of this relic, they would have the strength to subjugate all of Eorzea─or so it is feared. Yet despite having learned of Teledji Adeledji's schemes, it would seem that your allies are not yet ready to move against him..."],"objectives":["Speak with Bartholomew on the Royal Promenade."],"dialogue":[{"name":"SWIFT","text":"The Flame General left word that you were to proceed to the Fragrant Chamber as soon as you returned. He wishes to discuss your recent discoveries, as well as the results of our own investigation."},{"name":"SWIFT","text":"Master Alphinaud has already been informed and should be waiting for you outside. Pray proceed to the Royal Promenade with all haste and speak with Bartholomew."},{"name":"SWIFT","text":"The sultana will be in attendance as well. Pray do not keep Her Grace waiting."},{"name":"ALPHINAUD","text":"Excellent work, <span class=\"highlight\">Forename</span>. The information you brought us helped me persuade General Raubahn to call this meeting. Mayhap now we can discuss matters openly and honestly."},{"name":"BARTHOLOMEW","text":"We have been expecting you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Please proceed inside."}],"reward":{"items":[{"id":7338,"one":1},{"id":7348,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69420]},"next":[66983]},"partials":[{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1009057","obj":{"i":1009057,"n":"Alphinaud","l":41,"q":3}},{"type":"item","id":"7338","obj":{"i":7338,"n":"Daystar Necklace","l":110,"c":54885,"t":40}},{"type":"item","id":"7348","obj":{"i":7348,"n":"Evenstar Necklace","l":110,"c":54885,"t":40}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69420","obj":{"i":69420,"n":"Reap the Whirlwind","g":2,"l":"Central Thanalan","s":42}},{"type":"quest","id":"66983","obj":{"i":66983,"n":"Stories We Tell","g":2,"l":"Ul'dah","s":44}}]}