{"quest":{"name":"Shock and Awe","location":"Central Thanalan","id":66980,"patch":2.3,"sort":41,"eventIcon":71201,"target":1004576,"involved":[1009050,1009055],"genre":0,"journal":["The terrified refugee would have you find his brethren and convince them to lay down their arms.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the terrified refugee in Lost Hope.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","Though you came to make an example of the twins, the refugees refuse to stand aside. Only after you subdue five of their number do the sellswords appear. Fortunately, their defeat seems to have had the desired effect. Speak with the desperate refugee, and confirm that he has taken your lesson to heart.","The refugee falls to his knees in despair, his will to fight broken. Inform the survivor in Lost Hope of all that has transpired.","Though saddened to learn that his comrades forced your hand, the survivor is grateful for your intervention. He is, however, concerned that the merchant will attempt to recruit more desperate refugees, perpetuating the bloodshed. Recalling that the merchant wished to approach the people of Stonesthrow, the survivor bids you continue your search there.","You find yourself drawn to a sobbing child, who tells you of a man who visited Stonesthrow and persuaded a number of people, including her parents, to leave with him. The child's account strongly suggests that it was the selfsame merchant who visited Lost Hope, but it offers no clue as to his current whereabouts. Return to the Hall of Flames in Ul'dah and share your findings with Commander Swift.","Commander Swift is full glad to hear that you convinced the refugees of Lost Hope to lay down their arms. That joy soon gives way to anger as you share the revelation that a single merchant has influenced recent events so greatly. The high flame commander declares that the merchant must be apprehended at once; doubtless he desires your help in this endeavor."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to the terrified refugee in Lost Hope.</span>"],"dialogue":[{"name":"TREMBLEMAN01443","text":"The other refugees are hiding in the caves south of Lost Hope, but to approach them would be fruitless. They would sooner call us agents of the sultanate and try to kill us than listen to reason. Why, the twins might even deign to do the deed themselves."},{"name":"TREMBLEMAN01443","text":"A pox on all bloody sellswords! They were supposed to train us to fight, but the ones he sent with us vanished during the struggle."},{"name":"TREMBLEMAN01443","text":"Oh, if only we had never listened to that merchant's ridiculous claims! He said our cause was righteous, that the gods would never suffer us to be defeated─"},{"name":"TREMBLEMAN01443","text":"Though, if they were forced to confront reality... That's it! Challenge the twins to combat and show my brethren that their strongest warriors are no match for one <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Mayhap <span class=\"emphasis\">then</span> they will agree to lay down their arms and renounce this plot!"},{"name":"TREMBLEMAN01443","text":"Hurt the twins if you must, but pray do your utmost not to harm the others."},{"name":"REFUGEE01444","text":"Seven hells, they've found us! Everyone, grab yer gear and make for the rendezvous point!"},{"name":"REFUGEE01444","text":"...So that's yer game, is it? Ahahaha! Sorry to disappoint ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, but we're more than willin' to kill ye ourselves!"},{"name":"REFUGEE01444","text":"Ye beat 'em like it was nothin'! Thal almighty, what are we gonna do now...?"},{"name":"REFUGEE01444","text":"We yield, all right!? We yield! That's what ye wanted, ain't it!? So go away and leave us be!"},{"name":"TREMBLEMAN01443","text":"You've returned! Did you find my brethren? What of the twins? What happened!?"},{"name":"TREMBLEMAN01443","text":"I see... Well...you had no choice. Better that a handful of them take a beating from you than the lot get butchered by the Flames."},{"name":"TREMBLEMAN01443","text":"Tell me, what did the merchant have to say when it was over?"},{"name":"TREMBLEMAN01443","text":"Huh? But where else would he be? Unless... Unless he went to Stonesthrow to recruit others?"},{"name":"TREMBLEMAN01443","text":"As I recall, he wished to approach the refugees there as well, but was waiting until the Flames withdrew their forces from the vicinity. And now that they have, there's nothing to stop him from continuing his work."},{"name":"TREMBLEMAN01443","text":"How many more must perish in pursuit of this futile cause? How much more suffering must we endure before it ends?"},{"name":"TREMBLEMAN01443","text":"Find him. Convince him to cease his mad quest. It will surely lead us to ruin."},{"name":"ELE","text":"&lt;sniffle&gt; Have... Have you seen my parents?"},{"name":"ELE","text":"They told me to stay here with the others. &lt;sniffle&gt; They said they'd be back soon, but it's been days..."},{"name":"ELE","text":"They left with the man from Ul'dah. The man said they were gonna change everything─make it so we could live inside the walls with everyone else. I liked it when he said that."},{"name":"ELE","text":"I didn't like it when he talked about making the rich people pay. Everyone looked so angry, and I got scared..."},{"name":"ELE","text":"Lots of people left with the man after that, but no one's come back... &lt;sniffle&gt; &lt;sob&gt;"},{"name":"ELE","text":"Mother... Father... &lt;sniffle&gt; &lt;sob&gt;"},{"name":"SWIFT","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. Have you learned aught of interest?"},{"name":"SWIFT","text":"You persuaded a gang of refugees to lay down their arms? The Flame General will be pleased to learn of this!"},{"name":"SWIFT","text":"Less so, these other revelations. We must apprehend this treasonous snake at once!"},{"name":"POPMESSAGE","text":"A chorus of cries echoes throughout the cavern..."},{"name":"BALLOON","text":"Help me, dammit!"},{"name":"BALLOON","text":"You should never have come here!"},{"name":"BALLOON","text":"W-We can take <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"BALLOON","text":"I c-can't do this alone!"},{"name":"BALLOON","text":"Do yer worst!"},{"name":"BALLOON","text":"&lt;huff&gt; &lt;puff&gt;"},{"name":"BALLOON","text":"You won't stop us!<br>You <span class=\"emphasis\">can't</span> stop us!"},{"name":"BALLOON","text":"Ho, a challenge!"},{"name":"BALLOON","text":"It's been too long!"},{"name":"BALLOON","text":"Meddlesome wretch!"},{"name":"BALLOON","text":"<span class=\"alternative-container\"><span class=\"alternative\">Bitch</span><span class=\"alternative\">Bastard</span></span>!"},{"name":"BALLOON","text":"Enough!"},{"name":"BALLOON","text":"No, NO!"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66979]},"next":[66981]},"partials":[{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1009050","obj":{"i":1009050,"n":"Desperate Refugee","l":43,"q":1}},{"type":"npc","id":"1009055","obj":{"i":1009055,"n":"Ele","l":43,"q":1}},{"type":"quest","id":"66979","obj":{"i":66979,"n":"Desperate Times","g":2,"l":"Ul'dah","s":40}},{"type":"quest","id":"66981","obj":{"i":66981,"n":"Reap the Whirlwind","g":0,"l":"Ul'dah","s":42}}]}