{"quest":{"name":"A Hard Hapalit to Break","location":"The Rising Stones","id":66990,"patch":2.3,"sort":51,"eventIcon":71201,"target":1006530,"involved":[1009076],"genre":0,"journal":["Minfilia has some correspondence she wishes to share with you.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Rising Stones.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You gather that the inexperienced adventurers who now flock to Revenant's Toll are sorely testing Slafborn's patience. According to him, one young lady in particular would benefit from the guidance of an accomplished veteran like you. Make your way to the Singing Shards, and rescue the would-be hapalit slayer from her intended target.","You have slain the scabrous hapalit. Offer your aid to the struggling adventurer.","You have rescued the adventurer from almost certain death, but the young lady appears intent on blaming others for her own failings. Show her what you think of her attitude with a resounding /huh.","Devastated by your disappointment, the green adventurer swears to do better before slinking off in the direction of town. Return to Revenant's Toll and report to Slafborn.","You return to the bustling settlement to find an appreciative Slafborn. He has witnessed the result of your chastisement, and claims─somewhat hopefully─that the lesson will soon spread through the ranks to the rest of his young charges. He then speaks of the unavoidable hard work required to become a hero, and praises you as a fine example of what dedication and perseverance can achieve."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Rising Stones.</span>"],"dialogue":[{"name":"MINFILIA","text":"Now the matter of Ramuh has, for the present, been put to rest, there is something I would show you, <span class=\"highlight\">Forename</span>."},{"name":"MINFILIA","text":"It is a letter of thanks, signed by the leaders of the Eorzean Alliance, acknowledging the Scions' tireless service to the realm."},{"name":"MINFILIA","text":"It mentions, in particular, the names of all of the defeated primals─Ifrit, Titan, Garuda, Good King Moggle Mog XII, Leviathan, and now Ramuh."},{"name":"MINFILIA","text":"Needless to say, there is only one among our number to have faced them all."},{"name":"MINFILIA","text":"And though these words of gratitude were addressed to our order as a whole, I feel that they were meant for you above all others."},{"name":"MINFILIA","text":"I, too, must offer my heartfelt thanks for all that you have done. In the course of your duties, you have never once failed to answer my call to arms."},{"name":"MINFILIA","text":"You are a true hero, <span class=\"highlight\">Forename</span>, and Eorzea is that much the safer for your presence."},{"name":"MINFILIA","text":"Pray do not misunderstand me─I said “safer,” not “safe.” I know only too well that we can ill afford to lower our guard. The Ascians may be relied upon to sow chaos in this realm until such time as they are forced to stop."},{"name":"MINFILIA","text":"Why, even without their encouragement, you may be assured that man would foment strife on his own. And that is to say nothing of the beast tribes. Unless we learn to live in harmony, the primals, too, will return to plague us again and again and again..."},{"name":"MINFILIA","text":"And yet...despite all of this, your deeds serve to inspire the people─to give them hope for a better tomorrow. And there is no greater gift."},{"name":"MINFILIA","text":"That we have the courage to strive for what might otherwise seem an impossible peace, we owe in no small part to the dangers you have faced on our behalf, and the people you have won over to our cause in so doing. Our list of enemies has ever been long, but think of the allies with whom we are now blessed..."},{"name":"MINFILIA","text":"Of the beastmen who wish naught of conflict, and who now call you friend."},{"name":"MINFILIA","text":"Of the sylphs of Little Solace, who wish naught of conflict."},{"name":"MINFILIA","text":"Of Alisaie, who strives to unearth the terrible secrets of the Calamity."},{"name":"MINFILIA","text":"Of the Ala Mhigans and the Domans who stand with us, determined to halt the dread march of the Empire."},{"name":"MINFILIA","text":"And then there is Cid and the fellowship of NOAH, racing to unlock the mysteries of ancient Allag that we might be spared the horror of another Ultima Weapon."},{"name":"MINFILIA","text":"And then there are the many unsung individuals who have gathered here in Revenant's Toll─honest men and women who seek to employ their skills for the good of all."},{"name":"MINFILIA","text":"...Of course, when speaking of our greatest allies, we must not forget those closest to us, by which I mean our fellow Scions."},{"name":"MINFILIA","text":"Thanks to their many and varied talents, our order is uniquely equipped to combat the far-reaching corruption of the Ascians─and combat it we shall!"},{"name":"ALPHINAUD","text":"(-???-)Your enthusiasm is truly heartwarming, Antecedent. Given our embarrassing wealth of allies, I trust it will not inconvenience you unduly if I absent myself for a time?"},{"name":"MINFILIA","text":"Alphinaud! I take it the troubles in Ul'dah no longer require your attention?"},{"name":"ALPHINAUD","text":"There are yet some rumblings of discontent, but the air of simmering violence is largely dissipated. 'Tis to report such that I stand before you now."},{"name":"ALPHINAUD","text":"That...and to speak with you concerning the new organization we discussed."},{"name":"ALPHINAUD","text":"Ah, I have a message for you from Ele─ Ahem. You recall the refugee girl? The one whose parents were missing? They were found unharmed. She wished me to pass on her thanks to you."},{"name":"MINFILIA","text":"Why, Alphinaud! Am I to understand that you made the effort to remember the poor girl's name? I look forward to reading all about her in your report. I do hope you left nothing out!"},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>─you have been away from Revenant's Toll for some time now, I believe. Might I suggest that you put the affairs of the realm to one side for the moment and take this opportunity to reacquaint yourself with the town?"},{"name":"MINFILIA","text":"...Which reminds me─Slafborn but recently inquired as to your whereabouts. I believe he has some small matter he wishes to discuss with you. Why not oblige him with a visit?"},{"name":"SLAFBORN","text":"Oho, I see my fine adventurer friend has returned, the dust of the road yet clinging to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> boots. Do the Scions have no work for you this day, then?"},{"name":"SLAFBORN","text":"Hm? The Antecedent sent you my way, did she? Well, it is naught urgent, but I could certainly do with your help."},{"name":"SLAFBORN","text":"You see, Revenant's Toll has become something of a favored destination for adventurers. Part of that is due to the town's growing fame, but a goodly number of green heroes-to-be have come here to follow in <span class=\"emphasis\">your</span> footsteps."},{"name":"SLAFBORN","text":"...And when I say “green,” I mean “fresh out of the ground, don't know one end of a sword from the other” green. I've done what I can, but what they really need is a good talking to from someone they respect. An adventurer who has done it all. Aye, <span class=\"highlight\">Forename</span>, that would be you."},{"name":"SLAFBORN","text":"...And, naturally, the one lass who would most benefit from your wisdom is nowhere to be seen. She was off to slay hapalits, and was due back some time ago. &lt;sigh&gt; Likely got herself in over her head, as usual."},{"name":"SLAFBORN","text":"Now that I think on it, this may be the perfect opportunity for you to treat her to a demonstration of your skills. I'd consider it a personal favor if you would head out to the Singing Shards and show that amateur how it's done."},{"name":"SLAFBORN","text":"You'll find our would-be hapalit slayer out in the Singing Shards. Do me a favor, and show her how a <span class=\"emphasis\">real</span> adventurer fights, would you?"},{"name":"ADVENTURER01454","text":"Gods help me! Any one o' the Twelve'll do! No one told me they were <span class=\"emphasis\">that</span> big!"},{"name":"ADVENTURER01454","text":"Damn near pissed meself back there! I was hopin' to find meself a little one, but the fates went and threw the meanest bugger in all o' Mor Dhona at me. Typical!"},{"name":"ADVENTURER01454","text":"Hold up! You're <span class=\"highlight\">Forename Surname</span>, ain't ye? <span class=\"emphasis\">The</span> <span class=\"highlight\">Forename Surname</span>! Seven hells! Yer flippin' <span class=\"emphasis\">famous</span>!"},{"name":"ADVENTURER01454","text":"An' yer twice as tough as they said ye were, an' all! Bugger me...I can't believe I'm talkin' to the <span class=\"alternative-container\"><span class=\"alternative\">woman herself</span><span class=\"alternative\">man himself</span></span>!"},{"name":"ADVENTURER01454","text":"Aw, an' now ye've gone an' seen me at me worst. 'Twas me bleedin' pet's fault, I tell ye! Doesn't listen to a damn thing I say!"},{"name":"ADVENTURER01454","text":"That an' the fact that none o' me so-called mates offered to help me. When I told 'em I was off to gut some hapalits, most of 'em gave me a confused “<span class=\"highlight\">huh</span>” or a “hmmm,” like I was talkin' out me arse. You, uh...don't agree though, right?"},{"name":"ADVENTURER01454","text":"I know I look a right fool, but I'm just havin' a bad day, honest! Yer not goin' to “<span class=\"highlight\">huh</span>” or “hmmm” at me too, are ye!?"},{"name":"ADVENTURER01454","text":"Er...what's that yer doin' there, mate? No offense, like, but...ye've lost me."},{"name":"ADVENTURER01454","text":"Gods, no! Not you too! That's the final bleedin' straw, that is!"},{"name":"ADVENTURER01454","text":"&lt;sniffle&gt; I was hopin' you of all people would understand... I mean, it ain't adventurin' if ye don't take a few risks, right...?<br>...Alright, maybe I <span class=\"emphasis\">am</span> a bit out o' me depth here. I'll be more careful, I promise!"},{"name":"SLAFBORN","text":"Ah, <span class=\"highlight\">Forename</span>, you have my thanks. That lass I sent you out to instruct trudged back into town looking properly chastised."},{"name":"SLAFBORN","text":"I thought a lesson from you might pierce that obstinate skull of hers. Nothing I said seemed to work. Truth be told, she seemed more inclined to listen to the rustling of my beard than anything which came out of my mouth..."},{"name":"SLAFBORN","text":"Ahem. But now that you have demonstrated the skills she yet lacks, it will not be long before her addle-pated peers hear the tale."},{"name":"SLAFBORN","text":"They will soon realize that one does not become a hero in a day: it requires dedication and perseverance, and learning from each task you undertake. There are no shortcuts, eh, <span class=\"highlight\">Forename</span>?"},{"name":"POPMESSAGE","text":"You sense a hostile presence!"},{"name":"POP","text":"（★未使用／削除予定★）"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66989]},"next":[66991]},"partials":[{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1009076","obj":{"i":1009076,"n":"Struggling Adventurer","l":67,"q":1}},{"type":"quest","id":"66989","obj":{"i":66989,"n":"What Little Gods Are Made Of","g":2,"l":"East Shroud","s":50}},{"type":"quest","id":"66991","obj":{"i":66991,"n":"Picking Up the Sledge","g":0,"l":"Mor Dhona","s":52}}]}