{"quest":{"name":"Heretical Harassment","location":"The Rising Stones","id":66994,"patch":2.3,"sort":55,"eventIcon":71201,"issuer":1008969,"target":1006384,"involved":[1006530,1009077],"genre":2,"journal":["Minfilia appears eager to welcome you back to Revenant's Toll.","Minfilia expresses concern that the bustling chaos surrounding the official commencement of Alphinaud's trial company has placed undue stress on Slafborn and his efforts to supervise the growing population of Revenant's Toll. Head outside and offer your aid to the veteran soldier.","Seemingly unfazed by the arrival of the recruits, Slafborn claims to be more worried about your unending workload. While he is dismissing your concerns, however, your conversation is interrupted by the arrival of an injured group of adventurers. You soon learn that the adventurers─and the provisions they were charged with escorting─were set upon by a band of Coerthan heretics near the border to Mor Dhona. Slafborn asks that you travel to Coerthas and aid House Fortemps in tracking down the stolen shipment meant for the frontier hands of Revenant's Toll. Make your way to Camp Dragonhead and call upon Lord Haurchefant.","You arrive in Camp Dragonhead to find Lord Haurchefant yet unaware of the reason for your visit. Explain the situation to the head of House Fortemps, and discuss what must be done..."],"objectives":["Speak with Slafborn in Revenant's Toll.","Speak with Haurchefant at Camp Dragonhead."],"dialogue":[{"name":"MINFILIA","text":"Greetings, <span class=\"highlight\">Forename</span>. Alphinaud tells me all is in place to begin his trial company─the Scions shall certainly be grateful to have the support of such an organization."},{"name":"MINFILIA","text":"The inaugural ceremony is set to take place here at the Rising Stones. Tataru is cooperating with Alphinaud to see that all is in readiness, so I'm afraid the recruits themselves have been left to their own devices for the time being."},{"name":"MINFILIA","text":"Quite a number of new faces have arrived in Revenant's Toll of late, and I wonder if Slafborn might not find himself overwhelmed. Would you speak with him and see if there is aught he requires?"},{"name":"MINFILIA","text":"Would you speak with Slafborn and offer to ease his burdens? The town was already fit to burst with adventurers and refugees and the like, and I fear the addition of Alphinaud's recruits has only added to the chaos."},{"name":"SLAFBORN","text":"What can I do for you, <span class=\"highlight\">Forename</span>? I thought you'd have your hands full helping out with this new arm of the Scions."},{"name":"SLAFBORN","text":"Ha! I barely noticed your recruits arrive─'twas barely a trickle compared to the flood of treasure hunters we have pass through here every day."},{"name":"SLAFBORN","text":"While I appreciate your offer of aid, 'tis more <span class=\"emphasis\">your</span> burden that concerns me. I'm told this trial company will answer directly to the Antecedent, so I trust that means less work for you in the long run."},{"name":"HONBUBOUKENSHA01354","text":"(-???-)Slafborn! The shipment... We couldn't..."},{"name":"SLAFBORN","text":"Gods, woman, what befell!?"},{"name":"HONBUBOUKENSHA01354","text":"We─ &lt;cough&gt; We were bringing a shipment to Revenant's Toll─provisions earmarked for the frontier effort."},{"name":"HONBUBOUKENSHA01354","text":"But just as we sought to cross over into Mor Dhona, we were set upon by brigands. I─ &lt;cough&gt; &lt;cough&gt; I believe they may have been heretics."},{"name":"HONBUBOUKENSHA01354","text":"They were many... Too many. We only escaped with our lives by abandoning the supplies. Pray forgive us!"},{"name":"SLAFBORN","text":"There is naught to forgive. Provisions can be replaced, but smart soldiers are hard to find. Take your rest and I'll have someone along to tend to those wounds."},{"name":"SLAFBORN","text":"What to do..."},{"name":"SLAFBORN","text":"If heretics are involved, then this is like to be more than a case of simple thievery. Ishgard will need to be informed."},{"name":"SLAFBORN","text":"Whence did these supplies originate?"},{"name":"HONBUBOUKENSHA01354","text":"House Fortemps─we collected the provisions from Camp Dragonhead proper."},{"name":"SLAFBORN","text":"Understood. I shall see that they are apprised of this development."},{"name":"SLAFBORN","text":"<span class=\"highlight\">Forename</span>, were you not on good terms with the knights of House Fortemps?"},{"name":"SLAFBORN","text":"I will be sending them a missive immediately, of course, but I would also have you travel there and offer your considerable talents."},{"name":"SLAFBORN","text":"...Yes, I realize I contradict my earlier hopes to lighten your load, but I need someone who can help bring this incident to a satisfactory conclusion─our favorable relations with Ishgard are far too important to risk half measures."},{"name":"SLAFBORN","text":"Thank you for your understanding. I am certain Lord Haurchefant will be glad of your assistance."},{"name":"SLAFBORN","text":"I will send a missive to Camp Dragonhead and let Lord Haurchefant know of the attack, as well as your impending arrival. Fair fortune go with you, <span class=\"highlight\">Forename</span>."},{"name":"HONBUBOUKENSHA01354","text":"I've never so completely failed in a task. But those heretics, they fell upon us like wintry demons..."},{"name":"HAURCHEFANT","text":"Well, well, if it isn't my fine friend, <span class=\"highlight\">Forename Surname</span>! Would you care for a plate of roast karakul? Some mulled wine?"},{"name":"HAURCHEFANT","text":"No? Ah, I see you have not come into my hall merely to escape the biting cold."},{"name":"HAURCHEFANT","text":"I was, in fact, on the verge of opening an urgent missive from Revenant's Toll, and I suspect the timing of your arrival is no coincidence..."}],"reward":{"gil":433,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66993]},"next":[66995]},"partials":[{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1006384","obj":{"i":1006384,"n":"Haurchefant","l":63,"q":16}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1009077","obj":{"i":1009077,"n":"Adventurers' Guild Assistant","l":67,"q":1}},{"type":"quest","id":"66993","obj":{"i":66993,"n":"Recruiting the Realm","g":2,"l":"The Rising Stones","s":54}},{"type":"quest","id":"66995","obj":{"i":66995,"n":"When the Cold Sets In","g":2,"l":"Coerthas Central Highlands","s":56}}]}