{"quest":{"name":"Recruiting the Realm","location":"The Rising Stones","id":66993,"patch":2.3,"sort":54,"eventIcon":71201,"issuer":1009021,"target":1009021,"involved":[1000248,1000915,1000918,1001000,1001657,1001679,1001691,1003282,1006263,1009128,1009129,1009130,1009131,1009132,1009133,1009135,1009136,1009138,1009139,1009140],"genre":2,"journal":["Alphinaud wishes to request your assistance for his new endeavor.","Alphinaud lays before you the plan to establish a realm-wide Grand Company. The Scion goes on to lament that though the three nations' leaders are not opposed to the idea itself, endless deliberations over its implementation have slowed progress to a crawl. In order to demonstrate the efficacy of such a company and thus encourage the leaders to come to an agreement, Alphinaud explains that he has proposed the creation of a smaller, precursor organization─the vanguard to a future united Eorzea. The young Elezen requests that you join him on his journey to each of the three nations that you might begin scouting potential members for this trial company while he is engaged with finalizing the bureaucratic formalities. Head first to Limsa Lominsa and rendezvous with Alphinaud at Bulwark Hall.","After giving you a brief explanation on the recruitment process, Alphinaud heads up to the Bridge to speak with the Admiral. Make your way to the upper decks and begin scouting for potential company members.","You speak with a number of possible candidates for the trial organization, but are only successful in gaining the interest of Riol, a member of the now defunct Company of Heroes. Head to the airship landing and report to Alphinaud.","You have reported the fruits of your labor to the young Scion. He is impressed by the caliber of your first recruit, and bids you join him on the second leg of his journey. Travel next to Gridania, and find Alphinaud at Nophica's Altar.","You meet with Alphinaud just as he is due to begin his audience with Kan–E–Senna. Continue your recruiting efforts within Old Gridania while the determined Elezen speaks with the Elder Seedseer.","You succeed in recruiting Laurentius and Alianne to the trial company. Make your way to the airship ticket counter and report to Alphinaud.","The young Scion appears curious but nevertheless pleased at the addition of a former Wood Wailer and a seasoned adventurer to the ranks. Travel next to Ul'dah, and rendezvous with Alphinaud at the Royal Promenade.","Alphinaud is ready to bow before Sultana Nanamo Ul Namo and ask her permission to operate freely within Ul'dah's borders. Make your way to the lower level of the Steps of Thal, and complete the initial stage of the trial company's recruitment efforts.","Though your efforts to recruit any native Ul'dahns have failed, you are able to capture the interest of the young Ala Mhigan Wilred. Return to the Royal Promenade and report to Alphinaud.","Somewhat disappointed but otherwise unsurprised by the overall number of recruits, Alphinaud is genuinely grateful for the few valuable members you were able to secure. After reporting his own success with the sultana and attempting to dispel any doubt you might have over the Syndicate's involvement, the young Scion suggests a swift return to Revenant's Toll. Make your way back to the Rising Stones and speak with Alphinaud.","Upon returning to the Scions' headquarters, you find Alphinaud exhausted from the journey but eager to begin preparations for his trial company's inaugural ceremony. He thanks you for your recruiting efforts, and hints that the Antecedent may wish to assign you new duties. Speak with Minfilia and learn what events have transpired in Revenant's Toll in your absence."],"objectives":["Speak with Alphinaud at Bulwark Hall.","Scout for potential recruits on the upper decks.","Speak with Alphinaud at the airship landing in Limsa Lominsa.","Speak with Alphinaud at Nophica's Altar.","Scout for potential recruits in Old Gridania.","Speak with Alphinaud at the airship landing in Gridania.","Speak with Alphinaud at the Royal Promenade.","Scout for potential recruits on the Steps of Thal.","Speak with Alphinaud at the Royal Promenade.","Speak with Alphinaud at the Rising Stones."],"dialogue":[{"name":"ALPHINAUD","text":"Pray forgive me if I tread over old ground, but I would first speak of the grand plan."},{"name":"ALPHINAUD","text":"Since the advent of the Seventh Astral Era, the leaders of the three nations have been deliberating over an accord that seeks to bring the disparate forces of Eorzea together into a single entity."},{"name":"ALPHINAUD","text":"A realm-wide Grand Company, if you will. The military might of such an institution would be drawn from every corner of the land, and directed against threats that no single nation could hope to overcome alone."},{"name":"ALPHINAUD","text":"Yet while the purpose of this hypothetical organization is undisputed, the logistics of its formation have become the source of endless debate..."},{"name":"ALPHINAUD","text":"And the longer these discussions continue, the more I sense the impetus towards unification draining away. Thus have I been campaigning for the creation of what might be considered a trial company."},{"name":"ALPHINAUD","text":"It will be on a much smaller scale than what we hope to eventually achieve, but capable of the same manner of unrestricted operation accorded to the Scions. 'Tis my hope that the successful utilization of such a force will lend momentum to the lagging deliberations."},{"name":"ALPHINAUD","text":"Also, being a primarily military outfit, I mean to assuage fears of its misuse by placing the fledgling organization under the authority of the Antecedent."},{"name":"ALPHINAUD","text":"The Scions work tirelessly to protect Eorzea and its people."},{"name":"ALPHINAUD","text":"...But as you yourself have witnessed with the refugee revolt, there are limitations to what even we can achieve."},{"name":"ALPHINAUD","text":"With this new company under the Scions' command, however, we will be capable of responding to a wider range of difficulties without straining our resources or overtaxing your formidable talents."},{"name":"ALPHINAUD","text":"The goals of my proposed organization and those of the Scions are ultimately identical─a point conceded by all concerned."},{"name":"ALPHINAUD","text":"But before I can move forward with establishing this precursor to the true, border-spanning Grand Company, 'tis yet necessary that I visit the three leaders and gain their official approval."},{"name":"ALPHINAUD","text":"A tiresome and time-consuming task... Which is why I would ask that you accompany me on the journey, and attend to the business of recruiting our inaugural members while I am otherwise engaged with bureaucratic formalities."},{"name":"ALPHINAUD","text":"...Thank you. 'Tis reassuring indeed to know that the Bringer of Light and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> discerning eye will be selecting our future allies."},{"name":"ALPHINAUD","text":"Our first destination will be Limsa Lominsa. Let us rendezvous at Bulwark Hall."},{"name":"ALPHINAUD","text":"Ah, there you are. I am ready to ascend to the Bridge and speak with Admiral Bloefhiswyn."},{"name":"ALPHINAUD","text":"While the Admiral and I are finalizing permissory boundaries and signing parchments, I would have you begin the recruitment process in earnest."},{"name":"ALPHINAUD","text":"I have, of course, endeavored to spread the word of our organization through various channels, but I believe a personal approach will reach many who may otherwise remain ignorant of the opportunity."},{"name":"ALPHINAUD","text":"As for potential members, 'tis of no matter should they already be pledged to another institution, only that they are willing to lend their strength when the situation demands it. And you needn't range into the countryside─the upper decks alone are populated with sufficient candidates to suit our purpose."},{"name":"ALPHINAUD","text":"Once you are satisfied with your recruiting efforts, meet me at the airship ticket counter that we might prepare for the next leg of our journey."},{"name":"RIOL","text":"Well, if it ain't <span class=\"highlight\">Forename</span>! I'd not forget a 'venturer brave enough─or daft enough─to seek the shortcut into Titan's bedchamber!"},{"name":"RIOL","text":"Ye remember ol' Riol, don't ye? Formerly o' the Company of Heroes? Three whistles at Bronze Lake? Aye, it ain't often I drag me arse out to Limsa for a drink, but I'm right glad I did! How fare ye these days?"},{"name":"RIOL","text":"Hm? Yer lookin' to put together a new crew? Top-tier work? Hah, sounds like a right lark, it does!"},{"name":"RIOL","text":"Alrighty, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, count me in. The Heroes may've gone their separate ways, but I ain't ready to climb into me grave just yet!"},{"name":"REYNER","text":"Master Alphinaud's new organization? Yes, I had heard the formation of his trial company was in the offing."},{"name":"REYNER","text":"'Tis with regret, however, that I must decline your invitation. As commander of the Yellowjackets, the protection of Limsa Lominsa must needs receive my full attention."},{"name":"REYNER","text":"I wish you well in your endeavors, but the Yellowjackets─and the defense of Limsa Lominsa's people─must remain my sole priority."},{"name":"CARVALLAIN","text":"An organization with the freedom to operate with territorial impunity? I must say, your proposal intrigues me."},{"name":"CARVALLAIN","text":"But the Krakens well know that there is a time to act, and a time to watch. And I'm afraid this...“trial company” of yours falls into the latter category."},{"name":"CARVALLAIN","text":"The Krakens do not stir before the currents can be read. For the present, my answer must be a respectful “no.”"},{"name":"RHOSWEN","text":"Eh? Who in the bloody 'ells do ye think yer talkin' to, drylander!? I'm a pirate, not some soddin' knight in shinin' plate! If yer lookin' fer a self-righteous fop, try knockin' on that dandy Carvallain's door!"},{"name":"RHOSWEN","text":"Do I need to fetch me hook? I told ye, go bother Carvallain with yer talk o' do-goodin'."},{"name":"HNAANZA","text":"A precursor to a united Eorzean Grand Company? Hmmm. While I do admire the scope of your ambition, my responsibilities here at Naldiq & Vymelli's keep me close to the forge."},{"name":"HNAANZA","text":"I have not the time to be traipsing hither and yon across the realm. Should you require my skills as an armorer, however, I might be willing to accept some special commissions..."},{"name":"HNAANZA","text":"As noble as your cause may be, I have a duty to Naldiq & Vymelli's, and to the forge. I can, however, be persuaded to furnish you with any metalwork you might require. Come back with a list of materiel, and we'll talk."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, your recruiting went well, I trust? I am curious as to how my proposal was received by the rough-and-ready folk of Limsa Lominsa."},{"name":"ALPHINAUD","text":"Ah, a member of the legendary Company of Heroes indicated his interest? Astonishing. I knew enlisting your aid was the right choice─few could boast the acquaintance of such an elusive character."},{"name":"ALPHINAUD","text":"I, too, was successful in my task: the Admiral consented to sign all the documents requiring her approval. I can only hope that my visit with the Elder Seedseer proceeds as smoothly. Pray continue on to Gridania at your own pace─I shall await your arrival at Nophica's Altar."},{"name":"ALPHINAUD","text":"My audience with the Elder Seedseer is due to commence momentarily. I would be grateful if you would once more see to the task of recruitment here in Gridania."},{"name":"ALPHINAUD","text":"After you deem the well of potential candidates has run dry, let us rendezvous at the airship ticket counter as before."},{"name":"LAURENTIUS","text":"Oh gods, can it truly be <span class=\"emphasis\">you</span>!? By what fickle fortune must the first face I see upon my release be yours!?"},{"name":"LAURENTIUS","text":"...Eh? Could it be that you don't remember me? It is I, Laurentius, the man whose crimes you exposed. I was a Wailer, and a regular patron at Buscarron's..."},{"name":"Q1","text":"Do you remember Laurentius?"},{"name":"A1","text":"Yes, now I remember!"},{"name":"A1","text":"...Who?"},{"name":"A1","text":"..."},{"name":"LAURENTIUS","text":"Well, of course you do! I was beginning to wonder if gaol had changed me more than I realized. ...Not that I have any particular wish to be recognized after my shameful conduct."},{"name":"LAURENTIUS","text":"Laurentius! I...I was selling maps and supplies to the Garleans, before you and those Redbelly poachers mopped the forest floor with my erstwhile employers. ...Here now, just how many criminals have you dealt with that my ignominious tale ignites not the slightest flicker of recognition!?"},{"name":"LAURENTIUS","text":"Will you say nothing!? Does my presence disgust you so? Or do you simply not care to remember our encounter at all?"},{"name":"LAURENTIUS","text":"Hmph. The less said of my past, the better, I suppose. And what of you, adventurer? What business brings you to this part of Gridania?"},{"name":"LAURENTIUS","text":"Recruiting, eh? And what is your policy on reformed convicts?"},{"name":"LAURENTIUS","text":"As matters stand, the Wood Wailers will have naught more to do with me. This...this may be just the second chance I was looking for..."},{"name":"LAURENTIUS","text":"Revenant's Toll, you say? I shall leave at once! You shall not regret this, I promise you! I am a changed man!"},{"name":"ALIANNE","text":"Grandfather, you must call it a day! Let us return to the guild and rest ere your tormented back gives up on you for good!"},{"name":"ALIANNE","text":"I'm terribly sorry, we were just─ Oh, <span class=\"highlight\">Forename</span>, isn't it? It has been some time since our paths crossed outside of Copperbell Mines."},{"name":"ALIANNE","text":"Why, you were barely more than a novice adventurer then, but look how far you've come... Mother Miounne tells me 'twas you who felled the fearsome Black Wolf!"},{"name":"ALIANNE","text":"And now you seek stout-hearted souls to fill the ranks of a new order? Hmmm, well your cause is undoubtedly just, and my old companion here would be much relieved to see me in good hands..."},{"name":"ALIANNE","text":"Yes. Yes, I'll do it! This is the very thing I've spent my entire adventuring career working towards! I shall join your company just as soon as I've seen Isildaure safely home."},{"name":"ALIANNE","text":"If you would have me, I would be glad to join your new company. I shall make for Revenant's Toll once I've escorted my dear friend back home."},{"name":"ISILDAURE","text":"My back is perfectly fine, I tell you! You'll have to tie me to my bed if you think to prevent me from─ &lt;gasp&gt; Ow. Well, mayhaps I will rest for just a short while..."},{"name":"CEINGULED","text":"Hmmm. 'Tis not often a guild officer such as myself gets recruited. And this company of yours certainly sounds to have some promise... But its duties appear less than focused. I must refuse your invitation until such time as your organization is more...organized."},{"name":"CEINGULED","text":"While I find sympathy with your cause, I must confess to some confusion as to this company's place in the grand scheme of things. For the moment, I prefer to devote my energies to the clear-cut responsibilities of the Wailers."},{"name":"URSANDEL","text":"...You would offer this old man a place in your company of champions? I am both puzzled and honored by your invitation."},{"name":"URSANDEL","text":"Pray forgive me, <span class=\"alternative-container\"><span class=\"alternative\">young mistress</span><span class=\"alternative\">young master</span></span>, but I cannot accept. I have sworn to abide here for whatever scant years remain to me, and bear responsibility for the evils my lady has wrought upon this land..."},{"name":"URSANDEL","text":"I must respectfully refuse your invitation. Your proposal promises new beginnings, but I am shackled to the sins of the past. By my own oath am I made prisoner, my chains forged of guilt and unforgivable cowardice..."},{"name":"ALPHINAUD","text":"What news, <span class=\"highlight\">Forename</span>? For my part, the Elder Seedseer was most amenable to our requirements."},{"name":"ALPHINAUD","text":"...A former Wood Wailer, and a seasoned adventurer? Our company will not lack for variety, that much is certain. An interesting harvest, indeed."},{"name":"ALPHINAUD","text":"Shall we strike into Ul'dah whilst the iron is hot? Let us meet at the Royal Promenade and endeavor to conclude our remaining business. Our journey draws to a close..."},{"name":"ALPHINAUD","text":"Ul'dah, the gilded city, where one's fortune defines one's worth. I hope some manner of fortune is with us, and that this final leg proves as successful as the previous two."},{"name":"ALPHINAUD","text":"Might I suggest descending to the lower level before beginning your recruitment efforts? I do not think the sultana will take kindly to us poaching from her personal guard."},{"name":"ALPHINAUD","text":"Let us meet back here at the Promenade when our respective tasks are complete. Good hunting, <span class=\"highlight\">Forename</span>."},{"name":"WILRED","text":"Hm? Wait, you're the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> who came to Little Ala Mhigo looking for that masked devil."},{"name":"WILRED","text":"Who knows what might've happened if you hadn't... I'd probably be dead, and a whole lot more of my friends besides. We were such fools."},{"name":"WILRED","text":"Anyroad, that disaster really got me to thinking─about our homeland, and about the outsider who saved us from ourselves. I realized how easily I'd been manipulated, and vowed to make of myself a more worldly man. So here I am."},{"name":"WILRED","text":"...A new company of champions? And you say it will take me to all corners of the realm?"},{"name":"WILRED","text":"That sounds exactly like the kind of opportunity I need. And don't worry: I'm not the same stripling you met in Little Ala Mhigo. I've prepared myself to fight the evil I now <span class=\"emphasis\">know</span> is out there."},{"name":"OURCEN","text":"Oh, what a happy coincidence! Do you remember me, perchance? I am Ourcen, of the Church of Saint Adama Landama. Thank you again for your timely rescue."},{"name":"OURCEN","text":"And I must also thank you for preventing that fraudulent priest from preying on Drybone's less fortunate. A most upsetting business. Are you here with your companion─Thancred, wasn't it?"},{"name":"OURCEN","text":"...Ah, 'tis new companions you seek, then. Your proposed organization sounds a powerful force for good, but my place is at the church with the children. Nevertheless, I wish you well in this undertaking."},{"name":"OURCEN","text":"I could never abandon the children, or my work at the lichyard. I will, however, pray for your success."},{"name":"SYNTGOHT","text":"A company that looks to cure the ills of the realm entire? Listen, friend, I can scarce bear the complaints of the next stall over, let alone the conundrums of a neighboring nation!"},{"name":"SYNTGOHT","text":"I cannot help you. My fortunes have fallen far enough without investing in a company with no margin for profit."},{"name":"LANDEBERT","text":"...Aye, you'd be surprised what rumors drift down to Pearl Lane. I know of this glorious new company of yours, and just how far I'd go to avoid getting involved with it."},{"name":"LANDEBERT","text":"Whispers on the street say your organization is funded by corrupt coin─by <span class=\"emphasis\">Syndicate</span> money. If you think you're recruiting for a just cause, then you're a bigger fool than I took you for."},{"name":"LANDEBERT","text":"My advice, soldier? Cut your ties and run. Your shining company'll be naught but a puppet that dances to the Syndicate's tune."},{"name":"YELLOWMOON","text":"I'm sorry? You wish to “recruit” me? Is this some new-fashioned manner of propositioning a lady?"},{"name":"YELLOWMOON","text":"Well, I'm afraid you are wasting your time─<span class=\"emphasis\">this</span> lady is already spoken for! Good day to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"YELLOWMOON","text":"Pray take your crude affections elsewhere! Bitter Snow's is the only love I require!"},{"name":"ALPHINAUD","text":"How fared you, <span class=\"highlight\">Forename</span>? What hidden gems did the streets of Ul'dah offer up to your unrelenting gaze?"},{"name":"ALPHINAUD","text":"Hmmm... A single Ala Mhigan youth? Well, you've certainly given us an admirable start, even if our ranks are yet somewhat thin."},{"name":"ALPHINAUD","text":"In these troubled years following the Calamity, talk of Eorzea's salvation must seem akin to grasping at clouds."},{"name":"ALPHINAUD","text":"But there are those who have risen to the challenge, nonetheless. And the hope that inspires these people was born in no small part from the victories you yourself have won."},{"name":"ALPHINAUD","text":"Thank you, <span class=\"highlight\">Forename</span>. I will not squander the precious gift you have placed into my keeping─these recruits will become the foundation of a new beginning."},{"name":"ALPHINAUD","text":"And yes, we are free to begin. As you have no doubt surmised, the sultana also graced my trial company with her blessings."},{"name":"ALPHINAUD","text":"Our first wave of recruitment is over, the documents signed, and the finances secure. There is naught to prevent me from taking the next step."},{"name":"ALPHINAUD","text":"...You are concerned by the Syndicate's involvement? As was I. Thus was the origin of every coin of their contribution carefully scrutinized and recorded. This organization will not be built on corruption."},{"name":"ALPHINAUD","text":"Naturally, I would prefer not to rely upon outside sources at all, but even my family's substantial coffers could not sustain a venture of this magnitude."},{"name":"ALPHINAUD","text":"And as for the rumors and doubt surrounding this enterprise... Well, such things shall plague us until the company has had a chance to prove its worth."},{"name":"ALPHINAUD","text":"It will not be an easy process, but we will earn people's trust one success at a time."},{"name":"ALPHINAUD","text":"...Speaking of time, we should waste no more of it. Let us return to the Rising Stones, and lay the first stone for a united Eorzea!"},{"name":"ALPHINAUD","text":"&lt;sigh&gt; ...That is not a journey I soon wish to repeat."},{"name":"ALPHINAUD","text":"But I cannot pause to rest─the culmination of all our effort is at hand. I must see to the preparations for the inaugural ceremony."},{"name":"ALPHINAUD","text":"Thank you for allowing me to monopolize your services, <span class=\"highlight\">Forename</span>. I am certain the Antecedent will be relieved to see you free for other duties."}],"reward":{"gil":5000,"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66992]},"next":[66994]},"partials":[{"type":"npc","id":"1009021","obj":{"i":1009021,"n":"Alphinaud","l":481,"q":3}},{"type":"npc","id":"1000248","obj":{"i":1000248,"n":"Ceinguled","l":53,"q":5}},{"type":"npc","id":"1000915","obj":{"i":1000915,"n":"Carvallain","l":28,"q":6}},{"type":"npc","id":"1000918","obj":{"i":1000918,"n":"Rhoswen","l":28,"q":4}},{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001657","obj":{"i":1001657,"n":"Landebert","l":41,"q":5}},{"type":"npc","id":"1001679","obj":{"i":1001679,"n":"Syntgoht","l":41,"q":12}},{"type":"npc","id":"1001691","obj":{"i":1001691,"n":"Yellow Moon","l":41,"q":4}},{"type":"npc","id":"1003282","obj":{"i":1003282,"n":"Reyner","l":28,"q":6}},{"type":"npc","id":"1006263","obj":{"i":1006263,"n":"Ursandel","l":53,"q":4}},{"type":"npc","id":"1009128","obj":{"i":1009128,"n":"Alphinaud","l":29,"q":1}},{"type":"npc","id":"1009129","obj":{"i":1009129,"n":"Alphinaud","l":28,"q":1}},{"type":"npc","id":"1009130","obj":{"i":1009130,"n":"Alphinaud","l":53,"q":2}},{"type":"npc","id":"1009131","obj":{"i":1009131,"n":"Alphinaud","l":52,"q":1}},{"type":"npc","id":"1009132","obj":{"i":1009132,"n":"Alphinaud","l":41,"q":1}},{"type":"npc","id":"1009133","obj":{"i":1009133,"n":"Riol","l":28,"q":1}},{"type":"npc","id":"1009135","obj":{"i":1009135,"n":"Wilred","l":41,"q":1}},{"type":"npc","id":"1009136","obj":{"i":1009136,"n":"Ourcen","l":41,"q":1}},{"type":"npc","id":"1009138","obj":{"i":1009138,"n":"Laurentius","l":53,"q":1}},{"type":"npc","id":"1009139","obj":{"i":1009139,"n":"Alianne","l":53,"q":1}},{"type":"npc","id":"1009140","obj":{"i":1009140,"n":"Isildaure","l":53,"q":1}},{"type":"quest","id":"66992","obj":{"i":66992,"n":"Guardian of Eorzea","g":2,"l":"The Rising Stones","s":53}},{"type":"quest","id":"66994","obj":{"i":66994,"n":"Heretical Harassment","g":2,"l":"The Rising Stones","s":55}}]}