{"quest":{"name":"Celestial Radiance","location":"North Shroud","id":66998,"patch":2.28,"sort":3,"unlocksFunction":1,"eventIcon":71341,"issuer":1008948,"target":1009151,"involved":[1001304,1001425],"genre":73,"usedItems":[7885],"journal":["Jalzahn has the look of a hungry wolf as he eyes your relic weapon.","Jalzahn believes that your relic weapon animus may yet grow stronger through the power of materia. Explaining that conventional melding will not work due to the preclusive presence of soul energy, the alchemist bids you consult the experts on the matter. Make your way to the Bonfire in central Thanalan, and speak with the goblin Mutamix.","Mutamix introduces you to his new disciple, Hubairtin, who he says is attempting to extract the power of materia. Speak with the man and learn of his research.","Hubairtin seeks to overcome the limits of advanced materia melding by converting the power of materia into a form of light energy. Recognizing the benefits of collaboration, the excitable young arcanist bids you procure three bottles of superior enchanted ink. The ink can be had from none other than your favorite merchant, Rowena, at Revenant's Toll.","Rowena has plenty of superior enchanted ink in stock, and offers to sell you bottles of it in exchange for Allagan tomestones. Acquire three such bottles, and present them to Hubairtin at the Bonfire.","You have shown the bottles of superior enchanted ink to Hubairtin, who explains its role in the creation of sphere scrolls, the medium for storing materia-derived light energy. Furnish Hubairtin with the ink, and he will prepare for you a sphere scroll suitable for enhancing your relic."],"objectives":["Speak with Mutamix Bubblypots at the Bonfire.","Speak with Hubairtin.","Speak with Rowena at Revenant's Toll.","Obtain three bottles of superior enchanted ink from Auriana and show them to Hubairtin."],"dialogue":[{"name":"JALZAHN","text":"Greetings, my dear assistant. I trust your enhanced relic is serving you well."},{"name":"JALZAHN","text":"Yet know that we are but halfway to recreating the mighty arm described in the legend of the Zodiac Braves."},{"name":"JALZAHN","text":"Aye, your weapon can house power even greater than now, and I believe that this power can be attained through the use of materia."},{"name":"JALZAHN","text":"As is my wont, I have dabbled in these peculiar stones and acquired a rudimentary knowledge of their workings."},{"name":"JALZAHN","text":"With my limited grasp of the subject matter, I have gleaned that, already being laden with soul energy, your relic cannot be enhanced via conventional materia melding. An alternate method is required, and for this we shall need to consult the experts."},{"name":"JALZAHN","text":"If you desire to wield a mightier weapon, you would do well to seek Mutamix, the goblin credited with bringing the secrets of materia to Eorzea. He and his students are said to be camped at a place called the Bonfire in central Thanalan, though you doubtless already knew this."},{"name":"SYSTEM","text":"In order to receive the quest “Celestial Radiance,” you must be equipped with a relic weapon animus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"SYSTEM","text":"In order to advance the quest “Celestial Radiance,” you must be equipped with a relic weapon animus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"MUTAMIX","text":"Pshhh... Shkohhh...?<br>What brings uplander to tent-ring of Mutamix Bubblypots?"},{"name":"MUTAMIX","text":"...Uplander has fighty-tool already filled with airyself, wishes it to gain power of materia?"},{"name":"MUTAMIX","text":"Pshhh... Uplander has difficult desire. Such knowings do not exist...<span class=\"emphasis\">yet</span>."},{"name":"MUTAMIX","text":"Mutamix has new underlearner, name of Hubairtin. Hubairtin seeks to out-draw power of materia, but is having brainblocks muchly."},{"name":"MUTAMIX","text":"If uplander gives lenthand to Hubairtin, brainblocks may be broken, yes?"},{"name":"HUBAIRTIN","text":"Gah! Why won't it work!? Why won't you bond, damn you!?"},{"name":"HUBAIRTIN","text":"F-Forgive me my outburst, adventurer. I have hit a proverbial wall in my research, and it has driven me nigh insane."},{"name":"HUBAIRTIN","text":"...What? You've been working with a man from Radz–at–Han? And this Hannish alchemist has had you infusing your relic with <span class=\"emphasis\">soul energy</span>?<br>&lt;gasp&gt; And now you'd seek to further enhance it with materia!?"},{"name":"HUBAIRTIN","text":"Huzzah! The Builder be praised for guiding your steps to me!"},{"name":"HUBAIRTIN","text":"A-Ahem! Begging your pardons, adventurer. The prospect of a breakthrough so excited me, I quite took leave of my propriety."},{"name":"HUBAIRTIN","text":"My name is Hubairtin, and I have but recently joined the Carriers of the Cauldron. I seek to overcome the limits of advanced materia melding, also known as “secret joiny-skill.”"},{"name":"HUBAIRTIN","text":"As you may already be aware, an object can safely host only a limited number of materia. But by extracting the soul energy held within the stones and converting it into light, we may circumvent this constraint."},{"name":"HUBAIRTIN","text":"...Or so my theory goes. While I have succeeded in transferring this light energy to a transitory medium, all attempts to then have it bond with equipment have ended in dismal failure."},{"name":"HUBAIRTIN","text":"I had all but given up hope when you arrived. Your soul-infused relic, I believe, is an ideal vessel for this light energy. And with the revolutionary techniques possessed by Master Jalzahn, I am confident that our efforts will bear fruit."},{"name":"HUBAIRTIN","text":"Aye, <span class=\"emphasis\">our</span> efforts, I say, for we share the selfsame goal. I trust you shan't object to a collaboration. And so, without further ado, I bid you fetch me enchanted ink. Not <span class=\"emphasis\">any</span> enchanted ink, mind you, but one that boasts <span class=\"emphasis\">superior</span> aetherial conductivity."},{"name":"HUBAIRTIN","text":"The ink is central to our endeavor, but I have recently depleted my stores. For a blessing, 'twould seem that it can be had at Revenant's Toll, from a merchant named Rowena.<br><br>...Why are you frowning? Did I...say something inappropriate? If so, please accept my apologies─my mother always said that I lacked tact. But to return to the matter at hand, for our purposes, I must have no less than three bottles of ink. Pray return here when you have procured the requisite amount."},{"name":"HUBAIRTIN","text":"Have you procured the three bottles of superior enchanted ink? Without it, we cannot proceed."},{"name":"HUBAIRTIN","text":"Such ink can be had at Revenant's Toll, from a merchant named Rowena."},{"name":"ROWENA","text":"Well, if it ain't my best customer. What's your fancy today, then?"},{"name":"ROWENA","text":"...Ink with “superior” aetherial conductivity, you say? Haha, ain't nothin' ever simple with you, eh? Well, just so happens a shipment arrived from Thavnair not three days ago."},{"name":"ROWENA","text":"Auriana can fix you up with the stuff. We've got plenty in stock, so long as you've got Allagan Tomestone of Poetics to exchange for 'em."},{"name":"ROWENA","text":"Oh, an' in case you're wonderin', you won't find it elsewhere in Eorzea. I make a point o' bein' the sole supplier for whatever it is I sell─that's just good business, see."},{"name":"HUBAIRTIN","text":"Ah, you're back! Have you acquired three bottles of superior enchanted ink?"},{"name":"HUBAIRTIN","text":"Yes! This shall serve our purposes perfectly!"},{"name":"HUBAIRTIN","text":"With this ink, I shall draw arcanima patterns of power upon parchment to create a sphere scroll, the medium for storing materia-derived light energy!"},{"name":"HUBAIRTIN","text":"This, my friend, is the key to raising your relic to the next level of might."},{"name":"HUBAIRTIN","text":"We want for but the catalyst by which the power of materia may be converted into light and infused into the scroll─a rare stone known as alexandrite."},{"name":"HUBAIRTIN","text":"Being a variety of dark matter, alexandrite possesses light-altering properties. When placed beneath a light source, it bursts into a dazzling display of colors."},{"name":"HUBAIRTIN","text":"Owing to its singular beauty, alexandrite was highly prized by ancient civilizations, and so nigh every natural deposit has been exhausted."},{"name":"HUBAIRTIN","text":"However, the stone is known to emerge amongst hidden treasures─we just need to know where to look. It may behoove us to consult dealers of artifacts from bygone eras."},{"name":"HUBAIRTIN","text":"Gods, I cannot recall when last I felt so invigorated! Many and more things remain to be done, but <span class=\"emphasis\">any</span> sort of progress is better than none. Give me but a moment to gather my thoughts, and I shall resume my explanation."},{"name":"SYSTEM","text":"Sphere scrolls may be obtained from Hubairtin in exchange for bottles of superior enchanted ink."},{"name":"SYSTEM","text":"Each sphere scroll can be infused with up to five types of materia. Please note, however, that certain restrictions apply to quantity and variety."},{"name":"SYSTEM","text":"Furthermore, due to the unstable nature of materia-derived light energy, infusion attempts are known to fail occasionally."},{"name":"SYSTEM","text":"Furthermore, each infusion requires the use of a catalyst known as alexandrite. Alexandrite is yielded from treasure coffers whose locations are marked on <span class=\"highlight\">mysterious maps</span>."},{"name":"SYSTEM","text":"Mysterious maps can be obtained from Auriana at Revenant's Toll in exchange for Allagan tomestones. Completing a certain quest will also earn you a map."},{"name":"SYSTEM","text":"Alexandrite may also be obtained, albeit at a low probability, by participating in FATEs while equipped with your relic weapon (animus or beyond)."}],"reward":{"gil":939,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66972]},"next":[66676,67000]},"partials":[{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"npc","id":"1009151","obj":{"i":1009151,"n":"Hubairtin","l":43,"q":2}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1001425","obj":{"i":1001425,"n":"Mutamix Bubblypots","l":43,"q":5}},{"type":"item","id":"7885","obj":{"i":7885,"n":"Superior Enchanted Ink","l":1,"c":25923,"t":54}},{"type":"quest","id":"66972","obj":{"i":66972,"n":"Trials of the Braves","g":73,"l":"North Shroud","s":2,"f":1}},{"type":"quest","id":"66676","obj":{"i":66676,"n":"One Man's Trash","g":92,"l":"North Shroud","s":500,"f":1}},{"type":"quest","id":"67000","obj":{"i":67000,"n":"Star Light, Star Bright","g":73,"l":"Central Thanalan","s":4,"f":1}}]}