{"quest":{"name":"Picking Up the Sledge","location":"Mor Dhona","id":66991,"patch":2.3,"sort":52,"eventIcon":71201,"target":1009058,"involved":[1000997,1008974,1009059,1009060,1009061],"genre":0,"journal":["Slafborn is concerned for the Scions' receptionist.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Rising Stones.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","After convincing Tataru to confide to you her woes, you learn that the burgeoning fame and swelling ranks of the Scions are straining the organization's limited resources. Not one to bow before adversity, the determined administrator has been learning the mining trade in a bid to secure more revenue. Without the sledgehammer she commissioned from the Blacksmiths' Guild, however, Tataru fears her efforts will be far less fruitful. Head to Limsa Lominsa, and question Forgemaster Brithael about the failed delivery.","You ask Brithael about the sledgehammer, but the guildmaster is adamant that the tool in question was completed some time ago. He suggests you head south from the Octant until you find the porters responsible for its delivery, and express your /doubt in their work practices.","After interrogating one of the porters, you learn that Tataru's tool was simply lost in the shuffle. Search the piles of cargo, and find the sealed crate addressed to the Rising Stones receptionist.","You have liberated the box containing Tataru's sledgehammer from the forgetful porters. Make your way back to Revenant's Toll, and deliver the tool to F'lhaminn in the Rising Stones.","You return to the Rising Stones and entrust the sledgehammer to F'lhaminn. While impressed by Tataru's determination, the graceful Miqo'te is concerned that the wilds of Mor Dhona may prove too dangerous for the lone Lalafellin miner. Head out to her planned mining site northeast of the Tangle, and, with the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “Tataru” to attract the receptionist's attention.","You call out to Tataru, and hear an alarmed scream in response. Rush over to the panicked Lalafell and slay the threatening morbol before it has a chance to rend her limb from limb.","You have slain the malodorous morbol. Speak with Tataru and reassure her that the danger has passed.","Though none the worse for her ordeal, the shaken receptionist is eager to return to town. Head back to the Rising Stones and speak with Tataru.","You return to the Rising Stones, and are once more thanked by a grateful Tataru─this time for the delivery of her long-awaited sledgehammer. Swearing to never again wander the outskirts of Revenant's Toll alone, the able administrator is nevertheless still determined to raise enough coin to keep the Scions in business...not to mention blood currant tarts."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Minfilia at the Rising Stones.</span>"],"dialogue":[{"name":"SLAFBORN","text":"Gods, would you look at all those people. Seems they're carting in adventurers by the wagonload... And more than a few are eager to rap on the Scions' door."},{"name":"SLAFBORN","text":"I wonder if this constant flow of aspiring heroes is what has Tataru looking so perturbed. Might be she could use a friendly ear, hm?"},{"name":"SLAFBORN","text":"Tataru's expression grows ever darker each time I see her pass by. Perhaps you might hear her woes and lessen her burden some?"},{"name":"TATARU","text":"Hello, <span class=\"highlight\">Forename</span>, what might I─ Oh? Slafborn thought I could use a friend, did he?"},{"name":"TATARU","text":"What a sweet man, though I did not think my fretting so obvious. Well, I suppose there's no sense in hiding it now."},{"name":"TATARU","text":"'Tis time to reveal my little secret!"},{"name":"TATARU","text":"Hee hee! It quite suits me, don't you think? But 'tis not simply for show─I've been learning the mining trade!"},{"name":"TATARU","text":"<span class=\"emphasis\">Why</span>, you might ask? Ah, therein lies the source of my dour demeanor..."},{"name":"TATARU","text":"Ever since we relocated to the Rising Stones, the Scions of the Seventh Dawn have stepped out from behind the curtain, so to speak."},{"name":"TATARU","text":"Our victories over the Empire have granted us a certain degree of fame, and many budding adventurers have traveled from afar with the intention of joining our ranks. And while I welcome each new member that takes up our cause..."},{"name":"TATARU","text":"We. Have. Too. Little. Coin."},{"name":"TATARU","text":"As I'm sure you are aware, we are a strictly neutral organization. And ensuring that neutrality means limiting the funds we accept from outside sources."},{"name":"TATARU","text":"The Scions do receive various means of support from the three major nations, and the Leveilleur twins are quite generous with their family's coffers... Yet this modest income cannot keep pace with our day-to-day expenses."},{"name":"TATARU","text":"There is also the sundry donated materiel, of course. Those are delivered to the Adventurers' Guild, and swiftly allocated to the expansion of Revenant's Toll..."},{"name":"TATARU","text":"While I'll cheerfully leave the toppling of primals to you, 'tis <span class=\"emphasis\">my</span> duty to balance the books and fight the demons of debt! On my honor as receptionist, <span class=\"emphasis\">I</span> will raise the necessary coin with my own two hands!"},{"name":"TATARU","text":"I even paid for this sturdy mining attire out of my own purse!"},{"name":"TATARU","text":"Which makes it doubly aggravating that my custom-made sledgehammer has yet to arrive. I scrimped and saved especially for that tool..."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>. If you would help me see the Scions survive this fiscal disaster, then I would ask you to travel to the Blacksmiths' Guild in Limsa Lominsa and <span class=\"emphasis\">demand</span> they hand over my commission at once!"},{"name":"TATARU","text":"Oh, and regarding your travel expenses... I'll have to check our available funds."},{"name":"TATARU","text":"Once you have my sledgehammer, pray leave it with F'lhaminn. I shall be out digging up riches the best I can with the equipment I have. Crystal clusters, here I come!"},{"name":"TATARU","text":"The Blacksmiths' Guild must have finished my commission by now. Once you've managed to procure my sledgehammer, pray leave it in F'lhaminn's care─I shall be out in the field, unearthing what treasures I may!"},{"name":"BRITHAEL","text":"Well now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, what brings ye back to me forge? Got some new masterpiece o' smittin' to show me?"},{"name":"BRITHAEL","text":"What can I do fer ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? If yer lookin' to sign up, Randwulf over there'll run ye through the initiation..."},{"name":"BRITHAEL","text":"Eh? Yer here 'bout a commission? Somethin' weren't delivered?"},{"name":"BRITHAEL","text":"Now that is passin' strange. Unless 'twere an ale-induced dream, I'm fairly certain Mistress Tataru's tool were shipped off days ago. I'm not like to forget the forgin' of a sledge what needed flowers engraved on the head."},{"name":"BRITHAEL","text":"...Could be the porter met with misfortune on the road. If the blokes we employ are in town, then ye'd find 'em south o' the Octant, on one o' them empty landin's."},{"name":"BRITHAEL","text":"Seein' as we've heard naught one way or the other, though, I'd be of a mind to cast some <span class=\"highlight\">doubt</span> on their whole operation. Ugh, what an upsettin' business. I might need a pint or two to put it all behind me..."},{"name":"BRITHAEL","text":"The porters we employ stack their cargo on one o' them empty landin's south o' the Octant. If they're missin' deliveries, ye might want to direct some <span class=\"highlight\">doubt</span> at one of 'em to see how he holds up under the pressure."},{"name":"DELIVERYMAN01455","text":"Bugger off. I've work to do."},{"name":"DELIVERYMAN01455","text":"Ye havin' trouble hearin'!? I said, “bugger off”!"},{"name":"DELIVERYMAN01455","text":"Eh? A delivery from the smitties to Mor Dhona? How the bloody hells should I know!? I just haul the crates!"},{"name":"DELIVERYMAN01455","text":"...Hang on a moment. Ye said, “Mor Dhona,” aye? Me mate was meant to see a shipment up to Revenant's Toll a while back, but took ill just afore he was due to leave. “Not to worry,” I said, “I'll take it there me very own─”"},{"name":"DELIVERYMAN01455","text":"...Ah. Bugger it."},{"name":"DELIVERYMAN01455","text":"Well, we got bleedin' busy, didn't we! An' I figured someone'd come lookin' if their precious package didn't arrive, anyroad! An' here ye are! The crate ye want is back there someplace, marked an' all. Ye can grab it yer own self!"},{"name":"DELIVERYMAN01455","text":"Gods, yer still here? Look, I told ye where to find the crate. What more do ye want!?"},{"name":"FLHAMINN","text":"Greetings, <span class=\"highlight\">Forename</span>. Tataru made mention of a missing delivery. Were you able to coax her commission from the Blacksmiths' Guild?"},{"name":"FLHAMINN","text":"Wonderful. I shall keep it here with me until Tataru returns from her mining expedition."},{"name":"FLHAMINN","text":"She is not one to approach matters by half, is she? The Rising Stones couldn't ask for a more able administrator."},{"name":"FLHAMINN","text":"Still, I am somewhat worried for her well-being. I realize Tataru means to mine and naught more, but even the outskirts of Revenant's Toll are not free of prowling dangers."},{"name":"FLHAMINN","text":"Would you mind tracking down our industrious Lalafell and see that she has not come to harm? As far as I'm aware, Tataru intended to start her digging in the hills near the Tangle─you may have to call out to attract her attention."},{"name":"SYSTEM","text":"Tataru is to be found mining northeast of the Tangle. First, make your way to the destination marker."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains the name “Tataru” to attract the receptionist's attention."},{"name":"FLHAMINN","text":"Would you mind tracking down Tataru and seeing that she has not come to harm? She planned to mine in the hills near the Tangle─you may have to call out to attract her attention."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains the name “Tataru” to attract the receptionist's attention."},{"name":"TATARU","text":"Breaking rock and splitting stone,♪<br>I'll raise a fortune on my own!♪"},{"name":"TATARU","text":"Delving deep for precious ore,♪<br>I'll take a rest, then dig some more!♪"},{"name":"TATARU","text":"Toss aside the pebbles!♪<br>Toss aside the dirt!♪<br>Toss aside the Scions who shirk! Their! Work!♪"},{"name":"TATARU","text":"Phew...<br>I think I'll call it a day."},{"name":"TATARU","text":"I'll make much better progress once <span class=\"highlight\">Forename</span> brings back my sledgehammer."},{"name":"TATARU","text":"Yes... I might even make enough money to indulge a little! Mmm, blood currant tarts for morning tea, every single day!"},{"name":"TATARU","text":"Hm? Was that someone calling my name?"},{"name":"TATARU","text":"Uwaaah!"},{"name":"TATARU","text":"Ohgodsohgodsohgodsohgods! Save meee!"},{"name":"TATARU","text":"Great Twelve above! I thought I'd eaten my last currant tart for a moment there!"},{"name":"TATARU","text":"Thank you ever so much!<br>...I believe 'tis past time I returned to the Rising Stones."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, I must thank you again! I received my commission from F'lhaminn─the floral engraving is absolutely perfect!"},{"name":"TATARU","text":"After nearly becoming dinner for a morbol, though, I'm not so eager to head back out into the field."},{"name":"TATARU","text":"In any case, no more solo mining trips for me! I shall be sure to drag along one or two handy adventurer types to serve as bodyguards."},{"name":"TATARU","text":"I suppose I'll have to pay them, though... Well, no matter! That simply means I'll need to dig twice as hard!"},{"name":"POPMESSAGE","text":"A sickly-sweet odor overwhelms you..."},{"name":"POP","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"Tataru"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66990]}},"partials":[{"type":"npc","id":"1009058","obj":{"i":1009058,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1008974","obj":{"i":1008974,"n":"F'lhaminn","l":481,"q":1}},{"type":"npc","id":"1009059","obj":{"i":1009059,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1009060","obj":{"i":1009060,"n":"Tataru","l":67,"q":1}},{"type":"npc","id":"1009061","obj":{"i":1009061,"n":"Prickly Porter","l":29,"q":1}},{"type":"quest","id":"66990","obj":{"i":66990,"n":"A Hard Hapalit to Break","g":0,"l":"The Rising Stones","s":51}}]}