{"quest":{"name":"Brave New Companions","location":"Mor Dhona","id":66996,"patch":2.3,"sort":57,"icon":100257,"eventIcon":71201,"issuer":1006530,"target":1008969,"involved":[1008997,1009021,1009141,1009142,1009143,1009144,1009145,1009146,1009147,1009148],"genre":2,"journal":["Slafborn has news on the progress of the inaugural ceremony.","Slafborn informs you that the preparations for the inaugural ceremony are almost complete. He is concerned, however, that Tataru yet seems buried under a mountain of small details. Head into the Rising Stones and offer your aid to the harried receptionist.","Tataru appears overjoyed at your offer of help, and wastes no time in assigning you a task. Track down the recruits waiting around Revenant's Toll, and present them with their new uniforms.","You have delivered the ultramarine uniforms to the waiting recruits, some of whom you meet for the first time. Return to the Rising Stones and report to Alphinaud.","You return to Alphinaud, and the young Scion proclaims the inaugural ceremony ready to begin. After taking his place before the assembled─and newly garbed─recruits, Alphinaud launches into an impassioned speech. He reiterates their mission to protect Eorzea, and at last reveals the name he has chosen for the trial company: the Crystal Braves. As the cheers die down, Minfilia congratulates Crystal Brave Commander Leveilleur on the culmination of his hard work. Speak with the Antecedent and discuss what is to come.","Though enthusiastic about the formation of the Crystal Braves, Minfilia's jubilance is muted by a grave concern─the prolonged silence of the Mothercrystal. After confirming her suspicions, the Antecedent realizes that Hydaelyn has spoken to neither of you since the final battle with the Empire. Just as it seems Eorzea will at last win free of the Calamity's stifling shadow, another darkness gathers to cast its ominous pall across the land..."],"objectives":["Speak with Tataru in the Rising Stones.","Present the uniforms to the recruits.","Speak with Alphinaud in the Rising Stones.","Speak with Minfilia."],"dialogue":[{"name":"SLAFBORN","text":"While you were away in Coerthas, preparations for the inaugural ceremony were all but completed. ...Although Tataru does yet seem somewhat flustered."},{"name":"SLAFBORN","text":"I've taken enough of your time. Why don't you head into the Rising Stones and see if your frantic receptionist could do with a hand?"},{"name":"SLAFBORN","text":"Tataru yet seemed buried in details for the upcoming ceremony. I imagine she might appreciate the aid of a reliable adventurer..."},{"name":"TATARU","text":"These parchments need to be sorted, and <span class=\"emphasis\">these</span> documents...<span class=\"emphasis\">why are they even here</span>!? Oooh! I am sorely tempted to file the lot in my wastepaper basket!"},{"name":"TATARU","text":"Ah! <span class=\"highlight\">Forename</span>! You startled me! You...you wish to lend a hand? Splendid!"},{"name":"TATARU","text":"Would you be a dear and hand these uniforms to the new recruits? They're scattered about Revenant's Toll and I haven't the time to track them all down!"},{"name":"TATARU","text":"The recruits know to don their garb immediately and assemble here in the Rising Stones. You'll want to report directly back to Alphinaud if you don't wish to miss the ceremony!"},{"name":"TATARU","text":"I wonder if the Scions will ever have matching uniforms... A well-funded organization is a well-dressed organization, I suppose!"},{"name":"TATARU","text":"Once you are done delivering the uniforms to the recruits, pray report back to Alphinaud. The ceremony is almost ready to begin!"},{"name":"LAURENTIUS","text":"I thought it best to mimic my fellows here, but I admit that I have no idea what we're supposed to be doing..."},{"name":"LAURENTIUS","text":"Ah! Our new uniforms! I am reminded of my induction into the Wood Wailers..."},{"name":"LAURENTIUS","text":"Hmmm... No, I fail to see what so engages their attention."},{"name":"YUYUHASE","text":"Those who believe this company will see no riches are shortsighted fools. The giving of oneself 'tis an investment in the future─thus did I sign my name to the cause."},{"name":"YUYUHASE","text":"These uniforms were a splendid idea. Once our organization has made a name for itself, there shall be wealth aplenty in selling replica costumes to the adoring masses."},{"name":"YUYUHASE","text":"I began as a humble aetheryte guard, yet as you have witnessed, I stand poised to join the rise of a glorious new order. Where before my pockets were empty, now shall they bulge with coin!"},{"name":"AERGMHUS","text":"This scarlet garb marks me as a proud member of the Maelstrom, and a hearty defender of Limsa Lominsa! Yet in truth, I stand for the betterment of the realm, and thought this new company a fine opportunity to contribute on a grander scale."},{"name":"AERGMHUS","text":"Oho, now that's a striking shade of blue! Put alongside my Maelstrom uniform, my wardrobe will certainly not lack for color!"},{"name":"AERGMHUS","text":"Forgive me for shedding the red, Admiral! But I must devote my efforts to the greatest good!"},{"name":"ILBERD","text":"I don't believe we've met. I am Ilberd, and I will have the honor of leading my fellow recruits as captain. Much did I lose to the Calamity, and I look forward to aiding others in rebuilding their lives."},{"name":"ILBERD","text":"The uniforms are a shrewd decision. There is no easier method of creating a common bond among what is, essentially, a band of strangers."},{"name":"ILBERD","text":"I was barely more than a refugee myself for a time, and I know what it is to be without hope. I shall do my utmost to see this company succeed..."},{"name":"EPHEMIE","text":"<span class=\"highlight\">Forename Surname</span>!? Gods, I did not expect to meet you strolling about town! The tales of your primal battles were what inspired me to come to Revenant's Toll."},{"name":"EPHEMIE","text":"'Tis an honor to receive this uniform from your hands. I shall wear it with pride!"},{"name":"EPHEMIE","text":"I have followed the deeds of the Scions with the greatest awe and admiration. To fight at your side has long been a dream that I can scarce believe is coming true."},{"name":"WILRED","text":"Little Ala Mhigo could learn much from Revenant's Toll. That this town can be so alive in the midst of such desolation..."},{"name":"WILRED","text":"...I've never worn aught quite so voluminous. Well, I'm sure I'll grow accustomed to the extra cloth in time."},{"name":"WILRED","text":"'Tis not that I enjoy baring my skin, you understand. Thanalan was simply very hot. &lt;sigh&gt; Never mind..."},{"name":"RIOL","text":"Hello there, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Lookin' for me, was ye? I'd suggest givin' a whistle, but I'm not sure as I'd hear it amongst all the bustle."},{"name":"RIOL","text":"Oho! Proper uniforms an' all! This thing'll cut off the blood to me head... Not to worry, though! I'm sure she'll be fine after makin' a few adjustments!"},{"name":"RIOL","text":"Here's hopin' I don't run across any o' me old mates wearin' this outfit. I'll have their laughter ringin' in me ears for days!"},{"name":"ALIANNE","text":"Isildaure has at last retired from the adventurer's life. Though I shall miss his wisdom and irrepressible spirit, I am excited to forge my own path forwards."},{"name":"ALIANNE","text":"Ah, yes, the uniform! Thank you! Truth be told, the thought of pledging myself to such a lofty organization is somewhat intimidating..."},{"name":"ALIANNE","text":"Do the others have their uniforms already? I should really be on my way before the ceremony begins. I will make you proud, Isildaure!"},{"name":"ALPHINAUD","text":"Yes, <span class=\"highlight\">Forename</span>? Ah, Tataru mentioned you were handing out the new uniforms. I assume you've now met the rest of the recruits?"},{"name":"ALPHINAUD","text":"Some few answered the call to arms I put forth through the established Grand Companies and such. We are not yet an army, but there is much a small corps of elite warriors can achieve."},{"name":"ALPHINAUD","text":"...Did I mention I'd thought of a name for the company? 'Tis my hope that it shall soon be known across the breadth of Eorzea."},{"name":"ALPHINAUD","text":"The moment of truth draws near, <span class=\"highlight\">Forename</span>. Once the last of the recruits have gathered, I shall make the official announcement."},{"name":"HAURCHEFANT","text":"Very good. See that the provisions are prepared for transport. Let us hope that this shipment is spared the fate of the last."},{"name":"HAURCHEFANT","text":"The winds are uncommon fierce this day..."}],"reward":{"gil":7000,"items":[{"id":7320,"one":1},{"id":7330,"one":1},{"id":7340,"one":1},{"num":2,"id":5825,"one":1}],"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66995]},"next":[65588,67066]},"partials":[{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1008969","obj":{"i":1008969,"n":"Minfilia","l":481,"q":19}},{"type":"npc","id":"1008997","obj":{"i":1008997,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1009021","obj":{"i":1009021,"n":"Alphinaud","l":481,"q":3}},{"type":"npc","id":"1009141","obj":{"i":1009141,"n":"Riol","l":67,"q":1}},{"type":"npc","id":"1009142","obj":{"i":1009142,"n":"Wilred","l":67,"q":1}},{"type":"npc","id":"1009143","obj":{"i":1009143,"n":"Laurentius","l":67,"q":1}},{"type":"npc","id":"1009144","obj":{"i":1009144,"n":"Alianne","l":67,"q":1}},{"type":"npc","id":"1009145","obj":{"i":1009145,"n":"Aergmhus","l":67,"q":1}},{"type":"npc","id":"1009146","obj":{"i":1009146,"n":"Ephemie","l":67,"q":1}},{"type":"npc","id":"1009147","obj":{"i":1009147,"n":"Yuyuhase","l":67,"q":1}},{"type":"npc","id":"1009148","obj":{"i":1009148,"n":"Ilberd","l":67,"q":1}},{"type":"item","id":"7320","obj":{"i":7320,"n":"Auroral Coif","l":110,"c":40430,"t":34}},{"type":"item","id":"7330","obj":{"i":7330,"n":"Daystar Circlet","l":110,"c":40660,"t":34}},{"type":"item","id":"7340","obj":{"i":7340,"n":"Evenstar Hat","l":110,"c":41198,"t":34}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66995","obj":{"i":66995,"n":"When the Cold Sets In","g":2,"l":"Coerthas Central Highlands","s":56}},{"type":"quest","id":"65588","obj":{"i":65588,"n":"Traitor in the Midst","g":2,"l":"The Rising Stones","s":58}},{"type":"quest","id":"67066","obj":{"i":67066,"n":"Judgment Bolts and Lightning","g":13,"l":"Gridania","s":6,"f":1}}]}