{"quest":{"name":"Marvelously Mutable Materia","location":"Central Thanalan","id":66999,"patch":2.25,"sort":190,"unlocksFunction":1,"eventIcon":71341,"issuer":1001428,"target":1001425,"genre":93,"journal":["Kokosamu would share news of his master's latest advance in the arcane art of materia manipulation.","As Kokosamu tells it, Master Mutamix has developed a method for combining multiple pieces of unneeded materia to give them new form and life─a procedure known as transmutation. He encourages you to speak with the esteemed goblin scholar, that you might enlighten yourself as to the specifics.","While the precise process of materia transmutation is too complex to be imparted to a layman, Mutamix generously offers to perform the procedure whenever you so desire. To take the goblin up on his offer, you need only bring him five pieces of unwanted materia."],"objectives":["Speak with Mutamix."],"dialogue":[{"name":"KOKOSAMU","text":"Riddle me this, friend─have ye ever found yerself in the unfortunate situation where yer pockets were near to burstin' with all manner o' materia, save for the sorts ye wanted the most?"},{"name":"KOKOSAMU","text":"Well, <span class=\"emphasis\">I</span> have, and I tell ye, it felt like I'd brought a sack full o' fishin' poles to a gold mine. Now, I ask ye: what if there were a way to melt down a couple pieces of materia that weren't availin' you naught, and mold them into a shiny new piece that─Nymeia willin'─just might strike yer fancy?"},{"name":"KOKOSAMU","text":"Now, if yer as sharp as I reckon ye are, ye can already see where I'm headin' with this. Aye, that's right─thanks to Master Mutamix, now ye can do just that! Or at least, Master Mutamix can do it for ye."},{"name":"KOKOSAMU","text":"This most handy procedure is somethin' we like to call <span class=\"emphasis\">shifty-makin'</span>. Rather, that's what Master Mutamix calls it. Meself, I've coined the term <span class=\"emphasis\">transmutation</span>, which I'm hopin' might find favor with adventurers like yerself."},{"name":"KOKOSAMU","text":"How's it all work, ye ask? I could tell ye, but why ask the student when ye can learn from the master? You'll find Mutamix right over there, likely jumpin' out of his boots lookin' to trade tongueflaps about his discovery."},{"name":"MUTAMIX","text":"Pshhh... Shkohhh...<br>Uplander seeks knowings of shifty-making, yes? Then uplander should make openears to tongueflaps of Mutamix."},{"name":"MUTAMIX","text":"Process of shifty-making is of big help-use. First, be taking five need-not materia, yes? Melty-mix this one, mixy-melt that one, squeeze and squash, then bigeyes! Five need-not are reborn as one shiny-new!"},{"name":"MUTAMIX","text":"Shkohhh! But shifty-making is not simple like crafty-making. Knowings of shifty-making are much and many, and uplander's braincase─though big for uplander─is small."},{"name":"MUTAMIX","text":"Uplander need not be making worry-face. If uplander has many need-not materia, bring them to tent-ring. Mutamix will shifty-make for uplander!"},{"name":"SYSTEM","text":"Mutamix will perform materia transmutation for you at any time, free of charge. Bring the goblin five pieces of unwanted materia, and he will transmute them into a single new piece to use as you see fit."},{"name":"SYSTEM","text":"That said, materia transmutation remains an inexact science. As for what manner of materia will emerge each time Mutamix works his wonders, not even the goblin genius himself can say."}],"reward":{"gil":227,"xp":1960},"reqs":{"jobs":[{"lvl":19,"id":1}],"quests":[65808]}},"partials":[{"type":"npc","id":"1001428","obj":{"i":1001428,"n":"Kokosamu","l":43,"q":2}},{"type":"npc","id":"1001425","obj":{"i":1001425,"n":"Mutamix Bubblypots","l":43,"q":5}},{"type":"quest","id":"65808","obj":{"i":65808,"n":"Life, Materia and Everything","g":1,"l":"The Waking Sands","s":104}}]}