{"quest":{"name":"Clutching at Straws","location":"East Shroud","id":67005,"patch":2.35,"sort":5,"icon":100267,"eventIcon":71221,"issuer":1005565,"target":1005937,"involved":[1005940,1005946,1009154,1009197],"genre":62,"journal":["Voyce has been thinking about the disappearance of the sylph podlings.","Following a sequence of questionable deductions, Voyce concludes that the podlings were spirited away by a rogue band of pirates, and suggests that you pick up the trail in La Noscea. Make for the Drowning Wench in Limsa Lominsa and deliver the scholar's missive to his colleague, a marine researcher by the name of Guston who should be able to aid you in your search.","Utterly unable to decipher Voyce's chocobo scratches, Guston is nonetheless able to provide you with some intriguing information regarding a suspicious personage sighted at the docks not long ago. Seek out more information from the researcher's son Robyn in Fisherman's Bottom.","Robyn quickly recognizes you as the adventurer who assisted him in delivering a necklace to the kind fishmen who rescued him. The reunion serving to jog his memory, he suspects that the unsavory man is targeting his scaled friends. Return to Novv's Nursery to see that the peaceful Sahagin come to no harm, and bring along Robyn's gift─a sack of juicy oranges favored by the fishmen─for good measure.","Novv's rejoicing at the sight of the juicy citruses is interrupted by the ever-excitable Seww, who is distraught at the apparent kidnapping of his young spawnbrother Bouu. Could the culprit be the same man responsible for the disappearance of the podlings from Little Solace? Make way to the scene of the crime─Moonshade Isle─by elbst, and fend off adversaries as necessary to secure a vantage point from which you may scan the waters for the kidnapper's escape vessel.","You manage to locate the kidnapper's vessel, which is swiftly making its way out to sea. As you and Seww curse your luck, Novv is quick to take action. In the blink of an eye, the clutchfather emerges from the sea to stand before his son's abductor─a menacing Miqo'te wearing a mask of metal. When an ill-timed collision with a protruding rock causes Bouu to lose his balance, the feline felon is quick to take advantage of the situation. As Novv moves to shield his spawnling, three daggers strike the Sahagin clear in the back. Seww dives swiftly into the waters to save his clutchfather, urging you to return to the nursery to prepare to tend to Novv's wounds.","Perhaps it is paternal instinct and a desire to see his son returned to safety that gives Novv his strength, for the clutchfather is not much worse for the wear despite the wounds he suffered at the hands of the kidnapper. Novv fumes at the indignity his clutch has suffered. Who is this Miqo'te marauder, and what does he hope to accomplish from robbing the cradles of the beast tribes? The plot ever thickens..."],"objectives":["Deliver Voyce's letter to Guston in Limsa Lominsa.","Speak with Robyn at Fisherman's Bottom.","Deliver the juicy oranges to Novv at Novv's Nursery.","Fend off adversaries on Moonshade Isle and survey the waters.","Report to Novv at Novv's Nursery."],"dialogue":[{"name":"VOYCE","text":"It would appear that there is more to the disappearance of the podlings than I originally suspected. But where to turn next? Allow me to apply the scientific method to analyze the situation."},{"name":"VOYCE","text":"The girl Sylvie said that the touched ones were not responsible for the crime. As the sylphs of Little Solace would have no reason to kidnap their own, we can safely deduce that the perpetrator is not a sylph at all! Do you follow me thus far?"},{"name":"VOYCE","text":"You also say that the girl mentioned La Noscea, and that she must travel there “before tragedy strikes again”...? Good gods! Are you thinking what I'm thinking!?"},{"name":"VOYCE","text":"Pirates! Yes, pirates have stolen the podlings to sell on the black markets! Those scurvy, thieving scoundrels!"},{"name":"VOYCE","text":"Fortunately for us all, I just so happen to have an acquaintance in the area. A colleague, I should say─he is a naturalist specializing in marine life."},{"name":"VOYCE","text":"He goes by the name Guston─primarily, I suspect, because that is his actual name. You'll likely find him at the Drowning Wench. He often said his ideas flow most readily after a pint of Baderon's best."},{"name":"VOYCE","text":"You simply rescue the little ones from the clutches of those dastardly pirates! Seek out my colleague Guston in the Drowning Wench. He knows La Noscea almost as well as I know the Twelveswood!"},{"name":"GUSTON","text":"The seas are angry today, friend, the waves ten spars 'igh if they were a fulm. Ye'll be stayin' in port if ye know what's─hm? Not a sailor, but an adventurer, ye say?"},{"name":"GUSTON","text":"Sent by Voyce, ye say? Llymlaen take me─I journeyed 'alfway 'cross the realm in the 'opes o' riddin' meself of that barnacle-brained lubber!"},{"name":"GUSTON","text":"Fortunately for you and yer bunglin' friend, ye've caught ol' Guston in a good mood. So entertain me: what's that bloody fool gotten 'imself into this time?"},{"name":"GUSTON","text":"...Is this supposed to tell me somethin'? This letter looks like it was penned by an 'alf-drunk chocobo! If ye'd be so kind, spare me the 'eadache and give me the details yerself."},{"name":"GUSTON","text":"A mass kidnappin' o' baby sylphs, and that bloody 'alf-wit thinks it was <span class=\"emphasis\">pirates</span> what done the deed!? Bwahahaha! That sounds...just crazy enough to be true."},{"name":"GUSTON","text":"I was at the docks not a few bells ago when I spied an unfamiliar face. The man 'ad just acquired a vessel, it seemed, and if me ears 'eard true, was lookin' to sail for 'Alfstone amidst a fierce fog."},{"name":"GUSTON","text":"A scholar with a face like mine ain't gonna be one to judge by appearances, but I didn't like the cut o' this man's jib, if ye gather me meanin'."},{"name":"GUSTON","text":"Mind ye, I didn't speak to the blighter meself. Me son Robyn 'ad a few words with 'im, though, and didn't seem to enjoy the experience none."},{"name":"GUSTON","text":"If ye'd speak with 'im for yerself, ye'll find 'im at the docks. Seems 'is adventure under the sea 'asn't dampened 'is passion to follow in 'is old man's footsteps."},{"name":"GUSTON","text":"Me son Robyn 'ad a few words with the blighter. If ye'd speak with 'im yerself, ye'll find 'im at the docks like as not."},{"name":"ROBYN","text":"Hey, I remember you! You're the adventurer who returned that necklace to the nice fishmen for me!"},{"name":"ROBYN","text":"You <span class=\"emphasis\">did</span> return it, didn't you? They were so nice to me, after all. I just had to do something nice for them, too."},{"name":"ROBYN","text":"Wonderful! I knew I could count on you. What's that, you say? Father told you about some strange man at the docks?"},{"name":"ROBYN","text":"Aye, I saw him, I did. He was wearing some strange metal mask. At least I hope it was a mask─it looked more like a part of his face."},{"name":"ROBYN","text":"He said he had a score to settle with Novv. Novv...? Novv..."},{"name":"ROBYN","text":"Of course! I didn't remember until I saw your face, but the nice fishmen that saved me...one of them was named “Novv”! I'm sure of it!"},{"name":"ROBYN","text":"Are the nice fishmen in danger? P-Please tell me you'll go and make sure they're safe. And bring them this─tell them it's a thank-you gift from Robyn."},{"name":"ROBYN","text":"Someday I'll be a researcher like my dad. I'll live with the fishmen, and they'll show me deep-sea secrets that no one's seen before!"},{"name":"NOVV","text":"Pshhh... Are my eyesss to be believed!?"},{"name":"NOVV","text":"Yesss, <span class=\"highlight\">Forename</span> returnsss! What brings my shorewalking spawnling back to the clutch?"},{"name":"NOVV","text":"Oh-ren-jez? Thisss is a true delight. Ever sssince the last batch you brought, my ssspawnlings clamor endlessly for more."},{"name":"NOVV","text":"A present from the finless child? This pleases me greater ssstill. Yes, perhapsss a new generation brings hope for peace between our peoples..."},{"name":"SEWW","text":"Pshhh! Clutchfather! I need your counshhhel!"},{"name":"NOVV","text":"Pshhh... Do you ssso quickly forget, Seww? A Sssahagin does not thrash against the currentsss─he is one with the water, flowing as it flows."},{"name":"SEWW","text":"Forgive me, Clutchfather, I─ Pshhh! It is Bouu, our youngeshhht brother!"},{"name":"NOVV","text":"Wh-What of him!?"},{"name":"SEWW","text":"Pshhh! H-He...he was shhhpearfishing at Moonshhhade Isle, and then...and then he was gone, shhhpirited away by a shhhorewalker!"},{"name":"NOVV","text":"Pshhh... Why...? All I and my spawnlings ssseek is to live in peace..."},{"name":"NOVV","text":"<span class=\"highlight\">Forename</span>. You were the first finless one to prove yourssself a friend to my clutch. I would asssk you to accompany me to Moonshade Isle."},{"name":"NOVV","text":"I have no desire to turn my ssspear against the shhhorewalkers. But I shall defend my ssspawnlings with my life. Travel on ahead, friend─I shall ssswim along shortly."},{"name":"NOVV","text":"Pshhh... Our more sssavage brethren oft herd finless ones to the depths, drowning their souls before the Lord of the Whorl. Does this shhhorewalker who sssteals my spawnlings have equally sssinister aims?"},{"name":"SEWW","text":"Pshhh! There is no time to spare! The shhhorewalker steals away with young Bouu as we shhhpeak!"},{"name":"SEWW","text":"The shhhwiftest way to Moonshade Isle is to take one of Pahh's elbshhhts...but you know this, yes? Hurry, my <span class=\"alternative-container\"><span class=\"alternative\">shhhpawnsister</span><span class=\"alternative\">shhhpawnbrother</span></span>!"},{"name":"TAMER01376","text":"Pshhh... Your concern for our ssspawnbrother is most touching, finless one. May my finest elbssst guide you true!"},{"name":"Q1","text":"Mount the elbst?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"TAMER01376","text":"Pshhh. Bouu is but a defenseless ssspawnling, finless one. Prepare as you mussst, but pray do so ssswiftly!"},{"name":"Q2","text":"Return to Novv's Nursery?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"SEWW","text":"Pshhh! Over there! Do you see!?"},{"name":"SEWW","text":"Curshhhes! While we had our fins full with those shhhmall fry, he's fled clear out to shhhea!"},{"name":"SEWW","text":"Bouu is among the youngeshhht of us─his gills have not yet taken form, and his limbshhh have been bound by the finleshhh one. If he is cast into the waters, he will drown like a shhhorewalker!"},{"name":"NOVV","text":"Pshhh! I have come for my child, finless one!"},{"name":"NHAZAAJAAB","text":"(-Menacing Miqo'te-)...So you have. Most impeccable timing, if I say so myself. Heh heh heh..."},{"name":"BOUU","text":"P-Pshhh...!?"},{"name":"BOUU","text":"Pshhh! S-Save me, Clutchfather!"},{"name":"NHAZAAJAAB","text":"...All too easy."},{"name":"SEWW","text":"C-Clutchfather! Noooooo!!!"},{"name":"NHAZAAJAAB","text":"(-Menacing Miqo'te-)...Hmph. So much for the mighty Sahagin. For all your prideful posturing, in the end, you are naught but beasts. Know your place, and spare yourself any further suffering."},{"name":"SEWW","text":"Pshhh! Be shhhtrong, Clutchfather! Your son comes for you!"},{"name":"SEWW","text":"These waters are too deep for a shhhorewalker. Leave the clutchfather's reshhhcue to me─return to the nursery and tell my shhhpawnbrothers to prepare to tend to his wounds."},{"name":"NOVV","text":"Pshhh... Worry not, <span class=\"highlight\">Forename</span>. It is but a fleshhh wound, and worse have I sssuffered."},{"name":"NOVV","text":"No, it is the dishhhonor of failing to protect my child that cuts truly deep."},{"name":"NOVV","text":"This masked shhhorewalker who would sssteal my child from me─he will anssswer for his crimes. Yes, I must...pshhh... I must ressst for a while."},{"name":"SEWW","text":"Kidnapping my spawnbrother, shhhtriking at the clutchfather...that furred finless one makes a mockery of us all! I will not shhhuffer this dishonor!"},{"name":"SEWW","text":"And yet...such shhhtrength! How can we hope to shhhtand against such a foe? Pshhh..."},{"name":"POPMESSAGE","text":"You sense a hostile presence!"}],"reward":{"gil":1502,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67004]},"next":[67006]},"partials":[{"type":"npc","id":"1005565","obj":{"i":1005565,"n":"Voyce","l":55,"q":6}},{"type":"npc","id":"1005937","obj":{"i":1005937,"n":"Novv","l":33,"q":8,"t":"Clutchfather"}},{"type":"npc","id":"1005940","obj":{"i":1005940,"n":"Seww","l":33,"q":13}},{"type":"npc","id":"1005946","obj":{"i":1005946,"n":"Pahh","l":33,"q":13,"t":"Seabeast Tamer"}},{"type":"npc","id":"1009154","obj":{"i":1009154,"n":"Robyn","l":29,"q":1}},{"type":"npc","id":"1009197","obj":{"i":1009197,"n":"Guston","l":28,"q":1}},{"type":"quest","id":"67004","obj":{"i":67004,"n":"Little Sylphs Lost","g":62,"l":"Gridania","s":4}},{"type":"quest","id":"67006","obj":{"i":67006,"n":"Digging for Answers","g":62,"l":"Western La Noscea","s":6}}]}