{"quest":{"name":"Call of the Wild (Immortal Flames)","location":"Ul'dah","id":67003,"patch":2.35,"sort":3,"eventIcon":71221,"issuer":1001634,"target":1000193,"genre":62,"journal":["Mimio would commend you for your work among the disparate tribes of Eorzea, and entreat your further aid.","Lieutenant Mimio Mio expresses her gratitude for your accomplishments, which have laid the groundwork upon which enduring peace with the beast tribes of Eorzea may one day be achieved. Valuing your diplomatic skills highly, she would seek your aid with an important task. Inquire with Lieutenant Gavin of Gridania's Order of the Twin Adder as to the details.","Lieutenant Gavin is heartened by your presence, having heard of your peace-building exploits with the beast tribes. To learn more of the task the Twin Adder would entrust to you, speak with the lieutenant anew."],"objectives":["Speak with Gavin at the Adders' Nest in Gridania."],"dialogue":[{"name":"MIMIO","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>! Tales of your exploits with the lizardmen have been tearing through these halls like wildfire."},{"name":"MIMIO","text":"This realm has no dearth of adventurers capable of cutting down a beastman or two, but those with the aptitude and inclination to pave the road to peace are few and far between."},{"name":"MIMIO","text":"...And you have come at a most opportune time. The Order of the Twin Adder has need for an able ambassador, and I can think of none more suited to the task."},{"name":"MIMIO","text":"Our contact in Gridania is one Lieutenant Gavin. Seek him out at the Adders' Nest, and he will brief you on the particulars of the mission."},{"name":"MIMIO","text":"Our contact in Gridania is one Lieutenant Gavin. Seek him out at the Adders' Nest, and he will brief you on the particulars of the mission."},{"name":"GAVIN","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>! What I'd not give to hear of your adventures with the beastmen over a flagon of mead!"},{"name":"GAVIN","text":"...And yet I fear that more pressing matters demand our attention today. When you are ready for your briefing, simply say the word."}],"reward":{"gil":525,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1001634","obj":{"i":1001634,"n":"Mimio Mio","l":40,"q":3,"t":"Flame Lieutenant"}},{"type":"npc","id":"1000193","obj":{"i":1000193,"n":"Gavin","l":52,"q":6}}]}