{"quest":{"name":"Star Light, Star Bright","location":"Central Thanalan","id":67000,"patch":2.28,"sort":4,"unlocksFunction":1,"eventIcon":71341,"issuer":1009151,"target":1008948,"genre":73,"journal":["Hubairtin can barely contain his excitement at the prospect of enhancing your relic weapon animus.","Hubairtin has offered to prepare as many sphere scrolls as you desire, so long as you furnish him with the required quantity of superior enchanted ink. Having explained the materia-infusion process in detail, the young arcanist bids you report to Jalzahn at Hyrstmill in the North Shroud, that the wizened alchemist might lend his formidable knowledge to the cause.","Jalzahn is impressed by Hubairtin's ingenuity, and expresses confidence that he will be able to finish what the young arcanist has started. For now, it falls to you to fully infuse the sphere scroll. If you would wield a mightier relic, see the deed done, then present the scroll to Jalzahn.<br><br>※Each materia infusion requires the use of alexandrite, a catalyst yielded from treasure coffers whose locations are marked on <span class=\"highlight\">mysterious maps</span>.<br>※Mysterious maps can be obtained from Auriana at Revenant's Toll in exchange for Allagan tomestones, or by completing a certain quest. Alexandrite may also be obtained by participating in FATEs while equipped with your relic weapon (animus or beyond).<br>※The enhancement process will raise your relic weapon animus's strength, dexterity, vitality, intelligence, and mind attributes to a value befitting gear of item level 110. Attributes that remain will be replaced with the ones infused into the sphere scroll. In the case of Thyrus Animus and Omnilex Animus, base direct hit rate will not be replaced."],"objectives":["Speak with Jalzahn at Hyrstmill."],"dialogue":[{"name":"HUBAIRTIN","text":"Using the superior enchanted ink you bring, I shall prepare a sphere scroll bearing arcanima patterns for enhancing your relic."},{"name":"HUBAIRTIN","text":"Your task will then be to acquire suitable varieties of materia, along with the pieces of alexandrite by which to convert and infuse their spiritual energy."},{"name":"HUBAIRTIN","text":"When the sphere scroll is fully infused, the time will be ripe for its power to be bonded with your relic. The overseeing of this final step, I shall leave to Master Jalzahn."},{"name":"HUBAIRTIN","text":"Now, as you go about infusing materia, you may well undergo a change of heart. If you wish to have any infusion removed, bring the scroll in question to me, and I will see the deed done."},{"name":"HUBAIRTIN","text":"Lastly, pray relay to Master Jalzahn all that you have learned from me. His wealth of knowledge, I believe, will be instrumental to our success."},{"name":"SYSTEM","text":"Sphere scrolls may be obtained from Hubairtin in exchange for bottles of superior enchanted ink."},{"name":"SYSTEM","text":"Similarly, if you wish to undo the infusion process, you may do so by speaking with Hubairtin."},{"name":"SYSTEM","text":"In order to receive the quest “Star Light, Star Bright,” you must be equipped with a relic weapon animus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"SYSTEM","text":"In order to advance the quest “Star Light, Star Bright,” you must be equipped with a relic weapon animus. Paladins must be equipped with both Curtana and the Holy Shield."},{"name":"JALZAHN","text":"Welcome back, my friend. By your triumphant expression, I take it you have found a way to enhance your relic with materia."},{"name":"JALZAHN","text":"...Converting the spiritual energy into light for collective transference? A truly inspired idea! While I am not one to count my dodos before they hatch, based on my experience, I am quietly confident that this method shan't disappoint."},{"name":"JALZAHN","text":"Now, depending on the varieties of materia used, I expect that your weapon's properties may undergo change."},{"name":"JALZAHN","text":"Precisely in what manner, I cannot say until the infusion process is complete."},{"name":"JALZAHN","text":"Go forth and infuse the sphere scroll as per young Hubairtin's instructions. When you have accomplished this task, bring the scroll to me, and I shall see to bonding its light energy with your relic."},{"name":"JALZAHN","text":"Likewise, if you desire to know how your weapon will evolve, present it to me along with the scroll, and I shall divine for you the answer."},{"name":"SYSTEM","text":"Once you have fully infused a sphere scroll with materia, present it to <span class=\"highlight\">Jalzahn</span> at Hyrstmill in the North Shroud to have the corresponding relic weapon animus enhanced."},{"name":"SYSTEM","text":"Please note that the process will replace the weapon's attributes with those that were infused in the sphere scroll."},{"name":"SYSTEM","text":"The attributes strength, dexterity, vitality, intelligence, and mind will be raised to a value befitting gear of item level 110."},{"name":"SYSTEM","text":"Attributes that remain will be replaced with the ones infused into the sphere scroll. In the case of Thyrus Animus and Omnilex Animus, base direct hit rate will not be replaced."}],"reward":{"gil":658,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66998]},"next":[65742]},"partials":[{"type":"npc","id":"1009151","obj":{"i":1009151,"n":"Hubairtin","l":43,"q":2}},{"type":"npc","id":"1008948","obj":{"i":1008948,"n":"Jalzahn","l":57,"q":11}},{"type":"quest","id":"66998","obj":{"i":66998,"n":"Celestial Radiance","g":73,"l":"North Shroud","s":3,"f":1}},{"type":"quest","id":"65742","obj":{"i":65742,"n":"Mmmmmm, Soulglazed Relics","g":73,"l":"North Shroud","s":5,"f":1}}]}