{"quest":{"name":"Little Sylphs Lost","location":"Gridania","id":67004,"patch":2.35,"sort":4,"icon":100266,"eventIcon":71221,"issuer":1000193,"target":1005565,"involved":[1005577],"genre":62,"journal":["Gavin would enlist the services of a willing-and-able adventurer─to wit, you.","As Lieutenant Gavin tells it, the Order of the Twin Adder received a panicked missive from Voyce, the naturalist who has taken up residence in Little Solace. Travel to the sylph settlement and see what has the hapless scholar in such distress.","Voyce and Elder Frixio relate to you the plight faced by the sylphs─a mass kidnapping of podlings that had been resting safely in Little Solace. Convinced that the touched sylphs that inhabit the Sylphlands are responsible for the deed, Voyce begs you to travel to the entrance to their lair in the East Shroud, and stand lookout in hopes of catching the abductor in the act.","Your search turned up not the culprits you sought, but rather a mysterious young girl who ominously suggests that the truth behind the disappearance of the podlings is far more fearsome than you suspected, before hastening off to destinations unknown. Return to Voyce and inform him that you will have to look elsewhere for the kidnapper.","In hearing that the touched sylphs are not behind the kidnapping, Voyce is visibly perplexed. Who could have perpetrated this terrible crime, and to what end? This mystery warrants further investigation."],"objectives":["Speak with Voyce at Little Solace.","Keep lookout at the entrance to the Sylphlands.","Report to Voyce."],"dialogue":[{"name":"GAVIN","text":"Your zeal is most appreciated, <span class=\"alternative-container\"><span class=\"alternative\">friend</span><span class=\"alternative\">[GC Rank]</span></span>. Allow me to delve straight into the matter at hand."},{"name":"GAVIN","text":"We have received a most disturbing report from our contact in Little Solace, the esteemed scholar of sylphic mysteries by the name of Voyce."},{"name":"GAVIN","text":"I could not make much sense of his missive─I daresay I have seen chocobos with better quillmanship─but it would appear that recent events have struck the fear of the gods into the man."},{"name":"GAVIN","text":"What few sentences I could decipher specifically asked us to <span class=\"alternative-container\"><span class=\"alternative\">contact the Maelstrom and send for you</span><span class=\"alternative\">send you</span><span class=\"alternative\">contact the Immortal Flames and send for you</span></span>, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>. It would seem that Master Voyce was quite taken with your prior efforts on his behalf."},{"name":"GAVIN","text":"What few sentences I could decipher specifically asked us to <span class=\"alternative-container\"><span class=\"alternative\">contact the Maelstrom and send for you</span><span class=\"alternative\">send you</span><span class=\"alternative\">contact the Immortal Flames and send for you</span></span>, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>. It would seem that Master Voyce was quite taken with your prior efforts on his behalf."},{"name":"GAVIN","text":"It need not be said that any threat facing our sylph friends is potentially a threat to Gridania, as well. Pray make for Little Solace and look into the matter that concerns Master Voyce so."},{"name":"GAVIN","text":"It need not be said that any threat facing our sylph friends is potentially a threat to Gridania, as well. Pray make for Little Solace and look into the matter that concerns Master Voyce so."},{"name":"VOYCE","text":"Wh-What's this!? My copy of <span class=\"emphasis\">A Brief Historie of the Twelveswood</span> has been replaced by a tome detailing two hundred and forty varieties of beastkin feces!"},{"name":"VOYCE","text":"Wh-Why, <span class=\"highlight\">Forename</span>! Whatever are you doing here!? I sent for you? Now that you mention it, perhaps I did! Ahahahahaha!"},{"name":"VOYCE","text":"What is the matter? What is the <span class=\"emphasis\">matter</span>, you say!? A veritable peck of podlings, pilfered from Little Solace while I was taking...ah, a brief respite from my research."},{"name":"VOYCE","text":"You must help me, friend! Why, were Elder Frixio to find out that this happened under my watch─"},{"name":"FRIXIO","text":"(-???-)...This one would be entirely unsurprised."},{"name":"FRIXIO","text":"This one is heartened by brave one's presence. If there is one thing that can be said for bumbling one, it is that bumbling one has strong and trustworthy friends."},{"name":"FRIXIO","text":"This one fears it is exactly as bumbling one says. Little ones that these ones had raised with care...little ones soon to sprout to life, gone! Every last one..."},{"name":"VOYCE","text":"As you well know, friend, podlings are young sylphs in their pre-birth state. Why, this is no mere act of theft, but sylph-napping on an unprecedented scale!"},{"name":"FRIXIO","text":"Little ones are the future. Without little ones, there will be no one to carry on these ones' vision of peace."},{"name":"VOYCE","text":"The touched ones are behind this, no doubt! Having failed to capture the Chosen One, now they would rear an entire generation of hate-filled, treacherous sylphs! We must stop them!"},{"name":"VOYCE","text":"And by <span class=\"emphasis\">we</span>, I mean brave <span class=\"highlight\">Forename</span> here! You will venture to the Sylphlands and rescue the little ones from the hands of their would-be kidnappers, yes? Yes, you must!"},{"name":"VOYCE","text":"<span class=\"highlight\">Forename</span>! You must hurry to the Sylphlands and catch the touched ones in their vile act. Not for me, my friend─for the little ones!"},{"name":"FRIXIO","text":"It pains this one's heart to burden brave one once more, but these ones have nowhere else to turn. Please, brave one, deliver little ones to safety."},{"name":"SILVIA","text":"(-???-)<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> looks, but does <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> <span class=\"emphasis\">see</span>?"},{"name":"SILVIA","text":"(-Mysterious Girl-)No, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does not. Otherwise, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would not be looking where <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is looking."},{"name":"SILVIA","text":"(-Mysterious Girl-)That which you seek will not be found here. For this is not the idle mischief of malevolent sylphs. Oh, no─this is but the prelude to a dark and dastardly plot that threatens to shake Eorzea to its very core."},{"name":"SILVIA","text":"(-Mysterious Girl-)My name? You <span class=\"emphasis\">could</span> call me Sylvie."},{"name":"SILVIA","text":"But you will have no occasion to do so. For I shall pursue our kidnapper, and you shall return and see to your own concerns. That is, if you know what's good for you..."},{"name":"SILVIA","text":"Farewell, friend. Our paths will not cross again. I must...hurry...yes, hurry to La Noscea...before tragedy strikes again..."},{"name":"FRIXIO","text":"Brave one returns, but little ones are nowhere to be seen... Were these ones too late to─hmmm? It is not touched ones, brave one says?"},{"name":"FRIXIO","text":"A green-haired walking one? Dark plots? Brave one's words concern this one, yet this one holds out hope that little ones may yet be saved..."},{"name":"VOYCE","text":"Ah, there you are, friend! I trust that you gave those nasty sylphs their due and returned the little ones to safety?"},{"name":"VOYCE","text":"What's that, you say? It was not the touched ones that did the deed, and 'twas a mysterious green-haired maiden that shared this knowledge with you!?"},{"name":"VOYCE","text":"Wh-Whoever could be behind this unconscionable crime!? Perhaps the answer lies in one of my tomes..."},{"name":"VOYCE","text":"“On the medicinal properties of goobbue feces...” Oh, this won't do at all. Woe, woe is me!"}],"reward":{"gil":760,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"any","quests":[67001,67002]},"next":[67005]},"partials":[{"type":"npc","id":"1000193","obj":{"i":1000193,"n":"Gavin","l":52,"q":6}},{"type":"npc","id":"1005565","obj":{"i":1005565,"n":"Voyce","l":55,"q":6}},{"type":"npc","id":"1005577","obj":{"i":1005577,"n":"Frixio","l":55,"q":4}},{"type":"quest","id":"67001","obj":{"i":67001,"n":"Call of the Wild (Twin Adder)","g":62,"l":"Gridania","s":1}},{"type":"quest","id":"67002","obj":{"i":67002,"n":"Call of the Wild (Maelstrom)","g":62,"l":"Limsa Lominsa","s":2}},{"type":"quest","id":"67005","obj":{"i":67005,"n":"Clutching at Straws","g":62,"l":"East Shroud","s":5}}]}