{"quest":{"name":"Rattled in Ehcatl","location":"Outer La Noscea","id":67007,"patch":2.35,"sort":7,"icon":100269,"eventIcon":71221,"issuer":1005931,"target":1009204,"involved":[1005927,1006325,1009199],"genre":62,"journal":["Skaetswys has been thinking about the kidnapper and his escape.","Skaetswys has deduced that the kidnapper fled with the abducted Bi Bi by means of an airship. She suggests that you inquire with Commander Bloeidin at Camp Overlook regarding any suspicious vessels seen in the sky.","Commander Bloeidin informs you that, indeed, one of his sentries spotted an unfamiliar vessel heading east across the Strait of Merlthor in the direction of Aldenard. He also mentions that the wounded Sylvie rests in one of his tents, but has been refusing all visitors. Pay her a visit and inquire as to her well-being.","From within the tent in which she rests, Sylvie earnestly implores you to track down the villainous Ebon Claw in her stead. Surmising that his next target will be the Ixal, she urges you to hurry to Ehcatl and offer your aid to Chief Sezul Totoloc.","Your reunion with Chief Totoloc and the young engineer Tataramu is interrupted by a dropper from the Ehcatl Nine, who speaks in panicked tones of a sudden attack on the Ehcatl logging grounds perpetrated by a rogue airship. Though the Ixal succeeded in driving off the enemy, it would appear some foul deed or another has already been done. Upon hearing your explanation, all present are in consensus that the beastman abductor you pursue is responsible. Tataramu bids you to travel to the scene of the attack near Hyrstmill and search for any remnants of the damaged vessel.","You succeed in finding a damaged fragment of the rogue airship in the vicinity of Hyrstmill. Deliver it to Tataramu's hands, that he might be able to identify the vessel and deduce something of its most likely destination.","Taking the hull fragment into hand, Tataramu uses his encyclopedic knowledge of airship minutiae to identify its markings as belonging to a rare Garlond Ironworks Model 1569-II. As precious few of these ships were manufactured, he is certain that an inquiry with Highwind Skyways will swiftly turn up the rogue vessel's current owner. At long last, will the mastermind behind the beastman abductions be revealed...?"],"objectives":["Speak with Bloeidin.","Visit Sylvie at the Maelstrom pavilion.","Reunite with Sezul Totoloc at Ehcatl.","Search for signs of an airship around Hyrstmill.","Deliver the airship fragment to Tataramu."],"dialogue":[{"name":"SKAETSWYS","text":"If we're to 'ave any 'ope o' savin' poor Bi Bi, we 'ave to move quickly. Let's put our minds together, <span class=\"highlight\">Forename</span>. What can we deduce about the kidnapper's means of escape?"},{"name":"SKAETSWYS","text":"Ye found poor Sylvie collapsed in front of a sheer cliff face, with no way out save that by which ye came. 'Twas there that the scoundrel's footprints led ye, and it was there that they ended."},{"name":"SKAETSWYS","text":"There's only one direction our man could've fled, and that's up! Which leads us to our next question─just <span class=\"emphasis\">'ow</span>? I've got <span class=\"emphasis\">my</span> theory...but what about you?"},{"name":"Q1","text":"How did the kidnapper take to the sky?"},{"name":"A1","text":"...He's a Roegadyn?"},{"name":"A1","text":"By airship."},{"name":"SKAETSWYS","text":"Aye, ye've figured us out. We Roegadyn can sprout wings from our backs at will, allowin' us to soar through the skies with the greatest o'... I tell ye, <span class=\"highlight\">Forename</span>, sometimes I can't tell if yer actually that daft, or ye just think yer funny."},{"name":"SKAETSWYS","text":"Come on, now. The answer's plain as day to anyone with 'alf their wits about 'em. But fine, I'll spell it out for ye─the kidnapper 'ad an airship!"},{"name":"SKAETSWYS","text":"...Aye, it's the most logical conclusion. Access to an airship would've afforded our man a quick an' easy escape route."},{"name":"SKAETSWYS","text":"If any suspicious vessels took off from the Kobold Dig, I can promise ye it wouldn't escape the eye o' Commander Bloeidin. To Camp Overlook, <span class=\"highlight\">Forename</span>, and quickly!"},{"name":"SKAETSWYS","text":"While yer there, might ye pay a visit to that lass Sylvie, as well? Loath as I am to disturb 'er rest, I reckon she, too, might 'ave some knowledge to share..."},{"name":"SKAETSWYS","text":"If there's one thing I know about airships, I know that they cost a fair bit o' coin. Whoever's 'ired our man, it would seem 'e's rather generous."},{"name":"PICKMAN789GIGU","text":"I haven't slept since I heard about Bi Bi─no, no, not a wink! Work!? How am I supposed to work when I'm so drowsy─sleepy, somnolent, drowsy!?"},{"name":"BLOEIDIN","text":"Well, look who the tides brought in! Let me guess─Skaetswys has got you runnin' her errands, has she?"},{"name":"BLOEIDIN","text":"Aye, I figured as much. She's never been one to pay much mind to the convenience of others. Why, not long ago she came rushin' in here with a poor lass who looked like she was on her last legs."},{"name":"BLOEIDIN","text":"Does this look like an infirmary? I've barely enough beds for my own wounded! She's lucky we had an empty tent─she's been restin' in there ever since."},{"name":"BLOEIDIN","text":"I sent one of my men to bring her some food earlier, but she's been refusin' all visitors. A shy one, I reckon, but she's not goin' to heal if she doesn't eat─and we can't keep her here forever. Hm? A suspicious airship?"},{"name":"BLOEIDIN","text":"Come to think of it, one of my lookouts did say something about an unidentified vessel takin' to the sky. It didn't appear to be a threat, so we elected not to pursue."},{"name":"BLOEIDIN","text":"It flew off to the east, over the Strait of Merlthor toward Aldenard. As for its final destination, your guess is as good as mine."},{"name":"BLOEIDIN","text":"I've never seen anyone quite like that lass Skaetswys brought in. Wherever she hails from, I just hope she hasn't brought any trouble with her..."},{"name":"SYSTEM","text":"Sylvie speaks from within the tent, her voice faint..."},{"name":"SILVIA","text":"(-Sylvie-)Please... No one must enter... No...&lt;cough&gt;...one..."},{"name":"SILVIA","text":"(-Sylvie-)<span class=\"highlight\">Forename</span>...is that you? Do not worry... My wounds already heal..."},{"name":"SILVIA","text":"(-Sylvie-)Forgive me... When first we met... I dismissed your aid... I...I was a fool..."},{"name":"SILVIA","text":"(-Sylvie-)Where I am weak...you are strong... But it is more than strength... Your heart is full of acceptance and understanding... It is this that has won you the trust of beastmen the realm over..."},{"name":"SILVIA","text":"(-Sylvie-)Yes, there can be no doubt now... You are the champion we seek... The champion we need..."},{"name":"SILVIA","text":"(-Sylvie-)We are no match for the Ebon Claw... But you...you are... You must put an end to his plot... Before...before everything is lost..."},{"name":"SILVIA","text":"(-Sylvie-)He will strike at the Ixal next...I am certain of it... You must hurry...hurry to Ehcatl...and lend Chief Totoloc your aid..."},{"name":"SILVIA","text":"(-Sylvie-)I know that you have no reason to trust me... That I have not even told you who I am..."},{"name":"SILVIA","text":"(-Sylvie-)I am sorry, <span class=\"highlight\">Forename</span>...there are some secrets a girl must keep... But I promise you one thing... I...I am a friend..."},{"name":"SILVIA","text":"(-Sylvie-)I shall share the truth with you before long... I promise... For now, I beg of you... Please... Please trust me...help me..."},{"name":"SEZULTOTOLOC","text":"Who is this, Sezul wonders...and then Sezul sees! Return to us, <span class=\"highlight\">Forename</span> does! In joy does Sezul squawk! Squawwwkkk!"},{"name":"TATARAMU","text":"Now there's a sight for sore eyes...and tired hands! What brings you back to the humble environs of Ehcatl? Keen to get back to the forge, are you?"},{"name":"TATARAMU","text":"As you know, an engineer's work is never done. Even though the <span class=\"emphasis\">Dezul Qualan</span> is yet breaking her own records, I'd wager my latest propulsion designs will send her higher still!"},{"name":"IXALA01471","text":"(-Ehcatl Nine Dropper-)Squawk, Sezul! Squawk! Squawk! Squawwwkkk!"},{"name":"SEZULTOTOLOC","text":"Too squawky, your squawkings are! Settle down, you must! What ruffles your feathers so? Tell Sezul, you must."},{"name":"IXALA01471","text":"(-Ehcatl Nine Dropper-)Attacked! Attacked, we were! At our logging grounds, airship struck! By featherless neuker, it was helmed! Neuker! Squawk!"},{"name":"TATARAMU","text":"A-An attack!? But we have done nothing to incur such aggression!"},{"name":"IXALA01471","text":"(-Ehcatl Nine Dropper-)Bravely, we fought! To distant skies, featherless one's airship fled. Black smoke and flames, it spewed! Squawk in joy and triumph, we did! Squawwwk!"},{"name":"IXALA01471","text":"(-Ehcatl Nine Dropper-)Sneaking around our logging grounds, featherless neuker was! Peeping and prying, prying and peeping! Drive him back, we did! Squawk!"},{"name":"TATARAMU","text":"A raid on Ixali logging grounds... Under normal circumstances, I would suspect the Gods' Quiver responsible, but I've not known them to come by sky. But if not the Gridanians, then who...?"},{"name":"Q2","text":"Who flew the rogue airship?"},{"name":"A2","text":"The abductor of the beastmen!"},{"name":"A2","text":"It must be the man I'm after!"},{"name":"TATARAMU","text":"D-Did I hear you right, <span class=\"highlight\">Forename</span>!? You're in pursuit of a dangerous criminal who has been traveling the realm, abducting beastmen wherever he goes!?"},{"name":"SEZULTOTOLOC","text":"Abductions, you say!? Squawk! By featherless neuker, proud Ixali wings bound!? Pay for this dishonor, he will! Squawwwk!"},{"name":"TATARAMU","text":"Our first step is to find the kidnapper, a process in which my expertise should serve us well. The rogue airship was damaged in battle, yes? If you could recover even the smallest fragment from the vessel, <span class=\"highlight\">Forename</span>, I am quite confident I could use it to track our foe."},{"name":"IXALA01471","text":"(-Ehcatl Nine Dropper-)Squawk! Not far from Hyrstmill, battle was fought! Any neuker droppings, there you will find! Pluck neuker's hair-feathers one by one, we will! Squawk!"},{"name":"TATARAMU","text":"An attack by an unidentified airship? <span class=\"highlight\">Forename</span>, you must travel to the scene of the battle in my stead. Even the smallest fragment of the vessel you could find would go far in deducing our foe's destination."},{"name":"SEZULTOTOLOC","text":"Squawk! Sealed his fate, our enemy has! If single feather is plucked from fledglings, much vengeance, we shall have!"},{"name":"TATARAMU","text":"What news, <span class=\"highlight\">Forename</span>? Were you able to find aught of the assailant's vessel?"},{"name":"TATARAMU","text":"Well, hullo, what have we here? A piece of an airship's outer hull, is it? Let me take a closer look..."},{"name":"TATARAMU","text":"Most uncommon markings, but I swear I've seen them <span class=\"emphasis\">somewhere</span>... Ah, but of course! Why, this is a Garlond Ironworks Model 1569-II! Fine vessels, though most will go their lives without seeing one. Only a few were ever manufactured."},{"name":"TATARAMU","text":"Hahaha! You needn't act too impressed, <span class=\"highlight\">Forename</span>. When your father is chairman of Highwind Skyways, you'd have to go well out of your way <span class=\"emphasis\">not</span> to pick up a few tidbits of airship minutiae."},{"name":"TATARAMU","text":"I will put in an inquiry with Advisor Colson. A quick perusal of the records should serve to identify the rogue vessel's current owner."},{"name":"TATARAMU","text":"Yes, <span class=\"highlight\">Forename</span>, it is but a matter of time before the curtain is cast open and the mastermind behind these crimes is revealed for the scoundrel he is!"}],"reward":{"gil":1024,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67006]},"next":[67008]},"partials":[{"type":"npc","id":"1005931","obj":{"i":1005931,"n":"Skaetswys","l":350,"q":5,"t":"Storm Lieutenant"}},{"type":"npc","id":"1009204","obj":{"i":1009204,"n":"Tataramu","l":57,"q":8}},{"type":"npc","id":"1005927","obj":{"i":1005927,"n":"789th Order Pickman Gi Gu","l":350,"q":9}},{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"quest","id":"67006","obj":{"i":67006,"n":"Digging for Answers","g":62,"l":"Western La Noscea","s":6}},{"type":"quest","id":"67008","obj":{"i":67008,"n":"Ash Not What Your Brotherhood Can Do for You","g":62,"l":"North Shroud","s":8}}]}