{"quest":{"name":"The Paths We Walk","location":"Fortemps Manor","id":67011,"patch":3.3,"sort":60,"icon":100562,"eventIcon":71221,"issuer":1012337,"target":1016809,"involved":[1001029,1002694,1011192,1011231,1011952,1012180,1017116],"genre":65,"journal":["Deep in thought, the House Fortemps manservant reflects upon a day not so very long ago...","\"To ye who ask of things to come:<br>Give thought to what is past and gone.“<br><br>Such was the wisdom of a Belah'dian poet king, and the steward believes you would do well to heed it. Moved by his heartfelt words, you resolve there and then to make a pilgrimage of sorts, retracing your first fateful steps in the land of Ishgard.<br><br>The road stretched on, obscured by an endless veil of snow. Somewhere in the white beyond stood the great iron gates, and on the other side a humble manservant, who awaited the coming of three travelers...","Merchants of all nations speak a common tongue, and its words are coin. Needless to say, there is little profit to be had in prejudice, especially against those who have received the patronage of a count. Thus, when the wards of House Fortemps arrived at market, they found Elaisse only too happy to make their acquaintance...","Gibrillont knew everyone's story, though he would never share his own. An optimist, he wanted to believe in the best in people. Sometimes that faith would be rewarded, other times betrayed. But he would listen, regardless, and he would hope...","For all Lady Laniaitte's disdain, it was an old, familiar dance. To her, Lord Emmanellain would always be the boy fumbling for a compliment. And perhaps there was comfort in that. A memory of home on the bleak frontier...","An honorable man, mindful of tradition, Lord Artoirel was loath to accept the assistance of a foreigner in exile. But when forced to confront bitter truths, he looked within and found himself wanting. Pride be damned, then, if it lead one astray. He would set aside his prejudices and join hands with this gifted outcast for the greater good of Ishgard...","Two foreign heretics against two knights of the Heavens' Ward. Under the watchful gaze of the Fury, they would fight, and the winners' claims would be proven true. It was the opening gambit of a greater game whose stakes would remain unknown for some time...","To walk the righteous path, to live for the sake of others. To rise to the highest station, yet remain powerless to bring an end to your people's suffering. What price salvation, then? What sacrifice beyond reason? For uneasy lies the head that wears a crown, as the archbishop knew all too well...","Merlwyb had never been one to retreat, much less in the face of transparent theatrics. But this had been no ordinary battlefield, its rules of engagement anything but clear. So she would watch, and she would learn. And, in time, she would act...","From far across the sea had the Domans come, seekers of sanctuary whose home was no more. Scorned by some, embraced by others, they had found new purpose in a frontier land─first as builders, then as warriors. For to whom much is given, much is expected..."],"objectives":["Visit Elaisse in the Jeweled Crozier.","Visit Gibrillont at the Forgotten Knight.","Visit Laniaitte in Camp Cloudtop.","Visit Redwald at Falcon's Nest.","Visit the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine.","Visit the Hoplon.","Visit Merlwyb in Limsa Lominsa.","Visit Higiri in Revenant's Toll."],"dialogue":[{"name":"BUTLER02246","text":"'Twas bitterly cold when you first came to our city, when I stood waiting for you before the Arc of the Worthy. To think that was where it all began. How much has changed since that day..."},{"name":"BUTLER02246","text":"Forgive me. Of late, I have been studying the works of a Belah'dian poet king, who wrote, “To ye who ask of things to come: give thought to what is past and gone.”"},{"name":"BUTLER02246","text":"So rarely have we the luxury to reflect on the choices we have made─on how they have shaped our lives and the lives of others. Even I, a mere steward whose deeds would not merit a footnote in the annals of history, can see the value in this."},{"name":"BUTLER02246","text":"I say this to you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, because...because as you move, so too does the world. Pray spare a moment to contemplate your journey while you can."},{"name":"SYSTEM","text":"...The road stretched on, obscured by an endless veil of snow. Somewhere in the white beyond stood the great iron gates, and on the other side a humble manservant, who awaited the coming of three travelers..."},{"name":"BUTLER02246","text":"I do not regret my choices, nor do I think you should yours. Nevertheless, one cannot help but look back on occasion and wonder..."},{"name":"ELAISSE","text":"A warm welcome to you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. To what do I owe the pleasure?"},{"name":"ELAISSE","text":"...Retracing your steps from those first days in Ishgard? I see... Well, no one could begrudge you for indulging in a little nostalgia. I am reminded how much I owe to you and yours..."},{"name":"ELAISSE","text":"Lest you forget, foreign merchants were subject to a frankly unreasonable level of scrutiny until relatively recently. Not so now, however. Now, goods from every corner of Eorzea flow into our markets. And that, my friend, is change we can all appreciate."},{"name":"SYSTEM","text":"...Merchants of all nations speak a common tongue, and its words are coin. Needless to say, there is little profit to be had in prejudice, especially against those who have received the patronage of a count. Thus, when the wards of House Fortemps arrived, she was glad to make their acquaintance..."},{"name":"ELAISSE","text":"As one might expect, all this political upheaval has had a significant impact on the markets. But there's profit to be had if one can navigate the chaos."},{"name":"GIBRILLONT","text":"What'll it be, then? Ale? Mulled wine? No, no, don't tell me─<span class=\"emphasis\">tea</span>?"},{"name":"GIBRILLONT","text":"Oho, so it's to be memories, then, is it? Now there's a bitter draught that'll leave you wanting─assuming you can remember your own name, that is."},{"name":"GIBRILLONT","text":"Take your friend, Tataru. One moment, she's just another girl waiting on customers, clearing tables and so forth, and the next she's got a dozen admirers asking after her every bloody night─and I'll be damned if I can remember how it happened!"},{"name":"GIBRILLONT","text":"Singing those stupid songs, dancing those daft dances... Though, to be honest, I think it was her stories that really won 'em over. Stories of a certain hero's grand adventures across Eorzea, told with a flair that'd put a minstrel to shame."},{"name":"GIBRILLONT","text":"Who doesn't love a good hero's tale, am I right? Hells, we've even got one about the man who built this tavern. Was one of the founding fathers of Ishgard, or so it goes."},{"name":"GIBRILLONT","text":"Now, as the <span class=\"emphasis\">Enchiridion</span> told it, besides Haldrath, the only knights who survived the battle with Nidhogg were the founders of the High Houses. Course, these days, we all know better than to put too much stock in the words of the church, eh?"},{"name":"GIBRILLONT","text":"But there's more to our tale than just words. There's a sword, too─one which has been passed down from proprietor to proprietor since before anyone can remember. She's a rusty old bugger, but if you look closely at her handle, you can just about make out an inscription."},{"name":"GIBRILLONT","text":"\"Brothers brave and true, live well, forgotten and content.“"},{"name":"GIBRILLONT","text":"A man who forsook wealth and fame, and chose the life of a humble tavern keeper..."},{"name":"GIBRILLONT","text":"It's just a tale, of course─albeit a good one. As for the truth, who can say, friend. Who can say."},{"name":"SYSTEM","text":"...He knew everyone's story, though he would never share his own. An optimist, he wanted to believe in the best in people. Sometimes that faith would be rewarded, other times betrayed. But he would listen, regardless, and he would hope..."},{"name":"LANIAITTE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, I was but this moment thinking of you! I had hoped to speak with you at Ser Aymeric's investiture, but circumstances conspired to prevent me from attending. Mayhap you will allow me to say now what I could not say then."},{"name":"LANIAITTE","text":"On behalf of House Haillenarte and all of Ishgard, I offer unto you my deepest and most humble thanks. You risked your life to stand against our sworn enemy, and freed us from a millennium of torment. Though we can never hope to repay you, we will ever remember you and your deeds, that our children and their children's children might know the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to whom they owe their lives."},{"name":"LANIAITTE","text":"Ahem. I concede that the grand investiture would have been a more fitting occasion for such words...but I could not risk them being left unspoken. What brings you this way? As you can see, Camp Cloudtop remains much the same as it did during the war. Though we need no longer watch the skies for Dravanian outflyers, the Vanu Vanu have proven themselves similarly worthy of our attention."},{"name":"EMMANELLAIN","text":"I say, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! You have the most uncanny ability to appear whenever I least expect you!"},{"name":"EMMANELLAIN","text":"But enough about that─ Honoroit?"},{"name":"HONOROIT","text":"Ah, yes, my lord. Ahem.<br>Lady Laniaitte, I am pleased to report that we succeeded in infiltrating Vundu territory, and there observed the beastmen harvesting crystals at several different sites."},{"name":"HONOROIT","text":"Based on the volume of crystals acquired during our period of surveillance, I have prepared an estimate of how much time I believe it will take the Vundu to gather sufficient crystals for another summoning. I have also taken the liberty of drafting several proposals outlining how the Rose Knights might prevent such an eventuality, such as raiding these sites and securing their stores, as well as a detailed assessment of the risks involved should you choose to proceed. Ahem."},{"name":"LANIAITTE","text":"By the Fury... I gathered you were clever, but I was not aware that you were capable of <span class=\"emphasis\">this</span>! With respect, you are wasted on your master."},{"name":"LANIAITTE","text":"Hardworking, full of potential─ Aye, I think there is a place for you here, with the Rose Knights...if you would have it."},{"name":"HONOROIT","text":"That you would even consider taking me into your service is a tremendous honor, my lady, and were I free to do so, I should gladly accept. But I am pledged to another, as you well know."},{"name":"LANIAITTE","text":"Regrettable, but understandable. I take comfort in the fact that a youth of your talent and character will never want for opportunities."},{"name":"EMMANELLAIN","text":"\"Pledged to another,“ you rascal! I thought I saw you whispering in young Saulette's ear the other day! You certainly wasted no time wooing our newest maid."},{"name":"EMMANELLAIN","text":"There'll be no secrets between us─you must tell me everything! Where you've been sneaking off to together, what <span class=\"emphasis\">adventures</span> you've been having─every little detail. And don't you <span class=\"emphasis\">dare</span> leave anything out!"},{"name":"LANIAITTE","text":"I am sure he will not. In any event, you have...<span class=\"emphasis\">jointly</span> exceeded my expectations. I grant you leave to return to the city. Should the need arise, I shall call upon you again."},{"name":"HONOROIT","text":"Thank you, my lady. I believe we shall do as you suggest.<br>Until we meet again, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"EMMANELLAIN","text":"Not so fast! The next airship isn't due for another hour, and we have so much to talk about! Honoroit! Honoroit!"},{"name":"SYSTEM","text":"...For all the lady's disdain, it was an old, familiar dance. To her, Lord Emmanellain would always be the boy fumbling for a compliment. And perhaps there was comfort in that. A memory of home on the bleak frontier..."},{"name":"LANIAITTE","text":"In all honesty, we could easily do without their assistance. And yet...I cannot deny that a part of me has come to look forward to their impromptu visits."},{"name":"REDWALD","text":"A thousand pardons, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Had I known you were planning to pay us a visit, I would have seen that you received a proper reception─a feast, perhaps, or at least a formal welcome with the men in full dress!"},{"name":"REDWALD","text":"You have more than earned it. One need only look to the pilgrims who come in their droves to pray before the relief to see the truth of that."},{"name":"REDWALD","text":"Some abide in silence, while others shed tears. Not for sorrow, you understand, but for <span class=\"emphasis\">joy</span>─joy at being released from Nidhogg's torment."},{"name":"ARTOIREL","text":"Ser Redwald. The shipment has been unloaded, and the quartermaster confirms that all supplies are accounted for."},{"name":"ARTOIREL","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Are you here on official business?"},{"name":"ARTOIREL","text":"A journey to remember and reflect... Aye, much has changed since first we came here together. Since I abandoned you to follow the heretics' trail alone..."},{"name":"REDWALD","text":"Come, my lord. Mayhap you recall the survivor whom you carried back to Falcon's Nest that day? Well, his wife but recently gave birth to their first child."},{"name":"ARTOIREL","text":"Is that so? Well, well... Mayhap I should pay him a visit."},{"name":"REDWALD","text":"Though he would doubtless be honored, my lord, you need not put yourself to such trouble. Your responsibilities as count surely leave little enough time as it is."},{"name":"ARTOIREL","text":"Think not on that. I am still me, and you are still you. Whatever our respective titles, I would speak to you as a friend."},{"name":"ARTOIREL","text":"This preoccupation with position and power has sown no end of discord between our two houses, to the great detriment of our nation."},{"name":"ARTOIREL","text":"'Tis especially galling when one considers that much of what we <span class=\"emphasis\">have</span> achieved was by virtue of our blood, and not our character."},{"name":"ARTOIREL","text":"So call me count, if you must, but know that I take no pride in it. Mayhap one day, when I have earned it, I will. But not today."},{"name":"REDWALD","text":"...Still himself, is he?"},{"name":"SYSTEM","text":"...An honorable man, mindful of tradition, he was loath to accept the assistance of a foreigner in exile. But when forced to confront bitter truths, he looked within and found himself wanting. Pride be damned, then, if it lead one astray. He would set aside his prejudices and join hands with this gifted outcast for the greater good of Ishgard..."},{"name":"REDWALD","text":"Humility and nobility are, regrettably, all too often at odds. He shall make a fine count."},{"name":"SYSTEM","text":"...Two foreign heretics against two knights of the Heavens' Ward. Under the watchful gaze of the Fury, they would fight, and the winners' claims would be proven true. It was the opening gambit of a greater game whose stakes would remain unknown for some time..."},{"name":"ISHGARDIANPRIEST02162","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Halone's blessings be upon you."},{"name":"ISHGARDIANPRIEST02162","text":"...You are <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, if I am not mistaken?"},{"name":"ISHGARDIANPRIEST02162","text":"We have met, though I am sure you do not remember. 'Twas a seeming lifetime ago, when you answered the archbishop's summons."},{"name":"ISHGARDIANPRIEST02162","text":"I...I often come here to reflect upon all that has come to pass, and when I saw you gazing at the Holy Vault, I thought perhaps that you had too."},{"name":"ISHGARDIANPRIEST02162","text":"You turned our world upside down. Everything we held dear. For change. For the truth..."},{"name":"ISHGARDIANPRIEST02162","text":"They say it had to be done...that his grace sought godhood. If so, then perhaps it was the Fury's will that you prevail."},{"name":"ISHGARDIANPRIEST02162","text":"But...to say it, to believe it? I know that no man is without sin, but he...he was pious and humble, wholly devoted to the church and to his people."},{"name":"ISHGARDIANPRIEST02162","text":"I <span class=\"emphasis\">knew</span> him, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, and he was a good man. Whatever else he may have been, I will remember him as a good man."},{"name":"SYSTEM","text":"...To walk the righteous path, to live for the sake of others. To rise to the highest station, yet remain powerless to bring an end to your people's suffering. What price salvation, then? What sacrifice beyond reason? For uneasy lies the head that wears a crown..."},{"name":"ZANTHAEL","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>! This is most unexpected. Do you have business with the Admiral?"},{"name":"ZANTHAEL","text":"A journey of remembrance, you say? Well, far be it from me to deny you. Unannounced or not, I suspect the Admiral would be most displeased if she heard that I had turned you away."},{"name":"MERLWYB","text":"Thank the Navigator. I had resigned myself to another day spent listening to my advisors prattle on about the beastmen's latest movements. Come, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>─tell me of your adventures."},{"name":"MERLWYB","text":"...The Ishgardians sail in uncharted waters. Though I hope these new reforms of theirs meet with no resistance, 'twould not be the first grand voyage to run afoul of reefs ere it properly began."},{"name":"MERLWYB","text":"But with Ser Aymeric at the helm, they may yet chart a course for generations to follow."},{"name":"MERLWYB","text":"Which is not to say our own doesn't need correcting. The Alliance has grown complacent. The bloody nose you gave us at the melee showed me that."},{"name":"MERLWYB","text":"Nor have I forgotten the lessons of the banquet. Rest assured─we will root out any further turncoats before the dagger is at our back. You have my word on that, and Lady Yugiri's besides."},{"name":"SYSTEM","text":"...She had never been one to retreat, much less in the face of transparent theatrics. But this had been no ordinary battlefield, its rules of engagement anything but clear. So she would watch, and she would learn. And, in time, she would act..."},{"name":"MERLWYB","text":"Never again, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. Never again."},{"name":"HIGIRI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>? Is aught amiss?"},{"name":"HIGIRI","text":"I am both flattered and surprised that you should remember my small role in this tale, given the grandeur of your subsequent endeavors."},{"name":"HIGIRI","text":"Though I must confess to having derived some selfish pleasure from donning the garments of the shinobi once more, I am honored to have been able to assist in freeing General Raubahn from his captivity."},{"name":"HIGIRI","text":"And I believe I speak for all of my countrymen when I say that we are most grateful to have been granted the opportunity to contribute to the restoration of the Scions."},{"name":"HIGIRI","text":"Much has changed, it is true, and much may never be as it once was. But in watching you and yours rise from the ashes and rebuild, I am reminded that we must never give in to despair, for there is always something which may yet be saved."}],"reward":{"gil":2681,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67783]},"next":[67012]},"partials":[{"type":"npc","id":"1012337","obj":{"i":1012337,"n":"House Fortemps Manservant","l":2320,"q":5}},{"type":"npc","id":"1016809","obj":{"i":1016809,"n":"Higiri","l":67,"q":2}},{"type":"npc","id":"1001029","obj":{"i":1001029,"n":"Zanthael","l":29,"q":12,"t":"Storm Sergeant"}},{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"npc","id":"1011192","obj":{"i":1011192,"n":"Gibrillont","l":2300,"q":10,"t":"Forgotten Knight Proprietor"}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012180","obj":{"i":1012180,"n":"Elaisse","l":2301,"q":8}},{"type":"npc","id":"1017116","obj":{"i":1017116,"n":"Vault Priest","l":2301,"q":1}},{"type":"quest","id":"67783","obj":{"i":67783,"n":"Litany of Peace","g":4,"l":"Ishgard","s":25}},{"type":"quest","id":"67012","obj":{"i":67012,"n":"The Oaths We Swear","g":65,"l":"Mor Dhona","s":60}}]}