{"quest":{"name":"Carline Memories","location":"Limsa Lominsa","id":67018,"patch":2.3,"sort":3,"icon":100288,"eventIcon":71221,"issuer":1009153,"target":1000100,"genre":77,"journal":["The deputy postmoogle has a smile on his face and a letter bearing a Gridanian address in his paw.","The deputy postmoogle has entrusted you with a letter. Your assignment, which he assures you will be a pleasant one: deliver it safely to the hands of Mother Miounne, proprietress of the Carline Canopy in Gridania.","Pleased to receive good tidings, Miounne shares with you the story of two Lalafells befriended by her grandfather in days gone by. Father and daughter, they overcame initial ostracism to raise a great waterwheel that still stands as a symbol of Gridania to this day. Miounne would visit the wheel with you, but before that asks that you pick four carline blossoms from around town.","You have picked four carline blossoms at Miounne's request. Return to the Carline Canopy and present them to her.","Smiling upon seeing the flowers you picked, Miounne offers to show you the waterwheel as promised. Make for the Central Shroud and wait for Miounne in the vicinity of the Jadeite Flood.","Miounne shares with you the touching tale of Figaga, the Lalafellin girl who saw her stricken father's dream to fruition. Through passion and force of will, she became a master builder and raised the great waterwheel that now bears her name...before she tragically succumbed to the same illness that took her father. Miounne pays her respects at this brave woman's final resting place before returning to the Carline Canopy, named for Figaga's favorite flower. Join her there, that she might share with you the rest of the story.","Back at the Canopy, Miounne explains how she converted the old cabin into the establishment it is today to carry on the spirit of her dear departed grandfather, who spared no effort in welcoming the various peoples who came to Gridania seeking a new home. It is in this same spirit that she accepted her current position with the Adventurers' Guild. Miounne reflects upon her fated meeting with you, and expresses her joy and anticipation at the many meetings with new adventurers that yet lie ahead."],"objectives":["Deliver the letter to Miounne in Gridania.","Pick carlines in Old Gridania.","Pick carlines in New Gridania.","Deliver carlines to Miounne.","Wait for Miounne in the Central Shroud.","Speak with Miounne at the Carline Canopy."],"dialogue":[{"name":"LETTERMOOGLE","text":"Well, if it isn't my favorite assistant, back and eager as ever! As a reward for your zeal in your duties, I have what should prove to be a positively delightful task, kupo."},{"name":"LETTERMOOGLE","text":"I've a letter here addressed to Mother Miounne of Gridania's Carline Canopy. Ah, I can just feel the warm rays of the sun trickling down through the leaves, a piping hot cup of tea in my paw... Why, I've half a mind to deliver the letter myself!"},{"name":"LETTERMOOGLE","text":"But let it not be said that the deputy postmoogle keeps the more pleasing tasks for himself. No, the job is yours, and you need not so much as ask for it! Happy message-carrying, kupo!"},{"name":"LETTERMOOGLE","text":"The letter you have is to be delivered to Mother Miounne, proprietress of the Carline Canopy in Gridania. Happy message-carrying, kupo!"},{"name":"MIOUNNE","text":"Welcome home, friend. You've made quite a name for yourself, haven't you? At times I'd swear that even the trees themselves are abuzz with tales of your exploits."},{"name":"MIOUNNE","text":"Welcome to the Carline Canopy, friend. You've made quite a name for yourself, haven't you? At times I'd swear that even the trees themselves whisper tales of your exploits."},{"name":"MIOUNNE","text":"A letter? Let me see...oh! Why, it would seem there'll be an even greater demand for eel pies in the coming days. And once again the oven calls, not that you'll find me complaining."},{"name":"MIOUNNE","text":"After all, some go their entire lives without knowing how it feels to have one of their creations beloved by Eorzeans the realm over. Which, come to think of it, reminds me of a story..."},{"name":"MIOUNNE","text":"How did it go again? Ah, yes... Many years ago, when I was no taller than the counter before us, a Lalafellin artisan and his daughter came here to the Twelveswood."},{"name":"MIOUNNE","text":"Of the circumstances which brought them here I know little, for the father was a man of few words. What I do know is that they had left behind their home, traveling far and wide across the realm before settling on Gridania as their new home."},{"name":"MIOUNNE","text":"The elementals care little about borders drawn by men─all who treat the forest with compassion are welcome within. Sadly, people in those times were not quite so understanding. The poor man and daughter endured name-calling, spiteful pranks, and worse..."},{"name":"MIOUNNE","text":"My grandfather took pity on them, offering them shelter in this building. In those days, it was little more than a glorified storage cabin, far from the bustling center of activity it is today."},{"name":"MIOUNNE","text":"My grandfather minded the watermill, you see, as his father before him─a respected position that afforded our family a certain status among our peers. Though not all approved of my grandfather befriending the outsiders, none dared give voice to their objections."},{"name":"MIOUNNE","text":"With time, Gridanians came to understand that whencesoever they hailed, the man and his young daughter were honest, peaceable folk─no different from any of us."},{"name":"MIOUNNE","text":"With the blessings of their newfound countrymen, the love the two harbored for their new home deepened. When talk arose of erecting a new waterwheel, the father─originally a shipwright by trade─was among the first to offer his services. My grandfather soon joined him."},{"name":"MIOUNNE","text":"Though not without hardships along the way, the wheel eventually rose, standing even today as one of Gridania's greatest architectural achievements, and a keystone of our very livelihood. If you are not in too much of a hurry, I would like very much to show it to you."},{"name":"MIOUNNE","text":"But before we depart, I would ask of you a small errand. Would you be so kind as to pick four carline blossoms about town and bring them to me? I would accompany you, but alas, the kitchen calls..."},{"name":"MIOUNNE","text":"Before we depart for the waterwheel, would you be so kind as to pick four carline blossoms about town and bring them to me? I would accompany you, but alas, the kitchen calls..."},{"name":"MIOUNNE","text":"Ah, welcome back. Were you able to procure the carline blossoms I asked of you?"},{"name":"MIOUNNE","text":"Ah, how lovely! Though hardly a rare sight in Gridania, these flowers never fail to bring a smile to my face. The waterwheel I would show you is best seen from the Jadeite Flood. Go on ahead─I shall be along after I see to my duties here."},{"name":"MIOUNNE","text":"The waterwheel I would show you is best seen from the Jadeite Flood. Go on ahead─I shall be along after I see to my duties here."},{"name":"MIOUNNE","text":"Ah, <span class=\"highlight\">Forename</span>. I hope I've not kept you waiting overlong."},{"name":"MIOUNNE","text":"Come now, let us look upon the waterwheel of my tale. Behold the pride of our nation, Figaga's Gift!"},{"name":"MIOUNNE","text":"Is she not magnificent? Countless times have I come here, yet each time I stand in awe at her sheer size and beauty. Knowing that it was born of a special bond between my grandfather and the Lalafellin builder elevates it to a special place in my heart. Would that they had lived to see it complete..."},{"name":"MIOUNNE","text":"I spoke of hardships, yes? Not days after he finished drawing up his draft for the new mill, the poor Lalafell─hale and hearty for his age until then─suddenly took ill. What started as a cough soon grew dire, and within a fortnight he had passed."},{"name":"MIOUNNE","text":"Without its chief builder, the ambitious project came grinding to a halt. At first, there seemed no recourse but to abandon construction entirely. Then the daughter stepped forth, vowing that she would see her father's dream to fruition."},{"name":"MIOUNNE","text":"Though none could deny her pedigree, the girl had never lifted a hammer in her entire life. Not letting this─nor the doubting words of others─deter her, she promptly enrolled in the Carpenters' Guild, vowing to follow in her father's footsteps."},{"name":"MIOUNNE","text":"People laughed─who was this shy little girl with yellow blossoms in her hair? But within a year's time, all could see that the girl was a prodigy with a hammer. In five years, she had mastered skills that would take an ordinary carpenter a lifetime. In ten, her father's dream had become a reality."},{"name":"MIOUNNE","text":"The shy girl with flowers in her hair had blossomed into a strong, proud woman─and one of the greatest builders our realm has ever known. Such is the tale of Figaga."},{"name":"MIOUNNE","text":"Ah, to think of the wonders she might still have wrought! Alas, not long after completing her Gift to us, she succumbed to the same foul plague that took her father."},{"name":"MIOUNNE","text":"Though she is with us no more, she remains an inspiration for the women of Gridania, myself first among them. It is here, in view of the father and daughter's greatest accomplishment, that I buried their ashes and built a small monument to their memory."},{"name":"MIOUNNE","text":"Once again I thank you, <span class=\"highlight\">Forename</span>. The flowers you picked surely brought a smile to Figaga's face today. Now, shall we return? Yes, to the place that I named in her memory..."},{"name":"MIOUNNE","text":"Thank you for accompanying me today. I had hoped to share the tale of Figaga with you for quite some time now, having come here as you did from a faraway land."},{"name":"MIOUNNE","text":"In transforming my grandfather's old storage cabin into the Carline Canopy you see today, I sought to carry on the spirit he showed to his Lalafellin friends─a spirit of welcoming and acceptance for all who would seek shelter here, regardless of their origins."},{"name":"MIOUNNE","text":"And it was in the same spirit that I came to devote my life to looking after those who would seek adventure. And what a fateful decision that turned out to be, yes?"},{"name":"MIOUNNE","text":"So it was that I came to stand behind this counter, so it was that I met you, and so it was that I received the joyous tidings that you brought to me today."},{"name":"MIOUNNE","text":"For you see, the letter you delivered was an announcement from the Adventurers' Guild. It would appear that I can look forward to a sizable group of new recruits in the days to come, and nothing could make me happier."},{"name":"MIOUNNE","text":"I wanted to share this news with Figaga, and with you. After all, 'tis in no small part thanks to your exploits that so many brave young men and women would step forth to bring succor to our realm."},{"name":"MIOUNNE","text":"Truly, you are a gleaming example to all. May your star shine forever bright upon us, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":658,"items":[{"num":3,"id":4750,"one":1},{"num":3,"id":4656,"one":1},{"num":3,"id":4725,"one":1},{"num":3,"id":4679,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67019]},"next":[67067,67068,67069]},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"item","id":"4750","obj":{"i":4750,"n":"Mulled Tea","l":49,"c":24405,"t":46,"p":267}},{"type":"item","id":"4656","obj":{"i":4656,"n":"Apkallu Omelette","l":70,"c":24253,"t":46}},{"type":"item","id":"4725","obj":{"i":4725,"n":"Rolanberry Cheesecake","l":55,"c":24070,"t":46}},{"type":"item","id":"4679","obj":{"i":4679,"n":"Dzemael Gratin","l":55,"c":24112,"t":46,"p":457}},{"type":"quest","id":"67019","obj":{"i":67019,"n":"A Debt Unpaid","g":77,"l":"Limsa Lominsa","s":2}},{"type":"quest","id":"67067","obj":{"i":67067,"n":"Spirits Most Foul","g":77,"l":"Limsa Lominsa","s":5}},{"type":"quest","id":"67068","obj":{"i":67068,"n":"Dubious Dancing","g":77,"l":"Limsa Lominsa","s":6}},{"type":"quest","id":"67069","obj":{"i":67069,"n":"Stroking the Haft","g":77,"l":"Limsa Lominsa","s":7}}]}