{"quest":{"name":"The Oaths We Swear","location":"Mor Dhona","id":67012,"patch":3.3,"sort":60,"eventIcon":71221,"issuer":1016809,"target":1011916,"involved":[1004576,1011907,1012345,1017119],"genre":65,"journal":["Prevention was ever better than cure, as Higiri knows only too well.","\"To ye who ask of things to come:<br>Give thought to what is past and gone.“<br><br>With the long-dead poet king's words still ringing in your ears, you continue your pilgrimage, retracing the steps you took during your days in exile.<br><br>Ilberd had grown impatient, and so the hour of the execution was at hand. Swift action was required. A bold rescue─and should the gods be good, a chance for retribution...","A refugee of fallen Ala Mhigo, Raubahn had risen from the depths of poverty to claim a seat on the Syndicate. Yet for all his great deeds, one was left undone. And like sands through an hourglass, the years slipped away...taking with them an old friend's hope...","The trail led to the mills far to the north. Though they appeared abandoned at first glance, their cellars hid a secret: a heretic lair occupied by Lady Iceheart herself. But upon being discovered, Ysayle made no attempt to fight...","Forsaken by gods and men, the heretics found salvation in a revelation. They would take up arms against their own kind to set ancient wrongs to right. Cut out Ishgard's festering heart, and the war would be over. This they knew, believed with all their being...until their savior told them their efforts would be for naught...","As long as there are wars to fight, there will be those who take up arms not out of hatred or even a sense of duty, but for want of better employment. When presented with an alternative, such individuals may gladly trade their swords for scythes─or, failing that, pledge them to a more worthy cause...","Marcechamp had tried to fill the hole in her heart, to give her a new home, a new family. But he knew there were still nights when Ysayle dreamed of the wall of ice, of the bodies in the snow, of feathered wings and azure skies. And though he prayed that she would stay, he could see that it was hopeless. She would leave him. It was only a matter of time..."],"objectives":["Deliver the Doman unguent to Swift in Ul'dah.","Visit Gorgagne Mills in the Coerthas western highlands.","Speak with the penitent heretic.","Visit Jantellot at the Convictory.","Visit Marcechamp in Tailfeather."],"dialogue":[{"name":"HIGIRI","text":"Will you be traveling to Ul'dah next? If so, I would ask a favor of you."},{"name":"HIGIRI","text":"I have prepared a special unguent to aid in General Raubahn's rehabilitation. Injuries such as his must be tended to daily, even long after they have healed."},{"name":"HIGIRI","text":"You need only deliver it to his man, Commander Swift. He will see that the Flame General receives it."},{"name":"HIGIRI","text":"Few shinobi have the fortitude and strength of will to return to the battlefield after suffering so grievous an injury. Not only do they struggle to adapt their techniques, but many complain of strange, inexplicable aches. Should General Raubahn experience them, it is my hope that this unguent will help."},{"name":"SWIFT","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. What is that you have there?"},{"name":"SWIFT","text":"...Unguent? I was not aware the General required such stuff. And one of our Doman friends made this for him, did she? Very well, I shall be sure to pass it on. Actually, wait here─we have just this moment concluded a meeting, and I expect he would be glad to speak with you before returning to the palace."},{"name":"RAUBAHN","text":"So, Commander Swift tells me that you came all this way to deliver unguent?"},{"name":"RAUBAHN","text":"Daily, she says! Hah! Well...mayhap it is best to be prudent. The gods alone know why you agreed to deliver it for her, though."},{"name":"RAUBAHN","text":"...Unless you mean to favor me with that rematch I requested?"},{"name":"RAUBAHN","text":"I jest, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. You are on a “journey of reflection,” are you not? Aye, Merlwyb said as much. And now you want to relive the moment you pulled me from the pit Ilberd left me in to rot."},{"name":"RAUBAHN","text":"...It shames me to think of it. That I was so blind to his hatred..."},{"name":"RAUBAHN","text":"Lolorito tells me that it was not always so─that Ilberd admitted to him he once believed that I would return to Ala Mhigo at the head of an army."},{"name":"RAUBAHN","text":"But years passed, and I did nothing. For all my accomplishments─for all my wealth, power, and influence─I did naught to better the plight of my people."},{"name":"RAUBAHN","text":"...Not for lack of trying. But Ilberd didn't know. He thought the Bull of Ala Mhigo had grown fat and complacent─that my story set a bad example for our countrymen."},{"name":"RAUBAHN","text":"\"Forget your homeland and chase the Ul'dahn dream!“ A fine, impossible dream which gave men the strength to endure their hardships and try to make new lives for themselves here..."},{"name":"RAUBAHN","text":"So the dream had to die. He would kill me, stir up the disillusioned, arm them at the Monetarists' expense, and then...and then..."},{"name":"RAUBAHN","text":"...Forgive me. The Scions paid the price of my failings."},{"name":"RAUBAHN","text":"The gods know, I've no shortage of debts to repay─of vows to keep and duties to discharge. But mark me well, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>: there will be a reckoning. Mayhap not today, mayhap not tomorrow, but a reckoning there will be."},{"name":"SYSTEM","text":"...A refugee of a fallen nation, he had risen from the depths of poverty to claim a seat on the Syndicate. Yet for all his great deeds, one was left undone. And like sands through an hourglass, the years slipped away...taking with them an old friend's hope..."},{"name":"SAMPLEKIHEI","text":"By the Fury, is that you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? Forgive me, but...what reason could you possibly have for returning to this godsforsaken place?"},{"name":"SAMPLEKIHEI","text":"...Mayhap it is fate which brings you here on this day of introspection and reflection."},{"name":"SAMPLEKIHEI","text":"We are come to Gorgagne Mills to accept the surrender of a half-dozen heretics who once fought for the Lady Iceheart. If you are intending to visit the cellars, I would ask that you do nothing to unsettle them."},{"name":"SAMPLEKIHEI","text":"These rumors of a general amnesty for Lady Iceheart's followers have caused no small amount of dissent in the ranks... 'Twas not so long ago that they were ambushing our convoys, after all. But if it is to be a choice between reconciliation and a return to violence, I choose reconciliation."},{"name":"HERETIC01476","text":"Wait, I know you! You were at the amphitheatre with the dragonslayer!"},{"name":"HERETIC01476","text":"I...I suppose we owe you an apology. When you came to us seeking to parley, we were sure it was a scheme to lure out our lady. &lt;sigh&gt; We were sure about a lot of things..."},{"name":"HERETIC01476","text":"...When she first shared her revelation─when she told us that she was not Saint Shiva reborn─we assumed it was a test. For had we not prayed for salvation? Had she not descended to deliver us from evil?"},{"name":"HERETIC01476","text":"She replied that our prayers were but fuel for a fever dream─a construct born of desperation and denial. She was no savior, she said."},{"name":"HERETIC01476","text":"But when we marched upon Ishgard regardless, she pulled us from the brink of oblivion, and implored us to find another way. And here we are, ready to lay down our arms at last..."},{"name":"SAMPLEKIHEI","text":"It's time."},{"name":"HERETIC01476","text":"She considered you a friend.<br>Had things had been different, mayhap we could have been friends too. Farewell."},{"name":"SYSTEM","text":"...Forsaken by gods and men, they found salvation in a revelation. They would take up arms against their own kind to set ancient wrongs to right. Cut out Ishgard's festering heart, and the war would be over. This they knew, believed with all their being...until their savior told them their efforts would be for naught..."},{"name":"JANTELLOT","text":"Well, if it isn't the great Warrior of Light <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> who slew the dread wyrm Nidhogg, bringing an end to a thousand years of war─<span class=\"emphasis\">and my very livelihood</span>!"},{"name":"JANTELLOT","text":"Well, go on then─strike me down and finish the job! Stab me right in the heart! I'll even lend you my spear, if you like! After all, <span class=\"emphasis\">I won't be bloody needing it</span>!"},{"name":"JANTELLOT","text":"...Bwahahaha! Tell me true─for a moment, I had you fooled. Ye gods, as if I could hate the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who rid us of Nidhogg!"},{"name":"JANTELLOT","text":"Oh, and lest you worry, that business about me losing my livelihood couldn't have been further from the truth. In point of fact, peace is proving surprisingly lucrative!"},{"name":"JANTELLOT","text":"As our nation's ties with Hraesvelgr's brood have grown stronger and our interests in Dravania have begun to expand, we have seen a marked increase in the number of travelers on the road. Needless to say, said travelers require protection, which we are only too happy to provide."},{"name":"JANTELLOT","text":"Granted, such work will not earn you a lordship like slaying a dragon might, but it pays well and is far less prone to end in incineration─which seems a reasonable enough compromise, all things considered."},{"name":"SYSTEM","text":"...As long as there are wars to fight, there will be those who take up arms not out of hatred or even a sense of duty, but for want of better employment. When presented with an alternative, such individuals may gladly trade their swords for scythes─or, failing that, pledge them to a more worthy cause..."},{"name":"JANTELLOT","text":"A pity I was not there with you on the Steps of Faith, to share in the honor and the glory of Nidhogg's defeat..."},{"name":"MARCECHAMP","text":"Somethin' the matter, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>? Gnath givin' you trouble?"},{"name":"MARCECHAMP","text":"...A journey of remembrance, eh? Gods, it feels like only yesterday that Ysayle turned up in Tailfeather with you in tow. Back into our lives, an' gone all too soon..."},{"name":"MARCECHAMP","text":"Did I ever tell you how we found her, five years back? In a torpor, out in the forest, all by her lonesome? Aye, well, we weren't about to leave her there, so we carried her back here an' tended to her till she woke up."},{"name":"MARCECHAMP","text":"Didn't say a word for days, Ysayle. Just sat there and stared up at the sky, as if the ground held nothin' for her. An' it didn't, we learned, when she finally spoke."},{"name":"MARCECHAMP","text":"Now, you might think she's not one to smile, but if you'd seen her in those years that followed... &lt;sigh&gt; Then, one day, all of a sudden, she says she's got a truth that must be shared. Up and leaves for the gods know where. An' that was the last we heard of her...for a time."},{"name":"MARCECHAMP","text":"\"Redemption's not beyond us, friends! Come an' hear the truth! Come an' hear the Lady Iceheart speak!“ An' they did, from far an' wide─or so the story went. Some said there was nothin' in it. But I knew. I knew."},{"name":"MARCECHAMP","text":"...I think, <span class=\"highlight\">Forename</span>, that deep down, most folk want to do right by themselves an' by others. An' they try, oh how they try. You do, certainly. An' so did she."}],"reward":{"gil":1994,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67011]},"next":[67013]},"partials":[{"type":"npc","id":"1016809","obj":{"i":1016809,"n":"Higiri","l":67,"q":2}},{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"npc","id":"1012345","obj":{"i":1012345,"n":"House Durendaire Knight","l":2200,"q":3}},{"type":"npc","id":"1017119","obj":{"i":1017119,"n":"Penitent Heretic","l":2200,"q":1}},{"type":"quest","id":"67011","obj":{"i":67011,"n":"The Paths We Walk","g":65,"l":"Fortemps Manor","s":60}},{"type":"quest","id":"67013","obj":{"i":67013,"n":"The Legacies We Leave","g":65,"l":"The Dravanian Forelands","s":60}}]}