{"quest":{"name":"Unidentified Flying Object","location":"Idyllshire","id":67016,"patch":3.55,"sort":7,"repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1017654,"target":1017654,"genre":18,"journal":["Slipslix's head may be buried in a book, but it's clear from his manner that he's in dire need of a research assistant.","Recent rumors surrounding the appearance of a flying monstrosity in the vicinity of Dun Scaith have been troubling Slipslix. You resolve to aid him by traveling to the floating island, that you might track down some concrete evidence of the being's existence. The goblin tasks you with procuring a piece of this strange entity, in hopes that it will bring him closer to revealing the truth behind its identity.<br><br>※Dun Scaith can be accessed via the Duty Finder.","Your journey bears fruit as you do battle with the airborne menace, obtaining a fragment of its armor. Slipslix will doubtless be eager to have a firsthand look at the spoils.","It becomes apparent that the creature sighted near Dun Scaith was a killing machine created long ago by the Allagan Empire. Slipslix theorizes that it mistook a mighty voidsent on the island for a primal, setting out to obliterate it. Slipslix presents you with a curious sheet of metal retrieved from the ancient weapon, inviting you to deliver it to his compatriot Slimthix and claim your well-deserved reward."],"objectives":["Enter Dun Scaith.","Give the Allagan weapon scrap to Slipslix."],"dialogue":[{"name":"SLIPSLIX","text":"Pshhh... Shkohhh... Slipslix has ear-catched much of uplander's adventures. Yes, skystealers are always trading tongueflaps about uplander when they come to make busydeals with Slipslix."},{"name":"SLIPSLIX","text":"Slipslix has also ear-catched that uplander has been to floatyrock Dun Scaith. This is Slipslix's lucky day!"},{"name":"SLIPSLIX","text":"Slipslix has also ear-catched that uplander is planstriking assault on floatyrock Dun Scaith. This is Slipslix's lucky day! Widehearted uplander would be happy to do hand-lending for Slipslix while uplander is there, yes?"},{"name":"SLIPSLIX","text":"Skystealers trade tongueflaps about giant miscreation seen near Dun Scaith. Gives gobbie the shiveryshakes!"},{"name":"SLIPSLIX","text":"Flighty-beast, ancient giant of whirlycogs...addlebrained guessings spill from uplanders' braincases, but Slipslix would seek true knowings!"},{"name":"SLIPSLIX","text":"Go to Dun Scaith and rip-take part of monster. Will not be easygoings, but uplander can bring back part to Slipslix, yes?"},{"name":"SLIPSLIX","text":"Go to Dun Scaith and rip-take part of monster. Will not be easygoings, but uplander can bring back part to Slipslix, yes?"},{"name":"SYSTEM","text":"The item Slipslix seeks can be obtained by completing the raid “Dun Scaith.”"},{"name":"SLIPSLIX","text":"Pshhh... Shkohhh... Uplander is before Slipslix's eyes once more. Today too is Slipslix's lucky day!"},{"name":"SLIPSLIX","text":"Primal-blasting weapon piece gives gobbie heartthumps! But still need to rip-take more!"},{"name":"SLIPSLIX","text":"Backtrack to Dun Scaith and rip-take more pieces! Slipslix will give adventurer more sheets if adventurer does good sweatworking. Slipslix gives wordbond!"},{"name":"SLIPSLIX","text":"Pshhh... Shkohhh... Gobbie needs adventuring uplander. One strong enough to hand-lend with rumor research."},{"name":"SYSTEM","text":"In order to undertake this quest, you must first prove your strength by unlocking the raid “Dun Scaith.”"},{"name":"SLIPSLIX","text":"Dawdling here won't give hand-lending to Slipslix's research! Go with fastness to Dun Scaith and rip-take creaturebits. Uplander is Slipslix's only hope!"},{"name":"SLIPSLIX","text":"Dawdling here won't give hand-lending to Slipslix's research! Go with fastness to floatyisle and rip-take more from giant of whirlycogs. Uplander is Slipslix's only hope!"},{"name":"SLIPSLIX","text":"Pshhh... Shkohhh... Did uplander find miscreation? Rip-took part for Slipslix, yes?"},{"name":"SLIPSLIX","text":"<span class=\"emphasis\">This</span> is what uplander rip-took from giant floaty-thing in Dun Scaith? Good gobbies in heavens! Slipslix eyecatches same-looking object before!"},{"name":"SLIPSLIX","text":"This comes from Allagan primal-blasting whirlycog! But what is it doing on floatyrock Dun Scaith? Just thinking about it makes Slipslix's braincase painthrob."},{"name":"SLIPSLIX","text":"Wait! Uplander saw many voidsent on floatyrock, yes? Maybe whirlycog mistakes voidsent for primal, and starts blasting?"},{"name":"SLIPSLIX","text":"Slipslix must research this theory, and research with fastness! Knowing truth may be uncovered gives Slipslix heartthumps and shiveryshakes!"},{"name":"SLIPSLIX","text":"And do not think that Slipslix has forgotten wordbond! In return for hand-lending, Slipslix is happy to share shiny riches with uplander."},{"name":"SLIPSLIX","text":"Take to Slimthix, and Slimthix will fancycraft treasure worthy of uplander's sweatwork! Slipslix hopes to count on uplander again!"},{"name":"SLIPSLIX","text":"Pshhh... Shkohhh... Has uplander brought primal-blasting whirlycog part for Slipslix?"},{"name":"SLIPSLIX","text":"Another scrap from primal-blasting whirlycog? No tongueflaps can express Slipslix's gratitude! Uplander's hand-lending will lead Slipslix to greater and greater knowings!"},{"name":"SLIPSLIX","text":"Here it is! Take to Slimthix to get reward for good sweatworking!"}],"reward":{"items":[{"id":17521}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67822]}},"partials":[{"type":"npc","id":"1017654","obj":{"i":1017654,"n":"Slipslix","l":2082,"q":1}},{"type":"item","id":"17521","obj":{"i":17521,"n":"Proto Ultima Heat Shielding","l":1,"c":26502,"t":61}},{"type":"quest","id":"67822","obj":{"i":67822,"n":"Freedom for Our Skies","g":18,"l":"The Parrock","s":4,"f":1}}]}