{"quest":{"name":"The Legacies We Leave","location":"The Dravanian Forelands","id":67013,"patch":3.3,"sort":60,"eventIcon":71221,"issuer":1011916,"target":1017123,"involved":[1011928,1011935,1012077],"genre":65,"journal":["Marcechamp would see you on your way.","\"To ye who ask of things to come:<br>Give thought to what is past and gone.“<br><br>With the long-dead poet king's words still ringing in your ears, you continue your pilgrimage, retracing the steps you took during your time in Dravania.<br><br>At once, Marcechamp saw she had changed. The fire was still there, but tempered somehow. Even so, he would not spoil things by asking. Ysayle was returned, and though it be but for a moment, it was enough...","No longer bound to the will of the many, the Vath were free to walk their own path. Thus reborn, they would write the first chapter of a new history to be passed on to future generations. And as their culture grew older and richer, so too would their story...","In the chorus, the Dravanian fallen could rise once more. For none are dead whose names yet echo in the heavens, and the song would not end until the last voice fell silent. Heroes and villains, sinners and saints─all would live again...","Even in the farthest reaches of distant, dangerous lands, one may chance upon a friendly face. Though the moogles were given to mischief and unconcerned by the troubles of the outside world, they came to understand Ishgard's plight and agreed to lend their aid. Eventually, that is...","The crackling warmth of Alphinaud's campfire. The savory waft of Ysayle's bubbling stew. The soft snoring of Moghan, asleep on the grass. A cold wind blew that night as well, and on the morrow they mounted the steps and blew the horn. But having climbed to the summit with hope in their hearts, they descended dejected, weighed down by truths too grim to contemplate...","Nanamo lived, not by the grace of the gods, but by the guile of an old man. Lolorito claimed the ruse had been necessary to expose the traitors in their midst and unravel their machinations. Such schemes are not without cost, however, and a merchant must needs pay his debts...","Perhaps the principled choice would have been to refuse the coin, to condemn Lolorito's pretense at charity. Indeed, a part of her wanted to do far worse. But a ruler is required to take a wider view, to consider the practical realities...and Nanamo had not forgotten what had come of following her heart..."],"objectives":["Visit the Vath storyteller at Loth ast Vath.","Visit Vidofnir in Anyx Trine.","Visit Moglin at Moghome.","Make camp in the ruins southeast of Zenith.","Visit the Royal Promenade in Ul'dah.","Speak with the Sultansworn elite."],"dialogue":[{"name":"MARCECHAMP","text":"Apologies. You came here to think on your own memories, not listen to mine. I take it the Gnath are next?"},{"name":"MARCECHAMP","text":"Right, then. If we're to do this properly, you'll need to gather up your “incentives,” same as before. 'Case you've forgotten, that's a basket of fresh caelumtree fruit, a good-sized jar of landtrap nectar, an' a dirty great cartload of young nanka flesh."},{"name":"MARCECHAMP","text":"...Ack! Come<span class=\"emphasis\"> on</span>, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Surely you can't be that bloody daft!? You're more than welcome in their village already! Safe travels."},{"name":"MARCECHAMP","text":"Remind me, how did you manage to harvest the caelumtree fruit again...? Ah, yes, the dragoon. Charmin' fellow, as I recall."},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; Hunter of dragons and gods, I bid you welcome. What would you ask of me this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">day</span></span>?"},{"name":"VATHSTORYTELLER","text":"...Once, we would have had no conception of what you speak. The Onemind does not forget, but we do. It can be most distressing."},{"name":"VATHSTORYTELLER","text":"To remember is not enough. One must strain and give words to memory, and inscribe words upon parchment. This is the chronicler's calling."},{"name":"VATHSTORYTELLER","text":"He wrote of how you came to Loth ast Vath, and how you left to slay Ravana, and how the young hunter trained with the old hunter while you were away."},{"name":"VATHSTORYTELLER","text":"We shall treasure these memories─this history you have given us. And when new Vath join us, we shall share it with them as well."},{"name":"SYSTEM","text":"...Bound no longer to the will of the many, they were now free to walk their own path. Thus reborn, they would write the first chapter of a new history to be passed on to future generations. And as their culture grew older and richer, so too would their story..."},{"name":"VATHSTORYTELLER","text":"The ruby creature the young hunter commands─we wonder, is it delicious? We would never eat his, of course..."},{"name":"VIDOFNIR","text":"Friend of Ysayle, warrior of warriors─thou art ever welcome in Anyx Trine. What bringeth thee to us this <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>?"},{"name":"VIDOFNIR","text":"...There is much wisdom to be gained from looking to the past. To walk half-remembered paths, and mark anew their twists and turns. We too do this, though not through pilgrimage, nor less the written word beloved of thy historians."},{"name":"VIDOFNIR","text":"In song do we preserve the deeds of our lost and chronicle the passing of the ages. Naught hath greater power to stir our hearts. 'Twas a dirge of profoundest sadness that roused Nidhogg's brood to action. A dirge which soundeth no more."},{"name":"VIDOFNIR","text":"Now a <span class=\"emphasis\">new</span> song riseth to fill the void. One of hope rekindled, of war's end and peace's rebirth. I shall sing of thee and Ysayle ever after, that all may know and remember."},{"name":"SYSTEM","text":"...In the chorus, the fallen could rise once more. For none are dead whose names yet echo in the heavens, and the song would not end until the last voice fell silent. Heroes and villains, sinners and saints─all would live again..."},{"name":"VIDOFNIR","text":"We sing of Nidhogg, even now─not to praise him, but to speed his soul unto its rest, for even he is deserving of peace."},{"name":"MOGLIN","text":"Well yank my pom and call me a mole-bat! I certainly wasn't expecting to see you today. Still calling yourself <span class=\"highlight\">Forename</span>? Er...not that there's anything wrong with that, kupo! A-Anyway, what are you doing here?"},{"name":"MOGLIN","text":"Thank heavens for that! I was sure you were going to ask for help with yet another one of your irks─ irks...<span class=\"emphasis\">citing</span> quests. But <span class=\"emphasis\">by all means</span>, we'd love to pass the time reminiscing about the good ol' days!"},{"name":"MOGLIN","text":"And when better than now, kupo! What with your friends visiting, and all. Wait here and I'll fetch them!"},{"name":"KANESENNA","text":"Full glad am I to see you again, <span class=\"highlight\">Forename</span>, and in Moghome, of all places."},{"name":"KUPLOKOPP","text":"Kupopo, it really is you! And just when we were about to leave!"},{"name":"KANESENNA","text":"I think it wonderful, this pilgrimage of yours. A final reflection upon the past, that you might face the future with eyes unclouded and a heart at peace..."},{"name":"KANESENNA","text":"Few would deny that the events of recent days warrant such contemplation. When last we stood in this place, I daresay none among our number would have believed what was to follow─young Estinien least of all. Upon learning what befell him at Azys Lla, I confess I thought him lost. But when Master Alphinaud told me of your great struggle, and of his salvation, I was reminded of your talent for the impossible."},{"name":"MOGLIN","text":"If you ask me, he seemed altogether too <span class=\"emphasis\">stubborn</span> to die─though I suppose it is no small feat to evict a spite-filled wyrm once it has made its home in one's head..."},{"name":"KANESENNA","text":"With Nidhogg's passing, the children of Ishgard and Dravania may at last look to the future. It is my hope, however, that they will not forget the deeds of history, nor the many thousands of lives lost in their conflict. For only through remembrance will they avoid the mistakes of the past."},{"name":"KANESENNA","text":"We thank you again for your hospitality, Chieftain Moglin, and pray that you will one day allow us to extend you the same courtesy."},{"name":"KANESENNA","text":"I wish you well on your journey, <span class=\"highlight\">Forename</span>. May you ever walk in the light of the Crystal."},{"name":"KUPLOKOPP","text":"Until we meet again, kupo!"},{"name":"SYSTEM","text":"...Even in the farthest reaches of distant, dangerous lands, one may chance upon a friendly face. Though given to mischief and largely unconcerned by the troubles of the outside world, they came to understand Ishgard's plight and agreed to lend their aid. Eventually, that is..."},{"name":"MOGLIN","text":"By all means, feel free to visit us again! If you like, we can even find some chores for you to do, for old times' sake!"},{"name":"SYSTEM","text":"...The crackling warmth of Alphinaud's campfire. The savory waft of Ysayle's bubbling stew. The soft snoring of Moghan, asleep on the grass."},{"name":"SYSTEM","text":"A cold wind blew that night as well, and on the morrow they mounted the steps and blew the horn. But having climbed to the summit with hope in their hearts, they descended dejected, weighed down by truths too grim to contemplate..."},{"name":"LILILA","text":"(-???-)You there! Over here, quickly!"},{"name":"LILILA","text":"(-???-)Hehehe! I should have known you would see through my disguise<span class=\"alternative-container\"><span class=\"alternative\">.</span><span class=\"alternative\">─after all, you <span class=\"emphasis\">have</span> seen it before.</span></span> But enough talk─we cannot linger here, lest the guards recognize their sultana."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)As you may have deduced, I was...taking the air outside the palace when I saw you standing there, staring off into space. Have you something on your mind?"},{"name":"LILILA","text":"(-Nanamo Ul Namo-)...I understand completely. So much has happened... So much has <span class=\"emphasis\">changed</span>. And all in so short a space of time. Even now, I struggle to make sense of it all."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)But one thing, at least, is abundantly clear: I owe you an immense debt of gratitude, for all you have done on my behalf, and on behalf of those whom I hold dear."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)After I awoke, Papashan told me everything. It was...a lot to take in. But nothing could prepare me for what Lord Lolorito had to say."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)That ruthless, manipulative swine came before me and expressed <span class=\"emphasis\">regret</span> for what had come to pass...and, thinking to make amends, offered all of Teledji Adeledji's assets, as well as half of his own personal fortune, to the crown.<br>...And I accepted."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)Long did I debate how best to use this wealth. There is no end to the troubles facing our nation, and no shortage of worthwhile causes. Yet none among our people have suffered more than the refugees, and it is they who shall be first to receive aid and succor."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)...There is also the matter of the terrible wrongs committed against you and yours...for which I am in large part responsible. Nay, do not protest. It is the truth. Accordingly, I have set aside monies to aid in the Scions' rebuilding...if you would have them."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That would be most welcome. Thank you, Your Grace."},{"name":"A1","text":"...Mayhap it would be best if we did not."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)Pray do not thank me. Not after all you have suffered. And know that I do not think to atone for my mistakes with money. It is but a tool which I would see put to good use."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)I see.<br>...I trust you know that I would never presume to atone for my mistakes with money. I only wish to see it put to good use. Assuming you have no objections, I shall pledge the funds to the continued development of Revenant's Toll."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)Oh, listen to me... &lt;sigh&gt; So much for enjoying a moment's respite outside the palace walls. It rather seems as if I have brought my responsibilities with me. I suppose I should return..."},{"name":"PAPASHAN","text":"(-Papashan-)Lady Lilira! Lady Lilira! You must come home at once! <span class=\"emphasis\">Father</span> is worried sick, you know!<br>Gah, confound it! You lot, search this area! I <span class=\"emphasis\">know</span> she came through here..."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)...On the other hand, it is essential that a ruler see firsthand how her subjects go about their daily lives, and I have not visited the markets in <span class=\"emphasis\">weeks</span>... 'Twould seem a shame to let this opportunity go to waste..."},{"name":"LILILA","text":"(-Nanamo Ul Namo-)<span class=\"highlight\">Forename</span>─might I impose on you to have a brief yet cordial conversation with those Sultansworn? I leave the choice of subject matter up to you. Take care!"},{"name":"SOLDIER01477","text":"Ah, I beg your pardon, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, but did you perchance see a young Lalafellin noblewoman pass this way? She would be around your height..."},{"name":"SOLDIER01477","text":"Are you certain? Oh dear, oh dear... Master Papashan said this might happen, but I never truly believed he was serious..."}],"reward":{"gil":1912,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67012]},"next":[67014]},"partials":[{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1017123","obj":{"i":1017123,"n":"Sultansworn Elite","l":41,"q":2}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"npc","id":"1011935","obj":{"i":1011935,"n":"Vidofnir","l":2000,"q":10}},{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"quest","id":"67012","obj":{"i":67012,"n":"The Oaths We Swear","g":65,"l":"Mor Dhona","s":60}},{"type":"quest","id":"67014","obj":{"i":67014,"n":"The Triumphs We Share","g":65,"l":"Ul'dah","s":60}}]}