{"quest":{"name":"The Triumphs We Share","location":"Ul'dah","id":67014,"patch":3.3,"sort":60,"eventIcon":71221,"issuer":1017123,"target":1012097,"involved":[1006756,1012065,1012251,1012252,1012253,1017118],"genre":65,"journal":["The Sultansworn elite sports a faintly troubled expression, as if straining to remember something important.","\"To ye who ask of things to come:<br>Give thought to what is past and gone.“<br><br>With the long-dead poet king's words still ringing in your ears, you continue your pilgrimage, retracing the steps you took in the days following your exile.<br><br>What cruel fate, to lose her father as a child, and be compelled to rule in his stead. And how the years had tempered her dreams and taught her, sometimes brutally, the price of naivety. Though outwardly unscathed by her ordeal, it was a wiser and more wary Nanamo who reclaimed the throne...","\"For the freedom of all.“ It had begun with an oath and ended with a betrayal, as the conspirators turned on their comrades for coin and country. The good and true were beaten and imprisoned, or else butchered where they stood. But even in their darkest moments, Alianne and the other loyalists knew that the dawn's light would shine again...","Despite the many hardships they had endured─or perhaps because of them─Biggs and Wedge greeted every new challenge with a smile. Their workshop their battlefield, their tools their weapons, they invariably rose to the occasion, delivering ingenious solutions to seemingly insoluble problems...","Through tempestuous winds they carved a path, breaching the dread wyrm's sanctum, and there did they put him to the sword. Yet in the wake of hard-fought victory were secrets laid bare in a vision dark and disturbing. The legacy of the fathers, bequeathed to their sons and passed down through the generations... Old blood enduring in the new, the mark of original sin...","A world apart from the opulence of the Pillars, Hilda and her people toiled, shrouded in the haze of the Brume. Sentenced to a life of hardship by birth, they dreamed of revolution as children dream of faeries. Then one came and went, and they suddenly found themselves with a seat at the table...","An earnest, good-natured people, the Zundu tribe had borne witness to the rage of their beloved god's twisted manifestation, and proclaimed it to be false. By the grace of kind travelers were they duly delivered from its wrath, the mad god's death signaling the birth of a new hero...","Y'mhitra knew that her sister had been under no illusions as to the dangers of the life she had chosen. Should the worst come to the worst, Y'shtola would do what needed to be done─pay any price, make any sacrifice, and that without hesitation. She was a woman of conviction, deserving of respect and admiration...and no small amount of worry...","From the ashes of an abandoned colony would their brave new nation rise─a free and equal society for goblin and man, in which scholars and craftsmen could work together to build a better life. It would be nothing short of a paradise...in theory, at least..."],"objectives":["Visit Alianne in Revenant's Toll.","Visit the Skysteel Manufactory in Ishgard.","Visit the Monsterie in the Churning Mists.","Visit Hilda in Ishgard.","Visit Lonu Vanu at Ok' Zundu.","Visit Y'mhitra in Gridania.","Visit Slowfix in Idyllshire."],"dialogue":[{"name":"SOLDIER01477","text":"W-Wait, I know you! You're <span class=\"highlight\">Forename</span>! <span class=\"highlight\">Forename Surname</span>!"},{"name":"SOLDIER01477","text":"What a stroke of luck! I can think of none better qualified to help us. You see, it is no mere noblewoman that we seek─"},{"name":"SOLDIER01477","text":"Ah, but Master Papashan was most explicit about the need for secrecy... Pray forget I mentioned it. We will find the su─ We will find <span class=\"emphasis\">the lady</span> on our own."},{"name":"SYSTEM","text":"...What cruel fate, to lose her father as a child, and be compelled to rule in his stead. And how the years had tempered her dreams and taught her, sometimes brutally, the price of naivety. Though outwardly unscathed by her ordeal, it was a wiser and more wary Nanamo who reclaimed the throne..."},{"name":"ALIANNE","text":"There you are, <span class=\"highlight\">Forename</span>. Higiri told me of your pilgrimage. I knew it was only a matter of time before you sought me out."},{"name":"ALIANNE","text":"I too have been reflecting on the choices which shaped my path. When I took to the road with my grandfather...when I joined the Crystal Braves...when I tried and failed to warn you before the banquet..."},{"name":"ALIANNE","text":"I had my suspicions about Wilred's death─that it was the work of a Garlean spy within our ranks. But I could not be sure who was involved, hence my desire to speak with you in private."},{"name":"ALIANNE","text":"I thought long and hard about how to approach you without arousing suspicion... Mayhap too long. Eventually, I decided to arrange a meeting through Mistress Momodi. Little did I know that bastard Laurentius had seen me do it."},{"name":"ALIANNE","text":"Shortly thereafter, the Fourth received urgent summons. Needless to say, I had no choice but to answer...and soon found myself at the mercy of Captain Ilberd's band of traitors."},{"name":"ALIANNE","text":"They confined me to the Rising Stones, along with others still loyal to the Scions─Riol, Ephemie, Aergmhus... Quite what they planned to do with us, I couldn't say. Mayhap they thought we would turn, given time. The fools..."},{"name":"ALIANNE","text":"Lieutenant Yuyuhase bid the Third keep us under constant guard, but when Captain Ilberd moved to carry out General Raubahn's execution, they were forced to withdraw all but a token force, which we took by surprise one night. And then it was over."},{"name":"ALIANNE","text":"One might argue that it turned out better than it had any right to, all things considered. Still, there are nights when I lie awake wondering, if I had done things differently─if I had been more careful, or more decisive─what then..."},{"name":"ALIANNE","text":"But there is naught to be gained from thinking thus. We must count our blessings, must we not? We are still here, and most of what was broken can be rebuilt. You will see, <span class=\"highlight\">Forename</span>. You will see."},{"name":"SYSTEM","text":"...“For the freedom of all.” It had begun with an oath and ended with a betrayal, as the conspirators turned on their comrades for coin and country. The good and true were beaten and imprisoned, or else butchered where they stood. But even in their darkest moments, they never stopped believing that the dawn's light would shine again..."},{"name":"WEDGE","text":"Why, hello there, <span class=\"highlight\">Forename</span>! Fancy meeting you here!"},{"name":"BIGGS","text":"Reminiscing about the glory days, eh? Aye, we spent many a sleepless night hammering away in that corner of ours. How's your manacutter holding up, by the way?"},{"name":"BIGGS","text":"Hah! That's good to hear. Not that I had any doubts, like─our craftsmanship's second to none!"},{"name":"WEDGE","text":"Quite right! It will take more than swirling winds and raging dragons to bring <span class=\"emphasis\">her</span> down─and that, my friend, is an Ironworks' guarantee!"},{"name":"BIGGS","text":"Speaking of which─on the back of the field test's success, we've gone ahead and licensed the design for mass production. Soon, the Skysteel Manufactory will be churning out manacutters by the dozen!"},{"name":"BIGGS","text":"...Which is why we're here today, as a matter of fact─to make sure their machinists don't bugger anything up."},{"name":"WEDGE","text":"Apparently, adventurers have been queuing up to place an order─and even some sky pirates! Ah, just imagining the Sea of Clouds teeming with our creations fills me with a father's pride!"},{"name":"BIGGS","text":"Right, then─that's enough patting ourselves on the back! We've got to make sure the 'cutters are up to snuff, or Jessie'll never let us hear the end of it. From now till we finish, there'll be no more breaks, distractions, and not one <span class=\"emphasis\">wink</span> of sleep, d'you hear me!?"},{"name":"WEDGE","text":"Oh... &lt;mumble&gt; &lt;mumble&gt; ...ing cart chocobo."},{"name":"BIGGS","text":"Well, we'll leave you to it. Till next time, eh!?"},{"name":"SYSTEM","text":"...Despite the many hardships they had endured─or perhaps because of them─they greeted every new challenge with a smile. Their workshop their battlefield, their tools their weapons, they invariably rose to the occasion, delivering ingenious solutions to seemingly insoluble problems..."},{"name":"SYSTEM","text":"...Through tempestuous winds they carved a path, breaching the dread wyrm's sanctum, and there did they put him to the sword. Yet in the wake of hard-fought victory were secrets laid bare in a vision dark and disturbing."},{"name":"SYSTEM","text":"The legacy of the fathers, bequeathed to their sons and passed down through the generations... Old blood enduring in the new, the mark of original sin..."},{"name":"HILDA","text":"And there <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is, at last. Gibrillont said you were wanderin' all over, reminiscin' about days gone by. Seems a bit soon if you ask me."},{"name":"HILDA","text":"It's not like I don't understand, though. Some days, I'll be walkin' through the Brume, same as normal, and it'll hit me all of a sudden just how much has changed for us─though I know it's a bit different from what you've been through."},{"name":"SYMME","text":"Puts me in mind of the first time I saw <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> friends up near the aetheryte, being shown around by that House Fortemps man."},{"name":"HILDA","text":"Oh? You never told me you'd met before."},{"name":"SYMME","text":"It weren't so much a meeting as a <span class=\"emphasis\">heckling</span>, to be honest. When I heard their guide warning them off paying a visit to the Brume, it stuck in my craw. And you've got to admit that Master Alphinaud's the spitting image of a snotty little lordling..."},{"name":"HILDA","text":"A little lordling that went on to fight two knights of the Heavens' Ward with <span class=\"highlight\">Forename</span> here in a trial by combat─not to mention helpin' retake the Vault from the True Brothers. Fury have mercy...it feels like a bleedin' <span class=\"emphasis\">lifetime</span> ago, don't it?"},{"name":"EUDESTAND","text":"'Cause it was. What we've got now's nothin' like what came before. It's a bleedin' rebirth is what it is."},{"name":"HILDA","text":"Cold comfort to the folk who died gettin' us here. Still, this peace is ours, and we owe it to ourselves to make the most of it."},{"name":"HILDA","text":"...Meanin' we've got to work twice as hard to make the Brume a better place! And no more harassin' blue bloods neither!"},{"name":"SYMME","text":"(-Symme and Eudestand-)Aye, aye!"},{"name":"SYSTEM","text":"...A world apart from the opulence of the Pillars, they had toiled, shrouded in the haze of the Brume. Sentenced to a life of hardship by birth, they dreamed of revolution as children dream of faeries. Then one came and went, and they suddenly found themselves with a seat at the table..."},{"name":"HILDA","text":"I know you got Ser Charibert in the end, but I have to admit, I'm still a little bitter that it wasn't me. Gave me reason to practice my marksmanship, though."},{"name":"SYMME","text":"Hahaha! Just goes to show that you can't judge a man by appearances, eh? Nor tell what fate's got in store for you. All the more reason to watch your words when you're in your cups!"},{"name":"EUDESTAND","text":"Perhaps it's time the watch expanded its duties. Maybe help out with the reconstruction efforts..."},{"name":"LONUVANU","text":"Ho, clouds part and let shine brilliant sun upon Lonu Vanu! Great netherling warrior returns to Ok' Zundu, and on pilgrimage of remembrance? Well, well!"},{"name":"LONUVANU","text":"We bid you warmest welcome, slayer of false gods and champion of fallen Gundu─whose fledgling village continues to grow and prosper, now free from the shadow of Vundu oppression."},{"name":"LONUVANU","text":"Know that we will always be grateful to you for your victory over the ravenous White. No longer need we fear for the safety of our smallest islands."},{"name":"LONUVANU","text":"But Lonu Vanu is not one to forget netherling's first coming, when <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> saves us from certain death at the hands of the black ones, distant memory though it is."},{"name":"LONUVANU","text":"Yes! <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> many deeds are the stuff of legends! We shall remember the stories, and the hero's name, <span class=\"highlight\">Forename Surname</span>, for they are worthy of celebration now and ever after!"},{"name":"SYSTEM","text":"...An earnest, good-natured people, they had borne witness to the rage of their beloved god's twisted manifestation, and proclaimed it to be false. By the grace of kind travelers were they duly delivered from its wrath, the mad god's death signaling the birth of a new hero..."},{"name":"LONUVANU","text":"If it pleases netherling, you are welcome to partake of fresh wamouracampae before parting. Tender, supple flesh gives way to sticky─ No? Then as raging typhoon strips fields bare, Lonu Vanu shall devour all!"},{"name":"YMHITRA","text":"Well met, <span class=\"highlight\">Forename</span>. What brings you here this <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>?"},{"name":"YMHITRA","text":"Indeed... Though it seems an age, it was not all that long ago that we rescued Shtola from the Lifestream. How quickly we begin to forget even those memories most precious to us."},{"name":"YMHITRA","text":"In my defense, I might add that I have rarely missed an opportunity to make <span class=\"emphasis\">new</span> memories with my sister in the days since her return."},{"name":"YMHITRA","text":"Our conversations are largely on matters of scientific and professional concern─ancient Allagan technologies, primals, Ascians, and so forth. She has an insatiable thirst for knowledge, as you know."},{"name":"YMHITRA","text":"Yet while I understand her desire not to burden those around her with her troubles, and to carry on as she did before, I do worry that her willingness to manipulate her own aether to compensate for the loss of her sight may have dire repercussions..."},{"name":"YMHITRA","text":"...She never told you, then? But of course not. 'Twould rather have defeated the purpose."},{"name":"YMHITRA","text":"You should know that the technique she employs places a tremendous strain on her body. She is, of course, well aware of her limits...and more than willing to ignore them should she deem it necessary. I pray you see that she does not."},{"name":"YMHITRA","text":"Regrettably, she is wont to ignore my advice when it does not suit her. Yet given your shared experiences, mayhap she will be more willing to heed your warnings."},{"name":"SYSTEM","text":"...Her sister was under no illusions as to the dangers of the life she had chosen. Should the worst come to the worst, Y'shtola would do what needed to be done─pay any price, make any sacrifice, and that without hesitation. She was a woman of conviction, deserving of respect and admiration...and no small amount of worry..."},{"name":"YMHITRA","text":"Alas, my studies of Allagan technology have not yielded any earth-shattering revelations of late. Rest assured, however, that I will inform Tataru immediately should that unhappy state of affairs chance to change."},{"name":"SLOWFIX","text":"Pshkohhh... Why must governing great gobbie nation be so difficult!? Like herding coeurls. Stupid coeurls with muchly differing views on glorious nation's future direction!"},{"name":"SLOWFIX","text":"...Yes, yes, Slowfix knows he is letting emotions run wild. Uplander is welcome voice of reason!"},{"name":"SLOWFIX","text":"Not like when uplanders first returned to Idyllshire, yes? So much venom in that one's tongueflaps, calling gobbieflock <span class=\"emphasis\">thieves</span>! But Slowfix saw way to mutual understanding."},{"name":"SLOWFIX","text":"Citizenship in society first step in strengthening communal ties! Gives all vested interest in continued prosperity of egalitarian utopia!"}],"reward":{"gil":3147,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67013]},"next":[67015]},"partials":[{"type":"npc","id":"1017123","obj":{"i":1017123,"n":"Sultansworn Elite","l":41,"q":2}},{"type":"npc","id":"1012097","obj":{"i":1012097,"n":"Slowfix","l":2082,"q":15}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1012065","obj":{"i":1012065,"n":"Lonu Vanu","l":2100,"q":1}},{"type":"npc","id":"1012251","obj":{"i":1012251,"n":"Hilda","l":2300,"q":11}},{"type":"npc","id":"1012252","obj":{"i":1012252,"n":"Symme","l":2300,"q":10}},{"type":"npc","id":"1012253","obj":{"i":1012253,"n":"Eudestand","l":2300,"q":10}},{"type":"npc","id":"1017118","obj":{"i":1017118,"n":"Alianne","l":67,"q":1}},{"type":"quest","id":"67013","obj":{"i":67013,"n":"The Legacies We Leave","g":65,"l":"The Dravanian Forelands","s":60}},{"type":"quest","id":"67015","obj":{"i":67015,"n":"The Burdens We Bear","g":65,"l":"Idyllshire","s":60}}]}