{"quest":{"name":"Lathe to the Party","location":"North Shroud","id":67026,"patch":2.35,"sort":5,"icon":100262,"beast":5,"unlocksFunction":1,"eventIcon":71341,"issuer":1009199,"target":1009199,"involved":[1002804,1009204,1009610],"genre":42,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sezul has another request that requires a featherless one's touch.","With the construction of a new lathe in mind, Sezul has tasked you with obtaining a high-grade gearwheel. Speak with your fellow featherless one, Tataramu, and see if he has any ideas on where to begin your search.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","While discussing the subject of lathes, Tataramu recalls that just such a tool was used in his grandfather's workshop years ago. The eager designer reasons that Colson, a veteran Skyways employee, would know better than any what became of his grandsire's tools. Head to the Carline Canopy in Gridania, and track down Tataramu's aged acquaintance.","After explaining your predicament to Colson, the old man casts his mind back to the days when he first worked with Tataramu's grandfather. Though the company founder's original workshop has long since been dismantled, Colson suggests that you approach one of the old hands at the Bobbing Cork and ask if anything remains of Tatanora's tools. Travel to Fallgourd Float, and speak with Aeluuin.","You question Aeluuin about the lathe, but the inn worker appears unaware that such a workshop ever existed in Fallgourd. He does, however, mention a pile of old, unclaimed goods that have been gathering dust in the inn's storeroom. Search through the stack of antiques by the side of the Bobbing Cork, and check for any abandoned lathe parts.","Tataramu appears just as you locate the lathe gearwheel, having finally remembered where his grandfather's workshop used to be. Checking over the precious part, the young man notices a dedication written by his grandfather inscribed on its surface. Return to Ehcatl and hand the gearwheel to Sezul.","You deliver the gearwheel to Sezul, and the Ehcatl Nine chief confirms that the “Dezul Qualan” in the dedication is the same Ixal for whom he named the hybrid airship. It would appear that Sezul's mentor and Tataramu's grandsire had forged a friendship based on their mutual passion for aeronautics. Both Chief Totoloc and Tataramu cannot help but feel the guiding hand of fate in their growing partnership..."],"objectives":["Consult with Tataramu.","Speak with Colson in Gridania.","Speak with Aeluuin at the Bobbing Cork.","Search for the lathe gearwheel.","Deliver the lathe gearwheel to Sezul Totoloc."],"dialogue":[{"name":"SEZULTOTOLOC","text":"Squawk! Have need of <span class=\"highlight\">Forename</span>'s help, Sezul does!"},{"name":"SEZULTOTOLOC","text":"So close! So close, we are! Taking shape before our very eyes, <span class=\"emphasis\">Dezul Qualan</span> is!"},{"name":"SEZULTOTOLOC","text":"Hull for body. Engine for heart. Next, fashion muscle to transfer power to wings, we must!"},{"name":"SEZULTOTOLOC","text":"Developed by featherless ones, ceruleum technology was. Very advanced! First Ixal in history to design and build our own engine, we are!"},{"name":"SEZULTOTOLOC","text":"Function perfectly, main engine components do. Flawless was Tataramu's design! And abundance of materials for upcoming task, we have."},{"name":"SEZULTOTOLOC","text":"But tiny problem, there is! ...Maybe not so tiny! Squawk!"},{"name":"SEZULTOTOLOC","text":"Machine tool for cutting transmission parts, we have not!"},{"name":"SEZULTOTOLOC","text":"Many intricate gears and cogs harness power produced by engine. Propel propulsion system, they do!"},{"name":"SEZULTOTOLOC","text":"With one precision gearwheel...then make lathe to grind such parts, we could."},{"name":"SEZULTOTOLOC","text":"Our best hope, <span class=\"highlight\">Forename</span> is! Beg! Borrow! Steal! But have that gearwheel, we must!"},{"name":"SEZULTOTOLOC","text":"Only featherless ones have item we seek! Rest on <span class=\"highlight\">Forename</span>'s shoulders, fate of <span class=\"emphasis\">Dezul Qualan</span> does!"},{"name":"SEZULTOTOLOC","text":"Make new lathe, we must! With precision gearwheel, then craft intricate transmission parts, we can!"},{"name":"TATARAMU","text":"I was listening in on Sezul's lamentations. 'Twould seem we are in need of a new lathe...or failing that, a part that will allow us to build one."},{"name":"TATARAMU","text":"A gearwheel such as the one we seek must be of the highest degree of workmanship─should it be warped by even the smallest fraction, that imperfection will be reflected in the turning of the lathe and make the crafting of precision components impossible."},{"name":"TATARAMU","text":"No, it must be one made to extremely exacting specifications. I speak of the difference of a single hair's width here."},{"name":"TATARAMU","text":"In the entire realm of Eorzea, I could count on the fingers of one hand the master artisans who are capable of forging such a piece."},{"name":"TATARAMU","text":"And even should we be so fortunate as to secure the services of such a talented individual, we must consider the time it would take to craft the gearwheel... Our project might languish for weeks, if not months!"},{"name":"TATARAMU","text":"'Twould be far better were we to focus on obtaining an existing gearwheel. ...And then somehow convincing the owner to part with it. Hmmm..."},{"name":"TATARAMU","text":"A lathe, a lathe... Now where have I seen a lathe before? ...Ah, yes, I have vague memories of seeing one in my grandfather's workshop. Which was...somewhere outside the city."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>, that's it! You must return to Gridania and speak with Colson once more."},{"name":"TATARAMU","text":"He's been with Highwind Skyways since the beginning. If anyone were to know what's become of my grandfather's lathe, 'twould be Colson!"},{"name":"TATARAMU","text":"He will likely be in or around the Carline Canopy─the old man is never far from the airships when not attending to business!"},{"name":"TATARAMU","text":"Colson is an old hand at my father's company, and was well acquainted with my grandsire. He may remember what became of the tools from Grandfather's workshop...not to mention where the workshop actually was."},{"name":"COLSON","text":"Yes, yes, I remember you─my eyesight may be failing, but my mind is yet sharp, thank you very much. You're the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> Master Tataramu employed as his delivery <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Surely the materials I provided you with were sufficient, yes?"},{"name":"COLSON","text":"Hm? The young master wishes to know what became of the lathe from his grandfather's workshop? Well now, that does bring back memories."},{"name":"COLSON","text":"It must be nigh on fifty years ago now that I began my apprenticeship with Tatanora, a famous adventurer and businessman."},{"name":"COLSON","text":"I still recall the day he conceived his revolutionary enterprise: he proposed the idea of building passenger balloons that shared the principle─if not the purpose─of Ixali dirigibles."},{"name":"COLSON","text":"His company was the very first air travel service in the realm, and marked the birth of Highwind Skyways."},{"name":"COLSON","text":"Of course, it was not until around thirty years later, when Cid Garlond brought airship technology to Eorzea, that flights between cities became a regular occurrence."},{"name":"COLSON","text":"Those were the days, though... If I close my eyes I can still see the workshop─can still hear our excited optimism as Tatanora and I worked tirelessly on the construction of that first balloon..."},{"name":"COLSON","text":"Ahem. Pray excuse an old man his reminiscing. What were we speaking of? Ah yes, “lathes.”"},{"name":"COLSON","text":"I believe the lathe Master Tataramu refers to was the one we used in the old Fallgourd workshop."},{"name":"COLSON","text":"...But I'm afraid the place was shut down and dismantled for lumber after Tatabaru assumed management of the company. It was the end of an era, after all."},{"name":"COLSON","text":"I wonder if there are any still in Fallgourd who remember that time... Perhaps you might try speaking with the employees of the Bobbing Cork?"},{"name":"COLSON","text":"“Spread your wings and soar”... That is the Skyways slogan. When I first heard Tatanora utter that phrase, I knew at that moment what my life's work would be."},{"name":"COLSON","text":"All that I am now began in that workshop─shaped by my craft even as I shaped wood and metal. I find myself hoping the lathe you seek has somehow survived..."},{"name":"AELUUIN","text":"Welcome to the Bobbing Cork, friend. Will you be needing a room? ...No? You've come for a drink and some gossip, then?"},{"name":"AELUUIN","text":"...A “lathe”? I'm afraid I'm unfamiliar with the term. Some manner of tool from the old Skyways workshop that used to stand here in Fallgourd?"},{"name":"AELUUIN","text":"A pity our previous owner has moved on─ten years I've worked here, but never have I heard talk of any such workshop."},{"name":"AELUUIN","text":"Hmmm. Well, I may know naught of any lathe, but we do have a mountain of unclaimed possessions that we've been adding to since the dawn of bloody time."},{"name":"AELUUIN","text":"The inn has the largest storeroom in town, you see, and it's the favored reliquary for all manner of unwanted or forgotten artifacts that once belonged to either residents or customers."},{"name":"AELUUIN","text":"Only just this morning I thought to clear some space by throwing away the oldest and dustiest relics. You're more than welcome to sift through the pile outside and take whatever you wish."},{"name":"AELUUIN","text":"You'll find a pile of unclaimed goods outside by the side of the inn. I hope the gods smile upon you and you find what you seek."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! Is that what I think it is...?"},{"name":"TATARAMU","text":"The gearwheel from the lathe! I came to Fallgourd on the barest of remembrances, but I'm certainly glad I did!"},{"name":"TATARAMU","text":"The workshop itself is gone, but some things are too precious to simply fling onto a midden heap. One of the artisans must have saved it."},{"name":"TATARAMU","text":"My grandfather was always well respected, you see, and even in his later years he would take me to see the workers practicing their trade."},{"name":"TATARAMU","text":"“Listen well, Tataramu,” he would say. “Coin has its uses, but aught of true value is bought with passion and persistence! To reach the highest skies, you must spread your wings and soar!”"},{"name":"TATARAMU","text":"His words of wisdom were as the sweetest lullabies to me as a child. 'Twas likely his influence that encouraged me to pursue my love of airship design."},{"name":"TATARAMU","text":"...Hm? What's this? The face of the gearwheel is engraved with a dedication of some kind."},{"name":"TATARAMU","text":"<span class=\"emphasis\">For my dear friend, Dezul Qualan.<br>On these wings I pledge our everlasting bond.<br><br>                                           Tatanora</span>"},{"name":"TATARAMU","text":"...B-But this would mean..."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! Let us return to Ehcatl and deliver this treasure to Sezul without delay. There are certain questions to which our Ixal colleague may hold the answers..."},{"name":"SEZULTOTOLOC","text":"Squawk! Nervously waiting for <span class=\"highlight\">Forename</span>'s return, Sezul was! Releasing decidedly unblessed wind, bowels were!"},{"name":"SEZULTOTOLOC","text":"Caw, caw, caw! Yes! Exactly what we need, this gearwheel is!"},{"name":"SEZULTOTOLOC","text":"Good. Good, good, good! Edging much closer to reality, dream of <span class=\"emphasis\">Dezul Qualan</span> is!"},{"name":"TATARAMU","text":"Sezul, there is something I would ask you."},{"name":"SEZULTOTOLOC","text":"Pale, Tataramu looks. Nervous belly like Sezul? Ask permission to use latrine trench, Tataramu need not!"},{"name":"TATARAMU","text":"Ah, no, I─ Perhaps you should just read the inscription on the gearwheel."},{"name":"SEZULTOTOLOC","text":"Hm? Inscription? Ah, see tiny words, Sezul did not!"},{"name":"SEZULTOTOLOC","text":"<span class=\"emphasis\">For my dear friend, Dezul Qualan.<br>On these wings I pledge our everlasting bond.<br><br>                                           Tatanora</span>"},{"name":"TATARAMU","text":"“Tatanora” is my grandsire. He is the man who founded Highwind Skyways, forty-six years ago. And I'm fairly certain we've all heard that second name before..."},{"name":"SEZULTOTOLOC","text":"...Caw, caw! Caw, caw, caw! Squaaawk!"},{"name":"TATARAMU","text":"Care to share the source of your amusement, Sezul?"},{"name":"SEZULTOTOLOC","text":"Too perfect, it is! Destined to fall into our hands, this gearwheel was!"},{"name":"SEZULTOTOLOC","text":"Dezul Qualan... Outcast and genius! First chief of Ehcatl Nine! Master balloon maker...and Sezul's respected mentor!"},{"name":"TATARAMU","text":"Your mentor!? Then, the name of our hybrid airship...?"},{"name":"SEZULTOTOLOC","text":"Yes! One and same! Think of better way to honor chief's memory, Sezul could not!"},{"name":"TATARAMU","text":"...Then it was true."},{"name":"SEZULTOTOLOC","text":"Squawk...?"},{"name":"TATARAMU","text":"I speak of an old rumor. 'Twas said that Grandfather's company was built on his “appropriation” of beastman aeronautics─that all the balloons he flew were naught more than base imitations of Ixali-made vessels."},{"name":"TATARAMU","text":"'Tis a rumor that was officially denied. And any mention has been thoroughly expunged from written records on the assertion that even unfounded claims of stolen beastman technology would unduly harm Highwind Skyways' reputation.<br>I had thought it merely the rumblings of rivals, sick with envy at Grandfather's success."},{"name":"SEZULTOTOLOC","text":"Yes! Envy, it was! Squawk! Envy that led your ancestors to steal our genius! Thieves! Thieves and liars!"},{"name":"TATARAMU","text":"Sezul, I..."},{"name":"SEZULTOTOLOC","text":"Caw, caw, caw! Pulling Tataramu's tailfeathers, Sezul was! Judging by words on gearwheel... Stolen from us, this knowledge was not."},{"name":"SEZULTOTOLOC","text":"Friends, they were! Shared craft with Tataramu's grandfather, Dezul Qualan did."},{"name":"SEZULTOTOLOC","text":"See it clearly, Sezul can. Two dreamers gazing into vast sky, one feathered and one not. Not so different are past and present, eh?"},{"name":"TATARAMU","text":"Fate has had a hand in our meeting, it would seem. I am honored to continue the friendship our elders began, Sezul Totoloc."},{"name":"SEZULTOTOLOC","text":"&lt;sniff&gt; Squawk! Dust in Sezul's eye, there is! Back to work! Swiftly now, or find tongue shortened on new lathe, Tataramu will!"},{"name":"TATARAMU","text":"The friend Grandfather names on that gearwheel... Surely it cannot be coincidence...?"},{"name":"SYSTEM","text":"Thanks to your diligent efforts, Sezul's crew can now use their new lathe to craft the gears and cogs that will transfer power from the engine to the wings! Continue assisting the Ehcatl Nine to see the airship hybrid reach completion."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Ehcatl Nine."},{"name":"SYSTEM","text":"New Ixal tribal daily quests are now available from Tazel Meyean the Lettered at Ehcatl."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":971},"reqs":{"beastrank":3,"jobs":[{"lvl":1,"id":33}],"quests":[67025]},"next":[67027]},"partials":[{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"npc","id":"1002804","obj":{"i":1002804,"n":"Aeluuin","l":57,"q":6}},{"type":"npc","id":"1009204","obj":{"i":1009204,"n":"Tataramu","l":57,"q":8}},{"type":"npc","id":"1009610","obj":{"i":1009610,"n":"Colson","l":52,"q":1}},{"type":"quest","id":"67025","obj":{"i":67025,"n":"The Boy from Gridania","g":42,"l":"North Shroud","s":4,"f":1}},{"type":"quest","id":"67027","obj":{"i":67027,"n":"Standing at the Helm","g":42,"l":"North Shroud","s":6,"f":1}}]}