{"quest":{"name":"A Designer Job","location":"North Shroud","id":67024,"patch":2.35,"sort":3,"icon":100260,"beast":5,"unlocksFunction":1,"eventIcon":71341,"issuer":1009199,"target":1009199,"involved":[1009217,1009600],"genre":42,"usedItems":[8086,8130],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sezul appears concerned for the well-being of one of his crew.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 3 and above.","Concerned that his crew's mechanical engineer has not returned from his task of gathering engine component materials, Sezul looks to you to locate the missing Ixal. Make your way south and search Alder Springs for Bozol Eduan the Exact.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You find the missing Bozol Eduan in Alder Springs, the exhausted Ixal cradling what appears to be a broken arm. No sooner has Bozol warned you to leave, however, than his tormentors─a group of Ixal from the logging grounds─appear to further threaten and taunt him. Wary of your presence, perhaps, the fanatics withdraw after pronouncing an ominous ultimatum. Speak with Bozol, and listen to the unfortunate engineer's tale.","After explaining that his injury has rendered him unable to complete his task, Bozol requests that you craft the engine component in his stead. Visit the crafting facility at Treespeak Stables, and present the component materials to Nellemond.","You have handed over the component materials to Nellemond, and gained access to the crafting facility. Synthesize a high-quality propulsion engine component, and deliver it to Sezul Totoloc at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Finishing</span> wears off or the synthesis ends in failure, you may try again by speaking with Nellemond.","You have delivered the propulsion engine component to Sezul. The Ehcatl Nine leader is thankful for your efforts, but laments the delay caused by his chief designer's injury. Upon hearing of this predicament, Tataramu offers to shoulder Bozol's duties, and convinces Sezul that his dedication to the project is genuine. Sezul accepts both you and Tataramu as official members of his crew, and exhorts you to continue working towards the completion of the <span class=\"emphasis\">Dezul Qualan</span>."],"objectives":["Search for Bozol Eduan the Exact in Alder Springs.","Speak with Bozol Eduan the Exact.","Present the component materials to Nellemond at Treespeak Stables.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a propulsion engine component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the propulsion engine component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Sezul Totoloc</span></span>."],"dialogue":[{"name":"SEZULTOTOLOC","text":"Squawk! <span class=\"highlight\">Forename</span>! A task for you, Sezul has!"},{"name":"SEZULTOTOLOC","text":"In Sezul's crew, mechanical engineer by name of Bozol Eduan, there is."},{"name":"SEZULTOTOLOC","text":"Left camp to acquire component materials for engine, Bozol did...but return, he does not. Without vital part for propulsion system, continue with construction, we cannot! Squaaawk!"},{"name":"SEZULTOTOLOC","text":"Have <span class=\"highlight\">Forename</span> search for missing Bozol and drag him back here, Sezul would. Hmmm. Went somewhere to south, engineer did... Yes! Somewhere south!"},{"name":"SEZULTOTOLOC","text":"Rare among Ixal, Bozol is. Very good with machines! Solely responsible for engine design and development!"},{"name":"SEZULTOTOLOC","text":"Missing engineer is even more important than engine component, Sezul thinks! Even with needed part, install engine into vessel, we cannot! Attempted to add such propulsion system to balloon, no one ever has!"},{"name":"BOZOLEDUAN","text":"Squawk... Bozol's arm..."},{"name":"BOZOLEDUAN","text":"Squawk! Stay back! Hm? Come at Chief Totoloc's orders, you have?"},{"name":"BOZOLEDUAN","text":"N-No! Away with you! Be caught by others, featherless one will!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Caw, caw, caw! Yet try to flutter free, do you? Hard to fly on broken wing, yes? ...Finished our game with you, we have not!"},{"name":"BOZOLEDUAN","text":"Enough fun, you have had! Miss your fawning presence, your goddess will!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Squawk! Such insolent screeching! Make self target for torment, you do!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Enough pointless resistance! Time to rejoin flock and devote yourself to Divine Garuda, it is!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Squawk? Where did you come from, no-feathers? This one's pet, are you? Cease your glaring, or snap your arm, too, chieftain will!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Go. Return to sniveling Sezul and give him message, you shall! Cease this skulking about in forest, he must! Or find himself and crew buried beneath boughs, he will!"},{"name":"IXALBOSS8","text":"(-Ixali Chieftain-)Answer now to goddess, all Ixal do. Divine Garuda... Terrible and beautiful Garuda..."},{"name":"BOZOLEDUAN","text":"&lt;pant&gt; &lt;pant&gt; ...Glad that they tired of their sport, I am..."},{"name":"BOZOLEDUAN","text":"Based at logging grounds, that chieftain is. Taken actions of Ehcatl Nine as personal insult, he has..."},{"name":"BOZOLEDUAN","text":"Ugh... Bozol's arm... Useless, it is! Ruined Bozol for his craft, they have..."},{"name":"BOZOLEDUAN","text":"Wish to rely on featherless one, Bozol does not...but take these materials, you must!"},{"name":"BOZOLEDUAN","text":"Necessary for crafting high-quality engine component, they are! Squawk!"},{"name":"BOZOLEDUAN","text":"Without component, ceruleum propulsion engine remains incomplete! Build extreme heat-resistant steel housing, we must!"},{"name":"BOZOLEDUAN","text":"Without component, ceruleum propulsion engine remains incomplete! Coat parts with rust-resistant agent, we must!"},{"name":"BOZOLEDUAN","text":"Without component, ceruleum propulsion engine remains incomplete! Build vibration-absorbing cushioning, we must!"},{"name":"BOZOLEDUAN","text":"Without component, ceruleum propulsion engine remains incomplete! And without propulsion system, no better than fancy balloon, vessel will be!"},{"name":"BOZOLEDUAN","text":"Artisan, you are, yes? Leave this task in your hands, Bozol shall!"},{"name":"BOZOLEDUAN","text":"At place your people call “Treespeak Stables,” find well-equipped workshop, you will. Unlike Bozol, need for sneaking in and using at night, you have not..."},{"name":"BOZOLEDUAN","text":"Squawk! Burn like fire, Bozol's arm does! Go! Featherless one must do what Bozol cannot..."},{"name":"BOZOLEDUAN","text":"Squawk! Burn like fire, Bozol's arm does! Go! Featherless one must do what Bozol cannot..."},{"name":"SEZULTOTOLOC","text":"Later than late, Bozol is... Known for stopping to pick berries and pick wildflowers, he is not. Smell treachery, Sezul does!"},{"name":"NELLEMOND","text":"Greetings! The crafting facility here at Treespeak Stables is primarily for the purpose of forging tools for the stablehands, but our doors─assuming we had any─are open to all!"},{"name":"NELLEMOND","text":"Ah, I see you have some quality materials you wish to process. Our workshop may not be located in the fanciest of establishments, but I will personally vouch for the integrity of each and every piece of equipment!"},{"name":"NELLEMOND","text":"Now, having inspected your materials, I believe I have calculated the optimum amount required to craft the component you have in mind. I shall hold on to the excess while you work your synthesizing magic!"},{"name":"NELLEMOND","text":"The use of the crafting facility here at Treespeak Stables is entirely free of charge! Pray put concerns of sordid coin from your mind and concentrate on your wondrous creation!"},{"name":"NELLEMOND","text":"Your crafting endeavor was a success? Then you must waste no time in returning to your client. Ah, and should something unfortunate befall your commission─accidental loss, theft, act of primal─you always have the option of retrieving from me the remaining materials and trying again!"},{"name":"SEZULTOTOLOC","text":"Squawk! Worried for <span class=\"highlight\">Forename</span>, Sezul was! Returned and explained all, Bozol did! Snapping of bones! Nasty chieftain's threats! Prevent <span class=\"highlight\">Forename</span> from crafting component, Sezul feared he would..."},{"name":"SEZULTOTOLOC","text":"Very good, very good... Owe <span class=\"highlight\">Forename</span> two beakfuls of gratitude, Sezul does: first for finding Bozol, and second for crafting engine component!"},{"name":"SEZULTOTOLOC","text":"Being tended for injury, Bozol is. Shortsighted thugs!"},{"name":"SEZULTOTOLOC","text":"They can pray all day to goddess, but grow back flying feathers, it will not! Yet air in abundance, they have! Right there, between their own ears! Squawk!"},{"name":"TATARAMU","text":"This goddess... You speak of worshipping the primal Garuda, yes?"},{"name":"SEZULTOTOLOC","text":"Worship, yes... No means of mechanical propulsion, have balloons. Slave to whims of wind, they are."},{"name":"SEZULTOTOLOC","text":"To control direction of their vessels, make use of enchanted “airstones,” they do. Infused with blessings of Garuda, these artifacts are!"},{"name":"SEZULTOTOLOC","text":"Stone creates wind; wind moves balloon. Simple concept, but efficient and effective, it is not! And always costly, “gifts” of goddess are!"},{"name":"SEZULTOTOLOC","text":"Squawk! Feathered demon! Promise Ixal much, goddess does. But work only to satisfy Garuda's cruel desires, Sezul's people do. Answer their fervent prayers, goddess never will!"},{"name":"SEZULTOTOLOC","text":"That is why Ehcatl Nine broke ties with Garuda! Rely on own skill and perseverance, we shall! Prefer to adopt featherless ones' technology, we do!"},{"name":"TATARAMU","text":"That explains the hostile attitude of the logging grounds chieftain─he sees the Ehcatl Nine as heretics and betrayers of their own kind..."},{"name":"SEZULTOTOLOC","text":"Yes! Think us worst kind of Ixal, they do! Caw, caw, caw! But also intend to lie at feet of Tataramu's chieftains, we do not! Fly, we shall! Fly beyond the clouds!"},{"name":"SEZULTOTOLOC","text":"Yet take much more time now, it will. Wait until Bozol's arm is healed, we must. Draft technical designs for <span class=\"emphasis\">Dezul Qualan</span>, no one else can..."},{"name":"TATARAMU","text":"Sezul! If you need someone to draft airship designs, then I am your Lalafell!"},{"name":"SEZULTOTOLOC","text":"Training, you say you have. But what of patience? Hmmm? Of dedication? Regret making offer lightly, you will!"},{"name":"TATARAMU","text":"I am as serious as I have ever been! In fact, I have already started drafting improvements to your engine assembly. By incorporating my ideas, I believe you can reduce the weight of the propulsion system by twenty percent while still retaining its current power output!"},{"name":"SEZULTOTOLOC","text":"Toy with our dream, you must not! Should Tataramu's designs be flawed, use skin for covering vessel's wings, Sezul will!"},{"name":"SEZULTOTOLOC","text":"...Hmmm. Tataramu draws designs, and <span class=\"highlight\">Forename</span> crafts components. Very odd indeed, Sezul's crew has become!"},{"name":"SEZULTOTOLOC","text":"Squawk! So be it! Now official members of Ehcatl Nine, you are! Continue reaching for sky, we shall!"},{"name":"SYSTEM","text":"Thanks to your diligent efforts, construction of the <span class=\"emphasis\">Dezul Qualan</span>'s tail assembly has begun! Continue assisting the Ehcatl Nine to see the airship hybrid reach completion."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Recognized</span> reputation with the Ehcatl Nine."},{"name":"SYSTEM","text":"New Ixal tribal daily quests are now available from Methuli Cattlan the Hard at Ehcatl."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"TATARAMU","text":"（★未使用／削除予定★）"}],"reward":{"gil":572},"reqs":{"beastrank":1,"jobs":[{"lvl":1,"id":33}],"quests":[67023]},"next":[67025]},"partials":[{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"npc","id":"1009217","obj":{"i":1009217,"n":"Nellemond","l":57,"q":3}},{"type":"npc","id":"1009600","obj":{"i":1009600,"n":"Bozol Eduan The Exact","l":57,"q":1}},{"type":"item","id":"8086","obj":{"i":8086,"n":"Propulsion Engine Component Materials","l":1,"c":26001,"t":63}},{"type":"item","id":"8130","obj":{"i":8130,"n":"Propulsion Engine Component","l":1,"c":21012,"t":63}},{"type":"quest","id":"67023","obj":{"i":67023,"n":"Reaching for Cloud Nine","g":42,"l":"North Shroud","s":2,"f":1}},{"type":"quest","id":"67025","obj":{"i":67025,"n":"The Boy from Gridania","g":42,"l":"North Shroud","s":4,"f":1}}]}