{"quest":{"name":"Standing at the Helm","location":"North Shroud","id":67027,"patch":2.35,"sort":6,"icon":100263,"beast":5,"unlocksFunction":1,"eventIcon":71341,"issuer":1009204,"target":1009199,"involved":[1003075,1008945],"genre":42,"usedItems":[8088,8132],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tataramu wishes you to assist him in procuring another part for the <span class=\"emphasis\">Dezul Qualan</span>.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 15 and above.","Tataramu has asked you to approach Gerolt with the task of forging the <span class=\"emphasis\">Dezul Qualan</span>'s unique steering mechanism. Take the helm component materials, and speak with the master weaponsmith at Hyrstmill.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You attempt to speak with Gerolt, but the groaning artisan seems aggressively disinclined to hear your request. Present the component materials to Drake, Gerolt's sympathetic apprentice, and explain the task you have in mind.","After listening to your request, Drake contrives a plan to help you ensnare his suffering master's attention. Craft four high-quality helm components from the materials returned to you by the apprentice, and then shove your inspiring handiwork right under Gerolt's nose.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Production</span> wears off or the synthesis ends in failure, you may try again by speaking with Drake.","You present your helm components to Gerolt. Impressed and intrigued by the quality of your work, the master weaponsmith rouses himself from his slump and promises to forge the remainder of the steering mechanism. Return to Ehcatl and report to Tataramu.","You return to Ehcatl and report your success to Tataramu, who is overjoyed with Gerolt's involvement in the project. The young man's joy is cut short, however, when his father, the chairman of Highwind Skyways, arrives with a squad of sellswords to drag him away from the Ixali camp. Speak with Sezul and learn the Ixal's thoughts.","Chief Totoloc is enraged at Tatabaru's treatment of his own son, and resigned to postponing the final stages of the <span class=\"emphasis\">Dezul Qualan</span>'s construction. With the loss of their talented designer, it seems the Ehcatl Nine's ambitions must remain indefinitely grounded..."],"objectives":["Speak with Gerolt at Hyrstmill.","Present the component materials to Drake.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize helm components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the helm components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Gerolt</span></span>.","Report to Tataramu.","Speak with Sezul Totoloc."],"dialogue":[{"name":"TATARAMU","text":"Greetings, <span class=\"highlight\">Forename</span>. With the ceruleum engine now integrated, the <span class=\"emphasis\">Dezul Qualan</span> is entering the final stages of construction!"},{"name":"TATARAMU","text":"Not long now...not long at all. Once this airship is proven skyworthy, the field of aeronautics will never be the same again!"},{"name":"TATARAMU","text":"There is, however, another favor I would ask of you. Are you familiar with Gerolt, the master weaponsmith who resides in Hyrstmill?"},{"name":"TATARAMU","text":"We will have need of his legendary smithing talents if we are to complete our steering mechanism─the helm of the <span class=\"emphasis\">Dezul Qualan</span>. Only he can properly combine and align the necessary components."},{"name":"TATARAMU","text":"Pray take these materials to Gerolt, and request that he aid us in our endeavor!"},{"name":"TATARAMU","text":"Gerolt is the preeminent weaponsmith of this age─with his handiwork aboard, the <span class=\"emphasis\">Dezul Qualan</span> will fly as straight as the truest blade!"},{"name":"GEROLT","text":"What d'ye want now? That Jalzahn bloke come callin' again, did he? Well, I ain't got the patience for no mystic rubbish today. Me head feels like a kettle what some bastard's tryin' to pound the dents out of!"},{"name":"GEROLT","text":"Bloody hells! Ain't ye supposed to be trainin' with that toy I made for ye? Off with ye! Me head feels like a kettle what some bastard's tryin' to pound the dents out of!"},{"name":"GEROLT","text":"Take yer business elsewhere, adventurer. I'm busy enough, an' me head feels like a kettle what some bastard's tryin' to pound the dents out of!"},{"name":"DRAKE","text":"Pay no mind to Master Gerolt, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. His temper is as short as his night of carousing was long..."},{"name":"DRAKE","text":"Now, what do you have that needs mending? A kettle? A cookpot? ...Nothing of the sort?"},{"name":"DRAKE","text":"Hm. Well, if you don't mind dealing with an apprentice, I should be happy to hear the details of your request."},{"name":"GEROLT","text":"Damn you, Buscarron... That cheap swill of yers'll be the death of me!"},{"name":"DRAKE","text":"Now, then, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, what manner of task has brought you to our humble forge?"},{"name":"DRAKE","text":"...Ah, a custom-made helm to fit a new breed of airship. Tricky. I can understand why you would seek Master Gerolt's expertise."},{"name":"DRAKE","text":"Though he is first and foremost a forger of weapons, the masterpieces he creates demand a flair for innovation and an eye for the minutest of details. Should he turn his hand to crafting your vessel's helm, then I can promise you that the end result will be of unparalleled quality."},{"name":"DRAKE","text":"As you have witnessed, however, the master's present demeanor falls somewhere short of amenable. Beyond the threat of debt collection, there is little that will convince him to take up his hammer..."},{"name":"DRAKE","text":"Are you, yourself, not an artisan of some skill? Then allow me to suggest that you take a portion of these materials and craft the finest helm spokes you can manage."},{"name":"DRAKE","text":"Are you, yourself, not an artisan of some skill? Then allow me to suggest that you take a portion of these materials and mix some batches of the finest protective varnish you can manage."},{"name":"DRAKE","text":"Are you, yourself, not an artisan of some skill? Then allow me to suggest that you take a portion of these materials and craft the finest helm handles you can manage."},{"name":"DRAKE","text":"Are you, yourself, not an artisan of some skill? Then allow me to suggest that you take a portion of these materials and craft the finest helm components you can manage."},{"name":"DRAKE","text":"The sight of such painstaking workmanship should serve to stir the embers of professional curiosity in Master Gerolt's soul. Despite his grumbling, he is not one to back down from a challenge!"},{"name":"DRAKE","text":"Here, I shall return your materials. Consider the tools of our meager workshop to be at your disposal!"},{"name":"DRAKE","text":"Some finely crafted components─say, four or so─may be just what is needed to shake Master Gerolt from his obstinate mood. I am certain he will agree to at least hear your request!"},{"name":"DRAKE","text":"You have completed your components? Then pray show the results to Master Gerolt. Should you somehow misplace your handiwork between here and there, then I shall be happy to once again lend you the use of our facilities."},{"name":"GEROLT","text":"Ugh, thank the gods. That drink-demon smitty's stopped usin' me head as an anvil... Eh? Still bloody here, are ye? I swear to the seven hells..."},{"name":"GEROLT","text":"What's this, then? Made these while I was tryin' not to puke on me apron, did ye? Fine bit of work."},{"name":"GEROLT","text":"I never pegged ye for an artisan. But even with this level of skill, ye still felt the need to come to ol' Gerolt, eh?"},{"name":"GEROLT","text":"So, what's the job? Ye want me to take this handiwork of yers an' make a steering mechanism for yer flying boat, is that it? Hmmm."},{"name":"GEROLT","text":"Alright, I'll do it. I know that fire in yer eyes, and bugger me if I don't respect it. ...Might be as I'll need some time to get the work done, though."},{"name":"GEROLT","text":"I don't fancy makin' finicky adjustments until the fog of booze is good an' gone. Once I'm satisfied it's ready, though, I'll have the finished parts delivered to yer shipyard."},{"name":"GEROLT","text":"Can't say as I got up this mornin' expectin' to make parts for an airship! But don't ye worry none─once I take a job, I make sure it's done right. The kettles can bloody well wait!"},{"name":"DRAKE","text":"Ah, that Master Gerolt accepted your commission is most wonderful! Perhaps in his revived enthusiasm, he might deign to share with me another small morsel of his trade. I believe I've learned all there is to know about repairing cookware..."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>, you're back! ...Master Gerolt agreed to the task? Excellent, excellent! I can think of no other major barriers preventing us from completing the <span class=\"emphasis\">Dezul Qualan</span>!"},{"name":"TATARAMU","text":"...Hm? An airship...?"},{"name":"MARCENARY01491","text":"(-Trained Sellsword-)All blades stand ready to begin the extraction!"},{"name":"MARCENARY01491","text":"(-Trained Sellsword-)Spare no mercy for these feathered savages."},{"name":"SEZULTOTOLOC","text":"Squawk!? Who comes barging into Sezul's camp!?"},{"name":"SEZULTOTOLOC","text":"Remember inviting armed thugs to <span class=\"alternative-container\"><span class=\"alternative\">dinner</span><span class=\"alternative\">breakfast</span><span class=\"alternative\">lunch</span></span>, Sezul does not!"},{"name":"MARCENARY01491","text":"(-Trained Sellsword-)Save your indignation, beastman! You'll roast for kidnapping Master Tataramu!"},{"name":"SEZULTOTOLOC","text":"Kidnapping!? See you any shackles around his ankles? Free as a bird, Tataramu is!"},{"name":"TATARAMU","text":"How did you even find me here...? How many times must I tell you to leave me be!?"},{"name":"TATABARU","text":"(-???-)Enough of this petulant nonsense, Tataramu!"},{"name":"TATARAMU","text":"Father!?"},{"name":"SEZULTOTOLOC","text":"Father? Ah, chief of Highwind Skyways clan, you must be!"},{"name":"TATABARU","text":"<span class=\"emphasis\">This</span> is the workshop for which you've caused so much fuss? There are no proper tools, no materials. Why, it barely qualifies as a dumping ground for our factories' refuse."},{"name":"TATABARU","text":"What is it you wish to do, boy? If you want to tinker with airships, the company has them in abundance. I'll have Colson arrange for one of those new Garlond Ironworks models to be docked in a spare hangar..."},{"name":"TATARAMU","text":"No, Father! You don't understand! This is not some game or idle pursuit!"},{"name":"SEZULTOTOLOC","text":"Squawk! Call my camp ground for dumping refuse, do you!? Shove ceruleum hose up chairman's backside, Sezul would! ...If already there, broomstick wasn't!"},{"name":"TATABARU","text":"...What foul company you've been keeping. These birdmen have obviously deceived you─do you honestly believe such brutish creatures capable of building a functional airship?"},{"name":"TATARAMU","text":"You are the one guilty of deceit! The Ixal are the reason we were able to take to the skies in the first place! Why do you insist on hiding the truth?"},{"name":"TATARAMU","text":"Are you so afraid of damaging the company's reputation? Or are you simply too proud to admit that we borrowed the knowledge of “beastman savages”?"},{"name":"TATARAMU","text":"Fear and pride can only weigh us down! Only by casting aside such ballast can we truly reach the heights of which we are capable!"},{"name":"TATABARU","text":"I'll not stand here and be lectured by my own child! Cease this impudence at once!"},{"name":"HIGHWINDSAECRETARY","text":"(-Private Clerk-)Sir, we really must be away. There are those two items of business in Limsa Lominsa that require your attention, followed by a dinner engagement with Councillor Turstin at the Coral Tower..."},{"name":"TATABARU","text":"Yes, yes, we are almost done here."},{"name":"TATABARU","text":"Bring my son. If he decides to struggle, there is no need to be overly gentle. ...A small dose of discipline will do him good."},{"name":"TATARAMU","text":"Father! You cannot do this! Please, listen to me..."},{"name":"SEZULTOTOLOC","text":"Harm Tataramu, you will not! Stab you first with feathers, then pluck you, <span class=\"emphasis\">then</span> roast you, Sezul will!"},{"name":"SEZULTOTOLOC","text":"Squaaawk! Gone, Tataramu is! Taken! Strangled and stomped on, his dreams were!"},{"name":"SEZULTOTOLOC","text":"For first time in Sezul's life, wish to harm featherless one, Sezul does! Share with them secrets of balloons, and now think they own skies, they do!"},{"name":"SEZULTOTOLOC","text":"<span class=\"emphasis\">Dezul Qualan</span> stays grounded! Integrate final components, we cannot!"},{"name":"SEZULTOTOLOC","text":"Patience, now. Wait and hope for Tataramu's return, we must. Occupy ourselves with crafting needed parts. But if chairman sets foot into Ehcatl Nine's camp again...stuff into sack and beat bloody with tree branch, Sezul will!"},{"name":"SYSTEM","text":"Thanks to your diligent efforts, the <span class=\"emphasis\">Dezul Qualan</span> now has a functional steering mechanism. Continue assisting the Ehcatl Nine to see the airship hybrid reach completion."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Respected</span> reputation with the Ehcatl Nine."},{"name":"SYSTEM","text":"New Ixal tribal daily quests are now available from Duzal Meyean the Steady at Ehcatl."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Ehcatl Nine vendor."},{"name":"SYSTEM","text":"This vendor also offers wares in exchange for the <span class=\"highlight\">Ixali oaknots</span> you obtain in the course of your adventures."},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SEZULTOTOLOC","text":"（★未使用／削除予定★）"}],"reward":{"gil":630,"items":[{"id":21073}]},"reqs":{"beastrank":4,"jobs":[{"lvl":1,"id":33}],"quests":[67026]},"next":[67028]},"partials":[{"type":"npc","id":"1009204","obj":{"i":1009204,"n":"Tataramu","l":57,"q":8}},{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"npc","id":"1008945","obj":{"i":1008945,"n":"Drake","l":57,"s":19,"q":3,"t":"Replica Vendor","r":1,"a":139,"c":[30.42,20.15]}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"8088","obj":{"i":8088,"n":"Helm Component Materials","l":1,"c":26001,"t":63}},{"type":"item","id":"8132","obj":{"i":8132,"n":"Helm Component","l":1,"c":21012,"t":63}},{"type":"quest","id":"67026","obj":{"i":67026,"n":"Lathe to the Party","g":42,"l":"North Shroud","s":5,"f":1}},{"type":"quest","id":"67028","obj":{"i":67028,"n":"Never Be Royal","g":42,"l":"North Shroud","s":7,"f":1}}]}