{"quest":{"name":"The Boy from Gridania","location":"North Shroud","id":67025,"patch":2.35,"sort":4,"icon":100261,"beast":5,"unlocksFunction":1,"eventIcon":71341,"issuer":1009204,"target":1009204,"involved":[1000107,1000195,1009218,1009607],"genre":42,"usedItems":[8087,8131],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tataramu has encountered a bump in the road towards completing the <span class=\"emphasis\">Dezul Qualan</span>.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 6 and above.","After explaining the need for certain notoriously difficult-to-acquire materials, Tataramu reluctantly asks that you deliver a letter to an acquaintance of his. Visit the airship ticket counter in Gridania, and ask Hida where you might find a gentleman by the name of Colson.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Upon hearing of your wish to deliver a letter from “Master Tataramu,” an obviously shocked Hida demands that you make haste to the headquarters of the Gods' Quiver and submit a report. Speak with Chansteloup at his post outside of Quiver's Hold.","Chansteloup brushes aside your attempt to speak with him, claiming to be fully occupied with solving an important missing persons case. The agitated Quiverman does, however, confirm Colson's presence within Quiver's Hold. Head inside, and deliver the letter to Tataramu's acquaintance.","After delivering the letter to Advisor Colson, you learn that Tataramu is actually the “missing” son of Highwind Skyways chairman Tatabaru. Though vexed by the unapologetic nature of Tataramu's brief missive, Colson nevertheless agrees to cover the costs for the young Lalafell's requested materials. Take the promissory note and hand it to Hildeyerd at the Fallgourd Float crafting facility.","You hand the promissory note to Hildeyerd, and receive what the workshop supervisor describes as a set of lavishly expensive materials. Use the facility to craft a high-quality engine jointing component, then deliver your handiwork to Tataramu.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You have delivered the engine jointing component to Tataramu. Realizing that you are now aware of his true identity, the young man explains his desire to pursue an honest career outside of the suffocating cocoon of his privileged position. Sezul assures Tataramu that crafting is its own reward, and urges the airship designer to funnel his passion into the completion of the <span class=\"emphasis\">Dezul Qualan</span>."],"objectives":["Speak with Hida at the airship ticket counter in Gridania.","Speak with Chansteloup.","Deliver Tataramu's letter to Colson.","Present the promissory note to Hildeyerd in Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an engine jointing component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the engine jointing component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Tataramu</span></span>."],"dialogue":[{"name":"TATARAMU","text":"Ho there, <span class=\"highlight\">Forename</span>! Construction of the airship proceeds apace! Our beastman colleagues have even agreed to implement several of my proposals!"},{"name":"TATARAMU","text":"However inadvertent it was, I must thank you for introducing me to this opportunity."},{"name":"TATARAMU","text":"That I should have the chance to contribute to such a revolutionary project... 'Tis <span class=\"emphasis\">exactly</span> the sort of thing I dreamed of as I pored over countless tomes on aeronautic principle and design!"},{"name":"TATARAMU","text":"There is, however, one small issue that has arisen to thwart us..."},{"name":"TATARAMU","text":"In order to properly integrate my innovations, we require certain materials to build a custom engine jointing component─materials that are notoriously difficult to procure."},{"name":"TATARAMU","text":"I had hoped it would not come to this, but I must call upon the aid of an acquaintance of mine."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>, would you be so kind as to deliver this letter to a gentleman by the name of Colson? I am certain that he will agree to prepare the materials...and keep the entire matter discreet. "},{"name":"TATARAMU","text":"Now, Colson is often out and about on company business, but speak with Hida at the airship ticket counter in Gridania, and she will point you towards his latest appointment. My apologies, <span class=\"highlight\">Forename</span>. I do not mean to treat you as a lackey, but I'd prefer to avoid the city for the time being..."},{"name":"TATARAMU","text":"I almost wish I could see Colson's face when he learns what I am building...not to mention with <span class=\"emphasis\">whom</span> I am building it!"},{"name":"HIDA","text":"Welcome to the airship landing. ...I'm sorry, was there aught else I might help you with, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>?"},{"name":"HIDA","text":"You wish to meet with Advisor Colson? Delivering a letter from “Tataramu,” you say...? &lt;gasp&gt; Surely you don't mean <span class=\"emphasis\">Master</span> Tataramu!?"},{"name":"HIDA","text":"Y-You've seen him!? I-Is he hale and unharmed!?"},{"name":"HIDA","text":"You must take yourself directly to Quiver's Hold! Chansteloup will wish to speak with you in person!"},{"name":"HIDA","text":"You will find Advisor Colson there as well, assisting with the investigation. Swiftly now please, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"HIDA","text":"Pray head directly to Quiver's Hold and report to Chansteloup! He will surely drop everything to hear what you have to say!"},{"name":"CHANSTELOUP","text":"I'm sorry, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, but I cannot assist you at this time─the Gods' Quiver is fully engaged with investigating a most important case."},{"name":"CHANSTELOUP","text":"Every resource at our disposal has been allocated towards locating Chairman Tatabaru's missing son."},{"name":"CHANSTELOUP","text":"Even now, the chairman's chief aide, Advisor Colson, awaits within Quiver's Hold─no doubt eager to berate the First Bow for our lack of progress."},{"name":"CHANSTELOUP","text":"Hm? Colson is the person you've come to see? Then I must ask you to mind your words. I can't have you antagonizing the esteemed representative of Highwind Skyways."},{"name":"CHANSTELOUP","text":"If you must speak with Advisor Colson, then pray do so with the utmost respect. Highwind Skyways is not a company to be trifled with..."},{"name":"COLSON","text":"Yes, yes, I am Colson, but this is hardly the time for─ Hm? A letter for me? Let's have it, then, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">son</span></span>! Time is of the essence, you know, especially at my age..."},{"name":"COLSON","text":"Great gods! This is signed by Master Tataramu! How came you by this document!? Is the young master well!?"},{"name":"COLSON","text":"What's that, you say!? Ensconced in the company of Ixal!? Then we've not a moment to lose! Should it cost me my very life, I shall see him freed from their ravenous clutches!"},{"name":"COLSON","text":"We'll need to form a rescue party... Yes, the finest Gods' Quiver marksmen, reinforced by a small army of Skyways retainers! Be brave, Master Tataramu! Those beastmen will soon rue the day they dared lay talons on my young charge!"},{"name":"Q1","text":"What will you say to soothe him?"},{"name":"A1","text":"Advisor, <span class=\"emphasis\">calm down</span>!!!"},{"name":"A1","text":"But Tataramu is fine!"},{"name":"COLSON","text":"This no longer concerns you, <span class=\"alternative-container\"><span class=\"alternative\">young miss</span><span class=\"alternative\">young man</span></span>! We must immediately─<br>...Wait, what? You mean to say that Tataramu is safe?"},{"name":"COLSON","text":"...He's there of his own free will? Building an airship <span class=\"emphasis\">with</span> the Ixal!? Wait, wait, wait! Perhaps we must needs begin afresh."},{"name":"COLSON","text":"As you are obviously aware, my name is Colson, and I am the chief technical advisor for Highwind Skyways and aide to Chairman Tatabaru. Pleased to make your acquaintance."},{"name":"COLSON","text":"What you may not have known is that the man who asked you to deliver this letter is the chairman's only son...and the sole successor to a veritable airship empire."},{"name":"COLSON","text":"Some few days ago, Master Tataramu accompanied me here to Gridania as part of his continuing education on company practices. Much to my surprise and alarum, however, the young master suddenly disappeared from under my very nose."},{"name":"COLSON","text":"Well, I was naturally beset by all manner of horrible imaginings! With no ransom demand or other clue to his whereabouts, I had no choice but to task the Gods' Quiver with turning the entire city upside down!"},{"name":"COLSON","text":"Suffice it to say, your news has lifted a terrible weight from my old shoulders. I know not how I would have faced the boy's father had events unfolded otherwise."},{"name":"COLSON","text":"...And yet, the contents of this letter still manage to vex me.<br><br><br><br><span class=\"emphasis\">Dear Colson,<br>Enclosed is a list of materials I would have you prepare for my<br>companion. I require them for a most exciting project!<br>                                            Fond regards, Tataramu</span>"},{"name":"COLSON","text":"Not one word of apology or even the slightest hint of contrition! My lectures on the privilege and responsibility of position appear to have fallen on deaf ears."},{"name":"COLSON","text":"And as for this list... I'm assuming these are materials for some manner of high-quality jointing component? A mounting frame for the ceruleum engine, yes?"},{"name":"COLSON","text":"And as for this list... I'm assuming these are materials for some manner of high-quality jointing component? Treated rubber gaskets to prevent ceruleum leakage, yes?"},{"name":"COLSON","text":"And as for this list... I'm assuming these are materials for some manner of high-quality jointing component? A leather-bound frame to absorb engine vibration, yes?"},{"name":"COLSON","text":"And as for this list... I'm assuming these are materials for some manner of high-quality engine jointing component?"},{"name":"COLSON","text":"Hmmm. I am sorely tempted to refuse this impertinent request, considering the trouble the young master has caused... But I am also intrigued."},{"name":"COLSON","text":"Here. Take this promissory note and hand it to the supervisor of the Fallgourd Float crafting facility. She will provide you with everything you require to craft Tataramu's component."},{"name":"COLSON","text":"Though I yet harbor some concerns, I will trust that Master Tataramu is content to work alongside these Ixal for now..."},{"name":"COLSON","text":"Master Tataramu is as a grandson to me─I have watched that boy nurture a love for airships since the day he was born. Pray see to it that no harm befalls him..."},{"name":"HILDEYERD","text":"Hello again, adventurer! Come now, I can hardly hear you! I said, “Hello again”!"},{"name":"HILDEYERD","text":"Oh my! This note has the seal of Highwind Skyways! ...Though I suppose it only stands to reason─there are few other organizations that could afford the items you're requesting."},{"name":"HILDEYERD","text":"Here you are, then! Everything is in order for you to begin crafting!"},{"name":"HILDEYERD","text":"I'm sure you'll do just fine with those expensive materials! Remember: I'll be right here if you need anything!"},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! You were gone so long I was beginning to worry! Were you able to deliver my letter to Colson?"},{"name":"TATARAMU","text":"Yes! This is exactly what I had in mind! Jointing components like this one are almost impossible to obtain without the clout of a company like Highwind Skyways behind you."},{"name":"TATARAMU","text":"But with your expertly crafted component now in hand, we should have no trouble integrating my improved engine housing into the <span class=\"emphasis\">Dezul Qualan</span>. I can already feel the bracing chill of the wind on my face! Hear the cries of the birds! See the folk below, rushing about like tiny─"},{"name":"TATARAMU","text":"Ahem. Pray excuse my little flights of fancy. Terrible habit of mine. So, <span class=\"highlight\">Forename</span>... I suppose you heard from old Colson who I really am, then?"},{"name":"TATARAMU","text":"Yes, 'tis true: my father is the chairman of Highwind Skyways, the expansive airship service that links the great cities of Eorzea."},{"name":"TATARAMU","text":"Destined as I am to one day take the company's helm, people everywhere seek to curry my favor as they would some merchant prince."},{"name":"TATARAMU","text":"...A pity then that my “royal” status does not excuse me from an unrelenting procession of dreary lessons at home. I am forced to study mercantile practices, business strategies...all that I might maximize the profits of airship travel."},{"name":"TATARAMU","text":"But I have not the slightest interest in making coin. I've had enough of ledgers and lectures! Thus was I so reluctant to leave this little sanctuary."},{"name":"TATARAMU","text":"I want to <span class=\"emphasis\">design</span> airships, not manage a fleet of them! I want to be valued not for my station or my purse, but for the skills I have labored to acquire!"},{"name":"TATARAMU","text":"Mayhaps you hear naught but the whining of a spoiled child... Yet I swear to you, I would renounce my inheritance in a twinkling if I could!"},{"name":"TATARAMU","text":"Oh for the wings of a wondrous airship to carry me further, faster, and higher than ever before! <span class=\"emphasis\">That</span> is my dream! That, and naught else!"},{"name":"SEZULTOTOLOC","text":"Squawk! Well said, that was!"},{"name":"SEZULTOTOLOC","text":"And mean nothing to us, Tataramu's wealth does. Better off smelting down coins and making nails, Sezul thinks!"},{"name":"TATARAMU","text":"Thank you, Sezul..."},{"name":"SEZULTOTOLOC","text":"Squawk, squawk! Seize this passion, and let it sustain you, you must! Construction of <span class=\"emphasis\">Dezul Qualan</span> will take all that Tataramu has, and more!"},{"name":"SEZULTOTOLOC","text":"Chosen an easy path, Tataramu has not. No, not easy. But always fair master, crafting is! Great reward for great effort!"},{"name":"SEZULTOTOLOC","text":"Launch our vessel upon ocean of clouds, we shall! Launch it towards gates of Ayatlan! Ready to fly is Tataramu, yes?"},{"name":"TATARAMU","text":"Yes! Yes, sir!"},{"name":"SYSTEM","text":"Thanks to your diligent efforts, the engine housing has now been integrated into the <span class=\"emphasis\">Dezul Qualan</span>'s tail assembly! Continue assisting the Ehcatl Nine to see the airship hybrid reach completion."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Ehcatl Nine."},{"name":"SYSTEM","text":"New Ixal tribal daily quests are now available from Rozol Cattlan the Prudent at Ehcatl."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Ehcatl Nine vendor."},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SEZULTOTOLOC","text":"（★未使用／削除予定★）"}],"reward":{"gil":952},"reqs":{"beastrank":2,"jobs":[{"lvl":1,"id":33}],"quests":[67024]},"next":[67026]},"partials":[{"type":"npc","id":"1009204","obj":{"i":1009204,"n":"Tataramu","l":57,"q":8}},{"type":"npc","id":"1000107","obj":{"i":1000107,"n":"Hida","l":52,"q":2}},{"type":"npc","id":"1000195","obj":{"i":1000195,"n":"Chansteloup","l":52,"q":4}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"npc","id":"1009607","obj":{"i":1009607,"n":"Colson","l":52,"q":1}},{"type":"item","id":"8087","obj":{"i":8087,"n":"Engine Jointing Component Materials","l":1,"c":26001,"t":63}},{"type":"item","id":"8131","obj":{"i":8131,"n":"Engine Jointing Component","l":1,"c":21012,"t":63}},{"type":"quest","id":"67024","obj":{"i":67024,"n":"A Designer Job","g":42,"l":"North Shroud","s":3,"f":1}},{"type":"quest","id":"67026","obj":{"i":67026,"n":"Lathe to the Party","g":42,"l":"North Shroud","s":5,"f":1}}]}