{"quest":{"name":"Never Be Royal","location":"North Shroud","id":67028,"patch":2.35,"sort":7,"icon":100264,"beast":5,"unlocksFunction":1,"eventIcon":71341,"issuer":1009199,"target":1009199,"involved":[1006380,1009219,1009615,1009616,1009617,1009618,1009658],"genre":42,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sezul appears desperate to have Tataramu back at work on the <span class=\"emphasis\">Dezul Qualan</span>.","Desperate to have Tataramu back at work on the <span class=\"emphasis\">Dezul Qualan</span>, Sezul has asked that you approach a member of Highwind Skyways directly. Head to the airship landing in Gridania, and find a Skyways employee who might know of Tataramu's present whereabouts.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Despite being summarily dismissed by Chairman Tatabaru's private clerk, you learn that she will soon join the head of Highwind Skyways on a journey to the Observatorium. Make your own way to the Coerthas central highlands, and question the private clerk once more.","You manage to pressure the private clerk into revealing that the chairman's son has accompanied them to Coerthas. Search the residences of the Observatorium and find Tataramu.","Though you have found Tataramu, it appears that his movements are being monitored by the wine-swilling retainers in the next room. The young man suggests that you consult Templeton, and contrive a method by which Tataramu can escape without risking undue notice. Speak with the Skywinds employee in the Observatorium's crafting facility.","You speak with Templeton, and the devious craftsman suggests the use of a potent sleeping potion mixed into a half-empty bottle of wine. Take the bottle and surreptitiously place it on the table in the room where the mercenary guards are drinking.","Completely oblivious to your sleight of hand, the retainers begin quaffing the contents of the seemingly innocuous wine bottle. Enter the adjoining chamber and report the progress of the escape plan to Tataramu.","You report the success of Templeton's plan to an astonished Tataramu. Well aware of his guards' proclivity for drinking, the airship designer deems the sellswords sufficiently insensate to risk a swift dash through the door. Head outside and rendezvous with Tataramu.","Just as it seems that Tataramu has made good his escape, you are startled by the sudden appearance of Advisor Colson. Though the aged technician is initially disapproving of Tataramu's actions, he is eventually swayed by the young man's impassioned plea that he be allowed to follow his dreams. Return to Ehcatl and rejoin Sezul.","Sezul is overcome with emotion at Tataramu's return. No sooner has the chief mastered his tears and ordered the designer back to work, however, than the Ixali chieftain of the nearby logging ground makes an unexpected and unwelcome visit. Cawing with triumph at his discovery of the hidden camp, the exultant chieftain promises an unpleasant fate for the Ehcatl Nine. Sezul and his crew must now race to complete the <span class=\"emphasis\">Dezul Qualan</span> before the Natalan Ixal arrive to destroy all that they have worked to accomplish..."],"objectives":["Search for a Highwind Skyways clerk at the Gridania airship landing.","Speak with the private clerk at the Observatorium.","Find Tataramu.","Speak with Templeton.","Place the half-empty wine bottle on the sellswords' table.","Report to Tataramu.","Rendezvous with Tataramu outside.","Speak with Sezul Totoloc at Ehcatl."],"dialogue":[{"name":"SEZULTOTOLOC","text":"Squawk... Greetings, <span class=\"highlight\">Forename</span>. Mood of the camp, dampened, it is. Dark and dreary."},{"name":"SEZULTOTOLOC","text":"Lie dormant, <span class=\"emphasis\">Dezul Qualan</span> does... Like deflated balloon. Fly without Tataramu's touch, it cannot."},{"name":"SEZULTOTOLOC","text":"Rely on Tataramu, we did. More than Sezul realized. Become heart of Ehcatl Nine, Tataramu has!"},{"name":"SEZULTOTOLOC","text":"Despise this helpless feeling, Sezul does! Ask <span class=\"highlight\">Forename</span> to visit Gridania and parley with Highwind Skyways, Sezul would! Squawk!"},{"name":"SEZULTOTOLOC","text":"Only fledglings sit and screech and do nothing! Tataramu needs to fly, and give him that chance, we will!"},{"name":"SEZULTOTOLOC","text":"Caw, caw, caw! So serious, Sezul has become... Bring small featherless one back to us, <span class=\"highlight\">Forename</span> must..."},{"name":"SEZULTOTOLOC","text":"Go to place of airships in Gridania and speak with company member. Find where Tataramu has been caged, <span class=\"highlight\">Forename</span> must..."},{"name":"HIGHEINDSECRETARY","text":"I'm sorry, were you addressing me? If you've a business proposal or seek employment, then I must ask that you first make an appointment through the official company represen─"},{"name":"HIGHEINDSECRETARY","text":"Hm? You wish to know Tataramu's whereabouts? ...I assume you are referring to <span class=\"emphasis\">Master</span> Tataramu?"},{"name":"HIGHEINDSECRETARY","text":"Forgive me, but I must inquire as to your relationship with the chairman's son. I fail to see how someone of your apparent─"},{"name":"HIGHEINDSECRETARY","text":"...Argh! It's <span class=\"emphasis\">you</span>! You were there in that filthy Ixali camp!"},{"name":"HIGHEINDSECRETARY","text":"You're the one who conspired with those betaloned savages to kidnap Master Tataramu! Well, I'm certainly not about to share any information with a disreputable ruffian such as you! Shoo! Begone!"},{"name":"HIGHEINDSECRETARY","text":"&lt;groan&gt; ...Now I shall be late in boarding the chairman's flight to Coerthas! He has a very important meeting at the Observatorium with very important people!"},{"name":"HIGHEINDSECRETARY","text":"You again! How ever did you know where to─ Ah. Well, I'll not stumble like that a second time!"},{"name":"HIGHEINDSECRETARY","text":"Now, keep quiet! Chairman Tatabaru is engaged in extremely delicate negotiations and is not to be disturbed! ...Hm? You're <span class=\"emphasis\">still</span> asking after Master Tataramu?"},{"name":"HIGHEINDSECRETARY","text":"Ugh. Will you not be silent? If you absolutely <span class=\"emphasis\">must</span> know, the young man accompanied us here as part of his continuing education in company management. His chambers are guarded by our loyal─not to mention lethal─retainers, so you can forget any plans to spirit him away again!"},{"name":"HIGHEINDSECRETARY","text":"Do NOT disturb the chairman! He is in the middle of a very sensitive and highly confidential parley that could decide a future airship route to Ishgard! The fortune of the company may very well rest upon its outcome!"},{"name":"TATABARU","text":"The role of the Observatorium in maintaining a Coerthas airship route cannot be underestimated."},{"name":"TATABARU","text":"As such, I would value any opinions or concerns House Durendaire might have with regards to the establishment of such a route."},{"name":"PORTELAINE","text":"I must say, your proposal is intriguing. As you have rightly ascertained, the very nature of the Observatorium places us in a unique position to oversee your company's endeavor."},{"name":"TATARAMU","text":"Oh! <span class=\"highlight\">Forename</span>! What are you doing here!?"},{"name":"TATARAMU","text":"Sezul sent you...? Broken without me, you say? ...I never imagined that the absence of my skills would be so keenly felt!"},{"name":"TATARAMU","text":"I am flattered, but...as dearly as I would love to stroll out the door with you, I'm afraid things aren't that simple."},{"name":"TATARAMU","text":"My father dragged me along on the pretense that I would be “learning the trade,” then confined me to this room. I'm practically a prisoner!"},{"name":"TATARAMU","text":"Did you see the guards on your way in? Should I attempt to take even one step across the threshold, those company-bought thugs will stop me in my tracks."},{"name":"TATARAMU","text":"Hmmm. There must be a way past them that doesn't involve outright violence..."},{"name":"TATARAMU","text":"...I have it! You must needs speak with Templeton, the Skywinds employee stationed here at the Observatorium."},{"name":"TATARAMU","text":"He's aided us with component crafting before, and is one of the few people in the company I might consider an ally. Wily he may be, but it is that exact trait that will serve us now!"},{"name":"TATARAMU","text":"I must escape this room without creating too much of a commotion. Speak with Templeton at the Observatorium's crafting facility─we have need of his crafty mind."},{"name":"TEMPLETON","text":"Ah, good day to you, adventurer! What may poor Templeton do to serve you on this cold and miserable day? Which, come to think of it, fairly well describes <span class=\"emphasis\">every</span> day on this godsforsaken, croc-infested stretch of icy hell. ...Hm? Looking to break Master Tataramu from his confinement, are you?"},{"name":"TEMPLETON","text":"Well now, I'm sure I couldn't <span class=\"emphasis\">possibly</span> lend my assistance to such a shady undertaking! And I <span class=\"emphasis\">certainly</span> wouldn't suggest the use of a particularly potent sleeping potion! &lt;wink&gt; &lt;wink&gt;"},{"name":"TEMPLETON","text":"Our sellswords have grown fond of drinking mulled wine in an effort to forget their freezing extremities, and I'm sure they wouldn't question the appearance of another bottle on the table. 'Twould hardly be your fault if they overindulged and found themselves snoring under the table till morning!"},{"name":"TEMPLETON","text":"Ahem! Away with you and your nefarious schemes! ...And be sure to pass on my regards to the chairman's son!"},{"name":"TEMPLETON","text":"Loyal and steadfast, that's old Templeton for you! Surely Master Tataramu wouldn't wish to leave such a valuable servant to wither and shrink in this snow-choked wasteland forever!?"},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! What news!? Was Templeton able to offer a solution to our dilemma? ...He gave you <span class=\"emphasis\">what</span>!? A sleeping potion!?"},{"name":"TATARAMU","text":"Well, I hope his concoction has no lasting ill effects... If past experience is aught to go by, those retainers should be well into their cups by now. I'll sneak past as quickly as I dare and meet you outside!"},{"name":"TATARAMU","text":"So far, so good, it would seem! Now, let's return to Sezul's camp before my father concludes his negotiations!"},{"name":"COLSON","text":"A word with you, Master Tataramu."},{"name":"TATARAMU","text":"Colson! Wh-When did you arrive in Coerthas? I-It is good to see you!"},{"name":"COLSON","text":"I know what you're planning, lad, and <span class=\"emphasis\">you</span> know what will happen should you go through with it. Your father will not tolerate this defiance!"},{"name":"TATARAMU","text":"You've taken his side? I had thought that <span class=\"emphasis\">you</span>, at least, would support me in this..."},{"name":"COLSON","text":"Pray take a moment to consider your father's perspective: he only wants what is best for the future chairman of Highwind Skyways. The world you stand to inherit is not the world in which the rest of us live."},{"name":"COLSON","text":"There are commoners...and there are kings. We are all born into our fates and the responsibilities they bring."},{"name":"TATARAMU","text":"I am no prince! I am but the privileged brat of an airship empire!"},{"name":"TATARAMU","text":"And how did that empire come into being!? Highwind Skyways merely copied the balloons of the Ixal, and hopped a little into the air!"},{"name":"TATARAMU","text":"I care not for our company's reputation or its profits! Fortune? Prestige? Its aims are so low!"},{"name":"TATARAMU","text":"Sezul and his Ehcatl Nine are reaching for the heavens! They have grand dreams, and a passion unlike any I've seen before!"},{"name":"TATARAMU","text":"They seek to restore their lost wings, and, godsdammit, I would help them! I would share in that vision, soar in that same sky! That is all I wish for..."},{"name":"COLSON","text":"...Go, Master Tataramu."},{"name":"COLSON","text":"I will speak with the chairman myself. I will convince him of the depth of your desire...as you have convinced me."},{"name":"TATARAMU","text":"Y-You will...!?"},{"name":"COLSON","text":"I have underestimated you, young sir. Those eyes...that mask of determination... It is like witnessing a decades-old memory come to life."},{"name":"COLSON","text":"There can be no doubt that your grandfather's blood runs hotly in your veins..."},{"name":"TATARAMU","text":"Colson..."},{"name":"COLSON","text":"Quickly now─off with you! The longer I stand here in the biting cold, the more my hip starts to ache. Oh, for the fervent heat of youth! Heh heh heh..."},{"name":"TATARAMU","text":"Come, <span class=\"highlight\">Forename</span>. We have kept Sezul waiting long enough!"},{"name":"TATARAMU","text":"Chief Totoloc! Your designer has returned!"},{"name":"SEZULTOTOLOC","text":"..."},{"name":"TATARAMU","text":"...Sezul?"},{"name":"SEZULTOTOLOC","text":"..."},{"name":"SEZULTOTOLOC","text":"Squaaawk! Fogged up for no reason, goggles did! Not tears of joy, no! Humidity!"},{"name":"SEZULTOTOLOC","text":"Listen well, Tataramu! Make up for lost time, we must! Work and work until <span class=\"emphasis\">Dezul Qualan</span> is complete! Until hands ache and sweat turns to blood!"},{"name":"TATARAMU","text":"Yes, sir!"},{"name":"IXALBOSS01488","text":"(-???-)Found you! Found camp, we have! Reeking pile of dung hidden in forest!"},{"name":"SEZULTOTOLOC","text":"No! Not now..."},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Knew you were sneaking about, we did. But know why, we did not until now!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Preening feathers for forest people... Making unsanctioned balloon! Crime against goddess and our people, you have committed! Harsh, your punishment will be!"},{"name":"IXAL01492","text":"(-Ixali Wings-)Break it all! Burn it down!"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Leave you to stew in fear, we shall! Hear of this treachery, our Natalan brothers will! Squawk!"},{"name":"IXAL01492","text":"(-Ixali Wings-)Pluck their feathers! Snap their bones!"},{"name":"TATARAMU","text":"S-Sezul!? What do we do!?"},{"name":"SEZULTOTOLOC","text":"Found us, they have... Sezul knew this day would come..."},{"name":"SEZULTOTOLOC","text":"Squawk! Too soon! Too soon, it is! If but complete <span class=\"emphasis\">Dezul Qualan</span>, we can..."},{"name":"SYSTEM","text":"Thanks to your diligent efforts, the construction of the <span class=\"emphasis\">Dezul Qualan</span> is almost complete. With the return of Tataramu, a few final adjustments are now all that stand between the Ehcatl Nine and the distant skies..."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Ehcatl Nine."},{"name":"SYSTEM","text":"New Ixal tribal daily quests are now available from Jezul Ahuatan the Second at Ehcatl."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"}],"reward":{"gil":1352,"items":[{"num":2,"id":21073}]},"reqs":{"beastrank":5,"jobs":[{"lvl":1,"id":33}],"quests":[67027]},"next":[67029]},"partials":[{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"npc","id":"1006380","obj":{"i":1006380,"n":"Portelaine","l":63,"q":5}},{"type":"npc","id":"1009219","obj":{"i":1009219,"n":"Templeton","l":63,"q":6}},{"type":"npc","id":"1009615","obj":{"i":1009615,"n":"Private Clerk","l":52,"q":1}},{"type":"npc","id":"1009616","obj":{"i":1009616,"n":"Private Clerk","l":63,"q":1}},{"type":"npc","id":"1009617","obj":{"i":1009617,"n":"Tataramu","l":63,"q":1}},{"type":"npc","id":"1009618","obj":{"i":1009618,"n":"Tataramu","l":63,"q":1}},{"type":"npc","id":"1009658","obj":{"i":1009658,"n":"Tatabaru","l":63,"q":1}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"quest","id":"67027","obj":{"i":67027,"n":"Standing at the Helm","g":42,"l":"North Shroud","s":6,"f":1}},{"type":"quest","id":"67029","obj":{"i":67029,"n":"Spread Your Wings and Soar","g":42,"l":"North Shroud","s":8,"f":1}}]}