{"quest":{"name":"Dream On","location":"Limsa Lominsa","id":67020,"patch":2.3,"sort":3,"icon":100290,"eventIcon":71221,"issuer":1009153,"target":1001353,"involved":[1006357,1009186,1009387,1009388],"genre":77,"journal":["Neither snow nor rain nor heat nor gloom of night will stay the deputy postmoogle from unloading work on his subordinates.","The deputy postmoogle has entrusted you with a letter from an anonymous sender. See it safely delivered to Momodi, proprietress of the Quicksand in Ul'dah.","To Momodi's chagrin, the missive is revealed to be a love letter from a not-so-secret─and less-than-admirable─admirer, a pretentious lad by the name of Thomas. Unwilling to take no for an answer, the would-be suitor enlists your aid in seeking out the man who crafted Momodi's prized hairpin, in hopes of proving himself superior to any of his beloved's old flames. Rendezvous with Thomas at the Goldsmiths' Guild to begin the search.","Memedesu of the Goldsmiths' Guild enlightens you as to the origins of Momodi's hairpin. It was crafted by Momoroto, a once-promising young artisan who abandoned his craft and left Ul'dah behind for reasons unknown. Make for Crescent Cove in western Thanalan and seek out the man, who now passes his days as a fisherman.","You speak with Momoroto, who claims to harbor no regrets about trading fame and fortune as a goldsmith for the uneventful life of a fisherman. Offended by the mere thought that Momodi would prefer this listless Lalafell to himself, Thomas dashes off to the Quicksand, where he intends to win the heart of his beloved once and for all. Return to Momodi and see how she fares.","An exasperated Momodi reiterates to her stubborn suitor that she has no romantic feelings for Momoroto, though she does regret burdening him with expectations that might have weighed in his decision to abandon his youthful dreams. She further explains that she took on her current position in the Adventurers' Guild out of a desire to be a guiding hand to all those who would dream of serving the realm, and that she wears Momoroto's hairpin as a reminder of what can happen if well-meant words of encouragement are carried too far. Moved by Momodi's rousing speech, Thomas vows to find a dream of his own, one that might at last win him the admiration and affection of his beloved."],"objectives":["Deliver the letter to Momodi at the Quicksand in Ul'dah.","Speak with Memedesu at the Goldsmiths' Guild.","Speak with Momoroto at Crescent Cove.","Speak with Momodi at the Quicksand in Ul'dah."],"dialogue":[{"name":"LETTERMOOGLE","text":"Well, look who's back! I'll give you three guesses what I have in my paw, and the first two don't count, kupo."},{"name":"LETTERMOOGLE","text":"Why, yes...a letter! However did you know? It's addressed to Momodi, the ever-charming proprietress of the Quicksand in Ul'dah. Sounds like a pleasant enough assignment, wouldn't you say?"},{"name":"LETTERMOOGLE","text":"But this is no ordinary letter─oh no! Why, I've strained my eyes for any sign of the sender's name, but it is nowhere to be found! An anonymous epistle? Sounds like a task for my most capable assistant, kupo!"},{"name":"LETTERMOOGLE","text":"The anonymous letter I've entrusted to you is addressed to Momodi, the ever-charming proprietress of the Quicksand in Ul'dah. I sense intrigue─sounds like a task for my most capable assistant, kupo!"},{"name":"MOMODI","text":"Well, if it ain't <span class=\"highlight\">Forename</span>! Good to see an adventurer who <span class=\"alternative-container\"><span class=\"alternative\">checks in with the guild from time to time</span><span class=\"alternative\">remembers where <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> came from</span></span>, even after becomin' all famous and the like. What brings you to the Quicksand today?"},{"name":"MOMODI","text":"A letter? Next thing I know you'll be sproutin' a pom–pom and endin' every other utterance with kupo─oh? How curious! It would seem the sender's forgotten to sign the envelope..."},{"name":"MOMODI","text":"<span class=\"emphasis\">O, my beloved Momodi!<br>My riches could buy all the jewels in the realm,<br>yet none would shine as bright as thee.<br>Say that you will be mine, and─</span><br>...Blech!"},{"name":"MOMODI","text":"Good gods, no wonder the letter was anonymous! No man in his right mind would claim authorship of such a hackneyed, pretentious load of─"},{"name":"THOMAS","text":"(-???-)Momodi, my love! I see that my mellifluous missive finds you looking as beautiful as ever."},{"name":"MOMODI","text":"...Oh, it's <span class=\"emphasis\">you</span>. Why do I find myself entirely unsurprised?"},{"name":"MOMODI","text":"I've lost count of how many times I've spurned your shameless advances to your face. Must I now do the same in <span class=\"emphasis\">writin'</span> for you to get the bloody message!?"},{"name":"THOMAS","text":"(-Affluent Youth-)<span class=\"emphasis\">Shameless</span>? You wound me, Momodi, my love! Why, my advances are positively shame<span class=\"emphasis\">ful</span>─er, that's not the right word, is it now..."},{"name":"THOMAS","text":"(-Affluent Youth-)Ahem... Picture the scene! A mysterious letter! A secret admirer! Is it so outlandish for a man to think that the subtle, romantic approach might stir the flames of passion in his beloved's heart?"},{"name":"MOMODI","text":"...Says the fool standin' before me for the third time this week, still sportin' that same ridiculous jacket."},{"name":"MOMODI","text":"Our guest clearly lacks the courtesy to introduce himself, so allow me. This is Thomas So-and-so, son of the spice merchant someone-or-other, and the richest, most eligible young bachelor in all of Ul'dah."},{"name":"MOMODI","text":"Forgive me if I've forgotten some of the details─I've only heard the story some twenty-odd times now. This is <span class=\"highlight\">Forename</span>, the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who wasted <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> precious time haulin' your rubbish halfway across the realm."},{"name":"THOMAS","text":"Is that so? Smashing work, my <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! Remind me of your name again later, and I'll be sure to put you on the guest list for when my lovely Momodi and I are wed."},{"name":"THOMAS","text":"Do you see, my love!? This adventurer's efforts were not for naught. No, you need only promise your hand to me, promise that forever my Momodi─and mine alone─you will be!"},{"name":"MOMODI","text":"In person or in ink, my answer's the same: come back when Thanalan freezes over...so I can reject you again."},{"name":"THOMAS","text":"Alas and alack...but I should have known! Yes, that hairpin that adorns your lovely locks speaks loud and clear. Admit it, Momodi! After all these years, you still harbor feelings for <span class=\"emphasis\">him</span>!"},{"name":"MOMODI","text":"Why─! You've some nerve, walkin' into my place of business and spoutin' such nonsense!"},{"name":"THOMAS","text":"<span class=\"emphasis\">Nonsense</span>, my beloved? Is that so?"},{"name":"THOMAS","text":"Rumors abound about that hairpin. That it was crafted for you by an old flame, that it has not left your shapely head for so much as a day since the Calamity..."},{"name":"THOMAS","text":"If you lost a childhood love when the lesser moon fell, you have my sympathies. But this is a new age, my dearest! Time marches on, and we must march with it! Oh, and did I mention that my family is among the richest in the sultanate?"},{"name":"MOMODI","text":"Hells! Just how thick is your bloody skull? A man crafted my hairpin, and yes, there was a time when I felt somethin' for him. But such days are long past, and <span class=\"emphasis\">today</span>, I needn't compare you to anyone to find you thoroughly repulsive! Besides, I'll have you know that the man who crafted this still lives─"},{"name":"THOMAS","text":"What's this!? My rival in love still lives? Hahaha! At long last, my task is clear! I must seek out this pretender and prove once and for all that I, Thomas, am the only one worthy of my dear Momodi's hand!"},{"name":"THOMAS","text":"Adventurer! I would request your aid. Together we will seek out this man, and you will serve as an impartial judge to determine who is the worthy partner for Miss Momodi─he or I."},{"name":"THOMAS","text":"Rest assured that you will be suitably compensated for rendering the proper decision. And with that, let us begin our search at the Goldsmiths' Guild. I shall await you there!"},{"name":"MOMODI","text":"&lt;sigh&gt; I hate to drag you into this mess, <span class=\"highlight\">Forename</span>, but would you mind goin' along? I shudder to think at what sort of trouble that lovesick fool will stir up in my name."},{"name":"THOMAS","text":"This one knows something of our man─I can see it in his eyes. Well, go on now. Love waits for no man!"},{"name":"MEMEDESU","text":"What's that? Momodi's hairpin, you say? Why, that was Momoroto's work. Momoroto...now there's a name I've not uttered in some time."},{"name":"MEMEDESU","text":"Destined for greatness, that one was. Could've been the second coming of Niellefresne. Why, he'd been with us for a scant few years when a commission came in from the sultana herself. Slaved away at the piece day and night, till one day, when he rose from his workbench and walked away..."},{"name":"MEMEDESU","text":"Some said the pressure of expectations grew too great to bear, others that his heart was never in his craft to begin with. Still others said that it was a broken heart that drove him away..."},{"name":"MEMEDESU","text":"The guild lost a talented goldsmith, and I lost a friend─but a man's life is his to live. Last I heard, Momoroto was passing his days as a fisherman in Crescent Cove. If he's found happiness, I don't begrudge him his choice one bit."},{"name":"THOMAS","text":"To think that my rival for Momodi's heart has been lurking in our very midst this whole time! You have my thanks, Master Memedesu─rest assured that Momodi and I will spare no expense when we commission from your guild our wedding rings. Come, adventurer! To Crescent Cove!"},{"name":"MEMEDESU","text":"The guild lost a talented goldsmith, and I lost a friend─but a man's life is his to live. Last I heard, Momoroto was passing his days as a fisherman in Crescent Cove. If he's found happiness, I don't begrudge him his choice one bit."},{"name":"MOMOROTO","text":"Not a bite... Ah well, tomorrow's another─hm? What brings a mighty adventurer to this lonely fishing hole?"},{"name":"THOMAS","text":"<span class=\"emphasis\">This</span> is Momoroto? A shabby-looking fellow, indeed─but what did I expect from a craven who threw away his chance at fame, love, and glory because he couldn't bear the pressure?"},{"name":"THOMAS","text":"Oh, the ignominy of it all! She turns down my gifts of jewels and gold, yet adorns her fair locks with a trinket cobbled together by a languid Lalafell who stinks of sardines!"},{"name":"MOMOROTO","text":"So Momodi's actually wearin' that old thing? You'll get no argument from me─I hardly deserve it. Nor did I deserve her..."},{"name":"MOMOROTO","text":"Perhaps I once did. There was a time when I dreamed of being the greatest goldsmith in the realm─even a time when such dreams seemed within reach. The young Momoroto may have been worthy of Momodi's hand..."},{"name":"MOMOROTO","text":"...But that dreamer is no more, and you'll not see me mourn his passin'. Not all dreams were meant to be followed, and not all of us were destined for greatness. Put a fishing pole in his hand and a creaky pier under his bottom, and ol' Momoroto's a happy man."},{"name":"THOMAS","text":"Can you believe this!? My travels have taken me to the far corners of the realm, and never, <span class=\"emphasis\">never</span> have I seen a man so lacking in ambition, enthusiasm, or any even vaguely redeeming qualities!"},{"name":"THOMAS","text":"I would ask you to judge which of us is more worthy, but I think we can safely say that I am the victor by default. To the Quicksand, adventurer! My future bride awaits!"},{"name":"MOMOROTO","text":"Ah, so that's what all that shoutin' was about. The young man's taken a fancy to Momodi, has he? I'll say this much: he's got good taste."},{"name":"MOMOROTO","text":"Doesn't seem like all that bad of a fellow. A bit oversure of his own abilities, perhaps, but no more so than someone I used to know..."},{"name":"MOMOROTO","text":"When I gave that hairpin to Momodi years ago, she refused to wear it. Said it meant too much to her to risk losin'. As to why her heart may have changed, who can say?"},{"name":"MOMOROTO","text":"But it is not for love─this I know. Those days are buried in the sands of time. Whether that will avail your lovelorn friend is another matter entirely."},{"name":"MOMOROTO","text":"If you see Momodi again, tell her... No, never you mind. There might once have been a time for words, but that time has long since passed. Be well, friend."},{"name":"THOMAS","text":"I have returned, my love! And this time I shall not move an ilm from this spot until I receive the answer that I came for─the answer that I deserve!"},{"name":"MOMODI","text":"&lt;sigh&gt; Just between you and me, <span class=\"highlight\">Forename</span>, I was hopin' you'd manage to lose him somewhere on the way."},{"name":"THOMAS","text":"I have done my part. I sought out this Momoroto and heard his tale─the tale of a coward who has not deserved you since the day he fled this city, forsaking your love and his future in the process."},{"name":"THOMAS","text":"A worthy suitor stands before you─a man who promises to do everything in his power to bring you happiness, and who has the courage to put such words into action. I implore you, my beloved─undo that hairpin, free your heart from that has-been, and give unto me your hand!"},{"name":"MOMODI","text":"Listen well, 'cause I'll repeat myself no more: I've no feelin's for Momoroto, and sure as hells none for you. This hairpin? It's a symbol of all those who would dare to dream─a symbol, and a warnin'..."},{"name":"MOMODI","text":"Momoroto and I were old friends. He used to come by the shop where I worked and regale me with tales of all he hoped to achieve. He burned with passion in those days─like yourself, with less style and more substance."},{"name":"MOMODI","text":"As a wide-eyed girl, I was drawn to dreamers. I urged him on at every opportunity. When I heard he was makin' somethin' for the sultana, I near screamed, “This is your chance, Momoroto! Craft the masterpiece I know you have in you, an' you'll go down in history! You won't live an' die a nobody!”"},{"name":"MOMODI","text":"So I told him, over and over...until he came no more. I went to the Goldsmiths' Guild, only to hear that he'd resigned his position. 'Twas then I saw the error of my ways─all the time that I thought I was encouragin' my friend, I was only pilin' on to a burden he never wanted to bear..."},{"name":"THOMAS","text":"And so you wear the hairpin out of <span class=\"emphasis\">pity</span> for the man!?"},{"name":"MOMODI","text":"No, not pity. At first, I felt so ashamed that I didn't think myself worthy of wearin' it. Then the lesser moon came tumblin' down, and everythin' changed. At first, we thought we'd lost everything. Then slowly─slowly but surely─we began to pick up the pieces and dream again."},{"name":"MOMODI","text":"Seein' the proud faces of those who would rise to the call and rebuild our realm, it rekindled passions in my heart I hadn't felt in years. It was then that I finally discovered a dream of my own."},{"name":"MOMODI","text":"To stand with those who would fight for <span class=\"emphasis\">their</span> dreams, and to give them strength in any way I could─this is why I stand here today."},{"name":"MOMODI","text":"And yet, I must never repeat the mistake of my past. Adventurer, artisan, or angler, one's true dreams─one's true strength─must come from within. This is what I learned from Momoroto, and this is why I treasure his memento to this very day."},{"name":"THOMAS","text":"Oh, my beloved! Could there be in this world a more sensitive soul!? The Twelve should be the Thirteen, for you, my dearest, are a goddess of dreams and compassion!"},{"name":"THOMAS","text":"Hitherto I knew only your physical beauty, but I have seen the true beauty of your heart and soul. I am lost without you, my beloved! Make <span class=\"emphasis\">my</span> dream come true and promise to stay by my side forevermore!"},{"name":"MOMODI","text":"Have you not been listenin' to a single word I said!? I've devoted my life to supportin' <span class=\"emphasis\">adventurers'</span> dreams─<span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> like <span class=\"highlight\">Forename</span> here who are too busy fightin' for our realm to waste my bloody time!"},{"name":"THOMAS","text":"B-But, my beloved! Our love, too, may yet save Eorzea from the shadows!"},{"name":"MOMODI","text":"Well now, those're the first interestin' words I've heard come out o' your mouth. Prove to me that they're more than just words, and maybe─just <span class=\"emphasis\">maybe</span>─I'll reconsider."},{"name":"THOMAS","text":"Does this mean...I have a chance!? Oh, merciful indeed is the goddess Momodi! I will not fail you, my love. Today, I take my leave─when I next return, you will know the true breadth and scale of my dreams!"},{"name":"THOMAS","text":"And you, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! You have opened my eyes today, and for this you shall be well rewarded. You have my word─you will be in the front row for the festivities when my goddess and I are wed."},{"name":"MOMODI","text":"Finally, some peace and quiet! I doubt he'll be showin' his face here any time soon, but who knows? He'd not be the first man I've seen change. Anyroad, thank you, <span class=\"highlight\">Forename</span>. No matter how far we come, we can't forget the past─and thanks to you I've been able to do some much-needed reflectin'."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":658,"items":[{"num":3,"id":4648,"one":1},{"num":3,"id":4665,"one":1},{"num":3,"id":4734,"one":1},{"num":3,"id":4714,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67019]},"next":[67067,67068,67069]},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1006357","obj":{"i":1006357,"n":"Memedesu","l":41,"q":3}},{"type":"npc","id":"1009186","obj":{"i":1009186,"n":"Momoroto","l":42,"q":1}},{"type":"npc","id":"1009387","obj":{"i":1009387,"n":"Thomas","l":41,"q":1}},{"type":"npc","id":"1009388","obj":{"i":1009388,"n":"Thomas","l":40,"q":1}},{"type":"item","id":"4648","obj":{"i":4648,"n":"Sauteed Coeurl","l":70,"c":24355,"t":46}},{"type":"item","id":"4665","obj":{"i":4665,"n":"Lava Toad Legs","l":70,"c":24310,"t":46}},{"type":"item","id":"4734","obj":{"i":4734,"n":"Pineapple Ponzecake","l":70,"c":24068,"t":46}},{"type":"item","id":"4714","obj":{"i":4714,"n":"Tomato Pie","l":55,"c":24156,"t":46}},{"type":"quest","id":"67019","obj":{"i":67019,"n":"A Debt Unpaid","g":77,"l":"Limsa Lominsa","s":2}},{"type":"quest","id":"67067","obj":{"i":67067,"n":"Spirits Most Foul","g":77,"l":"Limsa Lominsa","s":5}},{"type":"quest","id":"67068","obj":{"i":67068,"n":"Dubious Dancing","g":77,"l":"Limsa Lominsa","s":6}},{"type":"quest","id":"67069","obj":{"i":67069,"n":"Stroking the Haft","g":77,"l":"Limsa Lominsa","s":7}}]}