{"quest":{"name":"Thwack-a-Mole","location":"Limsa Lominsa","id":67021,"patch":2.3,"sort":8,"icon":100291,"eventIcon":71221,"issuer":1009153,"target":1006261,"involved":[1001455,1006262,1009187],"genre":77,"journal":["The deputy postmoogle eyes his letter sack, visibly trembling.","Wings twitching and fur standing on end, the deputy postmoogle hands you a package addressed to a researcher by the name of Marcette. Do your best to put the stench of the package and the moogle's curious behavior out of mind as you make the delivery to Dunstan's Spire, where Marcette is engaged in fieldwork.","You deliver the package to Marcette, who proceeds to berate her hapless research assistant Hobriaut for misinterpreting her order. Summarily enlisting you as one of her lackeys, she commands you to make for the Royal Plantations in central Thanalan, where you are to procure one live mole pup for use in her next experiment. One of the botanists there should be able to assist you.","The botanist Gagari furnishes you with the proper tools and educates you in the fundamentals of mole-catching. First, set the bundle of weeds you received atop the mole hole.","The entrance to the mole's subterranean nest is now covered with weeds. Set them alight using the flint stone furnished to you to flood the tunnels with smoke and lure your quarry to the surface.","The mole pup has emerged from the hole along with its mother, understandably less than pleased with your incursion into her home. Slay the vicious critter and claim the specimen that Marcette seeks.","You are now the proud owner of one newborn mole pup─a rather cute little critter, when all is said and done. Deliver it to Marcette at Dunstan's Spire, and hope that she will be gentle.","No sooner did Marcette take the mole pup in hand than did she rain blows down all around the poor unwitting beast. She proceeds to explain that the point of her experiment was to prove her hypothesis that moles sense danger not with their oversized eyes, but by the vibrations around them. Quick to declare the experiment a success, she gloats at having once again shown up her erstwhile teacher, Atelloune, and mercifully affords you and another one of her test subjects a chance at escape..."],"objectives":["Deliver the parcel to Marcette at Dunstan's Spire.","Speak with Gagari at the Royal Plantations.","Place the bundle of weeds atop the molehill.","Use the light flint stone to set the weeds alight.","Retrieve the mole pup.","Deliver the mole pup to Marcette at Dunstan's Spire."],"dialogue":[{"name":"LETTERMOOGLE","text":"W-Well, if it isn't my most accomplished assistant! You truly could not have come at a b–better time. I have just the p–perfect assignment for you!"},{"name":"LETTERMOOGLE","text":"This parcel here must be delivered to one M-Marcette, a naturalist doing research on fauna at Dunstan's Spire in the Central Shroud. Brains, beauty, grace─why, I envy you for being able to bask in her brilliance. Sadly, my supervisory duties demand that I remain in this spot."},{"name":"LETTERMOOGLE","text":"Er, anyhow, you might want to hurry with that package. And try not to mind the smell, kupo!"},{"name":"LETTERMOOGLE","text":"The parcel you carry must be delivered to one M-Marcette, a naturalist doing research on fauna at Dunstan's Spire in the Central Shroud. Brains, beauty, grace─why, I envy you for being able to bask in her brilliance. Sadly, my supervisory duties demand that I remain in this spot."},{"name":"LETTERMOOGLE","text":"Er, anyhow, you might want to hurry with that package. And try not to mind the smell, kupo!"},{"name":"MARCETTE","text":"You there! Research Assistant Sixty-two! Or was it twenty-six? Bah! Who even <span class=\"emphasis\">cares</span> what your number is!? You're late, late, late! Hand over my package at once!"},{"name":"MARCETTE","text":"Yesss, come to me, my─what in the seven hells is this!? Apricot! If this is your idea of a joke, my next experiment will be to measure how many lightning sparks can fit up your worthless arse!"},{"name":"HOBRIAUT","text":"I-It's...ah...“Hobriaut,” P-Professor. With a silent─"},{"name":"MARCETTE","text":"Silence, Halfly-toe! You should fall to your knees and thank the Twelve that I deign to address you by any name at all! Now answer me: what in the name of Nophica's teats am I supposed to do with this rubbish!?"},{"name":"HOBRIAUT","text":"But I swear, P-Professor, I placed the order exactly as─"},{"name":"MARCETTE","text":"This is <span class=\"emphasis\">raw mole meat</span>, Hogglenoe! I asked for a <span class=\"emphasis\">live</span> mole─<span class=\"emphasis\">living</span>, as in what you <span class=\"emphasis\">won't</span> be doing when I'm through with you!"},{"name":"MARCETTE","text":"Gahhh! Research Assistant Number Eight Hundred Thirty-two! Time to prove that you're the only one around here worth your weight in goobbue droppings!"},{"name":"MARCETTE","text":"My current research project is a study of the behavior of those troublesome talpids─<span class=\"emphasis\">moles</span>, to a layman such as yourself."},{"name":"MARCETTE","text":"You need not concern yourself with the specifics of my research, which would be far beyond your feeble mind. You need only know that I require one live mole pup, and I require it <span class=\"emphasis\">now</span>!"},{"name":"MARCETTE","text":"The blank stare on your face tells me that you lack even the common knowledge that the Royal Plantations of Ul'dah are known to be infested with the filthy creatures, and that any half-wit botanist who works there could educate you as to how to capture one."},{"name":"MARCETTE","text":"Am I not making myself clear, Research Assistant Seven-seventy-seven!? You! The Royal Plantations! A live mole pup! To me! Now!"},{"name":"HOBRIAUT","text":"How was I supposed to know the professor required a live specimen? I assumed she was just going to skin it and eat it like she did with the last one..."},{"name":"MARCETTE","text":"Am I not making myself clear, Research Assistant Seven-seventy-seven!? You! The Royal Plantations! A live mole pup! To me! Now!"},{"name":"MARCETTE","text":"I swear to the gods, if you come back empty-handed, I'll make <span class=\"emphasis\">you</span> into mincemeat and feed you to the ziz!"},{"name":"GAGARI","text":"Looking to nab yourself a mole, are you? You'll hear no argument from me─cute little buggers, but leave them to their own devices and they're more than happy to eat us out of house and home."},{"name":"GAGARI","text":"Fortunately, they're more belly than brains─simple enough to snag one if you have the right tools. First of all, you're going to want to set this bundle of weeds atop one of their mole holes."},{"name":"GAGARI","text":"Then, take this flint stone and set the weeds aflame. Smoke will flood the tunnel, and the moles'll come bursting to the surface for a breath of fresh air."},{"name":"GAGARI","text":"Mind you, I said <span class=\"emphasis\">moles</span>, plural─your little pup won't put up much of a fight, but his mother won't be so keen to part with her young. You'd best brace yourself for a fight."},{"name":"GAGARI","text":"Thankfully, moles are more belly than brains─simple enough to snag with the tools I gave you. First of all, you're going to want to set a bundle of weeds atop one of their mole holes."},{"name":"GAGARI","text":"Then, use that flint stone to set the weeds aflame. Smoke will flood the tunnel, and the moles'll come bursting to the surface for a breath of fresh air."},{"name":"GAGARI","text":"Mind you, I said <span class=\"emphasis\">moles</span>, plural─your little pup won't put up much of a fight, but his mother won't be so keen to part with her young. You'd best brace yourself for a fight."},{"name":"POPMESSAGE","text":"With a squeal of fury, the mother mole is upon you!"},{"name":"MARCETTE","text":"Research Assistant Whatever-your-number-was! I swear to the gods, if you've come back empty-handed, I'll use <span class=\"emphasis\">you</span> for my next research specimen!"},{"name":"MARCETTE","text":"Well, look at this! A mole pup! A scrawny little runt if I ever saw one, but what can I say─my experience with certain research assistants has left me with a soft spot for half-wits, monsters, and ugly things."},{"name":"MARCETTE","text":"Don't worry, my misshapen beauty, I'll be very, verrry gentle. Apricot! You'd best be taking notes!"},{"name":"MARCETTE","text":"Die, foul vermin! Die, die, die! Bwahahahahahaha!!!"},{"name":"HOBRIAUT","text":"P-Professor, what are you doing to the poor beast!?"},{"name":"MARCETTE","text":"To the seventh hell with you, I say! Ahahahahahaha!"},{"name":"HOBRIAUT","text":"In Nophica's name, Professor, h-have mercy!"},{"name":"MARCETTE","text":"And once again, my hypothesis proves true!"},{"name":"MARCETTE","text":"Have you never found it strange that─despite spending the better part of their lives in tunnels beneath the soil─moles possess unusually large eyes?"},{"name":"MARCETTE","text":"Of course you haven't, because you possess the mental faculties of a dimmer-than-average dormouse. But that doesn't matter. What matters is that <span class=\"emphasis\">I</span> have."},{"name":"MARCETTE","text":"My self-styled teacher Atelloune posited that their eyes grew large that they might better see their prey in the darkness, but I thought─no, I <span class=\"emphasis\">knew</span> different!"},{"name":"MARCETTE","text":"I theorized that their eyes─regardless of their size─were nigh useless. That they did not see, but rather <span class=\"emphasis\">felt</span> the vibrations around them to identify potential prey─and foes."},{"name":"MARCETTE","text":"Did you see how the mole pup─its eyes still shut─squealed and squirmed in abject terror as I rained blows down all around him? Once again it is proven! Atelloune is a fool─the student has surpassed the teacher! "},{"name":"MARCETTE","text":"I would retain the pup for further study, but I have another mole that has outgrown its usefulness─consider it yours. What should you do with it? How should <span class=\"emphasis\">I</span> know!? Burn it, vivisect it, skin it and eat it for all I care! Just get it─and <span class=\"emphasis\">yourself</span>─out of my sight. Research calls!"},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown! "}],"reward":{"gil":658,"items":[{"id":6206}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[67067,66343]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1006261","obj":{"i":1006261,"n":"Marcette","l":54,"q":4}},{"type":"npc","id":"1001455","obj":{"i":1001455,"n":"Gagari","l":43,"q":3}},{"type":"npc","id":"1006262","obj":{"i":1006262,"n":"Hobriaut","l":54,"q":2}},{"type":"npc","id":"1009187","obj":{"i":1009187,"n":"Mole Pup","l":43,"q":1}},{"type":"item","id":"6206","obj":{"i":6206,"n":"Mini Mole","l":1,"c":59440,"t":81}},{"type":"quest","id":"67067","obj":{"i":67067,"n":"Spirits Most Foul","g":77,"l":"Limsa Lominsa","s":5}},{"type":"quest","id":"66343","obj":{"i":66343,"n":"Doing the Dirty Work","g":92,"l":"Central Shroud","s":290}}]}