{"quest":{"name":"Spread Your Wings and Soar","location":"North Shroud","id":67029,"patch":2.35,"sort":8,"icon":100265,"beast":5,"unlocksFunction":1,"eventIcon":71341,"issuer":1009199,"target":1009294,"involved":[1009204,1009218,1009629,1009659,1009676,1009693,1009707],"genre":42,"usedItems":[8089,8133,8090,8134],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sezul has one last task he would have you perform.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 18 and above, and the battle portion for Disciples of War or Magic level 49 and above.","Sezul declares that the <span class=\"emphasis\">Dezul Qualan</span> requires but a few finishing touches before it can be considered complete. Eager to conclude preparations for the test flight, the excitable Ixal has chosen you to craft the final part. Take the component materials given to you by Chief Totoloc, and present them to Hildeyerd at Fallgourd Float.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You present the materials to Hildeyerd, and the cheerful supervisor prepares her facility to accommodate your task. Craft a high-quality finishing component, and deliver it to the waiting Sezul.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You deliver the finishing component to Sezul. Just as the Ixali chief rejoices at the prospect of a complete <span class=\"emphasis\">Dezul Qualan</span>, however, his celebrating is cut short by sobering news: the fanatics of Natalan have begun preparations to launch their war balloons in an attack on Ehcatl. Travel to Natalan in the Coerthas central highlands, and consult with Tuzal Toltan the Unseen on how to sabotage the impending assault.","After arriving in Natalan, Tuzal Toltan explains to you the elemental workings of the zealots' vortex array and the method by which it can be disabled. Take one of Tuzal's corrupted crystal shards and use it to sabotage the nearby vortex turret as suggested.","You have successfully disabled the secondary vortex turret. Speak with Tuzal Toltan the Unseen for further instructions.","Now that you understand the task before you, Tuzal urges you to disable the vortex array completely. Find the remaining secondary turrets and sabotage them using the corrupted crystal shards.","You have found and disabled all the secondary turrets. If what Tuzal told you was correct, you should now be able to safely disable the heart of the array. Locate the primary vortex turret and shut it down using the final shard.","You have disabled all the turrets in the vortex array and interrupted the flow of elemental power. With the airstones thus deprived of energy, the war balloons should now lack the propulsion needed to drive them to Ehcatl. Return to Tuzal Toltan the Unseen and report your success.","Stating that he will carry word of your actions back to Chief Totoloc, Tuzal bids you keep watch on the movements of his crafty kin. Travel to the Observatorium and rendezvous with Tataramu.","Upon meeting Tataramu, you learn that another vortex turret remained hidden and untouched somewhere within Natalan─providing enough energy to power the airstone of a single war balloon. The young man's despair is palpable as he spots the ominous vessel floating steadily towards Sezul's camp. His dark mood is suddenly dispelled, however, when Tatabaru's airship, the <span class=\"emphasis\">Blackjack</span>, appears and rams the Ixali craft out of the sky. Return to Ehcatl and report events to Sezul.","As Sezul is gloating over the news of his enemy's misfortune, Tatabaru and his entourage arrive in the camp. The chairman apologizes for his previous behavior, and claims an earnest desire to now see the dreams of the Ehcatl Nine come true. The final round of pre-flight inspections has begun. Speak with Tataramu, and see what aid you can provide.","You approach Tataramu, and the excited airship designer reveals that he has been working on a figurehead for the <span class=\"emphasis\">Dezul Qualan</span>. Hoping that Sezul will approve the design, Tataramu asks that you speak with the Ehcatl Nine leader before crafting the final component for the figurehead. Present the component materials to Sezul and seek the Ixal's blessing.","You hand the component materials to Sezul, and the chief immediately realizes what Tataramu has in mind. Impressed and pleased by the traditional Ixali design, Sezul bids you craft the final part with particular care. Use the materials returned to you to synthesize a high-quality figurehead component, and deliver it to the waiting Tataramu.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Sezul.","You deliver the figurehead component to Tataramu just as the pre-flight inspections are concluded. With all now in readiness, Sezul gives the order for takeoff. Tataramu takes the <span class=\"emphasis\">Dezul Qualan</span> up into the air, but is almost immediately caught in the grip of violent turbulence. The entire camp watches anxiously as the young man manages to master the wild currents and pilot the airship out of danger. The test flight is a resounding success. Speak with Tataramu and hear his breathless account of events.","Though extremely satisfied with the <span class=\"emphasis\">Dezul Qualan</span>'s inaugural performance, Tataramu has already set his sights on loftier goals. Thoughts of his future purpose, however, lead him to ask you what your own reasons were for coming to Ehcatl. Reminded of your original mission, you realize a certain officer is likely awaiting your report. Return to the Adders' Nest in Gridania, and report to Lieutenant Scarlet.","Attempting to hide her own forgetfulness, Lieutenant Scarlet praises you on the success of your assigned duty─it appears that your actions have foiled whatever plans the Natalan Ixal had to assault Gridania's defenses. Unbeknownst to the Twin Adder officer, however, you have also helped to prove that friendship and understanding between the feathered beastmen and the forest people is attainable through the pursuit of common purpose. It is unfortunate, then, that not all Ixal share the dreams of the Ehcatl Nine..."],"objectives":["Present the component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a finishing component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the finishing component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Sezul Totoloc</span></span>.","Speak with Tuzal Toltan the Unseen in Natalan.","Use a corrupted crystal shard to disable the secondary vortex turret.","Report to Tuzal Toltan the Unseen.","Use corrupted crystal shards to disable secondary vortex turrets.","Use a corrupted crystal shard to disable the primary vortex turret.","Report to Tuzal Toltan the Unseen.","Speak with Tataramu at the Observatorium.","Report to Sezul Totoloc.","Speak with Tataramu.","Hand the figurehead component materials to Sezul Totoloc.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the figurehead component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the figurehead component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Tataramu</span></span>.","Speak with Tataramu.","Report to Scarlet at the Adders' Nest in Gridania."],"dialogue":[{"name":"SEZULTOTOLOC","text":"Squawk! Day to be remembered, this is! At last... At long last..."},{"name":"SEZULTOTOLOC","text":"Complete <span class=\"emphasis\">Dezul Qualan</span>, we will! Rejoice! Cry! Soil self in excitement! Caw, caw, caw!"},{"name":"SEZULTOTOLOC","text":"Matter of attaching and calibrating final components, it is! Then up, up, up into the sky before Natalan fanatics arrive!"},{"name":"SEZULTOTOLOC","text":"Task for <span class=\"highlight\">Forename</span>, Sezul has. Final task to craft finishing component!"},{"name":"SEZULTOTOLOC","text":"Take these materials to Fallgourd Float, <span class=\"highlight\">Forename</span> must. Expect <span class=\"highlight\">Forename</span>'s finest work, Sezul does!"},{"name":"SEZULTOTOLOC","text":"Go! Craft highest-quality component, <span class=\"highlight\">Forename</span> must! Prepare airship for test flight, we will! Squawk! Begun to tick, final count until launch has!"},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! The <span class=\"emphasis\">Dezul Qualan</span> is almost ready to fly! &lt;sniff&gt; I am sorry, I cannot... I am just so ecstatic..."},{"name":"HILDEYERD","text":"Hello there, adventurer! Come now, I can hardly hear you! I said, “Hello there”!"},{"name":"HILDEYERD","text":"Ah, I see you're seeking to craft your final airship component! I recognize the materials, but I would not dream of attempting the synthesis myself. ...I'm certain that <span class=\"emphasis\">you</span> will have no trouble, of course!"},{"name":"HILDEYERD","text":"Here are your materials back! The facility is yours!"},{"name":"HILDEYERD","text":"Remember: I'll be right here if you need anything!"},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"SEZULTOTOLOC","text":"<span class=\"highlight\">Forename</span>! Quickly, now, quickly! Have that final component, we must!"},{"name":"SEZULTOTOLOC","text":"Yes! Exactly what we need, this is! Final piece of <span class=\"emphasis\">Dezul Qualan</span>!"},{"name":"IXA01493L","text":"(-Ehcatl Nine Dropper-)Ch-Chief! Chief Totoloc! Terrible news, there is!"},{"name":"SEZULTOTOLOC","text":"Squawk! News!? What news!?"},{"name":"IXA01493L","text":"Heard from our little bird in Natalan, we have! War balloon pilots have begun priming airstones, Tuzal says!"},{"name":"TATARAMU","text":"P-Priming airstones? That...that sounds ominous!"},{"name":"SEZULTOTOLOC","text":"Yes, seek to harness blessings of Garuda, they do. Stones provide propulsion for balloons... Signal preparations for coming sortie, this does!"},{"name":"IXA01493L","text":"Squawk! Sent details of assault, Tuzal has! Fly here to Ehcatl and destroy <span class=\"emphasis\">Dezul Qualan</span>, balloon squadron will!"},{"name":"SEZULTOTOLOC","text":"Squawk, squawk! Thick-skulled zealots! “Obey goddess or face annihilation,” they say! Shriveled and dead, their souls are!"},{"name":"TATARAMU","text":"The Ehcatl Nine is a gathering of crafters, not warriors. And this camp is defenseless against attacks from the air! We're doomed, aren't we!?"},{"name":"IXA01493L","text":"Speak truth, little no-feathers does! Everything we have worked for... Go up in smoke, it will!"},{"name":"SEZULTOTOLOC","text":"Cease your screeching, fledgling! Need to think... Cripple this attack somehow, we must!"},{"name":"SEZULTOTOLOC","text":"<span class=\"highlight\">Forename</span>! Not so final was final task! Ask one more boon of <span class=\"highlight\">Forename</span>, Sezul would! Dangerous mission for one true warrior among us..."},{"name":"SEZULTOTOLOC","text":"Stop war balloons from ever taking off, <span class=\"highlight\">Forename</span> must! But swiftly, now, swiftly! Once they are airborne, soon float beyond our reach, they will!"},{"name":"SEZULTOTOLOC","text":"Make haste for Natalan, in snowy Coerthas─make contact with Tuzal Toltan! Know how to sabotage assault, he will!"},{"name":"SEZULTOTOLOC","text":"<span class=\"highlight\">Forename</span> handles fanatics! Rest of Ehcatl Nine, continue with preparations for maiden flight! Huddle in nest and wait to die, we will not!"},{"name":"SEZULTOTOLOC","text":"Gifted artisan, <span class=\"highlight\">Forename</span> is. But need <span class=\"highlight\">Forename</span>'s skill in battle more, Ehcatl Nine now does! Hear pitiful wails of beaten dung-for-brain Ixal from here, Sezul would!"},{"name":"TATARAMU","text":"Do they truly intend to destroy the <span class=\"emphasis\">Dezul Qualan</span>? I just don't understand it! Please, <span class=\"highlight\">Forename</span>! You cannot let this happen!"},{"name":"SPYIXAL","text":"Featherless one is reinforcements promised by Ehcatl? Shhh! Keep voice down, you must! Wish to attract attention of these vicious air-skulls, we do not!"},{"name":"SPYIXAL","text":"Thank your gods balloon squadron has not yet left ground. Flotation bladders are filled and ready, but take much time, preparation of airstones does."},{"name":"SPYIXAL","text":"Charged by power of vortex array, stones are. Once stones are fully primed, load them onto balloons and take off, air-skulls will..."},{"name":"SPYIXAL","text":"Before that happens, disable vortex array, we must─no power means no propulsion. Simple enough, yes?"},{"name":"SPYIXAL","text":"Tools for sabotage, Tuzal has: corrupted crystal shards! Insert these into turrets of vortex array and disperse elemental wind currents, they will!"},{"name":"SPYIXAL","text":"But begin with primary turret, you cannot! Disable secondary turrets first! Very important! Delicate and dangerous work, disrupting flow of elemental power is!"},{"name":"SPYIXAL","text":"Look, featherless one! See you this glowing device? One of three secondary vortex turrets, it is. Try inserting shard, yes?"},{"name":"SPYIXAL","text":"Secondary vortex turret, this glowing device is. Insert corrupted shard and disable it, you must!"},{"name":"SPYIXAL","text":"Good! Very good! Understand how it is done now, featherless one does, yes?"},{"name":"SPYIXAL","text":"Within Natalan, two more of these, you will find! Sabotage both remaining secondary devices, then seek out primary turret!"},{"name":"SPYIXAL","text":"Once main turret is down, cease feeding power to airstones, vortex array will! Then hurry back to Ehcatl and witness trial flight, we can!"},{"name":"SPYIXAL","text":"Disable two remaining secondary devices, then sabotage primary vortex turret. Vortex array will lose power, and return smiling to Ehcatl, we can!"},{"name":"SPYIXAL","text":"Squawk! Robbed balloons of propulsions, featherless one has! But sense something amiss, Tuzal does."},{"name":"SPYIXAL","text":"Report to Chief Totoloc, Tuzal will. Remain in Natalan, and keep eye on air-skulls, featherless one."},{"name":"SPYIXAL","text":"...No, better option, there is. From top of Observatorium, observe both lands of Coerthas and Black Shroud at same time, featherless one can!"},{"name":"SPYIXAL","text":"Send small featherless one to join you, Tuzal will. Welcoming of sneaky Ixal at tower, they are not! Squawk!"},{"name":"TATARAMU","text":"Where have you been, <span class=\"highlight\">Forename</span>!? Have you not heard!?"},{"name":"TATARAMU","text":"There was another of those vortex turret devices hidden in a ravine in Natalan! 'Twould seem the Ixali “air-skulls” were craftier than Tuzal gave them credit for... Let us continue to the roof and see what we can see!"},{"name":"TATARAMU","text":"There was only the one war balloon that managed to prime its airstone, but I'm afraid one is all that those zealots will need. Without ballistas, or even archers, the Ehcatl Nine can do naught to prevent their fanatic kin from dropping explosive munitions right into the camp..."},{"name":"TATARAMU","text":"Ah! Over there!"},{"name":"TATARAMU","text":"It's heading south...towards the Twelveswood!"},{"name":"TATARAMU","text":"Blast and bother it all! I feel so helpless! Why must fate be so cruel...?"},{"name":"IXALBOSS","text":"(-Ixali Chieftain-)Squawk! Bring balloon directly over unbelievers' dung heap! Smash and burn their little toy, we will!"},{"name":"IXAL01493","text":"(-Ixali Wing-)Ch-Chieftain! Alone up here, we are not!"},{"name":"TATARAMU","text":"Hm? What's happening...?"},{"name":"TATARAMU","text":"Good gods, it's the <span class=\"emphasis\">Blackjack</span>! I'd know my father's ship anywhere!"},{"name":"TATARAMU","text":"Father! What madness are you planning!?"},{"name":"TATABARU","text":"Hmph. That boy's whims will be the death of me."},{"name":"TATARAMU","text":"He did it!"},{"name":"TATABARU","text":"Hahaha! What did I tell you!? Sturdy Skyways construction! That beastman blimp never stood a chance!"},{"name":"HIGHWINDSAECRETARY","text":"(-Private Clerk-)P-Please, Chairman! You endanger yourself and the company's future both! Ugh, I believe I shall be sick..."},{"name":"TATABARU","text":"Oh, pipe down, will you! I haven't felt this alive in years! And besides, Highwind Skyways has a more than competent successor. Let us arrange a meeting with him now, shall we?"},{"name":"HIGHWINDSAECRETARY","text":"(-Private Clerk-)But what of your appointments!? The Syndicate awaits our arrival in Ul'dah, and following that you have an engagement with Master Gegeruju in Costa del Sol..."},{"name":"TATABARU","text":"Cancel them. All of them."},{"name":"HIGHWINDSAECRETARY","text":"(-Private Clerk-)B-But, sir!"},{"name":"TATARAMU","text":"Hm? He's using the signal lamp..."},{"name":"TATARAMU","text":"“M. E. E. T.” ... “A. T.” ...<br>“I. X. A. L. I.” ... “C. A. M. P.” ..."},{"name":"TATARAMU","text":"“D. O.” ... “N. O. T.” ...<br>“B. E.” ... “L. A. T. E.” ..."},{"name":"TATARAMU","text":"Ha! He could just use a linkpearl, but Father <span class=\"emphasis\">would</span> insist on doing things the hard way. Come on, <span class=\"highlight\">Forename</span>, let us be off!"},{"name":"TATARAMU","text":"Welcome back, <span class=\"highlight\">Forename</span>! With the Natalan Ixal grounded for the moment, we should have some breathing room to put the finishing touches on the <span class=\"emphasis\">Dezul Qualan</span>!"},{"name":"SEZULTOTOLOC","text":"Squawk! To featherless ones, this day belongs! From Tuzal about midair ramming, Sezul heard!"},{"name":"TATARAMU","text":"Father..."},{"name":"TATABARU","text":"...Colson had a few words with me. I had thought myself too old for one of his lectures, but apparently I was wrong."},{"name":"TATABARU","text":"I've heard that the Ixal are a people who lost their wings─a people whose greatest wish is to once more fly freely amongst the clouds. ...And that the invention of their balloons was a step towards reclaiming that which they once had."},{"name":"TATABARU","text":"But perhaps <span class=\"emphasis\">we</span> were the ones who truly lost the freedom of flight."},{"name":"TATABARU","text":"Tataramu... When I look upon your face now, I am reminded of words I've not thought of in years."},{"name":"TATABARU","text":"“Spread your wings and soar”... That was the slogan coined by our company's founder─by your grandfather."},{"name":"SEZULTOTOLOC","text":"Caw, caw! Caw, caw, caw! Stop! Split Sezul's sides, you will!"},{"name":"TATABARU","text":"...Have I said something amusing?"},{"name":"SEZULTOTOLOC","text":"Caw, caw, caw─&lt;cough&gt; &lt;cough&gt; ...Squawk! “Spread your wings and soar, you must!” Dezul Qualan's favorite saying, it was!"},{"name":"TATARAMU","text":"Your mentor said that!? Then it was not only your technology that Highwind Skyways borrowed, but your philosophy as well!"},{"name":"TATABARU","text":"Chief Totoloc, I wish to apologize for the disrespect I have shown you. Without the contributions of the Ixal, my company would not be where it is today."},{"name":"TATABARU","text":"My father, Tatanora, owed his success to the knowledge he learned under the tutelage of Dezul Qualan. On behalf of Highwind Skyways, I extend my fullest gratitude to you and your people."},{"name":"SEZULTOTOLOC","text":"Squawk! Enough! Make Sezul squirm in front of fledglings, Tatabaru will!"},{"name":"SEZULTOTOLOC","text":"Give thanks, too, Sezul would."},{"name":"SEZULTOTOLOC","text":"Brought dream within Ehcatl Nine's grasp, chairman's son has─brought Ehcatl Nine within reach of Ayatlan!"},{"name":"SEZULTOTOLOC","text":"Tataramu! Time to launch our bird into sky, yes!?"},{"name":"TATARAMU","text":"Yes, sir!"},{"name":"TATARAMU","text":"Commencing trial flight preparations for the <span class=\"emphasis\">Dezul Qualan</span>! All crew members begin pre-flight inspections!"},{"name":"TATABARU","text":"'Tis a beautiful vessel... My boy was hiding some truly revolutionary ideas in that obsessive head of his. Like grandfather, like grandson..."},{"name":"TATABARU","text":"I believe you are owed a debt of gratitude as well, adventurer. 'Twas due in no small part to your actions that the dream of my son and his Ixali colleagues now stands to become reality."},{"name":"SEZULTOTOLOC","text":"Dezul is watching even now, Sezul thinks... Arrive on paradise's doorstep soon enough, we will!"},{"name":"SEZULTOTOLOC","text":"Spread our wings and soar, we shall!"},{"name":"TATABARU","text":"I feel I have lived the last decade of my life with my eyes shut...and I have you and your friends here to thank for opening them."},{"name":"TATABARU","text":"I am honored to be able to witness the efforts of your labor come to fruition."},{"name":"SEZULTOTOLOC","text":"Twenty winters ago, hop into balloon and vanish into the wide blue skies, Sezul's mentor did. Ride air currents up to heights where Dezul awaits, we now can!"},{"name":"HIGHWINDSAECRETARY","text":"Our main offices are in an uproar about the chairman's sudden change in schedule... To the hells with it! I would see this amazing airship fly!"},{"name":"TATARAMU","text":"My dear <span class=\"highlight\">Forename</span>... Oh, the gratitude I would endlessly heap upon you! There are no words to express the joy I feel in this moment."},{"name":"TATARAMU","text":"But perhaps I am being premature─why, the ship has yet to even leave the ground! I must focus on the task at hand, and be sure that every bolt is tightened and every knot secured."},{"name":"TATARAMU","text":"...There is, in actual fact, one more request I would make of you─the absolutely final one, I promise! This is a figurehead I've been working on..."},{"name":"TATARAMU","text":"I'd like you to take the rest of the materials and craft the finishing component: some high-quality rivets. We wouldn't want the <span class=\"emphasis\">Dezul Qualan</span> losing her figurehead mid-flight now, would we?"},{"name":"TATARAMU","text":"I'd like you to take the rest of the materials and craft the finishing component: a batch of high-quality protective coating. We wouldn't want the <span class=\"emphasis\">Dezul Qualan</span>'s figurehead to be damaged by high winds now, would we?"},{"name":"TATARAMU","text":"I'd like you to take the rest of the materials and craft the finishing component: some high-quality leather-strapped brackets. We wouldn't want the <span class=\"emphasis\">Dezul Qualan</span>'s figurehead flying apart mid-flight now, would we?"},{"name":"TATARAMU","text":"I'd like you to take the rest of the materials and craft the finishing component. 'Tis only fitting that your craftsmanship binds the <span class=\"emphasis\">Dezul Qualan</span>'s figurehead together!"},{"name":"TATARAMU","text":"Here are the items you'll need. Pray present them to Sezul and see that we have his blessings on the design!"},{"name":"TATARAMU","text":"A figurehead is not strictly necessary, but the ship seems incomplete without one, don't you agree?"},{"name":"SEZULTOTOLOC","text":"Hm? Missed chance to empty bladder, <span class=\"highlight\">Forename</span> has! Unless wish to miss inaugural flight test, <span class=\"highlight\">Forename</span> does!"},{"name":"SEZULTOTOLOC","text":"...Squawk? Figurehead component materials? Familiar design, this is! When did Tataramu learn to craft traditional flying charm...? Hmmm."},{"name":"SEZULTOTOLOC","text":"Feathers of figurehead serve to remind Ixal of ancestors, and ward balloon against capricious nature of sky, they do!"},{"name":"SEZULTOTOLOC","text":"Impressed with Tataramu's foresight, Sezul is. Have Sezul's blessings to complete figurehead, <span class=\"highlight\">Forename</span> does!"},{"name":"SEZULTOTOLOC","text":"Crafting this component is simple matter, yes? Be sure, then, to pour all <span class=\"highlight\">Forename</span>'s skill into task!"},{"name":"SEZULTOTOLOC","text":"Finish part and return to Tataramu before final inspections are complete, <span class=\"highlight\">Forename</span> must! See figurehead proudly attached for test flight, Sezul would!"},{"name":"SEZULTOTOLOC","text":"Finish part and return to Tataramu before final inspections are complete, <span class=\"highlight\">Forename</span> must! See figurehead proudly attached for test flight, Sezul would!"},{"name":"SEZULTOTOLOC","text":"Component is complete, yes? Keep Tataramu waiting, <span class=\"highlight\">Forename</span> must not! If slip and break part, <span class=\"highlight\">Forename</span> does, then return to Sezul for extra materials and serving of shame, <span class=\"highlight\">Forename</span> must!"},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! You've brought the last part of the figurehead?"},{"name":"TATARAMU","text":"Thank you, this will do perfectly. I think I'm ready... Ready to entrust my life to the <span class=\"emphasis\">Dezul Qualan</span>, and aim for the highest skies."},{"name":"TATARAMU","text":"We are all but done with the last round of inspections. 'Twould be safest if you were to withdraw several steps─only the gods know how this will unfold!"},{"name":"SEZULTOTOLOC","text":"Squawk! Ehcatl Nine! Arrived at long last, moment of truth has! To Ayatlan, we fly!"},{"name":"SEZULTOTOLOC","text":"Ignite ceruleum propulsion engine!"},{"name":"IXALBUKAA","text":"(-Tazel Meyean the Lettered-)Ceruleum gas, primed and ready!"},{"name":"IXALBUKAB","text":"(-Duzal Meyean the Steady-)Caw! Engine fuel pumping!"},{"name":"IXALBUKAC","text":"(-Jezul Ahuatan the Second-)Squee-squee... Air pressure and temperature favorable!"},{"name":"TATARAMU","text":"Engine output is steady. Instrument readings within expected parameters. Extend the wings! Open the throttle!"},{"name":"SEZULTOTOLOC","text":"Caw, caw! Release moorings! Clear for takeoff!"},{"name":"TATARAMU","text":"The <span class=\"emphasis\">Dezul Qualan</span> is away!"},{"name":"IXALBUKAD","text":"(-Bozol Eduan the Exact-)Fly, it does!"},{"name":"SEZULTOTOLOC","text":"Too low... Too low, it flies! Something wrong, there is!"},{"name":"TATABARU","text":"'Tis the “Witch's Shroud”... Godsdammit, why now!?"},{"name":"TATABARU","text":"The sudden difference in aetherial density above the crown of the trees can produce turbulent air currents─a rare phenomenon peculiar to the Black Shroud and the bane of even the most seasoned airship pilot!"},{"name":"TATABARU","text":"Keep her steady, Tataramu! Ride the wind─don't fight against it!"},{"name":"TATARAMU","text":"Extend wings to full trim! Release primary and tertiary ballast!"},{"name":"TATARAMU","text":"Ugh! The ship won't turn! Come now, <span class=\"emphasis\">Dezul Qualan</span>, is this all you have!?"},{"name":"TATARAMU","text":"Fly, damn you! We built you better than this!"},{"name":"HIGHWIND","text":"(-Highwind Skyways Employees-)Fly!"},{"name":"IXALBUKAA","text":"(-Ehcatl Nine-)Fly!"},{"name":"SEZULTOTOLOC","text":"Fly, Tataramu! Flyyyyyy!"},{"name":"IXALBUKAE","text":"(-Tuzal Toltan the Unseen-)Spotted <span class=\"emphasis\">Dezul Qualan</span> from Natalan vantage point, Tuzal has! Indicate altitude of five thousand yalms, instruments do!"},{"name":"IXALBUKAE","text":"(-Tuzal Toltan the Unseen-)Soar like bird, it does! Soar like bird..."},{"name":"TATARAMU","text":"<span class=\"highlight\">Forename</span>! The test flight was a complete success! 'Twas a shaky start, but the <span class=\"emphasis\">Dezul Qualan</span> and I both returned unharmed!"},{"name":"TATARAMU","text":"And we reached our target altitude of five thousand yalms─that's higher than any Eorzean airship has ever flown! A new aeronautic record! ...Unofficial, though it may be."},{"name":"TATARAMU","text":"Despite its impressive performance, however, the <span class=\"emphasis\">Dezul Qualan</span> still cannot achieve that which Sezul dreams: to climb above and beyond the clouds and arrive on the legendary shores of Ayatlan..."},{"name":"TATARAMU","text":"But we'll continue to improve and tweak our prototype, and one day we <span class=\"emphasis\">will</span> catch a glimpse of that floating paradise! There is no record that cannot be broken!"},{"name":"TATARAMU","text":"...By the by, <span class=\"highlight\">Forename</span>. There is something I've been meaning to ask you for the longest time."},{"name":"TATARAMU","text":"I know why <span class=\"emphasis\">I</span> am here, but whatever brought <span class=\"emphasis\">you</span> to the Ehcatl Nine's camp?"},{"name":"Q1","text":"What brought you to the Ehcatl Nine's camp?"},{"name":"A1","text":"Oh...that's a good question!"},{"name":"A1","text":"Well, one thing led to another, and..."},{"name":"TATARAMU","text":"You... Your original mission was to respond to an Ixali threat!? I do believe you've gone above and beyond and somewhere quite far to the left of the call of duty!"},{"name":"TATARAMU","text":"I daresay the Twin Adder officer who enlisted your services is by now rather alarmed by your prolonged absence. Perhaps you should report back to Gridania and put her mind at ease..."},{"name":"TATARAMU","text":"I mean to remain in Ehcatl, and help Sezul and his crew expand the field of aeronautics. Pray visit if you will and lend a helping hand!"},{"name":"SEZULTOTOLOC","text":"Listen to Sezul, <span class=\"highlight\">Forename</span>! To have dream is not enough─chase it, you must! Stand still for <span class=\"highlight\">Forename</span>, it will not!"},{"name":"SEZULTOTOLOC","text":"Sound like philosopher, Sezul does! Caw, caw, caw! Maybe chosen wrong profession, Sezul has!"},{"name":"SCARLET","text":"Yes, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>? What can I do for─ Oh! The attack on E–Tatt's Spire!"},{"name":"SCARLET","text":"The captain mentioned that he'd sent you out to investigate further, but I'd completely forgotten you were still─ Er, that is to say, the Ixal appear to have abandoned their plans to assault our towers. Excellent work, <span class=\"alternative-container\"><span class=\"alternative\">adventurer</span><span class=\"alternative\">[GC Rank]</span></span>!"},{"name":"SCARLET","text":"We must, however, remain alert and at the ready. The thought of those war balloons drifting over the city walls is one of our citizens' greatest fears─a nightmare that we must never allow to become reality."},{"name":"SCARLET","text":"I shall likely have need of your services in the days to come, so pray keep your skills honed and your blades sharp."},{"name":"SCARLET","text":"...Did you hear the news, by the way? There was some excitement here in Gridania while you were off trampling the underbrush."},{"name":"SCARLET","text":"The son of Highwind Skyways chairman Tatabaru suddenly vanished into thin air. Folk were crying foul play, though no body or blood was in evidence. Hm? He's already been found? Well, perhaps now things can return to normal..."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Ehcatl Nine."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Ehcatl Nine vendor."},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"TALK","text":"（★未使用／削除予定★）"},{"name":"TATABARU","text":"（★未使用／削除予定★）"},{"name":"IXALBUKAE","text":"（★未使用／削除予定★）"}],"reward":{"gil":3000},"reqs":{"beastrank":6,"jobs":[{"lvl":1,"id":33}],"quests":[67028]}},"partials":[{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"npc","id":"1009294","obj":{"i":1009294,"n":"Scarlet","l":52,"q":7,"t":"Serpent Lieutenant"}},{"type":"npc","id":"1009204","obj":{"i":1009204,"n":"Tataramu","l":57,"q":8}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"npc","id":"1009629","obj":{"i":1009629,"n":"Tuzal Toltan The Unseen","l":63,"q":1}},{"type":"npc","id":"1009659","obj":{"i":1009659,"n":"Tatabaru","l":57,"q":1}},{"type":"npc","id":"1009676","obj":{"i":1009676,"n":"Private Clerk","l":57,"q":1}},{"type":"npc","id":"1009693","obj":{"i":1009693,"n":"Tataramu","l":63,"q":1}},{"type":"npc","id":"1009707","obj":{"i":1009707,"n":"Tataramu","l":57,"q":1}},{"type":"item","id":"8089","obj":{"i":8089,"n":"Finishing Component Materials","l":1,"c":26001,"t":63}},{"type":"item","id":"8133","obj":{"i":8133,"n":"Finishing Component","l":1,"c":21012,"t":63}},{"type":"item","id":"8090","obj":{"i":8090,"n":"Figurehead Component Materials","l":1,"c":21907,"t":63}},{"type":"item","id":"8134","obj":{"i":8134,"n":"Figurehead Component","l":1,"c":21012,"t":63}},{"type":"quest","id":"67028","obj":{"i":67028,"n":"Never Be Royal","g":42,"l":"North Shroud","s":7,"f":1}}]}