{"quest":{"name":"Reach for the Starboard","location":"North Shroud","id":67034,"patch":2.35,"sort":41,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009214,"target":1009214,"involved":[1009218,1009635],"genre":43,"usedItems":[8066,8105],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tazel Meyean the Lettered has need of a capable craftsman to lend form to his genius.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 10 and above.","Tazel Meyean has asked you to craft for him four high-quality starboard wing components for the <span class=\"emphasis\">Dezul Qualan</span>. In order to obtain the requisite materials, you must first gather fifteen pristine oak branches and five pristine oak logs in the vicinity of Proud Creek.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have obtained the pristine oak branches and logs. Make your way to Fallgourd Float, and offer them to the Black Rabbit trader stationed there in exchange for the materials required in the synthesis.","You have obtained several sets of starboard wing component materials. Present them to Hildeyerd at the Bobbing Cork to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize four high-quality starboard wing components, and deliver them to Tazel Meyean at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You have delivered the starboard wing components to Tazel Meyean, who squawks in sheer delight. The Ixal is most impressed by your craftsmanship, and will doubtless turn to you again to lend form to his genius."],"objectives":["As a botanist, harvest pristine oak branches from mature trees in Proud Creek.","As a botanist, harvest pristine oak logs from mature trees in Proud Creek.","Deliver the branches and logs to the Black Rabbit trader at Fallgourd Float.","Present the starboard wing component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize starboard wing components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the starboard wing components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Tazel Meyean the Lettered</span></span>."],"dialogue":[{"name":"TAZELMEYEAN","text":"Squawk! Featherless one wishes to help lend shape to my genius, yes? Starboard wing, I make. Make components for this, you will."},{"name":"TAZELMEYEAN","text":"What components, you ask? Framework for wing, light and strong for better efficiency. Four sets of highest quality, I need."},{"name":"TAZELMEYEAN","text":"What components, you ask? Aetheric coating for wing, ideal for conducting wind energy. Four sets of highest quality, I need."},{"name":"TAZELMEYEAN","text":"What components, you ask? Aetheric sailcloth for wing, ideal for trapping wind energy. Four sets of highest quality, I need."},{"name":"TAZELMEYEAN","text":"For crafting, special materials, you need. To obtain them, trade with Black Rabbit trader at Fallgourd Float, you must."},{"name":"TAZELMEYEAN","text":"To him, fifteen pristine oak branches and five pristine oak logs, you give. Find these near Proud Creek, you can. When materials, you have, use crafting facility at Fallgourd to make components, you can."},{"name":"TAZELMEYEAN","text":"Squawk! Featherless one help lend shape to Tazel's genius. Bring me four starboard wing components of highest quality, you will."},{"name":"GARDENER1498","text":"Here to collect the materials on Tazel's behalf? Then I trust you have the wares for the exchange."},{"name":"GARDENER1498","text":"&lt;gasp&gt; The flowing grain... The delicate fragrance... These are some of the finest specimens of oak I have ever seen!"},{"name":"GARDENER1498","text":"As agreed upon, here are the materials that were requested. A pleasure doing business!"},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"TAZELMEYEAN","text":"Ah, featherless one returns. Starboard wing components of highest quality, I trust you have?"},{"name":"TAZELMEYEAN","text":"Squawk! Precisely to specifications, they are! Most impressed, I am! With my genius and your deft hands, to infinity and beyond, we will go!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to botanist by equipping a hatchet to your main hand."}],"reward":{"gil":763,"reputation":35,"items":[{"num":25,"id":2},{"id":21072}]},"reqs":{"beastrank":4,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":18}]}},"partials":[{"type":"npc","id":"1009214","obj":{"i":1009214,"n":"Tazel Meyean The Lettered","l":57,"q":7}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"npc","id":"1009635","obj":{"i":1009635,"n":"Black Rabbit Trader","l":57,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8066","obj":{"i":8066,"n":"Starboard Wing Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8105","obj":{"i":8105,"n":"Starboard Wing Component","l":1,"c":23001,"t":63}}]}