{"quest":{"name":"Trust, but Verify","location":"North Shroud","id":67030,"patch":2.35,"sort":11,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009211,"target":1009211,"involved":[1000656,1009199,1009200],"genre":43,"usedItems":[8052,8091],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Many would deign to call themselves able, but Yazel Ahuatan the Able goes so far as to claim it as his title.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 1 and above, and the battle portion for Disciples of War or Magic level 41 and above.","Questioning your skills as an artisan, Yazel Ahuatan invites you to prove him wrong by crafting a bladder component with the materials he has provided. His challenge is further complicated by the requirement that you use special facilities in Hyrstmill to craft the component─facilities which are administered by Dametta, a woman of some repute, who may not be amenable to your request.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Dametta is willing to grant you permission to use her facilities─provided you carry out a simple task in exchange. A particularly persistent opo–opo has been raiding her stores for some time, and she would have you permanently resolve the situation. With the aid of ripe Mun–Tuy beans, lure the beastkin out from his lair near E–Tatt's Spire and end his reign of terror once and for all. Alternatively, you could converse with the woman further and attempt to persuade her...but that approach may not end well.","The notorious bean thief is no more, and the claw you have extricated from its carcass should serve as ample proof. Present it and the bladder component materials to Dametta in Hyrstmill.","The claw serves both to horrify Dametta's sensibilities and satisfy her requirements. With the materials provided to you by Yazel Ahuatan, synthesize a bladder component, and deliver it to him at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Production</span> wears off or the synthesis ends in failure, you may try again by speaking with Dametta.","The most able of Ixal accepts your work with a mighty squa-hawk, satisfied with its quality. Within you he sees a great potential─one which he likens to his own, glimpsed by Chief Totoloc long ago. Weighty words indeed, one might say─though one must always consider the source, as well."],"objectives":["Speak with Dametta.","Use the ripe Mun–Tuy beans to lure out the salivating simian.","Present the simian claw and the bladder component materials to Dametta.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a bladder component</span><span class=\"alternative\">Deliver the bladder component to Yazel Ahuatan the Able</span></span>."],"dialogue":[{"name":"YAZELAHUATAN","text":"Squahaha! An able crafter, featherless one is? Not so able as Yazel, I think! Yet prove me wrong, you may, and aid Ehcatl in so doing!"},{"name":"YAZELAHUATAN","text":"An emergency release valve, for use with an airship bladder, we require! A simple task for a featherless one skilled as you, Yazel trusts."},{"name":"YAZELAHUATAN","text":"Tanning agents for treating materials used to craft an airship bladder, we require! A simple task for a featherless one skilled as you, Yazel trusts."},{"name":"YAZELAHUATAN","text":"Leather and canvas used to craft an airship bladder, we require! A simple task for a featherless one skilled as you, Yazel trusts."},{"name":"YAZELAHUATAN","text":"A skilled <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> and listener both, Yazel hopes you are, for the aid of a featherless chatterbox, you require, to use these materials. Squa-hawk! For this component, the facilities of Dametta, you must utilize."},{"name":"YAZELAHUATAN","text":"The ramblings of the chatterbox, you must endure, if to Yazel you wish to prove yourself able. Squa-hawk!"},{"name":"DAMETTA","text":"Oh my, you wish to use these facilities? They are lovely, aren't they? I do my utmost to keep them in tip-top condition, you know! Regular cleaning and maintenance is far more essential than most people realize."},{"name":"DAMETTA","text":"However, as much as I'd love to let you do so, I must ask that you do something in exchange. Worry not, it's nothing too difficult! Just a simple favor. I do have to clean up after you, you know!"},{"name":"DAMETTA","text":"Know you of opo–opos? Dreadful little scamps, always stealing my Mun–Tuy beans. One in particular has given me no end of trouble, and I will suffer it no longer! Pray use these ripe beans to lure him out from his lair near E–Tatt's Spire and end his reign of terror! And, though it's a grisly thing to ask, I must insist that you return with proof of the deed─a fang, or a claw, or something of that nature. Nothing too large, mind you. I don't want it as a trophy to hang on my wall. I'm not a monster!"},{"name":"DAMETTA","text":"Truth be told, I've no real desire to see proof of the deed. However, I've been deceived before─not to imply that you're a liar like <span class=\"emphasis\">that</span> adventurer was, of course!"},{"name":"DAMETTA","text":"You see, he came through the other day and, like you, he wished to use these facilities. I told him─as I told you─that I would gladly permit him to do so, if only he first dealt with a certain opo–opo. So off he went for the better part of a day, eventually returning to report that the deed was done! Naturally, I was beside myself with joy, and I went to bed that night thinking that the opo–opo was no more and all was right with the world."},{"name":"DAMETTA","text":"Needless to say, I was <span class=\"emphasis\">very</span> cross when I awoke to find my stores pilfered yet again, and the ground stained with <span class=\"emphasis\">copious</span> amounts of saliva─incontrovertible evidence that my sworn enemy yet lived! I made up my mind then and there to give that adventurer a piece of my mind─especially once I learned he had spent that afternoon <span class=\"emphasis\">drinking in a pub</span> instead of tracking my opo–opo."},{"name":"DAMETTA","text":"But despite learning of his nefarious deeds, I never was able to track him down, which was surprising given how queer a fellow he was! He had <span class=\"emphasis\">onions</span> tied to his belt, which I don't need to tell you is <span class=\"emphasis\">very</span> unusual. When I asked him about them, he said it was the style at the time he was growing up, and he'd always had a fondness for his grandfather's ways..."},{"name":"SYSTEM","text":"As Dametta struggles to recall if the onions were white or yellow, your mind begins to wander..."},{"name":"POP","text":"The opo–opo sprays saliva in your general direction!"},{"name":"DAMETTA","text":"As I told you before, you are more than welcome to make use of these facilities─provided you deal with that dastardly opo–opo first. Oh, and as a precaution, I must ask that you present your materials for inspection as well. You would be <span class=\"emphasis\">shocked</span> by what some people have tried to make here!"},{"name":"DAMETTA","text":"My word, is that really... Oh gods, I can't bear to look at it! Take it from my sight and dispose of it─but not in the river! Now then, deep breaths... Though unusual, I don't believe your materials could be used for evil ends. Here you are. You'll note I didn't return them all─there are several times the required materials, it would seem. Whoever entrusted this task to you left a note in the bag: “To featherless neuker, give only required parts. In case of failure, retain spares.” Hmmm... What in the world is a “neuker”?"},{"name":"DAMETTA","text":"Oh, do you require more time with the facilities? By all means, take as long as you like! And if you require additional materials, let me know. I have plenty here for the “featherless neuker.”"},{"name":"DAMETTA","text":"Is that the finished product? I...I have no idea what that is, but it looks splendid! I'm sure your client will love it! Ah─it so happens there was another note in the bag: “Retain spare parts, in case featherless neuker loses component en route.” He really doesn't trust you, does he?"},{"name":"YAZELAHUATAN","text":"Squahaha! Returned, the one who would prove <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> able is! Bladder component, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has brought?"},{"name":"YAZELAHUATAN","text":"...Squa-hawk! Able indeed, featherless one is! Within you lies great potential, as Chief Totoloc said."},{"name":"YAZELAHUATAN","text":"Potential in Yazel too, the chief once saw. Not wrong in either case, it is more than clear to me! Squawk!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."}],"reward":{"gil":489,"reputation":20,"items":[{"num":10,"id":2},{"id":21072}]},"reqs":{"beastrank":1,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009211","obj":{"i":1009211,"n":"Yazel Ahuatan The Able","l":57,"q":4}},{"type":"npc","id":"1000656","obj":{"i":1000656,"n":"Dametta","l":57,"q":4}},{"type":"npc","id":"1009199","obj":{"i":1009199,"n":"Sezul Totoloc","l":57,"q":10}},{"type":"npc","id":"1009200","obj":{"i":1009200,"n":"Ehcatl Nine Foreman","l":57,"q":3}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8052","obj":{"i":8052,"n":"Bladder Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8091","obj":{"i":8091,"n":"Bladder Component","l":1,"c":21005,"t":63}}]}