{"quest":{"name":"Larboard and Lodging","location":"North Shroud","id":67035,"patch":2.35,"sort":42,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009214,"target":1009214,"involved":[1009218,1009636],"genre":43,"usedItems":[8067,8106],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tazel Meyean the Lettered has precision components that want for crafting.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 10 and above.","Tazel Meyean has asked you craft for him four high-quality larboard wing components for the <span class=\"emphasis\">Dezul Qualan</span>. In order to obtain the requisite materials, you must first gather fifteen small granite rocks and five large granite rocks in the area west of Peacegarden.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have obtained the small and large granite rocks. Make your way to Fallgourd Float, and offer them to the independent merchant stationed there in exchange for the materials you require.","You have obtained several sets of larboard wing component materials. Present them to Hildeyerd at the Bobbing Cork in order to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize four high-quality larboard wing components, and deliver them to Tazel Meyean at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You have delivered the larboard wing components to Tazel Meyean, who squawks in sheer delight. The Ixal is most impressed by your attention to detail, and will doubtless turn to you again as he continues striving for perfection."],"objectives":["As a miner, mine small granite rocks near Peacegarden.","As a miner, mine large granite rocks near Peacegarden.","Deliver the rocks to the independent merchant at Fallgourd Float.","Present the larboard wing component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize larboard wing components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the larboard wing components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Tazel Meyean the Lettered</span></span>."],"dialogue":[{"name":"TAZELMEYEAN","text":"Squawk! Make four components for larboard wing, you must: frameworks for wing, crafted to finest finish. Vital to vessel performance, they are."},{"name":"TAZELMEYEAN","text":"Squawk! Prepare four components for larboard wing, you must: vials of aetheric coating for wing, crafted to finest finish. Vital to vessel performance, they are."},{"name":"TAZELMEYEAN","text":"Squawk! Make four components for larboard wing, you must: bolts of aetheric sailcloth for wing, crafted to finest finish. Vital to vessel performance, they are."},{"name":"TAZELMEYEAN","text":"Perfection exists not─only striving for it, there is. Keep experimenting and improving designs, I shall. For this, many components are needed."},{"name":"TAZELMEYEAN","text":"By connection of Tataramu, secured materials, I have. From independent merchant at Fallgourd Float, collect them you must."},{"name":"TAZELMEYEAN","text":"To merchant, fifteen small granite rocks and five large granite rocks, you give. Find them west of Peacegarden, you can. When materials, you have, use crafting facility at Fallgourd to make components, you can."},{"name":"TAZELMEYEAN","text":"Squawk! Components for larboard wing, I need. Vital to vessel performance, they are."},{"name":"MINER","text":"You must be the adventurer that Master Tataramu mentioned. You've brought the wares for the exchange, I trust?"},{"name":"MINER","text":"Ah, yes, quality chunks of granite, as promised! My thanks, friend. I hope the materials serve you well."},{"name":"MINER","text":"Doubtless you already know this, but you can make use of the crafting facility at the Bobbing Cork. Speak with Hildeyerd, the woman in charge, and she'll take care of you. Now then, if you'll excuse me, I have other business to attend to."},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"TAZELMEYEAN","text":"Crafted larboard wing components of finest finish, featherless one has? Then show them to Tazel, you must!"},{"name":"TAZELMEYEAN","text":"Squawk! Precisely produced, they are! Featherless one after Tazel's own heart, adventurer is! For perfection, together we strive!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to miner by equipping a pickaxe to your main hand."}],"reward":{"gil":763,"reputation":35,"items":[{"num":25,"id":3},{"id":21072}]},"reqs":{"beastrank":4,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":17}]}},"partials":[{"type":"npc","id":"1009214","obj":{"i":1009214,"n":"Tazel Meyean The Lettered","l":57,"q":7}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"npc","id":"1009636","obj":{"i":1009636,"n":"Independent Merchant","l":57,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8067","obj":{"i":8067,"n":"Larboard Wing Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8106","obj":{"i":8106,"n":"Larboard Wing Component","l":1,"c":23001,"t":63}}]}