{"quest":{"name":"Keeping Up Appearances","location":"North Shroud","id":67032,"patch":2.35,"sort":13,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009211,"target":1009211,"involved":[1009217],"genre":43,"usedItems":[8054,8093],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>As ablest of Ixal, Yazel Ahuatan has a reputation to maintain.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 1 and above, and the battle portion for Disciples of War or Magic level 41 and above.","The recent loss of starboard hull component materials has placed Yazel Ahuatan in a precarious position. So that none may have cause to doubt his ableness, recover the materials his courier abandoned when attacked by Ixal in Treespeak.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","After a brief skirmish, the materials are yours. However, returning the materials will not suffice to redeem Yazel Ahuatan. Visit the crafting facility at Treespeak Stables, and present the component materials to Nellemond, so that you may use the facilities to construct the requisite components.","You have handed over the component materials to Nellemond, and gained access to the crafting facility. Synthesize two starboard hull components, and deliver them to Yazel Ahuatan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Finishing</span> wears off or the synthesis ends in failure, you may try again by speaking with Nellemond.","The squa-hawk which echoes throughout Ehcatl is one of ultimate relief, as Yazel Ahuatan's comrades no longer have cause to doubt his competence. Maintaining an image as an able Ixal can be difficult at times, but the adulation of Ixali maidens more than justifies the effort─or so Yazel Ahuatan would doubtless say, if the question were put to him."],"objectives":["Obtain starboard hull component materials from the Ehcatl Nine storage pots in Treespeak.","Present the starboard hull component materials to Nellemond at Treespeak Stables.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize starboard hull components</span><span class=\"alternative\">Deliver the starboard hull components to Yazel Ahuatan the Able</span></span>."],"dialogue":[{"name":"YAZELAHUATAN","text":"Squaaawk! Able though I am, cursed with terrible fortune, I am too! Lost to Garuda-worshipping buzzards, materials for constructing urgently required starboard hull components are!"},{"name":"YAZELAHUATAN","text":"Precious materials for constructing the hull, lost to our enemies in Treespeak! Squa-hawk!"},{"name":"YAZELAHUATAN","text":"Precious materials for preparing an essential finish for the hull, lost to our enemies in Treespeak! Squa-hawk!"},{"name":"YAZELAHUATAN","text":"Precious materials for preparing leather-backed plywood for the hull, lost to our enemies in Treespeak! Squa-hawk!"},{"name":"YAZELAHUATAN","text":"Retrieve the materials myself, I would, but able <span class=\"emphasis\">lover</span>, Yazel is─not able fighter. Featherless <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> and fighter both, you are, and more than capable of recovering materials."},{"name":"YAZELAHUATAN","text":"From storage pots, retrieve the materials, then for crafting, to Treespeak Stables you must go. Open to all featherless, the facilities there are. Squahaha! Need for special favors, there is not."},{"name":"YAZELAHUATAN","text":"Materials enough for two components, you must recover! Without components, Yazel will fall out of favor. Able to suffer much, Yazel is, except that!"},{"name":"POP","text":"With a cacophony of squawking, the enemy appears!"},{"name":"BALOON","text":"Unfeathered! Fly!"},{"name":"BALOON","text":"Squaaawk! Friend of Ehcatl, you die!"},{"name":"NELLEMOND","text":"Greetings, friend! Our doors─assuming we had any─are open to all! You wish to process those materials, yes? Hmmm... If you would first permit me to conduct an inspection...?"},{"name":"NELLEMOND","text":"Ah, my concern was for naught. These materials are both quality and plentiful! In fact, I have calculated the optimum amount required to craft the components you have in mind. I shall hold on to the excess while you work your synthesizing magic! Pray let me know if you require any replacements."},{"name":"NELLEMOND","text":"The use of the crafting facility here at Treespeak Stables is entirely free of charge! Pray put concerns of sordid coin from your mind and concentrate on your wondrous creation!"},{"name":"NELLEMOND","text":"Your crafting endeavor was a success? Then you must waste no time in returning to your client. Ah, and should something unfortunate befall your commission─accidental loss, theft, act of primal─you always have the option of retrieving from me the remaining materials and trying again!"},{"name":"YAZELAHUATAN","text":"Squaaawk! Suffer the barbs of his comrades, the Able cannot! Bring me the starboard hull components, you must!"},{"name":"YAZELAHUATAN","text":"Squa-hawk! Safe, my reputation is! To featherless <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>, much and more is owed!"},{"name":"YAZELAHUATAN","text":"Rejoin the ranks of the buzzards, I wish not to do. Much more beloved by maidens, Yazel is, as able revolutionary!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."}],"reward":{"gil":549,"reputation":20,"items":[{"num":10,"id":4},{"id":21072}]},"reqs":{"beastrank":1,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009211","obj":{"i":1009211,"n":"Yazel Ahuatan The Able","l":57,"q":4}},{"type":"npc","id":"1009217","obj":{"i":1009217,"n":"Nellemond","l":57,"q":3}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8054","obj":{"i":8054,"n":"Starboard Hull Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8093","obj":{"i":8093,"n":"Starboard Hull Component","l":1,"c":21005,"t":63}}]}