{"quest":{"name":"Hells-vent on the Heavens","location":"North Shroud","id":67039,"patch":2.35,"sort":46,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009214,"target":1009214,"involved":[1008945],"genre":43,"usedItems":[8071,8110],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tazel Meyean the Lettered would turn to you for your crafting expertise.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 10 and above, and the battle portion for Disciples of War or Magic level 47 and above.","Tazel Meyean the Lettered has asked you to craft four high-quality components for his revolutionary heat vent unit. Doing so requires that you have access to Gerolt's forge in Hyrstmill. By way of payment for using the facility, the Ixali inventor bids you obtain three pieces of plate worn by the dullahans that prowl Proud Creek.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have obtained three pieces of dullahan plate. Make your way to Hyrstmill and offer them to Drake, Gerolt's apprentice.","Satisfied with the dullahan plate you have brought, Drake grants you unlimited access to his master's crafting facility. With the materials he has supplied, synthesize four high-quality heat vent components, and deliver them to Tazel Meyean at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Drake.","You have delivered the heat vent components to Tazel Meyean, who squawks in sheer delight. The Ixal is most impressed by your flawless craftsmanship, and expresses his excitement at the prospect of flying free like the wind with his brethren."],"objectives":["Obtain pieces of dullahan plate from dullahans at Proud Creek.","Deliver the dullahan plate to Drake at Hyrstmill.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize heat vent components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the heat vent components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Tazel Meyean the Lettered</span></span>."],"dialogue":[{"name":"TAZELMEYEAN","text":"Squawk! Almost complete, my revolutionary heat vent unit is. Four components of highest quality, I need."},{"name":"TAZELMEYEAN","text":"Pipes for passing fiery-hot air, they are. Strong and resistant to heat. Craft components at Hyrstmill, you must."},{"name":"TAZELMEYEAN","text":"Rubber lining for pipes, it is. Strong and resistant to heat. Craft components at Hyrstmill, you must."},{"name":"TAZELMEYEAN","text":"Composite material for casing, it is. Strong and resistant to heat. Craft components at Hyrstmill, you must."},{"name":"TAZELMEYEAN","text":"Featherless one Tataramu says, at hamlet is weaponsmith of great skill. Suitable crafting facility and abundant materials, he has."},{"name":"TAZELMEYEAN","text":"With his fledgling, name of Drake, you must speak─get permission to use facility and materials. As payment, bring him dullahan plate. Maybe three pieces. Get them from fiends around Proud Creek, you can."},{"name":"TAZELMEYEAN","text":"Working on revolutionary heat vent unit, I am. Four components of highest quality, I need. Craft components at Hyrstmill, you must."},{"name":"DRAKE","text":"Greetings, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Are you here to collect your kettle?<br>...Begging your pardon? You wish to <span class=\"emphasis\">use</span> our facility? I-I'm afraid I must consult my master..."},{"name":"DRAKE","text":"You would give us these pieces of plate as payment? Gods know we can't have too much good steel for our kettles. Master Gerolt shall have no cause to complain, I should think."},{"name":"DRAKE","text":"Our humble facility is at your disposal, and likewise the supplies you say you need. The steel you brought more than covers the costs."},{"name":"DRAKE","text":"If you have need of additional materials, do not hesitate to ask me. The steel you brought is of excellent quality and more than covers the costs."},{"name":"DRAKE","text":"You have finished your work, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? I assume that you will be on your way. Should you later find that you still have need of our facility and supplies, know that both are at your disposal."},{"name":"TAZELMEYEAN","text":"Welcome here, featherless one is. Four high-quality components for heat vent unit, you have made? Then quickly show Tazel, you must."},{"name":"TAZELMEYEAN","text":"Squawk! Nothing to be desired, workmanship leaves! Most impressed, I am! Fly free like wind, soon Ehcatl Nine will!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":763,"reputation":35,"items":[{"num":25,"id":7},{"id":21072}]},"reqs":{"beastrank":4,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009214","obj":{"i":1009214,"n":"Tazel Meyean The Lettered","l":57,"q":7}},{"type":"npc","id":"1008945","obj":{"i":1008945,"n":"Drake","l":57,"s":19,"q":3,"t":"Replica Vendor","r":1,"a":139,"c":[30.42,20.15]}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8071","obj":{"i":8071,"n":"Heat Vent Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8110","obj":{"i":8110,"n":"Heat Vent Component","l":1,"c":23001,"t":63}}]}