{"quest":{"name":"Blow, Ye Winds","location":"North Shroud","id":67033,"patch":2.35,"sort":14,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009211,"target":1009211,"involved":[1009217,1009633],"genre":43,"usedItems":[8055,8094],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>An able Ixal keeps able allies close, and Yazel Ahuatan the Able prays you are one such <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 1 and above, and the battle portion for Disciples of War or Magic level 41 and above.","While transporting a shipment of larboard hull component materials to Ehcatl, one of Yazel Ahuatan's carriers was waylaid by Gridanian forces. To ensure that the construction of the <span class=\"emphasis\">Dezul Qualan</span> continues as scheduled, you have been asked to retrieve the component materials. Should the Ehcatl Nine carrier yet live, you will likely find him in hiding. If so, with the chat mode in <span class=\"highlight\">Say</span>, enter the password “With the Wind” to identify yourself as a friend.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You find the carrier alive and well, and retrieve from him the component materials. Alas, simply completing the delivery will not suffice, as the components themselves are urgently needed. Visit the crafting facility at Treespeak Stables, and present the component materials to Nellemond, so that you may use the facilities to construct the requisite components.","You have handed over the component materials to Nellemond, and gained access to the crafting facility. Synthesize three larboard hull components, and deliver them to Yazel Ahuatan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Finishing</span> wears off or the synthesis ends in failure, you may try again by speaking with Nellemond.","Your unexpected display of initiative surprises the able Yazel Ahuatan, who expresses his delight with a requisite squa-hawk. Thanks to your efforts, he will be held in even higher esteem by his comrades, for able is the Ixal served by able subordinates."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “With the Wind” to let the Ehcatl Nine carrier know you are not an enemy.","Present the larboard hull component materials to Nellemond at Treespeak Stables.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize larboard hull components</span><span class=\"alternative\">Deliver the larboard hull components to Yazel Ahuatan the Able</span></span>."],"dialogue":[{"name":"YAZELAHUATAN","text":"Ill tidings, featherless <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>! Waylaid by featherless ones, our carrier has been! Squa-hawk! Trapped at best, dead at worst, Yazel fears!"},{"name":"YAZELAHUATAN","text":"Of the essence, time was, so risky route near Treespeak Stables I bade him take. Larboard hull component materials, to Ehcatl, he was to bring."},{"name":"YAZELAHUATAN","text":"For the plates to construct the hull, materials precious and strong. Nearly depleted, our supply is!"},{"name":"YAZELAHUATAN","text":"For the finish to prepare the plating, materials precious and essential. Nearly depleted, our supply is!"},{"name":"YAZELAHUATAN","text":"For the leather-backed plywood to construct the hull, materials precious and light. Nearly depleted, our supply is!"},{"name":"YAZELAHUATAN","text":"If yet alive, likely in hiding, the carrier is. Know you for friend, he may not, so “With the Wind,” to him you must whisper. Words of power, they are, known only to Ehcatl and their allies. Squa-hawk!"},{"name":"YAZELAHUATAN","text":"Simple enough, the retrieval of materials is, if the carrier is fallen. However, if yet alive, words of power, you must say to him. “With the Wind,” forget it not. Squa-hawk!"},{"name":"IXALGATHERER01497","text":"Squaaawk! Featherless neuker! Back, you must stay, or...or a second time, I will demand!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter the password “With the Wind” to let the Ehcatl Nine carrier know you are a friend."},{"name":"SYSTEM","text":"With the Wind"},{"name":"IXALGATHERER01497","text":"Squawawk!? With the wind, featherless neuker is!? Relieved and contrite, I am! All neukers, look alike to me, they do. As a friend of Ehcatl, recognize, I did not!"},{"name":"IXALGATHERER01497","text":"Deliver the materials in my stead, I would ask, but that alone, suffice it will not. Too late, this shipment is; completed components, we must now deliver. Squawk!"},{"name":"IXALGATHERER01497","text":"Open to all featherless, the facilities of Treespeak Stables are. There, craft three larboard hull components, featherless friend can. Other recourse, we have not!"},{"name":"IXALGATHERER01497","text":"Afraid, I am, but patient, I am too. When featherless ones leave, chance to escape, I shall seize. Wait not for me, friend of Ehcatl─craft larboard hull components, you must!"},{"name":"NELLEMOND","text":"Greetings, friend! Our doors─assuming we had any─are open to all! You wish to process those materials, yes? Hmmm... If you would first permit me to conduct an inspection...?"},{"name":"NELLEMOND","text":"Ah, my concern was for naught. These materials are both quality and plentiful! In fact, I have calculated the optimum amount required to craft the components you have in mind. I shall hold on to the excess while you work your synthesizing magic! Pray let me know if you require any replacements."},{"name":"NELLEMOND","text":"The use of the crafting facility here at Treespeak Stables is entirely free of charge! Pray put concerns of sordid coin from your mind and concentrate on your wondrous creation!"},{"name":"NELLEMOND","text":"Your crafting endeavor was a success? Then you must waste no time in returning to your client. Ah, and should something unfortunate befall your commission─accidental loss, theft, act of primal─you always have the option of retrieving from me the remaining materials and trying again!"},{"name":"YAZELAHUATAN","text":"Squaaawk! Without component materials, soon halt, construction of the <span class=\"emphasis\">Dezul Qualan</span> will. Disastrous for Ehcatl─and Yazel, this would be!"},{"name":"YAZELAHUATAN","text":"Squa-hawk! Materials, I expected, yet components, you have brought!?"},{"name":"YAZELAHUATAN","text":"My mind, waylaid courier and featherless crafter did read! Squahaha! Initiative, Yazel values much in his allies."},{"name":"YAZELAHUATAN","text":"Who better than able allies to prove Yazel's own ableness, I say!? Rise ever higher, I will, with the aid of featherless <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> ilk!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."}],"reward":{"gil":609,"reputation":20,"items":[{"num":10,"id":5},{"id":21072}]},"reqs":{"beastrank":1,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009211","obj":{"i":1009211,"n":"Yazel Ahuatan The Able","l":57,"q":4}},{"type":"npc","id":"1009217","obj":{"i":1009217,"n":"Nellemond","l":57,"q":3}},{"type":"npc","id":"1009633","obj":{"i":1009633,"n":"Ehcatl Nine Carrier","l":57,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8055","obj":{"i":8055,"n":"Larboard Hull Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8094","obj":{"i":8094,"n":"Larboard Hull Component","l":1,"c":21005,"t":63}}]}