{"quest":{"name":"Gyrodriven","location":"North Shroud","id":67040,"patch":2.35,"sort":21,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009212,"target":1009212,"involved":[1009218],"genre":43,"usedItems":[8056,8095],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Methuli Cattlan the Hard is eyeing you for a hard task.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 3 and above, and the battle portion for Disciples of War or Magic level 43 and above.","Methuli Cattlan has asked you craft for her three high-quality gyrodrive components for the <span class=\"emphasis\">Dezul Qualan</span>. Unfortunately, the materials required in their synthesis have been stolen in transit by the Ixal who dwell in the logging grounds. Make your way to Alder Springs, and retrieve the materials from the storage pot in which they are kept.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have reclaimed the gyrodrive component materials. Present them to Hildeyerd at the Bobbing Cork in order to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize three high-quality gyrodrive components, and deliver them to Methuli Cattlan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You have delivered the gyrodrive components to Methuli Cattlan, who squawks in sheer delight. Having heaped praise upon your craftsmanship, she goes on to express her disdain for her brethren who blindly worship Garuda. It would seem that birds of a feather do not necessarily flock together."],"objectives":["Obtain gyrodrive component materials from stolen storage pots in Alder Springs.","Present the gyrodrive component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize gyrodrive components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the gyrodrive components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Methuli Cattlan the Hard</span></span>."],"dialogue":[{"name":"METHULICATTLAN","text":"You there, no-feathers! Helpful you are, yes? Have you craft high-quality components for gyrodrive of airship, Methuli would."},{"name":"METHULICATTLAN","text":"Know you Hyuran woman, name of Hildeyerd? Chief of crafting facility at Fallgourd Float, she is. For task, make use of her facility, you must."},{"name":"METHULICATTLAN","text":"Have you go there, Methuli would, and craft frame for gyrodrive. Three sets of these, we need. Essential to workings of airship, they are. But one problem, we have: materials for crafting arrived not."},{"name":"METHULICATTLAN","text":"Have you go there, Methuli would, and prepare grease for use in gyrodrive. Three portions of these, we need. Essential to workings of airship, they are. But one problem, we have: materials for crafting arrived not."},{"name":"METHULICATTLAN","text":"Have you go there, Methuli would, and craft wooden patterns for shaping metal plates for gyrodrive. Three sets of these, we need. Essential to building of airship, they are. But one problem, we have: materials for crafting arrived not."},{"name":"METHULICATTLAN","text":"Intercepted by buzzards of logging grounds, shipment was, and taken to Alder Springs. Retrieve materials from storage pot, you must, then use them to make gyrodrive components at Fallgourd Float."},{"name":"METHULICATTLAN","text":"Taken to Alder Springs, materials were. Retrieve materials from storage pot, you must, then use them to make gyrodrive components at Fallgourd Float."},{"name":"POP","text":"With a cacophony of squawking, the enemy appears!"},{"name":"BALOON","text":"Intruder!"},{"name":"BALOON","text":"Pay for trespass, you will!"},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"METHULICATTLAN","text":"Ah, no-feathers is returned! Good tidings for Methuli, you have? Better yet...good components for gyrodrive?"},{"name":"METHULICATTLAN","text":"Squawk! Outdone yourself, you have! Most excellent parts, these are! One day, from many malms above, laugh at minions of greedy goddess, we will!"},{"name":"METHULICATTLAN","text":"Ixal though you are not, far better than obnoxious buzzards of logging grounds, you are. Count you as <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> of Ehcatl, I do."},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":623,"reputation":24,"items":[{"num":15,"id":6},{"id":21072}]},"reqs":{"beastrank":2,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009212","obj":{"i":1009212,"n":"Methuli Cattlan The Hard","l":57,"q":5}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8056","obj":{"i":8056,"n":"Gyrodrive Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8095","obj":{"i":8095,"n":"Gyrodrive Component","l":1,"c":21005,"t":63}}]}