{"quest":{"name":"A Hard Knock Life","location":"North Shroud","id":67046,"patch":2.35,"sort":52,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009215,"target":1009215,"involved":[1009220],"genre":43,"usedItems":[8073,8113],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Duzal Meyean the Steady seeks a similarly steady-handed Disciple of the Hand to assist his team of crafts...birds in the creation of frangible components.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 15 and above.","Duzal Meyean has asked you to synthesize components for the many oil lamps which will light the <span class=\"emphasis\">Dezul Qualan</span>. Proper equipment to craft the lighting, however, is only found at the Diamond Forge in Revenant's Toll. Speak with forgewife Fyrbryda about receiving permission to utilize the facilities.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Fyrbryda's rules for the forge are simple: one, all materials brought inside must be inspected for contraband, and two, if anyone wishes to make use of the facilities, they must first provide a generous contribution to the Revenant's Toll chapter of the Adventurers' Guild. Currently, the guild is building an orphanage and is in short supply of lumber. Travel west to the Tangle and gather fifteen mangrove branches and five mangrove logs.","You have gathered a sufficient amount of mangrove wood. Return it to Fyrbryda before another orphan passes away of exposure. Also, do not forget to submit the lamp component materials to the forgewife for inspection.","Fyrbryda has granted you access to the Diamond Forge's crafting facilities. Use the materials given to you by Duzal Meyean and inspected by Fyrbryda to synthesize two high-quality lamp components. Once completed, return to Ehcatl with the items.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Specialization</span> wears off or the synthesis ends in failure, you may try again by speaking with Fyrbryda.","You have delivered the lamp components to Duzal Meyean. The veteran believes the light that floods forth from this brilliant beacon will guide the Ehcatl Nine to the legendary home of their ancestors, Ayatlan."],"objectives":["Speak with Fyrbryda in Revenant's Toll.","As a botanist, harvest tangle mangrove branches in the Tangle.","As a botanist, harvest tangle mangrove logs in the Tangle.","Present the lamp component materials and the mangrove wood to Fyrbryda.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize lamp components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the lamp components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Duzal Meyean the Steady</span></span>."],"dialogue":[{"name":"DUZALMEYEAN","text":"Caw! Delicate hands, I seek. Feathered, featherless, I care not. My brethren, I trust, but all talons, they are. Grace, they have not. Perfection, they cannot achieve."},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s lamps, we are. If lamp caps not perfect, enter, rain shall. Escape, flames shall. Disaster, there will be. Caw!"},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s lamps, we are. If lamp oil not perfect, dim, light shall become. Blind, we shall become. Disaster, there will be. Caw!"},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s lamps, we are. If lamp wicks not perfect, dark, lamps shall become. Blind, we shall become. Disaster, there will be. Caw!"},{"name":"DUZALMEYEAN","text":"Feathers, you have not, but privilege, you have. Where spurned, an Ixal is, welcome are the <span class=\"alternative-container\"><span class=\"alternative\">daughters</span><span class=\"alternative\">sons</span></span> of man─welcome to use gifts of art and knowledge. To the Diamond Forge, you must go. To Fyrbryda, you must speak. The gifts of art, she tends. Guide you to perfection, she shall. Caw caw!"},{"name":"DUZALMEYEAN","text":"To the Diamond Forge, you must go. To Fyrbryda, you must speak. Guide you to perfection, she shall. Caw caw!"},{"name":"FYRBRYDA","text":"Times are dire, so I won't waste your time mincing words. My rules here are simple. Follow them, and you are free to use the facilities for as long as you need."},{"name":"FYRBRYDA","text":"Rule one─aught that passes through those doors must be inspected. I will have no contraband within my walls. Period. Rule two─you make a contribution of my choice to the Revenant's Toll chapter of the Adventurers' Guild. No questions asked. No exceptions."},{"name":"FYRBRYDA","text":"If that suits you, journey to the southeastern edge of the Tangle and gather five tangle mangrove logs and fifteen tangle mangrove branches. The wood is to be used to rebuild the hamlet orphanage which we lost in a fire but half a moon past."},{"name":"FYRBRYDA","text":"If it doesn't, you can leave, and have the suffering of countless children on your conscience."},{"name":"FYRBRYDA","text":"Journey to the southeastern edge of the Tangle and gather five tangle mangrove logs and fifteen tangle mangrove branches."},{"name":"FYRBRYDA","text":"Do this, and the facilities are yours to use."},{"name":"FYRBRYDA","text":"Quick with you now, before the cold claims another innocent child's life."},{"name":"FYRBRYDA","text":"Well... A tad worm-eaten, and not as straight as I'd hoped, but this wood will have to suffice. As for your materials...though obviously of questionable origin, I have found naught the guild has deemed forbidden. Proceed, then."},{"name":"FYRBRYDA","text":"If you require more time or materials, do not hesitate to ask, for today I am in your debt. The wood you brought earlier, it will put a roof over the heads of many. I did not mention it before, but I, too, was an orphan, and I know what it is like to spend a night alone and hungry in the cold."},{"name":"FYRBRYDA","text":"I suppose this is farewell. If aught should happen to your work while on the road, do not hesitate to return here for additional materials, for this day I am in your debt. You see, I have just received word that the wood you acquired for the guild...it has helped complete another room in the orphanage. Tonight, a child will sleep without fear, thanks to you."},{"name":"DUZALMEYEAN","text":"Caw! Only perfection, there is─perfection or failure. Which have you claimed today, I wonder?"},{"name":"DUZALMEYEAN","text":"Caw! Caw! Perfection! Guide us, this light will! To sacred Ayatlan, it will! Featherless friend, you are. Hear from me again, you shall! Caw!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to botanist by equipping a hatchet to your main hand."}],"reward":{"gil":760,"reputation":42,"items":[{"id":21072},{"id":21073}]},"reqs":{"beastrank":5,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":18}]}},"partials":[{"type":"npc","id":"1009215","obj":{"i":1009215,"n":"Duzal Meyean The Steady","l":57,"q":6}},{"type":"npc","id":"1009220","obj":{"i":1009220,"n":"Fyrbryda","l":67,"q":7}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"8073","obj":{"i":8073,"n":"Lamp Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8113","obj":{"i":8113,"n":"Lamp Component","l":1,"c":23001,"t":63}}]}