{"quest":{"name":"Crazy Like the Pox","location":"North Shroud","id":67045,"patch":2.35,"sort":51,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009215,"target":1009215,"involved":[1009220],"genre":43,"usedItems":[8072,8112],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Duzal Meyean the Steady seeks a skilled Disciple of the Hand to assist his team of crafts...birds in the creation of intricate components.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 15 and above.","Duzal Meyean has asked you to synthesize components for the system of speaking tubes to be installed on the <span class=\"emphasis\">Dezul Qualan</span>. Proper equipment to craft these items, however, is only found at the Diamond Forge in Revenant's Toll. Speak with forgewife Fyrbryda about receiving permission to utilize the facilities.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Fyrbryda's rules for the forge are simple: one, all materials brought inside must be inspected for contraband, and two, if anyone wishes to make use of the facilities, they must first provide a generous contribution to the Revenant's Toll chapter of the Adventurers' Guild. Currently, the guild is in short supply of tangle skippers─a rare variety of air-breathing fish from which medicine for the pox is brewed. Travel west to the Tangle and catch two skippers using moth pupae.","You have caught two tangle skippers. Return them to Fyrbryda before the heat sees them grow ripe. Also, do not forget to submit the speaking tube component materials to the forgewife for inspection.","Fyrbryda has granted you access to the Diamond Forge's crafting facilities. Use the materials given to you by Duzal Meyean and inspected by Fyrbryda to synthesize a high-quality speaking tube component. Once completed, return to Ehcatl with the item.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Specialization</span> wears off or the synthesis ends in failure, you may try again by speaking with Fyrbryda.","You have delivered the speaking tube component to Duzal Meyean. The veteran is taken aback by the obvious effort put into crafting the complex piece and expresses his desire to work with you once again in the future."],"objectives":["Speak with Fyrbryda in Revenant's Toll.","As a fisher, catch tangle skippers in the Tangle.","Present the speaking tube component materials and the tangle skippers to Fyrbryda.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a speaking tube component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the speaking tube component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Duzal Meyean the Steady</span></span>."],"dialogue":[{"name":"DUZALMEYEAN","text":"Caw! Skilled hands, I seek. Feathered, featherless, I care not. My brethren, I love, but all talons, they are. Grace, they have not. Perfection, they cannot achieve."},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s speaking tubes, we are. If tubes not perfect, warp, voices will. Unheard, orders will be. Lost, lives will be. Caw!"},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s speaking tubes, we are. If tubing not treated, rust in firmament mists, it will. Unheard, orders will be. Lost, lives will be. Caw!"},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s speaking tubes, we are. If tubes not padded, cluttered, voices will become. Unheard, orders will be. Lost, lives will be. Caw!"},{"name":"DUZALMEYEAN","text":"Featherless, you may be, but privileged, you are. Where shunned, an Ixal is, welcome are the <span class=\"alternative-container\"><span class=\"alternative\">daughters</span><span class=\"alternative\">sons</span></span> of man─welcome to use gifts of art and knowledge."},{"name":"DUZALMEYEAN","text":"To the Diamond Forge, you must go. To Fyrbryda, you must speak. The gifts of art, she tends. Guide you to perfection, she shall. Caw caw!"},{"name":"DUZALMEYEAN","text":"To the Diamond Forge, you must go. To Fyrbryda, you must speak. Guide you to perfection, she shall. Caw caw!"},{"name":"FYRBRYDA","text":"You've the look of business about you, so I won't waste your time mincing words. My rules here are simple. Follow them, and you are free to use the facilities for as long as you need."},{"name":"FYRBRYDA","text":"Rule one─aught that passes through those doors must be inspected. I will have no contraband within my walls. Period. Rule two─you make a contribution of my choice to the Revenant's Toll chapter of the Adventurers' Guild. No questions asked. No exceptions."},{"name":"FYRBRYDA","text":"If that suits you, journey to the Tangle and use moth pupae to catch us two tangle skippers. The gall from their bellies is known to stave off the pox, and a recent outbreak has tapped the hamlet's supply."},{"name":"FYRBRYDA","text":"If it doesn't, you can leave, and let the screams of suffering children haunt your nightmares for eternity."},{"name":"FYRBRYDA","text":"Journey to the Tangle and use moth pupae to catch two tangle skippers. Do this, and the facilities are yours to use."},{"name":"FYRBRYDA","text":"Quick with you now, before the pox claims another innocent child's life."},{"name":"FYRBRYDA","text":"Hm... Not as large as I had hoped, but these skippers will have to suffice. As for your materials...though obviously of questionable origin, I have found naught the guild has deemed forbidden. Proceed, then."},{"name":"FYRBRYDA","text":"If you require more time or materials, do not hesitate to ask, for today I am in your debt. I did not mention it before, but the skipper gall you brought today, it will save the lives of many...including my sick niece."},{"name":"FYRBRYDA","text":"I suppose this is farewell. If aught should happen to your work while on the road, do not hesitate to return here for additional materials, for this day I am in your debt. You see, I have just received word that the skipper gall you acquired...it has helped see my niece back from the brink of death."},{"name":"DUZALMEYEAN","text":"Caw! Think me the fool, do my brethren. Expect perfection from featherless one, you cannot, they say. Make me look the fool, you must not, or make you look the corpse, I shall. Caw!"},{"name":"DUZALMEYEAN","text":"Hah! Clumsy buzzard brethren! Quick to look down upon featherless one, you are. Yet behold! Perfect, <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> work is. If into passing my inspection, more care was placed than into passing wind, hands of featherless one, we would not have to borrow! Caw!"},{"name":"DUZALMEYEAN","text":"Friend... Make me look the fool, you did not. Yet a fool would I be, should I not again seek your aid. Hear from me soon, you shall. Until that time, caw!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to fisher by equipping a fishing rod."}],"reward":{"gil":700,"reputation":42,"items":[{"id":21072},{"id":21073}]},"reqs":{"beastrank":5,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":19}]}},"partials":[{"type":"npc","id":"1009215","obj":{"i":1009215,"n":"Duzal Meyean The Steady","l":57,"q":6}},{"type":"npc","id":"1009220","obj":{"i":1009220,"n":"Fyrbryda","l":67,"q":7}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"8072","obj":{"i":8072,"n":"Speaking Tube Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8112","obj":{"i":8112,"n":"Speaking Tube Component","l":1,"c":23001,"t":63}}]}