{"quest":{"name":"The Right Tool for the Tools","location":"North Shroud","id":67044,"patch":2.35,"sort":25,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009212,"target":1009212,"involved":[1006258,1009218],"genre":43,"usedItems":[8060,8099],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>There is work to be done, and Methuli Cattlan thinks you suited to the task.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 3 and above.","Methuli Cattlan has asked you to craft for her two high-quality crafting tool components for the <span class=\"emphasis\">Dezul Qualan</span>. The materials required for this task have already been bought and paid for, and you need only proceed to Finders' Bluff and speak with Ademar to collect them.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have obtained the crafting tool component materials. Present them to Hildeyerd at the Bobbing Cork in order to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize two high-quality crafting tool components, and deliver them to Methuli Cattlan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You deliver the crafting tool components to Methuli Cattlan, who is satisfied with the quality of your work. It would seem she has come to rely upon you as a trusted ally. In due time, by the sweat of your brow, all her comrades will surely come to feel the same."],"objectives":["Speak with Ademar.","Present the crafting tool component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize crafting tool components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the crafting tool components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Methuli Cattlan the Hard</span></span>."],"dialogue":[{"name":"METHULICATTLAN","text":"Squaaawk! Denied, Methuli will not be! Crafting of two crafting tool components─<span class=\"emphasis\">high-quality</span> crafting tool components─for Ehcatl Nine, this task, no-feathers must do!"},{"name":"METHULICATTLAN","text":"Stout hammerheads for hammering, Methuli requests, crafted with the aid of Fallgourd Float's facilities."},{"name":"METHULICATTLAN","text":"Quality lubricants for lubricating, Methuli requests, crafted with the aid of Fallgourd Float's facilities."},{"name":"METHULICATTLAN","text":"Wrapped handles for handling, Methuli requests, crafted with the aid of Fallgourd Float's facilities."},{"name":"METHULICATTLAN","text":"Bought and paid for, the materials have been. In care of Ademar, they are. To him, you must go. Go now!"},{"name":"METHULICATTLAN","text":"Busy, busy, ever so busy! Too busy with crafting, Ehcatl crafters are. Time for replacing tools, we have not. From Ademar, retrieve materials, and craft two high-quality crafting tool components in Fallgourd Float!"},{"name":"ADEMAR","text":"Come to fetch the materials on behalf of the birdmen, are ye? Color me surprised that respectable folk like yerself're keepin' company with that lot."},{"name":"ADEMAR","text":"But I ain't one to judge, no sir. Give Methuli my regards."},{"name":"ADEMAR","text":"We've more than enough to go around, ye know? Why let it go to waste when there's gil to be made?"},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"METHULICATTLAN","text":"Without tools for the tasks, the crafting cannot continue. High-quality components for the tools, no-feathers must quickly bring!"},{"name":"METHULICATTLAN","text":"Ever reliable─I say, ever reliable, no-feathers is! In these components, much faith will be placed, yet disappointed, not once has Methuli been. Reason to doubt, Methuli has none."},{"name":"METHULICATTLAN","text":"Right to trust in you, Chief Totoloc was. Above buzzards, Ehcatl Nine will soon soar!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":563,"reputation":24,"items":[{"num":15,"id":4},{"id":21072}]},"reqs":{"beastrank":2,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009212","obj":{"i":1009212,"n":"Methuli Cattlan The Hard","l":57,"q":5}},{"type":"npc","id":"1006258","obj":{"i":1006258,"n":"Ademar","l":57,"q":4}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8060","obj":{"i":8060,"n":"Crafting Tool Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8099","obj":{"i":8099,"n":"Crafting Tool Component","l":1,"c":21005,"t":63}}]}