{"quest":{"name":"One Ixal's Buzzard","location":"North Shroud","id":67043,"patch":2.35,"sort":24,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009212,"target":1009212,"involved":[1009218,1009634],"genre":43,"usedItems":[8059,8098],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Methuli Cattlan is bristling with anger.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 3 and above.","Methuli Cattlan has asked you to craft for her a high-quality engine casing component for the <span class=\"emphasis\">Dezul Qualan</span>. As is all too often the case, however, you must first acquire the materials before you can proceed. In this instance, the carrier charged with delivering the materials has yet to arrive, and Methuli Cattlan suspects he has lost his way somewhere near the Spriggan Dig. Search for the Ehcatl Nine carrier in the Central Shroud and, with the chat mode in <span class=\"highlight\">Say</span>, enter the password “High as Honor” to identify yourself as a friend.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have obtained the engine casing component materials. Present them to Hildeyerd at the Bobbing Cork in order to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize a high-quality engine casing component, and deliver it to Methuli Cattlan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You deliver the engine casing component to Methuli Cattlan, whose contempt for the carrier has yet to abate. She goes so far as to name you a <span class=\"alternative-container\"><span class=\"alternative\">queen</span><span class=\"alternative\">king</span></span> amongst your kind─flattery doubtless intended to make you more amenable to future requests."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “High as Honor” to let the Ehcatl Nine carrier know you are not an enemy.","Present the engine casing component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an engine casing component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the engine casing component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Methuli Cattlan the Hard</span></span>."],"dialogue":[{"name":"METHULICATTLAN","text":"Begone, no-feathers! Driven mad by incompetent carrier, Methuli is! Squawk!"},{"name":"METHULICATTLAN","text":"Wait...solution to problem, no-feathers could be! Skilled with hands and swift with legs, no-feathers is!"},{"name":"METHULICATTLAN","text":"Craft high-quality component for engine casing, Methuli would ask, but yet to arrive, materials have."},{"name":"METHULICATTLAN","text":"Prepare high-quality rust-resistant agent for engine casing, Methuli would ask, but yet to arrive, materials have."},{"name":"METHULICATTLAN","text":"Craft high-quality leather-bound frame for engine casing, Methuli would ask, but yet to arrive, materials have."},{"name":"METHULICATTLAN","text":"Lost in woods, carrier is─near Spriggan Dig, most like. Many times before this has happened to buzzard. “High as Honor,” to him you must first say. Know you as a friend, only then he will."},{"name":"METHULICATTLAN","text":"Lost near Spriggan Dig, all too often incompetent buzzard becomes. Near there, begin your search. Tell him “High as Honor”─prove yourself friend."},{"name":"IXALGATHERER01597","text":"With you, away! Powerful magicks, I wield! Prepared to defend myself, I am!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter the password “High as Honor” to let the Ehcatl Nine carrier know you are a friend."},{"name":"SYSTEM","text":"High as Honor"},{"name":"IXALGATHERER01507","text":"A friend of Methuli, you are!? Squaaawk! Pursued by bloodthirsty Wailers, I was, but now saved from certain death!"},{"name":"IXALGATHERER01507","text":"Eh? No-feathers <span class=\"emphasis\">and</span> crafter both? Then these materials, you take. Make high-quality engine casing component for Methuli!"},{"name":"IXALGATHERER01507","text":"With permission of Hildeyerd, facilities in Fallgourd, you can use. To Fallgourd, you go and take materials."},{"name":"IXALGATHERER01507","text":"Thankless job, carrier is. So much anger and vitriol if ever any delay. Pluck this, buzzard that..."},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"METHULICATTLAN","text":"Worthless buzzard, you found? Then engine casing component, you crafted?"},{"name":"METHULICATTLAN","text":"No-feathers is <span class=\"alternative-container\"><span class=\"alternative\">queen</span><span class=\"alternative\">king</span></span> among kind, Methuli say! Splendid work which will satisfy our needs, this is!"},{"name":"METHULICATTLAN","text":"Trade ten worthless buzzards for one featherless neuker, Methuli would! With no-feather's help, soar higher than Garuda ever will, Ehcatl Nine shall!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":503,"reputation":24,"items":[{"num":15,"id":3},{"id":21072}]},"reqs":{"beastrank":2,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009212","obj":{"i":1009212,"n":"Methuli Cattlan The Hard","l":57,"q":5}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"npc","id":"1009634","obj":{"i":1009634,"n":"Ehcatl Nine Carrier","l":54,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8059","obj":{"i":8059,"n":"Engine Casing Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8098","obj":{"i":8098,"n":"Engine Casing Component","l":1,"c":21005,"t":63}}]}