{"quest":{"name":"Tanks for Nothing","location":"North Shroud","id":67049,"patch":2.35,"sort":55,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009215,"target":1009215,"involved":[1009220],"genre":43,"usedItems":[8076,8117],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Duzal Meyean the Steady seeks a reliable Disciple of the Hand to assist his team of crafts...birds in the creation of prototype components.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 15 and above, and the battle portion for Disciples of War or Magic level 48 and above.","Duzal Meyean has asked you to synthesize a ceruleum tank component to improve his prototype for the airship <span class=\"emphasis\">Dezul Qualan</span>. Proper equipment to craft these items, however, is only found at the Diamond Forge in Revenant's Toll. Speak with forgewife Fyrbryda about receiving permission to utilize the facilities.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Fyrbryda's rules for the forge are simple: one, all materials brought inside must be inspected for contraband, and two, if anyone wishes to make use of the facilities, they must first provide a generous contribution to the Revenant's Toll chapter of the Adventurers' Guild. Currently, the guild is amassing Garlean fiber to assist Rowena in her development of new armor. Make your way to Castrum Centri and steal a loop of Garlean fiber #43 from the imperial reserves.","You have obtained a loop of Garlean fiber #43. Deliver it to Fyrbryda at the Diamond Forge before another fledgling adventurer perishes for want of better equipment. Also, do not forget to submit the ceruleum tank component materials to the forgewife for inspection.","Fyrbryda has granted you access to the Diamond Forge's crafting facilities. Use the materials given to you by Duzal Meyean and inspected by Fyrbryda to synthesize a high-quality ceruleum tank component. Once completed, return to Ehcatl with the item.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Specialization</span> wears off or the synthesis ends in failure, you may try again by speaking with Fyrbryda.","You have delivered the ceruleum tank component to Duzal Meyean. Intrigued by the differences between your creation and his own, he is confident that your continued contributions will lead to great innovations in Ixali technology."],"objectives":["Speak with Fyrbryda in Revenant's Toll.","Retrieve a loop of Garlean fiber #43 from Castrum Centri.","Present the ceruleum tank component materials and the Garlean fiber to Fyrbryda.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a ceruleum tank component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the ceruleum tank component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Duzal Meyean the Steady</span></span>."],"dialogue":[{"name":"DUZALMEYEAN","text":"Caw! Capable hands, I seek. Feathered, featherless, I care not. My brethren, I love, but all talons, they are. Grace, they have not. Perfection, they cannot achieve."},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s ceruleum tank, we are. Prototype, we have made, but casing is weak like colibri. Improve, Duzal would, with aid of featherless one."},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s ceruleum tank, we are. Prototype, we have made, but rubber lining is lacking like apkallu. Improve, Duzal would, with aid of featherless one."},{"name":"DUZALMEYEAN","text":"Tasked with crafting of <span class=\"emphasis\">Dezul Qualan</span>'s ceruleum tank, we are. Prototype, we have made, but shape is warped like hippogryph. Improve, Duzal would, with aid of featherless one."},{"name":"DUZALMEYEAN","text":"Materials, we have, but proper facilities, we have not. To the Diamond Forge, you must go. Seek Fyrbryda in Revenant's Toll, you must. Though spurned, an Ixal is, welcome to use gifts of art and knowledge, featherless ones are."},{"name":"DUZALMEYEAN","text":"To the Diamond Forge, you must go. To Fyrbryda, you must speak. Guide you to perfection, she shall. Caw caw!"},{"name":"FYRBRYDA","text":"We both have no time to waste, so I will not mince words. My rules here are simple. Follow them, and you are free to use the facilities for as long as you need."},{"name":"FYRBRYDA","text":"Rule one─aught that passes through those doors must be inspected. I will have no contraband within my walls. Period. Rule two─you make a contribution of my choice to the Revenant's Toll chapter of the Adventurers' Guild. No questions asked. No exceptions."},{"name":"FYRBRYDA","text":"If that suits you, journey to Castrum Centri and steal Garlean fiber from their reserves. Rowena requires materials for new armor, that fledgling adventurers may be better prepared to face the dangers lurking beyond our walls."},{"name":"FYRBRYDA","text":"If it doesn't, you can leave, and know that countless greenhorns will perish for want of better equipment."},{"name":"FYRBRYDA","text":"Journey to Castrum Centri and steal Garlean fiber from the reserves there. Do this, and the facilities are yours to use as you see fit."},{"name":"POP","text":"You sense a hostile presence!"},{"name":"BALOON","text":"Intruders!?"},{"name":"FYRBRYDA","text":"Quick now. Rowena is eager to begin her work."},{"name":"FYRBRYDA","text":"Not quite the quantity I was expecting, but I suppose this will have to do. As for your materials...though obviously of questionable origin, I have found naught the guild has deemed forbidden. Proceed, then."},{"name":"FYRBRYDA","text":"If you require more time or materials, do not hesitate to ask, for today I am in your debt. The armor made using this fiber will be donated to the hamlet's defense force. I did not mention it before, but my son is among their ranks, and I will rest easier knowing he is well protected."},{"name":"FYRBRYDA","text":"I suppose this is farewell. If aught should happen to your work while on the road, do not hesitate to return here for additional materials, for this day I am in your debt. You see, my son's unit was attacked while escorting researchers to Saint Coinach's Find. He said he owes his life to his new armor."},{"name":"DUZALMEYEAN","text":"Caw! Growing anxious, Duzal is, for perfectly crafted components of featherless one. Disappoint me, you will not, yes?"},{"name":"DUZALMEYEAN","text":"Many similarities with my own work, there are, and within the differences, great possibilities, Duzal sees. A path to perfection, your work will pave."},{"name":"DUZALMEYEAN","text":"Through the combination of the Ixal's and featherless ones' techniques, many new innovations, we will discover! Surpass even Dezul Qualan, we yet may! Caw!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":700,"reputation":42,"items":[{"id":21072},{"id":21073}]},"reqs":{"beastrank":5,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009215","obj":{"i":1009215,"n":"Duzal Meyean The Steady","l":57,"q":6}},{"type":"npc","id":"1009220","obj":{"i":1009220,"n":"Fyrbryda","l":67,"q":7}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"8076","obj":{"i":8076,"n":"Ceruleum Tank Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8117","obj":{"i":8117,"n":"Ceruleum Tank Component","l":1,"c":23001,"t":63}}]}