{"quest":{"name":"Of Rodents and Rigging","location":"North Shroud","id":67041,"patch":2.35,"sort":22,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009212,"target":1009212,"involved":[1009218],"genre":43,"usedItems":[8057,8096],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Methuli Cattlan the Hard appears hard-pressed to keep her emotions in check.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 3 and above, and the battle portion for Disciples of War or Magic level 43 and above.","Methuli Cattlan has asked you craft for her two high-quality rigging components for the <span class=\"emphasis\">Dezul Qualan</span>. Unfortunately, the materials required in their synthesis have been stolen by the Qiqirn. Make your way to Alder Springs, and retrieve the materials from the storage pot in which they are kept.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have reclaimed the rigging component materials. Present them to Hildeyerd at the Bobbing Cork in order to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize two rigging components, and deliver them to Methuli Cattlan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You deliver the rigging components to Methuli Cattlan, whose joyful caws are slowly starting to grow on you. With your crafting skills and willing aid, the Ehcatl Nine may yet realize the dream for which they strive heart and soul."],"objectives":["Obtain rigging component materials from the snatched storage pot in Alder Springs.","Present the rigging component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize rigging components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the rigging components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Methuli Cattlan the Hard</span></span>."],"dialogue":[{"name":"METHULICATTLAN","text":"Squawwwk! Pluck Methuli dead! Stolen materials for airship rigging, Qiqirn have!"},{"name":"METHULICATTLAN","text":"Essential for connecting air bladder and hull, rigging is. Without it, airship fly without us."},{"name":"METHULICATTLAN","text":"What materials taken? Fibrous metal for making of sturdy cable. Kept in storage pot, it was. After taking pot, flee to Alder Springs, thieving rats did. Go there and retrieve contents, no-feathers must."},{"name":"METHULICATTLAN","text":"What materials taken? Oils for making special grease, used when weaving fibrous metal into cable. Kept in storage pot, they were. After taking pot, flee to Alder Springs, thieving rats did. Go there and retrieve contents, no-feathers must."},{"name":"METHULICATTLAN","text":"What materials taken? Fibrous plants for making special rope, used to bind rigging cables together. Kept in storage pot, they were. After taking pot, flee to Alder Springs, thieving rats did. Go there and retrieve contents, no-feathers must."},{"name":"METHULICATTLAN","text":"With materials, have you make two sets of high-quality rigging components, Methuli would. Go to Fallgourd, you must, and ask permission of Hildeyerd to use crafting facility."},{"name":"METHULICATTLAN","text":"Rigging materials taken by Qiqirn to Alder Springs. Retrieve them from storage pot, you must. With materials, have you make high-quality rigging components at Fallgourd, Methuli would."},{"name":"POP","text":"It's a rat attack!"},{"name":"KIKIROON01505","text":"(-Qiqirn Coddler-)We loot loots fair and square! Give back our loots!"},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"METHULICATTLAN","text":"Retrieved materials, you have, and made components, too? Excellent! Quickly, show them to Methuli, you must!"},{"name":"METHULICATTLAN","text":"Squawk! Such fine work, Methuli rarely sees! Methuli gives compliments more rarely still, but very skillful with hands, no-feathers is!"},{"name":"METHULICATTLAN","text":"Small wonder it is that Chief Totoloc regards you well. With your help, no limit to what Ehcatl Nine can achieve, there is!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":563,"reputation":24,"items":[{"num":15,"id":7},{"id":21072}]},"reqs":{"beastrank":2,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009212","obj":{"i":1009212,"n":"Methuli Cattlan The Hard","l":57,"q":5}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8057","obj":{"i":8057,"n":"Rigging Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8096","obj":{"i":8096,"n":"Rigging Component","l":1,"c":21005,"t":63}}]}