{"quest":{"name":"What Evil Lurks in the Hearts of Golems","location":"North Shroud","id":67042,"patch":2.35,"sort":23,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009212,"target":1009212,"involved":[1009218],"genre":43,"usedItems":[8058,8097],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>An unforeseen delay has given Methuli Cattlan the Hard cause for concern.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 3 and above, and the battle portion for Disciples of War or Magic level 43 and above.","Methuli Cattlan has asked you to craft for her a high-quality deck component for the <span class=\"emphasis\">Dezul Qualan</span>. However, before you can do so, you must obtain the requisite materials from a shale golem, which can be lured out of hiding by slaying clay golems in Alder Springs. If you have difficulty defeating the shale golem, you can use the dissolving agent provided by Methuli Cattlan to weaken it.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have reclaimed the deck component materials. Present them to Hildeyerd at the Bobbing Cork in order to gain access to the crafting facility under her care.","Hildeyerd has prepared the crafting facility for your use. With the materials you have obtained, synthesize a high-quality deck component, and deliver it to Methuli Cattlan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing</span> wears off or the synthesis ends in failure, you may try again by speaking with Hildeyerd.","You deliver the deck component to Methuli Cattlan, who is impressed by your aptitude for both crafting and combat. Indeed, to survive in a land like Eorzea, filled with fearsome fauna, an adventurer is wise to master many skills."],"objectives":["Slay clay golems, use the dissolving agent on the shale golem when it appears, then slay it.","Present the deck component materials to Hildeyerd at Fallgourd Float.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a deck component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the deck component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Methuli Cattlan the Hard</span></span>."],"dialogue":[{"name":"METHULICATTLAN","text":"Urgent need of high-quality deck component, we have! No-feathers can craft, Methuli knows!"},{"name":"METHULICATTLAN","text":"Quality nails for securing planks and plating, crafted from special metal─<span class=\"emphasis\">stolen</span> metal!"},{"name":"METHULICATTLAN","text":"Quality pitch for caulking deck seams, distilled from special materials─<span class=\"emphasis\">stolen</span> materials!"},{"name":"METHULICATTLAN","text":"Quality oakum for caulking deck seams, prepared with special materials─<span class=\"emphasis\">stolen</span> materials!"},{"name":"METHULICATTLAN","text":"...Actually, <span class=\"emphasis\">stolen</span> not most appropriate word. Shale golem in Alder Springs made angry by death of clay golem took them, Methuli is told. As trophy? Who knows. Fathom workings of golem minds, Methuli does not."},{"name":"METHULICATTLAN","text":"Sure to summon shale golem once more, death of clay golems is. Yet ware him, you must! Dangerous if not weakened, shale golem is."},{"name":"METHULICATTLAN","text":"Doused with dissolving agent, he is nothing to fear. Recover materials, I ask, then take to Fallgourd Float for crafting."},{"name":"METHULICATTLAN","text":"Craft high-quality deck component, you cannot, until materials reclaimed. Slay clay golem, then shale golem, you must."},{"name":"POP","text":"Your quarry approaches..."},{"name":"HILDEYERD","text":"Hello again, adventurer! Come to avail yourself of our fine facility, I take it? Let's have a look at the materials you've brought."},{"name":"HILDEYERD","text":"Ooh, yet another curious collection of odds and ends, and a goodly amount besides. So that they don't get in your way while you work, I'll hold on to any excess materials until you need them. The crafting space is ready for your use. You may begin whenever you like."},{"name":"HILDEYERD","text":"Remember, I'm holding on to the excess materials. If the synthesis doesn't go well and you have need of them, you need but ask me."},{"name":"HILDEYERD","text":"Finished crafting, have you? Well, don't keep the client waiting─run along and deliver your handiwork! Now, I doubt that you'd be so clumsy as to misplace your precious creations, but on the off chance that you do, know that I still have the excess materials in my keeping."},{"name":"METHULICATTLAN","text":"Deck component, you have for me?"},{"name":"METHULICATTLAN","text":"Done well, no-feathers has! Much impressed, Methuli is, by no-feather's crafting and combat skills!"},{"name":"METHULICATTLAN","text":"A well-rounded individual, Methuli also aspires to be! When inscrutable golems will try to steal your materials, no one knows!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":503,"reputation":24,"items":[{"num":15,"id":2},{"id":21072}]},"reqs":{"beastrank":2,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009212","obj":{"i":1009212,"n":"Methuli Cattlan The Hard","l":57,"q":5}},{"type":"npc","id":"1009218","obj":{"i":1009218,"n":"Hildeyerd","l":57,"q":13}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8058","obj":{"i":8058,"n":"Deck Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8097","obj":{"i":8097,"n":"Deck Component","l":1,"c":21005,"t":63}}]}