{"quest":{"name":"And Thanks for All the Fish","location":"North Shroud","id":67050,"patch":2.35,"sort":31,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009213,"target":1009213,"involved":[1009219],"genre":43,"usedItems":[8061,8100],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rozol Cattlan the Prudent requests the aid of a skilled Disciple of the Hand.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 6 and above.","Rozol Cattlan the Prudent has asked for your assistance in the crafting of high-quality components for the <span class=\"emphasis\">Dezul Qualan</span>'s cockpit exterior. However, before you can gain access to the facilities necessary for the synthesis, you must first find a way to bribe the young Highwind Skyways representative in charge of overseeing the equipment. Rozol believes you may be able to achieve this with a saint carp─a rare type of fish living in the frigid waters of the Coerthas River to the west of the Observatorium. It is said that saint carp are best caught with moth pupae.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have caught a saint carp. Now hurry the fish to Templeton at the Observatorium while it is still fresh, and convince the corrupt lad to grant you use of the crafting facilities. It may also be wise to allow him to inspect the materials entrusted to you by Rozol, so as not to arouse suspicion amongst his ever-watching superiors.","Templeton is every bit as unscrupulous as advertised, and now you have full access to the Highwind Skyways temporary crafting facilities. Use the materials given to you by Rozol and inspected by Templeton to synthesize two high-quality cockpit exterior components, and deliver the finished products to Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Production II</span> wears off or the synthesis ends in failure, you may try again by speaking with Templeton.","You have delivered the cockpit exterior components to Rozol Cattlan the Prudent and, as much as it pains him to do so, he begins to see why Chief Sezul Totoloc has elected to place his trust in a “featherless neuker.” As for the crooked Skyways representative─it might be best that, for now, his supervisors remain unaware of your mutually beneficial relationship with the young man."],"objectives":["As a fisher, catch a saint carp from the Coerthas River.","Present the cockpit exterior component materials and the saint carp to Templeton at the Observatorium.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize cockpit exterior components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the cockpit exterior components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Rozol Cattlan the Prudent</span></span>."],"dialogue":[{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Featherless one! Sqwak! Our chieftain, speaks highly of you, he does. Sqwak! Trust you, I don't! Yet, trust you, I must! Sqwak!"},{"name":"ROZOLCATTLAN","text":"The <span class=\"emphasis\">Dezul Qualan</span>, a cockpit, she needs─a fine cockpit with a fine exterior and strong wind-shielding! Sqwak! Keeps bugs from beaks, it shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"The <span class=\"emphasis\">Dezul Qualan</span>, a cockpit, she needs─a fine cockpit with a fine exterior and bold colors! Sqwak! Let the Nine's enemies know we come, it shall! Sqwak! Let our ancestors know we fly once again, it shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"The <span class=\"emphasis\">Dezul Qualan</span>, a cockpit, she needs─a fine cockpit with a fine exterior and thick lining of cloth and leather. Sqwak! Keep out the biting cold, it shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Require much care in crafting, do such things. Proper equipment, one must have. Yet proper equipment, have you not. Sqwak! Upon favored Nine, though, does luck smile. Such equipment, close it does lie. At the Observatorium, it does lie, watched over by featherless one such as you. Templeton─a man most corrupt. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Rotten, he is─like fallen apple! Like flyblown corpse! Feed his greed, you must. Sqwak! Feed with saint carp! Sqwak! A moth-craving saint carp from river of Coerthas. Feed his greed, and facilities, yours, they shall be! But remember, first, his game, you must play. Materials, he must inspect. Approval, he must give. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Money, time is! Sqwak! Hurry and feed Templeton's greed, you must. Feed with saint carp! Saint carp from river of Coerthas. Cravers of moths, carp are. Sqwak!"},{"name":"TEMPLETON","text":"Sure, one might say 'tis better to be in here by a warm fire than out in the cold chopping wood with the commonfolk, but what good is a fire, I ask, without, say, a freshly caught carp to roast over its coals?"},{"name":"TEMPLETON","text":"Why, a freshly caught carp to roast over these coals! How very thoughtful of you! The astrologians will be as pleased as punch!"},{"name":"TEMPLETON","text":"What? You believed these tender morsels for myself? Pah! It pains me to learn you think so little of good Templeton, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>. A slice of fat carp on the plates of the right persons, and it won't be long before I'm transferred out of this frozen wasteland to somewhere the sky is blue and the sea bluer."},{"name":"TEMPLETON","text":"Very well, then. Feel free to use the facilities as you see fit. Just try not to damage anything. A lot of unnecessary paperwork that would be. Ah, and I suppose you shall be wanting these materials returned, as well. Hm? Did I inspect them thoroughly? I don't know. Did it <span class=\"emphasis\">appear</span> that I did? Good then! &lt;wink&gt; &lt;wink&gt;"},{"name":"TEMPLETON","text":"If you need aught else, feel free to ask. I'll be right here charring this carp to perfection."},{"name":"TEMPLETON","text":"It appears you've completed that contraption of yours. I shall not ask what it is for if you promise to remove it from here at once. It would be simply tragic if one of my supervisors were to walk in and I had to tell them of how you threatened to bludgeon me with a frozen carp─<span class=\"emphasis\">two</span> frozen carp─if I didn't allow you access to our equipment. &lt;wink&gt; &lt;wink&gt;"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Come, have you, with components sought? Or failed, have you, like featherless neuker you are? Sqwak!"},{"name":"ROZOLCATTLAN","text":"Your work...acceptable, it is. Perhaps more than... Perhaps not. The engineers, pleased they will be. Perhaps... Sqwak..."},{"name":"ROZOLCATTLAN","text":"Bah! Sqwak! Merely one job among many, this was! Sqwak sqwak! Place trust in featherless neuker, I still do not......yet understand why chieftain does...I may...or may not! Sqwak sqwak!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to fisher by equipping a fishing rod."}],"reward":{"gil":628,"reputation":29,"items":[{"num":20,"id":5},{"id":21072}]},"reqs":{"beastrank":3,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":19}]}},"partials":[{"type":"npc","id":"1009213","obj":{"i":1009213,"n":"Rozol Cattlan The Prudent","l":57,"q":5}},{"type":"npc","id":"1009219","obj":{"i":1009219,"n":"Templeton","l":63,"q":6}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8061","obj":{"i":8061,"n":"Cockpit Exterior Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8100","obj":{"i":8100,"n":"Cockpit Exterior Component","l":1,"c":21005,"t":63}}]}