{"quest":{"name":"West for Fishing","location":"North Shroud","id":67056,"patch":2.35,"sort":61,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009216,"target":1009216,"involved":[1009221,1009645],"genre":43,"usedItems":[8078,8120],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A particular school of supply chain management operates exclusively on barters, blackmail, and word of mouth, and Jezul Ahuatan the Second is an enthusiastic adherent of this philosophy.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 16 and above.","Jezul Ahuatan has sweet-talked you into crafting components for escape flyers. But first, you must be the fisher of men─or of one woman, in particular. Catch three snow smelt in the Dragonhead latrines using moth pupae.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The woman you must reel in is known only as the stubborn sutler. The moniker notwithstanding, the three plump snow smelt now in your possession will surely soften her heart and persuade her to yield up the materials you need for your crafting task.","You have taken possession of the escape flyer component materials. Present them to Norbettaux at Camp Dragonhead in order to gain access to the crafting facility under his care.","Norbettaux has prepared the crafting facility for your use. With the materials you have obtained, synthesize a high-quality escape flyer component, and deliver it to Jezul Ahuatan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Specialization II</span> wears off or the synthesis ends in failure, you may try again by speaking with Norbettaux.","Jezul Ahuatan squawks in excitement over the speed and sureness of your crafting. Who would have thought that your experience as a fisher would prove to be of such use in the making of escape flyers?"],"objectives":["As a fisher, catch snow smelt in the Dragonhead latrines.","Deliver the snow smelt to the stubborn sutler in Camp Dragonhead.","Present the escape flyer component materials to Norbettaux in Camp Dragonhead.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an escape flyer component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the escape flyer component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Jezul Ahuatan the Second</span></span>."],"dialogue":[{"name":"JEZULAHUATAN","text":"Squawk! A friend in need, you are interested in being? Component for escape flyers, you will make! Good quality? Best quality! All that hold together the harness, those bits of metal are going to be. Skimp on strength, you will not─or squawkka-wak! An unscheduled jump, you will take!"},{"name":"JEZULAHUATAN","text":"Squawk! A quick gil, you want to earn? Bring some quality emulsion, you can! The silk of the escape flyers, we will dab and soak! Good quality, we must have─or squawkka-wak! Dab and soak featherless one with an emulsion most foul, we will!"},{"name":"JEZULAHUATAN","text":"Squawk! Feathered gratitude, you dream of having? Quality silk, the featherless weave, I know. Bring some tight-woven, you can! Bear, this silk must, the loft of air. If rip-rip-rip it does, then squawkka-wak! Rip-rip-rip a new cloaca for you, we will!"},{"name":"JEZULAHUATAN","text":"A sutler, there is, up Camp Dragonhead way. Materials, she has. Told us of her, that runt, he did─know the one, you do, sqqquawk! Stubborn, the sutler you will find!"},{"name":"JEZULAHUATAN","text":"A trade, she seeks. Three snow smelt, you will fish for her from the Dragonhead latrines. Moth pupae, the smelt will like. Repulsive, the waters are, squawkka-wak! Strange featherless ones. Why not eat the pupae instead, I wonder."},{"name":"JEZULAHUATAN","text":"Squawk! Your goal, you do not forget! Craft quality escape flyer component, you will. To Camp Dragonhead, you go, then sqqquawk! Bring here the component, you must."},{"name":"FISHER01520","text":"What can I do for you? Oh, you're one of Tataramu's friends, are you? Bless His Tininess, he does get around. He told you I wanted some fish for trade, I take it?"},{"name":"FISHER01520","text":"Hmmm, very nice. Fat and sweet-fleshed indeed. Don't look so queasy─'twas some wily fishers that took to calling it our “latrines.” The best fishing hole in these parts now, thanks to most folk keeping away."},{"name":"FISHER01520","text":"Time for me to hold up my end of the bargain─your materials. You can make free use of the crafting facility at Camp Dragonhead. Just have a word with Norbettaux."},{"name":"FISHER01520","text":"Talk to Norbettaux. He'll let you use the crafting facility at Camp Dragonhead."},{"name":"NORBETTAUX","text":"Ah, the one that Master Tataramu vouched for. Welcome to our humble facility! I see that you are not without your aches and sorrows─but there is no ill that crafting cannot cure!"},{"name":"NORBETTAUX","text":"I understand that it is no ordinary item you wish to craft. To tell the truth, I tire of crafters whose ambit of skill can be measured between the thumb and forefinger. You may count on my assistance!"},{"name":"NORBETTAUX","text":"Put this away and pull that forward and...all is in readiness! Here are the materials you need─the excess I will retain for safekeeping. The facility is at your disposal, my good crafter!"},{"name":"NORBETTAUX","text":"If you should lack for material or wish to use the facility again, simply come and find me. Any friend of Master Tataramu is a friend of mine!"},{"name":"NORBETTAUX","text":"I see you're done with the crafting. Ready for delivery, I presume? Not that such a misfortune is common or likely, but if you should mislay the fruits of your labor, this crafting facility─and your excess materials─will always be available for you."},{"name":"JEZULAHUATAN","text":"Sqqquawk! The components, have you? Escape, we will have? Or squawkka-wak, all plunge to earth?"},{"name":"JEZULAHUATAN","text":"Squawk! Best quality! A wise choice, Chief Totoloc did make. If fail, an escape flyer does, then squee-squee, on your account, it is not. Excellent craftsmanship, you have!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to fisher by equipping a fishing rod."}],"reward":{"gil":709,"reputation":50,"items":[{"id":21072},{"num":2,"id":21073},{"id":5687,"one":1},{"id":5697,"one":1},{"id":5707,"one":1}]},"reqs":{"beastrank":6,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":19}]}},"partials":[{"type":"npc","id":"1009216","obj":{"i":1009216,"n":"Jezul Ahuatan The Second","l":57,"q":7}},{"type":"npc","id":"1009221","obj":{"i":1009221,"n":"Norbettaux","l":63,"q":7}},{"type":"npc","id":"1009645","obj":{"i":1009645,"n":"Stubborn Sutler","l":63,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"5687","obj":{"i":5687,"n":"Gatherer's Guerdon Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Gathering","category":2}}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"8078","obj":{"i":8078,"n":"Escape Flyer Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8120","obj":{"i":8120,"n":"Escape Flyer Component","l":1,"c":21003,"t":63}}]}