{"quest":{"name":"Simply the Biast","location":"North Shroud","id":67053,"patch":2.35,"sort":34,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009213,"target":1009213,"involved":[1009219],"genre":43,"usedItems":[8064,8103],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rozol Cattlan the Prudent requests the aid of a Disciple of the Hand, and according to the faction knotcounter, you are the only featherless one he trusts with the task.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 6 and above, and the battle portion for Disciples of War or Magic level 45 and above.","The <span class=\"emphasis\">Dezul Qualan</span>'s instrument panel is a complex piece of machinery─too complex, in fact, for the clumsy claws of even the most skilled Ixali crafter. Impressed with your work on larger items, Rozol Cattlan believes it time to test your hand at tasks which require more precision. The materials he was able to provide you with; however, the bribe for young Templeton you will have to earn on your own. For whatever reason, he requires a biast claw, of all things. Fortunately, the hills to the west of the Observatorium are literally crawling with hungry biasts.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Take the bloody biast claw and the instrument panel component materials to Templeton at the Observatorium.","Templeton is every bit as despicable as advertised, and now you have full access to the Highwind Skyways temporary crafting facilities. Use the materials given to you by the Rozol Cattlan and inspected by Templeton to synthesize a high-quality instrument panel component, and deliver the finished product to the faction.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Production II</span> wears off or the synthesis ends in failure, you may try again by speaking with Templeton.","You have delivered the expertly crafted instrument panel component to Rozol Cattlan the Prudent, leaving him in awe at your skill as well as your willingness to assist his faction, despite the fact you and he are so different. He makes it a point to voice his gratitude to Chief Sezul Totoloc who has made possible this once unthinkable alliance."],"objectives":["Obtain a biast claw from a biast near the Observatorium.","Present the instrument panel component materials and the biast claw to Templeton at the Observatorium.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an instrument panel component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the instrument panel component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Rozol Cattlan the Prudent</span></span>."],"dialogue":[{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Featherless one! Your hands, they are soft. Why you must rely on clumsy weapons, herein lies reason. Ixali claws, superior in battle, do they make us. Yet same claws, in crafting, inferior do they render us."},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, an instrument panel, she needs─a fine panel with fine counters and needles! Sqwak! Keep readings accurate, they shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, an instrument panel, she needs─a fine panel treated with fine oils! Sqwak! Keep cogs whirring, they shall! Keep gears grinding, they shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, an instrument panel, she needs─a fine panel with fine levers and knobs! Sqwak! Keep pilot in control, they shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Require much care in crafting, do such things. Proper equipment, one must have. Yet proper equipment, have you not. Sqwak! In the hands of the wicked, it does lie. At the Observatorium, it does lie, watched over by featherless one such as you. Templeton─a man most malfeasant. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Lusty for coin, he is. Lusty like Ul'dahn! Lusty like beggar! Scratch his lusty itch, you must. Sqwak! Scratch with biast claw! Sqwak! Biast claw from monsters in the west. Scratch his lusty itch, and facilities, yours, they shall be! But remember, first, his game, you must play. Materials, he must inspect. Approval, he must give. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Money, time is, sqwak!"},{"name":"ROZOLCATTLAN","text":"Scratch Templeton's lusty itch, you must. Sqwak! Scratch with biast claw! Sqwak! Biast claw from monsters in the west. Scratch his lusty itch, and facilities, yours, they shall be!"},{"name":"TEMPLETON","text":"Oh, whatever will I do? Without that biast claw, whatever will I do!?"},{"name":"TEMPLETON","text":"Why, if it isn't a biast claw! How apropos! Me minus that appendage would have left me stuck in a pickle without a paddle...or something like that."},{"name":"TEMPLETON","text":"You see, I promised a certain sutler I'd sell him one...before recalling I had little talent at, well, slaying things and such. And hence my dilemma─without that claw, not only would I appear the fool in the eyes of that swiving sutler, but I'd also be forced to use my own coin to purchase that cask of red I'm having delivered later this evening. But lo, my dilemma is solved!"},{"name":"TEMPLETON","text":"Very well, then. You are free to use the facilities here as you see fit. Just try not to damage anything. A lot of unnecessary paperwork that would be. Ah, and I suppose you shall be wanting these materials returned, as well. Hm? Did I inspect them thoroughly? I don't know. Did it <span class=\"emphasis\">appear</span> that I did? Good then! &lt;wink&gt; &lt;wink&gt;"},{"name":"TEMPLETON","text":"If you need aught else, feel free to ask. I'll be right here buffing the biast...claw."},{"name":"TEMPLETON","text":"It appears you've completed that contraption of yours. I shall not ask what it is for if you promise to remove it from here at once. It would be simply tragic if one of my supervisors were to walk in and I had to tell them of how you threatened to pierce mine optics with this deadly claw if I didn't allow you access to our equipment. &lt;wink&gt; &lt;wink&gt;"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! For components I wait. For excuses, I do not! Money, time is! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak! Yet another sound piece, you bring... Yet confounded, I remain. Mistrust the featherless ones, we did. For so long, we did. In our hearts, much hate, do we still harbor. Despite recent relations, do we still harbor. Sqwak..."},{"name":"ROZOLCATTLAN","text":"Yet, still, your hand, you lend. Your judgment, you refuse. Sqwak! To recognize this quality within you, wise was the chieftain. Sqwak! Why, it is that chieftain, he is, and but counter of knots, I remain."},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":568,"reputation":29,"items":[{"num":20,"id":2},{"id":21072}]},"reqs":{"beastrank":3,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009213","obj":{"i":1009213,"n":"Rozol Cattlan The Prudent","l":57,"q":5}},{"type":"npc","id":"1009219","obj":{"i":1009219,"n":"Templeton","l":63,"q":6}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8064","obj":{"i":8064,"n":"Instrument Panel Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8103","obj":{"i":8103,"n":"Instrument Panel Component","l":1,"c":21005,"t":63}}]}