{"quest":{"name":"An Empty Sack Cannot Hang Downright","location":"North Shroud","id":67051,"patch":2.35,"sort":32,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009213,"target":1009213,"involved":[1000776,1009219,1009639],"genre":43,"usedItems":[8062,8101],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rozol Cattlan the Prudent requests the aid of a skilled Disciple of the Hand who is content with keeping <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> head down and most certainly not asking any questions.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 6 and above.","Moderately satisfied with your work on previous <span class=\"emphasis\">Dezul Qualan</span> components, Rozol Cattlan the Prudent wishes you to focus your efforts on crafting parts for the cockpit interior. Materials for these components have already been delivered part of the way to the Observatorium, and you need only collect them from the Ehcatl Nine carrier waiting at Skyfire Locks. Prove you are a friend of the Nine by entering the password “Now Fall” with the chat mode in <span class=\"highlight\">Say</span> where the carrier can hear you. Also, speak with Roiteloin of the Locks and ask if he has any pine lumber scraps (with which to bribe Templeton, of course).<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Present Templeton at the Observatorium with your timely bribe and the <span class=\"emphasis\">Dezul Qualan</span> component materials for inspection.","Templeton is every bit as unprincipled as advertised, and now you have full access to the Highwind Skyways temporary crafting facilities. Use the materials given to you by the Ehcatl Nine carrier and inspected by Templeton to synthesize two high-quality cockpit interior components, and deliver the finished products to the faction.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Production II</span> wears off or the synthesis ends in failure, you may try again by speaking with Templeton.","You have delivered the cockpit interior components to Rozol Cattlan the Prudent and though he attempted to hide it, the knotcounter was visibly pleased. As construction on the <span class=\"emphasis\">Dezul Qualan</span> continues, the Ehcatl Nine are coming to the realization that they may have never made it this far along if it were not for the industriousness of their featherless collaborators."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “Now Fall” to let the Ehcatl Nine carrier know you are not an enemy.","Speak with Roiteloin.","Present the cockpit interior component materials and pine lumber scraps to Templeton at the Observatorium.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize cockpit interior components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the cockpit interior components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Rozol Cattlan the Prudent</span></span>."],"dialogue":[{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, a cockpit, she needs─a fine cockpit with a fine interior held together with fine rivets! Sqwak! Keep cockpit from falling back to forest, they shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, a cockpit, she needs─a fine cockpit with a fine stained interior! Sqwak! Keep cockpit from rotting away in humid climes, it shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, a cockpit, she needs─a fine cockpit with a fine interior and a finer pilot's seat! Sqwak! Covered in fine leather, it should be! Keep pilot's tailfeathers properly cushioned, it shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Materials for components, I have not. Sqwak! Materials for components, flown to Observatorium by a carrier of the Nine, they were. Awaiting you at Locks of Skyfire, he is. Sqwak! But a featherless neuker he will not suffer. Whisper the Nine's sacred words, you must. Whispered once by the very Lady of the Vortex, they were─now fall! Now fall! Now fall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"With materials in hand, components you must craft. Sqwak! Require much care in crafting, do such things. Proper equipment, one must have. Yet proper equipment, have you not. Sqwak! Upon favored Nine, though, does luck smile. Such equipment, close it does lie. At the Observatorium, it does lie, watched over by a featherless neuker such as you. Templeton─a man most corrupt. A man most ruthless. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Cold, his blood is─like ice! Feed the fire of his greed, you must. Sqwak! Feed with pine lumber! Sqwak! Scraps from Lodge of Timberlord. Scraps from Roiteloin. Feed the fire his of greed, and facilities, yours, they shall be! Sqwak sqwak! But remember, his game, you must play. Materials, he must inspect. Approval, he must give. Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Money, time is! Sqwak! Hurry and collect materials, you must─from Ehcatl Nine carrier! Forget not words to whisper! Now fall! Now fall! Now fall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Then, hurry and feed the fire of Templeton's greed, you must! Feed with scraps of pine lumber! Sqwak! Scraps from Lodge of Timberlord. Scraps from Roiteloin. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Feed the fire his of greed, and facilities, yours they shall be! Sqwak sqwak! But remember, his game, you must play. Materials, he must inspect. Approval, he must give. Sqwak!"},{"name":"IXALGATHERER01515","text":"Sqwerk!? Speak with neukers, I must not. Wait for sacred words, I shall. Sqwerk!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter the password “Now Fall” to let the Ehcatl Nine carrier know you are a friend."},{"name":"SYSTEM","text":"Now Fall"},{"name":"IXALGATHERER01515","text":"A featherless neuker, the knotcounter sent!? Desperate times, these are, even for mighty Nine! Sqwerk!"},{"name":"IXALGATHERER01515","text":"Listen now, sqwerk! Goods from homeland, I carry. Over mountains high and chasms deep, have these items come! For you, they have come! Use them well, you will, or your throat, I shall slit and your blood, I shall sip. Sqwerk!"},{"name":"IXALGATHERER01515","text":"Over mountains high and chasms deep, have those items come! For you, they have come! Use them well, you will, or your throat, I shall slit and your blood, I shall sip. Sqwerk! Sqwerk!"},{"name":"ROITELOIN","text":"Might you have come for the wood scraps? Master Tataramu said someone would be along, but I never expected it would be so soon."},{"name":"ROITELOIN","text":"The days have become a blur as of late, for the longer I tend to the growing of trees, the less significant mere days, weeks, even moons have become. Prithee tell Master Tataramu that I appreciate his generous donations to the replanting efforts, and that I anticipate his next visit, whenever that may be."},{"name":"ROITELOIN","text":"Leaving so soon? Might you reconsider? I get so very few visitors here at the Timberlord's Lodge. It is difficult to even remember the last time I spoke with someone other than my good friends the owls."},{"name":"TEMPLETON","text":"So cold...so cold...so bloody godsdamned COLD! Oh, I apologize for that unsightly outburst. It is just that it is so gods. Damned. Bloody. COLD! Oh, there I go again. Perhaps it is this nasty temper that has condemned me to a life of frozen privies and a shriveled sack."},{"name":"TEMPLETON","text":"Why, if this isn't a neatly tied bundle of lumber scraps! And just as I was beginning to feel the old sack tighten another notch!"},{"name":"TEMPLETON","text":"The Skyways cannot expect a man to risk life and limb guarding priceless crafting materials with his stones drawn up all the way into his belly, now, can they? Your selfless generosity has ensured the safety of the facilities for another turn of the sun...or at least until the lumber scraps are gone."},{"name":"TEMPLETON","text":"Very well, then. Feel free to use the facilities as you see fit. Just try not to damage anything. A lot of unnecessary paperwork that would be. Ah, and I suppose you shall be wanting these materials returned, as well. Hm? Did I inspect them thoroughly? I don't know. Did it <span class=\"emphasis\">appear</span> that I did? Good then! &lt;wink&gt; &lt;wink&gt;"},{"name":"TEMPLETON","text":"If you need aught else, feel free to ask. I'll be right here coaxing my stones from their place of hiding."},{"name":"TEMPLETON","text":"It appears you've completed that contraption of yours. I shall not ask what it is for if you promise to remove it from here at once. It would be simply tragic if one of my supervisors were to walk in and I had to tell them of how you threatened to set the facilities ablaze if I didn't allow you access to our equipment. &lt;wink&gt; &lt;wink&gt;"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Come, have you, with cockpit components sought? Or failed, have you, as I suspected? Sqwak!"},{"name":"ROZOLCATTLAN","text":"Your work, amazing it i─ Ah... Sqwak! Erk... Ah, amazing...ly acceptable, it is! Yes. Sqwak... Sqwak!"},{"name":"ROZOLCATTLAN","text":"Pains me, it does, to reach for hand of featherless ones. Sqwak! But perhaps this pride...that which held back my kin for so long, it is. Perhaps over is the time to dwell on past. A simple dilemma, it is not. A simple answer, I shall not find. And so place full trust in you, I still cannot. Some trust in you...perhaps... Perhaps not... Sqwak!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":628,"reputation":29,"items":[{"num":20,"id":6},{"id":21072}]},"reqs":{"beastrank":3,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009213","obj":{"i":1009213,"n":"Rozol Cattlan The Prudent","l":57,"q":5}},{"type":"npc","id":"1000776","obj":{"i":1000776,"n":"Roiteloin","l":63,"q":4}},{"type":"npc","id":"1009219","obj":{"i":1009219,"n":"Templeton","l":63,"q":6}},{"type":"npc","id":"1009639","obj":{"i":1009639,"n":"Ehcatl Nine Carrier","l":63,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8062","obj":{"i":8062,"n":"Cockpit Interior Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8101","obj":{"i":8101,"n":"Cockpit Interior Component","l":1,"c":21005,"t":63}}]}