{"quest":{"name":"Your Gil's No Good Here","location":"North Shroud","id":67057,"patch":2.35,"sort":62,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009216,"target":1009216,"involved":[1009221,1009646],"genre":43,"usedItems":[8079,8121],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Jezul Ahuatan the Second knows that where the monetary system holds no sway, barter must come into greater play.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 16 and above.","Jezul Ahuatan has bamboozled you into crafting spare tank components. But first, you must reap what you have─or rather, some other botanist has─sown. The forests around Camp Dragonhead are rich in quality timber; harvest fifteen ruby spruce branches and five ruby spruce logs.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Your arms are sticky with sap, and sawdust powders your hair. Ah, to be a lumberjack and work all day! The smell of fresh-cut spruce will surely lift the spirit of even the one they call the sullen sutler.","You have acquired a set of spare tank component materials. Present them to Norbettaux at Camp Dragonhead in order to gain access to the crafting facility under his care.","Norbettaux has prepared the crafting facility for your use. With the materials you have obtained, synthesize two high-quality components for a spare ceruleum tank, and deliver them to Jezul Ahuatan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Specialization II</span> wears off or the synthesis ends in failure, you may try again by speaking with Norbettaux.","Jezul Ahuatan is excessively enthused about your bout of gathering and crafting, which has been rather heavier on industry than inspiration. Your ability to complete even the most tedious of tasks is apparently a gift. Cherish it."],"objectives":["As a botanist, harvest ruby spruce branches near Camp Dragonhead.","As a botanist, harvest ruby spruce logs near Camp Dragonhead.","Deliver the ruby spruce wood to the sullen sutler at Camp Dragonhead.","Present the spare tank component materials to Norbettaux at Camp Dragonhead.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize spare tank components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the spare tank components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Jezul Ahuatan the Second</span></span>."],"dialogue":[{"name":"JEZULAHUATAN","text":"Squawk! Quality spare tank components, you can make? Solid metal and durable, they must be. No holding of cider, this is for, but─sqqquawk─spare ceruleum."},{"name":"JEZULAHUATAN","text":"Squawk! Time to prepare components, you have? Gasket sealant, required for the spare ceruleum tanks, for us you can make. No pressing reason, we have─but a gasket in claw, better than two on order is!"},{"name":"JEZULAHUATAN","text":"Squawk! A helping claw, you will extend? Short of sturdy barrels for ceruleum, we are. Arrived, they did, from a cut-rate cooper and...squawkka-wak! Get, you do, what you pay for!"},{"name":"JEZULAHUATAN","text":"An understanding, we have, with a sutler at Camp Dragonhead. The materials, provide them, he can. Trade for them─only trade, he will. Like him, I do, for one so featherless. Somber as a raven, he is. Trust for gil, he has not."},{"name":"JEZULAHUATAN","text":"Hiss at me, he did; fierce as goose, he was. “Gil is naught but a <span class=\"emphasis\">construct</span>,” said he. Full of quarrel, you featherless ones are. Fifteen ruby spruce branches and five logs of the same, this sutler wants. Gather them with ease, you can, up Camp Dragonhead way."},{"name":"JEZULAHUATAN","text":"Point to the crafting facility and no more, he will. Squee-squee, dance to tune played by the small and sly one, the sullen sutler will not!"},{"name":"JEZULAHUATAN","text":"Sqqquawk! Those tank components sooner rather than later, I do want. Expect your delivery, I do. Bite my claws, I shall."},{"name":"PLANTMERCHANT01520","text":"Brrr... Even the weather's conspiring to put me out of business. That's right, just freeze your arse off till you've nothing to even sit on. That's the way of it with gods an' heroes. Leave a working man without an arse to call his own."},{"name":"PLANTMERCHANT01520","text":"One of Tataramu's pals? Hmph. Here's your material, over there's where you'll find Norbettaux. The crafting facility's his business, so don't bother me about it."},{"name":"PLANTMERCHANT01520","text":"What's the matter, the cold take your wits? Off with you─the crafting facility's not <span class=\"emphasis\">my</span> watch."},{"name":"NORBETTAUX","text":"Ah, the one that Master Tataramu spoke of. Welcome to our humble facility! I see that you've spent some time in the woods today─but the real work begins now!"},{"name":"NORBETTAUX","text":"Ah, this is your material? Let me weigh out what you need...ample, ample. A dyspeptic he may be, but that sutler is scrupulous down to the last onze. Now then, the facility is at your disposal, my canny crafter!"},{"name":"NORBETTAUX","text":"I shall store the excess material for your benefit. You need but come and find me if you run short, or wish to use the facility again."},{"name":"NORBETTAUX","text":"Done with the crafting and ready to deliver, if I'm not mistaken. I need hardly remind you of such a trivial fact, but this crafting facility─and your excess materials─will always be available should you feel an unaccountable need to redo this task. Any friend of Master Tataramu is a friend of mine!"},{"name":"JEZULAHUATAN","text":"Squawk, my components, you have? Build the spare tanks this turn, we can?"},{"name":"JEZULAHUATAN","text":"Squee-squee, fast delivery, this is─and great work, it is! Praise you as <span class=\"emphasis\">claw that grips</span>, Chief Totoloc would. No harrying, you need. No cheating, you do. Squawk! Fortunate, I am, to have your service."},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"To complete this quest, you will need to change your class to botanist by equipping a hatchet to your main hand."}],"reward":{"gil":769,"reputation":50,"items":[{"id":21072},{"num":2,"id":21073},{"id":5697,"one":1},{"id":5692,"one":1},{"id":5712,"one":1}]},"reqs":{"beastrank":6,"jobs":[{"lvl":1,"id":33},{"lvl":1,"id":18}]}},"partials":[{"type":"npc","id":"1009216","obj":{"i":1009216,"n":"Jezul Ahuatan The Second","l":57,"q":7}},{"type":"npc","id":"1009221","obj":{"i":1009221,"n":"Norbettaux","l":63,"q":7}},{"type":"npc","id":"1009646","obj":{"i":1009646,"n":"Sullen Sutler","l":63,"q":1}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"item","id":"5692","obj":{"i":5692,"n":"Gatherer's Guile Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Perception","category":2}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"8079","obj":{"i":8079,"n":"Spare Tank Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8121","obj":{"i":8121,"n":"Spare Tank Component","l":1,"c":21003,"t":63}}]}