{"quest":{"name":"Hot Cross Buns","location":"North Shroud","id":67052,"patch":2.35,"sort":33,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009213,"target":1009213,"involved":[1006385,1009219],"genre":43,"usedItems":[8063,8102],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rozol Cattlan the Prudent requests the aid of a skilled Disciple of the Hand in tackling a particularly sticky wicket.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 6 and above, and the battle portion for Disciples of War or Magic level 45 and above.","Content with your work on previous dirigible components, Rozol Cattlan the Prudent has asked for your assistance in the crafting of a high-quality component for the <span class=\"emphasis\">Dezul Qualan</span>'s ballast. The materials for the task can be acquired from an independent sutler named Duvicauroix who is known to peddle his wares in and around the Observatorium. Also, you will need to procure a bribe for the finicky Templeton. Rozol has provided you with a shearing knife with which you are to remove the beard of one of the feral crocs lurking about Skyfire Locks.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Take the freshly sheared feral croc beard to Templeton at the Observatorium and present it and the ballast component materials for inspection.","Templeton is every bit as dishonorable as advertised, and now you have full access to the Highwind Skyways temporary crafting facilities. Use the materials given to you by the Duvicauroix and inspected by Templeton to synthesize a high-quality ballast component, and deliver the finished product to the faction.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Production II</span> wears off or the synthesis ends in failure, you may try again by speaking with Templeton.","You have delivered the ballast component to Rozol Cattlan the Prudent. After this success, the Ixal seems to have given up his feeble attempts to hide his amazement at your work. As for Templeton, the lad seems overly bold in his demands, causing you to worry how much longer this mummer's farce can continue before someone of standing within the Highwind Skyways hierarchy learns of their representative's misdeeds and reassigns him to someplace darker and colder than even Coerthas."],"objectives":["Speak with Duvicauroix at the Observatorium.","Use the shearing knife to cut a beard from a feral croc in Skyfire Locks.","Present the ballast component materials and the feral croc beard to Templeton at the Observatorium.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a ballast component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the ballast component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Rozol Cattlan the Prudent</span></span>."],"dialogue":[{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, ballast, she needs─fine ballast to see her back to land. Fine ballast to see her back to sea! Fine ballast held fast by fine braces of iron! Sqwak! Keep ballast from falling down and airship falling up, they shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, ballast, she needs─fine ballast to see her back to land. Fine ballast to see her back to sea! Fine ballast filled with spirits of wine! Sqwak! Keep ballast from turning to ice, it shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! The <span class=\"emphasis\">Dezul Qualan</span>, ballast, she needs─fine ballast to see her back to land. Fine ballast to see her back to sea! Fine ballast held in bladders of cloth and leather! Sqwak! Keep ballast from seeping through hull, they shall! Sqwak!"},{"name":"ROZOLCATTLAN","text":"Materials for components, I have not. Sqwak! Materials for components, purchased by tiny Tataramu, they were. From a featherless peddler at the Observatorium, they were. Awaiting your arrival, peddling neuker is. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Once in hand, craft components, you must. Sqwak! Require much care in crafting, do such things. Proper equipment, one must have. Yet proper equipment, have you not. Sqwak! Such equipment, though, close it does lie. At the Observatorium, it does lie, watched over by a featherless one such as you. Templeton─a man most corrupt. Yet a man most bumbling. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Too exposed, his wrongdoings are! Help hide his trickery, you must. Help cover his featherless arse, you must. Sqwak! Cover with beard of croc! Sqwak! Beard of Skyfire croc. With shearing knife, yours it shall be! Sqwak! Cover his arse, and facilities, yours, they shall be! Fail, and gone, they shall be. Sqwak sqwak! Materials, he must inspect. Approval, he must give. Appearances, we must keep. Sqwak!"},{"name":"ROZOLCATTLAN","text":"Materials for components, I have not. Sqwak! Materials for components, purchased by tiny Tataramu, they were. From a featherless peddler at the Observatorium, they were. Awaiting your arrival, peddling neuker is. Sqwak sqwak!"},{"name":"ROZOLCATTLAN","text":"Bribe for bumbling neuker, I have not. Knife for shearing croc beards, I have. Shear a croc beard, you must. Bring to neuker, you must. Cover his arse, and facilities, yours they shall be! Fail, and gone, they shall be. Sqwak sqwak!"},{"name":"DUVICAUROIX","text":"Here to toss the snow with a winter–drunk sutler? Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>, but I haven't the time for fun today. I'm waiting on a swivin' little rotter who was supposed to be here hells' bells ago to take on a package of questionable questionables."},{"name":"DUVICAUROIX","text":"Oh, <span class=\"emphasis\">you're</span> the swivin' little rotter. Well, then, pardon the lack of a proper greeting, but I'm not holding on to this pile of bird shite any longer. Take it away quick afore I call the knights over and have you arrested for possession of unholy idols. And tell that Tataramu he can shove any future deliveries straight up his windward passage."},{"name":"DUVICAUROIX","text":"I am not one to deny a man my services for such reasons as race or creed...but an Ixal is no <span class=\"emphasis\">man</span>, so I have no qualms with turning my red nose to those filthy flying rats, even if doing so'll see my pathetic purse lighter than it already is."},{"name":"TEMPLETON","text":"Do you ever wonder why I'm always standing? It's because everything in this frozen hell is colder than a heretic's heart, that's why! Anywhere I sit, I'm likely to freeze my royal arse right off, and I've grown quite attached to Her Rosy Highness as of late."},{"name":"TEMPLETON","text":"Why, how convenient! A feral croc beard! Did you know these whiskers can be woven into a cloth that will protect the buttocks from cold? I suppose it could protect other parts of one's person from cold, as well, but an arse can be especially susceptible to wintry climes."},{"name":"TEMPLETON","text":"Very well, then. You are free to use the facilities here as you see fit. Just try not to damage anything. A lot of unnecessary paperwork that would be. Ah, and I suppose you shall be wanting these materials returned, as well. Hm? Did I inspect them thoroughly? I don't know. Did it <span class=\"emphasis\">appear</span> that I did? Good then! &lt;wink&gt; &lt;wink&gt;"},{"name":"TEMPLETON","text":"If you need aught else, feel free to ask. I'll be right here readying Her Royal Rumpness to conquer every single icy stone from here to Snowcloak."},{"name":"TEMPLETON","text":"It appears you've completed that contraption of yours. I shall not ask what it is for if you promise to remove it from here at once. It would be simply tragic if one of my supervisors were to walk in and I had to tell them of how you threatened to smother me with a musky croc beard if I didn't allow you access to our equipment. &lt;wink&gt; &lt;wink&gt;"},{"name":"ROZOLCATTLAN","text":"Sqwak sqwak! Waited overlong, I have. Ballast component or disappointment, do you bring? Sqwak!"},{"name":"ROZOLCATTLAN","text":"The component! Sqwak! And of a quality, it is! Cease to amaze, you do not, featherless one. Therefore, cease to request aid, we shall not. Sqwa qwa qwa qwa! An Ixali joke, that was. Free to laugh, you are. Go on. Go on! Sqwak!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":568,"reputation":29,"items":[{"num":20,"id":7},{"id":21072}]},"reqs":{"beastrank":3,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009213","obj":{"i":1009213,"n":"Rozol Cattlan The Prudent","l":57,"q":5}},{"type":"npc","id":"1006385","obj":{"i":1006385,"n":"Duvicauroix","l":63,"q":4}},{"type":"npc","id":"1009219","obj":{"i":1009219,"n":"Templeton","l":63,"q":6}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"8063","obj":{"i":8063,"n":"Ballast Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8102","obj":{"i":8102,"n":"Ballast Component","l":1,"c":21005,"t":63}}]}