{"quest":{"name":"Like Civilized Men and Women (Maelstrom)","location":"Limsa Lominsa","id":67064,"patch":2.3,"sort":300,"icon":112064,"unlocksFunction":1,"eventIcon":71341,"issuer":1003550,"target":1009236,"genre":190,"journal":["Lieutenant Trachraet is looking for a few good soldiers.","The member nations of the Eorzean Alliance do not see eye to eye in all matters. Nevertheless, their disagreements have not been irreconcilable─until now. Control of the Carteneau Flats is to be decided on the field of battle, and Lieutenant Trachraet would have you fight for the Maelstrom. Speak with the Foreign Levy flyer to learn more of this new conflict, and to decide if you wish to become involved.","<span class=\"emphasis\">Civilized</span> violence. <span class=\"emphasis\">Civilized</span> war. The concept seems contradictory, if not ludicrous, yet your fellow soldiers take no issue with this proposed resolution. It is clear now that the Maelstrom will not be swayed from its course. You, however, are yet free to decide. To embrace this cause, or to renounce it─it is your choice."],"objectives":["Speak with the Foreign Levy flyer at the airship landing."],"dialogue":[{"name":"TRACHRAET","text":"Yer familiar with what transpired at Carteneau five years ago, ain't ye, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>?"},{"name":"TRACHRAET","text":"I don't mean the godsdamned moon crackin' open an' that thrice-damned primal rainin' 'ellfire upon us all. Even folk in the Far East 'eard that tale, I reckon."},{"name":"TRACHRAET","text":"What I'm wonderin' is 'ow knowledgeable ye are with regards to the aftermath, when the Eorzean Alliance saw fit to settle in an' jointly administer the region for the foreseeable future."},{"name":"TRACHRAET","text":"Waste o' time, money, an' men, most say, what with nothin' o' value in the Carteneau Flats, eh? That's the story to which most folk've been privy─the truth, o' course, bein' a fair bit different."},{"name":"TRACHRAET","text":"In case ye ain't yet in the know, the primal's rampage laid bare these Allagan ruins, which no one 'ad even the slightest inklin' existed prior to the Calamity. It didn't take a bleedin' genius to recognize that we'd found somethin' important, an' that we'd be fools to let it fall into the wrong 'ands."},{"name":"TRACHRAET","text":"The powers that be declared that we'd protect an' study the ruins together, an' so we did─until now. Limsa Lominsa, Ul'dah, an' Gridania 'ave all formally asserted a claim to the territory. The time for talk 'as passed; the time for action 'as come."},{"name":"TRACHRAET","text":"That bein' said, we'd be a sorry excuse for an alliance if we let this one issue divide us. So while there'll be fightin', it'll be in accordance with the rules. All 'ostilities shall be confined to the disputed territories, an' engagements shall be fought to submission, not death."},{"name":"TRACHRAET","text":"Remember that when yer on the front line, [GC Rank][GC Rank][GC Rank]─beat a man within an ilm of 'is life if ye must, but see that it goes no further."},{"name":"TRACHRAET","text":"Ye'll be joinin' the fight, won't ye? A soldier with your talents would make a tremendous difference! What's more, ye'd be doin' the nation a great service."},{"name":"TRACHRAET","text":"At least speak with our man at the airship landin' before ye decide one way or the other. Think on it, [GC Rank][GC Rank][GC Rank]. That's all I ask."},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! Come to join the fight, have we? Very good, very good indeed!"},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"Now before we proceed, I must warn you: this isn't going to be like some jaunt in the Wolves' Den."},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"You'll be pitted against wave after wave of fellow Alliance members in battle, and they won't care one whit that you're the Warrior of Light."},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"This campaign will be long and brutal, and victories won today may be undone tomorrow. Consider the borderland ruins. We need only seize control of each ruin in the region, right? Wrong. Defense is paramount as well, for our rivals will muster forces to challenge our claims."},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"It is for that reason we have established an airship route direct to the front line. Those who are ready and willing to fight will never want for transportation!"},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"Ah, but that look on your face bespeaks confusion. “Are we at war or not? What is this bollocks about no killing? What in the seven hells is going on!?” That's what you're thinking, yes?"},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"It's less “war” and more “organized violence to resolve a territorial dispute.” And yes, it is to be <span class=\"emphasis\">civilized</span> violence. Killing Alliance members is strictly prohibited─though accidents have been known to happen, mind you."},{"name":"TOKUSHURIKUSENNTAIHIKUUHEI","text":"But you of all people have nothing to fear! You've escaped certain death more times than I can count; what are the odds you'll fail to do so this time, eh?"}],"reward":{"gil":367,"instance":50001,"xp":0},"reqs":{"jobs":[{"lvl":30,"id":34}],"gc":1,"questsType":"any","quests":[66641,66642]}},"partials":[{"type":"npc","id":"1003550","obj":{"i":1003550,"n":"Trachraet","l":28,"q":8,"t":"Storm Lieutenant"}},{"type":"npc","id":"1009236","obj":{"i":1009236,"n":"Foreign Levy Flyer","l":28,"q":1,"t":"Frontline Attendant"}},{"type":"instance","id":"50001","obj":{"i":50001,"n":"The Borderland Ruins (Secure)","c":61806,"t":"PvP","min_lvl":30}},{"type":"quest","id":"66641","obj":{"i":66641,"n":"A Pup No Longer (Twin Adder)","g":191,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66642","obj":{"i":66642,"n":"A Pup No Longer (Immortal Flames)","g":192,"l":"Ul'dah","s":300,"f":1}}]}