{"quest":{"name":"Stroking the Haft","location":"Limsa Lominsa","id":67069,"patch":2.3,"sort":7,"icon":100294,"eventIcon":71221,"issuer":1009153,"target":1009369,"involved":[1009271,1009272,1009273,1009274,1009275,1009276,1009277],"genre":77,"journal":["The deputy postmoogle has a parcel intended for a renowned personage currently visiting in Ul'dah.","The deputy postmoogle entrusts you with a package from the sylphs of Little Solace addressed to “the long one,” Hunberct Longhaft, temporarily on leave from his duties to acquire goods in Ul'dah. Seek out the Brass Blade captain at the Weavers' Guild.","Hunberct Longhaft explains that the parcel contains an ample supply of sylph-woven silk, a fabric which─if you are understanding his analogy correctly─he insists would somehow allow his fighting unit room to grow and reach its full potential. That said, he would hear the opinions of his loyal followers before placing his final order. Seek out E'tajha Sapphire–eyes and E'lahmui Ruby–eyes, who have accompanied their captain to Ul'dah.","You find Hunberct's loyal followers scouring the guilds, looking for gifts intended to earn their captain's favor. From what you can gather, the Miqo'te hope that such trinkets will nudge Hunberct toward honoring them with the privilege of operating some lever at Highbridge...though why they covet this seemingly mundane duty is not immediately clear. Return to the Weavers' Guild and inform Hunberct that his subordinates are on their way.","Upon your approach to the Weavers' Guild, you spy E'tajha and E'lahmui arguing about whose gift is more suitable for Hunberct. The dispute ends with each accusing the other of not being worthy of polishing the captain's blade─a clear exaggeration, as both are soldiers who are doubtless capable of performing menial weapon maintenance tasks. With tempers running high, make haste into the guild and seek out the captain before the situation can get out of hand.","You return to the captain, who is quick to assure his two followers─sisters, in fact─that he is fond of all under his command. After putting on a display of the garments he had commissioned from the guild─a display which pleases the girls greatly─he orders them to prepare for the journey back to Highbridge. After the sisters depart, he proceeds to reveal their past, beginning from when the Brass Blades freed the two from slavery as young girls. Years later, having reached womanhood and hearing many tales about the Longhaft's unit, they sought him out and offered their services. Moved by this touching tale of pure love and devotion, you resolve to lend your strength to Hunberct and his regiment should you come upon them at Highbridge."],"objectives":["Deliver the parcel to Hunberct at the Weavers' Guild.","Speak with E'tajha Sapphire–eyes in Ul'dah.","Speak with E'lahmui Ruby–eyes in Ul'dah.","Return to the Weavers' Guild.","Speak with Hunberct at the Weavers' Guild."],"dialogue":[{"name":"LETTERMOOGLE","text":"Ah, my trusted assistant is ever ready for action, kupo! Very well─I have a package here straight from Little Solace addressed to...er...“the long one.”"},{"name":"LETTERMOOGLE","text":"Moogle intelligence has confirmed that this is a sylphic epithet for one Hunberct Longhaft, a Brass Blade captain of considerable repute who leads the defense at Highbridge."},{"name":"LETTERMOOGLE","text":"Hunberct is known to be one of the most charismatic leaders in the realm, never seen outside the company of one or more of his men. Rather, I should say <span class=\"emphasis\">women</span>─his followers are uniformly female, and fiercely loyal to their captain."},{"name":"LETTERMOOGLE","text":"I was in Highbridge a short while ago, but the captain was unfortunately off duty. It would appear he had business at the Weavers' Guild, and had taken two of his most loyal subordinates along with him to Ul'dah. Many happy deliveries, kupo!"},{"name":"LETTERMOOGLE","text":"They say that the Longhaft is a swordsman of peerless skill, and cuts a dashing figure to boot. Small wonder that he has so many admirers, yes?"},{"name":"LETTERMOOGLE","text":"I was in Highbridge a short while ago, but the captain was unfortunately off duty. It would appear he had business at the Weavers' Guild, and had taken two of his most loyal subordinates along with him to Ul'dah. Many happy deliveries, kupo!"},{"name":"HUNBERCT","text":"How many times must I tell you? Garments such as these might be fit for an ordinary man, but Hunberct Longhaft is no ordinary man! Hells, what is keeping my package!?"},{"name":"HUNBERCT","text":"My silk, at last! Ah, now <span class=\"emphasis\">this</span> is more like it! Feel for yourself─so soft and pliant, a fabric that truly <span class=\"emphasis\">breathes</span>. This is of sylph make, you see. A merchant I met in Highbridge sang its praises, and I simply had to experience it for myself."},{"name":"HUNBERCT","text":"Your puzzled expression does not escape me. “But, Longhaft,” you protest. “Many a tale have I heard of your blade, and the consummate skill with which you wield it. What use would a virile swordsman such as yourself have with such delicate─even <span class=\"emphasis\">feminine</span>─fabric?”"},{"name":"HUNBERCT","text":"An astute question, which I answer with a question of my own. You strike me as one who knows your way around the battlefield, yes? Suppose you are the commander of a formidable unit─one akin to a great machine."},{"name":"HUNBERCT","text":"Now suppose this same unit was somehow...constrained─forced to do battle in cramped quarters. Would your unit be able to realize its full potential in such unfavorable conditions?"},{"name":"HUNBERCT","text":"Verily not! Only when given room to breathe will the puissant unit swell and expand over the battlefield, and then─upon reaching the full extent of its power─thrust forth and penetrate your opponent's defenses. Do you grasp my meaning?"},{"name":"HUNBERCT","text":"And so I would commission a garment to be made from this silk. And yet, my unit is not merely my own. No, the skilled hands under my command see to it that my machine remains well oiled."},{"name":"HUNBERCT","text":"Two of these hands accompanied me here to Ul'dah, but it would seem they have eluded my grasp─or I have eluded theirs, har har! Might you be a good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> and find them for me?"},{"name":"HUNBERCT","text":"I would commission a garment to be made from this silk. And yet, my unit is not merely my own. No, the skilled hands under my command see to it that my machine remains well oiled."},{"name":"HUNBERCT","text":"Two of these hands accompanied me here to Ul'dah, but it would seem they have eluded my grasp─or I have eluded theirs, har har! Might you be a good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> and find them for me?"},{"name":"ETAJHA","text":"That first earring I saw would look lovely on my captain...but so would that other one! Gah! Why does shopping have to be so godsdamned <span class=\"emphasis\">difficult</span>?"},{"name":"ETAJHA","text":"Uwaaah! You'd do well not to scare me like that. I'm a Brass Blade in service to Captain Hunberct, better known as Hunberct Longhaft. No doubt you've heard the tales?"},{"name":"ETAJHA","text":"None can deny the captain cuts a dashing figure, but I would give him a gift to further bring out his beauty. What say you, adventurer? Do any of these fine ornaments catch your eye?"},{"name":"Q1","text":"What would best bring out the captain's beauty?"},{"name":"A1","text":"A ruby earring."},{"name":"A1","text":"A sapphire ring."},{"name":"ETAJHA","text":"Do you truly believe so? Some are quick to point out that the ruby is a symbol of passion, but red is also the color of jealousy and anger."},{"name":"ETAJHA","text":"Passion mixed with anger can be a dangerous thing. After all, it is not about how forcefully one manipulates the lever, but how <span class=\"emphasis\">precisely</span>... Anyroad, I thank you for your honest opinion."},{"name":"ETAJHA","text":"Why, I thought the same myself! Some find sapphires cold, but they do not understand that beneath this cool exterior sleeps a wellspring of passion as deep as the ocean─a passion tempered by maturity and reason."},{"name":"ETAJHA","text":"Not coincidentally, it is also the color of my eyes, which the captain has oft admired during late nights manning the control room at Highbridge, as I stroked the lever and admired its workmanship."},{"name":"ETAJHA","text":"There are those in the Brass Blades who do not understand the captain. Those who say his exploits on the battlefield do not warrant the sizable reputation he has amassed."},{"name":"ETAJHA","text":"I know not which battlefield <span class=\"emphasis\">they</span> speak of, but as someone who has witnessed his swordplay firsthand, I can assure you that the reality far exceeds even the tallest of tales."},{"name":"ETAJHA","text":"Speaking of the captain, wherever did he run off to? I must deliver my gift before E'lahmui does, lest she be the one invited to work the lever tonight..."},{"name":"ELAHMUI","text":"So many potions, of myriad powers and potencies... Surely, one might serve to further harden the captain's─er, resolve..."},{"name":"ELAHMUI","text":"Uwaaah! Don't frighten me like that. I was just shopping for a suitable present for my captain. You have heard the tales of the Longhaft, I presume?"},{"name":"ELAHMUI","text":"...Then you know that he is naturally endowed with both size and stamina. Still, I would see how alchemical innovation might enhance his already-prodigious talents. Do any of these phials intrigue you, adventurer?"},{"name":"Q2","text":"What would enhance the captain's potency?"},{"name":"A2","text":"A ruby red potion of stamina."},{"name":"A2","text":"A sapphire blue potion of vigor."},{"name":"ELAHMUI","text":"Ah, that one stood out to me as well! Red is, after all, the color of passion─and few men are more passionate than my captain. It stands to reason that red is his favorite hue."},{"name":"ELAHMUI","text":"I might humbly note that it is also the color of my eyes. He has often praised their beauty during our nights together in the control room at Highbridge, where he often summons me to lubricate the lever. He says my supple fingers are most suited to the task..."},{"name":"ELAHMUI","text":"Is that so? Do you not feel that this shade of blue is somehow lacking in warmth? Not unlike E'tajha's eyes..."},{"name":"ELAHMUI","text":"The last thing I would want to do is stifle the captain's flames of passion... But forgive me─you simply gave an opinion, as you were asked to do."},{"name":"ELAHMUI","text":"In the past, the captain shunned alchemy in all its forms, claiming he had no need for unnatural enhancements."},{"name":"ELAHMUI","text":"Recently, however, I remarked that his blade─already renowned across Eorzea─might reach legendary stature with the right help, and he seemed suitably aroused by the idea."},{"name":"ELAHMUI","text":"Oh, but I simply must be getting back! Just imagining the captain alone with <span class=\"emphasis\">her</span> is enough to send shivers up my tail..."},{"name":"HUNBERCT","text":"Wherever did my two subordinates run off to? They should have been back here bells ago."},{"name":"HUNBERCT","text":"If you see them, tell them to report back here at once. They should know that my lever sags when it goes unmanned for too long."},{"name":"ETAJHA","text":"The mere suggestion that our captain partake in alchemical enhancements is an insult─not merely to him, but to the gods that endowed him with such natural talent!"},{"name":"ELAHMUI","text":"You would have our captain adorn his body with worthless trinkets!? Do you even understand the true measure of a man?"},{"name":"SYSTEM","text":"E'tajha and E'lahmui are exchanging heated words..."},{"name":"ETAJHA","text":"The mere suggestion that our captain partake in alchemical enhancements is an insult─not merely to him, but to the gods that endowed him with such natural talent!"},{"name":"ELAHMUI","text":"Hah! Says the one who would see him adorn his body with gaudy trinkets. Do you even understand the true measure of a man?"},{"name":"ETAJHA","text":"(-E'tajha and E'lahmui-)Ungrateful wench! You're not worthy to polish the captain's blade!"},{"name":"ETAJHA","text":"Captain! I have brought a gift truly perfect for one of your peerless masculine charms!"},{"name":"ELAHMUI","text":"Captain! <span class=\"emphasis\">My</span> gift will see your legendary prowess raised to godlike heights!"},{"name":"ETAJHA","text":"Captain! You always praised the way I calibrate your lever! You called me an <span class=\"emphasis\">engineer</span>!"},{"name":"ELAHMUI","text":"Captain! You said that no machinist in the realm could keep your parts oiled as I do!"},{"name":"HUNBERCT","text":"Cease this senseless bickering, the both of you!"},{"name":"HUNBERCT","text":"You each have served me long, and served me hard. Surely you realize by now that there is more than enough man to go around."},{"name":"HUNBERCT","text":"While I welcome your sentiments, I have no need for shiny baubles or motley brews. The gods have seen fit to endow me well─I would fight my battles on my own merits."},{"name":"HUNBERCT","text":"Besides, there are more important matters at hand. Before you two came in, I had just been informed that my garments were ready! Prepare yourselves!"},{"name":"HUNBERCT","text":"What say you, E'tajha!?"},{"name":"ETAJHA","text":"So dashing! So handsome! So...formfitting! I feel the flames of passion welling from within. Do promise you will wear that the next time you summon me to the control room, yes?"},{"name":"HUNBERCT","text":"For you, my love? Anything! But we have only just begun..."},{"name":"HUNBERCT","text":"What say you, E'lahmui!?"},{"name":"ELAHMUI","text":"That broad chest bursting forth! Those bulging biceps! My captain, this garment shows you for the god of virility that you are. My only regret is that I cannot quite see under the belt..."},{"name":"HUNBERCT","text":"All in good time, my love! <span class=\"emphasis\">Now</span> do you see? There is more than enough man here for─no, Hunberct is no mere man. For within me rages a beast─a beast that will be contained no longer!"},{"name":"HUNBERCT","text":"Behold! Did you know that this furred snow creature is legendary for its stamina and the sheer size of its manhood? Now tell me, ladies─what would you like for Starlight this year?"},{"name":"ELAHMUI","text":"(-E'tajha and E'lahmui-)<span class=\"emphasis\">You</span>, my captain─and nothing but you!"},{"name":"HUNBERCT","text":"Hahaha! That's what I thought you'd say. Now, if you've gotten over your silly little catfight, I believe it's time we went on our way."},{"name":"HUNBERCT","text":"For even as we speak, bandits and brigands would target innocent merchants who travel through Highbridge. Fear not, ladies...there will be time enough for pleasure when the battles have been won. "},{"name":"ELAHMUI","text":"(-E'tajha and E'lahmui-)Yes, <span class=\"emphasis\">sir</span>!"},{"name":"HUNBERCT","text":"&lt;sigh&gt; If you thought being the Longhaft was all about sweet pleasure and bliss, you'd best think again."},{"name":"HUNBERCT","text":"Prone to bouts of sibling jealousy, those two, but they're good girls at heart─all the more admirable considering their origins."},{"name":"HUNBERCT","text":"Stolen from their parents when they were just babes, and sold into a trade where no woman deserves to go. My unit found and freed them, but sadly, the Brass Blades are not in the habit of taking in children."},{"name":"HUNBERCT","text":"Granted their freedom, they made their living on the streets. Where many turn to selling their bodies, they honed their smarts and their fighting skills. When they returned to me years later as women grown─strong and beautiful─I swore that I would have them! In my regiment, that is..."},{"name":"HUNBERCT","text":"That they know how to properly sheathe my blade is an extra benefit─albeit a most welcome one. And with that, I must return to my post."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":617,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[67018,67020]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1009369","obj":{"i":1009369,"n":"Hunberct","l":41,"q":1}},{"type":"npc","id":"1009271","obj":{"i":1009271,"n":"Hunberct","l":41,"q":1}},{"type":"npc","id":"1009272","obj":{"i":1009272,"n":"E'tajha Sapphire-eyes","l":41,"q":1}},{"type":"npc","id":"1009273","obj":{"i":1009273,"n":"E'lahmui Ruby-eyes","l":41,"q":1}},{"type":"npc","id":"1009274","obj":{"i":1009274,"n":"E'tajha Sapphire-eyes","l":41,"q":1}},{"type":"npc","id":"1009275","obj":{"i":1009275,"n":"E'lahmui Ruby-eyes","l":41,"q":1}},{"type":"npc","id":"1009276","obj":{"i":1009276,"n":"E'tajha Sapphire-eyes","l":41,"q":1}},{"type":"npc","id":"1009277","obj":{"i":1009277,"n":"E'lahmui Ruby-eyes","l":41,"q":1}},{"type":"quest","id":"67018","obj":{"i":67018,"n":"Carline Memories","g":77,"l":"Limsa Lominsa","s":3}},{"type":"quest","id":"67020","obj":{"i":67020,"n":"Dream On","g":77,"l":"Limsa Lominsa","s":3}}]}