{"quest":{"name":"Like Civilized Men and Women (Immortal Flames)","location":"Ul'dah","id":67065,"patch":2.3,"sort":300,"icon":112064,"unlocksFunction":1,"eventIcon":71341,"issuer":1001634,"target":1009237,"genre":192,"journal":["Lieutenant Mimio is looking for a few good soldiers.","The member nations of the Eorzean Alliance do not see eye to eye in all matters. Nevertheless, their disagreements have not been irreconcilable─until now. Control of the Carteneau Flats is to be decided on the field of battle, and Lieutenant Mimio would have you fight for the Immortal Flames. Speak with the Free Brigade flyer to learn more of this new conflict, and to decide if you wish to become involved.","<span class=\"emphasis\">Civilized</span> violence. <span class=\"emphasis\">Civilized</span> war. The concept seems contradictory, if not ludicrous, yet your fellow soldiers take no issue with this proposed resolution. It is clear now that the Immortal Flames will not be swayed from their course. You, however, are yet free to decide. To embrace this cause, or to renounce it─it is your choice."],"objectives":["Speak with the Free Brigade flyer at the airship landing."],"dialogue":[{"name":"MIMIO","text":"Ah, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. If you have a moment, I would discuss a matter most grave which concerns the Flames─and by extension, <span class=\"emphasis\">you</span>."},{"name":"MIMIO","text":"Perchance you're familiar with the Battle of Carteneau? Countless Eorzeans and Garleans massacred by an elder primal, end of an era, and so forth? Good, good. For a moment, I feared you had been living in a cave for the past five years."},{"name":"MIMIO","text":"Then surely you know that the Carteneau Flats, where the battle took place, is a hellish wasteland littered with the remnants of that fateful day."},{"name":"MIMIO","text":"Hardly anything of consequence to be found there now, eh? Certainly nothing worth protecting. And yet, in spite of that, the Eorzean Alliance continues to maintain a military presence in the region. Why do you suppose that is?"},{"name":"MIMIO","text":"Because there <span class=\"emphasis\">is</span> something there of consequence. Allagan ruins, to be precise. They were discovered following the Calamity, and Allied scholars have been studying them ever since."},{"name":"MIMIO","text":"Three nations working in tandem for a greater good... It should come as no surprise that it would not last. You see, Ul'dah, Limsa Lominsa, and Gridania have all formally asserted a claim to the territory. Negotiations have thus far proved fruitless, and so we are to settle the dispute on the field of battle."},{"name":"MIMIO","text":"Oh, but do not misunderstand! We won't be going to <span class=\"emphasis\">war</span> with our allies. Hostilities shall be confined to the disputed territories, and we shall fight to submission, not death."},{"name":"MIMIO","text":"So there is no cause for concern, oh no. You won't be expected to kill your opponent─merely deprive him of the will to fight."},{"name":"MIMIO","text":"I say <span class=\"emphasis\">you</span>, because the only reason I deign to share this information with you is because your company needs you, [GC Rank][GC Rank][GC Rank]. We'll be damned if we're going to let a foreign power lay claim to these ruins, and so we need every able-bodied soldier we can muster on the front line."},{"name":"MIMIO","text":"I expect you still have questions and concerns. Very well─speak with our man at the airship landing. He will tell you everything you need to know."},{"name":"GISHITAIHIKUUHEI","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! Come to join the fight, have we? Very good, very good indeed!"},{"name":"GISHITAIHIKUUHEI","text":"Now before we proceed, I must warn you: this isn't going to be like some jaunt in the Wolves' Den."},{"name":"GISHITAIHIKUUHEI","text":"You'll be pitted against wave after wave of fellow Alliance members in battle, and they won't care one whit that you're the Warrior of Light."},{"name":"GISHITAIHIKUUHEI","text":"This campaign will be long and brutal, and victories won today may be undone tomorrow. Consider the borderland ruins. We need only seize control of each ruin in the region, right? Wrong. Defense is paramount as well, for our rivals will muster forces to challenge our claims."},{"name":"GISHITAIHIKUUHEI","text":"It is for that reason we have established an airship route direct to the front line. Those who are ready and willing to fight will never want for transportation!"},{"name":"GISHITAIHIKUUHEI","text":"Ah, but that look on your face bespeaks confusion. “Are we at war or not? What is this bollocks about no killing? What in the seven hells is going on!?” That's what you're thinking, yes?"},{"name":"GISHITAIHIKUUHEI","text":"It's less “war” and more “organized violence to resolve a territorial dispute.” And yes, it is to be <span class=\"emphasis\">civilized</span> violence. Killing Alliance members is strictly prohibited─though accidents have been known to happen, mind you."},{"name":"GISHITAIHIKUUHEI","text":"But you of all people have nothing to fear! You've escaped certain death more times than I can count; what are the odds you'll fail to do so this time, eh?"}],"reward":{"gil":367,"instance":50001,"xp":0},"reqs":{"jobs":[{"lvl":30,"id":34}],"gc":3,"questsType":"any","quests":[66641,66642]}},"partials":[{"type":"npc","id":"1001634","obj":{"i":1001634,"n":"Mimio Mio","l":40,"q":3,"t":"Flame Lieutenant"}},{"type":"npc","id":"1009237","obj":{"i":1009237,"n":"Free Brigade Flyer","l":40,"q":1,"t":"Frontline Attendant"}},{"type":"instance","id":"50001","obj":{"i":50001,"n":"The Borderland Ruins (Secure)","c":61806,"t":"PvP","min_lvl":30}},{"type":"quest","id":"66641","obj":{"i":66641,"n":"A Pup No Longer (Twin Adder)","g":191,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66642","obj":{"i":66642,"n":"A Pup No Longer (Immortal Flames)","g":192,"l":"Ul'dah","s":300,"f":1}}]}