{"quest":{"name":"Spirits Most Foul","location":"Limsa Lominsa","id":67067,"patch":2.3,"sort":5,"icon":100292,"eventIcon":71221,"issuer":1009153,"target":1000705,"involved":[1000312,1000338,1000340,1006238],"genre":77,"journal":["The deputy postmoogle would task you with an urgent delivery to Stillglade Fane.","Your accomplishments as a carrier having won his confidence, your senior has entrusted you with your most important assignment yet. Take the parcel that originates from the Thaumaturges' Guild and then deliver it to the conjurer Braya at Stillglade Fane with all haste.","Visibly relieved as she takes the parcel in hand, Braya explains that she seeks to aid a young man who believes he has been possessed by evil spirits from beyond, a man who has since gone missing. As the conjurer pores over the tome she received to glean what information she can, it may be best to do some investigating of your own. Start by speaking with Aedoc, the missing man's sister, who currently resides in Quarrymill.","Aedoc is concerned for the well-being of her brother, Spen, who has been acting oddly of late. She surmises that if he has not made an appearance at Stillglade Fane, perhaps he has reported to work at the Mun–Tuy Cellars. Travel there to see what knowledge you might glean from his colleagues.","As Master Erimmont and the others at the Mun–Tuy Cellars tell it, Spen has yet to report for his shift. It would seem the lad has been exhibiting curious behavior of late, and his colleagues fear for his safety. Scour the road from Quarrymill to the cellars for any sign of the young man.","You were successful in finding Spen─or, as he is better known to patrons of Buscarron's Druthers, the notorious drunkard, Spenser of the Bottomless Cup. It would seem the lad is afflicted not by otherworldly demons, but an inability to maintain his senses when partaking in Buscarron's realm-famous mead. Return to Stillglade Fane and inform Braya that this whole ordeal has been a rather unfortunate waste of her time.","Though relieved that there are no evil spirits at play, Braya nevertheless is concerned for the safety of both Spenser and any unfortunate patrons of the Druthers who might encounter him. As barroom brawls are out of her realm of expertise, she asks that you do what you can to intervene the next time you encounter the man during one of his less-than-proud moments."],"objectives":["Deliver the parcel to Braya at Stillglade Fane in Gridania.","Speak with Aedoc at Quarrymill.","Inquire about Aedoc's brother at the Mun–Tuy Cellars.","Search for Aedoc's brother on the road to the Mun–Tuy Cellars.","Report to Braya at Stillglade Fane."],"dialogue":[{"name":"LETTERMOOGLE","text":"How far you've come as a carrier─and in such a short time! I knew that my pedagogical skills bordered upon genius, but I daresay I have outdone myself this time, kupo."},{"name":"LETTERMOOGLE","text":"I would reward myself with a well-deserved respite, and <span class=\"emphasis\">you</span> with your most demanding assignment to date. I have in my paws a parcel from the Thaumaturges' Guild in Ul'dah, to be delivered to Braya of the Conjurers' Guild in Gridania─and I quote─<span class=\"emphasis\">with all speed</span>."},{"name":"LETTERMOOGLE","text":"Urgent correspondence between the realm's most puissant practitioners of magic? It would only be the slightest of exaggerations to say that the fate of Eorzea may very well be riding on this delivery. To Stillglade Fane with you, kupo!"},{"name":"LETTERMOOGLE","text":"It would only be the slightest of exaggerations to say that the fate of Eorzea may very well be riding on your ability to deliver that parcel with all speed. To Stillglade Fane with you, kupo!"},{"name":"BRAYA","text":"Tam–Tara Deepcroft, Haukke Manor, and now this! Vengeful spirits clutch and claw at our forest home─at our very souls. Is there naught we can do to free ourselves from their grip?"},{"name":"BRAYA","text":"Thank the gods! I feared it would not arrive in time. This is a comprehensive summary of voidsent sightings collected from across the realm, along with the latest theories on how to deal with potential cases of possession."},{"name":"BRAYA","text":"A young man recently approached me, you see, fearing that he had fallen under the influence of baleful forces not of this world."},{"name":"BRAYA","text":"As the poor soul told me, he oft awakens in the dark of night─in parts unknown, with bruises all over his body and no memory of how he arrived there. The mere thought sends shivers up the spine, does it not? It goes without saying that the man was quite distraught."},{"name":"BRAYA","text":"I promised that I would gather what knowledge I could, and see what I might do to free him of his demons. Thanks to your timely delivery, I am at last armed with the information I need. But there is another rub─my subject has vanished."},{"name":"BRAYA","text":"Even as we speak, dark spirits may have seized control of him once more─and yet, I must dive into this tome immediately to have any hope of saving him. If you could track down the man, I would be much in your debt. His sister, Aedoc, can be found at Quarrymill, and may have some knowledge as to his whereabouts."},{"name":"BRAYA","text":"Seek out Aedoc in Quarrymill and learn what you can from her regarding the whereabouts of her poor, stricken brother."},{"name":"AEDOC","text":"Braya is searching for Spennie, you say? How odd. He left here bells ago, saying he would make straight for the Fane. No, this does not bode well..."},{"name":"AEDOC","text":"Perhaps he was summoned to work on the way? He makes his living at the Mun–Tuy Cellars, after all, and Master Erimmont can be quite the taskmaster. You might do well to ask around there."},{"name":"AEDOC","text":"Doubtless you've already heard, but Spennie hasn't <span class=\"emphasis\">quite</span> been himself of late. I do not want to believe that he would hurt anyone, but...I urge you to be wary."},{"name":"AEDOC","text":"Perhaps my brother's colleagues at the Mun–Tuy Cellars may know something of his whereabouts. Spennie, please be safe─for me..."},{"name":"YMANIE","text":"Looking for Spen, you say? 'Fraid I can't help you there─hasn't come around here yet today."},{"name":"YMANIE","text":"Possessed? Hah! I'll believe it when I see it. Like as not his disappearance has more to do with the thirty casks of Mun–Tuy beans we need to haul up from the cellars today."},{"name":"ERIMMONT","text":"Spen's gone missing <span class=\"emphasis\">again</span>? &lt;sigh&gt; The lad's worked hard for us, but I can't deny that his attendance has been somewhat erratic. I fear that if he does not get his act together─and soon─I may have no choice but to let him go."},{"name":"ERIMMONT","text":"That said, his shift began only minutes ago. I will give him the benefit of the doubt, and trust that he is making his way here as we speak."},{"name":"ERIMMONT","text":"If the lad truly has fallen prey to the hands of darkness, I feel for him. But I have a business to run─if Spen is unwilling or unable to perform his duties, I'll have no choice but to find someone who can."},{"name":"LISELLAIE","text":"Aedoc's brother? Ah, you mean Spen. I've been on watch here since <span class=\"alternative-container\"><span class=\"alternative\">sundown</span><span class=\"alternative\">daybreak</span></span>, and I fear I've seen neither hide nor hair of him."},{"name":"LISELLAIE","text":"When he first started here, he was so devoted to his work that he'd arrive in the cellars <span class=\"emphasis\">bells</span> before his shift began. I cannot help but fear that something is amiss..."},{"name":"SPENSER","text":"(-???-)Unnnggghhh... Wh-Where...am I...?"},{"name":"SPENSER","text":"(-Disheveled Man-)Spen? Why, yes, that is my name. Beg your pardon, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>, but have we met somewhere?"},{"name":"SPENSER","text":"(-Spen-)Dear me... I've done it again, haven't I? My sister, my colleagues, Braya, and even you─who I have only just met...I owe all of you my most profound apologies."},{"name":"SPENSER","text":"(-Spen-)As Braya doubtless told you, it seems that I have fallen prey to forces most sinister. They strike without warning in the black of night, seizing my limbs, inhabiting my mind, rendering me naught but a puppet to carry out their dark designs..."},{"name":"SPENSER","text":"(-Spen-)Come morning I awaken, bruised and beaten, with no memory of the horrors I have committed. O, guardians of the forest, pray take mercy on my soul!"},{"name":"BUSCARRON","text":"(-???-)If you're lookin' for mercy, you're beggin' up the wrong tree, you shite-arsed, two-faced, swill-sodden lump o' goobbue dung!"},{"name":"BUSCARRON","text":"Pay no heed to that man's sob stories. The only <span class=\"emphasis\">sinister force</span> that's got him in its clutches is ol' Buscarron's mead. One thousand three hundred and ninety-six gil, Spen─that'll cover food, drink, an' healin' fees for the poor sod whose arm you near twisted off."},{"name":"SPENSER","text":"(-Spen-)M-Master Buscarron! Surely, this must be some misunderstanding! Why, certainly I patronize your fine establishment on occasion, but only for a single drink..."},{"name":"BUSCARRON","text":"Aye, I suppose that's true. I've not known the quiet, thoughtful <span class=\"emphasis\">Spen</span> to order more than a single flagon o' mead."},{"name":"BUSCARRON","text":"...But by the time that flagon is drained, <span class=\"emphasis\">Spen</span> is no more. In his place is the roarin', mead-swillin', punchin', kickin', belchin', screamin' madman whose name strikes fear into the hearts of every man and woman who's ever wanted to enjoy a drink in godsdamned peace..."},{"name":"BUSCARRON","text":"The scourge of the Druthers, if not the whole bloody realm. Aye, I speak of you...Spenser o' the Bottomless Cup!"},{"name":"SPENSER","text":"Th-This cannot be! I am no scourge─I am a responsible drunkard! I...I know when to say when!"},{"name":"SPENSER","text":"I-I do not know what madness took me, Master Buscarron, but I can assure you that it was an isolated occurrence. Please accept my payment─one thousand three hundred and ninety-six gil in full─along with my profuse apologies for the trouble that I have caused."},{"name":"SPENSER","text":"As for the unfortunate fellow who I may have unwittingly injured, please assure him that I will return to the Druthers <span class=\"alternative-container\"><span class=\"alternative\">on the morrow</span><span class=\"alternative\">this evening</span></span> to make amends in person."},{"name":"SPENSER","text":"And with that, I must be off to the cellars─I am already late for my shift, and Master Erimmont will be rightly furious if I tarry any longer. Farewell, <span class=\"alternative-container\"><span class=\"alternative\">my friends!</span><span class=\"alternative\">my good sirs!</span></span>"},{"name":"SPENSER","text":"Ah, yes, the Conjurers' Guild! Do tell Braya that I shall, ah, endeavor to exorcise my own demons. Should the dark forces prove too formidable, I shall call upon her again."},{"name":"BUSCARRON","text":"&lt;sigh&gt; I wouldn't get your hopes up. If I had a gil for every time I heard ol' Spen spout that nonsense, I'd be a rich man. And last I heard, there ain't no incantation what can cure a man's love for liquor."},{"name":"BRAYA","text":"Spenser of the Bottomless Cup!? And here I had thought that name only a wives' tale, dreamed up to steer young children away from the bottle."},{"name":"BRAYA","text":"I must confess, I am somewhat relieved to discover that the <span class=\"emphasis\">spirits</span> that plagued the man were of a more worldly sort. Though that is small solace to the poor souls who must suffer his mead-induced wrath..."},{"name":"BRAYA","text":"Sadly, I fear that subduing drunkards is outside my field of research. Should you find the poor man in the throes of madness, pray do what you can to restore him to sanity."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":1220,"items":[{"num":3,"id":4647,"one":1},{"num":3,"id":6143,"one":1},{"num":3,"id":4721,"one":1},{"num":3,"id":4678,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[67018,67020]},"next":[67021]},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1000705","obj":{"i":1000705,"n":"Braya","l":53,"q":4}},{"type":"npc","id":"1000312","obj":{"i":1000312,"n":"Lisellaie","l":56,"q":1}},{"type":"npc","id":"1000338","obj":{"i":1000338,"n":"Ymanie","l":56,"q":1}},{"type":"npc","id":"1000340","obj":{"i":1000340,"n":"Erimmont","l":56,"q":3}},{"type":"npc","id":"1006238","obj":{"i":1006238,"n":"Aedoc","l":56,"q":3}},{"type":"item","id":"4647","obj":{"i":4647,"n":"Eft Steak","l":50,"c":24352,"t":46,"p":435}},{"type":"item","id":"6143","obj":{"i":6143,"n":"Grilled Raincaller","l":40,"c":24301,"t":46}},{"type":"item","id":"4721","obj":{"i":4721,"n":"Bouillabaisse","l":55,"c":24111,"t":46}},{"type":"item","id":"4678","obj":{"i":4678,"n":"Beef Stew","l":50,"c":24110,"t":46,"p":415}},{"type":"quest","id":"67018","obj":{"i":67018,"n":"Carline Memories","g":77,"l":"Limsa Lominsa","s":3}},{"type":"quest","id":"67020","obj":{"i":67020,"n":"Dream On","g":77,"l":"Limsa Lominsa","s":3}},{"type":"quest","id":"67021","obj":{"i":67021,"n":"Thwack-a-Mole","g":77,"l":"Limsa Lominsa","s":8}}]}