{"quest":{"name":"King of the Hull","location":"Mor Dhona","id":67062,"patch":2.3,"sort":500,"icon":112058,"unlocksFunction":1,"eventIcon":71341,"issuer":1006975,"target":1009231,"involved":[1009382],"genre":95,"journal":["Bloezoeng has the satisfied look of a man who has found that which he seeks.","Bloezoeng informs you that an old friend, a Lominsan of no small repute, desires your services for a highly confidential task. If you would learn more, make your way to the seaside city–state's upper decks and seek out a man named Denston.","Your client turns out to be none other than the Maelstrom's second–in–command, Storm Marshal Eynzahr Slafyrsyn. Following a lesson in maritime history and natural phenomena, the man tasks you with going to Hullbreaker Isle in order to retrieve a golden coffer which belonged to the pirate king Mistbeard. See to your preparations, then speak with Denston at the Moraby Drydocks to be ferried over to the isle.","Denston stands ready to bear you and your comrades over to Hullbreaker Isle. After arriving, fight your way to the wreck of the <span class=\"emphasis\">Haar</span>, and obtain Mistbeard's coffer.<br><br>※Hullbreaker Isle can be accessed via the Duty Finder.","Following a briny encounter with a tentacled seabeast, you come into possession of Mistbeard's coffer. Take your prize back to the upper decks of Limsa Lominsa and present it to Denston.","No sooner do you deliver the coffer to Denston than Eynzahr appears. The storm marshal unlocks the coffer to produce a mask bearing a menacing visage, which he explains has been worn by all the individuals who have borne the name Mistbeard. The legendary pirate, it would seem, is not one man, but many. Eynzahr goes on to say that the current Mistbeard will be the last, having chosen to consign himself and his predecessors to the pages of history─all for the sake of one woman and her dream of a brighter future for Limsa Lominsa..."],"objectives":["Speak with Denston in Limsa Lominsa.","Speak with Denston at the Moraby Drydocks.","Obtain Mistbeard's coffer in Hullbreaker Isle.","Deliver Mistbeard's coffer to Denston in Limsa Lominsa."],"dialogue":[{"name":"BLOEZOENG","text":"You're <span class=\"highlight\">Forename Surname</span>, by the onion! I was hoping that you'd come by!"},{"name":"BLOEZOENG","text":"I've got a message from an old friend of mine. Needs your help for an important task, he says."},{"name":"BLOEZOENG","text":"It's highly confidential business, so I can't give you his name. Let's just say he's well known in Limsa. Odds are you'll recognize him."},{"name":"BLOEZOENG","text":"Anyroad, I'm not at liberty to divulge any more. If you've a mind to take on the task, head over to Limsa and seek out a bloke named Denston. That's not my friend, mind you, but one of his men."},{"name":"DENSTON","text":"Yer <span class=\"highlight\">Forename Surname</span>, are ye? The chief'll be pleased that ye came. Now, time's o' the essence, so I'll get straight to business."},{"name":"DENSTON","text":"Durin' yer travels, might be as ye heard tell o' Mistbeard, the legendary pirate. Hells, I'd be surprised if ye <span class=\"emphasis\">hadn't</span> heard o' the bloke─ain't a soul in Limsa as don't know of his exploits."},{"name":"DENSTON","text":"Nary a ship on the five seas was safe from Mistbeard's grasp─not even the golden fleet of Ul'dah. But one day, at the height o' his notoriety, the man vanished without a trace while sailin' the Rhotano."},{"name":"DENSTON","text":"Since then, rumors've spread that Mistbeard left behind a treasure trove o' plunder. Folk believe it's somewhere out there, just waitin' to be plucked like a ripe fruit. Yer task pertains to that treasure."},{"name":"EYNZAHRSLAFYRSYN","text":"(-???-)I'll take over from here, Denston."},{"name":"DENSTON","text":"Chief!"},{"name":"EYNZAHRSLAFYRSYN","text":"Greetings, my friend. It's been a while since you sent Leviathan to the bottom of the Indigo Deep. Before I begin, let me make it clear that I do not request your aid in my capacity as storm marshal. Nay, the matter is purely private."},{"name":"EYNZAHRSLAFYRSYN","text":"Greetings, my friend. It's been a while since you sent the Black Wolf to the seventh hell. Before I begin, let me make it clear I do not request your aid in my capacity as storm marshal. Nay, the matter is purely private."},{"name":"EYNZAHRSLAFYRSYN","text":"With that detail established, I shall continue Denston's tale. For a time, folk had lost interest in Mistbeard's cache, such was its elusiveness. But recent developments have treasure hunters across the realm stirring anew."},{"name":"EYNZAHRSLAFYRSYN","text":"South of Vylbrand, upon the Rhotano Sea, there lie the Cieldalaes. Along the fringes of these remote islands, there is an expanse of water into which few ships dare venture. Nature has conspired to perpetually shroud the area in heavy mist. A man can hardly see his own hand in front of him."},{"name":"EYNZAHRSLAFYRSYN","text":"Be it by accident or intent, countless vessels have entered that mist, never to be seen again. Over the years, some few survivors have washed ashore with tales of an island hid within, which appeared without warning to smash their ships into flotsam. So it was that the legend of “Hullbreaker Isle” was born."},{"name":"EYNZAHRSLAFYRSYN","text":"In the wake of the Calamity, however, it came to be that the mist would lift under certain conditions. And as luck would have it, on one such day, a merchantman mistakenly sailed straight into the area."},{"name":"EYNZAHRSLAFYRSYN","text":"The ship eventually came upon a deserted isle, where it made an astonishing discovery: the <span class=\"emphasis\">Haar</span>, Mistbeard's own flagship, lying broken within a cove."},{"name":"EYNZAHRSLAFYRSYN","text":"Though he yearned to explore the wreck, the captain wisely chose to return to familiar waters before the mist could regather. Upon returning to Limsa Lominsa, he forbade his crew from revealing the discovery to a single soul, but word inevitably spread, as is often the way of such things."},{"name":"EYNZAHRSLAFYRSYN","text":"Even as we speak, treasure hunters are scrambling to find a way to the legendary Hullbreaker Isle, that they might claim Mistbeard's cache. I would have you get there before they do, <span class=\"highlight\">Forename</span>, and retrieve a single object from the <span class=\"emphasis\">Haar</span>: a golden coffer bearing Mistbeard's crest."},{"name":"DENSTON","text":"The chief would do the job himself, but his bein' storm marshal is like to attract unwanted attention. That's why he wants ye to go in his stead. So long as ye bring back what he asks for, yer welcome to keep whatever else ye find."},{"name":"EYNZAHRSLAFYRSYN","text":"Though I make my request off the record, I must impress upon you that the matter is of grave import to our nation's future. I shall be praying for your success."},{"name":"DENSTON","text":"Now, no doubt yer wonderin' how yer to get to the isle. I've got a ship moored at the Moraby Drydocks. Meet me there when yer preparations're in order, an' I'll ferry ye over."},{"name":"EYNZAHRSLAFYRSYN","text":"This isn't the text you're looking for."},{"name":"DENSTON","text":"I've got a ship moored at the Moraby Drydocks. Meet me there when yer preparations're in order, an' I'll ferry ye over."},{"name":"DENSTON","text":"Everythin' in order? Then let's get ye over to Hullbreaker Isle before it's aswarm with scavengers."},{"name":"DENSTON","text":"I'll get us there in one piece, never ye fear. I've been keepin' an' eye on the weather, an' I know exactly when the mist'll clear up."},{"name":"DENSTON","text":"When ye arrive, make yer way to the wreck o' the <span class=\"emphasis\">Haar</span>. Mistbeard's coffer's bound to be somewhere inside. As for how yer s'posed to get back afterwards... I'm sure ye'll figure somethin' out, the resourceful 'venturer that ye are. I'll be waitin' for ye in Limsa!"},{"name":"DENSTON","text":"When ye arrive on Hullbreaker Isle, make yer way to the wreck o' the <span class=\"emphasis\">Haar</span>. Mistbeard's coffer's bound to be somewhere inside. Good luck, an' see ye back in Limsa!"},{"name":"DENSTON","text":"Good to see ye back in one piece, an' with Mistbeard's coffer, no less. Let's have a look at it, then."},{"name":"DENSTON","text":"The lock's still intact, an' there's no sign it's been tampered with."},{"name":"DENSTON","text":"Ye did good, 'venturer. The chief'll be right pleased."},{"name":"EYNZAHRSLAFYRSYN","text":"...And indeed he is. I knew that you wouldn't disappoint me, my friend. You have my gratitude."},{"name":"EYNZAHRSLAFYRSYN","text":"Now, you're curious as to the contents, I do not doubt. Having risked life and limb to retrieve the coffer, you've more than earned the right to that knowledge."},{"name":"EYNZAHRSLAFYRSYN","text":"The coffer holds the secret to Mistbeard's identity."},{"name":"EYNZAHRSLAFYRSYN","text":"Menacing, is it not? This mask, my friend, has been worn by all the individuals who have borne the name Mistbeard."},{"name":"EYNZAHRSLAFYRSYN","text":"Aye, Mistbeard was not one man, but many. For generations, both name and mask have been inherited by those deemed worthy. And so the legend continued."},{"name":"EYNZAHRSLAFYRSYN","text":"But now that legend will come to an end, for the last Mistbeard has found a new purpose in life: one woman and her dream of a brighter future for Limsa Lominsa."},{"name":"EYNZAHRSLAFYRSYN","text":"As you know, ours is a nation founded by pirates. It's in a Lominsan's blood to desire to be his own master─to reject authority and take what he wants."},{"name":"EYNZAHRSLAFYRSYN","text":"Some among us believe that piracy is a time–honored tradition. But so long as we cling to this tradition, we will never know lasting prosperity."},{"name":"EYNZAHRSLAFYRSYN","text":"These were the woman's words, and Mistbeard saw wisdom in them. He swore to do all in his power to make her dream reality."},{"name":"EYNZAHRSLAFYRSYN","text":"In the future she envisioned, there is no place for pirate kings but in the tales of fishwives. And so Mistbeard has chosen to consign himself and his predecessors to the pages of history."},{"name":"EYNZAHRSLAFYRSYN","text":"This mask symbolizes an obsolete way of life, yet it is not without power. Should it fall into the wrong hands, another Mistbeard will rise. Hot-blooded Lominsans will gather to his dread banner, and piracy will continue."},{"name":"EYNZAHRSLAFYRSYN","text":"The mask will never see the light of day again. On this day, the pirate king Mistbeard draws his last breath."},{"name":"EYNZAHRSLAFYRSYN","text":"Denston. I trust you know what to do."},{"name":"DENSTON","text":"Aye aye, Chief! Given a bit o' time, the rumors o' treasure'll fade, just like the mist clearin'!"}],"reward":{"gil":2064,"xp":0,"instance":23},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[67784]},"partials":[{"type":"npc","id":"1006975","obj":{"i":1006975,"n":"Bloezoeng","l":67,"q":5}},{"type":"npc","id":"1009231","obj":{"i":1009231,"n":"Denston","l":28,"q":2}},{"type":"npc","id":"1009382","obj":{"i":1009382,"n":"Denston","l":31,"q":2}},{"type":"instance","id":"23","obj":{"i":23,"n":"Hullbreaker Isle","c":61801,"t":"Dungeons","min_lvl":50,"max_lvl":50,"min_ilvl":70,"max_ilvl":110}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"67784","obj":{"i":67784,"n":"Storming the Hull","g":91,"l":"Limsa Lominsa","s":610,"f":1}}]}