{"quest":{"name":"Like Civilized Men and Women (Twin Adder)","location":"Gridania","id":67063,"patch":2.3,"sort":300,"icon":112064,"unlocksFunction":1,"eventIcon":71341,"issuer":1009294,"target":1009235,"genre":191,"journal":["Lieutenant Scarlet is looking for a few good soldiers.","The member nations of the Eorzean Alliance do not see eye to eye in all matters. Nevertheless, their disagreements have not been irreconcilable─until now. Control of the Carteneau Flats is to be decided on the field of battle, and Lieutenant Scarlet would have you fight for the Twin Adder. Speak with the Yellow Serpent flyer to learn more of this new conflict, and to decide if you wish to become involved.","<span class=\"emphasis\">Civilized</span> violence. <span class=\"emphasis\">Civilized</span> war. The concept seems contradictory, if not ludicrous, yet your fellow soldiers take no issue with this proposed resolution. It is clear now that the Order of the Twin Adder will not be swayed from its course. You, however, are yet free to decide. To embrace this cause, or to renounce it─it is your choice."],"objectives":["Speak with the Yellow Serpent flyer at the airship landing."],"dialogue":[{"name":"SCARLET","text":"Come closer, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. I would prefer that this tale be heard by you and you alone. It concerns a sensitive subject with which you are doubtless well acquainted: the Battle of Carteneau."},{"name":"SCARLET","text":"Aye, I speak of that bloodbath which marked the end of the Sixth Astral Era, when both the VIIth Legion and Allied forces were slaughtered by that winged abomination which did its utmost to destroy all we know and love."},{"name":"SCARLET","text":"No part of Eorzea was untouched by the elder primal's rage, least of all the Carteneau Flats, which were ravaged─nay, <span class=\"emphasis\">remade</span> in the fires of destruction. The Flats were rendered an accursed wasteland, and all decent smallfolk know to keep a wide berth."},{"name":"SCARLET","text":"Consequently, many question why the Eorzean Alliance continues to maintain a military presence in the region, despite the personnel and materiel required to do so."},{"name":"SCARLET","text":"Allagan ruins, that's why. Allied scholars have been studying them since their discovery following the battle, during which time the Carteneau Flats have been jointly administered by the three member nations of the Eorzean Alliance."},{"name":"SCARLET","text":"This was an acceptable state of affairs for a time, but no longer. Ul'dah, Limsa Lominsa, and Gridania have all formally asserted a claim to the territory. A diplomatic resolution is no longer possible; the matter is to be decided on the field of battle."},{"name":"SCARLET","text":"Lest you fear that this marks the advent of total war, worry not. We are allies as ever and shall conduct ourselves accordingly. All hostilities will be confined to the disputed territories, and engagements shall be fought to submission, not death."},{"name":"SCARLET","text":"So you see, you needn't hesitate to join the fray. Should you have the misfortune of facing a friend in battle, you will only be expected to subdue him, not kill him."},{"name":"SCARLET","text":"Aye, that's right─I tell you all this because we need men and women of your caliber on the front line. These ruins are of vital importance to our nation's security, and we cannot surrender them to a foreign power."},{"name":"SCARLET","text":"You need not make a decision now. All I ask is that you speak with our man at the airship landing and listen to what he has to say."},{"name":"KOUJATAIHIKUUHEI","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! Come to join the fight, have we? Very good, very good indeed!"},{"name":"KOUJATAIHIKUUHEI","text":"Now before we proceed, I must warn you: this isn't going to be like some jaunt in the Wolves' Den."},{"name":"KOUJATAIHIKUUHEI","text":"You'll be pitted against wave after wave of fellow Alliance members in battle, and they won't care one whit that you're the Warrior of Light."},{"name":"KOUJATAIHIKUUHEI","text":"This campaign will be long and brutal, and victories won today may be undone tomorrow. Consider the borderland ruins. We need only seize control of each ruin in the region, right? Wrong. Defense is paramount as well, for our rivals will muster forces to challenge our claims."},{"name":"KOUJATAIHIKUUHEI","text":"It is for that reason we have established an airship route direct to the front line. Those who are ready and willing to fight will never want for transportation!"},{"name":"KOUJATAIHIKUUHEI","text":"Ah, but that look on your face bespeaks confusion. “Are we at war or not? What is this bollocks about no killing? What in the seven hells is going on!?” That's what you're thinking, yes?"},{"name":"KOUJATAIHIKUUHEI","text":"It's less “war” and more “organized violence to resolve a territorial dispute.” And yes, it is to be <span class=\"emphasis\">civilized</span> violence. Killing Alliance members is strictly prohibited─though accidents have been known to happen, mind you."},{"name":"KOUJATAIHIKUUHEI","text":"But you of all people have nothing to fear! You've escaped certain death more times than I can count; what are the odds you'll fail to do so this time, eh?"}],"reward":{"gil":367,"instance":50001,"xp":0},"reqs":{"jobs":[{"lvl":30,"id":34}],"gc":2,"questsType":"any","quests":[66641,66642]}},"partials":[{"type":"npc","id":"1009294","obj":{"i":1009294,"n":"Scarlet","l":52,"q":7,"t":"Serpent Lieutenant"}},{"type":"npc","id":"1009235","obj":{"i":1009235,"n":"Yellow Serpent Flyer","l":52,"q":1,"t":"Frontline Attendant"}},{"type":"instance","id":"50001","obj":{"i":50001,"n":"The Borderland Ruins (Secure)","c":61806,"t":"PvP","min_lvl":30}},{"type":"quest","id":"66641","obj":{"i":66641,"n":"A Pup No Longer (Twin Adder)","g":191,"l":"Gridania","s":300,"f":1}},{"type":"quest","id":"66642","obj":{"i":66642,"n":"A Pup No Longer (Immortal Flames)","g":192,"l":"Ul'dah","s":300,"f":1}}]}