{"quest":{"name":"Streets of Moonfire (Gridania)","location":"Gridania","id":67070,"patch":2.3,"sort":42,"icon":100277,"eventIcon":71221,"issuer":1009243,"target":1009242,"genre":201,"usedItems":[2970,2967],"journal":["Event organizing is a cruel mistress, and one chaperone of the Moonfire Faire is determined that you should feel its heartless lash.<br>※This quest is available for a limited time only.","According to a roving chaperone of the Moonfire Faire, the Adventurers' Guild is looking for members willing to help with the festivities. As a proud <span class=\"alternative-container\"><span class=\"alternative\">guildswoman</span><span class=\"alternative\">guildsman</span></span> and something of a sartorial adventurer, it would behoove you to slip on a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span> and take yourself to the Aftcastle. If the chief chaperone, Haermaga, is all that he is promised to be, this transaction would prove to be in your favor.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Haermaga is a trifle vague on the rationale of these festivities, but quite clear on the matter of reward. In return for participating in three events, you will receive prizes, plus a special costume. Your summer wardrobe is a little lacking, and it would be well for the commonfolk to see what an adventurer is made of. And if that should prove insufficient motivation, do it for the children."],"objectives":["Don a <span class=\"alternative-container\"><span class=\"alternative\">lady's yukata (red)</span><span class=\"alternative\">lord's yukata (blue)</span></span> and speak with Haermaga."],"dialogue":[{"name":"EXABU01534","text":"Oi, you there, the comely looking one! I take you for an adventurer, and your guild needs you to make this year's Moonfire Faire the merriest in living memory! What say you jaunt up to Limsa and lend a hand?"},{"name":"EXABU01534","text":"In case you're unfamiliar with the festival, it was first held five years ago in order to extinguish the Bombards─fiery fiends who threatened to turn the whole realm into a living inferno. Now, the creatures haven't <span class=\"emphasis\">actually</span> made a return this year, but that doesn't mean we can't have a scorching good time!"},{"name":"EXABU01534","text":"In the absence of a real threat, we're focusing instead on making the commonfolk's love of the faire work for <span class=\"emphasis\">us</span>, the rank-and-file adventurers! Guild identity and all that. Tsk-tsk, how guileless you are! A good name made by honest work is nothing unless kept well polished by favorable talk."},{"name":"EXABU01534","text":"So how about it, my innocent <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Help your guild, help yourself? Go to the Aftcastle of Limsa Lominsa, then! There lumbers Haermaga, the grand chaperone of Moonfire Faire."},{"name":"EXABU01534","text":"You must go garbed in a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span>, or he'll not know you for a friend. Not the sharpest axe in the armory, Haermaga─makes him a fine choice to sit atop the high chair for this undertaking."},{"name":"EXABU01534","text":"If you've no yukata of your own, procure one at a Moonfire Faire vendor. Oh, quibble not─'tis but a small expense, and you'll receive a new set of raiments for assisting with the festivities."},{"name":"EXABU01534","text":"If you wish to help with the Moonfire Faire, take yourself to Limsa Lominsa. Present yourself to Haermaga at the Aftcastle, and go garbed in a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span>, unless you wish to give the chief chaperone the wrong idea."},{"name":"EXABU01534","text":"The yukata can be purchased from any Moonfire Faire vendor. And no, we'll not defray the expense! It's quite piddling as it is. Besides, the guild's coffers are for more pressing needs."},{"name":"HAERMAGA","text":"So! You're here to muck in and churn it up for the Moonfire Faire? That's the spirit─the adventuring spirit! Come to think of it, that's what the festivities are about, isn't it?"},{"name":"HAERMAGA","text":"The adventuring trade has a─hang my tongue─has a <span class=\"emphasis\">figuring</span> problem, see? The commonfolk can't figure out what we do, beyond doing that hither, doing this thither."},{"name":"HAERMAGA","text":"What we need's a real adventurer living by the sweat of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> brow, showing everyone how it's done! And what we do! You know, mucking in, living it up! Making it real!"},{"name":"HAERMAGA","text":"What else? Oh! It's about the children. I don't rightly remember why, but it's about the children. Because...because they grow up, that's right. Where would the guild be without the next generation? Getting old, that's where we'd be. Don't know about you, but I'm not spending my golden years crafting ingots!"},{"name":"HAERMAGA","text":"So we figured─or one of the other chaperones figured, I don't go to all the meetings─there should be three adventuring events. There's a prize for each one, and we'd be extra appreciative if you do all three!"},{"name":"HAERMAGA","text":"So, ah, you ready to do this? If you are, I'll show you where you can find the events!"},{"name":"HAERMAGA","text":"Er, you want to help with the Moonfire Faire? Where's your yukata? You're supposed to be wearing one of those─they told me that was decided at the meeting. Sorry, no exceptions!"},{"name":"HAERMAGA","text":"But I'm a helpful sort of fellow. I'm the chief chaperone here, after all! You can buy a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span> from any Moonfire Faire vendor. Then you'll be ready to muck in and do your bit for the guild!"}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67073,67074,67075]},"partials":[{"type":"npc","id":"1009243","obj":{"i":1009243,"n":"Moonfire Faire Chaperone","l":53,"q":1}},{"type":"npc","id":"1009242","obj":{"i":1009242,"n":"Haermaga","l":28,"q":7,"t":"Moonfire Faire Chairman"}},{"type":"item","id":"2970","obj":{"i":2970,"n":"Lady's Yukata (Red)","l":1,"c":42245,"t":35,"p":59}},{"type":"item","id":"2967","obj":{"i":2967,"n":"Lord's Yukata (Blue)","l":1,"c":42248,"t":35,"p":59}},{"type":"quest","id":"67073","obj":{"i":67073,"n":"Drench It! Moonfire Faire","g":201,"l":"Limsa Lominsa","s":45}},{"type":"quest","id":"67074","obj":{"i":67074,"n":"Blast It! Moonfire Faire","g":201,"l":"Limsa Lominsa","s":46}},{"type":"quest","id":"67075","obj":{"i":67075,"n":"Explode It! Moonfire Faire","g":201,"l":"Limsa Lominsa","s":47}}]}