{"quest":{"name":"Drench It! Moonfire Faire","location":"Limsa Lominsa","id":67073,"patch":2.3,"sort":45,"icon":100278,"eventIcon":71221,"issuer":1009242,"target":1009248,"genre":201,"journal":["The summer heat and the festival spirit make a combustible combination. Who better to put a damper on things than you?<br>※This quest is available for a limited time only.","Haermaga believes you would make a great addition to a fire–fighting event called the Rousing Douse. What exactly makes it so rousing, he would not say. You will find the answer at the Blind Iron Mines from a chaperone called Ethelia.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Ethelia is rather more cavalier than you expected of a chaperone, but it is surely a sign of her confidence in your ability to handle a large, ill-tempered monster traditionally in the employ of your sworn enemies. The clamor of the children grows louder; give your assent to Ethelia, mount the elbst, and commence the waterworks."],"objectives":["Speak with Ethelia at the Blind Iron Mines."],"dialogue":[{"name":"HAERMAGA","text":"Hah, ready to muck in? Wait till you see this event─it's a real scorcher! The chaperone that came up with the idea─smart as a stitch, that one─calls it the “Rousing Douse.” Clever, huh? Huh?"},{"name":"HAERMAGA","text":"Most folk think we adventurers just slay demons and punish miscreants. Nothing wrong with that─if I don't mete out a good beating once a moon, I go a bit crazy─but we've other skills that are going mostly unused. Fighting fire's one of the big ones."},{"name":"HAERMAGA","text":"Did you know there's a whole lot of adventurers training these─hang my tongue─these beast–things to put out fires? I didn't! They're massed in lower La Noscea right now, near the entrance to the Blind Iron Mines. Was I supposed to go inspect? Maybe later! But you should go <span class=\"emphasis\">now</span>."},{"name":"HAERMAGA","text":"Just take yourself out there and give a friendly yelly-yell to Ethelia. She's a Moonfire Faire chaperone, and she'll find you a beast–thing for the event."},{"name":"HAERMAGA","text":"You promised to muck in for the Rousing Douse event, didn't you? It's over by the entrance to the Blind Iron Mines in lower La Noscea. Just find a Moonfire Faire chaperone called Ethelia."},{"name":"HAERMAGA","text":"Someone who does all three events─now that's what I call an adventurer! Loves the trade, ready for a bit o' fun, never stingy with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> guild. An adventurer like that gets a special reward out of my own purse!"},{"name":"ETHELIA","text":"Ah, fresh meat for the elbst... Hah, just kidding! You're going to be on an elbst in a moment, though. We call ourselves the Moonfire Marines, and you're the newest recruit."},{"name":"ETHELIA","text":"Don't look so green. The Sahagin have been keeping elbst for viangaa's years. We at the guild are just getting started, but they're tractable enough creatures."},{"name":"ETHELIA","text":"What a Moonfire marine does is mount up on an elbst for a round of fire–fighting. Elbst have this funny quirk where you poke 'em in the side and they upchuck a bellyful of cold water."},{"name":"ETHELIA","text":"We've some choice pillars of fire set up out there. Trot on over and Saturate the flames with elbst spit. Don't be shy now!"},{"name":"ETHELIA","text":"Give the audience a show─they're there to get doused! No one who's standing there wants to stay dry. It's been a baking hot summer, if you haven't noticed."},{"name":"ETHELIA","text":"Let me know when you're ready to begin. Remember, there're some little ones out there who've never seen an adventurer! Make it look good, or I'll be tempted to feed you to the elbst."}],"reward":{"gil":191,"items":[{"id":8532},{"id":8535}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[67070,67071]},"next":[67076]},"partials":[{"type":"npc","id":"1009242","obj":{"i":1009242,"n":"Haermaga","l":28,"q":7,"t":"Moonfire Faire Chairman"}},{"type":"npc","id":"1009248","obj":{"i":1009248,"n":"Ethelia","l":31,"q":2,"t":"Moonfire Faire Chaperone"}},{"type":"item","id":"8532","obj":{"i":8532,"n":"Lord's Yukata (Blackflame)","l":1,"c":48920,"t":35,"p":59}},{"type":"item","id":"8535","obj":{"i":8535,"n":"Lady's Yukata (Redfly)","l":1,"c":48917,"t":35,"p":59}},{"type":"quest","id":"67070","obj":{"i":67070,"n":"Streets of Moonfire (Gridania)","g":201,"l":"Gridania","s":42}},{"type":"quest","id":"67071","obj":{"i":67071,"n":"Streets of Moonfire (Limsa Lominsa)","g":201,"l":"Limsa Lominsa","s":43}},{"type":"quest","id":"67076","obj":{"i":67076,"n":"A Rousing Douse","g":201,"l":"Lower La Noscea","s":48,"r":1}}]}