{"quest":{"name":"Streets of Moonfire (Ul'dah)","location":"Ul'dah","id":67072,"patch":2.3,"sort":44,"icon":100277,"eventIcon":71221,"issuer":1009244,"target":1009242,"genre":201,"usedItems":[2970,2967],"journal":["All work and no play makes <span class=\"highlight\">Forename</span> a dull adventurer, and one chaperone of the Moonfire Faire is determined that you should let your hair down.<br>※This quest is available for a limited time only.","According to a roving chaperone of the Moonfire Faire, the Adventurers' Guild is looking for members willing to help with the festivities. As a proud <span class=\"alternative-container\"><span class=\"alternative\">guildswoman</span><span class=\"alternative\">guildsman</span></span> and something of a sartorial adventurer, it would behoove you to slip on a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span> and take yourself to the Aftcastle. If the chief chaperone, Haermaga, is all that he is promised to be, this transaction would prove to be in your favor.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Haermaga is a trifle vague on the rationale of these festivities, but quite clear on the matter of reward. In return for participating in three events, you will receive prizes, plus a special costume. Your summer wardrobe is a little lacking, and it would be well for the commonfolk to see what an adventurer is made of. And if that should prove insufficient motivation, do it for the children."],"objectives":["Don a <span class=\"alternative-container\"><span class=\"alternative\">lady's yukata (red)</span><span class=\"alternative\">lord's yukata (blue)</span></span> and speak with Haermaga."],"dialogue":[{"name":"EXABU01536","text":"<span class=\"emphasis\">Moon–fire Fa–ire</span>!♪<br><span class=\"emphasis\">In Lim–sa Lo–minsa</span>!♪<br>Hah hah hah! Well met there, fellow 'venturer. Come join us for the guild's Moonfire Faire!"},{"name":"EXABU01536","text":"Join us for what, you say? Oh, no being coy now! Time was, we hunted Bombards in the sultry months of summer, and made merry of the heat by calling it a faire."},{"name":"EXABU01536","text":"But there are no Bombards to be seen this year─and still the folk were wanting to know, when will the 'Venturers' Guild put on the summer faire? So we thought, why, the festivities need not be on account of the Bombards. After all, 'tis <span class=\"emphasis\">our</span> derring–do they want to see!"},{"name":"EXABU01536","text":"You should join the faire─have a little fun! All work an' no play makes a drudge of a 'venturer, as they say. Chief Chaperone Haermaga over at the Aftcastle in Limsa Lominsa knows all about that─an' about the faire, too."},{"name":"EXABU01536","text":"Now, make sure to put on a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span> before you see him. Keep in mind that this is fun, not work."},{"name":"EXABU01536","text":"Don't have one? No problem! Just go buy one from any Moonfire Faire vendor you happen across. You deserve to treat yourself. An' the guild will give you a whole 'nother set of togs later, too...assuming you do your part."},{"name":"EXABU01536","text":"Go to the Aftcastle in Limsa Lominsa if you're in the mood for a little fun at the Moonfire Faire!"},{"name":"EXABU01536","text":"Wear your pretty <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span> an' talk to Chief Chaperone Haermaga. If you don't have one, make sure to pick one up from any Moonfire Faire vendor. Go on, treat yourself!"},{"name":"HAERMAGA","text":"So! You're here to muck in and churn it up for the Moonfire Faire? That's the spirit─the adventuring spirit! Come to think of it, that's what the festivities are about, isn't it?"},{"name":"HAERMAGA","text":"The adventuring trade has a─hang my tongue─has a <span class=\"emphasis\">figuring</span> problem, see? The commonfolk can't figure out what we do, beyond doing that hither, doing this thither."},{"name":"HAERMAGA","text":"What we need's a real adventurer living by the sweat of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> brow, showing everyone how it's done! And what we do! You know, mucking in, living it up! Making it real!"},{"name":"HAERMAGA","text":"What else? Oh! It's about the children. I don't rightly remember why, but it's about the children. Because...because they grow up, that's right. Where would the guild be without the next generation? Getting old, that's where we'd be. Don't know about you, but I'm not spending my golden years crafting ingots!"},{"name":"HAERMAGA","text":"So we figured─or one of the other chaperones figured, I don't go to all the meetings─there should be three adventuring events. There's a prize for each one, and we'd be extra appreciative if you do all three!"},{"name":"HAERMAGA","text":"So, ah, you ready to do this? If you are, I'll show you where you can find the events!"},{"name":"HAERMAGA","text":"Er, you want to help with the Moonfire Faire? Where's your yukata? You're supposed to be wearing one of those─they told me that was decided at the meeting. Sorry, no exceptions!"},{"name":"HAERMAGA","text":"But I'm a helpful sort of fellow. I'm the chief chaperone here, after all! You can buy a <span class=\"alternative-container\"><span class=\"alternative\">red lady's yukata</span><span class=\"alternative\">blue lord's yukata</span></span> from any Moonfire Faire vendor. Then you'll be ready to muck in and do your bit for the guild!"}],"reward":{"gil":286,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1009244","obj":{"i":1009244,"n":"Moonfire Faire Chaperone","l":40,"q":1}},{"type":"npc","id":"1009242","obj":{"i":1009242,"n":"Haermaga","l":28,"q":7,"t":"Moonfire Faire Chairman"}},{"type":"item","id":"2970","obj":{"i":2970,"n":"Lady's Yukata (Red)","l":1,"c":42245,"t":35,"p":59}},{"type":"item","id":"2967","obj":{"i":2967,"n":"Lord's Yukata (Blue)","l":1,"c":42248,"t":35,"p":59}}]}