{"quest":{"name":"Blast It! Moonfire Faire","location":"Limsa Lominsa","id":67074,"patch":2.3,"sort":46,"icon":100279,"eventIcon":71221,"issuer":1009242,"target":1009249,"genre":201,"journal":["Unlike certain other guilds, the Adventurers' Guild is a family-friendly organization, as you will prove with explosive flair.<br>※This quest is available for a limited time only.","Haermaga is inordinately proud of his take on traditional demon-slaying exhibitions, and would like you to man the cannons down in the Salt Strand. Seek out the Moonfire Faire chaperone Mayaru Moyaru down in lower La Noscea─you are sure to have a blast.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Mayaru Moyaru insists on explaining some basic safety rules before he allows you near a cannon. As the representative of the guild, both masterful aim and noble conduct are expected of you. Speak with Mayaru Moyaru when you are ready to begin."],"objectives":["Speak with Mayaru Moyaru at the Salt Strand."],"dialogue":[{"name":"HAERMAGA","text":"Hah, ready to churn it up? I named this event myself─named all of 'em, but the other two got shot down by other chaperones. But this one was a winner! I call it “The Cannon–do Spirit”!"},{"name":"HAERMAGA","text":"Demon slaying's always a crowd pleaser, but parents of little ones can be a mite touchy about the hacking and slashing. What I figured is, you need to keep it <span class=\"emphasis\">dry</span>."},{"name":"HAERMAGA","text":"So we decided to use cannons instead. More civilized-like and crispy, was my way of thinking. That's why I sit in the big chair, I fancy. Family friendly, that's what I am."},{"name":"HAERMAGA","text":"Since when does the Adventurers' Guild have cannons? Weeell, I never could resist something complimentary, and the Maelstrom was─what do you call it?─<span class=\"emphasis\">decommissioning</span> a few. They're safe enough. You've seen their like along the parapets of Aleport."},{"name":"HAERMAGA","text":"Since when does the Adventurers' Guild have cannons? Weeell, I never could resist something complimentary, and the Maelstrom was─what do you call it?─<span class=\"emphasis\">decommissioning</span> a few. They're safe enough, this being an exhibition event and all."},{"name":"HAERMAGA","text":"The action's down in the Salt Strand, in lower La Noscea. The chaperone in charge is─hang my tongue, I'm ever muddling up Plainsfolk names─Mayaru Moyaru. He'll show you the ropes!"},{"name":"HAERMAGA","text":"You look like you could do with a little noisemaking! Go down to the Salt Strand and ask for the chaperone Mayaru Moyaru. Tell him you're to help with the Cannon–do Spirit event!"},{"name":"HAERMAGA","text":"Someone who does all three events─now that's what I call an adventurer! Loves the trade, ready for a bit o' fun, never stingy with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> guild. An adventurer like that gets a special reward out of my own purse!"},{"name":"MAYARUMOYARU","text":"Ahoy, welcome to, um, the cannon event! I like to think of this as an exhibition that packs a real punch. And also family friendly─look at all the little ones in the audience!"},{"name":"MAYARUMOYARU","text":"The chief chaperone told you what you'd be up to, yes? Demon slaying, and lots of it! We've acquired some nice 18-ponze cannons. They make a big bang when they're fired at their targets─sabotenders and womandragoras in this case!"},{"name":"MAYARUMOYARU","text":"And don't go hitting anything other than your intended targets! I think it's been mentioned once or twice that this is a family-friendly event."},{"name":"MAYARUMOYARU","text":"I mean...it's not as though someone would <span class=\"emphasis\">die</span> or anything if one were to accidentally get a blast to the face. But a cannonball is still far from a flan puff. I shouldn't think it would be safe."},{"name":"MAYARUMOYARU","text":"Besides, it would be in extremely poor taste to shoot any future adventurers with the cannon. We can't have them thinking ill of the guild. And it <span class=\"emphasis\">certainly</span> wouldn't be family friendly!"},{"name":"MAYARUMOYARU","text":"Now, please think on everything I've said. If you decide you'd like to play by the rules, simply speak with me to participate."}],"reward":{"gil":191,"items":[{"id":8533},{"id":8536}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[67070,67071]},"next":[67077]},"partials":[{"type":"npc","id":"1009242","obj":{"i":1009242,"n":"Haermaga","l":28,"q":7,"t":"Moonfire Faire Chairman"}},{"type":"npc","id":"1009249","obj":{"i":1009249,"n":"Mayaru Moyaru","l":31,"q":2,"t":"Moonfire Faire Chaperone"}},{"type":"item","id":"8533","obj":{"i":8533,"n":"Lord's Yukata (Whiteflame)","l":1,"c":48921,"t":35,"p":59}},{"type":"item","id":"8536","obj":{"i":8536,"n":"Lady's Yukata (Bluefly)","l":1,"c":48918,"t":35,"p":59}},{"type":"quest","id":"67070","obj":{"i":67070,"n":"Streets of Moonfire (Gridania)","g":201,"l":"Gridania","s":42}},{"type":"quest","id":"67071","obj":{"i":67071,"n":"Streets of Moonfire (Limsa Lominsa)","g":201,"l":"Limsa Lominsa","s":43}},{"type":"quest","id":"67077","obj":{"i":67077,"n":"The Cannon-do Spirit","g":201,"l":"Lower La Noscea","s":49,"r":1}}]}