{"quest":{"name":"What Blooms in the Night","location":"Limsa Lominsa","id":67082,"patch":2.35,"sort":54,"icon":100286,"eventIcon":71221,"issuer":1009489,"target":1009490,"involved":[1000938,1000980,1002079],"genre":202,"journal":["Bran the gazetteer would ask for your aid in tracking down an elusive individual.<br>※This quest is available for a limited time only.","Bran is on the trail of the mysterious minstrel sighted throughout the realm. Why not do your part for journalism and speak with three good citizens of Limsa Lominsa?<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","It seems everyone has a tale to tell of the mysterious minstrel. Share the reports with Bran, and see what he has to say.","With the nimbleness of mind that marks his kind, Bran leaps to the conclusion that the minstrel will next appear in Limsa Lominsa. Since even the seemingly ubiquitous scribbler cannot actually be in two places at once, take yourself to the Aftcastle and speak to those of bardic aspect.","A puzzle, an artist, a lawbreaker, and a champion of adventurers─the wandering minstrel is all these, and more. Having expressed his admiration for adventurers, he shares with you the words of the late Archon Louisoix. In light of the grim future they foretell, the minstrel gifts you with one of Eorzea's favorite pastimes, which he hopes will keep you and your thoughts from the encroaching shadows."],"objectives":["Ask the people of Limsa Lominsa about the mysterious minstrel.","Speak with Bran.","Search for the wandering minstrel in the Aftcastle."],"dialogue":[{"name":"BRAN","text":"A moment of your time! Who'dn't give a moment 'less they got somethin' to hide, right? I'm with the <span class=\"emphasis\">Harbor Herald</span>─name of Bran. I'm as green as they come. Consider this gaz born yesterday and still learnin' to spell “tomorrow.”"},{"name":"BRAN","text":"But I'd have to be beyond green to not know that you're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> that knows things. For example, this mysterious minstrel whose poetry's the talk of the town─you know about him, am I right?"},{"name":"BRAN","text":"Flamboyant kind of fella, I hear. Silver bijoux and scented oils. You sure you haven't seen him? Highly doubt an eagle eye like you'd miss him if he were about these parts."},{"name":"BRAN","text":"Then again, what do I know, right? I'm as green as the darlin' buds of spring. Hardly fair to think you'd live up to my lofty 'spectations!"},{"name":"BRAN","text":"Pay no heed to what I said about you bein' an eagle eye and knowin' everythin' that's goin' on! I'll just go talk to some other folks. If you hear anythin' about the mysterious minstrel─not that I 'spect you to─you know where to find me."},{"name":"BRAN","text":"If you hear anythin' about the mysterious minstrel─not that I 'spect you to─you know where to find me. But don't strain yourself on my account!"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"GREGORY","text":"...A <span class=\"emphasis\">mysterious</span> minstrel, you say? Might a merely <span class=\"emphasis\">puzzling</span> one do? I met one of those just the other day, when I was about guild business in Gridania."},{"name":"GREGORY","text":"Now that you mention it, he did cut a rather dashing figure. It was at a remembrance for the Calamity. I started when I saw his face by the light of the fireworks! We looked alike as brothers, you see."},{"name":"GREGORY","text":"Well, fair he was to look upon, naturally. I introduced myself, asked him if he'd lost friends as I have...and what do you know, he thanks me. A puzzling sort of fellow, as I said."},{"name":"GREGORY","text":"The mysterious minstrel? Mayhap that fellow I met in Gridania when I was about guild's business. They were sending Azeyma's Candles up for the Calamity's fallen. Very intent he was on the fireworks."},{"name":"GREGORY","text":"I, too, see the friends I lost in the lions and spinners... So I spoke to the minstrel and, for some reason, he thanked me. What I did to prompt it, I have not a clue."},{"name":"GIGIWAZU","text":"The mysterious minstrel? Why, I believe I met the very man! It was in Ul'dah. I was there but recently, you see. As pleasant as Limsa Lominsa is, I feel the need to return home at a regular tick."},{"name":"GIGIWAZU","text":"He had me show him to the heights of the city─to see the fireworks. And, oh, how lovely they were! Flowers for the dead, blooming in the night sky..."},{"name":"GIGIWAZU","text":"Ah, but forgive my flights of fancy. The fireworks <span class=\"emphasis\">are</span> quite extraordinary, however. No common green comets or blue spinners there. Might not this minstrel be working on a verse, a song of remembrance and hope?"},{"name":"GIGIWAZU","text":"I met what I suppose I would describe as a minstrel when last I nipped back to Ul'dah."},{"name":"GIGIWAZU","text":"He had me show him the best vantage point for the fireworks. You know, the fireworks in remembrance of the Calamity. Surely, you've noticed them about the night sky of late."},{"name":"GIGIWAZU","text":"We must mourn, and we must hope, is that not so? Elsewise we die slowly. The bards understand it the best. I would imagine this minstrel was seeking inspiration for a new verse."},{"name":"GINNADE","text":"Have I heard of the mysterious minstrel? We have not merely <span class=\"emphasis\">heard</span>─we have listened! Rest assured, we are on alert for this known troublemaker."},{"name":"GINNADE","text":"Let the record show that shortly before the Calamity, he was apprehended in La Noscea and placed in custody. The charges? Inciting a riot."},{"name":"GINNADE","text":"Further compounding his crimes, this minstrel vanished from the gaol before his guilt could be pronounced. He will be found, apprehended, and charged with prison breaking or my name is not Ginnade!"},{"name":"GINNADE","text":"We are on high alert for the infamous minstrel who disturbed the peace of La Noscea in the days before the Calamity. A most dangerous fellow is he, wanted for inciting a riot and prison breaking."},{"name":"GINNADE","text":"While it is true that he might have perished had he remained in his cell, the law is the law. There are proper channels for requesting transfer to another gaol, and I do not refer to the sewer tunnels!"},{"name":"BRAN","text":"Some bread crumbs for the little bird? I knew you were the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to drop the hint to. This gaz may be raw, but daft he's not! The minstrel was spotted in Ul'dah and Gridania, you say? Knew that already. Watchin' fireworks, though─that's new! The Calamity remembrances, I'll wager."},{"name":"BRAN","text":"And the Yellowjackets are talkin' big, uh-huh, uh-huh. That means they're not even close to catchin' the fella. Last I checked, you can't smoke out a fox with hot air. Wager you a brass buckle the minstrel's goin' to show right here in Limsa."},{"name":"BRAN","text":"So! The best vantage points for tonight's fireworks. Eagle eye, somethin' tells me you're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to hold the fort here in the Aftcastle. I'm off to swarm up the other. Won't have it be said that Bran's ma raised a laggard!"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"PETYRWINSOME","text":"（★未使用／削除予定★）"},{"name":"WANDERINGMINSTREL","text":"Fancy meeting you here, <span class=\"highlight\">Forename</span>. I am on a pilgrimage of a sort. I travel from city to city in remembrance of the Calamity, sleeping during the day to witness the fireworks by night."},{"name":"WANDERINGMINSTREL","text":"A rare and beautiful sight are these fireworks, like all night-blooming flowers. That should be the sigil of adventurers, were you a house instead of a guild. Your greatest feats are done out of sun and sight, and smell the sweeter for it."},{"name":"WANDERINGMINSTREL","text":"Do you seek me, good adventurer? Ah, you seek the mysterious minstrel..."},{"name":"WANDERINGMINSTREL","text":"That is a name I answer to, though most call me the <span class=\"emphasis\">wandering</span> minstrel. Since the Calamity, I have traveled the land celebrating the exploits of adventurers."},{"name":"WANDERINGMINSTREL","text":"There is fire in the sky again, where once death burned so brightly. I go from one remembrance to the next, singing of valor that aspires not to glory. I sing of you and yours."},{"name":"WANDERINGMINSTREL","text":"There are no coincidences left─not in this time of stealing shadows. You and I are in the right place at the right time. Come, <span class=\"highlight\">Forename</span>, tell me your tale, and I shall sing it to all the realm."},{"name":"WANDERINGMINSTREL","text":"In the shadow of shadows, the commonfolk look to the adventurers. Have blade, will travel! No job too small, no danger too great! You are the gallants of this new and uncertain age─the lords of the road."},{"name":"WANDERINGMINSTREL","text":"Your tale is the thread from which I weave my verses. A roving tale, to be sure, in need of many hours on the loom. In its stead, let me share with you the words of Louisoix Leveilleur..."},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Lances of light herald the dawn,<br>Beckoning shadows deeper still.</span>"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Splendor dances with shades<br>Unsheathed, a rime-kissed blade<br>Spills crimson o'er fields of white.<br></span>"},{"name":"WANDERINGMINSTREL","text":"How did the Seventh Astral Era <span class=\"emphasis\">dawn</span> but through the intervention of the Warriors of Light─“lances of light”? <span class=\"emphasis\">You</span> are the lances of light, the sword of the morning─you and all adventurers."},{"name":"WANDERINGMINSTREL","text":"Who better to lead Eorzea into the future but adventurers? You are the “lances of light,” make no mistake about it."},{"name":"WANDERINGMINSTREL","text":"But Archon Louisoix warned us that shadows will accompany the coming of dawn. In answer to ascendant Light, Darkness will gather in opposition...or so I interpret his words."},{"name":"WANDERINGMINSTREL","text":"What “a rime-kissed blade” signifies, I cannot yet fathom. But I have heard that roses of blood are blooming in the white fields of Coerthas, in ever greater profusion."},{"name":"WANDERINGMINSTREL","text":"We are come to a strange harvest, adventurer. I fear the lances of light are destined to cross this rime-kissed blade. Pray hearken to these next words of mine, that you might be kept from the encroaching shadows─and as a token of appreciation for all that you have done."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Huzzah</span>!"},{"name":"SYSTEM","text":"You have also unlocked the Slide I+XIV mini-game. Mark this anniversary of Eorzea's rebirth with a bout of puzzle solving."},{"name":"SYSTEM","text":"Open the toy chest in any inn room to try your hand at this popular Eorzean pastime."},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">A growing light o'er all the realm<br>Fingers bright on highlands white<br>In an instance, a blade that smites the night.</span>"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">But ill winds rise as the great gates yawn<br>Hope rides to meet what naught can cheat<br>An old despair astride a new-shod mare...</span>"},{"name":"WANDERINGMINSTREL","text":"And thus do I wander and spin my words, all for the glory of Warriors of Light─or should I say, for the glory of you?"},{"name":"WANDERINGMINSTREL","text":"I have walked the four corners of Hydaelyn, from the Gardens of Xarakish, to the floating lakes of Voor Sian Siran, but never in my travels have I borne witness to tragedy such as that which befell Eorzea."},{"name":"WANDERINGMINSTREL","text":"In the days before the Calamity, I glimpsed a world beyond the void─a new world, birthed from the ashes of the old, delivered from Darkness by the Bringer of Light. The giver of hope. You."},{"name":"WANDERINGMINSTREL","text":"See how many look to you for hope, for the promise that night will end and dawn will come again."},{"name":"WANDERINGMINSTREL","text":"What are you but a growing light, the hope that rides against despair? The rebirth of this realm is entirely because of you, the Warrior of Light."},{"name":"WANDERINGMINSTREL","text":"We who gather to watch the fireworks─we are of one mind. We are not beaten. We live in a world of unimaginable loss and overwhelming suffering, yet we have hope. It is our light in the darkness─a light with which you blessed us."},{"name":"WANDERINGMINSTREL","text":"And for that, you have my undying thanks, Warrior of Light. Mine and many others'."},{"name":"WANDERINGMINSTREL","text":"It is always darkest before dawn, they say, and we will not see dawn for a long time yet. For every day without care, you will see three where the weight of the world will be upon you, for that is your destiny..."},{"name":"WANDERINGMINSTREL","text":"...and your hero's journey."},{"name":"WANDERINGMINSTREL","text":"And when your journey comes to an end, who will you be? Though my heart longs to know, my own journey may take me to another land, down that nameless corridor of shades and sprites... Let me, then, leave you with a gift."},{"name":"WANDERINGMINSTREL","text":"Never forget what you are, <span class=\"highlight\">Forename</span>. The dawn that breaks over a realm reborn, the hope of Eorzea, the Warrior of Light..."}],"reward":{"gil":191,"emote":"Huzzah","xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1009489","obj":{"i":1009489,"n":"Bran","l":28,"q":1}},{"type":"npc","id":"1009490","obj":{"i":1009490,"n":"Wandering Minstrel","l":28,"q":1}},{"type":"npc","id":"1000938","obj":{"i":1000938,"n":"Ginnade","l":28,"q":6}},{"type":"npc","id":"1000980","obj":{"i":1000980,"n":"Gregory","l":28,"q":3}},{"type":"npc","id":"1002079","obj":{"i":1002079,"n":"Gigiwazu","l":28,"q":3}}]}