{"quest":{"name":"In a Manor of Spooking","location":"Gridania","id":67084,"patch":3.4,"sort":119,"icon":100593,"unlocksFunction":1,"eventIcon":71341,"issuer":1017835,"target":1017850,"involved":[1000148,1000946,1002280],"genre":203,"usedItems":[16778],"journal":["An investigator for the Adventurers' Guild appears in need of assistance.<br>※This quest is available for a limited time only.","An investigator from the Adventurers' Guild has asked your help in uncovering the nefarious plans of the Continental Circus─a troupe of mischievous fiends disguised as entertainers. Approach the illusionist in Mih Khetto's Amphitheatre, and learn what you can of their impending devilry.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Suspiciously eager to accept your offer of aid, the Continental Circus illusionist asks that you help prepare for the opening of their haunted manor. Your tasks will take you to the Goldsmiths' Guild in Ul'dah, the Culinarians' Guild in Limsa Lominsa, and the Carpenters' Guild in Gridania.","You have collected the commissions, and spoken with the distracted circus member. Return to the illusionist in Old Gridania and deliver the requested items.","You hand over the commissions to the waiting illusionist. She bids you wait in the area for your reward whilst she is busy organizing the final preparations. Almost immediately following this exchange however, a mysterious voice urges you to visit the place where they “work the hides of dead things” if you care for the fate of the living...","You linger outside the Leatherworkers' Guild, not sure what to expect, when you witness the arrival of the illusionist. She is soon joined by the Impresario, and, after checking to see that they are alone, they both revert to their true impish forms. They proceed to discuss their plans for the haunted manor, and of how the terror they induce within its walls will be used to call down a new Night of Devilry. Return to the investigator near the amphitheatre and report this vile scheme.","Once he has digested the details of the imps' plans, the investigator is quick to proffer a solution: convince the people that the horrors within the manor are clever illusions so that their fear will be replaced with amusement. Wishing to know more of what waits inside the haunted house, the investigator then requests that you conduct a thorough investigation of its ghostly halls. Speak once more with the illusionist, and gain entrance to the manor.","After thanking you for your assistance with the preparations, the illusionist suggests that you pay a visit to a harlequin guide if you wish to enter the haunted house. Find one of the informative circus members in either the amphitheatre or the Acorn Orchard, and learn the nature of the manor's “amusements.” Once you have explored its ghastly rooms, return to the Adventurers' Guild investigator with the evidence of your experience.","You explain to the investigator how the amusements inside the manor were designed to instill fear in unsuspecting visitors. He examines one of the cookies you earned from enduring the entertainment, and is grudgingly impressed by the imps' diabolical plan. Upon witnessing the jubilant reactions of a mother and her child after their return from the haunted house, however, the guild member concludes that his rumors have had their intended effect. And fortunately, it seems that the circus members are none the wiser for your interference.<br>Once more the mysterious voice reaches your ears, and commends you for preserving the joyful atmosphere of All Saints' Wake..."],"objectives":["Speak with the enthralling illusionist.","Speak with Jemime at the Goldsmiths' Guild.","Speak with the distracted harlequin at the Culinarians' Guild.","Speak with Corgg at the Carpenters' Guild.","Deliver the grotesque candelabras and pumpkin lanterns to the enthralling illusionist.","Lie in wait at the designated location.","Report to the Adventurers' Guild investigator.","Speak with the enthralling illusionist.","Obtain a pumpkin cookie from the Haunted Manor, and present it to the Adventurers' Guild investigator."],"dialogue":[{"name":"INVESTIGATOR01548","text":"My pardon, but you wouldn't happen to be an adventurer, would you? I'm with the Adventurers' Guild myself, and would welcome some assistance if you've the time. I'll try to be brief."},{"name":"INVESTIGATOR01548","text":"Are you familiar with the Continental Circus? It's a troupe of performers who visit Eorzea's cities around this time every year, obstensibly to add an extra dash of revelry to the All Saints' Wake celebrations."},{"name":"INVESTIGATOR01548","text":"What we've kept largely a secret, however, is that these entertaining folk are not any kind of folk at all! They are, in fact, a group of imps and other monstrous beings who employ transformative magicks to alter their appearance."},{"name":"INVESTIGATOR01548","text":"As long as they cause no trouble, we're unwilling to unmask them and ruin the festivities. But these are voidsent, after all─'twould be foolish not to keep a close eye on their activities."},{"name":"INVESTIGATOR01548","text":"And that's where I've run into difficulties. They've grown wise to my observations, and slip away whenever I approach too closely. Do you think that you might aid me with my surveillance?"},{"name":"INVESTIGATOR01548","text":"Splendid! From what I've managed to ascertain, the circus is recruiting volunteers to help with festival preparations."},{"name":"INVESTIGATOR01548","text":"Offer your services to the Auri illusionist over there in the amphitheatre, and learn exactly what these fiends are planning."},{"name":"INVESTIGATOR01548","text":"Should their intentions prove nefarious, then pray report back to me with all haste!"},{"name":"INVESTIGATOR01548","text":"Pray speak with the Auri illusionist in the amphitheatre. Pretend to cooperate with her requests, and uncover any mischief that might be afoot. I shall wait here until you return!"},{"name":"WITCH01548","text":"Greetings from the Continental Circus!<br>We─ Have we met before!? (You mortals all look alike to me...) Ahem!"},{"name":"WITCH01548","text":"Greetings from the Continental Circus! We shall make mischief with our masquerades below, even as the saints feast up above!"},{"name":"WITCH01548","text":"Our main attraction this year is an authentically spine-chilling haunted house. This will be an All Saints' Wake to remember, I promise you!"},{"name":"WITCH01548","text":"...Or at least it will be once we have the mansion properly decorated. I'm afraid the preparations are taking rather longer than we anticipated."},{"name":"WITCH01548","text":"As a matter of fact, I've been on the lookout for willing victim─ Er, volunteers!"},{"name":"WITCH01548","text":"Every helper will be rewarded with an open invitation to our monstrous manor. You'll be able to visit over and over, completely free of charge! An irresistible offer, yes?"},{"name":"WITCH01548","text":"Consider yourself recruited, then! As for your tasks, they are mostly a matter of collecting commissions from laboriously distant locations."},{"name":"WITCH01548","text":"Your first chore will take you to the Goldsmiths' Guild in Ul'dah. We ordered some gorgeously gruesome candelabras, but neglected to organize their delivery..."},{"name":"WITCH01548","text":"The second will involve a journey to the Bismarck in Limsa Lominsa. I sent one of our junior members to pick up a batch of seasonal cookies, and now I thoroughly regret the decision. Pray visit the Culinarians' Guild and see what is taking the flighty fool so long."},{"name":"WITCH01548","text":"The third and final task is also the closest: you need only walk into the Carpenters' Guild here in Gridania and collect the lanterns we requested. Simply mention decorations for the haunted house, and the receptionist should understand."},{"name":"WITCH01548","text":"Naught too complicated, I trust? Off you skitter, then!"},{"name":"WITCH01548","text":"We must have the proper atmosphere if the manor is to have the desired...effect. Hurry back with those commissions!"},{"name":"JEMIME","text":"You've come for the Continental Circus commission? Very good. I have them right here for you."},{"name":"MEMBERB01548","text":"Ah, I see─you must allow the butter and eggs to reach room temperature before mixing! This cooking business is almost as complex as spellcasting!"},{"name":"MEMBERB01548","text":"...Hm? What is it?"},{"name":"MEMBERB01548","text":"Oh, bubbling brimstone, the cookies! I was so caught up in learning recipes, I lost track of the time! The mistress will have my wings!"},{"name":"CHARLYS","text":"Sir! You dropped your─ &lt;sigh&gt; What an odd gentleman."},{"name":"SYSTEM","text":"<span class=\"emphasis\">Inducing mortal terror: a list of manor decorations.</span>"},{"name":"CORGG","text":"Ah, yes, one of our more unusual commissions. I hope the lantern design is to your liking!"},{"name":"JEMIME","text":"When the thespians placed their order, they left us a gift of this adorable lantern. I think I'll keep it on display until the end of All Saints' Wake."},{"name":"CHARLYS","text":"It's wonderful when our customers show an interest in culinary technique, but I've never met anyone so obsessed with cookies..."},{"name":"CORGG","text":"Were the lanterns sufficiently eerie? Our artisans rather enjoyed the idea of making decorations for All Saints' Wake!"},{"name":"WITCH01548","text":"How did you fare? Were all our commissions ready for collection?"},{"name":"WITCH01548","text":"Wonderful, thank you! Now we can put the finishing touches on our haunted house!"},{"name":"WITCH01548","text":"Let's discuss your reward once I've handed these things over to our workers. I shan't be long, so don't scamper too far away!"},{"name":"PUMPKIN","text":"(-Disembodied Voice-)Heh heh heh... Know you the place where they work the hides of dead things? I suggest you wait there and watch if you would safeguard the souls of the living."},{"name":"WITCH01548","text":"Why don't you go for a wander, and take in the festive sights? I shall return soon with word of your reward."},{"name":"WITCH01548","text":"(-Enthralling Illusionist-)...Impresario? Are you there?"},{"name":"IMPHEAD","text":"That overly curious mortal remains by his tree, I trust?"},{"name":"IMPHEAD","text":"You have done well. The fools will flock to our “haunted” manor, believing it a harmless attraction. And when they realize the true nature of the horrors within, their fear shall be exquisite!"},{"name":"IMPHEAD","text":"Like flies to excrement, our malevolent kin shall be drawn in droves by the stench of mortal terror. Once more shall this realm's cities be darkened by the Night of Devilry!"},{"name":"WITCH01548","text":"(-Enthralling Illusionist-)A brilliant plan, Impresario! We shall reap a harvest of dread behind a facade of innocent revelry!"},{"name":"WITCH01548","text":"(-Enthralling Illusionist-)All is in readiness! We have but to throw open the doors and invite our prey inside..."},{"name":"INVESTIGATOR01548","text":"The Night of Devilry, you say!?"},{"name":"INVESTIGATOR01548","text":"Legend has it that on such a night, a pumpkin-headed fiend raises an army of terrible demons and wreaks unimaginable havoc upon the cities of mortals..."},{"name":"INVESTIGATOR01548","text":"Nay, we cannot allow them to succeed with this fearful harvest of theirs."},{"name":"INVESTIGATOR01548","text":"...Ah, I have it!"},{"name":"INVESTIGATOR01548","text":"I shall spread word to all and sundry that the horrors they may experience within this haunted manor are mere illusion─clever magicks meant to enhance the atmosphere, and naught more!"},{"name":"INVESTIGATOR01548","text":"Should folk enter the house with such expectations, then they are far more likely to be entertained than terrified."},{"name":"INVESTIGATOR01548","text":"Pray gather some few companions and conduct an advance exploration of the manor. I would know what tricks the imps plan that we might better spin them into treats."},{"name":"INVESTIGATOR01548","text":"Once you have traversed their ghostly halls, report back here to me!"},{"name":"INVESTIGATOR01548","text":"The haunted manor awaits! ...Was there something else? Surely an adventurer with your training could not possibly be <span class=\"emphasis\">scared</span>, could you?"},{"name":"WITCH01548","text":"There were a few other matters to attend to, but our preparations are now in order! I─ Why do you stare at me so?"},{"name":"WITCH01548","text":"Ahem. Well, thanks in great part to your assistance, we are ready to fling open the doors to our haunted manor!"},{"name":"WITCH01548","text":"Before you enter, however, I suggest you speak with one of our harlequin guides─they will explain the various <span class=\"emphasis\">amusements</span> that await you inside!"},{"name":"WITCH01548","text":"You'll find a helpful circus member right here in the amphitheatre, or you might try the Acorn Orchard should you have business in New Gridania. I guarantee your manor experience will be <span class=\"emphasis\">transformative</span>!"},{"name":"SYSTEM","text":"You now have access to the Haunted Manor seasonal instance. To enter the manor, speak with the harlequin guide in either Mih Khetto's Amphitheatre or the Acorn Orchard."},{"name":"SYSTEM","text":"The Haunted Manor is a light party instance (four players). There are no class, job, or level requirements for participation."},{"name":"SYSTEM","text":"Parties that register for the instance with less than four members will be filled out automatically via the matching system."},{"name":"WITCH01548","text":"Still mustering your courage? Speak with one of our harlequin guides when you're ready to brave the manor!"},{"name":"INVESTIGATOR01548","text":"You've returned from the imps' manor, then? Tell me: what awful evils lurked within?"},{"name":"INVESTIGATOR01548","text":"...Cookies? Well, I suppose some might be tempted to face their fears again and again for the promise of more delicious baked goods. And you say they might also be used as currency for other rewards?"},{"name":"INVESTIGATOR01548","text":"Diabolical...<br>I thank you for risking your sanity for the greater good. Oh, and pray take this treat away from me ere I succumb to its crumbling sweetness."},{"name":"INVESTIGATOR01548","text":"Hark, over there. It seems others have survived their foray into the haunted house. I only hope that my efforts to undermine its terrors were successful..."},{"name":"TMARITAA","text":"It was a little frightening at first, but the monsters were so much fun! Can we go again, Mama!?"},{"name":"TDANAFA","text":"Ahahaha, it all seemed so real, didn't it? The circus folk have certainly outdone themselves this year!"},{"name":"TMARITAA","text":"(-Cheerful Girl-)It was a little frightening at first, but the monsters were so much fun! Can we go again, Mama!?"},{"name":"TDANAFA","text":"(-Motherly Miqo'te-)Ahahaha, it all seemed so real, didn't it? The circus folk have certainly outdone themselves this year!"},{"name":"WITCH01548","text":"...Fun? FUN!? They were supposed to be terrified!"},{"name":"WITCH01548","text":"I don't understand it. Our members inside the manor report that the more fiendish they behaved, the more the visitors appeared to enjoy themselves..."},{"name":"IMPHEAD","text":"Where did we go wrong? Have these mortals grown numb to fear?"},{"name":"IMPHEAD","text":"...No, they are sniveling cowards, each and every one. We must simply redouble our efforts! Their terror <span class=\"emphasis\">will</span> fuel our conquest!"},{"name":"INVESTIGATOR01548","text":"Hah! It seems our interference has gone unnoticed by the imps!"},{"name":"INVESTIGATOR01548","text":"I imagine my rumors will spread themselves as more folk visit the manor, but I'll be sure to nudge them in the right direction. Thank you again for your aid!"},{"name":"PUMPKIN","text":"Heh heh heh...<br>All their scheming come to naught. One almost feels sorry for the little devils."},{"name":"PUMPKIN","text":"I found this garb inside the manor, and will leave it here for you, brave mortal. Best are the nights when there is happiness and joy for man and monster both..."}],"reward":{"gil":694,"items":[{"id":16613}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[65781,66211]}},"partials":[{"type":"npc","id":"1017835","obj":{"i":1017835,"n":"Adventurers' Guild Investigator","l":53,"q":1}},{"type":"npc","id":"1017850","obj":{"i":1017850,"n":"Adventurers' Guild Investigator","l":53,"q":1}},{"type":"npc","id":"1000148","obj":{"i":1000148,"n":"Corgg","l":52,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1000946","obj":{"i":1000946,"n":"Charlys","l":28,"q":3,"t":"Guild Receptionist"}},{"type":"npc","id":"1002280","obj":{"i":1002280,"n":"Jemime","l":41,"q":7,"t":"Guild Receptionist"}},{"type":"item","id":"16613","obj":{"i":16613,"n":"Vampire's Vest","l":1,"c":42532,"t":35,"p":156}},{"type":"item","id":"16778","obj":{"i":16778,"n":"Stale Pumpkin Cookie","l":1,"c":24067,"t":85}},{"type":"quest","id":"65781","obj":{"i":65781,"n":"It's Probably Pirates","g":1,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"66211","obj":{"i":66211,"n":"It's Probably Pirates","g":0,"l":"Limsa Lominsa","s":91}}]}