{"quest":{"name":"Fiery Wings, Fiery Hearts","location":"Idyllshire","id":67086,"patch":3.5,"sort":5700,"eventIcon":71221,"issuer":1017656,"involved":[1018765],"genre":101,"journal":["The walking atlas has an eye to share his navigational expertise with you.","The man known as the walking atlas attempts to sell you his guiding services, only to recognize you as the lanner-taming hero he has been tasked to find. He urges you to meet his mysterious employer, who awaits you at the Snail in Idyllshire.","The mysterious employer is revealed to be none other than the wandering minstrel. The man tells you of the immortal Firebird, a king among its kind, whom he believes you can befriend owing to your mastery of the seven divine lanners. To call the creature, he gives you a whistle, which is to be used upon a rise in the southeastern reach of the Dravanian hinterlands.","Arriving at the rise, you sound the whistle. After a moment in tense silence, the mighty Firebird appears and recognizes you as its equal. The majestic sight inspires new verses within the wandering minstrel, who offers his thanks and bids you continue your adventures upon fiery wings."],"objectives":["Seek out the walking atlas's employer.","Travel to the Dravanian hinterlands and blow the Firebird whistle at the designated location."],"dialogue":[{"name":"WALKINGATLAS","text":"New to Idyllshire? Never fear! For a mere thousand gil, I will <span class=\"emphasis\">personally</span> give you a guided─<br>...I say, you look like an adventurer who knows <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> business. Might you perchance be familiar with the divine lanners?"},{"name":"WALKINGATLAS","text":"Y-You've tamed <span class=\"emphasis\">seven</span> of them? I knew you were no ordinary adventurer, but to think that you should be the very hero I sought! Please, you must allow me to be your guide!"},{"name":"WALKINGATLAS","text":"Worry not, I wouldn't dream of charging you for my services. For they are already paid for─by a well-spoken and well-dressed fellow."},{"name":"WALKINGATLAS","text":"Who is my mysterious employer, you ask? Well, if you are keen to meet him, it just so happens he is keen to meet you, too. You'll find him at the Snail, over by the Hard Place."},{"name":"WALKINGATLAS","text":"If you are keen to meet my mysterious employer, it just so happens he is keen to meet you, too. You'll find him at the Snail, over by the Hard Place."},{"name":"WANDERINGMINSTREL","text":"Ah, always a pleasure, my friend. After our encounter with the Kirin, I caught wind of a brave soul said to command a veritable flock of divine lanners. 'Tis to find that individual that I have journeyed here."},{"name":"WANDERINGMINSTREL","text":"Well, well, what brings the famous <span class=\"highlight\">Forename Surname</span> here? This humble minstrel seeks a brave soul said to command a veritable flock of divine lanners. Perhaps you have heard of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>?"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">You</span> are <span class=\"emphasis\"><span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span></span>? I find myself wholly unsurprised! Without further ado, while you are no stranger to lanners, know you of the creature that rules over them all: the immortal Firebird?"},{"name":"WANDERINGMINSTREL","text":"Appearing in Far Eastern legends, the Firebird immolates itself in death to rise again from its own ashes. A glimpse of the creature fills one with hope, it is said, while a brush of its feather bestows eternal happiness."},{"name":"WANDERINGMINSTREL","text":"Yet, for all its mesmerizing majesty, the Firebird is a lonely soul. Long has it soared the heavens in search of a companion─a hero whom this king among birds can count as its equal. Who else could that hero be but you, master to the seven divine lanners?"},{"name":"WANDERINGMINSTREL","text":"This is the Firebird whistle. It was passed to me during my journeys, and now I pass it to you. If <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who sounds it is worthy, the Firebird will answer <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> call."},{"name":"WANDERINGMINSTREL","text":"And I have no doubt that it will answer yours. I ask that you take the whistle to a vantage point, and there sound it at the heavens."},{"name":"WANDERINGMINSTREL","text":"As I did when you summoned the Kirin, I would behold the moment the Firebird descends. Such verses the sight would inspire within me!"},{"name":"WANDERINGMINSTREL","text":"When the Firebird descends, I would be present to behold the moment. Such verses the sight would inspire within me!"},{"name":"WANDERINGMINSTREL","text":"I knew I could count on you. Now, I have taken the liberty of scouting a likely location for using the whistle: the southeastern reach of the Dravanian hinterlands, upon a rise leading to Coerthas."},{"name":"WANDERINGMINSTREL","text":"Between now and the moment of the meeting, I shall make myself scarce, keeping to the shadows with bated breath. I take my leave of you."},{"name":"WANDERINGMINSTREL","text":"Beautiful beyond all imagining... The mighty Firebird is come!"},{"name":"WANDERINGMINSTREL","text":"At long last, the creature has met its match─a worthy hero to whom it would lend its wings."},{"name":"WANDERINGMINSTREL","text":"The divine lanners, the Firebird, and you... Traversing hardship and eternity, nine brilliant lives have come together to outshine the stars. 'Tis naught short of a miracle."},{"name":"WANDERINGMINSTREL","text":"High above the heavens, a king in his domain,♪<br>Soaring o'er creation, the lonely monarch reigns.♪<br>Borne upon the wind, a whistle's piercing sound,♪<br>Calls him to descend to find a soul by destiny bound.♪<br>"},{"name":"WANDERINGMINSTREL","text":"Ah, the words well up as a gushing font! I believe I have my next creation, and I owe it all to you! It shall be called...<span class=\"emphasis\">Fiery Wings, Fiery Hearts</span>!"},{"name":"WANDERINGMINSTREL","text":"But I must say, to bond with not only the Kirin, but the Firebird besides... You truly are a marvel, my friend. I am loath to take my eyes off you lest I miss a momentous moment."},{"name":"WANDERINGMINSTREL","text":"Ah, but I am not one to overstay my welcome. I shall leave you to resume your adventures. Doubtless there will be many more, with fiery wings bearing you, and I look forward to hearing of them. Till next we meet, godsspeed!"},{"name":"WANDERINGMINSTREL","text":"You truly are a marvel, my friend. I am loath to take my eyes off you lest I miss a momentous moment. But I am not one to overstay my welcome. I shall leave you to resume your adventures. Doubtless there will be many more, with fiery wings bearing you, and I look forward to hearing of them. Godsspeed!"}],"reward":{"items":[{"id":17008}],"xp":0}},"partials":[{"type":"npc","id":"1017656","obj":{"i":1017656,"n":"Walking Atlas","l":2082,"q":2}},{"type":"npc","id":"1018765","obj":{"i":1018765,"n":"Wandering Minstrel","l":2082,"q":1}},{"type":"item","id":"17008","obj":{"i":17008,"n":"Firebird Whistle","l":1,"c":26039,"t":63}}]}