{"quest":{"name":"A Thousand Blows","location":"Limsa Lominsa","id":67085,"patch":3.45,"sort":124,"icon":100594,"eventIcon":71221,"issuer":1018123,"target":1018123,"involved":[1000914,1001217,1003596],"genre":194,"journal":["The tori bugyo is desperately trying to catch your eye.<br>※This quest is available for a limited time only.","The tori bugyo and his entourage from the Far East have arrived in Eorzea and are eager to introduce their customs to the people of the West with the upcoming Heavensturn festival. To their dismay, however, their very best efforts have fallen flat, and they have been unable to stir even a passing interest in the local citizens. Deciding the only way to prevent an absolute disaster is to entice passersby to attend with free rice cakes─a customary treat from his homeland─the tori bugyo asks that you help him to spread the word.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak with several of the citizens loitering about the lower decks of Limsa Lominsa. Most of them are very enthusiastic about the idea of receiving complimentary desserts. It seems the tori bugyo has finally received the opportunity he had been hoping for. Hurry back and share with him the good news.","As you relay to the tori bugyo that his plan to lure people in with promise of free dessert has worked, you are interrupted by the arrival of the mochi daikan. The rice cake expert is completely out of breath but manages to tell you that birds have been flocking to the mochi pounding site and are devouring all the cakes meant for festival-goers. He begs you to accompany him so that together you might chase off the menacing beasts and salvage what is left of the mochi. As you make ready to leave, he tells you that he will meet you there as he must escort Jiromaru, a paissa who will help look after the rice cakes you recover, to the pounding site. Retrieve the advent cakes necessary to continue the festivities by participating in the FATE: “Pounding More Mochi, Pounding More Hearts” at either of the following locations: southeast of the Zephyr Gate in middle La Noscea or east of the Salt Strand in lower La Noscea.","You manage to rescue what is left of the advent rice cakes from the swarm of ravenous birds. There is, however, precious little time to celebrate, for the tori bugyo is eagerly awaiting your return.","The tori bugyo is elated to see you. Motioning in the direction of where Jiromaru, the mochi daikan, and the chocobo are handing out rice cakes, he tells you that your hard work is to thank for the success of this year's Heavensturn. To show you just how grateful he is for all you have done, he presents you with a─as he calls it─cock kabuto of your very own."],"objectives":["Spread the word of free desserts on the lower decks.","Report to the tori bugyo.","Retrieve advent cakes for Jiromaru by participating in the FATE “Pounding More Mochi, Pounding More Hearts.”","Report to the tori bugyo in Limsa Lominsa."],"dialogue":[{"name":"BIRDMISSIONARY","text":"A moment, if you please, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>! You are not, perchance, one of these esteemed Eorzean adventurers I hear so much about, are you?"},{"name":"BIRDMISSIONARY","text":"Aha! What astounding luck! You see, I am the tori bugyo come from distant lands to share with your people our Heavensturn customs. Unfortunately, I have been finding it nearly impossible to arouse any interest in our festivities."},{"name":"BIRDMISSIONARY","text":"While we were aware before arriving on your soils that our styles of celebration differ greatly, never did we imagine we'd be met with such indifference. To the contrary, given that this is the year of the cock, we were convinced your people would embrace us with open arms. After all, Eorzea is home to some of the biggest cocks in the realm─chocobos."},{"name":"BIRDMISSIONARY","text":"Yet every time I approach the citizens to ask them if they would join me, and together usher in the new year with this virile beast, all I receive are mumbled excuses or disapproving scowls as they quickly rush away."},{"name":"BIRDMISSIONARY","text":"I thought the problem perhaps originated with the fact that I was doing too much telling and not enough showing, and to remedy the situation, had <span class=\"emphasis\">this</span> forged."},{"name":"BIRDMISSIONARY","text":"Simply smashing, isn't it? Who, I thought, would be able to resist the allure of this fine creature? Alas, when I asked passersby if I might present them with a lovely yellow cock, I was met with irritated groans and affronted gasps. When I invited them to <span class=\"emphasis\">touch</span> this most prized of Far Eastern treasures, their response was even less enthusiastic."},{"name":"BIRDMISSIONARY","text":"Rather than risk incurring further offense, I have decided to redirect our efforts and instead bring our people together with desserts! And what better way to do so than with the crown jewel of Far Eastern treats─the rice cake! For that to happen, however, we must first make mochi! I don't suppose you're familiar with the practice of mochi pounding?"},{"name":"CHOICE1Q1","text":"Are you familiar with the practice?"},{"name":"CHOICE1A1","text":"Of course!"},{"name":"CHOICE1A2","text":"I can't say that I am..."},{"name":"BIRDMISSIONARY","text":"To think that you're not only a great adventurer but also one who is so well versed in the art of mochi pounding! Why, the fates themselves couldn't have arranged a more fortuitous encounter."},{"name":"BIRDMISSIONARY","text":"An esteemed adventurer who is both compassionate and already aware of this unique Far Eastern tradition! Why, it would seem my luck today knows no bounds!"},{"name":"BIRDMISSIONARY","text":"Well, I suppose it then falls to me to explain! Mochi pounding is the process employed to produce mochi─or rice cakes─as they are better known here. They are usually made by pouring bowls of steaming rice into a large mortar, where they're then hammered into a soft, white paste. In the Far East, these mouthwatering sweets are considered a harbinger of good luck."},{"name":"BIRDMISSIONARY","text":"If the last Heavensturn festival is anything to go by, there's nothing better at bringing people together than rice cakes fresh from the mortar! By distributing these to the masses we are sure to enjoy the same amount of success!"},{"name":"BIRDMISSIONARY","text":"Since nothing satisfies the stomach and warms the heart like freshly pounded rice cakes, we have decided to distribute them to the masses. Once they've had a taste, they'll not be able to resist the temptation to come back for more!"},{"name":"BIRDMISSIONARY","text":"And that is why I stopped you, my friend! You see, after my countless failures I feel it best for me to retire from the front lines of this campaign and leave it to those who have the charm I seem to lack to advertise our sweets. Please, <span class=\"alternative-container\"><span class=\"alternative\">my good lady</span><span class=\"alternative\">my good sir</span></span>, will you help me spread the word?"},{"name":"BIRDMISSIONARY","text":"Wonderful, simply wonderful! Seeing as I have already dispatched some of my delegates to appeal to the citizens on the upper decks, I would ask that you use that delightful smile of yours to persuade those down below."},{"name":"BIRDMISSIONARY","text":"No doubt, with a realm-renowned adventurer such as yourself advocating us nothing can go wrong! Haha! I see it already─throngs of people lining up, mouths frothing in anticipation! Our mochi daikan will be beyond pleased."},{"name":"RICECAKEREEVE","text":"Did I perhaps hear my na─ Oho! Well, if it isn't <span class=\"highlight\">Forename Surname</span>! Aren't you a sight for sore eyes. The call of making rice cakes was too great to resist, I take it? Well, that makes two...or four of us, rather."},{"name":"RICECAKEREEVE","text":"I managed to convince a couple of the cyclopes from the last Heavensturn to assist me once again with the mochi pounding. Assuming you've already agreed to help, with both them and you at our side, the year of the cock is certain to be a resounding success!"},{"name":"RICECAKEREEVE","text":"Did I perhaps hear my name? Ah─and who might you be? <span class=\"highlight\">Forename Surname</span>? Well, good to meet you. I am the mochi daikan, come to Eorzea to introduce a little Far Eastern delight known as mochi."},{"name":"RICECAKEREEVE","text":"I've convinced a couple cyclopes to assist us with the mochi pounding, so while you spread word to the citizens, I shall go and set them to work. I assure you they won't be disappointed─there's nothing so tasty as mochi, which has been freshly pounded by a set of powerful arms!"},{"name":"BIRDMISSIONARY","text":"As you can see, the production of our rice cakes is in safe hands! Now all that's left to do is alert the people to the fact that free desserts are on their way!"},{"name":"RICECAKEREEVE","text":"Our other assistants will be making rounds up above to announce the good news, so I would ask that you try and persuade those on the lower decks."},{"name":"RYSSFLOH","text":"Spit it out, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I haven't the time to cater to each and every adventurer who passes this way now."},{"name":"RYSSFLOH","text":"Ah! Why didn't you say so sooner─of course I'll be there! Hahaha! As you can see for yourself, I'm never one to turn down free food!"},{"name":"SWOZBLAET","text":"A fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Are you looking to purchase anything in particular, or are you simply interested in browsing our wares?"},{"name":"SWOZBLAET","text":"Oho! A festival, with complimentary desserts to boot!? You can bet your left leg I'll be there! Those of us on Hawkers' Alley are always on the prowl for a bargain and there's no better deal than free."},{"name":"RBAHARRA","text":"Why, hello there! What brings you to Mealvaan's Gate?"},{"name":"RBAHARRA","text":"Oh, goodness me! Is it that time of year already? Well, I'd best finish my work here so I can join the festivities!"},{"name":"RYSSFLOH","text":"I've begun to put on a bit of weight of late, but a couple of these Far Eastern rice cakes shouldn't hurt me!"},{"name":"SWOZBLAET","text":"The thought of free treats is enough to motivate anyone to attend! I'll be sure to let the others know─I'm certain most folk here will jump at the chance!"},{"name":"RBAHARRA","text":"I feel like a little girl again─I haven't been this excited about anything in ages!"},{"name":"BIRDMISSIONARY","text":"<span class=\"highlight\">Forename</span>, you have finally come! Tell me, were the people thrilled by the news?"},{"name":"BIRDMISSIONARY","text":"Fantastic! We must tell the mochi daikan right away! He has toiled day and night to─ Ah, never mind. It seems he's already heard. Haha! Look─he's so excited he's running this way at full tilt!"},{"name":"RICECAKEREEVE","text":"Birds... &lt;pant&gt; Birds, sir... &lt;pant&gt; Droves of 'em─all coming to steal our rice cakes! &lt;pant&gt;"},{"name":"BIRDMISSIONARY","text":"Wh-What!? Y-You can't possibly be serious!"},{"name":"RICECAKEREEVE","text":"Of course I'm serious! Would I have run all this way if I wasn't!? Can't you see we don't have much time and I'm in desperate need of your help─or perhaps..."},{"name":"RICECAKEREEVE","text":"<span class=\"emphasis\">You</span>! Yes, <span class=\"highlight\">Forename</span>! You look like you'd be able to hold your own against the birds and rescue our mochi! Please, might you accompany me back to the site?"},{"name":"BIRDMISSIONARY","text":"What is it boy? What's the matter?"},{"name":"RICECAKEREEVE","text":"I think... I think he means to say he wants to come with us. Very well, then."},{"name":"RICECAKEREEVE","text":"Before we head off to the pounding site, however, there is one more stop I must make! <span class=\"highlight\">Forename</span>, perhaps you remember the splendid creature that is Jiromaru? I shall go and fetch him, that we might rely upon his expertise in the retrieval of rice cakes."},{"name":"RICECAKEREEVE","text":"Before we head off to the pounding site, however, I must first go and fetch my paissa, Jiromaru. His expertise in the retrieval of rice cakes is unparalleled and will no doubt prove invaluable upon the field!"},{"name":"RICECAKEREEVE","text":"Allowing a monkey to help with the opening festivities of the year of the cock will invite a mountain of misfortune, you say? Ah, yes indeed. Your confusion is not unwarranted. While in Eorzea paissas are commonly thought of as monkeys, 'tis not necessarily so in other parts of the realm."},{"name":"RICECAKEREEVE","text":"Allow me to explain. You see, the paissa is possessed of a grace unlike any other creature. Why, such is their agility, these animals swinging from tree to tree is often likened to that of a large bird in flight. As such, we consider these feathered simians to be more bird than monkey."},{"name":"RICECAKEREEVE","text":"But I digress! We have much more pressing matters at hand. Adventurer, please find your way to the mochi pounding site. I shall bring Jiromaru, as well as our eager chocobo friend and rendezvous with you there."},{"name":"BIRDMISSIONARY","text":"All our hard work─it will have been for nothing if we don't stop them! Please, my friend, go with the mochi daikan and save what is left before it's too late!"},{"name":"BIRDMISSIONARY","text":"Ah, our hero has returned! <span class=\"highlight\">Forename</span>, I cannot put to words how much I appreciate all you have done for us. Just look at all the joy you have spread to the people of Eorzea!"},{"name":"BIRDMISSIONARY","text":"Thanks to you, the mochi daikan's late nights training with the cyclopes have finally paid off, and the buds of friendship between the East and the West have begun to fully blossom!"},{"name":"BIRDMISSIONARY","text":"But not only that─it looks as though our chocobo friend and Jiromaru have formed a special bond of their own."},{"name":"BIRDMISSIONARY","text":"Your extraordinary kindness saw us through our darkest hour and is what made this Heavensturn so spectacular!"},{"name":"BIRDMISSIONARY","text":"And for all your hard work, I would like to present to you this─your very own cock kabuto! Wear it with pride, my friend!"},{"name":"BIRDMISSIONARY","text":"Now the festivities aren't over just yet, so it's time you enjoyed for yourself what this most merry of seasons has to offer. You have more than earned it!"},{"name":"BIRDMISSIONARY","text":"Oh, but if for whatever reason you find yourself in want of something more to do, I'm sure our mochi daikan would be eager to have an extra pair of hands to help with the remainder of the rice cakes!"}],"reward":{"gil":267,"items":[{"id":16614},{"id":16615}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1018123","obj":{"i":1018123,"n":"Tori Bugyo","l":28,"q":1}},{"type":"npc","id":"1000914","obj":{"i":1000914,"n":"R'baharra","l":29,"q":2}},{"type":"npc","id":"1001217","obj":{"i":1001217,"n":"Swozblaet","l":29,"q":7}},{"type":"npc","id":"1003596","obj":{"i":1003596,"n":"Ryssfloh","l":29,"q":2}},{"type":"item","id":"16614","obj":{"i":16614,"n":"Red Tori Kabuto","l":1,"c":40241,"t":34,"p":94}},{"type":"item","id":"16615","obj":{"i":16615,"n":"Black Tori Kabuto","l":1,"c":40242,"t":34,"p":94}}]}