{"quest":{"name":"Arms Wide Open","location":"Idyllshire","id":67087,"patch":3.55,"sort":5701,"unlocksFunction":1,"eventIcon":71341,"issuer":1012299,"target":1019615,"genre":101,"journal":["Geimlona is concerned for the pecuniary fortunes of a friend.","Your arrival heartens Geimlona, who had been looking to ask a personal favor of an accomplished crafter like yourself. As she tells it, an enterprising young trader formerly employed at the House of Splendors recently paid off her debt to Rowena and struck out on her own, and the sisters would see to it that the girl's new venture is a success. Vowing to offer what aid you can, you set out for the Hard Place to seek out one Zhloe Aliapoh.","The enthusiastic─if easily distracted─Zhloe Aliapoh eagerly regales you with stories of her dream of running an orphanage, while lamenting the financial woes that have thwarted her plans thus far. She asks for your aid in procuring exotic treasures that she might then unload on her most affluent customers, thus securing the necessary funds to keep Menphina's Arms thriving. To ensure a mutually beneficial arrangement, she offers to pay for every item you deliver in scrips that can be redeemed at her good friend and associate Rowena's House of Splendors. Seeing no cause to doubt her zeal and business acumen, you resolve to do your part to help the girl achieve her most admirable goal."],"objectives":["Speak with Zhloe Aliapoh at the Hard Place."],"dialogue":[{"name":"GEIMLONA","text":"Well, if it ain't one of our most reliable collectors. Got anythin' good for us <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">today</span></span>? ...Actually, hold that thought. Just remembered that <span class=\"emphasis\">I've</span> got somethin' for <span class=\"emphasis\">you</span> for a change─a favor to ask."},{"name":"GEIMLONA","text":"You wouldn't happen to know a girl by the name of Zhloe Aliapoh, would you? Sweet little thing. Born into poverty, she worked her tail off for my sister until she'd paid off every last gil of her family's debts. Recently, she struck out on her own, rentin' out a corner of the Hard Place to run her own shop."},{"name":"GEIMLONA","text":"Girl's got a nose for coin that's a match for anyone in the realm. But she can also be a bit scatterbrained, which is what's keepin' us up at night. We'd like nothin' more than to stick by her side till she gets her new operation off the ground, but needless to say, we've got plenty on our own plates."},{"name":"GEIMLONA","text":"That's where you come in. So what do you say? Think you could pay Zhloe a visit and see that the girl's makin' ends meet? It'd mean a whole lot to Rowena and me."},{"name":"ZHLOEALIAPOH","text":"Why, yes, I'm Zhloe Aliapoh! However did you know? Am I famous? That's so exciting! And also somewhat terrifying. But most certainly exciting! Oh, but pray tell, whoever might you be?"},{"name":"ZHLOEALIAPOH","text":"Mistress Geimlona sent you to look after me? Why, how sweet of her to ask! And you to come, of course! Speaking of sweets, have you tried Adkiragh's pineapple pudding? It's so smooth and sensuous and...but where was I? Oh, of course! I'm doing quite well─thank you for asking!"},{"name":"ZHLOEALIAPOH","text":"With a loan I took out from Mistress Rowena, I rented out a room here in the cellars of the Hard Place. Can you guess what I'm using it for? Actually, let me just tell you! I'm running an orphanage! I call it Menphina's Arms! Because it's like, She's holding the orphans and keeping them safe─in Her arms. Get it?"},{"name":"ZHLOEALIAPOH","text":"I'm still new to this, but I've already learned so much! For one thing, running an orphanage is really expensive! So I've had to skimp on a few luxuries─food, clothing, and the like. Why, the last thing <span class=\"emphasis\">I</span> ate was Adkiragh's pineapple pudding, and I had to make a single bowl last the week! It <span class=\"emphasis\">was</span> a rather <span class=\"emphasis\">large</span> bowl, mind you. But still!"},{"name":"ZHLOEALIAPOH","text":"But this isn't about me! It's about the children, and everything I could be doing for them if only I had more gil in my coffers! Don't worry, though─Zhloe has a plan!"},{"name":"ZHLOEALIAPOH","text":"What sort of plan, you ask? You're looking at it! I've started my trading business, right here in this little corner of the Hard Place! I acquire rare treasures and relics from the realm over, and sell them to wealthy collectors for princely sums! Oh, if only I could marry a prince, all my worries would be─wait, what were we talking about?"},{"name":"ZHLOEALIAPOH","text":"Hm? What's in it for my suppliers, you ask? I was just getting to that! Seeing as how I'm on such good terms with Mistress Rowena, you see, I was thinking I could pay them back in scrips they could spend at the House of Splendors! I haven't actually <span class=\"emphasis\">asked</span> her yet, of course, but I'm sure she'll say yes. Did I mention that we were really, really good friends?"},{"name":"ZHLOEALIAPOH","text":"You know a thing about crafting, too? I knew this was Zhloe's lucky day! Almost as lucky as the day when that nice old man paid ten times what that stone was worth─a whole 100 gil!─just because I reminded him of his granddaughter! Anyhow, what do you say? You can be Zhloe's number one procurement specialist! You'll do it, won't you? For the children?"},{"name":"ZHLOEALIAPOH","text":"Oh, you're the best! The absolute best! I knew it the moment I saw your face. With you on my side, Zhloe's House of Almost-splendors─I'm still working on the name─will be turning a profit in no time, and Menphina's Arms will spread wide to hold every poor orphan in a loving embrace!"},{"name":"ZHLOEALIAPOH","text":"Anyhow, let's make this official. <span class=\"highlight\">Forename</span>, was it? Zhloe is oh so looking forward to doing business with you!"},{"name":"ZHLOEALIAPOH","text":"Did I say that for every collectable you bring to me, I'll pay you in scrips redeemable at Rowena's House of Splendors? I did? Good! Because that's exactly what I'll be doing! Provided Rowena approves, of course. Which she will. I promise!"},{"name":"ZHLOEALIAPOH","text":"That's how Rowena pays <span class=\"emphasis\">her</span> hardworking employees, after all. No gil, just scrips. Why, I can still remember her counting them out─one scrip, two scrips, red scrips, blue scrips! She'll be positively thrilled that Zhloe's following in her footsteps. I just know it!"},{"name":"ZHLOEALIAPOH","text":"I see the sparkle of curiosity in your eye! “But, Zhloe,” you ask. “Without any gil to your name, however did you purchase food, drink, and other basic essentials of daily life?” You weren't wondering that? Well, Zhloe will tell you anyway!"},{"name":"ZHLOEALIAPOH","text":"At Rowena's House of Splendors, you can purchase an enormous flagon of pineapple juice for the low, low price of only one hundred and thirty scrips! And who needs food when you have pineapple juice? Not Zhloe, that's for sure! Mmm, pineapples..."},{"name":"ZHLOEALIAPOH","text":"But where were we? Oh, you're probably wondering exactly what sort of treasures I'm looking for. Well, I'd be happy to explain! Zhloe has her eyes set on exotic treasures of Near Eastern make and design!"},{"name":"ZHLOEALIAPOH","text":"A little bird told Zhloe that Near Eastern culture is all the rage among the Ishgardian nobility these days, and who is Zhloe to disappoint such potentially <span class=\"emphasis\">generous</span> customers? I'm counting on you, friend! And remember─so are the children!"},{"name":"SYSTEM","text":"This quest will become available on [Reset]<span class=\"alternative-container\"><span class=\"alternative\">Sunday</span><span class=\"alternative\">Monday</span><span class=\"alternative\">Tuesday</span><span class=\"alternative\">Wednesday</span><span class=\"alternative\">Thursday</span><span class=\"alternative\">Friday</span><span class=\"alternative\">Saturday</span></span> at <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">1</span><span class=\"alternative\">2</span><span class=\"alternative\">3</span><span class=\"alternative\">4</span><span class=\"alternative\">5</span><span class=\"alternative\">6</span><span class=\"alternative\">7</span><span class=\"alternative\">8</span><span class=\"alternative\">9</span><span class=\"alternative\">10</span><span class=\"alternative\">11</span><span class=\"alternative\">12</span></span></span><span class=\"alternative\">12</span></span> <span class=\"alternative-container\"><span class=\"alternative\">p.m.</span><span class=\"alternative\">a.m.</span></span> (Earth time)."}],"reward":{"gil":518,"items":[{"num":3,"id":4721},{"num":3,"id":4688}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":35}],"quests":[67634]},"next":[68713]},"partials":[{"type":"npc","id":"1012299","obj":{"i":1012299,"n":"Geimlona","l":2082,"q":4}},{"type":"npc","id":"1019615","obj":{"i":1019615,"n":"Zhloe Aliapoh","l":2082,"q":1}},{"type":"item","id":"4721","obj":{"i":4721,"n":"Bouillabaisse","l":55,"c":24111,"t":46}},{"type":"item","id":"4688","obj":{"i":4688,"n":"Landtrap Salad","l":55,"c":24151,"t":46}},{"type":"quest","id":"67634","obj":{"i":67634,"n":"Go West, Craftsman","g":95,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"68713","obj":{"i":68713,"n":"Between a Rock and the Hard Place","g":101,"l":"Idyllshire","s":5702,"f":1}}]}