{"quest":{"name":"Sing Me Another Song","location":"Mor Dhona","id":67095,"patch":2.3,"sort":502,"icon":112041,"unlocksFunction":1,"eventIcon":71341,"issuer":1006950,"target":1008278,"genre":95,"journal":["In a place such as Revenant's Toll, information must flow along with wine. Why not linger downstream of Alys for a spell?","Even after moons of pensive strumming, the wandering minstrel still refuses to budge from his spot in the Seventh Heaven, ever bent on collecting the makings of a new epic. Heed Alys's counsel and speak with this gilder of lilies, for the commonfolk are in sore need of even a fool's gold.","You recount to the bard your foray into the lightless depths of Dalamud's Shadow, and are amazed to see the leaden horror of those hours transmuted to gold by the minstrel's gifts. The power of poetry is such that you can now relive the experience, should you so choose.<br><br>※The Second Coil of Bahamut (Savage) may be accessed via the Duty Finder."],"objectives":["Speak with the wandering minstrel."],"dialogue":[{"name":"ALYS","text":"What'll it be, <span class=\"highlight\">Forename</span>? You know, if you have a second, a certain patron of mine's been itching to have a word with you─our friend the bard here."},{"name":"ALYS","text":"He says he needs <span class=\"emphasis\">inspiration</span> that only an adventurer's tale could provide. Plain lacking in imagination, if you ask me, but he's not a bad sort. Wandering or not, he never tries to pay in song what he owes in copper."},{"name":"ALYS","text":"Anyway, if you're so inclined, I'm sure he'd be glad to hear all about one of your more impressive exploits."},{"name":"WANDERINGMINSTREL","text":"<span class=\"highlight\">Forename</span>, can it be you? You've outdone yourself since last we met, that much I've heard."},{"name":"WANDERINGMINSTREL","text":"They say you sojourned to Dalamud's Shadow, yet live to tell the tale!"},{"name":"WANDERINGMINSTREL","text":"I was in these parts at the time, and felt a disturbance in the aether. It was the White Raven himself, you say? Ah, no wonder!"},{"name":"WANDERINGMINSTREL","text":"Tell me more, my good <span class=\"highlight\">Forename</span>! Recount to me your journey through the Shadow... Take me there, on the wings of memory and imagination!"},{"name":"WANDERINGMINSTREL","text":"Your stirring tale has...has...<span class=\"emphasis\">stirred</span> me! Lo, I am as a cauldron bubbling fragrantly in the great kitchen of a castle keep. A stew of inspiration─a slew of verses!"},{"name":"WANDERINGMINSTREL","text":"Listen, my good adventurer, and listen well,<br>for the song I sing is of your tell."},{"name":"WANDERINGMINSTREL","text":"Into the flesh of Darkness go bringers of Light,♪<br>for the flame that flickers in Bahamut's tomb.♪<br>In that cloying black stirs a raven white,♪<br>clawing blood from a barren womb.♪"},{"name":"WANDERINGMINSTREL","text":"What was slain in silver proud did in golden malice rise.♪<br>Metals of infamy and ruin, that every hero must despise.♪"},{"name":"WANDERINGMINSTREL","text":"What say you? Is this not exactly how you told it to me?"},{"name":"WANDERINGMINSTREL","text":"Ah, but you forget, I am a poet! We read between the lines, rendering into words that which was left unspoken. Lest you wonder, I shall name this composition “Shadow of the Raven.”"},{"name":"SYSTEM","text":"Thanks to the musical stylings of the wandering minstrel, you can now relive your foray into the Second Coil of Bahamut."},{"name":"SYSTEM","text":"Second Coil of Bahamut (Savage) may be undertaken by speaking with Anaelle at Fallgourd Float."},{"name":"SYSTEM","text":"Please note that there are no enhanced rewards available for the Second Coil of Bahamut (Savage)."},{"name":"SYSTEM","text":"If you choose to undertake this challenge, it will be purely for honor and glory."},{"name":"SYSTEM","text":"Thanks to the musical stylings of the wandering minstrel, you can now relive your foray into the Second Coil of Bahamut."},{"name":"SYSTEM","text":"As the name suggests, the Second Coil of Bahamut (Savage) is a brutally difficult version of the raid of the same name."},{"name":"SYSTEM","text":"If you choose to undertake this challenge, it will be purely for honor and glory."}],"reward":{"gil":405,"instance":30012,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"instances":[30010],"quests":[66844]}},"partials":[{"type":"npc","id":"1006950","obj":{"i":1006950,"n":"Alys","l":67,"q":7}},{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"instance","id":"30012","obj":{"i":30012,"n":"The Second Coil of Bahamut (Savage) - Turn 1","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":105}},{"type":"instance","id":"30010","obj":{"i":30010,"n":"The Second Coil of Bahamut - Turn 4","c":61802,"t":"Raids","min_lvl":50,"max_lvl":50,"min_ilvl":105}},{"type":"quest","id":"66844","obj":{"i":66844,"n":"The Ultimate Ballad","g":95,"l":"Mor Dhona","s":501,"f":1}}]}