{"quest":{"name":"Let the Hunt Begin (Twin Adder)","location":"Gridania","id":67099,"patch":2.3,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1009294,"target":1009152,"genre":191,"journal":["One man's scourge is another man's chance to splurge, and Lieutenant Scarlet can help you find reason in this rhyme.","Lieutenant Scarlet informs you that the Eorzean Alliance has instituted a bounty system called the Hunt. For the finer points of this most profitable venture, you must speak with the Hunt billmaster within the Adders' Nest.","The Hunt billmaster has briefed you on the fundamentals of the Hunt. Whether you seek more advice or wish to spend your hard-earned Allied Seals, he is the man with whom you must speak. Do your part to preserve the peace, and you will be richly rewarded."],"objectives":["Speak with the Hunt billmaster at the Adders' Nest."],"dialogue":[{"name":"SCARLET","text":"Gloryhounds such as yourself will be pleased to have this news from the powers that be: the Eorzean Alliance has established a new system known as the Hunt."},{"name":"SCARLET","text":"We never lack for creatures and men that disturb the sylvan serenity. Henceforth these miscreants shall be <span class=\"emphasis\">marked</span> for felling, and whoever deals the blow shall collect a reward. 'Tis a bounty system, when all's said and done."},{"name":"SCARLET","text":"The Alliance makes much of this joining of sword hands, while allowing rivalries to go unchecked elsewhere. Small wonder that some see a bent branch where we claim a bough true and proud."},{"name":"SCARLET","text":"But these are matters for our betters to ponder. For now, you may serve by offering the Hunt your considerable talent for slaughter."},{"name":"SCARLET","text":"The bounty is rich, and you stand to gain much for your services. But don't take my word for it─speak with the Hunt billmaster to learn of rewards and other such details."},{"name":"SCARLET","text":"The Hunt is a bounty system when all's said and done, and a rich bounty it is indeed. Ask the Hunt billmaster if you would know more."},{"name":"MOBOFFICER","text":"Here to join the Hunt, are you? Excellent, excellent. I'll get right into the explanation."},{"name":"MOBOFFICER","text":"First things first, you'll want to take a look at this Hunt board. There are bills for all sorts of marks here."},{"name":"MOBOFFICER","text":"There are <span class=\"emphasis\">two</span> kinds of bills. The kind for regular marks and the kind for elite marks. The second of these are the more <span class=\"emphasis\">notorious</span> sort. Before you go after one of them, I recommend you consult a hunter-scholar. These people are veterans of the Hunt who can recite the Raimdelle Codex by heart."},{"name":"MOBOFFICER","text":"Once the Hunt's done, you'll receive tokens called Allied Seals, which you can exchange for exclusive wares."},{"name":"MOBOFFICER","text":"If any of that got stuck going down, you're welcome to come back and ask again...and again, no doubt. I can attend to any Allied Seals you'd like to spend as well."},{"name":"MOBOFFICER","text":"Wood's will be done, <span class=\"alternative-container\"><span class=\"alternative\">friend</span><span class=\"alternative\">[GC Rank]</span></span>. If I don't hear from you soon, I'll take it you weren't Hunt material...or that a mark got the best of you. Oh, do cheer up. Better to die once than live ever in shame."}],"reward":{"gil":433,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"gc":2,"gcrank":9},"next":[67655]},"partials":[{"type":"npc","id":"1009294","obj":{"i":1009294,"n":"Scarlet","l":52,"q":7,"t":"Serpent Lieutenant"}},{"type":"npc","id":"1009152","obj":{"i":1009152,"n":"Hunt Billmaster","l":52,"s":4,"q":1,"r":1,"a":591,"c":[9.76,11.32]}},{"type":"quest","id":"67655","obj":{"i":67655,"n":"Let the Clan Hunt Begin","g":96,"l":"Ishgard","s":15301,"f":1}}]}