{"quest":{"name":"The Nightmare's End","location":"South Shroud","id":67093,"patch":3.35,"sort":500,"icon":100576,"unlocksFunction":1,"eventIcon":71341,"issuer":1000334,"target":1017259,"involved":[1017256,1017257,1017258],"genre":86,"journal":["The Wood Wailer is convinced he knows you, and has heard your name somewhere before.","Word of your exploits in the Palace of the Dead has spread, and a Wood Wailer stops you to speak of his men's praises. He also broaches the subject of a peculiar fellow down at Buscarron's Druthers. For the past several days, this drunkard has been spouting nonsense of the supernatural, and mumbling about you. Assuming you two to be friends, the Wood Wailer asks that you go to the Druthers and see what you can do to console this ale-sodden soul.","You find the gentleman in question who, failing to look up from his mug, demands you bring him another bottle of ale. However, when he hops down from his chair, you realize it is Paiyo Reiyo, whom you once rescued from the Tam–Tara Deepcroft. He tells you he has been plagued by thoughts of Edda ever since and is taken aback when you tell him of your encounter with the fallen mage in the Palace of the Dead. You hand him her engagement ring and a look of remorse passes his face. After a few moments, he then asks you to accompany him outside.","Tormented night after night by nightmares of Edda and her beloved, Paiyo Reiyo had decided to hold a small remembrance service for them, hoping to lay their spirits to rest. The problem, however, was that there were no bodies to bury─a problem for which he found a solution the moment he thought of Edda's ring. He plans to use their engagement rings for the service. All he requires now is Avere's ring, which just so happens to be in the river near Buscarron's Druthers.","You search along the riverbank and find a pair of rusted gauntlets. While examining them, you manage to dislodge a ring from within one. Take it to Paiyo Reiyo and see if it is what he has been searching for.","Paiyo Reiyo is beside himself with excitement when you show him the ring. He decides on a place to bury their keepsakes, eventually settling on Summerford. From there one can gaze upon all of Limsa Lominsa, the place where the two lovers first met.","Having lain the rings gently in the soil, Paiyo Reiyo offers up a prayer, hoping Edda and Avere have at last found peace in the great beyond. He thanks you and promptly takes his leave, heart unburdened and mind at ease. As you turn to follow, a soft wind blows, carrying what sounds like a whisper on the breeze. Perhaps it was your imagination. You stop to take one last look at Limsa, knowing that Edda is finally in a better place."],"objectives":["Search for the drunken Lalafell at Buscarron's Druthers.","Speak with Paiyo Reiyo.","Retrieve Avere's ring from the rusted gauntlets.","Show Avere's ring to Paiyo Reiyo.","Speak with Paiyo Reiyo at Summerford."],"dialogue":[{"name":"BALAN","text":"I say, aren't you that adventurer who's been exploring the Palace of the Dead? <span class=\"highlight\">Forename</span>, isn't it? You've caused quite a stir among the men. Indeed, everyone in the Shroud speaks of your daring. Some more favorably than others..."},{"name":"BALAN","text":"You see, there's this Lalafell who came to Buscarron's Druthers a few days past. He practically lives in the tavern now, always deep in his cups, muttering about dead friends and vengeful spirits. He mentioned your name amidst his ramblings. Several times, in fact."},{"name":"BALAN","text":"We usually pay no mind to drunkards at the tavern, but to be frank, he's become something of a nuisance. Perhaps you could speak with him? If the gods are good, you'll catch him in a moment of sobriety."},{"name":"BALAN","text":"Please see what you can do about that poor drunken soul. I fear before long he'll anger the other patrons."},{"name":"PAIYOREIYO","text":"Barkeep! Another bottle. The <span class=\"emphasis\">strong</span> stuff this time! How's a man to drown his troubles in this─hic!─tepid piss you call ale? I said─hic!─huh?"},{"name":"PAIYOREIYO","text":"<span class=\"highlight\">Forename</span>...? That the gods would─hic!─deliver you to me a third time! If anyone can help me, surely it's you."},{"name":"PAIYOREIYO","text":"After our ordeal in the Tam–Tara Deepcroft, I tried to return home, but it's no use. Try as I might I cannot stop thinking about her. About Edda..."},{"name":"PAIYOREIYO","text":"You <span class=\"emphasis\">saw</span> her!? When? Where?"},{"name":"PAIYOREIYO","text":"This...this is her engagement ring! I'd recognize the design anywhere."},{"name":"PAIYOREIYO","text":"She would always keep this in her breast pocket for fear it would get dirty on our outings. Strange that it would find its way to you. Back to this place. Hmmm..."},{"name":"PAIYOREIYO","text":"I realize this is sudden, but would you accompany me to the bridge just outside? I'd like you to help me with something."},{"name":"PAIYOREIYO","text":"Thank you for coming. I thought my heart would burst from my chest when I laid eyes on that ring. Would that I could forget the horrors of that damnable crypt. Seems the best I can do is drown them in ale. &lt;sigh&gt; Perhaps this is punishment for the way we treated her."},{"name":"PAIYOREIYO","text":"Every night when I close my eyes I can still see them. Edda with her ghastly grin... And that abomination she dared to call Avere."},{"name":"PAIYOREIYO","text":"The dream is always the same. “We wish to return home,” they tell me. I fear if I don't grant this request, they will haunt me till my dying day."},{"name":"PAIYOREIYO","text":"My first thought was to hold a small remembrance service of sorts to honor them. Then I asked myself: what good would that do without bodies, or even a keepsake?"},{"name":"PAIYOREIYO","text":"Then I remembered their engagement rings, a symbol of their innocence and purity, of a time before this calamity befell them. With those in hand, I could do my part to put their souls to rest."},{"name":"PAIYOREIYO","text":"Of course, that would have meant returning to that awful place, to seek out and retrieve the ring from her...from her... &lt;shudder&gt;"},{"name":"PAIYOREIYO","text":"I cursed myself for running away the last time we met. If I had stayed, with you at my side, perhaps I could have found the courage to try."},{"name":"PAIYOREIYO","text":"Yet fate has conspired to bring you here, and with Edda's ring! Now we need only find Avere's to complete the set."},{"name":"PAIYOREIYO","text":"Now I know what you're thinking, and no, I will not ask you to accompany me back to the Tam–Tara Deepcroft. Thankfully, that won't be necessary."},{"name":"PAIYOREIYO","text":"You see, the night before our fateful foray into the Deepcroft, Avere and I went to the Druthers for perhaps one too many drinks. We stumbled outside in a drunken stupor, and it was here that he fell into the river."},{"name":"PAIYOREIYO","text":"We thought it hysterical. That is, until we realized that not only were his gauntlets missing, but his ring as well!"},{"name":"PAIYOREIYO","text":"There was no use searching for it in the dark, so we decided to return at first light. But alas, we never found it. Edda could never know..."},{"name":"PAIYOREIYO","text":"Now I would make things right. To do that, we must retrieve Avere's ring. Come. I very much doubt these shallow waters would carry his gauntlets far."},{"name":"PAIYOREIYO","text":"I dare not ask how or why Edda found her way into those ruins, but I am strangely glad for it. Had you not gone into Gelmorra, I fear her ring would never have made its way here."},{"name":"PAIYOREIYO","text":"To think I could scarce take a step into the Tam–Tara Deepcroft, let alone that death trap. Ahem. Thankfully, that is behind us. For now let us see about finding Avere's ring, shall we?"},{"name":"SYSTEM","text":"You find a pair of old, rusted gauntlets. A cursory shake dislodges a dull ring from within."},{"name":"PAIYOREIYO","text":"&lt;gasp&gt; You've found his gauntlets!? Truly? What of the ring? Please tell me it was still inside."},{"name":"PAIYOREIYO","text":"Yes! Yes, this is it!"},{"name":"PAIYOREIYO","text":"Now all that remains is to find a place where we might lay their rings─and hopefully, their spirits─to rest."},{"name":"PAIYOREIYO","text":"Hmmm... Perhaps Limsa Lominsa. It was, after all, where we all met. What could be better than a beautiful view of the maritime city where their love first blossomed?"},{"name":"PAIYOREIYO","text":"I can think of no better place than Summerford. Meet me near the top of the Skylift. I know a nice little spot with a beautiful view of Limsa."},{"name":"PAIYOREIYO","text":"&lt;sigh&gt; Would you look at that. It brings back such fond memories. Now, let us offer up our prayers to the dearly departed."},{"name":"PAIYOREIYO","text":"Even in death they suffered together, down there in the dark. Avere, Edda... I pray you sleep, and finally know true peace."},{"name":"PAIYOREIYO","text":"And with that, I believe we're finished here. Already I can feel a great weight has been lifted from my mind. Perhaps I may even enjoy a good night's rest."},{"name":"PAIYOREIYO","text":"Words cannot express my gratitude, <span class=\"highlight\">Forename</span>. You've seen me through much, and shown me what it means to be an adventurer. Our party lacked unity, and paid dearly for it. No one should suffer as they did, and I will do all I can to see other would-be heroes do not succumb to such a fate."},{"name":"EDDA","text":"(-Disembodied Voice-)...Thank you..."}],"reward":{"gil":1131,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67060]},"next":[67924]},"partials":[{"type":"npc","id":"1000334","obj":{"i":1000334,"n":"Balan","l":56,"q":2}},{"type":"npc","id":"1017259","obj":{"i":1017259,"n":"Paiyo Reiyo","l":30,"q":1}},{"type":"npc","id":"1017256","obj":{"i":1017256,"n":"Paiyo Reiyo","l":56,"q":1}},{"type":"npc","id":"1017257","obj":{"i":1017257,"n":"Paiyo Reiyo","l":56,"q":1}},{"type":"npc","id":"1017258","obj":{"i":1017258,"n":"Paiyo Reiyo","l":56,"q":1}},{"type":"quest","id":"67060","obj":{"i":67060,"n":"Corpse Groom","g":93,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"67924","obj":{"i":67924,"n":"Dead but Not Gone","g":86,"l":"South Shroud","s":520,"f":1}}]}