{"quest":{"name":"Welcome to Morbol Country","location":"Mor Dhona","id":67097,"patch":3.1,"sort":10,"eventIcon":71201,"target":1006530,"genre":0,"journal":["Slafborn's brow is clouded with worry and the forecast calls for rain─unless you can save the day.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","You have delved deep into morbol territory, stemming their assaults for the time being. Report the news of your courage to Slafborn.","Slafborn is pleased with the excitement your actions have stirred among the adventurers of Revenant's Toll. Your deed has inspired others to take on responsibility for the growth of the outpost, a trend that Slafborn hopes continues."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"SLAFBORN","text":"What to do, what to do... Ah, <span class=\"highlight\">Forename</span>. Mayhap you can cut through this knot of ours."},{"name":"SLAFBORN","text":"Revenant's Toll grows yet does not prosper. We draw adventurers from far and wide─or rather, the Allagan ruins draw them."},{"name":"SLAFBORN","text":"So busy are they collecting tomestones and relics that they've no time for calls from the Adventurers' Guild. I fear that many who come to the Toll have no sense that we <span class=\"emphasis\">are</span> a guild!"},{"name":"SLAFBORN","text":"You visit Rowena's establishment, do you not? That's the kind of bustle and camaraderie I'd like to see at the guild!"},{"name":"SLAFBORN","text":"Now, tales of your derring-do are certainly known to all. You're the genuine article, and I'd ask humbly for you to render some service to us in this matter."},{"name":"SLAFBORN","text":"If you were to rid the wilds of the seedkin that threaten the Toll's expansion, it might inspire some fledgling guildmates to do the same."},{"name":"SLAFBORN","text":"Those laboring on the outpost's frontier are being harassed by morbols coming through the Tangle. I would have you help keep the workers safe by slaying them before they've a chance to leave their wretched home."},{"name":"SLAFBORN","text":"Once others see such a storied adventurer as you working to expand Revenant's Toll, they'll surely be inspired to do the same."},{"name":"SLAFBORN","text":"The Adventurers' Guild is seeking volunteers to help rid the frontier of the morbols that harry those working there."},{"name":"SLAFBORN","text":"I would ask you to travel to the eastern part of the Tangle and strike at the morbols where they live. Your deeds will surely inspire others to do the same."},{"name":"SLAFBORN","text":"Ahhh, <span class=\"highlight\">Forename</span>! The Adventurers' Guild has marked the completion of their request for aid, and honors your service."},{"name":"SLAFBORN","text":"Already, the Toll buzzes with talk of your valiant excursion into the Tangle. Not a few adventurers have chosen to help on the frontier! Know that the Scions will hear of your success."}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"questsType":"all","quests":[66717,66718]},"next":[67098]},"partials":[{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"quest","id":"66717","obj":{"i":66717,"n":"Better Late than Sever","g":0,"l":"Mor Dhona","s":9}},{"type":"quest","id":"66718","obj":{"i":66718,"n":"Rock-solid Protection","g":0,"l":"Mor Dhona","s":7}},{"type":"quest","id":"67098","obj":{"i":67098,"n":"Answering the Call","g":0,"l":"Mor Dhona","s":11}}]}