{"quest":{"name":"Answering the Call","location":"Mor Dhona","id":67098,"patch":3.1,"sort":11,"eventIcon":71201,"target":1006530,"genre":0,"journal":["When a man like Slafborn thinks well of you, you are wont to find yourself performing a dangerous and unpleasant task in short order.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span><br><br>※The Main Scenario Guide shows the next available quest. You can toggle it on and off in Character Configuration, under UI Settings.","The hapalits prove little challenge, and the scouting party can now proceed with their mission. Report the happy news to Slafborn.","Thanks to your fellow adventurers' fondness for ale and gossip, your brave deeds have once again become the talk of Revenant's Toll. Slafborn declares the guild's morale to be unwaveringly high, before slyly reminding you that this too is a kind of sorcery."],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon the quest and restart it by speaking to Slafborn in Revenant's Toll.</span>"],"dialogue":[{"name":"SLAFBORN","text":"Ah, I forgot to mention before─I received word from the guild that they've seen more adventurers take up job requests in the last few days than in the past moon."},{"name":"SLAFBORN","text":"Heh, but of course one good turn leads to another...we hope. There's a job that might be too much for those who have expressed an interest. We'd like you to handle this one, before an unprepared adventurer meets an untimely end."},{"name":"SLAFBORN","text":"We received word from a scouting party we sent to the Singing Shards that a group of hapalits is making passage impossible. Someone needs to take care of them so the scouts can make progress. Not that I've no faith in the other volunteers, but I suspect few of them have stood against a hapalit."},{"name":"SLAFBORN","text":"Ignominy isn't something we can afford at the present. We have appearances to keep up if we are to maintain our growth, after all. A seasoned adventurer like you ought to know that a bad reputation's like bad breath: no one will ever speak frankly of what ails you."},{"name":"SLAFBORN","text":"You're to complete a mission at the guild's behest. If anybody can slay the hapalits and clear the way for our scouts, it's you."},{"name":"SLAFBORN","text":"It won't be an easy task, I'll warrant, but with your prowess, the hapalits are likely to fall without undue harm to some overeager youngster. Think what you'll do for other adventurers...and for the Scions' relationship with the guild."},{"name":"SLAFBORN","text":"You return, and looking none the worse for wear, I rejoice to remark."},{"name":"SLAFBORN","text":"Your reputation precedes you yet again─the Seventh Heaven is abuzz with talk of your deeds. We've already signed up a score or more to answer further requests from the guild."},{"name":"SLAFBORN","text":"Revenant's Toll grows <span class=\"emphasis\">and</span> prospers, to the benefit of the guild and the Scions. Did I not tell you there is much magic in being prepared?"}],"reward":{"xp":4800},"reqs":{"jobs":[{"lvl":50,"id":142}],"questsType":"any","quests":[66720,67097]},"next":[66722]},"partials":[{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"quest","id":"66720","obj":{"i":66720,"n":"Hest of the Best","g":0,"l":"Mor Dhona","s":10}},{"type":"quest","id":"67097","obj":{"i":67097,"n":"Welcome to Morbol Country","g":0,"l":"Mor Dhona","s":10}},{"type":"quest","id":"66722","obj":{"i":66722,"n":"You're Gonna Carry That","g":0,"l":"Mor Dhona","s":12}}]}