{"quest":{"name":"Simply to Dye For","location":"Mor Dhona","id":67094,"patch":2.3,"sort":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1006950,"target":1006988,"genre":95,"journal":["Alys would ask you to speak with a troubled patron.","While normally delighted by the company of her patrons at the Seventh Heaven, Alys is at a loss about how to console a particular customer. Eginolf, a renowned craftsman and regular at the tavern, has been more than voracious with his drinking of late, and Alys suspects he is beleaguered with work-related problems. To put an end to his troubles, and preserve the decorum of her establishment, she asks that you speak with him, that his mind may be put at ease. Make your way to Rowena's House of Splendors and speak with Eginolf to discover the cause of his distress.","You speak with Eginolf, and discover the source of his troubles is an arduous undertaking at the behest of his employer, the trader Rowena. Tasked with creating a new line of wares, the likes of which the realm has never known, he was at a loss as to how he could fulfill his duty to her. Meeting you, however, has inspired a return to the basics, that he may better tailor his wares to the adventurers who would purchase them. As thanks, he offers to dye your artifact armor any color you desire. After acquiring the necessary augmentation item, try speaking with his assistant, Kakalan."],"objectives":["Speak with Eginolf."],"dialogue":[{"name":"ALYS","text":"Ah, well if it isn't <span class=\"highlight\">Forename</span>. Just the adventurer I was hoping to see."},{"name":"ALYS","text":"Do you know of the blacksmith Eginolf? He's quite an accomplished craftsman. In fact, anyone who's had dealings with Rowena is sure to have come across his creations."},{"name":"ALYS","text":"It's always been a pleasure to have him as a regular here at the Seventh Heaven, but he's been quite irritable of late, and practically drowning in his cups, besides. I fear his recent work, or perhaps a lack thereof, may have something to do with it."},{"name":"ALYS","text":"This may seem but a trifling matter to someone as traveled as yourself, but it would mean so much to me if you would speak with him. I can think of no one better to offer him a word or three of encouragement."},{"name":"ALYS","text":"You can find him just down the way at the Diamond Forge within Rowena's House of Splendors. I do pray his predicament is nothing serious."},{"name":"EGINOLF","text":"Can't ye see I'm thinkin', <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Off with ye!<br>...Hm? Alys sent ye, did she?"},{"name":"EGINOLF","text":"&lt;scoff&gt; And I suppose she just <span class=\"emphasis\">happened</span> to mention me <span class=\"emphasis\">contract</span> with Rowena, eh?"},{"name":"EGINOLF","text":"I thought she'd be satisfied with me vintage gear. There was a time it practically flew off the shelves, bringin' in 'venturers with tomestones by the bucket. But now..."},{"name":"EGINOLF","text":"Ye damned divas are a fickle lot, and apparently none o' ye'll be caught dead in me stuff no more. Now I've got Rowena jumpin' down me throat, clamorin' for summat <span class=\"emphasis\">new</span>. Summat the realm ain't heretofore seen..."},{"name":"EGINOLF","text":"The woman expects too bloody much, I tell ye! But if I don't fill me contract, she'll have thugs fittin' me feet fer lead boots. If only I pissed out bright ideas each dawn like I did me ale..."},{"name":"EGINOLF","text":"Hold yer horsebirds! I...I know ye from somewhere... Yer one of them 'venturers what started the bloody relic armor movement way back when, ain't ye? As I live an' breathe!"},{"name":"EGINOLF","text":"Tried as I might─and holy hells, did I try─I wasn't quite able to recreate them masterworks. There was summat about 'em─a certain quality even the great Eginolf weren't goin' to match. I s'pose one never truly can rival the classics, eh?"},{"name":"EGINOLF","text":"Ah, Alys, ye sly shrew. <span class=\"emphasis\">That's</span> why you sent this one."},{"name":"EGINOLF","text":"Ye wanted <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to remind me of the old days when armorcraft was about the armor, and naught else. Somewhere along the way, I reckon I got caught up in the hurly-burly and lost me way."},{"name":"EGINOLF","text":"Ye know, I reckon it's high time I got back to basics─focus more on who'll be wearin' me gear than the pretty tail on that Miqo'te sellin' me the parts. Might be then I can come up with summat what'll satisfy ol' Rowena. Cheers, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. 'Twas kind of ye to stop by."},{"name":"EGINOLF","text":"And while yer here, how about I fix up yer own set o' relic gear? Mine assistant Kakalan here can augment each and every piece..."},{"name":"EGINOLF","text":"'Course, that's assumin' ye can bring him the proper parts. I ain't runnin' a charity. Don't go forgetting yer gear, neither."},{"name":"SYSTEM","text":"You may now trade with Kakalan. After obtaining the appropriate augmentation item, you can exchange it along with artifact armor for augmented artifact armor, which, unlike regular relic armor, can be dyed any color of your choice."},{"name":"SYSTEM","text":"Please note that the augmentation item required will vary depending on the artifact armor you wish to exchange."}],"reward":{"gil":433,"items":[{"num":3,"id":5741,"one":1},{"num":3,"id":5782,"one":1},{"num":3,"id":5792,"one":1}],"xp":0},"reqs":{"quests":[66235]}},"partials":[{"type":"npc","id":"1006950","obj":{"i":1006950,"n":"Alys","l":67,"q":7}},{"type":"npc","id":"1006988","obj":{"i":1006988,"n":"Eginolf","l":67,"q":2}},{"type":"item","id":"5741","obj":{"i":5741,"n":"Coral Pink Dye","l":1,"c":22805,"t":55,"p":334}},{"type":"item","id":"5782","obj":{"i":5782,"n":"Adamantoise Green Dye","l":1,"c":22810,"t":55,"p":334}},{"type":"item","id":"5792","obj":{"i":5792,"n":"Rhotano Blue Dye","l":1,"c":22804,"t":55,"p":334}},{"type":"quest","id":"66235","obj":{"i":66235,"n":"Color Your World","g":93,"l":"Western Thanalan","s":150,"f":1}}]}