{"quest":{"name":"The Newer King on the Block","location":"Kugane","id":67091,"patch":4.36,"sort":121,"unlocksFunction":1,"eventIcon":71341,"issuer":1025721,"target":1025721,"genre":207,"journal":["Judging by the hunter's jovial expression, the hunt is still on."],"objectives":["Speak with the hearty hunter."],"dialogue":[{"name":"RIVALMOBHUNTER","text":"The great hunter returns. You did well taking on that Rathalos."},{"name":"RIVALMOBHUNTER","text":"Though I must ask: was the battle grueling? Did the mountains sing with the sound of claws clashing with steel?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I've had tougher battles."},{"name":"A1","text":"It was admittedly more trouble than I expected."},{"name":"RIVALMOBHUNTER","text":"Ah, but of course. Perhaps battle with a high-ranking Rathalos would have put a bit of sweat on your brow."},{"name":"RIVALMOBHUNTER","text":"Truly? I shudder to think what would have happened had you encountered a high-ranking Rathalos, then."},{"name":"RIVALMOBHUNTER","text":"Piqued your curiosity, have I? Well, I can only tell you what I've heard."},{"name":"RIVALMOBHUNTER","text":"They say there is a stronger brood of Rathalos that would make short work of your average hunter."},{"name":"RIVALMOBHUNTER","text":"Mayhap that kitten friend of yours knows something of it. He was, after all, the one who originally posted a bill for the beast."},{"name":"RIVALMOBHUNTER","text":"No need to worry over it now, though. I'd say you've earned a rest after your recent exertions in the Azim Steppe. When you're up for another hunt I'll be here, ready and waiting. "},{"name":"RIVALMOBHUNTER","text":"The mighty hunter returns, and with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> feline companion!"},{"name":"FELYNE","text":"Feline!? How rude! I am a <span class=\"emphasis\">Felyne</span> you dullard!"},{"name":"RIVALMOBHUNTER","text":"I...fail to see the difference...<br>Ahem. But that is neither here nor there. I asked <span class=\"highlight\">Forename</span> to bring you here that we might learn the truth of these high-ranking Rathalos I recently caught wind of."},{"name":"FELYNE","text":"High Rank Rathalos? They're an older, much more powerful brood of wyvern..."},{"name":"FELYNE","text":"Without sufficient protection, even the simplest of swipes is all it would take to rend a hunter in two."},{"name":"RIVALMOBHUNTER","text":"If I didn't know better, I'd say you were talking about an elite mark. Yes, a challenge no self-respecting hunter can ignore!"},{"name":"RIVALMOBHUNTER","text":"It's settled, then. Are you ready, my friend?"},{"name":"SMITHERY","text":"Aye! Let's get to it!"},{"name":"FELYNE","text":"Your enthusiasm is appreciated, but now isn't the time to be kitten around. To be purrrfectly plain, I'd rather not see another hunter charbroiled today."},{"name":"SYSTEM","text":"You have unlocked the Great Hunt (Extreme). Test your mettle against High Rank Rathalos and reap rich rewards!"},{"name":"SYSTEM","text":"Please note you may only enter the Great Hunt (Extreme) with four players."}],"reward":{"gil":500,"instance":20054},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[67090]}},"partials":[{"type":"npc","id":"1025721","obj":{"i":1025721,"n":"Hearty Hunter","l":2404,"q":2}},{"type":"instance","id":"20054","obj":{"i":20054,"n":"The Great Hunt (Extreme)","c":61804,"t":"Trials","min_lvl":70,"max_lvl":70,"min_ilvl":350}},{"type":"quest","id":"67090","obj":{"i":67090,"n":"The New King on the Block","g":207,"l":"Kugane","s":120,"f":1}}]}