{"quest":{"name":"Death of a Mailman","location":"Limsa Lominsa","id":67106,"patch":2.4,"sort":12,"icon":100338,"eventIcon":71221,"issuer":1009153,"target":1009721,"involved":[1006751],"genre":77,"journal":["The deputy postmoogle's trust in you must surely grow, for a letter between Seedseers is serious business indeed.","The deputy postmoogle has tasked you with an important delivery. Place the missive given to you in the hands of Raya–O–Senna in Camp Tranquil, and ask not what message it contains.","Letters between Padjals are no biscuit recipes as a rule, and this one is no exception. The sender himself appears on the scene, and A–Ruhn–Senna and Raya–O–Senna rope you into a convoluted scheme to stage an intervention for the deputy postmoogle. But first, the bait in the form of another letter must be delivered to the postmoogle outside Bulwark Hall on the lower decks of Limsa Lominsa.","The bait has been delivered to the deputy postmoogle, who after much hemming, hawing, and kupoing agrees to meet with you─and unbeknownst to him, the Seedseers─near Little Solace in the East Shroud.","You arrive on the scene to find no trace of the dutiful postmoogle, much to your surprise. What could have prevented him from honoring the rendezvous? There are some fell things in the forest, especially on the path between Little Solace and the Hawthorne Hut. Look sharp, for whatever keeps the postmoogle from his duty will have no love for his assistant.","A wounded thing always draws predators, and thus it is with the postmoogle. Have no mercy for the fell things that seek to make a meal of your mentor.","The postmoogle's secret was one of great pathos, as secrets desperately guarded are wont to be. A windmill sail had all but incapacitated the poor letter carrier, but a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who dashes a moogle's hopes shall ever burn in the seventh hell. What can one do but carry on the moogle's work, mentor more carriers, and pray? By the grace of the Twelve, may the Padjals find healing for his battered little body..."],"objectives":["Deliver the letter to Raya–O–Senna.","Deliver the letter to the deputy postmoogle.","Wait at Little Solace.","Look for the deputy postmoogle near the Hawthorne Hut.","Rescue the deputy postmoogle."],"dialogue":[{"name":"LETTERMOOGLE","text":"An assistant in need is an assistant indeed, kupo! Your postal career has been a series of pleasant surprises. What a journey you've had, from dubious to glorious!"},{"name":"LETTERMOOGLE","text":"A very special honor awaits you today, kupo. This letter is from none other than A–Ruhn–Senna, the youngest of the three Seedseers."},{"name":"LETTERMOOGLE","text":"And of all people, it's addressed to his sister Raya–O–Senna! From one Padjal to another, kupo. How about that?"},{"name":"LETTERMOOGLE","text":"We are traveling in high society! Never did I expect to trust an assistant with a letter of such import, but you exceed all expectations!"},{"name":"LETTERMOOGLE","text":"The letter is for Raya–O–Senna, one of the three Seedseers who watch over Gridania."},{"name":"LETTERMOOGLE","text":"We move in exalted circles, kupo! Or rather, <span class=\"emphasis\">you</span> do! No dawdling now, if you please."},{"name":"RAYAOSENNA","text":"Ever does it hearten me to see your face, <span class=\"highlight\">Forename</span>, though this time less than others. Come, we've our roles to play in this mummer's farce. Give me my letter."},{"name":"RAYAOSENNA","text":"Yes, I am Raya–O–Senna, though I am sore tempted to deny it at times. A letter, you say? Let us see if it is the right one..."},{"name":"RAYAOSENNA","text":"And there it is, the letter from my brother. Thank you for the delivery─and the certainty."},{"name":"RAYAOSENNA","text":"No delivery could be of graver import than a missive between two of the Seedseers. Yet...here stands a mere assistant letter carrier, not the deputy postmoogle. Curious, is it not─Brother?"},{"name":"ARUHNSENNA","text":"We are in rare accord, dear sister. There is something amiss with the postmoogle, a secret sorrow that has driven him from his duty!"},{"name":"RAYAOSENNA","text":"You are bemused, <span class=\"highlight\">Forename</span>, and soon to grow vexed for want of an account. Know that this deception was not for your benefit..."},{"name":"ARUHNSENNA","text":"It is the deputy postmoogle that concerns us. He has seemed rather derelict in his duties─and so we laid this test for him. If naught were amiss, he would be here now in your stead!"},{"name":"RAYAOSENNA","text":"In truth, we have seen little of the good moogle lately. &lt;sigh&gt; We fear for him, yet he fears to show himself. What secret does he keep from his Seedseers...and his friends?"},{"name":"ARUHNSENNA","text":"If he fears to even show himself, this secret must keep itself poorly indeed. All we need is a look at him and we'd know!"},{"name":"RAYAOSENNA","text":"We would have your aid, <span class=\"highlight\">Forename</span>. The work of a postmoogle is of too great an import to leave to chance."},{"name":"RAYAOSENNA","text":"We must bring the postmoogle out of hiding, into the light of truth. Take this letter to him, good adventurer."},{"name":"RAYAOSENNA","text":"Tell him not of us─not a word. Tell him this letter comes from a Twin Adder soldier, and must be delivered to a sylph of ill repute in the East Shroud."},{"name":"RAYAOSENNA","text":"You will beg the postmoogle for aid. Tell him that in your callowness, you cannot find the destination. His vanity shall push him out, and his affection for you will pull him in..."},{"name":"ARUHNSENNA","text":"...Directly to Little Solace, where he shall find <span class=\"emphasis\">us</span> instead of the wicked sylph! We'll settle this once and for all."},{"name":"RAYAOSENNA","text":"Give this letter to the deputy postmoogle, if you would solve this mystery. Bring him to Little Solace and we shall see into the heart of him."},{"name":"LETTERMOOGLE","text":"Did the delivery go as it should? Such an important letter, such exalted company... How I miss...kupo. What's this? A difficult letter to deliver, did you say?"},{"name":"LETTERMOOGLE","text":"A letter from a Twin Adder soldier to...Diluxio!? A most notorious sylph, kupo! You were right to come to me─this is a difficult delivery indeed."},{"name":"LETTERMOOGLE","text":"Ahem, but...I am not familiar with Moonspore Grove, kupo! I barely know the name─Moonspore Stove? Clove? No, no idea where to find this Diluxio, none!"},{"name":"LETTERMOOGLE","text":"I wish I could help, but I regret to tell you I cannot! I simply cannot go with you to Moonspore Grove, kupo!"},{"name":"LETTERMOOGLE","text":"Why not? Because...<span class=\"emphasis\">because</span>, kupo! Because out in the grove, there may be spores. Yes, that's right. I have allergies, kupo!"},{"name":"LETTERMOOGLE","text":"&lt;sigh&gt; ...But if my assistant needs me, I suppose I must go. Deliveries must be made, and sacrifices, too. Very well, at Little Solace we shall meet."},{"name":"LETTERMOOGLE","text":"Let us go, then, you and I, where the moonspores fly! Together we shall seek Diluxio, kupo."},{"name":"LETTERMOOGLE","text":"I shall meet you at Little Solace. Then together we shall seek Diluxio, kupo."},{"name":"RAYAOSENNA","text":"How now, where is the postmoogle? It is not like him to be so late. Something is amiss with him, well and truly."},{"name":"RAYAOSENNA","text":"Could it be that he has sensed our presence? That he dares not meet the Seedseers?"},{"name":"ARUHNSENNA","text":"He <span class=\"emphasis\">is</span> near, Sister. Beyond that, I cannot say exactly where he is. And the elementals! Something has them stirring."},{"name":"RAYAOSENNA","text":"If he will not come to us, we shall go to him. Brother, you and I are for the Bramble Patch. <span class=\"highlight\">Forename</span>, you shall seek the postmoogle near the Hawthorne Hut."},{"name":"ARUHNSENNA","text":"I like this not, <span class=\"highlight\">Forename</span>. I sensed something...diminished about the postmoogle's presence. Aid him. Be his friend."},{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>, seek the postmoogle around the Hawthorne Hut. Something is amiss, and we must aid him."},{"name":"POPMESSAGE","text":"You sense death about to strike!"},{"name":"POPMESSAGE","text":"(Deleted)"},{"name":"LETTERMOOGLE","text":"Just kill me, kupo..."},{"name":"LETTERMOOGLE","text":"My faithful assistant! Thank you, kupo. I had just lain down for a nap when those things took me unawares..."},{"name":"LETTERMOOGLE","text":"But everything is fine! Fine! Come, come, we must go to Little Solace, kupo!"},{"name":"RAYAOSENNA","text":"How now! For someone working so little these days, you seem awfully tired. Did you think you could deceive the Padjals, deputy postmoogle?"},{"name":"LETTERMOOGLE","text":"Raya–O, k-kupo? And A–Ruhn and...! Why are you all here!? Please don't look at me! Don't!"},{"name":"RAYAOSENNA","text":"I shall look at whomever in however a manner I see fit! Though I may say that privilege does not extend to <span class=\"emphasis\">everyone</span> in present company!"},{"name":"LETTERMOOGLE","text":"M-My apologies, my <span class=\"emphasis\">humblest</span> apologies, Seedseers! I am not feeling very well, kupo. With your leave, I must return to my home─"},{"name":"RAYAOSENNA","text":"Your home is here in the Twelveswood, deputy postmoogle! And if you think your friends would allow you to fly on those shredded wings, you must think very little of us indeed!"},{"name":"ARUHNSENNA","text":"It was a windmill, was it not? Your life has been in the Twelveswood─how could you know of such structures? You managed to survive the collision, but the injury was great..."},{"name":"RAYAOSENNA","text":"Oh, you poor, brave fool! That was why you suddenly took on an assistant... 'Twas so you might heal."},{"name":"RAYAOSENNA","text":"Why would you not tell us─not seek our help? Why hide your hurts from my brother and me, and this good adventurer? You withheld it even from your fellow moogles!"},{"name":"LETTERMOOGLE","text":"Please! Please don't take away my cap and satchel, kupo! P-P-Please, it's my <span class=\"emphasis\">life</span>..."},{"name":"LETTERMOOGLE","text":"If I can't be a postmoogle, I don't want to live, kupo! Please, please don't ground me..."},{"name":"LETTERMOOGLE","text":"My faithful assistant understands, kupo? I beg you, help me, tell them not to ground me..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Please let him stay on the job!"},{"name":"A1","text":"I can handle things until he recovers!"},{"name":"RAYAOSENNA","text":"You have a curious notion of what it is to <span class=\"emphasis\">help</span>. He needs many moons of complete ground rest, not a job which calls for constant flying!"},{"name":"RAYAOSENNA","text":"Do I understand you correctly? You will serve as needed, without being named the deputy letter carrier yourself─so that the honor of the post remains with your injured friend?"},{"name":"ARUHNSENNA","text":"The rest may be enough to mend his injuries, or it may not. Still, do we not owe that much to our friend? And I shall personally look into moogle medicine for a cure!"},{"name":"RAYAOSENNA","text":"What would we not do for a friend in need? Whether adventurer or Seedseer, we are all your friends─and you are the deputy postmoogle still, grounded or no."},{"name":"RAYAOSENNA","text":"But you <span class=\"emphasis\">will</span> rest, or I shall know the reason why! And <span class=\"highlight\">Forename</span> is to keep the letters flying to all reaches of the realm."},{"name":"RAYAOSENNA","text":"The moogles shall also help! Any small deliveries within the Twelveswood are your honored responsibility, my good moogles."},{"name":"ARUHNSENNA","text":"But, Sister, surely we need more carriers for letters <span class=\"emphasis\">leaving</span> the Twelveswood! <span class=\"highlight\">Forename</span> is an adventurer with other duties, after all."},{"name":"RAYAOSENNA","text":"My brother is right. Moogles! Send word to your cohorts throughout the forest. We seek postmoogles with hearts stout enough to face the wider world!"},{"name":"RAYAOSENNA","text":"Now, my dear deputy postmoogle, we must tend to your injuries. <span class=\"highlight\">Forename</span>, you are no longer an assistant but a carrier grown. See to your duties, and to the novices who will look to you for aid."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"},{"name":"SYSTEM","text":"You have been recognized for your past achievements and promoted from an assistant to a full letter carrier. Remember that every delivery you complete helps the deputy postmoogle cling to his reason to live.<br>...And congratulations on your promotion!"}],"reward":{"gil":3000,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1009721","obj":{"i":1009721,"n":"Deputy Postmoogle","l":55,"q":1}},{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}}]}