{"quest":{"name":"Thanks for Your Support","location":"Limsa Lominsa","id":67108,"patch":2.5,"sort":18,"icon":100358,"eventIcon":71221,"issuer":1009153,"target":1009735,"involved":[1000856,1009733,1009734],"genre":77,"usedItems":[4870],"journal":["The deputy postmoogle wants you to slip into something more comfortable.","In honor of your selfless contributions to the delivery service, the deputy postmoogle would like to reward you with a relaxing trip to meet Wawalago, the laid-back master of the Fishermen's Guild, and learn the secrets of easy living. The fact that a letter needs delivering to the very same man is entirely coincidental.","Wawalago lazily scans the lines of the letter: it is from Rorojaru, a fast friend of the guildmaster and previously prosperous purveyor from Ul'dah who has fallen on trying times. He writes to request a trade: an item of immense interest to a fish fancier for a single fish─the rarer the better. Wawalago directs you to the ferry docks to receive Rorojaru and relay the guildmaster's reply.","You meet with Rorojaru at the docks and deliver Wawalago's note. The troubled trader is staking the last remnant of his once-mighty fortune on this deal, and relishes Wawalago's receptiveness to his request. But one problem remains: the guildmaster would make the trade at Candlekeep Quay, but how to transport the treasure all that way? If only there were an adventurer adept at delivering packages nearby... Remember─lift with your legs, not with your back.","You lift Rorojaru's chest with aplomb. All that remains is to transport it to Candlekeep Quay in lower La Noscea, and reunite it with its owner.","Wawalago inspects the trader's treasure, but to Rorojaru's dismay, he deems it of insufficient value to cover the cost of the fish. Still, the guildmaster offers his friend a lifeline to rescue the deal: if Rorojaru should catch a fish─any fish─in the time it takes for you to return with a Lominsan anchovy, he will sanction the trade. If not, the deal is dead, and the trader's dreams with it. By what method you obtain the fish, and how quickly you choose to present it to Wawalago, are for your own conscience to decide.","You hand over the Lominsan anchovy to Wawalago. Despite his best efforts, Rorojaru has been unable to capture a single sprat in the time it took you, leaving the deal dead in the water. But as Rorojaru mourns the loss of his fortune, Wawalago catches a fish of superlative rarity and presents it to his friend as a reward for his endeavors, before taking his leave. To your surprise, the money-mad merchant releases the prize catfish that was to be his ticket to regaining his riches, choosing instead to emulate Wawalago in living the carefree life of a fish. He throws off the trammels of the trading life, starting and ending with the last of his fortune─a shining subligar buffed to an iridescent sheen, prized in fishing circles for its power to invigorate the local fish stocks. May it offer you similar support in your adventures to come."],"objectives":["Deliver the letter to Wawalago.","Deliver the reply to Rorojaru at the ferry docks.","Pick up Rorojaru's chest.","Deliver Rorojaru's chest to Candlekeep Quay.","Present Wawalago with a Lominsan anchovy."],"dialogue":[{"name":"LETTERMOOGLE","text":"Well met once again, <span class=\"highlight\">Forename</span>! Since you've been such an obeisant assistant, I've got a reward for you, kupo! No drunkards and ruffians to contend with this time, just rest and relaxation."},{"name":"LETTERMOOGLE","text":"Tell me, <span class=\"highlight\">Forename</span>: what comes to mind when you think of Limsa Lominsa...<span class=\"emphasis\">after</span> pirates, wharf rats, and watered-down grog, that is? Fish, kupo! And there's nobody fishier─and I mean that in the nicest sense of the word─than Wawalago, the master of the Fishermen's Guild!"},{"name":"LETTERMOOGLE","text":"Wawalago's been pitting his wits against the slipperiest fish in the five seas for longer than anyone can remember. Why, he's not unlike a fish himself─drifting along in the stream of life, without a care in the world."},{"name":"LETTERMOOGLE","text":"So I thought it'd be nice if you went down and got to know him. Lay down your weapons, put aside your worries, and take it easy for once. Oh, and while you're at it, you can take along this letter! I mean, you're going there either way, right? It's like catching two fish with one lure!"},{"name":"LETTERMOOGLE","text":"Ah, to live life as a fish! Swimming along amidst the waves, going wherever the current takes you. Just as a delivery <span class=\"alternative-container\"><span class=\"alternative\">Hyur</span><span class=\"alternative\">Elezen</span><span class=\"alternative\">Lalafell</span><span class=\"alternative\">Miqo'te</span><span class=\"alternative\">Roegadyn</span><span class=\"alternative\">Au Ra</span><span class=\"alternative\">Hrothgar</span><span class=\"alternative\">Viera</span></span> goes wherever the address on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> envelope takes <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. How fitting indeed that yours is marked for Fisherman's Bottom, kupo!"},{"name":"WAWALAGO","text":"Well, if it isn't my firm friend <span class=\"highlight\">Forename</span>, the <span class=\"alternative-container\"><span class=\"alternative\">lofty lady who landed</span><span class=\"alternative\">man who more than matched</span></span> that monstrous marlin! Come to cast away your cares with a little leisurely angling? ...What's that? A message marked for me, you say?"},{"name":"WAWALAGO","text":"Fine <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span> for fishing, isn't it, <span class=\"highlight\">Forename</span>? Prop up your pole in the perfect position, and then─ ...Oh, you've a message marked for me?"},{"name":"WAWALAGO","text":"Come to meet the master of the Fishermen's Guild? Then I'm the one you want─Wawalago, at your service. ...You say you're a practicing postperson, with a message marked for me? Let's have a look at this letter, then..."},{"name":"WAWALAGO","text":"A missive from my old mate Rorojaru! He's a trinket trader from Ul'dah, who supplies a certain something that supports and strengthens seafood stocks. Since we set some of his special supporters on the seabed, Fisherman's Bottom's been swimming with shrimp and groaning with gobies!"},{"name":"WAWALAGO","text":"I'd heard neither hide nor hair from him since the Calamity hit. It's heartening indeed to know that he's hale and healthy."},{"name":"WAWALAGO","text":"And it seems the old dog's still desperate to do deals─says he wants to trade one of his treasures for an infrequently found fish. Business must be bad if he's bartering his best brass for a bass... Anyroad, perhaps you could do me a favor while I ready my rod."},{"name":"WAWALAGO","text":"Rorojaru's boat should be berthed down by the docks. Could you head over and hand him this note? I've marked out a map of where this fish he fancies can be found. Tell him to meet me there, and we'll do the deal."},{"name":"WAWALAGO","text":"Rorojaru's always been an old landlubber, sorely lacking in sea legs. After a prolonged passage like that, he'll need a helping hand to haul his luggage down to the spot I've selected. But if he wants his fish fresh, it's the price he'll have to pay!"},{"name":"ROROJARU","text":"Good gods! Must the sea be so damned wavy? My stomach's churning, my legs are like jelly, and don't get me started on my poor old back. Thal knows how I'm going to haul this blasted crate all the way to the Fishermen's Guild. ...Oh? You've got a letter for me?"},{"name":"ROROJARU","text":"Well, I'll be! Wawalago's agreed to my offer! I knew he wouldn't let me down; I could feel it in my bones! Looks like my luck's finally turned. By this time next year, I'll be a gillionaire!"},{"name":"ROROJARU","text":"Oh, but look at me, getting all carried away, and I haven't even introduced myself: Rorojaru, purveyor of the finest silks, the most exotic perfumes, and the rarest curiosities in all Ul'dah...at least I was, until the Calamity took all that away from me."},{"name":"ROROJARU","text":"My whole warehouse went up in smoke, and my fortune with it. I tried everything to get my foot back on the ladder, but I was cheated at every turn, lumbered with dodgy gil, and ended up getting deeper and deeper into debt. Now all I've got left are the clothes on my aching back, and this rotten box."},{"name":"ROROJARU","text":"I was just about to declare myself bankrupt, but then I got wind of a tasty tidbit of gossip that set my business brain in motion! There's this fellow in Ul'dah, you see, a real grandee─I knew him back when I was someone who knew people. Turns out he's got a thing for exotic fish, and he'll pay through the snout for anything suitably rare."},{"name":"ROROJARU","text":"That's when I thought of Wawalago. He's the greatest fisherman in Limsa Lominsa, and an old friend to boot. Plus, he's the only one who appreciates the true value of the...<span class=\"emphasis\">thing</span> I've got in my box. I haven't the gil or the skill to bag the kind of fish I need without him."},{"name":"ROROJARU","text":"...Nor do I have the legs or the back to lug this chest all the way to Candlekeep Quay. But say...you're some sort of delivery <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, right? Could you help a feller out? I can't pay you anything now, but I'll remember you when I'm rolling in it!"},{"name":"WAWALAGO","text":"Candlekeep Quay's the place to poach the singular specimen that'll suit Rorojaru's request. I'll just pack up my pole, my provisions, and a piece of pilchard pie to tide my tummy over, and head on down. Why don't you go see if Rorojaru needs any assistance?"},{"name":"WAWALAGO","text":"Helpfully hauled Rorojaru's goods down the highroad, did you? Just drop it down on the ground for now. He's got his hands full, holding his own with the fishes."},{"name":"ROROJARU","text":"...Thank Thal you're finally here! And you've brought the chest? Thanks a million, <span class=\"alternative-container\"><span class=\"alternative\">missy</span><span class=\"alternative\">sonny</span></span>─you're a lifesaver. Now that we've got the goods, I can finally be free of this backbreaking labor!"},{"name":"ROROJARU","text":"Thanks awfully for carrying the chest for me, <span class=\"alternative-container\"><span class=\"alternative\">missy</span><span class=\"alternative\">sonny</span></span>. Don't know what I'd have done without you... Actually, I do─when I turned up empty-handed, Wawalago forced me to start fishing myself. “If you're short of something to swap, you'll snare the scaly specimen solo,” he said."},{"name":"WAWALAGO","text":"Let's have a look at this gift you've got me... Blinking barnacles, it's beautiful! See it shine and shimmer, like the silvery scales of a sea serpent! The fish'll flock to bask in the brilliance of a natty knickknack like this!"},{"name":"ROROJARU","text":"Hee hee! I knew it! The pawnbrokers wouldn't trade it for toffee, but to a master fisherman, my supporter's worth more than money can buy! So...do we have a deal? Can I put down the rod now?"},{"name":"WAWALAGO","text":"Fine, fine. I'll fetch your fish for you. The rarest rarefied ray in the Rhotano! ...Subject to you shoring up the shortfall in the settlement with a little light labor, that is. Catch me a carp, or a coley, or any form of fish you can find, and I'll honor your order."},{"name":"ROROJARU","text":"The shortfall...? You mean the supporter's not enough!? Then I'm ruined! I was sitting here for ages, and I didn't even get a nibble! There's no fish to be found in this accursed ocean!"},{"name":"WAWALAGO","text":"I dare to differ, my friend. There's shoals and shoals of scaly swimmers in the sea around you. Your foray into fishing floundered 'cause there's nothing but numbers in that noggin of yours. Clear your conscience of all those money-making machinations, and mellow your mind. Then the buggers'll bite."},{"name":"WAWALAGO","text":"But we can't dally here all day─there's duties need doing down at the guild. So I'll lay down a little limitation: our dear delivery <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> here will catch me a catch of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> very own. If you've not netted a solitary specimen by the time <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s tackled this task, the deal's as dead as a deviled dodo."},{"name":"ROROJARU","text":"So if I don't catch a fish before <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does, I go home with nothing? Then it's all over... Good gods, I'll be beggared! The banks won't touch me with a bargepole!"},{"name":"WAWALAGO","text":"There you go, worrying over wealth again! If you're duly determined to procure this prize perch of yours, then ready your rod, banish that brooding from your brain, and focus only on the fun of fishing!"},{"name":"WAWALAGO","text":"<span class=\"highlight\">Forename</span>, if you'd be so obliging, I'd like you to acquire me an anchovy. A local Lominsan one will fill the bill. They're common on this coast, so it shouldn't be a struggle to secure. Snatch one straight from the sea, or procure it from a purveyor─it's up to you."},{"name":"WAWALAGO","text":"When you've acquired your anchovy, bring it back here to me. It's up to you how to harvest it: whisk one from the waves with your willowy wand, or meet with a monger and pick one up for peanuts. Whatever buoys your boat."},{"name":"ROROJARU","text":"Lazy, shimmering fish, drifting in the lazy, shimmering ocean... I'm starting to feel a bit lazy myself. Is this how it feels to be a fish...?"},{"name":"WAWALAGO","text":"When you've acquired your anchovy, bring it back here to me. It's up to you how to harvest it: whisk one from the waves with your willowy wand, or meet with a monger and pick one up for peanuts. Whatever buoys your boat."},{"name":"WAWALAGO","text":"...Time's up, Rorojaru. Our dutiful delivery <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span> has completed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> commission, and you still haven't snagged a single sprat. I'm sorry, but the deal's dead."},{"name":"ROROJARU","text":"No! Then I've lost everything! My fortune...my future... &lt;sob&gt; I might as well lie down here and die like a dog..."},{"name":"WAWALAGO","text":"Really, Rorojaru...what have you actually lost? Dwell not on money and misery, but rather widen your eyes to the wonders of the world. ...Like just now, when you were focused on nothing but the fish─how did it feel?"},{"name":"ROROJARU","text":"...It was wonderful! For a minute there, I really felt like I was one with the ocean. All my material worries just washed away. But a fat lot of good it did me─I didn't catch a bleeding thing..."},{"name":"WAWALAGO","text":"Heh. Your financial frettings might've been mildly misplaced, but you've been a trader too long to fully free your feelings from the constant contemplation of coin. That's why the fish didn't bite. But still...if you drew some sense of satisfaction from it, I suppose that's a start..."},{"name":"ROROJARU","text":"Holy mackerel! I-I mean...holy catfish! That isn't a saltwater catfish, is it? I thought they were extinct! Oh, if only my client could see this─I'd get a sultan's ransom for it!"},{"name":"WAWALAGO","text":"Aye, sure as the sun, that's a saltwater catfish. There's some as say the species snuffed it in the Calamity, but I'd heard word they were hiding here in Candlekeep Quay. Seems the rumors were right... Take it, Rorojaru─consider it a prize for your persistence. Do with it what you will."},{"name":"ROROJARU","text":"Wait, Wawalago! What about your payment? Aren't you going to take my supporter? The shiny shorts the fish go crazy for? The <span class=\"emphasis\">star–spangled subligar</span>!?"},{"name":"WAWALAGO","text":"Oh, those? I've got hundreds of them at home. Just remember, Rorojaru─don't drag yourself down, brooding over business. Free your mind from fretting over your fortune and your future, and try to think like a fish..."},{"name":"WAWALAGO","text":"But if that still doesn't solve your sorrows, never forget that you'll always find friends at the Fishermen's Guild. However hard things seem, however low you go...when you think like a fish, your distress and disquiet just drift away on the tide..."},{"name":"ROROJARU","text":"Was Wawalago planning to give me the fish all along? Gods, the man's a bleeding marvel. I don't deserve a friend like him..."},{"name":"ROROJARU","text":"You know, it's a tough life being a trader. You can't think like a fish when you're swimming with sharks, or you'll get gobbled up. Closes your mind to anything but coin, it does. But whenever I deal with Wawalago, I feel liberated─like a great burden's been lifted from my heart..."},{"name":"ROROJARU","text":"If I could only live as he does... I've had my fill of dealing with crooks and swindlers, spending every waking moment obsessing over my bank balance, and agonizing over who's going to steal it from me. It's time I made a change..."},{"name":"SYSTEM","text":"Rorojaru returned the saltwater catfish to the ocean!"},{"name":"ROROJARU","text":"I'll throw it all away, and start again from scratch at the Fishermen's Guild! Here, <span class=\"highlight\">Forename</span>: I hereby entrust to you the entirety of the great Rorojaru's estate─the brilliant briefs no fish can resist!"},{"name":"ROROJARU","text":"Wawalago says the fish take energy from its shining scales, and copy after them─helps them grow big, and strong, and happy. I never knew it before, but it's the same with people: if I'm to learn to live like a fish and set myself free, I need no supporter but Wawalago!"},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":838,"items":[{"id":3323}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1009735","obj":{"i":1009735,"n":"Wawalago","l":31,"q":1}},{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"npc","id":"1009733","obj":{"i":1009733,"n":"Rorojaru","l":29,"q":1}},{"type":"npc","id":"1009734","obj":{"i":1009734,"n":"Rorojaru","l":31,"q":1}},{"type":"item","id":"3323","obj":{"i":3323,"n":"Star-spangled Subligar","l":16,"c":45134,"t":36,"p":100}},{"type":"item","id":"4870","obj":{"i":4870,"n":"Lominsan Anchovy","l":3,"c":29034,"t":47,"p":7}}]}