{"quest":{"name":"Of Siblings and Side-whiskers","location":"Limsa Lominsa","id":67109,"patch":2.38,"sort":10,"icon":100297,"eventIcon":71221,"issuer":1009153,"target":1009744,"involved":[1000153,1002299,1009739,1009740,1009741,1009742,1009743],"genre":77,"journal":["The deputy postmoogle holds a colorful, heavily perfumed envelope in his paw.","The deputy postmoogle has foisted another assignment on you, as is his wont. Play the willing assistant and deliver the garishly decorated missive to a certain gentleman of heightened aesthetic sensibilities who has been seen about Limsa Lominsa.","The man thought to be the renowned aesthetician Jandelaine was in fact his brother, a staid youth by the name of Guillefresne. He informs you that he, in fact, is the author of the missive you carry, explaining that he has traveled from Ishgard to convince his brother to return home and succeed their stricken father as lord of the family domain. Hearing from the chatty madam that Jandelaine has gone to procure a new comb, Guillefresne sets out for the Carpenters' Guild in Gridania. Pursue the youth and speak with Master Beatin.","Master Beatin is seemingly unconvinced that Guillefresne has his brother's best interests at heart. He tells the youth a cryptic tale, instructing him to ponder on its meaning as he journeys to Ul'dah, where Jandelaine has gone to consult with Guildmaster Severian of the Alchemists' Guild.","Adamantly opposed to the notion of his fellow genius returning to Ishgard, Severian stubbornly refuses to provide Guillefresne with any information on his brother's whereabouts, until he has a sudden change of heart for reasons unknown. Travel to the Adventurers' Guild in Limsa, that you might at long last deliver the letter to the man for whom it was intended.","You successfully deliver the letter to Jandelaine. Guillefresne confronts his brother, strongly insisting that the aesthetician abandon his profession and return to the family lands in Ishgard. Jandelaine responds with a flourish of his blades, giving his timid brother stately locks that instill him with newfound confidence and resolve. Now enlightened as to the true callings of both sibling and self, the reborn Guillefresne swears to do his family proud before bidding both you and his brother farewell."],"objectives":["Deliver the perfumed letter to the well-groomed gentleman in Limsa Lominsa.","Speak with Beatin at the Carpenters' Guild in Gridania.","Speak with Severian at the Alchemists' Guild in Ul'dah.","Deliver the perfumed letter to Jandelaine in Limsa Lominsa."],"dialogue":[{"name":"LETTERMOOGLE","text":"Now <span class=\"emphasis\">here's</span> the kind of enthusiasm I like to see! My hardest-working assistant, back to hone <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> skills─and ease <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> beloved supervisor's burden in the process, kupo!"},{"name":"LETTERMOOGLE","text":"Well, it just so happens that I've <span class=\"emphasis\">just</span> the assignment for you. Do you see this most extravagant envelope in my paw? It contains a missive addressed to none other than one Master Jandelaine, the realm-renowned aesthetician."},{"name":"LETTERMOOGLE","text":"Oh, what I would not give to have my whiskers trimmed by those magic scissors! To feel the caress of his fine-toothed comb across my fur! Ahem, but this is neither hither nor thither, kupo."},{"name":"LETTERMOOGLE","text":"But where were we? Ah, yes. I need not tell you that the man is very, ah, <span class=\"emphasis\">devoted</span> to his art. Doubtless he would not even think of accepting such personal correspondence while otherwise occupied with his work."},{"name":"LETTERMOOGLE","text":"Fortunately, I am told that he has been sighted about town of late. Enjoying a hard-earned vacation? Seeking inspiration for his newest hairstyles? I cannot say─only that if there is any opportunity to deliver this letter, it is now. Godsspeed, my loyal friend, kupo!"},{"name":"LETTERMOOGLE","text":"Master Jandelaine is very, ah, <span class=\"emphasis\">devoted</span> to his art. Doubtless he would not even think of accepting such personal correspondence while otherwise occupied with his work."},{"name":"LETTERMOOGLE","text":"Fortunately, I am told that he has been sighted about town of late. Enjoying a hard-earned vacation? Seeking inspiration for his newest hairstyles? I cannot say─only that if there is any opportunity to deliver this letter, it is now. Godsspeed, my loyal friend, kupo!"},{"name":"GOFUJINN","text":"Wedded bliss! Eternal happiness! Mine, at long last, and I have this man to thank for it all! How can I even begin to express my gratitude?"},{"name":"GUILLEFRESNE","text":"What a ravishing lady. Her husband-to-be is quite a fortunate man, would you not─hm? You've a delivery for me?"},{"name":"GUILLEFRESNE","text":"...I fear there must be some mistake. I can assure you that this letter is not intended for me, as it was I who penned it."},{"name":"GUILLEFRESNE","text":"That said, I suppose 'tis no wonder that I am oft mistaken for my brother. We do share a certain family resemblance."},{"name":"GOFUJINN","text":"Y-Your brother!? Why, now that you mention it... Good gods, you're like two jade peas in a pod!"},{"name":"GOFUJINN","text":"And, wait a moment...I know you, too! You're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who brought about my rebirth! The one who guided me from the shadows of self-doubt to a fashionable new world of assurance and aplomb!"},{"name":"GOFUJINN","text":"To think that the man I first thought some depraved killer would prove to be my savior. And it was you─yes, you─who showed me the light. Why, thanks to you two, one of the most eligible bachelors in all of Limsa now seeks my hand in marriage!"},{"name":"GUILLEFRESNE","text":"I daresay, milady, that this comes as little surprise. Only a blind man or a fool could fail to recognize your radiant beauty."},{"name":"GOFUJINN","text":"Tee hee─quite the charmer, you are! But you must understand, it was your brother who brought out the beauty inside me. Should you encounter him in your travels, do pass along my gratitude, Master...?"},{"name":"GUILLEFRESNE","text":"(-Guillefresne-)Ah, but where are my manners? I am Guillefresne, of House...well, you are not like to know of us, but perhaps you do know of House Dzemael, with whom we share common ancestry."},{"name":"GUILLEFRESNE","text":"(-Guillefresne-)It is a matter related to my house─more precisely, its line of succession─that has brought me to this nation. Our father, you see, has been stricken with an illness most grave."},{"name":"GUILLEFRESNE","text":"(-Guillefresne-)Though he yet clings to life, his strength wanes with each passing day. In a moon's time, we will need an heir─and there is only one man in the realm who can fill that role."},{"name":"GUILLEFRESNE","text":"(-Guillefresne-)For the past five years, I said nothing as my elder brother idled away his days crafting coiffures, but I can remain silent no longer! A duty far greater than the trimming of locks calls Jandelaine back to Ishgard, and I shall not leave this realm until he stands at my side!"},{"name":"GOFUJINN","text":"Master Jandelaine...of noble birth!? He always did have a most dignified air about him. If you are looking for your brother, he mentioned something about heading off to procure a new comb. Only the finest of tools for my wedding day, he said."},{"name":"GUILLEFRESNE","text":"(-Guillefresne-)A comb! The Carpenters' Guild is located in the nation of Gridania, is it not? I suspect that is where we will find my brother. We must away at once!"},{"name":"GUILLEFRESNE","text":"(-Guillefresne-)I trust that you will see this missive delivered safely to my brother's hands. I have a pressing matter to attend to, but will join you in Gridania as soon as I am able. Safe travels to you, and good day, milady."},{"name":"GOFUJINN","text":"Well, that young man certainly dashed off in a hurry. If you've a mind to deliver that letter to his brother, you'd best make for the Carpenters' Guild, and quickly."},{"name":"GOFUJINN","text":"If you've a mind to deliver that letter to his brother, you'd best hurry off to the Carpenters' Guild. Oh, I simply cannot wait to see what magic Master Jandelaine will work upon these locks for my wedding day!"},{"name":"GUILLEFRESNE","text":"I can scarce believe the tales that Master Beatin tells. Have the years away from Ishgard truly changed my brother so?"},{"name":"BEATINE","text":"Looking for Jandelaine, are you? As I just told his brother, the man conducted his business, then went on his way."},{"name":"GUILLEFRESNE","text":"Bah! How can my brother so flippantly forsake duty and family!? It makes not a whit of sense!"},{"name":"BEATINE","text":"Perhaps not to you. It would seem you have thoroughly convinced yourself that Jandelaine is the one best suited for this duty you would ask of him."},{"name":"GUILLEFRESNE","text":"You would suggest he is not!? I'll not stand by while you besmirch my brother's good name!"},{"name":"GUILLEFRESNE","text":"While it is true that in recent days he is little more than a glorified beard-trimmer, I saw Jandelaine serve as our father's right hand since he was scarcely a man grown! He was the very paragon of duty and honor─an example to all around him!"},{"name":"BEATINE","text":"Calm yourself, boy. I hold your brother in the highest esteem. It is precisely for this reason that I speak as I do. Allow me to tell you a tale."},{"name":"BEATINE","text":"Once upon a time there lived a young carpenter. He was possessed of some talent and great zeal for his craft, and his masters were convinced that the boy would come to great things in the guild. But, ah, the road to success is fraught with many perils..."},{"name":"BEATINE","text":"After suffering the loss of a...close friend...the youth began to lose his way. Racked with despair, he let both mind and body go to waste. His close-cropped coif grew to a rampant snarl, obstructing his field of vision and getting tangled in his hands as he wielded his hammer.<br>His works suffered, and his masters began to ask if he might not consider another profession."},{"name":"BEATINE","text":"One day, as he shambled to the workshop, he was ambushed by a strange man wielding twin blades. Before he could even realize what was happening, his tangled locks lay on the ground in a scattered heap. In that moment, he came to a realization."},{"name":"BEATINE","text":"Thanking the man for his services, he returned to his workshop. As if by magic, the youth wielded his tools with a newfound focus and confidence. Works of surpassing quality emerged from his hands, and he reclaimed his status as the guild's rising star.<br>Today, he stands before you as timbermaster, wearing his hair in the same fashion as he did the day of his rebirth."},{"name":"BEATINE","text":"Plant a sapling in the Twelveswood and one day it shall grow into a mighty oak. Plant it on a snowy crag in Coerthas and it is not like to survive the first winter. If you would seek out your brother, pray consider these words. You will find him at the Alchemists' Guild in Ul'dah."},{"name":"GUILLEFRESNE","text":"I thank you, my good man! While I cannot say that the moral of the tale is immediately clear to me, I will take some time to ponder your words on my journey. Fare thee well!"},{"name":"BEATINE","text":"Like a sturdy cedar, growing strong and true, that boy. But allow cedar to dry overmuch, and it is quick to splinter and shatter..."},{"name":"BEATINE","text":"You seek Jandelaine, too, yes? Pray watch over this brother of his─I trust this journey will take him further than he can even imagine. And send my regards to Severian..."},{"name":"BEATINE","text":"Jandelaine presiding over his lands from the cold, vast chambers of a manse in Ishgard. If one were to plant an island palm amidst the snowy drifts of Ishgard, I wonder how it might fare?"},{"name":"GUILLEFRESNE","text":"This stubborn fool will tell me nothing! I daresay conversing with the walls of Snowcloak would prove more fruitful!"},{"name":"SEVERIAN","text":"You, too, come in search of Jandelaine? Do I look like the man's mother? He had business here, and that business is now done. He has moved on, and I suggest the two of you do the same. I need not tell you that I am a busy man."},{"name":"GUILLEFRESNE","text":"How many times must I repeat myself!? Simply tell me where my brother has gone, and I will be glad to leave you to your dabblings and tinkerings."},{"name":"GUILLEFRESNE","text":"Bah! I beg of you, friend, talk some sense into this man! Surely in your capacity as the postmoogle's assistant, your words carry some authority!?"},{"name":"SEVERIAN","text":"The order could come from the sultana herself, and I would say nothing! Sending a man of such rare genius off to some musty, dreary Ishgardian manse? Why, the mere thought makes my blood boil! If you care so much for your family demesne, go defend it yourself!"},{"name":"GUILLEFRESNE","text":"Would that I could! But I fear I am not─and never have been─my brother's equal."},{"name":"SEVERIAN","text":"Yes, any half-wit could see that. Jandelaine is possessed of both a brilliant mind and an insatiable curiosity─a combination I have rarely seen in any but myself."},{"name":"SEVERIAN","text":"You, on the other hand, are about as sharp as a sack of rocks, and half as interesting. If there's anyone fit to being bound by the stuffy traditions of your homeland, I daresay it's you."},{"name":"SEVERIAN","text":"...But wait. Yes...yes, of <span class=\"emphasis\">course</span>! I take back everything I said earlier. By all means, go seek out your brother! Indeed, I urge you to do so with all haste!"},{"name":"SEVERIAN","text":"Jandelaine set off for the Adventurers' Guild in Limsa Lominsa. Make your way there at once, lest I pour some acid down your trousers to speed you on your way!"},{"name":"GUILLEFRESNE","text":"...Ahem. I know not what led to this change of heart, my good man, and yet I thank you for seeing reason. Good day."},{"name":"SEVERIAN","text":"Mwahaha! Mwahahahahahaha! The boy is a fool, but he is an <span class=\"emphasis\">amusing</span> fool, which I must say is the best kind."},{"name":"SEVERIAN","text":"And you, what are you still doing here? Were you not after Jandelaine yourself? Off to Limsa with you! I suspect there will be quite the show, and you'll not want to be late."},{"name":"SEVERIAN","text":"Mwahaha! Mwahahahahahaha! The boy is a fool, but he is an <span class=\"emphasis\">amusing</span> fool, which I must say is the best kind."},{"name":"SEVERIAN","text":"But you, were you not after Jandelaine yourself? Off to Limsa with you! I suspect there will be quite the show, and you'll not want to be late."},{"name":"GUILLEFRESNE","text":"I have traveled long and far, and finally I have found you! Do you hear me, Brother? Father needs our help, and none save you can follow in his proud footsteps!"},{"name":"JANDELAINE","text":"A letter? For me? As you can see, I am somewhat...occupied...at the moment, but for you, darling? Anything!"},{"name":"GUILLEFRESNE","text":"Remarkable, friend! To travel the realm thrice over to deliver my missive to my brother. You are a true exemplar to messengers everywhere!"},{"name":"JANDELAINE","text":"Well spoken, brother mine! I have found myself quite taken with this adventurer as well. It is as if we share a mind!"},{"name":"GUILLEFRESNE","text":"If you feel this way, Brother, then why do you resist your calling!? Father needs you! <span class=\"emphasis\">I</span> need you! How long do you intend to persist in this folly!?"},{"name":"JANDELAINE","text":"When did you become such a dreadful bore, dear brother? Have the chill winds of our homeland frozen the heart that once beat inside you?"},{"name":"GUILLEFRESNE","text":"I am simply answering the call of family and duty─a call that I ask you to heed as well. You are the eldest son. None save you can carry on the family line..."},{"name":"JANDELAINE","text":"In these five years, the child I knew has grown into a man. And yet, there is an unsightliness about you. This meekness, this timidity does not befit you. My hands tingle in disgust!"},{"name":"JANDELAINE","text":"Just as I live, this unspeakable embodiment of ugliness must die. Begone, foul demon!"},{"name":"GUILLEFRESNE","text":"B-Brother? What is this you say...?"},{"name":"GUILLEFRESNE","text":"Ye gads, no! Aieeeeeeeeeeee!"},{"name":"JANDELAINE","text":"Hair extensions woven from the tail hair of a jet black Eastern steed! A mustache plucked from a mighty behemoth's mane! Tell me, Brother, how do you feel!?"},{"name":"GUILLEFRESNE","text":"Why, it is as if the shadows of self-doubt have been purged from my soul, cast away by the light of a singular, unwavering confidence!"},{"name":"GUILLEFRESNE","text":"Where once stood a faltering child, now stands a man brave and bold! Who knew that long locks and facial hair could be so empowering? It is as if I have died and been born anew!"},{"name":"JANDELAINE","text":"Just so, Brother! You were always meant to follow in Father's footsteps, just as I was to pursue this path of my own. I have simply brought out the man that was always inside you."},{"name":"JANDELAINE","text":"A most happy nameday, to a brother reborn!"},{"name":"GUILLEFRESNE","text":"The words of Masters Beatin and Severian... It all seems so clear now! Good gods, how could I have been so blind!?"},{"name":"GUILLEFRESNE","text":"Forgive me for making mock of your art, Brother. The people of this realm need you, that much is clear. Worry not for Father, or for our lands─yes, I shall return to Ishgard and do our family proud!"},{"name":"GUILLEFRESNE","text":"For all those years that I looked to my brother with admiration, I never truly comprehended his greatness until this day. For this, I have you to thank, friend. Till our paths cross again!"},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":2160,"items":[{"id":7005}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[66746]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1009744","obj":{"i":1009744,"n":"Jandelaine","l":28,"q":1}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1009739","obj":{"i":1009739,"n":"Well-groomed Gentleman","l":28,"q":1}},{"type":"npc","id":"1009740","obj":{"i":1009740,"n":"Reborn Madam","l":28,"q":1}},{"type":"npc","id":"1009741","obj":{"i":1009741,"n":"Guillefresne","l":52,"q":1}},{"type":"npc","id":"1009742","obj":{"i":1009742,"n":"Guillefresne","l":41,"q":1}},{"type":"npc","id":"1009743","obj":{"i":1009743,"n":"Guillefresne","l":28,"q":1}},{"type":"item","id":"7005","obj":{"i":7005,"n":"Jandelaine's Token","l":1,"c":25918,"t":61}},{"type":"quest","id":"66746","obj":{"i":66746,"n":"Beauty Is Only Scalp Deep","g":91,"l":"Limsa Lominsa","s":150,"f":1}}]}