{"quest":{"name":"Bring Your Own Ectoplasm","location":"North Shroud","id":67102,"patch":2.35,"sort":65,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009216,"target":1009216,"involved":[1009221],"genre":43,"usedItems":[8082,8125],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A crafter makes and a warrior unmakes. What then is an adventurer, who does both and more?<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 16 and above, and the battle portion for Disciples of War or Magic level 49 and above.","Jezul Ahuatan wonders if you might be able to craft some hyperconductor components. You must begin by collecting an unusual material. In the Ogre's Belly in the Coerthas highlands, there are many fell things─among them a swarm of will-o'-the-wykes. Slaying one will draw the ire of St. Daniffen's fire, from the vanquished husk of which you can obtain a sample of semi-stable ectoplasm.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The ectoplasm pulses with hypnotic energy, but you have better things to do than stare slack-jawed into the light. Present the ectoplasm to Norbettaux at Camp Dragonhead, and ask him to grant you access to the crafting facility.","Norbettaux has prepared the crafting facility for your use. With the materials you have obtained, synthesize two high-quality hyperconductor components, and deliver them to Jezul Ahuatan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Detailing II</span> wears off or the synthesis ends in failure, you may try again by speaking with Norbettaux.","Jezul Ahuatan pronounces the hyperconductor components more than satisfactory, and pays you the compliment of speaking to you as kindred. Though you have never been and never will be the Second of Ehcatl, you understand of what he speaks─that a <span class=\"alternative-container\"><span class=\"alternative\">woman's</span><span class=\"alternative\">man's</span></span> work is more than the sum of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> jobs."],"objectives":["Slay a will-o'-the-wyke to lure out St. Daniffen's fire.","Deliver the ectoplasm to Norbettaux at Camp Dragonhead.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize hyperconductor components <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the hyperconductor components <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Jezul Ahuatan the Second</span></span>."],"dialogue":[{"name":"JEZULAHUATAN","text":"Good, your crafting hands are? Squee-squee... Sluggish are our ships, more than I like...and more than is liked by Chief Totoloc. Need top-top-top hyperconductor components, we do."},{"name":"JEZULAHUATAN","text":"Not complicated, you would think. Just improve aetheric conduction in metal plates, say some. Know─squawk!─they do. Tricky-tricky is wind-aspected aether. Special material, this process requires."},{"name":"JEZULAHUATAN","text":"Increase conduction for wind-aspected aether, a certain type of emulsion will. Hardly believe the ingredients needed, you would. Squee-squee..."},{"name":"JEZULAHUATAN","text":"Tricky matter, it is...squee-squee. Using hyperconducting matter in components, an elegant solution it is. But sqqquawk! Easy feat to obtain such things, it is not."},{"name":"JEZULAHUATAN","text":"A slug of semi-stable ectoplasm from St. Daniffen's fire, you will need. This creature, you know? Dwell in the Ogre's Belly, they do. Lie to you, I will not. Squawkka-wak! Before the end, killings, there will be."},{"name":"JEZULAHUATAN","text":"At your fighting weight, you are? Difficult, it is, with featherless ones. Thewy, you must be. Swarm, the Ogre's Belly does, with will-o'-the-wykes. Slay one, you must, then squawkka-wak! Come charging, St. Daniffen's fire will. Kill quick-quick-quick, then wring out the ectoplasm, you must."},{"name":"JEZULAHUATAN","text":"Is common, the rest of the material. Supply your needs for two components, the crafting facilities at Camp Dragonhead will. Be sure of that, you can. Squawk! Reliable, Norbettaux is."},{"name":"JEZULAHUATAN","text":"Craft those hyperconductor components, you will? Settled, the stomach is? Sqqquawk! The material you need, take from a St. Daniffen's fire, you can. In the Ogre's Belly, the creature dwells. Is a bit nasty, the milking, squawkka-wak...but no other good choices, there are."},{"name":"POP","text":"You see the baleful glow of St. Daniffen's fire!"},{"name":"NORBETTAUX","text":"Welcome to our humble crafting facility! You're a touch pale─a rigorous bout of gathering, I take it? Crafting will put the roses back in those cheeks in no time!"},{"name":"NORBETTAUX","text":"Hm, a curious sort of material you've brought... Best not to know more, I think. The crafting facility has a goodly stock of many materials. Help yourself to whatever you need."},{"name":"NORBETTAUX","text":"Do come calling if you need more material, or need to spend more time using the facilities."},{"name":"NORBETTAUX","text":"How marvelous, you've finished! I must say, that was one of the odder materials I've seen in a while, but now you have some fine-looking components to deliver. Do feel free to return if the components do not pass the client's muster─your visits are always a welcome diversion!"},{"name":"JEZULAHUATAN","text":"Not bad, you look. Bad dreams, you will have? Sqqquawk, happy I am to see you alive. Lost are many, for a squirt of ectoplasm...but complete, the components are?"},{"name":"JEZULAHUATAN","text":"General conduction...good, it is. Wind-aspected conduction...good, it is! Squawkka-wak! Not the limit, the sky is! Fly better-better-better, the ships will. Top-top-top, these components are!"},{"name":"JEZULAHUATAN","text":"Fight, you can, and craft, you can, but more important─<span class=\"emphasis\">work</span>, you can! For the Second of Ehcatl, the same is required. Sqqquawk! But only about the skills, it is not. The will to use them, it is─use high and low, day in and day out...squawkka-wak!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":769,"reputation":50,"items":[{"id":21072},{"num":2,"id":21073},{"id":5707,"one":1},{"id":5712,"one":1},{"id":5687,"one":1}]},"reqs":{"beastrank":6,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009216","obj":{"i":1009216,"n":"Jezul Ahuatan The Second","l":57,"q":7}},{"type":"npc","id":"1009221","obj":{"i":1009221,"n":"Norbettaux","l":63,"q":7}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"5687","obj":{"i":5687,"n":"Gatherer's Guerdon Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Gathering","category":2}}},{"type":"item","id":"8082","obj":{"i":8082,"n":"Hyperconductor Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8125","obj":{"i":8125,"n":"Hyperconductor Component","l":1,"c":21003,"t":63}}]}