{"quest":{"name":"In Case of Emergency","location":"North Shroud","id":67103,"patch":2.35,"sort":66,"interval":"daily","repeatable":1,"beast":5,"eventIcon":71222,"issuer":1009216,"target":1009216,"involved":[1009221],"genre":43,"usedItems":[8083,8126],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A wise Ixal knows well the value of auxiliary systems, and Jezul Ahuatan the Second is no exception.<br>※The crafting portion of this quest is recommended for Disciples of the Hand level 16 and above, and the battle portion for Disciples of War or Magic level 49 and above.","Jezul Ahuatan will not declare the <span class=\"emphasis\">Dezul Qualan</span> finished until an auxiliary aerodynamo has been installed. Although their model is nearly complete, it lacks a key component─a component which can only be crafted with materials currently in the possession of the Ixal dwelling in Natalan. Though it be a dangerous task, you have no choice but to infiltrate the stronghold and steal the materials.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The auxiliary aerodynamo component materials are now yours. Present them to Norbettaux at Camp Dragonhead in order to gain access to the crafting facility under his care.","Norbettaux has prepared the crafting facility for your use. With the materials you have obtained, synthesize a high-quality auxiliary aerodynamo component, and deliver it to Jezul Ahuatan at Ehcatl.<br><br>※In the event that the status <span class=\"highlight\">Facility Access: Finishing II</span> wears off or the synthesis ends in failure, you may try again by speaking with Norbettaux.","Within Jezul Ahuatan beats the heart of an idealist. To him, no risk is too great and no benefit is too small, should it serve to further his people's goals. Should you share his feelings, he would no doubt be grateful─and all the more willing─to entrust you with more dangerous tasks."],"objectives":["Obtain auxiliary aerodynamo component materials from Ixali silver pots in Natalan.","Present the auxiliary aerodynamo component materials to Norbettaux at Camp Dragonhead.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an auxiliary aerodynamo component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the auxiliary aerodynamo component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Jezul Ahuatan the Second</span></span>."],"dialogue":[{"name":"JEZULAHUATAN","text":"For the best, we hope, yet for the worst, we must prepare. Buzzard who forsakes prudence for speed, woe betide him! Sqqquawk!"},{"name":"JEZULAHUATAN","text":"Primary aerodynamo, we have, but auxiliary aerodynamo, we require as well. Nearly complete, ours is, yet squawkka-wak! High-quality shielding, we lack."},{"name":"JEZULAHUATAN","text":"Primary aerodynamo, we have, but auxiliary aerodynamo, we require as well. Nearly complete, ours is, yet squawkka-wak! High-quality sealant, we lack."},{"name":"JEZULAHUATAN","text":"Primary aerodynamo, we have, but auxiliary aerodynamo, we require as well. Nearly complete, ours is, yet squawkka-wak! High-quality dampeners, we lack."},{"name":"JEZULAHUATAN","text":"For want of materials, this component, we cannot prepare. Worse yet, held by the buzzards of Natalan, they are! In silver pots for safekeeping, squirreled away, these materials have been. Need them not, the buzzards! Hold them solely to torment us, they do! Sqqquawk!"},{"name":"JEZULAHUATAN","text":"But no longer, I say─no longer! Squee-squee... Friend and warrior, featherless one is, yes? Then agree to liberate the materials from their confines, you will! Next, to the crafting facilities of Camp Dragonhead, you will go. Appreciated, materials would be, but preferred, component is!"},{"name":"JEZULAHUATAN","text":"Liberate the materials from their confines, you will! Then craft component in Camp Dragonhead, you must!"},{"name":"JEZULAHUATAN","text":"To sneak into Natalan, you can attempt, but charge and squawkka-wak, if all else fails!"},{"name":"NORBETTAUX","text":"Master Tataramu's associate, I presume? Welcome to our humble facility! What manner of materials will you be working with this fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>?"},{"name":"NORBETTAUX","text":"Pried from the clutches of the Ixal in Natalan? The things we do for materials! 'Twas prudent of you to bring excess as well─I shall hold on to it for safekeeping. As for you, my friend─craft away!"},{"name":"NORBETTAUX","text":"If you should lack for material or wish to use the facility again, you need only say so."},{"name":"NORBETTAUX","text":"Finished already? Then I shan't detain you! Godsspeed to you, my friend! Should you require aught else─say, additional time with the facility, or your excess materials─know that both will always be available for you."},{"name":"JEZULAHUATAN","text":"Squee-squee! Afeared, I was, that dead, you were─yet stand you here, alive and well! Our coveted component, you have brought as well?"},{"name":"JEZULAHUATAN","text":"In our talons, the auxiliary aerodynamo component is, at long last! Final testing, we can soon commence!"},{"name":"JEZULAHUATAN","text":"Much effort for small gain, think featherless one? Sqqquawk! Require great risks, great goals do, even if the benefit obtained in so doing is small-small-small. Perfect, the <span class=\"emphasis\">Dezul Qualan</span> must be, and to that end, inconsequential, no improvement is!"},{"name":"POPMESSAGE","text":"You now have access to the crafting facility."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":709,"reputation":50,"items":[{"id":21072},{"num":2,"id":21073},{"id":5702,"one":1},{"id":5712,"one":1},{"id":5697,"one":1}]},"reqs":{"beastrank":6,"jobs":[{"lvl":1,"id":33}]}},"partials":[{"type":"npc","id":"1009216","obj":{"i":1009216,"n":"Jezul Ahuatan The Second","l":57,"q":7}},{"type":"npc","id":"1009221","obj":{"i":1009221,"n":"Norbettaux","l":63,"q":7}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"item","id":"21073","obj":{"i":21073,"n":"Ixali Oaknot","l":1,"c":65054,"t":100}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"item","id":"8083","obj":{"i":8083,"n":"Auxiliary Aerodynamo Component Materials","l":1,"c":25919,"t":63}},{"type":"item","id":"8126","obj":{"i":8126,"n":"Auxiliary Aerodynamo Component","l":1,"c":21003,"t":63}}]}