{"quest":{"name":"Let the Hunt Begin (Immortal Flames)","location":"Ul'dah","id":67101,"patch":2.3,"sort":500,"unlocksFunction":1,"eventIcon":71341,"issuer":1001634,"target":1001379,"genre":192,"journal":["The hectic flush of commerce is upon Lieutenant Mimio of the Immortal Flames, and she fully intends for you to catch the fever.","Lieutenant Mimio is pleased to share with you that the Alliance has instituted a bounty system called the Hunt. If you would see what the officer is so excited about, a visit to the Hall of Flames is in order. You may present yourself to the Hunt billmaster to learn more.","Though the Hunt billmaster seems to have dealt with more than his fair share this day, you have still managed to learn from him how you might join in the Hunt. He is also the man to go to should you require more information on the subject, or if you have hard-earned Allied Seals to turn in. For now, do your part to preserve the peace, and you will be richly rewarded."],"objectives":["Speak with the Hunt billmaster at the Hall of Flames."],"dialogue":[{"name":"MIMIO","text":"Ah, sound the horns, for the Hunt begins! Quickly now, lend me your ears: the Eorzean Alliance has finally agreed to put a bounty on the worst of the lawless. About time!"},{"name":"MIMIO","text":"I mean the creatures and men that gum up the works like errant grains of sand. They're to be marked for extermination, praise the Traders, and such rewards as befit the task paid out. They call it the Hunt, a prosaic sort of name if you ask me."},{"name":"MIMIO","text":"Wonderful to see the Alliance come together for such free market initiatives! I might say that cooperation on this point hardly makes a lie of the competition in less, ah, fecund areas. If there is enough to share, we share. If not, then it's survival of the fittest."},{"name":"MIMIO","text":"But I forget myself! It is the Hunt that requires your services, not the never-ending bickering of nations."},{"name":"MIMIO","text":"And perhaps <span class=\"emphasis\">you</span> need the Hunt as well! The work is no sinecure, but the rewards are rich. Speak with the Hunt billmaster if you would hear more."},{"name":"MIMIO","text":"The Hunt rewards you amply for dispatching a mark. If you would hear more, seek out the Hunt billmaster within."},{"name":"MOBOFFICER","text":"What do <span class=\"emphasis\">you</span> want? Ah, the Hunt. Do excuse my churlishness─I have my reasons. But let's get on with it, shall we?"},{"name":"MOBOFFICER","text":"The Hunt board─it's a board. Not much more to say beyond that. It's for posting bills. They are for the marks to be hunted. One bill for each merchandise─excuse me, black-hearted villain."},{"name":"MOBOFFICER","text":"You'll notice there are two kinds of bills. There's the regular kind for regular wares─pardon me, regular blackguards─and an elite mark bill for something a bit more special. Stronger, more murderous, and so forth. Before you take one of these on, you may want to consult a hunter-scholar. That's a veteran of the Hunt who knows the Raimdelle Codex by heart."},{"name":"MOBOFFICER","text":"The rest is straightforward: kill the mark and claim your reward in Allied Seals. These I will accept in exchange for exclusive wares."},{"name":"MOBOFFICER","text":"Do note that I do not only deal in seals. I am also the resident expert in the Hunt, and it would be well for you to remember whom to come crying to."},{"name":"MOBOFFICER","text":"I do hope that you'll not disappoint. After all, this is for coin and country!<br>...Ahem. Well, that's more than enough of <span class=\"emphasis\">that</span>, thank you very much."}],"reward":{"gil":433,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}],"gc":3,"gcrank":9}},"partials":[{"type":"npc","id":"1001634","obj":{"i":1001634,"n":"Mimio Mio","l":40,"q":3,"t":"Flame Lieutenant"}},{"type":"npc","id":"1001379","obj":{"i":1001379,"n":"Hunt Billmaster","l":40,"s":4,"q":1,"r":1,"a":1801,"c":[8.18,9.37]}}]}