{"quest":{"name":"Over the Wall","location":"Fortemps Manor","id":67119,"patch":3.0,"sort":4,"icon":100394,"eventIcon":71201,"issuer":1012328,"target":1011231,"involved":[1012331,1012332,1012333],"genre":3,"journal":["Lord Artoirel is less than eager to brief you on his mission.","Ser Artoirel de Fortemps, eldest son of Count Edmont de Fortemps, did not expect to have company on his mission to aid houses Durendaire and Dzemael─a prospect he was not particularly enthusiastic about in the first place, given the ancient rivalries between Ishgard's noble families. Worse, in electing to install you at his son's side, the count has given Artoirel cause to believe that his father does not trust him to carry out his duties alone. Regardless, the knight means to respect Edmont's wishes, and bids you join him at the chocobo stables in Foundation, where you will secure transport to Falcon's Nest.","You learn that Ser Artoirel has already procured a pair of black chocobo porters to carry the two of you beyond Snowcloak and into the western highlands. Secure your belongings and brace yourself for what promises to be a memorable journey.","You arrive in Falcon's Nest none the worse for wear. Speak with Lord Artoirel and see what he would have you do next.","After cursory small talk, Lord Artoirel strides off to look for Ser Redwald, who has command in Falcon's Nest. Follow the young lord and introduce yourself to the knight in charge.","Ser Redwald recounts the tragic fate of Falcon's Nest, which was abandoned during the Ishgardian withdrawal shortly after the Calamity. Happily, it seems the time has come to reclaim what was lost, and through deeds great and small, the House Durendaire knight hopes you will help to facilitate the settlement's reconstruction."],"objectives":["Speak with the chocobokeep in Foundation and journey to Falcon's Nest.","Speak with Artoirel.","Speak with Redwald."],"dialogue":[{"name":"ARTOIREL","text":"Let us begin anew, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I am Ser Artoirel de Fortemps, eldest son of Count Edmont de Fortemps."},{"name":"ARTOIREL","text":"You will forgive me my outburst, I hope. I meant no disrespect. I merely consider myself equal to the duties entrusted to me...unlike some."},{"name":"ARTOIREL","text":"...Haurchefant has spoken of you often. If you are even half the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> he claims, I shall be glad to have you at my side."},{"name":"ARTOIREL","text":"To the matter at hand, then: we will be assisting my <span class=\"emphasis\">esteemed</span> compatriots of houses Durendaire and Dzemael."},{"name":"ARTOIREL","text":"You are aware of our <span class=\"emphasis\">friendly rivalry</span>, I take it? Aye, well, suffice it to say, the prospect of assisting said houses does not fill me with joy."},{"name":"ARTOIREL","text":"However, it is the will of the Holy See that we set aside our differences at this crucial juncture. But we shall speak more of that anon."},{"name":"ARTOIREL","text":"First, we must needs secure transport to Falcon's Nest. Let us make for the chocobo stables in Foundation."},{"name":"STABLEHAND01583","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I've saddled a black chocobo for your journey to the western highlands, as per Lord Artoirel's instruction."},{"name":"STABLEHAND01583","text":"Will this be your first time riding a black chocobo, may I ask? If so, you're in for a treat. As I daresay you know, this particular breed can <span class=\"emphasis\">fly</span>. Given the right conditions, they can carry you quite high, too─even over Snowcloak."},{"name":"STABLEHAND01583","text":"You needn't worry about directing the bird, of course. Like all porters, she's trained to carry you to your destination all by herself─so just relax and enjoy the view! Oh, but be sure not to relax your <span class=\"emphasis\">grip</span>, will you? Two hands on the reins at all times, if you please."},{"name":"SCENE00005","text":"Travel to Falcon's Nest?"},{"name":"SCENE00005","text":"Yes"},{"name":"SCENE00005","text":"No"},{"name":"ARTOIREL","text":"I've secured chocobo porters for the two of us. The chocobokeep has yours."},{"name":"ARTOIREL","text":"The world looks quite different when viewed from the back of an airborne chocobo, does it not? I still find the experience strangely liberating..."},{"name":"ARTOIREL","text":"To business. Ser Redwald is in charge here. He should be expecting us."},{"name":"REDWALD","text":"It has been far, far too long, Lord Artoirel. And who might your companion be?"},{"name":"ARTOIREL","text":"Pray forgive us our lateness, Ser Redwald. I present to you <span class=\"highlight\">Forename Surname</span>, ward of House Fortemps."},{"name":"REDWALD","text":"Ahhh, yes, of course! Lord Drillemont spoke of you. I, Ser Redwald of House Durendaire, do bid you welcome to Falcon's Nest."},{"name":"ARTOIREL","text":"We are both eager to contribute to the settlement's restoration. How may we be of service?"},{"name":"REDWALD","text":"Before we speak of that─would I be correct in assuming that <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> is unfamiliar with our recent history? Then, with your permission, I shall recount the tale for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> benefit."},{"name":"REDWALD","text":"As you may know, Falcon's Nest was once a hamlet with a small garrison of knights and some few villagers. And then came the Calamity."},{"name":"REDWALD","text":"When it became clear that the snow would not stop falling, we had no choice but to order a complete withdrawal. The settlement─and the entirety of the western highlands─were to be abandoned."},{"name":"ARTOIREL","text":"...Abandoned to the heretics. Lady Iceheart and her kind have walked these lands with impunity ever since."},{"name":"REDWALD","text":"Aye, but no longer. The Holy See has commanded the reclamation of the western highlands and the expulsion of heretical elements."},{"name":"REDWALD","text":"Falcon's Nest is key to accomplishing these objectives. But, as you can see, rebuilding the hamlet will be no small undertaking."},{"name":"REDWALD","text":"Our craftsmen require support and protection. Any assistance you can offer will be greatly appreciated."},{"name":"ARTOIREL","text":"As promised, we of House Fortemps are at your disposal, Ser Redwald. You need but tell us where to begin."}],"reward":{"gil":517,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67118]},"next":[67120,67268,67269,67270]},"partials":[{"type":"npc","id":"1012328","obj":{"i":1012328,"n":"Artoirel","l":2320,"q":3}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1012331","obj":{"i":1012331,"n":"Chocobokeep","l":2300,"q":1}},{"type":"npc","id":"1012332","obj":{"i":1012332,"n":"Artoirel","l":2300,"q":1}},{"type":"npc","id":"1012333","obj":{"i":1012333,"n":"Artoirel","l":2200,"q":1}},{"type":"quest","id":"67118","obj":{"i":67118,"n":"The Better Half","g":3,"l":"Ishgard","s":3}},{"type":"quest","id":"67120","obj":{"i":67120,"n":"Work in Progress","g":3,"l":"Coerthas Western Highlands","s":5}},{"type":"quest","id":"67268","obj":{"i":67268,"n":"Contingency Supplies","g":94,"l":"Coerthas Western Highlands","s":5001}},{"type":"quest","id":"67269","obj":{"i":67269,"n":"Stolen Goods","g":94,"l":"Coerthas Western Highlands","s":5006}},{"type":"quest","id":"67270","obj":{"i":67270,"n":"Memories in the Snow","g":94,"l":"Coerthas Western Highlands","s":5007}}]}