{"quest":{"name":"All in the Family","location":"Limsa Lominsa","id":67112,"patch":2.4,"sort":13,"icon":100339,"eventIcon":71221,"issuer":1009153,"target":1006211,"involved":[1006196,1010417],"genre":77,"journal":["The deputy postmoogle would task you with an urgent delivery to Little Ala Mhigo.","Another day, another task from the deputy postmoogle. This time, your furry friend would have you deliver a letter from Hihibaru to his daughter Hihira in Little Ala Mhigo. Though the moogle seems merry as ever, he dispatches you with a warning that there may be more to this missive than meets the eye...","The letter safely in her hands, Hihira reads aloud her father's message, only to discover Hihibaru is stricken with a fatal malady of the stomach. Ever the kindly daughter, however, she is quick to conceive of a cure, a herbal remedy brewed using Trader vetch roots. With panic in her eyes, she begs you unearth three such tubers in Zanr'ak.","Malms of wilderness and dozens of Amalj'aa at your back, you finally come upon patches of Trader vetch. With three tubers from the herb safely in hand, make your way back to Little Ala Mhigo─through the malms of wilderness and dozens of Amalj'aa that stand between you and Hihira.","Though happy to have the crucial roots, Hihira remains worried about her father being alone in his time of need, and asks you to keep a watch over Hihibaru in Highbridge till she can complete her concoction.","You arrive moments before Hihira to find Hihibaru hale as he ever was. The mystery unravels as he reveals that it is his ailing business that causes his gastric distress, not a mortal malady. Livid, Hihira storms off, leaving you to explain the situation to her father. Hihibaru realizes his mistake...and that his daughter is heading straight towards an Amalj'aa camp. Hihibaru begs you follow her into Drybone, and defend her from any dangers about.","You spy Hihira hemmed in by Amalj'aa. Save her from a nasty end.","Spared death on the point of an Amalj'aa spear, a thankful Hihira wends her way home─but only after tasking you with delivering the glad tidings of her safety to Hihibaru in Highbridge.","Heaving a sigh of relief at the news you bring, Hihibaru hands you a neckpiece. He explains the object belonged to his late wife who perished after long moons spent in painful battle with the Green Rot. The man admits his improvidence, both for having excited fear he suffered a similar illness, and for having driven Hihira away years earlier. He entreats you to give the neckpiece─along with his apologies─to Hihira in Little Ala Mhigo.","You deliver Hihira both the neckpiece and her father's words of pride. Deeply moved, the girl tells you of her mother's teachings of kindness, and Hihibaru's thirst for gil. Now, however, Hihira thinks her father a changed man, and vows to have more talk of all these things with him."],"objectives":["Deliver the letter to Hihira in Little Ala Mhigo.","Gather Trader vetch roots in Zanr'ak.","Deliver the Trader vetch roots to Hihira.","Speak with Hihibaru at Highbridge.","Search for Hihira in Drybone.","Rescue Hihira.","Report to Hihibaru.","Deliver the tarnished neckpiece to Hihira."],"dialogue":[{"name":"LETTERMOOGLE","text":"Why, if it isn't just the adventurer I was waiting for, kupo! Have I got an assignment and a half for you today. Why you? Because, my friend, there is no one better suited for the task!"},{"name":"LETTERMOOGLE","text":"I hold in my pouch a letter with your name on it! ...Not <span class=\"emphasis\">literally</span>, of course. I mean simply that I have a missive for Hihira in Little Ala Mhigo, and would have you take it to her. It's from her father, and I've been told it must go out, ahem, <span class=\"emphasis\">post</span>haste! ...Wh–Why aren't you laughing?"},{"name":"LETTERMOOGLE","text":"Anyhow, Hihira is as lovely a girl as you'd ever wish to meet, wise in the ways of alchemy and so kind she gives away medicine to ailing Ala Mhigan refugees─and free of cost, no less! But Hihira has known almost no rest on her crusade, and I worry she's working herself into the ground."},{"name":"LETTERMOOGLE","text":"It would break a postmoogle's heart to deliver a letter with ill tidings to such a saint. So if the message brings anything but joy to Hihira, would you be a dear and aid her with every onze of strength you have, kupo?"},{"name":"LETTERMOOGLE","text":"What are you still lounging about here for!? It's rude to keep a lady waiting. Get to Little Ala Mhigo quick as you can, and give Hihira the letter, kupo!"},{"name":"HIHIRA","text":"What a pleasant surprise, my friend! I've been so enthralled with learning about Ala Mhigan remedies I've quite forgotten when last we spoke. So tell me, what brings you here today? ...What? A letter from my <span class=\"emphasis\">father</span>?"},{"name":"HIHIRA","text":"“Dearest daughter, I fear I am not long for this world. My belly grows worse with every passing day, and I have something I must give you before my time here draws to a close.”"},{"name":"HIHIRA","text":"I...I had no idea my father was ill, let alone with a mortal ailment of the stomach! Our relationship is fraught, I shan't deny it, but neither will I idly watch him die! Why, I just learned of a remedy that ought be potent enough to cure even the Green Rot─and I need only Trader vetch roots to brew it!"},{"name":"HIHIRA","text":"<span class=\"highlight\">Forename</span>, gather me some from Zanr'ak to the south─three bunches, please. I would give all I have to do the plucking myself, but I fear the Amalj'aa would make terribly short work of one so weak as I."},{"name":"HIHIRA","text":"What have the long bells spent studying Ala Mhigan medicine been for if not this? I swear to you, my father will not perish─not if I have aught to say about it!"},{"name":"HIHIRA","text":"<span class=\"highlight\">Forename</span>, please, head south to Zanr'ak and gather three Trader vetch roots for me. I've no hope of saving my father without them!"},{"name":"HIHIRA","text":"I am most relieved to see you have returned unharmed! And what of the Trader vetch roots?"},{"name":"HIHIRA","text":"Thank goodness! Though it will take no small time to grind and steep these tubers, at least now I can complete my draught. &lt;sigh&gt; Yet I find little comfort in that thought. Visions of my father all alone and in agony weigh all too heavily upon my mind for that."},{"name":"HIHIRA","text":"He is simply too proud to ask for aid of those around him, especially now he has put home behind him to organize his merchants from Highbridge. Please, <span class=\"highlight\">Forename</span>, would you go and be a friend to him where none else can? I promise I shan't be more than few malms behind you with the remedy."},{"name":"HIHIRA","text":"I just need a few short bells to complete my remedy. Won't you keep my father company until then?"},{"name":"HIHIRA","text":"You are sure to find him in eastern Thanalan, at the foot of Highbridge. Please, await me there─I will not be long, I promise!"},{"name":"HIHIBARU","text":"Welcome back, my friend! I <span class=\"emphasis\">knew</span> you weren't immune to the lure of fine merchandise! Mayhap I can interest you in a─ Dear me, why do you look like one bound for the lichyard?"},{"name":"HIHIBARU","text":"Slow down─a <span class=\"emphasis\">fatal</span> ailment of the stomach? Me!? Gods be good, this is certainly the first <span class=\"emphasis\">I'm</span> hearing of it!"},{"name":"HIHIRA","text":"Father, I have it! The remedy is done!"},{"name":"HIHIBARU","text":"Hihira! Bless my soul, what brings you to these parts?"},{"name":"HIHIRA","text":"I...I came to deliver the remedy. Please, you must drink it quickly lest its effects be lessened!"},{"name":"HIHIBARU","text":"For you, my dear, I would swig anything swiftly. Just allow me one small question beforehand─a remedy for <span class=\"emphasis\">what</span>, exactly?"},{"name":"HIHIRA","text":"It's an Ala Mhigan infusion for your stomach! Which...which <span class=\"emphasis\">does</span> still ail you, does it not?"},{"name":"HIHIBARU","text":"Ahhh... Yes, yes, of course, <span class=\"emphasis\">that</span> ailment. My girl, I'm afraid it troubles me terribly! A man can only take so much pain in one lifetime, and I'm near ready to cry mercy."},{"name":"HIHIBARU","text":"It's my own damned fault, always blinded by pride and the glitter of gil as I was. Thal take me, I was so <span class=\"emphasis\">sure</span> business would take root and grow mighty in this wasteland! But I have little and less to show for the years I've poured into this place."},{"name":"HIHIBARU","text":"To call what I make every moon a pittance does injustice to the word. Why, merely opening my ledgers has me doubled over grasping my stomach in pain! Things have grown so dismal I might even give up being a merchant. My life is near over..."},{"name":"HIHIRA","text":"...What?"},{"name":"HIHIBARU","text":"What's what, dearest?"},{"name":"HIHIRA","text":"Your life is near over...<span class=\"emphasis\">as a merchant</span>? That's all? You have no mortal sickness of the stomach, nor are you headed for an early grave?"},{"name":"HIHIBARU","text":"An early grave? Ahahaha! Why would you possibly think that? Ah, but I'd forgotten you make every molehill into a mountain, Hihira. Really, my girl, you ought to have a thicker skin by now."},{"name":"HIHIRA","text":"I...I was merely concerned for your health, Father."},{"name":"HIHIBARU","text":"Good gods, no one has ever perished from a stomachache! But no matter. I <span class=\"emphasis\">am</span> glad you're here, even if you've come on a fool's errand. I've a gift for you─please, take it."},{"name":"HIHIRA","text":"...No."},{"name":"HIHIBARU","text":"What's that? Speak up, Hihira."},{"name":"HIHIRA","text":"I want nothing from you now, nor anything to do with you ever again!"},{"name":"HIHIBARU","text":"...What in the name of the Twelve has gotten into her?"},{"name":"HIHIBARU","text":"B-But I never meant... Good gods, is that <span class=\"emphasis\">really</span> what I wrote? &lt;sigh&gt; Hihira had the right of it, then. I've been a complete arse of a father, leading her so astray with that letter."},{"name":"HIHIBARU","text":"What was I thinking, calling her too sensitive? Thal take me, I must find her at once and apologize! But which way did she...?"},{"name":"HIHIBARU","text":"Bloody hells! Hihira just ran due south─straight towards an Amalj'aa encampment!"},{"name":"HIHIBARU","text":"Adventurer, please! You must follow her and keep her safe from those lizardmen!"},{"name":"HIHIBARU","text":"Why in the seven hells are you still here!? Scour Drybone for Hihira before the Amalj'aa find her!"},{"name":"HIHIRA","text":"S-Stay back!"},{"name":"POP","text":"You sense a hostile presence!"},{"name":"BALLOON","text":"Behold, another trespassing heathen!"},{"name":"BALLOON","text":"Death to all who do not serve Lord Ifrit!"},{"name":"HIHIRA","text":"Th-Thank you, <span class=\"highlight\">Forename</span>. Gods, what possessed me to come here? I was a fool for letting my father upset me so, and for blundering so near to the Amalj'aa."},{"name":"HIHIRA","text":"All I wish to do now is return to Little Ala Mhigo, and think things over for a spell. I...I <span class=\"emphasis\">suppose</span> my father ought to know no harm has come to me, but I have no stomach for the man at the moment. Would you please tell him in my stead?"},{"name":"HIHIRA","text":"Thank you for saving me from those awful Amalj'aa earlier. Er...how did my father take the news? Oh, you haven't spoken with him yet? Well, just tell him I am in no danger when you have a moment to spare."},{"name":"HIHIBARU","text":"What of my daughter!? Has something befallen her!? <span class=\"emphasis\">Well</span>!?"},{"name":"HIHIBARU","text":"...She's safe, then? Thank the gods above for that! I've never been more worried in my life, nor felt such sharp pains in my belly as while I was waiting for your news. What was I to do but take a swig of that remedy Hihira brought?"},{"name":"HIHIBARU","text":"Let me tell you, it's <span class=\"emphasis\">amazing</span> stuff─a mouthful eased the cramping, and a cup cleansed the pain completely! I had no idea my daughter was such an alchemical prodigy! Why, this remedy is easily worth its weight in gold."},{"name":"HIHIBARU","text":"It would be criminal to waste this kind of genius, or hide such a miraculous elixir from the realm. You <span class=\"emphasis\">must</span> ask Hihira if she can brew more─to put to market, of course!"},{"name":"HIHIBARU","text":"I'm not asking this to line my own coffers, mind you. No, my daughter created the best, and the whole realm will be all the better for having access to it. Just <span class=\"emphasis\">think</span> of the lives that could be saved if the remedy were made available to all Eorzea through my network!"},{"name":"HIHIBARU","text":"Of course, my daughter won't believe my motives are pure, so I'd have you give her this keepsake─a favorite of my late wife's─as proof of my sincerity."},{"name":"HIHIBARU","text":"She was a victim of the Green Rot, my wife. And for Hihira... Imagine seeing the woman who bore you curled up in soiled smallclothes, screaming of agony in her stomach half the time and sobbing the other─<span class=\"emphasis\">that's</span> the memory of her mother Hihira carries."},{"name":"HIHIBARU","text":"I should have remembered that when writing the blasted letter, but, being the lackwit I am, instead I sent Hihira into a panic. Little wonder calling her too sensitive made her livid!"},{"name":"HIHIBARU","text":"Mayhap if I hadn't poisoned our relationship, we could have avoided this ugly business altogether. If only I had not driven the girl away by calling her a naive child all those years ago... All she wanted to do was heal the ailing in Little Ala Mhigo, after all."},{"name":"HIHIBARU","text":"You don't want for alchemical knowledge, but whence comes the gil for your grand crusade, I asked her. You'll die among the beggars you tried to save if you're foolish enough to pursue such lofty ideals with no coin in your pocket! &lt;sigh&gt; Wonderful fatherly advice, eh?"},{"name":"HIHIBARU","text":"Thank the Twelve Hihira wasn't so easily swayed by my folly. And look at the healer she's become─crafter of remedies fit to save the realm, and trusted friend to the Ala Mhigan refugees she lives with in ways few Ul'dahns ever have been."},{"name":"HIHIBARU","text":"Hihira has grown into as wise and kind a woman as her mother was, and hasn't got an onze of my avarice. She's more than earned my respect, and my blessing to live as she sees fit. So when you give her this neckpiece, <span class=\"highlight\">Forename</span>, <span class=\"emphasis\">make</span> her understand how proud she's made me."},{"name":"HIHIBARU","text":"Hihira isn't possessed of my desire for coin─and she needs to know how proud that makes me."},{"name":"HIHIRA","text":"My father has learned I am well? Did he...did he have aught else to say?"},{"name":"HIHIRA","text":"How odd... I know I've seen this before, but I cannot remember where."},{"name":"HIHIRA","text":"My father is...is <span class=\"emphasis\">proud</span> of me? If that be true, his heart is grown less cold and calculating. And that he kept my mother's favorite neckpiece for all this time..."},{"name":"HIHIRA","text":"My mother was the gentlest of souls─all tender smiles and wise words. Why, my fondest childhood memories are of her stroking my head as I lay abed, and murmuring “sow compassion where you wander, and ever will kindness bloom in your wake.”"},{"name":"HIHIRA","text":"Were it not for my mother's teachings, I would never have learned the ways of alchemy, nor sought to save the ailing with remedies born of my study."},{"name":"HIHIRA","text":"But Father never truly seemed to <span class=\"emphasis\">hear</span> what my mother exhorted─though he asked her counsel more than I. Watching him pray so devoutly before the altar of profit was...was simply more than I could bear."},{"name":"HIHIRA","text":"Yet...though I know not if I believe his promises of change, I can think of no better way to distribute my remedies than my father's network of merchants. And if his work might deliver succor to the downtrodden, am I so stubborn as to deny him the chance?"},{"name":"HIHIRA","text":"I'll do it. Or, I shall at least try. But by enlisting the aid of the Ala Mhigans here in brewing the remedies, how could even the fates deny us success?"},{"name":"HIHIRA","text":"And after we have made enough to put to market, Father and I will finally talk. About Mother, about my life after leaving home, about everything."},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":1654,"items":[{"num":3,"id":4750}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1006211","obj":{"i":1006211,"n":"Hihira","l":45,"q":4}},{"type":"npc","id":"1006196","obj":{"i":1006196,"n":"Hihibaru","l":44,"q":7}},{"type":"npc","id":"1010417","obj":{"i":1010417,"n":"Hihira","l":44,"q":1}},{"type":"item","id":"4750","obj":{"i":4750,"n":"Mulled Tea","l":49,"c":24405,"t":46,"p":267}}]}