{"quest":{"name":"Duel Personalities","location":"Limsa Lominsa","id":67113,"patch":2.4,"sort":13,"icon":100340,"eventIcon":71221,"issuer":1009153,"target":1010521,"involved":[1000857,1002433,1002434,1010419,1010420,1010421,1010422,1010423,1010424,1010425,1010522],"genre":77,"journal":["The deputy postmoogle has a demanding yet satisfying assignment for you.","The deputy postmoogle would have you deliver a demand for satisfaction to a drunken, fractious pirate. What could possibly go wrong? Anselm, the cutthroat in question, has been seen loitering around Limsa Lominsa's lower decks.","Anselm's long-simmering feud with Fiebras has come to a head, and you have been appointed arbiter of their final showdown. He flies to the Drowning Wench to confront Fiebras, and bids you follow him forthwith, lest he should be forced to settle the squabble with steel.","The cantankerous couple would have you be the arbiter not of a duel, but a dispute. Both claim to have discovered ladies whose charms eclipse their former tavern wench of choice, but whose taste is better? There's only one way to find out: follow Fiebras to Bulwark Hall to evaluate his claim.","Fiebras nominates the tourist information twins of Bulwark Hall as his exemplars of feminine grace. Have a heart-to-heart with N'delika to see what all the fuss is about.","It seems the winsome sisters are more than they let on. As undercover Yellowjackets, they defend the realm from undesirable elements─one Fiebras the Dull included. Return to Fiebras to relate the happy news.","Being the victim of a covert espionage operation was not enough to sway Fiebras's convictions, but Anselm is further emboldened. He bids you accompany him to Fisherman's Bottom to survey the object of his own infatuation.","Anselm wishes to draw your attention to stately Sisipu, jewel of the Lalafells. He urges you to speak with her, and bask in her glory.","Sisipu, materfamilias of Fisherman's Bottom, gives you some sage advice to curb Anselm's competitive streak. Will these wise words be enough to put an end to all this silly bother?","Anselm, the eternal agonist, is not so easily dissuaded by Sisipu's attempted appeasement. In fact, it seems to have only strengthened his resolve. The disputatious duo head to the docks to await your final judgment.","Just as you are about to deliver your verdict, the flighty pirates' affections are captivated by the brusque charms of Captain Rhoswen, leader of the Sanguine Sirens. And though their budding hopes are swiftly crushed, the heartbroken heroes pledge to follow Rhoswen down the pirate path. Henceforth, they will settle their feuds not with rational argument, but with a few swift knocks in the kisser. If you are ever of a mind to witness “pirate justice” firsthand, you have an open invitation to Candlekeep Quay, where the truculent twosome will be drinking, wenching, and settling scores until somebody loses an eye."],"objectives":["Deliver the challenge to Anselm.","Speak with Anselm in the Drowning Wench.","Speak with Fiebras in Bulwark Hall.","Speak with N'delika.","Report back to Fiebras.","Speak with Anselm in Fisherman's Bottom.","Speak with Sisipu.","Report back to Anselm.","Speak with Anselm by the docks."],"dialogue":[{"name":"LETTERMOOGLE","text":"Why, if it isn't my obedient slav─um, trusted assistant! Back for more? I've got something a little more demanding for you this time... It's nothing less than a demand for satisfaction, kupo!"},{"name":"LETTERMOOGLE","text":"That's right! Fiebras the Dull wants a duel with Anselm Larkscall─to the death, no doubt. They're a pair of the most barnacle-brained pirates that ever got washed ashore. They're always cracking each other's heads open over something or other down in Candlekeep Quay."},{"name":"LETTERMOOGLE","text":"When Anselm's at a loose end─which is the majority of the time─you'll find him loitering around Limsa Lominsa. So go and say hello, and make sure he gets Fiebras's challenge. And don't forget─a prudent postperson always sees his mission through to the <span class=\"emphasis\">bitter end</span>. Good luck, kupo!"},{"name":"LETTERMOOGLE","text":"Ours is not to reason why, my dear. If Fiebras wants to send his gauntlets by post, it is a postmoogle's duty to deliver them! ...Or to delegate the task to a passing lackey. You're sure to find Anselm loitering somewhere around Limsa Lominsa."},{"name":"ANSELM","text":"We are the 'earty pirates, we sail the stormy seas!♪<br>With bird muck on our shoulders, and woodworm on our knees!♪"},{"name":"ANSELM","text":"Ye got business with me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? If I owe ye coin, come back when these fellers are done tusslin', and I'm done drinkin'...whenever that may be, har har!"},{"name":"ANSELM","text":"...What in the seven 'ells? “I've found meself some new women what make that ale wench look like a puddle of puke. Ye can keep 'er fer all I care. You and 'er was made fer each other!” Fiebras, ye blowhard bastard! Thinks I'm goin' to take that lyin' down, does 'e!?"},{"name":"ANSELM","text":"There's a wench down in Candlekeep Quay me and 'im been scrappin' over fer a while now. Ain't like she's a knockout or nothin', but a puddle of puke? The dog's got a nerve... Anyroad, I know a woman what'll blow these wenches of 'is out the water!"},{"name":"ANSELM","text":"We'll be needin' an arbiter fer our little shindig. Think yer up to the task, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? I bet ye gold to guano the scurvy cur'll be hidin' 'is head in the Drownin' Wench. Ye best come quick, or ye'll be moppin' up 'is lily liver with a bar mat!"},{"name":"FIEBRAS","text":"Ye think yer woman's better than mine? Yer blind, man! What 'appened to ye? Did ye catch a glimpse of that ugly mug of yers in a mirror?"},{"name":"ANSELM","text":"Ye got 'ere just in time, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Any more of this contemptible sneak's shite and I'd've gutted 'im like the minnow 'e is."},{"name":"FIEBRAS","text":"So <span class=\"emphasis\">you're</span> the arbiter this bilge rat told me about. Good day to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. The name's Fiebras. There's some as call me Fiebras <span class=\"emphasis\">the Dull</span>, but don't let the name fool ye─me wits're as sharp as me blade. And they tell me there ain't no woman better'n mine!"},{"name":"FIEBRAS","text":"I've been tryin' to knock some sense into Anselm's thick skull down in Candlekeep Quay, but every time some meddlin' plank comes chargin' in, stickin' their nose where it ain't wanted."},{"name":"FIEBRAS","text":"So this time we ain't fightin' with fists, but with facts! And as the only sober one between us, s'only fair you decide who's right, and who's talkin' out their arse."},{"name":"FIEBRAS","text":"Alright then, me first! I'll show ye the apples of me eyes─a pair of Miqo'te beauties what'll put 'airs on yer chest! Follow me down to Bulwark Hall, and I'll take me winnin's!"},{"name":"ANSELM","text":"Argh! Be still me beatin' 'eart! Get an 'old of yerself, Anselm... Don't let these sirens tempt ye!"},{"name":"FIEBRAS","text":"Ain't that a sight fer bloodshot eyes! Can't say the same meself, but you ain't seein' double─there really are two of 'em. Wrap your peepers 'round the Miqo'te twins and tell me there ain't no gods."},{"name":"FIEBRAS","text":"Right after the Calamity, it was... A terrible tempest struck up, and drove me ship against the rocks. Next thing I knew, the boilin' waves were draggin' me under. I woke up with an 'ead full of snakes, a mouth full of sand, and a pair of bright voices ringin' in me ears."},{"name":"FIEBRAS","text":"Aye, 'twas the Miqo'te twins brought me back from the long sleep. Not that I knew it at the time, mark ye─one look at that coral 'air, that glowin' skin, and those eyes you could drown a coeurl in, and I reckoned I was swimmin' with the angels."},{"name":"FIEBRAS","text":"Five years it's been since last I saw 'em, but guess what? They remember me! 'Ere I was, tryin' to get up the guts to go over to 'em, and what do ye know? <span class=\"emphasis\">They</span> call <span class=\"emphasis\">me</span> over, ask me 'ow I'm doin'...<br><br>A pair of tender-'earted beauties like them givin' the time of day to a sunbaked scoundrel like me─tell me them Miqo'te ain't 'eaven-sent!"},{"name":"FIEBRAS","text":"Go on, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─go and bend their ears. It ain't every day ye get to see charms like that up close and personal─not on piratin' coin, anyroad."},{"name":"FIEBRAS","text":"Go on, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, go and bend their ears. It ain't every day ye get to see charms like that up close and personal─not on piratin' coin, anyroad."},{"name":"NDELIKA","text":"Welcome to Limsa Lominsa! If there's aught we can assist you with, feel free to ask. For instance...if you needed to be relieved from the attentions of a pair of recalcitrant pirates?"},{"name":"NTANMO","text":"You see, we might look all sweetness and light, but we're actually fully fledged Yellowjackets! We're stationed here in Bulwark Hall not only to offer invaluable tourist information, but to keep an eye on certain...undesirable elements, who might disturb the peace in our fair city."},{"name":"NDELIKA","text":"Fiebras, the gentleman you were just speaking with, is a person of interest to our organization, and is under constant observation."},{"name":"NTANMO","text":"Several times of late, we've seen him lurking in the shadows, staring at us...waiting for his chance to strike! We generally deal with him simply by calling him over─a little informal interrogation rather tends to interfere with his nefarious schemes."},{"name":"NDELIKA","text":"Fiebras, the gentleman you were just speaking with, is a person of interest to our organization, and is under constant observation. You would do well to watch your back around him."},{"name":"NTANMO","text":"Several times of late, we've noticed Fiebras lurking in the shadows, staring at us...waiting for his chance to strike! We generally deal with him simply by calling him over─a little informal interrogation rather tends to interfere with his nefarious schemes."},{"name":"ANSELM","text":"Back from yer little chat, are ye? I saw ye makin' merry with those two temptresses. What in the seven 'ells were ye laughin' about?"},{"name":"FIEBRAS","text":"Tell me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, ain't I right? Ain't they the most perfect creatures ye've ever set yer eyes on?"},{"name":"FIEBRAS","text":"...Wh-What!? I'm under surveillance? Ye mean...they weren't flirtin' with me? They were <span class=\"emphasis\">questionin'</span> me!?"},{"name":"ANSELM","text":"Gwaaahahaha! Ye thought a pair of Miqo'te lovelies like them'd pay 'eed to a grisly sight like you? Best stick to yer own kind─there's plenty more bottom-feeders in the sea!"},{"name":"FIEBRAS","text":"Shut yer rotten bilge 'ole! Aye, they might've...misled me, but they did it fer a damned good reason. That attentiveness, that sense of duty... There ain't no woman beats the Miqo'te twins!"},{"name":"ANSELM","text":"Ha! Listen to that─the pitiful quaverin' of a beached whale! Ye've been 'ad, boy. Follow me down to Fisherman's Bottom and I'll show ye what beats a couple of double-dealin' Miqo'te."},{"name":"FIEBRAS","text":"There ain't no woman beats the twins, but that little Lalafell runs 'em bleedin' close. Such presence... Such dignity..."},{"name":"ANSELM","text":"There ye are, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Time to settle this little barney once and fer all─I give ye Sisipu, a bleedin' paragon of womankind!"},{"name":"ANSELM","text":"Back in me piratin' days, the cap'n sent me to the markets 'ere to fence our ill-gotten gains. Thing is, none of these crooked dealers'd give me fair coin fer the loot our boys'd spilt their guts for. Well, me blood boiled over. Foamin' at the mouth I was, and 'urlin' oaths like the broadside of a galleon."},{"name":"ANSELM","text":"That's when Sisipu stepped in. Men twice her size are cowerin' in fear, but she squares right up to me, a ragin' pirate in full cry. “Don't be a baby!” she says. “Get a grip!” she says. Fair shook me to the core, it did. If any scoundrel should even <span class=\"emphasis\">think</span> about doin' Sisipu down, I'll fetch 'em a punch up the bracket!"},{"name":"ANSELM","text":"Don't believe me? Go and see fer yerself, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. One moment with Sisipu and ye'll be a changed <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> ever after!"},{"name":"ANSELM","text":"“Don't be a baby!” she says. “Get a grip!” she says. Fair shook me to the core, it did. If any scoundrel should even <span class=\"emphasis\">think</span> about doin' Sisipu down, I'll fetch 'em a punch up the bracket!"},{"name":"SISIPU","text":"Welcome back, <span class=\"highlight\">Forename</span>! Caught any more marlins lately? ...What, Anselm sent you? What's that belligerent boy up to this time?"},{"name":"SISIPU","text":"Hello again, <span class=\"highlight\">Forename</span>. What's the matter? Have you got your tackle in a twist? ...You say Anselm sent you? What's that belligerent boy up to this time?"},{"name":"SISIPU","text":"What can I do you for? Don't tell me─Anselm sent you. I can see him lurking over there, snickering. He never was one for subtlety."},{"name":"SISIPU","text":"Ha! So he's got you choosing between me and those Miqo'te twins up in Bulwark Hall? The silly sod's always squabbling over something."},{"name":"SISIPU","text":"You tell him from me that he's got the whole thing topsy-turvy. Much as I'm pleased to be put on a pedestal, there's no way of judging when it comes to matters of taste. After all, it's like they say─one man's marlin is another man's mudskipper."},{"name":"SISIPU","text":"The world's like a ship. You've got your captain, your mates, your bosuns, your deckhands... Everyone's got their own talents, their own skills. You'll be a long time looking for a sailor who can run the whole boat on his own."},{"name":"SISIPU","text":"The world's like a ship. You've got your captain, your mates, your bosuns, your deckhands... Everyone's got their own talents, their own skills. You'll be a long time looking for a sailor who can run the whole boat on his own."},{"name":"FIEBRAS","text":"She ain't 'alf got some presence for a shrimp. The Miqo'te twins are my idea of angels, but Sisipu's pretty 'eavenly 'erself..."},{"name":"ANSELM","text":"Ye did it, ye lucky bugger! Ye talked with Sisipu! So...'ow was it? Is yer life changed forever?"},{"name":"ANSELM","text":"...There's no way of judgin'? Everyone's got their own talents? Well, blow smoke up me arse and call me a kipper! If that ain't the most wisest thing I've 'eard in all me life. That settles it─Sisipu beats them twins 'ands down!"},{"name":"FIEBRAS","text":"Alright, that's enough. Time fer ye to make up yer mind, arbiter. But not 'ere─it ain't fair what with Sisipu right there in yer face. Let's move over to the docks, then ye can give us yer verdict."},{"name":"ANSELM","text":"This is what I've been waitin' fer! Time to wipe that smirk off Fiebras's face! Come and let us know when ye've made yer decision."},{"name":"FIEBRAS","text":"It's finally time to put our squabble to bed. Prepare to eat yer words, Anselm─my twins knock your fishwife into a cocked 'at!"},{"name":"ANSELM","text":"'Ere it is, then─the moment of truth. Come on, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, put us out of our misery."},{"name":"FIEBRAS","text":"Tell us, arbiter─which of us 'as the right of it? Is Sisipu the best, or the Miqo'te twins?"},{"name":"RHOSWEN","text":"(-???-)Out o' me way, scrags, or ye'll feel me jackboot on yer scrawny necks! This ain't no place fer idle chitchat─get down the market with the other gossipin' fishwives!"},{"name":"FIEBRAS","text":"(-Anselm and Fiebras-)Cap'n Rhoswen!"},{"name":"RHOSWEN","text":"Well, if it ain't a pair o' washed-up pirates... Listen 'ere, boys─if anyone tells ye to quit yer drinkin', an' yer wenchin', an' yer brawlin'─give 'em a cuff from me, or I'll keelhaul ye meself! Once a pirate, always a pirate!"},{"name":"RHOSWEN","text":"Ye build up yer scores on deck, then settle 'em onshore─that's pirate justice! Don't stand around bickerin'─let yer <span class=\"emphasis\">fists</span> do the talkin'!"},{"name":"FIEBRAS","text":"...My gods, what a woman! Like a gulp of grog to a shipwrecked sailor, she is. All this time I've been pinin' after them twins, I took me eyes off the real treasure!"},{"name":"ANSELM","text":"Aye, Sisipu's many things, but she sure as 'ells ain't an 'ard-drinkin', 'ard-fightin' pirate cap'n. Follow 'er to the bottom of the ocean, I would!"},{"name":"CARVALLAIN","text":"(-???-)I'm sorry to intrude on your little daydreams, but I really must advise you to come to your senses."},{"name":"CARVALLAIN","text":"The only thing a boorish harridan like her would give you is a nice collection of lumps to decorate those thick skulls of yours."},{"name":"FIEBRAS","text":"C-Cap'n Carvallain!?"},{"name":"ANSELM","text":"What in the seven 'ells? Rhoswen, and now Carvallain... It's like a cap'n's convention 'round 'ere!"},{"name":"RHOSWEN","text":"Oi, Carvallain, ye stinkin' scrote! What're ye sayin' about me?"},{"name":"CARVALLAIN","text":"Nothing, my dear. Simply removing the scales from these poor fellows' eyes. Mark my words, gentlemen: an animal starved of affection grows desperate, and in its desperation, dangerous."},{"name":"RHOSWEN","text":"Hey! Who're ye callin' desperate!? I could 'ave any man I want! The fools're queuin' up from 'ere to Thanalan to try their luck with me, and not one of 'em's fit to lick me boots!"},{"name":"FIEBRAS","text":"So that's 'ow it is... I should've known a goddess like her wouldn't look twice at a second-rate deck scrubber like me. Not when there's a livin' legend like Cap'n Carvallain around."},{"name":"CARVALLAIN","text":"Now, now, my good man─I think we have a most grievous misunderstanding..."},{"name":"ANSELM","text":"Aaargh, I'm as green as a goblin! What I wouldn't give to be a pirate king, off to a secret ron-day-voo with me corsair queen. Like somethin' out of a faerie tale, it is!"},{"name":"CARVALLAIN","text":"A r-rendezvous!? Have you lost your mind, man? I do believe I've wasted quite enough time with you imbeciles. I have important business to attend to."},{"name":"FIEBRAS","text":"&lt;sigh&gt; I thought I'd finally found the woman of me dreams, but all I got was a rude awakenin'. Maybe yer right, Anselm─maybe I'm better off stickin' to me own kind..."},{"name":"ANSELM","text":"Aye, when ye got competition like that, ye don't stand a chance. Sisipu's right─there ain't no point chasin' after the perfect woman. I reckon I'll take another crack at me ale wench─it ain't so bad wakin' up with a puddle of puke if ye've 'ad a good night out."},{"name":"FIEBRAS","text":"<span class=\"emphasis\">Your</span> ale wench? Ye beef-witted barnacle─that wench is mine! Let's take a leaf out of Cap'n Rhoswen's book, and settle this with our fists!"},{"name":"ANSELM","text":"(-Anselm and Fiebras-)Once a pirate, always a pirate!"},{"name":"ANSELM","text":"Thanks fer all yer 'elp, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. It's 'igh time we were 'eadin' back to Candlekeep Quay─come down if ye ever want to see pirate justice in action. Until then, fair winds to ye, and godsspeed."},{"name":"ANSELM","text":"(-Anselm and Fiebras-)We are the 'earty pirates, we sail the stormy seas!♪<br>With bird muck on our shoulders, and woodworm on our knees!♪"},{"name":"SYSTEM","text":"With your successful delivery, your reputation as a letter carrier has grown!"}],"reward":{"gil":602,"items":[{"id":9332}],"xp":0},"reqs":{"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1009153","obj":{"i":1009153,"n":"Deputy Postmoogle","l":29,"q":24}},{"type":"npc","id":"1010521","obj":{"i":1010521,"n":"Anselm","l":29,"q":1}},{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1002433","obj":{"i":1002433,"n":"N'delika","l":29,"q":3}},{"type":"npc","id":"1002434","obj":{"i":1002434,"n":"N'tanmo","l":29,"q":2}},{"type":"npc","id":"1010419","obj":{"i":1010419,"n":"Anselm","l":29,"q":1}},{"type":"npc","id":"1010420","obj":{"i":1010420,"n":"Anselm","l":28,"q":1}},{"type":"npc","id":"1010421","obj":{"i":1010421,"n":"Fiebras","l":28,"q":1}},{"type":"npc","id":"1010422","obj":{"i":1010422,"n":"Anselm","l":29,"q":1}},{"type":"npc","id":"1010423","obj":{"i":1010423,"n":"Fiebras","l":29,"q":1}},{"type":"npc","id":"1010424","obj":{"i":1010424,"n":"Anselm","l":29,"q":1}},{"type":"npc","id":"1010425","obj":{"i":1010425,"n":"Fiebras","l":29,"q":1}},{"type":"npc","id":"1010522","obj":{"i":1010522,"n":"Fiebras","l":29,"q":1}},{"type":"item","id":"9332","obj":{"i":9332,"n":"Flint Caviar","l":110,"c":24259,"t":46}}]}