{"quest":{"name":"Taking in the Sights","location":"Fortemps Manor","id":67117,"patch":3.0,"sort":2,"eventIcon":71201,"issuer":1013036,"target":1012323,"involved":[1012180,1012316,1012317,1012318,1012319,1012320,1012321,1012322,1012324,1012325,1012335,1012336,1013033,1013034,1013035,1013037],"genre":3,"journal":["Alphinaud has a mind to learn more about Ishgard.","Seeing the wisdom in Count Edmont's words, Alphinaud and Tataru resolve to learn more of Ishgard. Before you depart, the count furnishes you all with documentation identifying you as wards of House Fortemps, and commands one of his servants to serve as your guide. Join your comrades outside and begin your tour.","This being your first time in Ishgard, your guide is adamant that you should first gaze upon the resplendence of the Holy Vault. Heed his words and join him in the Hoplon.","In the Hoplon, your guide tells you of the Vault, wherein Thordan VII, Archbishop of the Ishgardian Orthodox Church, resides and rules. At this point, Alphinaud takes note of the twelve statues standing nearby, which the manservant confirms as the “knights twelve” who served King Thordan I in antiquity and went on to found the nation of Ishgard. Eager to press on, the manservant bids you follow him to the Jeweled Crozier, where you will be introduced to Mistress Elaisse, master of the Ishgardian markets.","Though Alphinaud is concerned that the merchants of Ishgard may be reluctant to accept your custom, Mistress Elaisse assures him that nothing could be further from the truth. Weapons, armor, accoutrements, medicine, materials─whatever you desire, it can be found in the Crozier, she promises, and none will refuse your coin. Soon after, your guide signals that it is time to visit the aetheryte plaza and makes for Foundation, with Alphinaud and Tataru close behind.","Having returned to Foundation, your guide advises you to attune to the aetheryte. He then pauses to allow you to catch your breath, and awaits your command to continue the tour."],"objectives":["Speak with the House Fortemps manservant.","Speak with the House Fortemps manservant in the Hoplon.","Speak with Elaisse in the Jeweled Crozier.","Speak with the House Fortemps manservant in the aetheryte plaza."],"dialogue":[{"name":"ALPHINAUD","text":"Though our friends in House Fortemps have been generous enough to extend us their protection, we must take care not to impose too much on their hospitality."},{"name":"ALPHINAUD","text":"It is only proper that we learn about our new home, so that we might become more self-sufficient."},{"name":"TATARU","text":"It'll take a while to learn the lay of the land, but learn it we must. Then there's the markets and taverns─we'll need to know where to shop and where to hear small talk."},{"name":"ALPHINAUD","text":"'Twould seem a tour of the city is indeed in order."},{"name":"ALPHINAUD","text":"I thank you for your counsel, my lord. My companions and I shall of course do as you suggest."},{"name":"EDMONT","text":"Very good. Then my manservant shall accompany you. He will be able to answer any questions you might have."},{"name":"EDMONT","text":"Ah, but I grow forgetful in my dotage─there is something I must give you ere we part."},{"name":"EDMONT","text":"Their documentation is in order, I trust?"},{"name":"BUTLER01581","text":"Yes, my lord."},{"name":"EDMONT","text":"Those documents identify you as wards of House Fortemps."},{"name":"EDMONT","text":"Given that our borders have remained closed for decades, many of my countrymen are unaccustomed to treating with foreigners."},{"name":"EDMONT","text":"Should anyone happen to question your presence here, it may prove necessary to remind them that you remain under the protection of House Fortemps. But let us hope it shall not come to that."},{"name":"ALPHINAUD","text":"Rest assured that we shall do our utmost to avoid any situation which might compel us to invoke your name."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, Tataru─the city awaits."},{"name":"TATARU","text":"Let's go!"},{"name":"TATARU","text":"So this is what the inside of the manor of a High House looks like! To think that Lord Haurchefant was raised here..."},{"name":"EDMONT","text":"As I said before, my home is your home. After all you have done on our behalf, it is the least I can offer."},{"name":"EMMANELLAIN","text":"They'll be whispering about you soon, if they aren't already. “The mysterious guests of House Fortemps,” or some such."},{"name":"ARTOIREL","text":"Greetings, Scion, and welcome. We are honored by your presence."},{"name":"ALPHINAUD","text":"I confess, it had long been a dream of mine to visit Ishgard. To my childish self, her towers, bridges, and cobbled streets seemed akin to something from a faerie tale─and I have never quite outgrown the fantasy."},{"name":"TATARU","text":"I'm glad I have a map!"},{"name":"BUTLER01581","text":"As this is your first time in our fair city, pray permit me to show you to the Hoplon, from whence we may gaze upon the splendor of the Holy Vault. Though all other sights pale in comparison, 'tis only meet that you see it first."},{"name":"BUTLER01581","text":"I shall then show you around the Jeweled Crozier, where you may purchase all manner of goods and services, before descending to Foundation's aetheryte plaza. If there are no questions..."},{"name":"ALPHINAUD","text":"The Holy Vault, where Archbishop Thordan VII rules from on high..."},{"name":"TATARU","text":"They're awfully fond of statues, aren't they? Hey, what if I took up sculpting? I bet you could make a fortune in a place like this! And we need every gil we can get!"},{"name":"BUTLER01581","text":"The Hoplon, so named for the bronze greatshield borne by our nation's patron deity, is the largest plaza in Ishgard."},{"name":"BUTLER01581","text":"The magnificent cathedral to the north is, of course, the Holy Vault."},{"name":"BUTLER01581","text":"The Vault is both Ishgard's seat of government and the residence of the archbishop of the Ishgardian Orthodox Church."},{"name":"ALPHINAUD","text":"Begging your pardon... The statues to the south─are they perchance Thordan's famed “knights twelve”?"},{"name":"BUTLER01581","text":"Very good, Master Alphinaud. They are the fathers of Ishgard─the brave knights who joined with King Thordan I to put down Nidhogg and found this great nation."},{"name":"BUTLER01581","text":"Ours is a city rich in history and tradition, and there is much you can learn by exploring the Pillars─time permitting, of course."},{"name":"BUTLER01581","text":"Now then, if you would follow me to the Jeweled Crozier, I shall introduce you to Mistress Elaisse, our master of the markets."},{"name":"ALPHINAUD","text":"Not a single scorched stone in sight... To watch these merchants going about their business, one would think the dragons had never attacked."},{"name":"TATARU","text":"If you want to buy something, let me do the talking. I could haggle for Ul'dah!"},{"name":"BUTLER01581","text":"I present to you Mistress Elaisse. Mayhap you would like to say a few words?"},{"name":"ELAISSE","text":"Well you're clearly not locals or traveling peddlers, which makes you all...?"},{"name":"ELAISSE","text":"Ahhh, wards of House Fortemps! How very interesting."},{"name":"ALPHINAUD","text":"Count Edmont has granted us leave to remain in Ishgard for as long as we wish─which may be some time."},{"name":"ALPHINAUD","text":"Accordingly, we will have need of sundry goods, hence our desire to make your acquaintance. That is, of course, assuming you are content to accept the custom of foreigners. Should you be uncomfortable─"},{"name":"ELAISSE","text":"Young sir, we do not discriminate in matters of money. If you have coin to spend, who are we to refuse it?"},{"name":"ELAISSE","text":"Weapons, armor, accoutrements, medicine, materials─whatever your desire, it can be found in the Crozier. Our merchants will be more than happy to accommodate you, as you shall soon see."},{"name":"BUTLER01581","text":"Our next destination is the aetheryte plaza in Foundation. If everyone is ready... "},{"name":"ALPHINAUD","text":"Hm? Oh, I have already attuned myself to the aetheryte. I trust you have as well?"},{"name":"TATARU","text":"Do you ever get a funny tingling feeling when you attune to an aetheryte, or is it just me? ...No? So, it <span class=\"emphasis\">is</span> just me... Hmmm..."},{"name":"BUTLER01581","text":"And here we have Foundation's aetheryte plaza. If you have yet to attune to the aetheryte, it would be wise to do so now."}],"reward":{"gil":517,"items":[{"id":10670,"one":1,"hq":1},{"id":10712,"one":1,"hq":1},{"id":10754,"one":1,"hq":1},{"id":10838,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67116]},"next":[67118]},"partials":[{"type":"npc","id":"1013036","obj":{"i":1013036,"n":"Alphinaud","l":2320,"q":2}},{"type":"npc","id":"1012323","obj":{"i":1012323,"n":"House Fortemps Manservant","l":2300,"q":2}},{"type":"npc","id":"1012180","obj":{"i":1012180,"n":"Elaisse","l":2301,"q":8}},{"type":"npc","id":"1012316","obj":{"i":1012316,"n":"House Fortemps Manservant","l":2301,"q":1}},{"type":"npc","id":"1012317","obj":{"i":1012317,"n":"House Fortemps Manservant","l":2301,"q":1}},{"type":"npc","id":"1012318","obj":{"i":1012318,"n":"Alphinaud","l":2301,"q":1}},{"type":"npc","id":"1012319","obj":{"i":1012319,"n":"Tataru","l":2301,"q":1}},{"type":"npc","id":"1012320","obj":{"i":1012320,"n":"House Fortemps Manservant","l":2301,"q":1}},{"type":"npc","id":"1012321","obj":{"i":1012321,"n":"Alphinaud","l":2301,"q":1}},{"type":"npc","id":"1012322","obj":{"i":1012322,"n":"Tataru","l":2301,"q":1}},{"type":"npc","id":"1012324","obj":{"i":1012324,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012325","obj":{"i":1012325,"n":"Tataru","l":2300,"q":2}},{"type":"npc","id":"1012335","obj":{"i":1012335,"n":"Alphinaud","l":2301,"q":1}},{"type":"npc","id":"1012336","obj":{"i":1012336,"n":"Tataru","l":2301,"q":1}},{"type":"npc","id":"1013033","obj":{"i":1013033,"n":"Count Edmont De Fortemps","l":2320,"q":3}},{"type":"npc","id":"1013034","obj":{"i":1013034,"n":"Artoirel","l":2320,"q":3}},{"type":"npc","id":"1013035","obj":{"i":1013035,"n":"Emmanellain","l":2320,"q":3}},{"type":"npc","id":"1013037","obj":{"i":1013037,"n":"Tataru","l":2320,"q":1}},{"type":"item","id":"10670","obj":{"i":10670,"n":"Mythrite Sallet of Fending","l":115,"c":40212,"t":34,"p":17214}},{"type":"item","id":"10712","obj":{"i":10712,"n":"Mythrite Sallet of Maiming","l":115,"c":40213,"t":34,"p":17214}},{"type":"item","id":"10754","obj":{"i":10754,"n":"Mythrite Circlet of Striking","l":115,"c":40698,"t":34,"p":15620}},{"type":"item","id":"10838","obj":{"i":10838,"n":"Rainbow Coif of Scouting","l":115,"c":41644,"t":34,"p":11476}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67116","obj":{"i":67116,"n":"Coming to Ishgard","g":3,"l":"Intercessory","s":1}},{"type":"quest","id":"67118","obj":{"i":67118,"n":"The Better Half","g":3,"l":"Ishgard","s":3}}]}