{"quest":{"name":"Knights Be Not Proud","location":"Coerthas Western Highlands","id":67125,"patch":3.0,"sort":10,"icon":100396,"eventIcon":71201,"issuer":1012348,"target":1012328,"involved":[1011231,1012345],"genre":3,"journal":["Lord Artoirel would rather not linger without cause.","The House Durendaire knights have matters at Gorgagne Mills well in hand, and Lord Artoirel sees no reason to remain. Return with him to Falcon's Nest and brief Ser Redwald on your discoveries.","Considering all that you and Lord Artoirel have done on behalf of Falcon's Nest, Ser Redwald cannot in good conscience impose upon the two of you any longer. He gives you his blessing to return to Ishgard, and affirms his intent to deliver a glowing report to the Holy See. It would seem your services are no longer required, but before taking your leave, you might ask Lord Artoirel if he requires anything else.","Speaking with unaccustomed candor, Lord Artoirel admits that he long harbored doubts regarding your competence and motives, in part perhaps because Lord Haurchefant─his bastard half-brother─holds you in such high esteem. When forced to decide who would pursue the heretics, he turned to you not out of an eagerness to bring Ishgard's enemies to justice, but out of a dark desire to see you fail. But after witnessing your willingness to risk all for the cause, as well as the aftermath of your handiwork, he sees that you are every bit the hero Lord Haurchefant claimed, and swears never to doubt you again."],"objectives":["Speak with Redwald.","Speak with Artoirel at Fortemps Manor."],"dialogue":[{"name":"ARTOIREL","text":"The knights have matters here well in hand. Let us return to Falcon's Nest and share our discoveries with Ser Redwald."},{"name":"ARTOIREL","text":"Come! After tracking heretics across malms of ice and snow, I would say you are due a few hours' rest next to a warm fire."},{"name":"KIGHT01589","text":"We'll take care of the rest, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. If there are any heretics hiding hereabouts, we'll soon root them out."},{"name":"REDWALD","text":"Lord Artoirel, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Full glad am I to see you both hale and healthy. What news?"},{"name":"REDWALD","text":"...You mean to say you hunted the heretics down on your own, and slew them before reinforcements could arrive? By the Fury!"},{"name":"ARTOIREL","text":"I believe we have made great strides toward purging these lands of heretics─and I mean to say as much when I deliver my report to my father and the Holy See."},{"name":"REDWALD","text":"As will I, Lord Artoirel. May it serve to remind our superiors what houses Durendaire and Fortemps could achieve through continued cooperation."},{"name":"ARTOIREL","text":"Indeed. I trust you and your knights are content to handle the rest?"},{"name":"REDWALD","text":"We most certainly are, my lord."},{"name":"REDWALD","text":"During your short time with us, you and <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> have accomplished far more than I had thought possible. I cannot in good conscience impose upon you any longer. Pray return to Ishgard with my thanks."},{"name":"ARTOIREL","text":"As you wish, Ser Redwald. We thank you for your hospitality."},{"name":"REDWALD","text":"Mayhap your deeds here will serve to demonstrate the folly in continuing to exclude foreigners from our lands. With more hardworking men and women like you, Ishgard would be much the stronger."},{"name":"ARTOIREL","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>...I would speak plain. From the first, I questioned your motives and your competence─unjustly, I now realize."},{"name":"ARTOIREL","text":"Rumors have a way of growing more fantastic as they spread, and quite frankly, those surrounding you beggar belief. But Haurchefant swore that all the stories were true. He championed your cause and begged Father to grant you patronage..."},{"name":"ARTOIREL","text":"And he duly listened, because for all his wisdom, he has never been able to say no to my dear half-brother─the legacy of my father's sole indiscretion."},{"name":"ARTOIREL","text":"Mother hated him, of course. Even on her deathbed, she refused to acknowledge him. And...to be honest, she was not alone in her feelings."},{"name":"ARTOIREL","text":"But that is not the worst of it.<br>...At Camp Riversmeet, when we came upon the wounded knight, I knew immediately that one of us would have to pursue the heretics alone. An onerous task, fraught with danger..."},{"name":"ARTOIREL","text":"And there you were─the savior of Eorzea and honored guest of House Fortemps. My new comrade-in-arms. Haurchefant's dear friend."},{"name":"ARTOIREL","text":"I told myself it was to be a test, but part of me...part of me hoped that you would fail."},{"name":"ARTOIREL","text":"Yet you accepted the task without a word of protest, nor any sign of fear. And you duly tracked the enemy down, faced him alone, and lived to tell the tale."},{"name":"ARTOIREL","text":"Plainly, Haurchefant had the right of it all along. That I doubted your strength bespeaks mine own weakness. But I will not doubt you again, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, on that you have my word."}],"reward":{"gil":517,"items":[{"id":5632,"one":1},{"id":5672,"one":1},{"id":5722,"one":1}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67124]},"next":[67133]},"partials":[{"type":"npc","id":"1012348","obj":{"i":1012348,"n":"Artoirel","l":2200,"q":2}},{"type":"npc","id":"1012328","obj":{"i":1012328,"n":"Artoirel","l":2320,"q":3}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1012345","obj":{"i":1012345,"n":"House Durendaire Knight","l":2200,"q":3}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"67124","obj":{"i":67124,"n":"At the End of Our Hope","g":3,"l":"Coerthas Western Highlands","s":9}},{"type":"quest","id":"67133","obj":{"i":67133,"n":"Divine Intervention","g":3,"l":"Fortemps Manor","s":18}}]}