{"quest":{"name":"An Indispensable Ally","location":"The Sea of Clouds","id":67127,"patch":3.0,"sort":12,"eventIcon":71201,"issuer":1011952,"target":1011952,"involved":[1012354,1012355],"genre":3,"journal":["Lady Laniaitte knows all too well what must be done to ensure that your time spent in Camp Cloudtop is not for nothing.","Left to his own devices, Lord Emmanellain is likely to cause all manner of trouble─this Lady Laniaitte knows from experience. Therefore, your first course of action will be to assign him a duty which will keep him distracted for the duration of your visit. Inform the young noble that he is to keep watch for Dravanian outflyers.","Though disappointed that Lady Laniaitte did not see fit to tell him personally, Lord Emmanellain accepts the orders as well as can be expected. Now that you have privacy, explain to Honoroit, Lord Emmanellain's manservant, that he must ensure that the young lord stays focused on his duty.","Honoroit is astute enough to read between the lines and promises to keep his master out of harm's way. Let Lady Laniaitte know that all has gone according to plan.","Were it not for the close relationship between House Haillenarte and House Fortemps, Lady Laniaitte would not feel obligated to spare Lord Emmanellain's feelings. Clearly, this is not the first time she has had to go to such lengths...and it is almost certainly not the last."],"objectives":["Speak with Emmanellain.","Speak with Honoroit.","Speak with Laniaitte."],"dialogue":[{"name":"LANIAITTE","text":"While I understand Count Edmont's intentions, I would rather not waste valuable time ensuring that the young lord doesn't get trampled underfoot."},{"name":"LANIAITTE","text":"True, it is entirely possible that he may learn something from this experience...but if left to his own devices, I think it far more likely that he will make a mess of things."},{"name":"LANIAITTE","text":"Tell him...tell him that I would like him to keep watch for...Dravanian outflyers. Then, when you have a moment to speak with his manservant in private, make it clear that it is <span class=\"emphasis\">his</span> responsibility to keep Emmanellain from shirking his duty."},{"name":"EMMANELLAIN","text":"Ahhh, my lovely Lady Laniaitte! I shall win your heart yet!"},{"name":"HONOROIT","text":"My lord, pray do not do anything rash..."},{"name":"EMMANELLAIN","text":"Hm? A request from Laniaitte? Why didn't she think to ask me in person? Surely she must see me standing here but a few yalms away..."},{"name":"EMMANELLAIN","text":"Oh, never mind. What is it?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A mission of paramount importance: keep watch for Dravanian outflyers."},{"name":"A1","text":"Roam about and keep an eye out for anything unusual."},{"name":"A1","text":"..."},{"name":"EMMANELLAIN","text":"A m-mission!? Yes...yes, of course! That is why I am here. I shall do as my lady asks!"},{"name":"EMMANELLAIN","text":"Oh, is that all? No “leading the van against a beast tribe stronghold” or some such? Well, it is a rather droll task, but who am I to deny her? I shall begin at once!"},{"name":"EMMANELLAIN","text":"Well, that's rather childish of you."},{"name":"HONOROIT","text":"I must say, is it me, or is the air here a bit...uhhh..."},{"name":"LANIAITTE","text":"Remember to stress that this is a task vital to the continued survival of Camp Cloudtop─or something to that effect."},{"name":"HONOROIT","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I do not believe I have properly introduced myself. My name is Honoroit, and I serve at the pleasure of Lord Emmanellain."},{"name":"HONOROIT","text":"...Lady Laniaitte would have <span class=\"emphasis\">me</span> accompany Lord Emmanellain on his mission!?"},{"name":"HONOROIT","text":"Ah, I understand completely. I will do my utmost to keep him out of harm's way."},{"name":"LANIAITTE","text":"Were he of another house, mayhap I would not feel obligated to go to such lengths to preserve his safety and dignity..."},{"name":"LANIAITTE","text":"In any case, I appreciate you speaking to him for me. It would seem he actually listens to you─at least, more so than others."},{"name":"LANIAITTE","text":"Or mayhap you are more skilled at this than most. Aye, I suspect you have had to humor your fair share of difficult men before."}],"reward":{"gil":461,"items":[{"id":10698,"one":1,"hq":1},{"id":10740,"one":1,"hq":1},{"id":10782,"one":1,"hq":1},{"id":10866,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67126]},"next":[67128]},"partials":[{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012354","obj":{"i":1012354,"n":"Emmanellain","l":2100,"q":2}},{"type":"npc","id":"1012355","obj":{"i":1012355,"n":"Honoroit","l":2100,"q":2}},{"type":"item","id":"10698","obj":{"i":10698,"n":"Archaeoskin Breeches of Fending","l":115,"c":45640,"t":36,"p":13662}},{"type":"item","id":"10740","obj":{"i":10740,"n":"Archaeoskin Breeches of Maiming","l":115,"c":45641,"t":36,"p":13662}},{"type":"item","id":"10782","obj":{"i":10782,"n":"Rainbow Culottes of Striking","l":115,"c":45642,"t":36,"p":10929}},{"type":"item","id":"10866","obj":{"i":10866,"n":"Rainbow Sarouel of Scouting","l":115,"c":45643,"t":36,"p":10929}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67126","obj":{"i":67126,"n":"Onwards and Upwards","g":3,"l":"Fortemps Manor","s":11}},{"type":"quest","id":"67128","obj":{"i":67128,"n":"Meeting the Neighbors","g":3,"l":"The Sea of Clouds","s":13}}]}