{"quest":{"name":"Hope Springs Eternal","location":"The Sea of Clouds","id":67130,"patch":3.0,"sort":15,"eventIcon":71201,"issuer":1012060,"target":1012364,"involved":[1011952,1012354,1012355,1012363,1012365],"genre":3,"journal":["Ser Marielle fears what might come of Lord Emmanellain's newfound ambition.","If Lady Laniaitte acquiesces to Lord Emmanellain's demand for a more dangerous duty, then it would surely be necessary for you to accompany the young lord. Ser Marielle has asked you to return to the garrison commander and see if her fears are well founded.","Because wells cannot be dug in the Sea of Clouds, the knights of Ishgard must explore other means of obtaining potable water─perhaps through the use of a unique type of water crystal found in the floating lakes of Voor Sian Siran. Resigned to the fact that Lord Emmanellain will not be denied, Lady Laniaitte has decided to task him with the retrieval of one such crystal. This should serve to mollify the young lord.","Lord Emmanellain accepts the orders with his usual enthusiasm and sets out for Voor Sian Siran with his manservant in tow. Follow them.","Growing bored due to the absence of any discernible threat, Lord Emmanellain abruptly decides on a whim to turn your mission into a contest in which each of you searches for the finest spring crystal you can find, with Honoroit to determine the winner. Before you can speak a word of protest, the young lord runs off, and you have no choice but to indulge his whim.","You come upon what you judge to be a particularly impressive spring crystal. Hopefully Honoroit will feel the same.","Honoroit ponders the unique properties of the spring crystal, including how it can be used to draw moisture from the air like water from a pump. It would seem you were the first to return and present him with an entry, for Lord Emmanellain is nowhere to be seen..."],"objectives":["Speak with Laniaitte.","Speak with Emmanellain.","Speak with Emmanellain near Voor Sian Siran.","Search for a spring crystal in Voor Sian Siran.","Deliver the spring crystal to Honoroit."],"dialogue":[{"name":"MARIELLE","text":"If Lord Emmanellain is going to demand a more dangerous duty, then I expect Lady Laniaitte will want you to accompany him."},{"name":"MARIELLE","text":"Aye, you might as well speak with her sooner rather than later. There's no use avoiding the inevitable."},{"name":"MARIELLE","text":"You ought to go and see if Lady Laniaitte needs you to keep an eye on Lord Emmanellain. I've nothing else for you at the moment, in any case."},{"name":"EMMANELLAIN","text":"I'll have you know I trained with some of the finest instructors in Ishgard! You and me, we could march right into a Vanu stronghold and give them all what for!"},{"name":"HONOROIT","text":"Oh dear, oh dear...and just when everything was going so well..."},{"name":"LANIAITTE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Lord Emmanellain has just informed me that “mere sentry duty” is beneath him. I understand we have you to thank for this epiphany?"},{"name":"LANIAITTE","text":"Well, there's nothing for it but to give him something more demanding, then. Can I count on you to keep him safe?"},{"name":"LANIAITTE","text":"Excellent. We are in constant need of fresh water in Camp Cloudtop, as there are no underground sources we can tap with wells. However, there is a unique variety of crystal we have recently discovered which may enable us to obtain water through other means."},{"name":"LANIAITTE","text":"These spring crystals can be found in Voor Sian Siran, to the east of here. I would have you and Emmanellain bring one back to us."},{"name":"LANIAITTE","text":"You may have to contend with the feral beasts which populate the lakes, not to mention Vanu scouts ranging from their nearby settlement. Of course, that all pales in comparison to keeping the young lord entertained, but you have doubtless grown accustomed to that by now. Good luck, and be safe."},{"name":"LANIAITTE","text":"As before, I ask that you brief Emmanellain on his mission in my stead. I think he may find the task more palatable coming from you."},{"name":"EMMANELLAIN","text":"Hm? Lady Laniaitte told you to tell me about my mission once again? If I didn't know any better, I'd swear she's avoiding me! Anyway, what is it?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A vital mission, on the success of which the very survival of Camp Cloudtop rests: the procurement of potable water."},{"name":"A1","text":"Go and fetch a spring crystal from the floating lakes to the east. With me."},{"name":"A1","text":"..."},{"name":"EMMANELLAIN","text":"Finally! It's about time she entrusted me with a mission of real import. Right, then─let's go, let's go!"},{"name":"EMMANELLAIN","text":"...You're not making this sound terribly appealing. Still, I shall be glad to have you along. Come along, then!"},{"name":"EMMANELLAIN","text":"Again with the silent treatment? Really now, that's just mean. That's <span class=\"emphasis\">mean</span>!"},{"name":"EMMANELLAIN","text":"So this is the Voor Sian Siran of legend. And nary a Vanu in sight. How disappointing. I could do with some sport."},{"name":"EMMANELLAIN","text":"I know! Why don't you and I make it a competition? Whoever finds the superior specimen wins!"},{"name":"EMMANELLAIN","text":"Honoroit shall judge our entries on size, purity, and, say, aesthetic sensibilities! Let us begin at once!"},{"name":"HONOROIT","text":"I had heard the minstrels' tales of these lakes, but I never honestly believed that they were real!"},{"name":"SYSTEM","text":"This water crystal does not appear to exhibit the properties described by Lady Laniaitte. Perhaps you should inspect another."},{"name":"SYSTEM","text":"This crystal appears to be secreting a steady stream of water. Perhaps it is the spring crystal Lady Laniaitte seeks..."},{"name":"EMMANELLAIN","text":"Ah ah ah! This area is mine! You'll have to look elsewhere for your inferior specimen!"},{"name":"HONOROIT","text":"I wish he would have at least stayed within sight..."},{"name":"HONOROIT","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Have you brought your entry for the contest?"},{"name":"HONOROIT","text":"My understanding of such things is...limited, but can this truly be used to draw moisture from air like water from a pump? Fascinating..."}],"reward":{"gil":658,"items":[{"id":10831,"one":1,"hq":1},{"id":10915,"one":1,"hq":1},{"id":10957,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67129]},"next":[67131]},"partials":[{"type":"npc","id":"1012060","obj":{"i":1012060,"n":"Marielle","l":2100,"q":6}},{"type":"npc","id":"1012364","obj":{"i":1012364,"n":"Honoroit","l":2100,"q":2}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012354","obj":{"i":1012354,"n":"Emmanellain","l":2100,"q":2}},{"type":"npc","id":"1012355","obj":{"i":1012355,"n":"Honoroit","l":2100,"q":2}},{"type":"npc","id":"1012363","obj":{"i":1012363,"n":"Emmanellain","l":2100,"q":1}},{"type":"npc","id":"1012365","obj":{"i":1012365,"n":"Emmanellain","l":2100,"q":1}},{"type":"item","id":"10831","obj":{"i":10831,"n":"Archaeoskin Shoes of Aiming","l":115,"c":46512,"t":38,"p":14572}},{"type":"item","id":"10915","obj":{"i":10915,"n":"Archaeoskin Shoes of Healing","l":115,"c":46513,"t":38,"p":14572}},{"type":"item","id":"10957","obj":{"i":10957,"n":"Archaeoskin Shoes of Casting","l":115,"c":46514,"t":38,"p":14572}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67129","obj":{"i":67129,"n":"Sense of Urgency","g":3,"l":"The Sea of Clouds","s":14}},{"type":"quest","id":"67131","obj":{"i":67131,"n":"A Series of Unfortunate Events","g":3,"l":"The Sea of Clouds","s":16}}]}