{"quest":{"name":"Divine Intervention","location":"Fortemps Manor","id":67133,"patch":3.0,"sort":18,"icon":100400,"eventIcon":71201,"issuer":1012377,"target":1012381,"involved":[1012378,1012379,1012380,1013167],"genre":3,"journal":["The Fortemps steward looks as though he has something to say.","Having been informed of all you accomplished during your time in Falcon's Nest and Camp Cloudtop, Count Edmont wishes to express his heartfelt gratitude. He has scarce begun to speak, however, when his steward bursts in, bearing grave tidings: Alphinaud and Tataru have been arrested by a knight of the Heavens' Ward─one “Ser Grinnaux”─on the charge of fomenting heresy. Ask the count for his counsel.","The count believes the charges leveled against your friends to be nothing more than a political ploy to defame House Fortemps. Regardless, you have no choice but to disprove them if you are to set Alphinaud and Tataru free. Reasoning that Ser Aymeric will know the exact nature of the allegations, Edmont advises you to pay the lord commander a visit at the Congregation of Our Knights Most Heavenly.","Though Ser Aymeric believes your friends to be innocent, he is powerless to intervene as the knight who accused them is a member of the Heavens' Ward─the personal guard of the archbishop. These twelve chosen sers answer to none save the archbishop himself, and their testimony is unimpeachable. As such, under Ishgardian law, only the Fury Herself can disprove Ser Grinnaux's claims...by granting victory in a trial by combat between the accuser and the accused. Owing to his magical talents, Alphinaud must fight, but Tataru may claim the right to name a champion. And who else but the Warrior of Light could stand against the might of the Heavens' Ward? Make your preparations and speak to Lord Haurchefant in the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine when you are ready to face the knights in battle.","Under the watchful gaze of the Fury, and the assembled gentry of Ishgard, you defeat Ser Grinnaux and Ser Paulecrain, thus earning your comrades their freedom. Afterwards, you find Lord Haurchefant waiting for you. See what he has to say.","Still giddy with excitement, Lord Haurchefant presents you with a gift to commemorate your victory: a fully trained black chocobo, much like the one that bore you to the western highlands─strong, obedient, and blessed with the power of flight! No longer will you be confined to the earth. Henceforth, the sky is the limit!"],"objectives":["Speak with Edmont.","Speak with Aymeric in Foundation.","Speak with Haurchefant in the Pillars.","Speak with Haurchefant."],"dialogue":[{"name":"HOUSEFORTEMPSSTEWARD01597","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. My lord the count much desires to speak with you regarding your time with Lord Artoirel and Lord Emmanellain. If you would remain here for a moment..."},{"name":"EDMONT","text":"Though you have won the hearts and minds of many of my countrymen, there are those who will never be swayed. Men who will dismiss your efforts and resent your successes, even as we celebrate them."},{"name":"EDMONT","text":"'Tis like that one such member of House Dzemael is manipulating Ser Grinnaux, for he is not a man to dabble in politics of his own volition. He may genuinely believe your friends to be guilty, though I am quite certain his masters know better."},{"name":"EDMONT","text":"Yet the truth will avail us naught if we cannot prove their innocence."},{"name":"EDMONT","text":"You would do well to speak with Ser Aymeric at the Congregation of Our Knights Most Heavenly. He will know more of these charges."},{"name":"HAURCHEFANT","text":"<span class=\"highlight\">Forename</span>! I had but this moment resolved to go and fetch you! I presume you have heard what happened, then..."},{"name":"LUCIA","text":"That they should regard the Scions with such suspicion even after you stood with us on the Steps of Faith... It is bad comedy."},{"name":"LUCIA","text":"Yet unlike the grave injustice you suffered in Ul'dah, this wrong may swiftly be righted."},{"name":"EDMONT","text":"I know as little as you do of the situation, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Ser Aymeric, however, will surely know more."},{"name":"HOUSEFORTEMPSSTEWARD01597","text":"Their status as wards of House Fortemps should afford them preferential treatment─for a time, at least..."},{"name":"AYMERIC","text":"It has been too long, <span class=\"highlight\">Forename</span>. Would that this visit came under happier circumstances. You are come to plead for Master Alphinaud and Mistress Tataru, I take it?"},{"name":"HAURCHEFANT","text":"Word of their detainment reached us while I was delivering my report on the Vanu primal. Truly, I know not which is the more ludicrous─these charges or that flying feathered whale!"},{"name":"AYMERIC","text":"That Ser Grinnaux's accusations are baseless, I have no doubt. Refuting them will be difficult, however, as he is a knight of the Heavens' Ward."},{"name":"AYMERIC","text":"I speak of the personal guard of the archbishop─the twelve finest knights in all of Ishgard, sworn to serve His Eminence alone. Suffice it to say, their testimony is unimpeachable, and I have not the authority to challenge their actions."},{"name":"HAURCHEFANT","text":"After all the Scions have done─routing the heretics and defeating Shiva, helping us to defend the Steps of Faith and drive back the Dravanian Horde─after proving themselves true allies on countless occasions, is there naught we can do!?"},{"name":"AYMERIC","text":"I fear there is but one path left to us...<br>We must demand a trial by combat."},{"name":"HAURCHEFANT","text":"But of course!"},{"name":"HAURCHEFANT","text":"In a trial by combat sanctioned by the inquisition, the victor's claim is judged true regardless of the petitioner's standing!"},{"name":"AYMERIC","text":"Under Ishgardian law, a trial by combat pits the accuser against the accused. In this instance, Master Alphinaud and Mistress Tataru would be expected to face Ser Grinnaux and a second of his choosing─another knight of the Heavens' Ward, most like."},{"name":"HAURCHEFANT","text":"<span class=\"emphasis\">Two</span> of them!? By the Fury, that can hardly be considered fair..."},{"name":"AYMERIC","text":"Master Alphinaud's magical talents will not have gone unnoticed, meaning that he will have no choice but to participate. Mistress Tataru, on the other hand, is quite obviously bereft of martial skill, and should be afforded the right to name a champion to fight in her stead."},{"name":"AYMERIC","text":"Lest you doubt, I am ready and willing to serve in this capacity, as I am sure is Lord Haurchefant...but all here present know that you are the most accomplished warrior among us, and mayhap in the realm at large..."},{"name":"HAURCHEFANT","text":"Then it is settled! I will visit Master Alphinaud at once, and inform him of our intentions. <span class=\"highlight\">Forename</span>─meet me at the Tribunal when you have made ready. Until then, my friend!"},{"name":"AYMERIC","text":"The trial will be held at the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine. I will be in attendance, as will many others with a vested interest in the outcome. Stint not in your preparations, my friend. The knights of the Heavens' Ward will provide a stern test for even one such as you."},{"name":"HAURCHEFANT","text":"Listen carefully, <span class=\"highlight\">Forename</span>. When the trial begins, the petitioner will be asked to restate his charges, and the accused invited to respond. Then, in accordance with the law, they will be asked to restate their request for a trial by combat."},{"name":"HAURCHEFANT","text":"Once the high adjudicator acknowledges Mistress Tataru's right to name a champion, <span class=\"emphasis\">that</span> is when you must make your entrance! Ohhh, I cannot wait to see the look on Ser Grinnaux's face when he sees his true opponent! 'Twill be <span class=\"emphasis\">priceless</span>!"},{"name":"HAURCHEFANT","text":"More seriously...should you begin to lose heart, look to me in the stands, and I shall cheer so loud, you will wonder how you could ever have contrived to doubt yourself! Now, are you ready?"},{"name":"TATARU","text":"Th-They... I mean, WE WON!"},{"name":"TRIALOFFICIANT01597","text":"The Fury has spoken!"},{"name":"TRIALOFFICIANT01597","text":"Alphinaud Leveilleur, Tataru Taru─you are hereby acquitted of all charges."},{"name":"TRIALOFFICIANT01597","text":"Blessed are we who receive of Her wisdom and see justice wrought by Her divine hand! Petitioners, accused─go forth in peace!"},{"name":"ALPHINAUD","text":"Delivered from an untimely demise yet again. My thanks...as always."},{"name":"HAURCHEFANT","text":"By the Fury, what a splendid victory! To see how you strove in the face of adversity─two brave young souls bound together by the puissant bonds of camaraderie...! Why, it stirred me to the very depths of my soul!"},{"name":"HAURCHEFANT","text":"Having been treated to such a rousing spectacle, it seems only right that I present you with a humble token of mine admiration. Pray receive of me this chocobo whistle."},{"name":"HAURCHEFANT","text":"With it, you may summon a black chocobo─fully trained and ready to fly!"},{"name":"HAURCHEFANT","text":"Magnificent, is she not? Strong yet sleek, elegant yet eager! What say you, <span class=\"highlight\">Forename</span>─will you take her for your steed?"},{"name":"GUARD01597","text":"Lord Haurchefant! Chocobos are prohibited in the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine! Your steed must remain outside!"},{"name":"SYSTEM","text":"You have obtained a <span class=\"highlight\">black chocobo</span>! When riding this mount, you will have the ability to fly, provided certain conditions have been met."},{"name":"SYSTEM","text":"To fly in a given region, you must first find and attune to all the local <span class=\"highlight\">aether currents</span>."},{"name":"SYSTEM","text":"In order to attune to some aether currents, you will need to complete certain quests. However, most can be discovered via exploration."},{"name":"SYSTEM","text":"To aid you in this endeavor, you have also obtained an <span class=\"highlight\">aether compass</span>, which will provide you with both the bearing and the distance to the nearest aether current upon use. The aether compass can be found under Collection in the Duty section of the main menu."},{"name":"SYSTEM","text":"To review your progress, select <span class=\"highlight\">Travel</span> from the main menu, followed by <span class=\"highlight\">Aether Currents</span>."},{"name":"QIB","text":"Defeat the Heavens' Ward!"},{"name":"ALPHINAUD","text":"I shall do what I can to support you, <span class=\"highlight\">Forename</span>! Now, let us teach these noble sers the folly of bearing false witness!"},{"name":"PAULECRAIN","text":"Well, well, who do we have here? This one is mine, Ser Grinnaux. Go and play with the boy."},{"name":"GRINNAUX","text":"Hmph. Bloody waste of... Come on, then! You wanted this, remember!?"},{"name":"GRINNAUX","text":"I've had enough of your tricks!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>! Alphinaud's in trouble!"},{"name":"PAULECRAIN","text":"Ha! A fine champion you are!"},{"name":"PAULECRAIN","text":"You have been indulged enough, heathen swine!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, Alphinaud! Look out!"},{"name":"ALPHINAUD","text":"Confound it..."}],"reward":{"gil":1080,"items":[{"id":12075}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"questsType":"all","quests":[67125,67132]},"next":[67134]},"partials":[{"type":"npc","id":"1012377","obj":{"i":1012377,"n":"House Fortemps Steward","l":2320,"q":6}},{"type":"npc","id":"1012381","obj":{"i":1012381,"n":"Haurchefant","l":2301,"q":2}},{"type":"npc","id":"1012378","obj":{"i":1012378,"n":"Count Edmont De Fortemps","l":2320,"q":1}},{"type":"npc","id":"1012379","obj":{"i":1012379,"n":"Haurchefant","l":2300,"q":1}},{"type":"npc","id":"1012380","obj":{"i":1012380,"n":"Aymeric","l":2300,"q":5}},{"type":"npc","id":"1013167","obj":{"i":1013167,"n":"Lucia","l":2300,"q":10}},{"type":"item","id":"12075","obj":{"i":12075,"n":"Black Chocobo Whistle","l":1,"c":26012,"t":63}},{"type":"quest","id":"67125","obj":{"i":67125,"n":"Knights Be Not Proud","g":3,"l":"Coerthas Western Highlands","s":10}},{"type":"quest","id":"67132","obj":{"i":67132,"n":"A Reward Long in Coming","g":3,"l":"The Sea of Clouds","s":17}},{"type":"quest","id":"67134","obj":{"i":67134,"n":"Disclosure","g":3,"l":"Ishgard","s":19}}]}