{"quest":{"name":"To Siege or Not to Siege","location":"The Waking Sands","id":67138,"patch":3.0,"sort":23,"eventIcon":71201,"issuer":1013038,"target":1012579,"involved":[1003995,1012578,1012581,1012582,1012583,1012584,1012586,1012840,1012841,1012843,1014643,1014644],"genre":3,"journal":["Alphinaud is distracted by a call on his linkpearl.","Tataru sends grave tidings from the Holy See. It would seem the Horde gathers once more to renew its assault upon the city. Return to Ishgard, and rendezvous with the receptionist outside Fortemps Manor.","After welcoming you back to Ishgard, Tataru bids you enter Fortemps Manor, where Lord Haurchefant and Count Edmont wait to discuss the looming threat.","Your Ishgardian allies confirm that a Dravanian invasion is indeed imminent. Concerned for your safety, the count urges you to consider seeking sanctuary elsewhere. Speak with Alphinaud, and decide what the Scions will do.","After discussing the matter with Alphinaud, you resolve to do all in your power to aid your friends and allies. Faced with the assembled might of the Horde, however, how can the Holy See's exhausted defenders hope to prevail...?"],"objectives":["Speak with Tataru outside Fortemps Manor.","Enter Fortemps Manor.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Tataru? ...Yes, General Raubahn is now in safe hands."},{"name":"ALPHINAUD","text":"What? ...<span class=\"emphasis\">Another assault</span>? Very well. We shall return at once. Pray notify the count of our coming."},{"name":"ALPHINAUD","text":"It would seem we face another crisis. The Dravanians are preparing to resume their siege of the Holy See."},{"name":"ALPHINAUD","text":"...Though I am loath to abandon the sultana to her fate, we lack the necessary evidence to act upon Dewlala's claims."},{"name":"ALPHINAUD","text":"That being the case, I propose we leave Marshal Tarupin and the others to investigate, and return with all haste to Ishgard."},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"Ah, there you are! Sorry for cutting your reunion with General Raubahn short."},{"name":"TATARU","text":"I wouldn't have bothered you, but the city's awash with rumors of another Dravanian attack, and Lord Haurchefant was desperate to get hold of you. Speaking of whom, he and the others are waiting for you inside, so you'd better head in!"},{"name":"TATARU","text":"We can talk later! Everyone's waiting for you inside!"},{"name":"ALPHINAUD","text":"Let us hear what the count has to say."},{"name":"HAURCHEFANT","text":"I believe Mistress Tataru wished a word with you. Pray do not take long, however, as we have much to discuss."},{"name":"EDMONT","text":"Ah, you are returned..."},{"name":"ARTOIREL","text":"The hour has come..."},{"name":"EMMANELLAIN","text":"There you are, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! Tell me, do you want the good news first or the bad news? Actually, don't bother. There isn't any good news."},{"name":"PIPPIN","text":"Pray do not tarry for my father's sake. I will see that he is well looked after. And should we uncover any information on Her Grace's whereabouts, I promise you will be the first to know."},{"name":"DEWLALA","text":"I have taken charge of matters here. Consider yourself free to tend to other, more pressing tasks."},{"name":"HAURCHEFANT","text":"My friend! I thank you for answering our call with such alacrity! As I am sure you are now aware, the Dravanians are once more gathering for war."},{"name":"EDMONT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, Master Leveilleur─I must apologize for this abrupt summons, but we thought it best to have Mistress Tataru contact you by the most direct means available."},{"name":"ARTOIREL","text":"When the Observatorium's bells toll, 'tis a warning that cannot be ignored. The Holy See has ordered that we make ready for battle."},{"name":"EMMANELLAIN","text":"In case you haven't heard, a band of trappers returning from the west claim they saw a cloud of dragons big enough to dim the midday sky!"},{"name":"EDMONT","text":"Nidhogg's minions gather once more for war..."},{"name":"EDMONT","text":"But I would not have you take up arms in another of our conflicts. When first you came to Ishgard, I offered you my protection. If I cannot ensure your safety here, I cannot well accept your aid, much less ask for it."},{"name":"EDMONT","text":"Scions of the Seventh Dawn, you are faced with a choice: to remain in a besieged Ishgard, or seek sanctuary elsewhere. I would not presume to influence your decision, but I must ask that you make it swiftly, lest our enemies force your hand."},{"name":"HAURCHEFANT","text":"The coming of the Horde spells ruin for Ishgard...but her knights shall fight to the last to shield her citizens from harm!"},{"name":"EDMONT","text":"I confess, I know not where else you might seek sanctuary, but few places are like to be more perilous than a city under siege."},{"name":"ARTOIREL","text":"The Observatorium bells have tolled. Either flee this place or make ready for war."},{"name":"EMMANELLAIN","text":"How many dragons would it take to darken the midday sky, do you think? A thousand? More? Too many, at any rate..."},{"name":"ALPHINAUD","text":"Though we flee to the ends of the world, 'twould seem that no place in this troubled age is free of strife. Once more the Horde descends upon Ishgard, and once more her weary defenders must take up spear and bow."},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"The count would have us seek shelter from this storm, but I, for one, grow tired of running. If we are to shine the light of dawn, we must do so in the sight of our fellow man, not hunkered in a hole."},{"name":"ALPHINAUD","text":"What say you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What say you?"},{"name":"A1","text":"I would stay and fight."},{"name":"A1","text":"We cannot stay here."},{"name":"A1","text":"Hmph."},{"name":"ALPHINAUD","text":"Then fight we shall! Let it never be said that we abandoned our allies in their hour of need!"},{"name":"ALPHINAUD","text":"...That is your answer? By the Twelve, how could you─ But, wait. Mayhap remaining in the city would not best serve our friends and allies. Mayhap there is another choice..."},{"name":"PAPASHAN","text":"Thank you for rescuing General Raubahn. From the bottom of my heart. To behold him now, gaunt and unkempt... It pains me to think of all the hardship he has endured."},{"name":"PAPASHAN","text":"From the bottom of my heart, thank you for rescuing General Raubahn."},{"name":"TATARU","text":"What will become of this place...and us?"}],"reward":{"gil":972,"xp":50400},"reqs":{"jobs":[{"lvl":51,"id":142}],"quests":[67137]},"next":[67139]},"partials":[{"type":"npc","id":"1013038","obj":{"i":1013038,"n":"Alphinaud","l":356,"q":2}},{"type":"npc","id":"1012579","obj":{"i":1012579,"n":"Alphinaud","l":2320,"q":2}},{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"npc","id":"1012578","obj":{"i":1012578,"n":"Alphinaud","l":356,"q":1}},{"type":"npc","id":"1012581","obj":{"i":1012581,"n":"Haurchefant","l":2320,"q":2}},{"type":"npc","id":"1012582","obj":{"i":1012582,"n":"Artoirel","l":2320,"q":1}},{"type":"npc","id":"1012583","obj":{"i":1012583,"n":"Emmanellain","l":2320,"q":2}},{"type":"npc","id":"1012584","obj":{"i":1012584,"n":"Count Edmont De Fortemps","l":2320,"q":1}},{"type":"npc","id":"1012586","obj":{"i":1012586,"n":"Tataru","l":2320,"q":2}},{"type":"npc","id":"1012840","obj":{"i":1012840,"n":"Pipin","l":356,"q":1}},{"type":"npc","id":"1012841","obj":{"i":1012841,"n":"Dewlala","l":356,"q":1}},{"type":"npc","id":"1012843","obj":{"i":1012843,"n":"Papashan","l":356,"q":2}},{"type":"npc","id":"1014643","obj":{"i":1014643,"n":"Alphinaud","l":2301,"q":1}},{"type":"npc","id":"1014644","obj":{"i":1014644,"n":"Tataru","l":2301,"q":1}},{"type":"quest","id":"67137","obj":{"i":67137,"n":"Keeping the Flame Alive","g":3,"l":"Eastern Thanalan","s":22}},{"type":"quest","id":"67139","obj":{"i":67139,"n":"Alphinaud's Way","g":3,"l":"Fortemps Manor","s":24}}]}