{"quest":{"name":"A Reward Long in Coming","location":"The Sea of Clouds","id":67132,"patch":3.0,"sort":17,"icon":100399,"eventIcon":71201,"issuer":1012368,"target":1012329,"involved":[1011952,1012327,1012369,1012371,1012375],"genre":3,"journal":["Lord Emmanellain appears to be rather pleased with himself.","Ever quick to see the glass half-full, Lord Emmanellain has convinced himself that he should rightly be lauded for uncovering the existence of a Vanu primal. Report to Lady Laniaitte and see if she agrees.","Lady Laniaitte is shocked to hear that the Vanu have summoned a primal, and all agree that its presence must be behind the recent rise in Vanu hostility. Sensing his moment, Lord Emmanellain rather bluntly demands that the true hero of the hour be recognized, and for once, Lady Laniaitte agrees...and praises you for rescuing the young lord from a doom of his own making. More than satisfied with your efforts, she then invites you to return to Ishgard with Lord Haurchefant, prompting Lord Emmanellain to conclude that he too is no longer needed. Make your journey back to the city and speak with Lord Haurchefant once you have arrived.","Lord Haurchefant is a man who knows how to appreciate the simple pleasures in life, particularly after cheating death in battle yet again. In spite of this, he cannot help but be concerned for the welfare of Lord Emmanellain, and suggests that you visit him back at the manor.","For once, Lord Emmanellain is not his effervescent self, having received a dressing-down from his father for his recklessness. But will he take this lesson to heart? Only time will tell..."],"objectives":["Speak with Laniaitte.","Speak with Haurchefant in Ishgard.","Speak with Emmanellain in Fortemps Manor."],"dialogue":[{"name":"EMMANELLAIN","text":"Very well, I admit it: it was an incredibly harrowing experience. I could very well have <span class=\"emphasis\">died</span>, you know! Me! <span class=\"emphasis\">Dead</span>!"},{"name":"EMMANELLAIN","text":"On the other hand, by risking life and limb in the line of duty, I did succeed in uncovering the existence of a new primal. And that, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>, is no small feat!"},{"name":"EMMANELLAIN","text":"I have made <span class=\"emphasis\">an historic discovery</span>─a fact even Lady Laniaitte will have no choice but to acknowledge! Yeeesss, I am rather looking forward to basking in the sunshine of her praise. Speaking of which─isn't it time we made our triumphant return?"},{"name":"EMMANELLAIN","text":"How do I look? Dashing as always, with a suitable sprinkling of dirt and sweat? Excellent. Let us return to Lady Laniaitte at once!"},{"name":"HAURCHEFANT","text":"Even after everything he has been through, he manages to remain so...optimistic."},{"name":"HONOROIT","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, <span class=\"emphasis\">thank you</span>! If you had not rushed to his aid, I dare not think what would have happened!"},{"name":"LANIAITTE","text":"Praise Halone, I feared the worst! What happened out there?"},{"name":"LANIAITTE","text":"A <span class=\"emphasis\">primal</span>!? Are you sure!?"},{"name":"LANIAITTE","text":"Yet...now that I think on it, this Bismarck is reminiscent of the white whale of Vanu legend─a massive creature said to “swim” in the Sea of Clouds."},{"name":"HAURCHEFANT","text":"From what I have learned of comparable summonings, the presence of the Vanu's god would certainly explain the sudden change in their behavior toward the people of Camp Cloudtop."},{"name":"HONOROIT","text":"Ah, you mean to say that they have fallen under the primal's influence? I recall reading of such things in the documents provided by Master Alphinaud..."},{"name":"EMMANELLAIN","text":"Aren't we forgetting something important, Lady Laniaitte? A little recognition for the hero of the hour? A few choice expressions of gratitude, respect, admiration, and so on...?"},{"name":"LANIAITTE","text":"...Why <span class=\"emphasis\">yes</span>. You are right, of course. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> deserves all that and more for having risked <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> life to rescue such an...esteemed personage."},{"name":"HAURCHEFANT","text":"Well, if there is naught else to discuss, I would depart for Ishgard forthwith. The Holy See and the Temple Knights must be informed of this new threat without delay."},{"name":"LANIAITTE","text":"But of course.<br><span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you have done more than enough here. Pray return to Ishgard with Lord Haurchefant and give my warmest regards to the count."},{"name":"EMMANELLAIN","text":"So that's it, then? No more forays into enemy territory? Very well, I can see my services are no longer needed. Take care, Lady Laniaitte. May our next meeting take place under more...felicitous circumstances."},{"name":"HAURCHEFANT","text":"All's well that ends well, eh? To the airship landing, then! We can speak on the journey home."},{"name":"LANIAITTE","text":"All things considered, Emmanellain came through relatively unscathed. More's the pity─he might have learned something otherwise."},{"name":"HAURCHEFANT","text":"I confess, I have always been rather fond of airship travel. The chill of the wind upon your face, the warmth of the blood pumping in your veins from the excitement...! I find the whole experience indescribably invigorating!"},{"name":"HAURCHEFANT","text":"Or mayhap it is simply the joy of having cheated death yet again!? Ha ha! In any event, I must make for the Congregation and inform Ser Aymeric of all that has occurred."},{"name":"HAURCHEFANT","text":"Emmanellain should have returned to the manor by now. Why not go and see if he has recovered from his ordeal?"},{"name":"EMMANELLAIN","text":"Oh, it's you, <span class=\"highlight\">Forename</span>...<br>&lt;whimper&gt; Gods, did he have to strike me so hard?"},{"name":"EMMANELLAIN","text":"Father, he...he did not approve of how I handled matters in Camp Cloudtop─how I endangered the lives of others through my own...&lt;sniff&gt;...recklessness and incompetence."},{"name":"EMMANELLAIN","text":"It's not easy playing the hero, is it..."},{"name":"HONOROIT","text":"(My lord the count was utterly beside himself, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. 'Tis a mercy you were not here to witness it.)"}],"reward":{"gil":461,"items":[{"id":5677,"one":1},{"id":5682,"one":1},{"id":5717,"one":1}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[67131]},"next":[67133]},"partials":[{"type":"npc","id":"1012368","obj":{"i":1012368,"n":"Emmanellain","l":2100,"q":2}},{"type":"npc","id":"1012329","obj":{"i":1012329,"n":"Emmanellain","l":2320,"q":3}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012327","obj":{"i":1012327,"n":"Honoroit","l":2320,"q":3}},{"type":"npc","id":"1012369","obj":{"i":1012369,"n":"Haurchefant","l":2100,"q":2}},{"type":"npc","id":"1012371","obj":{"i":1012371,"n":"Honoroit","l":2100,"q":2}},{"type":"npc","id":"1012375","obj":{"i":1012375,"n":"Haurchefant","l":2301,"q":1}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"67131","obj":{"i":67131,"n":"A Series of Unfortunate Events","g":3,"l":"The Sea of Clouds","s":16}},{"type":"quest","id":"67133","obj":{"i":67133,"n":"Divine Intervention","g":3,"l":"Fortemps Manor","s":18}}]}