{"quest":{"name":"Gifts for the Outcasts","location":"The Dravanian Forelands","id":67148,"patch":3.0,"sort":33,"eventIcon":71201,"issuer":1012628,"target":1012629,"involved":[1011916,1012626,1012627,1012630,1012631],"genre":3,"journal":["Ysayle seems occupied with thoughts of the Gnath and their primal.","When Ysayle and Estinien set to bickering once more, Alphinaud again seeks to direct their energies toward the mission at hand. The young Scion contemplates the sobering issue of the Gnath's deity, and the need for additional information with which to plot its defeat. Professing to have little knowledge of Gnath culture, Ysayle suggests returning to Tailfeather to consult with Marcechamp. Speak with the village leader, and learn what he knows of the beast tribe's customs and beliefs.","Though he has often traded with the Gnath, Marcechamp admits that his knowledge of their faith and culture is scant at best. He suggests that you prepare an assortment of gifts, and barter with the outcast members of the beast tribe for the information you require. Slay clearwater nankas in the Whilom River, and gather hunks of flesh by way of an offering.","You have collected several hunks of nanka flesh. Head north of the Stained One, and deliver them to the waiting Alphinaud.","Alphinaud takes the nanka flesh, and adds it to the nectar and caelumtree fruit collected by the others. All that remains is to place the assorted offerings at the trading post, and hope that the outcast Gnath are in the mood to trade..."],"objectives":["Speak with Marcechamp.","Obtain hunks of nanka flesh from clearwater nankas.","Deliver the hunks of nanka flesh to Alphinaud."],"dialogue":[{"name":"ICEHEART","text":"So, the Gnath have summoned their god... And thus is the mystery of their newfound belligerence laid to rest."},{"name":"ESTINIEN","text":"Are you not glad, Lady Iceheart? I thought you would applaud them for summoning a primal to further their own ends. After all...<span class=\"emphasis\">you did</span>."},{"name":"ICEHEART","text":"I did <span class=\"emphasis\">not</span> reach out to Saint Shiva to further mine own ends! I desired her strength only to forge anew the peace between man and dragon! But what a fool I am to speak of peace to you─a bloodthirsty <span class=\"emphasis\">savage</span> who murders without thought or compunction!"},{"name":"ALPHINAUD","text":"Enough! Enough, I say! If the Gnath have truly brought forth their deity from the aether, we must face it together or watch our hopes fall apart! All now rests upon this primal's defeat."},{"name":"ALPHINAUD","text":"...But ere we think of confronting it, we must first study its origins. What is the nature of this god? What manner of faith sustains its existence?"},{"name":"ICEHEART","text":"...My apologies. You are right, of course. Let us return to Tailfeather and consult with Marcechamp─he knows more of the Gnath and their culture than most."},{"name":"ALPHINAUD","text":"Once more a primal rears its head, and once more the task of slaying it falls to you."},{"name":"ALPHINAUD","text":"Would that I, too, possessed the Echo..."},{"name":"ESTINIEN","text":"By the Fury... Must we now defeat a primal, that we might treat with a wyrm? I do begin to see how you gained your reputation for surmounting the insurmountable..."},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"ICEHEART","text":"（★未使用／削除予定★）"},{"name":"ESTINIEN","text":"（★未使用／削除予定★）"},{"name":"MARCECHAMP","text":"Oho! Back already, are we?<br>...Hm? Ah, met the Gnath, did you? And what is it you'd like to─"},{"name":"MARCECHAMP","text":"Summoned a primal, you say!? Seven hells... Well, I don't know bugger all about Gnath religion, if I'm honest. Beyond their tradin' habits, there never seemed much point in askin'."},{"name":"MARCECHAMP","text":"But it shouldn't be <span class=\"emphasis\">that</span> hard to find out. From time to time, we barter with a small hive to the north and west of here─outcasts from the main tribe, from what I understand. I reckon they'd be willin' to tell you a bit about 'emselves...if you give 'em the right incentives."},{"name":"ALPHINAUD","text":"That sounds promising. And what exactly would a Gnath consider to be “the right incentives”?"},{"name":"MARCECHAMP","text":"Oh, nothin' your average hunter couldn't scrounge up in a day or two. But seein' as you're in a hurry, you might want to divide the chores amongst yourselves. You'll want a good-sized jar of landtrap nectar, a basket of caelumtree fruit, and─always a Gnath favorite─a generous portion of young nanka flesh."},{"name":"ESTINIEN","text":"I shall gather the fruit─leaping to the lower branches of these forest giants should present little challenge to me."},{"name":"ICEHEART","text":"Then I shall collect the nectar...with Master Alphinaud's arcane assistance."},{"name":"MARCECHAMP","text":"An' that leaves you to bring home the meat. You'll need to carve it from the smaller nankas that live in the rivers─three big hunks should be enough, I reckon."},{"name":"MARCECHAMP","text":"Once you've got everythin' together, you'll need to set it down at what we call the “tradin' post.” Here─I'll mark the spot on your map for you."},{"name":"ALPHINAUD","text":"You have been most kind, Master Marcechamp."},{"name":"ALPHINAUD","text":"Well, then! Let us attend to our respective tasks, and reconvene at the trading post. I need hardly add that the last one there is a rotten nanka egg!"},{"name":"MARCECHAMP","text":"You're in charge of gatherin' the nanka flesh, right? You'll find the beasts down by the riverbanks─just be sure to avoid the bigger ones carryin' the unhatched spawn on their backs."},{"name":"MARCECHAMP","text":"I reckon three good hunks ought to do it. Soon as you've got 'em, head over to the tradin' post I marked on your map, an' add 'em to your mates' offerin's. Simple."},{"name":"ALPHINAUD","text":"I was able to gather a goodly amount of nectar from the landtraps─though I would not have known how to harvest it without Ysayle's help. Do you have the nanka meat?"},{"name":"ALPHINAUD","text":"Splendid. I shall put this with Estinien's fruit and assemble a suitably generous-looking hamper for the Gnath."},{"name":"ICEHEART","text":"Master Alphinaud possesses a rare talent for the arcane arts. Should he continue to apply himself to their study, he will become a formidable mage in time."},{"name":"ESTINIEN","text":"When I set out to master the dragoon's jump, 'twas not to strike fear into the hearts of high-hanging fruit."}],"reward":{"gil":560,"items":[{"id":10825,"one":1,"hq":1},{"id":10909,"one":1,"hq":1},{"id":10951,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":142}],"quests":[67147]},"next":[67149,67314,67315,67316,67320,67321]},"partials":[{"type":"npc","id":"1012628","obj":{"i":1012628,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1012629","obj":{"i":1012629,"n":"Alphinaud","l":2000,"q":2}},{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1012626","obj":{"i":1012626,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1012627","obj":{"i":1012627,"n":"Estinien","l":2000,"q":1}},{"type":"npc","id":"1012630","obj":{"i":1012630,"n":"Estinien","l":2000,"q":2}},{"type":"npc","id":"1012631","obj":{"i":1012631,"n":"Ysayle","l":2000,"q":2}},{"type":"item","id":"10825","obj":{"i":10825,"n":"Holy Rainbow Sarouel of Aiming","l":125,"c":45651,"t":36,"p":11880}},{"type":"item","id":"10909","obj":{"i":10909,"n":"Holy Rainbow Sarouel of Healing","l":125,"c":45652,"t":36,"p":11880}},{"type":"item","id":"10951","obj":{"i":10951,"n":"Holy Rainbow Sarouel of Casting","l":125,"c":45653,"t":36,"p":11880}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67147","obj":{"i":67147,"n":"The Trine Towers","g":3,"l":"The Dravanian Forelands","s":32}},{"type":"quest","id":"67149","obj":{"i":67149,"n":"The Nonmind","g":3,"l":"The Dravanian Forelands","s":34}},{"type":"quest","id":"67314","obj":{"i":67314,"n":"A Trap to Yawn For","g":98,"l":"The Dravanian Forelands","s":5206}},{"type":"quest","id":"67315","obj":{"i":67315,"n":"Needs More Salt","g":98,"l":"The Dravanian Forelands","s":5207}},{"type":"quest","id":"67316","obj":{"i":67316,"n":"Uninvited Guests","g":98,"l":"The Dravanian Forelands","s":5209}},{"type":"quest","id":"67320","obj":{"i":67320,"n":"Wet Strings Attached","g":98,"l":"The Dravanian Forelands","s":5208}},{"type":"quest","id":"67321","obj":{"i":67321,"n":"What Remaclon Saw","g":98,"l":"The Dravanian Forelands","s":5210}}]}