{"quest":{"name":"Sounding Out the Amphitheatre","location":"Coerthas Western Highlands","id":67142,"patch":3.0,"sort":27,"icon":100404,"eventIcon":71201,"issuer":1012600,"target":1011907,"involved":[1011904,1011905,1012601,1012602,1012603,1012604,1013435,1013436],"genre":3,"journal":["Alphinaud seems intent on traveling to the Akh Afah Amphitheatre.","Upon learning that the Akh Afah Amphitheatre may yet harbor your quarry, Alphinaud suggests employing the swiftest means of travel available─the aetheryte found within the Warrens of Snowcloak. Speak with the House Durendaire guard stationed at the tunnel entrance in the western highlands.","You enter the Akh Afah Amphitheatre, and soon cross paths with its heretical occupants. Though Alphinaud declares his intention to parley, the heretics are not inclined to trust his word, and the encounter quickly devolves into violence─an unwanted conflict from which you and your fellows emerge triumphant yet frustrated. With naught save the parting words of the retreating heretics on which to rely, you have little choice but to investigate the island known as the Dreaming Dragon. Speak with Estinien at the entrance to the Warrens, and plan the next step of your journey.","Before making for the Dreaming Dragon, Estinien suggests that you visit a group of dragonslayers known as the Convictors who have pitched camp in the region of Twinpools. Speak with the Convictors' leader, Jantellot, and learn what he knows of the heretics and their island lair.","Your meeting with the honored leader of the Convictors serves to convince you of two things: first, that Jantellot is ignorant of Iceheart's movements, and second, that he is only marginally better informed about those of his own men. After freely admitting that his fellow dragonslayers often fail to share information with him, he invites you to question them yourselves."],"objectives":["Speak with Tristechambel.","Speak with Estinien.","Speak with Jantellot at the Convictors' camp."],"dialogue":[{"name":"ALPHINAUD","text":"The Akh Afah Amphitheatre... The very place where you witnessed the manifestation of the primal Shiva, was it not?"},{"name":"ESTINIEN","text":"If that is our destination, the journey will be long indeed. The amphitheatre lies on the other side of a treacherous tract of ice and snow that cannot swiftly be crossed."},{"name":"ALPHINAUD","text":"Then we must place our faith in the Aethernet. As you may recall, our dear friend Moenbryda succeeded in recreating the Akh Afah beacon after it had been destroyed by Lady Iceheart. At the time, it was assumed that the resultant aetheryte would only be temporarily viable, but given that the heretics of Gorgagne Mills seem to have been in regular contact with their brethren at the amphitheatre, I'll wager it still functions. I suggest we make for the aetheryte within Snowcloak without delay."},{"name":"ALPHINAUD","text":"Correct me if I am wrong, Estinien, but in the course of mapping the Snowcloak tunnel system, a passage was discovered leading out into the western highlands, was it not? Might it be possible for us to reach the aetheryte from this side of the wall?"},{"name":"ESTINIEN","text":"It should. House Durendaire posted soldiers at the western highlands entrance after the tunnels were cleared, but they will not deny us entry."},{"name":"KIGHTLEADER01605","text":"There are requests for foodstuffs, clothing, and all manner of provisions. Iceheart's followers must yet inhabit the ruins we had thought abandoned..."},{"name":"ESTINIEN","text":"“Akh Afah” is taken from the dragons' tongue─it means, roughly, “Eternal Circle.” 'Tis little wonder the heretics thought to return to the place."},{"name":"KIGHTLEADER01605","text":"Do you mean to follow the heretics' trail, then? I will see that Ser Redwald is informed."},{"name":"ALPHINAUD","text":"Do you recall the first time you ventured into these tunnels in search of Lady Iceheart? It seems an age ago, does it not...? Back then, I still believed myself the commander of the Crystal Braves..."},{"name":"ESTINIEN","text":"What ails our young lord? The moment we arrived at the wall, his face took on an ashen pallor. Does he fear facing the heretics within their own lair?"},{"name":"TRISTECHAMBEL","text":"Ah, the guests of House Fortemps...accompanied by the Azure Dragoon, no less!"},{"name":"TRISTECHAMBEL","text":"I cannot imagine what brought you out this far, but you are welcome to enter the tunnels if that is your will."},{"name":"ALPHINAUD","text":"Assuming the Akh Afah beacon still functions─and we must pray to the Twelve it does─we shall arrive at our destination in mere moments."},{"name":"ALPHINAUD","text":"Though I do not expect to be greeted by the primal Shiva, we should nevertheless be prepared for a frosty reception. ...The heretics are not like to rejoice at the appearance of uninvited guests─particularly ones with our history."},{"name":"ADELPHEL","text":"We have begun surveying the Warrens from the western entrance, but progress is slow. 'Twould seem not all the rats have left the nest..."},{"name":"ALPHINAUD","text":"An impressive structure. I wonder how many ages it has endured..."},{"name":"ESTINIEN","text":"Mayhap you should ask its occupants. They seem a friendly bunch."},{"name":"HERETIC01606","text":"Dogs of Ishgard! Is it not enough that you banish our beloved saint? Will you not be satisfied until the ice is slick with the last drops of our blood!?"},{"name":"ALPHINAUD","text":"Stay your weapons! We come under the flag of parley! We wish only to speak with your mistress, that we might broker a peace!"},{"name":"HERETIC01606","text":"Do you think us fools, boy!? It will take more than honeyed words to earn our trust. You walk with the dragonslayer, and we know all too well what he is capable of!"},{"name":"ESTINIEN","text":"My reputation precedes me..."},{"name":"ALPHINAUD","text":"&lt;sigh&gt; ...They give us little choice."},{"name":"HERETIC01606","text":"Come, brothers! May dragon wings bear us to victory!"},{"name":"HERETIC01606","text":"&lt;gasp&gt; Th-They fight like demons... 'Tis death to remain!"},{"name":"HERETIC01606","text":"Fall back, brothers! Retreat to the Cinders!"},{"name":"ALPHINAUD","text":"I see no sign of Lady Iceheart. Would that we could have questioned one of them..."},{"name":"ESTINIEN","text":"What would you ask that we do not already know? They make for the Cinders, and so must we. Even should an ambush await us, 'tis certain there will be more heretics to <span class=\"emphasis\">question</span>."},{"name":"ALPHINAUD","text":"“The Cinders,” you say? I confess, the name is unknown to me. Mayhap you would be so good as to enlighten us, Estinien?"},{"name":"ESTINIEN","text":"...I suspect it is the heretics' way of referring to the Dreaming Dragon─an island of sorts found in the midst of the frozen lake of Ashpool."},{"name":"ESTINIEN","text":"Some five hundred years past, 'tis told that the Azure Dragoon of the age fought a dragon of titanic proportions. After a savage struggle, the mighty creature was weakened unto the point of death, and forced into a magicked slumber by an entire chapter of the Holy See's sorcerers."},{"name":"ESTINIEN","text":"Ere long, a rain of ash and cinders did begin to fall upon the sleeping serpent's motionless form, covering the creature at length in a shroud of grey. ...Of course, a thick layer of ice has since formed on top of it, but you may be sure I speak true."},{"name":"ALPHINAUD","text":"A fascinating tale. We should make haste to this ashen isle."},{"name":"ALPHINAUD","text":"Only in a land where war has raged for a thousand years could enough ash fall to bury a dragon the size of an island..."},{"name":"ESTINIEN","text":"The Dreaming Dragon lies far to the west. Before we approach the frozen beast, however, there is another place I would visit first."},{"name":"ESTINIEN","text":"I am told the Convictors have set up camp in Twinpools. Their leader, Jantellot, may have information of use to us."},{"name":"ESTINIEN","text":"Ah, but mayhap you are not familiar with that name, either... The Convictors are dragonslayers─after a fashion─but I am willing to wager that they encounter their fair share of heretics. If we are indeed walking into a trap, I would learn all there is to know of our foe."},{"name":"ALPHINAUD","text":"A sound suggestion. Let us speak with these Convictors, then, and temper our haste with a measure of caution."},{"name":"ADELPHEL","text":"My thanks for ridding the tunnels of their rat infestation. With any luck, I shall finally be able to carry out my work uninterrupted."},{"name":"TRISTECHAMBEL","text":"What...? You've driven off the heretics? That should certainly ease the minds of our surveyors!"},{"name":"JANTELLOT","text":"Well, well. What do we have here? Hoping to join the esteemed ranks of the Convictors, are we?"},{"name":"JANTELLOT","text":"The hard-eyed <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> looks promising, but you have a frail look about you, boy... I give you three days ere the wilds claim your corpse."},{"name":"ALPHINAUD","text":"I beg your pardon...?"},{"name":"ESTINIEN","text":"Be not so quick to judge. I have seen this “frail” youth fell heretics with a flick of his wrist."},{"name":"JANTELLOT","text":"And who are you to question my─ By the Fury!"},{"name":"JANTELLOT","text":"That armor... That lance! The Azure Dragoon himself graces our camp!"},{"name":"JANTELLOT","text":"Pray forgive my disrespect, ser. I am Jantellot─leader of the Convictors and fellow slayer of dragons."},{"name":"JANTELLOT","text":"...May I ask what winds─fair or foul─carry you into our humble camp?"},{"name":"JANTELLOT","text":"Ah. Lady Iceheart, is it? Aye, I know her by reputation─but I'm afraid I've seen naught of her or her people."},{"name":"JANTELLOT","text":"That said, my own men can be...ahem...somewhat lax when it comes to making reports. You may wish to question them yourselves."},{"name":"ALPHINAUD","text":"Thank you. We shall."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, Estinien─let us make our way through the camp, and see what information there is to be had."},{"name":"LANCER01607","text":"Ah, 'tis colder than Lady Iceheart's frost-rimed...uh, soul! Greetings, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>! A fine day, is it not?"},{"name":"ARCHER01607","text":"Be still! How am I supposed to watch for the distant flicker of dragon wings when my ears are ringing with your incessant chatter!?"},{"name":"QIB","text":"Defeat the heretics!"},{"name":"QIB","text":"You will not defile this sacred place a second time!"},{"name":"QIB","text":"N-No! Wait! We did not come here to fight!"},{"name":"QIB","text":"Waste no more words on them. They are deaf to reason."},{"name":"QIB","text":"By the Fury... They partake of the blood of dragons!"},{"name":"QIB","text":"<span class=\"emphasis\">Seven hells...</span> Can dragon blood truly bring about such a transformation?"},{"name":"QIB","text":"You should not have come here, Ishgardians..."},{"name":"QIB","text":"Twelve forfend!"},{"name":"QIB","text":"At last, a foe I might sink my lance into."},{"name":"QIB","text":"You are fortunate indeed. Behold the true power of our faith!"},{"name":"QIB","text":"No... Our journey has scarce begun..."},{"name":"QIB","text":"I cannot fall to this rabble..."}],"reward":{"gil":1096,"xp":50400},"reqs":{"jobs":[{"lvl":51,"id":142}],"quests":[67141]},"next":[67143,67289,67296,67297,67298,67300,67301,67302,67305,67647]},"partials":[{"type":"npc","id":"1012600","obj":{"i":1012600,"n":"Alphinaud","l":2200,"q":2}},{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"npc","id":"1011904","obj":{"i":1011904,"n":"Adelphel","l":2200,"q":1}},{"type":"npc","id":"1011905","obj":{"i":1011905,"n":"Tristechambel","l":2200,"q":1}},{"type":"npc","id":"1012601","obj":{"i":1012601,"n":"Expedition Leader","l":2200,"q":2}},{"type":"npc","id":"1012602","obj":{"i":1012602,"n":"Estinien","l":2200,"q":2}},{"type":"npc","id":"1012603","obj":{"i":1012603,"n":"Alphinaud","l":2200,"q":1}},{"type":"npc","id":"1012604","obj":{"i":1012604,"n":"Estinien","l":2200,"q":1}},{"type":"npc","id":"1013435","obj":{"i":1013435,"n":"Boorish Banneret","l":2200,"q":3}},{"type":"npc","id":"1013436","obj":{"i":1013436,"n":"Boorish Bowman","l":2200,"q":3}},{"type":"quest","id":"67141","obj":{"i":67141,"n":"From One Heretic to Another","g":3,"l":"Coerthas Western Highlands","s":26}},{"type":"quest","id":"67143","obj":{"i":67143,"n":"Camp of the Convictors","g":3,"l":"Coerthas Western Highlands","s":28}},{"type":"quest","id":"67289","obj":{"i":67289,"n":"Lonely Vigil","g":94,"l":"Coerthas Western Highlands","s":5102}},{"type":"quest","id":"67296","obj":{"i":67296,"n":"Baby Steps","g":94,"l":"Coerthas Western Highlands","s":5104,"f":1}},{"type":"quest","id":"67297","obj":{"i":67297,"n":"Baby Strides","g":94,"l":"Coerthas Western Highlands","s":5106}},{"type":"quest","id":"67298","obj":{"i":67298,"n":"The Secret to Success","g":94,"l":"Coerthas Western Highlands","s":5110}},{"type":"quest","id":"67300","obj":{"i":67300,"n":"Introductory Dragonslaying","g":94,"l":"Coerthas Western Highlands","s":5111}},{"type":"quest","id":"67301","obj":{"i":67301,"n":"Intermediate Dragonslaying","g":94,"l":"Coerthas Western Highlands","s":5112}},{"type":"quest","id":"67302","obj":{"i":67302,"n":"Advanced Dragonslaying","g":94,"l":"Coerthas Western Highlands","s":5113}},{"type":"quest","id":"67305","obj":{"i":67305,"n":"Expert Dragonslaying","g":94,"l":"Coerthas Western Highlands","s":5114}},{"type":"quest","id":"67647","obj":{"i":67647,"n":"For All the Nights to Come","g":94,"l":"Coerthas Western Highlands","s":15101,"f":1}}]}