{"quest":{"name":"Mourn in Passing","location":"The Dravanian Forelands","id":67153,"patch":3.0,"sort":38,"icon":100409,"eventIcon":71201,"issuer":1013584,"target":1012661,"involved":[1012635,1012657,1012658,1012659,1012660,1012662,1012663,1014104,1014105,1014106,1014201,1014545],"genre":3,"journal":["Alphinaud is keen to inform Vidofnir of Lord Ravana's defeat.","Alphinaud is eager to begin the ascent of Sohm Al. Return to Anyx Trine in the Dravanian forelands, and report your victory over the Gnath's god to Vidofnir.","Vidofnir listens in disbelief as Ysayle relates the circumstances of Lord Ravana's defeat. True to her word, the dragon vows that she will open the way to Sohm Al...once you have negotiated the cavern of Mourn. Climb the central tower of Anyx Trine to the second floor, then fight your way through Mourn's denizens to join Vidofnir on the threshold of the path to the summit.","After battling your way through the cavern of Mourn, Vidofnir opens the path forward, as promised. Before taking her leave, however, the dragon warns that you will not be welcome in the domain beyond. Prepare to face the mightiest of Nidhogg's minions, on your way to the summit of Sohm Al.<br><br>※Challenge Sohm Al with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","You have defeated Tioman, the consort of Nidhogg, and restored light to your Crystal of Earth in so doing. Soon after the dragon's death, however, Estinien is overwhelmed by Nidhogg's feelings of rage and anguish─an unwelcome reminder of the connection he shares with the great wyrm. Put any doubts you may feel to one side, and continue your journey into the Churning Mists.","You have arrived at the summit of Sohm Al. Trouble Alphinaud for his thoughts on finally having reached the mountain's lofty peak.","Alphinaud seems awed and humbled to be standing at the summit of Eorzea's highest mountain. The Churning Mists stretch out before you, beckoning you on towards the culmination of your arduous journey."],"objectives":["Speak with Vidofnir.","Meet Vidofnir in the cavern of Mourn.","Enter Sohm Al.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Shall we be on our way to Anyx Trine, then? I would not have the dragons think that we have forgotten our bargain."},{"name":"ESTINIEN","text":"Ahh, you should have seen the boy fretting... 'Twas a sight to behold!"},{"name":"ICEHEART","text":"Tease him no more. Master Alphinaud is to be applauded for his sense of responsibility. Given his years, 'tis little wonder the burden weighs heavy upon his shoulders..."},{"name":"ICEHEART","text":"'Tis natural for him to feel concern for his companions."},{"name":"ESTINIEN","text":"Vidofnir will be pleased to hear of Lord Ravana's defeat, and of his pledge to recall his soldiers."},{"name":"ESTINIEN","text":"Will the dragon now honor her word? That remains to be seen..."},{"name":"ICEHEART","text":"You should be the one to break the news. The victory was yours, after all."},{"name":"VIDOFNIR","text":"Thou art returned, Little One. Hast thou abandoned thine ill-conceived contest with the Gnath?"},{"name":"ICEHEART","text":"Nay, my friend, we return in triumph. By <span class=\"highlight\">Forename</span>'s hand was the beastmen's god, Lord Ravana, laid low."},{"name":"ICEHEART","text":"In his overconfidence, the primal swore to withdraw his followers from your lands in the event of his defeat─a promise we believe he will keep. The Gnath shall trouble you no longer."},{"name":"VIDOFNIR","text":"The deity is slain, then...? How didst thou contend with his biting blades!? ...But the particulars matter not. Thou hast fulfilled thy promise, and I shall fulfill mine."},{"name":"VIDOFNIR","text":"Attend me, mortals: hie you unto the deepest reaches of Mourn, and there shall you find Halo─the altar from which you may begin your ascent to the summit of Sohm Al."},{"name":"VIDOFNIR","text":"But be fairly warned: the minions of Nidhogg shall not lightly suffer your presence on that sacred mount. By your struggles within the cavern shall I judge your party possessed of sufficient fortitude to proceed."},{"name":"ICEHEART","text":"We shall not disappoint you, Vidofnir."},{"name":"ICEHEART","text":"If memory serves, the cavern of Mourn is entered from the second floor of the central tower. Let us begin the climb."},{"name":"VIDOFNIR","text":"Be fairly warned: the minions of Nidhogg shall not lightly suffer your presence on the sacred mount. By your struggles within the cavern of Mourn shall I judge your party possessed of sufficient fortitude to proceed."},{"name":"VIDOFNIR","text":"（★未使用／削除予定★）"},{"name":"VIDOFNIR","text":"（★未使用／削除予定★）"},{"name":"VIDOFNIR","text":"Well done, Little One. As promised, I shall open the way to Sohm Al's summit for thee and thy companions."},{"name":"VIDOFNIR","text":"Heed me now, children of man: the domain you seek to enter hath not seen visitors of your kind in nigh on a thousand years. Though I freely grant you passage, your presence will not be welcomed."},{"name":"VIDOFNIR","text":"To my kin, this mountain is revered as holy ground and resting place both─ware you the minions of Nidhogg during your ascent, for 'tis certain they shall take great offense at your intrusion."},{"name":"ICEHEART","text":"We are grateful for your warnings, gentle Vidofnir."},{"name":"VIDOFNIR","text":"My final words are for <span class=\"emphasis\">thee</span>, dragoon: have care to keep the stolen power thou wieldest in check, lest it breed further despair."},{"name":"ICEHEART","text":"Estinien...?"},{"name":"ESTINIEN","text":"The way is open. Let us not tarry here."},{"name":"ICEHEART","text":"A moment! Shall we blindly forge on, knowing the dangers that await us? Tioman herself is said to guard this peak."},{"name":"ESTINIEN","text":"I do not fear Nidhogg's consort. Any dragon foolish enough to bar our path shall feel the sting of my lance."},{"name":"ICEHEART","text":"Spoken like a true <span class=\"emphasis\">butcher</span>! Need I remind you that we are come to parley a peace!?"},{"name":"ESTINIEN","text":"Let us be clear, <span class=\"emphasis\">heretic</span>: 'twas to save Ishgard and her people that I first lent my support to this doubtful venture. And 'tis for their sake that I go now to speak with Hraesvelgr."},{"name":"ESTINIEN","text":"But I said nothing of Tioman. Should the opportunity present itself to rid my people of one of their deadliest enemies, I shall take it. That is my duty as Azure Dragoon."},{"name":"ICEHEART","text":"You are beyond redemption..."},{"name":"ALPHINAUD","text":"We will accomplish nothing by bickering. If we are to meet with Hraesvelgr, our path leads up the mountain."},{"name":"ALPHINAUD","text":"We shall defend ourselves if attacked, but avoid conflict wherever possible. What other choice do we have?"},{"name":"ALPHINAUD","text":"We shall defend ourselves if attacked, but avoid conflict wherever possible. What other choice do we have?"},{"name":"ESTINIEN","text":"I feel the weight of Dravanian rancor pressing down upon me..."},{"name":"ICEHEART","text":"A dragon lost to anger is beyond all control. This I learned to my sorrow when I unleashed the Horde upon Ishgard..."},{"name":"ICEHEART","text":"Tioman, consort of Nidhogg, we beseech you─grant us safe passage to the mountain's summit. We mean you no harm."},{"name":"ESTINIEN","text":"As I thought. Blind to reason like all the rest. If you would see our mission to its conclusion, you know what must be done."},{"name":"ICEHEART","text":"Such rage and rancor... Is there truly no other way?"},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>!?"},{"name":"ESTINIEN","text":"'Twould seem Tioman was the last. I sense no other dragons nearby."},{"name":"ALPHINAUD","text":"What is happening!?"},{"name":"ESTINIEN","text":"&lt;gasp&gt; Nidhogg... He roars."},{"name":"ICEHEART","text":"He knows we are here, then?"},{"name":"ESTINIEN","text":"His fury... &lt;gasp&gt; It bleeds through the Eye."},{"name":"ESTINIEN","text":"Fear not, I am yet my own master..."},{"name":"ESTINIEN","text":"...But that damned wyrm's wrath burns hotter than flame... Come, the heart of the dragons' homeland yet lies before us."},{"name":"ICEHEART","text":"Thus do we add another link to the chain of vengeance. Oh, Saint Shiva, when will it end...?"},{"name":"ALPHINAUD","text":"We have reached it at last... The peak of Sohm Al."},{"name":"ALPHINAUD","text":"'Tis said to be the highest mountain in all of Eorzea, you know. I thought it cold in Coerthas, but the air here carries the chill of a dozen winters..."},{"name":"ICEHEART","text":"We stand within the sacred homeland of dragons, beneath the sky that is Hraesvelgr's domain. Our quest nears its end, <span class=\"highlight\">Forename</span>..."},{"name":"ESTINIEN","text":"Ahhh... I feel the wyrm's anger. His lair is not far...not far at all."}],"reward":{"gil":5000,"aetherCurrent":1,"xp":57600,"instance":37},"reqs":{"jobs":[{"lvl":53,"id":142}],"quests":[67152]},"next":[67154]},"partials":[{"type":"npc","id":"1013584","obj":{"i":1013584,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1012661","obj":{"i":1012661,"n":"Alphinaud","l":2002,"q":2}},{"type":"npc","id":"1012635","obj":{"i":1012635,"n":"Alphinaud","l":2000,"q":2}},{"type":"npc","id":"1012657","obj":{"i":1012657,"n":"Vidofnir","l":2000,"q":1}},{"type":"npc","id":"1012658","obj":{"i":1012658,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1012659","obj":{"i":1012659,"n":"Estinien","l":2000,"q":1}},{"type":"npc","id":"1012660","obj":{"i":1012660,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1012662","obj":{"i":1012662,"n":"Estinien","l":2002,"q":2}},{"type":"npc","id":"1012663","obj":{"i":1012663,"n":"Ysayle","l":2002,"q":2}},{"type":"npc","id":"1014104","obj":{"i":1014104,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1014105","obj":{"i":1014105,"n":"Estinien","l":2000,"q":1}},{"type":"npc","id":"1014106","obj":{"i":1014106,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1014201","obj":{"i":1014201,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1014545","obj":{"i":1014545,"n":"Estinien","l":2000,"q":2}},{"type":"instance","id":"37","obj":{"i":37,"n":"Sohm Al","c":61801,"t":"Dungeons","min_lvl":53,"max_lvl":54,"min_ilvl":105}},{"type":"quest","id":"67152","obj":{"i":67152,"n":"Lord of the Hive","g":3,"l":"The Dravanian Forelands","s":37}},{"type":"quest","id":"67154","obj":{"i":67154,"n":"Beyond the Clouds","g":3,"l":"The Churning Mists","s":39}}]}