{"quest":{"name":"Moglin's Judgment","location":"The Churning Mists","id":67159,"patch":3.0,"sort":44,"eventIcon":71201,"issuer":1012077,"target":1012078,"involved":[1012664,1012680,1012681,1013586,1013587,1013588,1013589,1013590,1013591,1013592,1013593],"genre":3,"journal":["Chieftain Moglin is ready to pass judgment on your trial performance.","After witnessing your conduct during your grueling “trials,” Chieftain Moglin declares that he has an announcement to make. Gather your companions that you might all be present to hear the moogle leader's decision.","You speak to each of your companions in turn, and inform them of Chieftain Moglin's impending announcement. Return to the center of Moghome, and notify the moogle leader that everyone is ready to hear him pass judgment.","Chieftain Moglin somewhat sheepishly admits that your trials were nothing more than a convenient distraction─a means to keep you and your companions occupied while the moogles repaired the horn required to summon Hraesvelgr. It would seem the mere presence of Kuplo Kopp was enough to dispel any doubts the chieftain may have had regarding your intentions. Trouble Moghan for his thoughts on these questionable proceedings.","Moghan guiltily thanks you for your hard work, but deflects all the blame for the deception onto Chieftain Moglin. Though some of your companions are less than impressed with their treatment at the hands of the moogles, you now have a destination to aim for─Zenith."],"objectives":["Speak with Alphinaud.","Speak with Estinien.","Speak with Ysayle.","Speak with Kan–E–Senna.","Speak with Kuplo Kopp.","Speak with Moglin.","Speak with Moghan."],"dialogue":[{"name":"MOGLIN","text":"<span class=\"highlight\">Forename</span>─if that is what you insist on calling yourself─you have completed the Trials of Trustworthiness administered by the taskmasters Moghan, Mogmug, and Mogwin!"},{"name":"MOGLIN","text":"During these grueling tests of character, I closely observed your conduct─as well as that of your companions..."},{"name":"MOGLIN","text":"And...I am decided, kupo! Gather your friends before me now, so that I need not repeat myself...needlessly."},{"name":"MOGLIN","text":"Not another word until you have summoned your companions, kupo! I was quite serious about the “not repeating myself” part..."},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"ESTINIEN","text":"（★未使用／削除予定★）"},{"name":"ICEHEART","text":"（★未使用／削除予定★）"},{"name":"KANESENNA","text":"（★未使用／削除予定★）"},{"name":"KUPLOKOPP","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"Are these “trials” over, then? My tasks have been little more than household chores..."},{"name":"ALPHINAUD","text":"If our hosts elect not to grant their aid after working us like pack chocobos, I shall demand compensation in kupo nuts out of principle. But I hope it will not come to that. Let us hear the chieftain's verdict, shall we?"},{"name":"BODYGUARD01623","text":"They had the Elder Seedseer scrubbing and sweeping... The <span class=\"emphasis\">Elder Seedseer</span>!"},{"name":"BODYGUARD01412","text":"I never imagined my duties would include tidying up fallen leaves in a moogle village beyond the clouds..."},{"name":"ICEHEART","text":"What sorcery is this...? That my heart should stir at mere...<span class=\"emphasis\">fluffiness</span>..."},{"name":"ICEHEART","text":"<span class=\"emphasis\"><span class=\"highlight\">Forename</span></span>! I-I was... No matter. What is it? ...Chieftain Moglin has made his decision? Well, let us not keep him waiting, then!"},{"name":"KANESENNA","text":"Standing here in Moghome, my thoughts turn inevitably to the legend of Good King Moggle Mog XII, and his seat in the heavens..."},{"name":"KANESENNA","text":"Like most, I thought it no more than a myth─a story for younglings that grew with the telling. But with every passing moment, I become more certain that we have discovered the origin of the tale. Full eager am I to hear what the chieftain has to say."},{"name":"KUPLOKOPP","text":"We've become such friends, kupo! My moogle cousins love to sing and dance as much as I do!"},{"name":"KUPLOKOPP","text":"...Chieftain Moglin has finally come to a decision, has he? Well, I suppose I'd better flutter over and see him, then!"},{"name":"ESTINIEN","text":"How go your trials, Warrior of Light? I myself have been sent on a number of expeditions to “chastise” the local dragon population. Did not their chieftain wish to <span class=\"emphasis\">avoid</span> inflaming the Dravanians...?"},{"name":"ESTINIEN","text":"Such contradictions aside, our hosts seemed entranced by the height of my leap. They compared me to “Mog,” a lance-wielding moogle warrior of eld who also favored such attacks."},{"name":"ESTINIEN","text":"'Twas meant as a compliment, I expect, but I doubt these furry lumps could outleap a karakul lamb, much less a dragoon. Conclude your business here swiftly, <span class=\"highlight\">Forename</span>─I like not this place."},{"name":"MOGLIN","text":"Never have I seen such determined workers, kupo! It would have taken us <span class=\"emphasis\">moons</span> to complete all those dreary chores and niggling errands!"},{"name":"KANESENNA","text":"And have our labors proven the purity of our intentions, Chieftain?"},{"name":"MOGLIN","text":"Without a doubt! In fact, there was never really all <span class=\"emphasis\">that</span> much doubt to begin with... You were, after all, already friends with a fellow moogle."},{"name":"MOGLIN","text":"But, you see, before any meeting with Hraesvelgr could take place, certain <span class=\"emphasis\">preparations</span> needed to be made... And what better way to help you pass the time than by having you perform all the tiresome tasks that no one ever wants to do, kupo!"},{"name":"ESTINIEN","text":"Grrr..."},{"name":"MOGLIN","text":"Ohhh dear... Th-The horn! <span class=\"emphasis\">Bring out the horn</span>! Quickly now!"},{"name":"MOGLIN","text":"We blow on this wondrous instrument whenever we wish to speak with the great wyrm, kupo."},{"name":"MOGLIN","text":"We, uh...we haven't perhaps been treating it with the care it deserves of late (and I think Moghan may have sat on it), so we needed some time for cleaning and polishing (and straightening)."},{"name":"MOGLIN","text":"No lasting harm done, though! Now, you need simply head to Zenith─the wyrm's dwelling to the west─and give the horn a good toot."},{"name":"ICEHEART","text":"We are in your debt, Chieftain. Thanks to your noble gift, we shall finally have a chance to plead our case to Hraesvelgr."},{"name":"MOGLIN","text":"...Very possibly, yes.<br>...But I wouldn't get my hopes up <span class=\"emphasis\">too</span> high, kupo. The old wyrm isn't terribly fond of...um..."},{"name":"ICEHEART","text":"Your concern is appreciated, but I am quite certain that Hraesvelgr will welcome our overtures."},{"name":"ESTINIEN","text":"...Should we ever arrive at his lair. Come─we have squandered enough time already."},{"name":"KANESENNA","text":"Chieftain Moglin, we thank you for your gracious hospitality. Though we must soon take our leave, I pray that we may continue to nurture the shoots of this new-sprung friendship 'twixt earth and sky."},{"name":"MOGLIN","text":"Of course, of course, kupo! Visit us whenever you wish! Consider Moghome your home amongst the clouds!"},{"name":"ALPHINAUD","text":"Well that took rather longer than expected. We can ill afford any further delays..."},{"name":"ESTINIEN","text":"Barefaced little bastards... They have played us for fools."},{"name":"ICEHEART","text":"Hraesvelgr... At last, we shall meet again."},{"name":"KANESENNA","text":"This journey has provided us an invaluable opportunity. We must cherish and strengthen the new bonds we have forged."},{"name":"KUPLOKOPP","text":"Oh, I have so many wonderful tales to tell my kinsmoogles back in the Twelveswood!"},{"name":"MOGLIN","text":"Visit us whenever you wish, kupo! Consider Moghome your home amongst the clouds!"},{"name":"MOGHAN","text":"Thanks for the help, kupo! I doubt I would <span class=\"emphasis\">ever</span> have found time for all those rotten chores!"},{"name":"MOGHAN","text":"...H-Hey, it wasn't <span class=\"emphasis\">my</span> idea! If the chieftain had spent a little less time sitting about and a little more time chieftaining, things would never have gotten so messy in the first place! (And <span class=\"emphasis\">he</span> was the one who sat on the horn, by the way.)"},{"name":"MOGHAN","text":"But now all the errands are done and the horn is fixed, so...all's well that ends well, eh, kupo?"}],"reward":{"gil":485,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"questsType":"all","quests":[67156,67157]},"next":[67160,67357,67360]},"partials":[{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"npc","id":"1012078","obj":{"i":1012078,"n":"Moghan","l":2002,"q":6}},{"type":"npc","id":"1012664","obj":{"i":1012664,"n":"Alphinaud","l":2002,"q":4}},{"type":"npc","id":"1012680","obj":{"i":1012680,"n":"Estinien","l":2002,"q":3}},{"type":"npc","id":"1012681","obj":{"i":1012681,"n":"Kuplo Kopp","l":2002,"q":2}},{"type":"npc","id":"1013586","obj":{"i":1013586,"n":"Alphinaud","l":2002,"q":1}},{"type":"npc","id":"1013587","obj":{"i":1013587,"n":"Estinien","l":2002,"q":1}},{"type":"npc","id":"1013588","obj":{"i":1013588,"n":"Ysayle","l":2002,"q":1}},{"type":"npc","id":"1013589","obj":{"i":1013589,"n":"Kan-E-Senna","l":2002,"q":2}},{"type":"npc","id":"1013590","obj":{"i":1013590,"n":"Kuplo Kopp","l":2002,"q":1}},{"type":"npc","id":"1013591","obj":{"i":1013591,"n":"Keeper Of The Entwined Serpents","l":2002,"q":2}},{"type":"npc","id":"1013592","obj":{"i":1013592,"n":"Keeper Of The Entwined Serpents","l":2002,"q":2}},{"type":"npc","id":"1013593","obj":{"i":1013593,"n":"Ysayle","l":2002,"q":2}},{"type":"quest","id":"67156","obj":{"i":67156,"n":"Moghan's Trial","g":3,"l":"The Churning Mists","s":41}},{"type":"quest","id":"67157","obj":{"i":67157,"n":"Mogmug's Trial","g":3,"l":"The Churning Mists","s":42}},{"type":"quest","id":"67160","obj":{"i":67160,"n":"Leaving Moghome","g":3,"l":"The Churning Mists","s":45}},{"type":"quest","id":"67357","obj":{"i":67357,"n":"A Pebble for Your Thoughts","g":100,"l":"The Churning Mists","s":5414}},{"type":"quest","id":"67360","obj":{"i":67360,"n":"Spineless Wadjets","g":100,"l":"The Churning Mists","s":5415}}]}