{"quest":{"name":"Mogwin's Trial","location":"The Churning Mists","id":67158,"patch":3.0,"sort":43,"eventIcon":71201,"issuer":1012083,"target":1012083,"involved":[1012079,1012081,1015174],"genre":3,"journal":["Mogwin would test your trustworthiness with a trial.","You speak with Mogwin, one of the three trial-givers named by Moglin, and the self-proclaimed artist bids you track down his missing masterpiece. Question the moogles of Moghome, and discern the whereabouts of the painted pebble.","You have spoken with the Moghome moogles, and received a variety of answers─some more helpful than others. It would seem that the forgetful artist has likely left his masterpiece out on Sohm Al's summit, and that the stone is in danger of being claimed by an enthusiastic devotee of his work. Return to Mogwin, and share the information you have learned.","Upon listening to the answers you received from his fellow moogles, Mogwin suddenly recalls that he deliberately left his painted pebble out in the sun to dry. Setting you upon the second half of your trial, the forgetful artist bids you rush outside and retrieve it before some art-starved admirer pockets the pebble for his own. Head out to the Sohm Al summit, and search for Mogwin's masterpiece.","You search Sohm Al's summit and find Mogwin's painted pebble. Return to Moghome, and deliver the work of art to its forgetful creator.","After handing the retrieved pebble to Mogwin, the moogle artist shares with you the name of the masterpiece: <span class=\"emphasis\">Contemplations of Zenith</span>. Gleeful at the thought of the kupo nuts he will receive in exchange for his work, the trial-giver promises to sing your praises to Chieftain Moglin."],"objectives":["Question Moghome inhabitants.","Speak with Mogwin.","Obtain the moogle masterpiece.","Deliver the moogle masterpiece to Mogwin."],"dialogue":[{"name":"MOGWIN","text":"Mogwin's the name, and art is my game. When it comes to painting, there are none in Moghome who can match my talent with a brush, kupo!"},{"name":"MOGWIN","text":"I know why you have come─Chieftain Moglin has demanded that I test your trustworthiness. But as I trust no one to create art that will satisfy me, I instead charge you with retrieving a masterpiece I seem to have misplaced..."},{"name":"MOGWIN","text":"It was an ambitious and innovative work─guaranteed to fetch at least four kupo nuts on the open market. You must find it! Question the masses!"},{"name":"MOGWIN","text":"Surely a pebble painted with such vibrant color and unmistakable panache cannot have escaped the notice of every moogle in Moghome..."},{"name":"MOGWIN","text":"You must find my painted pebble, kupo! Art of this quality cannot be bought...for any less than four kupo nuts!"},{"name":"MOGWIN","text":"Please, speak with my fellow moogles and track down my missing masterpiece!"},{"name":"MOGC01622","text":"Has Maestro Mogwin finished his latest piece? I can hardly wait to see it, kupo!"},{"name":"MOGOMO","text":"Mogwin is missing his masterpiece, kupo? Oh, you mean that paint-smeared mess of a pebble? I've not seen it recently─a fact for which my eyes are profoundly grateful."},{"name":"MOGOMO","text":"Mogwin is missing his masterpiece, kupo? Oh, you mean that paint-smeared mess of a pebble? I've not seen it recently─a fact for which my eyes are profoundly grateful."},{"name":"MOGTOE","text":"Hmmm. I don't know much about his stone, but I do know Mogwin's been creeping out the back way to Sohm Al's summit from time to time, kupo. Maybe he left it up there..."},{"name":"MOGTOE","text":"Hmmm. I don't know much about his stone, but I do know Mogwin's been creeping out the back way to Sohm Al's summit from time to time, kupo. Maybe he left it up there..."},{"name":"MOGC01622","text":"Maestro Mogwin has misplaced his masterpiece, kupo!? Oh, happy day!"},{"name":"MOGC01622","text":"If I am the swifter in finding it, I will soon have a genuine Mogwin for the price of a little perspiration! Honestly, who has four kupo nuts just lying about to spend on such luxuries..."},{"name":"MOGWIN","text":"Well, what did you find out, kupo?"},{"name":"MOGWIN","text":"Ah. Ah, yes. Now that you mention it, I do seem to recall leaving my pebble out in the sun to dry..."},{"name":"MOGWIN","text":"Ahem! The second part of your trial commences! Go, adventurer, and retrieve my masterpiece before some art-starved admirer swipes the stone for himself!"},{"name":"MOGWIN","text":"My pebble is somewhere out in the open on Sohm Al's summit. Retrieve it for me, and I shall put in a good word for you with the chieftain, kupo!"},{"name":"MOGWIN","text":"Do you have it, kupo? Is my masterpiece safe?"},{"name":"MOGWIN","text":"Yes, this is my work! Is it not exquisite? I call it <span class=\"emphasis\">Contemplations of Zenith</span>."},{"name":"MOGWIN","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! At last, I can exchange my art for those delectable kupo nuts! Chieftain Moglin will hear of this valorous deed!"},{"name":"SYSTEM","text":"You have completed the Trials of Trustworthiness. Return to Chieftain Moglin and await his judgment."}],"reward":{"gil":485,"items":[{"id":10636,"one":1,"hq":1},{"id":10654,"one":1,"hq":1},{"id":10660,"one":1,"hq":1},{"id":20393,"one":1,"hq":1},{"id":5672,"one":1}],"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67155]},"next":[67358]},"partials":[{"type":"npc","id":"1012083","obj":{"i":1012083,"n":"Mogwin","l":2002,"q":1}},{"type":"npc","id":"1012079","obj":{"i":1012079,"n":"Mogtoe","l":2002,"q":2}},{"type":"npc","id":"1012081","obj":{"i":1012081,"n":"Mogomo","l":2002,"q":4}},{"type":"npc","id":"1015174","obj":{"i":1015174,"n":"Muddled Moogle","l":2002,"q":2}},{"type":"item","id":"10636","obj":{"i":10636,"n":"Dark Chestnut Rod","l":133,"c":32682,"t":9,"p":27383}},{"type":"item","id":"10654","obj":{"i":10654,"n":"Dhalmelskin Codex","l":133,"c":33501,"t":98,"p":28225}},{"type":"item","id":"10660","obj":{"i":10660,"n":"Hardsilver Star Globe","l":133,"c":34814,"t":89,"p":26751}},{"type":"item","id":"20393","obj":{"i":20393,"n":"Hardsilver Rapier","l":133,"c":36748,"t":97,"p":18957}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"67155","obj":{"i":67155,"n":"Mountaintop Diplomacy","g":3,"l":"The Churning Mists","s":40}},{"type":"quest","id":"67358","obj":{"i":67358,"n":"A Dream Blooms","g":100,"l":"The Churning Mists","s":5403}}]}