{"quest":{"name":"Beyond the Clouds","location":"The Churning Mists","id":67154,"patch":3.0,"sort":39,"eventIcon":71201,"issuer":1012661,"target":1012664,"involved":[1012662,1012663,1012665,1012666,1013195],"genre":3,"journal":["Alphinaud ponders the means by which you might find Hraesvelgr.","As Alphinaud muses on how the party can best locate Hraesvelgr, Ysayle exclaims in surprise at the sight of a moogle. The creature is startled into flight, and the party sets off in pursuit, determined to question the moogle on the whereabouts of the great wyrm. Speak with Alphinaud, and learn if he has spotted your hopefully informative quarry.","You have lost sight of the moogle. Survey the area, and attempt to catch a glimpse of the frightened creature.","You scan the area, but can find no sign of the elusive moogle. Return to Alphinaud, and report your failure.","You inform Alphinaud of your failure to find the moogle, and Alphinaud begins to wonder if the creature ever existed in the first place. Could your quarry be concealing himself with magic...?"],"objectives":["Speak with Alphinaud.","Search for the moogle at the designated locations.","Report to Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Now that we have scaled the mountain, there remains the problem of finding Hraesvelgr himself..."},{"name":"ICEHEART","text":"What manner of creature is that...?"},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>. Do my eyes deceive me, or was that a moogle?"},{"name":"ALPHINAUD","text":"It was my understanding that they only dwelled within the Twelveswood. I certainly never expected to see one in the Churning Mists..."},{"name":"ALPHINAUD","text":"If the moogle <span class=\"emphasis\">does</span> live here, however, he may know where Hraesvelgr makes his lair. Quickly, now, before we lose the creature completely!"},{"name":"ESTINIEN","text":"This place is far from the barren mountaintop I pictured in my mind..."},{"name":"ICEHEART","text":"Well, dragoon? Do you believe <span class=\"emphasis\">these</span> ruins were also built by heretics to deceive the faithful of Ishgard?"},{"name":"ICEHEART","text":"How can one not be moved by such a breathtaking sight..."},{"name":"ALPHINAUD","text":"Bah, he's gone! <span class=\"highlight\">Forename</span>, we must widen our search."},{"name":"ESTINIEN","text":"A “moogle,” did you say? I am unfamiliar with the breed, but I shall search for one nonetheless..."},{"name":"ICEHEART","text":"Where could he have gone!?"},{"name":"ALPHINAUD","text":"We <span class=\"emphasis\">did</span> see a moogle, did we not...?"},{"name":"ESTINIEN","text":"I see no evidence of this moogle of yours. Are you certain it wasn't a trick of the light? Mayhaps 'twas simply one of these strange plants, shifting in a breeze..."},{"name":"ICEHEART","text":"I have heard tales of these moogles, but 'tis the first time I've ever laid eyes on one. They are rather adorable, aren't they?"},{"name":"ICEHEART","text":"What─ Why do you stare at me so? Can I not find a creature adorable? My heart is not truly made of ice..."},{"name":"SYSTEM","text":"There is no sign of a moogle in the area..."},{"name":"ALPHINAUD","text":"I'm sure I glimpsed the moogle fleeing in this direction. Could he be concealing himself with magic...?"}],"reward":{"gil":449,"xp":57600},"reqs":{"jobs":[{"lvl":53,"id":142}],"quests":[67153]},"next":[67155]},"partials":[{"type":"npc","id":"1012661","obj":{"i":1012661,"n":"Alphinaud","l":2002,"q":2}},{"type":"npc","id":"1012664","obj":{"i":1012664,"n":"Alphinaud","l":2002,"q":4}},{"type":"npc","id":"1012662","obj":{"i":1012662,"n":"Estinien","l":2002,"q":2}},{"type":"npc","id":"1012663","obj":{"i":1012663,"n":"Ysayle","l":2002,"q":2}},{"type":"npc","id":"1012665","obj":{"i":1012665,"n":"Estinien","l":2002,"q":1}},{"type":"npc","id":"1012666","obj":{"i":1012666,"n":"Ysayle","l":2002,"q":1}},{"type":"npc","id":"1013195","obj":{"i":1013195,"n":"Alphinaud","l":2002,"q":1}},{"type":"quest","id":"67153","obj":{"i":67153,"n":"Mourn in Passing","g":3,"l":"The Dravanian Forelands","s":38}},{"type":"quest","id":"67155","obj":{"i":67155,"n":"Mountaintop Diplomacy","g":3,"l":"The Churning Mists","s":40}}]}