{"quest":{"name":"Mountaintop Diplomacy","location":"The Churning Mists","id":67155,"patch":3.0,"sort":40,"icon":100410,"eventIcon":71201,"issuer":1012664,"target":1012077,"involved":[1000460,1012667,1012668,1012675,1012846,1015174],"genre":3,"journal":["Alphinaud seems convinced that the moogles hold the key to finding Hraesvelgr.","Unwilling to abandon his efforts to contact the moogles of the Churning Mists, Alphinaud resolves to seek the assistance of the furry creatures' Twelveswood kin. Travel to Gridania, and rendezvous with him at Nophica's Altar.","Upon arriving in Old Gridania, Alphinaud informs you that he has requested an audience with the Elder Seedseer. Provided you can secure Kan–E–Senna's assistance, you should have little difficulty contacting the moogles of the Twelveswood. Speak with the silent conjurer to gain access to the Lotus Stand.","After exchanging heartfelt greetings with the Elder Seedseer, Alphinaud explains the urgent nature of your visit. By good fortune, Kuplo Kopp overhears your conundrum, and pledges to accompany you back to the Churning Mists. To the surprise of all present, Kan–E–Senna then offers to do the same. Speak with Alphinaud at Nophica's Altar, and discuss arrangements for the return journey.","While Alphinaud escorts the Elder Seedseer and her entourage on the long road through Dravania, he asks that you return to Sohm Al's summit and inform your companions that help is on the way. Seek out Estinien in the deserted moogle settlement.","Thanks to the diplomacy of Kan–E–Senna─and the sight of Kuplo Kopp's familiar form─the moogles of the Churning Mists are persuaded to reveal themselves. Despite Kuplo Kopp's reassurances, however, the moogles' chieftain is not convinced that you will act in his people's best interests. Speak with Moglin, and begin the process of earning his trust.","It seems that Moglin has devised a number of trials by which he shall judge you worthy of his assistance. By the command of their chieftain, the moogles Moghan, Mogmug, and Mogwin stand ready to administer these mysterious tests..."],"objectives":["Speak with Alphinaud at Nophica's Altar.","Enter the Lotus Stand.","Speak with Alphinaud.","Speak with Estinien at Moghome.","Speak with Moglin."],"dialogue":[{"name":"ALPHINAUD","text":"Confound it. Could we but enlist the aid of one of the local moogles, I am certain Hraesvelgr would not elude us for long..."},{"name":"ESTINIEN","text":"Though the Eye enables me to sense the presence of dragons, I can only identify Nidhogg's with any certainty. We could wander the Mists for days, and not know if we were any closer to his brood-brother..."},{"name":"ALPHINAUD","text":"And those are days we cannot well afford to squander. Shall we divide our forces, then?"},{"name":"ALPHINAUD","text":"Lady Ysayle─might I ask you to question any dragons whom you judge it safe to approach?"},{"name":"ICEHEART","text":"I shall try. Yet I fear the influence of Nidhogg's rage will render most of the Dravanians in the area deaf to reason. And what of you, Master Alphinaud?"},{"name":"ALPHINAUD","text":"I have not yet given up on the moogles."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>─come with me to Gridania. I mean to petition the aid of the moogles' kin in the Twelveswood. After that business with Moggle Mog, I daresay they will be glad to help us."},{"name":"ESTINIEN","text":"Assuming you have no need of me, I shall remain here."},{"name":"ESTINIEN","text":"Nidhogg senses both the loss of his consort and the coming of the Eye, and his attention is firmly fixed in this direction. I mean to do what I can to hold his gaze, in the hope that it might delay any action against Ishgard."},{"name":"ALPHINAUD","text":"Thank you, Estinien."},{"name":"ALPHINAUD","text":"Come then, <span class=\"highlight\">Forename</span>, let us make haste for Gridania, and rendezvous at Nophica's Altar. Ah, but I neglected to tell you..."},{"name":"ALPHINAUD","text":"There is an aetheryte of ancient construction here which should make the return journey rather less arduous. Pray do not forget to use it!"},{"name":"ESTINIEN","text":"I sincerely hope you have taken Master Alphinaud's advice concerning the aetheryte. You would not wish to miss the sport if Nidhogg deigned to visit us in your absence."},{"name":"ALPHINAUD","text":"I sent word to the Elder Seedseer upon arriving in Gridania, and I am pleased to report that she has agreed to grant us an audience. If anyone can help us to contact the Twelveswood moogles, it is she."},{"name":"ALPHINAUD","text":"We are expected at the Lotus Stand. I trust you are familiar with the conjurer stationed at its entrance?"},{"name":"ALPHINAUD","text":"The Elder Seedseer will receive us at the Lotus Stand. I trust you are familiar with the conjurer stationed at its entrance?"},{"name":"DOORMANLOTUS","text":"The Elder Seedseer awaits you. Pray follow me."},{"name":"Q1","text":"Proceed to the Lotus Stand?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"KANESENNA","text":"I bid you welcome, friends. The Admiral spoke of having met with you, but 'tis no less of a relief to see you safe and hale with mine own eyes."},{"name":"ALPHINAUD","text":"We humbly thank you for agreeing to receive us upon such short notice, my lady─and for all you have done for us in our absence. Would that it were solely to express our gratitude that we came to you this day..."},{"name":"ALPHINAUD","text":"Alas, the tides of battle yet dictate our comings and goings. Elder Seedseer─we would beg your wisdom in a matter that may finally bring an end to the Dragonsong War."},{"name":"KANESENNA","text":"Speak on, friend."},{"name":"KANESENNA","text":"...I see. So you seek a means to contact these moogles of the Churning Mists..."},{"name":"KUPLOKOPP","text":"(-???-)Kupopopo! I say, kupo!"},{"name":"KANESENNA","text":"Greetings, Kuplo Kopp. To what do we owe the pleasure of your company?"},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)I was struck by the sudden urge to bring you some fruit, Kan–E─and I'm jolly glad I did! Tell me more about these moogles in the sky, kupo!"},{"name":"ALPHINAUD","text":"I will gladly tell you all I know─though it amounts to precious little. We encountered a moogle high in the clouds of Dravania, and had hoped that you and your kin in the Twelveswood might agree to facilitate a meeting."},{"name":"KANESENNA","text":"Pray correct me if I am mistaken, Kuplo, but there are legends, are there not, which speak of moogles who dwelled beyond the clouds?"},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)Indeed there are, kupo! Long, long ago, back when the world was still young, they say my ancestors served the gods up in the heavens. Of course, that was before their masters took to bickering like spoiled children..."},{"name":"KANESENNA","text":"Ah, yes, the tale of Good King Moggle Mog XII. He is revered for holding fast to a rope of miraculous length, that his subjects might climb down from the sky and escape to the world below."},{"name":"ALPHINAUD","text":"Hmm... Ignoring the more fanciful aspects of the tale, it may well be that Kuplo's ancestors hailed from the Churning Mists. Given how long his kin have resided in the Twelveswood, it is perfectly possible that the details of their history have faded into myth..."},{"name":"KANESENNA","text":"Indeed, Master Alphinaud. Such stories oft contain a measure of truth. 'Tis like that the moogles of the Churning Mists tell similar tales of the world below... I can well imagine why the one you encountered fled at your approach."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)Oh, fleeing's second nature to us! We often hide when the larger races come tramping through the forest. Of course, where there's one moogle, there's bound to be more..."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)...Which is why I've decided to take a trip to the clouds, kupo! They surely won't be afraid to talk to me!"},{"name":"ALPHINAUD","text":"I was hoping you might say that, Master Kuplo. You will accompany us, then?"},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)Just you try and stop me, kupo! I'll admit, the thought of venturing outside the Twelveswood is a bit unsettling, but I can hardly refuse a chance to meet my distant, <span class=\"emphasis\">distant</span> cousins!"},{"name":"KANESENNA","text":"If you will have me, I too will accompany you on this venture, and lend my voice to your cause as an ambassador of Gridania."},{"name":"ALPHINAUD","text":"M-My lady, I─ Are you quite certain?"},{"name":"KANESENNA","text":"How oft has our nation turned to the Scions of the Seventh Dawn in its hour of need? How oft have we asked the Warrior of Light to risk <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> life to save our own?"},{"name":"KANESENNA","text":"Full many times, I say to you─and never have they refused us. Thus do I choose this day to offer mine aid to our allies for the good of the realm."},{"name":"KANESENNA","text":"...Is this not just?"},{"name":"ALPHINAUD","text":"A most unexpected─and most welcome─offer, Elder Seedseer. We would be honored by your presence."},{"name":"DOORMANLOTUS","text":"Is it true that the Elder Seedseer means to journey with you to Dravania? I shudder to think of the dangers..."},{"name":"ALPHINAUD","text":"Pray return to the summit and inform our companions of these developments─I will serve as the Elder Seedseer's guide on the journey back to Sohm Al."},{"name":"ALPHINAUD","text":"It being a path I have already trodden, I do not anticipate any great difficulties. Besides, we shall have the Elder Seedseer's personal guard to escort us."},{"name":"ALPHINAUD","text":"Pray return to the summit and inform our companions of these developments─I will serve as the Elder Seedseer's guide on the journey back to Sohm Al."},{"name":"ALPHINAUD","text":"It being a path I have already trodden, I do not anticipate any great difficulties. Besides, we shall have the Elder Seedseer's personal guard to escort us."},{"name":"ICEHEART","text":"Ah, <span class=\"highlight\">Forename</span>, you are returned. How fared you in Gridania? Better than I, I hope... Hraesvelgr's whereabouts yet elude me."},{"name":"ESTINIEN","text":"Well met, Warrior of Light. Nidhogg has not stirred, but he watches us, unblinking..."},{"name":"ESTINIEN","text":"...Hm? The Elder Seedseer herself answers your call? Then there is naught to do but wait."},{"name":"ESTINIEN","text":"They are here, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"Greetings, my friends. I am happy to report that our journey was mercifully uneventful, devoid as the road was of Dravanians. 'Twould seem the dragons have abandoned Sohm Al for the Churning Mists."},{"name":"ALPHINAUD","text":"Elder Seedseer, may I present to you Ser Estinien, Ishgard's Azure Dragoon."},{"name":"KANESENNA","text":"'Tis an honor to meet you, Ser Estinien. I have heard many tales of your order's extraordinary skill and courage."},{"name":"KANESENNA","text":"Friends─I feel it only right to inform you that we are not alone. The moogles are all around us even as we speak. And I should imagine they are more than a little concerned by the horde of strangers that have descended upon their home. Mayhap now would be an opportune moment to introduce ourselves."},{"name":"KANESENNA","text":"This should serve..."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)They're hiding, of course─but there are so many of them, kupo!"},{"name":"KANESENNA","text":"I am Kan–E–Senna. My companions and I have braved the long road from the Twelveswood to share words with you."},{"name":"KANESENNA","text":"On this, the occasion of our first meeting, we bring an offering of light and wind."},{"name":"MOGLIN","text":"(-???-)Oooh, such a gentle and pleasing glow, kupo..."},{"name":"MOGLIN","text":"I am Moglin, the chieftain of this moogle clan."},{"name":"KANESENNA","text":"Chieftain Moglin─it is an honor to meet you."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)Greetings! I am Kuplo Kopp, ambassador of the Twelveswood moogles!"},{"name":"MOGLIN","text":"...A moogle from the world below? Your hide is of a different hue, but that pom is unmistakable! I might need a moment here, kupo..."},{"name":"KANESENNA","text":"My companions were no less surprised to learn of your existence here amongst the clouds. I hope they did not startle you overmuch in their eagerness to make your acquaintance. Full well can I imagine your wariness. I am told that men have not walked here in nigh on a thousand winters."},{"name":"KANESENNA","text":"Mayhap you will forgive them their forwardness when I unfold to you the grave matter which first brought them into your midst. My companions crave an audience with the great wyrm Hraesvelgr that they might negotiate an end to the war 'twixt man and dragon."},{"name":"MOGLIN","text":"An end to war, you say? Hmm... I trust you, Kan–E–Senna─the light of peace shines brightly within your soul."},{"name":"MOGLIN","text":"...But I'm afraid the same cannot be said of your friends. To be plain, we did not hide ourselves because they were the first of your kind to be seen here in a thousand years─well, not <span class=\"emphasis\">only</span> because of that. We hid because we smelled dragon blood."},{"name":"MOGLIN","text":"These skies are home to many, many dragons."},{"name":"MOGLIN","text":"While some crave peace, such as Hraesvelgr, many others crave the opposite...such as Nidhogg. Suffice it to say, we are worried that the presence of your blood-spattered warrior friends will attract the attention of the nastier kind, and invite destruction into our happy home."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)Now just a moment, Chieftain! <span class=\"highlight\">Forename</span> here may have doled out the odd thrashing or two, but it's always been for a really good reason!"},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is a champion of the Twelveswood moogles, and I'll not hear <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> good name slandered!"},{"name":"MOGLIN","text":"Now, now, Ambassador─let's not ruffle each other's fur. I shall of course take your testimony into consideration..."},{"name":"KANESENNA","text":"If I may, Chieftain: there is little room for trust 'twixt strangers. Might we not take this opportunity to learn more of each other?"},{"name":"KANESENNA","text":"An excellent suggestion, kupo. In the interests of fostering friendship─and keeping an eye on you─I extend to you the hospitality of Moghome."},{"name":"KANESENNA","text":"Prove yourselves worthy of our assistance, and it will be yours. I shall be watching, kupo!"},{"name":"ICEHEART","text":"Forgive me, <span class=\"highlight\">Forename</span>, but mine efforts have all been in vain. As I feared, Nidhogg's rage drives his minions to attack me on sight."},{"name":"ICEHEART","text":"And the few who did deign to speak fell silent at the name of Hraesvelgr. Wherefore, I cannot say, yet I fear it bodes ill."},{"name":"MOGLIN","text":"Tell me─in the world down below, do <span class=\"emphasis\">all</span> of your kind look so different from one another? It must be terribly disconcerting..."},{"name":"MOGLIN","text":"What was it Kuplo Kopp called you again?"},{"name":"MOGLIN","text":"\"<span class=\"highlight\">Forename</span>“? Hmph! Your names are as odd as your appearance. Have you ever considered a nice moogle name? ”Moglin“ is taken, by the way, kupo!"},{"name":"MOGLIN","text":"As are “Moghan,” “Mogmug,” and “Mogwin”─these being the names of the three wise moogles who will administer the momentous challenges that I have devised to measure your worth. I call them...the Trials of Trustworthiness."},{"name":"MOGLIN","text":"Undertake these trials, and we shall soon see whether or not you are worthy of our aid!"},{"name":"MOGC01622","text":"Has Maestro Mogwin finished his latest piece? I can hardly wait to see it, kupo!"}],"reward":{"gil":1923,"items":[{"id":10588,"one":1,"hq":1},{"id":10600,"one":1,"hq":1},{"id":10624,"one":1,"hq":1},{"id":20392,"one":1,"hq":1},{"id":5632,"one":1}],"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67154]},"next":[67156,67157,67158]},"partials":[{"type":"npc","id":"1012664","obj":{"i":1012664,"n":"Alphinaud","l":2002,"q":4}},{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1012667","obj":{"i":1012667,"n":"Estinien","l":2002,"q":1}},{"type":"npc","id":"1012668","obj":{"i":1012668,"n":"Ysayle","l":2002,"q":1}},{"type":"npc","id":"1012675","obj":{"i":1012675,"n":"Ysayle","l":2002,"q":1}},{"type":"npc","id":"1012846","obj":{"i":1012846,"n":"Alphinaud","l":53,"q":1}},{"type":"npc","id":"1015174","obj":{"i":1015174,"n":"Muddled Moogle","l":2002,"q":2}},{"type":"item","id":"10588","obj":{"i":10588,"n":"Titanium Bastard Sword","l":133,"c":30518,"t":2,"p":17693}},{"type":"item","id":"10600","obj":{"i":10600,"n":"Titanium Axe","l":133,"c":31503,"t":3,"p":32859}},{"type":"item","id":"10624","obj":{"i":10624,"n":"Titanium Claymore","l":133,"c":34211,"t":87,"p":29752}},{"type":"item","id":"20392","obj":{"i":20392,"n":"Titanium Uchigatana","l":133,"c":36428,"t":96,"p":18957}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"67154","obj":{"i":67154,"n":"Beyond the Clouds","g":3,"l":"The Churning Mists","s":39}},{"type":"quest","id":"67156","obj":{"i":67156,"n":"Moghan's Trial","g":3,"l":"The Churning Mists","s":41}},{"type":"quest","id":"67157","obj":{"i":67157,"n":"Mogmug's Trial","g":3,"l":"The Churning Mists","s":42}},{"type":"quest","id":"67158","obj":{"i":67158,"n":"Mogwin's Trial","g":3,"l":"The Churning Mists","s":43}}]}