{"quest":{"name":"A Gnathic Deity","location":"The Dravanian Forelands","id":67150,"patch":3.0,"sort":35,"eventIcon":71201,"issuer":1012636,"target":1013582,"involved":[1011928,1011929,1011930,1011931,1012632,1012637,1012672,1013583,1014195,1014196,1014197],"genre":3,"journal":["Ysayle seems troubled by the Gnath's war of expansion.","Ysayle questions the Gnath's justification for committing the crime of summoning, drawing a distinction between their expansionist aims and her own hopes for peace. Alphinaud concludes that if the beastmen are truly only motivated by territorial gain, they must be unaware of the terrible price that their god's presence exacts from the land. Plainly, the creature must die. Citing the protection afforded her by the Echo, Ysayle volunteers to confront the primal, but Estinien is quick to point out that she lacks the means to call it forth. Speak with the inhabitants of Loth ast Vath, and learn more about the Gnath and their god.","You have gleaned what knowledge you can from the hive's residents, but it seems there is one more inhabitant who is eager to share. Speak with the voracious Vath, and hear what he has to say.","You approach the voracious Vath, and he hints that more information will be forthcoming should he receive a gift from the “generous hunters.” Seek out the clearwater nankas, and obtain a hunk of their flesh.","You have obtained a hunk of nanka flesh. Return to Loth ast Vath and deliver the gift to the voracious Vath.","Having hungrily taken receipt of the nanka flesh, the Vath explains how the thoughts and senses of every Gnath in the main colony are linked by the presence of the Overmind. Discuss the implications of this revelation with Alphinaud.","You share your findings with the rest of the party, and Alphinaud summarizes what you have learned of Gnath society. Though Estinien is unimpressed with the Vath's meager knowledge of their own god, Ysayle believes that the elder's offhand suggestion─that you surrender yourselves as sacrifices─may hold some merit..."],"objectives":["Gather information from the Vath.","Speak with the voracious Vath.","Obtain a hunk of nanka flesh from a clearwater nanka.","Deliver the nanka flesh to the voracious Vath.","Speak with Alphinaud."],"dialogue":[{"name":"ICEHEART","text":"I call upon the power of a primal for the greater good...conscious all the while that I do so at grave cost to the land. I reason that it is a necessary evil, and willingly shoulder the burden of my sin."},{"name":"ICEHEART","text":"In suggesting that such crimes can be justified, you may argue that I presume too much─but you must surely see that I am aware of the magnitude of my transgressions. Not so the Gnath. They summon their deity for no greater purpose than to expand their dominion."},{"name":"ALPHINAUD","text":"To a Scion of the Seventh Dawn─one sworn to eliminate the primal threat─the distinction you draw seems questionable at best. But the fact remains that my own grandfather risked unleashing the power of the Twelve in an attempt to prevent the Calamity. Thus, while I may not condone your actions, I at least understand them."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Not so the Gnath</span>, as you so rightly put it. If they truly seek naught but territorial gain, I can only conclude that they are ignorant of the ruinous consequences of their god's insatiable appetite. The longer this primal is suffered to exist, the greater the suffering it will cause. It must be destroyed."},{"name":"ESTINIEN","text":"How lightly you propose the destruction of this god, Master Alphinaud─a being of whom we know naught. Has it occurred to you that you may be sending the Warrior of Light to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> death?"},{"name":"ALPHINAUD","text":"No, I─ &lt;sigh&gt; ...You have the right of it, Estinien. 'Twould seem it is I who am guilty of presuming too much."},{"name":"ALPHINAUD","text":"Pray forgive me, <span class=\"highlight\">Forename</span>."},{"name":"Q1","text":"How do you respond?"},{"name":"A1","text":"I do not fear my duty."},{"name":"A1","text":"..."},{"name":"ICEHEART","text":"Wait. <span class=\"highlight\">Forename</span> need not face this foe alone. Like <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, I am blessed with the Echo's protection, and may do battle without fear of primal influence. Let <span class=\"emphasis\">me</span> bear this burden."},{"name":"ESTINIEN","text":"Ha! Do you truly imagine yourself a second Warrior of Light? Remind me: how many primals have you faced, my lady? Not that it matters─we know not where this god resides, or how to challenge it. Unless you mean to pray until it appears?"},{"name":"ALPHINAUD","text":"Hm. Estinien makes a valid point. Let us speak with the Vath, and learn how best to secure an audience with their deity. In this, at least, I may be of assistance."},{"name":"ESTINIEN","text":"The young lord certainly appears eager to prove his worth..."},{"name":"ALPHINAUD","text":"The beast tribes have ever summoned their gods out of necessity. That the Gnath should do so out of mere covetousness sets a worrying precedent..."},{"name":"ESTINIEN","text":"Even a wounded dragon is a dangerous opponent─these antmen did well to overpower one."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; You wish to meet our god? Offer yourself as a sacrifice, and you will soon be brought before Him. We would mourn the loss of such generous hunters, however..."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; You wish to meet our god? Offer yourself as a sacrifice, and you will soon be brought before Him. We would mourn the loss of such generous hunters, however..."},{"name":"GNATHELDER01614","text":"（★未使用／削除予定★）"},{"name":"GNATHELDER01614","text":"（★未使用／削除予定★）"},{"name":"CIBLEROIT","text":"We are Vath. We are the Nonmind. We do not hear the Onemind's thoughts. We cannot predict their will."},{"name":"CIBLEROIT","text":"We are Vath. We are the Nonmind. We do not hear the Onemind's thoughts; we cannot predict their will."},{"name":"GNATHMOBA01614","text":"（★未使用／削除予定★）"},{"name":"GNATHMOBA01614","text":"（★未使用／削除予定★）"},{"name":"IDATEN","text":"&lt;click&gt; &lt;click&gt; Put this idea from your minds, generous hunters. If you meet with our god, then He will have your souls. Surely you are not so generous as that?"},{"name":"IDATEN","text":"&lt;click&gt; &lt;click&gt; Put this thought from your minds, generous hunters. If you meet with our god, then He will have your souls. Surely you are not so generous as that?"},{"name":"ALPHINAUD","text":"There must be some way of infiltrating the main colony..."},{"name":"ICEHEART","text":"The Vath greet mine every question with cryptic utterances. I fear I am no closer to understanding the tenets of their faith..."},{"name":"ESTINIEN","text":"By the Fury... I would swear these beastmen know less about their god than I do."},{"name":"NANKAEATER","text":"You are generous hunters, yes? Many gifts you have brought, but not enough for <span class=\"emphasis\">all</span> Vath to enjoy. Maybe you could bring us just one more?"},{"name":"NANKAEATER","text":"We are very fond of nanka flesh. Yes, the meat of a young nanka would make a fine repast."},{"name":"NANKAEATER","text":"Nanka flesh loosens the mandibles, and makes it easier to talk. Just a bite or two would do..."},{"name":"ALPHINAUD","text":"The Vath tell me that their tribe is not accustomed to giving each individual a name. It seems they only grasped the concept after they began trading with the hunters."},{"name":"ESTINIEN","text":"And what has that to do with their primal or their faith, Master Alphinaud? Let us glean the information we require, and be done with this place..."},{"name":"ICEHEART","text":"For once, I am in agreement with the dragoon. Speaking with these beastmen is an exercise in frustration."},{"name":"NANKAEATER","text":"We Vath do enjoy our nanka flesh. Have you been out hunting yet...?"},{"name":"NANKAEATER","text":"Another gift for the Vath!? So unexpected! Mmm, yes, you will have more of the words you strange hunters hunger for. Listen, now."},{"name":"NANKAEATER","text":"The senses of the Onemind are enmeshed by the Overmind─what one sees, all see; what one feels, all feel."},{"name":"NANKAEATER","text":"Alert a single Gnath, and the whole hive is alerted. To reach our god undetected is all but impossible!"},{"name":"NANKAEATER","text":"The senses of the Onemind are enmeshed by the Overmind─what one sees, all see; what one feels, all feel."},{"name":"NANKAEATER","text":"Alert a single Gnath, and the whole hive is alerted. To reach our god undetected is all but impossible!"},{"name":"ESTINIEN","text":"I do not envy the antmen their bond. Were every man's mind made known to his neighbor, Ishgard would not last a bell."},{"name":"ICEHEART","text":"How strange must spoken language seem to those who once shared minds... 'Tis little wonder the Vath are by turns so obscure and transparent in their meaning."},{"name":"ALPHINAUD","text":"The Vath are wont to allude to certain concepts without explanation, but I believe I am beginning to grasp a few of the fundamentals."},{"name":"ALPHINAUD","text":"From what I understand, the king-like “Overmind” sits at the center of Gnath society, and its presence somehow allows its subjects to communicate without need of word or gesture."},{"name":"ALPHINAUD","text":"These Gnath─the ones who inhabit the larger hive─are known as the “Onemind,” and it was by their combined will that the primal was summoned."},{"name":"ALPHINAUD","text":"Those who reside in this smaller hive, however, are the Vath─or the “Nonmind”─who, for reasons that yet escape me, seem to have been excluded from the telepathic bond which connects their Gnath counterparts. Thus are the Vath ignorant of the Onemind's thoughts and intentions."},{"name":"ESTINIEN","text":"...And of the nature of their own god. In summary, we have wasted our time."},{"name":"ICEHEART","text":"Not so. Perilous though it may be, the Vath <span class=\"emphasis\">did</span> furnish us with one certain method of approaching the primal: as sacrifices. Should we allow ourselves to be captured in the environs of the colony, the Gnath will bring us before their deity to make an offering of our souls..."}],"reward":{"gil":479,"xp":57600},"reqs":{"jobs":[{"lvl":53,"id":142}],"quests":[67149]},"next":[67151,67329,67330,67331,67332,67333,67334,67335,67336,67337,67338,67339,67348,67350,67351]},"partials":[{"type":"npc","id":"1012636","obj":{"i":1012636,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1013582","obj":{"i":1013582,"n":"Alphinaud","l":2000,"q":2}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"npc","id":"1011929","obj":{"i":1011929,"n":"Vath Fleetfoot","l":2000,"q":9}},{"type":"npc","id":"1011930","obj":{"i":1011930,"n":"Cibleroit","l":2000,"q":3}},{"type":"npc","id":"1011931","obj":{"i":1011931,"n":"Voracious Vath","l":2000,"q":3}},{"type":"npc","id":"1012632","obj":{"i":1012632,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1012637","obj":{"i":1012637,"n":"Estinien","l":2000,"q":1}},{"type":"npc","id":"1012672","obj":{"i":1012672,"n":"Ysayle","l":2000,"q":2}},{"type":"npc","id":"1013583","obj":{"i":1013583,"n":"Estinien","l":2000,"q":2}},{"type":"npc","id":"1014195","obj":{"i":1014195,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1014196","obj":{"i":1014196,"n":"Estinien","l":2000,"q":1}},{"type":"npc","id":"1014197","obj":{"i":1014197,"n":"Ysayle","l":2000,"q":1}},{"type":"quest","id":"67149","obj":{"i":67149,"n":"The Nonmind","g":3,"l":"The Dravanian Forelands","s":34}},{"type":"quest","id":"67151","obj":{"i":67151,"n":"Breaking into Hives","g":3,"l":"The Dravanian Forelands","s":36}},{"type":"quest","id":"67329","obj":{"i":67329,"n":"Yellow Stones","g":98,"l":"The Dravanian Forelands","s":5304}},{"type":"quest","id":"67330","obj":{"i":67330,"n":"A Curious Herb","g":98,"l":"The Dravanian Forelands","s":5306}},{"type":"quest","id":"67331","obj":{"i":67331,"n":"Treason and Plot","g":98,"l":"The Dravanian Forelands","s":5303}},{"type":"quest","id":"67332","obj":{"i":67332,"n":"Vindictive Vath Vendetta","g":98,"l":"The Dravanian Forelands","s":5305}},{"type":"quest","id":"67333","obj":{"i":67333,"n":"The Hunter Becomes the Kweh","g":98,"l":"The Dravanian Forelands","s":5301,"f":1}},{"type":"quest","id":"67334","obj":{"i":67334,"n":"Chocobo's Last Stand","g":98,"l":"The Dravanian Forelands","s":5302}},{"type":"quest","id":"67335","obj":{"i":67335,"n":"How to Feed Your Dragon","g":98,"l":"The Dravanian Forelands","s":5312}},{"type":"quest","id":"67336","obj":{"i":67336,"n":"Hungry for Seconds","g":98,"l":"The Dravanian Forelands","s":5313}},{"type":"quest","id":"67337","obj":{"i":67337,"n":"A Taste of the Peculiar","g":98,"l":"The Dravanian Forelands","s":5314}},{"type":"quest","id":"67338","obj":{"i":67338,"n":"A Lesson in Humility","g":98,"l":"The Dravanian Forelands","s":5315,"f":1}},{"type":"quest","id":"67339","obj":{"i":67339,"n":"No Smoking Allowed","g":98,"l":"The Dravanian Forelands","s":5318}},{"type":"quest","id":"67348","obj":{"i":67348,"n":"Back in the Game","g":98,"l":"The Dravanian Forelands","s":5316}},{"type":"quest","id":"67350","obj":{"i":67350,"n":"When Mother Calls","g":98,"l":"The Dravanian Forelands","s":5322}},{"type":"quest","id":"67351","obj":{"i":67351,"n":"A Dragon and His Boy","g":98,"l":"The Dravanian Forelands","s":5323}}]}