{"quest":{"name":"Lord of the Hive","location":"The Dravanian Forelands","id":67152,"patch":3.0,"sort":37,"icon":100408,"eventIcon":71201,"issuer":1012638,"target":1014544,"involved":[1012645,1012646,1012647,1012648,1012649,1012650,1012651,1012656,1014545],"genre":3,"journal":["Ysayle awaits an opportunity to surrender to the Gnath.","You have forced your way deep into the heart of Loth ast Gnath, provoking an ever more frenzied response from its many defenders. Satisfied with the chaos you have sown, Ysayle bids you offer no further resistance to the soldiers swarming about you. Surrender quietly, and allow the Gnath to take you prisoner.","The Gnath have taken you to a cave on the far side of the hive. Could this be where you will meet their mysterious deity? Enter the inner chamber, and see what manner of being awaits you.","You do not have to wait long before Lord Ravana, Master of the Sacred Blades and Wrath of the Colony, arrives to claim his sacrifices. Seizing the opportunity, Ysayle boldly questions the primal about his war with the dragons, before challenging him to a contest of might. Not one to shy away from a fight, Ravana accepts, and terms are duly agreed. If you prevail, the Gnath must cease hostilities with the Dravanians; but should Ravana emerge the victor, you will join his army as eternal thralls. Having goaded the primal into giving his word, Ysayle draws upon the energy of the Gnath's hoarded crystals to transform herself into Saint Shiva, and battle is joined. Even with Shiva's great strength, however, the heretic leader is no match for Ravana's flashing blades. As Ysayle sinks to her knees, defeated, the triumphant god's eyes alight on you. Take to the field and match your prowess against the self-proclaimed Conqueror of the World!<br><br>※Thok ast Thok (Hard) can be accessed via the Duty Finder.","After a long and furious battle, Lord Ravana at last lays down his blades defeated. He duly proclaims you the victor by sacred rite of combat, and vows to call his followers back from the dragons' domain. Return now in triumph to the Dravanian forelands.","You return to the Dravanian forelands having added the name of yet another primal to the list of your defeated foes. Speak with Ysayle by the river outside of Loth ast Gnath.","Ysayle praises you for besting Ravana, while lamenting her own failure to test the primal. Sensing her despondence, you contemplate telling her that things might have been different had she not weakened your foe─only to realize that the moment has passed. Return to Loth ast Vath, and inform Alphinaud of your success.","Back at Loth ast Vath, you regale your companions with the tale of your victory over the Gnath's god. When Estinien subsequently reveals that your fellow Scion spent the hours leading up to your return “fretting like a maid for her sweetheart,” Alphinaud declares that you must press on with the mission─more, you sense, to escape the dragoon's mocking tongue than out of concern for Ishgard. He is, however, correct. Make your way back to Anyx Trine, and share news of your triumph with Vidofnir."],"objectives":["Surrender to the Gnath.","Enter the inner chamber.","Confront Ravana in Thok ast Thok (Hard).","Speak with Ysayle.","Speak with Alphinaud."],"dialogue":[{"name":"ICEHEART","text":"You are prepared, then?"},{"name":"ICEHEART","text":"Hold here, <span class=\"highlight\">Forename</span>. When next the Gnath come, we offer no resistance."},{"name":"GNATHSOLDIER01616","text":"(-Gnath soldiers-)Surrender, intruders! There is no escape!"},{"name":"ICEHEART","text":"Enough! We surrender! We throw ourselves upon the mercy of your god!"},{"name":"ICEHEART","text":"They seem eager to proceed. Good. When they take us before their lord, pray leave matters to me. If what I know of summoning rituals holds true, I shall be well placed to act."},{"name":"ICEHEART","text":"...Hmmm. Mark the sound of the river rushing through the ravine behind us. Passing loud, is it not? I imagine the noise would serve to mask our escape should we need to withdraw temporarily."},{"name":"ICEHEART","text":"But you <span class=\"emphasis\">are</span> prepared, are you not? I do hope so. If I were to be dragged away for sacrifice while you were haggling over the price of potions, I should <span class=\"emphasis\">not</span> be amused."},{"name":"ICEHEART","text":"Though I dismissed Master Alphinaud's concerns, I confess that I did wonder how the Gnath might treat their prisoners. Happily, it would seem they are not wont to harm sacrifices─nor even to <span class=\"emphasis\">disarm</span> them. Plainly, they imagine their god invulnerable. The plan goes better than expected..."},{"name":"GNATHSOLDIER01616","text":"Try to escape and we will break your fleshy legs."},{"name":"GNATHSENTRY01616","text":"Try to escape and we will break your fleshy legs."},{"name":"ICEHEART","text":"The time is come. Let us bring an end to this unpleasant business."},{"name":"Q1","text":"Enter the sacrificial chamber?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"ICEHEART","text":" &lt;pant&gt; &lt;pant&gt; Forgive me... I was...overconfident..."},{"name":"GNATHPRIEST","text":"The Wrath of the Colony is undefeated! Victory to the Gnath!"},{"name":"GNATHSOLDIER01616","text":"The Wrath of the Colony is undefeated! Victory to the Gnath!"},{"name":"GNATHSENTRY01616","text":"The Wrath of the Colony is undefeated! Victory to the Gnath!"},{"name":"ICEHEART","text":"Never since we first fought have I seen you draw upon the full extent of your power...and never from <span class=\"emphasis\">afar</span> till this day. You were a marvel to behold, <span class=\"highlight\">Forename</span>."},{"name":"ICEHEART","text":"Well...'tis time we rejoined our companions. They will be eager to hear the tale...and to continue our journey."},{"name":"ESTINIEN","text":"The antmen's god is fallen, then? Impressive, Warrior of Light."},{"name":"ALPHINAUD","text":"Are you unharmed, <span class=\"highlight\">Forename</span>!? What of Lady Ysayle?"},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>! Lady Ysayle! Thank the Twelve!"},{"name":"ALPHINAUD","text":"...“Lord Ravana,” you say? How curious that the Vath never mentioned his name... And you are quite certain he will keep his word?"},{"name":"ICEHEART","text":"There was honor beneath his savagery."},{"name":"ICEHEART","text":"That we survived the encounter at all was a miracle─a miracle I must attribute to <span class=\"highlight\">Forename</span>."},{"name":"ESTINIEN","text":"Never did I doubt you, Warrior of Light...unlike some. You were gone so long that Master Alphinaud here nigh lost his wits with worry. Fretting like a maid for her sweetheart, he was!"},{"name":"ALPHINAUD","text":"Estinien! Was that truly necessary!?"},{"name":"ESTINIEN","text":"Hahaha... Not truly necessary─but certainly <span class=\"emphasis\">true</span>."},{"name":"ALPHINAUD","text":"Ahem! What matters is that the primal is banished, and our promise fulfilled. We should return to Vidofnir without delay."},{"name":"ALPHINAUD","text":"Lest you forget, this was but a means to secure an audience with the wyrm Hraesvelgr. Nidhogg's minions will not be halted by idle chatter! Come, now─we must make every moment count!"},{"name":"ICEHEART","text":"You are unkind, Estinien. For all his experience and intellect, Alphinaud is still but a boy."},{"name":"ESTINIEN","text":"（★未使用／削除予定★）"},{"name":"ICEHEART","text":"（★未使用／削除予定★）"}],"reward":{"gil":5000,"xp":57600,"instance":20031},"reqs":{"jobs":[{"lvl":53,"id":142}],"quests":[67151]},"next":[67153,67345,67346,67347,67349,67352,67353,67354,67791]},"partials":[{"type":"npc","id":"1012638","obj":{"i":1012638,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1014544","obj":{"i":1014544,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1012645","obj":{"i":1012645,"n":"Ysayle","l":2083,"q":1}},{"type":"npc","id":"1012646","obj":{"i":1012646,"n":"Gnath Drone","l":2083,"q":1}},{"type":"npc","id":"1012647","obj":{"i":1012647,"n":"Gnath Drone","l":2083,"q":1}},{"type":"npc","id":"1012648","obj":{"i":1012648,"n":"Ysayle","l":2083,"q":1}},{"type":"npc","id":"1012649","obj":{"i":1012649,"n":"Gnath Priest","l":2083,"q":1}},{"type":"npc","id":"1012650","obj":{"i":1012650,"n":"Gnath Drone","l":2083,"q":1}},{"type":"npc","id":"1012651","obj":{"i":1012651,"n":"Gnath Drone","l":2083,"q":1}},{"type":"npc","id":"1012656","obj":{"i":1012656,"n":"Ysayle","l":2000,"q":1}},{"type":"npc","id":"1014545","obj":{"i":1014545,"n":"Estinien","l":2000,"q":2}},{"type":"instance","id":"20031","obj":{"i":20031,"n":"Thok ast Thok (Hard)","c":61804,"t":"Trials","min_lvl":53,"max_lvl":54}},{"type":"quest","id":"67151","obj":{"i":67151,"n":"Breaking into Hives","g":3,"l":"The Dravanian Forelands","s":36}},{"type":"quest","id":"67153","obj":{"i":67153,"n":"Mourn in Passing","g":3,"l":"The Dravanian Forelands","s":38}},{"type":"quest","id":"67345","obj":{"i":67345,"n":"Like Gnaths to a Flame","g":98,"l":"The Dravanian Forelands","s":5319}},{"type":"quest","id":"67346","obj":{"i":67346,"n":"Fit to Be Tied","g":98,"l":"The Dravanian Forelands","s":5320}},{"type":"quest","id":"67347","obj":{"i":67347,"n":"Blunders in Dragonsitting","g":98,"l":"The Dravanian Forelands","s":5321}},{"type":"quest","id":"67349","obj":{"i":67349,"n":"Where Dragons Lie","g":98,"l":"The Dravanian Forelands","s":5317}},{"type":"quest","id":"67352","obj":{"i":67352,"n":"Between Friends and Family","g":98,"l":"The Dravanian Forelands","s":5324}},{"type":"quest","id":"67353","obj":{"i":67353,"n":"The Heart of a Dragon","g":98,"l":"The Dravanian Forelands","s":5325}},{"type":"quest","id":"67354","obj":{"i":67354,"n":"Let Bygones Be Bygones","g":98,"l":"The Dravanian Forelands","s":5326}},{"type":"quest","id":"67791","obj":{"i":67791,"n":"The Naming of Vath","g":46,"l":"The Dravanian Forelands","s":1,"f":1}}]}