{"quest":{"name":"Waiting for the Wind to Change","location":"The Churning Mists","id":67162,"patch":3.0,"sort":47,"icon":100411,"eventIcon":71201,"issuer":1013202,"target":1012757,"involved":[1012686,1012687,1012688,1012756,1012758,1012759,1012760],"genre":3,"journal":["Moghan seems fretful about the weather.","To your frustration, Moghan insists that with the winds blowing as they are, Hraesvelgr is unlikely to be found at Zenith. It would seem you have no choice but to make yourself comfortable, and wait for the weather to turn. Join the moogle in the clearing to the southeast of the wyrm's palace, and inquire if there is anything you can do to make the time pass more quickly.","Alphinaud has left to gather wood for a fire, but Estinien seems concerned by the youth's distracted air. Follow after your fellow Scion, and see that he returns safely.","You have slain the creatures lurking in Alphinaud's vicinity. Return to the clearing, and reassure Estinien that all is well.","You and your companions enjoy the warmth of the crackling campfire, speaking of the road you have traveled, and the lessons you have learned. But though shared adversity has brought you closer together, tensions yet simmer between Estinien and Ysayle. You can only hope that tomorrow's negotiations will bring a final resolution to their─and Ishgard's─conflict..."],"objectives":["Speak with Moghan.","Defeat threatening monsters to the west of Alphinaud's location.","Defeat threatening monsters to the east of Alphinaud's location.","Speak with Estinien."],"dialogue":[{"name":"MOGHAN","text":"Hmmm...we may have a small problem, kupo. When the winds are high like this, Hraesvelgr invariably abandons his lofty perch and heads to the lands below to hunt."},{"name":"MOGHAN","text":"If you tried blowing the horn now, I doubt he'd hear it. I suggest we stop at the clearing up ahead and rest until the wind dies down."},{"name":"ALPHINAUD","text":"The histories make no reference to the existence of these ruins... Curious... Most curious..."},{"name":"ESTINIEN","text":"Never would I have believed that so much land lay hid above the clouds... Dravania is not as I imagined it."},{"name":"ICEHEART","text":"Do you see that sculpture to the west of here? I am all but certain it was carved in the likeness of Saint Shiva."},{"name":"ALPHINAUD","text":"The fates make mock of us. To be so <span class=\"emphasis\">close</span>..."},{"name":"ESTINIEN","text":"Who can say when the weather will turn... I have a mind to make camp."},{"name":"ICEHEART","text":"And now the very elements conspire to delay our meeting with Hraesvelgr... &lt;sigh&gt; I must be patient."},{"name":"MOGHAN","text":"（★未使用／削除予定★）"},{"name":"MOGHAN","text":"This should do nicely, kupo. The winds will likely have died down by tomorrow, but until then, we might as well make ourselves comfortable!"},{"name":"ALPHINAUD","text":"If we <span class=\"emphasis\">must</span> interrupt our journey so close to its end, I suppose this place is as good as any."},{"name":"ALPHINAUD","text":"And mayhap a brief respite from the hardships of the road will help to clear our minds in readiness for the coming parley. Very well, then. I believe a campfire is in order."},{"name":"ALPHINAUD","text":"Leave the gathering of fuel to me─I acquired a keen nose for firewood during my time in the frozen wastes of Coerthas."},{"name":"ESTINIEN","text":"Hmph. “Clear our minds”? 'Tis Master Alphinaud whose mind needs clearing. The thought of meeting a great wyrm in the flesh has befuddled the boy."},{"name":"ESTINIEN","text":"Did you see him stroll away as if these ruins were not crawling with deadly beasts? Follow him, <span class=\"highlight\">Forename</span>, and see that the wildlife does not make a meal of our young friend."},{"name":"ESTINIEN","text":"We will have the camp ready by the time you return."},{"name":"ESTINIEN","text":"Master Alphinaud's artless quest for firewood is like to get him killed. I suggest you follow after the boy, and see that no harm comes to him."},{"name":"ICEHEART","text":"Do you see that sculpture to the west of here? I am all but certain it was carved in the likeness of Saint Shiva."},{"name":"MOGHAN","text":"You know, Estinien may not be as bad as I thought, kupo. Under all those horrid spikes, he actually has a soft spot for his companions. Just a small one, mind. Oh, and don't tell him I told you, all right?"},{"name":"ESTINIEN","text":"Leave the firewood to me!"},{"name":"ICEHEART","text":"I've prepared some things for a meal. It will be plain fare, but better that than empty bellies."},{"name":"ESTINIEN","text":"I see I was right to worry about the boy's safety."},{"name":"ESTINIEN","text":"Once Alphinaud returns with the wood, we can see about supper. The ice queen has filled a pot with what looked like stew ingredients, ready for the fire."},{"name":"ALPHINAUD","text":"Ahhh...few things compare to the simple pleasure of sitting beside a crackling campfire of one's own making."},{"name":"ESTINIEN","text":"Hah! So speaks the “great explorer.” Until recently, you wouldn't have recognized firewood if it came with kindling and a flint."},{"name":"ALPHINAUD","text":"'Tis well you instructed me so patiently, then! But yes, left to my own devices, I would have been compelled to signal to Ysayle with a pile of damp leaves."},{"name":"ALPHINAUD","text":"I was born the pampered son of a Sharlayan dignitary, and, alongside my twin, became the youngest student ever to be accepted into the Studium."},{"name":"ALPHINAUD","text":"How proud I was to match wits with scholars and philosophers... How ignorant of mine own shortcomings... That hubris invited manipulation and betrayal...and led to the downfall of the Scions."},{"name":"ICEHEART","text":"We all of us are guilty of similar ignorance. How many men lay down their lives, never knowing what it is that they fight for? Never questioning that which they have been taught to believe?"},{"name":"ICEHEART","text":"'Twas only upon meeting Hraesvelgr that I learned the truth hidden within our history. Were it not for that chance encounter, I would never have vowed to tear down the Holy See, and expunge the falsehoods with which it fans the flames of conflict. I would have lived and died in ignorance. That the truth has driven me to do terrible things, I cannot deny, but I would rather sin in the pursuit of peace than imagine myself virtuous for perpetuating a needless war."},{"name":"ALPHINAUD","text":"If this journey has taught me anything, it is the importance─and difficulty─of holding to one's convictions in the face of failure...of striving always to replace one's ignorance with knowledge."},{"name":"ESTINIEN","text":"You are well on your way, Master Alphinaud. At your age, I was but a fool swinging a spear, with scarcely a thought in my head."},{"name":"ESTINIEN","text":"Even now, I struggle to acknowledge the misconceptions under which I have labored."},{"name":"ESTINIEN","text":"Sitting here, amongst these grand ruins, how can I deny that man and dragon once lived in peace?"},{"name":"ESTINIEN","text":"But for all that such an age existed, we are now in a time of war. Nidhogg killed my family, and no quirk of history will exonerate him."},{"name":"ESTINIEN","text":"I may be ignorant of how the Dragonsong War began, but if we do not put an end to this conflict now, I can say for a certainty that it will only breed more vengeful souls such as mine."},{"name":"ESTINIEN","text":"In my hands resides the power to vanquish a great wyrm. If Ishgard's survival rests on me wielding that power, I will slay Nidhogg myself...orders or no."},{"name":"ICEHEART","text":"Estinien... You gave your word..."},{"name":"ESTINIEN","text":"My word is contingent upon the success of our parley. Show me the strength of <span class=\"emphasis\">your</span> convictions, Lady Iceheart. Convince Hraesvelgr of the righteousness of your cause."},{"name":"ICEHEART","text":"Doubt not but that I shall, dragoon."},{"name":"ALPHINAUD","text":"Well...winds willing, we shall have our answers on the morrow. Let us sleep now, and face our fate with the rising of the sun..."}],"reward":{"gil":605,"items":[{"id":10805,"one":1,"hq":1},{"id":10889,"one":1,"hq":1},{"id":10931,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67161]},"next":[67163]},"partials":[{"type":"npc","id":"1013202","obj":{"i":1013202,"n":"Moghan","l":2002,"q":2}},{"type":"npc","id":"1012757","obj":{"i":1012757,"n":"Estinien","l":2002,"q":2}},{"type":"npc","id":"1012686","obj":{"i":1012686,"n":"Alphinaud","l":2002,"q":2}},{"type":"npc","id":"1012687","obj":{"i":1012687,"n":"Estinien","l":2002,"q":2}},{"type":"npc","id":"1012688","obj":{"i":1012688,"n":"Ysayle","l":2002,"q":2}},{"type":"npc","id":"1012756","obj":{"i":1012756,"n":"Alphinaud","l":2002,"q":2}},{"type":"npc","id":"1012758","obj":{"i":1012758,"n":"Ysayle","l":2002,"q":2}},{"type":"npc","id":"1012759","obj":{"i":1012759,"n":"Moghan","l":2002,"q":2}},{"type":"npc","id":"1012760","obj":{"i":1012760,"n":"Alphinaud","l":2002,"q":1}},{"type":"item","id":"10805","obj":{"i":10805,"n":"Dhalmelskin Jacket of Aiming","l":133,"c":43274,"t":35,"p":20537}},{"type":"item","id":"10889","obj":{"i":10889,"n":"Ramie Robe of Healing","l":133,"c":43690,"t":35,"p":16429}},{"type":"item","id":"10931","obj":{"i":10931,"n":"Ramie Robe of Casting","l":133,"c":43691,"t":35,"p":16429}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67161","obj":{"i":67161,"n":"The Road to Zenith","g":3,"l":"The Churning Mists","s":46}},{"type":"quest","id":"67163","obj":{"i":67163,"n":"Heart of Ice","g":3,"l":"The Churning Mists","s":48}}]}