{"quest":{"name":"Ready to Fly","location":"The Rising Stones","id":67169,"patch":3.0,"sort":54,"eventIcon":71201,"issuer":1012733,"target":1012589,"involved":[1011223,1012717,1012718,1012719,1012734,1012744],"genre":3,"journal":["Alphinaud has matters to attend to at the Rising Stones.","Alphinaud asks that you return to Ishgard to check on the progress of the manacutter while he coordinates the ongoing search efforts with the remaining Crystal Braves. Make your way to the Skysteel Manufactory and speak with Cid.","Though confounded by your uncannily perfect timing, Cid is happy to announce the near-completion of the manacutter prototype. Whilst he and his employees make the final adjustments to their latest creation, he bids you visit Fortemps Manor, where Estinien awaits.","You meet with Estinien, who appears to have been kept apprised of recent developments by Tataru. With but a few minor touches to be made before the manacutters are ready to fly, the dragoon suggests that you disclose the details of your plan to Ser Aymeric. Proceed to the Congregation of Our Knights Most Heavenly, and speak with the guardsman within to be admitted to the Seat of the Lord Commander.","Alphinaud belatedly joins your audience with Ser Aymeric, and together you recount the long and difficult path that has led you to this point. Having listened to your plans, the lord commander eagerly offers his own blade for the battle ahead, forcing Estinien to remind him of his duties as the city's protector. No sooner has Ser Aymeric relented than Alphinaud moves to declare <span class=\"emphasis\">his</span> determination to join you, only conceding defeat after some typically candid words from the Azure Dragoon. Inquire as to Estinien's reason for denying your fellow Scion his wish.","Estinien acknowledges Alphinaud's potential, but believes the task of defeating Nidhogg will be challenging enough without the need to carry an inexperienced ally. You are forced to concede that even with the power of the Eye, the outcome of the battle is far from assured..."],"objectives":["Speak with Cid at the Skysteel Manufactory.","Speak with Estinien in Fortemps Manor.","Visit the Seat of the Lord Commander.","Speak with Estinien."],"dialogue":[{"name":"ALPHINAUD","text":"I must speak of future plans with the remaining Braves. Any information we uncover on the missing Scions will need to be shared with our allies across the realm─specifically, Urianger in the Waking Sands, and Tataru in Ishgard."},{"name":"ALPHINAUD","text":"While we are organizing our various channels of communication, I would ask that you call upon Master Garlond at the manufactory. I will join you in Ishgard as soon as I am able."},{"name":"ALPHINAUD","text":"I am informed that F'lhaminn and her bodyguards, Hoary Boulder and Coultenet, went missing shortly after the feast. &lt;sigh&gt; Our list of absent friends grows longer..."},{"name":"YUGIRI","text":"'Twould seem the Ul'dahns no longer require my services. I shall return to the search for our missing companions..."},{"name":"RIOL","text":"（★未使用／削除予定★）"},{"name":"ALIANNE","text":"（★未使用／削除予定★）"},{"name":"CID","text":"<span class=\"highlight\">Forename</span>! How in the seven hells do you do it? I was just about to send for you! We have but this moment completed the manacutter's first successful test flight!"},{"name":"CID","text":"A few minor adjustments and she'll be ready to go. While we see to the finishing touches, you might want to pay a visit to Fortemps Manor─a dragoon by the name of Estinien was looking for you."},{"name":"CID","text":"Loitering around here won't speed matters up. Leave the boys to apply the finishing touches, and go and see your friend."},{"name":"BIGGS","text":"We've been working on a second vessel while we perfected the prototype. Don't worry─they'll both be able to handle the winds you're expecting."},{"name":"WEDGE","text":"So sleepy... Hm? What!? I'm awake!"},{"name":"ESTINIEN","text":"You have fulfilled your obligations to the Ul'dahns, then? Mistress Tataru has been keeping me apprised of the situation."},{"name":"ESTINIEN","text":"Once I learned that these “manacutters” of Master Garlond's were nearing completion, I saw no reason to tarry in the Mists."},{"name":"ESTINIEN","text":"For the present, Nidhogg seems content to remain in the Aery, plotting his revenge."},{"name":"ESTINIEN","text":"Might not this be an apt moment to unfold our plans to Ser Aymeric? I think we have kept him in the dark long enough."},{"name":"TEMPLEKIGHTGATE","text":"Ser Aymeric has been eager to speak with you. Pray proceed."},{"name":"Q1","text":"Proceed to the Seat of the Lord Commander?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"AYMERIC","text":"（★未使用／削除予定★）"},{"name":"LUCIA","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"CID","text":"Just a few more adjustments, <span class=\"highlight\">Forename</span>. She'll be ready."},{"name":"ESTINIEN","text":"I have pricked Master Alphinaud's pride I fear. But had I been less forceful, the boy would have insisted on accompanying us to the Aery."},{"name":"ESTINIEN","text":"Do not think me blind to his talent. With a few more campaigns under his belt, I have no doubt that Alphinaud will make a fine field commander."},{"name":"ESTINIEN","text":"But one does not <span class=\"emphasis\">practice</span> on an adversary such as Nidhogg. We shall be hard-pressed enough without the added worry of carrying a novice."}],"reward":{"gil":1013,"xp":67200},"reqs":{"jobs":[{"lvl":55,"id":142}],"quests":[67168]},"next":[67170]},"partials":[{"type":"npc","id":"1012733","obj":{"i":1012733,"n":"Alphinaud","l":481,"q":2}},{"type":"npc","id":"1012589","obj":{"i":1012589,"n":"Estinien","l":2300,"q":4}},{"type":"npc","id":"1011223","obj":{"i":1011223,"n":"Temple Knight Guard","l":2300,"q":7}},{"type":"npc","id":"1012717","obj":{"i":1012717,"n":"Cid","l":2300,"q":1}},{"type":"npc","id":"1012718","obj":{"i":1012718,"n":"Biggs","l":2300,"q":1}},{"type":"npc","id":"1012719","obj":{"i":1012719,"n":"Wedge","l":2300,"q":1}},{"type":"npc","id":"1012734","obj":{"i":1012734,"n":"Yugiri","l":481,"q":2}},{"type":"npc","id":"1012744","obj":{"i":1012744,"n":"Estinien","l":2320,"q":1}},{"type":"quest","id":"67168","obj":{"i":67168,"n":"A Brave Resolution","g":3,"l":"Ul'dah","s":53}},{"type":"quest","id":"67170","obj":{"i":67170,"n":"Into the Aery","g":3,"l":"Ishgard","s":55}}]}