{"quest":{"name":"A General Summons","location":"Ishgard","id":67166,"patch":3.0,"sort":51,"icon":100413,"eventIcon":71201,"issuer":1012721,"target":1012729,"involved":[1002014,1002030,1002047,1003995,1007478,1012716,1012722,1012723,1012724,1012725,1012726,1012727,1012730,1012845,1013153,1013154,1013392],"genre":3,"journal":["Tataru has news for you from Ul'dah.","Tataru excitedly explains that there has been a significant development in the search for the sultana, and that General Raubahn has requested your assistance. Travel to Vesper Bay in western Thanalan, and join your allies inside the Waking Sands.","At the Waking Sands, you are shocked to learn that the sultana is most likely being kept in a poison-induced sleep somewhere within the palace. Before any attempt is made to rescue her, however, your allies deem it prudent to track down her poisoner and identify the substance used to taint Nanamo's wine. Ask Yugiri to explain exactly what is required of you.","Yugiri has information that Meriel, the sultana's former lady-in-waiting, is hiding somewhere in the Silver Bazaar. Question the inhabitants of the hamlet, and confirm the reclusive poisoner's whereabouts.","You question the residents of the Silver Bazaar, and learn that Meriel has indeed returned to the market settlement. Search each dwelling, and find the sultana's former lady-in-waiting.","Before Raubahn can wring the truth from the trembling Meriel, Lolorito appears and proceeds to reveal the details of the assassination plot. All of his actions, he claims, were intended to expose Teledji Adeledji, and ensure the stability of Ul'dah. As proof of his good intentions, he then presents the Flame General with the means to rouse the sultana from her deathlike state. Speak with Alphinaud, and learn his thoughts on this most unexpected development.","Though undoubtedly gladdened by the prospect of the sultana's coming “resurrection,” you sense that Alphinaud's presiding feeling is one of relief at the avoidance of a bloodbath. Rather than join your fellow Scion in contemplating how much worse things might have been, you resolve instead to give thanks. It has, after all, been a good day for Ul'dah."],"objectives":["Enter the Waking Sands.","Speak with Yugiri.","Question Silver Bazaar residents.","Search for Meriel.","Speak with Alphinaud."],"dialogue":[{"name":"TATARU","text":"General Raubahn says they may have uncovered the sultana's whereabouts!"},{"name":"TATARU","text":"And he wants you─by which I mean both of you─to go to the Waking Sands right away and help with the investigation."},{"name":"ALPHINAUD","text":"Come, <span class=\"highlight\">Forename</span>─pressing though Ishgard's plight may be, our presence here will not serve to hasten the manacutter's completion. Let us return to the troubled lands of Thanalan and lend what aid we may."},{"name":"ALPHINAUD","text":"Tataru─have our friends at the Congregation send a message to Estinien. Tell him we have identified a solution to our problem, but that it will take some time to prepare."},{"name":"TATARU","text":"As you wish, Master Alphinaud!"},{"name":"ALPHINAUD","text":"To the Waking Sands, Warrior of Light. 'Tis past time Ul'dah was delivered from this darkness!"},{"name":"ALPHINAUD","text":"I am as intrigued as you, <span class=\"highlight\">Forename</span>. Shall we hear what news Tataru has brought us?"},{"name":"URIANGER","text":"The Dunesfolk have long laced their teas with traces of venom, that they might better survive in a land rife with deadly snakes and scorpions. 'Tis all but certain that Her Grace hath nurtured a similar resistance to such substances... Might not this explain the need for so noticeable a quantity of alchemical supplies? In moderation, full many poisons serve as palliatives, after all..."},{"name":"ALPHINAUD","text":"If one had chosen to entrap the sultana in a deathlike sleep rather than slay her, then one would surely also know of a means to rouse her from said state. There <span class=\"emphasis\">must</span> be an antidote to this poison."},{"name":"HIGIRI","text":"Raubahn's recovery has been nothing short of miraculous. But I should not be surprised. By his scars, I gather that he has survived many terrible wounds."},{"name":"YUGIRI","text":"Our target is Meriel, the sultana's former lady-in-waiting─a woman of Midlander heritage. I am told the two of you have met."},{"name":"YUGIRI","text":"Our sources indicate that she left the palace shortly after the incident, and quietly rejoined the dwindling population of the Silver Bazaar. I suggest we begin by questioning the market's residents, and confirm that Meriel is still in hiding there."},{"name":"YUGIRI","text":"Our target is Meriel, the sultana's former lady-in-waiting─a woman of Midlander heritage. I am told the two of you have met."},{"name":"YUGIRI","text":"Our sources indicate that she left the palace shortly after the incident, and quietly rejoined the dwindling population of the Silver Bazaar. I suggest we begin by questioning the market's residents, and confirm that Meriel is still in hiding here."},{"name":"ALPHINAUD","text":"I have met the sultana's handmaiden on numerous occasions...but I cannot for the life of me bring her features to mind."},{"name":"RAUBAHN","text":"Godsdammit, where is she!? I will tear this place apart if I must!"},{"name":"PIPPIN","text":"I suppose it was too much to ask that we stumble upon her buying fruit in the market square..."},{"name":"PAPASHAN","text":"Easy now, General. We don't want her bolting down some other hole."},{"name":"DEWLALA","text":"Let us gather all the players together. This has gone on long enough..."},{"name":"PAPASHAN","text":"So, Her Grace's poisoner seeks refuge in the Silver Bazaar..."},{"name":"DANYELL","text":"Meriel? Aye, she's here─left the city for good, she says. Barely leaves her house, though. Hm? It's the one closest to the market entrance."},{"name":"DANYELL","text":"Meriel? Aye, she's here─left the city for good, she says. Barely leaves her house, though. Hm? Oh, it's the one closest to the market entrance."},{"name":"KIKIPU","text":"Greetings, <span class=\"highlight\">Forename</span>! What can I do for the Silver Bazaar's favorite adventurer?"},{"name":"KIKIPU","text":"And what brings you to our lonely little hamlet? I believe the arrival of your entourage just about doubled our population..."},{"name":"KIKIPU","text":"Looking for Meriel, you say? If you're hoping to lure her back to Ul'dah, you may as well give up now─the girl's done with city life."},{"name":"KIKIPU","text":"Greetings, <span class=\"highlight\">Forename</span>! What can I do for the Silver Bazaar's favorite adventurer?"},{"name":"KIKIPU","text":"And what brings you to our lonely little hamlet? I believe the arrival of your entourage just about doubled our population..."},{"name":"KIKIPU","text":"Looking for Meriel, you say? If you're hoping to lure her back to Ul'dah, you may as well give up now─the girl's done with city life."},{"name":"SPOTTEDMEADOW","text":"Do I know of any returning residents? Gods, don't tell me they're starting to come <span class=\"emphasis\">back</span>! My masters will not be pleased to hear of this..."},{"name":"SPOTTEDMEADOW","text":"Do I know of any returning residents? Gods, don't tell me they're starting to come <span class=\"emphasis\">back</span>! My masters will not be pleased to hear of this..."},{"name":"ALPHINAUD","text":"By the Twelve... I feared Lord Lolorito's arrival would herald another bloodbath. Little did I suspect that he of all people would gift us the means to rouse the sultana."},{"name":"YUGIRI","text":"“You had killed the one you served...”<br>Ah, pray excuse my mutterings─I was reminded of a line from an old poem."},{"name":"PAPASHAN","text":"In all honesty, I care little for the truth behind these machinations. All that matters to me is that the sultana is alive and well..."},{"name":"MERIEL","text":"（★未使用／削除予定★）"}],"reward":{"gil":1509,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67165]},"next":[67167]},"partials":[{"type":"npc","id":"1012721","obj":{"i":1012721,"n":"Tataru","l":2300,"q":1}},{"type":"npc","id":"1012729","obj":{"i":1012729,"n":"Alphinaud","l":42,"q":2}},{"type":"npc","id":"1002014","obj":{"i":1002014,"n":"Kikipu","l":42,"q":4}},{"type":"npc","id":"1002030","obj":{"i":1002030,"n":"Danyell","l":42,"q":2}},{"type":"npc","id":"1002047","obj":{"i":1002047,"n":"Spotted Meadow","l":42,"q":2}},{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1012716","obj":{"i":1012716,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012722","obj":{"i":1012722,"n":"Alphinaud","l":356,"q":1}},{"type":"npc","id":"1012723","obj":{"i":1012723,"n":"Alphinaud","l":42,"q":1}},{"type":"npc","id":"1012724","obj":{"i":1012724,"n":"Yugiri","l":42,"q":1}},{"type":"npc","id":"1012725","obj":{"i":1012725,"n":"Raubahn","l":42,"q":1}},{"type":"npc","id":"1012726","obj":{"i":1012726,"n":"Pipin","l":42,"q":1}},{"type":"npc","id":"1012727","obj":{"i":1012727,"n":"Papashan","l":42,"q":1}},{"type":"npc","id":"1012730","obj":{"i":1012730,"n":"Yugiri","l":42,"q":2}},{"type":"npc","id":"1012845","obj":{"i":1012845,"n":"Higiri","l":356,"q":1}},{"type":"npc","id":"1013153","obj":{"i":1013153,"n":"Dewlala","l":42,"q":1}},{"type":"npc","id":"1013154","obj":{"i":1013154,"n":"Yugiri","l":356,"q":1}},{"type":"npc","id":"1013392","obj":{"i":1013392,"n":"Meriel","l":42,"q":1}},{"type":"quest","id":"67165","obj":{"i":67165,"n":"New Winds, Old Friends","g":3,"l":"The Churning Mists","s":50}},{"type":"quest","id":"67167","obj":{"i":67167,"n":"Awakening in Ul'dah","g":3,"l":"Western Thanalan","s":52}}]}