{"quest":{"name":"Leaving Moghome","location":"The Churning Mists","id":67160,"patch":3.0,"sort":45,"eventIcon":71201,"issuer":1012078,"target":1012682,"involved":[1012664,1012680,1012681,1012683,1012684,1013589,1013591,1013592,1013593],"genre":3,"journal":["Moghan is ready to lead you out of Moghome.","Moghan seems eager to escort you on your way. Confirm with Alphinaud that all of the necessary preparations have been made for the journey ahead.","Before departing for Zenith, Alphinaud insists upon bidding a final farewell to the Elder Seedseer. Speak with Kan–E–Senna, and thank her for her invaluable assistance.","You join Alphinaud in expressing your gratitude to Kan–E–Senna and Kuplo Kopp, before bidding them both a fond farewell. As the Elder Seedseer turns to leave, however, she pauses for a moment to warn you about Estinien's internal unrest. Though you have long held similar concerns, you can think of little to do but nod obediently. Return to the Moghome aetheryte, and let Moghan know that you are finally ready to depart.","You inform Moghan of your readiness to continue on your journey. Zenith and the great wyrm Hraesvelgr await..."],"objectives":["Speak with Alphinaud.","Speak with Kan–E–Senna.","Speak with Moghan."],"dialogue":[{"name":"MOGHAN","text":"Well, uh...I expect you're eager to be on your way! ...Did I mention your friend was looking for you, kupo? If not: Alphinaud is looking for you!"},{"name":"MOGHAN","text":"I'll be waiting just outside, stretching my wings. Let me know when you're ready to depart!"},{"name":"ALPHINAUD","text":"I dare not think how long we have been away from Ishgard. Gods help us if we meet with further delays..."},{"name":"ESTINIEN","text":"What was I thinking, listening to those self-satisfied little... &lt;mumble&gt;"},{"name":"ICEHEART","text":"It will not be long now, Hraesvelgr..."},{"name":"KANESENNA","text":"Through our labors, new friendships have blossomed. For this, we must give thanks."},{"name":"KUPLOKOPP","text":"I cannot wait to tell my kinsmoogles in the Twelveswood all about this place! They will be <span class=\"emphasis\">beside</span> themselves with envy, kupo!"},{"name":"BODYGUARD01623","text":"They had the Elder Seedseer scrubbing and sweeping... The <span class=\"emphasis\">Elder Seedseer</span>!"},{"name":"BODYGUARD01412","text":"I never imagined my duties would include tidying up fallen leaves in a moogle village beyond the clouds..."},{"name":"ALPHINAUD","text":"To the best of my knowledge, we have all that we need for our trip to Zenith. And I believe the Elder Seedseer and her retinue will soon be making the journey back to Gridania."},{"name":"ALPHINAUD","text":"It would be remiss of us, I think, not to convey our gratitude to them prior to going our separate ways. Shall we?"},{"name":"ALPHINAUD","text":"The Elder Seedseer and her retinue will soon be departing for Gridania."},{"name":"ALPHINAUD","text":"Before they do, it seems only right that we thank them for their assistance. Shall we?"},{"name":"MOGHAN","text":"...Why do I get the feeling my life is in mortal danger? Could it be those berries I had for supper?"},{"name":"ESTINIEN","text":"Must we have this creature as our guide? I would sooner flay the thing than follow it."},{"name":"KANESENNA","text":"Alphinaud, <span class=\"highlight\">Forename</span>─I do humbly thank you for what has been a most enlightening experience. Were it not for your pioneering spirit, the existence of these moogles might never have been revealed to us."},{"name":"ALPHINAUD","text":"'Tis we who should be thankful, Elder Seedseer. Were it not for your timely diplomacy, they would never have chosen to reveal themselves at all."},{"name":"ALPHINAUD","text":"And 'twas your presence, Kuplo Kopp, that ultimately won us their trust. It must have taken great courage to leave the sanctuary of the Twelveswood, and we are exceedingly glad that you did."},{"name":"KUPLOKOPP","text":"It was my pleasure, kupo! I've made so many new friends, and have so many fantastic tales to tell my kinsmoogles back home!"},{"name":"KANESENNA","text":"And it is to our home that we must now return. May you ever walk in the light of the Crystal, my friends."},{"name":"ALPHINAUD","text":"Safe journey, Elder Seedseer. We too must be on our way. Hraesvelgr awaits."},{"name":"KANESENNA","text":"Warrior of Light... Pray attend closely to your companion, Ser Estinien─beneath that stoical facade, a storm of anguish seethes unseen."},{"name":"MOGHAN","text":"Have you said your good-byes and dabbed away your tears, kupo? Then we are indeed ready to go!"},{"name":"ALPHINAUD","text":"We have tarried overlong. Let us forge ahead as swiftly as we may, lest Ishgard bear the brunt of the Horde's fury."},{"name":"ESTINIEN","text":"Enough talk. Let us leave this risible place behind us."},{"name":"ICEHEART","text":"The closer we come to Hraesvelgr, the higher my spirits rise. But is it I who am elated...or Saint Shiva?"}],"reward":{"gil":455,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67159]},"next":[67161,67359]},"partials":[{"type":"npc","id":"1012078","obj":{"i":1012078,"n":"Moghan","l":2002,"q":6}},{"type":"npc","id":"1012682","obj":{"i":1012682,"n":"Moghan","l":2002,"q":2}},{"type":"npc","id":"1012664","obj":{"i":1012664,"n":"Alphinaud","l":2002,"q":4}},{"type":"npc","id":"1012680","obj":{"i":1012680,"n":"Estinien","l":2002,"q":3}},{"type":"npc","id":"1012681","obj":{"i":1012681,"n":"Kuplo Kopp","l":2002,"q":2}},{"type":"npc","id":"1012683","obj":{"i":1012683,"n":"Alphinaud","l":2002,"q":2}},{"type":"npc","id":"1012684","obj":{"i":1012684,"n":"Ysayle","l":2002,"q":2}},{"type":"npc","id":"1013589","obj":{"i":1013589,"n":"Kan-E-Senna","l":2002,"q":2}},{"type":"npc","id":"1013591","obj":{"i":1013591,"n":"Keeper Of The Entwined Serpents","l":2002,"q":2}},{"type":"npc","id":"1013592","obj":{"i":1013592,"n":"Keeper Of The Entwined Serpents","l":2002,"q":2}},{"type":"npc","id":"1013593","obj":{"i":1013593,"n":"Ysayle","l":2002,"q":2}},{"type":"quest","id":"67159","obj":{"i":67159,"n":"Moglin's Judgment","g":3,"l":"The Churning Mists","s":44}},{"type":"quest","id":"67161","obj":{"i":67161,"n":"The Road to Zenith","g":3,"l":"The Churning Mists","s":46}},{"type":"quest","id":"67359","obj":{"i":67359,"n":"Road Kill","g":100,"l":"The Churning Mists","s":5404,"f":1}}]}