{"quest":{"name":"New Winds, Old Friends","location":"The Churning Mists","id":67165,"patch":3.0,"sort":50,"eventIcon":71201,"issuer":1012698,"target":1012714,"involved":[1012583,1012697,1012709,1012710,1012711,1012713,1012715,1012716,1012720,1013155,1014107],"genre":3,"journal":["Estinien would have you enlist the aid of Cid Garlond.","Estinien is forced to concede that Cid's expertise may be your only hope of breaking through the Aery's tempestuous barrier. While the Azure Dragoon keeps vigil over Nidhogg's lair, you are to enlist your old friend's aid. Make your way back to Ishgard, and rendezvous with Alphinaud at Saint Reinette's Forum.","You arrive back in Ishgard to find Alphinaud pondering how best to locate the Ironworks' ever-industrious master. Recalling Lord Emmanellain's fondness for gossip, he suggests paying a visit to Fortemps Manor. Make your way to the Pillars, and speak with the young lord.","Lord Emmanellain is only too happy to furnish you with the latest gossip surrounding Cid and the Holy See's ill-fated airship. Make your way to Ishgard's airship landing and seek out your old friend.","You locate Cid at the airship landing, and Alphinaud wastes no time describing your predicament. Wary of pitting the <span class=\"emphasis\">Enterprise</span> against foes as agile as the Dravanians, however, Cid suggests you take a look at his employees' latest project. Head over to the Skysteel Manufactory and speak with Biggs.","Biggs and Wedge proudly display their newest invention─a diminutive airship known as a “manacutter.” As they set about explaining the craft's various advantages and disadvantages, however, the door bursts open to admit a panting Tataru. The receptionist has news of the sultana! Noting the urgency of the situation, Cid bids you concentrate on matters in Ul'dah while he and his engineers continue work on the manacutter."],"objectives":["Speak with Alphinaud at Saint Reinette's Forum.","Speak with Emmanellain at Fortemps Manor.","Speak with Cid at the airship landing.","Speak with Biggs outside the Skysteel Manufactory."],"dialogue":[{"name":"ESTINIEN","text":"Hm. A force of sufficient power to break through a primal's defenses might conceivably grant us access to the Aery..."},{"name":"ESTINIEN","text":"...And I can offer no better solution. Pray consult this engineer friend of yours."},{"name":"ALPHINAUD","text":"Very well. On the condition that you swear not to lure Nidhogg from his lair in our absence."},{"name":"ESTINIEN","text":"And steal all the glory for myself, you mean? Nay, I am not so selfish as that. Contact me by linkpearl when your preparations are complete, and we shall set forth from Ishgard together."},{"name":"ALPHINAUD","text":"I suggest we rendezvous back at Saint Reinette's Forum, <span class=\"highlight\">Forename</span>. From what I gleaned of the Holy See's decidedly <span class=\"emphasis\">ambitious</span> airship project, Cid will still be in Ishgard."},{"name":"ESTINIEN","text":"Go, meet with your engineer friend. I shall remain here and keep vigil over the wyrm."},{"name":"ALPHINAUD","text":"If our only remaining recourse is to violence, then we should seek out the swiftest path to victory. With every moment we hesitate, Ishgard's prospects grow bleaker."},{"name":"ALPHINAUD","text":"When last you saw Master Garlond, he was advising the Ishgardians on their ailing airship, correct? In that case, he might still be at Camp Cloudtop. Failing that, we could try the airship landing, or mayhap even the Skysteel Manufactory... But let us not waste time searching aimlessly. Someone in the city is sure to know where to find him. The question is who? Ser Aymeric would seem the obvious choice, but there is no guaranteeing he will be able to grant us an audience at short notice..."},{"name":"ALPHINAUD","text":"Ah, I have it! Count Edmont's youngest son prides himself on knowing all of the Holy See's juiciest rumors. Let us return to the manor and see if Lord Emmanellain is about."},{"name":"EMMANELLAIN","text":"Ah, the hero returns! How goes the fight, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>? Well, I trust! ...Hm? In search of a “Cid Garlond,” you say? Then say no more!"},{"name":"EMMANELLAIN","text":"The taverns are full of talk, and the name of said silver-haired genius has cropped up more often than most. I hear he has been tasked with getting that <span class=\"emphasis\">monstrous</span> airship the Holy See commissioned to actually fly. 'Twould seem the project has been plagued with mishaps from the first."},{"name":"EMMANELLAIN","text":"In any case, Garlond Ironworks employees are known to frequent the airship landing, and I'll wager their master does too."},{"name":"ALPHINAUD","text":"The airship landing? Yes, I thought as much. Come, <span class=\"highlight\">Forename</span>─we must find Cid and trouble him for his expert opinion."},{"name":"ALPHINAUD","text":"We were fortunate to find Lord Emmanellain at home. Hm! The tavern keeper's loss is our gain."},{"name":"BIGGS","text":"If Ishgard comes under attack, we'll have to get out of the city pretty sharpish. Don't much like the idea of leaving a job half-finished, though..."},{"name":"WEDGE","text":"...What's that? There are <span class=\"emphasis\">dragons</span> coming? Uh, s-s-sorry! Can't talk now! Have to finish this job and get out of here!"},{"name":"HONOROIT","text":"When it comes to─ahem─<span class=\"emphasis\">exchanging information of uncertain origin</span>, Lord Emmanellain is something of a prodigy."},{"name":"EMMANELLAIN","text":"If you do find Master Garlond at the airship landing, I trust you won't forget who told you where to look! Credit where credit's due, and all that!"},{"name":"CID","text":"<span class=\"highlight\">Forename</span>! Alphinaud! How fare you both? Not terribly well, judging by your faces."},{"name":"ALPHINAUD","text":"Greetings, Master Garlond. I am sure it will come as little surprise when I tell you we have need of a favor..."},{"name":"CID","text":"...Another wind barrier? And you say it was conjured by Nidhogg?"},{"name":"CID","text":"Hm. The <span class=\"emphasis\">Enterprise</span> could certainly take you where you need to go...but she would not fare well against dragons. She's agile for a ship her size─but not <span class=\"emphasis\">that</span> agile. The Dravanians would fly rings around her."},{"name":"CID","text":"And if they took it into their heads to incinerate the rigging, there would be precious little we could do to avoid them."},{"name":"ALPHINAUD","text":"But there must be <span class=\"emphasis\">something</span> we can do! Some manner of weapon we could employ...?"},{"name":"ALPHINAUD","text":"Estinien stands vigil at the edge of the Churning Mists, but we do not know how much longer─"},{"name":"CID","text":"All right, all right, I didn't say it was impossible. I said it was impossible for the <span class=\"emphasis\">Enterprise</span>. We need a smaller boat."},{"name":"CID","text":"Biggs! Wedge! It's time we gave that new toy of yours a proper field test."},{"name":"CID","text":"It's probably best if I let the lads show you. Come on, the manufactory's not far!"},{"name":"BIGGS","text":"Our little project's just inside. Oh, you're going to like this one..."},{"name":"ALPHINAUD","text":"Ah, yes─the Skysteel Manufactory. As I recall, this workshop is primarily devoted to the construction of dragon-slaying weapons..."},{"name":"CID","text":"The Ishgardians have granted us the use of a small corner of their workshop─all part of the agreement. I think you'll see we've made the most of the space..."},{"name":"WEDGE","text":"They all want to build bigger, but we know where the future is headed!"}],"reward":{"gil":1014,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67164]},"next":[67166]},"partials":[{"type":"npc","id":"1012698","obj":{"i":1012698,"n":"Estinien","l":2002,"q":2}},{"type":"npc","id":"1012714","obj":{"i":1012714,"n":"Biggs","l":2300,"q":1}},{"type":"npc","id":"1012583","obj":{"i":1012583,"n":"Emmanellain","l":2320,"q":2}},{"type":"npc","id":"1012697","obj":{"i":1012697,"n":"Alphinaud","l":2002,"q":2}},{"type":"npc","id":"1012709","obj":{"i":1012709,"n":"Cid","l":2301,"q":1}},{"type":"npc","id":"1012710","obj":{"i":1012710,"n":"Biggs","l":2301,"q":1}},{"type":"npc","id":"1012711","obj":{"i":1012711,"n":"Wedge","l":2301,"q":1}},{"type":"npc","id":"1012713","obj":{"i":1012713,"n":"Cid","l":2300,"q":1}},{"type":"npc","id":"1012715","obj":{"i":1012715,"n":"Wedge","l":2300,"q":1}},{"type":"npc","id":"1012716","obj":{"i":1012716,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012720","obj":{"i":1012720,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1013155","obj":{"i":1013155,"n":"Honoroit","l":2320,"q":1}},{"type":"npc","id":"1014107","obj":{"i":1014107,"n":"Alphinaud","l":2320,"q":1}},{"type":"quest","id":"67164","obj":{"i":67164,"n":"The Wyrm's Lair","g":3,"l":"The Churning Mists","s":49}},{"type":"quest","id":"67166","obj":{"i":67166,"n":"A General Summons","g":3,"l":"Ishgard","s":51}}]}