{"quest":{"name":"Awakening in Ul'dah","location":"Western Thanalan","id":67167,"patch":3.0,"sort":52,"icon":100414,"eventIcon":71201,"issuer":1012729,"target":1012731,"involved":[1001821,1012730,1012732],"genre":3,"journal":["Alphinaud would see this dark chapter in Ul'dah's history brought to a close.","Alphinaud is eager to follow Raubahn back to Ul'dah, and witness the beginning of a new chapter in Ul'dahn history. Make your way to the Royal Promenade and present yourself to Bartholomew.","With Nanamo's recovery, the chaos engulfing the city should finally give way to calm. Unfortunately, Lord Lolorito has worrying news to share. It would seem the Empire has built a warship to rival the might of the legendary <span class=\"emphasis\">Agrius</span>. Hot on the heels of this shocking revelation, Alphinaud reveals his intent to disband the Crystal Braves. Inquire as to the thinking behind this momentous resolution.","Alphinaud seems at once embarrassed and unburdened by his outpouring of emotion. What shall become of the Crystal Braves now that their commander is set upon the company's dissolution...?"],"objectives":["Speak with Bartholomew on the Royal Promenade.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Shall we also make our way to Ul'dah? I should imagine Bartholomew has been instructed to admit us."},{"name":"YUGIRI","text":"“You had killed the one you served...”<br>Ah, pray excuse my mutterings─I was reminded of a line from an old poem."},{"name":"BARTHOLOMEW","text":"Flame General Raubahn mentioned you might be coming. Please, this way if you will."},{"name":"YUGIRI","text":"I hope Lord Lolorito's potion is as effective as he claims..."},{"name":"ALPHINAUD","text":"It would appear that the Syndicate has moved swiftly to clear our names. Bartholomew, for one, does not seem remotely surprised by our presence here."},{"name":"ALPHINAUD","text":"I blush to speak thus of mine inner turmoil..."},{"name":"ALPHINAUD","text":"But the fact remains: there is no <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> alive in whom I would rather confide. Were it not for your shining example, I might never have emerged from beneath the pall of my despair."},{"name":"YUGIRI","text":"（★未使用／削除予定★）"}],"reward":{"gil":857,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":142}],"quests":[67166]},"next":[67168]},"partials":[{"type":"npc","id":"1012729","obj":{"i":1012729,"n":"Alphinaud","l":42,"q":2}},{"type":"npc","id":"1012731","obj":{"i":1012731,"n":"Alphinaud","l":41,"q":2}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1012730","obj":{"i":1012730,"n":"Yugiri","l":42,"q":2}},{"type":"npc","id":"1012732","obj":{"i":1012732,"n":"Yugiri","l":41,"q":1}},{"type":"quest","id":"67166","obj":{"i":67166,"n":"A General Summons","g":3,"l":"Ishgard","s":51}},{"type":"quest","id":"67168","obj":{"i":67168,"n":"A Brave Resolution","g":3,"l":"Ul'dah","s":53}}]}