{"quest":{"name":"A Knight's Calling","location":"Ishgard","id":67176,"patch":3.0,"sort":65,"icon":100418,"eventIcon":71201,"issuer":1012780,"target":1013227,"involved":[1012212,1012337,1012377,1012580,1012776,1012777,1012778,1012779,1012781,1012782,1013101,1013381],"genre":3,"journal":["Now that all the players are assembled, Hilda is eager to get on with it.","Lucia's plan to rescue Ser Aymeric hinges upon luring the bulk of Ishgard's defenders out of the city. Correctly deducing that the revolutionaries have recruited knights in service to the High Houses, she asks Hilda to help by ordering these sympathizers to spread word of a heretic army massing outside the Gates of Judgement. Hilda agrees, but not before cautioning her that the deception will not last long. Ask Lucia what role she has in mind for you.","Although the forces of the High Houses should no longer be a factor, a contingent of Temple Knights and the Heavens' Ward will doubtless remain to guard the archbishop and the imprisoned Ser Aymeric. Therefore, Lucia intends to divide her forces into two parties: yours to pursue Thordan VII and draw the attention of the Heavens' Ward, and hers to rescue Ser Aymeric during the ensuing chaos. Temple Knights still loyal to the lord commander have secured the entrance to the Vault. Speak with the squire outside to confirm that the others are in position.","Once you and your companions make your entrance, the Temple Knight squire will send word to Lucia and the others, who stand ready to breach the underground gaol. See to your remaining preparations and commence the assault.<br><br>※Challenge the Vault with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","After facing wave after wave of Temple Knights and the Heavens' Ward besides, you stand at the pinnacle of the Vault, unbowed. Unable to repel your advance, Ser Zephirin gives the order to retreat, and Ser Charibert reluctantly obeys. Frantically, you give chase, sensing that your chance to seize the archbishop is slipping away.","Rejoined by your companions and a wounded Ser Aymeric, you pursue Thordan VII, finally catching up with him as he prepares to board an airship and escape. After exchanging glances, you and Lord Haurchefant rush headlong towards the vessel─but in your haste to apprehend your quarry, you fail to notice a transformed Ser Zephirin taking aim at you, a spear of pure light in his hand. Alert to the danger, Lord Haurchefant bellows a warning and raises his shield in your defense, but the steel gives way, and the spear finds a mark...<br><br>The airship forgotten, you and the others surround Lord Haurchefant, who lies upon the ground struggling to breathe. As Ser Aymeric cradles him in his arms, the fallen knight looks to you with a mixture of agony and relief, and bids you favor him with a smile...before the light leaves his eyes forever.","Outside the Vault, the Temple Knight squire informs you that the others have gone on ahead to Fortemps Manor. Join them and together inform Count Edmont of his son's fate.","To serve; to protect; to sacrifice. There is no greater calling for a knight...or so Count Edmont labors to convince himself. Nothing you can say will be of comfort to him now. Go, and leave the count to mourn in private.","Alphinaud has ever prided himself on his words, but when faced with a grieving father, he could find none. As he reflects on the many ways in which Lord Haurchefant helped you in the past, he grows quiet once more, and turns to look away..."],"objectives":["Speak with Lucia.","Speak with the Temple Knight squire outside the Vault.","Enter the Vault.","Speak with the Temple Knight squire.","Return to Fortemps Manor.","Speak with Alphinaud."],"dialogue":[{"name":"HILDA","text":"We've been working in secret to undermine the Holy See and the High Houses. That much I'll acknowledge."},{"name":"HILDA","text":"But this nonsense about us throwing wide the gates for the heretics is just that: nonsense."},{"name":"LUCIA","text":"If not you, then <span class=\"emphasis\">who</span>?"},{"name":"HILDA","text":"You Temple Knights, of course. Reckoned it was your beloved Ser Aymeric's doing at first, but then I heard how he lost his head. My next best guess would be the Heavens' Ward."},{"name":"HILDA","text":"That way they'd have the perfect excuse to go door-to-door through the Brume. Slaughter the heretics and their “sympathizers” in one fell swoop."},{"name":"HAURCHEFANT","text":"But the Heavens' Ward's scheme did not account for Lady Iceheart's intervention...and so they have been forced to improvise."},{"name":"HILDA","text":"A fine bloody mess, ain't it? But the die is cast. So what's the plan?"},{"name":"LUCIA","text":"We must divert the attention of the High Houses away from the city, and to do that, we need the cooperation of your allies in their service."},{"name":"HILDA","text":"...And what makes you think I have friends in high places?"},{"name":"LUCIA","text":"You would be fools not to, given your goals. Lowborn knights are ideal recruits."},{"name":"LUCIA","text":"Most swore fealty only out of desire for a better life. If offered an opportunity to shed the yoke and live for themselves, who among them would not at least be tempted to take it?"},{"name":"LUCIA","text":"Rare is the man eager to die for a cause he does not hold dear. But it need not come to that this day. If they and their fellow knights are deployed afield to deal with a new threat─a massing of heretics, for example─then they will be unable to join in the defense of the Vault."},{"name":"HILDA","text":"Huh. Spread false reports of an attack to get 'em out of harm's way, you mean?"},{"name":"ALPHINAUD","text":"The city will not soon forget the heretics' last assault. If the High Houses believe another attack is imminent, they will have no choice but to act."},{"name":"LUCIA","text":"Can it be done?"},{"name":"HILDA","text":"Can we trick them into leaving Ishgard? Aye. Can we keep them out for long? Not bloody likely. Make sure you're ready before I send word, because you won't get a second chance at this."},{"name":"ALPHINAUD","text":"Then it is decided. To the Vault! The archbishop must be held to account!"},{"name":"LUCIA","text":"And the lord commander granted his liberty!"},{"name":"ALPHINAUD","text":"I do not relish the thought of facing the Temple Knights in battle, but what other choice do we have?"},{"name":"TATARU","text":"First Ser Grinnaux and Ser Paulecrain, and now this Charibert character... I mean, it makes you wonder, doesn't it? Are <span class=\"emphasis\">all</span> the knights of the Heavens' Ward this bad?"},{"name":"REVOLUTIONARY1","text":"Bugger me, if you ain't everythin' they say! How in the hells did you do that thing with the other thing!?"},{"name":"REVOLUTIONARY2A","text":"Hoo hoo hoo! You didn't half give that highborn scum what for! That was a sight for sore eyes, that was!"},{"name":"HAURCHEFANT","text":"Time is of the essence, <span class=\"highlight\">Forename</span>. We must move quickly, before they discern our intent!"},{"name":"LUCIA","text":"I never liked him, not since his days as an inquisitor. He took far too much pleasure in his work."},{"name":"ALPHINAUD","text":"Gods help me, I think we just might do this..."},{"name":"TATARU","text":"Did you see the way she wielded that weapon of hers? Maybe I should get one for my own protection..."},{"name":"REVOLUTIONARY1","text":"So, er...what happens if we win?"},{"name":"REVOLUTIONARY2A","text":"You seriously mean to attack the Vault, then, do you? As in, charge in there screaming and swinging steel? Bloody hells..."},{"name":"HAURCHEFANT","text":"With allies such as these, we cannot fail!"},{"name":"HILDA","text":"One chance only, <span class=\"highlight\">Forename</span>. Make it count."},{"name":"LUCIA","text":"Hearken to me, everyone! We have two objectives: rescue Ser Aymeric and apprehend the archbishop. We will therefore divide our forces into two parties."},{"name":"LUCIA","text":"Estinien and I will make ready to breach the underground gaol and search for the lord commander. We will not move, however, until the second party has entered the Vault."},{"name":"LUCIA","text":"I speak of <span class=\"emphasis\">your</span> party, Warrior of Light, together with Lord Haurchefant and Master Alphinaud. For this plan to succeed, you will need to fight your way into the highest levels of the Vault, even unto the archbishop's private chambers. When the Heavens' Ward realize what you intend, they will fly to their master's side, leaving only a token force to guard the gaol."},{"name":"LUCIA","text":"Temple Knights loyal to our cause have already secured the entrance to the Vault. Once you are within, they will signal to us. If all goes to plan, we shall rejoin you with Ser Aymeric and confront the archbishop together."},{"name":"LUCIA","text":"Is everyone clear as to their duties? Then let us do what must needs be done!"},{"name":"TEMPLEKNIGHT01640","text":"The others are in position, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"TEMPLEKNIGHT01640","text":"I will send word once you and your party have entered..."},{"name":"TEMPLEKNIGHT01640","text":"Godsspeed, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. For Ser Aymeric, and for Ishgard."},{"name":"TATARU","text":"I wish I still had some blood pearls..."},{"name":"TEMPLEKNIGHT01640","text":"I...I know not what to say. The others, they...they are gathered at Fortemps Manor."},{"name":"TEMPLEKNIGHT01640","text":"For what it is worth, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>...my condolences."},{"name":"HOUSEFORTEMPSGUARD01580","text":"The others are... Please enter, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"ALPHINAUD","text":"I...I could not stand there in silence, but..."},{"name":"ALPHINAUD","text":"When all others had forsaken us, Lord Haurchefant took us in. Our beacon of hope in a world of darkness."},{"name":"ALPHINAUD","text":"He did his utmost to raise our spirits, so that we might face our troubles with courage. With conviction."},{"name":"ALPHINAUD","text":"So that we might face them as...as <span class=\"emphasis\">knights</span>..."},{"name":"BUTLER01580","text":"My lord..."},{"name":"HOUSEFORTEMPSSTEWARD","text":"What are we to do...?"},{"name":"TATARU","text":"&lt;sniffle&gt; &lt;sob&gt; I'm sorry, I just...I can't..."}],"reward":{"gil":5000,"xp":76800,"instance":34},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67175]},"next":[67177]},"partials":[{"type":"npc","id":"1012780","obj":{"i":1012780,"n":"Hilda","l":2300,"q":2}},{"type":"npc","id":"1013227","obj":{"i":1013227,"n":"Alphinaud","l":2301,"q":4}},{"type":"npc","id":"1012212","obj":{"i":1012212,"n":"Temple Knight Squire","l":2301,"q":1}},{"type":"npc","id":"1012337","obj":{"i":1012337,"n":"House Fortemps Manservant","l":2320,"q":5}},{"type":"npc","id":"1012377","obj":{"i":1012377,"n":"House Fortemps Steward","l":2320,"q":6}},{"type":"npc","id":"1012580","obj":{"i":1012580,"n":"Tataru","l":2301,"q":5}},{"type":"npc","id":"1012776","obj":{"i":1012776,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012777","obj":{"i":1012777,"n":"Tataru","l":2300,"q":2}},{"type":"npc","id":"1012778","obj":{"i":1012778,"n":"Lucia","l":2300,"q":2}},{"type":"npc","id":"1012779","obj":{"i":1012779,"n":"Haurchefant","l":2300,"q":2}},{"type":"npc","id":"1012781","obj":{"i":1012781,"n":"Beggarly Fellow","l":2300,"q":2}},{"type":"npc","id":"1012782","obj":{"i":1012782,"n":"Filthy Fellow","l":2300,"q":2}},{"type":"npc","id":"1013101","obj":{"i":1013101,"n":"House Fortemps Guard","l":2301,"q":2}},{"type":"npc","id":"1013381","obj":{"i":1013381,"n":"Tataru","l":2300,"q":2}},{"type":"instance","id":"34","obj":{"i":34,"n":"The Vault","c":61801,"t":"Dungeons","min_lvl":57,"max_lvl":58,"min_ilvl":115}},{"type":"quest","id":"67175","obj":{"i":67175,"n":"Fire and Blood","g":3,"l":"Ishgard","s":64}},{"type":"quest","id":"67177","obj":{"i":67177,"n":"The Sins of Antiquity","g":3,"l":"Ishgard","s":66}}]}