{"quest":{"name":"Into the Aery","location":"Ishgard","id":67170,"patch":3.0,"sort":55,"icon":100415,"eventIcon":71201,"issuer":1012589,"target":1012746,"involved":[1012745,1013168,1013169,1013170],"genre":3,"journal":["Estinien is eager to set forth for the Aery.","With no further obstacles to bar your entrance to the Aery, Estinien is eager to be underway. Return to the Skysteel Manufactory, and collect the manacutters from Cid.","At the manufactory, Cid, Wedge, and Biggs take turns reassuring you that their manacutters are equal to the task of piercing the barrier around the Aery. Seeing no further need to delay, Estinien bids you fly with him to Nidhogg's lair forthwith. It would seem that the time has come at last to face the dread wyrm in a battle that could bring an end to a thousand years of suffering.<br><br>※Challenge the Aery with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","Following an aerial encounter with the enraged Nidhogg, you are separated from Estinien and land far from the duel between dragoon and wyrm. Undaunted, you cut a bloody path through the Aery's defenders, and eventually arrive at their master's lofty perch. There, with the Azure Dragoon stifling the source of Nidhogg's strength, you finally succeed in bringing the massive creature down.","Glorying in victory, the Azure Dragoon gouges out Nidhogg's remaining eye, and sends the lifeless wyrm tumbling into the clouds below. Moments later, your Crystal of Lightning is suffused with new radiance, and you are treated to another vision of the past─a vision wherein you witness the truth of Nidhogg's defeat at the hands of Haldrath and his knights. When you subsequently relate the tale to Estinien, the dragoon seems greatly perplexed. If Haldrath claimed <span class=\"emphasis\">both</span> eyes from the wyrm, whence came the trophy so recently plucked from Nidhogg's skull? Discuss the matter further with Estinien.","Though Estinien has defeated his lifelong nemesis, the mysteries thus uncovered weigh heavily upon his heart. Only by wresting the truth from Hraesvelgr will your triumph be complete."],"objectives":["Speak with Cid.","Enter the Aery.","Speak with Estinien."],"dialogue":[{"name":"ESTINIEN","text":"We have tarried long enough. Let us call upon Master Garlond and take possession of the manacutters."},{"name":"BIGGS","text":"These little beauties are our pride and joy... And now they're yours! So, uh...be careful with 'em, eh!?"},{"name":"WEDGE","text":"&lt;yawn&gt; ...I guarantee you won't find any loose rivets─we triple-checked!"},{"name":"ESTINIEN","text":"The moment is at hand, Warrior of Light."},{"name":"CID","text":"<span class=\"highlight\">Forename</span>, old friend! The 'cutters are ready when you are!"},{"name":"WEDGE","text":"The finer adjustments cost us a few sleepless nights, but we got there in the end!"},{"name":"BIGGS","text":"Which means <span class=\"emphasis\">you</span> can get where <span class=\"emphasis\">you</span> need to go. I tell you, these little beauties'll tear through that wind barrier like a cermet drill through cottage cheese."},{"name":"CID","text":"And that, my friends, is a Garlond Ironworks guarantee!"},{"name":"ESTINIEN","text":"You have our thanks. Come, Warrior of Light─the dread wyrm awaits!"},{"name":"ESTINIEN","text":"To the manacutters, Warrior of Light─the dread wyrm awaits!"},{"name":"CID","text":"Give that overgrown lizard a kick in the tail from me, eh? We'll be waiting for you, <span class=\"highlight\">Forename</span>!"},{"name":"ESTINIEN","text":"Though Nidhogg is fallen, my heart is yet heavy."},{"name":"ESTINIEN","text":"...And this stain of corruption pleases me not.<br>...When all has been put to rest, I must needs forge my armor anew."}],"reward":{"gil":5000,"aetherCurrent":1,"items":[{"id":12073}],"xp":67200,"instance":39},"reqs":{"jobs":[{"lvl":55,"id":142}],"quests":[67169]},"next":[67171,67856]},"partials":[{"type":"npc","id":"1012589","obj":{"i":1012589,"n":"Estinien","l":2300,"q":4}},{"type":"npc","id":"1012746","obj":{"i":1012746,"n":"Estinien","l":2002,"q":2}},{"type":"npc","id":"1012745","obj":{"i":1012745,"n":"Estinien","l":2300,"q":1}},{"type":"npc","id":"1013168","obj":{"i":1013168,"n":"Cid","l":2300,"q":1}},{"type":"npc","id":"1013169","obj":{"i":1013169,"n":"Biggs","l":2300,"q":1}},{"type":"npc","id":"1013170","obj":{"i":1013170,"n":"Wedge","l":2300,"q":1}},{"type":"item","id":"12073","obj":{"i":12073,"n":"Manacutter Key","l":1,"c":26014,"t":63}},{"type":"instance","id":"39","obj":{"i":39,"n":"The Aery","c":61801,"t":"Dungeons","min_lvl":55,"max_lvl":56,"min_ilvl":110}},{"type":"quest","id":"67169","obj":{"i":67169,"n":"Ready to Fly","g":3,"l":"The Rising Stones","s":54}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67856","obj":{"i":67856,"n":"Tricks and Stones","g":48,"l":"The Churning Mists","s":1,"f":1}}]}