{"quest":{"name":"Ill-weather Friends","location":"Fortemps Manor","id":67174,"patch":3.0,"sort":59,"eventIcon":71201,"issuer":1012751,"target":1013332,"involved":[1012752,1012753,1012754,1012755,1013128,1013333,1013340,1013341,1013342,1013381],"genre":3,"journal":["Adversity acquaints a man with strange bedfellows, as Alphinaud knows only too well.","Even with an army of knights, a direct assault on the Vault would be fruitless. However, were you to enlist the aid of the revolutionaries hiding in the Brume, Lucia believes you may yet have a chance of success. Together with Alphinaud, go and speak with Tataru at the Forgotten Knight and see what she knows of the revolutionaries and their leader.","Tataru knows little and less of the gang you seek, save for the moniker of their leader: the Mongrel. For lack of a better option, Alphinaud bids you take to the streets and question the residents of the Brume.","As expected, the people are not wont to speak of the revolutionaries in their midst. Inform Alphinaud of your failure.","Alphinaud seems wholly unconcerned by your lack of success. And little wonder: one cannot simply ask where a gang of notorious outlaws is hiding and expect to receive an honest answer. By way of consolation, your fruitless efforts <span class=\"emphasis\">have</span> lent credence to Alphinaud's theory that the revolutionaries are being sheltered by the populace..."],"objectives":["Speak with Tataru at the Forgotten Knight.","Question the residents of the Brume.","Report to Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"But how are we to carry out this bold endeavor? Even with an army of knights at our backs, a direct assault on the Vault seems unlikely to succeed."},{"name":"LUCIA","text":"You are correct, Master Alphinaud. Not even the assembled might of House Fortemps and the Temple Knights would be sufficient. With the support of another party, however, we may yet stand a chance."},{"name":"ALPHINAUD","text":"You speak of one of the other High Houses?"},{"name":"LUCIA","text":"Precisely the opposite. I speak of the revolutionaries rumored to reside in the Brume."},{"name":"LUCIA","text":"'Twas these disgruntled Ishgardians who opened the gates of our city to the heretics, I believe."},{"name":"ALPHINAUD","text":"But of course! If their hatred of the Holy See drove them to such deeds, they might well be persuaded to assist in Ser Aymeric's rescue, knowing the truth he would lay bare..."},{"name":"LUCIA","text":"Such is my hope, Master Alphinaud. And I would have you and <span class=\"highlight\">Forename</span> reach out to them."},{"name":"LUCIA","text":"As a Temple Knight and sworn servant of the Holy See, any overtures I make are doomed to fail."},{"name":"LUCIA","text":"But as outsiders, the two of you may receive a warmer welcome."},{"name":"ALPHINAUD","text":"Very well. We shall seek out the leader of these revolutionaries, and make our case."},{"name":"LUCIA","text":"My thanks. Estinien─will your brothers heed your command if you order them to stand aside?"},{"name":"ESTINIEN","text":"The dragoons have no love for politics, my lady. They will gladly watch and wait while the highborn fight amongst themselves."},{"name":"ALPHINAUD","text":"How very wise. <span class=\"highlight\">Forename</span>─we should hurry to the Forgotten Knight. Tataru may have knowledge of the revolutionaries."},{"name":"LUCIA","text":"The lord commander has need of us...and we of him. We must act now."},{"name":"ESTINIEN","text":"I thought the lord commander wiser than this."},{"name":"HAURCHEFANT","text":"Have no fear, Father! My arm will not falter; my shield will not break. I promise you: we <span class=\"emphasis\">shall</span> prevail!"},{"name":"EDMONT","text":"If we must risk the fortunes of our house to bring this truth to light, then so be it. But are you truly prepared to do this? To face the Heavens' Ward in battle, if you must?"},{"name":"ALPHINAUD","text":"It would seem that the Forgotten Knight was spared the worst of the earlier chaos..."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, Alphinaud! Gods, I've been worried sick! It's so good to see you!"},{"name":"ALPHINAUD","text":"And you, Tataru. How did you manage to escape the chaos in the streets?"},{"name":"TATARU","text":"Gibrillont and the others barricaded the doors until the heretics left. No one was harmed, thankfully. But what about you two? What came of your journey?"},{"name":"TATARU","text":"...You're not serious. What was Ser Aymeric thinking!? I mean, the way you two talk about him, I wouldn't have believed... <span class=\"emphasis\">Anyway</span>, I've heard rumors of the people you're looking for, but I doubt they'll be of much use."},{"name":"TATARU","text":"The only thing I can say with any certainty is that they're led by someone called “the Mongrel.”"},{"name":"ALPHINAUD","text":"A queer moniker if ever I have heard one─but mayhap it will make the individual in question easier to find. Come, let us all make inquiries below."},{"name":"ALPHINAUD","text":"If truth be told, I doubt anyone will be willing to speak of this “Mongrel.” But we may still be able to confirm that Tataru's information is correct."},{"name":"TATARU","text":"At first, the people here were a bit standoffish, but with a little effort─and a lot of parley─I've managed to make plenty of friends!"},{"name":"EDMONT","text":"Tread warily, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. The men and women you seek may misinterpret your intentions."},{"name":"HAURCHEFANT","text":"So she hopes to find a friend in the enemy of our enemy... Well, well, well..."},{"name":"THEPOORA01638","text":"A mongrel? Not sure I catch your meaning. To a blue blood, we're all of us dogs down here."},{"name":"THEPOORA01638","text":"Look around you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. Mongrels as far as the eye can see."},{"name":"THEPOORB01638","text":"Eh? What's that? Speak up! I can't hear as well as I used to."},{"name":"THEPOORB01638","text":"Are you whispering? I swear, I can't hear a word you're saying."},{"name":"THEPOORC01638","text":"I don't know a godsdamned thing about the Mongrel, but if I did, you can be sure I wouldn't tell you!"},{"name":"THEPOORC01638","text":"Piss off back where you came from, outlander. You'll get nothing from me!"},{"name":"ALPHINAUD","text":"Not a single shred of information? Just as I expected. These revolutionaries would not have evaded capture for so long without the masses' complicity. Still, it is good to know that Tataru's ears are as sharp as ever."}],"reward":{"gil":465,"items":[{"id":10827,"one":1,"hq":1},{"id":10911,"one":1,"hq":1},{"id":10953,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":142}],"quests":[67173]},"next":[67529]},"partials":[{"type":"npc","id":"1012751","obj":{"i":1012751,"n":"Alphinaud","l":2320,"q":2}},{"type":"npc","id":"1013332","obj":{"i":1013332,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012752","obj":{"i":1012752,"n":"Estinien","l":2320,"q":2}},{"type":"npc","id":"1012753","obj":{"i":1012753,"n":"Lucia","l":2320,"q":2}},{"type":"npc","id":"1012754","obj":{"i":1012754,"n":"Haurchefant","l":2320,"q":2}},{"type":"npc","id":"1012755","obj":{"i":1012755,"n":"Count Edmont De Fortemps","l":2320,"q":2}},{"type":"npc","id":"1013128","obj":{"i":1013128,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1013333","obj":{"i":1013333,"n":"Tataru","l":2300,"q":2}},{"type":"npc","id":"1013340","obj":{"i":1013340,"n":"Brume Starveling","l":2300,"q":2}},{"type":"npc","id":"1013341","obj":{"i":1013341,"n":"Brume Elder","l":2300,"q":1}},{"type":"npc","id":"1013342","obj":{"i":1013342,"n":"Brume Rat","l":2300,"q":1}},{"type":"npc","id":"1013381","obj":{"i":1013381,"n":"Tataru","l":2300,"q":2}},{"type":"item","id":"10827","obj":{"i":10827,"n":"Hallowed Ramie Gaskins of Aiming","l":139,"c":45665,"t":36,"p":13209}},{"type":"item","id":"10911","obj":{"i":10911,"n":"Hallowed Ramie Gaskins of Healing","l":139,"c":45666,"t":36,"p":13209}},{"type":"item","id":"10953","obj":{"i":10953,"n":"Hallowed Ramie Gaskins of Casting","l":139,"c":45667,"t":36,"p":13209}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67529","obj":{"i":67529,"n":"The Spice of Life","g":3,"l":"Ishgard","s":60}}]}