{"quest":{"name":"Fire and Blood","location":"Ishgard","id":67175,"patch":3.0,"sort":64,"icon":100417,"eventIcon":71201,"issuer":1013260,"target":1012780,"involved":[1012766,1012768,1012769,1012770,1012771,1012772,1012773,1012774,1012775,1012776,1012777,1012778,1012779,1012781,1012782,1013228,1014653,1014654],"genre":3,"journal":["Alphinaud is considering how best to proceed with the hunt for the Mongrel.","In the midst of considering your next course of action, Alphinaud suddenly realizes that Tataru is nowhere to be seen. Fearing that she may have run afoul of the revolutionaries, he rushes towards the doors leading to the Brume, motioning for you to follow.","You cast about for Tataru, but find no sign of her. Head to another vantage point and continue your search.","You spot Tataru being pursued by two men, and immediately give chase. Soon after, the strangers corner the trembling girl and seem set to do something unspeakable when Alphinaud accosts them from afar. His attempts to defuse the situation only serve to rile the men further, however, and violence appears inevitable─until a raven-haired woman with ruby eyes appears, and commands Tataru's tormentors to desist. It would seem her name is Hilda. In the taut silence which follows, she regards you with interest, waiting for you to state your reason for coming.","Before you can speak, Hilda suggests you accompany her to the Forgotten Knight, where you may discuss matters in private. Follow her to the tavern up above and continue your conversation there.","At Hilda's request, Gibrillont orders his staff to clear the Forgotten Knight and grant you privacy, after which you explain your reasons for coming in full. As Alphinaud attempts to win the revolutionaries' cooperation─seemingly in vain─Ser Charibert, a knight of the Heavens' Ward, strides into the tavern, accusing you and the others of plotting insurrection. With no other options left to you, you accept his offer to step outside and face him in battle.<br><br>Joined by Lord Haurchefant and Lucia, you manage to overwhelm Ser Charibert, who withdraws. The joy of victory swiftly dissipates, however, when you learn that Ser Aymeric has been imprisoned, and the Heavens' Ward placed in command of the Temple Knights. Recognizing that the situation has come to a head, Hilda agrees to assist with the rescue mission.","Recognizing your curiosity, Hilda explains that she took to calling herself “the Mongrel” out of a newfound pride for her mixed heritage, in spite of the discrimination she and others like her suffer. In the end, she declares, her followers have come to believe that the differences between lowborn and highborn are far greater than those between pureblood and mongrel. Thus united in purpose and pledged to Ser Aymeric's cause, they hope to bring about long overdue and lasting change."],"objectives":["Search for Tataru in the Brume.","Speak with Hilda.","Speak with Hilda at the Forgotten Knight.","Speak with Hilda."],"dialogue":[{"name":"ALPHINAUD","text":"There must be a way we can draw the Mongrel out into the open. Hmm... Mayhap we should discuss this with Tataru."},{"name":"ALPHINAUD","text":"Speaking of which, where is Tataru? She... Oh, confound it. She went below to make inquiries on her own, didn't she? We must find her quickly, <span class=\"highlight\">Forename</span>─I have a premonition this is not going to end well."},{"name":"ALPHINAUD","text":"Where could she have gone? Ah, <span class=\"highlight\">Forename</span>─try looking for her over there."},{"name":"SYSTEM","text":"You cast your gaze over the streets below, but see no sign of Tataru..."},{"name":"ALPHINAUD","text":"She must be around here somewhere... I take it you've had no luck either?"},{"name":"TATARU","text":"Uwaaah! I'm sorry, forget I said anything!"},{"name":"ALPHINAUD","text":"Wait─down there! Isn't that Tataru?"},{"name":"ALPHINAUD","text":"&lt;gasp&gt; Those men are chasing her! Quickly, <span class=\"highlight\">Forename</span>─after them!"},{"name":"HILDA","text":"Before you start─let's go somewhere a bit more private, eh? The Forgotten Knight, say."},{"name":"ALPHINAUD","text":"For once, it would seem the fates are smiling upon us. Had those ruffians forced our hand, I dare not think what would have ensued."},{"name":"TATARU","text":"Th-They didn't much care for my story about the weathered cane..."},{"name":"REVOLUTIONARY1","text":"Whatever it is you've got to say, say it!"},{"name":"REVOLUTIONARY2","text":"I've got my eye on you..."},{"name":"ALPHINAUD","text":"I think it best if you take the lead this time, <span class=\"highlight\">Forename</span>."},{"name":"TATARU","text":"If you're nervous, I could try parleying with them on our behalf. Perhaps they'd be interested in techniques for working lauan logs...or maybe the tale of the cursed gladius? Oh, I know─the legendary skillet! Everyone loves that one!"},{"name":"HILDA","text":"Let me guess: you're wondering why I chose “the Mongrel,” right?"},{"name":"HILDA","text":"Because it's what I am, and I'm not ashamed of it. Not anymore."},{"name":"HILDA","text":"Besides, even my pureblood pups have more in common with me than the lords and ladies up on high. They none of 'em are well bred. Hells, some of their mothers were cast out after a spot of fun, same as mine."},{"name":"HILDA","text":"Story old as time─and one we're sick of hearing, which is why we took up arms."},{"name":"HILDA","text":"Not that we mean to hold <span class=\"emphasis\">all</span> the blue bloods to account. Some have done right by us, I'll allow, like them in House Haillenarte."},{"name":"HILDA","text":"Not that we mean to hold <span class=\"emphasis\">all</span> the blue bloods to account. Some have done right by us, I'll allow, like them in House Haillenarte. 'Course, you'd know all about that, wouldn't you?"},{"name":"HILDA","text":"But enough talk. Your friend's still rotting in a cell. Let's not keep him waiting."},{"name":"ALPHINAUD","text":"I had not reckoned with the Temple Knights' involvement... Not as <span class=\"emphasis\">enemies</span>, at any rate."},{"name":"TATARU","text":"First Ser Grinnaux and Ser Paulecrain, and now this Charibert character... I mean, it makes you wonder, doesn't it? Are <span class=\"emphasis\">all</span> the knights of the Heavens' Ward this bad?"},{"name":"REVOLUTIONARY1","text":"Bugger me if you ain't everythin' they say! How in the hells did you do that thing with the other thing!?"},{"name":"REVOLUTIONARY2","text":"Hoo hoo hoo! You didn't half give that highborn scum what for! That was a sight for sore eyes, that was!"},{"name":"HAURCHEFANT","text":"Time is of the essence, <span class=\"highlight\">Forename</span>. We must move quickly, before they discern our intent!"},{"name":"LUCIA","text":"I never liked him, not since his days as an inquisitor. He took far too much pleasure in his work."},{"name":"QIB","text":"Defeat Charibert!"},{"name":"QIB","text":"If it's a fight you want, then come and get it!"},{"name":"QIB","text":"My, such fury! Patience, my queen. We've only just begun."},{"name":"QIB","text":"Defend Ser Charibert! Kill the rebels!"},{"name":"QIB","text":"Damn! There's no end to them!"},{"name":"QIB","text":"It seems you are beyond reason. How marvelous..."},{"name":"QIB","text":"Stop this, all of you! It is madness! Why are you fighting!?"},{"name":"QIB","text":"Lord Haurchefant! Over here!"},{"name":"QIB","text":"Hmph. How fitting. The noble bastard and the mongrel bitch."},{"name":"QIB","text":"This mongrel bitch is going to put a bullet between your eyes!"},{"name":"QIB","text":"I suppose now is as good a time as any..."},{"name":"QIB","text":"Confound it..."},{"name":"QIB","text":"Of all the bloody places to..."},{"name":"QIB","text":"As long as you yet live...my...friend."}],"reward":{"gil":939,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67532]},"next":[67176]},"partials":[{"type":"npc","id":"1013260","obj":{"i":1013260,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012780","obj":{"i":1012780,"n":"Hilda","l":2300,"q":2}},{"type":"npc","id":"1012766","obj":{"i":1012766,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1012768","obj":{"i":1012768,"n":"Hilda","l":2300,"q":1}},{"type":"npc","id":"1012769","obj":{"i":1012769,"n":"Beggarly Fellow","l":2300,"q":1}},{"type":"npc","id":"1012770","obj":{"i":1012770,"n":"Filthy Fellow","l":2300,"q":1}},{"type":"npc","id":"1012771","obj":{"i":1012771,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1012772","obj":{"i":1012772,"n":"Tataru","l":2300,"q":1}},{"type":"npc","id":"1012773","obj":{"i":1012773,"n":"Hilda","l":2300,"q":1}},{"type":"npc","id":"1012774","obj":{"i":1012774,"n":"Beggarly Fellow","l":2300,"q":1}},{"type":"npc","id":"1012775","obj":{"i":1012775,"n":"Filthy Fellow","l":2300,"q":1}},{"type":"npc","id":"1012776","obj":{"i":1012776,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012777","obj":{"i":1012777,"n":"Tataru","l":2300,"q":2}},{"type":"npc","id":"1012778","obj":{"i":1012778,"n":"Lucia","l":2300,"q":2}},{"type":"npc","id":"1012779","obj":{"i":1012779,"n":"Haurchefant","l":2300,"q":2}},{"type":"npc","id":"1012781","obj":{"i":1012781,"n":"Beggarly Fellow","l":2300,"q":2}},{"type":"npc","id":"1012782","obj":{"i":1012782,"n":"Filthy Fellow","l":2300,"q":2}},{"type":"npc","id":"1013228","obj":{"i":1013228,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1014653","obj":{"i":1014653,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1014654","obj":{"i":1014654,"n":"Tataru","l":2300,"q":1}},{"type":"quest","id":"67532","obj":{"i":67532,"n":"Bloodlines","g":3,"l":"Ishgard","s":63}},{"type":"quest","id":"67176","obj":{"i":67176,"n":"A Knight's Calling","g":3,"l":"Ishgard","s":65}}]}