{"quest":{"name":"The Sins of Antiquity","location":"Ishgard","id":67177,"patch":3.0,"sort":66,"icon":100419,"eventIcon":71201,"issuer":1013227,"target":1013183,"involved":[1011223,1012580,1012585,1013229,1014316,1014527],"genre":3,"journal":["Alphinaud is lost in thought.","Gathering himself, Alphinaud suggests you visit the Congregation of Our Knights Most Heavenly and see if Ser Aymeric is recovered from his injuries. Accompany him to Foundation and inform the Temple Knight on duty of your desire to speak with the lord commander.","In Ser Aymeric's private chambers, the power of the Echo stirs within you once more, and you are granted a vision of the past. You watch as the lord commander accuses the church of hiding the origins of the Dragonsong War, and hear the archbishop acknowledge it to be the truth. Ser Aymeric continues, challenging his father on the morality of the church's deception, but the archbishop, steadfast in his conviction, is unswayed. Though it is a lie, Ishgard's sons and daughters must fight and die for it, for the crimes of Thordan and his knights twelve are beyond reparation. Recognizing the futility of convincing his son to accept this state of affairs, Thordan has Ser Aymeric arrested─but not before revealing that he has plans of his own to free the people of Ishgard from the sins of antiquity.<br><br>Reflecting on the unnatural powers demonstrated by the knights of the Heavens' Ward, your companions conclude that they are using their own bodies as vessels for the souls of the legendary King Thordan and his knights twelve, much as Ysayle did for Saint Shiva. Though Ser Aymeric knows not his father's plans─or the significance of “Azys Lla”─he declares that the archbishop and the Heavens' Ward must be stopped.<br><br>The lord commander duly entreats you and Alphinaud, as representatives of the Scions of the Seventh Dawn, to help him bring his father to justice. In response, Alphinaud states that if the Heavens' Ward have indeed harnessed primal powers, it is the duty of the remaining Scions to oppose them. And so, with newfound purpose, Alphinaud bids you join him to discuss how you might find the archbishop."],"objectives":["Speak with Aymeric at the Congregation of Our Knights Most Heavenly."],"dialogue":[{"name":"ALPHINAUD","text":"I... We must press on with our mission. Tataru, pray return to your duties at the Forgotten Knight."},{"name":"ALPHINAUD","text":"Let us go and speak with Ser Aymeric, <span class=\"highlight\">Forename</span>. I worry for his well-being."},{"name":"TATARU","text":"&lt;sniffle&gt; &lt;sob&gt; I'm sorry, I just...I can't..."},{"name":"LUCIA","text":"Ser Aymeric..."},{"name":"ALPHINAUD","text":"I... Hm."},{"name":"ESTINIEN","text":"Curse those bloody whoresons and piss on their swiving round table."},{"name":"AYMERIC","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, Master Alphinaud─I, Aymeric, lord commander of the Temple Knights of Ishgard, do hereby entreat the aid of the Scions of the Seventh Dawn."},{"name":"ALPHINAUD","text":"Our aid in preventing whatever it is that the archbishop intends?"},{"name":"AYMERIC","text":"Your aid in bringing him to justice. Too much blood has been spilled for the lies he perpetuated. No more."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I shall pursue him to the end of the world if I must."},{"name":"A1","text":"Life for death. I will have Ser Zephirin's heart for what he did to Haurchefant."},{"name":"A1","text":"..."},{"name":"AYMERIC","text":"I thank you, <span class=\"highlight\">Forename</span>. I have heard many men make such pledges, but you─you speak in earnest."},{"name":"AYMERIC","text":"Yes...yes, of course. You two were close, I know."},{"name":"AYMERIC","text":"I make no claim to know the turmoil in your soul, but I implore you, <span class=\"highlight\">Forename</span>─in this darkest of hours, pray lend us your strength."},{"name":"ALPHINAUD","text":"Much has changed since our order's founding, but our duty to combat the primal threat has not. If the archbishop and the Heavens' Ward are guilty of the crime of summoning, then <span class=\"highlight\">Forename</span> and I will stop them."},{"name":"AYMERIC","text":"Would that I could join you in the pursuit, but alas, my father's absence has thrown our government into chaos."},{"name":"AYMERIC","text":"Ever since the founding of our nation, there has been an archbishop to serve as a guiding light for the masses─a force for stability to counterbalance the High Houses' ceaseless maneuvering."},{"name":"AYMERIC","text":"Convincing the people to recognize the truth of our origins would have been difficult even with my father's support. The road ahead is that much more fraught with peril without it."},{"name":"AYMERIC","text":"Yet walk it we must, for unity is more vital to our survival than ever. After all, Nidhogg's death did not mark the cessation of Dravanian hostilities. Far from it. We will have great need of each other in the days to come."},{"name":"ESTINIEN","text":"You may ever count on my lance, Ser Aymeric. To my dying breath, I shall defend Ishgard from the Horde."},{"name":"LUCIA","text":"If I may, Lord Commander, I would like to assist the Scions in their search for the archbishop."},{"name":"LUCIA","text":"<span class=\"highlight\">Forename</span>, Master Alphinaud, pray attend me outside."},{"name":"ALPHINAUD","text":"Very well. With me, <span class=\"highlight\">Forename</span>. I believe we have much to discuss."},{"name":"AYMERIC","text":"If they knew what would come of it, would they still have done it? What power could be worth such bloodshed─such sorrow..."},{"name":"LUCIA","text":"The Congregation is in disarray; the rift between our brothers and sisters still far from healed. But I will see us whole again─without further violence, so far as it is possible."},{"name":"ALPHINAUD","text":"I thought Shiva an unprecedented threat, but this? Ishgard's twelve finest knights, each imbued with primal powers. May the gods have mercy on us all."},{"name":"ESTINIEN","text":"Could Nidhogg sense their power? Is that why he did not lead his minions into battle?"},{"name":"TEMPLEKIGHTGATE","text":"An audience with the lord commander? Yes, yes of course..."},{"name":"SCENE00020","text":"Proceed to the Seat of the Lord Commander?"},{"name":"SCENE00020","text":"Yes"},{"name":"SCENE00020","text":"No"}],"reward":{"gil":752,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67176]},"next":[67178,67441,67442]},"partials":[{"type":"npc","id":"1013227","obj":{"i":1013227,"n":"Alphinaud","l":2301,"q":4}},{"type":"npc","id":"1013183","obj":{"i":1013183,"n":"Aymeric","l":2335,"q":4}},{"type":"npc","id":"1011223","obj":{"i":1011223,"n":"Temple Knight Guard","l":2300,"q":7}},{"type":"npc","id":"1012580","obj":{"i":1012580,"n":"Tataru","l":2301,"q":5}},{"type":"npc","id":"1012585","obj":{"i":1012585,"n":"Alphinaud","l":2301,"q":2}},{"type":"npc","id":"1013229","obj":{"i":1013229,"n":"Estinien","l":2335,"q":1}},{"type":"npc","id":"1014316","obj":{"i":1014316,"n":"Lucia","l":2335,"q":1}},{"type":"npc","id":"1014527","obj":{"i":1014527,"n":"Alphinaud","l":2335,"q":1}},{"type":"quest","id":"67176","obj":{"i":67176,"n":"A Knight's Calling","g":3,"l":"Ishgard","s":65}},{"type":"quest","id":"67178","obj":{"i":67178,"n":"In Search of the Soleil","g":3,"l":"Ishgard","s":67}},{"type":"quest","id":"67441","obj":{"i":67441,"n":"A Full Stomach and Happy Heart","g":96,"l":"Ishgard","s":5701}},{"type":"quest","id":"67442","obj":{"i":67442,"n":"Unfulfilled Dreams","g":96,"l":"Ishgard","s":5702}}]}