{"quest":{"name":"An Engineering Enterprise","location":"Ishgard","id":67186,"patch":3.0,"sort":75,"icon":100425,"eventIcon":71201,"issuer":1013112,"target":1013162,"involved":[1011223,1013111,1013113,1013115,1013116,1013128,1013181,1013182,1013183,1013184,1013185],"genre":3,"journal":["Alphinaud appears relieved to be standing on solid ground once more.","Alphinaud has called a meeting to discuss how Azys Lla's defenses might be breached. Proceed to the Congregation of Our Knights Most Heavenly, and speak with the guardsman within to be admitted to the Seat of the Lord Commander.","Cid believes that it may be possible to pierce the barrier surrounding Azys Lla by mounting a ram of condensed aether on the <span class=\"emphasis\">Enterprise</span>. There is just one problem: he has not the faintest idea how to make one. Apparently, designing such a device would require the expertise of a true authority in the field─an authority such as an Archon. Even as Alphinaud laments their absence, Edmont recalls a discussion he had with Tataru, wherein she claimed to have acquired a clue pointing to the whereabouts of one of your missing comrades. Make your way to the Forgotten Knight and trouble her for the particulars.","Tataru confirms that she has made progress in the search for the Archons. Hearing this, you cannot help but smile. With your lost friends at your side, surely nothing will prevent you from reaching Azys Lla."],"objectives":["Speak with Aymeric at the Seat of the Lord Commander.","Speak with Tataru."],"dialogue":[{"name":"ALPHINAUD","text":"Assuming Cid is correct─and I have no reason to think that he is not─the Vanu's key is required to pass through the barrier protecting Azys Lla."},{"name":"ALPHINAUD","text":"But even without it, we must find a way to reach the isle. I shall have everyone convene at the Seat of the Lord Commander, that we might discuss how best to proceed."},{"name":"ALPHINAUD","text":"As before, make yourself known to the guardsman when you arrive, and he will show you in."},{"name":"CID","text":"For every day I spend in the sky, it feels as though I spend a week on the ground..."},{"name":"LUCIA","text":"What could be out there that would warrant the personal attention of the Emperor himself...?"},{"name":"WEDGE","text":"I wonder─does she have a name?"},{"name":"BIGGS","text":"Gods, just thinking about all the repairs we'll have to make is giving me a bleedin' headache..."},{"name":"TEMPLEKIGHTGATE","text":"Ah, you are returned! Ser Aymeric and the others await you within!"},{"name":"SCENE00008","text":"Proceed to the Seat of the Lord Commander?"},{"name":"SCENE00008","text":"Yes"},{"name":"SCENE00008","text":"No"},{"name":"ALPHINAUD","text":"Though we know little and less of Azys Lla, one thing is plain: the archbishop and the Garleans cannot be allowed to avail themselves of its secrets."},{"name":"CID","text":"I swear, wherever there's an Allagan ruin, there's trouble just waiting to happen. I suppose that's why they erected such damnably convoluted defenses around <span class=\"emphasis\">everything</span>..."},{"name":"LUCIA","text":"If the Empire has an interest in Azys Lla, we have all the more reason to hurry. I would not see its secrets fall into the hands of either the archbishop <span class=\"emphasis\">or</span> the Emperor."},{"name":"EDMONT","text":"Welcome back, my friend, and pray forgive me my earlier display. I grieve for my son still, and shall continue to do so, but I have resolved to be strong. It is what he would have wished."},{"name":"AYMERIC","text":"Think not of the cost. Whatever you require to modify the <span class=\"emphasis\">Enterprise</span>, you shall have it."},{"name":"TATARU","text":"Welcome back, <span class=\"highlight\">Forename</span>! How goes the mission? Did you manage to catch up with the archbishop and his cronies?"},{"name":"TATARU","text":"So, you finally arrived at Azys Lla...only to find your way barred by some sort of barrier... Typical."},{"name":"TATARU","text":"But it's not all bad news! I've made progress in the search for our friends! Don't worry, <span class=\"highlight\">Forename</span>─we'll get to Azys Lla yet!"},{"name":"ALPHINAUD","text":"She may not spend her days slaying primals, but Tataru is no less a Scion than you or me. Full oft has her knack for acquiring information proven vital to our endeavors."}],"reward":{"gil":533,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67185]},"next":[67187]},"partials":[{"type":"npc","id":"1013112","obj":{"i":1013112,"n":"Alphinaud","l":2301,"q":2}},{"type":"npc","id":"1013162","obj":{"i":1013162,"n":"Tataru","l":2300,"q":2}},{"type":"npc","id":"1011223","obj":{"i":1011223,"n":"Temple Knight Guard","l":2300,"q":7}},{"type":"npc","id":"1013111","obj":{"i":1013111,"n":"Cid","l":2301,"q":2}},{"type":"npc","id":"1013113","obj":{"i":1013113,"n":"Lucia","l":2301,"q":2}},{"type":"npc","id":"1013115","obj":{"i":1013115,"n":"Wedge","l":2301,"q":2}},{"type":"npc","id":"1013116","obj":{"i":1013116,"n":"Biggs","l":2301,"q":2}},{"type":"npc","id":"1013128","obj":{"i":1013128,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1013181","obj":{"i":1013181,"n":"Alphinaud","l":2335,"q":1}},{"type":"npc","id":"1013182","obj":{"i":1013182,"n":"Cid","l":2335,"q":1}},{"type":"npc","id":"1013183","obj":{"i":1013183,"n":"Aymeric","l":2335,"q":4}},{"type":"npc","id":"1013184","obj":{"i":1013184,"n":"Lucia","l":2335,"q":1}},{"type":"npc","id":"1013185","obj":{"i":1013185,"n":"Count Edmont De Fortemps","l":2335,"q":1}},{"type":"quest","id":"67185","obj":{"i":67185,"n":"One Good Turn","g":3,"l":"The Sea of Clouds","s":74}},{"type":"quest","id":"67187","obj":{"i":67187,"n":"Aetherial Trail","g":3,"l":"Ishgard","s":76}}]}