{"quest":{"name":"Black and the White","location":"The Sea of Clouds","id":67182,"patch":3.0,"sort":71,"eventIcon":71201,"issuer":1013096,"target":1014570,"involved":[1012064,1012070,1013084,1013123,1013124,1014571],"genre":3,"journal":["Alphinaud has that familiar look in his eye, which can mean only one thing...","Alphinaud asserts that the Heavens' Ward, wielding primal powers, are more than capable of slaying Bismarck. Therefore, the only way to ensure that the archbishop does not obtain the key to Azys Lla is to do so first. Before confronting the Vanu Vanu's patron deity, of course, it would only be prudent to learn more of its nature. Perhaps Lonu Vanu can furnish you with the information you require.","Lonu Vanu suggests that you speak with Kunu Vali, keeper of tales. He cautions you, however, that the keeper is the traditional sort─the kind of Vanu who is not given to speaking with those who neglect to greet her with a /bow.","Heeding your request, Kunu Vali recounts the tale of Bismarck's death at the hands of his brothers and of his heavenly rebirth. The keeper further explains that Bismarck is a merciful, loving being, who guided the Vanu to the islands in the Sea of Clouds─a depiction wholly at odds with his recent behavior. Seek out Alphinaud and share your findings with him and Cid.","Inspired by a comment of Alphinaud's on the subject of skyfishing, Cid conceives a plan to slay Bismarck. By towing a small island through the Sea of Clouds, he hopes to lure the ravenous primal out of hiding, and drag the beast in close with chains fired from dragonkillers. Should the plan succeed, you would be able to engage Bismarck directly─but should it fail, you and your allies would be at the creature's mercy. For want of a better idea, Alphinaud endorses the plan. Now all you need is an island..."],"objectives":["Speak with Lonu Vanu.","Greet Kunu Vali with a /bow.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"So Azys Lla is home to forbidden secrets, accessible only to the bearer of a key which the archbishop covets... Much as I would like to believe it safe within the belly of Bismarck, the knights of the Heavens' Ward wield primal powers. If we do not slay the whale and claim the key first, they surely will."},{"name":"ALPHINAUD","text":"Quite how we will go about it is another matter. As was the case in our battle with Leviathan, we are out of our element, and this time, we have far fewer allies to call upon... Be that as it may, our customary approach still holds true. We must begin by learning more about the White. Let us each question the residents of the village, then regroup and share our findings anon."},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"...Then the quantity of crystals needed to sustain Bismarck would exceed that consumed by Leviathan..."},{"name":"LONUVANU","text":"With every dawn, fewer and fewer remain, so great is the White's hunger..."},{"name":"CID","text":"Could we not just leave the key to the forbidden land in the island-eating whale's belly? I mean, I can think of worse places to keep it. ...No? I thought not."},{"name":"SONUVANU","text":"Seek not the birthplace of sin, netherlings. They who do find only death and ruin."},{"name":"LONUVANU","text":"If netherlings seek knowledge of the White, then speak with Kunu Vali, foremost keeper of tales."},{"name":"LONUVANU","text":"But neglect not to present self with humility and respect. As sun yields to moon and moon to sun, netherlings must greet Kunu Vali with a <span class=\"highlight\">bow</span>."},{"name":"LONUVANU","text":"Kunu Vali holds traditions in highest regard, and so must netherlings, if they wish to hear tales of the White."},{"name":"KUNUVALI","text":"What ill-mannered beast comes before Kunu Vali and begs to hear tales? None who deserve aught, that much she knows!"},{"name":"KUNUVALI","text":"Zephyr winds at your back and sunshine to warm your brow, traveler from below. Kunu Vali, keeper of tales, hears your words, and she remembers."},{"name":"KUNUVALI","text":"In times long ago, in lands elsewhere, before even the cloud sea, the White is one among many. Newborn, He swims beside His many brothers, in seas of endless water."},{"name":"KUNUVALI","text":"But hated, the White is, for His brothers are purest black. So great is their contempt, their loathing, that they turn upon Him and rend His flesh asunder. And so He falls, only to rise again, for merciful gods raise Him to the heavens, and there He is reborn."},{"name":"KUNUVALI","text":"The White still longs for the sea to which He cannot return. But in rebirth, a splinter of the divine is shared, and so He opens His maw, from whence come the clouds, and a new sea is born, home to Him alone."},{"name":"KUNUVALI","text":"Content, He gazes below, and sees others who are as He─hated and hunted. He weeps, and in His benevolence, He raises up isles of earth and guides these people to the cloud sea. Such is the tale of His rebirth, and the salvation of the Vanu. May it never be forgot."},{"name":"KUNUVALI","text":"But this demon which menaces the cloud sea...His rage is that of the Vundu, His hunger that of a wild beast. The isles are His gift to us─yet now He must consume them? Kunu Vali knows no tales like this."},{"name":"KUNUVALI","text":"The Lord of the Mists is merciful and kind─not so this demon..."},{"name":"ALPHINAUD","text":"So according to the Vanu Vanu, the Sea of Clouds and the floating isles were gifts from Bismarck to his people..."},{"name":"CID","text":"Gifts which he has taken to eating, yes. Technically within his rights, I suppose, if perhaps a little ungenerous. Gods, eh!? But what of you, Alphinaud? Did you learn aught of value?"},{"name":"ALPHINAUD","text":"Alas, no. That is, unless you have an interest in the intricacies of Vanu skyfishing..."},{"name":"CID","text":"Skyfishing...?<br>My gods, that's it! Alphinaud, my boy, I could kiss you!"},{"name":"CID","text":"From what we have observed, Bismarck is a creature of pure instinct, driven primarily by hunger. When wounded by the imperials, it fled─but not before devouring another island to restore its strength."},{"name":"CID","text":"What I propose is this: we tow a suitably appetizing island through the Sea of Clouds, in essence “fishing” for our flying whale."},{"name":"CID","text":"Once we draw Bismarck out of hiding, we shall use dragonkillers to fire grapnels into the beast's hide, and then reel it in close, enabling our resident eikon-slayer to engage it directly."},{"name":"ALPHINAUD","text":"A bold plan, Master Garlond─but an exceedingly dangerous one. Should <span class=\"highlight\">Forename</span> fail to subdue the creature, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would almost certainly be eaten, along with the rest of your “appetizing island.”"},{"name":"CID","text":"Oh, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> won't fail. And if anything does go wrong, I'll be at the helm of the <span class=\"emphasis\">Enterprise</span>, ready to tow <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> out of trouble. I wouldn't entrust a task like this to anyone else."},{"name":"ALPHINAUD","text":"Nor I. I trust you have no objections to my joining you as well?"},{"name":"CID","text":"Not at all, the more the merrier!"},{"name":"CID","text":"Right, then─it seems the boys and I have a lot of work to do if the <span class=\"emphasis\">Enterprise</span> is to be ready for our fishing trip, while you two need to find me some bait! And not just any island, mind─I want a mouthful at most!"},{"name":"CID","text":"Personally, I've seen enough of that flying feathered whale already..."}],"reward":{"gil":502,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67181]},"next":[67183,67443,67444,67445,67446,67447,67450,67451,67452]},"partials":[{"type":"npc","id":"1013096","obj":{"i":1013096,"n":"Alphinaud","l":2100,"q":1}},{"type":"npc","id":"1014570","obj":{"i":1014570,"n":"Alphinaud","l":2100,"q":2}},{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1012070","obj":{"i":1012070,"n":"Kunu Vali","l":2100,"q":2}},{"type":"npc","id":"1013084","obj":{"i":1013084,"n":"Alphinaud","l":2100,"q":2}},{"type":"npc","id":"1013123","obj":{"i":1013123,"n":"Lonu Vanu","l":2100,"q":1}},{"type":"npc","id":"1013124","obj":{"i":1013124,"n":"Cid","l":2100,"q":1}},{"type":"npc","id":"1014571","obj":{"i":1014571,"n":"Cid","l":2100,"q":2}},{"type":"quest","id":"67181","obj":{"i":67181,"n":"Devourer of Worlds","g":3,"l":"The Sea of Clouds","s":70}},{"type":"quest","id":"67183","obj":{"i":67183,"n":"Bolt, Chain, and Island","g":3,"l":"The Sea of Clouds","s":72}},{"type":"quest","id":"67443","obj":{"i":67443,"n":"Nutritious and Delicious","g":97,"l":"The Sea of Clouds","s":5701}},{"type":"quest","id":"67444","obj":{"i":67444,"n":"The Feast Must Go On","g":97,"l":"The Sea of Clouds","s":5702}},{"type":"quest","id":"67445","obj":{"i":67445,"n":"Sleepless in Ok' Zundu","g":97,"l":"The Sea of Clouds","s":5703,"f":1}},{"type":"quest","id":"67446","obj":{"i":67446,"n":"Flying the Nest","g":97,"l":"The Sea of Clouds","s":5711,"f":1}},{"type":"quest","id":"67447","obj":{"i":67447,"n":"Growing Pains","g":97,"l":"The Sea of Clouds","s":5712}},{"type":"quest","id":"67450","obj":{"i":67450,"n":"Ok' Zundu's Got Talent","g":97,"l":"The Sea of Clouds","s":5713}},{"type":"quest","id":"67451","obj":{"i":67451,"n":"Lazing Saddles","g":97,"l":"The Sea of Clouds","s":5714}},{"type":"quest","id":"67452","obj":{"i":67452,"n":"The Black Storm","g":97,"l":"The Sea of Clouds","s":5715}}]}