{"quest":{"name":"Devourer of Worlds","location":"The Sea of Clouds","id":67181,"patch":3.0,"sort":70,"icon":100422,"eventIcon":71201,"issuer":1013089,"target":1013095,"involved":[1013086,1013090,1013093,1013094,1013097,1014574],"genre":3,"journal":["Lonu Vanu would like very much for you to enjoy the hospitality of his village.","Out of gratitude to you and Alphinaud, Lonu Vanu invites you to his village, leaving before you can make your excuses. Consult with Alphinaud and decide whether to follow or not.","Surmising that the Vanu may know the whereabouts of the archbishop and the Heavens' Ward, Alphinaud suggests you accept Lonu Vanu's offer of hospitality. Journey to the north and seek out the Vanu youth.","Shortly after you and Alphinaud arrive in the Vanu village, the sound of cannon fire reverberates throughout the Sea of Clouds, sending everyone scrambling to search for the source. When Cid subsequently arrives, he explains that the imperials have engaged Bismarck, and together you turn your eyes heavensward even as the primal's massive body casts a shadow over all. Before your disbelieving eyes, Bismarck opens wide its great maw and swallows an island whole. At this, Lonu Vanu cries out with a mixture of rage and despair, but refuses to dwell on the actions of an unfathomable god, instead urging you to speak with Sonu Vanu, chieftain of the Zundu.","Chief Sonu reveals that the archbishop and the Heavens' Ward are come to the Sea of Clouds in search of the key to Azys Lla, a land of forbidden secrets. However, their quest has been complicated by the fact that Bismarck, the insatiable white whale, has devoured the island upon which the key was kept. Though some might think the belly of a primal an ideal repository for so dangerous an artifact, Alphinaud's expression makes it abundantly clear that he is not one of them."],"objectives":["Speak with Alphinaud.","Speak with Lonu Vanu."],"dialogue":[{"name":"LONUVANU","text":"Lonu Vanu owes much and more to netherlings. As saviors, as heroes, Zundu welcome you!"},{"name":"LONUVANU","text":"To village we go! To north! Come, come!"},{"name":"ALPHINAUD","text":"And so we live to fight another day..."},{"name":"CID","text":"Imperial troops? Here? Well, hopefully that's the last of them. We'll keep our eyes open, either way."},{"name":"WEDGE","text":"Garleans!? Understood. We'll send word to the Temple Knights."},{"name":"BIGGS","text":"All quiet here, <span class=\"highlight\">Forename</span>. No Vanu, no Garleans, nothing."},{"name":"ALPHINAUD","text":"So the Garleans were searching for the archbishop and believed that the Vanu Vanu knew something of his whereabouts."},{"name":"ALPHINAUD","text":"Methods notwithstanding, they may have had the right of it..."},{"name":"ALPHINAUD","text":"I conclude that we should accept Lonu Vanu's offer of hospitality, and visit his village."},{"name":"ALPHINAUD","text":"I want to believe Lonu Vanu is sincere in his intentions. Nevertheless, keep your eyes open, <span class=\"highlight\">Forename</span>."},{"name":"LONUVANU","text":"Like breeze guides leaves to rest, come and lay down your burdens, netherlings! Lonu Vanu throws wide arms in greeting! Behold─Ok' Zundu!"},{"name":"ALPHINAUD","text":"A far warmer welcome than the one you received from the Vundu, I think."},{"name":"LONUVANU","text":"Hah! Vundu bluster and blow hither and yon. Sound and fury, like aimless gale."},{"name":"LONUVANU","text":"Eh!? What unseen lightning begets such thunderous report!?"},{"name":"CID","text":"There you are! Did you see it!?"},{"name":"CID","text":"It's that damned flying whale again! The imperials are after it!"},{"name":"ALPHINAUD","text":"Where!?"},{"name":"LONUVANU","text":"The White!?"},{"name":"CID","text":"He's wounded!"},{"name":"ALPHINAUD","text":"By the Twelve... Did the beast just <span class=\"emphasis\">eat</span> that island!?"},{"name":"LONUVANU","text":"O insatiable White, O devourer of worlds! Why must You torment us!?"},{"name":"LONUVANU","text":"Bah! Lonu Vanu wastes no more words on His unfathomable deeds. Come, netherlings! Come and break words with chief of Zundu!"},{"name":"LONUVANU","text":"With wisdom deep as nethers and eyes clear as cloudless blue, Sonu Vanu speaks for Zundu. Hearken to his words!"},{"name":"LONUVANU","text":"Netherlings deliver Lonu Vanu from claws of steel-shod fiends and prove nobility. He knows not to ignore zephyr winds, and brings before you with all haste."},{"name":"SONUVANU","text":"Soft rains to soothe the heart and sunshine to warm. Gratitude of Sonu, chief of Zundu, is boundless."},{"name":"ALPHINAUD","text":"We are honored to meet you, Chief Sonu. I am Alphinaud Leveilleur, and these are my companions <span class=\"highlight\">Forename Surname</span> and Cid Garlond."},{"name":"ALPHINAUD","text":"We are come in search of an airship─a flying vessel of the nethers─which we believe is somewhere in the cloud sea."},{"name":"SONUVANU","text":"Ah, like to black steel-shod contraption from which you save Lonu Vanu?"},{"name":"ALPHINAUD","text":"Alas, no. That ship belongs to the Garlean Empire─an old enemy of ours...though not the enemy we are looking for at present."},{"name":"ALPHINAUD","text":"The men we seek wear armor of purest white, and are led by an older man in white robes."},{"name":"LONUVANU","text":"Wait! Lonu Vanu hear tell of these netherlings!"},{"name":"ALPHINAUD","text":"You do? Are you certain?"},{"name":"SONUVANU","text":"As sun rises and falls and returns, we are. Zundu scouts can testify to words of Lonu Vanu."},{"name":"LONUVANU","text":"Aye, aye! Winds carry purpose of netherlings to our ears as well. Netherlings seek key to Azys Lla!"},{"name":"CID","text":"Now we're getting somewhere! Tell us, Chief Sonu: what exactly is this “Azys Lla”?"},{"name":"SONUVANU","text":"Beware, netherlings, for blackest clouds portend greatest danger. Look not into heart of tempest. There lies ancient birthplace of sin, home of forbidden secrets. To speak more is to call the wind!"},{"name":"LONUVANU","text":"But the White devours isle where key is kept. Deep within bowels of mighty Bismarck, it lies, beyond reach of the foolhardy!"},{"name":"CID","text":"And beyond ours..."},{"name":"SONUVANU","text":"Rejoice not in His gluttony, Lonu Vanu, for as stone gives way to water and wind, all yields to the White."},{"name":"LONUVANU","text":"This he knows, Chief Sonu. Madness of Vundu bodes ill for all Vanu..."},{"name":"ALPHINAUD","text":"When you described it as a “flying feathered whale,” I naturally assumed you had taken some liberties..."},{"name":"CID","text":"It'll take a lot more than imperial cannons to bring that beast down..."}],"reward":{"gil":564,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67180]},"next":[67182]},"partials":[{"type":"npc","id":"1013089","obj":{"i":1013089,"n":"Lonu Vanu","l":2100,"q":2}},{"type":"npc","id":"1013095","obj":{"i":1013095,"n":"Lonu Vanu","l":2100,"q":1}},{"type":"npc","id":"1013086","obj":{"i":1013086,"n":"Cid","l":2100,"q":3}},{"type":"npc","id":"1013090","obj":{"i":1013090,"n":"Lonu Vanu","l":2100,"q":1}},{"type":"npc","id":"1013093","obj":{"i":1013093,"n":"Alphinaud","l":2100,"q":2}},{"type":"npc","id":"1013094","obj":{"i":1013094,"n":"Alphinaud","l":2100,"q":1}},{"type":"npc","id":"1013097","obj":{"i":1013097,"n":"Cid","l":2100,"q":1}},{"type":"npc","id":"1014574","obj":{"i":1014574,"n":"Alphinaud","l":2100,"q":1}},{"type":"quest","id":"67180","obj":{"i":67180,"n":"Familiar Faces","g":3,"l":"The Sea of Clouds","s":69}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}}]}