{"quest":{"name":"Familiar Faces","location":"The Sea of Clouds","id":67180,"patch":3.0,"sort":69,"icon":100421,"eventIcon":71201,"issuer":1013085,"target":1013089,"involved":[1013086,1013093,1014122],"genre":3,"journal":["Alphinaud has a mind to start searching the Blue Window.","Alphinaud declares that you two should begin searching the isles in earnest for the <span class=\"emphasis\">Soleil</span>. Follow him east and stand /lookout for the missing airship.","Though your vantage point affords an excellent view of the surrounding isles, you see nothing resembling the archbishop's airship. Proceed north and stand /lookout once more.","In the course of your search, you come upon a most unexpected sight: a unit of imperial troops surrounding a terrified Vanu Vanu. Before you can assess the situation, the troops mistake you for Ishgardians and attempt to seize you as well, apparently under the orders of “Lord van Hydrus.” With Alphinaud's help, you manage to defeat the Garleans, thus rescuing the Vanu prisoner.","Lonu Vanu, as he names himself, expresses his profound gratitude for your intervention. Though the presence of the imperials is an unfortunate development, the discovery that the Vanu here are not openly hostile to you and Alphinaud makes up for it."],"objectives":["Stand /lookout at the isle's eastern edge.","Stand /lookout farther to the north.","Speak with Lonu Vanu."],"dialogue":[{"name":"ALPHINAUD","text":"Assuming the <span class=\"emphasis\">Soleil</span> is here, I doubt she will come to us. We should begin searching the isles in earnest..."},{"name":"ALPHINAUD","text":"Of course, we must remain vigilant for Vanu scouts as well. I would rather avoid needless bloodshed."},{"name":"CID","text":"We'll keep the <span class=\"emphasis\">Enterprise</span> here for now, but if you need to head back to Ishgard, you can use that standard to signal for an Ironworks airship."},{"name":"CID","text":"Don't worry─we charted a route safe enough for others to fly...unless that primal shows up. But what are the odds of that, eh?"},{"name":"BIGGS","text":"The <span class=\"emphasis\">Enterprise</span> is ready to fly at a moment's notice. Just come running if you run afoul of something you can't handle."},{"name":"WEDGE","text":"We'll stay in touch with your Temple Knight friend, don't you worry!"},{"name":"SYSTEM","text":"You search the skies for the <span class=\"emphasis\">Soleil</span>, but see nothing resembling the missing airship."},{"name":"ALPHINAUD","text":"Gods, look at them. So many isles...so many places to hide. No, we must not lose hope. He is out there, <span class=\"highlight\">Forename</span>─and we <span class=\"emphasis\">will</span> find him."},{"name":"ALPHINAUD","text":"Mayhap this effort was doomed to failure..."},{"name":"LONUVANU","text":"(-???-)Begs mercy of netherlings! Does not fight! Does not wish to die!"},{"name":"ALPHINAUD","text":"Was that a Vanu being attacked? But by whom?"},{"name":"ALPHINAUD","text":"Over there!"},{"name":"ALPHINAUD","text":"Imperial troops!?"},{"name":"IMPERIALLEADER01644","text":"Ishgardians!? Seize them! They'll know where the archbishop is!"},{"name":"ALPHINAUD","text":"The enemy of my enemy... We've no choice. With me, <span class=\"highlight\">Forename</span>! Protect the Vanu!"},{"name":"LONUVANU","text":"Netherlings save Lonu Vanu from certain death! Showers netherlings with thanks like summer squall!"},{"name":"LONUVANU","text":"Lonu Vanu knows not what wind bears netherlings to cloud sea, but warmly welcomes them! Shows gratitude where gratitude is due!"},{"name":"ALPHINAUD","text":"And so we live to fight another day..."},{"name":"CID","text":"Imperial troops? Here? Well, hopefully that's the last of them. We'll keep an eye out for others."},{"name":"QIB","text":"Protect the unarmed Vanu Vanu!"},{"name":"CENTURIO","text":"Remember: Lord van Hydrus wants them <span class=\"emphasis\">alive</span>! That's an order!"},{"name":"ALPHINAUD","text":"Lord van Hydrus? Regula van Hydrus!?"},{"name":"CENTURIO","text":"What are you doing!? You're a disgrace to the VIth! Subdue these savages!"},{"name":"ALPHINAUD","text":"There's no end to them!"},{"name":"OBIETAVANUVANU","text":"No weapons to fight netherlings! No desire to die!"},{"name":"OBIETAVANUVANU","text":"Thunderous blows bring much pain! Blood flows, and does not stop! Blood flows!"},{"name":"ALPHINAUD","text":"Confound it..."},{"name":"OBIETAVANUVANU","text":"Drifts...rises...no more pain..."}],"reward":{"gil":595,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67179]},"next":[67181]},"partials":[{"type":"npc","id":"1013085","obj":{"i":1013085,"n":"Alphinaud","l":2100,"q":2}},{"type":"npc","id":"1013089","obj":{"i":1013089,"n":"Lonu Vanu","l":2100,"q":2}},{"type":"npc","id":"1013086","obj":{"i":1013086,"n":"Cid","l":2100,"q":3}},{"type":"npc","id":"1013093","obj":{"i":1013093,"n":"Alphinaud","l":2100,"q":2}},{"type":"npc","id":"1014122","obj":{"i":1014122,"n":"Alphinaud","l":2100,"q":1}},{"type":"quest","id":"67179","obj":{"i":67179,"n":"Into the Blue","g":3,"l":"Ishgard","s":68}},{"type":"quest","id":"67181","obj":{"i":67181,"n":"Devourer of Worlds","g":3,"l":"The Sea of Clouds","s":70}}]}