{"quest":{"name":"A Difference of Opinion","location":"The Sea of Clouds","id":67184,"patch":3.0,"sort":73,"eventIcon":71201,"issuer":1014575,"target":1012195,"involved":[1012064,1013099,1013100,1013102,1014564,1014573,1014622],"genre":3,"journal":["Alphinaud seems determined to put all thoughts of failure aside, and turn his mind to the struggles ahead.","You return with Alphinaud to the Zundu village, only to find it overrun with imperial troops. Their commanding officer, whom you quickly deduce to be Regula van Hydrus, hears your approach and demands you reveal yourselves. Seeing no other way to ensure the survival of the captured Vanu, you obey, and soon find yourself face-to-face with Varis zos Galvus, the newly crowned Emperor of Garlemald.<br><br>Recognizing you and Alphinaud on sight, the Emperor surmises that the Scions of the Seventh Dawn seek Azys Lla in order to learn how the Allagans bound primals to their will. Pricked by Varis's presumption, Alphinaud musters the courage to decry the Empire's actions, only to be brushed aside by the Emperor, who orders his men to execute the captive Vanu Vanu regardless. Yet before they can carry out his command, the soldiers are sent reeling by a sudden barrage of cannon fire, and Lucia, piloting a suit of magitek armor, rushes to your side. Alert to the danger, Regula orders an immediate withdrawal, covered by the guns of the imperial battleship overhead, and though the resulting smoke obscures their retreat, the Emperor's voice─and its promise of a reunion─is unmistakable.","Concerned that imperial troops may have attacked the <span class=\"emphasis\">Enterprise</span> as well, Alphinaud bids you return to Cid while he and Lucia inform the Zundu of Bismarck's demise. Return to the airship and confirm that all is well.","After learning that the engineers did not run afoul of the Garleans, you recount the tale of your meeting with the Emperor to Cid, who reacts more or less as you expected he would. Alphinaud and Lucia return shortly thereafter and inform you that, miraculously, no Zundu died in the imperial raid. Reasoning that Varis would have leveled the Vanu settlement by now if that were his intention, Alphinaud concludes that the Emperor has already fixed his sights on Azys Lla. Happily, repairs to the <span class=\"emphasis\">Enterprise</span> are complete, and the hunt for the archbishop can continue in earnest."],"objectives":["Speak with Alphinaud.","Speak with Cid."],"dialogue":[{"name":"ALPHINAUD","text":"Though we failed to secure the key, we must not forget that we succeeded in ridding the realm of another primal─and prevented the Vanu Vanu's lands from being consumed in so doing. The Zundu, at least, shall be glad of our deeds this day."},{"name":"ALPHINAUD","text":"Let us go and inform Chief Sonu of our victory. Cid and the others will need a moment to tend to the <span class=\"emphasis\">Enterprise</span>, besides."},{"name":"CID","text":"I know you're eager to get after the Heavens' Ward, but considering what we just put the old girl through, I'd say she's due a little tender loving care.<br>...Now, where did I put my hammer?"},{"name":"BIGGS","text":"As you'd expect, they flew off in the direction that beam was pointing. Bastards..."},{"name":"WEDGE","text":"The force generated by the beam was enough to displace the ship, and after comparing the data recorded by our fore and aft gyroscopes, I... Ahem. To cut a long story short, I think I've almost determined its heading."},{"name":"ALPHINAUD","text":"Never in my wildest dreams did I think I would stand less than twenty paces from the Emperor of Garlemald... Varis zos Galvus in the flesh..."},{"name":"ALPHINAUD","text":"I assume the commander that accompanied him must be the legatus of whom the centurion spoke..."},{"name":"ALPHINAUD","text":"Ah, forgive me. This is neither the time nor place for such idle speculation. Pray return to the <span class=\"emphasis\">Enterprise</span> at once. It occurs to me that our friends may have run afoul of imperial forces as well."},{"name":"ALPHINAUD","text":"I have yet to apprise Chief Sonu of all that has occurred, but once I have, we will rejoin you at the airship."},{"name":"ALPHINAUD","text":"If you fear for our safety, may I direct your attention to the suit of magitek armor nearby and its exceedingly capable pilot."},{"name":"LUCIA","text":"Ah, the armor? I had it sent here as a precautionary measure..."},{"name":"BIGGS","text":"Bugger me, did you see the size of that imperial battleship!?"},{"name":"WEDGE","text":"We saw it fire on the village! Are you all right, <span class=\"highlight\">Forename</span>!?"},{"name":"SONUVANU","text":"So they too are seekers of the forbidden secrets, these netherlings of black steel..."},{"name":"CID","text":"What the─!? Was that what I thought it was?"},{"name":"CID","text":"Thank the Twelve you're alive, <span class=\"highlight\">Forename</span>! When that battleship appeared and fired on the village, we feared the game was up for you and Alphinaud. What in the seven hells happened out there?"},{"name":"CID","text":"First the archbishop turns up with an Ascian in tow, and now the godsdamned <span class=\"emphasis\">Emperor</span> pays us a visit!? What is this, a procession of notable bastards? Who's next? The Keeper of the Seventh <span class=\"emphasis\">bloody</span> Gate!?"},{"name":"ALPHINAUD","text":"No one so “notable,” Master Garlond.<br>I am happy to report that the Zundu were overjoyed to learn of Bismarck's demise."},{"name":"ALPHINAUD","text":"Chief Sonu sends his warmest regards, <span class=\"highlight\">Forename</span>. There was much talk of westerly winds."},{"name":"LUCIA","text":"Miraculously, none suffered lasting harm during the raid. It would seem the Zundu were taken entirely unawares, and wisely chose to offer no resistance."},{"name":"ALPHINAUD","text":"I sense they have no more to fear from the Empire, for the present, at least. Had the Emperor truly been intent on their extermination, Ok' Zundu would already have been leveled. Plainly, Varis is only interested in reaching Azys Lla."},{"name":"CID","text":"Speaking of which, if you're all ready to continue the chase, the <span class=\"emphasis\">Enterprise</span> is as well. Shall we?"}],"reward":{"gil":658,"items":[{"id":12048}],"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67183]},"next":[67185,67700]},"partials":[{"type":"npc","id":"1014575","obj":{"i":1014575,"n":"Alphinaud","l":2100,"q":2}},{"type":"npc","id":"1012195","obj":{"i":1012195,"n":"Cid","l":2100,"q":1}},{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1013099","obj":{"i":1013099,"n":"Alphinaud","l":2100,"q":3}},{"type":"npc","id":"1013100","obj":{"i":1013100,"n":"Alphinaud","l":2100,"q":1}},{"type":"npc","id":"1013102","obj":{"i":1013102,"n":"Lucia","l":2100,"q":1}},{"type":"npc","id":"1014564","obj":{"i":1014564,"n":"Biggs","l":2100,"q":3}},{"type":"npc","id":"1014573","obj":{"i":1014573,"n":"Wedge","l":2100,"q":3}},{"type":"npc","id":"1014622","obj":{"i":1014622,"n":"Cid","l":2100,"q":2}},{"type":"item","id":"12048","obj":{"i":12048,"n":"Wind-up Cid","l":1,"c":59527,"t":81}},{"type":"quest","id":"67183","obj":{"i":67183,"n":"Bolt, Chain, and Island","g":3,"l":"The Sea of Clouds","s":72}},{"type":"quest","id":"67185","obj":{"i":67185,"n":"One Good Turn","g":3,"l":"The Sea of Clouds","s":74}},{"type":"quest","id":"67700","obj":{"i":67700,"n":"Three Beaks to the Wind","g":44,"l":"The Sea of Clouds","s":1,"f":1}}]}