{"quest":{"name":"Tataru's Surprise","location":"Gridania","id":67189,"patch":3.0,"sort":78,"icon":100426,"eventIcon":71201,"issuer":1012398,"target":1012398,"involved":[1000691,1000692,1006756,1012399],"genre":3,"journal":["Tataru needs you to fetch a few items for a crafting endeavor.","Tataru has been preparing a surprise for Y'shtola in anticipation of her return, and needs your help to finish it. She bids you retrieve two items in her stead─one from Geva at the Leatherworkers' Guild, and another from Brother E–Sumi–Yan at the Conjurers' Guild.","You have obtained the two items Tataru requested. Deliver them to her at the Carline Canopy.","Tataru receives the two items with thanks, and together you go and pay Y'shtola a visit. You arrive at the inn room to find your comrade awakened, and a touching reunion takes place. Back on her feet and briefed on the situation, Y'shtola flatly states that she lacks the knowledge to build an aetheric ram. However, she knows someone who could: her former master, Matoya."],"objectives":["Speak with Geva at the Leatherworkers' Guild.","Speak with E-Sumi-Yan at the Conjurers' Guild.","Deliver the items to Tataru at the Carline Canopy."],"dialogue":[{"name":"TATARU","text":"Y'shtola is resting within an inn room. Though she's still unconscious, the signs are positive."},{"name":"TATARU","text":"The conjurers say she is in sound health and should awaken before long! Isn't that wonderful?"},{"name":"TATARU","text":"Now, while we wait for Y'shtola to wake up, I thought I'd take the opportunity to finish my little surprise for her."},{"name":"TATARU","text":"It's something I've been working on for a while now, in the hope that she'd one day return to us. It wants for just a couple more items before it's ready."},{"name":"TATARU","text":"I've already placed orders for these items. Could I ask you to retrieve them for me? One is with the Leatherworkers' Guild and another is with the Conjurers' Guild. Speak with Mistress Geva and Brother E–Sumi–Yan, and they ought to take care of you!"},{"name":"ALPHINAUD","text":"Without the Seedseers' aid, Y'shtola may have been forever lost to us. I shall go to the Lotus Stand to offer them my heartfelt thanks."},{"name":"TATARU","text":"Please fetch the items I ordered. One is with the Leatherworkers' Guild and another is with the Conjurers' Guild. Speak with Mistress Geva and Brother E–Sumi–Yan, and they ought to take care of you!"},{"name":"YMHITRA","text":"I shall go to be with my sister at the Roost. My conjury skills should be of some use in caring for her."},{"name":"GEVA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. Looking for some hides to tan, mayhap?<br>...Hm? Here to retrieve an order for Mistress Tataru, you say?"},{"name":"GEVA","text":"What is it? I am a busy woman, so be quick about it. If you wish to place an order, speak with Randall.<br>...Hm? Here to <span class=\"emphasis\">retrieve</span> an order? For Mistress Tataru, you say?"},{"name":"GEVA","text":"You come at a good time─I finished it but moments ago. It was no small coup working it to her specifications, but I did it nonetheless. Payment has already been settled."},{"name":"GEVA","text":"However did that girl come by chimerical hide, anyway? You need either balls of steel or a bottomless coinpurse, and it seemed to me she had neither."},{"name":"GEVA","text":"However did that girl come by chimerical hide? You need either balls of steel or a bottomless coinpurse, and it seemed to me she had neither."},{"name":"ESUMIYAN","text":"Greetings, <span class=\"highlight\">Forename</span>. I trust you have been well. Is there aught you require of me?"},{"name":"ESUMIYAN","text":"You are come to Stillglade Fane, the home of the Conjurers' Guild. How may I assist you?"},{"name":"ESUMIYAN","text":"Ah, yes, Mistress Tataru's order. As requested, it has been sanctified in the sight of the elementals."},{"name":"ESUMIYAN","text":"I know not what she intends for the staff, but it is a most singular artifact. Even one possessed of my experience would struggle to wield it."},{"name":"ESUMIYAN","text":"I know not what Mistress Tataru intends for the staff, but it is a most singular artifact. Even one possessed of my experience would struggle to wield it."},{"name":"TATARU","text":"Ah, you're back! You have the items, I hope?"},{"name":"TATARU","text":"...Oooh, it's precisely as I requested─a perfect match for the other pieces! Truly, Geva is a master among masters!"},{"name":"TATARU","text":"And the staff completes the surprise! Thank you so much, <span class=\"highlight\">Forename</span>!"},{"name":"TATARU","text":"Tee hee, I can't wait to see what Y'shtola thinks of the surprise!"},{"name":"TATARU","text":"Lest you wonder, she's doing very well, and the conjurers have left her in her sister's care. Let's go and pay them a visit, shall we?"},{"name":"ALPHINAUD","text":"The Seedseers are gracious souls. It gives me heart to know that they are our allies."}],"reward":{"gil":658,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67188]},"next":[67190,67458,67459,67460,67461,67463,67464,67465,67466]},"partials":[{"type":"npc","id":"1012398","obj":{"i":1012398,"n":"Tataru","l":52,"q":3}},{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1012399","obj":{"i":1012399,"n":"Alphinaud","l":52,"q":3}},{"type":"quest","id":"67188","obj":{"i":67188,"n":"Lost in the Lifestream","g":3,"l":"Gridania","s":77}},{"type":"quest","id":"67190","obj":{"i":67190,"n":"Onward to Sharlayan","g":3,"l":"Gridania","s":79}},{"type":"quest","id":"67458","obj":{"i":67458,"n":"Getting a Legtrap Up","g":98,"l":"The Dravanian Forelands","s":5702}},{"type":"quest","id":"67459","obj":{"i":67459,"n":"Pest Control","g":98,"l":"The Dravanian Forelands","s":5703}},{"type":"quest","id":"67460","obj":{"i":67460,"n":"A Step in the Right Direction","g":98,"l":"The Dravanian Forelands","s":5704}},{"type":"quest","id":"67461","obj":{"i":67461,"n":"Garbage Duty","g":98,"l":"The Dravanian Forelands","s":5705}},{"type":"quest","id":"67463","obj":{"i":67463,"n":"Smells Like Team Spirit","g":98,"l":"The Dravanian Forelands","s":5707}},{"type":"quest","id":"67464","obj":{"i":67464,"n":"Smarter than the Average Beast","g":98,"l":"The Dravanian Forelands","s":5701}},{"type":"quest","id":"67465","obj":{"i":67465,"n":"From the Jaws of Hunger","g":98,"l":"The Dravanian Forelands","s":5709}},{"type":"quest","id":"67466","obj":{"i":67466,"n":"The Best Defense","g":98,"l":"The Dravanian Forelands","s":5708}}]}