{"quest":{"name":"Aetherial Trail","location":"Ishgard","id":67187,"patch":3.0,"sort":76,"eventIcon":71201,"issuer":1013162,"target":1012394,"involved":[1012389,1012390,1012391,1012392,1012393,1013128,1013157],"genre":3,"journal":["Tataru is eager to share her progress in the search for the missing Scions.","Tataru reveals that shortly after General Raubahn's reinstatement, she asked Marshal Tarupin to conduct a search of the watercourse beneath Ul'dah─the place you last saw Minfilia, Thancred, and Y'shtola. Pipin now sends word of a discovery, and asks that you come to the Hall of Flames.","At the Hall of Flames, Pipin produces Y'shtola's wand, retrieved from the rubble of the collapsed watercourse. Upon close inspection, Urianger divines that Y'shtola invoked a forbidden teleportation magick and was sent to an unknown location. In order to find her, you must follow the trail of her passage through the Lifestream, starting from the spot the spell was cast. Join Urianger at the Sil'dih excavation site, that you may begin the search.","According to Urianger, Y'shtola's trail leads to the Twelveswood, where she likely remains adrift in the Lifestream. He adds that no soul can survive for long in the midst of its restless currents. Realizing the urgency of the situation, Alphinaud resolves to petition the aid of the Elder Seedseer. Make haste to Gridania, and join Alphinaud at Nophica's Altar.","According to Alphinaud, only the elementals will be able to find Y'shtola within the Lifestream. And only their chosen people, the Padjal, will be able to ask this of them."],"objectives":["Speak with Pipin Tarupin at the Hall of Flames.","Speak with Urianger at the Sil'dih excavation site.","Speak with Alphinaud at Nophica's Altar."],"dialogue":[{"name":"TATARU","text":"When you fled the victory feast, you used the ancient watercourse beneath the city, right?"},{"name":"TATARU","text":"Well, shortly after things went back to normal in Ul'dah, I asked Marshal Tarupin to have the tunnels searched."},{"name":"ALPHINAUD","text":"A logical place to look... It was there that you lost contact with Minfilia, Thancred, and Y'shtola, was it not?"},{"name":"ALPHINAUD","text":"Dare I ask what the marshal found?"},{"name":"TATARU","text":"Um...I don't actually know. Pipin's message just said that there had been a discovery, and that we were to come to the Hall of Flames at our earliest convenience."},{"name":"ALPHINAUD","text":"I dare not think what it might be... We shall depart at once. Tataru─let Urianger know to join us in Ul'dah. He will wish to be present as well."},{"name":"TATARU","text":"Yes, sir!"},{"name":"ALPHINAUD","text":"She may not spend her days slaying primals, but Tataru is no less a Scion than you or me. Full oft has her knack for acquiring information proven vital to our endeavors."},{"name":"URIANGER","text":"As thou art returned to us, wherefore might our comrades not be the same? Never shall I concede them lost till I have seen proof of their passing."},{"name":"ALPHINAUD","text":"We are grateful for your assistance, Marshal Tarupin."},{"name":"PIPPIN","text":"You saved Her Grace and Father both. 'Tis the least I can do to repay you."},{"name":"TATARU","text":"Forgive me my impatience, Marshal, but your missive mentioned a discovery...?"},{"name":"PIPPIN","text":"Yes, of course. As per your request, I had my men scour the waterways. Almost immediately, we encountered a difficulty: an entire section of the tunnel had collapsed."},{"name":"PIPPIN","text":"With the Mineral Concern's cooperation, however, we were able to remove the rubble, which yielded the battered bodies of a dozen Crystal Braves."},{"name":"ALPHINAUD","text":"Go on..."},{"name":"PIPPIN","text":"Be at ease, Master Alphinaud─your friends were not among the deceased. That alone is cause for hope. And then there is this..."},{"name":"TATARU","text":"&lt;gasp&gt; Y'shtola's wand!"},{"name":"PIPPIN","text":"I had assumed as much."},{"name":"URIANGER","text":"If I may, Marshal..."},{"name":"URIANGER","text":"'Tis as I did surmise. Judging by the aetheric imprint that lingereth yet upon this wand, it hath assuredly been employed in the casting of a most uncommon magick."},{"name":"ALPHINAUD","text":"Namely?"},{"name":"URIANGER","text":"The very first that man did conceive to traverse great distances, and the ancient precursor to all methods of travel that utilize the Lifestream: <span class=\"emphasis\">Flow</span>."},{"name":"URIANGER","text":"The spell entaileth the reduction of the corporeal form into its constituent aether, that the caster might enter the Lifestream, and ride its currents thereby. Unlike the teleportation magicks of modern times, it requireth not a lengthy incantation. That Y'shtola should choose to employ such a spell bespeaketh the need for haste."},{"name":"ALPHINAUD","text":"All of which would suggest she managed to escape!"},{"name":"URIANGER","text":"Would that it were so simple. Know that the scholars of Sharlayan forbade the use of this spell─and with good reason."},{"name":"URIANGER","text":"The caster hath but limited control over his course. For every mage who came safe unto his destination, another would be set adrift in the Lifestream, never to emerge."},{"name":"TATARU","text":"<span class=\"emphasis\">What</span>? No! No, you can't mean..."},{"name":"URIANGER","text":"Be not downcast, my friends, for there is yet hope. 'Tis like that Y'shtola's passage hath left traces in the Lifestream. Could we but follow these from the point at which the magick was invoked, we may yet find her."},{"name":"ALPHINAUD","text":"To the Sil'dih excavation site, then. Our thanks for your aid, Marshal."},{"name":"PIPPIN","text":"Do not mention it. I shall pray for Lady Y'shtola's safe return."},{"name":"PIPPIN","text":"Would that I could be of more assistance, but our nation's resources are stretched thin. Be that as it may, do not hesitate to contact me if there is aught I can do."},{"name":"ALPHINAUD","text":"Simply being here calls to mind the events of that fateful day..."},{"name":"TATARU","text":"If our friends weren't in the tunnel, that must mean they're somewhere else!"},{"name":"URIANGER","text":"Evidence of Y'shtola's passage will have been made faint by time. But mayhap some few scant traces yet remain to guide our steps."},{"name":"URIANGER","text":"The trail leadeth to the north and east..."},{"name":"URIANGER","text":"...Unto the bosom of the Twelveswood."},{"name":"ALPHINAUD","text":"Are you certain?"},{"name":"URIANGER","text":"Aye, there is no mistake─thither hath Y'shtola journeyed."},{"name":"ALPHINAUD","text":"And yet the Gridanians have reported no sightings. We must take this to mean she is still adrift."},{"name":"URIANGER","text":"If it be so, I do fear for our friend. Contrary to its name, the Lifestream is more akin to a raging torrent. Linger overlong in the midst of this maelstrom, and the aether that formeth one's soul shall surely be scattered, ne'er to be reformed."},{"name":"ALPHINAUD","text":"We have no time to waste. Urianger─pray explore all possible options for reversing the effects of this forbidden magick. <span class=\"highlight\">Forename</span>, Tataru─we three shall press on to Gridania and petition the Elder Seedseer's aid."},{"name":"ALPHINAUD","text":"It is said that the elementals perceive the Lifestream. If, as we suspect, Y'shtola is still adrift in its midst, they may be able to find her. But if we are to appeal to them for assistance, we must needs do so through their chosen─the Padjal.<br>It is imperative therefore that we speak with Kan–E–Senna without delay."},{"name":"TATARU","text":"Hold on, Y'shtola! We're coming for you!"}],"reward":{"gil":1790,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67186]},"next":[67188]},"partials":[{"type":"npc","id":"1013162","obj":{"i":1013162,"n":"Tataru","l":2300,"q":2}},{"type":"npc","id":"1012394","obj":{"i":1012394,"n":"Alphinaud","l":53,"q":2}},{"type":"npc","id":"1012389","obj":{"i":1012389,"n":"Pipin","l":40,"q":1}},{"type":"npc","id":"1012390","obj":{"i":1012390,"n":"Urianger","l":40,"q":1}},{"type":"npc","id":"1012391","obj":{"i":1012391,"n":"Urianger","l":43,"q":1}},{"type":"npc","id":"1012392","obj":{"i":1012392,"n":"Alphinaud","l":43,"q":1}},{"type":"npc","id":"1012393","obj":{"i":1012393,"n":"Tataru","l":43,"q":1}},{"type":"npc","id":"1013128","obj":{"i":1013128,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1013157","obj":{"i":1013157,"n":"Tataru","l":53,"q":2}},{"type":"quest","id":"67186","obj":{"i":67186,"n":"An Engineering Enterprise","g":3,"l":"Ishgard","s":75}},{"type":"quest","id":"67188","obj":{"i":67188,"n":"Lost in the Lifestream","g":3,"l":"Gridania","s":77}}]}