{"quest":{"name":"Lost in the Lifestream","location":"Gridania","id":67188,"patch":3.0,"sort":77,"eventIcon":71201,"issuer":1012394,"target":1012398,"involved":[1000460,1003027,1006756,1012395,1012396,1012399,1013157],"genre":3,"journal":["Alphinaud is eager to petition the Elder Seedseer's aid in rescuing Y'shtola.","Alphinaud informs you that he has arranged an audience with the Elder Seedseer. Speak with the silent conjurer at Nophica's Altar to be admitted to the Lotus Stand.","Kan–E–Senna readily agrees to petition the elementals' aid in searching the Lifestream for Y'shtola. She warns, however, that the beings will need to be presented with aether that is akin to that of your missing comrade if they are to identify her. For a blessing, it would seem that a sister of Y'shtola's has taken up residence in Gridania. Ask Tataru for more information on the woman.","According to Tataru, Y'shtola's sister─a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">fellow Miqo'te</span></span> by the name of Y'mhitra─is often seen in the vicinity of Apkallu Falls. Seek her there.","Unsurprisingly, Y'mhitra agrees to cooperate in the search for her sister, and accompanies you to Everschade. A short while later, the Seedseers begin communing with the elementals, and with the ethereal beings' aid, they succeed in plucking Y'shtola from the Lifestream, insensible but alive. Kan-E-Senna duly orders her guards to bear your unconscious friend to the Roost to receive proper ministration. Make your own way there and rejoin Tataru.","Tataru cannot contain her joy at Y'shtola's return, and many happy tears are shed. All that remains now is to pray for her swift recovery."],"objectives":["Speak with Kan–E–Senna at the Lotus Stand.","Speak with Tataru.","Speak with Y'mhitra.","Speak with Tataru."],"dialogue":[{"name":"ALPHINAUD","text":"I have already requested an audience with the Elder Seedseer. She will receive us in the Lotus Stand presently. We need but speak with the conjurer yonder to be admitted."},{"name":"ALPHINAUD","text":"The Elder Seedseer is ready to receive us in the Lotus Stand. We need but speak with the conjurer yonder to be admitted."},{"name":"TATARU","text":"Hold on, Y'shtola! We're coming for you!"},{"name":"DOORMANLOTUS","text":"The Elder Seedseer awaits. Pray follow me."},{"name":"SCENE00007","text":"Proceed to the Lotus Stand?"},{"name":"SCENE00007","text":"Yes"},{"name":"SCENE00007","text":"No"},{"name":"KANESENNA","text":"Be welcome, my friends, and speak freely. I gather your suit will admit no delay."},{"name":"ALPHINAUD","text":"It will not, my lady. Pray forgive the abrupt nature of our request, but it is a matter of life and death."},{"name":"KANESENNA","text":"I see... As you say, we must needs act swiftly if we are to free Y'shtola from the ungentle pull of the Lifestream."},{"name":"KANESENNA","text":"And as you have surmised, we cannot do this unaided. However..."},{"name":"TATARU","text":"If memory serves, Y'shtola's sister is named Y'mhitra.<br>...Oh, you know her, do you? Well then, that ought to make things easier!"},{"name":"TATARU","text":"If memory serves, Y'shtola's sister is named Y'mhitra. She's supposed to be a member of the Sons of Saint Coinach."},{"name":"TATARU","text":"Anyway, she spends most of her time around Apkallu Falls, from what I recall. Let's look for her there!"},{"name":"YMHITRA","text":"You and your friends wish a word with me? Well, then...you had better bring your friends with you."},{"name":"ALPHINAUD","text":"I was not aware that Y'shtola had a family member here in Gridania. How very convenient. Forgive me... I have grown so accustomed to being laughed at by the fates, I cannot help but mistrust them when they smile on us. We must, of course, seek the woman out at once."},{"name":"DOORMANLOTUS","text":"The Elder Seedseer makes ready to reach out to the great ones. Pray see to your own preparations."},{"name":"YMHITRA","text":"Greetings, <span class=\"highlight\">Forename</span>. What brings you here today? I see that you have companions."},{"name":"YMHITRA","text":"Yes? Is there something you require?"},{"name":"ALPHINAUD","text":"Lady Y'mhitra, it is an honor to meet you. My name is Alphinaud Leveilleur, and this is Tataru Taru."},{"name":"YMHITRA","text":"So you are my sister's comrades in the Scions of the Seventh Dawn."},{"name":"YMHITRA","text":"When I heard that your people were being pursued, I desperately sought to reach Shtola, but all mine efforts were to no avail. Now I know why. A forbidden spell, of all things! That she should be so reckless..."},{"name":"YMHITRA","text":"But what's done is done. I thank you for bringing word to me. Needless to say, I should be glad to help."},{"name":"YMHITRA","text":"Though we were born of different mothers, our veins course with the same father's blood. I hope that this will be enough for the elementals. Come, let us make for Everschade at once."},{"name":"TATARU","text":"&lt;sniff&gt; &lt;sniff&gt; Oh, Y'shtola..."},{"name":"TATARU","text":"Just seeing her face again... It's... &lt;sniff&gt; Oh, I've been so worried..."},{"name":"ALPHINAUD","text":"Let us pray that Y'shtola awakens."},{"name":"YMHITRA","text":"I shall go to be with my sister at the Roost. My conjury skills should be of some use in caring for her."}],"reward":{"gil":720,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67187]},"next":[67189]},"partials":[{"type":"npc","id":"1012394","obj":{"i":1012394,"n":"Alphinaud","l":53,"q":2}},{"type":"npc","id":"1012398","obj":{"i":1012398,"n":"Tataru","l":52,"q":3}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1003027","obj":{"i":1003027,"n":"Kan-E-Senna","l":347,"q":9}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1012395","obj":{"i":1012395,"n":"Alphinaud","l":53,"q":4}},{"type":"npc","id":"1012396","obj":{"i":1012396,"n":"Tataru","l":53,"q":1}},{"type":"npc","id":"1012399","obj":{"i":1012399,"n":"Alphinaud","l":52,"q":3}},{"type":"npc","id":"1013157","obj":{"i":1013157,"n":"Tataru","l":53,"q":2}},{"type":"quest","id":"67187","obj":{"i":67187,"n":"Aetherial Trail","g":3,"l":"Ishgard","s":76}},{"type":"quest","id":"67189","obj":{"i":67189,"n":"Tataru's Surprise","g":3,"l":"Gridania","s":78}}]}