{"quest":{"name":"The First Flight of the Excelsior","location":"Ishgard","id":67199,"patch":3.0,"sort":88,"icon":100430,"eventIcon":71201,"issuer":1012430,"target":1012792,"involved":[1007478,1012431,1012432,1012789,1012790,1012791,1012793,1012851,1012852,1012853,1012854,1012855,1012856,1013166,1013176,1013268,1014562,1015138],"genre":3,"journal":["The game will soon be afoot, and Alphinaud is keen to assemble the players.","With work on the <span class=\"emphasis\">Enterprise</span> nearing completion, Alphinaud bids you tell Y'shtola to make ready for departure.","You find Y'shtola in uncommonly good cheer─in stark contrast to Estinien, who seems to take her positivity as a personal affront. As you look on bemused, a tense exchange ensues in which Y'shtola warns Estinien that the Eye will consume him given the slightest opportunity. Of course, the dragoon is having none of it. As he strides off, Urianger arrives bearing a gift of white auracite, found among Moenbryda's last effects, thus rounding off your unexpectedly eventful errand. Rejoin Alphinaud at the airship landing.","You inform Alphinaud of the party's readiness to set forth. The time has come to journey to the stage of the final battle─Azys Lla.","You take your place aboard the new and improved <span class=\"emphasis\">Enterprise Excelsior</span>, and after a journey of what feels like mere moments, gain sight of Azys Lla. As promised, the newly installed aetheric ram makes short work of the Allagan barrier, but you have no time to celebrate, as an imperial battleship appears in your wake and opens fire. Hopelessly outmatched, you prepare for the end, only to spy Ysayle riding to the rescue upon Hraesvelgr's back. Transforming into Shiva, she engages the enemy battleship single-handed, and succeeds in incapacitating it at the cost of her own life.<br><br>When you subsequently arrive in Azys Lla, you say a silent prayer for the allies who have paid the ultimate price that you might fight on.","All are determined that Ysayle's sacrifice should not be in vain. Join your companions at the dome-like structure, and ask Cid for further instructions.","Cid declares the area safe, and calls a meeting to discuss the next step."],"objectives":["Speak with Y'shtola.","Speak with Alphinaud to journey to Azys Lla.","Speak with Cid."],"dialogue":[{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames).”"},{"name":"SYSTEM","text":"You may accept the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames)” by speaking with R'ashaht Rhiki at Maelstrom CommandVorsaile Heuloix at the Adders' NestCommander Swift at the Hall of Flames."},{"name":"ALPHINAUD","text":"Work on the <span class=\"emphasis\">Enterprise</span> is nearly complete. Let Y'shtola know to make ready."},{"name":"ALPHINAUD","text":"Work on the <span class=\"emphasis\">Enterprise</span> is nearly complete. Let Y'shtola know to make ready."},{"name":"AYMERIC","text":"Do whatever you must to end my father's madness. May the Fury watch over you, my friend."},{"name":"NOTRELCHAMPS","text":"Most folk know Master Garlond as a genius inventor. It's only when you come to work for him that you realize he's a godsdamned <span class=\"emphasis\">tyrant taskmaster</span>. Just, uh...don't tell him I said that, all right?"},{"name":"YSHTOLA","text":"I know naught of the archbishop and his knights save that which you have told me─but if they truly possess the power of primals <span class=\"emphasis\">and</span> the secrets of Azys Lla, they are dangerous foes indeed. We must spare no preparation."},{"name":"ESTINIEN","text":"Azure wings to bear us to the final battle... I must admit there is poetry to it."},{"name":"URIANGER","text":"That which man thinketh a trifle in the having, he mourneth as a treasure in the losing. A tired platitude, but one which shall haunt me unto my dying day."},{"name":"URIANGER","text":"That which man thinketh a trifle in the having, he mourneth as a treasure in the losing. A tired platitude, but one which shall haunt me unto my dying day."},{"name":"ESTINIEN","text":"The revelations of recent days may have overturned the foundations of my faith, but my purpose remains unchanged: ending this damnable war."},{"name":"ALPHINAUD","text":"Let us go, <span class=\"highlight\">Forename</span>! Azys Lla awaits!"},{"name":"CID","text":"Whew... I don't know about you, but I'm glad to be back on solid ground─even if said ground is floating in the sky."},{"name":"CID","text":"When that imperial battleship appeared, I honestly thought we were finished. And we would have been, had your friend not arrived when she did."},{"name":"ALPHINAUD","text":"Twelve grant her mercy...<br>Brief though our time together was, Ysayle was a true friend─a gentle soul who fought for her beliefs. She...she would have made a fine Scion."},{"name":"YSHTOLA","text":"What is a Scion but one who fights for our cause? Our hopes survive thanks to her sacrifice. Let that be enough."},{"name":"YSHTOLA","text":"Yet I cannot help but wonder: how came she to know of our presence here?"},{"name":"ESTINIEN","text":"From Hraesvelgr, I would wager. He will have felt my channeling of the Eye's power."},{"name":"ESTINIEN","text":"It would seem they were able to make peace with one another in the end."},{"name":"CID","text":"She gave her life because she believed in us. We owe it to her to see our mission through."},{"name":"CID","text":"See that dome-like structure further in? Let's make our way there."},{"name":"ALPHINAUD","text":"Ysayle... I cannot believe she is gone..."},{"name":"YSHTOLA","text":"The Echo is a gift and a burden both...as you know only too well."},{"name":"ESTINIEN","text":"Though we walked opposing paths, Iceheart was a worthy woman. Her deeds will not soon be forgotten."},{"name":"BIGGS","text":"Taking on an imperial battleship by herself... Primal or no, that took some courage."},{"name":"WEDGE","text":"I-I wasn't afraid! N-Not in the least! ...Pardon? What smell? &lt;sniff&gt; ...Oh gods, someone's spilled something down my trousers!"},{"name":"CID","text":"The isle's sentinels don't seem to frequent this area. We should be safe here."},{"name":"CID","text":"Let's talk strategy, shall we?"},{"name":"BIGGS","text":"It's still active─all of it..."},{"name":"WEDGE","text":"Crikey... This place is like something out of my dreams..."},{"name":"ALPHINAUD","text":"Cid is right. We owe it to Ysayle to see the mission through."},{"name":"ESTINIEN","text":"I sense an ominous presence..."},{"name":"YSHTOLA","text":"Heavy though our hearts may be, we must forge on─in the name of those we have lost."}],"reward":{"gil":930,"xp":86400},"reqs":{"jobs":[{"lvl":59,"id":142}],"quests":[67198]},"next":[67200]},"partials":[{"type":"npc","id":"1012430","obj":{"i":1012430,"n":"Alphinaud","l":2301,"q":2}},{"type":"npc","id":"1012792","obj":{"i":1012792,"n":"Cid","l":2101,"q":2}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1012431","obj":{"i":1012431,"n":"Y'shtola","l":2301,"q":2}},{"type":"npc","id":"1012432","obj":{"i":1012432,"n":"Estinien","l":2301,"q":2}},{"type":"npc","id":"1012789","obj":{"i":1012789,"n":"Alphinaud","l":2101,"q":2}},{"type":"npc","id":"1012790","obj":{"i":1012790,"n":"Estinien","l":2101,"q":2}},{"type":"npc","id":"1012791","obj":{"i":1012791,"n":"Y'shtola","l":2101,"q":2}},{"type":"npc","id":"1012793","obj":{"i":1012793,"n":"Biggs","l":2101,"q":2}},{"type":"npc","id":"1012851","obj":{"i":1012851,"n":"Alphinaud","l":2101,"q":1}},{"type":"npc","id":"1012852","obj":{"i":1012852,"n":"Estinien","l":2101,"q":1}},{"type":"npc","id":"1012853","obj":{"i":1012853,"n":"Y'shtola","l":2101,"q":1}},{"type":"npc","id":"1012854","obj":{"i":1012854,"n":"Cid","l":2101,"q":1}},{"type":"npc","id":"1012855","obj":{"i":1012855,"n":"Biggs","l":2101,"q":1}},{"type":"npc","id":"1012856","obj":{"i":1012856,"n":"Wedge","l":2101,"q":1}},{"type":"npc","id":"1013166","obj":{"i":1013166,"n":"Aymeric","l":2301,"q":2}},{"type":"npc","id":"1013176","obj":{"i":1013176,"n":"Notrelchamps","l":2301,"q":3}},{"type":"npc","id":"1013268","obj":{"i":1013268,"n":"Wedge","l":2101,"q":2}},{"type":"npc","id":"1014562","obj":{"i":1014562,"n":"Urianger","l":2301,"q":1}},{"type":"npc","id":"1015138","obj":{"i":1015138,"n":"Estinien","l":2301,"q":1}},{"type":"quest","id":"67198","obj":{"i":67198,"n":"Hour of Departure","g":3,"l":"Ishgard","s":87}},{"type":"quest","id":"67200","obj":{"i":67200,"n":"Systematic Exploration","g":3,"l":"Azys Lla","s":89}}]}