{"quest":{"name":"An Eye for Aether","location":"Matoya's Cave","id":67197,"patch":3.0,"sort":86,"eventIcon":71201,"issuer":1012138,"target":1013163,"involved":[1012380,1012422,1012423,1012424,1012425,1013164,1013165,1013167,1013176],"genre":3,"journal":["Matoya's gaze is firmly fixed upon her tome.","After a moment's reflection, Matoya deciphers the contents of the tome, that Cid might avail himself of her research and build the aetheric ram. However, the question of an energy source remains. Even as you mull over the dilemma, Alphinaud has an epiphany: the Eye is a boundless source of aether! ...But will Estinien relinquish it? Ask Alphinaud how he means to proceed.","Alphinaud intends to consult Ser Aymeric on the possibility of borrowing the Eye. Make your way back to Ishgard, and speak with the lord commander at the Congregation of Our Knights Most Heavenly.","Aymeric agrees to speak with Estinien on the matter of the Eye. While he does so, seek out Cid at the airship landing and share with him the knowledge of the aetheric converger.","With the knowledge to build the aetheric ram finally at his disposal, and a suitable energy source secured, Cid sets to work with obvious relish."],"objectives":["Speak with Alphinaud.","Speak with Aymeric at the Congregation of Our Knights Most Heavenly.","Speak with Cid at the airship landing in Ishgard."],"dialogue":[{"name":"ALPHINAUD","text":"Thanks to your customarily heroic efforts, we now possess the knowledge to build an aetheric ram."},{"name":"ALPHINAUD","text":"All that remains is to secure its energy source. Let us hasten back to Ishgard and consult Ser Aymeric regarding the Eye."},{"name":"ALPHINAUD","text":"Ahem... Despite how it may have sounded, I do not exaggerate when I say it was a tremendous learning experience to observe one of Master Matoya's familiars. The insights I acquired, I shall put to good use."},{"name":"YSHTOLA","text":"'Tis well that you were able to retrieve the tome. Had you failed, Master Matoya planned to have us take dictation while she quoted its contents from memory."},{"name":"YSHTOLA","text":"(As if you could conceal it...from her of all people...) Hm? Pay me no mind. I was but thinking aloud."},{"name":"AYMERIC","text":"Ah, you are returned!"},{"name":"ALPHINAUD","text":"Ser Aymeric, I am pleased to see that your recovery proceeds apace. May I introduce Y'shtola, a fellow Scion of the Seventh Dawn and Archon of Sharlayan."},{"name":"YSHTOLA","text":"My lord. Pray excuse me for forgoing due pleasantries, but we seek your counsel regarding the aetheric ram. Though we now possess the knowledge to build such a device, we yet lack an appropriate source of energy with which to power it. We believe, however, that Ishgard may possess the solution to our problem."},{"name":"AYMERIC","text":"You need not apologize, my lady. Full eager am I to learn of your progress. Please, tell me of this energy source that you believe we possess."},{"name":"AYMERIC","text":"...And you are certain that the Eye can lend its power to Master Matoya's aetheric converger?"},{"name":"ALPHINAUD","text":"At Estinien's command─yes."},{"name":"AYMERIC","text":"Very well. I shall speak with him."},{"name":"ALPHINAUD","text":"My thanks, Ser Aymeric."},{"name":"AYMERIC","text":"Nay, my friend, 'tis I who should thank you─as should every Ishgardian. You labor in our name, with nary a care for your own safety."},{"name":"ALPHINAUD","text":"Let us next speak with Cid. He will doubtless be eager to begin work on the aetheric ram."},{"name":"AYMERIC","text":"I shall personally relay your proposal to Estinien. If that which you ask is possible, you may be assured of his cooperation. My thanks again, <span class=\"highlight\">Forename</span>."},{"name":"LUCIA","text":"I am glad that you and yours are safe."},{"name":"CID","text":"Ah, you're back! The preliminary work on the <span class=\"emphasis\">Enterprise</span> is more or less finished. Tell me you found a way to build the aetheric ram!"},{"name":"YSHTOLA","text":"Greetings, Cid. It has been a while."},{"name":"YSHTOLA","text":"This tome contains the fruits of my former master's research on a device known as an aetheric converger. Our ram should operate on the selfsame principle."},{"name":"CID","text":"Ack, where are my manners? Put a toy like this in my hand, and I go off into my own world... Gods, it's good to see you! And bearing a gift besides─a very distracting one, if I might add! If I didn't know better, I'd think it was my nameday.<br>...But there will be time for tearful reunions later. I'll make a start on the tome right away. So long as I have a grasp of the fundamentals, I should be able to knock something together. Which leaves the small matter of the energy source..."},{"name":"ALPHINAUD","text":"We believe we have found a solution to that problem as well."},{"name":"AYMERIC","text":"Pray forgive us our lateness."},{"name":"ESTINIEN","text":"The power of the Eye is not to be drawn upon lightly, but I believe we have sufficient cause to do so."},{"name":"YSHTOLA","text":"So this is the fabled Eye... By the Twelve...it <span class=\"emphasis\">seethes</span>. 'Tis a wonder such power can be contained, much less controlled..."},{"name":"CID","text":"Boys! Our friends have kindly provided all the ingredients. Let's see if we can't make something out of them!"},{"name":"BIGGS","text":"You heard the chief! We're not resting till the aetheric ram is operational! Not one wink of sleep!"},{"name":"WEDGE","text":"Oh... &lt;mumble&gt; &lt;mumble&gt; ...ing cart chocobo."},{"name":"WEDGE","text":"A bit of sleep deprivation won't kill me, I suppose. But if it does...well, then I'll have all the sleep I want, and the joke will be on Biggs!"},{"name":"BIGGS","text":"What do you think? Looks like a different ship, doesn't she?"},{"name":"NOTRELCHAMPS","text":"Most folk know Master Garlond as a genius inventor. It's only when you come to work for him that you realize he's a godsdamned <span class=\"emphasis\">tyrant taskmaster</span>. Just, uh...don't tell him I said that, all right?"}],"reward":{"gil":737,"xp":86400},"reqs":{"jobs":[{"lvl":59,"id":142}],"quests":[67196]},"next":[67198,67508,67509,67510,67511,67512,67513,67514]},"partials":[{"type":"npc","id":"1012138","obj":{"i":1012138,"n":"Matoya","l":2036,"q":7}},{"type":"npc","id":"1013163","obj":{"i":1013163,"n":"Cid","l":2301,"q":1}},{"type":"npc","id":"1012380","obj":{"i":1012380,"n":"Aymeric","l":2300,"q":5}},{"type":"npc","id":"1012422","obj":{"i":1012422,"n":"Alphinaud","l":2001,"q":4}},{"type":"npc","id":"1012423","obj":{"i":1012423,"n":"Y'shtola","l":2001,"q":4}},{"type":"npc","id":"1012424","obj":{"i":1012424,"n":"Alphinaud","l":2036,"q":2}},{"type":"npc","id":"1012425","obj":{"i":1012425,"n":"Y'shtola","l":2036,"q":2}},{"type":"npc","id":"1013164","obj":{"i":1013164,"n":"Wedge","l":2301,"q":1}},{"type":"npc","id":"1013165","obj":{"i":1013165,"n":"Biggs","l":2301,"q":1}},{"type":"npc","id":"1013167","obj":{"i":1013167,"n":"Lucia","l":2300,"q":10}},{"type":"npc","id":"1013176","obj":{"i":1013176,"n":"Notrelchamps","l":2301,"q":3}},{"type":"quest","id":"67196","obj":{"i":67196,"n":"Forbidden Knowledge","g":3,"l":"Matoya's Cave","s":85}},{"type":"quest","id":"67198","obj":{"i":67198,"n":"Hour of Departure","g":3,"l":"Ishgard","s":87}},{"type":"quest","id":"67508","obj":{"i":67508,"n":"Moogles in the Sky","g":96,"l":"Ishgard","s":5901}},{"type":"quest","id":"67509","obj":{"i":67509,"n":"Classic Misdirection","g":100,"l":"The Churning Mists","s":5901}},{"type":"quest","id":"67510","obj":{"i":67510,"n":"A Tale of Two Moogles","g":97,"l":"The Sea of Clouds","s":5901}},{"type":"quest","id":"67511","obj":{"i":67511,"n":"Birds of a Feather","g":97,"l":"The Sea of Clouds","s":5902}},{"type":"quest","id":"67512","obj":{"i":67512,"n":"An Eggcellent Disguise","g":97,"l":"The Sea of Clouds","s":5903}},{"type":"quest","id":"67513","obj":{"i":67513,"n":"The Skies That Bind","g":97,"l":"The Sea of Clouds","s":5904}},{"type":"quest","id":"67514","obj":{"i":67514,"n":"A Moogle by Any Other Name","g":100,"l":"The Churning Mists","s":5902}}]}