{"quest":{"name":"A Great New Nation","location":"The Dravanian Forelands","id":67191,"patch":3.0,"sort":80,"icon":100427,"eventIcon":71201,"issuer":1012406,"target":1012097,"involved":[1012405,1012409,1012410,1013159,1013160],"genre":3,"journal":["Y'shtola is ready to press on westward to the Dravanian hinterlands.","The Dravanian hinterlands lie west of Tailfeather, and getting there requires that you travel through Gnath-held territory. Proceed with caution as you continue on your way to Sharlayan.","You have arrived in the Dravanian hinterlands. According to Y'shtola, Matoya dwells on the other side of the Thaliak River. Look for a place to cross to the opposite bank.","As you make your way through the ruins of Sharlayan, you encounter a band of goblins. The confrontation threatens to turn violent, but Alphinaud manages to defuse the situation by convincing the goblin leader, Slowfix, that your purpose is peaceful. In an abrupt change of tone, Slowfix offers to take you on a tour. Follow the goblin to the heart of the settlement and speak with him there.","You learn that the goblins mean to found a new nation here in Sharlayan, aided by treasure hunters who have come seeking the city's artifacts. In exchange for passage through the settlement, Slowfix asks that you help the denizens of Idyllshire with the myriad problems they face. For want of an alternate way to cross the Thaliak River, you decide to oblige the goblin."],"objectives":["Journey into the Dravanian hinterlands.","Find a place to cross the Thaliak River.","Speak with Slowfix."],"dialogue":[{"name":"YSHTOLA","text":"I believe I am sufficiently rested. Let us continue west to Sharlayan."},{"name":"YSHTOLA","text":"Once we descend the mountain path, we will arrive at the Dravanian hinterlands. From there, it is but a short distance to the city."},{"name":"YSHTOLA","text":"Be warned that we shall be passing through Gnath territory. We must needs be wary of them and the dragons both."},{"name":"ALPHINAUD","text":"When last we set foot here, Estinien and Ysayle were with us. Though it was not all that long ago, I find myself strangely taken by nostalgia."},{"name":"YSHTOLA","text":"Matoya dwells on the far side of the Thaliak River. Let us search for a crossing."},{"name":"YSHTOLA","text":"The bridge ahead is collapsed; I am afraid we shan't be crossing there. But worry not, I know another way."},{"name":"YSHTOLA","text":"See you the towering structure to the north? We should be able to cross there."},{"name":"ALPHINAUD","text":"But fifteen years abandoned, and already Sharlayan has fallen into such disarray... Verily, a city is no more than its inhabitants."},{"name":"YSHTOLA","text":"“Knowledge Seeks No Man”... So says the motto of Sharlayan engraved upon yonder stone. The meaning is simple: it falls to us to seek enlightenment."},{"name":"YSHTOLA","text":"During the Sixth Astral Era, at the turn of the thirteenth century, men from the northern nation of Sharlayan journeyed across the seas to Eorzea in search of knowledge."},{"name":"YSHTOLA","text":"Upon arriving at these shores, they established a camp for their scholarly endeavors. Over time, this camp grew into a settlement, and the settlement prospered, and so much so that it came to be counted amongst Eorzea's great city–states."},{"name":"YSHTOLA","text":"Alas, those glory days are now but a fading memory. With her keepers lost to her, Sharlayan has become an empty husk of her former self."},{"name":"SLOWFIX","text":"(-???-)Pshkohhh... Uplander is mistaken. Sharlayan has new keepers, is on cusp of new age of glory!"},{"name":"ALPHINAUD","text":"Goblins? Here to plunder the city!?"},{"name":"SLOWFIX","text":"(-Well-spoken Goblin-)&lt;gasp&gt; Uplander is mistaken muchly! We are not thieves! This place is our home!"},{"name":"YSHTOLA","text":"<span class=\"emphasis\">Your</span> home? When last I looked, it was mine and Alphinaud's. We were <span class=\"emphasis\">born</span> here."},{"name":"SLOWFIX","text":"(-Well-spoken Goblin-)Pssshmph! When uplanders abandoned city, uplanders gave up claim. Born here or no, uplanders are trespassers!"},{"name":"ALPHINAUD","text":"My friends, please. We did not come to dispute your claim to this land. Our purpose here is peaceful: we desire but to cross the river."},{"name":"ALPHINAUD","text":"Be calm, I beg you, and let us speak like the civilized folk that we are. Surely we can come to a mutual understanding."},{"name":"SLOWFIX","text":"Pssshkoh... If that is truth, then uplanders are welcome here. Come with Slowfix─Slowfix will show uplanders settlement."},{"name":"SLOWFIX","text":"Pshkohhh... Here is heart of settlement, name of Idyllshire!"},{"name":"MIDNIGHTDEW","text":"What've we got here? Guests?"},{"name":"ALPHINAUD","text":"Greetings to you. I am Alphinaud Leveilleur, and may I introduce my companions, <span class=\"highlight\">Forename Surname</span> and Y'shtola. We have journeyed far in search of a friend, and seek to cross the river."},{"name":"MIDNIGHTDEW","text":"But findin' the main bridge collapsed, you went lookin' for a detour, and ended up stumblin' into Slowfix and his crew. Is that right?"},{"name":"YSHTOLA","text":"That is the short of it, aye. This place, Idyllshire─I came expecting a ghost town; suffice it to say I am surprised to find it so alive."},{"name":"MIDNIGHTDEW","text":"Well, with all them precious artifacts lyin' about, 'twas only a matter of time afore treasure hunters like me moved in. But we weren't the first to arrive, neither. By then, Slowfix and his gobbie friends were already settled."},{"name":"SLOWFIX","text":"At first, gobbies and hunters disliked each other. But understanding came, then friendship. Now gobbies and hunters have joined hands to build great new nation!"},{"name":"YSHTOLA","text":"So that is what happened after we Sharlayans departed..."},{"name":"MIDNIGHTDEW","text":"Oh, so you're locals...? Um, no hard feelin's, I hope? All these nice buildings, but no one to live in 'em─felt like a waste, you know?"},{"name":"MIDNIGHTDEW","text":"We've been tryin' to put the place to rights, and things've been goin' well for the most part, but it ain't all smooth sailin'. Not to sound ungrateful, but the traps your people left lyin' about are a <span class=\"emphasis\">bloody</span> nuisance. And there's the Illuminati harryin' us day and night..."},{"name":"SLOWFIX","text":"Pshkohhh, Slowfix has bright idea! Uplanders desire mutual understanding, yes? Best way to understanding is helping one another! Help citizens of Idyllshire, and uplanders can be citizens too! Citizens are free to cross river!"},{"name":"ALPHINAUD","text":"Well, I am not aware of a quicker way to reach our destination. Let us assist Slowfix and his people."},{"name":"ALPHINAUD","text":"From the goblins' perspective, such a well-appointed city is certainly an attractive proposition."},{"name":"YSHTOLA","text":"I suppose it's only to be expected that others would come and occupy Sharlayan. Nonetheless, it feels akin to having strangers take over your home in your absence."}],"reward":{"gil":792,"items":[{"id":10590,"one":1,"hq":1},{"id":10602,"one":1,"hq":1},{"id":10626,"one":1,"hq":1},{"id":20396,"one":1,"hq":1},{"id":5632,"one":1}],"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":142}],"quests":[67190]},"next":[67192,67467,67468,67469,67472]},"partials":[{"type":"npc","id":"1012406","obj":{"i":1012406,"n":"Y'shtola","l":2000,"q":3}},{"type":"npc","id":"1012097","obj":{"i":1012097,"n":"Slowfix","l":2082,"q":15}},{"type":"npc","id":"1012405","obj":{"i":1012405,"n":"Alphinaud","l":2000,"q":3}},{"type":"npc","id":"1012409","obj":{"i":1012409,"n":"Alphinaud","l":2082,"q":4}},{"type":"npc","id":"1012410","obj":{"i":1012410,"n":"Y'shtola","l":2082,"q":4}},{"type":"npc","id":"1013159","obj":{"i":1013159,"n":"Alphinaud","l":2001,"q":1}},{"type":"npc","id":"1013160","obj":{"i":1013160,"n":"Y'shtola","l":2001,"q":1}},{"type":"item","id":"10590","obj":{"i":10590,"n":"Adamantite Broadsword","l":145,"c":30524,"t":2,"p":19293}},{"type":"item","id":"10602","obj":{"i":10602,"n":"Adamantite Bill","l":145,"c":31493,"t":3,"p":33073}},{"type":"item","id":"10626","obj":{"i":10626,"n":"Adamantite Zweihander","l":145,"c":34252,"t":87,"p":32442}},{"type":"item","id":"20396","obj":{"i":20396,"n":"Adamantite Uchigatana","l":145,"c":36429,"t":96,"p":20671}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"67190","obj":{"i":67190,"n":"Onward to Sharlayan","g":3,"l":"Gridania","s":79}},{"type":"quest","id":"67192","obj":{"i":67192,"n":"Golems Begone","g":3,"l":"Idyllshire","s":81}},{"type":"quest","id":"67467","obj":{"i":67467,"n":"Stop Bugging Me","g":101,"l":"Idyllshire","s":5801}},{"type":"quest","id":"67468","obj":{"i":67468,"n":"Community Service","g":101,"l":"Idyllshire","s":5802}},{"type":"quest","id":"67469","obj":{"i":67469,"n":"Feltsmox Needs Bait","g":99,"l":"The Dravanian Hinterlands","s":5803}},{"type":"quest","id":"67472","obj":{"i":67472,"n":"Louder than Words","g":99,"l":"The Dravanian Hinterlands","s":5801,"f":1}}]}