{"quest":{"name":"Onward to Sharlayan","location":"Gridania","id":67190,"patch":3.0,"sort":79,"eventIcon":71201,"issuer":1012400,"target":1012406,"involved":[1012398,1012399,1012401,1012402,1012403,1012405],"genre":3,"journal":["Y'shtola wishes to tell you more about her former master, Matoya.","According to Y'shtola, Matoya has been living as a hermit on the fringes of Sharlayan, in the Dravanian hinterlands. The journey will take you west through the Dravanian forelands. In order to prepare, Alphinaud suggests that you first return to Ishgard. Make your way back to the Holy See, and rejoin your comrades at the aetheryte plaza.","It is decided that you and Alphinaud will accompany Y'shtola on the expedition to Sharlayan. The first leg of your journey will take you to the settlement of Tailfeather.","You have arrived in Tailfeather. The Dravanian hinterlands are now but a short distance away."],"objectives":["Speak with Alphinaud at the aetheryte plaza in Ishgard.","Speak with Y'shtola at Tailfeather."],"dialogue":[{"name":"YSHTOLA","text":"In my youth, I had the honor of studying under Matoya. In the field of aetheric research, she was without rival."},{"name":"YSHTOLA","text":"I have no doubt that her knowledge will be of aid to our cause. The question is, will she share it with us? My master has ever been willful─the gods forbid anyone disagrees with her."},{"name":"YSHTOLA","text":"When the Garlean Empire first marched upon Eorzea some fifteen years ago, the denizens of Sharlayan were summoned back to the motherland."},{"name":"YSHTOLA","text":"However, Matoya refused to join the exodus. To this day, she lives a hermit's life on the fringes of the abandoned city."},{"name":"ALPHINAUD","text":"So it is to the Dravanian hinterlands that we must go. To the place of my birth..."},{"name":"ALPHINAUD","text":"Though Alisaie and I were born in Sharlayan, our days there were short. We remained only until the exodus, and I have not returned since."},{"name":"YSHTOLA","text":"Oh, so it's to be a homecoming, then? As fine a reason as any to go to Sharlayan, and it would afford us the opportunity to pay my master a visit."},{"name":"ALPHINAUD","text":"Ahem. I believe you have mistaken our primary objective, Y'shtola. At any rate, the journey will take us through largely unknown territory. Let us first return to Ishgard and make our preparations."},{"name":"TATARU","text":"Tee hee! Y'shtola looks absolutely smashing in her new outfit, don't you think?"},{"name":"ALPHINAUD","text":"Matoya... The name rings strangely familiar."},{"name":"ALPHINAUD","text":"Sharlayan is situated in the Dravanian hinterlands."},{"name":"ALPHINAUD","text":"To get there, we must strike west and traverse the breadth of the Dravanian forelands. Make no mistake, it will be a grueling journey."},{"name":"ALPHINAUD","text":"The party shall be comprised of <span class=\"highlight\">Forename</span>, Y'shtola, and myself. Tataru, pray remain in Ishgard and continue the search for our missing friends."},{"name":"TATARU","text":"Yes, sir!"},{"name":"ALPHINAUD","text":"First, let us make for Tailfeather."},{"name":"TATARU","text":"We managed to find Y'shtola. Given time, I'm sure we'll be reunited with the others as well!"},{"name":"YSHTOLA","text":"So this is the Holy See. I should like to linger awhile and take in the sights, but it must wait till after our mission."},{"name":"YSHTOLA","text":"A long soak in the Lifestream followed by a long journey... I would not recommend it to anyone."},{"name":"YSHTOLA","text":"But rest assured my strength is returning to me. I shall be back to my former self ere long."},{"name":"ALPHINAUD","text":"When last we set foot here, Estinien and Ysayle were with us. Though it was not all that long ago, I find myself strangely taken by nostalgia."}],"reward":{"gil":1329,"xp":76800},"reqs":{"jobs":[{"lvl":57,"id":142}],"quests":[67189]},"next":[67191]},"partials":[{"type":"npc","id":"1012400","obj":{"i":1012400,"n":"Y'shtola","l":52,"q":1}},{"type":"npc","id":"1012406","obj":{"i":1012406,"n":"Y'shtola","l":2000,"q":3}},{"type":"npc","id":"1012398","obj":{"i":1012398,"n":"Tataru","l":52,"q":3}},{"type":"npc","id":"1012399","obj":{"i":1012399,"n":"Alphinaud","l":52,"q":3}},{"type":"npc","id":"1012401","obj":{"i":1012401,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012402","obj":{"i":1012402,"n":"Y'shtola","l":2300,"q":2}},{"type":"npc","id":"1012403","obj":{"i":1012403,"n":"Tataru","l":2300,"q":1}},{"type":"npc","id":"1012405","obj":{"i":1012405,"n":"Alphinaud","l":2000,"q":3}},{"type":"quest","id":"67189","obj":{"i":67189,"n":"Tataru's Surprise","g":3,"l":"Gridania","s":78}},{"type":"quest","id":"67191","obj":{"i":67191,"n":"A Great New Nation","g":3,"l":"The Dravanian Forelands","s":80}}]}