{"quest":{"name":"Hour of Departure","location":"Ishgard","id":67198,"patch":3.0,"sort":87,"eventIcon":71201,"issuer":1012430,"target":1012430,"involved":[1012251,1012252,1012253,1012377,1012397,1012431,1012432,1013161,1013166,1013167,1013176],"genre":3,"journal":["Alphinaud has a final task for you before departing for Azys Lla.","While waiting for Cid to finish building the aetheric ram, Alphinaud suggests that you pay a visit to those who will remain in Ishgard. Begin by speaking with Aymeric, who stands nearby.","Aymeric expresses regret that he cannot join you in the battle to come, and gives you his blessing to do whatever is necessary to stop his father. Having bid the lord commander farewell, it is time to visit your other allies in Ishgard. Seek out Lucia at the Congregation of Our Knights Most Heavenly, Tataru in the Forgotten Knight, and Hilda in the Brume.","You have spoken with Lucia, Tataru, and Hilda, and received words of encouragement from all concerned. Before returning to the airship landing, pay a final visit to Lord Edmont at Fortemps Manor.","In a touching gesture, Lord Edmont bequeaths to you the shield that his son used to save your life. Noble Haurchefant...a man of no less courage than you, and no less honor, but one upon whom Hydaelyn never smiled. Inwardly, you reaffirm your vow to exact vengeance upon Ser Zephirin. Return to the airship landing and inform Alphinaud that you are ready to leave.","Having said your farewells, you are now ready to embark upon your mission to the floating isle of Azys Lla."],"objectives":["Speak with Aymeric.","Speak with Lucia at the Congregation of Our Knights Most Heavenly.","Speak with Tataru at the Forgotten Knight.","Speak with Hilda in the Brume.","Speak with Edmont at Fortemps Manor.","Report to Alphinaud at the airship landing in Ishgard."],"dialogue":[{"name":"ALPHINAUD","text":"Given the danger of the task that lies before us, I think it only right that we take a moment to bid our friends and allies farewell."},{"name":"ALPHINAUD","text":"Alas, Cid requires my assistance with Master Matoya's rather singular writings. Might I entrust the task of visiting those who will remain behind to you?"},{"name":"ALPHINAUD","text":"Before we depart for Azys Lla, it is only meet that we bid farewell to those who will remain behind. I should be obliged if you would attend to this, while I assist Cid."},{"name":"YSHTOLA","text":"I know naught of the archbishop and his knights save that which you have told me─but if they truly possess the power of primals <span class=\"emphasis\">and</span> the secrets of Azys Lla, they are dangerous foes indeed. We must spare no preparation."},{"name":"AYMERIC","text":"It goes without saying that the Temple Knights will bear the costs for all work on the <span class=\"emphasis\">Enterprise</span>. Would that we could contribute more to the cause."},{"name":"ESTINIEN","text":"Azure wings to bear us to the final battle... I must admit there is poetry to it."},{"name":"NOTRELCHAMPS","text":"Most folk know Master Garlond as a genius inventor. It's only when you come to work for him that you realize he's a godsdamned <span class=\"emphasis\">tyrant taskmaster</span>. Just, uh...don't tell him I said that, all right?"},{"name":"AYMERIC","text":"So the hour is nigh..."},{"name":"AYMERIC","text":"Would that I could join you in the coming battle, but with my wounds, I fear I would only be a burden to you."},{"name":"AYMERIC","text":"In consorting with the Ascians and availing himself of primal powers, my father made himself an enemy of all that is good and right in the world."},{"name":"AYMERIC","text":"Do whatever you must to end his madness. May the Fury watch over you."},{"name":"AYMERIC","text":"Do whatever you must to end my father's madness. May the Fury watch over you."},{"name":"LUCIA","text":"This is it, then? Go well, my friend. I shall pray to the Fury for your preservation."},{"name":"LUCIA","text":"...Hm? Mayhap you think it strange that a daughter of Garlemald should pray? I do not blame you─I used to think it passing strange myself."},{"name":"LUCIA","text":"But that all changed when I discovered something dearer to me than mine own life. Thereafter, praying seemed the most natural thing in the world."},{"name":"LUCIA","text":"Prayers are born of heartfelt faith. In manipulating the people's beliefs for his own twisted ends, the archbishop makes a mockery of their very existence. It cannot be borne."},{"name":"LUCIA","text":"Go well, my friend. May the Fury bless you and keep you."},{"name":"TATARU","text":"So you're off to face the archbishop, then... Please be careful. And...watch over the others, will you?"},{"name":"TATARU","text":"We've lost too many friends as it is. Some may yet return to us, but I couldn't bear to lose anyone else. I just couldn't."},{"name":"TATARU","text":"I realize it's asking a lot, but you're the strongest person I know, and I don't think there's anything you can't achieve if you put your mind to it."},{"name":"TATARU","text":"So please, whatever else happens, keep everyone safe!"},{"name":"TATARU","text":"You're the strongest person I know, <span class=\"highlight\">Forename</span>. If anyone can do this, you can. Just make sure everyone comes back in one piece, all right!?"},{"name":"HILDA","text":"Well, if it ain't my old friend <span class=\"highlight\">Forename</span>. Off to face the archbishop and his cronies, is it?"},{"name":"HILDA","text":"I'd love to go and give those bastards a good wallopin' myself─that snake Charibert, especially─but I've got to stay here and keep an eye on things."},{"name":"HILDA","text":"With the archbishop gone, some of the poor folk might get it in their heads to do somethin' stupid like stormin' the Pillars. But blood won't get us what we want, and I need to be around to remind 'em of that in case they forget."},{"name":"HILDA","text":"No need to worry about us, anyway. I'll work with Ser Aymeric to preserve the peace. You just concentrate on settlin' the score with the archbishop, eh?"},{"name":"HILDA","text":"No need to worry about us. I'll work with Ser Aymeric to preserve the peace. You just concentrate on settlin' the score with the archbishop, eh?"},{"name":"SYMME","text":"We'll keep the city in one piece, don't you worry!"},{"name":"EUDESTAND","text":"We won't get up to no mischief while you're gone. Not <span class=\"emphasis\">too</span> much, anyway!"},{"name":"EDMONT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, how good of you to pay me a visit."},{"name":"EDMONT","text":"It feels as if it were only yesterday when first we met here in this chamber. You came to us a fugitive seeking asylum...and now you bear the hopes of our nation upon your shoulders."},{"name":"EDMONT","text":"He would not have told you, but when Haurchefant begged me to accept you into our household, he described you as “hope incarnate.” At the time, I assumed that he was waxing lyrical, as was his wont. But I have come to see that he simply spoke the truth."},{"name":"EDMONT","text":"You <span class=\"emphasis\">are</span> hope─a shining beacon that shall guide the people of Ishgard through the raging snowstorm."},{"name":"EDMONT","text":"...A memento. Were my son here, he would have wished to fight at your side in the battle to come. Take care, my friend, and return to us!"},{"name":"EDMONT","text":"When Haurchefant asked me to accept you into our household, he described you as “hope incarnate.” At the time, I assumed that he was waxing lyrical, as was his wont. But I have come to see that he simply spoke the truth."},{"name":"EDMONT","text":"You <span class=\"emphasis\">are</span> hope─a shining beacon that shall guide the people of Ishgard through the raging snowstorm. Take care, my friend, and come back to us!"},{"name":"BUTLER01580","text":"Pray be careful out there, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"ALPHINAUD","text":"...Count Edmont bequeathed to you Lord Haurchefant's shield? A noble gesture."},{"name":"ALPHINAUD","text":"We bear the hopes and dreams of full many souls. Let their faith in us be a source of strength and courage as we face our remaining trials."}],"reward":{"gil":609,"xp":86400},"reqs":{"jobs":[{"lvl":59,"id":142}],"quests":[67197]},"next":[67199]},"partials":[{"type":"npc","id":"1012430","obj":{"i":1012430,"n":"Alphinaud","l":2301,"q":2}},{"type":"npc","id":"1012251","obj":{"i":1012251,"n":"Hilda","l":2300,"q":11}},{"type":"npc","id":"1012252","obj":{"i":1012252,"n":"Symme","l":2300,"q":10}},{"type":"npc","id":"1012253","obj":{"i":1012253,"n":"Eudestand","l":2300,"q":10}},{"type":"npc","id":"1012377","obj":{"i":1012377,"n":"House Fortemps Steward","l":2320,"q":6}},{"type":"npc","id":"1012397","obj":{"i":1012397,"n":"Count Edmont De Fortemps","l":2320,"q":1}},{"type":"npc","id":"1012431","obj":{"i":1012431,"n":"Y'shtola","l":2301,"q":2}},{"type":"npc","id":"1012432","obj":{"i":1012432,"n":"Estinien","l":2301,"q":2}},{"type":"npc","id":"1013161","obj":{"i":1013161,"n":"Tataru","l":2300,"q":1}},{"type":"npc","id":"1013166","obj":{"i":1013166,"n":"Aymeric","l":2301,"q":2}},{"type":"npc","id":"1013167","obj":{"i":1013167,"n":"Lucia","l":2300,"q":10}},{"type":"npc","id":"1013176","obj":{"i":1013176,"n":"Notrelchamps","l":2301,"q":3}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}},{"type":"quest","id":"67199","obj":{"i":67199,"n":"The First Flight of the Excelsior","g":3,"l":"Ishgard","s":88}}]}