{"quest":{"name":"Forbidden Knowledge","location":"Matoya's Cave","id":67196,"patch":3.0,"sort":85,"icon":100429,"eventIcon":71201,"issuer":1012138,"target":1012138,"involved":[1012424,1012425,1012426,1012427],"genre":3,"journal":["Matoya is in a mood to reminisce.","Matoya shares with you the tale of her work on a device known as an aetheric converger, and how it led to a bitter falling-out between her and her peers. The fruits of her research were apparently compiled within a tome which now lies sealed within the Great Gubal Library, and you must overcome the dangers within if you wish to retrieve it. Ask Matoya for further instructions.","Matoya loans you a pair of her servants, one to help you locate the tome within the library, and another to unlock the facility's long-sealed doors. Make yourself known to the latter─a broom.","Having introduced himself as Broomsy, the surprisingly eloquent sweeping implement furnishes you with directions to the Great Library. Upon leaving Matoya's Cave, you are to make your way east; the library building will come into view upon gaining the collapsed bridge. Speak with Broomsy when you arrive, and he will unlock the door for you.","The Great Gubal Library is ready to receive its first visitors in fifteen years. Brave the dangers within and retrieve Matoya's tome.<br><br>※Challenge the Great Gubal Library with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","You have survived the trials within the Great Gubal Library. Make your way back to the outside world.","Upon defeating the library's final guardian, the Crystal of Water regains the power of the Light. Soon after, you find what you can only assume is Matoya's tome on the aetheric converger. Bear the book back to Matoya, who awaits you within her cave.","Matoya confirms that you have retrieved the correct tome. All that remains is to put the knowledge it contains to use."],"objectives":["Speak with Matoya.","Speak with the enchanted broom.","Speak with Broomsy at the Great Gubal Library.","Enter the Great Gubal Library.","Deliver the tome to Matoya."],"dialogue":[{"name":"YSHTOLA","text":"Being here calls to mind my days studying under Matoya. Though she was the strictest─and most irascible─of mentors, she led by example and inspired one to greater heights. Were it not for her sage guidance, I should not be the woman I am."},{"name":"ALPHINAUD","text":"Do you see the tomes lying about like so many cheap romances? They are <span class=\"emphasis\">priceless</span>. My professors at the Studium would have fits if they saw them in this state."},{"name":"MATOYA","text":"Oh, the Great Library's guardians shouldn't pose any difficulty for a hero like you."},{"name":"MATOYA","text":"But if it turns out you aren't up to the task... Well, then I'll know you can't be trusted with something as dangerous as an aetheric ram."},{"name":"MATOYA","text":"I'll put a pair of familiars at your disposal. One's a poroggo who'll help you locate the tome."},{"name":"MATOYA","text":"The other's that broom yonder, who'll let you into the library.<br>...Well? What are you waiting for? Introduce yourself, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!"},{"name":"MATOYA","text":"Are you going to introduce yourself to that broom or not? No skin off my nose if you don't."},{"name":"YSHTOLA","text":"The Great Library was more than just a repository for tomes; it also served as a center of research for countless fields of study."},{"name":"YSHTOLA","text":"Fields such as the development of arcane entities, the fruits of which were employed as the library's sentinels. We must be ever on our guard."},{"name":"ALPHINAUD","text":"Among other things, Master Matoya is an authority in familiars. After we have tended to our task, perhaps I shall beg her for some insights on the subject..."},{"name":"MAGICALBROOM01660","text":"Ereh ees ot gnihton. Swish-swish-aroo!"},{"name":"MAGICALBROOM01660","text":"Greetings, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I am Broomsy, my lady's servant of some fifty years. May I say what an honor it is to serve you!"},{"name":"MAGICALBROOM01660","text":"I am given to understand you wish to enter the Great Gubal Library. To find it, pray head east upon leaving this cave. The building will come into view shortly after you reach the collapsed bridge."},{"name":"MAGICALBROOM01660","text":"I shall go and fetch my fellow familiar on my way to the entrance. When your preparations are in order, pray come and meet me there. It will be my pleasure to unlock the door for you."},{"name":"MATOYA","text":"What are you loitering around here for? Hurry up and fetch that book!"},{"name":"MAGICALBROOM01660","text":"You stand before the Great Gubal Library, one of Hydaelyn's foremost repositories of knowledge."},{"name":"MAGICALBROOM01660","text":"Alas, it has fallen into disuse since the exodus some summers since. In all those years, its halls have welcomed not the coming of a single soul─its floors felt not the loving brush of a broom..."},{"name":"MAGICALBROOM01660","text":"M-Mine apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Pray pay no mind to the dreams of a humble broom. You are doubtless eager to venture within and retrieve my lady's tome. I shall unlock the door at once. When you have what you seek, pray return to the cave and report to my lady."},{"name":"MAGICALBROOM01660","text":"I wish you good fortune in your search. When you have what you seek, pray return to the cave and report to my lady."},{"name":"MATOYA","text":"I take it you found the tome. Well, let's see it, then."},{"name":"MATOYA","text":"Aye, this is it all right..."},{"name":"YSHTOLA","text":"I must say, the experience brought back memories. Just like the old days, you still send people into the thick of danger as if it were nothing more than a mundane errand."},{"name":"ALPHINAUD","text":"But we were able to accomplish our task thanks to Pero Roggo. He is an eminently capable familiar─a creation worthy of the great Master Matoya─and to simply witness him in action gave me a better understanding of arcane entities."},{"name":"ALPHINAUD","text":"Should the opportunity present itself, I should very much like to employ this knowledge for the betterment of mankind─create a new variety of Carbuncle, perhaps..."},{"name":"MATOYA","text":"Don't get ahead of yourself, boy. Louisoix's grandson or no, it'll take another decade under me before you can call yourself a scholar, and a deal more than that to make you a scholar worth a damn."},{"name":"YSHTOLA","text":"As you may have gathered, Master Matoya is not easily impressed."},{"name":"ALPHINAUD","text":"...Indeed. Ahem. So, shall we examine the tome?"},{"name":"YSHTOLA","text":"As expected, the library was rife with dangers, but full glad I am that I could accompany you."},{"name":"YSHTOLA","text":"Depending on her mood, Master Matoya may well have forced some of us to stay behind to help repair her sentinels. With her, there's simply no telling..."},{"name":"ALPHINAUD","text":"Ahem... Despite how it may have sounded, I do not exaggerate when I say it was a tremendous learning experience to observe one of Master Matoya's familiars. The insights I acquired, I shall put to good use."}],"reward":{"gil":5000,"aetherCurrent":1,"xp":86400,"instance":31},"reqs":{"jobs":[{"lvl":59,"id":142}],"quests":[67195]},"next":[67197]},"partials":[{"type":"npc","id":"1012138","obj":{"i":1012138,"n":"Matoya","l":2036,"q":7}},{"type":"npc","id":"1012424","obj":{"i":1012424,"n":"Alphinaud","l":2036,"q":2}},{"type":"npc","id":"1012425","obj":{"i":1012425,"n":"Y'shtola","l":2036,"q":2}},{"type":"npc","id":"1012426","obj":{"i":1012426,"n":"Enchanted Broom","l":2036,"q":1}},{"type":"npc","id":"1012427","obj":{"i":1012427,"n":"Broomsy","l":2001,"q":1}},{"type":"instance","id":"31","obj":{"i":31,"n":"The Great Gubal Library","c":61801,"t":"Dungeons","min_lvl":59,"max_lvl":60,"min_ilvl":120,"max_ilvl":150}},{"type":"quest","id":"67195","obj":{"i":67195,"n":"Matoya's Cave","g":3,"l":"Idyllshire","s":84}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}}]}