{"quest":{"name":"The Green Death","location":"Limsa Lominsa","id":67207,"patch":3.0,"sort":500,"icon":100441,"unlocksFunction":1,"eventIcon":71341,"issuer":1006757,"target":1013135,"involved":[1013136],"genre":156,"journal":["Alka Zolka's face is the picture of excitement.","Alka Zolka has received a missive from none other than Surito Carito, requesting that you both join him near the Wanderer's Palace. Make your way to upper La Noscea, and learn what the scholar wishes of you.","Surito Carito has terrible news: the sickness, the selfsame plague that deformed his people, has returned. Surito needs time to find a cure, and intends to place the worst ailing among his friends into magical slumber with the sealing enchantments of Nym. However, he needs keystones to do so, and would have you and Alka Zolka scour the nearby shores for one apiece. Travel to the Long Climb in outer La Noscea, and search for one of the outer keystones along the northern edge of Bronze Lake.","Though momentarily distracted by a golem of dubious origin, you have stumbled upon one of the sought-after keystones. Attempt once more to remove it from its resting place.","You have safely taken the keystone. Return with it to Surito near the Wanderer's Palace.","Surito Carito gratefully accepts one of the outer keystones from you, and the other from Alka Zolka. However, he reveals that these are not enough─the sealing enchantment requires yet another keystone. He asks that you continue to study the way of the scholar until he can discern the location of the last one.<br><br>※The next scholar quest will be available from Surito Carito upon reaching level 52."],"objectives":["Speak with Surito Carito near the Wanderer's Palace.","Search for the outer keystone in outer La Noscea.","Pick up the outer keystone.","Deliver the outer keystone to Surito Carito."],"dialogue":[{"name":"ALKAZOLKA","text":"You have astonishing timing, <span class=\"highlight\">Forename</span>. Would you believe that I meant to send for you this very bell?"},{"name":"ALKAZOLKA","text":"Surito Carito has summoned us both by name!"},{"name":"ALKAZOLKA","text":"His missive was unclear as to why he needs us. But when a living scholar calls, we can scarce dismiss him."},{"name":"ALKAZOLKA","text":"Just imagine the sorts of things we might learn from him: the military tactics, the Nymian secrets!"},{"name":"ALKAZOLKA","text":"Come, my friend, let us make for the shores of Bronze Lake, where Surito Carito and untold knowledge await!"},{"name":"ALKAZOLKA","text":"Surito Carito awaits us near the Wanderer's Palace, on the shores of Bronze Lake─and we ought not keep him!"},{"name":"SURITOCARITO","text":"Thank you for coming. I hope the journey was not too taxing."},{"name":"ALKAZOLKA","text":"Not at all! Both <span class=\"highlight\">Forename</span> and I are ready and willing to help. But pray tell, why have you summoned us?"},{"name":"SURITOCARITO","text":"Allow me to start at the beginning. After Lily freed my heart, I returned to my people. For the first time in an age, I was myself."},{"name":"SURITOCARITO","text":"I brought all my knowledge to bear against the rancor and managed to save some of my comrades. Alas, many and more are yet consumed by hatred..."},{"name":"SURITOCARITO","text":"And I was not alone for long. Many of my kin regained their sanity once the palace was freed of the tonberry king's malignance."},{"name":"SURITOCARITO","text":"Though our minds were our own, our forms remained monstrous, and we dared not venture outside. Yet within our halls, we were content with our own company and the quiet life."},{"name":"SURITOCARITO","text":"But it did not last. One by one, we began to grow ill again, and then grotesque. The sickness that transformed us into tonberries has returned!"},{"name":"ALKAZOLKA","text":"What? Are you certain!?"},{"name":"SURITOCARITO","text":"Beyond all doubt. Fifteen hundred years past, powerful magicks were used to seal us in the palace alongside the sickness. Yet even these could not withstand the Calamity. As we arose from our long slumber, the sickness awoke with us."},{"name":"SURITOCARITO","text":"As a scholar, I must see my people restored in mind and body both. But finding a cure will take many moons─perhaps even years─and that is time they do not have."},{"name":"ALKAZOLKA","text":"Yet I presume you will not stand idle while their condition worsens. This is why you summoned us, is it not?"},{"name":"SURITOCARITO","text":"Just so. I plan to seal the worst afflicted within a section of the palace. There, they will slumber once more."},{"name":"SURITOCARITO","text":"This itself is no cure. But it will afford me the time I so desperately need to find a permanent solution."},{"name":"SURITOCARITO","text":"Now, as for the seal itself, an enchantment of this nature is not unlike a net. It is anchored at several points, and if not laid down in perfect balance, the magicks will falter. In order to accomplish this balance, my people created keystones to focus and disperse aether.<br>It is these keystones that I have need of, but I dare not seek them out myself for fear of being hunted."},{"name":"ALKAZOLKA","text":"Then we will gather them in your stead!<br>...It is “we,” is it not, <span class=\"highlight\">Forename</span>?"},{"name":"SURITOCARITO","text":"Thank you both. The original enchantment encircled this lake, and two of the keystones should be somewhere along the banks. If you search the shores, I've no doubt you will find them."},{"name":"ALKAZOLKA","text":"I will take the near bank. If you scour the northern shores in outer La Noscea, I am sure we will find the outer keystones."},{"name":"SURITOCARITO","text":"You have my thanks for taking up the search for the keystones, my friend."},{"name":"SYSTEM","text":"As you reach to pick up the keystone, you hear the crack and rumble of rock upon rock. The hair raised on the nape of your neck, you turn to see a guardian of eld awaken!"},{"name":"SURITOCARITO","text":"Has your search for keystones borne fruit?"},{"name":"SURITOCARITO","text":"Yes...yes, there can be no mistaking these runes..."},{"name":"ALKAZOLKA","text":"I have it, I have it! Whew... That was a pitched battle, I tell you. The keystone was in the clutches of an uragnite─and an ill-tempered one at that!"},{"name":"SURITOCARITO","text":"That explains the...distinctive odor. But the runes leave no doubt. Thank you, Alka Zolka."},{"name":"ALKAZOLKA","text":"It was the least I could do. I trust you can seal away the worst stricken of the Nymians now?"},{"name":"SURITOCARITO","text":"It is not that simple, I fear. The enchantment will fail without three keystones: two on the outside, and another at the center."},{"name":"SURITOCARITO","text":"I lack this grand keystone, and the knowledge to locate it. While I search, pray focus on your studies. I have a suspicion that what trials await will try you sorely as a scholar..."},{"name":"SYSTEM","text":"The next scholar quest will be available from Surito Carito upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1078,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":29}],"questsType":"all","quests":[66638,65964]},"next":[67208]},"partials":[{"type":"npc","id":"1006757","obj":{"i":1006757,"n":"Alka Zolka","l":28,"q":11}},{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"npc","id":"1013136","obj":{"i":1013136,"n":"Alka Zolka","l":34,"q":1}},{"type":"quest","id":"66638","obj":{"i":66638,"n":"The Beast Within","g":156,"l":"Limsa Lominsa","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67208","obj":{"i":67208,"n":"Quarantine","g":156,"l":"Upper La Noscea","s":520,"f":1}}]}