{"quest":{"name":"Close Encounters of the VIth Kind","location":"Azys Lla","id":67203,"patch":3.0,"sort":92,"icon":100431,"eventIcon":71201,"issuer":1014850,"target":1012834,"involved":[1012822,1012827,1012828,1012829,1012830],"genre":3,"journal":["The guidance node is ready to take you through the Gamma Quadrant.","The guidance node warns you that the Garleans are out in force in the Gamma Quadrant. Make your way through the area, all the while exercising the utmost caution, and rejoin your comrades near the enemy encampment.","The Garlean force present is revealed to be none other than the VIth Imperial Legion, which you first encountered at the Zundu village. Their purpose is to acquire the knowledge to capture primals, to which end they also seek the Aetherochemical Research Facility. Though their presence complicates matters, you must remain focused on your mission to stop the archbishop. Proceed to Matter Conduit VI-VII.","A squad of imperial troops chase you down as you arrive at the matter conduit, but you succeed in repelling them. Speak with the guidance node again, and pray that there are no further interruptions.","You and your companions are set upon by Regula van Hydrus, legatus of the VIth Legion. Though you are able to overwhelm him, he sets his minions upon you and boards an airship, most certainly bound for the research facility. With time running short, Alphinaud bids you continue your pursuit of the archbishop while he and the others keep the enemy at bay. Having accepted the Eye into your keeping, you use the matter conduit and emerge within a new quadrant. Seek out the guidance node nearby to receive further instructions.","According to the guidance node, the Delta Quadrant, where you now stand, is home to live dragons."],"objectives":["Speak with Estinien.","Speak with the guidance node at Matter Conduit VI-VII.","Speak with the guidance node at Matter Conduit VII-VI."],"dialogue":[{"name":"GUIDANCESYSTEM","text":"Warning: intruders detected in force in this quadrant. It is recommended that you avoid confrontation where possible."},{"name":"GUIDANCESYSTEM","text":"Be kindly reminded that, in accordance with the terms and conditions of use, you and your party assume all risks of damages or injury, including death, that you may sustain in the course of guidance."},{"name":"GUIDANCESYSTEM","text":"Please follow me to the next matter conduit. It leads to the Delta Quadrant, where the facility's greatest achievement is located."},{"name":"YSHTOLA","text":"These soldiers bear the sigil of the VIth Legion, ordinarily deployed within Ilsabard. They are certainly a long way from home."},{"name":"ALPHINAUD","text":"The VIth Legion has long been the favored of Emperor Varis. It is the iron fist with which he crushes uprisings."},{"name":"ESTINIEN","text":"Wait. Something is afoot."},{"name":"GUIDANCESYSTEM","text":"&lt;blip&gt; That you have survived to this point is in defiance of possibility. But it appears the danger is not yet past."},{"name":"GUIDANCESYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; WARNING! Intruders approaching. Please eliminate them if you wish to proceed."},{"name":"GUIDANCESYSTEM","text":"&lt;blip&gt; Welcome to the Delta Quadrant, where methods are developed for mastering dragons. "},{"name":"GUIDANCESYSTEM","text":"To this day, the sector is home to live specimens brought over from the southern continent of Meracydia. Truly a testament to the greatness of the Allagan Empire."},{"name":"QIB","text":"Defeat Regula van Hydrus!"},{"name":"QIB","text":"Come, eikon-slayer. Impress me."},{"name":"QIB","text":"Surely you can do better than that."},{"name":"QIB","text":"Let us aid you, Lord van Hydrus!"},{"name":"QIB","text":"Hmph, naught but toy soldiers to knock down."},{"name":"QIB","text":"Leave the rank and file to us! Focus on the legatus!"},{"name":"QIB","text":"I need air support! <span class=\"emphasis\">Now</span>!"},{"name":"QIB","text":"Obsidian Carbuncle! Come!"},{"name":"QIB","text":"No... Not here..."}],"reward":{"gil":994,"aetherCurrent":1,"xp":86400},"reqs":{"jobs":[{"lvl":59,"id":142}],"quests":[67202]},"next":[67204,67526,67527,67528]},"partials":[{"type":"npc","id":"1014850","obj":{"i":1014850,"n":"Guidance Node","l":2101,"q":1}},{"type":"npc","id":"1012834","obj":{"i":1012834,"n":"Guidance Node","l":2101,"q":2}},{"type":"npc","id":"1012822","obj":{"i":1012822,"n":"Guidance Node","l":2101,"q":1}},{"type":"npc","id":"1012827","obj":{"i":1012827,"n":"Guidance Node","l":2101,"q":1}},{"type":"npc","id":"1012828","obj":{"i":1012828,"n":"Alphinaud","l":2101,"q":1}},{"type":"npc","id":"1012829","obj":{"i":1012829,"n":"Estinien","l":2101,"q":1}},{"type":"npc","id":"1012830","obj":{"i":1012830,"n":"Y'shtola","l":2101,"q":1}},{"type":"quest","id":"67202","obj":{"i":67202,"n":"Chimerical Maintenance","g":3,"l":"Azys Lla","s":91}},{"type":"quest","id":"67204","obj":{"i":67204,"n":"Fetters of Lament","g":3,"l":"Azys Lla","s":93}},{"type":"quest","id":"67526","obj":{"i":67526,"n":"Inadequate Safety Measures","g":102,"l":"Azys Lla","s":5912}},{"type":"quest","id":"67527","obj":{"i":67527,"n":"Environmental Unbalance","g":102,"l":"Azys Lla","s":5913}},{"type":"quest","id":"67528","obj":{"i":67528,"n":"Elevated Aggression Levels","g":102,"l":"Azys Lla","s":5914}}]}