{"quest":{"name":"Fetters of Lament","location":"Azys Lla","id":67204,"patch":3.0,"sort":93,"eventIcon":71201,"issuer":1012834,"involved":[1012847],"genre":3,"journal":["The guidance node has ill tidings to share with you.","To your dismay, it appears that the matter conduit leading to the Flagship has long since been destroyed. As you ponder an alternative path to your destination, Midgardsormr manifests and bids you seek out one of his children, who abides in torment nearby.","You come before the great wyrm Tiamat, who has been imprisoned in Azys Lla since before the fall of the Allagan Empire. You listen intently as she tells you of Bahamut's tragic demise and of the Ascians' role in his ill-fated return.<br><br>At the meeting's conclusion, your Crystal of Fire regains its light, and you find that you are able to hear Hydaelyn's voice once more. Impressed by your strength, and convinced at last of your worthiness to bear the Light, Midgardsormr offers to carry you to the Flagship, that you might cast out the Darkness which lurks therein."],"objectives":["Seek out Midgardsormr's child."],"dialogue":[{"name":"GUIDANCESYSTEM","text":"&lt;blip&gt; I regret to inform you that the matter conduit leading to the Flagship is no longer functioning."},{"name":"GUIDANCESYSTEM","text":"According to my records, it was destroyed by a dragon, which broke free of its restraints when they failed approximately two thousand three hundred and sixty-nine years, one month, twenty-four days, seven hours and four minutes ago."},{"name":"GUIDANCESYSTEM","text":"Please find an alternate route to the Aetherochemical Research Facility. The Allagan Research Council apologizes for any inconvenience caused."},{"name":"MIDGARDSORMR","text":"So, thy journey hath led thee to this accursed place. Canst thou hear it, mortal? The ceaseless keening of my kindred, steeped in five thousand years of suffering..."},{"name":"MIDGARDSORMR","text":"Long before the Ishgardians and their base betrayal, there lived still more wicked men whose ambitions knew no bounds."},{"name":"MIDGARDSORMR","text":"Fearful of our might and covetous of our power, they devised a means to enslave dragonkind... Their vile misdeeds did set in motion a train of events whose repercussions are felt to this day."},{"name":"MIDGARDSORMR","text":"Beyond, thou wilt find one of my first brood. Hark thou unto her words. Partake thou of her pain. Think thou upon the suffering that the conflict betwixt our kinds hath begot."},{"name":"SYSTEM","text":"A great wyrm is being held in some manner of restraint."},{"name":"SYSTEM","text":"You can now ride Midgardsormr!"}],"reward":{"gil":705,"aetherCurrent":1,"xp":86400},"reqs":{"jobs":[{"lvl":59,"id":142}],"quests":[67203]},"next":[67205]},"partials":[{"type":"npc","id":"1012834","obj":{"i":1012834,"n":"Guidance Node","l":2101,"q":2}},{"type":"npc","id":"1012847","obj":{"i":1012847,"n":"Guidance Node","l":2101,"q":1}},{"type":"quest","id":"67203","obj":{"i":67203,"n":"Close Encounters of the VIth Kind","g":3,"l":"Azys Lla","s":92}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}}]}