{"quest":{"name":"Quarantine","location":"Upper La Noscea","id":67208,"patch":3.0,"sort":520,"icon":100441,"unlocksFunction":1,"eventIcon":71341,"issuer":1013135,"target":1013135,"involved":[1013137],"genre":156,"journal":["Surito Carito has been waiting for you.","Surito Carito reveals that he and Alka Zolka have located the grand keystone, the means to again sealing away the afflicted tonberries. In fact, Alka Zolka has already ventured forth to search for it among the ruins to the east. However, ancient guardians watching over Nymian assets may pose a threat to your marauder friend. Go now, and ensure his safety.","Alka Zolka has eagerly awaited your coming. Take the grand keystone from where it lies, and together face whatever rises to defend it.","The guardian destroyed, you now have the grand keystone in hand. Present it to Surito Carito near the Wanderer's Palace.","Surito takes the grand keystone with thanks. Though sealing his ailing friends away will not save them, it will give the scholar enough time to devise a cure.<br><br>※The next scholar quest will be available from Surito Carito upon reaching level 54."],"objectives":["Speak with Alka Zolka in the ruins to the east.","Obtain the grand keystone.","Deliver the grand keystone to Surito Carito.","Defeat the guardian!"],"dialogue":[{"name":"SURITOCARITO","text":"We have divined the location of the grand keystone, my friend. It lies in the ruins to the east."},{"name":"SURITOCARITO","text":"The credit for the find truly lies with Alka Zolka. His knowledge of Nym is impressive. It was not long into our discussion of the stone's whereabouts that we were able to piece together where it must be."},{"name":"SURITOCARITO","text":"As you can imagine, he could not contain his curiosity. Even now, he is combing through the ruins. Please, see that he comes to no harm."},{"name":"SURITOCARITO","text":"We often left guardians to watch our most precious assets. I told Alka Zolka this, but he firmly believes the enchantments have worn thin. I am less sure. Be careful when you take the grand keystone."},{"name":"SURITOCARITO","text":"Perhaps I fear for nothing, and Alka Zolka has already found the grand keystone."},{"name":"SURITOCARITO","text":"But if the magicks that power the guardians remain, he may be in great danger..."},{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>! You have arrived in time─I believe our prize is just yonder. And I trust Surito Carito mentioned the guardians?"},{"name":"ALKAZOLKA","text":"I have my doubts they still guard our prize, but better safe than sorry. Should any awaken to our presence, we will reduce them to rubble!"},{"name":"ALKAZOLKA","text":"Come, <span class=\"highlight\">Forename</span>, let us take the grand keystone and be done with it!"},{"name":"ALKAZOLKA","text":"Keep your wits about you, <span class=\"highlight\">Forename</span>..."},{"name":"ALKAZOLKA","text":"A guardian! Well, we have dug up much of Nym's past. Mayhap it's time we put a piece of it to rest!"},{"name":"ALKAZOLKA","text":"Haha, what a team we make! No foe can stand against scholar and marauder!"},{"name":"ALKAZOLKA","text":"The grand keystone is ours. Surito will no doubt be happy to get his hands on it."},{"name":"SURITOCARITO","text":"You are safe, thank the gods. And the grand keystone...?"},{"name":"SURITOCARITO","text":"Well done, you two. With this, I can cast a sealing enchantment over those of my people suffering most."},{"name":"ALKAZOLKA","text":"I am full glad to hear it!"},{"name":"SURITOCARITO","text":"Soon the worst afflicted will be at peace once more, safely segregated from the others."},{"name":"SURITOCARITO","text":"But this is only the first step. I will need to learn the cause of the sickness before seeing my people cured."},{"name":"ALKAZOLKA","text":"You are not alone in this, Surito Carito. We three shall see an end to this blight."},{"name":"SURITOCARITO","text":"Thank you, Alka Zolka, <span class=\"highlight\">Forename</span>. I am proud to have you both at my side."},{"name":"SURITOCARITO","text":"<span class=\"highlight\">Forename</span>, it is time that you learned a new spell for giving succor to your comrades-in-arms: Indomitability. Once, it was the sole province of high-ranking scholars. May it serve you well henceforth."},{"name":"QIB","text":"I shall draw its ire! Pray attend me, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Destroy its soulstone─it cannot move if you do!"},{"name":"QIB","text":"Now, while it is paralyzed! Keep attacking!"},{"name":"QIB","text":"Hah! It is no match for us!"},{"name":"QIB","text":"We have it, <span class=\"highlight\">Forename</span>! We have it!"},{"name":"QIB","text":"M-My carelessness has cost us..."}],"reward":{"gil":676,"action":3583,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":29}],"quests":[67207]},"next":[67209]},"partials":[{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"npc","id":"1013137","obj":{"i":1013137,"n":"Alka Zolka","l":34,"q":1}},{"type":"action","id":"3583","obj":{"i":3583,"n":"Indomitability","c":2806,"j":28,"t":4,"l":52}},{"type":"quest","id":"67207","obj":{"i":67207,"n":"The Green Death","g":156,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"67209","obj":{"i":67209,"n":"False Friends","g":156,"l":"Upper La Noscea","s":540,"f":1}}]}