{"quest":{"name":"False Friends","location":"Upper La Noscea","id":67209,"patch":3.0,"sort":540,"icon":100441,"unlocksFunction":1,"eventIcon":71341,"issuer":1013135,"target":1013135,"involved":[1013186],"genre":156,"journal":["Surito Carito seems to be at wit's end.","The cause of Surito Carito's frustration is a lack of progress─he cannot cure the sickness without learning more of it. He explains the scourge of his people came from the ocean, upon a trader's galley. Sailors lost in a terrible storm drifted to a desert isle in the south seas, where they met a tribe of Lalafells. These natives gave the traders succor, and sent them home with a wondrous gift─an ornate amphora. Upon hearing the tale in full, however, Alka Zolka realizes that this vase may be the sickness's source, for would not these traders otherwise have transformed? To discover the truth of this, and learn more of the illness, Surito Carito entreats you to search for the south seas amphora in what remains of the Floating City of Nym.","Your search for the south seas amphora has availed you naught, but there are yet more places to scour. Continue to look in another area.","You look about for the south seas amphora a second time, but to no avail. Move on to another vantage point and try again.","You look high and low, and spot something protruding from the dirt nearby. Go and attempt to dig it free.","Though voidsent appear as if from nowhere to preempt your discovery, you make short work of them. Now is the time to excavate the earthenware amphora.","You pry the empty amphora from the soil. Return to Surito by the Wanderer's Palace, and ask whether or not this is the south seas amphora you seek.","Though amazed to find it intact, Surito concludes that the vase is the selfsame amphora the traders brought back to Nym. However, he is shocked by what he sees inside: a binding sigil, carved into the bottom to hold a voidsent. Surito reveals that this is the work of Mhach, an ancient nation of magi who drew their might from the void and coveted Nym. Bewildered, he wonders if everything, from the storm to the traders' miraculous return, had been a Mhachi plot to bring low his people. Greatly troubled, he asks for time to think upon the role that void magi played in spreading the sickness.<br><br>※The next scholar quest will be available from Surito Carito upon reaching level 56."],"objectives":["Search for the south seas amphora in the Floating City of Nym.","Continue searching for the south seas amphora.","Examine the amphora.","Retrieve the amphora.","Deliver the empty amphora to Surito Carito."],"dialogue":[{"name":"SURITOCARITO","text":"I have worked day and night on the cure, yet I have little to show for it. My research is at a standstill for lack of information."},{"name":"ALKAZOLKA","text":"I feared as much. If ever men had knowledge of the sickness, it was lost long before this age. Even after careful study of Nymian tablets, I still know little more than what you have told me: that it came from the sea."},{"name":"SURITOCARITO","text":"From traders who returned from the south seas, yes. They had lost their mainmast in a fearsome tempest and drifted, victims of the current, until at last they ran aground on a desert isle."},{"name":"SURITOCARITO","text":"Half dead, they stumbled ashore, and would have perished but for the Lalafellin tribe that lived there. These natives nursed the traders back to health and helped mend their ship. They even sent our men home with an amphora etched with ornate designs─a gift of friendship."},{"name":"SURITOCARITO","text":"In Nym, we had given them the rites due to those lost at sea. When they sailed into port a year after they had left, you can imagine how joyful the mood was."},{"name":"SURITOCARITO","text":"Yet our joy soon turned to horror. The traders began to grow ill, for the sickness was upon them. They transformed, and the rest, you know."},{"name":"ALKAZOLKA","text":"Hmmm... The story suggests the traders contracted the disease on the isle. The voyage home must have been─"},{"name":"ALKAZOLKA","text":"Hold on... The traders were hale and healthy when they returned to Nym, yes? The sickness became known only <span class=\"emphasis\">after</span> they reached port?"},{"name":"SURITOCARITO","text":"You mean to suggest that it was <span class=\"emphasis\">not</span> the men who bore the disease? Then who─or what...? Something they carried, perhaps, something...like the islanders' gift!"},{"name":"ALKAZOLKA","text":"That does seem the more likely culprit. But without the amphora, this is all conjecture, and I would be astounded if even a shard remains after fifteen hundred years."},{"name":"SURITOCARITO","text":"As would I. &lt;sigh&gt; It was placed on display in the royal halls for all to see. If only I had considered it a possible source..."},{"name":"ALKAZOLKA","text":"The royal halls? I know exactly where those used to be! Precious little remains of them, but I will scour the area. And if <span class=\"highlight\">Forename</span> joins me, mayhap we will be lucky."},{"name":"SURITOCARITO","text":"The amphora was kept in the royal halls, which Alka Zolka can pinpoint in the Floating City. Unlikely though it may be, perhaps a piece of it remains..."},{"name":"ALKAZOLKA","text":"I hope we have not come on a fool's errand, <span class=\"highlight\">Forename</span>, but I see nothing to persuade me otherwise. Mayhap if you searched over there..."},{"name":"SYSTEM","text":"You see no sign of the south seas amphora..."},{"name":"SYSTEM","text":"You see no sign of the south seas amphora..."},{"name":"SYSTEM","text":"You spot something half-covered with soil several yalms below you."},{"name":"SYSTEM","text":"You dig out an empty amphora from the soil where it lies."},{"name":"ALKAZOLKA","text":"You...you <span class=\"emphasis\">actually</span> found it!? It's a miracle! ...But we must have Surito Carito authenticate it before growing too excited."},{"name":"SURITOCARITO","text":"I beg your pardon... You found it? <span class=\"emphasis\">Intact</span>!?"},{"name":"SURITOCARITO","text":"Incredible... I remember this as though it were yesterday. This is the selfsame amphora."},{"name":"ALKAZOLKA","text":"Then it truly is an honest-to-gods miracle! Though...it occurs to me now that we should handle it with a bit more care─assuming it can, ahem, turn us into tonberries."},{"name":"SURITOCARITO","text":"Voidsent? That is what attempted to stop you from taking the amphora?"},{"name":"SURITOCARITO","text":"Hmmm... Voidsent are drawn to the magicks of their own kind, which means a voidsent of some strength was likely sealed herein."},{"name":"SURITOCARITO","text":"Yes, here, a binding sigil cut into the bottom─<br>...Dear gods, it cannot be! This is the work of Mhach!"},{"name":"ALKAZOLKA","text":"“Mhach, Mhach, beware the dark,<br>keep away or lose your heart.”<br>...<span class=\"emphasis\">That</span> Mhach?"},{"name":"SURITOCARITO","text":"An apt rhyme doubtless inherited from Nym. Mhach was our enemy, rapacious and unwise. Their magi trafficked with the void, grew mighty from shadows and attacked our lands time and again!"},{"name":"SURITOCARITO","text":"Look no further than this─their sigil which sealed a voidsent in this “gift.” The islanders must have been their pawns in a plot to bring us to our knees."},{"name":"SURITOCARITO","text":"We were fools. Not once did we consider that everything, from the tempest to our traders' miraculous return, might be a voidmage ploy!"},{"name":"SURITOCARITO","text":"I must return to my tomes. Pray allow me time to research this─and please, tell me if you begin to transform..."}],"reward":{"gil":1013,"action":3584,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":29}],"quests":[67208]},"next":[67210]},"partials":[{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"npc","id":"1013186","obj":{"i":1013186,"n":"Alka Zolka","l":350,"q":1}},{"type":"action","id":"3584","obj":{"i":3584,"n":"Broil","c":2807,"j":28,"t":2,"l":54}},{"type":"quest","id":"67208","obj":{"i":67208,"n":"Quarantine","g":156,"l":"Upper La Noscea","s":520,"f":1}},{"type":"quest","id":"67210","obj":{"i":67210,"n":"Ooh Rah","g":156,"l":"Upper La Noscea","s":560,"f":1}}]}