{"quest":{"name":"Forward, the Royal Marines","location":"Upper La Noscea","id":67212,"patch":3.0,"sort":600,"icon":100441,"unlocksFunction":1,"eventIcon":71341,"issuer":1013135,"target":1013199,"involved":[1013141,1013142,1013143,1013146,1013147,1013148,1013198],"genre":156,"journal":["Surito Carito appears resolute.","Surito Carito informs you he has learned how to track the invisible voidsent. His research has revealed that your faerie can perceive where the fiend has feasted, and that you can track it via these aetherial traces. With Alka Zolka and the new Royal Marines at your back, make your way to the Floating City of Nym, and begin the hunt for the fiend.","Your faerie detects the voidsent's aetherial traces─the remains of its prey. She directs you next towards Zelma's Run in upper La Noscea.","Your faerie once again senses the aetherial traces of the voidsent, this time moving towards Camp Bronze Lake. Hurry there and consult with Alka Zolka.","With a burst of blinding light, your faerie dispels the spell concealing the voidsent. The foe now visible, the Royal Marines charge. Alka Zolka and his soldiers deliver punishing blows, whilst your spells defend them. The battle is fierce, but soon the fiend lies dying. With its last breaths, it makes ready to release the sickness─yet before it can, the tonberries come to your aid. The killing blow is theirs. Now, as you stand victorious, congratulate your fellow combatants for putting an end to this specter of Mhach.","You have spoken with your comrades-in-arms. Before you head off into the sunset, it would be best to see what comments Surito Carito has.","Though the cure to the tonberries' plight is still not quite within your grasp, Surito Carito remains gratified by the outcome of the day's events. Seeing both your people and his able to work together toward a common cause is victory enough, at least for now.<br><br>※The next scholar quest will be available from Alka Zolka once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Search for traces of the voidsent in the Floating City of Nym.","Search for traces of the voidsent in Zelma's Run.","Speak with Alka Zolka at Camp Bronze Lake.","Speak with your fellow Royal Marines.","Speak with Surito Carito.","Find the voidsent!","Aetherial traces detected","Prevent the Nymian Plague and slay the voidsent!"],"dialogue":[{"name":"SURITOCARITO","text":"I have it, <span class=\"highlight\">Forename</span>─the means to track our invisible voidsent! The time is come to discuss our attack."},{"name":"ALKAZOLKA","text":"Hah hah! I've been waiting for this day! What's the plan, Surito Carito?"},{"name":"SURITOCARITO","text":"First, we will need to track our quarry. I believe it has been feeding upon the aether of local creatures to regain its strength."},{"name":"SURITOCARITO","text":"The way in which it feeds leaves behind unique aetherial traces. As bread crumbs mark the path of a hungry child, this trail will lead us straight to the voidsent."},{"name":"ALKAZOLKA","text":"How are we to detect these traces?"},{"name":"SURITOCARITO","text":"With Lily's aid. She can sense where the voidsent has left aether undevoured."},{"name":"SURITOCARITO","text":"We will begin our search where you unearthed the amphora, and follow where Lily leads."},{"name":"SURITOCARITO","text":"Once she senses the voidsent is near, we will force it to show itself. Lily will illuminate the area, and her light will dispel the magicks concealing it. Right, my dear?"},{"name":"SURITOCARITO","text":"With the voidsent visible, we will attack with all our might. The marines will charge, and kill it before it causes more damage!"},{"name":"ALKAZOLKA","text":"This is it, <span class=\"highlight\">Forename</span>─our chance to prove the might of our corps!"},{"name":"ALKAZOLKA","text":"Little one, the fate of the realm is in your hands. Are you ready?"},{"name":"SURITOCARITO","text":"Then our course is clear. May our plan ensure the sickness never again claims a victim!"},{"name":"ALKAZOLKA","text":"To victory─come hells or high water!"},{"name":"SURITOCARITO","text":"Quickly, my friend, to where you found the amphora!"},{"name":"SYSTEM","text":"Through the aetherial traces remaining from devoured prey, your faerie senses the voidsent is moving towards Zelma's Run!"},{"name":"SURITOCARITO","text":"Our future rests upon your success. May good fortune attend you today."},{"name":"ALKAZOLKA","text":"Where could it have gone...?"},{"name":"SYSTEM","text":"Through the aetherial traces remaining from devoured prey, your faerie senses the voidsent is moving towards Camp Bronze Lake!"},{"name":"ALKAZOLKA","text":"What is it, <span class=\"highlight\">Forename</span>?"},{"name":"ALKAZOLKA","text":"B-But that way lies Camp Bronze Lake!"},{"name":"ALKAZOLKA","text":"What purpose could it have there? The healing waters? No... I suppose it is home to─"},{"name":"ALKAZOLKA","text":"Of course! The wounded Maelstrom soldiers! It means to spread the sickness anew <span class=\"emphasis\">through them</span>!"},{"name":"ALKAZOLKA","text":"We must stop it! Quickly, to the camp!"},{"name":"OLDSAILOR01676","text":"Godsdammit! This place is bloody crowded! If we don't find the voidsent quickly, there's to be a lot more tonberries!"},{"name":"SAILOR01676","text":"But how do we draw it out into the open if we can't see it?"},{"name":"ALKAZOLKA","text":"Get the soldiers to evacuate! <span class=\"highlight\">Forename</span>, find the voidsent with Lily's light!"},{"name":"ALKAZOLKA","text":"Only you can track the voidsent."},{"name":"ALKAZOLKA","text":"Wh-What is that queer light!?"},{"name":"ALKAZOLKA","text":"Is that it!? Quick, after it!"},{"name":"ALKAZOLKA","text":"It will try to infect us! We must avoid that at all costs!"},{"name":"ALKAZOLKA","text":"Blech! What is this foul stuff!? Get it off me!"},{"name":"SURITOCARITO","text":"Your people will not face Nym's tragedy─not while I draw breath!"},{"name":"ALKAZOLKA","text":"Surito Carito! Sergeant!"},{"name":"ALKAZOLKA","text":"N-No... Nooooooooo!"},{"name":"ALKAZOLKA","text":"Gods above, <span class=\"highlight\">Forename</span>! No..."},{"name":"ALKAZOLKA","text":"Waaah! They're tonberries!"},{"name":"ALKAZOLKA","text":"V-Victory, <span class=\"highlight\">Forename</span>─come hells o-or..."},{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>!"},{"name":"ALKAZOLKA","text":"At long last..."},{"name":"WOUNDEDSOLDIER01676","text":"Waaah! M-M-Monster!"},{"name":"ALKAZOLKA","text":"For Limsa, for the tonberries, and for glory─attack!"},{"name":"MARINES01676","text":"(-Marines-)TO VICTORY─COME HELLS OR HIGH WATER!"},{"name":"ENEMY01676","text":"Deleted"},{"name":"OLDSAILOR01676","text":"Is...is it─"},{"name":"ALKAZOLKA","text":"Get back! It's trying to infect us!"},{"name":"SURITOCARITO","text":"No!"},{"name":"SURITOCARITO","text":"Now, <span class=\"highlight\">Forename</span>!"},{"name":"ENEMY01676","text":"Deleted"},{"name":"ALKAZOLKA","text":"Ahaha! We are victorious!"},{"name":"SURITOCARITO","text":"Yes... When I think on the horror it visited upon my people, I..."},{"name":"SURITOCARITO","text":"But now, no one else will share our fate. My thanks to you and Alka Zolka both."},{"name":"HALGATOLGA","text":"Aye, you've got my gratitude as well. Good to see proper <span class=\"emphasis\">Royal</span> Marines at it again."},{"name":"SURITOCARITO","text":"Indeed it is. Today, the torch is passed to you─may the Royal Marines evermore defend the people!"},{"name":"SAILOR01676","text":"An honor fighting beside you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! If you ever have need of us, you need only ask."},{"name":"OLDSAILOR01676","text":"Ain't common feelin' that safe in a battle. I reckon those Nymians knew what they were doin' with them scholars an' faeries. I'll have yer back, too, if ever ye need it."},{"name":"HALGATOLGA","text":"&lt;sniffle&gt; Bloody tonberry eyes, always running with─ Bah, who am I kidding? You did a fine job, a fine job indeed!"},{"name":"HALGATOLGA","text":"...But don't you dare think of easing up on your training on account of one victory! If you sully the name of my beloved marines, I'll flay the skin off your back!"},{"name":"ALKAZOLKA","text":"Imagine, <span class=\"highlight\">Forename</span>, defeating a voidsent over fifteen hundred years old... When we first met, I didn't dare think we'd achieve such things together."},{"name":"ALKAZOLKA","text":"The threat is gone, and the Royal Marines are born anew. Not a bad day's work, I daresay."},{"name":"ALKAZOLKA","text":"But we are far from finished. I do not know what threats the future holds, but they will not find us unprepared─not as long as I have aught to say about it. To victory, my friend─come hells or high water!"},{"name":"SURITOCARITO","text":"You have won a great victory today, my friend. Your allies will appreciate it if you tell them so."},{"name":"SURITOCARITO","text":"I have gathered the voidsent's remains. With careful research, they should yield the secrets I need to heal my people."},{"name":"SURITOCARITO","text":"I am not so naive as to believe the answers will come quickly. Yet the cure shall be ours one day."},{"name":"SURITOCARITO","text":"For now, my people will labor so that we may walk with yours towards a brighter dawn. I would see a future where we are part of the realm, not shunned by it."},{"name":"SURITOCARITO","text":"Thank you, my friend. Lily chose most wisely in you."},{"name":"SURITOCARITO","text":"Allow me to pass on to you one of Nym's mightiest abilities─Dissipation. It is a secret spell meant for use only by those scholars who have earned the full trust of their faerie companions. Use it with care."},{"name":"SURITOCARITO","text":"Now, I must return to my people, and you to yours. Fare you well, and may our efforts make tomorrow a brighter day!"},{"name":"SYSTEM","text":"This concludes the scholar quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next scholar quest will be available from Alka Zolka."}],"reward":{"gil":1149,"action":3587,"items":[{"id":20664}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":29}],"quests":[67211]},"next":[68459]},"partials":[{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"npc","id":"1013199","obj":{"i":1013199,"n":"Surito Carito","l":34,"q":1}},{"type":"npc","id":"1013141","obj":{"i":1013141,"n":"Alka Zolka","l":350,"q":1}},{"type":"npc","id":"1013142","obj":{"i":1013142,"n":"Alka Zolka","l":34,"q":1}},{"type":"npc","id":"1013143","obj":{"i":1013143,"n":"Alka Zolka","l":34,"q":1}},{"type":"npc","id":"1013146","obj":{"i":1013146,"n":"Alka Zolka","l":34,"q":1}},{"type":"npc","id":"1013147","obj":{"i":1013147,"n":"Soft Marine","l":34,"q":1}},{"type":"npc","id":"1013148","obj":{"i":1013148,"n":"Hardened Marine","l":34,"q":1}},{"type":"npc","id":"1013198","obj":{"i":1013198,"n":"Halga Tolga","l":34,"q":1}},{"type":"action","id":"3587","obj":{"i":3587,"n":"Dissipation","c":2810,"j":28,"t":4,"l":60}},{"type":"item","id":"20664","obj":{"i":20664,"n":"Savant's Attire Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67211","obj":{"i":67211,"n":"Unseen","g":156,"l":"Upper La Noscea","s":580,"f":1}},{"type":"quest","id":"68459","obj":{"i":68459,"n":"The Vanishing Act","g":156,"l":"Limsa Lominsa","s":601,"f":1}}]}