{"quest":{"name":"The Defiant Ones","location":"Ul'dah","id":67219,"patch":3.0,"sort":600,"icon":100438,"unlocksFunction":1,"eventIcon":71341,"issuer":1006752,"target":1006752,"involved":[1006753,1013066,1013187,1013188,1013189],"genre":154,"journal":["Lalai has learned the location of the Defiant's hidden base.","Lalai was recently approached by Zhai'a Nelhah, who announced that he had discovered the Defiant's base of operations before departing in a rush. It seems that the cultists lurk at the Burning Wall in eastern Thanalan. Hurry there with Lalai and meet with Zhai'a Nelhah before he attempts to confront them himself.","You rendezvous with Lalai, but see no sign of Zhai'a Nelhah. Lalai fears that he attacked the Defiant alone. It makes no difference. You have no choice but to descend the Burning Wall and search for Waldeve.","In the deepest depths of the Burning Wall, you encounter Waldeve. In defiance and desperation, he calls forth a great horror from the beyond. Knowing that his powers alone are insufficient─and despite Lalai's warnings of the inherent danger─he plans to control this monstrous voidsent such that all will fall in worship of him. Before he can enact his ghastly plot, Zhai'a Nelhah appears...and with reinforcements! Kazagg Chah, Dozol Meloc, and 269th Order Mendicant Da Za arrive to lend their strength, wisdom, and support. Waldeve's plan fails when, as predicted by Lalai, the voidsent turns on him, defeating him in an instant. This unspeakable, dangerous beast cannot be allowed to escape the Burning Wall. Slay it.<br><br>With the threat of the voidsent resolved, Zhai'a Nelhah steps forward to heal the grievous and brutal wounds that it inflicted upon Waldeve. The criminal is taken away into custody by Zhai'a Nelhah, who asks you to wait for him at Milvaneth Sacrarium, where he intends to thank you formally for your assistance in his investigation. Confer with Lalai.","Lalai decides to return to Ul'dah immediately. She suggests you do the same, but not before you speak with Kazagg Chah, Dozol Meloc, and 269th Order Mendicant Da Za, who assisted you in the battle. This is a valuable opportunity to renew your friendship with these powerful allies.","You thank the beastmen for their support. The bond you share with these noble magi will not be easily broken. Lalai still waits for you at Milvaneth Sacrarium. Return there and speak with her.","With Waldeve under arrest and awaiting sentencing by the Padjals, Zhai'a Nelhah returns to Milvaneth Sacrarium to give you his thanks for your assistance and the Book of Thal, which he recovered from Waldeve. Your actions in the recent battles with the Defiant have shown Zhai'a Nelhah the value of black magic when wielded with wisdom and prudence, and in aid of a noble goal. He hopes that, by entrusting the tome to Lalai's care, he can one day see an age of cooperation between healing and destructive magic.<br><br>※The next black mage quest will be available from Lalai once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Lalai at the Burning Wall.","Speak with Lalai.","Speak with Kazagg Chah.","Speak with Dozol Meloc.","Speak with 269th Order Mendicant Da Za.","Report to Lalai at Milvaneth Sacrarium."],"dialogue":[{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, your timing is impeccable! Just moments ago, Zhai'a Nelhah approached me."},{"name":"LALAI","text":"He ran up to me, all fuss and flurry, and told me he had found the Defiant's base of operations! He then departed before I could respond!"},{"name":"LALAI","text":"It seems that he is headed to that base himself. Though the Defiant's forces may well be weakened, it's utterly reckless to approach them alone. It's as though he has learned naught from the incident at Ishgard!"},{"name":"LALAI","text":"We should waste no time in traveling to the Defiant's den. Before he left, Zhai'a Nelhah mentioned that it was at the Burning Wall. I shall meet you there."},{"name":"LALAI","text":"Zhai'a Nelhah is in great danger. We must travel to the Burning Wall immediately!"},{"name":"KAZAGGCHAH","text":"No, I have seen no sign of Zhai'a Nelhah... But to think that the Defiant lurked so close! I shall prepare for battle and join you posthaste."},{"name":"LALAI","text":"Zhai'a Nelhah is nowhere to be seen. I fear he may have already fallen victim to the Defiant's destructive magicks."},{"name":"LALAI","text":"We have no choice but to press on. If Zhai'a Nelhah's intelligence was accurate, then Waldeve must be further down this road. Are you ready?"},{"name":"LALAI","text":"Waldeve! Give yourself up! Your followers lay defeated. You have nowhere left to run!"},{"name":"WALDEVE","text":"Hmph. There is no need for me to run."},{"name":"WALDEVE","text":"Mwahahaha! The summoning ritual is complete! All shall congregate in worship of my might!"},{"name":"WALDEVE","text":"I may not be powerful enough to rule this world <span class=\"emphasis\">alone</span>, but with this voidsent under my control, followers will flock from across the realm to kneel before me!"},{"name":"LALAI","text":"That voidgate... It's colossal! Whatever could he mean to summon!?"},{"name":"LALAI","text":"Waldeve, stop! Whatever comes through that portal, you'll never be able to control it!"},{"name":"WALDEVE","text":"Barghest! I summon thee! Present thyself and be bound to my will!"},{"name":"WALDEVE","text":"MwahahahaHAHAHAHAHA! Perhaps it's now <span class=\"emphasis\">you</span> who should run. Do you really think that the two of you can defeat me alone!?"},{"name":"ZHAIANELHAH","text":"(-???-)They are not alone!"},{"name":"ZHAIANELHAH","text":"Your evil plans end here, Waldeve!"},{"name":"LALAI","text":"Zhai'a! Where were you!?"},{"name":"KAZAGGCHAH","text":"Fool of a mage! You are lost to reason and shall be shown no mercy!"},{"name":"DOZOLMELOC","text":"Prepare yourself! Squaaawk! Here, we are! And at an end, your schemes are! Squaaawk!"},{"name":"DAZA","text":"<span class=\"highlight\">Forename</span>! We are here to help─aid, assist, help!"},{"name":"ZHAIANELHAH","text":"<span class=\"highlight\">Forename</span>! Lalai! Forgive my late arrival! I hope I am not too late to make a difference!"},{"name":"WALDEVE","text":"No. You are inconsequential."},{"name":"WALDEVE","text":"Barghest! Don't just stand there─destroy them!"},{"name":"WALDEVE","text":"No! <span class=\"emphasis\">NO</span>! Not me! <span class=\"emphasis\">Them</span>! Noooooo...!"},{"name":"ZHAIANELHAH","text":"A sorry end... Defeated by the very creature he summoned."},{"name":"LALAI","text":"It ought come as no surprise. He was playing with forces far beyond his reckoning."},{"name":"ZHAIANELHAH","text":"We can discuss it later. First let's deal with this voidsent!"},{"name":"LALAI","text":"You could not have arrived at a better time. We thought you were lost to us!"},{"name":"ZHAIANELHAH","text":"Hmph. Did you think I had rushed in alone? What manner of a fool do you take me for, to think that I would repeat so grave an error?"},{"name":"LALAI","text":"For a moment there, I thought he might strike him!"},{"name":"WALDEVE","text":"But...but why?"},{"name":"ZHAIANELHAH","text":"You are responsible for a great many deaths, and I have been tasked with bringing you to justice. I need you alive so that you may atone for your sins."},{"name":"ZHAIANELHAH","text":"<span class=\"highlight\">Forename</span>, Lalai. I owe you my thanks."},{"name":"ZHAIANELHAH","text":"First, I must see to Waldeve's incarceration. But once that is done, I shall return to Milvaneth Sacrarium and thank you properly."},{"name":"LALAI","text":"We, too, should return to Milvaneth Sacrarium. I'd hate to miss something as rare as a “thank you” from Zhai'a Nelhah!"},{"name":"LALAI","text":"But first, you should speak with our beastman companions. This is a valuable opportunity to rekindle our relations with them─it would be folly to waste it."},{"name":"KAZAGGCHAH","text":"The battle was well fought, <span class=\"highlight\">Forename</span>, well fought. But where do you rush to? Did Lalai not have more to say at the wall?"},{"name":"KAZAGGCHAH","text":"It is well the man was brought to justice. I harbor no regrets."},{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename</span>, my friend. Though we may be of different lands, the bond we share cannot be broken. I hope we can all meet again."},{"name":"DOZOLMELOC","text":"Squaaawk! All killed, the evil black mages are! Done here, Dozol is. Dozol's debt is now repaid."},{"name":"DAZA","text":"To all fight together again... It was a hard fight, but fun─enjoyable, satisfying, fun! Until we meet again, <span class=\"highlight\">Forename</span>!"},{"name":"KAZAGGCHAH","text":"There is no sorrow in this parting. Instead, consider it a vow to one day meet again. For now, it is best you return to Ul'dah."},{"name":"ZHAIANELHAH","text":"I'm sorry to have kept you waiting. Waldeve has been placed under arrest, and is awaiting sentencing by the Padjals."},{"name":"ZHAIANELHAH","text":"<span class=\"highlight\">Forename</span>, thank you for all your help."},{"name":"ZHAIANELHAH","text":"The Book of Thal was amongst his belongings. Lalai, I entrust it to your care."},{"name":"ZHAIANELHAH","text":"Are you sure? You've made your views on black magic very clear..."},{"name":"LALAI","text":"Our recent battles have shown me that black magic itself is not evil. It need only be used in the right way, in pursuit of the right goals."},{"name":"ZHAIANELHAH","text":"You have shown yourselves to be noble magi with pure intentions. I trust you to use the knowledge within this book wisely."},{"name":"ZHAIANELHAH","text":"That being said, I am a conjurer. Were I to witness black magic used with ill intent, I would not hesitate to take action. Even if it were you, Lalai, I would hunt you down without mercy."},{"name":"LALAI","text":"Come now, Zhai'a! Can't we have <span class=\"emphasis\">any</span> fun?"},{"name":"ZHAIANELHAH","text":"Haha... You'd do well to not forget that my order still considers your black magic forbidden."},{"name":"ZHAIANELHAH","text":"But if there were more magi like you... I hope this might become the first step towards a world in which both healing and destructive magicks can meet on the battlefield, not as enemies, but as allies."},{"name":"SYSTEM","text":"This concludes the black mage quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next black mage quest will be available from Lalai."},{"name":"QIB","text":"Make your way down the Burning Wall!"},{"name":"QIB","text":"Slay the barghest!"},{"name":"QIB","text":"The Defiant are lying in ambush. Proceed with caution!"},{"name":"QIB","text":"I shall see to healing! Unleash your destructive magicks upon the barghest!"},{"name":"QIB","text":"Voidsent are emerging from the voidgate! Destroy it quickly before more arrive!"},{"name":"QIB","text":"What!? It's grown a new head! Be careful!"},{"name":"QIB","text":"Another head!? Destroy it, quickly!"},{"name":"QIB","text":"No! How!? <span class=\"highlight\">Forename</span>, finish this..."},{"name":"QIB","text":"Alas! I am defeated..."},{"name":"QIB","text":"Sorry...<span class=\"highlight\">Forename</span>..."},{"name":"QIB","text":"No! Squaaawk! No!"},{"name":"QIB","text":"I am beaten... <span class=\"highlight\">Forename</span>...the voidsent..."}],"reward":{"gil":1466,"action":3577,"items":[{"id":20662}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":26}],"quests":[67218]},"next":[68124]},"partials":[{"type":"npc","id":"1006752","obj":{"i":1006752,"n":"Lalai","l":41,"q":16}},{"type":"npc","id":"1006753","obj":{"i":1006753,"n":"Kazagg Chah","l":44,"q":7}},{"type":"npc","id":"1013066","obj":{"i":1013066,"n":"Lalai","l":44,"q":1}},{"type":"npc","id":"1013187","obj":{"i":1013187,"n":"Lalai","l":44,"q":1}},{"type":"npc","id":"1013188","obj":{"i":1013188,"n":"269th Order Mendicant Da Za","l":44,"q":1}},{"type":"npc","id":"1013189","obj":{"i":1013189,"n":"Dozol Meloc","l":44,"q":1}},{"type":"action","id":"3577","obj":{"i":3577,"n":"Fire IV","c":2660,"j":25,"t":2,"l":60}},{"type":"item","id":"20662","obj":{"i":20662,"n":"Goetia Attire Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67218","obj":{"i":67218,"n":"Destruction in the Name of Justice","g":154,"l":"Ul'dah","s":580,"f":1}},{"type":"quest","id":"68124","obj":{"i":68124,"n":"Shades of Shatotto","g":154,"l":"Ul'dah","s":601,"f":1}}]}