{"quest":{"name":"Ooh Rah","location":"Upper La Noscea","id":67210,"patch":3.0,"sort":560,"icon":100441,"unlocksFunction":1,"eventIcon":71341,"issuer":1013135,"target":1013138,"involved":[1013139,1013140],"genre":156,"journal":["Your time away has not lightened Surito Carito's mood.","Surito Carito reveals his latest theory: the voidsent bound within the amphora unleashed the sickness upon Nym, and fled from its cage after cloaking itself with dark magicks. He says you must track down this invisible voidsent, but that even a scholar of his experience needs time to discover where to start. In the meantime, he asks that you and Alka Zolka focus on training, and introduces Halga Tolga to guide you. Speak with this former officer of the vaunted Nymian Royal Marines near Bronze Lake, and start learning things the hard way.","After dressing you down, Halga Tolga demands you show your commitment to the Royal Marines. Demonstrate your resolve now by entering any expression containing the phrase “come hells or high water” with the chat mode in <span class=\"highlight\">Say</span>.","Halga Tolga cannot hear you. Show your spirit again by entering any expression containing the phrase “come hells or high water” with the chat mode in <span class=\"highlight\">Say</span>.","Grudgingly, Halga Tolga admits you have the spirit of a Royal Marine. Now, he bids you prove that you have the courage of one by finding the leader of the Mamool Ja to the east of Bronze Lake. Mock him and his ways with a great big /laugh, and defend yourself if he should take exception to your actions.","You have outraged and defeated a band of Mamool Ja. Report back to Halga Tolga near the Wanderer's Palace for your debriefing.","Though not overly impressed by either Alka Zolka or you, Halga Tolga concedes that you show promise. However, he is abundantly clear that you have a long way to go. Focus on honing your own skills, he orders you, and you may be able to defeat the invisible voidsent. Someday.<br><br>※The next scholar quest will be available from Surito Carito upon reaching level 58."],"objectives":["Speak with Halga Tolga.","With the chat mode in <span class=\"highlight\">Say</span>, enter “come hells or high water” to show your resolve to Halga Tolga.","With the chat mode in <span class=\"highlight\">Say</span>, enter “come hells or high water” again to appease Halga Tolga.","Mock the Mamool Ja leader with a /laugh and defend yourself if he attacks.","Report to Halga Tolga."],"dialogue":[{"name":"SURITOCARITO","text":"Thank you for joining me. I gather your noses have not shrunk. And your ears...?"},{"name":"SURITOCARITO","text":"Good, then you are safe. I think the voidsent inside the amphora summoned its kind to distract you while it fled, magically concealed."},{"name":"SURITOCARITO","text":"Traces of this enchantment remain, but nothing else. There were no signs of toxin or miasma in the amphora. The corpses of the creatures you slew were likewise free of disease."},{"name":"ALKAZOLKA","text":"What? Does this mean our invisible voidsent is indeed what spread the sickness through Nym!?"},{"name":"SURITOCARITO","text":"That is what I have come to believe. As to why it fled, I can only suppose the long years bound within the vase robbed it of the strength to oppose you."},{"name":"ALKAZOLKA","text":"But surely it can regain that strength! My gods... If it does, the entire realm is at terrible risk!"},{"name":"SURITOCARITO","text":"It does pose a risk, but this is also an opportunity. If we can track it down and lay it low, its corpse may lead us to a cure!"},{"name":"ALKAZOLKA","text":"There is truth in that... Come, <span class=\"highlight\">Forename</span>, let us pursue this voidsent forthwith!"},{"name":"SURITOCARITO","text":"A moment, Alka Zolka. It will require all my skill to track the voidsent, and time besides. Moreover, you cannot afford to be defeated once I have found it. As such, I have requested the aid of an old companion."},{"name":"HALGATOLGA","text":"Realm's gone to shite if these sorry specimens're all the Royal Marines've got left. But they'll march like proper soldiers when I'm done, or my name isn't Halga Tolga!"},{"name":"ALKAZOLKA","text":"S-Sergeant Tolga!? <span class=\"highlight\">Forename</span>, do you understand who this is!? Before us stands the greatest drill instructor of the Nymian military! Come on─we have much and more to learn!"},{"name":"SURITOCARITO","text":"Halga will demand much of you, and subject you to seemingly unreasonable tasks. Know that he does this solely for your benefit."},{"name":"ALKAZOLKA","text":"No hardship is too great! I will become a marauder worthy of the Nymian military!"},{"name":"HALGATOLGA","text":"Think you've got what it takes to be a Royal Marine? Hah, you make me laugh! Ever worn glasses into battle, boy? Expect your foe to wait while you wipe blood from the lenses, do you!?"},{"name":"HALGATOLGA","text":"And the <span class=\"emphasis\">scholar</span>. Had a lot like you in the war. More use dead than alive! Having their corpses piled high around us kept us safer than their damned magicks ever did! You're a bloody joke!"},{"name":"HALGATOLGA","text":"But I'm here to turn you into Royal Marines, and Royal Marines you <span class=\"emphasis\">will</span> be! First, the creed! “To victory─come hells or high water.” Come on, let me hear you!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any expression that contains the phrase “come hells or high water” to demonstrate your resolve to Halga Tolga."},{"name":"SYSTEM","text":"come hells or high water"},{"name":"HALGATOLGA","text":"Are you a mammet or a scholar!? If you can't remember five bloody words, then what good are you!? Say “come hells or high water,” or get out of my sight!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any expression that contains the phrase “come hells or high water” to demonstrate your resolve to Halga Tolga."},{"name":"ALKAZOLKA","text":"To victory─come hells or high water!"},{"name":"HALGATOLGA","text":"How do you expect to strike fear into your enemies whispering like that!? Open your gobs, and say it like you mean it!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any expression that contains the phrase “come hells or high water” to prove yourself to Halga Tolga."},{"name":"ALKAZOLKA","text":"<span class=\"emphasis\">TO VICTORY─COME HELLS OR HIGH WATER, SIR</span>!"},{"name":"HALGATOLGA","text":"Well, you show spirit, I'll give you that... Now, to your tasks!"},{"name":"HALGATOLGA","text":"First, the scholar! There's a band of Mamool Ja sellswords that've been eyeing our palace. Walk up to them with a great, stupid grin, and <span class=\"highlight\">laugh</span> in the leader's face!"},{"name":"HALGATOLGA","text":"The whoresons'll hurl everything they've got at you for that. Acquit yourself well and you pass. Now go!"},{"name":"HALGATOLGA","text":"Too craven to laugh at a Mamool Ja!? Then you've no place in the Royal Marines! Do it or don't come back!"},{"name":"MAMOOLJAMERCENARYCAPTAIN","text":"Wh-Why you laugh? You think Mamool Ja <span class=\"emphasis\">funny</span>!? No! You funny! <span class=\"emphasis\">I</span> laugh, see!? AHAHA...ha... Er... You die now!"},{"name":"MAMOOLJAMERCENARYCAPTAIN","text":"What? You talk to Mamool Ja? No? Then who you talk to!?"},{"name":"HALGATOLGA","text":"Hah! You're both still alive. Not half bad!"},{"name":"HALGATOLGA","text":"But any real marine could've done it twice as fast! You truly are the sorriest excuse for a unit I have <span class=\"emphasis\">ever</span> seen!"},{"name":"ALKAZOLKA","text":"With all due respect, sir, the tasks you gave us were... I mean, what was I supposed to achieve by massaging that man with...<span class=\"emphasis\">salamander</span> oil?"},{"name":"HALGATOLGA","text":"You bloody fool! If you've got to ask, then clearly you learned <span class=\"emphasis\">nothing</span>! And you, scholar─are you going to tell me you don't know why I had you fight without a protector!?"},{"name":"HALGATOLGA","text":"Chaos reigns on the battlefield! The marines around you are all you've got, and they will <span class=\"emphasis\">die</span> for <span class=\"emphasis\">your</span> failings!"},{"name":"HALGATOLGA","text":"Marines, scholars─<span class=\"emphasis\">everyone</span> has to do whatever it takes to survive! To be all they can be!"},{"name":"HALGATOLGA","text":"Until you understand that, you're not fit to face even the weakest voidsent! That is all for today. Now get back to training─you're dismissed!"},{"name":"ALKAZOLKA","text":"Sir, yes, sir! I...I have been a fool, <span class=\"highlight\">Forename</span>! I will do as he says! To victory─come hells or high water!"},{"name":"ALKAZOLKA","text":"Whew... I have done many and more strange things in pursuit of my goals, <span class=\"highlight\">Forename</span>, but massaging a man with salamander oil is the strangest yet..."}],"reward":{"gil":650,"action":3585,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":29}],"quests":[67209]},"next":[67211]},"partials":[{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"npc","id":"1013138","obj":{"i":1013138,"n":"Halga Tolga","l":34,"q":1}},{"type":"npc","id":"1013139","obj":{"i":1013139,"n":"Mamool Ja Mercenary Leader","l":34,"q":1}},{"type":"npc","id":"1013140","obj":{"i":1013140,"n":"Alka Zolka","l":34,"q":1}},{"type":"action","id":"3585","obj":{"i":3585,"n":"Deployment Tactics","c":2808,"j":28,"t":4,"l":56}},{"type":"quest","id":"67209","obj":{"i":67209,"n":"False Friends","g":156,"l":"Upper La Noscea","s":540,"f":1}},{"type":"quest","id":"67211","obj":{"i":67211,"n":"Unseen","g":156,"l":"Upper La Noscea","s":580,"f":1}}]}