{"quest":{"name":"Black Books","location":"Ul'dah","id":67214,"patch":3.0,"sort":500,"icon":100438,"unlocksFunction":1,"eventIcon":71341,"issuer":1006752,"target":1006752,"involved":[1013042,1013043],"genre":154,"journal":["Lalai would entrust you with powerful spells left by Master Ququruka.","Lalai has stumbled upon an enciphered parchment among Ququruka's effects which reveals the whereabouts of tomes of magic thought to have been long lost─the Books of Nald'thal. As the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who has inherited Ququruka's legacy, Lalai believes that these tomes and the secrets they hold rightly belong to you. She bids you meet her at Nald's Reflection in southern Thanalan, there to search for the Book of Nald.","You have successfully retrieved the Book of Nald. Proceed now to Thal's Respite in eastern Thanalan and look for its twin, the Book of Thal.","You arrive at Thal's Respite only to find that the Book of Thal is no longer there. Lalai is determined to recover the tome before the secrets it holds can be used to cause great harm. Return to Milvaneth Sacrarium and speak with Lalai to deliberate on a course of action.","Evidence at the crime scene indicates that the Book of Thal was removed from its hiding spot but recently. As the tome is protected by an enchantment as its twin is, Lalai believes that there is still time to avert disaster. She expresses her intent to make discreet inquiries as to the location of the missing tome, and asks your permission to hold on to the Book of Nald for a thorough examination.<br><br>※The next black mage quest will be available from Lalai upon reaching level 52."],"objectives":["Speak with Lalai at Nald's Reflection.","Speak with Lalai at Thal's Respite.","Speak with Lalai at Milvaneth Sacrarium."],"dialogue":[{"name":"LALAI","text":"Ah, <span class=\"highlight\">Forename</span>. You come at a good time. I have made a remarkable discovery, which I would share with you."},{"name":"LALAI","text":"After Master Ququruka passed away, I went to his cell in the Marasaja Pit─the cell in which he spent a hundred years locked away."},{"name":"LALAI","text":"I doubted my master, and the guilt of it gnaws at my conscience. In order to atone, I decided to preserve the fruits of his research for future generations."},{"name":"LALAI","text":"Well, as I went about sorting through his personal effects, I found a most peculiar slip of parchment bearing a jumble of glyphs and sigils, which I instantly recognized to be a cipher."},{"name":"LALAI","text":"When I removed the cipher to reveal the hidden words, I could scarce believe my eyes! They described the whereabouts of two ancient tomes─the Books of Nald'thal."},{"name":"LALAI","text":"The tomes are said to contain the secrets of forbidden spells, and their existence has been hidden from even the Thaumaturges' Guild. Master Ququruka entrusted you with his legacy, <span class=\"highlight\">Forename</span>─he would want the tomes to be in your keeping."},{"name":"LALAI","text":"The first tome is said to be at Nald's Reflection, in southern Thanalan. Come, let us make haste and retrieve it!"},{"name":"LALAI","text":"The first tome is said to be at Nald's Reflection, in southern Thanalan. Come, let us make haste and retrieve it!"},{"name":"LALAI","text":"I have found the first tome, <span class=\"highlight\">Forename</span>─the Book of Nald! It lay not a fulm from where the parchment said it would be."},{"name":"LALAI","text":"But gods...I cannot stop trembling... My blood runs cold simply imagining the havoc that could be wreaked with the knowledge within..."},{"name":"LALAI","text":"Such power must be safeguarded lest it fall into the wrong hands. Let us make haste and retrieve its twin─the Book of Thal. It should be at Thal's Respite."},{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, the unthinkable has happened!"},{"name":"LALAI","text":"The chest is empty! The Book of Thal is gone!"},{"name":"LALAI","text":"Who could have taken it? Who else could have known?"},{"name":"LALAI","text":"Gods, if the tome's secrets were to be used for evil... This is an absolute disaster!"},{"name":"LALAI","text":"And my worries do not end there. Should the Thaumaturges' Guild somehow learn of the tomes' existence, they will stop at nothing to seal them away. That cannot be borne."},{"name":"LALAI","text":"Master Ququruka spent his lifetime restoring the knowledge of black magic to the world. We cannot suffer any part of it to be lost."},{"name":"LALAI","text":"At any rate, there is nothing more to be done here. Let us return to the Sacrarium and reassess the situation."},{"name":"ZHAIANELHAH","text":"(-Robed Figure-)There is nothing left for me here."},{"name":"LALAI","text":"I am sorry you had to see me lose my composure earlier, <span class=\"highlight\">Forename</span>."},{"name":"LALAI","text":"As I made my way back, I pondered the situation. When I found the chest, it was covered in a century's worth of dust. Some of that dust had been knocked loose by prying hands, and nothing had settled in its place."},{"name":"LALAI","text":"From this, it can be inferred that the tome was taken recently."},{"name":"LALAI","text":"Now, the tome we <span class=\"emphasis\">were</span> able to retrieve─the Book of Nald─is enciphered by an enchantment. I think it is safe to assume that its twin benefits from like protection."},{"name":"LALAI","text":"Such a protection will not be easily circumvented. It will take the thief time─time enough, I hope, for us to track him down, retrieve the tome, and avert disaster."},{"name":"LALAI","text":"But enough talk. I shall make some discreet inquiries into the missing tome. Oh, and if you do not mind, I would like to hold on to the Book of Nald for examination. In the meantime, I suggest you continue your training in the dark arts. We may have need of your skills again ere long."},{"name":"SYSTEM","text":"The next black mage quest will be available from Lalai upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1090,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":26}],"questsType":"all","quests":[66614,65964]},"next":[67215]},"partials":[{"type":"npc","id":"1006752","obj":{"i":1006752,"n":"Lalai","l":41,"q":16}},{"type":"npc","id":"1013042","obj":{"i":1013042,"n":"Lalai","l":45,"q":1}},{"type":"npc","id":"1013043","obj":{"i":1013043,"n":"Lalai","l":44,"q":1}},{"type":"quest","id":"66614","obj":{"i":66614,"n":"Always Bet on Black","g":154,"l":"Eastern Thanalan","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67215","obj":{"i":67215,"n":"An Unexpected Journey","g":154,"l":"Ul'dah","s":520,"f":1}}]}