{"quest":{"name":"An Unexpected Journey","location":"Ul'dah","id":67215,"patch":3.0,"sort":520,"icon":100438,"unlocksFunction":1,"eventIcon":71341,"issuer":1006752,"target":1006752,"involved":[1006753,1013044,1013046],"genre":154,"journal":["Lalai has acquired new information regarding the missing Book of Thal.","Evidence suggests that whoever stole the Book of Thal means to avail himself of the secrets within, leading Lalai to conclude that the thief is a black mage. She speculates that the individual may have attempted to make contact with other black mages, namely your three beastman friends. Proceed to Burgundy Falls in eastern Thanalan and ask Kazagg Chah whether he has had any unusual guests of late.","Kazagg Chah tells you that he was very recently attacked by a robed man who wielded black magic. Could this be the individual you seek? According to the Amalj'aa, the attacker will not have gotten far. Search for him in the surrounding area.","You have found a robed man, but he vehemently denies being the one who attacked Kazagg Chah. He suggests that you both pay the Amalj'aa a visit in order to clear up the matter.","A glance is enough for Kazagg Chah to confirm that the robed man is not his assailant. Introducing himself as Zhai'a Nelhah, a Hearer of Gridania, he informs you that the Seedseer Council has sent him to find a certain black mage. Upon hearing of the Book of Thal, Zhai'a Nelhah believes that he may learn something useful from Lalai, and decides to pay her a visit. Return to Milvaneth Sacrarium in Ul'dah and be present for the meeting.","In fretful tones, Zhai'a Nelhah explains that the man he is hunting, Waldeve, leads a cult of nefarious black mages. Waldeve was once a conjurer of Stillglade Fane, but he forsook the art of healing in order to sate his hunger for power. It seems clear that he is the thief who stole the Book of Thal, and with it seeks to unleash unspeakable destruction. Though their ideologies are completely at odds, in order to avert disaster, Zhai'a Nelhah and Lalai resign themselves to working with one another. After the Hearer takes his leave, Lalai teaches you a new spell─Ley Lines─which she deciphered from the Book of Nald. She bids you apply yourself to mastering the spell, and promises to let you know if there are any developments.<br><br>※The next black mage quest will be available from Lalai upon reaching level 54."],"objectives":["Speak with Kazagg Chah at Burgundy Falls.","Find the robed man.","Speak with Kazagg Chah.","Speak with Lalai at Milvaneth Sacrarium."],"dialogue":[{"name":"LALAI","text":"Ah, <span class=\"highlight\">Forename</span>, you come at a most opportune time. There is a task I would have you perform."},{"name":"LALAI","text":"In my search for the Book of Thal, I have drawn upon all my resources in the trading spheres. The tome has not appeared on the black market, nor has it found its way to a private collection."},{"name":"LALAI","text":"This tells us that the thief has made no effort to sell it. If we consider, then, the fact that he was able to open a magically sealed chest, we may safely assume that the suspect is a mage, and his interest in the tome is personal."},{"name":"LALAI","text":"However this individual came to know the existence of black magic, it seems plain he seeks to unlock the tome's secrets. To what end, it is too early to say, but at the very least we now have a lead."},{"name":"LALAI","text":"There are scarce few who share our knowledge of black magic: your three beastman friends who were present when Master Ququruka rendered up his last breath. It may be that the thief's identity is known to one of them."},{"name":"LALAI","text":"Begin your inquiries at Burgundy Falls, <span class=\"highlight\">Forename</span>. Find out if Kazagg Chah has had any suspicious visitors of late."},{"name":"LALAI","text":"It may be that one of your three beastman friends knows something of the thief. Begin your inquiries at Burgundy Falls, <span class=\"highlight\">Forename</span>. Find out if Kazagg Chah has had any suspicious visitors of late."},{"name":"KAZAGGCHAH","text":"<span class=\"highlight\">Forename</span>. I am glad to see you again, my friend. What brings you here this day?"},{"name":"KAZAGGCHAH","text":"That such tomes should exist... But to answer your question, aye, I have been visited by a suspicious man, and very recently. Though “visited” fails to capture the nature of our meeting."},{"name":"KAZAGGCHAH","text":"Not a bell ago, a robed man appeared before me. “Join me,” he said, “and together we shall master the dark arts!” A dubious offer, which I naturally declined. But no sooner had the words left my mouth than he unleashed a barrage of spells at me!"},{"name":"KAZAGGCHAH","text":"Though I could scarce believe it, I would swear that the spells he wielded were black magic."},{"name":"KAZAGGCHAH","text":"I warded off his attacks and countered with spells of my own, and he swiftly turned tail. All this happened but a short while ago. He cannot have gone far since then."},{"name":"KAZAGGCHAH","text":"If you mean to confront him, you would do well to exercise caution. Though he alone approached me, I felt the presence of others."},{"name":"KAZAGGCHAH","text":"The robed man who attacked me is like to be nearby still. If you mean to confront him, you would do well to exercise caution. He is not alone."},{"name":"ZHAIANELHAH","text":"Hm? What do you want? ...Wait. This aura."},{"name":"ZHAIANELHAH","text":"Yes, there is no mistake! You are a black mage, and you will lead me to <span class=\"emphasis\">him</span>! Now, speak...or I will make you wish you had!"},{"name":"Q1","text":"How will you respond?"},{"name":"A1","text":"But aren't <span class=\"emphasis\">you</span> a black mage?"},{"name":"A1","text":"I have no idea who you're talking about."},{"name":"ZHAIANELHAH","text":"Me? A black mage? How utterly ridiculous! Hmmm, perhaps you're not one of them, after all..."},{"name":"ZHAIANELHAH","text":"Hmmm, your confusion seems genuine. Perhaps you truly do not know..."},{"name":"ZHAIANELHAH","text":"I fear there has been a misunderstanding. I am not the villain who attacked the Amalj'aa, nor does it appear you are in league with him."},{"name":"ZHAIANELHAH","text":"I see you are disinclined to believe me. Well, the truth of my words is easily verified. Let us go to Burgundy Falls and see your friend together. I wished to have words with him at any rate."},{"name":"ZHAIANELHAH","text":"Let us go to Burgundy Falls and see your friend together. He will be able to attest the truth of my words."},{"name":"ZHAIANELHAH","text":"There is a misunderstanding that I wish to clear up. We meet for the first time, and that fact alone should suffice to settle the matter, but for the sake of formality, pray answer this question: am I the man who attacked you?"},{"name":"KAZAGGCHAH","text":"No, you are not. You bear scant resemblance to the villain."},{"name":"ZHAIANELHAH","text":"Now that the matter is behind us, allow me to introduce myself. I am Hearer Zhai'a Nelhah, of the Conjurers' Guild in Gridania."},{"name":"ZHAIANELHAH","text":"The Seedseer Council has sent me to find a man who wields black magic, the forbidden art of destruction."},{"name":"ZHAIANELHAH","text":"His trail led me to this area, where I chanced to witness him attacking your Amalj'aa friend. Alas, the villain beat a hasty retreat, and I lost sight of him in the confusion. You approached me shortly thereafter."},{"name":"ZHAIANELHAH","text":"You may not be connected to the man I seek, but you are a practitioner of the dark arts nonetheless. The aura is telltale, so don't even think to deny it. You must also answer to justice."},{"name":"ZHAIANELHAH","text":"The Books of Nald'thal? Matron preserve... I was not aware that such terrible tomes existed..."},{"name":"ZHAIANELHAH","text":"This woman, Lalai─she may well know something useful. I will pay her a visit...and I expect you to be there as well."},{"name":"KAZAGGCHAH","text":"I take it you intend to continue searching for the mystery black mage. Though I doubt that his skill is a match for yours, he has proven himself unpredictable and dangerous both. Be sure to keep your wits about you."},{"name":"KAZAGGCHAH","text":"I shall go to Da Za and Dozol Meloc and apprise them of the situation. For now, you would do well to return to Lalai."},{"name":"KAZAGGCHAH","text":"I will apprise Da Za and Dozol Meloc of the situation. Pray return to Lalai."},{"name":"ZHAIANELHAH","text":"By the gods... It's as if she has no ears to listen..."},{"name":"LALAI","text":"Thank Thal you have returned! This man, whom I have never seen before, charged up here and started berating me for meddling with forbidden arts! He had the nerve to call me a fool─<span class=\"emphasis\">thrice</span>!"},{"name":"ZHAIANELHAH","text":"Aye, and I will say it again: you are a fool! But the worst fool of all was your master Ququruka!"},{"name":"ZHAIANELHAH","text":"It is because of him that these miscreants are running rampant!"},{"name":"ZHAIANELHAH","text":"&lt;sigh&gt; Let me start again. I know about the Book of Thal...and I know the people who took it. They call themselves the “Defiant,” and their sole objective is to master the art of destruction."},{"name":"ZHAIANELHAH","text":"The man I have been tasked with finding is their leader. Waldeve is his name...and he used to be a conjurer of Stillglade Fane."},{"name":"ZHAIANELHAH","text":"The man harbored a deep hunger for power─the power over those he had sworn to protect. In order to satisfy this craving, he began dabbling in the dark arts."},{"name":"ZHAIANELHAH","text":"Before long, however, his doings were made known to the guild, who summarily banished him. But as he left, he declared that, one day, he will show the world the true power of black magic."},{"name":"ZHAIANELHAH","text":"For years, we heard naught of Waldeve. Some of us dared to hope that his words were but wind. Alas, he has returned, and this could only mean one thing: he is ready to make good on his promise."},{"name":"LALAI","text":"Gods preserve... A-Are you certain of this? That it is Waldeve who has taken the tome?"},{"name":"ZHAIANELHAH","text":"I am afraid so. It is no coincidence that the tome went missing at the same juncture the man reappeared. Even now, he continues instructing his minions in black magic, and every day that passes sees the cult grow into a bigger threat. If we are to move against them, we must do so now."},{"name":"LALAI","text":"I had assumed that we were dealing with a lone mage. But if it is an entire cult as you say, I will need to reconsider my plans."},{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, while you went about your investigation, I succeeded in deciphering a new spell in the Book of Nald. It should prove useful in the battles to come. I shall teach it to you forthwith!"},{"name":"ZHAIANELHAH","text":"What!? You mean to fight destruction with <span class=\"emphasis\">more</span> destruction!? This can only end in tragedy, I tell you!"},{"name":"LALAI","text":"Listen to me, Hearer! Waldeve and his cult may be a menace to the realm, but <span class=\"highlight\">Forename</span> is nothing like them. Master Ququruka <span class=\"emphasis\">himself</span> entrusted <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> with his legacy. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> will not misuse <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> power and cause carnage─on that you have my word."},{"name":"ZHAIANELHAH","text":"I cannot believe what I am hearing... Were the situation not so dire, I would bring you to justice without a moment's hesitation!"},{"name":"ZHAIANELHAH","text":"Fortunately for you, a greater threat looms over us all, and we must cooperate if disaster is to be averted. Your connections have proven useful before, and they may do so again. If you learn aught through them, I will thank you to send me word, but know that I'll not tolerate any interference in my investigation!"},{"name":"LALAI","text":"Gods! What an irksome, ignorant, insufferable idiot! To think that we must cooperate with him!"},{"name":"LALAI","text":"Heed not the mutterings of that stuck-up lout. We shall prepare for the gathering storm in our own way."},{"name":"LALAI","text":"Now, where were we? Ah, yes, the new spell. Ley Lines, it is called, and it will be a potent addition to your arsenal. While you go about mastering it, I will make further inquiries on the situation at hand. If there are any developments, you will be the first to know."},{"name":"SYSTEM","text":"The next black mage quest will be available from Lalai upon reaching level 54."}],"reward":{"gil":1043,"action":3573,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":26}],"quests":[67214]},"next":[67216]},"partials":[{"type":"npc","id":"1006752","obj":{"i":1006752,"n":"Lalai","l":41,"q":16}},{"type":"npc","id":"1006753","obj":{"i":1006753,"n":"Kazagg Chah","l":44,"q":7}},{"type":"npc","id":"1013044","obj":{"i":1013044,"n":"Zhai'a Nelhah","l":44,"q":1}},{"type":"npc","id":"1013046","obj":{"i":1013046,"n":"Zhai'a Nelhah","l":41,"q":1}},{"type":"action","id":"3573","obj":{"i":3573,"n":"Ley Lines","c":2656,"j":25,"t":4,"l":52}},{"type":"quest","id":"67214","obj":{"i":67214,"n":"Black Books","g":154,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"67216","obj":{"i":67216,"n":"A Cunning Plan","g":154,"l":"Ul'dah","s":540,"f":1}}]}