{"quest":{"name":"Unseen","location":"Upper La Noscea","id":67211,"patch":3.0,"sort":580,"icon":100441,"unlocksFunction":1,"eventIcon":71341,"issuer":1013135,"target":1013135,"involved":[1002279,1011231,1011234,1013275],"genre":156,"journal":["Surito Carito would again ask for your assistance.","Though he has done painstaking research, Surito Carito is stumped. He supposes that the voidsent's invisibility is uniquely suited to subverting Nymian wards. In the current day and age, however, he believes academics may know a way to reveal the unseen foe. Alka Zolka suggests that the Thaumaturges' Guild in Ul'dah may contain the sought-after information, and bids you speak with its receptionist, Yayake. Proceed there in hopes that the library holds a tome or two on the subject.","Upon speaking with Yayake, you learn a book on vanishing voidsent was once in the guild's collection. Now, it is somewhere in Coerthas, carried there by a researcher who has been missing since the Calamity. Yayake directs you to his last known destination: Falcon's Nest. Make your way there, and see if Ser Redwald knows anything.","After hearing your situation, Ser Redwald directs you to Soubinie. Visit the keeper of records and see if she knows anything of the missing researcher.","Soubinie informs you that the researcher left Falcon's Nest via a riverboat, the <span class=\"emphasis\">North Star</span>. However, the vessel ran aground during the Calamity. Though no passengers are thought to have survived, the ship itself remains. She suggests you search the ship on the stretch of water where it froze in the western highlands.","You find the sack of void scholar's effects aboard the <span class=\"emphasis\">North Star</span>, and the book you sought therein. Though the elements have not been kind, it is still legible. Present it to Surito Carito back near the Wanderer's Palace.","Surito Carito thanks you for the sack of void scholar's effects, and vows that he will find a way to trace the invisible voidsent. The day of reckoning draws near, and Surito bids you prepare yourself to face the fiend who spread the sickness.<br><br>※The next scholar quest will be available from Surito Carito upon reaching level 60."],"objectives":["Speak with Yayake at the Thaumaturges' Guild.","Speak with Redwald at Falcon's Nest.","Speak with Soubinie.","Search the <span class=\"emphasis\">North Star</span> on the Coerthas River.","Deliver the sack of void scholar's effects to Surito Carito."],"dialogue":[{"name":"SURITOCARITO","text":"How goes the training, friends?"},{"name":"ALKAZOLKA","text":"As <span class=\"highlight\">Forename</span>'s comrade-in-arms, it is clear that <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> prowess with the scholarly arts has increased immeasurably thanks to Sergeant Tolga's advice."},{"name":"ALKAZOLKA","text":"Alas, the same cannot be said for me... I had already thought myself a master of Nymian techniques, frankly, based on what I had gleaned from the tablets we uncovered. But the sergeant's training has robbed me of that notion."},{"name":"ALKAZOLKA","text":"I am still a novice. Until Sergeant Tolga says I am worthy, I wish to continue training!"},{"name":"SURITOCARITO","text":"Your ambition does you well, Alka Zolka. Stay true to this path, and you will become as fine a marine as ever marched under our banner."},{"name":"SURITOCARITO","text":"Well, I suppose I have no choice but to ask you to do the work of two, <span class=\"highlight\">Forename</span>."},{"name":"SURITOCARITO","text":"I have tried every method known to me to find our missing voidsent, but without success. It seems Nymian magicks will not suffice."},{"name":"ALKAZOLKA","text":"That comes as little surprise. This voidsent was in Mhach's thrall, and likely chosen for its ability to circumvent Nymian wards."},{"name":"SURITOCARITO","text":"Yes, which is why I hope your academics have answers I do not. Have you any writings on voidsent?"},{"name":"ALKAZOLKA","text":"I believe the Thaumaturges' Guild in Ul'dah has a collection dating back centuries, including some authored by their Belah'dian forefathers."},{"name":"SURITOCARITO","text":"Belah'dian, not Mhachi? Hmmm...perhaps they were the heirs to the voidmage legacy. In any case, this Ul'dah seems worth a visit. Will you go in my stead, <span class=\"highlight\">Forename</span>?"},{"name":"ALKAZOLKA","text":"I suggest you seek out Yayake. She is an old friend whose love of ancient tomes rivals mine own."},{"name":"ALKAZOLKA","text":"I wish I could see her in person. But I must continue my training, as well as look after the new recruits."},{"name":"MARAUDER01675","text":"(-Hardened Marauder-)One! Two! Three!"},{"name":"ALKAZOLKA","text":"To victory, <span class=\"highlight\">Forename</span>─come hells or high water!"},{"name":"SURITOCARITO","text":"It is good to see Halga active again."},{"name":"HALGATOLGA","text":"When I'm done with you whoresons, you <span class=\"emphasis\">might</span> be worthy of the Royal Marines! Until then, you're no better to me than pudding, and rotten pudding at that!"},{"name":"YAYAKE","text":"Welcome to the Thaumaturges' Guild. It is fate that has guided your steps here, friend."},{"name":"YAYAKE","text":"Ah, <span class=\"highlight\">Forename</span>! Is today the day you delve into the one hundred and eight volumes of fundamental thaumaturgical principle? No?"},{"name":"YAYAKE","text":"Ah, our own avatar of devastation. To what do we owe the pleasure?"},{"name":"YAYAKE","text":"Alka? Alka <span class=\"emphasis\">Zolka</span>? That is not a name I expected to hear! But I am glad my fellow booklover is well."},{"name":"YAYAKE","text":"Hmmm... I have indeed read of voidsent able to perfectly conceal their form. There was a tome on the subject─<span class=\"emphasis\">Unseen</span> was the title─penned in the Fifth Astral Era. Unfortunately, it is no longer a part of our collection."},{"name":"YAYAKE","text":"A member of the guild borrowed it for his research expedition, a project which was to last some few moons. However, that was five years ago, and he has not been heard from since."},{"name":"YAYAKE","text":"A pity. He proposed the most fascinating theories on voidsent, and traveled to the western highlands of Coerthas to put them to the proof. Alas, that area was rendered inhospitable by the Calamity..."},{"name":"YAYAKE","text":"There is a chance, of course, that the man is alive, and the book unharmed. We traced his journey as far as Falcon's Nest. Mayhap someone there can point you towards where he ventured next."},{"name":"YAYAKE","text":"If you are bent on retrieving that book, I suggest you make way for Falcon's Nest. The researcher who borrowed it from our library was last seen there before he vanished."},{"name":"REDWALD","text":"How now, adventurer?"},{"name":"REDWALD","text":"On the trail of a researcher who visited five years ago? Hm... That is not much to go on."},{"name":"REDWALD","text":"The garrison was still stationed here in those days. Soubinie is in charge of organizing the records. If any here know of your researcher, it will be her."},{"name":"REDWALD","text":"Soubinie has the records of all that happened here five years ago─or what remains of them."},{"name":"SOUBINIE","text":"Oh. H-Hello... How might I help you...?"},{"name":"SOUBINIE","text":"A man researching voidsent? Yes...yes, where was it he was mentioned?"},{"name":"SOUBINIE","text":"Ah, that's right. He stayed here for a time before taking the <span class=\"emphasis\">North Star</span> downriver..."},{"name":"SOUBINIE","text":"...Which was one among many sunk by that fearsome primal's rampage during the Calamity. The lucky few who made it to shore were then...eaten by vilekin!?"},{"name":"SOUBINIE","text":"Er... Well, the boat ran aground, and hasn't moved since the river froze over. You may wish to search the wreck yourself, though do be careful of the local wildlife."},{"name":"REDWALD","text":"To the Coerthas River, eh? The fastest way there is astride a black chocobo."},{"name":"SOUBINIE","text":"O-Oh! I thought you were going to search the <span class=\"emphasis\">North Star</span> in the Coerthas River."},{"name":"SURITOCARITO","text":"Have you found anything to aid our cause?"},{"name":"SURITOCARITO","text":"These things have all seen better days. Ah, but here is the book! And the writing is still legible."},{"name":"SURITOCARITO","text":"It will take time and patience, but I am hopeful its secrets will allow us to snare our invisible voidsent!"},{"name":"ALKAZOLKA","text":"Do mine ears deceive me, or did you track down a book? Splendid, <span class=\"highlight\">Forename</span>!"},{"name":"ALKAZOLKA","text":"As for me, I would like to think I've improved by leaps and bounds, thanks to Sergeant Tolga. The recruits are coming along nicely as well."},{"name":"ALKAZOLKA","text":"With a bit more training, every individual in our unit will be able and ready to face our voidsent foe in battle!"},{"name":"SURITOCARITO","text":"Very good. Then let us all attend to our tasks─the day of reckoning will be upon us soon enough."}],"reward":{"gil":2108,"action":3586,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":29}],"quests":[67210]},"next":[67212]},"partials":[{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"npc","id":"1002279","obj":{"i":1002279,"n":"Yayake","l":40,"q":9,"t":"Guild Receptionist"}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1011234","obj":{"i":1011234,"n":"Soubinie","l":2200,"q":2}},{"type":"npc","id":"1013275","obj":{"i":1013275,"n":"Halga Tolga","l":34,"q":1}},{"type":"action","id":"3586","obj":{"i":3586,"n":"Emergency Tactics","c":2809,"j":28,"t":4,"l":58}},{"type":"quest","id":"67210","obj":{"i":67210,"n":"Ooh Rah","g":156,"l":"Upper La Noscea","s":560,"f":1}},{"type":"quest","id":"67212","obj":{"i":67212,"n":"Forward, the Royal Marines","g":156,"l":"Upper La Noscea","s":600,"f":1}}]}