{"quest":{"name":"A Cunning Plan","location":"Ul'dah","id":67216,"patch":3.0,"sort":540,"icon":100438,"unlocksFunction":1,"eventIcon":71341,"issuer":1006752,"target":1006752,"involved":[1013047,1013048,1014319],"genre":154,"journal":["Lalai has received an unexpected letter.","Lalai has received a letter from 269th Order Mendicant Da Za. Though somewhat scarce of detail, the letter requests that you meet him at Bronze Lake. The timing of this unsolicited correspondence strongly suggests that Waldeve may be involved. Travel to Bronze Lake and ask Da Za what prompted this sudden communication while Lalai reluctantly informs Zhai'a Nelhah of this development.","You find Da Za at Bronze Lake. He explains that he was indeed approached by Waldeve. The man spoke of the Defiant and asked Da Za to share his knowledge of black magic. The wily kobold asked for time to reconsider, arranging another meeting and an opportunity to ambush the dangerous man with your assistance. Travel to the meeting point at the northeast of Bronze Lake and lie in hiding nearby while Da Za waits for Waldeve.","Before long, the leader of the Defiant, Waldeve, arrives. He seems to have recently come into ownership of an ancient tome left by Ququruka─no doubt the Book of Thal. Unfortunately, Da Za's cunning plan for capturing the renegade black mage failed to account for the possibility of the man simply walking away. Waldeve may be gone, but his cultists remain. They know of the secrets passed down to Da Za from his ancestor, and Ququruka's friend, Da Gu, and they plan to extract these secrets from him...by any means necessary. Intervene before the outnumbered kobold is overpowered.","The battle with the Defiant mages is vicious and short. There are no survivors. Assist Da Za and confirm that he is unharmed.","Da Za thanks you for your help, expressing his awe at the raw destructive power you brought to bear on his assailants. Zhai'a Nelhah, having heard of Da Za's letter from Lalai, arrives in time to witness only the aftermath of your fight. He is utterly incensed that you have left not a single cultist alive. Furious that this promising opportunity to question Waldeve's men has been squandered, he storms away to speak with Lalai. Return to Milvaneth Sacrarium and attempt to spare her from the Miqo'te's fury.","Zhai'a Nelhah confronts Lalai with the chilling parallels between your battle with the Defiant and the War of the Magi so many years ago. Though Lalai sympathizes with his concerns, she points out that it was not just black magic that brought about the Sixth Umbral Calamity─white magic, too, was involved. In any case, she doubts Zhai'a's claims that you were not in full control of your powers, and proves as much by entrusting you with even more powerful magicks that she gleaned from the Book of Nald in your absence.<br><br>※The next black mage quest will be available from Lalai upon reaching level 56."],"objectives":["Speak with 269th Order Mendicant Da Za.","Lie in wait at the specified location.","Slay the Defiant mages.","Aid Da Za.","Report to Lalai at Milvaneth Sacrarium."],"dialogue":[{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, I have received a letter from 269th Order Mendicant Da Za!"},{"name":"LALAI","text":"The moogles' reach extends further than I had realized. But that Da Za would contact us suggests that something is very much amiss."},{"name":"LALAI","text":"“I wait at Bronze Lake,” it says, and no more than that. Though perhaps somewhat cryptic, the letter's brevity suggests a sense of urgency."},{"name":"LALAI","text":"Please hurry to Bronze Lake and investigate the situation! I shall inform Zhai'a Nelhah of this development. Though I doubt the fool can render much assistance, I gave my word that we would cooperate."},{"name":"LALAI","text":"Please hurry to Bronze Lake and meet with Da Za. I shall inform Zhai'a Nelhah of the letter."},{"name":"DAZA","text":"<span class=\"highlight\">Forename</span>! I am glad to see you─pleased, happy, glad."},{"name":"DAZA","text":"Kazagg Chah has told me what happened. This is grim news. Yes, yes, grim news indeed."},{"name":"DAZA","text":"The man Kazagg Chah spoke of approached me, too. Spoke of the Defiant. Said he wanted my knowledge─wisdom, insight, knowledge."},{"name":"DAZA","text":"I told him I needed time to think─consider, ponder, think. I told him to return later. When he returns, we shall ambush him! Yes, yes, a sound plan, I think."},{"name":"DAZA","text":"I told him to meet me northeast of Bronze Lake. I shall approach as normal─as bait. <span class=\"highlight\">Forename</span>, you lie in wait─ambush, hiding, wait."},{"name":"DAZA","text":"You! Are you the leader of the Defiant?"},{"name":"WALDEVE","text":"My name is Waldeve. And you─you are descended from 1st Order Patriarch Da Gu, yes?"},{"name":"DAZA","text":"Da Gu was my ancestor─progenitor, forebear, ancestor... You know him?"},{"name":"WALDEVE","text":"I've had opportunity to peruse a fascinating tome left by Ququruka. In it, Da Gu is mentioned as a confidant who assisted the master in his studies of the dark arts."},{"name":"WALDEVE","text":"It also states that Ququruka intended to entrust the secrets of his research to those same confidants. I fully expect you to tell me all about these secrets."},{"name":"DAZA","text":"Then you are wrong─mistaken, incorrect, wrong! I shall reveal <span class=\"emphasis\">nothing</span> to the likes of you!"},{"name":"WALDEVE","text":"Hmph. I'm a busy man, Da Za. If you refuse to cooperate, I simply don't have time for you."},{"name":"DAZA","text":"Wait! Where are you going!?"},{"name":"WALDEVE","text":"You might have made a powerful ally...but as an enemy, you cannot be suffered to live."},{"name":"WALDEVE","text":"Find out everything he knows. Then kill him."},{"name":"DAZA","text":"Thank you, <span class=\"highlight\">Forename</span>! Those Defiant didn't stand a chance! No, no, no chance at all!"},{"name":"DAZA","text":"But Waldeve got away─fled, escaped, got away."},{"name":"ZHAIANELHAH","text":"<span class=\"highlight\">Forename</span>! Lalai relayed to me what happened."},{"name":"ZHAIANELHAH","text":"These men... Were they Defiant mages?"},{"name":"ZHAIANELHAH","text":"You fool! You've killed every last one of them! How do you intend for us to question them now!?"},{"name":"ZHAIANELHAH","text":"I knew this would happen. You black mages are quick to wield your destructive powers, but rarely do you consider the consequences."},{"name":"ZHAIANELHAH","text":"We must return to Lalai. Do not think that I'll forget about what you have done here."},{"name":"DAZA","text":"Were you not in full control of your powers? Did your magicks run wild─amok, untamed, wild?"},{"name":"DAZA","text":"Whatever the case, I do know that you saved me─rescued, protected, saved."},{"name":"DAZA","text":"Thank you, <span class=\"highlight\">Forename</span>. I owe you my life."},{"name":"DAZA","text":"You should hurry to Ul'dah. Much as you protected me from the Defiant, I suspect Lalai may benefit from protection from that Miqo'te. Yes, yes, hurry to Ul'dah."},{"name":"DAZA","text":"Hurry back to Ul'dah, <span class=\"highlight\">Forename</span>. Stop Lalai and the Miqo'te from fighting─quarreling, bickering, fighting."},{"name":"ZHAIANELHAH","text":"Hmph. You're finally here."},{"name":"LALAI","text":"<span class=\"highlight\">Forename</span>, Zhai'a Nelhah has been standing there, silently fuming, for quite some time now. What has transpired?"},{"name":"LALAI","text":"So it was indeed Waldeve that stole the Book of Thal. And he has been studying the magicks inscribed within."},{"name":"LALAI","text":"But did truly not a single Defiant survive? I somehow doubt that you are fully responsible for─"},{"name":"ZHAIANELHAH","text":"I care not for your doubts! I explicitly told you not to interfere in my investigation!"},{"name":"ZHAIANELHAH","text":"If nothing else, this shows the bloody outcome of a battle between opposing black mages."},{"name":"ZHAIANELHAH","text":"Fighting destructive power with more destructive power... It's such thinking that led to the War of the Magi. I'm sure I needn't remind you of the outcome of that war."},{"name":"ZHAIANELHAH","text":"I strongly recommend you give some thought to just how terrible a force you toy with."},{"name":"LALAI","text":"The War of the Magi... I suppose I cannot blame him for seeing the parallels. A war between forces commanding unimaginably destructive magical power. But black magic is not purely to blame. It was the violent confluence of black <span class=\"emphasis\">and</span> white magic that ultimately led to disaster."},{"name":"LALAI","text":"It brought about the Sixth Umbral Calamity. It is only natural that the risk of a reoccurrence of those terrible events would instill great fear."},{"name":"LALAI","text":"I know you would never be so reckless as to allow something like that to happen."},{"name":"LALAI","text":"The problem lies not with black magic, but with the Defiant. I am disinclined to pay heed to Zhai'a Nelhah's words when they run counter to those of Da Za, who witnessed the battle firsthand."},{"name":"LALAI","text":"I find it hard to believe that you would lose control of your powers. There must be some other explanation for the deaths of those mages..."},{"name":"LALAI","text":"It also seems that Waldeve is gathering something of a following. To better oppose this growing menace, I shall teach you a new spell I recently deciphered from the Book of Nald."},{"name":"LALAI","text":"Remember, <span class=\"highlight\">Forename</span>, black magic is not a thing to be feared. As a true black mage, you have the power to control it. I believe in you."}],"reward":{"gil":1462,"action":3574,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":26}],"quests":[67215]},"next":[67217]},"partials":[{"type":"npc","id":"1006752","obj":{"i":1006752,"n":"Lalai","l":41,"q":16}},{"type":"npc","id":"1013047","obj":{"i":1013047,"n":"269th Order Mendicant Da Za","l":34,"q":1}},{"type":"npc","id":"1013048","obj":{"i":1013048,"n":"269th Order Mendicant Da Za","l":34,"q":1}},{"type":"npc","id":"1014319","obj":{"i":1014319,"n":"Zhai'a Nelhah","l":41,"q":1}},{"type":"action","id":"3574","obj":{"i":3574,"n":"Sharpcast","c":2657,"j":25,"t":4,"l":54}},{"type":"quest","id":"67215","obj":{"i":67215,"n":"An Unexpected Journey","g":154,"l":"Ul'dah","s":520,"f":1}},{"type":"quest","id":"67217","obj":{"i":67217,"n":"Black Squawk Down","g":154,"l":"Ul'dah","s":560,"f":1}}]}