{"quest":{"name":"Staying Alive","location":"Eastern La Noscea","id":67223,"patch":3.0,"sort":580,"icon":100436,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1001208,1013910,1013911,1013912,1014674,1014871,1015302,1015303],"genre":152,"journal":["Oboro's tense jaw indicates something is up.","The Truehounds' auction has come and gone, and the Yatsurugi clan's blade has been sold to an Ishgardian collector who paid extra to have the dagger taken directly to his home. Princess Yuki plans to attack the transit directly in order to reclaim the dagger. To make matters easier, Oboro then suggests that you swap the pirates' pluto for lavender incense, that you might use their dependence against them and send them to sleep. He proposes that the four of you split up. He and Akagi will find where the Truehounds are keeping their stores in Limsa Lominsa, while you and the princess will purchase the incense from Kyokyoroon in Hawkers' Alley. Yuki, as usual, takes off in a huff, leaving you to follow behind her with the sack of gil to pay the merchant.","Shortly after purchasing a sack of lavender incense from Kyokyoroon, Yuki receives an unpleasant surprise─a pair of her vassals from the Far East has come in search of her. The princess deftly avoids their gaze, and vanishes with Akagi. A bemused Oboro instructs you to leave the princess to him, and asks that you make your way to Fisherman's Bottom. Once there, switch the pluto for the lavender incense.","The Truehounds will now fall into a deep slumber instead of receiving their usual stimulation. Now, wait near the docks and watch to make certain the guards do not detect your ruse.","You wait and listen as two Truehounds discuss their planned route─sail to Dravania, and go on foot from there to Ishgard. As the journey is long, and their crates heavy, they plan to stop once in the Smoldering Wastes and there take their “pluto.” With all parties in agreement that this would be the ideal place to strike, make your way to the Dravanian forelands and rendezvous with Princess Yuki and Oboro.","You arrive to find that Oboro's plan worked perfectly, with several Truehounds already snoring nearby and Yuki searching through their crates. However, as she has not yet found the Midare Kanemitsu dagger, and there are yet more Truehounds in the area, she bids you join Akagi and Oboro in their own patrols. Proceed to keep a lookout to the southwest, and dispatch any enemies that may come your way.","You have made short work of the Truehound patrol. Return to where Yuki was looking and see if Oboro and Akagi have anything to report from their own search.","You find Oboro none the worse for wear after his patrol. However, Akagi was not exaggerating his lack of martial prowess, and has sustained a serious injury. The princess joins you, triumphantly announcing that the last of her clan's treasures is again hers. However, both you and Oboro feel the hair on the back of your necks stand up. You turn to see Redway standing but a few yalms away. Instead of attacking, however, the man offers an ultimatum: the princess comes with him, or her vassals who recently came to Eorzea die. Unable to refuse, the princess walks away, leaving you with a single command: tend to Akagi. Beaten, Oboro orders you all to return to the dock storehouse.","Though you have lost this battle, Oboro is intent that you not lose the war; Princess Yuki did not forbid you from mounting a rescue. Await the day when Akagi is healed, as is your duty as a shinobi, and then save the princess from Redway and Rosalinde's clutches.<br><br>※The next ninja quest will be available from Oboro upon reaching level 60."],"objectives":["Deliver the sack of gil to Kyokyoroon in Hawkers' Alley.","Switch the pluto for the sack of lavender incense near Fisherman's Bottom.","Lie in wait at the designated location.","Speak with Yuki in the Smoldering Wastes.","Keep watch at the specified location.","Speak with Oboro.","Speak with Oboro at the dock storehouse."],"dialogue":[{"name":"YUKI","text":"I must retake the last treasure..."},{"name":"AKAGI","text":"It's a great feelin', havin' a roof over my head again!"},{"name":"OBORO","text":"It seems the Truehounds have already held their auction, <span class=\"highlight\">Forename</span>."},{"name":"OBORO","text":"Some collector bought the Yatsurugi clan's dagger. However, the princess's reputation has kept him trembling at home, and he paid a small fortune to have the blade brought directly to Ishgard."},{"name":"YUKI","text":"So, we strike while it is on the move. I look forward to taking it back from the Truehounds─though there is still the question of their guard."},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>, you mentioned the pirates regularly use pluto, yes? Should someone exchange this for a powerful sleep draught, such as lavender incense..."},{"name":"YUKI","text":"Couldn't we just face them out in the open? Or is there something in the shinobi code that forbids straightforward solutions?"},{"name":"OBORO","text":"Nothing so formal, Princess, but a stealthy approach best allows us to carry out your orders: stay alive, and retake the treasure."},{"name":"OBORO","text":"The Truehounds base their operations in La Noscea. They will supply themselves in Limsa for the journey north─a weakness we can exploit by dividing into two groups."},{"name":"OBORO","text":"Akagi and I will search for the Truehounds' supplies. Princess, you and <span class=\"highlight\">Forename</span> will visit Kyokyoroon in Hawkers' Alley."},{"name":"OBORO","text":"I have been informed the shopkeep has lavender incense in stock."},{"name":"YUKI","text":"Is this a jest? I'm perfectly capable of going shopping without <span class=\"highlight\">Forename</span>'s help!"},{"name":"OBORO","text":"&lt;sigh&gt; Here, <span class=\"highlight\">Forename</span>─the funds to purchase the incense. Good luck."},{"name":"AKAGI","text":"&lt;sigh&gt; Never asks for anybody's help, does she?"},{"name":"OBORO","text":"I fear the princess will find shopping to be more of a challenge than she thinks without sufficient funding..."},{"name":"YUKI","text":"<span class=\"highlight\">Forename</span>! You, ah... I seem to...er..."},{"name":"KYOKYOROON","text":"Kyokyoroon puzzled by puzzling customer. She makes demanding demands, but has no shinies."},{"name":"KYOKYOROON","text":"Trade for incense? Kyokyoroon promise─good for good night's rest. Breathe deeply for deep, deep sleep!"},{"name":"YUKI","text":"Look, I just forgot my coinpurse. That's all! Anyway, you have the incense now─does it matter who paid? And where are Akagi and Oboro?"},{"name":"KASHINA01687","text":"(-???-)What was she thinking coming all this way!? Her mother would've died of shock had she lived to read that note!"},{"name":"YUKI","text":"Th-That voice... N-No...! They can't... Not <span class=\"emphasis\">here</span>!"},{"name":"KASHINA01687","text":"How the princess doesn't realize she is our land's sole ray of light is quite beyond me. If we don't bring her home, I shudder to think what will happen!"},{"name":"YUKI","text":"Gods, why would they come here? I <span class=\"emphasis\">told</span> them I'd be back. Just...after I found the treasures."},{"name":"AKAGI","text":"Princess! Princess Yuki! Did you─"},{"name":"YUKI","text":"Shut up, you oversized oaf! We're leaving <span class=\"emphasis\">now</span>!"},{"name":"AKAGI","text":"Princess, what'd I do? <span class=\"emphasis\">Princess</span>!?"},{"name":"OBORO","text":"...I suspect I am better off not knowing. In any case, the Truehounds are storing their supplies near Fisherman's Bottom. I will follow the princess. You go and make the switch before the guards return."},{"name":"OBORO","text":"Quickly, <span class=\"highlight\">Forename</span>, you must switch the pluto for the sleeping draught before the guards come back."},{"name":"ZOKUA01687","text":"Well, that's the last of it. How's it we're gettin' to Ishgard?"},{"name":"ZOKUB01687","text":"Captain won't go within twenty yalms o' the Shroud, mate. We sail to the Dravanian hinterlands, an' hook back around west from there."},{"name":"ZOKUA01687","text":"&lt;whistle&gt; Fair bit of land between there an' the Holy See. What if we stopped off in the Smoldering Wastes? A dose of our <span class=\"emphasis\">medicine</span>'ll carry us the rest of the way, eh?"},{"name":"ZOKUB01687","text":"Don't bleat that to the whole harbor! I've heard the thief's after this haul. That's why we're takin' twice the guards. Heh, I'd like to see her try an' take it now!"},{"name":"AKAGI","text":"They'll take the sleepin' draught and be out like babes! Come on, let's hurry to... Er, where was it, again?"},{"name":"OBORO","text":"The Smoldering Wastes. <span class=\"highlight\">Forename</span>, what manner of place is it? I have never visited Dravania myself."},{"name":"OBORO","text":"Ah, thank you. The princess and I are both experienced travelers, and we will meet you there."},{"name":"YUKI","text":"<span class=\"highlight\">Forename</span>! Oboro's plan worked!"},{"name":"YUKI","text":"But not all the patrols have reported in for their pluto. They could be back at any moment."},{"name":"YUKI","text":"Stand guard while I search these crates. The Midare Kanemitsu's got to be in one of them."},{"name":"YUKI","text":"Take the south─Akagi's to the north, Oboro's to the east. When you've finished your own patrol, return here. They should both be back by then, as well."},{"name":"YUKI","text":"But as I said, no matter what happens, do <span class=\"emphasis\">not</span> lay down your life for mine."},{"name":"YUKI","text":"Where in the hells is it!?"},{"name":"AKAGI","text":"&lt;groan&gt;"},{"name":"AKAGI","text":"I <span class=\"emphasis\">told</span> you I'm no good in a real fight!"},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>, Akagi is wounded. We must tend to him once we are out of danger's path."},{"name":"YUKI","text":"I found it! Haha, everyone back home will be so happy! It's over, my friends─I can finally bring prosperity to my lands. It...it will all be all right!"},{"name":"OBORO","text":"Splendid! Then let us─<br>...Wait. Do you sense it, too, <span class=\"highlight\">Forename</span>?"},{"name":"OBORO","text":"The foe is near."},{"name":"REDWAY","text":"You played a clever trick, Oboro, but not clever enough! No liquor or pluto ever passes these lips, and now I've found you."},{"name":"REDWAY","text":"What to do, what to do? Three able and one lame <span class=\"emphasis\">could</span> make for an interesting fight, yes. But I hold all the cards─why risk it?"},{"name":"REDWAY","text":"I've come to offer the princess an invitation. Your countrymen miss you <span class=\"emphasis\">so</span> terribly. They've called for you, <span class=\"emphasis\">cried</span> your name ever since we caught them. Surely, you'll want to join them, yes?"},{"name":"OBORO","text":"What!? Princess, no!"},{"name":"YUKI","text":"Put up your blades. Fate played us for fools."},{"name":"YUKI","text":"Redway...I'll go."},{"name":"REDWAY","text":"Ahahaha! Look at me now, Gekkai! I won! I've beaten your <span class=\"emphasis\">proper</span> Doman shinobi!"},{"name":"REDWAY","text":"Oh, but you'll try to rescue her, won't you? If I see <span class=\"emphasis\">anything</span> out of the ordinary, Oboro, I will slit their throats. Yes, yes, <span class=\"emphasis\">starting</span> with Yuki's!"},{"name":"YUKI","text":"...See to Akagi, shinobi. Farewell."},{"name":"AKAGI","text":"Don't just let them get away! After her, Oboro! Dammit, man, <span class=\"emphasis\">move</span>, or I'll...argh!"},{"name":"OBORO","text":"Wait. <span class=\"highlight\">Forename</span>, you can pursue her if you wish, but you <span class=\"emphasis\">must</span> see to Akagi's wounds. That was the princess's order."},{"name":"OBORO","text":"I know we could have fought. But I understand why she chose not to. Had Redway escaped, his hostages' lives would have been forfeit─more dead in her defense."},{"name":"OBORO","text":"&lt;sigh&gt; The decision was hers to make. It is not our place to question it."},{"name":"OBORO","text":"We can do nothing more for now. Let us return to La Noscea, and tend to Akagi there."},{"name":"OBORO","text":"Akagi is distraught, but alive. I will tend to his wounds in your place."},{"name":"OBORO","text":"But the moment he is better, we will mount a rescue! The princess did not forbid us from trying, and I would hate to see Redway win."},{"name":"OBORO","text":"For the moment, train your mind, practice your blade. You will need all of your skill in our next battle."}],"reward":{"gil":1913,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":92}],"quests":[67222]},"next":[67224]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1001208","obj":{"i":1001208,"n":"Kyokyoroon","l":29,"q":4}},{"type":"npc","id":"1013910","obj":{"i":1013910,"n":"Yuki","l":1428,"q":2}},{"type":"npc","id":"1013911","obj":{"i":1013911,"n":"Akagi","l":1428,"q":2}},{"type":"npc","id":"1013912","obj":{"i":1013912,"n":"Yuki","l":2000,"q":1}},{"type":"npc","id":"1014674","obj":{"i":1014674,"n":"Oboro","l":29,"q":1}},{"type":"npc","id":"1014871","obj":{"i":1014871,"n":"Yuki","l":29,"q":1}},{"type":"npc","id":"1015302","obj":{"i":1015302,"n":"Oboro","l":2000,"q":1}},{"type":"npc","id":"1015303","obj":{"i":1015303,"n":"Akagi","l":2000,"q":1}},{"type":"quest","id":"67222","obj":{"i":67222,"n":"Medieval Espionage","g":152,"l":"Eastern La Noscea","s":560,"f":1}},{"type":"quest","id":"67224","obj":{"i":67224,"n":"In Her Defense","g":152,"l":"Eastern La Noscea","s":600,"f":1}}]}