{"quest":{"name":"Sky's the Limit","location":"Coerthas Central Highlands","id":67225,"patch":3.0,"sort":500,"icon":100489,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1006748,"involved":[1013437],"genre":150,"journal":["Ser Alberic is mustering reinforcements for a battle.","Ser Alberic informs you that a host of dragons has been wreaking havoc within Ishgardian territory. Though the Holy See's best dragoons have been dispatched to deal with the threat, they are sorely outnumbered and are struggling to gain the upper hand. Even now, a unit is locked in a fierce struggle northwest of Whitebrim Front, and is in dire need of reinforcements. Ser Alberic means to answer the call, and bids you join him. Make haste to the location of the battle.","With your aid, the Ishgardians succeed in putting the enemy to rout. Shortly thereafter, Ser Alberic arrives in the company of another dragoon, who introduces herself as Heustienne, one of your instructors during your trials. Impressed by your distinct fighting style, she asks to be taken on as your pupil. Consider her request, and convey your decision to Ser Alberic at the Observatorium.","You have agreed to accept Heustienne as your pupil. “As we teach, so too do we learn”─with these words in mind, go forth and strive to reach new heights as a dragoon.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 52."],"objectives":["Speak with the wounded dragoon northwest of Whitebrim Front.","Speak with Alberic."],"dialogue":[{"name":"ALBERIC","text":"<span class=\"highlight\">Forename</span>! You...you have not succumbed to the Eye's influence? The Fury be praised... Word had reached me of Estinien's fate, and I could not help but fear for you. I am relieved to see that my fears were unfounded."},{"name":"ALBERIC","text":"<span class=\"highlight\">Forename</span>. I am pleased to see that you are in control of the dragon within. Nonetheless, I must remind you to remain vigilant at all times. It takes but a moment of weakness for the Eye to make you its thrall."},{"name":"ALBERIC","text":"Now, forgive me this abrupt change in subject, but we have urgent need of your lance. Some days ago, a horde of dragons began wreaking bloody havoc within Ishgardian territory."},{"name":"ALBERIC","text":"An elite regiment of dragoons has been dispatched to deal with this threat. Alas, though they fight bravely, they are sorely outnumbered, and are struggling to gain the upper hand."},{"name":"ALBERIC","text":"Indeed, but moments before you arrived, we received a request for reinforcements from a unit engaged in battle north and west of Whitebrim."},{"name":"ALBERIC","text":"A fellow dragoon and I will go to their aid, and we should be grateful for your presence. Pray go on ahead─we shall follow anon."},{"name":"ALBERIC","text":"The battle rages to the north and west of Whitebrim. Pray go on ahead─we shall follow anon."},{"name":"KISHI01689","text":"I owe you my life. That beast would have torn me limb from limb."},{"name":"ALBERIC","text":"Our lances were not needed, 'twould seem. Such is the might of the Azure Dragoon."},{"name":"HEUSTIENNE","text":"(-Mystery Dragoon-)You have not pledged allegiance to Ishgard, yet you came to our aid nonetheless. For that, we are grateful. Their deaths thus avenged, our comrades may go to their rest in peace."},{"name":"KISHI01689","text":"My lady, I shall attend to the fallen."},{"name":"HEUSTIENNE","text":"(-Mystery Dragoon-)'Tis an honor to see you again, my friend. Though it appears I am not remembered? I suspect the armor is to blame..."},{"name":"HEUSTIENNE","text":"Permit me to introduce myself anew. I am Heustienne of the Order of the Knights Dragoon, and I had the pleasure of assisting in your training."},{"name":"HEUSTIENNE","text":"As we approached, Ser Alberic and I bore witness to the final moments of the battle. I could not help but notice that, though you have been instructed in our ways, there was something distinct about the manner in which you fought."},{"name":"ALBERIC","text":"I believe I know the reason why. As an adventurer, you have done battle with foes the realm over. Through these many encounters, your techniques have evolved to produce a style that sets you apart from we who fight dragons exclusively."},{"name":"HEUSTIENNE","text":"Such insights you must possess... If I may speak frankly, I wish to train under you. Will you accept me as your pupil?"},{"name":"HEUSTIENNE","text":"You see, a fearsome dragon has been terrorizing Coerthas of late. Graoully is its name, and I have been charged with leading a mission to slay it."},{"name":"HEUSTIENNE","text":"Though I have stepped up to lead the Order in the interim, I am not confident of my chances against the creature. Such is its ferocity and cunning."},{"name":"HEUSTIENNE","text":"Though I am second-in-command in the Order, I am not confident of my chances against the creature. Such is its ferocity and cunning."},{"name":"HEUSTIENNE","text":"If I am to triumph over Graoully, I must needs grow stronger. And I believe I can...under your tutelage. What say you? Will you consent to training me?"},{"name":"ALBERIC","text":"As we teach, so too do we learn. This I know from experience. I wholeheartedly urge you to accept Heustienne as your pupil."},{"name":"HEUSTIENNE","text":"You need not give me an answer right this moment. Think on it, and let Ser Alberic know your decision. Till next we meet."},{"name":"ALBERIC","text":"Have you made your decision, then? Will you agree to teach Heustienne?"},{"name":"HEUSTIENNE","text":"I am grateful. I swear I will not disappoint you. With your guidance, I shall put an end to Graoully's reign of terror!"},{"name":"HEUSTIENNE","text":"Now, I should like nothing more than to begin my training at once, but duty calls. For the time being, I shall endeavor to emulate the deadly lancework I witnessed you employing earlier."},{"name":"ALBERIC","text":"Heustienne is among our very best in recent generations. If you are to train one of her caliber, you yourself must rise to new heights of mastery."},{"name":"ALBERIC","text":"Resume your own training, and return hither when you are satisfied with your progress."},{"name":"SYSTEM","text":"The next dragoon quest will be available from Alberic upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":702,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":23}],"questsType":"all","quests":[66608,65964]},"next":[67226]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1013437","obj":{"i":1013437,"n":"Wounded Dragoon","l":63,"q":1}},{"type":"quest","id":"66608","obj":{"i":66608,"n":"Into the Dragon's Maw","g":150,"l":"Coerthas Central Highlands","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67226","obj":{"i":67226,"n":"Days of Azure","g":150,"l":"Coerthas Central Highlands","s":520,"f":1}}]}