{"quest":{"name":"Medieval Espionage","location":"Eastern La Noscea","id":67222,"patch":3.0,"sort":560,"icon":100436,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1009943,1013909,1013910,1013911],"genre":152,"journal":["You notice a letter bearing Jacke's name in Oboro's hand.","Through Jacke's network of eyes and ears, he has found information on the one Yatsurugi treasure still unaccounted for: the dagger. While Oboro waits for Princess Yuki and Akagi to join him in the dock storehouse, visit the Rogues' Guild and harvest Jacke's intelligence.","Jacke has discovered that the Yatsurugi clan's dagger is to go up for auction. The sellers are a group known as the Truehounds─a band of Salthounds who never left the brine. Ostensibly, they liberated the Far Eastern treasures from an imperial vessel's hold, and, with Princess Yuki's word being the only proof otherwise, Jacke regretfully informs you the guild cannot get involved. However, he directs you to a black marketeer newly come to the guild's attention. To learn more of the Truehounds, seek out this shadowy character at the House of Sticks in lower La Noscea.","You defeat the trio of Qiqirn that appears. Now, present the sack of gil to the black marketeer.","Though a cowl covers his face, the black marketeer's voice sounds oddly familiar. However, he does away with any introductions, and jumps immediately to the heart of the matter─the Truehounds. Captained by one Rosalinde, these cutthroats have made their name and fortune on the Far Eastern seas. What they lack in numbers, they make up for by imbibing pluto before boarding their victims' vessels. Moreover, they have recently hired a mercenary known as Redway─a man trained in ninjutsu by Gekkai. The entire crew has dropped anchor in Costa del Sol. Travel there now, and spy on the fiends.","You crouch in the shadows as Captain Rosalinde and Redway converse. The so-called shinobi has gathered information on you and your allies just as you have on him and his. You also overhear the leader of the Truehounds as she lays out her plan to capture Princess Yuki by using the clan treasure as bait, and the auction as the trap. Return now to Oboro in the dock storehouse, and inform him of these dire developments.","Princess Yuki and Akagi have been waiting for you at the storehouse. Upon learning of the Truehounds' involvement, Yuki reveals that it was not only the treasures they stole from her clan, but the lives of her people as well. Though the princess had wished to fight back, her vassals forbade it, and laid down their lives in her defense. When she left her lands, she vowed that never again would she allow someone to die for her. Akagi seizes this opportunity to force her hand, and, finally, Yuki accepts your and Oboro's aid. However, she has a condition─you may not sacrifice your own life for hers. Having reached an agreement, Oboro asks that everyone wait for further news of the black market auction.<br><br>※The next ninja quest will be available from Oboro upon reaching level 58."],"objectives":["Speak with Jacke at the Rogues' Guild.","Track down the black marketeer in lower La Noscea.","Deliver the sack of gil to the black marketeer.","Spy on the Truehounds from the designated location in Costa del Sol.","Speak with Oboro at the dock storehouse."],"dialogue":[{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>, Jacke's network has caught wind of who has been selling the Yatsurugi clan's stolen treasures. This is information that may lead us straight to the dagger."},{"name":"OBORO","text":"He has summoned us both to the guild, but could I ask you to go by yourself?"},{"name":"OBORO","text":"I cannot leave just now. Akagi and Princess Yuki are on their way here."},{"name":"OBORO","text":"I sent a missive telling them we might have information on the bandits who robbed her. The princess desires to learn more of them, and so she has seen fit to join us."},{"name":"OBORO","text":"I believe Jacke will give you a thread. Follow it, and return once you have unraveled the truth."},{"name":"OBORO","text":"Jacke's network of spies is most impressive. Presently stationed in Eorzea as we are, perhaps it would not be amiss for us to set up our own..."},{"name":"JACKE","text":"<span class=\"highlight\">Forename</span>! Gods know it ain't simple to make black marketeers talk, but we tickled Mulfa Kelfa's neck with a stabber, an' he coughed up a load of information."},{"name":"JACKE","text":"The remainin' bauble─a dagger, by all accounts─is to be sold at auction, an' attendance is invitation only. The hosts are a band what go by the name o' the Truehounds."},{"name":"JACKE","text":"Now, in the eyes o' the law, they're sellin' loot cloyed from imperials on an expedition to the Far East. But Garlemald don't control where yer dimber mort's from."},{"name":"JACKE","text":"It's a bene mummery, turnin' a profit under the guise of a proper company. The buyers won't ask too many questions, either─grabbled or no, treasure is treasure."},{"name":"JACKE","text":"But it's just yer princess's whid against the Truehounds'. The guild can't act on that. Not officially, anyway."},{"name":"JACKE","text":"I've left the investigatin' to a...well, let's call him a black marketeer. He's a strange one─only came to the guild's attention recently. But I've never met a cove who could get information so quickly."},{"name":"JACKE","text":"The Veil was lifted by a southerly this morn─that'll put the man at the House o' Sticks. Here's a sack o' blunt. Bene luck to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"JACKE","text":"Haven't forgotten, have ye? That's not yer style, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Ye'll want to be headin' to the House o' Sticks."},{"name":"KARASU","text":"You want information? Then come, render unto me what is mine."},{"name":"KARASU","text":"Hm, hmmm... Yes... Yes, this seems to be everything I was promised. The back alleys are awfully profitable, eh? Now, about these Truehounds."},{"name":"KARASU","text":"Most of the Salthounds crawled back to land after the Calamity. But a few refused to leave the seas, and took up again as the Truehounds. They sail under the black flag of one Captain Rosalinde."},{"name":"KARASU","text":"They boast the strength of a crew twice their size, mostly because of the pluto they take. With their muscles bolstered by the substance─and a healthy dose of natural viciousness─they have brought themselves fortune and infamy on the eastern seas."},{"name":"KARASU","text":"Now, however, they've hidden their ship away on Hullbreaker Isle and made their way to Costa del Sol. Seems they fancied a cup of ale and a peek at the dancing girls."},{"name":"KARASU","text":"They won't be hard to spot if you wanted a look, but do so at your own peril. Drunken pirates might not frighten you. But Redway, their new sellsword, should."},{"name":"KARASU","text":"They say he is an <span class=\"emphasis\">ex</span>-member of Garlean covert operations, one who has thrown himself into the study of ninjutsu."},{"name":"KARASU","text":"His pursuit has paid off handsomely...albeit at the cost of his humility. Stay vigilant, or you'll find his blade pricking your back."},{"name":"KARASU","text":"Anyhow, that's all from me! Give my best to the dim one...little chick! Ahahaha!"},{"name":"ROSALINDE","text":"Redway, Redway, Redway. I lost me plunder. That's coin I may never get back. But you convinced me to give ye time. Make yer report worth me while, or I'll have yer head."},{"name":"REDWAY","text":"There were two thieves, Captain─the Iron Orchid herself, and some servant. The latter looks to be more brawny than brave, but the princess is dangerous."},{"name":"REDWAY","text":"She has two shinobi in her employ. One is a Doman jonin, Oboro. He, too, is a force to be reckoned with."},{"name":"REDWAY","text":"The other is <span class=\"alternative-container\"><span class=\"alternative\">a Hyur</span><span class=\"alternative\">an Elezen</span><span class=\"alternative\">a Lalafell</span><span class=\"alternative\">a Miqo'te</span><span class=\"alternative\">a Roegadyn</span><span class=\"alternative\">an Au Ra</span><span class=\"alternative\">a Hrothgar</span><span class=\"alternative\">a Viera</span></span>─<span class=\"highlight\">Forename</span>, if I'm not wrong. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is famous in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own right, and dangerous."},{"name":"REDWAY","text":"Their involvement makes me think the princess has more coin than she lets on. These two are responsible for my master's death─their services cannot be cheap."},{"name":"ROSALINDE","text":"Yer master's murderers, eh? Ye wouldn't be dreamin' of avengin' Gekkai on <span class=\"emphasis\">my</span> time now, would ye?"},{"name":"REDWAY","text":"Vengeance, Captain? Why? Gekkai treated me like scum, he and Karasu both. Because I wasn't from their precious little village."},{"name":"REDWAY","text":"But Oboro? If I triumph over Gekkai's <span class=\"emphasis\">favorite</span>, I triumph over the lot of them! That is my heart's desire, yes."},{"name":"ROSALINDE","text":"I could give a gnat's arse what ye do with the ninjas. But it's not <span class=\"emphasis\">them</span> I want─it's the princess. Alive."},{"name":"ROSALINDE","text":"The way I see it, the auction's the perfect trap─baited, as it is, with the Yatsurugi dagger."},{"name":"ROSALINDE","text":"The Iron Orchid can't resist. Catchin' her then'll be easy an' fast─<span class=\"emphasis\">savvy</span>, Redway?"},{"name":"REDWAY","text":"Of course, of course. The princess won't stand a chance with the guard doubled. No she won't."},{"name":"YUKI","text":"This better not be some ploy to worm your way into my good graces."},{"name":"AKAGI","text":"Clean, tidy, cozy─a bloke could get used to livin' in a place like this."},{"name":"OBORO","text":"Success, <span class=\"highlight\">Forename</span>?"},{"name":"OBORO","text":"Hmmm. This Rosalinde is a clever one, spying upon us through Redway..."},{"name":"OBORO","text":"Princess, the foe will be watching for our tricks now. Reclaiming the last treasure will be that much harder. So I beg you─leave it to us shinobi."},{"name":"YUKI","text":"I know there's sense in what you say, Oboro. But this is my problem. I alone must solve it."},{"name":"YUKI","text":"I...I will <span class=\"emphasis\">not</span> allow more people to die in my name!"},{"name":"YUKI","text":"...The Truehounds didn't just steal the treasures. My people stood in their way. And many died. Too many."},{"name":"YUKI","text":"I wanted to fight. But my vassals wouldn't allow it. And as they were cut down, they called for me. <span class=\"emphasis\">Screamed</span> my name. You can't imagine how that feels."},{"name":"YUKI","text":"My lands are so close to destruction. My people are on the brink of starvation. If <span class=\"emphasis\">I</span> do not do something, all of their sacrifices will mean nothing."},{"name":"YUKI","text":"When I came here, I vowed that I would bring prosperity to my country by finding and selling my treasures. Alone. No one would ever die protecting me again. Not my smallfolk, nor my vassals, nor you."},{"name":"AKAGI","text":"You don't want anyone to die protectin' you, Princess? What about those of us who would give our lives willingly to defend you!?"},{"name":"AKAGI","text":"If...if you won't trust in the shinobi, then...then I...I'll slice open my belly!"},{"name":"AKAGI","text":"I'm bound to you, Princess, but they're not! We've given them no coin, no gratitude, an' yet they're still helpin' us! You can trust them, you <span class=\"emphasis\">have</span> to─or there's no takin' back the treasure!"},{"name":"AKAGI","text":"<span class=\"emphasis\">Trust</span> the shinobi. Or lose me, an' add one more to those who died tryin' to protect you. That'll get you to stop. Right? P-Princess!?"},{"name":"YUKI","text":"...Heh...hehehe! Akagi, you have the <span class=\"emphasis\">strangest</span> way of... Clearly, the shinobi have left a great impression upon you."},{"name":"YUKI","text":"Oboro, <span class=\"highlight\">Forename</span>─consider this my formal request. Help me retake our last treasure."},{"name":"YUKI","text":"But I have one condition. No matter what happens, you will not lay down your lives for mine. Call it...a duty to stay alive, if you wish."},{"name":"OBORO","text":"To stay alive, hm? An interesting notion. Shinobi are trained to put duty ahead of all else, including our lives."},{"name":"OBORO","text":"That said, <span class=\"highlight\">Forename</span>, this is the mission that has been given you. You are duty-bound to see it through. And come what may, I know that completing it will aid in your growth as a shinobi."},{"name":"OBORO","text":"Now, we wait, and watch for signs of the auction. I will approach Jacke. With the eyes and ears in his service, we will spread a web, and so catch word of the Yatsurugi clan's dagger."}],"reward":{"gil":1330,"action":3566,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":92}],"quests":[67221]},"next":[67223]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1013909","obj":{"i":1013909,"n":"Black Marketeer","l":31,"q":1}},{"type":"npc","id":"1013910","obj":{"i":1013910,"n":"Yuki","l":1428,"q":2}},{"type":"npc","id":"1013911","obj":{"i":1013911,"n":"Akagi","l":1428,"q":2}},{"type":"action","id":"3566","obj":{"i":3566,"n":"Dream Within a Dream","c":2918,"j":30,"t":4,"l":56}},{"type":"quest","id":"67221","obj":{"i":67221,"n":"Ninja Assassin","g":152,"l":"Eastern La Noscea","s":540,"f":1}},{"type":"quest","id":"67223","obj":{"i":67223,"n":"Staying Alive","g":152,"l":"Eastern La Noscea","s":580,"f":1}}]}