{"quest":{"name":"Ninja Assassin","location":"Eastern La Noscea","id":67221,"patch":3.0,"sort":540,"icon":100436,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1013897,1013898,1013906,1013907,1013908,1014668],"genre":152,"journal":["A new request from Akagi has arrived.","Akagi's missive is a tersely worded summons, asking you to come as quickly as you are able to Oschon's Embrace. Make your way there now, and learn what trouble Princess Yuki has gotten herself into this time.","Having found where her clan's jade jewel was being kept, Princess Yuki has slipped in amongst a host of enemies to retrieve it. While the daring plan seems to have paid off, she now lacks for an exit strategy. Akagi begs you to distract the guards, and Oboro fleshes out the plan by proposing that you use the noise of Raiton to draw the foes away. Strike the path leading away from Oschon's Embrace multiple times, and so secure Yuki's escape.","The foes have heard your thunder, and you hear them as they make their way toward you. Move further away from Oschon's Embrace and strike with Raiton again.","Once again, the guards hear as your thunder echoes through the hills. Make for the Salt Strand, and unleash Raiton again on the way there.","You have drawn your pursuers far from their camp, and away from Princess Yuki. Now, make your way to the Salt Strand proper, and await Oboro.","You arrive on the Salt Strand and are greeted by a man with seemingly sinister intent. From his babbling, you ascertain that he had anticipated Princess Yuki. Yet his familiarity with shinobi─Gekkai and Karasu in particular─leaves you uneasy. The man attacks, revealing that he, too, has a command of ninjutsu. You slay his underlings, and eventually force him to flee after Oboro comes to your aid. Speak now with your shinobi friend and see what he knows of your mysterious combatant.","After a moment's thought, Oboro theorizes that the man was once an imperial spy, trained in ninjutsu by Gekkai and Karasu. What he desired with the princess, however, remains a mystery. In any case, now is not the time to wonder why, but rather to see if Princess Yuki is safe. Travel to the Tempest Gate in lower La Noscea and speak with her.","Princess Yuki has escaped the clutches of her pursuers, her clan's stolen jade jewel now safely in hand. She is aware that you aided her, but seems completely ungrateful. After she takes her leave, however, Akagi says she is secretly thankful. Oboro bids you return with him to the dock storehouse.","As you might have suspected given your recent missions, Oboro once again tells you to meditate upon your experiences, that you might draw new power from within. He also leaves you with a somber warning, and bids you practice vigilance whilst a mysterious foe may lie waiting in the shadows.<br><br>※The next ninja quest will be available from Oboro upon reaching level 56."],"objectives":["Speak with Akagi at Oschon's Embrace.","Use Raiton on the target.","Use Raiton on the next target.","Wait at the rendezvous point.","Speak with Oboro on the Salt Strand.","Speak with Yuki.","Speak with Oboro at the dock storehouse.","Defeat Redway!"],"dialogue":[{"name":"OBORO","text":"Akagi has called us again, this time to Oschon's Embrace."},{"name":"OBORO","text":"His note was brief and hastily written. I do not know what the princess has done, but it is clear she needs our aid─urgently."},{"name":"OBORO","text":"We must away to Her Highness's side, <span class=\"highlight\">Forename</span>."},{"name":"OBORO","text":"I would not keep Akagi waiting. He looks to crumple from worry..."},{"name":"AKAGI","text":"<span class=\"emphasis\">You</span>! Where <span class=\"emphasis\">were</span> you!? Here I am, worried half to death because the princess is in danger, an' I can't do a thing about it! An' you just <span class=\"emphasis\">saunter</span> up, like...like..."},{"name":"OBORO","text":"Calm yourself, and start at the beginning. Where is the princess?"},{"name":"AKAGI","text":"C-Calm!? Er, right, calm. Her Highness learned who bought the clan's jewel. She's run off to take it back, an' left me behind."},{"name":"TOUZOKU01685","text":"Where is she!? She can't've gotten far, even with her bleedin' witchcraft or...or whatever! Come on, lads, fan out and find her!"},{"name":"AKAGI","text":"Well, that's it in a nutshell. The guards won't rest till they catch her. An' she's stuck up there!"},{"name":"OBORO","text":"That she would find the jade jewel is just like her. But she clearly has no way to escape."},{"name":"OBORO","text":"Well, <span class=\"highlight\">Forename</span>? It's <span class=\"emphasis\">your</span> mission. What takes the greatest priority?"},{"name":"Q1","text":"What takes priority?"},{"name":"A1","text":"Helping the princess."},{"name":"A1","text":"Completing the mission."},{"name":"A1","text":"..."},{"name":"OBORO","text":"An answer that befits the true shinobi!"},{"name":"OBORO","text":"Exactly, and your mission <span class=\"emphasis\">is</span> the princess. As a shinobi, you must now aid her."},{"name":"OBORO","text":"You wish to let your actions speak for you? Very well. Our only recourse is to aid the princess."},{"name":"OBORO","text":"The guards think the princess's ninjutsu is magic. We can use this ignorance to our benefit."},{"name":"OBORO","text":"Let fly Raiton. They will mistake the thunder for Princess Yuki's ninjutsu."},{"name":"OBORO","text":"Draw the enemy southwest─<span class=\"emphasis\">away</span> from the princess. We will rendezvous on the Salt Strand."},{"name":"SYSTEM","text":"Unleash the thunder of Raiton to attract the guards' attention."},{"name":"SYSTEM","text":"The sound of footsteps echoes in the distance."},{"name":"TOUZOKU01685","text":"(-Enemy Guard-)That sound... It's the girl! After her!"},{"name":"TOUZOKU01685","text":"(-Enemy Guard-)Come on! Wh-What do you mean no!? Cowards! Do <span class=\"emphasis\">you</span> want to be the one to tell the master someone took the jewel!? Then come on!"},{"name":"TOUZOKU01685","text":"(-Enemy Guard-)Don't let her get away! That jewel's more valuable than our lives!"},{"name":"REDWAY","text":"(-???-)Hello, <span class=\"emphasis\">hello</span>, Princess!<br>...Oh. You are unexpected. Yes, most unexpected."},{"name":"REDWAY","text":"(-???-)So the thunder wasn't her doing, but a shinobi's? Huh. Most curious. Where did she find coin to pay you? Or does she command your loyalty with her regal blood?"},{"name":"REDWAY","text":"(-???-)What I could do if royalty flowed in my veins... No matter. I'm buying a bright future with my actions today."},{"name":"REDWAY","text":"(-???-)The mission comes first, as <span class=\"emphasis\">they</span> used to say. I was only paid to oversee the delivery. But what is my employer's goodwill worth, I wonder."},{"name":"REDWAY","text":"(-???-)...Why do you look at me like that? Your eyes are like Karasu's or Gekkai's, judging me <span class=\"emphasis\">unworthy</span>."},{"name":"REDWAY","text":"(-???-)You must be from the Far East, a <span class=\"emphasis\">real</span> shinobi with <span class=\"emphasis\">real</span> ninjutsu─like Gekkai. You think yourself my better because of it?"},{"name":"REDWAY","text":"(-???-)Don't lie to me! I can see it in your damn eyes! I will make you spit out what you know about Yuki─or I'll cut it from your corpse's stomach!"},{"name":"OBORO","text":"A different breed than the other guards, that one. He knew of Karasu, of Gekkai─there should be no shinobi in this land with such knowledge."},{"name":"OBORO","text":"...Unless he was one of Gekkai's shadows. The imperial shinobi lost their place in Garlemald when the unit was disbanded after the man's death."},{"name":"OBORO","text":"That would be cause for them to sell their blades. I imagine the demand for mercenaries with ninjutsu would be great among people with money enough to trade in Far Eastern treasures..."},{"name":"OBORO","text":"Pardon me, <span class=\"highlight\">Forename</span>, this can wait. Princess Yuki's safety is paramount. Let us join her near the Tempest Gate."},{"name":"AKAGI","text":"You really saved the princess's skin! She's safe, thanks to you!"},{"name":"OBORO","text":"Well, she seems unruffled for her ordeal."},{"name":"YUKI","text":"Yes, Akagi told me. And no, your aid was not needed. I could have escaped perfectly well without you."},{"name":"YUKI","text":"But I suppose the important thing is that the jade jewel is once again mine. All I've left to find is the Midare Kanemitsu dagger."},{"name":"YUKI","text":"Don't interfere! This...this is my problem to solve, all right?"},{"name":"AKAGI","text":"(-Akagi-)Never know it by what she said, but she's secretly grateful. An' if she does anythin', I know where to find her brave protectors."},{"name":"OBORO","text":"That you do. Shall we return, <span class=\"highlight\">Forename</span>?"},{"name":"OBORO","text":"I have made Akagi aware of that strange sellsword we met on the Salt Strand. He will be vigilant, as should you."},{"name":"OBORO","text":"As for your mission, I believe the princess is warming to you─though it is difficult to tell. But at the very least, no harm has befallen her on your watch."},{"name":"OBORO","text":"Now, I will leave you to your meditations. Allow them to further sharpen your mind, so you will be the blade when the time comes again to strike."},{"name":"QIB","text":"I can't lose! Your head will bring me a fine reward."},{"name":"QIB","text":"Pawns, pawns, useless pawns─the match is won when the king comes!"},{"name":"QIB","text":"Forgive me, <span class=\"highlight\">Forename</span>. I was waylaid."},{"name":"QIB","text":"<span class=\"emphasis\">Two</span>? How unexpected. I'll just have to use what <span class=\"emphasis\">he</span> taught me─however disagreeable the cost!"},{"name":"QIB","text":"I know your face! It's the face of Gekkai's foe! You are Oboro! And that makes <span class=\"emphasis\">you</span> <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"You'd forbid my mudra of summoning, too!?"},{"name":"QIB","text":"I know when the tide has turned! He who fights and runs away─yes, yes!"},{"name":"QIB","text":"Why do they always run? He spoke of Gekkai and Karasu, but who was he?"},{"name":"QIB","text":"For now, this victory is enough."}],"reward":{"gil":1038,"action":3563,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":92}],"quests":[67220]},"next":[67222]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1013897","obj":{"i":1013897,"n":"Oboro","l":31,"q":1}},{"type":"npc","id":"1013898","obj":{"i":1013898,"n":"Akagi","l":31,"q":1}},{"type":"npc","id":"1013906","obj":{"i":1013906,"n":"Oboro","l":31,"q":1}},{"type":"npc","id":"1013907","obj":{"i":1013907,"n":"Akagi","l":31,"q":1}},{"type":"npc","id":"1013908","obj":{"i":1013908,"n":"Yuki","l":31,"q":1}},{"type":"npc","id":"1014668","obj":{"i":1014668,"n":"Oboro","l":31,"q":1}},{"type":"action","id":"3563","obj":{"i":3563,"n":"Armor Crush","c":2915,"j":30,"t":3,"l":54}},{"type":"quest","id":"67220","obj":{"i":67220,"n":"The Impossible Girl","g":152,"l":"Eastern La Noscea","s":520,"f":1}},{"type":"quest","id":"67222","obj":{"i":67222,"n":"Medieval Espionage","g":152,"l":"Eastern La Noscea","s":560,"f":1}}]}