{"quest":{"name":"Dragoon's Errand","location":"Coerthas Central Highlands","id":67229,"patch":3.0,"sort":560,"icon":100489,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1013470,"involved":[1012163,1013466,1013467],"genre":150,"journal":["Ser Alberic has acquired a lead pointing to the missing Heustienne's whereabouts.","Ser Alberic has received a report that Heustienne's lance, Peregrine, was recently seen in the hands of a heretic. Though it is unclear how the villains came to possess the weapon, they are all but certain to know of Heustienne's fate, and Ser Alberic is determined to track them down. A regiment of Temple Knights is presently on the trail of the selfsame heretics you seek. Make your way to the area west of Camp Riversmeet in the western highlands of Coerthas, and join the hunt.","West of Camp Riversmeet, you meet a Temple Knight who informs you that the heretics have retreated south, in the direction of the Swiftrun River. Join the knights in their hunt, and scour the area for Heustienne.","You find Heustienne and liberate her from her heretic captors, but she refuses to return to Ishgard and will not explain why. She bids you alert the Temple Knights to an impending heretic offensive, and further requests that you lie about her survival to her father and comrades. Return to the Congregation of Our Knights Most Heavenly in Ishgard, and deliver Heustienne's message to Handeloup.","Handeloup receives Heustienne's death with disbelief. Next, make your way to the Observatorium and relay the tragic news to Montorgains.","In spite of your promise, you cannot help but reveal the truth to Montorgains, and the search for Heustienne continues. Though her inexplicable disappearance may be seen by some as desertion, all present are convinced that she would not forsake her nation and her vows. Ser Alberic speculates that Heustienne means to go after Graoully and recover Peregrine. While he tracks down the leader of the heretics, he bids you continue dedicating yourself to your lancework, that you might be better prepared for the coming trials.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 58."],"objectives":["Speak with the Temple Knight west of Camp Riversmeet.","Search for Heustienne.","Speak with Handeloup at the Congregation.","Speak with Montorgains at the Observatorium."],"dialogue":[{"name":"ALBERIC","text":"It seems your training proceeds apace, <span class=\"highlight\">Forename</span>. Would that I could say the same of our search for Heustienne..."},{"name":"ALBERIC","text":"With heretic activity on the rise of late, our forces are stretched thin; the Temple Knights have not the men to spare for the search effort. Be that as it may, we are not without leads."},{"name":"ALBERIC","text":"A short while ago, a peculiar report arrived from the front lines. In a recent skirmish between our knights and a band of heretics, one of the enemy was wielding a lance bearing a striking resemblance to Peregrine."},{"name":"ALBERIC","text":"The lance is a treasure belonging to Heustienne's family. If the reports are true, these heretics now have it."},{"name":"ALBERIC","text":"However the villains came to possess Peregrine, 'tis more than likely that they know something of Heustienne's fate. If we can find <span class=\"emphasis\">them</span>, we may yet find her."},{"name":"ALBERIC","text":"West of Camp Riversmeet, in the western highlands, a regiment of knights hunts the selfsame band of heretics we seek. I would have you join them, <span class=\"highlight\">Forename</span>─it is our best hope for a clue."},{"name":"ALBERIC","text":"I pray that this information will lead us to Heustienne..."},{"name":"KISHI01693","text":"Ser Alberic sent word that you would come. The heretics retreated through yonder pass, the man with the lance Peregrine among them."},{"name":"KISHI01693","text":"Our forces are giving chase even as we speak. Needless to say, we should be grateful for the Azure Dragoon's aid."},{"name":"KISHI01693","text":"The heretics retreated through yonder pass, the man with the lance Peregrine among them. Our forces are presently giving chase even as we speak. We should be grateful for your aid."},{"name":"HEUSTIENNE","text":"I find myself thanking you often of late, <span class=\"highlight\">Forename</span>... When I leapt upon Graoully and pierced his hide, the creature responded by soaring and attempting to shake me off. 'Twas all I could do to hold on to the shaft of my lance."},{"name":"HEUSTIENNE","text":"High as we had climbed, I could not safely dismount. And so I bided my time, waiting for the right moment to jump clear of my unwilling mount."},{"name":"HEUSTIENNE","text":"Alas, the beast had other ideas. It bore me straight into the heretics' midst, and I was swiftly overwhelmed and divested of my weapon."},{"name":"HEUSTIENNE","text":"What? It was the sighting of Peregrine that led you here? 'Twould seem my forefathers watch over me."},{"name":"HEUSTIENNE","text":"Hear me, <span class=\"highlight\">Forename</span>. The man who took my lance is the leader of this band of heretics."},{"name":"HEUSTIENNE","text":"I overheard the guards say that he has departed to meet with the leader of yet another group. In all likelihood, they are plotting a large-scale assault on the Holy See."},{"name":"HEUSTIENNE","text":"The Temple Knights must be warned. You must bear word to the Congregation, that we might bolster our defenses."},{"name":"HEUSTIENNE","text":"No. I cannot return with you. There is a task I must needs attend to."},{"name":"HEUSTIENNE","text":"Should someone ask whence this information came, tell them that you wrung it out of a heretic. And tell them that I...that I fell in battle."},{"name":"HEUSTIENNE","text":"I know full well I ask much of you, and it pains me to deceive my father, but I have no other choice. Whatever you might think of my request, believe me when I say that I remain firm in my purpose."},{"name":"HEUSTIENNE","text":"Unnngh... 'Tis nothing. I but took a glancing blow to the chest."},{"name":"HEUSTIENNE","text":"I must go now, as must you. When you return to the Congregation, deliver my message to Ser Handeloup. Please take care of my comrades...and my father."},{"name":"HANDELOUP","text":"Heustienne...slain? I cannot believe it... To lose one of our best while Graoully's shadow looms over us still..."},{"name":"HANDELOUP","text":"But we must deal with each threat as it comes. First, we prepare for the heretics. I thank you for alerting us to their plan."},{"name":"HANDELOUP","text":"Now, loath though I am to place this burden upon you, Montorgains must needs be informed of his daughter's passing. He has gone to meet Ser Alberic at the Observatorium. Pray bear the news to him."},{"name":"HANDELOUP","text":"Loath though I am to place this burden upon you, Montorgains must needs be informed of his daughter's passing. He has gone to meet Ser Alberic at the Observatorium. Pray bear the news to him."},{"name":"MONTORGAINS","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Have you learned aught of my daughter's whereabouts?"},{"name":"MONTORGAINS","text":"What? S-Slain? No... It cannot be..."},{"name":"ALBERIC","text":"I am sorry, my friend..."},{"name":"MONTORGAINS","text":"Heustienne is one of Ishgard's finest dragoons! She would <span class=\"emphasis\">not</span> fall to common heretics! This must be some kind of mistake! Y-Yes, a terrible mistake!"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Tell Montorgains the truth."},{"name":"A1","text":"Remain silent."},{"name":"MONTORGAINS","text":"Why do you not speak!? Are you hiding something from me!?"},{"name":"MONTORGAINS","text":"...You are, aren't you? 'Tis writ plain upon your face."},{"name":"MONTORGAINS","text":"Please, I must know what became of my daughter! You may think to spare me pain, but I must know the truth!"},{"name":"MONTORGAINS","text":"What? Heustienne <span class=\"emphasis\">chose</span> not to return?"},{"name":"MONTORGAINS","text":"I know not what compelled her to act as she did, but it is enough for me that she lives still. Thank you for giving me this hope, at least."},{"name":"ALBERIC","text":"To those who do not know her, it may well appear as though Heustienne has deserted. But I believe I speak for us all when I say that she would not forsake her vows, let alone her people."},{"name":"MONTORGAINS","text":"Indeed you do, Ser Alberic. However inexplicable my daughter's actions may seem, I will not cease to believe in her. No matter what it takes, I will find her and bring her home."},{"name":"ALBERIC","text":"Montorgains puts on a brave front, but I fear the weight of worry may prove too much for him to bear─yet another reason to find Heustienne with all haste."},{"name":"ALBERIC","text":"Now, it seems plain she means to go after Graoully and to recover Peregrine. And while these objectives alone do not explain her decision to leave, they reveal to us where she is like to be."},{"name":"ALBERIC","text":"I shall track down the leader of the heretics, the man who has Peregrine. You, meanwhile, must continue dedicating yourself to your lancework."},{"name":"ALBERIC","text":"The trials of recent days have made you stronger, but I sense that the greatest tests are yet to come. See to it that you are full ready to face them."}],"reward":{"gil":1284,"action":3554,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":23}],"quests":[67228]},"next":[67230]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1013470","obj":{"i":1013470,"n":"Montorgains","l":63,"q":1}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1013466","obj":{"i":1013466,"n":"Heustienne","l":2200,"q":1}},{"type":"npc","id":"1013467","obj":{"i":1013467,"n":"Temple Knight","l":2200,"q":1}},{"type":"action","id":"3554","obj":{"i":3554,"n":"Fang and Claw","c":2582,"j":22,"t":3,"l":56}},{"type":"quest","id":"67228","obj":{"i":67228,"n":"Sworn Upon a Lance","g":150,"l":"Coerthas Central Highlands","s":540,"f":1}},{"type":"quest","id":"67230","obj":{"i":67230,"n":"Sanguine Dragoon","g":150,"l":"Coerthas Central Highlands","s":580,"f":1}}]}