{"quest":{"name":"The Impossible Girl","location":"Eastern La Noscea","id":67220,"patch":3.0,"sort":520,"icon":100436,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1013893,1013894,1013895,1013896,1014666],"genre":152,"journal":["Oboro has received a missive from Akagi.","Akagi's letter is a call to action: Princess Yuki is attempting to breach a Salthound base, and may have need of your help. Find out how you might be able to from the retainer, who is waiting near Memeroon's Trading Post in upper La Noscea.","Unsurprisingly, the princess is displeased to see you, and has little to say about your offer of assistance. Akagi, meanwhile, all too gladly explains that the Salthounds are in possession of a trading record that is passing through the black markets. Somewhere within this log, he says, there should be information on the Yatsurugi clan's stolen treasures. After this explanation, the retainer then turns to ask Yuki to use you shinobi, only to find that she has already left to infiltrate the base. Oboro quickly outlines a plan to aid her entry: use smoke bombs to distract the guards. Make your way to the designated areas, and defeat any guards attracted by your diversion.","Your role in diverting the guards' attention has succeeded. Rendezvous with Oboro and Akagi near Poor Maid's Mill to see how they have fared.","After a brief moment of panic, you turn to see that the puissant princess has already successfully infiltrated the base and returned with the prize. For better or worse, she did not notice the part you played from the shadows. Return to the dock storehouse, and consult with Oboro.","Though you failed to win over the princess, Oboro nevertheless thinks the day a success. He asks that you now devote yourself to quiet meditation, wherein you might realize new skills and strategies based upon your experiences.<br><br>※The next ninja quest will be available from Oboro upon reaching level 54."],"objectives":["Speak with Akagi at Memeroon's Trading Post.","Throw smoke bombs at the designated spots and dispatch foes.","Speak with Oboro near Poor Maid's Mill.","Speak with Oboro at the dock storehouse."],"dialogue":[{"name":"OBORO","text":"Akagi has summoned us, <span class=\"highlight\">Forename</span>. Princess Yuki is attempting to infiltrate a Salthound stronghold. He would have us “save her,” to use his words."},{"name":"OBORO","text":"He has managed to delay her near Memeroon's Trading Post. I trust you know the place. Let us away with all haste."},{"name":"OBORO","text":"Your mission awaits, <span class=\"highlight\">Forename</span>."},{"name":"YUKI","text":"...Yes?"},{"name":"OBORO","text":"I think it best that you approach Akagi."},{"name":"AKAGI","text":"Finally! It's not easy keepin' the princess in one place, you know!"},{"name":"YUKI","text":"Incredible. <span class=\"emphasis\">This</span> is why you had me wait, Akagi? I had thought myself clear: I neither need nor want their help. Go home, shinobi."},{"name":"OBORO","text":"Princess, now that we are here, surely there is no harm in telling us your plan."},{"name":"AKAGI","text":"Oh, we'd be happy to. It's a long story, too. Rumors have been swirlin' about your black markets, about things that sound much like our clan's stolen treasures."},{"name":"AKAGI","text":"It's hard to pin down rumors like that. But we've also gotten word that some group of pirates─the hounds of salt, or some such─keep records of the black markets. I don't need to tell you how valuable those could be."},{"name":"AKAGI","text":"'Course, a <span class=\"emphasis\">certain</span> someone is all set on slippin' in to their camp by herself. But I can't see to lettin' that─"},{"name":"AKAGI","text":"Ahhh! Not again! Always sneakin' off on her own like that..."},{"name":"OBORO","text":"Seeing as she is already gone, we cannot stop her. However, we still might lend her aid by clearing obstacles from her path."},{"name":"OBORO","text":"Here, <span class=\"highlight\">Forename</span>─smoke bombs. You will catch the attention of the nearby watchmen if you set these off near the camp. Incapacitate them, and the princess may pass unnoticed."},{"name":"AKAGI","text":"Ah, a fake attack? My axe is for show, mainly, but I'll help where I can."},{"name":"OBORO","text":"Very well. Akagi, go east. I will go north. We will rendezvous to the southeast of Poor Maid's Mill when done."},{"name":"MONSTERA01684","text":"Who goes there?"},{"name":"MONSTERB01684","text":"Wh-What's that sound!?"},{"name":"MONSTERC01684","text":"Intruder! We've got an intruder!"},{"name":"AKAGI","text":"Whew... Only a diversion, you said, but it was bloody frightenin'!"},{"name":"OBORO","text":"All we can do, we have done. Princess Yuki should have made it inside by now."},{"name":"MONSTER01684","text":"Heh...hehe... P–Put paid to the watch, but n–not the watchdogs... Wh–When they get their teeth into you lot... Ehehehe! &lt;gurgle&gt; "},{"name":"OBORO","text":"What!? Quickly, <span class=\"highlight\">Forename</span>, inside the camp!"},{"name":"YUKI","text":"(-Yuki-)Save yourselves the effort. The black market records are mine."},{"name":"YUKI","text":"Our jade jewel is mentioned in here. The Midare Kanemitsu dagger, as well."},{"name":"YUKI","text":"It seems the former was sold, but finding the buyer should not be difficult. And the blade will be up for auction shortly."},{"name":"OBORO","text":"Princess! You are safe! Did you not meet with any resistance?"},{"name":"YUKI","text":"Resistance? Oh, <span class=\"emphasis\">them</span>?"},{"name":"OBORO","text":"You did that, Princess?"},{"name":"AKAGI","text":"She's not the pride of our clan for nothin'! The princess's a skilled fighter. She's tried her hand at your ninjutsu, too. Not even her instructors can keep up with her these days."},{"name":"YUKI","text":"I trust you see now why I have no need of your help. I will reclaim my clan's property myself!"},{"name":"AKAGI","text":"&lt;sigh&gt; I just wish she understood what she means to our clan... Well, thank you for today. I'll have need of your help again soon─but let's keep it on the sly, eh?"},{"name":"OBORO","text":"Come, let us return to our haunt. You must meditate on what you have seen here, to focus your thoughts into weapons anew."},{"name":"OBORO","text":"Well, the princess's trust is not yet yours, but she is safe. Were this a trial, you would have passed."},{"name":"OBORO","text":"But your mind is full. Still your thoughts. Listen to what your heart says in the silence. In so doing, you will grow as a shinobi."}],"reward":{"gil":1063,"action":16488,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":92}],"quests":[65771]},"next":[67221]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1013893","obj":{"i":1013893,"n":"Akagi","l":34,"q":1}},{"type":"npc","id":"1013894","obj":{"i":1013894,"n":"Yuki","l":34,"q":1}},{"type":"npc","id":"1013895","obj":{"i":1013895,"n":"Oboro","l":34,"q":1}},{"type":"npc","id":"1013896","obj":{"i":1013896,"n":"Oboro","l":34,"q":1}},{"type":"npc","id":"1014666","obj":{"i":1014666,"n":"Akagi","l":34,"q":1}},{"type":"action","id":"16488","obj":{"i":16488,"n":"Hakke Mujinsatsu","c":2923,"j":30,"t":3,"l":52}},{"type":"quest","id":"65771","obj":{"i":65771,"n":"Strangers in a Strange Land","g":152,"l":"Eastern La Noscea","s":500,"f":1}},{"type":"quest","id":"67221","obj":{"i":67221,"n":"Ninja Assassin","g":152,"l":"Eastern La Noscea","s":540,"f":1}}]}