{"quest":{"name":"Blood on the Sands","location":"Ishgard","id":67238,"patch":3.0,"sort":7,"icon":100444,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014769,1014770,1014771,1014772],"genre":158,"journal":["Stephanivien is growing impatient to leave.","Stephanivien is eager to set off to Bloodshore, but it seems that Joye has yet to return from her duties at the manor. Head to the Pillars, and search the markets for the busy machinist.","You find Joye in the markets, but she is still occupied with carrying her purchases to the manor. Though it seems she would prefer to take responsibility for her chores, your training at Bloodshore cannot wait. Pick up the heavy sack bound for the House Haillenarte storeroom.","You wait for Joye to depart, then lift the hefty sack of shopping. Make your way to Haillenarte Manor and deliver the goods to your machinist colleague.","You deliver the sack, much to Joye and the count's surprise, and free the diligent girl from the last of her chores. Make your way to Bloodshore and report to Stephanivien.","You arrive in Bloodshore, and Stephanivien explains that the purpose of the training exercise is to practice hindering movement so that you might avoid the melee weapons of the knights in the tourney. Despite an unexpected arrival, you and Joye successfully complete the exercise to Rostnsthal and Stephanivien's satisfaction. Return to the Skysteel Manufactory and speak with the chief machinist.","Stephanivien seems concerned by Joye's sudden lack of enthusiasm, but believes that she will return to form in the heat of the battle. Continue your training in preparation for the coming tourney.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 50."],"objectives":["Find Joye in the Pillars.","Pick up the heavy sack.","Deliver the heavy sack to Joye.","Speak with Stephanivien at Bloodshore.","Speak with Stephanivien at the Skysteel Manufactory.","Protect the rank box!","Defeat the Thing from the Deep!"],"dialogue":[{"name":"STEPHANIVIEN","text":"Once Joye has completed her tasks at the manor, we can be off to Bloodshore. I wonder what could be keeping her. A trip to the market to restock the larder or some such...?"},{"name":"STEPHANIVIEN","text":"We must practice our strategies well if we are to have any chance at the tourney. You shall be our key to victory, <span class=\"highlight\">Forename</span>."},{"name":"JOYE","text":"Oh, hello, <span class=\"highlight\">Forename</span>. You must be eager to get in some practice afore the big contest. I'll be ready to go just as soon as I've hauled me shoppin' to the manor."},{"name":"JOYE","text":"If I'm to continue me machinist trainin', I can't be shirkin' me other chores. I made a promise to the count..."},{"name":"JOYE","text":"But I won't keep ye waitin' much longer. I'll run to the manor with what I've got, and come back for this big sack afterwards."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Offer to help."},{"name":"A1","text":"Help Joye in secret."},{"name":"JOYE","text":"Oh, that's very kind of you, <span class=\"highlight\">Forename</span>, but I'm stronger than I look. Maybe you could just keep an eye on this other sack until I get back. Shouldn't take too long..."},{"name":"JOYE","text":"Could you keep an eye on this other sack until I get back, <span class=\"highlight\">Forename</span>? Shouldn't take too long..."},{"name":"BAURENDOUIN","text":"Hm? My son has you running errands as well, now, does he?"},{"name":"JOYE","text":"<span class=\"highlight\">Forename</span>! What are you doin' here? Who's watchin' me other sack!?"},{"name":"BAURENDOUIN","text":"Ah, lending a hand to young Joye here, are you? Very good. This was the last of her tasks for the day, so she is free to assist Stephanivien in his work. Pray return to your tourney preparations."},{"name":"JOYE","text":"Thank you, <span class=\"highlight\">Forename</span>. I appreciate you helpin' me, of course, but I appreciate you helpin' his lordship even more."},{"name":"JOYE","text":"The count was against me becomin' a machinist. He knew that me dad's too feeble to work, though, and was kind enough to let me keep me place on the manor's staff."},{"name":"JOYE","text":"Me family'd be on the street if it weren't for this job, and I can't thank him enough. Sometimes it don't feel right that I repay him by spendin' half me time at the manufactory."},{"name":"JOYE","text":"But maybe now that you're around for Stephanivien, his lordship won't need me to be a machinist no more..."},{"name":"Q2","text":"What do you say to Joye?"},{"name":"A2","text":"Winning the tourney will repay the count's kindness."},{"name":"A2","text":"..."},{"name":"JOYE","text":"Hmmm, I never thought of it that way. Well, we should be gettin' ourselves to Bloodshore."},{"name":"JOYE","text":"I'd be able to focus on servin' the count at the manor, then, wouldn't I?"},{"name":"JOYE","text":"Well, I'll think on it. Let's head off to Bloodshore─I've kept his lordship waitin' long enough."},{"name":"BAURENDOUIN","text":"（★未使用／削除予定★）"},{"name":"STEPHANIVIEN","text":"Right! Let's begin, shall we? Our objective shall be to explore the most effective methods of countering our knightly opponents."},{"name":"STEPHANIVIEN","text":"If a knight cannot reach you, he cannot hurt you. Thus, we shall concentrate on those machinist skills that hinder movement."},{"name":"STEPHANIVIEN","text":"I have prepared a crate of aromatic meats, said to be irresistible to giant crabs. For the purpose of this exercise, imagine the shell-covered creatures lured by its scent to be enemy knights, and form tactics to prevent their advance."},{"name":"STEPHANIVIEN","text":"Should the box be broken open, that will signal your defeat. Let's see what strategies you can devise for us, eh, <span class=\"highlight\">Forename</span>?"},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"Don't let none o' them bastards reach the box!"},{"name":"QIB","text":"Look lively, mates! 'Ere comes another lot!"},{"name":"QIB","text":"Set up yer turret! Pick 'em off as quick as ye can!"},{"name":"QIB","text":"Hah! We've stirred up 'alf the bloody shoreline!"},{"name":"QIB","text":"At ease, machinists!<br>Let's call it a day..."},{"name":"QIB","text":"Rostnsthal, wait!<br>What <span class=\"emphasis\">is</span> that thing!?"},{"name":"QIB","text":"Must've caught the scent o' blood!<br>Reload! Take it down, mates!"},{"name":"QIB","text":"I... I still had bullets left..."},{"name":"QIB","text":"Bah, ye'll never win like that."},{"name":"STEPHANIVIEN","text":"That last fellow was rather unexpected, but you handled him nonetheless. Well done! Your performance has prompted my prospectometer, and inspired me with entirely new strategies."},{"name":"JOYE","text":"I-If I may, me lordship... Seein' how well <span class=\"highlight\">Forename</span> is comin' along, maybe you don't need me in the tourney no more."},{"name":"STEPHANIVIEN","text":"Whatever could make you think that, my dear? I need you now more than ever."},{"name":"STEPHANIVIEN","text":"The sight of you, a commoner with scant battle experience, sending seasoned knights stumbling and sprawling will open the eyes of the Holy See. Why, you shall be the bullet that pierces their tradition-bound hearts!"},{"name":"JOYE","text":"...Very well, me lordship. I'll do me best in the name of House Haillenarte─for both you and the count."},{"name":"STEPHANIVIEN","text":"That's the spirit! Now, I must return to the workshop..."},{"name":"STEPHANIVIEN","text":"A fine showing out there, <span class=\"highlight\">Forename</span>. Joye's lack of enthusiasm troubles me somewhat, but I'm sure the moment her hand closes about her stock she'll be as ferocious as ever..."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":96}],"quests":[67237]},"next":[67239]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014769","obj":{"i":1014769,"n":"Joye","l":2301,"q":1}},{"type":"npc","id":"1014770","obj":{"i":1014770,"n":"Joye","l":2301,"q":1}},{"type":"npc","id":"1014771","obj":{"i":1014771,"n":"Count Baurendouin De Haillenarte","l":2301,"q":1}},{"type":"npc","id":"1014772","obj":{"i":1014772,"n":"Stephanivien","l":32,"q":1}},{"type":"quest","id":"67237","obj":{"i":67237,"n":"A Suppressive Strategy","g":158,"l":"Ishgard","s":6,"f":1}},{"type":"quest","id":"67239","obj":{"i":67239,"n":"Rage against the Machinists","g":158,"l":"Ishgard","s":8,"f":1}}]}