{"quest":{"name":"Securing the Locks","location":"Ishgard","id":67236,"patch":3.0,"sort":5,"icon":100444,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014750,1014752,1014753,1014754,1014757,1014760,1014762,1014763,1015539],"genre":158,"journal":["Stephanivien is once more irked by Rostnsthal's absence.","Stephanivien informs you that all is in readiness for the impending battle at Skyfire Locks. All, that is, except for the presence of the manufactory's oft-absent master of marksmanship. Head out into Foundation, and search for Rostnsthal.","You find Rostnsthal not far from the workshop, standing over the defeated form of some unfamiliar ruffian. The instructor claims that he caught the man creeping about nearby, looking to cause mischief for the manufactory. Search for similar troublemakers within Foundation, and scare them off using your Gauss Round skill.","You have scoured the streets of Foundation, and frightened away several other suspicious individuals. Their parting words, however, did not paint a favorable picture of the machinists' master of marksmanship. Return to the Skysteel Manufactory and speak with Stephanivien.","You report your encounters to Stephanivien, and the chief machinist reasons that the appalling rumors and intimidating acts have been initiated by some unprincipled rival of the manufactory. To Stephanivien and Joye's surprise, however, Rostnsthal admits that much of the gossip concerning his reputation is likely true. Though yet reeling at Rostnsthal's matter-of-fact confessions, the machinists must nevertheless finalize their preparations for battle. Meet Stephanivien at Skyfire Locks in the Coerthas central highlands.","You and your fellow machinists have successfully defended Skyfire Locks. Speak with Stephanivien and discuss the aftermath of the battle.","Your victory over the dragons appears to have at last won Count Baurendouin de Haillenarte's grudging respect. Speak with Stephanivien once more.","Stephanivien is eager to prove his profession to a wider audience, and accepts Lord Tedalgrinche's mocking challenge to enter his machinists in the upcoming tourney. Return to the Skysteel Manufactory and speak with Stephanivien.","The chief machinist has confided in you his misgivings concerning House Haillenarte's participation in the coming contest. Though your triumph over the Dravanians was a valuable experience, it may not be enough to prepare the machinists for group combat against battle-hardened knights. Concentrate on your training, and help transform your slim chance at victory into a certainty.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 45."],"objectives":["Search for Rostnsthal.","Use Gauss Round to scare off troublemakers.","Speak with Stephanivien.","Speak with Stephanivien at Skyfire Locks.","Speak with Stephanivien.","Speak with Stephanivien once more.","Speak with Stephanivien at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"Well, <span class=\"highlight\">Forename</span>, we are as ready as ready can be."},{"name":"STEPHANIVIEN","text":"...All except for our wayward instructor. Would you be so kind as to locate Rostnsthal, and inform him of the urgency of our situation? I imagine he is loitering in Foundation somewhere, making his unhurried way to the workshop."},{"name":"STEPHANIVIEN","text":"This shall be the machinists' first engagement, and we need every finger on the trigger. See to your tasks, <span class=\"highlight\">Forename</span>."},{"name":"ROSTNSTHAL","text":"Ah, <span class=\"highlight\">Forename</span>. Look at this scrag I caught me creepin' about near the workshop. Up to no bloody good, I reckoned, so's I sat 'im down for a friendly chat."},{"name":"ROSTNSTHAL","text":"...Hm? A dragon attack? An' the boss needs every 'and on deck, does 'e? Aye, I'll be right there...just as soon as I'm done wringin' some answers from this ugly sod."},{"name":"ROSTNSTHAL","text":"Ye know where there's one rat, there's always a dozen more. Might be best if ye took a quick look 'round yerself, an' deal with any troublemakers afore ye 'ead back. No need to murder anyone, mind─the noise from a Gauss Round ought to scare 'em off."},{"name":"ROSTNSTHAL","text":"I'd wager there's more'n this one rat scurryin' about the place. If ye see any sneaky bastards makin' mischief, a Gauss Round ought to send 'em packin'."},{"name":"FUSHINA01700","text":"Ah! What in the seven hells! You could've taken off a toe!"},{"name":"FUSHINA01700","text":"...You're Rostnsthal's new pup, ain't you? If it's trouble you're lookin' for, then look no further than that backstabbin' Lominsan cur!"},{"name":"FUSHINA01700","text":"Heh heh heh... Just one lick of flame ought to do it..."},{"name":"FUSHINB01700","text":"How uncouth! But I suppose I should expect naught less from one of Rostnsthal's underlings─you learned it from the vicious brute himself."},{"name":"FUSHINB01700","text":"Heed my words! The Skysteel Manufactory plays haven to villains! For the safety of Ishgard's citizens, the manufactory must needs be shut down!"},{"name":"FUSHINB01700","text":"Their Roegadyn instructor poses as the former commodore of the Knights of the Barracuda. This is a lie. In truth, he is a bloodthirsty pirate who murdered his entire crew."},{"name":"FUSHINB01700","text":"For the safety of Ishgard's citizens, the Skysteel Manufactory must needs be shut down!"},{"name":"FUSHINC01700","text":"...You ain't seen the last of me."},{"name":"CELESTAUX","text":"Me thanks. The name's Celestaux─one of your fellow machinists, if you didn't know. I was makin' preparations for our fight with Svara when that thug ambushed me."},{"name":"CELESTAUX","text":"Don't bother chasin' him─I doubt he knows more than what he was paid to do. But he did make it damn clear that someone out there has a grudge against our workshop."},{"name":"CELESTAUX","text":"...Anyway, I ought to get back to me duties. We ain't never fought in a proper battle, let alone against a monster like Svara, an' we'll need all the advantages we can get."},{"name":"FUSHINC01700","text":"You ain't goin' nowhere."},{"name":"CELESTAUX","text":"Gods damn it..."},{"name":"CELESTAUX","text":"Gods damn it..."},{"name":"FUSHINC01700","text":"You ain't goin' nowhere."},{"name":"STEPHANIVIEN","text":"Is everything aright? Rostnsthal tells me there are villains afoot, making trouble for the workshop."},{"name":"STEPHANIVIEN","text":"...Intimidating my machinists, were they? Setting fires and spreading rumors? Joye, too, has overheard vile slander intended to defame our master of marksmanship."},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"},{"name":"JOYE","text":"(-Joye-)You took every care to choose the right employee, me lordship. We could do a lot worse than the former commodore of Limsa Lominsa's Barracudas."},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"},{"name":"JOYE","text":"(-Joye-)And now half of Ishgard thinks he's lyin'─that he's a convict of terrible crimes."},{"name":"STEPHANIVIEN","text":"Does someone seek to harm the manufactory's standing with these attacks upon our instructor's character? I am sorry, Rostnsthal─your association with the machinists has brought you naught but ridicule and insult..."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)Bah, don't blame yerself, boss. After all, more'n 'alf that stuff's probably true."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)Aye, I was the commodore o' the 'Cudas...right up until I got kicked out on me arse for makin' a bloody mess o' things. That's why ye found me in Camp Overlook─I was there to visit one o' me old underlings."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)'Course, 'e'd rather take another axe to the face afore 'e'd talk to me. Me mistakes cost some more'n others, an' there's no bastard in La Noscea as'd call me friend."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)Yer mysterious rival must've learned o' me tarnished past, 'cause they offered a fortune for me to accept the job as yer master o' marksmanship."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)I s'pose they thought the workshop'd be ruined once the truth behind me charmin' reputation became common knowledge."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)But as it turns out, I don't take kindly to bein' some faceless bastard's puppet. So I took their coin─an' yers─an' made for the 'ills. I 'ad no intention of fulfillin' me contract...not until yer 'venturer 'ere went an' got me fired up about teachin' in truth."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)That said, there ain't naught in me agreement that says I gotta fight bleedin' dragons. An' me students'll give a better showin' without me there growlin' over their shoulders, anyroad."},{"name":"STEPHANIVIEN","text":"Though his support will be missed, Rostnsthal is mayhap correct in his assumption─our demonstration will be all the more impressive for his absence. Let us check our weapons one last time, and assemble at Skyfire Locks."},{"name":"STEPHANIVIEN","text":"Allow me to brief you on our defensive strategy ere the dragon and its minions arrive."},{"name":"STEPHANIVIEN","text":"Atop each of the three locks, we have placed a dragon-slaying cannon. Our task as machinists shall be to defend the cannons from Svara's lesser kin."},{"name":"STEPHANIVIEN","text":"You will find a lock in the northeast..."},{"name":"STEPHANIVIEN","text":"A lock to the northwest..."},{"name":"STEPHANIVIEN","text":"...And a lock to the south. I will track the concentrations of our enemy, and direct you to the cannon most in need of protection."},{"name":"STEPHANIVIEN","text":"Hark, the dragons are come... Everyone to your positions!"},{"name":"QIB","text":"Defeat the Dravanian forces!"},{"name":"QIB","text":"Big Bertha East"},{"name":"QIB","text":"Big Bertha West"},{"name":"QIB","text":"Big Bertha South"},{"name":"QIB","text":"I've failed you, me lordship..."},{"name":"QIB","text":"Blast...<br>I had hoped to give a better showing..."},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, to the southern cannon!<br>Joye, to the northwest!"},{"name":"QIB","text":"Loaded and ready!<br>I'm comin' for you scaly bastards!"},{"name":"QIB","text":"Our foe swarms the cannon to the northeast!<br>Joye! <span class=\"highlight\">Forename</span>! Swiftly, now!"},{"name":"QIB","text":"I must staunch the wounds of the fallen!<br>Pray defend the cannons as needed!"},{"name":"QIB","text":"Svara is come!"},{"name":"QIB","text":"Face the cannons towards the brute! Concentrate all fire upon Svara!"},{"name":"QIB","text":"We've won, Father! My machinists have carried the day!"},{"name":"STEPHANIVIEN","text":"Well, Father? Do you see now how we might prevail against dragons without risking the lives of our soldiers?"},{"name":"BAURENDOUIN","text":"...'Twas a most impressive display. I must admit, your commoners acquitted themselves admirably..."},{"name":"TEDALGRINCHE","text":"(-Pretentious Noble-)I <span class=\"emphasis\">thought</span> I heard the terrible din of cannons being fired. And what do I hasten out here to find but the highborn Haillenartes frolicking in the snow with their lowborn lackeys..."},{"name":"TEDALGRINCHE","text":"(-Pretentious Noble-)After providing you with this opportunity to improve the ailing reputation of your noble house, does the consideration of House Dzemael not merit a formal reply?"},{"name":"BAURENDOUIN","text":"Lord Tedalgrinche, my apologies─the foe was upon us ere we could put quill to parchment."},{"name":"TEDALGRINCHE","text":"Ah, yes, I imagine you were full occupied with scraping together a serviceable company of soldiers. If only your dear son was as ardent with his knightly training as he is with his idle tinkering."},{"name":"STEPHANIVIEN","text":"There is naught “idle” in my work. You would not speak such insults had you seen my machinists in action."},{"name":"TEDALGRINCHE","text":"Oh, such a temper! 'Twould seem your association with commoners has eroded your manners as well as your martial skills."},{"name":"TEDALGRINCHE","text":"If you are so confident in these “machinists” of yours, mayhap you should enter them in the upcoming tourney?"},{"name":"STEPHANIVIEN","text":"Mayhap I shall. Upon my oath, we will turn Ishgard's tradition-bound combat upon its ear."},{"name":"TEDALGRINCHE","text":"Ahahaha! The Holy See's adjudicators will be <span class=\"emphasis\">most</span> impressed when your lowborn rabble is chopped to pieces by the tested blades of noble champions!"},{"name":"BAURENDOUIN","text":"My son, what have you done...? The tourney is a stage upon which is flaunted the might and mettle of the four great houses. Only the finest knights are chosen to participate."},{"name":"BAURENDOUIN","text":"Even with the aid of your machinists, our battered ranks stand little chance of victory. Must we now parade our shame before the highest echelons of the Holy See?"},{"name":"STEPHANIVIEN","text":"Do not be so swift to dismiss our chances, Father. I give you my word, House Haillenarte will leave the contest with its pride intact."},{"name":"STEPHANIVIEN","text":"And furthermore, should we win, I will have <span class=\"emphasis\">your</span> word that you shall yield the running of the manufactory to me."},{"name":"BAURENDOUIN","text":"Very well, my stubborn boy. ...And whether you win or no, you be sure to give House Dzemael a darn good pummeling."},{"name":"STEPHANIVIEN","text":"I shall see it done, Father. We will not disappoint you!"},{"name":"JOYE","text":"I never thought I'd see the day the count himself would give us his blessin'..."},{"name":"ROSTNSTHAL","text":"Ye might not've seen me, but I was watchin' all the same. Them dragons didn't know what 'it 'em!"},{"name":"STEPHANIVIEN","text":"<span class=\"highlight\">Forename</span>! By virtue of your undeniable expertise, my father has at last recognized the value of machinistry. But we cannot stop at but one hardheaded knight! This tourney will be our opportunity to demonstrate to all and sundry the potential of our profession."},{"name":"JOYE","text":"Me lordship, if I may... It seems that Lord Tedalgrinche has a dislike for commoners such as me."},{"name":"JOYE","text":"If me presence'll cause you more trouble, then maybe I should quit the manufactory..."},{"name":"ROSTNSTHAL","text":"Pay no mind to that preenin' fop, lass. 'E's all piss an' wind."},{"name":"STEPHANIVIEN","text":"Aye, ever has Tedalgrinche sought to needle me in such a manner. 'Tis not you, my dear, that he despises─'tis the mingling of highborn and lowborn."},{"name":"STEPHANIVIEN","text":"House Dzemael is a powerful family, and their talent for the building of fortifications has brought them vast wealth and influence. Staunch allies of House Durendaire, the Dzemaels have also been party to a number of significant victories.<br>Thus do they stand at the peak of Ishgardian society, looking down their noses at any who do not share their “noble” pedigree."},{"name":"STEPHANIVIEN","text":"If you truly wish to please me, then I would have you shine your brightest in the tourney and wipe that arrogant smirk from his face! Shall we be on our way?"},{"name":"STEPHANIVIEN","text":"I must confess my misgivings to you, <span class=\"highlight\">Forename</span>. When queried as to our chances at victory, my prospectometer returned an unfavorable result."},{"name":"STEPHANIVIEN","text":"We triumphed over dragons, 'tis true...but such a battle has not prepared us to face coordinated parties of seasoned knights. My machinists are simply not ready."},{"name":"STEPHANIVIEN","text":"'Tis fortunate, then, that the tourney is yet some days away. Let us keep such disheartening talk from our colleagues, and continue to train them─and ourselves─for the contest ahead."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":96}],"quests":[67235]},"next":[67237]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014750","obj":{"i":1014750,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014752","obj":{"i":1014752,"n":"Sharp-eyed Loiterer","l":2300,"q":1}},{"type":"npc","id":"1014753","obj":{"i":1014753,"n":"Squinty-eyed Loiterer","l":2300,"q":1}},{"type":"npc","id":"1014754","obj":{"i":1014754,"n":"Shifty-eyed Loiterer","l":2300,"q":1}},{"type":"npc","id":"1014757","obj":{"i":1014757,"n":"Celestaux","l":2300,"q":1}},{"type":"npc","id":"1014760","obj":{"i":1014760,"n":"Stephanivien","l":63,"q":1}},{"type":"npc","id":"1014762","obj":{"i":1014762,"n":"Stephanivien","l":63,"q":1}},{"type":"npc","id":"1014763","obj":{"i":1014763,"n":"Joye","l":63,"q":1}},{"type":"npc","id":"1015539","obj":{"i":1015539,"n":"Rostnsthal","l":63,"q":1}},{"type":"quest","id":"67235","obj":{"i":67235,"n":"Rook Before You Reap","g":158,"l":"Ishgard","s":4,"f":1}},{"type":"quest","id":"67237","obj":{"i":67237,"n":"A Suppressive Strategy","g":158,"l":"Ishgard","s":6,"f":1}}]}