{"quest":{"name":"A Suppressive Strategy","location":"Ishgard","id":67237,"patch":3.0,"sort":6,"icon":100444,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"genre":158,"journal":["Stephanivien wishes to discuss strategy for the upcoming tourney.","Stephanivien bids you stay a while that he might explain the particulars of the coming contest. With the favor of the Holy See riding on its outcome, the competition promises to be fierce indeed, and the chief machinist hints at several strategies he would like to practice. Remain behind and speak with Stephanivien, while Rostnsthal and Joye prepare for the training session in Bloodshore.","Stephanivien fears that his inexperienced machinists─though effective against dragons─will struggle to land shots on the smaller and more agile knights. He has thus bid you provide a shining example during training, that Joye might aspire to match your battle savvy in the tourney itself."],"objectives":["Speak with Stephanivien."],"dialogue":[{"name":"STEPHANIVIEN","text":"Greetings, <span class=\"highlight\">Forename</span>! Your training proceeds apace, I trust? Stay a while, and we can discuss our strategy for the tourney."},{"name":"STEPHANIVIEN","text":"'Twould appear everyone is present─even our dear instructor!─so let us delve into the particulars of the upcoming contest. Now, the degree of favor the Holy See bestows is much influenced by the outcome of the tourney, and thus do the nobles enter only their most able champions."},{"name":"STEPHANIVIEN","text":"I assume that Tedalgrinche, in his small-minded maliciousness, seeks to humiliate us before the adjudicators, and thereby convince the Holy See to cease the flow of funds to the manufactory."},{"name":"JOYE","text":"I don't understand, me lordship. Most Ishgardians ain't hardly aware that machinists exist. Why've we so grabbed Lord Tedalgrinche's attention?"},{"name":"ROSTNSTHAL","text":"That's 'cause 'e's likely noticed that yer firearm can kill a man with naught but yer dainty little finger on the trigger. 'Tis the same reason there's laws in Limsa Lominsa what prevent any ol' drunken whoreson from carryin' a musket."},{"name":"ROSTNSTHAL","text":"An' Ishgard's 'ierarchy ain't exactly fair an' measured, now, is it? If ye arm the lowest folk on the ladder with weapons like ours, then ye can be sure as the tide that their barrels'll soon be pointed towards them over-privileged bastards what stand at the top."},{"name":"ROSTNSTHAL","text":"But as ye say, most o' the nobles don't seem to understand the threat what an army o' machinists could pose. ...This Tedalgrinche bloke is a step ahead, I'll give 'im that much."},{"name":"STEPHANIVIEN","text":"Aye, he's a despicable fellow, but also uncommonly clever. Even so, he has failed to arrive at the most obvious conclusion: a well-trained and well-armed populace would strengthen Ishgard's defenses tenfold."},{"name":"STEPHANIVIEN","text":"And if we are to convince the Holy See of that fact, then we must claim victory at the tourney!"},{"name":"ROSTNSTHAL","text":"Ye got somethin' special in mind, then?"},{"name":"STEPHANIVIEN","text":"I have been considering several strategies, but to practice them here in plain view of our adversaries would void their effectiveness. We must needs look farther afield for a suitable location to train..."},{"name":"ROSTNSTHAL","text":"Bloodshore in eastern La Noscea ought to do the trick. I'll secure us a place where we can shoot to our 'earts' content."},{"name":"STEPHANIVIEN","text":"Joye. Pray make preparations for the journey─after you have attended to your duties at the manor, of course."},{"name":"STEPHANIVIEN","text":"As for you, <span class=\"highlight\">Forename</span>, I would have you test another of my innovations. Remain behind, and I shall make some adjustments to your aetherotransformer."},{"name":"STEPHANIVIEN","text":"Forgive my duplicity, <span class=\"highlight\">Forename</span>─that talk of adjustments was merely an excuse so that we might speak alone. Now, you heard me boast to my father that machinist companies could soon form the backbone of our defense. That was something of an exaggeration."},{"name":"STEPHANIVIEN","text":"When it comes to gigantic dragons, aye, one may as well be firing at the side of a barbican. In the tourney, however, the lesser size of our opponents will work against us─it requires intensive training to consistently track and score hits against targets that are both small and agile."},{"name":"STEPHANIVIEN","text":"And as there is but little time left before the contest, our victory will depend largely upon your skilled contribution."},{"name":"STEPHANIVIEN","text":"If Joye is able to display even a fraction of your battle savvy, then the reputation of the machinists will flourish. Thus I need you to attend our practice with undivided focus, and provide a shining example to which she might aspire!"}],"reward":{"xp":12420},"reqs":{"jobs":[{"lvl":45,"id":96}],"quests":[67236]},"next":[67238]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"quest","id":"67236","obj":{"i":67236,"n":"Securing the Locks","g":158,"l":"Ishgard","s":5,"f":1}},{"type":"quest","id":"67238","obj":{"i":67238,"n":"Blood on the Sands","g":158,"l":"Ishgard","s":7,"f":1}}]}