{"quest":{"name":"Dragoon's Fate","location":"Coerthas Central Highlands","id":67231,"patch":3.0,"sort":600,"icon":100489,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1013494,"involved":[1013483,1013484,1013485,1013489],"genre":150,"journal":["Ser Alberic's jaw is set in anticipation of a confrontation.","Graoully is on the move once more. According to the Observatorium, the creature will soon pass near the Dreaming Dragon in the western highlands of Coerthas. Ser Alberic believes that Heustienne will seek to confront her nemesis, and bids you aid her in the battle. First, make your way to the western highlands of Coerthas and join Ser Alberic at the Convictory.","Ser Alberic informs you that a woman fitting Heustienne's description has been sighted near the Convictory. She was last seen heading north towards the Dreaming Dragon, leaving dead heretics in her wake. Follow this trail of carnage to Heustienne.","You arrive at the scene of a battle, a solitary set of footsteps threading through it. Follow the footsteps north.","You arrive at yet another scene of battle, the selfsame set of footsteps threading through it. Follow the footsteps west.","At the end of the trail of carnage, you find Heustienne staring down Graoully. With your lances joined, you succeed in vanquishing the dragon that for so long had tormented the people of Ishgard. Turn your attention now to your comrade, who continues to wage a battle within herself.","You bear witness to a touching reunion between Heustienne and her father, Montorgains. Bolstered by his words, she vows to conquer the lure of dragon blood, that she might one day return to Ishgard. Till that day, she will roam the land and fight dragons with their own power. And till next you meet her, continue serving the realm as the best Azure Dragoon you can be.<br><br>※The next dragoon quest will be available from Alberic once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Alberic at the Convictory.","Follow the trail of carnage.","Search for Heustienne.","Speak with Heustienne."],"dialogue":[{"name":"ALBERIC","text":"<span class=\"highlight\">Forename</span>! The hour of reckoning is at hand─Graoully is on the move once more!"},{"name":"ALBERIC","text":"According to our astrologians, the creature shall soon pass near the Dreaming Dragon in the western highlands. Heustienne, too, will be aware of this, and she will seek to confront her nemesis. We must go to her aid."},{"name":"ALBERIC","text":"Now, 'twould not do if she were to be seen by her comrades at this juncture. As such, I will assure the Congregation that you have the situation in hand."},{"name":"ALBERIC","text":"By the same token, however, this means we will receive no support from the dragoons. We fight this battle alone."},{"name":"ALBERIC","text":"But without further ado, let us be on our way. Pray see to your preparations and then meet me at the Convictory."},{"name":"ALBERIC","text":"The hour of reckoning is at hand. Let us aid Heustienne and put an end to Graoully."},{"name":"MONTORGAINS","text":"Forgive me, but I insisted that I must join you. Though I am long retired, I will not hesitate to take up my lance again for my daughter."},{"name":"ALBERIC","text":"I have spoken with the people here. A woman fitting Heustienne's description has been sighted nearby."},{"name":"ALBERIC","text":"She was headed north, they say, a lance in her hand and a trail of dead heretics in her wake─remnants of the Bloodbearers, 'twould seem."},{"name":"MONTORGAINS","text":"Ser Alberic has told me all. It matters not what my daughter has become─I am resolved to bring her home. I beg of you, please help her through the coming trial."},{"name":"ALBERIC","text":"Let us split up, the quicker to find Heustienne. Lord Montorgains shall come with me."},{"name":"MONTORGAINS","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"A fierce battle took place here recently. A solitary set of footsteps leads to the north."},{"name":"SYSTEM","text":"A fierce battle took place here recently. A solitary set of footsteps leads to the west."},{"name":"HEUSTIENNE","text":"So you have come... Behold, then, the malign face of my torment─Graoully!"},{"name":"HEUSTIENNE","text":"It gives me heart to know that the Azure Dragoon stands with me against my nemesis!"},{"name":"HEUSTIENNE","text":"Ungh... The craving grows stronger by the day...but I shall not succumb to it! Nay, I shall be no dragon's thrall!"},{"name":"HEUSTIENNE","text":"I failed in my duty before─I shan't fail again!"},{"name":"HEUSTIENNE","text":"Today, I shall claim Graoully's head!"},{"name":"QIB","text":"Defeat Graoully!"},{"name":"QIB","text":"Forgive me, Father... I am unworthy..."},{"name":"QIB","text":"Come and meet your doom, dragon!"},{"name":"QIB","text":"At last, my duty is fulfilled..."},{"name":"QIB","text":"He takes wing! Keep your eyes above!"},{"name":"QIB","text":"Your time is at an end!"},{"name":"QIB","text":"We almost have him! Let us press our advantage!"},{"name":"HEUSTIENNE","text":"&lt;pant&gt; I did it... I resisted the dragon within and fulfilled my duty... I could not have done it without you, <span class=\"highlight\">Forename</span>."},{"name":"HEUSTIENNE","text":"Verily, you are the paragon towards which I aspire. If I am to be like you, I must learn to harness greater power without being consumed by it."},{"name":"HEUSTIENNE","text":"With this battle won, I have a new purpose. I shall conquer the lure of dragon blood and purge every last drop of it from the land!"},{"name":"MONTORGAINS","text":"(-???-)Heustienne! Thank the Fury you are safe!"},{"name":"HEUSTIENNE","text":"Father!? Wh-Why are you here!?"},{"name":"MONTORGAINS","text":"I have come to bring you home. Your mother and I cannot bear to lose you again."},{"name":"HEUSTIENNE","text":"Would that I could return, Father, but I cannot. I have partaken of dragon blood and...and turned. In the eyes of the inquisition, I am no better than a heretic. I cannot allow you to be associated with me."},{"name":"ALBERIC","text":"You needn't worry. This shall remain a secret between the four of us."},{"name":"HEUSTIENNE","text":"No, the risk is too great! Even now, 'tis all I can do to suppress my thirst for dragon blood!"},{"name":"HEUSTIENNE","text":"Since the day I said my vows, I strove to become the Azure Dragoon. Failing that, I strove to be as near to it as I could. Finally, I have the power I longed for, but it renders me an enemy to mine own kind!"},{"name":"ALBERIC","text":"Accursed dragons... How many of ours have you claimed with your foul blood?"},{"name":"MONTORGAINS","text":"Hear me, Heustienne. Not once have you yielded to fate, and you mustn't yield to it now. The road ahead will be fraught with hardships, this I do not doubt, but I have faith that you will overcome them all and return to us."},{"name":"HEUSTIENNE","text":"Thank you, Father. Your faith in me lends me strength. However long it takes, I shall conquer the lure of dragon blood to stand before you once more. Till that day, I shall roam the land and smite our foes with their own power."},{"name":"HEUSTIENNE","text":"This I swear upon my forefathers' lance!"},{"name":"SYSTEM","text":"This concludes the dragoon quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next dragoon quest will be available from Alberic."}],"reward":{"gil":1037,"action":3555,"items":[{"id":20658}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":23}],"quests":[67230]},"next":[68446]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1013494","obj":{"i":1013494,"n":"Heustienne","l":2200,"q":1}},{"type":"npc","id":"1013483","obj":{"i":1013483,"n":"Alberic","l":2200,"q":1}},{"type":"npc","id":"1013484","obj":{"i":1013484,"n":"Montorgains","l":2200,"q":1}},{"type":"npc","id":"1013485","obj":{"i":1013485,"n":"Trail Of Carnage","l":2200,"q":1}},{"type":"npc","id":"1013489","obj":{"i":1013489,"n":"Trail Of Carnage","l":2200,"q":1}},{"type":"action","id":"3555","obj":{"i":3555,"n":"Geirskogul","c":2583,"j":22,"t":4,"l":60}},{"type":"item","id":"20658","obj":{"i":20658,"n":"Dragonlancer's Armor Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67230","obj":{"i":67230,"n":"Sanguine Dragoon","g":150,"l":"Coerthas Central Highlands","s":580,"f":1}},{"type":"quest","id":"68446","obj":{"i":68446,"n":"Friends through Eternity","g":150,"l":"Coerthas Central Highlands","s":601,"f":1}}]}