{"quest":{"name":"Sanguine Dragoon","location":"Coerthas Central Highlands","id":67230,"patch":3.0,"sort":580,"icon":100489,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1006748,"involved":[1013471,1013472,1013475,1013476],"genre":150,"journal":["Ser Alberic has acquired information on the heretics you seek.","Ser Alberic has learned the heretics' identity. Calling themselves the Bloodbearers, they have entered into a pact with Graoully, through which they have abundant access to dragon blood, making them exceedingly dangerous foes. According to Ser Alberic's source, the Bloodbearers have most recently been sighted in the Chocobo Forest. If his instincts serve, and Heustienne means to reclaim her lance Peregrine, she will surely go after them, presenting a chance for you to be reunited with her. Make your way to the Dravanian forelands and join Ser Alberic at Tailfeather.","According to the locals, strange merchants have been frequenting Tailfeather and buying up prodigious quantities of goods. Ser Alberic is convinced that they are the Bloodbearers, here to replenish their stores. He bids you help him search the area for these so-called merchants. If you notice any suspicious individuals, confront them and gauge their reaction.","The merchant you approach reveals himself to be a heretic, and you are forced to defend yourself. A search of the man's body turns up a strange sliver of parchment. Return to Ser Alberic and have him examine it.","The sliver of parchment bears a message ciphered in a manner favored by heretics, but for a blessing Ser Alberic is able to make sense of it. It appears there is to be a meeting of some description in an area of the forest south of Tailfeather. Make your way there and be present for whatever may come to pass.","You arrive at the scene of the meeting to find Heustienne on her knees but alive, the dead bodies of several heretics strewn about her. As Ser Alberic predicted, she has come to recover her lance. Yet, though she has accomplished this task, she refuses to return with you to Ishgard. At Ser Alberic's insistence, she finally reveals the reason for her actions: when she was a prisoner of the heretics, she was made to drink dragon blood, and had already once turned into a dragon. Resigned to being judged a heretic by the inquisition, she declares her intent to go after Graoully, and Ser Alberic can find no words to change her mind. For now, rejoin Ser Alberic at the Observatorium.","Ser Alberic believes that Heustienne has a fighting chance against Graoully, if she can but master the dragon power that threatens to consume her. He bids you resume your training, all the while keeping your purpose close to your heart, that you may be ready to stand with Heustienne in her ultimate test.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 60."],"objectives":["Speak with Alberic at Tailfeather.","Speak with the shady merchant at Tailfeather.","Show the sliver of parchment to Alberic.","Scout the designated meeting point south of Tailfeather.","Speak with Alberic at the Observatorium."],"dialogue":[{"name":"ALBERIC","text":"You come at a good time, my friend. I have tidings to share regarding the heretics we pursue."},{"name":"ALBERIC","text":"They call themselves the Bloodbearers, and their leader is a man named Matheonien. He and his minions are all capable of assuming the form of dragons."},{"name":"ALBERIC","text":"Such a transformation is possible by partaking of dragon blood─I daresay you have borne witness to it─and it grants the individual unholy strength."},{"name":"ALBERIC","text":"Though the sanguine substance is precious, the Bloodbearers have access to an abundant supply owing to their pact with Graoully. That is why they have been able to offer our forces such fierce resistance."},{"name":"ALBERIC","text":"Now, my sources tell me that the Bloodbearers have been sighted in the Chocobo Forest. If Heustienne means to reclaim Peregrine, as I believe, that is where she will go─and so must we."},{"name":"ALBERIC","text":"Pray meet me at Tailfeather. We shall begin by making inquiries around the settlement."},{"name":"ALBERIC","text":"I pray that we will be able to bring Heustienne home..."},{"name":"ALBERIC","text":"I took the liberty of speaking with some of the locals before you arrived."},{"name":"ALBERIC","text":"They say that strange merchants have been acquiring goods in prodigious quantities. It seems to me the Bloodbearers are replenishing their stores."},{"name":"ALBERIC","text":"Let us split up and scour the area for these so-called merchants. Should someone strike you as suspicious, confront him and gauge his reaction."},{"name":"ITANSHA01694","text":"...One o' the See's dogs!? Ye ain't takin' me alive!"},{"name":"ALBERIC","text":"The one suspicious fellow I approached was an honest chocobo breeder. How fared your search?"},{"name":"ALBERIC","text":"Attacked by a false merchant! And you say you found this sliver of parchment upon the man... Hmmm, it bears a message ciphered in a manner favored by heretics. Thankfully, I am versed in it."},{"name":"ALBERIC","text":"There is to be a meeting a short way south of here. Let us go there at once."},{"name":"ALBERIC","text":"Thank the Fury, we were not too late."},{"name":"HEUSTIENNE","text":"<span class=\"highlight\">Forename</span>... Why are you here? Why is Ser Alberic here?"},{"name":"ALBERIC","text":"Rest assured your secret is safe with us. Your father is the only other soul that knows; <span class=\"highlight\">Forename</span> could not bear to see him suffer so.<br>...What ails you?"},{"name":"HEUSTIENNE","text":"I am fine... It will pass... Now, I suspect it was Matheonien that led you here. As you can see, he and his Bloodbearers shall trouble the Holy See no more."},{"name":"ALBERIC","text":"Even in self-imposed exile, you think of duty... But now that you have reclaimed Peregrine, there is no need for further deception. Come with us back to Ishgard─your family and your comrades have need of you."},{"name":"HEUSTIENNE","text":"I am sorry, but I cannot. I cannot return to Ishgard ever again."},{"name":"ALBERIC","text":"Why!? What has happened to you!? The Heustienne I know would <span class=\"emphasis\">never</span> forsake her people! She would <span class=\"emphasis\">never</span> turn her back on her nation!"},{"name":"HEUSTIENNE","text":"Please understand! I wish with all my heart to return home, but I have no choice!"},{"name":"HEUSTIENNE","text":"I have partaken of dragon blood! When the heretics held me captive, they forced the vile substance down my throat!"},{"name":"ALBERIC","text":"Halone have mercy... Th-Then you..."},{"name":"HEUSTIENNE","text":"Aye... I have already turned... Were I to set foot in Ishgard, I would be charged with heresy of the worst order."},{"name":"HEUSTIENNE","text":"If I alone must suffer, then so be it. But you know as well as I how the inquisition works. Should I be declared a heretic, suspicion is like to fall upon my parents as well. I will not allow that to happen."},{"name":"ALBERIC","text":"Full well do I understand your plight, but what do you intend to do? You cannot mean to throw your life away!"},{"name":"HEUSTIENNE","text":"Perish the thought! I owe my life to my father! If I must die, it shall not be in vain!"},{"name":"HEUSTIENNE","text":"As <span class=\"highlight\">Forename</span> has shown us, a dragoon needs no banners to do what is right. And I know full well what I must do."},{"name":"HEUSTIENNE","text":"Upon my lance, I swear to hunt down Graoully and end his reign of terror!"},{"name":"HEUSTIENNE","text":"Thank you, <span class=\"highlight\">Forename</span>. For showing me the path I must walk. For helping me to accept my fate."},{"name":"HEUSTIENNE","text":"I asked this of you once before, but I shall ask it again: please take care of my comrades and my father."},{"name":"ALBERIC","text":"No matter how I searched, I could find no words to stop her... For now, let us return to the Observatorium."},{"name":"ALBERIC","text":"As I made my way back, I recalled words Heustienne once said to me."},{"name":"ALBERIC","text":"“My worth is measured by the dragons I slay.”"},{"name":"ALBERIC","text":"To be changed into the very thing she has sworn to fight... I can only imagine the storm of turmoil that must rage within her."},{"name":"ALBERIC","text":"Yet cruel though her fate is, we must make the best of the hand we have been dealt. And I believe I spy an opportunity."},{"name":"ALBERIC","text":"In partaking of dragon blood, Heustienne has come to harbor the power of dragons. If she can but master this power, she may well have a fighting chance against Graoully."},{"name":"ALBERIC","text":"It is not so different from harnessing the power of the Eye, I believe. Alas, the danger of corruption is far greater."},{"name":"ALBERIC","text":"As you yourself have witnessed, dragon blood alters the flesh. And once the flesh is altered, the mind must soon follow."},{"name":"ALBERIC","text":"Will Heustienne be able to conquer the dragon that has roused within her? I know not. But we must believe in her and lend her our strength, else she will surely be lost to us."},{"name":"ALBERIC","text":"Pray resume your training once more, <span class=\"highlight\">Forename</span>, and keep your purpose ever close to your heart. For when next we meet, it will be to confront the dragon Graoully!"}],"reward":{"gil":1377,"action":3556,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":23}],"quests":[67229]},"next":[67231]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1013471","obj":{"i":1013471,"n":"Alberic","l":2000,"q":1}},{"type":"npc","id":"1013472","obj":{"i":1013472,"n":"Shady Merchant","l":2000,"q":1}},{"type":"npc","id":"1013475","obj":{"i":1013475,"n":"Alberic","l":2000,"q":1}},{"type":"npc","id":"1013476","obj":{"i":1013476,"n":"Heustienne","l":2000,"q":1}},{"type":"action","id":"3556","obj":{"i":3556,"n":"Wheeling Thrust","c":2584,"j":22,"t":3,"l":58}},{"type":"quest","id":"67229","obj":{"i":67229,"n":"Dragoon's Errand","g":150,"l":"Coerthas Central Highlands","s":560,"f":1}},{"type":"quest","id":"67231","obj":{"i":67231,"n":"Dragoon's Fate","g":150,"l":"Coerthas Central Highlands","s":600,"f":1}}]}