{"quest":{"name":"Rage against the Machinists","location":"Ishgard","id":67239,"patch":3.0,"sort":8,"icon":100444,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014775,1014776,1014777,1014778,1014779,1014782],"genre":158,"journal":["Stephanivien would ask you to gather your colleagues for the tourney.","Stephanivien, exultant that the day of the tourney is at hand, would have you call your colleagues back to the manufactory. Head outside the workshop, and speak with Joye.","You approach Joye, only to find her frantic at the discovery of a crate full of broken firearms. After you soothe her panic somewhat, she is able to tell you where Rostnsthal is to be found. Head towards the other side of the workshop, and seek out the master of marksmanship.","Rostnsthal is furious to hear of the smashed weapons, and bids you scour the area around the manufactory for the culprit's accomplices. Search Foundation for lingering miscreants, and scare them away using Gauss Round.","You encounter three potential troublemakers, and warn them off with your frighteningly accurate marksmanship. Return to the manufactory and report to Stephanivien.","No sooner have you described your encounters to Stephanivien when a nearby explosion rocks the workshop. Head outside and speak with Joye.","Joye mournfully shares her discovery of the destroyed turrets, but it seems that Stephanivien is not yet ready to surrender House Haillenarte's place in the tourney. The chief machinist vows to replace the damaged weaponry, and sends your colleagues ahead to put on a show of confidence. Join Stephanivien in the manufactory, and discuss what must be done to overcome this latest disaster.","In the face of repeated attacks against the workshop and your dwindling chances of success, Stephanivien finds himself ever more dependent upon the brilliance of a talented few─namely you and Joye. But will skill alone be enough to balance the loss of so much machinist weaponry...?"],"objectives":["Speak with Joye.","Speak with Rostnsthal.","Use Gauss Round to scare off troublemakers.","Report to Stephanivien.","Speak with Joye.","Speak with Stephanivien."],"dialogue":[{"name":"STEPHANIVIEN","text":"The day of the tourney is finally upon us. This is it, <span class=\"highlight\">Forename</span>! This is machinistry's moment of truth!"},{"name":"STEPHANIVIEN","text":"Pray gather our colleagues together. Joye should be just outside performing some last-moment firearm inspections, and Rostnsthal...well, Joye may have a better idea of his whereabouts than I."},{"name":"STEPHANIVIEN","text":"Pray inform our colleagues that the moment is at hand."},{"name":"JOYE","text":"Oh, <span class=\"highlight\">Forename</span>, this is a disaster! Someone has broken into our storage crates and smashed all the firearms!"},{"name":"JOYE","text":"I-I must tell his lordship! ...No! We must check the other crates first! Or, maybe... Oooh, what do we do!?"},{"name":"JOYE","text":"...Aye, you're right, of course. Givin' in to panic won't help us none. I'll see what's become of the rest of the weapons, then report me findings to his lordship."},{"name":"JOYE","text":"Rostnsthal? Last I saw, he was gettin' some fresh air out behind the workshop."},{"name":"ROSTNSTHAL","text":"Don't look now, <span class=\"alternative-container\"><span class=\"alternative\">lassie</span><span class=\"alternative\">lad</span></span>, but I think we've got visitors again. Stubborn bastards..."},{"name":"ROSTNSTHAL","text":"...Eh!? Smashed up our firearms, ye say!? Seems whatever scrag it is as wants us gone is done with bein' subtle."},{"name":"ROSTNSTHAL","text":"We'd best run off the rest o' these thugs afore they decide to set fire to the place."},{"name":"ROSTNSTHAL","text":"Ye know what to do: warning Gauss Rounds only so's we don't bring the wrath o' the Temple Knights down upon us. Meet me back in the workshop when yer done with yer patrol."},{"name":"PROWLER01703A","text":"Hm hm hm. The timin' has to be perfect..."},{"name":"PROWLER01703A","text":"Gah! Where'd you come from!?"},{"name":"PROWLER01703B","text":"'Tis naught personal, Haillenarte, but coin is coin..."},{"name":"PROWLER01703B","text":"P-Please, no! 'Twasn't my idea!"},{"name":"PROWLER01703C","text":"Just wait until no one is lookin'..."},{"name":"PROWLER01703C","text":"...Ah! That purse ain't worth gettin' shot at!"},{"name":"STEPHANIVIEN","text":"<span class=\"highlight\">Forename</span>, are you quite all right? Our fine instructor here tells me you've both been busy chasing off hired miscreants again."},{"name":"JOYE","text":"(-Joye-)I'm afraid the damage has already been done, me lordship. Even after scrapin' together our spares, we've less than half the weapons we need for the tourney..."},{"name":"JOYE","text":"（★未使用／削除予定★）"},{"name":"STEPHANIVIEN","text":"Then half will just have to do. 'Twill be difficult, I know, but I believe we still have a chan─"},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)What in the bloody 'ells was that!? Sounds like someone fired a damn cannon or summat!"},{"name":"STEPHANIVIEN","text":"Whatever is it this time...?"},{"name":"JOYE","text":"Oh, m-me lordship... Our turrets..."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)Blast! We must've missed one o' the shite-eatin' bastards!"},{"name":"JOYE","text":"That's it, then. We'll have to forfeit the contest."},{"name":"STEPHANIVIEN","text":"Nay, my dear. There is yet time to remedy this! These efforts to confound our chances serve but to stoke the fires of my determination!"},{"name":"STEPHANIVIEN","text":"Pray accompany me back inside, <span class=\"highlight\">Forename</span>."},{"name":"STEPHANIVIEN","text":"Rostnsthal! Joye! Lead your fellow machinists to the tourney field, and don you masks of supreme confidence. Whilst our mysterious enemy is distracted by your show of bravado, I shall work to replace the damaged firearms."},{"name":"JOYE","text":"B-But, how can you craft so many weapons afore the contest begins!?"},{"name":"STEPHANIVIEN","text":"The short of it is: I cannot. Not to my usual exacting specifications, of course. Only the four of us must be aware of the poor quality of our replacements."},{"name":"STEPHANIVIEN","text":"You and Joye must needs fight that much harder, to compensate for your colleagues' lack of firepower."},{"name":"CELESTAUX","text":"I'll do me best to keep the others in high spirits, too, Lord Stephanivien. Me apologies─I wasn't tryin' to eavesdrop or nothin', but when I heard the noise..."},{"name":"STEPHANIVIEN","text":"Ah, Celestaux... Well, there's naught for it, now. Welcome to the conspiracy."},{"name":"STEPHANIVIEN","text":"Formidable foes. Meager chance of success. This shall be a victory worthy of song!"},{"name":"STEPHANIVIEN","text":"Would that the odds were not so heavily stacked against us, but we cannot let a few setbacks stand in the way of our moment of glory!"}],"reward":{"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":96}],"quests":[67238]},"next":[67240]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014775","obj":{"i":1014775,"n":"Joye","l":2300,"q":1}},{"type":"npc","id":"1014776","obj":{"i":1014776,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014777","obj":{"i":1014777,"n":"Sharp-eyed Loiterer","l":2300,"q":1}},{"type":"npc","id":"1014778","obj":{"i":1014778,"n":"Squinty-eyed Loiterer","l":2300,"q":1}},{"type":"npc","id":"1014779","obj":{"i":1014779,"n":"Shifty-eyed Loiterer","l":2300,"q":1}},{"type":"npc","id":"1014782","obj":{"i":1014782,"n":"Joye","l":2300,"q":1}},{"type":"quest","id":"67238","obj":{"i":67238,"n":"Blood on the Sands","g":158,"l":"Ishgard","s":7,"f":1}},{"type":"quest","id":"67240","obj":{"i":67240,"n":"The Power of a Tourney","g":158,"l":"Ishgard","s":9,"f":1}}]}