{"quest":{"name":"Taking the Fall","location":"Ishgard","id":67246,"patch":3.0,"sort":14,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"genre":158,"journal":["Stephanivien is frustrated by the lack of movement evinced by the wheels of justice.","Stephanivien seems confused by the Temple Knights' seeming inertia─a confusion that is compounded by the sudden arrival of a smirking Tedalgrinche. The nobleman casually explains how the manufactory's evidence against him was overturned, and goes on to deliver an ultimatum to the chief machinist: slay the dragon Veri Selen, or be judged guilty by the Holy See. Realizing that to face the immense beast is akin to suicide, Rostnsthal offers to spare the machinists by turning himself in for the crime of insurrection. Speak with Stephanivien and discuss what can be done.","Unwilling to allow Rostnsthal to suffer for crimes he did not commit, Stephanivien vows to convince the instructor that they have a chance to win against Veri Selen. Head to Ok' Vundu Vana in the Sea of Clouds, and acquire clear lightning crystals for the chief machinist's latest marvel.","You steal into Ok' Vundu Vana, and lighten the Vanu Vanu's baskets. Return to the Skysteel Manufactory and deliver the crystals to Stephanivien.","Stephanivien gratefully accepts the Vanu Vanu's unwitting contribution to machinistry, and uses the crystals to enhance the performance of your autoturrets. With luck, this latest advancement will be sufficiently impressive to change Rostnsthal's stubborn course..."],"objectives":["Speak with Stephanivien.","Investigate locked baskets and obtain clear lightning crystals.","Deliver the clear lightning crystals to Stephanivien at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"<span class=\"highlight\">Forename</span>, I trust your training fares well? I have heard naught on the fate of the manufactory, and would welcome fair news from any quarter..."},{"name":"JOYE","text":"Bad news, me lordship: we talked to a clerk who works at the Congregation, and he says the accusation against the workshop ain't been lifted yet."},{"name":"ROSTNSTHAL","text":"What's worse, it seems they ain't inclined to pursue yer case against Tedalgrinche, neither."},{"name":"STEPHANIVIEN","text":"I do not understand. When I presented my evidence to the Temple Knights, the officer in charge seemed convinced of our innocence..."},{"name":"TEDALGRINCHE","text":"Ahahaha, my dear, naive Stephanivien. Truth is dictated by the victor─the one most skilled in strategy; the one most adept at maneuvering. One such as <span class=\"emphasis\">me</span>."},{"name":"STEPHANIVIEN","text":"How dare you show your face in my manufactory! Have you no shame at all!?"},{"name":"TEDALGRINCHE","text":"Shame? Why, you were the one who submitted a <span class=\"emphasis\">forgery</span> of my house's seal in an attempt to deflect your obvious guilt. Upon review of the evidence, however, the Temple Knights shall soon rule in my favor."},{"name":"STEPHANIVIEN","text":"But our sources were unimpeachable! Our innocence was all but proven!"},{"name":"TEDALGRINCHE","text":"The twice-altered testimony of a commoner is hardly unimpeachable... And you cannot deny claims that the ailing House Haillenarte has been arming the lowborn and inciting them to seize their “independence.” We have all heard the shots fired within the city walls..."},{"name":"STEPHANIVIEN","text":"You would twist and corrupt everything we have worked for..."},{"name":"TEDALGRINCHE","text":"Ahahaha! As I said, such is the privilege of the victor. If you wish, I might even be willing to teach you how to bend this situation to your advantage."},{"name":"STEPHANIVIEN","text":"Hmph, we shall do well enough on our own. Now, exit my manufactory ere you find your shiny armor doused with machine oil!"},{"name":"TEDALGRINCHE","text":"You would spurn my generous advice? Will you truly surrender your last chance to demonstrate House Haillenarte's unswerving devotion to Ishgard's prosperity?"},{"name":"TEDALGRINCHE","text":"There is a beast that has been harassing our supply trains of late─a menace that the Holy See greatly desires to see put down. Even cloistered here amongst your scrap-covered benches, you must have heard tales of the fearsome Veri Selen..."},{"name":"STEPHANIVIEN","text":"Veri Selen!? The same dragon that the Order of the Knights Dragoon has failed time and again to slay!?"},{"name":"ROSTNSTHAL","text":"'E means to make a bloody show of ye, boss..."},{"name":"TEDALGRINCHE","text":"The Holy See has agreed to abolish your trial in exchange for the dragon's death. Pray send word when you are prepared to face Veri Selen─I shall organize for a priest to be present, and provide you with suitable...“bait.”"},{"name":"JOYE","text":"M-Me lordship... What do we do...?"},{"name":"ROSTNSTHAL","text":"Bah, I'll just confess it was me what was firin' me weapon. Ye shouldn't 'ave any trouble layin' the blame on a drunken outsider─'specially one what's known for 'is vicious crimes. That oughta get ye off the insurrection charges at least."},{"name":"STEPHANIVIEN","text":"No! You cannot do such a thing!"},{"name":"ROSTNSTHAL","text":"I lived 'alf me life in a ship's cabin, an' a prison cell ain't much smaller. Ye can pay me for the time in the brig after they let me out."},{"name":"JOYE","text":"I-I'll stop him, me lordship!"},{"name":"STEPHANIVIEN","text":"By the Fury, that man's full of surprises... My prospectometer had naught to say of this eventuality."},{"name":"STEPHANIVIEN","text":"I cannot allow our instructor to sacrifice himself for the manufactory. We have no choice but to accept Tedalgrinche's impossible challenge."},{"name":"STEPHANIVIEN","text":"But I fear Rostnsthal will not be convinced unless we prove we have a chance of defeating Veri Selen."},{"name":"STEPHANIVIEN","text":"...I do have a machinistry marvel in mind that might just do the trick. Its implementation, however, will require a number of clear lightning crystals, of the like found in the Sea of Clouds."},{"name":"STEPHANIVIEN","text":"'Tis said that the Vanu Vanu store such crystals for use in their tribal ceremonies. Pray steal into Ok' Vundu Vana, and lighten their baskets a touch. Surely they won't miss a handful or two..."},{"name":"STEPHANIVIEN","text":"For the machinistry marvel I have in mind, I shall have need of the clear lightning crystals found in the Sea of Clouds..."},{"name":"STEPHANIVIENE","text":"For the machinistry marvel I have in mind, I shall have need of the clear lightning crystals found in the Sea of Clouds..."},{"name":"STEPHANIVIEN","text":"Ah, yes, these are wonderful specimens. These crystals shall allow me to broaden the capabilities of your aetherotransformer via a more efficient process of energy conversion. I only hope it will be impressive enough to convince our instructor to abandon his foolish course!"}],"reward":{"gil":1595,"action":16498,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":96}],"quests":[67244]},"next":[67247]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"action","id":"16498","obj":{"i":16498,"n":"Drill","c":3043,"j":31,"t":3,"l":58}},{"type":"quest","id":"67244","obj":{"i":67244,"n":"Wheels of Justice","g":158,"l":"Ishgard","s":13,"f":1}},{"type":"quest","id":"67247","obj":{"i":67247,"n":"Rusted Steel","g":158,"l":"Ishgard","s":15,"f":1}}]}