{"quest":{"name":"A Joye-less Celebration","location":"Ishgard","id":67241,"patch":3.0,"sort":10,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014796,"involved":[1014793,1014795,1014797,1014798],"genre":158,"journal":["Stephanivien wishes to celebrate your tourney victory.","Stephanivien, still exultant over your tourney victory, wishes to hold a celebration with his triumphant machinists. First, however, you must gather your colleagues for the festivities. Head outside the workshop and look for Rostnsthal.","Rostnsthal is reluctant to join the celebrations, claiming he had little influence over the result of the contest. Ignoring his protestations, Celestaux promises to drag the instructor back to the workshop while you approach Count Baurendouin de Haillenarte about releasing Joye early from her manor duties. Make your way to Haillenarte Manor, and speak with the count.","Upon hearing your request, the count informs you that Joye will not be attending the celebrations. Return to the Skysteel Manufactory, and hear Baurendouin's explanation.","You arrive back at the manufactory, and the count announces the reason behind Joye's conspicuous absence: the young lady has wed. As is custom in Ishgard, the newly married Joye has resigned from her duties at both the manor and the workshop, leaving Stephanivien and her colleagues short a talented machinist. In the event that Joye does not return, you must train with renewed intensity to fill the void left by her departure.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 52."],"objectives":["Speak with Rostnsthal.","Speak with Baurendouin outside Haillenarte Manor.","Speak with Baurendouin at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"With our tourney victory, we have indelibly etched the machinist presence in the minds of the Holy See. And, now that my father has relinquished the running of the manufactory to me, 'twould seem our fortunes have at last taken a turn for the better."},{"name":"STEPHANIVIEN","text":"Father has also formally responded to Lord Tedalgrinche, promising our support in House Dzemael's next sortie."},{"name":"STEPHANIVIEN","text":"I am not yet privy to the details of the operation, but I imagine the role Tedalgrinche will choose for us shall be both demanding and dangerous."},{"name":"STEPHANIVIEN","text":"In his attempt to humiliate the machinists, however, he will only provide us with another stage on which to prove our worth. A victory in the field will garner us greater support from the Holy See, and allow me to apportion funds towards the development of ever more potent weapons."},{"name":"STEPHANIVIEN","text":"Thus 'tis vitally important that we see this operation succeed. But an equally important matter must be addressed ere we delve too deeply into such concerns: the celebration of our tourney triumph! We must have Joye and Rostnsthal join us for the festivities."},{"name":"STEPHANIVIEN","text":"Ah, but I believe Joye's services are yet required at the manor─pray seek out our master of marksmanship first, if you would."},{"name":"STEPHANIVIEN","text":"My machinists deserve to enjoy their hard-won victory!"},{"name":"ROSTNSTHAL","text":"A party, is it? Bah, I ain't goin'─all I did durin' the tourney was watch."},{"name":"CELESTAUX","text":"(-Celestaux-)How can you say that, Master Rostnsthal? Without your instruction, we'd never have stood a chance. And now look at us: upstart commoners, defeatin' the likes of seasoned knights."},{"name":"ROSTNSTHAL","text":"I taught ye 'ow to shoot, aye, but that tourney victory was summat ye managed all on yer own."},{"name":"CELESTAUX","text":"(-Celestaux-)I can see arguin' with you ain't gettin' me nowhere─I'll just drag you back to the workshop instead. ...But still, we can't begin the festivities without Joye."},{"name":"CELESTAUX","text":"(-Celestaux-)This time of the day, she'll be at her chores in the manor house. Maybe if you talk to the count, he'll let her leave early to attend the celebration."},{"name":"CELESTAUX","text":"(-Celestaux-)She ain't one to abandon her duties half done, though. It'd be best to approach the count directly, and not give her a chance to object."},{"name":"ROSTNSTHAL","text":"Aye, the lass is awful serious about 'er work. Wouldn't want 'er keelin' over from guilt now, would we?"},{"name":"CELESTAUX","text":"(-Celestaux-)The count should be home if you don't mind talkin' to him; I'll be sure the instructor here makes it to the celebration."},{"name":"BAURENDOUIN","text":"There is to be a celebration, is there? Ah, and naturally you have come to fetch Joye."},{"name":"BAURENDOUIN","text":"Pray return to the manufactory, and I shall be along forthwith to explain why she shan't be attending..."},{"name":"ROSTNSTHAL","text":"I taught ye 'ow to shoot, aye, but that tourney victory was summat ye managed all on yer own."},{"name":"CELESTAUX","text":"We can't begin the festivities without Joye."},{"name":"BAURENDOUIN","text":"Everyone is present, yes? Once again, pray allow me to congratulate you all on your tourney performance. Ere you celebrate your victory, however, I have news..."},{"name":"STEPHANIVIEN","text":"What is it, Father?"},{"name":"BAURENDOUIN","text":"'Twas quite a sudden development, but...Joye has wed."},{"name":"ROSTNSTHAL","text":"Bloody 'ells! Well, there's another good reason to bring out the grog."},{"name":"STEPHANIVIEN","text":"Wed? I had heard naught of any engagement. She is gone, then...?"},{"name":"BAURENDOUIN","text":"Aye, Joye's chambers at the manor have already been emptied. And now that she is married, I do not foresee her returning to the manufactory. She left behind her firearm..."},{"name":"ROSTNSTHAL","text":"Wait, what's Joye gettin' married got to do with 'er leavin' the workshop?"},{"name":"CELESTAUX","text":"Within the walls of Ishgard, 'tis usually the unwed what serve the manor houses. Many retire from such work upon the day of their marriage, as young Joye has done."},{"name":"STEPHANIVIEN","text":"'Tis all too much... Now that we have at last earned a modicum of recognition, 'tis ill timed indeed to lose so talented a machinist."},{"name":"BAURENDOUIN","text":"'Twould seem that familial circumstances demanded a swift union be made. But let us not bemoan what is lost─let us instead raise a toast to the happiness Joye has found."},{"name":"BAURENDOUIN","text":"You must needs accept that your colleague has moved on, and adapt your strategies accordingly. House Dzemael will call upon you soon, and I expect to hear great things from this allied operation."},{"name":"STEPHANIVIEN","text":"A yawning abyss has opened in our ranks. How could she leave us without so much as a final farewell...?"},{"name":"CELESTAUX","text":"Familial circumstances... Has somethin' ill befallen her dad, I wonder?"},{"name":"STEPHANIVIEN","text":"Celestaux, you are acquainted with Joye's father?"},{"name":"CELESTAUX","text":"Aye, we oft hunted together. He was the one what suggested I try me hand here at the workshop─told me his daughter'd found herself a decent job with a fine employer."},{"name":"STEPHANIVIEN","text":"Then mayhap he can also tell you whither his daughter has gone. I would fain convince both the wife and her new husband to accept positions at the manufactory."},{"name":"CELESTAUX","text":"I'll speak with him, me lord. I don't much fancy takin' to the field without Joye and her uncanny aim at me side!"},{"name":"STEPHANIVIEN","text":"Even should Joye refuse my overture, however, we cannot simply abandon our obligation to House Dzemael. Rostnsthal, you must drill your students without quarter."},{"name":"ROSTNSTHAL","text":"I'll push 'em as 'ard as ye like, boss. As long as I'm fairly compensated..."},{"name":"STEPHANIVIEN","text":"The celebrations shall have to wait, <span class=\"highlight\">Forename</span>. Unless we can persuade Joye to return, the burdens of battle must be divided betwixt those of us who remain."},{"name":"STEPHANIVIEN","text":"But surely she will come back to us. Surely..."},{"name":"SYSTEM","text":"The next machinist quest will be available from Stephanivien upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1153,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":96}],"quests":[67240]},"next":[67242]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014796","obj":{"i":1014796,"n":"Count Baurendouin De Haillenarte","l":2300,"q":1}},{"type":"npc","id":"1014793","obj":{"i":1014793,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014795","obj":{"i":1014795,"n":"Count Baurendouin De Haillenarte","l":2301,"q":1}},{"type":"npc","id":"1014797","obj":{"i":1014797,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014798","obj":{"i":1014798,"n":"Celestaux","l":2300,"q":1}},{"type":"quest","id":"67240","obj":{"i":67240,"n":"The Power of a Tourney","g":158,"l":"Ishgard","s":9,"f":1}},{"type":"quest","id":"67242","obj":{"i":67242,"n":"Pushing the Brume","g":158,"l":"Ishgard","s":11,"f":1}}]}