{"quest":{"name":"Rusted Steel","location":"Ishgard","id":67247,"patch":3.0,"sort":15,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014830,1014831],"genre":158,"journal":["Stephanivien has word on the situation with Rostnsthal.","Stephanivien informs you that Joye and several of her colleagues have caught up to Rostnsthal. Fearing that the determined instructor will be difficult to stop, the chief machinist sends you along to aid in his detainment. Head to the Pillars and confront Rostnsthal.","You arrive at the scene to find Rostnsthal in a tense confrontation with several machinists. Joye bids you fire upon the instructor, and take the fight out of him before anyone is seriously hurt. Approach Rostnsthal, and wind him with a Gauss Round.","You beat Rostnsthal on the draw, and impress upon him the efficacy of his own instruction. Stephanivien arrives soon after, and convinces the pirate that giving himself up will solve nothing in the long term. Rostnsthal then shares with you the sins of his past, and demands to be given the chance to atone by helping you defeat Veri Selen. Return to the Skysteel Manufactory and speak with Stephanivien.","Stephanivien has informed Tedalgrinche of the manufactory's decision to face Veri Selen. Even with Rostnsthal's promised aid, however, he fears that this challenge will test you and your fellow machinists to your very limits. Make the most of the time remaining before the battle to hone your skills to a razor's edge.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 60."],"objectives":["Confront Rostnsthal in the Pillars.","Use Gauss Round on Rostnsthal.","Speak with Stephanivien at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"One of our machinists just returned to report on the situation with Rostnsthal. 'Twould seem that Joye and some few colleagues have caught up to him in the Pillars. Pray make your way to the scene, and persuade the instructor to stand down."},{"name":"STEPHANIVIEN","text":"Joye and some few colleagues have caught up to Rostnsthal in the Pillars. Pray make your way to the scene, and persuade the instructor to stand down."},{"name":"JOYE","text":"<span class=\"highlight\">Forename</span>! You've got to stop him!"},{"name":"ROSTNSTHAL","text":"Shoulda known ye'd be along... Now, back off afore I teach this student the meanin' o' “point-blank.”"},{"name":"ROSTNSTHAL","text":"I'm talkin' to you as well, Joye! Step aside!"},{"name":"JOYE","text":"I bloody well will not step aside! <span class=\"highlight\">Forename</span>! Take the fight out of him with a Gauss Round, if you please!"},{"name":"ROSTNSTHAL","text":"So that's 'ow it's gonna be, eh? Come on, then! We'll see who shoots who first!"},{"name":"ROSTNSTHAL","text":"Back off afore I teach this student the meanin' o' “point-blank.”"},{"name":"ROSTNSTHAL","text":"...Bloody 'ells, that was fast."},{"name":"STEPHANIVIEN","text":"Your students ever strive to impress you, Rostnsthal."},{"name":"STEPHANIVIEN","text":"And 'tis thanks to <span class=\"highlight\">Forename</span>'s diligence that I was able to once more improve the tools of our trade."},{"name":"STEPHANIVIEN","text":"Even Veri Selen cannot stand against the advances we have made in both technique and technology! You must have faith that our machinists will prevail."},{"name":"STEPHANIVIEN","text":"And though I appreciate your eagerness to occupy a cell on my behalf, such a sacrifice will not halt Tedalgrinche's crusade against the manufactory."},{"name":"ROSTNSTHAL","text":"Aye... Ye might be right about that."},{"name":"JOYE","text":"He's right about more than just that─you've got to stop underestimatin' what we're capable of."},{"name":"ROSTNSTHAL","text":"Hah hah hah! I keep forgettin' what a stubborn lot I'm dealin' with─yer the ones what're challengin' the very stones what Ishgard was built on."},{"name":"ROSTNSTHAL","text":"Alright, I won't give meself up...on one condition."},{"name":"ROSTNSTHAL","text":"All talk o' contracts aside, ye let me 'elp in the fight against this Veri Selen nightmare."},{"name":"STEPHANIVIEN","text":"You have always sought to avoid such entanglements before... What has changed?"},{"name":"ROSTNSTHAL","text":"It's a matter o' penance. Back when I was still in charge o' the 'Cudas, I lied to me subordinates─instead o' servin' the thalassocracy, I 'ad them lads workin' to further me own agenda. It all came apart, though, when I sent a glut of 'em off to die in a battle they 'ad no business bein' in..."},{"name":"ROSTNSTHAL","text":"I 'ad me eyes on the Admiral's chair, see, but what kind o' Admiral would do that? It was reckless an' selfish, an' got a lot o' good people killed. After they stripped me o' me rank, I drowned meself in drink, an' took up the life o' the worst kind o' pirate."},{"name":"ROSTNSTHAL","text":"That soldier I tried to visit in Camp Overlook? 'E was one o' me lads what survived."},{"name":"ROSTNSTHAL","text":"I've been sendin' 'im every coin I can spare to pay back me bloody debt, but there ain't enough gelt in the world what could buy off me guilt."},{"name":"ROSTNSTHAL","text":"An' now, years later, I see a chance to undo the wrong I've done. A bunch o' me students plan to charge into a situation they got no business bein' in, an' I plan to see 'em come out of it alive!"},{"name":"STEPHANIVIEN","text":"Well, then! Consider yourself invited to the battle!"},{"name":"JOYE","text":"Come, lead us in a pre-battle drill, Rostnsthal!"},{"name":"STEPHANIVIEN","text":"Once more your skill at firearms has rescued the manufactory from peril! Let us head back there, shall we?"},{"name":"STEPHANIVIEN","text":"Ah, <span class=\"highlight\">Forename</span>, there you are. I have sent word of our decision to Tedalgrinche."},{"name":"STEPHANIVIEN","text":"Even with the instructor's added firepower, however, I fear this challenge will test us to our very limits."},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"},{"name":"STEPHANIVIEN","text":"Rostnsthal has vowed to stay with us─regardless of the term of his contract─until the sins of his past have been washed away in Veri Selen's blood. Let us then take advantage of every moment we have from now until the battle to hone our skills to a razor's edge!"},{"name":"SYTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":507,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":96}],"quests":[67246]},"next":[67248]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014830","obj":{"i":1014830,"n":"Rostnsthal","l":2301,"q":1}},{"type":"npc","id":"1014831","obj":{"i":1014831,"n":"Joye","l":2301,"q":1}},{"type":"quest","id":"67246","obj":{"i":67246,"n":"Taking the Fall","g":158,"l":"Ishgard","s":14,"f":1}},{"type":"quest","id":"67248","obj":{"i":67248,"n":"Rise of the Machinists","g":158,"l":"Ishgard","s":16,"f":1}}]}