{"quest":{"name":"A Joye-ful Reunion","location":"Ishgard","id":67243,"patch":3.0,"sort":12,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014805,1014809,1014810,1014811,1014816],"genre":158,"journal":["Stephanivien would have you join the House Dzemael operation.","Stephanivien has at last received the details of your joint operation with House Dzemael. House Haillenarte is to aid in the defense of Falcon's Nest by eliminating the Dravanian forces gathering upon the Black Iron Bridge. Head to the Coerthas western highlands and join Stephanivien in the beleaguered settlement.","You arrive in Falcon's Nest to find that none of your fellow machinists have responded to Stephanivien's call for arms, necessitating that the count sally forth with what few knights he could muster...and a reluctant Rostnsthal. While you discuss your limited options, however, Celestaux arrives with the news that Joye's father is being held prisoner in the Brume. Return to Ishgard, and speak with the manufactory machinist in Foundation.","The machinist in the Brume points out the door behind which Joye's father is supposedly being held. Approach the weak-kneed watch, and intimidate him with a Gauss Round.","With Stephanivien's timely assistance, you have little trouble in persuading the guard to free his prisoner. Now that her father is liberated, the manufactory chief believes he can convince Joye to return to the rank of the machinists. Hurry back to the Coerthas western highlands and join Rostnsthal in the battle on the Black Iron Bridge.","You replace an injured Rostnsthal on the front lines, and help House Haillenarte make short work of the marauding Dravanians. Speak with Stephanivien, and discuss Tedalgrinche's treachery.","Stephanivien praises you for your part in rescuing Joye's father and for your victory over the Dravanian forces. With Joye returned to both the machinists and the manor house, the manufactory chief is eager to raise a glass in celebration. Return to the Skysteel Manufactory and speak with Stephanivien.","Though Stephanivien is cheered to think that your exploits have further impressed the Holy See, he is also wary of Tedalgrinche's escalating villainy. Practice the new technique passed on to you from Rostnsthal, and remain vigilant for the treachery of House Dzemael.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 56."],"objectives":["Speak with Stephanivien in Falcon's Nest.","Speak with the manufactory machinist in the Brume.","Use Gauss Round on the weak-kneed watch.","Speak with Rostnsthal at the Black Iron Bridge.","Speak with Stephanivien.","Speak with Stephanivien at the Skysteel Manufactory.","Defeat the Dravanians!"],"dialogue":[{"name":"STEPHANIVIEN","text":"I hope your firearm is loaded and ready, <span class=\"highlight\">Forename</span>─we have received our deployment orders from House Dzemael."},{"name":"STEPHANIVIEN","text":"Several groups of Dravanians are converging on Falcon's Nest, and we have been tasked with eliminating the fiends gathered upon the Black Iron Bridge. Knowing Tedalgrinche─and I unfortunately do─I would not put it past him to lure more foes onto the narrow structure simply to overtax us."},{"name":"STEPHANIVIEN","text":"And we must needs overcome this assault without Joye's help...or Celestaux's, for that matter─he has yet to return since he stormed out the door."},{"name":"STEPHANIVIEN","text":"I will assemble our remaining machinists and lead them to Falcon's Nest. Pray join us there as soon as you may."},{"name":"STEPHANIVIEN","text":"I will assemble our remaining machinists and lead them to Falcon's Nest. Pray join us there as soon as you may."},{"name":"STEPHANIVIEN","text":"Ah, <span class=\"highlight\">Forename</span>... I fear Celestaux's departure has inspired his fellows to disregard my commands. You are the only machinist to answer my call to arms."},{"name":"BAURENDOUIN","text":"(-Count Baurendouin de Haillenarte-)And in response to this...insubordination, I have been forced to deploy what few knights we could spare─myself included."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)They even begged <span class=\"emphasis\">me</span> to come along. As I've said afore, fightin' bloody dragons ain't in me contract, so they'll be payin' me 'andsomely for the trouble."},{"name":"TEDALGRINCHE","text":"(-Tedalgrinche-)Is this House Haillenarte's entire company? You seem to be short a number of machinists."},{"name":"STEPHANIVIEN","text":"We are keeping our colleagues in reserve. For an operation such as this, we need field only <span class=\"highlight\">Forename</span>─the finest machinist in our ranks."},{"name":"TEDALGRINCHE","text":"(-Tedalgrinche-)Ahahaha, your confidence is truly inspiring. Thankfully, however, there are few enemies threatening the Black Iron Bridge. Even with your sparse numbers, I daresay you shan't be sorely pressed."},{"name":"STEPHANIVIEN","text":"Celestaux!? H-Have you come to fight with us?"},{"name":"CELESTAUX","text":"That all depends on you, me lord. We've found Joye's father─he's bein' held prisoner in the Brume."},{"name":"BAURENDOUIN","text":"(-Count Baurendouin de Haillenarte-)Held prisoner!? ...You suspect this is some manner of coercion?"},{"name":"CELESTAUX","text":"Aye, we reckon they've been targetin' Joye for a while. Her dad vanished right after he landed a job here in Falcon's Nest...and then Joye suddenly up and wed the brother of a carpenter workin' on the fortifications."},{"name":"CELESTAUX","text":"House Dzemael is behind this, or I'm a chocobo's third cousin."},{"name":"STEPHANIVIEN","text":"Tedalgrinche, you cad!"},{"name":"CELESTAUX","text":"It's not too late! If we break her dad out, then Joye can abandon her farce of a marriage and come back to the manufactory where she belongs!"},{"name":"STEPHANIVIEN","text":"But, the bridge... The Dravanians..."},{"name":"BAURENDOUIN","text":"(-Count Baurendouin de Haillenarte-)Go. Joye is a machinist─as manufactory chief, 'tis your duty to attend to your employees. My knights and I shall march for House Haillenarte."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)Bah, ye needn't worry─they'll 'ave yers truly fightin' right beside 'em. Go 'elp the boss, <span class=\"highlight\">Forename</span>."},{"name":"CELESTAUX","text":"If <span class=\"highlight\">Forename</span> goes, then I'll stay behind. We promised machinists to the Dzemaels, and we don't want to break our word now, do we? Just one should be enough."},{"name":"STEPHANIVIEN","text":"Thank you. Thank you all. We shall conclude this matter with the greatest of haste, and return as swiftly as we may."},{"name":"CELESTAUX","text":"You'll find one of our manufactory machinists in the Brume. He'll show you where Joye's dad is bein' held."},{"name":"KIKOUSHI01707","text":"Celestaux said you'd come. The chief'll draw too much attention, so we asked him to wait at the workshop until we're ready to act."},{"name":"KIKOUSHI01707","text":"Joye's dad is right behind that door over there."},{"name":"KIKOUSHI01707","text":"We just need to convince the bloke standin' guard to open it. He don't exactly look the stoic type, though, so a Gauss Round ought to have him pissin' his trousers."},{"name":"KIKOUSHI01707","text":"Graze that bloke with a bullet or two, and you'll soon have him cryin' for his mum."},{"name":"STEPHANIVIEN","text":"My poor Joye..."},{"name":"FRAIDEOUX","text":"St-Step back or I'll b-bash your brains in!"},{"name":"FRAIDEOUX","text":"Ow! What in the─ Y-You shot me!"},{"name":"FRAIDEOUX","text":"P-Please! I ain't done nothin' wrong! Some fancy fop dropped a pouch in me lap and told me to guard the door. I swear, that's all I know!"},{"name":"STEPHANIVIEN","text":"And how much did he pay you?"},{"name":"FRAIDEOUX","text":"Not enough to die over, me lord! P-Please don't shoot me again!"},{"name":"STEPHANIVIEN","text":"Ah, 'twas not my intention to threaten you. We merely wish you to release the man behind yonder door."},{"name":"STEPHANIVIEN","text":"And should you fear the vengeance of your employer, you are welcome to take shelter at the manufactory. In fact, why not become a machinist? Then you needn't take another such unsavory job again."},{"name":"FRAIDEOUX","text":"...Y-You're offerin' me work, me lord? Aye, I'll let the bloke out for that. Hells, I'll carry him across the city and back for a steady wage."},{"name":"JOYEFATHER","text":"Lord Stephanivien... Me humble thanks."},{"name":"STEPHANIVIEN","text":"You've been locked away for quite some time, my poor man. Do you know who did this to you, or why?"},{"name":"JOYEFATHER","text":"I've not the faintest idea, me lord. I was hired by House Dzemael to work on their walls, and when I went to join the crew headin' out for Falcon's Nest, some bastard─beggin' yer pardon, me lord─slipped a sack over me head and carted me away."},{"name":"JOYEFATHER","text":"I'm just a broken old hunter. I ain't got money for ransom, and nor does me family. Got to thinkin' that maybe they nabbed the wrong bloke..."},{"name":"STEPHANIVIEN","text":"Then, you weren't aware that Joye was wed, or that she resigned from her position at both the manor and the manufactory?"},{"name":"JOYEFATHER","text":"She got married and quit!? Why'd she do a foolish thing like that!? I've never seen her happier than when she's slingin' one of them flintlocks."},{"name":"JOYEFATHER","text":"...Ah, so that's why they took me─they're blackmailin' me little Joye. Ain't no way she'd just up and marry some bloke what wouldn't let her stay at the workshop."},{"name":"STEPHANIVIEN","text":"Then she was a machinist by her own choice... I am full glad to hear that."},{"name":"STEPHANIVIEN","text":"'Tis time we liberated your daughter from her false union. Once she sees you are safe, I do not envy the man who pretends at the role of her husband!"},{"name":"KIKOUSHI01707","text":"I knew you'd set things right, me lord! You take care of Joye, and I'll tell the rest of the machinists that they can come back to work!"},{"name":"KIKOUSHI01707","text":"Alright, then, lad? You come with me."},{"name":"STEPHANIVIEN","text":"I will speak with Joye and unravel this nonsense. You, however, must make haste to the Black Iron Bridge, and lend your barrel to the battle!"},{"name":"ROSTNSTHAL","text":"About time ye got back. Ye found Joye's dad, then?"},{"name":"ROSTNSTHAL","text":"Good. Now it's up to the boss to bring 'er back."},{"name":"BAURENDOUIN","text":"The fighting has been fierce. Master Rostnsthal was injured when he gallantly intercepted a swipe meant to remove my head."},{"name":"ROSTNSTHAL","text":"Bah, that's a noble way o' sayin' I tripped over its bloody tail an' stumbled into the blow. Anyroad, ye'll have to take me place on the front lines, an' do it soon─afore these dainty knights get their arses 'anded to 'em."},{"name":"QIB","text":"Are we glad to see you!<br>Let's start from this end and work towards the other!"},{"name":"QIB","text":"Eyes front!<br>Take down that big bastard!"},{"name":"QIB","text":"Keep firin'! 'E's on 'is last legs!"},{"name":"QIB","text":"Focus! Stay on the big one!"},{"name":"QIB","text":"Mop up what's left! Yer almost done!"},{"name":"ROSTNSTHAL","text":"Ye was missin' a few mates, but ye still took care o' business. Not that I'd expect aught less from one o' me star students."},{"name":"BAURENDOUIN","text":"A star indeed. Your arrival was as a gift from the heavens."},{"name":"JOYE","text":"(-???-)Load! Aim! Fire!"},{"name":"JOYE","text":"(-???-)How'd you like that, you great scaly bastard!?"},{"name":"JOYE","text":"I'm afraid I've caused a great deal of trouble for you all. Thank you for rescuin' me dad..."},{"name":"BAURENDOUIN","text":"'Twas no trouble at all for such a fine employee. As you are now wed, I understand that you may not wish to resume your duties at the manor...but have you considered my son's offer that you and your husband come to work at the manufactory?"},{"name":"JOYE","text":"Me “husband” and me have agreed to part ways. If it please me lord, I'd like to start workin' again at the workshop <span class=\"emphasis\">and</span> the manor, both!"},{"name":"STEPHANIVIEN","text":"Joye, my dear! You are most welcome, of course! Neither the manor nor the manufactory have been the same without you."},{"name":"JOYE","text":"M-Me lord, me lordship, I don't know how to..."},{"name":"JOYE","text":"Th-That is to say..."},{"name":"JOYE","text":"I'm glad to be back!"},{"name":"TEDALGRINCHE","text":"Ah, I see that even for the much-diminished House Haillenarte, a handful of dragons poses no true threat. I shall have to find a more significant challenge for your next outing."},{"name":"TEDALGRINCHE","text":"'Twould seem that you still do not understand that the knight is the master of the battlefield."},{"name":"STEPHANIVIEN","text":"That was far more than a “handful” of dragons, Tedalgrinche. Do you think us blind? We know who is working against the manufactory; we know whose underhanded villainy forced Joye into wedlock..."},{"name":"TEDALGRINCHE","text":"Whatever are you implying? You speak as if I recall the names of your lowborn servants, or hold even the slightest interest in their common unions. Now, if you'll excuse me, my lords..."},{"name":"STEPHANIVIEN","text":"Pray make haste for the Black Iron Bridge."},{"name":"STEPHANIVIEN","text":"Damn that man and his arrogance. My prospectometer and I shall remain vigilant, that we may defeat Tedalgrinche's trickery at every turn."},{"name":"STEPHANIVIEN","text":"The accolades for this triumph, however, must go to you, <span class=\"highlight\">Forename</span>. The bridge is clear, and Joye is returned to us."},{"name":"JOYE","text":"(-Joye-)I was afraid I'd seen the last of the manufactory. Thank you again for the warm welcome home."},{"name":"JOYE","text":"(-Joye-)I've never felt as whole as I did after I joined the ranks of the machinists."},{"name":"JOYE","text":"(-Joye-)When I had to tell his lordship I was quittin', it felt like I was leavin' a part of me soul behind..."},{"name":"JOYE","text":"(-Joye-)That's when I realized: to me, bein' a machinist is more than just firin' a weapon─it's a way of connectin' to another side of meself."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)Well, now that yer “connected” again, we can get back to workin' on yer shootin'─and yer swearin'."},{"name":"STEPHANIVIEN","text":"And there is also the small matter of our delayed tourney celebration."},{"name":"JOYE","text":"(-Joye-)...If it please me lordship, I'd like to do some trainin' instead. I feel the need to shoot off ten score bullets or so..."},{"name":"STEPHANIVIEN","text":"Ah, of course, we all celebrate in our own way. Fire at will, my dear! I, for one, am eager for a stiff drink back at the manufactory!"},{"name":"STEPHANIVIEN","text":"Once more you have proven your worth to the machinists, and to House Haillenarte. As for Lord Tedalgrinche... I had my suspicions, but it now seems abundantly clear that he has been behind every mishap and misfortune to befall the manufactory."},{"name":"STEPHANIVIEN","text":"Despite his knavery, however, our successes in the field will not have escaped the notice of the Holy See."},{"name":"STEPHANIVIEN","text":"And as our reputation grows, so too shall Tedalgrinche's ire. We had best be on our guard..."},{"name":"STEPHANIVIEN","text":"...Oh, did you hear? During his skirmish with the dragons, Rostnsthal developed a new technique. He was adamant that I pass on the particulars to you."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":2796,"action":7411,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":96}],"quests":[67242]},"next":[67244]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014805","obj":{"i":1014805,"n":"Stephanivien","l":2200,"q":1}},{"type":"npc","id":"1014809","obj":{"i":1014809,"n":"Manufactory Machinist","l":2300,"q":1}},{"type":"npc","id":"1014810","obj":{"i":1014810,"n":"Weak-kneed Watch","l":2300,"q":1}},{"type":"npc","id":"1014811","obj":{"i":1014811,"n":"Rostnsthal","l":2200,"q":1}},{"type":"npc","id":"1014816","obj":{"i":1014816,"n":"Stephanivien","l":2200,"q":1}},{"type":"action","id":"7411","obj":{"i":7411,"n":"Heated Split Shot","c":3031,"j":31,"t":3,"l":54}},{"type":"quest","id":"67242","obj":{"i":67242,"n":"Pushing the Brume","g":158,"l":"Ishgard","s":11,"f":1}},{"type":"quest","id":"67244","obj":{"i":67244,"n":"Wheels of Justice","g":158,"l":"Ishgard","s":13,"f":1}}]}