{"quest":{"name":"Rise of the Machinists","location":"Ishgard","id":67248,"patch":3.0,"sort":16,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014834,1014835,1014836,1014837,1014838,1014839,1014840,1014841],"genre":158,"journal":["Stephanivien has received word on the upcoming trial.","With the day of the trial near at hand, Stephanivien would host a feast in honor of his machinists' accomplishments. As has become customary, however, the principal players are nowhere to be found. Head out into Foundation, and locate Rostnsthal, Joye, Celestaux, and Count Baurendouin de Haillenarte.","You have found and spoken with Stephanivien's absent guests. The count, though he wishes his son well, has declined to attend. Return to the Skysteel Manufactory, and pass on his message to Stephanivien.","Stephanivien thanks you for summoning everyone to the feast, and speaks highly of your positive influence on the manufactory. It is time now, he vows, for the machinists to make their mark on history. Prepare yourself for a demanding battle, and join Stephanivien at Twinpools in the Coerthas western highlands.","In an unexpected turn of events, the machinists find themselves defending Tedalgrinche as they fight to defeat Veri Selen and its host of lesser minions. Upon the great beast's demise, the grateful noble at last recognizes machinistry's worth, and promises to work alongside the manufactory chief in building a place for the machinists in Ishgard. Return to the Skysteel Manufactory, and share this triumph with Stephanivien.","Stephanivien reflects on the events of the battle, and rejoices that the age of machinistry has at last arrived in Ishgard. With Rostnsthal's departure, however, he recognizes that there remain none in the workshop who can match your skill with a firearm. Take the lessons you have learned in the manufactory, and do your part in spreading the machinist trade to the farthest reaches of Eorzea!<br><br>※The next machinist quest will be available from Stephanivien once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Rostnsthal.","Speak with Joye.","Speak with Celestaux.","Speak with Count Baurendouin de Haillenarte.","Speak with Stephanivien.","Speak with Stephanivien at Twinpools.","Speak with Stephanivien at the Skysteel Manufactory.","Defeat the dragons!","Protect Tedalgrinche and defeat the dragons!"],"dialogue":[{"name":"STEPHANIVIEN","text":"A day has been chosen for our trial against Veri Selen. More than any that have come before, this battle shall be pivotal in deciding the future of the manufactory and machinistry both. Thus, ere we march forth to meet our fate, I would hold a celebration in honor of all that we have accomplished."},{"name":"STEPHANIVIEN","text":"As has become customary, however, the principal players are nowhere to be found. Pray head out into the city, and seek out Joye, Rostnsthal, Celestaux...and my father."},{"name":"STEPHANIVIEN","text":"Pray head out into the city, and seek out Joye, Rostnsthal, Celestaux...and my father."},{"name":"ROSTNSTHAL","text":"What? Another bleedin' celebration? Well, I guess we never did get to 'ave that first one."},{"name":"ROSTNSTHAL","text":"Ah, <span class=\"highlight\">Forename</span>─I knew the first time I met ye ye'd be a demon with a carbine. An' bugger me if I weren't right."},{"name":"ROSTNSTHAL","text":"Now look at us: ready to stand side by side against one o' the biggest bloody dragons to ever raid a supply train. I'll get everyone through this, though, don't ye worry..."},{"name":"JOYE","text":"Aye, I'll head there right now. But afore we do, <span class=\"highlight\">Forename</span>..."},{"name":"JOYE","text":"I wanted to thank you again for helpin' me find me way. I just got meself back to where I belong, and I ain't about to give up the workshop a second time!"},{"name":"CELESTAUX","text":"A feast, is it? I can already feel me belly rumblin'..."},{"name":"CELESTAUX","text":"As always, the chief works to make the manufactory a place where commoners like me feel welcome. He's done his best for us, and I mean to do me best for him...even if it means fightin' that monster of a dragon."},{"name":"BAURENDOUIN","text":"I am <span class=\"emphasis\">invited</span> to the manufactory? Well, well, how times have changed. Though I appreciate the gesture, I do not have a place at that table. I vowed to leave Skysteel matters to Stephanivien alone, and so I shall."},{"name":"BAURENDOUIN","text":"Tell my son that I shall pray for victory, and the prosperous future that will grow from his success."},{"name":"ROSTNSTHAL","text":"Been a good while since I shared a drink with mates. Reminds me of old times...an' mistakes I don't mean to repeat."},{"name":"JOYE","text":"<span class=\"highlight\">Forename</span>, you should have a nibble─it's all so delicious, I might gobble the lot meself! His lordship says this feast is courtesy of the count..."},{"name":"CELESTAUX","text":"Ah, I ain't eaten like this since...well, ever, to be honest. If this's to be me last meal, then I'll die a happy man..."},{"name":"STEPHANIVIEN","text":"Thank you for summoning everyone to the feast. And thank you for Father's message."},{"name":"STEPHANIVIEN","text":"Eat, drink, and be merry, my friends! Soon, we shall introduce Veri Selen to the rage of the machinists...for the manufactory, and for Ishgard!"},{"name":"ROSTNSTHAL","text":"(-Machinists-)For Ishgard!"},{"name":"STEPHANIVIEN","text":"See how their eyes shine with determination? You were the perfect choice to act as my ambassador."},{"name":"STEPHANIVIEN","text":"Ever has your presence been a boon to the manufactory. I often wonder what would have become of us had you not chosen to walk the path of the machinist..."},{"name":"STEPHANIVIEN","text":"Though our next battle together will indeed be perilous, it shall also serve to demonstrate the pinnacle of our achievements. When Veri Selen lies defeated in the snow, we will have accomplished a deed that Tedalgrinche─and the Holy See─believe nigh impossible.<br>When you are ready to make history, join us at the site of the trial in the Coerthas western highlands."},{"name":"STEPHANIVIEN","text":"When you are ready to make history, join us at the site of the trial in the Coerthas western highlands."},{"name":"STEPHANIVIEN","text":"Lord Tedalgrinche, my machinists are assembled. We now but await the arrival of the dreaded Veri Selen."},{"name":"TEDALGRINCHE","text":"Excellent! I am accompanied by a priest of the Holy See, who shall ensure that the trial proceeds in accordance with Ishgardian law. A wagon has also been provided to tempt the talons of your quarry."},{"name":"TEDALGRINCHE","text":"The Observatorium has been tracking the creature's movements... According to their calculations, Veri Selen and its entourage should fly over this pass within the hour."},{"name":"OBSERVER01712","text":"(-Ishgardian Priest-)Should the machinists of the Skysteel Manufactory satisfy the conditions of this trial by combat─either through victory or valorous death─then shall your innocence be proven and your honor redeemed. Should you choose to flee, however... I trust I need not elaborate further?"},{"name":"OBSERVER01712","text":"(-Ishgardian Priest-)We shall oversee proceedings from on high, that I might judge thine actions evenly and with uninterrupted view. May justice be served."},{"name":"TEDALGRINCHE","text":"Ahahaha! Your Reverence, pray do not avert your eyes should the scene become one of bloody carnage. We would not wish to deny these fine combatants a fair trial."},{"name":"STEPHANIVIEN","text":"My strategy for the battle is thus: hit these beasts with everything we have! Deploy every turret and shoot every bullet! We shall bury Veri Selen under a hail of metal and fire!"},{"name":"QIB","text":"No... This was me chance to make it right..."},{"name":"QIB","text":"Fight on, my friends..."},{"name":"QIB","text":"Load! Aim...? Why's it gone all dark...?"},{"name":"QIB","text":"I'm done for..."},{"name":"QIB","text":"I knew I could not depend on you machinists..."},{"name":"QIB","text":"For the manufactory, and for Ishgard!"},{"name":"QIB","text":"I wonder who shall scream the loudest..."},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, pray aid Celestaux!<br>His position is overrun!"},{"name":"QIB","text":"There's just too many of 'em!<br>We're gonna need help over here!"},{"name":"QIB","text":"Veri Selen commands an impressive number of minions..."},{"name":"QIB","text":"Celestaux! See to Tedalgrinche!<br><span class=\"highlight\">Forename</span>! We shall engage Veri Selen!"},{"name":"QIB","text":"Aye, I'll see the <span class=\"emphasis\">noble</span> lord ain't killed!"},{"name":"QIB","text":"'Tis not quite the scene I envisioned..."},{"name":"QIB","text":"And still they come...<br>Quickly, <span class=\"highlight\">Forename</span>! To Tedalgrinche's side!"},{"name":"QIB","text":"Dammit! We can't hold 'em all!"},{"name":"QIB","text":"Hmph. Will you prove me right, machinists?"},{"name":"QIB","text":"Ware, <span class=\"highlight\">Forename</span>!<br>Our foe has become desperate!"},{"name":"ROSTNSTHAL","text":"Bloody 'ells, it's massive... An' that's the thing we gotta kill?"},{"name":"STEPHANIVIEN","text":"As manufactory chief, I have but one order for you all: survive the battle!"},{"name":"STEPHANIVIEN","text":"Machinists! Protect the fallen!"},{"name":"TEDALGRINCHE","text":"...Why do this? Why protect me? Should you but allow the dragons to do their bloody work, you will be free to pursue your agenda..."},{"name":"STEPHANIVIEN","text":"Aye, and few could argue that you had earned it. After the grief you have caused, I should take what is left of your corpse and string it up for target practice!"},{"name":"STEPHANIVIEN","text":"But if my machinists are truly to be the spear and shield of Ishgard, we must defend all her citizens with equal zeal!"},{"name":"TEDALGRINCHE","text":"I fear that excessive association with commoners has softened your brain... The oath you have sworn, however, is indeed a knightly one."},{"name":"JOYE","text":"If you're done yappin', Lord Tedalgrinche, we're a bit bloody busy here! Wag that tongue again and it'll be the first thing I put a bullet through!"},{"name":"STEPHANIVIEN","text":"You'd best heed her warning, old fellow. Joye is not one to give voice to idle threats."},{"name":"TEDALGRINCHE","text":"Until this day, I have but observed your battles from afar. What a perfect opportunity for me to evaluate your skills from a more...intimate perspective."},{"name":"STEPHANIVIEN","text":"By the Fury, is he still speaking!? Leave him, Joye─we have more pressing matters to attend to! Let us shoot a path through the foes arrayed before us!"},{"name":"STEPHANIVIEN","text":"We've done it! The damnable beast is dead!"},{"name":"TEDALGRINCHE","text":"...I thank you for saving my life. The accusations against you shall, of course, be withdrawn."},{"name":"TEDALGRINCHE","text":"As a further token of my gratitude, I would offer you a boon. Speak your wish, and I shall do all within my power to grant it."},{"name":"ROSTNSTHAL","text":"A “boon”!? Ye think one little favor'll wipe the ledger clean o' yer steamin' shite!?"},{"name":"STEPHANIVIEN","text":"Fortunately, my heart has but one desire... I will have your oath that henceforth you shall no longer oppose the rise of the machinists, and never again seek to interfere in the operation of the Skysteel Manufactory."},{"name":"TEDALGRINCHE","text":"...Is that all? No chests of coin? No promises of power? The workings of your mind are truly an enigma to me."},{"name":"TEDALGRINCHE","text":"But you shall have my word on this, nevertheless. Indeed, we shall discover the best means by which your fine machinists might contribute to Ishgard's defenses."},{"name":"STEPHANIVIEN","text":"'Tis only from behind a sturdy front line that a machinist's full potential is realized. Together with your knights, however, we will change the face of war."},{"name":"TEDALGRINCHE","text":"Ahahaha! Of course! You cannot yet do without the masters of the battlefield! May we strike fear into the hearts of our enemies, and ensure the continued prosperity of the Holy See! Fare you well, Lord Stephanivien."},{"name":"ROSTNSTHAL","text":"...Well, that's that, then. Thanks for lettin' me join ye on this one, boss. I think I'm ready to move on now..."},{"name":"ROSTNSTHAL","text":"Joye. Yer aim's as sharp as yer 'arpy tongue. Good work, lass. I nominate ye to take over as master o' marksmanship."},{"name":"ROSTNSTHAL","text":"<span class=\"highlight\">Forename</span>. Yer too bleedin' quiet, but yer weapon speaks loud enough, I s'pose. Keep firin' like ye do, an' I reckon new students'll flock to the workshop to follow in yer footsteps."},{"name":"JOYE","text":"Are you truly leavin' us...?"},{"name":"ROSTNSTHAL","text":"I've never been the kind o' bloke as sticks in one place for too long. Ye've treated me well at the workshop─better'n I deserve, I reckon─but it's time I weighed anchor. I'll be seein' ye, then."},{"name":"STEPHANIVIEN","text":"Should your travels bring you back to Ishgard, know you always have a place at the manufactory, my friend! Shall we be on our way, as well?"},{"name":"STEPHANIVIEN","text":"What an extraordinary turn of events. With these troubles behind us, however, I feel the age of machinistry has finally arrived."},{"name":"STEPHANIVIEN","text":"And you, <span class=\"highlight\">Forename</span>, have all but outgrown the manufactory─with Rostnsthal's departure, there are none who might compete with your skill at firearms. Pray take the lessons you have learned, and make known the machinist's trade in every corner of Eorzea."},{"name":"STEPHANIVIEN","text":"You are, of course, welcome to return to us whenever you desire. We shall be here, ever serving Ishgard as her deadliest spear and sturdiest shield."},{"name":"STEPHANIVIEN","text":"Ah, before I forget, Rostnsthal asked that I encourage you to push the limits of your marksmanship. I believe his exact words were, “so that ye can blast through any pile of shite what might stand in yer way!” I'm getting better at the accent, don't you think?"},{"name":"SYSTEM","text":"This concludes the machinist quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next machinist quest will be available from Stephanivien."},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"}],"reward":{"gil":1656,"action":7412,"items":[{"id":20666}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":96}],"quests":[67247]},"next":[68441]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014834","obj":{"i":1014834,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014835","obj":{"i":1014835,"n":"Joye","l":2300,"q":1}},{"type":"npc","id":"1014836","obj":{"i":1014836,"n":"Celestaux","l":2300,"q":1}},{"type":"npc","id":"1014837","obj":{"i":1014837,"n":"Count Baurendouin De Haillenarte","l":2300,"q":1}},{"type":"npc","id":"1014838","obj":{"i":1014838,"n":"Joye","l":2300,"q":1}},{"type":"npc","id":"1014839","obj":{"i":1014839,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014840","obj":{"i":1014840,"n":"Celestaux","l":2300,"q":1}},{"type":"npc","id":"1014841","obj":{"i":1014841,"n":"Stephanivien","l":2200,"q":1}},{"type":"action","id":"7412","obj":{"i":7412,"n":"Heated Slug Shot","c":3032,"j":31,"t":3,"l":60}},{"type":"item","id":"20666","obj":{"i":20666,"n":"Machinist's Armor Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67247","obj":{"i":67247,"n":"Rusted Steel","g":158,"l":"Ishgard","s":15,"f":1}},{"type":"quest","id":"68441","obj":{"i":68441,"n":"The Machinists' Choice","g":158,"l":"Ishgard","s":601,"f":1}}]}