{"quest":{"name":"The Power of a Tourney","location":"Ishgard","id":67240,"patch":3.0,"sort":9,"icon":100444,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014784,1014788],"genre":158,"journal":["Stephanivien is ready to attend the tourney.","Stephanivien has done all that he can to counterbalance the manufactory's misfortunes, and urges you to join your companions at the tourney arena. Head to Camp Dragonhead in the Coerthas central highlands, and speak with Stephanivien.","The chief machinist suggests that you join him in inspecting the arena and revising your strategy. Speak with Stephanivien to begin final preparations for the tourney.","You and the manufactory's machinists join the knights of House Fortemps in a mock battle against the combined forces of House Dzemael and House Durendaire. After a tense and hectic skirmish, your side succeeds in destroying the enemy standard. Celebrate the tourney victory with Stephanivien.","Though your triumph has done little to temper Lord Tedalgrinche's contempt for the machinists, it seems that Count Baurendouin de Haillenarte's doubts have been entirely put to rest. Return to the Skysteel Manufactory and speak with Stephanivien.","Now the master of the Skysteel Manufactory in both name and deed, Stephanivien has commemorated the occasion by presenting you with yet another upgrade to your aetherotransformer. Add this newest weapon to your arsenal, and continue to challenge the stagnant traditions of Ishgard's old guard."],"objectives":["Speak with Stephanivien at Camp Dragonhead.","Speak with Stephanivien.","Speak with Stephanivien at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"We have done all that can be done. 'Tis time we join our companions, and survey the field on which the tourney is to take place."},{"name":"STEPHANIVIEN","text":"You are familiar with Camp Dragonhead, I trust? Its grounds should make for an interesting arena."},{"name":"STEPHANIVIEN","text":"Pray make your way to Camp Dragonhead. The tourney awaits!"},{"name":"STEPHANIVIEN","text":"Good, good, you've come. The other houses have yet to field their forces─meaning we've time to inspect the arena and formulate a winning strategy."},{"name":"BAURENDOUIN","text":"(-Count Baurendouin de Haillenarte-)Are you certain of your preparations, my son? These tales I hear of hired thugs terrorizing machinists and destroying equipment do not fill me with confidence."},{"name":"BAURENDOUIN","text":"(-Count Baurendouin de Haillenarte-)Pray remember that the collected gaze of Ishgard shall be focused on this contest. A poor showing will cost us our funding from the Holy See, and cast an uncertain shadow over the future of the manufactory."},{"name":"STEPHANIVIEN","text":"I have never been more ready, Father. Now, relinquish your doubts, find yourself a nice vantage point, and enjoy the spectacle!"},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)I'm off to find a perch meself, but 'ere's one piece o' advice afore I go: make the most o' the terrain."},{"name":"ROSTNSTHAL","text":"(-Rostnsthal-)There's a few choice spots where I'd lay an ambush...or expect me enemies to lay one for me. Just be sure ye've given the place a good once–over, eh?"},{"name":"STEPHANIVIEN","text":"You heard the instructor! Give the word, and we shall endeavor to learn the lay of the land!"},{"name":"STEPHANIVIEN","text":"Let's review our strategy, shall we? ...Unless you would rather simply begin the tourney, in which case you may speak with our machinist messenger."},{"name":"QIB","text":"Inspect the black standard."},{"name":"QIB","text":"Inspect the crimson standard."},{"name":"QIB","text":"Inspect the ambush site."},{"name":"QIB","text":"Inspect the signal mortar."},{"name":"QIB","text":"Speak with Stephanivien."},{"name":"QIB","text":"Topple the crimson standard!"},{"name":"QIB","text":"Black standard"},{"name":"QIB","text":"Crimson standard"},{"name":"QIB","text":"Ours will be a combined force from House Haillenarte and House Fortemps, while our opponents will be of House Dzemael and House Durendaire."},{"name":"QIB","text":"The black standard represents our encampment.<br>Pray inspect the standard and the surrounding area."},{"name":"QIB","text":"If we allow the standard to be destroyed, we are defeated and the tourney is lost."},{"name":"QIB","text":"The standard also releases waves of curative magicks, so return here if you are in need of healing."},{"name":"QIB","text":"Let us move on to the enemy encampment.<br>Pray inspect the crimson standard, and survey the surrounding area."},{"name":"QIB","text":"Should we succeed in toppling the crimson standard, then victory is ours."},{"name":"QIB","text":"The enemy standard will heal nearby allies.<br>Best to avoid lengthy engagements in its proximity."},{"name":"QIB","text":"Let us now discuss our individual roles."},{"name":"QIB","text":"Joye will lead a squad of Haillenarte combatants in an offensive push."},{"name":"QIB","text":"The remaining machinists and I will join the Fortemps in the defense of our encampment."},{"name":"QIB","text":"You, <span class=\"highlight\">Forename</span>, shall be our flying company, and strike where needed."},{"name":"QIB","text":"Celestaux, you shall be our ambusher.<br>Let us survey your place of concealment."},{"name":"QIB","text":"Pray inspect the ambush site."},{"name":"QIB","text":"Celestaux will emerge and assault the enemy standard on <span class=\"highlight\">Forename</span>'s signal."},{"name":"QIB","text":"The Durendaire captain is an aggressive sort. If our defenses appear weak, he will commit his forces to an attack."},{"name":"QIB","text":"And that will leave their encampment vulnerable to ambush."},{"name":"QIB","text":"We have placed a signal mortar near the aetheryte."},{"name":"QIB","text":"Come with me, and you can see it for yourself."},{"name":"QIB","text":"The mortar should be safe here from enemy detection, and the spot also affords you a fine view of both camps."},{"name":"QIB","text":"When you judge it time to press the attack, simply operate the mortar to send up a flare."},{"name":"QIB","text":"Let us return now to our encampment.<br>I'll stall the officiant until you give the word."},{"name":"STEPHANIVIEN","text":"Hark, 'tis Tedalgrinche and his knights..."},{"name":"TEDALGRINCHE","text":"Ah, the manufactory workers in all their...glory. I imagine there are many who are curious─even eager─to witness you fight this day."},{"name":"TEDALGRINCHE","text":"Unfortunately for the spectators, however, House Dzemael will end this mockery of a contest all too swiftly."},{"name":"STEPHANIVIEN","text":"Bluster all you will. We shall let the tattered remains of your standard speak for us."},{"name":"TEDALGRINCHE","text":"Ahahaha, such conviction from the king of the commoners! Come, then─all the players are present. Let the tourney begin!"},{"name":"QIB","text":"To victory, my friends!"},{"name":"QIB","text":"Firin' at will!"},{"name":"QIB","text":"Destroy these machinist upstarts!"},{"name":"QIB","text":"How dull. This will hardly be a challenge at all."},{"name":"QIB","text":"Hm. Our foe has brought along a cadre of healers."},{"name":"QIB","text":"'Tis time to make our advance!"},{"name":"QIB","text":"Soldiers! To me! Full assault!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, target the enemy healers!<br>We cannot win like this!"},{"name":"QIB","text":"They'll never know what hit 'em!"},{"name":"QIB","text":"The Durendaire captain is still here...<br>The enemy'll slaughter me!"},{"name":"QIB","text":"Their standard is ripe for the pluckin'!<br>Nicely done, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Guess I needed...more practice..."},{"name":"QIB","text":"Me trigger finger... I can't seem to..."},{"name":"QIB","text":"Fight on, machinists! Fight on..."},{"name":"QIB","text":"A flanking maneuver, is it? Pathetic."},{"name":"TEDALGRINCHE","text":"Congratulations, machinists: you have proven yourselves not entirely without merit. House Dzemael will gladly welcome your inclusion in House Haillenarte's next company of reinforcements."},{"name":"TEDALGRINCHE","text":"Aye, your novel toys confounded my knights and won you this game of flags. I would see, however, how you fare against adversaries who seek not to break your standard...but to spill your life's blood."},{"name":"TEDALGRINCHE","text":"May the day soon come when we fight side by side."},{"name":"TEDALGRINCHE","text":"Mayhap then you shall understand why the knight is the master of the battlefield."},{"name":"TEDALGRINCHE","text":"Hm hm hm..."},{"name":"BAURENDOUIN","text":"Well done, my son! You have triumphed against all that would see you fail."},{"name":"STEPHANIVIEN","text":"But of course, Father. There is no difficulty that machinistry cannot overcome!"},{"name":"BAURENDOUIN","text":"A tourney victory... How many years has it been? At last, do we begin to reclaim the influence we have lost."},{"name":"STEPHANIVIEN","text":"And there shall be more to come...as long as you are true to your word. That means no more bemoaning my knightly skills; no more disruptive visits to the workshop."},{"name":"BAURENDOUIN","text":"Stephanivien. I hereby relinquish to you full authority of the manufactory. May your machinists be the spears that pierce our foes, and the shields that defend our walls."},{"name":"BAURENDOUIN","text":"Do as you will, my son. For the glory of Ishgard and her people."},{"name":"STEPHANIVIEN","text":"The age of the machinist has begun, my friends! Follow me, and together we shall ring the rusted helmets of the old guard!"},{"name":"STEPHANIVIEN","text":"'Twas a hard-won battle, <span class=\"highlight\">Forename</span>, but your keen grasp of tactics carried the day! And that is to say naught of your ever-growing skill with a firearm."},{"name":"STEPHANIVIEN","text":"With this victory I am become manufactory chief in both name and deed, and I intend to make the most of my newfound freedom!"},{"name":"STEPHANIVIEN","text":"Indeed, my first act upon returning to the workshop was to improve upon the aetherotransformer. This latest model is yours, with my thanks."},{"name":"STEPHANIVIEN","text":"The tourney exposed certain inadequacies in the design for which I have endeavored to compensate. Use it well, <span class=\"highlight\">Forename</span>!"}],"reward":{"action":2890,"items":[{"id":20653}],"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":96}],"quests":[67239]},"next":[67241]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014784","obj":{"i":1014784,"n":"Stephanivien","l":63,"q":1}},{"type":"npc","id":"1014788","obj":{"i":1014788,"n":"Stephanivien","l":63,"q":1}},{"type":"action","id":"2890","obj":{"i":2890,"n":"Ricochet","c":3017,"j":31,"t":4,"l":50}},{"type":"item","id":"20653","obj":{"i":20653,"n":"Junior Machinist's Armor Coffer (IL 90)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67239","obj":{"i":67239,"n":"Rage against the Machinists","g":158,"l":"Ishgard","s":8,"f":1}},{"type":"quest","id":"67241","obj":{"i":67241,"n":"A Joye-less Celebration","g":158,"l":"Ishgard","s":10,"f":1}}]}