{"quest":{"name":"Pushing the Brume","location":"Ishgard","id":67242,"patch":3.0,"sort":11,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014799,1014800,1014801,1014802,1014803],"genre":158,"journal":["Stephanivien would ask for your assistance in his latest project.","With Joye's departure from the manufactory, Stephanivien seeks another edge to aid the machinists in the upcoming allied operation with House Dzemael. The chief machinist plans to create yet another new device, but explains that the process will be much expedited with the acquisition of existing magitek components. Infiltrate Castrum Centri in Mor Dhona, and salvage warmachina parts from the crates found around the imperial base.","You have salvaged a number of warmachina parts. Return to the Skysteel Manufactory, and deliver the components to Stephanivien.","Stephanivien eagerly accepts the magitek components. Before returning to his inventing, however, he tells you of the troubles Celestaux has encountered in his efforts to locate Joye. It would seem that someone has paid good coin to cover the ex-machinist's trail out of Ishgard. Head into the Brume, and try questioning its inhabitants as to the whereabouts of Joye's father instead.","You have spoken to several residents of the Brume, and learned several vital snippets of information. Return to the Skysteel Manufactory, and share your findings with Stephanivien.","After considering the information you uncovered in the Brume, Stephanivien is convinced that Joye will be found in Falcon's Nest. Travel to the settlement in the Coerthas western highlands, and cast your gaze about for the elusive ex-machinist.","You succeed in locating Joye in Falcon's Nest, but Stephanivien is unable to convince the young lady to return to her former position in the workshop. Return to the Skysteel Manufactory and console the chief machinist.","Celestaux shares his suspicion that Joye's father is being held against his will, thus forcing Joye's decision to abandon her employment in Ishgard. Stephanivien, however, refuses to meddle further in his former employee's affairs, choosing instead to focus on his preparations for the operation with House Dzemael. Accept the chief machinist's latest invention, and continue improving your skills that you might compensate for the workshop's dwindling ranks.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 54."],"objectives":["Inspect imperial crates in Castrum Centri and obtain materials.","Deliver the warmachina parts to Stephanivien at the Skysteel Manufactory.","Inquire about Joye's father in the Brume.","Speak with Stephanivien.","Search for Joye in Falcon's Nest.","Speak with Stephanivien."],"dialogue":[{"name":"STEPHANIVIEN","text":"Ah, there you are, <span class=\"highlight\">Forename</span>. 'Twould seem that 'tis not only Joye, but her father as well who has vanished from the city."},{"name":"STEPHANIVIEN","text":"Celestaux is out asking questions, but there are few answers to be had. Rather than sit here on our hands whilst we wait for a revelation, however, I would prefer we begin preparations for our engagement alongside House Dzemael."},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"},{"name":"STEPHANIVIEN","text":"The Dzemaels have been struggling to restore the township of Falcon's Nest─an enterprise that has been interrupted time and again by marauding Dravanians."},{"name":"STEPHANIVIEN","text":"The signs─and a steady trickle of scouting reports─suggest that the dragons are massing for a significant assault on the settlement. Its fortifications are not yet complete, and 'twill be the aim of the allied operation to defend these half-finished structures from the ravages of the Horde.<br>...I expect House Haillenarte shall be positioned on the front lines of this conflict."},{"name":"STEPHANIVIEN","text":"Should we fight well, the dragons will be routed; should we fight poorly, our reputation will suffer. From Lord Tedalgrinche's perspective, either result is a victory."},{"name":"STEPHANIVIEN","text":"For the future of machinistry, however, we cannot afford to fail. Thus, have I focused my energies towards designing an attachment that will improve our chances of success. Now, the problem─which I was hoping you might help me solve─is the acquisition of suitable components."},{"name":"STEPHANIVIEN","text":"The swiftest way to create new technology is by repurposing the old. To that end, I would have you infiltrate Castrum Centri, and salvage a goodly number of warmachina parts. The Garleans there may take a dim view of your efforts to, uh, <span class=\"emphasis\">liberate</span> their supplies..."},{"name":"STEPHANIVIEN","text":"If I am to complete my newest invention in time, I must needs take advantage of existing magitek components. Fortunately, I hear that the Garleans have literal crates of the stuff simply lying about in Castrum Centri..."},{"name":"STEPHANIVIEN","text":"With Joye gone from the workshop, I have no one else to whom I can entrust such duties. 'Tis no simple task, I know, but I must have those components."},{"name":"STEPHANIVIEN","text":"Splendid! These parts will do much to speed the construction of my invention. Now, if only Joye were returned to us..."},{"name":"STEPHANIVIEN","text":"Despite Celestaux's most earnest efforts, however, 'twould appear that his contacts in the Brume have elected to spurn his inquiries."},{"name":"STEPHANIVIEN","text":"I sense an unseen hand─and a sizable purse─behind this sudden rash of reticence. Mayhap if you were to ask after the old hunter's disappearance instead, then the Brume's inhabitants would be more forthcoming."},{"name":"STEPHANIVIEN","text":"We must learn whither Joye and her father have vanished..."},{"name":"POOR01706A","text":"Eh? That old hunter fellow? I thought he'd left to start a new job someplace else."},{"name":"POOR01706A","text":"He was always cursin' how his old wounds kept him from practicin' his trade, but I s'pose he found himself somethin' new..."},{"name":"POOR01706A","text":"That old hunter fellow? I thought he'd left to start a new job someplace else..."},{"name":"POOR01706B","text":"Who? You mean the one whose daughter caught herself a husband in Falcon's Nest? He's probably there with her, ain't he?"},{"name":"POOR01706B","text":"His daughter caught herself a husband in Falcon's Nest. He's probably there with her, ain't he?"},{"name":"POOR01706C","text":"Oh, aye, the creaky old hunter. I hear he got himself payin' work <span class=\"emphasis\">and</span> saw his little girl get married on the same day."},{"name":"POOR01706C","text":"The husband's said to be the brother of some famous carpenter, and that he don't even need a job to get by."},{"name":"POOR01706C","text":"Oh, aye, the creaky old hunter. I hear he got himself payin' work <span class=\"emphasis\">and</span> saw his little girl get married on the same day."},{"name":"POOR01706C","text":"The husband's said to be the brother of some famous carpenter, and that he don't even need a job to get by."},{"name":"CELESTAUX","text":"I've never had a fellow commoner refuse to talk to me afore... Is this what it feels like to be an outsider?"},{"name":"STEPHANIVIEN","text":"Were you able to wring any information from the Brume?"},{"name":"STEPHANIVIEN","text":"Hmmm, a new job for him, and a new husband for his daughter in Falcon's Nest..."},{"name":"CELESTAUX","text":"They've been takin' on a good number of laborers and such to help with the town's restoration─even a half-crippled old hunter might find some kind of work for himself there."},{"name":"STEPHANIVIEN","text":"Yes, my prospectometer points unerringly to the west. We shall head to Falcon's Nest, and seek out Joye and her father."},{"name":"STEPHANIVIEN","text":"To Falcon's Nest, <span class=\"highlight\">Forename</span>! My prospectometer never lies!"},{"name":"CELESTAUX","text":"（★未使用／削除予定★）"},{"name":"STEPHANIVIEN","text":"She must be here somewhere..."},{"name":"STEPHANIVIEN","text":"Any sign of her?"},{"name":"JOYE","text":"H-His lordship!? What is he doin' here!?"},{"name":"STEPHANIVIEN","text":"Joye, please! I ask only that you listen a moment! Will you and your husband not consider working for me in the manufactory?"},{"name":"JOYE","text":"...I can't do that, me lordship. I can't be a machinist no more. It's best for everyone if I leave that life behind..."},{"name":"STEPHANIVIEN","text":"What do you mean, “best for everyone”!? Is that what is best for <span class=\"emphasis\">you</span>?"},{"name":"JOYE","text":"All I want for me is a simple life─one what doesn't cause problems for those who've shown me such kindness."},{"name":"JOYE","text":"I'm glad we could talk this one last time, me lordship. I'll be prayin' that you and your machinists get the recognition you deserve."},{"name":"STEPHANIVIEN","text":"I always thought Joye was happiest when she had the stock of her flintlock in hand. Will she now sacrifice that happiness for the satisfaction of others?"},{"name":"STEPHANIVIEN","text":"...Or is it that she never truly wished to be a machinist, and merely suffered the training at my insistence?"},{"name":"STEPHANIVIEN","text":"By arming the commoners, 'twas my intention to place them on equal footing with the nobles who seek to rule them. But caught in the throes of self-righteous ambition, mayhap I have treated them no better."},{"name":"CELESTAUX","text":"(-Celestaux-)Seems his lordship is havin' himself a crisis of faith. Might be as you could lend him a sympathetic ear, eh? I'll join you back at the workshop in a bit─there's somethin' I want to look into first."},{"name":"CELESTAUX","text":"Welcome back."},{"name":"STEPHANIVIEN","text":"I have run my prospectometer through all possible permutations, but the result is always the same: we focus on preparations for the allied operation."},{"name":"CELESTAUX","text":"So we just give up on bringin' Joye back?"},{"name":"STEPHANIVIEN","text":"Should we fail House Dzemael, then the reputation we built at the tourney will crumble into dust. We would have to begin again, brick by painful brick..."},{"name":"CELESTAUX","text":"A moment, me lord. I lingered behind in Falcon's Nest to see if I could find Joye's father, but he was nowhere to be found. I've got a feelin' somethin' ain't right here."},{"name":"STEPHANIVIEN","text":"If Joye herself has no wish to be a machinist, then what more can I do? 'Tis not my place to meddle in her affairs."},{"name":"CELESTAUX","text":"Oh, aye, I see how it is. I'd thought you different from them other nobles, but you're all the same─only interested in helpin' commoners as long as they're doin' your biddin'."},{"name":"CELESTAUX","text":"Well, I've had enough of takin' orders. It's time I went me own way."},{"name":"STEPHANIVIEN","text":"My grand plans for the future of machinistry... Have they all been in vain?"},{"name":"Q1","text":"Have they all been in vain?"},{"name":"A1","text":"We have come so far."},{"name":"A1","text":"That is for you to judge."},{"name":"STEPHANIVIEN","text":"We have, you and I. Speaking of which, I had promised to use those components you brought me to build a new weapon."},{"name":"STEPHANIVIEN","text":"Do not underestimate your own contributions. Speaking of which, I had promised to use those components you brought me to build a new weapon."},{"name":"STEPHANIVIEN","text":"If naught else, we have certainly made advances in the field of machinistry. Such a tangible measure of progress cannot be ignored..."},{"name":"STEPHANIVIEN","text":"Yes! My prospectometer was so overloaded with peripheral problems, I failed to see the practical evidence of our success! The path is steep and our steps are small, but that does not mean the destination is beyond us!"},{"name":"STEPHANIVIEN","text":"I will ask much of you in the coming days, <span class=\"highlight\">Forename</span>, and I shall see that you are the most well-equipped machinist in the short history of machinistry."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":822,"action":16497,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":96}],"quests":[67241]},"next":[67243]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014799","obj":{"i":1014799,"n":"Befuddled Commoner","l":2300,"q":1}},{"type":"npc","id":"1014800","obj":{"i":1014800,"n":"Begrimed Commoner","l":2300,"q":1}},{"type":"npc","id":"1014801","obj":{"i":1014801,"n":"Bedraggled Commoner","l":2300,"q":1}},{"type":"npc","id":"1014802","obj":{"i":1014802,"n":"Celestaux","l":2300,"q":1}},{"type":"npc","id":"1014803","obj":{"i":1014803,"n":"Stephanivien","l":2200,"q":1}},{"type":"action","id":"16497","obj":{"i":16497,"n":"Auto Crossbow","c":3042,"j":31,"t":3,"l":52}},{"type":"quest","id":"67241","obj":{"i":67241,"n":"A Joye-less Celebration","g":158,"l":"Ishgard","s":10,"f":1}},{"type":"quest","id":"67243","obj":{"i":67243,"n":"A Joye-ful Reunion","g":158,"l":"Ishgard","s":12,"f":1}}]}