{"quest":{"name":"Wheels of Justice","location":"Ishgard","id":67244,"patch":3.0,"sort":13,"icon":100445,"unlocksFunction":1,"eventIcon":71341,"issuer":1014577,"target":1014577,"involved":[1014819,1014820,1014821,1014822,1014823,1014825,1014829],"genre":158,"journal":["Stephanivien seems in a cheerful mood.","Stephanivien welcomes you back to the manufactory, but his cheerful mood is soon soured by the arrival of a Temple Knight. It would seem that the chief machinist has been accused of fomenting insurrection, and a failure to clear this suspicion may result in the seizure of the workshop and imprisonment for its employees. Speak with Stephanivien, and discuss this ominous development.","Reasoning that an attempt to disprove his own actions would be fruitless, Stephanivien decides to counter the accusation by providing evidence of Tedalgrinche's wrongdoing. Head to the Forgotten Knight, and join Celestaux in his search for strings that would connect House Dzemael to their crimes.","Celestaux tells you of the sudden absence of Fraideoux─the man who stood guard over Joye's abducted father─and explains how his suspicions led him to investigate the novice machinist's abode. Amidst the splinters of broken furniture, it seems he discovered the ragged feather of a wild chocobo. Take the tale back to Stephanivien, and plan your next move.","You relay Celestaux's discovery to Stephanivien, and he decides to follow the lead to the Dravanian forelands. Make your way to Tailfeather, and speak with the chief machinist once more.","You join Stephanivien and Joye in Tailfeather. The chief machinist has already questioned the local hunters, and learned that a man matching Fraideoux's description was seen in the company of a rough-looking trio. Head to your assigned search area to the north of the settlement, and confront any suspicious fellows you find.","You find your quarry in a secluded corner of the forest, but are attacked the instant you approach. The ruffians, however, are no match for your effortless marksmanship. Holster your firearm, and rescue Fraideoux from his bonds.","Stephanivien and Joye appear at the scene of the rescue, and Fraideoux begs forgiveness for his unwilling betrayal. The chief machinist waves away the apology, and instead seizes upon the opportunity to turn the tables on his accuser. Return to the Skysteel Manufactory and speak with Stephanivien.","You arrive back at the manufactory to find that Stephanivien has, with the aid of Fraideoux's testimony, lodged a counter-accusation against Tedalgrinche. Practice your new machinist technique whilst you wait for the wheels of justice to slowly grind the suspicions against the workshop into dust.<br><br>※The next machinist quest will be available from Stephanivien upon reaching level 58."],"objectives":["Speak with Stephanivien.","Meet Celestaux in the Forgotten Knight.","Speak with Stephanivien.","Speak with Stephanivien in Tailfeather.","Confront the suspicious fellow north of Tailfeather.","Rescue Fraideoux.","Speak with Stephanivien at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"Greetings, <span class=\"highlight\">Forename</span>! Is this not a wonderful day to be a machinist?"},{"name":"KISHI01708","text":"(-Stern Voice-)Lord Stephanivien de Haillenarte! You and the Skysteel Manufactory employees under your authority are hereby charged with fomenting insurrection!"},{"name":"STEPHANIVIEN","text":"Insurrection!? My dear ser, I have fomented nothing of the sort!"},{"name":"KISHI01708","text":"You stand accused of arming commoners with weapons of war, and discharging said weapons within the locality of the Brume."},{"name":"STEPHANIVIEN","text":"Ah... That little scene when we liberated Joye's father..."},{"name":"KISHI01708","text":"Henceforth, the manufactory shall remain under Temple Knight surveillance─should you fail to refute the accusations against you within the allotted time, punishment may include seizure of your workshop...and imprisonment for all those deemed accomplices to the crime."},{"name":"STEPHANIVIEN","text":"The Fury take that smirking fox! Tedalgrinche <span class=\"emphasis\">knew</span> we would attempt a rescue!"},{"name":"ROSTNSTHAL","text":"Once they set their sights on summat, them Temple Knights is like a bandersnatch with a bone. Ye'd best say farewell to yer workshop."},{"name":"STEPHANIVIEN","text":"They'll not take my manufactory! I will think of something..."},{"name":"ROSTNSTHAL","text":"Once they set their sights on summat, them Temple Knights is like a bandersnatch with a bone. Best say farewell to the workshop."},{"name":"JOYE","text":"How could they have twisted me dad's rescue into an act of insurrection!?"},{"name":"CELESTAUX","text":"That Tedalgrinche bastard's always two steps ahead..."},{"name":"STEPHANIVIEN","text":"'Tis difficult to prove the truth of something one has not done. Mayhap the wiser course would be to provide evidence of Tedalgrinche's wrongdoing."},{"name":"ROSTNSTHAL","text":"'E's a clever bastard, though, that one. Ye might try─ Ah, but I'd best not overstep me bounds."},{"name":"ROSTNSTHAL","text":"Me contract's almost done in any case, and I'll be movin' on no matter what 'appens to the workshop."},{"name":"CELESTAUX","text":"Our instructor, he sure don't like to get involved... As for me, I'll see if I can find any strings connectin' House Dzemael to their crimes. The Forgotten Knight should be a good place to start."},{"name":"JOYE","text":"I don't know what I'd do without the workshop! I'll see if I can't get some folks talkin'!"},{"name":"STEPHANIVIEN","text":"And that leaves you and me, <span class=\"highlight\">Forename</span>. I believe I shall remain here in the manufactory to occupy the gaze of the Temple Knights, whilst you aid Celestaux with his inquiries."},{"name":"STEPHANIVIEN","text":"'Tis difficult to prove the truth of something one has not done. Mayhap the wiser course would be to provide evidence of Tedalgrinche's wrongdoing."},{"name":"CELESTAUX","text":"I appreciate you comin' out, <span class=\"highlight\">Forename</span>. It's a bit hard plannin' aught in the workshop, what with the Temple Knights eyeballin' our every move. We should be able to talk freely in here, though."},{"name":"CELESTAUX","text":"Do you recall that bloke as was standin' guard over Joye's dad? Aye, “Fraideoux” is his name. He took to marksmanship with a passion, and hadn't missed a single day of trainin'...not until today."},{"name":"CELESTAUX","text":"I got suspicious, of course, and decided to pay a visit to his home. Right away, you could see the door had been kicked in, so I went inside and had me a proper look. That's when I found a ragged feather just lyin' there on the floor amidst the bits of broken furniture."},{"name":"CELESTAUX","text":"If I wanted to keep me hands clean, then maybe I'd hire me some thugs from out of town to do for poor Fraideoux. Thugs what might otherwise make a livin' poachin' wild chocobos."},{"name":"CELESTAUX","text":"I suggest you talk to Lord Stephanivien, and take a trip out to Tailfeather. I'll keep pokin' around here in the city and see what else crawls out of the stonework."},{"name":"STEPHANIVIEN","text":"...Hmmm, this may be our best lead. If we can track down the man who first employed Fraideoux, then we shall have a solid link to House Dzemael."},{"name":"STEPHANIVIEN","text":"Let us waste no time. Onwards to the Dravanian forelands, and to Tailfeather!"},{"name":"STEPHANIVIEN","text":"Onwards to the Dravanian forelands, and to Tailfeather!"},{"name":"STEPHANIVIEN","text":"Good news, <span class=\"highlight\">Forename</span>! I have spoken with some few of these hunter fellows, and they told me of a trio of ruffians that passed through here dragging a man matching Fraideoux's description."},{"name":"STEPHANIVIEN","text":"We shall scour the forest to the south, if you will look to the north. Do not wait for us─should you find these ruffians, then pray confront them ere Fraideoux comes to further harm."},{"name":"ZOKU01708","text":"No witnesses! Cut this one's throat as well!"},{"name":"FRAIDEOUX","text":"H-How did you find me!?"},{"name":"FRAIDEOUX","text":"...My thanks. I did not expect to see another dawn."},{"name":"STEPHANIVIEN","text":"Fraideoux! Not leaking blood, are you? Splendid! You gave us quite a scare!"},{"name":"FRAIDEOUX","text":"（★未使用／削除予定★）"},{"name":"FRAIDEOUX","text":"F-Forgive me, me lord! Those men...they dragged me from me home. Said they'd hurt me if I didn't swear false witness to the Temple Knights..."},{"name":"STEPHANIVIEN","text":"You were forced to substantiate their accusations? Then you merely need withdraw your testimony to strengthen our position. 'Twould be a boon if we were also able to provide some manner of physical evidence..."},{"name":"STEPHANIVIEN","text":"A seal of House Dzemael. 'Twould explain how the ruffians who snatched Fraideoux were able to enter the city without challenge. Aye, this shall do nicely."},{"name":"FRAIDEOUX","text":"I'm truly sorry, me lord. All it took was one little beating for me to repay your kindness with betrayal. I'll not darken your doorstep again..."},{"name":"STEPHANIVIEN","text":"What nonsense! You hardly had a choice in the matter!"},{"name":"STEPHANIVIEN","text":"Continue your training at the manufactory, however, and you'll become more than a match for thugs such as these. Even without a noble's wealth or prestige, a common man can earn himself independence!"},{"name":"JOYE","text":"You'll see that a machinist's firearm is for more than just shootin' dragons─it can help set you free. His lordship's vision'll change Ishgard for the better!"},{"name":"JOYE","text":"Come with us, Fraideoux! Become the spear and the shield that our city needs!"},{"name":"FRAIDEOUX","text":"&lt;sob&gt; I-I'd like that... I'd like to feel like I'm worth somethin'..."},{"name":"STEPHANIVIEN","text":"We all make mistakes, my dear fellow. The trick is to learn from them, and rise stronger from every defeat! Come, let us return to the manufactory!"},{"name":"STEPHANIVIEN","text":"The tables have turned, my friend. I have submitted the evidence you found to the Temple Knights."},{"name":"STEPHANIVIEN","text":"With the aid of Fraideoux's new testimony, we had enough proof to lodge a counter-accusation against Tedalgrinche."},{"name":"STEPHANIVIEN","text":"The wheels of justice have begun to turn, and we shall soon be free of these baseless suspicions!"},{"name":"STEPHANIVIEN","text":"In the meantime, Rostnsthal requested that I instruct you to “remember yer bleedin' practice drills!” Charming fellow."},{"name":"SYTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":2113,"action":16889,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":96}],"quests":[67243]},"next":[67246]},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1014819","obj":{"i":1014819,"n":"Joye","l":2300,"q":1}},{"type":"npc","id":"1014820","obj":{"i":1014820,"n":"Rostnsthal","l":2300,"q":1}},{"type":"npc","id":"1014821","obj":{"i":1014821,"n":"Celestaux","l":2300,"q":1}},{"type":"npc","id":"1014822","obj":{"i":1014822,"n":"Celestaux","l":2300,"q":1}},{"type":"npc","id":"1014823","obj":{"i":1014823,"n":"Stephanivien","l":2000,"q":1}},{"type":"npc","id":"1014825","obj":{"i":1014825,"n":"Suspicious Fellow","l":2000,"q":1}},{"type":"npc","id":"1014829","obj":{"i":1014829,"n":"Fraideoux","l":2000,"q":1}},{"type":"action","id":"16889","obj":{"i":16889,"n":"Tactician","c":3040,"j":31,"t":4,"l":56}},{"type":"quest","id":"67243","obj":{"i":67243,"n":"A Joye-ful Reunion","g":158,"l":"Ishgard","s":12,"f":1}},{"type":"quest","id":"67246","obj":{"i":67246,"n":"Taking the Fall","g":158,"l":"Ishgard","s":14,"f":1}}]}