{"quest":{"name":"Legacy of Allag","location":"Mor Dhona","id":67245,"patch":4.4,"sort":1,"icon":100178,"unlocksFunction":1,"eventIcon":71341,"issuer":1007753,"target":1006725,"genre":15,"journal":["An oddly garbed man visiting Revenant's Toll has some information which might be of interest to an experienced adventurer.","At Revenant's Toll, an oddly garbed visitor informs you of a rare opportunity to uncover the wisdom of the ancients. Make your way to Saint Coinach's Find and speak with the site's chief supervisor, Rammbroes, who the stranger believes would welcome the services of a storied champion such as yourself.","Upon arriving at your destination, you find the Sons of Saint Coinach making preparations for an expedition into the forbidding Crystal Tower─aided by your old friend Cid Garlond. Speak with Rammbroes when you are ready to assist in the Sons' mission to understand and preserve the potent technology of the fallen Allagan Empire.","According to Rammbroes, the entrance to the Crystal Tower is guarded by potent elemental defenses which will need to be circumvented before any expedition into the structure can be attempted. Cid's research suggests that the wrath of the elements can theoretically be reflected by crystals of sufficient clarity. Unfortunately, such flawless specimens are most likely to be found in the midst of the various beast tribe strongholds, and will not be had without a fight. It falls to you to obtain a flawless earth crystal from U'Ghamaro Mines in outer La Noscea, and a flawless water crystal from the Sapsa Spawning Grounds in western La Noscea.","You have wrested the flawless crystals from the clutches of the kobolds and the Sahagin. Deliver your prizes to Rammbroes where he awaits you at Saint Coinach's Find.","After taking receipt of the two flawless crystals you acquired in La Noscea, Rammbroes asks that you seize the equivalent fire- and wind-aspected specimens held by the Amalj'aa and the Ixal. To that end, you set out to obtain a flawless fire crystal from Zahar'ak in southern Thanalan, and a flawless wind crystal from Natalan in the Coerthas central highlands.","You succeed in infiltrating the strongholds of the Amalj'aa and the Ixal, and escape with the beastmen's flawless fire and wind crystals. Deliver them both to Rammbroes at Saint Coinach's Find.","Thanks to your daring forays into the beastmen's strongholds, the Sons of Saint Coinach now possess flawless crystals of each of the four elements. If they are to be relied upon to reflect the wrath of the tower's sentinels, however, the crystals must be cut and polished to exacting specifications. According to Rammbroes, this process calls for certain extraordinary materials. Clearly, much work remains to be done."],"objectives":["Speak with Rammbroes.","Speak with Rammbroes once more.","Survey the designated location in U'Ghamaro Mines and slay the kobold sentry to obtain a flawless earth crystal.","Survey the designated location in the Sapsa Spawning Grounds and slay the Sahagin sentry to obtain a flawless water crystal.","Deliver the flawless crystals to Rammbroes at Saint Coinach's Find.","Survey the designated location in Zahar'ak and slay the Amalj'aa sentry to obtain a flawless fire crystal.","Survey the designated location in Natalan and slay the Ixali sentry to obtain a flawless wind crystal.","Deliver the flawless crystals to Rammbroes at Saint Coinach's Find."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"NERO","text":"Do I know you? ...Ah! Unless I am very much mistaken, you are the famed adventurer who bested the Garlean Empire's general, are you not? The great <span class=\"highlight\">Forename Surname</span> <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! <span class=\"emphasis\">Amazing</span>─and more than a little serendipitous. One might even call it fate. I but recently received word of a truly <span class=\"emphasis\">unique</span> opportunity, you see─an opportunity the like of which none but one of your proven worth could take advantage."},{"name":"NERO","text":"The reward? Naught less than the accumulated knowledge of a fallen civilization. The risk? A single misstep could cost you your life. But what is a little danger to a storied hero such as you?"},{"name":"NERO","text":"A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with absolute confidence in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own abilities stands to profit handsomely from this venture. No, no, I crave no recompense for my part in bringing this opportunity to your attention─the historic discoveries you shall make will be reward enough, I assure you."},{"name":"NERO","text":"If my words have fanned the flames of your curiosity, then I bid you seek a man by the name of Rammbroes at Saint Coinach's Find. It is he who stands at the doorway to untold marvels, awaiting the arrival of a champion bold enough to march across the threshold."},{"name":"NERO","text":"It is Saint Coinach's Find to which you must travel. Seek out the man known as Rammbroes, and learn what treasures─and dangers─await you."},{"name":"RAMMBROES","text":"Why, if it isn't <span class=\"highlight\">Forename Surname</span> <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! I was not expecting such a celebrated guest. To what do I owe the honor of this visit?"},{"name":"RAMMBROES","text":"You were directed here, you say? By a man clad in foreign garb? Well, the opportunity he spoke of must surely refer to our latest anthropogeographical endeavor. Quite how he came to know of it is another matter. All knowledge of this project was supposed to be restricted to my organization..."},{"name":"RAMMBROES","text":"...But that is something for me to ponder in private. You are here now, and your services will, I am certain, prove invaluable. I must warn you, however, that the venture we have in mind is no simple excavation─an unprepared or incautious adventurer could very well find <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> on an unplanned and unpleasant journey to Thal's solemn halls. Knowing this, do you still wish to lend us your cooperation?"},{"name":"RAMMBROES","text":"I rather thought you would say that. Your courage is scarcely a secret."},{"name":"RAMMBROES","text":"Now, the first─"},{"name":"CID","text":"(-???-)<span class=\"highlight\">Forename</span>!? I <span class=\"emphasis\">thought</span> it was you!"},{"name":"CID","text":"What brings you to Saint Coinach's? Don't tell me─the Alliance has sent you on another realm-shaking, history-making mission to lay low an apparently insuperable foe, yes? <span class=\"emphasis\">No</span>?"},{"name":"RAMMBROES","text":"Ah, I see you two are already acquainted. That is well. Master Garlond, our intrepid hero here caught wind of the forthcoming expedition, and has kindly pledged to assist us."},{"name":"CID","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has, has <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>? Glad to have you aboard, <span class=\"highlight\">Forename</span>! You...don't have the faintest idea what you've volunteered for, do you? Very well, let us begin at the beginning."},{"name":"CID","text":"The Sons of Saint Coinach are tasked with unearthing the secrets of the long-fallen Allagan Empire, and this present endeavor aims to delve more deeply into the civilization's mysteries than ever before."},{"name":"CID","text":"...Ah, but I know that look. In the event that you feel ill equipped to contribute much on the subject of Allagan archaeology, I invite you to recall your encounter with the Ultima Weapon."},{"name":"CID","text":"That mechanical monstrosity represented a feat of engineering far beyond aught Garlemald can presently achieve─Nero tol Scaeva simply awoke it. I mention this by way of a reminder that you have had what one might term...<span class=\"emphasis\">extensive firsthand experience</span> with a notable Allagan relic. In short, you're practically an archaeologist."},{"name":"CID","text":"Now, to the core of the matter: here in Mor Dhona, there stands an entire Allagan structure which we have yet to investigate. I speak, of course, of the Crystal Tower."},{"name":"CID","text":"After witnessing the destructive capabilities of the Ultima Weapon, and the lesser moon, Dalamud, before it, it seems wise to treat any remnants from that era with the utmost caution. They must be analyzed, monitored, and─above all─kept from falling into the wrong hands."},{"name":"CID","text":"To put it plain: I have no wish to see another megalomaniacal legatus wield one of those weapons. It was this thought which first moved me to contact the Sons and propose that the tower be explored."},{"name":"CID","text":"For several millennia, the Crystal Tower remained hidden, buried deep underground. But, like so many other things that were better left undisturbed, the structure was freed from its stony prison by the great upheaval which accompanied the coming of the Seventh Umbral Era. It now stands revealed in all its splendor, a gleaming spear of crystal, pointed at the bosom of the heavens."},{"name":"CID","text":"We believe the tower to be the repository of much of the ancients' wisdom. Unfortunately, its entrance is guarded by formidable defenses, and we cannot so much as peep through the keyhole, much less set foot inside."},{"name":"CID","text":"These defenses take the form of statues, carved into the likeness of giant swordsmen. “The Eight Sentinels,” as the Sons are wont to call them, is the first barrier we must overcome."},{"name":"CID","text":"Why not simply fly over them in an airship, you ask? It's been tried before: any vessel that ventures too close to the tower is blasted out of the air. We either destroy those statues, or the front door is forever beyond our reach."},{"name":"RAMMBROES","text":"My colleagues and I are ill-suited to negotiating such deadly hazards. Thus, if we are to gain access to the tower's secrets, we must needs employ the services of an experienced adventurer."},{"name":"RAMMBROES","text":"It will be difficult and dangerous, <span class=\"highlight\">Forename</span>, but I can think of no finer <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the task."},{"name":"CID","text":"If I didn't know better, I'd say you had a taste for these deadly escapades! I look forward to working with you again."},{"name":"RAMMBROES","text":"There is much and more to be done before we can begin the expedition proper. Take some time to prepare yourself, and I shall explain the challenges that lie ahead..."},{"name":"RAMMBROES","text":"Our first objective is to reach the entrance to the Crystal Tower. As I previously mentioned, however, that will prove no easy task."},{"name":"RAMMBROES","text":"The entrance is guarded by powerful defense mechanisms, each utilizing one of the four elements of fire, water, wind, or earth. Anyone attempting to simply stroll past these unsleeping sentinels invites swift obliteration."},{"name":"RAMMBROES","text":"Based on Master Garlond's analyses, however, we are reasonably certain that the attacks of these lethal contraptions can be reflected using a crystal of the corresponding element."},{"name":"RAMMBROES","text":"Naturally, these crystals must be of surpassing clarity, free of the slightest impurities─much like the flawless specimens used by the beastmen in their primal-summoning rituals."},{"name":"RAMMBROES","text":"Ahem. Mayhap I should have said “exactly like” the specimens they use... &lt;sigh&gt; Were there any other way, we would not ask this of you, but we need someone to enter the beast tribe strongholds and “liberate” their perfect crystals."},{"name":"RAMMBROES","text":"For the moment, I would have you focus on obtaining two of the four crystals we require. Pray make for La Noscea, where both the Sapsa Spawning Grounds and U'Ghamaro Mines are located."},{"name":"RAMMBROES","text":"You may be certain that the materials used in the beastmen's sacred rituals will be well defended. Whether you choose to venture there alone or with companions, I shall leave to your discretion. But whatever you do, please be careful!"},{"name":"BALLOON","text":"Begone, shorewalker!"},{"name":"BALLOON","text":"A trespasser─invader, infiltrator, trespasser!"},{"name":"RAMMBROES","text":"How progress your efforts in infiltrating the beastman strongholds?"},{"name":"RAMMBROES","text":"So these are the famed flawless crystals of the beast tribes... I have seen countless specimens from I know not how many excavations, but nothing to compare to these. Their purity is...astounding."},{"name":"RAMMBROES","text":"You have done well, <span class=\"highlight\">Forename</span>. With these in our possession, we lack only the crystals of fire and wind. The former lies in Zahar'ak, the war camp of the Amalj'aa in Thanalan; the latter, in Natalan, the roost of the Ixal in the hills of Coerthas."},{"name":"RAMMBROES","text":"You can expect them to be as closely guarded as the first two, if not more so. Still, I look forward to receiving word of your resounding success!"},{"name":"BALLOON","text":"Who dares trespass in Zahar'ak?"},{"name":"BALLOON","text":"Caw, caw! Ours, these crystals are!"},{"name":"RAMMBROES","text":"<span class=\"highlight\">Forename</span>! It is good to see you. Tell me, were you able to obtain the remaining crystals from the beastmen?"},{"name":"RAMMBROES","text":"Wonderful! With all four crystals in hand, we are now ready to proceed to the next stage of our preparations."},{"name":"RAMMBROES","text":"Ah. I hope I did not give the impression that we would be embarking on our journey to the Crystal Tower just yet. Alas, there is another step which must be completed ere we come to that. While the crystals you acquired are indeed flawless, they are of little use to us in their present form. If they are to reflect the elemental forces of the tower's defenses, they must needs be cut and polished."},{"name":"RAMMBROES","text":"...A process which calls for a very <span class=\"emphasis\">particular</span> set of materials. Procuring them will be a challenge in itself, I fear. Needless to say, we will be requiring your services once again..."}],"reward":{"gil":1220,"items":[{"num":3,"id":5598}]},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[66736]},"partials":[{"type":"npc","id":"1007753","obj":{"i":1007753,"n":"Outlandish Man","l":67,"q":1}},{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"item","id":"5598","obj":{"i":5598,"n":"Grade 5 Dark Matter","l":1,"c":20403,"t":60,"p":80}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"66736","obj":{"i":66736,"n":"Sanding It Down","g":15,"l":"Mor Dhona","s":2,"f":1}}]}