{"quest":{"name":"The Ballad of Oblivion","location":"The Churning Mists","id":67254,"patch":3.0,"sort":600,"icon":100437,"unlocksFunction":1,"eventIcon":71341,"issuer":1014265,"target":1006750,"involved":[1014272,1014273,1014274,1014275,1014276,1014277,1014278,1014280,1014281,1014282,1014283],"genre":151,"journal":["Sanson has given up hope of Guydelot returning.","Together with Mogta, Sanson has searched high and low for Guydelot, but the bard is nowhere to be found; it would seem you must continue the mission without him. Mogta informs you that the Ballad of Oblivion is said to originate from the skies to the east, and you take this to mean the Sea of Clouds. Sanson declares that he will secure an airship to carry you there, and bids you meet him at the airship landing in Gridania. After the serpent captain takes his leave, Mogta reveals to you a secret: he has met with Guydelot, but could not convince the bard to return with him. The moogle believes that you may fare better than he did, and entrusts you with Sanson's journal in case it may be of use. Make your way to the peak of Sohm Al, where Guydelot is lingering, and show the journal to the bard.","In spite of the journal and your earnest pleading, Guydelot refuses to rejoin the fellowship, so ashamed is he of having accused Sanson of using song as a tool. You can only stand and watch as Guydelot leaves to do his soul-searching. Follow your two other companions back to Gridania, and join them at the airship landing.","Sanson has secured the use of an airship, and together you fly to the island of Mok Oogl, at the fringe of the Sea of Clouds. Speak with Sanson for further instructions.","Something upon the island has Mogta deeply unsettled, and Sanson believes it to be the Ballad of Oblivion. Do your part to scour the island, and report to Sanson.","You find Sanson staring longingly at a stone bearing strange markings. Mogta remembers that it is a stone of sealing, used to imprison baleful beings, but his warning comes a breath too late, and Sanson unleashes the siren that had been held within. The Ballad of Oblivion is revealed to be the fiend's soul-rending voice, which she used to annihilate the tribe of moogles that once dwelled upon Mok Oogl. Sanson is resolved to face the siren alone, and bids you and Mogta flee. At that moment, Guydelot makes his return, his words instilling Sanson with newfound courage. Together with your companions, you succeed in returning the siren to her stony prison. Though the Ballad of Oblivion never truly existed, Sanson believes that such abilities as you have mastered in the course of the mission will suffice to satisfy his superiors. Follow your friends back to the airship and let Sanson know when you are ready to return to Gridania.","Sanson expresses his heartfelt thanks for your invaluable contributions to the mission. While he makes his report to the Order of the Twin Adder and the Gods' Quiver, he bids you pay a visit to Jehantel west of Quarrymill, that you might regale the old bard with an account of your journey.","Jehantel thanks you for having watched over Sanson and Guydelot, and observes that your experiences have raised you higher as a bard. He bids you continue being a paragon of your art, enriching the hearts of men with song.<br><br>※The next bard quest will be available from Jehantel once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Deliver Sanson's journal to Guydelot.","Speak with Sanson at the Gridania airship landing.","Speak with Sanson.","Speak with Jehantel west of Quarrymill.","Defeat Ligeia!"],"dialogue":[{"name":"MOGTA","text":"Guydelot sounds like a nice fellow! I can't wait to meet him, kupo!"},{"name":"SANSON","text":"In spite of our best efforts, I'm afraid we weren't able to find Guydelot."},{"name":"SANSON","text":"If he had any intention to return, he would have done so by now. It seems plain we cannot depend upon him anymore."},{"name":"SANSON","text":"But with or without him, we must continue our mission."},{"name":"MOGTA","text":"I was <span class=\"emphasis\">so</span> hoping to meet Guydelot, but I suppose the show must go on. Now, the legend says that the Ballad of Oblivion can be found in the skies to the east. Is there another place like the Churning Mists in that direction, kupo?"},{"name":"Q1","text":"Is there a place like the Churning Mists?"},{"name":"A1","text":"Yes, it's called the Sea of Clouds."},{"name":"A1","text":"Yes, the Ishgardians have an outpost there."},{"name":"SANSON","text":"Truly? Then that is where we must go!"},{"name":"SANSON","text":"We will need to make a brief visit to Gridania, to secure the use of an airship to bear us there. Pray come to the landing when you arrive in the city."},{"name":"MOGTA","text":"This is just between you and me, but I've actually spoken with Guydelot, kupo."},{"name":"MOGTA","text":"Unfortunately, he refused to come back, saying that he couldn't bear to face Sanson. I couldn't convince him to join us, but maybe you can, <span class=\"highlight\">Forename</span>. Here, take this with you."},{"name":"MOGTA","text":"It's Sanson's journal, the one he's always writing in. I, uh...<span class=\"emphasis\">borrowed</span> it. I thought that it might help if you were to show it to Guydelot. You'll find him at the summit of Sohm Al, kupo."},{"name":"MOGTA","text":"Please see if you can convince Guydelot to join us. Show him Sanson's journal if you think it'll help. You'll find him at the summit of Sohm Al, kupo."},{"name":"GUYDELOT","text":"Bah, that Mogta blabbed, didn't he!?"},{"name":"GUYDELOT","text":"...Hm? Sanson's journal, is it? It's nigh filled cover to cover with writings on song. Huh... To see this, you'd think him a bard."},{"name":"GUYDELOT","text":"&lt;sigh&gt; I've done a lot of thinking since we last spoke."},{"name":"GUYDELOT","text":"Though he's no bard, Sanson's bent on finding the song. Hells, he's keener on it than any one of us, and I couldn't understand why. But now I do."},{"name":"GUYDELOT","text":"Sanson truly believes in song─it's as simple as that. But in the heat of the moment, I accused him of using song as a tool."},{"name":"GUYDELOT","text":"That was ill done, and I'm ashamed of myself. I can't bear to be in Sanson's company."},{"name":"GUYDELOT","text":"...You're off to the Sea of Clouds? Then I wish you luck. I can't go with you─I don't have the right."},{"name":"GUYDELOT","text":"I need to be alone right now and take a long, hard look at myself. You'd do best not to expect anything of me."},{"name":"MOGTA","text":"I've made myself invisible with moogle magicks. You mustn't talk to me, or people will suspect, kupo!"},{"name":"SANSON","text":"I'm pleased to say I was able to secure the Order's cooperation. We have permission to take an airship to the Sea of Clouds!"},{"name":"MOGTA","text":"Oh, joy of joys! I'm so excited, I can hear music from the general direction of the airship!"},{"name":"MOGTA","text":"Let's not tarry─the Ballad of Oblivion awaits, kupo!"},{"name":"Q2","text":"Travel to the Sea of Clouds?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"Q3","text":"Travel to the Gridania airship landing?"},{"name":"A3","text":"Yes"},{"name":"A3","text":"No"},{"name":"SANSON","text":"We've been granted permission to take an airship to the Sea of Clouds. Let us depart at once!"},{"name":"MOGTA","text":"Something about this place makes my fur stand on end, kupo..."},{"name":"SANSON","text":"Mogta senses that an eldritch power rests here, and it fills him with dread. It can only be the Ballad of Oblivion."},{"name":"SANSON","text":"Though this place is abandoned, such structures as remain are reminiscent of Moghome. If moogles once lived here, then we are surely on the right track. Let us scour the entire isle!"},{"name":"SANSON","text":"This stone... It calls to me..."},{"name":"SANSON","text":"The Ballad of Oblivion is here! I've never felt so certain of anything in my life!"},{"name":"MOGTA","text":"Hmmm... Where have I seen such markings before, kupo...?"},{"name":"MOGTA","text":"&lt;gasp&gt; I remember now! This is a sealing stone, used to seal away baleful beings! Y-You mustn't touch─"},{"name":"LIGEIA","text":"The long cold night is ended, banished by the hand of a fool.♪<br>Your dreams are mine to see, and your heart is mine to rule.♪"},{"name":"LIGEIA","text":"I sing a song of love, and such love I bear for you,♪<br>With all my heart I give it, and know my heart is true.♪<br>As I once loved the creatures who upon this land did dwell,♪<br>But they cast aside my love, so I sent them all to hell.♪"},{"name":"SANSON","text":"Unnngh... M-My head─nay, my very soul is like to split... What...what is this voice?"},{"name":"MOGTA","text":"Resounds through the heavens and destroys all... Oh, gods, <span class=\"emphasis\">this</span> is the Ballad of Oblivion!?"},{"name":"MOGTA","text":"And this fiend used it to lay waste to an entire tribe of moogles! This isn't a song...this is an <span class=\"emphasis\">outrage</span>, kupo!"},{"name":"SANSON","text":"All this time, the thing I sought didn't even exist..."},{"name":"SANSON","text":"'Twas I who released this menace into the world. I will vanquish it, even if it costs me my life. Flee this place, the both of you!"},{"name":"GUYDELOT","text":"(-???-)Who do you think you're trying to impress?"},{"name":"GUYDELOT","text":"<span class=\"highlight\">Forename</span> and Mogta aren't running anywhere, and neither am I. We're in this together─to the bitter end!"},{"name":"SANSON","text":"G-Guydelot!? Why are you here!?"},{"name":"GUYDELOT","text":"&lt;sigh&gt; I'm here because you know nothing, Sanson the Stiff. I can't well leave you to your own devices."},{"name":"GUYDELOT","text":"Prick up your ears, because I'm not going to say this again: it's the fervent desire to aid our comrades that bestows our songs with power."},{"name":"GUYDELOT","text":"And no songs have more power than those you compose yourself! If there's no Ballad of Oblivion to be had, we'll just have to <span class=\"emphasis\">create</span> it!"},{"name":"SANSON","text":"Yes... Yes, you have the right of it. Let ours be the song of triumph over a legendary fiend!"},{"name":"GUYDELOT","text":"Hah, I like the sound of that! Now then, there're four of us to battle the siren. This makes the song a quartet, eh!?"},{"name":"MOGTA","text":"Whew... The sealing stone is back to the way it was, kupo."},{"name":"SANSON","text":"...You were with us <span class=\"emphasis\">aboard</span> the airship!? But there's scarcely any room to─ Ack, never mind that now! Wherever it was you were hiding, you made us all worried sick! Do you know that!?"},{"name":"GUYDELOT","text":"If I didn't know before, I certainly do now. I also know how hard you've been working, thanks to this."},{"name":"SANSON","text":"M-My journal! Where did you─!? Give that back this instant! I need it to write my report!"},{"name":"GUYDELOT","text":"Balls you do! We composed our own Ballad of Oblivion─that's all you need to write!"},{"name":"SANSON","text":"Hmmm... Now that I think about it, my superiors will demand more tangible results..."},{"name":"SANSON","text":"Ah, but of course! Such abilities that <span class=\"highlight\">Forename</span> mastered during the journey─they shall serve admirably!"},{"name":"GUYDELOT","text":"Bah, make up your bloody mind!"},{"name":"MOGTA","text":"When I return to Moghome, I'm going to tell everyone that we created our very own Ballad of Oblivion, kupo!"},{"name":"GUYDELOT","text":"Speaking of returning, I'd best get back to being a Quiverman. And who knows? I might even try to behave myself from now on. But whatever I might get up to, know that I won't rest until I surpass both Jehantel and <span class=\"highlight\">Forename</span>!"},{"name":"SANSON","text":"I look forward to the day that you do. Remember, my plan can't succeed without you."},{"name":"MOGTA","text":"Please send me word when the unit is formed! I'll come and pay everyone a visit, kupo!"},{"name":"SANSON","text":"You shall be the first to know, my friend."},{"name":"GUYDELOT","text":"And on that note, let's go home!"},{"name":"MOGTA","text":"Please send me word when Sanson and Guydelot form their unit! I'll come and pay everyone a visit, kupo!"},{"name":"GUYDELOT","text":"Let's be on our way, eh?"},{"name":"SANSON","text":"Upon returning to Gridania, I must report to both the Order of the Twin Adder and the Gods' Quiver. While I attend to business, might I trouble you to pay Jehantel a visit? He will doubtless desire to hear an account of our journey."},{"name":"SANSON","text":"Thank you, <span class=\"highlight\">Forename</span>─for everything. I know not when it will be, but I look forward to the day we meet again."},{"name":"MOGTA","text":"Guydelot and Sanson have returned to their duties, and I suppose you have things to get back to as well. I do believe I'll take this opportunity to see the sights and sounds of the Twelveswood. Do send Jehantel my regards, kupo!"},{"name":"JEHANTEL","text":"...A rousing tale of friendship in the face of adversity. I thank you for watching over Sanson and Guydelot. When Sanson's plan begins taking shape, he may count on me to aid him in whatever way I am able."},{"name":"JEHANTEL","text":"As for you, my friend, 'tis plain that your experiences have raised you higher as a bard, as I had expected they would. I pray that you shall ever be a paragon of our art, enriching the hearts of men with song."},{"name":"SYSTEM","text":"This concludes the bard quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next bard quest will be available from Jehantel."},{"name":"QIB","text":"Hush now, my dearest, close your weary eyes.♪<br>Bask in the warmth of my tender lullaby.♪"},{"name":"QIB","text":"No, fiend! You're the one who will be sleeping!"},{"name":"QIB","text":"You call that a song!? Don't make me laugh!"},{"name":"QIB","text":"Why deny your feelings, why keep your love from me?♪<br>Give your heart to my song, and it shall set you free.♪"},{"name":"QIB","text":"Be careful, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"I've got a bad feeling about this!"},{"name":"QIB","text":"My love unrequited, I hunger for your kiss,♪<br>I taste only tears, will I ne'er know true bliss?♪"},{"name":"QIB","text":"Keep your guard up!"},{"name":"QIB","text":"Your music is bad and you should feel bad!"},{"name":"QIB","text":"Lost to your affection, I languish in the night.♪<br>My salvation lies in your love's precious light.♪"},{"name":"QIB","text":"Just a little further, kupo!"},{"name":"QIB","text":"Our own Ballad of Oblivion...for your consideration, fiend!"},{"name":"QIB","text":"Confound it..."},{"name":"QIB","text":"Ungh... You must finish...our song..."},{"name":"QIB","text":"And I'm spent, kupo..."}],"reward":{"gil":908,"action":3562,"items":[{"id":20659}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":24}],"quests":[67253]},"next":[68426]},"partials":[{"type":"npc","id":"1014265","obj":{"i":1014265,"n":"Sanson","l":2002,"q":2}},{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"npc","id":"1014272","obj":{"i":1014272,"n":"Mogta","l":2002,"q":2}},{"type":"npc","id":"1014273","obj":{"i":1014273,"n":"Sanson","l":52,"q":1}},{"type":"npc","id":"1014274","obj":{"i":1014274,"n":"Sanson","l":2100,"q":1}},{"type":"npc","id":"1014275","obj":{"i":1014275,"n":"Sanson","l":2100,"q":1}},{"type":"npc","id":"1014276","obj":{"i":1014276,"n":"Sanson","l":2100,"q":1}},{"type":"npc","id":"1014277","obj":{"i":1014277,"n":"Guydelot","l":2002,"q":1}},{"type":"npc","id":"1014278","obj":{"i":1014278,"n":"Guydelot","l":2100,"q":1}},{"type":"npc","id":"1014280","obj":{"i":1014280,"n":"Mogta","l":52,"q":1}},{"type":"npc","id":"1014281","obj":{"i":1014281,"n":"Mogta","l":2100,"q":1}},{"type":"npc","id":"1014282","obj":{"i":1014282,"n":"Mogta","l":2100,"q":1}},{"type":"npc","id":"1014283","obj":{"i":1014283,"n":"Mogta","l":2100,"q":1}},{"type":"action","id":"3562","obj":{"i":3562,"n":"Sidewinder","c":2610,"j":23,"t":4,"l":60}},{"type":"item","id":"20659","obj":{"i":20659,"n":"Aoidos' Attire Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67253","obj":{"i":67253,"n":"A Saint of Song","g":151,"l":"The Dravanian Forelands","s":580,"f":1}},{"type":"quest","id":"68426","obj":{"i":68426,"n":"Three's a Company","g":151,"l":"South Shroud","s":601,"f":1}}]}