{"quest":{"name":"A Journey of Purification","location":"North Shroud","id":67256,"patch":3.0,"sort":520,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1013609,"target":1013610,"involved":[1013663],"genre":153,"journal":["Eschiva has uncovered a clue for your quest to purge the taint.","The taint was once borne to the Twelveswood via subterranean water veins, and Eschiva has reason to believe that it comes again in like manner. She bids you meet her at Camp Dragonhead in the central highlands of Coerthas, that you might investigate water veins in the area.","Eschiva has learned that a water vein passes beneath an area to the south. The fiends that lurk there have grown unnaturally aggressive of late, and Eschiva attributes this change to the taint's influence. A regiment of knights is currently on a mission to cull the frenzied creatures, and Eschiva suggests that you join them. Meet her at the specified spot south of Camp Dragonhead.","With your aid, the knights succeed in eliminating the frenzied creatures. The area thus secured, you may now purify the manifestation of the taint.","Immediately after you purify the taint, your soul crystal takes on a new radiance─a bestowal of power from A–Towa–Cant, if Eschiva is to be believed. Your companion goes on to posit that the act of purifying serves to empower the white mage. Return to Camp Dragonhead to discuss the next step of your mission with Eschiva.","Eschiva informs you that the headwater of the vein you just visited is situated further west, and through the city of Ishgard. While she conducts research on your next destination, take the time to accustom yourself with your newfound power, that you might be prepared for the challenges ahead.<br><br>※The next white mage quest will be available from Eschiva upon reaching level 54."],"objectives":["Speak with Eschiva at Camp Dragonhead.","Speak with Eschiva.","Purify the taint.","Speak with Eschiva.","Defeat the enemy!"],"dialogue":[{"name":"ESCHIVA","text":"You come at a good time, <span class=\"highlight\">Forename</span>. I believe I have found a clue in my grandfather's records."},{"name":"ESCHIVA","text":"There is a passage which tells of the time when the taint reached the forest via a subterranean water vein. Master A–Towa traced it back to its source at Abalathia's Spine, and there he purged the corruption."},{"name":"ESCHIVA","text":"Lest you wonder, 'tis the mention of the water vein that interests me. Allow me to explain."},{"name":"ESCHIVA","text":"Though the danger to the Twelveswood has become so dire as to elicit emphatic warnings from the great one, none of the Padjals or Hearers were aware of it."},{"name":"ESCHIVA","text":"If we then consider the great one's warning that the taint shall “flood” the forest, I am inclined to conclude that befouled aether is being conveyed via water veins."},{"name":"ESCHIVA","text":"Years have passed since Master A–Towa purged the taint. A new source of corruption may well have manifested in the intervening time."},{"name":"ESCHIVA","text":"First, I suggest we take our investigation to the central highlands of Coerthas, which form the southern edge of Abalathia's Spine. Pray meet me at Camp Dragonhead."},{"name":"ESCHIVA","text":"Everything is frozen over... I had read about the snow–swept mountains of Coerthas, but no amount of reading can substitute for seeing..."},{"name":"ESCHIVA","text":"I have a confession to make: this is my very first time setting foot outside the Twelveswood. The experience is proving to be at once fascinating and frightening. But I digress..."},{"name":"ESCHIVA","text":"While I awaited your arrival, I spoke with some of the knights about water veins. They say that one passes beneath the area just south of here."},{"name":"ESCHIVA","text":"The area happens to be thick with fiends. And these fiends happen to have grown unnaturally aggressive of late."},{"name":"ESCHIVA","text":"I would wager that the taint is to blame for this change."},{"name":"ESCHIVA","text":"A short while ago, a band of knights departed for the area in question on a mission to cull the unruly creatures. Shall we go and join them?"},{"name":"ESCHIVA","text":"My suspicions were correct─the taint has driven the fiends into a frenzy! Let us aid the knights, then see to the cleansing!"},{"name":"ESCHIVA","text":"There it is, <span class=\"highlight\">Forename</span>─the taint. I trust you know what to do."},{"name":"ESCHIVA","text":"This energy, soothing and pure... 'Tis precisely as my grandfather wrote..."},{"name":"ESCHIVA","text":"And your soul crystal─I believe it has taken on a new radiance!"},{"name":"ESCHIVA","text":"In all likelihood, the spirit of Master A–Towa within has bestowed upon you greater power."},{"name":"ESCHIVA","text":"I wonder... Could it be that the act of purifying serves to empower the white mage?"},{"name":"ESCHIVA","text":"If this is true, it makes the Padjals' refusal to leave the forest even more incomprehensible."},{"name":"ESCHIVA","text":"&lt;sigh&gt; How long will they allow their laws to dictate their actions to the detriment of reason?"},{"name":"ESCHIVA","text":"At any rate, there is naught more to do here. Let us return to Camp Dragonhead."},{"name":"ESCHIVA","text":"Let us review what we've learned. As we had suspected, the taint is being borne along subterranean water veins."},{"name":"ESCHIVA","text":"According to my grandfather's records, the headwater of the vein we just visited is situated further to the west."},{"name":"ESCHIVA","text":"Unfortunately, it lies beyond the Holy See of Ishgard. As foreigners, we will require special permission to pass through the city."},{"name":"ESCHIVA","text":"I shall contact Stillglade Fane and request to have the Elder Seedseer issue us with the necessary papers."},{"name":"ESCHIVA","text":"Of course, were one of the Seedseers here, we would not have to go through all this hassle."},{"name":"ESCHIVA","text":"We must pass through Ishgard proper to get there. Fortunately, travel restrictions have been eased since the Holy See was restored to the Alliance."},{"name":"ESCHIVA","text":"Be that as it may, we will be venturing into the unknown. Master A–Towa's journeys did not take him there, and there is no telling what awaits us. We must tread warily and be no less than fully prepared."},{"name":"ESCHIVA","text":"Had the Seedseers been willing to come, with your powers combined, we would have been able to go boldly forward. But there is no point in dwelling upon that now."},{"name":"ESCHIVA","text":"I shall survey the lay of the land in order to ascertain our next destination."},{"name":"ESCHIVA","text":"Meanwhile, I suggest you take the time to accustom yourself to your newfound power. I shall be here when you are ready to resume our mission."},{"name":"ESCHIVA","text":"I'll attend the fiends! Pray focus on mending our hurts!"},{"name":"ESCHIVA","text":"Curses! Fiends are being drawn to the taint!"},{"name":"ESCHIVA","text":"Is there no end to them!?"},{"name":"ESCHIVA","text":"The sprite! We must strike it down first!"},{"name":"ESCHIVA","text":"We're almost done!"},{"name":"ESCHIVA","text":"I was...unready..."}],"reward":{"gil":589,"action":3569,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":25}],"quests":[67255]},"next":[67257]},"partials":[{"type":"npc","id":"1013609","obj":{"i":1013609,"n":"Eschiva","l":57,"q":3}},{"type":"npc","id":"1013610","obj":{"i":1013610,"n":"Eschiva","l":63,"q":2}},{"type":"npc","id":"1013663","obj":{"i":1013663,"n":"Eschiva","l":63,"q":1}},{"type":"action","id":"3569","obj":{"i":3569,"n":"Asylum","c":2632,"j":24,"t":4,"l":52}},{"type":"quest","id":"67255","obj":{"i":67255,"n":"Taint Misbehaving","g":153,"l":"South Shroud","s":500,"f":1}},{"type":"quest","id":"67257","obj":{"i":67257,"n":"The Girl with the Dragon Tissue","g":153,"l":"Coerthas Central Highlands","s":540,"f":1}}]}