{"quest":{"name":"The Girl with the Dragon Tissue","location":"Coerthas Central Highlands","id":67257,"patch":3.0,"sort":540,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1013610,"target":1013614,"involved":[1011232,1011237,1013613,1013617,1013618],"genre":153,"journal":["Eschiva is ready to resume the mission to purge the taint.","Eschiva has completed the necessary preparations for the next leg of your mission, which will take you to the western highlands of Coerthas. She suggests that you first make a stop in the hamlet of Falcon's Nest, that you might gather information from the locals.","You rejoin Eschiva at Falcon's Nest. Having mused about her grandfather's journeys, she bids you speak with the locals and ask whether they know anything of the taint.","Much to your chagrin, the locals know nothing of the taint. However, they tell you that a foreign woman reeking of death has come through Falcon's Nest recently. Make your way to the northern entrance of Falcon's Nest and report your findings to Eschiva.","It appears your investigation will take you in the same direction as the foreign woman. Setting aside the question of coincidence in your mind, make your way to the northwestern corner of the western highlands, to the area south of the Slate Mountains, and rejoin Eschiva.","You and Eschiva find the foreign woman crouching over the remains of a dragon. At the end of an awkward conversation, the woman warns you to leave her alone. Who is this Alaqa, and what is her purpose? Though such questions plague you, for now you must focus on your mission. Eschiva believes that the taint has manifested nearby; find it and purify it.","You have succeeded in purifying the second manifestation of the taint. Rejoin Eschiva west of Banepool and relay the good tidings to her.","Eschiva is pleased to hear that the taint corrupts the area no more. Rather than stand out in the cold, she suggests you first return to Falcon's Nest to discuss recent events.","Though shaken by her meeting with the mysterious Alaqa, Eschiva is determined to continue the mission to rid the realm of the taint. While she resumes her investigation of water veins, continue honing your powers of purification, for they will be called upon again before long.<br><br>※The next white mage quest will be available from Eschiva upon reaching level 56."],"objectives":["Speak with Eschiva at Falcon's Nest.","Gather information at Falcon's Nest.","Speak with Eschiva.","Speak with Eschiva south of the Slate Mountains.","Find the taint and purify it.","Report to Eschiva.","Speak with Eschiva."],"dialogue":[{"name":"ESCHIVA","text":"I am terribly sorry for the wait, <span class=\"highlight\">Forename</span>."},{"name":"ESCHIVA","text":"It has taken a while, but our request to pass through Ishgard has been granted. We may now continue on to the western highlands."},{"name":"ESCHIVA","text":"It has taken a while, but I believe we are now armed with sufficient knowledge of our destination. Let us continue on to the western highlands."},{"name":"ESCHIVA","text":"First, I suggest we make a brief stop in Falcon's Nest. If there has been an anomaly in the area, the locals may be able to tell us something."},{"name":"ESCHIVA","text":"So this is Falcon's Nest... To think that architectural styles can differ so even within the same nation..."},{"name":"ESCHIVA","text":"Going to new places is a veritable <span class=\"emphasis\">feast</span> for the senses. Such wonders Grandfather must have beheld in his journeys with Master A–Towa..."},{"name":"ESCHIVA","text":"Ah, but such musings must wait─we have a task to do. Let us begin by speaking with the people here."},{"name":"ESCHIVA","text":"When you have finished, pray come and meet me at the hamlet's northern entrance."},{"name":"FORCHETAIX","text":"...The taint? Never heard of it. We've had a strange visitor, however─a foreign woman with the stench of death about her."},{"name":"FORCHETAIX","text":"Suspicious as she was, I decided to steal a peek at her belongings, and─<br>Unnngh... Forgive me, but the mere recollection of it is like to bring up my <span class=\"alternative-container\"><span class=\"alternative\">lunch</span><span class=\"alternative\">supper</span><span class=\"alternative\">breakfast</span></span>..."},{"name":"FORCHETAIX","text":"Anyway, after that, some few of us confronted her and demanded to know her purpose, but she refused to say a word. Nay, she looked straight through us with empty eyes and left the hamlet. As I recall, she was headed to the north and west. Wherever it is she has gone, we are well rid of her."},{"name":"TOURCENET","text":"I am unfamiliar with this taint of which you speak. We do consider dragons unclean, however."},{"name":"TOURCENET","text":"Speaking of the beasts, lately, there have been reports of a strange woman skulking about their remains. We are on the lookout for her, lest she prove to be a heretic."},{"name":"FORCHETAIX","text":"The foreign woman who reeked of death? After we confronted her, she left the hamlet and struck out to the north and west. We are well rid of her, I tell you."},{"name":"TOURCENET","text":"A strange woman has been skulking about dragon remains. Should you catch sight of her, we would thank you to inform us."},{"name":"ESCHIVA","text":"The rumors of this strange woman are on everyone's lips. This is likely but a coincidence, but it appears we are headed in the same direction as her."},{"name":"ESCHIVA","text":"There are water sources in the northwestern corner of the region─frozen lakes, to be precise─and I would take our investigation there."},{"name":"ESCHIVA","text":"I mislike the sound of this woman, and I'd sooner not cross paths with her, but we have a mission to fulfill. Let us keep moving."},{"name":"ESCHIVA","text":"Good gods! The stench is overpowering, even in this frigid clime!"},{"name":"ESCHIVA","text":"Um, forgive me for interrupting, but what are you doing?"},{"name":"ALAQA","text":"(-Malodorous Maiden-)Searching."},{"name":"ALAQA","text":"(-Malodorous Maiden-)Hmph... Rather more damaged than I would have liked, but it will serve. After all, the experiment proceeds apace."},{"name":"ESCHIVA","text":"Experiment? What in the heavens are you doing?"},{"name":"ALAQA","text":"(-Malodorous Maiden-)Why must I justify myself to you?"},{"name":"ESCHIVA","text":"W-Well, I suppose you have no obligation to do so. It's just not every day that I see someone, er, rummaging through a dragon's corpse."},{"name":"ALAQA","text":"(-Malodorous Maiden-)So I frighten you, then. You find me repulsive, like the rest of them."},{"name":"ESCHIVA","text":"N-No, you misunderstand! I didn't mean to give offense!"},{"name":"ESCHIVA","text":"Whatever you do is your business, to be sure, but it isn't safe to be alone out here."},{"name":"ALAQA","text":"(-Malodorous Maiden-)What would you suggest, then? That I find a stout protector like your friend? As if anyone would be willing to help me..."},{"name":"ALAQA","text":"(-Malodorous Maiden-)Hm? This aura you emanate... They sent you to hound me, haven't they? To remind that witch Alaqa that she has no place in the world!"},{"name":"ESCHIVA","text":"...Alaqa?"},{"name":"ALAQA","text":"I am warning you: leave me alone."},{"name":"ESCHIVA","text":"Well, that was certainly queer... I know not what compelled me to speak with that woman─Alaqa, I believed she called herself─but I must confess to being morbidly curious about her experiment. But I mustn't let myself be distracted─we have work to do."},{"name":"ESCHIVA","text":"Unless I am mistaken, the taint has manifested in this area. Let us split up and search for it."},{"name":"ESCHIVA","text":"Nothing so far. Keep searching, <span class=\"highlight\">Forename</span>."},{"name":"ESCHIVA","text":"You found the taint and purified it? Well done!"},{"name":"ESCHIVA","text":"Though, I cannot help but wonder: is it truly a coincidence that the taint chanced to have manifested where we met Alaqa?"},{"name":"ESCHIVA","text":"Brrr... Being frozen to the bone isn't conducive to conversation. Let us return to Falcon's Nest and warm ourselves before we discuss matters in earnest."},{"name":"ESCHIVA","text":"With your most recent effort, I sense that your powers continue to grow. Suffice it to say this is a boon to our cause."},{"name":"ESCHIVA","text":"The mission proceeds smoothly thus far. If we continue following the water vein, it should lead us to the source of the taint."},{"name":"ESCHIVA","text":"As for the stranger, Alaqa─never have I felt so unsettled in someone's presence."},{"name":"ESCHIVA","text":"The thought that she might be connected to the taint also bothers me, but until we know for certain, it avails us naught to dwell upon it."},{"name":"ESCHIVA","text":"For now, I shall resume my investigation of water veins and try to deduce other locations where the taint might appear."},{"name":"ESCHIVA","text":"Leave the investigative aspect of the mission to me, and pray continue honing your powers of purification. After all, no one else can purge the taint but you."}],"reward":{"gil":635,"action":3568,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":25}],"quests":[67256]},"next":[67258]},"partials":[{"type":"npc","id":"1013610","obj":{"i":1013610,"n":"Eschiva","l":63,"q":2}},{"type":"npc","id":"1013614","obj":{"i":1013614,"n":"Eschiva","l":2200,"q":2}},{"type":"npc","id":"1011232","obj":{"i":1011232,"n":"Tourcenet","l":2200,"q":5}},{"type":"npc","id":"1011237","obj":{"i":1011237,"n":"Forchetaix","l":2200,"q":2}},{"type":"npc","id":"1013613","obj":{"i":1013613,"n":"Eschiva","l":2200,"q":1}},{"type":"npc","id":"1013617","obj":{"i":1013617,"n":"Eschiva","l":2200,"q":1}},{"type":"npc","id":"1013618","obj":{"i":1013618,"n":"Eschiva","l":2200,"q":1}},{"type":"action","id":"3568","obj":{"i":3568,"n":"Stone III","c":2631,"j":24,"t":2,"l":54}},{"type":"quest","id":"67256","obj":{"i":67256,"n":"A Journey of Purification","g":153,"l":"North Shroud","s":520,"f":1}},{"type":"quest","id":"67258","obj":{"i":67258,"n":"The Dark Blight Writhes","g":153,"l":"Coerthas Western Highlands","s":560,"f":1}}]}