{"quest":{"name":"In the Wake of Death","location":"The Dravanian Forelands","id":67259,"patch":3.0,"sort":580,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1013623,"target":1013625,"involved":[1013624],"genre":153,"journal":["Eschiva is eager to share new information on Alaqa.","Eschiva informs you that Alaqa was recently seen heading west into dragon territory, most likely to continue her experiment. Make your own way west and join Eschiva at Avalonia Fallen, where you will attempt to pick up Alaqa's trail.","In the interests of expedience, Eschiva suggests that the two of you split up and look for Alaqa. Focus your search in the area north of Avalonia Fallen, and purify any manifestations of the taint you come upon.","You come upon a manifestation of the taint and purify it, but Alaqa does not appear to be in the area. Make your way to the west of Avalonia Fallen and rejoin Eschiva.","You arrive to find Eschiva on her knees, Alaqa standing before her. A heated exchange ensues between the two women, during which Alaqa admits to creating the taint for her experiment. Eschiva bids you stop her, but you are interrupted by fiends drawn to befouled aether. Defeat them, and purify the taint that has manifested.","You have defeated the fiends and purified the taint. Turn your attention to Eschiva and offer her your assistance.","You show Eschiva the peculiar hunk of flesh you found in the aftermath of battle─in all likelihood something from Alaqa's twisted experiment. At your urging, Eschiva agrees to take this discovery to the Seedseers and petition their aid."],"objectives":["Speak with Eschiva.","Find the taint and purify it.","Rejoin Eschiva.","Purify the taint.","Assist Eschiva."],"dialogue":[{"name":"ESCHIVA","text":"Good tidings, <span class=\"highlight\">Forename</span>! I have acquired definite information on Alaqa!"},{"name":"ESCHIVA","text":"As before, the stench of death gave her away─a hunter she chanced to walk near couldn't help but notice the smell. When she realized that she was being observed, she quickly turned her steps west, towards dragon territory."},{"name":"ESCHIVA","text":"The hunter shouted a warning, but she continued on heedless. In light of her...inclinations, I daresay she has business there."},{"name":"ESCHIVA","text":"There is an area called Avalonia Fallen to the west. Let us head in that direction and try to pick up Alaqa's trail."},{"name":"ESCHIVA","text":"Hm, no signs of Alaqa... And the area beyond is fraught with danger─not even hunters dare venture in."},{"name":"ESCHIVA","text":"I would sooner not wander these parts without some guarantee that Alaqa is near, but we cannot afford to delay lest she elude us completely."},{"name":"ESCHIVA","text":"Let us split up and search. If you would focus on the area to the north, I shall follow the highroad west."},{"name":"ESCHIVA","text":"Oh, and do keep an eye out for the taint. If Alaqa is here, it is like to have manifested."},{"name":"ESCHIVA","text":"Nothing here thus far. Please focus your search on the area to the north."},{"name":"SYSTEM","text":"Alaqa is not here. Rejoin Eschiva on the westbound highroad."},{"name":"ALAQA","text":"You should not have startled me."},{"name":"ALAQA","text":"You..."},{"name":"ALAQA","text":"I see. You are the one who undid my work."},{"name":"ALAQA","text":"Why do you interfere with my experiment?"},{"name":"ESCHIVA","text":"So it <span class=\"emphasis\">was</span> you who created the taint!"},{"name":"ALAQA","text":"...The taint, you say? An insult born of ignorance. What you so callously destroyed is a wellspring of life-giving aether."},{"name":"ESCHIVA","text":"(-Eschiva-)What are you saying? The taint is <span class=\"emphasis\">befouled</span> aether! It <span class=\"emphasis\">destroys</span> life!"},{"name":"ALAQA","text":"So you choose to cling to your ignorance, like all the others. But it matters not what you think. When my experiment is complete, all the fools who tormented me and mine shall get their comeuppance."},{"name":"ESCHIVA","text":"No! We won't let you continue your twisted experiment! <span class=\"highlight\">Forename</span>, stop her!"},{"name":"ALAQA","text":"I believe you have more pressing concerns."},{"name":"ALAQA","text":"Drawn to the aether, I shouldn't doubt─or the taint, as you insist on calling it. But such details are immaterial. By whatever name it is known, I shall fill the world with it and have my revenge!"},{"name":"ALAQA","text":"Do <span class=\"emphasis\">not</span> interfere. Consider this your final warning."},{"name":"SYSTEM000","text":"You find a peculiar hunk of flesh on the ground."},{"name":"ESCHIVA","text":"Thank you, <span class=\"highlight\">Forename</span>. Again, you have saved me, and again, I am reminded of my own weakness..."},{"name":"ESCHIVA","text":"Hm? What do you have there?"},{"name":"ESCHIVA","text":"Ugh, 'tis well I skipped my last meal... I'd wager this is part of Alaqa's experiment."},{"name":"ESCHIVA","text":"The Seedseers may be able to glean something from it...and yet I find myself loath to seek them out."},{"name":"ESCHIVA","text":"They haven't lifted so much as a finger to help us. What can we expect of them now?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We should consult them anyway."},{"name":"A1","text":"Now is not the time to be stubborn."},{"name":"ESCHIVA","text":"You have the right of it, <span class=\"highlight\">Forename</span>. There is more at stake than a difference of opinion."},{"name":"ESCHIVA","text":"If we are to save the Twelveswood, we must needs turn to the Seedseers for aid. It's settled, then─we return to the Twelveswood."}],"reward":{"gil":634,"action":7430,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":25}],"quests":[67258]},"next":[67260]},"partials":[{"type":"npc","id":"1013623","obj":{"i":1013623,"n":"Eschiva","l":2000,"q":2}},{"type":"npc","id":"1013625","obj":{"i":1013625,"n":"Eschiva","l":2000,"q":1}},{"type":"npc","id":"1013624","obj":{"i":1013624,"n":"Eschiva","l":2000,"q":1}},{"type":"action","id":"7430","obj":{"i":7430,"n":"Thin Air","c":2636,"j":24,"t":4,"l":58}},{"type":"quest","id":"67258","obj":{"i":67258,"n":"The Dark Blight Writhes","g":153,"l":"Coerthas Western Highlands","s":560,"f":1}},{"type":"quest","id":"67260","obj":{"i":67260,"n":"Trials of the Padjals","g":153,"l":"The Dravanian Forelands","s":581,"f":1}}]}