{"quest":{"name":"When Gnaths Cry","location":"The Dravanian Forelands","id":67252,"patch":3.0,"sort":560,"icon":100437,"unlocksFunction":1,"eventIcon":71341,"issuer":1014232,"target":1014231,"involved":[1014238,1014248,1014249,1014251,1014252,1014253,1014254,1014255,1014256,1014257,1014260,1014261],"genre":151,"journal":["Sanson is wearing an expectant look.","No sooner does Sanson inform you that Sylviel will soon return to Tailfeather than the scholar's hired sword rushes in bearing dire tidings: his master has been captured by the Gnath. With the denizens of Tailfeather unwilling to help, it falls to you to mount a rescue. First, Sanson suggests that you scout out the entrance to the stronghold of Loth ast Gnath.","You arrive at Loth ast Gnath to find that Sylviel's assistant has managed to flee to safety. Alas, his master is still being held by the beastmen. Together with your friends, you sally forth into the stronghold and succeed in freeing Sylviel from the clutches of the Gnath. Speak with Sanson north of Loth ast Gnath.","All members of Sylviel's survey party have been accounted for. Make your way back to Tailfeather and speak with Sanson.","According to Sylviel, Coerthan legend speaks of a saint of song in the heavens─an individual with transcendent mastery over poetry and verse─who can bring a battle to its conclusion with a song. As a gesture of gratitude, the scholar promises to investigate the legend further. And though Sanson is hopeful that this will lead you to the Ballad of Oblivion, Guydelot is not wholly convinced. The two exchange heated words, and Guydelot subsequently storms out of the settlement. Sanson believes that the bard will eventually come around, and asks for your patience in the meantime.<br><br>※The next bard quest will be available from Sanson upon reaching level 58."],"objectives":["Speak with Sanson outside Loth ast Gnath.","Speak with Sanson.","Rescue Sylviel!","Defeat the Gnath that bar your retreat!","Defeat the Gnath!"],"dialogue":[{"name":"GUYDELOT","text":"Life's too short to waste squabbling, eh? I'd argue it's also too short to waste on pompous prats."},{"name":"SANSON","text":"You come at a good time, <span class=\"highlight\">Forename</span>! Sylviel and his expedition are due to return any moment now."},{"name":"SOLDIER01716","text":"(-???-)Help! For gods' sakes!"},{"name":"SOLDIER01716","text":"Hear my tale, I beg you! A group of us were surveying ancient ruins when we stumbled into Gnath territory. The creatures took us captive─I was the only one who managed to flee."},{"name":"SANSON","text":"Tell me, is the leader of your party a man named Sylviel?"},{"name":"SOLDIER01716","text":"H-How did you know? But yes, I'm his hired sword. I ran back to Tailfeather as swiftly as my legs could carry me, but no one here is willing to help us."},{"name":"GUYDELOT","text":"And why the hells not?"},{"name":"SOLDIER01716","text":"Going into Gnath territory is tantamount to suicide. They warned us, but we ignored them, thinking we could manage. How wrong we were..."},{"name":"GUYDELOT","text":"There're people in need, <span class=\"highlight\">Forename</span>. Are we going to ignore their plight? Or are we going to lend them our aid?"},{"name":"Q1","text":"Rescue the survey team?"},{"name":"A1","text":"We can't abandon them."},{"name":"A1","text":"But of course!"},{"name":"GUYDELOT","text":"Heh, that was just a rhetorical question, but thanks for humoring me all the same! Aye, we'll go and rescue these people, and I'm sure you'd be no less enthused even if Sylviel weren't among them!"},{"name":"GUYDELOT","text":"As for you, friend─while we're off saving your employer's arse, I want you to tell the craven bastards here they're a bunch of craven bloody bastards!"},{"name":"SANSON","text":"Needless to say, I am coming as well. Let us begin by scouting the entrance to Loth ast Gnath."},{"name":"GUYDELOT","text":"So that's the Gnath, eh? Is it just me, or does it look like they're all wearing hats?"},{"name":"ASSUSTANT01716","text":"&lt;pant&gt; Please... They still have Master Sylviel..."},{"name":"SANSON","text":"This man is Sylviel's assistant. He managed to win free, but Sylviel is still being held within. Let us go and extricate him!"},{"name":"GUYDELOT","text":"Nothing to it!"},{"name":"ASSUSTANT01716","text":"Thank you ever so much!"},{"name":"SYLVIEL","text":"I did not think I would escape with my life."},{"name":"SANSON","text":"Are you all right, Master Sylviel?"},{"name":"SYLVIEL","text":"Aye. A little shaken, perhaps, but otherwise whole of body─a statement I am able to make thanks to your timely arrival. May I ask the names of my saviors?"},{"name":"SANSON","text":"I am Sanson, of the Order of the Twin Adder, and my companions are the bards <span class=\"highlight\">Forename</span> and Guydelot. We three are on a journey to find a legendary song. The Ballad of Oblivion, 'tis called, and we were given to understand that you may have knowledge of it."},{"name":"SANSON","text":"But this is not an ideal place for conversation. Let us first return to Tailfeather."},{"name":"GUYDELOT","text":"So, what's the next legendary feat on the agenda? A performance with moogles, perhaps?"},{"name":"ASSUSTANT01716","text":"I shudder to think what may have happened had you not come to our rescue."},{"name":"SYLVIEL","text":"I harbor no ill feelings towards the people of Tailfeather for forsaking us. We are outsiders, after all, and they owe us nothing."},{"name":"CHOCOBOHUNTERS01716","text":"So you're the heroes what went to the rescue, eh?"},{"name":"SANSON","text":"This hunter here wishes a word with us."},{"name":"CHOCOBOHUNTERS01716","text":"I won't keep you long─just wanted to say thanks for wakin' us up, is all. Tailfeather's made up o' folk who come here seekin' their fortune, you see, an' such folk tend to put themselves first."},{"name":"CHOCOBOHUNTERS01716","text":"But most of us are ashamed we didn't lift a finger to help them as were in need, an' we're determined to do better from now on. To be sure, gettin' called “craven bloody bastards” stung at first, but after the grumblin' died down, none could deny that it was the truth. An' that's all I wanted to say."},{"name":"SYLVIEL","text":"You certainly have a knack for moving people, my friends, though I suppose it is only to be expected of bards! But come, let us speak of the song you seek─the Ballad of Oblivion."},{"name":"SYLVIEL","text":"Coerthan legend speaks of a saint of song in the heavens. This saint is an individual with transcendent mastery over poetry and verse, and 'tis said that he can bring a battle to its conclusion with a song."},{"name":"SYLVIEL","text":"As for being in the heavens, I suspect it is a figurative expression, but I cannot say for certain at this juncture. I shall investigate the legend further─a small gesture of gratitude for having saved our lives."},{"name":"SANSON","text":"While we wait to hear from Master Sylviel, let us conduct our own investigation. Coerthan literature may yield us some clues."},{"name":"GUYDELOT","text":"If you ask me, it sounds like naught but a faerie tale. I'd wager that “heavens” is just a metaphor for a natural phenomenon. We've hit a dead end─I say we return to Gridania for now and look for other avenues."},{"name":"SANSON","text":"And if you ask me, I think it far too early to draw conclusions. I, for one, mean to continue searching until I find a definite answer. If you wish to abandon our mission, I'll not stop you."},{"name":"SANSON","text":"But know that you would be judged a deserter. You would lose your place in the Gods' Quiver...and that would be precisely what your superiors had intended."},{"name":"SANSON","text":"Look, Guydelot. You of all people must know the true reason they chose you for this mission. They wanted you out of the way! Your skills had naught to do with it!"},{"name":"SANSON","text":"And it isn't so different for me! I was a thorn in their side, demanding cooperation when they were loath to give it! They were pleased to be rid of me as well, yet naught would please them more than for us to come back empty-handed!<br>That is why we must succeed! That is why we must find the Ballad of Oblivion!"},{"name":"GUYDELOT","text":"If you want to find the song so badly, you can bloody well find it yourself. I've had a gutful."},{"name":"GUYDELOT","text":"You're no bard─I doubt you even understand what gives a song its power. Yet here you are gallivanting about searching for one."},{"name":"GUYDELOT","text":"To you, the Ballad of Oblivion is just a means to curry favor with the brass hats. Well, that's an insult to honest–to–gods bards like me and <span class=\"highlight\">Forename</span>."},{"name":"SANSON","text":"Oh, gods, what have I done? I did not mean to be antagonizing..."},{"name":"SANSON","text":"Though my pride won't let me tell him this, I know that Guydelot is a truly exceptional bard. With his skills married to my unit composition, I had hoped that we might prove our detractors wrong. Alas, my words failed to convey that intent."},{"name":"SANSON","text":"Given time, I believe that Guydelot will come around. I shall wait for him here. Meanwhile, I ask that you have patience with us."},{"name":"QIB","text":"Guydelot and I will draw them away! Please tend to Master Sylviel!"},{"name":"QIB","text":"Y-You are...?"},{"name":"QIB","text":"No time for chitchat! Hurry on out of here─we'll keep the Gnath occupied!"},{"name":"QIB","text":"You have my thanks!"},{"name":"QIB","text":"&lt;click&gt; &lt;click&gt; Intruders! To arms, to arms!"},{"name":"QIB","text":"Keep them away from Master Sylviel!"},{"name":"QIB","text":"Thank you. I shall be fine from here."},{"name":"QIB","text":"Let's finish off this lot and quit this place!"},{"name":"QIB","text":"Master Sylviel! Are you hurt?"},{"name":"QIB","text":"No more than a few scratches, thanks to you."},{"name":"QIB","text":"You must...fight on..."},{"name":"QIB","text":"Bugger... The rest is up to you..."},{"name":"QIB","text":"No... I am not...ready..."}],"reward":{"gil":866,"action":3560,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":24}],"quests":[67251]},"next":[67253]},"partials":[{"type":"npc","id":"1014232","obj":{"i":1014232,"n":"Sanson","l":2000,"q":3}},{"type":"npc","id":"1014231","obj":{"i":1014231,"n":"Sanson","l":2000,"q":1}},{"type":"npc","id":"1014238","obj":{"i":1014238,"n":"Guydelot","l":2000,"q":2}},{"type":"npc","id":"1014248","obj":{"i":1014248,"n":"Sanson","l":2000,"q":1}},{"type":"npc","id":"1014249","obj":{"i":1014249,"n":"Sanson","l":2000,"q":1}},{"type":"npc","id":"1014251","obj":{"i":1014251,"n":"Guydelot","l":2000,"q":1}},{"type":"npc","id":"1014252","obj":{"i":1014252,"n":"Guydelot","l":2000,"q":1}},{"type":"npc","id":"1014253","obj":{"i":1014253,"n":"Guydelot","l":2000,"q":1}},{"type":"npc","id":"1014254","obj":{"i":1014254,"n":"Sylviel","l":2000,"q":1}},{"type":"npc","id":"1014255","obj":{"i":1014255,"n":"Sylviel","l":2000,"q":1}},{"type":"npc","id":"1014256","obj":{"i":1014256,"n":"Parchment Bearer","l":2000,"q":1}},{"type":"npc","id":"1014257","obj":{"i":1014257,"n":"Parchment Bearer","l":2000,"q":1}},{"type":"npc","id":"1014260","obj":{"i":1014260,"n":"Parchment Bearer","l":2000,"q":1}},{"type":"npc","id":"1014261","obj":{"i":1014261,"n":"Tailfeather Hunter","l":2000,"q":1}},{"type":"action","id":"3560","obj":{"i":3560,"n":"Iron Jaws","c":2608,"j":23,"t":3,"l":56}},{"type":"quest","id":"67251","obj":{"i":67251,"n":"Requiem on Ice","g":151,"l":"Coerthas Western Highlands","s":540,"f":1}},{"type":"quest","id":"67253","obj":{"i":67253,"n":"A Saint of Song","g":151,"l":"The Dravanian Forelands","s":580,"f":1}}]}