{"quest":{"name":"Taint Misbehaving","location":"South Shroud","id":67255,"patch":3.0,"sort":500,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1006751,"target":1013609,"involved":[1002804,1006245,1007092,1013605,1013606,1013607,1013608],"genre":153,"journal":["Raya-O-Senna has a task of great import for you.","Trouble is afoot in the Twelveswood once more, and Raya–O has dire need of your aid. Do as she bids and meet her before the Guardian Tree in the Central Shroud.","At the Guardian Tree, Raya–O and A–Ruhn inform you of the unsettling change that has come over the great one. The elemental has taken to repeating the same warning that the taint shall flood the Twelveswood, but offers scant details. In order to learn about this threat, the Seedseers bid you seek out a former student of the legendary A–Towa–Cant. Make your way to Fallgourd Float, where the man is said to reside, and ask the locals to point you in his direction.","According to the denizens of Fallgourd Float, A–Towa–Cant's student passed away some years ago, and his granddaughter now tends his master's tomb in his stead. Make your way to Proud Creek, where the tomb is located, and find the granddaughter, a woman named Eschiva.","You arrive at the tomb to find Eschiva under attack from fiends, and you jump to her rescue. Having secured the area, turn your attention now to Eschiva.","Eschiva reads the Seedseers' missive, and is shocked to learn that the taint threatens the Twelveswood once more. The taint, she explains, is befouled aether, and it must be purged at the source. Make your way back to the Guardian Tree and be present for her meeting with the Seedseers.","The two Padjals are dismayed to learn that they must leave the Twelveswood if they are to defeat the taint. With their duties binding them to the forest, it falls to you to undertake the journey of purification, as the great A–Towa–Cant once did. Wishing to emulate her grandfather's deeds, Eschiva begs to join you on your journey. Speak with her again to reaffirm her intent.","Eschiva would make plans for the journey ahead, and invites you to meet her at Fallgourd Float.","At Fallgourd Float, Eschiva openly expresses her displeasure at the two Seedseers for their unwillingness to act. Having given vent to her irritation, she promises to scour her grandfather's records for clues, and bids you see to your own preparations ahead of the grueling journey.<br><br>※The next white mage quest will be available from Eschiva upon reaching level 52."],"objectives":["Speak with Raya-O-Senna at the Guardian Tree.","Gather information at Fallgourd Float.","Search for Eschiva.","Deliver the Seedseers' missive to Eschiva.","Speak with Raya-O-Senna at the Guardian Tree.","Speak with Eschiva.","Speak with Eschiva at Fallgourd Float."],"dialogue":[{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>, you could not have come at a better time! We have dire need of your aid!"},{"name":"RAYAOSENNA","text":"There isn't time to explain. Know but that trouble is afoot, and I would ask you to meet me at the Guardian Tree."},{"name":"RAYAOSENNA","text":"Pray make haste to the Guardian Tree. I shall explain the situation when you arrive."},{"name":"ARUHNSENNA","text":"Thank you for coming on such short notice. We knew not who else we might turn to."},{"name":"RAYAOSENNA","text":"How fares the great one?"},{"name":"ARUHNSENNA","text":"Unchanged from before, I'm afraid. He repeats the same words, over and over."},{"name":"RAYAOSENNA","text":"Then it falls to us to glean their meaning. Very well."},{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>. You will recall the time we performed the Quieting and quelled the great one's rage. Since that day, we have continued communing with him to ensure that all is well. And it was, until recently."},{"name":"RAYAOSENNA","text":"I am afraid to say that an unsettling change came over the great one some days ago. He has taken to repeating the same words to us: “The taint floodeth the forest, its beating heart to befoul.”"},{"name":"ARUHNSENNA","text":"After some inquiries and research, we were able to learn that the great one has spoken these words before, during the time of A–Towa–Cant."},{"name":"ARUHNSENNA","text":"Immediately, we were made to wonder: when Master A–Towa embarked upon his journey of healing, could his purpose have been to protect the forest from the taint of which the great one now warns?"},{"name":"RAYAOSENNA","text":"We sought to delve further into this, but no accounts of Master A–Towa's journey are to be found at Stillglade Fane. Such records as exist are in the keeping of his foremost student, the mage who recovered his remains from O'Ghomoro."},{"name":"RAYAOSENNA","text":"If he is still alive, he may be able to assist us. We have prepared a missive, and we would ask that you deliver it into his hands."},{"name":"RAYAOSENNA","text":"After interring his beloved master, the man is said to have taken up residence at Fallgourd Float, that he might ever be near to tend the tomb. If he is there still, the locals should be able to point you in his direction."},{"name":"RAYAOSENNA","text":"While you see to this task, my brother and I shall remain here and continue observing the great one. My thanks in advance, <span class=\"highlight\">Forename</span>."},{"name":"RAYAOSENNA","text":"Whatever the taint is, it seems plain we must eliminate it."},{"name":"ARUHNSENNA","text":"It is deeply unsettling to see the great one behave so."},{"name":"RAYAOSENNA","text":"The people of Fallgourd Float should know where Master A–Towa's student might be found. I suggest you speak with them first."},{"name":"THIERRAND","text":"You seek Master A–Towa's former student? I am afraid he has departed for the realm yonder. His granddaughter now tends the tomb at Proud Creek in his stead."},{"name":"THIERRAND","text":"If truth be told, I am worried about her. The area is thick with fiends, and even experienced Wood Wailers avoid venturing there unaccompanied."},{"name":"SOMERHILD","text":"A–Towa–Cant's old student? Hm, I'd heard that someone's tending the tomb, but it's a young maid as I recall."},{"name":"AELUUIN","text":"That old fellow? I'm afraid he passed away some years ago. I remember him well, though. He took care of his master's tomb to the very end."},{"name":"THIERRAND","text":"His granddaughter Eschiva tends the place now, and she's been especially attentive since those accursed bandits came and defiled it."},{"name":"THIERRAND","text":"Though Master A–Towa's student is no longer with us, his granddaughter tends the tomb at Proud Creek in his stead. If truth be told, I am worried about her. The area is thick with fiends, and even experienced Wood Wailers avoid venturing there unaccompanied."},{"name":"SOMERHILD","text":"A–Towa–Cant's old student? Hm, I'd heard that someone's tending the tomb, but it's a young maid as I recall."},{"name":"THIERRAND","text":"The old fellow they say was A–Towa–Cant's student passed away some years ago. His granddaughter Eschiva tends the tomb now, and she's been especially attentive since bandits defiled it."},{"name":"ESCHIVA","text":"&lt;pant&gt; Th-Thank you so much... So focused was I on tending the tomb, I failed to notice the fiends approaching me..."},{"name":"ESCHIVA","text":"What? You're searching for the granddaughter of Master A–Towa's former student?"},{"name":"ESCHIVA","text":"Then you need search no more. I am Eschiva."},{"name":"ESCHIVA","text":"Know that I have taken on my grandfather's responsibilities. If it is within my power to help the Seedseers, then I should be glad to do so."},{"name":"ESCHIVA","text":"The taint threatens the Twelveswood? Nophica have mercy..."},{"name":"ESCHIVA","text":"As the Seedseers have surmised, 'twas to purge the taint that Master A–Towa journeyed the length and breadth of the realm."},{"name":"ESCHIVA","text":"Simply put, the taint is aether that has been befouled. If we are to be rid of it, we must find the source of the corruption and cleanse it."},{"name":"ESCHIVA","text":"The question is, are the Seedseers prepared to do as Master A–Towa once did?"},{"name":"ESCHIVA","text":"At any rate, it is best that I speak with them directly. I shall make my way to the Guardian Tree at once. "},{"name":"ARUHNSENNA","text":"A journey...outside the forest?"},{"name":"RAYAOSENNA","text":"The Seedseers know what they must do. But are they willing to do it?"},{"name":"RAYAOSENNA","text":"My thanks for finding Eschiva, <span class=\"highlight\">Forename</span>. She has told us all."},{"name":"ARUHNSENNA","text":"If we are to protect the Twelveswood from the taint, we must needs deal with the corruption at its source. Is that the way of it?"},{"name":"ESCHIVA","text":"It is. That was why Master A–Towa embarked upon his journey, heedless of his Padjali heritage."},{"name":"RAYAOSENNA","text":"And yet Master A–Towa was no ordinary Padjal... We are duty-bound to remain in the forest─we cannot simply leave it."},{"name":"ARUHNSENNA","text":"<span class=\"highlight\">Forename</span>. I am loath to ask this of you, after all you have already done for us, but the preservation of the Twelveswood is at stake."},{"name":"ARUHNSENNA","text":"You are not Padjali, and hence are not bound by the laws which bind us. Will you embark upon this quest in our stead?"},{"name":"ESCHIVA","text":"With all due respect, I cannot believe what I'm hearing! You would entrust the fate of the forest to an adventurer!?"},{"name":"RAYAOSENNA","text":"Calm yourself, and know that <span class=\"highlight\">Forename</span> is no ordinary adventurer. Nay, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is a white mage true, chosen by Master A–Towa himself to be his successor. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> bears his soul crystal and his legacy both."},{"name":"RAYAOSENNA","text":"I have every confidence that you will be able to purge the taint. As such, I would join my voice to my brother's request."},{"name":"ESCHIVA","text":"Master A–Towa's successor? That such an individual existed..."},{"name":"ESCHIVA","text":"I wish to make a request of my own. In his youth, my grandfather served Master A–Towa proudly, accompanying him wheresoever he went and assisting in purification rituals."},{"name":"ESCHIVA","text":"It has ever been my desire to emulate my grandfather's deeds. If <span class=\"highlight\">Forename</span> is to undertake this quest to eliminate the taint, I would likewise accompany and assist <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"RAYAOSENNA","text":"The journey will be fraught with peril. Are you willing to risk life and limb solely for the sake of emulating your grandfather?"},{"name":"ESCHIVA","text":"I am, my lady, but that is not the whole of it. I cannot sit idly by while a threat encroaches upon the Twelveswood. It is our home, and we each of us must do our part to protect it."},{"name":"RAYAOSENNA","text":"Our part..."},{"name":"RAYAOSENNA","text":"I see that your heart is true. Very well. Assuming that <span class=\"highlight\">Forename</span> consents─and I see no reason why <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would not─you have our blessing to accompany <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"RAYAOSENNA","text":"The fate of the Twelveswood is in your hands. We shall pray for your success."},{"name":"ARUHNSENNA","text":"'Tis no simple matter for a Padjal to leave the Twelveswood. Once again, we must rely upon you, my friend."},{"name":"RAYAOSENNA","text":"The fate of the Twelveswood is in your hands. We shall pray for your success."},{"name":"ESCHIVA","text":"We will need to make plans for the journey. Please come and see me at Fallgourd Float."},{"name":"ESCHIVA","text":"Hmph! And they call themselves Padjals!"},{"name":"ESCHIVA","text":"You wonder at my irritation, I shouldn't doubt. I suppose I ought to explain. You see, I was brought up on the tales of Master A–Towa's journeys─the sufferings he endured for the sake of the Twelveswood."},{"name":"ESCHIVA","text":"Young though I was, I was deeply touched by his courage and sacrifice, and to this day his deeds remain close to my heart. That is why it irks me that the Seedseers will not lift a finger to help the forest!"},{"name":"ESCHIVA","text":"But thankfully, we have you. As Master A–Towa's chosen, you are far more dependable than any Padjal alive."},{"name":"ESCHIVA","text":"Now then, let us speak of our journey. Grandfather left his records of Master A–Towa's journeys in my keeping. I shall scour them for clues as to where we must go."},{"name":"ESCHIVA","text":"While I do this, pray attend to your own preparations. I shall be here when you are ready to strike out."},{"name":"SYSTEM","text":"The next white mage quest will be available from Eschiva upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":770,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":25}],"questsType":"all","quests":[66620,65964]},"next":[67256]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1013609","obj":{"i":1013609,"n":"Eschiva","l":57,"q":3}},{"type":"npc","id":"1002804","obj":{"i":1002804,"n":"Aeluuin","l":57,"q":6}},{"type":"npc","id":"1006245","obj":{"i":1006245,"n":"Somerhild","l":57,"q":2}},{"type":"npc","id":"1007092","obj":{"i":1007092,"n":"Thierrand","l":57,"q":1}},{"type":"npc","id":"1013605","obj":{"i":1013605,"n":"Eschiva","l":57,"q":1}},{"type":"npc","id":"1013606","obj":{"i":1013606,"n":"Raya-O-Senna","l":54,"q":1}},{"type":"npc","id":"1013607","obj":{"i":1013607,"n":"A-Ruhn-Senna","l":54,"q":1}},{"type":"npc","id":"1013608","obj":{"i":1013608,"n":"Eschiva","l":54,"q":1}},{"type":"quest","id":"66620","obj":{"i":66620,"n":"Heart of the Forest","g":153,"l":"South Shroud","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67256","obj":{"i":67256,"n":"A Journey of Purification","g":153,"l":"North Shroud","s":520,"f":1}}]}