{"quest":{"name":"A Saint of Song","location":"The Dravanian Forelands","id":67253,"patch":3.0,"sort":580,"icon":100437,"unlocksFunction":1,"eventIcon":71341,"issuer":1014232,"target":1012077,"involved":[1014262,1014264,1014265,1014266,1014267,1014269,1014270,1014271,1014272],"genre":151,"journal":["Sanson is holding out for Guydelot's return.","As promised, Sylviel has looked into the Coerthan legend pertaining to a saint of song in the heavens. Alas, the information he provided is not as promising as Sanson had hoped, with “the heavens” most likely referring to a natural phenomenon, as Guydelot had suspected. Just when Sanson resigns himself to accepting that the legend is a dead end, you reveal to him the existence of a tribe of moogles in the Churning Mists. The revelation spurs him to continue his mission, and he begs you to show him to Moghome. Before striking out, he bids you leave a message with Sylviel for Guydelot, in the hopes that the wayward bard will rejoin you later.","To your surprise, you find Sylviel conversing with Guydelot, who apparently has been watching you and Sanson from afar. Upon hearing of the moogles of Moghome, Sylviel concedes that the legend may in fact be referring to the creatures, and urges Guydelot to settle his differences with Sanson and accompany him to the Churning Mists. For now, however, a promise to think on it is the best the bard can offer. Your message thus delivered, make your way to Anyx Trine and rejoin Sanson.","Sanson is eager to continue on to the Churning Mists. Lead the way to the summit of Sohm Al, and speak with your companion when you arrive.","Shortly after arriving at Moghome, Sanson declares his intent to seek an audience with the moogle chieftain. As he walks away, you catch a glimpse of what appears to be Guydelot, hiding behind a rock. Set aside that sighting in your mind for the time being, and join Sanson for his meeting with Moglin.","Moglin informs you that the Ballad of Oblivion is exceedingly dangerous, and hence is forbidden among mooglekind. In spite of his ominous words, however, he goes to great lengths to point you in the direction of a moogle bard named Mogta, who has also shown an interest in the song. Sanson bids you meet him outside Moghome to discuss the chieftain's curious behavior.","Whatever Moglin's intention may be, Sanson believes that there is no harm in seeking out Mogta. Search for the moogle bard at the specified location in Eil Tohm.","Mogta does not appear to be in the area. Take your search to another part of Eil Tohm.","Mogta does not appear to be in the area. Take your search to yet another part of Eil Tohm.","Mogta does not appear to be in the area. Take your search towards the Landlord Colony.","Just as you are about to give up searching for Mogta, the moogle stumbles into you. You quickly establish your shared interest in the Ballad of Oblivion, and he becomes a member of your expedition. Return to Moghome and receive Moglin's blessing to search for the forbidden song.","Moglin declares that your company is still missing a little something, and so withholds his permission for you to seek the Ballad of Oblivion. Sanson discerns that something to be Guydelot, at which time you finally reveal to him your earlier sighting of the bard near Moghome. Mogta is convinced that he likes Guydelot, and reassures Sanson that you will yet find him and together continue your mission.<br><br>※The next bard quest will be available from Sanson upon reaching level 60."],"objectives":["Speak with Sylviel.","Speak with Sanson at Anyx Trine.","Speak with Sanson outside Moghome.","Speak with Moglin at Moghome.","Speak with Sanson.","Search for Mogta.","Speak with Moglin."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Mountaintop Diplomacy.”"},{"name":"SANSON","text":"Ah, it's you, <span class=\"highlight\">Forename</span>. If you are wondering about Guydelot, I'm afraid I've not seen him since he stormed out."},{"name":"SANSON","text":"But I <span class=\"emphasis\">have</span> spoken with Master Sylviel. As promised, he looked into the Coerthan legend─the saint of song in the heavens─and he came to share his findings."},{"name":"SANSON","text":"Apparently, “the heavens” is a reference to a voice from the sky. It is most likely some form of natural phenomena, such as thunder and lightning."},{"name":"SANSON","text":"Which means that Guydelot was right. After all, what else could a voice from the sky be? It isn't as though there are people who dwell in the clouds, and love to sing besides."},{"name":"SANSON","text":"...What!? A tribe of moogles in the Churning Mists!? Why didn't you say so earlier!?"},{"name":"SANSON","text":"If these moogles are patrons of music like their forest-dwelling counterparts, they may well know of the Ballad of Oblivion. Please, you must show me to their village!"},{"name":"SANSON","text":"As for Guydelot... 'Twould seem he still requires time alone. But I daresay he will come after us once he hears we are on the right track."},{"name":"SANSON","text":"Might I trouble you to leave a message with Master Sylviel, informing Guydelot of our destination? I shall await you at Anyx Trine."},{"name":"GUYDELOT","text":"<span class=\"highlight\">Forename</span>!?"},{"name":"SYLVIEL","text":"Hah, 'twas but a matter of time before you found him. Lest you wonder, Guydelot has been watching you and Sanson from afar. Several times did he come to ask what I had been discussing with his friend."},{"name":"SYLVIEL","text":"...Moogles at the summit of Sohm Al? I was not aware of this. And I certainly wouldn't discount the possibility that the legend may in fact refer to the creatures."},{"name":"SYLVIEL","text":"Guydelot, you should settle your differences with Sanson and go to the Churning Mists with your friends. Being stubborn is wearisome business, you know."},{"name":"GUYDELOT","text":"Damn it... I want to, but...ugh... <span class=\"highlight\">Forename</span>, you always seem to know what's best. Tell me, what should I do?"},{"name":"Q1","text":"What will you say to Guydelot?"},{"name":"A1","text":"Come with us."},{"name":"A1","text":"..."},{"name":"GUYDELOT","text":"You reckon I should go as well, eh? I'll...I'll think on it."},{"name":"GUYDELOT","text":"You want me to think for myself, is that it? Well, then, I'll do just that."},{"name":"SYLVIEL","text":"I wasn't aware that moogles also dwell in the Churning Mists. And I certainly wouldn't discount the possibility that the legend may in fact refer to the creatures."},{"name":"SANSON","text":"Such an imposing structure... Were Guydelot here, he would doubtless be inspired to compose a song."},{"name":"SANSON","text":"From here on, I must rely upon you to lead the way. Let us ascend to the Churning Mists!"},{"name":"SANSON","text":"Such a magnificent view... I have no gift for verse. I must commit this scene to memory, that I might convey it all to Guydelot when next we meet."},{"name":"SANSON","text":"Now then, 'tis only meet that we first present ourselves to the chieftain of Moghome. Let us seek him out."},{"name":"SANSON","text":"Th-This is the chieftain? He has such...<span class=\"emphasis\">presence</span>."},{"name":"MOGLIN","text":"The Ballad of Oblivion... I had not expected to hear the name from you, kupo."},{"name":"MOGLIN","text":"It is a terrible, terrible song. Hence it is forbidden among mooglekind. Why, just earlier, I gave one of our bards a dressing-down simply for asking about it!"},{"name":"MOGLIN","text":"Ah, young Mogta... He was ever the inquisitive one. I hope he understands that I mean well. Lest you wonder, after being scolded, he flew off sulking and headed north of Moghome. That's <span class=\"emphasis\">Mogta</span>, and to the <span class=\"emphasis\">north</span>, kupo!"},{"name":"SANSON","text":"Hmmm... <span class=\"highlight\">Forename</span>, would you mind meeting up with me outside the village?"},{"name":"MOGLIN","text":"After his scolding, Mogta flew off sulking and headed north of Moghome. That's <span class=\"emphasis\">Mogta</span>, and to the <span class=\"emphasis\">north</span>, kupo!"},{"name":"SANSON","text":"Despite making much of the song's forbidden nature, it's clear that Chieftain Moglin wanted us to meet the moogle who shares our interest in it."},{"name":"SANSON","text":"What his motives are, I cannot say, but I see no harm in seeking out the bard of which he spoke. Twelve forbid you have forgotten this, but his name is Mogta, and he should be north of Moghome."},{"name":"SANSON","text":"No luck so far..."},{"name":"MOGTA","text":"Boneheaded...&lt;mumble&gt;...layabout...&lt;grumble&gt;...kupo."},{"name":"SANSON","text":"I cannot seem to find the little creature. And I was so certain that the chieftain had intended for us to seek him out..."},{"name":"MOGTA","text":"(-Skittish Moogle-)Kupopo!? P-Please don't eat me! I'm not nearly as sweet and succulent as I look!"},{"name":"SANSON","text":"Have no fear, little one. I promise we won't hurt you. Might you be Mogta, by any chance?"},{"name":"MOGTA","text":"You...you know my name? Who <span class=\"emphasis\">are</span> you?"},{"name":"MOGTA","text":"...You seek the Ballad of Oblivion? Why, I do believe we're looking for the same thing, kupo!"},{"name":"MOGTA","text":"Recently, I learned about the existence of a potent song. Legend says it resounds through the heavens and destroys all. Curious to know more, I went to ask the chieftain about it, but he told me off..."},{"name":"MOGTA","text":"It's beyond a single moogle to seek, he said. I need friends with me whom I trust, otherwise it'd be far too dangerous. Unfortunately, I have no friends, kupo..."},{"name":"SANSON","text":"Though we have only met, we share a common objective. Might we not seek the Ballad of Oblivion together─as friends?"},{"name":"MOGTA","text":"You...you would search with me?"},{"name":"MOGTA","text":"Oh, joy of joys! I have friends!"},{"name":"MOGTA","text":"Let's return to Moghome at once and have the chieftain tell us all about the song, kupo!"},{"name":"MOGTA","text":"I'm not alone, kupo!"},{"name":"SANSON","text":"I dare to hope that we will actually find the Ballad of Oblivion. Which just leaves the question of Guydelot..."},{"name":"MOGLIN","text":"Hmmm... That your hearts beat as one in this endeavor is plain to see. You are fit to look for the Ballad of Oblivion..."},{"name":"MOGLIN","text":"...Is what I would say, except you are still missing a little something─a small but vital piece. I can't quite put a paw on it, but your fellowship is incomplete without it, kupo!"},{"name":"SANSON","text":"Guydelot─<span class=\"emphasis\">he</span> is our missing piece. I believed that he would come back, but it seems I was wrong..."},{"name":"SANSON","text":"Is this true!? You caught sight of Guydelot here in the Churning Mists!?"},{"name":"MOGTA","text":"This Guydelot fellow─does he love music, kupo?"},{"name":"SANSON","text":"Aye, that he does. Like you, he is a bard, and he loves music with all his heart."},{"name":"MOGTA","text":"Then it's settled! Once Guydelot joins us, we'll embark upon our journey! Our band will be all the merrier for his company!"},{"name":"MOGTA","text":"If he's nearby, we're bound to find him. So please cheer up, kupo!"},{"name":"MOGLIN","text":"Until such time as your fellowship is whole, you may remain here as our guest, kupo."}],"reward":{"gil":855,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":24}],"quests":[67252]},"next":[67254]},"partials":[{"type":"npc","id":"1014232","obj":{"i":1014232,"n":"Sanson","l":2000,"q":3}},{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"npc","id":"1014262","obj":{"i":1014262,"n":"Sanson","l":2000,"q":1}},{"type":"npc","id":"1014264","obj":{"i":1014264,"n":"Sanson","l":2002,"q":1}},{"type":"npc","id":"1014265","obj":{"i":1014265,"n":"Sanson","l":2002,"q":2}},{"type":"npc","id":"1014266","obj":{"i":1014266,"n":"Sanson","l":2002,"q":1}},{"type":"npc","id":"1014267","obj":{"i":1014267,"n":"Sanson","l":2002,"q":1}},{"type":"npc","id":"1014269","obj":{"i":1014269,"n":"Guydelot","l":2000,"q":1}},{"type":"npc","id":"1014270","obj":{"i":1014270,"n":"Sylviel","l":2000,"q":1}},{"type":"npc","id":"1014271","obj":{"i":1014271,"n":"Mogta","l":2002,"q":1}},{"type":"npc","id":"1014272","obj":{"i":1014272,"n":"Mogta","l":2002,"q":2}},{"type":"quest","id":"67252","obj":{"i":67252,"n":"When Gnaths Cry","g":151,"l":"The Dravanian Forelands","s":560,"f":1}},{"type":"quest","id":"67254","obj":{"i":67254,"n":"The Ballad of Oblivion","g":151,"l":"The Churning Mists","s":600,"f":1}}]}