{"quest":{"name":"The Dark Blight Writhes","location":"Coerthas Western Highlands","id":67258,"patch":3.0,"sort":560,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1013614,"target":1013623,"involved":[1013619,1013620],"genre":153,"journal":["Eschiva has terrible news regarding the taint.","A troubled Eschiva informs you that the taint you earlier cleansed in the western highlands has reappeared. Consequently, the creatures nearby were driven into a frenzy once more, and they reportedly attacked a knight on patrol. Though the man managed to flee to the Convictory, he has suffered grievous wounds. And to compound matters, all of the camp's chirurgeons are afield and cannot readily return. Eschiva believes that you are his only chance for survival; do as she bids and make haste to the Convictory.","You arrive at the Convictory to find the wounded knight upon the ground, writhing in pain. Cast the Cure II spell on him and free him from his hurts.","Thanks to you, the knight will live. While Eschiva continues caring for him, make your way back to the taint that has reappeared west of Banepool, and purify it with extreme prejudice.","You succeed in purifying the taint a second time, shortly after which Eschiva arrives with information from the knight you saved. Before he was attacked, the man claims to have witnessed a woman fitting Alaqa's description heading west towards the Dravanian forelands. Convinced that Alaqa is somehow connected to the taint, Eschiva declares her intent to track her down. Make your own way to the Dravanian forelands and join her at the settlement of Tailfeather.","Eschiva informs you that a strange woman has been seen coming and going from Tailfeather. While Eschiva continues gathering information, dedicate yourself to honing your powers, that you might be prepared for the inevitable confrontation with Alaqa.<br><br>※The next white mage quest will be available from Eschiva upon reaching level 58."],"objectives":["Speak with Eschiva.","Cast Cure II on the wounded knight.","Purify the taint.","Speak with Eschiva at Tailfeather."],"dialogue":[{"name":"ESCHIVA","text":"Terrible news, <span class=\"highlight\">Forename</span>! The manifestation of the taint you purged here has reappeared!"},{"name":"ESCHIVA","text":"The fiends nearby were driven into a frenzy all over again, and they reportedly attacked a knight on patrol."},{"name":"ESCHIVA","text":"Though the man managed to flee to the Convictory, his wounds are grievous. And to compound matters, the camp's chirurgeons are all afield and cannot readily return."},{"name":"ESCHIVA","text":"You are his only chance, <span class=\"highlight\">Forename</span>. You must go to the Convictory and save him."},{"name":"ESCHIVA","text":"He is in a bad way. Please hurry and tend to his hurts."},{"name":"NOBLE01722","text":"I can't die... &lt;gasp&gt; What will become...of my family?"},{"name":"ESCHIVA","text":"He is in a bad way. Please hurry and tend to his hurts."},{"name":"NOBLE01722","text":"Th-The pain fades... I...I owe you a debt of gratitude..."},{"name":"ESCHIVA","text":"Thanks to you, the danger is past. However, he will still require constant care for a time."},{"name":"ESCHIVA","text":"I shall remain on hand to help provide it. Meanwhile, you must go and purify the taint that has reappeared west of Banepool."},{"name":"ESCHIVA","text":"Only you have the power to do so, <span class=\"highlight\">Forename</span>. Please hurry before it can cause any more harm!"},{"name":"ESCHIVA","text":"You must go and purify the taint that has reappeared west of Banepool. Please hurry before it can cause any more harm!"},{"name":"NOBLE01722","text":"You saved my life... Thank you..."},{"name":"ESCHIVA","text":"I'm pleased to say that the knight will make a full recovery. Had you not come to his aid, his comrades believe he would have died."},{"name":"ESCHIVA","text":"I see you have already purified the taint. Good work, <span class=\"highlight\">Forename</span>."},{"name":"ESCHIVA","text":"I must say, though, that its reappearance baffles me. It should have taken far longer for befouled aether to accumulate."},{"name":"ESCHIVA","text":"I am disinclined to believe that this came about by itself. Nay, I sense that someone had a hand in this."},{"name":"ESCHIVA","text":"I spoke with the knight after he had sufficiently recovered. Shortly before he was attacked, he caught sight of the foreign woman who reeks of death─Alaqa."},{"name":"ESCHIVA","text":"Wherever she appears, so too does the taint... I wasn't certain before, but now I'm convinced that it is no mere coincidence."},{"name":"ESCHIVA","text":"Could it be that she is creating the taint? If so, to what end? Why would she do such a thing?"},{"name":"ESCHIVA","text":"I know not her designs, but her actions cannot be borne."},{"name":"ESCHIVA","text":"Should the taint continue to manifest, both Coerthas and the Twelveswood would suffer unimaginable damage."},{"name":"ESCHIVA","text":"Stillglade Fane must know of this threat. I shall send word to them."},{"name":"ESCHIVA","text":"Though I shan't raise my hopes that the Seedseers will bestir themselves. Best to assume that we are on our own."},{"name":"ESCHIVA","text":"Now then, our priority now is to track down Alaqa. The knight said that she was headed west to the Dravanian forelands."},{"name":"ESCHIVA","text":"Let us take our search to the main settlement there─Tailfeather, I believe it's called."},{"name":"ESCHIVA","text":"I have spoken with a handful of locals. A strange woman has been witnessed coming and going, and with some regularity."},{"name":"ESCHIVA","text":"I'm reasonably confident that it is Alaqa, but I shall try to gather more information for good measure."},{"name":"ESCHIVA","text":"Something occurs to me, <span class=\"highlight\">Forename</span>. If Alaqa is indeed responsible for creating the taint, she'll not take kindly to our purifying it. It may well come to a confrontation."},{"name":"ESCHIVA","text":"Pray use this time to further hone your powers, for we shall have need of them ere long."}],"reward":{"gil":558,"action":3571,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":25}],"quests":[67257]},"next":[67259]},"partials":[{"type":"npc","id":"1013614","obj":{"i":1013614,"n":"Eschiva","l":2200,"q":2}},{"type":"npc","id":"1013623","obj":{"i":1013623,"n":"Eschiva","l":2000,"q":2}},{"type":"npc","id":"1013619","obj":{"i":1013619,"n":"Eschiva","l":2200,"q":1}},{"type":"npc","id":"1013620","obj":{"i":1013620,"n":"Wounded Knight","l":2200,"q":1}},{"type":"action","id":"3571","obj":{"i":3571,"n":"Assize","c":2634,"j":24,"t":4,"l":56}},{"type":"quest","id":"67257","obj":{"i":67257,"n":"The Girl with the Dragon Tissue","g":153,"l":"Coerthas Central Highlands","s":540,"f":1}},{"type":"quest","id":"67259","obj":{"i":67259,"n":"In the Wake of Death","g":153,"l":"The Dravanian Forelands","s":580,"f":1}}]}