{"quest":{"name":"The Stiff and the Spent","location":"Ishgard","id":67250,"patch":3.0,"sort":520,"icon":100437,"unlocksFunction":1,"eventIcon":71341,"issuer":1014208,"target":1014216,"involved":[1014215,1014217,1014218,1014219,1014220,1014221,1014222],"genre":151,"journal":["Irritation is writ plain on Sanson's face.","In annoyed tones, Sanson informs you that Guydelot is about to bring scandal upon your fellowship. Apparently, a local maiden ruffled his bard's pride when she told him that her sweetheart is fairer of voice than he is, and he has impulsively left the city in order to settle matters with the man─a knight of Ishgard. Sanson bids you come with him to Falcon's Nest, that you might stop Guydelot from doing something regrettable.","The knight in question is currently on patrol. Upon learning this, Guydelot struck out into the wilderness of the western highlands in order to find him. Sanson suggests that the two of you split up and track down the unpredictable bard. Focus your search on the area of Twinpools.","Contrary to expectation, you find Guydelot not confronting the knight, but helping him and his fellows fend off ferocious fiends. Assuring you that the situation is under control, he bids you tend to another horde of fiends beyond the rocky outcropping to the north.","You have defeated the fiends. Make your way back to Guydelot's location.","It is revealed that Guydelot's purpose in seeking the knight was not to challenge him, but rather, to deliver a nameday present and message from his sweetheart. Deeply grateful, the knight, Ser Alamenain, offers to assist in your search for the Ballad of Oblivion. He tells you of a woman who is said to send souls unto the heavens with a song, and believes that this song may be what you seek. With matters now settled after a fashion, make your way back to Falcon's Nest and rejoin Sanson.","Sanson takes Guydelot to task for his willful ways, but the bard does not seem especially repentant. While your two traveling companions continue inquiring after the Ballad of Oblivion, you must maintain your strength for the journey to come.<br><br>※The next bard quest will be available from Sanson upon reaching level 54."],"objectives":["Speak with Sanson at Falcon's Nest.","Search for Guydelot.","Lie in wait at the specified location and defeat any enemies that appear.","Speak with Guydelot.","Speak with Sanson at Falcon's Nest."],"dialogue":[{"name":"SANSON","text":"Gah, that Guydelot is worse than useless! Instead of helping with our inquiries, he spends all his time drinking and wenching, and now his indiscretion is about to get him─and us─into trouble! The gods see fit to bless him with a gift for song, but what does he do but use it to satisfy his base urges!?"},{"name":"SANSON","text":"&lt;sigh&gt; Pray forgive me my outburst. 'Tis towards Guydelot, and not you, that I should be giving vent to my annoyance. Allow me to explain the situation."},{"name":"SANSON","text":"Apparently, a maiden told Guydelot that her sweetheart is fairer of voice than he. That was enough to throw him into a fit of jealousy, and he rushed out of the city seeking to settle matters with this sweetheart, <span class=\"emphasis\">who happens to be a knight</span>."},{"name":"SANSON","text":"I am sure you can appreciate how swiftly this could descend into disaster. We must stop Guydelot before he does something stupid and gets us banished from Ishgard. Please come with me to Falcon's Nest and talk some sense into the fool!"},{"name":"SOLDIER01714","text":"Aye, a bard did come through a while ago. The fellow walked with a swagger, as you say."},{"name":"SANSON","text":"The knight in question is currently on patrol. Upon learning of this, Guydelot continued north into the wilderness to find him."},{"name":"SANSON","text":"I must add that the knight and his unit are late to return. It may be simply a coincidence...or it may be our witless friend has done something we'll live to regret."},{"name":"SANSON","text":"Whichever it is, we had best go and see for certain."},{"name":"SANSON","text":"I shall look for Guydelot around Gorgagne Mills. Pray focus your search on Twinpools, to the north and west."},{"name":"ALAMENAIN","text":"Stay back! Leave these fiends to us!"},{"name":"GUYDELOT","text":"Well, if it isn't <span class=\"highlight\">Forename</span>! Come to join the revelry, I shouldn't doubt."},{"name":"GUYDELOT","text":"The situation here's under control, but there's plenty more fiends to go around. Why don't you try checking beyond the rock to the north?"},{"name":"GUYDELOT","text":"There's plenty more fiends to go around. Why don't you try checking beyond the rock to the north?"},{"name":"ALAMENAIN","text":"That was a close call. We wouldn't have fared nearly as well had your friend not arrived."},{"name":"GUYDELOT","text":"Your sense of timing's superb, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Late enough to be stylish, but not too late to be useless."},{"name":"SANSON","text":"<span class=\"highlight\">Forename</span>! What has happened!?"},{"name":"SANSON","text":"...Guydelot did <span class=\"emphasis\">what</span>!? Why would he do such a dangerous thing!?"},{"name":"GUYDELOT","text":"Ser Alamenain, I presume. I've got something here for you─a nameday present from your sweetheart."},{"name":"ALAMENAIN","text":"From Abby? Hm, there's a message attached to it..."},{"name":"GUYDELOT","text":"'Tis well and good to do your duty, but you mustn't forget who you're fighting for. After all, you're about to have an extra mouth to feed."},{"name":"ALAMENAIN","text":"My Abby...is with child? Oh, Halone be praised! I'm to be a father! From this moment on, I must live not only for duty, but for my family!"},{"name":"SANSON","text":"Rushing out of the city, joining the battle against fiends... It was all for the sake of delivering the present and message?"},{"name":"GUYDELOT","text":"Aye, something like that. At the tavern, I heard tell of a knight who's versed in traditional songs. I went to his sweetheart to ask about him, but the poor lass was damn near inconsolable. The way she was pining for her dearest Alamenain, what was I to do but go and find the bloke?"},{"name":"ALAMENAIN","text":"Not only did you bring me the gladdest tidings <span class=\"emphasis\">of</span> my life, in coming to our aid, you most certainly <span class=\"emphasis\">saved</span> it besides. I can never repay this debt, but it shall not be for want of effort. Whatever it is you wish to know, I should be glad to assist you."},{"name":"SANSON","text":"We are searching for a legendary song said to hold the power to bring battles to an end. The Ballad of Oblivion, it is called. Are you perchance familiar with it?"},{"name":"ALAMENAIN","text":"I have heard rumors of a woman who sends souls unto the heavens with a song. Perhaps this is the song you seek? I shall look into it and send word should I learn something."},{"name":"SANSON","text":"Guydelot! Just because this ended well doesn't mean you're excused! You can't simply do whatever you please!"},{"name":"GUYDELOT","text":"...Whatever I please? I was <span class=\"emphasis\">adapting</span> to the situation─that happens to be sought after in a bard. An opportunity presented itself, and I grabbed it with both hands."},{"name":"SANSON","text":"Insufferable man... Brazen though it was, his action did save lives, so I shall overlook his lapse in judgment this once. Let us return to Falcon's Nest."},{"name":"GUYDELOT","text":"I swear, there's another lance up his arse that keeps him propped up."},{"name":"SANSON","text":"Lest you forget, we are a <span class=\"emphasis\">fellowship</span>! Members of a fellowship work <span class=\"emphasis\">together</span>! Do we have an understanding?"},{"name":"GUYDELOT","text":"Fight not the flow of life's river,♪<br>For you'll never arrive at the shoals.♪<br>Give your body and soul to the waters,♪<br>And Sanson the Stiff has no soul.♪"},{"name":"SANSON","text":"Stop that! I am trying to have a serious conversation!"},{"name":"GUYDELOT","text":"You know nothing, Sanson the Stiff. A bard must compose when inspiration takes him. I was trying to capture the virtue of tranquility, and you rudely interrupted me."},{"name":"GUYDELOT","text":"What about you, my friend? Have recent happenings kindled a verse within your heart?"},{"name":"GUYDELOT","text":"You see? <span class=\"highlight\">Forename</span>, too, was moved to compose a lovely little ditty!"},{"name":"SANSON","text":"Yes, yes, that was very beautiful...but I was talking about what it means to be a fellowship! We have much work to do, and I expect you to do your part, starting with our inquiries!"},{"name":"SANSON","text":"(-Guydelot-)I'm inquiring, aren't I? As I've already proven, there's plenty to be learned from the commonfolk. I'll leave you to deal with your own kind─the stuffy, highborn sort."},{"name":"SANSON","text":"We haven't yet heard from Ser Alamenain. Until such time as we do, I shall continue my own search for information. As before, pray keep up your strength for the journey ahead."}],"reward":{"gil":676,"action":3559,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":24}],"quests":[67249]},"next":[67251]},"partials":[{"type":"npc","id":"1014208","obj":{"i":1014208,"n":"Sanson","l":2300,"q":2}},{"type":"npc","id":"1014216","obj":{"i":1014216,"n":"Sanson","l":2200,"q":2}},{"type":"npc","id":"1014215","obj":{"i":1014215,"n":"Sanson","l":2200,"q":1}},{"type":"npc","id":"1014217","obj":{"i":1014217,"n":"Guydelot","l":2200,"q":1}},{"type":"npc","id":"1014218","obj":{"i":1014218,"n":"Guydelot","l":2200,"q":1}},{"type":"npc","id":"1014219","obj":{"i":1014219,"n":"Guydelot","l":2200,"q":2}},{"type":"npc","id":"1014220","obj":{"i":1014220,"n":"House Durendaire Knight","l":2200,"q":1}},{"type":"npc","id":"1014221","obj":{"i":1014221,"n":"Alamenain","l":2200,"q":1}},{"type":"npc","id":"1014222","obj":{"i":1014222,"n":"Alamenain","l":2200,"q":1}},{"type":"action","id":"3559","obj":{"i":3559,"n":"the Wanderer's Minuet","c":2607,"j":23,"t":4,"l":52}},{"type":"quest","id":"67249","obj":{"i":67249,"n":"On the Road Again","g":151,"l":"South Shroud","s":500,"f":1}},{"type":"quest","id":"67251","obj":{"i":67251,"n":"Requiem on Ice","g":151,"l":"Coerthas Western Highlands","s":540,"f":1}}]}