{"quest":{"name":"Drinking the Pain Away","location":"Ishgard","id":67264,"patch":3.0,"sort":5003,"eventIcon":71221,"issuer":1011192,"target":1014709,"involved":[1014707,1014708],"genre":96,"journal":["Gibrillont is never one to leave a patron fallen in the dumps.","A regular of the Forgotten Knight has fallen on hard times, and Gibrillont is counting on a bottle of mulled wine to grant him a few moments of solace. Take the bottle that Gibrillont has given you to the bibulous bloke in the basement.","You hand over the wine to the bibulous bloke, who still seems to be reeling at the recent course of events in his life. He tells you the lady of the noble house he served was accused of heresy, leading to a series of events that ultimately ruined the family and cost him his employment. But rather than drown his sorrows in wine, he asks that you take the bottle to his former lord, as a token of appreciation for allowing him to serve the family. Deliver the bottle of mulled wine to the title-stripped lord, who you are like to find near the airship landing.","You see the bottle of wine into the hands of the title-stripped noble. While he is touched at his former knight's concern, he has already resigned himself to the judgment of Halone, and has prepared to take an airship to parts unknown with his son. However, his son is missing, and he is starting to worry. He asks that you find his son before they are late for the flight.","You find the former noble's son standing not far from the Supreme Sacred Tribunal, where his mother stood trial. His father vowed to do all within his power to save the boy's mother and see justice served. Unfortunately, justice was not what they expected it to be. As the boy turns to leave for the airship landing, he cannot help but wish there was more he could have done to protect his mother."],"objectives":["Deliver the bottle of mulled wine to the bibulous bloke.","Deliver the bottle of mulled wine to the title–stripped noble.","Search for the title–stripped noble's son near the Tribunal."],"dialogue":[{"name":"GIBRILLONT","text":"Hey, you there. Would you mind taking this bottle of mulled wine to the gentleman downstairs?"},{"name":"GIBRILLONT","text":"He's a regular around here─and a rather affable one at that─but for a recent lack of employment, he's been looking to get deep in the cups. Thought I'd treat him to a mug of this today and keep a bit of weight in his coinpurse."},{"name":"GIBRILLONT","text":"A small gesture, I know, but he'll appreciate it. And between you and me, I think he could use a sympathetic ear right about now."},{"name":"TEARFILLEDSOLDIER01728","text":"How...how did this happen? ...I feel as if I'm trapped within some waking nightmare."},{"name":"TEARFILLEDSOLDIER01728","text":"What? What's this? No doubt from Gibrillont, that admirable bastard. Just what I need to drown my troubles."},{"name":"TEARFILLEDSOLDIER01728","text":"I was a knight in the service of a proud noble family. That is, until my dear lady was accused of heresy. Everything changed after that. Their prestige, their pedigree, everything was stripped away...including me."},{"name":"TEARFILLEDSOLDIER01728","text":"They say drinking is merely a pause from thinking... Would that I could take from a bottomless mug..."},{"name":"TEARFILLEDSOLDIER01728","text":"Nay, the only thing that stands to wash away is my dignity. Rather than play the drunken fool, I would like to make a gift of this to my lord. Surely this pain I bear is nothing next to his─completely unaware that his wife had committed such heinous crimes.<br>He is a good man. He deserves better, but this is all I can offer him now."},{"name":"TEARFILLEDSOLDIER01728","text":"I am loath to impose upon your kindness further, but could you take this to him in my place? To let him see me in my current state would be disgraceful. I imagine he is still at the airship landing in the Pillars."},{"name":"TEARFILLEDSOLDIER01728","text":"My lord is likely at the airship landing, but I fear it will not be long before he departs. Please hurry."},{"name":"ARISTOCRACYMAN01728","text":"Yes? Can I help you with something?"},{"name":"ARISTOCRACYMAN01728","text":"After all that has happened, he still thinks to put me first... Would that I could do more for him, but alas, I have lost nearly everything. My title, my land...my wife..."},{"name":"ARISTOCRACYMAN01728","text":"She was accused of heresy, and I did all within my power to advocate her innocence. But in the end there was naught I could do to forestall the hand of judgment. I was a man of great station, and yet I had never felt so low...so helpless."},{"name":"ARISTOCRACYMAN01728","text":"But the Fury has spoken, and to refuse Her is perhaps a greater crime than those thrust upon my beloved wife. Now, if you will excuse me, it is nearly time to─ Hm? Where did he run off to? I'm terribly sorry to trouble you, but would you help me look for my son? We can ill afford to be late."},{"name":"ARISTOCRACYMAN01728","text":"I doubt he has gone far. Please help me find him."},{"name":"ARISTOCRACYBOY01728","text":"Father is searching for me? Then it is time..."},{"name":"ARISTOCRACYBOY01728","text":"Forgive me. Father insisted we leave immediately, but I had to see for myself. This is where they took my mother to receive Halone's judgment. He said he would fight for her, that justice would be served..."},{"name":"ARISTOCRACYBOY01728","text":"But in the end, <span class=\"emphasis\">justice</span> took my mother away from us. Perhaps if I had been stronger, I could have won the battle that my father did not..."},{"name":"ARISTOCRACYBOY01728","text":"Well, I must be going... Good-bye, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>."}],"reward":{"gil":517,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67118]}},"partials":[{"type":"npc","id":"1011192","obj":{"i":1011192,"n":"Gibrillont","l":2300,"q":10,"t":"Forgotten Knight Proprietor"}},{"type":"npc","id":"1014709","obj":{"i":1014709,"n":"Title-stripped Noble's Son","l":2301,"q":1}},{"type":"npc","id":"1014707","obj":{"i":1014707,"n":"Bibulous Bloke","l":2300,"q":1}},{"type":"npc","id":"1014708","obj":{"i":1014708,"n":"Title-stripped Noble","l":2301,"q":1}},{"type":"quest","id":"67118","obj":{"i":67118,"n":"The Better Half","g":3,"l":"Ishgard","s":3}}]}