{"quest":{"name":"Trials of the Padjals","location":"The Dravanian Forelands","id":67260,"patch":3.0,"sort":581,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1013627,"target":1006751,"involved":[1013628,1013629],"genre":153,"journal":["Eschiva is ready to return to the Twelveswood to petition the Seedseers' aid.","Eschiva has given the hunk of tainted flesh over to your keeping. Make your way to Camp Tranquil in the South Shroud, and present it to Raya–O–Senna.","Having dared to hope that the Seedseers will bestir themselves, Eschiva is furious when it becomes evident that they mean to have you bear the burden of dealing with Alaqa. She storms off, and the two Seedseers are left to ponder her words. Though the law binds them to the forest, they concede that it will all count for naught if the people lose faith in them. For the time being, sit tight while A–Ruhn examines the piece of tainted flesh for clues.<br><br>※The next white mage quest will be available from Raya–O–Senna upon reaching level 60."],"objectives":["Deliver the tainted flesh to Raya–O–Senna at Camp Tranquil."],"dialogue":[{"name":"ESCHIVA","text":"Please hold on to the hunk of flesh. It is, er...<span class=\"emphasis\">safer</span> in your keeping."},{"name":"ESCHIVA","text":"Now then, let us return to Camp Tranquil and explain the situation to the Seedseers."},{"name":"ARUHNSENNA","text":"The great one's warnings have not abated. On the contrary, they have become more fervent."},{"name":"ESCHIVA","text":"The situation grows ever more dire, but will it be enough to spur the Seedseers to action?"},{"name":"RAYAOSENNA","text":"Ah, you are returned! How fares the effort to purge the taint?<br>...Hm? You wish to show us something?"},{"name":"RAYAOSENNA","text":"What does it tell us, Brother?"},{"name":"ARUHNSENNA","text":"The elementals are in trepidation of the flesh. It is infused with befouled aether, of this there can be no doubt."},{"name":"ARUHNSENNA","text":"And with the great one's warnings growing ever more fervent, it seems plain that this Alaqa continues to sow the taint."},{"name":"RAYAOSENNA","text":"Whatever it is she seeks to do, we must put a stop to it!"},{"name":"RAYAOSENNA","text":"A–Ruhn and I shall take a closer look at the flesh. In the meantime, you must resume your journey of purification."},{"name":"ESCHIVA","text":"What!? With all due respect─ Oh, to hells with respect! I can't believe what I'm hearing! You would send us back into the midst of danger, and with nary a word of counsel!?"},{"name":"RAYAOSENNA","text":"I know full well that we ask much of you, but there is none other upon whom we can depend."},{"name":"ESCHIVA","text":"Depend, you say? Instead of depending upon others, why don't you <span class=\"emphasis\">do</span> something for a change!? We all know that you both have the power to do so!"},{"name":"ESCHIVA","text":"Do you realize how much <span class=\"highlight\">Forename</span> has been through in your names?"},{"name":"ESCHIVA","text":"Oh, but of course you don't, because while <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> bled for you, you were hiding here with your heads in the treetops!"},{"name":"ESCHIVA","text":"If Master A–Towa were to see this, he would be turning in his grave!"},{"name":"RAYAOSENNA","text":"Heads in the treetops? What is the matter with her?"},{"name":"ARUHNSENNA","text":"To think that our own people see us in such a light..."},{"name":"RAYAOSENNA","text":"It cannot be helped, Brother─we are bound to remain in the forest. Things are not as they were during Master A–Towa's time."},{"name":"ARUHNSENNA","text":"Be that as it may, were the people to lose faith in us, for whom shall we convey the will of the elementals?"},{"name":"ARUHNSENNA","text":"Forgive me, <span class=\"highlight\">Forename</span>, but I would be alone. Rest assured I will take a closer look at the tainted flesh."},{"name":"RAYAOSENNA","text":"A-Ruhn has the right of it. It is our duty to facilitate harmony between man and elemental. All the laws of the forest count for naught if we fail in this."},{"name":"RAYAOSENNA","text":"At any rate, we must needs stop Alaqa's dark designs. And fear not, <span class=\"highlight\">Forename</span>. Henceforth, we will not leave you to bear the burden alone. Pray allow us the time to consider our next step."}],"reward":{"gil":507,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":25}],"quests":[67259]},"next":[67261]},"partials":[{"type":"npc","id":"1013627","obj":{"i":1013627,"n":"Eschiva","l":2000,"q":1}},{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1013628","obj":{"i":1013628,"n":"Eschiva","l":56,"q":1}},{"type":"npc","id":"1013629","obj":{"i":1013629,"n":"A-Ruhn-Senna","l":56,"q":1}},{"type":"quest","id":"67259","obj":{"i":67259,"n":"In the Wake of Death","g":153,"l":"The Dravanian Forelands","s":580,"f":1}},{"type":"quest","id":"67261","obj":{"i":67261,"n":"Hands of Healing","g":153,"l":"South Shroud","s":600,"f":1}}]}