{"quest":{"name":"Hands of Healing","location":"South Shroud","id":67261,"patch":3.0,"sort":600,"icon":100439,"unlocksFunction":1,"eventIcon":71341,"issuer":1006751,"target":1006751,"involved":[1013609,1013630,1013631,1013632,1013633,1013634,1013635,1013637,1013638,1013639],"genre":153,"journal":["Raya–O would call a meeting to discuss measures against the taint.","Raya–O informs you that she and A–Ruhn have conceived a plan to deal with the taint. Go and fetch Eschiva from Fallgourd Float, that they might share the particulars with everyone.","Eschiva is surprised that the Seedseers still wish to see her in spite of her earlier display. Deciding that she may have been too quick to judge them, she agrees to come with you to Camp Tranquil.","Much to Eschiva's relief, her words have reached Raya–O and A–Ruhn; the two Seedseers have resolved to leave the Twelveswood in order to help you purge the taint. With their heightened sensitivity to aether, they believe they can ascertain the site of Alaqa's experiment. Make your way to the Dravanian forelands, where you last saw Alaqa, and join Eschiva and the Seedseers at Tailfeather.","Shortly after arriving at Tailfeather, A–Ruhn senses an anomaly in the aether emanating from the northwest. A cavern called Mourn lies in that direction, along with a water vein, and the party decides to investigate it. Brave the dragon-infested area and search for Alaqa.","Deep within the cavern of Mourn, you find Alaqa just as she completes her experiment─an undead dragon whose existence is sustained by the taint. Upon confronting her, the Au Ra justifies her actions as self-preservation: her tribesmen have suffered much at the hands of the ignorant, and she desires but to protect them. Having said her piece, she unleashes her pet upon you, but you succeed in overcoming it and purifying the taint which gave it life. With her dreams of vengeance thus shattered, all of the fight goes out of Alaqa.","Though Alaqa must answer for her crimes, Raya–O offers her words of hope for the future. Watching on from a distance, A–Ruhn resolves to do as A–Towa–Cant once did and go wheresoever his powers are needed, be it to the ends of the world. With gratitude, he accepts Eschiva's offer to accompany him as he embarks upon his journeys.","The two Seedseers shall see the misguided Au Ra given over to the Wood Wailers. Afterwards, Raya–O bids you and Eschiva come to see her and A–Ruhn at Camp Tranquil, that they might properly thank you for your services to the Twelveswood.","You bid Eschiva farewell as she departs with A–Ruhn. Together with her siblings, Raya–O vows to continue preserving the harmony of the forest, protecting it from threats both within and without. With your newfound powers, go forth and shine the light of succor and solace across all the realm.<br><br>※The next white mage quest will be available from Raya–O–Senna once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Eschiva at Fallgourd Float.","Speak with Raya–O–Senna.","Speak with Eschiva at Tailfeather.","Search for Alaqa in Mourn.","Speak with Raya–O–Senna in Mourn.","Speak with Raya–O–Senna.","Speak with Raya–O–Senna at Camp Tranquil.","Defeat the zombie dragon!","Heal the stagnant aether to defeat the zombie dragon!"],"dialogue":[{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>! We have conceived a plan to deal with the taint!"},{"name":"RAYAOSENNA","text":"We would share the particulars with everyone; might I trouble you to fetch Eschiva?"},{"name":"RAYAOSENNA","text":"She will have returned to Fallgourd Float, I believe."},{"name":"RAYAOSENNA","text":"Pray return here after you have notified her. A–Ruhn and I shall be waiting."},{"name":"RAYAOSENNA","text":"We have conceived a plan to deal with the taint. Pray fetch Eschiva from Fallgourd Float, that we might share the particulars with everyone."},{"name":"ESCHIVA","text":"Oh, it's you, <span class=\"highlight\">Forename</span>. I must apologize for my earlier display."},{"name":"ESCHIVA","text":"The Seedseers wish to see me despite the disrespect I showed them? Though their ways baffle me, it cannot be denied that they care for the forest. Perhaps they deserve more credit than I give them."},{"name":"ESCHIVA","text":"I will go, of course. Let us strike out at once."},{"name":"ARUHNSENNA","text":"We each of us must do our part to protect the forest."},{"name":"RAYAOSENNA","text":"Worry not─I shall keep my tongue in check."},{"name":"RAYAOSENNA","text":"Our thanks for coming. Without further ado, let us begin."},{"name":"ARUHNSENNA","text":"After our last meeting, I went to the Guardian Tree and presented the tainted flesh to the great one."},{"name":"ARUHNSENNA","text":"His reaction was telling─the befouled aether it bears is identical to the taint which now threatens the Twelveswood. Unless we stop Alaqa, the forest will be reduced to a wasteland of death."},{"name":"ESCHIVA","text":"<span class=\"highlight\">Forename</span> gave me to understand that you have conceived a plan to deal with the taint. What is this plan?"},{"name":"RAYAOSENNA","text":"Simply put, A–Ruhn and I shall accompany you to the Dravanian forelands."},{"name":"RAYAOSENNA","text":"As you are doubtless aware, we Padjals are chosen by the elementals to convey their will. Should that will go unheard or be misinterpreted, harmony would be lost and tragedy inevitably befall."},{"name":"RAYAOSENNA","text":"In order to prevent this, we strive to hone our sensitivity to the elementals far beyond the limits of ordinary men. And this sensitivity allows us to perceive even the slightest fluctuations in the aether."},{"name":"RAYAOSENNA","text":"With our faculty for sensing aether, A–Ruhn and I shall ascertain the site of Alaqa's experiment. And once we find it, we will join our powers to <span class=\"highlight\">Forename</span>'s and purge the taint once and for all!"},{"name":"ESCHIVA","text":"You would leave the forest? But what of the will of the elementals?"},{"name":"ARUHNSENNA","text":"Rest assured we have obtained the Elder Seedseer's permission. Our sister shall see to it that the elementals do not go unheard during our absence."},{"name":"ARUHNSENNA","text":"But above all, your words struck home. We will not leave the two of you to bear the burden alone. We shall do all we can to aid you, as Padjals and white mages both."},{"name":"ESCHIVA","text":"You truly mean to leave the forest and help us?"},{"name":"ESCHIVA","text":"In the heat of the moment, I forgot myself and spoke out of turn. I pray you can forgive me."},{"name":"RAYAOSENNA","text":"There is naught to forgive. On the contrary, we are grateful to you for opening our eyes. Now, I trust we can rely upon you to guide the way?"},{"name":"RAYAOSENNA","text":"Listen, <span class=\"highlight\">Forename</span>. This will be our first time outside the forest, and we will most certainly make fools of ourselves. I would thank you not to enjoy yourself overmuch!"},{"name":"ESCHIVA","text":"I shall escort the Seedseers to Tailfeather. Pray meet us there."},{"name":"RAYAOSENNA","text":"With our powers combined, there is no taint that we cannot purge. Let us make for the Dravanian forelands at once!"},{"name":"ESCHIVA","text":"Pray leave the escorting of the Seedseers to me. I shall see you at Tailfeather."},{"name":"RAYAOSENNA","text":"I-I am doing just fine, thank you for asking! There is nothing to it!"},{"name":"ARUHNSENNA","text":"That everything should be so different..."},{"name":"RAYAOSENNA","text":"So here we are at Tailfeather. Why, the journey here wasn't nearly as daunting as I expected. I daresay we could have made it without Eschiva!"},{"name":"ARUHNSENNA","text":"Bold words coming from someone who fairly hugged our guide during the entire journey."},{"name":"RAYAOSENNA","text":"Ahem! S-Seeing as we are here, we ought to get to work! Do you sense anything, Brother?"},{"name":"ARUHNSENNA","text":"I do─an anomaly in the aether that wrenches the stomach... It emanates from the north and west."},{"name":"ESCHIVA","text":"A cavern lies in that direction─Mourn, 'tis called. And if memory serves, so too does a water vein. It seems to me that is where we must go."},{"name":"ESCHIVA","text":"I must warn you all, though, that the area is thick with dragons. We must proceed with caution."},{"name":"RAYAOSENNA","text":"D-Dragons, you say? Well, I for one would welcome the excitement! The journey thus far has been rather dull for my tastes!"},{"name":"ARUHNSENNA","text":"Dull suits us just fine, Sister. Remember, our priority is to purge the taint."},{"name":"RAYAOSENNA","text":"As if I would forget! The fate of the Twelveswood is at stake! Let us make haste to Mourn and confront Alaqa!"},{"name":"ESCHIVA","text":"The cavern of Mourn lies to the north and west. The area is home to dragons, so let us proceed with caution."},{"name":"ALAQA","text":"So, you are still alive."},{"name":"ALAQA","text":"Most intriguing─horns such as I have, yet you are not Au Ra... Well, whatever you are, you are no different from the others. You have come to interfere with my experiment. But know this: it is your ignorance that has led us down this path."},{"name":"ALAQA","text":"We Xaela are nomads who roam and live off the land. My tribe was no different. Yet though we did no harm to those whose lands we traversed, they treated us as vermin. In their ignorance, they feared us, and that fear manifested as spite and violence."},{"name":"ALAQA","text":"My loved ones and I were cursed at, spat upon, beaten, and worse. It was out of the desire to protect them that I began my research. Such pain we have suffered, I swore that I would visit upon the ignorant masses a hundredfold!"},{"name":"ALAQA","text":"And soon I shall fulfill my goal, for my experiment has finally borne fruit!"},{"name":"ALAQA","text":"To be sure, there is still work to be done; such robust flesh cannot be sustained by ordinary aether. Nay, it must needs be fed something far more potent─the taint."},{"name":"ALAQA","text":"My pet can go only where the taint exists, and so I shall fill the whole world with it!"},{"name":"ARUHNSENNA","text":"S-Sister! I sense naught but befouled aether from that dragon!"},{"name":"RAYAOSENNA","text":"This is without a doubt the source of the taint. We must needs purify it whole!"},{"name":"ALAQA","text":"You would get in the way of my vengeance? Then you shall be the first to feel my wrath!"},{"name":"ARUHNSENNA","text":"We all of us can accomplish far more than we dare imagine."},{"name":"ESCHIVA","text":"With the taint eliminated at the source, the Twelveswood is safe again."},{"name":"ALAQA","text":"No..."},{"name":"ALAQA","text":"My dreams... All gone to dust..."},{"name":"ALAQA","text":"I am powerless─powerless to protect my people, powerless to change anything..."},{"name":"RAYAOSENNA","text":"We are cowards, all of us. That which we do not understand instills fear within us, and so we lash out. In return, you sought to strike back at those who hurt you."},{"name":"RAYAOSENNA","text":"You have done terrible things, and must be held to account for your crimes."},{"name":"RAYAOSENNA","text":"But know that it is not too late to make amends. You still have a chance to atone."},{"name":"RAYAOSENNA","text":"Your knowledge may yet be used for good. You need but find a new purpose, and I should be glad to help you look for it."},{"name":"ARUHNSENNA","text":"With Alaqa apprehended, it seems safe to say that danger to the Twelveswood is past. And we owe it all to the two of you."},{"name":"ARUHNSENNA","text":"This experience has taught me much and more, not least of all how powerless I was in the face of an external threat."},{"name":"ARUHNSENNA","text":"If I am to protect the forest, I must needs spend less time with my head in the treetops and more with my feet on the ground. To that end, I shall strive to be a Padjal as Master A–Towa was, standing ready to journey to the ends of the world if needs be."},{"name":"ARUHNSENNA","text":"Were it not for your shining example, I never would have found the courage to come to this decision. I cannot thank you enough."},{"name":"ESCHIVA","text":"Master A–Ruhn. When the time comes for you to embark upon your journey, pray allow me to accompany you."},{"name":"ESCHIVA","text":"It isn't safe to travel alone, you know this to be true. Besides, you need someone to keep a record of all your deeds, that they might be passed on to future generations."},{"name":"ESCHIVA","text":"For all my bold words, I am still but a green sapling. Nevertheless, I would serve you faithfully as my grandfather once served Master A–Towa."},{"name":"ARUHNSENNA","text":"I should be heartened to have your company, Eschiva. I shall endeavor to be a Padjal worthy of your respect."},{"name":"ESCHIVA","text":"Thank you, Master A–Ruhn! I swear you'll not be disappointed in me!"},{"name":"ALAQA","text":"A new purpose..."},{"name":"RAYAOSENNA","text":"A–Ruhn and I shall escort Alaqa and place her in the Wood Wailers' care. Pray come and see us afterwards at Camp Tranquil─we would thank you properly."},{"name":"RAYAOSENNA","text":"A–Ruhn and I shall escort Alaqa and place her in the Wood Wailers' care. Pray come and see us afterwards at Camp Tranquil─we would thank you properly."},{"name":"ARUHNSENNA","text":"You have given me the courage to make a change. I cannot thank you enough."},{"name":"ESCHIVA","text":"I shall soon depart with Master A–Ruhn. I'm glad for this opportunity to see you again."},{"name":"RAYAOSENNA","text":"During the entire way back, Alaqa did not so much as favor us with a glance, but neither did she attempt to flee."},{"name":"RAYAOSENNA","text":"I believe there is hope for her yet. Till such time as she finds a new purpose, I shall visit her cell as often as my duties allow."},{"name":"RAYAOSENNA","text":"With the source of the taint banished, the great one's warnings have ceased. We may rest easy for a time."},{"name":"RAYAOSENNA","text":"Disaster has been averted thanks to you and Eschiva. We are eternally in your debt."},{"name":"ESCHIVA","text":"You are kind for saying so, my lady, but I have done scarcely anything. All your gratitude should be reserved for <span class=\"highlight\">Forename</span>."},{"name":"ESCHIVA","text":"Allow me to thank you as well, <span class=\"highlight\">Forename</span>. Had you not sought me out that day, I may never have found my true calling."},{"name":"ESCHIVA","text":"Beginning today, I shall accompany Master A–Ruhn as he works to maintain peace and harmony within the Twelveswood."},{"name":"ESCHIVA","text":"I know not where our journeys will take us, but when next we meet, I shall stand before you a stronger woman!"},{"name":"ARUHNSENNA","text":"We had best be on our way. Fare you well on your own journeys, <span class=\"highlight\">Forename</span>. I look forward to seeing you again, within the Twelveswood <span class=\"emphasis\">and</span> without!"},{"name":"RAYAOSENNA","text":"Well, they pretty much exhausted everything I had intended to say..."},{"name":"RAYAOSENNA","text":"So I shall say but this: I mean to do my part as well. Together with my siblings, I shall work to preserve the harmony of the forest, protecting it from threats both within and without."},{"name":"RAYAOSENNA","text":"As for you, <span class=\"highlight\">Forename</span> of the white─with your newfound powers, pray continue employing our art for the betterment of the realm!"},{"name":"RAYAOSENNA","text":"May the light of succor and solace shine wheresoever you may go!"},{"name":"SYSTEM","text":"This concludes the white mage quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next white mage quest will be available from Raya–O–Senna."},{"name":"ALAQA","text":"Kill them all, my lovely!"},{"name":"ESCHIVA","text":"It ends here, Alaqa!"},{"name":"RAYAOSENNA","text":"You'll not harm so much as another leaf!"},{"name":"ARUHNSENNA","text":"Vengeance is not the way!"},{"name":"ARUHNSENNA","text":"What? The befouled aether refuses to disperse!"},{"name":"ALAQA","text":"What is dead can never die!"},{"name":"RAYAOSENNA","text":"The power of healing, <span class=\"highlight\">Forename</span>! Use it to purify the stagnant aether!"},{"name":"ALAQA","text":"Souls of the damned! Render your essence unto my creation!"},{"name":"ESCHIVA","text":"This bodes ill! Strike down the undead first!"},{"name":"ARUHNSENNA","text":"It...it rises! All that healing, and it still wasn't enough!?"},{"name":"ALAQA","text":"It is no use! My pet cannot be slain!"},{"name":"ESCHIVA","text":"No! We won't give up!"},{"name":"RAYAOSENNA","text":"If it rises again, we have but to strike it down!"},{"name":"ESCHIVA","text":"Matron have mercy... It's coming back!"},{"name":"ARUHNSENNA","text":"We must focus on purifying it!"},{"name":"ALAQA","text":"Your feeble powers shan't avail you!"},{"name":"RAYAOSENNA","text":"We mustn't give up! Keep purifying!"},{"name":"ARUHNSENNA","text":"Confound it! The befouled aether still remains!"},{"name":"ALAQA","text":"How many times must I tell you? You struggle in vain!"},{"name":"RAYAOSENNA","text":"Hmph! We'll see about that!"},{"name":"RAYAOSENNA","text":"Hah! 'Twas but a matter of time!"},{"name":"ALAQA","text":"Nooo! You will not get in the way of my vengeance!"},{"name":"ESCHIVA","text":"It...it still returns!"},{"name":"ARUHNSENNA","text":"Ah, but the befouled aether is gone! We nearly have it!"},{"name":"ALAQA","text":"Souls of the damned! Come to our aid!"},{"name":"RAYAOSENNA","text":"More undead! Stay sharp!"},{"name":"ALAQA","text":"You know my suffering, yet you insist on standing in my way! Why!?"},{"name":"RAYAOSENNA","text":"Wake up, Alaqa! There is more to this than your own suffering!"},{"name":"RAYAOSENNA","text":"No... I cannot fall now..."},{"name":"ARUHNSENNA","text":"I was not...strong enough..."},{"name":"ALAQA","text":"F-Forgive me..."}],"reward":{"gil":1005,"action":3570,"items":[{"id":20661}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":25}],"quests":[67260]},"next":[67950]},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1013609","obj":{"i":1013609,"n":"Eschiva","l":57,"q":3}},{"type":"npc","id":"1013630","obj":{"i":1013630,"n":"A-Ruhn-Senna","l":56,"q":1}},{"type":"npc","id":"1013631","obj":{"i":1013631,"n":"Eschiva","l":56,"q":1}},{"type":"npc","id":"1013632","obj":{"i":1013632,"n":"Eschiva","l":2000,"q":1}},{"type":"npc","id":"1013633","obj":{"i":1013633,"n":"A-Ruhn-Senna","l":2000,"q":1}},{"type":"npc","id":"1013634","obj":{"i":1013634,"n":"Raya-O-Senna","l":2000,"q":1}},{"type":"npc","id":"1013635","obj":{"i":1013635,"n":"Alaqa","l":2000,"q":1}},{"type":"npc","id":"1013637","obj":{"i":1013637,"n":"Eschiva","l":2000,"q":1}},{"type":"npc","id":"1013638","obj":{"i":1013638,"n":"A-Ruhn-Senna","l":2000,"q":1}},{"type":"npc","id":"1013639","obj":{"i":1013639,"n":"Raya-O-Senna","l":2000,"q":1}},{"type":"action","id":"3570","obj":{"i":3570,"n":"Tetragrammaton","c":2633,"j":24,"t":4,"l":60}},{"type":"item","id":"20661","obj":{"i":20661,"n":"Orison Attire Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67260","obj":{"i":67260,"n":"Trials of the Padjals","g":153,"l":"The Dravanian Forelands","s":581,"f":1}},{"type":"quest","id":"67950","obj":{"i":67950,"n":"Unease in East End","g":153,"l":"South Shroud","s":601,"f":1}}]}