{"quest":{"name":"Dragons in the Mist","location":"The Sea of Clouds","id":67277,"patch":3.0,"sort":5005,"icon":100467,"eventIcon":71221,"issuer":1012059,"target":1012059,"involved":[1012053,1012056,1012057,1014846],"genre":97,"journal":["Gildon requires aid that he may embolden his comrades.","Gildon continues his quest to revitalize the spirit of Camp Cloudtop. To achieve this goal, he means to slay a dragon together with his men. This plan will fall through, however, if no dragons can be found in the area. Still waiting to be relieved from sentry duty, he asks that you gather information from the guards about Camp Cloudtop. Speak with the guards, then venture off in search of his prey.","You speak with the men standing guard about Camp Cloudtop. While none have seen leathery hide nor tail of dragons, one guard suspects they are being watched as they continue repairs of the <span class=\"emphasis\">Protector</span>. Search the area for what may be monitoring the camp and prepare yourself for the worst.","While hunting for dragons, you find a Vanu atop a cliff with a clear view of Camp Cloudtop. The Vanu engages you, but is no match for your long-proven skill in combat. Report back to Gildon and tell him of your findings.","You tell Gildon of the Vanu, but he is disappointed rather than surprised. Uninterested in the threat of Vanu, he continues his search for a way to motivate his men."],"objectives":["Gather information on dragon sightings.","Search the area for suspicious activity.","Report to Gildon."],"dialogue":[{"name":"GILDON","text":"If I cannot improve morale through food, then I will have to take more drastic measures. Yes, some heroic feat to rally the men and enliven their spirits. As they say, it is the idle man who is the miserable man."},{"name":"GILDON","text":"And for a man of Ishgard, what could be more heroic than slaying a dragon?"},{"name":"GILDON","text":"They say Camp Cloudtop is devoid of dragons, making it perfect for men of our lowly standing. But surely, at least <span class=\"emphasis\">one</span> dragon has found its way to this region, no?"},{"name":"GILDON","text":"I cannot leave my post just yet, so I must ask that you take up the search until I am able."},{"name":"GILDON","text":"First, I suggest speaking with the men around camp for a lead. When you've tracked one down, report back to me. I shall gather the men and head out to slay the foul beast."},{"name":"GILDON","text":"Ask around to see what information you can ascertain. And remember: if you should encounter a dragon, leave it be and report here immediately."},{"name":"CARIBAULT","text":"Dragons? Here near Camp Cloudtop? I'm afraid you may be wasting your time. What business would dragons have here?"},{"name":"CARIBAULT","text":"If it's dragons you want, you will not find them here. This sleepy little outpost has seen little action since its establishment."},{"name":"HARMIETTE","text":"You're looking for dragons? Hah! They wouldn't have assigned us here if they suspected such danger. We have the Vanu to contend with from time to time, but even <span class=\"emphasis\">we</span> can handle the likes of them."},{"name":"HARMIETTE","text":"Hmmm, but now that I think about it... Recently we've been finding what look like the scraps of something feeding on the local wildlife. But surely it was not the work of a dragon...right?"},{"name":"HARMIETTE","text":"Halone help us if dragons should come to Camp Cloudtop."},{"name":"JAUMINFREST","text":"When working to repair the <span class=\"emphasis\">Protector</span>, I cannot help but feel that something is watching us. Whoever or whatever it is, I wonder why they would concern themselves with a broken airship."},{"name":"JAUMINFREST","text":"If someone is, in fact, watching our movements, could this mean the Dravanians have found an ally here in Cloudtop?"},{"name":"VANUVANU01741","text":"Still no change. The field is calm like─hm!?"},{"name":"BALLOON","text":"Netherling will be cast into cloud sea!"},{"name":"GILDON","text":"How goes the search? Any word of dragons in Cloudtop?"},{"name":"GILDON","text":"No dragons, only Vanu? Well, I expected as much, to be sure, but I'm no less disappointed for it."},{"name":"GILDON","text":"What could they be watching? There's naught here of interest save for the <span class=\"emphasis\">Protector</span>, and even that is still in sore need of repairs. Do they perceive it to be a threat?"},{"name":"GILDON","text":"At any rate, there is little glory won from a scuffle with Vanu. But mark my words: I <span class=\"emphasis\">will</span> find a way to rekindle the fire in our men's hearts!"}],"reward":{"gil":574,"items":[{"id":10976,"one":1,"hq":1},{"id":11000,"one":1,"hq":1},{"id":11024,"one":1,"hq":1},{"id":11048,"one":1,"hq":1},{"id":11072,"one":1,"hq":1}],"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[67126,67276]},"next":[67285]},"partials":[{"type":"npc","id":"1012059","obj":{"i":1012059,"n":"Gildon","l":2100,"q":8}},{"type":"npc","id":"1012053","obj":{"i":1012053,"n":"Jauminfrest","l":2100,"q":1}},{"type":"npc","id":"1012056","obj":{"i":1012056,"n":"Caribault","l":2100,"q":5}},{"type":"npc","id":"1012057","obj":{"i":1012057,"n":"Harmiette","l":2100,"q":3}},{"type":"npc","id":"1014846","obj":{"i":1014846,"n":"Vanu Scout","l":2100,"q":1}},{"type":"item","id":"10976","obj":{"i":10976,"n":"Mythrite Earrings of Fending","l":115,"c":55326,"t":41,"p":8925}},{"type":"item","id":"11000","obj":{"i":11000,"n":"Mythrite Earrings of Slaying","l":115,"c":55326,"t":41,"p":8925}},{"type":"item","id":"11024","obj":{"i":11024,"n":"Mythrite Earrings of Aiming","l":115,"c":55326,"t":41,"p":8925}},{"type":"item","id":"11048","obj":{"i":11048,"n":"Mythrite Earrings of Healing","l":115,"c":55326,"t":41,"p":8925}},{"type":"item","id":"11072","obj":{"i":11072,"n":"Mythrite Earrings of Casting","l":115,"c":55326,"t":41,"p":8925}},{"type":"quest","id":"67126","obj":{"i":67126,"n":"Onwards and Upwards","g":3,"l":"Fortemps Manor","s":11}},{"type":"quest","id":"67276","obj":{"i":67276,"n":"Bargaining Chip","g":97,"l":"The Sea of Clouds","s":5004}},{"type":"quest","id":"67285","obj":{"i":67285,"n":"Unclear Motives","g":97,"l":"The Sea of Clouds","s":5006}}]}