{"quest":{"name":"Bargaining Chip","location":"The Sea of Clouds","id":67276,"patch":3.0,"sort":5004,"icon":100467,"eventIcon":71221,"issuer":1012059,"target":1012059,"involved":[1012054],"genre":97,"journal":["Gildon seeks an adventurer of exceptional renown.","Gildon is beside himself with disappointment at the state of affairs at Camp Cloudtop. As he tells it, the men and women stationed there are those found to be of little or no use elsewhere. This subtle form of demotion has left them disheartened, carrying out their duties with an empty sense of obligation. But Gildon is determined to reignite the fire in their bellies with proper nourishment. To achieve this goal, however, he must convince the quartermaster Fabrellet to make reforms to the shipment and distribution of provisions. Gildon believes Fabrellet will not listen to him, but may lend his ear to a reputable adventurer. Speak with Fabrellet, and see if he might relent on the issue.","You propose the idea of improving the camp's provisions, but behind your words, Fabrellet can only hear the rumblings of Gildon's stomach. Those discontent with what they are given are free to forage for themselves, and Fabrellet believes he should do just that. To ease Gildon into taking this initiative, or at the very least quell his rumbling belly, Fabrellet asks you to procure a particular variety of mushroom known to be both nutritious and filling.","You have found a cloud mushroom. Deliver it to Gildon that he may focus less on his hunger and more on his duties.","You deliver the cloud mushroom to Gildon, and his interest in your delectable offering nearly distracts him from the matter at hand─your talks with Fabrellet. Gildon is taken aback by Fabrellet's insinuation that he only means to satisfy a selfish desire for heartier meals. Though his plan bore no fruit, Gildon has not been deterred from his goal, and is determined to find a new way to reinvigorate the camp."],"objectives":["Speak with Fabrellet.","Obtain a cloud mushroom.","Deliver the cloud mushroom to Gildon."],"dialogue":[{"name":"GILDON","text":"I say, are you not the ward of House Fortemps I've heard so much about? Perfect! I have need of an adventurer of such repute."},{"name":"GILDON","text":"You see, Camp Cloudtop is a post for those who have, let us say, served beyond their usefulness. We do what we can to make the best of it, but I know the others are disheartened, that they take no pride in their duties."},{"name":"GILDON","text":"Though this place has robbed them of their vigor, they are yet proud men of House Haillenarte, and I refuse to let their spirits sour and their blades grow dull. How to do this has become my foremost concern."},{"name":"GILDON","text":"And then it dawned upon me─we <span class=\"emphasis\">must</span> improve the quality of food! Think about it. What morale can you expect of troops denied a hearty breakfast, lunch, and dinner? Surely better meals would go a long way in rekindling their spirits."},{"name":"GILDON","text":"But Fabrellet, our camp's quartermaster, would never hear of it─at least, not from me."},{"name":"GILDON","text":"But if he were to hear it from <span class=\"emphasis\">you</span>, an adventurer with your background, he would have to at least take it into consideration. I beg you, please speak some sense into him. For the camp!"},{"name":"GILDON","text":"I know this is a big favor I ask of you, but the men and women of Camp Cloudtop deserve better. Fabrellet is sure to consider the word of an accomplished adventurer such as yourself."},{"name":"FABRELLET","text":"You want <span class=\"emphasis\">what</span> for this camp? <span class=\"emphasis\">Heartier meals</span>? Don't tell me─Gildon sent you, didn't he?"},{"name":"FABRELLET","text":"It is no small feat having supplies shipped here, you know. Even the wealthiest nobles would be hard-pressed to afford constant deliveries of fresh foods to a place such as this. It simply cannot be done."},{"name":"FABRELLET","text":"If he's so dissatisfied with our provisions, he should forage and cook for himself. A number of our men are already doing just that."},{"name":"FABRELLET","text":"&lt;sigh&gt; He always was one to overindulge in his eating, and I fear hunger is clouding his judgment. But he's mistaken if he thinks I can freely request shipments of goods as I please."},{"name":"FABRELLET","text":"Might I ask a favor of you? Cloudtop is known for a nutritious─and surprisingly filling─variety of mushroom. I'd like you to find one and give it to Gildon for me. Perhaps then he'll find a way to sate his appetite on his own and leave me be."},{"name":"FABRELLET","text":"After you retrieve the cloud mushroom, pray deliver it directly to Gildon. With his stomach sated, I can only hope he can resume focusing on his duties. Safe travels, adventurer."},{"name":"GILDON","text":"So, how did you fare? Do you think Fabrellet has come around to see things our way?"},{"name":"GILDON","text":"My, what a delectable-looking mushroom you have there. So round, so plump... Ahem. I appreciate the offering, but why did you bring this to me? What of Fabrellet?"},{"name":"GILDON","text":"He said what!? How absurd, to think I would make such a request for selfish gains. The future of Camp Cloudtop is not to be taken lightly."},{"name":"GILDON","text":"That's not to say that I'm <span class=\"emphasis\">not</span> hungry, mind you. &lt;sigh&gt; I guess I cannot depend on him to help make change, after all. I'll have to think of something else..."},{"name":"GILDON","text":"Hmmm, maybe sautéed mushrooms, or mushroom soup... What? Oh, I'm merely thinking of, erm...meals for the men! Yes, of course."}],"reward":{"gil":517,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67126]},"next":[67277]},"partials":[{"type":"npc","id":"1012059","obj":{"i":1012059,"n":"Gildon","l":2100,"q":8}},{"type":"npc","id":"1012054","obj":{"i":1012054,"n":"Fabrellet","l":2100,"q":6}},{"type":"quest","id":"67126","obj":{"i":67126,"n":"Onwards and Upwards","g":3,"l":"Fortemps Manor","s":11}},{"type":"quest","id":"67277","obj":{"i":67277,"n":"Dragons in the Mist","g":97,"l":"The Sea of Clouds","s":5005}}]}