{"quest":{"name":"Made to Order","location":"The Sea of Clouds","id":67275,"patch":3.0,"sort":5002,"eventIcon":71221,"issuer":1013345,"target":1013345,"involved":[1011952,1012059,1012060],"genre":97,"journal":["Though the Rose Knight cook seems exhausted, the fire in her eyes tells of work to be done.","The Rose Knight cook has prepared packed meals for the men and women of Camp Cloudtop. In her old age, however, their delivery proves more difficult than she would care to admit. Determined to see her hard work is not wasted, she asks you to distribute three sets of packed meals in her stead. Pick up the packed meals and prepare to make your delivery.","You pick up the three sets of packed meals. See them safely to the knights of Camp Cloudtop.","You have delivered all of the packed meals, garnering you many thanks for temporarily relieving the resident cook of her duties. Head back and speak with the Rose Knight cook.","Though she lacks the vigor to jump for joy, her look of gratitude is unmistakable as she conveys the pleasure she takes in preparing their meals. Though the thinner air of the Sea of Clouds is harsh in her old age, she assures you a meal cooked by their hands is equally unkind, vowing to continue to work so long as she is able."],"objectives":["Pick up the packed meals for delivery.","Deliver the packed meals.","Report to the Rose Knight cook."],"dialogue":[{"name":"LUNCHCLERK01739","text":"Hello there, <span class=\"alternative-container\"><span class=\"alternative\">missy</span><span class=\"alternative\">laddie</span></span>. No doubt you've important work to attend to. Well, we all have a part to play. As a matter of fact, I should be handing out these meals, but these old bones don't move like they used to."},{"name":"LUNCHCLERK01739","text":"But as I said, we all have a part to play. And I can't very well keep the good men and women of Camp Cloudtop waiting."},{"name":"LUNCHCLERK01739","text":"I don't suppose you'd be willing to make a few deliveries in my stead, would you? The packages are clearly labeled. I can't offer much, but I will compensate you for your trouble."},{"name":"LUNCHCLERK01739","text":"Bless your heart. They're stationed close by, so it shouldn't take you long. Pray hurry─they're sure to be famished."},{"name":"LANIAITTE","text":"Ah, <span class=\"highlight\">Forename</span>. To what do I owe the honor of your presence this fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>?"},{"name":"LANIAITTE","text":"A delivery from the cook? I was all but certain there would be none today. You have my thanks. And give her my best regards."},{"name":"LANIAITTE","text":"I know she means well, but please remind her that she needs to rest. "},{"name":"MARIEL","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Can I help you with something?"},{"name":"MARIEL","text":"Oh, a meal from the cook! Why did she not come herself? Well, no matter. My thanks to you both."},{"name":"MARIEL","text":"I know she thinks herself something of a maid, but she's really more like family. The camp wouldn't be the same without her."},{"name":"GILDON","text":"Whatever it is, make it quick. I cannot leave my post unattended for long."},{"name":"GILDON","text":"Oh! A meal from the cook! That she makes such fine cuisine from seemingly deplorable rations is nothing short of a miracle. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. My compliments to the chef!"},{"name":"GILDON","text":"Love makes for the best seasoning. Give her my thanks for the fine meal!"},{"name":"LUNCHCLERK01739","text":"Welcome back. I take it by your empty hands their meals have been delivered. Excellent. Short though the trip may be, a few fulms feel like malms at my age. Heh heh."},{"name":"LUNCHCLERK01739","text":"It's worth it to see their smiling faces, though. I know they say I should take things easy, but age is no excuse for letting up on my duties."},{"name":"LUNCHCLERK01739","text":"I won't deny I've had second thoughts about staying, what with the thinner air here in the Sea of Clouds and all... But have you tried <span class=\"emphasis\">their</span> cooking? No one should have to suffer such unsavory fare, and they won't so long as I'm here."}],"reward":{"gil":433,"items":[{"num":3,"id":4647,"one":1},{"num":3,"id":4694,"one":1},{"num":3,"id":4750,"one":1}],"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67128]}},"partials":[{"type":"npc","id":"1013345","obj":{"i":1013345,"n":"Rose Knight Cook","l":2100,"q":1}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012059","obj":{"i":1012059,"n":"Gildon","l":2100,"q":8}},{"type":"npc","id":"1012060","obj":{"i":1012060,"n":"Marielle","l":2100,"q":6}},{"type":"item","id":"4647","obj":{"i":4647,"n":"Eft Steak","l":50,"c":24352,"t":46,"p":435}},{"type":"item","id":"4694","obj":{"i":4694,"n":"Buttons in a Blanket","l":50,"c":24206,"t":46}},{"type":"item","id":"4750","obj":{"i":4750,"n":"Mulled Tea","l":49,"c":24405,"t":46,"p":267}},{"type":"quest","id":"67128","obj":{"i":67128,"n":"Meeting the Neighbors","g":3,"l":"The Sea of Clouds","s":13}}]}