{"quest":{"name":"Memories in the Snow","location":"Coerthas Western Highlands","id":67270,"patch":3.0,"sort":5007,"icon":100466,"eventIcon":71221,"issuer":1014123,"target":1014123,"genre":94,"journal":["Sigan is reminiscing about the past.","Sigan tells you that he collects antiques from the now-buried village at Falcon's Nest from the Sixth Astral Era. He explains that the villagers' belongings are all buried deep beneath the snowdrifts. He asks you to keep a keen eye out for any relics buried in the snow.","You have found several artifacts from the Sixth Astral Era. Return them to Sigan.","Sigan graciously accepts your finds. The Holy See's restoration of Falcon's Nest has completely changed the area. The old village he once called home has been left beneath the snow, while the fortress grows taller and more imposing than ever before."],"objectives":["Recover artifacts.","Deliver the artifacts to Sigan."],"dialogue":[{"name":"SIGAN","text":"That feather you gave me─I'd not seen one of those in a long, long time. It brought back memories..."},{"name":"SIGAN","text":"The village here grew, years ago, around the barracks housing the Ishgardian scouting forces. It may have been a small village, but it had a long and rich history."},{"name":"SIGAN","text":"Being so close to the Dravanian border, it had its fair share of legend and wisdom passed down from generation to generation."},{"name":"SIGAN","text":"But after the Calamity─and the freezing winds it brought─the whole village was lost to the ice."},{"name":"SIGAN","text":"Thanks to House Dzemael, the fortress's reconstruction is progressing rapidly. But the village─and all the belongings left behind in the Calamity's aftermath─still lies deep beneath the snow. I'd wager that feather ornament you found was previously dug up around here."},{"name":"SIGAN","text":"I seek out and collect relics from before the Calamity. Everyone is so focused on rebuilding, nobody seems to care but one jot for the past."},{"name":"SIGAN","text":"I suppose I ought to get back out there and sift through those snowdrifts. If you find anything out there yourself, let me know."},{"name":"SIGAN","text":"If you find something out there in the snow─something from before the Calamity─let me know."},{"name":"SIGAN","text":"You actually found something?"},{"name":"SIGAN","text":"Maybe you really know how I feel. Maybe you're just helping an old man out of pity. Whichever it is, I still owe you my thanks."},{"name":"SIGAN","text":"I've never been happier than when they first started talking about rebuilding Falcon's Nest. I thought I'd finally have the old village back."},{"name":"SIGAN","text":"Of course, the Holy See wasn't interested in the village at all. They just wanted their fortress. And now it's bigger and grander than ever before."},{"name":"SIGAN","text":"The Falcon's Nest I knew─that small village I grew up in─it's been lying under all this snow ever since the Calamity."},{"name":"SIGAN","text":"All the villagers who could never return home─they've all had to move to the capital... It's for them that I'm still digging through all this snow, trying to recover that lost history."}],"reward":{"gil":489,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[67119,67269]},"next":[67281]},"partials":[{"type":"npc","id":"1014123","obj":{"i":1014123,"n":"Sigan","l":2200,"q":3}},{"type":"quest","id":"67119","obj":{"i":67119,"n":"Over the Wall","g":3,"l":"Fortemps Manor","s":4}},{"type":"quest","id":"67269","obj":{"i":67269,"n":"Stolen Goods","g":94,"l":"Coerthas Western Highlands","s":5006}},{"type":"quest","id":"67281","obj":{"i":67281,"n":"A Mystery Illness","g":94,"l":"Coerthas Western Highlands","s":5008}}]}