{"quest":{"name":"Lonely Vigil","location":"Coerthas Western Highlands","id":67289,"patch":3.0,"sort":5102,"eventIcon":71221,"issuer":1013347,"target":1013347,"genre":94,"journal":["The spiteful knight is staring wistfully out over the frozen lake.","A knight reflects upon the great battles once fought over the Dusk Vigil. The remains of those who fell in combat rest peacefully at the bottom of the lake, but gelati now wander its surface, sullying their memory and marring the lake's beauty. He bids you slay these disrespectful monsters.","You slay the gelati as requested. Let the knight know that the resting place of his brothers-in-arms is a little bit more tranquil now.","The old veteran thanks you for your work. Without the gelati obscuring his vision, the great lake surrounding the Dusk Vigil once more appears like it did in the days of his youth."],"objectives":["Slay gelati.","Report to the knight."],"dialogue":[{"name":"OLDSOLDIER01753","text":"Hmph. Don't see many adventurers out this way... I was just looking out over Banepool."},{"name":"OLDSOLDIER01753","text":"Great battles were fought at this fortress. But no matter how brutal, no matter how much blood was spilt, this lake always waited patiently to swallow all within its tranquil waters."},{"name":"OLDSOLDIER01753","text":"The Calamity changed all that. The lake has frozen over and slimy, godsdamned beasts wander its surface without a shred of respect... And I won't stand for it."},{"name":"OLDSOLDIER01753","text":"I no longer have my old strength, or I'd drive these slimes away myself. Do an old man a favor and teach some of these gelati a lesson. Slaughter them, such that I might have another glimpse of the lake as it once was."},{"name":"OLDSOLDIER01753","text":"Slaughter those horrid slimy creatures. Let me enjoy the lake without those eyesores all over it."},{"name":"OLDSOLDIER01753","text":"You needn't say anything─your actions speak loud enough. You have my thanks. Seems some adventurers are worth their salt after all."},{"name":"OLDSOLDIER01753","text":"Ah, now I can finally remember this place as it once was. The battles we fought and the friendships we forged, all atop this lake's still waters."}],"reward":{"gil":610,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"quests":[67142]}},"partials":[{"type":"npc","id":"1013347","obj":{"i":1013347,"n":"Spiteful Knight","l":2200,"q":1}},{"type":"quest","id":"67142","obj":{"i":67142,"n":"Sounding Out the Amphitheatre","g":3,"l":"Coerthas Western Highlands","s":27}}]}