{"quest":{"name":"Clipped Wings","location":"The Sea of Clouds","id":67284,"patch":3.0,"sort":5003,"unlocksFunction":1,"eventIcon":71341,"issuer":1011952,"target":1011952,"genre":97,"journal":["Laniaitte seeks an adventurer with a delicate touch.","Laniaitte asks you to obtain a wing sample from a gaelicat, an adorable yet ferocious cloudkin native to the surrounding area. She warns you, however, that these creatures are very delicate. Only a perfectly preserved sample will suffice, and she doubts that she or her men could fell them while leaving their leathery appendages intact. No matter how many gaelicats it takes, she implores you to retrieve one of their wings.","You have slain several gaelicats to no avail. But as Laniaitte said, you must not grow disheartened. Continue slaying gaelicats in search of a suitable sample.","You obtain an undamaged wing from the gaelicats. Deliver the specimen to Laniaitte.","You return to the Rosehouse with the sample, and Laniaitte is more than impressed by your delicate precision. As it turns out, the wing sample was requested by Atelloune, a naturalist of no small renown, who is hard at work on an article for <span class=\"emphasis\">New Eorzean Geographic</span>. Her piece on cloudkin physiology is sure to be a smashing success due in no small part to your assistance."],"objectives":["Obtain an untorn gaelicat wing.","Continue your search for an undamaged gaelicat wing.","Deliver the sample to Laniaitte."],"dialogue":[{"name":"LANIAITTE","text":"Excuse me, <span class=\"highlight\">Forename</span>. A moment of your time, if I may? I recently received a special request for assistance with zoological research, but am at a loss as to how to fulfill it."},{"name":"LANIAITTE","text":"Are you familiar with gaelicats? They bear a striking resemblance to kittens, but with wings. An acquaintance of mine is writing an article on their physiology and requires a sample of their wings for her work."},{"name":"LANIAITTE","text":"Their sweet appearance belies a rather nasty temperament, and if it were simply a matter of slaying them I would handle it myself. The problem, however, is that taking a proper sample requires a delicate touch. A certain finesse that is beyond the capabilities of my men and myself."},{"name":"LANIAITTE","text":"Because they are so fragile, you may not obtain a proper sample from the first you fell. But I have no doubt a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents can procure a wing of immaculate quality. I realize this is a rather personal request, but I would be forever in your debt."},{"name":"LANIAITTE","text":"You should find gaelicats easily enough in the areas surrounding the camp. Do not be discouraged should you fail to obtain a suitable sample right away."},{"name":"LANIAITTE","text":"How fares your search? I realize obtaining an undamaged gaelicat wing is no easy feat."},{"name":"LANIAITTE","text":"My, what an extraordinary find! I am pleased to see your persistence has paid off. With this, she can resume her work on cloudkin!"},{"name":"LANIAITTE","text":"Ah, how forgetful of me not to mention it sooner. This sample is meant for Atelloune, the renowned naturalist. She's hard at work on a new article for <span class=\"emphasis\">New Eorzean Geographic</span> and requested a sample be delivered with the utmost haste."},{"name":"LANIAITTE","text":"You can be sure she will hear it was the incomparable <span class=\"highlight\">Forename Surname</span> who made possible her latest work on cloudkin."}],"reward":{"gil":517,"aetherCurrent":1,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67134]}},"partials":[{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"quest","id":"67134","obj":{"i":67134,"n":"Disclosure","g":3,"l":"Ishgard","s":19}}]}