{"quest":{"name":"A Mystery Illness","location":"Coerthas Western Highlands","id":67281,"patch":3.0,"sort":5008,"icon":100466,"eventIcon":71221,"issuer":1011231,"target":1011231,"involved":[1011232,1011233,1011234,1011238,1014124],"genre":94,"journal":["Redwald is looking for someone to carry out an investigation.","Redwald informs you that a mysterious sickness has suddenly taken hold of a great many men in the Falcon's Nest garrison. Suspecting foul play, but lacking the manpower to mount a full investigation, he has turned to you for help. Speak to troops in the fortress and see what you can find out.","You have gathered information from several soldiers in the area: it seems that everyone who fell sick did so shortly after eating dinner. Return to Redwald and report on what you have discovered.","All meals go past the head chef, Noirterel. Speak with him and find out what he knows about this issue. ","Noirterel personally checks the quality and freshness of all ingredients used in meals served to the troops. However, he does not drink and so cannot vouch for the wine served with dinner. Suspecting the wine to be at fault, he asks you to recover the empty wine bottles from the sutler at the airship landing so that they can be checked for traces of contaminants.","The sutler tells you that the bottles should still be on the airship landing somewhere, but offers no further assistance.","You have found the empty bottles. Take them back to Noirterel.","Noirterel confirms his suspicions. The bottles carry a strange, barely detectable odor─one that definitely shouldn't be there. Take one of the bottles to Redwald and inform him of the situation.","Redwald is shocked to discover that someone would poison the wine, but glad to have found the cause for the illness striking his soldiers. He thanks you for your assistance and hints at his intention to see this investigation through to its conclusion."],"objectives":["Gather information regarding the mysterious illness.","Report to Redwald.","Speak with Noirterel.","Speak with the sutler.","Obtain the wine bottles.","Deliver the bottles to Noirterel.","Deliver the bottle to Redwald."],"dialogue":[{"name":"REDWALD","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Thank you again for your earlier help. As it happens, I was hoping to enlist your aid once more."},{"name":"REDWALD","text":"Several of the garrison here have fallen suddenly ill, and with no obvious cause. If it is but a simple cold, then so be it...but I have a feeling there's something more sinister going on."},{"name":"REDWALD","text":"I want to mount an investigation, but I simply do not have the men. If you could gather information from the troops manning the fort, it would be of tremendous assistance."},{"name":"REDWALD","text":"Several troops here have fallen ill suddenly, and I suspect foul play. Please gather reports from the soldiers here, such that we may rule out malevolent causes."},{"name":"TOURCENET","text":"A mysterious disease? Well, my comrade-in-arms was complaining of stomach pains after dinner last night, but I merely assumed that the meal disagreed with him."},{"name":"EMERISSEL","text":"You're looking into the soldiers that fell sick of late? As it happens, my brother has been stuck in bed since last night. It's a pity─it was the first time in months that we've been able to share a meal together."},{"name":"SOUBINIE","text":"You want to know about that sickness that's been going around lately? Well, my colleague's been bedridden since dinner last night─and he won't stop moaning about it! I'll admit the soup was pretty flavorless, but he could stand to be a little less dramatic about it."},{"name":"TOURCENET","text":"My colleague fell ill with stomach pains after dinner last night. I assumed that the meal disagreed with him. I ate the same food, and I seem to be doing all right."},{"name":"EMERISSEL","text":"My brother's been sick in bed since last night. It's a pity─it was the first time in months that we've been able to share a meal together."},{"name":"SOUBINIE","text":"I'd wager my colleague is still in bed, moaning and complaining. I had the soup too, and I can tell you, it really wasn't <span class=\"emphasis\">that</span> bad..."},{"name":"REDWALD","text":"What news have you of this mysterious illness, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>?"},{"name":"REDWALD","text":"I see. So each person that fell sick did so after eating dinner..."},{"name":"REDWALD","text":"Every meal served here at Falcon's Nest is prepared─or at least overseen─by Noirterel, the head chef. I find it hard to believe he would let something this severe go undetected, but we cannot ignore the facts."},{"name":"REDWALD","text":"Pray ask Noirterel what he has to say about this. Find out whatever you can. We must determine what is behind this."},{"name":"REDWALD","text":"Have you spoken with Noirterel yet? We need to find out what has been making these soldiers fall ill."},{"name":"NOIRTEREL","text":"Yes? Do you want something?"},{"name":"NOIRTEREL","text":"Just what're you trying to imply!? I take my work very seriously. And I certainly wouldn't do anything to breach the trust of the troops I'm responsible for feeding."},{"name":"NOIRTEREL","text":"I'll admit some folk don't care for my traditional Coerthan cooking, but the ingredients are of the highest quality─I check them every morning! The only thing I can't vouch for is the wine. I don't drink─never touch the stuff."},{"name":"NOIRTEREL","text":"Hmmm... Perhaps the wine is the problem. We'll need to check the bottles to be sure, but I've already returned them to the sutler. Quickly go and get them back before he leaves, he should still be at the airship landing."},{"name":"NOIRTEREL","text":"We need to get those wine bottles back from the sutler. The airship landing is to the south of the fort─he should still be there."},{"name":"HOKYUKAN01745","text":"Hm? Lookin' for wine bottles? The ones from last night'll be around here somewhere. Any older than that and they'll have already been collected."},{"name":"HOKYUKAN01745","text":"Last night's bottles are over there somewhere. What do you want with empty bottles, anyway?"},{"name":"NOIRTEREL","text":"Do you have the bottles?"},{"name":"NOIRTEREL","text":"Marvelous. Let's see if anything smells out of the ordinary... &lt;sniff&gt; &lt;sniff&gt; Hm... Something is <span class=\"emphasis\">definitely</span> amiss. Only a trained nose─like that of an expert chef─would be able to pick it out, but this wine has been tampered with."},{"name":"NOIRTEREL","text":"I suggest you take this bottle to Redwald. I'm all but certain that last night's wine is behind the sick soldiers."},{"name":"NOIRTEREL","text":"Take that wine bottle to Redwald. No doubt last night's wine is what made all those soldiers sick."},{"name":"REDWALD","text":"Ah, you have returned. Was Noirterel able to shed any light on the situation?"},{"name":"REDWALD","text":"What? He thinks the wine caused the sickness? Seven hells, it must have been poisoned!"},{"name":"REDWALD","text":"You have my thanks, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Now that we know the cause of this illness, there is only one thing left to do..."}],"reward":{"gil":489,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":34}],"questsType":"all","quests":[67134,67270]},"next":[67282]},"partials":[{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1011232","obj":{"i":1011232,"n":"Tourcenet","l":2200,"q":5}},{"type":"npc","id":"1011233","obj":{"i":1011233,"n":"Emerissel","l":2200,"q":6}},{"type":"npc","id":"1011234","obj":{"i":1011234,"n":"Soubinie","l":2200,"q":2}},{"type":"npc","id":"1011238","obj":{"i":1011238,"n":"Noirterel","l":2200,"q":5}},{"type":"npc","id":"1014124","obj":{"i":1014124,"n":"Spirited Sutler","l":2200,"q":1}},{"type":"quest","id":"67134","obj":{"i":67134,"n":"Disclosure","g":3,"l":"Ishgard","s":19}},{"type":"quest","id":"67270","obj":{"i":67270,"n":"Memories in the Snow","g":94,"l":"Coerthas Western Highlands","s":5007}},{"type":"quest","id":"67282","obj":{"i":67282,"n":"Bad Wine","g":94,"l":"Coerthas Western Highlands","s":5009}}]}