{"quest":{"name":"Looking to the Future","location":"Ishgard","id":67287,"patch":3.0,"sort":5102,"eventIcon":71221,"issuer":1014717,"target":1012060,"involved":[1011220,1011952],"genre":96,"journal":["This Hyur seems vexed by the memory of forgotten promises.","You happen across a young man torn between personal desires and obligations. As a young boy, he promised he would wed when he came of age. This runs counter to his present goal of becoming a Temple Knight, which forbids marriage while undertaking training. He shamefully admits he cannot recall the girl's name, but remembers she was a ward of House Haillenarte. He asks that you find her and tell her she need not worry of fulfilling their promise. Speak with Bartelot outside Haillenarte Manor and see what you can discover.","You speak with Bartelot at Haillenarte Manor. While there is no shortage of wards under the care of their house, he supposes Lady Laniaitte would be of an age with the woman you seek. Speak with Lady Laniaitte at the Rosehouse in the Sea of Clouds and see what she knows.","You speak with Lady Laniaitte and learn she has heard of no such promises of marriage. However, she is certain that Marielle is of the right age for the girl you are after. Speak with Marielle about the promised marriage.","Marielle confirms that she is in fact the woman you are looking for. To your surprise, however, she is indifferent to the message you bring to her. She too forgot the promise to marry many ages ago, and is committed to serving Lady Laniaitte at the Rosehouse."],"objectives":["Speak with Bartelot outside Haillenarte Manor.","Speak with Laniaitte at the Rosehouse.","Speak with Marielle."],"dialogue":[{"name":"SUFFERINGMAN01751","text":"The Temple Knights are recruiting! It has long been my dream to join their ranks, and soon I shall make it reality. I've told myself I would give anything to be a Temple Knight, but one of their rules gives me pause: we are forbidden from marrying while undergoing training."},{"name":"SUFFERINGMAN01751","text":"Hearing this brought to mind a promise I made long ago. Given to flights of fancy and romance─as children are wont to be─I promised a girl that we would marry when we came of age. I was just a boy, and to be honest I cannot even remember her name. But I worry she may still be waiting for me."},{"name":"SUFFERINGMAN01751","text":"All I can recall is she was a ward of House Haillenarte. I realize the chances are slim, but I ask that you find her. Tell her she need not wait for me any longer. I could not bear knowing a girl wastes her life waiting for the impossible."},{"name":"BARTELOT","text":"A ward taken into House Haillenarte as a child? You ask as though there'd be only one. Sorry to say, but my lord has taken in more'n I care to count."},{"name":"BARTELOT","text":"It'll be no easy task sortin' through the lot of 'em with so little to go on."},{"name":"BARTELOT","text":"'Course, if we're speakin' strictly of ladies recently come of age, that may narrow things down some. The first that comes to mind is Lady Laniaitte down at the Rosehouse. She might be able to steer you in the right direction."},{"name":"BARTELOT","text":"Lady Laniaitte's the only one I know what meets that description. Why not pay her a visit and see what she knows?"},{"name":"LANIAITTE","text":"Ladies of House Haillenarte of age with me? I suppose that could only be Marielle."},{"name":"LANIAITTE","text":"But you say as a child she promised to be wed. I have heard no such thing. At any rate, you must talk with her yourself to know if she is the one you seek."},{"name":"LANIAITTE","text":"She has told me nothing of engagements or marriage, but you should speak with her yourself to know for certain."},{"name":"MARIEL","text":"A promise of marriage? Now that you mention it... Why, yes I do believe I made such a promise."},{"name":"MARIEL","text":"But I was just a child. Who would think to remember such a thing after all these years? Besides, I have sworn to serve Lady Laniaitte."},{"name":"MARIEL","text":"My only concerns now are fulfilling my duties and the protection of Camp Cloudtop. Whoever this boy is, he need not worry of old, forgotten promises."}],"reward":{"gil":791,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"quests":[67139]}},"partials":[{"type":"npc","id":"1014717","obj":{"i":1014717,"n":"Hyur On Hard Times","l":2300,"q":1}},{"type":"npc","id":"1012060","obj":{"i":1012060,"n":"Marielle","l":2100,"q":6}},{"type":"npc","id":"1011220","obj":{"i":1011220,"n":"Bartelot","l":2301,"q":4}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"quest","id":"67139","obj":{"i":67139,"n":"Alphinaud's Way","g":3,"l":"Fortemps Manor","s":24}}]}