{"quest":{"name":"Homesick","location":"Ishgard","id":67286,"patch":3.0,"sort":5101,"eventIcon":71221,"issuer":1012175,"target":1011235,"genre":96,"journal":["The weather is cold, but Bohemondas seems red hot with anger.","As Bohemondas tells it, the knights of Ishgard plan to make his former home into a military encampment. This has upset Bohemondas greatly, made worse by the fact that his son has enlisted to help. He asks that should you see him, you present him with two choices: return to his family or forfeit them for good. Travel to Falcon's Nest and relay Bohemondas's message to his son.","You arrive at Falcon's Nest, and tell Josseloux of his father's plea to return home. Josseloux is not swayed by his father's words. While the appearance of Falcon's Nest may change, he promises to protect the traditions he believes make it the home they cherish."],"objectives":["Speak with Josseloux at Falcon's Nest."],"dialogue":[{"name":"BOHEMONDAS","text":"Angry? Of course I'm angry! All I want is to protect my home, and those godsdamned knights just sit there and scoff at the “ramblings of an old man”! Ramblings, my arse!"},{"name":"BOHEMONDAS","text":"Have you heard what's to become of Falcon's Nest!? Most folk there came to Ishgard to keep out of the cold, but now they plan to tear it all away and make a military encampment of it. A bloody military encampment!"},{"name":"BOHEMONDAS","text":"What's worse, my son has enlisted to help! The little shite. He refuses to listen, and I'm tired of tryin' to reason with him!"},{"name":"BOHEMONDAS","text":"If you see that slimy, backstabbin' varlet, tell him he can come back to his family or not come back at all!"},{"name":"BOHEMONDAS","text":"I'm through arguing! He can have his bloody camp, or he can have his family. He has to choose!"},{"name":"JOSSELOUX","text":"Hm? Yes, I'm Josseloux. ...He said what!? &lt;sigh&gt; My father's shortsightedness knows no bounds. He fails to see what we stand to preserve by creating this encampment rather than leaving it abandoned to the snows."},{"name":"JOSSELOUX","text":"As the name suggests, Falcon's Nest is well known for its skilled falconers going back generations. While it's true the astrologians can sense Horde activity through the stars, it has always been us who give first alert of their approach."},{"name":"JOSSELOUX","text":"But things changed after the Calamity. The weather turned foul, and we had no choice but to seek better shelter. I know how it pained him to abandon Falcon's Nest─it's <span class=\"emphasis\">my</span> home, too. But he has to understand that even if our home has to change, it does not change who we are."},{"name":"JOSSELOUX","text":"The proud hawkers of Falcon's Nest will live on, and I will prove it to him. When the day comes for him to return here, the earth beneath him may seem unfamiliar, but our companions gliding proudly through the skies will be as they always have and always will be. This, I swear."}],"reward":{"gil":617,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"quests":[67139]}},"partials":[{"type":"npc","id":"1012175","obj":{"i":1012175,"n":"Bohemondas","l":2300,"q":1}},{"type":"npc","id":"1011235","obj":{"i":1011235,"n":"Josseloux","l":2200,"q":3}},{"type":"quest","id":"67139","obj":{"i":67139,"n":"Alphinaud's Way","g":3,"l":"Fortemps Manor","s":24}}]}