{"quest":{"name":"Featherbrained Schemes","location":"The Sea of Clouds","id":67292,"patch":3.0,"sort":5101,"icon":100467,"eventIcon":71221,"issuer":1012059,"target":1012054,"involved":[1011952,1012060,1014129],"genre":97,"journal":["Gildon is at a complete loss.","Unable to make neither heads nor tails of the bone, Gildon asks you to show it to others in the hopes that they might offer some insight into its meaning. Present the bone to the knights of Camp Cloudtop and see what they have to say.","Alas, none of the Rose Knights know what to make of the bone's markings─or, in the case of Fabrellet, are inclined to care. On the bright side, the quartermaster mentions that a shipment of provisions is scheduled to arrive soon. Perhaps this news will serve to lift Gildon's spirits.","Upon hearing of the shipment, Gildon has an epiphany: the Vanu were using the bone to count the days between shipments, which always include a substantial quantity of crystals. Believing that the beastmen intend to launch an attack, he goes to warn Lady Laniaitte, and bids you warn Fabrellet in his stead.","Fabrellet is unwilling to lend credence to Gildon's fears, and suggests that you make for the <span class=\"emphasis\">Protector</span> if you are so concerned for the shipment's welfare.","You board the <span class=\"emphasis\">Protector</span> and find a Vanu preparing to flee with his prize. However, you make quick work of him and his allies. Examine the shipment to see that everything is accounted for.","So far as you can tell, the Vanu were unable to steal any of the provisions. Return to Fabrellet and inform him that there was indeed a Vanu raid, and that you have foiled it.","Fabrellet and Lady Laniaitte are pleased to learn that, thanks to you, the shipment is secure. At your insistence, the commander recognizes Gildon for his part in uncovering the Vanu's plans, offering him the opportunity to serve elsewhere, should it be his desire. Gildon declines, however, stating that his sole desire is to rekindle the spirits of his fellow knights. To that end, he proposes that he and the others partake of the provisions in celebration. Though Fabrellet scoffs at the idea, Lady Laniaitte agrees, and bids the quartermaster make it known whom the Rose Knights have to thank for their boon."],"objectives":["Show the gnawed bone to knights around the camp.","Return the gnawed bone to Gildon.","Speak with Fabrellet.","Head to the <span class=\"emphasis\">Protector</span> and see that the shipment is safe.","Check that nothing is missing from the shipment.","Report to Fabrellet."],"dialogue":[{"name":"GILDON","text":"Three sets of fourteen lines...two crossed out entirely, the third halfway..."},{"name":"GILDON","text":"Bah, it's no use. I still haven't the foggiest what the markings on this bone could mean."},{"name":"GILDON","text":"Would you show it to the others? Perhaps they will know what to make of it."},{"name":"GILDON","text":"If we're fortunate, one of the other knights might know what the markings mean─if anything..."},{"name":"MARIELLE","text":"Can I assist you with something?"},{"name":"MARIELLE","text":"Hmmm... What an odd pattern. I've never seen its like."},{"name":"MARIELLE","text":"If it holds any meaning, I couldn't tell you. My apologies."},{"name":"MARIELLE","text":"If I think of anything, I will let you know."},{"name":"LANIAITTE","text":"<span class=\"highlight\">Forename</span>, how good to see you. What can I do for you?"},{"name":"LANIAITTE","text":"...Seems to me that the scouts were counting something. The question is, what?"},{"name":"LANIAITTE","text":"Should there be any developments, pray inform me immediately."},{"name":"FABRELLET","text":"I have no time for idle chatter."},{"name":"FABRELLET","text":"...This isn't another of Gildon's errands, is it?"},{"name":"FABRELLET","text":"I haven't time to waste entertaining his requests. A shipment of provisions should be arriving any moment."},{"name":"FABRELLET","text":"I told you, not now. Gildon and his bone are not my concern."},{"name":"GILDON","text":"Ah, there you are. Did you learn anything of value?"},{"name":"GILDON","text":"A shipment of provisions!? Truly? Oh, how I've longed for a reprieve from salted meats..."},{"name":"GILDON","text":"Ahem! Didn't mean to get carried away. It's just that I often find myself counting the days until─"},{"name":"GILDON","text":"By the Fury, that's it! The shipment is their target!"},{"name":"GILDON","text":"The Vanu scouts must have been spying on our shipments. They know they come once a fortnight!"},{"name":"GILDON","text":"But they couldn't care less about the foodstuffs. They mean to seize the crystals and offer them up to the white whale!"},{"name":"GILDON","text":"Go and tell Fabrellet what we discovered. I will speak with Lady Laniaitte."},{"name":"GILDON","text":"We cannot let the Vanu get their hands on those crystals. You must hurry!"},{"name":"FABRELLET","text":"Hm? What is it now?"},{"name":"FABRELLET","text":"The Vanu mean to steal our crystals? I can't imagine how they intend to accomplish that."},{"name":"FABRELLET","text":"Well, if you truly believe there is merit to Gildon's claims, by all means, go to the <span class=\"emphasis\">Protector</span>. The provisions are being unloaded as we speak."},{"name":"FABRELLET","text":"If you are so concerned for the shipment's welfare, I suggest you make for the <span class=\"emphasis\">Protector</span>."},{"name":"BALLOON","text":"Netherlings are no match for mighty Gundu!"},{"name":"WOUNDED01756","text":"The...the provisions!"},{"name":"SYSTEM","text":"All the provisions appear to be accounted for."},{"name":"WOUNDED01756","text":"Wh-What of the provisions!?"},{"name":"FABRELLET","text":"Well, it would seem that the threat was indeed legitimate..."},{"name":"LANIAITTE","text":"Time and again you have risked your life to protect our camp, and for that you have my sincerest thanks."},{"name":"LANIAITTE","text":"Ah, yes, you are right. 'Twas Gildon who uncovered the Vanu's plot."},{"name":"LANIAITTE","text":"Perhaps a man of your intelligence could better serve House Haillenarte elsewhere. Should it be your desire, I could arrange for a transfer."},{"name":"FABRELLET","text":"Well, well! To think that I might one day salute <span class=\"emphasis\">you</span>!"},{"name":"GILDON","text":"I am honored, Lady Laniaitte. Truly, I am. But with all due respect, I would rather remain in Camp Cloudtop."},{"name":"GILDON","text":"All I want─all I have ever wanted─is to rekindle our men's spirits. To see them walk with their heads held high once more!"},{"name":"GILDON","text":"Were I to leave, that dream might never become a reality..."},{"name":"GILDON","text":"But, if I may, I do have one small request."},{"name":"GILDON","text":"All this running about has left me quite famished. Might I─ahem, might <span class=\"emphasis\">we</span> partake of the recovered provisions? A celebratory meal─or a celebratory snack, perhaps?"},{"name":"FABRELLET","text":"Even now, all you can think of is your stomach?"},{"name":"LANIAITTE","text":"A <span class=\"emphasis\">snack</span>─and a few casks of wine besides. That much we can afford to spare, no?"},{"name":"LANIAITTE","text":"Aye, the men could do with a bit of meat and mead. Make sure they know that Gildon is to thank for it."},{"name":"GILDON","text":"Th-Thank you, Lady Laniaitte! Thank you!"},{"name":"WOUNDED01756","text":"Praise...praise Halone... Pray inform Fabrellet that all is well."}],"reward":{"gil":610,"items":[{"id":5682,"one":1},{"id":5717,"one":1},{"id":5722,"one":1}],"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"questsType":"all","quests":[67139,67285]}},"partials":[{"type":"npc","id":"1012059","obj":{"i":1012059,"n":"Gildon","l":2100,"q":8}},{"type":"npc","id":"1012054","obj":{"i":1012054,"n":"Fabrellet","l":2100,"q":6}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012060","obj":{"i":1012060,"n":"Marielle","l":2100,"q":6}},{"type":"npc","id":"1014129","obj":{"i":1014129,"n":"Injured Knight","l":2100,"q":1}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"67139","obj":{"i":67139,"n":"Alphinaud's Way","g":3,"l":"Fortemps Manor","s":24}},{"type":"quest","id":"67285","obj":{"i":67285,"n":"Unclear Motives","g":97,"l":"The Sea of Clouds","s":5006}}]}