{"quest":{"name":"Baby Strides","location":"Coerthas Western Highlands","id":67297,"patch":3.0,"sort":5106,"eventIcon":71221,"issuer":1011907,"target":1011907,"genre":94,"journal":["Jantellot thinks you are ready to try your hand at hunting dragons.","In light of how easily you dispatched the rheums he previously tasked you with, Jantellot proposes that you hunt down some actual dragons this time. Archaeornis make up the vanguard of the Dravanian Horde, and a number of them roam the snowdrifts to the north of the camp, near Banepool. Jantellot tells you to find and slay three of these scaly, feathered beasts.","With relative ease, you seek out and slay three archaeornis. Return to the Convictory and let Jantellot know that you did not shirk from this challenge.","Impressed by the efficiency with which you slew your quarry, Jantellot explains that you would be more than welcome as a member of the Convictors, should you wish to join. They are always in need of more good men and women."],"objectives":["Slay archaeornis.","Report to Jantellot."],"dialogue":[{"name":"JANTELLOT","text":"Those rheums you slew last time may have been easy hunting, but I assure you─dragons are not. Even veteran Convictors can find them to be something of a handful sometimes."},{"name":"JANTELLOT","text":"If you want to try your hand at it yourself, I suggest you start with some archaeornis. They are great, feathered scalekin monsters and they form part of the Horde's vanguard."},{"name":"JANTELLOT","text":"You will find the beasts wandering about to the north, near Banepool. Find three archaeornis and put them down without mercy. Consider it a test of skill, if you will."},{"name":"JANTELLOT","text":"Head out towards Banepool and slay three of the archaeornis there. If you're out of your depth, there's no shame in admitting it. I've no desire to send a good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> death."},{"name":"JANTELLOT","text":"How did you find those archaeornis? They may not be smart, but they certainly put up a good fight, wouldn't you say?"},{"name":"JANTELLOT","text":"Heh, you make it sound easy! But not all of us have had the opportunity to fight at the side of the Azure Dragoon─to see firsthand how best these mighty beasts may be brought down."},{"name":"JANTELLOT","text":"Many Ishgardians think we nobles at the Convictory are simply here out of foppery and whim. They scarce understand the risks we take defending Ishgard from the Horde. But I feel perhaps that you understand... If ever you decide you want to join the Convictors, you need but say the word!"}],"reward":{"gil":581,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"questsType":"all","quests":[67142,67296]},"next":[67303]},"partials":[{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"quest","id":"67142","obj":{"i":67142,"n":"Sounding Out the Amphitheatre","g":3,"l":"Coerthas Western Highlands","s":27}},{"type":"quest","id":"67296","obj":{"i":67296,"n":"Baby Steps","g":94,"l":"Coerthas Western Highlands","s":5104,"f":1}},{"type":"quest","id":"67303","obj":{"i":67303,"n":"Spring into Action","g":94,"l":"Coerthas Western Highlands","s":5108}}]}