{"quest":{"name":"A Hasty Recovery","location":"The Sea of Clouds","id":67294,"patch":3.0,"sort":5104,"eventIcon":71221,"issuer":1013349,"target":1011952,"involved":[1013348,1013353,1013354,1013355,1013356],"genre":97,"journal":["Terremiaux has the look of a man who hates unfinished business.","With his subordinates safe, Terremiaux can at last return to his original task─the retrieval of stolen weapons and armor. And to avoid the pitfalls of his initial undertaking, he has devised a plan. First, he will create a diversion to draw the attention of as many Vanu as he can. This will offer you the chance to reclaim the equipment with diminished resistance.","You have successfully retrieved all the stolen equipment. Return beyond the bridge to Vundu Ok' Bendu and speak with Terremiaux.","You return to Terremiaux, and he is at a loss as to how to repay you. He asks that you return the equipment to Laniaitte back at camp and relay to her all that has transpired.","Laniaitte is relieved to hear the search party is safe and the equipment is all accounted for. Although the Vanu's sudden interest in finer weaponry concerns her, she is glad to have had the aid of such a capable adventurer, and foresees need of your skills again in the future."],"objectives":["Retrieve the stolen equipment.","Report to Terremiaux.","Deliver the equipment to Laniaitte."],"dialogue":[{"name":"TERREMIAUX","text":"Your assistance has been more than anyone could ask for, but there is yet work to be done. We did not come here to simply be driven back out─nay, we must take back the stolen weapons and armor!"},{"name":"TERREMIAUX","text":"I will create a diversion to draw what attention I can from the Vanu nearby. While they're distracted, I need you to retrieve them."},{"name":"LANIAITTE","text":"Terremiaux still means to complete the mission? ...May Halone grant him strength."},{"name":"ENTRANCESOLDIER01755","text":"Please...you must reclaim the equipment from the Vanu!"},{"name":"TERREMIAUX","text":"Everything appears to be accounted for. Words fail to express my gratitude, <span class=\"highlight\">Forename</span>. Our equipment, and perhaps even my subordinates, would be lost to the Vanu if not for your aid."},{"name":"TERREMIAUX","text":"Pray return to the Rosehouse and deliver them to Lady Laniaitte. It is only fitting that she should receive them from you. We will return in due time, when my men have recovered their strength."},{"name":"TERREMIAUX","text":"There is naught we can do to repay your selfless actions, <span class=\"highlight\">Forename</span>. After you report to Lady Laniaitte, I trust you will take a well-earned rest."},{"name":"ENTRANCESOLDIER01755","text":"We owe much and more to your aid. Please see the weapons and armor safely to Lady Laniaitte."},{"name":"FORTSOLDIERA01757","text":"...Thank you, adventurer."},{"name":"FORTSOLDIERB01757","text":"I feel I owe you my life, adventurer. Lady Laniaitte will be overjoyed to see the equipment returned to Camp Cloudtop."},{"name":"FORTSOLDIERC01757","text":"We will not tarry long, but please go on ahead. Lady Laniaitte is sure to be waiting."},{"name":"LANIAITTE","text":"Ah, <span class=\"highlight\">Forename</span>, you've returned. What of the equipment, and the search party?"},{"name":"LANIAITTE","text":"You never fail to impress, my friend. I see, the others are not yet fit to travel. No matter. I take solace in knowing they're no longer in harm's way."},{"name":"LANIAITTE","text":"And yet, the Vanu's recent fixation on Ishgardian weaponry still concerns me. With but a weak grasp of metallurgy, I can only surmise they crave more advanced weaponry to oppose us."},{"name":"LANIAITTE","text":"It may finally be time to strengthen security here at Cloudtop. Our duty is to keep watch for Dravanian activity, after all─we can ill afford to be distracted by the Vanu."},{"name":"LANIAITTE","text":"In any event, I was right to call upon you for help. Thank you again, for everything."},{"name":"GUENRIOL","text":"Your assistance has been more than anyone could ask for, but there is yet work to be done. We did not come here to simply be driven back out─naye, we must retrieve the supplies stolen from Camp Cloudtop."},{"name":"GUENRIOL","text":"I will create a diversion to draw what attention I can from the Vanu nearby. While they're distracted, I need you to retrieve the stolen supplies."},{"name":"GUENRIOL","text":"I will draw their attention for as long as I can. You must retrieve the supplies before they return."},{"name":"ENTRANCESOLDIER01755","text":"Has the lieutenant not yet returned?"},{"name":"ENTRANCESOLDIER01755","text":"You have returned with the supplies! Thank goodness. The lieutenant will be glad to hear of it."},{"name":"FORTSOLDIERA01757","text":"Pray speak with the lieutenant. He will be relieved to know you've retrieved the supplies."},{"name":"FORTSOLDIERB01757","text":"You need not worry about us, though I'm sure the lieutenant is anxious to hear of your work. "},{"name":"FORTSOLDIERC01757","text":"Thank goodness you're all right. Lieutenant Guenriol has been awaiting word of your success. "},{"name":"GUENRIOL","text":"All the supplies appear to be accounted for. Words fail to express my gratitude, <span class=\"highlight\">Forename</span>. Our supplies, and perhaps even my subordinates, would be lost to the Vanu if not for your aid."},{"name":"GUENRIOL","text":"Pray return to the Rosehouse and deliver the supplies to Lady Laniaitte, along with a report of what transpired. It is only fitting that she should hear it from you. We shall return in due time, when my men have recovered their strength."},{"name":"GUENRIOL","text":"There is naught we can do to repay your selfless actions, <span class=\"highlight\">Forename</span>. After you report to Lady Laniaitte, I trust you will take a well-earned rest."}],"reward":{"gil":496,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"questsType":"all","quests":[67139,67293]}},"partials":[{"type":"npc","id":"1013349","obj":{"i":1013349,"n":"Terremiaux","l":2100,"q":3}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1013348","obj":{"i":1013348,"n":"Wounded Knight","l":2100,"q":3}},{"type":"npc","id":"1013353","obj":{"i":1013353,"n":"Terremiaux","l":2100,"q":1}},{"type":"npc","id":"1013354","obj":{"i":1013354,"n":"Rose Knight","l":2100,"q":1}},{"type":"npc","id":"1013355","obj":{"i":1013355,"n":"Rose Knight","l":2100,"q":1}},{"type":"npc","id":"1013356","obj":{"i":1013356,"n":"Rose Knight","l":2100,"q":1}},{"type":"quest","id":"67139","obj":{"i":67139,"n":"Alphinaud's Way","g":3,"l":"Fortemps Manor","s":24}},{"type":"quest","id":"67293","obj":{"i":67293,"n":"Calling Back the Troops","g":97,"l":"The Sea of Clouds","s":5103}}]}