{"quest":{"name":"Behind Enemy Lines","location":"The Sea of Clouds","id":67291,"patch":3.0,"sort":5102,"eventIcon":71221,"issuer":1011952,"target":1013349,"involved":[1013348],"genre":97,"journal":["The uneasy air about Laniaitte can only mean trouble.","Laniaitte informs you that weapons and armor have been stolen from their storehouse. Although she dispatched men to retrieve them, she has yet to receive word of their progress and fears the Vanu are to blame. Knowing that they planned to begin searching around Vundu Ok' Bendu, Laniaitte asks that you head there and look for signs of the Rose Knights. ","You arrive at Vundu Ok' Bendu and find a wounded soldier. He tells you the lieutenant crossed a nearby bridge heading further into Vanu territory.","You find the lieutenant whole of body, if somewhat worse for wear. With the camp's weapons and armor still in the Vanu's possession and his subordinates now scattered, completing their mission will not be an easy feat."],"objectives":["Search for the missing Rose Knights.","Speak with Lieutenant Terremiaux."],"dialogue":[{"name":"LANIAITTE","text":"Ah, <span class=\"highlight\">Forename</span>! I wish to speak with you regarding a rather urgent matter."},{"name":"LANIAITTE","text":"We were recently attacked by a band of Vanu. They struck without warning, making off with weaponry and armor from our storehouse."},{"name":"LANIAITTE","text":"A small unit led by Lieutenant Terremiaux was tasked with retrieving our stolen arms, but we have not received word from them since. I fear they may have fallen prey to the Vanu."},{"name":"LANIAITTE","text":"I could think of no one more able to aid them, and so I ask that you find them and see to their safety. Lieutenant Terremiaux planned to take his men to Vundu Ok' Bendu to begin their search. Make your way there and see what you can find."},{"name":"LANIAITTE","text":"Pray make haste to Vundu Ok' Bendu, and find out what has become of my men."},{"name":"ENTRANCESOLDIER01755","text":"Who goes there? Ah, you've been sent by Lady Laniaitte? Then all is not yet lost. You must hurry to Lieutenant Terremiaux! He's gone beyond the bridge, deeper into Vanu territory. Please, hurry after him, before it's too late!"},{"name":"ENTRANCESOLDIER01755","text":"Please, you must save the lieutenant!"},{"name":"TERREMIAUX","text":"Seven hells, is there no end to them!?"},{"name":"TERREMIAUX","text":"Ahhh! Oh, don't scare me like that! I take it Lady Laniaitte sent you. <span class=\"highlight\">Forename</span>, is it?"},{"name":"TERREMIAUX","text":"Well <span class=\"highlight\">Forename</span>, we have quite a mess on our hands. Not only are our weapons still in the hands of those beaked bastards, but my men have been scattered. It won't be easy, but we've got to regroup and see this mission through."},{"name":"GUENRIOL","text":"（★未使用／削除予定★）"},{"name":"GUENRIOL","text":"（★未使用／削除予定★）"},{"name":"GUENRIOL","text":"（★未使用／削除予定★）"}],"reward":{"gil":467,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"quests":[67139]},"next":[67293]},"partials":[{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1013349","obj":{"i":1013349,"n":"Terremiaux","l":2100,"q":3}},{"type":"npc","id":"1013348","obj":{"i":1013348,"n":"Wounded Knight","l":2100,"q":3}},{"type":"quest","id":"67139","obj":{"i":67139,"n":"Alphinaud's Way","g":3,"l":"Fortemps Manor","s":24}},{"type":"quest","id":"67293","obj":{"i":67293,"n":"Calling Back the Troops","g":97,"l":"The Sea of Clouds","s":5103}}]}