{"quest":{"name":"Cat on a Cold Stone Roof","location":"Coerthas Western Highlands","id":67290,"patch":3.0,"sort":5109,"eventIcon":71221,"issuer":1013360,"target":1013360,"involved":[1013361],"genre":94,"journal":["The nonplussed noblewoman is looking up into the parapets with a panicked expression.","A noblewoman's beloved pet has gotten itself into quite a pickle. She has found her way up onto the roof and cannot get down. Help the poor thing get back down to the ground.","You rescue the kitten. It is suspiciously coeurl-like, but take it back to the noblewoman anyway─she promised a reward!","The woman is overjoyed to have her pet back safe and sound. You try to inform her that it seems more like a coeurl pup than a cat, but she is thoroughly convinced that it is an adorable kitten. All you can do now is to pray for her safety."],"objectives":["Rescue the kitten.","Deliver the pet to the noblewoman."],"dialogue":[{"name":"SYSTEM","text":"The suspiciously coeurl-like kitten peers over the ledge apprehensively."},{"name":"LADY01754","text":"Oh, my baby! My poor, poor baby! How did you get up there!?"},{"name":"LADY01754","text":"&lt;sob&gt; Oh, whatever shall I do? It's so high up... Please, somebody do something!"},{"name":"LADY01754","text":"You'll help me, won't you!? Please! I promise you'll be repaid! Please save my poor kitty!"},{"name":"LADY01754","text":"Please! Save my poor kitty! Please!"},{"name":"SYSTEM","text":"The suspiciously coeurl-like kitten pounces into your arms."},{"name":"LADY01754","text":"Do you have her? Do you have my dear, dear kitty?"},{"name":"LADY01754","text":"There you are, you silly little thing. You had me so <span class=\"emphasis\">worried</span>!"},{"name":"LADY01754","text":"...What? You think my dear little kitty isn't really a cat? She's really a coeurl!?"},{"name":"LADY01754","text":"Hahahaha! To think I almost believed you for a second there! My dear little kitty isn't some man-eating monster. Just look at her! Look how cute she is!"}],"reward":{"gil":438,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"quests":[67144]}},"partials":[{"type":"npc","id":"1013360","obj":{"i":1013360,"n":"Nonplussed Noblewoman","l":2200,"q":1}},{"type":"npc","id":"1013361","obj":{"i":1013361,"n":"Quavering Kitten","l":2200,"q":1}},{"type":"quest","id":"67144","obj":{"i":67144,"n":"Purple Flame, Purple Flame","g":3,"l":"Coerthas Western Highlands","s":29}}]}