{"quest":{"name":"The Secret to Success","location":"Coerthas Western Highlands","id":67298,"patch":3.0,"sort":5110,"icon":100468,"eventIcon":71221,"issuer":1013710,"target":1013710,"involved":[1011907,1011908,1014133,1014134],"genre":94,"journal":["Dominiac is simmering with impatience.","Dominiac wants to support Ser Aymeric, but cannot do so without first gaining glory slaying dragons. Unfortunately, he is not having much luck. He simply does not know much about what he is hunting. Lend him a hand by finding out what you can about these mysterious creatures.","The sly scout says he is happy to share his knowledge of dragons, but for a price. Do his patrol duty for him and he'll tell you what he knows.","You have completed the patrol duty as requested. Return to the scout at the Convictory and find out what he knows.","True to his word, the scout shares a useful secret about dragons. For reasons as yet unknown, the bodies of slain dragons seem to attract more powerful dragons. This has obvious tactical and strategic implications, but the scout implores you not to share this information, as it has the potential to be very, very dangerous. Tell Dominiac anyway.","Dominiac realizes that he can start with a small dragon and, by leaving its corpse, attract larger prey. By repeating this process, he can attract increasingly larger dragons until he gains the glory he seeks. Hopefully he will use this knowledge wisely."],"objectives":["Gather information about the Dravanian Horde.","Stand watch at the specified locations.","Speak with the sly scout at the Convictory.","Report to Dominiac."],"dialogue":[{"name":"DOMINIAC","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Your reputation precedes you. Once you slay a few primals, word gets around. Seeing as you're so strong and powerful, I was wondering if you might be able to help me out with something."},{"name":"DOMINIAC","text":"I want nothing more than to support the great Ser Aymeric. But Ishgardian society revolves around the nobility. Those not of noble birth─such as myself─have no power at all."},{"name":"DOMINIAC","text":"The only way to gain the power of nobility is through a truly noble display of courage. There's one simple way to do that─slay a monstrous, ancient dragon. There are some feats that cannot be ignored."},{"name":"DOMINIAC","text":"So I took up my spear and came to the Convictory. Sadly, things have not gone as well as I had hoped."},{"name":"DOMINIAC","text":"I'm still somewhat new to this, you see. I really don't know much about dragons, especially the rarer, larger ones. All the knights here are competing with each other for honor and glory. None of them will share what they know with each other, for fear of losing any edge they may have."},{"name":"DOMINIAC","text":"But you're not a Convictor. They're not competing with <span class=\"emphasis\">you</span>. I doubt they'd be nearly as tight-lipped with you as they are with me and the other knights here. You might be able to learn a thing or two for me about how I might find and kill one of the larger dragons."},{"name":"DOMINIAC","text":"Try asking some of the knights here what they know about dragons. They're very tight-lipped around each other, but I suspect they might be a little more willing to talk with someone they're not directly competing with."},{"name":"LANCER01762","text":"You want to know about dragons, do you? Well, you're speakin' to the right man! I know stuff about them beasts that even the <span class=\"emphasis\">dragoons</span> ain't heard of."},{"name":"LANCER01762","text":"Ohoho, don't think I'll be tellin' you for free, though. Tell you what: I'm due to go out on patrol any minute now, but it's far too bloody cold for it if you ask me. I'll put me patrol points in your map here, and if you go do my patrol for me, I'll tell you what I know."},{"name":"LANCER01762","text":"Ain't nothin's free in this realm, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>. Go do my patrol for me, and I'll consider that fair payment for tellin' you what I know."},{"name":"JANTELLOT","text":"You want to know about dragons? I'm sorry but I truly doubt that I know anything you wouldn't have already learned from the Azure Dragoon."},{"name":"BONIFOIX","text":"Hm? You want to know my trick for slaying dragons? That knowledge is my ticket straight to glory. It's what makes me stand out here. I can't go telling any old person about it."},{"name":"LANCER01762","text":"Back already, are you? Well, a deal's a deal─I'll tell you what I know."},{"name":"LANCER01762","text":"I've no idea why, but the corpses of weaker dragons seem to attract the higher-ranking Dravanians. Once you know this, it makes it pretty easy to lay a trap for some of the bigger, nastier dragons out there."},{"name":"LANCER01762","text":"Now listen. Don't you go tellin' anyone about this, you hear? Just think what'd happen if everyone knew."},{"name":"LANCER01762","text":"Things're dangerous enough around here to begin with─especially lately. Imagine some lowborn─some young lad with dreams of nobility and nothin' to lose─some guy who's come out here to find glory at any cost. Imagine <span class=\"emphasis\">he</span> finds out how to bring the biggest, nastiest monsters in the realm out of hidin'."},{"name":"LANCER01762","text":"Just keep it to yourself is what I'm sayin'. You can never be too careful."},{"name":"LANCER01762","text":"I don't know why, but the corpses of the weaker dragons seem to attract bigger, tougher ones. Makes it easy to lay a trap for some of the big game. But don't go tellin' just anyone about it."},{"name":"SAINTRELMAUX","text":"I've not seen you around the Convictory. Are you a new recruit? Not that it's any of my business, I suppose."},{"name":"DOMINIAC","text":"Ah, you're back! Were you able to learn anything useful?"},{"name":"DOMINIAC","text":"Hmmm. I see! So I can use the corpses of weaker dragons to attract bigger ones. It seems like I might be able to bag quite a prestigious catch this way..."},{"name":"DOMINIAC","text":"I start with a small one, kill that, then wait for a bigger one to come along. Then if I kill that one, an even <span class=\"emphasis\">bigger</span> one should appear! Then I kill <span class=\"emphasis\">that</span> one, and so on."},{"name":"DOMINIAC","text":"You have my deepest gratitude. Thanks to you, I now know what I must do. Though, I might ask another favor in future."}],"reward":{"gil":524,"xp":25200},"reqs":{"jobs":[{"lvl":51,"id":34}],"quests":[67142]},"next":[67300]},"partials":[{"type":"npc","id":"1013710","obj":{"i":1013710,"n":"Dominiac","l":2200,"q":6}},{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"npc","id":"1011908","obj":{"i":1011908,"n":"Bonifoix","l":2200,"q":2}},{"type":"npc","id":"1014133","obj":{"i":1014133,"n":"Sly Scout","l":2200,"q":3}},{"type":"npc","id":"1014134","obj":{"i":1014134,"n":"Saintrelmaux","l":2200,"q":2}},{"type":"quest","id":"67142","obj":{"i":67142,"n":"Sounding Out the Amphitheatre","g":3,"l":"Coerthas Western Highlands","s":27}},{"type":"quest","id":"67300","obj":{"i":67300,"n":"Introductory Dragonslaying","g":94,"l":"Coerthas Western Highlands","s":5111}}]}