{"quest":{"name":"Some Bad News","location":"The Dravanian Forelands","id":67307,"patch":3.0,"sort":5201,"unlocksFunction":1,"eventIcon":71341,"issuer":1011916,"target":1011916,"involved":[1011923,1011924,1011932],"genre":98,"journal":["Marcechamp is looking for a reliable pair of feet.","Marcechamp has not heard from his three chocobo camps for a while, and wants to know how the hunting fares. Visit the leader of each camp and return to Marcechamp with their reports.","Each camp faces its own set of problems, with some more urgent than others. Return to Tailfeather and inform Marcechamp.","You relay the words of each camp leader to Marcechamp, who expresses his annoyance at their poor reporting habits. Marcechamp asks you to help out with the troubles of each camp."],"objectives":["Speak with the hunters.","Report to Marcechamp."],"dialogue":[{"name":"MARCECHAMP","text":"I see you've been makin' the rounds gettin' to know the hunters in these parts. Well, how'd you like to help a <span class=\"emphasis\">real</span> hunter?"},{"name":"MARCECHAMP","text":"I'm overseein' three camps set up to the east, but the lazy sods ain't sent me a report in over a fortnight, an' I'm too bleedin' busy to be playin' messenger. You look right fierce enough to get the information outta 'em. It's a simple job that'll earn you some coin─can't rightly say no to that!"},{"name":"MARCECHAMP","text":"If that tickles your fancy, then you'll need to talk to the leaders of each camp: Leonulfe, Guenaret, an' Aimebert. Hear what they have to say an' get back to me when you're done."},{"name":"MARCECHAMP","text":"Speak with the leaders of each camp─Leonulfe, Guenaret, an' Aimebert─an' return to me with their reports."},{"name":"LEONULFE","text":"Aye, things are goin' well enough. Been runnin' into a bit o' trouble with those giant bugs in these woods, though."},{"name":"GUENARET","text":"Nothing out of the ordinary here. There's just the one bird that won't shut up. Haven't been able to catch a wink for all its bloody screeching..."},{"name":"AIMEBERT","text":"Had ourselves a bit of an incident the other day. Some fiend came stompin' out of the tree line an' gobbled up one of our fresh-caught birds. Wasn't a damn thing we could do about it. If we're goin' to keep on in this area, we'll need some extra hands. You tell the chief that."},{"name":"MARCECHAMP","text":"So they've all got issues...but none of 'em thought to ask me for help. Do they think I'll bite off their heads or somethin'!?"},{"name":"MARCECHAMP","text":"At any rate, I'd best prepare to round up the birds from each camp. Thanks again for your help, friend. Say...since you've already struck up an acquaintance with my people an' all, maybe you'd be willin' to lend 'em a hand? Seems they talk to you of their troubles readily enough."}],"reward":{"gil":631,"aetherCurrent":1,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"quests":[67145]},"next":[67308,67309,67310]},"partials":[{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1011923","obj":{"i":1011923,"n":"Leonulfe","l":2000,"q":5}},{"type":"npc","id":"1011924","obj":{"i":1011924,"n":"Guenaret","l":2000,"q":4}},{"type":"npc","id":"1011932","obj":{"i":1011932,"n":"Aimebert","l":2000,"q":4}},{"type":"quest","id":"67145","obj":{"i":67145,"n":"Where the Chocobos Roam","g":3,"l":"Coerthas Western Highlands","s":30}},{"type":"quest","id":"67308","obj":{"i":67308,"n":"Something's Bugging the Chocobos","g":98,"l":"The Dravanian Forelands","s":5202}},{"type":"quest","id":"67309","obj":{"i":67309,"n":"Why Does the Caged Bird Sing","g":98,"l":"The Dravanian Forelands","s":5203}},{"type":"quest","id":"67310","obj":{"i":67310,"n":"Saving the Bait","g":98,"l":"The Dravanian Forelands","s":5204}}]}