{"quest":{"name":"A Trap to Yawn For","location":"The Dravanian Forelands","id":67314,"patch":3.0,"sort":5206,"eventIcon":71221,"issuer":1011918,"target":1011918,"genre":98,"journal":["Virgeaume needs someone to help him with his new trap.","Virgeaume has designed a new chocobo trap, and needs you to obtain a key component. Take yourself to the caves to the south and look for a lampshade mushroom.","You have obtained the lampshade mushroom. Deliver it to Virgeaume, who awaits you at Tailfeather.","Virgeaume chops up the mushroom and mixes it well with some regular gysahl greens. Next, he bids you take this peculiar salad upstream and place it on a bed of straw he has prepared.","You have placed the gysahl greens on the straw. Report the completion of your task to Virgeaume.","Virgeaume proudly explains to you the workings of the trap. The mushroom induces drowsiness in chocobos, rendering them easier to capture, and without risk of causing injury."],"objectives":["Obtain a lampshade mushroom.","Deliver the lampshade to Virgeaume.","Place the gysahl greens on the straw.","Report to Virgeaume."],"dialogue":[{"name":"VIRGEAUME","text":"Ah, you've come at the perfect time. I've designed a new trap that's sure to snare even the cleverest of chocobos, and I need someone to help me with the final step."},{"name":"VIRGEAUME","text":"Do you know the caves south of here? Rare glowing mushrooms called lampshades grow there, and they are essential to my trap. Could you fetch me one while I work on the finishing touches?"},{"name":"VIRGEAUME","text":"The mushrooms I need grow in the caves to the south. Please fetch me one while I see to the finishing touches on my trap."},{"name":"VIRGEAUME","text":"There you are. Do you have the mushroom?"},{"name":"VIRGEAUME","text":"Yes, this glow is unmistakable! Now I have but to chop it up and mix it with some gysahl greens..."},{"name":"VIRGEAUME","text":"And with that, the bait is ready! Seeing as you're already here, might I ask you for one more favor? A short distance upstream, you'll find a bed of straw. I need you to put these <span class=\"emphasis\">special</span> gysahl greens on top of it."},{"name":"VIRGEAUME","text":"A short distance upstream, you'll find a bed of straw. I need you to put the <span class=\"emphasis\">special</span> gysahl greens on top of it."},{"name":"SYSTEM","text":"The gysahl greens have been placed."},{"name":"VIRGEAUME","text":"...You've placed the bait? Good! Now, you're doubtless curious as to how the trap works. It is truly simple: the mushroom you brought induces drowsiness in chocobos."},{"name":"VIRGEAUME","text":"This will allow us to capture the birds without risk of causing them injury. Far gentler than pitfalls, wouldn't you say?"},{"name":"SYSTEM","text":"This appears to be the bed of straw Virgeaume mentioned. Place the gysahl greens on top."}],"reward":{"gil":702,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"questsType":"all","quests":[67148,67306]}},"partials":[{"type":"npc","id":"1011918","obj":{"i":1011918,"n":"Virgeaume","l":2000,"q":2}},{"type":"quest","id":"67148","obj":{"i":67148,"n":"Gifts for the Outcasts","g":3,"l":"The Dravanian Forelands","s":33}},{"type":"quest","id":"67306","obj":{"i":67306,"n":"Clever Chicks","g":98,"l":"The Dravanian Forelands","s":5205}}]}