{"quest":{"name":"Persistence Makes Perfect","location":"The Dravanian Forelands","id":67319,"patch":3.0,"sort":5216,"icon":100471,"eventIcon":71221,"issuer":1014494,"target":1011917,"involved":[1014495,1014498,1014499,1014500],"genre":98,"journal":["Q'yantaa refuses to give up on Hudde.","Q'yantaa wants to try one more time to convince Hudde to join up with her, and enlists your help to go looking for him. She rushes off to the northeast. Go after her in search of any clues of Hudde's whereabouts.","There are even fewer Dravanian lilies blooming than the first time you picked them. Q'yantaa rushes to the northwest, as if she had caught the scent of a certain someone. Follow her deeper into the forest and see if her instincts were correct.","You follow along Hudde's trail and come upon a single petal from a Dravanian lily. Q'yantaa proceeds further into the forest, certain that Hudde is not far ahead. Follow on her heels before she abandons you in her eagerness.","Q'yantaa's tracking skills bring you to a recently abandoned camp. The novice hunter seems convinced that it was none other than Hudde who camped there, and ventures deeper into the woods. Follow her to see where this hunt will end.","Among some dragon-infested ruins you find a Dravanian lily placed in front of a pile of rubble. Q'yantaa seems confused as to why such flowers would be placed here, and bids you investigate the lily for clues.","Your inspection of the Dravanian lily is interrupted by Hudde, who is surprised that Q'yantaa was able to track him down despite the efforts he made to hide his tracks. However, he remains adamant that Q'yantaa is unfit to be his partner. After she prods him for an explanation, Hudde relates to you the tragic story of his previous partner, who died at these selfsame ruins during a routine hunt. After Hudde finishes his tale, Q'yantaa restates her desire to learn the ways of hunting under Hudde's tutelage, and ensures him that she will not meet the same fate as Hudde's previous partner. Hudde, moved by the strength of her conviction, finally agrees to take her under his wing, but warns that being his partner will be far from easy. Hudde and Q'yantaa return to Tailfeather to make preparations for their first hunt together. Bring news of this new partnership to Loupard.","Loupard is overjoyed at the good news, and is confident that the pairing is beneficial for both hunters. Q'yantaa will soon begin her journey to become one of the realm's great chocobo hunters, and Hudde will finally be able to leave behind his tragic past."],"objectives":["Speak with Q'yantaa.","Speak with Q'yantaa again.","Speak with Q'yantaa at the camp.","Speak once more with Q'yantaa.","Investigate the Dravanian lily.","Report to Loupard."],"dialogue":[{"name":"QYANTAA","text":"I can't give up on Hudde yet. He <span class=\"emphasis\">needs</span> to be my partner!"},{"name":"QYANTAA","text":"We can't give up... We need to find him! <span class=\"highlight\">Forename</span>, come with me and we can cover more ground! Don't get lost in the woods!"},{"name":"QYANTAA","text":"I saw him head off to the northeast! Hurry before we lose his trail!"},{"name":"QYANTAA","text":"I could've sworn there were more lilies here before. You think Hudde might've picked them?"},{"name":"QYANTAA","text":"Let's keep moving!"},{"name":"QYANTAA","text":"It's a petal from a Dravanian lily! We're getting close, I can sense it. Come on, <span class=\"highlight\">Forename</span>!"},{"name":"QYANTAA","text":"<span class=\"highlight\">Forename</span>, look! The fire's still smoking. He's not far now!"},{"name":"QYANTAA","text":"Hmmm, it's a Dravanian lily... But why would he leave it here?"},{"name":"QYANTAA","text":"Why would Hudde leave a lily here?"},{"name":"HEUDE","text":"You!? What in the seven hells are you doing here!?"},{"name":"QYANTAA","text":"Hudde! Well...I really wanted to be your partner, so I may have...<span class=\"emphasis\">stalked</span> you..."},{"name":"HEUDE","text":"Hmph, you managed to track me here despite my efforts to hide my tracks─an impressive feat. Nonetheless, as I said before, you'd best give up your childish hopes. We will never hunt together."},{"name":"QYANTAA","text":"If you won't be my partner, at least tell me why!"},{"name":"HEUDE","text":"...Very well, I suppose you deserve that much. My...my last partner died in this very spot. It was a hunt routine as any other, and I looked away but for a second..."},{"name":"HEUDE","text":"I can't bear a loss such as that again... My next partner can't be someone who'll die on me. But you─you're still half a child."},{"name":"QYANTAA","text":"Well, half a child or no, dying ain't anywhere on my list of things to do! The forest is vast, and I mean to learn every ilm of it! And I wanna learn from <span class=\"emphasis\">you</span>!"},{"name":"HEUDE","text":"Is there something stuck 'twixt your─"},{"name":"HEUDE","text":"...Aye, the conviction in your eyes is plain to see, I admit. Loupard didn't say you'd be so damned stubborn..."},{"name":"HEUDE","text":"&lt;sigh&gt; Conviction alone won't keep you alive in the wilds. A child like you won't last long...unless you're under <span class=\"emphasis\">my</span> protection!"},{"name":"HEUDE","text":"I'll have you know, being my partner will take everything you've got! Be ready to hunt at first light tomorrow!"},{"name":"QYANTAA","text":"What!? You...you mean─"},{"name":"HEUDE","text":"Don't make me repeat myself! We'll return to Tailfeather at once. Watch out for bandersnatches on our way back!"},{"name":"LOUPARD","text":"<span class=\"highlight\">Forename</span>! Any luck gettin' through to Hudde?"},{"name":"LOUPARD","text":"...That's about as good an outcome as I could've hoped for! Looks like Q'yantaa's got a bright future ahead of her, and perhaps Hudde'll be able to move on from his tragedy."},{"name":"LOUPARD","text":"Ever since his partner died, he's done nothin' but wallow in misery. It would've been a right shame if a hunter with his talent wasn't out there catchin' chocobos."},{"name":"LOUPARD","text":"I daresay that Hudde's hardheadedness and Q'yantaa's huntin' instincts will make the perfect match. I look forward to seein' their partnership blossom!"}],"reward":{"gil":502,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"questsType":"all","quests":[67147,67318]},"next":[67458]},"partials":[{"type":"npc","id":"1014494","obj":{"i":1014494,"n":"Q'yantaa","l":2000,"q":2}},{"type":"npc","id":"1011917","obj":{"i":1011917,"n":"Loupard","l":2000,"q":9}},{"type":"npc","id":"1014495","obj":{"i":1014495,"n":"Q'yantaa","l":2000,"q":2}},{"type":"npc","id":"1014498","obj":{"i":1014498,"n":"Q'yantaa","l":2000,"q":1}},{"type":"npc","id":"1014499","obj":{"i":1014499,"n":"Q'yantaa","l":2000,"q":1}},{"type":"npc","id":"1014500","obj":{"i":1014500,"n":"Q'yantaa","l":2000,"q":2}},{"type":"quest","id":"67147","obj":{"i":67147,"n":"The Trine Towers","g":3,"l":"The Dravanian Forelands","s":32}},{"type":"quest","id":"67318","obj":{"i":67318,"n":"A Budding Partnership","g":98,"l":"The Dravanian Forelands","s":5215}},{"type":"quest","id":"67458","obj":{"i":67458,"n":"Getting a Legtrap Up","g":98,"l":"The Dravanian Forelands","s":5702}}]}