{"quest":{"name":"Needs More Salt","location":"The Dravanian Forelands","id":67315,"patch":3.0,"sort":5207,"eventIcon":71221,"issuer":1011916,"target":1011916,"genre":98,"journal":["The forest is under threat, and Marcechamp needs your help to save it.","Slugs have infested the forest around Tailfeather, and Marcechamp requests your assistance in their extermination. Sprinkle the solution he gave you on trees in the south of the Chocobo Forest, and slay any slugs that appear.","You have slain your fair share of the slugs, thus preserving the health of the forest. Return to Marcechamp with the tale of your success.","Marcechamp thanks you for your assistance. He goes on to explain that a healthy forest means happy chocobos, which in turn means happy hunters─a mutually beneficial relationship."],"objectives":["Use the solution on trees and slay slugs.","Report to Marcechamp."],"dialogue":[{"name":"MARCECHAMP","text":"Ah, <span class=\"highlight\">Forename</span>, just the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> I was lookin' for! Slugs've taken to infestin' the surroundin' woods, an' I need your help gettin' rid of 'em."},{"name":"MARCECHAMP","text":"I've already got some people on the job, but the slimy buggers multiply faster than they can kill 'em!"},{"name":"MARCECHAMP","text":"At the moment, we're short on hands in the south of the Chocobo Forest. Go there quick as you can, an' use this here solution to lure the slugs out. I reckon you know what to do after that."},{"name":"MARCECHAMP","text":"Hurry to the south of the Chocobo Forest, an' sprinkle that solution on trees to lure the slugs out. You know what to do after that."},{"name":"MARCECHAMP","text":"Took care of the slugs, did you? My thanks, friend. I shudder to think what might've happened had they gotten out of control."},{"name":"MARCECHAMP","text":"If the forest dies, the chocobos would stop comin' here. Needless to say that's bad news for us. By protectin' the forest, we keep the birds happy, which in turn makes us happy. A mutually beneficial relationship, no?"},{"name":"MARCECHAMP","text":"What? What's the solution made of, you ask? Well, the main ingredient's chocobo─actually, never mind. Some things are best left unknown! Bwahaha!"}],"reward":{"gil":602,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"quests":[67148]},"next":[67316,67320]},"partials":[{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"quest","id":"67148","obj":{"i":67148,"n":"Gifts for the Outcasts","g":3,"l":"The Dravanian Forelands","s":33}},{"type":"quest","id":"67316","obj":{"i":67316,"n":"Uninvited Guests","g":98,"l":"The Dravanian Forelands","s":5209}},{"type":"quest","id":"67320","obj":{"i":67320,"n":"Wet Strings Attached","g":98,"l":"The Dravanian Forelands","s":5208}}]}