{"quest":{"name":"A Budding Partnership","location":"The Dravanian Forelands","id":67318,"patch":3.0,"sort":5215,"icon":100471,"eventIcon":71221,"issuer":1011917,"target":1014494,"involved":[1011916,1011919,1014480,1014495,1014496],"genre":98,"journal":["Loupard wants to try something new in his search for Q'yantaa's partner.","Taking the previous two failures to heart, Loupard has decided to try a different approach in the search for Q'yantaa's partner. He bids her introduce herself to an experienced hunter by the name of Hudde, and she rushes off, eager to elevate her hunting career. The unpleasant experience with Bauricoin is still fresh in Loupard's mind, and he asks you to look after Q'yantaa until this new partnership is solidified. Find Hudde in the north part of Tailfeather to see how the two are getting on.","Hudde skips his own introduction, brusquely exclaiming that he has no need for a partner such as Q'yantaa, and walks off without giving you the chance to convince him otherwise. Q'yantaa, as always, looks like she may have a plan to get what she wants. Speak with her to find out what she means to do.","Despite Hudde's harsh dismissal of her partnership, Q'yantaa is determined to win him over. She decides that the best course of action will be to soothe his cool demeanor by appealing to his soft side. Talk to the hunters of Tailfeather to find out if there are any chinks in Hudde's stoic armor.","After asking around, it seems that despite Hudde's established reputation as a hunter, few know much about him. However, Loupard mentions in passing one thing that may be of interest: Hudde can often be seen carrying Dravanian lilies on his self, although what for remains a mystery. Report your findings to Q'yantaa and see if the cunning Miqo'te has any insight.","Q'yantaa's clever plan is to win Hudde over by presenting him with a Dravanian lily. She runs off in search of the flower, which supposedly grows in the vicinity of the northeast chocobo hunter camp. Follow her to ensure that in her enthusiasm she does not trample over any precious lilies.","You find Q'yantaa standing in front of a fully bloomed Dravanian lily. In a predictable turn of events, she asks you to pick the flower for the sake of her budding partnership. Steady your hands and pick the lily, and make sure nary a petal comes to harm.","You manage to pick the flower with the grace of a skilled florist. Hand it over to Q'yantaa so she may use it to convince Hudde that she is more than just a naive girl.","Q'yantaa rushes off in the direction of Tailfeather, eager to please her future hunting partner. Follow her back and see if her well-intentioned gift will prove to be successful.","Although Q'yantaa smiles wide when presenting the Dravanian lily to Hudde, the action is met with scorn by the gruff hunter. Despite the plain hopelessness of the situation, Q'yantaa is still determined to have Hudde as her partner, and begins devising the next step in her plan."],"objectives":["Speak with Hudde.","Speak with Q'yantaa.","Inquire about Hudde.","Report to Q'yantaa.","Meet with Q'yantaa.","Obtain a Dravanian lily.","Give the Dravanian lily to Q'yantaa.","Meet with Q'yantaa."],"dialogue":[{"name":"QYANTAA","text":"There's gotta be a capable partner for me <span class=\"emphasis\">somewhere</span>..."},{"name":"LOUPARD","text":"Aye, I know we've had our troubles with the past couple of “hunters” I've introduced Q'yantaa to. It might be time to go about this partner business a different way..."},{"name":"LOUPARD","text":"It might be best to introduce her to someone what knows their way 'round a chocobo trap. Just so happens, I know a seasoned hunter by the name of Hudde that's lookin' for a partner. You should be able to find him in the north part of camp. Seek him out an' make your acquaintances."},{"name":"QYANTAA","text":"A <span class=\"emphasis\">seasoned</span> hunter!? So he won't weigh me down like the others? This might be the start of a profitable relationship!"},{"name":"LOUPARD","text":"<span class=\"highlight\">Forename</span>, I'm gonna need you to look after Q'yantaa again. Hudde's known to be a dependable hunter, but one can never be too careful..."},{"name":"LOUPARD","text":"I've got a good feelin' about this one..."},{"name":"QYANTAA","text":"Hmph! What's <span class=\"emphasis\">wrong</span> with the hunters in this camp!?"},{"name":"HEUDE","text":"Ah, the child's guard dog comes nipping at her heels."},{"name":"HEUDE","text":"I'll tell you what I told her: I've been hunting since before you were but a whelp at your mum's teats. I've got no inkling what Loupard told you, but I've got no patience to be holding some child's hand. Tell Loupard he'd best not waste my time again when there's hunting to be done."},{"name":"QYANTAA","text":"Does every hunter in this camp have a stick up their arse!? He barely let me get a word in!"},{"name":"QYANTAA","text":"But...he's exactly the kind of partner I need! If I'm gonna learn hunting, who better to teach me than him? "},{"name":"QYANTAA","text":"There has to be a way to convince him, we just need to put our heads together..."},{"name":"QYANTAA","text":"Ah hah! Even a hardened hunter like him <span class=\"emphasis\">has</span> to have a soft spot. He can't be that joyless <span class=\"emphasis\">every</span> second of the day."},{"name":"QYANTAA","text":"He's been in this camp for a while, right? <span class=\"emphasis\">Someone</span> is like to know him well. Might be they know how we could get him to warm up to me! Come on, <span class=\"highlight\">Forename</span>, let's ask around and see if we can't find out more about my future partner!"},{"name":"QYANTAA","text":"Even a hunter such as him's gotta smile sometimes. Let's ask around and get to know my future partner!"},{"name":"LOUPARD","text":"...Can't say I know much about Hudde outside of huntin'... Well, come to think of it, I often see him carryin' around flowers. They're always the same, Dravanian lilies if I'm not mistaken."},{"name":"MARCECHAMP","text":"You wanna know about Hudde? Well...seems there's some ruins he visits often, but I've got no notion what for."},{"name":"REMACLON","text":"Eh? Hudde ain't exactly the type to warm up to people. He certainly hasn't warmed up to <span class=\"emphasis\">me</span>."},{"name":"LOUPARD","text":"I remember because Dravanian lilies ain't easy to come by. I wonder what he does with them..."},{"name":"MARCECHAMP","text":"'Course, knowin' Hudde, it's probably for the best not to pry too deep into his past."},{"name":"REMACLON","text":"I respect his huntin', but I can't say I know him any better than that."},{"name":"QYANTAA","text":"So? What'd the other hunters have to say about Hudde?"},{"name":"QYANTAA","text":"Dravanian lilies!? I just <span class=\"emphasis\">knew</span> we'd find his weakness if we dug deep enough! Although, I would've never guessed it'd be <span class=\"emphasis\">flowers</span>..."},{"name":"QYANTAA","text":"When I present him with a lovely Dravanian lily, he's sure to open up to me. I've heard tell of the lilies growing near the northeast camp. Just wait, Hudde, you'll be my partner yet! "},{"name":"QYANTAA","text":"Look, <span class=\"highlight\">Forename</span>, a Dravanian lily! I <span class=\"emphasis\">would</span> pick it myself, but you see, I'm like to forget my own strength and um...<span class=\"emphasis\">crush</span> it... "},{"name":"QYANTAA","text":"So that's why <span class=\"emphasis\">you</span> need to pick the lily for me, and for Hudde! Be careful!"},{"name":"QYANTAA","text":"The flower's right there. I'll keep a lookout for any flower stampers while <span class=\"emphasis\">you</span> pick it."},{"name":"QYANTAA","text":"Oh my, I've never seen such a delicate touch─you'd make quite the gatherer! Well, let's see it!"},{"name":"QYANTAA","text":"Ah... Now I can see why even a hunter like Hudde would be partial to <span class=\"emphasis\">this</span> flower. <span class=\"highlight\">Forename</span>, accompany me to Tailfeather and we'll finally be done with this partner business!"},{"name":"HEUDE","text":"You again? I'll say it only once more: I'm not partnering with a wet-behind-the-ears hunter."},{"name":"QYANTAA","text":"Hudde, I brought this...for you!"},{"name":"HEUDE","text":"Aren't you that br─ What's this...a Dravanian lily?"},{"name":"HEUDE","text":"&lt;scoff&gt; You think you can win me over with a flower?"},{"name":"HEUDE","text":"What in the seven hells were you thinking!? I can pick as many of these damned lilies as I please─on my own!"},{"name":"HEUDE","text":"It doesn't matter what you do, you ain't fit to be my partner! I seen a hunter coddling a hatchling none too long ago, I reckon <span class=\"emphasis\">he'd</span> be more befitting!"},{"name":"QYANTAA","text":"&lt;sigh&gt; What a stubborn old fool...flowers usually <span class=\"emphasis\">never</span> fail. Hmmm...I'll just have to think of some other way..."}],"reward":{"gil":631,"items":[{"id":10797,"one":1,"hq":1},{"id":10881,"one":1,"hq":1},{"id":10923,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"questsType":"all","quests":[67147,67317]},"next":[67319]},"partials":[{"type":"npc","id":"1011917","obj":{"i":1011917,"n":"Loupard","l":2000,"q":9}},{"type":"npc","id":"1014494","obj":{"i":1014494,"n":"Q'yantaa","l":2000,"q":2}},{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1011919","obj":{"i":1011919,"n":"Remaclon","l":2000,"q":4}},{"type":"npc","id":"1014480","obj":{"i":1014480,"n":"Q'yantaa","l":2000,"q":6}},{"type":"npc","id":"1014495","obj":{"i":1014495,"n":"Q'yantaa","l":2000,"q":2}},{"type":"npc","id":"1014496","obj":{"i":1014496,"n":"Hudde","l":2000,"q":1}},{"type":"item","id":"10797","obj":{"i":10797,"n":"Holy Rainbow Hat of Aiming","l":125,"c":41263,"t":34,"p":12474}},{"type":"item","id":"10881","obj":{"i":10881,"n":"Holy Rainbow Hat of Healing","l":125,"c":41264,"t":34,"p":12474}},{"type":"item","id":"10923","obj":{"i":10923,"n":"Wyvernskin Mask of Casting","l":125,"c":40451,"t":34,"p":18711}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67147","obj":{"i":67147,"n":"The Trine Towers","g":3,"l":"The Dravanian Forelands","s":32}},{"type":"quest","id":"67317","obj":{"i":67317,"n":"The Man Who Slew Too Much","g":98,"l":"The Dravanian Forelands","s":5214}},{"type":"quest","id":"67319","obj":{"i":67319,"n":"Persistence Makes Perfect","g":98,"l":"The Dravanian Forelands","s":5216}}]}