{"quest":{"name":"I Wanna Be the Hunter","location":"The Dravanian Forelands","id":67311,"patch":3.0,"sort":5211,"icon":100471,"eventIcon":71221,"issuer":1011917,"target":1011917,"involved":[1014480],"genre":98,"journal":["Loupard is looking for someone to watch over a novice hunter.","Loupard has been kind enough to tell you everything you'd like to know about the hunters at Tailfeather. Among many other facts, you learn that the prospect of a quick fortune brings many inexperienced hunters to Tailfeather in hopes of joining in on the lucrative chocobo hunting trade. He introduces you to Q'yantaa, a young Miqo'te who wishes to fill her pockets in the Dravanian forelands. Loupard's explanation turns into a request when he explains to you that she is in need of a partner, entrusting you with the care of the fledgling hunter until he can find someone willing to team up with her. Speak to Q'yantaa to hear her plan and judge whether or not she has a hunter's instincts.","Q'yantaa, while inexperienced, already has a plan to catch her very first chocobo. One of the most difficult parts of catching the birds is tricking their keen sense of smell, which can detect the scent of even the most cautious hunter. Q'yantaa plans to use a fragrant mushroom called chandler's wick to mask the betraying odors, and asks you to gather several to be used in the chocobo traps. Head east of Tailfeather and let your nose guide you to where the mushrooms grow.","After gathering the mushrooms, you learn that “fragrant” was hardly the adequate word to use when describing their scent. Try to keep from retching while you return to Tailfeather and deliver the mushrooms to Q'yantaa.","Behind the hand covering her nose, you can tell that Q'yantaa is delighted that you managed to find the mushrooms she requires. Luckily, she volunteers to take care of the task of grinding the mushrooms into a powder to be mixed with the gysahl greens. Return to Loupard and tell him of your first successful operation together.","While Loupard remains skeptical that Q'yantaa's plan will work, he seems impressed at Q'yantaa's creativity. There may be hope for this novice hunter yet."],"objectives":["Speak with Q'yantaa.","Pick chandler's wicks.","Deliver the mushrooms to Q'yantaa.","Report to Loupard."],"dialogue":[{"name":"QYANTAA","text":"What're we standing around for!? There're chocobos just <span class=\"emphasis\">begging</span> to be hunted!"},{"name":"LOUPARD","text":"Well if it isn't the famed <span class=\"highlight\">Forename</span> everyone's been goin' on about! Word travels fast in a camp this small─say, could you lend me your ear for a bit?"},{"name":"LOUPARD","text":"Thanks for keepin' this lonely hunter company! Anyroad, since you're new 'round here, I thought you might wanna know 'bout this place and its denizens."},{"name":"LOUPARD","text":"You see, the hunters of Tailfeather make their way by catchin' the wild chocobos wanderin' 'round these forests and sellin' 'em to the renowned Ishgardian trainers."},{"name":"LOUPARD","text":"You might think us hunters have the easy end of the deal, but you'd change your mind quick enough the first time a dragon breathes down your neck. Add to that all the other hungry beasts lookin' for an easy meal, and you'd be right to doubt the sanity of this whole camp!"},{"name":"LOUPARD","text":"That's why most hunters in the Dravanian forelands are either them that're just tryin' to escape their pitiful lives back home, or them that're crazy enough to get enjoyment from riskin' their necks every day."},{"name":"LOUPARD","text":"'Course, you can't forget those that're just here for a quick bucketful of gil─chasin' the golden chocobo, so to speak. The promise of riches brings new blood from all over Eorzea... Ain't that right, Q'yantaa?"},{"name":"QYANTAA","text":"You got that right! I'm here to bag myself the biggest chocobo Eorzea's ever seen!"},{"name":"LOUPARD","text":"Thing is, chocobo huntin's generally done in pairs, and Q'yantaa here, havin' never trapped an animal herself, is in need of a partner. I know you've got <span class=\"emphasis\">some</span> experience huntin' all manner of beasts, so I'm askin' you to help her out until I find someone suitable."},{"name":"LOUPARD","text":"I can't thank you enough, <span class=\"highlight\">Forename</span>! Q'yantaa's got some ideas for her first hunt. Speak to her and she'll tell you all about them."},{"name":"LOUPARD","text":"I'll be lookin' for a suitable partner for Q'yantaa. Do what you can to show her how huntin's done."},{"name":"QYANTAA","text":"Finally, a partner! Now we can be <span class=\"emphasis\">real</span> hunters! Let's not keep those birds waiting!"},{"name":"QYANTAA","text":"This hunt'll be simple─all we have to do is lure a chocobo out with these gysahl greens. There's only one problem: wild chocobos have a keen sense of smell, and won't come near a trap if they catch even a whiff of a hunter's scent."},{"name":"QYANTAA","text":"But fret not, for I have a plan! Just the other day I came across some mushrooms whose reek I can <span class=\"emphasis\">still</span> smell. If we use them to hide our scent, those chocobos'll be none the wiser."},{"name":"QYANTAA","text":"I'll take care of arranging the gysahl greens for the trap, and I need my partner─that's <span class=\"emphasis\">you</span>─to go and pick that pungent fungus for me."},{"name":"QYANTAA","text":"It seems the hunters call the mushroom “chandler's wick,” and about five or so should do the trick. Just head out east of Tailfeather for a bit, and use your nose to guide you the rest of the way."},{"name":"QYANTAA","text":"Chandler's wick... I wonder why they call it that? Anyroad, head out east for a few yalms, and you'll be able to smell them before long!"},{"name":"QYANTAA","text":"Say nothing, partner. Judging by your charming odor, you've already picked the mushrooms we need!"},{"name":"QYANTAA","text":"Yes, these're th─my gods, the stench is even worse up close! Here, I'll put them in my bag before the whole camp retches."},{"name":"QYANTAA","text":"Alright partner, looks like <span class=\"emphasis\">I</span> have the unenviable job of mixing these mushrooms with the gysahl greens. Say, why don't <span class=\"emphasis\">you</span> tell Loupard what a good team we make?"},{"name":"QYANTAA","text":"The smell could mask a morbol's scent!"},{"name":"LOUPARD","text":"What in the seven hells'd she have you do? &lt;sniff&gt; ...She's gonna mask your scent with <span class=\"emphasis\">that</span>!? Can't say anythin' 'bout how wise that plan is, but it sure is interestin'."},{"name":"LOUPARD","text":"As I'm sure you've gathered from the tail an' ears, Q'yantaa's a Miqo'te, and huntin's in their blood. Could be this plan might actually work..."},{"name":"LOUPARD","text":"Anyroad, it seems you two're gettin' along better than I could've hoped. Keep on with her, and I'll keep askin' around for anyone lackin' a partner."}],"reward":{"gil":502,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"quests":[67145]},"next":[67312]},"partials":[{"type":"npc","id":"1011917","obj":{"i":1011917,"n":"Loupard","l":2000,"q":9}},{"type":"npc","id":"1014480","obj":{"i":1014480,"n":"Q'yantaa","l":2000,"q":6}},{"type":"quest","id":"67145","obj":{"i":67145,"n":"Where the Chocobos Roam","g":3,"l":"Coerthas Western Highlands","s":30}},{"type":"quest","id":"67312","obj":{"i":67312,"n":"A Natural Instinct","g":98,"l":"The Dravanian Forelands","s":5212}}]}