{"quest":{"name":"Wet Strings Attached","location":"The Dravanian Forelands","id":67320,"patch":3.0,"sort":5208,"eventIcon":71221,"issuer":1013365,"target":1013365,"genre":98,"journal":["The hunter is staring into the basin with tears in her eyes.","A jumpy hunter has asked you to recover her favorite bow after she dropped it into the Hundred Throes. It should not have gone far. Get your feet wet and start searching.","You have found the lost bow downstream. Return it to the distressed hunter so she can defend herself.","You have given the hunter her bow, much to her elation. Unfortunately, she can no longer use it due to a damaged bowstring. She will return to Tailfeather for repairs."],"objectives":["Obtain the lost bow.","Deliver the bow to the hunter."],"dialogue":[{"name":"BAREHANDSHUNTER01784","text":"...Gah! Don't sneak up on me like that! Sorry... I've been a bit jumpy ever since a bandersnatch howl startled me and I dropped my favorite bow in the river."},{"name":"BAREHANDSHUNTER01784","text":"I want to go and retrieve my bow, but I dare not wander the wilderness unarmed. There are so many dangerous things out there... Say, you look like a capable sort. Do you think you could go and find the weapon in my stead?"},{"name":"BAREHANDSHUNTER01784","text":"With any luck, it might have just floated downstream a bit. You might get wet, but if you could recover it you would have my gratitude."},{"name":"BAREHANDSHUNTER01784","text":"It has to be somewhere around here... Bows don't just up and disappear! It probably didn't float downstream very far. I'm counting on you to find it!"},{"name":"BAREHANDSHUNTER01784","text":"The bow should be in this area somewhere... I'll just be waiting over here!"},{"name":"BAREHANDSHUNTER01784","text":"&lt;gasp&gt; You found my bow! Oh, thank you so much! Now I can finally get back to hunting!"},{"name":"BAREHANDSHUNTER01784","text":"Oh, no, the bowstring is damaged... I'll have to take it to the bowyer at Tailfeather."}],"reward":{"gil":415,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"questsType":"all","quests":[67148,67315]}},"partials":[{"type":"npc","id":"1013365","obj":{"i":1013365,"n":"Harrowed Hunter","l":2000,"q":1}},{"type":"quest","id":"67148","obj":{"i":67148,"n":"Gifts for the Outcasts","g":3,"l":"The Dravanian Forelands","s":33}},{"type":"quest","id":"67315","obj":{"i":67315,"n":"Needs More Salt","g":98,"l":"The Dravanian Forelands","s":5207}}]}