{"quest":{"name":"Low-hanging Fruit","location":"The Dravanian Forelands","id":67323,"patch":3.0,"sort":5218,"eventIcon":71221,"issuer":1012282,"target":1012282,"genre":98,"journal":["The Vath Hungerer is casting furtive glances in the direction of Mare's Oath.","The Hungerer describes to you a tree that grows on a raised area in front of Mare's Oath. The fruit of that tree, she explains, is beyond compare─the riper the better. The ripest fruit falls from its branches to the ground beneath. She asks that you gather three of these fruits for her.","You find the tree where the Hungerer said it would be. You collect the fruit as requested, their sweet, overripe odor hanging about you. Take them back to the waiting Hungerer at Loth ast Vath.","The Hungerer is elated to receive the fruit, but Cibleroit nearby regards them with disgust. This occasional difficulty in seeing eye-to-compound-eye is one of the many elements of individuality that brings variety to life in the Nonmind."],"objectives":["Obtain fruit.","Deliver the fruit to the Vath Hungerer."],"dialogue":[{"name":"UMASOU","text":"Fruit. Delicious fruit. The mere thought of it makes our mandibles itch. &lt;click&gt; &lt;click&gt;"},{"name":"UMASOU","text":"Do you know the high ground near Mare's Oath? A great tree grows there. Its fruit is delicious. The ripest fruit falls to the ground, ready to be eaten. &lt;click&gt; &lt;click&gt; Please fetch us three of these fruits."},{"name":"UMASOU","text":"Delicious fruit. Ripe fruit. Would you fetch us the fruit? Near Mare's Oath. The great tree."},{"name":"CIBLEROIT","text":"Why do you love that fruit so much?"},{"name":"UMASOU","text":"We smell the fruit! &lt;click&gt; &lt;click&gt; And it makes our mandibles itch!"},{"name":"UMASOU","text":"So sweet and so soft... &lt;click&gt; &lt;click&gt; These fruits are amazing. Thank you, generous hunter."},{"name":"CIBLEROIT","text":"We cannot understand why you like this fruit. &lt;click&gt; &lt;click&gt; The smell is disgusting and the texture is worse than disgusting."},{"name":"UMASOU","text":"We pity you. Your life is poorer for your bad taste. But that is well, for it means more fruit for us! &lt;click&gt; &lt;click&gt; &lt;click&gt; Being Nonmind is not always bad, we think."}],"reward":{"gil":502,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"quests":[67149]}},"partials":[{"type":"npc","id":"1012282","obj":{"i":1012282,"n":"The Hungerer","l":2000,"q":2}},{"type":"quest","id":"67149","obj":{"i":67149,"n":"The Nonmind","g":3,"l":"The Dravanian Forelands","s":34}}]}