{"quest":{"name":"Yellow Stones","location":"The Dravanian Forelands","id":67329,"patch":3.0,"sort":5304,"eventIcon":71221,"issuer":1011931,"target":1011931,"genre":98,"journal":["The voracious Vath is staring towards the southern sky.","The voracious Vath has asked you to collect four yellow pebbles for him. Such pebbles can be found in the craters to the south of Anyx Trine.","You successfully obtain the requested stones. Take them back to the voracious Vath at Loth ast Vath.","The voracious Vath is impressed with how quickly you retrieved the yellow pebbles. He tells you that they are one of the main ingredients of Gnathic firesand, but seems uneager to go into the details of what else is required."],"objectives":["Obtain yellow pebbles.","Deliver the pebbles to the voracious Vath."],"dialogue":[{"name":"NANKAEATER","text":"Are you looking for work, hunter? You come at a good time. We have work for you. We would like you to bring us some materials."},{"name":"NANKAEATER","text":"To the south of the place men call Anyx Trine, there are craters. In these craters are yellow pebbles. Please collect four yellow pebbles from these craters. Please collect these pebbles and bring them to me."},{"name":"NANKAEATER","text":"The yellow pebbles should be in the craters. The craters are south of Anyx Trine."},{"name":"NANKAEATER","text":"Do you have the pebbles, hunter?"},{"name":"NANKAEATER","text":"Thank you, generous hunter. You waste no time."},{"name":"NANKAEATER","text":"These stones are used to make Gnathic firesand. We grind the stones and mix them with our...errr... &lt;click&gt; &lt;click&gt; &lt;click&gt; &lt;click&gt; Actually, we would prefer not to go into details. "}],"reward":{"gil":567,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"all","quests":[67150,67327]}},"partials":[{"type":"npc","id":"1011931","obj":{"i":1011931,"n":"Voracious Vath","l":2000,"q":3}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67327","obj":{"i":67327,"n":"Feat of Clay","g":98,"l":"The Dravanian Forelands","s":5222}}]}