{"quest":{"name":"Freedom of Choice","location":"The Dravanian Forelands","id":67324,"patch":3.0,"sort":5219,"eventIcon":71221,"issuer":1011930,"target":1011930,"genre":98,"journal":["Cibleroit stares longingly into the distance.","Cibleroit has become enraptured with the thought of eating the meat of the nearby loaghtans. He asks you to cross the nearby river and hunt these loaghtans, collecting three flanks of their succulent meat.","You slaughter the loaghtans like cattle. Return to Loth ast Vath with your haul.","Cibleroit and the Hungerer both agree: the meat is exquisite. One advantage of being of the Nonmind is the right of individuals to decide for themselves what they will eat. In the Onemind, only members of the warrior caste have the privilege of eating meat."],"objectives":["Kill loaghtans and obtain their meat.","Deliver the meat to Cibleroit."],"dialogue":[{"name":"CIBLEROIT","text":"Hunter, we have another request to make of you. The loaghtans on the far side of the river─their meat is delicious. Please bring us some of their delicious meat. &lt;click&gt; &lt;click&gt;"},{"name":"UMASOU","text":"&lt;click&gt; &lt;click&gt; We overheard your conversation. The loaghtan's meat truly is delicious. But that you would try to keep it to yourself? We think it is not fair."},{"name":"CIBLEROIT","text":"We were not talking to you, Hungerer. Do you so miss hearing the thoughts of others? But you are right. It is not fair. Very well. Hunter, please bring us three flanks of delicious loaghtan meat. &lt;click&gt; &lt;click&gt;"},{"name":"CIBLEROIT","text":"Please bring us three flanks of loaghtan meat. Our mandibles itch at the thought of it. &lt;click&gt; &lt;click&gt;"},{"name":"CIBLEROIT","text":"Do you have the delicious meat? &lt;click&gt; &lt;click&gt;"},{"name":"CIBLEROIT","text":"Yes. This is it. This meat is very good. You have brought us very good meat. &lt;click&gt; &lt;click&gt; I cannot wait to eat it."},{"name":"UMASOU","text":"Yes. The smell of this meat is very good. We do not remember the last time we saw such fresh, juicy meat."},{"name":"CIBLEROIT","text":"In the Onemind, only warriors are fed meat. But for ones such as us, to be able to eat meat─and whenever the mood takes us... &lt;click&gt; &lt;click&gt; &lt;click&gt; There are very real advantages to being of the Nonmind!"}],"reward":{"gil":502,"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"questsType":"all","quests":[67149,67322]}},"partials":[{"type":"npc","id":"1011930","obj":{"i":1011930,"n":"Cibleroit","l":2000,"q":3}},{"type":"quest","id":"67149","obj":{"i":67149,"n":"The Nonmind","g":3,"l":"The Dravanian Forelands","s":34}},{"type":"quest","id":"67322","obj":{"i":67322,"n":"To Each His Own","g":98,"l":"The Dravanian Forelands","s":5217}}]}