{"quest":{"name":"A Taste of the Peculiar","location":"The Dravanian Forelands","id":67337,"patch":3.0,"sort":5314,"eventIcon":71221,"issuer":1011940,"target":1011940,"involved":[1011923],"genre":98,"journal":["Though his stomach no longer grumbles, Toh Y Thrah has yet to sate his curiosity.","Toh Y Thrah notices you have not eaten any of the food you brought him, and now he is curious to see what foods you would eat. Although you have no food to give him, you notice he makes mention of people living in the Chocobo Forest. Search for the forest's residents, and see if you can find a meal Toh Y Thrah may enjoy.","You come across a small campsite in the Chocobo Forest, and as luck would have it, a meal slow roasting over an open flame. You speak with Leonulfe, the chef of the seemingly delectable dish, and he agrees to share some with you. In return, he asks that you obtain chocobo meat that he can prepare another serving for later. Slay a wild chocobo for its meat.","You slay a wild chocobo and obtain its meat. Take it to Leonulfe and receive a small helping of his cooking.","You return to the campsite with the wild chocobo meat. Leonulfe thanks you for your quick work, and directs your attention to a plate of freshly fried chocobo he prepared while you were away.","With the fried chocobo in hand, you are ready to return to Toh Y Thrah. Deliver the fried chocobo, and give him his first taste of a properly cooked meal.","You return to Toh Y Thrah with the fried chocobo. He is intrigued by its scent and eagerly takes a bite. To his dismay, however, he finds the taste of cooked meat revolting. He fails to understand why anyone would sacrifice the natural flavors of raw meat."],"objectives":["Speak with the people living in the Chocobo Forest.","Slay a wild chocobo and obtain its meat.","Deliver the chocobo meat to Leonulfe.","Pick up a fried chocobo thigh.","Deliver the fried chocobo thigh to Toh Y Thrah."],"dialogue":[{"name":"TOHYTHRAH","text":"You have fed me well, yet you do not partake of your own spoils. Exactly what do your kind consume for sustenance? Like those living in the Chocobo Forest. I would very much like to try it for myself."},{"name":"TOHYTHRAH","text":"My belly is full, but I am curious to taste the food of your kind."},{"name":"LEONULFE","text":"Lookin' for <span class=\"alternative-container\"><span class=\"alternative\">supper</span><span class=\"alternative\">breakfast</span><span class=\"alternative\">lunch</span></span>, eh? I don't mind sharin', but these ingredients don't come easy. I'll serve you some, but I need more chocobo meat for later."},{"name":"LEONULFE","text":"A small helpin' o' chocobo meat for a meal's a fair trade, I'd say. You're more than welcome to what I have after you bring what I need."},{"name":"TOHYTHRAH","text":"My belly is full, but I am curious to taste the food of your kind."},{"name":"TOHYTHRAH","text":"My belly is full, but I am curious to taste the food of your kind."},{"name":"LEONULFE","text":"Ah, a nice golden brown. I'd say this batch is just about done. You find any chocobo meat?"},{"name":"LEONULFE","text":"Good, good. This'll do just fine. I've a plate for you over there. Take it while it's still hot!"},{"name":"TOHYTHRAH","text":"My belly is full, but I am curious to taste the food of your kind. So tell me, what do you eat?"},{"name":"LEONULFE","text":"There's nothin' like cookin' over an open flame. Keeps the meat nice and tender. Be sure to take the plate before it gets cold."},{"name":"LEONULFE","text":"I guarantee you won't find better. Came up with the recipe myself!"},{"name":"TOHYTHRAH","text":"Hm? &lt;sniff&gt; A peculiar scent. What have you brought me?"},{"name":"TOHYTHRAH","text":"This is what they eat in the Chocobo Forest? &lt;sniff&gt; Interesting... &lt;gulp&gt;"},{"name":"TOHYTHRAH","text":"Ugh, disgusting! Why would one sear the flesh of the meat? The natural flavors are all but gone now. A strange breed indeed..."}],"reward":{"gil":597,"items":[{"num":3,"id":4648,"one":1},{"num":3,"id":7572,"one":1},{"num":3,"id":9335,"one":1}],"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"all","quests":[67150,67336]}},"partials":[{"type":"npc","id":"1011940","obj":{"i":1011940,"n":"Toh Y Thrah","l":2000,"q":3}},{"type":"npc","id":"1011923","obj":{"i":1011923,"n":"Leonulfe","l":2000,"q":5}},{"type":"item","id":"4648","obj":{"i":4648,"n":"Sauteed Coeurl","l":70,"c":24355,"t":46}},{"type":"item","id":"7572","obj":{"i":7572,"n":"Roast Canard","l":90,"c":24361,"t":46}},{"type":"item","id":"9335","obj":{"i":9335,"n":"Bacon Broth","l":110,"c":24103,"t":46}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67336","obj":{"i":67336,"n":"Hungry for Seconds","g":98,"l":"The Dravanian Forelands","s":5313}}]}