{"quest":{"name":"The Hunter Becomes the Kweh","location":"The Dravanian Forelands","id":67333,"patch":3.0,"sort":5301,"unlocksFunction":1,"eventIcon":71341,"issuer":1011916,"target":1011916,"involved":[1011923,1011924,1011932,1013399,1013400],"genre":98,"journal":["Marcechamp is wrestling with a new kind of problem.","One of Marcechamp's hunters was attacked by a chocobo allegedly larger and more fierce than any the hunters have encountered. Marcechamp has asked you to gather any information that would help in the wild bird's capture. Start by asking the leaders of his three camps what they know.","After talking to the leaders of each camp, you find that the chocobo has been terrorizing hunters across the forest. Return to Tailfeather and report to Marcechamp.","You have relayed the information on the wild chocobo to Marcechamp, and he explains to you that the prospect of dealing with a monster as smart as a chocobo is more terrifying than its actual size. Catching this bird will not prove to be an easy task."],"objectives":["Speak with Marcechamp's hunters.","Report to Marcechamp."],"dialogue":[{"name":"MARCECHAMP","text":"One of my men was attacked by a chocobo. You might think that's a common story, what with all the huntin' we do, but I'm told this one was unnaturally big. 'Course, in the end, size don't matter─we can't be havin' our quarry stalkin' <span class=\"emphasis\">us</span>."},{"name":"MARCECHAMP","text":"That's why I'm plannin' to capture the beast afore it harms any more of my men. I already know you as a reliable handler of the birds. That's why I need your help trackin' it down. Think you can lend ol' Marcechamp a hand one more time?"},{"name":"MARCECHAMP","text":"If the prospect piques your interest, it'd be best to start off by askin' the leaders of my camps what they know of the monster. Come back an' share your findin's with me when you're done."},{"name":"MARCECHAMP","text":"I take it you remember where my camps are? Go talk to the leaders of each one an' see what they know of this giant bird."},{"name":"INJUREDHUNTER01797","text":"You ain't never seen a chocobo like this one... Monstrous, it was...with a razor-sharp beak."},{"name":"LEONULFE","text":"From the way I heard it, one of the hunters was attacked unprovoked, and got knocked unconscious by a single kick. Ain't never heard of a chocobo doin' that..."},{"name":"GUENARET","text":"See that cage there? Blasted chocobo pulled the door right off its hinges. Most like it was tryin' to rescue the bird inside."},{"name":"AIMEBERT","text":"That bird ain't scared of us hunters, I can tell you that much. It's rare one of us comes away from an encounter with it unscathed."},{"name":"LEONULFE","text":"The chief says he'll be able to make a full recovery, but I still feel uneasy knowin' that monstrosity is out there somewhere."},{"name":"GUENARET","text":"It's bad enough with all the other beasts we gotta contend with... We'll barely be able to make a livin' if things continue on like this."},{"name":"AIMEBERT","text":"I been huntin' most of my life, but I can't imagine goin' on havin' to risk my neck─or worse─every time I leave the camp."},{"name":"INJUREDHUNTER01797","text":"We're in trouble if there's any other birds that big around... I wouldn't recommend goin' out to those woods alone."},{"name":"CHASERA01797","text":"A chocobo that big... Huntin' it could prove to be an interestin' game."},{"name":"MARCECHAMP","text":"...Seems that chocobo's been stirrin' up trouble all 'round the forest. While you were gatherin' information, I went out an' checked the traps that're set up 'round Tailfeather... Ain't nothin' left of 'em but scattered straw an' broken wood."},{"name":"MARCECHAMP","text":"Can't say we've ever dealt with a problem like this one... Might be that this chocobo is takin' some kind of revenge on us hunters, an' these acts are a means of provokin' us. By all accounts, this chocobo is stronger an' more clever than the rest. I expect capturin' it won't be a simple feat."}],"reward":{"gil":538,"aetherCurrent":1,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"quests":[67150]},"next":[67334]},"partials":[{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1011923","obj":{"i":1011923,"n":"Leonulfe","l":2000,"q":5}},{"type":"npc","id":"1011924","obj":{"i":1011924,"n":"Guenaret","l":2000,"q":4}},{"type":"npc","id":"1011932","obj":{"i":1011932,"n":"Aimebert","l":2000,"q":4}},{"type":"npc","id":"1013399","obj":{"i":1013399,"n":"Injured Hunter","l":2000,"q":1}},{"type":"npc","id":"1013400","obj":{"i":1013400,"n":"Seasoned Tracker","l":2000,"q":2}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67334","obj":{"i":67334,"n":"Chocobo's Last Stand","g":98,"l":"The Dravanian Forelands","s":5302}}]}