{"quest":{"name":"A Lesson in Humility","location":"The Dravanian Forelands","id":67338,"patch":3.0,"sort":5315,"unlocksFunction":1,"eventIcon":71341,"issuer":1011937,"target":1011937,"involved":[1013406,1013407,1013408],"genre":98,"journal":["Ess Khas looks upon you in wonder, curious of your potential.","Ess Khas suspects you are more powerful than you appear, and would see your strength put to good use. He asks that you do battle with his children to teach them a lesson. Travel beyond the tower, and speak with the young dragons of their father's request.","You speak with the youngest of the three, who is incredulous of his father's idea. Not one to argue with his elders, he prepares to fight. Defeat Kohm Gahn and teach him a lesson.","Kohm Gahn is dumbfounded by your prowess in battle, but your work is not yet done. Speak with Kohm Scorh and prepare for another fight.","Kohm Scorh is shocked by your victory over his younger sibling. Although he still doubts your strength, he will not hold back. Defeat Kohm Scorh and show him what you can do.","Yet another young dragon is left awestruck in the wake of your power. The match is yours, but he is certain Kohm Khur can defeat you. Speak with Kohm Khur and prepare for your final fight.","Kohm Khur appears slighted by the defeat of his younger siblings, and is ready to take out his anger on you. Defeat Kohm Khur and show them you are not to be trifled with.","You defeat Kohm Khur, depriving him of a release for his anger. The younglings are now left to contemplate the strength of men, and you find your work is complete. Return to Ess Khas and tell him of what transpired.","You speak with Ess Khas, who is pleased to hear the egos of his children have been put in check. He was once worried the young dragons, if left to their own devices, would grow too prideful and unwilling to accept mankind. Your efforts have shown that man is not an inferior being, but rather a more-than-suitable equal."],"objectives":["Speak with Kohm Gahn.","Defeat Kohm Gahn.","Speak with Kohm Scorh.","Defeat Kohm Scorh.","Speak with Kohm Khur.","Defeat Kohm Khur.","Report to Ess Khas."],"dialogue":[{"name":"ESSKHAS","text":"Hmmm... I sense a great power within you. Yes, you will make a suitable adversary."},{"name":"ESSKHAS","text":"Our younglings must learn the hardships of battle. You will find them just beyond the tower. Go, and hold nothing back."},{"name":"ESSKHAS","text":"Do battle with the younglings beyond the tower. Show them your strength."},{"name":"DRAGONPUPPYM01802","text":"Battle with <span class=\"emphasis\">you</span>? I would rather not waste my time. Perhaps Kohm Gahn would find amusement in something so trivial."},{"name":"DRAGONPUPPYL01802","text":"I take no pleasure in preying on the weak. If you cannot best Kohm Scorh, I have no business with you."},{"name":"DRAGONPUPPYS01802","text":"I don't understand... Man is not fit to battle with dragons. Nevertheless, I will do as father asks."},{"name":"ESSKHAS","text":"Do battle with the younglings beyond the tower. Show them your strength."},{"name":"DRAGONPUPPYS01802","text":"Uwaaah! That's not possible! My brothers will make you pay!"},{"name":"DRAGONPUPPYL01802","text":"I take no pleasure in preying on the weak. If you cannot best Kohm Scorh, I have no business with you."},{"name":"DRAGONPUPPYM01802","text":"How dare you do such a thing to Kohm Gahn! You may have beaten him, but your games end here!"},{"name":"ESSKHAS","text":"Do battle with the younglings beyond the tower. Show them your strength."},{"name":"DRAGONPUPPYS01802","text":"Uwaaah! That's not possible! My brothers will make you pay!"},{"name":"DRAGONPUPPYM01802","text":"But how? Where did you obtain such power? No matter. Kohm Khur will deal with you yet."},{"name":"DRAGONPUPPYL01802","text":"What trickery is this!? I will not let you make a mockery of me and my brothers!"},{"name":"DRAGONPUPPYS01802","text":"You defeated Kohm Khur! I don't believe it!"},{"name":"DRAGONPUPPYM01802","text":"Your strength impresses me. Perhaps your kind are not the frail creatures I thought them to be."},{"name":"DRAGONPUPPYL01802","text":"Hmm. So this is the strength of man? Perhaps we've underestimated your kind."},{"name":"ESSKHAS","text":"Heh heh heh. So, the younglings have learned their place."},{"name":"ESSKHAS","text":"Do not worry. My intention is not to foster ill relations, but to teach. The younglings grow too prideful, doubting the strength of men. But thanks to you, they now understand."},{"name":"DRAGONPUPPYS01802","text":"（★未使用／削除予定★）"},{"name":"DRAGONPUPPYM01802","text":"（★未使用／削除予定★）"},{"name":"DRAGONPUPPYL01802","text":"（★未使用／削除予定★）"}],"reward":{"gil":626,"aetherCurrent":1,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"quests":[67150]},"next":[67348]},"partials":[{"type":"npc","id":"1011937","obj":{"i":1011937,"n":"Ess Khas","l":2000,"q":3}},{"type":"npc","id":"1013406","obj":{"i":1013406,"n":"Kohm Gahn","l":2000,"q":1}},{"type":"npc","id":"1013407","obj":{"i":1013407,"n":"Kohm Scorh","l":2000,"q":1}},{"type":"npc","id":"1013408","obj":{"i":1013408,"n":"Kohm Khur","l":2000,"q":2}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67348","obj":{"i":67348,"n":"Back in the Game","g":98,"l":"The Dravanian Forelands","s":5316}}]}