{"quest":{"name":"Back in the Game","location":"The Dravanian Forelands","id":67348,"patch":3.0,"sort":5316,"eventIcon":71221,"issuer":1011937,"target":1011937,"involved":[1013408],"genre":98,"journal":["Ess Khas stares at you intently, a strange hunger burning in his eyes.","Ess Khas was impressed with the way you fought against his children. So impressed, in fact, he wishes to challenge you himself. He also sees this as another chance to show the younglings a real fight. Find Kohm Khur south of the tower and prepare for battle.","Ess Khas gives his all in a fierce duel with you, but your command of the battlefield remains unmatched. Speak with Kohm Khur and see what he thinks of your latest victory.","Kohm Khur is humbled to see his father defeated and apologizes for doubting you before. He gives you a scale plucked from his body in the hopes of offering his father a swift recovery. Take the dragon scale to Ess Khas and see to his injuries.","Ess Khas thanks you for the medicine, knowing full well his son is the one who supplied it. He then tells you of the duels he once enjoyed with honorable knights in days long past."],"objectives":["Speak with Kohm Khur, then prepare for battle.","Speak with Kohm Khur.","Deliver Kohm Khur's scale to Ess Khas."],"dialogue":[{"name":"ESSKHAS","text":"Your fight with the younglings was impressive. I watched closely, and your power intrigues me."},{"name":"ESSKHAS","text":"Do battle with me, that the younglings may see more of proper battle. I am certain Kohm Khur will observe, and learn from our example."},{"name":"ESSKHAS","text":"Let us teach the younglings what it means to do battle. Kohm Khur will pass word of what transpires."},{"name":"HUGEPUPPY01812","text":"I have never seen Father so excited. I pray you are ready."},{"name":"ESSKHAS","text":"As I expected... You are truly worthy of our respect."},{"name":"HUGEPUPPY01812","text":"To think you could even defeat our father. I'm sorry to have doubted your strength before. Will you take him this scale? He's likely returned to the tower to rest."},{"name":"HUGEPUPPY01812","text":"To think our father could be defeated. I see now I have much to learn. Please, take this scale to him. I suspect he's resting in the tower."},{"name":"ESSKHAS","text":"You fought well. I expected nothing less."},{"name":"ESSKHAS","text":"Ah, a scale from Kohm Khur. How thoughtful. The magicks within our scales can grant healing. It seems our battle gave him cause to worry, but it was most invigorating."},{"name":"ESSKHAS","text":"Clashing claw with steel, matching wits with a worthy opponent. It reminds me of days long past, dueling with knights for sport. The thrill of combat is not easily forgotten."}],"reward":{"gil":626,"items":[{"id":4609,"one":1},{"id":4610,"one":1},{"id":4611,"one":1},{"id":4612,"one":1},{"id":4613,"one":1}],"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"all","quests":[67150,67338]},"next":[67347,67349]},"partials":[{"type":"npc","id":"1011937","obj":{"i":1011937,"n":"Ess Khas","l":2000,"q":3}},{"type":"npc","id":"1013408","obj":{"i":1013408,"n":"Kohm Khur","l":2000,"q":2}},{"type":"item","id":"4609","obj":{"i":4609,"n":"X-Potion of Strength","l":70,"c":20665,"t":44,"p":1330}},{"type":"item","id":"4610","obj":{"i":4610,"n":"X-Potion of Dexterity","l":70,"c":20667,"t":44,"p":1330}},{"type":"item","id":"4611","obj":{"i":4611,"n":"X-Potion of Vitality","l":70,"c":20666,"t":44,"p":1330}},{"type":"item","id":"4612","obj":{"i":4612,"n":"X-Potion of Intelligence","l":70,"c":20668,"t":44,"p":1330}},{"type":"item","id":"4613","obj":{"i":4613,"n":"X-Potion of Mind","l":70,"c":20669,"t":44,"p":1330}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67338","obj":{"i":67338,"n":"A Lesson in Humility","g":98,"l":"The Dravanian Forelands","s":5315,"f":1}},{"type":"quest","id":"67347","obj":{"i":67347,"n":"Blunders in Dragonsitting","g":98,"l":"The Dravanian Forelands","s":5321}},{"type":"quest","id":"67349","obj":{"i":67349,"n":"Where Dragons Lie","g":98,"l":"The Dravanian Forelands","s":5317}}]}