{"quest":{"name":"A Dragon and His Boy","location":"The Dravanian Forelands","id":67351,"patch":3.0,"sort":5323,"icon":100474,"eventIcon":71221,"issuer":1014160,"target":1011938,"involved":[1014161],"genre":98,"journal":["Kal Myhk wishes to hear his mother's request.","You finally tell Kal Myhk what his mother requests of him─to hunt for the day's meal. He makes for the nearby river without delay, and asks you to accompany him. Head south and meet with Kal Myhk.","You meet Kal Myhk down at the river. He confesses that he has never taken charge in hunting by himself, but he explains to you the way his elders catch their prey. Slay a clearwater nanka to use as bait.","You slay a clearwater nanka and are ready to catch your prey. According to Kal Myhk, his elders would lay their bait along the nearby rocks and wait for their prey to come biting. Do as his elders do, and strike down any beast that comes looking for an easy meal.","A jagil leaps up from the river to claim your bait, but you slay it with swift precision. Speak with Kal Myhk and show him what you caught.","You show Kal Myhk your freshly caught jagil. He is impressed with your hunting skills. So much so, that he decides to try by himself. Take your catch to Gullinkambi while he tries his hand at catching fish.","You bring the jagil to Gullinkambi. Realizing you carried out the hunt in her son's stead, she apologizes. At a mere thirty years of age, Kal Myhk is but a dragonling and lacks experience. She is glad, however, to see that he has grown to trust you."],"objectives":["Meet Kal Myhk at the river.","Slay a clearwater nanka to use as bait.","Place your bait along the rocks, then slay the monster that appears.","Speak with Kal Myhk.","Deliver your catch to Gullinkambi."],"dialogue":[{"name":"KALMYHK","text":"What word do you bring from Mother?"},{"name":"KALMYHK","text":"I see. She bids me hunt for today's meal? Then hunt I must. Come. We will catch fish at the river."},{"name":"KALMYHK","text":"Mother asks that I hunt, but I have never dared to hunt alone."},{"name":"KALMYHK","text":"The elders would lie in wait for their prey, using the flesh of clearwater nankas as bait to draw them out."},{"name":"KALMYHK","text":"Pluck one from the river and lay it along the rocks. When suitable prey approaches, strike it down!"},{"name":"KALMYHK","text":"Clearwater nankas have always proven effective as bait. Lay one along the rocks and our prey is sure to appear before long."},{"name":"KALMYHK","text":"You make a fine hunter, <span class=\"highlight\">Forename</span>. Take this meat to Mother. I wish to try hunting alone."},{"name":"GULLINKAMBI","text":"Did you find Kal Myhk? Has he taken up the hunt?"},{"name":"GULLINKAMBI","text":"You hunted in his stead? I apologize. He is but thirty years old, and still has much to learn. But I see you have gained his trust. Very good, very good indeed."}],"reward":{"gil":567,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"all","quests":[67150,67350]},"next":[67352]},"partials":[{"type":"npc","id":"1014160","obj":{"i":1014160,"n":"Kal Myhk","l":2000,"q":4}},{"type":"npc","id":"1011938","obj":{"i":1011938,"n":"Gullinkambi","l":2000,"q":8}},{"type":"npc","id":"1014161","obj":{"i":1014161,"n":"Kal Myhk","l":2000,"q":2}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67350","obj":{"i":67350,"n":"When Mother Calls","g":98,"l":"The Dravanian Forelands","s":5322}},{"type":"quest","id":"67352","obj":{"i":67352,"n":"Between Friends and Family","g":98,"l":"The Dravanian Forelands","s":5324}}]}