{"quest":{"name":"Let Bygones Be Bygones","location":"The Dravanian Forelands","id":67354,"patch":3.0,"sort":5326,"icon":100474,"eventIcon":71221,"issuer":1011938,"target":1011938,"involved":[1011923,1014162,1014164,1014169],"genre":98,"journal":["Gullinkambi is prepared to see the healing of man in action.","Gullinkambi reminds you that dragons are wont to let nature take its course when healing, but she has no objections to using knowledge of the tablet to help Ohl Ahs. She asks that you take Kal Myhk with you as you prepare the medicine described on the tablet.","Kal Myhk asks you what ingredients are required for the medicine, and after examining the faded tome, you find the recipe calls for wyvern tails. He tells you they can be found northeast of Anyx Trine. Journey to the Iron Feast and locate the items.","You traverse the narrow cliffs of the mountain and acquire wyvern tails. Return to Anyx Trine and confer with Kal Myhk regarding your next course of action.","Examining the tablet further, you discern the next step is an infusion of the wyvern tails, which extracts their healing properties with boiling water. Travel to Camp Tailfeather and seek out tools for the infusion.","You search Camp Tailfeather and the surrounding area and come across a small camp with a pot over a roaring fire. After speaking with the camp's residents, they agree to let you use the pot and produce a wyvern tail infusion. Return to Anyx Trine and show Kal Myhk the fruits of your labor.","You return to Anyx Trine, and Kal Myhk is thrilled at the thought of seeing his brother make a swift recovery. With the infusion in hand, there is only one thing left to do: meet Kal Myhk inside Mourn and prepare to treat Ohl Ahs.","You find Kal Myhk just beyond the mouth of Mourn and his brother is fast asleep. Apply the wyvern tail infusion to his wounds, but try not to wake him.","You carefully apply the infusion, but upon closer inspection find broken spear tips still lodged in his wounds. Their removal awakens Ohl Ahs who is displeased to see his sleep disturbed, more so by the fact that it was your doing. However, his anger is soon abated as he realizes the pain that gripped him for so long is finally gone. Kal Myhk explains that it was you who labored to treat his injuries, and helps him understand that not all people are wicked. Return to Anyx Trine, and inform Gullinkambi that the treatment was a success.","You arrive at Anyx Trine, and Gullinkambi can tell by your look of satisfaction that Ohl Ahs has recovered from his injuries. She thanks you for all you have done not only to heal Ohl Ahs, but also fostering the first of many friendships to come between dragons and mankind."],"objectives":["Speak with Kal Myhk.","Obtain wyvern tails from the Iron Feast.","Speak with Kal Myhk.","Search Camp Tailfeather for a means to infuse the wyvern tails.","Speak with Kal Myhk.","Use the wyvern infusion to treat Ohl Ahs.","Speak with Gullinkambi."],"dialogue":[{"name":"GULLINKAMBI","text":"Dragons follow the natural order. However, if you wish to heal Ohl Ahs, I will not forbid it. Take Kal with you, and prepare the remedy inscribed on the tablet."},{"name":"KALMYHK","text":"We must hurry and prepare the medicine. Retrieve the tablet from Mother so we may begin."},{"name":"GULLINKAMBI","text":"If you would grant succor to Ohl Ahs, prepare the remedy inscribed on the tablet."},{"name":"KALMYHK","text":"At last we can help Brother! Tell me, <span class=\"highlight\">Forename</span>, what is required for this remedy to work?"},{"name":"SYSTEM","text":"Centuries of wind and rain have worn the tablet glyphs, but you manage to discern the remedy calls for “wyvern tails.”"},{"name":"KALMYHK","text":"Wyvern tails? A peculiar name for a peculiar plant. They grow mainly near trees to the northeast, where water pours from the great ruins. Take what you can find from there. I will search along the cliffs up above."},{"name":"KALMYHK","text":"When you've found the wyvern tails, bring them back here. Take care, <span class=\"highlight\">Forename</span>."},{"name":"KALMYHK","text":"Were you able to find the wyvern tails? I fear they grow in short supply. "},{"name":"KALMYHK","text":"Excellent. There was but a small helping along the cliffs, but I found them. Now, how do we prepare the remedy?"},{"name":"KALMYHK","text":"Infusion? I'm not familiar with this...infusion. This sounds like work that cannot be done alone, but requires the skillful hands of man. I will leave this next step to you, <span class=\"highlight\">Forename</span>. "},{"name":"KALMYHK","text":"When you are finished, return here with the remedy."},{"name":"KALMYHK","text":"I'm not sure I understand what infusion is, but if it will help Brother, I will try anything."},{"name":"LEONULFE","text":"Well, hello there. What brings you to these parts?"},{"name":"LEONULFE","text":"Use of my pot? I s'pose, but mind tellin' me what you plan to do with it?"},{"name":"LEONULFE","text":"An infusion to treat a dragon? Well, blow me down. Never thought such a thing could be done. Hope you can put it to good use."},{"name":"KALMYHK","text":"Is the infusion complete? I wish to see what the remedy looks like."},{"name":"KALMYHK","text":"Excellent work. You never cease to impress me. But how do we use this to help Brother?"},{"name":"KALMYHK","text":"I see. Merely pouring that over the wounds will promote healing and ease Brother's pain? This is good."},{"name":"KALMYHK","text":"Keeping the wounds clean will be easy, letting him recover much faster."},{"name":"KALMYHK","text":"Let us be off to Mourn, then. The sooner Brother is healed, the better."},{"name":"KALMYHK","text":"Tread softly, lest we wake him."},{"name":"KALMYHK","text":"Now, pour the remedy over his wounds."},{"name":"OHLAHS","text":"......"},{"name":"KALMYHK","text":"Is the remedy working? Can you see any changes in Brother?"},{"name":"KALMYHK","text":"Something protruding from the wounds!? Please, remove them if you can!"},{"name":"KALMYHK","text":"Thank you, <span class=\"highlight\">Forename</span>. That should do well to ease Brother's pain, and let the remedy take hold quicker."},{"name":"OHLAHS","text":"Hm...!? Why do you disturb me from rest!? And you dare insult me by bringing that despicable filth with you! Can you not see the pain I am─<br>...The pain. It's...it's gone."},{"name":"KALMYHK","text":"Listen, Brother. <span class=\"highlight\">Forename</span> has treated you with medicine, and removed the strange objects embedded in your flesh."},{"name":"OHLAHS","text":"Hmph! A wasted effort. A dragon needs only sleep to mend its wounds, not the foolish tricks of man."},{"name":"KALMYHK","text":"Brother, please hear me. It is true we dragons heal with sleep. But it requires time we cannot afford."},{"name":"KALMYHK","text":"Would you willingly choose to lie here, writhing in agony?"},{"name":"KALMYHK","text":"With only claws and fangs, I could do nothing but watch you suffer. But <span class=\"highlight\">Forename</span> has helped you in ways no dragon can."},{"name":"KALMYHK","text":"I cannot deny there are men who mean to do us harm. But Brother, surely you understand now there are those who would aid us. Can you not see that <span class=\"highlight\">Forename</span> is a friend to us?"},{"name":"OHLAHS","text":"Make no mistake, Brother. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> kindness does not atone for the evils I have suffered, for our kin slain by the men of Ishgard."},{"name":"OHLAHS","text":"But as man has drawn my blood, man has also granted me succor. "},{"name":"OHLAHS","text":"Your kindness will not be forgotten, <span class=\"highlight\">Forename</span>... Thank you."},{"name":"OHLAHS","text":"Times are not what they once were. That much is clear. Trust does not come to me quite so easily, but I will give thought to the matter of men. "},{"name":"KALMYHK","text":"That is all I could ask for, Brother. Thank you. Come <span class=\"highlight\">Forename</span>, let us tell Mother that the remedy was a success!"},{"name":"OHLAHS","text":"Pour the remedy over his wounds, but try not to wake him."},{"name":"GULLINKAMBI","text":"Your expression tells me much. I see the remedy was effective."},{"name":"GULLINKAMBI","text":"With Ohl Ahs recovered, I would take back the tablet."},{"name":"GULLINKAMBI","text":"Though he has long since perished, his legacy will live on in his work─a boon to our kind."},{"name":"GULLINKAMBI","text":"I will keep close guard over it. When man and dragon at last make amends, there may come a time when we have need of its knowledge."},{"name":"GULLINKAMBI","text":"This time, I will make sure it is not so uneasily reached; a place where even unwinged allies will not labor to retrieve it."},{"name":"GULLINKAMBI","text":"Thank you, <span class=\"highlight\">Forename</span>. I hope you are but the first of many to befriend Kal Myhk, and someday the rest of our kind."},{"name":"KALMYHK","text":"We are in your debt, <span class=\"highlight\">Forename</span>. It will take time, but your kindness will be repaid. Until we meet again."},{"name":"KALMYHK","text":"You are a true friend, <span class=\"highlight\">Forename</span>. Thank you for everything."},{"name":"OHLAHS","text":"A world where dragons live alongside man? An interesting thought... Perhaps someday."}],"reward":{"gil":744,"items":[{"id":4560,"one":1},{"num":3,"id":4554,"one":1},{"num":3,"id":4558,"one":1}],"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"all","quests":[67152,67353]}},"partials":[{"type":"npc","id":"1011938","obj":{"i":1011938,"n":"Gullinkambi","l":2000,"q":8}},{"type":"npc","id":"1011923","obj":{"i":1011923,"n":"Leonulfe","l":2000,"q":5}},{"type":"npc","id":"1014162","obj":{"i":1014162,"n":"Kal Myhk","l":2000,"q":2}},{"type":"npc","id":"1014164","obj":{"i":1014164,"n":"Kal Myhk","l":2000,"q":2}},{"type":"npc","id":"1014169","obj":{"i":1014169,"n":"Ohl Ahs","l":2000,"q":1}},{"type":"item","id":"4560","obj":{"i":4560,"n":"Hi-Elixir","l":70,"c":20625,"t":44}},{"type":"item","id":"4554","obj":{"i":4554,"n":"X-Potion","l":70,"c":20603,"t":44,"p":887}},{"type":"item","id":"4558","obj":{"i":4558,"n":"X-Ether","l":70,"c":20623,"t":44,"p":1108}},{"type":"quest","id":"67152","obj":{"i":67152,"n":"Lord of the Hive","g":3,"l":"The Dravanian Forelands","s":37}},{"type":"quest","id":"67353","obj":{"i":67353,"n":"The Heart of a Dragon","g":98,"l":"The Dravanian Forelands","s":5325}}]}