{"quest":{"name":"A Pebble for Your Thoughts","location":"The Churning Mists","id":67357,"patch":3.0,"sort":5414,"icon":100475,"eventIcon":71221,"issuer":1014424,"target":1014427,"involved":[1014425,1014426],"genre":100,"journal":["Mogleo is looking for someone to help him catch his dream.","Mogleo will not let the servants of Nidhogg threaten his home any longer, and has resolved to join the Pomguard in their defense of the Churning Mists' moogles. However, not just any moogle can join the revered group of defenders. Only one whose strength is recognized by all can hope to join the elite group, and Mogleo needs your help to show that he has the mettle required to stand among such noble guardians. He plans to prove his strength by helping the many troubled moogles across the land, and promptly leaves in search of the first recipient of his kindness. Meet with Mogleo near Moghome to see if he has found a sufficiently distressed moogle.","Using his supermoogle sense of empathy, Mogleo has already found a moogle in dire need of his aid. Mogleo, deep in thought about what could be troubling this poor soul, bids you ask the moogle yourself.","It seems the troubled moogle lost track of a prized painted pebble, and guesses he may have dropped it while napping to the northeast of Moghome. Mogleo, eager to make his name as a helper of mooglekind, flits off hurriedly in that direction, bidding that you come as well. Meet with Mogleo to the northeast of Moghome to see if his search has produced aught of value.","You arrive to a terrifying sight: Mogleo is absorbed in his search, and behind him stands a ravenous dragon, ready to make a meal of the moogle. You leap to Mogleo's rescue, and the preoccupied moogle barely acknowledges your fierce battle. With the dragon dealt with, speak with Mogleo to find out if his intensive search was productive.","Luckily, it appears that Mogleo was able to somehow find the lost pebble among the hundreds of other pebbles littering the area. Return to Moghome and return the pebble to its rightful owner.","The despondent moogle's face lights up when you return the pebble to him, and Mogleo seems pleased with the results of his first foray into magnanimity. In fact, he proposes to help even more moogles, and next time plans to seek a troubled soul from outside of Moghome."],"objectives":["Search for Mogleo.","Speak with the mumbling moogle.","Rendezvous with Mogleo.","Speak with Mogleo.","Return to the mumbling moogle."],"dialogue":[{"name":"MOGLEO","text":"You there, kupo! Yes, you're exactly the type of brawny adventurer I had in mind. You have just the perfect build for what I require!"},{"name":"MOGLEO","text":"You see, the skylords in service to Nidhogg, while always a bit of a nuisance, have become increasingly belligerent recently. Understandably, us moogles are more than a little frightened for our marvelous Moghome, kupo!"},{"name":"MOGLEO","text":"That's why I've decided to take up arms in defense of our home by joining the Pomguard! With <span class=\"emphasis\">me</span> protecting them, mooglekind will no longer have to cower in fear!"},{"name":"MOGLEO","text":"There's just one obstacle holding me back─I haven't actually <span class=\"emphasis\">joined</span> the Pomguard yet. To do so, I must prove that I'm strong enough to be a capable defender, and I need <span class=\"emphasis\">you</span> to help me!"},{"name":"MOGLEO","text":"How do we go about proving my strength, you ask? Well, we shall scour the Churning Mists in search of troubled moogles, kupo!"},{"name":"MOGLEO","text":"I'll lend my sword to these poor moogles in their darkest hour, and word of my bravery will spread far and wide. Come, adventurer, let our search begin!"},{"name":"MOGLEO","text":"Now <span class=\"emphasis\">here's</span> a moogle in need of my help. See his pom-pom? That's how I know, kupo!"},{"name":"TROUBLEMOG01","text":"Where could it have gone? I had it in my paws not long ago, kupo..."},{"name":"MOGLEO","text":"I wonder what's got this moogle miffed, kupo?"},{"name":"TROUBLEMOG01","text":"It has to be somewhere around here..."},{"name":"MOGLEO","text":"Is something amiss, kupo?"},{"name":"TROUBLEMOG01","text":"Why, I had recently acquired a masterfully painted pebble, and wished to gaze upon it once more. But when I went to look for it, it was nowhere to be found, kupo!"},{"name":"MOGLEO","text":"Worry not, my troubled friend! I'll find this pebble for you, and soon you'll once again be enraptured by the pebble's enchanting brushstrokes. "},{"name":"TROUBLEMOG01","text":"You're too kind, kupo! I enjoyed an afternoon nap just northeast of Moghome not too long ago. If my pebble's anywhere, it's likely to be there."},{"name":"MOGLEO","text":"Then to the northeast of Moghome we shall go! Adventurer, that means you, too!"},{"name":"TROUBLEMOG01","text":"There's a tree just perfect for napping to the northeast of Moghome. Most likely I dropped my pebble around there in my groggy state."},{"name":"MOGLEO","text":"A m-monster, kupopo!"},{"name":"MOGLEO","text":"That was close! The monster was lucky I was so distracted by my search, or else I would've buried my blade in its scaly hide, kupo!"},{"name":"MOGLEO","text":"Thanks to you, however, I was able to retrieve the pebble without injury. Hurry, adventurer, we must make haste to deliver it to its worried owner!"},{"name":"MOGLEO","text":"And that's the end of that chapter, kupo!"},{"name":"TROUBLEMOG01","text":"Oh, thank you so much for finding my prized pebble! It would've been a terrible waste of kupo nuts had I lost it..."},{"name":"MOGLEO","text":"Such a trifling task is nothing for the likes of a future Pomguard member. Now, take care not to drop the pebble again, lest I'm too far away to rush to your aid!"},{"name":"MOGLEO","text":"Well, it turns out helping moogles isn't so hard after all! At this rate, Moghome will be worry-free in a matter of days, and all thanks to us!"},{"name":"MOGLEO","text":"Hmmm...but maybe we should spread our wings, and bring help to the moogles living outside Moghome. Yes... Wherever a moogle flits in frustration, Mogleo will be there to lend a helping paw, kupo! "}],"reward":{"gil":695,"items":[{"id":10672,"one":1,"hq":1},{"id":10714,"one":1,"hq":1},{"id":10756,"one":1,"hq":1},{"id":10840,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"quests":[67159]},"next":[67360]},"partials":[{"type":"npc","id":"1014424","obj":{"i":1014424,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014427","obj":{"i":1014427,"n":"Mumbling Moogle","l":2002,"q":2}},{"type":"npc","id":"1014425","obj":{"i":1014425,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014426","obj":{"i":1014426,"n":"Mogleo","l":2002,"q":1}},{"type":"item","id":"10672","obj":{"i":10672,"n":"Titanium Mask of Fending","l":133,"c":40452,"t":34,"p":19905}},{"type":"item","id":"10714","obj":{"i":10714,"n":"Titanium Sallet of Maiming","l":133,"c":40216,"t":34,"p":23223}},{"type":"item","id":"10756","obj":{"i":10756,"n":"Titanium Mask of Striking","l":133,"c":40453,"t":34,"p":19905}},{"type":"item","id":"10840","obj":{"i":10840,"n":"Titanium Mask of Scouting","l":133,"c":40454,"t":34,"p":19905}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67159","obj":{"i":67159,"n":"Moglin's Judgment","g":3,"l":"The Churning Mists","s":44}},{"type":"quest","id":"67360","obj":{"i":67360,"n":"Spineless Wadjets","g":100,"l":"The Churning Mists","s":5415}}]}