{"quest":{"name":"Between Friends and Family","location":"The Dravanian Forelands","id":67352,"patch":3.0,"sort":5324,"icon":100474,"eventIcon":71221,"issuer":1014160,"target":1014160,"involved":[1014161,1014162,1014163],"genre":98,"journal":["Kal Myhk looks to be in a state of panic.","Kal Myhk tells you his brother has been seriously injured. In the hopes of promoting a swift recovery, he wishes to keep his brother well fed. To that end, he asks that you help him hunt for food. Meet with Kal Myhk down at the river and be ready to hunt.","Kal Myhk plans to bring his brother both jagil and loaghtan meat, and needs your help. The loaghtans are known to graze up north, but he is forbidden from traveling so far upstream. He asks that you hunt one in his stead.","You slay a loaghtan and obtain its meat. Return south with your bounty and report your success to Kal Myhk.","Kal Myhk is quite pleased with your kill. With meat and fish in hand, he insists on going straight to his brother in Mourn.","You arrive at Mourn and find Kal Myhk but a few steps inside. Next to him is his brother, lying motionless on the floor. Kal Myhk rouses him and offers him the fish and meat you procured. His brother refuses, and becoming aware of your presence, grows increasingly angry at the offering. He recalls the men who plucked him from the skies of Coerthas, nearly claiming his life. He warns Kal Myhk that no man can be trusted, and claims that you too will soon turn to betray him. Kal Myhk is at a loss for words, and quickly leaves the cave to consider his brother's words. Seek Kal Myhk near Anyx Trine, and see how he is handling this news.","You find Kal Myhk on the steps of Anyx Trine, a sullen look on his face. While he appreciates all you have done for him, it seems he would choose to heed his brother's warning."],"objectives":["Speak with Kal Myhk.","Hunt a loaghtan at the specified location.","Speak with Kal Myhk.","Hand Kal Myhk the slice of loaghtan shoulder.","Speak with Kal Myhk."],"dialogue":[{"name":"KALMYHK","text":"<span class=\"highlight\">Forename</span>! I need your help!"},{"name":"KALMYHK","text":"Brother has been gravely injured. I fear he will not survive long in such a weakened state."},{"name":"KALMYHK","text":"He must feed to regain his strength. Meet me at the river. We will gather food for him."},{"name":"KALMYHK","text":"Hurry! To the river down south!"},{"name":"KALMYHK","text":"Good, you are here. Let us hunt jagil and loaghtan. They are Brother's favorite, and easy prey besides."},{"name":"KALMYHK","text":"The loaghtans graze north of here, but I am forbidden from traveling so far upstream. You must hunt one for me. I will remain here and hunt the jagil. Go swiftly."},{"name":"KALMYHK","text":"They're known to graze to the north. Stay along the river, and look for one there."},{"name":"KALMYHK","text":"You hunt well, <span class=\"highlight\">Forename</span>. Good work. I too have caught a veritable bounty."},{"name":"KALMYHK","text":"Quickly, let us take these to Brother. He rests just beyond the mouth of Mourn outside Anyx Trine."},{"name":"OHLASH","text":"Urgh... The pain..."},{"name":"KALMYHK","text":"Give me the loaghtan meat. I will feed it to him."},{"name":"KALMYHK","text":"Brother! I bring you food. Eat, and regain your strength."},{"name":"OHLASH","text":"Kal, my brother. These wounds will not be mended by food. I must rest to─ Wait! Who is that with you? ...A man!? Why do you consort with this filth? Were these beasts slain by <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"emphasis\">her</span></span><span class=\"alternative\"><span class=\"emphasis\">his</span></span></span> hand?"},{"name":"OHLASH","text":"I will not demean myself by eating meat butchered by this creature. Who do you think dealt me these wounds but <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> kind!?"},{"name":"OHLASH","text":"We hunt for food, for the survival of our kind. But they hunt for blood─striking without hesitation, assuming all of our kind to be their enemy. Men howled and cheered as I fell into the snows of Coerthas. I was fortunate to escape with my life."},{"name":"OHLASH","text":"Men cannot be trusted. <span class=\"emphasis\">None of them</span>! It is only a matter of time before even <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> turns on you."},{"name":"KALMYHK","text":"But <span class=\"highlight\">Forename</span> has been so kind to me. I don't understand... "},{"name":"KALMYHK","text":"Excuse me. I... I need time to think on Brother's words."},{"name":"OHLASH","text":"Stay away from Kal!"},{"name":"KALMYHK","text":"Oh, <span class=\"highlight\">Forename</span>. I have given thought to Brother's words, and... I'm sorry. You have been very kind, but he would not lie to me. I must ask that you leave."}],"reward":{"gil":567,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"all","quests":[67152,67351]},"next":[67353]},"partials":[{"type":"npc","id":"1014160","obj":{"i":1014160,"n":"Kal Myhk","l":2000,"q":4}},{"type":"npc","id":"1014161","obj":{"i":1014161,"n":"Kal Myhk","l":2000,"q":2}},{"type":"npc","id":"1014162","obj":{"i":1014162,"n":"Kal Myhk","l":2000,"q":2}},{"type":"npc","id":"1014163","obj":{"i":1014163,"n":"Ohl Ahs","l":2000,"q":1}},{"type":"quest","id":"67152","obj":{"i":67152,"n":"Lord of the Hive","g":3,"l":"The Dravanian Forelands","s":37}},{"type":"quest","id":"67351","obj":{"i":67351,"n":"A Dragon and His Boy","g":98,"l":"The Dravanian Forelands","s":5323}},{"type":"quest","id":"67353","obj":{"i":67353,"n":"The Heart of a Dragon","g":98,"l":"The Dravanian Forelands","s":5325}}]}