{"quest":{"name":"When Mother Calls","location":"The Dravanian Forelands","id":67350,"patch":3.0,"sort":5322,"icon":100474,"eventIcon":71221,"issuer":1011938,"target":1014160,"involved":[1014156,1014157,1014158,1014159],"genre":98,"journal":["Gullinkambi needs someone to deliver a message.","Gullinkambi would task her child, Kal Myhk, with today's hunt, but he has yet to return home. She asks that you find him, and relay her words to him.","You find Kal Myhk not far from Anyx Trine. In trying to ascertain what manner of being you are, he comes to the erroneous conclusion that you are an enemy from Ishgard, and flees in a panic. Search for Kal Myhk, and deliver his mother's message.","You find Kal Myhk again close by. Convinced you are an enemy sent to slay him, he runs off yet again before you can talk to him. Search for Kal Myhk, and deliver his mother's message.","You find Kal Myhk, but this time he refuses to run away. He stands his ground, prepared for the worst, but is caught by surprise to hear you bring word from his mother. Before you can relay this message, however, he insists on testing you. He asks you to catch him as he flies off to parts unknown. Track down Kal Myhk, and deliver his mother's message. ","You find Kal Myhk hiding naively in the ruins close to his last hiding spot. Having taken interest in you, he asks for your name. Convinced you will not find him again, he challenges you to find him one last time. Track down Kal Myhk, and deliver his mother's message.","You find Kal Myhk, this time out in the open near the entrance to Anyx Trine. He is impressed that you were able to keep up with him, and decides you will make a good partner. For what, exactly, only he knows. But with games of hide-and-seek finally over, you can at last tell him of his mother's request."],"objectives":["Find Kal Myhk.","Find Kal Myhk again.","Find Kal Myhk once more.","Humor Kal Myhk by tracking him down.","Find Kal Myhk one last time."],"dialogue":[{"name":"GULLINKAMBI","text":"The stench of man, yet somehow different... Ah, a companion to Ysayle. Very well. I would ask you a favor."},{"name":"GULLINKAMBI","text":"My child now explores the wilderness. I would task him with the hunt for today's meal, but he has yet to return."},{"name":"GULLINKAMBI","text":"Seek the dragon Kal Myhk. Tell him he must hunt."},{"name":"GULLINKAMBI","text":"Kal Myhk is but a child, and will not travel far. Tell him he must hunt."},{"name":"KALMYHK","text":"Hm...? You are no creature of this land. Who are you? <span class=\"emphasis\">What</span> are you?"},{"name":"KALMYHK","text":"No wings, no fangs, no scales like a beast... So a man, then. A man from Ishgard! Stay away!"},{"name":"KALMYHK","text":"Come no closer, man of Ishgard. I will not be your trophy, nor your meal!"},{"name":"KALMYHK","text":"Fine! Do what you will. But you will not have the satisfaction of battle."},{"name":"KALMYHK","text":"...A message from Mother? So you are not an enemy, then."},{"name":"KALMYHK","text":"If you would speak with me, then first a test! Catch me if you can."},{"name":"KALMYHK","text":"Quite perceptive. What is your name?"},{"name":"KALMYHK","text":"<span class=\"highlight\">Forename</span>... Heh heh heh, a strange name. You will not find me this time, <span class=\"highlight\">Forename</span>."},{"name":"KALMYHK","text":"Interesting. So you're not as slow as I thought."},{"name":"KALMYHK","text":"Very well. You will make a fine partner. You may call me Kal Myhk."},{"name":"KALMYHK","text":"So you are a child of man? I've never met your kind before. Truly a peculiar breed you are."},{"name":"KALMYHK","text":"Now speak. What is the message you bring from Mother?"},{"name":"KALMYHK","text":"Tell me what she would have me do, and it will be done."}],"reward":{"gil":479,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"quests":[67150]},"next":[67351]},"partials":[{"type":"npc","id":"1011938","obj":{"i":1011938,"n":"Gullinkambi","l":2000,"q":8}},{"type":"npc","id":"1014160","obj":{"i":1014160,"n":"Kal Myhk","l":2000,"q":4}},{"type":"npc","id":"1014156","obj":{"i":1014156,"n":"Kal Myhk","l":2000,"q":1}},{"type":"npc","id":"1014157","obj":{"i":1014157,"n":"Kal Myhk","l":2000,"q":1}},{"type":"npc","id":"1014158","obj":{"i":1014158,"n":"Kal Myhk","l":2000,"q":1}},{"type":"npc","id":"1014159","obj":{"i":1014159,"n":"Kal Myhk","l":2000,"q":1}},{"type":"quest","id":"67150","obj":{"i":67150,"n":"A Gnathic Deity","g":3,"l":"The Dravanian Forelands","s":35}},{"type":"quest","id":"67351","obj":{"i":67351,"n":"A Dragon and His Boy","g":98,"l":"The Dravanian Forelands","s":5323}}]}