{"quest":{"name":"Nut Job","location":"The Churning Mists","id":67366,"patch":3.0,"sort":5405,"eventIcon":71221,"issuer":1012081,"target":1012081,"involved":[1012084],"genre":100,"journal":["Mogomo has the next step of his perfect garden planned.","Mogomo wants you to get him five kupo nuts so he can grow kupo trees in his garden. Visit Moggzia and ask him if he has any nuts to spare.","Moggzia has agreed to let you gather kupo nuts for Mogomo. Gather five from the trees that dot the surrounding area.","You have found five of the most impressively firm and large kupo nuts in Moghome. Bring them to Mogomo, and make sure to handle them with the same delicate attention you would give your own.","Mogomo is thrilled that his dream garden is one step closer to completion. He wants to eventually trade his kupo nuts to visitors from the surface for their shiny objects and tools."],"objectives":["Speak with Moggzia.","Pick kupo nuts from the kupo trees.","Deliver the kupo nuts to Mogomo."],"dialogue":[{"name":"MOGOMO","text":"Moghome's upper layer is bathed in sunlight─that's why the kupo trees grow lush and leafy. I think a few would look perfect in my garden!"},{"name":"MOGOMO","text":"I only want the best trees─and that means the best kupo nuts! Moggzia tends to the greenery up top. Ask him if he can part with some─five should be enough, kupo!"},{"name":"MOGOMO","text":"Only kupo nuts of the highest quality are worth planting in <span class=\"emphasis\">my</span> garden. Ask Moggzia if he knows where we could get any."},{"name":"MOGGZIA","text":"Ah...so Mogomo is in need of kupo nuts? He <span class=\"emphasis\">has</span> been a good friend... Very well, take as many as you need─just pick them straight off the branches, kupo."},{"name":"MOGGZIA","text":"Kupo trees grow all around this area, you simply need to pluck any ripe nuts from their branches, kupo."},{"name":"MOGOMO","text":"The kupo nuts make the tree, and I desire only the best. I trust you to find the biggest nuts you can!"},{"name":"MOGGZIA","text":"Were you able to find satisfactory kupo nuts? The ones hanging from these trees are the best Moghome has to offer."},{"name":"MOGOMO","text":"I know Moggzia will pull through in providing only the best! Were you able to find the nuts I require?"},{"name":"MOGOMO","text":"My thanks! I couldn't have picked firmer kupo nuts myself. The trees which sprout from these will be the envy of gardeners everywhere."},{"name":"MOGOMO","text":"One day people from the surface will visit Moghome in numbers like never before, bringing shiny tools and other sundries I can barely imagine. On that day, I'll show them my glorious kupo nuts and they'll have no choice but to trade for my superior product. Just you wait, kupo!"}],"reward":{"gil":515,"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"quests":[67164]}},"partials":[{"type":"npc","id":"1012081","obj":{"i":1012081,"n":"Mogomo","l":2002,"q":4}},{"type":"npc","id":"1012084","obj":{"i":1012084,"n":"Moggzia","l":2002,"q":4}},{"type":"quest","id":"67164","obj":{"i":67164,"n":"The Wyrm's Lair","g":3,"l":"The Churning Mists","s":49}}]}