{"quest":{"name":"Where Dragons Tread","location":"The Churning Mists","id":67362,"patch":3.0,"sort":5407,"eventIcon":71221,"issuer":1012092,"target":1012092,"genre":100,"journal":["Mogmum looks so mad that his pom-pom is going to burst.","Mogmum has asked you to slay the amphipteres that run amok in the moogles' flower gardens. Slay three of the beasts to stop their rampage.","The wyrms lie dead at your feet, and the flowers look happy. Report to Mogmum in Asah.","Mogmum seems happy to hear the good news. When the dread wyrm Nidhogg's roar rang out across the land, it sent the dragons into a fury, during which they disrespectfully damaged Mogmum's precious flower beds. Now, thanks to you, hopefully the dragons have a newfound appreciation of the effort required to raise flowers."],"objectives":["Slay amphipteres.","Report to Mogmum."],"dialogue":[{"name":"MOGMUM","text":"The flowers in this area are precious─moogles come all the way from Moghome to catch a sniff. That's why we can't have monsters barging in and trampling all over them, kupo!"},{"name":"MOGMUM","text":"The amphipteres are the worst of the lot. Someone needs to do something about them! If you slay three of them, it might keep the beasts away for a while."},{"name":"MOGMUM","text":"The amphipteres are stomping and chomping our precious flowers. Slay them before any more plants come to harm, kupo!"},{"name":"MOGMUM","text":"That'll teach those wyrms to come into <span class=\"emphasis\">our</span> gardens, kupo! You have my thanks, adventurer."},{"name":"MOGMUM","text":"It seems the roar of the dread wyrm sent the skylords into a fury, but that doesn't mean they can just stamp around wherever they want! They really need to learn respect for our hard work!"}],"reward":{"gil":515,"items":[{"id":10833,"one":1,"hq":1},{"id":10917,"one":1,"hq":1},{"id":10959,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"quests":[67161]}},"partials":[{"type":"npc","id":"1012092","obj":{"i":1012092,"n":"Mogmum","l":2002,"q":1}},{"type":"item","id":"10833","obj":{"i":10833,"n":"Dhalmelskin Leggings of Aiming","l":133,"c":46523,"t":38,"p":16851}},{"type":"item","id":"10917","obj":{"i":10917,"n":"Dhalmelskin Crakows of Healing","l":133,"c":46524,"t":38,"p":16851}},{"type":"item","id":"10959","obj":{"i":10959,"n":"Dhalmelskin Crakows of Casting","l":133,"c":46525,"t":38,"p":16851}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67161","obj":{"i":67161,"n":"The Road to Zenith","g":3,"l":"The Churning Mists","s":46}}]}