{"quest":{"name":"A Nutty Initiation","location":"The Churning Mists","id":67368,"patch":3.0,"sort":5417,"icon":100475,"eventIcon":71221,"issuer":1014442,"target":1012082,"involved":[1012084,1014439,1014443,1014444,1014445,1014446,1014447],"genre":100,"journal":["Mogleo has found a moogle in a most compromising position.","Mogleo, in his journey to help moogles everywhere, has come upon a prone member of the Pomguard. However, it is not certain whether the moogle is injured or merely taking a nap. Talk to the moogle to find out if he is in a predicament that needs solving, or if he would just like to be left in dreamland.","It seems an encounter with a nearby tree has left the Pomguard moogle dazed, confused, and unable to move. The only thing that may possibly save him is a kupo nut. Though Mogleo is leery of the seriousness of the moogle's condition, he decides to aid him nonetheless. Speak with Mogleo to receive instructions.","Mogleo laments that he cannot solve this problem on his own, and decides that he will stand watch over the Pomguard moogle while you return to Moghome for a kupo nut. Make your way back to the settlement and ask Moggzia if he has any of the precious nuts to spare.","Moggzia seems to have more kupo nuts than he knows what to do with, and readily hands one over to aid a member of the Pomguard. Hurry and give the nut to the ailing moogle before the last of his limited energy leaves his pom.","Upon eating the kupo nut, the Pomguard moogle's disposition changes drastically, and his earlier ailment seems like a distant memory. Before you can even wonder at his remarkable recovery, he bids you and Mogleo join him back at Moghome for a meeting with his commander, Captain Mogloo.","Mogleo hesitantly presents himself before Captain Mogloo of the Pomguard, who scolds him for putting himself in danger by going out into the wilderness alone. To ensure that Mogleo has a proper outlet for his altruistic tendencies, Mogloo names him a new member of the Pomguard. It would seem that moogles from all over the Churning Mists have vouched for Mogleo, the Pomguard member he but recently rescued among them. With his courage and selflessness, Mogleo will make a fine addition to the lauded ranks of the Pomguard."],"objectives":["Speak with the Pomguard moogle.","Speak with Mogleo.","Obtain a kupo nut from Moggzia.","Deliver the kupo nut to the Pomguard moogle.","Speak with Mogloo."],"dialogue":[{"name":"TROUBLEMOG03","text":"It's great to be back in Asah, but I miss my flowers, kupo..."},{"name":"MOGGUARD01","text":"I can't... I can't go on, kupo..."},{"name":"MOGLEO","text":"Adventurer, look! It's a moogle from the Pomguard, and he's been knocked unconscious, or is he...napping? There's only one way to find out─ask him, kupo!"},{"name":"MOGLEO","text":"Even if he is napping, this is no place to be dozing off! Find out what's wrong with him, kupo."},{"name":"MOGGUARD01","text":"This is...the end, kupo..."},{"name":"MOGLEO","text":"Speak to me! What happened to you?"},{"name":"MOGGUARD01","text":"I was...on patrol... I was caught unawares...and I was attacked..."},{"name":"MOGLEO","text":"You were attacked? By whom, kupo?"},{"name":"MOGGUARD01","text":"A tree... It was...a tree... Ohhh, my head..."},{"name":"MOGLEO","text":"...Attacked by a tree!? Adventurer, I'm afraid this is nothing but a clumsy moogle, kupo..."},{"name":"MOGGUARD01","text":"My life...is flashing...before my eyes... If only I had...brought more kupo nuts...I could pull through..."},{"name":"MOGLEO","text":"&lt;sigh&gt; It's just a slight bump on the head, he'll be flitting about in time. Nevertheless, a moogle is in need, and I shall help however I can! Adventurer, let us discuss our new strategy!"},{"name":"MOGGUARD01","text":"Mother...Father...you're all here, kupo..."},{"name":"MOGLEO","text":"Well, everyone knows moving about when you've hit your head is dangerous. What's more, this area is crawling with carnivorous monsters, so we can't just leave him here... "},{"name":"MOGLEO","text":"What's that? You'll go and get the kupo nut while I stand guard? Alas, once again I lack the strength to refuse your aid. Adventurer, hurry and bring the kupo nut before one of these mean-looking monsters decides to get curious."},{"name":"MOGLEO","text":"Getting a kupo nut should be as simple as asking Moggzia, who looks after Moghome's supply. If you explain the situation, he should be willing to part with a nut or two, kupo."},{"name":"MOGLEO","text":"Moggzia is in charge of Moghome's supply of kupo nuts. Explain to him our situation, and he should be willing to part with a nut or two, kupo!"},{"name":"MOGGZIA","text":"...What's that!? A Pomguard in need of a kupo nut!?"},{"name":"MOGGZIA","text":"It's a terrible thing, for a Pomguard moogle to be trapped out in the wild without their precious nuts. Very well, take as many as you need. Best bring it to him quick!"},{"name":"MOGGZIA","text":"Well, hurry up! A Pomguard without his nuts is no guard at all, kupo! "},{"name":"MOGGUARD01","text":"Oh, were you looking for us, kupo? An archaeosaur was getting a little too close for comfort, so Mogleo and I fled over here."},{"name":"MOGGUARD01","text":"I mean... Ohhh...my poor head... Did you...did you bring me a kupo nut?"},{"name":"MOGGUARD01","text":"Oh, thank heavens, kupo! It's so delicious, and it's been so long... Yes, I can feel it. I can feel...the power, kupopo!"},{"name":"MOGGUARD01","text":"Ah, it's good to feel alive again! I must remember to bring more kupo nuts with me on my next patrol. You've saved my pom, kupo!"},{"name":"MOGGUARD01","text":"My thanks, Mogleo. Without your aid, I would have met an untimely demise, kupo."},{"name":"MOGLEO","text":"You...you are too kind. All I did was flee from that archaeosaur..."},{"name":"MOGGUARD01","text":"Nonsense, kupo! You could have left me to be prey to the wild beasts, but you risked your pom-pom to carry me with you. You can hold your head high!"},{"name":"MOGGUARD01","text":"...But this isn't an ideal place for long-winded praise. Let us return to Moghome and seek out Captain Mogloo, kupo!  "},{"name":"MOGLEO","text":"Captain Mogloo? Why, whatever for, kupo?"},{"name":"MOGGUARD01","text":"All shall be revealed in good time. Ah, yes, your companion may come along as well."},{"name":"MOGLEO","text":"Captain Mogloo wishes to speak with <span class=\"emphasis\">me</span>, kupo?"},{"name":"MOGGUARD01","text":"Mogleo, listen well, kupo. You will want to hear what Captain Mogloo has to say."},{"name":"MOGLOO","text":"So, you are the daring Mogleo of whom I have heard so much. I am given to understand you have been helping our troubled brethren across the land."},{"name":"MOGLEO","text":"I merely do what any upstanding moogle would, kupo. Though my trusty companion here deserves much and more of the credit."},{"name":"MOGLOO","text":"Hmmm... Although you have this adventurer's hand to aid you, you must stop this one-moogle crusade. Should the worst happen, it would be a grievous loss, kupo."},{"name":"MOGLEO","text":"Are you saying...I can't even help just <span class=\"emphasis\">one</span> more moogle? But I...I just wanted to prove myself worthy of the Pomguard. "},{"name":"MOGLOO","text":"Do not make me repeat myself, Mogleo. Though your intent is noble, you cannot continue helping other moogles alone..."},{"name":"MOGLOO","text":"Nay, henceforth, you will do so as a member of the Pomguard, kupo!"},{"name":"MOGLEO","text":"<span class=\"emphasis\">Me</span>...in the Pomguard!?"},{"name":"MOGLOO","text":"We could ask for no greater honor than to count you amongst our ranks! Moogles all over, a brother of the Pomguard among them, vouch for your skill and valor both. I can think of no worthier addition to our ranks."},{"name":"MOGGUARD01","text":"Hear, hear, kupo!"},{"name":"MOGLEO","text":"A-Are you sure I'm strong enough!? "},{"name":"MOGLOO","text":"Strength is important, 'tis true, but it is naught without courage. And courage is something you do not want for, kupo. I have great expectations of you, Mogleo!"},{"name":"MOGLEO","text":"Th-This is everything I've ever dreamed of! It's even better than the time I ate four kupo nuts at once! Finally, I'm Mogleo of the Pomguard, kupopo!"},{"name":"MOGGUARD01","text":"Welcome to the brotherhood, kupo! Come with me, and I shall introduce you to everyone!"}],"reward":{"gil":725,"items":[{"id":10812,"one":1,"hq":1},{"id":10896,"one":1,"hq":1},{"id":10938,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"questsType":"all","quests":[67163,67367]},"next":[67399,67508]},"partials":[{"type":"npc","id":"1014442","obj":{"i":1014442,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1012082","obj":{"i":1012082,"n":"Mogloo","l":2002,"q":4}},{"type":"npc","id":"1012084","obj":{"i":1012084,"n":"Moggzia","l":2002,"q":4}},{"type":"npc","id":"1014439","obj":{"i":1014439,"n":"Unmoogled Moogle","l":2002,"q":2}},{"type":"npc","id":"1014443","obj":{"i":1014443,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014444","obj":{"i":1014444,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014445","obj":{"i":1014445,"n":"Pomguard Moogle","l":2002,"q":1}},{"type":"npc","id":"1014446","obj":{"i":1014446,"n":"Pomguard Moogle","l":2002,"q":1}},{"type":"npc","id":"1014447","obj":{"i":1014447,"n":"Pomguard Moogle","l":2002,"q":1}},{"type":"item","id":"10812","obj":{"i":10812,"n":"Dhalmelskin Armguards of Aiming","l":133,"c":48509,"t":37,"p":14744}},{"type":"item","id":"10896","obj":{"i":10896,"n":"Ramie Halfgloves of Healing","l":133,"c":44372,"t":37,"p":14744}},{"type":"item","id":"10938","obj":{"i":10938,"n":"Ramie Halfgloves of Casting","l":133,"c":44373,"t":37,"p":14744}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67163","obj":{"i":67163,"n":"Heart of Ice","g":3,"l":"The Churning Mists","s":48}},{"type":"quest","id":"67367","obj":{"i":67367,"n":"Far from Home","g":100,"l":"The Churning Mists","s":5416}},{"type":"quest","id":"67399","obj":{"i":67399,"n":"Protecting the Pom","g":100,"l":"The Churning Mists","s":5528}},{"type":"quest","id":"67508","obj":{"i":67508,"n":"Moogles in the Sky","g":96,"l":"Ishgard","s":5901}}]}