{"quest":{"name":"Spineless Wadjets","location":"The Churning Mists","id":67360,"patch":3.0,"sort":5415,"icon":100475,"eventIcon":71221,"issuer":1014429,"target":1014431,"involved":[1014427,1014430],"genre":100,"journal":["Mogleo has finally found a moogle in Asah in need of help.","Mogleo has once again used his preternatural ability to seek out the troubled and beleaguered to find yet another moogle to help in Asah, and is eager to hear the story of his distress. Speak to the moogle and find out if there is any comfort you can give him.","The moogle in Asah has a tragic story to tell. He was in possession of a borrowed knife, made from the razor-sharp spine of a hulking wadjet. For reasons known not even to himself, he brought the knife on a days-long romp around the Churning Mists, at the end of which the knife was nowhere to be found. Unable to face his friend without the knife, he has decided that the only course of action is to make a new one, but he is too scared to get close enough to a pull a spine from one of the dangerous wadjets. Mogleo eagerly volunteers to get a wadjet spine in the moogle's stead, and hurries to the northeast, where the beasts are said to inhabit. Follow Mogleo and speak to him to find out what exactly his plan is.","Mogleo's master plan is to sneakily pull a spine from one of the wadjets while you fight it. Create a distraction and throw yourself against a wadjet's wrath so Mogleo can wrench a spine from the preoccupied beast. ","The wadjet lies dead at your feet. Speak with Mogleo to see if he was able to obtain a wadjet spine.","It seems the wadjet was too slippery for Mogleo to pull off one of its spines, and he asks you to try again. Slay one more wadjet, and this time take care not to move the monster around too much.","Another wadjet falls before you, although you cannot tell if it has any less spines than it did before. Mogleo may indeed have had the strength to pull a spine off this time, but the only way to know is to ask him.","Once again the wadjet has proven too wily for Mogleo to wrench off a spine, but he assures you that they were of poor quality anyways. Go forth and slay one more wadjet, and pray that Mogleo's fingers are dextrous enough to grab a spine this time.","With the third, and hopefully final, wadjet dispatched, make your way back to Mogleo's perch and see if he managed to get the squeeze on the massive reptile.","At last, Mogleo has successfully pulled one of the wadjet's spines from its body. Speak with the moogle at Asah, who is surely waiting in anticipation at your thoughtful gift.","The moogle at Asah is impressed that you were able to provide an even keener spine than the one he lost, and decides that he will make an even better blade for him. With one less troubled moogle in the realm, Mogleo goes off in search of the next dilemma to solve in his crusade of kindness."],"objectives":["Speak with the zooming moogle.","Speak with Mogleo.","Slay a wadjet.","Speak with Mogleo.","Slay a wadjet.","Speak with Mogleo.","Slay a wadjet.","Speak with Mogleo.","Speak with the zooming moogle."],"dialogue":[{"name":"TROUBLEMOG02","text":"Oh... How could I be so clumsy, kupo... He'll never forgive me..."},{"name":"TROUBLEMOG01","text":"I'll hold on to the pebble with all my might. Never will I ever let it go again, kupo!"},{"name":"MOGLEO","text":"Ah, just look at this moogle, adventurer. Have you ever seen such a distressed expression?"},{"name":"MOGLEO","text":"This is a perfect opportunity. Let's find out what has his pom-pom all in a twist, kupo!"},{"name":"TROUBLEMOG02","text":"I'm done for... There's no coming back from this, kupo..."},{"name":"MOGLEO","text":"Pray tell us of your distress, kupo! We are here to serve!"},{"name":"TROUBLEMOG02","text":"Well... A friend of mine lent me one of his favorite knives, one so sharp it could cut right through a kupo nut! He made it by whittling down a spine pulled from one of those wild wadjets."},{"name":"TROUBLEMOG02","text":"And you see... I've been on a bit of a binge the past few days, fluttering to and fro, indulging in libations whenever the opportunity presented itself.<br><br><br>When all was said and done, the wine was gone and the knife was nowhere to be found, kupo! I don't recall why I brought it in the first place..."},{"name":"TROUBLEMOG02","text":"...My only choice is to make my friend a new knife, kupo! But have you ever <span class=\"emphasis\">seen</span> a wadjet? One does not simply pull a spine from one..."},{"name":"MOGLEO","text":"Hmmm... The situation sounds terribly troubling... But worry not, for you won't have to risk your life standing against a wadjet, because <span class=\"emphasis\">we'll</span> do that for you!"},{"name":"MOGLEO","text":"Be patient, troubled friend, soon you'll have a wadjet's spine within your grasp. Come, adventurer, the wadjets can be found to the northeast of here. Hurry before I slay every last one!"},{"name":"TROUBLEMOG02","text":"You... You'll really pull me a spine from those dreadful wadjets, kupo?"},{"name":"MOGLEO","text":"I can see the wadjets from here, but if I get any closer they'll sniff me out in a second. What to do..."},{"name":"MOGLEO","text":"...Ah, brilliant! See, all you have to do is create a distraction by attacking a wadjet, whilst I fly in and pull a spine from the beast undetected. What a simply sophisticated strategy, kupo!"},{"name":"MOGLEO","text":"I'll be waiting here for you to start your attack. Fear not, I won't be far behind!"},{"name":"TROUBLEMOG02","text":"You know what to do, kupo! I'll follow at your heels!"},{"name":"MOGLEO","text":"&lt;pant&gt; &lt;pant&gt; You killed it...&lt;pant&gt;...too fast. I couldn't grip the wadjet's slippery spine in time..."},{"name":"MOGLEO","text":"But we mustn't give up, kupo! My paws are ready─fight another one and I'll get it this time."},{"name":"TROUBLEMOG02","text":"I'll follow your lead, kupo."},{"name":"MOGLEO","text":"&lt;pant&gt; I almost...&lt;pant&gt;...had it that time. That last one's spine wouldn't have made a suitable knife, anyways."},{"name":"MOGLEO","text":"...Don't tell me you're tired already, kupo! Just one more try, I have a good feeling about this one."},{"name":"TROUBLEMOG02","text":"Practice makes perfect! Just once more, we'll get it this time! "},{"name":"MOGLEO","text":"That did it! Never has a moogle been so silently stealthy. I wager not even <span class=\"emphasis\">you</span> saw me pull the spine from that wretched beast, kupo! Well, I'll bring this right back to Asah."},{"name":"TROUBLEMOG02","text":"Hehe, I can't wait to see the surprise on his face, kupo!"},{"name":"TROUBLEMOG02","text":"So... Were you actually able to get the spine, kupo?"},{"name":"MOGLEO","text":"I don't know... Does <span class=\"emphasis\">this</span> answer your question, kupo?"},{"name":"TROUBLEMOG02","text":"It's... You actually did it! In fact, this spine is even sharper than the one before..."},{"name":"TROUBLEMOG02","text":"I'll be able to make my friend an even nicer knife than the one he lent me! He'll surely forgive me now, kupo!"},{"name":"MOGLEO","text":"...And with that, another moogle's worries are washed away. But there's still much work to be done, and many more moogles with messes to clean. It's up to <span class=\"emphasis\">us</span> to find them!"}],"reward":{"gil":785,"items":[{"id":10798,"one":1,"hq":1},{"id":10882,"one":1,"hq":1},{"id":10924,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"questsType":"all","quests":[67159,67357]},"next":[67367]},"partials":[{"type":"npc","id":"1014429","obj":{"i":1014429,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014431","obj":{"i":1014431,"n":"Zooming Moogle","l":2002,"q":1}},{"type":"npc","id":"1014427","obj":{"i":1014427,"n":"Mumbling Moogle","l":2002,"q":2}},{"type":"npc","id":"1014430","obj":{"i":1014430,"n":"Mogleo","l":2002,"q":1}},{"type":"item","id":"10798","obj":{"i":10798,"n":"Titanium Mask of Aiming","l":133,"c":40455,"t":34,"p":19905}},{"type":"item","id":"10882","obj":{"i":10882,"n":"Hardsilver Monocle of Healing","l":133,"c":40949,"t":34,"p":15113}},{"type":"item","id":"10924","obj":{"i":10924,"n":"Hardsilver Magnifiers of Casting","l":133,"c":40950,"t":34,"p":15113}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67159","obj":{"i":67159,"n":"Moglin's Judgment","g":3,"l":"The Churning Mists","s":44}},{"type":"quest","id":"67357","obj":{"i":67357,"n":"A Pebble for Your Thoughts","g":100,"l":"The Churning Mists","s":5414}},{"type":"quest","id":"67367","obj":{"i":67367,"n":"Far from Home","g":100,"l":"The Churning Mists","s":5416}}]}