{"quest":{"name":"A Secret from Everyone","location":"The Churning Mists","id":67376,"patch":3.0,"sort":5505,"eventIcon":71221,"issuer":1012085,"target":1012085,"genre":100,"journal":["Mogmill looks like he's daydreaming─or not, it's hard to tell.","Mogmill, always thinking about where to get his paws on the next piece of landlord treasure, has recruited you to go to the House of Letters and look for shiny objects. He assures you that all the other moogles go to Tharl Oom Khash, so there should be plenty lying around. Go to the House of Letters and collect five shiny objects of dubious value.","You have obtained five shiny spillikins, and although they are shiny, you fail to see any practical value. Return to Moghome and deliver them to Mogmill─maybe he will put them to better use.","Mogmill is thrilled at the objects you deliver to him, and is one step closer to having the largest collection of shiny, useless objects out of any moogle from Moghome."],"objectives":["Obtain sparkly spillikins.","Deliver the sparkly spillikins to Mogmill."],"dialogue":[{"name":"MOGMILL","text":"The shiny sundries made by the landlords are in vogue all across Moghome, kupo! But, moogles can't work metal themselves, so everyone goes searching for shiny objects at Tharl Oom Khash."},{"name":"MOGMILL","text":"But <span class=\"emphasis\">I</span> know a secret place─the House of Letters, kupo! So many shiny objects are just waiting for someone adventurous to go pick them up. And they <span class=\"emphasis\">do</span> call you an adventurer, so... What do you say? If I had five sparkling objects, that should be enough to make the other moogles jealous!"},{"name":"MOGMILL","text":"Don't tell anyone, but treasures litter the House of Letters. All I need you to do is bring me five of them and it'll make all the other moogles jealous!"},{"name":"MOGMILL","text":"I can't believe no one has thought to go look there yet... Ah, adventurer, were you able to find enough of the landlords' shiny objects?"},{"name":"MOGMILL","text":"Wonderful! Amazing! Spectacular, kupopo! I've never seen such lustrous objects before! I'll be the talk of Moghome before long. Remember, adventurer, the House of Letters is our little secret!"}],"reward":{"gil":642,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"quests":[67171]}},"partials":[{"type":"npc","id":"1012085","obj":{"i":1012085,"n":"Mogmill","l":2002,"q":2}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}}]}