{"quest":{"name":"Worried Sick","location":"The Churning Mists","id":67375,"patch":3.0,"sort":5504,"eventIcon":71221,"issuer":1013502,"target":1013504,"involved":[1013501,1013503,1013505],"genre":100,"journal":["The meandering moogle of Moghome is tossing and turning.","The meandering moogle has taken his medicine and is well on the mend, but one thing hampers his recovery─his concern for his fluffy friend, who has not yet returned from his moca-gathering expedition. He bids you return to the Monsterie and bring the mercurial moogle back to Moghome.","You find the mercurial moogle hiding from a swarm of vicious vilekin. You do away with the insects, freeing the moogle to return to his friend's side. Follow the mercurial moogle back to Moghome to check on the patient's progress.","Relieved of his burden of cares by his friend's safe return, the meandering moogle has made a full recovery. He thanks you effusively for saving not only his own life, but that of his flighty friend as well."],"objectives":["Search for the mercurial moogle.","Speak with the meandering moogle."],"dialogue":[{"name":"CAREGIVERMOG01836","text":"I've given my friend the medicine, kupo. His fever's gone down, but he still hasn't got his energy back. Honestly, you bend over backwards for some moogles, and they still don't get better!"},{"name":"LYINGMOGB01836","text":"I feel a lot better, kupo... It must be because of that moca leaf that my friend went to find for me. But where is my friend, kupo? He isn't hurt, is he?"},{"name":"LYINGMOGB01836","text":"He said he was going to the Monsterie, but the Monsterie is full of monsters! Maybe the monsters got him, and...agh! I don't feel well, kupo! I don't think I'll ever feel well until I see my friend again! Please bring him back to me, kupo!"},{"name":"LYINGMOGB01836","text":"My friend went to find the moca leaf to cure my fever, but he didn't come back... You don't think the monsters got him, do you? Or a loose stone? A loose stone once landed on my head, kupo. I couldn't feel my pom-pom for a week... Please bring my friend back to Moghome!"},{"name":"CAREGIVERMOG01836","text":"Everybody knows his friend's a little flighty, but the fellow has been gone a long time, even by his standards... Would you mind going back to the Monsterie and seeing what's keeping him, kupo? It looks like our patient won't ever recover until he's got his friend back."},{"name":"LYINGMOGA01836","text":"Adventurer, is that you? Thank goodness you came, kupo! A swarm of nasty bugs appeared, so I had to hide. Now that they're gone, I can head back to Moghome and see how my friend's getting on!"},{"name":"LYINGMOGA01836","text":"I managed to make it back in one piece, kupo! When those big bad bees started chasing me, I thought I was for it!"},{"name":"CAREGIVERMOG01836","text":"Welcome back, adventurer. When our patient saw his friend had returned, he perked right up! I bet our mercurial friend here thinks it's his return that's done the trick and not my marvelous medicine, kupo! Though I suppose we wouldn't have either if it wasn't for you..."},{"name":"LYINGMOGB01836","text":"Hello, adventurer! I feel a lot better now, and my friend is safe and sound too, kupo! You're a lifesaver, in more ways than one!"}],"reward":{"gil":621,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67374]},"next":[67396]},"partials":[{"type":"npc","id":"1013502","obj":{"i":1013502,"n":"Meandering Moogle","l":2002,"q":3}},{"type":"npc","id":"1013504","obj":{"i":1013504,"n":"Meandering Moogle","l":2002,"q":2}},{"type":"npc","id":"1013501","obj":{"i":1013501,"n":"Malcontent Moogle","l":2002,"q":4}},{"type":"npc","id":"1013503","obj":{"i":1013503,"n":"Mercurial Moogle","l":2002,"q":1}},{"type":"npc","id":"1013505","obj":{"i":1013505,"n":"Mercurial Moogle","l":2002,"q":2}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67374","obj":{"i":67374,"n":"Moogles' Marvelous Medicine","g":100,"l":"The Churning Mists","s":5503}},{"type":"quest","id":"67396","obj":{"i":67396,"n":"Mallow in Sadness","g":100,"l":"The Churning Mists","s":5506}}]}