{"quest":{"name":"Something in the Water","location":"The Churning Mists","id":67373,"patch":3.0,"sort":5502,"eventIcon":71221,"issuer":1012284,"target":1012284,"genre":100,"journal":["Mogret is gazing at these wilting flowers with a concerned expression.","It seems that Mogret is fretting over some flowers that are in danger of wilting before her very eyes, but she cannot water them due to the hropken that has moved into her favorite spring. Go to Eil Tohm and slay the inconsiderate hropken, then fill the empty ewer Mogret gave you with water for the flowers.","The hropken will no longer be a problem for the moogles of Moghome, and the once-empty ewer is now filled with sparkling spring water. Bring it to Mogret before her flowers wilt away into nothing.","Mogret is ecstatic that her flowers will be able to bloom even further. It seems the increase in dragons is a recent phenomena, and Mogret seems convinced that they have only come to give the moogles a hard time."],"objectives":["Slay the dragonfoot hropken and get water from the clear spring. ","Deliver the full ewer to Mogret."],"dialogue":[{"name":"MOGRET","text":"Oh no, this won't do, this won't do at all, kupo! If we don't water these flowers soon, there'll be nothing left but dried husks! But thanks to a mean old hropken, doing gods know what in the spring, we can't get anywhere near the precious water!"},{"name":"MOGRET","text":"Say, you look like you've done your fair share of dragonslaying─why don't you get rid of that hulking hropken for us and fill this ewer with water for the flowers, kupo? Our little garden is depending on you!"},{"name":"MOGRET","text":"Show that mean old hropken that it can't just sit wherever it pleases! Oh, and don't forget to bring back the water, kupo!"},{"name":"MOGRET","text":"Oh... I can see the flowers wilting before my very eyes, kupo! Did you manage to bring the water?"},{"name":"MOGRET","text":"Finally, the flowers are saved! There didn't used to be so many dragons stamping about those springs, but recently we've been seeing more and more."},{"name":"MOGRET","text":"I don't know where they came from, but I'm sure that they're only here to make our lives a pain in the pom-pom, kupo!"}],"reward":{"gil":521,"items":[{"id":12855},{"num":3,"id":6143,"one":1},{"num":3,"id":4663,"one":1},{"num":3,"id":6142,"one":1}],"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"quests":[67171]}},"partials":[{"type":"npc","id":"1012284","obj":{"i":1012284,"n":"Mogret","l":2002,"q":2}},{"type":"item","id":"12855","obj":{"i":12855,"n":"Grilled Sweetfish","l":133,"c":24301,"t":46,"p":1053}},{"type":"item","id":"6143","obj":{"i":6143,"n":"Grilled Raincaller","l":40,"c":24301,"t":46}},{"type":"item","id":"4663","obj":{"i":4663,"n":"Mugwort Carp","l":38,"c":24314,"t":46}},{"type":"item","id":"6142","obj":{"i":6142,"n":"Grilled Warmwater Trout","l":20,"c":24301,"t":46}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}}]}