{"quest":{"name":"Pom-pom Panic","location":"The Churning Mists","id":67370,"patch":3.0,"sort":5410,"eventIcon":71221,"issuer":1012288,"target":1013430,"involved":[1013431,1013432,1013433,1015139,1015140,1015141],"genre":100,"journal":["Mogmont is scouring the horizon for signs of mooglelife.","The time has come for a lookout to replace Mogmont, but the moogles meant to relieve him are nowhere to be found. Search the road to the Monsterie for any signs of the group.","You have found the first of the missing moogles, who were scattered in a sudden dragon attack. Keep an eye out for the remaining three.","The moogles look shaken, but all are unharmed. Inform the first lost moogle.","Relieved that all members of the group escaped harm, the moogles will return to Asah with their pom-poms extra alert."],"objectives":["Find the lost moogles on the way to the Monsterie.","Find the lost moogles.","Report to the mazed moogle."],"dialogue":[{"name":"MOGMONT","text":"A recent spate of dragon attacks has been keeping us on guard. One can never be too careful."},{"name":"MOGMONT","text":"But no moogle can keep watch forever. My shift replacements were due to arrive some time ago, but there remains no sign of them. Could you see if they've run into any trouble along the road, kupo?"},{"name":"MOGMONT","text":"Where could they be? They should've been here bells ago, kupo."},{"name":"DEVIATEDMOGA01834","text":"This isn't good... A nasty gang of dragons attacked my companions and me, scattering us every which way. The three of them should be around here... Have you found any trace of them, kupo?"},{"name":"MOGMONT","text":"I can't keep up the watch much longer... Please help find the missing moogles, kupo! "},{"name":"DEVIATEDMOGA01834","text":"They say the best tactic to use when facing a dragon is to run... They should be around here somewhere, kupo..."},{"name":"DEVIATEDMOGB01834","text":"Where's the bloody road... Ah! Many thanks for pointing me in the right direction, kupo!"},{"name":"DEVIATEDMOGC01834","text":"Are the dragons still out there? No? Then I guess I'll return..."},{"name":"DEVIATEDMOGD01834","text":"We barely escaped by the fluff of our pom-poms, kupo! Well, time to go back to the others."},{"name":"MOGMONT","text":"I see no traces of their pom-poms on the horizon... Have you found them, kupo?"},{"name":"DEVIATEDMOGB01834","text":"Thank heavens we all made it, kupo!"},{"name":"DEVIATEDMOGC01834","text":"The dragons might still be around somewhere..."},{"name":"DEVIATEDMOGD01834","text":"Blasted dragons... Let's head back to Asah before they return in greater numbers, kupo."},{"name":"DEVIATEDMOGA01834","text":"We would've never found our way if it wasn't for you, adventurer. We won't let any of those vile beasts take us by surprise on the way back!"}],"reward":{"gil":575,"xp":31200},"reqs":{"jobs":[{"lvl":54,"id":34}],"quests":[67164]}},"partials":[{"type":"npc","id":"1012288","obj":{"i":1012288,"n":"Mogmont","l":2002,"q":4}},{"type":"npc","id":"1013430","obj":{"i":1013430,"n":"Mazed Moogle","l":2002,"q":1}},{"type":"npc","id":"1013431","obj":{"i":1013431,"n":"Muddled Moogle","l":2002,"q":1}},{"type":"npc","id":"1013432","obj":{"i":1013432,"n":"Mousy Moogle","l":2002,"q":1}},{"type":"npc","id":"1013433","obj":{"i":1013433,"n":"Mortified Moogle","l":2002,"q":1}},{"type":"npc","id":"1015139","obj":{"i":1015139,"n":"Muddled Moogle","l":2002,"q":1}},{"type":"npc","id":"1015140","obj":{"i":1015140,"n":"Mousy Moogle","l":2002,"q":1}},{"type":"npc","id":"1015141","obj":{"i":1015141,"n":"Mortified Moogle","l":2002,"q":1}},{"type":"quest","id":"67164","obj":{"i":67164,"n":"The Wyrm's Lair","g":3,"l":"The Churning Mists","s":49}}]}