{"quest":{"name":"No Country for Young Moogles","location":"The Churning Mists","id":67381,"patch":3.0,"sort":5515,"eventIcon":71221,"issuer":1013507,"target":1013507,"involved":[1013508,1013509,1013510,1013511,1013512,1013513],"genre":100,"journal":["The impatient moogle appears to have reached the end of his tether.","The impatient moogle tells you that his three young charges have disappeared into the dragon-infested wastes of Ohl Tahn, seeking to emulate the adventurers they idolize. He implores you follow the young moogles into this den of danger, and save them from themselves.","You find the adventurous mooglings and convince them to return to their master. Head back to Zenith to ensure that they have all returned safely to the impatient moogle's side.","The impatient moogle thanks you for rescuing his charges, before lambasting them for their reckless behavior. However, it seems that your successful rescue effort has only served to increase their admiration for adventurers. Knowing full well that it will further test their master's meager patience, the undeterred trio head out on another exciting adventure."],"objectives":["Find the missing moogles.","Report to the impatient moogle."],"dialogue":[{"name":"AIRPORTMOG01845","text":"Oh, adventurer! It's awful! It's terrible! It's infuriating, kupo! My three young charges have flown off into the wild wastes of Ohl Tahn!"},{"name":"AIRPORTMOG01845","text":"They've been watching you adventurers heading over there to face the dragons, and the reckless little rascals thought to try it for themselves, kupo! Please, adventurer─you've got to bring them back before it's too late!"},{"name":"AIRPORTMOG01845","text":"Ohl Tahn's full of dragons, dinosaurs, wyverns, and worse! It's no place for a moogle, particularly not a trio of puny scamps like them. Oh, adventurer, I'm so worried about them! Please say you'll bring them back to me!"},{"name":"TEMPLEMOGA01845","text":"Kupooo! It's a real-life adventurer! I bet you're not tired at all, are you? I'm so pooped I can barely lift my pom-pom... I think I'm going to have to call it a day."},{"name":"TEMPLEMOGB01845","text":"I can't go on, kupo─it's so scary out here! I don't know how you adventurers do it! ...He asked you to bring me back to Zenith? You don't have to tell me twice─I'm going to fly back as fast as my wings will carry me!"},{"name":"TEMPLEMOGC01845","text":"Kupo, kupo, kupooo! Isn't adventuring fun? There are dragons everywhere, but I'm not scared at all! The next time I go on an adventure, I'm going to pull one's tail!"},{"name":"TEMPLEMOGA01845","text":"Adventurers never seem to get tired, kupo... &lt;sigh&gt; I wish I was strong like you..."},{"name":"TEMPLEMOGB01845","text":"It takes a braver moogle than me to become an adventurer, kupo..."},{"name":"TEMPLEMOGC01845","text":"Did you come looking for us just because he asked you to? That's the adventuring spirit right there, kupo!"},{"name":"AIRPORTMOG01845","text":"Thank you for bringing them back from that dreadful place, adventurer! It's a wonder the fluff-headed fools didn't get themselves eaten, kupo."},{"name":"AIRPORTMOG01845","text":"Do you hear me? I've had about as much of your nonsense as I'm going to take, kupo! No more adventures, alright?"},{"name":"TEMPLEMOGA01845","text":"...B-But how are we ever going to become adventurers if you don't let us practice!?"},{"name":"AIRPORTMOG01845","text":"Kupopopooo! Come back here, kupooo!"}],"reward":{"gil":581,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67382]},"next":[67386]},"partials":[{"type":"npc","id":"1013507","obj":{"i":1013507,"n":"Impatient Moogle","l":2002,"q":2}},{"type":"npc","id":"1013508","obj":{"i":1013508,"n":"Impotent Moogle","l":2002,"q":1}},{"type":"npc","id":"1013509","obj":{"i":1013509,"n":"Commoving Moogle","l":2002,"q":1}},{"type":"npc","id":"1013510","obj":{"i":1013510,"n":"Militant Moogle","l":2002,"q":1}},{"type":"npc","id":"1013511","obj":{"i":1013511,"n":"Impotent Moogle","l":2002,"q":1}},{"type":"npc","id":"1013512","obj":{"i":1013512,"n":"Commoving Moogle","l":2002,"q":1}},{"type":"npc","id":"1013513","obj":{"i":1013513,"n":"Militant Moogle","l":2002,"q":1}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67382","obj":{"i":67382,"n":"There Will Be Blades","g":100,"l":"The Churning Mists","s":5514}},{"type":"quest","id":"67386","obj":{"i":67386,"n":"The Mog Squad Assembles","g":100,"l":"The Churning Mists","s":5516}}]}