{"quest":{"name":"If Living Is without Nuts","location":"The Churning Mists","id":67384,"patch":3.0,"sort":5512,"eventIcon":71221,"issuer":1013514,"target":1013514,"genre":100,"journal":["“Nuts!” says the unmaneuvering moogle.","The unmaneuvering moogle has lost his nuts in an unfortunate encounter with a vinegaroon. As the moogle was traveling through Ohl Tahn, the bladed beast spotted him and gave chase. The terrified moogle escaped to Zenith unharmed, only to discover that he dropped his kupo nut collection along the way. He asks you to return to the scene of his disgrace and retrieve his five precious nuts.","You collect the five kupo nuts that make up the unmaneuvering moogle's collection. Return to Zenith to reunite him with his nuts.","The unmaneuvering moogle is moved by the kindness you have shown him. Now that he has his nuts back, he is a happy moogle once more."],"objectives":["Collect the kupo nuts.","Return the kupo nuts to the unmaneuvering moogle."],"dialogue":[{"name":"TEMPLECENTERMOG01848","text":"I've really gone and done it this time, kupo... I was merrily making my way through Ohl Tahn when a bladed vinegaroon started to chase me. I was so scared, I dropped my nuts!"},{"name":"TEMPLECENTERMOG01848","text":"I was carrying five kupo nuts, but now I've got none. Please find them for me, kupo! I'm nothing without my nuts!"},{"name":"TEMPLECENTERMOG01848","text":"I can't believe I lost my nuts... All five of them, kupo! Once I was the happiest moogle in the world, but now I'm nothing! Please bring me back my kupo nuts!"},{"name":"TEMPLECENTERMOG01848","text":"Are those my nuts you're holding in your hand, adventurer? All five of them!?"},{"name":"TEMPLECENTERMOG01848","text":"My nuts! My beautiful nuts! I'd recognize those kupo nuts anywhere, kupo! Thank you, adventurer─you're a lifesaver. Why, when I realized I'd lost my nuts, I was so upset I nearly pulled off my pom-pom!"}],"reward":{"gil":490,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"quests":[67171]},"next":[67385]},"partials":[{"type":"npc","id":"1013514","obj":{"i":1013514,"n":"Unmaneuvering Moogle","l":2002,"q":2}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67385","obj":{"i":67385,"n":"The Nest Episode","g":100,"l":"The Churning Mists","s":5513}}]}