{"quest":{"name":"Root Maneuvers","location":"The Churning Mists","id":67380,"patch":3.0,"sort":5510,"eventIcon":71221,"issuer":1012089,"target":1012084,"genre":100,"journal":["Mogeuge's shoulders are all ashiver.","Mogeuge has heard the characteristic clicking of crackleweed seedlings drifting on the wind from the lands below his lookout point. Though he is glad to know the plants still survive in the scorched soil of the Four Arms, he fears for their chances of thriving. To secure their survival, he bids you collect five of the seedlings and deliver them to Moggzia, head gardener of Moghome, to be replanted in kinder climes.","You successfully collect five crackleweed seedlings from the Four Arms. Travel to Moghome to deliver them into Moggzia's green-fingered paws.","You deliver the seedlings to Moggzia, who agrees to replant them in his hilltop haven. Since Nidhogg's roar drove the dragons into a frenzy, the scalekins' wanton acts of destruction have brought much of the local flora to the brink of extinction. But as long as moogles like Moggzia are around, the plants and flowers of the Churning Mists have a fighting chance of thriving in pastures new."],"objectives":["Collect crackleweed seedlings.","Deliver the crackleweed seedlings to Moggzia."],"dialogue":[{"name":"MOGEUGE","text":"Do you hear that snapping noise, adventurer? It's the cry of a crackleweed, kupo! Several new seedlings have taken root in the Four Arms, but the poor little things won't last for long in those dragon-infested lands. We have to move them somewhere they'll be taken care of!"},{"name":"MOGEUGE","text":"Could I ask you to dig up five of the seedlings and take them over to Moggzia, kupo? He's the moogle in charge of the garden above Moghome. If anyone can find those poor little seedlings a good home, he can."},{"name":"MOGEUGE","text":"The Four Arms is no place for a crackleweed, kupo. If they aren't moved to a new home soon, they'll waste away! I'd be ever so grateful if you could dig the seedlings up and take them over to Moggzia. He'll know what to do with them."},{"name":"MOGEUGE","text":"Did you find the crackleweed seedlings, kupo? Then take them back to Moghome right away! Don't worry, little seedlings─Moggzia will find a nice place for you in his garden!"},{"name":"MOGGZIA","text":"...Kupopopo? Can I help you, adventurer?"},{"name":"MOGGZIA","text":"Mogeuge sent these seedlings to be replanted? Well, all right. I'm sure I can find a place for them somewhere."},{"name":"MOGGZIA","text":"Ever since the dragons went round the twist, their lands have fallen into wrack and ruin, and a lot of the native plants have been lost in the process. But as long as we moogles live and breathe, the flowers will always find a friend in us, kupo!"}],"reward":{"gil":490,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67378]}},"partials":[{"type":"npc","id":"1012089","obj":{"i":1012089,"n":"Mogeuge","l":2002,"q":2}},{"type":"npc","id":"1012084","obj":{"i":1012084,"n":"Moggzia","l":2002,"q":4}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67378","obj":{"i":67378,"n":"Just Another Bug Hunt","g":100,"l":"The Churning Mists","s":5508}}]}