{"quest":{"name":"The Nest Episode","location":"The Churning Mists","id":67385,"patch":3.0,"sort":5513,"eventIcon":71221,"issuer":1013514,"target":1013514,"genre":100,"journal":["The unmaneuvering moogle has birds on the brain.","The unmaneuvering moogle informs you the heights of Zenith play host to a flock of migratory wildfowl, and this year's chicks have recently flown the roost. While the sight of the young birds setting out on the first leg of their life's long journey is soothing to the soul, the decomposing piles of leaf litter and broken eggshells they leave behind are less welcome. The moogle asks you to scour the heights of Zenith for the fledglings' abandoned nests and bring them back to him.","You clear away the empty wildfowl nests, leaving the heights of Zenith spick-and-span and ready for the birds' return. Descend from Zenith and deliver the nests to the unmaneuvering moogle.","The moogle thanks you for clearing away the nests and lets you in on a little secret─he has heard rumors that birds' nests can be used to make a delicious soup, and plans to use those you have collected to test the recipe. If you should ever wish to try a hot cup of sticks, feathers, eggshells, and regurgitated worms, then the unmaneuvering moogle is the chef to speak with."],"objectives":["Collect wildfowl nests.","Deliver the wildfowl nests to the unmaneuvering moogle."],"dialogue":[{"name":"TEMPLECENTERMOG01848","text":"A lot of wild birds make their nests up in the heights of Zenith, and this year's flock have finally fledged. I hope they come back someday, kupo...but until then, we've got a pile of empty nests to deal with."},{"name":"TEMPLECENTERMOG01848","text":"Those big stacks of sticks, feathers, and half-chewed bug bits aren't exactly in keeping with the beauty of the place. Will you help me to clear them away, kupo? The birds like to build them in the very highest places, so take care you don't fall!"},{"name":"TEMPLECENTERMOG01848","text":"We need to clear away all the old nests before the birds come back. After all, who wants to come home to a messy house, kupo?"},{"name":"TEMPLECENTERMOG01848","text":"How goes the cleaning effort, kupo? Have you managed to clear up all of the nests yet?"},{"name":"TEMPLECENTERMOG01848","text":"Thanks for your help, kupo! Just between you and me, I've heard that you can make a tasty soup out of birds' nests. When I get back to Moghome, I'm going to boil them up with a few fresh kupo nuts! ...Do you think I should leave in the half-chewed bug bits or scrape them out?"}],"reward":{"gil":521,"items":[{"num":3,"id":4656,"one":1},{"num":3,"id":4704,"one":1},{"num":3,"id":7575,"one":1}],"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67384]}},"partials":[{"type":"npc","id":"1013514","obj":{"i":1013514,"n":"Unmaneuvering Moogle","l":2002,"q":2}},{"type":"item","id":"4656","obj":{"i":4656,"n":"Apkallu Omelette","l":70,"c":24253,"t":46}},{"type":"item","id":"4704","obj":{"i":4704,"n":"Finger Sandwich","l":70,"c":24009,"t":46}},{"type":"item","id":"7575","obj":{"i":7575,"n":"Spinach Quiche","l":70,"c":24252,"t":46}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67384","obj":{"i":67384,"n":"If Living Is without Nuts","g":100,"l":"The Churning Mists","s":5512}}]}