{"quest":{"name":"What Learning Entails","location":"The Churning Mists","id":67388,"patch":3.0,"sort":5518,"eventIcon":71221,"issuer":1013521,"target":1013521,"genre":100,"journal":["Mogkon is shaking her wand furiously at the air.","Mogkon has been assigned to kill the drakes slinking about the area. Before she tries to take one on herself, she needs you to gauge their strength and bring her three drake tails from your fallen foes.","The drakes fall one after the other, and the tails are now in your hands. Deliver them to Mogkon.","Mogkon thanks you for giving her an accurate read on the drakes' strength. However, she decides that she probably needs to train more before attempting to take one on herself."],"objectives":["Slay Mists drakes for their tails.","Deliver the tails to Mogkon."],"dialogue":[{"name":"MOGKON","text":"See those Mists drakes over there? Those're my targets. Now, all I have to do is hit 'em with a fireball and win, right? But what if I miss, kupo?"},{"name":"MOGKON","text":"I need you to go and gauge their strength for me. Slay them and bring me three of their tails, then we'll know exactly what kind of beasts we're dealing with."},{"name":"MOGKON","text":"They don't look so tough, but you need to make sure for me. I'll be watching from a safe and educational distance, kupo."},{"name":"MOGKON","text":"That didn't look too hard, kupo! Did you bring their tails?"},{"name":"MOGKON","text":"Ah...so these are drake tails? Doesn't look like anything me and my moogle magick can't handle!"},{"name":"MOGKON","text":"But... I might need <span class=\"emphasis\">just</span> a little more training before trying to burn one down myself. Having a goal is the first step towards growth! Drill over, kupo!"}],"reward":{"gil":490,"items":[{"num":5,"id":21800}],"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67386]},"next":[67390]},"partials":[{"type":"npc","id":"1013521","obj":{"i":1013521,"n":"Mogkon","l":2002,"q":1}},{"type":"item","id":"21800","obj":{"i":21800,"n":"Glamour Prism","l":35,"c":26235,"t":60}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67386","obj":{"i":67386,"n":"The Mog Squad Assembles","g":100,"l":"The Churning Mists","s":5516}},{"type":"quest","id":"67390","obj":{"i":67390,"n":"Walking the Walk","g":100,"l":"The Churning Mists","s":5520}}]}