{"quest":{"name":"A Frightening Field Trip","location":"The Churning Mists","id":67394,"patch":3.0,"sort":5526,"eventIcon":71221,"issuer":1013535,"target":1013535,"involved":[1013536,1013537,1013538,1013539,1013540,1013541,1013542,1013543,1013544,1013545],"genre":100,"journal":["The malingering moogle is shivering in fear.","The moogle expedition is visiting the ruins of Tharl Oom Khash to learn more of the time when dragons and mankind lived amicably together. However, the leader of the expedition has cold wings and is scared to explore any further. Inform the rest of the moogles in the expedition that it is time for them to return home.","You have informed the moogle expedition that the time has come for them to leave. Despite some protests, they have complied with their orders. Report back to the expedition leader.","It seems that the ruins were once home to a great wyrm by the name of Ratatoskr. The moogles are surprised that another great wyrm besides Hraesvelgr and Nidhogg had ever inhabited these lands."],"objectives":["Search for the moogles.","Report to the malingering moogle.","Report to the expedition leader."],"dialogue":[{"name":"FIELDTRIPMOGA01856","text":"What a find, kupo! Everyone will be amazed!"},{"name":"FIELDTRIPMOGB01857","text":"I never thought the ruins would be so massive. There's so much space for exploring!"},{"name":"GUIDEMOG01855","text":"Our expedition is exploring the ruins of Tharl Oom Khash to learn of the time when there was peace between the skylords and the landlords. None have stepped foot here in ages... To be honest, it's quite frightening, kupo..."},{"name":"GUIDEMOG01855","text":"...It might be time to cut the expedition short. Could you inform the other moogles that we'll be returning home shortly? I'm too scared to move, so I'll be waiting here!"},{"name":"GUIDEMOG01855","text":"I get the feeling we shouldn't be here... Could you tell the others that it's time to go home?"},{"name":"FIELDTRIPMOGA01856","text":"What!? We're leaving already!? <br>&lt;sigh&gt; ...Well, I suppose it <span class=\"emphasis\">is</span> somewhat sinister here..."},{"name":"FIELDTRIPMOGB01857","text":"The ruins are massive, but the architecture indicates someone─or something─lived here in comfort... What's that? Time to go home? Well, if you say so, kupo..."},{"name":"FIELDTRIPMOGC01858","text":"I've found traces that Ratatoskr's brood once lived here... Most interesting... Oh! The expedition is over? I shall return at once, kupo."},{"name":"FIELDTRIPMOGD01858","text":"I've barely been able to scratch the surface of these ruins, there's so much to see, kupo. But, I <span class=\"emphasis\">am</span> getting quite tired... I suppose I'll go back."},{"name":"FIELDTRIPMOGE01858","text":"The ruins resemble Zenith at parts... I wonder what kind of dragons could've lived here, kupo. Well, I guess we'll explore more tomorrow."},{"name":"FIELDTRIPMOGA01856","text":"While scouring the ruins I came across a seal that could've only belonged to the brood of a great dragon. There's still much to explore, kupo!"},{"name":"FIELDTRIPMOGB01857","text":"This kind of palace is much too large for moogles. We'd have to take several naps just getting from one place to the other, kupo."},{"name":"FIELDTRIPMOGC01858","text":"Ratatoskr... I'll have to do more research into this dragon's true nature."},{"name":"FIELDTRIPMOGD01858","text":"The ruins are so massive it's hard to know where to begin... I think I'll just lie down for a bit, kupo..."},{"name":"FIELDTRIPMOGE01858","text":"The skylords living here must've been a breed like none other, kupo."},{"name":"GUIDEMOG01855","text":"Everyone seems to have returned. Thank you, adventurer! It seems that these ruins were once home to skylords loyal to a great wyrm named Ratatoskr."},{"name":"GUIDEMOG01855","text":"To think that such palaces were dedicated to dragons outside of the great Hraesvelgr and the evil Nidhogg... Ratatoskr must surely have rivaled them in greatness, kupo!"},{"name":"GUIDEMOG01855","text":"As interesting as the ruins are, staying here fills me with a sense of dread. For now, the expedition will return home. Thank you once again, adventurer!"}],"reward":{"gil":521,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67393]}},"partials":[{"type":"npc","id":"1013535","obj":{"i":1013535,"n":"Malingering Moogle","l":2002,"q":4}},{"type":"npc","id":"1013536","obj":{"i":1013536,"n":"Remarking Moogle","l":2002,"q":3}},{"type":"npc","id":"1013537","obj":{"i":1013537,"n":"Glimpsing Moogle","l":2002,"q":2}},{"type":"npc","id":"1013538","obj":{"i":1013538,"n":"Miming Moogle","l":2002,"q":1}},{"type":"npc","id":"1013539","obj":{"i":1013539,"n":"Impetuous Moogle","l":2002,"q":1}},{"type":"npc","id":"1013540","obj":{"i":1013540,"n":"Rummaging Moogle","l":2002,"q":1}},{"type":"npc","id":"1013541","obj":{"i":1013541,"n":"Remarking Moogle","l":2002,"q":1}},{"type":"npc","id":"1013542","obj":{"i":1013542,"n":"Glimpsing Moogle","l":2002,"q":1}},{"type":"npc","id":"1013543","obj":{"i":1013543,"n":"Miming Moogle","l":2002,"q":1}},{"type":"npc","id":"1013544","obj":{"i":1013544,"n":"Impetuous Moogle","l":2002,"q":1}},{"type":"npc","id":"1013545","obj":{"i":1013545,"n":"Rummaging Moogle","l":2002,"q":1}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67393","obj":{"i":67393,"n":"It's Not a Bug, It's a Creature","g":100,"l":"The Churning Mists","s":5525}}]}