{"quest":{"name":"Mallow in Sadness","location":"The Churning Mists","id":67396,"patch":3.0,"sort":5506,"eventIcon":71221,"issuer":1012084,"target":1012084,"involved":[1013501,1013504,1013505],"genre":100,"journal":["Moggzia is looking desperately around the surrounding grass.","A sudden gust of wind has taken Moggzia's precious cloud mallows into its greedy currents. Look for the three pieces that were carried off towards the Mother of the Sheave statue.","You have recovered the three tufts of Moggzia's precious cloud mallow. Return them to the worried moogle.","A noticeable weight lifts off of Moggzia's shoulders when you hand over the mallow tufts he holds so near and dear. It would seem he would have gone hungry without his tufts to use for skyfishing."],"objectives":["Find tufts of cloud mallow.","Deliver the tufts of cloud mallow to Moggzia."],"dialogue":[{"name":"CAREGIVERMOG01836","text":"Everyone's perked right up thanks to you, kupo!"},{"name":"LYINGMOGB01836","text":"I'd probably still be napping if it wasn't for you, kupo!"},{"name":"LYINGMOGA01836","text":"Everything is going well over here, kupo!"},{"name":"MOGGZIA","text":"Oh, no... Without my cloud mallows, I can't do anything, kupopo!"},{"name":"MOGGZIA","text":"My precious cloud mallows were carried off by a sudden gust of wind! The currents carried them off in the direction of the Mother of the Sheave statue. Adventurer, please, recover my three pieces of cloud mallow before I lose my moogle mind, kupo!"},{"name":"MOGGZIA","text":"I saw my tufts of cloud mallow fly off in the direction of the Mother of the Sheave statue. My pom-pom is shaking... Please, get them back for me!"},{"name":"MOGGZIA","text":"I do hope the beasts around the statue haven't gobbled up my tufts... <span class=\"emphasis\">My precious tufts</span>! &lt;sob&gt;"},{"name":"MOGGZIA","text":"&lt;gasp&gt; You found them! You found them! Kupopo! I don't know what I would have done without my cloud mallows! They're perfect for skyfishing─now I won't go hungry, kupo!"}],"reward":{"gil":590,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67375]}},"partials":[{"type":"npc","id":"1012084","obj":{"i":1012084,"n":"Moggzia","l":2002,"q":4}},{"type":"npc","id":"1013501","obj":{"i":1013501,"n":"Malcontent Moogle","l":2002,"q":4}},{"type":"npc","id":"1013504","obj":{"i":1013504,"n":"Meandering Moogle","l":2002,"q":2}},{"type":"npc","id":"1013505","obj":{"i":1013505,"n":"Mercurial Moogle","l":2002,"q":2}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67375","obj":{"i":67375,"n":"Worried Sick","g":100,"l":"The Churning Mists","s":5504}}]}