{"quest":{"name":"Walking on Eggshells","location":"The Churning Mists","id":67392,"patch":3.0,"sort":5524,"eventIcon":71221,"issuer":1013536,"target":1013536,"involved":[1013535],"genre":100,"journal":["Something in Tharl Oom Khash is bugging this moogle.","A nest of horrifying flying insects has been discovered by a moogle expedition exploring Tharl Oom Khash. Slay them so the expedition can continue.","You have slain the insects, clearing the way for the curious moogles. Report back to the entrance of Tharl Oom Khash.","The moogles are grateful that they can resume their expedition. The ruins of Tharl Oom Khash are home to a wealth of potential knowledge about the landlords that lived there ages ago."],"objectives":["Slay burrowing wamourae.","Report to the remarking moogle."],"dialogue":[{"name":"GUIDEMOG01855","text":"Everyone is here on an exploratory expedition, kupo."},{"name":"FIELDTRIPMOGA01856","text":"Someone, anyone! Help us! We've discovered something in Tharl Oom Khash that'll make your stomach turn, kupo!"},{"name":"FIELDTRIPMOGA01856","text":"Giant winged insects are infesting the ruins, brooding over eggs which could hatch at any time. Our expedition can't continue with such disgusting beasts in the way. Help us, kupo!"},{"name":"FIELDTRIPMOGA01856","text":"Just seeing the bugs fly about makes me want to go home─to say nothing of all the eggs. Adventurer, please do something!"},{"name":"GUIDEMOG01855","text":"This is turning out to be quite the expedition, kupo."},{"name":"GUIDEMOG01855","text":"These ruins are just ripe for exploring."},{"name":"FIELDTRIPMOGA01856","text":"Were you able to solve our pest problem? You have our gratitude─curious moogle historians of the realm are in your debt!"},{"name":"FIELDTRIPMOGA01856","text":"Tharl Oom Khash was home to the landlords many ages ago. The area is overflowing with knowledge and history, and we mean to take as much as we can back with us, kupo!"}],"reward":{"gil":581,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67391]},"next":[67393]},"partials":[{"type":"npc","id":"1013536","obj":{"i":1013536,"n":"Remarking Moogle","l":2002,"q":3}},{"type":"npc","id":"1013535","obj":{"i":1013535,"n":"Malingering Moogle","l":2002,"q":4}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67391","obj":{"i":67391,"n":"Unwanted Attention","g":100,"l":"The Churning Mists","s":5523}},{"type":"quest","id":"67393","obj":{"i":67393,"n":"It's Not a Bug, It's a Creature","g":100,"l":"The Churning Mists","s":5525}}]}