{"quest":{"name":"Trouble at Zenith","location":"The Churning Mists","id":67404,"patch":3.0,"sort":5533,"icon":100478,"eventIcon":71221,"issuer":1014300,"target":1012082,"involved":[1014301,1014302,1014309,1014310,1014311,1014312,1014313],"genre":100,"journal":["Mogkul is worried about the invading dragons' intentions.","Mogkul is confused as to why dragons would be attacking them if their true intention was to destroy Zenith. Mogleo, having just recently joined the Pomguard, asks Mogkul why the dragons are loath to let the holy place stand. Mogkul explains that Zenith stands as a symbol of the once-strong friendship between the landlords and the skylords, and is all that remains standing after Nidhogg's wrath laid waste to the land. Mogleo surmises that the dragons are not aiming to destroy the whole tower, but the object that most symbolizes it: the spire. Mogkul and the others rush off towards the spire, and Mogkul commands Mogleo to stay put due to his wounds. Mogleo asks you to aid the Pomguard in defense of Zenith.","It seems Mogleo was correct, and upon arriving at the spire of Zenith you see the injured members of the Pomguard with a fearsome dragon flapping its wings menacingly above them. While the dragon is impressed that the moogles were able to survive thus far, it has no intention of letting anyone escape this time. It attacks, but you slay it as you have many dragons before it. Check on the grounded members of the Pomguard to ensure that their wounds are not severe.","The moogles seem to recover from their battle relatively quickly, and are filled with pride that Zenith still stands unharmed. The moogles say that they will continue to honor their sacred covenant with Hraesvelgr, but express regret that they lack the means to do anything more than patrol the palace and clean up the occasional minor mess. However, the moogles are proud of their accomplishment this day, and Mogkul states they will perform one final patrol of Zenith to ensure that there are no more dragons wandering about. Return to Moghome and tell Captain Mogloo about his troops' heroic deeds.","Mogloo is grateful that you were able to assist the Pomguard in protecting Zenith, and proud that they were able to save it from disaster. Echoing Mogkul's sentiment, Mogloo wishes that the moogles could do something to repair the damage Zenith suffers as the years pass. However, until the day arrives when the moogles learn the required skills, they will dutifully continue their patrol and cleaning duties."],"objectives":["Help the Pomguard protect Zenith.","Speak with Mogkul.","Speak with Mogloo in Moghome."],"dialogue":[{"name":"MOGOK","text":"We've finished our patrols, kupo!"},{"name":"MOGGA","text":"I think we scared all the dragons away, kupo!"},{"name":"MOGLEO","text":"I'll be okay...but I should lie down for a bit, kupo..."},{"name":"MOGKUL","text":"Mogok and Mogga have given me their reports! Adventurer, tell me what you saw while patrolling through Zenith, kupo!"},{"name":"MOGKUL","text":"Hmmm... As I thought, Nidhogg's minions were already in Zenith. But if their aim was to destroy it, then why haven't they done anything more? Were they just here to attack us?"},{"name":"MOGLEO","text":"Mogkul, why do these dragons wish to destroy Zenith, kupo?"},{"name":"MOGKUL","text":"Ah, Mogleo, you've just joined the Pomguard, so we haven't had time to tell you the whole story."},{"name":"MOGKUL","text":"A thousand years ago, when the skylords and landlords lived together in peace, they built this palace to stand as a symbol of their friendship."},{"name":"MOGKUL","text":"But as you know, war broke out between them, and Nidhogg and his servants wrought destruction upon the landlords. Of the structures that the landlords built, only this palace, so loved by the great wyrm Hraesvelgr, remains."},{"name":"MOGLEO","text":"A symbol of friendship... If they can't bring down the whole tower, they must mean to destroy its most symbolic part, kupo!"},{"name":"MOGKUL","text":"Its most symbolic part...that couldn't mean..."},{"name":"MOGKUL","text":"Oh no, kupopo! They mean to destroy the spire!"},{"name":"MOGKUL","text":"The spire is right above us. Mogok, Mogga─the two of you come with me! Mogleo, you still need rest. Remain here, and stay out of sight of errant dragons, kupo!"},{"name":"MOGLEO","text":"W-Wait! Oh, I feel so useless, kupo!"},{"name":"MOGLEO","text":"Well, <span class=\"emphasis\">I</span> may not be able to help, but <span class=\"emphasis\">you're</span> here, kupo! You must help the others in my stead! Follow them and protect the spire, kupo!"},{"name":"MOGLEO","text":"Please help the others! Don't let the dragons bespoil Zenith, kupo!"},{"name":"MOGKUL","text":"We...we didn't stand a chance, kupo..."},{"name":"MOGOK","text":"Too...strong...kupo..."},{"name":"MOGGA","text":"I'm too pretty to die, kupo..."},{"name":"DEATHGAZEDRAGON01868","text":"Ah, so you've brought a member of mankind to fight alongside you? You have done well to survive the attacks of my minions."},{"name":"DEATHGAZEDRAGON01868","text":"But where they failed, I shall succeed. Your corpses will fill my belly as the last remnants of mankind burn before me!"},{"name":"MOGLEO","text":"I knew you would make it back, kupo! Next time, my own strength will not falter."},{"name":"MOGOK","text":"I've never faced a dragon so strong... Thank the heavens you were with us, adventurer!"},{"name":"MOGGA","text":"I made it through with naught but a crooked pom. And it's all thanks to you, kupo!"},{"name":"MOGKUL","text":"Such a dreadful dragon─but you gave it the thrashing of a lifetime! Their plan lies in a shambles, and Zenith stands proud, kupo!"},{"name":"MOGGA","text":"Zenith is safe! Those dragons'll think twice before coming here again, kupo!"},{"name":"MOGGA","text":"At last, we can finally rest our wings. We've barely had time to stop and look at what we're protecting, but now that we do... Is there a sight as breathtaking, kupo?"},{"name":"MOGKUL","text":"Aye, its beauty is unrivaled. Alas, time has not been kind to it..."},{"name":"MOGGA","text":"Every day, the cracks run longer and more bricks come loose. And there's little we can do to stay the ravages of time. I often wonder if Hraesvelgr is saddened by the sight, kupo."},{"name":"MOGOK","text":"It is not for us to know the great wyrm's feelings. What matters is that we honor the covenant and continue keeping Zenith clean and safe."},{"name":"MOGKUL","text":"Yes, the covenant our ancestors formed with the great wyrm Hraesvelgr."},{"name":"MOGKUL","text":"We protect his precious memories, and in return, he protects us."},{"name":"MOGKUL","text":"The great Hraesvelgr has suffered the sting of betrayal once already, and we shall not be the ones to betray him again. Until the day clouds of sorrow blot the skies no longer, we shall remain true to him."},{"name":"MOGKUL","text":"Oh, kupopo! Are you crying, adventurer? Our apologies─we didn't mean to get so sentimental."},{"name":"MOGKUL","text":"Worry not, this isn't a time for sadness! Cheer up, because thanks to you, the Pomguard has the courage to be even better, kupo!"},{"name":"MOGKUL","text":"We'll patrol Zenith one more time to make sure no more nasty dragons are lurking about. Pray return to Moghome and tell Captain Mogloo of our valiant deeds here!"},{"name":"MOGLEO","text":"The spire is safe, and the Pomguard unharmed!? Thank you, adventurer!"},{"name":"MOGLOO","text":"...A fearsome dragon at Zenith!? I dread to think what might have happened had you not been on hand. My thanks for your aid, adventurer!"},{"name":"MOGLOO","text":"It is as Mogok says. Come what may, we will continue to honor the sacred covenant with Hraesvelgr, kupo."},{"name":"MOGLOO","text":"Would that we could do more. Had we but the knowledge, we would restore Zenith to its former glory."},{"name":"MOGLOO","text":"But we haven't, and it avails us naught to dwell on what we cannot do. Nay, we must focus our energies on what we <span class=\"emphasis\">can</span> do─that is, protecting Zenith. My moogles have performed their duty most admirably this day, and they shall be rewarded─with kupo nuts!"}],"reward":{"gil":612,"items":[{"id":5677,"one":1},{"id":5672,"one":1},{"id":5667,"one":1}],"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67402]},"next":[67408]},"partials":[{"type":"npc","id":"1014300","obj":{"i":1014300,"n":"Mogkul","l":2002,"q":3}},{"type":"npc","id":"1012082","obj":{"i":1012082,"n":"Mogloo","l":2002,"q":4}},{"type":"npc","id":"1014301","obj":{"i":1014301,"n":"Mogok","l":2002,"q":3}},{"type":"npc","id":"1014302","obj":{"i":1014302,"n":"Mogga","l":2002,"q":3}},{"type":"npc","id":"1014309","obj":{"i":1014309,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014310","obj":{"i":1014310,"n":"Ancient Vouivre","l":2002,"q":1}},{"type":"npc","id":"1014311","obj":{"i":1014311,"n":"Mogkul","l":2002,"q":1}},{"type":"npc","id":"1014312","obj":{"i":1014312,"n":"Mogok","l":2002,"q":1}},{"type":"npc","id":"1014313","obj":{"i":1014313,"n":"Mogga","l":2002,"q":1}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67402","obj":{"i":67402,"n":"An Uneasy Feeling","g":100,"l":"The Churning Mists","s":5531}},{"type":"quest","id":"67408","obj":{"i":67408,"n":"Into the Mists","g":96,"l":"Ishgard","s":5605}}]}