{"quest":{"name":"Save the Pomguard","location":"The Churning Mists","id":67400,"patch":3.0,"sort":5529,"icon":100478,"eventIcon":71221,"issuer":1014293,"target":1014300,"involved":[1014294,1014296,1014297,1014298,1014301,1014302],"genre":100,"journal":["Mogkul is ready to set off towards Zenith with an adventurer in tow.","Mogkul is eager to set off towards Zenith, for the minions of Nidhogg could decide to intrude upon the sacred palace at any moment. Head towards Zenith and rendezvous with Mogkul to see what he has in mind for you.","As you arrive to speak with Mogkul, a dastardly dragon sticks his snout into your conversation. Mogkul is confident that he and Mogok can handle the threat, and instructs you to head north and meet with Mogga, who may have run into dragon-related trouble herself. Search for Mogga and slay any dragons that interfere with your business.","Mogga is fighting─or fleeing─for her life against a dragon when you come upon her, and you barely manage to come to her rescue in time. The moogle still appears flustered─make sure she has come to no harm.","Mogga is grateful that you saved her from the clutches of certain death, and hurries back to Zenith to make sure the other Pomguard moogles are safe. Return to the sacred tower and speak with Mogkul for his read on the situation.","It seems Mogkul and Mogok had no trouble dispatching the dragon that was troubling them, but bids you to come with them to Zenith to avoid any more rude interruptions. Speak with Mogkul again once you are within the safety of Zenith.","The nefarious dragons of Nidhogg's brood have only recently begun to come near Zenith, a place sacred to the great wyrm Hraesvelgr. Mogkul fears that the dragons intend to tear down the monument in a brazen show of disrespect to the moogles' protector."],"objectives":["Speak with Mogkul.","Search for Mogga and slay any enemies that appear.","Speak with Mogga.","Speak with Mogkul.","Speak with Mogkul again."],"dialogue":[{"name":"MOGKUL","text":"Before Nidhogg's awakening, his minions didn't dare come near Zenith for fear of Hraesvelgr's holy wrath. But, more and more skylords have been sighted within yalms of the holy palace, generally causing all kinds of dreadful disruptions, kupo!"},{"name":"MOGKUL","text":"Why, they could be creeping into Zenith as we speak! That's why I require your assistance in our patrols. Let us hurry to Zenith, and drive away those brutish dragons!"},{"name":"MOGOK","text":"This dragon doesn't look so tough, kupo! Help Mogga before she comes to harm!"},{"name":"MOGKUL","text":"The dragons are everywhere, kupo! Worry not, we shall take care of this cretin."},{"name":"MOGKUL","text":"Adventurer, hurry and find Mogga, who should be patrolling to the north of here. She could be in trouble, kupo!"},{"name":"MOGKUL","text":"Hurry, to the north! Who knows what trouble Mogga has gotten herself into, kupo."},{"name":"MOGGA","text":"A d-dragon, kupo! Someone help!"},{"name":"MOGGA","text":"I thought I was done for, kupo... Thank heavens you were here to save me! The others may need our help, let's hurry back to Zenith!"},{"name":"MOGOK","text":"That dragon was nothing to the likes of the Pomguard, kupo!"},{"name":"MOGGA","text":"Thanks to you, adventurer, I live to fight another day, kupo!"},{"name":"MOGKUL","text":"Mogga told me of your bravery, kupo! Thanks to you─and us─Zenith is now free of the evil dragons! And what's more, not a hair on a moogle's pom-pom was harmed, kupo!"},{"name":"MOGKUL","text":"Zenith is one of this area's most magnificent monuments, and we can't have those disrespectful dragons coming in and mucking things about, kupo!"},{"name":"MOGKUL","text":"Now that the dragons have been dispatched, we shall return to Zenith to discuss the next step. Follow us, adventurer!"},{"name":"MOGOK","text":"Zenith is vast, kupo... How're we supposed to clean <span class=\"emphasis\">and</span> protect it?"},{"name":"MOGGA","text":"Those dragons have really made a mess of this place. It looks so neglected..."},{"name":"MOGKUL","text":"Zenith is a place of quiet sanctuary for Hraesvelgr, and none can be allowed to disturb it."},{"name":"MOGKUL","text":"This is the first time the brood of Nidhogg have dared to come so close..."},{"name":"MOGKUL","text":"I fear they may intend the worst─they mean to demolish Zenith!"}],"reward":{"gil":612,"xp":33600},"reqs":{"jobs":[{"lvl":55,"id":34}],"questsType":"all","quests":[67171,67399]},"next":[67401]},"partials":[{"type":"npc","id":"1014293","obj":{"i":1014293,"n":"Mogkul","l":2002,"q":2}},{"type":"npc","id":"1014300","obj":{"i":1014300,"n":"Mogkul","l":2002,"q":3}},{"type":"npc","id":"1014294","obj":{"i":1014294,"n":"Mogkul","l":2002,"q":1}},{"type":"npc","id":"1014296","obj":{"i":1014296,"n":"Mogok","l":2002,"q":1}},{"type":"npc","id":"1014297","obj":{"i":1014297,"n":"Mogga","l":2002,"q":1}},{"type":"npc","id":"1014298","obj":{"i":1014298,"n":"Mogga","l":2002,"q":1}},{"type":"npc","id":"1014301","obj":{"i":1014301,"n":"Mogok","l":2002,"q":3}},{"type":"npc","id":"1014302","obj":{"i":1014302,"n":"Mogga","l":2002,"q":3}},{"type":"quest","id":"67171","obj":{"i":67171,"n":"The Song Begins","g":3,"l":"The Churning Mists","s":56}},{"type":"quest","id":"67399","obj":{"i":67399,"n":"Protecting the Pom","g":100,"l":"The Churning Mists","s":5528}},{"type":"quest","id":"67401","obj":{"i":67401,"n":"An Urgent Message","g":100,"l":"The Churning Mists","s":5530}}]}