{"quest":{"name":"Laying the First Brick","location":"The Churning Mists","id":67407,"patch":3.0,"sort":5611,"icon":100480,"eventIcon":71221,"issuer":1013560,"target":1014314,"involved":[1012077,1012163,1013561,1013569,1014315,1014321],"genre":100,"journal":["Maenne has one last request for you before she returns to Ishgard.","With her mission complete, Maenne makes preparations to return to Ishgard, but not before requesting one more thing of you. She asks that you deliver the sealed crate containing the aetherometers as well as the observation log from the northeast scout to Commander Handeloup at the Congregation. Your first task is simple: obtain the sealed crate not far from where Maenne is.","The sealed crate is heavier than it looks, but you manage to collect it nonetheless. Proceed with the second part of Maenne's request and obtain the observation report from the scout to the northeast.","You arrive to where the scout is posted to find out that he has already written the report of his observations. However, he will remain behind with the rest of the scouts to continue their work until Maenne calls for them. Return to the Congregation and give Commander Handeloup the items you have collected.","Handeloup is pleased that the survey was completed without any major incidents, but expresses concern that transformed heretics still exist. It seems that he wants to learn more of the history and environment of the Churning Mists, so that more light can be shed on the time when dragons and mankind purportedly lived together. He asks that you act as an intermediary and use your relationship with the moogles to convince them to hear out his request. Speak with Moglin to see if he would be inclined to help the curious Ishgardians.","Moglin seems willing to teach the knights from Ishgard of the history of his land, on one condition: the war between mankind and dragonkind must come to an end. He sends members of the Pomguard to meet Ser Handeloup, and bids you follow them as well. Speak with Mogkul of the Pomguard once you reach the party at the Rookery.","You meet Ser Handeloup, Maenne, and the moogles of the Pomguard, and after a short conversation they come to an amicable agreement. Ser Handeloup will do what he can to convince the Holy See to send carpenters and stonemasons to teach the moogles how to mend the stone structures of Zenith with their own paws. In return, the moogles will share what they know about the Churning Mists. With this, mankind and mooglekind will work together and attempt to repair the damage of the past and rebuild what has been lost."],"objectives":["Obtain the sealed crate.","Obtain the observation log from the northeast scout.","Deliver the sealed crate and observation log to Ser Handeloup at the Congregation.","Speak with Moglin at Moghome.","Speak with Mogkul."],"dialogue":[{"name":"AIRPORTINVESTIGATOR01871","text":"The time has come for us to prepare for our journey home. You have our thanks, adventurer. Without you we would not have been able to obtain such thorough measurements."},{"name":"MAENNE","text":"Well, it seems we've completed surveys of all the ancient battlefields, thanks to you. However, I have one last request to burden you with..."},{"name":"MAENNE","text":"I would ask that you deliver two things to Ser Handeloup at the Congregation.  "},{"name":"MAENNE","text":"Firstly, I would have you deliver the sealed crate containing the aetherometers. Secondly, I ask that you retrieve the observation log from the scout to the northeast. "},{"name":"MAENNE","text":"I shall inform my scouts at each location that our mission is complete, then we shall return to Ishgard together. Once again, you have my thanks─we would not have been able to finish our mission without you."},{"name":"MAENNE","text":"We shall return to Ishgard once my scouts have safely returned. We shall not forget your selfless contributions."},{"name":"REMAINSINVESTIGATOR01871","text":"I've received word from Ser Maenne, and have written down detailed information of my observations. Pray bring it to Ser Handeloup at the Congregation."},{"name":"REMAINSINVESTIGATOR01871","text":"The other scouts and I will remain behind at this post and continue with our work until Maenne calls for us. Give Ser Handeloup our regards, adventurer."},{"name":"REMAINSINVESTIGATOR01871","text":"The scouts here will remain behind to continue our survey. I hope Ser Handeloup can glean some useful information from our reports. "},{"name":"HANDELOUP","text":"Ah, <span class=\"highlight\">Forename</span>, it seems the operation at the Churning Mists was a success. What exactly did our scouts discover?"},{"name":"HANDELOUP","text":"Ah, these aetherometers and the observation log will prove invaluable. However, this news that Maenne was attacked by a heretic-turned-dragon is troubling."},{"name":"HANDELOUP","text":"I've been mulling over the information you and Estinien have brought to light. To think that at one time dragonkind and mankind once coexisted. Yet now we must contend with dragons born of heretics in this never-ceasing conflict."},{"name":"HANDELOUP","text":"It is much too early to say if the news of our once-peaceful past should be given credence, but it would be foolish to reject it outright."},{"name":"HANDELOUP","text":"The best course of action would be to become more familiar with the history of the Churning Mists. It is only through knowledge that we can decide our next step."},{"name":"HANDELOUP","text":"Estinien's report contained detailed information on the moogles that inhabit that area. Mayhap they would prove to be an invaluable resource for us."},{"name":"HANDELOUP","text":"<span class=\"highlight\">Forename</span>, it seems you've developed a bit of a relationship with them, have you not? I apologize for asking another favor of you so soon after you've returned, but I would be grateful if you could help us strike up our own relationship with them."},{"name":"HANDELOUP","text":"You have my thanks. I shall personally accompany you to ensure that this meeting goes favorably, and to show the moogles my proper respects. We shall depart shortly. <span class=\"highlight\">Forename</span>, I shall see you at our destination."},{"name":"HANDELOUP","text":"Let us meet again at the Churning Mists!"},{"name":"MOGLIN","text":"Ah, <span class=\"highlight\">Forename</span>, I see you still haven't chosen a proper moogle name, kupo. What would you ask of me today?"},{"name":"MOGLIN","text":"There are those from the surface that wish to know the history of this land? Very well, if you vouch for them, I see no reason to refuse their request."},{"name":"MOGLIN","text":"However, I would ask one thing of you in return. The moogles wish to live in peace, and we can't do that if war rages across the land, kupo."},{"name":"MOGLIN","text":"As long as our desires are understood, I'd like nothing more than to meet these new friends. Now, where can we find this Ser Handeloup?"},{"name":"MOGLIN","text":"Excellent, kupo! I shall dispatch members of the Pomguard to escort him at once. <span class=\"highlight\">Forename</span>, please go along with them─they may be shy around so many new visitors from the surface, kupo."},{"name":"MOGLIN","text":"Members of the Pomguard will depart to Ser Handeloup's position shortly. They're quite shy around those from the surface─pray accompany them, kupo."},{"name":"MAENNE","text":"So that's a moogle? I've never seen something so...cute..."},{"name":"MOGLEO","text":"There are so many people from the surface, kupo! I'm...I'm a little nervous..."},{"name":"HANDELOUP","text":"Ah, <span class=\"highlight\">Forename</span>, it seems you were able to arrange a meeting after all. You have my thanks."},{"name":"MOGKUL","text":"W-Welcome to the Churning Mists, kupo! Moglin has told us about you─it's our pleasure to guide you to Moghome!"},{"name":"HANDELOUP","text":"Ah, where are my manners? I am Commander Handeloup, of the Temple Knights. We are honored to receive your guidance."},{"name":"HANDELOUP","text":"Furthermore, we appreciate your willingness to impart on us your knowledge of the Churning Mists. If there is aught you would require in return, we would gladly repay your kindness."},{"name":"MOGLEO","text":"Ser Handeloup, you come from a large city on the surface, yes? You might have exactly the knowledge we need, kupo!"},{"name":"MOGLEO","text":"We've long yearned to learn how to repair stone structures. If we did, we could repair Zenith with our own paws!"},{"name":"MOGLEO","text":"Us moogles have a sacred agreement with the great wyrm Hraesvelgr that binds us to protect the holy tower. But, after a thousand years, time has worn its luster."},{"name":"MOGLEO","text":"Zenith is beloved by Hraesvelgr, and stands as a symbol of the friendship between the landlords and skylords. If we could restore its former glory, maybe the bond between your two races would be revitalized as well."},{"name":"HANDELOUP","text":"Indeed, the Holy See's knowledge of stone-working is vast... Very well, although the road ahead of me may be difficult, I will do all within my power to convince the Holy See to send stonemasons and carpenters to do what they can."},{"name":"MOGKUL","text":"You are too kind, kupo! However, there's one more thing I must ask of you..."},{"name":"MOGKUL","text":"It may be too soon to allow so many people from the surface into Hraesvelgr's beloved tower. It could...unnerve him."},{"name":"MOGKUL","text":"For now, we would ask that you teach us what you can at Moghome. And then, we can use our own paws to repair Zenith."},{"name":"MOGKUL","text":"It may start with us repairing but a single brick, but if we keep at it, soon Zenith will sparkle as it hasn't in a millennium, kupo!"},{"name":"HANDELOUP","text":"I understand the moogles' concern. I know all too well that a thousand years of animosity cannot be forgotten overnight. Let us work with diligence, and brick by brick we shall rebuild that which has been lost."},{"name":"MOGLEO","text":"I'm glad we've come to an agreement, kupo! Now let us be off to Moghome─there's so much to share with you!"}],"reward":{"gil":1501,"items":[{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67416]},"next":[67856]},"partials":[{"type":"npc","id":"1013560","obj":{"i":1013560,"n":"Maenne","l":2002,"q":7}},{"type":"npc","id":"1014314","obj":{"i":1014314,"n":"Mogkul","l":2002,"q":1}},{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1013561","obj":{"i":1013561,"n":"Scouting Party Dragoon","l":2002,"q":7}},{"type":"npc","id":"1013569","obj":{"i":1013569,"n":"Northeastern Scouting Party Dragoon","l":2002,"q":3}},{"type":"npc","id":"1014315","obj":{"i":1014315,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014321","obj":{"i":1014321,"n":"Handeloup","l":2002,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67416","obj":{"i":67416,"n":"Thar Be Dragons","g":100,"l":"The Churning Mists","s":5610}},{"type":"quest","id":"67856","obj":{"i":67856,"n":"Tricks and Stones","g":48,"l":"The Churning Mists","s":1,"f":1}}]}