{"quest":{"name":"Keeping the Ledger","location":"Ishgard","id":67405,"patch":3.0,"sort":1,"eventIcon":71221,"issuer":1012181,"target":1012181,"involved":[1012262,1012263,1012264,1012265],"genre":78,"journal":["Mathye has the look of a man who has lost everything.","Mathye received an order from Saint Endalim's Scholasticate, his most esteemed client, but has lost record of what they requested. All he can recall is they are missing a volume from the <span class=\"emphasis\">Seventy-two Articles of Halonic Polity</span>. He asks that you go to the scholasticate and ask around to figure out which volume they require.","You arrive at the scholasticate and have a look around. You find a shelf listing volumes one through nine, but volumes four and six seem to be missing. Looking on another shelf you find volume six. You also notice volume ten lying on one of the tables. A young seminarian named Theomocent tells you he is studying volumes twelve and thirteen, while Archombadin tells you of his work with volume fourteen in a condescending tone. The student standing outside, Leigh, tells you he borrowed a volume from the scholasticate, but he has forgotten which one. After speaking with Janchette, however, you learn that Leigh has borrowed volume four but is too busy to study its contents. Report to Mathye and tell him what you have learned.","Your astute observations reveal that the scholasticate is lacking for volume eleven. Thanks to your keen eye, Mathye can go on to sell his wares another day. "],"objectives":["Search for the <span class=\"emphasis\">Seventy-two Articles</span> in the scholasticate.","Speak with the seminarians.","Speak with Leigh.","Report to Mathye."],"dialogue":[{"name":"MATHYE","text":"Good day to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. How may I help you? Oh, you wish to help <span class=\"emphasis\">me</span>? Well, your timing couldn't be better. It would seem I have misplaced the record of sales for my most esteemed client: Saint Endalim's Scholasticate."},{"name":"MATHYE","text":"Said client has requested another volume from the <span class=\"emphasis\">Seventy-two Articles of Halonic Polity</span>. There are fourteen in total, and try as I might, I cannot recall which one they specified."},{"name":"MATHYE","text":"Surely you can imagine how embarrassing it would be were I to ask them again myself, and they to learn the reason why. That's why I need you to go in my stead. No need for overt inquiries, mind. Just make small talk and surreptitiously examine the shelves to see what might be missing."},{"name":"MATHYE","text":"The last thing I need is to tell clients I've forgotten their order. Please go to the scholasticate and find out which volume is missing."},{"name":"SYSTEM","text":"You find a listing for volumes one through nine on the shelf. However, volumes four and six appear to be missing."},{"name":"SYSTEM","text":"You find volume six on the shelf."},{"name":"SYSTEM","text":"You find volume ten lying on the table."},{"name":"THEOMOCENT","text":"Oh, pardon me. The <span class=\"emphasis\">Seventy-two Articles</span>? Why, yes, I've been poring over volumes twelve and thirteen."},{"name":"THEOMOCENT","text":"The subject matter is quite dense─hardly something that could be handled in a single sitting. If you have need, I could bear to part with them for a short while."},{"name":"THEOMOCENT","text":"No? I see... In that case, I shall continue my studies."},{"name":"THEOMOCENT","text":"The subject matter of volumes twelve and thirteen is quite perplexing. But to become a clergyman requires diligence and great sacrifice."},{"name":"ARCHOMBADIN","text":"Hah! A lowborn stumbles into the scholasticate and thinks <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> qualified to study Orthodox doctrine. How droll."},{"name":"ARCHOMBADIN","text":"Our facilities are reserved for those who have <span class=\"emphasis\">potential</span>, like myself. I'll have you know that I'm working through the final volume of the <span class=\"emphasis\">Seventy-two Articles</span>."},{"name":"ARCHOMBADIN","text":"A simpleton like you could spend a lifetime in study and fail to comprehend a single word, I expect. But don't let me dissuade you. Start with volume one and mull over the first few pages for a year or so."},{"name":"ARCHOMBADIN","text":"For the last time, I'm reading through the <span class=\"emphasis\">fourteenth</span> volume. You <span class=\"emphasis\">can</span> count, can't you?"},{"name":"ARCHOMBADIN","text":"&lt;sigh&gt; I will never understand why they let you people in here."},{"name":"JANCHETTE","text":"You are studying the <span class=\"emphasis\">Seventy-two Articles</span> as well? &lt;sigh&gt; I suppose that makes one of us. I require volume four, but it has yet to be returned. It outlines the canon laws of the Ishgard Orthodoxy."},{"name":"JANCHETTE","text":"In truth, these books are all rather dense, especially after the eleventh volume. You must memorize the teachings of the fourth to set a foundation for everything that follows."},{"name":"JANCHETTE","text":"Leigh was the last to borrow it as far as I know, but he's been so busy of late. Something about helping children being bullied. If he is truly so busy, I wish he would at least return the book to us."},{"name":"JANCHETTE","text":"I believe Leigh still has the fourth volume. If I had known he would keep it for so long, I would have skipped ahead in my studies to pore over it."},{"name":"LEIGH","text":"The <span class=\"emphasis\">Seventy-two Articles</span>...? Ah, I do recall borrowing a volume─which one I cannot say. Would that I had time to read it."},{"name":"LEIGH","text":"Truth be told, my so-called schoolmates have kept me rather preoccupied of late. Not a day goes by without them pulling some childish prank on my dear friend Theomocent. Well, they try at least. I do what I can to see their plans come to naught."},{"name":"LEIGH","text":"&lt;sigh&gt; To know they will move on to become clergymen, or even prelates... We live in a truly unjust world."},{"name":"LEIGH","text":"Hm? Yes, I borrowed a volume of the <span class=\"emphasis\">Seventy-two Articles</span>, though I cannot remember which."},{"name":"MATHYE","text":"Back from the scholasticate? Good. So, which volume are they missing?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I think it's volume one."},{"name":"A1","text":"It might be volume four."},{"name":"A1","text":"It could have been volume six."},{"name":"A1","text":"I'm positive it's volume eight."},{"name":"A1","text":"It has to be volume eleven!"},{"name":"A1","text":"Volume thirteen is the one you need."},{"name":"A1","text":"I didn't see volume fourteen anywhere."},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"MATHYE","text":"Hmmm... No, I'm fairly certain they have a copy of that volume."},{"name":"SYSTEM","text":"You seem to have forgotten the missing volume number. Review your quest progression in the journal, then speak with Mathye again."},{"name":"MATHYE","text":"Ah, volume eleven! Yes, that's it, I remember now! Phew, my business and reputation are safe thanks to you."},{"name":"MATHYE","text":"As I'm sure you can imagine, falling out of their good graces would bode ill for business. The scholasticate is the cornerstone of education within the church, and all members of the clergy must pass through its doors."},{"name":"MATHYE","text":"With but a word from the headmistress I could lose everything I own, or worse..."},{"name":"MATHYE","text":"But thanks to you, <span class=\"alternative-container\"><span class=\"alternative\">my dear madam</span><span class=\"alternative\">my good sir</span></span>, my business is safe. You've helped me more than you'll ever know."}],"reward":{"gil":465,"items":[{"id":10673,"one":1,"hq":1},{"id":10715,"one":1,"hq":1},{"id":10757,"one":1,"hq":1},{"id":10841,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"quests":[67173]},"next":[67688]},"partials":[{"type":"npc","id":"1012181","obj":{"i":1012181,"n":"Mathye","l":2301,"q":6}},{"type":"npc","id":"1012262","obj":{"i":1012262,"n":"Theomocent","l":2337,"q":1}},{"type":"npc","id":"1012263","obj":{"i":1012263,"n":"Leigh","l":2301,"q":1}},{"type":"npc","id":"1012264","obj":{"i":1012264,"n":"Janchette","l":2337,"q":1}},{"type":"npc","id":"1012265","obj":{"i":1012265,"n":"Archombadin","l":2337,"q":1}},{"type":"item","id":"10673","obj":{"i":10673,"n":"Titanium Helm of Fending","l":139,"c":40217,"t":34,"p":24272}},{"type":"item","id":"10715","obj":{"i":10715,"n":"Titanium Mask of Maiming","l":139,"c":40456,"t":34,"p":20805}},{"type":"item","id":"10757","obj":{"i":10757,"n":"Titanium Headgear of Striking","l":139,"c":40457,"t":34,"p":20805}},{"type":"item","id":"10841","obj":{"i":10841,"n":"Titanium Headgear of Scouting","l":139,"c":40458,"t":34,"p":20805}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67688","obj":{"i":67688,"n":"Contradicting Convictions","g":78,"l":"Ishgard","s":10}}]}