{"quest":{"name":"Bitter Is the Night","location":"The Churning Mists","id":67414,"patch":3.0,"sort":5604,"icon":100479,"eventIcon":71221,"issuer":1013560,"target":1013560,"involved":[1013561],"genre":100,"journal":["Maenne can't shake the feeling of being watched.","Maenne has felt an unfriendly gaze on her scouting party since the moment of her arrival, and fears that the dragons may be planning an ambush. She bids you investigate the area for any enemies while the dragoons remain at their posts. ","You find several dragons lying in wait to catch the dragoons unaware, but you dispatch them quickly. Report back to Maenne so she may plan the next step in the scouting mission.","Maenne seems unsurprised that her suspicions were confirmed, but wonders how the dragons came to be aware of the dragoons' movements. This scouting mission may prove to be more dangerous than initially thought."],"objectives":["Investigate the designated areas and slay any enemies that appear.","Report to Maenne."],"dialogue":[{"name":"AIRPORTINVESTIGATOR01871","text":"To think the Churning Mists held such breathtaking architecture... But time and neglect have taken their toll."},{"name":"MAENNE","text":"I've felt ill at ease since our arrival, as if something has been watching us..."},{"name":"MAENNE","text":"'Twould be best for us to remain here in case any dragons should lie in ambush, lest we alert them to our suspicions. <span class=\"highlight\">Forename</span>, pray investigate the area for any signs of dragons lurking in the shadows."},{"name":"MAENNE","text":"'Twould be a terrible start to walk right into an ambush on our first foray. Pray investigate the area before we venture any further."},{"name":"BALOON","text":"Die, mortal!"},{"name":"MAENNE","text":"...As I thought, the dragons tried to take us unawares. We used the cover of the clouds to escape the Horde's wrath in the skies, but it seems the dragons here have somehow caught wind of our arrival."},{"name":"MAENNE","text":"Nevertheless, we cannot waver now simply because danger may lie ahead. We shall proceed with the scouting as planned. <span class=\"highlight\">Forename</span>, pray ready yourself─this mission may prove to be more difficult than we anticipated."}],"reward":{"gil":496,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67408]},"next":[67417]},"partials":[{"type":"npc","id":"1013560","obj":{"i":1013560,"n":"Maenne","l":2002,"q":7}},{"type":"npc","id":"1013561","obj":{"i":1013561,"n":"Scouting Party Dragoon","l":2002,"q":7}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67408","obj":{"i":67408,"n":"Into the Mists","g":96,"l":"Ishgard","s":5605}},{"type":"quest","id":"67417","obj":{"i":67417,"n":"Cleaning House","g":100,"l":"The Churning Mists","s":5605}}]}