{"quest":{"name":"No Nests Allowed","location":"The Churning Mists","id":67413,"patch":3.0,"sort":5603,"eventIcon":71221,"issuer":1012286,"target":1012286,"genre":100,"journal":["Mogoon has a worried expression on his face.","Mogoon tells you that the migrating anzu have taken to building nests near the Lost Landlord. Help him to remove the nests before the anzu reproduce and throw the area into noisy chaos.","The nests have been removed. Report back to Mogoon with the good news.","Mogoon is joyed that you have delivered the nests to him. A simple beast like an anzu could never hope to appreciate the beauty and sanctity of the area's sacred statues."],"objectives":["Remove the anzu nests.","Deliver the nests to Mogoon."],"dialogue":[{"name":"MOGOON","text":"Adventurer! It seems the migrating anzu didn't stop by the holy waters just for a drink─they've built nests all around the statue, kupo! Could you imagine how noisy it'd be with even more anzu flying around, kupo?"},{"name":"MOGOON","text":"I need you to remove the nests before a flock of noisy newborn anzu keeps me from ever praying again, kupo! Please, hurry!"},{"name":"MOGOON","text":"The anzu have set up nests all around the Lost Landlord statue. Get rid of them before we have baby anzu squawking everywhere, kupo!"},{"name":"MOGOON","text":"I sighted several nests placed around Greensward─were you able to rid the area of their presence?"},{"name":"MOGOON","text":"...There were this many nests? And there were already eggs, kupopo!? If you hadn't removed the nests when you did... Many thanks for your help!"},{"name":"MOGOON","text":"Finally the anzu problem has been taken care of. If only the simpleminded anzu could understand the sanctity of this area's sacred statues. Maybe one day, through my tireless devotion, I'll be able to make even such brutes understand their beauty, kupo!"}],"reward":{"gil":465,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67412]}},"partials":[{"type":"npc","id":"1012286","obj":{"i":1012286,"n":"Mogoon","l":2002,"q":3}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67412","obj":{"i":67412,"n":"Spring Cleaning","g":100,"l":"The Churning Mists","s":5602}}]}