{"quest":{"name":"Honoring the Past","location":"Ishgard","id":67410,"patch":3.0,"sort":5603,"unlocksFunction":1,"eventIcon":71341,"issuer":1014720,"target":1011952,"involved":[1012055],"genre":96,"journal":["This Haillenarte knight is in mourning.","A memorial service was recently held to honor Ser Chlodebaimt, third son of House Haillenarte. Though no one expected Camp Cloudtop's Rose Knights to abandon their duties for the ceremony, the Haillenarte knight was surprised to find not a single one in attendance. He would not dare question Lady Laniaitte, but his good friend Rontremont worked closely with Ser Chlodebaimt, and he is certain he would have attended if time allowed. That is why the Haillenarte knight wishes to offer him the battle standard raised during the ceremony as a memento. Deliver the battle standard to Rontremont at Camp Cloudtop.","Upon seeing the battle standard, Rontremont is reminded of the terrible battle at the Steel Vigil shortly after the Calamity. He tells you of how Ser Chlodebaimt gave his life for his men, and that he was an exemplary leader. Despite his close relations with Ser Chlodebaimt, however, he feels there is another more deserving of that tattered memento─Lady Laniaitte, sister to Ser Chlodebaimt.","Lady Laniaitte welcomes you with a warm greeting, but quickly turns sullen at the sight of the battle standard. She recalls that her brother was a great man, well loved by his men, and their readiness to seek vengeance for his passing. But rather than dwell on the pain of the past, she believes it best to live her own life and strive for a better future."],"objectives":["Deliver the battle standard to Rontremont.","Deliver the battle standard to Laniaitte."],"dialogue":[{"name":"HAILLENARTESOLDIER01874","text":"We recently held a ceremony to honor the passing of Ser Chlodebaimt, third son of House Haillenarte."},{"name":"HAILLENARTESOLDIER01874","text":"But I was surprised to see none of the Rose Knights from Camp Cloudtop in attendance. Not that they should abandon the camp, mind you, but at the very least, I expected to see Rontremont or perhaps Lady Laniaitte in attendance."},{"name":"HAILLENARTESOLDIER01874","text":"I'm sure she has her reasons for not attending, but Rontremont is a dear friend of mine, and I know how he cared for Ser Chlodebaimt. They worked quite closely together for many years, down to the very end."},{"name":"HAILLENARTESOLDIER01874","text":"Which is why I want you to present this to him, the battle standard raised during the ceremony. I am certain he would have attended if he could, and at the very least, I should think he would appreciate a memento from the ceremony."},{"name":"HAILLENARTESOLDIER01874","text":"It's a shame he was unable to attend the ceremony. But at the very least, I feel he should have that battle standard."},{"name":"RONTREMONT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good day to you</span></span>, adventurer. What can I do for you?"},{"name":"RONTREMONT","text":"The battle standard of the Steel Vigil. Charred by flame just as I remember. Though there is much I wish I could not remember from that day..."},{"name":"RONTREMONT","text":"In the wake of the Calamity we were all but defenseless, and Svara and Safat saw fit to give us no quarter... I should hope to never again see a battle so bloody."},{"name":"RONTREMONT","text":"He laid down his life for our nation, for the few of us who escaped with our lives. A true leader to the bitter end, and I will always treasure the years spent under him. But I am not worthy of a memento such as this. Though she may be reluctant to accept it, Lady Laniaitte should be the one to have this."},{"name":"RONTREMONT","text":"I realize she has her own way to deal with grief, and I suspect that's why she did not attend the ceremony. But in all my years serving House Haillenarte, they have never been the sort to simply <span class=\"emphasis\">let go</span> of family. Please, friend, take the battle standard to her."},{"name":"RONTREMONT","text":"Losing a loved one is never easy. She may be cross with me later, but I believe it best that she keeps it."},{"name":"LANIAITTE","text":"Hello there, <span class=\"highlight\">Forename</span>. Is there something you need?"},{"name":"LANIAITTE","text":"...The battle standard from the Steel Vigil. You are too kind. This is a most unexpected gift."},{"name":"LANIAITTE","text":"Chlodebaimt was a good man, always ready to put his men's needs before his own. They were a family, and they mourned his loss like family. Though I wish they had not followed Francel's example."},{"name":"LANIAITTE","text":"He insisted on a post in central Coerthas, hoping to avenge him someday, and Chlodebaimt's men were quick to follow suit."},{"name":"LANIAITTE","text":"But I refuse to dwell on the past, grieving at gatherings year after year. It's not what he would have wanted. Nay, he would have me live my own life, and fulfill my own dreams."},{"name":"LANIAITTE","text":"His passing was a great loss to our house, but such hardships are not unfamiliar to us. Times are hard, but we will move forward. And in time, Ishgard will become the great nation he believed it could be, free of war."}],"reward":{"gil":732,"aetherCurrent":1,"items":[{"id":5677,"one":1},{"id":5672,"one":1},{"id":5667,"one":1},{"id":5632,"one":1}],"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"quests":[67173]},"next":[67435,67436,67437,67438,67439,67440]},"partials":[{"type":"npc","id":"1014720","obj":{"i":1014720,"n":"House Haillenarte Knight","l":2301,"q":1}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1012055","obj":{"i":1012055,"n":"Rontremont","l":2100,"q":3}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67435","obj":{"i":67435,"n":"Crying over Spilled Food","g":97,"l":"The Sea of Clouds","s":5601}},{"type":"quest","id":"67436","obj":{"i":67436,"n":"Beefing Up the Reserves","g":97,"l":"The Sea of Clouds","s":5603}},{"type":"quest","id":"67437","obj":{"i":67437,"n":"Search and Rescue","g":97,"l":"The Sea of Clouds","s":5605}},{"type":"quest","id":"67438","obj":{"i":67438,"n":"A Cropper's Duty","g":97,"l":"The Sea of Clouds","s":5606}},{"type":"quest","id":"67439","obj":{"i":67439,"n":"Hatching Ideas","g":97,"l":"The Sea of Clouds","s":5604}},{"type":"quest","id":"67440","obj":{"i":67440,"n":"A Tall Order to Fill","g":97,"l":"The Sea of Clouds","s":5602}}]}