{"quest":{"name":"Respecting the Sheave","location":"The Churning Mists","id":67411,"patch":3.0,"sort":5601,"eventIcon":71221,"issuer":1013529,"target":1012286,"genre":100,"journal":["Mogzun is eyeing a rusty sword with a satisfied grin on his face.","Mogzun has given you the exciting news that a moogle named Mogoon is giving away weapons that once belonged to the landlords. Visit the area near the Mother of the Sheave statue for more information on this exciting giveaway.","After speaking to Mogoon, you find out that his giveaway was a farce, meant only to get annoying visitors to go away so he can pay his respects in silence. However, moogles are not the only thing proving to be a nuisance. He asks you to slay three of the dragons in the area so that he might have the peace he desires.","You have slain the dragons, and the area becomes noticeably quieter. Return to Mogoon with news of your deed.","Mogoon is pleased that he can finally show his reverence to the Mother of the Sheave in silence. The statue is made in the image of Shiva when she fell in love with the great wyrm Hraesvelgr, so it should be treated with the utmost respect."],"objectives":["Speak with Mogoon.","Slay cloud aevis.","Report to Mogoon."],"dialogue":[{"name":"MOGZUN","text":"Oh, Comma─I mean adventurer! Over here! Even though the Mog Squad went their separate ways, I'd still like to thank you for everything you did for us. In fact, I'd like to repay you by sharing an interesting bit of recent news. Look here, kupo!"},{"name":"MOGZUN","text":"...That's right, it's a weapon of the fabled landlords! Mogoon was kind enough to give it to me─for free! If you want one for yourself, go visit him near the Mother of the Sheave statue!"},{"name":"MOGZUN","text":"Mogoon is just giving these away─how generous of him, kupo! If you want one for yourself, go talk to him near the Mother of the Sheave statue."},{"name":"MOGOON","text":"...Weapons from the landlords? Oh, that was just some old thing I picked up off of a dragon's corpse. That Mogzun is quite...<span class=\"emphasis\">enthusiastic</span>. I just gave him the weapon so I could have some peace and quiet."},{"name":"MOGOON","text":"The Mother of the Sheave statue, in my opinion, is one of the most serene places that was built by the landlords, but I prefer to show my reverence in silence. Lately, though, it's become more difficult to pray in quietude, kupo."},{"name":"MOGOON","text":"Since you're here, maybe you can help me attain the solitude I seek. The cries of the cloud aevis make silent contemplation difficult. If there were a few less of those beasts around, I might be able to show the Mother of the Sheave the respect she deserves, kupo."},{"name":"MOGZUN","text":"Mogoon has so many of these amazing tools! You'd better get some for yourself before he runs out of them, kupopo!"},{"name":"MOGOON","text":"Adventurer, please help me to show my devotion to the Mother of the Sheave statue. Slay the dragons stalking the area to silence their deafening roars, kupo."},{"name":"MOGZUN","text":"Did Mogoon give you a weapon, too? I can't believe he's just giving them away free of charge, kupo!"},{"name":"MOGOON","text":"Many thanks, adventurer─the statue grounds have become markedly more serene. This statue was carved in the image of Shiva, the beloved Mother of the Sheave. We must always protect it and keep the grounds safe."},{"name":"MOGOON","text":"The statue depicts the great wyrm Hraesvelgr's true love─he would surely want to preserve the statue as well, kupo."}],"reward":{"gil":596,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67390]},"next":[67412]},"partials":[{"type":"npc","id":"1013529","obj":{"i":1013529,"n":"Mogzun","l":2002,"q":2}},{"type":"npc","id":"1012286","obj":{"i":1012286,"n":"Mogoon","l":2002,"q":3}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67390","obj":{"i":67390,"n":"Walking the Walk","g":100,"l":"The Churning Mists","s":5520}},{"type":"quest","id":"67412","obj":{"i":67412,"n":"Spring Cleaning","g":100,"l":"The Churning Mists","s":5602}}]}