{"quest":{"name":"Personal Effects","location":"Coerthas Western Highlands","id":67426,"patch":3.0,"sort":5610,"icon":100469,"eventIcon":71221,"issuer":1014146,"target":1014146,"involved":[1014150],"genre":94,"journal":["Margyt needs your help again.","Margyt has been reviewing the report of the scout who survived the recent dragon attack. Judging by the fang you recovered from its body, the dragon you slew does not match the dragon in the report. Furthermore, many of the soldiers that reportedly fell to the dragon are still unaccounted for. Their bodies have likely been eaten by the beasts that inhabit the mountains. Kill the slate yetis near the site of the attack and recover evidence of the troops' demise, such that their families may have closure.","You recover several scraps of chainmail from the yetis at Red Rim. Judging by the state of the armor, it seems unlikely that the owners were alive when it was removed. Deliver it to Ayleth at Falcon's Nest so that it can be delivered to the Holy See.","You find Ayleth at Falcon's Nest. She seems frustrated by being assigned so petty a mission, but she assures you that the soldiers' effects that you found will be delivered to their families. Report back to Margyt at the Convictory.","Margyt thanks you for your work. Once Ayleth returns from Falcon's Nest, Margyt plans to review their tactics and techniques to improve their odds in future attacks on the Dravanian Horde."],"objectives":["Slay slate yetis and obtain personal effects.","Deliver the chainmail scraps to Ayleth at Falcon's Nest.","Report to Margyt."],"dialogue":[{"name":"MARGYT","text":"I've been examining the dragon fang you recovered. I'm quite sure that the beast you slew was not the one that attacked the scouting party. The survivor's report describes a dragon far too large to be the source of this fang."},{"name":"MARGYT","text":"And from how Ayleth's report describes it, several of the dead Convictors are unaccounted for."},{"name":"MARGYT","text":"The beasts in the mountains will make short work of unattended bodies. But we must do what we can to confirm these soldiers as deceased, for their families' sake."},{"name":"MARGYT","text":"Return to Red Rim and hunt down the nearby slate yetis. Try to find anything that we can identify as belonging to these fallen troops."},{"name":"MARGYT","text":"Ayleth is on her way to Falcon's Nest to assist in the funeral proceedings. Take what you find to her there. I will let her know to expect you."},{"name":"MARGYT","text":"Hunt down the slate yetis at Red Rim and find whatever you can that belongs to the fallen Convictors. Take it to Ayleth at Falcon's Nest."},{"name":"AILETH","text":"I've been apprised of the situation. Give me what you found."},{"name":"AILETH","text":"Thank you. I will make sure it reaches their families."},{"name":"AILETH","text":"How can I earn glory when assigned with such petty busywork?"},{"name":"AILETH","text":"They won't be bossing me around when I..."},{"name":"AILETH","text":"Pretend you didn't hear that. Report back to Margyt; your mission is complete."},{"name":"MARGYT","text":"Ah, back already. I hope you didn't run into any problems."},{"name":"MARGYT","text":"That's good to hear. As soon as Ayleth returns, we can get to work improving our tactics for the next battle. She should be back soon."}],"reward":{"gil":990,"items":[{"id":10708,"one":1,"hq":1},{"id":10750,"one":1,"hq":1},{"id":10792,"one":1,"hq":1},{"id":10876,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67409]}},"partials":[{"type":"npc","id":"1014146","obj":{"i":1014146,"n":"Margyt","l":2200,"q":5}},{"type":"npc","id":"1014150","obj":{"i":1014150,"n":"Ayleth","l":2200,"q":1}},{"type":"item","id":"10708","obj":{"i":10708,"n":"Titanium Sabatons of Fending","l":139,"c":47011,"t":38,"p":24657}},{"type":"item","id":"10750","obj":{"i":10750,"n":"Titanium Sollerets of Maiming","l":139,"c":47012,"t":38,"p":24657}},{"type":"item","id":"10792","obj":{"i":10792,"n":"Titanium Sabatons of Striking","l":139,"c":47013,"t":38,"p":24657}},{"type":"item","id":"10876","obj":{"i":10876,"n":"Titanium Sabatons of Scouting","l":139,"c":47014,"t":38,"p":24657}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67409","obj":{"i":67409,"n":"Enlisted","g":96,"l":"Ishgard","s":5602}}]}