{"quest":{"name":"A Noble Purpose","location":"Coerthas Western Highlands","id":67429,"patch":3.0,"sort":5613,"icon":100469,"eventIcon":71221,"issuer":1014146,"target":1014153,"involved":[1011907,1011910,1014133,1014152],"genre":94,"journal":["Margyt wants to try a new strategy for finding Ayleth.","With no idea where to look next for Ayleth, Margyt suggests talking to the troops at the Convictory to see if anyone might know where she could be. Ask around and see what you can find out.","Ayleth was spotted at the <span class=\"emphasis\">North Star</span> by one of the scouts on patrol. Travel there and find her.","An unknown nobleman offered Ayleth power and status in exchange for the dragon tooth, but it was a trick. He stole the tooth and left Ayleth with nothing. Margyt assures her that despite not having status or social power, if they work together, they can bring about change in the Ishgardian society. Ayleth agrees to work together with Margyt to this end. Margyt asks you to talk to her back at the Convictory so she can continue the discussion in the safety of the camp.","Though no one soldier at the Convictory holds great power, Margyt explains that, like any cohesive fighting unit, if she and Ayleth combine their strength and work together, they can achieve much more than they ever could alone. With this in mind, they resolve to change Ishgard for the better."],"objectives":["Gather information about Ayleth.","Search for Ayleth at the <span class=\"emphasis\">North Star</span>.","Speak with Margyt."],"dialogue":[{"name":"MARGYT","text":"We'll never find Ayleth if we don't even know where to look. Ask the troops around the Convictory. See if anyone has seen her."},{"name":"MARGYT","text":"Ask the troops around the Convictory if any of them have seen Ayleth."},{"name":"SOLDIER01893","text":"After a day on patrol, ain't nothin' better than a nice cold glass of ale─even in this weather."},{"name":"JANTELLOT","text":"Ayleth? She's that odd girl, yes? I've not seen her lately, no... Why? Has something happened?"},{"name":"JANTELLOT","text":"Ayleth? I've still not seen her since the last time you asked. What's going on?"},{"name":"LUCIAE","text":"Oh, Ayleth? I thought nothing of it, but it's been quite a while since last I saw her. But it's not unusual for soldiers on mission to be away from the camp for some time."},{"name":"LUCIAE","text":"I still haven't seen Ayleth. Has something happened to her?"},{"name":"SOLDIER01893","text":"Ayleth? Yes, I was just on patrol. I saw her walking around with some nobleman."},{"name":"SOLDIER01893","text":"The two of them were out to the northeast─out towards the <span class=\"emphasis\">North Star</span>."},{"name":"SOLDIER01893","text":"Ayleth was with a nobleman out near the <span class=\"emphasis\">North Star</span>."},{"name":"AILETH","text":"Chasing me down for the dragon fang? You're too late. I don't have it."},{"name":"AILETH","text":"I tried to trade the fang with a nobleman. He offered me power, status."},{"name":"AILETH","text":"I was a fool. He tricked me. Took the fang from me. I have nothing to show for it."},{"name":"AILETH","text":"My beloved was framed for theft by a nobleman. The trial was a farce─trial by combat."},{"name":"AILETH","text":"The nobleman died─instantly, painlessly─in the Calamity. That's when I realized: you can't change this world except from the top."},{"name":"AILETH","text":"I have to climb higher. I have to raise my status through merit. I have to─"},{"name":"MARGYT","text":"(-???-)You don't have to!"},{"name":"MARGYT","text":"Ayleth, you're no different to me. I want to change this rotten nation, too. And I'm frustrated by how slow Dominiac is to take action."},{"name":"MARGYT","text":"But he explained to me that change doesn't have to come from the top. Even from the bottom of society, we can bring about change. Even with what little power we have, if we work together, we can make a difference."},{"name":"MARGYT","text":"Please, Ayleth, will you fight with me? Help me change Ishgard. We may not be noble, shining dragoons, but we can do it."},{"name":"AILETH","text":"Margyt... I thought I was alone. I was so focused on changing the world, I didn't see the allies by my side."},{"name":"AILETH","text":"Let's fight together, Margyt!"},{"name":"MARGYT","text":"Thank you for all your help, adventurer. Please meet us back at the Convictory. I'd like to speak with you further, but not out here in the middle of the cold and the wilderness."},{"name":"MARGYT","text":"Hello again, and thank you again."},{"name":"MARGYT","text":"Truth be told, I hardly feel I had the right to speak to Ayleth as I did."},{"name":"MARGYT","text":"When you first approached me, I was speaking to a nobleman from another unit. He was asking me to abandon Dominiac's unit and join him. I was planning on doing it, too. Dominiac never put me on the front lines where all the glory is."},{"name":"MARGYT","text":"When I asked for your help to start killing dragons and gaining glory in combat, it was mostly to see how Dominiac would react."},{"name":"MARGYT","text":"I decided that, if I proved myself completely capable in frontline combat and he still left me in the support unit, just handling supplies, I would leave his unit, and take the other nobleman up on his offer."},{"name":"MARGYT","text":"But while we were searching for Ayleth, Dominiac said something to me that made me reconsider."},{"name":"MARGYT","text":"He explained that any fighting force is made of frontline fighters and the troops behind that support them. The front lines can never feel safe if they can't rely on their support to be there when needed. That's why he puts his strongest, most reliable troops in support positions."},{"name":"MARGYT","text":"He's no fool. He has carefully considered where each soldier can do the most good. Once I realized this, I realized that there's no shame in supporting my unit."},{"name":"MARGYT","text":"Just as warriors can make a difference from either the front or the rear of the battle, so too can we change Ishgard from either the top of society or the very bottom. I truly believe this, and want to fight together with Ayleth to achieve it."},{"name":"MARGYT","text":"It is a pity we lost the dragon tooth to that nobleman, but we can let this drive us to gain even greater trophies from even greater dragons. Thank you again, adventurer."}],"reward":{"gil":620,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67409]}},"partials":[{"type":"npc","id":"1014146","obj":{"i":1014146,"n":"Margyt","l":2200,"q":5}},{"type":"npc","id":"1014153","obj":{"i":1014153,"n":"Margyt","l":2200,"q":2}},{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"npc","id":"1011910","obj":{"i":1011910,"n":"Luciae","l":2200,"q":6}},{"type":"npc","id":"1014133","obj":{"i":1014133,"n":"Sly Scout","l":2200,"q":3}},{"type":"npc","id":"1014152","obj":{"i":1014152,"n":"Ayleth","l":2200,"q":1}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67409","obj":{"i":67409,"n":"Enlisted","g":96,"l":"Ishgard","s":5602}}]}