{"quest":{"name":"Unknown Ultimatum","location":"Coerthas Western Highlands","id":67425,"patch":3.0,"sort":5609,"icon":100469,"eventIcon":71221,"issuer":1014146,"target":1014146,"involved":[1014147,1014149],"genre":94,"journal":["Margyt is in the middle of a heated discussion.","You happen upon an unknown man offering Margyt some sort of ultimatum, then leaving. She is part of Dominiac's unit, and the troops know that he is up to something─they have not been sent out after the Dravanian Horde in quite some time now. The only option, as Margyt sees it, is to take action of their own accord. Talk to Ayleth for further details.","A scout from another unit was attacked by a dragon─quite an impressive one, if rumor is to be believed. Killing this beast would help make up for the time wasted waiting for orders from Dominiac. The attack happened at Red Rim, to the south of the Convictory. Rendezvous with Ayleth there.","Some members of the scouting party fell to the dragon's attack. Their bodies should be nearby, as should the dragon. Find a body. The attacker will not be far from it.","You have found a body and slain the dragon that was lurking near it. Inform Ayleth of the situation.","Ayleth congratulates you on an impressive kill and asks you to deliver the fang you recovered from the beast to Margyt.","Margyt, too, congratulates you on your victory. She thanks you for the fang, but comments that it does not seem to have come from the dragon that attacked the scouts. That beast was much larger─or so the survivors claim."],"objectives":["Speak with Ayleth.","Speak with Ayleth at Red Rim.","Find a dead scout.","Speak with Ayleth.","Deliver the dragon fang to Margyt."],"dialogue":[{"name":"AILETH","text":"What is it? I'm busy."},{"name":"MARGYT","text":"We <span class=\"emphasis\">will</span> try it eventually. You'll have my answer once we do."},{"name":"AYASHII01889","text":"(-Noble-looking Man-)Do you realize that your unit is the laughingstock of the Convictory? I will only wait so long for your answer."},{"name":"MARGYT","text":"Did your mother never tell you not to eavesdrop? But seeing as you're already listening, do you think you could help me out with something?"},{"name":"MARGYT","text":"Dominiac is my commanding officer. I don't know what he's been plotting lately, but we haven't been sent out to hunt Dravanians for quite some time now."},{"name":"MARGYT","text":"Every night the other units come back with more notches in their spears. And we're just sitting around doing nothing. The longer we wait for orders from Dominiac, the more we get left behind."},{"name":"MARGYT","text":"...So we've decided to stop waiting. I'm planning to gather the troops and head out on our own to get a few kills under our belts. Do you think you could lend a hand?"},{"name":"MARGYT","text":"Ayleth here can fill you in on the details. She can seem a little odd sometimes, but she's a good girl."},{"name":"MARGYT","text":"Talk to Ayleth for more details. She's a little odd, but don't worry. She's a good girl."},{"name":"AILETH","text":"Yes. I'm Ayleth. Who are you?"},{"name":"AILETH","text":"Understood. I was just about to gather the troops."},{"name":"AILETH","text":"A scout from another unit just got back. He says they were attacked by a dragon. A big one. This is our chance at a good kill."},{"name":"AILETH","text":"They were attacked at Red Rim, to the south. Let's go."},{"name":"AILETH","text":"The scouts were attacked near here. Some of them were killed. Find one."},{"name":"AILETH","text":"Those dead scouts should be nearby. Find one."},{"name":"AILETH","text":"Did you find a dead scout?"},{"name":"AILETH","text":"A dragon? By yourself?"},{"name":"AILETH","text":"That's your kill. You get the credit. But tell me how you did it."},{"name":"AILETH","text":"I must grow stronger! I must rise above the fools inhabiting this realm!"},{"name":"AILETH","text":"Pretend you didn't hear that. Take that dragon fang back to Margyt. I'll deal with the scout's body."},{"name":"MARGYT","text":"Ah, welcome back. Something tells me you have a present for me."},{"name":"MARGYT","text":"A dragon's fang! That's quite an achievement. You clearly know how to handle yourself in a fight."},{"name":"MARGYT","text":"But this fang is smaller than what I'd been led to expect. Perhaps the dragon you slew is not the one that attacked the scouts."}],"reward":{"gil":496,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67409]}},"partials":[{"type":"npc","id":"1014146","obj":{"i":1014146,"n":"Margyt","l":2200,"q":5}},{"type":"npc","id":"1014147","obj":{"i":1014147,"n":"Ayleth","l":2200,"q":2}},{"type":"npc","id":"1014149","obj":{"i":1014149,"n":"Ayleth","l":2200,"q":1}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67409","obj":{"i":67409,"n":"Enlisted","g":96,"l":"Ishgard","s":5602}}]}