{"quest":{"name":"Beefing Up the Reserves","location":"The Sea of Clouds","id":67436,"patch":3.0,"sort":5603,"eventIcon":71221,"issuer":1012054,"target":1012054,"genre":97,"journal":["Fabrellet's troubled look suggests he needs a helping hand.","Camp Cloudtop's food reserves are running low, and Fabrellet needs your help to keep his men from going hungry. To accomplish this, he plans on using meat from wisents grazing north of the camp until a new shipment of provisions arrives. Slay the wisents north of Camp Cloudtop and obtain four slabs of their meat.","You obtain four slabs of wisent meat. Return to Camp Cloudtop and deliver them to Fabrellet.","You deliver the meat to Fabrellet, who thanks you for your swift work. He is grateful the wisents are present for just such an occasion. As it turns out, they are not indigenous to the islands, but were brought to serve as livestock. He goes on to say they plan to raise sheep as well, but for now they will settle for the less-than-savory meat of wisents. "],"objectives":["Defeat wisents and obtain their meat.","Deliver the meat to Fabrellet."],"dialogue":[{"name":"FABRELLET","text":"No, no, this will not do at all. Ah, just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see. I need your help to fortify our dwindling stock of provisions."},{"name":"FABRELLET","text":"Our supply of meats is particularly low, but flesh from the wisents should hold us over until the next shipment of provisions comes in. If you can bring back four slabs of their meat, it would help us immensely. You can find them north of camp at Last Step."},{"name":"FABRELLET","text":"You'll find the wisents north of here at Last Step. Four slabs of meat should last until the next shipment of provisions."},{"name":"FABRELLET","text":"They leave much to be desired of taste, but we're in no position to be particular with our food. Were you able to retrieve their meat?"},{"name":"FABRELLET","text":"Thank goodness. I can breathe easy the next time I take inventory. I'm honestly not sure where we'd be if not for the wisents grazing north of here."},{"name":"FABRELLET","text":"And to think, they're not actually indigenous to these islands. They were originally brought here as livestock for just such an emergency."},{"name":"FABRELLET","text":"Given time we will have sheep as well, but we've yet to breed stock suited to these altitudes. But enough of my rambling. You have ensured my men will not go wanting, at least for another few moons. If we should have need of more wisent meat, I know who to call."}],"reward":{"gil":527,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67410]}},"partials":[{"type":"npc","id":"1012054","obj":{"i":1012054,"n":"Fabrellet","l":2100,"q":6}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67410","obj":{"i":67410,"n":"Honoring the Past","g":96,"l":"Ishgard","s":5603,"f":1}}]}