{"quest":{"name":"A War without End","location":"Coerthas Western Highlands","id":67434,"patch":3.0,"sort":5614,"icon":100470,"eventIcon":71221,"issuer":1013710,"target":1013710,"involved":[1014144,1014147,1014153,1014154,1014155],"genre":94,"journal":["Dominiac wants to talk to you about his plans to attract dragons.","The corpse of the wyvern you slew has been stolen. Margyt is heading the investigation into this worrying theft. Speak with her for more details.","Margyt knows who stole the wyvern corpse: the very same nobleman that stole the dragon tooth from Ayleth. After an attempt at a diplomatic solution, the man has rendered his demands: he wants to lead the operation to attract and slay a dragon using the dead wyvern.","Much though Dominiac is loath to rob his unit of the glory of slaying the dragon, his duty to the people of Ishgard takes priority. He decides to submit to the thief's ultimatum. Saintrelmaux is still searching for the dragon and was last seen near the Dreaming Dragon. Find him and inform him of the change of leadership.","Saintrelmaux was approached by a nobleman carrying the wyvern corpse claiming leadership of the operation. A disagreement broke out but was interrupted by an ajattara attack. Both the wyvern corpse and several lives, including the nobleman's, were lost in the attack. Assist Ayleth with the cleanup effort.","Ayleth wants nothing more than to chase the ajattara down and kill it. She asks you to search the area for something─anything that might attract the beast.","Among the wreckage of the ajattara's attack, you find a wyvern bone. Ayleth is hopeful that this will be enough to draw out the ancient Dravanian. Return to Dominiac and apprise him of these serious developments.","Dominiac tells you that word has reached him of an impending Dravanian attack─a vast force sweeping towards the Convictory, led by an ajattara. Dominiac marks a location on your map, near Banepool. He asks you to travel there and use the wyvern bone to draw the Horde's attention long enough for the Convictors to prepare their defenses. Travel to Banepool and distract the attackers, or at least the terrible dragon leading and coordinating the attack.","You place the wyvern bone at the requested location. With any luck, it should attract the ajattara leading the attack on the Convictory. Lie in wait for it and ambush it when it arrives.","You have made short work of the ajattara. This has hopefully bought the Convictors the time they needed to prepare for the Dravanian onslaught. Recover the wyvern bone, lest it attract more dragons.","You have recovered the wyvern bone. Report back to Dominiac.","Your battle with the ajattara bought enough time for the Convictors to mount a successful defense against the now-leaderless Dravanian attack. Dominiac hopes that this victory will draw the Holy See's attention to the importance of what allowed this victory: the strong cooperation between the front lines and their supporting forces. He hopes that this might lead to a change in the way the Convictors fight, going from a group of paupers and outcasts, squabbling for credit and recognition, to an elite, organized fighting unit. He suggests that you find Ayleth and Saintrelmaux. They will be glad to know that your fight went well and that you are unharmed.","Seeing a signet ring Ayleth carries, Saintrelmaux explains how he was born into nobility and that the ring bears his house's crest. Ayleth received the ring from a woman she cared for after the Calamity─Saintrelmaux's mother. The two realize that─despite their different backgrounds─at the Convictory, they are equal. This strengthens their resolve to see Ishgard changed for the better. Relay this uplifting news to Dominiac.","Whether their common ground be coincidence or fate, Dominiac is glad that his troops have come to understand their equal footing. He thanks you again for your assistance in seeing his plan through, and hopes he can find some way to repay you in the future."],"objectives":["Speak with Margyt.","Speak with Dominiac.","Speak with Saintrelmaux.","Speak with Ayleth.","Search the wreckage.","Speak with Dominiac.","Place the wyvern bone at Banepool.","Lie in wait for the ajattara.","Recover the wyvern bone.","Deliver the bone to Dominiac.","Speak with Ayleth.","Report to Dominiac."],"dialogue":[{"name":"DOMINIAC","text":"Firstly, please, let me apologize. The corpse of the wyvern you slew has been stolen."},{"name":"DOMINIAC","text":"There's a place─the Dreaming Dragon─that holds great importance to the Dravanians. We placed the body there and waited for a great and powerful dragon, but none appeared. The corpse, however, <span class=\"emphasis\">disappeared</span>."},{"name":"DOMINIAC","text":"We can only assume that someone slipped in, under cover of night, and stole it. We're conducting an investigation now. If you'd be willing, we'd greatly appreciate your assistance. Please speak with Margyt for more information."},{"name":"DOMINIAC","text":"We're investigating the theft of the wyvern corpse, but we need your help. Please speak with Margyt. She will provide you with further information."},{"name":"MARGYT","text":"That nobleman really is the worst─stirring up the troops like that."},{"name":"MARGYT","text":"The investigation into the missing wyvern body? We already know who the bloody thief is."},{"name":"MARGYT","text":"Do you remember the nobleman that stole the dragon fang from Ayleth? Well, it seems he found out about your plan and is doing what he can to interfere."},{"name":"DOMINIAC","text":"Trying to steal another's achievements is really, truly detestable. But, be that as it may, we plan to try resolving this amicably─through negotiation."},{"name":"MARGYT","text":"In fact, we've talked to the man already...and he's put forth his conditions."},{"name":"DOMINIAC","text":"Hmph. I imagine he wants to be put in charge of the operation, does he?"},{"name":"MARGYT","text":"Indeed he does. Dominiac, what would you have us do? Know that whatever you decide, you have the entire unit's unwavering support."},{"name":"MARGYT","text":"That filthy swine!"},{"name":"DOMINIAC","text":"This puts us in quite a difficult situation. We can't just let that man take credit for all our hard work, but we also have a duty to fight back against the Dravanian Horde at all cost."},{"name":"DOMINIAC","text":"I want this victory to belong to the troops that fight under my command, but we also can't let an opportunity like this─an opportunity to slay a great, ancient dragon─pass us by."},{"name":"MARGYT","text":"I think we all understand how you feel, Dominiac."},{"name":"DOMINIAC","text":"Thank you. That makes this just a little bit easier. We have no choice but to meet his demands."},{"name":"DOMINIAC","text":"I'll meet with this nobleman myself and tell him that we'll agree to his terms. Please find Saintrelmaux and let him know of this development. He has taken command of the unit and is at the Dreaming Dragon leading the search for the slain wyvern."},{"name":"DOMINIAC","text":"Saintrelmaux is at the Dreaming Dragon leading the search for the slain wyvern. Please find him and let him know that we are agreeing to the nobleman's terms."},{"name":"AILETH","text":"So eager for glory... Look at them now."},{"name":"SAINTRELMAUX","text":"Gods, it's all gone to hells!"},{"name":"SAINTRELMAUX","text":"Some idiot nobleman came up claiming to be in charge of the unit! He had the wyvern corpse with him! But before I could tell him what I thought of his claims─"},{"name":"SAINTRELMAUX","text":"Hm. I see. Well, that explains who the nobleman was and why he thought he was in charge. Dominiac <span class=\"emphasis\">is</span> the type who would yield control if it meant slaying a dragon."},{"name":"SAINTRELMAUX","text":"Unfortunately, I fear the situation may have been complicated somewhat. For you see, while he and I were arguing, a huge, monstrous dragon swooped down─an ajattara, I think it was."},{"name":"SAINTRELMAUX","text":"Well, it had killed the nobleman before I could blink. And as soon as it had arrived, it was flying away─with the dead wyvern in its claws. Ayleth is addressing the aftermath. Do you think you could lend her a hand?"},{"name":"SAINTRELMAUX","text":"That bloody idiot nobleman has ruined our─ No, it's just a setback. We can't give up so easily."},{"name":"AILETH","text":"This corpse was the nobleman that tricked me. He turned tail─tried to save himself."},{"name":"AILETH","text":"He tried to make off with a dragon bone. See if you can't find it. If you do, take it back to Dominiac."},{"name":"AILETH","text":"So eager for glory... Look at them now."},{"name":"DOMINIAC","text":"An ajattara attacked the nobleman? Hmmm, that explains it, then."},{"name":"DOMINIAC","text":"We just received word that a large detachment of the Dravanian Horde is headed towards the Convictory─and they're being led by a large and ancient dragon. It must be a retaliatory attack by the ajattara."},{"name":"DOMINIAC","text":"We must do something about it. But we're not ready to fend off an attack of that size just yet. Perhaps that wyvern bone could attract the ajattara and draw the force it leads away from the Convictory?"},{"name":"DOMINIAC","text":"Here, I've placed a mark on your map. Take the bone there and distract the ajattara. That should buy us the time we need to mobilize our forces, strengthen our defenses, and meet the Dravanian Horde head-on!"},{"name":"DOMINIAC","text":"Take the wyvern bone to the location I've marked on your map. Use it to distract the ajattara long enough for us to prepare a defense against the Horde! Please hurry!"},{"name":"DOMINIAC","text":"Good work! With the time you bought us, we were able to prepare a defense and drive off the Horde's attack. Did you recover the wyvern bone?"},{"name":"DOMINIAC","text":"It seems the bone was effective bait. What happened to the ajattara?"},{"name":"DOMINIAC","text":"Hahahaha! Why did I even ask? You only needed to slow the thing down, but I suppose I should have expected no less from the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> that slew the primals."},{"name":"DOMINIAC","text":"We need to inform the Holy See of what has happened. Both of the...unfortunate accident...that befell one of their nobles, and of the glorious victory over the Dravanian Horde, shared by both yourself and my unit."},{"name":"DOMINIAC","text":"I can only hope that this victory will draw attention to the fighting strategy that allowed it─the cooperation between the front line and the logistical troops supporting them."},{"name":"DOMINIAC","text":"It will change the way the Convictors fight! It would make this a place not for fallen nobles and starving paupers to run to, but the home of an elite fighting force gloriously defending Ishgard from the Dravanian onslaught."},{"name":"MARGYT","text":"Ahhh, so this was your plan all along."},{"name":"DOMINIAC","text":"This is but one step in a much greater plan. And it was a step that someone like Ser Aymeric─someone far removed from the actual fighting itself─is not able to take. Step by step, we can change Ishgard for the better. That is my goal."},{"name":"MARGYT","text":"I will be fighting at your side, Dominiac. For Ishgard, and for you, and more than anything else, for myself."},{"name":"DOMINIAC","text":"You're loyal, Margyt, and that's a good thing. It's for the loyalty of troops like you that I am here."},{"name":"DOMINIAC","text":"You know, I don't see Saintrelmaux or Ayleth around. You should probably try and find them; I think they'd be glad to know that you are safe."},{"name":"MARGYT","text":"It was a very close fight, but we pulled through somehow. If you hadn't taken care of that ajattara, I daresay we'd be dead."},{"name":"DOMINIAC","text":"I haven't seen Saintrelmaux or Ayleth around. Go and find them. They'll be glad to know that you are safe."},{"name":"SAINTRELMAUX","text":"You keep looking at your hand, Ayleth. Was it injured in the battle?"},{"name":"SAINTRELMAUX","text":"You keep looking at your hand, Ayleth. What's the matter?"},{"name":"AILETH","text":"It's a ring. It was left to me by a woman I cared for during the aftermath of the Calamity."},{"name":"AILETH","text":"She would look at it when she knew she was dying. She told me that seeing it let her know she was still alive."},{"name":"SAINTRELMAUX","text":"Wait─that ring! The seal on the ring, it's the coat of arms of my house! The woman you cared for─that was my mother!?"},{"name":"AILETH","text":"Hm? You're nobility?"},{"name":"SAINTRELMAUX","text":"Nobility? No... Well, technically, I suppose I am. My father was a knight in service of House Haillenarte. But after the great failure at the Steel Vigil..."},{"name":"SAINTRELMAUX","text":"After the dishonor of failing in his mission, he was stripped of his rank. The shame was all too great for him and he took his own life. Left with neither money nor prestige, my mother fled. And you, it seems, cared for her at the end."},{"name":"AILETH","text":"But... What are you doing here?"},{"name":"SAINTRELMAUX","text":"To be honest, I came here looking for a noble death. Filled with hatred for Ishgard, for the nobility, for my family... I was ready to give up. But this last great battle has made me reconsider."},{"name":"AILETH","text":"Me too. Growing up in the Brume, I hated all those things and more."},{"name":"AILETH","text":"Do you think we can do it? Change Ishgard, that is. A pauper and a nobleman, working together..."},{"name":"SAINTRELMAUX","text":"I think we can, one day. But even now, you and I are here together, speaking as equals."},{"name":"SAINTRELMAUX","text":"Just as I have changed my mind, so too might this nation and its people change. Wouldn't you agree?"},{"name":"SAINTRELMAUX","text":"We still have much to work at. One day, those at the bottom will bring about change in those at the top. Until that day, hold on to that ring, Ayleth."},{"name":"AILETH","text":"I will fight. My friends are by my side."},{"name":"SAINTRELMAUX","text":"Even from here at the Convictory, we can change our nation."},{"name":"DOMINIAC","text":"What an incredible coincidence. Maybe even fate, perhaps. Whatever it may be, if Saintrelmaux and Ayleth are going to work together for the sake of the future, that's enough for me."},{"name":"DOMINIAC","text":"Thank you yet again for all your assistance and cooperation. Margyt is busy taking stock after the battle, but she, too, deeply appreciates all you've done for us."},{"name":"DOMINIAC","text":"I hear that even Aymeric has expressed his thanks to you. I doubt I can ever fully repay you for all you've done, but if you ever need our help, I will gladly do what I can."}],"reward":{"gil":681,"items":[{"id":5677,"one":1},{"id":5672,"one":1},{"id":5667,"one":1}],"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67409]}},"partials":[{"type":"npc","id":"1013710","obj":{"i":1013710,"n":"Dominiac","l":2200,"q":6}},{"type":"npc","id":"1014144","obj":{"i":1014144,"n":"Saintrelmaux","l":2200,"q":2}},{"type":"npc","id":"1014147","obj":{"i":1014147,"n":"Ayleth","l":2200,"q":2}},{"type":"npc","id":"1014153","obj":{"i":1014153,"n":"Margyt","l":2200,"q":2}},{"type":"npc","id":"1014154","obj":{"i":1014154,"n":"Saintrelmaux","l":2200,"q":1}},{"type":"npc","id":"1014155","obj":{"i":1014155,"n":"Ayleth","l":2200,"q":1}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67409","obj":{"i":67409,"n":"Enlisted","g":96,"l":"Ishgard","s":5602}}]}