{"quest":{"name":"A Full Stomach and Happy Heart","location":"Ishgard","id":67441,"patch":3.0,"sort":5701,"eventIcon":71221,"issuer":1012178,"target":1012178,"involved":[1014722,1014723,1014724,1014725,1014726,1014727],"genre":96,"journal":["Ermiance wants to spread a little cheer in Ishgard.","Ermiance tires of seeing people moping about, and wants to brighten their spirits with a few cups of soup. She asks that you search about Ishgard for those sad souls in need of cheer, and show them a bowl of her delicious cooking.","Walking about Ishgard, you encounter residents from various walks of life in need of respite. One look at your bowl sends them straight to Ermiance. Return to her and see if her cooking was the cure for what troubles them.","Her pot of soup is not large enough to feed all of Ishgard, but Ermiance takes satisfaction in seeing smiling faces again. She reminds you that, rather than letting the misery of the world consume you, it is sometimes better to forgo the inevitable and enjoy what few pleasures life has to offer."],"objectives":["Show the bowl of soup to the annoyed knight.","Show the bowl of soup to the wailing widow.","Show the bowl of soup to the starving starveling.","Show the bowl of soup to the House Fortemps knight.","Report to Ermiance."],"dialogue":[{"name":"ERMIANCE","text":"Well, aren't you a sight to behold─rose to your cheeks and a glimmer of optimism besides. Seems everywhere else I turn people are sullen and dreary-eyed, trudgin' about as if the world's gonna end. Times are tough, to be sure, but they're bein' a bit dramatic if you ask me."},{"name":"ERMIANCE","text":"What they need is some cheer, somethin' to warm their hearts and bodies in spite o' this blisterin' cold. I think I got a recipe that'll cure what ails 'em if yer willin' to help."},{"name":"ERMIANCE","text":"If you see people sulkin' or surly or spoilin' for a bout o' fisticuffs, show 'em a bowl o' this here soup, and send 'em this way. As I always say, the surest way to the heart is through the stomach."},{"name":"ERMIANCE","text":"If you find anyone down in the dumps, one whiff o' this'll have 'em headin' here in no time."},{"name":"ANGRYCOMMONER01905","text":"You haven't listened to a word I said, you godsdamned pigheaded oaf!"},{"name":"HAILLENARTESOLDIER01905","text":"Sometimes I wonder why I bother with you. All this whinging will solve nothing."},{"name":"ANGRYTEMPLEKNIGHT01905","text":"We cannot expect to maintain public order if no one abides by the law!"},{"name":"ANGRYCOMMONER01905","text":"All I'm saying is the rules are too damned strict! Quit blathering about the obvious and listen with those gargantuan Elezen ears! Or is your head too bloody thick to understand?"},{"name":"ANGRYTEMPLEKNIGHT01905","text":"What did you say!?"},{"name":"ANGRYTEMPLEKNIGHT01905","text":"How about I─ &lt;sniff&gt; Mmm... What's that smell?"},{"name":"ANGRYCOMMONER01905","text":"We've been arguing for so long, I'd forgotten how famished I am. You say there's soup by the Holy Stables?"},{"name":"ANGRYTEMPLEKNIGHT01905","text":"I suppose I could also do with a warm meal about now. My thanks for bringing word of this generous offering."},{"name":"WIDOW01905","text":"&lt;sob&gt; First the cold, biting winds of Coerthas drove me from my home, and now the war has taken my dear husband... &lt;sob&gt; I don't think I can go on alone."},{"name":"WIDOW01905","text":"Hm? &lt;sniffle&gt; Is that a bowl of soup? &lt;sniffle&gt; A warm meal would surely help calm my nerves. I...I think I'll have some."},{"name":"HUNGRYBOY01905","text":"It's so cold...and I'm so hungry... &lt;sniffle&gt; I wish me mum was here."},{"name":"HUNGRYBOY01905","text":"That looks awful tasty, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>, but I don't got any money. ...You say it's free!? Oh, boy! I hope there's some left for me!"},{"name":"FORTEMPSSOLDIER01905","text":"Do you not grow tired of this war? The endless bloodshed? How long must we suffer, offering up our lives to a cause that has all but forgotten its purpose?"},{"name":"HAILLENARTESOLDIER01905","text":"Watch your tongue. Our <span class=\"emphasis\">purpose</span> is to protect the people of Ishgard, and see that the Horde is wiped clean from the realm."},{"name":"FORTEMPSSOLDIER01905","text":"Forgive me. I'm merely tired is all."},{"name":"FORTEMPSSOLDIER01905","text":"Soup, eh? A nice, warm meal is certainly one way to lift my spirits."},{"name":"HAILLENARTESOLDIER01905","text":"You say it's near the Holy Stables? Well, that settles it. Let's go and have ourselves something to eat."},{"name":"ERMIANCE","text":"Welcome back. You did well roundin' up all these folk. Been a while since I seen anyone this cheerful."},{"name":"ERMIANCE","text":"Don't matter how angry you are, or if you think the world's against you. Sometimes you just gotta let it go. I find a little soup helps bring folk together and move things along."},{"name":"ERMIANCE","text":"How about you, friend? You look like you've had a few rough days yourself. Why not sit a spell and help yerself to a cup?"}],"reward":{"gil":502,"items":[{"id":12869},{"id":4678,"one":1},{"id":4721,"one":1},{"id":9335,"one":1}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"quests":[67177]}},"partials":[{"type":"npc","id":"1012178","obj":{"i":1012178,"n":"Ermiance","l":2300,"q":1}},{"type":"npc","id":"1014722","obj":{"i":1014722,"n":"Annoyed Knight","l":2300,"q":1}},{"type":"npc","id":"1014723","obj":{"i":1014723,"n":"Incandescent Commoner","l":2300,"q":1}},{"type":"npc","id":"1014724","obj":{"i":1014724,"n":"Wailing Widow","l":2300,"q":1}},{"type":"npc","id":"1014725","obj":{"i":1014725,"n":"Starving Starveling","l":2300,"q":1}},{"type":"npc","id":"1014726","obj":{"i":1014726,"n":"House Fortemps Knight","l":2301,"q":1}},{"type":"npc","id":"1014727","obj":{"i":1014727,"n":"House Haillenarte Knight","l":2301,"q":1}},{"type":"item","id":"12869","obj":{"i":12869,"n":"Dhalmel Fricassee","l":139,"c":24107,"t":46}},{"type":"item","id":"4678","obj":{"i":4678,"n":"Beef Stew","l":50,"c":24110,"t":46,"p":415}},{"type":"item","id":"4721","obj":{"i":4721,"n":"Bouillabaisse","l":55,"c":24111,"t":46}},{"type":"item","id":"9335","obj":{"i":9335,"n":"Bacon Broth","l":110,"c":24103,"t":46}},{"type":"quest","id":"67177","obj":{"i":67177,"n":"The Sins of Antiquity","g":3,"l":"Ishgard","s":66}}]}