{"quest":{"name":"Returning What's Ours","location":"The Sea of Clouds","id":67448,"patch":3.0,"sort":5704,"eventIcon":71221,"issuer":1012071,"target":1012071,"genre":97,"journal":["Hinu Vali has decided to have someone embark on a dangerous mission.","Hinu Vali has asked you to steal supplies from the Vundu tribe. She assures you that the success of this request will affect all the Vanu of Ok' Zundu. Go to Ok' Vundu and steal three Zundu offerings.","You have gathered up the supplies from Ok' Vundu territory, though you cannot at the moment reconcile why they seem to be of Zundu origin. Take them back to Hinu Vali to see what she has to say.","You have delivered the offerings to Hinu Vali, and she explains to you that they were traditionally given to the Vundu tribe to ensure safety for the Zundu. However, the Vundu sometimes do not acknowledge these offerings and attack anyway. Given that the offerings are essentially meaningless, they would be most useful if they were returned to the stores of Ok' Zundu."],"objectives":["Steal Zundu offerings from Ok' Vundu.","Deliver Zundu offerings to Hinu Vali."],"dialogue":[{"name":"HINUVALI","text":"Tribe of Zundu faces great distress! Hinu Vali makes foolish request of netherling, like asking <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to stand on mountain during thunderstorm."},{"name":"HINUVALI","text":"Netherling steals into Ok' Vundu like silent breeze, makes away with supplies. Netherling can only carry so much─three baskets enough."},{"name":"HINUVALI","text":"Hinu Vali makes dangerous request of netherling, but fate of Zundu tribe relies on success."},{"name":"HINUVALI","text":"Within Ok' Vundu lies a collection of supplies, ripe for taking. Netherling brings back three for benefit of all Ok' Zundu."},{"name":"HINUVALI","text":"Netherling brings supplies on zephyr winds. Is weight of three too much to bear?"},{"name":"HINUVALI","text":"Ah! Netherling carries salvation to tribe of Zundu! Tribe forever in netherling's debt."},{"name":"HINUVALI","text":"For many moons, Zundu tribe gives offerings to Vundu, guarantees safety of tribe from violent storm of aggression."},{"name":"HINUVALI","text":"But tribe of Vundu fickle like summer breeze, attacks innocent Zundu tribe as mood dictates. Since offerings mean little to Vundu, Hinu Vali decides to take back offerings."},{"name":"HINUVALI","text":"With netherling's help, stores of Ok' Zundu are restored, just as bountiful harvests after lush rains."}],"reward":{"gil":622,"items":[{"num":5,"id":21800}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"quests":[67183]}},"partials":[{"type":"npc","id":"1012071","obj":{"i":1012071,"n":"Hinu Vali","l":2100,"q":3}},{"type":"item","id":"21800","obj":{"i":21800,"n":"Glamour Prism","l":35,"c":26235,"t":60}},{"type":"quest","id":"67183","obj":{"i":67183,"n":"Bolt, Chain, and Island","g":3,"l":"The Sea of Clouds","s":72}}]}