{"quest":{"name":"The Feast Must Go On","location":"The Sea of Clouds","id":67444,"patch":3.0,"sort":5702,"eventIcon":71221,"issuer":1012071,"target":1012071,"genre":97,"journal":["Hinu Vali's knives have seen better days.","Hinu Vali has a mountain of meat she must prepare for the upcoming feast in Ok' Zundu, and a new set of knives would make her work go significantly faster. Claws from the endymions flying near Ok' Zundu should serve her needs. Slay four and deliver their claws to Hinu Vali.","The endymions fall swiftly, and you pull their claws from their slain corpses. Bring them to Hinu Vali so she may continue with her preparations.","The endymions' claws cut through the meat with little resistance. With any luck, Hinu Vali will have the meat ready in time for Zundu's feast."],"objectives":["Slay endymions and obtain their claws.","Deliver the claws to Hinu Vali."],"dialogue":[{"name":"HINUVALI","text":"Hinu Vali must prepare meat for tribe's feast, but her blades dull like waning moon. Netherling helps, brings materials for new knives while Hinu Vali continues work."},{"name":"HINUVALI","text":"Skies near Ok' Zundu home to endymions with claws sharp and deadly. Strike down four and bring claws─else butchery never ends."},{"name":"HINUVALI","text":"Endymions infest skies near Ok' Zundu─their keen claws make Hinu Vali's work much easier."},{"name":"HINUVALI","text":"Endymions which blot skies like thunderclouds fall to earth in netherling's wake. Does <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> bring their claws?"},{"name":"HINUVALI","text":"Yes... As endymion's claws cut through prey, Hinu Vali's new knives slice effortlessly through meat. Netherling eases Hinu Vali's work. Tribe feasts tonight!"}],"reward":{"gil":564,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"quests":[67182]}},"partials":[{"type":"npc","id":"1012071","obj":{"i":1012071,"n":"Hinu Vali","l":2100,"q":3}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}}]}