{"quest":{"name":"Sleepless in Ok' Zundu","location":"The Sea of Clouds","id":67445,"patch":3.0,"sort":5703,"unlocksFunction":1,"eventIcon":71341,"issuer":1012069,"target":1012069,"genre":97,"journal":["Ganu Vali is looking around nervously with bloodshot eyes.","Ganu Vali has not been able to sleep a wink for all the buzzing bugs around Ok' Zundu. He has asked you to gather three tufts of gurglegrass to help manage the bug population and hopefully provide him with the rest he so sorely needs.","You have gathered the gurglegrass, which looks quite eager to gobble up as many bugs as it can. Deliver the grass to Ganu Vali before he collapses from exhaustion.","You have delivered the carnivorous plants to Ganu Vali and his sanity seems to have recovered. The Zundu tribe stresses harmony with nature in all things, and providing the gurglegrass with food kills two birds with one stone."],"objectives":["Gather gurglegrass at the designated locations.","Deliver the gurglegrass to Ganu Vali."],"dialogue":[{"name":"GANUVALI","text":"Ganu Vali cannot escape unending thunderstorm of buzzing bugs, and desires sleep more than rain during summer drought. Ganu Vali has idea to soothe bugs' droning, but delirious from exhaustion. Netherling goes in Ganu Vali's stead?"},{"name":"GANUVALI","text":"To east lies gurglegrass, which devours bugs as Vanu hatchlings feast on wamouracampa meat. Netherling brings Ganu Vali three, and storm in ears recedes to dull drizzle."},{"name":"GANUVALI","text":"Ganu Vali seeks silence like that which comes with clear night sky. Netherling brings gurglegrass to quell storm of buzzing insects."},{"name":"GANUVALI","text":"Sleepless nights make Ganu Vali's mind maelstrom of fog. Does netherling bring plants Ganu Vali seeks?"},{"name":"GANUVALI","text":"Netherling brings rest at last. Ganu Vali's troubles become sustenance for gurglegrass, and big wheel of nature turns without hindrance."}],"reward":{"gil":684,"aetherCurrent":1,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"quests":[67182]}},"partials":[{"type":"npc","id":"1012069","obj":{"i":1012069,"n":"Ganu Vali","l":2100,"q":4}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}}]}