{"quest":{"name":"Growing Pains","location":"The Sea of Clouds","id":67447,"patch":3.0,"sort":5712,"icon":100481,"eventIcon":71221,"issuer":1014171,"target":1014173,"involved":[1014172],"genre":97,"journal":["Gunu Vanu seeks a helping hand for his rite of passage.","For Zundu nestlings to complete their rite of passage, they must offer the elder something of value to the tribe. Gunu Vanu's plan is to take the beak of a tsanahale, as his father once did, and prove himself a mighty warrior. Meet him deep within the Blue Window.","In the Blue Window, Gunu Vanu states that he will keep watch while you see to the tsanahale. Lure out one of the beasts by whistling loudly and dispatch it in the usual fashion.","The tsanahale is no more, and its beak is yours. Give it to Gunu Vanu so he may finally complete his rite of passage.","Gunu Vanu is overjoyed to receive the tsanahale's beak and is eager to present it to the elder shaman. Accompany Gunu Vanu to the shaman's roost in Ok' Zundu.","Though glad to receive Gunu Vanu's offering at first, the elder shaman grows skeptical that the nestling could slay a tsanahale by himself. Gunu Vanu subsequently admits to being helped by you, and the shaman commands him to redo the rite of passage─this time without attempting to exploit a loophole in the rules."],"objectives":["Speak with Gunu Vanu.","Lure out and slay a tsanahale.","Present the tsanahale beak to Gunu Vanu.","Speak with Gunu Vanu."],"dialogue":[{"name":"GUNUVANU","text":"Before netherling helps, Gunu Vanu explains rite of passage. All Vanu must make offering to elder shaman that proves valuable to Zundu."},{"name":"GUNUVANU","text":"Some hunt, some fish, some dance like leaves in wind. All contribute to glory and richness of tribe. Alas, elder shaman ridicules Gunu Vanu's offering seven times! But with netherling's help─and Gunu Vanu's plan─elder shaman's ridicule turns to astonishment."},{"name":"GUNUVANU","text":"Gunu Vanu thinks long on next offering, and like clouds which part before sun, an idea comes! Gunu Vanu passes trial in same way as Father: hunts mighty tsanahale and presents its beak to elder shaman. Proves he is no longer nestling!"},{"name":"GUNUVANU","text":"Netherling strong and fierce as spring monsoon, so tsanahale surely falls like wilting leaves before our wrath. Come to hunting grounds with mightiest weapon─Gunu Vanu awaits!"},{"name":"GUNUVANU","text":"At last, netherling is come! Takes so long, Gunu Vanu almost run─I mean, doze off!"},{"name":"GUNUVANU","text":"Tsanahale far from clever. With whistle, netherling lures out and strikes down like lightning in the night. Its beak serves as proof of our deed!"},{"name":"GUNUVANU","text":"...What of Gunu Vanu? He stands apart with a griffin's eyes and keeps watch over netherling, lest <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> fall prey to other fell beasts!"},{"name":"GUNUVANU","text":"Lure out tsanahale with whistle, then strike it down. And do not forget to bring its beak!"},{"name":"GUNUVANU","text":"...Huh!? Oh, yes, Gunu Vanu sees all! And netherling brings the tsanahale beak?"},{"name":"GUNUVANU","text":"Yes...this beak helps Gunu Vanu escape drudgery of nestlingdom! Elder shaman cannot deny such magnificent offering! Come, netherling, ride winds of haste to shaman's roost!"},{"name":"GUNUVANU","text":"Aanu Vanu, most benevolent and wise elder, behold! Gunu Vanu brings eighth offering for rite of passage. With this he grows from nestling and becomes a true member of Zundu!"},{"name":"AANUVANU","text":"Well, well! Like father before him, Gunu Vanu comes with beak of savage tsanahale. Such an offering is most unexpected."},{"name":"AANUVANU","text":"But...as surely as moon sets in west, Gunu Vanu shies from hunt and runs from bloodshed. Does he expect elder shaman to believe this is no longer so?"},{"name":"AANUVANU","text":"Do not lie to Aanu Vanu... Gunu Vanu not become warrior overnight. Does he receive help from another? Gunu Vanu knows rules─help from others is forbidden! He knows if he dares break, consequences most grave!"},{"name":"GUNUVANU","text":"Wait! Elder, make not hasty decisions! Slayer of tsanahale not Gunu Vanu, this is true, but slayer is not other Vanu─it is netherling!"},{"name":"GUNUVANU","text":"Rules of rite forbid help from <span class=\"emphasis\">Vanu</span>, but make no mention of netherlings. See, elder shaman─Gunu Vanu breaks no rules!"},{"name":"AANUVANU","text":"Hmph. Gunu Vanu twists words as weaver braids rope. Very well. Aanu Vanu acknowledges Gunu Vanu not break rules─but nestling he remains! Gunu Vanu must try again."},{"name":"GUNUVANU","text":"A-Again!?"}],"reward":{"gil":653,"items":[{"num":5,"id":21800}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67182,67446]},"next":[67450]},"partials":[{"type":"npc","id":"1014171","obj":{"i":1014171,"n":"Gunu Vanu","l":2100,"q":3}},{"type":"npc","id":"1014173","obj":{"i":1014173,"n":"Gunu Vanu","l":2100,"q":4}},{"type":"npc","id":"1014172","obj":{"i":1014172,"n":"Gunu Vanu","l":2100,"q":1}},{"type":"item","id":"21800","obj":{"i":21800,"n":"Glamour Prism","l":35,"c":26235,"t":60}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}},{"type":"quest","id":"67446","obj":{"i":67446,"n":"Flying the Nest","g":97,"l":"The Sea of Clouds","s":5711,"f":1}},{"type":"quest","id":"67450","obj":{"i":67450,"n":"Ok' Zundu's Got Talent","g":97,"l":"The Sea of Clouds","s":5713}}]}