{"quest":{"name":"Nutritious and Delicious","location":"The Sea of Clouds","id":67443,"patch":3.0,"sort":5701,"eventIcon":71221,"issuer":1012072,"target":1012072,"genre":97,"journal":["Conu Vanu needs help feeding the hatchlings.","It seems that the winds of fortune have brought you to Ok' Zundu to help Conu Vanu feed Ok' Zundu's hungry hatchlings. Slay five Window wamouracampae and bring Conu Vanu their skinned carcasses.","You have slain the wamouracampae and collected their skinned carcasses, although judging by the smell you fail to see the appeal. Deliver the meat to Conu Vanu so the hatchlings will cry out in hunger no more.","You deliver the meat to Conu Vanu, and he explains that the meat of the wamouracampa is considered a delicacy among the Vanu Vanu. He invites you to partake the next time he prepares the wormy-looking animal."],"objectives":["Slay Window wamouracampae to obtain skinned wamouracampae.","Deliver the skinned wamouracampae to Conu Vanu."],"dialogue":[{"name":"CONUVANU","text":"As zephyr winds bring good fortune, with netherling comes opportunity for Conu Vanu."},{"name":"CONUVANU","text":"Hatchlings crave flesh of skinned wamouracampae, but Conu Vanu dare not leave them to hunt. In Conu Vanu's stead, netherling slays beasts and brings back bounty!"},{"name":"CONUVANU","text":"To grow strong, hatchlings must feast. Help Conu Vanu fill their bellies with wamouracampae."},{"name":"CONUVANU","text":"Like thunder rolls, cries of hatchlings resound! Netherling brings wamouracampae?"},{"name":"CONUVANU","text":"Well, well! Netherling brings most bountiful feast to quell hatchlings' hunger. Very good!"},{"name":"CONUVANU","text":"Netherling partakes of wamouracampae as well? No? Refreshing and robust flavor, it has. Think on it─Conu Vanu is great cook!"}],"reward":{"gil":564,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"quests":[67182]}},"partials":[{"type":"npc","id":"1012072","obj":{"i":1012072,"n":"Conu Vanu","l":2100,"q":2}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}}]}