{"quest":{"name":"Unfulfilled Dreams","location":"Ishgard","id":67442,"patch":3.0,"sort":5702,"eventIcon":71221,"issuer":1012170,"target":1012170,"involved":[1014728],"genre":96,"journal":["The bleak nights of Ishgard have never felt colder for Brictt.","Brictt regretfully informs you that Osaulie, the young thief you encountered in the Brume, recently passed away. But something about this whole affair doesn't sit right with him. What he finds most troubling about this is how such a resourceful girl could not afford to guard herself against the chilly nights of Ishgard. Brictt asks that you speak with patrons at the Forgotten Knight and find her belongings for clues.","You speak with a drunken knight in the tavern and find Osaulie's belongings in the Brume. The knight tells you she listened intently to his stories of Camp Cloudtop, a quiet, dragon–free settlement in the Sea of Clouds. Amongst her belongings are flyers for this encampment and a large sum of gil. Return to Brictt and tell him of what you learned.","You tell Brictt of the conversation in the Forgotten Knight, and when he sees the gil and flyers in her bag, all the pieces fall into place. Osaulie was orphaned years ago after an attack by dragons, and he suspects she longed to escape Ishgard. In the end, her desire to save every last coin of her money cost her life. Brictt is saddened that a child with such determination could be denied her dream. As a small gesture of respect, he asks you take her belongings to Camp Cloudtop and erect a small memorial in her honor.","You travel to Camp Cloudtop. You place her belongings down in the shade of a large flower when a sound reminiscent of laughter briefly catches your attention. Return to Brictt and tell him the deed has been done.","Brictt thanks you for taking time to pay tribute to Osaulie's efforts. The end of the Dragonsong War is not yet in sight, but he believes someday the realm will escape the bloody grasp of conflict."],"objectives":["Question patrons of the Forgotten Knight.","Search for Osaulie's belongings.","Report to Brictt.","Take Osaulie's belongings to Camp Cloudtop.","Report to Brictt."],"dialogue":[{"name":"BRICTT","text":"Do you remember Osaulie, the young girl who deceived you for our firewood? I don't mean to alarm you, but...her body was found <span class=\"alternative-container\"><span class=\"alternative\">this morning</span><span class=\"alternative\">not long ago</span></span>, huddled in a corner of the Brume. No doubt her life was snuffed out by the cold of night."},{"name":"BRICTT","text":"Something about this doesn't sit right with me. Contemptible though her actions have been, I won't deny that she was good at what she did."},{"name":"BRICTT","text":"That she could not afford firewood or even shelter for the night is unthinkable. How could this have happened?"},{"name":"BRICTT","text":"Word travels fast in the Brume, and news of its greatest thief's passing has likely reached the taverns by now. See what you can glean from talk in the Forgotten Knight. Failing that, you may find a clue among her belongings down in the Brume."},{"name":"BRICTT","text":"Word of anything worth knowing will surely find its way to the Forgotten Knight. Her belongings down in the Brume may also tell us of what happened."},{"name":"DRUNKENSOLDIER01905","text":"That ratty little pickpocket? I didn't talk to her so much as she stopped to hear my grumbling. Can't say I recall hearing that name, though."},{"name":"DRUNKENSOLDIER01905","text":"I'd just returned from Camp Cloudtop, and she overheard me griping about the place. She practically hung on my every word."},{"name":"DRUNKENSOLDIER01905","text":"Not that I had much to say─there's practically nothing to do there. Tending the crops, hours of mindless surveillance duty. The only thing to fear there is a slow, painful death from boredom. But anyroad, the kid started to bother me after a while, so I told her to get lost."},{"name":"DRUNKENSOLDIER01905","text":"I hope you don't think <span class=\"emphasis\">I</span> had anything to do with the girl's passing. I was here in the bar all night. Gibrillont'll vouch for me."},{"name":"SYSTEM","text":"You find a sack filled with Osaulie's belongings. Among them you discover a sizable amount of gil and recruitment flyers for Camp Cloudtop."},{"name":"BRICTT","text":"I see. So the poor child was looking to find peace in the Sea of Clouds. In light of all that has befallen Ishgard, I cannot blame her."},{"name":"BRICTT","text":"She was made an orphan long ago by the war, and attacks by the Horde only grow more terrifying. A land free of dragons must have seemed a paradise to her."},{"name":"BRICTT","text":"But dreams will guard no one from the chill of night. &lt;sigh&gt; If only she had reached out to someone─anyone at all... Would that I could turn back the hands of time."},{"name":"BRICTT","text":"It saddens my heart to know she will never see her dreams made reality. But perhaps there's a way we can honor her courage. Would you take her things to Camp Cloudtop, and set up a small memorial of sorts?"},{"name":"BRICTT","text":"That poor child. She will never see the Sea of Clouds, but in this way, we can see that she completes the journey in spirit."},{"name":"SYSTEM","text":"You place Osaulie's belongings in the shade of a large flowering plant. A young girl's laughter seems to echo on the breeze..."},{"name":"BRICTT","text":"Thank you, friend. Though her life was filled with hardships, perhaps now she will find peace in the hereafter."},{"name":"BRICTT","text":"But no child should have to pay such a high price to know peace, and I believe there will come a day when the dawn rises on an Ishgard free of war."}],"reward":{"gil":1098,"items":[{"id":12541}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67177,67406]}},"partials":[{"type":"npc","id":"1012170","obj":{"i":1012170,"n":"Brictt","l":2300,"q":2}},{"type":"npc","id":"1014728","obj":{"i":1014728,"n":"Drunken Knight","l":2300,"q":1}},{"type":"item","id":"12541","obj":{"i":12541,"n":"Larimar","l":130,"c":21324,"t":48,"p":4452}},{"type":"quest","id":"67177","obj":{"i":67177,"n":"The Sins of Antiquity","g":3,"l":"Ishgard","s":66}},{"type":"quest","id":"67406","obj":{"i":67406,"n":"Caught in the Act","g":96,"l":"Ishgard","s":5604}}]}