{"quest":{"name":"A Tall Order to Fill","location":"The Sea of Clouds","id":67440,"patch":3.0,"sort":5602,"eventIcon":71221,"issuer":1012059,"target":1012059,"genre":97,"journal":["Gildon is up to his neck in problems.","Gildon is troubled by the dhalmels that have wandered close to the camp in recent days. Moreover, he claims they are breeding at an alarming rate. He asks that you slay four of them to reduce them to more manageable numbers.","You have slain the dhalmels. Return to Camp Cloudtop and report to Gildon.","Gildon is relieved to hear your report. He suspects the dhalmels have come closer to Camp Cloudtop to satisfy their curiosity. While they mean no harm, they are also blissfully unaware of the damage inflicted upon Gildon and his fellow knights. Though it pains him to do so, he has resolved to putting them down should their numbers grow too large."],"objectives":["Slay dhalmels.","Report to Gildon."],"dialogue":[{"name":"GILDON","text":"Good to see you, <span class=\"highlight\">Forename</span>. I'm sure this comes as no surprise, but there is yet more work to be done."},{"name":"GILDON","text":"The dhalmels inhabiting Ok' Gundu have been wandering dangerously close to the outpost of late. As they continue to grow in number, they have become a hindrance to our work in the area. It would be a boon to the camp if you could slay four of them to thin their ranks."},{"name":"GILDON","text":"You'll find the dhalmels grazing in the fields northeast of here, though I cannot say it's a short trek. Felling four should prove sufficient to thin their ranks."},{"name":"GILDON","text":"Welcome back, friend. I take it you've dealt with the dhalmels, then? I can only hope now our men will have an easier time patrolling the area."},{"name":"GILDON","text":"Their coming near the outpost is but a recent phenomenon, no doubt stemming from curiosity. The dhalmels are docile in nature, but it's quite easy for such large animals to injure our men unintentionally. It pains me that we cull them so, but we do what we must for the good of the camp."}],"reward":{"gil":496,"xp":36000},"reqs":{"jobs":[{"lvl":56,"id":34}],"questsType":"all","quests":[67173,67410]}},"partials":[{"type":"npc","id":"1012059","obj":{"i":1012059,"n":"Gildon","l":2100,"q":8}},{"type":"quest","id":"67173","obj":{"i":67173,"n":"He Who Would Not Be Denied","g":3,"l":"Ishgard","s":58}},{"type":"quest","id":"67410","obj":{"i":67410,"n":"Honoring the Past","g":96,"l":"Ishgard","s":5603,"f":1}}]}