{"quest":{"name":"Getting a Legtrap Up","location":"The Dravanian Forelands","id":67458,"patch":3.0,"sort":5702,"icon":100472,"eventIcon":71221,"issuer":1014502,"target":1014502,"involved":[1014503,1014504],"genre":98,"journal":["Hervoix is eager for someone to help him shirk his duties.","Hervoix, a freshly arrived hunter to the bustling Tailfeather, has received the unenviable task of having to kill one of the many beasts that prey on the forest's chocobos. Claiming that hunters have no business slaying bothersome pests, he instead plans to bestow a purse of gil to any adventurer willing to do his work for him─and you eagerly accept the offer. Head to the highlands near the southeast camp and rid the forest of three chocobo legtraps.","The chocobo legtraps will no longer be bothering any chocobos, or lazy and irresponsible chocobo hunters. Bring Hervoix the good news that he will no longer have to worry about doing his assigned duties.","After reporting to Hervoix, it becomes apparent that he intends to take all the credit for your slaughter of the chocobo legtraps. He promises to reward you after giving the report to his chief. Just to make sure, follow him and speak to O'bhen Tia to hear Hervoix's clever retelling of the truth.","You come upon Hervoix while he is in the midst of giving his report, and he quickly tries to gloss over your request for a reward. His chief decides to give him the benefit of the doubt, assigning him a series of new tasks that include everything besides hunting. Hervoix reluctantly accepts this new work and sulks back to his post at Tailfeather. Now that he is out of earshot from his chief, try asking him once again for your promised reward.","Hervoix complains about his tasks loudly, but seems resigned to his fate. At last, he gives you your reward, but it seems he still has more gil to give away, and more jobs to be done..."],"objectives":["Slay chocobo legtraps.","Report to Hervoix.","Speak with O'bhen Tia.","Speak with Hervoix again."],"dialogue":[{"name":"HERVOIX","text":"Th-That's the adventurer I've been hearing about! Thank the Twelve! Might be you could help me out with a little problem I've got."},{"name":"HERVOIX","text":"You see, there are beasts that're stalking our quarry we like to affectionately call “chocobo legtraps.” Some from my group have already been dispatched to the southeast to rid the area of them, and I've been tasked with killing the ones near the southeastern camp."},{"name":"HERVOIX","text":"But I've got to thinking and...that kinda work doesn't seem like something a <span class=\"emphasis\">chocobo</span> hunter should be doing, right? I don't mind following orders, but I didn't come here to get rid of pests."},{"name":"HERVOIX","text":"But <span class=\"emphasis\">you</span>, on the other hand, well...killing things is an adventurer's specialty, ain't it? Go and get rid of a few of the legtraps for me, and it might be I'll make it worth your while."},{"name":"HERVOIX","text":"I knew you wouldn't say no to a fair bit of coin! Just go southeast of here, and make sure your greaves are in good shape!"},{"name":"HERVOIX","text":"The legtraps I'm assigned to slay are to the southeast of here. Take care of them and you'll be well rewarded."},{"name":"HERVOIX","text":"Ah, adventurer, I trust the legtraps were no match for the likes of you?"},{"name":"HERVOIX","text":"Thank heavens I didn't have to take care of that dreadful business! Well, my chief'll want to hear that the deed's been done."},{"name":"HERVOIX","text":"Oh, your reward? You'll receive it after I return. Worry not, I'm a hunter of my word! Wonder if I'll get a promotion..."},{"name":"HERVOIX","text":"Ah, adventurer. After I give my report you'll have your coin, don't worry!"},{"name":"HERVOIX","text":"Chief, I've taken care of the chocobo legtraps at your behest. Although they put up a fierce fight, they were no match for my bow!"},{"name":"HERVOIX","text":"Oh, it's you, adventurer. I said I'd reward you, just wait while I give my report!"},{"name":"OBHENTIA","text":"What in the bloody hells'd you just say about a <span class=\"emphasis\">reward</span>?"},{"name":"HERVOIX","text":"No, no, I said, “I hope I don't bore you,” not anything about a reward. Haha, spending all that time amongst chocobo cries might've made you a bit deaf! "},{"name":"OBHENTIA","text":"Hmmm... Anyroad, you took care o' that job a mite quicker than I expected. Good thing, though─here's yer next assignments."},{"name":"HERVOIX","text":"This is...this isn't hunting! What're we doing out here if we aren't going after a single chocobo!?"},{"name":"OBHENTIA","text":"If ye got time to whinge, ye got time to do these jobs. There's three jobs 'ere need doin', and since ye finished off those legtraps so quick, I don't reckon these'll prove too difficult."},{"name":"HERVOIX","text":"I... Understood..."},{"name":"OBHENTIA","text":"I was sure Hervoix would take longer to kill those beasts than that... Do ye reckon he had a helpin' hand?"},{"name":"HERVOIX","text":"This is a bloody farce! More boring jobs to do, and we haven't even caught a single chocobo!"},{"name":"HERVOIX","text":"Oh, right, your reward. I suppose you deserve it. I hope you enjoyed yourself more than I'm like to with these meddlesome tasks."},{"name":"HERVOIX","text":"Now, what's on this list the chief gave me...?"}],"reward":{"gil":595,"items":[{"num":15,"id":8157,"one":1},{"num":15,"id":8158,"one":1},{"num":15,"id":8159,"one":1}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67189,67319]},"next":[67459,67460,67461]},"partials":[{"type":"npc","id":"1014502","obj":{"i":1014502,"n":"Hervoix","l":2000,"q":5}},{"type":"npc","id":"1014503","obj":{"i":1014503,"n":"Hervoix","l":2000,"q":2}},{"type":"npc","id":"1014504","obj":{"i":1014504,"n":"O'bhen Tia","l":2000,"q":2}},{"type":"item","id":"8157","obj":{"i":8157,"n":"Xelphatol Apple","l":45,"c":25308,"t":61}},{"type":"item","id":"8158","obj":{"i":8158,"n":"Doman Plum","l":45,"c":25311,"t":61}},{"type":"item","id":"8159","obj":{"i":8159,"n":"Mamook Pear","l":45,"c":25313,"t":61}},{"type":"quest","id":"67189","obj":{"i":67189,"n":"Tataru's Surprise","g":3,"l":"Gridania","s":78}},{"type":"quest","id":"67319","obj":{"i":67319,"n":"Persistence Makes Perfect","g":98,"l":"The Dravanian Forelands","s":5216}},{"type":"quest","id":"67459","obj":{"i":67459,"n":"Pest Control","g":98,"l":"The Dravanian Forelands","s":5703}},{"type":"quest","id":"67460","obj":{"i":67460,"n":"A Step in the Right Direction","g":98,"l":"The Dravanian Forelands","s":5704}},{"type":"quest","id":"67461","obj":{"i":67461,"n":"Garbage Duty","g":98,"l":"The Dravanian Forelands","s":5705}}]}