{"quest":{"name":"The Black Storm","location":"The Sea of Clouds","id":67452,"patch":3.0,"sort":5715,"icon":100481,"eventIcon":71221,"issuer":1014173,"target":1012068,"involved":[1012067,1014171,1014178,1014200],"genre":97,"journal":["Gunu Vanu is all out of ideas─and second chances.","Try as he might, Gunu Vanu can come up with no ideas for his final chance at the rite of passage. As he is wont to do, Gunu Vanu decides to turn to his family for help. Talk to Guna Vanu and listen to any suggestions he has.","Guna Vanu remarks that the only thing his brother has proven to be skilled at is sneaking and stealing, and suggests that Gunu Vanu creeps into the Garlean─or “Garloon”─outpost to steal one of the many shiny objects that lie strewn about. Gunu Vanu musters up as much courage as he can and heads in the direction of the outpost. Follow him and give what aid he requires.","Recalling the time you distracted the elder shaman with your dancing, Gunu Vanu asks you to throw the Garlean ranks into chaos to aid him in his sneaking. Slay three imperial soldiers to create a diversion.","The troops are staggering from your sudden and brutal assault. Report to Gunu Vanu, who is cowering in the distance.","Gunu Vanu sees no clear path to the imperial supplies, and asks you thin the ranks of the soldiers even further. Slay three more imperial troops.","The encampment has been thrown into confusion after your relentless attacks. Report to Gunu Vanu and see if he has managed to steal anything.","Although you did exactly what Gunu Vanu asked, he was still unable to sneak into the camp and steal anything. He has asked you to slay even more imperial troops. Before long there will be none left in the whole camp.","You have provided the distraction that Gunu Vanu asked for─again─but are not sure if he was fast enough to sneak into the camp undetected. Speak with him and see if your slaughter provided a satisfactory distraction.","Gunu Vanu has managed to steal an object from the Garleans, but it is unclear exactly what it is yet. Whether or not it has any value is up to the judgment of the elder shaman. Speak to Aanu Vanu in Ok' Zundu.","Gunu Vanu presents his shiny metal object to Aanu Vanu, and you see that it is a massive metal claw from the Garlean encampment. Aanu Vanu says it must be a fallen feather from a massive skyborne beast from Zundu legend, and judges that Gunu Vanu's rite of passage is complete. He bestows upon him the title of “Gunu Vanu, Bringer of Shade” for offering such an important piece of Zundu lore. Gunu Vanu wells with pride at his new title, but is eager to rest after his long and tiring journey, and leaves to find shade. Aanu Vanu asks you to find Guna Vanu and tell him of his brother's success.","Guna Vanu is overjoyed that his brother has succeeded in the trial, relieved that his brother has finally grown up in the eyes of the tribe. Guna Vanu hopes that with time, his brother's actions will come to resemble that of a functional member of Ok' Zundu society."],"objectives":["Speak with Guna Vanu.","Speak with Gunu Vanu.","Slay imperial soldiers.","Report to Gunu Vanu.","Slay imperial soldiers.","Report to Gunu Vanu.","Slay imperial soldiers.","Report to Gunu Vanu.","Speak with Aanu Vanu.","Report to Guna Vanu."],"dialogue":[{"name":"GUNUVANU","text":"Try as he might to think of next offering, Gunu Vanu's head remains empty like cloudless sky."},{"name":"GUNUVANU","text":"Only one option remains: we go to Brother, who advises Gunu Vanu since days as newborn hatchling. As certain as wheel of nature turns, he gives advice for next step!"},{"name":"GUNUVANU","text":"As surely as sun provides light for crops to grow, Brother gives idea for rite of passage!"},{"name":"GUNAVANU","text":"Zephyr winds bring netherling back to Guna Vanu! Brother tells Guna Vanu of help he receives─our family is indebted to you!"},{"name":"GUNAVANU","text":"However, it seems netherling's deeds cast long shadow over Brother's. He can only boast that he sneaks into elder shaman's hut─perhaps silence is his gift?"},{"name":"GUNUVANU","text":"Gunu Vanu moves calmly as midnight moon, even vilekin stir not at his passing! Gunu Vanu even eats Brother's food when his eyes are turned!"},{"name":"GUNAVANU","text":"Gunu Vanu steals from Brother too!? Well, Vanu Vanu not choose family. Hmm... But perhaps this skill can prove valuable to tribe..."},{"name":"GUNAVANU","text":"Ah! Guna Vanu knows! Black ones who live to the east have many treasures which glitter like stars in midnight sky. If Gunu Vanu steals one and offers it to elder shaman, passage is assured!"},{"name":"GUNUVANU","text":"Brother speaks of netherlings which attack village with ferocity rivaling Vundu. Elder shaman calls them “Garloon.” To sneak past netherlings much more difficult than to sneak into his hut."},{"name":"GUNUVANU","text":"But Gunu Vanu loses not his final chance to escape doldrums of nestling life! Courage swells like roiling thundercloud─yes! Gunu Vanu steals Garloon treasures!"},{"name":"GUNUVANU","text":"Netherling accompanies as witness to Gunu Vanu's bravery! Come to where Garloon tribe roosts─Gunu Vanu waits in darkness of shade!"},{"name":"GUNAVANU","text":"May zephyr winds guide my brother out of the nest..."},{"name":"GUNUVANU","text":"Ah, netherling comes to gaze on Gunu Vanu's courage! Garloons within sight, but many more than Gunu Vanu imagines."},{"name":"GUNUVANU","text":"But Gunu Vanu not run─look, treasures shine like fallen stars! But Garloons stand in way... Netherling, distract them as with elder shaman, this time with dance of wrath! Create chaos among Garloons and hide Gunu Vanu's approach."},{"name":"GUNUVANU","text":"Gunu Vanu waits here and calms storm of fear swelling in heart. Go, like monsoon winds!"},{"name":"GUNUVANU","text":"Netherling cuts through Garloon ranks like mistral gales, and Gunu Vanu uses distraction to steal Garloon treasures!"},{"name":"GUNUVANU","text":"Gunu Vanu breathes deep...moves soundless like cool autumn wind."},{"name":"GUNUVANU","text":"Netherling fells Garloons, but too quick! Gunu Vanu needs more time to snatch Garloon treasure."},{"name":"GUNUVANU","text":"Silent movement requires finesse─and time! Netherling strikes down more Garloons, provides fog of chaos to hide Gunu Vanu's approach! "},{"name":"GUNUVANU","text":"Lay low the Garloons, and Gunu Vanu quietly snatches treasure."},{"name":"GUNUVANU","text":"Gunu Vanu becomes like silent wind..."},{"name":"GUNUVANU","text":"Ah, netherling fells Garloon troops already? Gunu Vanu not ready, must wait for perfect moment..."},{"name":"GUNUVANU","text":"Once more, netherling! Show Garloons no mercy, and give Gunu Vanu time to sneak! "},{"name":"GUNUVANU","text":"Fell Garloon troops and throw them into confusion! Gunu Vanu sneaks into camp and steals treasure!"},{"name":"GUNUVANU","text":"Netherling's distraction lets Gunu Vanu sneak unseen. Behold! Gunu Vanu plucks fallen star from sky!"},{"name":"GUNUVANU","text":"Elder shaman surely lets Gunu Vanu pass trial now! None in Ok' Zundu possess such a treasure! Now, let us ride the winds to the elder's roost."},{"name":"GUNUVANU","text":"Hurry and speak to elder shaman─soon Gunu Vanu no longer nestling!"},{"name":"AANUVANU","text":"Gunu Vanu approaches with flustered breath and disheveled feathers, but from dangerous journey or long nap, Aanu Vanu knows not. Does he hold something of value? Remember, nestling, this is last chance."},{"name":"GUNUVANU","text":"Noble and benevolent elder, Gunu Vanu brings offering like none other! Behold!"},{"name":"GUNUVANU","text":"Offering surprises even elder shaman, yes? Gunu Vanu sneaks into Garloon camp unseen and unheard, and brings Zundu their greatest treasure!"},{"name":"AANUVANU","text":"Oh... Such material does not exist in Ok' Zundu. More sturdy and solid than totem pole with strongest magic wards!"},{"name":"AANUVANU","text":"Zundu legends tell of enormous flying beast which covers land in midnight shade. This must be its feather! For bringing such precious offering, Gunu Vanu completes rite of passage!"},{"name":"AANUVANU","text":"Gunu Vanu deserves title which befits his deeds. For as long as rising moon follows setting sun, Gunu Vanu shall be known as the Bringer of Shade!"},{"name":"GUNUVANU","text":"At last, passage is complete! Gunu Vanu, Bringer of Shade, no longer oldest of nestlings!"},{"name":"GUNUVANU","text":"But now, Gunu Vanu wants nothing more than rest. Trial saps all energy from Gunu Vanu."},{"name":"GUNUVANU","text":"Leave further hard work for nestlings. Gunu Vanu, Bringer of Shade, must find great tree to nap under."},{"name":"AANUVANU","text":"Even though no longer nestling, Gunu Vanu still shies from work... Netherling, tell Gunu Vanu's brother of his success. Finally his heart may be free of worry."},{"name":"AANUVANU","text":"Netherling, tell Guna Vanu of his brother's success. At last fear of everlasting ridicule vanishes."},{"name":"GUNUVANU","text":"Gunu Vanu, Bringer of Shade, tires from excitement...goes to seek shade of tree and rest!"},{"name":"GUNAVANU","text":"Netherling! News travels fast as spring gale─Gunu Vanu passes trial!"},{"name":"GUNAVANU","text":"But netherling knows Gunu Vanu as well as any Zundu. Change does not come for many moons, if at all. Guna Vanu hopes passage of rite gives Brother courage to grow into responsible Vanu Vanu, but must remain patient..."},{"name":"GUNAVANU","text":"Nevertheless, Guna Vanu owes netherling much and more! May netherling go forth with zephyr winds at back to guide through journeys safely. Netherling always welcome in Ok' Zundu!"}],"reward":{"gil":997,"items":[{"id":5682,"one":1},{"id":5717,"one":1},{"id":5722,"one":1}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67182,67451]}},"partials":[{"type":"npc","id":"1014173","obj":{"i":1014173,"n":"Gunu Vanu","l":2100,"q":4}},{"type":"npc","id":"1012068","obj":{"i":1012068,"n":"Guna Vanu","l":2100,"q":4}},{"type":"npc","id":"1012067","obj":{"i":1012067,"n":"Aanu Vanu","l":2100,"q":5}},{"type":"npc","id":"1014171","obj":{"i":1014171,"n":"Gunu Vanu","l":2100,"q":3}},{"type":"npc","id":"1014178","obj":{"i":1014178,"n":"Gunu Vanu","l":2100,"q":1}},{"type":"npc","id":"1014200","obj":{"i":1014200,"n":"Gunu Vanu","l":2100,"q":1}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}},{"type":"quest","id":"67451","obj":{"i":67451,"n":"Lazing Saddles","g":97,"l":"The Sea of Clouds","s":5714}}]}