{"quest":{"name":"On Wings of Vanu","location":"The Sea of Clouds","id":67454,"patch":3.0,"sort":5709,"eventIcon":71221,"issuer":1012064,"target":1011952,"involved":[1013571,1013572,1013573,1013575],"genre":97,"journal":["Sonu Vanu stares off into the distance, eyes fixed on unseen troubles.","Sonu Vanu has received word that three knights were captured by the Vundu tribe. Unable to intervene directly with the Vundu's plans, he implores that you find them before they come to harm.","You find the captured knights, and they appear to be none the worse for wear. Seek out Lady Laniaitte at the Rosehouse and report to her of their condition.","Lady Laniaitte is shocked and dismayed that her knights have been captured, cursing the Vundu for their audacious act. She plans to deploy a rescue team posthaste, but is overcome with a sense of foreboding. The once-quiet camp is slowly becoming the war zone they were thought to be removed from. Thanks to the Zundu's fellowship and your selfless heroism, her knights will live to fight another day."],"objectives":["Search for the kidnapped knights.","Report to Laniaitte."],"dialogue":[{"name":"SONUVANU","text":"As moon brings light to the blackest night, so you have come. Netherling, your people are in danger."},{"name":"SONUVANU","text":"Vundu came unseen like summer rain to steal three netherlings. They are trapped, hanging in cages like ripe fruit. You must seek them out, and warn your people."},{"name":"SONUVANU","text":"Zundu cannot show hand against Vundu. But we will guide you, like gentle breeze pressing on netherling's back. Go quickly to Ok' Vundu, and find other netherlings."},{"name":"SPRISONERVANUB01918","text":"Such courage is rare for netherlings─impresses even mightiest of Vanu! Netherling always welcome in Ok' Zundu!"},{"name":"SONUVANU","text":"We cannot intervene, and show our hand to the Vundu. Netherling must carry news like wind to other netherlings."},{"name":"HOSTAGEA01918","text":"An adventurer!? This is the last place I wanted to be found, but I suppose there's no sense in worrying about honor now, is there?"},{"name":"HOSTAGEB01918","text":"Leave me be for now. This situation calls not for a single <span class=\"alternative-container\"><span class=\"alternative\">woman's</span><span class=\"alternative\">man's</span></span> bravado, but patience. My life is in no immediate danger, so there is still time."},{"name":"HOSTAGEC01918","text":"You've come to help? But it's not safe. They could be watching us even now! I can stand to wait until a more opportune time presents itself."},{"name":"HOSTAGEA01918","text":"Please, you must inform Lady Laniaitte. We've not been hurt, and they've shown no intention of harming us just yet. Tell her not to be rash in coming to our aid."},{"name":"HOSTAGEB01918","text":"It pains me that I cannot tell her myself, but you must find Lady Laniaitte. Tell her that we've been taken prisoner, that we are yet unharmed."},{"name":"HOSTAGEC01918","text":"Lady Laniaitte will surely know what to do. You must return to the Rosehouse and tell her what's become of us."},{"name":"LANIAITTE","text":"Gods be good! Captured by the Vundu!? They've grown bold to reach so far into Zundu territory. I will deploy my men at once and see to their rescue."},{"name":"LANIAITTE","text":"&lt;sigh&gt; This is where they placed men they deemed not fit for the war with dragons. But I'm starting to think we've merely been tossed from one war to another."},{"name":"LANIAITTE","text":"To our benefit, we have an ally in the Zundu. I will have to find a way to thank them properly. You too have my deepest thanks, <span class=\"highlight\">Forename</span>. We'd have lost a great many men by now if not for your help."},{"name":"SONUVANU","text":"You must find three netherlings in Ok' Vundu, before Vundu strike them down like lightning in the night."}],"reward":{"gil":533,"items":[{"id":5677,"one":1},{"id":5672,"one":1},{"id":5667,"one":1},{"id":5632,"one":1}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67183,67455]}},"partials":[{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1013571","obj":{"i":1013571,"n":"Captured Rose Knight","l":2100,"q":1}},{"type":"npc","id":"1013572","obj":{"i":1013572,"n":"Captured Rose Knight","l":2100,"q":1}},{"type":"npc","id":"1013573","obj":{"i":1013573,"n":"Captured Rose Knight","l":2100,"q":1}},{"type":"npc","id":"1013575","obj":{"i":1013575,"n":"Rescued Zundu Youth","l":2100,"q":2}},{"type":"item","id":"5677","obj":{"i":5677,"n":"Savage Might Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Determination","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5632","obj":{"i":5632,"n":"Piety Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"67183","obj":{"i":67183,"n":"Bolt, Chain, and Island","g":3,"l":"The Sea of Clouds","s":72}},{"type":"quest","id":"67455","obj":{"i":67455,"n":"Not Free as a Bird","g":97,"l":"The Sea of Clouds","s":5708}}]}