{"quest":{"name":"Not Free as a Bird","location":"The Sea of Clouds","id":67455,"patch":3.0,"sort":5708,"eventIcon":71221,"issuer":1013574,"target":1013575,"genre":97,"journal":["This Zundu youth needs someone to set him free.","A poor Ok' Zundu Vanu has been captured by hostile Garlean forces. He says that one of the nearby troops may be carrying the key to his manacles. Slay the troops until you find the required key.","After a series of fierce battles, none of the troops have the key you require. Continue engaging the troops until you find the one that carries the key to the troubled Vanu Vanu's freedom.","Finally one of the imperial troops gives up the key to the captured Vanu Vanu's manacles. Use the feather key on the captured Zundu youth to free him from his imprisonment.","The captured Zundu youth is grateful for your rescue, but hastily returns to his home, lest he get captured again. Return to Ok' Zundu and speak with the now-rescued Zundu youth to make sure he has recovered from his ordeal.","The Zundu youth once again thanks you for your courageous rescue, and informs you that the Zundu chieftain has requested that you go speak with him."],"objectives":["Obtain the feather key from the Garlean troops.","Use the feather key to free the captured Zundu youth.","Speak to the rescued Zundu youth near the entrance to Ok' Zundu. "],"dialogue":[{"name":"PRISONERVANUA01919","text":"Zephyr winds bring netherling to help! Please, netherling, shatter manacles as lightning breaks rocks into pebbles!"},{"name":"PRISONERVANUA01919","text":"If netherling possess not the strength to break manacles, then black-armored netherlings certainly carry key─find it so I can return home!"},{"name":"PRISONERVANUA01919","text":"Black-armored netherlings carry many rings which sound out like falling rain─find key which leads to my freedom!"},{"name":"PRISONERVANUA01919","text":"Finally I can return home on wings of freedom! Thank you, netherling. Meet again at Ok' Zundu─may zephyr winds guide you!"},{"name":"PRISONERVANUB01918","text":"Black-armored netherlings become bold as hungry endymion in recent days. Netherling deserves gratitude of whole Zundu tribe!"},{"name":"PRISONERVANUB01918","text":"Ah, yes... When giving report to chieftain of my return, chieftain says he wishes to speak with netherling. Best not keep chieftain waiting, his anger would scare even morning sun!"}],"reward":{"gil":840,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67183,67456]},"next":[67454]},"partials":[{"type":"npc","id":"1013574","obj":{"i":1013574,"n":"Captured Zundu Youth","l":2100,"q":1}},{"type":"npc","id":"1013575","obj":{"i":1013575,"n":"Rescued Zundu Youth","l":2100,"q":2}},{"type":"quest","id":"67183","obj":{"i":67183,"n":"Bolt, Chain, and Island","g":3,"l":"The Sea of Clouds","s":72}},{"type":"quest","id":"67456","obj":{"i":67456,"n":"For Your Spies Only","g":97,"l":"The Sea of Clouds","s":5707}},{"type":"quest","id":"67454","obj":{"i":67454,"n":"On Wings of Vanu","g":97,"l":"The Sea of Clouds","s":5709}}]}