{"quest":{"name":"Lazing Saddles","location":"The Sea of Clouds","id":67451,"patch":3.0,"sort":5714,"icon":100481,"eventIcon":71221,"issuer":1014173,"target":1014173,"involved":[1014175,1014177],"genre":97,"journal":["Gunu Vanu is running out of ideas to borrow for his rite of passage.","Gunu Vanu has only one more family member to copy for his rite of passage─his brother, whose offering was to display his skill at riding the traditional Vanu mount, a sanuwa. Gunu Vanu, as always, has a shortcut in mind for this trial. Meet him at the Blue Window to hear his plans.","Gunu Vanu presents you with some leather reins that he claims will make any tame sanuwa obey your every order. He points out one such sanuwa positioned conveniently nearby. It may not be the ideal choice of prey however, since its owner stands nearby and will likely not give up the steed without a fight. Nonetheless, since no alternative target presents itself, use the leather reins on the battle-trained sanuwa and hope for the best.","After using the reins on the sanuwa, its current owner rightly attacks you, leaving you with no choice but to defend yourself. Retrieve the borrowed sanuwa.","You have retrieved the sanuwa. Return to Gunu Vanu and tell him of the noble deed you have performed.","Gunu Vanu once again shows his courage by answering the sudden and conveniently timed summons of the elder shaman. Although you did not hear the call, Gunu Vanu is already yalms ahead of you. Catch up with him to see what he has planned.","The elder rejects Gunu Vanu's suggestion that teaching you the art of sanuwa catching is a proper offering. Of course, Gunu Vanu cannot be blamed for not knowing the intricacies of his own culture, and the elder offers to give him one last chance."],"objectives":["Speak with Gunu Vanu at the Blue Window.","Use the leather reins on the battle-trained sanuwa.","Calm down the battle-trained sanuwa.","Report to Gunu Vanu.","Speak with Gunu Vanu."],"dialogue":[{"name":"GUNUVANU","text":"Gunu Vanu knows not what to offer to elder next. Only one idea can Gunu Vanu think of, but fills heart with fear darker than blackest storm cloud! Netherling remembers Gunu Vanu's brother, yes?"},{"name":"GUNUVANU","text":"Brother completes rite of passage by soaring on wings of sanuwa, mounts which Vanu ride to traverse wind currents. No other choices left to Gunu Vanu─he must do as Brother does!"},{"name":"GUNUVANU","text":"But Gunu Vanu raises not his own sanuwa, and to tame wild sanuwa more difficult than to quell summer monsoon! And Gunu Vanu can do neither..."},{"name":"GUNUVANU","text":"But netherling's strength can lay low the White Himself! Netherling helps capture sanuwa, and Gunu Vanu mounts it to show he too holds sway over the forces of nature!<br><br>Netherling worries not─Gunu Vanu, as always, plans out every step. Meet at the Blue Window. Gunu Vanu goes ahead for netherling's safety!"},{"name":"SYSTEM","text":"The sanuwa gazes coldly in your direction."},{"name":"GUNUVANU","text":"Ah, netherling comes at last! Gunu Vanu brings something that helps capture sanuwa, makes it obey like newborn nestling. Behold, sanuwa reins!"},{"name":"GUNUVANU","text":"But, wild sanuwa fierce as monsoon rains─even netherling cannot hope to capture wild beast. But, use these reins on already <span class=\"emphasis\">tame</span> sanuwa and it obeys all commands."},{"name":"GUNUVANU","text":"Gunu Vanu cares not to show elder shaman how to capture sanuwa, but to ride sanuwa gracefully as seed floating on gentle breeze. Once elder sees Gunu Vanu flit elegantly along wind currents, how sanuwa is captured matters not! Even elder could not make more perfect plan!"},{"name":"GUNUVANU","text":"Look, netherling, trained sanuwa is near. Gunu Vanu knows task is dangerous, will not judge if netherling wants to quit. But if netherling finds courage welling within, bring sanuwa here once beast calms down!"},{"name":"GUNUVANU","text":"No Vanu expects to ride wild sanuwa. But use reins on <span class=\"emphasis\">tame</span> sanuwa and it obeys all commands!"},{"name":"VANUMOBA01915","text":"What netherling dares steal my dear sanuwa!?"},{"name":"BALOON","text":"Give sanuwa back!"},{"name":"SYSTEM","text":"The sanuwa is now calm as the still night air."},{"name":"GUNUVANU","text":"Does netherling capture sanuwa? Or is wrath of beast too great? "},{"name":"GUNUVANU","text":"...Netherling actually catches sanuwa!? <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> strength rivals that of the greatest Zundu warriors. Ah, now I must ride sanuwa..."},{"name":"GUNUVANU","text":"What? Of course Gunu Vanu can ride! Even newborn nestling can ride tame sanuwa! But Gunu Vanu must ask netherling to wait while he remembers lessons..."},{"name":"GUNUVANU","text":"...Gunu Vanu remembers sanuwa fangs jagged like forked lightning, with roar that bellows like looming storm cloud... No! Ah...netherling, Gunu Vanu thinks elder shaman calls! Yes... Let us go see him!"},{"name":"GUNUVANU","text":"Ah, netherling, Gunu Vanu apologizes for making haste to elder shaman's roost. No time to ride wings of sanuwa─but netherling need not worry! Let Gunu Vanu do talking."},{"name":"GUNUVANU","text":"Noble and benevolent elder, humble nestling Gunu Vanu asks again for honor to give offering."},{"name":"AANUVANU","text":"Gunu Vanu comes again, this time with hands empty as sun-scorched desert."},{"name":"GUNUVANU","text":"Ah, but offering stands before elder! Gunu Vanu teaches this netherling ways of taming and handling noble sanuwa!"},{"name":"GUNUVANU","text":"Yes... Gunu Vanu's wisdom and kindness more bountiful than summer rains. With this offering, culture of Ok' Zundu spreads farther than rays of morning sun!"},{"name":"AANUVANU","text":"Gunu Vanu's beguiling tongue may work on fellow nestlings, but Aanu Vanu not fall for tricks. Can Aanu Vanu touch wisdom? Can Aanu Vanu see kindness? Such offering Aanu Vanu does not accept!"},{"name":"GUNUVANU","text":"But, elder, Gunu Vanu still simple nestling, understands not subtle rules of tribe's trial... Fault not on him! For that, elder give Gunu Vanu one more chance!"},{"name":"GUNUVANU","text":"Hmph. Vanu never fly sanuwa if scales slippery as Gunu Vanu's words. Very well, Gunu Vanu has one more chance. But if offering fails once more, then forever nestling he shall remain!"}],"reward":{"gil":684,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67182,67450]},"next":[67452]},"partials":[{"type":"npc","id":"1014173","obj":{"i":1014173,"n":"Gunu Vanu","l":2100,"q":4}},{"type":"npc","id":"1014175","obj":{"i":1014175,"n":"Gunu Vanu","l":2100,"q":1}},{"type":"npc","id":"1014177","obj":{"i":1014177,"n":"Battle-trained Sanuwa","l":2100,"q":1}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}},{"type":"quest","id":"67450","obj":{"i":67450,"n":"Ok' Zundu's Got Talent","g":97,"l":"The Sea of Clouds","s":5713}},{"type":"quest","id":"67452","obj":{"i":67452,"n":"The Black Storm","g":97,"l":"The Sea of Clouds","s":5715}}]}