{"quest":{"name":"Winds of Ill Omen","location":"The Sea of Clouds","id":67453,"patch":3.0,"sort":5706,"eventIcon":71221,"issuer":1012067,"target":1012067,"genre":97,"journal":["Aanu Vanu is gesturing desperately towards the sky in supplication.","Aanu Vanu tells you of cursed totem poles that lie in the Cromlech. Destroy four of them before the darkness they portend falls upon the Vanu Vanu of Ok' Zundu.","The cursed totem poles are nothing but pieces of splintered wood after facing your wrath. Report back to Aanu Vanu to tell him that the deed has been done.","After telling Aanu Vanu of your successful carnage, he goes on to explain that the totem poles in question were used in dark incantations, sullying the memories of the Vanu Vanu ancestors they were meant to memorialize. Allowing such actions to go unpunished would bring ill fortune to the tribe of Zundu."],"objectives":["Slay Vundu totems.","Report to Aanu Vanu."],"dialogue":[{"name":"AANUVANU","text":"Dark winds bode ill for tribe of Zundu. Netherling must help!"},{"name":"AANUVANU","text":"In the Cromlech do cursed totem poles lie. Strike down four of them to stave off the ill fortune they portend."},{"name":"AANUVANU","text":"In the Cromlech, totem poles stand and signify dark days for Zundu. Tear them down and rid Zundu of omen they bear."},{"name":"AANUVANU","text":"Hollow winds blow over Ok' Zundu no longer, fortune of tribe shines bright as sky after thunderstorm. This means netherling rids the island of the cursed totem poles."},{"name":"AANUVANU","text":"Totem poles honor names of great ancestors, so they remain in Vanu Vanu memory like undying sun. To curse a totem pole and possess it with dark magicks sullies memories of tribe's heritage."},{"name":"AANUVANU","text":"Netherling restores some esteem to tribe's ancestors. However, netherling must remain vigilant, for sake of tribe, and all Vanu Vanu."}],"reward":{"gil":684,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"quests":[67183]}},"partials":[{"type":"npc","id":"1012067","obj":{"i":1012067,"n":"Aanu Vanu","l":2100,"q":5}},{"type":"quest","id":"67183","obj":{"i":67183,"n":"Bolt, Chain, and Island","g":3,"l":"The Sea of Clouds","s":72}}]}