{"quest":{"name":"Ok' Zundu's Got Talent","location":"The Sea of Clouds","id":67450,"patch":3.0,"sort":5713,"icon":100481,"eventIcon":71221,"issuer":1014173,"target":1014173,"involved":[1012067,1014174],"genre":97,"journal":["Gunu Vanu has a mischievous glint in his eyes.","Gunu Vanu has hatched a plan to make an offering that would surpass even his own mother's. He will present the elder shaman with Ok' Zundu's freshest, juiciest vegetables, but first he needs you to dance for the elder shaman for as-yet-unknown reasons. Go to Aanu Vanu and show him your finest /dance.","Aanu Vanu seems unexpectedly impressed at your twirling, a nostalgic glow overcoming him. Show him the /dance of your people once again.","Once again you have danced for the elder shaman, and he becomes more affable than ever before. He begins to regale you with a story of his youth before he points out that Gunu Vanu is nowhere to be seen. Most likely he is waiting somewhere with the fruits of his plan. Find him and see what he was plotting.","Gunu Vanu's master plan was to borrow the elder shaman's vegetables, which were being grown in secret for Aanu Vanu's own pleasure. Gunu Vanu leaves to present them to the elder. Follow him there and see if his plan works.","The wise and respected Aanu Vanu is able to see through Gunu Vanu's deception and rejects his offering. However, he agrees to let Gunu Vanu try again on one condition: that none tell Aanu Vanu's wife about the secret supply of vegetables. As the saying in Ok' Zundu goes, “One talon washes the other.”"],"objectives":["/dance for Aanu Vanu.","/dance for Aanu Vanu again.","Report to Gunu Vanu.","Speak with Gunu Vanu."],"dialogue":[{"name":"GUNUVANU","text":"Gunu Vanu must try again, but knows not what satisfies elder shaman. Maybe..."},{"name":"GUNUVANU","text":"Yes, netherling, Gunu Vanu knows! Gunu Vanu follows in Father's path and fails, but next will try Mother's path!"},{"name":"GUNUVANU","text":"Mother offers vegetables unlike any other in Ok' Zundu, quells elder shaman's thunderous hunger. Every moon since Mother's offering, elder shaman asks if she grows more. Gunu Vanu brings vegetables as offering and grows from nestling to adult!"},{"name":"GUNUVANU","text":"Gunu Vanu and netherling face one problem─vegetable's season is moons away. Plant seeds now and stalks grow slender as new moon. Luckily, Gunu Vanu plans ahead!"},{"name":"GUNUVANU","text":"First, netherling must <span class=\"highlight\">dance</span> in front of elder, show him your culture. Dance until wind goes from lungs, then meet Gunu Vanu under shade of our first meeting. Now go─dance like sun never rises again!"},{"name":"AANUVANU","text":"Gunu Vanu up to old tricks again..."},{"name":"AANUVANU","text":"Netherling needs something from Aanu Vanu? Does Gunu Vanu shirk his duties in favor of sleep again?"},{"name":"AANUVANU","text":"Aanu Vanu busy with ceremony preparations, no time for netherling's─ah, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> dances as a leaf which flutters in gentle breeze! Netherling's steps soothe Aanu Vanu's weathered bones. Could netherling show more of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> people's dance?"},{"name":"AANUVANU","text":"Netherling, show dance of people once more!"},{"name":"AANUVANU","text":"No, no! Netherling must dance!"},{"name":"AANUVANU","text":"Ah ha ha! Netherling's delicate and airy steps make Aanu Vanu's heart race like summer squall! Almost worthy of Vanu Vanu initiation, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is!"},{"name":"AANUVANU","text":"Dance of Ok' Zundu is tribe's pride, brings all closer to heavens. Since netherling dances for Aanu Vanu, Aanu Vanu dances for netherling!"},{"name":"AANUVANU","text":"Aanu Vanu's dance riles netherling's imagination! Look well, and behold the thunderous dance of Ok' Zundu!"},{"name":"AANUVANU","text":"No need to ask netherling's opinion─expression tells all. Ah...dance reminds Aanu Vanu of nestling days!"},{"name":"AANUVANU","text":"Why, when Aanu Vanu nestling─ Oh? Where is Gunu Vanu?"},{"name":"AANUVANU","text":"Gunu Vanu naps under tree, no doubt..."},{"name":"GUNUVANU","text":"Netherling! Gunu Vanu's plan works perfectly─he knows Aanu Vanu falls into fervor during dance...it seems netherling does, too!"},{"name":"GUNUVANU","text":"Yes...plan is Gunu Vanu's most clever idea! After Mother's offering of vegetables, elder shaman grows own crop. All Gunu Vanu does is sneak silent as midnight moon into elder's hut and..."},{"name":"GUNUVANU","text":"Feast in glory, netherling! Vegetables grow plump and fresh, prove Gunu Vanu too good for nestlings now! Gunu Vanu no longer laughingstock of tribe!"},{"name":"GUNUVANU","text":"...Steal? No, no, netherling─Gunu Vanu <span class=\"emphasis\">borrows</span> vegetables from elder. Netherling, come─now to show offering to elder shaman!"},{"name":"AANUVANU","text":"Gunu Vanu returns to present offering so soon? If Gunu Vanu plans trickery again..."},{"name":"GUNUVANU","text":"Respectful and benevolent elder, Gunu Vanu returns at last! Even waxing moon envies fullness of today's offering!"},{"name":"AANUVANU","text":"Well, well! Gunu Vanu finally makes splendid offering! Vegetables plump and ripe, like first rain cloud of new season. Such treasures rare in Ok' Zundu. But something about these vegetables familiar..."},{"name":"AANUVANU","text":"Ah, yes! Same as Gunu Vanu's mother brings─and Aanu Vanu knows they grow not for many moons. If Gunu Vanu lies again, he accepts failure for trial!"},{"name":"GUNUVANU","text":"Ah, but vegetables come from elder shaman's secret supply. Gunu Vanu thinks elder's wife might also want to know where such ample feast comes from..."},{"name":"AANUVANU","text":"Wait... How does Gunu Vanu know about secret supply!?"},{"name":"GUNUVANU","text":"<span class=\"emphasis\">What</span> secret supply, elder...? Well, since Gunu Vanu fails trial again, then he must return vegetables to elder's wife..."},{"name":"AANUVANU","text":"Wait, Gunu Vanu! If you help keep secret from wife, then failure of trial washes away like tears in rain. Aanu Vanu lets him make one more offering."},{"name":"GUNUVANU","text":"Elder's kindness vast as boundless sky! Gunu Vanu brings even more impressive offering next, elder sees!"}],"reward":{"gil":502,"items":[{"num":5,"id":5790,"one":1},{"num":5,"id":5759,"one":1},{"num":5,"id":5775,"one":1},{"num":5,"id":5793,"one":1},{"num":5,"id":5787,"one":1}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67182,67447]},"next":[67451]},"partials":[{"type":"npc","id":"1014173","obj":{"i":1014173,"n":"Gunu Vanu","l":2100,"q":4}},{"type":"npc","id":"1012067","obj":{"i":1012067,"n":"Aanu Vanu","l":2100,"q":5}},{"type":"npc","id":"1014174","obj":{"i":1014174,"n":"Gunu Vanu","l":2100,"q":1}},{"type":"item","id":"5790","obj":{"i":5790,"n":"Seafog Blue Dye","l":1,"c":22804,"t":55,"p":216}},{"type":"item","id":"5759","obj":{"i":5759,"n":"Shale Brown Dye","l":1,"c":22809,"t":55,"p":216}},{"type":"item","id":"5775","obj":{"i":5775,"n":"Meadow Green Dye","l":1,"c":22810,"t":55,"p":216}},{"type":"item","id":"5793","obj":{"i":5793,"n":"Corpse Blue Dye","l":1,"c":22804,"t":55,"p":216}},{"type":"item","id":"5787","obj":{"i":5787,"n":"Morbol Green Dye","l":30,"c":22810,"t":55,"p":216}},{"type":"quest","id":"67182","obj":{"i":67182,"n":"Black and the White","g":3,"l":"The Sea of Clouds","s":71}},{"type":"quest","id":"67447","obj":{"i":67447,"n":"Growing Pains","g":97,"l":"The Sea of Clouds","s":5712}},{"type":"quest","id":"67451","obj":{"i":67451,"n":"Lazing Saddles","g":97,"l":"The Sea of Clouds","s":5714}}]}