{"quest":{"name":"A Hunter's True Nature","location":"The Dravanian Forelands","id":67462,"patch":3.0,"sort":5706,"icon":100472,"eventIcon":71221,"issuer":1014502,"target":1014508,"involved":[1014503,1014504,1014506,1014507],"genre":98,"journal":["Hervoix has a bone to pick with O'bhen Tia.","With his tasks finally complete, Hervoix decides he will no longer tolerate this treatment from O'bhen Tia, and rushes off to finally say his piece. Follow him and speak with O'bhen Tia to hear what is sure to be a profanity-laced tirade.","Hervoix finally builds up the courage to vent his frustrations to O'bhen Tia, but the chief interrupts the poor hunter and runs off in pursuit of reported outlaws. Nonetheless, Hervoix is determined to get his word in and follows after O'bhen Tia, throwing caution to the wind. Go after Hervoix and make sure he does not fall prey to the cunning outlaws.","You come upon Hervoix as he is being beset on by a renegade hunter. You fell your adversary after a brief skirmish, and Hervoix thanks you for your rescue. Unsurprisingly, you find out this incident was the first time Hervoix had ever been in a fight. Hervoix proceeds deeper into the forest in pursuit of O'bhen Tia─follow him and make sure he is not attacked again.","After following Hervoix's trail, you come upon O'bhen Tia and several other hunters among the remnants of a recently abandoned outlaw camp. Hervoix expresses confusion as to why these hunters have earned the ire of Tailfeather, and in response O'bhen Tia finally elucidates the purpose of the tasks he sent Hervoix out to do. The chocobo hunters of Tailfeather respect the natural balance of the Chocobo Forest, while acknowledging the fact that without the birds, their livelihoods would disappear. As such, they are loath to tolerate hunters that disrupt the delicate order to make easy coin. The tasks assigned by O'bhen Tia were meant to give Hervoix a deeper understanding of the Tailfeather philosophy. Hervoix, surprised at the deep consideration displayed by his chief, accidentally lets slip that it was actually <span class=\"emphasis\">you</span> who performed the tasks O'bhen Tia had requested. However, with any luck, and a large heaping of punishment, Hervoix will be able to use this newfound knowledge to further his growth as a hunter, and possibly find the motivation to complete even the most menial of tasks with his own two hands."],"objectives":["Speak with O'bhen Tia.","Search for Hervoix and rescue him if he is in danger.","Meet with Hervoix."],"dialogue":[{"name":"HERVOIX","text":"Well, looks like I've <span class=\"emphasis\">finally</span> completed the tasks on this list. What in the seven hells was the point of it all..."},{"name":"HERVOIX","text":"To think I ever respected O'bhen Tia. His mind is on the menial and routine, not hunting."},{"name":"HERVOIX","text":"I'll no longer be his bloody lackey. He's about to get a piece of my mind!"},{"name":"HERVOIX","text":"I ain't doing his dirty work any longer. If he wants to keep me on, he's gotta treat me like a hunter!"},{"name":"OBHENTIA","text":"Those...godsdamned..."},{"name":"HERVOIX","text":"Chief! I finished your bloody errands, and I've got something to say! I─"},{"name":"OBHENTIA","text":"I ain't got time to listen to yer prattlin'. A band o' outlaws have been sighted just northwest o' here. Now's our chance to be rid o' them afore they vanish into the woods!"},{"name":"HERVOIX","text":"Outlaws!? And you mean to go after them? But... I've not spoken─"},{"name":"HERVOIX","text":"Godsdammit, there he goes, storming off without listening to a word I have to say. Well, I'll not be ignored so easily. Come on, adventurer, and be on your guard─there's outlaws about!"},{"name":"BALOON","text":"Die, Tailfeather scum!"},{"name":"HERVOIX","text":" &lt;pant&gt; &lt;pant&gt; Adventurer, you have my thanks. I saw the bandit steal upon me, but I've─&lt;pant&gt;─never been in a fight before. You see, I'm a <span class=\"emphasis\">hunter</span>..."},{"name":"HERVOIX","text":"Well, we shouldn't have far to go from here. Follow me, and keep your weapon at the ready!"},{"name":"OBHENTIA","text":"Bloody bastards! Where'd they make off to!?"},{"name":"HERVOIX","text":"Ah, you're here!"},{"name":"OBHENTIA","text":"The godsdamned cowards ran off afore we could give 'em a proper punishment! "},{"name":"HERVOIX","text":"Chief, I've never seen you so livid. What makes these hunters different from us, for you to despise them so? It seems they've been doing more hunting than we have lately..."},{"name":"OBHENTIA","text":"Are ye daft, boy!? These outlaws hunt how they like, and spit on our rules. Rules that're there for a reason. What do you reckon'll happen if we let 'em keep huntin' without consequence? Do ye think chocobos just appear outta thin air?"},{"name":"HERVOIX","text":"The chocobos will... They'll go extinct! By the Twelve! Then what'll we hunt!?"},{"name":"OBHENTIA","text":"What a surprise─ye figured it out all on yer own! We lot are <span class=\"emphasis\">chocobo</span> hunters, and we can't very well hunt somethin' that's not there, can we? "},{"name":"OBHENTIA","text":"Now, huntin's not just about takin' what ye want an' sellin' it for gil. The forest's got a natural balance, one that us hunters've gotta maintain, even if it means doin' the jobs that'll get that pretty coat dirty. If ye can't get that through yer head then yer no better than the outlaws! "},{"name":"HERVOIX","text":"So that's why... Chief, I had no idea!"},{"name":"HERVOIX","text":"It all makes sense now... So all those errands were meant to make me understand..."},{"name":"HERVOIX","text":"I... If I had but known, I wouldn't have asked this adventurer to help me with...<span class=\"emphasis\">everything</span>..."},{"name":"OBHENTIA","text":"What? Ye mean to say ye didn't actually <span class=\"emphasis\">do</span> any of yer work?"},{"name":"HERVOIX","text":"I-I mean...<span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did─ I mean <span class=\"emphasis\">I</span> did..."},{"name":"HERVOIX","text":"Not in the faaace!"}],"reward":{"gil":533,"items":[{"id":8166}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67459,67460]},"next":[67463]},"partials":[{"type":"npc","id":"1014502","obj":{"i":1014502,"n":"Hervoix","l":2000,"q":5}},{"type":"npc","id":"1014508","obj":{"i":1014508,"n":"Hervoix","l":2000,"q":2}},{"type":"npc","id":"1014503","obj":{"i":1014503,"n":"Hervoix","l":2000,"q":2}},{"type":"npc","id":"1014504","obj":{"i":1014504,"n":"O'bhen Tia","l":2000,"q":2}},{"type":"npc","id":"1014506","obj":{"i":1014506,"n":"Hervoix","l":2000,"q":1}},{"type":"npc","id":"1014507","obj":{"i":1014507,"n":"O'bhen Tia","l":2000,"q":2}},{"type":"item","id":"8166","obj":{"i":8166,"n":"Thavnairian Onion","l":70,"c":25203,"t":61}},{"type":"quest","id":"67459","obj":{"i":67459,"n":"Pest Control","g":98,"l":"The Dravanian Forelands","s":5703}},{"type":"quest","id":"67460","obj":{"i":67460,"n":"A Step in the Right Direction","g":98,"l":"The Dravanian Forelands","s":5704}},{"type":"quest","id":"67463","obj":{"i":67463,"n":"Smells Like Team Spirit","g":98,"l":"The Dravanian Forelands","s":5707}}]}