{"quest":{"name":"Smells Like Team Spirit","location":"The Dravanian Forelands","id":67463,"patch":3.0,"sort":5707,"icon":100473,"eventIcon":71221,"issuer":1014507,"target":1011917,"involved":[1014480,1014481,1014484,1014500,1014508,1014511,1014512,1014513,1014514,1014515,1014516,1014517,1014518,1014519,1014520,1014521],"genre":98,"journal":["Hervoix is awaiting his punishment for neglecting his duties.","Before Hervoix gets his dose of punishment from O'bhen Tia, a cry rings out through the forest, seemingly coming from the northeast. O'bhen Tia, suspecting that it may be the outlaws, hurries off in the voice's direction, and Hervoix follows at his heels. Go after the rest of the group to find out who let out the distressed scream.","Northwest of Tailfeather, you find an upset Q'yantaa standing next to a wounded Hudde. It appears the veteran hunter took an arrow in his protégé's stead─an arrow loosed by none other than the exiled Bauricoin. O'bhen Tia will help Hudde return to Tailfeather to be treated. Make your own way back and speak with the others regarding this troubling turn of events.","Upon returning to Tailfeather, you find your old acquaintance Gysol waiting, and he brings disturbing news: Bauricoin waylaid him on his way to Tailfeather, stealing his chocobo hatchling and promising revenge on Q'yantaa and Loupard. Q'yantaa, hot-headed as ever, hastens to Bauricoin's alleged location without considering the possibility of a trap. Both Hervoix and O'bhen Tia follow after her out of fear for her safety. Speak with Loupard to see what the best course of action could be.","Loupard bids you also follow the group in case Bauricoin's trap proves to be overwhelming. Meet up with the hunters to the north of Tailfeather.","Once you catch up to them, you find O'bhen Tia hunched over, apparently a victim of Bauricoin's trap. As you attempt to speak with the wounded O'bhen Tia, you are attacked by two outlaw hunters. Q'yantaa and Hervoix flee from the ambush in pursuit of Bauricoin. Defeat the hunters and save O'bhen Tia.","O'bhen Tia seems more concerned about the two novice hunters than his own wounds, and bids you follow them before they come to harm at Bauricoin's hands. Hurry to the northwest camp.","You arrive at the camp to find that Q'yantaa and Hervoix have somehow managed to subdue and restrain Bauricoin. Q'yantaa demands to know the whereabouts of Gysol's chocobo hatchling, and Bauricoin coldly explains that he cooked the poor bird, justifying his cruel misdeeds by stating that his actions are no different than any of the other hunters in Tailfeather. Q'yantaa hesitates, finally deciding to partake of the chocobo meat prepared by Bauricoin, stating that she is doing it out of respect for the hatchling's sacrifice. She further goes on to explain that the hunters of Tailfeather work to maintain the natural order, while outlaws like Bauricoin only threaten to destroy it. Hervoix seems to finally understand the significance of his chief's philosophy. Q'yantaa will return to Tailfeather to break the tragic news to Gysol, and Hervoix will take Bauricoin to Tailfeather in shackles. Return to Tailfeather and tell Loupard about what happened at the camp.","You return to Tailfeather and rejoin Loupard, Hudde, and O'bhen Tia. Loupard is grateful for your help in getting through this ordeal, and assures you that Bauricoin will not be troubling chocobos any longer. The other hunters reflect upon the incident, and hope that their partners both take away the fact that hunting─and life─does not always have an ideal outcome. Optimistic that everyone will come out of this tragedy a stronger person in the end, Hudde and O'bhen Tia leave to continue their hunting. Loupard thanks you once again, excited about the future growth of the two hunting teams."],"objectives":["Find the source of the voice.","Meet with O'bhen Tia.","Report to Loupard.","Follow O'bhen Tia.","Rescue O'bhen Tia.","Search for Bauricoin.","Report to Loupard."],"dialogue":[{"name":"HERVOIX","text":"To think that the chief actually cared so much about the forest... I've been such a fool..."},{"name":"OBHENTIA","text":"Godsdammit, Hervoix, ye can't even do yer own work!? What am I gonna do with─ Huh, what's that?"},{"name":"OBHENTIA","text":"...Sounded like a scream! It came from the northeast...it better not be the bloody outlaws again!"},{"name":"HERVOIX","text":"Ch-Chief! ...Adventurer, we have to follow him. With me!"},{"name":"HEUDE","text":"It's just...a flesh wound."},{"name":"OBHENTIA","text":"Hudde!? What the hells happened!?"},{"name":"HERVOIX","text":"Th-That's Hudde!"},{"name":"QYANTAA","text":"<span class=\"highlight\">Forename</span>, it's you! Hudde's hurt! Please help him!"},{"name":"HEUDE","text":"I'll be fine, Q'yantaa. It's nothing..."},{"name":"HEUDE","text":"That bastard Bauricoin loosed an arrow at Q'yantaa. A heartbeat later, and she would've... Ugh..."},{"name":"OBHENTIA","text":"Hudde, I'll help ye get back to Tailfeather. That wound needs lookin' at."},{"name":"HERVOIX","text":"Looks like there might be some trouble ahead. Adventurer, come on, let's meet with the others at Tailfeather!"},{"name":"LOUPARD","text":"I've heard all about the mess. Hudde's restin' at the moment, an' he should recover afore long, but it looks like we've got another problem on our hands."},{"name":"QYANTAA","text":"I thought we'd seen the last of Bauricoin..."},{"name":"HERVOIX","text":"I've heard about Bauricoin's misdeeds. Why would he dare to show his face near Tailfeather again?"},{"name":"GYSOL","text":"Is...is Q'yantaa here? I...I need her help..."},{"name":"OBHENTIA","text":"Loupard and Q'yantaa've been tellin' me about this Bauricoin. So he's the bastard what got exiled from Tailfeather a while back? Gods know why he's come back now."},{"name":"LOUPARD","text":"I knew just lettin' him walk away was a bad decision. The blame is mine..."},{"name":"GYSOL","text":"Um... Q'yantaa?"},{"name":"QYANTAA","text":"Oh, is that Gysol!? How've the stables been treating─ What's wrong? You look like a bandersnatch just ate your hatchling."},{"name":"GYSOL","text":"Well, that's not too far from the truth. I...I came to Tailfeather to show you how much my chocobo had grown..."},{"name":"GYSOL","text":"But... Not far from here a man in all black accosted me. He took my chocobo, and said he'd... &lt;sob&gt; He said he'd roast it whole!"},{"name":"GYSOL","text":"&lt;sniffle&gt; Before he left, he said he had a message for you, Q'yantaa, and Loupard... &lt;sniffle&gt; He said he'd be waiting at the northwest camp, and he'd get his...revenge... &lt;sniffle&gt; "},{"name":"QYANTAA","text":"...Bauricoin! It's him! I'll string him up myself! Gysol, we'll get your chocobo back!"},{"name":"HERVOIX","text":"W-Wait! You're just walking into his trap! ...Curses! We have to help her!"},{"name":"OBHENTIA","text":"Bleedin' idiots! They've got heart, but it's like to get 'em killed! Loupard, stay with Gysol─ I ain't lettin' no greenhorns die on my watch!"},{"name":"GYSOL","text":"My...my chocobo..."},{"name":"LOUPARD","text":"Bloody hells! Looks like I got no choice but to leave this to O'bhen Tia. Just the three of them, though..."},{"name":"LOUPARD","text":"<span class=\"highlight\">Forename</span>, they're gonna need your help. Go after them and make sure they don't come to harm!"},{"name":"LOUPARD","text":"Catch up with them afore they fall into Bauricoin's trap!"},{"name":"QYANTAA","text":"Bauricoin! Where the hells are you!?"},{"name":"HERVOIX","text":"Ch-Chief! Can you move!?"},{"name":"OBHENTIA","text":"We walked right into that bastard's trap... He was waitin' for us, an' his arrow got me right in the─"},{"name":"OBHENTIA","text":"Godsdammit, they're still here─Hervoix, Q'yantaa, leave here!"},{"name":"QYANTAA","text":"<span class=\"highlight\">Forename</span>, protect O'bhen Tia! We're going after Bauricoin!"},{"name":"BALOON","text":"Finish 'em off!"},{"name":"BALOON","text":"Kill 'em dead!"},{"name":"OBHENTIA","text":"Those two are too green to be dealin' with the likes o' Bauricoin... They should've gone back to Tailfeather!"},{"name":"OBHENTIA","text":"Follow 'em and make sure they don't get 'emselves killed!"},{"name":"OBHENTIA","text":"Make sure they don't get killed..."},{"name":"HERVOIX","text":"We did it, <span class=\"highlight\">Forename</span>! We got the bastard!"},{"name":"QYANTAA","text":"Seeing as <span class=\"emphasis\">we</span> ain't murderers, I say we hear what he has to say for himself."},{"name":"BAURICOIN","text":"Cut these godsdamned ropes! I won't be bested by a couple of meddling kids!"},{"name":"QYANTAA","text":"Where's Gysol's chocobo!?"},{"name":"BAURICOIN","text":"Haha! You mean that plump, meaty hatchling? I'm as good as my word: I roasted it up with a side of popotoes!"},{"name":"BAURICOIN","text":"You disapprove, do you? Well, you have no right!"},{"name":"BAURICOIN","text":"In case you've forgotten, you're <span class=\"emphasis\">chocobo</span> hunters! Like me, you prey on the dumb birds!"},{"name":"BAURICOIN","text":"To us, chocobos are nothing but a means to survive─don't even think to deny it!"},{"name":"BAURICOIN","text":"Admit it! You didn't drive me out of Tailfeather because you cared about the birds! You just couldn't bear the thought of a hunter making more coin than you!"},{"name":"QYANTAA","text":"Gysol. Your hatchling won't have died in vain."},{"name":"BAURICOIN","text":"Wh-What the hells are you─!? I was right─you're no better than me!"},{"name":"QYANTAA","text":"That's where you're wrong, Bauricoin! To you, this chocobo is nothing but prey to be consumed. But hunters must be thankful towards their quarry, for it is only by their sacrifices that we are able to live. "},{"name":"QYANTAA","text":"Each and every one of these sacrifices demands respect. We hunt not for sport, much less to inflict pain on others. "},{"name":"QYANTAA","text":"That's what separates us from the likes of you. You kill without scruple, without respect, and without conscience. You're nothing but a blight on this delicate landscape, and threaten to destroy its balance."},{"name":"HERVOIX","text":"The chief says to always respect the animals we hunt, because they provide us our livelihood. Do you not see this?"},{"name":"QYANTAA","text":"Gysol... He needs to know what happened to his pet. I'll go and tell him."},{"name":"HERVOIX","text":"And I'll take this scum back to camp."},{"name":"QYANTAA","text":"And that leaves one last thing. <span class=\"highlight\">Forename</span>, go tell Loupard what happened here while we finish with our duties."},{"name":"OBHENTIA","text":"Hervoix's got more pluck than I gave him credit for."},{"name":"HEUDE","text":"Thank you for helping Q'yantaa."},{"name":"LOUPARD","text":"Well, looks like this sordid episode's behind us, thanks to the three of you."},{"name":"LOUPARD","text":"What's gonna happen to Bauricoin, you ask? Let's just say he probably won't be able to bend the bow no more."},{"name":"OBHENTIA","text":"Not that that's gonna bring Gysol's hatchlin' back. Why, I ain't never seen a man wither so fast as when he heard the news. But eventually he pulled himself together and returned home, more determined than ever to take care o' his other birds."},{"name":"HEUDE","text":"Good intent don't keep a man fed. Us hunters know this better than most."},{"name":"LOUPARD","text":"Aye, it's a truth best learnt sooner than later. So long as the two young'uns keep what happened today close to their hearts, they'll go on to make fine hunters."},{"name":"OBHENTIA","text":"Well, it's about time we set off into the forest once more. Adventurer, ye have my thanks for lookin' after my fool of a partner. Let's hope he remembers everythin' he learned while he was with ye."},{"name":"HEUDE","text":"I've spent enough time nursing my wounds, and the hunt awaits me and Q'yantaa. Can't keep my eyes off her for too long─who knows what she'll get up to?"},{"name":"LOUPARD","text":"Well, <span class=\"highlight\">Forename</span>, looks like those two huntin' duos got bright futures ahead of them, thanks to your help. You'll always be welcome in this camp!"}],"reward":{"gil":695,"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67189,67462]}},"partials":[{"type":"npc","id":"1014507","obj":{"i":1014507,"n":"O'bhen Tia","l":2000,"q":2}},{"type":"npc","id":"1011917","obj":{"i":1011917,"n":"Loupard","l":2000,"q":9}},{"type":"npc","id":"1014480","obj":{"i":1014480,"n":"Q'yantaa","l":2000,"q":6}},{"type":"npc","id":"1014481","obj":{"i":1014481,"n":"Q'yantaa","l":2000,"q":3}},{"type":"npc","id":"1014484","obj":{"i":1014484,"n":"Gysol","l":2000,"q":2}},{"type":"npc","id":"1014500","obj":{"i":1014500,"n":"Q'yantaa","l":2000,"q":2}},{"type":"npc","id":"1014508","obj":{"i":1014508,"n":"Hervoix","l":2000,"q":2}},{"type":"npc","id":"1014511","obj":{"i":1014511,"n":"Hudde","l":2000,"q":1}},{"type":"npc","id":"1014512","obj":{"i":1014512,"n":"O'bhen Tia","l":2000,"q":1}},{"type":"npc","id":"1014513","obj":{"i":1014513,"n":"Hervoix","l":2000,"q":1}},{"type":"npc","id":"1014514","obj":{"i":1014514,"n":"O'bhen Tia","l":2000,"q":1}},{"type":"npc","id":"1014515","obj":{"i":1014515,"n":"Hervoix","l":2000,"q":1}},{"type":"npc","id":"1014516","obj":{"i":1014516,"n":"Q'yantaa","l":2000,"q":1}},{"type":"npc","id":"1014517","obj":{"i":1014517,"n":"Hervoix","l":2000,"q":1}},{"type":"npc","id":"1014518","obj":{"i":1014518,"n":"Bauricoin","l":2000,"q":1}},{"type":"npc","id":"1014519","obj":{"i":1014519,"n":"Hervoix","l":2000,"q":1}},{"type":"npc","id":"1014520","obj":{"i":1014520,"n":"Hudde","l":2000,"q":1}},{"type":"npc","id":"1014521","obj":{"i":1014521,"n":"O'bhen Tia","l":2000,"q":1}},{"type":"quest","id":"67189","obj":{"i":67189,"n":"Tataru's Surprise","g":3,"l":"Gridania","s":78}},{"type":"quest","id":"67462","obj":{"i":67462,"n":"A Hunter's True Nature","g":98,"l":"The Dravanian Forelands","s":5706}}]}