{"quest":{"name":"Garbage Duty","location":"The Dravanian Forelands","id":67461,"patch":3.0,"sort":5705,"icon":100472,"eventIcon":71221,"issuer":1014502,"target":1014502,"involved":[1011932,1014505],"genre":98,"journal":["Hervoix doesn't dare get his hands dirty with this next job.","Hervoix shudders visibly as he reads his next task; he is to pick up garbage littered around the northeastern camp. Luckily, in this dark hour, a kindly adventurer happens to be nearby, willing to lend Hervoix a helping hand. Travel to the northeastern camp and speak with Aimebert, who likely has knowledge about the supposed garbage buildup.","Aimebert informs you that while some of the garbage is from the other hunters going through the camp, the large majority of it comes from the brazen outlaws that infest the area. Search the area around the northeast camp for any signs of suspicious characters, and if you find any, make sure they follow the rules of Tailfeather. If by chance you are attacked, defend yourself as best you can.","You find a suspicious-looking hunter standing in front of dozens of empty bottles. Before you have a chance to shed light on his identity, he calls on his henchmen to attack, but they fall before you in short order. Speak with the remaining hunter to find out why he was so hasty in his attack.","After the very convincing argument you had with his henchmen, the remaining outlaw thankfully agrees to be more diligent with his waste management duties. Tell Hervoix that the Chocobo Forest will no longer have to deal with environmentally insensitive miscreants.","Hervoix is disappointed that all you managed to find on your trip were garbage and outlaws, even though there was little reason to expect otherwise. He remains skeptical of the purpose of O'bhen Tia's orders, but prepares for his next task nonetheless."],"objectives":["Speak with Aimebert.","Speak with the outlaw and slay any enemies that attack.","Speak with the outlaw again.","Report to Hervoix."],"dialogue":[{"name":"HERVOIX","text":"There's still work to be done... Well, what's next?"},{"name":"HERVOIX","text":"“Inconsiderate hunters are littering the area near the northeastern camp with their trash. Pick it up.”"},{"name":"HERVOIX","text":"Trash duty!? That's not what I came to this camp for! I'm a <span class=\"emphasis\">hunter</span>, not some simple scullion!"},{"name":"HERVOIX","text":"Well, once again, <span class=\"emphasis\">you</span> look like you aren't doing anything. How'd you like to help beautify the forest?"},{"name":"HERVOIX","text":"Thank the gods, I had just washed my hunter's garb! Well, the notice says the trash is near the northeast camp. Ask Aimebert what he knows of this crisis."},{"name":"HERVOIX","text":"The camp is just to the northeast. Ask Aimebert if he knows anything about the trash littering the area."},{"name":"AIMEBERT","text":"You wanna know about the garbage? Well, with all the hunters comin' through it's bound to get dirty 'round here. I was plannin' on cleanin' up just the other day, but O'bhen Tia stopped me, said to keep it there till he sent someone along."},{"name":"AIMEBERT","text":"'Course, most of the garbage comes from those bloody outlaws. All they care about is catchin' chocobos, beauty of nature an' all that be damned. Been seein' the leftovers of their hunts strewn about more often lately..."},{"name":"AIMEBERT","text":"Say, if you see a hunter what looks like he ain't from Tailfeather, give 'em a shout an' make sure they ain't breakin' any rules. An' if they draw their blades before they open their mouths, well...you know what to do."},{"name":"AIMEBERT","text":"...What's that? Ah, yes, the garbage. Well, might as well pick that up while you're at it. Best of luck to you, adventurer!"},{"name":"AIMEBERT","text":"Don't go attackin' just anyone you think might be an outlaw, all you gotta do is make sure they ain't breakin' any rules. 'Course, if they draw their blades, that's a whole other story."},{"name":"FORRESTROBBERA01925","text":"You...you're that adventurer from Tailfeather! We're done followin' their rules─we hunt how we like!"},{"name":"FORRESTROBBERA01925","text":"Come on, boys, looks like we got some new bait for our traps!"},{"name":"FORRESTROBBERA01925","text":"St-Stop! We surrender! You won't be seein' us 'round this forest no more, just let us─"},{"name":"FORRESTROBBERA01925","text":"What!? Ya mean to say you just want us to pick up our <span class=\"emphasis\">garbage</span>? I... Yes <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>! We'll get right on it! Our apologies for the, uh...mess."},{"name":"FORRESTROBBERA01925","text":"The garbage won't be a problem no more! You can count on that!"},{"name":"HERVOIX","text":"Oh, adventurer! How fares the garbage collection?"},{"name":"HERVOIX","text":"Hmph, so it really <span class=\"emphasis\">was</span> garbage O'bhen Tia meant for me to pick up. I thought maybe that was code for the bait used to lure chocobos..."},{"name":"HERVOIX","text":"What's the chief thinking, pushing all these useless jobs on me? I'm here to learn hunting, not be some bloody errand boy!"},{"name":"HERVOIX","text":"Anyroad, I'm sure the forest's a mite more beautiful thanks to <span class=\"emphasis\">our</span> efforts. We make a good team!"}],"reward":{"gil":602,"items":[{"num":3,"id":8168}],"xp":38400},"reqs":{"jobs":[{"lvl":57,"id":34}],"questsType":"all","quests":[67189,67458]}},"partials":[{"type":"npc","id":"1014502","obj":{"i":1014502,"n":"Hervoix","l":2000,"q":5}},{"type":"npc","id":"1011932","obj":{"i":1011932,"n":"Aimebert","l":2000,"q":4}},{"type":"npc","id":"1014505","obj":{"i":1014505,"n":"Brazen Outlaw","l":2000,"q":1}},{"type":"item","id":"8168","obj":{"i":8168,"n":"Magicked Stable Broom","l":70,"c":59471,"t":61,"p":20000}},{"type":"quest","id":"67189","obj":{"i":67189,"n":"Tataru's Surprise","g":3,"l":"Gridania","s":78}},{"type":"quest","id":"67458","obj":{"i":67458,"n":"Getting a Legtrap Up","g":98,"l":"The Dravanian Forelands","s":5702}}]}