{"quest":{"name":"Community Service","location":"Idyllshire","id":67468,"patch":3.0,"sort":5802,"eventIcon":71221,"issuer":1012133,"target":1012133,"involved":[1013640,1013641,1013642],"genre":101,"journal":["Midnight Dew wishes to learn more of you.","Midnight Dew wants to see how you fit into Idyllshire's burgeoning community. To that end, she bids you work together with a young adventurer currently tasked with moving foodstuffs into Idyllshire's storerooms. Go to him now, and see what you can do.","You find the green adventurer in a slight tizzy. He informs you that the last of the vessels he carried across the settlement had a hole in it, and subsequently he has lost five crabapples. Find these for him now, whilst he repairs the broken urn.","After looking all over, you find the five missing crabapples. Return these slightly dusty fruits now to the young adventurer.","The adventure-dreaming youth takes the crabapples back, and gives you his thanks. Now, report back to Midnight Dew.","Midnight Dew is happy to learn that you aided the inhabitants of Idyllshire, even in a small way. She tells you that all this was a test of sorts, to learn what manner of person you are. However, you have allayed any doubts she may have had, and earned yourself a modicum of respect within the settlement."],"objectives":["Speak with the adventure-dreaming porter.","Obtain ripe crabapples.","Deliver the ripe crabapples to the adventure-dreaming porter.","Report to Midnight Dew."],"dialogue":[{"name":"MIDNIGHTDEW","text":"Don't suppose you could lend me a hand, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"MIDNIGHTDEW","text":"See, Idyllshire's made of mismatched odds and ends, and the fastest way to learn about newcomers is to work with 'em. So I'm of the mind you should pitch in a bit."},{"name":"MIDNIGHTDEW","text":"Ain't a lot of glory in it, but I've got a green adventurer movin' foodstuffs into our storerooms. Go and see if the lad needs help, eh?"},{"name":"MIDNIGHTDEW","text":"Workin' to keep the settlement afloat is hard work more oft than not, but it's worth it. I'm sure the lad yonder would say the same."},{"name":"HOMIE01932","text":"Wha─ Oh, confound it all! I <span class=\"emphasis\">knew</span> that one was a bit too bloody light!"},{"name":"HOMIE01932","text":"Oh, pardon me! I've just discovered there's a crack in the urn I was carrying. I've been dropping crabapples left and right without even knowing it! Could I trouble you to look for them whilst I patch the hole?"},{"name":"HOMIE01932","text":"Carrying food would be easy, I said. Nothing could go wrong, I said. &lt;sigh&gt;"},{"name":"KINDNESSGOBA01932","text":"Pshkohhh... Uplander is looking for crabapples, perhaps? Here, I found this lying on ground. But uplander had better wash it muchly before eating..."},{"name":"KINDNESSGOBB01932","text":"Psssheehee! Young uplander is so funny, carrying heavy urn! He does not see crabapples falling from hole in bottom─plop, plop, plop! Uplander, take this back to him."},{"name":"KINDNESSGOBA01932","text":"Pshkohhh... Even after goodly washing, I would not eat that crabapple..."},{"name":"KINDNESSGOBB01932","text":"Pshkohhh... Ahhh, young uplander─so funny..."},{"name":"HOMIE01932","text":"&lt;sigh&gt; Midnight Dew will have my hide if she learns I mucked up just carrying about crabapples..."},{"name":"HOMIE01932","text":"Oh! One...three... Yes, that's all of them! Thank you, adventurer! Now, what was it that you wanted of me?"},{"name":"HOMIE01932","text":"Hah, so Midnight Dew sent you to help me? Well, I hope I'll have cause to help you in return. That is the way of Idyllshire, after all."},{"name":"HOMIE01932","text":"Hmmm... How do I patch this urn?"},{"name":"MIDNIGHTDEW","text":"From what I've heard of how you helped out that lad, adventurer, I'm thinkin' you'll do just fine here. Sorry for testin' you without tellin' you."},{"name":"MIDNIGHTDEW","text":"When me and mine first got here, it took us a while to find a rhythm. But afore long, we were the best of friends with the gobbies. Now, we're as dedicated as them to buildin' this place into a proper town."},{"name":"MIDNIGHTDEW","text":"And if you're willin' to pitch in, it don't much matter where you're from or what brought you here. Long as you help out, you're good in my book, and the gobbies'."}],"reward":{"gil":475,"items":[{"id":10807,"one":1,"hq":1},{"id":10891,"one":1,"hq":1},{"id":10933,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"quests":[67191]}},"partials":[{"type":"npc","id":"1012133","obj":{"i":1012133,"n":"Midnight Dew","l":2082,"q":12}},{"type":"npc","id":"1013640","obj":{"i":1013640,"n":"Adventure-dreaming Porter","l":2082,"q":2}},{"type":"npc","id":"1013641","obj":{"i":1013641,"n":"Spirited Goblin","l":2082,"q":1}},{"type":"npc","id":"1013642","obj":{"i":1013642,"n":"Sprightly Goblin","l":2082,"q":1}},{"type":"item","id":"10807","obj":{"i":10807,"n":"Chimerical Felt Cyclas of Aiming","l":145,"c":43277,"t":35,"p":26872}},{"type":"item","id":"10891","obj":{"i":10891,"n":"Chimerical Felt Alb of Healing","l":145,"c":43692,"t":35,"p":17915}},{"type":"item","id":"10933","obj":{"i":10933,"n":"Chimerical Felt Robe of Casting","l":145,"c":43693,"t":35,"p":17915}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67191","obj":{"i":67191,"n":"A Great New Nation","g":3,"l":"The Dravanian Forelands","s":80}}]}