{"quest":{"name":"Feltsmox Switches Bait","location":"Idyllshire","id":67479,"patch":3.0,"sort":5807,"eventIcon":71221,"issuer":1012133,"target":1012133,"involved":[1013644],"genre":101,"journal":["Midnight Dew is too busy to fill all her orders on her own.","Midnight Dew has received an order for a bag of squigglywogs, but she's simply too busy to deliver it. She asks you to take it to Feltsmox, who should be fishing, as usual, at the Thaliak River.","Feltsmox thanks you for the squigglywogs. She has been having terrible luck fishing lately, but these wriggly little tadpoles make such exceptional bait that her luck should start to turn immediately. She gives you a bag of coins in payment─take it back to Midnight Dew.","You return Feltsmox's payment to Midnight Dew. She explains that fishing is a popular pastime amongst goblins, and the resulting demand for squigglywogs is helping her turn a tidy profit. While the goblins plan to settle a town in Idyllshire, Midnight Dew suspects that many goblins are just natural-born wanderers. She doubts it will be long before Feltsmox feels the need to leave the city and travel the realm."],"objectives":["Deliver the squigglywogs to Feltsmox.","Deliver Feltsmox's payment to Midnight Dew."],"dialogue":[{"name":"FELTSMOX","text":"Pshhh... Shkohhh...<br>Not one fishbite all day! What trick can Feltsmox use to catch more fish...?"},{"name":"MIDNIGHTDEW","text":"Would you do me a favor, adventurer? Don't worry, it's naught but a simple delivery. I'm just too busy to handle all my orders on my own."},{"name":"MIDNIGHTDEW","text":"Take this bag of squigglywogs to Feltsmox. You'll most likely find her fishin' out at the Thaliak River. And don't let her worm her way out of payin'─I'm not runnin' a charity here!"},{"name":"MIDNIGHTDEW","text":"Feltsmox'll be down at the Thaliak River, fishin' as usual. Take them squigglywogs down to her─and make sure she pays for 'em!"},{"name":"FELTSMOX","text":"Pshhh... Shkohhh...<br>This time, Feltsmox order top-quality fishingbait! Fish will not be able to resist squirming, wriggling squigglywogs. But Feltsmox waits and waits and order of squigglywogs does not arrive..."},{"name":"FELTSMOX","text":"Pshhh... Shkohhh...<br>You have them! Feltsmox's squigglywogs! Feltsmox shall catch great many fish."},{"name":"FELTSMOX","text":"Thank you for delivering. Please take jinglyshine as payment. Take back to Midnight Dew."},{"name":"FELTSMOX","text":"Feltsmox already pay! Gave good jinglyshine. Take jinglyshine to Midnight Dew."},{"name":"MIDNIGHTDEW","text":"Seems like you didn't have any trouble findin' Feltsmox. You made sure to collect payment, right?"},{"name":"MIDNIGHTDEW","text":"Thank you. I've no idea when I would've found time to deliver that on my own. Fishin's so popular with these gobbies, them squigglywogs sell as fast as I can get my hands on 'em!"},{"name":"MIDNIGHTDEW","text":"The goblins here at Idyllshire plan to settle down here together with us, but I think a lot of 'em are wanderers at heart."},{"name":"MIDNIGHTDEW","text":"I think Feltsmox's a wanderer. She might stay a while, but I figure one day her wanderlust'll get the better of her, and then she'll leave this place behind."}],"reward":{"gil":507,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67192,67470]},"next":[67496]},"partials":[{"type":"npc","id":"1012133","obj":{"i":1012133,"n":"Midnight Dew","l":2082,"q":12}},{"type":"npc","id":"1013644","obj":{"i":1013644,"n":"Feltsmox","l":2001,"q":2}},{"type":"quest","id":"67192","obj":{"i":67192,"n":"Golems Begone","g":3,"l":"Idyllshire","s":81}},{"type":"quest","id":"67470","obj":{"i":67470,"n":"Feltsmox's Reel Problems","g":99,"l":"The Dravanian Hinterlands","s":5804}},{"type":"quest","id":"67496","obj":{"i":67496,"n":"Feltsmox Can't Bear It","g":99,"l":"The Dravanian Hinterlands","s":5805}}]}