{"quest":{"name":"A New Leaf","location":"Idyllshire","id":67477,"patch":3.0,"sort":5806,"eventIcon":71221,"issuer":1012099,"target":1012099,"genre":101,"journal":["Loudjox has run out of wares to sell.","While Loudjox mistakes you for a customer, she realizes that she can part with some gil in exchange for the leaves of narbroois. Make your way to the Makers' Quarter, and slay the sweetly smelling monsters for six of their fragrant fronds.","You strike down a number of narbroois, and tear the leaves from their still bodies. Find your way back to Loudjox with the aromatic prizes.","Loudjox delivers your payment for the leaves, explaining that they are part of a mixture that goblins place in their masks to avoid bad smells. Given your own experiences with goblin aromas, you decline her offer to take a sniff, and instead take your reward for helping the realm smell just a little better."],"objectives":["Collect leaves from narbroois in the Makers' Quarter.","Deliver the narbrooi leaves to Loudjox."],"dialogue":[{"name":"LOUDJOX","text":"Pssshkoh... Loudjox has <span class=\"emphasis\">told</span> you, Loudjox has no more smelling herbs for tod─ Hm? Uplander? You have not come with custom?"},{"name":"LOUDJOX","text":"Uplander <span class=\"emphasis\">wants</span> custom? Hmmm... Loudjox <span class=\"emphasis\">does</span> need six narbrooi leaves for bundle-making of fragrant herbs. From every corpse, uplander can take two leaves─and Loudjox will pay good jinglyshine so we are both happy!"},{"name":"LOUDJOX","text":"Uplander does not know where narbrooi nest? Go to Makers' Quarter─many are floating around there. But make sure monsters are dead first─they are squealing muchly otherwise..."},{"name":"LOUDJOX","text":"Narbrooi make nasty screechings, but their leaves have scent like tastyfresh foods."},{"name":"LOUDJOX","text":"Pssshkoh... Four, five...yes, six full leaves. Thank you uplander. Gobbieflock pack gobbie masks with herbs, keeps nose free of bad smells of bogs and mires. Loudjox can make many bundles, and double jinglyshine!"},{"name":"LOUDJOX","text":"Would uplander like to smell, too? No? Well, then uplander will want questprize. Loudjox is a gobbie of her word─here is jinglyshine for your service!"}],"reward":{"gil":507,"items":[{"id":12842},{"num":3,"id":4750,"one":1},{"num":3,"id":4749,"one":1},{"num":3,"id":4748,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"quests":[67192]}},"partials":[{"type":"npc","id":"1012099","obj":{"i":1012099,"n":"Loudjox","l":2082,"q":3}},{"type":"item","id":"12842","obj":{"i":12842,"n":"Ishgardian Tea","l":130,"c":24408,"t":46}},{"type":"item","id":"4750","obj":{"i":4750,"n":"Mulled Tea","l":49,"c":24405,"t":46,"p":267}},{"type":"item","id":"4749","obj":{"i":4749,"n":"Chamomile Tea","l":24,"c":24406,"t":46}},{"type":"item","id":"4748","obj":{"i":4748,"n":"Pineapple Juice","l":70,"c":24404,"t":46}},{"type":"quest","id":"67192","obj":{"i":67192,"n":"Golems Begone","g":3,"l":"Idyllshire","s":81}}]}