{"quest":{"name":"Sacking the Foe","location":"Idyllshire","id":67475,"patch":3.0,"sort":5804,"eventIcon":71221,"issuer":1012132,"target":1012132,"genre":101,"journal":["Drydox seems to be down in the dumps.","Drydox has lost four bags, each stuffed with her most precious of possessions, and she believes the Illuminati have stolen them. Venture into the Makers' Quarter in the Dravanian hinterlands, and see if you can find Drydox's lost sacks.","After combing through the Makers' Quarter, you find Drydox's cumbersome sacks. When you look inside, however, all you see is junk. Return these so-called treasures to the goblin in Idyllshire.","Drydox is very happy to have her sacks back. It transpires that they are filled with artifacts left by the Sharlayans before their exodus, items that can find new use in Idyllshire. It seems thus that you have done your good deed for the day, and contributed to the small settlement's future."],"objectives":["Obtain the cumbersome sacks in the Makers' Quarter.","Deliver the cumbersome sacks to Drydox."],"dialogue":[{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>Sacks of Drydox are missing, all four. &lt;sniff&gt; So full, so many memories... Drydox pour sweat, blood, and tears into stuffing them..."},{"name":"DRYDOX","text":"&lt;gasp&gt; Drydox knows who is behind this─nasty, thieving Illuminati! They are stealing my precious sacks and taking them to Makers' Quarter! Please, uplander, steal them back!"},{"name":"DRYDOX","text":"Pssshmph! Illuminati steal Drydox's precious sacks, and Drydox have uplander steal them right back!"},{"name":"DRYDOX","text":"Pssshmph! Nerve of Illuminati, thieving sacks of Drydox..."},{"name":"DRYDOX","text":"Shkohhh! No mistaking sacks of Drydox! Yes...yes, yes, not one piece missing or awry!"},{"name":"DRYDOX","text":"Inside sacks? Inside sacks is junk, uplander─but not <span class=\"emphasis\">any</span> junk! These are forgotten relics of Sharlayan uplanders, and their trash is treasure for gobbies! Idyllshire no need new things, will use these again and again instead!"}],"reward":{"gil":639,"items":[{"id":10800,"one":1,"hq":1},{"id":10884,"one":1,"hq":1},{"id":10926,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"quests":[67192]}},"partials":[{"type":"npc","id":"1012132","obj":{"i":1012132,"n":"Drydox","l":2082,"q":8}},{"type":"item","id":"10800","obj":{"i":10800,"n":"Chimerical Felt Cap of Aiming","l":145,"c":40464,"t":34,"p":14469}},{"type":"item","id":"10884","obj":{"i":10884,"n":"Chimerical Felt Klobuk of Healing","l":145,"c":41265,"t":34,"p":14469}},{"type":"item","id":"10926","obj":{"i":10926,"n":"Serpentskin Hat of Casting","l":145,"c":41266,"t":34,"p":18087}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67192","obj":{"i":67192,"n":"Golems Begone","g":3,"l":"Idyllshire","s":81}}]}