{"quest":{"name":"Red Tape","location":"Idyllshire","id":67484,"patch":3.0,"sort":5815,"icon":100482,"eventIcon":71221,"issuer":1014335,"target":1014335,"involved":[1012132,1012287],"genre":101,"journal":["Dripwix is overflowing with ideas for new rules and regulations.","Dripwix has been hard at work formulating new rules and regulations to govern the people of Idyllshire. The first such rule is that meticulous records be kept of all tool rentals. He has prepared a large and comprehensive ledger for recording countless details of each and every tool rental.  While Dripwix concocts yet more rules, take the ledger to Drydox to use for all future tool rentals.","Drydox is less than pleased by these latest bureaucratic developments. She seems to view these complex new rules as a nightmarish, confusing inconvenience. Return to Dripwix and see what new rules the enterprising goblin has come up with.","To address the organizational problems being experienced by the Idyllshire patrol force, Dripwix has drafted an amended map of the area, including formalized boundaries and borders for the area claimed by the goblins. Take this map to Tapklix, such that his troops may know where to patrol and how close the Illuminati may stray before a counteroffensive should be launched.","Tapklix is greatly concerned by the map you deliver to him. He finds its intricacies bafflingly complex and has severe doubts that the goblins he commands will be able to memorize the details of it. Leave him to his worries and let Dripwix know that you have delivered the map as requested.","Dripwix seems satisfied for now that his new rules will address at least some of the more obvious problems that Idyllshire has been experiencing. He expresses his intent to continue looking for problems at the settlement and drafting rules to address them."],"objectives":["Deliver Dripwix's ledger to Drydox.","Speak with Dripwix.","Deliver the redrawn Dravanian hinterlands map to Tapklix.","Report to Dripwix."],"dialogue":[{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Finally, Idyllshire will have rules!"},{"name":"DRIPWIX","text":"First, we need rules for renting tools. Until now, rules for renting borrowthings were too disorganized!"},{"name":"DRIPWIX","text":"Now, all gobbies must write name, reason for borrowing, place to take, and much other information in ledger. Most important is name of borrower."},{"name":"DRIPWIX","text":"Dripwix already prepared ledger. Uplander, please take ledger to Drydox. Dripwix will make more new rules."},{"name":"DRIPWIX","text":"Please take ledger to Drydox. Dripwix will make more new rules."},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>Uplander! Thank you for backtaking pickaxe last time. Can Drydox help you?"},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>All gobbies must use ledger when renting borrowthings!? Nooo... This is too inconvenient. There are too many things to record. This looks difficult and confusing!"},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>This ledger is horrible! Why must we use it? It look so difficult, so confusing..."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>You deliver ledger? Excellent! Now borrowthings will not disappear frequently!"},{"name":"DRIPWIX","text":"Next is rules for watchguards. Dripwix made new map of Idyllshire. Map shows borders of Idyllshire with clearness!"},{"name":"DRIPWIX","text":"With this, all watchguards' problems will be completely solved! Please take map to Tapklix. Dripwix will create more, more rules!"},{"name":"DRIPWIX","text":"Please take map to Tapklix. Map will fix all watchguards' problems."},{"name":"TAPKLIX","text":"Pshhh... Shkohhh...<br>Uplander, thank you for helping gather watchguards before. Can Tapklix help you?"},{"name":"TAPKLIX","text":"Pshhh... Shkohhh...<br>What is this!? It makes Tapklix's eyes hurt!"},{"name":"TAPKLIX","text":"Map's borderlines are too complicated! Gobbies must remember all lines? Tapklix doubts gobbies can remember such complicated map..."},{"name":"TAPKLIX","text":"Pshhh... Shkohhh...<br>Tapklix's eyes still hurt from map..."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Uplander! Welcome back. Watchguards' problems should be now completely fixed."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Dripwix greatly appreciates uplander's hand-lending. Dripwix will look for more problems, will look forward to your help when they are found!"}],"reward":{"gil":539,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67193,67480]},"next":[67485]},"partials":[{"type":"npc","id":"1014335","obj":{"i":1014335,"n":"Dripwix","l":2082,"q":3}},{"type":"npc","id":"1012132","obj":{"i":1012132,"n":"Drydox","l":2082,"q":8}},{"type":"npc","id":"1012287","obj":{"i":1012287,"n":"Tapklix","l":2001,"q":5}},{"type":"quest","id":"67193","obj":{"i":67193,"n":"An Illuminati Incident","g":3,"l":"Idyllshire","s":82}},{"type":"quest","id":"67480","obj":{"i":67480,"n":"The Missing Logbook","g":99,"l":"The Dravanian Hinterlands","s":5812}},{"type":"quest","id":"67485","obj":{"i":67485,"n":"The Golden Rule","g":101,"l":"Idyllshire","s":5816}}]}