{"quest":{"name":"The Missing Logbook","location":"The Dravanian Hinterlands","id":67480,"patch":3.0,"sort":5812,"icon":100482,"eventIcon":71221,"issuer":1014332,"target":1014335,"involved":[1012097],"genre":99,"journal":["Dripwix wants to know why you came looking for him.","Dripwix has been keeping a log of the various problems he has observed in the goblins' newly founded settlement. This would be an invaluable tool in helping address the problems Slowfix has been experiencing, but unfortunately the logbook somehow fell into the hands of the Illuminati. One of the espertype magitek vangobs G-III that patrol the area has it, but Dripwix does not know which one. If you destroy enough of the things, the logbook is bound to turn up.","You have destroyed several magitek vangobs, but are yet to find Dripwix's logbook. He seems quite certain that it was taken by an espertype magitek vangob G-III. Keep destroying them until you find the logbook.","You have finally found Dripwix's logbook. Take it back to the eagerly waiting goblin.","With his logbook safely recovered, Dripwix can now return to Idyllshire and assist Slowfix as requested. Meet up with him at Idyllshire.","In order to address the increasing abundance of problems Idyllshire is experiencing, Dripwix suggests implementing rules to govern the settlement's inhabitants. Slowfix is strongly opposed to the idea, believing that rules would run counter to the principles of freedom and liberty that the settlement was founded on. Eventually he relents when the problems being caused by the settlement's complete lack of laws and procedures are pointed out to him."],"objectives":["Destroy espertype magitek vangobs G-III and obtain Dripwix's log.","Deliver the log to Dripwix.","Speak with Dripwix at Idyllshire."],"dialogue":[{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>The Illuminati anger with too much fastness! Dripwix just try to explain to them: fighting need rules!"},{"name":"DRIPWIX","text":"But uplander, why you here?"},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Slowfix calls for Dripwix? There must be big problem..."},{"name":"DRIPWIX","text":"But Dripwix can't return to Idyllshire yet. Not without logbook. Dripwix finds problems with city and write all in logbook. Many, many problems."},{"name":"DRIPWIX","text":"But Illuminati vangob stole logbook! Dripwix not know which vangob took logbook, but if you destroy many of them, you should find it."},{"name":"DRIPWIX","text":"Please, find magitek vangobs. Destroy many of them and find logbook for Dripwix."},{"name":"DRIPWIX","text":"You still cannot find log? Dripwix is certain thief was vangob... Destroy more of them. One will have log."},{"name":"DRIPWIX","text":"Did you find log for Dripwix?"},{"name":"DRIPWIX","text":"Yes, yes! This is Dripwix's log! Now Dripwix can return home."},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Dripwix is very, very angry. Makes Slowfix scared..."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>This is good timing, uplander. Please, tell this addlebrain!"},{"name":"DRIPWIX","text":"Dripwix explain long ago: nation needs rules! No rules means big problems!"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>This is free nation for free people! Is it not best that we have no rules?"},{"name":"DRIPWIX","text":"You are wrong! Nation has so many problems, you come to Dripwix for hand-lending!"},{"name":"DRIPWIX","text":"You lend tools to gobbies, but have unclear rules for lending and tools go missing!"},{"name":"DRIPWIX","text":"Your watchguards have no rules of how to protect nation. Watchguards are all confused. Nation's borders cannot be protected! No one knows where borders are!"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>S-Slowfix understand. Slowfix understand. Perhaps Idyllshire needs rules."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Dripwix shall create rules. Uplander, we hope you can help us again!"}],"reward":{"gil":765,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67193,67478]},"next":[67484]},"partials":[{"type":"npc","id":"1014332","obj":{"i":1014332,"n":"Dripwix","l":2001,"q":3}},{"type":"npc","id":"1014335","obj":{"i":1014335,"n":"Dripwix","l":2082,"q":3}},{"type":"npc","id":"1012097","obj":{"i":1012097,"n":"Slowfix","l":2082,"q":15}},{"type":"quest","id":"67193","obj":{"i":67193,"n":"An Illuminati Incident","g":3,"l":"Idyllshire","s":82}},{"type":"quest","id":"67478","obj":{"i":67478,"n":"Administrative Difficulties","g":101,"l":"Idyllshire","s":5814}},{"type":"quest","id":"67484","obj":{"i":67484,"n":"Red Tape","g":101,"l":"Idyllshire","s":5815}}]}