{"quest":{"name":"The Vangob Job","location":"Idyllshire","id":67482,"patch":3.0,"sort":5809,"eventIcon":71221,"issuer":1012101,"target":1012101,"genre":101,"journal":["Holepix is fretting about the Illuminati.","Holepix has learned that the Illuminati have made new machines of war, great mechanical men that he fears can bring Idyllshire to heel. To prevent this terrible eventuality, he asks that you launch a preemptive strike by destroying three findertype magitek vangobs G-III near the Arkhitekton in the Dravanian hinterlands.","You find and destroy three findertype magitek vangobs G-III, one after the other. Now that the last of these whirring horrors has fallen, return to Holepix in Idyllshire and give him the good tidings.","Holepix thanks you for your service to Idyllshire, and tells you how the vangobs came to be. The Illuminati laid hands on old Garlean magitek weapons, disassembled and rebuilt them into something even stronger. Though Holepix is impressed by the ingenuity involved, he also knows they will not hesitate to enslave their fellow goblins, and hopes your efforts will forestall the Illuminati."],"objectives":["Slay findertype magitek vangobs G-III near the Arkhitekton.","Report to Holepix."],"dialogue":[{"name":"HOLEPIX","text":"Pshkohhh... Idyllshire is in great danger, uplander! Illuminati have unleashed new vangobs, walk like gobbies but whirl and slash and hurt!"},{"name":"HOLEPIX","text":"They patrol around the Arkhitekton now, but will soon come to make slaves of gobbieflock here! Holepix is begging, uplander─make scrap metal of three Illuminati vangobs!"},{"name":"HOLEPIX","text":"Illuminati will come for gobbieflock of Holepix with fighty-tools and hurtful vangobs! But Idyllshire will not be idle before attack, ask uplander to strike first for us!"},{"name":"HOLEPIX","text":"Pshkohhh... Thank you, uplander, for helping Idyllshire so muchly!"},{"name":"HOLEPIX","text":"Illuminati are learning how to make Garlean magitek into pieces, and remake them into strong vangobs. These are great doings─very terrible, yes, but great."},{"name":"HOLEPIX","text":"But Illuminati make no room in braincases for goodness. Keep secrets to themselves, use their special knowings to make gobbiekin into slaves! Holepix hopes they will learn Idyllshire's strength, and stop trying..."}],"reward":{"gil":670,"items":[{"id":10814,"one":1,"hq":1},{"id":10898,"one":1,"hq":1},{"id":10940,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"quests":[67193]}},"partials":[{"type":"npc","id":"1012101","obj":{"i":1012101,"n":"Holepix","l":2082,"q":2}},{"type":"item","id":"10814","obj":{"i":10814,"n":"Serpentskin Armguards of Aiming","l":145,"c":48518,"t":37,"p":16077}},{"type":"item","id":"10898","obj":{"i":10898,"n":"Chimerical Felt Gloves of Healing","l":145,"c":44377,"t":37,"p":16077}},{"type":"item","id":"10940","obj":{"i":10940,"n":"Serpentskin Dress Gloves of Casting","l":145,"c":44378,"t":37,"p":16077}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67193","obj":{"i":67193,"n":"An Illuminati Incident","g":3,"l":"Idyllshire","s":82}}]}