{"quest":{"name":"Dedean's Doubts","location":"Idyllshire","id":67488,"patch":3.0,"sort":5819,"icon":100483,"eventIcon":71221,"issuer":1012136,"target":1012136,"involved":[1014347,1014348,1014349,1014350],"genre":101,"journal":["Dedean thinks the goblins are brainwashing people and wants to know how they are doing it.","Dedean still seems to think that the goblins of Idyllshire are somehow brainwashing the immigrants that arrive in the settlement. He saw a goblin leading a group of adventurers─who had just arrived in Idyllshire─out towards Saint Mocianne's Arboretum. He has convinced himself that they are being taken there to be brainwashed and is not interested in anything you have to say to the contrary. Maybe if you find out what the goblin and his party of adventurers <span class=\"emphasis\">are</span> doing, you can explain it to this Lalafell and disabuse him of his delusions.","You speak with the adventurers accompanying the goblin and learn that he is simply giving them a thorough and educational guided tour of the area surrounding Idyllshire. Speak next with the goblin himself and confirm that there is nothing even slightly suspicious going on.","The goblin guide does not even know what brainwashing is, much less how to go about doing it. Just as expected, he is simply showing the new arrivals to Idyllshire what they should be aware of as citizens of the settlement. Hopefully this will be enough to assuage Dedean's suspicions.","Dedean still seems unwilling to believe that the goblins are truly kind and friendly. It seems he has had some bad experiences during his time in Ul'dah that led to these unfortunate prejudices."],"objectives":["Speak with the adventurers at Saint Mocianne's Arboretum.","Speak with the goblin guide.","Report to Dedean."],"dialogue":[{"name":"DEDEAN","text":"Everyone here has been brainwashed by these godsdamned goblins! If we want to cure them of this brainwashing, we'll need proof that the goblins are up to no good."},{"name":"DEDEAN","text":"And it just so happens that, mere moments ago, I saw something that might lead to that proof! There was a goblin leading a group of new immigrants out towards Saint Mocianne's Arboretum."},{"name":"DEDEAN","text":"Of course, I'm onto their tricks─I refused his invitation. There's only one reason for him to be taking them out to a deserted place like that. He plans to brainwash them!"},{"name":"DEDEAN","text":"What do you mean you don't think so? Perhaps you should go out there and see for yourself! While you're there, see if you can't find out just how they go about doing this brainwashing."},{"name":"DEDEAN","text":"You still don't believe me that the goblins are brainwashing everyone? Head out to Saint Mocianne's Arboretum and see for yourself!"},{"name":"GOBLIN01952","text":"Pshhh... Shkohhh...<br>I am teaching our new cityfriends all about Idyllshire! Would you like to hear my teachings too, uplander?"},{"name":"NEWCOMERA01952","text":"You want to know what we're doing here? This kind goblin is just showing us the ins and outs of the surrounds of the settlement."},{"name":"NEWCOMERA01952","text":"It seems like there's plenty to do and to see around here. I really appreciate him showing us the highlights!"},{"name":"NEWCOMERA01952","text":"This kind goblin is doing a wonderful job of explaining what there is to do and see around here!"},{"name":"NEWCOMERB01952","text":"You say you are interested to know what is happening here? This goblin is simply giving us a guided tour of Idyllshire and the hinterlands. He has already pointed out to us what is safe and what is not."},{"name":"NEWCOMERB01952","text":"Of course, since we are all adventurers, I'm sure we'll gravitate towards the more dangerous areas─a thirst for danger is in our blood! But in any case, this goblin is doing a marvelous job of explaining every detail of the area. I think we all appreciate it. I know I do."},{"name":"NEWCOMERB01952","text":"This goblin is doing a marvelous job of explaining─in great detail─which parts of the hinterlands are safe and which are not. We all really appreciate the effort he has gone to for us."},{"name":"NEWCOMERC01952","text":"You seem like you want to know what's going on here. You want to know what this goblin is telling us, don't you?"},{"name":"NEWCOMERC01952","text":"Well, just now he was showing us all the best places in the area to make some good gil. I really appreciate the lengths he's gone to. I'll have to pay him back somehow as soon as I can."},{"name":"NEWCOMERC01952","text":"This goblin has really gone out of his way to show us all the best places to make some gil around here. Hopefully I can find a good way to pay him back for this."},{"name":"GOBLIN01952","text":"Pshhh... Shkohhh...<br>Brainwashing? I have no idea how to clean brain! I am just teaching our new cityfriends about Idyllshire! "},{"name":"GOBLIN01952","text":"Dangerous things, yummy things... I am showing them all interesting things near Idyllshire. We love sharing information and knowledge at Idyllshire."},{"name":"GOBLIN01952","text":"I am just teaching our new cityfriends about Idyllshire! Dangerous things, yummy things, interesting things, exciting things... Everything you need to know for happy life in Idyllshire!"},{"name":"DEDEAN","text":"Welcome back, adventurer! Did you save those adventurers from their chilling fate?"},{"name":"DEDEAN","text":"Huh!? It was just a...a guided tour!? There's no way the goblins are that kind. It's suspicious! When we were back in Ul'dah, everyone who seemed nice always turned out to be a right bastard─no exception!"},{"name":"DEDEAN","text":"I bet he was just pretending to be guiding them around. He was waiting for the perfect moment to start brainwashing them, and had to stop once you turned up. Maybe he was...uh... Gods I'm hungry..."}],"reward":{"gil":639,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67486]}},"partials":[{"type":"npc","id":"1012136","obj":{"i":1012136,"n":"Dedean","l":2082,"q":6}},{"type":"npc","id":"1014347","obj":{"i":1014347,"n":"Goblin Guide","l":2001,"q":1}},{"type":"npc","id":"1014348","obj":{"i":1014348,"n":"Curious Adventurer","l":2001,"q":1}},{"type":"npc","id":"1014349","obj":{"i":1014349,"n":"Cautious Adventurer","l":2001,"q":1}},{"type":"npc","id":"1014350","obj":{"i":1014350,"n":"Precocious Adventurer","l":2001,"q":1}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67486","obj":{"i":67486,"n":"The New Arrivals","g":101,"l":"Idyllshire","s":5817}}]}