{"quest":{"name":"A Bum Rap","location":"The Dravanian Hinterlands","id":67483,"patch":3.0,"sort":5802,"eventIcon":71221,"issuer":1012287,"target":1012287,"genre":99,"journal":["Tapklix is muttering to himself and rubbing his rump.","After being attacked by wild beastkin, Tapklix is out for blood. Deliver vengeance vicariously by putting three ratels to death in the Makers' Quarter.","You slay the meanest-looking ratels you can find, and leave their carcasses as a message to the remaining pack. Return to Tapklix at Bigwest Shortstop and inform him the deed is done.","Tapklix is relieved to learn that the hurt dealt his rear─and the injury to his pride─have been avenged. He tells you that monsters came trickling down from the mountains after the Sharlayans left the area, and that he means to see them purged so good folk can live free from fear of attack."],"objectives":["Slay ratels.","Report to Tapklix."],"dialogue":[{"name":"TAPKLIX","text":"Shkohhh... Oooooowww... Nasty ratels, attacking poor Tapklix, biting poor Tapklix on the bum! &lt;sniff&gt; Uplander, kill three, kill three with much fastness!"},{"name":"TAPKLIX","text":"Pssshkoh... Ratels come down from mountains with other beasts. All want to make feast of tender gobbie flesh. But if uplander kills three ratels, maybe others get it into braincases that we are not meat!"},{"name":"TAPKLIX","text":"Pssshkoh... Uplander has slain three ratels, and not suffered injury to rear? Tapklix knew he could trust this to uplander!"},{"name":"TAPKLIX","text":"Many uplanders of Sharlayan leave fifteen years ago, name of the exodus. Wild beasts come down from mountains, make lairs in houses and roosts in rooves. Now, all this is their domain..."},{"name":"TAPKLIX","text":"But gobbieflock want to live here too! Must make safe by purging beasts or driving them back to mountains! Tapklix will yet make this land for all gobbiekin─no matter what it takes!"}],"reward":{"gil":507,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"quests":[67193]}},"partials":[{"type":"npc","id":"1012287","obj":{"i":1012287,"n":"Tapklix","l":2001,"q":5}},{"type":"quest","id":"67193","obj":{"i":67193,"n":"An Illuminati Incident","g":3,"l":"Idyllshire","s":82}}]}