{"quest":{"name":"The Golden Rule","location":"Idyllshire","id":67485,"patch":3.0,"sort":5816,"icon":100482,"eventIcon":71221,"issuer":1012097,"target":1012097,"involved":[1012099,1012132,1012133,1012287,1014335,1014336,1014337,1014338],"genre":101,"journal":["Slowfix is eager to know about the effect of Idyllshire's new rules.","Slowfix wants to know what sort of effect Dripwix's new rules are having in Idyllshire. Ask the inhabitants of Idyllshire and Bigwest Shortstop for their opinions on these new laws and regulations.","After speaking with several residents of Idyllshire, you learn that people are generally dissatisfied with the new rules that Dripwix introduced. They are unnecessarily complex and restrictive and they cause more problems than they solve. Relay this disappointing─if not unsurprising─news to Slowfix.","Upon hearing that his rules were a complete failure, Dripwix becomes upset and leaves, muttering something about redrawing Idyllshire's borders. Concerned about his friend, Slowfix asks you to find Dripwix and pass on a message to the distraught goblin, telling him to meet with Slowfix. If he is redrawing the settlement's borders, he is likely to be near the ill-defined borders with the Illuminati's settlement at the Arkhitekton.","You find Dripwix under attack by the Illuminati. Slay the attackers and aid Dripwix.","You assist Dripwix and relay Slowfix's message. Concerned that the meeting will result in conflict, Dripwix asks you to join him, as a mediator. The meeting will be on the road from the Arkhitekton to the Collectors' Quarter. Rendezvous with him there.","Slowfix reminds Dripwix what prompted them to found the settlement at Idyllshire─the desire for a free and beautiful home for any and all who would choose to live there. As Dripwix begins to realize that his rules are getting in the way of this goal, it is revealed that Slowfix's disregard for the new goblin lending laws has led to a fishing rod going missing. An enraged Dripwix chases his careless friend all the way back to Idyllshire. Meet with them there.","Slowfix explains that his conversation with Dripwix led to the creation of a new, fundamental law for Idyllshire: always respect friends. Though this one rule alone will not solve the settlement's administrative issues, it encapsulates the spirit in which Idyllshire was founded and will form the basis upon which further rules are established."],"objectives":["Gather information at Bigwest Shortstop.","Gather information in Idyllshire.","Speak with Slowfix.","Search for Dripwix near the Arkhitekton.","Aid Dripwix.","Speak with Dripwix.","Speak with Slowfix."],"dialogue":[{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Dripwix's new rules are very, very inconvenient."},{"name":"SLOWFIX","text":"Uplander, please help. Please ask citizens of Idyllshire for opinions of new rules. Slowfix will fetch Dripwix."},{"name":"SLOWFIX","text":"Uplander, please ask Idyllshire citizens for opinions of new rules. Slowfix will fetch Dripwix."},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>Uplander wants to know Drydox's thinking about new rules?"},{"name":"DRYDOX","text":"Renting out tools is now big, big, <span class=\"emphasis\">big</span> pain in sittyparts! We must record much too many details!"},{"name":"DRYDOX","text":"Recordkeeping takes such long time, customers get angry and leave! Every day is less customers. Every day is less jinglyshine!"},{"name":"DRYDOX","text":"Rules make customers leave! Rules mean Slowfix makes no jinglyshine!"},{"name":"TAPKLIX","text":"Pshhh... Shkohhh...<br>You want to know what watchguards think of Dripwix's new maps? Honestly, they are <span class=\"emphasis\">terrible</span>!"},{"name":"TAPKLIX","text":"Borders and lines are too complex, no gobbies can remember them! Watchguards can't watch <span class=\"emphasis\">or</span> guard─they spend whole time looking down at map."},{"name":"TAPKLIX","text":"New maps are terrible─much too complex. Watchguards can't remember borderlines. Watchguards spend mission looking at map, not looking for Illuminati."},{"name":"LOUDJOX","text":"Pshhh... Shkohhh...<br>Dripwix's rules? Things were better before we had rules."},{"name":"LOUDJOX","text":"Before, everyone was free! Now, we can't do anything at all─we must check every rule first. Do we really need these rules?"},{"name":"LOUDJOX","text":"Before rules, gobbies were free. Now, rules stop us doing things. Are rules truly necessary?"},{"name":"MIDNIGHTDEW","text":"Dripwix's rules? There's no simple answer to that question."},{"name":"MIDNIGHTDEW","text":"If it's about if we need rules, I'd say we do. But Dripwix has gone too far. His rules are so complicated, they do naught but cause problems."},{"name":"MIDNIGHTDEW","text":"I think we need rules, but not like what Dripwix has done. I think he's gone too far."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>What does everyone think of Dripwix's rules? Everyone is very helped, yes? Very happy, yes?"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Uplander! We were waiting for you! Please tell us what people think of new rules!"},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Everyone hates new rules!? Dripwix...failed? "},{"name":"DRIPWIX","text":"Th-Then Dripwix must change rules. Dripwix will start with Idyllshire borders. Borders should be redrawn. This time, Dripwix will get rules right!"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Dripwix!<br>...Uplander, Slowfix needs one more hand-lending from you."},{"name":"SLOWFIX","text":"Please find Dripwix. Tell him to meet Slowfix at place where we first had idea. Tell him Slowfix will be waiting for him."},{"name":"SLOWFIX","text":"Uplander, please find Dripwix. Tell him Slowfix will be waiting for him at place where we first had idea."},{"name":"BALLOOON","text":"Reinforcements!? Kill them! Kill!"},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Uplander. You saved Dripwix once again. Dripwix owes you great manythanks."},{"name":"DRIPWIX","text":"Place where we first had idea...? Is Slowfix angry that Dripwix made rules?"},{"name":"DRIPWIX","text":"Uplander, please come with Dripwix. It will definitely, definitely become fight. Please follow, uplander, and be middlethinker."},{"name":"DRIPWIX","text":"Place Slowfix speaks of is on road between here and Collectors' Quarter."},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>View from here is always eye-pleasing."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>S-Slowfix... What do you want?"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Dripwix, do you remember? When we decide here to make free nation for free people."},{"name":"DRIPWIX","text":"Of course. Dripwix remembers. We make wordbond to make beautiful city for everyone."},{"name":"SLOWFIX","text":"Rules that strangle all citizens─that is not beautiful. For citizens of free nation to be free, citizens must <span class=\"emphasis\">feel</span> free!"},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>It seems Dripwix was wrong. Dripwix see only problems and forget wordbond of that day. Slowfix, you should punch Dripwix. Dripwix deserves it."},{"name":"SLOWFIX","text":"That would fix nothing! We must treasure friendship, Dripwix. Slowfix knows to always respect friends."},{"name":"DRIPWIX","text":"Slowfix... If we need any rule, it is that─always respect friends."},{"name":"SLOWFIX","text":"Yes! That will be only rule in Idyllshire. If we obey that rule, we may otherwise do as we want!"},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>Slowfix! One of fishingrod for lending is missing!"},{"name":"DRYDOX","text":"Nothing is written in ledger. Someone took it without asking. Do you know who took it?"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>S-Slowfix borrowed it."},{"name":"SLOWFIX","text":"Slowfix found such great, beautiful fish. Slowfix was in such rush to catch fish, Slowfix quickly just took fishingrod."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Y-You addlebrain! Dripwix is sure we need rules now!"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Slowfix got big shouting at. Perhaps Idyllshire needs <span class=\"emphasis\">some</span> rules after all."},{"name":"SLOWFIX","text":"Dripwix says he will make very basic rules for Idyllshire. He seems very excited. Hopefully he will make good rules this time."},{"name":"SLOWFIX","text":"But for now, we have decided on most important, basic rule: always respect friends."},{"name":"SLOWFIX","text":"Thank you, uplander, for all your help. Thank you."}],"reward":{"gil":539,"items":[{"id":5687,"one":1},{"id":5692,"one":1},{"id":5697,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67193,67484]},"next":[67486]},"partials":[{"type":"npc","id":"1012097","obj":{"i":1012097,"n":"Slowfix","l":2082,"q":15}},{"type":"npc","id":"1012099","obj":{"i":1012099,"n":"Loudjox","l":2082,"q":3}},{"type":"npc","id":"1012132","obj":{"i":1012132,"n":"Drydox","l":2082,"q":8}},{"type":"npc","id":"1012133","obj":{"i":1012133,"n":"Midnight Dew","l":2082,"q":12}},{"type":"npc","id":"1012287","obj":{"i":1012287,"n":"Tapklix","l":2001,"q":5}},{"type":"npc","id":"1014335","obj":{"i":1014335,"n":"Dripwix","l":2082,"q":3}},{"type":"npc","id":"1014336","obj":{"i":1014336,"n":"Dripwix","l":2001,"q":1}},{"type":"npc","id":"1014337","obj":{"i":1014337,"n":"Dripwix","l":2001,"q":1}},{"type":"npc","id":"1014338","obj":{"i":1014338,"n":"Slowfix","l":2001,"q":1}},{"type":"item","id":"5687","obj":{"i":5687,"n":"Gatherer's Guerdon Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Gathering","category":2}}},{"type":"item","id":"5692","obj":{"i":5692,"n":"Gatherer's Guile Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Perception","category":2}}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"quest","id":"67193","obj":{"i":67193,"n":"An Illuminati Incident","g":3,"l":"Idyllshire","s":82}},{"type":"quest","id":"67484","obj":{"i":67484,"n":"Red Tape","g":101,"l":"Idyllshire","s":5815}},{"type":"quest","id":"67486","obj":{"i":67486,"n":"The New Arrivals","g":101,"l":"Idyllshire","s":5817}}]}