{"quest":{"name":"The New Arrivals","location":"Idyllshire","id":67486,"patch":3.0,"sort":5817,"icon":100483,"eventIcon":71221,"issuer":1012133,"target":1012134,"involved":[1012136,1013640,1014341,1014342],"genre":101,"journal":["Midnight Dew seems concerned about two of the new refugees at Idyllshire.","Midnight Dew is concerned about a pair of new refugees in Idyllshire. Notched Bone and Dedean recently arrived in the settlement, but seem to be having difficulty fitting in. She asks you to spend some time with them and make sure they don't cause any problems. She seems to think that, with a little guidance from you, these two refugees will come to enjoy life in Idyllshire.","Notched Bone seems to really dislike living in Idyllshire─so much so that he and Dedean plan to leave and found a new settlement of their own. Since they can't found a new city on their own, they hope to rally other adventurers at Idyllshire to their cause and have prepared flyers which they ask you to help distribute. Find adventurers in Idyllshire and the Answering Quarter and hand out the flyers to them.","You find several adventurers in and around the settlement, but none of them are at all interested in the idea of leaving Idyllshire and its goblins to found a new city. Relay the disappointing news to Notched Bone.","Notched Bone and Dedean are both shocked to discover that none of the other adventurers are interested in leaving Idyllshire. The pair clearly dislike the local goblins and somehow manage to convince themselves that the adventurers have been brainwashed by the goblins."],"objectives":["Speak with Notched Bone.","Deliver Dedean's flyers to adventurers in Idyllshire.","Deliver Dedean's flyers to adventurers in the Answering Quarter.","Report to Notched Bone."],"dialogue":[{"name":"MIDNIGHTDEW","text":"What am I goin' to do about those two... Hm? Oh. I was just thinkin' about a couple of refugees that turned up here recently."},{"name":"MIDNIGHTDEW","text":"This place is pretty unique─it can be hard for new folk to fit in sometimes. Especially for the likes of those two. They've got a few...problems. Spend a few minutes talkin' with 'em and you'll soon see what I mean."},{"name":"MIDNIGHTDEW","text":"Actually, <span class=\"emphasis\">could</span> you talk with 'em for a bit? I think they'd learn a lot from you. Their names are Notched Bone and Dedean. Just keep an eye on 'em─make sure they don't get into any...trouble."},{"name":"MIDNIGHTDEW","text":"Notched Bone and Dedean seem to be havin' trouble settlin' in here at Idyllshire. Try talkin' to 'em for a bit. I'm sure they'll come around eventually. Might just take a little time is all."},{"name":"DEDEAN","text":"You're an adventurer? Maybe you should talk to Notched Bone!"},{"name":"NOTCHEDBONE","text":"Oh! An adventurer! So you don't live 'round here, then. Maybe you'd be able to give us a hand with summat, then."},{"name":"NOTCHEDBONE","text":"We're what you might call refugees of the Calamity. We used to be settled near Ul'dah, but we got tricked by some nasty folk out there and ended up owin' 'em a lot of gil."},{"name":"DEDEAN","text":"We barely made it out of there alive! We've been wandering around from city to town to village since then. Idyllshire was the first place to take us in."},{"name":"NOTCHEDBONE","text":"At first we were just relieved to find a place to stay. But that was 'fore we knew just what sorta place this was. Let's just say: we weren't impressed."},{"name":"NOTCHEDBONE","text":"Anyroad, we were hopin' to gather a few of the other folk around here and head out to find a new place to settle."},{"name":"DEDEAN","text":"So I made flyers inviting the people here to join us in building a new home! "},{"name":"NOTCHEDBONE","text":"Take these flyers to the Answerin' Quarter and hand 'em out to the adventurers there. But only show 'em to adventurers, you hear?"},{"name":"NOTCHEDBONE","text":"Hand them flyers out to the adventurers in the Answerin' Quarter. And we'd prefer if you didn't go tellin' anyone else about this."},{"name":"DEDEAN","text":"You handle the adventurers! We'll handle distributing them to everyone else. Make sure to check the Answering Quarter─I hear there are plenty of adventurers there!"},{"name":"HOMIE01932","text":"Is there something I can help you with?"},{"name":"HOMIE01932","text":"A new home? Sorry, but to tell the truth, I quite like living here. Maybe someone else might be interested."},{"name":"HOMIE01932","text":"Sorry, but I'm really just not interested. I'm quite happy right where I am."},{"name":"CITIZENB0195","text":"It truly is beautiful... Are you here to enjoy the view?"},{"name":"CITIZENB0195","text":"Building a new home? I hadn't really planned on leaving this place any time soon. The goblins really make it an interesting place to live."},{"name":"CITIZENB0195","text":"Sorry, I still have no plans to leave Idyllshire. I quite enjoy living with the goblins."},{"name":"CITIZENC0195","text":"You look like you know how to handle yourself in a fight. Do any of the monsters around here put up a decent fight?"},{"name":"CITIZENC0195","text":"Build a new paradise? Can't say I'm interested, to be honest. I doubt I'll leave the hinterlands till I've seen everything there is to see around here."},{"name":"CITIZENC0195","text":"Still not interested, friend. There's still so much for me to see around these parts."},{"name":"DEDEAN","text":"Nobody even read the flyers! I put so much effort into them..."},{"name":"NOTCHEDBONE","text":"Ah, seems like you've finished handin' out them flyers! I'll bet everyone was jumpin' at the chance to get away from them filthy disgustin' goblins!"},{"name":"NOTCHEDBONE","text":"Wh-What? Why haven't they got any interest in leavin'? ...Though, nobody I spoke to was interested either. It's almost as if they <span class=\"emphasis\">like</span> livin' under goblin rule!"},{"name":"DEDEAN","text":"How could they refuse!? They must have been brainwashed by those godsdamned goblins..."},{"name":"NOTCHEDBONE","text":"I was thinkin' the same thing, Dedean! It's obvious what we've gotta do next, then─cure these people of the goblins' brainwashin'!"}],"reward":{"gil":507,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67485]},"next":[67487,67488]},"partials":[{"type":"npc","id":"1012133","obj":{"i":1012133,"n":"Midnight Dew","l":2082,"q":12}},{"type":"npc","id":"1012134","obj":{"i":1012134,"n":"Notched Bone","l":2082,"q":6}},{"type":"npc","id":"1012136","obj":{"i":1012136,"n":"Dedean","l":2082,"q":6}},{"type":"npc","id":"1013640","obj":{"i":1013640,"n":"Adventure-dreaming Porter","l":2082,"q":2}},{"type":"npc","id":"1014341","obj":{"i":1014341,"n":"Exuberant Adventurer","l":2001,"q":1}},{"type":"npc","id":"1014342","obj":{"i":1014342,"n":"Ill-bred Adventurer","l":2001,"q":1}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67485","obj":{"i":67485,"n":"The Golden Rule","g":101,"l":"Idyllshire","s":5816}},{"type":"quest","id":"67487","obj":{"i":67487,"n":"Notched Bone's Suspicions","g":101,"l":"Idyllshire","s":5818}},{"type":"quest","id":"67488","obj":{"i":67488,"n":"Dedean's Doubts","g":101,"l":"Idyllshire","s":5819}}]}