{"quest":{"name":"Feltsmox Can't Bear It","location":"The Dravanian Hinterlands","id":67496,"patch":3.0,"sort":5805,"eventIcon":71221,"issuer":1013647,"target":1013647,"genre":99,"journal":["Feltsmox is still fishing, same as always...","Feltsmox is still trying to catch a fish and is still having no luck. This time, she suspects the nearby sun bears are the cause of her troubles. She claims they have been coming down into the river, eating some of the fish and scaring the rest away. She asks you to slay four of these bothersome beasts and collect their meat for her.","You put the sun bears down and gather thick slices of bear meat from them. Hopefully any of them that are left learn their lesson and stay away from the river. Deliver the meat to Feltsmox.","Feltsmox thanks you for slaying the bears that have been keeping the fish away. Eager though she is to confirm that the fish have returned─by catching a big fat fish to eat─she is too hungry to wait for a bite, and leaves to eat the sun bear meat you gathered for her."],"objectives":["Slay sun bears and obtain bear meat.","Deliver bear meat to Feltsmox."],"dialogue":[{"name":"FELTSMOX","text":"Pshhh... Shkohhh...<br>Adventurer! Remember Feltsmox? Feltsmox still not catch even one fish! Feltsmox start to become very hungry..."},{"name":"FELTSMOX","text":"Nearby sun bears are reason. They come down to river and eat fish and scare them away!"},{"name":"FELTSMOX","text":"Please slay bothersome sun bears. Slay four bears, bring bearmeat to Feltsmox."},{"name":"FELTSMOX","text":"Sun bears scare fish away, Feltsmox cannot catch supper! Please slay troublesome bears for Feltsmox and bring their meat."},{"name":"FELTSMOX","text":"You kill sun bears? You collect bearmeat for Feltsmox?"},{"name":"FELTSMOX","text":"Pshhh... Shkohhh...<br>Bears are gone, fishingwaters are calm now. Feltsmox want to catch fish, but first fill belly with bearmeat."},{"name":"FELTSMOX","text":"Feltsmox really want to eat fish, but too hungry to wait. Thank you for meat, uplander─first tastymeat for Feltsmox in very long time!"}],"reward":{"gil":539,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67479]},"next":[67497]},"partials":[{"type":"npc","id":"1013647","obj":{"i":1013647,"n":"Feltsmox","l":2001,"q":2}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67479","obj":{"i":67479,"n":"Feltsmox Switches Bait","g":101,"l":"Idyllshire","s":5807}},{"type":"quest","id":"67497","obj":{"i":67497,"n":"Feltsmox Tackles the Morbols","g":99,"l":"The Dravanian Hinterlands","s":5806}}]}