{"quest":{"name":"Mission Unpossible","location":"The Dravanian Hinterlands","id":67495,"patch":3.0,"sort":5808,"eventIcon":71221,"issuer":1013646,"target":1012132,"genre":99,"journal":["Boomshox is keen to finish her fieldwork and return to town.","Boomshox has nearly finished the fieldwork assigned to her by Drydox, but the last item on the list eludes her─she has been instructed to pluck three feathers from the Orn kites that live in the hills behind Saint Mocianne's Arboretum. However, the birds are less keen to part with their feathers than the goblin first imagined. Boomshox begs you to dispatch three of the creatures and pluck their feathers, so that she might finally return to the comfort and safety of Idyllshire.","You dispatch the Orn kites and pluck their feathers, carefully selecting the finest plume from each bird. Boomshox awaits your return to the north of the Answering Quarter.","You deliver the Orn kite feathers to Boomshox, completing her allocation of fieldwork. While she puts her results in order, she asks that you return to Idyllshire ahead of her and inform Drydox of her success.","You report to Drydox, who is amazed that a novice like Boomshox has completed what she believed to be an impossible task. As Boomshox has proven herself to be eminently suited to surveyance, Drydox resolves to entrust all such fieldwork to the novice in future. Just how Boomshox will react to this vote of confidence remains to be seen..."],"objectives":["Defeat Orn kites and collect their feathers.","Deliver the Orn kite feathers to Boomshox.","Report to Drydox in Idyllshire."],"dialogue":[{"name":"BOOMSHOX","text":"Pshhh... Shkohhh...<br>Threetimes is lasttimes, promise! Boomshox nearly finish worklist, but lastlist is unpossible. Boomshox must tailpull feathers from Orn kites, but when tailpull, all Boomshox get is peckeyes!"},{"name":"BOOMSHOX","text":"Boomshox is lovegobbie, not fightgobbie. Will uplander fight Orn kites behind planthouse and tailpull feathers from them? Boomshox need three feathers to finish checkwork, then can finally homego!"},{"name":"BOOMSHOX","text":"All Boomshox need to finish checkwork is three feathers tailpulled from Orn kites. Can uplander tailpull them for Boomshox? Boomshox want to quickfinish and homego!"},{"name":"BOOMSHOX","text":"Boomshox try to tailpull Orn kite feathers, but it's unpossible! For gobbie, anyway─for uplander it is easygame, yes?"},{"name":"BOOMSHOX","text":"Pshhh... Shkohhh...<br>Bigthanks, uplander! Now all checkwork is boxcrossed!"},{"name":"BOOMSHOX","text":"Finally, finally, Boomshox can homego! Boomshox no like checkwork─tinkerwork is much more happytask. Want to go back to safeplace and gearfiddle in notloud!"},{"name":"BOOMSHOX","text":"Boomshox put checkwork straightways, then homego to Idyllshire. Will uplander tell Drydox that checkwork of Boomshox is all done? Bigthanks for bighelp, uplander!"},{"name":"BOOMSHOX","text":"Boomshox will straightmake checkwork, then backbring to Drydox. Will uplander tell Drydox that Boomshox come home soon? Bigthanks, uplander!"},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>Freshface finish all of checkwork? Uplander is sure freshface said <span class=\"emphasis\">all</span> of checkwork?"},{"name":"DRYDOX","text":"Then Boomshox even tailpulls Orn kite feathers!? But...that task was unpossible! Drydox only put it in as laughtask! This is bigfind indeed, uplander─freshface Boomshox is natural-born checkworker!"},{"name":"DRYDOX","text":"From now on, Drydox leave all checkwork to Boomshox and focus on gearfiddling. Thank you for bighelp, uplander!"}],"reward":{"gil":670,"items":[{"id":10986,"one":1,"hq":1},{"id":11010,"one":1,"hq":1},{"id":11034,"one":1,"hq":1},{"id":11058,"one":1,"hq":1},{"id":11082,"one":1,"hq":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67494]}},"partials":[{"type":"npc","id":"1013646","obj":{"i":1013646,"n":"Boomshox","l":2001,"q":3}},{"type":"npc","id":"1012132","obj":{"i":1012132,"n":"Drydox","l":2082,"q":8}},{"type":"item","id":"10986","obj":{"i":10986,"n":"Griffin Talon Ring of Fending","l":145,"c":54580,"t":43}},{"type":"item","id":"11010","obj":{"i":11010,"n":"Griffin Talon Ring of Slaying","l":145,"c":54580,"t":43}},{"type":"item","id":"11034","obj":{"i":11034,"n":"Griffin Talon Ring of Aiming","l":145,"c":54580,"t":43}},{"type":"item","id":"11058","obj":{"i":11058,"n":"Griffin Talon Ring of Healing","l":145,"c":54580,"t":43}},{"type":"item","id":"11082","obj":{"i":11082,"n":"Griffin Talon Ring of Casting","l":145,"c":54580,"t":43}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67494","obj":{"i":67494,"n":"A Slimier Stymier","g":99,"l":"The Dravanian Hinterlands","s":5807}}]}