{"quest":{"name":"Watchcogs","location":"Idyllshire","id":67498,"patch":3.0,"sort":5812,"eventIcon":71221,"issuer":1012100,"target":1012100,"involved":[1013650],"genre":101,"journal":["Woolnix seems anxious.","It transpires that Woolnix's friend is taking longer to gather junk in the Answering Quarter than anticipated. Woolnix himself has grown more worried with every passing bell, and, given that you are there to help, bids that you seek out his comrade.","You speak to the startled goblin, and learn that he was set upon by some mysterious fiend whilst hunting for junk. See what attacked him, and defeat them if necessary.","You walk up the steps, and are greeted by the sight of two Sharlayan mammets, presumably left behind to deter intruders. Though they attack, you repel them with ease, and ensure they will no more trouble travelers. Return to Woolnix's friend, and give him the news.","The goblin is much relieved to learn he will no longer fall under attack from the mammets. He says he will finish his junk hunting, and then return to the Cenotaph. Make your way back there, and give your full report to Woolnix.","Woolnix breathes a sigh of relief upon hearing your tidings, and thanks you for aiding him and his friend."],"objectives":["Speak with the startled goblin in the Answering Quarter.","Slay monsters.","Speak with the startled goblin.","Report to Woolnix."],"dialogue":[{"name":"WOOLKNIX","text":"Pshkohhh... Where is friend of Woolnix? He is only gathering junk in the Answering Quarter, should be back by now..."},{"name":"WOOLKNIX","text":"Oh! Uplander, did you hear tongueflaps of Woolnix? Then can you search for friend? Maybe he is fine, but Woolnix has bad feeling in heart."},{"name":"WOOLKNIX","text":"Friend of Woolnix goes to the Answering Quarter many bells ago, is not coming back."},{"name":"INNEEDGOB01962","text":"Pssshkoh... Where are they coming from, with great glowing eyes? I can no finish junk collecting..."},{"name":"INNEEDGOB01962","text":"Uplander! Here is place of danger! Little monsters are near, trying to poke and stab travelers! Do not go up steps seeking them!"},{"name":"WOOLKNIX","text":"Friend of Woolnix goes to the Answering Quarter many bells ago, is not coming back."},{"name":"INNEEDGOB01962","text":"I am warning uplander to not go up steps! Little monsters there, very mean and tricksy!"},{"name":"BALLOON","text":"dEfEnSe SyStEm OpErAtIoNaL... eXtErMiNaTe...<br>ExTeRmInAtE!"},{"name":"BALLOON","text":"InTrUdEr DeTeCtEd<br>DeStRoY! dEsTrOy!"},{"name":"WOOLKNIX","text":"Friend of Woolnix goes to the Answering Quarter many bells ago, is not coming back."},{"name":"INNEEDGOB01962","text":"Pshkohhh... Uplander has broken monsters? Monsters are not monsters, but mammets of Sharlayan!?"},{"name":"INNEEDGOB01962","text":"&lt;gasp&gt; Thank you, uplander! I can continue junk hunting, will have good haul today! Tell Woolnix I am leaving soon, please!"},{"name":"INNEEDGOB01962","text":"Mammets of Sharlayan will make great junk, can learn muchly from them."},{"name":"WOOLKNIX","text":"Pshkohhh... Uplander has made heart of Woolnix unheavy with this news! Please, take this as thanks for help!"}],"reward":{"gil":507,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"quests":[67194]}},"partials":[{"type":"npc","id":"1012100","obj":{"i":1012100,"n":"Woolnix","l":2082,"q":2}},{"type":"npc","id":"1013650","obj":{"i":1013650,"n":"Startled Goblin","l":2001,"q":1}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}}]}