{"quest":{"name":"Private Investigations","location":"Idyllshire","id":67490,"patch":3.0,"sort":5821,"icon":100483,"eventIcon":71221,"issuer":1012134,"target":1012134,"involved":[1012136,1014352,1014353,1014354,1014355,1014356],"genre":101,"journal":["Notched Bone is convinced he saw a goblin about to get up to no good.","Notched Bone is finally back on his feet after eating the inedible crawler flesh. While incapacitated, he saw a goblin he thought looked extremely suspicious. Since he has not yet fully recovered, he has requested your help in following this goblin. He asks you to meet him and Dedean outside of Idyllshire, in the Answering Quarter. Accompany them on their investigation and make sure they don't cause any problems.","You find Notched Bone and Dedean just outside the city, in the Answering Quarter. They've lost sight of the goblin, but intend to continue southward in the hopes of catching him in some evil act.","In the Answering Quarter, you happen upon a man in no small amount of pain. Notched Bone is sure that the goblins are responsible, but the man insists he was not attacked by them. Notched Bone abandons the man, running back to Idyllshire to plan his next move. Fortunately, the man does not seem to be worried about his own condition, instead expressing concern at Notched Bone's apparent misunderstanding of the situation. Return to Idyllshire and find out what Notched Bone is intending to do next.","Notched Bone has spoken with Dedean and the two both agree that they must abandon their plan of founding a new settlement. They cannot bring themselves to abandon the citizens of Idyllshire, who they see as being under the malevolent influence of the goblins."],"objectives":["Speak with Notched Bone in the Answering Quarter.","Speak with Notched Bone.","Speak with Notched Bone in Idyllshire."],"dialogue":[{"name":"NOTCHEDBONE","text":"Them goblins still have me scratchin' my head. I can't work out what they're plottin'! Givin' us medicine when we're sick... Pretty suspicious, don't you think?"},{"name":"NOTCHEDBONE","text":"Huh? Well <span class=\"emphasis\">I</span> think it's suspicious. Now, speakin' of suspicious, when I was lyin' sick, I saw a mighty suspicious goblin. I'm sure he was up to no good. 'Course, I couldn't move, so I couldn't follow him and find out what he was up to."},{"name":"NOTCHEDBONE","text":"He was headed out in the direction of the Answerin' Quarter. Dedean and I's feelin' better now though, so we was thinkin' we'd follow him. We're not at full strength yet though, so we were wonderin' if you'd come along too...just in case."},{"name":"NOTCHEDBONE","text":"Dedean and I are gonna follow that suspicious goblin I saw, and we was hopin' you might lend us a hand. He was headed in the direction of the Answerin' Quarter."},{"name":"DEDEAN","text":"I'm feeling a lot better now. Thanks again, adventurer."},{"name":"DEDEAN","text":"I feel just like an inspector!"},{"name":"NOTCHEDBONE","text":"The goblin we're interested in is just behind here. I wonder what he's goin' to the Answerin' Quarter for? He's obviously plottin' somethin' evil."},{"name":"NOTCHEDBONE","text":"We'll just keep goin' south, followin' this goblin. Stay close, adventurer. We'll catch him in the act this time!"},{"name":"DEDEAN","text":"Where'd that goblin get to?"},{"name":"CITIZEN01954","text":"Ungh... Oh gods, the pain... It hurts so much."},{"name":"NOTCHEDBONE","text":"Ah, you're here. But I think we was too late."},{"name":"CITIZEN01954","text":"Ungh... The pain..."},{"name":"NOTCHEDBONE","text":"What happened? It don't look like you're bleedin'... Did that goblin do this to you?"},{"name":"CITIZEN01954","text":"Who else would it be? I had nary a clue that he might cause such pain."},{"name":"NOTCHEDBONE","text":"I knew it! So he's attackin' refugees out here in the hinterlands!? That goblin will pay for this!"},{"name":"CITIZEN01954","text":"Wait─no! I...I wasn't attacked!"},{"name":"NOTCHEDBONE","text":"I shudder to think what the goblins are threatenin' you with to have you protectin' 'em like this. But, there ain't no point standin' around here. We have to get back to Idyllshire."},{"name":"CITIZEN01954","text":"Please, worry yourself not with me. Once this pain subsides, I shall have no trouble making my own way back to Idyllshire. I fear you ought be more concerned about that man─he seems to have quite the wrong impression of the situation."},{"name":"DEDEAN","text":"We have to save the people of Idyllshire. We can't let anyone else end up like us!"},{"name":"NOTCHEDBONE","text":"We've had a change of plans. At first I wanted nothin' more than to leave this place and build a new home. But after seein' what the goblins had done to that man, I can't just turn my back on the people here."},{"name":"NOTCHEDBONE","text":"I've talked with Dedean, and we both agree. We've got no choice but to do everythin' in our power to thwart these goblins and their horrible schemes. We can't let anyone get tricked, exploited, and used like we were!"}],"reward":{"gil":670,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67489]},"next":[67491]},"partials":[{"type":"npc","id":"1012134","obj":{"i":1012134,"n":"Notched Bone","l":2082,"q":6}},{"type":"npc","id":"1012136","obj":{"i":1012136,"n":"Dedean","l":2082,"q":6}},{"type":"npc","id":"1014352","obj":{"i":1014352,"n":"Notched Bone","l":2001,"q":2}},{"type":"npc","id":"1014353","obj":{"i":1014353,"n":"Dedean","l":2001,"q":2}},{"type":"npc","id":"1014354","obj":{"i":1014354,"n":"Notched Bone","l":2001,"q":1}},{"type":"npc","id":"1014355","obj":{"i":1014355,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014356","obj":{"i":1014356,"n":"Man In Pain","l":2001,"q":1}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67489","obj":{"i":67489,"n":"Lean and Hungry Gentlemen","g":101,"l":"Idyllshire","s":5820}},{"type":"quest","id":"67491","obj":{"i":67491,"n":"Ancient Goblin Secrets","g":101,"l":"Idyllshire","s":5822}}]}