{"quest":{"name":"A Slimier Stymier","location":"The Dravanian Hinterlands","id":67494,"patch":3.0,"sort":5807,"eventIcon":71221,"issuer":1013646,"target":1013646,"genre":99,"journal":["Boomshox looks as if she is about to dripeyes.","Boomshox's fieldwork has run into difficulties again. Her survey of the northern Answering Quarter complete, she has moved on to studying the area around Saint Mocianne's Arboretum. However, the great morbols occupying the lake in front of the Arboretum doors have brought her work to a halt. She asks you to destroy three of these slimyvines to allow her to resume her studies.","You successfully destroy three great morbols. Return to Boomshox in the north of the Answering Quarter to tell her the good news.","Boomshox thanks you for clearing the way for her continued surveyance of the Answering Quarter. Thanks to your selfless assistance, she will soon be able to finish her fieldwork and return to the town she knows and loves."],"objectives":["Defeat great morbols.","Report to Boomshox."],"dialogue":[{"name":"BOOMSHOX","text":"Uplander, please help! More blockmonsters stop checkwork of Boomshox! Boomshox try to mapmake near planthouse, but bigmouth slimyvines chase away! Will uplander get rid of slimyvines for Boomshox? Three will be plentymuch..."},{"name":"BOOMSHOX","text":"Bigmouth slimyvines in lake outside planthouse stop checkwork of Boomshox. Please chase slimyvines away, uplander!"},{"name":"BOOMSHOX","text":"Pshhh... Shkohhh...<br>Thank you, uplander, thank you! Now Boomshox can mapmake near planthouse without being morbolmunched!"},{"name":"BOOMSHOX","text":"After mapmaking is finished, Boomshox only have to do quick checkwork behind planthouse, then finally can homego to gobbietown!"}],"reward":{"gil":697,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67493]},"next":[67495]},"partials":[{"type":"npc","id":"1013646","obj":{"i":1013646,"n":"Boomshox","l":2001,"q":3}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67493","obj":{"i":67493,"n":"Many Hands Make Light Checkwork","g":101,"l":"Idyllshire","s":5810}},{"type":"quest","id":"67495","obj":{"i":67495,"n":"Mission Unpossible","g":99,"l":"The Dravanian Hinterlands","s":5808}}]}