{"quest":{"name":"Cityfriends","location":"Idyllshire","id":67492,"patch":3.0,"sort":5823,"icon":100484,"eventIcon":71221,"issuer":1012134,"target":1012134,"involved":[1012097,1012136,1014332,1014374,1014375,1014376,1014377,1014378,1014379],"genre":101,"journal":["Notched Bone wants to become an official citizen of Idyllshire.","Notched Bone has decided that, along with Dedean, he wants to become a citizen of Idyllshire. He's not comfortable approaching their leadership after how poorly he has treated the goblins previously, and asks you to speak to Slowfix on his behalf.","You speak with Slowfix, who is more than happy to welcome more citizens into Idyllshire. He also mentions that a letter has arrived for Notched Bone and asks you to deliver it to him.","You deliver the letter to Notched Bone who, curious at who might have sent it, opens it immediately. It is from a moneylender who has tracked him down to Idyllshire. Not wanting to cause problems for the goblins who have been so kind to him, he decides to sneak out of Idyllshire before the moneylender can find him. To this end, he asks you to check the settlement's exit and make sure the man isn't waiting for him there.","The moneylender has already arrived in Idyllshire. Return to Notched Bone and break the bad news.","Notched Bone is still intent on fleeing the city. Dedean, however, wants to ask the people of Idyllshire for help in driving the moneylender away from the settlement. Meet with this force outside in the Collectors' Quarter and see to it that this malicious crook doesn't get his hands on his prey.","Faced with the prospect of having to engage both yourself and the apparently notorious Edred in combat, the moneylender beats a hasty retreat. Before returning to Idyllshire, Slowfix reveals that he has a request he would like to make of you. Return to the settlement and speak with him for more information.","Slowfix hands you a large sealed envelope which he says contains documents pertaining to Notched Bone and Dedean. He needs these papers taken to Dripwix to be signed, but is too busy to do this himself. He asks you to help him by delivering the papers to Dripwix, who is currently on patrol at the Arkhitekton.","Dripwix happily signs the paperwork and returns it to you, asking you to deliver it to Notched Bone back at Idyllshire.","Notched Bone quickly opens the envelope to find signed citizenship papers for both himself and Dedean. Overcome with the joy of finally having found a place to call home after years of being mistreated, he and Dedean vow to repay the goblins for their unrelenting kindness by doing all they can to help Idyllshire grow into a great and bustling metropolis."],"objectives":["Speak with Slowfix.","Deliver the letter to Notched Bone.","Look for the moneylender.","Speak with Notched Bone.","Speak with the moneylender in the Collectors' Quarter.","Speak with Slowfix at Idyllshire.","Deliver the sealed envelope to Dripwix at the Arkhitekton.","Deliver the envelope to Notched Bone."],"dialogue":[{"name":"NOTCHEDBONE","text":"Adventurer! There was one last thing I was hopin' you might be able to lend me a hand with."},{"name":"NOTCHEDBONE","text":"After that goblin massage, I decided I wanna be a citizen of Idyllshire. And I want it to be all official."},{"name":"NOTCHEDBONE","text":"You seem like you're on pretty good terms with the goblins' leaders. Do you think you could talk to Slowfix for me? I still don't feel ready to talk to him face-to-face myself."},{"name":"NOTCHEDBONE","text":"Seein' as how you're on good terms with the goblins' leaders, do you think you might have a word with Slowfix for me about me becomin' an official citizen of Idyllshire?"},{"name":"DEDEAN","text":"I don't think I've ever been this excited in my life! "},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Two new cityfriends? Of course they are welcome! They are very, very welcome!"},{"name":"SLOWFIX","text":"Slowfix will make citizenship papers with great fastness! What are new citizens' names?"},{"name":"SLOWFIX","text":"Notched Bone and Dedean? Slowfix has heard that name before... Notched Bone..."},{"name":"SLOWFIX","text":"Ah! Letter! Letter came for Notched Bone. Uplander, please give letter to Notched Bone."},{"name":"SLOWFIX","text":"Uplander, please take letter to Notched Bone."},{"name":"NOTCHEDBONE","text":"Hey, adventurer. How'd things go with Slowfix?"},{"name":"NOTCHEDBONE","text":"Huh? A letter addressed to me? That can't be right. Who could it be from...?"},{"name":"NOTCHEDBONE","text":"(-Letter Addressed to Notched Bone-)I know where you live now.<br>I'm comin' for my money, and I expect to get back every last gil.<br>You won't be wormin' your way out of it this time."},{"name":"DEDEAN","text":"Ah! Aaah! Aaaaaah! It's the moneylender! How did he find you here?"},{"name":"NOTCHEDBONE","text":"It ain't you he's chasin', Dedean, it's me. I'll run away─you can stay here and live happily with the goblins."},{"name":"DEDEAN","text":"What in the hells are you saying!? We agreed we'd make a new start here, together!"},{"name":"NOTCHEDBONE","text":"I'm sorry, but I don't wanna cause trouble for everyone else here at Idyllshire. Adventurer, could you check the entrance to the city and make sure that moneylender isn't waitin' for me?"},{"name":"NOTCHEDBONE","text":"I'd hate for him to catch me sneakin' out and start a fight."},{"name":"NOTCHEDBONE","text":"Please check the entrance to the city and make sure that moneylender isn't waitin' for me. Just consider it one last favor for me."},{"name":"DEDEAN","text":"Notched Bone can't leave! We agreed we'd stay here in Idyllshire together."},{"name":"LOANSHARK01956","text":"So this is where Notched Bone has been hiding? Hmph, it's so far out of my way, I should wring a little more gil out of him for the trouble."},{"name":"LOANSHARK01956","text":"You live here? You might want to stay away for a bit. Things are likely to get ugly. Heheheheheh."},{"name":"LOANSHARK01956","text":"Ever wonder what a leg sounds like when it snaps? If you don't want to find out, I suggest you make yourself scarce. Heheheheheh."},{"name":"NOTCHEDBONE","text":"H-He's already here? All right then, I'll try and sneak out through the Answerin' Quarter."},{"name":"DEDEAN","text":"Wait! Let us help, Notched Bone. We'll do something. Just─just wait here."},{"name":"DEDEAN","text":"We'll speak with the people of Idyllshire. If we work together, we can chase that filthy moneylender out of town. Come on, let's go."},{"name":"NOTCHEDBONE","text":"If it weren't for me, none of this would have been necessary."},{"name":"DEDEAN","text":"Come on, adventurer! If we all work together, we'll have no trouble chasing that guy out of Idyllshire!"},{"name":"DEDEAN","text":"I asked everyone we know and they were happy to help! Now let's chase this horrible moneylender out of here!"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Notched Bone is friend. Helping friends is most important gobbie rule!"},{"name":"EDRED","text":"Dedean has apprised me of the situation. The moneylender himself is just through here, towards the Collectors' Quarter. Now let us get out there and settle this matter."},{"name":"EDRED","text":"I never thought I would see this man again─not out here in Idyllshire. To think that he is still preying on the weak like this."},{"name":"LOANSHARK01956","text":"Well if it isn't Notched Bone's partner. So he <span class=\"emphasis\">is</span> here after all. Well if he won't show his face himself, I'll have to get my money back from you instead!"},{"name":"DEDEAN","text":"He paid you back everything he borrowed long ago! It's only your ridiculous, unfair interest that's left. ...And besides─he's not here anyway! Isn't that right, everyone!?"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Notched Bone is here. He lives in Idyllshire now!"},{"name":"LOANSHARK01956","text":"Heheheh. You're a wise leader, goblin. You clearly know what could happen to your little settlement if you try to hide Notched Bone from me. Well? Where is he!?"},{"name":"SLOWFIX","text":"Hm? You do not understand. He is one of us now. Most important rule of Idyllshire is to respect friends. Notched Bone is friend, and we will protect him!"},{"name":"LOANSHARK01956","text":"Huh!? Do you have any idea what you're saying? Don't you know who I am?"},{"name":"EDRED","text":"I fear perhaps <span class=\"emphasis\">you</span> don't know who <span class=\"emphasis\">I</span> am. My name is Edred. Perhaps you've heard of me? If you'd like to try your luck against me, be my guest. Who knows─maybe you'll be the first person to put up a decent fight before I put you down."},{"name":"LOANSHARK01956","text":"Ha! You expect me to believe a tale like that? ...Wha─ Wait! I've seen your face before...on the bounty posters! You're Edred!? The White Thunder of Thanalan!?"},{"name":"EDRED","text":"This is a curious city. They call it a free city for free people, and there's everyone from famed mercenaries to assassins to... Well, let's just say that our little group here knows how to handle itself in a fight."},{"name":"SLOWFIX","text":"Yes, yes. We are strong! We will protect Notched Bone! And you must leave!"},{"name":"LOANSHARK01956","text":"And you─you don't look like some ordinary adventurer, either! ...What is this godsforsaken city!?"},{"name":"DEDEAN","text":"We did it! He's gone! Thank you everyone. Thank you so much!"},{"name":"SLOWFIX","text":"All problems are nicely fixed. Uplander, Slowfix have one last request. Please meet Slowfix back at Idyllshire."},{"name":"DEDEAN","text":"We did it! We got rid of that awful moneylender!"},{"name":"NOTCHEDBONE","text":"Hmph. And I'd just finished packin' to leave. But I guess there ain't much point in leavin' now."},{"name":"EDRED","text":"That despicable man makes a living exploiting the disadvantages of refugees like Notched Bone. He is truly the worst kind of scum. I can only imagine how difficult he made Notched Bone's life."},{"name":"SLOWFIX","text":"Pshhh... Shkohhh...<br>Everything was big success! We saved Notched Bone!"},{"name":"SLOWFIX","text":"Please take envelope, uplander. It is very important paperthing for Notched Bone and Dedean!"},{"name":"SLOWFIX","text":"Paperthing needs signature from Dripwix, but Slowfix is too busy to visit him. Please take it to him. He is watchguarding at Arkhitekton. Thank you for hand-lending!"},{"name":"SLOWFIX","text":"Take paperthing to Dripwix. He should be watchguarding at Arkhitekton."},{"name":"DRIPWIX","text":"Pshhh... Shkohhh...<br>Oh! Kind uplander! How can Dripwix help you?"},{"name":"DRIPWIX","text":"Thank you for coming so far! Envelope has important paperthings inside. Now Dripwix has signed them, everything is complete!"},{"name":"DRIPWIX","text":"Take envelope now to Notched Bone and Dedean. We need to make new cityfriends feel welcome!"},{"name":"DRIPWIX","text":"Take envelope to Notched Bone and Dedean. They are still at Idyllshire, Dripwix thinks."},{"name":"DEDEAN","text":"Adventurer! Thank you so much for all your help!"},{"name":"NOTCHEDBONE","text":"Dedean told me all that happened. I'm so grateful for everythin' everyone's done for me. But I've caused so many problems. I think I should just leave. ...Hm? You've got somethin' for me?"},{"name":"NOTCHEDBONE","text":"P-Papers with Dripwix's signature? What─some sort of official documentation? Let's have a look..."},{"name":"NOTCHEDBONE","text":"(-Signed Documentation-)We recognize Notched Bone and Dedean as cityfriends of Idyllshire.<br>City has only one rule they must obey: always respect friends!<br><br>Slowfix Dripwix"},{"name":"DEDEAN","text":"We're...citizens? We've spent so long gettin' kicked out of one city after another. To finally have somewhere to call home... &lt;sob&gt;"},{"name":"NOTCHEDBONE","text":"What do you think you're doin' cryin', you big oaf! You should be doin' somethin' to pay 'em back for their kindness instead!"},{"name":"NOTCHEDBONE","text":"After all this time bein' tricked and betrayed─wanderin' from town to town. And after all the problems we've caused these goblins, they still take us in as friends... I've never been so happy!"},{"name":"NOTCHEDBONE","text":"Make sure to visit again some time, adventurer! Next time you see this city, we'll have made it into a grand and lively city to be proud of!"}],"reward":{"gil":607,"items":[{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67491]}},"partials":[{"type":"npc","id":"1012134","obj":{"i":1012134,"n":"Notched Bone","l":2082,"q":6}},{"type":"npc","id":"1012097","obj":{"i":1012097,"n":"Slowfix","l":2082,"q":15}},{"type":"npc","id":"1012136","obj":{"i":1012136,"n":"Dedean","l":2082,"q":6}},{"type":"npc","id":"1014332","obj":{"i":1014332,"n":"Dripwix","l":2001,"q":3}},{"type":"npc","id":"1014374","obj":{"i":1014374,"n":"Malicious Moneylender","l":2082,"q":1}},{"type":"npc","id":"1014375","obj":{"i":1014375,"n":"Malicious Moneylender","l":2001,"q":1}},{"type":"npc","id":"1014376","obj":{"i":1014376,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014377","obj":{"i":1014377,"n":"Slowfix","l":2001,"q":1}},{"type":"npc","id":"1014378","obj":{"i":1014378,"n":"Edred","l":2001,"q":1}},{"type":"npc","id":"1014379","obj":{"i":1014379,"n":"Edred","l":2082,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67491","obj":{"i":67491,"n":"Ancient Goblin Secrets","g":101,"l":"Idyllshire","s":5822}}]}