{"quest":{"name":"Ancient Goblin Secrets","location":"Idyllshire","id":67491,"patch":3.0,"sort":5822,"icon":100483,"eventIcon":71221,"issuer":1012134,"target":1012134,"involved":[1012136,1014352,1014353,1014357,1014358,1014359,1014360,1014361,1014362,1014363,1014364,1014365,1014366,1014367,1014368,1014369,1014370],"genre":101,"journal":["Notched Bone still wants to follow the suspicious goblin.","Notched Bone has once again seen the same suspicious goblin as before and is still convinced that this goblin is up to no good. He asks you to once again help him follow this goblin, with the aim of catching him in the middle of some heinous act. It seems this Roegadyn won't be convinced of the goblin's innocence until he witnesses it with his own eyes. Meet him in the Answering Quarter and help him see for himself the goblin's true nature.","Notched Bone tells you that the suspicious goblin he saw is traveling down the road southward. Catch up with the Roegadyn further down the road as he stalks his suspect.","Notched Bone tells you that one of the more suspicious items he saw the goblin packing during his preparations back at Idyllshire was a length of rope. He seems quite worried that this goblin may be planning a kidnapping of some sort. Follow Notched Bone further along the road and speak with him again.","The goblin you are following appears to be looking for someone. Seeing the goblin searching for someone in so secluded an area has Notched Bone increasingly convinced that this goblin is up to no good. He still seems to be traveling down the road. Meet with Notched Bone again near the intersection.","You happen upon a number of monsters─slain, apparently, without difficulty. Dedean is worried about the risks of confronting someone capable of dispatching so many beasts with such ease. Notched Bone, however, steels his resolve, concerned for the well-being of the citizens of Idyllshire. The goblin must be headed towards the ruined bridge. Go there and speak again with Notched Bone.","You find the goblin and another man, Edred, and soon get to the bottom of Notched Bone's misunderstanding. In exchange for massages from the goblin, Edred has been slaying Orn kites for their meat. The goblin ties these downed birds into braces with a rope, before performing the effective─but excruciatingly painful─traditional goblin massage techniques on him. Inspired by their cooperation and ashamed of doubting the innocent goblin, Notched Bone affirms his desire to be a citizen of Idyllshire. Confused but ever generous, the goblin eagerly welcomes him with an excruciatingly painful goblin massage.","It is unclear if Notched Bone is in a state of relaxation following the goblin's massage, or in shock from the pain of it. Whichever the case, he is taking some time to rest beneath the bridge. He intends to return to Idyllshire shortly and asks you to meet with him there.","Having finally come to realize how mistaken they have been, Notched Bone and Dedean resolve to become active members of the Idyllshire society. They plan to work hard and repay their debt to the goblins for all the kindness the goblins offered but which they rudely refused. They thank you, especially, for helping them come to this realization about the true nature of the goblins and their generosity."],"objectives":["Speak with Notched Bone in the Answering Quarter.","Speak with Notched Bone.","Speak with Notched Bone again.","Speak with Notched Bone yet again.","Speak with Notched Bone once more.","Speak with Notched Bone one more time.","Speak with Notched Bone in Idyllshire."],"dialogue":[{"name":"NOTCHEDBONE","text":"Adventurer! That evil goblin from before has returned!"},{"name":"NOTCHEDBONE","text":"He came back to Idyllshire, made his preparations for his next heinous crime, and headed straight back out into the hinterlands. With your help, we'll catch him for sure! Meet us in the Answerin' Quarter, just outside the city."},{"name":"NOTCHEDBONE","text":"That horrible goblin is up to somethin' again. And this time, we're gonna get him. Meet us at the Answerin' Quarter."},{"name":"DEDEAN","text":"We're going to get to the bottom of this. Please, help us thwart this goblin's nefarious plans!"},{"name":"DEDEAN","text":"We'll get him this time!"},{"name":"NOTCHEDBONE","text":"Thank you for comin'. The goblin's headin' south down this road. Stick close behind him─but not too close! We can't have him knowin' we're followin' him."},{"name":"DEDEAN","text":"Notched Bone's right. This goblin's definitely up to no good. We might've been fooled by that moneylender back in Ul'dah, but we won't get fooled this time!"},{"name":"GOBLIN01955","text":"Pshhh... Shkohhh...<br>Do you want something? I am sorry, right now, I have something I must see to. Maybe ask another time?"},{"name":"NOTCHEDBONE","text":"Shhh... Just up this road... It's the goblin I saw before. I'm sure he's up to no good. I even saw him packin' a <span class=\"emphasis\">rope</span> back at Idyllshire."},{"name":"NOTCHEDBONE","text":"He must be plannin' to kidnap someone! We should stick close. He's movin' again."},{"name":"DEDEAN","text":"Notched Bone was right. This filthy goblin is just too damn shady!"},{"name":"GOBLIN01955","text":"Pshhh... Shkohhh...<br>He should be near this place... Where has he gone?"},{"name":"NOTCHEDBONE","text":"That goblin's clearly lookin' for summat. Is he searchin' for his prey?"},{"name":"NOTCHEDBONE","text":"There ain't no one else around. If you ask me, this'd be the perfect place to do some crime."},{"name":"DEDEAN","text":"Oh gods, oh gods! Are we going to end up like these poor Orn kites!?"},{"name":"NOTCHEDBONE","text":"L-L-Look at 'em all. Did that little goblin kill 'em all single-handed!?"},{"name":"DEDEAN","text":"Notched Bone, this isn't safe. We shouldn't be here."},{"name":"NOTCHEDBONE","text":"D-D-Don't be such a c-coward! If we don't do summat, what'll happen to the rest of the people in Idyllshire? Come on─we can't let him get away!"},{"name":"DEDEAN","text":"What's he doing, taking someone into a dark, secluded place like this? It's really creepy, but I can't abandon Notched Bone..."},{"name":"EDRED","text":"Owww..."},{"name":"GOBLIN01955","text":"Pshhh... Shkohhh...<br>Don't think I will be gentle just because you are uplander. Please don't struggle."},{"name":"EDRED","text":"(-Suffering Man-)Ungh... Owww! Please... Please, no more!"},{"name":"GOBLIN01955","text":"Pshhh... Shkohhh...<br>Of course it is painful. What do you expect? Don't worry... It will all be over soon."},{"name":"NOTCHEDBONE","text":"W-We've finally caught you in the act! Step away from him, you criminal! What do you think you're playin' at, attackin' this man!?"},{"name":"GOBLIN01955","text":"What!? He asked me to! I give ancient secret goblin massage. Very good for tired body. Painful at first, but feels much, much better after!"},{"name":"NOTCHEDBONE","text":"Massage? Do you really expect me to believe that!?"},{"name":"EDRED","text":"Thank you once more, sir. Your work is truly very painful and somewhat embarrassing... But I'm feeling better already!"},{"name":"DEDEAN","text":"But what about the dead monsters? And what about the rope you were carrying?"},{"name":"EDRED","text":"Dead monsters? ...Ah, I slew those beasts by way of payment. This wonderful masseur told me he'd accept no gil for his work, so in exchange I slew those Orn kites for the dear man to feast upon."},{"name":"GOBLIN01955","text":"Rope is for tying Orn kites into brace! Much easier to carry that way. I am terrible hunter, so Edred's gift is big help for me."},{"name":"EDRED","text":"There was a time when I led a band of vicious, cutthroat bandits, but one day I sustained a severe injury and found myself in no position to continue down that road. So I turned over a new leaf and left the life of crime behind me."},{"name":"EDRED","text":"Thanks to this kind goblin's work, I've recovered tremendously. We are citizens together in the same city─it goes without saying that we would want to work together to make each other's lives better."},{"name":"NOTCHEDBONE","text":"Wait... You're really... This goblin ain't...? So, I was wrong?"},{"name":"NOTCHEDBONE","text":"I'm sorry I was so distrustin'. Please─please accept us as citizens of your city!"},{"name":"GOBLIN01955","text":"What happened!? I am confused! But of course! You are very welcome. All cityfriends are welcome. Idyllshire is free city for free people. Everyone is welcome!"},{"name":"NOTCHEDBONE","text":"Thank you so much... I hope one day we can work together to make each other's lives better."},{"name":"GOBLIN01955","text":"We can start now! I will give you traditional goblin massage! It is quite painful and maybe embarrassing at first, but you will feel much better after!"},{"name":"NOTCHEDBONE","text":"Wait! I'd rather not. I can't... No! Wait, I─ Aaaaaargh!"},{"name":"DEDEAN","text":"Nooo!"},{"name":"DEDEAN","text":"I've never seen Notched Bone scream like that..."},{"name":"EDRED","text":"Should you try a goblin massage, I have no doubt that you will come back for more. I highly recommend you try it."},{"name":"GOBLIN01955","text":"Pshhh... Shkohhh...<br>I am happy to have new friends! I am inspired to work even harder at massage!"},{"name":"NOTCHEDBONE","text":"That hurt more than anythin' I'd ever felt in my life... But I <span class=\"emphasis\">do</span> feel very relaxed and limber. These goblins are pretty amazin'."},{"name":"NOTCHEDBONE","text":"I'm just gonna relax here for a bit. I'll see you back at Idyllshire."},{"name":"NOTCHEDBONE","text":"You head back to Idyllshire without me. I'm just gonna rest for a bit first."},{"name":"DEDEAN","text":"I was completely wrong about the goblins. Notched Bone and I hope to do everything we can to contribute to Idyllshire and try to make up for our misunderstanding."},{"name":"NOTCHEDBONE","text":"I've been livin' in the past, and my judgment was clouded by it. Thank you for stickin' with me and helpin' me see the truth."},{"name":"NOTCHEDBONE","text":"All right, Dedean! Let's get out there and give somethin' back to Idyllshire!"},{"name":"DEDEAN","text":"You got it, Notched Bone!"}],"reward":{"gil":765,"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67490]},"next":[67492]},"partials":[{"type":"npc","id":"1012134","obj":{"i":1012134,"n":"Notched Bone","l":2082,"q":6}},{"type":"npc","id":"1012136","obj":{"i":1012136,"n":"Dedean","l":2082,"q":6}},{"type":"npc","id":"1014352","obj":{"i":1014352,"n":"Notched Bone","l":2001,"q":2}},{"type":"npc","id":"1014353","obj":{"i":1014353,"n":"Dedean","l":2001,"q":2}},{"type":"npc","id":"1014357","obj":{"i":1014357,"n":"Notched Bone","l":2001,"q":1}},{"type":"npc","id":"1014358","obj":{"i":1014358,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014359","obj":{"i":1014359,"n":"Notched Bone","l":2001,"q":1}},{"type":"npc","id":"1014360","obj":{"i":1014360,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014361","obj":{"i":1014361,"n":"Notched Bone","l":2001,"q":1}},{"type":"npc","id":"1014362","obj":{"i":1014362,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014363","obj":{"i":1014363,"n":"Notched Bone","l":2001,"q":1}},{"type":"npc","id":"1014364","obj":{"i":1014364,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014365","obj":{"i":1014365,"n":"Notched Bone","l":2001,"q":1}},{"type":"npc","id":"1014366","obj":{"i":1014366,"n":"Dedean","l":2001,"q":1}},{"type":"npc","id":"1014367","obj":{"i":1014367,"n":"Gangly Goblin","l":2001,"q":1}},{"type":"npc","id":"1014368","obj":{"i":1014368,"n":"Gangly Goblin","l":2001,"q":1}},{"type":"npc","id":"1014369","obj":{"i":1014369,"n":"Gangly Goblin","l":2001,"q":1}},{"type":"npc","id":"1014370","obj":{"i":1014370,"n":"Edred","l":2001,"q":1}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67490","obj":{"i":67490,"n":"Private Investigations","g":101,"l":"Idyllshire","s":5821}},{"type":"quest","id":"67492","obj":{"i":67492,"n":"Cityfriends","g":101,"l":"Idyllshire","s":5823}}]}