{"quest":{"name":"What the Boat Brought In","location":"The Dravanian Hinterlands","id":67500,"patch":3.0,"sort":5809,"eventIcon":71221,"issuer":1013651,"target":1013655,"genre":99,"journal":["Midnight Dew appears to be chewing her perfectly painted lips.","Midnight Dew's comrades have sighted an empty skiff moored along the cliffs to the south, and believe it to be the getaway craft of the thieves who stole her stock. She plans to head south of Saint Mocianne's Arboretum to cut off the bandits from their means of escape, and asks you to meet with her there to help her hunt them down.","You rendezvous with Midnight Dew amid the ruins of the Answering Quarter. With the skiff still empty and no sign of the bandits in the vicinity, she concludes that they must be holed up in the hills. She proposes that you head up into the hills to flush the thieves out while she stands guard against their escape.","You head up into the hills to find the bandits, but the bandits find you first. A pair of burgling blackguards attempt to ambush you in a narrow pass and you are forced to cut them down. Return to Midnight Dew south of Saint Mocianne's Arboretum to inform her of all that befell.","Midnight Dew is pleased to hear that you have brought another two bandits to justice, and relieved that it was an able adventurer like you that fell into their trap, and not one of her goblin comrades. With several bandits still on the loose and half her property still in their hands, she asks that you continue to lend her your invaluable assistance to track down the last of the thieves."],"objectives":["Rendezvous with Midnight Dew south of Saint Mocianne's Arboretum.","Search for the thieves in the western Dravanian hinterlands.","Report to Midnight Dew south of Saint Mocianne's Arboretum."],"dialogue":[{"name":"MIDNIGHTDEW","text":"I've just had word from my crew─they've sighted an empty skiff roped up along the cliffs to the south. The bandits must've been plannin' to lower their loot down into it and sail away into the sunset."},{"name":"MIDNIGHTDEW","text":"The boat's moored south of Saint Mocianne's Arboretum. I'm headin' down there now─are you comin', or what?"},{"name":"MIDNIGHTDEW","text":"The boat's still there, but no sign of the bandits. Chances are they've holed 'emselves up somewhere in the mountains. I'll stay down here and keep lookout. Meanwhile, I'd have you head up into those hills and see if you can flush 'em out!"},{"name":"MIDNIGHTDEW","text":"We've got 'em by the balls now, adventurer! They're up in those hills somewhere, I just know it! Go and see if you can flush 'em out─I'll stay down here and keep watch."},{"name":"BALLOON","text":"Wrong move, sweetheart!"},{"name":"BALLOON","text":"I'll stick this blade where<br>the sun don't shine!"},{"name":"MIDNIGHTDEW","text":"What!? The bandits ambushed you? No offense, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, but I'm glad it was you I sent up into those hills, and not one of my gobbie mates. They wouldn't have lasted five minutes, but you...well, there ain't a scratch on you!"},{"name":"MIDNIGHTDEW","text":"And another two bandits down, eh? That skiff of theirs held eight, so there can't be many left to catch now. Can I count on you to see this through to the end, adventurer?"}],"reward":{"gil":539,"items":[{"id":10709,"one":1,"hq":1},{"id":10751,"one":1,"hq":1},{"id":10793,"one":1,"hq":1},{"id":10877,"one":1,"hq":1},{"num":5,"id":5825,"one":1}],"xp":40800},"reqs":{"jobs":[{"lvl":58,"id":34}],"questsType":"all","quests":[67194,67499]},"next":[67501]},"partials":[{"type":"npc","id":"1013651","obj":{"i":1013651,"n":"Midnight Dew","l":2001,"q":2}},{"type":"npc","id":"1013655","obj":{"i":1013655,"n":"Midnight Dew","l":2001,"q":2}},{"type":"item","id":"10709","obj":{"i":10709,"n":"Adamantite Sabatons of Fending","l":145,"c":47018,"t":38,"p":25724}},{"type":"item","id":"10751","obj":{"i":10751,"n":"Adamantite Sabatons of Maiming","l":145,"c":47019,"t":38,"p":22049}},{"type":"item","id":"10793","obj":{"i":10793,"n":"Serpentskin Boots of Striking","l":145,"c":46526,"t":38,"p":18374}},{"type":"item","id":"10877","obj":{"i":10877,"n":"Serpentskin Boots of Scouting","l":145,"c":46527,"t":38,"p":18374}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67194","obj":{"i":67194,"n":"Leaving Idyllshire","g":3,"l":"Idyllshire","s":83}},{"type":"quest","id":"67499","obj":{"i":67499,"n":"Taking Stock","g":101,"l":"Idyllshire","s":5811,"f":1}},{"type":"quest","id":"67501","obj":{"i":67501,"n":"Over My Dead Gobbie","g":99,"l":"The Dravanian Hinterlands","s":5810}}]}