{"quest":{"name":"A Self-possessed Pastime","location":"Matoya's Cave","id":67505,"patch":3.0,"sort":5904,"icon":100485,"eventIcon":71221,"issuer":1013711,"target":1013711,"genre":99,"journal":["The self-possessed broom needs your help to satisfy his fetish for bridges.","Having revealed to you his obsession for bridges, the self-possessed broom bids you search for what is supposedly the tiniest bridge in the area. According to a little bird he spoke with, the bridge lies along the cliffs to the west.","You have found a tree trunk that is arguably serving as a bridge. Commit the features of this bridge to your memory, that you might describe it to the self-possessed broom.","You have memorized every ilm of the tree trunk. Make your way back to Matoya's Cave and report your discovery to the self-possessed broom.","The self-possessed broom is taken by your description of the tree trunk, and expresses his desire to sweep it one day. In return for your service, he shares with you his knowledge of Matoya's Crystal Eye. Unfortunately, he does not seem to know what his mistress desires..."],"objectives":["Find a wooden bridge in the west of the Dravanian hinterlands.","Examine the wooden bridge.","Report to the self-possessed broom in Matoya's Cave."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"BROOMC","text":"Nam on skees egdelwonk, swish-swish-aroo! But if you desire my knowledge, you must first grant me my heart's desire!"},{"name":"BROOMC","text":"After I finish sweeping, I go outside to dispose of the dust. And every time I do so, I find myself admiring bridges."},{"name":"BROOMC","text":"Fat bridges, skinny bridges, bridges made of rocks. Tough bridges, rickety bridges, even bridges with pigeon flocks. They are unique and fascinating, all."},{"name":"BROOMC","text":"I love to note and compare the differences─colors, sizes, and so forth. The other day, I got to wondering: what is the tiniest bridge in the area?"},{"name":"BROOMC","text":"I spoke with a little bird, and she told me that there's a wooden bridge along the cliffs to the west, that's tinier than anything for malms. If you can find it for me, I will share with you my knowledge!"},{"name":"BROOMC","text":"A little bird told me that there is a wooden bridge along the cliffs to the west, that's tinier than anything for malms. If you can find it for me, I will share with you my knowledge!"},{"name":"SYSTEM","text":"You discover a tree trunk that is arguably serving as a bridge."},{"name":"BROOMC","text":"Snruter rerutnevda evarb eht, swish-swish-aroo! Did you find it? The tiny bridge of which the little bird spoke? Pray describe it to me, that I might behold it in my mind's eye!"},{"name":"BROOMC","text":"Oh my, such a charming little bridge! Though I love big bridges and I cannot lie, there is something to be said for simplicity. I should like to sweep the bridge someday!"},{"name":"BROOMC","text":"As promised, I will share with you such knowledge as I have received from my mistress. That is, the workings of her Crystal Eye!"},{"name":"BROOMC","text":"'Tis the most prized of Mistress Matoya's possessions, allowing her to see such truths as lay hid in the ebb and flow of aether."},{"name":"BROOMC","text":"I wonder if one can see behind the shelves with it... My bristles rustle at the mere thought of all the dust that has collected there."},{"name":"BROOMC","text":"...Oh? You wished only to know what my mistress desires? I am afraid I cannot tell you, for she never imparted that knowledge to me. Sorry to disappoint!"}],"reward":{"gil":641,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67195,67502]}},"partials":[{"type":"npc","id":"1013711","obj":{"i":1013711,"n":"Self-possessed Broom","l":2036,"q":2}},{"type":"quest","id":"67195","obj":{"i":67195,"n":"Matoya's Cave","g":3,"l":"Idyllshire","s":84}},{"type":"quest","id":"67502","obj":{"i":67502,"n":"Saro Roggo's Common Life","g":99,"l":"Matoya's Cave","s":5901,"f":1}}]}