{"quest":{"name":"Saro Roggo's Common Life","location":"Matoya's Cave","id":67502,"patch":3.0,"sort":5901,"icon":100485,"unlocksFunction":1,"eventIcon":71341,"issuer":1012141,"target":1012141,"genre":99,"journal":["Saro Roggo is a picture of nervous energy.","One of Matoya's servants, the poroggo Saro Roggo, has tasked you with eliminating the bugs that are threatening to destroy his mistress's herbs. Examine the medicinal herbs outside Matoya's Cave and dispatch the bugs that appear.","The bugs will bother Matoya's herbs no more. Return to her cave and report your success to Saro Roggo.","Saro Roggo is elated to hear that the herb garden is once again safe from pests. However, his troubles are far from over. As a self-confessed failed creation, he fears that it is only a matter of time before his mistress casts him aside. As such, he wishes to prove himself useful to her, and to this end he bids you speak with the brooms in the cave, that you might learn Matoya's desires."],"objectives":["Examine medicinal herbs and defeat the bugs that appear.","Report to Saro Roggo."],"dialogue":[{"name":"SAROROGGO","text":"Woe is me, ribbit! Mistress Matoya will have my hide!"},{"name":"SAROROGGO","text":"You...you are our guest, and yet you would lend me your aid? Oh, thank you, kind adventurer! I am in your debt!"},{"name":"SAROROGGO","text":"Permit me to introduce myself, ribbit. I am Saro Roggo, a humble servant of Mistress Matoya."},{"name":"SAROROGGO","text":"I am tasked with picking leaves from her herb garden, from which I make her her tea."},{"name":"SAROROGGO","text":"Alas, drawn to their medicinal properties, bugs have recently taken to ravaging the herbs."},{"name":"SAROROGGO","text":"I attempted to get rid of the pests, but they are too much for a lone poroggo to handle. I would be grateful if you could eliminate them in my stead, ribbit."},{"name":"SAROROGGO","text":"The herb garden is right outside the cave. Please hurry and eliminate the bugs, ribbit!"},{"name":"SAROROGGO","text":"The bugs are no more? Oh, thank you! Not only are you kind, but you are strong as well, ribbit!"},{"name":"SAROROGGO","text":"Now I can resume my duties again: harvesting and making tea. It is all I am capable of..."},{"name":"SAROROGGO","text":"I'm a failed creation, you see. Unlike my mistress's other children, I'm incompetent and clumsy."},{"name":"SAROROGGO","text":"For want of a task I could perform, she bade me serve her tea seven times daily. But even in this, I needed assistance, ribbit..."},{"name":"SAROROGGO","text":"Unless I make myself more useful, 'tis only a matter of time before my mistress removes my enchantment. Then I would revert to an ordinary toad, incapable of speech. I cannot bear the thought of that."},{"name":"SAROROGGO","text":"I must become a better servant, and I believe that I can do so...if only I knew what my mistress desires. Having received of her blessing, the brooms here are bound to possess this knowledge. Alas, they refuse to talk to me."},{"name":"SAROROGGO","text":"But as you are our guest, they cannot willfully ignore you, even if they are not entirely cooperative or forthright. Please speak with them, ribbit, and acquire the information I need to survive!"}],"reward":{"gil":577,"aetherCurrent":1,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"quests":[67195]},"next":[67503,67504,67505]},"partials":[{"type":"npc","id":"1012141","obj":{"i":1012141,"n":"Saro Roggo","l":2036,"q":3}},{"type":"quest","id":"67195","obj":{"i":67195,"n":"Matoya's Cave","g":3,"l":"Idyllshire","s":84}},{"type":"quest","id":"67503","obj":{"i":67503,"n":"A Straightforward Fancy","g":99,"l":"Matoya's Cave","s":5902}},{"type":"quest","id":"67504","obj":{"i":67504,"n":"A Statuesque Interest","g":99,"l":"Matoya's Cave","s":5903}},{"type":"quest","id":"67505","obj":{"i":67505,"n":"A Self-possessed Pastime","g":99,"l":"Matoya's Cave","s":5904}}]}