{"quest":{"name":"The Magic Word","location":"Matoya's Cave","id":67506,"patch":3.0,"sort":5905,"icon":100485,"eventIcon":71221,"issuer":1012141,"target":1012141,"involved":[1012139,1012140,1013711,1014289],"genre":99,"journal":["Saro Roggo is eager to hear how you fared in your inquiries after Matoya's desires.","Saro Roggo is disappointed to learn that the brooms did not know what his mistress desires. However, he is not willing to give up. He reveals to you that Matoya secretly has one more broom outside of her cave, and he has reason to believe that it possesses knowledge that the others do not. He bids you speak with the brooms in the cave once more, that you might learn the incantation by which their mysterious fellow may be summoned. Begin by consulting the straightforward broom.","Though the straightforward broom is unaware of an incantation, he knows the broom you seek. She is apparently his sister, born of the same wood. He recommends you speak with his brothers, who may have chanced to meet her recently. Approach the statuesque broom and ask him what he knows.","The statuesque broom reveals to you that the incantation is the name of that which is dearest to Matoya. Unfortunately, he does not know what that thing is. He suggests you speak with his brothers in case they have the answer. Seek out the self-possessed broom and ask him what he knows.","The self-possessed broom is uncertain as to what is dearest to Matoya. However, he seems abundantly confident that she hates Y'shtola above all else. Whether or not you agree, bear your findings back to Saro Roggo and share them with him.","Saro Roggo is at a loss for what the incantation might be. Desperate as he is, he bids you go to the bridge to the east, where you are to try calling out the names of various things. Use your powers of deduction to ascertain the incantation, and with the chat mode in <span class=\"highlight\">Say</span>, enter the word to summon the mystery broom at your destination.","No sooner do you speak the correct incantation than a sweeping noise emanates from nearby. Search the area thoroughly for a broom.","Peering behind the steps of the bridge, you find the serendipitous broom sweeping away. You are touched to learn that the knowledge it possesses is none other than all of Matoya's memories pertaining to Y'shtola─from the time she first became her pupil, to the time she left to make her own way in the world. Return to Matoya's Cave and report your discovery to Saro Roggo.","You relate to Saro Roggo the details of your encounter with the serendipitous broom. Having exhausted all avenues to learn his mistress's desires, he despairs of ever becoming useful to her."],"objectives":["Speak with the straightforward broom.","Speak with the statuesque broom.","Speak with the self-possessed broom.","Speak with Saro Roggo.","With the chat mode in <span class=\"highlight\">Say</span>, enter the incantation at the destination point.","Speak with the serendipitous broom.","Report to Saro Roggo."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"SAROROGGO","text":"How fared your inquiries, ribbit? Were you able to learn from the brooms what my mistress desires?"},{"name":"SAROROGGO","text":"None of them knew!? Inquisitive as they are, I was so certain they possessed the knowledge..."},{"name":"SAROROGGO","text":"You have already done much for me, but I must trouble you for one more favor. It is my last resort, ribbit."},{"name":"SAROROGGO","text":"My mistress secretly has one more broom, which she keeps outside the cave. I chanced to see her summon it once with some manner of incantation. That it's a special broom is plain to see, and as such I believe it possesses knowledge that the others do not."},{"name":"SAROROGGO","text":"Now, I know not how to summon this broom, but its fellows here should be able to help you in this, at least. Please speak with them again, ribbit."},{"name":"SAROROGGO","text":"My mistress secretly has one more broom, which she keeps outside the cave. Please speak with its fellows here and ask them how you can find it, ribbit."},{"name":"BROOMA","text":"Snruter rerutnevda dnik eht, swish-swish-aroo! Thanks again for bringing me the signpost. If there is aught else you wish to know, please do not hesitate to ask!"},{"name":"BROOMA","text":"...I see. I'm not aware of an incantation, but I do know the broom of which you speak. After all, she is my sister, born of the same wood as I am."},{"name":"BROOMA","text":"I have not seen her recently, but perhaps my brothers have. You would do well to speak with them."},{"name":"BROOMA","text":"I have not seen my sister recently, but perhaps my brothers have. You would do well to speak with them."},{"name":"BROOMB","text":"Uoy evres I yam woh, swish-swish-aroo? ...You wish to meet our sister, you say? I suppose you did show me your lovely, lovely tears... Very well, I will tell you what I know."},{"name":"BROOMB","text":"As she is usually outside, we seldom see our sister. But this one time, when we were all getting our bristles cleaned, she taught me how she may be summoned."},{"name":"BROOMB","text":"When we wish to see her, we need but say the name of that which is dearest to our mistress. Unfortunately, I don't know what that thing is. Mayhap one of my brothers will know."},{"name":"BROOMB","text":"If you wish to see our sister, you can summon her by saying the name of that which is dearest to our mistress. Unfortunately, I don't know what that thing is. Mayhap one of my brothers will know."},{"name":"BROOMC","text":"Em ot semoc <span class=\"alternative-container\"><span class=\"alternative\">ehs</span><span class=\"alternative\">eh</span></span>, yllanif dna, swish-swish-aroo! So, you wish to know what is dearest to our mistress. That is a difficult question. From her research into aether to her herb garden, much and more is dear to her."},{"name":"BROOMC","text":"What she loves most, I cannot say, but I know for a fact what she hates above all else: Y'shtola."},{"name":"BROOMC","text":"How do I know this? Because she never, <span class=\"emphasis\">ever</span> talks about Y'shtola. Why, she goes to great pains to avoid the subject. She wouldn't do that for something she likes, now, would she?"},{"name":"BROOMC","text":"What my mistress loves most, I cannot say, but I know for a fact what she hates above all else: her last pupil, Y'shtola."},{"name":"SAROROGGO","text":"Were you able to learn it, ribbit? The incantation by which we might summon my mistress's secret broom?"},{"name":"SAROROGGO","text":"Er, so it's the name of that which is dearest to her, but we only know for certain that she hates Y'shtola above all else...?"},{"name":"SAROROGGO","text":"Why, that isn't helpful in the least! &lt;croak&gt; "},{"name":"SAROROGGO","text":"But we can't give up─not yet. 'Twas at the bridge east of here that my mistress summoned the broom. Please go there and try calling out the names of various things. You're bound to stumble upon the right word...eventually."},{"name":"SYSTEM","text":"It appears you must incant the spell somewhere to the east of Matoya's Cave."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter the incantation."},{"name":"SAROROGGO","text":"'Twas at the bridge east of here that my mistress summoned the broom. Please go there and try calling out the names of various things."},{"name":"SAROROGGO","text":"We know for certain that my mistress hates Y'shtola above all else, so that's one fewer word you need to try. You're bound to stumble upon the right word...eventually."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter the incantation."},{"name":"SYSTEM","text":"You hear the sound of sweeping nearby..."},{"name":"BROOMSISTER01970","text":"(-???-)Gniveileb si gnipeews, swish-swish-aroo. Who is it that summons me?"},{"name":"BROOMSISTER01970","text":"You are <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who summoned me?"},{"name":"BROOMSISTER01970","text":"I desire nothing of you, save that you desire nothing of me. I possess no knowledge that could possibly be of use to you."},{"name":"BROOMSISTER01970","text":"For my mistress has imparted unto me naught but memories─the memories of a young Y'shtola."},{"name":"BROOMSISTER01970","text":"The warmth of her hands. Her determined countenance. Her blossoming into a woman grown. Every mundane conversation they shared. Her sudden departure. The painful farewell."},{"name":"BROOMSISTER01970","text":"My mistress cannot bear to have these memories near, but neither does she wish to forget them. So it was that she entrusted them to my safekeeping and bade me remain hidden."},{"name":"BROOMSISTER01970","text":"I can tell you naught more. Pray leave me to my sweeping."},{"name":"BROOMSISTER01970","text":"My mistress has imparted unto me naught but memories. I possess no knowledge that could possibly be of use to you. Pray leave me to my sweeping."},{"name":"SAROROGGO","text":"You succeeded in summoning the secret broom!? Huzzah! I knew you could do it! So, what did the broom tell you, ribbit?"},{"name":"SAROROGGO","text":"...That's truly the way of it? B-But I can scarcely become Y'shtola. Or anything else, for that matter. And now I've exhausted all avenues to learn my mistress's desires..."},{"name":"SAROROGGO","text":"Oh, woe is me! Useless as I am, I'm doomed to become a mindless, speechless toad! &lt;croak&gt;"},{"name":"SAY","text":"Y'shtola"},{"name":"SAY","text":"Aloths'y"}],"reward":{"gil":609,"items":[{"id":7776},{"id":7775,"one":1},{"id":5414,"one":1},{"id":7606,"one":1}],"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67503,67504]},"next":[67507]},"partials":[{"type":"npc","id":"1012141","obj":{"i":1012141,"n":"Saro Roggo","l":2036,"q":3}},{"type":"npc","id":"1012139","obj":{"i":1012139,"n":"Straightforward Broom","l":2036,"q":2}},{"type":"npc","id":"1012140","obj":{"i":1012140,"n":"Statuesque Broom","l":2036,"q":2}},{"type":"npc","id":"1013711","obj":{"i":1013711,"n":"Self-possessed Broom","l":2036,"q":2}},{"type":"npc","id":"1014289","obj":{"i":1014289,"n":"Serendipitous Broom","l":2001,"q":1}},{"type":"item","id":"7776","obj":{"i":7776,"n":"Broombush","l":70,"c":21653,"t":54}},{"type":"item","id":"7775","obj":{"i":7775,"n":"Glazenut","l":90,"c":25315,"t":54}},{"type":"item","id":"5414","obj":{"i":5414,"n":"Rosewood Branch","l":45,"c":22416,"t":50}},{"type":"item","id":"7606","obj":{"i":7606,"n":"Ancient Lumber","l":90,"c":22454,"t":50}},{"type":"quest","id":"67503","obj":{"i":67503,"n":"A Straightforward Fancy","g":99,"l":"Matoya's Cave","s":5902}},{"type":"quest","id":"67504","obj":{"i":67504,"n":"A Statuesque Interest","g":99,"l":"Matoya's Cave","s":5903}},{"type":"quest","id":"67507","obj":{"i":67507,"n":"Have I Toad You Lately","g":99,"l":"Matoya's Cave","s":5906}}]}