{"quest":{"name":"Have I Toad You Lately","location":"Matoya's Cave","id":67507,"patch":3.0,"sort":5906,"icon":100485,"eventIcon":71221,"issuer":1012141,"target":1012138,"genre":99,"journal":["Saro Roggo is resigned to his fate.","Saro Roggo has resigned himself to reverting to being an ordinary toad, and plans to go back to dwelling in the wetlands outside Matoya's Cave. However, flat-footed opkens lurk near the area and prey upon his kind. Lie in wait at the specified locations and slay three of the creatures, that Saro Roggo need not live in fear.","You have eliminated the opkens. Take word of your success back to Saro Roggo.","Saro Roggo thanks you for making his past and future home safe again. But in spite of his apparent resignation, it is painfully obvious that he is not ready to give up. Use your powers of deduction to ascertain what he desires of you, and perform the appropriate action for him.","Your boisterous cheering has the desired effect, and Saro Roggo regains his determination to please his mistress. He declares that he will ask after her desires directly...right after you soften her up for him.","Following your lead, Saro Roggo approaches his mistress, and begs to know her desires. To his disappointment, however, she replies that she has none, explaining that she is but an old woman awaiting her death. Moved by his devotion, Matoya entrusts to Saro Roggo the task of closing her Crystal Eye when she dies, and then laying the serendipitous broom at her side. You may rest assured in the knowledge that Saro Roggo has finally found a purpose for his existence."],"objectives":["Lie in wait outside Matoya's Cave and defeat flat-footed opkens.","Report to Saro Roggo in Matoya's Cave.","Perform the appropriate action for Saro Roggo.","Speak with Matoya."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"SAROROGGO","text":"It feels like only yesterday that I was a simple toad, without a thought for aught beyond the next bug I would eat."},{"name":"SAROROGGO","text":"But a twist of fate saw me chosen by Mistress Matoya. She raised me up, ribbit, making me into a poroggo and bestowing upon me a name."},{"name":"SAROROGGO","text":"Short though my time was serving my mistress, and poorly, these were the happiest days of my life. &lt;croak&gt;"},{"name":"SAROROGGO","text":"Will you oblige me one last favor, kind adventurer? A request from a condemned soul, ribbit?"},{"name":"SAROROGGO","text":"When I revert to an ordinary toad, I will go back to dwelling in the wetlands outside my mistress's cave. However, opkens lurk near the area, preying upon my kind. Please vanquish the beasts, that I needn't live in fear."},{"name":"SAROROGGO","text":"When I revert to an ordinary toad, I will go back to dwelling in the wetlands outside my mistress's cave. However, opkens lurk near the area, preying upon my kind. Please vanquish the beasts, that I needn't live in fear."},{"name":"SAROROGGO","text":"You have seen to the opkens? Thank you ever so much, ribbit!"},{"name":"SAROROGGO","text":"Now I can live out my days as a mindless toad in peace. I don't know what I would do without you, kind adventurer."},{"name":"SAROROGGO","text":"Well, I suppose this is it. Perhaps we'll meet again, at a muddy pond or in a swath of swamp grass. Please be careful that you don't accidentally step on me."},{"name":"SAROROGGO","text":"&lt;croak&gt; Would that there were another way. But there isn't, and I must accept my fate. Lest you are thinking to cheer me up, know that it's no use, ribbit."},{"name":"SAROROGGO","text":"No use at all. Cheering me up, that is."},{"name":"SYSTEM","text":"Saro Roggo gazes at you with anticipation."},{"name":"SAROROGGO","text":"I'll say it again, in case you didn't hear me. It's no use cheering me up. No use at all."},{"name":"SYSTEM","text":"Saro Roggo gazes at you with anticipation."},{"name":"SAROROGGO","text":"You are kind, but it is too late for me. There is naught more to be done for this failure of a poroggo. &lt;croak&gt;"},{"name":"SAROROGGO","text":"Thank you, kind adventurer! For believing in me!"},{"name":"SAROROGGO","text":"I was bogged down in the quagmire of despair, but you have set my cold wavekin blood to boiling with determination!"},{"name":"SAROROGGO","text":"'Tis too early to give up, ribbit! I will go to Mistress Matoya and demand to know her heart's desire, or perish in the trying!"},{"name":"SAROROGGO","text":"So, er, do you think you could speak with her first? Soften her up a little? I shall be right behind you..."},{"name":"SAROROGGO","text":"Do you think you could speak with my mistress first? Soften her up a little? I shall be right behind you..."},{"name":"MATOYA","text":"A word in private? Very well, I'll have Shtola take a walk."},{"name":"MATOYA","text":"A serious talk, you say? Very well, let's talk, then."},{"name":"SAROROGGO","text":"O venerable mistress! Your humble servant comes before you to beg a boon!"},{"name":"SAROROGGO","text":"I would know your heart's desire, ribbit. Pray speak it unto me, and I shall see it fulfilled."},{"name":"MATOYA","text":"What's brought this on? Are you afraid I'd turn you back into a normal toad or something?"},{"name":"MATOYA","text":"Well, I'm sorry, but I've got no desires. None at all. Nay, there's naught left of me but my pride."},{"name":"MATOYA","text":"I poured my heart and soul into my research. Passionate as I was, I invariably clashed with those around me. But even as these clashes served to stoke the fires of my motivation, they walled me off from the rest of the world. And here I am."},{"name":"MATOYA","text":"This cave is my home now, but ere long it will become my tomb. I'll die and turn into bones amidst this gloom, and none will be the wiser."},{"name":"MATOYA","text":"There's nothing I desire. I'm just an old woman awaiting death."},{"name":"SAROROGGO","text":"No, my mistress! You are great and wise! You deserve better than that!"},{"name":"SAROROGGO","text":"If you will but give the command, I shall make your accomplishments known to the world, that your name might be remembered for all time!"},{"name":"MATOYA","text":"&lt;sigh&gt; Fool of a poroggo. If I desired such things, I wouldn't have hidden myself here."},{"name":"MATOYA","text":"If someone wants my knowledge, they'll have to find my cave. <span class=\"emphasis\">And</span> force open the door. <span class=\"emphasis\">And</span> survive the attentions of my minions."},{"name":"SAROROGGO","text":"Then...there is truly nothing I can do for you?"},{"name":"MATOYA","text":"&lt;sigh&gt; You're a stubborn one, aren't you? But if you wish to serve me so badly... Very well, I shall give you a task."},{"name":"MATOYA","text":"When I die, you are to close this eye of mine─the one that sees all."},{"name":"MATOYA","text":"After which you are to summon my hidden broom and lay it at my side. You know of it, I shouldn't doubt."},{"name":"SAROROGGO","text":"It shall be done, my mistress! As surely as my name is Saro Roggo, it shall be done, ribbit!"},{"name":"MATOYA","text":"That is well."},{"name":"SAROROGGO","text":"Did you hear, kind adventurer? Thanks to you, I've been entrusted with a task of great honor! Finally, my existence has purpose!"},{"name":"MATOYA","text":"...Well? Is there something else?"},{"name":"SAROROGGO","text":"No, my mistress. I'm making sure to be present when you draw your last breath, the better to perform my duty."},{"name":"MATOYA","text":"I'm not going to die in a hurry, you dolt! Now, stop standing about and go and make me some tea!"},{"name":"SAROROGGO","text":"A-At once, my mistress! &lt;croak&gt;"}],"reward":{"gil":705,"items":[{"id":5682,"one":1},{"id":5717,"one":1},{"id":5722,"one":1}],"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67195,67506]}},"partials":[{"type":"npc","id":"1012141","obj":{"i":1012141,"n":"Saro Roggo","l":2036,"q":3}},{"type":"npc","id":"1012138","obj":{"i":1012138,"n":"Matoya","l":2036,"q":7}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"67195","obj":{"i":67195,"n":"Matoya's Cave","g":3,"l":"Idyllshire","s":84}},{"type":"quest","id":"67506","obj":{"i":67506,"n":"The Magic Word","g":99,"l":"Matoya's Cave","s":5905}}]}