{"quest":{"name":"A Straightforward Fancy","location":"Matoya's Cave","id":67503,"patch":3.0,"sort":5902,"icon":100485,"eventIcon":71221,"issuer":1012139,"target":1012139,"genre":99,"journal":["The straightforward broom will share with you his knowledge in exchange for a straightforward task.","The straightforward broom offers to share with you his knowledge, but you must first bring him the object he desires: a signpost for aetherial travel, which he describes as sparkly, glowy, and angularly. Such signposts used to be commonplace in Sharlayan. Search for the mystery object in the ruins of the city.","You have acquired a disused aetheryte shard, which is most certainly what the straightforward broom desires. Make your way back to Matoya's Cave and present your discovery to him.","The straightforward broom accepts the aetheryte shard with glee. As promised, he shares with you his knowledge─the fruits of Matoya's research into aether. Unfortunately, he does not seem to know what his mistress desires..."],"objectives":["Find the object of the straightforward broom's desire in the Dravanian hinterlands.","Deliver the aetheryte shard to the straightforward broom in Matoya's Cave."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"BROOMA","text":"Nam on skees egdelwonk, swish-swish-aroo! But if you desire my knowledge, you must first grant me my heart's desire!"},{"name":"BROOMA","text":"Nothing fascinates me more than aether. Streams of it go round and round the world like a great tangle of ribbons! When one rides such a stream, where will one end up? I often engage in such musings."},{"name":"BROOMA","text":"But even as I muse, I frighten myself silly. For instance, what if I were to arrive at my destination only to find that there is no dust to sweep? Can you imagine a worse fate?"},{"name":"BROOMA","text":"Of course you can't─you are not a broom. But I am, and I require a safety measure, something that will point the way home no matter where I find myself. A signpost for aetherial travel, as it were─sparkly, glowy, angularly!"},{"name":"BROOMA","text":"Such signposts used to be commonplace in Sharlayan. If you can find one and bring it to me, I will share my knowledge with you!"},{"name":"BROOMA","text":"I desire a signpost for aetherial travel─sparkly, glowy, angularly."},{"name":"BROOMA","text":"Such signposts used to be commonplace in Sharlayan. If you can find one and bring it to me, I will share my knowledge with you!"},{"name":"BROOMA","text":"Snruter rerutnevda evarb eht, swish-swish-aroo! Did you find it? A signpost for aetherial travel?"},{"name":"BROOMA","text":"Yes, this is precisely what I wanted! With this, I can always find my way home! I need not fear being condemned to a dustless life!"},{"name":"BROOMA","text":"As promised, I will share with you such knowledge as I have received from my mistress. That is, the fruits of her research into aether!"},{"name":"BROOMA","text":"Aether is the thread from which all creation is woven, and Mistress Matoya has devoted her life to unraveling its secrets."},{"name":"BROOMA","text":"Over the years, she has made discoveries beyond count. Why, if I had a bristle for each one, I would be a rich broom indeed!"},{"name":"BROOMA","text":"But wealth is a thing to be shared, and the fruits of my mistress's research are distributed among my brother brooms and our distant relatives, the tomes."},{"name":"BROOMA","text":"...Oh? You wished only to know what my mistress desires? I am afraid I cannot tell you, for she never imparted that knowledge to me. Sorry to disappoint!"}],"reward":{"gil":577,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67195,67502]},"next":[67506]},"partials":[{"type":"npc","id":"1012139","obj":{"i":1012139,"n":"Straightforward Broom","l":2036,"q":2}},{"type":"quest","id":"67195","obj":{"i":67195,"n":"Matoya's Cave","g":3,"l":"Idyllshire","s":84}},{"type":"quest","id":"67502","obj":{"i":67502,"n":"Saro Roggo's Common Life","g":99,"l":"Matoya's Cave","s":5901,"f":1}},{"type":"quest","id":"67506","obj":{"i":67506,"n":"The Magic Word","g":99,"l":"Matoya's Cave","s":5905}}]}