{"quest":{"name":"Classic Misdirection","location":"The Churning Mists","id":67509,"patch":3.0,"sort":5901,"icon":100476,"eventIcon":71221,"issuer":1013712,"target":1014449,"involved":[1012054,1012056,1012057,1012059,1012067,1012068,1012069,1012070],"genre":100,"journal":["Mogule is waiting all by himself for the Twelveswood moogles.","Wait as Mogule might, the moogles from the Twelveswood are nowhere to be seen. He is sure that his directions to meet at the floating island among the sea of clouds were perfectly clear. However, it seems he underestimated the vastness of the landmasses above the skies, and also the clarity of his own directions, and after conferring with you realizes it may be possible the Twelveswood moogles wrongly traveled to the Sea of Clouds. Since <span class=\"emphasis\">someone</span> has to stay behind at Moghome should the Twelveswood moogles eventually show up, Mogule bids you go to the Sea of Clouds to look for the missing moogles. Travel to Camp Cloudtop and ask its inhabitants if they know aught of a band of moogles amongst their midst.","After questioning the inhabitants of Camp Cloudtop, you find out that not many besides you have ever actually seen a moogle in the flesh. However, one of the knights tells you of a man named Gildon, who has been going on about “kupo” related nonsense for the past several days. Seek out Gildon near the Rosehouse and see if he has any information that may guide you in your search.","Gildon, grateful that someone is actually taking his rants seriously, says that he heard moogle voices near Ok' Zundu. Ask the Vanu Vanu of that tribe if they have seen anything of the fabled creatures.","After questioning the Vanu Vanu of Ok' Zundu, you learn little of use besides knowledge of the creatures and clouds in the area. However, one of the giant birdlike creatures tells you that a Vanu Vanu by the name of Guna Vanu has said something about whispers flitting amongst the clouds. Speak to Guna Vanu to find out what he knows.","Upon speaking with Guna Vanu, you find that his brother spoke of hearing unfamiliar voices from under a bridge not far from Ok' Zundu. Could these be the errant moogles? Or a troll? Seek out the bridge to find out.","You search under the bridge and find a lost Kupli Kuki from the Twelveswood. Apparently the Twelveswood moogles misinterpreted the letter, as Mogule guessed, and came to the Sea of Clouds─an understandable mistake. Luckily, thanks to your diligent search, the Twelveswood moogles can now proceed on their way to Moghome for plenty of fun mingling."],"objectives":["Inquire about the moogles at Camp Cloudtop.","Speak with Gildon at the Rosehouse.","Inquire about the moogles at Ok' Zundu.","Speak with Guna Vanu.","Search for moogles under the bridge outside Ok' Zundu."],"dialogue":[{"name":"MOGULE","text":"I feel like I've been flapping my wings forever, and still the Twelveswood moogles are nowhere in sight. I told them I'd be waiting for them on a floating island above the clouds. Those directions are perfectly clear, aren't they?"},{"name":"MOGULE","text":"...You mean there are <span class=\"emphasis\">more</span> floating islands to the east!? Why didn't you say so earlier? The Twelveswood moogles could be there right now, all alone, kupo..."},{"name":"MOGULE","text":"I can't be expected to know of <span class=\"emphasis\">every</span> island... Well, we can't <span class=\"emphasis\">both</span> go look for them─what if they show up here? Adventurer, you're friends with the Twelveswood moogles─go in search for them, kupo!"},{"name":"MOGULE","text":"How many islands could there possibly <span class=\"emphasis\">be</span> in the sky... Adventurer, please go look for them to the east, kupo!"},{"name":"HARMIETTE","text":"...Moogles? As much as I'd like to help you, I've never seen one of those in all my days. The only excitement I've had the luck to deal with is the dwindling wine stores. I swear those barrels must come to us half-drunk already..."},{"name":"FABRELLET","text":"...Now why in the seven hells would a moogle be <span class=\"emphasis\">here</span>? Well...now that you mention it, Gildon was going on about kupo-something or other. He might know something that can help you, if you can stand his rambling. You can find him in the Rosehouse."},{"name":"CARIBAULT","text":"Can't say I've seen a moogle around here. Of course, even if I <span class=\"emphasis\">did</span> see one, how the hells would I know what I was looking at?"},{"name":"HARMIETTE","text":"Someone's been getting into the wine─that stuff doesn't just evaporate into thin air!"},{"name":"FABRELLET","text":"He's been talking about hearing strange voices nonstop for the past few days. Being up this high...it <span class=\"emphasis\">changes</span> some people..."},{"name":"CARIBAULT","text":"What does a moogle even look like? I'm not like to find out any time soon..."},{"name":"GILDON","text":"...Did you say moogles? Thank the gods, finally someone who believes me! Like I've been telling everyone, I heard a strange voice saying “kupo, kupo” near Ok' Zundu to the north. I know what I heard, and there isn't anyone who can tell me otherwise!"},{"name":"GILDON","text":"Just go north to Ok' Zundu, and you'll hear “kupo” drifting through the winds if you listen carefully. Trust me!"},{"name":"GANUVALI","text":"Ah, netherling seeks white fluff which flies like gaelicat? Ganu Vali looks to sky and sees only...clouds! Clouds speak only in thunder and wind, Ganu Vali hears not this “kupo.”"},{"name":"AANUVANU","text":"Netherling speaks of moogles? Aanu Vanu knows not of such flying animals, Sea of Clouds home to only gaelicats, sanuwa, and meddlesome insects!"},{"name":"KUNUVALI","text":"Netherling seeks animal which flies like soaring cloud? Kunu Vali only sees clouds in skies, but Guna Vanu says something of strange whispers brought by distant breeze. Ask him what they might mean, netherling should."},{"name":"GANUVALI","text":"White clouds paint sky of Ok' Zundu, but none come to surface and speak!"},{"name":"AANUVANU","text":"Sea of Clouds home to swarms of gaelicats, endymions, and sanuwa, but moogles Aanu Vanu sees not."},{"name":"KUNUVALI","text":"Guna Vanu speaks of clouds which mutter nonsensical words. Ask him, he may know what you seek."},{"name":"GUNAVANU","text":"Ah, netherling, too many moons pass since last meeting. What do you seek of Guna Vanu?"},{"name":"GUNAVANU","text":"Ah, yes... Not long ago Guna Vanu find brother cowering in shade, speaking of strange voices under bridge. Bridge lies outside Ok' Zundu, maybe netherling find “moogles” there."},{"name":"GUNAVANU","text":"Guna Vanu's brother incessantly speaks of voices under bridge...maybe “moogles” you seek lie there."},{"name":"KUPLIKUKI","text":"Oh! Were you looking for me, kupo? Thank the heavens someone found me! You see, I was looking for moogles in the sky...but there are so many mean-looking monsters, kupo! Under this bridge was the safest place..."},{"name":"KUPLIKUKI","text":"You mean, Moghome is all the way on the other side of the sky!? What a waste of an airship trip... Well, with you to guide us, at least we know where to go next, kupo!"}],"reward":{"gil":1414,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67197,67508]},"next":[67510]},"partials":[{"type":"npc","id":"1013712","obj":{"i":1013712,"n":"Mogule","l":2002,"q":4}},{"type":"npc","id":"1014449","obj":{"i":1014449,"n":"Kupli Kuki","l":2100,"q":3}},{"type":"npc","id":"1012054","obj":{"i":1012054,"n":"Fabrellet","l":2100,"q":6}},{"type":"npc","id":"1012056","obj":{"i":1012056,"n":"Caribault","l":2100,"q":5}},{"type":"npc","id":"1012057","obj":{"i":1012057,"n":"Harmiette","l":2100,"q":3}},{"type":"npc","id":"1012059","obj":{"i":1012059,"n":"Gildon","l":2100,"q":8}},{"type":"npc","id":"1012067","obj":{"i":1012067,"n":"Aanu Vanu","l":2100,"q":5}},{"type":"npc","id":"1012068","obj":{"i":1012068,"n":"Guna Vanu","l":2100,"q":4}},{"type":"npc","id":"1012069","obj":{"i":1012069,"n":"Ganu Vali","l":2100,"q":4}},{"type":"npc","id":"1012070","obj":{"i":1012070,"n":"Kunu Vali","l":2100,"q":2}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}},{"type":"quest","id":"67508","obj":{"i":67508,"n":"Moogles in the Sky","g":96,"l":"Ishgard","s":5901}},{"type":"quest","id":"67510","obj":{"i":67510,"n":"A Tale of Two Moogles","g":97,"l":"The Sea of Clouds","s":5901}}]}