{"quest":{"name":"A Statuesque Interest","location":"Matoya's Cave","id":67504,"patch":3.0,"sort":5903,"icon":100485,"eventIcon":71221,"issuer":1012140,"target":1012140,"genre":99,"journal":["The statuesque broom has pure intentions for you.","A self-proclaimed pursuer of purity, the statuesque broom desires that you bring him pure, untainted water. If you do him this favor, he promises to impart to you his knowledge. Draw water from the spring situated west of the Answering Quarter, and deliver it to the statuesque broom.","You have drawn cool spring water from the specified source. Deliver it to the statuesque broom in Matoya's Cave.","Though initially tickled by its transparency, the statuesque broom is underwhelmed by the spring water. He goes on to speak of a legendary water of unsurpassed beauty, that is unattainable to brooms but is found within all men. What could this water be, that is saltier than the Bloodbrine Sea yet clearer than the Thaliak River? Ascertain the identity of this water, and show it to the statuesque broom.","You cry for the statuesque broom, and your tears prove to be the legendary water of which he spoke. As promised, he shares with you his knowledge─the history of Sharlayan. Unfortunately, he does not seem to know what his mistress desires..."],"objectives":["Draw water from the spring situated west of the Answering Quarter.","Deliver the cool spring water to the statuesque broom in Matoya's Cave.","Show the statuesque broom the legendary water of which he speaks."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"BROOMB","text":"Nam on skees egdelwonk, swish-swish-aroo! But if you desire my knowledge, you must first grant me my heart's desire!"},{"name":"BROOMB","text":"I am a finder of filth and a pursuer of purity."},{"name":"BROOMB","text":"And right now I desire to behold that which is the opposite of dry, dirty dust─pure, untainted water."},{"name":"BROOMB","text":"At the heart of the Answering Quarter, there is a pool. If you follow the stream which feeds this pool to the west, you will find an untainted spring. I want you to draw water from this spring, and bring it to me."},{"name":"BROOMB","text":"If the water is as pure and amazing as I imagine, I will share with you my knowledge!"},{"name":"BROOMB","text":"At the heart of the Answering Quarter, there is a pool. If you follow the stream which feeds this pool to the west, you will find an untainted spring. I want you to draw water from this spring, and bring it to me."},{"name":"BROOMB","text":"Snruter rerutnevda evarb eht, swish-swish-aroo! Do you have it? The spring water?"},{"name":"BROOMB","text":"Amazing! I can see right through it! Sometimes I can't even tell whether it's there or not!"},{"name":"BROOMB","text":"And yet, there is something underwhelming about it all... In the end, it's just ordinary water."},{"name":"BROOMB","text":"Legend speaks of a water which surpasses all waters in beauty. It is unattainable to we brooms, who possess no face."},{"name":"BROOMB","text":"It is said that men have it, but not once has Mistress Matoya shown hers to us. Perhaps her well has run dry."},{"name":"BROOMB","text":"Saltier than the Bloodbrine Sea, yet clearer than the Thaliak River... <span class=\"emphasis\">You</span> have this water, I am certain of it. If you will show it to me, I will share with you my knowledge. Cross my bristles and hope to die!"},{"name":"BROOMB","text":"Legend speaks of a water which surpasses all waters in beauty. It is unattainable to we brooms, who possess no face."},{"name":"BROOMB","text":"It is said that men have it, but not once has Mistress Matoya shown hers to us. Perhaps her well has run dry."},{"name":"BROOMB","text":"Saltier than the Bloodbrine Sea, yet clearer than the Thaliak River... <span class=\"emphasis\">You</span> have this water, I am certain of it. If you will show it to me, I will share with you my knowledge. Cross my bristles and hope to die!"},{"name":"BROOMB","text":"What was that? Though it did pique my interest, it wasn't the legendary water I wish to see."},{"name":"BROOMB","text":"&lt;gasp&gt;"},{"name":"BROOMB","text":"B-Be still my rustling bristles! <span class=\"emphasis\">This</span> is the water of legend...and now I remember its name: tears! The rivulets streaming down your face... So poignant and yet somehow...beautiful."},{"name":"BROOMB","text":"As promised, I will share with you such knowledge as I have received from my mistress. That is, the history of Sharlayan!"},{"name":"BROOMB","text":"Prior to the exodus, such knowledge as was conceived here was presented to the Forum, the body of scholars which, for all intents and purposes, rules in the northern motherland."},{"name":"BROOMB","text":"Mistress Matoya was none too fond of them, to put it mildly, for they hindered her research in the name of their so-called laws. Though envy and spite were as often the motive for their actions."},{"name":"BROOMB","text":"I am but a simple broom, and I cannot claim to understand my mistress's feelings, but I imagine that it was like getting dust stuck between my bristles."},{"name":"BROOMB","text":"...Oh? You wished only to know what my mistress desires? I am afraid I cannot tell you, for she never imparted that knowledge to me. Sorry to disappoint!"}],"reward":{"gil":577,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67195,67502]},"next":[67506]},"partials":[{"type":"npc","id":"1012140","obj":{"i":1012140,"n":"Statuesque Broom","l":2036,"q":2}},{"type":"quest","id":"67195","obj":{"i":67195,"n":"Matoya's Cave","g":3,"l":"Idyllshire","s":84}},{"type":"quest","id":"67502","obj":{"i":67502,"n":"Saro Roggo's Common Life","g":99,"l":"Matoya's Cave","s":5901,"f":1}},{"type":"quest","id":"67506","obj":{"i":67506,"n":"The Magic Word","g":99,"l":"Matoya's Cave","s":5905}}]}