{"quest":{"name":"Moogles in the Sky","location":"Ishgard","id":67508,"patch":3.0,"sort":5901,"icon":100476,"eventIcon":71221,"issuer":1014448,"target":1013712,"involved":[1012077],"genre":96,"journal":["The House Fortemps knight has an urgent letter to deliver, and he's looking right at you.","A knight from House Fortemps has received a letter addressed directly to you, and upon opening it you realize it was sent by none other than Kuplo Kopp. Apparently he and the Moghome moogles have been getting along famously, and they have decided to have a get-together of the Twelveswood and Moghome moogles, to deepen the bond between them. He invites─or rather, demands─your presence at the festivities, saying that a moogle by the name of Mogule awaits your arrival at Moghome. Head to Moghome at the Churning Mists and speak to your excited host when you arrive.","It seems that before the arrival of Kuplo Kopp and the others from the surface, the existence of the Twelveswood moogles was a mystery to most of Moghome. Mogule is quite curious as to why the moogles of the surface and sky are not living together, and decides that it might be best to ask Chieftain Moglin to shed some light on the mystery of their separation.","Chieftain Moglin, being a busy moogle himself, proposes that the answer to the mystery of the moogles' separation wait until the Twelveswood moogles arrive at Moghome. Mogule, amazed at Moglin's insightful decision, heads off to meet the soon-to-be-arriving moogles, and bids you follow him. Meet with Mogule and wait to greet the undoubtedly tired Twelveswood moogles. ","You arrive to find Mogule eagerly awaiting the Twelveswood moogles, but despite it being well past the appointed time, there is not a pom-pom in sight. If the moogles aren't at Moghome, then where could they be...?"],"objectives":["Speak with Mogule at Moghome.","Speak with Moglin.","Meet with Mogule."],"dialogue":[{"name":"KNIGHTOFHOUSEFORTEMPS","text":"Ah, just who I was looking for. A letter was delivered to our house, addressed to a <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. I wouldn't dare presume to open the letter myself, but the moogle who delivered it seemed to be in quite a fit of excitement. It might serve you best to open the letter immediately. "},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)<span class=\"highlight\">Forename</span>, I hope Ishgard's frigid clime is treating you well."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)As for me, I'm glad to be in a place with more agreeable weather. I've been having a delightfully droll time with the Moghome moogles, and we've come to an agreement: Moghome will host moogles from the Twelveswood so we can all get to know each other better!"},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)This will be a rare chance for the moogles to share and celebrate their friendship together, and of course we couldn't forget to invite our favorite adventurer: you! Come to Moghome before all the wine is drunk and all the kupo nuts are eaten!"},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)I regret to say I won't be able to attend due to other pressing matters, but one of Moghome's residents has agreed to greet you upon your arrival."},{"name":"KUPLOKOPP","text":"(-Kuplo Kopp-)His name is Mogule, and I've met hardly a moogle more friendly! He eagerly awaits you at Moghome.<br>From,<br>Kuplo Kopp."},{"name":"KNIGHTOFHOUSEFORTEMPS","text":"This letter arrived at our house, addressed to <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. It seems quite urgent─it might be best for you to open it immediately."},{"name":"MOGULE","text":"Ah, adventurer, you're here at last! It looks like the moogles from the Twelveswood haven't arrived yet."},{"name":"MOGULE","text":"Now, when I heard there were moogles down below, my pom-pom perked right up in surprise, kupo!"},{"name":"MOGULE","text":"And then I got to thinking... Well, why aren't the moogles of the surface and sky living in happy harmony? And I couldn't think of a single satisfactory answer, kupo!"},{"name":"MOGULE","text":"Maybe we'll find out when the Twelveswood moogles get here, kupo! But... I want to know <span class=\"emphasis\">now</span>. Chieftain Moglin knows much of our history─come on, adventurer, let's go ask him!"},{"name":"MOGULE","text":"The Twelveswood moogles should be here soon, kupo! In the meantime, let's go ask Chieftain Moglin what he knows about them!"},{"name":"MOGLIN","text":"It's <span class=\"highlight\">Forename</span>─I see you still choose to use that ridiculous name, kupo. And Mogule? What brings you before me today?"},{"name":"MOGULE","text":"Chieftain Moglin! Well... I think many, including me, were surprised when we heard of moogles living in the Twelveswood. Why, if the pom-poms on our heads bounce the same, have we lived apart for so long, kupo?"},{"name":"MOGULE","text":"If any moogle knows the answer to that, it must be <span class=\"emphasis\">you</span>!"},{"name":"MOGLIN","text":"Mogule, I understand your thirst for knowledge. However, surely the Twelveswood moogles are just as curious as you, kupo."},{"name":"MOGULE","text":"Ah! You're right! They'd also want to know..."},{"name":"MOGLIN","text":"And I have scarce the energy to repeat─ I mean, wouldn't it be best to share in the knowledge together, kupo? Yes... Wait until the Twelveswood moogles arrive. Then all will be revealed. "},{"name":"MOGULE","text":"Chieftain Moglin, yours is always the voice of reason, kupo! Very well, I'll go back to await the Twelveswood moogles' arrival."},{"name":"MOGULE","text":"Well, adventurer, they should be here any moment. We wouldn't want them to arrive to an empty kupo nut orchard, now would we?"},{"name":"MOGLIN","text":"Patience, all will be revealed in time, kupo. Now, let me...rest..."},{"name":"MOGULE","text":"That's strange... They should be here by now, but there's no sign of them, kupo..."},{"name":"MOGULE","text":"This can't be good. You don't think they got lost, do you?"}],"reward":{"gil":859,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67197,67368]},"next":[67509]},"partials":[{"type":"npc","id":"1014448","obj":{"i":1014448,"n":"House Fortemps Knight","l":2301,"q":1}},{"type":"npc","id":"1013712","obj":{"i":1013712,"n":"Mogule","l":2002,"q":4}},{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}},{"type":"quest","id":"67368","obj":{"i":67368,"n":"A Nutty Initiation","g":100,"l":"The Churning Mists","s":5417}},{"type":"quest","id":"67509","obj":{"i":67509,"n":"Classic Misdirection","g":100,"l":"The Churning Mists","s":5901}}]}