{"quest":{"name":"An Eggcellent Disguise","location":"The Sea of Clouds","id":67512,"patch":3.0,"sort":5903,"icon":100476,"eventIcon":71221,"issuer":1014452,"target":1014454,"involved":[1014453,1014455,1014456,1014457],"genre":97,"journal":["Kupli Kuki is wringing his pom-pom trying to figure out where his companion went.","Kupli Kuki uses his powers of deduction to determine that the last possible refuge for his lost moogle friend is to the south. However, since that area is just bound to be overflowing with wild beasts, he asks you to go ahead of the two moogles and look for any evidence of his lost companion before they risk their lives in an effortless search. Search Hengr's Crucible for any signs of the nervous moogle.","You search the area and you find an errant kupo nut and a few feathers that look like they came from a bird of significant size. It would be a shame if a moogle was left alone without his kupo nuts, so return the evidence to Kupli Kuki and see what he has to say about his lost partner.","Kupli Kuki examines the kupo nut and feathers, guessing that the most likely occurrence was that his poor companion was kidnapped by one of the many large birds soaring the skies in the area. Follow him to where the birds build their nests and see if he has any insight as to where the other moogle may be.","You meet up with the two moogles, and the area is teeming with giant birds that match the feathers you found previously. Kupli Kuki asks you to help them search for their friend before one of the birds gets hungry and does something terrible to the moogle.","After searching every nook and cranny of the area, you find the moogle cowering in a nest, apparently in an attempt to blend in with the many eggs. He is relieved that he was able to avoid becoming fodder for the birds, and returns to reunite with his Twelveswood companions. ","All three moogles have been reunited at last, and they can finally move on from this confusing episode to meet their moogle brethren in Moghome. Aid them in their journey to the Churning Mists for what is sure to be a party to remember."],"objectives":["Look for clues of the missing moogle's whereabouts.","Bring the clues to Kupli Kuki.","Speak with Kupli Kuki at the Nidifice.","Search for the motioning moogle.","Report to Kupli Kuki."],"dialogue":[{"name":"FORRESTMOG0201974","text":"Oh... Where did he wander off to, kupo?"},{"name":"KUPLIKUKI","text":"If I can say one thing about my companion, it's that he's quite adept at fleeing, kupo! Hmmm... If it were <span class=\"emphasis\">me</span> running, I'd go...to the south!"},{"name":"KUPLIKUKI","text":"But, no doubt that area is just crawling with dreadful creatures. Adventurer, we need you to look for any signs he was there, or for any clues as to where he may have ran to. If you find something, then it may be worth braving this region's cruel monsters."},{"name":"KUPLIKUKI","text":"Bring any clues you find right back here, and we can continue our search when you return, kupo!"},{"name":"KUPLIKUKI","text":"Ah, you're back at last! Did you find any sign of our friend, kupo?"},{"name":"KUPLIKUKI","text":"Hmm...some black feathers...and a kupo nut! This is one of the presents we brought for Moghome, kupo!"},{"name":"KUPLIKUKI","text":"Just as I thought, he must've gone south! But, just how far south? It's hard to imagine him running too far without resting his wings... "},{"name":"FORRESTMOG0201974","text":"Ah hah! These black feathers must belong to the giant bird that attacked. That means the bird might have flown off with the poor moogle..."},{"name":"KUPLIKUKI","text":"We have to help him before he's eaten, or worse! Hurry, adventurer, we need to follow the bird's trail, kupo!"},{"name":"FORRESTMOG0201974","text":"This just keeps getting worse and worse... I hope he's okay, kupo..."},{"name":"KUPLIKUKI","text":"Look, there's a whole flock of those birds here. If indeed our companion was kidnapped, he's like to be around here. Let's split up and look for him, kupo!"},{"name":"KUPLIKUKI","text":"I hope he's okay... Hurry and find him before something terrible happens, kupo!"},{"name":"FORRESTMOG0301976","text":"I <span class=\"emphasis\">am</span> the egg... <span class=\"emphasis\">Be</span> the egg, kupopo... Eggs don't get eaten, no they don't... <span class=\"emphasis\">Be</span> the egg..."},{"name":"FORRESTMOG0301976","text":"...Oh no! I've been found out, kupopo! Don't...don't eat me─I'm so stringy, skin and bones..."},{"name":"FORRESTMOG0301976","text":"...Oh, you're not one of those nasty birds!? Thank heavens, I thought I was done for! Good thing I wasn't─moogles are notoriously lacking in flavor, kupo."},{"name":"FORRESTMOG0301976","text":"You mean the others have come looking for me? I knew they wouldn't leave me here, kupo! I'll return to them at once!"},{"name":"FORRESTMOG0201974","text":"You found him! I would've never thought to pretend to be an egg─in fact, chances are I'd end up eating it, kupo!"},{"name":"FORRESTMOG0301976","text":"That was too close! I'll never eat another egg again, kupo..."},{"name":"KUPLIKUKI","text":"Everyone's together at last, kupo!"},{"name":"KUPLIKUKI","text":"We can finally make our way to Moghome! I've grown quite tired of all these flying monstrosities, kupo!"}],"reward":{"gil":609,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67197,67511]},"next":[67513]},"partials":[{"type":"npc","id":"1014452","obj":{"i":1014452,"n":"Kupli Kuki","l":2100,"q":2}},{"type":"npc","id":"1014454","obj":{"i":1014454,"n":"Kupli Kuki","l":2100,"q":2}},{"type":"npc","id":"1014453","obj":{"i":1014453,"n":"Moofy Moogle","l":2100,"q":2}},{"type":"npc","id":"1014455","obj":{"i":1014455,"n":"Moofy Moogle","l":2100,"q":2}},{"type":"npc","id":"1014456","obj":{"i":1014456,"n":"Motioning Moogle","l":2100,"q":2}},{"type":"npc","id":"1014457","obj":{"i":1014457,"n":"Motioning Moogle","l":2100,"q":1}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}},{"type":"quest","id":"67511","obj":{"i":67511,"n":"Birds of a Feather","g":97,"l":"The Sea of Clouds","s":5902}},{"type":"quest","id":"67513","obj":{"i":67513,"n":"The Skies That Bind","g":97,"l":"The Sea of Clouds","s":5904}}]}