{"quest":{"name":"Birds of a Feather","location":"The Sea of Clouds","id":67511,"patch":3.0,"sort":5902,"icon":100476,"eventIcon":71221,"issuer":1014449,"target":1014452,"involved":[1014451,1014453],"genre":97,"journal":["Kupli Kuki wants you to help search for the last missing moogle.","Kupli Kuki and the other moogle have resolved to go find their friend, who ran off somewhere to the eastern part of the Sea of Clouds. Meet with Kupli Kuki at Ok' Vundu Vana to join in on this terribly long game of hide-and-seek.","Upon meeting with Kupli Kuki, he tells you that the lost moogle is nowhere in the area, but he also makes a ghastly discovery. On the ground is a kupo nut, one of the several that the moogles brought to share at their meeting in Moghome. You see the rest of the kupo nuts scattered around the area, and Kupli Kuki asks you to collect them in his stead so that he doesn't fall victim to any of the many hungry monsters stalking the area.","You have braved the griffins and other angry beasts and gathered the precious kupo nuts. Return them to Kupli Kuki so their gift to Moghome will not go to waste.","Kupli Kuki is glad that the kupo nuts were recovered intact, but worries for his lost friend. Aid the two moogles in their desperate search for their companion."],"objectives":["Meet with Kupli Kuki at Ok' Vundu Vana.","Gather the kupo nuts.","Give the kupo nuts to Kupli Kuki."],"dialogue":[{"name":"FORRESTMOG0201974","text":"I hope our friend's okay, kupo!"},{"name":"KUPLIKUKI","text":"Only one more missing moogle... Adventurer, you've seen all the scary beasts out there. We need to find him before something terrible happens!"},{"name":"FORRESTMOG0201974","text":"It seems the moogle fluttered off to the east when the giant bird attacked, kupo."},{"name":"KUPLIKUKI","text":"We better hurry! That's right, <span class=\"emphasis\">we</span>─ We'll all be going this time!"},{"name":"FORRESTMOG0201974","text":"I don't see him anywhere, kupo. I hope he's not..."},{"name":"KUPLIKUKI","text":"Hmmm... I don't see any sign of a pom-pom here..."},{"name":"KUPLIKUKI","text":"Oh no! What's that...? It's a kupo nut! We brought some from the Twelveswood to give to the Moghome moogles. What could they be doing here? We'd best pick them up─it'd be a shame to let them go to waste, kupo."},{"name":"KUPLIKUKI","text":"But, look at all these monsters... Adventurer, you look like you can handle them─why don't you gather the kupo nuts?"},{"name":"KUPLIKUKI","text":"The kupo nuts are scattered all over the place. We need to pick them up, kupo!"},{"name":"KUPLIKUKI","text":"Well, were you able to find the kupo nuts?"},{"name":"KUPLIKUKI","text":"Ah, thank you, adventurer! We brought five kupo nuts with us, so there should be one more somewhere..."},{"name":"KUPLIKUKI","text":"But, if our lost companion isn't here, then where could he be? He couldn't have run far... Well, we'll just have to brave these wilds a little longer, kupo! "}],"reward":{"gil":577,"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67197,67510]},"next":[67512]},"partials":[{"type":"npc","id":"1014449","obj":{"i":1014449,"n":"Kupli Kuki","l":2100,"q":3}},{"type":"npc","id":"1014452","obj":{"i":1014452,"n":"Kupli Kuki","l":2100,"q":2}},{"type":"npc","id":"1014451","obj":{"i":1014451,"n":"Moofy Moogle","l":2100,"q":2}},{"type":"npc","id":"1014453","obj":{"i":1014453,"n":"Moofy Moogle","l":2100,"q":2}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}},{"type":"quest","id":"67510","obj":{"i":67510,"n":"A Tale of Two Moogles","g":97,"l":"The Sea of Clouds","s":5901}},{"type":"quest","id":"67512","obj":{"i":67512,"n":"An Eggcellent Disguise","g":97,"l":"The Sea of Clouds","s":5903}}]}