{"quest":{"name":"A Moogle by Any Other Name","location":"The Churning Mists","id":67514,"patch":3.0,"sort":5902,"icon":100477,"eventIcon":71221,"issuer":1014465,"target":1012077,"involved":[1012082,1013712,1014462,1014463,1014466,1014467,1014468,1014469,1014470],"genre":100,"journal":["Kupli Kuki is thinking about the Moghome moogles.","Everyone is excited to deepen the bonds between mooglekind, but Kupli Kuki wants to know more about the names of the Moghome moogles, in particular why every name starts with “Mog” and not something like “Kup.” Since Kupli Kuki seems to be particularly shy around moogles of high social standing, he enlists your aid in asking Chieftain Moglin the reason as to why the moogles from the sky and surface have different names. Ask Chieftain Moglin for what is sure to be a thrilling history lesson on the origins of Moghome names.","You speak with Chieftain Moglin, and he seems eager to tell you about the names of Moghome, but not before you help the Pomguard with a pair of monsters who have suddenly attacked Moghome's kupo nut supply. Speak with Mogleo of the Pomguard to find out what aid he requires.","Mogleo tells you that two monsters have dared to steal into Moghome's precious kupo nut supply, and asks you to aid Mogule, Kupli Kuki, and the other Twelveswood moogles in slaying the monster they have gone after. Speak with the four moogles to find out where this insatiable monster could be.","Mogule and the other valiant Twelveswood moogles have cornered the invasive monster to the southeast. Slay it so that Moghome's nuts are in danger no more.","You find that a stray gaelicat was one of the monsters trying to get its paws on the moogles' kupo nuts, and slay it before it can do any more harm to the precious nut orchard. Report back to Mogleo for an update on their progress.","Mogleo and the other Pomguard members were able to take care of their target as well, and with that the kupo nuts are saved. It seems that the two monsters may have followed Kupli Kuki and the other Twelveswood moogles all the way from the Sea of Clouds. Although this crisis got everyone's pom-pom in a twist, the moogles seem to have come through it with a deeper bond, and Mogleo suggests that everyone go together to report to Chieftain Moglin of your success.","You return to Moglin, and finally you have the opportunity to ask him about the Moghome names. While he doesn't know the exact reason that all the moogles in Moghome start with “Mog,” he informs you that the first chieftain was said to be named Moggle. Kupli Kuki fumbles around with the name for a bit before discovering that it is quite similar to Moggle Mog, and surmises that the name must have changed as the story was passed down from generation to generation in the Twelveswood. If Kupli Kuki's guess is right, then Chieftain Moglin is himself a direct descendant of Good King Moggle Mog XII, and the Pomguard are direct descendants of the Good King's household guard. Kupli Kuki is amazed that he is among such historic figures of mooglekind, although the Moghome moogles themselves do not seem very fazed at all. Mogleo finally closes this historic conversation by offering the Twelveswood moogles one kupo nut each for their previous bravery, an offer which the moogles eagerly agree to. The moogles look forward to deepening the bonds of friendship between sky and surface."],"objectives":["Speak with Moglin.","Speak with Mogleo.","Inquire about the monster in the kupo nut orchard.","Slay the monster to the southeast of Moghome.","Report to Mogleo.","Report to Moglin."],"dialogue":[{"name":"KUPLIKUKI","text":"To think the legends are actually <span class=\"emphasis\">true</span>─our ancestors did indeed come down from the skies, kupo! I'm sure Mogule and the others will get along famously!"},{"name":"KUPLIKUKI","text":"But, don't you think the moogles here have such strange names? There are so many moogles with names like Mogret and Mogmug, but no one is named Kuplo Kopp or Kupta Kapta! I wonder why..."},{"name":"KUPLIKUKI","text":"Chieftain Moglin seems to know much about moogle history─maybe he can shed some light on this mystery! But...I'm so nervous around <span class=\"emphasis\">chieftains</span>, kupo..."},{"name":"KUPLIKUKI","text":"But you, adventurer, you've rubbed shoulders with all kinds of great characters, and Chieftain Moglin respects you! I'm sure he'll readily tell you all about Moghome names. And then <span class=\"emphasis\">you</span> can tell <span class=\"emphasis\">me</span>!"},{"name":"KUPLIKUKI","text":"I can't wait to learn about their names, kupo..."},{"name":"MOGLOO","text":"No time to talk─our nuts are in danger, kupo!"},{"name":"MOGLIN","text":"Oh, <span class=\"highlight\">Forename</span>, so you've finally come to your senses and acknowledged the heavenly ring of Moghome names, kupo? That pleases me greatly, but I must ask you to wait─it seems Mogloo has an urgent entreaty."},{"name":"MOGLOO","text":"Yes, Chieftain Moglin, the Pomguard is fighting a desperate battle against a gang of monsters swarming our precious kupo nut orchard. We have beaten them back for now, but I fear we are outmatched, kupo!"},{"name":"MOGLIN","text":"Ah, luckily we have just the one to help. <span class=\"highlight\">Forename</span>, lend the Pomguard your strength, and mayhaps I will speak more with you about our moogle names, kupo."},{"name":"MOGLIN","text":"The defense of our kupo trees is of the utmost importance. Speak with Mogleo of the Pomguard to learn where he needs you. Once these monsters have been dealt with, ask me again about the knowledge you seek, kupo."},{"name":"MOGLIN","text":"Defense of the kupo nuts must needs come before all else. Speak with Mogleo to learn what he requires, then return to me once the crisis has been dealt with, kupo."},{"name":"MOGLEO","text":"Oh, adventurer, it's so good to see you again! As you can see, Pomguard business has me terribly busy these days, kupo! Speaking of which, where did those monsters go?"},{"name":"MOGLEO","text":"...Oh! You'll help us rid the area of those dreadful things? Thank heavens, this sword was getting so heavy. We're fighting valiantly to drive off the invaders─there are <span class=\"emphasis\">two</span> of them, so our paws are full, kupo! "},{"name":"MOGLEO","text":"The Pomguard have their paws tied with one, while Mogule and the Twelveswood moogles are trying their hardest to track down the other. The moogles from the surface have more courage than I thought, kupo!"},{"name":"MOGLEO","text":"I'll go help the other members of the Pomguard. Adventurer, hurry and make sure Mogule and the others are safe!"},{"name":"MOGLEO","text":"I'll lend my sword to the other Pomguard members. Adventurer, help Mogule and the others, kupo!"},{"name":"KUPLIKUKI","text":"Oh, you're here to help? Well, we drove that monster over to the southeast. I don't <span class=\"emphasis\">think</span> it managed to steal any kupo nuts."},{"name":"KUPLIKUKI","text":"I saw it fly over here! We'll find it soon, kupo!"},{"name":"KUPLIKUKI","text":"The monster was just around here. It can't be far─we have it cornered, kupo!"},{"name":"MOGULE","text":"I had it in my sights, but it flew away, kupo! Where could it be...?"},{"name":"KUPLIKUKI","text":"The monster is somewhere over there!"},{"name":"KUPLIKUKI","text":"It's some strange flying thing─I'll swat it out of the sky, kupo!"},{"name":"KUPLIKUKI","text":"It can't have gotten far─we almost have it, kupo!"},{"name":"MOGULE","text":"Where could it be, kupo...?"},{"name":"MOGLEO","text":"That beast was no match for the likes of the Pomguard, kupo! With the threat to our precious kupo nuts gone, the orchard is safe!"},{"name":"MOGLEO","text":"Those monsters were so strange... Odd-looking wings, curious pointed ears... I wonder where they could have come from, kupo?"},{"name":"KUPLIKUKI","text":"Oh no! They might have followed us here, kupo. We're sorry, we didn't mean to bring such rude guests with us."},{"name":"MOGLEO","text":"Well, as long as the kupo trees are safe, then there's nothing to worry about. Thanks to our new friends from the Twelveswood, not one nut was disturbed, kupo!"},{"name":"MOGLEO","text":"Let's report our success to Chieftain Moglin─he'll want to thank everyone who helped protect our prized trees!"},{"name":"MOGLEO","text":"Let's hurry back to Chieftain Moglin. He'll want to reward everyone for protecting the precious kupo nuts!"},{"name":"MOGULE","text":"We did it, kupo!"},{"name":"KUPLIKUKI","text":"Maybe Chieftain Moglin will finally tell us about the Moghome names."},{"name":"FORRESTMOG0201974","text":"I can't believe a monster followed us that far, kupo."},{"name":"FORRESTMOG0301976","text":"I'm quite tuckered out from chasing that monster around, kupo! "},{"name":"MOGLIN","text":"Ah, you've returned at last. Are the kupo nuts safe from harm?"},{"name":"MOGLEO","text":"Those malicious monsters won't be laying their paws on our nuts anymore, kupo, thanks to the help of the Twelveswood moogles!"},{"name":"MOGLIN","text":"Ah, it's so nice to see you working together to defend our home, kupo. Well, now that the storm has been weathered, I believe <span class=\"highlight\">Forename</span> wanted to know all about moogle names─hopefully it will serve as an inspiration to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"KUPLIKUKI","text":"Actually, Chieftain Moglin, <span class=\"emphasis\">I</span> was the one who asked the adventurer to ask you. I was thinking, isn't it curious that our names sound so different from yours, kupo?"},{"name":"KUPLIKUKI","text":"In the Twelveswood, we usually start our names with “Ku” or “Pu.” They say it's because it makes the names sound like “kupo nut.”"},{"name":"KUPLIKUKI","text":"Mayhap when the moogles came down from the sky, the kupo nuts were their most prized possession, kupo! But the Moghome moogles love kupo nuts too, so I've wondered why their names are different."},{"name":"MOGLIN","text":"You're quite perceptive, Kupli Kuki. Truth be told, I've never thought about the reason myself. Would it not make sense for moogles to start their name with “Mog”? It's been that way for as long as anyone can remember, kupo."},{"name":"MOGLIN","text":"My ancestor, who was Moghome's first chieftain, was named Moggle, and in fact it was he who decided which brave moogles would travel down to the surface after fire rained from the skies. "},{"name":"KUPLIKUKI","text":"Moggle... That name seems so familiar... Kupopo! Moggle Mog!?"},{"name":"KUPLIKUKI","text":"Could Chieftain Moggle have in fact been Moggle Mog? If so... Chieftain Moglin, you would be a descendant of Good King Moggle Mog XII─may all his lineage bask in greatness!"},{"name":"MOGLIN","text":"Indeed, the two names <span class=\"emphasis\">are</span> quite similar, kupo. Moggle Mog... I remember─this was the name of the king from your legend."},{"name":"KUPLIKUKI","text":"It all makes sense, kupo. The legend is so ancient, it's no wonder the name changed ever so slightly! That means I'm presenting myself before the descendant of the last king of mooglekind!"},{"name":"KUPLIKUKI","text":"The legends tell of more than just the king, kupo! The valiant household guard of Good King Moggle Mog XII─may his legend live on forevermore─is also detailed at some length. Does that mean that the Pomguard is also..."},{"name":"MOGLEO","text":"The history of the Pomguard is long and illustrious, dating back to Chieftain Moggle's humble beginnings, kupo. "},{"name":"KUPLIKUKI","text":"Kupopo! That means his household guard was actually the Pomguard. I'm among some of the most historic moogles of all time! "},{"name":"MOGLEO","text":"I never knew we were so important─how embarrassing! Oh, I almost forgot─ We never thanked you for helping us take down those dreadful monsters, kupo."},{"name":"MOGLEO","text":"For all of your brave services in defense of our lovely orchard, and in celebration of our newfound friendship, we shall bequeath upon you...one kupo nut each! "},{"name":"KUPLIKUKI","text":"Kupopo! I could think of no better a reward myself! Our stomachs will be full tonight!"}],"reward":{"gil":513,"items":[{"id":5682,"one":1},{"id":5667,"one":1},{"id":5672,"one":1}],"xp":43200},"reqs":{"jobs":[{"lvl":59,"id":34}],"questsType":"all","quests":[67197,67513]}},"partials":[{"type":"npc","id":"1014465","obj":{"i":1014465,"n":"Kupli Kuki","l":2002,"q":1}},{"type":"npc","id":"1012077","obj":{"i":1012077,"n":"Moglin","l":2002,"q":8}},{"type":"npc","id":"1012082","obj":{"i":1012082,"n":"Mogloo","l":2002,"q":4}},{"type":"npc","id":"1013712","obj":{"i":1013712,"n":"Mogule","l":2002,"q":4}},{"type":"npc","id":"1014462","obj":{"i":1014462,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014463","obj":{"i":1014463,"n":"Mogleo","l":2002,"q":1}},{"type":"npc","id":"1014466","obj":{"i":1014466,"n":"Kupli Kuki","l":2002,"q":1}},{"type":"npc","id":"1014467","obj":{"i":1014467,"n":"Moofy Moogle","l":2002,"q":1}},{"type":"npc","id":"1014468","obj":{"i":1014468,"n":"Moofy Moogle","l":2002,"q":1}},{"type":"npc","id":"1014469","obj":{"i":1014469,"n":"Motioning Moogle","l":2002,"q":1}},{"type":"npc","id":"1014470","obj":{"i":1014470,"n":"Motioning Moogle","l":2002,"q":1}},{"type":"item","id":"5682","obj":{"i":5682,"n":"Battledance Materia IV","l":70,"c":20216,"t":58,"materia":{"tier":3,"value":4,"attr":"Tenacity","category":0}}},{"type":"item","id":"5667","obj":{"i":5667,"n":"Heavens' Eye Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"5672","obj":{"i":5672,"n":"Savage Aim Materia IV","l":70,"c":20224,"t":58,"materia":{"tier":3,"value":4,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"67197","obj":{"i":67197,"n":"An Eye for Aether","g":3,"l":"Matoya's Cave","s":86}},{"type":"quest","id":"67513","obj":{"i":67513,"n":"The Skies That Bind","g":97,"l":"The Sea of Clouds","s":5904}}]}