{"quest":{"name":"The Son Also Rises","location":"Ishgard","id":67536,"patch":3.0,"sort":580,"icon":100456,"unlocksFunction":1,"eventIcon":71341,"issuer":1012498,"target":1012498,"involved":[1000153,1000776,1012505],"genre":136,"usedItems":[12583],"journal":["Barthovieu's face is the picture of steely resolution.","Barthovieu has been diligently practicing with his bow, and now believes himself ready and able to kill Nguruvilu. However, just as he makes his way to leave, he can find neither his weapon nor his son. Concerned, Barthovieu bids you seek Philipallais near the Holy Stables. Do so, and hope the boy has not done anything foolhardy.","You find Philipallais with his father's bow. Barthovieu arrives just in time to stop his son from throwing the weapon away, and demands an explanation. The child tearfully begs his father to stop chasing the dragon. If Barthovieu really must continue, Philipallais asks, why not use a trap to snare Nguruvilu? This way, his father would be able to slay the dragon from relative safety, and attain knighthood as well. Touched by his son's concern and impressed by the plan, Barthovieu enlists your aid in finding the perfect lumber. Since you cannot seem to think of anything, return to Timbermaster Beatin and ask him.","After listening to your conundrum, Beatin recommends lumber that is flexible as a greenwood, and resistant to cold. The trap will splinter under the wrath of a greater dragon without these qualities, he reasons. However, the timbermaster is unsure what specific kind of wood would be best, and directs you to Roiteloin in the central highlands of Coerthas. Speak with this learned botanist in Skyfire Locks, and see what he has to say.","Roiteloin thinks for but a moment before suggesting the perfect wood for your project: birch. Cut, plane, and deliver three lengths of high-quality lumber to Barthovieu.","Barthovieu accepts the lengths of birch, and thanks you for your time and trouble. He promises to build his trap together with Philipallais, and bids you await the good tidings of Nguruvilu's demise.<br><br>※The next carpenter quest will be available from Barthovieu upon reaching level 60."],"objectives":["Track down Philipallais near the Holy Stables.","Speak with Timbermaster Beatin in New Gridania.","Speak with Roiteloin in Skyfire Locks.","<span class=\"alternative-container\"><span class=\"alternative\">Craft lengths of birch lumber <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the lengths of birch lumber <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Barthovieu</span></span>."],"dialogue":[{"name":"BARTHOVIEU","text":"I'm glad of the chance to see you, <span class=\"highlight\">Forename</span>. Since last we spoke, I've spent every spare moment at the butts."},{"name":"BARTHOVIEU","text":"I'm now confident that I am worthy of your weapon, and with some luck, I'll be able to lay Nguruvilu low."},{"name":"BARTHOVIEU","text":"In fact, I'd have already left to do so, but the bow has gone missing. Haven't seen Philipallais today, either..."},{"name":"BARTHOVIEU","text":"You don't think...? Quickly, help me search. I'll look for the boy around the Brume if you take the Holy Stables."},{"name":"BARTHOVIEU","text":"Godsdammit, Philipallais, where are you?"},{"name":"PHILIPALLAIS","text":"If...if he doesn't have his bow, he can't leave!"},{"name":"BARTHOVIEU","text":"Philipallais! What in the seven hells were you thinking!?"},{"name":"PHILIPALLAIS","text":"Why do you have to fight Nguruvilu!? What if you don't come back this time, Father? What then!?"},{"name":"BARTHOVIEU","text":"Son... I <span class=\"emphasis\">will</span> come back. Why do you think I took up the bow? The dragon can't hurt me if he can't hit me."},{"name":"PHILIPALLAIS","text":"Like he didn't hit you last time!? You'd be dead if I hadn't told the priest!"},{"name":"BARTHOVIEU","text":"...What's that?"},{"name":"PHILIPALLAIS","text":"I told him! I begged him to help, so you...so that you wouldn't... You could have <span class=\"emphasis\">died</span>, Father!"},{"name":"BARTHOVIEU","text":"Philipallais, I never knew you worried so..."},{"name":"BARTHOVIEU","text":"But you've got to understand that there's no other path to knighthood for me. Without the dragon's head, we've got no future! And you deserve more than this life, son!"},{"name":"PHILIPALLAIS","text":"I like this life! I don't want you to die, Father..."},{"name":"BARTHOVIEU","text":"Son!"},{"name":"PHILIPALLAIS","text":"Father, if...if you really <span class=\"emphasis\">must</span> fight him, then find a safer way!"},{"name":"BARTHOVIEU","text":"If there were one, we'd all be dragonslayers."},{"name":"PHILIPALLAIS","text":"Have you even tried? My snares catch birds... Couldn't a large trap catch a dragon? Then you could kill it with ease!"},{"name":"BARTHOVIEU","text":"I...I suppose so, aye."},{"name":"PHILIPALLAIS","text":"We'd need the right kind of wood, but <span class=\"highlight\">Forename</span> could help with that─couldn't you?"},{"name":"BARTHOVIEU","text":"...That's the best idea I've heard so far. Some might call me a craven, but I can take that for the boy's sake... Let's give it a try!"},{"name":"BARTHOVIEU","text":"Can't leave him all alone. Like I was."},{"name":"BARTHOVIEU","text":"We'll need your help, <span class=\"highlight\">Forename</span>. And good lumber. For Nguruvilu, I'd say...three lengths at least. Do you know what won't splinter, even when holding a livid dragon?"},{"name":"BARTHOVIEU","text":"Well, what about your timbermaster? Wouldn't he know?"},{"name":"BARTHOVIEU","text":"Me and the boy're working on a design for the trap, <span class=\"highlight\">Forename</span>. Had any luck finding the proper wood?"},{"name":"BEATINE","text":"A snare? For a <span class=\"emphasis\">dragon</span>? That Ishgardian spear has led you to unexpected places, it seems."},{"name":"BEATINE","text":"Well, I can tell you a greenwood best suits your needs─the dragon's ire will destroy aught less pliable. New-cut timber can freeze, however. You must needs find a type resistant to cold climes."},{"name":"BEATINE","text":"Nothing readily jumps to mind. But I do know a botanist who works in the cold of Coerthas. He goes by the name Roiteloin, and you'll find him at Skyfire Locks. He is an expert of sorts, and I suggest you consult with him."},{"name":"BEATINE","text":"I thought I sent you to speak with Roiteloin at Skyfire Locks."},{"name":"BARTHOVIEU","text":"A greenwood strong against the Ishgardian cold? I'll ask around, but you're better off speaking with a botanist."},{"name":"ROITELOIN","text":"Out to trap a <span class=\"emphasis\">dragon</span>, eh? Well, you certainly don't want for ambition. I believe birch would be best for your purposes."},{"name":"ROITELOIN","text":"The wood doesn't share the beauty of oak or teak, but it has no equal when it comes to flexibility. Moreover, it absorbs little moisture as a greenwood, and will not turn brittle by freezing."},{"name":"BARTHOVIEU","text":"Have you had any luck finding the proper lumber, <span class=\"highlight\">Forename</span>?"},{"name":"BARTHOVIEU","text":"Birch, eh? If it's as flexible as you say, Nguruvilu won't be able to break free. Aye, I think I can build a fine trap out of this."},{"name":"BARTHOVIEU","text":"No doubt you went to some trouble. Here, have this. It's not much, but hopefully it shows my thanks. Now, let's see if I can't get that dragon, eh?"}],"reward":{"gil":770,"items":[{"num":240,"id":10},{"id":11873},{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":9}],"quests":[67535]},"next":[67537]},"partials":[{"type":"npc","id":"1012498","obj":{"i":1012498,"n":"Barthovieu","l":2300,"q":5}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000776","obj":{"i":1000776,"n":"Roiteloin","l":63,"q":4}},{"type":"npc","id":"1012505","obj":{"i":1012505,"n":"Philipallais","l":2300,"q":2}},{"type":"item","id":"11873","obj":{"i":11873,"n":"Titanium Halfheart Saw","l":120,"c":35019,"t":12,"p":18627}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12583","obj":{"i":12583,"n":"Birch Lumber","l":148,"c":22470,"t":50,"p":2784}},{"type":"quest","id":"67535","obj":{"i":67535,"n":"Ministers of Grace Defend Him","g":136,"l":"Ishgard","s":550,"f":1}},{"type":"quest","id":"67537","obj":{"i":67537,"n":"More Fierce than Fire","g":136,"l":"Ishgard","s":600,"f":1}}]}