{"quest":{"name":"The Social Knitwork","location":"Ul'dah","id":67538,"patch":3.0,"sort":502,"icon":100454,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1012548,"involved":[1011218,1011220,1012549],"genre":141,"journal":["Redolent Rose has a faraway look in his eyes.","It seems wanderlust is upon the guildmaster, who wishes to see Ishgardian nobles in their finery for himself. Alas, his commitments keep him in Ul'dah, and so he bids you go in his stead, and learn what passes for fashion in the Holy See. Unfortunately, the Weavers' Guild has no contacts in Ishgard, and so Redolent Rose suggests you speak with a guard of House Haillenarte in front of their manor's doors. Do so now, and hope that they will not throw you off the premises.","In spite of your airtight reason for being there, the guard politely informs you that House Haillenarte cannot afford your services. However, Bartelot continues, House Durendaire may be able to. Speak with the guard in front of Durendaire Manor.","Though you are once again turned away from the noble house's door, the House Durendaire guard suggests you speak with Glenda, a pious soul recently in need of a weaver. Find out why by speaking with her in Saint Reymanaud's Cathedral.","Glenda happily exclaims that you are the weaver to answer her prayers. It appears the widow has a daughter named Averil, who cannot─or will not─learn weaving. Glenda asks that you act as tutor to her willful child, and asks that you speak directly with Averil near the Arc of the Venerable.","You find Averil sitting near a fountain. Upon introducing yourself, you are treated to a tirade─the girl is sick and tired of living at home, prisoner of her mother's every whim. She had wanted to become a chirurgeon, but Glenda put paid to the very notion, and saddled her with weaving, a pursuit Averil has no love or patience for. However, Averil could use some new clothes, and since her mother is paying you, tells you to wait for her order.<br><br>※The next weaver quest will be available from Averil upon reaching level 53."],"objectives":["Speak with Bartelot outside Haillenarte Manor.","Speak with Framoncis outside Durendaire Manor.","Speak with Glenda in Saint Reymanaud's Cathedral.","Speak with Averil at the Arc of the Venerable."],"dialogue":[{"name":"REDOLENTROSE","text":"Greetings, <span class=\"highlight\">Forename</span>. I trust you haven't let your needlework lapse since last we spoke?"},{"name":"REDOLENTROSE","text":"I'm busy as ever, of course. The orders come and go, go and come. &lt;sigh&gt; Sometimes, I miss when I could wander abroad to study fashion. But that time is long past. The burden of being a guildmaster, I suppose..."},{"name":"REDOLENTROSE","text":"But you, my friend, are free as a bird, aren't you? Hm. I wonder if I mightn't travel vicariously through you, <span class=\"highlight\">Forename</span>. I'd love nothing more than to learn what the seamstresses have dreamed up during the Holy See's isolation!"},{"name":"REDOLENTROSE","text":"Yes, you could work there as a proper weaver, learning the tastes of lords and ladies alike. If you serve a noble house, all the better!"},{"name":"REDOLENTROSE","text":"I suppose that does raise the question of which noble house, of course. I've no connections in the Holy See, I'm afraid, and my knowledge of Ishgard is limited. Well, save for House Haillenarte..."},{"name":"REDOLENTROSE","text":"Their sigil is a red rose upon a field of black. A rose is a rose is a rose, as they say, and if one of their guardsmen has any wit, then you may well land a commission! ...Failing that, I will leave you to your own devices. Good luck!"},{"name":"REDOLENTROSE","text":"Ah, to see the splendor of Haillenarte Manor. I wonder, though, if their guards are as well-heeled as their lord..."},{"name":"BARTELOT","text":"Have we work for a weaver? No, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, I'm afraid we've not got the gil for such now."},{"name":"BARTELOT","text":"But the way I hear it, House Durendaire's rollin' in the coin. Make your pitch to one of their guards. Mayhap they'll throw some custom your way."},{"name":"BARTELOT","text":"Ask the House Durendaire guard if they're in the market for new blouses. I make a few of 'em in me spare time."},{"name":"FRAMONCIS","text":"Work? I can't promise you anything, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. It's above my station. Ah, but one moment..."},{"name":"FRAMONCIS","text":"I do remember hearing that Madam Glenda was looking for one with your skills. She's a widow of a noble, and the most devout soul in Ishgard. I imagine you'll find her in Saint Reymanaud's Cathedral."},{"name":"FRAMONCIS","text":"It is a comfort to know that a soul as devout as Madam Glenda stays in Saint Reymanaud's Cathedral for bells and bells, praying for Ishgard."},{"name":"GLENDA","text":"Why, yes, I am Glenda. And you're a weaver?"},{"name":"GLENDA","text":"Praise Halone! You are the answer to my prayers─consider yourself hired."},{"name":"GLENDA","text":"It's my daughter, Averil. I am schooling her in weaving, but no matter what I say, she doesn't learn. I have spent moons working with the child to no avail!"},{"name":"GLENDA","text":"I had nowhere to turn but to the Fury, and I begged Her for a proper tutor. Now, you are here."},{"name":"GLENDA","text":"Please, go to my daughter. I've told her time and again to stay at home, but she is a most willful child. So you'll likely find her idling about near the Arc of the Venerable."},{"name":"GLENDA","text":"She's like to be at the Arc of the Venerable. I don't know where else she might have gone. But she had better not have gone anywhere near the Brume..."},{"name":"AVERIL","text":"Yes, I'm Averil. Did Mother hire you? A pleasure to meet you, then. "},{"name":"AVERIL","text":"I was just taking a breath of air. It's so delightfully fresh here, unlike my stuffy old house. Honestly, I can't stand being stuck indoors."},{"name":"AVERIL","text":"It's always been just me and Mother. She lost Father to the war, and took comfort in religion. But now, she's only ever at the cathedral praying, or at home telling me how to talk, how to dress, how to act."},{"name":"AVERIL","text":"I wanted to be a chirurgeon to the knighthood. I'd even gotten quite good at conjury. But would Mother allow it? No, it wasn't <span class=\"emphasis\">maidenly</span> enough! Instead, she's saddled me with this insufferable weaving! Er...no offense."},{"name":"AVERIL","text":"Yes, I <span class=\"emphasis\">know</span> she's worried about losing me. But I ask you, what harm is there in me leaving the house? She's trying to keep me trapped in her little bloody cage for all my life!"},{"name":"GLENDA","text":"There you are, Averil! Ah, and I see you've met your new weaving instructor. Order anything you wish, my girl. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> work can be something you aspire to. But remember, practice makes perfect─so <span class=\"emphasis\">practice</span>!"},{"name":"GLENDA","text":"And I've told you a thousand times that a maid of your birth shouldn't hang about places like this. You belong at home, alongside your loom and rosary! Is that clear?"},{"name":"AVERIL","text":"...Yes, Mother."},{"name":"AVERIL","text":"What am I to do? I can't say no to her. She's sacrificed so much, raising me by herself. But I can't live like this forever."},{"name":"AVERIL","text":"So I'm forced to lie. My needlework isn't so bad in reality, but if she knew that..."},{"name":"AVERIL","text":"I've no intention of studying under you, kind as you seem to be. I simply have no need to."},{"name":"AVERIL","text":"But since Mother already has you on retainer...I suppose I could do with some new clothes. And my skills aren't equal to yours. So, when I find an article I can't make myself, I'll be in touch with my order. Until then."},{"name":"SYSTEM","text":"The next weaver quest will be available from Averil upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"gil":945,"items":[{"num":120,"id":12},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":14}],"questsType":"all","quests":[66190,65964]},"next":[67539]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1012548","obj":{"i":1012548,"n":"Averil","l":2301,"q":5}},{"type":"npc","id":"1011218","obj":{"i":1011218,"n":"Framoncis","l":2301,"q":2}},{"type":"npc","id":"1011220","obj":{"i":1011220,"n":"Bartelot","l":2301,"q":4}},{"type":"npc","id":"1012549","obj":{"i":1012549,"n":"Glenda","l":2301,"q":3}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"66190","obj":{"i":66190,"n":"A Miner Reborn","g":141,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67539","obj":{"i":67539,"n":"Tomboy Foolery","g":141,"l":"Ishgard","s":530,"f":1}}]}