{"quest":{"name":"A Child Apart","location":"Ishgard","id":67531,"patch":3.0,"sort":62,"eventIcon":71201,"issuer":1011192,"target":1011192,"involved":[1012169],"genre":3,"journal":["Gibrillont's face is a mask, but beneath it you sense something old and bitter.","Even a penitent can appreciate fine wine, and so Gibrillont would have you deliver a bottle to Gerraldieux, who tends to the poorest of the poor in the Brume. Head below and present Gibrillont's gift to the monk.","The scent of the twice-mulled wine is enough to bring Gerraldieux's memories of the young mother to the fore, and words unbidden begin to spill from his lips. So filled with love and compassion for her fellow man was she that, despite toiling tirelessly to feed and clothe her daughter, she took time to help Gerraldieux administer succor to the poor. Her loss was keenly felt, most of all by the child she left behind, whom even now the monk can recall passing days atop the walls, her raven black hair flowing in the wind as she stared out into the mists in silence. Leave the monk to his memories and return to the Forgotten Knight.","“She was a remarkable woman,” Gibrillont says after a time, and when you look into his eyes, you know he speaks the truth. For after all she was forced to endure, she still held fast to hope─if not for herself, then for her beloved daughter."],"objectives":["Deliver the twice-mulled wine to Gerraldieux.","Report to Gibrillont."],"dialogue":[{"name":"GIBRILLONT","text":"Even the penitent can appreciate wine from time to time. Take Gerraldieux, for example. Surely you've heard of him. No?"},{"name":"GIBRILLONT","text":"He's a monk who offers succor to the poorest of the poor in the Brume. A man of many vows, but none which prohibit spirituous beverages. Aye, if ever there was a man who deserved a drink, it'd be him."},{"name":"GIBRILLONT","text":"There's no shortage of suffering in this world, is there? Yet all too often, men of means are happy to turn a blind eye."},{"name":"GIBRILLONT","text":"“Why should I care? It's not my story,” they say. But they're wrong. They're a part of it, same as we all are."},{"name":"GERRALDIEUX","text":"Halone's blessings be upon you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I─ A gift? For me?"},{"name":"GERRALDIEUX","text":"This scent...how reminiscent of a wine once made by a dear old friend, may her soul rest in peace..."},{"name":"GERRALDIEUX","text":"Forsaken by her family, she toiled tirelessly to feed and clothe her child. Yet somehow she found time to help me tend to those in even worse circumstances, so compassionate she was, so full of love for her fellow man."},{"name":"GERRALDIEUX","text":"'Twas that love which gave her child strength to endure the scorn of the other younglings... &lt;sigh&gt; That little girl, bless her heart, she couldn't help what she was. Eventually, she won them over, but those first few years were trying─even more so when she had to start fending for herself."},{"name":"GERRALDIEUX","text":"I remember days she spent standing on the walls─raven black hair flowing in the wind, staring out, as if searching for her mother's face in the mists..."},{"name":"GERRALDIEUX","text":"I shall raise a glass to their memories tonight."},{"name":"GIBRILLONT","text":"...She was a remarkable woman, <span class=\"highlight\">Forename</span>."},{"name":"GIBRILLONT","text":"After everything she was forced to endure, she still remained hopeful for the future. For her daughter's future..."}],"reward":{"gil":496,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":142}],"quests":[67530]},"next":[67532]},"partials":[{"type":"npc","id":"1011192","obj":{"i":1011192,"n":"Gibrillont","l":2300,"q":10,"t":"Forgotten Knight Proprietor"}},{"type":"npc","id":"1012169","obj":{"i":1012169,"n":"Gerraldieux","l":2300,"q":1}},{"type":"quest","id":"67530","obj":{"i":67530,"n":"Noble Indiscretions","g":3,"l":"Ishgard","s":61}},{"type":"quest","id":"67532","obj":{"i":67532,"n":"Bloodlines","g":3,"l":"Ishgard","s":63}}]}