{"quest":{"name":"Bloodlines","location":"Ishgard","id":67532,"patch":3.0,"sort":63,"eventIcon":71201,"issuer":1011192,"target":1013260,"involved":[1013340],"genre":3,"journal":["Gibrillont has the look of a man weighing his words with the greatest of care.","We cannot escape the legacy left to us by our parents. The Mongrel and her pups have chosen to embrace that inescapable truth...but how can that information lead you to her?","Having discerned the purpose of Gibrillont's errands, you surmise that the Mongrel is none other than the raven-haired, ruby-eyed child born of the Elezen nobleman and the Hyuran woman. The reaction of the peasant you press for information serves to confirm your suspicions. Share your discovery with Alphinaud in the Forgotten Knight.","Though the whereabouts of the Mongrel are still unknown to you, Alphinaud feels confident that your newfound knowledge of her features will help greatly in your search."],"objectives":["Speak with the Brume starveling.","Speak with Alphinaud."],"dialogue":[{"name":"GIBRILLONT","text":"Some bonds are thicker than blood...but blood still defines us─and divides us in the end."},{"name":"GIBRILLONT","text":"It's the legacy of our parents, <span class=\"highlight\">Forename</span>, and we can't escape it, no matter how hard we try."},{"name":"GIBRILLONT","text":"So the Mongrel and her pups chose to embrace theirs─to proclaim it to all and sundry."},{"name":"GIBRILLONT","text":"If you can understand that, then maybe you can find her on your own."},{"name":"THEPOORA01996","text":"Still looking for your mongrel? Like I said before, take your pick. Plenty around, if you know where to look. Or did you fancy someone specific?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm looking for a mongrel with ruby red eyes and raven black hair."},{"name":"A1","text":"I'm looking for a mongrel with raven black eyes and ruby red hair."},{"name":"A1","text":"..."},{"name":"THEPOORA01996","text":"Ho, someone's got unusual tastes. Afraid I can't help you, though."},{"name":"THEPOORA01996","text":"<span class=\"emphasis\">Won't</span>, rather. It's bloody obvious you ain't of the Brume. Did you think I'd just tell you 'cause you asked nicely?"},{"name":"THEPOORA01996","text":"Doesn't ring a bell, sorry."},{"name":"THEPOORA01996","text":"What, coeurl got your tongue? Off you trot, then."},{"name":"ALPHINAUD","text":"Have you made any progress, <span class=\"highlight\">Forename</span>?"},{"name":"ALPHINAUD","text":"Hmm... So our mongrel was born of an Elezen nobleman and a Hyuran maidservant."},{"name":"ALPHINAUD","text":"Granted, it is no location, but it is far more information than we had before. Yes...now that her striking features are known to us, mayhap we need only remain vigilant."}],"reward":{"gil":496,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":142}],"quests":[67531]},"next":[67175]},"partials":[{"type":"npc","id":"1011192","obj":{"i":1011192,"n":"Gibrillont","l":2300,"q":10,"t":"Forgotten Knight Proprietor"}},{"type":"npc","id":"1013260","obj":{"i":1013260,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1013340","obj":{"i":1013340,"n":"Brume Starveling","l":2300,"q":2}},{"type":"quest","id":"67531","obj":{"i":67531,"n":"A Child Apart","g":3,"l":"Ishgard","s":62}},{"type":"quest","id":"67175","obj":{"i":67175,"n":"Fire and Blood","g":3,"l":"Ishgard","s":64}}]}