{"quest":{"name":"A-hunting He Will Go","location":"Ishgard","id":67534,"patch":3.0,"sort":530,"icon":100456,"unlocksFunction":1,"eventIcon":71341,"issuer":1012498,"target":1012498,"involved":[1012501],"genre":136,"usedItems":[10611],"journal":["You can see the ambition burning in Barthovieu's eyes.","Barthovieu has earned some coin, maybe even enough for a proper bow if you offer him a discount, anyway. He has killed many a lesser Dravanian, but the pay for these is low─true glory and coin are won with the heads of great dragons in Ishgard. Fashion Barthovieu his desired high-quality holy cedar composite bow, so that he may join the ranks of the great dragonslayers.","Barthovieu is overjoyed to receive his bow. He reveals that he means to kill Nguruvilu, a fearsome Dravanian with scales of steel. With this dragon's head, he says he can win a better life for himself and his boy. However, some unspoken conflict between father and son is keeping Philipallais away from home. Speak with the child near the manufactory, and try to convince him to return.","Philipallais tells you in no uncertain terms that he is currently hunting, and will not go home until he is through, whenever that is. Return to Barthovieu and pass along the message.","Barthovieu is not surprised to hear his son's message. However, he cannot wait for Philipallais to return home, and announces his intent to hunt Nguruvilu. The soldier thanks you again for your service, and vows to have something to show come your next meeting.<br><br>※The next carpenter quest will be available from Barthovieu upon reaching level 55."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Craft a holy cedar composite bow <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the holy cedar composite bow <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Barthovieu</span></span>.","Speak with Philipallais.","Report to Barthovieu."],"dialogue":[{"name":"BARTHOVIEU","text":"I was about to look for you! I've been checking the markets, and by my reckoning I've enough to pay for the best holy cedar composite bow you can fashion─if you'll allow me a discount."},{"name":"BARTHOVIEU","text":"I had to kill a number of lesser dragons for this coin. The pay's shite, since any fool with a pointed stick can do for them."},{"name":"BARTHOVIEU","text":"The real money's in the greater Dravanians. 'Tis where the glory is, too. A proper bow'll let me take one's head, and win my knighthood, with any luck."},{"name":"BARTHOVIEU","text":"I ask you on bended knee, friend─accept what I can pay, and make me a fine bow!"},{"name":"BARTHOVIEU","text":"I've long dreamed of owning a fine holy cedar composite bow. Please, adventurer..."},{"name":"BARTHOVIEU","text":"Why, 'tis light as a feather... Even in mail, my arm'll never tire while holding it! And the draw weight's <span class=\"emphasis\">thrice</span> that of my last bow! Aye, this'll fling a heavy broadhead a good two hundred yalms. Thank you, my friend!"},{"name":"BARTHOVIEU","text":"To tell the truth, I don't mean to hunt just any dragon. I've got a target in mind─Nguruvilu."},{"name":"BARTHOVIEU","text":"Bastard might as well be covered in steel armor. Even knights can't pierce his scales with their lances, let alone their arrows. But a well-aimed shot from this bow might slide between his plates!"},{"name":"BARTHOVIEU","text":"He's woken from a long sleep, you see. Last time he did, he left a trail of corpses. Nguruvilu's head will win me my knighthood, and a better life for my boy! Not that Philipallais sees it that way."},{"name":"BARTHOVIEU","text":"Could you call him, adventurer? He's always away from home these days. Spends all his time hunting out near the manufactory..."},{"name":"BARTHOVIEU","text":"I know Philipallais is at a difficult age, but must he spend all his time hunting by the manufactory? &lt;sigh&gt; If he'd just talk to me..."},{"name":"PHILIPALLAIS","text":"Shhh! Can't you see I'm busy hunting? These birds come into the city to avoid the winds."},{"name":"PHILIPALLAIS","text":"They're easy to catch, even without a bow. I just lay out traps for them."},{"name":"PHILIPALLAIS","text":"Father wants me to come home? No! He keeps leaving to fight dragons, no matter how many times he gets hurt! I...I don't want to see him."},{"name":"PHILIPALLAIS","text":"Tell my father whatever you want. But I'm not going home."},{"name":"BARTHOVIEU","text":"No luck? Sorry to have put you through that. I just...I just wanted to see his face before I left."},{"name":"BARTHOVIEU","text":"But no matter. I'm off to hunt, and if the gods are good, I'll have slain Nguruvilu by the time we meet next!"}],"reward":{"gil":390,"items":[{"num":160,"id":10},{"id":11915},{"id":11956,"one":1},{"id":11961,"one":1},{"id":11966,"one":1},{"id":11974,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":9}],"quests":[67533]},"next":[67535]},"partials":[{"type":"npc","id":"1012498","obj":{"i":1012498,"n":"Barthovieu","l":2300,"q":5}},{"type":"npc","id":"1012501","obj":{"i":1012501,"n":"Philipallais","l":2300,"q":1}},{"type":"item","id":"11915","obj":{"i":11915,"n":"Mythrite Claw Hammer","l":90,"c":35060,"t":13}},{"type":"item","id":"11956","obj":{"i":11956,"n":"Holy Rainbow Wedge Cap","l":80,"c":41646,"t":34,"p":7983}},{"type":"item","id":"11961","obj":{"i":11961,"n":"Holy Rainbow Coatee","l":80,"c":42469,"t":35,"p":9884}},{"type":"item","id":"11966","obj":{"i":11966,"n":"Holy Rainbow Gloves","l":80,"c":48264,"t":37,"p":7096}},{"type":"item","id":"11974","obj":{"i":11974,"n":"Holy Rainbow Bottoms","l":80,"c":45692,"t":36,"p":7603}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"10611","obj":{"i":10611,"n":"Holy Cedar Composite Bow","l":125,"c":32287,"t":4,"p":28512}},{"type":"quest","id":"67533","obj":{"i":67533,"n":"Lance of a Lifetime","g":136,"l":"Gridania","s":502,"f":1}},{"type":"quest","id":"67535","obj":{"i":67535,"n":"Ministers of Grace Defend Him","g":136,"l":"Ishgard","s":550,"f":1}}]}