{"quest":{"name":"Tomboy Foolery","location":"Ishgard","id":67539,"patch":3.0,"sort":530,"icon":100454,"unlocksFunction":1,"eventIcon":71341,"issuer":1012548,"target":1012548,"involved":[1012549],"genre":141,"usedItems":[11966],"journal":["Averil is pursing her lips in annoyance.","Averil asks you to distract her mother for a spell, as she wishes to go to tea with her friends. Glenda does not approve of this clique, and so has hidden Averil's favorite dress to prevent her from going. Allow Averil the time she needs to search her own house by visiting with Glenda in Saint Reymanaud's Cathedral.","Glenda is disheartened to learn Averil has not yet called upon your skills as a weaver, but is more than happy to detail her many thoughts on Ishgard's youth. You listen politely at first, but after the second bell you can feel your eyes glazing over, and by the third you are sleeping on your feet. Just when you think you can take no more, Glenda announces it is time for her to head home. Return now to Averil near the Arc of the Venerable, and pray that this ordeal has not been for naught.","Thankfully, Averil has found her dress. Her outfit is complete but for a pair of gloves, which she wore until they were unusable. Now, she bids you craft her a pair of high-quality holy rainbow gloves to match her favorite dress.","Averil is overjoyed to try on the holy rainbow gloves, and praises them to the high heavens. Impressed by your skills, she promises that she will have many and more things for you to make in the future─but only after tea and seeing her sweetheart.<br><br>※The next weaver quest will be available from Averil upon reaching level 55."],"objectives":["Speak with Glenda.","Report to Averil.","<span class=\"alternative-container\"><span class=\"alternative\">Craft holy rainbow gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the pair of holy rainbow gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Averil</span></span>."],"dialogue":[{"name":"AVERIL","text":"Ah, excellent. I know you were expecting me to have an order for you, but something else has come up. I wonder if you might keep my mother occupied for a spell."},{"name":"AVERIL","text":"I've plans to have tea with my conjurer friends. And Mother won't let me go. She hasn't <span class=\"emphasis\">said</span> anything, of course, but she's hidden my favorite dress. I know what that means."},{"name":"AVERIL","text":"But I <span class=\"emphasis\">am</span> going, and in that dress, too! <span class=\"emphasis\">He'll</span> be there─my first sweetheart. And I would just die if he sees me in anything else!"},{"name":"AVERIL","text":"...Ahem. I know how this must seem to you. But my point is that I shall need time to search my house, and I've no one else to turn to."},{"name":"AVERIL","text":"Please, keep my mother busy. She'll be where she always is─in the cathedral. Just ask her about religion or something. That'll keep her there for bells!"},{"name":"AVERIL","text":"Oh, did I forget to tell you where the cathedral is? Just up those steps and around."},{"name":"Q1","text":"<span class=\"highlight\">Forename</span>? You...haven't come to pray, have you?"},{"name":"Q1","text":"Have you come to pray?"},{"name":"A1","text":"Yes, I am one with Halone."},{"name":"A1","text":"No, I'm afraid not."},{"name":"GLENDA","text":"A likely story! You wandered in here out of boredom, didn't you? Has my daughter made even a <span class=\"emphasis\">single</span> request of you!?"},{"name":"GLENDA","text":"I thought as much. Has Averil asked you to make even a <span class=\"emphasis\">single</span> garment?"},{"name":"GLENDA","text":"&lt;sigh&gt; Of course not. If only she'd take to weaving and forget this chirurgeon nonsense. You may think me unfair, but my daughter is everything to me, and I cannot..."},{"name":"GLENDA","text":"When I lost my husband, I would have lost my mind had it not been for Averil. I won't let the war take her from me, too. There is absolutely no need for her to see battle!"},{"name":"GLENDA","text":"But her so-called friends seem to speak of nothing but fighting! They're little more than maids, but do they act maidenly? Really, the young ladies these days are..."},{"name":"GLENDA","text":"...Dear me, I've talked your ear off! Well, I'd best be getting home now. Thank you, though. If only more of our young were as good listeners as you."},{"name":"AVERIL","text":"<span class=\"highlight\">Forename</span>! I've found my dress! It's hardly a splendid evening gown, but Mother never bought me better."},{"name":"AVERIL","text":"I couldn't find the dress gloves, though. Mother must have thrown them away. In fairness, I'd used them so much that the fingers had worn through."},{"name":"AVERIL","text":"Could you make me a new pair? I'd like something tasteful that matches my dress. Holy rainbow gloves would do it, I should think, as pretty as you can make."},{"name":"AVERIL","text":"Have you finished my holy rainbow gloves? Sorry, I don't mean to rush you─it's just that I'm bursting to see my friends."},{"name":"AVERIL","text":"These are absolutely gorgeous, <span class=\"highlight\">Forename</span>! The cloth has such a luster, and the stitching is so fine! Why, I feel as though I could dance, they're so wonderful!"},{"name":"AVERIL","text":"Ahhh, I never could've made something so splendid! It must be so sublime, to bring happiness to people with your handiwork!"},{"name":"AVERIL","text":"Oh, and tea! Tea will be all the more wonderful now! I can't wait to see what my childhood sweetheart thinks of these. It's been beastly trying to meet him, you know, because Mother never approved of him being from the Brume."},{"name":"AVERIL","text":"But he's the most gentle soul...albeit a bit clumsy. I don't know what he'd do without me."},{"name":"AVERIL","text":"Well, now that I've seen your work with my own two eyes, there are about a hundred things I'd like you to make! I will be in touch. After tea, of course."}],"reward":{"gil":390,"items":[{"num":160,"id":12},{"id":11935},{"id":11956,"one":1},{"id":11961,"one":1},{"id":11966,"one":1},{"id":11974,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":14}],"quests":[67538]},"next":[67540]},"partials":[{"type":"npc","id":"1012548","obj":{"i":1012548,"n":"Averil","l":2301,"q":5}},{"type":"npc","id":"1012549","obj":{"i":1012549,"n":"Glenda","l":2301,"q":3}},{"type":"item","id":"11935","obj":{"i":11935,"n":"Holy Cedar Spinning Wheel","l":90,"c":35558,"t":23}},{"type":"item","id":"11956","obj":{"i":11956,"n":"Holy Rainbow Wedge Cap","l":80,"c":41646,"t":34,"p":7983}},{"type":"item","id":"11961","obj":{"i":11961,"n":"Holy Rainbow Coatee","l":80,"c":42469,"t":35,"p":9884}},{"type":"item","id":"11966","obj":{"i":11966,"n":"Holy Rainbow Gloves","l":80,"c":48264,"t":37,"p":7096}},{"type":"item","id":"11974","obj":{"i":11974,"n":"Holy Rainbow Bottoms","l":80,"c":45692,"t":36,"p":7603}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67538","obj":{"i":67538,"n":"The Social Knitwork","g":141,"l":"Ul'dah","s":502,"f":1}},{"type":"quest","id":"67540","obj":{"i":67540,"n":"For Lover and Country","g":141,"l":"Ishgard","s":550,"f":1}}]}