{"quest":{"name":"More Fierce than Fire","location":"Ishgard","id":67537,"patch":3.0,"sort":600,"icon":100456,"unlocksFunction":1,"eventIcon":71341,"issuer":1012498,"target":1013686,"involved":[1012505,1013596,1013597,1013600,1013601,1013685],"genre":136,"usedItems":[10609],"journal":["Barthovieu's furrowed brow does not look promising.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Carpenter III</span>.</span>","Through no fault of the wood you provided, Nguruvilu escaped the trap. Barthovieu has learned from this experience that his knowledge of the dragon is far from complete, and now wishes to examine one of its scales. He believes at least one may have fallen from the Dravanian inside the snare. Make your way now to the Convictory, and speak with one of the soldiers there to examine the now-burned trap.","Upon speaking with the shivering soldier, you learn that he has chopped up what remained of the trap for firewood. However, in so doing, he found a spearhead, and reasons that the weapon was buried within Nguruvilu's body. Insofar as this cannot be burned to provide warmth, he gives it to you. Return with it to Barthovieu in the Brume, and see if it has any significance.","Barthovieu is astounded─the spearhead is his father's, and once adorned the selfsame lance that began this adventure. He realizes that his sire was not killed by beastkin, but rather died fighting Nguruvilu, as a knight. The lance remained in the dragon's body until it flew over the Black Shroud. The spearhead came loose but recently. Barthovieu exclaims he can now kill the dragon by driving a lance through the wound in Nguruvilu's scales. Philipallais is upset by this development and rushes off, but Barthovieu is not dissuaded. He bids you make him a spear able to finally put paid to the fiend─a high-quality adamantite trident.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Carpenter III</span>.</span>","Barthovieu's eyes are alight with excitement when you hand him his adamantite trident. He vows to take Nguruvilu's life. However, before he leaves, he asks that you speak with Philipallais. Find the child near the Holy Stables, and try to make him see why Barthovieu must fight this fight.","Philipallais is amazed to hear that his father is going to battle for the sake of his long-dead sire. After a moment's thought, he resolves to believe in Barthovieu. He asks that you accompany him to watch the battle. Head to the north of the Convictory, and rendezvous with Barthovieu.","Barthovieu's battle with Nguruvilu is pitched, and your friend appears to be losing. Just as Philipallais looks away, Barthovieu manages to strike the killing blow, driving the lance you made him deep into Nguruvilu's breast. Speak now with Barthovieu to the north of the Convictory, and congratulate him on his victory.","Barthovieu is elated, both by his triumph and that his son was there to see it. However, he acknowledges that he has done wrong by his own father, and wishes now to visit his grave. Join him in saying thank you in the lichyard in Gorgagne Mills.","You stand and watch as Barthovieu offers apologies over his father's grave, and introduces his own son. Now that he is a true dragonslayer, Barthovieu vows to clear his father's name. Last but not least, he thanks you, his steadfast companion, for helping him along during his journey toward redemption.<br><br>※The next carpenter quest will be available from Beatin once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with the shivering knight at the Convictory.","Deliver the furite spearhead to Barthovieu.","<span class=\"alternative-container\"><span class=\"alternative\">Craft an adamantite trident <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the adamantite trident <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Barthovieu</span></span>.","Speak with Philipallais near the Holy Stables.","Rendezvous with Barthovieu north of the Convictory.","Speak with Barthovieu.","Speak with Barthovieu east of Gorgagne Mills."],"dialogue":[{"name":"BARTHOVIEU","text":"I <span class=\"emphasis\">had</span> him, <span class=\"highlight\">Forename</span>! Right in the trap, writhing..."},{"name":"BARTHOVIEU","text":"But I made a stupid mistake. True, Nguruvilu couldn't <span class=\"emphasis\">force</span> his way out, but...well, I never took him for a fire breather."},{"name":"BARTHOVIEU","text":"'Course, I loosed arrows like a madman when he broke free. But my arrows just bounced off his scales. So I fled, like I promised Philipallais."},{"name":"BARTHOVIEU","text":"But I'm not done yet. This experience has taught me that I don't know Nguruvilu as I ought to. He must have a weak spot, and I mean to find it. I'd like your help, if you're willing."},{"name":"BARTHOVIEU","text":"His armor is the problem. I've got to figure out how to pierce it. And he thrashed about in the trap enough that I'm wagering he left a scale behind."},{"name":"BARTHOVIEU","text":"Could you go and examine the wreckage? It's in the Convictory now. Give the soldier there my name, and he'll let you have a look."},{"name":"BARTHOVIEU","text":"We'll discuss a strategy when you return. For the moment, I'd like to spend some time with my boy."},{"name":"BARTHOVIEU","text":"The trap's in the Convictory─what remains of it, at least."},{"name":"SAMUGARI02001","text":"Barthovieu? Oh, the trap... Made that into firewood, I did. It's freezing here!"},{"name":"SAMUGARI02001","text":"Found a spearhead, though. Stuck in the dragon, most like. Have it. Can't burn it, can I?"},{"name":"SAMUGARI02001","text":"You want to know the dragon's weak spot? You're bloody demanding! Was the spearhead not good enough for you!?"},{"name":"BARTHOVIEU","text":"Well? Did you find Nguruvilu's scale?"},{"name":"BARTHOVIEU","text":"Seven hells, <span class=\"highlight\">Forename</span>... Remember my father's spear? This...this is its spearhead! This can only mean he fought Nguruvilu!"},{"name":"BARTHOVIEU","text":"But that means...that means Nguruvilu killed him! My father died a knight's death!"},{"name":"BARTHOVIEU","text":"Father must've driven his lance into Nguruvilu! It stayed in the dragon's body, even through his twenty-year sleep... &lt;sniff&gt;"},{"name":"BARTHOVIEU","text":"When the dragon awoke, he flew somewhere over the Shroud, where the shaft fell. Only the spearhead remained..."},{"name":"BARTHOVIEU","text":"By finding the pieces of the lance, we've learned the truth. But fate's been even kinder than that. It's given us the way to kill Nguruvilu, too."},{"name":"BARTHOVIEU","text":"Somewhere, between the dragon's scales, is an open wound! The spearhead long lodged there will have kept it agape. If I send an arrow into it..."},{"name":"BARTHOVIEU","text":"But can I hit such a target? If I miss... No. I cannot risk it. Only the lance will serve here."},{"name":"PHILIPALLAIS","text":"N-No! Please don't, Father! It's too dangerous!"},{"name":"PHILIPALLAIS","text":"Grandfather fought Nguruvilu with a lance, and <span class=\"emphasis\">died</span>! You barely escaped last time, and only because you were using a bow!"},{"name":"BARTHOVIEU","text":"I can end this with one thrust, Philipallais. Besides, I'm better with the spear─and I've got an ally your grandfather didn't have."},{"name":"BARTHOVIEU","text":"<span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> can fashion me a weapon, finer than my father's. I won't lose, son... I can't lose!"},{"name":"PHILIPALLAIS","text":"Fine! Die! See if I care!"},{"name":"BARTHOVIEU","text":"Son... I'm sorry, but my mind is made up. <span class=\"highlight\">Forename</span>, I need a new lance. My father's was furite, but I wish for an adamantite trident."},{"name":"BARTHOVIEU","text":"It's worth the gil, even to dip into my reserve coin. And if it allows me to clear my father's sullied name, you can name your price!"},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Carpenter III</span>."},{"name":"BARTHOVIEU","text":"I'll have Nguruvilu's life for my father's, <span class=\"highlight\">Forename</span>."},{"name":"BARTHOVIEU","text":"Aye, this is what I need─a spearhead keen as a dragon's claw, and a sturdy haft, welcoming to the hand. Even from you, this is better than I dreamed."},{"name":"BARTHOVIEU","text":"To slay Nguruvilu, I'll have to drive this into his heart through the wound my father left. I have no doubt I can do so with this."},{"name":"BARTHOVIEU","text":"I'll lie in wait for the Dravanian where he hunts, to the north of the Convictory."},{"name":"BARTHOVIEU","text":"But I've got one last request to make of you. Philipallais'll be sulking 'round the Holy Stables. Please, tell him why I'm doing this, and that I will be coming home!"},{"name":"BARTHOVIEU","text":"Philipallais needs to know that I <span class=\"emphasis\">will</span> come home. No matter what."},{"name":"PHILIPALLAIS","text":"For Grandfather's honor? He...he really said that?"},{"name":"PHILIPALLAIS","text":"He's never said anything nice about Grandfather... Milksop. Lackwit. Traitor, even. But maybe he always believed. Secretly."},{"name":"PHILIPALLAIS","text":"...All right. I'll believe in my father, too."},{"name":"PHILIPALLAIS","text":"I can't just sit back and wait for him to come home, can I? Please, come with me to watch him, <span class=\"highlight\">Forename</span>!"},{"name":"BARTHOVIEU","text":"You've spoken with Philipallais? Good. Now I can go into battle with a clear mind."},{"name":"PHILIPALLAIS","text":"B-But the spear... And Nguruvilu was...?"},{"name":"BARTHOVIEU","text":"Did you see that, Father? Couldn't have done it without you."},{"name":"PHILIPALLAIS","text":"You did it, you did it!"},{"name":"BARTHOVIEU","text":"Philipallais? What in Halone's name are you doing here!?"},{"name":"PHILIPALLAIS","text":"Father! The way you moved with the lance... I was wrong to doubt you! You're a proper dragonslayer now!"},{"name":"BARTHOVIEU","text":"Heh, I am at that. I've avenged my father, and cleared his name─I've earned the bloody title!"},{"name":"BARTHOVIEU","text":"When the order recognizes me, you'll finally get the life you deserve, son."},{"name":"BARTHOVIEU","text":"<span class=\"highlight\">Forename</span>, I asked much of you, and you never let me down. You've got my thanks."},{"name":"BARTHOVIEU","text":"I could not have slain Nguruvilu without this lance. If only my father had such a fine weapon..."},{"name":"BARTHOVIEU","text":"I've got to go to where he rests, and apologize... I lost faith in him. I listened to what others said. Hells, I've said more than my fair share of unkind things over the years, too..."},{"name":"PHILIPALLAIS","text":"Where is he, Father?"},{"name":"BARTHOVIEU","text":"Nearby. I've never been. But it's time you met him, Philipallais."},{"name":"BARTHOVIEU","text":"Me and the boy'll visit my father's grave. It's in the lichyard in Gorgagne Mills, not so far from here."},{"name":"BARTHOVIEU","text":"He would've liked you, <span class=\"highlight\">Forename</span>. Why not join us?"},{"name":"PHILIPALLAIS","text":"Father was <span class=\"emphasis\">amazing</span>! Thank you for giving me the chance to see him."},{"name":"BARTHOVIEU","text":"Be good to introduce the boy to my father. I trust you'll join us?"},{"name":"BARTHOVIEU","text":"Father, I... Er... This is <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s the one who made the trident. Uh...what I'm trying to say is...Nguruvilu's dead. I killed him."},{"name":"BARTHOVIEU","text":"And this, this is Philipallais. He's my son...and your grandson. I should've brought him sooner."},{"name":"BARTHOVIEU","text":"I should've done a good many things sooner. Believe in you. Defend your honor. You <span class=\"emphasis\">were</span> a brave knight, and...and a better man than me."},{"name":"BARTHOVIEU","text":"Mine was the blow that killed Nguruvilu, but only because your thrust was true. Farewell, Father. I'll be back."},{"name":"BARTHOVIEU","text":"We'll go and make the truth about my father known to the Temple Knights. Aye, and the dragon's death, too. Thank you, <span class=\"highlight\">Forename</span>. None of this would've been possible without you."},{"name":"PHILIPALLAIS","text":"Thank you, <span class=\"highlight\">Forename</span>. Father never would've come this far without you."},{"name":"SYSTEM","text":"This concludes the carpenter quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next carpenter quest will be available from Beatin."}],"reward":{"gil":599,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":9}],"quests":[67536]},"next":[67977]},"partials":[{"type":"npc","id":"1012498","obj":{"i":1012498,"n":"Barthovieu","l":2300,"q":5}},{"type":"npc","id":"1013686","obj":{"i":1013686,"n":"Barthovieu","l":2200,"q":1}},{"type":"npc","id":"1012505","obj":{"i":1012505,"n":"Philipallais","l":2300,"q":2}},{"type":"npc","id":"1013596","obj":{"i":1013596,"n":"Shivering Knight","l":2200,"q":1}},{"type":"npc","id":"1013597","obj":{"i":1013597,"n":"Barthovieu","l":2200,"q":1}},{"type":"npc","id":"1013600","obj":{"i":1013600,"n":"Barthovieu","l":2200,"q":1}},{"type":"npc","id":"1013601","obj":{"i":1013601,"n":"Philipallais","l":2200,"q":1}},{"type":"npc","id":"1013685","obj":{"i":1013685,"n":"Philipallais","l":2200,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"10609","obj":{"i":10609,"n":"Adamantite Trident","l":150,"c":31891,"t":5,"p":34214}},{"type":"quest","id":"67536","obj":{"i":67536,"n":"The Son Also Rises","g":136,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"67977","obj":{"i":67977,"n":"Uncharted Territory","g":136,"l":"Gridania","s":601,"f":1}}]}