{"quest":{"name":"Spinning the Truth","location":"Ishgard","id":67541,"patch":3.0,"sort":580,"icon":100454,"unlocksFunction":1,"eventIcon":71341,"issuer":1012548,"target":1012548,"involved":[1012549],"genre":141,"usedItems":[12596],"journal":["Averil's eyes are shining with glee.","Averil reveals that she is now officially a chirurgeon, and can join Freskin in battle. Glenda may suspect something is up, however, for she has recently demanded that Averil spin a wool donation. Averil has done so, and asks that you take it to her mother in Saint Reymanaud's Cathedral.","You hand over the wool donation to a nonplussed Glenda, who demands in return that you tell Averil to fashion monastic robes. Return to the Arc of the Venerable, and inform Averil now.","Averil is shocked to hear her mother's request. Much as she would like you to make the monastic robes in her place, she understands that she must do it by herself. However, Averil continues, her mother never forbade you from making the <span class=\"emphasis\">materials</span> for the robes. To that end, she asks that you spin her three spindles of high-quality crawler silk.","Using the crawler silk you painstakingly spun, Averil weaves and sews a fine set of monastic robes that pass even Glenda's stern inspection. With a hint of devilish glee, Averil announces that she will be staying out longer and later, and Glenda walks off in a huff. Averil says she will continue practicing, and will call upon you one last time when the day of battle draws near.<br><br>※The next weaver quest will be available from Averil upon reaching level 60."],"objectives":["Deliver the donation of wool to Glenda.","Report to Averil.","<span class=\"alternative-container\"><span class=\"alternative\">Craft spindles of crawler silk <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the spindles of crawler silk <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Averil</span></span>."],"dialogue":[{"name":"AVERIL","text":"<span class=\"highlight\">Forename</span>! I've wonderful tidings: House Durendaire accepted me as a chirurgeon! I can go with Freskin now!"},{"name":"AVERIL","text":"Of course, I've yet to tell Mother...but she's been acting strangely. Why, she asked me to spin a wool donation, and told me she needed it last bell!"},{"name":"AVERIL","text":"So I worked as fast as I could, and just finished it. I hate to ask, but would you be a dear and take it to her?"},{"name":"AVERIL","text":"I ought to deliver it myself. But Freskin has been training with his master-at-arms, and I'm worried about him. I'd like to inspect him when he gets back to make sure he's all right."},{"name":"AVERIL","text":"Why would Mother need that donation now? Surely the cathedral can't want for wool."},{"name":"GLENDA","text":"You? What are <span class=\"emphasis\">you</span> doing here?"},{"name":"GLENDA","text":"Oh, I had hoped Averil would come herself. But I wasn't expecting her until later. She shouldn't have finished this quickly..."},{"name":"GLENDA","text":"Maybe she is improving. Very well. Tell her to make a set of monastic robes."},{"name":"GLENDA","text":"If she can't do it, she will not be leaving the house on these ridiculous outings. I will forbid it! She has everything she needs for weaving in her chambers."},{"name":"GLENDA","text":"And don't you dare make the robes for her. If you sew so much as one stitch, I will be able to tell!"},{"name":"GLENDA","text":"Tell my daughter to make a set of fine monastic robes."},{"name":"AVERIL","text":"Freskin is safe, though he managed to bang himself up a bit on the road home, somehow. Now what of Mother? She wasn't too angry, was she?"},{"name":"AVERIL","text":"Is that a jest!? I can't just make monastic robes with a...with a flick of my wrist!"},{"name":"AVERIL","text":"It's as if she's sensed I'm lying! Why else would she burden me with an impossible task, and take my freedom if I fail?"},{"name":"AVERIL","text":"Gods, if only you could do it for me. But Mother will notice, and then I'll be locked at home forever and ever! &lt;sigh&gt; I'll just have to roll up my sleeves and do it myself."},{"name":"AVERIL","text":"Where do I begin? What do you use for monastic...oh, that's right─crawler silk. Ugh. It's impossible to find any of quality in Ishgard."},{"name":"AVERIL","text":"...But it's not cheating if <span class=\"emphasis\">you</span> spin me the silk, and <span class=\"emphasis\">I</span> make the robe, is it? Haha, that's it! I can do this if you make me three spindles! Please?"},{"name":"AVERIL","text":"Honestly, what is she thinking? I'll show Mother I can do it! I just need crawler silk."},{"name":"AVERIL","text":"Beautiful! This is exactly what I'd expect from you, <span class=\"highlight\">Forename</span>. Gods willing, it shouldn't be too hard to make monastic robes using <span class=\"emphasis\">these</span> materials."},{"name":"AVERIL","text":"I'll get to weaving them now. Wait here─I'd like you to look over my effort."},{"name":"AVERIL","text":"Well, that turned out much better than I expected! All thanks to the crawler silk you spun me, I daresay."},{"name":"GLENDA","text":"Averil! What are you doing, loafing about here? I gave you a task!"},{"name":"AVERIL","text":"Hello to you, too, Mother. Oh, and the robes <span class=\"emphasis\">are</span> finished."},{"name":"GLENDA","text":"What? How!? Did <span class=\"highlight\">Forename</span> make them for you? Are you passing <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> work off as your own!? Don't lie to me, girl!"},{"name":"AVERIL","text":"Why, Mother, you wrong me! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> did obtain the materials, but I stitched the robes from collar to hem <span class=\"emphasis\">entirely</span> by myself, thank you."},{"name":"GLENDA","text":"Hmmm... The seams aren't quite even. Very much <span class=\"emphasis\">your</span> handiwork."},{"name":"AVERIL","text":"I'm <span class=\"emphasis\">so</span> happy you're satisfied, Mother. I take it I have your permission to be away from home more often? It's just more <span class=\"emphasis\">pleasant</span> outside, don't you think?"},{"name":"GLENDA","text":"Hmph! Arrogant girl! You remind me of─ Hmph!"},{"name":"AVERIL","text":"What in the world...?"},{"name":"AVERIL","text":"Oh, who cares? She didn't say no─I've got all the time I need to practice conjury now! Thank you again, <span class=\"highlight\">Forename</span>. I'll call you again for one last request, if that's all right. Just before Freskin and I leave."}],"reward":{"gil":412,"items":[{"num":240,"id":12},{"id":11893},{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":14}],"quests":[67540]},"next":[67542]},"partials":[{"type":"npc","id":"1012548","obj":{"i":1012548,"n":"Averil","l":2301,"q":5}},{"type":"npc","id":"1012549","obj":{"i":1012549,"n":"Glenda","l":2301,"q":3}},{"type":"item","id":"11893","obj":{"i":11893,"n":"Dragon Fang Needle","l":120,"c":35518,"t":22,"p":12545}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12596","obj":{"i":12596,"n":"Crawler Silk","l":145,"c":21657,"t":51,"p":2109}},{"type":"quest","id":"67540","obj":{"i":67540,"n":"For Lover and Country","g":141,"l":"Ishgard","s":550,"f":1}},{"type":"quest","id":"67542","obj":{"i":67542,"n":"Never Leave without a Good-bye","g":141,"l":"Ishgard","s":600,"f":1}}]}