{"quest":{"name":"For Lover and Country","location":"Ishgard","id":67540,"patch":3.0,"sort":550,"icon":100454,"unlocksFunction":1,"eventIcon":71341,"issuer":1012548,"target":1012548,"involved":[1003818,1012550,1012551],"genre":141,"usedItems":[10881],"journal":["Averil has a dreamy air to her.","Averil had an amazing tea, in no small part because her love was at the party. However, she is distressed to learn that he is bound for the front lines. Averil has made up her mind to join him when he leaves to keep him safe as a chirurgeon. Now, she must improve her own skills as a conjurer, and asks that you fashion her a hat. But not just a chirurgeon's hat, for then her mother would catch wind of Averil's plans. Instead, the hat must be fashionable. Unfamiliar with fashion herself, Averil asks you to speak with the more dapper townspeople to find out what is in vogue.","The natty townsfolk have informed you in no uncertain terms that cavalier's hats are in. Return to Averil and tell her of this interesting development.","Having heard your report, Averil requests that you fashion a cavalier's hat for her. However, she is unsure how to make it worthy of a conjurer, and so bids you speak with Redolent Rose in Ul'dah.","Though Redolent Rose is a bit taken aback by your request, he nevertheless rises to the challenge. He recommends holy rainbow cloth as perfect for your current project. Now, fashion a high-quality holy rainbow hat of healing and deliver it to Averil near the Arc of the Venerable.","Averil is thrilled with her new hat, and is in the middle of extolling its virtues when a young soldier stumbles up, wounded. Averil uses her magicks to heal him, then introduces him as Freskin, her “special” friend. Before the conversation can go anywhere, however, Averil realizes it would not do for her mother to see her together with Freskin, and shoos him away. After he has gone, she tells you she means to practice her conjury, but will likely have more to ask of you soon.<br><br>※The next weaver quest will be available from Averil upon reaching level 58."],"objectives":["Question the well-dressed townspeople.","Report to Averil.","Speak with Redolent Rose.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a holy rainbow hat of healing <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the holy rainbow hat of healing <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Averil</span></span>."],"dialogue":[{"name":"AVERIL","text":"It was absolutely perfect, <span class=\"highlight\">Forename</span>! Tea, I mean. My sweetheart was there. He hadn't changed a bit, the clumsy dear!"},{"name":"AVERIL","text":"It's just...he's not doing so well. He didn't have the head for conjury, so he's given it up. Now, he means to serve House Durendaire as a soldier."},{"name":"AVERIL","text":"But he's just not cut out for it! I realize he has no choice, but his first battle is fast approaching, and I'm worried he won't come back."},{"name":"AVERIL","text":"So I'm going with him. The poor thing needs someone to watch over him."},{"name":"AVERIL","text":"I can't just go to war, though. I'll need to be accepted as a chirurgeon first, and that means getting my conjury up to snuff! I'll need the proper attire, too, if you catch my drift."},{"name":"AVERIL","text":"Firstly, I want a hat. It can't just be a chirurgeon's hat, though. Mother will catch wind of my plans in an instant. No, I'll only get away with this if it looks like something a prim young lady would wear."},{"name":"AVERIL","text":"Unfortunately, I've no idea what's in fashion, let alone what the prim young ladies are wearing. That's where I'd like you to begin. I'm sure the more dapper townsfolk would be happy to tell you about their hats."},{"name":"AVERIL","text":"If you're wondering where fashionable people go, I think it's the Last Vigil. I'm sure a couple of them up there can tell you what's in style."},{"name":"MACHIBITOA","text":"What hats are in vogue this season? Cavalier's hats─everyone who's anyone knows that!"},{"name":"MACHIBITOB","text":"Oh, cavalier's hats are all the rage. Knights wore them first, of course, so they lend the wearer an air of chivalry!"},{"name":"AVERIL","text":"Cavalier's hats... Huh. Who would've thought? Well, in any case, that takes care of the form. But what of the function? I suppose we'd want something that lends itself to healing, but I'm not sure what that would entail."},{"name":"AVERIL","text":"Might your guildmaster know something of this? He <span class=\"emphasis\">must</span> have an opinion on the matter. Could you ask him for me?"},{"name":"AVERIL","text":"A cavalier's hat made <span class=\"emphasis\">specifically</span> for a healer... I wonder if your guildmaster has ever heard of something like that."},{"name":"REDOLENTROSE","text":"Well, that <span class=\"emphasis\">is</span> a tale I hadn't expected to hear! And this girl wants a hat she can wear as easily about town as into battle?"},{"name":"REDOLENTROSE","text":"This is tricky. I wouldn't expect civilians to commonly wear cavalier's hats like you're describing... I wonder if Ishgard's taste in fashion stems from her people's warring spirit."},{"name":"REDOLENTROSE","text":"But that's neither here nor there. As to your question, the best fabric for healers is woven of fibers that absorb aether. I suggest using holy rainbow cloth, for not only is its conductivity superb, but it should also make for a gorgeous hat!"},{"name":"REDOLENTROSE","text":"A hat made from the finest holy rainbow cloth... That will be quite the sight to see."},{"name":"AVERIL","text":"I'm giddy to see what you and your guildmaster have come up with."},{"name":"AVERIL","text":"Oh, thank you! It's quite fetching on me, if I do say so myself! And best of all, no one would mistake me for a healer!"},{"name":"AVERIL","text":"Freskin!? What in heavens' name...?"},{"name":"FRESKIN","text":"Thank you, Averil. The pain's all gone! You've got a great hand with healin' magicks, same as ever!"},{"name":"AVERIL","text":"What happened to you? Did you hurt yourself training?"},{"name":"FRESKIN","text":"Not, uh...not quite. I was tired out from all that runnin' about, and I lost my footin' on the way down from the Hoplon, and I fell down the stairs..."},{"name":"AVERIL","text":"<span class=\"highlight\">Forename</span>, this is Freskin. My, uh...my friend. Who I told you about. Earlier."},{"name":"FRESKIN","text":"Averil, you look beauti... Er, that cap you've got on is, uh, is really somethin'!"},{"name":"AVERIL","text":"Isn't it just? And it's secretly a conjurer's hat! This weaver made it for me, for my practice. This way, Mother would never─"},{"name":"AVERIL","text":"<span class=\"emphasis\">Oh, gods</span>! My mother! Freskin, you need to go! Now! There'll be a bloodbath if she finds you here!"},{"name":"AVERIL","text":"Haha, I told you he was clumsy! What in the world would he do without me?"},{"name":"AVERIL","text":"Well, when I've need of another favor, I'll let you know. But for now, it's practice, practice, practice. House Durendaire takes only the best as chirurgeons!"}],"reward":{"gil":1535,"items":[{"num":200,"id":12},{"id":11892},{"id":11957,"one":1},{"id":11962,"one":1},{"id":11975,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":14}],"quests":[67539]},"next":[67541]},"partials":[{"type":"npc","id":"1012548","obj":{"i":1012548,"n":"Averil","l":2301,"q":5}},{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1012550","obj":{"i":1012550,"n":"Well-dressed Townsperson","l":2301,"q":1}},{"type":"npc","id":"1012551","obj":{"i":1012551,"n":"Well-dressed Townsperson","l":2301,"q":1}},{"type":"item","id":"11892","obj":{"i":11892,"n":"Hardsilver Needle","l":100,"c":35515,"t":22,"p":10454}},{"type":"item","id":"11957","obj":{"i":11957,"n":"Ramie Turban of Crafting","l":100,"c":40470,"t":34,"p":9979}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"10881","obj":{"i":10881,"n":"Holy Rainbow Hat of Healing","l":125,"c":41264,"t":34,"p":12474}},{"type":"quest","id":"67539","obj":{"i":67539,"n":"Tomboy Foolery","g":141,"l":"Ishgard","s":530,"f":1}},{"type":"quest","id":"67541","obj":{"i":67541,"n":"Spinning the Truth","g":141,"l":"Ishgard","s":580,"f":1}}]}