{"quest":{"name":"Blade That Was Broken","location":"Ishgard","id":67546,"patch":3.0,"sort":580,"icon":100453,"unlocksFunction":1,"eventIcon":71341,"issuer":1012509,"target":1012509,"involved":[1000997,1003075,1008945],"genre":137,"usedItems":[11877],"journal":["Fremondain seems a bit more driven than normal.","It transpires that Fremondain wishes his mistress to wield Integrity, the sword of House Jervaint, her birthright, in the final round of the grand tourney. As you might predict, however, it is not in the right state. It has rusted through and is nigh unusable. Thus, Fremondain asks you to consult with Forgemaster Brithael to discover a way to restore the once-mighty blade.","Forgemaster Brithael is glad to see his favorite smithy, and shocked to learn you have not earned enough for a tankard of ale from House Jervaint. Yet, he reasons, a blacksmith's fame is tied to the heroes who wield his creations, and encourages you to continue with Baroness Laurisse for that reason alone. Moving along, he pronounces restoring Integrity to be beyond his skill. However, a certain fellow named Gerolt may be able to help. Make your way to Hyrstmill and consult with Eorzea's preeminent weaponsmith.","You attempt to show Integrity to Gerolt, who yells at you to either go away or take it up with Drake. The apprentice himself is eager to help, but lacks the skill. He believes he can yet persuade his master, but Gerolt's services will come at a cost─a high-quality titanium lump hammer. Apparently, the legendary smith's displeasure stems from the loss of his own tool to moneylenders. Aid the apprentice.","After admiring your handiwork, and offering praise for the hammer, Drake bids you speak again with Gerolt. His master ought to be more welcoming, he says.","While “welcoming” might be a stretch, Gerolt nevertheless looks at Integrity. Though he is quick to praise its construction─it being of fine adamantite, made pure by some ancient technique─he also says it is impossible to repair. However, there is a ray of hope; the sword's hilt holds the remains of some Ishgardian saint, and from this hallowed bone does the blade's power stem. It could be remade if you forge an adamantite winglet of the same shape, size, and quality as the original, and then transfer the reliquary to your creation. Return now to Fremondain at the Jeweled Crozier, and tell him of this interesting development.","You return Integrity to Fremondain, and reveal all you have learned. Although surprised, the steward nevertheless takes it in stride, and wonders aloud if the bone inside the original sword is that of Saint Finnea. He leaves you with a single thought: now that the final round of the grand tournament nears, perhaps a new blade will give Baroness Laurisse the edge she needs.<br><br>※The next blacksmith quest will be available from Fremondain upon reaching level 60."],"objectives":["Show Integrity to Brithael in Limsa Lominsa.","Show Integrity to Gerolt at Hyrstmill.","<span class=\"alternative-container\"><span class=\"alternative\">Forge a titanium lump hammer <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the titanium lump hammer <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Drake</span></span>.","Show Integrity to Gerolt again.","Return Integrity to Fremondain."],"dialogue":[{"name":"FREMONDAIN","text":"Ah, just the blacksmith I needed!"},{"name":"FREMONDAIN","text":"As you know, milady's turn in the final round of the tourney draws near. It is my wish that she wield her birthright─Integrity, the sword of House Jervaint."},{"name":"FREMONDAIN","text":"The blade has graced the hands of her forebears in countless battles. Now... Well, suffice it to say it requires a <span class=\"emphasis\">most</span> thorough restoration."},{"name":"FREMONDAIN","text":"I have made inquiries with Master Brithael. He may be able to help, but he also made mention of needing to see the sword in person. Would you be so good as to take it to your guildmaster?"},{"name":"FREMONDAIN","text":"Has Master Brithael conceived of a means to fix Integrity?"},{"name":"BRITHAEL","text":"<span class=\"highlight\">Forename</span>! I was jus' wonderin' when me favorite <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>'d show up. Did ye bring Integrity, or whatever House Jervint─er, Jervont was callin' it?"},{"name":"BRITHAEL","text":"Hmmm... This was a fine blade once. But now, it'd be easier to make it into a butter knife than a sword. What's their reason fer wantin' it fixed?"},{"name":"BRITHAEL","text":"Bleedin' hells, <span class=\"highlight\">Forename</span>, they want it fer the <span class=\"emphasis\">grand tourney</span>? And yer not makin' a single gil from this? By the Twelve, what'd I get ye into!?"},{"name":"BRITHAEL","text":"...Still, it might pay off in the end. Heroes climb to fame on the backs o' smitties, but the opposite's true, too─<span class=\"emphasis\">you'll</span> be famous if some champion is wieldin' one o' yer blades."},{"name":"BRITHAEL","text":"An' this Laurisse sounds like she's got the right stuff. True o' heart, cares fer the people, resolves to be a leader, an' so on."},{"name":"BRITHAEL","text":"'Course, she'll want fer a little temperin'. But stick together, an' ye'll both reach new heights. Matter o' fact, I think there ain't no better opportunity fer ye as a smitty!"},{"name":"BRITHAEL","text":"Anyroad, the sword is damaged beyond what I can repair. But have ye ever heard of a bloke named Gerolt? A weaponsmith, livin' out in Hyrstmill? Well, word is he's second only to the Builder when it comes to restorin' arms!"},{"name":"BRITHAEL","text":"If there's any in the realm who can fix this sword, 'tis he."},{"name":"BRITHAEL","text":"Strange place to live, Hyrstmill. Got to wonder why this Gerolt bloke chose it..."},{"name":"BRITHAEL","text":"Anyroad, he's the one to see about yer Integrity. The sword, not yer <span class=\"emphasis\">actual</span>..."},{"name":"GEROLT","text":"What!? What nuisance have ye come to drop on me anvil!?"},{"name":"GEROLT","text":"That soddin' hunk o' rust!? I ain't touchin' nothin' that ain't kettle shaped for the next <span class=\"emphasis\">moon</span> at this rate, what with all the orders I got. Drake! Deal with this!"},{"name":"DRAKE","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, forgive my master. Is there anything I might help you with?"},{"name":"DRAKE","text":"Hmmm... I'm afraid that even with my experience, I do not know how to restore this."},{"name":"DRAKE","text":"But there is a chance my master might...if he'd calm down enough to listen, anyway. I think we might yet enlist his aid, but it might require some elbow grease on your part."},{"name":"DRAKE","text":"Moneylenders recently took my master's favorite titanium lump hammer. If you were to make him a new one just as fine, it might improve his disposition. At the very least, he might stop throwing half-finished kettles at me."},{"name":"DRAKE","text":"Have you made a replacement titanium lump hammer, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"DRAKE","text":"My, you clearly made this hammer with the smith in mind. It seems perfectly suited to delicate work. My master will fashion some fine kettles with this!"},{"name":"DRAKE","text":"Thank you for your efforts. I believe that with this, Gerolt will be more willing to hear out your request."},{"name":"GEROLT","text":"Aye, I heard what ye did fer me. So come on, show me the sword. Now! I ain't got all bloody day!"},{"name":"GEROLT","text":"If I ain't mistaken─an' I rarely am─this is an adamantite blade. Pure, too... Whatever smeltin' technique the ancients used got it purer than most modern smitties could. An' yer askin' if it can be made battle ready again?"},{"name":"GEROLT","text":"I'm afraid it ain't possible, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Can't be done with that sword, an' that's that."},{"name":"GEROLT","text":"But don't toss it jus' yet. The hilt's special─a reliquary. ...Means there's a saint's bone or summat inside. Reckon this sword is a treasure <span class=\"emphasis\">because</span> o' that."},{"name":"GEROLT","text":"So, what happens if ye forge an adamantite winglet in the exact shape an' size as the original an' enshrine the saint's remains in that?"},{"name":"GEROLT","text":"Aye, <span class=\"emphasis\">that's</span> what ye'll have to do to remake this Integrity!"},{"name":"FREMONDAIN","text":"Have you found a means to repair Integrity, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>?"},{"name":"FREMONDAIN","text":"Repairs are out of the question, then? Hmmm. I believe the bone in the hilt is Saint Finnea's. It was rumored that House Jervaint owned such a reliquary."},{"name":"FREMONDAIN","text":"Well, if the soul of the original can be passed to a new blade, then the sword must be remade. I daresay milady's ancestors would find no fault in us for doing so!"},{"name":"FREMONDAIN","text":"My mistress can use Saint Finnea's spirit in the final bout of the tourney. Come, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, let us forge her birthright anew!"}],"reward":{"items":[{"num":240,"id":8},{"id":11877},{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":10}],"quests":[67545]},"next":[67547]},"partials":[{"type":"npc","id":"1012509","obj":{"i":1012509,"n":"Fremondain","l":2301,"q":5}},{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1003075","obj":{"i":1003075,"n":"Gerolt","l":57,"q":22}},{"type":"npc","id":"1008945","obj":{"i":1008945,"n":"Drake","l":57,"s":19,"q":3,"t":"Replica Vendor","r":1,"a":139,"c":[30.42,20.15]}},{"type":"item","id":"11877","obj":{"i":11877,"n":"Titanium Lump Hammer","l":120,"c":35117,"t":14,"p":17867}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"quest","id":"67545","obj":{"i":67545,"n":"The Good Fight","g":137,"l":"Ishgard","s":550,"f":1}},{"type":"quest","id":"67547","obj":{"i":67547,"n":"Integrity","g":137,"l":"Ishgard","s":600,"f":1}}]}