{"quest":{"name":"Fortune Favors the Bole","location":"South Shroud","id":67549,"patch":3.0,"sort":301,"icon":100442,"unlocksFunction":1,"eventIcon":71341,"issuer":1014981,"target":1012222,"involved":[1014925,1014990],"genre":159,"journal":["Leveva waits patiently for you to pull yourself together and equip her grandfather's soul crystal.","After providing you with a brief but detailed introduction to astrology and astromancy, Leveva allows you a few moments to test out your newly acquired skills. Once you feel comfortable in your new skin, speak with the young Sharlayan astrologian and begin your search for her grandfather.","You are successful in rescuing Professor Mace. Quimperain has agreed to escort them on the remainder of their journey to Ishgard. You are to return ahead of the group and inform Jannequinard of the day's happenings (if he hasn't already seen them in the stars).","As you have inherited her grandfather's Soul of the Astrologian, Leveva has been assigned to oversee your training. By way of a first lesson, you are to practice alone while she finds a suitable location for your <span class=\"emphasis\">next</span> lesson.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 35."],"objectives":["Speak with Leveva.","Return to the Athenaeum Astrologicum and speak with Jannequinard.","Save Mace."],"dialogue":[{"name":"LEVEVA","text":"Now listen carefully, for we haven't much time. The star globe which you hold is both your sword and shield. It will grant you strength, as well as protection. But most important of all, it will grant you insight into the current location of the stars, enabling you to channel the heavens' aether into your body for use in all manner of magicks."},{"name":"LEVEVA","text":"The better attuned you become with the heavens and their “malefic” and “benefic” bodies, the better that aether might be manipulated to bring succor...or pain."},{"name":"LEVEVA","text":"Ah, but as you already know, the star globe is not the only tool an astromancer has at <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> disposal. Yes, the arcana, or more specifically, the six major arcana play a defining role in what type of astrologian you will become."},{"name":"LEVEVA","text":"Any layman will tell you that the cards can predict a man's future. This is both true and untrue. It is not the future that a card predicts, but the card influencing the man so that a certain future becomes more attainable."},{"name":"LEVEVA","text":"Seeking to tell a man's fortune, you “draw” a card from your deck. Upon “reading” the card, you scry that the man will be victorious in a coming battle. What is it that brings this man his victory but aether tapped from one of the lower six heavens granting the man strength, making it all that much easier for him to overcome his enemy."},{"name":"LEVEVA","text":"Of course, what card is drawn is linked directly to a target's destiny, as well as yours. Are <span class=\"emphasis\">you</span> the one who will see this man to fortune, or will you lead him to downfall? It all depends on your reading."},{"name":"LEVEVA","text":"Normally, I would not dare cover so much in a first lesson, but it <span class=\"emphasis\">is</span> my grandfather who has placed his life in your hands, and I am not about to watch him have his throat slit because you cannot tell the face of an arcana from its back."},{"name":"LEVEVA","text":"We have two seemingly capable soldiers here to take the brunt of the bandits' blows. Allow them to carve a trail of carnage while you convince the stars to nudge the two in a direction favorable to my kin."},{"name":"LEVEVA","text":"I understand this must be a lot to digest, but if you are ever to become a capable astrologian, you must believe in the path laid out before you, and in your power to read it, follow it, and ultimately control it. Take some time to acclimate yourself to your new abilities, and let me know when you are ready to begin."},{"name":"SYSTEM","text":"You have learned all astrologian actions and traits to level 30. Detailed descriptions can be viewed in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"YARI02013","text":"I have been a guide in these woods since my tenth nameday, yet never have I encountered bandits the likes of these. They are not of the Twelveswood..."},{"name":"LEVEVA","text":"Dammy"},{"name":"QUIMPERAIN","text":"I find it highly unlikely that a sparkling globe will sufficiently protect you from a bandit's blade. Stay back, and leave the fighting to me."},{"name":"QUIMPERAIN","text":"Pray leave the fighting to me and the spearman, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. If you must involve yourself, I suppose you might see to our wounds...but naught more."},{"name":"JANNEQUINARD","text":"Have you located the professor? Where is Quimperain? <span class=\"emphasis\">Why are you here</span>?"},{"name":"LEVEVA","text":"I see in your eyes that you are ready. Whether that actually makes you ready or not, only time will tell. Time, unfortunately, is something we no longer have in abundance."},{"name":"LEVEVA","text":"Let us take to the shadows and find out where these bandits are holding my grandfather. May the stars be our guide."},{"name":"QIB","text":"Lord Jannequinard...please find it in your heart to forgive me..."},{"name":"QIB","text":"Do not let these bandits stand in the way of us locating my grandfather!"},{"name":"QIB","text":"This is a card from my grandfather's deck! He is leaving us a trail to follow!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>. Its power is now your own."},{"name":"QIB","text":"There are six major arcana. We must find the other cards!"},{"name":"QIB","text":"Throw down your weapons, cur! You have no choice but to release the professor or meet the same fate as your men!"},{"name":"QIB","text":"No choice, eh? What if our <span class=\"emphasis\">choice</span> all along was to cross blades, houseboy? Come closer and let us end this."},{"name":"QIB","text":"A voidsent! This bandit is more than she appears!"},{"name":"CELIE","text":"I was not told there would be <span class=\"emphasis\">two</span> astrologians. Enough of this!"},{"name":"QUIMPERAIN","text":"I am Quimperain, in the employ of Lord Jannequinard. I am sent to escort you back to Ishgard. Are you unhurt, milord?"},{"name":"MACE","text":"Jannequinard, you say? And where is my former student? His constant pestering is one of the reasons I agreed to make the long trip from the Old World."},{"name":"LEVEVA","text":"I see none but Quimperain and this adventurer."},{"name":"YARI02013","text":"I too have seen no other."},{"name":"MACE","text":"Just like you didn't see those bandits until their knives were up our arses. But that is of no matter. It was all as the stars had foretold."},{"name":"MACE","text":"Yes, I saw this adventurer long before even setting foot on this accursed continent when the arcana whispered and told me I would find a worthy successor for my soul crystal."},{"name":"LEVEVA","text":"(-Leveva-)And having witnessed how <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> eased into <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> new role, but mere moments after taking up the crystal, globe, and deck..."},{"name":"MACE","text":"Yes, I knew at once my reading was true, and that this adventurer was the astrologian I had been seeking. But now, let us see if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has the potential for greatness within <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"MACE","text":"Look to the skies, <span class=\"highlight\">Forename</span>, and there you will see six stars aglow in pale yellow. This is the Bole."},{"name":"MACE","text":"This constellation is thought to be the gate to the first heaven─the heaven which holds the World Tree. Planted by the Matron and nurtured by the Keeper, the World Tree is the source from which all life is said to have sprung."},{"name":"MACE","text":"The trunk of the World Tree, or the Bole, grants strength to the weak, allowing them to stand firm in the face of adversity."},{"name":"MACE","text":"You have now opened that gate, and its power is yours to command."},{"name":"MACE","text":"A solid bole represents a solid foundation. It is not coincidence that this very constellation is risen to midheaven at this very moment─the moment of a new astrologian's birth."},{"name":"MACE","text":"And to think, I saw all of this a moon ago. It seems I am a better reader of fates than I thought! Hah hah hah!"},{"name":"MACE","text":"But I jest. It has been a long journey, with more than its share of unexpected excitement. I am an old man, and one does not need a deck of arcana to see that my weary legs will not carry me much longer. Let us make haste to Ishgard, so I may give that ungrateful Jannequinard a proper upbraiding."},{"name":"MACE","text":"Jannequinard. Fifteen summers passed and still the flippant clod I lost half of my hair tutoring. Sending an <span class=\"emphasis\">adventurer</span> to find the man you summoned halfway across Hydaelyn. Always taking the easy route. And you wonder why you <span class=\"emphasis\">still</span> haven't been able to open the second heaven's gate!"},{"name":"JANNEQUINARD","text":"Ah, I...uh, allow me to explain, Professor. You see, I was waiting here in case you made it to Ishgard before my manservant and <span class=\"highlight\">Forename</span> could locate you."},{"name":"JANNEQUINARD","text":"Think of the confusion had you arrived here only to find the Athenaeum empty... Wait, how did you know I haven't opened all the gates?"},{"name":"LEVEVA","text":"My grandfather is the greatest astrologian in all Sharlayan. There is naught he doesn't know unless he doesn't wish to know it. You of all people should know that."},{"name":"LEVEVA","text":"Perhaps I was hasty in my decision to remain here and see to your training."},{"name":"JANNEQUINARD","text":"Train me? You? But what of Professor Mace? Isn't that why he made the journey?"},{"name":"LEVEVA","text":"My grandfather has already completed his task. He simply came to Ishgard out of courtesy to an old pupil...one who it appears he wasted years on!"},{"name":"JANNEQUINARD","text":"W-Wasted...? Wh-What are you implying, my lady?"},{"name":"MACE","text":"Ah, my dear Leveva, you still do not see it, do you? Without Jannequinard stumbling into my tutelage nearly two decades past, he never would have taken this adventurer under his wing and sent <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to us in his stead. It was all as the stars had planned."},{"name":"JANNEQUINARD","text":"Your soul crystal! Professor! This adventurer has <span class=\"emphasis\">stolen</span> your Soul of the Astrologian!"},{"name":"MACE","text":"Hahahaha! Ever the unobservant, Janne. If this adventurer had stolen my crystal, Leveva would have read up some terrible fate for the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. No. <span class=\"highlight\">Forename</span> is my successor. Something I mistakenly thought you might be...but even I cannot see every future, it seems."},{"name":"MACE","text":"But do not despair. I have not given up on you completely. Despite your failings, you have tried your best to promote the Sharlayan school of astrology here in this den of fools who fail to see aught and all beyond the dragon star. I wish to see you continue that fight. And that is why I've bade Leveva to remain here and further your...and this adventurer's training."},{"name":"JANNEQUINARD","text":"I...see. This is all rather...overwhelming. Might I have some time to consider your words?"},{"name":"LEVEVA","text":"No. You either continue your training with me and your...ahem...protégé, or you crawl back to obscurity."},{"name":"LEVEVA","text":"I shall give you both several turns of the sun to study the basics of Sharlayan astrology. It should not be so hard for you, Jannequinard, considering you've had a substantial head start. Once you have committed the basics to memory, then return here. In the meantime, I will be traveling Eorzea, searching for locations where <span class=\"highlight\">Forename</span>...and you will unlock the remaining heavens' gates."},{"name":"JANNEQUINARD","text":"B-But, you were only recently set upon by bandits. Perhaps traveling alone so soon is unwise."},{"name":"LEVEVA","text":"Don't you think I know that!? That is why you will be lending me the services of your able manservant, Quimperain."},{"name":"JANNEQUINARD","text":"I will...? I mean, I will. Yes, of course Lady Leveva. Anything for the granddaughter of Sharlayan's finest professor of astrology. Quimperain! You heard the lady."},{"name":"LEVEVA","text":"Very good. I shall see my grandfather to the airship landing now, but rest assured that if you neglect your studies, I will know."},{"name":"SYSTEM","text":"The next astrologian quest will be available from Jannequinard upon reaching level 35."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":99}],"quests":[67548]},"next":[67550]},"partials":[{"type":"npc","id":"1014981","obj":{"i":1014981,"n":"Leveva","l":56,"q":1}},{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1014925","obj":{"i":1014925,"n":"Quimperain","l":56,"q":2}},{"type":"npc","id":"1014990","obj":{"i":1014990,"n":"Armed Escort","l":56,"q":1}},{"type":"quest","id":"67548","obj":{"i":67548,"n":"Stairway to the Heavens","g":159,"l":"Ishgard","s":300,"f":1}},{"type":"quest","id":"67550","obj":{"i":67550,"n":"Hanging in the Balance","g":159,"l":"Ishgard","s":350,"f":1}}]}