{"quest":{"name":"Integrity","location":"Ishgard","id":67547,"patch":3.0,"sort":600,"icon":100453,"unlocksFunction":1,"eventIcon":71341,"issuer":1012509,"target":1012509,"involved":[1013682],"genre":137,"usedItems":[10591],"journal":["Fremondain's eyes are alight with hope.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Blacksmith III</span>.</span>","The final round of the grand tournament has come, and Fremondain informs you that Baroness Laurisse is off to a flying start. She has proven herself in the eyes of many spectators, and become a crowd favorite. However, now that she will face the final eight challengers, he fears his mistress needs every advantage. He bids you forge a high-quality adamantite winglet, of the same size and shape as the original Integrity. Do so, that the steward might present a truly fearsome weapon to the baroness.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Blacksmith III</span>.</span>","Fremondain gratefully accepts the adamantite winglet, and transfers the sacred bone to the new weapon. Baroness Laurisse joins you, and Fremondain makes to present her the sword. However, in so doing, he reveals that he has not paid you so much as one gil. Taken aback, the baroness refuses the gift─until a few heartfelt words from her loyal steward cause her to change her mind. Yet she will not simply have it for free, and gives you the last remaining valuable of House Jervaint, the cygnine rosary, with the understanding that you will return it in exchange for her winnings in the tournament. Suddenly nervous, Baroness Laurisse leaves to find either great glory or abject failure in the final round. Fremondain bids you follow her to the Lightfeather Proving Grounds, and encourage her if necessary.","You find the baroness standing outside of the proving grounds. She is nervous, though she does not admit it in quite so many words. However, your presence allows her to find some measure of confidence, and the splendor of Integrity gives her even more. Thanking you, she turns and goes through the gates, and to whatever fate awaits therein. Join Fremondain in the Jeweled Crozier, and wait for tidings of the daughter of House Jervaint.","Baroness Laurisse returns with sad news: she lost in the first bout to an opponent far greater in stature and girth. However, such was her ferocity and bravery that the Temple Knights took notice. Via a messenger, they offer Baroness Laurisse the position of apprentice squire, and praise her valor. The man also inquires into the origin of Integrity, and Baroness Laurisse proudly proclaims it the work of Master <span class=\"highlight\">Forename</span>. You return the cygnine rosary, and take your payment for all the work you have done...finally. The daughter of House Jervaint says that you are doubtless meant for greater things yet, and gives her thanks. You have raised a hero with your creations, and now, the hero will carry your name to new heights.<br><br>※The next blacksmith quest will be available from Brithael once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Forge an adamantite winglet <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the adamantite winglet <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Fremondain in Ishgard</span></span>.","Speak with Laurisse in front of the Lightfeather Proving Grounds.","Speak with Fremondain."],"dialogue":[{"name":"FREMONDAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, the final round of the tourney has begun!"},{"name":"FREMONDAIN","text":"Milady has won six bouts with ease, and those who dismissed her skill as mere luck have eaten their words!"},{"name":"FREMONDAIN","text":"The crowd is in awe of her strength and fury. Why, I have even heard it said that she is Saint Finnea come again!"},{"name":"FREMONDAIN","text":"The comparison is well merited. Milady's sword arm is excellent, but she wins because she is relentless. Even brave contenders have forfeited from fear."},{"name":"FREMONDAIN","text":"Now, however, she stands with eight others of equal might. I fear without Integrity... Please, my friend, forge anew a fine host for the sword─an adamantite winglet, I believe you said!"},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Blacksmith III</span>."},{"name":"FREMONDAIN","text":"Is it done, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? Has the new host for Integrity been forged?"},{"name":"FREMONDAIN","text":"Halone above... Magnificent, simply magnificent! If you will allow me to transfer the remains of Saint Finnea..."},{"name":"FREMONDAIN","text":"There─a relic and reliquary reborn!"},{"name":"LAURISSE","text":"Fremondain, of all the times to─ Ah, <span class=\"highlight\">Forename</span>. Weaponry?"},{"name":"LAURISSE","text":"Fury take me─you <span class=\"emphasis\">remade</span> that rusty sword?"},{"name":"FREMONDAIN","text":"Out of the kindness of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heart, milady! It is a masterpiece, is it not? And it is yours, free of charge!"},{"name":"FREMONDAIN","text":"The blade is blessed! The hilt is a reliquary of Saint Finnea, and bound within are the prayers of your ancestors─no doubt uttered during pitched battles!"},{"name":"FREMONDAIN","text":"When you wield this blade, all of House Jervaint walks with you. Allow me to present Integrity! May it carry you to victory this day!"},{"name":"LAURISSE","text":"...Free of charge? All this...for nothing? I cannot accept this."},{"name":"LAURISSE","text":"I had thought it strange that we could afford a smith of <span class=\"highlight\">Forename</span>'s caliber with my coffers so bare... How did you pay, Fremondain? With promises?"},{"name":"LAURISSE","text":"How could you!? However low, I am still a noble! I will <span class=\"emphasis\">not</span> taint my name by turning beggar because of ill fortune, nor...nor tarnish my victory with this sword!"},{"name":"FREMONDAIN","text":"B-But, Baroness, only the blade has been remade─House Jervaint's prayers were yours, and <span class=\"emphasis\">are</span> yours! A-And what of <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has poured <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> hopes into the weapon!"},{"name":"FREMONDAIN","text":"As have I! We are the people you wish to protect, yes? How can you deny your duty to us? How can you just leave this sword to rust!?"},{"name":"LAURISSE","text":"N-No, I could never. My father would...would..."},{"name":"LAURISSE","text":"You have the right of it. I will be proud to wield Integrity. But I will offer you recompense, <span class=\"highlight\">Forename</span>."},{"name":"FREMONDAIN","text":"The cygnine rosary, milady!? But that is the only valuable left. And it was your parents' favorite!"},{"name":"LAURISSE","text":"I know, Fremondain. When I am champion, <span class=\"highlight\">Forename</span>, I will give you the tourney prize to have it back. Is that all right?"},{"name":"LAURISSE","text":"Thank you. Well, now to the eight bouts before me. If the Temple Knights see me at my best, then I will join them. But...but if I lose even one..."},{"name":"LAURISSE","text":"You two, await...await me here. I will return from the proving grounds to tell you if I win─<span class=\"emphasis\">when</span> I win..."},{"name":"FREMONDAIN","text":"I have never seen her so unsure... She needs our support. Your support. My fretting will only cause her greater worry."},{"name":"FREMONDAIN","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, milady has need of you. With so much at stake, the Lightfeather Proving Grounds must seem intimidating..."},{"name":"LAURISSE","text":"<span class=\"highlight\">Forename</span>, why are you─ Oh, who cares? Thank you for coming. I was just taking a deep breath. The air inside is vile."},{"name":"LAURISSE","text":"Me? Worried? O-Of course not...I am Laurisse de Jervaint!"},{"name":"LAURISSE","text":"Never give up, never give in, as Father said. Lead by example─no weakness, no faltering. I must be iron─unbending, unyielding. As...as Father said..."},{"name":"LAURISSE","text":"He was a good leader, <span class=\"highlight\">Forename</span>. I can be, too. A voice for the voiceless."},{"name":"LAURISSE","text":"...I <span class=\"emphasis\">will</span> win."},{"name":"LAURISSE","text":"I feel as if I am holding my father's hand."},{"name":"LAURISSE","text":"Courage, Laurisse, courage.<br>Thank you...my friend. I will return with good tidings."},{"name":"JUDGE02011","text":"Forward!"},{"name":"LAURISSE","text":"...Watch over me, Father."},{"name":"FREMONDAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>!"},{"name":"FREMONDAIN","text":"I could not stand the waiting! Is milady...?"},{"name":"FREMONDAIN","text":"Thank you. She needed encouragement. I am glad you were here to give it. Well...shall we wait for tidings?"},{"name":"FREMONDAIN","text":"The tourney ought to have ended by now. Where is─"},{"name":"FREMONDAIN","text":"Milady! Dare I hope that...?"},{"name":"LAURISSE","text":"...But the sword was <span class=\"emphasis\">wonderful</span>, truly. It was <span class=\"emphasis\">my</span> strength that..."},{"name":"FREMONDAIN","text":"No..."},{"name":"ESQUIRE02011","text":"Pardon me, Baroness. The Temple Knights have sent me to find you, as you left the arena before the awarding of honors."},{"name":"LAURISSE","text":"Should I have stayed, ser? I lost in the first bout."},{"name":"ESQUIRE02011","text":"The champion's laurels were not yours, my lady, but you <span class=\"emphasis\">have</span> won an honor─that of the most valiant."},{"name":"ESQUIRE02011","text":"You faced an opponent who was thrice your size, yet neither retreated nor hesitated. In truth, we thought you would pummel the man to death! None who saw the tourney will soon forget your fury, madam."},{"name":"ESQUIRE02011","text":"Ser Handeloup himself was impressed. He wishes to discuss your potential with the lord commander."},{"name":"LAURISSE","text":"My...my─ With Ser Aymeric!?"},{"name":"ESQUIRE02011","text":"Just so. Ser Handeloup has also asked that you be elevated to apprentice squire forthwith. It is a humble title, but one once held by many of the Temple Knights' finest."},{"name":"FREMONDAIN","text":"Milady! Is this not everything you have dreamt of?"},{"name":"ESQUIRE02011","text":"My lady, if I may─where did you find that glorious sword?"},{"name":"LAURISSE","text":"Integrity? It is the sword of House Jervaint made anew by this master of the forge, <span class=\"highlight\">Forename</span>."},{"name":"ESQUIRE02011","text":"<span class=\"emphasis\">Master</span> <span class=\"highlight\">Forename</span>─I will make it a point to remember the name. Well, Baroness Laurisse, I will bid you adieu. Ah, but allow me to present your winnings."},{"name":"FREMONDAIN","text":"Will...will it be payment enough for the cygnine rosary?"},{"name":"LAURISSE","text":"I called you a master, for a master you are, <span class=\"highlight\">Forename</span>. And I could have done none of this without your aid. We will..."},{"name":"LAURISSE","text":"I need not continue. It is our exploits, our <span class=\"emphasis\">victories</span>, that history will remember, not our words, and I have no doubt you will be mighty in deed. May you ever reach new heights, my friend."},{"name":"SYSTEM","text":"This concludes the blacksmith quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next blacksmith quest will be available from Brithael."}],"reward":{"gil":4946,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":10}],"quests":[67546]},"next":[68129]},"partials":[{"type":"npc","id":"1012509","obj":{"i":1012509,"n":"Fremondain","l":2301,"q":5}},{"type":"npc","id":"1013682","obj":{"i":1013682,"n":"Laurisse De Jervaint","l":2300,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"10591","obj":{"i":10591,"n":"Adamantite Winglet","l":150,"c":30533,"t":2,"p":25185}},{"type":"quest","id":"67546","obj":{"i":67546,"n":"Blade That Was Broken","g":137,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"68129","obj":{"i":68129,"n":"A Missive from the Far East","g":137,"l":"Limsa Lominsa","s":601,"f":1}}]}