{"quest":{"name":"Never Leave without a Good-bye","location":"Ishgard","id":67542,"patch":3.0,"sort":600,"icon":100454,"unlocksFunction":1,"eventIcon":71341,"issuer":1012548,"involved":[1003818,1012552,1012553],"genre":141,"usedItems":[13001],"journal":["Averil's face has the grim resolution of one bound for war.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Weaver III</span>.</span>","The time is almost come for Averil to leave for the front lines of battle, and, unsurprisingly, she has decided not to tell her mother. Subsequently, she asks you for raiments suited for conjury in a style that will raise no suspicion. She bids you once again question the best-dressed townsfolk to learn what garments are in style this season.","Opinion amongst Ishgard's socialites seems split between doublets and bliauds. Return to Averil, and offer her a choice between the two.","After a moment's thought, Averil decides she would prefer the doublet. The reason is simply that there is an old doublet in her house, one that Glenda may have worn in times long past. Yet there remains the question of fabrics: what could best be tailored to fit a conjurer's needs? Consult Redolent Rose in Ul'dah to find out.","Upon hearing of Averil's plan, Redolent Rose realizes that the essence of Ishgardian art─fashion included─is transience. Many of the young who leave for war never come home, and are as candles burning brightly but ever so briefly. Returning to the matter at hand, the guildmaster tells you that chimerical felt may be the perfect fabric, as being both wonderfully warm and absorbent of aether. Fashion now a chivalric doublet of healing, and deliver it to Averil near the Arc of the Venerable.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Weaver III</span>.</span>","Averil gratefully accepts the doublet. She briefly laments that she cannot tell her mother she is leaving, and bids you to see her and Freskin off from the Arc of the Worthy. Await them there, that they have someone to say good-bye to.","Dusk has fallen over the Holy See as Averil and Freskin arrive. Both thank you for seeing them off, and are just turning to leave when Glenda appears. The widow has seen through her daughter's charade, and reveals her own tale of loss: she went to war as a young woman, to protect Averil's father. She failed, and found herself with child but without her lover. When Glenda learned Averil meant to follow the selfsame path of conjury, she panicked and did all she could to stop her daughter─and so inadvertently pushed Averil towards the battlefield. Glenda does not agree with Averil's decision, but she has chosen to support it. You watch as Averil walks away with Freskin, mayhap to return, mayhap not.<br><br>※The next weaver quest will be available from Redolent Rose once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Question the well-dressed townspeople.","Report to Averil.","Speak with Redolent Rose.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a chivalric doublet of healing</span><span class=\"alternative\">Deliver the chivalric doublet of healing to Averil</span></span>.","Wait in front of the Arc of the Worthy."],"dialogue":[{"name":"AVERIL","text":"Freskin and I will be bound for the front lines soon, and I am ready for it!"},{"name":"AVERIL","text":"Well, mostly. I have one last request for you, at least for the time being: could you create me a garment to wear into battle?"},{"name":"AVERIL","text":"Mother doesn't know I'm leaving, and I'm not telling her. It's imperative that the clothing be sufficiently fashionable, lest she grows suspicious of my true plans."},{"name":"AVERIL","text":"Could you speak with the townsfolk again? I would like to blend in with them, so as to make her think I'm off on some social outing."},{"name":"AVERIL","text":"I'm sorry to ask this of you, but you've seen how Mother gets. I...I don't want her to worry."},{"name":"AVERIL","text":"No matter what I say, she won't understand. I just can't be what she wants me to be. No, the less she knows of my plans, the better."},{"name":"AVERIL","text":"I wonder what the townsfolk will say matches my cavalier's hat."},{"name":"ONNAA","text":"My outfit? I'm flattered that you'd ask. This is my finest bliaud, and I've paired it with my cavalier's hat. It does seem to be what everyone is wearing these days."},{"name":"MACHIBITOB","text":"What to wear with a cavalier's hat? Why, a doublet, of course. But it must match your cap, or you'll look as strange as a goblin with a goobbue's head!"},{"name":"AVERIL","text":"So the townsfolk are wearing bliauds and doublets? I'm quite fond of both styles..."},{"name":"AVERIL","text":"Hmmm... The doublet will do for me. It reminds me of an old one we've got at home. I always thought it was quite pretty. Perhaps Mother wore it, back before she became so dull."},{"name":"AVERIL","text":"If I could use it, I would. But it's not meant for battle. Actually, could you speak with your guildmaster about that? As with my hat, the doublet will need to serve as armor, too."},{"name":"AVERIL","text":"How do you make a doublet ready for battle, I wonder? I'll be interested to hear what your guildmaster says."},{"name":"REDOLENTROSE","text":"Good heavens, off to <span class=\"emphasis\">war</span> now, is she? I suppose that is Ishgard's way."},{"name":"REDOLENTROSE","text":"It is a pity she means to further deceive her own mother. But I understand her request. She may not return from her battle─and if you must go, go with style."},{"name":"REDOLENTROSE","text":"Why, you could say the fabric of Ishgardian life is woven from loss. That is why their art has such beauty─their lives are as glorious candles, burning twice as bright but half as long. Hah, I daresay that gem will inspire me for some time, <span class=\"highlight\">Forename</span>!"},{"name":"REDOLENTROSE","text":"Ah, but you were asking about fabrics. We discussed how magic wielders' needs are best served by fibers that absorb aether, yes? Then have you considered where the battle will be fought?"},{"name":"REDOLENTROSE","text":"Coerthas is frigid, and frostbite can kill just as easily as dragon fire. Only the warmest of fabrics will do─chimerical felt. A chivalric doublet of healing made of this ought to suit Averil's needs."},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Weaver III</span>."},{"name":"REDOLENTROSE","text":"Chimerical felt is a wondrous fabric, and a doublet fashioned of it will be perfect for the cold of Coerthas."},{"name":"AVERIL","text":"My heart is all aflutter. I can't wait to see what you bring me. ...Or is it that I'm anxious about the battles ahead? Er...well, is it done?"},{"name":"AVERIL","text":"It's stunning! Why, I'll be the belle of the battlefield! Thank you so much! Now, there's nothing holding me back."},{"name":"AVERIL","text":"I <span class=\"emphasis\">do</span> wish Mother... No, it is best she doesn't know. Freskin and I will go via the Arc of the Worthy. Please, see us off there. It's bad luck to leave without a soul to say good–bye to."},{"name":"AVERIL","text":"Thank you for coming, <span class=\"highlight\">Forename</span>. When I return, I will be sure to tell you about all of our adventures!"},{"name":"AVERIL","text":"But if I don't make it back, tell Mother that I was chasing my dreams. That I was happy. Farewell, my friend."},{"name":"GLENDA","text":"Averil! Where are you going, dressed like that?"},{"name":"FRESKIN","text":"Uh...she is, that is to say, we are going to the fron─"},{"name":"AVERIL","text":"To the <span class=\"emphasis\">fête</span>! Right, darling!? That's why I'm wearing my finest─for the, er...fête!"},{"name":"GLENDA","text":"Is that so? Well, cancel your plans. The cathedral has need of more monastic robes, and right this very instant!"},{"name":"AVERIL","text":"Can't it wait, Mother? I've been dreaming of this party for so long."},{"name":"GLENDA","text":"And your party is more important than the gods' work? Your last robes were so well received, I think you'll need to make a hundred sets. You can do it, yes?"},{"name":"AVERIL","text":"...You want the truth, Mother? I'm a chirurgeon. I'm leaving for the front lines tonight, with my sweetheart!"},{"name":"AVERIL","text":"Please, don't try to stop me. I couldn't bear sitting at home <span class=\"emphasis\">praying</span> for my Freskin's safety when I could see to it myself!"},{"name":"GLENDA","text":"...It's bad luck, you know. To leave without letting me say good–bye."},{"name":"GLENDA","text":"Your raiments gave you away, dear. I know a chirurgeon's doublet when I see it. I wore one myself. I just hoped you never would."},{"name":"GLENDA","text":"I went to war, too. Your father was so gallant, and I was so in love with him... How could I not go?"},{"name":"GLENDA","text":"But I never told him I was with child. He died not knowing, because I was slow when I needed to be fast. He died...he died because of me."},{"name":"GLENDA","text":"And that guilt destroyed the woman I was. I gave up conjury to raise you. I tried to forget my mistakes through Halone."},{"name":"GLENDA","text":"I never wanted you to know war. If keeping you from harm meant keeping you home, so be it. And then I saw you, studying conjury with him."},{"name":"GLENDA","text":"I panicked. Everything I could do to stop you, I tried─and my actions only drove you further towards the battlefield."},{"name":"GLENDA","text":"But...the doublet suits you. Back when I was young and sincere and passionate, I'm sure it suited me too. I do remember that desire to do good, to protect the ones I love..."},{"name":"GLENDA","text":"Go, Averil. Go with my blessing. But keep him safe, and <span class=\"emphasis\">promise</span> me you'll come back!"},{"name":"AVERIL","text":"I promise, Mother. On everything I hold dear! Thank you.<br>And thank you, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"This concludes the weaver quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next weaver quest will be available from Redolent Rose."}],"reward":{"gil":1556,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":14}],"quests":[67541]},"next":[67967]},"partials":[{"type":"npc","id":"1012548","obj":{"i":1012548,"n":"Averil","l":2301,"q":5}},{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1012552","obj":{"i":1012552,"n":"Well-dressed Townsperson","l":2301,"q":1}},{"type":"npc","id":"1012553","obj":{"i":1012553,"n":"Well-dressed Townsperson","l":2301,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"13001","obj":{"i":13001,"n":"Chivalric Doublet of Healing","l":160,"c":42464,"t":35}},{"type":"quest","id":"67541","obj":{"i":67541,"n":"Spinning the Truth","g":141,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"67967","obj":{"i":67967,"n":"When East Meets West","g":141,"l":"Ul'dah","s":601,"f":1}}]}