{"quest":{"name":"Forging Northwards","location":"Limsa Lominsa","id":67543,"patch":3.0,"sort":502,"icon":100453,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1012509,"involved":[1012510],"genre":137,"journal":["Forgemaster Brithael's eyes seem to shine with pride.","Forgemaster Brithael thinks it is high time that a smith of your caliber earned realm-wide renown. He has even found you a potential employer: a noble house of Ishgard. Their representative, one Fremondain, awaits you at the Drowning Wench. Make your way there, and hear the man out.","Fremondain, you learn, is a steward in the service of Baroness Laurisse de Jervaint. She is the lone daughter of House Jervaint, a family that has fallen from its once-lofty position within Ishgardian society. Thus, while the need for a blacksmith is great, the most that Fremondain can offer for your services is a healthy dose of “honor.” If this meager offer has not dissuaded you, seek out the steward in the Jeweled Crozier in Ishgard.","After arriving in Ishgard, you speak with Fremondain. He introduces Baroness Laurisse to you, and explains the cause of House Jervaint's destitution─Ser Jervaint, the lady's father, lost his knighthood. Now, however, Ishgard's upcoming grand tournament may afford the baroness an opportunity to restore the family's good name─the champion of this event will be offered the knighthood her father lost. Before explaining how you fit into all of this, however, Fremondain notices that you are tired from your journey, and bids you seek him out again after you have recovered.<br><br>※The next blacksmith quest will be available from Fremondain upon reaching level 53."],"objectives":["Speak with Fremondain at the Drowning Wench.","Speak with Fremondain at the Jeweled Crozier in Ishgard."],"dialogue":[{"name":"BRITHAEL","text":"Ever since ye came to me, <span class=\"highlight\">Forename</span>, it's been smooth sailin' fer the guild. But I fear it's time fer ye to spread yer wings, an' earn a taste o' the renown owed a smith o' yer talent."},{"name":"BRITHAEL","text":"It jus' so happens I've found the perfect job fer ye─with proper Ishgardian nobility! Some steward by the name o' Fremondain's here all sly-like, after me very best!"},{"name":"BRITHAEL","text":"Ain't no higher honor fer a smitty than winnin' a name in the land o' knights! So, I trust ye'll hear the man out? He's waitin' fer ye at the Wench."},{"name":"BRITHAEL","text":"Ah, to be a smitty in the Holy See... Opportunity of a lifetime, an' Fremondain's offerin' it down at the Wench!"},{"name":"FREMONDAIN","text":"Might you be Master Brithael's pupil? A pleasure, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I am Fremondain, steward to House Jervaint. How do you do?"},{"name":"FREMONDAIN","text":"I have come to secure the services of a blacksmith. Your guildmaster intimated that you are the best. And only the best will do for my mistress, Baroness Laurisse."},{"name":"FREMONDAIN","text":"In another age, her family formed the backbone of the Temple Knights. However, the house has fallen upon hard times, and milady has lost her lands, her power, and her father."},{"name":"FREMONDAIN","text":"Yet her resolve is pure steel. She practices daily with a blade to earn a place among the Temple Knights, and thus restore her house's good name. Aid her, and I daresay your talent will become famous throughout the realm!"},{"name":"FREMONDAIN","text":"I <span class=\"emphasis\">should</span> mention that I cannot promise, er...traditional payment. But I am sure the <span class=\"emphasis\">honor</span> of serving House Jervaint has intrigued you, at the very least, and I <span class=\"emphasis\">do</span> hope you will join me at the Jeweled Crozier. I bid you good day, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"FREMONDAIN","text":"...Not enough to hire a chocobo home. &lt;sigh&gt; Well, I can walk. And sleep outdo─"},{"name":"FREMONDAIN","text":"O-Oh! Please excuse me, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>─it's...it's nothing. Really! Er...good-bye."},{"name":"FREMONDAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Thank you! I promise, you will not regret the journey here. I hereby entrust the arms and armor of House Jervaint to your able care."},{"name":"FREMONDAIN","text":"Why meet here? I am employed at this shop─a second job, to pay the bills. Er...I am loath to ask, but would you keep this secret from Baroness Laurisse?"},{"name":"LAURISSE","text":"(-???-)I beg your pardon, Fremondain─keep what from me?"},{"name":"FREMONDAIN","text":"M-Milady! I...I was just saying you were keeping busy with your practice! Has it ended so soon?"},{"name":"LAURISSE","text":"It takes rather little time to defeat striking dummies. And who is this?"},{"name":"FREMONDAIN","text":"Ah, yes, allow me to present <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─a most excellent blacksmith come to serve you."},{"name":"LAURISSE","text":"Ah. The rumors of your skill precede you, smith. I am glad to have you."},{"name":"LAURISSE","text":"Fremondain, I am going home. Does the pantry need for anything?"},{"name":"FREMONDAIN","text":"Two pumpkins would be appreciated, milady. Unfortunately, I cannot leave to buy them myself in the middle of work─ A-Ah, I mean to say, I cannot leave before explaining the smith's duties to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"LAURISSE","text":"Very well. The shops of the Brume grow cheaper near closing, yes? Hopefully, the difference is worth the walk."},{"name":"FREMONDAIN","text":"&lt;sigh&gt; Milady should not have to worry about saving on foodstuffs..."},{"name":"FREMONDAIN","text":"Few noble lines have seen more of their own as lord commander than House Jervaint. Baroness Laurisse's father was himself a renowned knight, until..."},{"name":"FREMONDAIN","text":"Well, to give you an idea, the house once employed hundreds of servants. I am the only one left. Ser Jervaint did not tumble from knighthood─he was pushed, and his family lost much in his fall."},{"name":"FREMONDAIN","text":"To make matters worse, the Calamity claimed his life. But his dream of seeing his house's name restored did not die with him. Milady carries it within herself, and she is without parallel in her conviction. Why, in my eyes, she is Saint Finnea come again!"},{"name":"FREMONDAIN","text":"And she is so <span class=\"emphasis\">close</span>, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Ishgard will hold its grand tourney soon, and the who's who of the Temple Knights will attend. They will extend knighthood to the champion. If that is the baroness..."},{"name":"FREMONDAIN","text":"Yet as good as she may be, she wants for refinement in her techniques and equipment both. But with a master smith's aid, I <span class=\"emphasis\">know</span> she can shine. Ah, but you must be tired from your journey. All this can wait until you are rested."},{"name":"SYSTEM","text":"The next blacksmith quest will be available from Fremondain upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"items":[{"num":120,"id":8},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":10}],"questsType":"all","quests":[65838,65964]},"next":[67544]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1012509","obj":{"i":1012509,"n":"Fremondain","l":2301,"q":5}},{"type":"npc","id":"1012510","obj":{"i":1012510,"n":"Fremondain","l":28,"q":2}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"65838","obj":{"i":65838,"n":"Waiting in the Winglet","g":137,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67544","obj":{"i":67544,"n":"Leave It to Fremondain","g":137,"l":"Ishgard","s":530,"f":1}}]}