{"quest":{"name":"The Good Fight","location":"Ishgard","id":67545,"patch":3.0,"sort":550,"icon":100453,"unlocksFunction":1,"eventIcon":71341,"issuer":1012509,"involved":[1012515,1012517],"genre":137,"usedItems":[10588],"journal":["Fremondain's brow is deeply furrowed.","Baroness Laurisse has sent Fremondain a note to the effect that she means to hone her skills further in the Dravanian forelands. Her loyal steward is shocked, for that way lie dragons in great number. However, he cannot believe she would be so rash as to charge alone into the Horde, and reasons that she will stop once in Tailfeather. He pleads that you intercept her there, and dissuade her from this risky plan.","You find Baroness Laurisse together with a wounded chocobo hunter. As it happens, the man was attacked, and the daughter of House Jervaint defended him. However, this was not without cost─her beloved sword has snapped in two, either due to the ferocity of her attack, or the age of the blade. Upon arriving and learning the news, a distraught Fremondain asks that you forge a weapon worthy of the grand tournament─a high-quality titanium bastard sword. Deliver it to him at the Jeweled Crozier when it is complete.","You hand over the titanium bastard sword to a most gratified Fremondain just in time for the trial round of the tournament. Knowing you will wish to know the outcome, the steward asks that you wait in front of the Lightfeather Proving Grounds.","Baroness Laurisse appears shortly after you, leading Fremondain to fear for the worst. However, in fact, her early release signifies a stunning victory. With two bouts won, one tie, and five forfeits, she will move on to the next round of the tournament. The baroness reveals that it is not for her own sake that she seeks knighthood. Her father believed that the nobility should lead the people with actions, not words─a conviction that cost him his position. Now, the daughter of House Jervaint wishes to join the Temple Knights so that she may serve the people of Ishgard.<br><br>※The next blacksmith quest will be available from Fremondain upon reaching level 58."],"objectives":["Speak with Laurisse at Tailfeather.","<span class=\"alternative-container\"><span class=\"alternative\">Forge a titanium bastard sword <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the titanium bastard sword <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Fremondain in Ishgard</span></span>.","Wait in front of the Lightfeather Proving Grounds."],"dialogue":[{"name":"FREMONDAIN","text":"Hm? Oh, excuse me, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I received a missive from milady, and was just starting to read it."},{"name":"FREMONDAIN","text":"“Must test skills... Worry not... Gone to...<span class=\"emphasis\">the Dravanian forelands</span>”!?"},{"name":"FREMONDAIN","text":"Halone forfend─straight into the Horde!"},{"name":"FREMONDAIN","text":"No, surely even <span class=\"emphasis\">she</span> would not be that reckless just before the tourney's trial round is set to begin. At the very least, she will stop once at Tailfeather to rest."},{"name":"FREMONDAIN","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─find her! Stop her if you can, and delay her if you cannot. I will follow as soon as I can finish here."},{"name":"FREMONDAIN","text":"I...I cannot comprehend why the baroness would choose <span class=\"emphasis\">now</span>, of all times, to test herself against the dragons..."},{"name":"FREMONDAIN","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, ensure she gets no closer to the Dravanian Horde than Tailfeather!"},{"name":"WOUNDEDHUNTER02009","text":"I'm fine... 'Tis only a flesh wound..."},{"name":"LAURISSE","text":"...Halone above, did that man send you after me <span class=\"emphasis\">again</span>?"},{"name":"WOUNDEDHUNTER02009","text":"Ungh... So yer one of hers, eh? Ye needn't worry, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─yer mistress fights like a behemoth ten times her size! Saved me from a wild chocobo. But what's...who's bellowin' at us?"},{"name":"FREMONDAIN","text":"(-Fremondain-)Baroness! Baroness Laurisse!"},{"name":"FREMONDAIN","text":"&lt;pant&gt; Mistress! Mistress, are...are you hurt!? &lt;pant&gt; Tell me where...and I shall..."},{"name":"LAURISSE","text":"Fremondain! Did you run all the way here? Come, man, save your breath! I am perfectly fine."},{"name":"WOUNDEDHUNTER02009","text":"Er...<span class=\"emphasis\">you</span> might be fine, m'lady, but what about yer sword? Beggin' yer pardon, but didn't it break off in the chocobo?"},{"name":"FREMONDAIN","text":"N-Not the brass viking sword!? That is milady's favorite!"},{"name":"WOUNDEDHUNTER02009","text":"That piece of shite? Er... Sorry, m'lady. Ain't the kind of steel that highborn normally wield. Anyroad, I've an extra blade lyin' about. I'll give it to ye as thanks for savin' me, if ye'd like."},{"name":"LAURISSE","text":"Yes, thank you. Even a dagger will suffice."},{"name":"FREMONDAIN","text":"M-Milady, it...it is most unlike you to borrow."},{"name":"LAURISSE","text":"The road to Ishgard is perilous without steel. And I...I cannot risk any harm coming to my loyal steward."},{"name":"FREMONDAIN","text":"Th-Thank you, Baroness Laurisse!"},{"name":"LAURISSE","text":"Forgive me for troubling you, too, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. It does not behoove a future Temple Knight to act so rashly. Shall we, Fremondain?"},{"name":"FREMONDAIN","text":"Ungh... <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, the baroness must enter the tourney with a weapon befitting House Jervaint─<span class=\"emphasis\">not</span> a borrowed dagger."},{"name":"FREMONDAIN","text":"Titanium bastard swords are all the talk these days─weightless and keen. Can I count on you to forge one? Your payment will be...er, milady's smile when she wins the tourney!"},{"name":"FREMONDAIN","text":"I will see you in Ishgard! W-Wait for me, milady!"},{"name":"FREMONDAIN","text":"Thank you for everything back in Tailfeather. I was also wondering if you had, ah...made any progress on the sword I requested."},{"name":"FREMONDAIN","text":"Halone's breath... Light as a feather, sharp as a wyrm's fang─even I can tell this blade is a masterpiece! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Milady will be overjoyed to learn you made it for her!"},{"name":"FREMONDAIN","text":"The trial round will begin shortly, and I daresay she will be nigh invincible with this sword in hand. I will take it to her as soon as I can."},{"name":"FREMONDAIN","text":"I fear we cannot watch Baroness Laurisse─only gentry may attend the grand tourney─but we are free to listen from outside the Lightfeather Proving Grounds. I will be there anon, if you care to wait."},{"name":"FREMONDAIN","text":"You must hurry to the Lightfeather Proving Grounds if you wish to hear Baroness Laurisse's matches."},{"name":"FREMONDAIN","text":"My mistress was most pleased with your creation, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! I daresay she is proving her mettle with it even as we speak!"},{"name":"FREMONDAIN","text":"B-Baroness! That you would be out of the arena in so short a time... D–Did something ill befall...?"},{"name":"LAURISSE","text":"Haha, Fremondain, ever the worrier! I won this round! And it was all thanks to your sword, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! The balance of the blade is perfect! Why, I could have wielded it all day, and still slain a wyrm to boot!"},{"name":"FREMONDAIN","text":"A splendid start to the tourney, Mistress! Please, regale us─how many bouts did you take part in?"},{"name":"LAURISSE","text":"Three. Two, I won, and the third was a draw. But I was declared winner in five more, as my challengers forfeited."},{"name":"FREMONDAIN","text":"A full five, milady? Surely Halone Herself smiles upon you! Did your lord father not say that good luck is an ally of success?"},{"name":"LAURISSE","text":"And that bad luck does not absolve failure. Ask only victory of your leaders, he told me. A commander can apologize for his defeat, but what need do his fallen soldiers have of apologies?"},{"name":"LAURISSE","text":"He lived by that ideal. He gave the order's food to the starving, only to be tried for pilferage, convicted, and stripped of knighthood. But he never recanted. Not <span class=\"emphasis\">once</span>!"},{"name":"FREMONDAIN","text":"Milady, is...is this why you work to restore House Jervaint? To clear your father's name?"},{"name":"LAURISSE","text":"No, Fremondain. I do it for Ishgard. Noble blood grants privilege, but only to save the unprivileged─another of my father's pet sayings."},{"name":"LAURISSE","text":"It is why I have entered this tourney, and why I wish to become a knight. And I will. For my father, for our people, and for everyone who has helped me along the way."}],"reward":{"items":[{"num":200,"id":8},{"id":11876},{"id":11957,"one":1},{"id":11962,"one":1},{"id":11975,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":10}],"quests":[67544]},"next":[67546]},"partials":[{"type":"npc","id":"1012509","obj":{"i":1012509,"n":"Fremondain","l":2301,"q":5}},{"type":"npc","id":"1012515","obj":{"i":1012515,"n":"Laurisse De Jervaint","l":2000,"q":1}},{"type":"npc","id":"1012517","obj":{"i":1012517,"n":"Injured Hunter","l":2000,"q":1}},{"type":"item","id":"11876","obj":{"i":11876,"n":"Titanium Cross-pein Hammer","l":100,"c":35115,"t":14,"p":14889}},{"type":"item","id":"11957","obj":{"i":11957,"n":"Ramie Turban of Crafting","l":100,"c":40470,"t":34,"p":9979}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"10588","obj":{"i":10588,"n":"Titanium Bastard Sword","l":133,"c":30518,"t":2,"p":17693}},{"type":"quest","id":"67544","obj":{"i":67544,"n":"Leave It to Fremondain","g":137,"l":"Ishgard","s":530,"f":1}},{"type":"quest","id":"67546","obj":{"i":67546,"n":"Blade That Was Broken","g":137,"l":"Ishgard","s":580,"f":1}}]}