{"quest":{"name":"Slings and Arrows","location":"Ishgard","id":67552,"patch":3.0,"sort":401,"icon":100442,"unlocksFunction":1,"eventIcon":71341,"issuer":1014944,"target":1012222,"involved":[1000915,1002680,1003282,1014946,1014947,1014948],"genre":159,"journal":["Leveva appears to be fully recovered from her ordeal with the bandits and is ready to continue your training.","Leveva insists you and Jannequinard are ready to open the fourth heaven's gate. She and Quimperain will travel ahead, while you inform Jannequinard of your new quest and prepare for the coming journey.","Jannequinard has decided he will not be accompanying you to Limsa Lominsa─the location of your next lesson. You have a feeling Lady Leveva will not be in the best of moods when she sees you arrive at Hawkers' Round alone.","Quimperain's face is white with fear when you meet him in Hawkers' Round, for Lady Leveva has gone missing. While he looks for her in the city's more disreputable establishments, he bids you scour Fisherman's Bottom and the Coral Tower.","While several people claim to have seen Leveva, no one knows her current whereabouts. Meet with Quimperain at the Seventh Sage and see if he has had better luck.","Quimperain claims that Leveva is scheduled to return to the Seventh Sage later this evening. Wait at the rendezvous point until the twelfth bell, and if the Sharlayan does not show, then proceed to the Drowning Wench to conduct one final search.","After successfully locating Leveva amongst an army of impostors, you journey to the Anchor Yard only to find a second army awaiting your arrival. However, with the aid of a few newly made friends, you succeed in driving off the pirates and are about to deliver the final blow to their captain, when Quimperain falls victim to her highly unoriginal trap. The trap, though, never is given the chance to unfold, when, like a knight in shining armor, Commodore Reyner of the Thalassocratic Navy arrives to chase off the captain and save the day. With all threats either fled or lying strewn about the city in pools of their own blood, you are finally able to attune with the fourth heaven─the Arrow. Return to Ishgard and regale Jannequinard with the grand tale of your adventures in Limsa Lominsa.","You return to find Jannequinard has already been scolded by Leveva for his absence on your most recent trip. He does, however, claim he spent the time productively─speaking with high-ranking members of the Holy See about the possibility of holding an official audience with Leveva regarding Sharlayan astrology. His labors, unsurprisingly, bore no fruit.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 45."],"objectives":["Speak with Jannequinard.","Speak with Quimperain in Limsa Lominsa.","Gather information in Fisherman's Bottom.","Gather information in the Coral Tower.","Gather information at the Seventh Sage.","Await Leveva's arrival at the rendezvous point.","Speak with Jannequinard in Ishgard.","Inquire with townspeople about Leveva's whereabouts.","Defeat the Serpent Reavests!"],"dialogue":[{"name":"JANNEQUINARD","text":"My not telling you of Lady Leveva's ambush was part of her lesson? Hah! The next thing you will tell me is that me talking with you now is <span class=\"emphasis\">also</span> part of her lesson. (It's not part of her lesson is it? I do not think I can afford to fail another one of these.)"},{"name":"LEVEVA","text":"Are you ready, my pupil? The gate to the fourth heaven awaits; however, the location I have chosen for attunement will not remain the most optimal for long. You are to travel with Jannequinard, and I will make the journey with Quimperain. There are no objections? Good."},{"name":"JANNEQUINARD","text":"If it is Lady Leveva you seek, she just left with Quimperain for Limsa Lominsa. If you make haste, you may still be able to catch them at the airship landing."},{"name":"JANNEQUINARD","text":"Me? As much as I would like to indulge myself on the pillows of Rhotano pleasure barges, there is a congress to be held in the Vault, and all the prominent houses have been summoned. My presence at such an event would be sorely missed, so I fear this next lesson must needs proceed without me. I'm certain the Lady Leveva will understand. I can always open the third gate another day...or was it the fourth? Third or fourth. It is of no matter. The stars certainly will not be going anywhere."},{"name":"JANNEQUINARD","text":"If it is Lady Leveva you seek, she just left with Quimperain for Limsa Lominsa. And if you ask me, those two have grown awfully close as of late. I had best keep an eye on them, lest that honey-tongued manservant of mine forget his station."},{"name":"QUIMPERAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Milady</span><span class=\"alternative\">Milord</span></span>! The Lady Leveva is missing! We disembarked the airship together, but became separated in the chaos at the landing."},{"name":"QUIMPERAIN","text":"Seeing as how the lady has found herself the victim of bandit attacks twice since arriving in Eorzea, I fear she may be targeted once again, especially considering the location..."},{"name":"QUIMPERAIN","text":"This is my first time setting foot in Limsa Lominsa, but I have been made aware of its landmarks. Might I suggest we search independently so that we might cover more ground? I shall start with several of the seemingly more disreputable locations such as the Drowning Wench, the <span class=\"emphasis\">Astalicia</span>, and the Missing Member. Would <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span> be so kind as to search Fisherman's Bottom and the Coral Tower?"},{"name":"QUIMPERAIN","text":"Let us meet at the Seventh Sage once our survey is complete."},{"name":"VKEBBE","text":"Twenty-odd summers since I spilled from me ma's loins, and ain't once I ever heard the word astrologian. Now, in the span o' two bloody bells, I gone an' met meself not one, but an honest-to-goodness pair o' live star-gawpers."},{"name":"VKEBBE","text":"Didn't see where that other fair-skinned lass buggered off to. Ones as that, though, oft end up on the pleasure barges, if ye catch me drift."},{"name":"VKEBBE","text":"Twenty-odd summers since I spilled from me ma's loins, and ain't once I ever heard the word astrologian. Now, in the span o' two bloody bells, I gone an' met meself not one, but an honest-to-goodness pair o' live star-gawpers."},{"name":"VKEBBE","text":"Didn't see where that other fair-skinned lass buggered off to. Ones as that, though, oft end up on the pleasure barges, if ye catch me drift."},{"name":"REYNER","text":"Another astrologian? How odd. It is not often that even our city–state, known for its diversity, welcomes a single reader of the stars through its gates...let alone two...and in the same day, no less."},{"name":"REYNER","text":"Yes, I took a few moments from my duties to speak with her about the city–state. She seemed quite interested in our dealings with the Sahagin, the Serpent Reavers, and the Garlean Empire. I told her what I could, but she left after only a few moments. It was as if she thought she was being pursued, but the Sharlayan was gone before I could assign her a Yellowjacket escort."},{"name":"REYNER","text":"I am commodore of the greatest naval force Eorzea has seen in at least two, if not three Astral Eras─closest man to the Admiral herself..."},{"name":"REYNER","text":"...and still I am subjected to a daily barrage of questions from what feels like every adventurer in the realm. I am seriously considering an iron lock for those bloody doors."},{"name":"BROENBHAR","text":"Aye, I seen me a stuffy lass in rum garb pokin' her loverly head in holes where it weren't wanted. 'Tis rare we get one so worldly down in the gurglin' belly o' the Tower. I had to halt trainin' to work out what the fuss was about."},{"name":"BROENBHAR","text":"The maid inquired as to where she might find herself a nip or two o' some o' the strong stuff, so I pointed her in the direction of our resident apothecary, Carvallain o'er at the Seventh Sage."},{"name":"BROENBHAR","text":"Aye, I seen me a stuffy lass in rum garb pokin' her loverly head in holes where it weren't wanted. 'Tis rare we get one so worldly down in the gurglin' belly o' the Tower. I had to halt trainin' to work out what the fuss was about."},{"name":"BROENBHAR","text":"The maid inquired as to where she might find herself a nip or two o' some o' the strong stuff, so I pointed her in the direction of our resident apothecary, Carvallain o'er at the Seventh Sage."},{"name":"QUIMPERAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Lord</span></span> <span class=\"highlight\">Forename</span>. I bear good tidings. The Lady Leveva is scheduled to return here within a matter of bells. It seems she entered a contract with Carvallain for the purchase of several of the apothecary's wares."},{"name":"CARVALLAIN","text":"An interesting girl, that one. Very rarely do we see young maidens walk the Lominsan streets without escort. And almost never do they come to me seeking...ah, <span class=\"emphasis\">spice</span>."},{"name":"CARVALLAIN","text":"Still, she did appear quite uneasy, as if being watched, or followed─suspicions, I must say, not uncommon in our fair city. Might she be in some manner of trouble?"},{"name":"QUIMPERAIN","text":"Those few who agreed to speak with me at the Drowning Wench and the Missing Member claimed the same. My short stay on the <span class=\"emphasis\">Astalicia</span> bore no fruit whatsoever... What were you able to find, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>?"},{"name":"QUIMPERAIN","text":"I see. So we have ascertained that the lady is being followed...and that she is aware of the fact. If this is the case, I believe she will attempt to move somewhere she will be in plain sight of as many people as possible."},{"name":"CARVALLAIN","text":"I doubt that will help in this town. Kidnappings and killings are conducted in broad daylight here, and when they happen, most people just keep their heads down, so as not to have them removed from their shoulders."},{"name":"QUIMPERAIN","text":"Twelve damn this town! <span class=\"alternative-container\"><span class=\"alternative\">Milady</span><span class=\"alternative\">Milord</span></span>, I shall set out once more and try to locate Lady Leveva. There is still the chance she may return here on her own, so I ask that you remain in case she does."},{"name":"QUIMPERAIN","text":"If she has not arrived at the rendezvous point by the time of her scheduled meeting with Carvallain, then we shall both go to the one location that is most populated after the sun falls in Limsa─the Drowning Wench."},{"name":"CARVALLAIN","text":"This Lady Leveva... You said she was an astrologian, yes? It has been many summers, but there was a time when I, too, dreamed of reading the stars. To think, if I had a teacher as lovely as her, my life might have taken a different direction..."},{"name":"CARVALLAIN","text":"(-Carvallain-)It appears that your companion is tied up...not literally, I hope. Perhaps you should head to the Wench and see if she is there like your friend believes. Though, I fear that if she did not make it that far, you may never find her again. At least not alive."},{"name":"CARVALLAIN","text":"(-Carvallain-)Worry not, my starry-eyed friend. If, by chance, she were to arrive here after your departure, you have my word that no harm shall come to her while she remains behind the Seventh Sage's doors."},{"name":"QIB","text":"Me brave knight in shiny armor! Come an' give me gutter a kiss!"},{"name":"QIB","text":"<span class=\"alternative-container\"><span class=\"alternative\">Milady</span><span class=\"alternative\">Milord</span></span>! The area is filled with impostors who seek to keep us occupied while their leader pursues Lady Leveva. We must be quick!"},{"name":"QIB","text":"That there are those about who would attempt to stall us must mean the lady still eludes them. Follow me. I fear she may not be able to remain hidden for much longer."},{"name":"QIB","text":"Like moths to the flame! Celie'll be pleased when I bring 'er back yer wings!"},{"name":"QIB","text":"Another impostor... Ifrit's fiery piss! Just how many of these damned rogues are there!?"},{"name":"QIB","text":"<span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Lord</span></span> <span class=\"highlight\">Forename</span>... I cannot trust even mine own eyes. Which one is the true Leveva?"},{"name":"QIB","text":"Not another!"},{"name":"QIB","text":"Some good them cards are if they can't even scry where yer missin' maiden be!"},{"name":"QIB","text":"Quite clever of you, <span class=\"highlight\">Forename</span>, to discern which of us was the impostor."},{"name":"QIB","text":"Lady Leveva! Stay behind me! Evil still lurks!"},{"name":"QIB","text":"Thal's balls! I thought she was one of us!"},{"name":"QIB","text":"There's no end to them!"},{"name":"QUIMPERAIN","text":"Lady Leveva... You have my apologies. It was my fault I allowed us to become separated..."},{"name":"LEVEVA","text":"Do not blame yourself, Quimperain. I sensed danger at the landing, and it was my instinct to run...as ever I have. I forgot that I could trust you. Unfortunately, by the time I realized such, there was no sign of you, so I did what I could to blend in─choosing crowded places, speaking with as many locals as possible, though all the while feeling there were unseen eyes watching my every move."},{"name":"LEVEVA","text":"By the time I realized that my pursuers were simply leading me away from you, night had already fallen, giving them the perfect opportunity to strike. It was then that I witnessed several of the bandits had disguised themselves in garb similar to mine. I assumed this was to confuse the three─? Ahem, two of you still searching for me. It was then I conceived the idea to play the part of an impostor myself. Why hide in the shadows, when you can hide in plain sight?"},{"name":"QUIMPERAIN","text":"That was quite brilliant of you, Lady Leveva. May I ask, were you, at any time, able to discern who these pursuers were? The amount of effort put into your capture would suggest they are more than mere pirates looking to sell you to slavers."},{"name":"LEVEVA","text":"Unfortunately, no. And I wasn't about to walk up and ask them who they were or who had hired them. But that is all behind us now. Let us see if we can salvage something from this horrible night. The fourth gate ascends nearby, <span class=\"highlight\">Forename</span>. Shall we not see it made yours? To the Anchor Yard!"},{"name":"ZOKU02016","text":"Well, I'll be a barnacle on a kraken's arse! If it ain't the star-gawpin' lassie come to scry us our fortunes! Tell us: which one o' ye'll be dyin' first, like? The beet red knight with a carp in his codpiece? Or the stern-faced 'venturer on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> high hobbyhorse?"},{"name":"LEVEVA","text":"Godsdammit! How many pirates are in this godsforsaken hell!?"},{"name":"QIB","text":"What is it you want from me then? Coin? Is that it? Here, you can have all I carry!"},{"name":"QIB","text":"How kind of ye. Though it ain't your purse we was hired to snatch. 'Tis you, milady. But we'll make sure yer coin makes its way into deservin' hands once we've tied and gagged ye and left yer friends here bleedin' in the gutter."},{"name":"QIB","text":"All the coin in the world is not worth losing my life over. Farewell, milady!"},{"name":"QIB","text":"Ye won't get away this time!"},{"name":"QIB","text":"There will be time enough for questions once we've torn their throats out!"},{"name":"QIB","text":"Quimperain! More pirates approach!"},{"name":"QIB","text":"The night watch reported a pair o' mages flingin' magicks down at the yard. Thought it'd be you two."},{"name":"QIB","text":"Could hear the clamor all the way down in the Bottom...and I ain't one to turn a deaf ear to a proper midnight melee."},{"name":"QIB","text":"Well met, my new friends! Your assistance is most timely!"},{"name":"QIB","text":"Do not let a pair of new blades keep us from our prize, boys! Attack!"},{"name":"QIB","text":"Worked up quite the thirst, I have. If ye find yerself beset by any more pirates or brigands or such, I'll be whettin' both me blade and me whistle o'er at the Wench."},{"name":"QIB","text":"A fine spot of merrymaking, if I do say so meself! Maybe next time ye can learn me a couple of them star tricks."},{"name":"QIB","text":"A manservant and a maid... That's all I was told..."},{"name":"QIB","text":"Forgive me, Lady Leveva... I have failed you..."},{"name":"QIB","text":"Grandfather... Did you see this fate, as well?"},{"name":"CELIE","text":"Ha ha! Lay down them weapons, or I'll cut the old man a new grin under his chin!"},{"name":"LEVEVA","text":"I cannot believe that actually worked..."},{"name":"CELIE","text":"Nor can I. But then again, never have I fought someone so credulous. Now let us do this as they do in the fear-babes. You step over here, I let the man go. Easy peasy."},{"name":"QUIMPERAIN","text":"Wait... I know you... You're the bandit leader who attacked Lady Leveva's grandfather in the Black Shroud!"},{"name":"CELIE","text":"Someone has a good memory for being so on in years. Well, then. This changes everything. First off, I can finally drop this annoying pirate accent. And secondly, I suppose I can simply kill you now, rather than after pretending to let you go once the lady has drawn close enough."},{"name":"REYNER","text":"Stop right there. Unhand that man or I'll have your head tarred and on the prow of a galley by cockcrow."},{"name":"CELIE","text":"First maniacal marauders, then feline fishers, and now the commodore of the swivin' Thalassocratic Navy. How many more gods is this machine going to drop on me? Until next time, Lady Leveva!"},{"name":"QUIMPERAIN","text":"You have my apologies... I was a fool to fall for the bandit's trick."},{"name":"REYNER","text":"Amazing... In all my years, that was the first time I've ever seen that feigning-death trick actually work. But now is not a moment to be dwelling on our many failings. I have a dastard to apprehend. You would be surprised how often people run after being told to “stop right there.”"},{"name":"QUIMPERAIN","text":"Lady Leveva. That pirate. She was the same bandit who─"},{"name":"LEVEVA","text":"Yes, I know. And that changes little, for I still have no idea who she may be, or who she may be working for. There is naught we can do until the commodore brings the woman to justice, or until she decides to attack us again. What we <span class=\"emphasis\">can</span> do is what we came here for─<span class=\"highlight\">Forename</span>'s training."},{"name":"LEVEVA","text":"Now, look to the stars and behold the Arrow!"},{"name":"LEVEVA","text":"The fourth heaven─or the heaven of wind─was created atop a lofty peak by Oschon, the Wanderer, whose footsteps had been guided by the Navigator."},{"name":"LEVEVA","text":"The wind that blows off Llymlaen's seas guides the arrow fast and true, and so shall it deliver the weary souls of those trapped in the mire of confusion, indecision, and over contemplation."},{"name":"LEVEVA","text":"The fourth heaven has opened its gates, allowing you access to its sacred penetralia. From this day forth, its power is yours to interpret and wield."},{"name":"LEVEVA","text":"That power will further aid you as you continue to hone your skills. Now, let us return to Ishgard. I have a few words for a certain student of mine who felt inclined to forgo this particular lesson."},{"name":"CARVALLAIN","text":"Leveva and her sword stopped by earlier to pick up her...spices, and I must say, I was quite relieved to see her unhurt. My men tell me your party caused quite the commotion last night. I only wish I had the time to speak a little longer with the young astrologian. There was something so familiar about her..."},{"name":"QUIMPERAIN","text":"Dammy"},{"name":"JANNEQUINARD","text":"Ah, <span class=\"highlight\">Forename</span>! You might have had the decency to warn me that Lady Leveva was in a mood with me for not joining you! She seemed to think <span class=\"emphasis\">I</span> was to blame for your misadventures!"},{"name":"JANNEQUINARD","text":"Now why would that be? It is not as if my being there would have prevented the bandits from attempting to abduct Leveva─these being the same bandits who attacked you in the Black Shroud, which, by the way, is <span class=\"emphasis\">another</span> location I was not at. This is plainly something far beyond our control."},{"name":"JANNEQUINARD","text":"And furthermore, it is not as if I was merely sipping cordials and waltzing with baronets─I was helping further our cause! I spoke with several high-ranking cardinals about Lady Leveva being granted the opportunity to speak at the Vault regarding Sharlayan astrology! What do you think of that!?"},{"name":"JANNEQUINARD","text":"I was politely turned down, of course, but it is the gesture! The gesture that will one day lead to another gesture which will one day lead to a head inclined slightly in the general direction of another gesture! Little steps, my protégé! Little steps!"}],"reward":{"xp":11270},"reqs":{"jobs":[{"lvl":40,"id":99}],"quests":[67551]},"next":[67553]},"partials":[{"type":"npc","id":"1014944","obj":{"i":1014944,"n":"Leveva","l":2301,"q":4}},{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1000915","obj":{"i":1000915,"n":"Carvallain","l":28,"q":6}},{"type":"npc","id":"1002680","obj":{"i":1002680,"n":"Broenbhar","l":28,"q":2}},{"type":"npc","id":"1003282","obj":{"i":1003282,"n":"Reyner","l":28,"q":6}},{"type":"npc","id":"1014946","obj":{"i":1014946,"n":"Quimperain","l":29,"q":1}},{"type":"npc","id":"1014947","obj":{"i":1014947,"n":"V'kebbe","l":29,"q":1}},{"type":"npc","id":"1014948","obj":{"i":1014948,"n":"Quimperain","l":28,"q":1}},{"type":"quest","id":"67551","obj":{"i":67551,"n":"A Lesson in Patience","g":159,"l":"Ishgard","s":400,"f":1}},{"type":"quest","id":"67553","obj":{"i":67553,"n":"Ewer Right","g":159,"l":"Ishgard","s":450,"f":1}}]}