{"quest":{"name":"Feather in the Cap","location":"Ishgard","id":67559,"patch":3.0,"sort":560,"icon":100443,"unlocksFunction":1,"eventIcon":71341,"issuer":1012222,"target":1012222,"involved":[1015084,1015087,1015089,1015092,1015093,1015094,1015095],"genre":159,"journal":["Jannequinard has the latest information on Lady Leveva's current location.","Leveva has moved north to Tailfeather in the Dravanian forelands. Travel to the remote camp with Jannequinard to learn what her plans for the hamlet may be.","The hunters of Tailfeather, tired of having their broken arms mended with bone saws, have formally requested aid from the same astrologians who assisted the Convictors with their battle-wounded. Leveva suggests that as long as you are in the hamlet, you help her by weaving an Aspected Benefic or three.","There appear to be no more wounded hunters in Tailfeather. Speak with Leveva of your progress.","Leveva appears drained from the day's work and has stepped out of the hamlet for a moment of respite. Jannequinard worries for her safety and has asked that you and Quimperain escort the lady.","Just as you arrive, the Sharlayan mercenary Celie appears from the trees. A battle ensues, though it is Celie who has the decided advantage, this time bringing a veritable army to fight at her side. The tide turns, however, when from the hamlet arrive four of the hunters you healed earlier, bows in hand. It is not long before Celie is slain and a great burden is lifted from your party's shoulders. Return to the Athenaeum Astrologicum with Jannequinard.","Jannequinard seems worried about the possibility that the Sharlayan Forum will come for Leveva. Fortunately for you, this worry reminds him of a technique he learned while studying abroad, and he is kind enough to pass it on to you.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 58."],"objectives":["Speak with Leveva in Tailfeather.","Cast Aspected Benefic on the injured hunters.","Speak with Leveva.","Speak with Leveva in the Chocobo Forest.","Speak with Jannequinard in Ishgard.","Slay Celie and her henchmen!"],"dialogue":[{"name":"JANNEQUINARD","text":"I am happy to report that Leveva is fine and well, and hasn't been attacked by bandits, dastards, curs, Sharlayan spies, or disgruntled knights once since her last encounter at the Convictory."},{"name":"JANNEQUINARD","text":"After restoring health to all the Convictors so they might return to getting wounded again, she journeyed northwest into the Dravanian forelands. If that journey was without incident, she should be in Tailfeather now, tending to the chocobo hunters there. Might I suggest that we go and join her, <span class=\"highlight\">Forename</span>?"},{"name":"JANNEQUINARD","text":"I cannot remember the last time I was in the forelands...probably because I have never been to the forelands. Why would anyone go there? It's literally crawling with dragons!"},{"name":"LEVEVA","text":"<span class=\"highlight\">Forename</span>! It is good to see you again. I pray you have not been neglecting your training. Now, you may be wondering why I chose Tailfeather, of all places, to visit next. Well, the truth of the matter is, I did not <span class=\"emphasis\">choose</span> it at all; it chose me. The hunters here somehow heard of what we had done at the Convictory and placed a formal request to have me come and tend to the hamlet's wounded."},{"name":"LEVEVA","text":"I would like to believe this proof that word of the benefits of Sharlayan astrology is slowly but surely spreading through the realm. Ah, but enough talk. There are still many ailing souls that require succor. Would you and Jannequinard mind assisting me again as you did in the western highlands?"},{"name":"LEVEVA","text":"Though many of these men's wounds are deep, Aspected Benefic should provide sufficient healing."},{"name":"JANNEQUINARD","text":"Other than singeing the arse of a Jeweled Crozier cutpurse or soothing the scraped knee of a tripped maiden, it is rare that I have the opportunity to use many of my spells while behind the ramparts of Ishgard proper. This is actually all quite exciting."},{"name":"WOUNDEDA02023","text":"The pain! Oh, the pain!"},{"name":"WOUNDEDA02023","text":"I don't know who you are, but you're good in my book."},{"name":"WOUNDEDB02023","text":"Damn each and every one of the Twelve to the seventh hell and back! I'm not ready to die!"},{"name":"WOUNDEDB02023","text":"Praise the Twelve! I'm healed!"},{"name":"WOUNDEDC02023","text":"Two score summers trappin' chocobos and not a single beak in the eye or talon in the arse...and here I am on my deathbed on account of trippin' over a caelumtree root."},{"name":"WOUNDEDC02023","text":"An honest healer! Here in Tailfeather? Now I <span class=\"emphasis\">have</span> seen everything."},{"name":"JANNEQUINARD","text":"I do believe that is everyone...at least for today."},{"name":"LEVEVA","text":"These men and women have chosen a horrendously dangerous profession. A chocobo's talons can rip open flesh to the bone, and a single kick can knock an otherwise hale hunter out for a sennight...if he survives it."},{"name":"JANNEQUINARD","text":"Many of them seemed surprised─grateful, of course, but surprised─that we were here helping them. Does the hamlet not have its own healers? Do the Temple Knights not dispatch their hospitaliers this far from Ishgard?"},{"name":"LEVEVA","text":"The Holy See only cares for the war with the dragons. It cannot be bothered with a handful of hunters, despite the fact these hunters are its citizens. I was told on my arrival that they manage with makeshift poultices created using herbs gathered from around the hamlet. When the wounds are more severe...they turn to their sole barber who...well, is also the local butcher. I'm sorry. My frustration with the situation coupled with the day's efforts have me slightly drained. Might I be allowed a few moments of respite?"},{"name":"QUIMPERAIN","text":"Dammy"},{"name":"JANNEQUINARD","text":"Quimperain, <span class=\"highlight\">Forename</span>. Would you be so kind as to accompany the lady on her stroll? It has been far too long since that Sharlayan assassin showed her face, and a reading I conducted earlier this morning showed a day rife with conflict and confusion."},{"name":"LEVEVA","text":"I am glad you came, <span class=\"highlight\">Forename</span>. There is something important I must tell you. Since Jannequinard gave me my father's journal, I have spent my nights poring over his writings, trying to piece together what I could about his life. It appears he was hardworking, and just. He trusted all, and truly wanted to help people in need. He believed that knowledge should not be hoarded like food, but shared amongst the intellectually starved."},{"name":"LEVEVA","text":"He also knew that there were those who would see him stopped. Persons who used their influence to trick and frighten the Forum into believing that knowledge should be kept at one's breast─persons who saw my father as a threat. His final few entries all speak of how he feared for his life─of how one man in particular was working to see him dead. That man's name─"},{"name":"CELIE","text":"(-Familiar Voice-)Is not important, for in the end, it turned out your father was killed by the very people he was foolish enough to trust. People who, in their slaying of a good man, proved that they were unworthy of the knowledge he so freely offered them. And now, here you are, making the same mistake as he. Continue with this foolishness, and you, too, will suffer his fate."},{"name":"LEVEVA","text":"Do not dare talk of my father as if you knew him! You know nothing. Your mind is as closed as the minds of those back in the Old World who believe that hiding in their books will shield them from the pain and suffering of the real world!"},{"name":"CELIE","text":"(-Celie-)Such passion... It is a pity it remains misdirected. My employer only wishes to see you back, safe in Sharlayan. The Forum recognizes your talent. You are an asset to our nation and its people. We would have you live a long and prosperous life, so that you may rise even higher than your father ever had the opportunity to."},{"name":"CELIE","text":"(-Celie-)Ah, but we both know you are far too stubborn to take this gift so graciously offered. You would rather fight. And you know? So would I. No more games, Leveva. Let us end this. Right here. Right now. With your precious stars as our witness!"},{"name":"CELIE","text":"(-Celie-)Let us end this. Right here. Right now. With your precious stars as our witness!"},{"name":"CELIE","text":"(-Celie-)Spare no one! Not even the girl!"},{"name":"QIB","text":"Fate has guided us here, <span class=\"highlight\">Forename</span>! Now let us guide our fates to victory!"},{"name":"QIB","text":"Oh, do not think because you bested me in the past, you can do the same here. This time I come prepared!"},{"name":"QIB","text":"Is there no end to them!?"},{"name":"QIB","text":"Looks as if you could do with an extra blade!"},{"name":"QIB","text":"I will not die like your father did, on foreign soil, at the hand of barbarians!"},{"name":"QIB","text":"Ah... The irony..."},{"name":"QIB","text":"I cannot─ Gaaah..."},{"name":"QIB","text":"This cannot be...where my path ends..."},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"JANNEQUINARD","text":"Are you all right!? I heard the commotion and came as quickly as I could!"},{"name":"LEVEVA","text":"Not as quickly as these four. You remember, the hunters so gravely wounded not less than a bell ago? If memory serves me, they could barely lift a finger, let alone rush headlong into a heated battle and help turn the tide."},{"name":"WOUNDEDC02023","text":"(-Tailfeather Hunter-)Ah, don't be too hard on the silkshirt. Turns out we didn't need his help anyroad."},{"name":"WOUNDEDC02023","text":"(-Tailfeather Hunter-)Who'd have thought it, eh? Real live fightin' astrologians. Now I truly <span class=\"emphasis\">have</span> seen everythin'."},{"name":"JANNEQUINARD","text":"Leveva! I daresay those men would not have risked their lives had they little respect for us or our craft. You were right. Our actions here have done more to promote Sharlayan astrology than any long-winded discourse. Why, I expect this very night, the tale of your daring deeds will be told a hundred times over in mead halls across the forelands."},{"name":"LEVEVA","text":"Which means it will not be long before the Forum has heard as well. We Sharlayans may have officially abandoned this realm, but our ears remain. If the one who hired Celie is who I think it is, then I expect naught less than a formal edict of extradition to be issued."},{"name":"JANNEQUINARD","text":"An edict of extradition? But Sharlayan has no power to force Ishgard to deliver you into their hands."},{"name":"JANNEQUINARD","text":"Furthermore, what exactly is it you have done wrong, but allowed others to partake in your great nation's bottomless well of knowledge...as I did more than fifteen summers ago when I studied in her halls?"},{"name":"LEVEVA","text":"Things changed after you left, Jannequinard. Many even believe it was my father's death that tipped the scales in favor of closing Sharlayan's doors and locking away all our knowledge. If the Forum deems it so, I could be arrested and imprisoned for “the theft of national resources.” And I see no reason why your Holy See, who has already shown its disdain for our efforts, would stand in its way."},{"name":"JANNEQUINARD","text":"So what do we do? Your grandfather... Your father... They have given up so much to see you here. We cannot just concede defeat, now that we have finally begun to make headway!"},{"name":"LEVEVA","text":"I never said we would, Janne. I have no intention of giving up or giving in. Doing so would be to deny the sacrifices made by my father and grandfather. The stars have shown me the path I must take. There is no other. And it begins back at Tailfeather healing those who aided us. I will see the two of you in Ishgard once I have settled matters here. Quimperain will see I arrive unharmed."},{"name":"JANNEQUINARD","text":"Lady Leveva still has not returned from Tailfeather. Oh, but do not worry. I have had word that she simply intends to stay a few turns of the sun longer."},{"name":"JANNEQUINARD","text":"What we should be worrying about, however, is the Forum and their pending decision on our companion's extradition. If an official edict <span class=\"emphasis\">is</span> drafted, I fear we may find ourselves at the mercy of the Vault. And if that were to happen, there will be little we can do to keep Leveva here, short of starting a war."},{"name":"JANNEQUINARD","text":"If only we had more time! When I was studying in Sharlayan, I heard whispers of an ancient astromantic spell which could stop time and the very movements of the heavens. All of my professors denied it existed, of course..."}],"reward":{"gil":1691,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":99}],"quests":[67558]},"next":[67560]},"partials":[{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1015084","obj":{"i":1015084,"n":"Leveva","l":2000,"q":1}},{"type":"npc","id":"1015087","obj":{"i":1015087,"n":"Leveva","l":2000,"q":1}},{"type":"npc","id":"1015089","obj":{"i":1015089,"n":"Jannequinard","l":2000,"q":1}},{"type":"npc","id":"1015092","obj":{"i":1015092,"n":"Injured Hunter","l":2000,"q":1}},{"type":"npc","id":"1015093","obj":{"i":1015093,"n":"Injured Hunter","l":2000,"q":1}},{"type":"npc","id":"1015094","obj":{"i":1015094,"n":"Injured Hunter","l":2000,"q":1}},{"type":"npc","id":"1015095","obj":{"i":1015095,"n":"Leveva","l":2000,"q":1}},{"type":"quest","id":"67558","obj":{"i":67558,"n":"Conviction","g":159,"l":"Ishgard","s":540,"f":1}},{"type":"quest","id":"67560","obj":{"i":67560,"n":"Trumped","g":159,"l":"Ishgard","s":580,"f":1}}]}