{"quest":{"name":"Hanging in the Balance","location":"Ishgard","id":67550,"patch":3.0,"sort":350,"icon":100442,"unlocksFunction":1,"eventIcon":71341,"issuer":1012222,"target":1012222,"involved":[1014935,1014936,1014937,1014941,1014942,1014943],"genre":159,"journal":["Jannequinard believes you and he are ready for the next step in your training.","Jannequinard reveals that Leveva awaits you both at the Final Prayer in eastern Thanalan. There you are to attempt an opening of the second heaven's gate.","Leveva insists that you must be patient when waiting for the constellations to ascend into midheaven. Stand in the location specified by your instructor and survey the skies until the stars have risen.","You succeeded in attuning with the Balance. The next gate lies beneath the skies of Little Ala Mhigo. Meet with Leveva at the camp, and hearken to her instructions.","Leveva surprises you by suggesting that you and Jannequinard are ready to open the third heaven's gate. Stand in the specified location and survey the skies until the stars ascend.","You have attuned with the Spire. Could it be that you are ready for the fourth gate? Speak with Leveva and find out.","Leveva appears drained from her journey and has suggested that you take some time to further hone your astrological prowess before moving on to the fourth gate. She believes that Jannequinard, of all people, might be able to help you. Return to the Athenaeum to learn about the “royal road” of arcana reading.","Jannequinard, in his own awkward way, has passed on knowledge that might be useful in your training. Use these techniques to better perform in battle, and return to Jannequinard once you are confident in your newfound ability.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 40."],"objectives":["Speak with Leveva at the Final Prayer.","Survey the skies at the destination specified by Leveva.","Speak with Leveva outside Little Ala Mhigo.","Survey the skies at the destination specified by Leveva.","Speak with Leveva.","Speak with Jannequinard in Ishgard."],"dialogue":[{"name":"JANNEQUINARD","text":"Greetings, <span class=\"highlight\">Forename</span>! The stars tell me you have been rigorously following Leveva's training regimen...though I harbor doubts that “go out and do things while I traipse about the realm” constitutes a regimen."},{"name":"JANNEQUINARD","text":"Still, she is all we have, so I suppose we have to make do. And, as the stars would have it, she has just sent word that she is ready for us to attempt the opening of the second heaven's gate."},{"name":"JANNEQUINARD","text":"You are aware of the seven heavens, are you not? Just as there are seven realms of the underworld, so too are there seven realms of the firmament. Each of the first six represent one of the six basic elements─earth, ice, water, wind, lightning, and fire─the seventh and final heaven representing the elements' astral polarity."},{"name":"JANNEQUINARD","text":"The first six heavens are represented by the six constellations which each revolve around the pole star."},{"name":"JANNEQUINARD","text":"Astrologians of the Sharlayan school draw on the aether contained in the celestial bodies represented in the constellations by “unlocking” or “opening” the gate to heaven that constellation is correlated with. There is no <span class=\"emphasis\">actual</span> gate...think of it as more a portal to the soul. You are opening your mind, allowing for attunement with these distant bodies, much like one attunes with an aetheryte, but on a far grander scale."},{"name":"JANNEQUINARD","text":"Now this may come as a revelation, but Hydaelyn is not flat like most believe. It is, in fact, a sphere so large, that when we walk upon it, it only <span class=\"emphasis\">appears</span> to be flat. Because it is a sphere, there are some locations better suited than others for observing certain constellations. That is what Leveva is doing right now─finding a location in which the next heaven's gate will rise to a position directly in midheaven, where it will be easiest to attune with. And it seems she has found one...near the Final Prayer in eastern Thanalan."},{"name":"JANNEQUINARD","text":"Oh, I harbor no ill feelings toward you regarding Professor Mace's decision to choose you over me as his successor. To tell you the truth, I was even sort of relieved. The successor to the greatest astrologian in Sharlayan? Think of all the responsibility..."},{"name":"JANNEQUINARD","text":"I don't believe my travels have ever taken me this far south. A tad dusty for my tastes. And warm. And dry. And brown."},{"name":"QUIMPERAIN","text":"The journey here was uneventful, but the moment we arrived, we were set upon by bandits. I had no trouble driving them away, but I fear they may return again in numbers. Focus on your training, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>, and I shall keep watch."},{"name":"LEVEVA","text":"Here at last, I see. Bandits have kept poor Quimperain busy, harrying our camp since we arrived. I do believe the old man enjoys the excitement, however. I'm certain it beats wiping the arse of a noble brat whoring away his uncle's fortune while dreaming of becoming a <span class=\"emphasis\">real</span> astrologian."},{"name":"JANNEQUINARD","text":"I am very well capable of wiping my own arse, thank you very much. And Quimperain has never once complained of his duties."},{"name":"LEVEVA","text":"Of course he hasn't. Your uncle pays him to smile and nod, and I'm sure a comfortable position in the Pillars beats chasing after cloud rats in the Brume to flavor his soup."},{"name":"JANNEQUINARD","text":"Are we here to trade banter, my lady, because I was led to believe we'd be unlocking a celestial gate? You will find Quimperain has a good many uses, and I haven't the faintest doubt that he will most ably handle any ruffians who happen to come stumbling about looking for prey."},{"name":"LEVEVA","text":"Now <span class=\"highlight\">Forename</span>...and Jannequinard. We must be patient and wait for the constellation to reach its highest and brightest point─a point at which its flow of aether is the strongest in relation to Hydaelyn."},{"name":"LEVEVA","text":"Be patient, <span class=\"highlight\">Forename</span>. We are at the mercy of the stars and their movements. Only a fool believes <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> can manipulate the heavens. It is the heavens which manipulate us. We merely take cues from the hints they leave behind."},{"name":"LEVEVA","text":"There, <span class=\"highlight\">Forename</span>! The Balance! Focus on the constellation and attune to its power."},{"name":"LEVEVA","text":"The Balance represents the heaven of fire─a realm made prosperous by the blessing of the Traders, but at the same time, one whose equilibrium is maintained by the divine judgment of Azeyma, the Warden."},{"name":"LEVEVA","text":"Azeyma's might will empower those who would take up their blades and mete divine punishment in the name of the sun goddess."},{"name":"LEVEVA","text":"And thus has the Balance burned crimson in your heart, unlocking the gate to the second heaven."},{"name":"LEVEVA","text":"Now, let us speed ourselves to the next location─Little Ala Mhigo. Hm? Why so soon, you ask? Would you rather that I had you to commit yourself to another several moons of using malefics to put down hedgemoles? I thought not."},{"name":"LEVEVA","text":"Be patient, <span class=\"highlight\">Forename</span>. Allow the stars to make their ascent into midheaven. Once they have, survey the skies and let the power run through you."},{"name":"QUIMPERAIN","text":"Lord Jannequinard complains of the sand, but only because he sees it as a nuisance. The sand can be a wonderful thing, if you know of its benefits. For example, it can be used to polish your mail, or cover your body at night to stave off the desert cold... Ah. Am I boring you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>?"},{"name":"LEVEVA","text":"Raise your eyes to the stars, and witness the violet glow of the Spire!"},{"name":"LEVEVA","text":"In the third heaven rises an iron tower of spinning gears and taut springs constructed by the Builder Himself. It is assailed without cease by the jealous Rhalgr, but the Destroyer's mighty levinbolts only serve to power the spire's clockwork soul."},{"name":"LEVEVA","text":"It is through the blessings of both creation and destruction that strength is granted to <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who sees <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> stars rise under this sign."},{"name":"LEVEVA","text":"You have now opened the gate, and its power is yours to command."},{"name":"LEVEVA","text":"Using the arcana to draw upon the powers of the stars they represent. This path we walk as astrologians is called the royal road. It can be treacherous and fraught with peril, but it can lead men...and women to greatness."},{"name":"JANNEQUINARD","text":"One gate in my first seventeen years...and now look at me. Perhaps my previous methods of training were not the most efficient."},{"name":"LEVEVA","text":"Your realm is...quite the paradox. On one hand, it is full of life, magic, and wonder─one of the richest lands on all Hydaelyn. On the other, it is literally brimming over with strife."},{"name":"LEVEVA","text":"Take Little Ala Mhigo─the wretched souls displaced from their homes by the flames of war. Or Ishgard─mired in its own pointless conflict with an enemy so old it does not even remember why it fights."},{"name":"LEVEVA","text":"The foolish believe that it is their fate to suffer, and so they turn their gaze away from the stars, when those selfsame stars have the power to show people there are many paths."},{"name":"LEVEVA","text":"But that power can only be channeled by the few. Those like me and you...and to a lesser extent Jannequinard. And it is our duty to use that power to benefit those who remain lost or misguided. Remember that, and maybe one day you will truly become my grandfather's successor."},{"name":"JANNEQUINARD","text":"That is exactly what I have been trying to tell the astrologians of my home nation. Why disregard something that has the power to grant succor to the wounded, the power to uplift the downtrodden, to strengthen the weak?"},{"name":"LEVEVA","text":"The answer to that is easy. Empowering those without power lessens the power of those who already have it. Heal the weak so they might rise up and topple those who made them weak? Why would anyone in a position of power do that? Even our great nation of learning is corrupted by this manner of thought. We hoard our knowledge so that we might remain the brightest."},{"name":"LEVEVA","text":"Why do you think that it took so long for Professor Mace to visit you, Jannequinard? Yes, I know what he <span class=\"emphasis\">told</span> you, but that was not the whole of it. Those of the Ruling Quarter did their damndest to stand in the way of my grandfather, worried that his passion for his field would kindle widespread interest in Sharlayan astrology. They only allowed him his recent trip, knowing he was now too old to do aught of the sort. Fortunately, the Ruling Quarter did not realize I would be accompanying my grandfather."},{"name":"LEVEVA","text":"<span class=\"highlight\">Forename</span>, these past turns of the sun have been most fruitful. Yet while you have opened half the heavens' gates, there is still much of what we like to refer to as the “royal road” ahead of you. Take what you have learned here in the southern deserts and transform that knowledge into strength. If you wish to know more of the royal road, I suggest that you discuss it with Jannequinard back in Ishgard. If my grandfather is to be believed, his time transcribing tomes back at the Studium scriptorium should have left him more than capable of handling that task."},{"name":"JANNEQUINARD","text":"You wish to know more of the royal road? I...uh...well..."},{"name":"JANNEQUINARD","text":"I...ah, seem to recall it had something to do with reassessing the attribution of an arcanum before reading it, which would result in a slight alteration of predestination... Or perhaps it had something to do with the kings and queens on the minor arcana. It <span class=\"emphasis\">was</span> over a decade ago..."}],"reward":{"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":99}],"quests":[67549]},"next":[67551]},"partials":[{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1014935","obj":{"i":1014935,"n":"Leveva","l":44,"q":1}},{"type":"npc","id":"1014936","obj":{"i":1014936,"n":"Quimperain","l":44,"q":1}},{"type":"npc","id":"1014937","obj":{"i":1014937,"n":"Jannequinard","l":44,"q":1}},{"type":"npc","id":"1014941","obj":{"i":1014941,"n":"Leveva","l":45,"q":1}},{"type":"npc","id":"1014942","obj":{"i":1014942,"n":"Quimperain","l":45,"q":1}},{"type":"npc","id":"1014943","obj":{"i":1014943,"n":"Jannequinard","l":45,"q":1}},{"type":"quest","id":"67549","obj":{"i":67549,"n":"Fortune Favors the Bole","g":159,"l":"South Shroud","s":301,"f":1}},{"type":"quest","id":"67551","obj":{"i":67551,"n":"A Lesson in Patience","g":159,"l":"Ishgard","s":400,"f":1}}]}