{"quest":{"name":"Sharlayan Ascending","location":"Coerthas Central Highlands","id":67556,"patch":3.0,"sort":502,"icon":100443,"unlocksFunction":1,"eventIcon":71341,"issuer":1015127,"target":1012222,"involved":[1006376,1006377,1015128,1015129,1015130,1015131],"genre":159,"journal":["So eager is Jannequinard to talk with you, it is almost as if there were a giant exclamation point hovering above his head.","Jannequinard has asked you to remain at the Observatorium to ask Forlemort questions you probably should have asked him when you confronted the chief astrologian about his involvement in the attempted kidnapping of Lady Leveva.","From the chief astrologian and his personal assistant you learn that a band of tattooed Sharlayans are the true masterminds behind the conspiracy to kidnap Leveva. Take this information back to Jannequinard at the Athenaeum.","Jannequinard believes that Lady Leveva will find the information you gleaned from the chief astrologian of much worth. Find the lady and Quimperain near the Arc of the Venerable and relay to them what you know.","Lady Leveva has gone missing once again. Quimperain will search in one direction, you are to search in the other.","The woman you believed to be Lady Leveva was not her at all, despite seeming somehow familiar... Keep searching!","You find Lady Leveva and learn of how she foiled another kidnapping attempt. After telling her of your findings, she lets down her guard a moment to talk about her father, who was also an astrologian, and how he died while trying to spread Sharlayan astrology in Ishgard. Jannequinard and Quimperain soon arrive bearing news of the Vault's acceptance of his petition to hold a symposium on astrology. Return to the Athenaeum to begin preparations.","Also moved by the day's events, Jannequinard, too, opens up to you─his noble guilt suddenly becoming too much to bear on his own.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 52."],"objectives":["Gather information at the Observatorium.","Speak with Jannequinard at the Athenaeum.","Speak with Quimperain near the Arc of the Venerable.","Find Leveva.","Speak with Jannequinard."],"dialogue":[{"name":"JANNEQUINARD","text":"Now that Forlemort has so graciously agreed to discontinue his meddling in our affairs, I believe we may find our peers and colleagues more receptive to our proposals."},{"name":"JANNEQUINARD","text":"Perhaps I shall begin with another trip to the Vault to inquire about them reconsidering my petition to grant Lady Leveva the opportunity to speak with the conclave."},{"name":"LEVEVA","text":"We all have our strengths, Jannequinard. And none will deny yours is convincing seemingly sane people to do your bidding. <span class=\"highlight\">Forename</span> here is a testament to that. I look forward to hearing of your progress."},{"name":"LEVEVA","text":"As for myself, there are still some questions I need answered. The first being, how exactly did Forlemort come into contact with the Sharlayan assassins?"},{"name":"LEVEVA","text":"Quimperain. Attend me. I wish to visit Foundation and learn if there have been any sightings of suspicious foreigners."},{"name":"JANNEQUINARD","text":"Might I suggest that <span class=\"highlight\">Forename</span> do the same here at the Observatorium? Perhaps a second call on our new ally will help mine uncle recall aught he may have pretermitted in the heat of the previous moment."},{"name":"JANNEQUINARD","text":"Let mine uncle know that there are no hard feelings. He is not the first relative who has plotted my timely demise. Such is the life of an heir to a High House. Why do you think I hired Quimperain in the first place?"},{"name":"FORLEMORT","text":"Seven hells! I rue the day I ever see another Sharlayan. Please. I've done all you asked. What more do you want from me, blood!? Or are you simply here to boast?"},{"name":"FORLEMORT","text":"...Or mayhap you wish to know how the Sharlayans came to be involved in my scheme? Hah! I thought as much. If it was so important, why didn't your Lady Leveva ask me earlier? Her head is so far in the stars, she fails to see what unfolds around her on the ground."},{"name":"FORLEMORT","text":"The truth is, it was never my scheme in the first place─it was the Sharlayans'. They came to me not long after Professor Mace's ship was diverted to Thanalan. Yes, I said diverted. The pirates in the Strait of Merlthor, the magically manipulated storms off the Rhotano? All were staged to prevent your friends from ever arriving. But when they did, the Sharlayans were forced to change their plans. They required help hiring local hands discreetly─something they could not do as foreigners. I agreed to lend them my aid because I felt we both stood to benefit from the disappearance of Jannequinard and that foul chit."},{"name":"FORLEMORT","text":"I was a fool not to realize that the moment the Sharlayans were discovered, they would be quick to betray my name. That missive was to be destroyed at the first sign of trouble..."},{"name":"EDMELLE","text":"The chief astrologian? There is rarely a day when he isn't meeting with visitors from across the realm and beyond. Why, this past moon, he has been entertaining guests with very distinct markings on their faces. I asked Lord Forlemort whence they hailed, and he only answered, “the north.”"},{"name":"EDMELLE","text":"Is the chief astrologian ill? I saw him but moments ago, and he appeared as white as a ghost in a snowstorm."},{"name":"JANNEQUINARD","text":"The Sharlayans came to him? That can only mean, then, that mine uncle was only a pawn in a much larger game..."},{"name":"JANNEQUINARD","text":"A game that began long before we ever became involved. Think back, <span class=\"highlight\">Forename</span>. The bandits in the Black Shroud. And those pirates you described that attacked you in Limsa Lominsa. They all had strange facial markings...as did our false astrologian."},{"name":"JANNEQUINARD","text":"It is not much, but perhaps Lady Leveva will be able to make more sense out of it all. Despite the time we have spent together, I have this feeling she has yet to be completely honest with us. Ah, but look at me. A beloved relative tries to have me killed, and the next day I begin doubting everyone. What a sad, sad state of affairs..."},{"name":"JANNEQUINARD","text":"Perhaps to clear my head I should call on that fine young viscountess visiting House Haillenarte from her family's stead in the eastern highlands. This information on Forlemort's associates should be relayed to Lady Leveva immediately... Would you be so kind? I seem to recall them saying they'd be questioning highborn in the Pillars."},{"name":"JANNEQUINARD","text":"Ever since the affair with the false Temple Knights, Quimperain has been acting more...I don't know...boldly? It is as if he has to will himself to even address me as “milord.” Do you think the Lady Leveva is becoming a bad influence on the lad?"},{"name":"QUIMPERAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Milady</span><span class=\"alternative\">Milord</span></span>. Were you able to learn anything of import at the Observatorium?"},{"name":"QUIMPERAIN","text":"Lord Forlemort was not the one to hire the Sharlayans!? Lady Leveva will want to know─ Lady Leveva? Lady Leveva! She was right here!"},{"name":"QUIMPERAIN","text":"We must find her. I would not think any harm could come to her here in the center of the Holy See...but then again, that is what we believed back at Camp Dragonhead."},{"name":"QUIMPERAIN","text":"I shall search the Hoplon. Might I ask you search in the opposite direction near the Last Vigil?"},{"name":"CELIE","text":"I am sorry. I think you have mistaken me for someone else."},{"name":"LEVEVA","text":"<span class=\"highlight\">Forename</span>! When you were speaking with Quimperain, someone approached me from behind and placed a dagger to my back. I had no choice but to be led silently away. Luckily, my assailant let down his guard when we arrived in the shadows, and I was able to deliver him a swift kick to the groin. I've been running ever since."},{"name":"LEVEVA","text":"So Forlemort wasn't the architect of this scheme to drag me back to Sharlayan after all. I had my suspicions... I was a fool to believe <span class=\"emphasis\">they</span> would simply let me leave."},{"name":"LEVEVA","text":"Do you recall when I mentioned there were people in the Old World intent on hoarding our nation's knowledge?"},{"name":"LEVEVA","text":"Well, it appears that my efforts to train you and Jannequinard have attracted their ire."},{"name":"LEVEVA","text":"<span class=\"highlight\">Forename</span>... Allow me to apologize. I have not been wholly frank with you about my reason for visiting Eorzea. The truth is...I came here because of my father."},{"name":"LEVEVA","text":"My father dreamed of rekindling the Holy See's interest in Sharlayan astrology, believing that it would be of great benefit to the embattled people of Ishgard. He came here several moons after I was born, intending to remain for only a season. However, he never made the return journey... His dream was left unrealized and his newborn daughter left without a father..."},{"name":"LEVEVA","text":"Never once did I meet him, but every night when I look to the stars, I know that those are the same skies he, too, gazed upon. The same skies he used as his strength and guide. It was only natural that I follow in his footsteps, in spite of the objections from my mother, who did not wish to see her only daughter lost, as well."},{"name":"LEVEVA","text":"And here I am in Eorzea, almost two decades later, pursuing a dream my father never lived to realize. A dream that has become my own. And now, someone is trying to stop me. Well just let them try, I say. Just let them try."},{"name":"JANNEQUINARD","text":"Lady Leveva! A maiden of your beauty should not wander off without an escort. Monsters hide even in the shadows of the Pillars."},{"name":"LEVEVA","text":"Maiden! Flattery will earn you nothing, Jannequinard...but I will accept it nonetheless. Tell me, what did the Vault say to our proposal?"},{"name":"JANNEQUINARD","text":"They accepted it! We have been given official permission by the Holy See to conduct a symposium on the wonders of Sharlayan astrology, with you as our guest speaker! Now come! We must hurry back to the Athenaeum and begin preparations! &lt;sigh&gt; More than fifteen summers to make ready for this moment, and now I only have a matter of days!"},{"name":"LEVEVA","text":"I've never seen Jannequinard that enthusiastic about...well...anything. I suppose we'd best hurry back to the Athenaeum before his passion cools and he finds a warm bed in which to reheat it."},{"name":"QUIMPERAIN","text":"I shall escort the lady back to the Athenaeum, and hold her hand if I must...ah, to ensure that she doesn't wander off again, of course."},{"name":"JANNEQUINARD","text":"<span class=\"highlight\">Forename</span>. This has been a most...beguiling past few moons. I must say, I truly did not expect the turns my fate has taken. I suppose that speaks much to my capacity as a reader of the heavens."},{"name":"JANNEQUINARD","text":"I am not blind to what goes on in Foundation, so I will not claim that my life is in any way difficult. But, that does not mean I do not have my share of troubles, however trivial they may be. Being anything but first in line to a countship is not all “whores and rainbows.” The count only truly cares about his newly appointed heir─just like the rest of my family. They expect great things from him. From me, they expect nothing."},{"name":"JANNEQUINARD","text":"For a long time, I tried to prove that I could be as great as my cousin. It is why I went to Sharlayan. It is why I have tried to do things I had no business even trying. Then, once I realized no one was looking, I simply stopped caring, my actions becoming more and more outlandish...because at the end of the day, that is what everyone expected."},{"name":"JANNEQUINARD","text":"But then you two walked through that door and helped me realize that maybe life is more than the coffin that has been fitted for me. Maybe the fate I believed was mine, was not mine at all. And for helping me see that, <span class=\"highlight\">Forename</span>, I thank you, from the bottom of my heart."},{"name":"SYSTEM","text":"The next astrologian quest will be available from Jannequinard upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":683,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":99}],"quests":[67555]},"next":[67557]},"partials":[{"type":"npc","id":"1015127","obj":{"i":1015127,"n":"Jannequinard","l":63,"q":2}},{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1006376","obj":{"i":1006376,"n":"Edmelle","l":63,"q":2}},{"type":"npc","id":"1006377","obj":{"i":1006377,"n":"Forlemort","l":63,"q":6}},{"type":"npc","id":"1015128","obj":{"i":1015128,"n":"Quimperain","l":2301,"q":1}},{"type":"npc","id":"1015129","obj":{"i":1015129,"n":"Leveva","l":2301,"q":1}},{"type":"npc","id":"1015130","obj":{"i":1015130,"n":"Old World Astrologian","l":2301,"q":1}},{"type":"npc","id":"1015131","obj":{"i":1015131,"n":"Quimperain","l":2301,"q":1}},{"type":"quest","id":"67555","obj":{"i":67555,"n":"Spearheading Initiatives","g":159,"l":"Ishgard","s":501,"f":1}},{"type":"quest","id":"67557","obj":{"i":67557,"n":"Empty Nest","g":159,"l":"Ishgard","s":520,"f":1}}]}