{"quest":{"name":"Ewer Right","location":"Ishgard","id":67553,"patch":3.0,"sort":450,"icon":100442,"unlocksFunction":1,"eventIcon":71341,"issuer":1012222,"target":1012222,"involved":[1006377,1014949,1014950,1014951],"genre":159,"journal":["Jannequinard appears to be motioning to you with his eyes. Why he doesn't simply call out your name is both disturbing and relieving at the same time.","Jannequinard has petitioned the chief astrologian of the Observatorium to write a letter to the Vault recommending that Lady Leveva be granted the opportunity to speak before the conclave. Fearing what Forlemort may do to him were he to appear before the man in person, Jannequinard has asked that you travel south in his stead.","Surprisingly, Forlemort had readied a letter even before your arrival. Unsurprisingly, it was not because he wished to help Jannequinard, but because he wishes to see the astrologian make a complete and utter arse of himself. Still, a recommendation is a recommendation, and Jannequinard will be pleased nonetheless.","The unexpected aid of the chief astrologian set the cogs in Jannequinard's head turning once again. As such, he has once again chosen to miss Leveva's next lesson, and asked that you travel alone to Rathefrost in Mor Dhona─the location of the next gate opening.","You arrive in Rathefrost to find Lady Leveva and Quimperain defending a young astrologian from a band of cutthroats. Thanks to your timely intervention, the day is won by your allies. The astrologian thanks you for your aid and Lady Leveva for the constellation map to replace the one destroyed by the bandits. Once the somehow familiar maid has departed, Leveva reminds you of the reason why you are in Mor Dhona, and indicates the spot where you are to survey the skies so that you may open the fifth gate.","You have attuned with the Ewer. Return to Ishgard and tell Jannequinard of your fourth─or was it fifth?─bandit attack.","Jannequinard does not seem at all surprised upon learning of the attack. In fact, he is more surprised to learn that someone actually took an interest in his field of study...despite the fact he cannot for the life of him remember who this person might actually be.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 50."],"objectives":["Speak with Forlemort at the Observatorium.","Deliver the chief astrologian's letter to Jannequinard.","Seek out Leveva in Rathefrost.","Survey the skies at the location indicated by Leveva.","Speak with Jannequinard in Ishgard.","Slay the bandits."],"dialogue":[{"name":"JANNEQUINARD","text":"Greetings. Your timing, my friend, is impeccable, for it just so happens that at this very moment I have need of your assistance. While our lovely Lady Leveva has been out making herself a target for every cutthroat and cur in the realm, I have been focusing my efforts on our main objective."},{"name":"JANNEQUINARD","text":"Training? Pah! There'll be time enough for training later. No, I speak of our ultimate goal of spreading knowledge of the Sharlayan school of astrology throughout the Holy See! As you know, the Vault recently turned down my request to allow Lady Leveva to speak before them. But I am not one to be turned away so easily. No, I have a plan! I will entreat Chief Astrologian Forlemort to draw up an official recommendation! The Vault will not so quickly dismiss the words of a man of such standing."},{"name":"JANNEQUINARD","text":"Yes, yes. I know mine uncle loathes me with a passion rarely seen even in young lovers, and there is really no reason why he would aid our cause, being a staunch opponent of change and all... But that does not mean we cannot try. And if we fail? Well, then we can try again. And again. And again, until he is so annoyed that he writes us the recommendation simply to see us out of his thinning hair."},{"name":"JANNEQUINARD","text":"And by we, I mean you. Considering how red the chief astrologian became the last time I visited him, I reason it would be detrimental to mine uncle's health should I arrive at his place of research...and we most certainly would not want him to fall ill or collapse before he penned us that recommendation."},{"name":"JANNEQUINARD","text":"The chief astrologian is a furiously busy man, and despises those who would distract him from his work, especially when the cause for distraction is something he finds trivial. It is fortunate for us that our goal is anything but trivial!"},{"name":"FORLEMORT","text":"Who do I see disturbing me this fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> but Jannequinard's new <span class=\"alternative-container\"><span class=\"alternative\">scullery maid</span><span class=\"alternative\">manservant</span></span>? I suppose you came here for this."},{"name":"FORLEMORT","text":"Jannequinard never ceases to amaze, does he? Not only does the lout have the nerve to ask me─ME─for aid, but he then refuses to do me the common courtesy of accepting that aid in person. Ever the entitled little shite, more worried about his popularity amongst the fairer sex than how his actions disgrace his family's name."},{"name":"FORLEMORT","text":"Ah, the slack jaw. I suppose you are wondering why in the world I of all people would agree to such nonsense. Well, it is simple. Allowing the heathen astrologian to dig her own grave in front of the entire Vault and the Ishgardian astrologian community will only serve to accomplish what I wished from the very start."},{"name":"FORLEMORT","text":"Sharlayan astrology has no place in Ishgard. It has no place in Eorzea. It has no place in this world. It is dangerous and it serves no purpose but to take our eyes off what is truly important─using astrology to free us from the dragon menace and ensure man's return to Halone's Kingdom. Leveva's dithering will only make it that much clearer."},{"name":"FORLEMORT","text":"And Jannequinard. Perhaps this will finally spell his downfall. He has only been allowed to continue this nonsense because he is harmless. Too caught up in the luxury of being in line to Count de Durendaire's title to actually put forth any real effort in furthering his, ahem, “cause.” Sharlayan astrology is but an oddity which he can boast about at balls to get him in bed with the slatternly maids of lower houses. His father has protected him thus far, but allowing him and this lady to speak...there will be no brushing under the rug the shame this brings forth. Jannequinard will be finished."},{"name":"FORLEMORT","text":"Tell him what I told you, if you wish. I am not one to conceal my intentions. And truth be told, I sincerely hope that enlightening him on my views will somehow show him the error of his ways, and compel the little shite to abandon this foolishness and crawl back into his cups."},{"name":"JANNEQUINARD","text":"Inform me right away once Chief Astrologian Forlemort has denied my request for a letter of recommendation...so we might begin work on our next request!"},{"name":"JANNEQUINARD","text":"Is this...? It cannot be... It is! The seal is Forlemort's. How did you...? What did he say? No... Wait. Mayhap it is better that I do not know."},{"name":"JANNEQUINARD","text":"Well, this changes everything. I will have to arrange another meeting with the Vault─summon the cardinals to Durendaire Manor. We will need wine...and sparrow-stuffed pheasant...and pheasant-stuffed goose...and goose-stuffed chocobo, and bards, a whole troupe...not to eat, of course."},{"name":"JANNEQUINARD","text":"No, I fear I will no longer be able to join you on Lady Leveva's next opening of the gates. Do give her my regards, though, when you see her in Mor Dhona."},{"name":"JANNEQUINARD","text":"Lady Leveva will surely understand the importance of my remaining here in Ishgard after she hears the good news regarding Forlemort's letter of recommendation. You will be so kind as to inform her upon your arrival in Mor Dhona, will you not?"},{"name":"QUIMPERAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Milady</span><span class=\"alternative\">Milord</span></span>! Bandits!"},{"name":"FEMAIL02017","text":"Please! I cannot go back with them!"},{"name":"LEVEVA","text":"For once, we were not the bandits' targets. We came across this young woman as she was being dragged into the hills. Though we drove her abductors away, I suspect they have already mustered the courage for a second attack. It is a good thing you and Jann─ ...It is a good thing <span class=\"emphasis\">you</span> arrived when you did."},{"name":"FEMAIL02017","text":"Dammy"},{"name":"QUIMPERAIN","text":"The girl claims she is a student at the Athenaeum, and recently overheard Jannequinard mention we would be conducting another gate opening in Mor Dhona. She journeyed here on her own in hopes of having the chance to witness your astromancy firsthand."},{"name":"LEVEVA","text":"I say we give her something to remember."},{"name":"QIB","text":"I will tend to the woman's hurts. You assist Quimperain!"},{"name":"QIB","text":"Send in the hungry!"},{"name":"QIB","text":"They are merely bandits, <span class=\"highlight\">Forename</span>! They cannot see things you can. They are unaware of the tragic fate which is destined to befall them. You must reveal it to them...in blood!"},{"name":"QIB","text":"Didn't see <span class=\"emphasis\">this</span> comin' now, did ye, eh? Rise, slave, and tear the bastards limb from limb!"},{"name":"QIB","text":"Oh, ye'll pay fer that."},{"name":"QIB","text":"The battle is not yet lost. Do not give up hope, <span class=\"highlight\">Forename</span>... Let the stars guide you to victory."},{"name":"QIB","text":"Lady...Leveva..."},{"name":"QIB","text":"Wait! This wasn't part of the─"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"QIB","text":"Dammy"},{"name":"FEMAIL02017","text":"You have my apologies, Lady Leveva. I did not think..."},{"name":"LEVEVA","text":"Your only fault was an insatiable thirst for knowledge. A realm where one must apologize for being a victim is no realm worth living in."},{"name":"FEMAIL02017","text":"But why would those men attack me?"},{"name":"FEMAIL02017","text":"Dammy"},{"name":"LEVEVA","text":"I believe it is now quite obvious that these bandits were not meant for you, but for me. It would seem that certain parties fear the spread of Sharlayan astrology...and will stop at naught to prevent it."},{"name":"FEMAIL02017","text":"My Sharlayan constellation chart... The bandits... It must have been torn when they seized me..."},{"name":"LEVEVA","text":"Here. You may take mine. I have the stars committed to memory."},{"name":"FEMAIL02017","text":"I... I don't know how I'll ever be able to... But I will think of something. Just you wait. I will repay this kindness tenfold!"},{"name":"QUIMPERAIN","text":"Lady Leveva, you mentioned something about certain parties wanting to prevent the spread of Sharlayan astrology. Have you any idea who they might be?"},{"name":"LEVEVA","text":"I do, but I shall require more proof before I can be certain. You and <span class=\"highlight\">Forename</span> should be able to assist me with that. However, as they say, “first things first.” We have a gate to open."},{"name":"QUIMPERAIN","text":"Lady Leveva mentioned before about those in power not wanting those below them to rise up. Could that have something to do with the attacks?"},{"name":"LEVEVA","text":"<span class=\"highlight\">Forename</span>. The fifth heaven awaits. Open your mind and become one with the stars."},{"name":"LEVEVA","text":"There! The Ewer! Focus, <span class=\"highlight\">Forename</span>! Focus, and let the constellation's aether twine with your own."},{"name":"LEVEVA","text":"It is said through the fifth heaven flows a mighty river carrying the water spilled forth from the Scholar's vessel."},{"name":"LEVEVA","text":"And in that water is the strength of all that have come before and all who will follow─thew spun from Nymeia's loom─thew from which might and mettle is weaved."},{"name":"LEVEVA","text":"And now the power of the Ewer is forever yours, and forever shall it point you to victory."},{"name":"LEVEVA","text":"While I cannot forgive our patron for skipping yet another of his lessons, I cannot deny that the passion hidden deep beneath all his posturing may have its uses. Word of our field is spreading, and our inherent nature has begun to stir. Curiosity is proving the better motivator than skepticism and faith. Our time may come soon."},{"name":"JANNEQUINARD","text":"Do not tell me... Lady Leveva was attacked again. I knew it! And without a reading! My talents grow by the day!"},{"name":"JANNEQUINARD","text":"What is this you claim? A fellow astrologian was moved by my words, and went to witness the unlocking? That is amazing! I wonder who it could be, though. I would certainly recall speaking in detail with a young, supple...er, mind. I must find this woman and hold another...ah, <span class=\"emphasis\">special</span> lesson with her."},{"name":"JANNEQUINARD","text":"Lesson? Ah, that reminds me! Lady Leveva asked me to teach you a new technique before you head to open the fifth heaven's gate...which you have already gone and done... Ah, but it appears you were able to overcome your ordeal without it. Yes... Exactly according to <span class=\"emphasis\">my</span> lesson plan!"},{"name":"JANNEQUINARD","text":"You still wish me to teach you the technique? Very well, then. Though, I do not really see the point..."}],"reward":{"action":3615,"xp":24840},"reqs":{"jobs":[{"lvl":45,"id":99}],"quests":[67552]},"next":[67554]},"partials":[{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1006377","obj":{"i":1006377,"n":"Forlemort","l":63,"q":6}},{"type":"npc","id":"1014949","obj":{"i":1014949,"n":"Leveva","l":67,"q":1}},{"type":"npc","id":"1014950","obj":{"i":1014950,"n":"Quimperain","l":67,"q":1}},{"type":"npc","id":"1014951","obj":{"i":1014951,"n":"Ishgardian Astrologian","l":67,"q":1}},{"type":"action","id":"3615","obj":{"i":3615,"n":"Gravity","c":3123,"j":33,"t":2,"l":45}},{"type":"quest","id":"67552","obj":{"i":67552,"n":"Slings and Arrows","g":159,"l":"Ishgard","s":401,"f":1}},{"type":"quest","id":"67554","obj":{"i":67554,"n":"Loved by the Sun","g":159,"l":"Ishgard","s":500,"f":1}}]}