{"quest":{"name":"Conviction","location":"Ishgard","id":67558,"patch":3.0,"sort":540,"icon":100443,"unlocksFunction":1,"eventIcon":71341,"issuer":1012222,"target":1012222,"involved":[1015159,1015163,1015164,1015168,1015169,1015170,1015171,1015172,1015178,1015179],"genre":159,"journal":["Jannequinard appears to have information on your next symposium.","The location of the next symposium has been chosen by the Vault, and it is even smaller and more secluded than the last─the Convictory in the lower basin of the Coerthas western highlands. Travel to the camp and speak with Leveva as to how you shall proceed.","Leveva feels that the board has been set for you to lose, so she decides not to play by the rules, and instead of holding a symposium, she suggests that you use your astromancy to grant succor to wounded Convictors in the form of Aspected Benefic.","The wounded knights you heal make miraculous recoveries. Speak with Leveva and ask her if there is aught else you can do.","Leveva is stabbed by a Sharlayan disguised as a wounded Convictor. However, she is no ordinary Sharlayan. A well-timed piece of exposition reveals her to be the same tattooed Sharlayan who has been attempting to kidnap Leveva since she arrived in the Black Shroud. She claims that she has been hired to bring Leveva back to the Old World, but you successfully drive her off before she can act. Join Jannequinard and cast Aspected Benefic on Leveva before her wound takes her.","Jannequinard reveals to Leveva that he knew her father, and that he was with him when he was killed. He hands over her father's diary, which the Ishgardian astrologian has been carrying around as a keepsake since the day Rufin passed. With renewed faith in her cause, Leveva decides to remain at the Convictory and use her magicks to heal more soldiers.","You speak with Jannequinard one last time. After considering the danger Leveva now finds herself in, Jannequinard agrees to teach you a more potent form of the spell Malefic.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 56."],"objectives":["Speak with Leveva at the Convictory.","Cast Aspected Benefic on the wounded Convictors.","Speak with Leveva.","Cast Aspected Benefic on Leveva.","Speak with Jannequinard."],"dialogue":[{"name":"JANNEQUINARD","text":"The Vault went and outdid themselves. The location for our next symposium? The Convictory─a makeshift camp for a band of bickering knights! I've spoken at length with Lady Leveva about how we might handle this second inconvenience so as not to meet the same fate we did in Falcon's Nest."},{"name":"JANNEQUINARD","text":"I fear the worst, but the lady believes that we may be approaching this all wrong─that we should embrace the situation and use it to our advantage. I believe she is merely unaccustomed to the thin alpine air and her wits are not in order. Perchance we should make for the camp and see for ourselves."},{"name":"JANNEQUINARD","text":"Lady Leveva and Quimperain are already on their way to the western highlands. It would be remiss if we were to keep them waiting any longer. To the Convictory!"},{"name":"BALLOON","text":"Dammy"},{"name":"BALLOON","text":"Dammy"},{"name":"JANNEQUINARD","text":"I arrived not moments ago to find this! What in the Fury's name has happened here!?"},{"name":"LEVEVA","text":"Tread lightly, <span class=\"highlight\">Forename</span>. This is not the work of bandits. Quimperain's hurts were dealt by the <span class=\"emphasis\">Convictors</span>."},{"name":"JANNEQUINARD","text":"You were assaulted by the men sworn to protect us? This is madness!"},{"name":"LEVEVA","text":"The Vault led the knights to believe that a party of astrologians would be arriving to aid them in scrying the location of the Horde's next attack. They took out their frustration on poor Quimperain when they learned I can foretell the whims of a dragon about as well as I can those of Jannequinard."},{"name":"LEVEVA","text":"But no. We must not let this discourage us. If words have no weight with these men, then let our magicks do the speaking."},{"name":"LEVEVA","text":"May the stars heal your wounds!"},{"name":"JANNEQUINARD","text":"Close your eyes. Soon, it will all be over...ah, better. Better."},{"name":"WOUNDEDA02022","text":"Ouch! Me leg! Just cut the damned thing off! I cannae take much more of this!"},{"name":"WOUNDEDA02022","text":"The pain... It's gone! How did you...?"},{"name":"WOUNDEDB02022","text":"Give me a swift death... That's...all...I ask..."},{"name":"WOUNDEDB02022","text":"But you're an astrologian. You can't heal people! That's not what astrologians do!"},{"name":"WOUNDEDC02022","text":"Leave me... I am not much longer for this realm..."},{"name":"WOUNDEDC02022","text":"My wounds...it is as if they were never there! Wait... Who's going to believe that I slew a dragon if I haven't the wounds to show for it!? I don't know whether to thank you, or slit your throat. Though, I suppose I wouldn't be able to do either if you hadn't healed me with those queer magicks, so this day, I see fit to forgive you."},{"name":"LEVEVA","text":"You..."},{"name":"JANNEQUINARD","text":"What is wrong, Leveva? Have you tapped too deeply into your mental reserves? Perhaps you should take a moment of respite."},{"name":"QUIMPERAIN","text":"That blood is not the knight's!"},{"name":"CELIE","text":"(-Sharlayan Assassin-)Ah, the loyal lapdog. Without you to state the obvious, where would your masters be, pray tell?"},{"name":"QUIMPERAIN","text":"You...again!"},{"name":"CELIE","text":"(-Sharlayan Assassin-)One might think these markings would betray my identity, but you Eorzeans have a singular capacity to look without seeing. I am amazed you are not constantly wandering into bonfires or off cliffs."},{"name":"CELIE","text":"(-Celie-)I have grown weary of this masquerade, and I am done with entrusting my fate to this realm's blundering mercenaries. My name is Celie, and I am here to take the Lady Leveva into custody so that she can be transported back to Sharlayan and tried for her crimes. "},{"name":"LEVEVA","text":"Taken into custody? On whose authority?"},{"name":"CELIE","text":"(-Celie-)You are here without permission of the Forum, performing acts which amount to treason. Your grandfather has already been detained and questioned."},{"name":"CELIE","text":"(-Celie-)I am giving you the opportunity to turn yourself in, and put an end to this farce, once and for all. Do as I say, and no one will be harmed. Yourself included, Lady Leveva."},{"name":"JANNEQUINARD","text":"But Lady Leveva... I thought you and your grandfather were dispatched on an official expedition..."},{"name":"CELIE","text":"(-Celie-)It seems that Leveva has not told you everything. Did you know that it was her father who was killed nearly fifteen summers past? <span class=\"emphasis\">Fifteen summers past</span>, Jannequinard. Your adventurer friend seems already to have put two and two together. Why <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> didn't tell you earlier, I cannot fathom. What else are they leaving you out of, Jannequinard de Durendaire?"},{"name":"JANNEQUINARD","text":"I... But... Silence!"},{"name":"CELIE","text":"(-Celie-)This is my final warning. When you see me again, you will either give yourself up, or you will die at my blade. Think on that, Leveva."},{"name":"JANNEQUINARD","text":"<span class=\"highlight\">Forename</span>! Lady Leveva's wound is deep. I do not believe I can heal it on my own. Lend me your aid!"},{"name":"JANNEQUINARD","text":"I lack the capacity to heal Lady Leveva on my own. We must combine our Benefic magicks!"},{"name":"JANNEQUINARD","text":"I have not the skill to heal Lady Leveva on my own. You must cast your magicks on her as well!"},{"name":"LEVEVA","text":"Thank you, my friends... For someone who claims she was hired to bring me back to Sharlayan, her aim was quite true..."},{"name":"JANNEQUINARD","text":"Lady Leveva... This Celie claimed that you are not here with the blessing of the Forum... Is this so? Why did you not see fit to mention this?"},{"name":"LEVEVA","text":"My grandfather knew the Forum would never allow us to come to Ishgard, and that their “contemplation” over the matter was merely a tactic to stall and discourage us. The stars had spoken to my grandfather, and he was not about to turn a deaf ear to them. I kept silent because I did not wish to let the petty politicking of men thousands of malms to the north stand in the way of our dream─our dream to spread the word of Sharlayan astrology."},{"name":"LEVEVA","text":"And such was my father's dream...until he was killed for it by closed-minded peasants."},{"name":"JANNEQUINARD","text":"But Rufin never once spoke ill of those he wished to enlighten. Even at his end..."},{"name":"LEVEVA","text":"How do you know my father's name!?"},{"name":"JANNEQUINARD","text":"Your father and I became close friends when I was in Sharlayan. When the exodus forced me to return home, he asked if he could accompany me, saying that he wished to try and convince those who once believed in the stars' power to look to the skies again. And we did for several moons. My countrymen were deeply skeptical, and slow to warm to the idea of heathen magicks─some were even rude─but he never gave up on them. Right up until he was..."},{"name":"JANNEQUINARD","text":"I was there during your father's last moments. I heard a commotion come from his room late one night and went in to check...only to find him bleeding and slumped over his diary, which he was writing when he was attacked. With his last strength, he handed me the diary and asked that I do not blame my people, and that I continue our work. I believe this belongs with you now."},{"name":"LEVEVA","text":"I do not know if I can forgive those who killed my father..."},{"name":"JANNEQUINARD","text":"I do not expect you to forgive us yet but...but knowing that <span class=\"emphasis\">he</span> did...even at the moment of his death...perhaps will help you one day understand. You have always reminded me of Rufin, even before I knew he was your father. Your passion for your discipline equals his own, or may even exceed it."},{"name":"LEVEVA","text":"Father... Did you know what fate awaited you in this realm? Did you see all this? Did the stars have you merely pave the way...for me?"},{"name":"QUIMPERAIN","text":"If they did, then I shall not allow anyone to stand in your way."},{"name":"JANNEQUINARD","text":"You are right, good man. And so I shall allow this breach of etiquette, but if you fail to address Lady Leveva properly again, I'll have you spit shining the privy back at Durendaire Manor."},{"name":"LEVEVA","text":"Oh, leave him be, Jannequinard. Without Quimperain, here, I'd have been tied up and shipped back to the Old World moons ago. The stars have him here with me. He is not going anywhere. And neither am I. I am done with symposiums. That is not what my father wanted. He came here not to speak of astrology, he came here to use it. And so that is what I shall do. There are still many Convictors who can benefit from these magicks."},{"name":"JANNEQUINARD","text":"And what a better way to convince people of your greatness than by ensuring they remain alive long enough to sing your praises!"},{"name":"LEVEVA","text":"Janne... Will you...tell me of my father?"},{"name":"JANNEQUINARD","text":"I would be delighted, my lady...unless, that is, you mean <span class=\"emphasis\">now</span>, as I have a prior engagement with a pair of lovely baronesses from House Dzemael, and I would not wish to keep them waiting."},{"name":"LEVEVA","text":"A prior arrangement... Of course he has! I suppose my father's journal will have to suffice until then."},{"name":"JANNEQUINARD","text":"To think that my old friend Rufin may have seen what grim fate awaited him in Ishgard...but chose to come anyway, knowing that it would inspire both me and his daughter... Gods, sometimes these celestial machinations are simply too grand in scope to grasp! However, if it is as we believe, then we must, as Quimperain so bluntly stated, make sure that naught disrupt us on our path to that fate."},{"name":"JANNEQUINARD","text":"Perhaps it is time I revealed to you a more powerful form of Malefic, so that you might be better prepared for the trials that are to follow. Ah, that furrow upon your brow suggests you could have used this spell earlier in your training. In retrospect, I would be inclined to agree. Hah hah!"}],"reward":{"gil":993,"action":3598,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":99}],"quests":[67557]},"next":[67559]},"partials":[{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1015159","obj":{"i":1015159,"n":"Jannequinard","l":2200,"q":1}},{"type":"npc","id":"1015163","obj":{"i":1015163,"n":"Leveva","l":2200,"q":1}},{"type":"npc","id":"1015164","obj":{"i":1015164,"n":"Jannequinard","l":2200,"q":1}},{"type":"npc","id":"1015168","obj":{"i":1015168,"n":"Leveva","l":2200,"q":1}},{"type":"npc","id":"1015169","obj":{"i":1015169,"n":"Wounded Convictor","l":2200,"q":1}},{"type":"npc","id":"1015170","obj":{"i":1015170,"n":"Wounded Convictor","l":2200,"q":1}},{"type":"npc","id":"1015171","obj":{"i":1015171,"n":"Wounded Convictor","l":2200,"q":1}},{"type":"npc","id":"1015172","obj":{"i":1015172,"n":"Jannequinard","l":2200,"q":1}},{"type":"npc","id":"1015178","obj":{"i":1015178,"n":"Leveva","l":2200,"q":1}},{"type":"npc","id":"1015179","obj":{"i":1015179,"n":"Leveva","l":2200,"q":1}},{"type":"action","id":"3598","obj":{"i":3598,"n":"Malefic II","c":3122,"j":33,"t":2,"l":54}},{"type":"quest","id":"67557","obj":{"i":67557,"n":"Empty Nest","g":159,"l":"Ishgard","s":520,"f":1}},{"type":"quest","id":"67559","obj":{"i":67559,"n":"Feather in the Cap","g":159,"l":"Ishgard","s":560,"f":1}}]}