{"quest":{"name":"An Exemplary Example","location":"Ul'dah","id":67568,"patch":3.0,"sort":500,"icon":100433,"unlocksFunction":1,"eventIcon":71341,"issuer":1006747,"target":1003995,"involved":[1014046,1014121],"genre":147,"journal":["Jenlyns would look to a renowned free paladin for aid.","In these troubled times, the Sultansworn must ever be ready to serve as the sword and shield of the sultanate. Fortunately, it would seem that your shining example has inspired many young men and women to join their ranks. Several such recruits are currently training at Camp Bluefog, and Jenlyns believes they would benefit from your words of encouragement.","At Camp Bluefog, you meet with Owyne, <span class=\"alternative-container\"><span class=\"alternative\">one of the Sultansworn charged with overseeing the recruits' training</span><span class=\"alternative\">the Sultansworn you helped to recover the royal crown, who also happens to have been charged with overseeing the recruits' training</span></span>. He states that they are currently participating in drills at the east watchtower and invites you to follow him there.","Recognizing that you are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of few words, Owyne asks that you favor the recruits with a display of swordsmanship. Basilisk bait has already been laid out, so you need only wait for the beasts to come to you.","You dispatch the lone basilisk that was foolish enough to try its luck against you. See if Owyne is satisfied.","Owyne thanks you for the rousing performance and bids you convey his gratitude to Captain Jenlyns. Return to Ul'dah and inform the captain that you have finished.","Though Jenlyns wishes he could repay you, he admits that there is nothing left he can teach you. He bids you go forth and continue to defend the people of Eorzea, and so you do─only to be stopped momentarily by Papashan, former brother of the Sultansworn. Though he has an urgent matter to discuss, he seems loath to do so within earshot of Jenlyns. Journey to the Ul'dah Dispatch Yard and speak with the stationmaster there.","Solkzagyl, Jenlyns's predecessor, has kept in contact with Papashan for many years, sharing with the stationmaster his discoveries in his quest to reclaim Oathkeeper, the legendary blade stolen from the Sultansworn by the minions of the Monetarists long ago. The former captain's most recent missive contained a startling claim: he has finally found the sword, it would seem. However, Papashan has not heard from him since, and is growing increasingly concerned. The stationmaster does not wish to involve Jenlyns until he has learned more of the situation, and so he begs your assistance, which you readily offer. Once Papashan determines the precise location from which Solkzagyl's last missive was sent, you can begin your search in earnest.<br><br>※The next paladin quest will be available from Papashan upon reaching level 52."],"objectives":["Speak with Owyne at Camp Bluefog.","Speak with Owyne at the east watchtower.","Slay a fog basilisk.","Speak with Owyne.","Speak with Jenlyns in Ul'dah.","Speak with Papashan at the Ul'dah Dispatch Yard."],"dialogue":[{"name":"JENLYNS","text":"We live in troubling times, <span class=\"highlight\">Forename</span>, as you well know."},{"name":"JENLYNS","text":"That is why it is more important than ever that the Sultansworn stand ready to serve as the sword and shield of the sultanate."},{"name":"JENLYNS","text":"For a time, I feared that our order was doomed, but then you helped us to restore our good name."},{"name":"JENLYNS","text":"Your shining example inspired many young men and women to seek us out. Even as we speak, they train to hone their skills."},{"name":"JENLYNS","text":"A few words of encouragement from the famed free paladin <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> would do much to motivate them further, I should think. Perhaps you would consider paying them a visit at Camp Bluefog?"},{"name":"JENLYNS","text":"Our younger paladins would surely benefit from a few words of encouragement from you. Forgive me the imposition, but would you call on them at Camp Bluefog?"},{"name":"OWYNE","text":"A pleasure to meet you, <span class=\"highlight\">Forename</span>. My name is Owyne."},{"name":"OWYNE","text":"Well met, <span class=\"highlight\">Forename</span>! It's been ages since last we spoke! Certainly not since you helped us to recover the crown."},{"name":"OWYNE","text":"At the moment, Phillice and I are conducting drills with the new recruits at the east watchtower."},{"name":"OWYNE","text":"They'll be thrilled to see you, I'm sure!"},{"name":"OWYNE","text":"Since we all know you're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of few words, I thought we might forgo the speech and instead ask you to favor us with a display of swordsmanship. We've laid out bait for the basilisks already, in fact. You need only wait for them to come."},{"name":"OWYNE","text":"Truly a rousing performance, <span class=\"highlight\">Forename</span>! Thank you!"},{"name":"OWYNE","text":"It's one thing to talk about proper technique, but an altogether different thing to see it firsthand."},{"name":"OWYNE","text":"I think it safe to say that the recruits will long remember this day─as will I!"},{"name":"OWYNE","text":"Thank you again for the demonstration, <span class=\"highlight\">Forename</span>. Pray convey my gratitude to Captain Jenlyns as well."},{"name":"JENLYNS","text":"Well come, <span class=\"highlight\">Forename</span>. I gather the recruits took your lesson to heart."},{"name":"JENLYNS","text":"Would that I had some way to repay you─some knowledge or technique to bequeath to you. I am humbled to admit that there is nothing I can teach you."},{"name":"JENLYNS","text":"All I can offer you is my heartfelt thanks. Pray go forth, my friend, and continue to defend the people of Ul'dah and Eorzea at large."},{"name":"PAPASHAN","text":"(-???-)Begging your pardons, <span class=\"highlight\">Forename</span>."},{"name":"PAPASHAN","text":"(-???-)Begging your pardons, <span class=\"highlight\">Forename</span>."},{"name":"PAPASHAN","text":"We need to talk, but not here. At the Dispatch Yard, outside the city."},{"name":"JENLYNS","text":"Was that Master Papashan just now? Well, if he would have words, then do not let me keep you."},{"name":"PAPASHAN","text":"Thank you for coming, <span class=\"highlight\">Forename</span>. You must be wondering why I called you here..."},{"name":"PAPASHAN","text":"It concerns Solkzagyl, Jenlyns's predecessor."},{"name":"PAPASHAN","text":"As you may recall, he continues to search for Oathkeeper, the sword stolen from us by the Monetarists' minions. From time to time, he sends me missives, sharing with me his latest discoveries."},{"name":"PAPASHAN","text":"His most recent one contained a startling claim. He wrote that he had found the sword, at long last..."},{"name":"PAPASHAN","text":"But that was some time ago, and he has not contacted me since."},{"name":"PAPASHAN","text":"I would not trouble Jenlyns with this news─not until I learn what has become of Solkzagyl, at the very least. Will you help me find him?"},{"name":"PAPASHAN","text":"I knew I could count on you, <span class=\"highlight\">Forename</span>."},{"name":"PAPASHAN","text":"For now, all I know is that his last missive came to me by way of Ishgard. Once I learn more, we can begin the search in earnest."},{"name":"SYSTEM","text":"The next paladin quest will be available from Papashan upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":994,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":20}],"questsType":"all","quests":[66596,65964]},"next":[67569]},"partials":[{"type":"npc","id":"1006747","obj":{"i":1006747,"n":"Jenlyns","l":41,"q":9}},{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"npc","id":"1014046","obj":{"i":1014046,"n":"Owyne","l":46,"q":1}},{"type":"npc","id":"1014121","obj":{"i":1014121,"n":"Owyne","l":46,"q":1}},{"type":"quest","id":"66596","obj":{"i":66596,"n":"Keeping the Oath","g":147,"l":"Ul'dah","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67569","obj":{"i":67569,"n":"The Paladin Who Cried Wolf","g":147,"l":"Central Thanalan","s":520,"f":1}}]}