{"quest":{"name":"Appetite for Destruction","location":"Mor Dhona","id":67567,"patch":3.0,"sort":600,"icon":100435,"unlocksFunction":1,"eventIcon":71341,"issuer":1013971,"target":1014112,"involved":[1014011,1014012,1014015,1014113],"genre":148,"journal":["Time is running out to rescue D'zentsa, and Widargelt is uncharacteristically unsettled.","Though you have not found a way to open your final chakra, you must confront H'raha Tia now, or D'zentsa's life will be forfeit. Widargelt bids you join him and O'tchakha near Little Ala Mhigo in southern Thanalan ahead of the rescue mission.","Desperate to save her friend, O'tchakha bids you fight her, that you might open your final chakra. However, Widargelt will not hear of it. He harbors the hope that, in joining hands, you may yet defeat H'raha Tia. Prepare yourself for the confrontation, and tell Widargelt when you are ready to proceed to the southern ruins, where D'zentsa has been taken.","At the ruins, Widargelt attempts to convince H'raha Tia that fighting one another is not the way. Alas, the master of the sect of shadow will not be swayed from his beliefs, and he sets upon you with fists and feet flying. In the midst of battle, your final chakra opens, allowing you to do battle with H'raha Tia on even footing. And with D'zentsa's belated help, you succeed in overcoming him and his pupils. As the dust settles, speak with Widargelt south of Little Ala Mhigo to know his mind on the battle's outcome.","The pursuit of power was once thought to be the sole route to greatness among the disciples of the Fist of Rhalgr. But by your shining example, this old preconception has been shattered, giving way to alternate paths. Together with D'zentsa and O'tchakha, Widargelt will strive to rebuild the order as it once was, reuniting the sects of light and shadow. As the paragon for a new generation of monks, see to it that you ever exercise your powers for the good of the realm.<br><br>※The next monk quest will be available from Erik once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with O'tchakha near Little Ala Mhigo.","Speak with Widargelt.","Hold off H'raha Tia until D'zentsa is free!","Defeat H'raha Tia!"],"dialogue":[{"name":"WIDARGELT","text":"Time is running out. D'zentsa's life will soon be forfeit. We must act now."},{"name":"WIDARGELT","text":"Alas, we did not find it. A way to open the seventh chakra. But we must act nonetheless."},{"name":"WIDARGELT","text":"O'tchakha has gone to Little Ala Mhigo. She fears for her friend. Let us join her."},{"name":"WIDARGELT","text":"We must rescue D'zentsa. But how...?"},{"name":"OTCHAKHA","text":"Zentsa is still alive, but I fear she'll not remain so much longer. But moments ago, she was taken to the ruins to the south."},{"name":"OTCHAKHA","text":"You will have already heard, but I couldn't find a bloodless way to open chakra of an opposing aspect."},{"name":"OTCHAKHA","text":"Thus far, you have opened thirteen chakra─the most of us three. But one more, and you could face H'raha Tia as an equal..."},{"name":"OTCHAKHA","text":"Fight me, <span class=\"highlight\">Forename</span>, and make the final chakra yours!"},{"name":"Q1","text":"How will you respond?"},{"name":"A1","text":"Very well. Let's get this over with."},{"name":"A1","text":"No, this isn't the way."},{"name":"WIDARGELT","text":"No, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! If O'tchakha dies, victory would have no meaning!"},{"name":"WIDARGELT","text":"We need power. This is true. But at what cost? You must remember what is truly important. Or you will commit a grave mistake. As I once did."},{"name":"WIDARGELT","text":"Listen to <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> speaks the truth. It is not the way."},{"name":"WIDARGELT","text":"We need power. This is true. But at what cost? If you die, D'zentsa would grieve. Victory would have no meaning."},{"name":"WIDARGELT","text":"Remember my words. All our chakra may not be open. But we have each other. Together, we can defeat H'raha Tia. We can rescue D'zentsa."},{"name":"WIDARGELT","text":"The disciples of our sects once fought side by side. Let us do so again. As we did in the days of old."},{"name":"OTCHAKHA","text":"Thank you, Widargelt. I shall stand with you."},{"name":"WIDARGELT","text":"First, I will try to persuade H'raha Tia. Convince him to see reason. But if my words fail, be ready to fight."},{"name":"OTCHAKHA","text":"Zentsa was taken to the ruins to the south. We must hurry before it's too late!"},{"name":"WIDARGELT","text":"We go to confront H'raha Tia. Are you ready, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>?"},{"name":"WIDARGELT","text":"Hear me, H'raha Tia! We come, but not to accept your demands!"},{"name":"WIDARGELT","text":"Nay, we would remind you of the past! Of the true nature of our order!"},{"name":"WIDARGELT","text":"Our two sects once fought beside each other. Not against. Together, we can achieve much. Let us join hands, brother. And rebuild the Fist of Rhalgr!"},{"name":"HRAHATIA","text":"Hmph, cowards like you bring shame upon our order. Plainly, it is <span class=\"emphasis\">you</span> who needs to be reminded of our true nature."},{"name":"HRAHATIA","text":"The arduous training to hone mind and body, the blood we spill and shed─all of it is for no other purpose but to honor the Destroyer."},{"name":"HRAHATIA","text":"We pay Him great tribute by dueling to the death. And in return, He grants us great power: the power of all fourteen chakra."},{"name":"HRAHATIA","text":"By consorting with the royal house, the disciples of light lost sight of their true nature. For this, Rhalgr visited destruction upon them."},{"name":"HRAHATIA","text":"But in His wisdom, you were spared, that your existence─feeble though it is─might serve to raise us higher. Upon your battered bodies, the Fist of Rhalgr shall be restored to its former glory!"},{"name":"WIDARGELT","text":"You are wrong. The sect of light was undone, but not as you say. We misused our power. We turned it upon our own people. For <span class=\"emphasis\">this</span>, we were cast down."},{"name":"WIDARGELT","text":"Now <span class=\"emphasis\">you</span> misuse your power. You turn it upon your own comrades. It is the same. It will end the same. You will destroy yourselves as we did."},{"name":"WIDARGELT","text":"Do not make the same mistake, brother. If we are to survive, we must find another way. A way to prosper together. Or we shall perish in vain. All of us."},{"name":"WIDARGELT","text":"Those who have power must choose. <span class=\"emphasis\">You</span> must choose. With it, will you pave the way for life? Or will you destroy it? Surely, the choice is clear."},{"name":"HRAHATIA","text":"I grow weary of your blathering. You have already declared your unwillingness to meet my demands. There is naught more to discuss."},{"name":"HRAHATIA","text":"Take the adventurer alive─<span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will yet prove useful to us. Kill the rest!"},{"name":"OTCHAKHA","text":"Zentsa! Are you all right!?"},{"name":"DZENTSA","text":"You came... Thank you..."},{"name":"HRAHATIA","text":"So you have turned against me, the both of you. Have you forgotten who it was that saved you all those years ago?"},{"name":"HRAHATIA","text":"But I pride myself on being a forgiving man. In lieu of an apology, I shall accept your life force."},{"name":"HRAHATIA","text":"Ahahaha! Your power is mine! Be glad, my wayward pupils, that you were useful to me at the end!"},{"name":"HRAHATIA","text":"Magnificent! My body is as a raging furnace! It shall be as child's play to unleash my ultimate technique!"},{"name":"HRAHATIA","text":"It ends here!"},{"name":"HRAHATIA","text":"What!?"},{"name":"WIDARGELT","text":"Can it be? Your final chakra has opened?"},{"name":"DZENTSA","text":"That's the only explanation! Which means that <span class=\"highlight\">Forename</span>'s now an equal with H'raha Tia!"},{"name":"OTCHAKHA","text":"If we fight together, we may yet triumph!"},{"name":"HRAHATIA","text":"Triumph, you say? I do not recall having raised such a foolish child."},{"name":"HRAHATIA","text":"<span class=\"highlight\">Forename</span> is as a suckling babe with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> new chakra, while my entire being is fairly ablaze with the life energy of three monks!"},{"name":"HRAHATIA","text":"It matters not how many of you there are! You cannot hope to defeat me!"},{"name":"DZENTSA","text":"Tchakha has told me everything. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"OTCHAKHA","text":"To be reunited with Zentsa... Words cannot well express my relief."},{"name":"WIDARGELT","text":"It is over. Zentsa is safe. Together, we achieved the impossible."},{"name":"WIDARGELT","text":"Yet my heart is heavy. I failed to convince H'raha Tia."},{"name":"WIDARGELT","text":"Every step I take, blood is spilled. With my power, I know only destruction."},{"name":"DZENTSA","text":"That's not true, Widargelt. A monk's power can also be used to save, like you saved us."},{"name":"OTCHAKHA","text":"We have a favor to ask of you. If you are still intent on rebuilding the Fist of Rhalgr, we would lend you our aid."},{"name":"DZENTSA","text":"We'd bring whoever's left of our sect. Together, we can restore the order to the way it used to be, with disciples of light and shadow side by side."},{"name":"DZENTSA","text":"And together, we can think about what power means to us. Thinking about it alone, your mind's liable to take you to a dark place. Better to have comrades around who share your cause, I reckon."},{"name":"OTCHAKHA","text":"With H'raha Tia gone, <span class=\"highlight\">Forename</span> is the only soul left who has opened all fourteen chakra. And a soul of gentleness <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is."},{"name":"OTCHAKHA","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> did not seek power for its own sake, yet <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has reached the zenith of our art. In so doing, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has shattered our old preconceptions and shown us another path."},{"name":"OTCHAKHA","text":"And in opening <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> final chakra by stopping Master's technique, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has given us hope that there is a way to open <span class=\"emphasis\">all</span> chakra without bloodshed."},{"name":"WIDARGELT","text":"Thank you, D'zentsa, O'tchakha. Together, we will create a new path. And lay a new foundation for our order!"},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>. It is to your shining example that we turn."},{"name":"WIDARGELT","text":"You are as a star. We look up to it. We strive to reach its heights."},{"name":"WIDARGELT","text":"The way may be dark. And it may be filled with hardship. But come what may, we will forge on. Towards your light."},{"name":"WIDARGELT","text":"Promise me this, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Ever use your powers for good. And for the realm!"},{"name":"SYSTEM","text":"This concludes the monk quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next monk quest will be available from Erik."},{"name":"QIB","text":"I was not strong enough..."},{"name":"QIB","text":"Ungh... Please take care of Zentsa..."},{"name":"QIB","text":"I'm sorry, Tchakha..."},{"name":"QIB","text":"Hold off H'raha Tia, <span class=\"highlight\">Forename</span>! We will unbind D'zentsa!"},{"name":"QIB","text":"Hold on, Zentsa!"},{"name":"QIB","text":"Tchakha!? And you two as well!?"},{"name":"QIB","text":"You think you can defeat me? Fools!"},{"name":"QIB","text":"Impressive. Mayhap a different approach is in order."},{"name":"QIB","text":"Beware, <span class=\"highlight\">Forename</span>! I sense a torrent of energy!"},{"name":"QIB","text":"It seems your awakening is at hand. How curious."},{"name":"QIB","text":"Their ranks have thinned out! Now's our chance!"},{"name":"QIB","text":"Such power! My body can scarcely contain it!"},{"name":"QIB","text":"Fear not, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! You are now his equal!"},{"name":"QIB","text":"Focus on Master, <span class=\"highlight\">Forename</span>! We'll keep the rest occupied!"},{"name":"QIB","text":"Past time I made myself useful!"},{"name":"QIB","text":"Play time is over! Prepare yourselves!"},{"name":"QIB","text":"Something comes! Be careful!"},{"name":"QIB","text":"Master, please! We need not fight any longer! There is another way!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span> opened <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> final chakra, and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did it without hurting you!"},{"name":"QIB","text":"This changes nothing. Mine is the one true path. It is to exalt Rhalgr that we fight."},{"name":"QIB","text":"So it ends here..."}],"reward":{"gil":1413,"action":25764,"items":[{"id":20656}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":21}],"quests":[67566]},"next":[67962]},"partials":[{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1014112","obj":{"i":1014112,"n":"Widargelt","l":45,"q":1}},{"type":"npc","id":"1014011","obj":{"i":1014011,"n":"Widargelt","l":45,"q":1}},{"type":"npc","id":"1014012","obj":{"i":1014012,"n":"O'tchakha","l":45,"q":1}},{"type":"npc","id":"1014015","obj":{"i":1014015,"n":"D'zentsa","l":45,"q":1}},{"type":"npc","id":"1014113","obj":{"i":1014113,"n":"O'tchakha","l":45,"q":1}},{"type":"action","id":"25764","obj":{"i":25764,"n":"Masterful Blitz","c":2976,"j":20,"t":3,"l":60}},{"type":"item","id":"20656","obj":{"i":20656,"n":"Tantra Armor Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67566","obj":{"i":67566,"n":"Stop the Senseless Killing","g":148,"l":"Mor Dhona","s":580,"f":1}},{"type":"quest","id":"67962","obj":{"i":67962,"n":"A Fistful of Resolve","g":148,"l":"Ul'dah","s":601,"f":1}}]}