{"quest":{"name":"Against the Shadow","location":"Mor Dhona","id":67564,"patch":3.0,"sort":540,"icon":100435,"unlocksFunction":1,"eventIcon":71341,"issuer":1013971,"target":1013971,"involved":[1013997,1013998],"genre":148,"journal":["Widargelt has urgent tidings for you.","Widargelt informs you that he has received a letter from his former students, D'zentsa and O'tchakha, who bid the two of you come to Dalamud's Talons. Though their agenda is a mystery, Widargelt has questions of his own that he would ask them. Make your way to northern Thanalan and participate in the meeting.","At the meeting, D'zentsa and O'tchakha explain that there exist two aspects of chakra, one each for the sect of light and the sect of shadow; in order to open a chakra of an aspect not his own, a monk must fight a disciple of the opposing sect. To that end, the two Miqo'te attack you and Widargelt, the battle ending with all four combatants experiencing their chakra opening. Having thus accomplished their task, D'zentsa and O'tchakha take their leave, but not before begging you to give up being a monk. Speak with Widargelt to learn his mind on these revelations.","Unsurprisingly, Widargelt has no intention of relinquishing his dreams of rebuilding the Fist of Rhalgr. However, if you are to deal with the threat posed by the sect of shadow, you must learn more about the two aspects of chakra. Professor Erik will soon be arriving at Revenant's Toll to share with you his insights on the subject. Make your way back to the settlement and be present for what will surely prove to be a most enlightening experience.","Professor Erik supplements your knowledge of the history of the Fist of Rhalgr. The order was once formed of two distinct yet united sects─one of light and one of shadow. Alas, the members of the latter were expelled in the wake of a bitter feud over the order's alliance with the royal house of Ala Mhigo. The professor then appends that members of the two sects once faced one another in single combat to open all fourteen chakra. Widargelt cannot understand why the sect of shadow insists on fighting rather than cooperating. In order to find the answer, he declares his intent to confront D'zentsa and O'tchakha once more. In the meantime, focus on mastering the new power that has been unleashed inside you.<br><br>※The next monk quest will be available from Widargelt upon reaching level 56."],"objectives":["Speak with Widargelt south of Dalamud's Talons.","Speak with Widargelt.","Speak with Widargelt at Revenant's Toll.","Defeat D'zentsa and O'tchakha!"],"dialogue":[{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>! A letter has arrived. It comes from D'zentsa and O'tchakha."},{"name":"WIDARGELT","text":"They would speak with us. They bid us come to Dalamud's Talons."},{"name":"WIDARGELT","text":"What their agenda is, I know not. But I would ask them questions of my own."},{"name":"WIDARGELT","text":"Professor Erik also sends word. He has learned of the sect of shadow. Soon, he will come to share his knowledge. But before I see him, I would see my former pupils."},{"name":"WIDARGELT","text":"I wish to believe in them. They are good at heart. Of this I am certain. Come, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. We go to Dalamud's Talons."},{"name":"WIDARGELT","text":"It has been a while. You two look well."},{"name":"DZENTSA","text":"Thanks for coming. For what it's worth, we're sorry that we deceived you."},{"name":"OTCHAKHA","text":"Know that it is for the benefit of both our sects that we fight."},{"name":"OTCHAKHA","text":"The other day, when you fended off our fellow disciples of shadow, a new chakra opened within you, did it not? Yet the sensation was unlike aught you had felt before."},{"name":"DZENTSA","text":"It's because you opened a chakra belonging to <span class=\"emphasis\">our</span> aspect─the aspect of shadow. The opposite also applies, of course. Fighting a disciple of your sect allows us to open chakra belonging to the aspect of light."},{"name":"WIDARGELT","text":"Aspects of light and shadow? If this is the way of it, then why must we fight? Why can we not cooperate?"},{"name":"DZENTSA","text":"Our master forbids it, I'm afraid. Our <span class=\"emphasis\">true</span> master, that is."},{"name":"OTCHAKHA","text":"If truth be told, we shouldn't even be speaking with you. We are not permitted to exchange words─only blows."},{"name":"WIDARGELT","text":"They leave us no choice. Come, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! We will give them the exchange they desire!"},{"name":"OTCHAKHA","text":"&lt;gasp&gt; Ahhh, my chakra has opened... &lt;pant&gt; 'Tis precisely as Master described..."},{"name":"DZENTSA","text":"&lt;pant&gt; Yesss, I feel the power surging through me... But if we're to become stronger─if we're to open any more chakra─we must throw ourselves into far fiercer struggles."},{"name":"DZENTSA","text":"The kind where lives are on the line."},{"name":"OTCHAKHA","text":"So long as you are disciples of light, we will continue to come for you, over and over. It cannot end until one side falls, never to rise again."},{"name":"DZENTSA","text":"And that's the reason we called you here."},{"name":"DZENTSA","text":"We <span class=\"emphasis\">don't</span> want to hurt you."},{"name":"DZENTSA","text":"So please, give up being a monk. Give up any notion of rebuilding the Fist of Rhalgr. And go somewhere far, far away!"},{"name":"WIDARGELT","text":"Wait!"},{"name":"WIDARGELT","text":"They would have me stop being a monk. Same as telling me to stop breathing."},{"name":"WIDARGELT","text":"Many revelations have there been this day. The existence of opposing aspects of chakra. This not the least of all. We must learn more of it."},{"name":"WIDARGELT","text":"The professor will soon arrive at Revenant's Toll. Perhaps he can enlighten us."},{"name":"ERIK","text":"Strong backs and feeble minds as far as the eye can see... Yes, this is indeed the frontier."},{"name":"WIDARGELT","text":"Thank you for coming, Professor. The information I requested. Were you able to find it?"},{"name":"WIDARGELT","text":"(-Erik-)Of course I was, you incurable dolt! Elsewise I wouldn't have bothered to come all the way to this backwater! Now then, I have many demands on my time, so I shall convey my findings to you at once, and in the most concise manner possible. Ahem!"},{"name":"ERIK","text":"Now, it is common knowledge that the Fist of Rhalgr rose to the zenith of its power by virtue of royal endorsement. Lesser known is the dispute which broke out over this arrangement between two factions within the Fist─the sect of light and the sect of shadow."},{"name":"ERIK","text":"The head priest of the sect of light believed that an alliance with the royal house of Ala Mhigo was the key to prosperity. However, his counterpart in the sect of shadow disagreed, warning that it would lead to their undoing. History has proven them both right. But I digress."},{"name":"ERIK","text":"Unsurprisingly, the disciples of each sect rallied to their respective leader's side, and the two factions clashed with words and fists both. In the end, the sect of light prevailed, the alliance with the royal house was sealed, and all members of the sect of shadow were banished from the order."},{"name":"ERIK","text":"So, in the past, the two sects both belonged to the Fist of Rhalgr, and their disciples trained beside one another as comrades. And yet, though the techniques they employed were identical, the manner in which they harnessed energy was opposed in nature.<br>It was this difference which gave rise to two aspects of chakra."},{"name":"ERIK","text":"There is a tradition wherein monks from the two schools would meet each other in single combat. In attacking you, I posit that the disciples of shadow are seeking to recreate this tradition."},{"name":"ERIK","text":"This clashing of light and shadow quickened the aether within, causing a chakra of the opposing aspect to open within them. In simple terms for your simple minds, disciples of light fought to open shadow chakra, and disciples of shadow fought to open light chakra."},{"name":"ERIK","text":"And the implications of this? There are not seven, but <span class=\"emphasis\">fourteen</span> chakra all told. Yes, yes, two sides of the same coin; where there is light, there is shadow, and all that poetic tripe."},{"name":"WIDARGELT","text":"One thing I do not understand, Professor. Why can our sects not cooperate? Why must the disciples of shadow attack like common brigands?"},{"name":"ERIK","text":"A feud caused the rift between the two sects─who's to say there isn't a feud still? I suspect only a member of the sect of shadow can tell you the truth. But now I must be off. I shall inquire further into the matter in my spare time. If there is aught else, you know where to find me."},{"name":"WIDARGELT","text":"We must speak with D'zentsa and O'tchakha again. I will try to track them down. Meanwhile, please continue honing your skills."},{"name":"QIB","text":"Why? Why must we fight?"},{"name":"QIB","text":"Enough talk. We have no use for your words."},{"name":"QIB","text":"We're just limbering up!"},{"name":"QIB","text":"Try this on for size!"},{"name":"QIB","text":"Steel yourselves for more!"},{"name":"QIB","text":"There's more where that came from!"},{"name":"QIB","text":"Our own technique!? Stand clear, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"N-No... We aren't supposed to lose..."},{"name":"QIB","text":"Bugger me... They're too strong..."},{"name":"QIB","text":"Ugh... Forgive me, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>..."}],"reward":{"gil":1076,"action":3547,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":21}],"quests":[67563]},"next":[67565]},"partials":[{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1013997","obj":{"i":1013997,"n":"Widargelt","l":46,"q":1}},{"type":"npc","id":"1013998","obj":{"i":1013998,"n":"Erik","l":67,"q":2}},{"type":"action","id":"3547","obj":{"i":3547,"n":"the Forbidden Chakra","c":2535,"j":20,"t":4,"l":54}},{"type":"quest","id":"67563","obj":{"i":67563,"n":"Let's Talk about Sects","g":148,"l":"Mor Dhona","s":520,"f":1}},{"type":"quest","id":"67565","obj":{"i":67565,"n":"Fight the Battle to Win","g":148,"l":"Mor Dhona","s":560,"f":1}}]}