{"quest":{"name":"The Paladin Who Cried Wolf","location":"Central Thanalan","id":67569,"patch":3.0,"sort":520,"icon":100433,"unlocksFunction":1,"eventIcon":71341,"issuer":1003995,"target":1014054,"involved":[1011233,1011235,1011237,1014052,1014053],"genre":147,"journal":["Papashan is relieved to see you.","Papashan has determined that Solkzagyl's last missive was sent from Falcon's Nest in the Coerthas western highlands. Journey to the hamlet and see what you can learn of the missing paladin's whereabouts.","Though you hear mention of a rather large man being attacked by bandits the other night, it remains unclear if it was Solkzagyl. The only other viable lead appears to be Hundred Eyes, a Roegadyn craftsman who has worked with many migrant laborers since the reconstruction of Falcon's Nest began.","To your dismay, you learn from Hundred Eyes that Solkzagyl was indeed the man ambushed in the wastes the other night. The craftsman buried him the next day, in a yard on the ridge by Camp Riversmeet. Journey to the paladin's grave and pay your respects.","You arrive in time to rescue a young boy from a group of bandits curiously intent on ending his life. Afterwards, he explains that he was a friend of Solkzagyl's, and that the men who killed him are the same ones whom you just defeated: Death's Embrace, the assassins who stole Oathkeeper years ago at the behest of the Monetarists. As you watch the boy go, Papashan contacts you via linkpearl, and you inform him of Solkzagyl's death. Aghast and confused, he bids you go after the boy and see what else you can learn of Solkzagyl's final days.","The boy introduces himself as Constaint, friend and former pupil of Solkzagyl. After the former captain saved him from a pack of ravenous wolves, Constaint begged the captain to teach him the ways of the paladin. For a time, Solkzagyl refused, but eventually he relented and accepted the boy as his student. However, he never shared his latest discoveries with Constaint, choosing instead to challenge Death's Embrace when the boy was absent. Though he lacks a master, Constaint is still resolved to become a paladin and reclaim Oathkeeper in Solkzagyl's stead. With your help, he may yet succeed.<br><br>※The next paladin quest will be available from Constaint upon reaching level 54."],"objectives":["Question the people of Falcon's Nest.","Speak with Hundred Eyes.","Search Camp Riversmeet for Solkzagyl's grave.","Speak with Constaint in Falcon's Nest."],"dialogue":[{"name":"PAPASHAN","text":"Ah, just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see!"},{"name":"PAPASHAN","text":"I now know from where Solkzagyl sent his last missive to me. Falcon's Nest, a hamlet in the Coerthas western highlands. It is there I would have you begin your search."},{"name":"PAPASHAN","text":"Reclaiming Oathkeeper would do much to restore the honor of the Sultansworn. But we must not get ahead of ourselves. First, we must find our missing man."},{"name":"PAPASHAN","text":"I want nothing more than to join you in the search. However, Jenlyns would take note of my absence, and I do not wish to involve him just yet."},{"name":"EMERISSEL","text":"A Roegadyn “paladin”? Well...I do recall a traveler who spent several days here, at least..."},{"name":"JOSSELOUX","text":"There was a pitched battle the other night, out in the wastes. Involved a rather large man and a party of his fellow heretics, to hear the scouts tell it. Naturally, we chose not to intervene. If they wish to kill each other, by all means."},{"name":"FORCHETAIX","text":"...Solkzagyl? Never heard of him. Was he one of the new craftsmen working with Hundred Eyes?"},{"name":"FORCHETAIX","text":"Sorry, we see an awful lot of new faces around here. Most don't leave an impression─other than the heretics and bandits, that is."},{"name":"HUNDREDEYES","text":"Heard you was askin' after a Roegadyn, and in a fashion that might give a man cause to worry."},{"name":"HUNDREDEYES","text":"Aye, I know Solkzagyl─<span class=\"emphasis\">knew</span>, I should say. Older fellow, spent some time chattin' with the youngblood. He came through, like the rest of us before him, lookin' for the same thing we all do..."},{"name":"HUNDREDEYES","text":"...Bandits ambushed him in the night, out in the wastes. Buried him with my own two hands the next day, out near Camp Riversmeet. Constaint took it especially hard, close as he was to him."},{"name":"HUNDREDEYES","text":"I laid him to rest in the yard up on the ridge by Camp Riversmeet, if you've a mind to pay your respects."},{"name":"CONSTAINT","text":"Halone's blessings be upon you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I say, that was a rather frightful experience."},{"name":"CONSTAINT","text":"Were you a friend of Solkzagyl's, too? Ah, good... Er, that is to say, my condolences."},{"name":"CONSTAINT","text":"I knew there had to be others who would want to know..."},{"name":"CONSTAINT","text":"'Twas the work of Death's Embrace, I'd wager. Those fiends you slew just now were sent by them as well."},{"name":"CONSTAINT","text":"My kinsmen think them but another band of sellswords or heretics. If only they knew what they were truly capable of..."},{"name":"CONSTAINT","text":"I can only hope that they will heed my warnings this time. If you would excuse me..."},{"name":"PAPASHAN","text":"(-Papashan-)<span class=\"highlight\">Forename</span>, this is Papashan. Have you found Solkzagyl?"},{"name":"PAPASHAN","text":"(-Papashan-)Gods almighty, slain by Death's Embrace!? I heard some of those bastards were still skulking about, but I never thought they would try to..."},{"name":"PAPASHAN","text":"(-Papashan-)Wait─could it be that they were the ones who held Oathkeeper? And that they killed Solkzagyl when he tried to take it back?"},{"name":"PAPASHAN","text":"(-Papashan-)Damn it all, we've still no answers. Though there is still the boy... Hm. Get after him and find out what he knows."},{"name":"PAPASHAN","text":"...I appreciate you coming all this way to see me, <span class=\"highlight\">Forename</span>, but I think we would be better served by you finding out what else the boy knows about Solkzagyl."},{"name":"CONSTAINT","text":"A pleasure to see you again, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Was there something you wished to discuss?"},{"name":"CONSTAINT","text":"Oh, so you're that free paladin Solkzagyl told me all about! It is an honor to meet you at last, <span class=\"highlight\">Forename</span>. That is, for the second time. My name is Constaint. Truly honored, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Truly, truly honored."},{"name":"CONSTAINT","text":"Sorry if I'm a bit out of sorts. It's just...I've been thinking about him a lot. About the day we first met, when he saved me. How his sword gleamed as he danced among the wolves..."},{"name":"CONSTAINT","text":"I begged him to teach me the ways of the paladin, so I could save others like he had saved me. He must have turned me down a dozen times before he finally relented─probably because he caught me asking around about Oathkeeper."},{"name":"CONSTAINT","text":"But I suppose he didn't think I was strong enough to help him reclaim the sword. Why else would he sneak off to challenge Death's Embrace while I was away?"},{"name":"CONSTAINT","text":"I should've been there, <span class=\"highlight\">Forename</span>. I should've been there!"},{"name":"CONSTAINT","text":"...I've decided I'm going to take it back. Oathkeeper, I mean."},{"name":"CONSTAINT","text":"He said I wasn't ready to wield this soul, but what choice do I have now that he's gone?"},{"name":"CONSTAINT","text":"You want to find it too, don't you? Then help me, <span class=\"highlight\">Forename</span>─please!"},{"name":"CONSTAINT","text":"You will!? Halone be praised! You won't regret this!"},{"name":"CONSTAINT","text":"Oh, if Solkzagyl could see us now! Two paladins united in purpose! Well, er, I suppose it's rather premature for me to claim the title, isn't it..."},{"name":"CONSTAINT","text":"One veteran paladin and one aspiring paladin, then! United in purpose! We shall recover Oathkeeper and bring Solkzagyl's murderers to justice! As...as soon as I uncover new information, that is!"}],"reward":{"gil":1245,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":20}],"quests":[67568]},"next":[67570]},"partials":[{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"npc","id":"1014054","obj":{"i":1014054,"n":"Constaint","l":2200,"q":2}},{"type":"npc","id":"1011233","obj":{"i":1011233,"n":"Emerissel","l":2200,"q":6}},{"type":"npc","id":"1011235","obj":{"i":1011235,"n":"Josseloux","l":2200,"q":3}},{"type":"npc","id":"1011237","obj":{"i":1011237,"n":"Forchetaix","l":2200,"q":2}},{"type":"npc","id":"1014052","obj":{"i":1014052,"n":"Hundred Eyes","l":2200,"q":1}},{"type":"npc","id":"1014053","obj":{"i":1014053,"n":"Constaint","l":2200,"q":1}},{"type":"quest","id":"67568","obj":{"i":67568,"n":"An Exemplary Example","g":147,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"67570","obj":{"i":67570,"n":"Big Sollerets to Fill","g":147,"l":"Coerthas Western Highlands","s":540,"f":1}}]}