{"quest":{"name":"The Hands of Fate","location":"Ishgard","id":67561,"patch":3.0,"sort":600,"icon":100443,"unlocksFunction":1,"eventIcon":71341,"issuer":1012222,"target":1012222,"involved":[1015107,1015108,1015109,1015110,1015111,1015112,1015113,1015114,1015115,1015116,1015117],"genre":159,"journal":["Jannequinard and Lady Leveva appear to be ready to depart─with or without you.","As a last-ditch effort to save Lady Leveva and her grandfather, you conceive a plan in which you will attempt to fool Sevestre into believing you possess a second document that could implicate him in Rufin's murder. Travel to Sharlayan's Answering Quarter in the Dravanian hinterlands and rendezvous with Jannequinard to begin your preparations for the final showdown.","There is time before the scheduled meeting with Sevestre and Lady Leveva wishes to view the land where her father was raised. Join her on a walk through the abandoned city–state.","The time is nigh for your confrontation with Sevestre. Proceed to the place of meeting and wait for the Sharlayan official's arrival.","Before you can even attempt to blackmail Sevestre, he reveals that the document contained in Rufin's diary is the only one remaining. The revelation is followed by a violent exchange from which, despite Sevestre's ability to manipulate time itself, you miraculously emerge victorious and retrieve the diary. In a lapse of judgment that could only be attributed to hubris, it appears Sevestre has failed to remove the information which damns him, allowing Lady Leveva to use the diary as leverage to see her grandfather freed and have Sevestre report to the Forum that she has perished on Eorzean soil so she may continue her activities in Ishgard unimpeded by the Old World.","There is time for one last conversation with Jannequinard before you can celebrate.","Upon returning to Ishgard, you learn that Lady Leveva has taken the name of her father Rufin and plans to continue his legacy. Jannequinard plans to finally unlock the remaining heavens, and Quimperain... He is most likely stuck doing the same thing he always has─suffer his master.<br><br>※The next astrologian quest will be available from Jannequinard once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Jannequinard in Sharlayan's Answering Quarter.","Speak with Leveva.","Speak with Leveva again.","Speak with Leveva yet again.","Return to Ishgard and speak with Jannequinard.","Defeat Sevestre."],"dialogue":[{"name":"LEVEVA","text":"There is no other path for me to take. If I do not give myself up, I will be putting the only family I have left in danger, and I cannot bear such a burden. You may accompany me if you wish, but know that by doing so you put yourself in grave danger for no reason other than your pride."},{"name":"JANNEQUINARD","text":"I am quite aware that the mere notion of accompanying Leveva to the Answering Quarter is bordering on absurd, but I cannot in good faith abandon our good friend in her time of need, not after all we have been through. I am joyed to see that you have come to the same conclusion as well."},{"name":"LEVEVA","text":"You two are foolish...but I would not trade friends such as you for all the gold in the Aurum Vale."},{"name":"JANNEQUINARD","text":"But there is no gold in the─<br>Ahem, my lady, might I ask you entertain a second option? You said that your father's diary contained a document which implicates Sevestre in Rufin's murder. What if─and I fully understand the enormity of this if─but what if Sevestre still has yet to lay eyes on that document? Suppose he only took the diary to provoke you? If we could somehow retrieve it before you boarded his airship..."},{"name":"LEVEVA","text":"Then we would have a bargaining chip of our own... But this man is the leader of the Bibliothecs─their sole purpose in life is the hoarding of knowledge. Of course he read the diary. And knowing Sevestre, the document would have been set to flame the moment he discovered it."},{"name":"LEVEVA","text":"Unless... We told him that there was <span class=\"emphasis\">another</span> document... One that I removed from the diary to have examined. One that was <span class=\"emphasis\">not</span> in the diary when he stole it. Of course there is no such page, but it would be easy enough to draft something up from memory of what I saw. Something that would appear official from a distance..."},{"name":"LEVEVA","text":"It just might work...though there is always the chance that he may simply attempt to take the document by force... Were that to happen, we would be fortunate to escape with our lives. Sevestre is a formidable astrologian. Some say he even possesses the power to <span class=\"emphasis\">stop time</span>."},{"name":"JANNEQUINARD","text":"But I thought those were only...!? No. We mustn't think of that. There is little time left before the scheduled meeting in the Answering Quarter. Lady Leveva's plan is all we have. If we are to save both her and her family, we must act, and trust that the stars will guide us to victory."},{"name":"JANNEQUINARD","text":"There is little time, <span class=\"highlight\">Forename</span>. If we are late to the arranged meeting place in the Answering Quarter, who knows what Sevestre will do to Professor Mace or Lady Leveva's mother!?"},{"name":"LEVEVA","text":"This is where my people lived... Where my father was born and raised. Where he became an astrologian. Where he took his first steps on the path that would lead us all here. He was not a Sharlayan. Not even Hyuran. He was an Eorzean. Like Jannequinard and Quimperain. Even you, <span class=\"highlight\">Forename</span>."},{"name":"QUIMPERAIN","text":"What happened here...?"},{"name":"JANNEQUINARD","text":"Nigh on fifteen summers have come and gone since I last set foot on the Paths of Contemplation, yet this place appears as if it hasn't been inhabited for centuries."},{"name":"LEVEVA","text":"Nature is the greatest of levelers, Jannequinard. She provides us with what we need, but when we are done with it, she is quick to take back what is, and always has been, rightfully hers. There is still time before Sevestre is to arrive. I would like to take a walk and see where my father lived. Just knowing that I tread the same ground as he may grant my mind peace."},{"name":"JANNEQUINARD","text":"Well, then might I suggest a rooftop garden directly to the south of here? Your father and I would spend many a night there gazing up at the stars and prattling on about our dreams into the small hours. It is where he first told me of your mother─your birth mother, not the aunt who cared for you after Lady Byrde died in labor─and the child she was carrying."},{"name":"JANNEQUINARD","text":"Not all of the conversations Rufin and I had here were pleasant. He was a fiery spirit, who, once an idea had filled his head, would make it his whole life, regardless of how outlandish it was. Reintroducing Sharlayan astrology to Eorzea was one such idea. I was against it at first, knowing firsthand how traditionalist the people of my city–state were... But your father overwhelmed me with his passion, and it was not long before I, too, found myself a disciple of his vision."},{"name":"LEVEVA","text":"I wonder if my father knew that one day I would be here, standing under the same sky he did."},{"name":"LEVEVA","text":"Did he know that he would have a daughter who was as stubborn as he? A daughter who put her life and the lives of those she loved in danger because of an unfulfilled dream?"},{"name":"LEVEVA","text":"I think he did. And I think if he were here now, he would be proud. Proud that I at least tried. Proud that I did not let fate control me, but that I rather walked hand in hand with that fate down a path my father left, not only for me, but for all those who would carry in their hearts the same dream."},{"name":"JANNEQUINARD","text":"I believe he would be, as well, Lady Leveva. Though I did not fully realize it until recently, these past moons, it has been as if Rufin was here by my side once again. The passion...the stubbornness...the talent."},{"name":"JANNEQUINARD","text":"I do not think he would stand idly by as Sevestre had his way, and so I believe neither should we."},{"name":"LEVEVA","text":"Thank you Janne... I know I have been hard on you, but it is only because you were an incompetent astrologian with an aversion to training...not because you were anything but a good man...and a good friend. Now, let us see what the stars have in mind for us today."},{"name":"JANNEQUINARD","text":"Fate is but a suggestion. Remember that."},{"name":"QUIMPERAIN","text":"You may keep your readings to yourself. No offense, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>, but the only thing that shall be guiding me tonight is my obligation to Lady Leveva. That, and my blade."},{"name":"LEVEVA","text":"Sevestre is not a man to be late. He will be here."},{"name":"SEVESTRE","text":"Ah, ever so predictable, Leveva. I am sorry to inform you, there has been a change of plans. There will be no return to your homeland. No tear-filled reunion with your grandfather. No trial. Only a sentence. And that sentence shall be carried out here, by mine hand. You see, after reading your father's diary, it became clear that you and your wretched friends know too much."},{"name":"SEVESTRE","text":"You would not believe how long I have been searching for that document. The last one that connected me to your father's...unfortunate accident. I tracked down and had all the others destroyed. But this one has eluded me for almost two decades. "},{"name":"LEVEVA","text":"...The <span class=\"emphasis\">last</span>?"},{"name":"LEVEVA","text":"Janne, <span class=\"highlight\">Forename</span>! It appears we are left with but a single path."},{"name":"JANNEQUINARD","text":"There was only ever one, my lady! And we shall see it to the end!"},{"name":"QIB","text":"Thanks are in order, Leveva. By ignoring my directions to come alone, you have saved me the effort of tracking down and slaying each one of you individually."},{"name":"QIB","text":"Silence!"},{"name":"QIB","text":"If you barbarians are one thing, it is brave. I shall give you that. Bravery, however, is the blunt blade of the foolish and the weak."},{"name":"QIB","text":"Let me show you why the barbarians cannot be allowed to have this knowledge!"},{"name":"QIB","text":"Sevestre plots something ill. Do not let down your guard!"},{"name":"QIB","text":"Those arcana... They are not right. I sense forbidden magicks."},{"name":"QIB","text":"Hurry and destroy them! The power they draw from the constellations is too much!"},{"name":"QIB","text":"Destiny lies in mine hands!"},{"name":"QIB","text":"By your own definition, you manipulate the fates of others...but then bleat like lambs led to slaughter when another does the same to yours."},{"name":"QIB","text":"Do you still not see the fallacy in this!? Do you still not see that there is no escape?"},{"name":"QIB","text":"I see that our fates are what we make them!"},{"name":"SEVESTRE","text":"Wait! If you wish to see your grandfather live, you will not kill me!"},{"name":"LEVEVA","text":"That was never our intention, Sevestre. No... I only wish to ask a few simple favors─the first being the return of my father's diary."},{"name":"LEVEVA","text":"You will then send word back to the Old World to have my grandfather released immediately. And finally, you will return to Sharlayan and report to the Forum that I have disappeared and am presumed deceased. Fail to do these things, and I shall tell the Forum all I know of your involvement in my father's death. I doubt they will be as generous with their mercy as I."},{"name":"SEVESTRE","text":"And what? You shall remain here and continue to spread our knowledge across this worm-eaten realm like it was sweet cream butter?"},{"name":"SEVESTRE","text":"You know not what you do. The barbarians of this realm have shown that they can only use knowledge to destroy each other. They corrupt it. They lessen it. And then they forget it. They never once have shown they are worthy of the knowledge they so defile. "},{"name":"SEVESTRE","text":"And yet you would still give it to them. &lt;sigh&gt; Very well. I shall do as you ask."},{"name":"SEVESTRE","text":"But know that the Forum is ever listening, ever watching. Should you continue your escapades here in Ishgard, they <span class=\"emphasis\">will</span> find out."},{"name":"SEVESTRE","text":"And they <span class=\"emphasis\">will</span> send others until they have succeeded where I have...failed."},{"name":"LEVEVA","text":"Then you'd best make certain they do not. You are a powerful man who also happens to be a master of lies and deceit. I pray the task should not prove too difficult. And if it does, well then, I can always <span class=\"emphasis\">show</span> them what manner of a man you truly are."},{"name":"JANNEQUINARD","text":"I do not think there will be any need for that. Sevestre, however wicked, is not a fool. He will not sacrifice what he has spent the past two decades building over a girl he, even with his back to the cobbles, sees as an inferior. Especially if you have offered him a means of accomplishing it without causing him to lose face. His pride, of course, will ache, but it's naught a little wine cannot cure."},{"name":"LEVEVA","text":"&lt;sigh&gt; You are right, Jannequinard. Something I never thought I would admit...at least out loud."},{"name":"JANNEQUINARD","text":"So, does this mean you will remain in the See and continue your teachings?"},{"name":"LEVEVA","text":"Of course I will. There is the pending contract with House Durendaire, my obligations to the Convictors and the hunters of Tailfeather...and then, of course, there is the matter of <span class=\"emphasis\">your</span> incomplete training."},{"name":"LEVEVA","text":"If memory serves me, you have still only opened <span class=\"emphasis\">half</span> of the heavens' gates."},{"name":"JANNEQUINARD","text":"Truth be told, I have no idea how we survived that battle. Think of it a moment. Sevestre could <span class=\"emphasis\">stop</span>. <span class=\"emphasis\">Time</span>. Perhaps fate has a stronger pull than I imagined... Or perhaps I've merely evolved into an all-powerful astrologian. Likely the former."},{"name":"QUIMPERAIN","text":"You may recall a time when I pulled <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span> aside and spoke of how I did not trust my master's heathen magicks. Well, I still do not trust <span class=\"emphasis\">his</span>...but Lady Leveva's and yours? A man my age should not have lasted a half-bell in that last battle. Hells, I still cannot believe we fended off those pirates in Limsa Lominsa... I could not have survived this long without you, <span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Lord</span></span> <span class=\"highlight\">Forename</span>. Should you ever have need of my sword, you need only ask."},{"name":"LEVEVA","text":"Well, things did not go completely as planned, but we arrived at the fate intended for us nonetheless."},{"name":"LEVEVA","text":"Now, the question is, what do we do with this fate we have been granted? I believe this warrants another reading...but perhaps, after we've had a bite to eat."},{"name":"JANNEQUINARD","text":"Ah, <span class=\"highlight\">Forename</span>. You are just in time to greet the Athenaeum's newest member."},{"name":"JANNEQUINARD","text":"May I present you with, <span class=\"emphasis\">Lord</span> Rufin."},{"name":"LEVEVA","text":"(-Rufin-)Why the surprise? Ah, but I believe I know the answer. Your senses are doubtless reeling <span class=\"emphasis\">from having witnessed poor Lady Leveva's tragic end</span> in the hinterlands. &lt;wink&gt;"},{"name":"LEVEVA","text":"(-Rufin-)<span class=\"emphasis\">Contrary to popular opinion</span>, I was not murdered at all, but merely on a long and winding journey that has finally brought me back to Ishgard so that I may teach the secrets of Sharlayan astrology once again."},{"name":"LEVEVA","text":"(-Rufin-)I mean to show the people that fate is a path that need not be walked in darkness. That the stars can be used to light the way."},{"name":"LEVEVA","text":"(-Rufin-)And my <span class=\"emphasis\">first</span> lesson? That those who oppose this celestial guidance shall find their foes burning on and on without end."},{"name":"SYSTEM","text":"This concludes the astrologian quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next astrologian quest will be available from Jannequinard."}],"reward":{"gil":1610,"action":16553,"items":[{"id":20667}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":99}],"quests":[67560]},"next":[67945]},"partials":[{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1015107","obj":{"i":1015107,"n":"Leveva","l":2301,"q":2}},{"type":"npc","id":"1015108","obj":{"i":1015108,"n":"Jannequinard","l":2001,"q":1}},{"type":"npc","id":"1015109","obj":{"i":1015109,"n":"Quimperain","l":2001,"q":1}},{"type":"npc","id":"1015110","obj":{"i":1015110,"n":"Leveva","l":2001,"q":1}},{"type":"npc","id":"1015111","obj":{"i":1015111,"n":"Leveva","l":2001,"q":1}},{"type":"npc","id":"1015112","obj":{"i":1015112,"n":"Quimperain","l":2001,"q":1}},{"type":"npc","id":"1015113","obj":{"i":1015113,"n":"Jannequinard","l":2001,"q":1}},{"type":"npc","id":"1015114","obj":{"i":1015114,"n":"Leveva","l":2001,"q":1}},{"type":"npc","id":"1015115","obj":{"i":1015115,"n":"Quimperain","l":2001,"q":1}},{"type":"npc","id":"1015116","obj":{"i":1015116,"n":"Jannequinard","l":2001,"q":1}},{"type":"npc","id":"1015117","obj":{"i":1015117,"n":"Quimperain","l":2301,"q":1}},{"type":"action","id":"16553","obj":{"i":16553,"n":"Celestial Opposition","c":3142,"j":33,"t":4,"l":60}},{"type":"item","id":"20667","obj":{"i":20667,"n":"Welkin Attire Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67560","obj":{"i":67560,"n":"Trumped","g":159,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"67945","obj":{"i":67945,"n":"East Meets West","g":159,"l":"Ishgard","s":601,"f":1}}]}