{"quest":{"name":"Stop the Senseless Killing","location":"Mor Dhona","id":67566,"patch":3.0,"sort":580,"icon":100435,"unlocksFunction":1,"eventIcon":71341,"issuer":1013971,"target":1013971,"involved":[1014004,1014005,1014006,1014007,1014008,1014009,1014010],"genre":148,"journal":["Widargelt has a theory for opening a chakra of the opposing aspect, and is eager to put it to the test.","With help from Professor Erik, Widargelt and O'tchakha have conceived a potential method for opening a chakra of the opposing aspect without bloodshed between fellow monks. Join your comrades near Dragonspit in the western highlands of Coerthas, where the theory will be put to the test.","O'tchakha puts forth the theory: instead of each other, what if it sufficed for monks to fight other foes within close proximity? To that end, Widargelt and O'tchakha will seek out fell fiends to do battle against in the nearby area. Seek out fell fiends of your own by lying in wait at the specified location.","You have defeated a horde of fell fiends. Unfortunately, it did not seem to open a new chakra within you. Return to Dragonspit and rejoin your comrades.","You arrive to find O'tchakha and Widargelt on their knees, with H'raha Tia, leader of the sect of shadow, gloating over them. The man explains that he is here to silence O'tchakha, but offers to set her and D'zentsa free in exchange for Widargelt's life and your servitude. The villain leaves, and you are left to ponder his words. Turn your attention now to O'tchakha and provide her with assistance.","The unexpected encounter with her former master has left O'tchakha despairing over rescuing D'zentsa. Do as Widargelt bids and /rally her spirits.","Your words of encouragement have done wonders for O'tchakha's spirits, who is more determined than ever to defeat H'raha Tia. She declares that she will not submit to her former master's demands, and neither must you. For the time being, Widargelt suggests that you return to Revenant's Toll to prepare for the battle to come.","Professor Erik has loaned you his tomes, which O'tchakha is poring over for information on opening your final chakra. Meanwhile, Widargelt bids you focus on honing your mind and body both, that you might be ready to confront H'raha Tia─with or without all fourteen chakra.<br><br>※The next monk quest will be available from Widargelt upon reaching level 60."],"objectives":["Speak with O'tchakha near Dragonspit.","Lie in wait at the specified location and defeat any monsters that appear.","Speak with Widargelt.","Assist O'tchakha.","/rally O'tchakha's spirits.","Speak with Widargelt at Revenant's Toll."],"dialogue":[{"name":"WIDARGELT","text":"Good tidings, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. O'tchakha has recovered."},{"name":"WIDARGELT","text":"Together, we spoke with Professor Erik. With his help, we sought ways to open chakra of the opposing aspect. Ways that require no dueling."},{"name":"WIDARGELT","text":"Now, we have a theory. We will test it in the western highlands of Coerthas. Near a place called Dragonspit."},{"name":"WIDARGELT","text":"O'tchakha has already left. Let us join her."},{"name":"WIDARGELT","text":"Listen to O'tchakha. She will explain the theory."},{"name":"OTCHAKHA","text":"There you are, <span class=\"highlight\">Forename</span>. My thanks for coming."},{"name":"WIDARGELT","text":"This site hosted a fierce battle. So says Professor Erik. Much blood was spilled between knights and dragons. This makes it an ideal place for our test."},{"name":"OTCHAKHA","text":"As you know, in order to open the chakra of the opposing aspect, one ordinarily has to fight an individual trained in that aspect. However, it does not suit us to duel one another to the death."},{"name":"OTCHAKHA","text":"And so we theorized: instead of each other, what if disciples from each sect were to fight <span class=\"emphasis\">independently</span> within close proximity?"},{"name":"OTCHAKHA","text":"Influenced by their presence, the aether that pervades a battleground may be tricked into opening an opposing chakra within each combatant."},{"name":"OTCHAKHA","text":"Without further ado, let us put this theory to the proof. Please seek out likely opponents nearby─as formidable as you can manage─and fight them with all your might. Widargelt and I shall do the same."},{"name":"HRAHATIA","text":"I advise you not to interfere."},{"name":"OTCHAKHA","text":"H-How did he know?"},{"name":"WIDARGELT","text":"Be on your guard, <span class=\"highlight\">Forename</span>!"},{"name":"WIDARGELT","text":"He is H'raha Tia. Leader of the sect of shadow. He comes to take back O'tchakha."},{"name":"HRAHATIA","text":"...Take back? What an idiotic notion. She is a traitor to our sect, and I am here to silence her."},{"name":"WIDARGELT","text":"We will not allow it! You must defeat us first!"},{"name":"HRAHATIA","text":"You... You are a disciple of the sect of light, and one who surpasses Widargelt besides. Aye, that you have opened your seventh chakra is plain to my senses."},{"name":"HRAHATIA","text":"An idea occurs to me─a peaceful way to end this meeting. We need not fight one another, you and I."},{"name":"HRAHATIA","text":"Tchakha, you are to slay Widargelt and open your seventh chakra."},{"name":"HRAHATIA","text":"Once you have accomplished this, return to me, and Zentsa shall come to no harm."},{"name":"HRAHATIA","text":"As for you, adventurer─if you will then swear to serve me, I shall release Zentsa and Tchakha both. A fair trade, is it not?"},{"name":"HRAHATIA","text":"You need not answer right this moment. If you agree to these terms, come to the ruins south of Little Ala Mhigo. I shall await you there."},{"name":"HRAHATIA","text":"Think on it, but not overlong, or I cannot guarantee that there will be much of Zentsa left to retrieve."},{"name":"WIDARGELT","text":"Damn him!"},{"name":"WIDARGELT","text":"I tried to fight him. But he was too strong. Far stronger than I had imagined."},{"name":"OTCHAKHA","text":"Such is the might of he who has opened all fourteen chakra. None alive can fight him on equal footing─not even <span class=\"highlight\">Forename</span>."},{"name":"WIDARGELT","text":"One thing bothers me. The sect of light was destroyed. Yet H'raha Tia has opened all fourteen chakra. How did he do this?"},{"name":"OTCHAKHA","text":"He was present for the massacre at the temple. He attacked and slew a priest of your sect, and in so doing opened the seventh chakra of light."},{"name":"OTCHAKHA","text":"As we are, we cannot hope to defeat him. Alas, our test was a failure."},{"name":"OTCHAKHA","text":"My chakra did not open, and neither did yours. Am I correct?"},{"name":"OTCHAKHA","text":"What am I to do? Oh, Zentsa... I want to save you, but I cannot kill Widargelt..."},{"name":"WIDARGELT","text":"O'tchakha needs comfort. Will you <span class=\"highlight\">rally</span> her spirits?"},{"name":"OTCHAKHA","text":"I feel so powerless..."},{"name":"OTCHAKHA","text":"Please forgive me my pitiful display. You are right, <span class=\"highlight\">Forename</span>─I mustn't despair."},{"name":"OTCHAKHA","text":"Zentsa and I used to be as birds in a cage. Serving H'raha Tia was the only life we knew. But all that changed when we met the two of you."},{"name":"OTCHAKHA","text":"You opened our eyes to a world of infinite possibilities. So much more is possible than I had ever dreamed. And so I won't give up hope."},{"name":"OTCHAKHA","text":"There is a way to defeat H'raha Tia, and we need but find it! We will rescue Zentsa! Without my raising a hand against Widargelt, without your offering yourself as H'raha Tia's thrall!"},{"name":"WIDARGELT","text":"There is time still. Let us return to Revenant's Toll. There, we shall make a plan."},{"name":"WIDARGELT","text":"Professor Erik has loaned us his tomes. O'tchakha scours them for ways to open your final chakra."},{"name":"WIDARGELT","text":"Perhaps she will find something. Perhaps not. Meanwhile, we must do what we can. Hone our minds and our bodies for the battle to come."}],"reward":{"gil":1447,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":21}],"quests":[67565]},"next":[67567]},"partials":[{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1014004","obj":{"i":1014004,"n":"Widargelt","l":2200,"q":1}},{"type":"npc","id":"1014005","obj":{"i":1014005,"n":"O'tchakha","l":2200,"q":1}},{"type":"npc","id":"1014006","obj":{"i":1014006,"n":"Widargelt","l":2200,"q":1}},{"type":"npc","id":"1014007","obj":{"i":1014007,"n":"O'tchakha","l":2200,"q":1}},{"type":"npc","id":"1014008","obj":{"i":1014008,"n":"H'raha Tia","l":2200,"q":1}},{"type":"npc","id":"1014009","obj":{"i":1014009,"n":"Widargelt","l":2200,"q":1}},{"type":"npc","id":"1014010","obj":{"i":1014010,"n":"O'tchakha","l":2200,"q":1}},{"type":"quest","id":"67565","obj":{"i":67565,"n":"Fight the Battle to Win","g":148,"l":"Mor Dhona","s":560,"f":1}},{"type":"quest","id":"67567","obj":{"i":67567,"n":"Appetite for Destruction","g":148,"l":"Mor Dhona","s":600,"f":1}}]}