{"quest":{"name":"Fight the Battle to Win","location":"Mor Dhona","id":67565,"patch":3.0,"sort":560,"icon":100435,"unlocksFunction":1,"eventIcon":71341,"issuer":1013971,"target":1013971,"involved":[1013999,1014000,1014001,1014002,1014703],"genre":148,"journal":["Widargelt has acquired information on O'tchakha's whereabouts, and would share it with you.","O'tchakha has been sighted near Eugenia's Spire. Widargelt means to confront her, that he might learn what drives the sect of shadow. Make haste to the North Shroud and join Widargelt near Eugenia's Spire.","You and Widargelt find O'tchakha in a bad way. She explains that her master, a man named H'raha Tia, forced her and D'zentsa to fight one another to the death. Though O'tchakha once saw the man as a father figure, this incident has opened her eyes to his true nature. O'tchakha now fears for D'zentsa, who is still at their master's mercy. She declares her intent to rescue her, and Widargelt pledges his aid. While the two of them make for the safety of the Hedgetree, Widargelt bids you lie in wait near Eugenia's Spire and intercept any pursuers.","You have dispatched the minions H'raha Tia had sent to verify O'tchakha's death. Make your way to the Hedgetree and rejoin your companions.","O'tchakha reveals the truth of the sect of shadow and the ruthless man who now leads it. Though Widargelt harbors hopes that he and H'raha Tia may yet come to an understanding, O'tchakha is not confident that her master will be amenable to discussion. More than likely, it will come to blows, and against a powerful foe who has opened all fourteen chakra─seven each of light and shadow. For now, return to Revenant's Toll and discuss a course of action with Widargelt.","When O'tchakha has recovered, training will resume to open more chakra. In the meantime, Widargelt bids you dedicate yourself to your training, that you might together go forward─as proud disciples of light.<br><br>※The next monk quest will be available from Widargelt upon reaching level 58."],"objectives":["Speak with Widargelt near Eugenia's Spire.","Lie in wait at the specified location and defeat your pursuers.","Speak with Widargelt.","Speak with Widargelt at Revenant's Toll."],"dialogue":[{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>. Finally, I have information on O'tchakha. She is near Eugenia's Spire in the North Shroud."},{"name":"WIDARGELT","text":"I mean to confront her. To demand the truth from her."},{"name":"WIDARGELT","text":"She and D'zentsa do not act of their own free will. Of this I am certain. Nay, something has a hold over them. We will find out what it is."},{"name":"WIDARGELT","text":"Come, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. We go to the North Shroud. Quickly, while the trail is still fresh."},{"name":"OTCHAKHA","text":"Unnngh..."},{"name":"WIDARGELT","text":"I found her like this! What has happened!?"},{"name":"OTCHAKHA","text":"Widargelt...and <span class=\"highlight\">Forename</span>?"},{"name":"OTCHAKHA","text":"Rest assured my injuries are not serious. Zentsa held back."},{"name":"OTCHAKHA","text":"But gods, I feel like such a fool... No matter what he asked of us, we always did it without question. In so doing, we thought we could survive. But in the end he commanded us to fight each other to the death to open our chakra."},{"name":"WIDARGELT","text":"Fight to the death? Who commanded this!? <span class=\"emphasis\">Who</span>!?"},{"name":"OTCHAKHA","text":"Who else but our master? H'raha Tia is his name, and he leads the sect of shadow. But more than that, he was a father figure to Zentsa and me."},{"name":"OTCHAKHA","text":"After our own parents abandoned us, Master H'raha Tia took us in and raised us. We always strove to please him lest we lose our place."},{"name":"OTCHAKHA","text":"But today he made our worth to him abundantly clear. We are not his friends, let alone his family. Nay, we are naught but tools to be used and discarded."},{"name":"OTCHAKHA","text":"When we fought, Zentsa thrust me off the cliff. She made it appear an accident, that I alone might flee."},{"name":"OTCHAKHA","text":"But I cannot flee while Zentsa is still at our master's mercy. I must rescue her, before he decides that she is no longer useful."},{"name":"OTCHAKHA","text":"And if you know what's good for you, you will put many malms between yourselves and this place. Master will doubtless send people to verify my death."},{"name":"WIDARGELT","text":"O'tchakha, wait! Let us help you!"},{"name":"OTCHAKHA","text":"You would help us, after all the wrongs we have committed against you? Why?"},{"name":"WIDARGELT","text":"I once lusted for power. I stopped at nothing to obtain it. I used <span class=\"highlight\">Forename</span>. I betrayed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. Worse, I tried to kill <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"WIDARGELT","text":"I repented. I started anew. Now, someone is making the same mistake as me. I cannot ignore it. Nor can I ignore those who suffer from it."},{"name":"WIDARGELT","text":"But above all, my pupils are in trouble. I would help them. It is what a master should do."},{"name":"OTCHAKHA","text":"Oh, Widargelt..."},{"name":"WIDARGELT","text":"I will go with O'tchakha to the Hedgetree. See that no one follows. Join us when the area is safe."},{"name":"WIDARGELT","text":"I will go with O'tchakha to the Hedgetree. See that no one follows. Join us when the area is safe."},{"name":"OTCHAKHA","text":"Oh, Widargelt..."},{"name":"OTCHAKHA","text":"You have my thanks."},{"name":"WIDARGELT","text":"It is safe here. We may speak freely. There is much I do not know. Please tell me everything."},{"name":"OTCHAKHA","text":"In the beginning, members of the Fist of Rhalgr strove to open all fourteen chakra─seven of light and seven of shadow."},{"name":"OTCHAKHA","text":"Those who had opened all seven of their native chakra were permitted to duel those who had achieved the same in the opposing aspect."},{"name":"OTCHAKHA","text":"For generations, such duels were held in great secrecy."},{"name":"OTCHAKHA","text":"But that ended with the massacre at the Temple of the Fist, when the sect of light was extinguished. And though the sect of shadow survived by virtue of its obscurity, its disciples lost the means to open light chakra."},{"name":"OTCHAKHA","text":"That is, until Master H'raha Tia learned of the sole survivor of the massacre─you, Widargelt. And that was how Zentsa and I came to you."},{"name":"OTCHAKHA","text":"Our master taught us that the disciples of light were but a means to an end─a resource to be used. He ingrained in us the belief that our two sects must ever be at odds. And we took him at his word, fools that we were."},{"name":"WIDARGELT","text":"I understand now how things were in the past. How they are in the present. Most importantly, I know that light and shadow were formerly as one. And it may yet be so again."},{"name":"WIDARGELT","text":"I will speak with Master H'raha Tia. Convince him that our schools need not fight. Together, we can rebuild our proud order."},{"name":"OTCHAKHA","text":"I am afraid he will not be easily swayed. And should it come to blows─as I fear it will─know that his strength far surpasses ours. He is the only person alive who has opened all fourteen chakra."},{"name":"OTCHAKHA","text":"Recently, I have focused on opening light chakra. Of my own aspect, I have succeeded in opening but six. I am no match for Master H'raha Tia."},{"name":"OTCHAKHA","text":"You are our best hope, <span class=\"highlight\">Forename</span>. Even so, you are still one chakra short of fourteen─a small yet decisive difference."},{"name":"OTCHAKHA","text":"If you are to have a fighting chance, you must open the final chakra that eludes you─the seventh chakra of shadow. Alas, this presents a dilemma: there is no way to do so outside of mortal combat."},{"name":"WIDARGELT","text":"There will be another way. There always is. All our chakra may not be open. But we have each other. Together, we may yet rescue D'zentsa."},{"name":"OTCHAKHA","text":"Thank you, Widargelt. I swear to do my utmost to aid you."},{"name":"WIDARGELT","text":"That is well. But first, O'tchakha must recover. We return to Revenant's Toll. There is much planning to do."},{"name":"WIDARGELT","text":"A healer tends O'tchakha. When she is well enough, we will work to open our chakra."},{"name":"WIDARGELT","text":"We both saw how O'tchakha fears her master. It is not normal. As she warned, words may not avail us. We must be prepared for anything."},{"name":"WIDARGELT","text":"Continue your training, <span class=\"highlight\">Forename</span>. And together let us go forward─as proud disciples of light!"}],"reward":{"gil":1124,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":21}],"quests":[67564]},"next":[67566]},"partials":[{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1013999","obj":{"i":1013999,"n":"Widargelt","l":57,"q":1}},{"type":"npc","id":"1014000","obj":{"i":1014000,"n":"O'tchakha","l":57,"q":1}},{"type":"npc","id":"1014001","obj":{"i":1014001,"n":"Widargelt","l":57,"q":1}},{"type":"npc","id":"1014002","obj":{"i":1014002,"n":"O'tchakha","l":57,"q":1}},{"type":"npc","id":"1014703","obj":{"i":1014703,"n":"O'tchakha","l":57,"q":1}},{"type":"quest","id":"67564","obj":{"i":67564,"n":"Against the Shadow","g":148,"l":"Mor Dhona","s":540,"f":1}},{"type":"quest","id":"67566","obj":{"i":67566,"n":"Stop the Senseless Killing","g":148,"l":"Mor Dhona","s":580,"f":1}}]}