{"quest":{"name":"The Legend Continues","location":"Ul'dah","id":67562,"patch":3.0,"sort":500,"icon":100435,"unlocksFunction":1,"eventIcon":71341,"issuer":1006749,"target":1013971,"involved":[1013976,1013977,1013978,1013979,1013981,1014111],"genre":148,"journal":["Professor Erik is concerned for a mutual friend, though he would be the last to admit it.","You learn from Professor Erik that your friend and fellow monk, Widargelt, has cast aside his all-consuming desire for vengeance, and now seeks to rebuild the Fist of Rhalgr. To that end, he has begun taking on pupils, whom he trains at Revenant's Toll. The good professor bids you pay Widargelt a visit, that you might cease worrying about your friend.","Widargelt introduces you to two of his most promising pupils, D'zentsa and O'tchakha, orphans who one day appeared before him. As their senior and his foremost pupil, Widargelt now asks you to assist in their training. Join Widargelt to the southeast of Revenant's Toll.","First, Widargelt asks you to demonstrate your prowess to D'zentsa. Seek her out to the northeast, and defeat any enemies that appear.","You fell your fearsome foe with ease. Turn your attention back to D'zentsa.","You have won D'zentsa's respect and admiration. O'tchakha is next in line to be treated to a display of your sublime skills. Seek her out to the south, and defeat any enemies that appear.","You fell more fearsome foes with ease. Turn your attention back to O'tchakha.","You have won O'tchakha's respect and admiration as well. But as the two friends speak excitedly of training under you, a yell rings out. It appears Widargelt is in danger. Make haste to the place you left him.","You arrive to find Widargelt alone and on his knees, his assailants having since fled. He explains that he was attacked by strange men who fought in the style of monks. During the encounter, a new chakra appears to have opened within Widargelt, though the sensation was unlike anything he has experienced before. For now, return to the safety of Revenant's Toll and rejoin your fellow monks.","Widargelt recounts his encounter with the strange men in detail. As he defended himself, his body was racked by a sudden pain as though something had pierced it. While he is certain that a chakra has opened within him, he does not believe it to be the seventh. For lack of an explanation, he declares that he will seek Professor Erik's advice. Should this phenomenon prove to be a new source of power, Widargelt promises to share its secrets with you.<br><br>※The next monk quest will be available from Widargelt upon reaching level 52."],"objectives":["Speak with Widargelt at Revenant's Toll.","Speak with Widargelt southeast of Revenant's Toll.","Speak with D'zentsa and defeat any enemies that appear.","Speak with D'zentsa.","Speak with O'tchakha and defeat any enemies that appear.","Speak with O'tchakha.","Speak with Widargelt.","Speak with Widargelt at Revenant's Toll."],"dialogue":[{"name":"ERIK","text":"Ah, <span class=\"highlight\">Forename</span>! Your sense of timing is impeccable as ever! A pity your mind was never quite so reliable."},{"name":"ERIK","text":"But worry not, for the task I would have you perform shan't tax your limited intellect. It pertains to your monk friend, Widargelt."},{"name":"ERIK","text":"This scarce comes as any surprise, but my words of wisdom have struck a chord with the oaf. Having been made to realize that there is more to life than vengeance, he now expends his energies on more constructive pursuits. Namely, rebuilding his order, the Fist of Rhalgr."},{"name":"ERIK","text":"Indeed, he has been taking on pupils, and rumor has it he teaches with both charisma and zeal. Plainly, mine own brilliance as a tutor has rubbed off on him."},{"name":"ERIK","text":"And what is this task that I would have you do? Take more readings with my aetherometer, you are doubtless thinking. False! You of all people should know that I am finished with that research. And such a triumph it was!"},{"name":"ERIK","text":"To be sure, I may have need of your talent for fieldwork again in the future. For now, however, I simply wish for you to go and see how Widargelt fares. And lest you think that I worry about the fool─perish the thought!"},{"name":"ERIK","text":"As a <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> of the path, <span class=\"emphasis\">you</span> will be worried about him, though it may not have occurred to you yet. And so I am taking the liberty of telling you what you must do to alleviate that worry."},{"name":"ERIK","text":"Widargelt trains his pupils at Revenant's Toll. With that, you have all the information you need. Off you go, then!"},{"name":"ERIK","text":"Widargelt trains his pupils at Revenant's Toll. Take yourself there and see how your friend is faring."},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>. It has been a while, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. What brings you here?"},{"name":"WIDARGELT","text":"So the professor sends you. But it matters not why you came. I am glad for your visit."},{"name":"WIDARGELT","text":"Indeed, I have begun teaching. I desire to preserve our way. To impart our art to a new generation. Though I myself still have much to learn."},{"name":"WIDARGELT","text":"I have but few pupils now. But slowly their numbers grow."},{"name":"WIDARGELT","text":"I will introduce some to you. Two girls who show great promise. Perhaps you can assist in their training?"},{"name":"WIDARGELT","text":"D'zentsa, O'tchakha!"},{"name":"DZENTSA","text":"What is it, Master Widargelt? Has someone new joined?"},{"name":"WIDARGELT","text":"No, not a new pupil. An old one. My first and foremost. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has long surpassed me."},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span> is <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> name. Today you will train under <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> supervision. An excellent opportunity. Go to the usual place and make ready."},{"name":"DZENTSA","text":"Heh, I've always wanted to have a senior! See you in a bit, <span class=\"highlight\">Forename</span>!"},{"name":"OTCHAKHA","text":"Zentsa, wait! &lt;sigh&gt; Please excuse Zentsa. She forgets herself sometimes, but she has a good heart. We shall be honored for your watchful gaze, <span class=\"highlight\">Forename</span>."},{"name":"WIDARGELT","text":"Those two were abandoned by their parents. One day, they came and begged me to teach them. They are very dedicated. Very quickly do they learn. Every day is fulfilling."},{"name":"WIDARGELT","text":"But come, let us go to the training ground. Meet me southeast of Revenant's Toll."},{"name":"WIDARGELT","text":"We have no dedicated place for training. No halls of our own. My pupils train wherever they can."},{"name":"WIDARGELT","text":"First, I would have you demonstrate your abilities to D'zentsa. She awaits you to the northeast."},{"name":"WIDARGELT","text":"D'zentsa awaits you to the northeast. Demonstrate your abilities to her."},{"name":"DZENTSA","text":"I've been waiting for you! Master thinks very highly of you, so you'd better not disappoint!"},{"name":"DZENTSA","text":"Whoa, you really <span class=\"emphasis\">are</span> strong... And there I was feeling good about myself. The world's a big old place, isn't it?"},{"name":"DZENTSA","text":"So, you're going to demonstrate for Tchakha next? Heh, she's going to be so impressed!"},{"name":"DZENTSA","text":"We've been together all our lives, in case you're wondering. We can read each other's thoughts as though they were our own!"},{"name":"DZENTSA","text":"Come on, I'll take you to her! She should be over to the south!"},{"name":"DZENTSA","text":"Hurry and show Tchakha your skills!"},{"name":"OTCHAKHA","text":"I have eagerly awaited your coming, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Zentsa tells me that I'm in for a treat─that I mustn't so much as bat an eyelid."},{"name":"OTCHAKHA","text":"My heart races in anticipation of your demonstration! Please begin whenever you are ready!"},{"name":"DZENTSA","text":"Whoa, that's even better than what you showed me!"},{"name":"OTCHAKHA","text":"You're every bit as amazing as Zentsa claimed you would be! Even though Master said so himself, I didn't believe that anyone could be stronger than him!"},{"name":"DZENTSA","text":"See? You impressed the britches off her, just like I said you would!"},{"name":"OTCHAKHA","text":"Oh, Zentsa! I have never been so excited! I wish to learn everything <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span> knows! <span class=\"emphasis\">Everything</span>!"},{"name":"DZENTSA","text":"Me too, Tchakha! With <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> help, we're bound to become stronger than we'd ever dared hope!"},{"name":"OTCHAKHA","text":"Growing up on our own, Zentsa and I suffered much because we were weak and couldn't protect ourselves."},{"name":"OTCHAKHA","text":"And so we swore to one another that we would become strong. If we could be as strong as you, there would be naught we need fear!"},{"name":"DZENTSA","text":"So! I've been wondering about the applications of Four-point Fury..."},{"name":"WIDARGELT","text":"(-Widargelt-)Who are you!? What do you want!?"},{"name":"DZENTSA","text":"That was Master Widargelt!"},{"name":"DZENTSA","text":"Master! Are you alright!?"},{"name":"WIDARGELT","text":"You...you have not come to harm?"},{"name":"DZENTSA","text":"We're fine, Master─it's you we're worried about! What happened!?"},{"name":"WIDARGELT","text":"Strangers came. They attacked without warning. The techniques they used were the same as ours."},{"name":"OTCHAKHA","text":"Same as ours? You mean to say they were monks? But I thought there were no others besides ourselves..."},{"name":"WIDARGELT","text":"I alone survived the massacre at the temple. There should be no─<br>Ugh... This sensation..."},{"name":"WIDARGELT","text":"A new power swells within me. As though a new chakra has opened. Yet it is unlike aught I have felt before."},{"name":"DZENTSA","text":"Tchakha, this area was the site of some famous battle, wasn't it?"},{"name":"OTCHAKHA","text":"Yes, it was─the Battle of Silvertear Skies. Which means that one's chakra can be opened here. Judging by Master's condition, however, I'm inclined to think that something else was the cause."},{"name":"WIDARGELT","text":"Let us return to Revenant's Toll. I must rest."},{"name":"WIDARGELT","text":"I am feeling better. The pain has subsided."},{"name":"WIDARGELT","text":"They came shortly after you left. Masked men who fight as we do. They were monks. Of this I am certain."},{"name":"WIDARGELT","text":"They outnumbered me. I held them off. But a sudden pain racked my body. As though I was pierced through. I fell to my knees."},{"name":"WIDARGELT","text":"When next I was aware, my assailants were gone. Most likely fled when they heard your coming."},{"name":"WIDARGELT","text":"The sensation I felt. It is not unlike a chakra opening. But neither is it the seventh chakra."},{"name":"DZENTSA","text":"If it isn't the seventh chakra, then what could it possibly be?"},{"name":"WIDARGELT","text":"I know not. I must ask someone more learned than me. Professor Erik. He is versed in the history of our order. Perhaps he can find more information."},{"name":"WIDARGELT","text":"D'zentsa, O'tchakha. Return to your training."},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>. This may be a new source of power. If so, I would share its secrets with you. If I learn something, I will let you know."},{"name":"SYSTEM","text":"The next monk quest will be available from Widargelt upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1018,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":21}],"questsType":"all","quests":[66602,65964]},"next":[67563]},"partials":[{"type":"npc","id":"1006749","obj":{"i":1006749,"n":"Erik","l":41,"q":9}},{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1013976","obj":{"i":1013976,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1013977","obj":{"i":1013977,"n":"D'zentsa","l":67,"q":1}},{"type":"npc","id":"1013978","obj":{"i":1013978,"n":"O'tchakha","l":67,"q":1}},{"type":"npc","id":"1013979","obj":{"i":1013979,"n":"D'zentsa","l":67,"q":1}},{"type":"npc","id":"1013981","obj":{"i":1013981,"n":"D'zentsa","l":67,"q":1}},{"type":"npc","id":"1014111","obj":{"i":1014111,"n":"Widargelt","l":67,"q":1}},{"type":"quest","id":"66602","obj":{"i":66602,"n":"Five Easy Pieces","g":148,"l":"Ul'dah","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67563","obj":{"i":67563,"n":"Let's Talk about Sects","g":148,"l":"Mor Dhona","s":520,"f":1}}]}