{"quest":{"name":"Let's Talk about Sects","location":"Mor Dhona","id":67563,"patch":3.0,"sort":520,"icon":100435,"unlocksFunction":1,"eventIcon":71341,"issuer":1013971,"target":1013971,"involved":[1013982,1013984,1013987,1013990,1013994,1013995,1013996],"genre":148,"journal":["Widargelt is wearing an apologetic expression.","Widargelt informs you that he has consulted Professor Erik regarding his newly opened chakra. Alas, the good professor has yet to provide an answer, and so he has no tidings to share at present. Setting that concern aside for the time being, Widargelt invites you to oversee his pupils' training once more. Join him to the west of Revenant's Toll, where training is currently in progress.","You arrive at the training ground to find one of Widargelt's pupils badly beaten. The fellow explains that he was set upon by monks, and Widargelt is convinced that they are the selfsame men who attacked him. Join your brother monk as he gives chase, and make your way to Camp Revenant's Toll.","Widargelt has chased down some of the enemy monks. Tend to them while he continues pursuing those who are still at large.","You have dispatched the monks. Follow Widargelt west of Camp Revenant's Toll.","Widargelt has chased down another group of enemy monks. Once again, tend to them while Widargelt continues giving chase.","You have dispatched the second group of monks. Follow Widargelt to the area northeast of the Tangle.","Widargelt has chased down yet another group of enemy monks. And yet again, you must tend to them while Widargelt continues giving chase.","You have dispatched what you hope is the final group of monks. Follow Widargelt to the area north of the Tangle.","You arrive to find Widargelt locked in a gaze with his leading pupils, D'zentsa and O'tchakha. Explaining that they have no choice, they fall upon you. In the midst of the encounter, you and Widargelt experience the sensation of a new chakra opening. Upon seeing this, D'zentsa and O'tchakha take their leave, but not before revealing the existence of two sects─one of light and one of shadow, the latter to which they belong. Return to Revenant's Toll and speak with Widargelt about these revelations.","Wounded by his pupils' betrayal, Widargelt is all the more determined to uncover the truth behind this mysterious sect of shadow and its objective. In the meantime, he bids you focus on mastering your newfound power, which has been unleashed with the opening of your chakra.<br><br>※The next monk quest will be available from Widargelt upon reaching level 54."],"objectives":["Speak with Widargelt.","Follow Widargelt.","Defeat enemy monks.","Follow Widargelt.","Defeat enemy monks.","Follow Widargelt.","Defeat enemy monks.","Follow Widargelt.","Speak with Widargelt at Revenant's Toll."],"dialogue":[{"name":"WIDARGELT","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. It is good of you to come again."},{"name":"WIDARGELT","text":"After your last visit, I told Professor Erik of my experience. I have not heard from him since. I wonder if he has forgotten. He is a busy man."},{"name":"WIDARGELT","text":"But never mind that for now. You are here. Perhaps you can help my pupils train again?"},{"name":"WIDARGELT","text":"D'zentsa and O'tchakha were impressed by you. They spoke of your prowess to their peers. Now they all want you to teach them."},{"name":"WIDARGELT","text":"My pupils are training to the west. Let us go there."},{"name":"WIDARGELT","text":"He is one of mine. He has been badly beaten. Who did this?"},{"name":"DESHI02027","text":"(-Injured Pupil-)Ungh... They were monks...like us..."},{"name":"WIDARGELT","text":"The same villains who attacked me? This is an outrage! They must be made to pay! With me, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! They cannot be far!"},{"name":"WIDARGELT","text":"They are the ones, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>!"},{"name":"WIDARGELT","text":"But there are more at large. I saw them scurry away. See to this lot. I will continue giving chase."},{"name":"WIDARGELT","text":"They are yours, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>!"},{"name":"WIDARGELT","text":"We almost have them all!"},{"name":"DZENTSA","text":"Mind stepping away?"},{"name":"OTCHAKHA","text":"..."},{"name":"WIDARGELT","text":"Beware, <span class=\"highlight\">Forename</span>. Those two are not what they seem."},{"name":"DZENTSA","text":"We had stayed too long. Any longer, and we wouldn't have a place to return to."},{"name":"OTCHAKHA","text":"We seek no forgiveness for what we do. For it is the only life we know."},{"name":"DZENTSA","text":"And if we don't return to it now, there'd be nothing left for us."},{"name":"OTCHAKHA","text":"Please understand. We have no other choice. And now...prepare yourselves!"},{"name":"WIDARGELT","text":"Damn it!"},{"name":"WIDARGELT","text":"Th-This power surging within... Another chakra? But why? How?"},{"name":"DZENTSA","text":"That's it for today. We're sparing you, but know that it isn't out of pity. We need you, that's all."},{"name":"WIDARGELT","text":"Wh-What do you mean?"},{"name":"OTCHAKHA","text":"Yours is the sect of light, and ours shadow. We are two sides of the same coin."},{"name":"DZENTSA","text":"That said, you disciples of light are naught but fodder to us. You exist solely to nourish shadow."},{"name":"WIDARGELT","text":"W-Wait!"},{"name":"WIDARGELT","text":"A new chakra has opened within me. As it did before. It is the same for you, yes?"},{"name":"WIDARGELT","text":"The two girls. The way they harness energy differs from us. It must be the way of their sect."},{"name":"WIDARGELT","text":"I had great hopes for them. Their betrayal saddens me. But there is no time for lamentation."},{"name":"WIDARGELT","text":"This sect of shadow. I knew not of its existence. It is a great surprise. We must learn all we can of them."},{"name":"WIDARGELT","text":"A new chakra has opened within us. How it happened, I know not. But you have newfound power. And you must master it."}],"reward":{"gil":718,"action":4262,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":21}],"quests":[67562]},"next":[67564]},"partials":[{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1013982","obj":{"i":1013982,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1013984","obj":{"i":1013984,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1013987","obj":{"i":1013987,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1013990","obj":{"i":1013990,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1013994","obj":{"i":1013994,"n":"Widargelt","l":67,"q":1}},{"type":"npc","id":"1013995","obj":{"i":1013995,"n":"D'zentsa","l":67,"q":1}},{"type":"npc","id":"1013996","obj":{"i":1013996,"n":"O'tchakha","l":67,"q":1}},{"type":"action","id":"4262","obj":{"i":4262,"n":"Form Shift","c":2536,"j":20,"t":3,"l":52}},{"type":"quest","id":"67562","obj":{"i":67562,"n":"The Legend Continues","g":148,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"67564","obj":{"i":67564,"n":"Against the Shadow","g":148,"l":"Mor Dhona","s":540,"f":1}}]}