{"quest":{"name":"Light-headed","location":"Limsa Lominsa","id":67575,"patch":3.0,"sort":530,"icon":100452,"unlocksFunction":1,"eventIcon":71341,"issuer":1001001,"target":1012518,"involved":[1000153,1000691,1001000],"genre":138,"usedItems":[10756],"journal":["Blanstyr appears to be at his wit's end.","Blanstyr sheepishly greets you and asks if you are still willing to aid in his work. It seems that the adventurers who rescued him out in La Noscea have tasked the old armorer with a troublesome commission. Head over to the Drowning Wench, and speak with Benathaire to learn the details of the request.","You approach Benathaire, and the soft-spoken conjurer explains that he and his party plan to engage a monster of some ferocity. To prepare for the battle, he wishes to have a special light helm made for the party's monk, as Sasapiku refuses to wear any heavy protective gear that would slow him down. Blanstyr claims that no such piece can be crafted of metal, but H'naanza disagrees. Head to Gridania to seek the advice of Geva and Beatin, found in the Leatherworkers' Guild and Carpenters' Guild, respectively.","Both Geva and Beatin, while somewhat surprised by your visit, willingly offer advice on how best to craft a light, sturdy head piece. Return to the Armorers' Guild and report to H'naanza.","You return to the forgemaster with the advice of the Gridanian artisans. Reasoning that a mask would use the least material, and that titanium is one of the lightest and strongest metals, H'naanza concludes that your client may be satisfied with a titanium mask of striking. Craft the suggested item, and deliver it to Benathaire at the Drowning Wench.","You bring the titanium mask to the waiting adventurers, and Sasapiku seems overjoyed with the result. A dubious Blanstyr inspects your work, and is amazed that the principles of another discipline could be so effectively applied to armorcraft. Continue to improve at your trade that you might provide a less life-threatening example for the old armorer to follow.<br><br>※The next armorer quest will be available from Blanstyr upon reaching level 55."],"objectives":["Speak with Benathaire.","Consult with Geva at the Leatherworkers' Guild.","Consult with Beatin at the Carpenters' Guild.","Report to H'naanza at the Armorers' Guild.","<span class=\"alternative-container\"><span class=\"alternative\">Forge a titanium mask of striking</span><span class=\"alternative\">Deliver the titanium mask of striking to Benathaire</span></span>."],"dialogue":[{"name":"BLANSTYR","text":"Ye still willin' to swing that hammer for me, <span class=\"highlight\">Forename</span>? Truth is, I've gotten meself into a bit of a bind..."},{"name":"BLANSTYR","text":"Do ye recall them 'venturers what saved me from that unholy rat? Well, they've commissioned me to craft a piece for 'em. An' as much as I'm tryin' to understand their needs, the request has got me as baffled as a nugget-brained novice."},{"name":"BLANSTYR","text":"Maybe ye should talk to this Benathaire bloke, an' hear the details directly. He should still be waitin' over by the Wench."},{"name":"BLANSTYR","text":"Head over to the Wench an' talk to Benathaire. Maybe ye can make more sense o' his request than I could..."},{"name":"BENATHAIRE","text":"Greetings. You are Master Blanstyr's assistant, then?"},{"name":"BLANSTYR","text":"Aye, that's right─me <span class=\"emphasis\">assistant</span>. Thought <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> should hear the job direct from the customer's mouth."},{"name":"BENATHAIRE","text":"Very well. We mean to challenge a creature of significant might, and seek to seize every advantage. To that end, I would commission a quality piece of head protection for our monk, Sasapiku here..."},{"name":"SASAPIKU","text":"“Sasapiku the Snake,” they call me! I gotta strike swift an' deadly, an' can't be wearin' no heavy helmets. Cramps me style, ye know?"},{"name":"BENATHAIRE","text":"'Twas a trial to even convince him to wear body armor... Thus, I must ask that you craft a helm sturdy enough to afford protection, but also light enough that Sasapiku scarcely remembers he's wearing it."},{"name":"BLANSTYR","text":"Do ye see what I mean, <span class=\"highlight\">Forename</span>!? An impossible request!"},{"name":"HNAANZA","text":"A vow to consider your clients' needs has barely passed your lips, and already you cry defeat?"},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"HNAANZA","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"Ugh, what do ye want, H'naanza? If ye've come to feed on me misery like some self-righteous leech, then ye can bloody well bugger off."},{"name":"HNAANZA","text":"I came because I can't countenance you throwing a commission back in a customer's face after you've arbitrarily labeled it “impossible.” I'd wager <span class=\"highlight\">Forename</span> here could forge a piece to meet those specifications."},{"name":"HNAANZA","text":"When it comes to crafting light and serviceable armor, both leatherworkers and carpenters have a wealth of experience. I suggest you head to Gridania, and seek the advice of their respective guildmasters."},{"name":"BLANSTYR","text":"An' what would they bloody know!? They don't even work with the same materials! Yer wastin' yer time, <span class=\"highlight\">Forename</span>...but I'll let ye make up yer own mind."},{"name":"HNAANZA","text":"Is that the only way he can ask for help? Proud, insufferable old aldgoat. Show him how a proper artisan handles such requests, <span class=\"highlight\">Forename</span>."},{"name":"BENATHAIRE","text":"'Twould seem the job is now yours, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>...<span class=\"highlight\">Forename</span>, was it? I am excited to see the result of your labors."},{"name":"BLANSTYR","text":"Yer wastin' yer time, <span class=\"highlight\">Forename</span>...but I'll let ye make up yer own mind."},{"name":"BENATHAIRE","text":"We shall remain here until the piece is ready...although staying in one place is not exactly Sasapiku's strong suit."},{"name":"HNAANZA","text":"Pay a visit to the leatherworkers and carpenters of Gridania. I'm certain their guildmasters will be glad to share some tricks of the trade with you."},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"GEVA","text":"You, an armorer, have come to ask <span class=\"emphasis\">my</span> advice? I cannot tell you how to treat metal as I would treat leather, but when I craft, I begin by removing every element not essential to the design."},{"name":"GEVA","text":"This approach also respects the life that was taken for the material, by making the most of every strip and square. ...In this case, however, you may simply need to take care that you have not added unnecessary weight in your quest for sturdiness."},{"name":"GEVA","text":"Branching out into other disciplines, <span class=\"highlight\">Forename</span>? If you'll recall my Geva patterns, you already have the answer to your question: always craft with an eye toward minimal waste."},{"name":"GEVA","text":"This approach also respects the life that was taken for the material, by making the most of every strip and square. ...In this case, however, you may simply need to take care that you have not added unnecessary weight in your quest for sturdiness."},{"name":"BEATINE","text":"It is rare that I smell the stench of the forge in my guild─and rarer still that an armorer comes to me for assistance. But I believe I can help you. Before one puts saw to wood, one must first consider which variety of lumber best suits the properties of the piece one wishes to craft."},{"name":"BEATINE","text":"The same can likely be said of armorcraft. Amongst the many metals available, surely there is one that retains its strength even when beaten sufficiently thin to meet your needs?"},{"name":"BEATINE","text":"A metal helm? Ah, I thought I detected the stench of the forge about you, <span class=\"highlight\">Forename</span>. I must admit to feeling somewhat betrayed..."},{"name":"BEATINE","text":"But I shall not be so petty as to deny you answers, child. As you well know, before one even puts saw to wood, one must first consider which variety of lumber best suits the properties of the piece one wishes to craft."},{"name":"BEATINE","text":"The same can likely be said of armorcraft. Amongst the many metals available, surely there is one that retains its strength even when beaten sufficiently thin to meet your needs?"},{"name":"HNAANZA","text":"Well, what did our artisan colleagues have to say?"},{"name":"HNAANZA","text":"...So, in other words, keep it simple, and choose a light, sturdy metal. Not exactly revolutionary ideas, but certainly fine points to keep in mind. Hmmm, if we're talking minimalism, then our best option is probably a mask of some kind."},{"name":"HNAANZA","text":"As for the material, titanium would be the strongest for its weight. Finally, the overall design should complement the swift striking style of your client. Hammer out the piece, and deliver it to Benathaire."},{"name":"HNAANZA","text":"Forge the lightest, sturdiest mask you can, and take the finished piece to Benathaire. Considering the eventual recipient, I'd suggest going with a design that complements the swift striking style of your client."},{"name":"BENATHAIRE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, 'tis good to see you. You have brought the armor we requested?"},{"name":"BLANSTYR","text":"Ugh, ye actually crafted summat for 'em? Let's see this impossible piece o' yers, then."},{"name":"BLANSTYR","text":"Is...is this titanium? It's so thin, but ye've shaped the mask so the arcs and curves reinforce the weak points. It's bloody genius!"},{"name":"SASAPIKU","text":"I love it! I can jump an' spin an' barely feel the weight at all!"},{"name":"BENATHAIRE","text":"I am most grateful, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Now we needn't fear a stray spike or claw slicing open our dear monk's face. Mayhap we shall call upon your services again in the future."},{"name":"BLANSTYR","text":"I reckoned ye was on a fool's errand, talkin' to those other guildmasters. But look at what ye accomplished. ...Seems me eyes ain't been opened as wide as I'd thought."},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":866,"items":[{"num":160,"id":9},{"id":11923},{"id":11961,"one":1},{"id":11966,"one":1},{"id":11974,"one":1},{"id":11979,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":11}],"quests":[67574]},"next":[67576]},"partials":[{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1012518","obj":{"i":1012518,"n":"Benathaire","l":28,"q":3}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"item","id":"11923","obj":{"i":11923,"n":"Mythrite Pliers","l":90,"c":35257,"t":17}},{"type":"item","id":"11961","obj":{"i":11961,"n":"Holy Rainbow Coatee","l":80,"c":42469,"t":35,"p":9884}},{"type":"item","id":"11966","obj":{"i":11966,"n":"Holy Rainbow Gloves","l":80,"c":48264,"t":37,"p":7096}},{"type":"item","id":"11974","obj":{"i":11974,"n":"Holy Rainbow Bottoms","l":80,"c":45692,"t":36,"p":7603}},{"type":"item","id":"11979","obj":{"i":11979,"n":"Holy Rainbow Shoes","l":80,"c":46540,"t":38,"p":8110}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"10756","obj":{"i":10756,"n":"Titanium Mask of Striking","l":133,"c":40453,"t":34,"p":19905}},{"type":"quest","id":"67574","obj":{"i":67574,"n":"The Breaking of Blanstyr","g":138,"l":"Limsa Lominsa","s":502,"f":1}},{"type":"quest","id":"67576","obj":{"i":67576,"n":"Fancy Lancer","g":138,"l":"Limsa Lominsa","s":550,"f":1}}]}