{"quest":{"name":"Wait on Me","location":"Limsa Lominsa","id":67579,"patch":3.0,"sort":502,"icon":100451,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1012568,"involved":[1012569],"genre":143,"journal":["Lyngsath has a mind to set you up with a new challenge.","An acquaintance of Lyngsath's requires the services of a consummate culinarian, and the guildmaster believes that you are the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job. If the prospect of a new challenge piques your interest, head over to the Missing Member and present yourself to the head waitress, one Melkoko.","In the same breath, Melkoko introduces herself and informs you of the task she would have you undertake: participating in the Dellemont d'Or, the most prestigious of all cooking contests. The winner of the previous edition, she reveals, is none other than the Missing Member's head chef, a man named H'mhasi Tia, of whom she is none too fond. She bids you speak with the fellow inside the tavern, that you might understand her aversion towards him.","A moment with H'mhasi Tia is all it takes for you to appreciate Melkoko's sentiments. But whatever else the man may be, he is supremely confident of winning the Dellemont d'Or for a second consecutive time. Return to Melkoko and report the details of the encounter to her.","With H'mhasi Tia's detestable personality thus established, Melkoko reveals to you her motive for having you enter the Dellemont d'Or: she wants you to beat the arrogant culinarian and put him in his place. Whether or not you share her enthusiasm for poetic justice, you are bound to gain something by pitting your skills against other culinarians.<br><br>※The next culinarian quest will be available from Melkoko upon reaching level 53."],"objectives":["Speak with Melkoko.","Speak with H'mhasi Tia.","Report to Melkoko."],"dialogue":[{"name":"LYNGSATH","text":"Well, if it ain't <span class=\"highlight\">Forename</span>! Ever a sight fer sore eyes, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>. Ye've been keepin' at the cookin', I shouldn't doubt."},{"name":"LYNGSATH","text":"Skilled as ye are, though, I reckon it's a struggle fer ye to keep things interestin'. If that's the case, an' yer 'ankerin' fer a challenge, might be as I can introduce ye to someone."},{"name":"LYNGSATH","text":"Ye knows the Missin' Member? It's the tavern what's owned by Rhoswen, the lady cap'n o' the Sanguine Sirens. 'Er entire crew's formed o' members o' the gentler sex, though “gentle” ain't a word I'd ever use to describe that lot."},{"name":"LYNGSATH","text":"Anyroad, the 'ead waitress there's got a task what calls fer a consummate culinarian, an' yers was the first name what came to mind."},{"name":"LYNGSATH","text":"If ye reckon ye might be interested, take yerself over to the Missin' Member an' make yerself known to Melkoko. She'll tell ye what she needs doin'."},{"name":"LYNGSATH","text":"If yer 'ankerin' fer a challenge, take yerself over to the Missin' Member an' make yerself known to Melkoko. She's got a task what calls fer a consummate culinarian."},{"name":"HMHASITIA","text":"Here to dine, are you? Too bad─I cook only for the Sirens or guests with reservations."},{"name":"MELKOKO","text":"Greetings and welcome to the Missing Member! Do you have a reservation, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"MELKOKO","text":"You're <span class=\"highlight\">Forename</span> of the Culinarians' Guild!? It's a pleasure to finally make your acquaintance! Lyngsath has told me all about you!"},{"name":"MELKOKO","text":"I'm Melkoko, the head waitress of this fine establishment, and I'd like you to participate in the Dellemont d'Or, the most prestigious of all cooking contests!"},{"name":"MELKOKO","text":"You see, the winner of the previous edition of the contest is none other than our head chef, H'mhasi Tia, and he's a right bloody bastard! ...A-Ahem. What I meant to say was, he is an insufferable man."},{"name":"MELKOKO","text":"But don't take my word for it. Speak with him for yourself, and you'll understand. You'll find him inside the restaurant, doubtless with a self-satisfied look on his face."},{"name":"MELKOKO","text":"Speak with H'mhasi Tia yourself, and you'll understand. You'll find him inside the restaurant, doubtless with a self-satisfied look on his face."},{"name":"LYNGSATH","text":"...The Dellemont d'Or? Aye, that's just the challenge fer ye. I don't know why it didn't occur to me afore."},{"name":"HMHASITIA","text":"Here to dine, are you? Too bad─I cook only for the Sirens or guests with reservations."},{"name":"HMHASITIA","text":"I am busy training for the award ceremony of the Dellemont d'Or. As this will be my second victory running, expectations will be higher than ever."},{"name":"HMHASITIA","text":"Shall I play the unassailable champion, carefree as you please? Or shall I be sentimental in triumph, and shed tears of joy? No, wait. Now that I think on it, I could also show disgust at the lack of sport. Ahhh, there're just too many ways to win!"},{"name":"MELKOKO","text":"I trust you now understand my meaning. Every word of his fairly oozes conceit, and it makes me want to shove a hot skillet down 'is smirkin' bung'ole!"},{"name":"MELKOKO","text":"B-Beg your pardons for the language. I forget myself sometimes."},{"name":"MELKOKO","text":"Now, as much as I hate to admit it, H'mhasi Tia is very good at what he does. Otherwise he wouldn't have won the Dellemont d'Or in the first place, nor would Captain Rhoswen have hired him to treat her crew."},{"name":"MELKOKO","text":"Word of his culinary skills has since gotten out to the locals, and our place is now constantly booked out moons ahead."},{"name":"MELKOKO","text":"But all the fame and attention went to H'mhasi Tia's head, and these days he swaggers about as though he were the Twelve's gift to our taste buds. Why, if he doesn't like the look of a patron, he'll refuse to cook for them, and that's assuming he even turns up to work! Can ye believe the gall o' this whoreson!?"},{"name":"MELKOKO","text":"Oh, but there I go again with my cussing! You must forgive me!"},{"name":"MELKOKO","text":"At any rate, I trust you now understand why I want you to enter the Dellemont d'Or: so you can beat H'mhasi Tia and put him in his place! Ah, such a heaping helping of poetic justice it will be!"},{"name":"MELKOKO","text":"You've gotten the best of even the Chefsbane. I'm confident that you have what it takes to win. And lest you worry, the contest won't be for a while yet, so you should have ample time to prepare. I'll have more details for you before long─please come by again!"},{"name":"SYSTEM","text":"The next culinarian quest will be available from Melkoko upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"gil":461,"items":[{"num":120,"id":8},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":16}],"questsType":"all","quests":[65806,65964]},"next":[67580]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1012568","obj":{"i":1012568,"n":"Melkoko","l":28,"q":6}},{"type":"npc","id":"1012569","obj":{"i":1012569,"n":"H'mhasi Tia","l":28,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"65806","obj":{"i":65806,"n":"Revenge of the Chefsbane","g":143,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67580","obj":{"i":67580,"n":"A Spoonful Less Sugar","g":143,"l":"Limsa Lominsa","s":530,"f":1}}]}