{"quest":{"name":"All According to Plan","location":"Coerthas Western Highlands","id":67572,"patch":3.0,"sort":580,"icon":100433,"unlocksFunction":1,"eventIcon":71341,"issuer":1014068,"target":1015055,"involved":[1011233,1014069,1014070,1014071,1014072,1014073,1014074,1014075,1014076,1014084,1014088,1014089],"genre":147,"journal":["Constaint has decided on a new course of action.","Rather than attempting to retrace Solkzagyl's steps, Constaint has decided that it would be better to simply pursue Death's Embrace, as they are the ones in possession of Oathkeeper. Before he embarks upon this venture, however, there is one matter he would like to discuss with Hundred Eyes, the man who buried his master...","Constaint begins to question Hundred Eyes about his master's death, but the craftsman brusquely refuses to answer, stating simply that he buried him, and that he needs not know anything else. The boy apologizes for asking and leaves to seek out someone who might know the whereabouts of Death's Embrace.","According to Emerissel, the assassins-turned-bandits have not been seen in western Coerthas for quite some time. Upon learning that the men you seek are Ul'dahn, the Ishgardian is inspired to regale you with a tale of southron idiocy, namely a gang of Ul'dahns who managed to sneak aboard the airships which travel regularly to Camp Cloudtop. The Ul'dahns then attempted to seize the <span class=\"emphasis\">Protector</span>, despite the fact that the airship is not fit for travel. Suspecting this to be a serendipitous coincidence─and having no other leads whatsoever─Constaint suggests that you go and investigate the incident at Camp Cloudtop.","House Haillenarte is preparing to hunt down the bandits responsible for the attack, and your assistance with the operation is more than welcome. Join the assembled knights at the Rosehouse.","Having learned of House Haillenarte's plans, the Ul'dahns have fled to the east. The commanding officer bids everyone advance with caution, as these are dangerous men desperate to survive.","Though the knights manage some success against the former assassins, you must nevertheless come to their aid. One search party is no longer in danger, but the other is nowhere to be seen...","Constaint and his search party are able to defeat most of the remaining enemies, but they are unable to subdue the bandits' leader. You, however, have no such trouble. Afterwards, you are surprised to discover a pair of gallant gauntlets amongst the man's possessions...","The House Haillenarte knight thanks you for your contribution and leaves to inform Lady Laniaitte of your success. Constaint is beaming with pride, yet how will he react when you show him the gauntlets you found?","Constaint is at a loss. There is no possible explanation for how the gauntlets came to be in the assassin's possession. That they were cannot be denied, however...so what could it possibly mean?","Given the manner in which they have been struggling to survive, Constaint is forced to conclude that Death's Embrace no longer has Oathkeeper. Surely they would have sold it rather than resort to banditry, he considers. Yet even more disconcerting are the gallant gauntlets, which fit Constaint perfectly─as he suspected they would...<br><br>※The next paladin quest will be available from Constaint upon reaching level 60."],"objectives":["Speak with Constaint.","Speak with Emerissel.","Speak with the House Haillenarte squire at Camp Cloudtop.","Speak with the House Haillenarte knight at the Rosehouse.","Search for the Death's Embrace assassins in the Wisent Herd.","Speak with the House Haillenarte knight.","Present the gallant gauntlets to Constaint.","Speak with Constaint in Falcon's Nest."],"dialogue":[{"name":"CONSTAINT","text":"I'm beginning to think I've been going about this the wrong way, <span class=\"highlight\">Forename</span>."},{"name":"CONSTAINT","text":"I've been trying to determine the whereabouts of Oathkeeper by retracing Solkzagyl's steps, but honestly, <span class=\"emphasis\">how</span> he came to pursue and die at the hands of Death's Embrace isn't nearly as important as the simple fact that he did."},{"name":"CONSTAINT","text":"Death's Embrace has the sword. It's the only logical conclusion. So if we find them, we find Oathkeeper."},{"name":"CONSTAINT","text":"And even if I'm mistaken, we'd be doing the world a favor by bringing them to justice."},{"name":"CONSTAINT","text":"I wouldn't presume to speak for Solkzagyl, but I'd like to think that he'd agree. Don't you?"},{"name":"CONSTAINT","text":"Yes, well...I suppose if we're going to find them, we had best start asking around."},{"name":"CONSTAINT","text":"Though there is one thing which still troubles me. I think I need to speak with Hundred Eyes..."},{"name":"HUNDREDEYES","text":"Whatever it is, it can wait. I've work to do and no time to do it."},{"name":"CONSTAINT","text":"A moment of your time, if it please..."},{"name":"HUNDREDEYES","text":"For you, Constaint? Sure, sure."},{"name":"CONSTAINT","text":"It's about Solkzagyl. He... You never told me, but...how exactly did he die?"},{"name":"HUNDREDEYES","text":"You want me to paint you a bloody picture? He was murdered. I found him, and I buried him. That's all you need to know."},{"name":"CONSTAINT","text":"It's just that, the other day, I could have sworn that I..."},{"name":"CONSTAINT","text":"...Forgive me. I don't know what I was thinking. Don't let me keep you from your labors."},{"name":"CONSTAINT","text":"Let us resume our hunt for Death's Embrace."},{"name":"CONSTAINT","text":"Maybe Emerissel can tell us something of value?"},{"name":"EMERISSEL","text":"Death's Embrace? Those bandits who used to raid caravans bound for Tailfeather? No one's seen neither hide nor hair of them recently. Why do you ask?"},{"name":"EMERISSEL","text":"Ul'dahns, eh? Maybe they ran back to warmer climes!"},{"name":"EMERISSEL","text":"Never understood southrons myself. Queer folk, prone to inexplicable and irrational behavior. Like those buffoons who attempted to seize the <span class=\"emphasis\">Protector</span>, of all things!"},{"name":"EMERISSEL","text":"Apparently they snuck aboard some of the airships ferrying supplies to Camp Cloudtop. Of course, the knights drove them off. Last I heard, they had fled into the wilds screaming “Thal's balls” this and “swivin' whoresons” that."},{"name":"CONSTAINT","text":"...Are you thinking what I'm thinking, <span class=\"highlight\">Forename</span>?"},{"name":"CONSTAINT","text":"Admittedly, we've no reason to believe these men are the ones we seek, but we've been blessed with serendipity before. There's no harm in investigating, at least."},{"name":"CONSTAINT","text":"This fellow looks rather well-informed. Let's see what he knows."},{"name":"EMERISSEL","text":"You don't suppose those Ul'dahns who tried to seize the <span class=\"emphasis\">Protector</span> are the selfsame ones you seek, do you? Be awfully convenient if that were the case, but stranger things have been known to happen."},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)The Ul'dahns who tried to seize the <span class=\"emphasis\">Protector</span>? Aye, I remember them. Baffling, really."},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)Signed their own death warrants with their ill-conceived attack. You can be sure that House Haillenarte won't allow them to leave these isles alive."},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)Death's Embrace, eh? I suppose it's possible they're the bandits you seek. You're welcome to help us hunt them down, if you like."},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)The boy too, yes? He can join my unit. Given your reputation, I think you better suited to the van."},{"name":"CONSTAINT","text":"I won't let you down!"},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)We gather at the Rosehouse. Come─let us delay no further!"},{"name":"CONSTAINT","text":"I'll see you there!"},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)I'll look after him, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"CONSTAINT","text":"How exciting!"},{"name":"HAILLENARTEKNIGHTB","text":"(-House Haillenarte Knight-)Glad to have you with us, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Would that we could speak at length, but the Ul'dahns are aware of our plans and have already fled to the east."},{"name":"HAILLENARTEKNIGHTB","text":"(-House Haillenarte Knight-)Remember that these are desperate, dangerous men! Advance with caution and wait for reinforcements if necessary. With me!"},{"name":"HAILLENARTEKNIGHTA","text":"(-House Haillenarte Squire-)Forgive me, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, but we can go no further!"},{"name":"BALLOON","text":"Not here! Not like this!"},{"name":"HAILLENARTEKNIGHTB","text":"(-House Haillenarte Knight-)We...we have them trapped!"},{"name":"CONSTAINT","text":"Be careful, <span class=\"highlight\">Forename</span>! He's bound a voidsent to his will!"},{"name":"CONSTAINT","text":"We did what we could, but we simply haven't the strength..."},{"name":"HAILLENARTEKNIGHTB","text":"(-House Haillenarte Knight-)Well fought, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Their leader was surely the toughest of the lot."},{"name":"HAILLENARTEKNIGHTB","text":"Lady Laniaitte will be pleased to learn of our success. I shall inform her at once!"},{"name":"CONSTAINT","text":"That was amazing, <span class=\"highlight\">Forename</span>!"},{"name":"CONSTAINT","text":"Hm? What have you got there?"},{"name":"CONSTAINT","text":"Gallant gauntlets!? Why would a member of Death's Embrace be carrying these?"},{"name":"CONSTAINT","text":"...There's no way he could have possibly planned this. It's too elaborate─nay, impossible! But what other explanation could there be?"},{"name":"CONSTAINT","text":"We should return to Falcon's Nest..."},{"name":"CONSTAINT","text":"Before we cornered the leader, we came across their camp."},{"name":"CONSTAINT","text":"It was plain to see that they had fallen on hard times, hence why they resorted to common banditry to survive."},{"name":"CONSTAINT","text":"But isn't it strange when you think about it? I mean, if they had Oathkeeper, why not simply sell it? Surely someone would have been willing to pay for it."},{"name":"CONSTAINT","text":"I'm beginning to wonder if Solkzagyl succeeded in reclaiming the sword─or if Death's Embrace ever had it at all..."},{"name":"CONSTAINT","text":"And by the Fury, what to make of these pieces of armor..."},{"name":"CONSTAINT","text":"Just as I suspected─it fits perfectly."},{"name":"CONSTAINT","text":"Whatever remnants of Death's Embrace there may be will stay in hiding for some time, I should think. But should they dare to reveal themselves, we will finish what we started...as Solkzagyl intended."}],"reward":{"gil":1581,"action":3541,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":20}],"quests":[67571]},"next":[67573]},"partials":[{"type":"npc","id":"1014068","obj":{"i":1014068,"n":"Constaint","l":2200,"q":2}},{"type":"npc","id":"1015055","obj":{"i":1015055,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1011233","obj":{"i":1011233,"n":"Emerissel","l":2200,"q":6}},{"type":"npc","id":"1014069","obj":{"i":1014069,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1014070","obj":{"i":1014070,"n":"Hundred Eyes","l":2200,"q":1}},{"type":"npc","id":"1014071","obj":{"i":1014071,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1014072","obj":{"i":1014072,"n":"House Haillenarte Squire","l":2100,"q":1}},{"type":"npc","id":"1014073","obj":{"i":1014073,"n":"House Haillenarte Squire","l":2100,"q":1}},{"type":"npc","id":"1014074","obj":{"i":1014074,"n":"Constaint","l":2100,"q":1}},{"type":"npc","id":"1014075","obj":{"i":1014075,"n":"House Haillenarte Knight","l":2100,"q":1}},{"type":"npc","id":"1014076","obj":{"i":1014076,"n":"Constaint","l":2100,"q":1}},{"type":"npc","id":"1014084","obj":{"i":1014084,"n":"House Haillenarte Squire","l":2100,"q":1}},{"type":"npc","id":"1014088","obj":{"i":1014088,"n":"House Haillenarte Knight","l":2100,"q":1}},{"type":"npc","id":"1014089","obj":{"i":1014089,"n":"Constaint","l":2100,"q":1}},{"type":"action","id":"3541","obj":{"i":3541,"n":"Clemency","c":2509,"j":19,"t":2,"l":58}},{"type":"quest","id":"67571","obj":{"i":67571,"n":"Hey Soul Crystal","g":147,"l":"Coerthas Western Highlands","s":560,"f":1}},{"type":"quest","id":"67573","obj":{"i":67573,"n":"This Little Sword of Mine","g":147,"l":"Coerthas Western Highlands","s":600,"f":1}}]}