{"quest":{"name":"Fancy Lancer","location":"Limsa Lominsa","id":67576,"patch":3.0,"sort":550,"icon":100452,"unlocksFunction":1,"eventIcon":71341,"issuer":1001001,"target":1012518,"involved":[1001000,1003818,1004093],"genre":138,"usedItems":[10721],"journal":["Blanstyr is seething with barely contained fury.","Blanstyr is trembling with anger after the armor he crafted was rejected by Benathaire's companion. The old artisan admits to losing his temper, and walking away from the conjurer's commission. Seek out Benathaire at the Drowning Wench, and learn the details of the request.","Benathaire greets you enthusiastically, and seems more than pleased to have you take over the commission. He explains that Barberella, the party's lancer, is loath to fight in any armor that doesn't meet her standards for style. Consult with H'naanza, and discuss how you might best meet your client's wishes.","Upon hearing the aesthetic nature of the commission, H'naanza suggests that you seek the advice of experts in the field of fashion. Head to Ul'dah, and consult with Serendipity of the Goldsmiths' Guild, and Redolent Rose of the Weavers' Guild.","Serendipity and Redolent Rose gladly offer you suggestions on how you might elevate the beauty of your craft while still maintaining its durability. Return to the Armorers' Guild and report to H'naanza.","You return to the forgemaster with the advice of the Ul'dahn artisans. H'naanza muses over their ideas for a moment before outlining the design of a piece that fulfills the requirements of your client's request. Forge a high-quality titanium cuirass of maiming, and deliver the finished item to Benathaire at the Drowning Wench.","You bring the cuirass to the expectant Benathaire, and Barberella wastes no time in donning your creation. Blanstyr arrives to inspect the exuberant lancer's new armor, and seems astonished at your accomplishment. Swallowing his pride for the sake of his craft, the old armorer vows to visit H'naanza, and beg for the wisdom of her experience. Continue to work at Blanstyr's side as you both seek to improve in your chosen trade.<br><br>※The next armorer quest will be available from Blanstyr upon reaching level 58."],"objectives":["Speak with Benathaire.","Speak with H'naanza.","Consult with Serendipity at the Goldsmiths' Guild.","Consult with Redolent Rose at the Weavers' Guild.","Report to H'naanza at the Armorers' Guild.","<span class=\"alternative-container\"><span class=\"alternative\">Forge a titanium cuirass of maiming <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the titanium cuirass of maiming <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Benathaire</span></span>."],"dialogue":[{"name":"BLANSTYR","text":"What d'ye want? More work, is it? Well, I took another job from that conjurer an' his mates─summat for the lancer, this time. Did me best, I did─forged an' reforged until I thought I had a piece the client'd be pleased with."},{"name":"BLANSTYR","text":"But she took one look at me work, an' turned her bloody nose up at it! “Not pretty enough,” she says! So I told 'em they can take their fancy lancer, an' toss her into the damn sea!"},{"name":"BLANSTYR","text":"Benathaire's still lurkin' near the Wench, but I doubt even you could satisfy that over-particular, pig-stickin' lass o' his..."},{"name":"BLANSTYR","text":"Ye'll find me “customers” over by the Wench. If ye want to share the commission─an' the frustration─then be me bloody guest."},{"name":"BENATHAIRE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, I had hoped you would be along. Your colleague appears to have abandoned our commission in a fit of pique, and left poor Barberella here bereft of her promised armor."},{"name":"BENATHAIRE","text":"（★未使用／削除予定★）"},{"name":"BARBERELLA","text":"Oh, he made me some armor, all right, but the style was absolutely <span class=\"emphasis\">dreadful</span>. How can I possibly perform legendary deeds looking like an oversized kettle? Imagine the portraits they would paint. Imagine the <span class=\"emphasis\">sculptures</span>!"},{"name":"BENATHAIRE","text":"As you can see, she is quite particular about her appearance. Thus I would task you with crafting her a cuirass that is as eye-catching as it is unyielding."},{"name":"BENATHAIRE","text":"Mayhap Forgemaster H'naanza would deign to offer her experienced opinion, as she did the last time?"},{"name":"BENATHAIRE","text":"Have you spoken with Forgemaster H'naanza? Mayhap she could provide you a more reasoned opinion than your volatile colleague..."},{"name":"BLANSTYR","text":"If ye want to share the frustration o' that ridiculous commission, then be me bloody guest."},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"HNAANZA","text":"...So we're aiming for fashionable and functional? That takes us into the realm of goldsmiths and weavers. You'd best head to Ul'dah and call upon the wisdom of their guildmasters."},{"name":"HNAANZA","text":"Take yourself to Ul'dah, and speak with the guildmasters of the goldsmiths and the weavers. Making things look “pretty” is at the core of their trade."},{"name":"BENATHAIRE","text":"Barberella insists that her armor be both unyielding as well as eye-catching. I only ask that you do your best."},{"name":"REDOLENTROSE","text":"...Fashionable armor, you say? How strange─I but recently spoke on the subject with a rugged Roegadyn fellow. He seemed a tad embarrassed to be asking, but listened with an earnest enthusiasm nonetheless."},{"name":"REDOLENTROSE","text":"I fear I become rather passionate in my instruction, and lectured overlong on the merits of form versus function."},{"name":"REDOLENTROSE","text":"...But to return to your query, I would ask that you consider the use of color in your designs. And not simply the choice of hue─even the same shade can have a drastically different impact when enhanced with a lustrous, glossy sheen."},{"name":"REDOLENTROSE","text":"<span class=\"highlight\">Forename</span>, you seek to apply the sensibilities of weaving to your efforts in armorcraft? How strange─I but recently spoke on a similar subject to a rugged Roegadyn fellow. He seemed a tad embarrassed to be asking, but listened with an earnest enthusiasm nonetheless."},{"name":"REDOLENTROSE","text":"I fear I become rather passionate in my instruction, and lectured overlong on the merits of form versus function."},{"name":"REDOLENTROSE","text":"...But to return to your query, I would ask that you consider the use of color in your designs. And not simply the choice of hue─even the same shade can have a drastically different impact when enhanced with a lustrous, glossy sheen."},{"name":"SERENDIPITY","text":"You wish to craft armor that is both splendid and serviceable? Hmmm. The Sultansworn once wore ceremonial plate that featured the most extravagant embellishments."},{"name":"SERENDIPITY","text":"But such delicate adornments would not long survive the harsh demands of combat."},{"name":"SERENDIPITY","text":"What you might consider, then, is decorating the parts of your armor that are less likely to be struck─the edges and hollows, for example. At least, that is what I would do."},{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! Thinking of adding precious metals to your endeavors in armorcraft, are you? Hmmm. Well, the Sultansworn once wore ceremonial plate that featured the most extravagant embellishments."},{"name":"SERENDIPITY","text":"But such delicate adornments would not long survive the harsh demands of combat."},{"name":"SERENDIPITY","text":"What you might consider, then, is decorating the parts of your armor that are less likely to be struck─the edges and hollows, for example. At least, that is what I would do."},{"name":"HNAANZA","text":"Well? What did the artisans of Ul'dah have to say?"},{"name":"HNAANZA","text":"...I see. Then I would suggest a darker hue for the main surface, burnished until it gleams. Decorate the edges with a brighter metal─rose gold should do nicely─to provide an eye-catching contrast."},{"name":"HNAANZA","text":"Again, titanium is a fine choice for durability and strength. This was for Benathaire's lancer companion, yes? Then forge a cuirass fit for a queen, and your client shall soon be maiming her enemies in style."},{"name":"HNAANZA","text":"If a finely crafted cuirass of quality titanium and pure rose gold does not satisfy your client, then I don't know what will."},{"name":"BENATHAIRE","text":"How is Barberella's armor coming along?"},{"name":"BLANSTYR","text":"Don't tell me ye forged summat the spear-wieldin' she-demon actually approves of!? Hold still a moment!"},{"name":"BLANSTYR","text":"It's so simple! ...But the rose gold gives it that hint of extravagance. Ye've outdone yerself, <span class=\"highlight\">Forename</span>..."},{"name":"BARBERELLA","text":"Aye, and I especially love the colors! This might be the most beautiful cuirass I've ever owned!"},{"name":"BENATHAIRE","text":"My thanks, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Aside from the armor's obvious beauty, I can see it has been carefully crafted to withstand the rigors of combat. Now that you have addressed my concerns with Barberella, that only leaves─"},{"name":"WANNMAGA","text":"Ugh, is this why you've called me here? To spend more of your coin on gear we don't need?"},{"name":"BENATHAIRE","text":"Wannmaga, you should be the first in line when it comes time to replace our equipment. Our lives depend on your ability to engage the foe face-to-face. You <span class=\"emphasis\">need</span> new armor."},{"name":"WANNMAGA","text":"The suit I have serves me just fine. You should look to your own abilities, healer. If you weren't so sluggish with your spells, then maybe we wouldn't have to rely on expensive armor to save our hides."},{"name":"BENATHAIRE","text":"Sluggish!? How many times have I saved you from the brink of death!? 'Tis your seeming fondness for injury that forces me to consult with armorers in the first place!"},{"name":"WANNMAGA","text":"You think I enjoy being wounded!? How many times have I risked my life to save yours!? ...If this is the thanks I can expect, then you can try fighting without me!"},{"name":"BENATHAIRE","text":"Walk away, then! We shall find a replacement soon enough..."},{"name":"BARBERELLA","text":"The way they argue now, you'd not think they'd been friends since childhood..."},{"name":"BLANSTYR","text":"Hmph. Looks like 'venturers have their own problems, eh?"},{"name":"BLANSTYR","text":"But I'd have to say, findin' the right armorer to craft their ridiculous requests ain't one of 'em. Yer work was masterful."},{"name":"BLANSTYR","text":"I tried, <span class=\"highlight\">Forename</span>, I really did─even begged that weaver bloke in Ul'dah to teach me summat about design. But it seems I've a lot more to learn afore I become the sort of artisan what understands his customers' needs."},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"H'naanza's the one I should really be talkin' to."},{"name":"BLANSTYR","text":"As forgemaster, she's had years of experience in craftin' to meet a client's wishes."},{"name":"BLANSTYR","text":"If anyone'll know what I gotta improve, it'll be her... Byregot's beard, I never thought the day'd come when I'd fall to me knees to beg for that harpy's help...but it's time I changed me ways."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":913,"items":[{"num":200,"id":9},{"id":11880},{"id":11962,"one":1},{"id":11967,"one":1},{"id":11975,"one":1},{"id":11980,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":11}],"quests":[67575]},"next":[67577]},"partials":[{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1012518","obj":{"i":1012518,"n":"Benathaire","l":28,"q":3}},{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"11880","obj":{"i":11880,"n":"Titanium Ball-pein Hammer","l":100,"c":35218,"t":16,"p":15206}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11967","obj":{"i":11967,"n":"Dhalmelskin Halfgloves of Crafting","l":100,"c":44391,"t":37,"p":11088}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"11980","obj":{"i":11980,"n":"Dhalmelskin Shoes","l":100,"c":46542,"t":38,"p":12672}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"10721","obj":{"i":10721,"n":"Titanium Cuirass of Maiming","l":133,"c":48083,"t":35,"p":28752}},{"type":"quest","id":"67575","obj":{"i":67575,"n":"Light-headed","g":138,"l":"Limsa Lominsa","s":530,"f":1}},{"type":"quest","id":"67577","obj":{"i":67577,"n":"The Reforging of Blanstyr","g":138,"l":"Limsa Lominsa","s":580,"f":1}}]}