{"quest":{"name":"This Little Sword of Mine","location":"Coerthas Western Highlands","id":67573,"patch":3.0,"sort":600,"icon":100433,"unlocksFunction":1,"eventIcon":71341,"issuer":1014092,"target":1014103,"involved":[1014094,1014095,1014096,1014097,1014098,1014099,1014100,1014101,1014102],"genre":147,"journal":["Constaint looks as though he has suffered a tremendous shock.","Hundred Eyes, friend to both Solkzagyl and Constaint, was attacked by a pack of wolves and gravely injured. Constaint went to see him earlier, only to be sent away and told to fetch you, of all people. Attend the injured man and see what he desires.","Resigned to his death, Hundred Eyes asks you to dig up Solkzagyl's grave and give what you find to Constaint. As you look down on the dying man, racked with pain and guilt, you briefly consider pressing him for an explanation, but decide against it for now.","Deep beneath the cold, hard earth, you find not a coffin, but a small chest containing a gallant surcoat. A cry of rage causes you to whirl about, bringing you face-to-face with Constaint, who followed you at a distance. You quickly explain yourself, further confusing the boy. After a moment, he declares that he will have answers from Hundred Eyes and makes for Falcon's Nest.","Alas, whatever Hundred Eyes's reasons were, they will remain forever unknown. The craftsman succumbed to his injuries in your absence, leaving you and Constaint with no one else to press for answers─save for Papashan, who came to Falcon's Nest out of growing concern for your well-being. Stating simply that he must have words with Constaint, he asks that you meet with him at Lancegate, far to the north, and leaves.","You find yourself rather unsurprised by the revelation that Solkzagyl lives, as the former captain reveals himself to be the cloaked man who observed you from atop the cliff at Camp Riversmeet. His was a complex and impenetrable plot to push Constaint towards becoming a paladin and seeking Oathkeeper of his own volition. It is not enough to reclaim Oathkeeper, he states. The sword must be won by a worthy paladin, whose soul is so pure and powerful that all others are driven to yield. However, when two souls cannot reconcile─when one cannot establish dominance, there is but one recourse: a duel. A duel to establish who is truly worthy of Oathkeeper. Though a part of him believes it to be utter nonsense, Constaint is unwilling to renounce his oaths after having come so far─and neither are you.","Though he fights bravely and with conviction, Constaint is clearly no match for you. Yet the true test is yet to come. Jenlyns arrives and accuses Solkzagyl of having already recovered Oathkeeper, and the former captain at last reveals the full extent of his plans: to restore the light of the soul crystal once wielded by the first captain of the Sultansworn. In so doing, Solkzagyl hopes to infuse Oathkeeper with the resplendent light with which it once shone. Donning his armor, he demands that you face him in battle. And so you defeat him as well, establishing dominance over his and Constaint's souls.<br><br>For thirty years, as captain of the Sultansworn, Solkzagyl strove to live up to the example set by the order's founder. For thirty years, he tried to make Oathkeeper shine, as it did for the legendary captains of eld. It did, one day, but only for a fleeting moment─before it was taken from him and he forswore his oaths to reclaim it. Though you are not a true member of the order, he believes that the sword will shine for you. Gingerly taking the sword from his hands, you hold it aloft, and for a moment, the world is bathed in light. In witnessing its resplendence once more, Solkzagyl seems to find a measure of peace.<br><br>The light fades as you hand the sword to Jenlyns, but the captain does not seem to be disappointed. He invites Solkzagyl to return to Ul'dah, and the former captain agrees─though only as a friend and ally, for to leave the order is to leave it forever.","Constaint struggles to say good-bye to Solkzagyl, but the paladin corrects him, stating that his business in Falcon's Nest is hardly finished, and they will meet again soon. Jenlyns, Papashan, and Solkzagyl set out for Ul'dah, and you and Constaint head back towards Falcon's Nest.","Though he has yet to reconcile his feelings towards Solkzagyl, Constaint still intends to be the best free paladin he can be. He bids you farewell, but not before warning you that, should you cross blades again, he means to win.<br><br>※The next paladin quest will be available from Jenlyns once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with the House Durendaire leech.","Dig up Solkzagyl's grave.","Speak with Constaint.","Speak with Papashan.","Speak with Solkzagyl.","Speak with Constaint.","Speak with Constaint in Falcon's Nest.","Defeat Constaint!","Defeat Solkzagyl!"],"dialogue":[{"name":"CONSTAINT","text":"Terrible news, <span class=\"highlight\">Forename</span>! Hundred Eyes has been gravely wounded! There were wolves, and...and he fought them off as best as he could, but by the time the sentries came to his aid..."},{"name":"CONSTAINT","text":"I went to see him earlier, but he turned me away and bid me fetch you. For the life of me, I cannot imagine why..."},{"name":"CONSTAINT","text":"I've no idea what he wishes to discuss with you, but please hurry, for his sake!"},{"name":"DURENDAIREKNIGHT","text":"...I will do what I can to ease his suffering."},{"name":"HUNDREDEYES","text":"(-Hundred Eyes-)&lt;cough&gt; &lt;wheeze&gt; Wolves. Swivin' wolves..."},{"name":"HUNDREDEYES","text":"(-Hundred Eyes-)Reckon I've earned it. &lt;cough&gt; &lt;cough&gt; So. Time to settle one last account."},{"name":"HUNDREDEYES","text":"(-Hundred Eyes-)Go to Solkzagyl's grave. Dig it up. Take what you find and give it to the boy."},{"name":"HUNDREDEYES","text":"(-Hundred Eyes-)Won't make up for what I did to my sworn brothers, but perhaps...it'll go a ways towards redressin' the balance."},{"name":"HUNDREDEYES","text":"(-Hundred Eyes-)&lt;cough&gt; &lt;wheeze&gt; 'Course, what we've done to the boy ain't hardly defensible, no matter what he says..."},{"name":"DURENDAIREKNIGHT","text":"Please, he needs rest..."},{"name":"SYSTEM","text":"Several fulms beneath the cold, hard earth, you find not a coffin, but a small chest containing a gallant surcoat..."},{"name":"CONSTAINT","text":"What have you done!?"},{"name":"CONSTAINT","text":"But...but how can this be!? Why would Hundred Eyes lie to us!?"},{"name":"CONSTAINT","text":"That bastard! I will have answers from him! From them <span class=\"emphasis\">both</span>!"},{"name":"CONSTAINT","text":"Come! We're going back to Falcon's Nest!"},{"name":"PAPASHAN","text":"Rest in peace, brother..."},{"name":"DURENDAIREKNIGHT","text":"He's gone..."},{"name":"CONSTAINT","text":"We're too late..."},{"name":"PAPASHAN","text":"Jenlyns and I had grown worried. That it has come to this..."},{"name":"PAPASHAN","text":"I'm sorry. There was nothing more to be done."},{"name":"CONSTAINT","text":"Gods...godsdammit all!"},{"name":"PAPASHAN","text":"...We must have words, Constaint. I go to Lancegate. Look for me there."},{"name":"CONSTAINT","text":"What was it all for..."},{"name":"CONSTAINT","text":"Here we are..."},{"name":"PAPASHAN","text":"My comrade wishes to explain himself."},{"name":"CONSTAINT","text":"Why the lies, Solkzagyl!? Was this all just some game to you!?"},{"name":"SOLKZAGYL","text":"I had my reasons, as you will soon learn─"},{"name":"PAPASHAN","text":"That's a rather odd way of apologizing, Solkzagyl. I suggest you try again."},{"name":"SOLKZAGYL","text":"...I am sorry for deceiving you, Constaint."},{"name":"CONSTAINT","text":"Faking your death, constructing an elaborate scenario for me to find your armor..."},{"name":"CONSTAINT","text":"To be honest, I'm as astonished as I am offended. How could you have possibly orchestrated everything so perfectly?"},{"name":"SOLKZAGYL","text":"It doesn't matter how I did it. What matters is <span class=\"emphasis\">why</span> I did it."},{"name":"SOLKZAGYL","text":"Oathkeeper is but a sword, Constaint. True oaths are not forged in steel─they are sworn in the heart."},{"name":"SOLKZAGYL","text":"To merely reclaim the sword will not suffice. It must be won by a worthy paladin. Only then will it─and our order─be restored to its former glory."},{"name":"CONSTAINT","text":"I don't understand. Why not simply teach me the ways, as you said you would?"},{"name":"SOLKZAGYL","text":"A sultan may move a man. A master may instruct his pupil. But only when that pupil moves himself can he become a paladin."},{"name":"SOLKZAGYL","text":"...That said, I did not account for <span class=\"highlight\">Forename</span>'s intervention."},{"name":"SOLKZAGYL","text":"Master Papashan, as we discussed."},{"name":"PAPASHAN","text":"...Very well."},{"name":"SOLKZAGYL","text":"The souls we paladins wield are embodiments of our will."},{"name":"SOLKZAGYL","text":"In keeping to our oaths, they grow stronger, more dominant."},{"name":"SOLKZAGYL","text":"In the presence of a particularly pure soul, others may be compelled to yield..."},{"name":"SOLKZAGYL","text":"But when two souls cannot reconcile─when one cannot establish dominance─it can spell disaster."},{"name":"CONSTAINT","text":"...That seems awfully inconvenient."},{"name":"SOLKZAGYL","text":"Oh, you have no idea. As the discordance between two souls grows, the aether builds, and the souls grow unstable."},{"name":"PAPASHAN","text":"Aye, their souls looked as though they were fit to burst with aether."},{"name":"PAPASHAN","text":"Wait. You don't mean to say that their souls will be destroyed, do you?"},{"name":"CONSTAINT","text":"By the Fury! How do we stop it!?"},{"name":"SOLKZAGYL","text":"You fight. Your souls demand it."},{"name":"SOLKZAGYL","text":"You two cannot coexist as you are. One must rise above."},{"name":"CONSTAINT","text":"...That's the stupidest thing I've ever heard."},{"name":"CONSTAINT","text":"We are paladins! Defenders of the weak and needy! What madness is this that we must face each other in battle!?"},{"name":"CONSTAINT","text":"But...if there is truly no other way..."},{"name":"CONSTAINT","text":"I will not renounce my oaths! I will become the paladin I was destined to be! And if that means that we must fight, then so be it!"},{"name":"CONSTAINT","text":"I...I am ready."},{"name":"PAPASHAN","text":"Well, I suppose we must take Solkzagyl's word for it."},{"name":"CONSTAINT","text":"Come, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>!"},{"name":"CONSTAINT","text":"Am I truly so weak...?"},{"name":"SOLKZAGYL","text":"No, Constaint. Nothing could be further from the truth. You fought with honor and purpose. Do not be ashamed."},{"name":"CONSTAINT","text":"Solkzagyl..."},{"name":"JENLYNS","text":"(-???-)Impressive. Truly impressive. Intrigue and deception that would put Lord Lolorito to shame."},{"name":"JENLYNS","text":"Tell them the truth, Solkzagyl. The whole truth."},{"name":"SOLKZAGYL","text":"Figured it out, have you?"},{"name":"SOLKZAGYL","text":"Do you still have the soul I left for you at the Hundred Throes?"},{"name":"CONSTAINT","text":"What? Oh, yes. Here."},{"name":"SOLKZAGYL","text":"This soul once belonged to the first captain of the Sultansworn─the first paladin who wielded Oathkeeper."},{"name":"SOLKZAGYL","text":"Once, it shone with a resplendent light, as did Oathkeeper. But now, both have lost their luster..."},{"name":"SOLKZAGYL","text":"Aye, I have the sword! And everything I have done─that I have made you all do─has been for the sole purpose of making it shine once more!"},{"name":"JENLYNS","text":"Of course. It's so simple!<br>...Wait, no, it's not. It's needlessly complicated."},{"name":"JENLYNS","text":"What of your soul─the one you gave to <span class=\"highlight\">Forename</span> when first you met? I yet have it, Solkzagyl. Take it, and restore Oathkeeper's light with your own!"},{"name":"SOLKZAGYL","text":"...Once a man has left the Sultansworn, he cannot return. My soul will no longer suffice."},{"name":"SOLKZAGYL","text":"All I can do is show another the way, and ask that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> do the same for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> brothers and sisters."},{"name":"SOLKZAGYL","text":"But <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does not yet stand above all others..."},{"name":"SOLKZAGYL","text":"Not until <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has bested me. Draw your sword, <span class=\"highlight\">Forename</span>. The time has come."},{"name":"SOLKZAGYL","text":"At long last...a paladin...who can make it shine again..."},{"name":"SOLKZAGYL","text":"Behold Oathkeeper. Bestowed upon the first captain of the Sultansworn. Stolen under my watch by the minions of the Monetarists."},{"name":"SOLKZAGYL","text":"For years, I sought to reclaim it─to redeem myself for my failure..."},{"name":"SOLKZAGYL","text":"“A paladin swears allegiance to the sultanate.”<br>“A paladin shall be the sword and shield of the sultanate.”<br>“A paladin defends the people of the realm.”"},{"name":"SOLKZAGYL","text":"Thirty years I aspired to those ideals. Thirty years I tried to live up to the example set by our founder, so revered that his very soul crystal would be set in Oathkeeper's pommel."},{"name":"SOLKZAGYL","text":"For those legendary captains of eld, the sword would shimmer with such brilliance that night would be as day..."},{"name":"SOLKZAGYL","text":"Yet for the thirty years I wore it, it shined for me but once."},{"name":"SOLKZAGYL","text":"That was before it was taken from me. Before I forswore my oaths so I could reclaim it."},{"name":"SOLKZAGYL","text":"<span class=\"highlight\">Forename</span>. Through all your trials and tribulations, you have remained true to yourself and to Eorzea."},{"name":"SOLKZAGYL","text":"You continue to be an inspiration to us all."},{"name":"SOLKZAGYL","text":"Come, take up Oathkeeper. Raise it aloft and let it shine forth as a beacon unto all!"},{"name":"SOLKZAGYL","text":"...You were always my first choice, <span class=\"highlight\">Forename</span>."},{"name":"SOLKZAGYL","text":"Constaint was incentive. Motivation. Though, in the end, he proved himself to be so much more."},{"name":"CONSTAINT","text":"...You're a right bastard, you know that? Doing all this just to make a bloody sword shine."},{"name":"CONSTAINT","text":"Praise Halone that I found a proper mentor in <span class=\"highlight\">Forename</span>."},{"name":"CONSTAINT","text":"Well, I may not be the chosen one, but I'm still a free paladin..."},{"name":"CONSTAINT","text":"That is the path I have chosen for myself, and on it I will stay."},{"name":"PAPASHAN","text":"Well said. It would not do for you to be so easily discouraged."},{"name":"PAPASHAN","text":"Jenlyns, I leave matters here in your capable hands."},{"name":"JENLYNS","text":"You've done it again, <span class=\"highlight\">Forename</span>."},{"name":"JENLYNS","text":"Oathkeeper may not shine for me as it did for you, but perhaps, in time, it will."},{"name":"JENLYNS","text":"But even should it not, I will not lose heart, for a paladin's virtue is not in the radiance of his blade, but in the righteousness of his actions."},{"name":"JENLYNS","text":"By what we decide to do every day, we will be good men. Or not."},{"name":"JENLYNS","text":"Solkzagyl. Oathkeeper is returned to the Sultansworn. Will you not return to us as well?"},{"name":"SOLKZAGYL","text":"...As a friend and ally perhaps, but not as a brother."},{"name":"SOLKZAGYL","text":"Some bonds, once broken, cannot be mended."},{"name":"SOLKZAGYL","text":"I thank you, <span class=\"highlight\">Forename</span>, for all you have done."},{"name":"SOLKZAGYL","text":"Heh, how strange that we must turn to a free paladin, rather than one of our own, to show us the way."},{"name":"SOLKZAGYL","text":"Yet I suppose it is not the first time, is it..."},{"name":"SOLKZAGYL","text":"...If you still mean to ask how I planned it all, don't. You wouldn't believe me anyway."},{"name":"JENLYNS","text":"It would seem that some questions weren't meant to be answered, and we must simply deal with it."},{"name":"PAPASHAN","text":"I've got to say, I've given it some thought, and I cannot see how it was possible for him to... Oh, never mind."},{"name":"CONSTAINT","text":"So that's it, then? You're leaving?"},{"name":"SOLKZAGYL","text":"Ul'dah beckons, and besides, I've nothing left to teach you."},{"name":"CONSTAINT","text":"Then I wish you well on your journey, and pray that you find happiness there."},{"name":"SOLKZAGYL","text":"I'm coming back, you know. There's an awful lot of work to be done in Falcon's Nest, and I did make a promise to Hundred Eyes..."},{"name":"CONSTAINT","text":"Oh! Then I shall see you when you return!"},{"name":"CONSTAINT","text":"We should head back, too, <span class=\"highlight\">Forename</span>."},{"name":"CONSTAINT","text":"I'm still not quite sure what it was all for, but it seems to have ended well enough."},{"name":"CONSTAINT","text":"I suppose you ought to get back to your grand adventures, and me to my paladin-ing, or whatever it is you call it."},{"name":"CONSTAINT","text":"Right, then. It's been a pleasure, <span class=\"highlight\">Forename</span>!"},{"name":"CONSTAINT","text":"Oh, but I warn you: the next time we cross blades, I mean to win! Fare thee well!"},{"name":"SYSTEM","text":"This concludes the paladin quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next paladin quest will be available from Jenlyns."},{"name":"QIB","text":"There can be only one, <span class=\"highlight\">Forename</span>! Face me!"},{"name":"QIB","text":"Of...of course. I knew it wouldn't be easy..."},{"name":"QIB","text":"No, no! I will not yield!"},{"name":"QIB","text":"A paladin must be...without fear in the face...in the face of..."},{"name":"QIB","text":"Come, paladin! Show me the mettle in your heart and steel in your blade!"},{"name":"QIB","text":"Yes, fight and struggle! Hold nothing back!"},{"name":"QIB","text":"Good, good! But it will not be enough!"},{"name":"QIB","text":"Have you the strength to overcome this!?"},{"name":"QIB","text":"A performance worthy of the Warrior of Light!"},{"name":"QIB","text":"Not yet, <span class=\"highlight\">Forename</span>! We are not yet finished!"},{"name":"QIB","text":"Yeeesss! YEEESSS!"}],"reward":{"gil":1443,"action":3539,"items":[{"id":20655}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":20}],"quests":[67572]},"next":[68107]},"partials":[{"type":"npc","id":"1014092","obj":{"i":1014092,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1014103","obj":{"i":1014103,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1014094","obj":{"i":1014094,"n":"House Durendaire Leech","l":2200,"q":1}},{"type":"npc","id":"1014095","obj":{"i":1014095,"n":"Papashan","l":2200,"q":1}},{"type":"npc","id":"1014096","obj":{"i":1014096,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1014097","obj":{"i":1014097,"n":"Papashan","l":2200,"q":1}},{"type":"npc","id":"1014098","obj":{"i":1014098,"n":"Constaint","l":2200,"q":1}},{"type":"npc","id":"1014099","obj":{"i":1014099,"n":"Solkzagyl","l":2200,"q":1}},{"type":"npc","id":"1014100","obj":{"i":1014100,"n":"Solkzagyl","l":2200,"q":1}},{"type":"npc","id":"1014101","obj":{"i":1014101,"n":"Jenlyns","l":2200,"q":1}},{"type":"npc","id":"1014102","obj":{"i":1014102,"n":"Constaint","l":2200,"q":1}},{"type":"action","id":"3539","obj":{"i":3539,"n":"Royal Authority","c":2507,"j":19,"t":3,"l":60}},{"type":"item","id":"20655","obj":{"i":20655,"n":"Creed Armor Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67572","obj":{"i":67572,"n":"All According to Plan","g":147,"l":"Coerthas Western Highlands","s":580,"f":1}},{"type":"quest","id":"68107","obj":{"i":68107,"n":"Tournament of the Century","g":147,"l":"Ul'dah","s":601,"f":1}}]}