{"quest":{"name":"Hey Soul Crystal","location":"Coerthas Western Highlands","id":67571,"patch":3.0,"sort":560,"icon":100433,"unlocksFunction":1,"eventIcon":71341,"issuer":1014065,"target":1014068,"involved":[1011922,1014064,1014066,1014067],"genre":147,"journal":["Constaint wishes to share with you a rather unusual development.","For whatever reason, it would seem that a missive penned by Solkzagyl and addressed to Constaint was sent to Tailfeather in the Dravanian forelands. An acquaintance of Constaint's, Grimold, informed him of this fact, and also insisted that he come to Tailfeather to collect the missive.","The missive is rather unusual, in that it appears to have been written weeks ago and sent with a shipment of supplies instead of by more efficient methods. Perhaps most puzzling of all are its words: “I left you a gift near the Hundred Throes. Take it, and become the man you were destined to be.” Though he knows not what to make of it, Constaint heads north to search for whatever it is the deceased paladin hid there for him.","Constaint tells you that you are in the right area, though he cannot say for certain. Search the vicinity for anything unusual.","Beneath a tree, you find a pair of gallant cuisses, as well as a faded soul crystal. Pondering the items, Constaint begins to question if he is being manipulated somehow, though he does not expound upon his suspicions in detail. He departs for Camp Riversmeet, out of a desire to speak with the one man who could explain─if only he were still alive...","As Constaint contemplates what Solkzagyl intended for him, Jenlyns suddenly arrives, having learned of his predecessor's death from Papashan. As he grieves for Solkzagyl, his soul crystal inexplicably begins to glow, as does yours, and a mysterious burst of aether flows from his crystal into yours. However, before you all can discuss what you have witnessed, you become aware of a cloaked man staring at Constaint and the soul crystal in his outstretched hand. The man disappears before you can discover his identity, but Jenlyns concludes that it was another minion of Death's Embrace, spying on Solkzagyl's pupil to see if he will continue to seek Oathkeeper. Jenlyns is, of course, still determined to reclaim the sword, but as you observe Constaint, staring at the cliff where the man once stood, you cannot help but wonder if he is equally resolved.<br><br>※The next paladin quest will be available from Constaint upon reaching level 58."],"objectives":["Speak with Grimold in Tailfeather.","Speak with Constaint.","Search the surrounding area.","Speak with Constaint at Camp Riversmeet."],"dialogue":[{"name":"CONSTAINT","text":"Curious tidings, <span class=\"highlight\">Forename</span>. Not long ago, I received word from an acquaintance of mine, Grimold, who claims to have in his possession a missive written by Solkzagyl and addressed to me."},{"name":"CONSTAINT","text":"He insisted that I come collect it from him in person in Tailfeather, and since we haven't any leads in our search for Oathkeeper, I see no reason to deny him. Let us be off, then!"},{"name":"CONSTAINT","text":"<span class=\"highlight\">Forename</span>, Grimold. Grimold, <span class=\"highlight\">Forename</span>."},{"name":"GRIMOLD","text":"I appreciate you coming all this way, Constaint. I know it must seem a little odd..."},{"name":"GRIMOLD","text":"Frankly, it's been strange from the start. Who sends a missive with provisions when we've got moogles running about who can do it far faster?"},{"name":"GRIMOLD","text":"Not to mention the fact that bandits have been raiding caravans to Tailfeather for weeks. If it weren't for them moving on, this latest shipment would've likely never arrived. Anyroad..."},{"name":"GRIMOLD","text":"From what I can tell, it was languishing in someone's storeroom for a while. Better late than never, though, eh?"},{"name":"GRIMOLD","text":"It was your friend's wish that you come all this way. Read it for yourself and you'll see."},{"name":"CONSTAINT","text":"“I left you a gift near the Hundred Throes. Take it, and become the man you were destined to be.”"},{"name":"GRIMOLD","text":"Curious fellow, this Solkzagyl. Anyroad, if I were you, I'd head north and find whatever it is before someone else does."},{"name":"CONSTAINT","text":"My thanks, friend. I shall do just that."},{"name":"CONSTAINT","text":"Let's head towards the Throes and see what we find, <span class=\"highlight\">Forename</span>."},{"name":"GRIMOLD","text":"If that missive is any indication, whatever your friend left behind has been there for weeks. Wouldn't be surprised if a hunter stumbled across it by now..."},{"name":"CONSTAINT","text":"It should be around here somewhere..."},{"name":"CONSTAINT","text":"Hmm, I don't see anything out of the ordinary... <span class=\"highlight\">Forename</span>, why don't you try looking over there?"},{"name":"CONSTAINT","text":"Is that...is that a soul you've found!?"},{"name":"CONSTAINT","text":"By the Fury, it is... And look! A pair of gallant cuisses! But why?"},{"name":"CONSTAINT","text":"...Why do I feel like I'm being led by the nose?"},{"name":"CONSTAINT","text":"First the journal, now this missive?"},{"name":"CONSTAINT","text":"There's so much I want to ask─so much I should have asked when he was still alive..."},{"name":"CONSTAINT","text":"To be honest, I never really understood why you accepted me as your pupil..."},{"name":"CONSTAINT","text":"What made you change your mind? What did you see in me? And what...what would you have me do now that you're gone?"},{"name":"JENLYNS","text":"(-???-)So it is true, then."},{"name":"JENLYNS","text":"Papashan could not conceal the truth from me forever. He told me of Solkzagyl's claims and your search."},{"name":"JENLYNS","text":"I could not believe it. I <span class=\"emphasis\">would</span> not believe it. Yet now..."},{"name":"JENLYNS","text":"Wh-What sorcery is this!?"},{"name":"JENLYNS","text":"He was watching you, boy. You and the soul you bear."},{"name":"JENLYNS","text":"Could he have been a minion of Death's Embrace, spying on Solkzagyl's pupil?"},{"name":"JENLYNS","text":"Perhaps they hoped Solkzagyl's quest would end with his death─that none would attempt to reclaim Oathkeeper in his stead."},{"name":"JENLYNS","text":"They thought us broken when our brothers betrayed us─when they robbed us of the sword and delivered it into their keeping..."},{"name":"JENLYNS","text":"But we did not give in to despair. Nor will we do so now. Oathkeeper will be ours again, I swear it!"},{"name":"JENLYNS","text":"I must return to Ul'dah for now. The way our souls resonated was unlike anything I have ever seen before, and I would know what it portends. Pray continue to look after the boy, <span class=\"highlight\">Forename</span>."},{"name":"CONSTAINT","text":"What do you want from me...?"}],"reward":{"gil":1212,"action":3540,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":20}],"quests":[67570]},"next":[67572]},"partials":[{"type":"npc","id":"1014065","obj":{"i":1014065,"n":"Constaint","l":2200,"q":2}},{"type":"npc","id":"1014068","obj":{"i":1014068,"n":"Constaint","l":2200,"q":2}},{"type":"npc","id":"1011922","obj":{"i":1011922,"n":"Grimold","l":2000,"q":5}},{"type":"npc","id":"1014064","obj":{"i":1014064,"n":"Constaint","l":2200,"q":2}},{"type":"npc","id":"1014066","obj":{"i":1014066,"n":"Constaint","l":2000,"q":1}},{"type":"npc","id":"1014067","obj":{"i":1014067,"n":"Constaint","l":2000,"q":1}},{"type":"action","id":"3540","obj":{"i":3540,"n":"Divine Veil","c":2508,"j":19,"t":4,"l":56}},{"type":"quest","id":"67570","obj":{"i":67570,"n":"Big Sollerets to Fill","g":147,"l":"Coerthas Western Highlands","s":540,"f":1}},{"type":"quest","id":"67572","obj":{"i":67572,"n":"All According to Plan","g":147,"l":"Coerthas Western Highlands","s":580,"f":1}}]}