{"quest":{"name":"The Breaking of Blanstyr","location":"Limsa Lominsa","id":67574,"patch":3.0,"sort":502,"icon":100452,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001001,"involved":[1012522],"genre":138,"journal":["Forgemaster H'naanza has a favor to ask of you.","A perturbed Forgemaster H'naanza welcomes your visit, and immediately requests your aid in an urgent matter. It seems that Blanstyr, your old rival, has decided that donning his own work and charging into battle is the only way to improve his knowledge of armorcraft. Speak with Blanstyr, and convince him of the danger inherent in this reckless plan.","You attempt to dissuade Blanstyr from his course, but the stubborn armorer is deaf to your pleas. Return to H'naanza, and report your failure.","Disappointed─but not entirely unsurprised─by your report, the forgemaster next bids you follow the old craftsman into lower La Noscea and protect him from undue harm. Look for Blanstyr in the vicinity of the Eyes.","You catch up to Blanstyr, only to find that he has been rescued from certain death by a passing party of adventurers. Still in a state of shock, the armorer seems dumbfounded by the weight and discomfort of his protective equipment. Return to the Armorers' Guild and report events to H'naanza.","The forgemaster is relieved to hear of Blanstyr's rescue, but fears that the single-minded old man is far from done with his foolishness. She bids you aid him with his work in the hopes that the example of your craft will prove more persuasive than mere words. Speak with Blanstyr, and offer him the assistance of your hammer.","You approach Blanstyr, and the determined armorer describes to you the depths of his revelations. From this point forward, he vows to craft with the needs of his customers forefront in his mind. Aid Blanstyr in his quest for greatness, and use this opportunity to improve your own techniques.<br><br>※The next armorer quest will be available from Blanstyr upon reaching level 53."],"objectives":["Speak with Blanstyr.","Speak with H'naanza","Speak with Blanstyr near the Eyes.","Report to H'naanza at the Armorers' Guild.","Speak with Blanstyr."],"dialogue":[{"name":"HNAANZA","text":"Ah, <span class=\"highlight\">Forename</span>, the very armorer I was hoping to see. Have you a moment or two to spare? It's about Blanstyr..."},{"name":"HNAANZA","text":"Ever since he lost that contest, he's been keeping his distance from the forge. Then one day he simply appears as if naught had happened, and starts banging out a breastplate on one of the anvils."},{"name":"HNAANZA","text":"He crafts an entire suit, then mumbles something to the effect of “understanding the true nature of armor.” When I asked what he was on about, the daft old sod says he intends to don his own work, then go looking for battle in the wilds."},{"name":"HNAANZA","text":"Now, Blanstyr's a big lad, but he couldn't fight his way out of a fishing net. I tried to talk him out of it, of course, but you can imagine how <span class=\"emphasis\">that</span> ended."},{"name":"HNAANZA","text":"Which brings me to your part in this, <span class=\"highlight\">Forename</span>. I suspect he'd more willingly lend an ear to someone whom he's not so inclined to despise. You'll find him loitering in his usual spot, if you're of a mind to convince the stubborn aurochs."},{"name":"HNAANZA","text":"Go find Blanstyr, and explain just how dangerous the wilds of La Noscea can be for someone without the proper training."},{"name":"BLANSTYR","text":"Well, look who it is. Listen, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, I know H'naanza sent ye. Just keep walkin' yer own path, an' I'll walk mine."},{"name":"BLANSTYR","text":"I've been doin' a lot o' thinkin' these past moons, ye see, an' I finally found me answer: I'll learn the secrets of armorcraft not in the flames o' the forge, but in the heat o' battle. An' if I die in the doin' of it, I'll go to me grave with no regrets."},{"name":"BLANSTYR","text":"Don't try to stop me, <span class=\"highlight\">Forename</span>. An' ye can tell that forgemaster o' yers to keep her twitchy nose outta me damn business, an' all!"},{"name":"BLANSTYR","text":"Don't try to stop me, <span class=\"highlight\">Forename</span>. An' ye can tell that forgemaster o' yers to keep her twitchy nose outta me damn business, an' all!"},{"name":"HNAANZA","text":"So, the old buzzard wouldn't listen to you either. It seems an excess of self-reflection has sent his thoughts down an odd track..."},{"name":"HNAANZA","text":"You are no stranger to combat, <span class=\"highlight\">Forename</span>. Mayhap you are still the right <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> for the job."},{"name":"HNAANZA","text":"I want you to follow Blanstyr─quietly, mind─and see that he doesn't get himself killed. Assuming he sticks to his ridiculous plan, you'll find him out near the Eyes."},{"name":"HNAANZA","text":"Trail Blanstyr out to the Eyes, and be sure that he makes it back alive."},{"name":"BLANSTYR","text":"I'll learn the secrets of armorcraft not in the flames o' the forge, but in the heat o' battle. An' if I die in the doin' of it, I'll go to me grave with no regrets."},{"name":"BENATHAIRE","text":"...Are you injured? 'Twas fortunate we happened by─you were more like to harm yourself with that flailing than slay your intended opponent."},{"name":"BENATHAIRE","text":"I must say, however, I do admire your devotion to your craft. Mayhap we shall call on you the next time we have need of an armorer. Safe travels, my friend."},{"name":"BLANSTYR","text":"I thought...&lt;gasp&gt;...I was a dead man. Clad meself in me finest armor...but I could hardly move, let alone...fight..."},{"name":"BLANSTYR","text":"Who'd've thought a rat...could give me so much grief? A bleedin' rat! Mean, little bugger, he was..."},{"name":"BLANSTYR","text":"But as I stared death in its furry face...I had meself an epiphany. I've got to get back to the forge, an' then I'll be ready to try again!"},{"name":"BLANSTYR","text":"...What are ye doin' out here anyways? Well, I'll leave ye to yer business. I can hobble back to Limsa on me own, thanks very much..."},{"name":"BLANSTYR","text":"Now that I've had time to think about it, ye was likely out there at H'naanza's biddin', wasn't ye? I thought I told that harpy to leave me be..."},{"name":"HNAANZA","text":"Well, I'm glad to hear the old bastard survived his foolishness─this time. From the sounds of it, though, he doesn't intend to stop there..."},{"name":"HNAANZA","text":"I know you have more productive things to do than mind a full-grown man, but can I ask you to stay near to Blanstyr for a while? If you can't reach him with words, then mayhap you can guide him with craft."},{"name":"HNAANZA","text":"Speak with the man, and offer to aid him with his work. And while you're teaching by example, you might even learn something new yourself."},{"name":"HNAANZA","text":"Go to Blanstyr and offer him your hammer. See if you can't guide him away from this edge over which he's so damn determined to throw himself."},{"name":"BLANSTYR","text":"Aye, it weren't the most heroic o' battles. But even a brief scuffle like that made me realize summat: I ain't never spared much thought for the folk what're wearin' me armor..."},{"name":"BLANSTYR","text":"Eh? First ye try to stop me, an' now ye wanna <span class=\"emphasis\">help</span> me? Make up yer bloody mind, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Alright, I'll take ye on...but I can't promise as ye'll have much to do."},{"name":"BLANSTYR","text":"I've searched the depths of me craftsman's soul, an' come out with a whole new view o' things: from now on, I'll be puttin' meself in me customers' boots afore I forge a piece. I've mapped me course, an' it's a straight run from here to greatness."},{"name":"SYSTEM","text":"The next armorer quest will be available from Blanstyr upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"gil":687,"items":[{"num":120,"id":9},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":11}],"questsType":"all","quests":[65820,65964]},"next":[67575]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1012522","obj":{"i":1012522,"n":"Blanstyr","l":31,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"65820","obj":{"i":65820,"n":"Rivalry and Respect","g":138,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67575","obj":{"i":67575,"n":"Light-headed","g":138,"l":"Limsa Lominsa","s":530,"f":1}}]}