{"quest":{"name":"The Pride of Vymelli","location":"Limsa Lominsa","id":67578,"patch":3.0,"sort":600,"icon":100452,"unlocksFunction":1,"eventIcon":71341,"issuer":1001001,"target":1013791,"involved":[1001000,1012527,1013681,1013790,1013925],"genre":138,"usedItems":[10682],"journal":["Blanstyr seems unusually excited.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Armorer III</span>.</span>","Blanstyr informs you that Benathaire's party has returned from their monster slaying. Eager to hear how his armor withstood the test of battle, he suggests that you join him and H'naanza in welcoming the adventurers back to Limsa Lominsa. Head to the Drowning Wench and speak with Benathaire.","You find the adventurers in their usual haunt, but the air of defeat surrounding them is almost palpable. Blanstyr demands to know if his armor was to blame, and Wannmaga confesses that his movements were restricted by the veteran armorer's chest piece. Seeking to fulfill his client's needs, Blanstyr then turns to you to forge a suit of armor more suited to Wannmaga's fighting style. Make your way to the Gladiators' Guild in Ul'dah, and join Blanstyr in his efforts to research an appropriate design.","You meet Blanstyr in Ul'dah, and together you question the members of the Gladiators' Guild. After considering the responses, you settle upon a design for Wannmaga's armor: a lorica. Head next to the Miners' Guild and discover what H'naanza has learned about recent developments in the mining industry.","You speak with H'naanza, and it would seem that new deposits of adamantite ore have recently been unearthed. The forgemaster explains that this development allows for the production of adamantite, a metal known for its incredible resilience and tremendous elasticity. With the perfect design and the perfect material now decided, it is time now for you to forge the perfect armor. Craft an exceptional adamantite lorica of fending, and deliver it to Blanstyr at the Armorers' Guild.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Armorer III</span>.</span>","You hand over the lorica to a suitably impressed Blanstyr. He then takes the armor you have forged, and adds it to the protective gear he, H'naanza, and his “weaver mate” have crafted for the other party members. Find Benathaire in Bulwark Hall, and deliver the Pride of Vymelli to the conjurer and his companions.","You present your gifts to the adventurers, and they don their new armor with appreciative glee. After watching Benathaire and his companions once more set forth to do battle, Blanstyr is overwhelmed with a feeling of achievement. He thanks both you and H'naanza for rescuing him from his slump, and vows to never again alienate himself from his colleagues. In a surge of sudden confidence, however, he challenges the forgemaster to another armorcrafting contest. H'naanza shakes her head in disbelief, but welcomes the test to her abilities, stating that even a forgemaster must guard against the dangers of stagnation. Take the lessons you have learned to heart, and continue striving to perfect the skills of your trade.<br><br>※The next armorer quest will be available from H'naanza once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Benathaire.","Speak with Blanstyr at the Gladiators' Guild.","Speak with H'naanza at the Miners' Guild.","<span class=\"alternative-container\"><span class=\"alternative\">Forge an adamantite lorica of fending <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the adamantite lorica of fending <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Blanstyr at the Armorers' Guild</span></span>.","Deliver the Pride of Vymelli to Benathaire in Bulwark Hall."],"dialogue":[{"name":"BLANSTYR","text":"Ah, <span class=\"highlight\">Forename</span>, did ye hear? Our 'venturin' friends is back from their monster huntin'. I say we go an' give 'em a big ol' Lominsan welcome home!"},{"name":"BLANSTYR","text":"H'naanza should come along, too, so she can see how well me armor held up. I'll fetch the forgemaster─go on ahead to the Wench, if ye like."},{"name":"BLANSTYR","text":"I want H'naanza to be there as well. Head to the Drownin' Wench, an' I'll be along with the forgemaster in a bit."},{"name":"BLANSTYR","text":"What in the seven hells happened to you lot!?"},{"name":"BENATHAIRE","text":"The creature, it─<br>We barely escaped with our lives. ...I was too slow with my spells."},{"name":"WANNMAGA","text":"No, I positioned myself poorly."},{"name":"BENATHAIRE","text":"（★未使用／削除予定★）"},{"name":"WANNMAGA","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"...Listen, if there was a problem with me armor, then ye'd best tell me."},{"name":"BLANSTYR","text":"Don't lie to me, lad! I need to know if me work's not up to scratch─ye'll not hurt me precious feelin's, I promise ye."},{"name":"WANNMAGA","text":"...Aye, it was the armor. It's as light and strong as I could've wished for, but too tight around the shoulders. I couldn't swing my sword the way I wanted..."},{"name":"BLANSTYR","text":"I didn't think to adjust the plates for a gladiator's range o' movement... So much for understandin' me client's needs, eh?"},{"name":"BLANSTYR","text":"<span class=\"highlight\">Forename</span>, I've got a new commission for ye. Right now, me craft ain't good enough to forge the kind of equipment Wannmaga needs─but yers is. I'm askin' ye─as a colleague an' a customer─to make him the finest armor yer hammer can manage!"},{"name":"BENATHAIRE","text":"What have we done to deserve such kindness...?"},{"name":"BLANSTYR","text":"Ye saved me life, remember? An' maybe, with the right armor, I can help save yers in return."},{"name":"BENATHAIRE","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"BENATHAIRE","text":"You are a good man, Master Blanstyr. Come, my friends─let us descend to Bulwark Hall, and make preparations to meet our nemesis once more!"},{"name":"BLANSTYR","text":"I appreciate yer help in this, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. An' just to make sure there's no mistakes this time, I'll be headed to the Gladiators' Guild to ask what style of armor works best for 'em."},{"name":"HNAANZA","text":"This change in Blanstyr is unsettling─I almost prefer it when he's spitting insults at me. In any case, the armor's design may not be the only factor worth considering here. I shall visit Ul'dah myself, and speak with the miners concerning their recent excavation efforts."},{"name":"HNAANZA","text":"Meanwhile, you should join Blanstyr at the Gladiators' Guild and assist him with his inquiries. Meet me at the Miners' Guild when you have the answers you need."},{"name":"BENATHAIRE","text":"We shall defeat that nightmare beast for certain this time!"},{"name":"BLANSTYR","text":"Get yer forge nice an' hot, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I'll speak with them gladiator folk in Ul'dah, an' be back afore ye know it."},{"name":"HNAANZA","text":"Assist Blanstyr with his inquiries at the Gladiators' Guild, then meet me at the Miners' Guild afterwards. There may be an alternative to titanium..."},{"name":"HNAANZA","text":"Where is Blanstyr? Finish your inquiries at the Gladiators' Guild, then bring him back here to me."},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BALLOON","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"Got bored o' waitin', did ye? I'd've been back by now if these damn sword-swingers'd only stop trainin' long enough to talk to me. I already tried askin' the stern-lookin' lass over there, but it seems she don't like me “disrespectful tongue.”"},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"...Ye'll have a word with her, will ye? Alright, I'll see if I can get the attention o' one o' these other blokes."},{"name":"BLANSTYR","text":"...Right. Puttin' our answers together, we're lookin' at a piece what's heavy on protectin' the chest but allows the arms a full range o' movement. Sounds like a lorica to me."},{"name":"BLANSTYR","text":"...Which is exactly what I was thinkin' of after hearin' o' Wannmaga's troubles. This was a long way to come to learn summat I already knew..."},{"name":"BLANSTYR","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"...At the Miners' Guild, is she? Well, let's see if the forgemaster's had more luck than us."},{"name":"BLANSTYR","text":"Didn't ye say H'naanza was waitin' for us at the Miners' Guild?"},{"name":"BLANSTYR","text":"Ye talk to H'naanza yet? Must be some excitin' bloody ore to bring her all the way out here..."},{"name":"HNAANZA","text":"I've some good tidings from our miner friends. We had thought all sources of adamantite ore had been exhausted, but I'm told that new seams were recently discovered in lands that were once part of the Allagan Empire."},{"name":"HNAANZA","text":"And with a supply of adamantite ore, we can resume production of adamantite─a metal much favored by the ancients. Not only is it incredibly resilient, it is also valued for its unique elasticity."},{"name":"HNAANZA","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"...Aye, if there's no give, then harder metals tend towards crackin'. Can ye imagine a lorica made out o' that adamantite stuff? Now that's what I call the ideal armor."},{"name":"HNAANZA","text":"（★未使用／削除予定★）"},{"name":"BLANSTYR","text":"There's me commission for ye, <span class=\"highlight\">Forename</span>: forge Wannmaga an adamantite lorica─one what'll fend off even the most savage o' blows."},{"name":"BLANSTYR","text":"...I'll leave ye to it, then. See ye back in Limsa, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"HNAANZA","text":"Blanstyr's lost a lot of that stubborn pride that's been holding him back. He has your fine example to thank for that, I'd say."},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Armorer III</span>."},{"name":"BLANSTYR","text":"Ah, there ye are, <span class=\"highlight\">Forename</span>! I've been itchin' to see this adamantite creation o' yers!"},{"name":"BLANSTYR","text":"...I've never seen the like! Even a behemoth'd have a hard time puttin' a scratch on that thing!"},{"name":"BLANSTYR","text":"The whole piece is so light, ye'd never think it were made o' metal at all. ...Aye, ye've exceeded all me expectations!"},{"name":"BLANSTYR","text":"An' while ye've been busy forgin' this beauty, H'naanza an' me've been puttin' together a little surprise for the rest of the party. I even had me weaver mate stitch up a new hat for Benathaire."},{"name":"BLANSTYR","text":"Everythin' we had, we poured into these gifts─there'll be no complaints this time, <span class=\"highlight\">Forename</span>!"},{"name":"BLANSTYR","text":"Here, ye should be the one to bear the Pride o' Vymelli. Head down to Bulwark Hall, an' hand it over to those 'venturers! The forgemaster an' me'll be right behind ye."},{"name":"BLANSTYR","text":"Take the Pride o' Vymelli an' head down to Bulwark Hall. H'naanza an' me'll be along shortly to see how them 'venturers like their gifts."},{"name":"HNAANZA","text":"Blanstyr's lost a lot of that stubborn pride that's been holding him back. He has your fine example to thank for that, I'd say."},{"name":"BENATHAIRE","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. You... You have brought gifts for all of us!?"},{"name":"SASAPIKU","text":"Hardly feels like I'm wearin' armor at all! Nothin' to stop me springin' an' stingin'!"},{"name":"HNAANZA","text":"That one's mine. I stripped the design down to its bare essentials for maximum mobility."},{"name":"BARBERELLA","text":"Aye, this gorgeous helm leaves bare my best features! I can already picture myself weaving through our foes in a deadly dance─an epic tapestry waiting to be woven!"},{"name":"BLANSTYR","text":"I made that one! Took the lessons o' two separate guildmasters, but I finally forged summat ye approved of!"},{"name":"WANNMAGA","text":"Yes... Yes, I like this! I feel not the slightest resistance to my movements!"},{"name":"BLANSTYR","text":"That there masterpiece was forged by <span class=\"highlight\">Forename</span>. The perfect design crafted from the perfect metal! If ye lose to yer quarry with that on yer back, don't bother comin' back at all!"},{"name":"BENATHAIRE","text":"I cannot thank you enough... Now I might concentrate on healing without thoughts of shabby equipment clouding my judgment."},{"name":"BENATHAIRE","text":"No more excuses, my fine companions! We certainly look the part of heroes─so let us prove that we are such in truth! Onwards!"},{"name":"BLANSTYR","text":"I've never much been one for encouragin' folk. I never knew it could feel this good..."},{"name":"BLANSTYR","text":"Gettin' beaten by you all them years ago was bad enough, but after losin' the same contest to <span class=\"highlight\">Forename</span>─in front o' the Admiral, no less─I lost me way as well."},{"name":"BLANSTYR","text":"If those 'venturers hadn't saved me, I might never've found the path I'm on now. Thanks to them, I learned the value o' listenin' to me clients...but more importantly, how to listen to me colleagues."},{"name":"BLANSTYR","text":"To me, armorcraft was summat ye mastered alone. At worst, a colleague was someone what dragged ye down─at best, a rival to spur ye along. I was always tryin' to distance meself."},{"name":"BLANSTYR","text":"I see me mistake, now; I see how I stunted me growth by shunnin' the knowledge an' support o' me fellow artisans."},{"name":"BLANSTYR","text":"<span class=\"highlight\">Forename</span>, Forgemaster... Ye could've given up on this bitter ol' aurochs, but ye didn't. An' for that, ye have me deepest thanks..."},{"name":"HNAANZA","text":"Hah! You pushed everyone away, from the greenest novice to the oldest veteran, and the last thing I expected was to have <span class=\"emphasis\">you</span> ask <span class=\"emphasis\">me</span> for help. Mayhap now we can work together to raise our craft to new heights."},{"name":"BLANSTYR","text":"Aye, after learnin' yer lessons, I reckon me work is better than it's ever been... I reckon I might even be good enough to challenge ye to another contest!"},{"name":"HNAANZA","text":"Aye, you've certainly come a long w─<br>...Wait, what was that about a contest?"},{"name":"BLANSTYR","text":"Three rounds! Winner takes all! ...I've got to get back to me forge an' start craftin' me some ingots! We'll see who's the best now, Forgemaster! Gahahahahaha!"},{"name":"HNAANZA","text":"...Did we not <span class=\"emphasis\">just</span> talk about this rival business?"},{"name":"HNAANZA","text":"Hmmm. Well, a little friendly rivalry is good for the guild, and even a forgemaster should be kept on her toes. Do your worst, you old buzzard─I'll be ready for you!"},{"name":"SYSTEM","text":"This concludes the armorer quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next armorer quest will be available from H'naanza."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":778,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":11}],"quests":[67577]},"next":[68130]},"partials":[{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"npc","id":"1013791","obj":{"i":1013791,"n":"Benathaire","l":29,"q":1}},{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1012527","obj":{"i":1012527,"n":"H'naanza","l":41,"q":1}},{"type":"npc","id":"1013681","obj":{"i":1013681,"n":"Blanstyr","l":41,"q":1}},{"type":"npc","id":"1013790","obj":{"i":1013790,"n":"Blanstyr","l":41,"q":1}},{"type":"npc","id":"1013925","obj":{"i":1013925,"n":"Benathaire","l":28,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"10682","obj":{"i":10682,"n":"Adamantite Lorica of Fending","l":150,"c":43278,"t":35,"p":27799}},{"type":"quest","id":"67577","obj":{"i":67577,"n":"The Reforging of Blanstyr","g":138,"l":"Limsa Lominsa","s":580,"f":1}},{"type":"quest","id":"68130","obj":{"i":68130,"n":"Original Blanstyr","g":138,"l":"Limsa Lominsa","s":601,"f":1}}]}