{"quest":{"name":"Love for Harmony","location":"Ishgard","id":67587,"patch":3.0,"sort":580,"icon":100449,"unlocksFunction":1,"eventIcon":71341,"issuer":1013240,"target":1013240,"involved":[1013241,1013245],"genre":145,"usedItems":[12579],"journal":["Mujih Mewrilah has distressing news from Basyle.","A fretful Mujih informs you that Basyle's crops are under threat from a plague of vermin. Make haste to Camp Cloudtop and see how you can assist the beleaguered botanist.","Though an alchemical concoction would deal with the pests in short order, Basyle is loath to employ such an extreme measure for fear of its impact on the environment. To that end, he begs you to consult Martineau once more, in hopes that he will know of a nature-friendly solution. Seek out the herbalist in Saint Reymanaud's Cathedral.","Martineau is impressed by your determination to place nature first, and advises you that birch tar has vermin-repelling properties. The substance will have the greatest effect if extracted from logs gathered in the selfsame region that the pests inhabit. Gather ten birch logs in the Sea of Clouds and deliver them to Basyle.","Basyle thanks you for the birch logs, and expresses his frustration at being powerless to uphold his own beliefs and serve nature's best interests. In closing, he bids you pass along his thanks to Mujih for her concern. Join the reporter at the aetheryte plaza in Ishgard.","In spite of her claims to the contrary, you are convinced that Mujih's interest in Basyle's efforts has become personal. Her added expectation serves to stoke the fires of your desire to succeed.<br><br>※The next botanist quest will be available from Mujih Mewrilah upon reaching level 60."],"objectives":["Speak with Basyle at Camp Cloudtop.","Speak with Martineau in Saint Reymanaud's Cathedral.","<span class=\"alternative-container\"><span class=\"alternative\">Harvest birch logs in the Sea of Clouds</span><span class=\"alternative\">Deliver the birch logs to Basyle at Camp Cloudtop</span></span>.","Report to Mujih Mewrilah at the aetheryte plaza in Ishgard."],"dialogue":[{"name":"MUJIHMEWRILAH","text":"<span class=\"highlight\">Forename</span>! I've received word from Basyle. He has two pieces of news to share with you─one good, one bad."},{"name":"MUJIHMEWRILAH","text":"To begin with the good, he's succeeded in cross-pollinating the two varieties of beans you brought him. A new, more resilient strain is on its way!"},{"name":"MUJIHMEWRILAH","text":"As for the bad...the vermin population has fairly exploded, most likely due to rapid reclamation, and they're threatening the crops!"},{"name":"MUJIHMEWRILAH","text":"Unless the pests are dealt with, they'll undo all of Basyle's hard work. Please hurry to Camp Cloudtop at once and see how you can be of help!"},{"name":"MUJIHMEWRILAH","text":"Pests are threatening Basyle's crops. Please hurry to Camp Cloudtop at once and see how you can be of help!"},{"name":"BASYLE","text":"It's awful, <span class=\"highlight\">Forename</span>. Just awful. Our crops were coming along so well, but now a plague of vermin is threatening to destroy it all."},{"name":"BASYLE","text":"An alchemical concoction would deal with them quickly enough, but it's like to harm all creatures indiscriminately. What's more, there's no telling what other effects it might have on the environment."},{"name":"BASYLE","text":"If at all possible, I'd like to protect our crops without resorting to such extreme measures. But I don't know how to go about it."},{"name":"BASYLE","text":"You've spoken with Master Martineau before. Do you think you could seek him out again, and trouble him for advice with regard to our dilemma?"},{"name":"BASYLE","text":"I'd like to protect our crops without resorting to alchemical concoctions. I'd be grateful if you could trouble Master Martineau for his advice."},{"name":"MARTINEAU","text":"You look troubled, my friend. Is something the matter?"},{"name":"MARTINEAU","text":"Though your friend's concern for nature is touching, extreme circumstances call for extreme measures. Were I in his shoes, I wouldn't rule out an alchemical concoction. But tell me, what are your own thoughts on this?"},{"name":"Q1","text":"What are your thoughts on Basyle's situation?"},{"name":"A1","text":"We should avoid damaging the environment."},{"name":"A1","text":"We should avoid killing the local fauna."},{"name":"MARTINEAU","text":"So you are determined to place nature first. I respect that. Very well, I will share with you my knowledge."},{"name":"MARTINEAU","text":"When dry distilled, birch bark yields a tar which possesses vermin-repelling properties. 'Tis a trait the tree developed to protect itself from pests."},{"name":"MARTINEAU","text":"You would do well to gather birch logs at the same place the vermin inhabit, namely the Sea of Clouds. Ten pieces should suffice to begin with."},{"name":"MARTINEAU","text":"You would do well to gather birch logs at the same place the vermin inhabit, namely the Sea of Clouds. Ten pieces should suffice to begin with."},{"name":"BASYLE","text":"Have you found a way to protect our crops?"},{"name":"BASYLE","text":"...To think that such a method existed! I'll begin extracting tar from these logs at once!"},{"name":"BASYLE","text":"Once again, I'm in your debt. I don't know what I would've done without you, and the thought of it shames me. Here I am, professing to put nature first, yet I was powerless in the face of this trial."},{"name":"BASYLE","text":"When I mentioned my plight to Mistress Mujih, she was very worried for me. She even offered to help in any way she could. Please pass along my thanks to her as well."},{"name":"BASYLE","text":"When I mentioned my plight to Mistress Mujih, she was very worried for me. She even offered to help in any way she could. Please pass along my thanks to her as well."},{"name":"MUJIHMEWRILAH","text":"Welcome back, <span class=\"highlight\">Forename</span>! Another day, another job well done, I shouldn't doubt.<br> ...Oh? Basyle sends his thanks, you say?"},{"name":"MUJIHMEWRILAH","text":"Well, his passion is downright infectious, as is yours. You can't help but <span class=\"emphasis\">want</span> to help!"},{"name":"MUJIHMEWRILAH","text":"And lest you worry, I don't allow sentiment to color my articles. Nay, I tell it as it is, and this time, it's about respecting nature. Here's a choice passage from my draft:"},{"name":"MUJIHMEWRILAH","text":"“In that moment, a warm sensation swept over me, and I knew it for pride─the pride that, in this faraway land, the Gridanian love for harmony has taken root.”<br><br>...That sounds sentimental, you say? Ah, but see, I'm simply giving voice to what all forestborn will be feeling─a small but distinct difference!"},{"name":"MUJIHMEWRILAH","text":"At any rate, I've got another promising addition to my series, and it's all thanks to you! Keep up the good work!"},{"name":"SYSTEM","text":"To be deleted."}],"reward":{"gil":2050,"items":[{"id":11909},{"id":12669},{"id":5687,"one":1},{"id":5692,"one":1},{"id":5697,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":18}],"quests":[67586]},"next":[67588]},"partials":[{"type":"npc","id":"1013240","obj":{"i":1013240,"n":"Mujih Mewrilah","l":2300,"q":5}},{"type":"npc","id":"1013241","obj":{"i":1013241,"n":"Basyle","l":2100,"q":4}},{"type":"npc","id":"1013245","obj":{"i":1013245,"n":"Martineau","l":2301,"q":3}},{"type":"item","id":"11909","obj":{"i":11909,"n":"Hardsilver Hatchet","l":120,"c":38115,"t":30,"p":17487}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"item","id":"5687","obj":{"i":5687,"n":"Gatherer's Guerdon Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Gathering","category":2}}},{"type":"item","id":"5692","obj":{"i":5692,"n":"Gatherer's Guile Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Perception","category":2}}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"item","id":"12579","obj":{"i":12579,"n":"Birch Log","l":148,"c":22421,"t":50}},{"type":"quest","id":"67586","obj":{"i":67586,"n":"Two Nations, One Seed","g":145,"l":"Ishgard","s":550,"f":1}},{"type":"quest","id":"67588","obj":{"i":67588,"n":"Seeds Know No Borders","g":145,"l":"Ishgard","s":600,"f":1}}]}