{"quest":{"name":"Onions of Life Bestowing","location":"Ishgard","id":67585,"patch":3.0,"sort":530,"icon":100449,"unlocksFunction":1,"eventIcon":71341,"issuer":1013240,"target":1013240,"involved":[1013241,1013244],"genre":145,"usedItems":[12878],"journal":["Mujih Mewrilah has received word of a task from Basyle.","In excited tones, Mujih informs you that Basyle has sent word of your very first task. Make your way to Camp Cloudtop in the Sea of Clouds, and ask the botanist what he requires of you.","The supply situation is grim at Camp Cloudtop, and Basyle begs your advice on a suitable crop to cultivate. Based on your response, he decides to try his luck on cyclops onions, which grow wild in the Dravanian forelands. Gather ten bulbs of the onion and bring them to Basyle.","You have delivered ten cyclops onions to Basyle, who declares that he will try growing them in the test plot. Satisfied that she has sufficient material for her first article, Mujih returns to Ishgard. Make your own way back and join her at the aetheryte plaza.","With evident pleasure, Mujih informs you that the first installment of her story will soon grace an edition of <span class=\"emphasis\">The Raven</span>. As before, she will remain in Ishgard to await further instructions from Basyle.<br><br>※The next botanist quest will be available from Mujih Mewrilah upon reaching level 55."],"objectives":["Speak with Basyle at Camp Cloudtop.","<span class=\"alternative-container\"><span class=\"alternative\">Harvest cyclops onions in the Dravanian forelands</span><span class=\"alternative\">Deliver the cyclops onions to Basyle at Camp Cloudtop</span></span>.","Speak with Mujih Mewrilah at the aetheryte plaza in Ishgard."],"dialogue":[{"name":"MUJIHMEWRILAH","text":"Perfect timing, <span class=\"highlight\">Forename</span>! Word arrived from Basyle not a moment ago."},{"name":"MUJIHMEWRILAH","text":"He has a task, and bids you come to Camp Cloudtop. Let us go at once!"},{"name":"MUJIHMEWRILAH","text":"“Seeds of Hope Sprout in the Sea of Clouds”... What do you think? Pretty inspired, even if I do say so myself!"},{"name":"BASYLE","text":"My thanks for coming on such short notice. To begin with, I'd like to ask your advice on crops that would thrive in this environment."},{"name":"BASYLE","text":"Right now, our principal crop is a strain of pumpkin native to these isles. With some experimentation, we've succeeded in cultivating it."},{"name":"BASYLE","text":"Unfortunately, hardly anything else grows that's a viable food source. It has something to do with the ratio of wind- to earth-aspected aether up here. There's a much higher concentration of the former, you see, and hardly any of the latter."},{"name":"BASYLE","text":"Gysahl greens are just about the only other thing that has worked out, and these aren't the same as what we have in Coerthas, either. It may interest you to know that the seeds came to us from Gridania, from the Botanists' Guild."},{"name":"BASYLE","text":"Roiteloin urged me to give them a try, and lo and behold, they cropped up like weeds. Strange things do happen, eh?"},{"name":"BASYLE","text":"But in the end, gysahl greens are fit only for chocobos, and what little I'm managing to grow at the moment doesn't make up for the shortfall of supplies."},{"name":"BASYLE","text":"If we're to keep feeding the garrison, we need to find more crops that grow, and set about growing them as soon as possible, or soon we'll all be supping on bird fodder. And so I'd like to ask your opinion: in selecting a crop, what quality is the most critical?"},{"name":"Q1","text":"What quality is the most critical?"},{"name":"A1","text":"Hardiness to cold."},{"name":"A1","text":"Hardiness to elevation."},{"name":"BASYLE","text":"I see... In that case, we might try our luck with onions."},{"name":"BASYLE","text":"I see... In that case, we might try a plant that's native to highland regions."},{"name":"BASYLE","text":"Ah, that reminds me! A hunter I spoke with recently mentioned having seen wild onions in the Dravanian forelands!"},{"name":"BASYLE","text":"Cyclops onions, they're called, and I fancy our chances of cultivating them. If we succeed, they would make a welcome addition to our rations. I'd be grateful if you could gather and bring me ten bulbs."},{"name":"BASYLE","text":"Have you gathered the cyclops onions? They can be found growing wild in the Dravanian forelands."},{"name":"BASYLE","text":"My, they're far larger than I had dared hope! My thanks, <span class=\"highlight\">Forename</span>. I shall try growing them in our test plot right away."},{"name":"MUJIHMEWRILAH","text":"A test plot, you say?"},{"name":"BASYLE","text":"That's right, miss. Before we grow something in earnest, we need to make certain that it won't be a detriment to other crops."},{"name":"BASYLE","text":"Though sustenance is important, so too is sustainability. If we don't think ahead, we're liable to damage the environment, and that would leave us with nothing."},{"name":"MUJIHMEWRILAH","text":"I see! Pioneers must be at once bold <span class=\"emphasis\">and</span> cautious─a delicate balancing act!"},{"name":"MUJIHMEWRILAH","text":"With that, I believe I have sufficient material for my first article! I'll go on back to Ishgard to send my notes to the chief editor. See you at the aetheryte plaza, <span class=\"highlight\">Forename</span>!"},{"name":"BASYLE","text":"My thanks for your advice as well as the onions. When I have another task for you, I'll send word to your retainer as before."},{"name":"MUJIHMEWRILAH","text":"Glad tidings, <span class=\"highlight\">Forename</span>! The chief editor was utterly taken by my draft, and the first installment of my series will soon grace <span class=\"emphasis\">The Raven</span>!"},{"name":"MUJIHMEWRILAH","text":"Oh, and lest you worry, I'll make sure to withhold names and locations. It's an Ishgardian outpost, after all, and we can't well have such details known to all and sundry. Ah, but have a listen to this:"},{"name":"MUJIHMEWRILAH","text":"“So it was that the dilemma of a suitable crop was solved, thanks to the ingenuity of one humble botanist."},{"name":"MUJIHMEWRILAH","text":"“It shall not be long ere this azure frontier is blanketed in life-giving cyclops onions.”<br>...That's how I'm planning to close the article!"},{"name":"MUJIHMEWRILAH","text":"I see you're not entirely convinced that the dilemma is “solved.” Well, it practically is! Only I can't write “practically”─the statement would lose something for it."},{"name":"MUJIHMEWRILAH","text":"As before, I'll remain in Ishgard to await word from Basyle. I look forward to the next task!"},{"name":"SYSTEM","text":"In blazing new trails as a botanist, you have learned “Tree Whisperer V”!"}],"reward":{"gil":2470,"items":[{"id":11951},{"id":11989,"one":1},{"id":11994,"one":1},{"id":12002,"one":1},{"id":12007,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":18}],"quests":[67584]},"next":[67586]},"partials":[{"type":"npc","id":"1013240","obj":{"i":1013240,"n":"Mujih Mewrilah","l":2300,"q":5}},{"type":"npc","id":"1013241","obj":{"i":1013241,"n":"Basyle","l":2100,"q":4}},{"type":"npc","id":"1013244","obj":{"i":1013244,"n":"Mujih Mewrilah","l":2100,"q":1}},{"type":"item","id":"11951","obj":{"i":11951,"n":"Mythrite Scythe","l":90,"c":38157,"t":31}},{"type":"item","id":"11989","obj":{"i":11989,"n":"Wyvernskin Jerkin","l":80,"c":42468,"t":35,"p":12355}},{"type":"item","id":"11994","obj":{"i":11994,"n":"Holy Rainbow Work Gloves","l":80,"c":44389,"t":37,"p":8870}},{"type":"item","id":"12002","obj":{"i":12002,"n":"Wyvernskin Culottes","l":80,"c":45691,"t":36,"p":9504}},{"type":"item","id":"12007","obj":{"i":12007,"n":"Wyvernskin Workboots","l":80,"c":46539,"t":38,"p":10137}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12878","obj":{"i":12878,"n":"Cyclops Onion","l":130,"c":25203,"t":45}},{"type":"quest","id":"67584","obj":{"i":67584,"n":"Call from the Clouds","g":145,"l":"Gridania","s":502,"f":1}},{"type":"quest","id":"67586","obj":{"i":67586,"n":"Two Nations, One Seed","g":145,"l":"Ishgard","s":550,"f":1}}]}