{"quest":{"name":"A Spoonful Less Sugar","location":"Limsa Lominsa","id":67580,"patch":3.0,"sort":530,"icon":100451,"unlocksFunction":1,"eventIcon":71341,"issuer":1012568,"target":1012568,"involved":[1012570,1012571],"genre":143,"usedItems":[12842,12846],"journal":["Melkoko has news for you regarding the Dellemont d'Or.","An excited Melkoko informs you that the Bismarck has been selected as the venue for the Dellemont d'Or. A member of the contest council has come to the restaurant to register participants. Melkoko bids you give your name to him and make your participation official.","You have registered as a participant in the Dellemont d'Or. Return to Melkoko at the Missing Member.","Melkoko receives the report of your successful registration with approval. All that remains is to prepare for the contest, and Melkoko immediately has a challenge to help you get into form. A diner is struggling to decide upon a dessert, and your task is to prepare something to suit her palate. Seek out the diner, a steerswoman of the Sanguine Sirens, and inquire after her preferences.","The steerswoman explains to you her dilemma: she cannot stand sweet things, but she must learn to eat them for the sake of preserving her relationship. Bear word of the diner's unusual requirements back to Melkoko.","Upon hearing your report, Melkoko swiftly concludes that the steerswoman simply has an aversion to the unfamiliar. As such, rather than abiding by the customer's wishes, she suggests that you make something that is unapologetically sweet. Prepare a Sohm Al tart and a cup of Ishgardian tea, and present them to Melkoko.","Caving in to Melkoko's unrelenting insistence, the steerswoman gingerly samples your Sohm Al tart and Ishgardian tea. To her astonishment and delight, she finds both to be delectable. Having thus conquered her fear of sweets, she leaves in high spirits, hopeful that things will work out between her and her beau. Having now seen you in action, Melkoko looks forward to the Dellemont d'Or with even greater relish.<br><br>※The next culinarian quest will be available from Melkoko upon reaching level 55."],"objectives":["Speak with the contest council member.","Speak with Melkoko.","Speak with the Sanguine Sirens steerswoman.","Report to Melkoko.","Synthesize a Sohm Al tart and a cup of Ishgardian tea <img class=\"hq-icon small\" src=\"images/item/hq.png\"> and deliver them to Melkoko."],"dialogue":[{"name":"MELKOKO","text":"Glad tidings, <span class=\"highlight\">Forename</span>─the Bismarck has been chosen to host the Dellemont d'Or! What better place to cook than in one's own kitchen?"},{"name":"MELKOKO","text":"A member of the contest council has come to the Culinarians' Guild to register participants. Please go and give him your name at once!"},{"name":"MELKOKO","text":"A member of the contest council has come to the Culinarians' Guild to register participants for the Dellemont d'Or. Please go and give him your name at once!"},{"name":"TAIKAIIIN","text":"Greetings to you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Have you come to register to compete in the Dellemont d'Or?"},{"name":"TAIKAIIIN","text":"...<span class=\"highlight\">Forename Surname</span>─is that correct? Very good, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. We look forward to seeing you on contest day."},{"name":"TAIKAIIIN","text":"We look forward to seeing you on contest day."},{"name":"MELKOKO","text":"You've registered your name? Excellent! Now you have but to prepare for the contest. Speaking of which, I have a task to help get you into form."},{"name":"MELKOKO","text":"One of our diners wishes to have dessert, but there's nothing to her liking on the menu. She's been sitting there for a whole hour, unable to make up her mind."},{"name":"MELKOKO","text":"As the guild's foremost culinarian, I believe you'll be able to whip up something to suit her palate. To begin with, you'll want to inquire after her preferences. It's the steerswoman at the table on the right, in case I haven't already mentioned it."},{"name":"MELKOKO","text":"I would be grateful if you could whip up a dessert to suit the steerswoman's palate. To begin with, you'll want to inquire after her preferences."},{"name":"KAIZOKUJOSHI2044","text":"Ugh, all these sweets look too damn...<span class=\"emphasis\">sweet</span>!<br>...Oi, don't rush me! I can't make decisions under pressure!"},{"name":"KAIZOKUJOSHI2044","text":"Eh? Ye'll make me a dessert what ain't on the menu? Yer a godssend, sister!"},{"name":"KAIZOKUJOSHI2044","text":"So, 'ere's the deal: I can't stand sweet things. Stuff makes me want to retch. Thing is, I've met a man who's perfect in all ways but one─bloke's got the sweetest bleedin' tooth this side o' Vylbrand."},{"name":"KAIZOKUJOSHI2044","text":"If we're to work out, I've got to learn to eat sweets. Or suppress the urge to gag, at least. That's why I'm 'ere─to train meself. This is me first time an' all, so be gentle with me, eh? Make me somethin' what ain't so sweet."},{"name":"KAIZOKUJOSHI2044","text":"This is me first time an' all, so be gentle with me, eh? Make me somethin' what ain't so sweet."},{"name":"MELKOKO","text":"...Did I hear you rightly? She says she doesn't like sweets? Oh, that's bollocks! I'd wager she's just afraid o' what she don't know!"},{"name":"MELKOKO","text":"Be gentle? Sod that! Let's feed 'er somethin' so brazenly sweet that it'll blow the skeptic clean out of 'er!"},{"name":"MELKOKO","text":"A Sohm Al tart made with a veritable mountain o' fresh cream an' sugar, accompanied with a rich cup of Ishgardian tea! That's yer order, <span class=\"highlight\">Forename</span>!"},{"name":"MELKOKO","text":"So, 'ow's the Sohm Al tart an' the Ishgardian tea comin' along?"},{"name":"KAIZOKUJOSHI2044","text":"...Hurrrgh! Th-This stuff looks sweet as sin! What 'appened to bein' gentle!?"},{"name":"MELKOKO","text":"Listen 'ere! <span class=\"highlight\">Forename</span> 'appens to be one of Eorzea's finest culinarians! Ye oughts to be honored <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">'e</span></span>'s cookin' fer yer sorry arse! What's more, ye want things to work out with yer man or not!?"},{"name":"KAIZOKUJOSHI2044","text":"Alright, alright! I'll try it! &lt;sob&gt;"},{"name":"KAIZOKUJOSHI2044","text":"Bugger me, that was <span class=\"emphasis\">good</span>! The chestnut wasn't near as cloyin' as I expected, an' the cream underneath was a pleasant surprise. 'Twas sweet, aye, but not <span class=\"emphasis\">too</span> sweet. An' there was somethin' else to it besides. Richness? Depth? Bah, I don't know what the 'ells it's called."},{"name":"KAIZOKUJOSHI2044","text":"As fer the tea, I quaffed it quick as I drain me ale. Ain't much more to say about that! Ahhh, I don't fear sweets no more, an' it's all thanks to the two o' ye! Things'll work out between me an' me man, I'm sure of it!"},{"name":"MELKOKO","text":"You've done it, <span class=\"highlight\">Forename</span>! You've converted a skeptic! By holding back on the chestnut purée's sweetness, you helped her to overcome her irrational fear and so introduced her to a whole new world of flavors. Ah, this does take me back..."},{"name":"MELKOKO","text":"You will have guessed from my colorful language, but I used to be a member of the Sanguine Sirens. Unfortunately, I was prone to seasickness, and it never got better. As a result, I ended up grounded and waitressing for the Missing Member."},{"name":"MELKOKO","text":"At first I loathed the work. I hated that my dreams were taken from me, just because I couldn't keep the contents of my stomach where they belong. It was then, when I was wallowing in self-pity, that I first tasted H'mhasi Tia's cooking. It made me know that I was a part of something special here."},{"name":"MELKOKO","text":"Back then, H'mhasi Tia was a simple man with a simple passion. He wanted to be at the pinnacle of his craft, and he worked tirelessly to reach it. But then he did, and it turned 'im into a stuck-up, self-lovin' sack o' shite!"},{"name":"MELKOKO","text":"...Ahem. Beg your pardons again. My old mannerisms tend to surface when I'm riled up. At any rate, thank you for your help today! Having now seen you in action, I look forward to the Dellemont d'Or with even greater relish!"}],"reward":{"gil":567,"items":[{"num":160,"id":8},{"id":11943},{"id":11961,"one":1},{"id":11966,"one":1},{"id":11974,"one":1},{"id":11979,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":16}],"quests":[67579]},"next":[67581]},"partials":[{"type":"npc","id":"1012568","obj":{"i":1012568,"n":"Melkoko","l":28,"q":6}},{"type":"npc","id":"1012570","obj":{"i":1012570,"n":"Contest Council Member","l":28,"q":1}},{"type":"npc","id":"1012571","obj":{"i":1012571,"n":"Sanguine Sirens Steerswoman","l":28,"q":1}},{"type":"item","id":"11943","obj":{"i":11943,"n":"Mythrite Culinary Knife","l":90,"c":35757,"t":27}},{"type":"item","id":"11961","obj":{"i":11961,"n":"Holy Rainbow Coatee","l":80,"c":42469,"t":35,"p":9884}},{"type":"item","id":"11966","obj":{"i":11966,"n":"Holy Rainbow Gloves","l":80,"c":48264,"t":37,"p":7096}},{"type":"item","id":"11974","obj":{"i":11974,"n":"Holy Rainbow Bottoms","l":80,"c":45692,"t":36,"p":7603}},{"type":"item","id":"11979","obj":{"i":11979,"n":"Holy Rainbow Shoes","l":80,"c":46540,"t":38,"p":8110}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12842","obj":{"i":12842,"n":"Ishgardian Tea","l":130,"c":24408,"t":46}},{"type":"item","id":"12846","obj":{"i":12846,"n":"Sohm Al Tart","l":136,"c":24077,"t":46}},{"type":"quest","id":"67579","obj":{"i":67579,"n":"Wait on Me","g":143,"l":"Limsa Lominsa","s":502,"f":1}},{"type":"quest","id":"67581","obj":{"i":67581,"n":"Looking for Some Hot Stuff","g":143,"l":"Limsa Lominsa","s":550,"f":1}}]}