{"quest":{"name":"The Spirit of Hospitality","location":"Limsa Lominsa","id":67583,"patch":3.0,"sort":600,"icon":100451,"unlocksFunction":1,"eventIcon":71341,"issuer":1012568,"target":1012568,"involved":[1000947,1012575,1012576],"genre":143,"usedItems":[12854,12860,12847],"journal":["Melkoko is eager to help get you started in the Dellemont d'Or.","The long-awaited Dellemont d'Or has begun. Melkoko takes a moment to warn you that Master Dellemont is notoriously difficult to impress, and goes on to say that it will be a two–chocobo race between you and H'mhasi Tia. Before you do aught else, seek out Master Dellemont at the Bismarck and have the particulars of the contest from him.","Having informed you that you are the final contestant, Dellemont furnishes you with the particulars of the contest. Of a three-course meal, the main course is to be a meat dish, while the overall theme is hospitality. Bear word of this back to Melkoko at the Missing Member.","As the final contestant, you are at a disadvantage, for Dellemont will be hard-pressed to keep his appetite whetted by the time he tastes your cooking. Bearing this fact in mind, and with Melkoko's guidance, you decide upon a course consisting of morel salad, deep-fried okeanis, and marron glace. Draw upon all your culinary skills to create the finest samples of these dishes, and present them to the contest council member at the Bismarck.","You present your dishes to the contest council member, who lays them out for judging. After a tense few heartbeats, Dellemont awards you a perfect ten─the first in the entire history of the contest, and a point above H'mhasi Tia's nine. So it is that you are crowned champion. Dellemont takes a moment to explain what it was that divided you and your rival. While H'mhasi Tia's creations were magnificent in their own right, they lacked the spirit of hospitality that defined your dishes. H'mhasi admits defeat and runs off distraught, with Melkoko hot on his heels. Follow the couple back to the Missing Member and ensure that all is well between them.","You bear witness as Melkoko and H'mhasi Tia make their peace with one another. It is revealed that H'mhasi Tia's apparent laziness was simply an act of posturing, and he had been training hard for the contest in secret. With Rhoswen's permission, he decides to journey the realm in order to become as great a culinarian as you, and Melkoko promises that she will wait for him. After the others leave, Melkoko thanks you for being an inspiration to her and H'mhasi Tia. In turn inspired by her praise, you are determined to be the best culinarian you can be, and a worthy champion of the Dellemont d'Or.<br><br>※The next culinarian quest will be available from Lyngsath once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Dellemont.","Report to Melkoko.","Deliver a morel salad <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a deep-fried okeanis <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a marron glace <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the contest council member.","Speak with Melkoko."],"dialogue":[{"name":"MELKOKO","text":"It's begun, <span class=\"highlight\">Forename</span>─the Dellemont d'Or!"},{"name":"MELKOKO","text":"In case you didn't already know, Master Dellemont is notoriously difficult to impress. In the entire history of the contest, no one has ever been awarded the full ten points, and even respected chefs typically get only four. This time, I believe it will be a two-chocobo race between you and H'mhasi Tia."},{"name":"MELKOKO","text":"Now then, before you do aught else, you will need to know the particulars such as main ingredient and theme. Please go to the Bismarck and have them from Master Dellemont!"},{"name":"MELKOKO","text":"Before you do aught else, you will need to know the particulars such as main ingredient and theme. Please go to the Bismarck and have them from Master Dellemont!"},{"name":"LYNGSATH","text":"I believe in ye, <span class=\"highlight\">Forename</span>! I know ye can win the Dellemont d'Or an' save the Bismarck...<span class=\"emphasis\">and</span> me arse!"},{"name":"DELLEMMONT","text":"There you are, my friend. According to the registry, you are our final contestant."},{"name":"DELLEMMONT","text":"This year, the main ingredient is meat. It matters not what kind. This is to be used in the main course, which you must present with an appetizer and a dessert."},{"name":"DELLEMMONT","text":"As for the theme, it is “hospitality.” Prepare your dishes in the spirit of this theme, then present them to the council member yonder. Best of luck to you!"},{"name":"DELLEMMONT","text":"In case you have forgotten, the main ingredient is meat and the theme is hospitality. When your dishes are ready, present them to the council member yonder. Best of luck to you!"},{"name":"TAIKAIIIN","text":"This is proving to be the liveliest Dellemont d'Or in recent memory!"},{"name":"MELKOKO","text":"Meat and hospitality... Bugger, this is a tough one. The main ingredient is as broad as they come, and the theme is abstract to boot. It also worries me that you're the last contestant."},{"name":"MELKOKO","text":"Among other things, Master Dellemont is famous for his bottomless stomach, but even he would be hard-pressed to keep his appetite whetted after endless plates of meat. Well, I suppose we'll just have to trust to his objectivity. Now then, what do you have in mind for an appetizer?"},{"name":"Q1","text":"What do you have in mind for an appetizer?"},{"name":"A1","text":"Something to aid digestion."},{"name":"A1","text":"Something light and gentle."},{"name":"MELKOKO","text":"Ah, indeed. In which case, I believe mushrooms are a sound choice. Yes, let's go with the light and refreshing morel salad!"},{"name":"MELKOKO","text":"Moving on, what will you do for the all-important main course?"},{"name":"Q1","text":"What will you do for the main course?"},{"name":"A1","text":"A dish that satisfies with texture."},{"name":"A1","text":"A dish that is flavorful and succulent."},{"name":"MELKOKO","text":"Hmmm, what would fit the bill...? Ah, I have it: deep-fried okeanis!"},{"name":"MELKOKO","text":"Now, for this dish, the breading is the key to success, but it's also very difficult to get right. Please ensure that it turns out light and crisp."},{"name":"MELKOKO","text":"And last but not least, the dessert! Your Sohm Al tart was so well received, what do you think about making it again?"},{"name":"Q1","text":"What will you do for dessert?"},{"name":"A1","text":"Something small and decisively sweet."},{"name":"A1","text":"A simple dish with a simple flavor."},{"name":"MELKOKO","text":"Ah, so something that can be enjoyed even on a full stomach. In which case, I wholeheartedly recommend a serving of marron glace."},{"name":"MELKOKO","text":"And with that, our course is decided. The rest is up to you, <span class=\"highlight\">Forename</span>. When you have prepared all three dishes, present them to the contest council member at the Bismarck. I shall pray for your success!"},{"name":"MELKOKO","text":"The rest is up to you, <span class=\"highlight\">Forename</span>. When you have prepared all three dishes, present them to the contest council member at the Bismarck. I shall pray for your success!"},{"name":"TAIKAIIIN","text":"If your dishes are ready, I shall lay them out for Master Dellemont."},{"name":"HMHASITIA","text":"I was just awarded the highest score in the history of the Dellemont d'Or. The Bismarck is as good as mine."},{"name":"MELKOKO","text":"Aren't ye gettin' ahead o' yerself!? <span class=\"highlight\">Forename</span> can still beat yer nine bloody points!"},{"name":"HMHASITIA","text":"Hah, Master Dellemont will never award a perfect ten. It would be tantamount to declaring that his legend has been surpassed─not a decision to be made lightly."},{"name":"DELLEMMONT","text":"Without further ado..."},{"name":"TAIKAIIIN","text":"Master Dellemont. The score, if you would!"},{"name":"TAIKAIIIN","text":"Eight points! Meaning that victory goes to..."},{"name":"TAIKAIIIN","text":"N-No! It's <span class=\"emphasis\">nine</span> points! We have a tie at the highest score ever awarded!"},{"name":"DELLEMMONT","text":"PERFECT TEN!"},{"name":"TAIKAIIIN","text":"We have a winner: <span class=\"highlight\">Forename Surname</span>, with the first perfect ten in history!"},{"name":"HMHASITIA","text":"H-How can this be? Master Dellemont, you were shaking your head..."},{"name":"DELLEMMONT","text":"It was not out of disappointment, I assure you. Nay, I was simply coming to terms with reality─the reality that a culinarian has finally appeared who surpasses me."},{"name":"DELLEMMONT","text":"First of all, the appetizer. After a long day of judging, the mushrooms helped to absorb the grease that had collected in my stomach, giving it a new lease on life─an act of consideration worthy of the most devoted of mothers."},{"name":"DELLEMMONT","text":"Then came the main course. Sinking my teeth into the breading, delightfully light and crisp, my tongue was greeted with a harmony of flavors, which burst forth from the succulent cut of okeanis beneath. That great love went into making it tender was plain to my senses."},{"name":"DELLEMMONT","text":"And finally, dessert. Truth be told, by this time I was ripe to burst, but compact as it was, I could comfortably squeeze in the marron glace, whose concentrated sweetness served as the perfect accent to a wonderful meal. From the first bite to the last, I felt the spirit of hospitality."},{"name":"DELLEMMONT","text":"In the end, it was <span class=\"highlight\">Forename</span>'s interpretation of the theme which divided <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> from the field. Rather than striving to astonish with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> handiwork, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> kept the diner foremost in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> mind."},{"name":"MELKOKO","text":"Consideration worthy of the most devoted mother... This is something you learned through the Ishgardian beet soup!"},{"name":"LYNGSATH","text":"An' it seems to me ye made the okeanis 'specially tender by marinatin' it, like when ye made the cockatrice meatballs fer me friend!"},{"name":"DELLEMMONT","text":"H'mhasi Tia. Your dishes were magnificent, make no mistake. None could doubt that great skill went into their creation."},{"name":"DELLEMMONT","text":"However, more so than a thing to be created, food is a thing to be eaten. You had forgotten this, and it made all the difference."},{"name":"HMHASITIA","text":"I've lost. As promised, I'll give up being a culinarian."},{"name":"MELKOKO","text":"Mh-Mhasi–Bee! Waaait!"},{"name":"DELLEMMONT","text":"Congratulations, my friend. And thank you. For the first time in a long while, I have tasted food that satisfied not only my senses, but my soul as well. I look forward to seeing you again, not as judge and contestant, but as peers."},{"name":"LYNGSATH","text":"Whew... The Bismarck's safe, thanks to you. If Melkoko pulls the same shite again, though, I'm throwin' 'er off the upper decks. But speakin' o' the girl, might be as ye should check up on 'er an' H'mhasi Tia. They went off in the direction o' the Missin' Member."},{"name":"LYNGSATH","text":"Might be as ye should check up on Melkoko an' H'mhasi Tia. They went off in the direction o' the Missin' Member."},{"name":"MELKOKO","text":"Ye can't just give up!"},{"name":"HMHASITIA","text":"But <span class=\"emphasis\">you're</span> the one who wanted me to! You made me swear it!"},{"name":"MELKOKO","text":"I-I only did it 'cause ye was shirkin' yer duties! I wanted the old Mhasi–Bee back, the one who'd work at 'is cookin' every wakin' moment!"},{"name":"HMHASITIA","text":"Fool of a Lalafell! I was shirking so that I could prepare for the contest in secret!"},{"name":"HMHASITIA","text":"I didn't want to betray any hint of effort to my rivals. The unassailable champion─that's the aura I wanted to exude."},{"name":"MELKOKO","text":"&lt;sigh&gt; So dreamy... I-I mean, I beg ye, Mhasi─don't give up bein' a culinarian! I can't bear the thought o' not bein' able to eat yer cookin' no more!"},{"name":"HMHASITIA","text":"Well, if my Melly-Belly insists, I suppose there's nothing for it but to keep doing what I do best."},{"name":"RHOSWEN","text":"Will ye keep it down!? We've all 'ad a gutful o' yer lovers' farce!"},{"name":"RHOSWEN","text":"So, ye didn't win. That's too bad. What do ye intend to do now?"},{"name":"HMHASITIA","text":"Captain, if you will permit it, I would beg leave of your service for a time."},{"name":"HMHASITIA","text":"This adventurer possesses something I do not. In journeying the realm as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does, I hope that I will come to possess it as well."},{"name":"RHOSWEN","text":"If that's what ye want, then I won't stop ye. But what about Melkoko 'ere? Ye just gonna leave 'er be'ind? If ye make 'er cry, I won't 'esitate to make this place live up to its name."},{"name":"HMHASITIA","text":"I must leave your side for a while, Melly–Belly. But upon my honor, I swear that I'll return to you and make you proud."},{"name":"MELKOKO","text":"I know you will, Mhasi-Bee. I'll wait for you─forever and a day!"},{"name":"RHOSWEN","text":"<span class=\"emphasis\">Finally</span>, some peace an' quiet."},{"name":"MELKOKO","text":"I owe you an apology, <span class=\"highlight\">Forename</span>. It was wrong of me to embroil you in my personal affairs."},{"name":"MELKOKO","text":"But it wasn't all to the bad. You were a positive influence upon Mhasi and me."},{"name":"MELKOKO","text":"Thanks to you, he was reminded what it means to be a culinarian, and I've come to love my job even more than I already did."},{"name":"MELKOKO","text":"All of this was made possible through your cooking. You've taken a humble thing and given it the power to change lives."},{"name":"MELKOKO","text":"Thank you, <span class=\"highlight\">Forename</span>─for being an inspiration to us all! And a belated congratulations for winning the Dellemont d'Or! A more worthy champion there has never been!"},{"name":"SYSTEM","text":"This concludes the culinarian quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next culinarian quest will be available from Lyngsath."}],"reward":{"gil":843,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":16}],"quests":[67582]},"next":[68140]},"partials":[{"type":"npc","id":"1012568","obj":{"i":1012568,"n":"Melkoko","l":28,"q":6}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1012575","obj":{"i":1012575,"n":"Dellemont","l":28,"q":1}},{"type":"npc","id":"1012576","obj":{"i":1012576,"n":"Contest Council Member","l":28,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12854","obj":{"i":12854,"n":"Morel Salad","l":150,"c":24207,"t":46}},{"type":"item","id":"12860","obj":{"i":12860,"n":"Deep-fried Okeanis","l":150,"c":24363,"t":46}},{"type":"item","id":"12847","obj":{"i":12847,"n":"Marron Glace","l":148,"c":24076,"t":46}},{"type":"quest","id":"67582","obj":{"i":67582,"n":"Love Meat Tender","g":143,"l":"Limsa Lominsa","s":580,"f":1}},{"type":"quest","id":"68140","obj":{"i":68140,"n":"Flavors of the Far East","g":143,"l":"Limsa Lominsa","s":601,"f":1}}]}