{"quest":{"name":"Looking for Some Hot Stuff","location":"Limsa Lominsa","id":67581,"patch":3.0,"sort":550,"icon":100451,"unlocksFunction":1,"eventIcon":71341,"issuer":1012568,"target":1012568,"involved":[1000915,1000918,1000947,1012572],"genre":143,"usedItems":[12849,12862,12855],"journal":["Melkoko is wearing a look of equal parts delight and mischief.","With barely restrained giddiness, Melkoko shares with you her pleasure at having witnessed H'mhasi Tia being humbled by Rhoswen. That pleasure was short-lived, however, for Rhoswen then directed her displeasure at her. She is tasked with coming up with a piping hot soup dish for her mistress, and this task now falls to you. Melkoko suggests that you speak with Lyngsath to learn of Rhoswen's preferences in soup.","You approach Lyngsath for Rhoswen's preferences, who reveals that the good captain has been obsessed with Ishgardian cuisine of late. However, he refuses to go into more detail on account of the culinarian-customer relationship. If you desire further information, it appears you will need to speak with the good captain herself.","Rhoswen reveals to you her plot to entrap and do away with her rival, Carvallain, and for this she needs to know the man's favorite cuisine. To this end, she bids you go to the Seventh Sage and ask him the name of the best Ishgardian chef. The coinpurse she gave you should serve to loosen the man's tongue.","The coinpurse does the trick, and Carvallain tells you that the head chef of House Durendaire is the foremost authority in Ishgardian cuisine. Though he withholds the man's name, Carvallain provides you with a bottle of Lohmani red to help facilitate your meeting. Make your way to Ishgard and search for the chef in the vicinity of Durendaire Manor.","Delighted for the gift of Lohmani red, the House Durendaire chef is pleased to teach you all about the humble but ubiquitous beet soup. He goes on to impress upon you his belief that love is an essential ingredient in every dish, and in closing gives you the names of popular accompaniments to the soup. Prepare a bowl of beet soup, a kaiser roll, and a serving of grilled sweetfish, and present them to Melkoko.","Rhoswen is deeply impressed with your beet soup, and declares that she will have H'mhasi Tia master the recipe. After Melkoko takes her leave, Rhoswen reveals to you a shocking revelation: Melkoko is actually infatuated with H'mhasi Tia. Though you struggle to reconcile this fact with her plan to humble him at the Dellemont d'Or, for now you must remain focused on preparing for the contest, all the while keeping close to heart the secret ingredient: love.<br><br>※The next culinarian quest will be available from Melkoko upon reaching level 58."],"objectives":["Speak with Lyngsath.","Speak with Rhoswen.","Deliver the heavy coinpurse to Carvallain.","Deliver the bottle of Lohmani red to the House Durendaire chef near Durendaire Manor.","Deliver a bowl of beet soup <img class=\"hq-icon small\" src=\"images/item/hq.png\">, a kaiser roll <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and a serving of grilled sweetfish <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Melkoko."],"dialogue":[{"name":"MELKOKO","text":"<span class=\"highlight\">Forename</span>, ye've got to 'ear this! That bastard H'mhasi Tia is <span class=\"emphasis\">depressed</span>! Ain't it just grand!?"},{"name":"MELKOKO","text":"Cap'n Rhoswen bade 'im invent a new kind o' soup, ye see, an' so 'e goes off an' makes this fancy-arse chilled potage."},{"name":"MELKOKO","text":"When it's ready, 'e serves it to 'er, smug as ye please. But the instant she tastes it, 'er face goes dark an' she says, “What the 'ells is this slop?” Oh, it was bleedin' glorious, I tells ye!"},{"name":"MELKOKO","text":"...Ahem. Unfortunately, my pleasure was short-lived, for the captain then fixed her gaze on me. She ordered me to think up a piping hot soup, fairly barking as she did so. And until we make her something to her satisfaction, I fear she'll remain in a foul mood."},{"name":"MELKOKO","text":"Though she has her own place, Captain Rhoswen often dines at the Bismarck in secret. I daresay Master Lyngsath has a good grasp of her preferences. Could you please find out from him a soup she is certain to like, then prepare it for her?"},{"name":"MELKOKO","text":"I daresay Master Lyngsath has a good grasp of Captain Rhoswen's preferences. Could you please find out from him a soup she is certain to like, then prepare it for her?"},{"name":"LYNGSATH","text":"Well, 'ello there, <span class=\"highlight\">Forename</span>. Yer contest preparations're comin' along well, so I 'ear. Seein' ye 'ard at it takes me back, it does. In me younger days, I participated in nigh every edition o' the Dellemont d'Or."},{"name":"LYNGSATH","text":"...Why not enter again, ye ask? Truth be told, I was sorely tempted, but me competin' days're far be'ind me. Besides, I don't like me chances with you around! Hahaha! Anyroad, was there somethin' ye need?"},{"name":"LYNGSATH","text":"Cap'n Rhoswen's 'ankerin' fer a pipin' 'ot soup, eh? 'Ardly surprisin'─o' late, the woman's been fairly obsessed with Ishgardian cuisine."},{"name":"LYNGSATH","text":"...An' that's all I can tell ye. Sorry fer bein' sparse with the details, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>, but if ye wants to know more, ye'll 'ave to ask the good cap'n 'erself."},{"name":"LYNGSATH","text":"...An' that's all I can tell ye. Sharp as ye are, ye'll prob'ly piece it all together eventually. But if ye wants to know fer certain, ye'll 'ave to ask the good cap'n 'erself."},{"name":"LYNGSATH","text":"Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>, but I can't talk to ye about Cap'n Rhoswen's preferences. It's bad fer me 'ealth, if ye catch me drift. If ye wants to know more, ye'll 'ave to ask the good cap'n 'erself."},{"name":"MELKOKO","text":"Please find out what kind of soup Captain Rhoswen likes, and make it for her!"},{"name":"RHOSWEN","text":"...Me, obsessed with Ishgardian cuisine? Hah! Never 'eard nothin' more ridiculous!"},{"name":"RHOSWEN","text":"I wouldn't be caught dead sharin' an interest with Carvallain, much less study up on Ishgardian soups fer the puffy-shirted fop!"},{"name":"RHOSWEN","text":"...Oh, bugger me. &lt;sigh&gt; Alright, alright, I'll tell ye everythin'."},{"name":"RHOSWEN","text":"I'm tryin' to set a trap fer Carvallain. The plan's to lure the bastard over with 'is favorite dish an' ply 'im with drink. An' when 'e lowers 'is guard, I do fer 'im. Ye so much as breathe a word o' this to anyone, I'll cut out yer blabbin' tongue an' 'ave it served in a stew!"},{"name":"RHOSWEN","text":"Hmmm... Seein' as yer now in on the plan, I might as well make use o' ye. I wants ye to go to Carvallain an' ask after the best Ishgardian chef around. Once ye've got a name, find the fellow an' 'ave 'im teach ye 'ow to make a traditional Ishgardian soup."},{"name":"RHOSWEN","text":"Actin' at Melkoko's behest, ye say? Aye, well, do this fer me, an' I'll consider 'er task fulfilled."},{"name":"RHOSWEN","text":"Now, ye'll find Carvallain at the Seventh Sage. 'Ere's a bag o' coin to 'elp loosen 'is tongue."},{"name":"RHOSWEN","text":"Ye'll find Carvallain at the Seventh Sage. The bag o' coin I gave ye ought to 'elp loosen 'is tongue."},{"name":"LYNGSATH","text":"Ye got the information yer after? Good, good."},{"name":"CARVALLAIN","text":"You wish to know the name of the best Ishgardian chef in the land? I struggle to comprehend why you would ask me this, of all questions."},{"name":"CARVALLAIN","text":"Hm, I find my interest in your motive suddenly waning. It seems unlikely that this knowledge can be used to make mischief, so very well."},{"name":"CARVALLAIN","text":"As a well-traveled adventurer, you will doubtless be familiar with House Durendaire of Ishgard. Its head chef is said to be the foremost authority in the cuisine of his native land."},{"name":"CARVALLAIN","text":"In seeking him out, aside from the obvious signs such as garb, look for a golden bell upon his breast. It is the sigil of the house he serves.<br>...Hm? You wish to know his name? Ah, but where would the fun be in that?"},{"name":"CARVALLAIN","text":"Now, as an accomplished culinarian, he will most certainly have a taste for fine wines. When you meet the man, make him a gift of this bottle of Lohmani red. Say that it comes from an admirer from across the seas."},{"name":"CARVALLAIN","text":"When you meet the head chef of House Durendaire, make him a gift of the bottle of Lohmani red. Say that it comes from an admirer across the seas."},{"name":"RHOSWEN","text":"Do this fer me, an' I'll consider Melkoko's task fulfilled."},{"name":"DRYOURININ02045","text":"Indeed I am the head chef of House Durendaire. What is it you require of me?"},{"name":"DRYOURININ02045","text":"By the Fury! Seldom do we enjoy fine vintages such as this! I was not aware that I had admirers, let alone that they are so widespread as to be found in Limsa Lominsa!"},{"name":"DRYOURININ02045","text":"You wish to learn a recipe for a traditional Ishgardian soup? You will find none more ubiquitous than beet soup. It graces the tables of all Ishgardians, warming the hearts and stomachs of lowborn and highborn alike."},{"name":"DRYOURININ02045","text":"The ingredients, chief among which is the magma beet, are sliced and sautéed, after which the broth is added along with the seasoning. The concoction is then allowed to simmer until everything is stewed together and the broth takes on a rich crimson hue."},{"name":"DRYOURININ02045","text":"Now, there are as many variations of the soup as there are people who make it, but the one nearest to my heart is that which my dear mother used to make. I was sickly as a child, you see, and she would add copious amounts of vegetables in the hopes that I would grow strong.<br>Through her cooking, I felt her love, and everything tasted all the better for it. Call me a sentimental fool, but it is my belief that love is an essential ingredient in every dish."},{"name":"DRYOURININ02045","text":"A final note: for those Ishgardians of means, beet soup is typically served alongside a kaiser roll and grilled sweetfish. I hope this information serves you well. My thanks again for the wine."},{"name":"DRYOURININ","text":"Beet soup is typically served alongside a kaiser roll and grilled sweetfish. I hope this information serves you well. My thanks again for the wine."},{"name":"CARVALLAIN","text":"I trust your meeting with House Durendaire's head chef was educational. Your asking after him reminded me of the time I first tasted his cuisine. I should like the chance to do so again."},{"name":"MELKOKO","text":"Ah, there you are, <span class=\"highlight\">Forename</span>! You were gone for so long, I was beginning to worry. Tell me, were you able to find a soup to please Captain Rhoswen?"},{"name":"MELKOKO","text":"Thank you so much! So, this is the dish that she'll use to lure Carvallain over with..."},{"name":"MELKOKO","text":"Aye, I know all about her plan. It's hard not to hear the captain's impassioned rants when you're standing right outside the door. I won't mention this to her, though."},{"name":"MELKOKO","text":"&lt;sigh&gt; To think that she's still at it─going after Carvallain, that is. When will she own up to her feelings? Stubborn as she is, probably never. At any rate, we shouldn't keep her waiting. Let's have her sample your handiwork, shall we?"},{"name":"RHOSWEN","text":"This soup's bleedin' amazin'! It tastes like...like <span class=\"emphasis\">'ome</span>, even though I'd never tasted it till now. 'Ow the 'ells do ye make it?"},{"name":"RHOSWEN","text":"Let me get this straight: the secret ingredient's love? Sort o' makes sense, the way ye puts it.<br>...Melkoko! Go an' let H'mhasi Tia know I wants 'im to master this soup!"},{"name":"MELKOKO","text":"Aye, aye, Captain!"},{"name":"RHOSWEN","text":"...When will that girl own up to 'er feelin's? She's right moony fer H'mhasi Tia, yet 'ere she is tryin' to bring 'im down."},{"name":"RHOSWEN","text":"Aye, I know all about 'er plan. I mean, 'ow couldn't I, when she rants about 'im right outside the door with a voice what'll wake the dead?"},{"name":"RHOSWEN","text":"Me, I don't give two shites about the contest, but I can't 'elp but worry fer Melkoko. Seems to me she 'asn't thought things through."}],"reward":{"gil":1779,"items":[{"num":200,"id":8},{"id":11900},{"id":11962,"one":1},{"id":11975,"one":1},{"id":11980,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":16}],"quests":[67580]},"next":[67582]},"partials":[{"type":"npc","id":"1012568","obj":{"i":1012568,"n":"Melkoko","l":28,"q":6}},{"type":"npc","id":"1000915","obj":{"i":1000915,"n":"Carvallain","l":28,"q":6}},{"type":"npc","id":"1000918","obj":{"i":1000918,"n":"Rhoswen","l":28,"q":4}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1012572","obj":{"i":1012572,"n":"House Durendaire Chef","l":2301,"q":1}},{"type":"item","id":"11900","obj":{"i":11900,"n":"Titanium Frypan","l":100,"c":35719,"t":26,"p":13939}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"11980","obj":{"i":11980,"n":"Dhalmelskin Shoes","l":100,"c":46542,"t":38,"p":12672}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12849","obj":{"i":12849,"n":"Kaiser Roll","l":139,"c":24002,"t":46}},{"type":"item","id":"12862","obj":{"i":12862,"n":"Beet Soup","l":133,"c":24103,"t":46,"p":1105}},{"type":"item","id":"12855","obj":{"i":12855,"n":"Grilled Sweetfish","l":133,"c":24301,"t":46,"p":1053}},{"type":"quest","id":"67580","obj":{"i":67580,"n":"A Spoonful Less Sugar","g":143,"l":"Limsa Lominsa","s":530,"f":1}},{"type":"quest","id":"67582","obj":{"i":67582,"n":"Love Meat Tender","g":143,"l":"Limsa Lominsa","s":580,"f":1}}]}