{"quest":{"name":"The Voice in the Abyss","location":"Ishgard","id":67591,"patch":3.0,"sort":350,"icon":100446,"unlocksFunction":1,"eventIcon":71341,"issuer":1014890,"target":1014893,"involved":[1006215,1014891,1014892],"genre":157,"journal":["Fray has been waiting for you for a long time.","The voice, some say, is a beacon, guiding the dark knight to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> true calling. As you grow more accustomed to drawing upon your darkside, you will come to hear the voice more clearly. Such are Fray's words to you when you ask <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> of the voice. Communion will hasten this process, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> continues─but it cannot be conducted in Ishgard. Journey with Fray to Little Ala Mhigo in southern Thanalan.","“I want you to kill something for me,” Fray asks. “Something fearsome, which will push you to your limits.” <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> wants to watch you thrive in that moment. And you want to show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. Gundobald should know of a suitable creature.","It saddens you to see how weak and complacent Gundobald has grown, and how his cowardice has spread amongst his people. They fear to tread near the lairs of mere peistes. But you do not. At least he furnished you with aldgoat meat for bait.","Fray stands apart, waiting for you to show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> who you are. Find a suitable location for the bait.","You feel <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> eyes upon you, expectant. Hungry─like yours. Where are those godsdamned peistes...?","A dead peiste lies at your feet, and you feel alive. Somehow, you know Fray is smiling.","To mete out justice, one must be strong─a simple truth which you already knew, of course. You are ready for communion, but it will not be conducted here. South of Little Ala Mhigo─Fray is waiting for you there.","Fray bids you approach and begin the rite of communion. Close your eyes and hold out your hand. Breathe deep through your nose─let the air fill your lungs, then let it pass from your lips. Slower, slower...","In the abyss, a wanderer's voice sings to you. Forever moving, without rest or respite... Though its meaning yet eludes you, Fray tells you not to be discouraged, further adding that it might belong to an individual whom you are fated to seek out. If so, none can say how long it might take to find them...but the mere thought of the journey stirs something within you...<br><br>※The next dark knight quest will be available from Fray upon reaching level 40."],"objectives":["Rendezvous with Fray in Little Ala Mhigo.","Speak with Gundobald.","Speak with Fray in the Red Labyrinth.","Place the aldgoat meat in the Red Labyrinth.","Lie in wait for a peiste.","Speak with Fray.","Rendezvous with Fray south of Little Ala Mhigo.","Commune with Fray."],"dialogue":[{"name":"FRAY","text":"I had a feeling you'd come by <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">today</span></span>, <span class=\"highlight\">Forename</span>. And sure enough, there you are, eager to pick up where we left off."},{"name":"FRAY","text":"Let's start with a question, then. You must be burning with several after that last affair."},{"name":"Q1","text":"What will you ask?"},{"name":"A1","text":"What was that voice I heard?"},{"name":"A1","text":"Why were you detained by the inquisition?"},{"name":"A1","text":"What became of the old woman and her granddaughter?"},{"name":"FRAY","text":"Ah, yes, the voice. The one you heard when you first touched the crystal. An excellent question, but a difficult one to answer."},{"name":"FRAY","text":"Some say it is a beacon, guiding the dark knight to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> true calling."},{"name":"FRAY","text":"Whose is it, you ask? Only you can discover that, for each knight must hearken to a different voice."},{"name":"FRAY","text":"As you grow more accustomed to drawing upon your darkside, you will come to hear it more clearly."},{"name":"FRAY","text":"Communion will hasten this process─but we dare not conduct the rites here, under the watchful eye of the Holy See."},{"name":"FRAY","text":"We will make for southern Thanalan. For Little Ala Mhigo."},{"name":"FRAY","text":"...Why do <span class=\"emphasis\">you</span> think I was detained by zealous Temple Knights who see heretics around every corner?"},{"name":"FRAY","text":"There was a girl. An innocent. They wanted her, and I objected."},{"name":"FRAY","text":"Now then, are you ready to stop dancing around the real question and just ask?"},{"name":"FRAY","text":"Oh, for the love of─ They're fine, both of them. You solved all of their problems. Happy?"},{"name":"FRAY","text":"Now then, are you ready to stop dancing around the real question and just ask?"},{"name":"FRAY","text":"Punctual as ever, I see."},{"name":"FRAY","text":"Communion, lest you worry, is rather simple. It is a ritual in which one nurtures the darkness within so that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> may channel it more effectively in battle."},{"name":"FRAY","text":"Do not, however, presume the risks to be any less than before. Should you partake of it in excess, you will die. Or worse. So before we begin, I want you to do me a favor."},{"name":"FRAY","text":"I want you to kill something for me."},{"name":"FRAY","text":"Something feral, something fearsome which will push you to your limits. I want to see you thrive in that moment. That way, I will know you are ready. Ask Gundobald─he should know of a suitable creature."},{"name":"FRAY","text":"Come on, let's get this over with. I know you're not having second thoughts."},{"name":"GUNDOBALD","text":"A pleasure to see you again, <span class=\"highlight\">Forename</span>. Do you require assistance?"},{"name":"GUNDOBALD","text":"Training? Well, if you seek dangerous beasts for that purpose, then..."},{"name":"GUNDOBALD","text":"The Red Labyrinth is home to peistes notorious for their size and vigor."},{"name":"GUNDOBALD","text":"Our trappers take great pains to avoid their nests, and those who do not bear scars for their folly."},{"name":"FRAY","text":"I pity the man who dies without scars. But these peistes sound promising. Tell me more."},{"name":"GUNDOBALD","text":"...They've attacked caravans loaded with aldgoat carcasses before. The smell drives them into a frenzy. This should serve to draw them out of hiding."},{"name":"GUNDOBALD","text":"<span class=\"highlight\">Forename</span>, I'll always be grateful for what you did. Those young ones were on the verge of making a terrible mistake, so consumed with anger were they."},{"name":"GUNDOBALD","text":"I hesitated to act, even though I saw it burning within them─as I see it burning within you now..."},{"name":"GUNDOBALD","text":"You...you seek the darkness within?"},{"name":"GUNDOBALD","text":"I will not claim to understand your meaning...but I wish you well in your training."},{"name":"FRAY","text":"Let's go."},{"name":"GUNDOBALD","text":"Take care, <span class=\"highlight\">Forename</span>. I trust you know what you are doing."},{"name":"FRAY","text":"Ah, they're close. I can feel their eyes upon us..."},{"name":"FRAY","text":"Well, we're here. Show me who you are, <span class=\"highlight\">Forename</span>. Show me what you can do."},{"name":"FRAY","text":"I'm waiting."},{"name":"FRAY","text":"They're just peistes, <span class=\"highlight\">Forename</span>. Don't pretend you haven't done this before."},{"name":"FRAY","text":"That wasn't so hard, now was it?"},{"name":"FRAY","text":"To mete out justice─to protect the weak from the strong and so forth─you yourself must be strong."},{"name":"FRAY","text":"Strength is pain. Strength is suffering. Strength is sacrifice."},{"name":"FRAY","text":"We must prepare for communion, but not here. Come, before more peistes are drawn by the smell."},{"name":"FRAY","text":"You look ready. Good. Now listen well."},{"name":"FRAY","text":"Close your eyes and hold out your hand towards me. Breathe deep through your nose─let the air fill your lungs, then let it pass from your lips. Slower, slower..."},{"name":"FRAY","text":"Listen to my voice. Listen to your heartbeat. Listen for the other..."},{"name":"SYSTEM","text":"With every breath you grow lighter and slip further into the abyss..."},{"name":"FRAY","text":"(-???-)One foot...in front of the other...over and over again..."},{"name":"FRAY","text":"(-???-)To the ends of the world...and back again..."},{"name":"FRAY","text":"(-???-)And if time has no end...still forward and onward...over and over again..."},{"name":"FRAY","text":"...So. What did you hear?"},{"name":"FRAY","text":"Interesting...but not terribly informative."},{"name":"FRAY","text":"But do not lose heart. That you were able to hear it once more is progress enough."},{"name":"FRAY","text":"I believe you will come to understand its words, and its will, in due time."},{"name":"FRAY","text":"...I should mention that, in some instances, the voice is said to be that of another─one whom the dark knight is fated to seek out. If that is the case, you may have a long journey ahead of you..."},{"name":"FRAY","text":"Heh, so you would welcome such a journey?"},{"name":"FRAY","text":"There is something to be said for it─and for travel, for that matter. To roam free and help those in need..."},{"name":"FRAY","text":"Yet no good deed goes unpunished, does it?"},{"name":"FRAY","text":"...I knew a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> once. Wanted to be a hero, do great things. And so <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did."},{"name":"FRAY","text":"The songs always end there. But life doesn't, does it?"},{"name":"FRAY","text":"...There are temptations more deadly than the darkside, <span class=\"highlight\">Forename</span>. You should've learned this by now, but you haven't. You will."},{"name":"FRAY","text":"The communion is ended, and with it, our time together. But we shall meet again, as we did before."}],"reward":{"action":3625,"xp":18040},"reqs":{"jobs":[{"lvl":35,"id":98}],"quests":[67590]},"next":[67592]},"partials":[{"type":"npc","id":"1014890","obj":{"i":1014890,"n":"Fray","l":2300,"q":4}},{"type":"npc","id":"1014893","obj":{"i":1014893,"n":"Fray","l":45,"q":1}},{"type":"npc","id":"1006215","obj":{"i":1006215,"n":"Gundobald","l":45,"q":13}},{"type":"npc","id":"1014891","obj":{"i":1014891,"n":"Fray","l":45,"q":1}},{"type":"npc","id":"1014892","obj":{"i":1014892,"n":"Fray","l":45,"q":1}},{"type":"action","id":"3625","obj":{"i":3625,"n":"Blood Weapon","c":3071,"j":32,"t":4,"l":35}},{"type":"quest","id":"67590","obj":{"i":67590,"n":"Ishgardian Justice","g":157,"l":"Ishgard","s":301,"f":1}},{"type":"quest","id":"67592","obj":{"i":67592,"n":"Heroic Reprise","g":157,"l":"Ishgard","s":400,"f":1}}]}