{"quest":{"name":"The Wages of Mercy","location":"Coerthas Central Highlands","id":67595,"patch":3.0,"sort":501,"icon":100447,"unlocksFunction":1,"eventIcon":71341,"issuer":1014909,"target":1013969,"involved":[1013970,1015030],"genre":157,"journal":["Shifting uneasily from side to side, the Temple Knight struggles to meet your gaze.","Apologizing for misjudging your character, the Temple Knight implores you to accompany him to the Behemoth's Dominion, as he has urgent need of one with your skills. Oblige the knight and lend what assistance you can.","Away from Whitebrim Front, the Temple Knight reveals his true intentions: to execute you for your crimes against his order. His comrades charge, swords bared, and so you have no choice but to defend yourself. After a brief struggle, you are once more left alone with the knight.","Even as he trembles with fear, the Temple Knight remains defiant, swearing to expose you for the abomination you are, even if it costs him his life. In that moment, a tall dark stranger approaches, offering to kill the knight in your stead. Before you can answer, the knight flees, leaving you with the stranger, who names himself Sidurgu, a dark knight who trained with Fray. Intrigued by your potential, he invites you to join him at the Forgotten Knight in Ishgard, where you might continue your conversation.","Recounting the story of the first dark knight, Sidurgu stresses that to walk his path is to live forever as an outcast. Presenting you with the sword of the man who tried to murder you, he declares that mercy is wasted on your foes. To further emphasize his point, he tells you of how the first Auri refugees to flee the imperial armies were attacked by Ishgardians, having been mistaken for Dravanians, and that even though the Au Ra showed mercy, the Ishgardians returned and slaughtered them all. As his voice trembles with rage, you take note of the young girl at his side. Though she avoids your gaze, you sense that she is watching you with a curious intensity...<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 52."],"objectives":["Speak with the unflinching Temple Knight south of the Behemoth's Dominion.","Speak with the unflinching Temple Knight.","Speak with Sidurgu in Ishgard."],"dialogue":[{"name":"TEMPLEKNIGHT02059","text":"It would seem, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, that my comrades have misjudged you. I realize this now, having witnessed the lengths to which Lord Drillemont will go for your sake."},{"name":"TEMPLEKNIGHT02059","text":"Aye, there can be no doubt that you are a true friend to Ishgard─which is fortunate, as we have urgent need of one with your skills. Pray accompany me to the Behemoth's Dominion at once."},{"name":"TEMPLEKNIGHT02059","text":"There is a demon among us, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>─a fiend which cannot be suffered to live!"},{"name":"TEMPLEKNIGHT02059","text":"Lord Drillemont may be willing to let a dangerous vigilante roam free, but we are not so foolish."},{"name":"TEMPLEKNIGHT02059","text":"What sort of hero maims and murders knights sworn to the Holy See!? None I know!"},{"name":"TEMPLEKNIGHT02059","text":"A heretic you are, and a heretic you shall die!"},{"name":"POPMESSAGE","text":"The Temple Knights draw their weapons and attack!"},{"name":"TEMPLEKNIGHT02059","text":"V-Vile fiend! Do not think you can conceal your true nature from them forever!"},{"name":"TEMPLEKNIGHT02059","text":"We will expose you for the abomination that you are! I swear it!"},{"name":"TEMPLEKNIGHT02059","text":"Wielder of dark arts! Consort of dragons! I will bring you to justice, even if it costs me my life!"},{"name":"SIDURGU","text":"(-???-)Shall we oblige him, then?"},{"name":"SIDURGU","text":"(-???-)Well? Are you going to kill him, or shall I?"},{"name":"TEMPLEKNIGHT02059","text":"Y-You're one of them too, aren't you!?"},{"name":"SIDURGU","text":"(-???-)This is the part where you beg for your life."},{"name":"TEMPLEKNIGHT02059","text":"L-Leave these lands if you value your lives! We will not show you mercy again!"},{"name":"SIDURGU","text":"(-???-)...I pray you do not make a habit of following men plotting to kill you into secluded areas."},{"name":"SIDURGU","text":"(-???-)Or did you learn naught from Fray?"},{"name":"SIDURGU","text":"(-???-)So you <span class=\"emphasis\">do</span> know of him..."},{"name":"SIDURGU","text":"(-???-)I thought him fallen at the trial, but then I heard whispers of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> seen wielding his sword in battle..."},{"name":"SIDURGU","text":"(-???-)So tell me: what became of him? How did you learn the arts?"},{"name":"SIDURGU","text":"(-???-)By the gods..."},{"name":"SIDURGU","text":"(-???-)...Though, now that I think on it, 'tis not the first time I have heard such a tale."},{"name":"SIDURGU","text":"(-???-)We who consort with the darkness are never truly whole. There will ever be a part of us yearning to be free..."},{"name":"SIDURGU","text":"(-???-)...We trained together, Fray and I. His was a strength beyond reckoning...but alas, it was not enough."},{"name":"SIDURGU","text":"(-???-)It warms my heart to see that you carry on his legacy. That you have learned as much as you have with only his soul crystal to guide you bespeaks your potential..."},{"name":"SIDURGU","text":"(-???-)There is a matter I would discuss with you, but not here."},{"name":"SIDURGU","text":"My name is Sidurgu. Pray look for me at the Forgotten Knight in Ishgard."},{"name":"RIELLE","text":"...Are you a friend of Sid's?"},{"name":"SIDURGU","text":"Given the circumstances under which you embarked upon this path, I fear you do not yet understand what it means to be a dark knight."},{"name":"SIDURGU","text":"The first of us bared steel against one of the clergy─this is true. He sacrificed everything he once held dear in the name of justice. So must all who would walk in his footsteps."},{"name":"SIDURGU","text":"Mayhap you think this will earn you the love of the common man. You are wrong. To many, you will forever be a criminal─a fiend who sows chaos and discord."},{"name":"SIDURGU","text":"These people will listen to the lies of our enemies. They will do their utmost to cast you out─or worse, as they did to Fray."},{"name":"SIDURGU","text":"If you are not prepared to deal with these consequences, then surrender your sword and soul crystal to me now."},{"name":"SIDURGU","text":"You claim conviction...but your actions speak otherwise."},{"name":"SIDURGU","text":"You spared a man who tried to murder you. Mercy, some would call it. Idiocy, I name it."},{"name":"SIDURGU","text":"Aye, that's right. I followed him and gave him the “mercy” he truly deserved!"},{"name":"SIDURGU","text":"...Look at me, <span class=\"highlight\">Forename</span>. Tell me what you see."},{"name":"SIDURGU","text":"The first Ishgardians to encounter Au Ra saw Dravanians. We had fled Garlemald's armies only to come to a land where we were mistaken for another nation's mortal enemy. They bared steel and came to kill us...but we did not die so easily."},{"name":"SIDURGU","text":"We spared them and sent them on their way...and how do you think they repaid our kindness?"},{"name":"SIDURGU","text":"With fire and blood, <span class=\"highlight\">Forename</span>! With death for every man, woman, and child!"},{"name":"SIDURGU","text":"...Make no mistake. These are the wages of mercy."},{"name":"SIDURGU","text":"If you would walk the path, then you must accept this truth, for your enemies already have."},{"name":"SYSTEM","text":"The next dark knight quest will be available from Sidurgu upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":574,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":98}],"quests":[67594]},"next":[67596]},"partials":[{"type":"npc","id":"1014909","obj":{"i":1014909,"n":"Unflinching Temple Knight","l":63,"q":2}},{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1015030","obj":{"i":1015030,"n":"Unflinching Temple Knight","l":63,"q":1}},{"type":"quest","id":"67594","obj":{"i":67594,"n":"Our Answer","g":157,"l":"Ishgard","s":500,"f":1}},{"type":"quest","id":"67596","obj":{"i":67596,"n":"The Knight and the Maiden Fair","g":157,"l":"Ishgard","s":520,"f":1}}]}