{"quest":{"name":"The Flame in the Abyss","location":"Ishgard","id":67599,"patch":3.0,"sort":580,"icon":100447,"unlocksFunction":1,"eventIcon":71341,"issuer":1013969,"target":1013969,"involved":[1012076,1013970,1015047,1015048,1015049,1015050,1015051],"genre":157,"journal":["An anger you know all too well smolders within Sidurgu.","House Caulignont has long held strong ties with the Ishgardian Orthodox Church, allowing many of her sons and daughters to rise to great prominence within the clergy. Countess Ystride de Caulignont was poised to do the same, until she learned of her husband's heresy. When confronted, he proudly confessed to having consumed dragon blood for decades before draining a vial to complete his transformation and murder his wife. Though he was slain before he could do so, he nevertheless succeeded in tearing his family apart, for when the countess realized that his tainted blood had been passed on to their daughter, Rielle, she chose to confine her to a cell for fear of what the girl might become.<br><br>Now fully aware of his foes' fanatical nature, Sidurgu would seize upon any advantage for the coming battle. Recalling the ancient dragon's words, he thinks to seek out the “tiny beings” who know a better way. He has no idea who they might be, but you have a sneaking suspicion that you do...","You summon Sidurgu and Rielle to Moghome and introduce them to Moggie, the second-most well-informed moogle in the village. However, rather than engaging the moogle, the normally reserved Rielle erupts, berating Sidurgu for his obsession with the darkness and his treatment of her. Moggie, believing that she has insight into the “flame in the abyss,” bids you and Sidurgu gather pomwort, while she and the other moogles look after Rielle.","Though the purpose is hardly clear to you, you gather pomwort as Moggie requested. Return to the moogle and present to her your bounty.","Having completed your first “trial,” Moggie bids you undertake a second. You and Sidurgu are to cull tulihands on the road to Asah. A curious trial, to be sure, but surely there is a method to the moogle's madness...","As you slay tulihand after tulihand, you begin to wonder if this is all simply pointless busywork. Join Sidurgu in Asah and see if he shares your suspicions.","In a shocking and altogether baffling turn of events, the moogles of Moghome reveal that they have kidnapped Rielle. Sidurgu predictably flies into a rage, and together you set about beating the moogles senseless. Afterwards, your comrade demands the return of his charge once more, only for the moogles to ask why. Sidurgu cites his oath as a dark knight, prompting the gathered moogles to burst into song, extolling the virtues of love. Speechless, the dark knight turns away, only to find Rielle safe and sound in the company of Moggie. At the moogle's behest, Rielle voices her feelings and accuses Sidurgu of helping her only to further his own quest for vengeance against the Temple Knights. After a moment, he acknowledges that she speaks true, but reminds her that they will not survive the coming trial without each other's aid. He states that what happens afterwards will be her decision, and his words seem to mollify the young girl.","Declaring your time spent in Moghome to have been an utter waste of time, Sidurgu returns to Ishgard together with Rielle. As you watch them depart, however, you are not entirely certain that you agree...","In the Forgotten Knight, Sidurgu reveals to you that he was among those first refugees to Ishgard, and that he watched helplessly as Temple Knights executed his parents without cause. He too would have died that day, were it not for the intervention of a dark knight, who would then become his mentor. Though he claimed to embrace noble ideals, he confesses that it was likely nothing more than an excuse to indulge in vengeance. Though he now believes himself unworthy to defend Rielle, he knows that she has no one else but you and him. For one last battle, at least, he will stand at her side...<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 60."],"objectives":["Speak with Moggie at Moghome.","Gather pomwort.","Deliver the pomwort to Moggie.","Keep watch for tulihands in the Landlord Colony.","Speak with Sidurgu in Asah.","Speak with Sidurgu.","Speak with Sidurgu in Ishgard.","Defeat the moogles!"],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Mountaintop Diplomacy.”"},{"name":"SIDURGU","text":"It took considerable effort, but at last I have learned the whole truth. Attend me, <span class=\"highlight\">Forename</span>. You have a right to know."},{"name":"SIDURGU","text":"For countless generations, the sons and daughters of House Caulignont have pledged themselves to the church, so devoted to the faith they are."},{"name":"SIDURGU","text":"Many rose to positions of great prominence within the clergy, and for a time, Countess Ystride de Caulignont was poised to do the same. And when she and her husband celebrated the birth of their firstborn, the futures of the house seemed brighter than ever."},{"name":"SIDURGU","text":"That is, until years later, when the inquisitors came. Information gleaned during an interrogation had implicated her husband as a heretic."},{"name":"SIDURGU","text":"When the countess confronted him with these allegations, he brought a vial to his lips and completed his transformation─one he proudly declared was <span class=\"emphasis\">decades</span> in the making."},{"name":"SIDURGU","text":"...The Temple Knights slew him as he tried to rip out her throat."},{"name":"SIDURGU","text":"Afterwards, she had Rielle locked away in the deepest cell she could find."},{"name":"SIDURGU","text":"Madness. What monster thinks to find absolution in her daughter's death!?"},{"name":"RIELLE","text":"You mustn't go! She'll kill you!"},{"name":"SIDURGU","text":"She'll kill us anyway if we don't! I...I know what I'm doing, Rielle. I have a plan..."},{"name":"SIDURGU","text":"<span class=\"highlight\">Forename</span>, recall you the dragon's words when we told her of our dark arts? She said that there were “tiny beings” who know a better way."},{"name":"SIDURGU","text":"If they can teach us how to harness the abyss, mayhap we can stand against Lady Ystride and her minions. Unfortunately, I haven't the foggiest who these “tiny beings” might be..."},{"name":"SIDURGU","text":"I shall make inquiries, but I do not expect to learn much. If you uncover aught of interest, pray send word."},{"name":"RIELLE","text":"Right, then. A plan."},{"name":"MOGGIE","text":"Well, if it isn't one of the new visitors from below! Are you searching for something? If so, just ask! I pride myself on being the second-most well-informed moogle here, kupo!"},{"name":"MOGGIE","text":"...My, that's a rather grim way of living, isn't it? I can't say I've ever heard of knights so infatuated with “darkness”!"},{"name":"MOGGIE","text":"However, I think I might know why she bade you visit us. Go ahead and fetch your friends. We have an awful lot to talk about, kupo!"},{"name":"MOGGIE","text":"Welcome to Moghome, kupo! The little one must be Rielle, which makes the big one Sid, right?"},{"name":"SIDURGU","text":"...Yes. I presume you are one of the “tiny beings” of whom the dragon spoke."},{"name":"RIELLE","text":"..."},{"name":"SIDURGU","text":"Rielle, say something to the moogle."},{"name":"SIDURGU","text":"Rielle."},{"name":"RIELLE","text":"..."},{"name":"SIDURGU","text":"Rielle!"},{"name":"RIELLE","text":"...I'm sick of this charade."},{"name":"RIELLE","text":"You tell me to talk, but then you refuse to listen. You tell me you're doing this for me, but then you go on about the “darkness” and the “abyss”!"},{"name":"RIELLE","text":"Am I supposed to be grateful when you come back covered in blood? When I put you back together so you can do it again!?"},{"name":"RIELLE","text":"You drag me to halfway across the world so you can discover a new way to kill yourself, and you tell me it's for <span class=\"emphasis\">my</span> sake!?"},{"name":"RIELLE","text":"Why are we here, Sidurgu!? Tell me the <span class=\"emphasis\">real</span> reason!"},{"name":"SIDURGU","text":"Rielle, I...of course it's for <span class=\"emphasis\">your</span> sake!"},{"name":"RIELLE","text":"Well, you've certainly had a lot of practice saying it, haven't you."},{"name":"RIELLE","text":"I'm sure the next fair maiden will appreciate it!"},{"name":"SIDURGU","text":"What are you saying!? It's not like that, Rielle!"},{"name":"SIDURGU","text":"And you! Say something, damn you!"},{"name":"MOGGIE","text":"Ahhh, I think I'm beginning to understand this whole “darkness” concept, kupo!"},{"name":"MOGGIE","text":"Harnessing the power of your emotions or some such, yes? I'm reminded of an ancient legend about a moogle named Mog─rather simple name, I know, but those were simpler times, kupo! Anyway, Mog had a penchant for dancing, and─"},{"name":"SIDURGU","text":"Wait, wait. What does dancing have to do with the dark arts?"},{"name":"MOGGIE","text":"Everything, kupo! <span class=\"emphasis\">Everything</span>!"},{"name":"MOGGIE","text":"The point is, your master was absolutely right when he told you to “submit to the flame.” You just never figured out what he meant by it."},{"name":"MOGGIE","text":"But better late than never, kupo! Master Moggie will show you the way! First, you two dark knights will need to pull four sprigs of pomwort each. Hop to it, kupo!"},{"name":"SIDURGU","text":"I fail to see what purpose this serves, but fine. You will have your precious pomwort."},{"name":"MOGGIE","text":"Oh, and Rielle can stay here with us while you're away!"},{"name":"SIDURGU","text":"...Let's go, <span class=\"highlight\">Forename</span>."},{"name":"MOGGIE","text":"No one will be harnessing the darkness or the abyss or whatever else unless you bring me plenty of pomwort first, kupo!"},{"name":"RIELLE","text":"...Look after him, will you?"},{"name":"SIDURGU","text":"Strength is pain. Strength is suffering. Strength is sacrifice... Gah! Sod this!"},{"name":"SIDURGU","text":"...Remind me again why we came back?"},{"name":"RIELLE","text":"This doesn't feel right..."},{"name":"MOGGIE","text":"There you are, darkest dark one of the dark! Have you brought my pomwort?"},{"name":"MOGGIE","text":"Very nice, very nice, kupo! That must've kept you busy for a while!"},{"name":"MOGGIE","text":"For your next trial, you must, er...you must cull tulihands, kupo!"},{"name":"MOGGIE","text":"Rather a lot of them have been sighted on the road to Asah. If you wait there long enough, they're sure to show up, kupo!"},{"name":"MOGGIE","text":"Rielle? Oh, you needn't worry about her! She's off playing with some friends of mine, kupo!"},{"name":"MOGGIE","text":"Just focus on the trial, and wait for me in Asah when you're finished!"},{"name":"MOGGIE","text":"When you and Sid have finished culling those tulihands, meet me in Asah, and I'll give you your next trial, kupo!"},{"name":"SIDURGU","text":"...What in the hells are we doing, <span class=\"highlight\">Forename</span>?"},{"name":"SIDURGU","text":"What could moogles possibly know about mastering the dark arts?"},{"name":"TANKMOOGLE02063","text":"(-???-)Mwahaha! Foolish fools!"},{"name":"SIDURGU","text":"...Right, then. What's all this?"},{"name":"TANKMOOGLE02063","text":"While you two were busy gathering pomwort and slaying tulihands, we kidnapped Rielle, kupo! Mwahaha!"},{"name":"HEALERMOOGLE02063","text":"Oh yeeesss, kupo! We've had so much fun playing together! So much fun indeed, kupo!"},{"name":"TANKMOOGLE02063","text":"So much fun that we thought we might keep her here forever! Mwahaha!"},{"name":"SIDURGU","text":"You wouldn't dare."},{"name":"HEALERMOOGLE02063","text":"If you don't believe us, go and look! You'll never find her, kupo! Not in a million years!"},{"name":"TANKMOOGLE02063","text":"Mwahaha! She's ours, kupo! You'll never see her again! Mwahaha!"},{"name":"SIDURGU","text":"You...you furry little shites!"},{"name":"SIDURGU","text":"Give her back to me, now! Or I swear, I will kill every last one of you and burn your village to cinders!"},{"name":"TANKMOOGLE02063","text":"Yeowch! Y-You could really hurt someone, carrying on like that, kupo!"},{"name":"SIDURGU","text":"That's the bloody point! Now tell me where she is if you want to live!"},{"name":"TANKMOOGLE02063","text":"W-Wait, wait!"},{"name":"HEALERMOOGLE02063","text":"Why do you want her back so badly, kupo!?"},{"name":"SIDURGU","text":"What kind of question is that!? You kidnapped her!"},{"name":"HEALERMOOGLE02063","text":"But you don't seem to like having her around that much anyway, right? She's just a burden to you. So why do you care what happens to her?"},{"name":"SIDURGU","text":"I...I swore an oath. To protect her. That's what we dark knights do..."},{"name":"ATTACKERMOOGLE02063","text":"You think that will give you strength enough to protect her!? Duty and honor? I'll tell you what you need, kupo!"},{"name":"BUFFERMOOGLE02063","text":"Whence comes true strength to defend the meek?♪<br>Is it honor? Is it justice? How blaaand!♪"},{"name":"BUFFERMOOGLE02063","text":"Could it be that the darkness is born of a light?♪<br>A flame burning for another? How graaand!♪"},{"name":"BUFFERMOOGLE02063","text":"'Tis love! 'Tis love!♪<br>All-powerful, shining loooooove!♪"},{"name":"MOGGIE","text":"...Rather blunt, I'll admit, but subtlety doesn't seem to be your strong suit, kupo."},{"name":"SIDURGU","text":"Rielle!"},{"name":"MOGGIE","text":"Well, here we are. Go on, Rielle. Say your piece."},{"name":"RIELLE","text":"...I know you and Fray were trying to do right by your master─that you came to my defense because you believed that's what <span class=\"emphasis\">he</span> would've wanted. And I <span class=\"emphasis\">know</span> you only did that because you believed it would make you stronger, because all you truly care about is killing more Temple Knights!"},{"name":"RIELLE","text":"I've seen how you look at them─how you curse them under your breath. How you relish every opportunity to cut them down. So don't tell me that it's all been for <span class=\"emphasis\">me</span>! Don't tell me that Fray <span class=\"emphasis\">died</span> for me!"},{"name":"SIDURGU","text":"...Everything I have done, I have done for my mother and my father. For my master, and yes...most of all, for me."},{"name":"SIDURGU","text":"I haven't been honest with you, nor with myself...and for that I am sorry. I will stand for you in this coming trial, but after... What happens after will be your decision."},{"name":"RIELLE","text":"Good. That's a promise."},{"name":"RIELLE","text":"For what it's worth, I'm sorry it had to come to this."},{"name":"SIDURGU","text":"...Furry little bastards had us fooled, eh?"},{"name":"SIDURGU","text":"Shame their wisdom is bollocks. I mean really now, love? That's what you need to harness the abyss?"},{"name":"SIDURGU","text":"I mean, I suppose there's something to be said for caring deeply for your charge, but... No. No, I will not give those cretins even a sliver of credit. This was an utter waste of time, and that's that."},{"name":"SIDURGU","text":"Still...I am glad to have come to an understanding with Rielle."},{"name":"SIDURGU","text":"We should return to Ishgard. The hour of the trial draws close."},{"name":"SIDURGU","text":"Come along, Rielle."},{"name":"RIELLE","text":"...It needed to be said."},{"name":"SIDURGU","text":"...I was about Rielle's age when I came to Ishgard. My parents, they...they said we would find a better life here."},{"name":"SIDURGU","text":"When the Temple Knights we had shown mercy returned, they let us choose the order in which we would die. That would be their mercy to us, they declared."},{"name":"SIDURGU","text":"I watched my parents kneel in the dirt. “Look away,” they said. But I could not."},{"name":"SIDURGU","text":"At last, when it was my turn, I knelt and prepared to follow them into death. I closed my eyes...but when I opened them, a man in black stood before me, hand outstretched. And so I took it."},{"name":"SIDURGU","text":"“Defend the meek.” “Punish the wicked.”<br>...Mayhap it was all but a convenient excuse to indulge in vengeance."},{"name":"SIDURGU","text":"She deserves better than me. But there is no one else..."},{"name":"SIDURGU","text":"One more battle, <span class=\"highlight\">Forename</span>. Let's see it done."},{"name":"SIDURGU","text":"Mayhap in this final battle I can serve as my master intended..."},{"name":"QIB","text":"Give her back to me! Give...her..."},{"name":"QIB","text":"Mwahaha...ha...ha..."},{"name":"QIB","text":"Oh my, that's more than I..."},{"name":"QIB","text":"Bit much if you ask me, kupo..."},{"name":"QIB","text":"Forever...forever..."},{"name":"QIB","text":"This...this isn't what I..."},{"name":"QIB","text":"Keep crying, kupo! Keep..."},{"name":"QIB","text":"Ugh... This better be worth it..."},{"name":"QIB","text":"Mwahaha! Do your worst, kupo!"},{"name":"QIB","text":"You miss your Rielle, kupo! Well, too bad! She's <span class=\"emphasis\">our</span> Rielle now, kupo!"},{"name":"QIB","text":"I'm going to rip that pom off your head and shove it down your godsdamned throat!"},{"name":"QIB","text":"Our turn, kupo!"},{"name":"QIB","text":"Give her back to me! Give her back!"},{"name":"QIB","text":"You just don't get it, do you, kupo? She's gone! Forever! Mwahaha!"},{"name":"QIB","text":"It doesn't matter how hard you fight, kupo! You're never going to see her again!"},{"name":"QIB","text":"What? Are you gonna cry now, kupo? Go on then! Cry! Cry for me, kupo!"},{"name":"QIB","text":"I think he is, kupo! Look!"},{"name":"QIB","text":"GRAAARRRGGGH! DIE, DAMN YOU, DIE!"}],"reward":{"gil":1691,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":98}],"quests":[67598]},"next":[67600]},"partials":[{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1012076","obj":{"i":1012076,"n":"Moggie","l":2002,"q":2}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1015047","obj":{"i":1015047,"n":"Rielle","l":2002,"q":1}},{"type":"npc","id":"1015048","obj":{"i":1015048,"n":"Sidurgu","l":2002,"q":1}},{"type":"npc","id":"1015049","obj":{"i":1015049,"n":"Sidurgu","l":2002,"q":1}},{"type":"npc","id":"1015050","obj":{"i":1015050,"n":"Sidurgu","l":2002,"q":1}},{"type":"npc","id":"1015051","obj":{"i":1015051,"n":"Rielle","l":2002,"q":1}},{"type":"quest","id":"67598","obj":{"i":67598,"n":"Original Sins","g":157,"l":"Ishgard","s":560,"f":1}},{"type":"quest","id":"67600","obj":{"i":67600,"n":"Absolution","g":157,"l":"Ishgard","s":600,"f":1}}]}