{"quest":{"name":"Kindred Spirits","location":"Ishgard","id":67597,"patch":3.0,"sort":540,"icon":100447,"unlocksFunction":1,"eventIcon":71341,"issuer":1013969,"target":1013969,"involved":[1000692,1013970,1015038,1015039,1015040,1015041,1015042,1015043,1015066,1015067,1015432],"genre":157,"journal":["The words of the Vanu shaman yet trouble Sidurgu...","Who better to tell you more of the “great spirit” than those who commune with spirits regularly? For that reason, Sidurgu hopes that the conjurers of Stillglade Fane can offer insight into Rielle's condition. He notes that the road to Gridania will offer many opportunities for the Temple Knights to attack. At the very least, you should be safe as far as Camp Dragonhead.","Suspecting that the Temple Knights are nearby, Sidurgu offers to scout out the road to the Observatorium. Stay with Rielle and follow him at a distance.","Not long after you part ways, the Temple Knights attack, spurring you and Rielle to make haste to the Observatorium. Though the knights are no match for you, their numbers are legion, and you find yourself growing weary from the struggle. However, Rielle's conjury proves surprisingly potent, and you are able to fend off your attackers until you reach the safety of the Observatorium's walls.","Sidurgu chides himself for leaving your side and bids you make haste to Gridania, before the Temple Knights return with reinforcements. Seek out Brother E–Sumi–Yan at the Conjurers' Guild and beg his assistance.","After a cursory examination, Brother E–Sumi–Yan states that the Vanu shaman spoke true, after a fashion. Rielle's innate spiritual presence does indeed bear similarities to that of the elementals─and the Dravanians. Citing an ancient legend in which a man ingested the blood of dragons to become one himself, he speculates that Rielle may have partaken of the blood of an ancient Dravanian. Though Sidurgu is unnerved by the implication, Rielle's feelings are unclear, her face an unreadable mask. Before you embark for Ishgard, Brother E–Sumi–Yan suggests you rest a while at the Carline Canopy.","Frustrated by her silence in the face of Brother E–Sumi–Yan's suggestions, Sidurgu presses Rielle for an explanation. She pauses, and then, with a faraway look in her eyes, she speaks softly of her imprisonment in a windowless cell, with walls so thick she could not even hear the rain. She denies drinking dragon blood, and claims that she was never accused of such. As for their reasons, she intones that her captors simply said, “it's better this way.” Uncertain how to respond, Sidurgu excuses himself and steps outside, leaving you to look after Rielle until she has finished eating.","As you watch Rielle eat, you start to wonder how long she was kept in her cell, and how she passed the time in solitude. Afterwards, she thanks you for waiting and heads outside to find Sidurgu.","Eager to quit the forest, Sidurgu departs with Rielle. Return to the Forgotten Knight and speak with them there.","Blessedly, you and Sidurgu meet with no trouble on the road back to Ishgard. Recognizing that he has yet to adequately recompense you for your services, he resolves to share what knowledge of the dark arts he has with you.<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 56."],"objectives":["Speak with Sidurgu outside Camp Dragonhead.","Speak with Rielle.","Speak with Sidurgu.","Speak with Brother E–Sumi–Yan at Stillglade Fane.","Speak with Rielle at the Carline Canopy.","Speak with Rielle.","Speak with Sidurgu.","Speak with Sidurgu in Ishgard.","Escort Rielle to the Observatorium!"],"dialogue":[{"name":"SIDURGU","text":"So a “great spirit” dwells within Rielle, if that shaman is to be believed..."},{"name":"SIDURGU","text":"We need answers, <span class=\"highlight\">Forename</span>, and I can think of no one better to ask than those who commune with spirits regularly."},{"name":"SIDURGU","text":"I speak of Gridania's conjurers, who can hear the voices of the Twelveswood─or so it is said."},{"name":"SIDURGU","text":"It's just as well. Fray told me she had an aptitude for their arts. What had taken him moons to learn, she mastered in days."},{"name":"SIDURGU","text":"Sometimes these talents run in the family, he said. Mayhap her ancestors were conjurers after a fashion..."},{"name":"SIDURGU","text":"Whatever the reason, there is no guarantee it is related to what the shaman said─or why the Temple Knights wish her dead."},{"name":"SIDURGU","text":"If past experience is any indication, they will be tracking us the moment we leave the city. It's not a question of if they will attack us, but when..."},{"name":"SIDURGU","text":"But you will be ready for them, I see. Then let us be off. The road should be safe so far as Camp Dragonhead."},{"name":"SIDURGU","text":"We must learn more of Rielle's condition. The conjurers of Gridania will surely have answers."},{"name":"RIELLE","text":"Are we going to see the conjurers? Fray used to tell me stories of the Fane."},{"name":"RIELLE","text":"...Sid said he would've won if they had let him keep his staff."},{"name":"RIELLE","text":"How much further is it to Gridania? I've never been..."},{"name":"SIDURGU","text":"They're close. I can feel it..."},{"name":"SIDURGU","text":"Stay with Rielle. I'm going to scout out the road to the Observatorium."},{"name":"SIDURGU","text":"Follow at a distance. If they come, do whatever it takes to see her safely inside the walls."},{"name":"SIDURGU","text":"Good. That's a promise."},{"name":"RIELLE","text":"Please be safe, Sid..."},{"name":"RIELLE","text":"...I'm ready, <span class=\"highlight\">Forename</span>. Whenever you are."},{"name":"RIELLE","text":"You're not hurt, are you?"},{"name":"SIDURGU","text":"<span class=\"highlight\">Forename</span>! Thank the gods you're all right! "},{"name":"SIDURGU","text":"Gaaah! I should have known they would strike when we were apart..."},{"name":"SIDURGU","text":"They're certain to return with reinforcements ere long. We must press on south, into Gridanian territory."},{"name":"SIDURGU","text":"Until we reach the city proper, we cannot be assured of safety."},{"name":"SIDURGU","text":"We leave now, Rielle. You can rest once we reach Stillglade Fane."},{"name":"ESUMIYAN","text":"Ah, <span class=\"highlight\">Forename</span>. You are come to continue your studies?"},{"name":"ESUMIYAN","text":"Greetings, <span class=\"highlight\">Forename</span>. How may I be of service?"},{"name":"ESUMIYAN","text":"...A “great spirit,” is it? If it please, I would examine this girl myself."},{"name":"ESUMIYAN","text":"It is the very least I can do for one who has ever been a friend of the Twelveswood. Ah...but where are they?"},{"name":"SIDURGU","text":"Apologies for our late arrival. Rielle grew tired, and I had to carry her part of the way."},{"name":"RIELLE","text":"I could have kept walking..."},{"name":"ESUMIYAN","text":"Our burdens need not be our own, child. There is no shame in sharing the weight."},{"name":"SIDURGU","text":"...Who's the boy?"},{"name":"ESUMIYAN","text":"Aha... I am Brother E–Sumi–Yan, master of this guild. And though you will labor to believe it, young man, I am several times your age."},{"name":"ESUMIYAN","text":"You must be Rielle. <span class=\"highlight\">Forename</span> has told me all about you."},{"name":"ESUMIYAN","text":"Pray come closer and take your ease. I ask that you close your eyes and listen to my words."},{"name":"ESUMIYAN","text":"Breathe deep... Feel the myriad life around you... Be as one with the world..."},{"name":"SIDURGU","text":"...Well?"},{"name":"ESUMIYAN","text":"Hmmm... The Vanu shaman spoke true, after a fashion."},{"name":"ESUMIYAN","text":"Her spiritual presence belies her years..."},{"name":"ESUMIYAN","text":"It is clearly not the product of training, rather an innate power with which she radiates...akin to that of the elementals...or the Dravanians..."},{"name":"SIDURGU","text":"You can't be serious. She's just a girl!"},{"name":"ESUMIYAN","text":"Yes, she is. A very special girl."},{"name":"ESUMIYAN","text":"Mayhap you are familiar with the tale of the Boy and the Dragon Gay?"},{"name":"SIDURGU","text":"...No."},{"name":"ESUMIYAN","text":"Hardly surprising. The archbishop declared it a heretic's tale, and with good cause. It is a corruption of an older legend in which a man partakes of dragon blood and, in so doing, becomes one himself."},{"name":"ESUMIYAN","text":"Rumor has it that heretics hold such rituals for this very purpose... And if there is truth in such tales..."},{"name":"ESUMIYAN","text":"Perchance she has ingested the blood of an ancient dragon?"},{"name":"SIDURGU","text":"What!? She's not some half-crazed lunatic!"},{"name":"ESUMIYAN","text":"I make no accusations, only offer a possible explanation."},{"name":"ESUMIYAN","text":"Moreover, who is to say that she did so <span class=\"emphasis\">knowingly</span>?"},{"name":"SIDURGU","text":"Y-You..."},{"name":"RIELLE","text":"Excuse me, I..."},{"name":"ESUMIYAN","text":"Ah, pray forgive me! I did not mean to cause you distress."},{"name":"ESUMIYAN","text":"You have nothing to fear, my child, for you are in perfect health and blessed with two loyal guardians. Would that others could say the same!"},{"name":"ESUMIYAN","text":"I think Rielle would benefit from a brief respite before returning to Ishgard, unused to the rigors of the road as she is."},{"name":"ESUMIYAN","text":"Why not show her to the Carline Canopy? An eel pie can do wonders for the soul."},{"name":"SIDURGU","text":"...We thank you for your time."},{"name":"ESUMIYAN","text":"Such a gentle soul. I can see why he is so fond of her."},{"name":"SIDURGU","text":"Hmph."},{"name":"SIDURGU","text":"Bit premature, isn't it?"},{"name":"SIDURGU","text":"Faerie tales and fantasies!? This is what he has to offer us!?"},{"name":"SIDURGU","text":"Heretics, I understand, but I expected better from the bloody head of the Conjurers' Guild!"},{"name":"SIDURGU","text":"And you─why didn't you speak up for yourself?"},{"name":"SIDURGU","text":"Rielle!"},{"name":"RIELLE","text":"...There were no windows. Just walls of stone with little cracks to tempt your fingers, and iron bars colder than ice."},{"name":"RIELLE","text":"I couldn't tell when it was raining─whether it was day or night..."},{"name":"RIELLE","text":"She didn't say I drank blood. All she said was..."},{"name":"RIELLE","text":"“It's better this way.”"},{"name":"RIELLE","text":"At least, if they catch me, they'll just kill me this time..."},{"name":"RIELLE","text":"...Can I finish my apple?"},{"name":"SIDURGU","text":"...Go ahead."},{"name":"RIELLE","text":"..."},{"name":"SIDURGU","text":"..."},{"name":"SIDURGU","text":"...It's not a sin if someone made you do it."},{"name":"RIELLE","text":"I didn't."},{"name":"SIDURGU","text":"I won't let them hurt you."},{"name":"RIELLE","text":"...I know."},{"name":"SIDURGU","text":"...You want another one?"},{"name":"RIELLE","text":"...No, thank you."},{"name":"SIDURGU","text":"...Right, then."},{"name":"SIDURGU","text":"Keep an eye on her until she's finished eating, would you?"},{"name":"SIDURGU","text":"I could do with some fresh air."},{"name":"RIELLE","text":"Thank you for waiting with me, <span class=\"highlight\">Forename</span>. Shall we go and find Sid?"},{"name":"RIELLE","text":"Do you need a moment?"},{"name":"SIDURGU","text":"Well, I've had my fill of the forest."},{"name":"SIDURGU","text":"Back to Ishgard, then. I think Rielle and I can manage on our own for now."},{"name":"SIDURGU","text":"Shall we?"},{"name":"RIELLE","text":"The apples were good, but maybe I should've tried the eel pie after all..."},{"name":"SIDURGU","text":"That was a blessedly uneventful journey. Mayhap the Temple Knights were still nursing the injuries you gave them."},{"name":"SIDURGU","text":"Rielle was worried they might try to ambush you on the road, but I assured her you would be fine..."},{"name":"SIDURGU","text":"I must apologize, <span class=\"highlight\">Forename</span>. For all you have done for us, I fear I have yet to adequately recompense you."},{"name":"SIDURGU","text":"I will continue to share with you what skills I can. Alas, I fear we near the limits of my knowledge..."},{"name":"RIELLE","text":"Let's go, then. I don't see anyone..."},{"name":"TEMPLEKNIGHT","text":"There they are! Summon the others!"},{"name":"RIELLE","text":"They've found us!"},{"name":"TEMPLEKNIGHT","text":"This way, men! After them!"},{"name":"TEMPLEKNIGHT","text":"Surrender the girl! There's no escape!"},{"name":"RIELLE","text":"Stay back, all of you!"},{"name":"TEMPLEKNIGHT","text":"You are meddling in affairs beyond your ken!"},{"name":"RIELLE","text":"G-Get away from us! I'm warning you!"},{"name":"TEMPLEKNIGHT","text":"Gah! You'll live to regret this!"},{"name":"RIELLE","text":"There are the gates, <span class=\"highlight\">Forename</span>! Just a little further!"},{"name":"RIELLE","text":"We... We made it! Thank you, <span class=\"highlight\">Forename</span>, thank you!"},{"name":"RIELLE","text":"M-Mother, I..."}],"reward":{"gil":1348,"action":3640,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":98}],"quests":[67596]},"next":[67598]},"partials":[{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1015038","obj":{"i":1015038,"n":"Sidurgu","l":63,"q":1}},{"type":"npc","id":"1015039","obj":{"i":1015039,"n":"Rielle","l":63,"q":1}},{"type":"npc","id":"1015040","obj":{"i":1015040,"n":"Sidurgu","l":63,"q":1}},{"type":"npc","id":"1015041","obj":{"i":1015041,"n":"Rielle","l":63,"q":1}},{"type":"npc","id":"1015042","obj":{"i":1015042,"n":"Sidurgu","l":52,"q":1}},{"type":"npc","id":"1015043","obj":{"i":1015043,"n":"Rielle","l":52,"q":1}},{"type":"npc","id":"1015066","obj":{"i":1015066,"n":"Sidurgu","l":52,"q":1}},{"type":"npc","id":"1015067","obj":{"i":1015067,"n":"Rielle","l":52,"q":1}},{"type":"npc","id":"1015432","obj":{"i":1015432,"n":"Rielle","l":52,"q":1}},{"type":"action","id":"3640","obj":{"i":3640,"n":"Plunge","c":3061,"j":32,"t":4,"l":54}},{"type":"quest","id":"67596","obj":{"i":67596,"n":"The Knight and the Maiden Fair","g":157,"l":"Ishgard","s":520,"f":1}},{"type":"quest","id":"67598","obj":{"i":67598,"n":"Original Sins","g":157,"l":"Ishgard","s":560,"f":1}}]}