{"quest":{"name":"The Knight and the Maiden Fair","location":"Ishgard","id":67596,"patch":3.0,"sort":520,"icon":100447,"unlocksFunction":1,"eventIcon":71341,"issuer":1013969,"target":1013969,"involved":[1013970,1015033,1015034,1015035,1015036,1015037],"genre":157,"journal":["Sidurgu would entreat a fellow dark knight for aid.","On his deathbed, Sidurgu's master spoke of a “flame in the abyss,” a concept which Sidurgu and Fray did not understand. In following the creed of their predecessors, they hoped that the meaning would become clear to them in time. Alas, when they intervened to save the life of a young girl, they were marked for death by the order. Fray was captured and executed in a trial by combat, leaving Sidurgu to care for Rielle by himself. Fearing that he cannot handle the task alone, he implores you to join his cause, and you agree. Perhaps now would be a good time to get to know Rielle.","Though somewhat standoffish, Rielle responds to your inquiries as best she can. Satisfied that you have established a rudimentary rapport, Sidurgu interrupts with his latest plan. Since the Temple Knights appear to be convinced that Rielle is some sort of abomination, Sidurgu would first determine if there is anything unusual about her. To that end, he proposes that you seek out a Vanu healer in the Sea of Clouds, as some are said to possess the ability to see their patients' aether. Rendezvous with him in Camp Cloudtop.","For the most part, the Vanu Vanu are disinclined to parley with outsiders. However, they may be willing to grant your request in exchange for a suitable offering. Sidurgu asks that you seek out and slay gastornis for their feathers, as it is said the Vanu use them in their rituals.","You procure the feathers with little difficulty. Journey now into Vanu territory and pray that you can find a healer willing to hear you out.","Fortuitously, you encounter a Vanu healer willing to examine Rielle in exchange for your offering of feathers. Arms held high, she begins chanting, her voice rising in intensity, until she gasps in surprise. A great spirit dwells within her, the healer begins─but before she can finish, she senses others following in your wake and flees. Turning towards the road, Sidurgu readies his sword and bids you search for your pursuers while he guards Rielle.","You come upon Temple Knights, who mark you for a foe at once. The battle is joined and soon ended. Return to Sidurgu and let him know what you found.","With the Vanu healer long gone, there is no reason to remain in the Sea of Clouds. Return to the Forgotten Knight with Sidurgu and Rielle.","Cursing the Temple Knights for their savagery, Sidurgu nearly flies into a rage, until Rielle's sudden apology for being the cause of your distress saps the dark knight of his anger. Though the motives of the Temple Knights yet remain a mystery, it is clear now that there is something rather unusual about the young girl they so fervently pursue.<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 54."],"objectives":["Speak with Rielle.","Rendezvous with Sidurgu at Camp Cloudtop.","Slay gastornis and obtain their feathers.","Present the feathers to the Vanu Vanu healer.","Stand watch for pursuers.","Speak with Sidurgu.","Speak with Sidurgu in Ishgard."],"dialogue":[{"name":"SIDURGU","text":"I see you yet walk the path, <span class=\"highlight\">Forename</span>...and it is well that you do. This is a matter I can discuss only with another dark knight. Swear to me that you will speak of it to no one else."},{"name":"SIDURGU","text":"Thank you. Then I shall begin at the beginning."},{"name":"SIDURGU","text":"Our master, in his final moments, spoke to Fray and me in riddles..."},{"name":"SIDURGU","text":"“A heart bleeds, a man weeps, a soul burns. Thence comes the darkness, to consume...”"},{"name":"SIDURGU","text":"“Yet even in the depths, the flame endures...”"},{"name":"SIDURGU","text":"“Submit to the flame and harness the abyss...”"},{"name":"SIDURGU","text":"Fray and I did not understand his words. We hoped their meaning would become clear to us in the course of our duties as dark knights."},{"name":"SIDURGU","text":"And so we carried on, following the creed, until one day, we found her."},{"name":"RIELLE","text":"..."},{"name":"SIDURGU","text":"&lt;sigh&gt; ...Go on, Rielle. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> can be trusted."},{"name":"RIELLE","text":"...All right."},{"name":"RIELLE","text":"Halone's blessings be upon you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"SIDURGU","text":"Right, then..."},{"name":"SIDURGU","text":"She was fleeing from a unit of Temple Knights at the time, who were clearly intent on doing her harm. Needless to say, Fray and I took issue with that, and chose to intervene."},{"name":"SIDURGU","text":"We went to ground after that, but Fray was caught out in the streets while fetching supplies..."},{"name":"SIDURGU","text":"...I cannot protect her, <span class=\"highlight\">Forename</span>. Not from the Temple Knights. Not by myself. I'm not even sure why they seek her...only that should I fail, her life is forfeit."},{"name":"SIDURGU","text":"Help me, <span class=\"highlight\">Forename</span>, and I shall share with you my arts. And when we have reached the limits of my knowledge, mayhap we can unravel the mystery of my master's final words together."},{"name":"SIDURGU","text":"I can offer you naught else. What say you?"},{"name":"SIDURGU","text":"Then it is settled. We shall both serve as her guardians."},{"name":"SIDURGU","text":"Don't you have something to say to <span class=\"highlight\">Forename</span>, Rielle?"},{"name":"RIELLE","text":"..."},{"name":"SIDURGU","text":"Talk to her a little. Ask her about herself."},{"name":"RIELLE","text":"...Yes?"},{"name":"Q1","text":"What will you ask?"},{"name":"A1","text":"Why did the Temple Knights want to hurt you?"},{"name":"A1","text":"Where are your parents?"},{"name":"A1","text":"What do you think of Sidurgu?"},{"name":"A1","text":"Nothing."},{"name":"RIELLE","text":"They...they said I was an abomination. That I had to die to atone for my sins..."},{"name":"RIELLE","text":"I...I..."},{"name":"RIELLE","text":"He doesn't talk as much. Not since Fray left. Sometimes he hardly speaks a word. Other times... But I know he would never hurt me."},{"name":"RIELLE","text":"Excuse me...<span class=\"highlight\">Forename</span>, was it?"},{"name":"RIELLE","text":"You'll look after Sid too, won't you?"},{"name":"RIELLE","text":"Thank you. That puts my mind at ease..."},{"name":"SIDURGU","text":"Right, that's enough of that. To more important matters..."},{"name":"SIDURGU","text":"Like I said before, I'm not quite sure why the Temple Knights are after Rielle."},{"name":"SIDURGU","text":"They seem to believe something is wrong with her, but for the life of me, I cannot imagine what it could be..."},{"name":"SIDURGU","text":"However, there may be a way to find out. The other day, I overheard a curious tale from a House Haillenarte knight recently returned from Camp Cloudtop. He spoke of Vanu healers who could <span class=\"emphasis\">see</span> their patients' aether. So skilled were these healers that they could diagnose ailments with a glance."},{"name":"SIDURGU","text":"It may be naught more than a fantastical tale told by a man in his cups, but even so, if there is a chance we could learn what─if aught─ails Rielle, I daresay we must take it. Let us go to Camp Cloudtop and begin our search for a healer there."},{"name":"SIDURGU","text":"For Rielle's sake, I say we see if there is any truth to this rumor..."},{"name":"RIELLE","text":"Did you know Fray too? He was a good teacher...and a friend."},{"name":"RIELLE","text":"How is it that they float like that? I've never seen anything quite like it..."},{"name":"SIDURGU","text":"...Right, then."},{"name":"SIDURGU","text":"The Vanu Vanu are not wont to parley with outsiders under most circumstances. However, they may be willing to receive us if we come bearing a suitable offering."},{"name":"SIDURGU","text":"I am told they use gastornis feathers in their rituals. Mayhap that would suffice..."},{"name":"SIDURGU","text":"<span class=\"highlight\">Forename</span>, I must ask that you prepare our offering while I look after Rielle. Once you have it, we can journey to Vundu Ok' Bendu together and entreat one of their healers to examine her."},{"name":"RIELLE","text":"I feel fine, really..."},{"name":"RIELLE","text":"Please take care, <span class=\"highlight\">Forename</span>..."},{"name":"SIDURGU","text":"The Temple Knights have eyes everywhere, <span class=\"highlight\">Forename</span>. I dare not leave her unattended."},{"name":"VANUVANU02060","text":"What mistral gale blows netherlings this far!? Away with you, away!"},{"name":"VANUVANU02060","text":"Gastornis feathers? Hmmm... Netherling knows the ways of the Vundu well."},{"name":"VANUVANU02060","text":"Let storm clouds give way to warm sunshine. Say your piece!"},{"name":"SIDURGU","text":"She will do as we ask, <span class=\"highlight\">Forename</span>?"},{"name":"VANUVANU02060","text":"Bring forth the child, netherlings. Let me look upon her face and know her heart!"},{"name":"VANUVANU02060","text":"Soft rains to soothe your heart, little one. Do not be afraid."},{"name":"VANUVANU02060","text":"Drink of the winds! Let thy soul take flight! Bathe in the mists and show me thy light!"},{"name":"VANUVANU02060","text":"Come, come, show me thy light..."},{"name":"VANUVANU02060","text":"What tempestuous winds rage beneath tranquil clouds!? What great spirit dwells within you!?"},{"name":"SIDURGU","text":"...Speak plain, Vanu."},{"name":"VANUVANU02060","text":"This is no child...this is... Ah!"},{"name":"VANUVANU02060","text":"The tramontane follows you, netherlings. You cannot remain here! Begone from our lands!"},{"name":"SIDURGU","text":"Wait! I don't... Godsdammit."},{"name":"SIDURGU","text":"Ready your blade, <span class=\"highlight\">Forename</span>. We've been followed."},{"name":"SIDURGU","text":"Over there─someone's coming..."},{"name":"SIDURGU","text":"Climb the ridge and stand watch. I'm staying with Rielle."},{"name":"RIELLE","text":"How did they find us!?"},{"name":"RIELLE","text":"So it really was them..."},{"name":"SIDURGU","text":"That should be the last of them."},{"name":"SIDURGU","text":"Hm. I've seen these ones about before. They don't answer to the lord commander─or so I hear."},{"name":"SIDURGU","text":"Bastards thought to take us outside the city, away from prying eyes..."},{"name":"SIDURGU","text":"Don't want to be seen murdering a girl in the streets of the Holy See, do they!? Even their staunchest supporters couldn't abide that!"},{"name":"SIDURGU","text":"Seems our new friend has already abandoned us. Naught for it, then. Back to Ishgard we go."},{"name":"SIDURGU","text":"Come along, Rielle."},{"name":"RIELLE","text":"You're not hurt, are you?"},{"name":"SIDURGU","text":"I trust you no longer dispute the true nature of the Temple Knights."},{"name":"SIDURGU","text":"Murderers and thieves who drape themselves in the trappings of righteousness."},{"name":"SIDURGU","text":"Do you not <span class=\"emphasis\">see</span>, <span class=\"highlight\">Forename</span>!? We are all that stands between them and their prey!"},{"name":"SIDURGU","text":"There is no justice for these monsters save that which we must deliver!"},{"name":"SIDURGU","text":"I will see them answer for their sins, I swear it! If I have to drown in the abyss to see it done, I will!"},{"name":"RIELLE","text":"<span class=\"highlight\">Forename</span>!"},{"name":"RIELLE","text":"<span class=\"highlight\">Forename</span>, Sid, I...I wanted to thank you both for protecting me earlier! And...apologize for getting you two hurt..."},{"name":"SIDURGU","text":"...Don't be foolish. You've naught to apologize for."},{"name":"SIDURGU","text":"In any case, at least we learned something of our enemies' motives."},{"name":"SIDURGU","text":"Not that I have the faintest inkling of what the healer meant by “great spirit”..."}],"reward":{"gil":954,"action":3639,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":98}],"quests":[67595]},"next":[67597]},"partials":[{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1015033","obj":{"i":1015033,"n":"Vanu Healer","l":2100,"q":1}},{"type":"npc","id":"1015034","obj":{"i":1015034,"n":"Sidurgu","l":2100,"q":1}},{"type":"npc","id":"1015035","obj":{"i":1015035,"n":"Rielle","l":2100,"q":1}},{"type":"npc","id":"1015036","obj":{"i":1015036,"n":"Sidurgu","l":2100,"q":1}},{"type":"npc","id":"1015037","obj":{"i":1015037,"n":"Rielle","l":2100,"q":1}},{"type":"action","id":"3639","obj":{"i":3639,"n":"Salted Earth","c":3066,"j":32,"t":4,"l":52}},{"type":"quest","id":"67595","obj":{"i":67595,"n":"The Wages of Mercy","g":157,"l":"Coerthas Central Highlands","s":501,"f":1}},{"type":"quest","id":"67597","obj":{"i":67597,"n":"Kindred Spirits","g":157,"l":"Ishgard","s":540,"f":1}}]}