{"quest":{"name":"Ishgardian Justice","location":"Ishgard","id":67590,"patch":3.0,"sort":301,"icon":100446,"unlocksFunction":1,"eventIcon":71341,"issuer":1014875,"target":1014889,"involved":[1014878,1014879,1014880,1014882,1014883,1014887,1014888],"genre":157,"journal":["Fray is ready to teach you. You need only ask.","Fray speaks to you of the first dark knight─a goodly knight who sacrificed all in order to bring an untouchable man to justice. Too many fear the consequences such actions will bring, and innocents suffer for our indecision, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> says. Consider <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> words as you seek out the source of the earlier scream.","You come upon an old woman, who beseeches you to save her granddaughter─a spirited young woman who was seized by Temple Knights after an altercation. It soon becomes clear that she is not the first girl to be taken under such circumstances, and that the Temple Knights' intentions are anything but honorable. Fray observes that the girl might survive the ordeal─but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> knows full well that you would rather punish the knights for their crimes. The decision is made. Make your plans with Fray.","Fray surmises that the Temple Knights will take the girl to the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> bids you follow <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to the Pillars and discuss your next course of action there.","Fear, pain, rage─these dark emotions make for a potent fuel, Fray tells you. Should things turn violent, you may need to draw upon this darkness to strike down your enemies. Prepare for the worst and search the Pillars for the Temple Knights.","Oh, how they screamed when you came for them. How their cries of anger turned to fear! How you bathed in the fires of your hatred to bring them to justice. Fray's words were music in your ears as they echoed in the Tribunal, as you promised them a reckoning should they dare speak of this day again...","As you tend to the girl afterwards, you ask if she recalls who it was that screamed your name when she was taken. She tells you, however, that only her grandmother cried out. Thanking you a final time, she hurries back towards the Brume, leaving you alone with Fray.","“You have done well,” Fray tells you. Far better than <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> could have hoped. But the risks will only increase as you walk further along the path. “Trust in me,” <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> asks, and you want to. You know that you need to...and that, when the time is right, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will be waiting for you where you first met.<br><br>※The next dark knight quest will be available from Fray upon reaching level 35."],"objectives":["Search for the screaming woman.","Speak with Fray.","Speak with Fray in the Pillars.","Search for the Temple Knights.","Speak with the frightened maid.","Speak with Fray.","Rescue the frightened maid!","Darkness"],"dialogue":[{"name":"FRAY","text":"Well, well, don't you look the part. Ready to harness the darkness within to set the wrong things right."},{"name":"FRAY","text":"Now, bear in mind that while the darkness gives you strength, that strength comes at cost. That is but one sacrifice, though─and justice demands many."},{"name":"FRAY","text":"Say a man─a venerable, untouchable man─harms a child in unspeakable ways. He strides through the Hoplon, secure in the knowledge that he is beyond punishment. But for one who cuts down that vile beast as he flaunts his freedom, who knows how many others will suffer?"},{"name":"FRAY","text":"Such was the dilemma faced by a goodly knight long ago. He knew that he would be stripped of his titles and denounced for the deed."},{"name":"FRAY","text":"The threshold we refuse to cross is a line we draw for ourselves. We fear the consequences, and people suffer for our indecision."},{"name":"FRAY","text":"Everyone who held that crystal came to conquer that fear, and became who they wanted to be. That knight was the first. Will you be the next?"},{"name":"FRAY","text":"Think on that while we look into the commotion down below."},{"name":"FRAY","text":"Here we are. Go and ask her what's wrong."},{"name":"GRANDMOTHER02054","text":"Please, I don't know what to do! It's...it's my granddaughter..."},{"name":"GRANDMOTHER02054","text":"I didn't see him standing there─and I know that's no excuse, I should've been more careful."},{"name":"GRANDMOTHER02054","text":"But my granddaughter, she started yelling at the Temple Knight─and I tried to stop her, I did! But then he said she had to come with him, and...and if I could just tell him how sorry I am, maybe...maybe he would..."},{"name":"POOR02054","text":"(-Weary Young Man-)...He'd take you too is what he'd do."},{"name":"POOR02054","text":"(-Weary Young Man-)Even if you went and begged the blue bastard to intervene, it'd be too late by then."},{"name":"POOR02054","text":"(-Weary Young Man-)...Ain't the first time they've taken a girl her age. If she doesn't fight back, they might let her go after..."},{"name":"GRANDMOTHER02054","text":"No, no! There has to be another way!"},{"name":"FRAY","text":"Ah, Ishgardian justice."},{"name":"FRAY","text":"They might spare the girl, you know. Leave her with a few scars and a lifelong lesson."},{"name":"FRAY","text":"...Or we could beat every last one of them to within an ilm of their lives and rescue the girl. You'd like that, wouldn't you?"},{"name":"FRAY","text":"I knew you would."},{"name":"FRAY","text":"Everything is going to be all right, madam. When I'm through with those knights, they will not dare trouble you ever again."},{"name":"GRANDMOTHER02054","text":"Oh, thank you, <span class=\"emphasis\">thank you</span>!"},{"name":"GRANDMOTHER02054","text":"Please...please bring her back to me!"},{"name":"FRAY","text":"Assuming they didn't just drag her into an alley, they've taken her to either the Congregation or the Tribunal."},{"name":"FRAY","text":"The honorable Ser Aymeric wouldn't suffer such reprehensible behavior under his roof. The inquisition, on the other hand...well."},{"name":"FRAY","text":"So that leaves the Tribunal."},{"name":"FRAY","text":"If the girl is still alive, I imagine they'll make all manner of threats. “Come any closer and she dies,” and so forth. If so, we'll need to make something perfectly clear to them..."},{"name":"FRAY","text":"We're not here for her; we're here for <span class=\"emphasis\">you</span>."},{"name":"FRAY","text":"Once they understand she means nothing to us, they'll attack us or flee. I don't know about you, but I'm eager to find out which."},{"name":"SYSTEM","text":"You have learned all dark knight actions and traits to level 30. Detailed descriptions can be viewed in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"FRAY","text":"Just the one sword between the two of us, I'm afraid. You keep it─I daresay it fits rather snugly in your hands."},{"name":"FRAY","text":"But don't worry about me─I'll do my part to keep you on your feet."},{"name":"FRAY","text":"Now, should things turn violent─as I expect they shall─you may need to tap into your darkside to survive."},{"name":"FRAY","text":"It's not unlike drawing upon your own aether to weave magic."},{"name":"FRAY","text":"Fear, pain, rage─that which lies in the deepest depths of our soul makes for a potent fuel."},{"name":"FRAY","text":"But be warned: burn too much too quickly, and you risk being consumed."},{"name":"FRAY","text":"Do not worry, <span class=\"highlight\">Forename</span>. The first step over the threshold is always the hardest."},{"name":"FRAY","text":"...Ah, yes. I should've known you'd do that."},{"name":"FRAY","text":"Right, then. Let's find the girl."},{"name":"FRAY","text":"Search the area between here and the Tribunal for the knights. I'll be right behind you."},{"name":"DAUGHTER02054","text":"Wh-Who are you? Another highborn arse!?"},{"name":"CAVALRYLEADER02054","text":"Dammit, girl! You're only making it worse for yourself!"},{"name":"DAUGHTER02054","text":"The hells with you! I've done nothing wrong!"},{"name":"CAVALRYLEADER02054","text":"&lt;sigh&gt; Why are the pretty ones always so daft..."},{"name":"FRAY","text":"If I had a gil for every time I had to kill an unrepentant bastard like you..."},{"name":"CAVALRYLEADER02054","text":"Wh-What the...? Are you <span class=\"emphasis\">threatening</span> a Temple Knight?"},{"name":"FRAY","text":"Oh, you're very clever. Yes, I am. Now let her go."},{"name":"CAVALRYLEADER02054","text":"I...I... Enough of this!"},{"name":"CAVALRYLEADER02054","text":"With me, girl─<span class=\"emphasis\">now</span>! One more word of protest and I'll toss your grandmother in a cell to rot!"},{"name":"CAVALRYLEADER02054","text":"You three─seize this imbecile!"},{"name":"FRAY","text":"Well done, hero. I think the fair maiden wants to have a word."},{"name":"DAUGHTER02054","text":"I don't know what to say, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Thank you, <span class=\"emphasis\">thank you</span>!"},{"name":"DAUGHTER02054","text":"I...I got a little carried away earlier. It's just that when I saw how they were treating my grandmother, I had to say something, and─"},{"name":"DAUGHTER02054","text":"...What? No one screamed your name. My grandmother called out, just the once, but that was it..."},{"name":"DAUGHTER02054","text":"Speaking of which, I should hurry back..."},{"name":"DAUGHTER02054","text":"I suppose I ought to say that I'm sorry for what I did...but I'm not. Those knights had it coming. Halone bless you for what you did."},{"name":"FRAY","text":"Feels good, doesn't it? Strange, maybe─but a <span class=\"emphasis\">good</span> strange, I'll wager."},{"name":"FRAY","text":"You tapped into something primal. A power nestled within you, yearning to be free."},{"name":"FRAY","text":"As your understanding of this power grows, so too will your skill as a dark knight."},{"name":"FRAY","text":"You have done well─far better than I could have hoped, in fact. But there is still so much more to learn─so much further to go."},{"name":"FRAY","text":"I won't lie to you, <span class=\"highlight\">Forename</span>. The risks will only increase. So if you want to keep going, you have to trust in me. Can you do that?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I can."},{"name":"A2","text":"I don't know..."},{"name":"FRAY","text":"Good. That's a promise."},{"name":"FRAY","text":"Circumstances being what they are, it might be best if we parted ways for a while. Think of it as an opportunity to hone your skills in my absence."},{"name":"FRAY","text":"But don't worry─we will meet again. When the time is right, I'll be waiting where we first met."},{"name":"FRAY","text":"It's only natural to have doubts. I appreciate your honesty."},{"name":"FRAY","text":"Give some thought to what I said. When you are ready, come and find me. I'll be waiting where we first met."},{"name":"SYSTEM","text":"The next dark knight quest will be available from Fray upon reaching level 35."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"QIB","text":"No! It will not end here!"},{"name":"QIB","text":"Surrender or die!"},{"name":"QIB","text":"Funny─I was about to say the same thing!"},{"name":"QIB","text":"Show them no mercy, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"Bring...bring everyone! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s gone mad!"},{"name":"QIB","text":"Reinforcements, eh? Looks like we'll have to even the odds."},{"name":"QIB","text":"Search your soul for the darkness. We need but a sliver... Yes..."},{"name":"QIB","text":"Do you see, <span class=\"highlight\">Forename</span>? The flames beckon."},{"name":"QIB","text":"Immerse yourself in the flames and ignite the darkness within."},{"name":"QIB","text":"Just so. As it burns hotter, so too does your strength swell."},{"name":"QIB","text":"But drink not too deep, lest the flames consume you..."},{"name":"QIB","text":"Draw upon your darkside and drive your foes before you!"},{"name":"QIB","text":"All this for a baseborn bitch!? Do you know what you're doing!?"},{"name":"QIB","text":"Aye, I do! I'm killing you and anyone else who gets in my way!"},{"name":"QIB","text":"The next knight who bears steel, I'm not only going to kill him, but I'm going to kill his wife, his friends, and burn his godsdamned house down!"},{"name":"QIB","text":"Th-Thank you..."},{"name":"QIB","text":"Those of you who yet live, remember this horror! And know that should you speak of it, it shall be visited upon you again a hundredfold!"}],"reward":{"action":16466,"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":98}],"quests":[67589]},"next":[67591]},"partials":[{"type":"npc","id":"1014875","obj":{"i":1014875,"n":"Fray","l":2300,"q":2}},{"type":"npc","id":"1014889","obj":{"i":1014889,"n":"Fray","l":2301,"q":1}},{"type":"npc","id":"1014878","obj":{"i":1014878,"n":"Fray","l":2300,"q":1}},{"type":"npc","id":"1014879","obj":{"i":1014879,"n":"Lowborn Crone","l":2300,"q":1}},{"type":"npc","id":"1014880","obj":{"i":1014880,"n":"Fray","l":2300,"q":1}},{"type":"npc","id":"1014882","obj":{"i":1014882,"n":"Fray","l":2301,"q":1}},{"type":"npc","id":"1014883","obj":{"i":1014883,"n":"Pernicious Temple Knight","l":2301,"q":1}},{"type":"npc","id":"1014887","obj":{"i":1014887,"n":"Frightened Maid","l":2301,"q":1}},{"type":"npc","id":"1014888","obj":{"i":1014888,"n":"Frightened Maid","l":2301,"q":1}},{"type":"action","id":"16466","obj":{"i":16466,"n":"Flood of Darkness","c":3082,"j":32,"t":4,"l":30}},{"type":"quest","id":"67589","obj":{"i":67589,"n":"Our End","g":157,"l":"Ishgard","s":300,"f":1}},{"type":"quest","id":"67591","obj":{"i":67591,"n":"The Voice in the Abyss","g":157,"l":"Ishgard","s":350,"f":1}}]}