{"quest":{"name":"Original Sins","location":"Ishgard","id":67598,"patch":3.0,"sort":560,"icon":100447,"unlocksFunction":1,"eventIcon":71341,"issuer":1013969,"target":1013969,"involved":[1011935,1013970,1015044,1015045,1015046],"genre":157,"journal":["Sidurgu recognizes that desperate times call for desperate measures.","Sidurgu believes that if Rielle holds some affinity with the dragons, then the only way to be certain is to present her to a Dravanian. He believes this to be a nigh-impossible task─until you reveal that you have already parleyed with Vidofnir, that is. Journey to Anyx Trine and entreat the dragon for her aid.","Vidofnir studies your companions, her gaze lingering on Rielle a moment longer. She then asks that you bring an offering of gron ahlm as a gesture of goodwill. Discuss her request with Sidurgu.","Though puzzled by the request, Sidurgu accepts that it must be done. He and Rielle will search the lands to the north for the flowers, while you will search the south.","As Vidofnir warned, your attempt to harvest gron ahlm was not without incident. In any case, the flowers are now yours. Return to the dragon and see if your offering is sufficient.","Vidofnir tells you of a dragon on the verge of death in Mourn, who has the answers you seek. Present the flowers to the Dravanian and hearken to her words.","Through labored breaths, the dragon declares that the blood of her beloved flows strong in Rielle's veins. Furthermore, the fact that the girl has not succumbed to the blood suggests that it was passed on to her by her parents. Forced to accept the truth at last, Sidurgu despairs that the Temple Knights will never cease their pursuit of Rielle. He bemoans his inability to harness the abyss his master spoke of, which piques the dying dragon's curiosity. After learning the nature of your dark arts, the dragon chides you for your foolishness, stating that even the tiny beings who frolic in the mists of Sohm Al know a better way. Sidurgu presses her for details, but the dragon's energy is spent. No more answers will be had. Return to Ishgard and discuss what you have learned.","As you and Sidurgu weigh your options, a noblewoman strides into the Forgotten Knight and names you as the “knights” who would defy the will of Halone. Introducing herself as Ystride de Caulignont, she offers you a choice: trial by combat, or death for you and all who dare aid you. Seeing no alternative, Sidurgu grudgingly agrees. As Ystride turns to leave, Rielle at last cries out, revealing that she is Ystride's daughter. Incensed by her daughter's words, Ystride storms out of the tavern, and Sidurgu whirls about to confront Rielle. He demands to know why she never told him, shouting that he and Fray had a right to know─reminding her they bled for her, that Fray died for her. Shaken, she struggles to explain, but Sidurgu has heard enough. Refusing to look at Rielle, he bids you leave them for now, that he might have time to think.<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 58."],"objectives":["Speak with Vidofnir in Anyx Trine.","Speak with Sidurgu.","Search for gron ahlm in Avalonia Fallen.","Present the gron ahlm to Vidofnir.","Present the gron ahlm to the dying dragon in Mourn.","Speak with Sidurgu in Ishgard."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Mourn in Passing.”"},{"name":"SIDURGU","text":"I've been thinking, <span class=\"highlight\">Forename</span>..."},{"name":"SIDURGU","text":"The Padjal likened Rielle's spiritual presence to that of a Dravanian, hence why he suggested she had partaken of dragon blood."},{"name":"SIDURGU","text":"Regardless of the cause, if she does hold some affinity with dragons, she will never be safe here in Ishgard."},{"name":"SIDURGU","text":"“If” being the operative word, of course. We need to know for certain...which means we must parley with a Dravanian."},{"name":"SIDURGU","text":"It will not be easy, I realize. The Dravanians are not wont to entertain outsiders, especially ones hailing from Ishgard..."},{"name":"SIDURGU","text":"You...you have spoken with their leaders!?"},{"name":"SIDURGU","text":"Beg pardon, I did not think you would so readily admit it. Well, well! Pray lead the way, <span class=\"highlight\">Forename</span>!"},{"name":"SIDURGU","text":"I pray this Vidofnir can give us the answers we seek..."},{"name":"RIELLE","text":"Ever since you joined us, we've visited so many new places."},{"name":"RIELLE","text":"I'm sure Fray would've enjoyed it too..."},{"name":"SIDURGU","text":"She is rather large, isn't she..."},{"name":"RIELLE","text":"I've never seen a dragon up close before! They're so big!"},{"name":"VIDOFNIR","text":"Thou keepest curious company, mortal..."},{"name":"VIDOFNIR","text":"...I see."},{"name":"VIDOFNIR","text":"Though I trust in thy words, thy companions are unknown to me. A token, then, for them to declare their intent."},{"name":"VIDOFNIR","text":"I would have them gather up gron ahlm in Avalonia Fallen and bring it to me."},{"name":"VIDOFNIR","text":"But ware the beasts which are drawn by their fragrance..."},{"name":"VIDOFNIR","text":"Thou must prepare an offering of gron ahlm. Only then shall we speak of other things."},{"name":"RIELLE","text":"So dragons like flowers...just like we do..."},{"name":"SIDURGU","text":"Right, then. Gathering flowers for a dragon. No point in questioning it."},{"name":"SIDURGU","text":"Rielle and I will search the lands north of here together. You can take the south."},{"name":"SIDURGU","text":"Doubtless she has her reasons. I merely wish I was privy to them."},{"name":"VIDOFNIR","text":"Such fragile, fleeting creations. Bring them close, mortal, that I might breathe deep of their essence."},{"name":"VIDOFNIR","text":"That which passeth into death liveth on in memory..."},{"name":"VIDOFNIR","text":"One prepareth now for the journey. Bid farewell to her in Mourn and find the answer thou seekest."},{"name":"VIDOFNIR","text":"If thou wouldst know the legacy of the child, then seek the ancient one in Mourn."},{"name":"DRAGON02062","text":"Let me linger a while longer, hunter. Soon my soul shall take wing..."},{"name":"DRAGON02062","text":"I shall miss this."},{"name":"DRAGON02062","text":"...Vidofnir bade you come to me?"},{"name":"DRAGON02062","text":"His scent...entwined... Ahhh, I see now..."},{"name":"SIDURGU","text":"We seek no quarrel, O ancient one. Only answers."},{"name":"DRAGON02062","text":"...Come forward, child."},{"name":"DRAGON02062","text":"There you are, my beloved... How...how long hath it been since we soared through the mists..."},{"name":"SIDURGU","text":"Wh-What did you say!?"},{"name":"DRAGON02062","text":"Silence, dark one."},{"name":"DRAGON02062","text":"He liveth on in you, child. The blood of my beloved floweth strong in thy veins."},{"name":"DRAGON02062","text":"Yet...mingled as it is... 'Twas not thee who partook of his essence..."},{"name":"DRAGON02062","text":"Were it not so, thou wouldst have been overcome..."},{"name":"DRAGON02062","text":"Thy progenitors...drank deep...to spur their own becoming..."},{"name":"SIDURGU","text":"Then...then it's true...and the Temple Knights knew!"},{"name":"SIDURGU","text":"Then they will never stop─they <span class=\"emphasis\">cannot</span>! Even if we flee Ishgard..."},{"name":"SIDURGU","text":"If...if we could but harness the abyss..."},{"name":"DRAGON02062","text":"Thou speakest strange, dark one. What dost thou seek?"},{"name":"DRAGON02062","text":"Ho... Shrouded in thy rancor, thou standest apart from thy charge."},{"name":"DRAGON02062","text":"The folly of youth. Even the tiny beings who frolic in the mists of Sohm Al know a better way."},{"name":"SIDURGU","text":"What!? Who?"},{"name":"DRAGON02062","text":"No more, dark one. No more."},{"name":"DRAGON02062","text":"Farewell, child. Fly free...for us..."},{"name":"RIELLE","text":"Good-bye...and thank you."},{"name":"SIDURGU","text":"There's naught more for us here. To Ishgard."},{"name":"DRAGON02062","text":"Leave me to slumber, dark one. My beloved singeth to me."},{"name":"RIELLE","text":"...I see now."},{"name":"SIDURGU","text":"...This changes nothing."},{"name":"SIDURGU","text":"I swore an oath to protect her, and I mean to uphold it─no matter the cost."},{"name":"YSTRIDE","text":"(-???-)So these are the “knights” who would defy the will of Halone."},{"name":"RIELLE","text":"She...she's found us!"},{"name":"SIDURGU","text":"My lady surely knows she will find few friends here."},{"name":"YSTRIDE","text":"(-???-)Blessed are we who abide in Her grace, for we shall never be forsaken."},{"name":"YSTRIDE","text":"One day I, Ystride de Caulignont, shall walk in Her halls...and you shall answer for your deeds."},{"name":"YSTRIDE","text":"Will you stand before Her and claim that you were righteous? That it was just to take so many lives in defense of that abomination!?"},{"name":"YSTRIDE","text":"Repent of your sins and surrender it to me. The Fury may yet spare your souls."},{"name":"SIDURGU","text":"So yours is the righteous cause?"},{"name":"SIDURGU","text":"To condemn a girl to death for her parents' deeds─this is the will of Halone?"},{"name":"YSTRIDE","text":"...Yes. Yes, it is."},{"name":"YSTRIDE","text":"If you will not see reason, even with full knowledge of the facts, then I make to you all a final offer: submit to a trial by combat."},{"name":"YSTRIDE","text":"Survive, and you may go in peace. Fall, and it is mine."},{"name":"YSTRIDE","text":"Refuse, and I will put this tavern to the torch and have the heads of every man, woman, and child here."},{"name":"YSTRIDE","text":"Anyone who dares harbor you will suffer the same, here or elsewhere. This I swear to you."},{"name":"SIDURGU","text":"Would that we could settle this here and now...but I'd wager your men at the doors would take offense."},{"name":"SIDURGU","text":"As you wish, my lady. You shall have your trial."},{"name":"YSTRIDE","text":"I shall send a messenger with details."},{"name":"RIELLE","text":"M-Mother, wait!"},{"name":"YSTRIDE","text":"...I should've had them cut out your tongue."},{"name":"SIDURGU","text":"Rielle, what in the seven hells is going on!?"},{"name":"RIELLE","text":"She...she told them to take me. She said I wasn't hers...that I was..."},{"name":"SIDURGU","text":"Why didn't you tell me this was all your mother's doing!?"},{"name":"SIDURGU","text":"I bled for you! Fray <span class=\"emphasis\">died</span> for you! We had a right to know!"},{"name":"RIELLE","text":"I...I didn't mean for..."},{"name":"SIDURGU","text":"Godsdammit all!"},{"name":"SIDURGU","text":"...Leave us, <span class=\"highlight\">Forename</span>. I need time to think."}],"reward":{"gil":1421,"action":3641,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":98}],"quests":[67597]},"next":[67599]},"partials":[{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1011935","obj":{"i":1011935,"n":"Vidofnir","l":2000,"q":10}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1015044","obj":{"i":1015044,"n":"Sidurgu","l":2000,"q":1}},{"type":"npc","id":"1015045","obj":{"i":1015045,"n":"Rielle","l":2000,"q":1}},{"type":"npc","id":"1015046","obj":{"i":1015046,"n":"Dying Dragon","l":2000,"q":1}},{"type":"action","id":"3641","obj":{"i":3641,"n":"Abyssal Drain","c":3064,"j":32,"t":4,"l":56}},{"type":"quest","id":"67597","obj":{"i":67597,"n":"Kindred Spirits","g":157,"l":"Ishgard","s":540,"f":1}},{"type":"quest","id":"67599","obj":{"i":67599,"n":"The Flame in the Abyss","g":157,"l":"Ishgard","s":580,"f":1}}]}