{"quest":{"name":"Double Trouble","location":"Ul'dah","id":67608,"patch":3.0,"sort":550,"icon":100458,"unlocksFunction":1,"eventIcon":71341,"issuer":1012528,"target":1012528,"involved":[1004093,1011220,1012535],"genre":139,"usedItems":[12521],"journal":["Marcel is looking somewhat agitated.","As you greet a flustered Marcel, Still River─husband to Jeweled Peak─appears on the scene. The grizzled warrior brusquely informs the two of you that he is looking to commission a gift for his wife on their anniversary─a gift which coincidentally matches his wife's order to the letter. Marcel, having been sworn to secrecy by both of his clients, is at a loss. He asks you to return to the guild and seek the wisdom of Mistress Serendipity.","As a possible solution to your dilemma, Mistress Serendipity suggests you travel to Ishgard to seek out one Pierryvain, composer of the timeless melody that your two clients seek to use for their music boxes. With her letter of introduction in hand, pay a visit to the guardsman at Haillenarte Manor.","Bartelot informs you that Master Pierryvain has departed for the Sea of Clouds with his lord in search of inspiration for his latest and greatest masterpiece. Make for Camp Cloudtop and seek out the celebrated composer.","True to his reputation as a musical genius, Pierryvain has no sooner heard your plight than does he offer a solution─he will create two arrangements of his timeless melody that both husband and wife might have music boxes that are separate, and yet one. In turn, he demands that your creation be crafted to produce clear tones worthy of his work. Fashion a hardsilver ingot to impress upon the artiste your ability to do his piece justice.","Pierryvain is taken with the sterling quality of your ingot, and agrees to grant you permission to use his work, entrusting you with sheet music to the two arrangements he has penned for the occasion. Return to Ul'dah and deliver them to Marcel, along with the news that your dilemma has been solved.","Marcel eyes the sheet music with wonder, deeply impressed at the lengths to which you went to fulfill the wishes of his clients. Declaring your devotion to your art first-rate, he eagerly presses forward with preparations, encouraging you to continue to hone your skills in the meanwhile.<br><br>※The next goldsmith quest will be available from Marcel upon reaching level 58."],"objectives":["Speak with Serendipity at the Goldsmiths' Guild.","Deliver the decorated envelope to Bartelot outside Haillenarte Manor in Ishgard.","Speak with Pierryvain at Camp Cloudtop.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a hardsilver ingot</span><span class=\"alternative\">Deliver the hardsilver ingot to Pierryvain</span></span>.","Deliver the page of sheet music to Marcel in Ul'dah."],"dialogue":[{"name":"MARCEL","text":"Yes, yes, what is it─oh, <span class=\"highlight\">Surname</span>. Pardon me, I was in a bit of a fluster. I've just received word that my client's husband is en route to this establishment at this very moment."},{"name":"MARCEL","text":"As for why, I haven't a clue. I have kept his wife's commission in the strictest of confidence, just as I was instructed─ah, but speak of the devil."},{"name":"STILLRIVER","text":"Marcel! I'm a busy man, so I'll get straight to the point. My bondin' anniversary's comin' up, and I need somethin' for my better half. Don't worry, I've already thought up the perfect present─a music box of solid gold!"},{"name":"STILLRIVER","text":"Never heard of anythin' so inspired, have you? Ahaha! You don't have to say it; I can see it in your dumbstruck faces! And it doesn't end there. I've even picked out the perfect song─the timeless melody that made the Songstress of Ul'dah a household name the realm over!"},{"name":"STILLRIVER","text":"Aye, I remember it like it was yesterday. I was swayin' back and forth in a half-blind rapture, enthralled by the Songstress's ethereal voice, when I near bumped into the lovely lass sittin' next to me. I knew it at that very moment─now this was a woman I could spend an eternity with."},{"name":"STILLRIVER","text":"You see what I'm gettin' at, Marcel? On our anniversary day, I want to make Jeweled Peak as happy as she's made me. And a music box from Eshtaime's is goin' to be the golden ticket. And with that, I'm off─and I trust you not to speak a word of this to my wife!"},{"name":"MARCEL","text":"Twin music boxes commissioned by husband and wife, to be gifted on the same day, playing the same exact song. This is an unexpected development, to say the least."},{"name":"MARCEL","text":"I could speak to one or the other and persuade them to reconsider their choice of present, but then I would be breaking my vow of secrecy. No, a man is nothing without his word."},{"name":"MARCEL","text":"I will give this some thought. In the meantime, why don't you speak with Mistress Serendipity and see if she has some insight into our predicament."},{"name":"MARCEL","text":"I will give the matter of the twin music boxes some thought. In the meantime, why don't you speak with Mistress Serendipity and see if she has some insight into our predicament?"},{"name":"SERENDIPITY","text":"Oh, dear. You and Marcel have gotten yourselves in quite the pickle, haven't you? And I don't mean a sea pickle─which can be quite tasty in a light vinegar sauce, if what I hear is to be believed... But where were we?"},{"name":"SERENDIPITY","text":"Oh, yes. The two music boxes. Marcel is right not to betray his vow of secrecy. Yet at the same time, simply crafting two identical music boxes would be a recipe for disaster."},{"name":"SERENDIPITY","text":"At times like these, I think back to the words of my master. “When faced with a dilemma,” he would say, “the true artisan seeks answers in the pursuit of the infinite possibilities of his art.”"},{"name":"SERENDIPITY","text":"A music box affords plenty of possibilities, does it not? There are plenty of ways to introduce variety─both in its physical appearance, and in the melody it plays. Speaking of which, what song is it you would have your creation play?"},{"name":"SERENDIPITY","text":"Oh, why, yes, I remember the piece quite well. You'd be hard-pressed to find anyone in the sultanate who doesn't harbor a fondness for the ballads of the Songstress of Ul'dah. Why, believe it or not, the composer of the piece─Pierryvain is his name─is a personal acquaintance of mine!"},{"name":"SERENDIPITY","text":"He's quite the genius─and not shy about telling others just that. If anyone would know how to lend a special touch to your work, it would be him. But don't just take my word for it. What say you go speak to him yourself?"},{"name":"SERENDIPITY","text":"That said, it may prove quite a trek. He left the sultanate some years ago, and now serves as the personal musician and performer for House Haillenarte in Ishgard. Have you been to Ishgard, <span class=\"highlight\">Forename</span>? It's ever so cold, but those snowy vistas are oh-so-beautiful, if I do say so myself!"},{"name":"SERENDIPITY","text":"Oh, but what are we standing around here chatting for? Here, take this─it's a personal letter of introduction from yours truly that should suffice for getting you through the doors of Haillenarte Manor. And do send Master Pierryvain my regards!"},{"name":"SERENDIPITY","text":"The letter of introduction I gave you should suffice to grant you passage to Haillenarte Manor. Do send Master Pierryvain my regards!"},{"name":"BARTELOT","text":"What business have you with House Haillenarte?"},{"name":"BARTELOT","text":"You seek Master Pierryvain, do you? I fear he left the manor days ago for the Sea of Clouds, where he would travel with milord's retinue."},{"name":"BARTELOT","text":"A real artiste, that one. Said that the view from atop the clouds would inspire him to compose a masterpiece like none this world had ever known. Milady, being quite taken with the man's work, persuaded milord, and that was that."},{"name":"BARTELOT","text":"The man can pen a good song─I'll give you that─but if you ask me, there's no place for a glorified minstrel on the field of battle. Still, if you'd meet with the man, far be it from me to stop you. You'll find him at Camp Cloudtop."},{"name":"BARTELOT","text":"If you'd meet with Pierryvain, far be it from me to stop you. You'll find him at Camp Cloudtop."},{"name":"PIERRYVAIN","text":"You are...wait! Do not tell me! Another one of my adoring fans, who has traversed the realm and climbed nigh to the heavens to be the first to lay ears upon my latest magnum opus!"},{"name":"PIERRYVAIN","text":"...Oh? A student of Serendipity's who would grace <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> music box with one of my mellifluous melodies? You clearly are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of taste, friend. Yes, that is perhaps the greatest of my many masterpieces─so taken was I with the voice of my muse, F'lhaminn, that I penned it in but a single night."},{"name":"PIERRYVAIN","text":"I see... So this husband and wife you speak of have both commissioned identical music boxes, each unbeknownst to the other."},{"name":"PIERRYVAIN","text":"Fear not, friend. If you were looking for a stroke of genius, you have come to precisely the right place. Why, the answer is simple─I need merely compose two new arrangements of my timeless melody!"},{"name":"PIERRYVAIN","text":"In return, I have one simple but unwavering demand. You must craft a music box of peerless quality, that its tones will do the dulcet voice of the Songstress of Ul'dah─and my masterpiece─true justice."},{"name":"PIERRYVAIN","text":"In my many years and many travels, I have only encountered one such relic: said to be the lifework of a master craftsman, its teeth were fashioned from the purest hardsilver."},{"name":"PIERRYVAIN","text":"...Yes, I simply could not entrust my masterpiece to one who was any less a master of hardsilver than I am a master of melodies. If you believe you are worthy, fashion for me a hardsilver ingot, that I might assess your skills."},{"name":"PIERRYVAIN","text":"Well? Do you have an ingot to show me?"},{"name":"PIERRYVAIN","text":"Are my eyes to be believed!? I have never seen hardsilver shine and sparkle so! Why, just looking at it, I can hear tones as clear and crisp as the waters of the Thaliak!"},{"name":"PIERRYVAIN","text":"Feel proud, friend, for the great Pierryvain has deemed you worthy of giving form to two never-before-heard arrangements of his greatest masterpiece. Take them, and use them well."},{"name":"PIERRYVAIN","text":"One melody for the husband, and one for the wife─I trust that you will see that not a single note, sharp, or flat is out of place."},{"name":"PIERRYVAIN","text":"Played separately, the two will sound as if they are playing entirely different songs. When placed side by side and started simultaneously, however─oh, but to say any more would spoil the surprise!"},{"name":"PIERRYVAIN","text":"In creating the arrangements, I drew inspiration from traditional choir chants. To my knowledge, none have ever attempted to revisit a modern piece in this way. The loving couple shall feast their ears on something that has never been heard before. You have my promise."},{"name":"PIERRYVAIN","text":"One melody for the husband, and one for the wife─I trust that you will see that not a single note, sharp, or flat is out of place."},{"name":"PIERRYVAIN","text":"In creating the arrangements, I drew inspiration from traditional choir chants. To my knowledge, none have ever attempted to revisit a modern piece in this way. The loving couple shall feast their ears on something that has never been heard before. You have my promise."},{"name":"MARCEL","text":"Ah, <span class=\"highlight\">Surname</span>. Has inspiration struck you, by any chance?"},{"name":"MARCEL","text":"Two arrangements of the same piece? Brilliant! And you traveled all the way to the Sea of Clouds to procure the sheet music? Your devotion to your craft─and to our clients─is truly first-rate!"},{"name":"MARCEL","text":"I will move forward with our preparations at once. In the meantime, I ask that you continue to refine your technique. We have a true masterpiece in the works, and I am counting on you to make it a reality!"}],"reward":{"gil":2156,"items":[{"num":200,"id":10},{"id":11884},{"id":11957,"one":1},{"id":11962,"one":1},{"id":11967,"one":1},{"id":11975,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":12}],"quests":[67607]},"next":[67609]},"partials":[{"type":"npc","id":"1012528","obj":{"i":1012528,"n":"Marcel","l":41,"q":9}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1011220","obj":{"i":1011220,"n":"Bartelot","l":2301,"q":4}},{"type":"npc","id":"1012535","obj":{"i":1012535,"n":"Pierryvain","l":2100,"q":1}},{"type":"item","id":"11884","obj":{"i":11884,"n":"Hardsilver Texture Hammer","l":100,"c":35316,"t":18,"p":14889}},{"type":"item","id":"11957","obj":{"i":11957,"n":"Ramie Turban of Crafting","l":100,"c":40470,"t":34,"p":9979}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11967","obj":{"i":11967,"n":"Dhalmelskin Halfgloves of Crafting","l":100,"c":44391,"t":37,"p":11088}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12521","obj":{"i":12521,"n":"Hardsilver Ingot","l":142,"c":20826,"t":49,"p":2856}},{"type":"quest","id":"67607","obj":{"i":67607,"n":"Elegance and Artistry","g":139,"l":"Ul'dah","s":530,"f":1}},{"type":"quest","id":"67609","obj":{"i":67609,"n":"A Masterclass","g":139,"l":"Ul'dah","s":580,"f":1}}]}