{"quest":{"name":"Burden of Proof","location":"Mor Dhona","id":67604,"patch":3.0,"sort":580,"icon":100457,"unlocksFunction":1,"eventIcon":71341,"issuer":1012558,"target":1012559,"involved":[1012564,1012565,1012566,1013671,1013673],"genre":142,"usedItems":[12622],"journal":["Wiltwaek seems to be awaiting word from Chanene.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Alchemist III</span>.</span>","Chanene has apparently found one of the missing people on the road south from Camp Revenant's Toll. Make your way there now.","You arrive to find a strange scene before you─one that Chanene's explanation does little to clarify. A single Lalafellin fellow was driving a carriage, and in the back were two barrels─of which the suspect claims no prior knowledge. Within these were two identical Hyuran men, one alive and one dead. The living one is silent, presumably in the same state as the Near Eastern youth you found earlier. Chanene is at wit's end but for a single lead: a cracked leather journal found on the dead man. In it, he speaks of a sister working in Tailfeather. Venture there now, and find out if the corpse had a twin.","The dead man's sister informs you somewhat coldly that her brother─a brute by all report─had neither a twin nor identical friends. Return to Wiltwaek in Revenant's Toll with this puzzling piece of information.","In your absence, Wiltwaek has found a witness who testifies that he saw the Lalafellin suspect lift both barrels─bodies and all─into the back of the carriage. The culprit himself, however, denies this, saying he could not possibly perform such feats of strength. Neither Wiltwaek nor Chanene believe him innocent, and so ask that you brew a high-quality draconian potion of strength. Do so, that Chanene may drink it and test if a Lalafell aided by alchemy can lift so great a weight.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Alchemist III</span>.</span>","Chanene tosses down the potion and proceeds to carry the heavy barrels up the steps with ease. With his alibi disproved, the suspect tells you everything─how an aging alchemist hired him to move the bodies, and how the twin is in fact a “clone,” a living, breathing copy of the original. This mastermind has been stealing people from their beds to practice this process, apparently born of ancient Allag's ingenuity. The culprit also tells you that this man has no problem whatsoever with killing, and begs Wiltwaek for protection. With these new facts at your feet, Wiltwaek states with furrowed brow that you must capture this mastermind soon, or there will be further bloodshed.<br><br>※The next alchemist quest will be available from Wiltwaek upon reaching level 60."],"objectives":["Speak with Chanene near Camp Revenant's Toll.","Show the cracked leather log to the victim's estranged sister at Tailfeather.","Return the cracked leather log to Wiltwaek.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a draconian potion of strength <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the draconian potion of strength <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Chanene</span></span>."],"dialogue":[{"name":"WILTWAEK","text":"Ah, <span class=\"highlight\">Forename</span>. Good. I'm just waiting on Chanene. You see, once we learned our culprits' goal, combing through the facts─"},{"name":"WILTWAEK","text":"Chanene? You found who? No, no, keep them all there─I'll come to you!"},{"name":"WILTWAEK","text":"She found one of our missing people down the road from Camp Revenant's Toll. Are you coming?"},{"name":"WILTWAEK","text":"Come on, <span class=\"highlight\">Forename</span>, to the Fogfens!"},{"name":"WILTWAEK","text":"A carriage, a corpse, two casks, and two culprits. Not <span class=\"emphasis\">quite</span> what I was expecting..."},{"name":"CRIMINAL02068","text":"See bloody reason, lass─I'm a <span class=\"emphasis\">victim</span> here, not a criminal!"},{"name":"JOHNDOE2068","text":"..."},{"name":"CHANENE","text":"What a bloody mess! I'll start at the beginning. I came to investigate a report of a suspicious carriage, and found this fellow."},{"name":"CHANENE","text":"I'll be hanged if he's not one of our criminals. But he denies everything, particularly that he knew two Hyurs were in his carriage. Both were stuffed into barrels, and one was dead."},{"name":"CHANENE","text":"The corpse will likely yield more than the live one, who's silent as the grave."},{"name":"JOHNDOE2068","text":"..."},{"name":"WILTWAEK","text":"He's been robbed of his ability to speak, same as the Near Eastern youth."},{"name":"CHANENE","text":"And that's not the strangest thing! Look, the living man and the dead are alike as peas in a pod! They both match descriptions of <span class=\"emphasis\">one</span> missing person. Are they twins? Cousins!?"},{"name":"WILTWAEK","text":"The facts are ours. What we want for now is a story to make sense of them. And unfortunately, Chanene and I are both at our wit's end. It doubtless goes without saying, but your help in tracking down clues would be appreciated."},{"name":"WILTWAEK","text":"We have one lead: a personal log, found on the dead man. He wrote about a younger sister working in Tailfeather."},{"name":"WILTWAEK","text":"<span class=\"highlight\">Forename</span>, could you speak with her? She should know of her brother's death. And I'd like to know if he did have a twin."},{"name":"CHANENE","text":"I cannot for the life of me see how we're going to make sense of this!"},{"name":"WILTWAEK","text":"It must be difficult, to learn of your brother's death from a stranger."},{"name":"WILTWAEK","text":"But then again, it's possible they were not on good terms. She <span class=\"emphasis\">did</span> move all the way to Tailfeather, after all."},{"name":"DEADMANSSISTER","text":"Hm? Are you talkin' to me? What's this about, then?"},{"name":"DEADMANSSISTER","text":"Dead, is he? Hmph. This <span class=\"emphasis\">is</span> his log. But I don't know who done for him. All I can say is he got what was comin'. I cut all ties with him years back."},{"name":"DEADMANSSISTER","text":"No, he didn't have no other siblin's! I've got no idea who it was you found him with, but the realm don't need more than one of the bastard! Keep the soddin' journal─I'd only burn it."},{"name":"CHANENE","text":"Whew... Moving those barrels was <span class=\"emphasis\">hard</span> work! We only just got back now."},{"name":"WILTWAEK","text":"She didn't want the journal? Well, all the more evidence for us I suppose. May I have it back?"},{"name":"WILTWAEK","text":"Confound it, who did we find with the dead man if not his twin? We'll just have to press the Lalafellin fellow all the harder!"},{"name":"WILTWAEK","text":"A witness saw him loading the body-laden barrels into the carriage. The culprit denies this, on the basis that he doesn't have the strength."},{"name":"CHANENE","text":"Which is a proper alibi, in all fairness. I couldn't lift the barrels when they were <span class=\"emphasis\">empty</span>. That said, if there were some alchemy involved, it's not impossible. Aren't there potions to imbue someone with ungodly strength?"},{"name":"WILTWAEK","text":"Yes, Severian mentioned something like that to me once. <span class=\"highlight\">Forename</span>, might you brew such a draconian potion of strength? If we give it to Chanene, we can have her try to lift the barrels the men were in. That will determine whether our culprit's story holds water."},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Alchemist III</span>."},{"name":"WILTWAEK","text":"I must say, using a draconian potion of strength to recreate what happened is <span class=\"emphasis\">exciting</span>, isn't it?"},{"name":"CHANENE","text":"We'll start the experiment just as soon as you've made the draconian potion of strength."},{"name":"WILTWAEK","text":"Now, the question is whether a Lalafell can─under the influence of a draconian potion of strength─lift a barrel with a Hyur inside."},{"name":"WILTWAEK","text":"It wouldn't do to stuff the men back into the barrels, so we'll use water to approximate their weight. Now, Chanene, whenever you're ready."},{"name":"CHANENE","text":"HAH! I did it! I lifted them! This is <span class=\"emphasis\">amazing</span> stuff, <span class=\"highlight\">Forename</span>! Can I have some mo─"},{"name":"WILTWAEK","text":"You, sir, are a damned liar! The eyewitness saw you moving the barrels, and we've shown you were more than capable of doing it with the right potion!"},{"name":"CRIMINAL02068","text":"It's true, I did it! Some old alchemist paid me to do his dirty work, and dump the body...but that's all, I swear!"},{"name":"CRIMINAL02068","text":"The man, he's insane, and he don't like loose ends! He'll sew me mouth shut to keep me quiet, then stab me with the needle! I'll spill all I know, just please, protect me!"},{"name":"WILTWAEK","text":"Only if you talk. From the beginning─why were there two identical men at the crime scene?"},{"name":"CRIMINAL02068","text":"That's how he <span class=\"emphasis\">made</span> them, see, with Allagan magicks! He's snatching folk from their homes, because he needs them to practice! “Clones,” I think he called the copies. Aye, clones!"},{"name":"CRIMINAL02068","text":"That's it, I swear! Now, you'll keep your word? The bit about stabbing me with a needle, that wasn't no jest! He's got no compunction with killing. Please, please, <span class=\"emphasis\">please</span>..."},{"name":"WILTWAEK","text":"“Clones”? What in the seven hells...? Oh, yes, consider yourself protected. Chanene?"},{"name":"WILTWAEK","text":"I can scarcely believe my ears, <span class=\"highlight\">Forename</span>, but if even half of what the scoundrel told us is true, then there is a catastrophe in the brewing. We must put a stop to this!"}],"reward":{"gil":1573,"items":[{"num":240,"id":13},{"id":11897},{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":15}],"quests":[67603]},"next":[67605]},"partials":[{"type":"npc","id":"1012558","obj":{"i":1012558,"n":"Wiltwaek","l":67,"q":6}},{"type":"npc","id":"1012559","obj":{"i":1012559,"n":"Chanene","l":67,"q":5}},{"type":"npc","id":"1012564","obj":{"i":1012564,"n":"Wiltwaek","l":67,"q":1}},{"type":"npc","id":"1012565","obj":{"i":1012565,"n":"Chanene","l":67,"q":1}},{"type":"npc","id":"1012566","obj":{"i":1012566,"n":"Lalafellin Knave","l":67,"q":1}},{"type":"npc","id":"1013671","obj":{"i":1013671,"n":"Missing Mute","l":67,"q":1}},{"type":"npc","id":"1013673","obj":{"i":1013673,"n":"Estranged Sister","l":2000,"q":1}},{"type":"item","id":"11897","obj":{"i":11897,"n":"Titanium Alembic","l":120,"c":35614,"t":24,"p":16346}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12622","obj":{"i":12622,"n":"Draconian Potion of Strength","l":145,"c":20665,"t":44}},{"type":"quest","id":"67603","obj":{"i":67603,"n":"From Hells","g":142,"l":"Mor Dhona","s":550,"f":1}},{"type":"quest","id":"67605","obj":{"i":67605,"n":"What Death Can Join Together","g":142,"l":"Mor Dhona","s":600,"f":1}}]}