{"quest":{"name":"Without a Trace","location":"Ul'dah","id":67601,"patch":3.0,"sort":502,"icon":100457,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1012558,"involved":[1002281,1012559],"genre":142,"journal":["There is a devilish glint in Guildmaster Severian's eye.","The guildmaster has a task of the utmost importance for you, his favorite assistant─delivering a report of some kind to someone in Revenant's Toll. As Severian has been rather light on details, speak with Deitrich to ascertain the who, what, and why.","Deitrich─unsurprised that the guildmaster has foisted the delivery onto you─explains that the intended recipient is one Wiltwaek. A member of the Adventurers' Guild charged with keeping the peace, Wiltwaek is currently investigating a crime in Mor Dhona. Some evidence left behind at the scene demanded Guildmaster Severian's expert eye, and the results of his analysis are what you must take to Revenant's Toll. Make your way there now with the certificate of appraisement.","You meet with Wiltwaek and his trusty companion Chanene. They inform you that a string of mysterious disappearances has plagued Revenant's Toll of late. Wiltwaek opens the certificate of appraisement and exclaims that alchemy is involved in these crimes. He further pronounces that you are to be his consultant on the case. Mystified, you listen as he reads aloud a note from Guildmaster Severian, praising you to the high heavens. As your expertise may not be needed at present, Wiltwaek bids you wait for further developments.<br><br>※The next alchemist quest will be available from Wiltwaek upon reaching level 53."],"objectives":["Speak with Deitrich.","Deliver the certificate of appraisement to Wiltwaek in Revenant's Toll."],"dialogue":[{"name":"SEVERIAN","text":"My favorite assistant! I have just the task for you. One of your alchemical prowess may scoff upon hearing it, but reserve your judgment─only <span class=\"emphasis\">you</span>, who has touched the pinnacle of our art, can accomplish it."},{"name":"SEVERIAN","text":"I must ask you to deliver a report to a friend. Deitrich can help you with the minutiae─the who, the what, and so on. Now go, go!"},{"name":"SEVERIAN","text":"Deitrich, Deitrich, take it up with Deitrich!"},{"name":"DEITRICH","text":"So he foisted it upon you, I see. Here is the certificate of appraisement for Wiltwaek."},{"name":"DEITRICH","text":"Did the guildmaster not...? No? &lt;sigh&gt; Why do I ask? Well, Wiltwaek is a member of the Adventurers' Guild, and responsible for keeping the peace in Revenant's Toll."},{"name":"DEITRICH","text":"He recently asked Master Severian to analyze evidence left behind at some crime scene. I just handed you the results."},{"name":"DEITRICH","text":"I think the guildmaster gave you the task because he could not be bothere─ Ahem. Excuse me. Because he trusts your skill as an alchemist."},{"name":"DEITRICH","text":"You shouldn't have any trouble finding Wiltwaek. He is a rather large fellow, and never goes anywhere without his assistant."},{"name":"CHANENE","text":"Hello, hello! In search of Wiltwaek? Well, you found him! He's right here."},{"name":"WILTWAEK","text":"I can't talk just now, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I'm waiting for a letter from the Alchemists' Guild. Damned thing should've been here by now..."},{"name":"WILTWAEK","text":"<span class=\"emphasis\">You're</span> Severian's assistant? How do you do, friend? I'm Wiltwaek, and this is my companion, Chanene."},{"name":"WILTWAEK","text":"Now, what does your guildmaster...? Aha, just as I suspected─alchemy!"},{"name":"WILTWAEK","text":"It's a queer business, this string of disappearances. There's some crew on the loose, I tell you!"},{"name":"WILTWAEK","text":"But that's <span class=\"emphasis\">all</span> we can say. They've stolen from sealed coffers and snatched men from locked rooms...but how? Why? We don't even have a clue what they do with their victims."},{"name":"WILTWAEK","text":"Though perhaps Severian has given us one. He identified our evidence as an alchemical catalyst. Whoever our villains, they're using your arts, friend. So it's a bloody good thing you're here to help!"},{"name":"CHANENE","text":"...You're <span class=\"emphasis\">just</span> the messenger, aren't you? Will he be coming later, then─the consultant we asked for?"},{"name":"WILTWAEK","text":"No, no, there's a note from Severian: “The <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I've sent is the guild's finest. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has earned my trust and admiration as an assistant, and I have no doubt <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will be of the utmost help to you.”"},{"name":"CHANENE","text":"Goodness me! A compliment from Master Severian is a compliment indeed!"},{"name":"WILTWAEK","text":"Yes, we are happy to have you as our consulting alchemist. This case is just begun, and we will have need of your intellect soon. The game, <span class=\"highlight\">Forename</span>, is very much afoot!"},{"name":"SYSTEM","text":"The next alchemist quest will be available from Wiltwaek upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"gil":821,"items":[{"num":120,"id":13},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":15}],"questsType":"all","quests":[66186,65964]},"next":[67602]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1012558","obj":{"i":1012558,"n":"Wiltwaek","l":67,"q":6}},{"type":"npc","id":"1002281","obj":{"i":1002281,"n":"Deitrich","l":41,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1012559","obj":{"i":1012559,"n":"Chanene","l":67,"q":5}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"66186","obj":{"i":66186,"n":"Momentary Miracle","g":142,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67602","obj":{"i":67602,"n":"Magic Marks the Spot","g":142,"l":"Mor Dhona","s":530,"f":1}}]}