{"quest":{"name":"What Death Can Join Together","location":"Mor Dhona","id":67605,"patch":3.0,"sort":600,"icon":100457,"unlocksFunction":1,"eventIcon":71341,"issuer":1012558,"target":1012558,"involved":[1002299,1006725,1012559,1013676,1013677,1013678],"genre":142,"usedItems":[10651],"journal":["Wiltwaek has a look of victory to him.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Alchemist III</span>.</span>","It seems your suspect has provided the name of the mastermind: Waoud, an alchemist from the Near East. Chanene has gone to ascertain more about these so-called clones from the Sons of Saint Coinach. Venture to their headquarters at Saint Coinach's Find to find out what she has learned.","Chanene has learned much about the clones from Rammbroes. They are empty vessels, without souls, and from this Chanene hypothesizes that Waoud means to transfer his own spirit into younger copies of himself, and gain eternal life in the process. She breathlessly tells you that Waoud has established a new base to the southeast of Revenant's Toll. Meet her there to capture this criminal mastermind.","You capture Waoud without a struggle. Wiltwaek finds this perplexing, and asks you await him at your usual spot in Revenant's Toll so he may question the suspect.","You find Wiltwaek frustrated. It seems that Waoud is now denying that he is Waoud, and that he is an alchemist. Given that the evidence against him is circumstantial, Wiltwaek bids you take the one thing found on your suspect─a copy of <span class=\"emphasis\">Noble Gold</span>─to Guildmaster Severian, and ask him for proof that Waoud is your master criminal.","Severian gives you two important pieces of information. Firstly, only the very best of alchemists can create a copy of <span class=\"emphasis\">Noble Gold</span>. Secondly, each alchemist's aether has a unique color to it, which is transferred to any grimoires created through the enchanted ink inscribed within. While normally invisible to the naked eye, the guildmaster has invented a powder to render it visible─spectrolium. With this, you can prove that Waoud created the copy of <span class=\"emphasis\">Noble Gold</span>, and that he is a master alchemist. Return now to Wiltwaek with the good news.","You hand the spectrolium to a grateful Wiltwaek and explain its purpose. Now, your friend informs you, all that is left to do is to create another high-quality copy of <span class=\"emphasis\">Noble Gold</span> to prove that Severian's concoction is sound. Craft one now to use at Waoud's trial.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Alchemist III</span>.</span>","You watch as Wiltwaek painstakingly crafts his argument from each and every piece of evidence you obtained. With Chanene's help, he also effectively demonstrates that Waoud is indeed a master alchemist, and therefore the architect of these foul murders. However, even when accused point blank, Waoud is strangely silent. You look across the floor, and see the Near Eastern youth─whose eyes suddenly stare back at you. The clone makes a bolt for the door, and Chanene realizes that Waoud must have already transferred his soul into this once-empty vessel. Though Wiltwaek is slow on the uptake, he nevertheless charges and subdues the new Waoud. Speak with him now to wrap up this case once and for all.","Wiltwaek and Chanene both thank you for your aid as a consulting alchemist, and hope that you will have happier reason to work together in the future.<br><br>※The next alchemist quest will be available from Severian once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Chanene at Saint Coinach's Find.","Rendezvous with Chanene to the southeast of Revenant's Toll.","Speak with Wiltwaek.","Speak with Severian at the Alchemists' Guild.","Deliver the onze of spectrolium to Wiltwaek.","<span class=\"alternative-container\"><span class=\"alternative\">Create a copy of <span class=\"emphasis\">Noble Gold</span> <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the copy of <span class=\"emphasis\">Noble Gold</span> <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Wiltwaek</span></span>.","Speak with Wiltwaek."],"dialogue":[{"name":"WILTWAEK","text":"We questioned our culprit further, <span class=\"highlight\">Forename</span>. He told us <span class=\"emphasis\">everything</span> once safely ensconced in his cell!"},{"name":"WILTWAEK","text":"We had believed our suspects were a crew of criminals. However, they are merely hired help, cheap and disposable. All but one─a single aging alchemist. This is our true mastermind."},{"name":"WILTWAEK","text":"Waoud is his name. He is feared in Thavnair, his homeland, for a complete lack of scruples and pursuing experiments no man should."},{"name":"WILTWAEK","text":"I've also inquired into these clones. The Sons of Saint Coinach know something of the technology. Chanene has gone to their camp to learn more. Would you join her there?"},{"name":"WILTWAEK","text":"I'm anxious to learn what Chanene discovers in Saint Coinach's Find."},{"name":"RAMMBROES","text":"A friend of Chanene's, I take it? Well, I will tell you what I told her. The word “clone” does appear in the annals of Allag. From context, I believe it refers to created life."},{"name":"RAMMBROES","text":"Ah, <span class=\"highlight\">Forename</span>. Chanene has asked about clones, but I can tell her no more than you─that they were copies of people, given life through Allagan technology."},{"name":"RAMMBROES","text":"Few men know the word. That a researcher, an <span class=\"emphasis\">alchemist</span> no less, would try to recreate this art of Allag is as astounding as it is terrifying. The Sons will be vigilant."},{"name":"CHANENE","text":"I've just spoken with Master Rammbroes. In his research into Allag's lost arts, he has come across the term “clones.”"},{"name":"CHANENE","text":"Rammbroes has told me all about your escapades in the Crystal Tower, <span class=\"highlight\">Forename</span>. Why didn't you say you'd met honest-to-gods clones?"},{"name":"CHANENE","text":"Well, according to him, clones are empty vessels for the most part─soulless and unthinking. So what if Waoud transferred his own spirit <span class=\"emphasis\">into</span> a clone, again and again? Eternal life could be his!"},{"name":"CHANENE","text":"That's his motive! It explains everything. He stole the relics to dissect Allag's technology, and he stole the people from their beds to test it!"},{"name":"CHANENE","text":"The mute Hyur we found is one such copy. His original must not have survived the process that created the clone─hence the body in the barrel!"},{"name":"CHANENE","text":"I'll bet the Near Eastern youth is a copy, as well. Of whom, though?"},{"name":"CHANENE","text":"We can sort that out later. I believe Waoud has a new hideout to the southeast of Revenant's Toll. Join me there, and we'll put a stop to this once and for all!"},{"name":"WILTWAEK","text":"Chanene's sent word that Waoud's at his hideout! Quickly, to the south!"},{"name":"WILTWAEK","text":"Hah! We've trapped the bastard!"},{"name":"CHANENE","text":"Ready?"},{"name":"WILTWAEK","text":"In we go!"},{"name":"CHANENE","text":"We got him! Hah! The case is closed!"},{"name":"WAOUD","text":"But is it, my dear? Is it really?"},{"name":"WILTWAEK","text":"This is too convenient for my taste. He'd known we were chasing him since Saint Coinach's Find. He'll swing for his crimes, most like─why come quietly?"},{"name":"WILTWAEK","text":"He must have a card he's not yet played... I'll interrogate him and find out what. Come, let us return to our usual spot."},{"name":"WILTWAEK","text":"Well, Waoud is now insisting he is <span class=\"emphasis\">not</span> Waoud! Would that I could just beat the truth out of him...but I've got to prove his guilt, or he walks free."},{"name":"WILTWAEK","text":"The question is how. We have the means to prove a master alchemist was behind this. But on that basis alone, I could implicate Jalzahn, Severian...or <span class=\"emphasis\">you</span>!"},{"name":"WILTWAEK","text":"I jest, of course! No, to convict him we must prove Waoud is Waoud, and your equal as an alchemist. Could you look into that, with your guildmaster's aid?"},{"name":"WILTWAEK","text":"Waoud had this copy of <span class=\"emphasis\">Noble Gold</span> on him. Severian will want to examine it, I suspect. I just hope it proves to be the evidence we need."},{"name":"WILTWAEK","text":"I wonder what Waoud meant to do with his copy of <span class=\"emphasis\">Noble Gold</span>?"},{"name":"WILTWAEK","text":"Perhaps Severian will know that as well."},{"name":"SEVERIAN","text":"The mastermind is an alchemist called Waoud? The name sounds familiar. And now you need a means to prove his guilt..."},{"name":"SEVERIAN","text":"That seems an awfully mundane use of my skills. Ah, but it might be the perfect opportunity to test my latest creation!"},{"name":"SEVERIAN","text":"He had a copy of <span class=\"emphasis\">Noble Gold</span> on him, yes? Very few have the skill to craft such a tome. Waoud himself may have fashioned this one. Prove he did, and you demonstrate that he is a master alchemist."},{"name":"SEVERIAN","text":"Now, each alchemist's aether has a unique color. When drawing geometries with enchanted ink, this hue is passed to the pages of a grimoire."},{"name":"SEVERIAN","text":"There has never been a way to detect the shade of this aetherial signature. Until now, that is."},{"name":"SEVERIAN","text":"I have a powder that renders this color visible to the naked eye. If my aether is purple, then sprinkling the dust over a grimoire I made will reveal the same shade of purple."},{"name":"SEVERIAN","text":"I call it spectrolium, and I daresay this invention of mine will be sufficient to prove who crafted that copy of <span class=\"emphasis\">Noble Gold</span>. Here is an onze. Take it to Wiltwaek."},{"name":"SEVERIAN","text":"Spectrolium... Yet another wonder sprung from my genius. I daresay Wiltwaek will agree."},{"name":"WILTWAEK","text":"A powder that reveals the color of aether? Heh... Severian is something else, no matter his quirks. May I have a look?"},{"name":"WILTWAEK","text":"Marvelous! But we'll need more than the dust. We must have a copy of <span class=\"emphasis\">Noble Gold</span> crafted by another's hand to show the color of Waoud's version is unique."},{"name":"WILTWAEK","text":"No doubt you see where I'm going with this. For the sake of the trial, could you create a copy of the grimoire?"},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Alchemist III</span>."},{"name":"WILTWAEK","text":"Preparations for the trial are underway, <span class=\"highlight\">Forename</span>. The Adventurers' Guild has sent impartial judges to review the facts."},{"name":"WILTWAEK","text":"The evidence has been organized, and guards are standing ready to take Waoud from his cell to the Seventh Heaven. All we need to begin is your copy of <span class=\"emphasis\">Noble Gold</span>."},{"name":"GUILDSREPRESENTATIVE","text":"The court recognizes Master Wiltwaek."},{"name":"WILTWAEK","text":"In conclusion, Waoud kidnapped honest people and experimented on them. And why? To prolong his own life! Proof of this lies with these clones, soulless puppets he <span class=\"emphasis\">created</span>. This man is guilty beyond all doubt!"},{"name":"GUILDSREPRESENTATIVE","text":"Damning evidence, Master Wiltwaek, but only if the accused is Waoud and an alchemist. He currently denies both."},{"name":"CHANENE","text":"Sir, we can prove that he's lying."},{"name":"CHANENE","text":"This grimoire was found on Waoud. And the master of the Alchemists' Guild has stated that only the most <span class=\"emphasis\">skilled</span> of alchemists could create such a tome."},{"name":"SLAFBORN","text":"Ah, I see. By showing that Waoud crafted this grimoire, you also demonstrate that he is a master of alchemy, yes?"},{"name":"WILTWAEK","text":"Precisely. The creator's aetherial signature is mirrored in the ink used to draw arcane geometries. This hue is unique to each alchemist."},{"name":"WILTWAEK","text":"We've obtained a powder from the Alchemists' Guild that will allow us to see this color. May we have your permission to use it?"},{"name":"GUILDSREPRESENTATIVE","text":"By all means, proceed."},{"name":"CHANENE","text":"This is <span class=\"highlight\">Forename</span>, a leading and recognized alchemist. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has consulted throughout this case. Excuse me..."},{"name":"CHANENE","text":"There! As you can see, the color of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> aether is blue."},{"name":"CHANENE","text":"Now, allow me to demonstrate on the grimoire that <span class=\"highlight\">Forename</span> made."},{"name":"GUILDSREPRESENTATIVE","text":"The selfsame blue! So you <span class=\"emphasis\">can</span> identify a grimoire's maker."},{"name":"CHANENE","text":"Next, I'll perform the same experiment on Waoud."},{"name":"SLAFBORN","text":"Crimson... Now, what of the grimoire you found on him?"},{"name":"GUILDSREPRESENTATIVE","text":"Crimson! That clinches it─you, sir, are Waoud! What say you in your defense?"},{"name":"WILTWAEK","text":"He's been silent as the grave all this time─as if the spirit's gone right out of him..."},{"name":"CHANENE","text":"<span class=\"emphasis\">That's</span> the real Waoud! After him!"},{"name":"WILTWAEK","text":"Wh-What!?"},{"name":"CHANENE","text":"Waoud's soul is inside that clone!"},{"name":"WILTWAEK","text":"Well, <span class=\"highlight\">Forename</span>, we're sitting pretty thanks to you!"},{"name":"CHANENE","text":"Whew... That was too exciting for my blood. But at least the case is over!"},{"name":"WILTWAEK","text":"The Near Eastern youth was Waoud's clone! Who would've thought it?"},{"name":"CHANENE","text":"How could we have missed that? He meant to gain eternal life by transferring his soul to a new vessel─the younger the body, the longer he could use it."},{"name":"WILTWAEK","text":"Very true. I've a suspicion that Waoud allowed us to apprehend his copy─a guaranteed escape route, if ever he were captured."},{"name":"WILTWAEK","text":"Rest assured, he will pay for his crimes. He meant to live on borrowed time, and we will make him suffer for all of it!"},{"name":"WILTWAEK","text":"But justice was served! We couldn't have done it without you, <span class=\"highlight\">Forename</span>. I hope we meet again─though I'd be pleased to give another grisly murder a miss!"},{"name":"CHANENE","text":"But the thrill of solving it <span class=\"emphasis\">was</span> something, eh? Let's hope we meet next under happier circumstances. Until then, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"This concludes the alchemist quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next alchemist quest will be available from Severian."}],"reward":{"gil":1563,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":15}],"quests":[67604]},"next":[67972]},"partials":[{"type":"npc","id":"1012558","obj":{"i":1012558,"n":"Wiltwaek","l":67,"q":6}},{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1012559","obj":{"i":1012559,"n":"Chanene","l":67,"q":5}},{"type":"npc","id":"1013676","obj":{"i":1013676,"n":"Chanene","l":67,"q":1}},{"type":"npc","id":"1013677","obj":{"i":1013677,"n":"Chanene","l":67,"q":1}},{"type":"npc","id":"1013678","obj":{"i":1013678,"n":"Wiltwaek","l":67,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"10651","obj":{"i":10651,"n":"Noble Gold","l":150,"c":33529,"t":10,"p":31838}},{"type":"quest","id":"67604","obj":{"i":67604,"n":"Burden of Proof","g":142,"l":"Mor Dhona","s":580,"f":1}},{"type":"quest","id":"67972","obj":{"i":67972,"n":"Not Quite Dead Yet","g":142,"l":"Ul'dah","s":601,"f":1}}]}