{"quest":{"name":"A Masterclass","location":"Ul'dah","id":67609,"patch":3.0,"sort":580,"icon":100458,"unlocksFunction":1,"eventIcon":71341,"issuer":1012528,"target":1012528,"involved":[1004093,1012534,1012536],"genre":139,"usedItems":[12644],"journal":["Marcel has a message for you regarding your latest commission.","Marcel informs you that Mistress Serendipity has taken a great interest in your project, and has arranged for you to meet with a renowned artisan known for creating musical instruments of peerless appearance and unparalleled clarity of sound. Return to the Goldsmiths' Guild, where the visitor awaits, and speak with the guildmaster.","The traveler Serendipity would introduce you to is none other than her own master, the legendary goldsmith Colbernoux. At the guildmaster's behest, he has agreed to share with you his wisdom regarding the music boxes you have been commissioned to create. Speak with the master and soak in the knowledge he would bequeath to you.","Speaking to Master Colbernoux, you learn that the material─hardsilver─from which you intend to fashion the teeth of your music box is the same that he used to create his greatest masterpiece so many years ago. He shares with you the knowledge that peerless clarity of sound can be achieved by pairing the hardsilver with an aurum regis cylinder─an item that, coincidentally, Serendipity requires for the upkeep of her favorite mammet. Kill two birds with one stone by fashioning a cylinder for practice and delivering it to the guildmaster.","The aurum regis cylinder you fashioned was of such impeccable quality that it has the ever-irascible Gigi singing a new tune. Looking on in amusement, Master Colbernoux judges you more than worthy of carrying on the legacy of his forebears and crafting music boxes worthy of his muse. Report back to Marcel and tell him that your preparations are complete.","Marcel is overjoyed to hear of all that has transpired, if somewhat jealous that he missed out on meeting Master Colbernoux. With this, your preparations are all but complete, and all that remains is to continue to hone your skills as your clients' anniversary day draws near.<br><br>※The next goldsmith quest will be available from Marcel upon reaching level 60."],"objectives":["Speak with Serendipity at the Goldsmiths' Guild.","Speak with Colbernoux.","<span class=\"alternative-container\"><span class=\"alternative\">Craft an aurum regis cylinder</span><span class=\"alternative\">Deliver the aurum regis cylinder to Serendipity</span></span>.","Report to Marcel at Eshtaime's Aesthetics."],"dialogue":[{"name":"MARCEL","text":"Ah, there you are, <span class=\"highlight\">Surname</span>. I would share with you some most welcome tidings. Mistress Serendipity has taken a keen interest in our project─so much so that she has offered the guild's full support to see that your work is realized to the utmost of its potential."},{"name":"MARCEL","text":"To that end, there is someone she would introduce to you─a craftsman known the realm over for his expertise in the crafting of musical instruments. As she tells it, the man is considered a virtuoso in his field, and is eager to lend you his wisdom. He awaits you at the Goldsmiths' Guild as we speak."},{"name":"MARCEL","text":"Mistress Serendipity has arranged for a meeting that will avail you considerably in the crafting of your twin music boxes. I encourage you to seek her out at the guild and learn what you can."},{"name":"COLBERNOUX","text":"Many a year has passed since I set foot in this workshop─and yet somehow it feels as if I never left..."},{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! I was wondering when you'd show up. As you've doubtless heard from Marcel, we have a very special guest here today. Why, none other than my master, the incomparable Colbernoux! That's him standing just over there. Doesn't he just exude an aura of consummate skill and mastery?"},{"name":"SERENDIPITY","text":"Why, jewelry wrought by his hand has captured the hearts of the highest of Ul'dahn high society since years before you or I even picked up a hammer!"},{"name":"SERENDIPITY","text":"These days, he wanders the realm, devoting his efforts to the crafting of musical devices─orchestrions, music boxes, and the like. The music box he created for and dedicated to the Songstress of Ul'dah is considered his greatest masterpiece, and one of the greatest goldsmithing accomplishments of our era."},{"name":"SERENDIPITY","text":"But why are you standing here listening to me when you could be picking the brain of a true artist regarding your commission? Go on, don't be shy!"},{"name":"SERENDIPITY","text":"Why are you standing here talking to me when you could be picking the brain of a true artist regarding your commission? Go on, don't be shy!"},{"name":"COLBERNOUX","text":"Ah, you must be the one of whom Sera spoke. I am Colbernoux. I hear you are working on a music box, and a rather ambitious one at that. Tell me this─what material do you intend to use for the teeth?"},{"name":"COLBERNOUX","text":"Hardsilver...an intriguing choice. Years ago, when I sought to create a music box worthy of the voice of my muse, I arrived at the selfsame material."},{"name":"COLBERNOUX","text":"In my experience, the greatest clarity of sound can be achieved by pairing hardsilver teeth with an aurum regis cylinder."},{"name":"COLBERNOUX","text":"Mind you, this is easier said than done─crafting this cylinder demands precision and accuracy that will test even the most accomplished goldsmith. I suggest you try your hand at fashioning one ahead of time."},{"name":"COLBERNOUX","text":"Worry not, for the product of your efforts will not go to waste. It just so happens that these cylinders are also quite useful in the upkeep of mammets. Why, I just overheard Sera mentioning that she could use one. When you are finished, why not pass it along to her?"},{"name":"COLBERNOUX","text":"Have you managed to fashion an aurum regis cylinder? Why, I just overheard Sera mentioning that she could use one for Gigi. When you are finished, why not pass it along to her?"},{"name":"SERENDIPITY","text":"Master Colbernoux says you have an aurum regis cylinder for me? Oh, <span class=\"highlight\">Forename</span>─you really didn't have to!"},{"name":"SERENDIPITY","text":"...And that does it! A new cylinder, just as promised! How are you feeling, Gigi?"},{"name":"GIGI","text":"NE※GIGIGI★※...GIGIGIGIGIGI★※!!!...<br>GeT yOuR gRuBbY hAnDs─GiGi? WhAt Is ThIs FeElInG!? tHe EnErGy CoUrSiNg ThRoUgH mY lImBs! I aM rEbOrN! yOu ArE bRiLlIaNt! YeS, bRiLlIaNt, AlL oF yOu!"},{"name":"SERENDIPITY","text":"Good heavens...whatever is the matter with poor Gigi? Perhaps the new cylinder doesn't quite agree with him..."},{"name":"COLBERNOUX","text":"Worry not, Sera. Once the cylinder's broken in, he'll be back to the Gigi we know and love...to hate."},{"name":"COLBERNOUX","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal.” These were the words of one I greatly admired─an ideal that I ever aspired to, and one that would guide every stroke of my hammer."},{"name":"SERENDIPITY","text":"Guided by these words, a great goldsmith forged a ring that would seal a bond of eternity between two soulmates. Yet another birthed the hearts that would give life to many a mammet."},{"name":"COLBERNOUX","text":"As for me, the selfsame words guided my hand, allowing me to give form to the ethereal melodies of the Songstress, and the emotions deep in my heart..."},{"name":"COLBERNOUX","text":"In you, friend, I feel the sensitivity to aspire to the same ideal, and the skill to achieve it. Promise me that you will spare no effort in creating a piece worthy of two who were brought together by the music of my muse."},{"name":"SERENDIPITY","text":"Master Colbernoux made me promise to keep quiet about his return─he's not the type to want to make a great commotion, you know. I do feel bad about not telling Marcel, though. Would you be kind enough to relay the news?"},{"name":"COLBERNOUX","text":"In you, friend, I feel the sensitivity to aspire to the same ideal, and the skill to achieve it. Promise me that you will spare no effort in creating a piece worthy of two who were brought together by the music of my muse."},{"name":"GIGI","text":"NE※GIGIGI★※...<br>WhAtEvEr I sAiD bEfOrE, i aSsUrE yOu I dIdN't MeAn A wOrD... nOw BuGgEr OfF."},{"name":"MARCEL","text":"<span class=\"highlight\">Surname</span>! Could it be true? The artisan Mistress Serendipity introduced to you was none other than Master Colbernoux himself? Why, what I would not have given to be there with you!"},{"name":"MARCEL","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal”─these words have guided Eshtaime's goldsmiths through the years as they gave birth to work after work of surpassing artistry."},{"name":"MARCEL","text":"If you have truly received Master Colbernoux's blessing, then I have no doubt that you and your music box will stand proudly among them. I will be awaiting the finished product with the greatest of interest."},{"name":"MARCEL","text":"And with that, it would seem that our preparations are complete. Neglect not your training, <span class=\"highlight\">Surname</span>. Our clients' special day draws nigh, and your skills are soon to be put to their greatest test."}],"reward":{"gil":570,"items":[{"num":240,"id":10},{"id":11885},{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":12}],"quests":[67608]},"next":[67610]},"partials":[{"type":"npc","id":"1012528","obj":{"i":1012528,"n":"Marcel","l":41,"q":9}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1012534","obj":{"i":1012534,"n":"Gigi","l":41,"q":2}},{"type":"npc","id":"1012536","obj":{"i":1012536,"n":"Colbernoux","l":41,"q":1}},{"type":"item","id":"11885","obj":{"i":11885,"n":"Hardsilver Lapidary Hammer","l":120,"c":35315,"t":18,"p":17867}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12644","obj":{"i":12644,"n":"Aurum Regis Cylinder","l":148,"c":26108,"t":56}},{"type":"quest","id":"67608","obj":{"i":67608,"n":"Double Trouble","g":139,"l":"Ul'dah","s":550,"f":1}},{"type":"quest","id":"67610","obj":{"i":67610,"n":"Two Hearts Beat as One","g":139,"l":"Ul'dah","s":600,"f":1}}]}