{"quest":{"name":"Magic Marks the Spot","location":"Mor Dhona","id":67602,"patch":3.0,"sort":530,"icon":100457,"unlocksFunction":1,"eventIcon":71341,"issuer":1012558,"target":1012560,"involved":[1000972,1012559,1012561,1012562],"genre":142,"usedItems":[12601],"journal":["Wiltwaek's eyes say that something new is afoot.","According to Wiltwaek, the thieves have struck again, this time taking a number of Allagan artifacts from Saint Coinach's Find. During his escape, one of the robbers dropped a curious document: a map of Mor Dhona, covered in strange symbols. Wiltwaek thinks these are a code of some kind the gang uses to communicate. Understanding what they mean is crucial to the investigation, and so he bids you present the enciphered map to the realm's foremost expert on ciphers: Baderon, owner of the Drowning Wench in Limsa Lominsa.","After casting an eye over the enciphered map, Baderon announces that it is not, in fact, enciphered at all. The symbols have no meaning, but serve to distract from the actual message on the paper. This is likely written in an invisible ink of some sort, the barkeep says. Return with this surprising interpretation to Wiltwaek in Revenant's Toll.","Wiltwaek is impressed by Baderon's keen deduction, and asks Chanene to report that they too have learned something about the map. The paper is of no interest, but the symbols are penned in enchanted ink. After asking your expert opinion and learning that enchanted ink is used for arcanima, Chanene attempts to activate the arcane geometry. However, all she does is sense a strange stoppage on the map's face. Wiltwaek realizes this is precisely the point of the map─to direct the criminals to their target. Quick on her feet, Chanene proposes that you three create fake maps to lure the culprits out into the open. Wiltwaek agrees, and asks that you concoct three bottles of high-quality enchanted mythrite ink for the forgeries.","Wiltwaek gratefully accepts the enchanted mythrite ink, and says he will set Chanene to work on the maps forthwith. He plans to draw the crooks to Saint Coinach's Find, where they will be easily visible amongst the researchers. Join him there, for you never know when an alchemist will come in handy.","You find Wiltwaek and Chanene with a suspect already in custody─a young man who appears to have come from the Near East. However, upon closer inspection, Wiltwaek realizes his silence is not stubbornness, but rather forced. He suspects some foul potion or another is at play, and wonders aloud if the Near Eastern youth is a victim and not a criminal. As Chanene turns to leave, she suddenly notices a strange man watching you from the shadows. Wiltwaek calls to him, but the fellow simply wanders away. Perplexed, Wiltwaek says that the criminals are toying with dangerous powers, and asks that you lend your aid again when the need arises.<br><br>※The next alchemist quest will be available from Wiltwaek upon reaching level 55."],"objectives":["Deliver the enciphered map to Baderon in Limsa Lominsa.","Return the enciphered map to Wiltwaek.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize enchanted mythrite ink <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the bottles of enchanted mythrite ink <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Wiltwaek</span></span>.","Rendezvous with Wiltwaek at Saint Coinach's Find."],"dialogue":[{"name":"WILTWAEK","text":"<span class=\"highlight\">Forename</span>! Good, I've a job for you. Saint Coinach's Find was robbed not a few bells past. The thieves took several Allagan artifacts, many recently excavated."},{"name":"WILTWAEK","text":"A guard said one dropped this map of Mor Dhona during his escape. But it's covered in odd symbols. A coded message, perhaps, or a cipher. We must learn its secrets."},{"name":"WILTWAEK","text":"The owner of the Drowning Wench in Limsa can help. <span class=\"alternative-container\"><span class=\"alternative\">You've met Baderon, yes</span><span class=\"alternative\">Have you heard of Baderon</span></span>?"},{"name":"WILTWAEK","text":"He's the realm's foremost expert on ciphers...which is ironic if you know him. But I do believe he'll be able to read the symbols, and he'll need an alchemist to untangle their meaning. Godsspeed, my friend."},{"name":"WILTWAEK","text":"Time may be a factor, <span class=\"highlight\">Forename</span>─I wouldn't dally long before taking the enciphered map to Baderon."},{"name":"BADERON","text":"Greetin's to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Ye've got a dark look to ye, but a pint o' the Wench's finest'll cure that! Or...is there somethin' else ye want?"},{"name":"BADERON","text":"There's crooks usin' a cipher, an' ye think alchemy's involved? Well, alchemists've always kept their secrets secret with codes an' such. But I'm certain this ain't one. Just a bleedin' load o' gibberish."},{"name":"BADERON","text":"Now, I'd go for the double-bluff meself. Pen the <span class=\"emphasis\">real</span> message in invisible ink or summat, an' write a fake cipher on top. That way, ye fool them what don't know the code, an' throw them what <span class=\"emphasis\">do</span> off yer track."},{"name":"BADERON","text":"Just me 'umble opinion, 'course. An' I can't tell you what it does say. But mind ye pass every word of it on to whoever sent ye, eh?"},{"name":"BADERON","text":"I've been thinkin' on yer ciphered map, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Whoever came up with the idea o' usin' invisible ink's right clever. Watch yerself, eh?"},{"name":"CHANENE","text":"Have you learned the map's secrets yet, <span class=\"highlight\">Forename</span>?"},{"name":"WILTWAEK","text":"Did Baderon have any insight into the cipher?"},{"name":"WILTWAEK","text":"A fake to distract us from the real message in invisible ink, eh? Genius! Well, rest assured we haven't been idle either. Chanene?"},{"name":"CHANENE","text":"I had a piece of the map analyzed. The paper is unremarkable, but I'm told the symbols were written in “enchanted ink.” <span class=\"highlight\">Forename</span>, what is that?"},{"name":"Q1","text":"What is enchanted ink?"},{"name":"A1","text":"Ink for penning grimoires."},{"name":"A1","text":"A superior aetherial conductor."},{"name":"CHANENE","text":"Ah, you mean for tracing geometries? And would I be correct in thinking that the more conducive to aether said ink is, the greater the magic it can channel?"},{"name":"CHANENE","text":"Ah, so the mythrite increases aetherial conductivity? And I assume arcanima relies upon this ink to channel magicks, yes?"},{"name":"CHANENE","text":"In theory, these symbols <span class=\"emphasis\">are</span> an arcane geometry. So if I channel magic into the map, then something ought to happen."},{"name":"CHANENE","text":"Nothing. I felt the magic flowing, but it just stopped─like it hit a wall. Around the crime scene, if I had to pinpoint it."},{"name":"WILTWAEK","text":"I've got it! That stoppage <span class=\"emphasis\">is</span> the criminal's target! The map gives directions where to go when magic is channeled into it!"},{"name":"CHANENE","text":"Brilliant! And...and if they rely on these maps for directions, we could bring them directly to us with a fake map...right?"},{"name":"WILTWAEK","text":"Perhaps we could! I found a fragment of a similar map near the road a while ago. If that is where the criminals drop off their orders..."},{"name":"CHANENE","text":"Then we know where to leave the forgeries! If our fakes pass muster, we could send them anywhere─even to a gaol if we wanted!"},{"name":"WILTWAEK","text":"Chanene, you're good with a pen, so I'll entrust the maps to you. <span class=\"highlight\">Forename</span>, could you concoct enchanted mythrite ink? With three bottles of your finest, we'll see if we can't catch the bastards!"},{"name":"WILTWAEK","text":"I know I asked for enchanted mythrite ink, but I've since been informed it's a tricky recipe. Are you up to the task?"},{"name":"WILTWAEK","text":"I see why Severian thinks so highly of you! We'll be able to lure our criminals out into the open with this ink and a little luck."},{"name":"WILTWAEK","text":"Now, Chanene and I have chosen Saint Coinach's Find. It'll be damned difficult to miss our suspect there. Come with us, <span class=\"highlight\">Forename</span>─it's safer to have an alchemist on hand than not."},{"name":"WILTWAEK","text":"This is a good ruse, but I wonder if it will actually draw our criminals to Saint Coinach's Find."},{"name":"CHANENE","text":"Well, this is the rat caught in our trap. But he's a bit...off."},{"name":"NEAREASTMAN02066","text":"..."},{"name":"WILTWAEK","text":"Behold, our culprit─captured not five minutes past <span class=\"emphasis\">with</span> the false map on his person!"},{"name":"CHANENE","text":"But it's strange. He's not said a living word, not even in his own defense. Come on, lad, speak up! ...Can't you hear me?"},{"name":"NEAREASTMAN02066","text":"..."},{"name":"WILTWAEK","text":"Just our luck─he's in a stupor. Struck dumb by something. Or...or <span class=\"emphasis\">silenced</span> somehow."},{"name":"CHANENE","text":"Wiltwaek, are you suggesting we've got it wrong? That this boy is in fact a victim, robbed of his mind by a...a spell or a potion or something?"},{"name":"WILTWAEK","text":"That is my suspicion, yes, though it's purely conjecture without his identity. Just by looking at him, I'd say he's from the Near East."},{"name":"CHANENE","text":"As in the birthplace of alchemy? That can't be a coincidence. Now─ Hello, who's that fellow?"},{"name":"WILTWAEK","text":"Hey! You! Excuse me!"},{"name":"CHANENE","text":"How rude! Judging by his garb, he was Near Eastern as well. But why ignore us?"},{"name":"WILTWAEK","text":"Yet another mystery. But at least we've got a lead─this lad is at the center of this, be he culprit or victim. The Adventurers' Guild can keep him in protective custody."},{"name":"WILTWAEK","text":"Whatever put him in this state is dangerous, and those who wield this power doubly so. I've little doubt we'll need your expertise again soon, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":1514,"items":[{"num":160,"id":13},{"id":11939},{"id":11961,"one":1},{"id":11966,"one":1},{"id":11974,"one":1},{"id":11979,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":15}],"quests":[67601]},"next":[67603]},"partials":[{"type":"npc","id":"1012558","obj":{"i":1012558,"n":"Wiltwaek","l":67,"q":6}},{"type":"npc","id":"1012560","obj":{"i":1012560,"n":"Wiltwaek","l":67,"q":1}},{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1012559","obj":{"i":1012559,"n":"Chanene","l":67,"q":5}},{"type":"npc","id":"1012561","obj":{"i":1012561,"n":"Chanene","l":67,"q":1}},{"type":"npc","id":"1012562","obj":{"i":1012562,"n":"Near Eastern Youth","l":67,"q":1}},{"type":"item","id":"11939","obj":{"i":11939,"n":"Mythrite Mortar","l":90,"c":35657,"t":25}},{"type":"item","id":"11961","obj":{"i":11961,"n":"Holy Rainbow Coatee","l":80,"c":42469,"t":35,"p":9884}},{"type":"item","id":"11966","obj":{"i":11966,"n":"Holy Rainbow Gloves","l":80,"c":48264,"t":37,"p":7096}},{"type":"item","id":"11974","obj":{"i":11974,"n":"Holy Rainbow Bottoms","l":80,"c":45692,"t":36,"p":7603}},{"type":"item","id":"11979","obj":{"i":11979,"n":"Holy Rainbow Shoes","l":80,"c":46540,"t":38,"p":8110}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12601","obj":{"i":12601,"n":"Enchanted Mythrite Ink","l":120,"c":25923,"t":54,"p":3213}},{"type":"quest","id":"67601","obj":{"i":67601,"n":"Without a Trace","g":142,"l":"Ul'dah","s":502,"f":1}},{"type":"quest","id":"67603","obj":{"i":67603,"n":"From Hells","g":142,"l":"Mor Dhona","s":550,"f":1}}]}