{"quest":{"name":"Form to the Formless","location":"Ul'dah","id":67606,"patch":3.0,"sort":502,"icon":100458,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1012528,"involved":[1001353,1012534],"genre":139,"journal":["Serendipity would like to introduce you to a certain someone.","Serendipity gleefully informs you that your work has caught the eye of one Marcel, an influential agent who oversees commissions from Eshtaime's most influential clients. As the guildmaster tells it, the man has decided to recruit your services for a work of particular importance. Make for Eshtaime's Aesthetics where Marcel awaits, and see what it is he would have you create.","Marcel shares with you the details of the commission─a bonding anniversary gift from the wife of a high-ranking officer in the Immortal Flames to her beloved husband─and explains that the specific nature of the item has been left to your discretion. He recalls the words of a great goldsmith─“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal”─and suggests that you use them as a starting point in your search for inspiration. Seek out Serendipity at the Goldsmiths' Guild and Momodi at the Quicksand and see if they have any insight into the matter.","Serendipity recognizes the words as those of her erstwhile master, while Momodi muses on the true meaning of gifts and memories. Convey their words to Marcel at Eshtaime's, that the two of you together might hit upon the inspiration you seek.","No sooner do you return to Marcel than does your customer, one Jeweled Peak, pay a visit to inquire on the progress of her commission. When she mentions her and her husband's shared love for the famed Songstress of Ul'dah, Marcel hits upon the idea of crafting a music box that would play a melody and memory from their youth, thus giving form to the formless and breathing a beating heart into metal. Your goal now clear, you must determine how best to approach the task at hand.<br><br>※The next goldsmith quest will be available from Marcel upon reaching level 53."],"objectives":["Speak with Marcel at Eshtaime's Aesthetics.","Speak with Serendipity at the Goldsmiths' Guild.","Speak with Momodi at the Quicksand.","Report to Marcel at Eshtaime's Aesthetics."],"dialogue":[{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see! And I'm not saying that just to be nice. Mind you, I <span class=\"emphasis\">do</span> pride myself on being nice─you recruit more apprentices with honey than vinegar, after all! But where was I...?"},{"name":"SERENDIPITY","text":"Oh, of course! There's a certain someone I'd like to introduce to you─a special someone, at that. His name is Marcel, and he's in charge of handling commissions from some of Eshtaime's most prestigious clients. We're talking the elite of the elite here."},{"name":"SERENDIPITY","text":"Marcel's clients expect nothing less than the finest, which means that Marcel trusts only our guild's most accomplished to fill his orders. Getting the call from Marcel is a sure sign that you've made it in the goldsmithing world. But I'm sure you can see where this is going, <span class=\"highlight\">Forename</span>."},{"name":"SERENDIPITY","text":"It seems your fine work has earned you something of a reputation. With that─plus a vote of confidence from little old me─Marcel has personally requested your services for his latest commission. Why, he's waiting for you at Eshtaime's Aesthetics even as we speak! You're excited, aren't you? I know <span class=\"emphasis\">I'm</span> excited!"},{"name":"SERENDIPITY","text":"It seems your fine work has earned you something of a reputation. With that─plus a vote of confidence from little old me─Marcel of Eshtaime's has personally requested your services for his latest commission."},{"name":"SERENDIPITY","text":"Why, he's waiting for you at the shop even as we speak! You're excited, aren't you, <span class=\"highlight\">Forename</span>? I know <span class=\"emphasis\">I'm</span> excited!"},{"name":"MARCEL","text":"<span class=\"highlight\">Surname</span>, is it? I am Marcel of Eshtaime's. Charmed, I'm sure."},{"name":"MARCEL","text":"Doubtless you have already heard from Mistress Serendipity, and in far too many words. I will be brief: a most important client of mine has commissioned a work of supreme significance─and you will have the privilege of contributing to its creation."},{"name":"MARCEL","text":"Note that I say <span class=\"emphasis\">contribute</span>. I ask you not to take full responsibility, a task which would doubtless prove beyond you at this stage of your career. Yes, you need not fear, for I will be here to guide you in every step of the process. To help you grow from a mere craftsman to a creator of genius, as it were."},{"name":"MARCEL","text":"With that, let us get down to business. The order comes from the wife of a high-ranking officer of the Immortal Flames. The anniversary of their bonding draws near, and this most refined madam would gift her beloved spouse with a memento of singular beauty and meaning."},{"name":"MARCEL","text":"As the lady tells it, her husband is a hardened warrior who─despite his lofty rank─rarely leaves the front lines, where he tirelessly leads his men against the Amalj'aa. Their anniversary day will mark a brief but welcome respite from the battlefield─his first in moons."},{"name":"MARCEL","text":"As for the exact nature of the gift, she entrusts this entirely to us, as my clients are wont to do. Most believe that no mundane idea of their own could compete with the sheer genius and inspiration of Eshtaime's agents and artisans─an assumption which is true more often than not."},{"name":"MARCEL","text":"But what shall we create, hmm? At times like this, I think back to the words of my mentor, a renowned goldsmith I had the honor of working with when I first came to Eshtaime's some years ago."},{"name":"MARCEL","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal.” This is the goldsmith's true calling, the master would always say. His words have never failed to inspire me, and I trust they will do the same for you."},{"name":"MARCEL","text":"And yet rare indeed is it that inspiration comes entirely from within. In my own experience, I have found that reflecting upon these words in the company of trusted friends and colleagues oft proves enlightening."},{"name":"MARCEL","text":"Being a woman's gift, perhaps Mistress Serendipity and Miss Momodi at the Quicksand might have some insight to share. What say you consult them and return here with your impressions?"},{"name":"MARCEL","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal.” Such was the guiding principle impressed upon me by my master."},{"name":"MARCEL","text":"For the task in question, perhaps Mistress Serendipity and Miss Momodi at the Quicksand might have some insight to share. What say you consult them and return here with your impressions?"},{"name":"MOMODI","text":"If it ain't <span class=\"highlight\">Forename</span>! Wait, don't tell me─come to consult with yours truly in matters of the heart, mayhap?"},{"name":"MOMODI","text":"Work, you say? Well, that ain't half as fun, now is it? But I reckon I still might be able to help you some. Not that I'm much of an expert on gift-givin', mind you. If I were, like as not I wouldn't be standin' behind this counter alone, if you catch my meanin'."},{"name":"MOMODI","text":"Many say it's best to go straight to the source, but things ain't always so simple. Just ask one of my regulars─she asked her beau what he wanted for his nameday, and do you know what he said? “A fond memory, mayhap...” A <span class=\"emphasis\">memory</span>! They don't sell those at Eshtaime's, last I checked."},{"name":"MOMODI","text":"Which isn't to say that I don't understand what he was gettin' at. In the end, it's not the gift itself that matters, but the feelin's behind it. Hardened warrior or no, when he returns from the battlefield to see his beloved waitin' for him with open arms, he'll be moved by anythin' she has to offer."},{"name":"MOMODI","text":"That said, when a gift's got too much emotion wrapped up in it, it can be quite a burden for the recipient to bear. Take my old hairpin, which sat sealed away out of sight until I worked up the courage to face my true feelin's."},{"name":"MOMODI","text":"But this customer of yours and her husband are gettin' on in their years, no? Strikes me the ideal gift would be one that serves to reaffirm the bond they already share."},{"name":"MOMODI","text":"A keepsake of sorts that would call to mind the day when the Spinner first brought them together. Seems to me that'd be as good a startin' point as any, wouldn't you say?"},{"name":"MOMODI","text":"This customer of yours and her husband are gettin' on in their years, no? Strikes me the ideal gift would be one that serves to reaffirm the bond they already share."},{"name":"MOMODI","text":"A keepsake of sorts that would call to mind the day when the Spinner first brought them together. Seems to me that'd be as good a startin' point as any, wouldn't you say?"},{"name":"GIGI","text":"NE※GIGIGI★※...<br>GaRbAgE! i HaVe SeEn GoObBuEs WiTh BeTtEr AeStHeTiC sEnSiBiLiTiEs ThAn YoU!"},{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>! Back so soon? I trust you've met with Marcel, yes? Is he still wearing that silly monocle? He says it's to make him look more refined, that he might better impress his customers. Just between you and me, I find it oh-so-slightly pretentious, but─oh yes, do tell me about your assignment!"},{"name":"SERENDIPITY","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal”...? Why, that was the very challenge my master posed to me when I set off on my own as a goldsmith."},{"name":"SERENDIPITY","text":"It would seem his words resonated deeply with Marcel, as well. To realize that ideal in one's own work is the sign of a truly first-rate goldsmith─or so my master always said. That said, it is quite the riddle, is it not? That which is formless..."},{"name":"GIGI","text":"NE※GIGIGI★※...<br>RiDdLe, ScHmIdDlE! cOlOrS, sCeNtS, sOnGs─WhY, i CoUlD nAmE a ThOuSaNd FoRmLeSs ThInGs In ThE tImE iT wOuLd TaKe FoR yOu To GeT yOuR hAmMeR oUt Of YoUr─"},{"name":"SERENDIPITY","text":"You can stop right there, Gigi! That said, there's at least a smidgen of truth in what he says. There are all sorts of formless things that could be given form─which means that there's no single right answer."},{"name":"SERENDIPITY","text":"Form to the formless─it's up to you to find an answer to this riddle that will use your talents to the fullest and please your customer, to boot. But if anyone can do it, <span class=\"highlight\">Forename</span>, you can. Why, I can scarcely wait to see what you come up with!"},{"name":"SERENDIPITY","text":"There's some truth in what Gigi says. Why, there are all sorts of formless things that could be given form─which means that there's no single right answer."},{"name":"SERENDIPITY","text":"Form to the formless─it's up to you to find an answer to this riddle that will use your talents to the fullest and please your customer, to boot. But if anyone can do it, <span class=\"highlight\">Forename</span>, you can. Why, I can scarcely wait to see what you come up with!"},{"name":"MARCEL","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal.” ...Well, <span class=\"highlight\">Surname</span>? I trust you have given these words due thought since last we spoke."},{"name":"MARCEL","text":"So you have spoken with Mistress Serendipity and Miss Momodi? Excellent. I would have your thoughts on─ah, but that can wait. Our client honors us with her presence."},{"name":"JEWELEDPEAK","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">day</span></span>, Marcel. I had business nearby, and I thought I would pay a visit."},{"name":"MARCEL","text":"Milady! As ever, you honor us with your presence and grace us with your beauty. And you could not have picked a better time─allow me to introduce <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Surname</span>, the goldsmith who will be assisting me in the crafting of the masterpiece-to-be you have ordered!"},{"name":"MARCEL","text":"“To give form to that which is formless, and breathe a warm, beating heart into the coldest of metal”─such is the ideal we at Eshtaime's strive to achieve with our work."},{"name":"JEWELEDPEAK","text":"A color, a scent, a melody─all lacking in form, but indelibly tied to our memories. The artistic process continues to unfold as we speak, but you have my word that the finished product will be fit for one of your surpassing aesthetic sensitivities."},{"name":"JEWELEDPEAK","text":"And I am pleased indeed to hear it. But if you're trying to win my favor with those flowery words, Marcel, I fear I'm already spoken for!"},{"name":"JEWELEDPEAK","text":"But speaking of memories and melodies... My husband and I have always shared a love for the ballads of the Songstress of Ul'dah."},{"name":"MARCEL","text":"Do we all not share such a love, milady?"},{"name":"MARCEL","text":"And yet, I fear that even the most skilled goldsmith would be hard-pressed to give “form” to a piece of─but wait!"},{"name":"MARCEL","text":"I've got it! By Nald and by Thal, I've got it! A music box─a music box of gold!"},{"name":"JEWELEDPEAK","text":"How simply divine! A music box that would play a melody from our younger days! Why, I could not have dreamed up a more perfect gift in a hundred years!"},{"name":"MARCEL","text":"Your words hearten me, milady. But I must give credit where due─it is a stroke of inspiration that would not have come to me without the assistance of <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Surname</span> here."},{"name":"MARCEL","text":"Into a vessel of the purest gold we shall carve a melody that will carry you and your husband back to that precious day when the Spinner guided you to each other."},{"name":"MARCEL","text":"I fear I must ask for your patience a while longer, milady. Rest assured that we will spare no effort in creating the perfect gift for your most special of days."},{"name":"SYSTEM","text":"The next goldsmith quest will be available from Marcel upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"gil":517,"items":[{"num":120,"id":10},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":12}],"questsType":"all","quests":[66194,65964]},"next":[67607]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1012528","obj":{"i":1012528,"n":"Marcel","l":41,"q":9}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"npc","id":"1012534","obj":{"i":1012534,"n":"Gigi","l":41,"q":2}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"66194","obj":{"i":66194,"n":"Jaded","g":139,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67607","obj":{"i":67607,"n":"Elegance and Artistry","g":139,"l":"Ul'dah","s":530,"f":1}}]}