{"quest":{"name":"From Hells","location":"Mor Dhona","id":67603,"patch":3.0,"sort":550,"icon":100457,"unlocksFunction":1,"eventIcon":71341,"issuer":1012558,"target":1012558,"involved":[1001304,1002299,1012559,1012563],"genre":142,"usedItems":[12615],"journal":["Wiltwaek has an update about the case.","Wiltwaek informs you of two things. Firstly, the Near Eastern youth you captured shows no signs of recovering, and no one has any idea who he is. Secondly, one of the recently stolen Allagan artifacts has turned up at Rowena's House of Splendors. Chanene has gone ahead to investigate, and Wiltwaek bids you join her there.","Rowena is willing to aid in your investigation─for the price of high-quality grade 1 intelligence dissolvent. Concoct three bottles to loosen the merchant's tongue.","Happy with your exchange, Rowena hands you an Allagan crozier, and gives her description of its seller. Chanene believes this is a thief of local infamy, but cannot help but wonder whether such a burglar would have any knowledge of alchemy. Before she can go on, a suspicious man appears to inquire into the crozier. After he leaves, an excited Chanene tells you she means to tail him, and asks that you relay the same to Wiltwaek.","You hurry to Wiltwaek, and tell him where Chanene has gone. However, he receives word from her directly that the suspect gave her the slip. Wiltwaek decides it is better to ascertain why this odd fellow wanted to purchase the crozier than pursue him blindly. Make your way to the Alchemists' Guild in Ul'dah, and ask Guildmaster Severian why an alchemist would want an Allagan crozier.","Guildmaster Severian's usual impatience melts away once he sees what you have brought. He tells you of a legend in which Allag could grow men from nothing, and that the key component of this process was the crystal that lies at the heart of the crozier. Though he himself thinks this nonsense, he understands why certain alchemists would covet this power. Return to Wiltwaek, and tell him what you have discovered.","You return to find both Wiltwaek and Chanene subdued. The reason, you soon learn, is that they have found your suspects' lair─a dark cave used to perform terrible experiments upon living people. Thanks to your description of the crozier, Wiltwaek creates a profile of a criminal mastermind, a mad alchemist ironically willing to murder in pursuit of the power to create life. Worried, Chanene asks that you continue to lend your aid, lest more innocent townsfolk die.<br><br>※The next alchemist quest will be available from Wiltwaek upon reaching level 58."],"objectives":["Rendezvous with Chanene in Rowena's House of Splendors.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize bottles of grade 1 intelligence dissolvent <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the bottles of grade 1 intelligence dissolvent <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Rowena</span></span>.","Report to Wiltwaek.","Show the Allagan crozier to Severian at the Alchemists' Guild.","Return the Allagan crozier to Wiltwaek."],"dialogue":[{"name":"WILTWAEK","text":"Ah, <span class=\"highlight\">Forename</span>─I've got two pieces of news for you. First, the Near Eastern youth has yet to recover. In his current state, interrogating him is out of the question."},{"name":"WILTWAEK","text":"He could be one of the criminals. Or he could number among the abducted. We've got no idea, though none of our abducted people match his description."},{"name":"WILTWAEK","text":"In any case, we believe the criminals forced some potion down his throat to erase his memories. The man is now a blank slate."},{"name":"WILTWAEK","text":"Secondly, one of the artifacts stolen from Saint Coinach's Find has resurfaced at Rowena's shop, of all places. Chanene has already gone to investigate. Would you join her?"},{"name":"WILTWAEK","text":"Thank you. Fencing goods at a local shop has not been our suspects' modus operandi thus far. It seems awfully careless, to be quite frank."},{"name":"WILTWAEK","text":"Why would the criminals sell their stolen loot to <span class=\"emphasis\">Rowena</span>? Her shop is practically on top of the crime scene..."},{"name":"ROWENA","text":"What's the realm comin' to, when an honest merchant is sold stolen goods?"},{"name":"CHANENE","text":"You're caught up? Good. The item in question is Allagan...though I can't say I've gotten to examine the evidence <span class=\"emphasis\">properly</span> yet. <span class=\"emphasis\">Ahem</span>!"},{"name":"ROWENA","text":"O' <span class=\"emphasis\">course</span> I'll help with your investigation. I've got a duty, too, seein' as it was me who was sold stolen goods."},{"name":"ROWENA","text":"But the fact remains that it cost me dear, an' I'm not in the practice o' losin' money. Ain't askin' for gil, mind, but what do you say to a little <span class=\"emphasis\">quid pro quo</span>?"},{"name":"ROWENA","text":"Oh, don't give me that! I just want intelligence dissolvent. Even three bottles o' your finest won't take long, if what I've heard o' you is true. That's my price. Take it or leave it."},{"name":"CHANENE","text":"Sorry, <span class=\"highlight\">Forename</span>, but the Adventurers' Guild can't afford to annoy Rowena. You'll have to deal with this request of hers─however unreasonable it may be."},{"name":"ROWENA","text":"Have you finished brewin' or concoctin' or whatever you do to make intelligence dissolvent?"},{"name":"ROWENA","text":"Heh, you've got my thanks. Here─the stolen Allagan crozier. Bought it for nothin' off some lad. I may've come out a fair bit richer for our dealin's, so I'll describe him for you."},{"name":"CHANENE","text":"You dealt with him yourself? Tell me <span class=\"emphasis\">everything</span> you remember!"},{"name":"CHANENE","text":"The seller, he's a burglar I've heard of! Infamous in his own way 'round here. But he's no master criminal, and he hasn't got the wit to practice alchemy."},{"name":"ROWENA","text":"Could be a case o' one thief stealin' from another. See, what─ Ah. Give me a moment. Can I help you, friend?"},{"name":"WAOUD","text":"(-???-)Might you be Rowena? My dear, I understand you've acquired a crozier of Allagan design. As a collector of such antiquities, I had hoped to make you an offer."},{"name":"ROWENA","text":"Ah, I'm afraid you're too late. It just walked out the door with a happy customer."},{"name":"WAOUD","text":"(-???-)What a pity... I had the <span class=\"emphasis\">perfect</span> place for it. Well, thank you anyway."},{"name":"CHANENE","text":"Him again! I'm going after him, <span class=\"highlight\">Forename</span>. Tell Wiltwaek!"},{"name":"ROWENA","text":"Shouldn't you tell Wiltwaek about what just happened? Not that I'm about to turn you away if you've got business, o' course..."},{"name":"WILTWAEK","text":"What? She's pursuing that suspicious character on her own!?"},{"name":"WILTWAEK","text":"Hello? Chanene, are you─ You lost him? Slow down, why can't you see!? No, leave him for the moment. Just come back."},{"name":"WILTWAEK","text":"He threw some potion that clouded her vision. Not the actions of an innocent man, I think."},{"name":"WILTWAEK","text":"But there's nothing to gain by searching for him. We know he wants the crozier─let us ascertain why, and how it ended up at Rowena's shop. You have it now, yes?"},{"name":"WILTWAEK","text":"Keep it for the moment. I'm curious as to what value it has to an alchemist. Could you have Severian take a look at it?"},{"name":"WILTWAEK","text":"If Severian has never encountered something like the crozier, I'll be amazed. He is damnably well versed in the arcane."},{"name":"SEVERIAN","text":"What the─ <span class=\"highlight\">Forename</span>! Confound it all, I sent you to Wiltwaek so that I could avoid his blasted investigation! &lt;sigh&gt; Complaining won't make you go away any faster. What is it, what is it?"},{"name":"SEVERIAN","text":"...Oh. Oh my. This <span class=\"emphasis\">is</span> valuable to a particular breed of alchemist. Specifically, the crystal at its core─the nexus of its magicks."},{"name":"SEVERIAN","text":"Legend has it that Allag's technologists could <span class=\"emphasis\">create</span> men from it─grow living, breathing, thinking people. For many, no law nor life is too sacred to profane for this power."},{"name":"SEVERIAN","text":"One of your suspects is chasing this chimera, and is therefore like to be an alchemist prying Allag's secrets from the past, consequences be damned."},{"name":"SEVERIAN","text":"Mind you, understanding life's mysteries is the goal of alchemy. But turning to crime, kidnapping people in the night... Well, if it were me, I would pursue my studies less clumsily."},{"name":"SEVERIAN","text":"As I said, 'twould seem that one of the people you pursue is an alchemist with dangerous designs, seeking an Allagan myth about “growing” people."},{"name":"SEVERIAN","text":"Perhaps we could avoid these disturbances if you kept a record of what I say, hm?"},{"name":"CHANENE","text":"It's heartening to see you, <span class=\"highlight\">Forename</span>! We, uh... Well, we <span class=\"emphasis\">did</span> find something in your absence. But not something nice."},{"name":"WILTWAEK","text":"<span class=\"highlight\">Forename</span>! You look as if you've found something."},{"name":"WILTWAEK","text":"Thank you. I'm anxious to learn what Severian had to say, but there's something you need to hear first..."},{"name":"CHANENE","text":"I caught the burglar. He found the crozier by accident, in a cavern near the lake."},{"name":"CHANENE","text":"He thought it was some grave robber's forgotten stash. In fact, he found our culprits' hideout. We rushed to capture them, but..."},{"name":"WILTWAEK","text":"...The scene would not have been amiss in the hells─blood splashed from floor to roof, blades for severing and slicing, and all jagged from use. Worst was the table, the restraints tested by victims struggling to escape. &lt;sigh&gt; I fear none did, and our abducted victims are dead."},{"name":"WILTWAEK","text":"No cutpurse or thief did this. But why, <span class=\"emphasis\">why</span> would anyone experiment on living men? Did Severian say anything to shed light on this, <span class=\"highlight\">Forename</span>?"},{"name":"WILTWAEK","text":"<span class=\"emphasis\">Create</span> life? Twelve save me! That is indeed a power men would kill for."},{"name":"WILTWAEK","text":"This gives us a profile. One of our criminals is an alchemist, willing to do <span class=\"emphasis\">anything</span> to further his research. Mor Dhona offers all he needs─Allagan ruins, anonymity, and a steady stream of victims."},{"name":"CHANENE","text":"This means he's still lurking about. We must capture this mad alchemist, lest we go on to find yet more blood on a different cave wall..."}],"reward":{"gil":1362,"items":[{"num":200,"id":13},{"id":11896},{"id":11962,"one":1},{"id":11967,"one":1},{"id":11975,"one":1},{"id":11980,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":15}],"quests":[67602]},"next":[67604]},"partials":[{"type":"npc","id":"1012558","obj":{"i":1012558,"n":"Wiltwaek","l":67,"q":6}},{"type":"npc","id":"1001304","obj":{"i":1001304,"n":"Rowena","l":67,"q":25}},{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1012559","obj":{"i":1012559,"n":"Chanene","l":67,"q":5}},{"type":"npc","id":"1012563","obj":{"i":1012563,"n":"Chanene","l":67,"q":1}},{"type":"item","id":"11896","obj":{"i":11896,"n":"Hardsilver Alembic","l":100,"c":35615,"t":24,"p":13622}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11967","obj":{"i":11967,"n":"Dhalmelskin Halfgloves of Crafting","l":100,"c":44391,"t":37,"p":11088}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"11980","obj":{"i":11980,"n":"Dhalmelskin Shoes","l":100,"c":46542,"t":38,"p":12672}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12615","obj":{"i":12615,"n":"Grade 1 Intelligence Dissolvent","l":133,"c":20671,"t":54,"p":3869}},{"type":"quest","id":"67602","obj":{"i":67602,"n":"Magic Marks the Spot","g":142,"l":"Mor Dhona","s":530,"f":1}},{"type":"quest","id":"67604","obj":{"i":67604,"n":"Burden of Proof","g":142,"l":"Mor Dhona","s":580,"f":1}}]}