{"quest":{"name":"Absolution","location":"Ishgard","id":67600,"patch":3.0,"sort":600,"icon":100447,"unlocksFunction":1,"eventIcon":71341,"issuer":1013969,"target":1013969,"involved":[1013970,1015052,1015053],"genre":157,"journal":["Sid seems strangely at peace, for a change.","Countess Ystride's missive has arrived at last. You, Sidurgu, and Rielle are to meet with her in the western highlands, that you might conduct your trial by combat far from prying eyes. Before you depart, Sidurgu tells you that Rielle wishes to say a few words.","As Rielle thanks you for the time you shared together, you are struck by how much she has changed. The quiet, unassuming girl you first met has grown tremendously, shaped by her experiences on the road and the knights who have kept her safe. Sidurgu seems to see it as well, regarding her with a newfound respect. With nothing left to discuss, the knight bids you journey to Twinpools together and settle matters once and for all.","Desperate to find absolution in the death of her daughter, Countess Ystride quickly discards all pretense and commands wave after wave of Temple Knights to kill Rielle. Eventually, she attempts to carry out the deed herself, but you and Sidurgu manage to subdue her and kill her remaining knights. The dark knight stands poised to strike her down as well, but relents, reasoning that for all her crimes, she is still Rielle's mother. However, the countess declares that she will never stop hunting the girl, for it is the will of the Fury.<br><br>Perhaps, in some corner of her heart, she knew it could only end like this. Rielle steps forward and tells Ystride that she will pray for her one last time, that she might find peace in Halone's halls. Grudgingly, Sidurgu readies his sword once more, and Rielle begins to administer the last rites to her mother. As the blade meets her neck, Ystride looks to her daughter, and for a moment, the hatred which consumed her is nowhere to be seen... After a time, Rielle says simply that you will return to Ishgard. Sparing a final glance for her mother, she turns and walks away.","In the end, it would seem that Rielle would rather remain in the company of Sidurgu─provided he continues to be more honest with her. He responds to her ultimatum in typical fashion, prompting you and Rielle to share a laugh. The two intend to remain in Ishgard for a time, as there are doubtless others in need of their help. But for whom will you stand? For your friends? For Eorzea? Or perhaps, for the one within who is ever waiting to take the reins...<br><br>※The next dark knight quest will be available from Sidurgu once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Rielle.","Rendezvous with Sidurgu in Twinpools.","Speak with Sidurgu in Ishgard.","Protect Rielle!"],"dialogue":[{"name":"SIDURGU","text":"Countess Ystride's missive arrived while you were away. We're to meet her in the western highlands─away from prying eyes."},{"name":"SIDURGU","text":"She's gone to great lengths to conceal her husband's deeds, so it comes as no surprise that she'd prefer to settle this in secret."},{"name":"SIDURGU","text":"<span class=\"highlight\">Forename</span>, I...I don't know what's waiting for us out there."},{"name":"SIDURGU","text":"But if aught should happen to me...pray keep Rielle safe."},{"name":"SIDURGU","text":"Right, then. I believe she wanted a word with you before we left."},{"name":"SIDURGU","text":"Rielle wanted to speak with you before we set out for the western highlands."},{"name":"RIELLE","text":"We wouldn't have made it this far without you, <span class=\"highlight\">Forename</span>."},{"name":"RIELLE","text":"I want you to know that I'm truly grateful for the time we shared."},{"name":"RIELLE","text":"You, Sidurgu, and Fray taught me so much about the world. About what it means to fight for another...and what it means to fight for yourself."},{"name":"RIELLE","text":"We're going to finish this together. The three of us."},{"name":"SIDURGU","text":"...Naught else to say, really."},{"name":"SIDURGU","text":"To Twinpools, then. Let's not keep the countess waiting."},{"name":"SIDURGU","text":"Best not neglect your preparations. I doubt the Temple Knights will let us come back for supplies."},{"name":"RIELLE","text":"...I'm ready to see her."},{"name":"RIELLE","text":"I wonder how many men will she bring to kill the “abomination”..."},{"name":"SIDURGU","text":"Seems we're early. Well, it's not as though I have pressing business elsewhere... Enjoy a moment's respite with me, <span class=\"highlight\">Forename</span>?"},{"name":"YSTRIDE","text":"You came. A wise decision."},{"name":"YSTRIDE","text":"You have his eyes. His nose, his lips..."},{"name":"YSTRIDE","text":"Every time I look at you, I see more and more of him. And it <span class=\"emphasis\">sickens</span> me."},{"name":"SIDURGU","text":"Rielle is not her father!"},{"name":"SIDURGU","text":"You had no right to punish her for what he did!"},{"name":"YSTRIDE","text":"Who are you to stand in judgment of me!? I have <span class=\"emphasis\">every</span> right!"},{"name":"YSTRIDE","text":"I bore that monster into this world, and by the Fury, I shall send it to the seventh hell!"},{"name":"YSTRIDE","text":"If you're so bloody fond of it, you can follow it there!"},{"name":"SIDURGU","text":"It's just us now─no one else. Remember Fray's conjury."},{"name":"SIDURGU","text":"Protect us, and we'll protect you."},{"name":"RIELLE","text":"Right, then."},{"name":"SIDURGU","text":"Raaaaaargh!"},{"name":"YSTRIDE","text":"Damn you! Get...get out of my way!"},{"name":"YSTRIDE","text":"Why!? Why!?"},{"name":"YSTRIDE","text":"Why do you care so much what happens to it!?"},{"name":"SIDURGU","text":"...You're not the first person to ask me that."},{"name":"SIDURGU","text":"Once, you might have understood..."},{"name":"SIDURGU","text":"For everything that you are─that you have done─you are still her mother."},{"name":"SIDURGU","text":"Go. We shall not meet again."},{"name":"YSTRIDE","text":"...Oh, but we will. We <span class=\"emphasis\">will</span>, knight! I promise you that!"},{"name":"YSTRIDE","text":"I will follow you to the ends of the world, if I must. So long as she...so long as <span class=\"emphasis\">it</span> lives, I must!"},{"name":"YSTRIDE","text":"Don't you <span class=\"emphasis\">see</span>, you fool!? The Fury wills it! <span class=\"emphasis\">The Fury wills it</span>!"},{"name":"SIDURGU","text":"Rielle?"},{"name":"RIELLE","text":"How great your love for Her. Far greater than any you ever bore me."},{"name":"RIELLE","text":"For a long time, I prayed for forgiveness. I prayed you would take me in your arms and hold me as you did before..."},{"name":"RIELLE","text":"But I know that shall never come to pass."},{"name":"RIELLE","text":"...I will pray for you, Mother, that you might find peace in Her halls."},{"name":"RIELLE","text":"O Halone, receive of us this woman, Your humble servant. Raise her up to Your bosom and grant her glory everlasting..."},{"name":"SIDURGU","text":"...So what now?"},{"name":"RIELLE","text":"We go back to Ishgard."},{"name":"RIELLE","text":"Together."},{"name":"SIDURGU","text":"...As you wish."},{"name":"RIELLE","text":"And so falls House Caulignont..."},{"name":"SIDURGU","text":"It all seems so simple in retrospect..."},{"name":"SIDURGU","text":"The moment I stopped trying to find the answer, there it was."},{"name":"SIDURGU","text":"All that anger, all that rage...born of a fervent desire to protect that which we hold most dear."},{"name":"RIELLE","text":"...So you are still committed to your path, then."},{"name":"SIDURGU","text":"...And you, if you will have me."},{"name":"RIELLE","text":"You'll need to talk to me more. And listen..."},{"name":"RIELLE","text":"I can't stand the silence, you know."},{"name":"RIELLE","text":"There's no shame in sharing the weight, Sid. We can bear it together─for ourselves, and for others."},{"name":"SIDURGU","text":"Right, then."},{"name":"SIDURGU","text":"The two of us will manage on our own, <span class=\"highlight\">Forename</span>."},{"name":"SIDURGU","text":"There may be others who know of Rielle's heritage...but if they come, we will be ready."},{"name":"SIDURGU","text":"Granted, we could simply leave Ishgard, but that would leave the people at the mercy of the powers that be. I cannot do that now...and neither can Rielle, I think."},{"name":"SIDURGU","text":"We all need a cause, <span class=\"highlight\">Forename</span>. So what will yours be? For whom will you stand?"},{"name":"Q1","text":"For whom will you stand?"},{"name":"A1","text":"My friends."},{"name":"A1","text":"For Eorzea."},{"name":"A1","text":"Myself."},{"name":"SIDURGU","text":"And so you shall."},{"name":"SIDURGU","text":"...It stirs within you, yearning to be free."},{"name":"SIDURGU","text":"Look within your heart and decide what sort of <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> you would be. But mark me well, <span class=\"highlight\">Forename</span>. Without a flame, the abyss will take you."},{"name":"SIDURGU","text":"To walk the path is to suffer. To sacrifice. Justice demands no less."},{"name":"SIDURGU","text":"But we must never lose sight of why we chose to walk it."},{"name":"SIDURGU","text":"...Gods help me, those moogles were onto something, weren't they?"},{"name":"SYSTEM","text":"This concludes the dark knight quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next dark knight quest will be available from Sidurgu."},{"name":"SIDURGU","text":"Rielle!? Where are you!? RIELLE!"},{"name":"RIELLE","text":"Sid! I can't, I..."},{"name":"YSTRIDE","text":"Go forth, brave knights of Ishgard! The Fury watch over and protect you!"},{"name":"SIDURGU","text":"So much for a fair fight..."},{"name":"SIDURGU","text":"Rielle, <span class=\"highlight\">Forename</span>─stay close to me!"},{"name":"YSTRIDE","text":"Be without fear in the face of the heretics! Forward, I say! Forward!"},{"name":"SIDURGU","text":"Just how many did she bring!?"},{"name":"SIDURGU","text":"Stand your ground! Let them come to us!"},{"name":"RIELLE","text":"No... No more. Enough!"},{"name":"YSTRIDE","text":"Forward! Bring me her head! The Fury wills it!"},{"name":"RIELLE","text":"Have you no mercy, Mother!?"},{"name":"YSTRIDE","text":"I told you never to call me that!"},{"name":"YSTRIDE","text":"You were given a chance! You could've stayed in your cell!"},{"name":"YSTRIDE","text":"Monster! Abomination! Death will be a mercy!"},{"name":"YSTRIDE","text":"Kill them! Kill them all! All of you, attack!"},{"name":"SIDURGU","text":"You...will not...harm her!"},{"name":"YSTRIDE","text":"O Halone, see us to victory! Grant me the strength to strike down this foul creature!"},{"name":"YSTRIDE","text":"Pray forgive me my sins...for laying down with Your enemies..."},{"name":"YSTRIDE","text":"Help me...to cleanse my soul of this taint..."},{"name":"YSTRIDE","text":"Render unto it Your judgment! Unmake this monstrosity!"}],"reward":{"gil":1698,"action":3643,"items":[{"id":20665}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":98}],"quests":[67599]},"next":[68451]},"partials":[{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1015052","obj":{"i":1015052,"n":"Sidurgu","l":2200,"q":1}},{"type":"npc","id":"1015053","obj":{"i":1015053,"n":"Rielle","l":2200,"q":1}},{"type":"action","id":"3643","obj":{"i":3643,"n":"Carve and Spit","c":3058,"j":32,"t":4,"l":60}},{"type":"item","id":"20665","obj":{"i":20665,"n":"Chaos Armor Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67599","obj":{"i":67599,"n":"The Flame in the Abyss","g":157,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"68451","obj":{"i":68451,"n":"In Memories We Walked","g":157,"l":"Ishgard","s":601,"f":1}}]}