{"quest":{"name":"From the Hoplon to the Brume","location":"Ishgard","id":67614,"patch":3.0,"sort":580,"icon":100455,"unlocksFunction":1,"eventIcon":71341,"issuer":1012538,"target":1012538,"involved":[1012180,1012542,1012545],"genre":140,"usedItems":[12024],"journal":["Elde's business is booming.","Elde once again passes you the menial task of delivering her contribution to the Mercantile Guild to Elaisse. However, she also asks that you broach the subject of a letter of introduction to the nobility, to sell a new line of luxury goods. Once again make your way up the Jeweled Crozier, and deliver the pouch to the fledgling guild's leader.","Jingling pouch in hand, Elaisse thanks you profusely for the business you and Elde have brought to the Crozier. When asked for an introduction, however, the merchant instead directs you to Gerhardt. Speak with your main competitor further up the street.","Much to your surprise, Gerhardt now wishes to hitch himself to Elde's rising star. He will happily give you an introduction to the nobles he knows─but only for a price. It just so happens that the elderly merchant is quite the devotee of Aubrenard, and thus is pining for an original ode by the bard. Return to Elde with these startling tidings.","Elde believes Gerhardt's change of heart is an opportunity to turn a bitter rival into a staunch ally. And, in a stroke of luck, she has yet to give Aubrenard his payment for his prior services. Thus, she bids you take a coin-stuffed pouch to the bard in the Brume, and there ask for him to pen an ode for Gerhardt.","You find Aubrenard playing to his smallest fans. However, he is confused when you hand him the coin-stuffed pouch, for he had already received payment. He soon realizes that Elde is in fact giving him a donation for the poor of the Brume, and, touched by her kindness, agrees to write the poem for Gerhardt. Return to Elde with the resulting work, <span class=\"emphasis\">The Merchant of Ishgard</span>.","Elde accepts the poem, and says she will take it to Gerhardt herself. However, she has yet another request to make of you─a sample of your finest leatherwork, to impress the noble that Gerhardt introduces. As such, Elde asks you to fashion a high-quality dragonskin choker.","Elde is once again very complimentary of your work. Gerhardt arrives, and pledges both his support and storehouses for her enterprise. With two such generous benefactors, Elde vows to continue expanding her business.<br><br>※The next leatherworker quest will be available from Elde upon reaching level 60."],"objectives":["Deliver the sack of guild aid to Elaisse.","Speak with Gerhardt.","Speak with Elde.","Deliver the coin-stuffed pouch to Aubrenard in the Brume.","Deliver the copy of <span class=\"emphasis\">The Merchant of Ishgard</span> to Elde.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a dragonskin choker <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the dragonskin choker <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Elde</span></span>."],"dialogue":[{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, I can't thank you enough for your help! All Ishgard now wishes to dress their best, and my leathers are flying off the shelves!"},{"name":"ELDE","text":"But it's time to donate a portion of my profits to the Mercantile Guild. Could you deliver this pouch to Mistress Elaisse?"},{"name":"ELDE","text":"I'm sorry to impose again. It's just that the store is bustling, and I can't bear to tear myself away for even one minute."},{"name":"ELDE","text":"Oh, and could you also ask her for a letter of introduction to the higher of the noble houses?"},{"name":"ELDE","text":"Please, don't confuse my intent, <span class=\"highlight\">Forename</span>. I'm not forsaking sales to the lowborn by any means. But I've also got you for an advisor, and I don't see why we shouldn't develop luxury products, too."},{"name":"ELDE","text":"Just think what this could do for our image! We're known for having the most stylish boots around─think what we could become by proving we can answer the nobility's needs as well!"},{"name":"ELDE","text":"But the first step is getting that introduction from Mistress Elaisse. Thank you for doing this, my friend."},{"name":"ELDE","text":"How does Mistress Elaisse know so many nobles? I'd never really thought about it..."},{"name":"ELAISSE","text":"A third visit on Elde's behalf, I take it?"},{"name":"ELAISSE","text":"Ah, thank you. In all honesty, I hadn't put much hope in Elde's little venture. But now, she's become quite the fixture on the Crozier."},{"name":"ELAISSE","text":"Her business has brought a bustle to our market─thanks to your sage advice, I daresay. The Mercantile Guild and I are grateful. If you need anything, name it, and it is yours."},{"name":"ELAISSE","text":"An introduction? Oh dear, that's the one thing I cannot give. I haven't the slightest notion who among the nobles prizes leather, you see."},{"name":"ELAISSE","text":"However, might I suggest seeking Gerhardt's advice? He has long plied his trade amongst the High Houses, and an introduction from him would carry weight."},{"name":"ELAISSE","text":"I am aware of the irony of sending you to Gerhardt after warning you away from him. But if he proves stubborn, the guild can apply certain...pressure."},{"name":"ELDE","text":"Gerhardt can give us a letter of introduction? Well, if Mistress Elaisse says so..."},{"name":"GERHARDT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, I do not have the time for you."},{"name":"GERHARDT","text":"For Halone's sake, what could you possibly want now?"},{"name":"GERHARDT","text":"An introduction to the nobility? And I suppose you'd like me to set fire to my wares, for all the good it does my business! Why would you think for an instant that I'd help Elde!?"},{"name":"GERHARDT","text":"Well, you were right. I <span class=\"emphasis\">will</span> help Elde. Happy to do so."},{"name":"GERHARDT","text":"I am deadly serious, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I'm an avid follower of Aubrenard's, and I simply had to try your boots when I heard he was wearing them. The craftsmanship was..."},{"name":"GERHARDT","text":"Well, I've been a merchant long enough to know when I'm beaten. I would like to reconsider joining your enterprise."},{"name":"GERHARDT","text":"But I <span class=\"emphasis\">do</span> have one request before doing so."},{"name":"GERHARDT","text":"I want an ode, an Aubrenard original. It isn't dignified for one of my stature to be seen asking for it in person. See to it, and you will have your introduction to the nobles!"},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, I do so love talking to the customers. The stories you hear─ Er, right, did you get the introduction?"},{"name":"ELDE","text":"He...hehehe! I always knew Gerhardt's bark was worse than his bite! And he's been a merchant for years and years here─I can't imagine a better ally."},{"name":"ELDE","text":"I say we accept his terms. I needed to pay Aubrenard for promoting my shop in any case. It should put him in a good mood, and hopefully get us an ode. Could you...?"},{"name":"ELDE","text":"Thank you. At this time of <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>, I believe the bard will be strolling in the Brume."},{"name":"ELDE","text":"Aubrenard should be in the Brume, my friend."},{"name":"AUBRENARD","text":"Hello, <span class=\"highlight\">Forename</span>! Surprised to find me here? The Brume was my home, once. Now, it is home to my smallest devotees."},{"name":"AUBRENARD","text":"My payment? But I already received my─ Oooh, I see. This money is not actually for me."},{"name":"AUBRENARD","text":"Elde is making an anonymous donation to those in need. A generous one, judging by the weight of this purse."},{"name":"AUBRENARD","text":"She must've known I help feed the children here. Well, rest assured, I will see that these funds make it to Gerraldieux's hands, and thence to those who need them."},{"name":"AUBRENARD","text":"Pray, keep this between us. Elde has ambition, but her goal is not gil alone. Perhaps she wished you know that, and dispatched you here."},{"name":"AUBRENARD","text":"An ode for...Gerhardt? Well, I know the man. He comes to my performances early and often. Yes, I think I will pen a little something. Elde has inspired me."},{"name":"AUBRENARD","text":"Here you are─<span class=\"emphasis\">The Merchant of Ishgard</span>, an ode to the trials and tribulations of a lowborn shopkeep fighting against a noble artisan. I hope both Elde and Gerhardt appreciate it."},{"name":"AUBRENARD","text":"<span class=\"emphasis\">The Merchant of Ishgard</span> is hardly my finest work, but it does have some wonderful lines: “So shines a good deed in a weary world.” Marvelous, eh? I do hope Elde thinks so."},{"name":"ELDE","text":"Has inspiration come to the bard, <span class=\"highlight\">Forename</span>? "},{"name":"ELDE","text":"Thank you, thank you! I do hope this pleases Gerhardt. I'll deliver it to him myself, as a gesture of goodwill."},{"name":"ELDE","text":"But I've realized we've nothing to show the noble to whom he introduces us. I must call upon your skills again to produce some finery."},{"name":"ELDE","text":"Could you make a dragonskin choker? I believe an exquisitely crafted one will win us noble patronage. And once we have that, the sky will be the limit!"},{"name":"ELDE","text":"Truth be told, <span class=\"highlight\">Forename</span>, I've never seen a dragonskin choker. I am quite looking forward to beholding yours."},{"name":"ELDE","text":"This is perfectly gorgeous! Why, the design will impress the most discerning of highborn, and the craftsmanship will thrill the most discriminating."},{"name":"GERHARDT","text":"Ah, there you are. That ode is priceless! Really, I'd have given my fortune for it. And I am a man of my word─here, the letter of introduction."},{"name":"ELDE","text":"Thank you, Master Gerhardt. It is very much appreciated."},{"name":"GERHARDT","text":"My dear, forgive me for misjudging you. I've heard you learned what it is to be an artisan at your grandsire's knee, and I can see now that devotion drives your own work."},{"name":"GERHARDT","text":"Too few have the same spark these days, and it would be my honor to help keep it alight."},{"name":"GERHARDT","text":"I've had a word with Elaisse, and she is likewise willing to support your enterprise─even with coin from the Mercantile Guild's own coffers, if necessary."},{"name":"GERHARDT","text":"Now, I've a number of storerooms around the city. They are yours to use, should you need the space."},{"name":"ELDE","text":"I...I hardly know what to say! Thank you, Gerhardt!"},{"name":"ORTEFAUCHEL","text":"Well, things are going well for you and the Gridanian master, Elde. I daresay you'll climb even higher yet."}],"reward":{"gil":602,"items":[{"num":240,"id":11},{"id":11889},{"id":5702,"one":1},{"id":5707,"one":1},{"id":5712,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":13}],"quests":[67613]},"next":[67615]},"partials":[{"type":"npc","id":"1012538","obj":{"i":1012538,"n":"Elde","l":2301,"q":5}},{"type":"npc","id":"1012180","obj":{"i":1012180,"n":"Elaisse","l":2301,"q":8}},{"type":"npc","id":"1012542","obj":{"i":1012542,"n":"Gerhardt","l":2301,"q":3}},{"type":"npc","id":"1012545","obj":{"i":1012545,"n":"Aubrenard","l":2300,"q":1}},{"type":"item","id":"11889","obj":{"i":11889,"n":"Hardsilver Round Knife","l":120,"c":35415,"t":20,"p":17487}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12024","obj":{"i":12024,"n":"Dragonskin Choker","l":140,"c":54915,"t":40}},{"type":"quest","id":"67613","obj":{"i":67613,"n":"Perfect Pitch","g":140,"l":"Ishgard","s":550,"f":1}},{"type":"quest","id":"67615","obj":{"i":67615,"n":"A Winter's Sale","g":140,"l":"Ishgard","s":600,"f":1}}]}