{"quest":{"name":"Sellspade","location":"Ishgard","id":67617,"patch":3.0,"sort":530,"icon":100448,"unlocksFunction":1,"eventIcon":71341,"issuer":1013230,"target":1013230,"involved":[1013233,1013234,1013235,1013239],"genre":144,"usedItems":[12534],"journal":["Haimirich is raring to go.","House Fortemps has asked that Oschon's Raiders survey the Coerthas western highlands. They are interested in the mythrite that may lie beneath the region. Haimirich therefore tasks you with discovering whether or not a sufficient quantity of ore can be pulled from underground. With your marching orders now set, Haimirich bids you join him and his men to the south end of the Black Iron Bridge.","You find Oschon's Raiders idling near the south end of the bridge. However, all jump to attention when Haimirich calls, and they listen attentively as he gives them their individual orders. Finally, he comes to you, and tells you to find ten chunks of mythrite ore in the area. Begin your search at the mineral deposits near the Gorgagne Holding, and return to Haimirich with your findings when finished.","Haimirich gladly accepts the mythrite ore just before Hatchling comes running with ill tidings─one of the Raiders has been injured. The Raider captain wastes no time in sending the man to Falcon's Nest for treatment, and then treats you and Hatchling to his thoughts on being a sellsword before returning to the Forgotten Knight. Meet with him there when you head back to Ishgard.","According to Haimirich, the wounded Raider will make a full recovery. He thanks you again, and bids you make yourself ready for when the next job comes down from House Fortemps.<br><br>※The next miner quest will be available from Haimirich upon reaching level 55."],"objectives":["Speak with Haimirich at the Black Iron Bridge.","<span class=\"alternative-container\"><span class=\"alternative\">Mine mythrite ore</span><span class=\"alternative\">Deliver the chunks of mythrite ore to Haimirich</span></span>.","Speak with Haimirich in Ishgard."],"dialogue":[{"name":"HEIMIRICH","text":"Professor! We've gotten a job from House Fortemps. Are you ready for your first time out with the Raiders?"},{"name":"HEIMIRICH","text":"Good, good. We're goin' to survey the western highlands an' see if we can't find any veins of mythrite. I'll need you to dig samples from the area an' see if there's enough ore to mine proper."},{"name":"HEIMIRICH","text":"We'll meet at the south end o' the Black Iron Bridge. Me an' the lads'll go ahead an' clear out some o' the monsters before you get there. Don't keep us waitin' too long!"},{"name":"HEIMIRICH","text":"Remember, at the south end o' the Black Iron Bridge. An' I wouldn't stray too far from the path, if I were you."},{"name":"BABYCHOCO","text":"It's yer first time out, Professor. Don't muck it up!"},{"name":"STRONGARM","text":"You are the one called Professor?"},{"name":"HEIMIRICH","text":"Glad you joined us, Professor. Lads, <span class=\"emphasis\">lads</span>─stop up your gobs!"},{"name":"HEIMIRICH","text":"Hatchlin', keep watch─I don't want anythin' takin' us unawares. Muscles, scout out what routes could be used for takin' the haul back to Ishgard. I want the pros an' cons of each, too. All of you, keep up your guard, an' don't get cocky. That goes double for you, Hatchlin'!"},{"name":"HEIMIRICH","text":"Professor, start diggin' for mythrite down by the Gorgagne Holdin'. Come back here when you've pulled a few bits of ore out the ground."},{"name":"HEIMIRICH","text":"Ten chunks'll be proof o' mythrite in these outcroppin's, an' that'll be enough for House Fortemps to develop the area. Now, Raiders─to your duties!"},{"name":"BABYCHOCO","text":"I'll watch yer back, Professor. None of us get paid if ye fail, so I promised the cap'n I'd keep ye safe."},{"name":"STRONGARM","text":"Yes?"},{"name":"HEIMIRICH","text":"Have you found ten bits o' mythrite? Can't go home till you do."},{"name":"HEIMIRICH","text":"Hah! I'd say it was well worth the trouble o' hirin' a proper miner from Ul'dah!"},{"name":"BABYCHOCO","text":"Cap'n, we got wounded!"},{"name":"HEIMIRICH","text":"...Muscles, get him to Falcon's Nest. Camp Riversmeet's closest, but that's more trouble than it's worth."},{"name":"HEIMIRICH","text":"Surveyin' sounds like a safe enough task when you've got an army. But we don't have an army. 'Tis a miracle we didn't lose any men this time 'round..."},{"name":"HEIMIRICH","text":"&lt;sigh&gt; Ah, but that's a sellsword's lot, isn't it?"},{"name":"HEIMIRICH","text":"See, knights are brave, honorable people, all competin' to see who's bravest and most honorable. They'll throw themselves into dragon fire to win honor in the eyes o' the High Houses."},{"name":"HEIMIRICH","text":"But not a one of them'll jump for this kind o' work. So they'll find someone what's willin' to do it, an' pass it off to them. Sometimes, that's their own men, an' sometimes it ain't."},{"name":"BABYCHOCO","text":"Cap'n...are ye sayin' one of ours could've been killed 'cause the nobles think themselves too bloody good for the work!?"},{"name":"HEIMIRICH","text":"Aye, that's the long an' short of it. But, Hatchlin', <span class=\"emphasis\">I'm</span> the one who offered up the Raiders' services. The work's dangerous, but we win favor doin' it. An' House Fortemps, they're fair-minded folk. They <span class=\"emphasis\">will</span> give us better when the time comes."},{"name":"HEIMIRICH","text":"But to get it, we've got to be able to put our swords forward, no matter what. That's how you become successful as a sellsword."},{"name":"BABYCHOCO","text":"Shite business, if ye ask me."},{"name":"HEIMIRICH","text":"If you can get out, by all means get out. None o' my lads came to this life willingly. Some drifted into it, others came tumblin' down to it."},{"name":"HEIMIRICH","text":"There's one as took to crime an' lost his home. Another lost a lover an' needed a new home. There's only one breed o' strays I don't take─them what want a place to die."},{"name":"HEIMIRICH","text":"They're bad for business an' bad for the company. So tell me, Hatchlin', why're you here?"},{"name":"BABYCHOCO","text":"I...I came 'cause I want glory. An' a name─I want to win meself one of them!"},{"name":"HEIMIRICH","text":"Wrong soddin' place for you, then! But I'll keep you. You're not half bad with a blade!"},{"name":"HEIMIRICH","text":"Well, let's get back to Ishgard. I'd kill for a hot bowl o' soup after this cold!"},{"name":"HEIMIRICH","text":"Seems our wounded lad'll make a full recovery, Professor. Fast enough to join us the next time out, even."},{"name":"HEIMIRICH","text":"Really, I'm blessed to have this lot. Hells, even Hatchlin's a better sword than I was at his age."},{"name":"HEIMIRICH","text":"Anyroad, keep honin' your instincts, eh? Our next job's like to be harder an' dirtier than this one, an' you'll want to be sharp for it!"},{"name":"SYSTEM","text":"In breaking new ground as a miner, you have learned “Stone Whisperer V”!"}],"reward":{"gil":1338,"items":[{"id":11947},{"id":11984,"one":1},{"id":11989,"one":1},{"id":11994,"one":1},{"id":12002,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":17}],"quests":[67616]},"next":[67618]},"partials":[{"type":"npc","id":"1013230","obj":{"i":1013230,"n":"Haimirich","l":2300,"q":5}},{"type":"npc","id":"1013233","obj":{"i":1013233,"n":"Haimirich","l":2200,"q":1}},{"type":"npc","id":"1013234","obj":{"i":1013234,"n":"Hatchling","l":2200,"q":1}},{"type":"npc","id":"1013235","obj":{"i":1013235,"n":"Muscles","l":2200,"q":1}},{"type":"npc","id":"1013239","obj":{"i":1013239,"n":"Muscles","l":2200,"q":1}},{"type":"item","id":"11947","obj":{"i":11947,"n":"Mythrite Sledgehammer","l":90,"c":38057,"t":29}},{"type":"item","id":"11984","obj":{"i":11984,"n":"Holy Rainbow Hat","l":80,"c":41271,"t":34,"p":7983}},{"type":"item","id":"11989","obj":{"i":11989,"n":"Wyvernskin Jerkin","l":80,"c":42468,"t":35,"p":12355}},{"type":"item","id":"11994","obj":{"i":11994,"n":"Holy Rainbow Work Gloves","l":80,"c":44389,"t":37,"p":8870}},{"type":"item","id":"12002","obj":{"i":12002,"n":"Wyvernskin Culottes","l":80,"c":45691,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12534","obj":{"i":12534,"n":"Mythrite Ore","l":130,"c":21221,"t":48}},{"type":"quest","id":"67616","obj":{"i":67616,"n":"Breaking New Ground","g":144,"l":"Ul'dah","s":502,"f":1}},{"type":"quest","id":"67618","obj":{"i":67618,"n":"The Same Vein","g":144,"l":"Ishgard","s":550,"f":1}}]}