{"quest":{"name":"A Winter's Sale","location":"Ishgard","id":67615,"patch":3.0,"sort":600,"icon":100455,"unlocksFunction":1,"eventIcon":71341,"issuer":1012538,"target":1012538,"involved":[1000691,1012539,1012540,1012541,1013819],"genre":140,"usedItems":[12999],"journal":["Elde's eyes are shining with ambition.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Leatherworker III</span>.</span>","Elde has her sights set upon a great commission─leather armor for the Temple Knights. You learn that Ortefauchel is in fact a member of the order, and has himself petitioned for lighter, more flexible armor. However, the tradition of using plate mail is deeply rooted, and no one man can overcome it. Unsure of how to proceed, Elde bids you return to the Leatherworkers' Guild with a letter, and pick Geva's brain over how to sell her idea.","Geva's general feeling about your current conundrum is that you ought to know how to market leather armor by this point. Nevertheless, she tells you the tale of one Ciceroix Pondefout. This Ishgardian craftsman worked with the guildmaster several generations back to create the leather-hardening process still used in Wood Wailer and Gods' Quiver armor. Armed with this hopefully useful story, return to Elde along the Jeweled Crozier.","You find Elde about to discuss raising the issue of leather armor with the Temple Knights. When your turn comes to chime in, you mention Ciceroix Pondefout, and learn this was none other than Elde's grandfather. The artisan had once tried to sell leather armor to the order, but failed and left for Gridania. Elde remembers that she has one old design of his─a chivalric longcoat of aiming─and asks that you fashion this hardy armor now.<br><br><span class=\"highlight\">In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Leatherworker III</span>.</span>","As always, your work is met with rave reviews. With this armor, Elde says, she cannot fail to see her grandfather's dreams realized. Go to the Lightfeather Proving Grounds, and speak with Ser Ortefauchel.","Ser Handeloup himself comes to evaluate the leather armor. After watching Ser Ortefauchel dodge a beast's attack and survive one savage blow, he gladly vows to buy more of the same for the Temple Knights. Elde is overjoyed to hear the news, both for herself and for her grandfather, and summons you back to her shop for one last meeting.","Elde offers her heartfelt thanks to you again, and promises that she will continue expanding her business. However, she will never forget the leatherworker who so selflessly aided her, and thus promises to name her brand after you as a new standard by which to measure excellence.<br><br>※The next leatherworker quest will be available from Geva once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Deliver the letter to Geva at the Leatherworkers' Guild.","Report to Elde.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a chivalric longcoat of aiming</span><span class=\"alternative\">Deliver the chivalric longcoat of aiming to Elde</span></span>.","Speak with Ortefauchel in front of the Lightfeather Proving Grounds.","Report to Elde."],"dialogue":[{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, my business is on the cusp of great growth─I can feel it!"},{"name":"ORTEFAUCHEL","text":"Elde, your business is threefold larger than when we met. How could you possibly expand it more than you already have?"},{"name":"ELDE","text":"With a commission of great size: armor for the Temple Knights! Until now, the Holy See's own craftsmen made all of it. But not any longer!"},{"name":"ORTEFAUCHEL","text":"Strange you should mention that, actually. There are calls within the order to create a more mobile band of knights. They ought to be discussing what armor will let them move swiftly and silently."},{"name":"ELDE","text":"Aha! If they choose leather, just <span class=\"emphasis\">think</span> of the rewards we shall reap!<br>...But how did you come to know the inner workings of the order?"},{"name":"ELDE","text":"For that matter, why do you spend your every free moment here? Who...who are you, Master Ortefauchel?"},{"name":"ORTEFAUCHEL","text":"<span class=\"emphasis\">Ser</span> Ortefauchel, if you must know. I'm a Temple Knight. A currently homeless Temple Knight."},{"name":"ORTEFAUCHEL","text":"My wife─kindly soul that she is─threw me out. Even that leather bag did not soothe her savage temper. So I've taken a cheap room at Cloud Nine, and wander the town by day."},{"name":"ORTEFAUCHEL","text":"Which is partially because I am charged with supplying the order. I've been looking into leather armor, and have heartily suggested it. But I'm alone in saying so, and my voice carries little weight."},{"name":"ORTEFAUCHEL","text":"It's customary for the order to armor itself in plate and chainmail. Simply put, no one will give that up in favor of leather."},{"name":"ELDE","text":"But the Wood Wailers and the Gods' Quiver have long used leather armor─surely that is proof enough of its worth!"},{"name":"ELDE","text":"...Well, I'd anticipated some opposition. I drew up a letter to ask Guildmaster Geva's advice on selling leather armor. Could you take it to her and explain the situation, <span class=\"highlight\">Forename</span>?"},{"name":"ELDE","text":"In the meantime, Ortefauchel and I─ Pardon me, <span class=\"emphasis\">Ser</span> Ortefauchel and I will discuss how best to approach the order."},{"name":"ELDE","text":"I wonder what Guildmaster Geva will have to say? The Wood Wailers and the Gods' Quiver traditionally use leather armor... Perhaps she's never run into this problem before."},{"name":"GEVA","text":"<span class=\"highlight\">Forename</span>. I haven't heard a peep from Elde or you. I take it the two of you have worked out a deal?"},{"name":"GEVA","text":"Well, it sounds as if you've used your time well enough. And getting a commission from the Temple Knights would be a feather in Elde's cap."},{"name":"GEVA","text":"However, I don't see why you need my help selling this idea. You know leather armor is light and flexible. The knights likewise know plate mail is heavy and stiff. That should be enough."},{"name":"GEVA","text":"If the order is choosing metal because they think it protects them better, then you provide them proof to the contrary. Simple, no?"},{"name":"GEVA","text":"Ah, and should they want precedence, tell them of Ciceroix Pondefout. He was a leatherworker who visited from the Holy See in the time of my grandfather."},{"name":"GEVA","text":"Ciceroix, though skilled in his own right, needed Gridanian expertise to craft armor impervious to pincers, stingers, claws, and fangs. With the guildmaster's help, he succeeded."},{"name":"GEVA","text":"To this day, no one has devised a better leather-hardening technique. It's used in every suit of armor for the Wood Wailers and the Gods' Quiver. You have inherited it as a pupil of mine, in fact."},{"name":"GEVA","text":"Well, there you have it. Win the commission with that tale of friendship between nations. Failing that, fashion a suit of armor with your customary care, and demonstrate its effectiveness. Now, are you quite finished wasting my time?"},{"name":"GEVA","text":"I told you already─the answer to your problem was inside you all along. So why do you continue to hound me?"},{"name":"ELDE","text":"Welcome back, <span class=\"highlight\">Forename</span>! We were just about to begin our discussion."},{"name":"ORTEFAUCHEL","text":"I raised the issue of leather armor with the other knights, but not a man among them will give up his plate mail. Moreover, someone brought the same idea to the order years ago, and was dismissed on the basis of tradition."},{"name":"GERHARDT","text":"Heavens know I care deeply for tradition, but now isn't the time. The Calamity has changed us─changed everything─and we cannot pretend otherwise. Just look at the weather."},{"name":"ORTEFAUCHEL","text":"A good point, Gerhardt. It's cold now, and like to get colder. Wearing woolen tunics underneath plate mail is a cumbersome affair. Leather armor offers more warmth, and greater ease of movement. "},{"name":"ELDE","text":"I don't think that alone will be enough, though... <span class=\"highlight\">Forename</span>, what did Guildmaster Geva have to say?"},{"name":"ORTEFAUCHEL","text":"So our ideal armor will be slightly thicker for warmth, and bear the brunt of even a behemoth's attack. But such is possible, yes?"},{"name":"GERHARDT","text":"An <span class=\"emphasis\">Ishgardian</span> artisan came up with this, eh? Well, add to that the fact that the Wood Wailers and Gods' Quiver use this technique still, and maybe we'll make the sale."},{"name":"ELDE","text":"Sorry, what did you say the name of the artisan was?"},{"name":"GERHARDT","text":"Ciceroix Pondefout!? Good heavens, Elde's grandsire!"},{"name":"ORTEFAUCHEL","text":"I've seen his name in our records! He was the one who brought leather armor before the Temple Knights, and left for Gridania after being turned down."},{"name":"ELDE","text":"...We <span class=\"emphasis\">must</span> get this commission."},{"name":"ELDE","text":"My grandsire left me little, save one set of designs for leather armor. They've always been beyond my skill to craft─but I daresay you could manage it."},{"name":"ELDE","text":"You know the technique he spent his life perfecting, <span class=\"highlight\">Forename</span>! Please, use it to fashion his chivalric longcoat of aiming."},{"name":"GERHARDT","text":"I've a feeling this will be a sight to see!"},{"name":"SYSTEM","text":"In order to complete this quest, you must have learned the advanced recipes contained within <span class=\"emphasis\">Master Leatherworker III</span>."},{"name":"ORTEFAUCHEL","text":"If we succeed, this will make a good story. If we fail, then we've let down two generations at one go..."},{"name":"GERHARDT","text":"Ah, good. You've arrived just in time for the meeting."},{"name":"ELDE","text":"Have you had any difficulty reading my grandsire's notes, <span class=\"highlight\">Forename</span>? I'll admit, the squiggles are hard to decipher..."},{"name":"ELDE","text":"Gods above... This armor is more splendid than I could have imagined! Every stitch is careful, precise, and yet it has the same sense of warmth as my grandfather's work."},{"name":"ELDE","text":"He was praised as genius, so revolutionary were his designs. But he had no sense for business, and died having never lived up to his potential."},{"name":"ELDE","text":"I chose to become a merchant because of that. Quality and craftsmanship are important, but they mean nothing if a product never reaches the customer."},{"name":"ELDE","text":"I'll never be his equal as a leatherworker, but I can serve the people in ways he never could. My dream is a shop in every town, each delivering fine goods to those who need them."},{"name":"ELDE","text":"And I can only do that if we succeed today. Come, let us go before the Temple Knights, and triumph where Grandfather failed!"},{"name":"ELDE","text":"They will receive us at the Lightfeather Proving Grounds. I will go ahead with Ser Ortefauchel. Meet us there, my friend."},{"name":"ELDE","text":"Just leave the selling to me, <span class=\"highlight\">Forename</span>."},{"name":"ORTEFAUCHEL","text":"I'll change into the longcoat in my chambers, and meet you at the proving grounds."},{"name":"ORTEFAUCHEL","text":"Not bad on me, eh? Now, let us see if we can't sell a hundred sets to the order!"},{"name":"ELDE","text":"Just leave the selling to me, <span class=\"highlight\">Forename</span>."},{"name":"HANDELOUP","text":"...As you say, Mistress Elde, we do suffer from the ever-present snows. I also do not deny that a number of my knights have succumbed to frostbite, and their metal armor was a factor. But even so, few amongst us would trust our lives to the strength of leather."},{"name":"ORTEFAUCHEL","text":"Then allow us to put your worries to rest, Ser Handeloup."},{"name":"ORTEFAUCHEL","text":"What do you say to that display, Commander!?"},{"name":"HANDELOUP","text":"Mayhap there is merit in leather armor, after all. I think it would serve well for scouting and stealth."},{"name":"HANDELOUP","text":"We will continue our talks later, though I ask you give me some time─the order has never gone outside of the Holy See for its armor. But I give you my word that my knights will don your leathers."},{"name":"ELDE","text":"Ser Handeloup, you have my sincerest thanks!"},{"name":"HANDELOUP","text":"I need no thanks, Mistress Elde. Ser Ortefauchel's armor protected him, and that is proof enough for me. Tell me, who crafted it?"},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, my lord, a leatherworker of incomparable skill."},{"name":"HANDELOUP","text":"I had not known you were so skilled an artisan, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. But great talent must never go unrecognized. I will personally see that it does not."},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, I am a step closer to my dreams thanks to you."},{"name":"ELDE","text":"Well, let us return to my store. The place will grow busier and busier from here onwards!"},{"name":"ELDE","text":"I could not have done this without you, my friends!"},{"name":"GERHARDT","text":"But what a strange chain of events... Elde, your grandsire ventured to Gridania, where he planted the seeds of his technique. And the flowers that bloomed from them returned to Ishgard in <span class=\"highlight\">Forename</span>'s hands. We were fantastically lucky."},{"name":"ELDE","text":"Perhaps we were, Master Gerhardt. But luck means little without skill and effort. I have greater dreams for my shop yet, and I'll achieve them only by striving harder."},{"name":"GERHARDT","text":"Knowing how hard you strive, my dear, I think I'd better start rebuilding my storehouses as proper workshops!"},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, thank you again. My grandsire's technique returned with you to Ishgard, and I will see that my own craftsmen put it to good use."},{"name":"ORTEFAUCHEL","text":"Well, you have the Temple Knights clamoring for leather armor. They would like the name of the artisan."},{"name":"ELDE","text":"The artisan's name... Why, I have a splendid idea about that!"},{"name":"ELDE","text":"I'm going to build new workshops, and I'm planning to put your name on the signs outside. Just as Fen–Yll is known in Gridania, so too shall your name become a brand, and a new standard of excellence, <span class=\"highlight\">Forename</span>!"},{"name":"GERHARDT","text":"Hah! We're unstoppable! And all thanks to you, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"This concludes the leatherworker quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next leatherworker quest will be available from Geva."}],"reward":{"gil":1500,"items":[{"id":5702},{"id":5707},{"id":5712}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":13}],"quests":[67614]},"next":[68145]},"partials":[{"type":"npc","id":"1012538","obj":{"i":1012538,"n":"Elde","l":2301,"q":5}},{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1012539","obj":{"i":1012539,"n":"Ortefauchel","l":2301,"q":2}},{"type":"npc","id":"1012540","obj":{"i":1012540,"n":"Ortefauchel","l":2300,"q":1}},{"type":"npc","id":"1012541","obj":{"i":1012541,"n":"Elde","l":2300,"q":1}},{"type":"npc","id":"1013819","obj":{"i":1013819,"n":"Gerhardt","l":2301,"q":1}},{"type":"item","id":"5702","obj":{"i":5702,"n":"Craftsman's Competence Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":6,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"12999","obj":{"i":12999,"n":"Chivalric Longcoat of Aiming","l":160,"c":43694,"t":35}},{"type":"quest","id":"67614","obj":{"i":67614,"n":"From the Hoplon to the Brume","g":140,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"68145","obj":{"i":68145,"n":"A Taxing Request","g":140,"l":"Gridania","s":601,"f":1}}]}