{"quest":{"name":"Turndown Service","location":"Gridania","id":67611,"patch":3.0,"sort":502,"icon":100455,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1012538,"involved":[1012180,1012181,1012542,1012543],"genre":140,"journal":["Geva has a task that demands your attention.","Geva has received a rare request from Ishgard for a sample of Fen–Yll's finest work. The guildmaster needs you to take it to a merchant named Elde. However, she also wishes you to turn Elde down in no uncertain terms should she wish to make a substantial order. The toll of large-scale trade with Ishgard would simply be too costly for the life in the Black Shroud. Make your way to the Jeweled Crozier, and speak with the merchant.","You meet with Elde, and deliver Geva's message. Nevertheless, the merchant sees a new opportunity in you, Geva's disciple. As her shop is newly opened, she asks that you serve as an advisor, and consult with her about leatherwork. Your first task, so to speak, is speaking with the shopkeeps along the Jeweled Crozier, for something is not right in the markets of Ishgard.","After speaking to a number of merchants, you are left with the impression that the Jeweled Crozier has goods for either the very rich, or the very poor─but nothing in between. Return to Elde, and report your findings.","Elde confirms your assessment of the Jeweled Crozier, and lays before you her mission. She means to provide high-quality products to everyone at reasonable prices, regardless of their station. She bids you to join her crusade if it speaks to you.<br><br>※The next leatherworker quest will be available from Elde upon reaching level 53."],"objectives":["Deliver the selection of guild samples to Elde at the Jeweled Crozier.","Speak with the merchants at the Jeweled Crozier.","Report to Elde."],"dialogue":[{"name":"GEVA","text":"Ah, <span class=\"highlight\">Forename</span>. Good. Something has happened recently that has not happened in a long time─an order has come from Ishgard."},{"name":"GEVA","text":"A merchant named Elde has requested a selection of Fen–Yll's finest goods. I've seen to it personally that she will get our best."},{"name":"GEVA","text":"I want you to deliver the guild samples to her at the Jeweled Crozier, but only because I can trust the important part of this task to you and you alone."},{"name":"GEVA","text":"If I know anything of merchants, this is a prelude to a substantial order. The guild will not take it. Our production puts the balance of the Twelveswood in enough peril as it is."},{"name":"GEVA","text":"There. I believe you can turn her down without offering offense─and if she is insistent, you have learned how to say no from me. In any case, I trust I won't be hearing more about the matter."},{"name":"GEVA","text":"Have you forgotten where Elde is already? The Jeweled Crozier in Ishgard."},{"name":"ELDE","text":"Welcome, welcome to Elde's House of Excellence! Our signboard is newly hung, but I promise you'll find no finer leatherwork in all of Ishgard."},{"name":"ELDE","text":"Oh! The guild representative─I beg your pardon, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! I did not expect you so soon. If you will allow me to look at your samples..."},{"name":"ELDE","text":"Goodness, Fen–Yll's finery puts my best to shame! These will sell splendidly! Please, deliver your guildmaster my compliments, and an order for...for one thousand circles of leather!"},{"name":"ELDE","text":"You...you can't!? ...No, no, you have the right of it. &lt;sigh&gt; I should've known filling such a large purchase would mean a great loss of life in the Black Shroud."},{"name":"ELDE","text":"I'm very new to this, honestly. Could you help me? Oh, excuse me, that was rather forward. It's just...your hands. They're the hands of a true artisan, calloused but strong. <span class=\"emphasis\">Deft</span>."},{"name":"ELDE","text":"I'm a poor leatherworker myself, and I could use an experienced advisor, someone who can give me a fresh perspective. And we are all in dire need of a fresh perspective."},{"name":"ELDE","text":"...But I should let you draw your own conclusions, shouldn't I? Please, go and speak with the shopkeeps around here as a customer. I'm certain you'll see what I'm getting at."},{"name":"ELDE","text":"Lost as to where to begin? Well, what about Mathye? He's the fellow just behind my shop. Oh, but don't let him know I sent you!"},{"name":"MATHYE","text":"Ah, my dear <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, what house do you serve? Oh, I see─shopping for yourself, eh? Well, my wares are <span class=\"emphasis\">most</span> reasonably priced! In fact, I take great pride in delivering the cheapest of goods to the lowborn! I will not be undersold!"},{"name":"ELAISSE","text":"A warm welcome to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Please, feel free to visit our many, many shops."},{"name":"ELAISSE","text":"From highborn lords to working commoners, we strive to accommodate everyone's needs. But one word about the cheaper merchandise: if it seems too good to be true, it most likely is."},{"name":"GERHARDT","text":"...If you <span class=\"emphasis\">must</span> go shopping, kindly do so in the Brume, sir!"},{"name":"GERHARDT","text":"What? Must I repeat myself again and again!? I do not have anything to sell to the likes of you! Do you understand!? You do not have the gil to buy what I have to offer!"},{"name":"GERHARDT","text":"Tch, I have wasted far too much time explaining myself. I have an appointment with the Count de Durendaire. Good day, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"KYAKU02075","text":"All I wanted was to give me daughter a nice dress for her nameday. I've even got the bloody gil! Why can't the poor get nothin' nice, even if we've got the coin to buy!?"},{"name":"KYAKU02075","text":"Bloody merchants. They're why we can't have nice things..."},{"name":"ORTEFAUCHEL","text":"Pardon me, madam─which of these is best? I need a present to charm my wife, and I can't choose between what all seem to be splendid bags."},{"name":"ELDE","text":"Thank you for saying so, sir. But if you aren't in a hurry, we're scheduled to get a shipment of far finer than these soon."},{"name":"ORTEFAUCHEL","text":"Finer, eh? Well, only the best for my bride. Could you hold your favorite for me, under the name Ortefauchel?"},{"name":"ELDE","text":"Ah, how did you find the shopkeeps? Something in their attitude struck you as amiss, yes?"},{"name":"ELDE","text":"Yes, the merchants are concerned only with the coin of nobles, and pay little heed to any need of the lowborn that is not low price."},{"name":"ELDE","text":"The artisans aren't much better. Those that fail to please the High Houses are overwhelmed with orders. They slap something shoddy together, and sell it to the commoners. As a result, it's difficult for many Ishgardians to find anything but the worst of goods."},{"name":"ELDE","text":"But why, I ask you? Is a commoner's coin lesser than a lord's? Shouldn't merchants offer high-quality products for <span class=\"emphasis\">everyone</span>?"},{"name":"ELDE","text":"I believe we should. We all deserve well-made goods that are within our budgets. So I opened this shop for all Ishgard, from the Hoplon to the Brume."},{"name":"ELDE","text":"Not everyone shares my belief. But if you see the value in my ideas, I'd love to have your expert advice. I do hope we meet again, my friend."},{"name":"SYSTEM","text":"The next leatherworker quest will be available from Elde upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as an artisan would be put to great use in crafting collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."},{"name":"SYSTEM","text":"If you seek even greater tests of your crafting prowess, you would do well to acquire master recipes."},{"name":"SYSTEM","text":"Speak with Guiding Star at Revenant's Toll to learn about them."}],"reward":{"gil":517,"items":[{"num":120,"id":11},{"num":3,"id":12667}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":13}],"questsType":"all","quests":[65602,65964]},"next":[67612]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1012538","obj":{"i":1012538,"n":"Elde","l":2301,"q":5}},{"type":"npc","id":"1012180","obj":{"i":1012180,"n":"Elaisse","l":2301,"q":8}},{"type":"npc","id":"1012181","obj":{"i":1012181,"n":"Mathye","l":2301,"q":6}},{"type":"npc","id":"1012542","obj":{"i":1012542,"n":"Gerhardt","l":2301,"q":3}},{"type":"npc","id":"1012543","obj":{"i":1012543,"n":"Beggarly Fellow","l":2301,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"65602","obj":{"i":65602,"n":"Accept No Imitations","g":140,"l":"Gridania","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67612","obj":{"i":67612,"n":"By Your Bootstraps","g":140,"l":"Ishgard","s":530,"f":1}}]}