{"quest":{"name":"By Your Bootstraps","location":"Ishgard","id":67612,"patch":3.0,"sort":530,"icon":100455,"unlocksFunction":1,"eventIcon":71341,"issuer":1012538,"target":1012538,"involved":[1012180,1012539],"genre":140,"usedItems":[12007],"journal":["Elde is wearing a slightly apologetic look.","Though you have gone to speak with Elde about joining her store as an advisor, the first thing she asks you to do is deliver a donation of coin to a nearby merchant. While you are unsure as to why this falls to you, make your way up the Jeweled Crozier to Mistress Elaisse regardless.","Elaisse accepts the donation, noting that these are funds to support the fledgling Ishgardian Mercantile Guild. As way of thanks, she bids you tell Elde to beware of Gerhardt. Return now with this ominous message.","Elde appreciates Elaisse's concern, but she disregards the warning. Now, she finally asks for your help with her plan. Since the climate changes in Coerthas, it appears that warm footwear is in great demand amongst Ishgard's commoners. Ortefauchel, who seems quite taken with Elde's shop, seconds this opinion. Subsequently, Elde asks that you fashion a pair of high-quality wyvernskin workboots─not to sell, but rather to use as a pattern for her own craftsmen.","Elde is pleased with your boots, as is Ortefauchel, who orders a pair immediately. A passing fellow also takes a fancy to the footwear, going so far as to dub you a “Gridanian master.” Much encouraged, Elde prepares to put her plan into motion.<br><br>※The next leatherworker quest will be available from Elde upon reaching level 55."],"objectives":["Deliver Elde's donation to Elaisse.","Report to Elde.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a pair of wyvernskin workboots <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the pair of wyvernskin workboots <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Elde</span></span>."],"dialogue":[{"name":"ELDE","text":"Ah, my friend! Before we begin, could you take this missive to Mistress Elaisse?"},{"name":"ELDE","text":"I know this isn't a task fit for my advisor, but I'm taking inventory of a new shipment of bags, and I can't be away just now."},{"name":"ELDE","text":"Do you know where Mistress Elaisse is? Oh, dear me, you don't! She's just up the steps."},{"name":"ELAISSE","text":"Hello again, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. What can I do to assist you today, hm?"},{"name":"ELAISSE","text":"Ah, Elde's contribution to the Mercantile Guild. And to judge by the weight of these funds, I daresay selling to the common man is proving profitable."},{"name":"ELAISSE","text":"But her ideas don't sit well with everyone. She needs to be particularly mindful of Gerhardt. Suffice it to say that he's the hammer that pounds down any upstanding nails."},{"name":"ELAISSE","text":"Elde does not want Gerhardt as an enemy. I'll thank you to tell her as much, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"ELDE","text":"Thank you so much, friend! Really, I ought to have gone myself. But I had to find the best bag for this gentleman here, as I promised."},{"name":"ORTEFAUCHEL","text":"Haha, am I to blame for this little debacle? Pardon me. I arrived earlier than planned. I couldn't keep my wife waiting for her present, you see. Ah, and excuse me again─I seem to have interrupted you, adventurer."},{"name":"ELDE","text":"Oh... Well, I appreciate Mistress Elaisse's concern. But I don't care. The time has come to breathe new life into the Crozier, and if Gerhardt doesn't like it, too bad!"},{"name":"ELDE","text":"So...can I count on you to help as my advisor?"},{"name":"ELDE","text":"Wonderful! With an adept of the Leatherworkers' Guild at my side, nothing can stop me! <span class=\"highlight\">Forename</span>─can I call you <span class=\"highlight\">Forename</span>?─thank you for helping."},{"name":"ORTEFAUCHEL","text":"The Leatherworkers' Guild? You know, I've always wanted to ask─are Gridanian boots <span class=\"emphasis\">really</span> as good as everyone says?"},{"name":"ORTEFAUCHEL","text":"Coerthas has been growing colder since the Calamity. Finding warm footwear is hard, and anything cheap is like to send you head over arse! That's been my...tender experience, at least."},{"name":"ELDE","text":"Yes... Commoners do urgently need proper footwear. I had a plan to use wyvern leather, but my craftsmen don't know how to work it."},{"name":"ELDE","text":"But, <span class=\"highlight\">Forename</span>, couldn't you fashion a pair of sturdy workboots? My own craftsmen could use them as a pattern of sorts, and begin production on their own!"},{"name":"ORTEFAUCHEL","text":"Wyvernskin workboots? After my last tumble, I could use a pair myself. I'll await your creation, friend."},{"name":"ORTEFAUCHEL","text":"I'm curious to see what, exactly, a Gridanian leatherworker can do."},{"name":"ELDE","text":"Have you finished cutting and stitching the wyvernskin workboots?"},{"name":"ELDE","text":"Goodness, <span class=\"highlight\">Forename</span>! Even the artisans of the High Houses would struggle to make such splendid footwear! You clearly put great thought into comfort, and wyvern leather will last a lifetime."},{"name":"ELDE","text":"I am very impressed! I'll give these to my own leatherworkers to study forthwith. We've a best seller on our hands─or at our feet. I can feel it!"},{"name":"ORTEFAUCHEL","text":"I'm no artisan, but I like what I see. Sign me up for a pair, if you'd be so good."},{"name":"AUBRENARD","text":"(-Passing Fellow-)Excuse me─I'm looking for a pair of boots, and those caught my eye. Could I try them on?"},{"name":"AUBRENARD","text":"(-Passing Fellow-)My, these are easy on the feet! And I have never seen this design before. Did this <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> here fashion them, perchance?"},{"name":"ELDE","text":"Indeed <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did! This is <span class=\"highlight\">Forename</span>, the consulting artisan for my shop, and a member of the guild in Gridania."},{"name":"AUBRENARD","text":"(-Passing Fellow-)Hmmm. A Gridanian master come to save the feet of Ishgard─perhaps I can find some inspiration in that... Ah, excuse me. Pray, name your price for these boots. I would like to wear them home."},{"name":"ELDE","text":"Oh... Sir, I promise you, I will have many of the same soon, but that particular pair isn't for sale."},{"name":"AUBRENARD","text":"(-Passing Fellow-)Well, that is a pity. Pray save a pair for me when you do put them to market."},{"name":"ELDE","text":"You may consider it done!"},{"name":"ELDE","text":"Two orders in as many bells─this bodes very, very well, <span class=\"highlight\">Forename</span>! Boots based on designs by a “Gridanian master” will sell nicely."},{"name":"ORTEFAUCHEL","text":"And quickly, too. That was Aubrenard, a bard of no small repute. If his admirers see him in your boots, Elde, you'll be fending shoppers off with a stick. Makes me glad I reserved my pair before him."},{"name":"ELDE","text":"Everything is coming together nicely. There is a fair wind coming to the Crozier─one that will waft us to success!"}],"reward":{"gil":567,"items":[{"num":160,"id":11},{"id":11931},{"id":11961,"one":1},{"id":11966,"one":1},{"id":11974,"one":1},{"id":11979,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":13}],"quests":[67611]},"next":[67613]},"partials":[{"type":"npc","id":"1012538","obj":{"i":1012538,"n":"Elde","l":2301,"q":5}},{"type":"npc","id":"1012180","obj":{"i":1012180,"n":"Elaisse","l":2301,"q":8}},{"type":"npc","id":"1012539","obj":{"i":1012539,"n":"Ortefauchel","l":2301,"q":2}},{"type":"item","id":"11931","obj":{"i":11931,"n":"Mythrite Awl","l":90,"c":35455,"t":21}},{"type":"item","id":"11961","obj":{"i":11961,"n":"Holy Rainbow Coatee","l":80,"c":42469,"t":35,"p":9884}},{"type":"item","id":"11966","obj":{"i":11966,"n":"Holy Rainbow Gloves","l":80,"c":48264,"t":37,"p":7096}},{"type":"item","id":"11974","obj":{"i":11974,"n":"Holy Rainbow Bottoms","l":80,"c":45692,"t":36,"p":7603}},{"type":"item","id":"11979","obj":{"i":11979,"n":"Holy Rainbow Shoes","l":80,"c":46540,"t":38,"p":8110}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12007","obj":{"i":12007,"n":"Wyvernskin Workboots","l":80,"c":46539,"t":38,"p":10137}},{"type":"quest","id":"67611","obj":{"i":67611,"n":"Turndown Service","g":140,"l":"Gridania","s":502,"f":1}},{"type":"quest","id":"67613","obj":{"i":67613,"n":"Perfect Pitch","g":140,"l":"Ishgard","s":550,"f":1}}]}