{"quest":{"name":"Breaking New Ground","location":"Ul'dah","id":67616,"patch":3.0,"sort":502,"icon":100448,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1013230,"involved":[1002282,1013231,1013232],"genre":144,"journal":["Adalberta has an attractive proposition for you.","Adalberta has received a request for an expert miner from a company of sellswords currently in Ishgard. The guildmaster strongly urges you to pursue the opportunity. If the thought of prospecting in the north calls to you, speak with Linette to obtain the necessary proof of your affiliation.","Linette hands over the papers, along with her best wishes for your venture. Take the sooty envelope to a knight stationed in front of Fortemps Manor.","Upon realizing who you are, the knight welcomes you to House Fortemps. He informs you that his lord has seen fit to hire foreign sellswords to explore more of Ishgard's territory. You are to join Oschon's Raiders─one such company. Make your way to the Forgotten Knight and speak with Haimirich, the company's captain.","Haimirich welcomes you warmly to Oschon's Raiders, and introduces Hatchling, after a fashion. This youngest member of the company clues you in on a tradition of sorts, and gives you the nickname “Professor.” Haimirich bids you wait for the present, as there is no work to be had. However, he asks that you make yourself ready for when it comes.<br><br>※The next miner quest will be available from Haimirich upon reaching level 53."],"objectives":["Speak with Linette.","Deliver the sooty envelope to a knight outside Fortemps Manor.","Speak with Haimirich at the Forgotten Knight.","#SourceRevision[19242]Aye, these are our stolen muskets.<br>The quartermaster will be pleased."],"dialogue":[{"name":"ADALBERTA","text":"Well, <span class=\"highlight\">Forename</span>, as I live and breathe! I don't suppose you would be interested in a commission, would you? The guild just received a request from sellswords in Ishgard."},{"name":"ADALBERTA","text":"I know how that sounds, but it's a company that's been charged with doing a mineral survey, and they need an expert's eye. Their captain is an Ul'dahn, too, one who's familiar with the guild's way of doing things."},{"name":"ADALBERTA","text":"Now, Ishgard's territory is untamed and dangerous. But it's worth it to go where no miner has gone before, and I urge you to accept. Linette can supply proof that you're a genuine guild member if you do."},{"name":"ADALBERTA","text":"You should consider the opportunity before you, <span class=\"highlight\">Forename</span>. If you do decide it's worth your time, speak with Linette for the necessary papers."},{"name":"LINETTE","text":"I take it you're the one to explore the mineral wealth of Ishgard? Excellent! Well, the mercenaries who sent for you are employed by one of the High Houses. These papers will serve as proof of your position."},{"name":"LINETTE","text":"As you will technically be employed by House Fortemps, I think the courteous thing to do is go to their manor and speak with a knight. The best of luck to you!"},{"name":"LINETTE","text":"I wonder if they will escort you inside Fortemps Manor after you deliver the papers..."},{"name":"FORTEMPSKNIGHT02080","text":"Hm? What brings an adventurer to our doorstep?"},{"name":"FORTEMPSKNIGHT02080","text":"Of course, the expert from the Miners' Guild. Welcome, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, welcome."},{"name":"FORTEMPSKNIGHT02080","text":"You are one of a very few outsiders with the honor of serving House Fortemps. Indeed, the count has but recently seen fit to hire foreign sellswords for their experience and knowledge of other lands."},{"name":"FORTEMPSKNIGHT02080","text":"You are to work with Oschon's Raiders, one such company under our banner. Their captain, Haimirich, can be found between jobs at the Forgotten Knight. No doubt he is enjoying the excellent ale."},{"name":"FORTEMPSKNIGHT02080","text":"Whatever his profession, I do think Haimirich a man of honor. I have even joined him for a cup at the Forgotten Knight."},{"name":"BABYCHOCO","text":"Hm? Do I owe ye money or somethin'?"},{"name":"HEIMIRICH","text":"You're the one come to help us with the mineral survey? Pleasure to have you, my friend. I'm Haimirich, captain of Oschon's Raiders."},{"name":"HEIMIRICH","text":"You'll like workin' with us. Me an' the lads, we take pride in what we're doin'. Wars are lost for want o' resources as often as for want o' valor, an' we can't all be dragonslayers."},{"name":"HEIMIRICH","text":"That attitude's won us the count's trust. So when the jobs come down from House Fortemps, I'm the one who decides how they get done. Which is to say, my word's the only one that matters. Are you willin' to take orders from me?"},{"name":"HEIMIRICH","text":"Hah, good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! 'Course, I'll keep you clear o' monsters an' the like. But trouble's got a nasty habit o' findin' us Raiders. The time might come when you've got to swing that pickaxe in self-defense."},{"name":"BABYCHOCO","text":"There's all manner o' wild beasts out there. Leave 'em to the cap'n an' me─you just worry about not pissin' yer own britches! Har har har!"},{"name":"HEIMIRICH","text":"Excuse him, <span class=\"highlight\">Forename</span>. He's jus' young. An' stupid. Very, very stupid. He's so new to this life that he's almost got eggshell stuck to his fat little head. So we call him Hatchlin'."},{"name":"BABYCHOCO","text":"&lt;sigh&gt; Cap'n's got <span class=\"emphasis\">fun</span> nicknames for all of us. Tradition, he calls it. So what's yours to be? You're a professor or somethin', right? So...what about “Professor”?"},{"name":"HEIMIRICH","text":"...Bloody simple, isn't it? But that'll make for easy rememberin'. All right, Professor it is! An' that wraps up your initiation. We've nothin' to do for the time bein'. A job'll come from House Fortemps soon enough, though, so make yourself ready for when it does."},{"name":"SYSTEM","text":"The next miner quest will be available from Haimirich upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as a forager would be put to great use in gathering collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."}],"reward":{"gil":1057,"items":[{"num":100,"id":8},{"num":100,"id":11},{"num":3,"id":12668}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":17}],"questsType":"all","quests":[66182,65964]},"next":[67617]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1013230","obj":{"i":1013230,"n":"Haimirich","l":2300,"q":5}},{"type":"npc","id":"1002282","obj":{"i":1002282,"n":"Linette","l":41,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1013231","obj":{"i":1013231,"n":"Hatchling","l":2300,"q":1}},{"type":"npc","id":"1013232","obj":{"i":1013232,"n":"House Fortemps Knight","l":2301,"q":1}},{"type":"item","id":"12668","obj":{"i":12668,"n":"Commercial Survival Manual","l":1,"c":26152,"t":63}},{"type":"quest","id":"66182","obj":{"i":66182,"n":"Canyon of Regret","g":144,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67617","obj":{"i":67617,"n":"Sellspade","g":144,"l":"Ishgard","s":530,"f":1}}]}