{"quest":{"name":"Perfect Pitch","location":"Ishgard","id":67613,"patch":3.0,"sort":550,"icon":100455,"unlocksFunction":1,"eventIcon":71341,"issuer":1012538,"target":1012538,"involved":[1012542,1012544],"genre":140,"usedItems":[10875],"journal":["Though her shop seems to be bustling, Elde looks concerned.","Elde has garnered much attention for her shop with the wyvernskin workboots based on your design, but unfortunately cannot seem to find the leather to produce them in quantity. However, Ortefauchel overheard Gerhardt speaking of wyvern skin, and Elde asks you to visit the aging merchant to find out what he is up to.","Gerhardt says, with no small glee, that he has purchased every last scrap of wyvern skin in Ishgard. Moreover, he has forbidden every supplier from selling to Elde. Bear these ill tidings to her.","Elde receives the news with some shock, but stands strong and vows to simply move on to her next product─fashionable, functional leggings. Such footwear is rare in the Holy See, and she believes it will sell very well. She bids you fashion high-quality dhalmelskin leggings of scouting to become another template for her own craftsmen.","Greatly pleased with your dhalmelskin leggings, Elde immediately sets her own craftsmen to work fashioning a like design. With these in hand, she then lays out her plans for once again garnering attention, and beating Gerhardt─enlisting Aubrenard to speak to the footwear's finer points. Make your way to the Forgotten Knight, and see if you cannot sway the bard with the complimentary pair of boots.","Aubrenard is quite taken with the boots, and agrees to act as your spokesman. Strumming his lyre, he draws a great crowd and gives a speech about the quality and designer of his new footwear that would put a salesman to shame. His fans go wild, and, with a cocksure smile upon his lips, the bard bids you tell Elde she will not want for customers.","Elde is heartened by the news, and goes on to tell you her vision: an Ishgard wherein even the lowborn are given the chance to dress as well as the lords and ladies. However, she cannot see her vision become reality without working long and hard, and asks that you continue to aid in her enterprise.<br><br>※The next leatherworker quest will be available from Elde upon reaching level 58."],"objectives":["Speak with Gerhardt.","Report to Elde.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a pair of dhalmelskin leggings of scouting <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the pair of dhalmelskin leggings of scouting <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Elde</span></span>.","Deliver the complimentary pair of boots to Aubrenard at the Forgotten Knight.","Report to Elde."],"dialogue":[{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>! There's been a flood of people buying wyvernskin workboots. Why, I've even hired a number of new craftsmen because of the sales!"},{"name":"ELDE","text":"However, I can't seem to find more wyvern leather. When I asked my usual supplier, he turned me down without a word as to why."},{"name":"ORTEFAUCHEL","text":"Strange. And what's stranger, I heard Gerhardt taking orders for wyvern leather goods on the way here. He wasn't quiet about it, either."},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, would you see what Gerhardt is up to? I doubt he'd even give me the time of day."},{"name":"ELDE","text":"Mistress Elaisse did caution me about Gerhardt, <span class=\"highlight\">Forename</span>. Perhaps I ought to have heeded her warning..."},{"name":"GERHARDT","text":"...You're no customer. Nor a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of Ishgard. So, you must be the so-called “Gridanian master” that naive girl hired. Out with it, then─what do you want?"},{"name":"GERHARDT","text":"Wyvern leather? Yes, I have wyvern leather. I've bought every last scrap of it, in fact!"},{"name":"GERHARDT","text":"I needed it. All of it. You would do well to remember that business is war, and the victor is he who controls the supplies."},{"name":"GERHARDT","text":"And don't bother looking for other suppliers. I used my clout with the merchants, and not a one will deal with Elde. Now, I bid you a good day!"},{"name":"ELDE","text":"What? Well, if it's a war he wants, it's a war he'll get!"},{"name":"ELDE","text":"But he has won this battle. We'll have to change our strategy, and I know just how. After the wyvernskin boots, I'd meant to introduce something more stylish─fashionable and functional."},{"name":"ELDE","text":"I've been eyeing leggings. From a merchant's perspective, of course─they're rarely seen in Ishgard. We'll revisit the material, and then unveil a daring new design!"},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>, what are your thoughts about dhalmelskin? I think the patterning is subtle, but will stand out when dyed, and the hide itself is quite hardy. Could you fashion a fine pair of leggings of scouting?"},{"name":"ELDE","text":"My craftsmen have never worked dhalmelskin─but with your fine example, I have no doubt they can do great things with it!"},{"name":"ELDE","text":"Could you make a pair of dhalmelskin leggings of scouting, please? My own workers are less adept than you, and so the finer your work, the more they will learn from it."},{"name":"ELDE","text":"These are everything I imagined! Why, I daresay these will be the crown jewel in our lineup, so amazed will be our customers!"},{"name":"ELDE","text":"...But only if we start selling before Gerhardt steals the idea. There's no time to waste!"},{"name":"ELDE","text":"My craftsmen have come up with this design based on yours, <span class=\"highlight\">Forename</span>. They're more boots than leggings, but the style is similar."},{"name":"ELDE","text":"Now, we'll get to work making these in number. And I've an idea of how to drum up interest quickly─Aubrenard, the bard."},{"name":"ELDE","text":"He seemed enchanted with your last creation, <span class=\"highlight\">Forename</span>. If you offer these to him yourself, I've little doubt he'll accept!"},{"name":"ELDE","text":"I believe you can find him in the Forgotten Knight. Good luck, my friend!"},{"name":"ELDE","text":"I wonder if Aubrenard is at the Forgotten Knight for the ale, or the admirers?"},{"name":"AUBRENARD","text":"The Gridanian master in the flesh! To what do I owe the pleasure, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"AUBRENARD","text":"My, these are well-crafted boots! Mistress Elde is a most generous soul, giving them away for free, and 'twould be my pleasure to spread word of her shop."},{"name":"AUBRENARD","text":"My lords and ladies, gentlemen and gentlewomen, lend me your ears! Allow me to introduce the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who stands head and shoulders above all others─the Leatherworkers' Guild's own incomparable <span class=\"highlight\">Forename</span>!"},{"name":"AUBRENARD","text":"And by some divine guidance, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is come to Ishgard, to offer us <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> latest and greatest designs!"},{"name":"GERHARDT","text":"Aubrenard? He's speaking on Elde's behalf now!? Bah!"},{"name":"AUBRENARD","text":"Behold these, the fruits of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> genius, the finest in footwear and the best in boots! Order your very own pair today, at Elde's shop along the Jeweled Crozier!"},{"name":"AUBRENARD","text":"...Hardly my finest work, but I believe that little taste has whet their appetites, eh?"},{"name":"ELDE","text":"<span class=\"highlight\">Forename</span>! So many customers have come to order boots that my fingers hurt from writing down their names. Tell me, what did Aubrenard say to inspire people so?"},{"name":"ELDE","text":"Oh. Oh my. I didn't expect him to use <span class=\"emphasis\">you</span> as the selling point... I imagine you'll be quite famous after this."},{"name":"ORTEFAUCHEL","text":"That is the way of things, isn't it? The bard may have hastened the process, but skilled artisans are fated for fame one way or another."},{"name":"ELDE","text":"Yes, yes, that is true! It's all a matter of what is deserved─the artisan deserves acclaim, and the customers deserve the best products, and I will ensure it is so!"},{"name":"ORTEFAUCHEL","text":"I've never seen you so worked up, Elde. Why now?"},{"name":"ELDE","text":"Er... No reason. I am just a bit tired from the flood of orders today."},{"name":"ORTEFAUCHEL","text":"Hmmm... Well, you're giving the people quality that once only nobles could afford. I suppose breaking down the old barriers is tiring."},{"name":"ELDE","text":"...I'm well aware that this is a gamble. But doesn't everyone want to dress well? I know it sounds naive, but deep down, I think we all wish to look our best."},{"name":"ELDE","text":"At its heart, my mission is to give everyone that chance. And today, I have been vindicated!"},{"name":"ELDE","text":"But all this will be for nothing if we cannot make good on our promises. I will have my craftsmen working through the night. And I'll no doubt need you again before long, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":612,"items":[{"num":200,"id":11},{"id":11888},{"id":11962,"one":1},{"id":11975,"one":1},{"id":11980,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":13}],"quests":[67612]},"next":[67614]},"partials":[{"type":"npc","id":"1012538","obj":{"i":1012538,"n":"Elde","l":2301,"q":5}},{"type":"npc","id":"1012542","obj":{"i":1012542,"n":"Gerhardt","l":2301,"q":3}},{"type":"npc","id":"1012544","obj":{"i":1012544,"n":"Aubrenard","l":2300,"q":1}},{"type":"item","id":"11888","obj":{"i":11888,"n":"Titanium Creasing Knife","l":100,"c":35418,"t":20,"p":14572}},{"type":"item","id":"11962","obj":{"i":11962,"n":"Ramie Doublet of Crafting","l":100,"c":42471,"t":35,"p":15444}},{"type":"item","id":"11975","obj":{"i":11975,"n":"Ramie Skirt","l":100,"c":45694,"t":36,"p":9504}},{"type":"item","id":"11980","obj":{"i":11980,"n":"Dhalmelskin Shoes","l":100,"c":46542,"t":38,"p":12672}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"10875","obj":{"i":10875,"n":"Dhalmelskin Leggings of Scouting","l":133,"c":46522,"t":38,"p":16851}},{"type":"quest","id":"67612","obj":{"i":67612,"n":"By Your Bootstraps","g":140,"l":"Ishgard","s":530,"f":1}},{"type":"quest","id":"67614","obj":{"i":67614,"n":"From the Hoplon to the Brume","g":140,"l":"Ishgard","s":580,"f":1}}]}