{"quest":{"name":"The Same Vein","location":"Ishgard","id":67618,"patch":3.0,"sort":550,"icon":100448,"unlocksFunction":1,"eventIcon":71341,"issuer":1013230,"target":1013230,"involved":[1002298,1013932,1013933,1013934,1013935,1013939],"genre":144,"usedItems":[12537],"journal":["Haimirich has a job for you and you alone.","It seems that House Fortemps will be leading a new push against Dravania, and needs to armor itself for a fierce battle. For this purpose, only titanium will serve. However, it is unclear where ore can be mined in sufficient quantity to fulfill the knights' needs. Haimirich turns to you for an answer, and, given that you do not seem to have one, bids you seek the counsel of your guildmaster. Armed with a sample of titanium, make your way to Ul'dah and see what Adalberta has to say.","You find Wide Gulley speaking with Adalberta. Though you came to speak with the latter, it is the former who tells you where to find the titanium. It seems that some years ago, Deep Canyon came across a similar sample of the metal in the hands of a hunter who made his living in the Dravanian forelands. Wide Gulley swears that the chunk of metal you brought is identical to the one the hunter had, and Adalberta theorizes that the ore must originate in the area. Return now to Haimirich at the Forgotten Knight with this piece of information.","Upon hearing it was a hunter who found the first sample of titanium, Haimirich exclaims that the vein of ore you seek must be somewhere near the Chocobo Forest. Though this is hardly definitive, Haimirich is willing to mobilize Oschon's Raiders on this hunch. Rendezvous with them in the Dravanian forelands.","Haimirich dispatches his men to mind the perimeter while you search for the presence of a rich lode beneath the trees. Mine ten chunks of titanium ore from nearby mineral deposits, and deliver them to the captain when you are done.","Haimirich happily takes the ore, and, after Muscles returns from clearing the path homewards, bids you all return to Ishgard. Make your way back to the Holy See and speak with Haimirich there.","You find Haimirich both happy and worried. The cause is Hatchling. The captain tells you that the lad has a bright future, but only if he can overcome his own pride. Failing that, he may very well find himself in a situation he cannot outlive. Though you feel there is more to this story, Haimirich suddenly changes subjects, and you sense that now is not the time to ask further.<br><br>※The next miner quest will be available from Haimirich upon reaching level 58."],"objectives":["Show the sample of titanium ore to Adalberta.","Return the sample of titanium ore to Haimirich in Ishgard.","Speak with Haimirich in the Chocobo Forest.","<span class=\"alternative-container\"><span class=\"alternative\">Mine titanium ore</span><span class=\"alternative\">Deliver the chunks of titanium ore to Haimirich</span></span>.","Speak with Haimirich in Ishgard."],"dialogue":[{"name":"HEIMIRICH","text":"Professor! I was jus' lookin' for you. Tell me, where do you find quality titanium?"},{"name":"HEIMIRICH","text":"...Maybe I should start at the beginnin'. House Fortemps is to take the van in a new offensive against the Dravanians alongside the Temple Knights."},{"name":"HEIMIRICH","text":"'Tis a risky gambit, an' they'll need the very best gear to succeed─blades that won't blunt against dragon scale an' armor that'll withstand Dravanian claws. Normal metal jus' won't cut it."},{"name":"HEIMIRICH","text":"Which takes me back to titanium. The smithies tell me it's the only metal that'll serve, an' they need a proper reserve to armor all the knights. So do you happen to know where we might find a goodly vein of ore?"},{"name":"HEIMIRICH","text":"...Your expression's tellin' me you don't. Well, it's a good thing I'm prepared, then! Here, this is a sample o' titanium ore. Take that to your guildmaster an' see if she can tell you anythin'."},{"name":"HEIMIRICH","text":"Surely your guildmaster'll know where to find titanium. Or at the very least, how to find a proper lode."},{"name":"HEIMIRICH","text":"Jus' show her that sample o' the metal I gave you, eh?"},{"name":"WIDEGULLEY","text":"<span class=\"highlight\">Forename</span>! I hear you're breakin' new ground up north!"},{"name":"ADALBERTA","text":"<span class=\"highlight\">Forename</span>! Gods, it feels like an age since we last spoke. Tell me, how are you enjoying prospecting up north? You must have a tale or two."},{"name":"ADALBERTA","text":"...More titanium as this? Oh. &lt;sigh&gt; Why does no one ever just come to visit with me? All work and no play for the guildmaster."},{"name":"WIDEGULLEY","text":"Let me take a look, Adalberta. There's somethin' about this here sample..."},{"name":"ADALBERTA","text":"Work, work, work─is that all you can think of!? Gods, the two of you... Fine, take it."},{"name":"WIDEGULLEY","text":"<span class=\"highlight\">Forename</span>, you're in need of a location to mine more o' these, yes?"},{"name":"WIDEGULLEY","text":"The thing is, I've seen this same ore before. 'Twas back when I was little more'n a cub. Someone brought it to Father for appraisal, a hunter who found it while workin' in the Dravanian forelands."},{"name":"WIDEGULLEY","text":"Father had never seen its like before, but he recognized it as titanium. I tell you, this sample is the spittin' image of that one."},{"name":"ADALBERTA","text":"I am glad you were looking so closely, Wide Gulley!"},{"name":"ADALBERTA","text":"I remember now. Deep Canyon did tell me of that ore, and said it was extremely pure. And if the hunter found it in the Dravanian forelands, the reserve may well be there!"},{"name":"WIDEGULLEY","text":"That said, titanium is rare, an' the hunter may've just found it by chance. But go an' see what you can dig up. If you do find a vein, maybe that'll help settle my debt to you."},{"name":"ADALBERTA","text":"If you find a vein of titanium in the Dravanian forelands, do let me know."},{"name":"WIDEGULLEY","text":"Given all I owe you for helpin' with my father, I'm hopin' I've been o' help to you."},{"name":"HEIMIRICH","text":"Professor, have you found out anythin'?"},{"name":"HEIMIRICH","text":"In the Dravanian forelands, eh? Hm... Then the deposit's like to be in the Chocobo Forest. Hunters don't leave the area for fear of dragons."},{"name":"HEIMIRICH","text":"'Course, two chunks o' titanium don't mean a proper lode. But it's a good lead, an' I'm willin' to bet on it."},{"name":"HEIMIRICH","text":"Hah! 'Tis time to summon the lads! We'll see you in the Chocobo Forest, Professor!"},{"name":"HEIMIRICH","text":"We'll see you in the Chocobo Forest, Professor!"},{"name":"BABYCHOCO","text":"We was waitin' for you, Professor!"},{"name":"STRONGARM","text":"Yes?"},{"name":"HEIMIRICH","text":"Good, that's the lot of us Raiders! The lads've all got their orders, so let's get to it!"},{"name":"BABYCHOCO","text":"Cap'n, I don't understand─why ain't you havin' the Raiders what know the lay of the land guard our flank!?"},{"name":"HEIMIRICH","text":"Why? Why!? ...That's a good question, actually. Muscles, you take the perimeter."},{"name":"HEIMIRICH","text":"All right, Professor, you know the drill─if you can find ten samples o' titanium hereabouts, that'll be proof enough of a good lode of ore 'neath these trees."},{"name":"HEIMIRICH","text":"Hatchlin', hang back with me. I'll need a runner if I need to change my orders. Now, lads, move out!"},{"name":"BABYCHOCO","text":"I'm doin' me best to help out the cap'n. He'll have a much worse nickname for me if I muck it up, believe you me!"},{"name":"STRONGARM","text":"Tread carefully, Professor─the beasts are restless..."},{"name":"HEIMIRICH","text":"Have you found the ten chunks o' ore? ...<span class=\"emphasis\">Can</span> you find 'em?"},{"name":"HEIMIRICH","text":"Hah! You've rightly earned your pay today, Professor! This ore <span class=\"emphasis\">proves</span> there's a lode o' titanium here worth minin'."},{"name":"HEIMIRICH","text":"An' the lads've come through with little more'n a scratch on 'em. I'll have my head held high when I tell the count!"},{"name":"BABYCHOCO","text":"Slow down, Cap'n─Muscles ain't come back yet! Said he was goin' to clear the road home, an' went off on his lonesome!"},{"name":"HEIMIRICH","text":"I've given Muscles leave to do as he sees fit. The man's never been beat by monsters or men, an' his service record's spotless. He can handle himself jus' fine."},{"name":"BABYCHOCO","text":"Why do you keep me on a bloody leash, then? I've never been beaten by monsters neither!"},{"name":"HEIMIRICH","text":"Aye, an' if that holds true for ten namedays, I'll think on it! But if I let you off the leash now, you're like to get killed. You're jus' too young, Hatchlin'."},{"name":"BABYCHOCO","text":"...Says you, Cap'n."},{"name":"STRONGARM","text":"The monsters are no more. They will not come again for a time."},{"name":"HEIMIRICH","text":"That's a good man, Muscles. Now, let's get back to Ishgard."},{"name":"HEIMIRICH","text":"House Fortemps was right pleased with what we did today─an' that thanks is owed to you."},{"name":"HEIMIRICH","text":"My Raiders are runnin' like a proper army these days─everyone understands their place, an' does their duty. Aye, even Hatchlin'. The lad's got a bright future...if I can buff the edges off of him."},{"name":"HEIMIRICH","text":"The young, eh? Bunch of cocky arses. I've seen more'n a few lose their lives over stupid quarrels of honor..."},{"name":"HEIMIRICH","text":"Er... Heh, not worth worryin' over the dead, is it? Anyroad, Professor, there'll be new work comin'. Till then, jus' keep on minin'!"},{"name":"SYSTEM","text":"In breaking new ground as a miner, you have learned “Luck of the Mountaineer”!"}],"reward":{"gil":2795,"action":4081,"items":[{"id":11904},{"id":11985,"one":1},{"id":11990,"one":1},{"id":12003,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":17}],"quests":[67617]},"next":[67619]},"partials":[{"type":"npc","id":"1013230","obj":{"i":1013230,"n":"Haimirich","l":2300,"q":5}},{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1013932","obj":{"i":1013932,"n":"Wide Gulley","l":41,"q":1}},{"type":"npc","id":"1013933","obj":{"i":1013933,"n":"Haimirich","l":2000,"q":1}},{"type":"npc","id":"1013934","obj":{"i":1013934,"n":"Hatchling","l":2000,"q":1}},{"type":"npc","id":"1013935","obj":{"i":1013935,"n":"Muscles","l":2000,"q":1}},{"type":"npc","id":"1013939","obj":{"i":1013939,"n":"Muscles","l":2000,"q":1}},{"type":"action","id":"4081","obj":{"i":4081,"n":"Luck of the Mountaineer","c":1029,"j":16,"t":6,"l":55}},{"type":"item","id":"11904","obj":{"i":11904,"n":"Hardsilver Dolabra","l":100,"c":38017,"t":28,"p":14889}},{"type":"item","id":"11985","obj":{"i":11985,"n":"Dhalmelskin Bush Hat","l":100,"c":41272,"t":34,"p":12474}},{"type":"item","id":"11990","obj":{"i":11990,"n":"Dhalmelskin Vest","l":100,"c":42470,"t":35,"p":15444}},{"type":"item","id":"12003","obj":{"i":12003,"n":"Ramie Trousers of Gathering","l":100,"c":45693,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12537","obj":{"i":12537,"n":"Titanium Ore","l":136,"c":21222,"t":48}},{"type":"quest","id":"67617","obj":{"i":67617,"n":"Sellspade","g":144,"l":"Ishgard","s":530,"f":1}},{"type":"quest","id":"67619","obj":{"i":67619,"n":"Digging Deeper","g":144,"l":"Ishgard","s":580,"f":1}}]}