{"quest":{"name":"Digging Deeper","location":"Ishgard","id":67619,"patch":3.0,"sort":580,"icon":100448,"unlocksFunction":1,"eventIcon":71341,"issuer":1013230,"target":1013230,"involved":[1013943,1013944,1013945,1013949,1013950,1013953],"genre":144,"usedItems":[12535],"journal":["New orders await you and Oschon's Raiders.","Haimirich informs you that your mission today is one of exploration. It appears that your successes have led to further prestige for House Fortemps, and this has agitated old rivalries amongst the nobility. Subsequently, your employers are called upon to do even more, and thus you and Oschon's Raiders have been asked to find out what, if anything, lies beneath the ground of the Makers' Quarter. Make your way to the Dravanian hinterlands and rendezvous with Haimirich.","You arrive to find that Haimirich has hired a white-haired naturalist to aid with your survey. Since the area is largely unexplored─by Ishgardians, at any rate─the captain asks that you find three mining points, and see if you can dig up any samples.","You have found three samples of some metal unknown to you. Deliver them to Haimirich.","Upon examining the samples, the naturalist lets out an astounded cry─all three contain traces of hardsilver. The metal is rare and extremely valuable, he tells you. Haimirich is greatly pleased to hear this, and bids you mine ten chunks of ore. As before, dig at nearby mineral deposits and return to Haimirich with the fruit of your quarrying.","While Haimirich is thankful for the hardsilver, he has grown worried about the Dravanians in the surrounding area. However, just before he can sound the retreat, Muscles tells him that Hatchling has chased down some monsters by himself. The boy returns to a furious captain, who berates him for his irresponsibility. With the mood grown somber, Haimirich tells you brusquely to find your own way back to Ishgard. Return to the Holy See, and speak with Haimirich at the Forgotten Knight in hopes that he will be in better spirits.","Haimirich regrets his earlier outburst. He admits that he is hard on Hatchling because he sees potential in the boy. Moreover, the captain does not wish him to die as his own brother did. In any case, he bids you await the next job.<br><br>※The next miner quest will be available from Haimirich upon reaching level 60."],"objectives":["Speak with Haimirich in the Makers' Quarter.","Investigate the mining points.","Deliver the chunks of unidentifiable ore to Haimirich.","<span class=\"alternative-container\"><span class=\"alternative\">Mine hardsilver ore</span><span class=\"alternative\">Deliver the chunks of hardsilver ore to Haimirich</span></span>.","Speak with Haimirich in Ishgard."],"dialogue":[{"name":"HEIMIRICH","text":"We've got new marchin' orders, Professor. This time, we're to explore some uncharted land, an' see if there's anythin' o' mineral value beneath it."},{"name":"HEIMIRICH","text":"Problem is, this land's in the Dravanian hinterlands─jus' beyond the Horde. An' they're not overly fond of us, in case you forgot."},{"name":"HEIMIRICH","text":"Now, you may be wonderin' how we landed this job. Some don't take kindly to House Fortemps's successes, <span class=\"emphasis\">our</span> successes. These people're demandin' ridiculous things now, an' the count has called on us to deliver."},{"name":"HEIMIRICH","text":"But it's not all bleak news─word is that there's a little settlement o' 'venturers sprung up in the hinterlands. The lads an' I will go on ahead, an' see if they'll let us set up camp there."},{"name":"HEIMIRICH","text":"We'll meet in the Makers' Quarter─ought to be safe enough there. Jus' come when you're ready."},{"name":"HEIMIRICH","text":"That one knight talked o' goin' by airship, but I told him none of us need the coddlin'. But be careful o' the dragons, all the same."},{"name":"HEIMIRICH","text":"Once you've gotten your tools together, come to the Makers' Quarter."},{"name":"BABYCHOCO","text":"What the hells're the nobles thinkin', sendin' us into danger like this!? There's only so many of us Raiders!"},{"name":"STRONGARM","text":"Yes?"},{"name":"DOCTOR02083","text":"Ah, well met, my dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>. Haimirich practically sang your praises all the way here!"},{"name":"HEIMIRICH","text":"Professor, I'm right glad to see you made it here safe."},{"name":"HEIMIRICH","text":"Now, to work. The Holy See's got no idea what's here. Could be dirt, or it could be gold. So, we're to find out what minerals're 'neath the ground."},{"name":"HEIMIRICH","text":"My friend here is a proper naturalist. We've got a professor already, so I've taken to callin' him Rocky. Heh, <span class=\"emphasis\">two</span> academics─we're movin' up in the world, lads!"},{"name":"HEIMIRICH","text":"Now, Rocky'll need somethin' to examine. Diggin' it up's your job, Professor. Get a few samples─three should do it─an' bring 'em back here to me. Godsspeed!"},{"name":"HEIMIRICH","text":"Hm? Why three places? Rocky told me three'd be best. Jus' don't be tardy, eh?"},{"name":"BABYCHOCO","text":"This job's bound to be dangerous, Professor. Watch yer back, eh?"},{"name":"STRONGARM","text":"Yes?"},{"name":"DOCTOR02083","text":"My life's work has been the study of minerals. Why, you might even say I “mine” them for secrets, heh heheh...heh... Forgive me, <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>, I'm a bit nervous. It's my first time out in the field."},{"name":"SYSTEM","text":"You obtain a chunk of unidentifiable ore from the mining point."},{"name":"HEIMIRICH","text":"Have you found somethin'?"},{"name":"HEIMIRICH","text":"That's my Professor! Now, Rocky, earn your keep. What are these samples?"},{"name":"DOCTOR02083","text":"Dear me! These all contain hardsilver! It's a metal worth twice its weight in gold! Why, if you but dig a little deeper, you might well find a mountain of the stuff!"},{"name":"HEIMIRICH","text":"Hah! That's music to my ears! Professor, let's see if we can't prove there <span class=\"emphasis\">is</span> a mountain 'neath our feet. You know what to do─find me ten chunks o' ore!"},{"name":"DOCTOR02083","text":"Bless my soul, my dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>, hardsilver!"},{"name":"HEIMIRICH","text":"If there's no hardsilver to be had, that's fine, Professor. Jus' don't dally. A Dravanian patrol might swing through here any moment..."},{"name":"HEIMIRICH","text":"You're a wonder, Professor! Well, Raiders, let's pack up an' get the hells out o' he─"},{"name":"STRONGARM","text":"Captain! We were attacked by mechanical men, and Hatchling gave chase!"},{"name":"HEIMIRICH","text":"What? He didn't go by himself, did he!?"},{"name":"STRONGARM","text":"He did."},{"name":"HEIMIRICH","text":"That stupid, stupid boy! If he comes back alive, I'll beat him bloody!"},{"name":"BABYCHOCO","text":"Sorry fer keepin' ye waitin', Cap'n! We don't need to fear them monsters no more─though it weren't easy puttin' 'em down!"},{"name":"HEIMIRICH","text":"You arrogant little arse! I told you not to run off on your own! Didn't that penetrate your thick skull!?"},{"name":"BABYCHOCO","text":"Wh-What choice'd I have, Cap'n!? They were makin' fer the camp─'twas us or them!"},{"name":"HEIMIRICH","text":"Then why not warn us!? Was your linkpearl broke? Don't tell me you didn't have the time!"},{"name":"BABYCHOCO","text":"B-But, Cap'n, I...I... Fine. I'm sorry! No bloody good deed goes unpunished in this swivin' company..."},{"name":"HEIMIRICH","text":"...We're done here. Get yourself home to Ishgard, Professor. I'll see you there."},{"name":"HEIMIRICH","text":"Professor, thank you for today. You always do what I ask o' you─keep a level head, an' get your job done."},{"name":"HEIMIRICH","text":"Sorry about that business with Hatchlin'. Shouldn't have been so hard on the boy. I jus'...I jus' want him to grow up proper. Like my little brother should've."},{"name":"HEIMIRICH","text":"He was a Raider, too. Looked a fair bit like Hatchlin', as it happens. But he's long gone."},{"name":"HEIMIRICH","text":"I'll bet everyone an' their mother's got a sad story, eh? There's sure to be a new job comin' before long. I'll jus' drown me troubles till then."},{"name":"SYSTEM","text":"To be deleted."}],"reward":{"gil":1782,"items":[{"id":11905},{"id":12669},{"id":5687,"one":1},{"id":5692,"one":1},{"id":5697,"one":1}],"xp":1713600},"reqs":{"jobs":[{"lvl":58,"id":17}],"quests":[67618]},"next":[67620]},"partials":[{"type":"npc","id":"1013230","obj":{"i":1013230,"n":"Haimirich","l":2300,"q":5}},{"type":"npc","id":"1013943","obj":{"i":1013943,"n":"Haimirich","l":2001,"q":1}},{"type":"npc","id":"1013944","obj":{"i":1013944,"n":"Hatchling","l":2001,"q":1}},{"type":"npc","id":"1013945","obj":{"i":1013945,"n":"Muscles","l":2001,"q":1}},{"type":"npc","id":"1013949","obj":{"i":1013949,"n":"Accompanying Naturalist","l":2001,"q":1}},{"type":"npc","id":"1013950","obj":{"i":1013950,"n":"Muscles","l":2001,"q":1}},{"type":"npc","id":"1013953","obj":{"i":1013953,"n":"Hatchling","l":2001,"q":1}},{"type":"item","id":"11905","obj":{"i":11905,"n":"Titanium Pickaxe","l":120,"c":38019,"t":28,"p":17867}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"item","id":"5687","obj":{"i":5687,"n":"Gatherer's Guerdon Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Gathering","category":2}}},{"type":"item","id":"5692","obj":{"i":5692,"n":"Gatherer's Guile Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Perception","category":2}}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"item","id":"12535","obj":{"i":12535,"n":"Hardsilver Ore","l":142,"c":21223,"t":48}},{"type":"quest","id":"67618","obj":{"i":67618,"n":"The Same Vein","g":144,"l":"Ishgard","s":550,"f":1}},{"type":"quest","id":"67620","obj":{"i":67620,"n":"The Hole Truth","g":144,"l":"Ishgard","s":600,"f":1}}]}