{"quest":{"name":"Tinker, Seeker, Soldier, Spy","location":"The Dravanian Hinterlands","id":67628,"patch":3.01,"sort":3,"icon":112097,"unlocksFunction":1,"eventIcon":71341,"issuer":1014407,"target":1014409,"involved":[1014402,1014408],"genre":16,"journal":["Judging by the twinkle in Biggs's eye, Cid has a plan.","Cid reveals that something about the Illuminati's scheme has been puzzling him, namely their decision to send coded communications disclosing the secret to entering Gordias. For whom were these messages intended? The answer, he concludes, is a spy─an agent who needs a way to re-enter the stronghold. Accordingly, he continues, he has ordered that the area around the primal's hand be cleared, hoping to entice Illuminati operatives into revealing themselves. Scant moments later, Wedge receives word that Brayflox has been seen entering the colossus. You can only conclude that she is not who she seems. Join Cid and Mide in pursuing the impostor into the giant.<br><br>※The Arm of the Father can be accessed via the Duty Finder.","You have pursued the spy through Gordias. Now follow her to the next area.","Before you can apprehend the spy, Quickthinx Allthoughts and his guards emerge from a nearby corridor and gun her down. Betraying no hint of remorse, the Illuminati Grand Master then announces that he has been searching for the “missing piece” required to make the world perfect, prompting Cid to fire back that his perfect world will be nothing more than a dead star. Alas, no words will dissuade the Illuminati from their course, and the goblins soon depart to enact their plan...<br><br>Sensing Cid's frustration, Mide reveals that she knows how to shut down the primal's core, and Roundrox adds that she can assist you in identifying its location. Accordingly, Cid bids you make your way outside and prepare for what promises to be an eventful mission. Meet with Mide at Bigwest Shortstop and discuss how best to proceed.","Mide reaffirms that which you already know: that the Illuminati and their primal must be stopped at all costs. Steel yourself for the coming battle, and press on into Gordias when you are ready."],"objectives":["Enter the Arm of the Father.","Speak with Mide."],"dialogue":[{"name":"BIGGS","text":"We've got ourselves a problem, <span class=\"highlight\">Forename</span>, but don't worry─the chief has a plan."},{"name":"BIGGS","text":"Speaking of whom─Chief! Over here!"},{"name":"CID","text":"All present and correct, I see. Good. Something has been nagging at me for a while, <span class=\"highlight\">Forename</span>, and I've finally realized what it is. It concerns the communications Wedge intercepted."},{"name":"CID","text":"So, we know that the Illuminati have managed to establish a base inside the colossus, meaning they must also have found a way to pierce the magic barrier. Assuming that's the case, what need have they to use the only hatch which the barrier doesn't protect? And why go to the trouble of sending coded messages on how to unlock it?"},{"name":"CID","text":"The answer? Spies. I believe the Illuminati have an agent outside the colossus, most like in Idyllshire itself, who is using the hatch as a back door."},{"name":"CID","text":"Now, this agent will know we've broken their code, and that the hatch is constantly watched, so he won't have been able to use it for some time. As such, he'll doubtless be desperate to reestablish contact with the inside."},{"name":"CID","text":"And that's why I've cleared the area around the giant's hand. All we need do now is watch and wait...and follow whoever makes a dash for the hatch."},{"name":"WEDGE","text":"Chief! Linkpearl call from Redbrix! He says─ &lt;gasp&gt; He says <span class=\"emphasis\">Brayflox</span> went inside! B-But she can't be─ N-No, it must be an impersonator! Chief─whomever you met earlier was a spy! Quick, you've got to get after her!"},{"name":"SYSTEM","text":"You now have access to the Arm of the Father. Gordias can be accessed via the entrance in the Makers' Quarter."},{"name":"MIDE","text":"My, but Roundrox has a lot of treasures! Not many are of much use, but they're all lovely in their own right."},{"name":"WEDGE","text":"I really don't think Y'shtola is enjoying working under Master Matoya again, you know... You wouldn't believe the language she used when she called... It was enough to make <span class=\"emphasis\">Biggs</span> blush!"},{"name":"BIGGS","text":"Mide and the chief are already inside Alexander! Rally your band and get after them!"},{"name":"WEDGE","text":"That Brayflox impersonator had me completely fooled! ...Though, to be honest, those masks all look the same to me."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Gobbie found it? Good. Knowings of missing piece are with Illuminati."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Gobbie did well indeed..."},{"name":"CID","text":"...This is how you treat those who please you?"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Now is realm in chaos. Broken. Machine with too many parts. But Illuminati plan needs one thing, missing piece to bring world order. Give world harmony. Make world <span class=\"emphasis\">perfect</span>."},{"name":"CID","text":"And what of those who don't fit your vision of perfection? How many must die to pay for your utopia!?"},{"name":"CID","text":"Don't you see? You summoned a godsdamned primal! It will devour the aether of every land you visit, until Hydaelyn and everything on it is dead!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Inside fortress of Illuminati, chosen will live on. If inferior on outside die for progress, so be it. This is cost of seeking for knowings."},{"name":"CID","text":"Hells take you and your damned seeking!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Wise uplanders find happiness in Illuminati rule. Unwise uplanders...utopia does not need."},{"name":"CID","text":"So it's obey or die, then? Pah! The whole concept is grotesque!"},{"name":"MIDE","text":"No, Cid. Like the rest of the ideas set out in the <span class=\"emphasis\">Enigma Codex</span>, Alexander is wonderful in itself. Perfect, even. But in the rush to realize its ideals, even the best of us can be led astray."},{"name":"CID","text":"Oh, so once upon a time, these Illuminati were starry-eyed philanthropists, is that it? And it was only after they got their hands on your perfect bloody codex that they turned into vicious killers. Tell me, was there any passage in particular that convinced them to abandon their last shred of empathy?"},{"name":"MIDE","text":"&lt;sigh&gt; I cannot speak for the precise contents of the codex. Not anymore. But I haven't forgotten everything I read. I think I can stop the core, if you can get me close enough."},{"name":"CID","text":"You think you can, or you know you can? And what of its location?"},{"name":"MIDE","text":"It's somewhere in the trunk. How close we are to that, I can't say."},{"name":"ROUNDROX","text":"Pssshkoh... Roundrox can say! Two paces of Roundrox are one yalm. So, by count of Roundrox, chest of whirlycog giant is only a little further!"},{"name":"CID","text":"Ha! Clever girl! You've been measuring how far we've come from the start!"},{"name":"CID","text":"All right, I propose we withdraw for the time being. I don't know what will happen when we breach the core, but I <span class=\"emphasis\">do</span> know that we'll be better equipped to deal with it if we're well rested and ready for anything."},{"name":"MIDE","text":"...All should be well enough."},{"name":"ROUNDROX","text":"Pssshkoh... If uplander comes back safe from core unmaking, Roundrox will give one piece of secret treasure!"},{"name":"BIGGS","text":"Mide says she can dismantle the core, but we'll be on hand too─just in case she needs an extra sledgehammer, like."},{"name":"WEDGE","text":"Just you be careful, <span class=\"highlight\">Forename</span>! There's no telling what mechanical horrors are protecting the core!"},{"name":"MIDE","text":"No one should have the power to choose who lives and who dies. The idea is too vile, too insidious to be left unchallenged."},{"name":"MIDE","text":"We have to act. If we don't, Alexander will awaken, and the Illuminati will be unstoppable. Make no mistake, <span class=\"highlight\">Forename</span>─it's now or never."}],"reward":{"gil":5000,"xp":0,"instance":30023},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67627]},"next":[67629]},"partials":[{"type":"npc","id":"1014407","obj":{"i":1014407,"n":"Biggs","l":2001,"q":8}},{"type":"npc","id":"1014409","obj":{"i":1014409,"n":"Mide","l":2001,"q":7}},{"type":"npc","id":"1014402","obj":{"i":1014402,"n":"Roundrox","l":2001,"q":7}},{"type":"npc","id":"1014408","obj":{"i":1014408,"n":"Wedge","l":2001,"q":10}},{"type":"instance","id":"30023","obj":{"i":30023,"n":"Alexander - The Arm of the Father","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":170}},{"type":"quest","id":"67627","obj":{"i":67627,"n":"Steel and Steam","g":16,"l":"The Dravanian Hinterlands","s":2,"f":1}},{"type":"quest","id":"67629","obj":{"i":67629,"n":"The Pulsing Heart","g":16,"l":"The Dravanian Hinterlands","s":4,"f":1}}]}