{"quest":{"name":"Carpe Diem","location":"Ishgard","id":67625,"patch":3.0,"sort":600,"icon":100450,"unlocksFunction":1,"eventIcon":71341,"issuer":1013250,"target":1013830,"involved":[1013824,1013826,1013827,1013828,1013829,1013831],"genre":146,"usedItems":[12829],"journal":["Ansaulme is agonizing over how to reclaim his birthright.","Just as you engage Ansaulme in conversation, Reyna enters with uncharacteristic solemnity and reveals that Ansaulme's brother has asked her to assassinate him. Ansaulme is surprisingly pleased by this development, reasoning that his smallfolk will be safer if his brother's ire is directed at him. However, on learning that the lord regent also plans to lay waste to House Rougecarpe's ancestral fishing holes, his resolve to oust his brother hardens.<br><br>In order to assume his lordship, he would need to prove his identity beyond doubt, and the only way to do so is to present the Rougecarpe Ring─the ancient treasure of his house passed down from father to son since time immemorial. Unfortunately, Ansaulme accidentally gifted this ring to the Sea of Clouds, where it was swallowed by a passing cloudfish. Trusting in the proclivity of fishermen to boast about any unusual catch, he bids you return to Dravania and ask your moogle friend Mogukk if he has heard any word of a ring being found in a fish.","You speak with Mogukk, who knows the story all too well, for it was he who caught the fish that swallowed Ansaulme's ring. Unfortunately, he lost the ring in a wager with a large, beaked beastman. He bids you return to Ansaulme and apologize for the loss of the ring on his behalf.","Ansaulme recognizes the beaked beastman from Mogukk's tale as a Vanu Vanu, a race of birdmen native to the Abalathian Sea of Clouds. He bids you join him in Camp Cloudtop to track down the feathered fisherman.","You meet with Ansaulme in the Sea of Clouds, who informs you that a Vanu fisherman has been sighted on a floating island to the east. Knowing that the Vanu Vanu are wary of outsiders, he has brought a highly polished rod to give to the beastman by way of breaking the ice. Track down the Vanu fisherman and present him with Ansaulme's gift.","You give the rod to Tona Vanu and convince him to part with the Rougecarpe Ring. Unfortunately, he has already done so─the ring has again been swallowed by a ferocious fish. The only way to retrieve it is to catch the catkiller in question. Catch a bullfrog in the Eddies, then mooch with it to catch the catkiller. Ansaulme anxiously awaits your return in Voor Sian Siran.","You present the catkiller to Ansaulme, and after a quick incision from Tona Vanu's knife, the Rougecarpe Ring is reclaimed. In recognition of your commitment to the angling art, Tona Vanu grants you the use of his floating fishing hole. As Ansaulme prepares to reclaim his rightful seat and secure the safety of his people, the party gazes over the peaceful pool─an angler's paradise, cut off from the worries of the world, where fishing fanatics can practice their pastime in peace.<br><br>※The next fisher quest will be available from Sisipu once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Mogukk to the north of Moghome.","Speak with Ansaulme in Ishgard.","Speak with Ansaulme in the Sea of Clouds.","Give the polished rod to the Vanu fisherman.","<span class=\"alternative-container\"><span class=\"alternative\">Mooch a catkiller.</span><span class=\"alternative\">Deliver the catkiller to Ansaulme in Voor Sian Siran.</span></span>"],"dialogue":[{"name":"ANSAULME","text":"Ah, <span class=\"highlight\">Forename</span>! How have the fish been biting? I've had so much on my platter recently, what with all the preparations to return to my ancestral home, I haven't had much of a chance to─ ...Hm?"},{"name":"REYNA","text":"Oh, hello, <span class=\"highlight\">Forename</span>. I'm glad you're here. There's something I need to speak with you both about."},{"name":"REYNA","text":"...It's your brother, Ansaulme. He's asked me to assassinate you."},{"name":"REYNA","text":"Oh, don't worry─I told him I wouldn't do it. After all, if I killed you, who would I beat in our little fishing competitions?"},{"name":"ANSAULME","text":"Wh-What in the world are you talking about, Reyna!? I know full well why my brother might want me dead, but why would he ask <span class=\"emphasis\">you</span> to kill me?"},{"name":"REYNA","text":"I told you what I do for a living, didn't I? “I travel the realm, taking on what jobs I can to fuel my fishing habit”... What kind of jobs did you think I was talking about?"},{"name":"ANSAULME","text":"Chocobo wrangling? Basket weaving? Mayhap a few short stints as a bar wench? Never in my wildest dreams would I have thought that one of my fishing friends was a professional assassin!"},{"name":"REYNA","text":"Well, it's true! I specialize in taking down my marks with poison arrows. Remember how you had your brother eat that letter puffer poison? It seems he's keen to give you a dose of your own medicine─right in the heart."},{"name":"ANSAULME","text":"It isn't just revenge he wants─he's afraid of me. That's why he's been making unreasonable demands of those who know me well, driving them from their homes and threatening them with death... He's trying to get rid of all who might oppose his regency."},{"name":"ANSAULME","text":"Well, as long as he's focusing his efforts on harming me and not my people, I can rest a little easier. There's just one problem that remains to be solved..."},{"name":"REYNA","text":"Sorry to burst your bubble, Ansaulme, but it's not just you he's planning to harm. I happened to overhear that he's planning a new irrigation project on your house's estate─at least, that's what he calls it. All he's actually going to do is fill in the fishing ponds, just to spite you."},{"name":"ANSAULME","text":"Whaaaaaat!? That lowlife can order my friends to put poisoned arrows in my heart all he likes, but I'll never forgive him if he dares to damage my family's fishing holes!"},{"name":"ANSAULME","text":"<span class=\"highlight\">Forename</span>, we haven't a moment to lose! Will you lend me your aid to cast out my brother?"},{"name":"ANSAULME","text":"There is only one way that I can be sure of claiming my inheritance─I must present the Rougecarpe Ring: the ancient treasure of my house, passed down from father to son since time immemorial."},{"name":"ANSAULME","text":"Unfortunately...I dropped it in the Sea of Clouds."},{"name":"ANSAULME","text":"But there may still be a way to reclaim it! As I watched the ring descend into the mists, a cloudfish flew by and swallowed it whole. The ring is highly distinctive─a blood red jewel with the image of a leaping carp, the sigil of my house, intricately inlaid in silver."},{"name":"ANSAULME","text":"If anyone was to catch that fish, the tale of the ring's discovery would surely spread far and wide in cloudfishing circles. <span class=\"highlight\">Forename</span>, mayhap your Dravanian moogle friend might have heard aught about it? Pray go to him and ask about my ring─it may be my only hope!"},{"name":"ANSAULME","text":"You know as well as I how fishers are wont to boast about their catches. Finding a fish with a ruby red ring in its belly would make quite the tale, don't you think? Mayhap your moogle friend in Dravania might have heard aught about it?"},{"name":"REYNA","text":"I could never bring myself to assassinate a fellow fisherman. No matter how much I'm offered, we'll be fishy friends till the fishy end!"},{"name":"MOGUKK","text":"...Kupopo? You're looking for a ring, kupo? It wouldn't happen to have a shiny red jewel with a picture of a fish on it, would it?"},{"name":"MOGUKK","text":"Mogukk knows all about it, kupo! A few weeks back, I was filleting one of the fish that I'd caught for my supper─I've learnt my lesson about eating fish whole─when a ruby ring fell out of its belly!"},{"name":"MOGUKK","text":"Seeing how shiny it was, and where I found it, I thought that someone must have been using it as a lure when their line snapped. I never realized it was an ancient treasure! If I had, I wouldn't have...erm..."},{"name":"MOGUKK","text":"The truth is...I don't have it anymore. A few days ago, I was fishing from a floating island, and before I knew it I'd drifted all the way to Abalathia, kupo. There was a big birdman there who was fishing in a little pond and, one thing leading to another, we decided to have a bit of a contest."},{"name":"MOGUKK","text":"A competition that I lost, kupo... If I'd known he was such an expert fisherbird, I never would have wagered the ring, I promise! ...Will you tell Ansaulme I'm sorry?"},{"name":"MOGUKK","text":"It was all that big fat bird's fault, kupo! If he hadn't been so good at fishing, I never would have lost Ansaulme's ring. ...Will you tell him I'm sorry?"},{"name":"ANSAULME","text":"What in the world? Mogukk caught the fish that swallowed my ring!? What a stroke of luck! If you see your moogle friend again, tell him that he has nothing to apologize for─thanks to him, we know exactly where to find my ring, and how to reclaim it!"},{"name":"ANSAULME","text":"The birdman who won it from him can only be a Vanu Vanu. And if the fellow likes to gamble, all we need do is challenge him to another contest and win it back! Let's head up to Camp Cloudtop and see if we can find this famous fisherbird!"},{"name":"ANSAULME","text":"If that Vanu Vanu who has my ring is still in Abalathia, the knights at Camp Cloudtop should be able to tell us where to find him. Come along, <span class=\"highlight\">Forename</span>─let's head up there right away!"},{"name":"REYNA","text":"Wow, what a view! The nobles have hit the jackpot here!"},{"name":"REYNA","text":"Are you heading to Camp Cloudtop, then? Ansaulme and I will meet you there!"},{"name":"ANSAULME","text":"<span class=\"highlight\">Forename</span>, you made it! I've just spoken to the knights in Camp Cloudtop, and they think they know the Vanu fisherman we're looking for."},{"name":"ANSAULME","text":"Apparently, they often see him fishing on a floating island away to the east. However, the way they tell it, we might have some difficulty getting there."},{"name":"ANSAULME","text":"You see, the island the birdman likes to fish on isn't connected to the mainland. The only way to get to it is by flying..."},{"name":"ANSAULME","text":"Anyway, let's head over and take a look for ourselves. Oh, and here, take this rod─I made it myself! The Vanu Vanu aren't known for their hospitality, but a gift like this will surely stoke the fire of friendship in the heart of any fishing enthusiast!"},{"name":"ANSAULME","text":"Have you seen the Vanu Vanu fisherman? He's down on that island to the south, but I'm dashed if I'm going to jump. We've come this far together, but the rest I'll have to leave in your capable hands. Good luck, <span class=\"highlight\">Forename</span>!"},{"name":"REYNA","text":"I don't know which I'm more excited about─saving Ansaulme's smallfolk, or meeting another afishionado!"},{"name":"ANSAULME","text":"The solution to all my problems is clenched in the hand of that Vanu fisherman. Come, <span class=\"highlight\">Forename</span>, let us depart for the Sea of Clouds!"},{"name":"REYNA","text":"Fishing enthusiasts love to tell tales, and here we are witnessing an epic in the making. I can hardly wait to see how it turns out!"},{"name":"TONAVANU","text":"Who are you, and why you disturb my peace? Netherling appears from nowhere, like sudden squall from cloudless skies. A rare and unwelcome occurrence..."},{"name":"TONAVANU","text":"What a handsome rod─it shines like summer sun! Netherling honors Tona Vanu with excellent gift. What can Tona Vanu offer in return?"},{"name":"TONAVANU","text":"...Netherling desires return of Rougecarpe Ring? Hmmm... Netherling asks much of Tona Vanu."},{"name":"TONAVANU","text":"Tona Vanu wins that ring fair and square. If Tona Vanu returns ring, he returns to moogle, not to netherling. That is, if Tona Vanu can return at all..."},{"name":"TONAVANU","text":"In truth, Tona Vanu has ring no more. Tona Vanu uses ring to fish for bullfrog, but as soon as bullfrog bites, big catkiller comes along and strikes like lightning, ripping away bullfrog, lure and all!"},{"name":"TONAVANU","text":"...What is matter, netherling? Tona Vanu sees storm clouds gather on your brow, as if your face comes on to rain. Why you want red ring so?"},{"name":"TONAVANU","text":"...Evil man with icy heart threatens to destroy fishing holes!? Netherling is true friend of fish to sadden so...and any friend of fish is friend of Tona Vanu. Tona Vanu helps you catch catkiller and get back ring!"},{"name":"TONAVANU","text":"First, netherling needs to catch big bullfrog─bullfrog is catkiller's favorite food. Use big bullfrog as lure to catch catkiller. Catkiller that swallows Rougecarpe Ring is fierce like raging tempest─netherling will know it when netherling sees it."},{"name":"TONAVANU","text":"&lt;sniff&gt; &lt;sniff&gt; Tona Vanu smells netherling's friend waiting on mainland. He sweats more than moogle in noonday sun! When you catch big catkiller, better take it to him straightaway."},{"name":"TONAVANU","text":"Just as there is no rainbow without rain, so there can be no catkiller without bullfrog. If netherling catches big bullfrog, then throws it back in water, catkiller will bite!"},{"name":"TONAVANU","text":"Netherling's friend is nervous about finding ring─Tona Vanu hears his heart even from here. It flutters faster than Tona Vanu's feathers in a thunderstorm! When you catch big catkiller, better take it to him straightaway."},{"name":"ANSAULME","text":"We've come all this way to the Sea of Clouds, and we've finally tracked down the Vanu fisherman who has my ring. The rest is up to you, <span class=\"highlight\">Forename</span>. All my hopes and dreams rest at the end of your line!"},{"name":"TONAVANU","text":"Like summer sky after rainstorm, it is clear to Tona Vanu that this is the fish that swallows your ring."},{"name":"TONAVANU","text":"Netherling is shining example to all fishermen, like bright ray of sunshine that pierces clouds. But enough talk of weather─let me pierce fish instead!"},{"name":"REYNA","text":"The Rougecarpe Ring!"},{"name":"ANSAULME","text":"The very same. The treasure that will secure me my birthright, and let me take my rightful place as head of my house!"},{"name":"ANSAULME","text":"My brother isn't the type to go quietly, but this ring should be enough to silence him. I shan't let him terrorize the smallfolk any longer."},{"name":"REYNA","text":"I suppose m'lord won't be going on any more fishing trips in the near future, then?"},{"name":"ANSAULME","text":"Hmmm, you may be right... If all goes to plan, I should be able to spare my family's fishing holes from my brother's wrath, but I doubt my new lordship will leave me much time to enjoy them..."},{"name":"TONAVANU","text":"Do not wilt like flower in drought, noble lord! Just as a hurricane has its eye, so the most demanding duty has its moments of peace. Whenever you find yourself in such a time of calm, let the easterly breezes blow you back to my island─you may use it as and when you wish."},{"name":"ANSAULME","text":"Truly? You would allow me the use of your fishing hole?"},{"name":"TONAVANU","text":"You too are a friend of fish, and any friend of fish is a friend of Tona Vanu. We are brothers in fins, and even the wildest whirlwind could not tear that bond asunder. Tona Vanu's fishing hole is yours to use as you please."},{"name":"TONAVANU","text":"...Tona Vanu only asks that you let him visit your land sometime. A lord who likes fishing so must have some secret spots of his own, yes?"},{"name":"ANSAULME","text":"You'll let me fish in your fishing hole so long as I let you fish in all of mine? Ha ha! You drive a hard bargain, Tona Vanu! Well, alright─but if you want to keep your presence in Ishgard a secret, we're going to have to get you a change of clothes..."},{"name":"REYNA","text":"Ooh, I want to try out your fishing holes, too! Hurry up, Ansaulme─the quicker you boot out your brother and reclaim your lordship, the sooner we can go fishing!"},{"name":"ANSAULME","text":"You make it sound as if it's a foregone conclusion. Even with the Rougecarpe Ring on my finger, my brother and his cronies aren't like to leave without a fight. It may be many a moon before I can undo the damage my brother has done..."},{"name":"REYNA","text":"Oh, stop your grumbling! You've got the ring back, and Tony here has given you permission to use his secret fishing hole. What have you got to complain about?"},{"name":"REYNA","text":"Just get back to Ishgard, and kick out your brother before he ruins your estate! Not only for the good of your smallfolk, but for the benefit of fishing fanatics everywhere! ...Particularly those directly in front of you!"},{"name":"ANSAULME","text":"...You're right. If being granted the use of a fishing hole of such outstanding beauty will not give me the strength to oust my brother, nothing will."},{"name":"ANSAULME","text":"<span class=\"highlight\">Forename</span>, I thank you. For years I dreaded the day I might have to end my travels and assume my lordship, but with friends like you, I know that it need not be the end of my adventures. The next time we meet, I shall be Lord Ansaulme de Rougecarpe─and I'll challenge you to a rematch!"},{"name":"REYNA","text":"Ooh, let me join in, too! We can hold the next contest down there─it's such a peaceful place, you can forget about all the worries of the world and focus on the fish!"},{"name":"TONAVANU","text":"Indeed! Just as a balmy breeze blows the storm clouds from the skies, so the Eddies clear the sorrows from your soul. It is truly a fisherman's paradise!"},{"name":"SYSTEM","text":"In testing new waters as a fisher, you have learned “Patience II”!"},{"name":"SYSTEM","text":"This concludes the fisher quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next fisher quest will be available from Sisipu."}],"reward":{"gil":2388,"action":4106,"items":[{"num":3,"id":12669},{"num":3,"id":5687,"one":1},{"num":3,"id":5692,"one":1},{"num":3,"id":5697,"one":1}],"xp":1715850},"reqs":{"jobs":[{"lvl":60,"id":19}],"quests":[67624]},"next":[68431]},"partials":[{"type":"npc","id":"1013250","obj":{"i":1013250,"n":"Ansaulme","l":2300,"q":5}},{"type":"npc","id":"1013830","obj":{"i":1013830,"n":"Ansaulme","l":2100,"q":1}},{"type":"npc","id":"1013824","obj":{"i":1013824,"n":"Mogukk","l":2002,"q":2}},{"type":"npc","id":"1013826","obj":{"i":1013826,"n":"Reyna","l":2300,"q":1}},{"type":"npc","id":"1013827","obj":{"i":1013827,"n":"Ansaulme","l":2100,"q":1}},{"type":"npc","id":"1013828","obj":{"i":1013828,"n":"Reyna","l":2100,"q":1}},{"type":"npc","id":"1013829","obj":{"i":1013829,"n":"Tona Vanu","l":2100,"q":1}},{"type":"npc","id":"1013831","obj":{"i":1013831,"n":"Reyna","l":2100,"q":1}},{"type":"action","id":"4106","obj":{"i":4106,"n":"Patience II","c":1114,"j":18,"t":6,"l":60}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"item","id":"5687","obj":{"i":5687,"n":"Gatherer's Guerdon Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Gathering","category":2}}},{"type":"item","id":"5692","obj":{"i":5692,"n":"Gatherer's Guile Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Perception","category":2}}},{"type":"item","id":"5697","obj":{"i":5697,"n":"Gatherer's Grasp Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":4,"attr":"GP","category":2}}},{"type":"item","id":"12829","obj":{"i":12829,"n":"Catkiller","l":150,"c":29414,"t":47}},{"type":"quest","id":"67624","obj":{"i":67624,"n":"One Man's Fish Is Another Man's Poison","g":146,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"68431","obj":{"i":68431,"n":"Whither Wawalago Wanders","g":146,"l":"Limsa Lominsa","s":601,"f":1}}]}