{"quest":{"name":"Invasion of the Supper Snatchers","location":"Ishgard","id":67623,"patch":3.0,"sort":550,"icon":100450,"unlocksFunction":1,"eventIcon":71341,"issuer":1013250,"target":1013250,"involved":[1013254,1013255,1013256],"genre":146,"usedItems":[12769],"journal":["Ansaulme is on the lookout for a suitable substitute.","Ansaulme has received an urgent request from your mutual friend Reyna─she has a problem that only one with superlative angling ability can solve. However, as Ansaulme's own business will keep him in Ishgard for the foreseeable future, he asks you to respond to the summons in his place. Meet with Reyna in Tailfeather, the chocobo hunters' camp in the Dravanian forelands, and see what trouble is afoot.","Reyna tells you of the crisis affecting the camp: a school of carnivorous catfish has made its way into the local river system and is fast devouring the fish the colony relies on for its evening meals. Despite their best efforts to catch the invasive wavekin, the chocobo hunters are better archers than anglers, and could benefit from the tuition of a practiced fisher<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. Reyna bids you follow the Whilom River to the north and rendezvous with the Tailfeather hunter leading the extermination effort. He will brief you as to where the elusive shadowhiskers can be found.","The Tailfeather hunter informs you that the shadowhiskers have made their lair in the basin of the Hundred Throes. He asks you to catch three specimens to show the increasingly exasperated hunters how it is done. Once you have caught the creatures, return your haul to Reyna to make proof of your success.","Reyna is overjoyed to see what an excellent example you have set the chocobo hunters─now that they are armed with your advice, the shadowhiskers' days are surely numbered. She is eager to reward you in the same manner as before, but despite racking her brains for a suitably fascinating fishing story, she draws a blank. In her desperation, she turns to Sten, a chocobo hunter of notorious taciturnity. To Reyna's great surprise, he recounts a tale of Far Eastern hellfishing the likes of which she has never heard. Keen to try the sport for herself, she asks you to return to Ansaulme to see if he has any knowledge of the magma worms Sten mentioned in his story.","Ansaulme has not only heard of the worms in question, but he has a few of the creatures in his possession. He gives them to you as a reward for responding to Reyna's request on his behalf. Should you wish to try your hand at hellfishing, Ansaulme advises you to travel to the far reaches of the Dravanian forelands, to the fiery lands where the dragons dwell.<br><br>※The next fisher quest will be available from Ansaulme upon reaching level 58."],"objectives":["Speak with Reyna at Tailfeather.","Speak with the Tailfeather hunter.","<span class=\"alternative-container\"><span class=\"alternative\">Catch shadowhiskers at the Hundred Throes.</span><span class=\"alternative\">Deliver the shadowhiskers to Reyna.</span></span>","Speak with Ansaulme at the Forgotten Knight in Ishgard."],"dialogue":[{"name":"ANSAULME","text":"<span class=\"alternative-container\"><span class=\"alternative\">Evening</span><span class=\"alternative\">Morning</span><span class=\"alternative\">Good day to you</span></span>, <span class=\"highlight\">Forename</span>! You're just the person I wanted to see. I'm sorry for foisting this on you without any warning, but could I ask a favor of you?"},{"name":"ANSAULME","text":"You remember that girl, Reyna─the one who you beat in the fishing contest? Well, she's sent me a message, saying she needs an experienced angler to come and fish her out of a spot of hot water."},{"name":"ANSAULME","text":"She's been trying her hand at a little chocobo hunting over in Dravania─she didn't go into the details, but it seems some problem's cropped up that only a master fisherman can solve."},{"name":"ANSAULME","text":"I'd go and lend her a hand myself, but I've got some business of my own to attend to that's going to keep me in the city for the foreseeable future. Sorry to drop it in your lap like this, but would you mind heading over in my place and see what's going on?"},{"name":"ANSAULME","text":"The chocobo hunters work out of an outpost in the Dravanian forelands─Tailfeather, they call it. Thanks for taking care of this for me, <span class=\"highlight\">Forename</span>, and pass on my best wishes to Reyna, won't you?"},{"name":"ANSAULME","text":"If that fishing contest proved anything, it's that you know how to handle a rod just as well as I do. I'm sure you'll make a more than adequate stand-in. Reyna said she'd be waiting for me over in Tailfeather, in the Dravanian forelands. I don't mean to hurry you, but it sounded urgent..."},{"name":"STEN","text":"........................Hrm."},{"name":"REYNA","text":"Finally, you made it! Thanks for coming, <span class=\"highlight\">Forename</span>. ...Hold on, where's Ansaulme? Isn't he with you?"},{"name":"REYNA","text":"Didn't think he was up to the challenge, eh? Well, at least he had the good sense to send along a suitable replacement. You're thrice the fisherman that great galoot is, and it's angling talents I need to get us out of this mess."},{"name":"REYNA","text":"For the past few years, I've been coming here to Tailfeather for the start of the hunting season. It's dangerous work, but it has its rewards. Why, just a couple of weeks chocobo hunting can keep a girl in balloon bugs for the rest of the year!"},{"name":"REYNA","text":"And after a long day's hard work, there's nothing I like better than to head to the riverbank and catch a few carp for the hunters' supper. The problem is, someone's let a school of carnivorous catfish loose in the river, and they're running riot."},{"name":"REYNA","text":"At this rate, they'll have gobbled up every fish in the river before the season's out! I've convinced the hunters to try to catch these monsters before it's too late, but they've had no luck so far. It's no surprise, really─half of them don't even know which bit of the tackle to throw in the water."},{"name":"REYNA","text":"That's where you come in─I need you to help me catch a few of these whiskery invaders and show those hunters how it's done. What do you say, <span class=\"highlight\">Forename</span>?"},{"name":"REYNA","text":"If my master plan works, it's not only the future of our fish suppers that'll be saved for posterity, but the chocobo hunt itself! After all, you can't catch chocobos on an empty stomach! Isn't that right, Stenny boy?"},{"name":"STEN","text":"........................Hrm."},{"name":"REYNA","text":"&lt;sigh&gt; Looks like Stenny's away with the faeries again... I had better stay here and keep an eye on him─we wouldn't want him doddering off into the Whilom and giving those nasty catfish something meatier to wrap their teeth around. Do you think you could put my plan into practice yourself?"},{"name":"REYNA","text":"The hunters I sent to catch the catfish should still be upstream somewhere. Just follow the river to the north and you're sure to bump into them sooner or later. They might not have caught any of those pesky pescatarians yet, but like as not they'll know where to find them."},{"name":"REYNA","text":"None of the chocobo hunters around here are anglers, but every one of them can track an animal, even underwater. Just follow the Whilom up north and you'll soon bump into them. They'll be able to tell you where those horrible fish are hiding."},{"name":"CHOCOBOHUNTER02087","text":"Well, I'll be... If it ain't that fisher Reyna's been goin' on about─the absolute apex of angling, or what have you. If you're half as good as she claims, we'll have these horrors sorted out in no time flat!"},{"name":"CHOCOBOHUNTER02087","text":"These shadowhiskers are eating us out of house and home. They ain't native to this area, see─some lunkheaded hunter decided to bring them in special when no one was looking, and set them free in the river."},{"name":"CHOCOBOHUNTER02087","text":"And d'you know why he did it? To make the chocobos think twice about crossing the river, so the lazy beggar didn't have to hunt so far. As if some fish is going to scare a ten-fulm racin' bird!"},{"name":"CHOCOBOHUNTER02087","text":"The shadowhiskers have put the fear of the gods into all the other river dwellers, though. The fish what've been here all along just ain't quick enough to escape them, so the monsters are having a field day─proper gorging themselves, like."},{"name":"CHOCOBOHUNTER02087","text":"We've tried all we can to fish them out, but the slippery beggars just won't take the bait. They head downriver to hunt, but most of them are holed up around here, in the basin of the Hundred Throes."},{"name":"CHOCOBOHUNTER02087","text":"It's the big ones in the best nick that're the most trouble─if you could show us how to go about catching them, we'll take care of the rest. I reckon three big 'uns should be enough to teach us the knack. The fish themselves you can give to Reyna─I'm sure she'll find some use for them."},{"name":"CHOCOBOHUNTER02087","text":"Them shadowhiskers are all holed up 'round here, in the basin of the Hundred Throes. If you could show us how to go about catching the slippery beggars, we'll take care of the rest."},{"name":"REYNA","text":"How's the shadowhisker hunt going? It'll take every trick in the book to lift those monsters out of the water, but you know the book backwards, right?"},{"name":"REYNA","text":"Wow, you did it! I knew I could count on you!"},{"name":"REYNA","text":"And the chocobo hunters saw everything, did they? The lure you chose, how you set your line, the flick of the wrist that set the hook? ...Excellent! Now that they've seen how it's done, you can leave the rest to us!"},{"name":"REYNA","text":"We'll have the Whilom back to its good old self in no time!"},{"name":"REYNA","text":"One good turn deserves another, but I've exhausted my supply of fascinating fishing stories... How about you, Stenny boy? Any exciting tales of angling and adventure to tell our good friend <span class=\"highlight\">Forename</span>?"},{"name":"STEN","text":"............Hrm."},{"name":"STEN","text":"............Aye, I've got a story for ye."},{"name":"STEN","text":"Long ago, when me grandad's grandad was but a boy, he met with this travelin' trader who'd come over from the Far East to flog his wares. Among this merchant's stock was a bucket o' wrigglin' red worms that seemed aglow with heat. Naturally, the boy asked him what they were all about."},{"name":"STEN","text":"“Them's magma worms, my son,” the merchant said, or some such Far Eastern patter as makes no difference. “Back where I come from, the fisherfolk use 'em as bait. Hook 'em to a steel line and drop 'em in a volcano, an' ye'll pull up fish the like of which ye've never seen.”"},{"name":"STEN","text":"“'Course,” he said, “it's a dangerous game, fishin' in a pool o' molten rock. One false move an' yer comin' up crispy. Still, there's many back in the east who risk life and limb to make it their business─we call 'em the famous hellfishers!” Or so my great-great-grandad was told..."},{"name":"REYNA","text":"What a story, Sten! Could there really be fish that live in lava!? If there are, I want to catch one!"},{"name":"REYNA","text":"It sounds like we'd need some of those magma worms, though, and I can't say I've ever heard of them... Maybe Ansaulme would have an idea where to get hold of them─he's traveled all over the world, right?"},{"name":"REYNA","text":"You want to be a famous hellfisher as much as I do, don't you, <span class=\"highlight\">Forename</span>? Perhaps Ansaulme might know where we can find some of those magma worms."},{"name":"CHOCOBOHUNTER02087","text":"Ahhh, so that's how you do it. Thanks for the lesson, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>!"},{"name":"ANSAULME","text":"Welcome back, <span class=\"highlight\">Forename</span>! Judging from that satisfied smile on your face, I'd say you've managed to solve Reyna's little problem. I knew you could do it! ...You have something to ask of me? By all means, fire away."},{"name":"ANSAULME","text":"Red, glowing worms? You're not going to believe this, but I've got a few of these magma worms of yours right here in my pocket. A pair of adventurers were in here earlier─a botanist and a miner selling their diggings. I bought a few wrigglers off them that fit that description."},{"name":"ANSAULME","text":"I thought they might make decent fishing bait, but it seems they're not cut out for the cold. As soon as they hit the water they turned hard as a rock. Perhaps they'd fare better in the heat... Here, consider them your reward for taking care of that business with Reyna for me."},{"name":"ANSAULME","text":"If you're thinking of trying your hand at this hellfishing game, Dravania's your best bet. There's a string of volcanoes in the forelands, up where the dragons dwell. Just promise me you won't go getting yourself killed, alright?"},{"name":"SYSTEM","text":"You have now acquired the skill of hellfishing. Cast a line into lava and see if anything bites!"}],"reward":{"gil":1811,"items":[{"id":11912},{"num":50,"id":12709},{"id":11985,"one":1},{"id":11990,"one":1},{"id":12003,"one":1},{"num":4,"id":5825,"one":1}],"xp":1108800},"reqs":{"jobs":[{"lvl":55,"id":19}],"quests":[67622]},"next":[67624]},"partials":[{"type":"npc","id":"1013250","obj":{"i":1013250,"n":"Ansaulme","l":2300,"q":5}},{"type":"npc","id":"1013254","obj":{"i":1013254,"n":"Reyna","l":2000,"q":1}},{"type":"npc","id":"1013255","obj":{"i":1013255,"n":"Sten","l":2000,"q":1}},{"type":"npc","id":"1013256","obj":{"i":1013256,"n":"Tailfeather Hunter","l":2000,"q":1}},{"type":"item","id":"11912","obj":{"i":11912,"n":"Dark Chestnut Fishing Rod","l":100,"c":38220,"t":32,"p":15523}},{"type":"item","id":"12709","obj":{"i":12709,"n":"Magma Worm","l":136,"c":27026,"t":33,"p":17}},{"type":"item","id":"11985","obj":{"i":11985,"n":"Dhalmelskin Bush Hat","l":100,"c":41272,"t":34,"p":12474}},{"type":"item","id":"11990","obj":{"i":11990,"n":"Dhalmelskin Vest","l":100,"c":42470,"t":35,"p":15444}},{"type":"item","id":"12003","obj":{"i":12003,"n":"Ramie Trousers of Gathering","l":100,"c":45693,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12769","obj":{"i":12769,"n":"Shadowhisker","l":136,"c":29265,"t":47}},{"type":"quest","id":"67622","obj":{"i":67622,"n":"The Icepick Challenge","g":146,"l":"Ishgard","s":530,"f":1}},{"type":"quest","id":"67624","obj":{"i":67624,"n":"One Man's Fish Is Another Man's Poison","g":146,"l":"Ishgard","s":580,"f":1}}]}