{"quest":{"name":"Plenty More Fish in the Sea","location":"Limsa Lominsa","id":67621,"patch":3.0,"sort":502,"icon":100450,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1013250,"involved":[1000856,1013251],"genre":146,"journal":["Sisipu has a rod in her hand and a cloud on her brow.","Sisipu entrusts you with an important mission─to return a forgotten fishing rod to its absent-minded owner. Ansaulme, the rodless rover in question, is an authority on far-flung fishing holes. Hurry to the Drowning Wench to return the rod to Ansaulme before he journeys on.","Ansaulme is delighted to be reunited with his most faithful companion, and is fascinated to hear of your achievements in the field of fishing. He is eager to discuss the subject in more depth, but as he cannot linger in Limsa Lominsa as long as he would like, he invites you to his hometown to continue the conversation. Journey to Ishgard and meet with Ansaulme in the Forgotten Knight to learn more of the fishing holes of his homeland.","Ansaulme welcomes you to Ishgard and promises to give you a guided tour of his homeland's best fishing holes─weather permitting, of course. Speak with Ansaulme again when the storms have settled in Coerthas, and he will show you the sights.<br><br>※The next fisher quest will be available from Ansaulme upon reaching level 53."],"objectives":["Return the rod to Ansaulme at the Drowning Wench.","Speak with Ansaulme at the Forgotten Knight in Ishgard."],"dialogue":[{"name":"SISIPU","text":"Well, if it isn't my old friend <span class=\"highlight\">Forename</span>─and not a minute too soon! Not that I don't appreciate your company or anything, but I need you to go and deliver something for me right away."},{"name":"SISIPU","text":"Wawalago's had a visitor, you see─not only did the poor fellow have to put up with our dear guildmaster blathering on about who-knows-what for hours on end, but he left his rod behind as well. Would you mind taking it back to him?"},{"name":"SISIPU","text":"If it was just the rod that was at stake, I'd get that lazy guildmaster of ours to take it back himself, but this fellow's a master fisherman who's traveled to every corner of the world. According to Wawalago, he knows all about these secret fishing spots that aren't on any of our charts."},{"name":"SISIPU","text":"Hence why you're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job: not only can you be trusted to get his precious pole back to him in one piece, but you can have a chat with this chap and learn something useful in the bargain. It wouldn't do for our guild's angling ace to fall behind on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> studies."},{"name":"SISIPU","text":"Mayhap he'll tell you about some far-flung fishing holes that even the famous Wawalago's never heard of, and you'll be able to test your mettle against a whole new kettle of fish!"},{"name":"SISIPU","text":"The fisherman you're looking for is an Elezen fellow called Ansaulme─he's staying at the Drowning Wench. If you hurry, you should be able to catch him before he heads off on his travels again."},{"name":"SISIPU","text":"Chop-chop, <span class=\"highlight\">Forename</span>! The fellow who left his rod here should still be over at the Drowning Wench. You'd better get it back to him before it's too late!"},{"name":"ANSAULME","text":"Well, it's time I was on my way. Another pint of Baderon's Peculiar and I'm like to fall asleep in the snow. ...Oh, hello there. Is there aught I can assist you with?"},{"name":"ANSAULME","text":"Goodness, is that my rod? I left it in the Fishermen's Guild, you say? Dear me...I was having so much fun catching up with my old friend Wawalago that I forgot all about my most faithful companion!"},{"name":"ANSAULME","text":"I thank you for coming out of your way to return it to me. Are you a member of the guild, then? I don't recall seeing your face down in Fisherman's Bottom."},{"name":"ANSAULME","text":"You are? Good show, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! It's always a pleasure to speak with a fellow fish fancier. So tell me, what's been your biggest catch so far?"},{"name":"ANSAULME","text":"...You caught a Mazlaya marlin? Hold on a moment, you're not <span class=\"highlight\">Forename</span>, are you─the <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">fellow</span></span> who lifted the fishing ban and saved the guild? Wawalago told me all about you, and in the most glowing of terms!"},{"name":"ANSAULME","text":"...You caught the Nepto Dragon!? Twelve take me! I'd heard talk of an adventurer having lifted that beast out of the briny, but I never thought I would meet the legend in person!"},{"name":"ANSAULME","text":"It's a pleasure to have met you, <span class=\"highlight\">Forename</span>. I wish I could stick around and chat, but it's past time I was heading home to Ishgard─if you're ever in the area, you must come and visit me and tell me all about your adventures in angling."},{"name":"ANSAULME","text":"Like as not, you'll find me in the Forgotten Knight─you could say he's the Drowning Wench's long-lost lover. Drop in whenever you like, and I'll give you a guided tour of some of my homeland's best spots to drop a lure. Till then, <span class=\"highlight\">Forename</span>!"},{"name":"SISIPU","text":"Did you get that rod back to Ansaulme? Good to hear it. You should go and have a proper chat with him sometime. I'm sure a couple of <span class=\"alternative-container\"><span class=\"alternative\">avid anglers</span><span class=\"alternative\">fishy fellows</span></span> like you would have plenty to talk about, and who knows─maybe you'd learn something new!"},{"name":"ANSAULME","text":"<span class=\"highlight\">Forename</span>, you came! A warm welcome to Ishgard! ...Well, as warm as it gets up here, anyway. So, are you ready to learn all about my favorite fishing holes?"},{"name":"ANSAULME","text":"It'll soon be the end of the stormy season in Coerthas, so we'll be able to fish to our hearts' content without being frozen solid. Come back in a little while and I'll show you some of the perfect places to catch the finest fish in the north!"},{"name":"SYSTEM","text":"The next fisher quest will be available from Ansaulme upon reaching level 53."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"SYSTEM","text":"Your skills as a forager would be put to great use in gathering collectables. Speak with Morgayne at Saint Reinette's Forum in Ishgard to learn more of this lucrative business opportunity."}],"reward":{"gil":1014,"items":[{"num":100,"id":10},{"num":100,"id":13},{"num":3,"id":12668}],"xp":88800},"reqs":{"jobs":[{"lvl":50,"id":19}],"questsType":"all","quests":[66654,65964]},"next":[67622]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1013250","obj":{"i":1013250,"n":"Ansaulme","l":2300,"q":5}},{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"npc","id":"1013251","obj":{"i":1013251,"n":"Ansaulme","l":28,"q":1}},{"type":"item","id":"12668","obj":{"i":12668,"n":"Commercial Survival Manual","l":1,"c":26152,"t":63}},{"type":"quest","id":"66654","obj":{"i":66654,"n":"So Long, and Thanks for All the Fish","g":146,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67622","obj":{"i":67622,"n":"The Icepick Challenge","g":146,"l":"Ishgard","s":530,"f":1}}]}