{"quest":{"name":"The Icepick Challenge","location":"Ishgard","id":67622,"patch":3.0,"sort":530,"icon":100450,"unlocksFunction":1,"eventIcon":71341,"issuer":1013250,"target":1013252,"involved":[1013253],"genre":146,"usedItems":[12713],"journal":["Ansaulme is eager to share some exciting information with a fellow fisher.","News has reached Ansaulme that a school of icepicks, fish as defiant as they are delicious, has been sighted in a secluded fishing hole in the Coerthas western highlands. Eager to show you the sights of his homeland, as well as pit his wits against such a fractious fish, he bids you meet with him by the north entrance of Falcon's Nest, whence he will guide you to the fishing hole in question.","You make the appointed rendezvous with Ansaulme, only to learn that he has already been to the fishing hole and back. While awaiting your arrival, a fellow fisher named Reyna engaged him in a fish-off─a competition that he duly lost, catching only a single icepick to Reyna's two. Eager to silence the fisherwoman's taunts, he asks you to catch three icepicks to steal Reyna's thunder. The fish can be found in an unfrozen pond in the Gorgagne Holding, to the north of Falcon's Nest.","You dutifully deliver the trio of icepicks to Ansaulme, beating Reyna's record and confirming your place at the top table of the fishing fraternity. As a reward for your efforts, Reyna tells you a tale of a chocobo hunter who angled from a floating island, opening your eyes to a new way of fishing. The bait Ansaulme gave you as his own reward may serve you well should you wish to try your hand at cloudfishing, and pluck fish from the skies themselves.<br><br>※The next fisher quest will be available from Ansaulme upon reaching level 55."],"objectives":["Speak with Ansaulme at Falcon's Nest.","<span class=\"alternative-container\"><span class=\"alternative\">Catch icepicks in the unfrozen pond in the Gorgagne Holding.</span><span class=\"alternative\">Deliver the icepicks to Ansaulme.</span></span>"],"dialogue":[{"name":"ANSAULME","text":"Good to see you, <span class=\"highlight\">Forename</span>. I've got some news for you that I think you're going to like!"},{"name":"ANSAULME","text":"Have you ever heard of a fish called an icepick? Not only do they have a kick like a mylodon and the wits to give any fisherman a challenge, but cut them into goujons and fry them till they're golden, and they're just the thing to take away the taste of Gibrillont's best brown."},{"name":"ANSAULME","text":"Well, a shoal of the beauties has been sighted in a fishing hole I know in the western highlands of Coerthas. Let's head over, shall we? I'll meet you by the northern entrance to Falcon's Nest!"},{"name":"ANSAULME","text":"Meet me by the northern entrance to Falcon's Nest and I'll show you where these fish can be found. My mouth's watering just thinking about them!"},{"name":"REYNA","text":"Hmmm...there's something awfully fishy about you... Could it be!? Are you a fellow fishing fanatic? An angling apostle? An afishionado!?"},{"name":"ANSAULME","text":"Ah, <span class=\"highlight\">Forename</span>, you're finally here! I was afraid I'd missed you─to tell the truth, this young lady and I have just returned from the fishing hole."},{"name":"ANSAULME","text":"I'll explain in a second, but first, allow me to introduce you: <span class=\"highlight\">Forename</span>, meet Reyna, a fellow fishing enthusiast."},{"name":"ANSAULME","text":"We only just met ourselves─she was just passing by when I spotted the rod strapped to her back and introduced myself. Reyna had heard about the icepick sighting too and, well, after a bit of mutual rod-rattling, we decided to have a little competition.<br>I'm sorry we didn't wait for you, but you know how hot-headed we fishers can be."},{"name":"ANSAULME","text":"Of course, I wish I <span class=\"emphasis\">had</span> waited, now... By the time I'd managed to catch my first decent-sized icepick, she already had a brace in the net!"},{"name":"REYNA","text":"Ha ha ha! How embarrassing for you─and in your own stamping grounds, too! Why, I'd never been to that fishing hole before in all my life, yet the fish were practically throwing themselves out of the water for me!"},{"name":"ANSAULME","text":"Agh! Kick me while I'm down, why don't you?"},{"name":"ANSAULME","text":"I demand vengeance, <span class=\"highlight\">Forename</span>! And who better to deliver it than the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> Master Wawalago called the absolute apex of the angling art!"},{"name":"Q1","text":"How will you respond?"},{"name":"A1","text":"...The absolute apex of the what now?"},{"name":"A1","text":"Leave it to me!"},{"name":"ANSAULME","text":"The apex of the angling art! The perfect <span class=\"alternative-container\"><span class=\"alternative\">piscatrix</span><span class=\"alternative\">piscator</span></span>! The finest fisher<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> in the firmament! He was talking about <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>! If there's anyone who can wipe that smirk off Reyna's face, you can!"},{"name":"ANSAULME","text":"I knew I could rely on you! If there's anyone who can wipe that smirk off Reyna's face, you can!"},{"name":"ANSAULME","text":"The pond where you'll find the fish is off to the north. Cross the bridge, and keep going until you reach the Gorgagne Holding. You should find it easily enough─it's the only stretch of liquid water in malms. Reyna caught two icepicks, so you're going to have to catch three!"},{"name":"ANSAULME","text":"The fishing hole where we found the icepicks is up in the Gorgagne Holding─just head north, cross the Black Iron Bridge, and you'll be there. Reyna caught two icepicks, so you're going to have to catch three. I'm counting on you, <span class=\"highlight\">Forename</span>!"},{"name":"ANSAULME","text":"Ha ha! Three icepicks, and every one a beauty! How do you like that, Reyna? Who's laughing now!?"},{"name":"REYNA","text":"Whaaat!? I can't believe you beat my record... Alright, I'll admit it─you're a better fisher<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> than me...and thrice as good as Ansaulme."},{"name":"REYNA","text":"I may have lost the contest, but it's been wonderful to meet you both! I thought I was the only one who spent her days traveling the realm, taking on what jobs I can to fuel my fishing habit, but now I know there's at least two more <span class=\"emphasis\">epicureans</span> in the world!"},{"name":"ANSAULME","text":"So, you're a real angling addict, are you, Reyna? No doubt you could tell us some tales that would set our fish-fancying hearts aflutter."},{"name":"REYNA","text":"Oh, of course─it's the least I can do! The winner of the competition should have a reward, after all. Now, I don't know if there's any truth in this tale, but there's a certain story doing the rounds in Dravania that you might find interesting..."},{"name":"REYNA","text":"Not so very long ago, there was a chocobo hunter who found a wounded fish on the shore of the Sea of Clouds. It was a moogle spirit─known to fishermen the realm over as the manta of the skies. A hook was through its lip, an unattended rod lying at its side."},{"name":"REYNA","text":"The hunter took up the rod and freed the fish, but as soon as he did so, the spirit scooped him in its fins and swept him away to an island above the clouds! Not knowing where he was, or how to get home, he dropped a line into the clouds while he awaited rescue."},{"name":"REYNA","text":"Within moments there was jerk on the line, and he pulled up a strange fish covered in spines. A few more minutes of fishing, and he had enough of the things to spell out “help” in cloudkin. His message was spotted by a passing airship, and the fellow was saved!<br>...Well, what do you think? The chocobo hunters tell it to their children as a bedtime story, but I've got a funny feeling there might be more to it than that."},{"name":"REYNA","text":"But anyway, I can't stand around chatting while there's work to be done. If that story tickled you, why don't you go and have a look around the Sea of Clouds? If you're lucky, you might catch a few of these helpful fish yourselves!"},{"name":"ANSAULME","text":"Hmmm...these strange fish the chocobo hunter pulled from the clouds─I think I might have an idea what they were. The Ishgardian nobility used to harvest them for their poison─so much so that they drove them to extinction. Or so I thought, until now..."},{"name":"ANSAULME","text":"Here, <span class=\"highlight\">Forename</span>, take some of these. The noblemen used to bait their hooks with these red balloons to catch those fish─if the creatures really are still around, chances are their tastes haven't changed."},{"name":"ANSAULME","text":"Balloon bugs spend their lives in the skies but they make their nests in the earth. If you should need any more of them, a friendly botanist or miner should be able to dig some out for you."},{"name":"ANSAULME","text":"But anyway, thanks for today─you really saved my skin. If Reyna had won that contest, I don't think I ever would have lived it down. I'm heading back to the Knight to celebrate. See you again soon, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"You have now acquired the skill of cloudfishing. Cast a line into the clouds and see if anything bites!"}],"reward":{"gil":923,"items":[{"id":11911},{"num":50,"id":12708},{"id":11984,"one":1},{"id":11989,"one":1},{"id":11994,"one":1},{"id":12002,"one":1},{"num":3,"id":5825,"one":1}],"xp":777600},"reqs":{"jobs":[{"lvl":53,"id":19}],"quests":[67621]},"next":[67623]},"partials":[{"type":"npc","id":"1013250","obj":{"i":1013250,"n":"Ansaulme","l":2300,"q":5}},{"type":"npc","id":"1013252","obj":{"i":1013252,"n":"Ansaulme","l":2200,"q":1}},{"type":"npc","id":"1013253","obj":{"i":1013253,"n":"Reyna","l":2200,"q":1}},{"type":"item","id":"11911","obj":{"i":11911,"n":"Cedar Fishing Rod","l":85,"c":38218,"t":32,"p":13194}},{"type":"item","id":"12708","obj":{"i":12708,"n":"Red Balloon","l":130,"c":27025,"t":33,"p":16}},{"type":"item","id":"11984","obj":{"i":11984,"n":"Holy Rainbow Hat","l":80,"c":41271,"t":34,"p":7983}},{"type":"item","id":"11989","obj":{"i":11989,"n":"Wyvernskin Jerkin","l":80,"c":42468,"t":35,"p":12355}},{"type":"item","id":"11994","obj":{"i":11994,"n":"Holy Rainbow Work Gloves","l":80,"c":44389,"t":37,"p":8870}},{"type":"item","id":"12002","obj":{"i":12002,"n":"Wyvernskin Culottes","l":80,"c":45691,"t":36,"p":9504}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"12713","obj":{"i":12713,"n":"Icepick","l":120,"c":29809,"t":47}},{"type":"quest","id":"67621","obj":{"i":67621,"n":"Plenty More Fish in the Sea","g":146,"l":"Limsa Lominsa","s":502,"f":1}},{"type":"quest","id":"67623","obj":{"i":67623,"n":"Invasion of the Supper Snatchers","g":146,"l":"Ishgard","s":550,"f":1}}]}