{"quest":{"name":"Inscrutable Tastes","location":"Ishgard","id":67631,"patch":3.0,"sort":15001,"unlocksFunction":1,"eventIcon":71341,"issuer":1012161,"target":1013395,"genre":96,"journal":["Morgayne is curious whether a talented individual like yourself is familiar with the latest fad.","Apparently, there is a new “collectables” fad, which a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with your talent stands to benefit from, should you choose to do so. Journey to Revenant's Toll and speak with Lydirlona to learn more.","The realm is filled with wealthy individuals who covet a great many things, yet have no intention of obtaining them themselves. They turn to Rowena's House of Splendors to supply them with the objects of their desire, and the consortium employs various tradesmen to procure the collectables in question. Such an opportunity is now available to you, should you be so inclined...and willing to receive payment in the form of scrips redeemable only with the House of Splendors."],"objectives":["Deliver the letter to Lydirlona in Revenant's Toll."],"dialogue":[{"name":"MORGAYNE","text":"You're <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>, yes? Aye, I thought so. I pride myself on having an eye for talent and you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, have it in abundance."},{"name":"MORGAYNE","text":"Why, if it isn't <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Chosen a specialty yet? Ah, but leaving that aside for the moment..."},{"name":"MORGAYNE","text":"Don't suppose you've heard of this new “collectables” fad, have you? No? Oh, we've got to do something about that, then. Here, take this letter to Lydirlona in Revenant's Toll. She'll take care of the rest."},{"name":"MORGAYNE","text":"Really now, someone with your talent ought to have learned about collectables by now! You should head to Revenant's Toll right this instant!"},{"name":"LYDIRLONA","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. How may I assist you this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">day</span></span>?"},{"name":"LYDIRLONA","text":"Very well. It would be my pleasure to enlighten you."},{"name":"LYDIRLONA","text":"As you are doubtless aware, there are wealthy individuals who covet certain items, but who would rather pay others to procure them."},{"name":"LYDIRLONA","text":"Rowena's House of Splendors is glad to receive the custom of such individuals."},{"name":"LYDIRLONA","text":"To supply these collectables, we turn to men and women such as you who possess the talents to craft or procure them."},{"name":"LYDIRLONA","text":"Compensation will be commensurate to the collectability of items provided and paid in scrips, which can be exchanged for all manner of fine wares."},{"name":"LYDIRLONA","text":"You may sell these items to the House at any of our branch offices, including those in Limsa Lominsa, Gridania, and Ul'dah."},{"name":"LYDIRLONA","text":"Please be advised that these terms are not negotiable, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. We appreciate your understanding."},{"name":"SYSTEM","text":"You can now craft and gather collectables!"},{"name":"SYSTEM","text":"Collectables can be traded for crafter and gatherer scrips by speaking with appraisers employed by Rowena's House of Splendors."},{"name":"SYSTEM","text":"These scrips can be exchanged for items usable by Disciples of the Land or Hand."},{"name":"SYSTEM","text":"To learn more about collectables, speak with Lydirlona."}],"reward":{"gil":377,"xp":24000},"reqs":{"jobs":[{"lvl":50,"id":35}],"quests":[67118]},"next":[67634]},"partials":[{"type":"npc","id":"1012161","obj":{"i":1012161,"n":"Morgayne","l":2300,"q":1}},{"type":"npc","id":"1013395","obj":{"i":1013395,"n":"Lydirlona","l":67,"q":4}},{"type":"quest","id":"67118","obj":{"i":67118,"n":"The Better Half","g":3,"l":"Ishgard","s":3}},{"type":"quest","id":"67634","obj":{"i":67634,"n":"Go West, Craftsman","g":95,"l":"Mor Dhona","s":600,"f":1}}]}