{"quest":{"name":"A Fitting Tomestone","location":"Gridania","id":67636,"patch":3.0,"sort":500,"icon":100440,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1006725,1014017,1014018],"genre":155,"journal":["Y'mhitra has glad tidings she would share with you.","Y'mhitra has presented her findings on the art of summoning to her peers, and tells you of the overwhelmingly positive reaction. In addition to a flood of offers to assist with her research, she has also been promised a contribution of several rare Allagan tomestones. Join Y'mhitra on her journey to Saint Coinach's Find, and speak with Rammbroes about the newly unearthed relics.","You call on Rammbroes at the scholars' camp in Mor Dhona, and he gladly surrenders several Allagan tomestones to Y'mhitra. After mentioning your role in defeating Leviathan, Ramuh, and Shiva, the anthropogeographer subsequently theorizes that you should now be capable of summoning forth new egi. Y'mhitra, jumping excitedly at this realization, presses her colleague for suggestions of suitable locations at which to attempt the rituals. Head to the Singing Shards, and join the researcher in the north of the area.","Your attempt to summon Ramuh-Egi in the Singing Shards has ended in failure. Return to Apkallu Falls, and discuss this unexpected development with Y'mhitra.","Even after examining her previous findings, Y'mhitra has been unable to ascertain the reason behind the failed ritual. She then promises to begin her study of the Allagan tomestones she received from Rammbroes, and asks that you prepare yourself, body and spirit, for the unknown challenges that lie ahead.<br><br>※The next summoner quest will be available from Y'mhitra upon reaching level 52."],"objectives":["Speak with Rammbroes at Saint Coinach's Find.","Speak with Y'mhitra.","Speak with Y'mhitra at Apkallu Falls."],"dialogue":[{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>! You visit me at a most opportune moment─I have tidings that you of all people should hear."},{"name":"YMHITRA","text":"After our last encounter, I presented our findings on the art of summoning to my fellow scholars. Suffice it to say that the response has been enthusiastic─in addition to a flood of offers to assist with my research, I have also been promised a contribution of several rare Allagan tomestones."},{"name":"YMHITRA","text":"I imagine that any summoning knowledge hidden within those relics would prove of great benefit to us both. Shall we journey out to Mor Dhona now, and pay a visit to Rammbroes?"},{"name":"YMHITRA","text":"'Twould seem that I am to be the recipient of several Allagan tomestones. I suggest we call on Rammbroes at Saint Coinach's Find, and take possession of these valuable relics."},{"name":"YMHITRA","text":"There are so many aspects of summoning that we are yet to fully understand. I wonder what incredible secrets might lurk within these newly unearthed relics..."},{"name":"RAMMBROES","text":"<span class=\"highlight\">Forename</span>! How do you fare, my friend? As ever, we here at Saint Coinach's Find remain firmly entrenched in our efforts to excavate the secrets of the Allagan Empire. The members of NOAH must be armed with knowledge if they are truly to pave the way to the future..."},{"name":"RAMMBROES","text":"Well met! Without your invaluable cooperation, our research in the region would have ground to a highly unsatisfying halt."},{"name":"RAMMBROES","text":"Ah, I see you are here with the intrepid Y'mhitra. Might I assume you have come to collect your promised tomestones?"},{"name":"YMHITRA","text":"Aye, I am most eager to sink my scholar's teeth into something new..."},{"name":"RAMMBROES","text":"Then allow me to feed your fervor. We have uncovered a number of relics which, on cursory inspection, appear to contain detailed methodology for several summoner incantations. Who better than you to decipher their mysteries?"},{"name":"RAMMBROES","text":"Leviathan, Ramuh, Shiva... With every new primal that appears, the importance of a thorough study of summoning magicks becomes ever more apparent."},{"name":"RAMMBROES","text":"Speaking of those particular deities, <span class=\"highlight\">Forename</span>, I am given to understand that you had a hand in defeating every one of them. Your name features quite prominently in the reports we receive from the Scions of the Seventh Dawn."},{"name":"RAMMBROES","text":"And as you were present at each of their downfalls, it then follows that your aura was infused with the essences of those primals. Could it be possible that you now have the potential to call forth new egi?"},{"name":"YMHITRA","text":"By the Twelve, of course! The most trying of the requisite conditions has already been met... All that remains is to perform the summoning rituals at locations charged with the appropriate elemental energies!"},{"name":"YMHITRA","text":"Master Rammbroes! Can you suggest any places in which the aetheric balance tips heavily towards either water, lightning, or ice?"},{"name":"RAMMBROES","text":"The Singing Shards should adequately serve your needs for lightning─the area is alive with the constant discharge of crackling energy."},{"name":"YMHITRA","text":"The Singing Shards it is, then! Let us perform the Austerities of Lightning, and attempt to bring Ramuh-Egi into this world!"},{"name":"RAMMBROES","text":"If you wish to begin with Ramuh-Egi, then the nearby Singing Shards should serve your needs most admirably."},{"name":"YMHITRA","text":"I missed you at the Singing Shards, <span class=\"highlight\">Forename</span>. Shall we return there now, and perform the Austerities of Lightning?"},{"name":"YMHITRA","text":"Let us then begin the Austerities of Lightning. Concentrate on shifting your aetheric energies towards the desired element..."},{"name":"YMHITRA","text":"..."},{"name":"YMHITRA","text":"Hm? I sense...nothing."},{"name":"YMHITRA","text":"I do not understand─all of the conditions have been fulfilled."},{"name":"YMHITRA","text":"This summoning ritual has never failed us before! Whatever could we be missing...?"},{"name":"YMHITRA","text":"...Well, there is little point in us remaining here if Ramuh-Egi will not answer your call. Shall we return to Gridania?"},{"name":"YMHITRA","text":"Hello, <span class=\"highlight\">Forename</span>. I scoured my research notes for a hint as to why the summoning failed, but there were no revelations to be found."},{"name":"YMHITRA","text":"I am forced to conclude that the cause must lie outside our current understanding of the art. Thus shall I begin studying the tomestones we received from Rammbroes, and hope they contain some heretofore unknown wisdom."},{"name":"YMHITRA","text":"Mayhap these new egi require a different manner of catalyst...? While I delve into this mystery, I suggest you continue practicing your art─we enter an uncharted realm of summoning and you must be prepared, body and spirit."},{"name":"SYSTEM","text":"The next summoner quest will be available from Y'mhitra upon reaching level 52."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1093,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":28}],"questsType":"all","quests":[66632,65964]},"next":[67637]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1014017","obj":{"i":1014017,"n":"Y'mhitra","l":67,"q":2}},{"type":"npc","id":"1014018","obj":{"i":1014018,"n":"Y'mhitra","l":67,"q":1}},{"type":"quest","id":"66632","obj":{"i":66632,"n":"Primal Burdens","g":155,"l":"Gridania","s":6,"f":1}},{"type":"quest","id":"65964","obj":{"i":65964,"n":"Before the Dawn","g":2,"l":"Coerthas Central Highlands","s":100}},{"type":"quest","id":"67637","obj":{"i":67637,"n":"A Matter of Fact","g":155,"l":"Gridania","s":520,"f":1}}]}