{"quest":{"name":"A Miner Negotiation","location":"Ul'dah","id":67638,"patch":3.0,"sort":540,"icon":100440,"unlocksFunction":1,"eventIcon":71341,"issuer":1014028,"target":1014028,"involved":[1006756,1014027,1014029,1014030],"genre":155,"journal":["Dancing Wolf awaits your return, a grave expression upon his features.","Dancing Wolf welcomes your return to the Hall of Flames with news of another attack. According to the report, it seems that the villain you assume to be Tristan has struck again at a mining operation in central Thanalan. Head to the Nanawa Mines, and question the miner who survived the slaughter.","Tired of the constant interruptions to his work, the assaulted miner stubbornly refuses to answer any more queries until you provide the assistance he has requested. The surly laborer puts Dancing Wolf to work hauling rocks, and assigns you the task of retrieving chunks of fire silver stolen by the local spriggans. Investigate the spriggan scratchings, and wrest the rare ore from the clutches of the thieving soulkin.","You have defeated the spriggans, and recovered several chunks of fire silver. Deliver the ore to the assaulted miner at the Nanawa Mines.","Pleased by the return of his fire silver, the miner at last agrees to share the tale of the attack. Y'mhitra arrives just as the laborer begins his story, and once more signals you to summon Ifrit-Egi as a means of confirming the attacker's identity. In response to the question of what motivated the villain's actions, the miner insists that Tristan was after only one thing: crystals. Return to the Hall of Flames, and discuss this worrying revelation.","After reexamining various incident reports, Dancing Wolf is convinced that Tristan was behind several other recent attacks that were mistakenly attributed to the Amalj'aa. With every case involving the theft of crystals, Y'mhitra voices the concern of all present: the nefarious madman harbors plans to call forth a primal. If the atrocities of the past are to be averted in the present, then you must take full advantage of Y'mhitra's studies, and master the recovered wisdom of Allag's summoners.<br><br>※The next summoner quest will be available from Dancing Wolf upon reaching level 56."],"objectives":["Speak with the assaulted miner at the Nanawa Mines.","Investigate spriggan scratchings and obtain chunks of fire silver.","Deliver the chunks of fire silver to the assaulted miner.","Speak with Dancing Wolf at the Hall of Flames."],"dialogue":[{"name":"DANCINGWOLF","text":"Auspicious timing, <span class=\"highlight\">Forename</span>. There has been news...and none of it good. Our soldiers in central Thanalan have reported another attack."},{"name":"DANCINGWOLF","text":"I looked over the notes for the initial investigation, and it would seem Tristan─or someone who looks very much like him─has struck again. I'll have one of my men contact Y'mhitra with the details, but I suggest we head out to the Nanawa Mines immediately and question one of the surviving victims."},{"name":"DANCINGWOLF","text":"Y'mhitra sent word that she would be along shortly. If only this gentleman was as agreeable..."},{"name":"YMHITRA","text":"I am on the cusp of unlocking another secret from the tomestones... Pray continue the investigation without me for now."},{"name":"MINER02102","text":"Whaddaya mean, more questions? I've spilled me tale to three different soldiers already! Me work gets further an' further behind every time I gotta stop an' talk to you folk!"},{"name":"MINER02102","text":"...Here's an idea, though: how about you scratch my back, an' I'll scratch yours? That big lad in the uniform there looks like he could lift some good-sized rocks!"},{"name":"MINER02102","text":"An' what about you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─you some sorta mage? We've had some trouble with the local spriggans swipin' our fire silver, an' you're just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">bloke</span></span> to get it back. That stuff's as rare as chocobo teeth, you know!"},{"name":"DANCINGWOLF","text":"Now just a moment, sir! We don't have the time for these distractions!"},{"name":"MINER02102","text":"Then maybe <span class=\"emphasis\">I</span> don't got the time to talk to you. Not until there's a little “give” with your “take.”"},{"name":"DANCINGWOLF","text":"I fear he means to be stubborn about this, <span class=\"highlight\">Forename</span>. Please humor the man, and retrieve his precious ore from the spriggans..."},{"name":"MINER02102","text":"Aye, I'm gonna need me fire silver back from them spriggans. Always lurkin' nearby, they are, sniffin' about the carts... You'll find 'em soon enough."},{"name":"DANCINGWOLF","text":"&lt;pant&gt; &lt;pant&gt; ...This is a picnic...compared to my officer training..."},{"name":"MINER02102","text":"You find them spriggans, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? What about me fire silver?"},{"name":"MINER02102","text":"Oho, you got the whole lot back! Much appreciated!"},{"name":"YMHITRA","text":"My apologies─my studies took rather longer than I─<br>...Captain Wolf? Is everything all right?"},{"name":"DANCINGWOLF","text":"...Everything's fine. Now, let's hear your story, sir."},{"name":"MINER02102","text":"Aye, I reckon you've earned it. Well, we was in the mine, loadin' the carts with our haul for the day, when this bloke in robes appears. Doesn't say a word─the bastard just snaps his fingers, an' sets his pet demon to lightin' me mates on fire..."},{"name":"YMHITRA","text":"Ifrit-Egi... <span class=\"highlight\">Forename</span>, if you would be so kind?"},{"name":"MINER02102","text":"Bloody hells! Aye, that's the fiend I saw!"},{"name":"YMHITRA","text":"'Tis as we feared, then... And this robe-clad man─do you have any idea of why he attacked you?"},{"name":"MINER02102","text":"Well, lass, there's more than silver to be had from Nanawa─on a good day, we dig up our fair share of crystals, as well. That seems to be what he was after."},{"name":"MINER02102","text":"I'm not ashamed to say that I fled for me life once folk started goin' up in flames. But when I went back to sort out the mess, the cart what had the crystals in it was empty."},{"name":"YMHITRA","text":"...He took them all?"},{"name":"MINER02102","text":"Aye, every single one. An' that's all I've got to say about that. Hope you catch the bastard!"},{"name":"DANCINGWOLF","text":"Crystals... There was a crate of crystals on the list of goods stolen from that caravan. He must have taken everything else to conceal his intent..."},{"name":"DANCINGWOLF","text":"Our quarry grows careless...or simply impatient. It is time I reexamined certain other incidents that we did not think related to this case. Meet me at the Hall of Flames and we shall discuss the matter further."},{"name":"YMHITRA","text":"I can imagine only one reason why a man such as Tristan would seek to acquire a wealth of crystals... Come, <span class=\"highlight\">Forename</span>─let us not keep Captain Wolf waiting."},{"name":"YMHITRA","text":"Whatever evil our callous foe is planning, we cannot allow it to come to fruition. Let us speak with Captain Wolf, and learn what else his investigations have uncovered."},{"name":"DANCINGWOLF","text":"...I inspected our incident records, paying close attention to cargo manifests that included crystals. We had attributed several recent raids to the Amalj'aa, but the victims were, every one of them, burned to death. Not entirely impossible, considering the lizardmen's affinity for fire, but to find not a single arrow or spear wound...?"},{"name":"YMHITRA","text":"Aye, 'tis highly unlikely. Mayhap I should state aloud what we are all thinking..."},{"name":"YMHITRA","text":"Judging by the sheer number of crystals involved, we must assume that this villain intends to call forth a primal."},{"name":"DANCINGWOLF","text":"After my encounter with Ifrit, I learned just how devastatingly powerful these entities can be... And I believe that summoners, with their ability to harness such power, hold the potential to achieve great things."},{"name":"DANCINGWOLF","text":"But if Tristan truly is mad enough to summon a primal, then that unthinkable act─and the bloody deeds he performed in preparation for it─will cause people to question the motives of all who practice the summoner's art!"},{"name":"YMHITRA","text":"My studies of the tomestones revealed to me a tale of adulation: the summoners of Allag were revered as heroes for their part in defeating the ancient primals."},{"name":"YMHITRA","text":"But reverence slowly turned to revulsion as practitioners─intoxicated by their own immense power─began wielding the art of summoning as a means to further their own selfish ambitions."},{"name":"YMHITRA","text":"That is not to say, of course, that all summoners chose to become tyrants. Amongst the common people, however, it became a strongly held superstition that those who meddled in the powers of primals ultimately fell into the embrace of evil."},{"name":"YMHITRA","text":"This superstition blossomed into outright terror, and that is when the mage hunts began... By the end of the Third Astral Era, the last of the summoners had vanished from the stage of history."},{"name":"DANCINGWOLF","text":"And should we allow Tristan to go through with his plans, then we risk a repeat of that tragedy. I will review the state of patrols on the crystal trade routes─we <span class=\"emphasis\">will</span> catch him!"},{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>. Before I joined you at the Nanawa Mines, I was able to recover another incantation that may prove useful in the coming days. Wield its power wisely..."}],"reward":{"gil":1047,"action":3579,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":28}],"quests":[67637]},"next":[67639]},"partials":[{"type":"npc","id":"1014028","obj":{"i":1014028,"n":"Dancing Wolf","l":40,"q":5}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1014027","obj":{"i":1014027,"n":"Y'mhitra","l":40,"q":4}},{"type":"npc","id":"1014029","obj":{"i":1014029,"n":"Assaulted Miner","l":43,"q":1}},{"type":"npc","id":"1014030","obj":{"i":1014030,"n":"Dancing Wolf","l":43,"q":1}},{"type":"action","id":"3579","obj":{"i":3579,"n":"Ruin III","c":2682,"j":27,"t":2,"l":54}},{"type":"quest","id":"67637","obj":{"i":67637,"n":"A Matter of Fact","g":155,"l":"Gridania","s":520,"f":1}},{"type":"quest","id":"67639","obj":{"i":67639,"n":"Mad, Bad, and Ebon-clad","g":155,"l":"Ul'dah","s":560,"f":1}}]}