{"quest":{"name":"A Matter of Fact","location":"Gridania","id":67637,"patch":3.0,"sort":520,"icon":100440,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1014028,"involved":[1003931,1004506,1004556,1014019,1014020,1014025,1014027],"genre":155,"journal":["Y'mhitra has new knowledge to share with you.","Y'mhitra confesses that her studies have yet to reveal the reason behind the failure of the Austerities of Lightning, but is otherwise pleased to announce the discovery of several new summoner incantations. Her attempt to instruct you, however, is suddenly interrupted by the arrival of Captain Dancing Wolf─an Immortal Flames officer who claims to be in pursuit of the dark summoner, Tristan. Though Tristan was apparently consumed by fire at the culmination of your battle, Captain Wolf has witness accounts that place him at the scene of a merchant caravan attack. Unwilling to dismiss the possibility that the dangerous madman yet lives, Y'mhitra requests that you both be allowed to assist in the ongoing investigation. Travel to Camp Drybone in eastern Thanalan, and speak with Dancing Wolf.","You join Captain Wolf in Camp Drybone, and the officer sets you the task of searching for more witnesses to the incident. Make your way around the settlement, and gather more information from the merchants.","You speak with several Camp Drybone inhabitants, and learn that a survivor of the attack has recently left town. Return to Dancing Wolf, and report your findings.","Upon learning that the merchant who survived the attack has but recently left Camp Drybone, Captain Wolf immediately sets off in pursuit. Search the road heading east towards Highbridge, and find the assaulted importer.","You come across the unfortunate trader under attack by an Amalj'aa raiding party. After saving him from the beastmen's spears, the merchant gratefully provides you with a description of the man responsible for the caravan attack. The silvery-haired villain appears to have been in command of Ifrit-Egi, further deepening your suspicions that Tristan is indeed still alive. Head to Ul'dah, and discuss these developments with Dancing Wolf at the Hall of Flames.","You meet Captain Wolf at the Immortal Flames headquarters, and once more hear the tragic story of how Tristan was compelled to slay his own brother. As the dark summoner was once a soldier under his command, Dancing Wolf feels bound by duty to expunge the evil Tristan has become. Accept Y'mhitra's instruction in the damaging magicks recovered from the tomestones, and prepare for the day when you may once more face the madman's flames.<br><br>※The next summoner quest will be available from Dancing Wolf upon reaching level 54."],"objectives":["Speak with Dancing Wolf at Camp Drybone.","Question the merchants of Camp Drybone.","Report to Dancing Wolf.","Search for the assaulted importer.","Speak with Dancing Wolf at the Hall of Flames."],"dialogue":[{"name":"YMHITRA","text":"Greetings, <span class=\"highlight\">Forename</span>. Since we last met, the arduous task of deciphering those tomestones has occupied my every waking moment. I have made significant progress, but the cause of the ritual's failure yet eludes me..."},{"name":"YMHITRA","text":"I am somewhat heartened, however, by my discovery of a number of new incantations. In fact, there is one spell which I believe you could soon master with a minimum of instruct─<br>...Hm?"},{"name":"DANCINGWOLF","text":"Pray forgive my interruption. You are the leaders of the research effort on summoning magicks, yes?"},{"name":"DANCINGWOLF","text":"I am Captain Dancing Wolf, of the Immortal Flames. It is fortunate that I find you together, as I have questions for you both..."},{"name":"YMHITRA","text":"And what would the Immortal Flames want with us, Captain Wolf? Does Ul'dah's military have some vested interest in the activities of summoners?"},{"name":"DANCINGWOLF","text":"Just one summoner in particular, madam. We seek a man by the name of Tristan."},{"name":"DANCINGWOLF","text":"...Then you <span class=\"emphasis\">do</span> know him. I've read reports that you had been in pursuit of our former soldier, but I always like to have confirmation on our intelligence."},{"name":"DANCINGWOLF","text":"The Immortal Flames has its own reasons for wanting Tristan found. If you have any idea of his whereabouts, then I must know what you know!"},{"name":"DANCINGWOLF","text":"So, Tristan matched his summoning magicks against yours, and was ultimately consumed in fire. ...And you are certain he perished?"},{"name":"YMHITRA","text":"...Have we given you reason to suspect otherwise?"},{"name":"DANCINGWOLF","text":"I do not doubt the veracity of your tale, but...there has been an incident. A merchant caravan was recently attacked by a man who, by the description given, closely resembles Tristan in appearance."},{"name":"DANCINGWOLF","text":"Should we allow the crime of a former Immortal Flame to go unanswered, then the integrity of the entire organization would be called into question. I <span class=\"emphasis\">will</span> find him, and see that justice is served."},{"name":"YMHITRA","text":"We looked on as Tristan was engulfed in flames. Naught remained─not even a charred corpse─and we believed him utterly consumed. Could he have somehow survived that inferno?"},{"name":"YMHITRA","text":"If he <span class=\"emphasis\">is</span> alive, then we have unwittingly permitted the escape of a known pawn of the Paragons. Captain Wolf, you must allow us to accompany you on your investigation."},{"name":"DANCINGWOLF","text":"Your combined expertise in the summoning arts is most welcome, Lady Y'mhitra. The attack occurred on one of the roads out of Camp Drybone─join me at the settlement proper, and we can continue the search for witnesses."},{"name":"YMHITRA","text":"We cannot allow a madman like Tristan to roam unchecked. Let us hasten to Camp Drybone and assist Captain Wolf with his investigations."},{"name":"YMHITRA","text":"Assuming Tristan truly was behind this recent violence, whatever could he stand to gain from attacking a simple caravan...?"},{"name":"DANCINGWOLF","text":"Y'mhitra. <span class=\"highlight\">Forename</span>. As we are now cooperating on this investigation, I see no reason not to trust you with some of its duties. Let's split up, and find out what these merchants know."},{"name":"TUTUSI","text":"...Aye, now that you mention it, they did just cart in the body of a merchant. Such things are hardly noteworthy around here, though. As such, I failed to take notes."},{"name":"ADELSTAN","text":"...The attack out on the road? I hear the man who did it was swathed in a robe that was black as midnight─one of Ifrit's tempered, I should think."},{"name":"ERMEGARDE","text":"A friend of mine survived the assault─said he even caught a glimpse of the villain's twisted face! I'm certain he would tell you more had he not left camp the moment his injuries were bound..."},{"name":"TUTUSI","text":"...Aye, now that you mention it, they did just cart in the body of a merchant. Such things are hardly noteworthy around here, though. As such, I failed to take notes."},{"name":"ADELSTAN","text":"...The attack out on the road? I hear the man who did it was swathed in a robe that was black as midnight─one of Ifrit's tempered, I should think."},{"name":"ERMEGARDE","text":"A friend of mine survived the assault─said he even caught a glimpse of the villain's twisted face! I'm certain he would tell you more had he not left camp the moment his injuries were bound..."},{"name":"YMHITRA","text":"'Twould seem a merchant who lived through the attack has already set out with his goods again. The traders of Thanalan are naught if not hardy..."},{"name":"DANCINGWOLF","text":"So, we have one merchant left alive to tell the tale. According to my inquiries, our intrepid trader will likely be en route to Highbridge─we may yet catch him on the road if we are swift."},{"name":"YMHITRA","text":"We cannot allow Tristan to terrorize the land again. Let us provide Captain Wolf with whatever assistance he requires."},{"name":"DANCINGWOLF","text":"I heard Amalj'aa war cries... Are you unhurt, sir?"},{"name":"MERCHANT02101","text":"Yes, thank you, I... Well, aside from the injuries I sustained from a previous incident, I suppose. First the caravan, and now this. Must Thal be so eager to usher me into His hall?"},{"name":"DANCINGWOLF","text":"It is concerning the assault on your caravan that we endeavored to seek you out, sir. Is there aught you can tell us of the attacker?"},{"name":"MERCHANT02101","text":"Aye, I should be glad to see him brought to justice. Though I did not see his face in any great detail─concealed as it was in the depths of a black cowl─I did glimpse a lock of silvery hair..."},{"name":"MERCHANT02101","text":"By his stature, I marked him of Hyuran stock...and by his fiery servant, a hells-spawned demon in disguise."},{"name":"YMHITRA","text":"A fiery servant...?"},{"name":"MERCHANT02101","text":"Thal's b-balls, th-that's the one! Where do you people find those things!?"},{"name":"YMHITRA","text":"The villain was in command of Ifrit-Egi, then. And we know the affinity Tristan has for primal flame."},{"name":"DANCINGWOLF","text":"Aye, all the evidence points towards our man!"},{"name":"DANCINGWOLF","text":"Thank you for your cooperation, sir. You have been of great help to our investigation."},{"name":"MERCHANT02101","text":"Oh, think nothing of it! Consider it poor recompense for my rescue at the hands of this gallant adventurer!"},{"name":"DANCINGWOLF","text":"I must report these developments to my superiors at the Hall of Flames. Pray join me in Ul'dah─there is more I would discuss with you."},{"name":"YMHITRA","text":"Captain Wolf seems most troubled. No doubt this case has forced him to relive terrible memories he would sooner let fade..."},{"name":"DANCINGWOLF","text":"...You know of Tristan's older brother, Kahedin? Both were soldiers in service to the Immortal Flames. Both were soldiers under my command."},{"name":"DANCINGWOLF","text":"Our unit was one of many deployed in the mission to destroy the primal Ifrit─an operation that succeeded at a staggering cost. Those who were not incinerated were tempered...with Kahedin suffering the latter fate."},{"name":"DANCINGWOLF","text":"As you well know, a primal's power is fueled by the faith of its thralls─and the greatest mercy we can grant such unfortunates is a swift journey to Thal's hallowed halls. Tristan <span class=\"emphasis\">volunteered</span> to end the cursed existence of his own brother."},{"name":"DANCINGWOLF","text":"He returned to Ul'dah with Kahedin's blood on his blade, and I watched, helpless, as the guilt slowly strangled the life in his eyes. No words of comfort could reach him, and when he at last quit the Flames, he was a husk of the man he once was.<br>Never did I imagine his grief-maddened mind would drive him to such desperate evils."},{"name":"DANCINGWOLF","text":"Tristan was <span class=\"emphasis\">my</span> soldier, and it is <span class=\"emphasis\">my</span> responsibility to stop him. Thanks to your aid, we have mounting proof that he is still out there. When we are ready, we shall make our move."},{"name":"YMHITRA","text":"We are content to follow your lead in this, Captain Wolf. And we should certainly be fully prepared if we are to meet the dark summoner in battle."},{"name":"YMHITRA","text":"To that end, <span class=\"highlight\">Forename</span>, I would teach you one of the incantations I gleaned from those repositories of Allagan wisdom. 'Tis a spell of damaging magick, employed in combat by the summoners of eld."},{"name":"YMHITRA","text":"Let us call upon Captain Wolf again once you have mastered its use. It would not do to engage Tristan while stumbling over unfamiliar magicks."}],"reward":{"gil":1151,"action":16510,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":28}],"quests":[67636]},"next":[67638]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1014028","obj":{"i":1014028,"n":"Dancing Wolf","l":40,"q":5}},{"type":"npc","id":"1003931","obj":{"i":1003931,"n":"Tutusi","l":44,"q":4}},{"type":"npc","id":"1004506","obj":{"i":1004506,"n":"Ermegarde","l":44,"q":3}},{"type":"npc","id":"1004556","obj":{"i":1004556,"n":"Adelstan","l":44,"q":2}},{"type":"npc","id":"1014019","obj":{"i":1014019,"n":"Y'mhitra","l":44,"q":1}},{"type":"npc","id":"1014020","obj":{"i":1014020,"n":"Dancing Wolf","l":44,"q":1}},{"type":"npc","id":"1014025","obj":{"i":1014025,"n":"Assaulted Importer","l":44,"q":1}},{"type":"npc","id":"1014027","obj":{"i":1014027,"n":"Y'mhitra","l":40,"q":4}},{"type":"action","id":"16510","obj":{"i":16510,"n":"Energy Siphon","c":2697,"j":27,"t":4,"l":52}},{"type":"quest","id":"67636","obj":{"i":67636,"n":"A Fitting Tomestone","g":155,"l":"Gridania","s":500,"f":1}},{"type":"quest","id":"67638","obj":{"i":67638,"n":"A Miner Negotiation","g":155,"l":"Ul'dah","s":540,"f":1}}]}