{"quest":{"name":"Enigma","location":"The Dravanian Hinterlands","id":67630,"patch":3.01,"sort":5,"icon":100465,"unlocksFunction":1,"eventIcon":71341,"issuer":1014405,"target":1014402,"involved":[1014409],"genre":16,"journal":["Redbrix grows anxious for lack of tidings.","Though the primal has been stopped, the Illuminati have not. Moreover, neither you nor Redbrix has heard from your comrades. Thus, the watchman bids you seek out Mide, and discover what has taken place at Bigwest Shortstop.","You arrive to find Roundrox distraught over the inexplicable theft of her pile of treasures. Mercifully, it would seem the Illuminati who stole them did not get far, as Cid and Biggs soon return with an unconscious thief, along with two crates loaded with the young goblin's missing items. Roundrox subsequently deduces that the Illuminati were actually looking for her glowstone─little suspecting that it was sitting at the heart of the Ironworks' decoding device all along. To everyone's surprise, the strange crystal lights up at the child's touch, revealing itself to be a fragment of the <span class=\"emphasis\">Enigma Codex</span>...and the missing piece of Quickthinx's plan. Though it is safe for the time being, Cid is certain that the Illuminati will not stop until they have claimed their prize, and counsels you to be ready. After a brief celebration, you make to leave, but sense that Roundrox has something more to say. Speak with the child, and find out what it could be.","Roundrox wishes to thank you for your help, and Mide adds her voice to the chorus. As you discuss recent events, a chance observation by the child prompts the treasure hunter to speak of her past, when she and her allies sought to piece the broken world together through logic and science. What happened to these dreamers is unclear, but Mide abruptly changes the subject and asks that you watch over Roundrox until your next meeting.<br><br>Take pride in what you have done, and steel yourself for the next battle."],"objectives":["Speak with Mide at Bigwest Shortstop.","Speak with Roundrox."],"dialogue":[{"name":"REDBRIX","text":"Pshkohhh... Uplanders are gone too long for comfort of Redbrix. Shortstop is place of clashings with Illuminati."},{"name":"REDBRIX","text":"Illuminati are up to no good. Maybe using confusion to do foul things. Uplander must go and see, make sure all is well!"},{"name":"REDBRIX","text":"Pshkohhh... Uplander must find Mide, make sure all is well!"},{"name":"ROUNDROX","text":"Pshkohhh... &lt;sniff&gt; Treasures of Roundrox are...are... &lt;sniffle&gt;"},{"name":"WEDGE","text":"Is everything still as we found it? They haven't come back, have they?"},{"name":"MIDE","text":"No. They're gone for now. And everyone seems to be fine...physically, at least. But Roundrox..."},{"name":"ROUNDROX","text":"Pshkohhh... Gone. All gone. &lt;sniff&gt;"},{"name":"MIDE","text":"Poor thing... The Illuminati took everything. I'm just glad she was off collecting trinkets with Backrix when they came. I daren't think what might have happened had she been here..."},{"name":"CID","text":"Come, come, little one. Dry your tears."},{"name":"CID","text":"One thief─unconscious. We found him lurking near the edge of town─not far from your treasure, Roundrox."},{"name":"ROUNDROX","text":"Pshkohhh... &lt;sniff&gt; Uplander brings treasures home! Thanks to uplander! Many, many thanks!"},{"name":"CID","text":"It was all Biggs, little one. He had a feeling a few soldiers might be lurking around, waiting to ambush us, and this is what we stumbled onto when we went to look."},{"name":"WEDGE","text":"But why did the Illuminati take Roundrox's collection in the first place? Surely that can't have been their goal."},{"name":"CID","text":"I wouldn't be so sure. Were I to guess, I'd say that the Illuminati believed something they wanted was hidden amongst Roundrox's pile of trinkets. Rather than waste time sorting through them, they decided to take the lot. But when they subsequently realized they didn't have what they were looking for, they crept back into town to wait for a chance to seize whatever it was they actually wanted."},{"name":"ROUNDROX","text":"What if bad gobbies want most favoritest treasure of Roundrox─one that is safe with uplanders?"},{"name":"WEDGE","text":"You mean the glowstone that <span class=\"highlight\">Forename</span> borrowed? But of course! It's been sitting in the decoding machine all along!"},{"name":"ROUNDROX","text":"Yes, yes! Roundrox would be sad without pretty glowstone! It is special treasure from near old castle. Rusty one that was left by uplanders, from before."},{"name":"MIDE","text":"Wait. What do you mean “before”? Roundrox─were you near the Sharlayan ruins when...when the metal giant first appeared?"},{"name":"ROUNDROX","text":"Yes, yes, Roundrox saw whirlycog giant stand three years ago! But was only for a little bit, and big gobbies do not believe Roundrox."},{"name":"CID","text":"Three years ago─when someone tried and failed to summon the primal..."},{"name":"MIDE","text":"A fragment of the codex! Of all the places in the realm..."},{"name":"CID","text":"Only a fragment of the original? So that crystal must be the Illuminati's missing piece!"},{"name":"CID","text":"We may have stopped their primal and taken their prize, but our foes are not about to admit defeat. They'll be back, and out for blood, like as not."},{"name":"CID","text":"But we've got you, <span class=\"highlight\">Forename</span>─and I'm sure you'll be ready for the onslaught when it comes. Might I suggest you make merry till then?"},{"name":"MIDE","text":"I'm glad Roundrox has her treasure back. I only hope it doesn't place her in further danger. You wouldn't believe what some would do for just that small fragment."},{"name":"ROUNDROX","text":"Pshkohhh... Roundrox is happy. Many friends worry, think of Roundrox. Uplander is one. Roundrox thanks kind uplander!"},{"name":"MIDE","text":"Let me chime in as well, <span class=\"highlight\">Forename</span>. Roundrox's home needed protection, and you provided it. Not many would do that, and certainly not in the face of a primal. You have my thanks also."},{"name":"ROUNDROX","text":"Mide helped Roundrox too! Uplanders have good hearts, and kind."},{"name":"MIDE","text":"Only so many of us find machina pretty, my dear. We have to stick together, don't we?"},{"name":"ROUNDROX","text":"Did Mide always like whirlycogs and bittybobs?"},{"name":"MIDE","text":"Not like you, Roundrox. My love, he adored the things─inventing, building, and tinkering with them."},{"name":"ROUNDROX","text":"...Mide always touches hurtmark when remembering."},{"name":"MIDE","text":"Do I? Well, I suppose I do."},{"name":"MIDE","text":"Those times were something else, little one. My friends and I, we were lost in our dream. We thought to put back the pieces of the broken world with logic, reason, and technology. And we were certain we could do it, too."},{"name":"MIDE","text":"I hadn't much skill with thinking up things or making them, but I helped in my small way. And that feeling of aiding in someone else's dream, sharing it, washes over you like a wave of happiness. I've never felt that way since."},{"name":"MIDE","text":"Now, it all seems so far away. Even the memories feel like I dreamed them, rather than lived them..."},{"name":"MIDE","text":"Well, enough of that. Roundrox is right, adventurer─you're a kindly soul. Keep an eye on our girl till next we meet, will you?"}],"reward":{"gil":5000,"items":[{"id":12680}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67629]},"next":[67644,67785]},"partials":[{"type":"npc","id":"1014405","obj":{"i":1014405,"n":"Redbrix","l":2001,"q":3}},{"type":"npc","id":"1014402","obj":{"i":1014402,"n":"Roundrox","l":2001,"q":7}},{"type":"npc","id":"1014409","obj":{"i":1014409,"n":"Mide","l":2001,"q":7}},{"type":"item","id":"12680","obj":{"i":12680,"n":"Tarnished Gordian Bolt","l":1,"c":21014,"t":61}},{"type":"quest","id":"67629","obj":{"i":67629,"n":"The Pulsing Heart","g":16,"l":"The Dravanian Hinterlands","s":4,"f":1}},{"type":"quest","id":"67644","obj":{"i":67644,"n":"A Song of Steam and Steel","g":95,"l":"Mor Dhona","s":603,"f":1}},{"type":"quest","id":"67785","obj":{"i":67785,"n":"Rearmed","g":16,"l":"The Dravanian Hinterlands","s":6,"f":1}}]}