{"quest":{"name":"Reap What You Sow","location":"The Sea of Clouds","id":67648,"patch":3.0,"sort":16001,"icon":112093,"unlocksFunction":1,"eventIcon":71341,"issuer":1012066,"target":1012066,"involved":[1013745],"genre":97,"journal":["Sanu Vanu would seek your aid in asserting the authority of the Zundu chieftain.","Sanu Vanu seeks to procure the necessary materials for a new tribal mask─the traditional symbol of authority for a Vanu Vanu chieftain─that the kindly Zundu might continue to assert their independence from their warlike brethren. Complicating matters is the fact that the waukkeon, the giant breed of sanuwa from which the masks are fashioned, resides only on Neverreap, the sacred island which has been seized by the Vundu. Make your way outside the village and speak with Tonu Vanu, who will serve as your guide.","Tonu Vanu welcomes your aid and offers to guide you to Neverreap, while giving you fair warning that it has been transformed into a tempest of terrors under the watch of the vicious Vundu. Brave the dangers of the sacred isle and claim a waukkeon scale for the beleaguered Zundu.<br><br>※Neverreap can be accessed via the Duty Finder.","You have braved the vicious storms of Neverreap and emerged victorious, with a mighty waukkeon scale to show for your efforts. Return to Ok' Zundu and deliver it to Sanu Vanu, who will surely rejoice in your triumph.","Sanu Vanu is overjoyed to receive the scale, which will allow his chief to reassert his authority and serve to shelter his harried tribe from the threat of the Vundu. He gives you his gratitude, expressing a hope that netherlings and the Zundu can continue to live in friendship and harmony for years to come."],"objectives":["Speak with Tonu Vanu.","Enter Neverreap.","Deliver the waukkeon scale to Sanu Vanu in Ok' Zundu."],"dialogue":[{"name":"SANUVANU","text":"The great netherling warrior who chased the clouds from our land returns, like gentle zephyr wind. Sanu has plea, and hopes netherling lends an ear."},{"name":"SANUVANU","text":"Zundu take shelter from the Vundu storm by virtue of peace offerings and respect commanded by Zundu chief. Now, though, the rains threaten to fall again."},{"name":"SANUVANU","text":"The symbol of chief's power is the great mask he wears─a mask that grows old and worn. A chief who wears shabby mask is a chief who commands as much respect as a summer's day drizzle."},{"name":"SANUVANU","text":"Tribal mask is made from the scale of the waukkeon, a giant sanuwa who nests on Neverreap, where the Vanu Vanu are forbidden to go."},{"name":"SANUVANU","text":"The wicked Vundu seek to hoard power and influence for themselves. They seize control of Neverreap, and forbid poor Zundu from entry."},{"name":"SANUVANU","text":"But they cannot keep out the great netherling who tamed the White. Go to Neverreap, netherling, and snatch the scale of the waukkeon from the Vundu's evil clutches!"},{"name":"SANUVANU","text":"Tonu Vanu will be your guide. He awaits you outside the village. Pray go swiftly, netherling, and chase away the coming storm."},{"name":"SANUVANU","text":"Go to Neverreap, netherling, and snatch the scale of the waukkeon from the Vundu's evil clutches. Tonu Vanu will be your guide. He awaits you outside the village."},{"name":"TONUVANU","text":"Tonu Vanu waits for netherling warrior, and netherling warrior comes."},{"name":"TONUVANU","text":"Netherling braves Neverreap to retrieve the waukkeon scale for Zundu? Tonu's heart flutters in the gentle winds of netherling's kindness."},{"name":"TONUVANU","text":"Neverreap is sacred land to the Vanu Vanu. But Vundu come with their wicked ways, and transform Neverreap into a tempest of terrors. Watch your tailfeathers, netherling."},{"name":"TONUVANU","text":"Neverreap is sacred land to the Vanu Vanu. But Vundu come with their wicked ways, and transform Neverreap into a tempest of terrors. Watch your tailfeathers, netherling."},{"name":"SANUVANU","text":"Netherling wears the triumphant look of one who weathers the storm. You return from Neverreap with the waukkeon scale, yes? This Sanu knows."},{"name":"SANUVANU","text":"Netherling bears the scale, and it is a mighty one indeed. Fashion a mask from this, and Zundu chief will command the authority of a furious storm of lightning!"},{"name":"SANUVANU","text":"But that is not all netherling accomplishes, no. Netherling chases the cruel Vundu from Neverreap, returns halcyon winds to our sacred land."},{"name":"SANUVANU","text":"We Zundu are not like our cruel Vundu brothers. Gentle like a spring breeze, we welcome netherlings with open wings."},{"name":"SANUVANU","text":"Sanu's heart is warmed by the gentle sunlight of your friendship. Promise us that you will remain a friend to the Zundu for the many seasons to come."},{"name":"TONUVANU","text":"Netherling chases away the Vundu storm, claims waukkeon scale for the Zundu. The Zundu were right to place their trust in you."}],"reward":{"gil":5000,"xp":0,"instance":33},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67205]}},"partials":[{"type":"npc","id":"1012066","obj":{"i":1012066,"n":"Sanu Vanu","l":2100,"q":8}},{"type":"npc","id":"1013745","obj":{"i":1013745,"n":"Tonu Vanu","l":2100,"q":1}},{"type":"instance","id":"33","obj":{"i":33,"n":"Neverreap","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":145,"max_ilvl":210}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}}]}