{"quest":{"name":"Do It for Gilly","location":"Ishgard","id":67649,"patch":3.0,"sort":16002,"icon":112094,"unlocksFunction":1,"eventIcon":71341,"issuer":1012153,"target":1015104,"genre":96,"journal":["Notrelchamps has a message for you from an old friend.","Notrelchamps informs you that your erstwhile companion Wedge is looking for you to assist in some top secret project of the utmost urgency. Seek the small fellow out at the Aetherochemical Research Facility in Azys Lla and see what could possibly be so important.","You meet Wedge at the Aetherochemical Research Facility, where he reveals the nature of his project. The ever-emotional youth seeks to restore life to “Gilly,” the helpful guidance node who showed you about in your travels through Azys Lla. To that end, he entreats you to travel to the Fractal Continuum─a museum of Allagan technology housed inside a decommissioned warship─and come back with a new node nacelle, into which Gilly's “heart” might be transferred. Venture to Matter Conduit VI–VII and access the teleporter there.","You successfully locate the teleporter that will grant you access to the Fractal Continuum, which issues you a warning regarding security clearance and anti-intruder systems that bodes ill for your impending visit. Ignore it and brave whatever awaits within, that Gilly might live on.<br><br>※The Fractal Continuum can be accessed via the Duty Finder.","You have triumphed over the chimerical horrors that inhabited the Fractal Continuum to emerge with a top-of-the-line nacelle that will serve as a new body for Wedge's favorite guidance node. Take pride in the fact that you've done right by Gilly, and deliver the nacelle to the Lalafellin engineer back at the Aetherochemical Research Facility.","Gilly's new body works like a charm, and Wedge rejoices at being reunited with his friend. He then entrusts the guidance node to you, that she might accompany you on your adventures and see that there is more to the world than the aetheric wastes she has known for the past five thousand years. Go forth with your loyal new accompaniment node at your side!"],"objectives":["Speak with Wedge at the Aetherochemical Research Facility.","Examine the Allagan teleporter.","Enter the Fractal Continuum.","Deliver the node nacelle to Wedge at the Aetherochemical Research Facility."],"dialogue":[{"name":"NOTRELCHAMPS","text":"Ah, <span class=\"highlight\">Forename</span>. I was looking for you─or rather, your friend Wedge was. Left a most puzzling message, he did, with instructions to convey it to you verbatim."},{"name":"NOTRELCHAMPS","text":"He requests your presence at the “Aetherochemical Research Facility” in “Azys Lla” for a project of the utmost secrecy. Sounds like nonsense to my ears, but he assured me you would grasp his intent. Well, that is the message...and now I've delivered it."},{"name":"WEDGE","text":"Oh, there you are, <span class=\"highlight\">Forename</span>! I've been waiting for you─and so has an old friend of ours. You remember Gilly, don't you?"},{"name":"WEDGE","text":"I was feeling awfully lonely without her, so I snuck out the back door when the chief wasn't looking."},{"name":"WEDGE","text":"But look at her now─systems down, no power to utter even a single blip!"},{"name":"WEDGE","text":"Doesn't it just break your heart, <span class=\"highlight\">Forename</span>? Left alone in this wasteland for thousands of years, just waiting for someone to help, and as soon as she's done her duty─clunk! Tossed to the side like a rusty old suit of armor!"},{"name":"WEDGE","text":"Well, I won't stand for it! <span class=\"emphasis\">We</span> won't stand for it! I'm going to bring Gilly back to life, and you're going to help me!"},{"name":"WEDGE","text":"At first I had a mind to fix her up myself, but I fear she's proven beyond my abilities to repair. That's when I hit upon it─if we found a new body for Gilly, we could transfer her personality and memories right into it! It'd be like she'd never left!"},{"name":"WEDGE","text":"I know what you're thinking─and just where are we going to find this new body, Wedge? I've got three words for you: the Fractal Continuum! It's an old warship that was converted into a museum of Allagan technology."},{"name":"WEDGE","text":"If there's any place we can find a new body for Gilly, it'll be there─and it's just a short trip away by Matter Conduit VI–VII, to boot! You'll go, won't you? For Gilly's sake?"},{"name":"WEDGE","text":"If there's any place we can find a new body for Gilly, it's the Fractal Continuum─and it's just a short trip away by Matter Conduit VI–VII, to boot! You'll go, won't you? For Gilly's sake?"},{"name":"CONTROLPANEL02113","text":"&lt;blip&gt; Transport is available from this location to the Fractal Continuum, the greatest storehouse of technological marvels in all of Allag."},{"name":"CONTROLPANEL02113","text":"&lt;blip&gt; &lt;blip&gt; The Fractal Continuum is temporarily closed to tourists. Access is limited to those with level three security clearance or higher."},{"name":"CONTROLPANEL02113","text":"&lt;blip&gt; Unauthorized visitors will be removed via the Continuum's anti-intruder defense system. Thank you, and we hope you enjoy your visit."},{"name":"SYSTEM","text":"The control panel warns that museum security will deal with any unauthorized visitors to the Fractal Continuum. Proceed with caution..."},{"name":"WEDGE","text":"You're back, <span class=\"highlight\">Forename</span>! Oh, do tell me you've brought me a new nacelle!"},{"name":"WEDGE","text":"Why, that's a functioning nacelle if I ever saw one! This'll do the trick, I'm sure of it!"},{"name":"DALAMUD02113","text":"&lt;blip&gt; Auto-detecting newly installed nacelle..."},{"name":"DALAMUD02113","text":"&lt;blip&gt; Nacelle detected. Reinitializing system settings."},{"name":"DALAMUD02113","text":"&lt;blip&gt; Initialization complete. Welcome to Azys Lla, Master Wedge and <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>!"},{"name":"WEDGE","text":"G-Gilly...could it truly be you!?"},{"name":"DALAMUD02113","text":"&lt;blip&gt; The very same, Master Wedge. And running at optimal efficiency, thanks to my first full-body overhaul in approximately five millennia. You really are too kind."},{"name":"WEDGE","text":"Awww, now that's my sweet little girl. Why, after all you did for us, it was the least we could do!"},{"name":"WEDGE","text":"I've got a favor to ask you, <span class=\"highlight\">Forename</span>. This might sound silly, but I want you to take Gilly with you on your adventures. I want her to see that there's more to our world than this aetheric waste she's called home for thousands of years."},{"name":"WEDGE","text":"Yes, I'd say our little girl's done enough guidance. From this day forward, she's an accompaniment node─and with you, she's going to go where no node has gone before!"}],"reward":{"gil":5000,"items":[{"id":12064}],"xp":0,"instance":35},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67205]}},"partials":[{"type":"npc","id":"1012153","obj":{"i":1012153,"n":"Notrelchamps","l":2301,"q":1}},{"type":"npc","id":"1015104","obj":{"i":1015104,"n":"Wedge","l":2101,"q":1}},{"type":"item","id":"12064","obj":{"i":12064,"n":"Accompaniment Node","l":1,"c":59542,"t":81}},{"type":"instance","id":"35","obj":{"i":35,"n":"The Fractal Continuum","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":145,"max_ilvl":210}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}}]}