{"quest":{"name":"A Flare for the Dramatic","location":"Ul'dah","id":67641,"patch":3.0,"sort":600,"icon":100440,"unlocksFunction":1,"eventIcon":71341,"issuer":1014028,"target":1014044,"involved":[1006756,1014042,1014043,1014045],"genre":155,"journal":["Dancing Wolf is awaiting Y'mhitra's arrival.","Y'mhitra has been pondering the retreat of the Ascian of the Twelfth Chalice, and shares her conclusions concerning your foe and his black-masked brethren. Theorizing that the lower-ranked Paragon is unable to possess a living being, the researcher suggests luring the villain to an unpopulated area and destroying him for good with a devastating coup de grâce. First, however, you will need to acquire a certain forbidden tome, and study the method by which the power of a trance can be unleashed in one mighty blast. Travel to the Great Gubal Library in the Dravanian hinterlands, and rendezvous with your companions.","As you prepare to enter the Great Gubal Library, you are accosted by the Ascian of the Twelfth Chalice and three of his fellows. The servants of Lahabrea pronounce your demise, and furious battle is joined. Following a murderous exchange of arcane energies, you at last stand victorious over the kneeling form of your foe. The humbled Paragon once more attempts to flee, but you focus the energy of your trance and obliterate the villain with a searing flare of destructive power. Speak with Dancing Wolf, and share this triumph with your companions.","Though still somewhat stunned by your display of power, Dancing Wolf at last feels that vengeance has been claimed for his wronged soldiers. The captain then praises Y'mhitra for her clever deceit, and thanks you both for your invaluable assistance in bringing the Ascian to justice before setting out on the road back to Ul'dah. Speak now with Y'mhitra, and discuss the future of summoning.","With the defeat of the Ascian of the Twelfth Chalice, Y'mhitra believes that the reputation of the summoning arts has been spared an ignominious fate. She is, however, yet greatly concerned by the escalating threat of the primals. Though the perfect solution remains elusive, continue to work alongside the determined researcher in the quest to bring an end to the self-perpetuating cycle of violence.<br><br>※The next summoner quest will be available from Y'mhitra once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Speak with Y'mhitra at the Great Gubal Library.","Speak with Dancing Wolf.","Speak with Y'mhitra.","Defeat the Ascians!"],"dialogue":[{"name":"DANCINGWOLF","text":"<span class=\"highlight\">Forename</span>, I was about to send for you─Y'mhitra should be here any moment."},{"name":"YMHITRA","text":"Ah, wonderful, we're all here! I have been pondering some metaphysical theories, and would discuss my conclusions with the both of you."},{"name":"YMHITRA","text":"Ever since our battle on the Flats, the memory of our adversary fleeing the field has been preying upon my mind."},{"name":"YMHITRA","text":"According to the Scions and their research, the Paragons are effectively immortal. They are said to be aetherial entities with no physical form of their own, instead possessing mortal host after mortal host in an endless procession down the ages..."},{"name":"YMHITRA","text":"But once <span class=\"highlight\">Forename</span> had acquired the Dreadwyrm Trance, the haste with which the Ascian withdrew did not seem to me the action of a being who harbors no fear of death."},{"name":"YMHITRA","text":"Thus do I pose the question: could it be that the Twelfth Chalice and his black-masked brethren are not as practiced in the art of possession as their red-veiled masters?"},{"name":"YMHITRA","text":"At the time of the battle, our bodies were the only available hosts nearby. Assuming that he also lacks his superiors' facility to flee to the space betwixt worlds, I suspect that our foe's sudden cowardice stemmed from an inability to force his soul into our <span class=\"emphasis\">living</span> vessels."},{"name":"DANCINGWOLF","text":"That would explain much...including the reason why he chose the deceased Kahedin to serve as his puppet."},{"name":"YMHITRA","text":"Aye, I believe the theory is sound. Shall we put it to the test? If we are able to lure the Twelfth Chalice to a location devoid of potential hosts, then we might succeed in destroying him for good..."},{"name":"DANCINGWOLF","text":"Then what are we waiting for!? We must begin devising a plan to draw the villain from hiding!"},{"name":"YMHITRA","text":"Not so fast, Captain Wolf! We must first obtain the means by which we can ensure the Ascian's demise─a mighty coup de grâce, delivered before he has the chance to retreat."},{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>. There is a passage within the last tomestone that describes how the power of a trance can be unleashed in a single, devastating blast."},{"name":"YMHITRA","text":"The technique itself, however, was not explained─according to my research, it can only be learned from a forbidden book found on the shelves of the Great Gubal Library."},{"name":"YMHITRA","text":"...To reach the library will require a long and perilous journey over Abalathia's Spine and into the wilds of the Dravanian hinterlands. But I believe we three are up to the task."},{"name":"YMHITRA","text":"Shall we be on our way, then? The key to defeating the Twelfth Chalice will soon be within our grasp!"},{"name":"DANCINGWOLF","text":"Glad I am to come to the end of <span class=\"emphasis\">that</span> road... But it will be well worth the trip once we've secured your summoner's tome. Tristan and Kahedin will be avenged!"},{"name":"YMHITRA","text":"We shall need you to attain the peak of a summoner's power if we are to destroy the Twelfth Chalice!"},{"name":"YMHITRA","text":"Now that we are all arrived, we can enter the library and begin our search for this forbidden tome..."},{"name":"ASCIANSCUP","text":"(-Haughty Voice-)You have strayed far from the safety of your cities, foolish mortals. Whatever could you be planning?"},{"name":"DANCINGWOLF","text":"Again!? Always he arrives at the worst possible moment!"},{"name":"YMHITRA","text":"'Tis no coincidence, I fear. And this time, he leaves naught to chance..."},{"name":"ASCIANSCEPTER","text":"'Twas amusing at first to watch you stumble like clumsy children, but too insistent is your dabbling. Those who will not dance upon our palm shall be crushed within our fist..."},{"name":"ASCIANSWORD","text":"No more shall we endure your blinding effulgence. There can be no rival to the encroaching Darkness."},{"name":"ASCIANSCOIN","text":"You have earned the ire of Lahabrea's most loyal servants..."},{"name":"ASCIANSCUP","text":"Did you imagine the battle ended with our master's defeat? Stand now, Bringer of Light, and suffer the pain of our retribution!"},{"name":"ASCIANSCUP","text":"Did you imagine we would stand idle whilst you tore down our master's glorious edifice? Face us now, Bringer of Light, and suffer the punishment for your transgressions!"},{"name":"DANCINGWOLF","text":"...Would it not be wiser to retreat, and seek the tome another day?"},{"name":"YMHITRA","text":"They mean to afford us no such opportunity, my dear captain. Either we stand and fight...or we die."},{"name":"ASCIANS","text":"&lt;gasp&gt; How...? We were raised unto greatness by Lahabrea himself..."},{"name":"ASCIANS","text":"You defeated my master, Bringer of Light─mayhap it is meet that your strength was beyond us. But the day will come..."},{"name":"ASCIANS","text":"My master is wary of your strength, Bringer of Light─and rightfully so, it would seem. But your day will come..."},{"name":"DANCINGWOLF","text":"You'll not escape us this time, Ascian!"},{"name":"YMHITRA","text":"Now, <span class=\"highlight\">Forename</span>! Unleash your power!"},{"name":"YMHITRA","text":"It is done! The Paragon is no more!"},{"name":"DANCINGWOLF","text":"A most impressive spell, <span class=\"highlight\">Forename</span>. But when did you learn how to cast it? Did we not first require the library's tome...?"},{"name":"YMHITRA","text":"Ahahaha! My apologies, Captain. But in order to deceive one's enemies, 'tis best to begin with one's friends. There was never any such book. All that <span class=\"highlight\">Forename</span> truly required was the catalyst of battle to focus <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> energies."},{"name":"YMHITRA","text":"I knew that once the Ascian observed us traveling towards this library, he would assume we sought some long-buried wisdom. He could not risk leaving <span class=\"highlight\">Forename</span> free to gain even greater power..."},{"name":"DANCINGWOLF","text":"And so this entire journey was a feint─a trap to lure him into the wilds. Bwahahahahaha! Well, you certainly had me fooled! Remind me never to cross wits with you, Y'mhitra!"},{"name":"YMHITRA","text":"We did it, <span class=\"highlight\">Forename</span>! The Ascian of the Twelfth Chalice is no more!"},{"name":"YMHITRA","text":"...My plan had you been unable to cast the Deathflare? My dear <span class=\"highlight\">Forename</span>, I never entertained a single doubt."},{"name":"DANCINGWOLF","text":"Together, we have achieved something of which few people can boast─the defeat of an Ascian. Never could I have accomplished this deed alone."},{"name":"DANCINGWOLF","text":"Thanks to your actions, Tristan's case can also be put to rest. Long have I been haunted by the horrors of that Ifrit mission, but at last I feel a measure of peace..."},{"name":"DANCINGWOLF","text":"I will return to Ul'dah, and have a gravestone for Tristan laid beside his brother's."},{"name":"DANCINGWOLF","text":"We may not have his bones, but it will be a place where the survivors from his unit can pay respects to the man he once was. I bid you farewell, my friends─may we meet again under happier circumstances."},{"name":"YMHITRA","text":"I, too, would extend to you my gratitude, <span class=\"highlight\">Forename</span>. In addition to untold slaughter, you have prevented summoning's tragic history from repeating itself in a new age."},{"name":"YMHITRA","text":"We must take greater precautions against this ancient art falling into the wrong hands. I will work alongside my colleagues in the Sons, and be sure that the spread of summoning is closely monitored."},{"name":"YMHITRA","text":"If only we could uncover a lasting solution to the primal predicament... There <span class=\"emphasis\">must</span> be a way to break this self-perpetuating cycle of meeting force with force."},{"name":"YMHITRA","text":"As for myself, I shall continue my research into primals and summoning, and offer the Scions whatever support I am able. I am certain our paths shall cross again, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"This concludes the summoner quests for FINAL FANTASY XIV: Heavensward. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next summoner quest will be available from Y'mhitra."},{"name":"QIB","text":"In the name of Master Lahabrea, we pronounce your doom!"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"We will not surrender to your tyranny!"},{"name":"QIB","text":"Bah, I'd hoped to find you anyway.<br>We've some unfinished business, Ascian!"},{"name":"QIB","text":"You have grown in power, 'tis true...<br>But it shall not be enough!"},{"name":"QIB","text":"Wanderer of the Heavens!<br>Heed my call!"},{"name":"QIB","text":"Thal's teeth, it's raining boulders!<br>Ware that rock, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"By the Twelve!<br>Did that boulder just explode!?"},{"name":"QIB","text":"Why do you yet stand!?<br>Yield to the inevitable!"},{"name":"QIB","text":"We will never yield to you!<br>Your evil ends this day!"},{"name":"QIB","text":"I will have vengeance for my men!"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"QIB","text":"I cannot... I am undone!<br>I have failed you, Master..."},{"name":"QIB","text":"Forgive me, <span class=\"highlight\">Forename</span>..."},{"name":"QIB","text":"No! Curse my weakness!<br>My soldiers must be avenged..."}],"reward":{"gil":1633,"action":25822,"items":[{"id":20663}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":28}],"quests":[67640]},"next":[68161]},"partials":[{"type":"npc","id":"1014028","obj":{"i":1014028,"n":"Dancing Wolf","l":40,"q":5}},{"type":"npc","id":"1014044","obj":{"i":1014044,"n":"Y'mhitra","l":2001,"q":1}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1014042","obj":{"i":1014042,"n":"Y'mhitra","l":2001,"q":1}},{"type":"npc","id":"1014043","obj":{"i":1014043,"n":"Dancing Wolf","l":2001,"q":1}},{"type":"npc","id":"1014045","obj":{"i":1014045,"n":"Dancing Wolf","l":2001,"q":1}},{"type":"action","id":"25822","obj":{"i":25822,"n":"Astral Flow","c":2759,"j":27,"t":2,"l":60}},{"type":"item","id":"20663","obj":{"i":20663,"n":"Caller's Attire Coffer (IL 210)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67640","obj":{"i":67640,"n":"I Could Have Tranced All Night","g":155,"l":"Ul'dah","s":580,"f":1}},{"type":"quest","id":"68161","obj":{"i":68161,"n":"A Book with Bite","g":155,"l":"Gridania","s":601,"f":1}}]}