{"quest":{"name":"A Song of Steam and Steel","location":"Mor Dhona","id":67644,"patch":3.05,"sort":603,"icon":112102,"unlocksFunction":1,"eventIcon":71341,"issuer":1008278,"target":1014405,"genre":95,"journal":["The wandering minstrel wishes to hear all about how you raged against the machine.","Inspired by your battle against the colossus, the minstrel launches into song once more, portraying your trials and tribulations in the Dravanian hinterlands in predictably hyperbolic fashion. Make your way along the shores of the Thaliak and discuss your recollections of the event with Redbrix.","Whether it be through the gift of the Echo, the power of the poet's verse, or a combination of the two, it would seem that you can now relive your exploration of Gordias. Though you are generally loath to look back, it is not impossible that stepping into the past may be of benefit to you in the future.<br><br>※Gordias (Savage) may be accessed via the Duty Finder."],"objectives":["Speak with Redbrix in the Makers' Quarter."],"dialogue":[{"name":"WANDERINGMINSTREL","text":"The whispering winds bear tales of an adventurer's derring-do unto mine insatiable ears."},{"name":"WANDERINGMINSTREL","text":"But one episode in particular whetted mine appetite. Did you perchance encounter a colossus of steam and steel in Dravania?"},{"name":"WANDERINGMINSTREL","text":"Ahhh, so it is true. Pray speak on then, friend. I would hear more of your trials and tribulations within the towering automaton."},{"name":"WANDERINGMINSTREL","text":"...A god born of goblin prayer? A citadel upon legs whose very life spelled death to all without? How...how <span class=\"emphasis\">marvelous</span>!"},{"name":"WANDERINGMINSTREL","text":"My muse stirs at the mention of such wonders...and moves me to song! Hearken now unto your own tale, brave hero!"},{"name":"WANDERINGMINSTREL","text":"O friends far and near, I challenge you all,♪<br>To think of a marvel so strange or so tall,♪<br>A steely skinned giant whose veins coursed with steam,♪<br>In whose bright burnished bosom foul goblins did scheme,♪<br>A heaven to they who therein did dwell,♪<br>But one whose mere being made all else a hell.♪"},{"name":"WANDERINGMINSTREL","text":"Forsooth, he could not well be left to abide,♪<br>So into his huge hand a hero did stride,♪<br>And battled through legions to reach his hard heart,♪<br>Conspiring at last to rend it apart.♪<br>His core being no more, the giant fell still,♪<br>Though the goblins remained there to plot further ill...♪"},{"name":"WANDERINGMINSTREL","text":"Ahhh, my muse has left me... But tell me true─did I capture the essence of your journey?"},{"name":"WANDERINGMINSTREL","text":"Well, a poet must change one or two details for dramatic effect. A ballad should rouse its audience, not send them to sleep, after all."},{"name":"WANDERINGMINSTREL","text":"Pray accept my humble verse into your heart. Songs give the listener fresh eyes to see, and mayhap mine own will allow you to look upon your deeds anew..."},{"name":"WANDERINGMINSTREL","text":"What wonders will you see, what sounds will you hear, if you keep the words of my ballad near...?"},{"name":"REDBRIX","text":"Pssshkohhh... Uplander wants to go inside? Is curiosity not sated? Redbrix will give guidance, but beware that giant is sleeping─not dead!"},{"name":"SYSTEM","text":"Thanks to the poetical outpourings of the wandering minstrel, you can now relive your foray into Gordias."},{"name":"SYSTEM","text":"Gordias (Savage) may be undertaken by speaking with Redbrix in the Makers' Quarter."},{"name":"SYSTEM","text":"For details such as the conditions of entry, speak with Redbrix."}],"reward":{"gil":550,"instance":30025,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67630]}},"partials":[{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"npc","id":"1014405","obj":{"i":1014405,"n":"Redbrix","l":2001,"q":3}},{"type":"instance","id":"30025","obj":{"i":30025,"n":"Alexander - The Fist of the Father (Savage)","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":190}},{"type":"quest","id":"67630","obj":{"i":67630,"n":"Enigma","g":16,"l":"The Dravanian Hinterlands","s":5,"f":1}}]}