{"quest":{"name":"I Could Have Tranced All Night","location":"Ul'dah","id":67640,"patch":3.0,"sort":580,"icon":100440,"unlocksFunction":1,"eventIcon":71341,"issuer":1014028,"target":1014028,"involved":[1006756,1014027,1014038,1014039,1014040,1014041],"genre":155,"journal":["Dancing Wolf seems impatient to confront your elusive enemy.","Dancing Wolf reports that since your victory over the unfortunate Kahedin, the number of attacks along Thanalan's trade routes has considerably diminished. Such a lack of activity, however, has the officer at a loss as to how to track down your Ascian foe. He urges you to instead speak with Y'mhitra, who apparently has other findings to share. Visit the researcher in Gridania, and learn what new secrets her studies have uncovered.","Y'mhitra greets you with great enthusiasm, claiming to have unlocked a good many mysteries during her latest bout of study. She goes on to explain how you might circumvent the intrinsic aetheric limitations that prevented you from summoning Ramuh-Egi by adopting a method used by the ancient Allagans─a technique known as a “trance.” After suggesting that you attempt to infuse yourself with the essence of the terrible Bahamut, she admits that you will need Captain Wolf's assistance to enter what may be the only appropriate ritual location. Make your way to Ul'dah, and speak with Dancing Wolf at the Hall of Flames.","Against his better judgment, Dancing Wolf has agreed to help you enter the contested territory of the Carteneau Flats. Head to the airship landing and petition the elite flyer to transport you to the edge of the aether-soaked wasteland.","Your meditations in the Carteneau Flats are interrupted by the Ascian of the Twelfth Chalice, who vows to deny you the advantage of Bahamut's might. Despite the relentless onslaught of egi, however, you are able to complete the ritual and enter the trance of the dreadwyrm. Wary of your newfound strength, your immortal foe chooses to withdraw rather than risk defeat. Return to Ul'dah, and speak with Dancing Wolf at the Hall of Flames.","Though pleased with the success of your clandestine mission, Dancing Wolf is also frustrated at his failure to exact a proper vengeance. Y'mhitra reminds him, however, that the true destruction of an Ascian is not so easily accomplished. Explore the power of your Dreadwyrm Trance, and prepare yourself for your next confrontation with the malevolent Paragon.<br><br>※The next summoner quest will be available from Dancing Wolf upon reaching level 60."],"objectives":["Speak with Y'mhitra in Gridania.","Speak with Dancing Wolf at the Hall of Flames.","Speak with the elite flyer at the airship landing.","Speak with Dancing Wolf at the Hall of Flames.","Awaken the power of the Dreadwyrm Trance!","Defeat all egi!"],"dialogue":[{"name":"DANCINGWOLF","text":"Ah, <span class=\"highlight\">Forename</span>. If you've come for word on the Ascian, I fear I've little progress to report. We did, however, hold a service for Kahedin. I assembled the soldiers from his old unit, and together we conveyed his remains to the priests of Thal."},{"name":"DANCINGWOLF","text":"As for Thanalan's trade routes, there is still the odd raid by bandits or beastmen, but naught that involves men in black robes... I must confess, I am at a loss as to how we might track our foe."},{"name":"DANCINGWOLF","text":"...Ah, have you spoken with Y'mhitra? I believe she had new findings to share with you."},{"name":"DANCINGWOLF","text":"Y'mhitra mentioned she wished a word with you. The lass is back in Gridania, the last I heard..."},{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>, there you are! We have much to discuss!"},{"name":"YMHITRA","text":"I have been engrossed in my studies, you see, seeking every advantage for our inevitable clash with the Ascian."},{"name":"YMHITRA","text":"And as I struggled to unravel the ancient knowledge of the tomestones, I unlocked a good many mysteries...including the reason why you were unable to call forth Ramuh-Egi."},{"name":"YMHITRA","text":"When you summon an avatar, you draw upon your body's reservoir of aether to grant life and form to what is known as an arcane entity─that much we already knew."},{"name":"YMHITRA","text":"I had, however, overlooked the simple fact that our aetheric reserves are finite─thus the magnitude of egi that you are able to summon is limited by the extent of your own life force. Simply put, if the egi is too powerful, then the summoning fails..."},{"name":"YMHITRA","text":"But do not despair! The summoners of Allag devised a method by which one might circumvent this intrinsic limitation."},{"name":"YMHITRA","text":"Rather than attempt to summon a separate, physical manifestation of certain egi, the most accomplished mages discovered that far less aether was required to infuse <span class=\"emphasis\">themselves</span> with the essence of a primal's power.<br><br>The technique by which a summoner would achieve this heightened state was known as a “trance.”"},{"name":"YMHITRA","text":"What say you, <span class=\"highlight\">Forename</span>─shall we see if you can master this method? It may even allow you to contend with a Paragon...but not if the essence is of an ordinary primal. Nay, we must set our sights on the most potent entity, the most fierce─I speak of the elder primal Bahamut."},{"name":"YMHITRA","text":"You were there at the Battle of Carteneau. You were there on the day of the Calamity when aether infused with the dragon's essence rained down upon the field."},{"name":"YMHITRA","text":"On the day of the Calamity, the dragon vanished in an explosion so massive that his aether was carried to the far corners of Eorzea. You, among many others, have already been touched by his essence."},{"name":"YMHITRA","text":"All that remains is to perform the meditative ritual in a place steeped in Bahamut's energies, and you should be able to enter the trance of the dreadwyrm. As for setting foot within the only suitable location, I believe Captain Wolf can assist us... Shall we pay him a visit?"},{"name":"YMHITRA","text":"If we are to unlock the power of the ancient summoners' trance, then we shall require Captain Wolf's assistance. Let us make haste for Ul'dah."},{"name":"YMHITRA","text":"As I anticipated, the good captain here has agreed to help us enter the only truly suitable ritual location."},{"name":"DANCINGWOLF","text":"Y'mhitra here is certainly not one to do things by half...<br>She petitioned me to help gain entry to the aether-soaked wasteland of the Carteneau Flats."},{"name":"DANCINGWOLF","text":"The Flats are disputed territory, jointly administered by the three member nations of the Eorzean Alliance─and attempting to earn full admittance to the area is a bureaucratic nightmare. As matters stand, I was only able to secure permission to visit the Immortal Flames' airship landing."},{"name":"DANCINGWOLF","text":"If we wish to enter the Flats proper, we will have to do so under the cover of night. Prepare yourself for a tense journey, then make your way to the landing here in Ul'dah. I have one of our elite flyers standing by."},{"name":"YMHITRA","text":"Mastery of this trance will greatly increase your chances of standing against the Paragon. Pray inform the elite flyer that we are ready to depart for Carteneau."},{"name":"DANCINGWOLF","text":"If they catch us creeping into the Flats, the General will have my head on a platter. ...But I must have vengeance for my soldiers!"},{"name":"AIRMAN02104","text":"I'll fly you to the front door of the Flats, but that's as far as you're authorized to go. Stay on the landing, or face the consequences."},{"name":"DANCINGWOLF","text":"（★未使用／削除予定★）"},{"name":"YMHITRA","text":"So this is what became of the Carteneau Flats. Never before have I sensed such tainted aether..."},{"name":"YMHITRA","text":"Let us not linger long, <span class=\"highlight\">Forename</span>. Turn your mind now to Bahamut's terrible majesty─allow his power to seep into your very being..."},{"name":"YMHITRA","text":"...Nothing? We may need to deepen your meditations..."},{"name":"ASCIANSCUP","text":"(-Haughty Voice-)Do you truly attempt to harness the might of Bahamut? The essence of the elder primal shall tear your mortal frame asunder!"},{"name":"ASCIANSCUP","text":"Chaos rises in the presence of power, but you, Bringer of Light, can be allowed to shine no brighter. Come, and be doused in the endless waters of the Twelfth Chalice!"},{"name":"ASCIANS","text":"Hmph. I did not anticipate this. You should not have been able to complete the meditations under such duress."},{"name":"ASCIANS","text":"...But I shall not underestimate you again. Our next meeting shall be our last, Bringer of Light!"},{"name":"YMHITRA","text":"We did it... We faced a Paragon, and lived."},{"name":"YMHITRA","text":"And it is all thanks to you, <span class=\"highlight\">Forename</span>─you, and the towering might of Bahamut that you now command!"},{"name":"DANCINGWOLF","text":"Aye, despite the Ascian's interference, we achieved what we came here for. But I'm afraid this is not the place to celebrate─let us return to the landing before the dawn's light finds us in forbidden territory."},{"name":"YMHITRA","text":"'Twas a daring journey, but I believe the rewards merited the risk. We should return now to the Hall of Flames, and see that Captain Wolf has not been stripped of his station..."},{"name":"YMHITRA","text":"'Twas a daring journey, but I believe the rewards merited the risk. We should return now to the Hall of Flames, and see that Captain Wolf has not been stripped of his station..."},{"name":"YMHITRA","text":"That Paragon did not come across us by chance. We are being watched..."},{"name":"DANCINGWOLF","text":"We have reason to rejoice, my friends─it would seem our clandestine adventure went unnoticed by my superiors. And, more importantly, we seized the upper hand in a battle against an <span class=\"emphasis\">Ascian</span>."},{"name":"YMHITRA","text":"The trance did appear most effective against our immortal foe. For such a hurried night's work, we managed to reap quite a harvest indeed."},{"name":"DANCINGWOLF","text":"Aye, but it is a pity the bastard fled when he did. I would have liked to have settled the score then and there..."},{"name":"YMHITRA","text":"'Twas for the best, Captain Wolf. If we would truly defeat the Ascian, then we must be prepared to destroy him utterly, body and soul..."},{"name":"QIB","text":"Bahamut's power shall never be yours!<br>You die here, mortals!"},{"name":"QIB","text":"Thal's teeth!<br>We needed more time!"},{"name":"QIB","text":"You must not abandon the ritual!<br>Use Bahamut's residual energies to unlock the trance!"},{"name":"QIB","text":"You would play with fire...?<br>Then perish in infernal flames!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, quest with your senses!<br>There will be pockets of lingering aether!"},{"name":"QIB","text":"Find the densest concentrations! Focus!<br>Will yourself one with Bahamut's essence!"},{"name":"QIB","text":"I will cut you down with blades of wind!"},{"name":"QIB","text":"Another egi!?<br>He won't stop, will he...?"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>, concentrate!<br>Enfold your mind in Bahamut's wings!"},{"name":"QIB","text":"You are persistent, Bringer of Light...<br>I will bury you in stone!"},{"name":"QIB","text":"For the love of Thal...<br><span class=\"highlight\">Forename</span>! Might you meditate a little faster!?"},{"name":"QIB","text":"It's working, <span class=\"highlight\">Forename</span>!<br>Find another pocket of aether!"},{"name":"QIB","text":"You still do not understand.<br>The waters of the Twelfth Chalice are <span class=\"emphasis\">endless</span>..."},{"name":"QIB","text":"Where does he find such stamina...?<br>Do not yield, <span class=\"highlight\">Forename</span>!"},{"name":"QIB","text":"...Did he summon three egi at once!?<br>I should have brought reinforcements..."},{"name":"QIB","text":"Continue seeking the aether!<br>Without the trance, we cannot prevail!"},{"name":"QIB","text":"What just happened!?"},{"name":"QIB","text":"No! The might of the dreadwyrm..."},{"name":"QIB","text":"It is done! The trance is yours!<br>Now sweep aside these lesser avatars!"},{"name":"QIB","text":"I am sorry, <span class=\"highlight\">Forename</span>...<br>He wore me down..."},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>... The trance...<br>Do not abandon the ritual..."},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"Q1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"}],"reward":{"gil":1906,"action":3581,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":28}],"quests":[67639]},"next":[67641]},"partials":[{"type":"npc","id":"1014028","obj":{"i":1014028,"n":"Dancing Wolf","l":40,"q":5}},{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1014027","obj":{"i":1014027,"n":"Y'mhitra","l":40,"q":4}},{"type":"npc","id":"1014038","obj":{"i":1014038,"n":"Elite Flyer","l":40,"q":2}},{"type":"npc","id":"1014039","obj":{"i":1014039,"n":"Y'mhitra","l":40,"q":2}},{"type":"npc","id":"1014040","obj":{"i":1014040,"n":"Dancing Wolf","l":40,"q":2}},{"type":"npc","id":"1014041","obj":{"i":1014041,"n":"Y'mhitra","l":40,"q":1}},{"type":"action","id":"3581","obj":{"i":3581,"n":"Dreadwyrm Trance","c":2684,"j":27,"t":2,"l":58}},{"type":"quest","id":"67639","obj":{"i":67639,"n":"Mad, Bad, and Ebon-clad","g":155,"l":"Ul'dah","s":560,"f":1}},{"type":"quest","id":"67641","obj":{"i":67641,"n":"A Flare for the Dramatic","g":155,"l":"Ul'dah","s":600,"f":1}}]}