{"quest":{"name":"Sights of the North","location":"The Dravanian Forelands","id":67643,"patch":3.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1013715,"target":1013715,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"KESTERIRONHEART","text":"Well, paint me yellow and call me a chocobo─that's Millith's sightseeing log you've got there!"},{"name":"KESTERIRONHEART","text":"Ahem. Forgive me─I got carried away for a moment. I am Kester Ironheart, cousin to Millith and an explorer of sorts, like most of my extended family."},{"name":"KESTERIRONHEART","text":"When I last spoke with Millith, she told me of an adventurer with a keen case of wanderlust─an adventurer that I know now to be you. What say you lend me your log for a moment? Don't worry─I won't eat it or anything."},{"name":"KESTERIRONHEART","text":"There, there, and yes─there! That should do it, I reckon."},{"name":"KESTERIRONHEART","text":"It's no secret that Ishgard is home to some of the most remarkable sights in our realm. Mind you, I've not seen them all myself, but I certainly know where they might be found. And now, so do you─thanks to the notes and rumors I've seen fit to jot down in your sightseeing log."},{"name":"KESTERIRONHEART","text":"Yes, scores of stunning vistas are just waiting to be discovered. Your legs will not carry you to all of them, though. Should you find a particular spot out of reach, you might consider taking to the skies atop a black-feathered bird."},{"name":"KESTERIRONHEART","text":"...Oho, but if I were to say more, I would be robbing you of the joy of discovering these spectacular views for yourself. Godsspeed, my fellow explorer, and may this moment mark the beginning of a tour of wonder!"},{"name":"SYSTEM","text":"Heavensward entries have been added to your sightseeing log!"},{"name":"SYSTEM","text":"You must be level 50 or above to record Heavensward vistas. Travel to the location indicated and fulfill the necessary conditions and you will complete the entry for that vista, earning experience points in the process."},{"name":"SYSTEM","text":"Use your wits and the notes provided by Kester to identify these stunning sights and the proper way to appreciate them, and see Ishgard as only the greatest explorers have seen her!"},{"name":"KESTERIRONHEART","text":"Many are the wondrous sights to behold in these lands, but the going is parlous indeed. Would that I were more accomplished in the martial disciplines, that I might see all there is to be seen..."},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic."}],"reqs":{"jobs":[{"lvl":52,"id":1}],"questsType":"all","quests":[67145,65698]}},"partials":[{"type":"npc","id":"1013715","obj":{"i":1013715,"n":"Kester Ironheart","l":2000,"q":1}},{"type":"quest","id":"67145","obj":{"i":67145,"n":"Where the Chocobos Roam","g":3,"l":"Coerthas Western Highlands","s":30}},{"type":"quest","id":"65698","obj":{"i":65698,"n":"A Sight to Behold","g":92,"l":"Gridania","s":200,"f":1}}]}