{"quest":{"name":"Gods of Eld","location":"Ishgard","id":67650,"patch":3.0,"sort":16001,"icon":100464,"unlocksFunction":1,"eventIcon":71341,"issuer":1012217,"genre":17,"journal":["Torsefers has a message for you from a mysterious stranger.","Torsefers informs you that a mysterious stranger came calling during your absence. If you would oblige his request to meet, make your way to the Rising Stones and seek him out in the solar.","Arriving in the solar of the Rising Stones, you are greeted by a masked boy, who introduces himself as Unukalhai. He proceeds to alert you to the rising threat of beings known as eikons, which he clarifies are not the primals you know so well. Rather, the term “eikon” and the beings to which it refers date back to the days of the Allagan Empire. At this juncture, Urianger makes an unannounced appearance and takes over the explanation. It appears that the Warring Triad, three eikons sealed within the Aetherochemical Research Facility on Azys Lla, are threatening to break free. To compound matters, the primals you had but recently defeated have also been resummoned. While Urianger considers measures, you must attend to the task of vanquishing the primals, lest they seek to seize the power of the slumbering eikons and hasten their awakening. Unukalhai will assist you in this endeavor, though his allegiance and motive yet remain a mystery."],"objectives":["Wait in the solar of the Rising Stones."],"dialogue":[{"name":"TORSEFERS","text":"Ah, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span> <span class=\"highlight\">Forename</span>! During your absence, a stranger came calling."},{"name":"TORSEFERS","text":"Upon learning that you were away, he left a message to the effect that he wishes to speak with you, and will await you at the Rising Stones."},{"name":"TORSEFERS","text":"If you have a mind to oblige this stranger, please be careful. I cannot well explain why, but it put me ill at ease to simply be near him."},{"name":"TORSEFERS","text":"The stranger said that he will wait for you at the Rising Stones. If you have a mind to meet him, please be careful. Simply being near him put me ill at ease."},{"name":"UNUKALHAI","text":"(-???-)My thanks for coming."},{"name":"UNUKALHAI","text":"Unukalhai is my name, and I serve a friend. I sought you out that I might alert you to the rising threat of the beings known as eikons."},{"name":"UNUKALHAI","text":"...You are aware of the threat, you say? Ah, but I speak not of the primals, with which you are exceedingly well acquainted."},{"name":"UNUKALHAI","text":"It may interest you to know that the term “eikon” and the beings to which it refers precede the Garlean Empire by <span class=\"emphasis\">eras</span>."},{"name":"UNUKALHAI","text":"You see, it is the name by which the Allagans called godlike beings, the Dark Divinity Odin among them. And the Garleans, who seek to emulate the glory of ancient Allag, have simply availed themselves of it."},{"name":"URIANGER","text":"(-???-)Pray permit me to continue the tale."},{"name":"UNUKALHAI","text":"Ah, Urianger. How kind of you to join us."},{"name":"URIANGER","text":"As the Warrior of Light's comrade, my participation is but to be expected. After all, the matter doth pertain to the very fate of this star."},{"name":"URIANGER","text":"The eikons of eld... In the distant past, these mighty beings did offer fierce resistance to the Allagan Empire. However, they eventually fell to the men of Allag, who devised the means by which to capture them. "},{"name":"UNUKALHAI","text":"And it did not end with capture, as you well know, for the Allagans also learned how to harness the eikons' power."},{"name":"UNUKALHAI","text":"They refined this knowledge at the Aetherochemical Research Facility on Azys Lla. And within the Centrifugal Crystal Engine, they sealed three of the beings─the Warring Triad."},{"name":"URIANGER","text":"'Twas first and foremost to acquire the infinite power of the Warring Triad that the archbishop did seek Azys Lla."},{"name":"URIANGER","text":"But in the wake of his defeat, the bindings which confine the eikons were severely damaged. Doubt not but that they will fail completely ere long."},{"name":"UNUKALHAI","text":"Know that we do not condemn you for striking down the archbishop. You were simply fulfilling your destiny. And yet, were the Warring Triad to be released into the world, unimaginable destruction would ensue."},{"name":"URIANGER","text":"Take heart, for there is hope still. Through swift action, we may yet prevent their awakening and see them resealed."},{"name":"URIANGER","text":"But in dealing with this new threat, our first step must be to contend with the old."},{"name":"URIANGER","text":"Two savage gods are returned, I fear, summoned once more by their worshipers, and at a strength far surpassing their previous incarnations."},{"name":"UNUKALHAI","text":"I speak of the primals Ravana and Bismarck."},{"name":"UNUKALHAI","text":"If left unchecked, they will inevitably seek to seize the power of the Warring Triad. This will serve to feed the confluence of chaos and hasten the eikons' awakening."},{"name":"URIANGER","text":"To wit, we must needs vanquish both their kinds. I pray thee, however, to first focus thy gaze upon the primals, ere we turn our attention to those eikons and their fitful slumber..."},{"name":"URIANGER","text":"I shall return to the Waking Sands forthwith and consider such measures as are available to us."},{"name":"URIANGER","text":"Meanwhile, I bid thee attend to the task of eliminating the primals. Young Unukalhai shall assist thee. Rest assured he is not our enemy. For the time being, at least."}],"reward":{"gil":5000,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67205]},"next":[67651,67652,67766]},"partials":[{"type":"npc","id":"1012217","obj":{"i":1012217,"n":"Torsefers","l":2301,"q":3}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"67651","obj":{"i":67651,"n":"The Diabolical Bismarck","g":17,"l":"The Rising Stones","s":16101,"f":1}},{"type":"quest","id":"67652","obj":{"i":67652,"n":"Thok Around the Clock","g":17,"l":"The Rising Stones","s":16102,"f":1}},{"type":"quest","id":"67766","obj":{"i":67766,"n":"When the Bough Wakes","g":17,"l":"The Rising Stones","s":16002,"f":1}}]}