{"quest":{"name":"Let the Clan Hunt Begin","location":"Ishgard","id":67655,"patch":3.0,"sort":15301,"unlocksFunction":1,"eventIcon":71341,"issuer":1012256,"involved":[1012225],"genre":96,"journal":["Aytienne is looking you up and down and grinning.","Recognizing you as an adventurer who has seen <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fair share of battle, Aytienne asks if you would consider joining him and his Clan Centurio colleagues in the Ishgardian Hunt. If you think you have what it takes, head to the bar of the Forgotten Knight and ask Ardolain for more information.","Ardolain briefs you on the workings of the Clan Hunt and signs you up as a Clan Centurio novitiate. He bids you examine the Clan Hunt board outside the upstairs entrance to the inn, where Clan Centurio post their latest marks.","You examine the Clan Hunt board and the bills posted thereon. As a novice member of Clan Centurio, you are permitted to take level one mark bills from the board and collect their rewards. For more information about the Clan Hunt, or to exchange Centurio Seals for exclusive items, speak with Ardolain in the Forgotten Knight. Otherwise, pick a bill from the board and put the marked monsters to the sword to help bring a modicum of peace to the bloodstained snows of Ishgard."],"objectives":["Speak with Ardolain.","Examine the Clan Hunt board."],"dialogue":[{"name":"AYTIENNE","text":"Well, well, well...what have we here? You look like you've seen a scrap or two."},{"name":"AYTIENNE","text":"The name's Aytienne, and I'm a proud member of Clan Centurio─the toughest band of warriors this side of the Steps."},{"name":"AYTIENNE","text":"You'll have heard of the Hunt, right? The Grand Companies run it in the rest of Eorzea, but up here it's the Clan's concern. We follow the same system, but we're free to pick our own marks."},{"name":"AYTIENNE","text":"Reckon you've got the speed, the strength, and the heart to take down some of the most ferocious fiends this side of the seventh hell? If you think you're up to the challenge, head downstairs and have a word with Ardolain. He'll fill you in on the details."},{"name":"AYTIENNE","text":"The Hunt isn't for beginners, you know. Underestimate any of these beasties and you'll be going home in a bucket. Still, if you reckon you've got what it takes, head downstairs and talk to Ardolain. He'll fill you in on the details."},{"name":"ARDOLAIN","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">master</span></span>. How can I be of service?"},{"name":"ARDOLAIN","text":"Oho... So you fancy trying your hand at the Hunt, do you? Well, if Aytienne reckons you're up to it, it isn't for an old man like me to say elsewise."},{"name":"ARDOLAIN","text":"Me and him are members of Clan Centurio, a ragtag band of glory hunters, mercenaries, and has-beens brought together by Ser Leaudaste, one of Ishgard's most noble of nobles. Whenever a monster grows too big for its boots, we're the ones who risk our necks to take it down."},{"name":"ARDOLAIN","text":"It doesn't matter who you are, or where you come from─as long as you can wield a weapon and you don't fear death, you'll always be welcome in the Clan. Take me, for instance─I was born a thousand malms from here, but now I'm the one showing the new recruits the ropes."},{"name":"ARDOLAIN","text":"So, how about it, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">master</span></span>? Will you be joining us in the Hunt? If the fame and the glory's not enough for you, perhaps the rich rewards on offer might change your mind...?"},{"name":"ARDOLAIN","text":"Then welcome to the Clan, er...what was your name again? ...<span class=\"highlight\">Forename</span>, is it? Alright then, I'll put your name in the book."},{"name":"ARDOLAIN","text":"Now, I suppose you'll be wanting to take a look at some of our marks. Head up those stairs and out the door─the Clan Hunt board is on the wall outside, 'round to the left. You'd better stick to the level one marks for the nonce─no point running before you can walk."},{"name":"ARDOLAIN","text":"The Clan Hunt board's on the wall outside, at the top of the stairs. Since you're new to the Clan, I'd ask you only to take level one bills for the nonce. Prove you've got what it takes to be a hunter, and I'll think about giving you some bigger fish to fry."},{"name":"SYSTEM","text":"The Clan Hunt board is covered in bills showing the details of wanted monsters. Follow Ardolain's advice and pick any level 1 Clan mark bill that takes your fancy."},{"name":"SYSTEM","text":"As a new member of Clan Centurio, you are permitted to take bills for level 1 Clan marks from the Clan Hunt board."},{"name":"SYSTEM","text":"Defeat the monsters described on the bills and you will be rewarded with Centurio Seals, which can be exchanged for exclusive items."},{"name":"SYSTEM","text":"To exchange Centurio Seals, or to learn more about the Hunt, speak with Ardolain in the Forgotten Knight."}],"reward":{"gil":449,"xp":28800},"reqs":{"jobs":[{"lvl":53,"id":34}],"questsType":"any","quests":[67100,67099]},"next":[67656]},"partials":[{"type":"npc","id":"1012256","obj":{"i":1012256,"n":"Aytienne","l":2300,"q":1}},{"type":"npc","id":"1012225","obj":{"i":1012225,"n":"Ardolain","l":2300,"s":2,"q":4,"t":"Clan Centurio Member","r":1,"a":2310,"c":[13.05,11.85]}},{"type":"quest","id":"67100","obj":{"i":67100,"n":"Let the Hunt Begin (Maelstrom)","g":190,"l":"Limsa Lominsa","s":500,"f":1}},{"type":"quest","id":"67099","obj":{"i":67099,"n":"Let the Hunt Begin (Twin Adder)","g":191,"l":"Gridania","s":500,"f":1}},{"type":"quest","id":"67656","obj":{"i":67656,"n":"Better Bill Hunting","g":96,"l":"Ishgard","s":15601,"f":1}}]}