{"quest":{"name":"I Believe I Can Fly","location":"???","id":67653,"patch":3.0,"sort":15201,"unlocksFunction":1,"eventIcon":71341,"target":1011921,"genre":0,"journal":["Arnoulain believes your chocobo capable of reaching still greater heights.","<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon it.</span>","Priorfaix is most impressed with <span class=\"highlight\">Companion</span>. As he tells it, the process of training a flightless chocobo to take to the heavens involves providing it with experiences that will rouse the instincts of its wild ancestors that lie dormant within. For the first stage of the training, bring your chocobo to the Chocobo Forest and slay Dravanian bee clouds.","You slay Dravanian bee clouds, allowing <span class=\"highlight\">Companion</span> to experience the life-and-death battle that his wild brethren face each day. Return to Tailfeather and report your success to Priorfaix.","Priorfaix congratulates you on your success. For the next phase of the training, your chocobo must feel the high winds that his flying forebears once knew. The chocobo trainer suggests two locations suitable for the task: one in the northeast part of Tailfeather, and one in the northwest of Falcon's Nest in the Coerthas western highlands. As the heights are too precarious for a flightless bird to reach, the chocobo trainer suggests that you take in the winds alone, then convey them to <span class=\"highlight\">Companion</span> by way of scent.","You have bathed in the winds of the Dravanian and Coerthan heights, in the hopes that their brisk scent will suffice to awaken your steed's long-forgotten ability of flight. Report your success to Priorfaix.","Priorfaix congratulates you on your efforts, and confirms that <span class=\"highlight\">Companion</span>'s training is now complete. Read the winds closely, and take to the skies atop your loyal steed!"],"objectives":["<span class=\"highlight-yellow\">* This quest has been adjusted. Please abandon it.</span>"],"dialogue":[{"name":"ARNOULAIN","text":"&lt;sniff&gt; &lt;sniff&gt;<br>Phew! Pardon me for saying so, friend, but you stink. Not an unpleasant stink, mind you. Rather, you stink of chocobo─a distinctive scent for which I must confess a certain fondness."},{"name":"ARNOULAIN","text":"&lt;sniff&gt; &lt;sniff&gt; Not the musky aroma of a wild bird, nor the common scent of a rental chocobo who has carried thousands. No, yours is a stink singular and true─would I be correct to surmise that you are the proud owner of your very own bird?"},{"name":"ARNOULAIN","text":"...Of course I am. As a chocobo trainer, I practically sleep in these stables. Gives you a nose for this sort of thing, if you catch my drift. But enough about me─you must tell me all about your faithful steed!"},{"name":"ARNOULAIN","text":"<span class=\"highlight\">Companion</span>, is it? A fine name, that! And issued by your Grand Company, you say?"},{"name":"ARNOULAIN","text":"I know the Grand Companies of Eorzea to have many fine birds in their ranks, but if all you say is true, I daresay your bird is a particularly stalwart specimen!"},{"name":"ARNOULAIN","text":"What's this? Your bird has even been trained in the Fortemps methodology!? I knew I detected a cultured aroma in that scent. Why, I've not sniffed such a remarkable bird in ten─no, twenty years!"},{"name":"ARNOULAIN","text":"Such singular strength and intellect─why, it would not surprise me if your bird could learn to fly!"},{"name":"ARNOULAIN","text":"Oh, I can assure you this is no jest. While it is true that only chocobos black of feather are natural-born flyers, there are records of other breeds that have been trained to take to the skies."},{"name":"ARNOULAIN","text":"I can understand your skepticism, but to a student of chocobo breeding such as myself, this is little surprise. After all, the flyers and the flightless possess common ancestry. The grounded birds do not lack the physical capacity, but that they have merely forgotten how for lack of necessity."},{"name":"ARNOULAIN","text":"I daresay that if any chocobo could be trained to take to the heavens like his feathered forefathers, it is your <span class=\"highlight\">Companion</span>! What say you, friend!?"},{"name":"ARNOULAIN","text":"My brother Priorfaix is a chocobo trainer at Tailfeather, and something of an expert in these training methods. Bring your bird to him, and I tell you, friend, the sky is the limit!"},{"name":"ARNOULAIN","text":"My brother Priorfaix is a chocobo trainer at Tailfeather, and something of an expert in flight training. Bring your bird to him, and I tell you, friend, the sky is the limit!"},{"name":"PRIORFAIX","text":"Oh, you must be the one Arnoulain spoke of! &lt;sniff&gt; &lt;sniff&gt;<br>Yes, there can be no mistaking it! That is the scent of a remarkable bird─a bird who is destined for the heavens!"},{"name":"PRIORFAIX","text":"But why are we talking when we could be flying? Yes, let us begin the training without further ado!"},{"name":"PRIORFAIX","text":"The process of teaching a flightless chocobo to soar involves awakening the instincts of its flying forebears that lie dormant within. The most efficient way to do so is to allow it to experience the life of a wild bird."},{"name":"PRIORFAIX","text":"Take the chocobos that run free throughout the Chocobo Forest. These birds subsist on wild fruits and berries, but to secure sustenance, they must fight for their lives against hordes of vicious insects."},{"name":"PRIORFAIX","text":"Yes, if your <span class=\"highlight\">Companion</span> were to experience the thrill and fear of staring down the bee clouds of Dravania, it might not be long before the blood of a flyer stirs within those veins!"},{"name":"PRIORFAIX","text":"If your <span class=\"highlight\">Companion</span> were to experience the thrill and fear of staring down the bee clouds of Dravania, it might not be long before the blood of a flyer stirs within those veins!"},{"name":"PRIORFAIX","text":"I see that the training goes well. Excellent. In the Chocobo Forest, your bird experienced the thrill of battle, and heard with its own ears the buzzing of those infernal bees."},{"name":"PRIORFAIX","text":"Many scholars posit that this sound plays an important role in awakening the dormant abilities of a flightless bird. Most chocobos that we export are captured not long after they leave the nest─likely your bird is hearing these sounds for the first time in its life."},{"name":"PRIORFAIX","text":"Now for the next stage in the training. Your chocobo must feel the same wind that its ancestors once knew."},{"name":"PRIORFAIX","text":"And yet this wind blows in a place that the average bird would be hard-pressed to reach. Fortunately, the chocobo has a keen sense of smell─and that is where you come in, friend."},{"name":"PRIORFAIX","text":"Travel to the highest points near Tailfeather and Falcon's Nest. Let the wind embrace you, and let your bird take in the scent. Surely this will go far to awaken the memories of <span class=\"highlight\">Companion</span>'s high-flying forebears!"},{"name":"PRIORFAIX","text":"Travel to the highest points near Tailfeather and Falcon's Nest. Let the wind embrace you, and let your bird take in the scent. Surely this will go far to awaken the memories of <span class=\"highlight\">Companion</span>'s high-flying forebears!"},{"name":"SYSTEM","text":"The crisp winds of the Dravanian forelands envelop you.<br>What memories will they awaken within <span class=\"highlight\">Companion</span>?"},{"name":"SYSTEM","text":"The brisk winds of Coerthas envelop you.<br>What memories will they awaken within <span class=\"highlight\">Companion</span>?"},{"name":"PRIORFAIX","text":"&lt;sniff&gt; &lt;sniff&gt;<br>I can smell the winds upon you, friend. I have no doubt that the same can be said of your faithful <span class=\"highlight\">Companion</span>. With this, your bird's training is complete."},{"name":"PRIORFAIX","text":"The final stage of the training is yours. You need only learn to read the winds, that you might lead your chocobo safely and surely upon them."},{"name":"PRIORFAIX","text":"To read the winds, you must be attuned to the currents of aether. Yes, read them well, send your bird soaring high into the heavens!"},{"name":"PRIORFAIX","text":"Be proud of <span class=\"highlight\">Companion</span>, friend, for only the bravest and brightest of birds succeed in learning to fly. I gladly give you this as a reward to the both of you. Be well, and may we meet again in the skies above!"},{"name":"SYSTEM","text":"<span class=\"highlight\">Companion</span> has learned to fly!"}],"reward":{"xp":26400},"reqs":{"jobs":[{"lvl":52,"id":34}],"questsType":"all","quests":[66698,67145]}},"partials":[{"type":"npc","id":"1011921","obj":{"i":1011921,"n":"Priorfaix","l":2000,"q":3}},{"type":"quest","id":"66698","obj":{"i":66698,"n":"My Feisty Little Chocobo","g":92,"l":"South Shroud","s":300,"f":1}},{"type":"quest","id":"67145","obj":{"i":67145,"n":"Where the Chocobos Roam","g":3,"l":"Coerthas Western Highlands","s":30}}]}