{"quest":{"name":"Thok Around the Clock","location":"The Rising Stones","id":67652,"patch":3.0,"sort":16102,"icon":112107,"unlocksFunction":1,"eventIcon":71341,"issuer":1014565,"target":1014565,"involved":[1011928],"genre":17,"journal":["Unukalhai would have you face the Lord of the Hive once more.","Unukalhai bids you return to Thok ast Thok, where the resurgent Lord of the Hive builds his strength in eager anticipation. Doubtful that the act of surrendering will fool the Gnath a second time, the boy presents you with a gemstone, the Burning Eye of Ravana, and sends you to speak with the elder of the Nonmind. Travel to Loth ast Vath, and consult with the Vath storyteller about a new path into Ravana's domain.","You speak with the Vath elder, and he tells you of an aetheryte found inside a sacred cave on the far side of the colony. He warns you, however, that the wards placed upon the crystalline structure will admit only the most worthy of warriors...whatever that might mean. Make your way to the Gynehive in Loth ast Gnath, and attune to the Gnathic aetheryte.","You smash the gemstone against the aetheryte...and nothing much happens. You then proceed to attune to the aetheryte without difficulty, the invisible wards seemingly satisfied by the sacrifice of Unukalhai's bauble. Prove yourself now a worthy challenger, and vanquish the unbridled Wrath of the Colony!<br><br>※Thok ast Thok (Extreme) can be accessed via the Duty Finder.","Once more have you faced the savage prowess of the Master of the Sacred Blades, and once more have you prevailed. Return to the hive of the Nonmind and report Ravana's defeat to the Vath storyteller.","You bring the storyteller tidings of your victory, and the elder is curious to learn how you broke through the aetheryte's powerful wards. Upon hearing your description of the gemstone, he seems overcome by memories of ancient tales─of knowledge he once shared as a subject of the Overmind. The excited Vath claims that the Burning Eye of Ravana was a relic of legend, long sought by the Gnath that it might be returned to their reborn deity. Your great worth, he insists, was proven when you remained unharmed by the eye's searing touch. Though confused by your mention of Unukalhai, the elder nevertheless celebrates your triumph, and vows that the Nonmind shall tell the story of your deeds for generations to come.","Unukalhai welcomes your return. It seems that the strange visitor is already well aware of the Lord of the Hive's downfall, and he gravely acknowledges the completion of your perilous deed."],"objectives":["Speak with the Vath storyteller at Loth ast Vath.","Attune to the aetheryte in the Gynehive.","Confront Ravana in Thok ast Thok (Extreme).","Return to the Vath storyteller.","Speak with Unukalhai in the Rising Stones."],"dialogue":[{"name":"UNUKALHAI","text":"As you prepare yourself for battle, so, too, does Ravana..."},{"name":"UNUKALHAI","text":"Within Thok ast Thok he builds his strength, feeding upon the prayers of his innumerable children. But those same children will not suffer you to live should you surrender yourself to them a second time."},{"name":"UNUKALHAI","text":"Nay, you must devise a new way of approaching the Lord of the Hive's domain. Consult with the storyteller, the elder of the Vath, and he will aid in this endeavor."},{"name":"UNUKALHAI","text":"Take this bauble. 'Tis known among the Gnath as the Burning Eye of Ravana. When the time comes, you will know what to do..."},{"name":"UNUKALHAI","text":"The Lord of the Hive crouches within Thok ast Thok, sharpening his blades in anticipation of coming conflict. I ask that you grant him the violence he craves."},{"name":"UNUKALHAI","text":"His children, however, will not be deceived a second time. Speak with the storyteller of the Vath, and devise a new approach into Ravana's domain."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; Ah, our hunter friend. Welcome.<br>...You come hunting gods once more?"},{"name":"STORYTELLER","text":"The Nonmind is glad of your thirst for divine blood. Ever more rapacious do the Onemind grow as they seek offerings to glut our deity's insatiable appetite."},{"name":"STORYTELLER","text":"...Another path to our god's domain? Yes...yes, there is but one way. You must seek out the Gynehive on the far side of the colony, and attune your spirit to the aetheryte ensconced within."},{"name":"STORYTELLER","text":"But the deed is not possible─we hear that the crystal is warded by ancient ritual magicks. The Onemind have woven the seal such that only the most worthy of warriors shall be granted leave to enter Thok ast Thok. And they do not share with the Nonmind what they consider “worthy”..."},{"name":"STORYTELLER","text":"The path into Thok ast Thok is closed to all but the most worthy of warriors. You are strong, hunter, but we would be sad should you slaughter your way to the Gynehive only to be trapped inside with a warded aetheryte..."},{"name":"SYSTEM","text":"After a pause, you smash the gemstone against the aetheryte. Nothing much happens. Out of habit, you attune with the aetheryte...and once more, nothing much happens."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; ...Once more have you slain our ravening god! Your tribe must think you a great hunter indeed!"},{"name":"STORYTELLER","text":"Even the Onemind must begin to appreciate the folly of their wasteful summonings..."},{"name":"STORYTELLER","text":"But tell us, great hunter: how were you able to pass the seal? Did it simply melt away at the approach of your indomitable presence?"},{"name":"STORYTELLER","text":"...A gemstone of fire and earth? Hmmm. There is something...a memory we have from the Overmind, before we were cast out... A memory of the Burning Eye of Ravana!"},{"name":"STORYTELLER","text":"The Overmind has recollections of legends a hundred generations old. We remember the tale of our god as He once was─an all-devouring beast whose eye was torn from Him by an invading tribe. The Gnath have sought to recover this lost relic for centuries, that it might be rejoined with Ravana reborn.<br>But even were it found, it is said that only the most worthy of warriors can bear its searing touch... I now understand why the seal granted you passage. But tell us, great hunter: how came you by the eye?"},{"name":"STORYTELLER","text":"...A youngling named Unukalhai? Your deed has returned many memories to the surface of our mind, but that name is not among them. To gift you with such a prize, he, too, must have thought you worthy."},{"name":"STORYTELLER","text":"We thank you, great hunter. Too soon do our memories from the Overmind fade, but you have given us a new story to tell..."},{"name":"STORYTELLER","text":"Your deeds are become legend amongst the Vath, great hunter. We will tell your story for generations to come."},{"name":"UNUKALHAI","text":"And thus is the Lord of the Hive's essence returned unto the land."},{"name":"UNUKALHAI","text":"Now, must you set your gaze upon Bismarck, Lord of the Mists."},{"name":"UNUKALHAI","text":"The white whale takes for his domain the entirety of the Sea of Clouds. The hunt for this celestial wanderer will be neither straightforward nor simple..."},{"name":"UNUKALHAI","text":"And thus has the essence of Ravana joined that of the Lord of the Mists in its return unto the land."},{"name":"UNUKALHAI","text":"You have my gratitude, Warrior of Light. Without your valiant efforts, these primal terrors would have invited devastation on a cataclysmic scale."},{"name":"UNUKALHAI","text":"...For unlike others of their ilk, Bismarck and Ravana both harbor the desire─and the power─to reach Azys Lla."},{"name":"UNUKALHAI","text":"It is with dreadful certainty that I sensed their intent to feed on the strength of the Warring Triad, and thereby amplify their own power by an order of magnitude."},{"name":"UNUKALHAI","text":"By what wisdom do I claim such certainty? I am gifted with... How shall I put this? An intimate knowledge of the primal mind."},{"name":"UNUKALHAI","text":"You are curious, I am sure. But you need not understand the nature of a power to use it, do you? It is much the same with the Echo, I imagine."},{"name":"UNUKALHAI","text":"Ah, the realm of Eorzea... Ever has it been a land embraced by gods. For weal or for woe, I should wonder."},{"name":"UNUKALHAI","text":"For the time being, I shall remain here in the Rising Stones, and assist Urianger with his research into the eikons. If you should require aught further of me...simply ask."}],"reward":{"gil":5000,"xp":0,"instance":20032},"reqs":{"jobs":[{"lvl":60,"id":34}],"questsType":"all","quests":[67205,67650]}},"partials":[{"type":"npc","id":"1014565","obj":{"i":1014565,"n":"Unukalhai","l":481,"q":9}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"instance","id":"20032","obj":{"i":20032,"n":"Thok ast Thok (Extreme)","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":175}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"67650","obj":{"i":67650,"n":"Gods of Eld","g":17,"l":"Ishgard","s":16001,"f":1}}]}