{"quest":{"name":"Jihli Dreams of Egg Hunts","location":"Gridania","id":67664,"patch":3.2,"sort":101,"icon":100533,"eventIcon":71221,"issuer":1016894,"target":1016895,"genre":199,"journal":["Jihli Aliapoh's face lights up as she sees you approach.<br>※This quest is available for a limited time only.","Jihli joyfully fills you in on a dream she had, which she believes to be a vision sent from the Twelve Archons, past heroes of legend. The mirthful Miqo'te dreamt of a scene of revelry with Eorzeans from all over gathering in Gridania to participate in an egg hunt and other festivities. Although the dream grew too bright to see it herself, she recalls with confidence that at the height of the celebration, the so-called Hatching Hour, a chosen egg cracked to reveal a gold treasure. Believing this to be a message sent from the heavens to herald the Archons' forthcoming descent, Jihli asks you to help her recreate the scene in her dream, promising to share the prophesized wealth with you should you succeed. Speak to Nonotta to learn how you can participate.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Nonotta provides you with more details about how to successfully recreate Jihli's vision in order for the golden treasure to appear. She explains that the Dreamers, along with Black Rabbit Traders of Gridania, have set up three Hatching-tide activities for the realm to enjoy. Once you have completed each activity at least once, she asks you check with her to see if they are any closer to the Hatching Hour."],"objectives":["Speak with Nonotta."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Greetings, friend! Have our spirited adornments caught your eye? Perhaps you too are an egg enthusiast?"},{"name":"JIHLIALIAPOH","text":"Wait a moment, I know you! You're <span class=\"highlight\">Forename</span>, the bearer of fortune who guided me during our last festival. What luck to meet you again!"},{"name":"JIHLIALIAPOH","text":"While I saw that prophecy fulfilled, my work is far from over. After all, our heroes have yet to grace us with their presence! Thus the Dreamers and I have spent day after day continuing to paint, dye, and etch the finest vessels for the Archons, all of which you see before you."},{"name":"JIHLIALIAPOH","text":"Well then, allow me to introduce myself. I am Jihli Aliapoh, and you are...? Well, <span class=\"highlight\">Forename</span>, I spend my days spreading the news of Hatching–tide! How did this fascination with eggs come about, you ask? Well, it started with a dream; although I was quite literally asleep!"},{"name":"JIHLIALIAPOH","text":"The Twelve Archons, heroes of the past, blessed me with a grand vision. They descended from the heavens upon beautiful decorated eggs and delivered unto me a message: to prepare like carriages for their return to Eorzea. Along with my fellow believers, the Dreamers, I have dedicated my life to this pursuit!"},{"name":"JIHLIALIAPOH","text":"And it would seem our toils have borne fruit. For you see, the Archons have granted me yet another vision, this one more vivid than the last. So vivid, in fact, that I was nearly blinded by its radiance. It was a shining, golden treasure!"},{"name":"JIHLIALIAPOH","text":"I dreamt that adventurers from all walks of life gathered to rejoice by pursuing an egg hunt and participating in delightful diversions. And at the height of the festivities, the Hatching Hour came and a chosen egg cracked, revealing unto us the miracle."},{"name":"JIHLIALIAPOH","text":"I thought to myself, if we can re-enact that marvelous scene of revelry, then surely this golden treasure will be ours, here in the corporeal realm. By sharing this treasure with all who believe, surely the Archons will be pleased, thus encouraging their triumphant return."},{"name":"JIHLIALIAPOH","text":"You will help us, won't you? If you do, I promise you will not leave empty-handed, for the Archons' treasure is for all to share. Speak to my good friend, Nonotta, and she can give you more details on how to participate."},{"name":"JIHLIALIAPOH","text":"Come, we have a prophecy to fulfill! Join us in our festivities so the golden treasure will be ours!"},{"name":"NONOTTA","text":"Oh, it's <span class=\"highlight\">Forename</span>! Do you remember me? Oh, I do hope you forgive us for playing that trick on you last time. But her dream <span class=\"emphasis\">did</span> come true, right? And I have faith this one will come true as well."},{"name":"NONOTTA","text":"A happy Hatching–tide to you! I am Nonotta, Jihli's right-hand Dreamer! She told you the joyous news, I trust? Oh, I cannot wait to see what the Archons have in store for us. I have seen Jihli's dreams come true before, and I know it will happen this time, too."},{"name":"NONOTTA","text":"Therefore, every detail must be absolutely perfect! I have made it my duty to provide the proper atmosphere, recreating everything just as Jihli dreamt. All we need now is a cheerful crowd of revelers!"},{"name":"NONOTTA","text":"With the gracious assistance of Black Rabbit Traders, we have prepared three activities for the festival. You may complete these activities to earn fortune eggs, which can then be exchanged for fabulous prizes!"},{"name":"NONOTTA","text":"But of course, the most important thing is to have fun! After you've participated in each event at least once, come back to me. I will tell you if we are close to the Hatching Hour."},{"name":"SYSTEM","text":"By completing one of three repeatable quests, you will obtain a fortune egg which can be exchanged for Hatching–tide seasonal goods."},{"name":"SYSTEM","text":"You can also obtain fortune eggs by participating in the FATE “Eggstract and Eggspedite” in Gridania."}],"reward":{"gil":200,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67665,67666,67667]},"partials":[{"type":"npc","id":"1016894","obj":{"i":1016894,"n":"Jihli Aliapoh","l":53,"q":1}},{"type":"npc","id":"1016895","obj":{"i":1016895,"n":"Nonotta","l":53,"q":2}},{"type":"quest","id":"67665","obj":{"i":67665,"n":"Pass the Poacher","g":199,"l":"Gridania","s":102,"r":1}},{"type":"quest","id":"67666","obj":{"i":67666,"n":"Hard-boiled Hocus","g":199,"l":"Gridania","s":103,"r":1}},{"type":"quest","id":"67667","obj":{"i":67667,"n":"Spriggan Scramble","g":199,"l":"Gridania","s":104,"r":1}}]}