{"quest":{"name":"An Adventurer's Life for Me","location":"Eastern La Noscea","id":67663,"patch":3.07,"sort":86,"icon":100461,"eventIcon":71221,"issuer":1015611,"target":1015630,"genre":201,"usedItems":[10333],"journal":["P'obyano is waiting for someone to ask her about her special prize.<br>※This quest is available for a limited time only.","P'obyano eagerly explains that in order to receive her special reward, you must deliver to her seven Faire tokens. Complete various tasks around the beach, and return to P'obyano once you have gathered seven Faire tokens.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","P'obyano happily accepts your Faire tokens, but before she can give you her reward, a burly Roegadyn pirate frightens the faire-goers on the beach away. Gegeruju, displeased that someone would dare to disturb his gazing, demands that something be done. P'obyano determines that the best course of action is to try and reach a peaceful resolution with the pirate, and requests your support. She asks you to go ahead and look for Wunthyll while she finds someone to run the stall in her absence.","It appears Wunthyll is part of a group that was meant to settle the lands surrounding Bloodshore. The group worked hard to make an honest living, until one day Gegeruju bought the land, and the troubled settlers returned to a life of piracy. P'obyano sympathizes with the group's hardship, but insists that piracy is not the only way to make one's way in life. Sensing a golden opportunity, she suggests that the pirate join the Adventurers' Guild. The pirate is eventually convinced to seriously consider a change in careers, and even offers to tell his fellow pirates about the opportunity. P'obyano seems satisfied with this conclusion and returns to her duties at the faire, and from now on will treat pirates with the same consideration as other guests. With the main problems of the faire solved, now there is nothing left to do but revel in the beachfront festivities."],"objectives":["Deliver Faire tokens to P'obyano.","Search for Wunthyll."],"dialogue":[{"name":"POBYANO","text":"I wager you're eager to hear about my <span class=\"emphasis\">special</span> prize, huh? Well, only brave and industrious adventurers who manage to collect seven Faire tokens are worthy to receive it. Trust me─you won't regret it!"},{"name":"POBYANO","text":"Once you've collected seven of the tokens, bring them to me. I'll be waiting for you!"},{"name":"SYSTEM","text":"To proceed with this quest, you must be in possession of seven or more Faire tokens."},{"name":"POBYANO","text":"Only seven Faire tokens for my special prize! So, how many have you brought?"},{"name":"POBYANO","text":"The Adventurers' Guild thanks you! The Moonfire Faire is shaping up to be a rousing success!"},{"name":"POBYANO","text":"I was afraid this year's faire would be a disaster due to all our difficulties, but people from malms around have showed up for the food and festivities."},{"name":"GEGERUJU","text":"Hohoho! The beach is alive with such heavenly sights and sounds!"},{"name":"POBYANO","text":"Master Gegeruju is certainly enjoying himself."},{"name":"WUNTHYLL","text":"(-???-)Move yer arses! This beach belongs to us!"},{"name":"MIZUGIGAL02127","text":"(-Revelers-)Ahhh!"},{"name":"GEGERUJU","text":"What!? Is that a...<span class=\"emphasis\">pirate</span>!? He's frightening off the lovely scenery─you must do something about this at once!"},{"name":"POBYANO","text":"Y-Yes, of course, Master Gegeruju. We're already dealing with the problem."},{"name":"POBYANO","text":"My apologies, <span class=\"highlight\">Forename</span>, but I've one last thing to ask you before you get your reward."},{"name":"POBYANO","text":"We can't have pirates harassing our guests and disturbing the faire. There must be a way we can solve this peacefully..."},{"name":"POBYANO","text":"I've a mind to go speak with him myself. But, you saw how angry he was─I dare not go alone! Please accompany me, <span class=\"highlight\">Forename</span>. Go ahead and I'll catch up after I've found someone to look after the stall."},{"name":"POBYANO","text":"I need to find someone to run the stall while I'm gone. I'll be right behind you!"},{"name":"POBYANO","text":"You! You were the one storming up and down the beach, scaring our guests! What gives you the right!?"},{"name":"WUNTHYLL","text":"You'd best get back to your stall, 'less you're itchin' for a fight!"},{"name":"POBYANO","text":"The only thing I'm <span class=\"emphasis\">itchin'</span> for is to fill our guests' stomachs with battered fish! I might be kind enough to give you one if you tell me why you insist on sabotaging our faire."},{"name":"WUNTHYLL","text":"Hmph, so you wanna know what's got us angry? Well, if it means a free meal, I might as well tell you our tale."},{"name":"WUNTHYLL","text":"Ye see, this land was once ours to settle under the Admiral's settlement initiative. The cruel salt of the sea made tillin' the soil near impossible, but the blood and sweat we put into our work made us love it nonetheless."},{"name":"WUNTHYLL","text":"Then Gegeruju struts in and buys up all of it from under us. Land that was <span class=\"emphasis\">ours</span> by rights!"},{"name":"WUNTHYLL","text":"What's a landless lot like us to do but turn back to piracy!? And to see people makin' merry on beaches that were once ours... It makes my blood boil!"},{"name":"POBYANO","text":"What you went through... It'd make anyone angry. But this land was never fit for settling. Might be it was put to better use when Master Gegeruju turned it into one of La Noscea's premier resorts."},{"name":"POBYANO","text":"Limsa Lominsa received a hefty sum of coin for this land─coin which was probably used to help others in trouble. There might be blame for your troubles to go around, but what's done is done, and there's no choice but to keep going."},{"name":"POBYANO","text":"You might've lost your land, but piracy isn't the only way to make a living. There's plenty of options─like adventuring!"},{"name":"POBYANO","text":"We get all kinds of requests for work at the guild. You've had plenty of practice with a blade, right? You'd never want for work with us!"},{"name":"WUNTHYLL","text":"Join your guild!? I'd rather drink my fill of seawater!"},{"name":"WUNTHYLL","text":"Get out of here, if you know what's good for you!"},{"name":"WUNTHYLL","text":"You... Who in the hells're you?"},{"name":"POBYANO","text":"<span class=\"highlight\">Forename</span>'s been kind enough to help out around the faire!"},{"name":"WUNTHYLL","text":"<span class=\"highlight\">Forename</span>? That name rings familiar..."},{"name":"WUNTHYLL","text":"Yes, I've heard tell of your deeds while drinkin' at the Drownin' Wench. Made for a good bit of entertainment, they did. Didn't expect to see you here helpin' with the faire, though!"},{"name":"POBYANO","text":"Work hard with the Adventurers' Guild, and people might tell stories about <span class=\"emphasis\">you</span> over cups of mead! Ain't that better than a life of piracy?"},{"name":"WUNTHYLL","text":"You mean...<span class=\"emphasis\">I</span> could become a storied adventurer!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Many have done it before."},{"name":"A1","text":"You won't know until you try."},{"name":"WUNTHYLL","text":"You don't say... I've never considered an adventurer's life. But now that you mention it, I think it just might work."},{"name":"WUNTHYLL","text":"You're right, I'll only find out by tryin'. Gotta start from the bottom. Ain't no value without hard work, I suppose."},{"name":"POBYANO","text":"In fact, the Moonfire Faire's being put on by the Adventurers' Guild! Just give us a shout at the stall, and we can tell you all about the work that we do."},{"name":"WUNTHYLL","text":"Ah, so it was your guild. Let me think on the offer. I'll tell my companions as well. Might be there's some that'll be interested."},{"name":"POBYANO","text":"Well, that was the most thrilling part of my day! Thankfully you were by my side, else I would've forgotten what to say!"},{"name":"POBYANO","text":"Well, I suppose it's time to return to hosting the stall. The Adventurers' Guild will do its best to welcome even pirates with open arms. And for all your help, I suppose you finally deserve your reward. You've earned it!"}],"reward":{"gil":1364,"items":[{"id":10316},{"id":10317}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[67660]}},"partials":[{"type":"npc","id":"1015611","obj":{"i":1015611,"n":"P'obyano","l":32,"q":2}},{"type":"npc","id":"1015630","obj":{"i":1015630,"n":"Wunthyll","l":32,"q":1}},{"type":"item","id":"10316","obj":{"i":10316,"n":"Southern Seas Vest","l":1,"c":48925,"t":35,"p":59}},{"type":"item","id":"10317","obj":{"i":10317,"n":"Southern Seas Swimsuit","l":1,"c":48927,"t":35,"p":59}},{"type":"item","id":"10333","obj":{"i":10333,"n":"Faire Token XV","l":1,"c":25918,"t":85}},{"type":"quest","id":"67660","obj":{"i":67660,"n":"Reigniting the Festivities","g":201,"l":"Limsa Lominsa","s":83}}]}