{"quest":{"name":"Reigniting the Festivities","location":"Limsa Lominsa","id":67660,"patch":3.07,"sort":83,"icon":100459,"eventIcon":71221,"issuer":1015616,"target":1015611,"genre":201,"journal":["The Moonfire Faire is in full swing, and Haermaga is ready to outdo himself once again─with the help of a certain adventurer.<br>※This quest is available for a limited time only.","Once again it is time for the Moonfire Faire, and the Adventurers' Guild is in need of extra hands to help make it the most memorable one yet. Haermaga has asked you to assist the chaperones at Costa del Sol with the many problems they are facing. Help the guild with the faire by reporting to the chaperone P'obyano to hear what it is she requires from you.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","P'obyano happily explains that the Adventurers' Guild has no shortage of work for an eager volunteer. A few difficulties are bound to occur during a celebration as exciting as the Moonfire Faire, and right now P'obyano is dealing with unruly pirates, dirty beaches, inquisitive beasts, and hungry customers. Anyone willing to lend their aid can receive Faire tokens as a reward. Choose the tasks most suitable for yourself and ensure that the Moonfire Faire proceeds without a hitch."],"objectives":["Speak with P'obyano at Costa del Sol."],"dialogue":[{"name":"HAERMAGA","text":"See all those balloons? That's right, the Moonfire Faire's back, and promises to be the most explosive yet! What's the Moonfire Faire, you ask? Well, the first one was held five years ago, to beat back the Bombards that threatened to burn the realm to ashes."},{"name":"HAERMAGA","text":"Ah, if it isn't <span class=\"highlight\">Forename</span>! As you can see, the Moonfire Faire is back, and more explosive than ever. Ever since the Bombards were beat back five years ago, we've kept the tradition strong in remembrance."},{"name":"HAERMAGA","text":"Now, it's been a while since anyone's seen a Bombard, but that doesn't mean we can't celebrate every year─and maybe even get a few more interested in joining the guild while we're at it."},{"name":"HAERMAGA","text":"Of course, we wouldn't call it a faire if all we cared about was recruiting new members. Nay, our main purpose is to win the hearts of the common people with unforgettable food and other goods."},{"name":"HAERMAGA","text":"You look like quite the adventurer yourself, and we need all the help we can muster. The festivities are underway at Costa del Sol, but the chaperones are facing a host of problems that're threatening to ruin the atmosphere."},{"name":"HAERMAGA","text":"Last year's faire was a rousing success thanks to you, and it just so happens we could use your aid again. Our chaperones in Costa del Sol are dealing with a host of problems that threaten to ruin the atmosphere."},{"name":"HAERMAGA","text":"Please, we can't let our hard work go to waste! Make your way to the beaches of Costa del Sol to speak with our chaperone P'obyano─the guild is counting on you!"},{"name":"HAERMAGA","text":"We underestimated the number of hands we'd need at this year's faire. If there was ever a time the Adventurers' Guild needed your help, it's now."},{"name":"POBYANO","text":"Ah, so you're the adventurer Haermaga sent word of? What's your name, friend?"},{"name":"POBYANO","text":"<span class=\"highlight\">Forename Surname</span>? Pleased to make your acquaintance. It's always an honor to meet a guildmate that's eager to help out!"},{"name":"POBYANO","text":"Thanks to the efforts of members like you, there's no shortage of work to go around. In fact, you might even say there's <span class=\"emphasis\">too</span> much."},{"name":"POBYANO","text":"That's why this faire is so important─we need to attract as many potential new guildmates as possible! So this year, we wanted to host it in a location that'd bring people from malms around."},{"name":"POBYANO","text":"With beautiful beaches of silky-soft sand, we decided Costa del Sol was the perfect place! And thanks to Master Gegeruju, our dream is a reality."},{"name":"GEGERUJU","text":"It seems the faire is coming along nicely. It has been too, too long since the last Moonfire Faire. You could not have picked a more fitting place than Costa del Sol!"},{"name":"PEBALOH","text":"Master Gegeruju fearlessly met the Bombards in battle, surrounded by his faithful maidservants. Our armor held fast against their flames until we were victorious. Truly, it was a sight to behold."},{"name":"POBYANO","text":"Armor...? Truth be told, it didn't look too different than what I'm wearing now."},{"name":"POBYANO","text":"Gegeruju certainly seems to be looking forward to the faire... Ah, well, as long as he's letting us use his land. He also provides our guild with plenty of work through the petitioning of guildleves."},{"name":"POBYANO","text":"Anyroad, I know you've come here to help, and there's no end to the troubles we're facing. We've got pirates, dirty beaches, and nosy beasts aplenty."},{"name":"POBYANO","text":"Over there's our head cook, C'zibho Tia."},{"name":"POBYANO","text":"And over there's Espan. Both of them've been going on about needing more help, so either'll be glad to receive yours."},{"name":"POBYANO","text":"Now, we're not asking you to do this all for free, oh no! You'll receive Faire tokens for your troubles, which you can exchange for all kinds of wonderful gifts."},{"name":"POBYANO","text":"What's more, I've prepared a special gift for our most devoted supporters. Talk to me again if that piques your interest!"},{"name":"POBYANO","text":"Once you're ready to lend a hand, speak to one of our chaperones. I'm sure with your help, this year's Moonfire Faire'll be one to remember!"},{"name":"SYSTEM","text":"Faire tokens can be obtained from participating in FATEs occurring around Costa del Sol."},{"name":"SYSTEM","text":"Faire tokens can also be obtained by completing quests from C'zibho Tia and Espan."}],"reward":{"gil":529,"items":[{"num":30,"id":5890},{"num":30,"id":5891},{"num":30,"id":5892}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[67661,67662,67663]},"partials":[{"type":"npc","id":"1015616","obj":{"i":1015616,"n":"Haermaga","l":28,"q":1}},{"type":"npc","id":"1015611","obj":{"i":1015611,"n":"P'obyano","l":32,"q":2}},{"type":"item","id":"5890","obj":{"i":5890,"n":"Storm Tracer","l":1,"c":22647,"t":85,"p":8}},{"type":"item","id":"5891","obj":{"i":5891,"n":"Flame Tracer","l":1,"c":22645,"t":85,"p":8}},{"type":"item","id":"5892","obj":{"i":5892,"n":"Serpent Tracer","l":1,"c":22646,"t":85,"p":8}},{"type":"quest","id":"67661","obj":{"i":67661,"n":"A Matter of Taste","g":201,"l":"Eastern La Noscea","s":84,"r":1}},{"type":"quest","id":"67662","obj":{"i":67662,"n":"What's in the Dish","g":201,"l":"Eastern La Noscea","s":85,"r":1}},{"type":"quest","id":"67663","obj":{"i":67663,"n":"An Adventurer's Life for Me","g":201,"l":"Eastern La Noscea","s":86}}]}