{"quest":{"name":"A Complete Game Changer","location":"Ul'dah","id":67677,"patch":3.35,"sort":116,"icon":100564,"eventIcon":71221,"issuer":1017234,"target":1017235,"involved":[1000470,1000474,1000734],"genre":207,"journal":["The poor-heeled youth is visibly vexed.<br>※This quest is available for a limited time only.","In Ul'dah you come across a poor-heeled youth, who has recently suffered a string of losses at the Gold Saucer's Lord of Verminion game. The youth tells you of the time and dedication he put towards building his minion army, only to have it soundly defeated over and over again by a mysterious newcomer, who possessed minions the likes of which he had never seen before. The youth accused his opponent of cheating, only to be told that the newfangled minions were sanctioned for use in the arena. Wallowing in his defeat, the poor-heeled youth claims to have had enough, and mutters that you can see the man's peculiar minions for yourself if you go to the Gold Saucer.<br><br>※Please note that you will be unable to complete this quest after the event has ended. For details, please check the Lodestone.","At the Gold Saucer, you come across a well-dressed Au Ra who fits the description given by the peevish man in Ul'dah, and sure enough by his side is a jaunty scarlet cat with flaming twin tails. The Au Ra acknowledges your presence, but says he is otherwise occupied. However, he soon changes his mind when he realizes you are an adventurer and presents you with a proposition; he will tell you more about his scarlet cat if you are able to help him. You accept and he introduces himself as the wandering executive, so called as he travels often from the company he manages in his homeland. The wandering executive asks you to locate his traveling companion, who he fears has gotten lost on his way to the Gold Saucer. He informs you that the Black Shroud was the last place they were together before his friend scampered off on his own. He then suggests you begin your investigation into his friend's whereabouts at Bentbranch, where some of the locals may have seen him.","You arrive at Bentbranch and ask the locals whether they saw someone fitting the traveling companion's description: round, white, floats in the air, and very talkative. While two of the people you questioned seem to think you mean the moogles of the Twelveswood, one of the hands at the chocobo stables mentions a more promising lead. Aethelthryth tells you there was talk in Gridania about an unnatural being that was sealed away near the Guardian Tree by Seedseer O-App-Pesi, for fear of it corrupting the forest. Head towards the Guardian Tree to see if there are any traces of the supernatural being.","You come upon an ancient stone vessel, which sits idle underneath the Guardian Tree. Confident that the vessel is the same one that O-App-Pesi employed to confine the being, you hold your breath and release what the Padjals took great pains to seal away. You find yourself lost for words as a fast-talking, floating white creature pops out and introduces himself as Whisper, a Yo-kai. As a reward for freeing him, Whisper bestows upon you a vibrantly colored Yo-kai Watch, which he says will allow you to encounter Yo-kai such as himself. Despite his good intentions, Whisper admits that the watch is broken, but can be easily repaired by his friend. You wait patiently for the sprightly soul to take a breath before mentioning the wandering executive, and he confirms that he is indeed the missing friend that the Au Ra was waiting for at the Gold Saucer. Furthermore, Whisper tells you that upon arrival, the executive might be able to repair the motionless timepiece you received. Depart for the Gold Saucer without further delay to ensure that Whisper returns to his travel party safely.","You arrive at the Gold Saucer to see Whisper safely reunited, and the wandering executive apprised of what happened to the specter. Whisper also appears to have mentioned the Yo-kai Watch to the wandering executive, who gladly repairs it for you. Gratified for finding his traveling companion, the wandering executive proceeds to fulfill his end of the deal. He explains that the “minions” he brought with him are Yo-kai like Whisper. Asking you to call him by his real name, Nohi, he then gladly offers his services to introduce you to the supernatural creatures and his cache of exotic weapons, in exchange for Yo-kai Medals scattered about the realm. Could this be the beginning of a beautiful friendship?<br><br>Yo-kai Medals can be obtained by participating in FATEs in the following areas while equipped with the Yo-kai Watch:<br>The Black Shroud: Central, East, South, and North<br>La Noscea: Middle, Lower, Western, Upper, and Outer<br>Thanalan: Central, Western, Eastern, and Southern<br><br>Legendary Medals can be obtained, albeit at a low probability, in FATEs in areas designated in the Yo-kai Medallium while accompanied by the Yo-kai minion designated on the medal."],"objectives":["Speak with the wandering executive at the Gold Saucer.","Gather information at Bentbranch Meadows.","Investigate the area near the Guardian Tree.","Deliver the Yo-kai Watch to the wandering executive."],"dialogue":[{"name":"LOSER02141","text":"Argh, how could I have lost? My strategy was foolproof! Listen, friend, if you have an inclination towards that Lord of Verminion game at the Gold Saucer, I'd say you'd best think twice."},{"name":"LOSER02141","text":"I spent a fortune on my critters, and had scores of victories to boast. Then some <span class=\"emphasis\">newcomer</span> waltzed up and challenged me. I knew there was something strange about him─an Au Ra with hair of vibrant hue, glint in his eye, called himself the “maundering executive” or some such."},{"name":"LOSER02141","text":"Still, I'm not one to turn down a match, novice or veteran. Hells, I even gave him a head start. But the minions he used, they weren't like any I've ever seen before! They were <span class=\"emphasis\">demons</span>, I tell you!"},{"name":"LOSER02141","text":"I accused him of cheating, but he said he had petitioned the Gold Saucer to use them for battle...and the little buggers were approved! Needless to say, my beloved team was torn to shreds every time."},{"name":"LOSER02141","text":"Seems like anything qualifies these days. I've completely lost my appetite for the game, but if you're curious about these so-called minions, you should head over to the Gold Saucer and take a look yourself. He was still loitering around there when I left."},{"name":"LOSER02141","text":"...That blank stare tells me you have no idea what I've been rambling on about. I'd give you a ticket if I had a spare. Hmmm... My well-heeled brother tends to flaunt his winnings around here, and he usually has more than a few on hand. See if he can't help you out."},{"name":"LOSER02141","text":"And that red monstrosity... I've never seen a cat like it. Where in the seven hells did he get it?"},{"name":"HINOSHIN","text":"Can I help you? Ah, I suppose word has gotten around about this little fellow. I would be delighted to tell you about him, truly, but I'm afraid I'm preoccupied at the moment. I'm waiting for someone who is unreasonably late."},{"name":"HINOSHIN","text":"Wait...now that I think about it, you're an adventurer, aren't you? Alternatively, I may have a proposition for you."},{"name":"HINOSHIN","text":"If you help me out, I will tell you more about my feline friend here. Do you accept?"},{"name":"Q1","text":"Accept the executive's proposition?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"HINOSHIN","text":"Well, you can't blame me for trying. Good day to you, then."},{"name":"HINOSHIN","text":"And the deal is struck. Allow me to introduce myself."},{"name":"HINOSHIN","text":"I am a tradesman come from far beyond the borders of Eorzea. Though I am a slave to wanderlust, I occasionally return to my homeland where I manage a sizable company that deals in eccentric commodities. Thus the locals called me “the wandering executive,” and I wear the title with pride."},{"name":"HINOSHIN","text":"I am often accompanied by an erudite traveling companion, but he appears to have gotten quite lost on this journey. We were strolling in the twilight of the Black Shroud when he grew excited and scampered off to do some sightseeing of his own."},{"name":"HINOSHIN","text":"He was aware I had some affairs to take care of here, so I thought to let him enjoy himself while I finished with my tasks and stayed in one spot. But he hasn't shown up in hours. Perhaps you could ask around Bentbranch for me and find out what's keeping him?"},{"name":"HINOSHIN","text":"Oh, I almost forgot to mention. My friend is not of my tribe. He's a rotund little soul, white as snow and floats through the air like a cloud...except if clouds could speak I would hope they wouldn't be as long-winded as he."},{"name":"HINOSHIN","text":"You ask my real name? My apologies, but you must understand I cannot reveal that so readily to someone I barely know in a strange land. If you'll help me by finding my friend, perhaps I will tell it to you."},{"name":"KEITHA","text":"Round, white, and floats through the air? Are you sure it's a <span class=\"emphasis\">person</span>?"},{"name":"KEITHA","text":"'Cause I'd say you're searchin' for one o' them moogles. In any case, you'd be out of luck since they only appear when they want to be seen."},{"name":"KEITHA","text":"I wish I could meet 'em, too! Chocobo chicks have lots of feathered fluff, but I bet nothin' could compare with cuddlin' a moogle."},{"name":"GIAHMOLKOH","text":"That sounds like a moogle, sure enough. Quiet as a mouse when they're hiding, but once they reveal themselves they never stop chattering. The one I saw a few nights ago was hundreds of yalms away and I could still hear his voice."},{"name":"GIAHMOLKOH","text":"I was peering off into the distance between the boughs of the trees, when I sighted a well-dressed Au Ra traveler, with fiery violet hair and a moogle flying beside him. It was a strange sight if I do say so myself."},{"name":"GIAHMOLKOH","text":"Granted, I never saw a moogle myself before this instance, but it most assuredly was one."},{"name":"AETHELTHRYTH","text":"Haven't seen anything like that, but it seems too coincidental that there was talk in Gridania recently about an unnatural being that was disturbing the elementals."},{"name":"AETHELTHRYTH","text":"The Padjals were saying they've never seen a spirit like it, and feared it would taint the Twelveswood. Seedseer O-App-Pesi himself sealed it away near the Guardian Tree."},{"name":"AETHELTHRYTH","text":"The Padjals said O-App-Pesi actually struggled to contain the thing, despite being well versed in unnatural phenomena in the forest. What was the word they used to describe it? Slippery?"},{"name":"SYSTEM","text":"A gentle breeze rustles the leaves of the Guardian Tree as the antiquated stone vessel sits unmoving underneath. Nevertheless, you cannot help but feel a shiver up your spine."},{"name":"Q2","text":"Open the stone vessel?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"WHISPER","text":"Ahhh, you have freed me! Much appreciated, much appreciated indeed! But where are my manners? Whisper, at your service! I am a Yo-kai, a supernatural being!"},{"name":"WHISPER","text":"I know, I know. You are wondering why I was in that spooky stone capsule. I was floating along, taking in the scenery when night fell and I lost sight of the path. I wandered until I came across a small boy and asked him how to return to Bentbranch."},{"name":"WHISPER","text":"But that self-righteous horned child declared me an unnatural presence in the forest, and locked me away! Oh, I was so horribly cramped!"},{"name":"WHISPER","text":"Why would he do such a thing to an innocent visitor of his lands? I never said I was an <span class=\"emphasis\">evil</span> supernatural being. I was defenseless, I tell you. Utterly defenseless! Unwary! Vulnerable!"},{"name":"WHISPER","text":"Aaanyway, I happen to come from a tribe of Yo-kai who know how to reward their liberators properly, and therefore, I have a gift to bestow upon you, my new corporeal friend. Here!"},{"name":"WHISPER","text":"That impressive device is a called a Yo-kai Watch. It will allow you to encounter other supernatural beings like myself! With that on your wrist, the mundane will become magnificent! Oh, the unbelievable things you'll see with that watch!"},{"name":"WHISPER","text":"...If it weren't broken. Now, now, do not think I would give my savior a watch <span class=\"emphasis\">entirely</span> beyond repair. It's just that I had not found someone worthy enough for a long time. My friend had been meaning to take a look at it, but─"},{"name":"WHISPER","text":"Yes, that's him all right! He sent you to rescue me? Splendid, splendid! So he was waiting for me at the Gold Saucer, was he? Had I not gotten lost and put in my precarious position, I surely would have set off for the desert at once."},{"name":"WHISPER","text":"Let us depart without delay! If you give the watch to him when we arrive, I am sure he will repair it for you. And <span class=\"emphasis\">then</span> it will allow you to encounter unbelievable beings like myself!"},{"name":"WHISPER","text":"Whew, we've reached the Gold Saucer at last! Now would be the opportune moment to present my pal with that stylish Yo-kai Watch I conferred upon you. He'll find a way to mend it in no time since he's a creator─er, a creative sort! "},{"name":"HINOSHIN","text":"Whisper explained everything that transpired. What luck you were able to find my friend. Had you not, I would have never known he had been sealed inside that vessel! You have my sincerest gratitude."},{"name":"HINOSHIN","text":"He told me you have something to show me as well?"},{"name":"HINOSHIN","text":"Ah, I see. So he decided to give you the Yo-kai Watch. ...A broken Yo-kai Watch, rather."},{"name":"HINOSHIN","text":"However, there's no need to worry. Whatever my spirited companion did to it appears to be completely reparable. Wait a moment while I get out my tools."},{"name":"HINOSHIN","text":"Mmmhm... Yes, I see... Unjam the slot... Set that hand back a couple of ticks... Polish up the face and..."},{"name":"HINOSHIN","text":"Success! Your watch is now in excellent shape. Go on, take it!"},{"name":"HINOSHIN","text":"And a bargain is a bargain. You wished to know more about my mysterious minions, yes?"},{"name":"HINOSHIN","text":"I'm certain Whisper mentioned the Yo-kai to you. I brought a handful of these supernatural beings with me from my homeland. Like Whisper, this feisty feline is also a Yo-kai, but from a different tribe."},{"name":"HINOSHIN","text":"Some Yo-kai grow to be quite friendly once they get to know you. Others, however, are mischievous, and to blame for otherwise inexplicable happenings. If you wish, I can introduce you to the more affable ones I've brought."},{"name":"HINOSHIN","text":"Should the Yo-kai warm up to you, they become stalwart allies who you can summon to fight at your command...well, at the Gold Saucer anyway. But there is a slight caveat. I cannot accept Eorzean currency for my services; I deal primarily in Yo-kai Medals."},{"name":"HINOSHIN","text":"I'm feeling generous since you helped me retrieve Whisper, so I'll give you one for free. To obtain more, well, that's where your Yo-kai Watch will come in handy. Should you chance upon certain <span class=\"emphasis\">fate</span>-ful happenings, put the watch on your wrist and you shall be rewarded for your meritorious deeds."},{"name":"HINOSHIN","text":"In addition to the Yo-kai, I also brought other wares which may interest an adventurer like you: exotic weapons, specially designed by the fine artisans of my company. We accept Legendary Medals as payment for these weapons."},{"name":"HINOSHIN","text":"Here. Should our weapons suit your tastes, this Yo-kai Medallium will prove useful in explaining where you can obtain the necessary Legendary Medals for each weapon. A bit of an inconvenience, I know, but I would be a terrible businessman if I simply gave our wares away for free."},{"name":"HINOSHIN","text":"Whew...Whisper's long-windedness is starting to rub off on me. Feel free to speak with me about the Yo-kai or the weapons at your leisure. I still have a few loose ends to tie up here at the Gold Saucer, so trust that I won't be wandering for a while."},{"name":"HINOSHIN","text":"Oh, and my real name is...Nohi. Yes, Nohi. Glad to finally make your acquaintance."},{"name":"WHISPER","text":"Yo-kai Medals are a symbol of entering a sacred bond. More than a friendship, more than a <span class=\"emphasis\">marriage</span>! With the Yo-kai Watch, you will be able to gain those medals. I told you that it would allow you to encounter unbelievable beings, didn't I?"},{"name":"SYSTEM","text":"Yo-kai Medals can be obtained by completing FATEs while equipped with the Yo-kai Watch."},{"name":"SYSTEM","text":"Yo-kai Medals can be found at FATEs in the following areas:"},{"name":"SYSTEM","text":"The Black Shroud: Central, East, South, and North<br>La Noscea: Middle, Lower, Western, Upper, and Outer<br>Thanalan: Central, Western, Eastern, and Southern<br>Coerthas Western Highlands, the Sea of Clouds, the Dravanian Forelands, the Churning Mists, and the Dravanian Hinterlands"},{"name":"SYSTEM","text":"Azys Lla, the Fringes, the Peaks, the Lochs, the Ruby Sea, Yanxia, the Azim Steppe"},{"name":"SYSTEM","text":"Legendary Medals can be obtained, albeit at a low probability, by participating in FATEs in areas designated in the Yo-kai Medallium while accompanied by the Yo-kai minion designated on the medal."},{"name":"SYSTEM","text":"The Yo-kai Medallium can be accessed from the <span class=\"highlight\">Collection</span> menu or the <span class=\"highlight\">Minion Guide</span>."}],"reward":{"gil":1171,"items":[{"id":15222},{"id":15167}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]}},"partials":[{"type":"npc","id":"1017234","obj":{"i":1017234,"n":"Poor-heeled Youth","l":40,"q":1}},{"type":"npc","id":"1017235","obj":{"i":1017235,"n":"Wandering Executive","l":1484,"q":1}},{"type":"npc","id":"1000470","obj":{"i":1000470,"n":"Keitha","l":54,"q":9}},{"type":"npc","id":"1000474","obj":{"i":1000474,"n":"Aethelthryth","l":54,"q":2}},{"type":"npc","id":"1000734","obj":{"i":1000734,"n":"Giah Molkoh","l":54,"q":2}},{"type":"item","id":"15222","obj":{"i":15222,"n":"Yo-kai Watch","l":1,"c":55750,"t":42,"p":100}},{"type":"item","id":"15167","obj":{"i":15167,"n":"Yo-kai Medal","l":1,"c":26981,"t":85}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}}]}