{"quest":{"name":"A World Away","location":"Ul'dah","id":67670,"patch":3.07,"sort":87,"icon":100462,"eventIcon":71221,"issuer":1015713,"target":1015691,"genre":202,"journal":["An untimely bug infestation has Nonora tearing her hair out.<br>※This quest is available for a limited time only.","You learn from Nonora, a concerned citizen of Ul'dah, that an invasion of insectoid machines threatens to disrupt the realm's anniversary celebrations. Participate in the FATE “Recurring Bugs” taking place northwest of Black Brush Station in central Thanalan, or in Nophica's Wells in western Thanalan.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","You fight at the wandering minstrel's side, and turn back the wave of insectoid invaders. Return to the Ruby Road Exchange and report to Nonora.","You relay your victory to an appreciative Nonora, but the wandering minstrel is swift to put your achievement into perspective─unless a permanent solution is found, the bugs will continue to proliferate. Take the bug scrap you discovered to the wandering composer nearby, and ask him for his interpretation of the strange sound the object emits.","The itinerant composer discerns a definite rhythm and melody amid the noise, and notes a sequence of unfamiliar symbols on the scrap which seem to change in time to the sound. He suggests speaking with his acquaintance─a translator─who may be able to decipher the message. Locate the wandering translator in Arrzaneth Ossuary, and show him the bug scrap.","After peering intently at the symbols on the scrap, the translator deciphers two distinct themes: “proliferation” and “command.” Unsure of the significance of these words, however, he recommends you speak with yet another visitor to Ul'dah whose eclectic knowledge of ancient civilizations may hold the answers you seek. Find the wandering author and request his assistance.","You recount your predicament to the visiting author who is reminded of a passage he came across while researching for a novella set in ancient Allag. It seems that the Allagans once developed a mechanism that allowed for the mass production of mechanical armaments. Seek out the wandering engineer at the Goldsmiths' Guild, and invite him to speculate upon the exact nature of the mechanism at work.","After explaining the purpose of the signal emitted by the scrap, the engineer reasons that playing a specific melody upon the bugs' defeat could interfere with the replication command. Take the scrap and the engineer's report, and return to the wandering minstrel at the Ruby Road Exchange.","You hand the engineer's report to the waiting minstrel, and share with him the rest of your findings. Inspired by the talented souls that jointly crafted a solution to the bug problem, he feels moved to compose an ode on the spot. The song has scarcely begun, however, when your mind is whisked away to another world introduced to you as the “Eighteenth Floor.” When you are ready, approach the man in charge of this strange place: one “Naoki Yoshida.”","On behalf of the Eighteenth Floor's resident creators, Naoki Yoshida thanks you for your heroic deeds in the realm of Eorzea. Before you can ask how he and his colleagues came to hear of your tale, you awaken in Ul'dah as if nothing had happened. Unperturbed, you resolve to enjoy the festivities and evening fireworks alongside Nonora and the wandering minstrel. May the souls lost to the Calamity find peace in the realm's rebirth."],"objectives":["Participate in the FATE “Recurring Bugs” in central or western Thanalan.","Return to Nonora in Ul'dah.","Show the bug scrap to the wandering composer.","Show the bug scrap to the wandering translator.","Show the bug scrap to the wandering author.","Show the bug scrap to the wandering engineer at the Goldsmiths' Guild.","Hand the bug scrap and the engineer's report to the wandering minstrel at the Ruby Road Exchange.","Speak with Naoki Yoshida."],"dialogue":[{"name":"NONORA","text":"Your pardon, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. You are an adventurer, yes? Then I take it you have heard about the bug infestation?"},{"name":"Q1","text":"Have you heard about the bug infestation?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."},{"name":"NONORA","text":"...Yes, it was only a matter of time before word spread. I need hardly tell you how these persistent pests might imperil the celebrations."},{"name":"NONORA","text":"...No? Well, take it from me: the mere sight of the things would make your skin crawl with horror."},{"name":"NONORA","text":"No one knows whence they came. No one knows why they have come. Only one thing is certain: the wilds just beyond the city walls are teeming with these mechanical monstrosities, and their numbers grow with each passing day."},{"name":"NONORA","text":"What ill fortune that this plague should be visited upon us so close to the anniversary of our realm's rebirth! How might our citizens pray and reflect in peace with that skittering horde at our gates...?"},{"name":"NONORA","text":"Thankfully, this land is not without its heroes. I hear tell of a flamboyant bard who has declared war against the bugs."},{"name":"NONORA","text":"The stories speak of him engaging the metallic creatures in both central and western Thanalan. Will you not aid this courageous minstrel in his noble attempt to secure a modicum of tranquility for the coming solemnities?"},{"name":"NONORA","text":"The bugs have been sighted scuttling about both central and western Thanalan. Won't you join the tenacious troubadour of whom I spoke, and lend your arm to his struggles?"},{"name":"NONORA","text":"You've sent those bugs skittering, have you!? Twelve be praised, the celebrations are saved!"},{"name":"WANDERINGMINSTREL","text":"(-???-)Alas no, my dear... We are not free of the pests yet."},{"name":"WANDERINGMINSTREL","text":"I thank you for your assistance, <span class=\"highlight\">Forename</span>. Wheresoever a heroic soul is needed, there shall you ever be found. I could ask for no stouter ally!"},{"name":"WANDERINGMINSTREL","text":"I thank you for your assistance─I do not think I could have turned back the swarm alone."},{"name":"WANDERINGMINSTREL","text":"Our victory is, however, but a fleeting one. No matter how many of these bugs we put down, there will always be more to take their place. There seems to be hundreds of them, if not thousands, and more arrive by the day."},{"name":"WANDERINGMINSTREL","text":"I am doing all I can to thin their numbers...but it is a losing battle."},{"name":"WANDERINGMINSTREL","text":"...If I am not mistaken, you salvaged a piece of one of our foes, did you not? Might I see it?"},{"name":"WANDERINGMINSTREL","text":"...Curious. 'Tis faint, but I do believe this scrap of metal is humming. Nay, mayhap not humming exactly... The sound has a most distinctive timbre..."},{"name":"WANDERINGMINSTREL","text":"As a citizen of Ul'dah, would you happen to know of any professional musicians with whom we might consult? They need not be local in origin─merely local in whereabouts."},{"name":"NONORA","text":"Now that you mention it, I <span class=\"emphasis\">did</span> recently make the acquaintance of a visiting composer. He has traveled from afar to attend the anniversary celebrations, seeking inspiration for his next work, I believe. You'll likely find him nearby, sampling all the sights and sounds of the sultanate!"},{"name":"WANDERINGMINSTREL","text":"A propitious circumstance, indeed! If you are willing, I would have you seek out this composer as soon as you are able, and ask if he can identify the mysterious tone that issues without cease from your battlefield memento."},{"name":"WANDERINGMINSTREL","text":"We stand at an impasse, and any new insight into our predicament would be most welcome. 'Tis perhaps fortunate that the anniversary celebrations have drawn such a large and varied crowd."},{"name":"WANDERINGMINSTREL","text":"Surely within the mind of one of these myriad visitors can be found the solution to our problem. Pray begin your inquiries forthwith!"},{"name":"NONORA","text":"I made the acquaintance of a visiting composer only recently─you should find him nearby, savoring the sights and sounds of the anniversary celebrations!"},{"name":"WANDERINGMINSTREL","text":"I shall remain here, and prepare to meet the next wave of bugs. You, my friend, must seek out and speak with those whose expertise might grant us an insight into the nature of our ever more numerous foes."},{"name":"WANDERINGMUSICIAN02134","text":"What do you make of these dancin' lovelies? Not to be prudish, but I can't help feelin' the revealin' costumes take away from the performance a bit... Hm? What's that? You want me to listen to somethin'?"},{"name":"WANDERINGMUSICIAN02134","text":"Musical curio, is it? All right then, I'm game! Let's have a listen to this mysterious sound of yours..."},{"name":"WANDERINGMUSICIAN02134","text":"Hmmm, this here's more than your standard mechanical hum. There's a definite rhythm to it; a clear melody repeatin' over and over..."},{"name":"WANDERINGMUSICIAN02134","text":"An' if you look closely, you can see some symbols on it, fadin' in an' out in time to the beat. 'Fraid the meanin's lost on me, though..."},{"name":"WANDERINGMUSICIAN02134","text":"You should show this to a mate of mine─he knows all manner of strange tongues. You'll probably find him in Arrzaneth Ossuary, salivatin' over all them dusty tomes."},{"name":"NONORA","text":"I cannot tell you how much it means to me that you have taken up the fight against these awful bugs... I have the utmost faith that you will discover the means to exterminate them for good!"},{"name":"WANDERINGMUSICIAN02134","text":"Me mate speaks all sorts of languages I've never heard of. Head over to Arrzaneth Ossuary and ask him to have a look at them symbols for you. He'll know what they mean."},{"name":"WANDERINGTRANSLATOR02134","text":"...You have need of my linguistic expertise? Hm. I had intended to immerse myself in these delectable volumes...but I cannot deny, the puzzle you have presented to me is most intriguing... Most intriguing indeed...<br>Very well. I shall indulge you. Silence, if you please!"},{"name":"WANDERINGTRANSLATOR02134","text":"Uh... Ah. This is the language of a long-dead civilization. I specialize in <span class=\"emphasis\">living</span> tongues, but I daresay I can decipher some few words..."},{"name":"WANDERINGTRANSLATOR02134","text":"Hmmm. Though the finer details of the message elude me, the word stems suggest a theme of “proliferation” and “command.”"},{"name":"WANDERINGTRANSLATOR02134","text":"More, I cannot tell you. However...I have had the pleasure of collaborating with a noted author who is well versed in the history and culture of ancient civilizations. It is possible that he might be able to use the hints I have provided as keys to open the next set of doors."},{"name":"WANDERINGTRANSLATOR02134","text":"I suggest searching for him at the Quicksand─writers do so love to eavesdrop on the colorful conversations of adventurers."},{"name":"WANDERINGTRANSLATOR02134","text":"I suggest you speak with the writer I mentioned. He will doubtless be in the Quicksand, eavesdropping on adventurers for inspiration."},{"name":"WANDERINGSCENARIOWRITER02134","text":"...You seem troubled, friend. Mayhap I can be of service. To pen a convincing story, one must first embrace the knowledge of a thousand times and places, and it is possible that on my wanderings I have stumbled across just the pearl of wisdom you require."},{"name":"WANDERINGSCENARIOWRITER02134","text":"“Proliferation” and “command,” you say... Those words bring to mind a passage I came across while researching ancient Allag─background reading for a novella I was planning. As I recall, the passage described a mechanism enabling the mass production of mechanical weaponry."},{"name":"WANDERINGSCENARIOWRITER02134","text":"...But without understanding exactly how the mechanism functions, I fear you will struggle to disrupt it."},{"name":"WANDERINGSCENARIOWRITER02134","text":"'Tis fortunate, then, that I am acquainted with a highly proficient engineer. If anyone is capable of proposing a practical solution to your problem, then it is he."},{"name":"WANDERINGSCENARIOWRITER02134","text":"The advent of the Calamity affected him deeply, so he will almost certainly be here to celebrate the anniversary of the realm's rebirth. And given his professional curiosity, I imagine the mammets of the Goldsmiths' Guild will prove an irresistible lure... You might try looking for him there."},{"name":"WANDERINGSCENARIOWRITER02134","text":"I know of a proficient engineer who is likely in Ul'dah to celebrate the anniversary. And assuming he <span class=\"emphasis\">is</span> here, the mammets of the Goldsmiths' Guild cannot have failed to seize his attention..."},{"name":"WANDERINGPROGRSMMER02134","text":"...You have need of an engineer's perspective? Very well. Allow me to inspect this mechanical fragment."},{"name":"WANDERINGPROGRSMMER02134","text":"...Hmmm. From what you have told me, as well as my own cursory observations, I must conclude that the bugs you fought were constructed with some manner of self-replicating mechanism."},{"name":"WANDERINGPROGRSMMER02134","text":"Whenever the total number of active units falls below a certain threshold, it triggers the broadcast of a signal─a command for the remaining units to multiply. Short of simultaneously disabling them all, your best hope of victory lies in disrupting this signal, and thereby preventing further replication."},{"name":"WANDERINGPROGRSMMER02134","text":"Pray return now to the friend you mentioned. A minstrel, was he not? Good. Explain to him that he must, upon the elimination of each bug, play in such a way as to disrupt the signal until the unit's remaining components have been destroyed."},{"name":"WANDERINGPROGRSMMER02134","text":"I will provide him with a sequence of notes that should achieve the desired interference. Here, I've written down the particulars. Naught remains but to test the results in the field!"},{"name":"WANDERINGMUSICIAN02134","text":"I hope me ears were of help to you. When you close your eyes an' truly listen, you'd be amazed how the world reveals itself!"},{"name":"WANDERINGTRANSLATOR02134","text":"Were you able to make some sense of that writing? The words are important, aye, but ofttimes you miss the entire story when you focus too much on the literal meaning."},{"name":"WANDERINGSCENARIOWRITER02134","text":"'Tis with the greatest of pleasure that we offer up our knowledge and expertise. Composer or translator, author or engineer, we all live to see our skills put to good use!"},{"name":"WANDERINGPROGRSMMER02134","text":"Those bugs have no place in this world. Take the answer you have pieced together from our combined efforts, and set your minstrel friend on the path to victory."},{"name":"WANDERINGMINSTREL","text":"Well, my friend? Are we any closer to finding a permanent means of eradicating these bugs...?"},{"name":"WANDERINGMINSTREL","text":"...Ah, such a mechanism would well explain their never-ending numbers!"},{"name":"WANDERINGMINSTREL","text":"And I need only strum this melody until such time as I have destroyed the creatures' remains, yes? Why, naught could be simpler─it shall be the tune of my triumph!"},{"name":"WANDERINGMINSTREL","text":"Thank you, adventurer. Now we might offer our prayers for the victims of the Calamity, undisturbed by the discordant clanging of metallic limbs..."},{"name":"WANDERINGMINSTREL","text":"Without your aid─and the advice of those generous visitors─I would never have arrived at the solution you have provided."},{"name":"WANDERINGMINSTREL","text":"It is incredible what can be accomplished when the wisdom and skill of many are bent towards a common goal. In fact, I am inspired to write a song in their honor..."},{"name":"WANDERINGMINSTREL","text":"...An ode to all the creative souls who bring such color and vibrancy to our world. Might I treat you to the first verse...? Ahem!<br>Praise be to all ye men of worth,♪<br>Who build proud towers from clods of earth,♪<br>Who grant our fancies form and weight,♪<br>A thousand wonders incarnate...♪"},{"name":"YOSHIDANAOKI","text":"(-???-)Greetings, Warrior of Light. You have arrived on the Eighteenth Floor."},{"name":"YOSHIDANAOKI","text":"(-???-)This is a world that exists outside your reality. Could it be a dream? A flight of fancy conjured by your weary mind? Perhaps...or perhaps not."},{"name":"YOSHIDANAOKI","text":"(-???-)All those you see here are creators of incredible fervor. And every single speck of energy and passion they possess is forever channeled towards your realm─towards Eorzea!"},{"name":"YOSHIDANAOKI","text":"...My name is Naoki Yoshida. On behalf of the Eighteenth Floor, I bid you welcome. We are overjoyed to have this opportunity to offer you our heartfelt thanks!"},{"name":"NONORA","text":"Are you quite all right? 'Twas as if your spirit was transported elsewhere... You hear my words now, though, yes?"},{"name":"WANDERINGMINSTREL","text":"Do you wish to hear my tribute to the creative once more?"},{"name":"Q2","text":"Listen to the song again?"},{"name":"A2","text":"Yes"},{"name":"A2","text":"No"},{"name":"YOSHIDANAOKI","text":"I know that each of my colleagues was keen to thank you in person. Have you spoken to everyone?"},{"name":"Q3","text":"Have you spoken to everyone?"},{"name":"A3","text":"Yes"},{"name":"A3","text":"No"},{"name":"YOSHIDANAOKI","text":"Would you accompany me for a time, then? There is something I wish to share with you..."},{"name":"YOSHIDANAOKI","text":"Then pray feel free to make the rounds! They are dying to talk to you!"},{"name":"YOSHIDANAOKI","text":"I do hope you're enjoying your time here on the Eighteenth Floor. We've all been so eager to meet you."},{"name":"YOSHIDANAOKI","text":"You see, Eorzea is our shared passion─from its deepest valley to its loftiest cloud, and all that lies in between. And you, as one who has chosen to fight for this glorious realm, have become a hero not only to Eorzea's citizens, but to us as well!"},{"name":"YOSHIDANAOKI","text":"As I am sure you know, our beloved star once faced a ruinous fate. It was a fate born of arrogance and pride and vanity; a fate we brought upon ourselves."},{"name":"YOSHIDANAOKI","text":"Thus did we seek to commune with you, Eorzea's heroes, that we might together realize a desperate plan: to forsake our doomed path and begin our journey anew. We would tear down what we had wrought, and build another world amid the wreckage of our hubris."},{"name":"YOSHIDANAOKI","text":"Since that day of rebirth, more than five years have passed in Eorzea. The land breathes with renewed vigor, and the lure of adventure invites you onwards and upwards into the heavens themselves."},{"name":"YOSHIDANAOKI","text":"We shall never again make the mistake of believing that Hydaelyn is ours alone: it is the culmination of the history we have made together, and the future we have yet to share."},{"name":"YOSHIDANAOKI","text":"There will be days when we shall stand side by side, our laughter ringing in the air. There will be days when we shall be at odds, our brows furrowed in frustration."},{"name":"YOSHIDANAOKI","text":"But only through such earnest exchanges shall Eorzea continue to flourish, and new creations take shape. The Calamity taught us the truth of that."},{"name":"YOSHIDANAOKI","text":"It is our fondest hope that your adventures in Eorzea will be a constant source of joy and wonder. May you ever walk in the light of the Crystal!"},{"name":"YOSHIDANAOKI","text":"...Now, the time has come for this vision to end; time for your eyes to open from this waking dream."},{"name":"YOSHIDANAOKI","text":"Ever will we be watching over you and your deeds. Guide the realm unto peace and happiness, Warrior of Light..."},{"name":"WANDERINGMINSTREL","text":"By your expression, I thought your mind adrift on distant seas... Tell me: what manner of waking dream captivated your senses so completely?"},{"name":"WANDERINGMINSTREL","text":"...Fascinating. A vision of a world that exists outside of our reality. <span class=\"emphasis\">Was</span> it a dream? A flight of fancy conjured by your weary mind...? I doubt we will ever know."},{"name":"WANDERINGMINSTREL","text":"I mean to remain in Ul'dah for the duration of the anniversary celebrations. Should you wish to experience the vision again, you have only to ask─I shall be glad to send you on your way with a song."},{"name":"NONORA","text":"It seems to me that both you and the characters in your vision share a powerful desire to protect and nurture Eorzea... Mayhap it was that which gave form to the scene you witnessed."},{"name":"WANDERINGMINSTREL","text":"...Let us now take a moment to remember those whose flames were extinguished too soon. The tragedies of yesterday must not be forgotten, lest we take for granted the gifts of tomorrow."},{"name":"SYSTEM","text":"You have unlocked the Concentration mini-game."},{"name":"SYSTEM","text":"Open the toy chest in any inn room to enjoy this classic pastime."}],"reward":{"gil":763,"items":[{"id":12065},{"id":12060}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1015713","obj":{"i":1015713,"n":"Nonora","l":40,"q":1}},{"type":"npc","id":"1015691","obj":{"i":1015691,"n":"Naoki Yoshida","l":1660,"q":1}},{"type":"item","id":"12065","obj":{"i":12065,"n":"Wind-up Yugiri","l":1,"c":59543,"t":81}},{"type":"item","id":"12060","obj":{"i":12060,"n":"Wind-up Iceheart","l":1,"c":59538,"t":81}}]}