{"quest":{"name":"Who Let the Bombs Out","location":"Eastern La Noscea","id":67675,"patch":3.35,"sort":111,"repeatable":1,"icon":100571,"eventIcon":71222,"issuer":1017211,"target":1017201,"genre":201,"journal":["J'nangho is riffling through a stack of papers.<br>※This quest is available for a limited time only.","J'nangho tells you of how the Yellow Ranger has perfected a new and deadly attack and he swears its potency is such that it can easily take down any Bombards that have the misfortune to be on the receiving end. The problem? He has yet to test it out on actual Bombards. Requesting that you first weaken the voidsent beasts and then capture them using flame-resistant nets, J'nangho would then like you to release them in the general vicinity of the proud Ranger, so that both you and he can gauge just how effective his attack truly is.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After a bit of hacking and slashing, you manage to weaken and then capture three Bygone Bombards with heat-resistant nets. With them in hand, travel to the area where the Yellow Ranger is training and release the voidsent beasts at the designated location.","Soon after you release the Bygone Bombards, the Yellow Ranger catches sight of the creatures and urges you to fall back as he unleashes his attack. He quickly takes care of them, emerging from the battle mostly unscathed. Return to Haermaga with an update on how training is progressing.","Haermaga is pleased to hear that the Yellow Ranger's training is progressing as desired, and that there have been no major complications along the way. He thanks you for your help and asks that you continue to lend your support."],"objectives":["Weaken and then capture the Bygone Bombards with flame-resistant nets.","Release the bound Bombards at the designated location.","Speak with Haermaga."],"dialogue":[{"name":"JNANGHO","text":"Hello, <span class=\"highlight\">Forename</span>! I'm so happy you're here! The Yellow Ranger has allegedly taught himself a new maneuver whereby he can, with a single well-placed strike, blast a Bombard to smithereens."},{"name":"JNANGHO","text":"Indeed, this is exciting news, but he has yet to test this “death-blow” on actual Bombards. Despite his claims, I somehow doubt that swinging his axe at the air and yelling has done much to help him refine his technique."},{"name":"JNANGHO","text":"To allow him to gauge just how effective this would be on a real target and assess what might need improvement, I ask that you weaken three Bygone Bombards, capture them with these flame-resistant nets, and then place them in his general vicinity."},{"name":"JNANGHO","text":"...And if you could keep this between us, it would be for the best. I'm afraid if he were to learn of our plan, he'd become a tad overeager to prove the potency of this new attack, charge headfirst into a bevy of Bombards, and end up injured or worse."},{"name":"BEAUDEFOIN","text":"So you have found me, <span class=\"highlight\">Forename</span>! I suppose this is a testament to your skill, for I purposely chose this secluded spot that I might practice away from prying eyes. Should the secrets of my Triple Majestic Slash Attack fall into the wrong hands, it could have disastrous and far-reaching consequences!"},{"name":"BEAUDEFOIN","text":"You're here to see me in action, I presume? I'd love to indulge you, my friend, but I fear you'll have to wait until we face a sizable threat, that I might reveal to you the true potential of this most devastating attack."},{"name":"BEAUDEFOIN","text":"Stand back, <span class=\"highlight\">Forename</span>! Those Bombards appear to be of a highly dangerous breed! I shall finish them off!"},{"name":"BEAUDEFOIN","text":"Graaagh! Begone from whence you came, foul fiends!"},{"name":"BEAUDEFOIN","text":"Hahaha! That wasn't a very stimulating fight. This must mean I have, through my training, grown to be that much more powerful!"},{"name":"BEAUDEFOIN","text":"While my skills with an axe are nearly unrivaled, I must nevertheless find a way to counteract the blinding light which accompanies a Bombard's suicidal blast. In a true battle, it could prove most detrimental!"},{"name":"BEAUDEFOIN","text":"Moreover, it would not be good for morale should the group's most talented member be seen to stumble blindly about the battlefield!"},{"name":"BEAUDEFOIN","text":"Tell the Re─er, Haermaga─that I shall resume my training as soon as I have finished scrubbing the soot from my armor."},{"name":"BEAUDEFOIN","text":"Watch out, <span class=\"highlight\">Forename</span>! They're back!"},{"name":"BEAUDEFOIN","text":"Eager to meet your maker, are you!? Vile fiends!"},{"name":"BEAUDEFOIN","text":"You, my friend, seem to draw these vicious monsters to you, like moths to a flame. Fortunately, your bad luck has afforded me an opportunity to confirm just how effective my training has been!"},{"name":"BEAUDEFOIN","text":"Why, my reflexes have become such that I can predict when and what type of attack the Bombards will use, allowing me to avert my gaze and prevent myself from becoming dazed by their blasts!"},{"name":"BEAUDEFOIN","text":"All this progress has me eager to return to training, so I shall do just that. Oh, and should you bump into Haermaga, do be sure to tell him of the astounding amount of progress I have made─he's certain to be impressed by the swiftness with which I eliminated the fiends!"},{"name":"BEAUDEFOIN","text":"Your misfortune persists! Fall back, <span class=\"highlight\">Forename</span>, that I might do away with these fiends once and for all!"},{"name":"BEAUDEFOIN","text":"Die, you fang-faced monstrosities!"},{"name":"BEAUDEFOIN","text":"Th-There is no need to worry, <span class=\"highlight\">Forename</span>. Ahem. I was simply caught off guard by the, er, bang that resounded through the area, and that caused me to...trip. Y-Yes, I tripped, but as you can see, I haven't a scratch on me!"},{"name":"BEAUDEFOIN","text":"Accident or not, however, there is no room for error on the battlefield and I must focus on improving my concentration. The Red Ranger relies heavily on his right-hand man, and I cannot fail him."},{"name":"BEAUDEFOIN","text":"He has toiled day and night to become the hero this realm so desperately needs, all for the sake of a promise he made to one little boy who wished for a masked man to banish the Bombards so his imaginary cat might frolic freely in the fields...or, at least, that's what I think he said."},{"name":"BEAUDEFOIN","text":"Anyhow, my point simply is this: as our official leader, any promises he makes are, by extension, promises all Go Go Posing Rangers make!"},{"name":"BEAUDEFOIN","text":"That is why I, too, must become strong enough to weather any trial that may come and not falter as I did today."},{"name":"BEAUDEFOIN","text":"Now, I shall return to practicing, so I might do Red proud and the boy might finally meet the hero he so admires!"},{"name":"HAERMAGA","text":"Thank you for taking the time to assist our Yellow Ranger with his training."},{"name":"HAERMAGA","text":"I hope we can count on your continued support, for the Go Go Posing Rangers need all the help you can provide if they are to take down the Bombard King!"},{"name":"HAERMAGA","text":"J'nangho shared the news with me earlier. Though...not to question the veracity of the Yellow Ranger's claim, but tell me, <span class=\"highlight\">Forename</span>, is this “death-blow” truly as grand as she says?"},{"name":"HAERMAGA","text":"Haha! Wonderful! I can only hope all three of our Rangers will make as much progress as he has today. We've no shortage of burgeoning Bombards to attend to, after all!"}],"reward":{"items":[{"id":15424}],"xp":0},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[67674]},"next":[67676]},"partials":[{"type":"npc","id":"1017211","obj":{"i":1017211,"n":"J'nangho","l":32,"q":3,"t":"Cascadier"}},{"type":"npc","id":"1017201","obj":{"i":1017201,"n":"Haermaga","l":32,"q":5}},{"type":"item","id":"15424","obj":{"i":15424,"n":"Faire Voucher XVI","l":1,"c":25918,"t":85}},{"type":"quest","id":"67674","obj":{"i":67674,"n":"Hot 'n Cold","g":201,"l":"Eastern La Noscea","s":110,"r":1}},{"type":"quest","id":"67676","obj":{"i":67676,"n":"A Battle Royal","g":201,"l":"Eastern La Noscea","s":112}}]}