{"quest":{"name":"Hot 'n Cold","location":"Eastern La Noscea","id":67674,"patch":3.35,"sort":110,"repeatable":1,"icon":100570,"eventIcon":71222,"issuer":1017211,"target":1017201,"genre":201,"usedItems":[15425],"journal":["J'nangho looks off into the distance, a deepening frown upon her lips.<br>※This quest is available for a limited time only.","It is an unusually hot day in Costa del Sol, and J'nangho is concerned that the Black Ranger will overexert herself if she attempts to complete her regular training regimen. After trying and failing to convince the obstinate Ranger to stay indoors until temperatures drop, she asks that you deliver three cups of rolanberry shaved ice to the lady in black so that she will not succumb to the summer heat.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You deliver the rolanberry shaved ice to the Black Ranger. Taking the first of the cups, she expresses to you her dislike of ice. Upon explaining to her that it is not for the pleasure of eating but rather to counteract the heat from the sun, she hands the cup back to you, proposing the two of you play a game of hide-and-seek, but with a twist. You will give her a head start of twenty seconds to hide. She will continue performing squats as you search for her and, if you find her before she is able to complete the designated number, you win. Should she finish before you find her, she wins. The loser must then eat the shaved ice as punishment.","You spy the Black Ranger and see that she has yet to complete her squats. Approaching her, you offer her the first cup of rolanberry shaved ice, once more, and this time she does not hesitate. Taking it from you, she gulps it down before racing off to begin her next round of squats. Find and deliver the second cup of shaved ice to her.","When you find her, the Black Ranger is only a few squats away from finishing. Sighing with defeat, she extends her hand to receive the rolanberry shaved ice and quickly eats it. Declaring the number of squats she intends to acheive with the next round, she runs off. Locate her and deliver the last cup of shaved ice to the Black Ranger.","The Black Ranger quickly downs the final cup of soppy rolanberry ice and while clearly disappointed by today's outcome, she seems determined, promising to improve so that she might further aid the Red and Yellow Rangers. Return to Haermaga and inform him of the successes and failures of today's session.","Haermaga is delighted by your dedication and the progress of his Rangers. He asks that you continue supporting them with the same fervor you have shown today."],"objectives":["Procure and deliver the rolanberry shaved ice to the Black Ranger.","Deliver the first cup of rolanberry shaved ice to the Black Ranger.","Deliver the second cup of rolanberry shaved ice to the Black Ranger.","Deliver the final cup of rolanberry shaved ice to the Black Ranger.","Report to Haermaga."],"dialogue":[{"name":"JNANGHO","text":"Wonderful timing, <span class=\"highlight\">Forename</span>─I was just about to send for you. As you've likely noticed, the sun today has been particularly intense and even the shade provides little reprieve from the heat."},{"name":"JNANGHO","text":"Ranger or not, it is unwise to push the limits of one's body on a day such as this, but my attempts to convince a certain someone to remain indoors have fallen on deaf ears."},{"name":"JNANGHO","text":"If the Black Ranger will not listen to sense, then we are left with but one other option: we must stuff her full of rolanberry shaved ice─one of the few surefire ways to cool the body! I think three cups should do the trick!"},{"name":"JNANGHO","text":"You can purchase some from our iceman just below, or should you be so inclined, you can prepare it yourself!"},{"name":"HILDELANA","text":"Hut, two, three, four! Hut, two, th─ Ah, <span class=\"highlight\">Forename</span>, are you here to join me for a round of─"},{"name":"HILDELANA","text":"Oh! Rolanberry shaved ice? It certainly is a kind gesture, but I don't much care for frozen desserts, or cold things in general, really."},{"name":"HILDELANA","text":"<span class=\"emphasis\">This</span> will help me combat the heat, you say? Speaking from experience, I can assure you it will do nothing of the sort."},{"name":"HILDELANA","text":"Nevertheless, it would be a shame to let such an expensive dessert go to waste... Ah, I know! Allow me to propose a contest."},{"name":"HILDELANA","text":"I will go and hide, and you will attempt to find me. While I wait, I will continue to perform squats. Should you manage to find me before I squat one hundred times, you win. If not, I win─and the loser must eat the shaved ice as punishment."},{"name":"HILDELANA","text":"Are you ready, <span class=\"highlight\">Forename</span>? Good. Now hold on to the shaved ice for now and wait until the count of twenty before starting your search. Good luck!"},{"name":"HILDELANA","text":"Oh, <span class=\"highlight\">Forename</span>! I'm glad you're here. This weather hasn't been particularly motivating and I could do with a training partner! Did you bring any of that shaved ice with you?"},{"name":"HILDELANA","text":"Bah! I think it will take me a while to become accustomed to the touch of ice upon my skin. In any case, you remember the rules to our little game, don't you?"},{"name":"HILDELANA","text":"Excellent! I have grown faster and stronger since we last met, so I shall set my goal to three hundred squats. Now, without any further ado, let's get started!"},{"name":"HILDELANA","text":"Ah, without the rolanberry shaved ice, it would be considerably more difficult to play our game, don't you think?"},{"name":"HILDELANA","text":"Did you forget the rolanberry shaved ice? Well, in that case I shall wait here and continue with my warm-up while you go and fetch us some."},{"name":"HILDELANA","text":"That was incredibly fast! I had scarce begun to squat when I heard your swift approach. I suppose that means I'll have to eat the ice, then."},{"name":"HILDELANA","text":"Gah! Th-That was incredibly cold, but, just as you said, an extremely effective way to beat the heat!"},{"name":"HILDELANA","text":"In fact, I feel so energized I believe I could do five hundred squats in the time it would take you to find me!"},{"name":"HILDELANA","text":"I was nearly there! Just a few more to go and I would have beaten you. &lt;sigh&gt; “Would have,” however, isn't good enough, is it? I lose, once again."},{"name":"HILDELANA","text":"Th-That's even colder than I remember! &lt;groan&gt; Did you hear that? My stomach cries out in protest! Any more shaved ice and I doubt I could finish another circuit!"},{"name":"HILDELANA","text":"Yet I cannot deny its rejuvenating effects. And with this last spurt of energy I shall do a thousand squats! Steel yourself, <span class=\"highlight\">Forename</span>, for this next round I shan't lose!"},{"name":"HILDELANA","text":"Only fifty...&lt;pant&gt;...to go. Please allow me...&lt;pant&gt;...to finish this set."},{"name":"HILDELANA","text":"Brrr! I feel it from my head to my toes! These defeats have forced me to admit an uncomfortable truth: my abilities are laughably inadequate."},{"name":"HILDELANA","text":"<span class=\"highlight\">Forename</span>, I must become much faster and stronger! If that means I need spend day after day, training in the scorching hot sun or swallowing so much ice I can no longer feel my tongue, nose, or ears, then so be it! I shall do whatever it takes!"},{"name":"HILDELANA","text":"However, I am no fool. Such skill takes years, if not decades to attain. It's not something that can be accomplished in the span of a few days or even weeks, no matter how dedicated one might be."},{"name":"HILDELANA","text":"<span class=\"highlight\">Forename</span>, the Red Ranger is too proud to ask this of you, so I shall do so on his behalf. Should any of us fail to learn all that we must to defeat the Bombards, would you agree to lend us your strength on the battlefield?"},{"name":"HAERMAGA","text":"Thank you. You've taken a great load off my mind. Now, I think I will retreat into the shade for a moment before returning to training. Let us part ways here, my friend!"},{"name":"HILDELANA","text":"Already? &lt;pant&gt; It looks as though...&lt;pant&gt;...I'm not...&lt;pant&gt;...the only one who's...&lt;pant&gt;...improving with practice!"},{"name":"HILDELANA","text":"Brrr... It seems I stand no chance in winning this game against a seasoned adventurer such as yourself, but at least each torturous mouthful of ice brings me a step closer to my goals."},{"name":"HILDELANA","text":"I shall be looking forward to our next match, <span class=\"highlight\">Forename</span>! However, I advise you to come on an empty stomach, for you will be the one chomping on ice after our next session!"},{"name":"HILDELANA","text":"Only...&lt;pant&gt;...ten more... &lt;pant&gt; Ah. You beat me...&lt;pant&gt;...again. &lt;pant&gt;"},{"name":"HILDELANA","text":"Oh, dear. I fear I may have dug into this cup a bit too enthusiastically. &lt;groan&gt; It's as though someone's shoved an ice-cold poker between my eyes and into my brain. This sensation, it brings me back to the time I first encountered the Red Ranger..."},{"name":"HILDELANA","text":"It was in Ul'dah─my birthplace─on a day almost as hot as this one, when I had just finished another long shift in the mines..."},{"name":"HILDELANA","text":"There we slaved day and night for a pittance, all the while those running the operation looked for new ways to squeeze even more from us."},{"name":"HILDELANA","text":"Yet, somehow over the years I eventually managed to scrape together a meager sum, enough to purchase shaved ice─one of the most luxurious desserts one could buy over in Thanalan."},{"name":"HILDELANA","text":"Like today, I made the mistake of eating it far too quickly, and in my weakened state, the shock of ingesting something so cold and foreign triggered a terrible migraine, which rendered me unconscious."},{"name":"HILDELANA","text":"I awoke in a soft bed, and to the sight of the Red Ranger's face. He nursed me back to health over the following week, listening sympathetically as I told him my story."},{"name":"HILDELANA","text":"When I had fully recovered, he invited me to join him. And so it was I finally left behind that life of hardship and misery..."},{"name":"HILDELANA","text":"&lt;sigh&gt; It seems I've gone off on a tangent. My apologies. It was never my intention to bore you with stories of my past."},{"name":"HILDELANA","text":"However, this trip down memory lane has instilled me with a renewed sense of purpose. Just as the Red Ranger once helped me escape my nightmares, I must return the favor by helping him achieve his dreams!"},{"name":"HAERMAGA","text":"<span class=\"highlight\">Forename</span>, thank you for braving this dreadful heat to ensure the Black Ranger's well-being."},{"name":"HAERMAGA","text":"Your dedication to the success of the Go Go Posing Rangers and the Moonfire Faire is admirable─comparable, perhaps, to that of my own. I thank my lucky stars that you came to us!"},{"name":"HAERMAGA","text":"Indeed, it is a hot day, but I see now that the passion that burns in your heart blazes brighter than the sun! I cannot even begin to express how blessed we are to have you as an ally."},{"name":"HAERMAGA","text":"Your discretion regarding this matter has also been commendable and none have yet to catch wind of what is really going on!"},{"name":"HAERMAGA","text":"I daresay, in addition to his regular training, the Yellow Ranger could do to learn a thing or two about tact from you! Hahaha! I'm sure he can hardly wait to begin his sessions, so I urge you speak with J'nangho, who will apprise you of all the details!"}],"reward":{"items":[{"id":15424}],"xp":0},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[67673]},"next":[67675]},"partials":[{"type":"npc","id":"1017211","obj":{"i":1017211,"n":"J'nangho","l":32,"q":3,"t":"Cascadier"}},{"type":"npc","id":"1017201","obj":{"i":1017201,"n":"Haermaga","l":32,"q":5}},{"type":"item","id":"15424","obj":{"i":15424,"n":"Faire Voucher XVI","l":1,"c":25918,"t":85}},{"type":"item","id":"15425","obj":{"i":15425,"n":"Rolanberry Shaved Ice","l":5,"c":24080,"t":46,"p":600}},{"type":"quest","id":"67673","obj":{"i":67673,"n":"Dashing and Burning","g":201,"l":"Eastern La Noscea","s":109,"r":1}},{"type":"quest","id":"67675","obj":{"i":67675,"n":"Who Let the Bombs Out","g":201,"l":"Eastern La Noscea","s":111,"r":1}}]}