{"quest":{"name":"Dashing and Burning","location":"Eastern La Noscea","id":67673,"patch":3.35,"sort":109,"repeatable":1,"icon":100569,"eventIcon":71222,"issuer":1017211,"target":1017201,"genre":201,"journal":["J'nangho briefly glances up from her stack of papers before setting them down.<br>※This quest is available for a limited time only.","J'nangho tells you that the Red Ranger has been busy honing his ability to extinguish fires on smoldering dummies. Believing a bit of friendly competition is just what he needs to speed his training along, she tells you to follow him on an elbst and attempt to put out the dummies' flames before he can. J'nangho directs you to speak with the guild's stockman, Wunthyll, to borrow a beast.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Wunthyll is more than happy to lend you an elbst, and helps you mount the finest of his stock. Race to where the Red Ranger is training and use its Saturate ability to put out the smoldering dummy's flames.<br><br>※Speak with Wunthyll in Costa del Sol to mount an elbst.","Expertly guiding the elbst into place, you extinguish the smoldering dummy's flames before the Red Ranger can finish punching them out. Cursing, he rushes off to begin another round of training. Follow him, and extinguish the next cluster of dummies.<br><br>※Speak with Wunthyll in Costa del Sol to mount an elbst.","The Red Ranger grows increasingly more frustrated by the fact that he cannot beat you and rushes off, but not before letting you know he will win the next round no matter what. Give chase and extinguish the dummies' fires before he can.<br><br>※Speak with Wunthyll in Costa del Sol to mount an elbst.","When you finally reach the Red Ranger, you find him cowering, trapped within a ring of fire. Quickly steer your elbst toward the dummies to extinguish the wild fires which have engulfed them and then speak with the Red Ranger to make sure he is not injured.","The Red Ranger explains to you that in his haste, his hands slipped as he went to apply oil to the flames, and in an instant he found himself trapped within a ring of blazing fire. While it seems he has not sustained any physical injuries, he is clearly disappointed in himself. Return to Haermaga with a report on the day's training session.","You report back to Haermaga with an update on how the Red Ranger's training is progressing. He asks that you continue to aid the Go Go Posing Rangers and bids you speak with J'nangho to receive the latest training schedules for each of the Rangers."],"objectives":["Speak with Wunthyll and mount an elbst.","Use the elbst's Saturate ability on the smoldering dummy.","Use the elbst's Saturate ability on the burning dummies.","Use the elbst's Saturate ability on the blazing dummies.","Speak with the Red Ranger.","Report to Haermaga."],"dialogue":[{"name":"JNANGHO","text":"Ah, <span class=\"highlight\">Forename</span>! What a pleasant surprise! Haermaga mentioned an adventurer would be along to assist the Posing Rangers with their training, but he never said it would be <span class=\"emphasis\">you</span>. Well, you're right on time!"},{"name":"JNANGHO","text":"Hello, <span class=\"highlight\">Forename</span>! Am I correct in assuming you're here to assist the Posing Rangers with their training? Excellent! Let's get started, then!"},{"name":"JNANGHO","text":"The Red Ranger just left to practice with the smoldering dummies. He requests that you follow him with an elbst and compete with him to douse the flames first─him with his fists, and you with an elbst's water."},{"name":"JNANGHO","text":"Our guild's stockman, Wunthyll, is stationed to the northwest and I'm sure he'd be more than happy to lend you one of his elbsts."},{"name":"JNANGHO","text":"I know, I know, he stirred up all that trouble last year, but now he's one of our guild's most hardworking members, and it's largely in part to your inspiring example."},{"name":"JNANGHO","text":"Wunthyll has something of a murky past, but he is now one of our guild's most hardworking members. In fact, the reason he's so dedicated is because he was inspired by an adventurer much like yourself!"},{"name":"WUNTHYLL","text":"<span class=\"highlight\">Forename</span>? No. That can't be right! I must be daydreamin' again. B-But that powerful stride, that smile... Bloody hells! It's really you, innit?"},{"name":"WUNTHYLL","text":"I didn't think I'd ever see you again! Before I forget, I just want to say thank you for all that you've done for me─it ain't no ordinary <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> what can convince a pirate to renounce his ol' ways and up and join a guild! "},{"name":"WUNTHYLL","text":"So how might I be of service to you this fine day?"},{"name":"WUNTHYLL","text":"Hm. In that case why don't you take her. She's yet to be fully broken in but─having been on the receiving end of it more than once─trust me when I say she can blast water farther than all the others combined!"},{"name":"WUNTHYLL","text":"Threw you off, did she? Has a fiery temper, that one. Lemme saddle this ol' girl, and you can take her instead."},{"name":"SYSTEM","text":"The smoldering dummy is enveloped in flames. Borrow an elbst from Wunthyll and use its Saturate ability to douse them."},{"name":"HAERMAGA","text":"I see you have not brought an elbst with you. Do you intend to squelch these flames with your bare hands? I hardly think that a fair fight!"},{"name":"HAERMAGA","text":"Curses! Had I been a split second faster, it would have been extinguished by my hand!"},{"name":"HAERMAGA","text":"You and your elbst might be fast, <span class=\"highlight\">Forename</span>, but my fists are faster, and I assure you the next round will be mine!"},{"name":"SYSTEM","text":"The burning dummies are enveloped in flames. Borrow an elbst from Wunthyll and use its Saturate ability to douse them."},{"name":"HAERMAGA","text":"Do you intend to stand idly by and let me claim victory? If not, I suggest you go and fetch an elbst that we may have a proper competition!"},{"name":"HAERMAGA","text":"Blast it all! I can't believe I lost again! Ghraaah! Brace yourself, <span class=\"highlight\">Forename</span>. No matter what it takes, I shall be securing at least one win today!"},{"name":"SYSTEM","text":"The blazing dummies are enveloped in flames. Borrow an elbst from Wunthyll and use its Saturate ability to douse them."},{"name":"HAERMAGA","text":"Please hurry, and put out the flames with your elbst, <span class=\"highlight\">Forename</span>! They climb higher by the second!"},{"name":"HAERMAGA","text":"Th-Thank you for getting me out of that mess. I had only meant to add a splash of oil to bring the flames to life, but in my haste, my hands slipped. I drenched the burning dummies with a full bucket, and before I knew it I was surrounded by a ring of fire!"},{"name":"HAERMAGA","text":"That I need be saved from my own stupidity is proof I am unfit for the title of Red Ranger."},{"name":"HAERMAGA","text":"Protect the people? Give them a better future? Ha! How am I to do any of that when even a small fire poses too great an obstacle for me to overcome!?"},{"name":"HAERMAGA","text":"All I ever wanted was to give hope to the people─to quell all their fears─just as the Warriors of Light have done. &lt;sigh&gt; Perhaps it was too lofty a goal..."},{"name":"HAERMAGA","text":"Ah, but what am I doing? I cannot give up at the first sign of difficulty! Today may not have yielded the results I wanted, but tomorrow is another day! I'm sure Haermaga is expecting you, so let us finish here and begin afresh anon!"},{"name":"HAERMAGA","text":"Godsdammit! I had to be rescued by you, yet again!"},{"name":"HAERMAGA","text":"I thought for sure I had matters under control this time, but it seems I am full of nothing but empty words and promises I cannot keep!"},{"name":"HAERMAGA","text":"Yes, I know! Improvement doesn't happen overnight. Hells! I can't even begin to imagine how long it took you to achieve what you have, but I had hoped to, at the very least, conquer the fear that defeated me before."},{"name":"HAERMAGA","text":"I must redouble my efforts, lest I squander all the support and knowledge you have bequeathed onto me. Tell Haermaga that while today may have been full of setbacks, tomorrow the flames shall burn higher and I shall punch harder and faster!"},{"name":"HAERMAGA","text":"Thank you, <span class=\"highlight\">Forename</span> for saving me, yet again. &lt;sigh&gt; It seems the time has come for me to hang up this armor for good."},{"name":"HAERMAGA","text":"Every step I take, every move I make─it only leads me further astray. This can mean but one thing. Defeating the Bombard King is a task best left to true heroes, and not a fool who but fancies playing the part..."},{"name":"HAERMAGA","text":"<span class=\"highlight\">Forename</span>, watch out! The blazing dummies─they have attracted the attentions of an unwanted guest!"},{"name":"HAERMAGA","text":"...And he's intent on giving himself a boost with the remaining oil in the bucket! Garrr! If it's food you want, then it's my fists you'll eat, fiend!"},{"name":"HAERMAGA","text":"I defeated him? <span class=\"emphasis\">I</span> defeated him! Haha! Did you see that, <span class=\"highlight\">Forename</span>!?"},{"name":"HAERMAGA","text":"Like a man possessed, I sprang into action without a second thought and snuffed the beast out with a single jab of my fist─as if he were a flickering candle and, I, a raging tornado!"},{"name":"HAERMAGA","text":"Th-That's it! I undertand now! I defeated him precisely because I let my instincts and the skills I honed in training take over, preventing stray thoughts from cluttering my mind and clouding my judgment!"},{"name":"HAERMAGA","text":"Do you know what this means!? The dream lives on! Ahahahaha! I can't even begin to express to you how happy I am! Now, however, is not the time for celebration, for it is from here that the true work begins."},{"name":"HAERMAGA","text":"Ah, <span class=\"highlight\">Forename</span>, you've returned. I trust the training went well?"},{"name":"HAERMAGA","text":"Certainly. While the Red Ranger undoubtedly has a long and arduous path ahead of him, if the passion he has displayed today is anything to go by, we have nothing to worry about!"},{"name":"HAERMAGA","text":"It sounds as though he got off to a rough start, but I have faith that he shall improve over the following days and weeks. In the meantime, I request you train with the Black Ranger. The details are with J'nangho, so if you are willing, please seek her out."},{"name":"HAERMAGA","text":"Since this is a top secret matter, I would ask that you make every effort not to be overheard. I have relayed to the rest of my assistants that you will be running various errands for us, so your continued presence shouldn't arouse any suspicions."},{"name":"HAERMAGA","text":"May all our hard work pay off, and together, let us celebrate the Moonfire Faire in the most traditional spirit of the holiday─by bringing down the Bombard King!"}],"reward":{"items":[{"id":15424}],"xp":0},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[67672]},"next":[67674]},"partials":[{"type":"npc","id":"1017211","obj":{"i":1017211,"n":"J'nangho","l":32,"q":3,"t":"Cascadier"}},{"type":"npc","id":"1017201","obj":{"i":1017201,"n":"Haermaga","l":32,"q":5}},{"type":"item","id":"15424","obj":{"i":15424,"n":"Faire Voucher XVI","l":1,"c":25918,"t":85}},{"type":"quest","id":"67672","obj":{"i":67672,"n":"Heroes of Tomorrow","g":201,"l":"Limsa Lominsa","s":108}},{"type":"quest","id":"67674","obj":{"i":67674,"n":"Hot 'n Cold","g":201,"l":"Eastern La Noscea","s":110,"r":1}}]}