{"quest":{"name":"Joining the Circus","location":"Gridania","id":67686,"patch":3.07,"sort":89,"icon":100491,"eventIcon":71221,"issuer":1015778,"target":1015782,"genre":203,"usedItems":[13099,13100,13101,13102],"journal":["The Adventurers' Guild investigator seems eager to be about his duty.<br>※This quest is available for a limited time only.","After bidding you join him as soon as possible, the Adventurers' Guild investigator leaves directly for Hyrstmill. Make your own way to the settlement in the North Shroud, and help the adventurer put a stop to the Continental Circus's mayhem.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You join the investigator in Hyrstmill, and he reports that his worst fears have been confirmed: it appears that several children have already vanished. The worried matron nearby explains that the younglings ran out of her sight for only a moment, but have since failed to return. Heed the investigator's advice, and question Hyrstmill inhabitants for any leads as to the children's whereabouts.","You speak with a number of Hyrstmill residents and learn that a stranger in a witch's costume was seen leading the younglings into the shadow of a building. Return to the Adventurers' Guild investigator and report your findings.","You return to the investigator, and he laments his inability to learn anything of the children's fate. After you relay the story told to you by the villager, however, he soon returns his attention to the task at hand, asking that you follow up on the lead while he reports this development to the Adventurers' Guild. Head over to the spot described by the witness, and spy on the suspicious witch.","No sooner have you concealed yourself at a convenient vantage point, when the suspicious witch appears with an enthusiastic child in tow. With promises of a wonderful costume to celebrate All Saints' Wake, the villain then transforms the youngling into a horrible fiend. The newly transformed youngling flaps happily away, to the delight of the witch's next visitor─the Impresario. Through their clandestine conversation, you discover the Continental Circus's diabolical plan to harvest the fear the children will undoubtedly feel once they learn the truth: their hideous transformations are permanent. With the power siphoned from innocent terror, the Circus means to summon a demonic legion, and visit upon the realm a second Night of Devilry.<br><br>As you withdraw from the shadowed meeting place, you are confronted by a pumpkin-headed apparition. Instead of offering you harm, however, she sympathizes with the children's plight, and provides you with the means to dispel the witch's terrible enchantment. Return to the Adventurers' Guild investigator, and report all that has occurred.","The investigator listens to your tale with growing horror, and vows to stop the Continental Circus from plunging the realm into darkness. The adventurer then bids you follow the instructions of the pumpkin-headed stranger, and don attire suitable for celebrating All Saints' Wake. Equip a witch's hat, a witch's coatee, a pair of witch's gloves, and a pair of witch's thighboots before speaking with the Adventurers' Guild investigator once more.","The investigator pronounces your garb appropriately festive, and sends you off to rescue the unsuspecting children from their ghastly curse. Find the transformed children, and give them each a creepy cookie.","You give each of the metamorphosed younglings a counter-curse treat, and they are instantly freed from the witch's enchantment. Return to the Adventurers' Guild investigator and report your success.","The investigator and matron are both overjoyed at the safe return of the children. While you were busy handing out cookies, however, it seems the Circus was setting the second part of their plan into motion..."],"objectives":["Speak with the Adventurers' Guild investigator at Hyrstmill.","Question Hyrstmill inhabitants.","Report to the Adventurers' Guild investigator.","Spy on the suspicious witch.","Report to the Adventurers' Guild investigator.","Dress in your All Saints' best and speak to the Adventurers' Guild investigator.","Give creepy cookies to the curious monsters.","Report to the Adventurers' Guild investigator."],"dialogue":[{"name":"GODRIQUELAIN","text":"We must see this investigation through to its conclusion! Pray join me in Hyrstmill as soon as you are able."},{"name":"MEMBERA02150","text":"Oh, darling children, sweet and small! Gather 'round younglings, one and all! This All Saints' Wake you'll have a ball!"},{"name":"MEMBERB02150","text":"This year's All Saints' Wake is all about the children! Come to Hyrstmill, my precious younglings, for free costumes and seasonal sweets!"},{"name":"MEMBERC02150","text":"Hm? Seeking to join the festivities, are we? I'd love to oblige you, but I'm afraid our costumes are only for the children this year. Perhaps we'll focus on the grown-ups next time around!"},{"name":"GODRIQUELAIN","text":"I'm glad you've come. Sadly, I must report that my misgivings were justified─it seems that several children have already gone missing."},{"name":"GUARDIAN02150","text":"The little ones were laughing and playing together, and they ran out of sight for but a moment..."},{"name":"GUARDIAN02150","text":"（★未使用／削除予定★）"},{"name":"GUARDIAN02150","text":"I thought it merely a frolicsome game of tag-the-goblin! But no matter how long I waited, they did not return. Oh, Matron, forgive me..."},{"name":"GODRIQUELAIN","text":"Fear not, madam, we will set things aright."},{"name":"GODRIQUELAIN","text":"Let us first question the residents of Hyrstmill, and find ourselves a witness to this disappearance. The younglings could not have simply vanished into thin air!"},{"name":"GODRIQUELAIN","text":"Let us be about our search. Surely one of the local folk will have some hint as to the children's whereabouts!"},{"name":"GUARDIAN02150","text":"Where could my precious darlings have wandered off to...?"},{"name":"VILLAGERA02150","text":"A gaggle of children's gone missing, you say? I'm afraid I've not seen aught worth mentioning..."},{"name":"VILLAGERB02150","text":"Looking for a gang of little ones, are you? There were some flitting shadows in the woods over yonder, but 'twas likely just some foraging opo-opos. I'm sorry I couldn't be of more help..."},{"name":"VILLAGERC02150","text":"Younglings? Aye, I saw a few following a lass in a witch's costume into the shadow of that building over there. Giggling and skipping, they were."},{"name":"VILLAGERA02150","text":"A gaggle of children's gone missing, you say? I'm afraid I've not seen aught worth mentioning..."},{"name":"VILLAGERB02150","text":"Looking for a gang of little ones, are you? There were some flitting shadows in the woods over yonder, but 'twas likely just some foraging opo-opos. I'm sorry I couldn't be of more help..."},{"name":"VILLAGERC02150","text":"Younglings? Aye, I saw a few following a lass in a witch's costume into the shadow of that building over there. Giggling and skipping, they were."},{"name":"GODRIQUELAIN","text":"My investigations bore little fruit, I'm afraid. One would think that at least <span class=\"emphasis\">one</span> person in this tiny settlement would have seen <span class=\"emphasis\">something</span>..."},{"name":"GODRIQUELAIN","text":"...You are certain!? This tale of a witch in the shadows does not bode well."},{"name":"GODRIQUELAIN","text":"We must act swiftly. Sneak up on this costumed devil and learn what fate has befallen the younglings. I will inform the guild of our progress."},{"name":"GODRIQUELAIN","text":"There is little time to lose. While I update the guild on these latest happenings, you must go to the place the witness described and confirm that villainy is truly afoot."},{"name":"GUARDIAN02150","text":"Bring the little ones back safe, I beg of you!"},{"name":"WITCH02150","text":"Come closer, my darling! With the help of my magicks, you will become the perfect little monster to celebrate All Saints' Wake!"},{"name":"CHILDA02150","text":"Hooray! Thank you, Miss Witch!"},{"name":"WITCH02150","text":"There! Now don't you look splendid!?"},{"name":"CHILDA02150","text":"Wow! Am I a real monster!?"},{"name":"WITCH02150","text":"But of course! The festivities will be far more enjoyable in this form."},{"name":"WITCH02150","text":"Now, run along to Bentbranch Meadows and join your fellow fiends! Make sure to give a scare to everyone you pass on the way, dear!"},{"name":"CHILDA02150","text":"...This is going to be great!"},{"name":"IMPHEAD","text":"(-Impresario-)Heh heh heh... Such delicious innocence."},{"name":"WITCH02150","text":"Delightful, isn't it? They follow without question, and revel in the transformation."},{"name":"WITCH02150","text":"Would they be so joyful, I wonder, if they knew the enchantment would never fade?"},{"name":"IMPHEAD","text":"With their unwitting aid shall the legend of old be reborn! We shall flood the city with our wicked kin, and usher in a new Night of Devilry!"},{"name":"IMPHEAD","text":"We need but reap our harvest of terror. When the younglings learn the finality of their monstrous fate, the outpouring of fear will fuel our darkest spells."},{"name":"IMPHEAD","text":"The zenith of dread will be reached when these metamorphosed children seek solace in their families' embrace, only to have their loved ones recoil in abject horror. With nowhere left to turn, we shall provide their only succor."},{"name":"IMPHEAD","text":"And when they at last succumb to their new fiendish nature, they will join the devilish legions summoned by the nectar of their despair!"},{"name":"WITCH02150","text":"Swelling our ranks with the very innocents upon whose fear we supped! A master stroke, Impresario!"},{"name":"PUMPKIN","text":"(-???-)Heh heh heh... A troubled soul, all alone."},{"name":"PUMPKIN","text":"Fear not my ghoulish appearance─I offer not harm but counsel. Pray confide in me your woes."},{"name":"PUMPKIN","text":"It has been long since our last meeting, child. Pray confide in me your woes."},{"name":"PUMPKIN","text":"...Innocent children, trapped in the form of fiends? Such a tragic tale ill befits the festive air of All Saints' Wake! 'Tis well, then, that I have the means to remedy this misfortune."},{"name":"PUMPKIN","text":"Enchanted cookies for enchanted younglings. A single bite, and the curse shall crumble!"},{"name":"PUMPKIN","text":"But counter-spells are fickle things─you must offer the treat while garbed in costume, or the magicks will remain dormant. Be sure to dress in your All Saints' best!"},{"name":"GODRIQUELAIN","text":"I've been in contact with the Adventurers' Guild. My superiors say they will offer us whatever support they can spare. Were you able to learn aught of the children's disappearance?"},{"name":"GODRIQUELAIN","text":"...Gods preserve us! So that was why they needed the younglings! Legend has it that, on the Night of Devilry, a veritable army of darkness descended upon the realm and wrought unimaginable havoc."},{"name":"GODRIQUELAIN","text":"I knew the Circus was up to no good, but I never imagined that they sought to recreate such an abhorrent event. We cannot allow them to unleash this plague of evil..."},{"name":"GODRIQUELAIN","text":"Hmmm. I am loath to trust the word of that strange apparition you encountered, but I fear we have little choice. Here is what we shall do:"},{"name":"GODRIQUELAIN","text":"I will rendezvous with the members whom the guild is sending, and widen the net of our investigation. Meanwhile, I ask that you heed the counsel of your pumpkin-headed acquaintance, and rescue the children from their fiendish fate."},{"name":"GODRIQUELAIN","text":"Ah, did she not mention something about dressing in your All Saints' best before attempting to hand out those enchanted cookies?"},{"name":"GODRIQUELAIN","text":"Pray don something appropriate for the season and we'll see how you look..."},{"name":"SYSTEM","text":"Equip a witch's hat, a witch's coatee, a pair of witch's gloves, and a pair of witch's thighboots, and then speak with the Adventurers' Guild investigator."},{"name":"SYSTEM","text":"In the event that you do not possess the required items, they may be purchased from the shady smock vendor in Gridania."},{"name":"GODRIQUELAIN","text":"“Dress in your All Saints' best,” she says... Pray don something appropriate for the season and we'll see how you look."},{"name":"GODRIQUELAIN","text":"Ah, yes, that should do nicely! You look ready to march in an All Saints' Wake parade!"},{"name":"GODRIQUELAIN","text":"Let us hope it is enough. Track down the ensorcelled younglings, and have them crunch on those curious cookies!"},{"name":"STRANGEDEMONA02150","text":"Raaar! I'll eat you up! ...Wait, do ahrimans say “raaar”?"},{"name":"STRANGEDEMONA02150","text":"...What's that? A cookie? For me? The ferocious ahriman accepts your offering!"},{"name":"CHILDA02150","text":"Huh? Hey! The monster spell wore off! But I was having so much fun!"},{"name":"CHILDA02150","text":"...Our nanny is looking for us, is she? Uh-oh. I'd better head back before I get into trouble!"},{"name":"STRANGEDEMONB02150","text":"Don't you know who I am!? I am the Master of the Void! Gravel...er, I mean, “grovel” before me!"},{"name":"STRANGEDEMONB02150","text":"...Is that a cookie!? Oooh, I love cookies! Thanks, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>!"},{"name":"CHILDB02150","text":"Oof! Oh. I'm “me” again."},{"name":"CHILDB02150","text":"...Our nanny sent you? Well, I'd best be going, or she might not let us have sweets!"},{"name":"STRANGEDEMONC02150","text":"I am the strongest there is! ...Y-You don't believe me? Just wait until I crawl out of this pot!"},{"name":"STRANGEDEMONC02150","text":"&lt;sniff&gt; What kind of cookie is that? I prefer chocolate, but I suppose monsters'll eat anything!"},{"name":"CHILDC02150","text":"Whoa! ...Hey, where'd my pot go!?"},{"name":"CHILDB02150","text":"...Our nanny wants us home, huh? &lt;sigh&gt; I guess I better go, then. Drat, I never even got to scare anyone!"},{"name":"GODRIQUELAIN","text":"Quickly, now! Track down the ensorcelled younglings, and have them crunch on those curious cookies!"},{"name":"GODRIQUELAIN","text":"You've done it! The missing children have all returned, and none the worse for wear!"},{"name":"GODRIQUELAIN","text":"Aye, I had my doubts about those magical treats, but it would seem the pumpkin-headed stranger did not deceive us. We are making doubly sure, however, that those three younglings remain safe with their families."},{"name":"GODRIQUELAIN","text":"That puts to rest the investigation here at Hyrstmill, but I'm afraid our troubles with the Continental Circus are far from over..."},{"name":"GUARDIAN02150","text":"The parents all assure me that their little ones are home with them now. What a horrible feeling, thinking that I'd lost them..."}],"reward":{"gil":320,"items":[{"id":13113}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":1}],"quests":[67685]},"next":[67687]},"partials":[{"type":"npc","id":"1015778","obj":{"i":1015778,"n":"Adventurers' Guild Investigator","l":53,"q":2}},{"type":"npc","id":"1015782","obj":{"i":1015782,"n":"Adventurers' Guild Investigator","l":57,"q":2}},{"type":"item","id":"13113","obj":{"i":13113,"n":"Pumpkin Butler","l":1,"c":59548,"t":81}},{"type":"item","id":"13099","obj":{"i":13099,"n":"Witch's Hat","l":1,"c":41277,"t":34,"p":59}},{"type":"item","id":"13100","obj":{"i":13100,"n":"Witch's Coatee","l":1,"c":42476,"t":35,"p":59}},{"type":"item","id":"13101","obj":{"i":13101,"n":"Witch's Gloves","l":1,"c":44396,"t":37,"p":42}},{"type":"item","id":"13102","obj":{"i":13102,"n":"Witch's Thighboots","l":1,"c":46547,"t":38,"p":60}},{"type":"quest","id":"67685","obj":{"i":67685,"n":"Investigating the Inimical","g":203,"l":"Gridania","s":88}},{"type":"quest","id":"67687","obj":{"i":67687,"n":"Sweeping the Meadows","g":203,"l":"North Shroud","s":90}}]}