{"quest":{"name":"Investigating the Inimical","location":"Gridania","id":67685,"patch":3.07,"sort":88,"icon":100490,"eventIcon":71221,"issuer":1015778,"target":1015778,"genre":203,"journal":["The Adventurers' Guild investigator is on the lookout for an able assistant.<br>※This quest is available for a limited time only.","An investigator from the Adventurers' Guild has asked your help in uncovering the nefarious plans of the Continental Circus─a troupe of mischievous fiends disguised as entertainers. Approach the illusionists outside Mih Khetto's Amphitheatre, and learn what you can of their impending devilry.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak with the festive illusionists, but they are quick to turn you away. Whatever malevolent plan they have for this year's All Saints' Wake seems to revolve around the participation of the city's children. Report your findings to the Adventurers' Guild investigator.","Upon digesting the information you gleaned from the illusionists, the investigator is struck by the force of his terrible imaginings. What manner of dark mischief could the Continental Circus be planning...?"],"objectives":["Speak with illusionists.","Report to the Adventurers' Guild investigator."],"dialogue":[{"name":"GODRIQUELAIN","text":"Ah, a fellow adventurer! It just so happens that I could use your help with some Adventurers' Guild business. Might you spare a moment or two?"},{"name":"GODRIQUELAIN","text":"The business of which I speak involves keeping an eye on that troublesome troupe of entertainers─the Continental Circus."},{"name":"GODRIQUELAIN","text":"One might wonder why this particular group of performers concerned us so...until one beheld their true fiendish forms. Aye, there is naught more terrifying than the monster who hides behind the face of a man."},{"name":"GODRIQUELAIN","text":"Every year, when the season of All Saints' Wake is upon us, these irksome imps visit our cities to spread their mischief and mayhem. Oddly enough, there are many folk who actually <span class=\"emphasis\">enjoy</span> their antics... Thus we stop short of banishing the creatures outright."},{"name":"GODRIQUELAIN","text":"In the interests of maintaining a semblance of order, however, the guild would have us quell the Circus's efforts to instigate chaos─discreetly, of course."},{"name":"GODRIQUELAIN","text":"Unfortunately, it would appear that covert operations are not my forte. The fiends have grown leery of my clumsy interrogations, and I am in need of a capable replacement. Will you, then, perform the duty that I could not?"},{"name":"GODRIQUELAIN","text":"Excellent! Your first task shall be to engage the troupe's illusionists in conversation, and skillfully prise forth their nefarious plans. May you fare better in your efforts than I!"},{"name":"GODRIQUELAIN","text":"Speak with the nearby illusionists, and learn what you can of their wicked scheme."},{"name":"MEMBERA02149","text":"The Continental Circus is here! This All Saints' Wake you'll squeal and cheer!"},{"name":"MEMBERB02149","text":"Come, join us in celebrating All Saints' Wake!"},{"name":"MEMBERC02149","text":"We have an extra-special event in store for this year's celebrations! I'd tell you now, but...I wouldn't want to spoil the surprise!"},{"name":"MEMBERA02149","text":"Oh, darling children, sweet and small! Gather 'round younglings, one and all! This All Saints' Wake you'll have a ball!"},{"name":"MEMBERB02149","text":"This year's All Saints' Wake is all about the children! Come to Hyrstmill, my precious younglings, for free costumes and seasonal sweets!"},{"name":"MEMBERC02149","text":"Hm? Seeking to join the festivities, are we? I'd love to oblige you, but I'm afraid our costumes are only for the children this year. Perhaps we'll focus on the grown-ups next time around!"},{"name":"MEMBERA02149","text":"Oh, darling children, sweet and small! Gather 'round younglings, one and all! This All Saints' Wake you'll have a ball!"},{"name":"MEMBERB02149","text":"This year's All Saints' Wake is all about the children! Come to Hyrstmill, my precious younglings, for free costumes and seasonal sweets!"},{"name":"MEMBERC02149","text":"Hm? Seeking to join the festivities, are we? I'd love to oblige you, but I'm afraid our costumes are only for the children this year. Perhaps we'll focus on the grown-ups next time around!"},{"name":"GODRIQUELAIN","text":"Well, my friend? What have you discovered of the fiends' machinations?"},{"name":"GODRIQUELAIN","text":"Hmmm, so they seek to lure the younglings to Hyrstmill with the promise of costumes and sweets. Why, any manner of terrible plot could unfold so far from the safety of the city..."},{"name":"GODRIQUELAIN","text":"I like this not one bit. I've a mind to make for Hyrstmill this very instant!"}],"reward":{"items":[{"id":13099},{"id":13100},{"id":13101},{"id":13102}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":1}]},"next":[67686]},"partials":[{"type":"npc","id":"1015778","obj":{"i":1015778,"n":"Adventurers' Guild Investigator","l":53,"q":2}},{"type":"item","id":"13099","obj":{"i":13099,"n":"Witch's Hat","l":1,"c":41277,"t":34,"p":59}},{"type":"item","id":"13100","obj":{"i":13100,"n":"Witch's Coatee","l":1,"c":42476,"t":35,"p":59}},{"type":"item","id":"13101","obj":{"i":13101,"n":"Witch's Gloves","l":1,"c":44396,"t":37,"p":42}},{"type":"item","id":"13102","obj":{"i":13102,"n":"Witch's Thighboots","l":1,"c":46547,"t":38,"p":60}},{"type":"quest","id":"67686","obj":{"i":67686,"n":"Joining the Circus","g":203,"l":"Gridania","s":89}}]}