{"quest":{"name":"Sweeping the Meadows","location":"North Shroud","id":67687,"patch":3.07,"sort":90,"icon":100492,"eventIcon":71221,"issuer":1015782,"target":1015799,"genre":203,"journal":["The investigator appears to have new information concerning the Continental Circus's mischief.<br>※This quest is available for a limited time only.","The investigator shares with you the reports of his fellows in the Central Shroud─it would appear that the Continental Circus's wicked scheme was not restricted to Hyrstmill. Make your way to Bentbranch Meadows, and rendezvous with the Adventurers' Guild investigator.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You join the investigator in Bentbranch, and he grimly explains the situation. Though no children have yet been transformed, it will only be a matter of time before they fall prey to the charms─and curses─of the wily imps. Even as the adventurer contemplates a means by which you might shield the younglings from the illusionists' sinister spells, you hear a voice beckoning you hither. Leave the investigator to his desperate deliberations, and search for the owner of the disembodied voice.","You locate the owner of the voice─the pumpkin-headed stranger─and she once more provides a solution to your occult quandary. She offers you the use of an enchanted broom, whose magic will allow you to sweep away the ability to fling transfiguration curses. Ride the witch's broom around Bentbranch Meadows, and cast Silencing Cant on all the unusual imps you can find.","You find all the imps lurking around Bentbranch Meadows, and use the broom's magic to sweep away their power to curse. Report your deed to the Adventurers' Guild investigator.","The investigator is impressed by your unexpected solution, but laments that it came too late to save one little girl. Considering the case in Hyrstmill, he muses, it is likely that the missing Miqo'te has already been subjected to a fiendish transformation. Speak with the pumpkin-headed apparition once more, and request another batch of curse-breaking cookies.","You bring your request to the pumpkin-headed stranger, and she explains that her cookies must be eaten soon after the transformation takes place to have any effect. She sadly concludes that by the time another batch was baked it would be far too late. It is then that the apparition presents you with another possibility: if you were to burn the witch's broom and sprinkle its ashes over the girl, then the curse would be broken. Look for a fire in which to cast the broom, and then gather its sooty remains.","You burn the witch's broom in a convenient campfire, and gather together its precious ashes. Find the transfigured Miqo'te girl, and use the ash to dispel her monstrous visage.","You find an imp wailing in distress, and shower the creature with the broom ash. Almost instantly, the little girl is restored to her normal form. Return to the Adventurers' Guild investigator and report your success.","You return to the investigator to find a relieved T'danafa reunited with her daughter. She thanks you profusely for rescuing T'maritaa, before turning to scold her wayward child. Meanwhile, the lead conspirators of the Continental Circus begin to suspect that someone has learned the trick of dispelling their transformation magicks. Fearing that their identities will be exposed, they choose to abandon their malefic plot and focus on maintaining their entertainers' masquerade.<br><br>The pumpkin-headed apparition heralds you as the savior of All Saints' Wake, and rewards you with a new witch's broom. Ride your new prize to the clouds and beyond as you enjoy the remainder of the festival!"],"objectives":["Speak with the Adventurers' Guild investigator at Bentbranch Meadows.","Locate the source of the disembodied voice.","Use Silencing Cant on unusual imps.","Report to the Adventurers' Guild investigator.","Consult with the pumpkin-headed apparition.","Burn the witch's broom in the campfire and obtain the broom ash.","Use the broom ash on the imposing imp.","Report to the Adventurers' Guild investigator."],"dialogue":[{"name":"GUARDIAN02151","text":"The parents all assure me that their little ones are home with them now. What a horrible feeling, thinking that I'd lost them..."},{"name":"GODRIQUELAIN","text":"I've received word from the guild that more wickedness is brewing!"},{"name":"GODRIQUELAIN","text":"We sent people to the Central Shroud to watch for possible mischief, and it's fortunate that we did─they've reported seeing the Circus's illusionists approaching children at Bentbranch Meadows."},{"name":"GODRIQUELAIN","text":"If we leave these fiends to work their vile magicks, yet more innocents may be cursed into monstrous forms! Let us away at once!"},{"name":"GUARDIAN02151","text":"P-Please, I've yet to... That is to say, I was so overcome with relief, I almost forgot to thank you. You've done a wonderful thing this day!"},{"name":"GODRIQUELAIN","text":"All in a day's work, good madam. Pray pass on a message to those younglings: beware the stranger whose words are sweeter than All Saints' treats."},{"name":"GODRIQUELAIN","text":"Now, we really must press on to Bentbranch!"},{"name":"GODRIQUELAIN","text":"The situation is grim, my friend. By my count, there are at least half a dozen of those devilish enchanters prowling about."},{"name":"GODRIQUELAIN","text":"The children, of course, find these affable fiends to be absolutely fascinating─it will be next to impossible to convince the little ones to keep their distance. If only there was some way to shield them from the illusionists' sinister spells..."},{"name":"PUMPKIN","text":"(-Disembodied Voice-)Heh heh heh... Come to me, troubled soul."},{"name":"GODRIQUELAIN","text":"...Hm? Nay, I heard no voice. I fear I am deaf to all but the rising panic within my mind..."},{"name":"GODRIQUELAIN","text":"We must find a way to protect the younglings... A talisman of some kind? Nay, there is not the time to craft them..."},{"name":"PUMPKIN","text":"Heh heh heh... Once again I find you plagued with worry, and that will not do. That will not do at all. Here, you must take this."},{"name":"PUMPKIN","text":"'Tis an enchanted broom. If you so command, it will sweep away whatever you desire: a bad memory, a nagging doubt, the ability to cast a particular spell..."},{"name":"PUMPKIN","text":"All you need do is sit astride the handle, and its special cant will be yours to intone. Cast the cant on an imp, for instance, and poof! No more transfiguration curses!"},{"name":"PUMPKIN","text":"Hop on, then, and off you go! ...Ah, children─so eager to become the things that grown men are wont to fear. Such odd little creatures."},{"name":"PUMPKIN","text":"You wish to ride the broom again? Heh heh heh... Be my guest!"},{"name":"CIRCUSMEMBERA02151","text":"Just a moment more, then I will help you into your new, uh, costume!"},{"name":"CHILDA02151","text":"Hurry, hurry! I want to go scare my sister!"},{"name":"CIRCUSMEMBERA02151","text":"Now, child, hold very still...<br>Hm? My magic!? Why isn't it working!? Curses and calamities! Y-You haven't seen the last of me!"},{"name":"CHILDA02151","text":"Hey! What about my costume!? Hmph. I guess I'll just go home..."},{"name":"CIRCUSMEMBERB02151","text":"Here we are: a nice secluded spot."},{"name":"CHILDB02151","text":"Can I have my costume now? I'm tired of walkin'..."},{"name":"CIRCUSMEMBERB02151","text":"Your wish is my command! Aaand...hah! Huh? Did I flick my wrist the wrong way? Um, we'll try this again later, okay?"},{"name":"CHILDB02151","text":"Wait! But you said... Great, now I've shirked my chores for nothin'."},{"name":"CIRCUSMEMBERC02151","text":"Are you ready for your costume now?"},{"name":"CHILDC02151","text":"Yay! Yes, please!"},{"name":"CIRCUSMEMBERC02151","text":"Very well. Witness your new form, and despair! Ahem, I said DESPAIR! ...Er, a little help, Impresario? IMPRESARIO!"},{"name":"CHILDC02151","text":"Mister Imp, where are you going!? ...Oh, he's gone. What a strange little monster."},{"name":"CIRCUSMEMBERD02151","text":"Yes, yes, all will soon be in readiness. You would do well to show some humility before a denizen of the void, child..."},{"name":"CHILDD02151","text":"Where. Is. My. Costume!? I'm going to be late for the festival!"},{"name":"CIRCUSMEMBERD02151","text":"Writhe under my eternal curse, mortal!<br>I... Why are you not writhing? Did the spell backfire? Oh, the embarrassment!"},{"name":"CHILDD02151","text":"Wha─ Hey, come back here! You said you could do magic! Hmph. What a waste of time."},{"name":"CIRCUSMEMBERE02151","text":"You'll have your treats soon enough, child─<span class=\"emphasis\">after</span> we complete your transformation."},{"name":"CHILDA02151","text":"Where are the sweets you promised me? Sweets! Sweets! <span class=\"emphasis\">Sweeeeeets</span>!"},{"name":"CIRCUSMEMBERE02151","text":"Right! Let's dress you up for the celebrations, shall we?<br>...Wait, why can't I─ Oh dear. I'll just...go fetch your sweets!"},{"name":"CHILDA02151","text":"Okay! Don't be long!<br>...I don't think he's coming back."},{"name":"CIRCUSMEMBERF02151","text":"I shall now harness my dark energies! Your transformation is at hand!"},{"name":"CHILDF02151","text":"Can you really change me into a monster? This better not be a trick!"},{"name":"CIRCUSMEMBERF02151","text":"Behold! The sinister power...of...the...void? Hmmm. I may have to work my magic on you another time!"},{"name":"CHILDF02151","text":"I knew it. It's all fake. These performers are just putting on a show to draw in the crowds..."},{"name":"GODRIQUELAIN","text":"You...what!? The illusionists are gone from Bentbranch!? I don't know how you chased off those imps without drawing a blade, but consider me duly impressed."},{"name":"GODRIQUELAIN","text":"I am afraid that your actions, however, may have come too late for poor T'danafa here─her young daughter has gone missing. Considering the case in Hyrstmill, we must consider the possibility that the girl has fallen victim to the Circus imps and their transformation magicks."},{"name":"PARENTMIQOTE02151","text":"My daughter and I journeyed here from Ul'dah, thinking we might celebrate All Saints' Wake in Gridania for a change. This “transformation” you speak of was not the kind of change we were looking for..."},{"name":"GODRIQUELAIN","text":"We must track down this missing Miqo'te lass, and break the curse upon her. Ah, if only you had some more of those special cookies..."},{"name":"GODRIQUELAIN","text":"Might you try speaking with that pumpkin-headed stranger again? Perhaps she could provide you with another batch of baked miracles..."},{"name":"GODRIQUELAIN","text":"Even should we manage to locate the missing lass, we have no way of returning her to her normal form. Pray speak with the pumpkin-headed stranger once more, and prevail upon her to bake another batch of those curse-breaking cookies!"},{"name":"PUMPKIN","text":"Heh heh heh... You have swept this place clean of curse-flinging imps, and still your face is as dark as an autumn storm. What more is there to be done?"},{"name":"PUMPKIN","text":"...Ah, so the Circus claimed a victim here after all. As for my cookies, well, they must be eaten soon after the transformation takes place, or their meager magicks will have no effect."},{"name":"PUMPKIN","text":"Unfortunately, the three cookies I gave you were all I had left, and by the time I baked more it would be too late for the girl. Such is the fickle nature of counter-spells. But there is another way..."},{"name":"PUMPKIN","text":"The curse can also be broken by burning this witch's broom and sprinkling the ash on the transfigured child."},{"name":"PUMPKIN","text":"...This means, of course, that you will never be able to ride the broom again. Are you willing to make that sacrifice?"},{"name":"CHOICE2Q1","text":"Will you burn the broom?"},{"name":"CHOICE2A1","text":"Yes."},{"name":"CHOICE2A2","text":"No."},{"name":"PUMPKIN","text":"Then you'd best forget about breaking the curse. I hope the little girl enjoys her new life as a hideous fiend..."},{"name":"PUMPKIN","text":"Then take it. Find a nice, hot fire, and cast the broom into the flames!"},{"name":"SYSTEM","text":"The witch's broom immediately catches fire and burns down to ash within moments."},{"name":"GUARDIAN02151","text":"I thought we'd make a nice cheery fire for the children. Lovely and warm!"},{"name":"CHILDMIQOTE02151","text":"&lt;sob&gt; ...But I don't want to be a monster forever! Someone, please, help me!"},{"name":"CHILDMIQOTE02151","text":"You... You're not afraid of me? Are you going to change me back!?"},{"name":"CHILDMIQOTE02151","text":"You did it! I'm not a horrible, scaly <span class=\"emphasis\">thing</span> anymore!"},{"name":"CHILDMIQOTE02151","text":"...Oh gods, my mother must be so angry! I have to go find her! Thank you so much, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>!"},{"name":"CHILDMIQOTE02151","text":"Oh, it's the nice <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> with the magic dust!"},{"name":"PARENTMIQOTE02151","text":"After hearing your tales I was frantic, thinking I'd never have my darling T'maritaa back again...but here she is, safe and sound. You have my eternal gratitude."},{"name":"PARENTMIQOTE02151","text":"...And as for you, young lady! How many times have I told you not to wander off with strange beings from the void!?"},{"name":"CHILDMIQOTE02151","text":"I'm sorry, Mother..."},{"name":"CHILDMIQOTE02151","text":"It seemed like such a good idea to be turned into a monster, and it <span class=\"emphasis\">was</span> really fun at first... But when I didn't change back, I thought I'd be stuck in that ugly body for the rest of my life. Thank you again for saving me!"},{"name":"IMPHEAD","text":"Why have our curses failed to take hold?"},{"name":"WITCH02150","text":"I cannot understand it, Impresario... Could it be that someone has caught wind of our true intentions!?"},{"name":"IMPHEAD","text":"Hmmm... A troublesome thought. And if this meddler has learned the secret of dispelling our transfiguration magicks, then our true identities are at risk..."},{"name":"WITCH02150","text":"But we've been so clever with our deceit!"},{"name":"WITCH02150","text":"If there truly is someone who can undo our transformations, then what is to become of our carefully laid plans!? What of the Night of Devilry!?"},{"name":"IMPHEAD","text":"I am afraid it is not to be. We must exercise caution, and spend the remainder of All Saints' Wake maintaining our entertainers' masquerade."},{"name":"IMPHEAD","text":"&lt;sigh&gt; Another year, another failure..."},{"name":"GODRIQUELAIN","text":"...Do they honestly believe they've kept their true nature a secret? Well, at least they'll be causing decidedly less trouble for the time being. Not that I won't be keeping an eye on them, of course!"},{"name":"PUMPKIN","text":"Heh heh heh... Betwixt monstrous children and childish monsters, it has been a tempestuous time indeed. At last, however, it seems that we might pass All Saints' Wake with laughter and revelry rather than screams and horror."},{"name":"PUMPKIN","text":"For your part in this, our All Saints' savior, you must have a reward.<br>Even the heavens will not be spared the heights of this celebration..."}],"reward":{"gil":345,"items":[{"id":13098}],"xp":4060},"reqs":{"jobs":[{"lvl":20,"id":1}],"quests":[67686]}},"partials":[{"type":"npc","id":"1015782","obj":{"i":1015782,"n":"Adventurers' Guild Investigator","l":57,"q":2}},{"type":"npc","id":"1015799","obj":{"i":1015799,"n":"Adventurers' Guild Investigator","l":54,"q":1}},{"type":"item","id":"13098","obj":{"i":13098,"n":"Witch's Broom","l":1,"c":59471,"t":63}},{"type":"quest","id":"67686","obj":{"i":67686,"n":"Joining the Circus","g":203,"l":"Gridania","s":89}}]}