{"quest":{"name":"Contradicting Convictions","location":"Ishgard","id":67688,"patch":3.15,"sort":10,"icon":100513,"eventIcon":71221,"issuer":1012181,"target":1012181,"involved":[1015924,1015925,1015926,1015930,1015931,1015932],"genre":78,"journal":["Mathye sighs as he looks around for customers.","Mathye explains to you that business has not been going so well after the recent turmoil in the church. He mentions that his best customers, the students of the scholasticate, are often being followed back to the cathedral by disagreeable folk, and less are inclined to walk around in the open, including to the Crozier. In an effort to keep coin flowing, Mathye requests you to make a round near the road to the cathedral and put an end to any harassment you may see.","You soon spot an altercation between a group of angry paupers and students clad in scholasticate robes. The encounter escalates when the resentful ruffians make off with a tome of one of the students, Theomocent. The mousy-looking seminarian runs after them to retrieve it, and his friend asks you to pursue him for fear of his safety.","You find Theomocent out of breath in a dark alcove, outnumbered by a group of aggrieved Brume residents. The student recognizes their ringleader, “Ben,” as an acquaintance from childhood, and pleads with him to return the book. However, Ben grows angry with the unexpected reunion and holds Theomocent's book over a brazier, intending to destroy it out of spite. Lamenting he was not able to leave his unfortunate circumstances for the scholasticate as Theomocent had, he is soon caught off guard by Leigh, another lowborn student. Leigh attempts to save the book after Ben casts it into the flames and escapes, but he is too late in his attempt to rescue it unscathed. He returns the charred tome to a relieved Theomocent, and the two express their gratitude to you before heading back to the scholasticate.","You return to the Jeweled Crozier to find Mathye speaking with a woman of the cloth, and he expresses satisfaction that his business interactions will return to normal with your good deed. He introduces you to Gaetelle of Saint Endalim's Scholasticate, and the clergywoman recognizes you as the adventurer who brought about the revelation of inconsistencies in the teachings. She explains the scholasticate's precarious situation in the aftermath, and how the students have become targets for the public's ire. Impressed by your goodwill towards the students, she asks that you visit the scholasticate for an opportunity to meet with the headmistress."],"objectives":["Speak with the impertinent pauper.","Speak with Theomocent in the Brume.","Speak with Mathye in the Jeweled Crozier."],"dialogue":[{"name":"MATHYE","text":"Ah, my dear <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. How fare you these days? Can't say business has been well, myself."},{"name":"MATHYE","text":"As you are aware, the church is in a bit of turmoil, and it's taking a toll on my profits. Unrest is understandable, yet there are many who are using the confusion to take out their anger on my best customers."},{"name":"MATHYE","text":"Now, I'm not one to get mixed up in politics, but the students of the scholasticate pay good gil for tomes and feathered quills. One made a request that I'm wont to oblige in order to keep the coin flowing."},{"name":"MATHYE","text":"On behalf of her peers, she told me some disagreeable folk have been following seminarians back to the cathedral, hurling all manner of insults. Easily singled out by their uniforms, they don't feel comfortable walking out in the open these days, and that includes around the Crozier."},{"name":"MATHYE","text":"If you're inclined to keep an eye out for those who would try to harass the students, I'd ask you to make a round near the road to Saint Reymanaud's Cathedral. If you see anyone starting trouble, do what adventurers do best─you know, break it up, keep the peace, look intimidating."},{"name":"MATHYE","text":"The students should be returning to the scholasticate soon. I'd suggest you patrol the street near Saint Reymanaud's Cathedral to make certain they are safe."},{"name":"THEOMOCENT","text":"S-Sir! Can we not discuss this like civilized men?"},{"name":"SUTUDNET02152","text":"We understand his grievances, but we are mere students of the holy word!"},{"name":"BOUTO02152","text":"Our lives are hard enough without some fresh-faced seminarian rubbing salt into our wounds! Will your precious words repay us for what we've lost? Will they bring back the dead?"},{"name":"THEOMOCENT","text":"N-No, of course not, but as a pupil of the scholasticate, I cannot forsake the teachings. If you give the book back, I am certain I can show you the proper passage to provide succor in your time of─"},{"name":"BOUTO02152","text":"How dare you! As if the lies in this book will keep us warm at night! Better to destroy it, than be destroyed by it!"},{"name":"THEOMOCENT","text":"Sir? Sir! I absolutely cannot allow you to take that particular tome! Come back!"},{"name":"SUTUDNET02152","text":"Is he really going to? Oh no..."},{"name":"SUTUDNET02152","text":"You're an adventurer, aren't you? Please, will you help my friend get his tome back? "},{"name":"SUTUDNET02152","text":"We were on our way back to the scholasticate when that man accosted us. It has become an unfortunate occurrence these days, but this is the first time someone went so far as to make off with one of our books."},{"name":"SUTUDNET02152","text":"Theomocent may mean well, but I fear he will get caught up in a lot more trouble if they outnumber him. I'll go and get help!"},{"name":"SUTUDNET02152","text":"I'll be fine, the cathedral is not far from here. But please, help my friend! He treasures that book more than his life!"},{"name":"BEN","text":"I'm warning you, you'd best not meddle with what you don't know."},{"name":"BOUTO02152","text":"Well, what have we here. Any ideas on what to do with these two, Ben?"},{"name":"THEOMOCENT","text":"Ben? Is that you? My goodness, what are the chances of meeting at a time like this? Please, I would appreciate it if you would ask your friend to produce the tome he has taken from me."},{"name":"BEN","text":"Well, well. Theomocent, it's been a while."},{"name":"BEN","text":"Careful, now. I was in the mood for some light reading, but if you or your friend so much as take a step, your precious tome goes up in smoke."},{"name":"BEN","text":"Ah, <span class=\"emphasis\">The Parables of Saint Daniffen</span>. I know this title. It's the one we were read as children. I recall Father Choisseau gave you his own copy before you left the Brume for your “higher learning.”"},{"name":"THEOMOCENT","text":"Then you know how much it means to me. I made a promise to him to keep its lessons dear to my heart, and I have kept it with me ever since."},{"name":"BEN","text":"All the more reason to burn it. To scatter the ashes, and your dreams along with them."},{"name":"BEN","text":"He taught us three the same! Why was I left to rot in this wretched place!? Why not you or Leigh!? What made you two so bloody special!?"},{"name":"LEIGH","text":"Put the book down, Ben! Or I'll see you burned as well!"},{"name":"BEN","text":"Of all the people...<br>You'd best watch yourselves. The world is changing, and we won't listen to your lies anymore! I'll make sure of that!"},{"name":"LEIGH","text":"Sacrilegious bastard. It's been badly charred.<br>I'm sorry, but I'm afraid you won't get much out of it now."},{"name":"THEOMOCENT","text":"Worry not, Leigh. I have already committed the entire text to heart. I am just happy it has been returned to me."},{"name":"LEIGH","text":"Typical. You shouldn't let him off the hook so easily, you know. Were it not that I pity him, I'd hand him over to the inquisitors without a second thought."},{"name":"THEOMOCENT","text":"You came to help me, yes? Were it not for you, I am certain they would have turned their hatred towards me soon after."},{"name":"THEOMOCENT","text":"I wish I could pay you for your services, but I am afraid I live on but a meager stipend, hardly enough for candles and ink. But if you would be so kind as to tell me your name?"},{"name":"THEOMOCENT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, I am sincerely grateful to you for your protection. I may not have much in the way of coin, but if you are ever in need of spiritual enlightenment, then you need look no further than the cathedral. Halone's blessings be upon you."},{"name":"QUIQUETIN","text":"(-???-)What does one do with a smoldering tome of parables? Will they struggle to abide the lessons of its now-blackened words, or rise from its ashes? This answer, I eagerly await..."},{"name":"GAETELLE","text":"Oh, thank goodness, it's just an adventurer. I beg your pardon, but with all the violence in the streets, I find myself all too wary of those who approach me."},{"name":"MATHYE","text":"You've returned, and not a moment too soon. The students seem less anxious, and business has nearly returned to normal! I presume you found who has been harassing them?"},{"name":"GAETELLE","text":"Oh dear, not again. Where are the patrols when they are needed?"},{"name":"MATHYE","text":"They've been spread thin from what I hear. Fortunately, this <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> was willing to lend a hand."},{"name":"GAETELLE","text":"I thank you for looking out for the well-being of our pupils. I am Sister Gaetelle of Saint Endalim's Scholasticate."},{"name":"GAETELLE","text":"And might I ask your...? Oh dear. I know your face! You are <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, the one who had a hand in revealing the true history of the Holy See!"},{"name":"MATHYE","text":"What? By the─ You mean to tell me I've been tasking <span class=\"emphasis\">the</span> <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> as my errand <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!? And you accepted it with such grace!? Halone Herself could not have arranged such a curious encounter!"},{"name":"GAETELLE","text":"On the contrary, I believe our meeting is the product of intervention most divine. <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, if you would be so inclined, I would like to take you to meet the headmistress of our humble scholasticate."},{"name":"GAETELLE","text":"By your deeds was light shed on certain inconsistencies in Ishgard's history─and to a lesser extent, the church's teachings. Needless to say, the resulting controversy has strained the relationship between the people and the clergy."},{"name":"GAETELLE","text":"The foundation of our great city–state rests upon the wisdom of the <span class=\"emphasis\">Enchiridion</span>. Alas, the lowborn in particular have suffered greatly as a result of erroneous interpretations. Some have even begun to wonder if all our precepts have been thus distorted."},{"name":"GAETELLE","text":"We of the scholasticate are wont to reflect upon these revelations deeper than most. Although we live as scholars, we had grown complacent, accepting a single interpretation set forth by the archbishop and his predecessors."},{"name":"GAETELLE","text":"Although we are openly reevaluating our teachings, our students continue to be targeted by those who feel they have been deceived. As you yourself have no doubt seen, there are those who would rather purge the city of all clergy, regardless of their guilt."},{"name":"GAETELLE","text":"But with you on our side, surely those miscreants would think twice before harming our students. Pray come and visit our halls. I am certain the students would be put at ease to see you again as well."}],"reward":{"gil":648,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"questsType":"all","quests":[67405,67205]},"next":[67689]},"partials":[{"type":"npc","id":"1012181","obj":{"i":1012181,"n":"Mathye","l":2301,"q":6}},{"type":"npc","id":"1015924","obj":{"i":1015924,"n":"Theomocent","l":2301,"q":1}},{"type":"npc","id":"1015925","obj":{"i":1015925,"n":"Spineless Seminarian","l":2301,"q":1}},{"type":"npc","id":"1015926","obj":{"i":1015926,"n":"Impertinent Pauper","l":2301,"q":1}},{"type":"npc","id":"1015930","obj":{"i":1015930,"n":"Ben","l":2300,"q":1}},{"type":"npc","id":"1015931","obj":{"i":1015931,"n":"Theomocent","l":2300,"q":1}},{"type":"npc","id":"1015932","obj":{"i":1015932,"n":"Gaetelle","l":2301,"q":2}},{"type":"quest","id":"67405","obj":{"i":67405,"n":"Keeping the Ledger","g":78,"l":"Ishgard","s":1}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"67689","obj":{"i":67689,"n":"The Benefits of Consultation","g":78,"l":"Ishgard","s":11}}]}