{"quest":{"name":"A Little Slow, a Little Late","location":"The Dravanian Forelands","id":67696,"patch":3.1,"sort":5,"icon":100511,"eventIcon":71201,"issuer":1015998,"target":1016002,"involved":[1011928,1015997,1015999,1016000,1016001,1016003],"genre":4,"journal":["Alphinaud would like very much to continue the search for Thancred.","At Alphinaud's impassioned urging, you set out for Loth ast Vath to continue the search. Speak with the Vath storyteller and see if he recognizes Thancred from the sketch.","Though wary at first, the storyteller soon confirms that the Vath have indeed had dealings with Thancred. The “fleshling clothed in skins,” as they call him, came to them from Sohm Al weak and disoriented, and was given succor in exchange for meat and hides. According to the storyteller, he stayed with them for some time, but left recently, after learning that the Gnath had summoned forth Ravana from the aether once more─news which comes as a shock to your allies, but does much to explain the beastmen's recent aggression towards Anyx Trine. Fearing what may happen if Thancred is forced to face the Gnath alone, you resolve to find him before they do. Clear a path to Loth ast Gnath that your allies might follow.","You quickly dispatch the sentries stationed outside the stronghold's entrance. All that remains is to wait for the others to arrive.","Moments after being rejoined by your comrades, you hear the unmistakable sounds of battle coming from deep within the Gnath stronghold. Fearing that Thancred may be in danger, you rush towards the source of the cacophony, only to be confronted with an unexpected sight: a party of adventurers locked in combat with the Lord of the Hive, and having seized the upper hand no less. As you look on in silence, their leader cuts down the Gnath god in a display of power far beyond that of any common adventurer. An equal, perhaps? ...Or a rival? Cautiously, you and your allies approach the strangers, and as you lock eyes with their leader, you find yourself overcome with a vision of his past.<br><br>You see him and his comrades stand against an Ascian, just as you once stood against Lahabrea, and watch as they forge a blade to strike him down. A blade not unlike your own blade of Light.<br><br>“So you are the Warrior of Light. The savior of Eorzea.” Your counterpart regards you coldly, his every word dripping with disdain. A rival, then. Seeking to defuse the tension, Alphinaud warily requests an introduction, only to be greeted with a sudden display of force which scatters your allies, leaving you to face the leader alone. Grimly, you draw your weapon and prepare to meet his attack in kind, when suddenly, from on high, Thancred descends to duel with the warrior. After finding themselves to be evenly matched, the stranger withdraws, but not before declaring that he and his comrades are the Warriors of Darkness─and that you shall meet again.","After escaping the Gnath stronghold, Thancred explains how he survived in the wilderness before making contact with the Vath, who furnished him with his new garments, and told him of Ravana, whom he was certain you would be drawn to face. However, he did not account for the intervention of the self-proclaimed Warriors of Darkness, who clearly harbor ill will towards you and yours. Yet how could they best primals and Ascians both if not through the power of the Echo? And if they are indeed blessed as you and Krile are, what would drive them to stand in apparent opposition to your cause?"],"objectives":["Speak with the Vath storyteller.","Proceed to Loth ast Gnath, defeating any foes who stand in your way.","Wait for your comrades to arrive.","Speak with Thancred."],"dialogue":[{"name":"YSHTOLA","text":"Given that Alphinaud seems to recall the details of my return so <span class=\"emphasis\">vividly</span>, I would rather he did not draw <span class=\"emphasis\">me</span> from memory, talented or not."},{"name":"KRILE","text":"Honestly, that boy... Some things never change."},{"name":"ALPHINAUD","text":"Well, what are we waiting for? For all we know, Thancred could be waiting for us in Loth ast Vath!"},{"name":"ALPHINAUD","text":"We must go and see the Vath right away. Come along, everyone! Come along!"},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; Great hunters, we welcome you once more to Loth ast Vath. What do you seek this day?"},{"name":"ALPHINAUD","text":"We seek a man. A man with whom we are told you may have had certain dealings."},{"name":"VATHSTORYTELLER","text":"...How curious. The hunters tire of godly sport and pursue mortal prey?"},{"name":"ALPHINAUD","text":"No, no, he is not prey, but a friend long missing."},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; Good, good. He is a friend to the Vath as well, one with whom we have traded many times."},{"name":"ALPHINAUD","text":"Truly? And you are quite certain it was this man?"},{"name":"VATHSTORYTELLER","text":"There is no doubt. &lt;click&gt; &lt;click&gt; The fleshling clothed in skins came to us from Sohm Al, lost and weak. He offered meat and hides in trade, and in exchange we tended his wounds."},{"name":"VATHSTORYTELLER","text":"He brought us much flesh, so skilled a hunter he was. Much flesh. When he asked for garments, we were glad to provide them."},{"name":"YSHTOLA","text":"And where is he now?"},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; Gone to Loth ast Gnath. Not long ago. When he heard the Onemind had summoned our god once more."},{"name":"YSHTOLA","text":"Ravana is returned!?"},{"name":"ALPHINAUD","text":"Vidofnir did say that the Gnath had grown as before. But what could Thancred hope to accomplish by himself?"},{"name":"ALPHINAUD","text":"Honored elder, we thank you for your help. Would that we could repay this kindness ere we depart, but we must hasten to our comrade's side."},{"name":"VATHSTORYTELLER","text":"Go, great hunters, lest the Gnath claim him as a sacrifice. &lt;click&gt; &lt;click&gt;"},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; One hunter, however skilled, cannot stand against the colony. Go to your friend."},{"name":"YSHTOLA","text":"We should be safe here. Our pursuers are not like to stray so far from the colony."},{"name":"KRILE","text":"The vision caught me unawares, and I was unprepared for their attack, but...I could hear the colony chattering all around us... They were so loud...so unbearably loud..."},{"name":"ALPHINAUD","text":"Do you need to sit down? I have water, if it will help."},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; The colony laments for Lord Ravana. Was this your doing?"}],"reward":{"gil":843,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67695]},"next":[67697]},"partials":[{"type":"npc","id":"1015998","obj":{"i":1015998,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1016002","obj":{"i":1016002,"n":"Thancred","l":2000,"q":2}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"npc","id":"1015997","obj":{"i":1015997,"n":"Krile","l":2000,"q":2}},{"type":"npc","id":"1015999","obj":{"i":1015999,"n":"Y'shtola","l":2000,"q":1}},{"type":"npc","id":"1016000","obj":{"i":1016000,"n":"Alphinaud","l":2000,"q":2}},{"type":"npc","id":"1016001","obj":{"i":1016001,"n":"Y'shtola","l":2000,"q":2}},{"type":"npc","id":"1016003","obj":{"i":1016003,"n":"Krile","l":2000,"q":2}},{"type":"quest","id":"67695","obj":{"i":67695,"n":"In the Eye of the Beholder","g":4,"l":"The Dravanian Hinterlands","s":4}},{"type":"quest","id":"67697","obj":{"i":67697,"n":"Dreams of the Lost","g":4,"l":"The Dravanian Forelands","s":6}}]}