{"quest":{"name":"Dreams of the Lost","location":"The Dravanian Forelands","id":67697,"patch":3.1,"sort":6,"eventIcon":71201,"issuer":1016000,"target":1016008,"involved":[1011192,1011935,1012163,1012326,1012401,1012402,1016001,1016002,1016003,1016007,1016009],"genre":4,"journal":["Alphinaud is lost in thought, doubtless ruminating on the implications of your encounter with the Warriors of Darkness.","Given the relative ease with which they dispatched Ravana, it seems all but certain that the Warriors of Darkness have fought such beings before. Yet how could such exceptionally gifted individuals have escaped the notice of the Scions of the Seventh Dawn, when one of the order's founding goals was to identify and recruit adventurers blessed with the power of the Echo? Though their appearance raises many questions, their deeds cannot be denied. The Lord of the Hive is no more, and Vidofnir must be told.","Though surprised that he did not fall by your hand, Vidofnir is nevertheless pleased to learn of Ravana's defeat. Moreover, having received your good tidings, she offers some of her own: Hraesvelgr has entrusted her with deciding whether or not to accept Ser Aymeric's invitation. The great white dragon duly states that she will keep faith in you and journey to Ishgard. Elated by her reply, Alphinaud announces that he will convey her words to the lord commander at once. The time has come to return to the capital.","During the long journey back to Ishgard, you and the others share the many trials and tribulations of recent days with a rapt Thancred. Though glad to hear of your many successes, he is saddened to learn that Yda, Papalymo, and Minfilia are still missing. Seeing this, Y'shtola assures him that one day these troubles will be a distant memory─a future which Thancred pledges to do his utmost to help bring about.","Lucia receives the news of Vidofnir's acceptance with a mixture of happiness and regret, for Ser Aymeric is not present to hear it, having been wounded in an attempted assassination. Though he is like to make a full recovery, the attack was only the beginning; shortly thereafter, buildings throughout the city burst into flame, as part of what appears to be a coordinated─and ongoing─attack. As fast as the old fires are quenched, new ones are set. If the perpetrators are not brought to justice, there is no telling when the chaos will end."],"objectives":[" Speak with Vidofnir in Anyx Trine.","Speak with Alphinaud in Foundation.","Speak with Lucia."],"dialogue":[{"name":"YSHTOLA","text":"'Twould seem the mystery of the axe-wielding Hyur has been laid to rest. I should have known better than to think Thancred would ever stoop to using such an inelegant weapon... But then how was I to know there was not <span class=\"emphasis\">one</span> vagabond wandering the Chocobo Forest but two."},{"name":"KRILE","text":"He <span class=\"emphasis\">knew</span> us. He knew <span class=\"emphasis\">you</span>. Did he walk in our memories as we walked in his?"},{"name":"THANCRED","text":"I know what you're thinking, but really, you needn't worry. It will only lend credence to my tales of heroism. Besides, battle scars are to maidens what loose morals are to gentlemen. A definite bonus."},{"name":"ALPHINAUD","text":"Blessed with the power of the Echo, and driven to put down primals... Despite his declaration that they walk a different path, I struggle to see how their goals conflict with ours."},{"name":"ALPHINAUD","text":"Nor is that the only oddity. I find it passing strange that such exceptional individuals should have wholly escaped our notice until now. Surely we would have heard rumors and attempted to recruit them to our cause?"},{"name":"YSHTOLA","text":"I recall no such adventurers─and I would not soon forget their like. Nor would any of us, I think."},{"name":"YSHTOLA","text":"One of our primary duties was to scour the city–states for promising candidates─which is how <span class=\"alternative-container\"><span class=\"alternative\">I</span><span class=\"alternative\">Yda and Papalymo</span><span class=\"alternative\">Thancred</span></span> found <span class=\"highlight\">Forename</span>."},{"name":"THANCRED","text":"Ah, the memories. It seems like only yesterday that you slew your first primal. Speaking of which, I had the distinct impression that it was <span class=\"emphasis\">not</span> the first time that band of merry men and women had killed a god."},{"name":"YSHTOLA","text":"I labor to believe that a band of preternaturally gifted adventurers has been traveling the land, slaying primals without our knowledge. 'Twould imply gross negligence on our part."},{"name":"ALPHINAUD","text":"Speculation will avail us naught. There is far too much we do not know."},{"name":"ALPHINAUD","text":"For the present, we must needs concentrate on what we <span class=\"emphasis\">do</span> know, namely that Lord Ravana is no more. Vidofnir must be informed. The news may render her more receptive to Ser Aymeric's invitation."},{"name":"KRILE","text":"Since you seem to have affairs here well in hand, I shall take my leave. Simply being in the vicinity of this colony is giving me a stinking headache."},{"name":"KRILE","text":"If you have need of me, I shall be with Master Matoya. I would beg her assistance with the search for Minfilia."},{"name":"THANCRED","text":"Wait─Minfilia is <span class=\"emphasis\">missing</span>? I thought she escaped with <span class=\"highlight\">Forename</span>!"},{"name":"ALPHINAUD","text":"I shall explain on the road. Much has happened in your absence..."},{"name":"VIDOFNIR","text":"I had not thought to see thee again so soon, mortal. If thou seekest the knight, know that she hath long since departed for Ishgard."},{"name":"ALPHINAUD","text":"My thanks, Vidofnir, but it was not for her that we came. We bring good tidings for you and yours. Lord Ravana, who had been summoned by the Gnath, has again been laid low."},{"name":"VIDOFNIR","text":"Truly? Once more you mortals have succeeded where mine own kind did fail. You have our deepest thanks."},{"name":"ALPHINAUD","text":"Would that we could take credit. The god fell by another's hand."},{"name":"VIDOFNIR","text":"Another? Revelation upon revelation. Regardless, it is cause for celebration. The Gnath will have no choice but to withdraw."},{"name":"VIDOFNIR","text":"But to another matter. I have tidings for thee as well."},{"name":"ALPHINAUD","text":"Regarding the Ishgardians' invitation?"},{"name":"VIDOFNIR","text":"As promised, I brought the matter to my sire. Hearken to his answer now."},{"name":"VIDOFNIR","text":"“For a thousand years have I mourned my beloved, who gave her life to forge a peace thy king betrayed. Such was my lot, until a child of Ishgard came unto me."},{"name":"VIDOFNIR","text":"“For want of warmth, she wrapped herself in a dream. Yet the world will remember her deeds. For truth, she fought. For justice, she sinned. For redemption, she sacrificed, and became as light."},{"name":"VIDOFNIR","text":"“To follow one's heart, to have faith in one's convictions─be it for weal, or be it for woe. Such is the folly and the glory of man...and of dragon.”"},{"name":"VIDOFNIR","text":"He hath entrusted the choice to us, and we have made it. We will keep faith with you who walk in the Light."},{"name":"ALPHINAUD","text":"Then you accept Ser Aymeric's invitation?"},{"name":"VIDOFNIR","text":"Let it be known that I, Vidofnir, shall journey unto Ishgard on behalf of my people."},{"name":"ALPHINAUD","text":"We are honored to receive your answer, and will convey your words to our allies without delay."},{"name":"ALPHINAUD","text":"It is happening, Ysayle. Would that you were here to see it..."},{"name":"TATARU","text":"We can celebrate Thancred's return later. You and Alphinaud are needed at the Congregation!"},{"name":"YSHTOLA","text":"Fortunately, the journey afforded us ample time to brief Thancred on recent events."},{"name":"THANCRED","text":"So you slew a handful of primals, chatted with the Emperor of Garlemald, uncovered the truth behind a thousand-year war, thwarted a megalomaniacal archbishop's ambitions, and then rode home on the back of the Father of Dragons. Does that about sum it up?"},{"name":"HILDA","text":"Oh good, you're back. Things got a bit heated while you were away."},{"name":"VIDOFNIR","text":"When Ysayle first brought thee before me, I knew in my heart of hearts that this day would come."},{"name":"LUCIA","text":"One thing at a time, one thing at─<br>Forgive me, <span class=\"highlight\">Forename</span>, I will attend you shortly."},{"name":"HANDELOUP","text":"This is a dark day for the Temple Knights. But I have faith that we shall overcome this trial."},{"name":"GIBRILLONT","text":"The city's gone mad, <span class=\"highlight\">Forename</span>. Steer clear of the Brume if you don't want to get burned."},{"name":"ALPHINAUD","text":"Right. Let us not keep Ser Aymeric waiting."},{"name":"ALPHINAUD","text":"...Are you quite well, Thancred?"},{"name":"THANCRED","text":"Yes─yes, quite well. Forgive me. You have given me rather a lot to digest. This whole affair with the Ishgardians and the Dravanians...and our friends nowhere to be found."},{"name":"THANCRED","text":"'Twould seem there is no end to our troubles."},{"name":"YSHTOLA","text":"We can but face them head-on, one at a time. For now, we must apply ourselves to our allotted tasks and leave the others to theirs."},{"name":"YSHTOLA","text":"Remember, Thancred─we found you, as they found me. In time, we will find Yda and Papalymo and Minfilia as well."},{"name":"YSHTOLA","text":"These troubles will soon be but a memory─one which we will look back on together."},{"name":"THANCRED","text":"Pray do not misunderstand─I did not mean to imply that it would be otherwise. I merely wish that I had rejoined our grand adventure at one of its more triumphal moments. Despite your recent accomplishments, the mood here is less than celebratory."},{"name":"THANCRED","text":"But I have no doubt that we will enjoy many more glorious victories soon enough─and you may rest assured that I will play my part in them to the very hilt."},{"name":"ALPHINAUD","text":"I know you will. So then─to the Congregation!"},{"name":"LUCIA","text":"You have returned! In this at least the fates are kind."},{"name":"ALPHINAUD","text":"Greetings, First Commander! It pleases me to inform you that Vidofnir has accepted Ser Aymeric's invitation."},{"name":"LUCIA","text":"She has!? These are glad tidings indeed..."},{"name":"LUCIA","text":"Would that the lord commander were here to hear them."},{"name":"ALPHINAUD","text":"Ah. Is he otherwise engaged?"},{"name":"HILDA","text":"Aye─sleepin' off a knife to the gut."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">What</span>? What happened!? Will he live?"},{"name":"LUCIA","text":"The chirurgeons tell me he will make a full recovery. But had Lord Edmont and Lord Artoirel not been on hand when the assassin struck, he would not have been so fortunate. For a mercy, they subdued the fiend before he could land the telling blow."},{"name":"HILDA","text":"The attack was just the beginnin', though. Not long after, buildings all 'round the city─includin' several of ours─burst into flame."},{"name":"HILDA","text":"Bastards caught us completely by surprise. We've been dowsin' the fires, but for every one we put out, it seems like two more start up. Casualties are mountin'─especially in the Brume."},{"name":"LUCIA","text":"'Tis plain these fires were started by the assassin's conspirators. Until they have been rounded up, there will be no end to this. Will you help us find them?"},{"name":"LUCIA","text":"Then let us be about it."}],"reward":{"gil":974,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67696]},"next":[67698]},"partials":[{"type":"npc","id":"1016000","obj":{"i":1016000,"n":"Alphinaud","l":2000,"q":2}},{"type":"npc","id":"1016008","obj":{"i":1016008,"n":"Lucia","l":2300,"q":5}},{"type":"npc","id":"1011192","obj":{"i":1011192,"n":"Gibrillont","l":2300,"q":10,"t":"Forgotten Knight Proprietor"}},{"type":"npc","id":"1011935","obj":{"i":1011935,"n":"Vidofnir","l":2000,"q":10}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1012326","obj":{"i":1012326,"n":"Tataru","l":2300,"q":3}},{"type":"npc","id":"1012401","obj":{"i":1012401,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1012402","obj":{"i":1012402,"n":"Y'shtola","l":2300,"q":2}},{"type":"npc","id":"1016001","obj":{"i":1016001,"n":"Y'shtola","l":2000,"q":2}},{"type":"npc","id":"1016002","obj":{"i":1016002,"n":"Thancred","l":2000,"q":2}},{"type":"npc","id":"1016003","obj":{"i":1016003,"n":"Krile","l":2000,"q":2}},{"type":"npc","id":"1016007","obj":{"i":1016007,"n":"Thancred","l":2300,"q":1}},{"type":"npc","id":"1016009","obj":{"i":1016009,"n":"Hilda","l":2300,"q":3}},{"type":"quest","id":"67696","obj":{"i":67696,"n":"A Little Slow, a Little Late","g":4,"l":"The Dravanian Forelands","s":5}},{"type":"quest","id":"67698","obj":{"i":67698,"n":"Against the Dying of the Light","g":4,"l":"Ishgard","s":7}}]}