{"quest":{"name":"Breaking the Cycle","location":"Ishgard","id":67693,"patch":3.1,"sort":2,"eventIcon":71201,"issuer":1015979,"target":1015983,"involved":[1011935,1015978,1015980,1015981,1015982],"genre":4,"journal":["Alphinaud is ready to escort Lucia to Anyx Trine.","Alphinaud explains to Lucia that the first leg of your journey will take you from Falcon's Nest to Tailfeather, where you may stop to rest and replenish supplies. Set forth without further ado.","It is said that war makes soldiers of us all─but what peace makes of soldiers is less clear. Though Lucia understands the importance of her mission, it is plain that the thought of treating with the brothers and sisters of her enemies still sits ill with her. Alphinaud too has struggled to reconcile his preconceptions in the past, particularly in relation to Ysayle, whom he once viewed as a murderous fanatic, but later came to see as a noble, if misguided, soul. Perhaps, one day, others will share his opinion...","Vidofnir greets Lucia rather coolly, but agrees to hear Ser Aymeric's proposal nonetheless. She duly listens as the knight speaks of the Ishgardians' ancient sin, and of the dream that Ysayle held dear, which Ser Aymeric hopes may yet be made reality. Though the dragon's subsequent response is disappointingly noncommittal, you sense that, in her heart of hearts, she harbors the same hope.","While it remains to be seen if your diplomatic efforts will bear fruit, your companions agree that the meeting went as well as could be expected, given the circumstances. Your business in Anyx Trine thus concluded, you bid farewell to Lucia so that you may continue west to Sharlayan and join Y'shtola in welcoming the visiting scholar."],"objectives":["Rendezvous with Lucia outside Tailfeather."," Speak with Vidofnir in Anyx Trine.","Speak with Alphinaud."],"dialogue":[{"name":"LUCIA","text":"If you and Master Alphinaud would be so kind as to lead the way..."},{"name":"ALPHINAUD","text":"The path is long but known to us. From Falcon's Nest, we shall cross the western highlands and make for Tailfeather in the Dravanian forelands."},{"name":"ALPHINAUD","text":"There we can stop to rest and replenish our supplies. Questions? If not, then the stables await."},{"name":"ALPHINAUD","text":"Strange... This is only my third visit to Tailfeather, yet the first feels as though it were a lifetime ago."},{"name":"LUCIA","text":"I always imagined that the first time I set foot upon Dravanian soil would be at the head of an army. And here I am, ready to treat with the brothers and sisters of mine enemies."},{"name":"ALPHINAUD","text":"Full well do I know how difficult it can be to set aside the past. Though it was I who first proposed recruiting Ysayle to our cause, I questioned the wisdom of my words almost as soon as I had uttered them...and for a long time after that."},{"name":"ALPHINAUD","text":"Here was a woman with the blood of innocents on her hands. Men, women, children─all slain in the name of the implacable Lady Iceheart."},{"name":"ALPHINAUD","text":"Yet she acknowledged her misdeeds and agreed to join us in common cause. At our side, she fought in service to that greater good...even unto her dying breath─and while that does not absolve her of her sins, I...I hope that one day she will be remembered not merely as a heretic, but as a misguided soul who dreamt of peace."},{"name":"LUCIA","text":"...You ask much, Master Alphinaud. Yet who can say what might come to pass...should our negotiations bear fruit."},{"name":"ALPHINAUD","text":"Yes─yes, of course. We must press on to Anyx Trine. If you will follow me..."},{"name":"VIDOFNIR","text":"Thou art ever welcome here, friend of Ysayle."},{"name":"VIDOFNIR","text":"But this one I do not know."},{"name":"ALPHINAUD","text":"Pray forgive us this unannounced visit, Vidofnir. May I present to you Lucia, first commander of the Temple Knights of Ishgard─and our trusted friend."},{"name":"LUCIA","text":"It is an honor to meet you, Vidofnir. I am come as an envoy of Ser Aymeric, lord commander of the Temple Knights and acting leader of the Holy See."},{"name":"VIDOFNIR","text":"Indeed. You may speak, knight."},{"name":"LUCIA","text":"For one thousand years, man and dragon have been locked in an endless cycle of bloodshed and sorrow."},{"name":"LUCIA","text":"To our shame, we long believed your kin to be the architects of this war. But now we know the truth: that King Thordan and his knights twelve did willfully betray and murder the great wyrm Ratatoskr, shattering the peace between our peoples."},{"name":"LUCIA","text":"For one thousand years, our leaders conspired to conceal this truth─a truth which was at last laid bare by the Warrior of Light, the Azure Dragoon...and Ysayle."},{"name":"LUCIA","text":"Alas, a deception so intricately wrought cannot be undone in a moment, and our people labor to accept the truth. After an eternity of war, who would dare to dream that peace could at last be within our grasp?"},{"name":"LUCIA","text":"Yet dream we must, as Ysayle once did. And we must make that dream a reality, as she could not."},{"name":"LUCIA","text":"We humbly beseech you, Vidofnir: join hands with us in friendship once more, before the eyes of my people, in Ishgard."},{"name":"VIDOFNIR","text":"...A most unexpected invitation."},{"name":"VIDOFNIR","text":"I have heard your request, knight. However, I cannot yet give you mine answer."},{"name":"LUCIA","text":"May I ask why?"},{"name":"VIDOFNIR","text":"This matter concerneth my sire. He must needs be consulted."},{"name":"VIDOFNIR","text":"Moreover, the Gnath grow bold, even as they did before, and I would not leave my people at the mercy of the swarm."},{"name":"LUCIA","text":"Then we will wait. After a thousand years at war, we shall not give up on peace for want of patience."},{"name":"VIDOFNIR","text":"Ha! Fear not, knight: thou shalt have mine answer within thy lifetime."},{"name":"LUCIA","text":"So soon? My humble thanks. I shall bear your words to my lord forthwith. Until we meet again."},{"name":"LUCIA","text":"To face such a creature in battle is one thing, to converse with it quite another..."},{"name":"ALPHINAUD","text":"Given the circumstances, I would say that went rather well."},{"name":"LUCIA","text":"To be frank, I am surprised our proposal was not rejected outright. Whether aught will come of it remains to be seen, however..."},{"name":"LUCIA","text":"Mayhap I should take this opportunity to speak with some of the other dragons...<br>Ah, but you need not wait for me. The return journey holds no fears for me now."},{"name":"ALPHINAUD","text":"Well, if you have no further need of our services, we shall continue on to Sharlayan. We hope to welcome a scholar who has agreed to aid us in the search for our missing comrades."},{"name":"LUCIA","text":"Then I pray your journey is as swift and uneventful as ours was, and thank you again for sparing the time to assist us, even when such grave matters remain unresolved."},{"name":"ALPHINAUD","text":"I can think of no graver matter than a thousand-year war─one which our friends gave their lives to see ended."},{"name":"ALPHINAUD","text":"Suffice it to say, I would willingly make a thousand such journeys to ensure that their sacrifice was not in vain."},{"name":"LUCIA","text":"Of that I have no doubt, Master Alphinaud. I only hope the fates will not hold you to your word."},{"name":"VIDOFNIR","text":"Never did I think to see a knight of Ishgard come unto Anyx Trine bearing words instead of steel..."},{"name":"VIDOFNIR","text":"Would that the Gnath could show the same restraint. Too many children have fallen to their spears and muskets."}],"reward":{"gil":1066,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67692]},"next":[67694]},"partials":[{"type":"npc","id":"1015979","obj":{"i":1015979,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1015983","obj":{"i":1015983,"n":"Alphinaud","l":2000,"q":3}},{"type":"npc","id":"1011935","obj":{"i":1011935,"n":"Vidofnir","l":2000,"q":10}},{"type":"npc","id":"1015978","obj":{"i":1015978,"n":"Lucia","l":2300,"q":4}},{"type":"npc","id":"1015980","obj":{"i":1015980,"n":"Lucia","l":2000,"q":1}},{"type":"npc","id":"1015981","obj":{"i":1015981,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1015982","obj":{"i":1015982,"n":"Lucia","l":2000,"q":1}},{"type":"quest","id":"67692","obj":{"i":67692,"n":"An Uncertain Future","g":4,"l":"Fortemps Manor","s":1}},{"type":"quest","id":"67694","obj":{"i":67694,"n":"Another Time, Another Place","g":4,"l":"The Dravanian Forelands","s":3}}]}