{"quest":{"name":"An Uncertain Future","location":"Fortemps Manor","id":67692,"patch":3.1,"sort":1,"icon":100508,"eventIcon":71201,"issuer":1012857,"target":1015978,"involved":[1011223,1012163,1012251,1012252,1012253,1012326,1013128,1015979],"genre":4,"journal":["Alphinaud wishes to share the latest developments in the search for the missing Scions.","Although there has been progress in the search for F'lhaminn, Yda, and Papalymo, the hunt for Minfilia and Thancred remains at a standstill. Fortunately, it would seem that one of the surviving Students of Baldesion is coming to aid you in your efforts. As much as he would like to stay and greet the Sharlayan scholar, Alphinaud─and you─have been summoned for a private audience with Ser Aymeric to discuss an undisclosed matter. Attend the lord commander at the Congregation of Our Knights Most Heavenly forthwith.","Despite Ser Aymeric's decision to disclose the circumstances surrounding his father's disappearance, there is growing unrest in the city of Ishgard. Some dispute the lord commander's version of events, while many who do accept the truth question the measures taken to stop the archbishop. Still others have turned their ire on the clergy whom they claim were complicit in Thordan's deception. Desperate to secure a lasting peace, Ser Aymeric bids you escort Lucia to Anyx Trine, that she might treat with Vidofnir and thereby reestablish diplomatic relations with Hraesvelgr's brood.","Lucia admits to knowing little of Anyx Trine or its surrounding lands, and thanks you for agreeing to serve as her escort. As it may be some time before you return to the capital, Alphinaud thinks it best to notify Tataru of your plans prior to departing.","Tataru is heartened to learn of your diplomatic mission, and readily concedes that it should take precedence over receiving the Sharlayan scholar. Even so, she encourages you to join the welcoming party in Idyllshire should time permit, as the Sharlayan scholar in question is not just <span class=\"emphasis\">anyone</span>... Before she can elaborate, however, Alphinaud loudly declares that you must return to the Congregation at once. Apparently, the first commander has been kept waiting long enough.","Lucia has finished her preparations and is eager to depart. With luck, this will be a momentous journey..."],"objectives":["Speak with Aymeric at the Congregation of Our Knights Most Heavenly.","Speak with Lucia.","Speak with Tataru.","Speak with Lucia."],"dialogue":[{"name":"ALPHINAUD","text":"Fortuitous timing as always, <span class=\"highlight\">Forename</span>. Tataru was about to brief me on the search for our missing comrades."},{"name":"ALPHINAUD","text":"If you would be so kind, then?"},{"name":"TATARU","text":"Absolutely! You'll be pleased to hear that Riol and his men have been making excellent progress!"},{"name":"TATARU","text":"You remember how F'lhaminn helped me to escape the Crystal Braves in Limsa Lominsa, only to then disappear? <span class=\"emphasis\">Well</span>, according to Riol, she crept aboard a ship bound for Radz–at–Han, where she's been hiding ever since. He assures me that it won't be long before we're reunited."},{"name":"TATARU","text":"As for Yda and Papalymo, the remains of their linkpearls have been found─and in <span class=\"emphasis\">Pearl Lane</span> of all places. Riol thinks they must have disposed of them after escaping from the Royal Promenade."},{"name":"ALPHINAUD","text":"Yes, that would make sense... They could not risk being eavesdropped upon by our betrayers."},{"name":"TATARU","text":"We're all but certain they fled the city shortly after...though we still don't have a clue where they went."},{"name":"ALPHINAUD","text":"I see. And what of Thancred and Minfilia?"},{"name":"TATARU","text":"...I'm afraid I have nothing new to share about those two. But it's not all doom and gloom! The good news is, we've enlisted the services of a Sharlayan scholar─one of the Students of Baldesion─to aid in the search, who should be arriving any day now!"},{"name":"ALPHINAUD","text":"One of the Students, you say? I should very much like to meet this scholar─if time permits."},{"name":"ALPHINAUD","text":"But first we must attend to a more pressing matter. Ser Aymeric has summoned the two of us for a private audience. The messenger did not specify what he wished to discuss─only that it was urgent."},{"name":"ALPHINAUD","text":"Assuming you have no objections, <span class=\"highlight\">Forename</span>, I suggest we proceed to the Congregation forthwith."},{"name":"ALPHINAUD","text":"And mayhap we can meet with the scholar afterwards. Agreed?"},{"name":"TATARU","text":"In that case, I think I'll return to the Forgotten Knight for now. Things are liable to fall apart if I'm gone too long, you know!"},{"name":"TATARU","text":"Don't worry about our visitor. Y'shtola and I will treat her to a warm welcome!"},{"name":"ALPHINAUD","text":"Good invariably triumphs over evil in faerie tales, yet they are conspicuously reticent about what follows..."},{"name":"TEMPLEKIGHTGATE","text":"The lord commander is within. Pray proceed, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"SCENE00010","text":"Proceed to the Seat of the Lord Commander?"},{"name":"SCENE00010","text":"Yes"},{"name":"SCENE00010","text":"No"},{"name":"ALPHINAUD","text":"The journey, at least, should pose little difficulty this time."},{"name":"TATARU","text":"Be with you in a moment, <span class=\"highlight\">Forename</span>!"},{"name":"LUCIA","text":"I know little of the lands these dragons call home─this Anyx Trine. Had you not agreed to escort me, the coming journey would seem a far more daunting prospect."},{"name":"ALPHINAUD","text":"I confess, I myself once shuddered at the thought of it. Yet even the longest journey begins with the first step, does it not?<br>Ah, but ere we set forth, <span class=\"highlight\">Forename</span> and I must needs inform our comrade of our plans."},{"name":"LUCIA","text":"Very well. I shall see to my preparations."},{"name":"ALPHINAUD","text":"Then let us go and bid farewell to Tataru, <span class=\"highlight\">Forename</span>."},{"name":"HANDELOUP","text":"The first commander─and you─have been entrusted with a mission of grave import. For Ishgard's sake, it must not fail."},{"name":"HILDA","text":"Heard about the watch from the lord commander, did you? Aye, it's true. Feels queer to be operatin' so openly, but I couldn't say no after he batted them eyelashes of his."},{"name":"SYMME","text":"Hah, would you look at us! Honest-to-gods watchmen! Hey, how's this sound? “You there─move along!” Not bad, eh?"},{"name":"EUDESTAND","text":"You can hardly call us a proper watch when we ain't got no uniforms or trainin'. That'll all come with time, though, I hope."},{"name":"ALPHINAUD","text":"Hm? I thought you might want to tell her. Or would you rather I did all the talking...?"},{"name":"LUCIA","text":"Traversing the western highlands calls for warmer clothing. Yet there are only so many layers one can fit under plate armor..."},{"name":"TATARU","text":"So? What was your secret meeting all about? I'm all ears!"},{"name":"TATARU","text":"A diplomatic mission to Anyx Trine, you say? Well, I suppose that does take precedence..."},{"name":"TATARU","text":"But should your meeting with Vidofnir happen to end early, you might consider rendezvousing with Y'shtola in Idyllshire. She'll be there to receive our guest."},{"name":"TATARU","text":"Don't get me wrong, your meeting with the dragons is terribly important and everything, but this scholar just happens to be─"},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Time permitting</span>, as I said. We shall endeavor to join Y'shtola, but if we cannot, pray pass on our regards."},{"name":"ALPHINAUD","text":"Let us be off, <span class=\"highlight\">Forename</span>. We have kept the first commander waiting long enough."},{"name":"TATARU","text":"&lt;sigh&gt; Well, let no one say I didn't try!"},{"name":"ALPHINAUD","text":"One task at a time, <span class=\"highlight\">Forename</span>. Besides, I have no doubt that Y'shtola can look after the scholar by herself."},{"name":"LUCIA","text":"You are ready, then? Good─so am I."}],"reward":{"gil":745,"items":[{"id":12844,"one":1},{"id":12848,"one":1},{"id":12852,"one":1},{"id":12857,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67205]},"next":[67693]},"partials":[{"type":"npc","id":"1012857","obj":{"i":1012857,"n":"Alphinaud","l":2320,"q":4}},{"type":"npc","id":"1015978","obj":{"i":1015978,"n":"Lucia","l":2300,"q":4}},{"type":"npc","id":"1011223","obj":{"i":1011223,"n":"Temple Knight Guard","l":2300,"q":7}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1012251","obj":{"i":1012251,"n":"Hilda","l":2300,"q":11}},{"type":"npc","id":"1012252","obj":{"i":1012252,"n":"Symme","l":2300,"q":10}},{"type":"npc","id":"1012253","obj":{"i":1012253,"n":"Eudestand","l":2300,"q":10}},{"type":"npc","id":"1012326","obj":{"i":1012326,"n":"Tataru","l":2300,"q":3}},{"type":"npc","id":"1013128","obj":{"i":1013128,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1015979","obj":{"i":1015979,"n":"Alphinaud","l":2300,"q":2}},{"type":"item","id":"12844","obj":{"i":12844,"n":"Hot Chocolate","l":160,"c":24410,"t":46}},{"type":"item","id":"12848","obj":{"i":12848,"n":"Creme Brulee","l":160,"c":24075,"t":46}},{"type":"item","id":"12852","obj":{"i":12852,"n":"Almond Cream Croissant","l":160,"c":24013,"t":46}},{"type":"item","id":"12857","obj":{"i":12857,"n":"Urchin Loaf","l":160,"c":24318,"t":46}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"67693","obj":{"i":67693,"n":"Breaking the Cycle","g":4,"l":"Ishgard","s":2}}]}