{"quest":{"name":"Another Time, Another Place","location":"The Dravanian Forelands","id":67694,"patch":3.1,"sort":3,"icon":100509,"eventIcon":71201,"issuer":1015983,"target":1015992,"involved":[1012163,1012422,1012423,1015984,1015986,1015987,1015988,1015989],"genre":4,"journal":["Alphinaud is eager to set out for Sharlayan.","Alphinaud is curious to know how the Sharlayan scholar will help you to locate Minfilia and Thancred. Happily, all should be revealed soon enough.","After yet another remarkably uneventful journey, you rendezvous with Y'shtola, who informs you that the Sharlayan scholar arrived safely and is presently exploring the wilderness outside Idyllshire. She should be returning to Frontbridge at any moment─you need but wait there to meet her.","The scholar is revealed to be none other than Krile, a dear friend of Minfilia. But that is not all. To your surprise─and Alphinaud's chagrin─you learn that the woman also knew the Leveilleur twins during their time at the Studium. After sparing a moment to reminisce upon those halcyon days, she explains that she has a plan to locate Thancred. However, it will require the use of Master Matoya's Crystal Eye─a powerful relic that the hermit is not like to lend on a whim.","Upon assembling outside Matoya's Cave, you sense that Y'shtola and Alphinaud are nervous. Fortunately, Krile does not share their unease, being blissfully unaware of her proximity to the hermit's abode..."],"objectives":["Rendezvous with Y'shtola in Idyllshire.","Wait with Alphinaud and Y'shtola.","Speak with Krile outside Matoya's Cave."],"dialogue":[{"name":"LUCIA","text":"...Beg pardon? My favorite <span class=\"emphasis\">food</span>? Well...I am fond of omelettes. Dodo egg omelettes."},{"name":"ALPHINAUD","text":"So...it would seem we have time to greet this scholar after all. How delightful. I shall be interested to hear how she means to go about finding Minfilia and Thancred. I can only assume she is privy to some new investigative technique."},{"name":"ALPHINAUD","text":"In any event, our first order of business is to rendezvous with Y'shtola in Idyllshire."},{"name":"ALPHINAUD","text":"Another conspicuously uneventful journey... It would seem we are destined not to be late."},{"name":"YSHTOLA","text":"Ah, <span class=\"highlight\">Forename</span>─'tis good to see you. I confess, I had assumed your business in Anyx Trine would detain you longer. Did your meeting with Vidofnir go well?"},{"name":"ALPHINAUD","text":"As well as can be expected. She must discuss Ser Aymeric's proposal with Hraesvelgr, of course, but she seemed amenable to the suggestion."},{"name":"ALPHINAUD","text":"What of our Sharlayan guest? Has she arrived yet?"},{"name":"YSHTOLA","text":"She has, but when I explained that you would be joining us, she asked if she might use the intervening time to explore. I agreed to meet her outside on Frontbridge. We should be on our way."},{"name":"ALPHINAUD","text":"Wait, back in Ishgard...what was she trying to tell me...?"},{"name":"YSHTOLA","text":"It would seem we are early. Shall we wait?"},{"name":"HANDELOUP","text":"We received word from the first commander not long ago. Though I would have preferred a swifter resolution, I am relieved to hear that our invitation is receiving due consideration."},{"name":"ALPHINAUD","text":"She was less than flattering about my technique when last we met, but this time I have come prepared. Let her belittle my Obsidian Carbuncle if she dares!<br>...Do not tell her I said that."},{"name":"YSHTOLA","text":"The Crystal Eye is one of Master Matoya's most cherished relics. I doubt very much that she will grant us leave to lay hands upon it unless we can convince her that it is vital to our cause."},{"name":"KRILE","text":"You did say we were headed for a cave, did you not? Because I certainly don't see a cave nearby. Is Master Matoya meeting us on the way or something?"}],"reward":{"gil":824,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67693]},"next":[67695]},"partials":[{"type":"npc","id":"1015983","obj":{"i":1015983,"n":"Alphinaud","l":2000,"q":3}},{"type":"npc","id":"1015992","obj":{"i":1015992,"n":"Krile","l":2001,"q":2}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1012422","obj":{"i":1012422,"n":"Alphinaud","l":2001,"q":4}},{"type":"npc","id":"1012423","obj":{"i":1012423,"n":"Y'shtola","l":2001,"q":4}},{"type":"npc","id":"1015984","obj":{"i":1015984,"n":"Lucia","l":2000,"q":1}},{"type":"npc","id":"1015986","obj":{"i":1015986,"n":"Alphinaud","l":2082,"q":1}},{"type":"npc","id":"1015987","obj":{"i":1015987,"n":"Y'shtola","l":2082,"q":2}},{"type":"npc","id":"1015988","obj":{"i":1015988,"n":"Alphinaud","l":2082,"q":1}},{"type":"npc","id":"1015989","obj":{"i":1015989,"n":"Y'shtola","l":2082,"q":1}},{"type":"quest","id":"67693","obj":{"i":67693,"n":"Breaking the Cycle","g":4,"l":"Ishgard","s":2}},{"type":"quest","id":"67695","obj":{"i":67695,"n":"In the Eye of the Beholder","g":4,"l":"The Dravanian Hinterlands","s":4}}]}