{"quest":{"name":"In the Eye of the Beholder","location":"The Dravanian Hinterlands","id":67695,"patch":3.1,"sort":4,"icon":100510,"eventIcon":71201,"issuer":1015992,"involved":[1011916,1011917,1011922,1012138,1012405,1012406,1012422,1012423,1015993,1015994,1015995,1015996,1015997],"genre":4,"journal":["The prospect of meeting the famous Master Matoya seems to have set Krile thinking.","It would seem that Krile has heard a great many stories about Master Matoya─some less than flattering. Never one to offer empty words of comfort, Y'shtola states that all the rumors are true, before steering Krile into the hermit's abode. Follow and hope that the legendary scholar is in an agreeable mood.","While conversing with Matoya, Krile reveals not only that she possesses the Echo, but that she has availed herself of the blessing of Light's protection, finally solving the mystery of her preservation during the attack on the Isle of Val. She further explains that with the aid of Matoya's Crystal Eye, she can use her unique manifestation of the Echo to locate and trace the lingering aetheric essence of Thancred. Having taken a liking to the girl, Matoya consents to Krile's plan, which the young scholar wastes no time carrying out. In a trance, she declares that Thancred emerged from the Lifestream near the base of Sohm Al─a wilderness which the hunters of Tailfeather know only too well. Begin your search for the bard there.","To aid in questioning the locals, Alphinaud distributes several surprisingly accurate sketches of Thancred, which he apparently drew from memory─a skill he developed for reasons he claims to have forgotten, though Krile clearly has not. With sketch in hand, question the hunters of Tailfeather.","Several of the locals make mention of a heretofore unknown hunter, though none managed to get a clear look at the man's face. Less encouragingly, one states that the hunter wielded an axe, which is hardly Thancred's weapon of choice. Inform Krile that you have completed your inquiries.","Krile, too, has finished making inquiries, and is eager to hear what the others have learned. Accompany her to the rendezvous point east of Loth ast Vath and wait for Alphinaud and Y'shtola.","Like you, Alphinaud and Y'shtola both heard tell of a mysterious Hyuran hunter, whose build and fighting prowess seem reminiscent of Thancred. Krile, however, has a different tale to share─one of a Vath trader who came to Tailfeather in search of garments fit for a “man of refinement.” The account prompts Y'shtola to question why Thancred would send a Vath in his stead, in response to which Alphinaud loudly recalls how she was naked as her nameday when she returned from the Lifestream. Krile quickly interjects that your next course of action should be to question the Vath, sparing Alphinaud Y'shtola's scorn...for a time."],"objectives":["Enter Matoya's Cave.","Speak with Alphinaud outside Tailfeather.","Show Alphinaud's sketch to Marcechamp.","Show Alphinaud's sketch to Loupard.","Show Alphinaud's sketch to Grimold.","Speak with Krile.","Wait with Krile in the Smoldering Wastes."],"dialogue":[{"name":"ALPHINAUD","text":"Oh, who am I kidding─it will be fortunate if she does not mistake me for my sister again."},{"name":"YSHTOLA","text":"You know how she can be. If Krile does not meet with her approval, then that will be that."},{"name":"KRILE","text":"I have heard many stories of Master Matoya─some quite flattering, others less so."},{"name":"YSHTOLA","text":"Rest assured, they all are true. This way─and have care where you tread."},{"name":"MATOYA","text":"No one ever comes around for tea anymore. No, it's always saving this, preventing that, or mending the godsforsaken other. Anyone would think I wasn't good company."},{"name":"YSHTOLA","text":"Thancred may be a capable warrior, but he was wounded when last I saw him. If any beasts were nearby when he emerged from the Lifestream, he would have been hard-pressed to repel them."},{"name":"KRILE","text":"We had forests like these on the Isle of Val. My grandfather and I used to go for walks together when I could prise him away from his work."},{"name":"KRILE","text":"It was the least I could do for him, considering everything he has done for me. Taking me in when I was an orphan, raising me as his own and giving me a name─you didn't think my parents named me Krile Baldesion, did you?"},{"name":"ALPHINAUD","text":"Were I to find myself in an unfamiliar wilderness, my first instinct would be to seek out signs of civilization."},{"name":"YSHTOLA","text":"Ordinarily, perhaps, but in his wounded state, he may not have wished to risk contact with strangers of unknown allegiance. Yet even had Thancred chosen to remain in the forest, the hunters would surely have stumbled across his trail."},{"name":"KRILE","text":"Tailfeather doesn't strike me as an isolated outpost, though. Merchants and traders pass through reasonably regularly, do they not? In which case, we'll need to provide a more detailed description when we question the locals."},{"name":"ALPHINAUD","text":"Fear not, Krile─I have already prepared several sketches of Thancred for that very purpose."},{"name":"YSHTOLA","text":"This...this is impressive. You drew him from memory?"},{"name":"ALPHINAUD","text":"A skill I acquired some years ago for reasons I no longer remember."},{"name":"ALPHINAUD","text":"I propose we split into two pairs. Y'shtola and I will inquire at the outlying encampments, while <span class=\"highlight\">Forename</span> and Krile question the residents of Tailfeather. Afterwards, we shall regroup near Loth ast Vath and share our findings."},{"name":"ALPHINAUD","text":"Assuming there are no objections, let us be about it."},{"name":"KRILE","text":"My, he certainly has matured, hasn't he? Hard to imagine he was once a boy who practiced drawing for hours to impress young ladies..."},{"name":"KRILE","text":"Anyway, we had best get started. Find me when you've finished making your rounds."},{"name":"KRILE","text":"Pray excuse me, but have you seen this man before?"},{"name":"MARCECHAMP","text":"What's that you've got there? A sketch?"},{"name":"MARCECHAMP","text":"Hmm... Can't say I know the face. You say he's somethin' of a warrior?"},{"name":"MARCECHAMP","text":"Hmm...I heard a tale the other day about a Hyuran vagabond who brought down a bandersnatch by himself─an' with <span class=\"emphasis\">style</span>. Way they tell it, he was dancin' with the beast like it was the belle of the bleedin' ball. Sound like your man?"},{"name":"MARCECHAMP","text":"If this friend of yours is as skilled as you say, then he's sure to have found a way to survive."},{"name":"MARCECHAMP","text":"Still, if he's out there on his own, it's only a matter of time before he runs afoul of somethin' he can't handle."},{"name":"LOUPARD","text":"Searchin' for a friend of yours? Let's have a look then."},{"name":"LOUPARD","text":"Hmm...no, ain't seen him around. Sorry."},{"name":"LOUPARD","text":"Nobody here but us and the chocobos, friend. Maybe someone else knows your man."},{"name":"GRIMOLD","text":"A Hyuran man? We're not exactly rare, you know. Could you be more specific?"},{"name":"GRIMOLD","text":"...I did spy this one bloke a while back. Didn't get a good look at his face, but it could have been him."},{"name":"GRIMOLD","text":"This was beyond the forest, as I recall─along the river, to the west of Tailfeather. I remember thinking he wasn't much of a hunter. The lad was making no effort to cover his tracks, see. That, and he was carrying an axe instead of a bow."},{"name":"GRIMOLD","text":"If he was hunting chocobos, he was doing a piss-poor job of it. The birds would've smelled him coming a malm away─I know I did."},{"name":"KRILE","text":"Finished? In that case, I think we've learned everything we can here."},{"name":"KRILE","text":"Let's see what the others have found out."},{"name":"ALPHINAUD","text":"I believe we are on the right track. Many of the hunters claim to have seen a strange man who could have been Thancred."},{"name":"YSHTOLA","text":"'Tis little wonder so many here have taken up hunting. The forest is teeming with wildlife."},{"name":"KRILE","text":"We were to meet here, were we not?"},{"name":"ALPHINAUD","text":"My apologies for our late arrival. We thought it wise to question as many hunters as we could."},{"name":"YSHTOLA","text":"Many have made camp in inaccessible locations─ideal for hunting game, not so receiving visitors."},{"name":"ALPHINAUD","text":"Nevertheless, our time proved well spent. There have been countless sightings of an exceptionally capable Hyuran hunter with whom no one is familiar."},{"name":"ALPHINAUD","text":"Though none chanced to see the man's face, his height and build match Thancred's description, as does his fighting prowess."},{"name":"ALPHINAUD","text":"...So you have heard the same tales. Be that as it may, we yet want for conclusive proof..."},{"name":"KRILE","text":"Mayhap this is unrelated, but I heard a curious tale regarding a Vath trader."},{"name":"KRILE","text":"He came to Tailfeather in search of garments fit for a “man of refinement”─which seemed a rather curious description for one of his kind."},{"name":"YSHTOLA","text":"...You are implying that Thancred sent a Vath to market in his stead? Why would he not go himself?"},{"name":"ALPHINAUD","text":"Well, if you recall, you yourself emerged from the Lifestream as naked as your nameday. It is a scene I shall never forget─"},{"name":"YSHTOLA","text":"<span class=\"emphasis\">Is it now</span>?"},{"name":"ALPHINAUD","text":"Well, I was pleased to see you! I-I mean─ It was a simple statement of fact!"},{"name":"ALPHINAUD","text":"It stands to reason that Thancred found himself in the same...predicament."},{"name":"KRILE","text":"In any case, if he had dealings with the Vath, they should be able to tell us, no?"},{"name":"ALPHINAUD","text":"Quite right, Krile, quite right..."}],"reward":{"gil":1019,"items":[{"num":3,"id":13637},{"num":3,"id":13638}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67694]},"next":[67696]},"partials":[{"type":"npc","id":"1015992","obj":{"i":1015992,"n":"Krile","l":2001,"q":2}},{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1011917","obj":{"i":1011917,"n":"Loupard","l":2000,"q":9}},{"type":"npc","id":"1011922","obj":{"i":1011922,"n":"Grimold","l":2000,"q":5}},{"type":"npc","id":"1012138","obj":{"i":1012138,"n":"Matoya","l":2036,"q":7}},{"type":"npc","id":"1012405","obj":{"i":1012405,"n":"Alphinaud","l":2000,"q":3}},{"type":"npc","id":"1012406","obj":{"i":1012406,"n":"Y'shtola","l":2000,"q":3}},{"type":"npc","id":"1012422","obj":{"i":1012422,"n":"Alphinaud","l":2001,"q":4}},{"type":"npc","id":"1012423","obj":{"i":1012423,"n":"Y'shtola","l":2001,"q":4}},{"type":"npc","id":"1015993","obj":{"i":1015993,"n":"Krile","l":2000,"q":1}},{"type":"npc","id":"1015994","obj":{"i":1015994,"n":"Krile","l":2000,"q":1}},{"type":"npc","id":"1015995","obj":{"i":1015995,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1015996","obj":{"i":1015996,"n":"Y'shtola","l":2000,"q":1}},{"type":"npc","id":"1015997","obj":{"i":1015997,"n":"Krile","l":2000,"q":2}},{"type":"item","id":"13637","obj":{"i":13637,"n":"Max-Potion","l":150,"c":20601,"t":44}},{"type":"item","id":"13638","obj":{"i":13638,"n":"Max-Ether","l":150,"c":20621,"t":44}},{"type":"quest","id":"67694","obj":{"i":67694,"n":"Another Time, Another Place","g":4,"l":"The Dravanian Forelands","s":3}},{"type":"quest","id":"67696","obj":{"i":67696,"n":"A Little Slow, a Little Late","g":4,"l":"The Dravanian Forelands","s":5}}]}