{"quest":{"name":"Nest Side Story","location":"The Sea of Clouds","id":67706,"patch":3.1,"sort":7,"icon":100507,"beast":6,"unlocksFunction":1,"eventIcon":71341,"issuer":1016087,"involved":[1012064,1012066,1016088,1016090,1016091,1016092],"genre":44,"journal":["Linu Vali is ready to face the Vundu, but first would ask one more favor of an old friend.<br>※The difficulty of this quest will be synced to your current level.","A party of Vundu has been spotted approaching Ok' Zundu, and Linu Vali steels herself to meet them on the field of battle. However, she asks that you present yourself before the Gundu totem pole and perform the /sundropdance before facing the Vundu. By doing so, the ancestors of the Gundu tribe will grant today's warriors the will to achieve victory.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You perform a thunderous display in front of the Gundu totem pole. The ancestors of the Gundu tribe have answered your entreaty, and granted the brave Vanu Vanu strength for the upcoming battle. Report the news of the ancestors' generosity to Linu Vali.","Linu Vali is emboldened by the news of her ancestors' blessing, and is ready to confront the Vundu forthwith. After thanking you for everything you have done for the Gundu, she states that today's battle should be left to the Vanu Vanu to settle, and asks that you go to Ok' Zundu to tell Sonu Vanu that the group's preparations are complete.","Sonu Vanu tells you the Zundu are ready as well, but has one last request of you. You are to stand watch over the battle, so that you may tell the tale of the Zundu and Gundu tribes' last stand should the Vundu emerge victorious. Go to the northeast, where the Vundu have been sighted, and wait for the Vanu Vanu to arrive.","You watch the fateful encounter from above the fields, and see the Vundu come face-to-face with the group of Gundu and Zundu, who respond to the Vundu chieftain's demands with a booming display of their sundrop dance. The Vundu seem unaffected, however, accepting the challenge with their own dance. Succumbing to the Vundu's ferocity, the Gundu and Zundu dancers lose the will to continue. Refusing to leave your allies to their fate, you descend from your position and show the Vundu your own sundrop dance. The Vundu are taken aback by your fury, and the Zundu and Gundu are inspired to match your steps. The renewed power of the sundrop dance strikes fear into the hearts of the Vundu, and they flee back to their village in defeat. With the Gundu and Zundu tribes victorious, they depart into the sunset to celebrate their newfound freedom."],"objectives":["Perform the /sundropdance before the Gundu totem pole.","Report to Linu Vali.","Speak with Sonu Vanu in Ok' Zundu.","Watch over the Vanu Vanu confrontation."],"dialogue":[{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, scouts spot Vundu marching towards Ok' Zundu! The time is come to stand against them!"},{"name":"LINUVALI","text":"But before we depart to confront the Vundu, Linu has one last request of <span class=\"highlight\">Forename</span>. Go to the Gundu totem pole and offer your <span class=\"highlight\">sundrop dance</span>."},{"name":"LINUVALI","text":"Gundu build totem pole to show reverence towards ancestors. If <span class=\"highlight\">Forename</span> offers <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> dance, they may grant us strength for the ordeal ahead. Go, and present your mightiest <span class=\"highlight\">sundrop dance</span>!"},{"name":"LINUVALI","text":"Go before the Gundu totem pole and perform the <span class=\"highlight\">sundrop dance</span>, so that our ancestors may grant us their blessing."},{"name":"SYSYTEM","text":"The earth quakes and the trees rustle before your sundrop dance. The Gundu ancestors look favorably on your display, and grant your allies strength."},{"name":"SYSYTEM","text":"Stand before the totem pole, and ask for the favor of the Gundu ancestors by performing the sundrop dance."},{"name":"LINUVALI","text":"Thank you, <span class=\"highlight\">Forename</span>. The Gundu ancestors see fit to grant us their blessing, and impart their bravery and ferocity. Like the morning sun rising boldly over mountaintops, we set out with confidence in our victory!"},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, Linu thanks you once again. Linu treasures all that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does for Ok' Gundu Nakki. "},{"name":"LINUVALI","text":"Alas, this struggle is between Vanu, and Vanu alone. There is no telling when it ends, or how violent it becomes. Linu insists too much on <span class=\"highlight\">Forename</span> already, and cannot ask <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to risk life and limb."},{"name":"LINUVALI","text":"Today, only Vanu will set foot on the field of battle. <span class=\"highlight\">Forename</span>, go to Ok' Zundu and tell Chief Sonu that our preparations are complete. Then, await there for our victorious return."},{"name":"LINUVALI","text":"Today's fight is between Vanu, and only Vanu. <span class=\"highlight\">Forename</span>, tell Chief Sonu that preparations are complete, and then await there for us to return victorious."},{"name":"LINUVANU","text":"Netherling, thank you for bestowing on us the blessing of our ancestors. Now it is Gundu's turn to protect our friends, our freedom, and our future!"},{"name":"RANUVALI","text":"Netherling's sundrop dance washes away fear from Ranu's heart. <span class=\"alternative-container\"><span class=\"alternative\">Hers</span><span class=\"alternative\">His</span></span> is the dance of heroes!"},{"name":"EENUVANU","text":"Netherling's courage impresses as always. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> dance reminds Eenu of great skyfish soaring confidently among the cloud sea. Eenu's heart stirs with fury, and he trembles in anticipation of the dance!"},{"name":"GINUVANU","text":"Never does Ginu imagine a netherling performs sundrop dance! <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> dance worthy to perform at Hall of the Fallen Plume! Ginu Vanu abhors violence, but Vundu run in fear at his dance!"},{"name":"SONUVANU","text":"Ah, so the Gundu stand ready. As do the Zundu. We are ready to face our fates."},{"name":"SONUVANU","text":"Netherling, often do we rely on your support, and Sonu would make one last request of you. Watch over our battle with the Vundu."},{"name":"SONUVANU","text":"If the Vundu stand unmoving against our dance, and we must resort to blades and talons, our tribes may not survive the day. If this happens, Sonu asks netherling to remember tale of our last stand. Pass it down so none forget our valor. This task, I entrust you with."},{"name":"SONUVANU","text":"And now, the time to depart is come. Sonu will leave with the rest of his tribe, to meet the Vundu to the northeast. Go there, netherling, and wait."},{"name":"SONUVANU","text":"Our fate awaits to the northeast. Go there, netherling. We will not be far behind."},{"name":"SANUVANU","text":"Today, Zundu's bravery shakes mountains and splits skies! The Vundu will run back to their village like paissa fleeing from hungry sanuwa!"},{"name":"LINUVALI","text":"Many thanks, <span class=\"highlight\">Forename</span>, for speaking to Chief Sonu. Now we depart, to face the Vundu."},{"name":"HONU","text":"Zundu dare to leave safety of village!? Surrender the Gundu rebels now, and perhaps Vundu only demand <span class=\"emphasis\">triple</span> tribute for next ten moons!"},{"name":"HONU","text":"Uunu Vanu's children are as foolish as him! Very well! Before sharing your father's fate, bask in the fury of true warriors!"},{"name":"LINUVALI","text":"Focus! Do not let the Vundu intimidate you! Dance as one!"},{"name":"HONU","text":"Heaven! Earth! Cower before us! Scatter to the winds!"},{"name":"LINUVALI","text":"Do not falter! Back into formation─ Dance!"},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>!? No, battle is between Vanu─"},{"name":"HONU","text":"Netherling! Today you answer for your affront to the White!"},{"name":"HONU","text":"Such might...from a netherling!?"},{"name":"LINUVALI","text":"Zundu! Gundu! Join with netherling, make <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength yours!"},{"name":"HONU","text":"They dance with one heart─as one sundrop! Impossible! R-Retreat!"},{"name":"HONU","text":"The White have mercy!"},{"name":"SONUVANU","text":"The sun shines down upon our victory today! Netherling, Gundu, and Zundu dance as one, and the Vundu flee before us!"},{"name":"LINUVANU","text":"Remember the sight of Chief Honu running in fear! Remember his frightened yelp, like hatchling crying for its mother!"},{"name":"SANUVANU","text":"Vundu bluster and bellow, but their courage wilts before our dance."},{"name":"LINUVALI","text":"Once again, <span class=\"highlight\">Forename</span>, our tribes owe you debt of gratitude deeper than cloud sea. Gundu welcome you always."},{"name":"LINUVALI","text":"From this day, Vundu think twice before threatening our tribes. Gundu are finally free to rebuild!"},{"name":"LINUVALI","text":"Now, the time for celebration is come! At Ok' Gundu Nakki, we feast!"},{"name":"SYSTEM","text":"As a symbol of Zundu's solidarity with the Gundu, the Zundu have sent a totem pole illustrating the Zundu's history. "},{"name":"SYSTEM","text":"Additionally, several Vanu Vanu have fled from the Vundu and taken up residence at Ok' Gundu Nakki."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Gundu."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon the completion of Vanu Vanu tribal daily quests."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Luna Vanu."}],"reward":{"gil":630},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":34}],"quests":[67705]},"next":[67761]},"partials":[{"type":"npc","id":"1016087","obj":{"i":1016087,"n":"Linu Vali","l":2100,"q":10}},{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1012066","obj":{"i":1012066,"n":"Sanu Vanu","l":2100,"q":8}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"npc","id":"1016090","obj":{"i":1016090,"n":"Eenu Vanu","l":2100,"q":3}},{"type":"npc","id":"1016091","obj":{"i":1016091,"n":"Ranu Vali","l":2100,"q":4}},{"type":"npc","id":"1016092","obj":{"i":1016092,"n":"Ginu Vanu","l":2100,"q":6}},{"type":"quest","id":"67705","obj":{"i":67705,"n":"Sundrop the Beat","g":44,"l":"The Sea of Clouds","s":6,"f":1}},{"type":"quest","id":"67761","obj":{"i":67761,"n":"The Nest of Honor","g":44,"l":"The Sea of Clouds","s":8,"f":1}}]}