{"quest":{"name":"Three Beaks to the Wind","location":"The Sea of Clouds","id":67700,"patch":3.1,"sort":1,"icon":100501,"beast":6,"unlocksFunction":1,"eventIcon":71341,"issuer":1012064,"target":1016087,"involved":[1012066,1016093,1016150,1016151,1016156,1016157,1016158],"genre":44,"journal":["Sonu Vanu is troubled by a storm gathering in the distance.<br>※The difficulty of this quest will be synced to your current level.","Sonu Vanu is grateful for your return to Ok' Zundu, for as if by heavenly coincidence, something is troubling him that only a courageous adventurer can help with. Zundu spies have reported unusual amounts of activity from Ok' Vundu Mok, in the heart of Vundu territory. The Zundu chief is anxious as to what this might mean for his tribe, but cannot risk the uneasy truce with the Vundu by sending his own spies. He asks that you make your way to Ok' Vundu Mok to ascertain what is causing the furor.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You gaze over Ok' Vundu Mok and are met with the sight of three Vanu─one wearing a crown of flowers─being chased by a group of Vundu. The three Vanu are cornered, and although they attempt to stand their ground, the Vundu war dance causes them to cower in fear. You stand fearless before the dance, however, and leap to the defense of the shivering Vanu.","You slay the Vundu warriors, and the three beleaguered Vanu are safe from harm. Speak with Linu Vali to hear their tale.","Linu Vali tells you of her troubled tribe, the Gundu, who were subjugated by the Vundu and now live in fear under their rule. Her tribe seeks freedom from the Vundu, but they will not allow it, threatening any opposition with violence and imprisonment. Linu Vali is surprised when you tell her of Sonu Vanu's request, and asks that you act as a mediator in helping the Gundu tell of their plight. Return to Ok' Zundu and inform Sonu Vanu of the occurrences at Ok' Vundu Mok.","You relate the story of your journey into Ok' Vundu to Sonu Vanu, and Linu Vali offers her greetings and gratitude to the chieftain. Taking the story of the Gundu's plight to heart, Sonu Vanu grants the refugees an island to use as a safe haven, despite his attendant's protestations. Linu Vali is ecstatic at this present, promising that the Gundu will be self-sufficient, and work to make a new settlement free from Vundu influence. Go to Nakki Island, to the west of Ok' Zundu, and speak with Linu Vali to listen to her plan for building her tribe's home.","Linu Vali seems eager to begin developing the island, but needs your help dealing with some airborne pests. She asks that you rid the surrounding trees of the midge clouds, which conveniently lack the taste for netherling blood. Speak with Luna Vanu to mount a sanuwa and use its powerful buffet to drive the midges from the trees. ","The midges will no longer trouble the poor Vanu, and the island has become noticeably quieter. Report your success to Linu Vali and see if there is aught more that she requires.","Linu Vali appreciates your efforts to rid Nakki Island of its pests, although it seems she may require your aid in the future. She admits to you that she lacks the courage to continue on leading the Gundu towards a new life, expressing doubt in her ability to carry on without her brother and the others that were captured by the Vundu. She asks for your help in building up the Gundu's new home. Your agreement encourages her, and she dubs the new village “Ok' Gundu Nakki.” Eager to get started on construction, she asks you to speak with Muna Vanu to learn what tasks are required of you. Lend your aid to the refugee Vanu Vanu and help them build a new home."],"objectives":["Survey Ok' Vundu Mok.","Slay the Vundu warriors.","Speak with Linu Vali.","Report to Sonu Vanu at Ok' Zundu.","Speak with Linu Vali.","Ride the sanuwa and Buffet the midge clouds from the trees.","Report to Linu Vali."],"dialogue":[{"name":"SONUVANU","text":"Like nourishing rains after long summer drought, netherling's return may bring succor in our time of need. "},{"name":"SONUVANU","text":"Zundu spies send word of activity in Ok' Vundu Mok, deep within Vundu territory. Such news bodes ill for Ok' Zundu. "},{"name":"SONUVANU","text":"We would know more of this coming storm, but spies struggle to slip past watchful gazes of Vundu guards."},{"name":"SONUVANU","text":"Netherling's strength and courage is always reliable, and Sonu asks <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to brave enemy territory and bring news of what stirs in Ok' Vundu Mok."},{"name":"SONUVANU","text":"Once again netherling proves <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is stout ally of the Zundu. Zephyr winds at your back speed your way!"},{"name":"SONUVANU","text":"Ok' Vundu Mok floats far above Ok' Zundu. Without wings like sanuwa to soar through skies, netherling cannot even reach their gates."},{"name":"ZOUHYOUBANU02164","text":"There is nowhere to run! Traitorous Gundu, punishment is nigh!"},{"name":"LINUVALI","text":"(-Petal-crowned Vanu-)Traitorous!? We but seek freedom from cruelty of Vundu!"},{"name":"ZOUHYOUBANU02164","text":"Nonsense! Like sanuwa, Gundu live only to serve almighty Vundu!"},{"name":"LINUVALI","text":"(-Petal-crowned Vanu-)No more! Gundu cast off Vundu reins! Gundu are free! <span class=\"emphasis\">Gundu are free</span>!"},{"name":"MUNAVANU","text":"(-Elderly Vanu-)Stand back, Linu Vali! Muna Vanu teaches Vundu difference between Gundu and sanuwa!"},{"name":"ZOUHYOUBANU02164","text":"Foolish greybeak! Even clumsy paissa laughs at your challenge as he tumbles into cloud sea! Such weaklings are not worthy foes. Cower before us!"},{"name":"MUNAVANU","text":"Such...such power! Fear cuts deeper than boreal winds!"},{"name":"ZOUHYOUBANU02164","text":"A netherling─and one unmoved by our sundrop dance!?"},{"name":"ZOUHYOUBANU02164","text":"What insolence! Cast netherling into cloud sea!"},{"name":"BALLOON","text":"Die, netherling!"},{"name":"LINUVALI","text":"Linu cannot move..."},{"name":"MUNAVANU","text":"Netherling protect us!"},{"name":"MUNAVANU","text":"Muna Vanu's gratitude is boundless as cloud sea. Thank you, netherling."},{"name":"LINUVALI","text":"Even most violent gale could not topple you. To stand as totem against Vundu sundrop dance..."},{"name":"LINUVALI","text":"Sundrop dance is ancient tradition of Vanu Vanu. It is display of strength and vigor, both individual and tribe. Vanu custom is to dance before battle, that enemies weak of will may yield, preventing needless bloodshed."},{"name":"LINUVALI","text":"...Forgive my rudeness. I, Linu Vali of the Gundu tribe, am grateful for zephyr winds that bring netherling to our side to stand against the Vundu."},{"name":"LINUVALI","text":"Vundu invade Gundu lands and curse our totems, but Gundu spirit will not break! All still oppose the Vundu's many misdeeds!"},{"name":"LINUVALI","text":"Summoning the White, conquering other tribes, attacking netherlings─all are affronts!"},{"name":"LINUVALI","text":"We seek freedom from Vundu rule. But Vundu are greedy as they are cruel, and answer our pleas with violence."},{"name":"LINUVALI","text":"Vundu talons reach far and cut deep. Many flee to distant isles to escape their wrath...yet netherling ventures deep into the Vundu homeland. Why?"},{"name":"LINUVALI","text":"Netherling is come from Ok' Zundu? Sonu Vanu himself asks netherling to investigate?"},{"name":"LINUVALI","text":"We hear naught of Zundu after Vundu invade our lands. That they are yet free...<br>Netherling, Linu Vali humbly requests that you escort us to Sonu Vanu, that we might beseech the Zundu for aid. "},{"name":"LINUVALI","text":"Tribe will remember netherling's kindness for many moons to come! Now, let us depart to Ok' Zundu before the Vundu return."},{"name":"SONUVANU","text":"So rumblings in Ok' Vundu not sign of impending storm, but Gundu uprising."},{"name":"SONUVANU","text":"And now the Gundu seek protection from their pursuers..."},{"name":"LINUVALI","text":"May zephyr winds forever guide you, Chief Sonu. I, Linu Vali, daughter of Uunu Vanu, do greet you warmly."},{"name":"LINUVALI","text":"My companions are Muna Vanu, former attendant to my father, and Luna Vanu, merchant of our village."},{"name":"SONUVANU","text":"Your father and I spend many hours cloudfishing. When news of his death at Vundu claws reaches Ok' Zundu...the fiercest monsoon cannot wash away my sorrow."},{"name":"LINUVALI","text":"Forgive us our imposition, Chief Sonu, but the Gundu suffer too long under the Vundu─better to run than to remain slaves. But Vundu are relentless, and we face terrible reprisals, if not for this netherling."},{"name":"SONUVANU","text":"There is no need to apologize. Zundu welcome you with open arms. Tell me, how fares your brother?"},{"name":"LINUVALI","text":"Alas, when Linu Vanu calls for Gundu independence, Vundu imprison him in skycage and hang from island, as example to others. We attempt to free him but fail, and Vundu pursue us until we meet netherling."},{"name":"SONUVANU","text":"It saddens Sonu to learn this. But we are nevertheless grateful that you arrive safely to Ok' Zundu. You and yours are welcome to rest at Nakki Island for as long as you like."},{"name":"LINUVALI","text":"Sonu Vanu, your kindness is boundless as cloud sea!"},{"name":"SANUVANU","text":"Chief Sonu, pray do not act in haste! What will others say when they learn of this arrangement?"},{"name":"SANUVANU","text":"Islands more precious than rain during summer drought. Some still resent netherlings for risking island to hunt the White."},{"name":"SONUVANU","text":"Now is not the time to turn our backs on another tribe. We must do all in our power to help─for the sake of Chief Uunu and his people."},{"name":"SANUVANU","text":"Have we food to feed them? Wood to build them homes? How much must the Zundu sacrifice for these refugees?"},{"name":"LINUVALI","text":"The island is more than enough. Like seedling which takes root in rich soil and grows strong, so too will new Gundu settlement flourish on this great gift from the Zundu."},{"name":"SONUVANU","text":"Such a sight would surely fill Chief Uunu with pride. Nakki Island lies to the west of Ok' Zundu. Go forth and build a new home for your people!"},{"name":"SONUVANU","text":"The Gundu will need much assistance in the days ahead. Sonu prays you lend them a helping hand."},{"name":"SANUVANU","text":"Chief Sonu is too generous by half. It will fall to Sanu to quell the anger of our fellow tribesmen."},{"name":"LINUVALI","text":"Linu Vali's fortune is great indeed, to meet netherling who defeats the White."},{"name":"LINUVALI","text":"And an island for the Gundu to start anew... The skies themselves could not grant such gifts! "},{"name":"LINUVALI","text":"However, it seems no Vanu inhabit this island since before Linu Vali's hatchling days. Listen─sound you hear not rolling thunder, but incessant buzzing of midge swarms. "},{"name":"LINUVALI","text":"Thunderstorm might even be more welcome than midges. One bite from midge and Vanu itch until feathers fall off. But midges have no taste for netherling blood."},{"name":"LINUVALI","text":"Netherling must help before midges cause sleepless nights for tribe! There, ride on the wings of sanuwa, and with its forceful breath drive the midge clouds from the trees."},{"name":"SYSTEM","text":"Ride the sanuwa and use its Buffet ability to drive the midge clouds from the trees."},{"name":"LINUVALI","text":"If sanuwa proves too much for netherling, speak with Luna Vanu to mount it once again. Worry not, even Vanu fall from sanuwa when first learning how to fly."},{"name":"LUNAVANU","text":"Sanuwa may seem wild at first, but Luna spends many moons training this one. Treat her gently, and the skies are yours to explore!"},{"name":"SYSYTEM","text":"The midge cloud is blown away!"},{"name":"SYSYTEM","text":"DELETE"},{"name":"LINUVALI","text":"Ah, the midges hum no longer. But even so, doubt still remains..."},{"name":"LINUVALI","text":"Although Linu makes promises of building new home for tribe, the uncertainty of the road ahead fills her with doubt. Linu Vali is nothing but delicate hen, with arms thin as branches and legs dainty as a gaelicat's..."},{"name":"LINUVALI","text":"It is true, netherling─just look! One day, Linu hopes to become strong enough to send the mightiest Vanu running in fear. But like rain in monsoon season, change comes fast and without warning. Linu possesses not the courage to lead..."},{"name":"LINUVALI","text":"Make no mistake, none are more loyal than Muna Vanu and Luna Vanu, but their feathers are old and grey. Linu cannot ask them to shoulder so heavy a burden. Without Brother, and the many still under Vundu rule, Linu knows not which path to take..."},{"name":"LINUVALI","text":"But in the black of night a beacon of light guides us. Linu speaks of <span class=\"emphasis\">you</span>, netherling!"},{"name":"LINUVALI","text":"Please, work with us to help build a new home for Gundu! Do so, and netherling lives on through generations of Gundu storytellers!"},{"name":"SYSYTEM","text":"Help develop Ok' Gundu Nakki?"},{"name":"SYSYTEM","text":"Like towering totem pole, netherling supports Gundu."},{"name":"SYSYTEM","text":"Alas, netherling must return to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> tribe."},{"name":"LINUVALI","text":"A thousand thanks, netherling! Your words clear the fog of doubt from Linu's heart."},{"name":"LINUVALI","text":"This is worthy of celebration! Celebration of the mighty netherling...? Linu Vali is embarrassed to ask, but...what <span class=\"emphasis\">is</span> netherling's name? "},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span> <span class=\"highlight\">Surname</span>? Such an odd-sounding name... Do all members of the netherling's tribe call themselves <span class=\"highlight\">Surname</span>? Ah, speaking of names, new Gundu village must have one worthy of grand Vanu settlement!"},{"name":"LINUVALI","text":"“Nakki” is ancient Vanu word for winds blowing from west, and also name of this island. Hmmm... To honor tribe of Gundu, village's name is “Ok' Gundu Nakki”!"},{"name":"LINUVALI","text":"The village has a name, and there is nothing left now but to begin building it! <span class=\"highlight\">Forename</span>, speak to Muna Vanu to learn what we need."},{"name":"LINUVALI","text":"My heart fills with disappointment, but Linu understands. Although our time together ends here, Linu wishes netherling the best of luck."},{"name":"SYSTEM","text":"Linu Vali and the other Gundu have begun developing Ok' Gundu Nakki!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Neutral</span> reputation with the Gundu."},{"name":"SYSTEM","text":"Vanu Vanu tribal quests are now available from Muna Vanu at Ok' Gundu Nakki."}],"reward":{"gil":658},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67184]},"next":[67701]},"partials":[{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1016087","obj":{"i":1016087,"n":"Linu Vali","l":2100,"q":10}},{"type":"npc","id":"1012066","obj":{"i":1012066,"n":"Sanu Vanu","l":2100,"q":8}},{"type":"npc","id":"1016093","obj":{"i":1016093,"n":"Luna Vanu","l":2100,"s":2,"q":8,"t":"Whitebone Exchange","r":1,"a":2240,"c":[7.04,14.28]}},{"type":"npc","id":"1016150","obj":{"i":1016150,"n":"Linu Vali","l":2100,"q":1}},{"type":"npc","id":"1016151","obj":{"i":1016151,"n":"Vanu Elder","l":2100,"q":1}},{"type":"npc","id":"1016156","obj":{"i":1016156,"n":"Midge Cloud","l":2100,"q":1}},{"type":"npc","id":"1016157","obj":{"i":1016157,"n":"Midge Cloud","l":2100,"q":1}},{"type":"npc","id":"1016158","obj":{"i":1016158,"n":"Midge Cloud","l":2100,"q":1}},{"type":"quest","id":"67184","obj":{"i":67184,"n":"A Difference of Opinion","g":3,"l":"The Sea of Clouds","s":73}},{"type":"quest","id":"67701","obj":{"i":67701,"n":"A Tribal Reunion","g":44,"l":"The Sea of Clouds","s":2,"f":1}}]}