{"quest":{"name":"A Tribal Reunion","location":"The Sea of Clouds","id":67701,"patch":3.1,"sort":2,"icon":100502,"beast":6,"unlocksFunction":1,"eventIcon":71341,"issuer":1016087,"target":1016087,"involved":[1012064,1012066,1016159,1016160,1016161,1016162,1016463,1016464,1016465],"genre":44,"journal":["Linu Vali has heard a rumor, and looks eager to share it with you.<br>※The difficulty of this quest will be synced to your current level.","Linu Vali seems in the middle of preparations to leave, and upon speaking to her you find that she means to return to her old home of Ok' Gundu. Rumors tell of Vanu that still inhabit the village, and Linu Vali has a hunch that they may be fellow Gundu in hiding. She asks that you aid her in the search, assuring you that the Vundu likely have lost interest in the area by now. Meet with Linu Vali at the entrance to Ok' Gundu to begin the search for the lost Vanu.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You arrive at the entrance to Ok' Gundu to find Linu Vali standing next to an unfamiliar Vanu Vanu. Soon she introduces her companion as Ranu Vali, a botanist renowned among the Gundu. Apparently Ranu Vali fled along with another Gundu by the name of Eenu Vanu, who leapt over the edge of the island in an attempt to escape the Vundu pursuing the pair. Linu Vali, certain that Eenu Vanu survived the fall, asks that you search for him while they keep lookout for any remaining Vundu. Search for any signs of Eenu Vanu in the lower island of Voor Sian Siran.","After searching Voor Sian Siran, you find Eenu Vanu, shaken but not visibly injured. After you tell him that Linu Vali sent you, he hurries to meet her. Return to Linu Vali to join in on the reunion.","The Gundu are elated to finally be reunited, but their happiness is cut short when a group of hostile Gundu arrive, threatening them with capture. Linu Vali, wishing to avoid violence against her former allies, steps forward to drive them away with her sundrop dance. She is unable to muster the ferocity to unnerve her enemies, however, and they counter with their own powerful display. Linu Vali and the others are left shivering in fear, but you stand ready to fight the Gundu off.","You defeat the Gundu warriors after a pitched battle. Check on the safety of Linu Vali and the other Gundu.","Linu Vali expresses her gratitude, but is ashamed of her ineffectual dance. She is still traumatized by the memories of the Vundu attacking her home, and fear takes hold of her when she attempts the dance. However, the safety and health of her companions brings her happiness, and she proceeds to Ok' Zundu to introduce the village's newest residents to Sonu Vanu. Follow the trio and speak with Sonu Vanu when you arrive.","Linu Vali introduces Eenu Vanu and Ranu Vali to Sonu Vanu, who is overjoyed to see the village's growth. However, his attendant Sanu Vanu expresses doubt at the Gundu's ability to sustain themselves. Despite Sanu Vanu's protestations, Linu Vali remains optimistic that the Gundu refugees will be able to make their new home flourish. The three Gundu return to Ok' Gundu Nakki. Go back with them and speak to Linu Vali when you arrive.","Linu Vali admits that Sanu Vanu's objections had some merit, but resolves to grow Ok' Gundu Nakki further in order to dispel future doubts. Now that the village is self-sufficient, it is only a matter of time until the Zundu look towards Ok' Gundu Nakki with respect."],"objectives":["Rendezvous with Linu Vali at Ok' Gundu.","Search for Eenu Vanu.","Report to Linu Vali at Ok' Gundu.","Slay the Gundu warriors.","Speak with Linu Vali.","Speak with Sonu Vanu at Ok' Zundu.","Speak with Linu Vali at Ok' Gundu Nakki."],"dialogue":[{"name":"LINUVALI","text":"As the rising sun does each morning, <span class=\"highlight\">Forename</span>'s arrival brings a smile to Linu's face! Soon I depart to old home, Ok' Gundu, and netherling's support would be most welcome."},{"name":"LINUVALI","text":"Rumors of Vanu who still live among the village's remains spread like seeds in wind. Linu thinks it may be fellow Gundu."},{"name":"LINUVALI","text":"Linu cannot leave members of tribe to mercy of Vundu. Time is of the essence─we must find the lost Vanu before they do."},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>'s skills for finding lost things is renowned, and Linu Vali asks <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to aid in search. Much time passes since Gundu flee from village, and Linu doubts the Vundu still search in large numbers."},{"name":"LINUVALI","text":"Linu Vali waits at entrance to Ok' Gundu. May zephyr winds bring <span class=\"highlight\">Forename</span> there safely!"},{"name":"RANUVALI","text":"Ah, the netherling is come. Linu Vali says much and more of prowess!"},{"name":"LINUVALI","text":"Linu's intuition proves correct! As soon as she begins searching village, Ranu Vali comes running towards her with smile like nestling reunited with mother."},{"name":"RANUVALI","text":"Netherling, honor of meeting is Ranu Vali's. Vundu are not to be feared if one who lays low the White walks with us."},{"name":"LINUVALI","text":"Ranu's skill at botany is the pride of whole Gundu tribe. Even when rain runs dry and the sun burns hot, her crops do not wither. Linu proudly wears crown of flowers Ranu makes for her!"},{"name":"LINUVALI","text":"Ranu tells of another Gundu, Eenu Vanu, who leaps to island below to escape Vundu pursuers. Eenu is stout and strong─surely he is unharmed."},{"name":"LINUVALI","text":"We remain here as lookouts. <span class=\"highlight\">Forename</span>, search islands below for any sign of Eenu Vanu."},{"name":"LINUVALI","text":"Vundu may return at any time. <span class=\"highlight\">Forename</span>, make haste in search for Eenu Vanu."},{"name":"RANUVALI","text":"Eenu leaps down to island below, but from here Ranu sees no traces of him."},{"name":"EENUVANU","text":"A...netherling? Eenu Vanu knows not what to make of this..."},{"name":"EENUVANU","text":"What? Linu Vali sends netherling? Like double rainbow, her coming brings joy! Come, let us go to meet her."},{"name":"RANUVALI","text":"Eenu Vanu's skill at hiding matches skill at cloudfishing!"},{"name":"EENUVANU","text":"Linu Vali tells much of netherling's great feats. To have the one who fells the White by our side... Next time, Eenu invites <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> for cloudfishing!"},{"name":"LINUVALI","text":"Linu Vali thanks <span class=\"highlight\">Forename</span> for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> help. Eenu Vanu is Gundu's most esteemed cloudfisher. Now tribe can feast on most succulent fish in cloud sea!"},{"name":"ZOUHYOUVANU02165","text":"There! Even cowardly paissa cannot hide forever!"},{"name":"LINUVALI","text":"These Vanu are...Gundu!? Like trained sanuwa you are at the Vundu's every beck and call. Only cowards follow so blindly!"},{"name":"ZOUHYOUVANU02165","text":"Honu Vanu, chief of Vundu, evoker of the White, illuminates true path like full moon in midnight sky. But for rebellious Vanu, there is only punishment!"},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, wait! Now is not time for fighting─now is time for sundrop dance!"},{"name":"ZOUHYOUVANU02165","text":"Hahaha, skies weep in embarrassment at pathetic dance! Even unpainted totem pole presents more fearsome display! Behold, a dance of true might!"},{"name":"BALLOON","text":"Netherling fights!? Very well!"},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, drive the traitors away!"},{"name":"RANUVALI","text":"Leave us be!"},{"name":"EENUVANU","text":"Cannot...move..."},{"name":"RANUVALI","text":"Our former friends look at us as enemies... Too many accept Vundu rule without thought, without question."},{"name":"EENUVANU","text":"Although they are now no better than Vundu puppets, to see friends turn against us troubles Eenu greatly.  "},{"name":"LINUVALI","text":"Linu owes <span class=\"highlight\">Forename</span> many apologies. Once, she dances with ferocity of summer squall. But now, remembering vicious Vundu attack on village fills Linu with fear, leaving her unable to dance as before."},{"name":"LINUVALI","text":"Linu once takes pride in sundrop dance, but now her pride is gone, and she feels as a newborn hatchling, shivering in the cold without its mother's body for warmth."},{"name":"LINUVALI","text":"But that we are safe is a blessing, at least. Let us return to Ok' Zundu. Sonu Vanu will certainly be eager to meet Ok' Gundu Nakki's new residents."},{"name":"LINUVALI","text":"Chief Sonu, Linu Vali introduces Ranu Vali, one of Gundu's most skilled botanists, and Eenu Vanu, one of our tribe's eminent cloudfishers."},{"name":"SONUVANU","text":"Ok' Gundu Nakki grows, and along with growth comes change. Sonu is eager to see what the future holds for your village."},{"name":"SANUVANU","text":"Sanu hears rumors of the Gundu's difficulties feeding its members. How do you hope to survive with even more beaks to feed?"},{"name":"LINUVALI","text":"Sanu, Gundu are no mere nestlings. Ok' Gundu Nakki does more than survive─it thrives. All Zundu are welcome to visit and see for themselves."},{"name":"SONUVANU","text":"As lightning heralds coming of nourishing rains, Ok' Gundu Nakki's new residents will bring sustenance to their village."},{"name":"SANUVANU","text":"The Vanu of Ok' Zundu cry out in discontent. What to do, what to do..."},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, in truth, the rumors Sanu Vanu hears are not wrong. Tribe does have difficulty feeding everyone. But now, we can grow and catch our own food, without relying on the generosity of others."},{"name":"LINUVALI","text":"Nevertheless, there are those in Ok' Zundu who say Chief Sonu gives too much, and think us Gundu to be nothing but a burden."},{"name":"LINUVALI","text":"Islands in cloud sea are precious indeed. It is no wonder that some feel an outsider undeserving of such a gift."},{"name":"LINUVALI","text":"So, all in Ok' Gundu Nakki must work tirelessly to make village prosper. Both to show gratitude to Sonu, and also to quell voices of doubt. Now that tribe can fend for itself, the Zundu doubtless take notice."},{"name":"LINUVALI","text":"Linu's sundrop dance may lack vigor of past, but until the day Brother returns to us, she must lead her tribe in his stead."},{"name":"SYSTEM","text":"Ranu Vali and Eenu Vanu take up residence at Ok' Gundu Nakki, increasing the village's food stores."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Recognized</span> reputation with the Gundu."},{"name":"SYSTEM","text":"New Vanu Vanu tribal daily quests are now available from Muna Vanu at Ok' Gundu Nakki."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Muna Vanu as a reputation rank bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Muna Vanu. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Luna Vanu."}],"reward":{"gil":822},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":34}],"quests":[67700]},"next":[67702]},"partials":[{"type":"npc","id":"1016087","obj":{"i":1016087,"n":"Linu Vali","l":2100,"q":10}},{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1012066","obj":{"i":1012066,"n":"Sanu Vanu","l":2100,"q":8}},{"type":"npc","id":"1016159","obj":{"i":1016159,"n":"Linu Vali","l":2100,"q":1}},{"type":"npc","id":"1016160","obj":{"i":1016160,"n":"Ranu Vali","l":2100,"q":1}},{"type":"npc","id":"1016161","obj":{"i":1016161,"n":"Eenu Vanu","l":2100,"q":1}},{"type":"npc","id":"1016162","obj":{"i":1016162,"n":"Eenu Vanu","l":2100,"q":1}},{"type":"npc","id":"1016463","obj":{"i":1016463,"n":"Linu Vali","l":2100,"q":1}},{"type":"npc","id":"1016464","obj":{"i":1016464,"n":"Ranu Vali","l":2100,"q":1}},{"type":"npc","id":"1016465","obj":{"i":1016465,"n":"Eenu Vanu","l":2100,"q":1}},{"type":"quest","id":"67700","obj":{"i":67700,"n":"Three Beaks to the Wind","g":44,"l":"The Sea of Clouds","s":1,"f":1}},{"type":"quest","id":"67702","obj":{"i":67702,"n":"Linu's Lovely Bones","g":44,"l":"The Sea of Clouds","s":3,"f":1}}]}