{"quest":{"name":"In the Skycage over the Sea","location":"The Sea of Clouds","id":67703,"patch":3.1,"sort":4,"icon":100504,"beast":6,"unlocksFunction":1,"eventIcon":71341,"issuer":1016087,"target":1016087,"involved":[1012064,1012066,1016168,1016172],"genre":44,"journal":["Linu Vali has finally received word of her sibling's whereabouts.<br>※The difficulty of this quest will be synced to your current level.","Linu Vali can barely contain her excitement when she tells you that a captured Vundu spy has given up information about her brother. According to the spy, Linu Vanu has been moved to a skycage hanging from the Cromlech. Adamant not to miss this long-awaited chance, she rushes off without further explanation. Meet Linu Vali at the Cromlech to aid in the rescue of her brother.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You arrive at the Cromlech to find Linu Vali surrounded by Vundu, ready to attack after Linu Vali's ineffectual sundrop dance. Luckily, you dispatch them before any of the petals on Linu Vali's head come to harm. Speak with Linu Vali, who looks eager to get on with her brother's rescue.","It seems the Vundu were lying in wait for any Vanu bold enough to try and rescue Linu Vali's brother. Your skirmish allows a brief window of safety, and Linu Vali asks you to give her brother a sanuwa horn, which he may use to summon a sanuwa and fly to safety. Find the skycage holding her brother and pass him the horn.","After searching the skycages below, you come across a confused Linu Vanu. After you explain the situation to him, he eagerly accepts the sanuwa horn his sister gave you and uses it to summon a sanuwa to escape the stuffy skycage. He dismounts to greet his sister as she is being confronted by yet another group of Vundu warriors. The two share a knowing glance before starting a perfectly synced sundrop dance, the intensity of which sends the Vundu scurrying back to their roosts. The two siblings are safe to have their heartfelt reunion at last, and Linu Vali explains everything that has happened thus far with the Gundu refugees. Her brother seems somewhat skeptical as to the intent of the Zundu tribe's newfound generosity, but nonetheless agrees to visit Ok' Zundu and greet Sonu Vanu. Follow the siblings back to Ok' Zundu and take part in the greeting.","Linu Vali is eager to introduce her brother to the Ok' Zundu chieftain, who affably greets the pair. Linu Vanu comments that Ok' Zundu has been left relatively untouched by the Vundu, and criticizes the Ok' Zundu chieftain for buying his tribe's safety with tributes while others, namely the Gundu, had their homes destroyed. Linu Vali is quick to silence her brother, explaining to him that if not for the Zundu, their tribe would be in an even worse off position. Her brother is surprised at his sister's boldness, and he apologizes for his actions. Sonu Vanu takes Linu Vanu's affront in stride, saying that he wants only for the two tribes to grow closer. The Gundu siblings depart to Ok' Gundu Nakki. Return with them and speak with Linu Vali upon your arrival.","Linu Vanu is appointed chief of Ok' Gundu Nakki, and the village finally has a leader. Linu Vali is relieved that the responsibility of leadership has been passed to her brother, but is worried that their recent meeting with the Zundu may cause trouble between the two tribes further down the road. She has a plan to improve the relations between Zundu and Gundu, and asks that you prepare to lend your aid when she is ready."],"objectives":["Rendezvous with Linu Vali at the Cromlech.","Speak with Linu Vali.","Give the cracked sanuwa horn to Linu Vanu.","Speak with Sonu Vanu at Ok' Zundu.","Speak with Linu Vali at Ok' Gundu Nakki."],"dialogue":[{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, at last the time to rescue Brother is come!"},{"name":"LINUVALI","text":"Zundu capture overly bold Vundu spy, and like flood after rains, answers pour from his beak after interrogation. Spy speaks of Brother, and says the Vundu plan to move him to a skycage hanging in the Cromlech."},{"name":"LINUVALI","text":"We must act now, while the Vundu do not expect us. Such a chance may not come again! Make haste to the Cromlech!"},{"name":"LINUVANU","text":"That voice. Is it...Sister's?"},{"name":"BALLOON","text":"Netherling fights with her!? Die!"},{"name":"LINUVALI","text":"Again!? It cannot be..."},{"name":"LINUVALI","text":"They sneer at Linu's dance... <span class=\"highlight\">Forename</span>, if not for you, the Vundu throw Linu Vali into lonely skycage!"},{"name":"LINUVALI","text":"Attackers lying in wait when Linu Vali arrives... Scheming Vundu hope to ambush any Gundu that come to rescue Brother!"},{"name":"LINUVALI","text":"But they know not our strength. Brother hangs below; Linu Vali hears his voice calling out. But such flimsy skycage cannot hold <span class=\"emphasis\">two</span> Vanu, even if one is dainty as Linu Vali."},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span> is light as butterfly in comparison─skycage holds fast under <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> weight! Here, give Brother this horn, and sanuwa answers call."},{"name":"LINUVALI","text":"On wings of steed he rides to freedom. <span class=\"highlight\">Forename</span>, hurry before more Vundu arrive!"},{"name":"LINUVALI","text":"Give the horn to Brother so he can fly from the skycage."},{"name":"LINUVANU","text":"Linu hears Sister's voice, and the sounds of pitched fighting. And now a netherling stands before me? What is the meaning of this?"},{"name":"LINUVANU","text":"Ah... Well, Linu Vanu is glad to have such a skilled fighter on his side. And you say Sister has a gift for me?"},{"name":"LINUVANU","text":"A sanuwa horn? With this, Linu rides sanuwa to freedom, and to family! Come, netherling!"},{"name":"LINUVANU","text":"Sister!"},{"name":"LINUVALI","text":"Brother!"},{"name":"LINUVANU","text":"Heh, Vundu! Linu Vanu will not return to your skycages!"},{"name":"LINUVALI","text":"Vundu cowards scatter as leaves before ferocious autumn gale!"},{"name":"LINUVALI","text":"Our bonds strengthen our dance. Few possess the will to stand fearless against dancers moving in concert, with allies and family."},{"name":"LINUVANU","text":"Netherling, naught but ill fate befalls our tribe since Vundu conquer our land. Your rescue is like single star shining in darkness, and for that Linu thanks you."},{"name":"LINUVANU","text":"Sister, for moons did Linu Vanu worry for your safety, alone in skycage. To see you safe brings more comfort than the first rays of light at dawn. How does Linu Vali escape the Vundu for so long?"},{"name":"LINUVALI","text":"For that, we must also thank <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has strong ties with the Zundu, and in their kindness they grant the Gundu refugees an island to rest on, far away from the Vundu. "},{"name":"LINUVANU","text":"Ah, bold as they are, even Vundu do not risk truce and encroach on Zundu territory. But...such kindness from the Zundu? Linu Vanu wonders what they intend..."},{"name":"LINUVALI","text":"Brother, all in Ok' Gundu Nakki eagerly await their chief's return. But first, let us make our introductions at Ok' Zundu. And from there, our new home!"},{"name":"LINUVANU","text":"Chief Sonu, may zephyr winds blow always at your back. I, Linu Vanu, son of Chief Uunu, greet you warmly."},{"name":"SONUVANU","text":"Ah, Linu Vanu looks much like his father! Your tribe faces many adversities, but that you are safe gives them hope. Sonu believes that Linu leads Ok' Gundu Nakki to greatness."},{"name":"LINUVANU","text":"It seems the Vundu spare Ok' Zundu─no building bears the scars of their wrath. Linu hears Ok' Zundu buys this peace with offerings. Linu supposes that is proper path for tribe lacking the strength, or courage, to face their enemies."},{"name":"SANUVANU","text":"Linu Vanu oversteps his bounds! He dares to insult our tribe!?"},{"name":"SONUVANU","text":"Sanu Vanu, let Linu speak. The Gundu stand against the Vundu, and they take everything from his tribe, even turning friends against one other. The Zundu choose a different path, and Linu is free to think as he likes about our choices."},{"name":"LINUVANU","text":"True warriors fight for their freedom, and for their tribe! Only cowards give gifts to appease their enemies!"},{"name":"SANUVANU","text":"C-Cowards!? Watch your words, Linu Vanu!"},{"name":"LINUVALI","text":"Brother! You embarrass us!"},{"name":"LINUVALI","text":"Ok' Gundu Nakki is gift from Zundu tribe. Without Zundu generosity, Gundu remain homeless, wandering cloud sea like sanuwa hatchling looking for mother. Brother brings shame to insult our benefactors!"},{"name":"LINUVANU","text":"Sister scolds Linu Vanu!? She becomes bolder with the passing of moons..."},{"name":"LINUVANU","text":"But perhaps she is right. Sonu Vanu, please forgive Linu Vanu's rudeness. "},{"name":"SONUVANU","text":"Linu Vanu, Sonu understands reasons for doubt. Now, let us move forward, and build further upon the friendship our two tribes share. "},{"name":"SANUVANU","text":"Surely Chief Sonu knows that Vundu discovery of Ok' Gundu Nakki is but a matter of time. When dark clouds bring Vundu to inquire about Zundu's role in their protection, what then does Chief Sonu do?"},{"name":"SONUVANU","text":"When the storm comes, Sonu Vanu trusts judgment of tribe to weather all safely through it."},{"name":"SONUVANU","text":"Right down to his personality, Linu Vanu is as if hatched from same egg as father."},{"name":"SANUVANU","text":"Linu Vanu could learn much from his sister's manners..."},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, with Brother's arrival, Ok' Gundu Nakki has chief at last!"},{"name":"LINUVALI","text":"Burden of responsibility lifts from Linu Vali's shoulders. However, although Linu wants nothing more than to polish her beak and talon, make feather arrangements, and practice her sundrop dance, there is still unease in the village..."},{"name":"LINUVALI","text":"Brother's dislike for the Zundu is plain, and it does not bode well for the future of our two tribes."},{"name":"LINUVALI","text":"Others in Ok' Gundu Nakki share his distaste. Some say that the Zundu are weaklings for not opposing the Vundu openly."},{"name":"LINUVALI","text":"Linu understands their misgivings, but they must look beyond that. If the Zundu do not buy freedom with tributes, then the Vundu conquer them as well. They would hold all islands in their talons, and all would answer to their rule."},{"name":"LINUVALI","text":"Linu must make the others understand this. The Zundu and Gundu must work together, for the benefit of both our tribes."},{"name":"LINUVALI","text":"Linu Vali has a plan to bring tribes together in friendship. She has plans for <span class=\"highlight\">Forename</span>'s role too. Speak with Linu Vali again when time comes!"},{"name":"SYSTEM","text":"Linu Vanu has been appointed chief of Ok' Gundu Nakki, and construction of the Chief's Roost has been completed."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Gundu."},{"name":"SYSTEM","text":"New Vanu Vanu tribal daily quests are now available from Muna Vanu at Ok' Gundu Nakki."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Muna Vanu as a reputation rank bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Muna Vanu. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Luna Vanu."}],"reward":{"gil":602},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":34}],"quests":[67702]},"next":[67704]},"partials":[{"type":"npc","id":"1016087","obj":{"i":1016087,"n":"Linu Vali","l":2100,"q":10}},{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1012066","obj":{"i":1012066,"n":"Sanu Vanu","l":2100,"q":8}},{"type":"npc","id":"1016168","obj":{"i":1016168,"n":"Linu Vali","l":2100,"q":1}},{"type":"npc","id":"1016172","obj":{"i":1016172,"n":"Linu Vanu","l":2100,"q":1}},{"type":"quest","id":"67702","obj":{"i":67702,"n":"Linu's Lovely Bones","g":44,"l":"The Sea of Clouds","s":3,"f":1}},{"type":"quest","id":"67704","obj":{"i":67704,"n":"Fishing for Friendship","g":44,"l":"The Sea of Clouds","s":5,"f":1}}]}