{"quest":{"name":"Sanuwa Samba","location":"The Sea of Clouds","id":67714,"patch":3.1,"sort":18,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016089,"involved":[1016093,1016217,1016218,1016219],"genre":45,"journal":["Muna Vanu is consumed in a fit of pique.<br>※The difficulty of this quest will be synced to your current level.","A band of lawless Vundu youths have been carousing in the former Gundu village, and Muna Vanu is loath to overlook so disrespectful a display. Bringing the full force of your power against mere children would be a crime, so the wise Gundu suggests a different approach─to buffet them with humiliating blasts of wind from a sanuwa. Luna Vanu will be able to provide you with a beast suitable for this task.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest. ","Luna Vanu is eager to help you show the belligerent Vundu youths that Ok' Gundu is not their playground. Fly to the former village and give them a good, solid fright with the aid of the sanuwa he has supplied you with.<br><br>※Speak with Luna Vanu in Ok' Gundu Nakki to mount a sanuwa.","You buffet the Vundu delinquents with blasts of air from your sanuwa. Faced with the proposition of continued humiliation, they quickly leave Ok' Gundu. Report back to Muna Vanu with news that the situation has been resolved without exacerbating the tense relationship between the Gundu and Vundu tribes.","Muna Vanu is glad to hear that you were able to dislodge the Vundu without having to resort to violence. Enough blood has already been spilt over the old Gundu village. There is no need for further slaughter."],"objectives":["Speak with Luna Vanu.","Ride a sanuwa and use its Buffet ability to scare the Vundu youths.","Report to Muna Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Dancing and shouting long into night, wine pouring into gullet endlessly, like waterfall pouring into bottomless hole! Vundu youth have no respect! No respect at all!"},{"name":"MUNAVANU","text":"Please forgive Muna Vanu's frustrations, netherling. But since we leave Ok' Gundu, Vundu scoundrels strut into former village, party long into night. They think Gundu weak─they think we do nothing!"},{"name":"MUNAVANU","text":"These nestlings must learn that Ok' Gundu still belongs to us! But still they are nestlings. To harm them would bring full wrath of Vundu tribe upon us. To scare them is best, and nothing scares young ones like blast of wind from full-grown sanuwa!"},{"name":"MUNAVANU","text":"Vundu youths still skulk about old Ok' Gundu, southeast of here. Luna Vanu prepares sanuwa. Speak with him to borrow one, then go to land that was once our home, and drive these shameless savages from it."},{"name":"LUNAVANU","text":"Luna hears of irreverent Vundu youths and their disrespect of our former lands. Please, take my strongest sanuwa and show shameless nestlings that Gundu are no joke!"},{"name":"LUNAVANU","text":"As greatest sanuwas are strong and spirited, so too are they hard to ride. Return to me should you need mount another beast. Now, go! Go and show Vundu scoundrels our strength!"},{"name":"YOUNGVANUA02178","text":"Heheheheh! Chief's wine is hard to steal─closely guarded─but delicious like sweetest nectar!"},{"name":"YOUNGVANUA02178","text":"Aaahhh! ...Wh-What!? You cannot shame warrior of Ok' Vundu like this! When village chief hears of netherling's crimes, force of all Vundu falls upon you like hurricane!"},{"name":"YOUNGVANUB02178","text":"Hmmm? Who is this? Perhaps ghost of cowardly Gundu, haunting lost home? Hahahah! ...No. Begone, ugly netherling."},{"name":"YOUNGVANUB02178","text":"Waaaaahhh! What great storm is this? Fierce like lightning! Powerful like...netherling riding sanuwa!? What trick do scheming Gundu play!?"},{"name":"YOUNGVANUC02178","text":"Uuughhh... Head booms like chief's drum at great festival... <span class=\"alternative-container\"><span class=\"alternative\">Moonlight</span><span class=\"alternative\">Sunlight</span></span> pierces eyes like warriors' sharpest spears... Chief's wine is powerful stuff..."},{"name":"YOUNGVANUC02178","text":"Weeeaaahhh! ...Netherling!? To use sanuwa to buffet sleeping Vanu is mean and cowardly! Vundu elder soon hears of your crimes!"},{"name":"MUNAVANU","text":"Beautiful work, <span class=\"highlight\">Forename</span>! Thank you for chasing away foolish Vundu nestlings. They do not forget this lesson soon, I suspect."},{"name":"MUNAVANU","text":"To not fight as you are accustomed, but to use sanuwa instead is hassle, no doubt. But spilling blood of nestlings would be too much."},{"name":"MUNAVANU","text":"Using powerful buffet of wind from sanuwa is much better. For we Vanu Vanu, buffet from sanuwa is great humiliation, but Muna Vanu hopes these Vundu nestlings can learn from this experience."}],"reward":{"gil":581,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016093","obj":{"i":1016093,"n":"Luna Vanu","l":2100,"s":2,"q":8,"t":"Whitebone Exchange","r":1,"a":2240,"c":[7.04,14.28]}},{"type":"npc","id":"1016217","obj":{"i":1016217,"n":"Vundu Youth","l":2100,"q":1}},{"type":"npc","id":"1016218","obj":{"i":1016218,"n":"Vundu Youth","l":2100,"q":1}},{"type":"npc","id":"1016219","obj":{"i":1016219,"n":"Vundu Youth","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}