{"quest":{"name":"Chigoe Cha-cha","location":"The Sea of Clouds","id":67711,"patch":3.1,"sort":15,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016089,"involved":[1016093],"genre":45,"journal":["The Gundu tribe would ask of your services once more.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu tells you that your services are required by Luna Vanu. Though he has not been informed of the particulars, knowing well the current uncertainty surrounding the tribe's food supply, he has little doubt that you will be asked to assist in securing foodstuffs. Speak with him and find out.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Luna Vanu has a hunger for chigoes. Unfortunately, these quick and cautious creatures are notoriously difficult to catch. However, he suggests a tried-and-true technique that can bag these bugs. A full-grown sanuwa is capable of creating a gust of wind that can blast a chigoe clean from its nest. A fast hunter, lying in wait, can snatch up the bug while it lies dazed by the attack. Three large, old trees at the Gauntlet are likely to have chigoe nests in them. Luna Vanu will wait beneath these trees while you, on sanuwa-back, blast your quarry from its place of hiding.<br><br>※Speak with Luna Vanu in Ok' Gundu Nakki to mount a sanuwa.","All goes according to plan. The sanuwa effortlessly throws the chigoe from its nest and within seconds Luna Vanu snaps up his prey. Spurred on by the fruitfulness of your efforts, Luna Vanu is eager to visit two more similar trees on the island and gather the bugs making nest within them.<br><br>※Speak with Luna Vanu in Ok' Gundu Nakki to mount a sanuwa.","You once again blast a chigoe from its nest into Luna Vanu's waiting arms. One tree remains to be harvested.<br><br>※Speak with Luna Vanu in Ok' Gundu Nakki to mount a sanuwa.","You catch yet another bug, fat and juicy, from the last of the trees suspected of housing chigoe nests. Satisfied with today's haul, Luna Vanu returns to the village. Return there yourself and let Muna Vanu know that your work is complete.","Muna Vanu thanks you for your work. He offers his apologies that his tribesmen ate each and every chigoe without offering you so much as a bite─it seems the bugs were so succulent that all who tasted them could not stop themselves."],"objectives":["Speak with Luna Vanu.","Ride a sanuwa and use its Buffet ability on the tree hollow.","Report to Muna Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Hello and good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>, <span class=\"highlight\">Forename</span>. Gundu welcome <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> always! Luna Vanu has request to make of netherling, but departs before giving details."},{"name":"MUNAVANU","text":"Village still wants for steady supply of meals. No doubt he asks you to help secure reliable source of food. But perhaps it is best if you ask him yourself."},{"name":"LUNAVANU","text":"Ah, so <span class=\"highlight\">Forename</span> comes to help Luna Vanu? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is welcome sight at ideal time, like rain falling on newly planted crops!"},{"name":"LUNAVANU","text":"Luna Vanu requests that netherling bring chigoe larvae for tribe to feast on. These bugs are supremely delicious and very nutritious. But they are fast like lightning and not easily caught."},{"name":"LUNAVANU","text":"But sanuwa can blast chigoes from nest with terrible gusts of wind. <span class=\"highlight\">Forename</span>, take to skies on trusty mount. Luna Vanu waits beneath nest to catch dazed bug before it flees."},{"name":"LUNAVANU","text":"Chigoes build nests in hollows of gnarled, old trees. Such trees dot island netherlings call the Gauntlet. Mount sanuwa, and meet Luna Vanu there."},{"name":"LUNAVANU","text":"Luna Vanu helps <span class=\"highlight\">Forename</span> mount sanuwa again if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> falls from steed─just ask. Now, onward to the Gauntlet, and feast of delicious bugs!"},{"name":"SYSTEM","text":"Deep within the hollow, you hear the sound of an insect scurrying about. Speak with Luna Vanu to ride a sanuwa and use its Buffet ability to blast the creature from the hole."},{"name":"LUNAVANU","text":"We make beautiful catch, <span class=\"highlight\">Forename</span>! Plump and juicy... But two more nests remain. Please, hurry to next tree!"},{"name":"SYSTEM","text":"Deep within the hollow, you hear the sound of an insect scurrying about. Speak with Luna Vanu to ride a sanuwa and use its Buffet ability to blast the creature from the hole."},{"name":"LUNAVANU","text":"Another great catch, <span class=\"highlight\">Forename</span>! Only one nest now remains!"},{"name":"SYSTEM","text":"Deep within the hollow, you hear the sound of an insect scurrying about. Speak with Luna Vanu to ride a sanuwa and use its Buffet ability to blast the creature from the hole."},{"name":"LUNAVANU","text":"Thank you, <span class=\"highlight\">Forename</span>! We catch veritable feast for tribe! Let us return to village, and tell Muna Vanu of our success."},{"name":"MUNAVANU","text":"Welcome back, <span class=\"highlight\">Forename</span>. Luna Vanu tells Muna Vanu of your work. Each day, tales of your boundless generosity ripple through Ok' Gundu Nakki like rolling thunder echoing across Sea of Clouds."},{"name":"MUNAVANU","text":"Muna Vanu hears prey you help catch is large and delicious─sweeter than honey! Luna Vanu shares with tribe, and all is gone within seconds. Please accept my apologies on his behalf. He should share with netherling, too."}],"reward":{"gil":581,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016093","obj":{"i":1016093,"n":"Luna Vanu","l":2100,"s":2,"q":8,"t":"Whitebone Exchange","r":1,"a":2240,"c":[7.04,14.28]}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}