{"quest":{"name":"Flight of the Midges","location":"The Sea of Clouds","id":67718,"patch":3.1,"sort":22,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016091,"involved":[1016093,1016220,1016221,1016222],"genre":45,"journal":["Muna Vanu is sourly swatting the air around him.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu is irritated by the never-ending swarms of biting insects, but notices he is not the only one getting harassed by the pests. Speak to a displeased Ranu Vali about the state of her crops.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Ranu Vali has tried all manner of remedies to keep midge clouds from taking bites out of her crops, but to no avail. She suspects the vilekin plaguing the island are being blown in on wind drifts from Ok' Zundu. The agitated Gundu pleads with you to ask Luna Vanu to take a village sanuwa with you to eliminate the breeding grounds of the midge swarms. ","Luna Vanu agrees to lend you one of his precious cloudkin. Ride the sanuwa around Ok' Zundu and curb the stinging midges from flowing on the wind stream.  <br><br>※Speak with Luna Vanu in Ok' Gundu Nakki to mount a sanuwa.","The swarms of midges have been dissipated. Return to Ok' Gundu Nakki to report your success to Ranu Vali.","Ranu Vali feels relieved from your efforts to control the billowing clouds of pests in Ok' Zundu. The breeding grounds bring new nuisances with each rainfall, but the garden patches of Ok' Gundu Nakki are able to grow in peace for the moment."],"objectives":["Speak with Ranu Vali.","Speak with Luna Vanu.","Ride the sanuwa and use Buffet on the midge clouds.","Report to Ranu Vali."],"dialogue":[{"name":"MUNAVANU","text":"Buzzing, buzzing in Muna's ear! Vanu know no misery like swarming clouds of midges!"},{"name":"MUNAVANU","text":"But Vanu not only ones to suffer insects' storm. Muna sees seedling crops wither as well, green leaves of Ranu Vali's garden patch chewed up like battered leaves caught in tornado's path. He wants netherling to ask her if crops can withstand insects' wrath."},{"name":"RANUVALI","text":"Ranu Vali burns herbs day and night, but midges continue feasting on Ok' Gundu Nakki's crops! Strong Gundu can endure small annoyances, but when insects eat up all village's food, even strong Gundu become weak!"},{"name":"RANUVALI","text":"Sure as sun, Ranu knows pesky vilekin not from Ok' Gundu Nakki. Midges must be riding on wind stream, blown here from remote areas near Ok' Zundu. For sake of growing field, Ranu pleads with netherling to find midge breeding grounds and get rid of them using sanuwa's breath!"},{"name":"RANUVALI","text":"If netherling does not own sanuwa, ask Luna Vanu to borrow village one. With swarms bothering every Vanu in village, he will not refuse netherling's request."},{"name":"RANUVALI","text":"Ask Luna Vanu to borrow sanuwa and get rid of midge pests in surrounding islands. Oh no, there are so many on my plants!"},{"name":"LUNAVANU","text":"Netherling wishes to borrow sanuwa to get rid of midges? Luna also tires of swatting noisy clouds, he is happy to lend <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> village sanuwa! This one grows especially angry with pests, will blow them away with fiercest gale!"},{"name":"LUNAVANU","text":"If netherling wishes to ride sanuwa, let Luna know. His sanuwa upset with buzzing midges as much as any Vanu, bluster them so greatly their wings fall off!"},{"name":"RANUVALI","text":"Sanuwa is very important for dissolving midge clouds. Ask Luna Vanu to borrow sanuwa for saving Gundu crops."},{"name":"SYSTEM","text":"The midges seethe in a cloud, producing a loud humming sound. <br>Speak to Luna Vanu in Ok' Gundu Nakki to ride a sanuwa and use its breath to disperse the swarm."},{"name":"RANUVALI","text":"Ranu Vali's ears hear only sound of breeze rustling leaves now. Surely this is sign that pests will soon trouble Ok' Gundu Nakki's crops no more. Her gratitude towards netherling's effort is boundless!"},{"name":"RANUVALI","text":"Netherling might not know, but midges breed easily in small pools where rainwater collects. If there are no villages around to make sure insects don't thrive, midge clouds swell like storm clouds, and appetite grows."},{"name":"RANUVALI","text":"Tiny insects fly too fast for Vanu to swat away with thick talons, but sanuwa's gusty breath is very strong, kills pesky midges easily. Netherling should remember next time midges irritate <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."}],"reward":{"gil":461,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":2,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016091","obj":{"i":1016091,"n":"Ranu Vali","l":2100,"q":4}},{"type":"npc","id":"1016093","obj":{"i":1016093,"n":"Luna Vanu","l":2100,"s":2,"q":8,"t":"Whitebone Exchange","r":1,"a":2240,"c":[7.04,14.28]}},{"type":"npc","id":"1016220","obj":{"i":1016220,"n":"Midge Cloud","l":2100,"q":1}},{"type":"npc","id":"1016221","obj":{"i":1016221,"n":"Midge Cloud","l":2100,"q":1}},{"type":"npc","id":"1016222","obj":{"i":1016222,"n":"Midge Cloud","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}