{"quest":{"name":"Comb and Get It","location":"The Sea of Clouds","id":67716,"patch":3.1,"sort":20,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016089,"involved":[1012068],"genre":45,"journal":["Muna Vanu looks like something the gaelicat dragged in.<br>※The difficulty of this quest will be synced to your current level.","The Vanu Vanu are starting to molt, their oldest feathers falling away to make place for fresh new plumage. But the process leaves them looking disheveled and unkempt. This misfortune is easily ameliorated through simple use of a comb─an item the Gundu find themselves distinctly lacking right now. Fortunately, the Zundu are nearby, and are famed for the quality of their combs. Muna Vanu asks that you obtain some for his tribe, but notes that the Zundu will not part with their craftsmanship for free. He suggests you kill wamouracampae and gather their meat for trade. Start by collecting wet straw to draw these cautious creatures from their nests. It can be found some way south of Ok' Gundu Nakki.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest. ","You find the wet straw where Muna Vanu said it would be. Burn it at a wamoura nest, found near the Blue Window, to draw your prey from its hiding place so that you may slay it and gather its meat.","You make short work of the wamouracampae and quickly butcher the flesh from their abdomens. Take your prize to Guna Vanu to trade for the combs the Gundu need.","When you show him the wamouracampa meat, Guna Vanu is more than happy to give you as many combs as you need in exchange for it. Deliver these combs back to Muna Vanu before his tribe starts molting in earnest.","Muna Vanu thanks you profusely on behalf of the whole Gundu tribe. Without proper combing, the feathers the Vanu Vanu shed will remain hidden within their plumage for days, causing discomfort and itching, and making them look altogether much more scruffy than is respectable. As such, regular combing is a part of life for them─all the more so during molting season."],"objectives":["Gather wet straw from south of Ok' Gundu Nakki.","Use the wet straw to draw wamouracampae from their nest and gather segments of wamouracampa abdomen from them.","Deliver the segments of wamouracampa abdomen to Guna Vanu.","Deliver the tribal combs to Muna Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Molting season for Vanu Vanu approaches fast, <span class=\"highlight\">Forename</span>. Feathers from all Vanu Vanu─chief and nestling alike─fall like leaves from autumn trees. Feathers that remain sit haphazard and uneasy─and very uncomfortable! Tribe needs many combs to deal with flurry of down and feathers─many more combs than it has!"},{"name":"MUNAVANU","text":"Perhaps <span class=\"highlight\">Forename</span> can help us. Ok' Zundu is renowned for their combs, strong and long-lasting. But Gundu lack goods to trade for combs."},{"name":"MUNAVANU","text":"All Vanu Vanu love taste of freshly caught wamouracampae. Flesh from beasts commands high price─sufficient to supply combs for whole tribe."},{"name":"MUNAVANU","text":"But wamouracampae are sly and wily. To draw them from nests is not easy. Find wet straw to south of here─wamourae cannot resist its scent. Burn straw near the beasts' nest, and wait for them to come searching for aroma's source."},{"name":"MUNAVANU","text":"Netherling, please kill two wamouracampae and trade for combs. Two give enough meat to barter for a village's worth of combs. Trade from none other than Guna Vanu─he has best combs in all of Ok' Zundu. And remember: most delicious meat of wamoura is from abdomen!"},{"name":"POPMESSAGE","text":"Something springs from the nest!"},{"name":"GUNAVANU","text":"You seek combs for Gundu? Guna Vanu happily gives combs, but first must ask to see what netherling offers in trade."},{"name":"GUNAVANU","text":"Wamouracampa flesh!? And such succulent, juicy flesh... Tonight, Guna Vanu's family eats like village chief! Please, take as many combs as you need!"},{"name":"GUNAVANU","text":"Wamouracampa flesh netherling offers has supreme scent, and is soft like fluffiest summer cloud. Please give thanks to Gundu!"},{"name":"MUNAVANU","text":"Ah, <span class=\"highlight\">Forename</span> returns at last. Does <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> bring combs for our molting feathers?"},{"name":"MUNAVANU","text":"Truly beautiful! And strong, too! With these, tribe's feathers lie neat and tidy."},{"name":"MUNAVANU","text":"Timing of <span class=\"highlight\">Forename</span> is perfect. In mere days, our feathers start to shed. Loose feathers left alone are so itchy Muna Vanu cannot well describe it!"},{"name":"MUNAVANU","text":"But good combing removes old feathers and leaves fresh feathers in place. Coat shines and shimmers like pond surface in evening sun, and catches eyes of nice young Vanu Vanu ladies..."},{"name":"MUNAVANU","text":"Ah, Muna Vanu speaks too much. But know that combs are crucial to Vanu way of life. And in molting season, so many combs are broken, even the most well-prepared run out sometimes."}],"reward":{"gil":461,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1012068","obj":{"i":1012068,"n":"Guna Vanu","l":2100,"q":4}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}