{"quest":{"name":"Bird Watching","location":"The Sea of Clouds","id":67715,"patch":3.1,"sort":19,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016089,"involved":[1012055,1012057,1016215],"genre":45,"journal":["Muna Vanu knows there are tasks you are uniquely suited to.<br>※The difficulty of this quest will be synced to your current level.","The comings and goings of the Vundu tribe are largely unknown to the Gundu. This greatly concerns Muna Vanu. He worries that they secretly plot to attack his people, but without the manpower to observe this threat, he remains unable to adequately appraise the situation. Fortunately, the accomplished knights of Camp Cloudtop keep a close eye on all that transpires around them, and should be well aware of what the Vundu are doing. Fearing they will be uneager to take sides in Vanu Vanu politics, he suggests you speak with the knights on his behalf and find out whether his concerns of Vundu attack are unfounded.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest. ","The Ishgardians stationed at the camp tell you that the Vundu have been spotted in the vicinity of Voor Sian Siran. With little further information forthcoming, you will need to travel there yourself to allay Muna Vanu's suspicions.","You happen upon a Vundu scout muttering something to himself about the Gundu. Report back to Muna Vanu with this news.","Muna Vanu is pleased with your work. The information you have gathered will help him in taking steps to ensure the safety of all those under his care."],"objectives":["Gather information at Camp Cloudtop.","Gather information at the Rosehouse.","Search for Vundu warriors near Voor Sian Siran.","Report to Muna Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Lately, we hear no news of Vundu movement, <span class=\"highlight\">Forename</span>. But Muna Vanu knows they are always searching, always spying. We need your help. Please find out what they scheme─what evil plan they hide."},{"name":"MUNAVANU","text":"Netherling knights south of here send scouts out regularly. They intently watch all Vanu Vanu─Vundu, Gundu, Zundu─as griffin looks over land from its perch."},{"name":"MUNAVANU","text":"But they are friendly with you, netherling. Speak with them on behalf of Gundu─and share with us what news they have of sinister Vundu plans."},{"name":"RONTREMONT","text":"You want to know what the Vundu are planning? They have been sending out a frightful number of scouts of late. All signs suggest they are searching for something, though for what, I cannot say."},{"name":"RONTREMONT","text":"This is about the Vundu, is it? Their warriors have been training ceaselessly. A betting man might say they're preparing for war. We even stepped up our patrols somewhat as a precaution."},{"name":"RONTREMONT","text":"You are asking about the Vundu, I take it? You know, we have not heard a peep from them for some time. If you ask me, they were on the wrong end of some tribal dispute or another."},{"name":"RONTREMONT","text":"Clear though it is that the Vundu are plotting something, when it comes to the particulars, your guess is as good as mine."},{"name":"RONTREMONT","text":"We try to keep abreast of the goings-on here as well we can, but when we see something like this brewing, there is not much more we can do but gird ourselves and hope for the storm to pass us by."},{"name":"RONTREMONT","text":"Those Vundu must have really been given what for. They are going quite out of their way to avoid drawing any attention to themselves."},{"name":"HARMIETTE","text":"I really can't say much about the Vanu Vanu, I'm afraid... No, I tell a lie─though I didn't see them myself, one of the other knights mentioned seeing them at Voor Sian Siran."},{"name":"HARMIETTE","text":"Now, I'll admit I didn't see them myself, but the chap who <span class=\"emphasis\">did</span> is a reliable man."},{"name":"ROSESKNIGHT02179","text":"I didn't see no Vanu Vanu meself, but I've heard folk sayin' they were spotted down at Voor Sian Siran. If ye want to be sure, ye'd do well to head out and take a look yerself."},{"name":"ROSESKNIGHT02179","text":"If ye want to know more about the Vanu Vanu, ye'll have to go to Voor Sian Siran and see for yerself."},{"name":"GUARDVANU02179","text":"Unchanging as still night air... Still no sign of pathetic Gundu. Search takes far too long─would be sooner to wait for grass to fall from sky and rain to grow from dirt!"},{"name":"GUARDVANU01","text":"Unchanging as still night air... Our battle with Gundu is yet to start. Chief makes us wait and prepare and wait yet more. How long would he have us delay!?"},{"name":"GUARDVANU01","text":"Unchanging as still night air... But do Gundu and Zundu have such...such power that chieftain would fear them? Or perhaps chief's caution is borne of wisdom, not cowardice."},{"name":"SYSTEM","text":"There is no sign of the Vundu here. Perhaps you will have more luck from a different vantage."},{"name":"MUNAVANU","text":"Dependable as sun rising each morn, <span class=\"highlight\">Forename</span> returns─and brings with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> valuable information about Vundu treachery, yes?"},{"name":"MUNAVANU","text":"Maybe Vundu have eyes on Gundu lands. Maybe they do not. To lower our guard would be folly, but it brings comfort to know tribe may live without fear of impending Vundu attack─for now."},{"name":"MUNAVANU","text":"That Vundu still train and prepare means they are not yet ready to attack, giving Gundu time to prepare defense. This time affords us chance to perfect mighty sundrop dance!"},{"name":"MUNAVANU","text":"Vundu now tremble in fear─quivering like soaked gaelicat in frigid winter gale. Still we must be wary, but we have bought our peace for a time."}],"reward":{"gil":665,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1012055","obj":{"i":1012055,"n":"Rontremont","l":2100,"q":3}},{"type":"npc","id":"1012057","obj":{"i":1012057,"n":"Harmiette","l":2100,"q":3}},{"type":"npc","id":"1016215","obj":{"i":1016215,"n":"Rose Knight Sentry","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}