{"quest":{"name":"Rotten to the Korrigan","location":"The Sea of Clouds","id":67729,"patch":3.1,"sort":51,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016091,"involved":[1016216,1016235,1016236,1016508],"genre":45,"journal":["Muna Vanu of Ok' Gundu Nakki desires your assistance.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu tells you that Ranu Vali is in need of your assistance. Speak with her to learn how best you might be of help.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest. ","Ranu Vali needs korrigans─fresh ones, plucked straight from the dirt. But the earsplitting screeches they emit when uprooted drive even the most stalwart Vanu to distraction. Travel to Last Step and retrieve four of these clamorous creatures for her.","The piercing cry of the mandragoras chills you to the bone─for a moment─before it echoes and fades. A race more sensitive to certain sounds might well find these screams unbearable. Return to Ok' Gundu Nakki and deliver the fruits of your harvest to Ranu Vali.","Ranu Vali thanks you profusely for your work. Sliced korrigans, marinated in honey, are a Gundu delicacy that will perfectly complement the banquet she is preparing for the Zundu."],"objectives":["Speak with Ranu Vali.","Gather korrigans.","Deliver the korrigans to Ranu Vali."],"dialogue":[{"name":"MUNAVANU","text":"Prevailing winds bring <span class=\"highlight\">Forename</span> to Muna Vanu once more. Ranu Vali seeks help. Please seek Ranu Vali, and offer help."},{"name":"RANUVALI","text":"Like cloud bringing shade on scorching summer day, <span class=\"highlight\">Forename</span> is truly welcome sight! You are perfect one to help with Ranu Vali's work!"},{"name":"RANUVALI","text":"Ranu Vali needs korrigans─needs netherling to pull them from soil where they sprout. Easy work, but we Vanu cannot handle horrible sound of korrigans screaming in agony when leaving ground."},{"name":"RANUVALI","text":"Please go to Last Step, and uproot mandragoras there. Four is sufficient."},{"name":"RANUVALI","text":"Korrigans are at Last Step. Please dig up four for Ranu Vali."},{"name":"MANDRAGORA02193","text":"◎×▼△×××......!!!"},{"name":"RANUVALI","text":"Does netherling have korrigans?"},{"name":"RANUVALI","text":"Many thanks, <span class=\"highlight\">Forename</span>! Without netherling's help, Ranu Vali struggles like starflower in summer storm, but you harvest korrigans without difficulty!"},{"name":"RANUVALI","text":"Ranu Vali treats wives of Ok' Zundu to traditional Gundu feast. Netherling's gift of korrigans, when sliced and marinated in honey, provides finishing touch that completes perfect Gundu banquet!"}],"reward":{"gil":709,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016091","obj":{"i":1016091,"n":"Ranu Vali","l":2100,"q":4}},{"type":"npc","id":"1016216","obj":{"i":1016216,"n":"Comely Korrigan","l":2100,"q":1}},{"type":"npc","id":"1016235","obj":{"i":1016235,"n":"Comely Korrigan","l":2100,"q":1}},{"type":"npc","id":"1016236","obj":{"i":1016236,"n":"Comely Korrigan","l":2100,"q":1}},{"type":"npc","id":"1016508","obj":{"i":1016508,"n":"Comely Korrigan","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}