{"quest":{"name":"Shady Premonitions","location":"The Sea of Clouds","id":67725,"patch":3.1,"sort":41,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016088,"involved":[1016228,1016229,1016230],"genre":45,"journal":["Muna Vanu is scratching his head, puzzled.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu tells you that a foreboding rumor has been floating on winds from Ok' Zundu in the east. Speak to Linu Vanu to hear more about the curious whisper. <br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Linu Vanu tells you the nestlings of Ok' Zundu are anxiously claiming the advent of an airborne beast of Zundu myth. Curious of the tribe's myth and its palpability, he asks that you seek out one of the Zundu nestlings and listen to what they have to say. ","You speak with the unnerved Zundu nestling, who tells you he has spotted the legendary beast's feathers scattered northeast of Ok' Zundu, directly feeling the “bite” of impending darkness. He asks you to challenge the beast in a daring display of strength.","The fallen feathers that allegedly came from a mythical beast which attacked the nestlings of Ok' Zundu are not feathers at all, but metal claws from an encroaching Garlean legion. Mythical beast or not, the claws still pose a considerable danger. Speak with the cowering Zundu to find the location of the other “feathers.”","The Zundu nestling is impressed by your combat with the Garlean metal claws, and guides you to the other location the magitek was sighted. Wait at the designated spot until the enemy compels you to display another courageous performance.","You have defeated the Garlean metal claws with a daring display of fearlessness. Speak with the Zundu nestling nearby.","The Zundu nestling is confident that the legendary beast is satisfied with your bold movements, running home to tell the other nestlings about the birth of a new legend. Return to Ok' Gundu Nakki to relay the outcome to Linu Vanu.","Linu Vanu has already heard whispers on the wind about the outcome of the search for the legendary beast and how you narrowly avoided the end of the world. He expresses gratitude for listening to the nestling, and states that the Gundu tribe will also remain on the lookout for the claws."],"objectives":["Speak with Linu Vanu.","Speak with the cowering Zundu in Ok' Zundu.","Survey the location in the Sea of Clouds. ","Speak with the cowering Zundu.","Survey the location in the Sea of Clouds.","Speak with the cowering Zundu.","Report to Linu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"The winds bring strange tidings from Ok' Zundu, netherling. Rumors of the world cloaked in darkness, according to Zundu legend."},{"name":"MUNAVANU","text":"Linu Vanu is as perplexed about this as rain falling in sunlight, and seeks netherling's help to make sense of it."},{"name":"LINUVANU","text":"Netherling, Linu hears strange whispers about nestlings of Ok' Zundu. They are restless, swirling with stories of return of a beast of legend─beast that rides the wind with great wings and brings everlasting night."},{"name":"LINUVANU","text":"Linu is curious about such rumors. Zundu tribe has feathers and talons same as Gundu, but eyes see different beasts and beaks tell different tales through the ages. Linu knows little of this airborne creature which cloaks Sea of Clouds in midnight shade."},{"name":"LINUVANU","text":"Might netherling venture to Ok' Zundu to hear nestlings' tale and bring it back to Linu?"},{"name":"LINUVANU","text":"Linu wishes to know more about Zundu legend. If legend is true, then Gundu should also respect and fear this flying beast."},{"name":"ZUNDU02189","text":"Clouds grow darker day by day, netherling. Feathers of great flying beast of Zundu legend attack nestlings! As grass thirsts for rain clouds, nestlings know that the beast thirsts for show of fighting spirit. If booming display of might does not satisfy beast, it punishes tribe, world cloaked in shade forever!"},{"name":"ZUNDU02189","text":"We ask Gunu Vanu, Bringer of Shade, for help, but he believes nestlings not. He tells us great beast's feathers do not stir, even though feathers <span class=\"emphasis\">bite</span> us on tail end! "},{"name":"ZUNDU02189","text":"Nestlings no match for biting feathers, but netherling looks strong, fearless! If netherling displays mighty dance, maybe great flying beast becomes full like storm cloud filling with rain! Come, I take you, northeast of Ok' Zundu!"},{"name":"ZUNDU02189","text":"Right here! Right here! We saw feather here when playing in the sun! Wait and see!"},{"name":"ZUNDU02189","text":"Netherling's fighting spirit is so powerful that feathers stay their biting! But this is not only place nestlings see feathers. Come, I will take netherling to another place!"},{"name":"ZUNDU02189","text":"There! They appear at cliff's edge while nestlings pick flowers! Now, show feathers netherling's dance of wrath! "},{"name":"ZUNDU02189","text":"Netherling's display of might is savage as stinging hailstorm. Great flying beast surely trembles with joy! I shower netherling with thanks, and return to tell others of new legend seen with own eyes."},{"name":"LINUVANU","text":"Netherling has returned, but Linu Vanu already hears of soft chattering of Zundu nestlings' new hero. It would seem netherling has driven away the beast of midnight shade!"},{"name":"LINUVANU","text":"Netherling has Linu's gratitude for helping Zundu nestlings. Sometimes tribe elders disregard nestling worries, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> shows belief from small beaks has small truths."},{"name":"LINUVANU","text":"Thanks to netherling, Linu also understands trouble that comes with feathers' presence. Gundu tribe also keeps careful watch on Ok' Gundu Nakki for signs of legendary beast's feathers."}],"reward":{"gil":609,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":4,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"npc","id":"1016228","obj":{"i":1016228,"n":"Cowering Zundu","l":2100,"q":1}},{"type":"npc","id":"1016229","obj":{"i":1016229,"n":"Cowering Zundu","l":2100,"q":1}},{"type":"npc","id":"1016230","obj":{"i":1016230,"n":"Cowering Zundu","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}