{"quest":{"name":"The House That Ginu Built","location":"The Sea of Clouds","id":67722,"patch":3.1,"sort":32,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016092,"genre":45,"journal":["Muna Vanu seems unimpressed with huts in Ok' Gundu Nakki.<br>※The difficulty of this quest will be synced to your current level.","According to Muna Vanu, their resident hut builder, Ginu Vanu, is in need of assistance to continue his work. Speak with him to see what you can do to help.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Ginu Vanu feels that his work so far is too plain. He insists that Ok' Gundu Nakki needs something unique to set it apart from other settlements, and he has a plan to make it happen. For his idea to work, however, he needs special stones taken from the living masses of rock known as groundsreapers. He asks that you travel to the eastern region of the Blue Window and slay them for building material.","You make swift work of two groundsreapers and retrieve a golem wart from each. Take them to Ginu Vanu, and see if they suit his needs.","Ginu Vanu is thrilled to see you have brought him material in near-perfect condition. As he tells it, the groundsreapers, birthed from the soil of islands, sustain themselves using rain and other rocks for sustenance. With building blocks that can essentially feed on bad weather, Ginu Vanu is all but certain the next hut he builds will be the envy of all Vanu villages."],"objectives":["Speak with Ginu Vanu.","Survey the designated location and destroy groundsreapers to obtain golem warts.","Deliver the golem warts to Ginu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Like rays of sun, fortune shines upon Muna Vanu. <span class=\"highlight\">Forename</span> comes at most opportune time. Ginu Vanu needs help with building new hut and could make use of netherling's skills. Speak with him and see what must be done."},{"name":"GINUVANU","text":"So, this is Gundu's new home? Hmmm...Ginu Vanu thinks village needs something extra. Like rainbow cloud in summer sky, Ok' Gundu Nakki should catch eyes of all Vanu."},{"name":"GINUVANU","text":"That is why Ginu Vanu plans to build a majestic hut of stone, and needs the sturdiest there is─rocks from groundsreaper golems. Please netherling, travel to islands far in the east, and collect their rocks for the Gundu's new hut."},{"name":"GINUVANU","text":"Rocks from groundsreapers make great hut. It shines like single ray of sun through stormy clouds."},{"name":"GINUVANU","text":"Hut of stone tower over all like redwood among maple, taller than any other village's. But Ginu Vanu cannot start without groundsreaper rocks."},{"name":"GINUVANU","text":"Smooth, and very little weathering. Netherling does well─these stones make perfect hut."},{"name":"GINUVANU","text":"Groundsreapers are children of islands. For thirst they drink rain. For sustenance they breathe clouds and eat soil. Then, after many years, they return to ground and become one with earth, like rejoining family."},{"name":"GINUVANU","text":"Netherling brings stones from very young groundsreapers. They hold firm against wind and drink rain to stay strong. Where storm would damage normal hut, this hut grows like tree basking in sunlight."},{"name":"GINUVANU","text":"Impressive, yes? Ginu Vanu cannot make big house of metal like netherlings, but huts in Ok' Gundu Nakki will be just as good. Just as tough."}],"reward":{"gil":609,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016092","obj":{"i":1016092,"n":"Ginu Vanu","l":2100,"q":6}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}