{"quest":{"name":"Nailed Down","location":"The Sea of Clouds","id":67721,"patch":3.1,"sort":31,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016092,"involved":[1012054],"genre":45,"journal":["Muna Vanu stares off into the distance, sighing dejectedly.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu is concerned with how long the construction of new Gundu huts is taking. He asks that you speak with the resident builder, Ginu Vanu, and see what can be done to help things along.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Ginu Vanu explains that the construction materials available are not conducive to expedient work. Good, steel nails, like those used by the Rose Knights, would help him finish his work much more quickly. To acquire said nails, he plans to offer them meat from tsanahales in exchange. This meat is at its most delicious─and valuable─immediately after being butchered, so you will need to slay the beasts yourself. Ginu Vanu recommends using wamoura, found on an island to the south, as bait to draw them out.","After surveying a nearby island as Ginu Vanu suggested, you happen upon the remains of a recently deceased wamoura, saving you the trouble of slaying one yourself. Head further south to Provenance and use the wamoura meat to lure out two tsanahales.","No sooner do you arrive at Provenance than two tsanahales attack, lured by the scent of the wamoura meat. You make swift work of them to acquire all that you need to trade with the Rose Knights. Travel to Camp Cloudtop and see about making a trade for nails.","You present Fabrellet with the Gundu's trade proposition. Seeing the fresh tsanahale meat, he agrees without a second thought. Handing over enough nails to meet any needs Ginu Vanu might have, he assures you that Camp Cloudtop would be more than willing to trade again in future. Return to Ok' Gundu Nakki with your hard-earned nails.","Ginu Vanu is taken aback by the quantity of steel nails the Rose Knights offered in exchange for meat. Now able to employ proper fasteners in his woodworking, Ginu Vanu is sure that any hut he builds will be capable of weathering even the harshest conditions."],"objectives":["Speak with Ginu Vanu.","Search south of Ok' Gundu Nakki for wamoura meat to use as bait.","Use the sliced wamoura to lure out two tsanahales and obtain their meat.","Exchange the tsanahale tendons at Camp Cloudtop for nails.","Deliver the Ishgardian steel nails to Ginu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Ah, <span class=\"highlight\">Forename</span>! Once again your help is sorely needed. Ginu Vanu is troubled with construction of huts. Perhaps netherling might ask what is delaying work?"},{"name":"GINUVANU","text":"Yes, construction takes much too long. But materials are terrible! Walls hold together with wood joints and tiny bones. But tiny bones are brittle, snap like twig under dhalmel's heel. We need good nails to hold walls."},{"name":"GINUVANU","text":"Netherling knights make hard, metal nails. Will netherling trade with them? Ginu Vanu suggests bartering with tsanahale meat."},{"name":"GINUVANU","text":"But tsanahale flesh spoils quickly. Flavor is gone in mere hours, like fleeting blossom of blooming daylily. Netherling must hunt tsanahales and deliver meat while still fresh."},{"name":"GINUVANU","text":"Healthiest and most delicious tsanahales are wary of any who approach. To find best prey, good bait is needed. To south of Ok' Gundu Nakki, find wamoura, favorite snack of tsanahales."},{"name":"GINUVANU","text":"Use meat of wamoura to catch them on small island netherling knights call Provenance. Meat from one tsanahale will give much for trade. But with meat from <span class=\"emphasis\">two</span>, netherling knights cannot refuse."},{"name":"GINUVANU","text":"Netherling can find scraps of wamoura meat to south of here. Many tsanahales will swarm, like moths to flame, but two should be enough."},{"name":"GINUVANU","text":"Yes, netherling knights will be very pleased. And huts need many, many nails. Be quick, netherling. Tsanahale meat must not spoil!"},{"name":"GINUVANU","text":"Netherling can find scraps of wamoura meat to south of here. Many tsanahales will swarm, like moths to flame, but two should be enough."},{"name":"GINUVANU","text":"Yes, netherling knights will be very pleased. And huts need many, many nails. Be quick, netherling. Tsanahale meat must not spoil!"},{"name":"FABRELLET","text":"You wish to trade for nails on behalf of the Gundu? If the exchange is fair, I see no reason not to oblige them. What do they have to offer?"},{"name":"FABRELLET","text":"Fresh meat from the tsanahale! It's been too long since the camp has seen anything so rich and flavorful. You have a deal. Should they have need of more supplies, tell them they're more than welcome to trade with us again. "},{"name":"FABRELLET","text":"A reprieve from the salted meats delivered from Ishgard is always welcome. I can only hope the Gundu choose to trade with us more often. "},{"name":"GINUVANU","text":"Were netherling knights happy to take meat? Do they accept trade for metal nails?"},{"name":"GINUVANU","text":"Oh! Ginu Vanu did not expect to get so many! Now Gundu huts will be strong like great oak, weathering even fiercest storms."},{"name":"GINUVANU","text":"Many thanks, netherling. If we need more supplies, Ginu Vanu will remember tsanahale meat fetches high price from netherling knights."}],"reward":{"gil":665,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016092","obj":{"i":1016092,"n":"Ginu Vanu","l":2100,"q":6}},{"type":"npc","id":"1012054","obj":{"i":1012054,"n":"Fabrellet","l":2100,"q":6}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}