{"quest":{"name":"Gaelicat's Out of the Bag","location":"The Sea of Clouds","id":67728,"patch":3.1,"sort":44,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016092,"involved":[1016231,1016232,1016233,1016374,1016375],"genre":45,"journal":["Muna Vanu looks happy to see you.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu says Ginu Vanu has been looking for you for a task that involves quick reflexes.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Ginu Vanu has requested that you bring him a clowder of gaelicats, hale and hearty. Handing over the Gundu tribe's “secret dried herb,” he asks you to search the areas around Camp Cloudtop for the flying felines and capture five.","You have successfully captured the gaelicats, which are now writhing and purring pleasantly in your sack. Return to Ok' Gundu Nakki and deliver the precious cargo to Ginu Vanu.","After traversing the large swaths of land around Camp Cloudtop to retrieve a sackful of euphoric gaelicats, you hand them over to a satisfied Ginu...who intends to release them back to the sky as per the Gundu nest-building custom."],"objectives":["Speak with Ginu Vanu.","Capture stray gaelicats using the dried cloudcrawler.","Deliver the clowder of gaelicats to Ginu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Ah, netherling graces us with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> presence!  "},{"name":"MUNAVANU","text":"Ginu Vanu has been looking for netherling. He busily prepares nests for first roost and says he is in need of netherling's strong, firm grip and movement fast as lightning."},{"name":"GINUVANU","text":"Netherling always comes at right time, like raindrops falling on wilted leaves. Will <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> help Ginu with very important task?"},{"name":"GINUVANU","text":"Ginu is so very busy, fluffing up newly built nests for new life on Ok' Gundu Nakki. He needs netherling to bring him gaelicats to complete nests. But make sure cats are <span class=\"emphasis\">unharmed</span>. They must be happy, full of life! If netherling brings dead gaelicats, Ginu feels downpour of sadness."},{"name":"GINUVANU","text":"Ginu gives you Gundu tribe's secret dried herb to catch flying cats easily. If netherling holds this under gaelicat's nose, it becomes happy...<span class=\"emphasis\">very</span> happy. Five cats should be enough for Ginu to complete nests. Now, go, netherling! Zephyr winds at your back!"},{"name":"GINUVANU","text":"Only gaelicat knows why herb makes him happy. Clear as sunlight, Ginu knows herb has no effect on him."},{"name":"GAELICAT02192","text":"Hisss!"},{"name":"SYSTEM","text":"The stray gaelicat bristles its fur. "},{"name":"GAELICAT02192","text":"Mew mew... Purrr..."},{"name":"SYSTEM","text":"You capture an intoxicated gaelicat!"},{"name":"GINUVANU","text":"Has netherling brought what Ginu asks? No scratches? No bruised wings?"},{"name":"GINUVANU","text":"Ah, yes! Gaelicats roll warmly like distant thunder on summer night! Much thanks to netherling for bringing good stock!"},{"name":"GINUVANU","text":"What do gaelicats have to do with building nests, netherling asks? Tradition! When nests complete for roosting, start of new life follows the path wind blows."},{"name":"GINUVANU","text":"Gaelicats are lucky, know very well of which wind bodes good fortune. So Ginu releases gaelicats back to sky to show which way nest should face. If cats fly west, nest faces west! If cats scatter to four corners...well, any direction is good direction!"}],"reward":{"gil":709,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":4,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016092","obj":{"i":1016092,"n":"Ginu Vanu","l":2100,"q":6}},{"type":"npc","id":"1016231","obj":{"i":1016231,"n":"Stray Gaelicat","l":2100,"q":1}},{"type":"npc","id":"1016232","obj":{"i":1016232,"n":"Stray Gaelicat","l":2100,"q":1}},{"type":"npc","id":"1016233","obj":{"i":1016233,"n":"Stray Gaelicat","l":2100,"q":1}},{"type":"npc","id":"1016374","obj":{"i":1016374,"n":"Stray Gaelicat","l":2100,"q":1}},{"type":"npc","id":"1016375","obj":{"i":1016375,"n":"Stray Gaelicat","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}