{"quest":{"name":"An Overgrown Ambition","location":"The Dravanian Hinterlands","id":67738,"patch":3.1,"sort":6010,"icon":112116,"unlocksFunction":1,"eventIcon":71341,"issuer":1016112,"target":1016110,"involved":[1012133,1016109],"genre":99,"journal":["The tetchy treasure hunter has the look of a woman who has seen rather too many morbols.","You come across a terrified and bedraggled treasure hunter who explains that she has just escaped certain death at the claws of the seedkin hordes infesting Saint Mocianne's Arboretum. Within the ruins lies a treasure apparently worth risking life and limb over, and she asks that you aid her companions in obtaining it. Speak with the treasure hunter named Sawney in front of the Arboretum to join the search.","Sawney claims that the treasure he and his fellows seek within the Arboretum could benefit the residents of Idyllshire for years to come. Unfortunately, they lack the strength to fend off the beasts prowling the ruins where their prize presently rests. Eager to secure your aid in eliminating the creatures, Sawney offers to let you keep anything you find along the way. Venture into Saint Mocianne's Arboretum and clear a path for the treasure hunters so that they may search the ruins unimpeded.<br><br>※Saint Mocianne's Arboretum can be accessed via the Duty Finder.","You have fought your way through an army of Eorzea's flora and fauna, letting Sawney and his team search the Arboretum at their leisure. Return to the Dravanian hinterlands to see if their efforts bore any fruit.","You find Sawney waiting for you outside the Arboretum. He happily exclaims that thanks to your efforts his fellows were able to find the object they sought without further incident. He then asks that you return with him to Idyllshire and report your success to Midnight Dew. Perhaps you will finally find out what the treasure hunters were so eager to obtain from the overgrown ruins.","Sawney regales Midnight Dew with the tale of your brave foray into the Arboretum, and at last reveals the “treasure” he sought to be the seeds of specially cultivated crops. Midnight Dew hopes to use them to start a new industry in Idyllshire, and thereby free the settlement of its reliance on an ever-diminishing supply of Sharlayan junk. Even as Sawney departs to plant his treasure, you are cordially invited to visit Idyllshire in the near future to sample the bountiful harvest that the seeds will inevitably produce."],"objectives":["Speak with Sawney at Saint Mocianne's Arboretum.","Enter Saint Mocianne's Arboretum.","Speak with Sawney outside of Saint Mocianne's Arboretum.","Speak with Sawney in Idyllshire."],"dialogue":[{"name":"TREASUREHUNTER02202","text":"&lt;pant&gt; &lt;pant&gt; What? &lt;gasp&gt; There's one behind me, isn't there!? ...No? Thank the gods. I've done enough running for one day. &lt;sigh&gt; Those godsdamned beasts came out of nowhere. It's a wonder we made it out alive."},{"name":"TREASUREHUNTER02202","text":"But we can't just leave the treasure there... Hmm...you look like the sort that's used to risking life and limb. Might be as you could help clear a way through those seedkin that damn near made a meal of us."},{"name":"TREASUREHUNTER02202","text":"We'd see that it was worth your while, of course... If you're interested, let my friend Sawney know. He should be somewhere near the entrance to Saint Mocianne's Arboretum."},{"name":"TREASUREHUNTER02202","text":"Well, I reckon it's safe to go back to Idyllshire and look for a few more hands. We'll need as much help as we can get. Hope to see you at the Arboretum!"},{"name":"SAWNEY","text":"You're here to help with the seedkin infestin' the Arboretum? Thank the gods, we've not the numbers to venture into there ourselves."},{"name":"SAWNEY","text":"They used to research plant life from every corner of the realm here, you know. 'Course, with no one to look after it, it's all gotten a bit...overgrown."},{"name":"SAWNEY","text":"Usually, places like this're more trouble than they're worth, but if the parchments we found are anythin' to go by, there's somethin' in these ruins that could benefit everyone in Idyllshire for generations to come. A proper priceless treasure..."},{"name":"SAWNEY","text":"And it goes without sayin' that a site as old as this is sure to be stuffed with all sorts of precious relics─which you'd be welcome to keep if you help beat a path for us. We'll follow behind you once it's safe and see if we can't find what we're lookin' for."},{"name":"SAWNEY","text":"The ruins're bound to be filled with relics that'd satisfy even the most discernin' treasure seeker. And they'd be yours to keep─providin' you rid the area of beasts for us, like."},{"name":"SAWNEY","text":"Ha ha! I knew the thought of the Arboretum's treasures would be enough to get your juices flowin'!"},{"name":"SAWNEY","text":"Thanks to all the prunin' you did for us, we were able to have a good look around the ruins. And it didn't take us long to find what we were after!"},{"name":"SAWNEY","text":"Oh, I can't wait to tell Midnight Dew the good news! Speakin' of which─would you mind comin' with us to Idyllshire? Midnight Dew'll want to thank you personally, and I daresay even an adventurer like you would be interested in our finds."},{"name":"MIDNIGHTDEW","text":"You're a sight for sore eyes, adventurer! Now, I'd love to chat, but Sawney seemed eager to have a word with you about somethin' or other. Mayhap we can speak later."},{"name":"SAWNEY","text":"Ah, you've come at last, adventurer. Well, let's give Midnight Dew the good news!"},{"name":"MIDNIGHTDEW","text":"Now that's the endin' I wanted to hear! Let's hope these seeds live up to their reputation!"},{"name":"MIDNIGHTDEW","text":"What fruit do you reckon they'll bear, adventurer?"},{"name":"MIDNIGHTDEW","text":"...Somethin' wrong? You seem surprised. Sawney, you <span class=\"emphasis\">did</span> tell our friend here what you were lookin' for, didn't you?"},{"name":"SAWNEY","text":"Ah... Now that I come to think of it, that little detail might've slipped my mind..."},{"name":"SAWNEY","text":"You see, the “treasure” we were lookin' for was seeds and sprouts that were cultivated specially by the Sharlayans. Years of research went into breedin' 'em, apparently, and they produced plants like you wouldn't believe."},{"name":"MIDNIGHTDEW","text":"As of now, Idyllshire's main industry is collectin' the junk left behind by the Sharlayans. But it won't last forever."},{"name":"MIDNIGHTDEW","text":"Which is why it's important we find a new way to make ends meet, 'fore we end up with nothin' left to trade. Acquirin' those sprouts and seeds was the first step to accomplishin' that goal."},{"name":"SAWNEY","text":"If we can find crops that'll flourish in this land's changeable climes, we'll have a new industry that should keep Idyllshire goin' for generations to come."},{"name":"SAWNEY","text":"Well, these seeds ain't goin' to plant themselves, so I'd best be about it. Somethin' tells me growin' 'em'll make gettin' 'em seem easy!"},{"name":"MIDNIGHTDEW","text":"It'll take a few moons, 'tis true, but I look forward to seein' those seeds bear fruit. Make sure to visit us from time to time, adventurer. One day, we'll treat you to a feast grown by our own hands!"}],"reward":{"gil":5000,"xp":0,"instance":41},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67205]},"next":[68678]},"partials":[{"type":"npc","id":"1016112","obj":{"i":1016112,"n":"Tetchy Treasure Hunter","l":2001,"q":1}},{"type":"npc","id":"1016110","obj":{"i":1016110,"n":"Sawney","l":2082,"q":1}},{"type":"npc","id":"1012133","obj":{"i":1012133,"n":"Midnight Dew","l":2082,"q":12}},{"type":"npc","id":"1016109","obj":{"i":1016109,"n":"Sawney","l":2001,"q":1}},{"type":"instance","id":"41","obj":{"i":41,"n":"Saint Mocianne's Arboretum","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":170,"max_ilvl":240}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"68678","obj":{"i":68678,"n":"Secret of the Ooze","g":103,"l":"Rhalgr's Reach","s":10022,"f":1}}]}