{"quest":{"name":"Dance Commander","location":"The Sea of Clouds","id":67733,"patch":3.1,"sort":61,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016088,"involved":[1016362,1016363,1016364,1016365],"genre":45,"journal":["Muna Vanu is practicing his moves.<br>※The difficulty of this quest will be synced to your current level.","As his responsibilities to the tribe grow, the time Muna Vanu has to devote to practicing the sundrop dance dwindles. Linu Vanu seems insistent that all Gundu perfect this dance─a dance you yourself have mastered. Speak with him and see what you can do to help.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Linu Vanu explains that the sundrop dance acts as a show of force, through which the Gundu keep the Vundu intimidated, securing their independence. But the elders grow older, and the youths that stand up to take their place fail to carry out the dance with the same strength and energy. Your performance, however, is an exemplar of all that the sundrop dance represents. Linu Vanu asks that you find the Gundu youths that are practicing at Hengr's Crucible. Show them the marvel of a well-executed sundrop dance, and ignite the spark of passion in them.","Your dancing serves as a shining beacon of inspiration to all fortunate enough to witness it. The youths of Ok' Gundu Nakki are filled with a renewed passion to refine their performances and show the Vundu that they are not to be trifled with. Report back to Linu Vanu with this encouraging news.","Linu Vanu is relieved to hear that you were able to fire up his clansmen so well. He tells you that, since the Gundu have so few warriors compared to the Vundu, they cannot hope to win a direct confrontation. Their only hope is to avoid all-out war by intimidating the enemy with their fearsome sundrop dance. Thanks to you, it seems this strategy remains viable."],"objectives":["Speak with Linu Vanu.","Demonstrate the /sundropdance to the Gundu youths.","Report to Linu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Hup, hup, hup... Oh! <span class=\"highlight\">Forename</span>! Muna Vanu embarrasses himself! He does not realize netherling watches him like this!"},{"name":"MUNAVANU","text":" We must all perfect mighty sundrop dance, and ideal dance requires good rhythm. We practice daily, but Muna Vanu's responsibilities grow and grow, like weeds upon untended field. With no time to practice, Linu Vanu berates me, says my timing is poor!"},{"name":"MUNAVANU","text":"He berates us all, but <span class=\"highlight\">Forename</span> performs sundrop dance as skillfully as our fiercest warriors. Better, even, than Muna Vanu! Please, help us. Speak to Linu Vanu and see what can be done."},{"name":"LINUVANU","text":"Arrival of <span class=\"highlight\">Forename</span> is as welcome as cool breeze on hot summer afternoon. Netherling offers to help Gundu yet again? An offer most welcome."},{"name":"LINUVANU","text":"To demonstrate power, we perform sundrop dance. We let Vundu see that we are force to be reckoned with. But lately dances lack strength, lack coordination, lack <span class=\"emphasis\">power</span>. Gundu nestlings lose heart..."},{"name":"LINUVANU","text":"But if they see netherling perform sundrop dance with spirit and fervor, they are inspired to greatness! Find nestlings stationed at Hengr's Crucible, and show them all marvelous <span class=\"highlight\">sundrop dance</span>. Inspire them!"},{"name":"LINUVANU","text":"Our nestlings lose hope. But if they see netherling's supreme <span class=\"highlight\">sundrop dance</span>, they will know─if netherling can perfect dance, then they, with blood of Gundu coursing through veins, can perfect it too."},{"name":"GUNDUA02197","text":"Hup, hup, hah...? Hiyah...? No, no, no... How can I practice sundrop dance when I cannot remember moves!? If only I have example to follow..."},{"name":"GUNDUA02197","text":"This dance─it is perfect! Netherling's moves are smooth and certain, like flowing water. I am inspired! I too shall perfect sundrop dance and strike fear into hearts of savage Vundu!"},{"name":"GUNDUB02197","text":"&lt;huff&gt; Stupid...&lt;huff&gt;...sundrop dance...&lt;pant&gt;... I never want to practice it again!"},{"name":"GUNDUB02197","text":"Netherling's dance is powerful and beautiful, like tornado on evening horizon. If I dance like this, girls of Ok' Gundu Nakki cannot hold themselves back!"},{"name":"GUNDUC02197","text":"Left wing...up. Right wing...down... Motion is easy, but how can dance have power? How can I give dance <span class=\"emphasis\">spirit</span>?"},{"name":"GUNDUC02197","text":"Yes! Yes! Netherling's dance wells with power and spirit. I follow your example, and shall become inspiration to Gundu."},{"name":"GUNDUD02197","text":"Like this...? No. Like...this! Hmmm. That is not it either. Why must sundrop dance be so <span class=\"emphasis\">difficult</span>!?"},{"name":"GUNDUD02197","text":"Like rays of sun, illuminating islands at dawn, netherling's energy shines strong and clear! I think I have it. I think I understand the dance! I make new start, at new practice place."},{"name":"LINUVANU","text":"Enthusiasm of <span class=\"highlight\">Forename</span> inspires and motivates nestlings of Ok' Gundu Nakki. They practice sundrop dance with newfound zeal!"},{"name":"LINUVANU","text":"<span class=\"highlight\">Forename</span> has Linu Vanu's gratitude. We do not have as many warriors as Vundu. We cannot afford to fight directly. But if all Gundu warriors perform sundrop dance with same ardor as netherling, no tribe dares challenge us!"}],"reward":{"gil":637,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"npc","id":"1016362","obj":{"i":1016362,"n":"Gundu Youth","l":2100,"q":1}},{"type":"npc","id":"1016363","obj":{"i":1016363,"n":"Gundu Youth","l":2100,"q":1}},{"type":"npc","id":"1016364","obj":{"i":1016364,"n":"Gundu Youth","l":2100,"q":1}},{"type":"npc","id":"1016365","obj":{"i":1016365,"n":"Gundu Youth","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}