{"quest":{"name":"Things Are Getting Sirius","location":"Limsa Lominsa","id":67737,"patch":3.1,"sort":600,"icon":112117,"unlocksFunction":1,"eventIcon":71341,"issuer":1003550,"target":1016104,"involved":[1016103,1016105],"genre":91,"journal":["Trachraet has some worrying news concerning Pharos Sirius.","Trachraet informs you that a kobold invasion has forced a group of smiths from Naldiq and Vymelli's to abandon their work on Pharos Sirius, to the great annoyance of Master Mimidoa. While it remains unclear how or why the beastmen ventured to the Isles of Umbra, it is abundantly clear they are up to no good. Seek out the storm flyer at the airship landing for further instructions.","At your request, the storm flyer relays Mimidoa's account of the attack. Apparently, the old smith is convinced the kobolds intend to blow up the lighthouse, having seen them scatter volatile bombs in the tunnels beneath the tower's foundation. With the livelihood of western La Noscea's inhabitants hanging in the balance, Maelstrom Command asks that you enter the tower by airship and defuse the kobolds' explosive plot before Aleport's shores are choked with debris.<br><br>※Pharos Sirius (Hard) can be accessed via the Duty Finder.","You have cleared Pharos Sirius of the incendiary surprises left by the kobolds. Report to the storm flyer in western La Noscea, and confirm that all went as planned.","You return to find Maelstrom troops hurrying to clear the debris left by the kobolds, and rid the area of any remaining beastman invaders. While you discuss their progress with the storm flyer in charge, a private approaches you bearing a curious nautical knife carved with the sigil of Diamanda of Naldiq and Vymelli's, which was apparently discovered during a preliminary search of the area. With much still to be done, the storm flyer asks you to go to Aleport in her stead and hand the knife over to Trachraet, who will shortly be meeting with the smiths to relay the news of the lighthouse's reclamation.","The blunt whittle turns out to be a personal effect of Diamanda's late brother Symond. The sight of it stokes the flames of resolve in the heart of the young smith, who vows to turn the forsaken lighthouse into a place to honor the lost. Your duty done, you take your leave, certain that Pharos Sirius will soon be restored to its former glory."],"objectives":["Speak with the storm flyer at the airship landing.","Enter Pharos Sirius (Hard).","Report to the storm flyer at the entrance of Pharos Sirius.","Give the blunt whittle to Trachraet in Aleport."],"dialogue":[{"name":"TRACHRAET","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>─perfect timin' as always. We're in need o' yer talents to deal with some trouble brewin' over on the Isles of Umbra."},{"name":"TRACHRAET","text":"Seems a pack o' kobolds've made a grab for Pharos Sirius. The smiths workin' on the restoration barely made it out alive."},{"name":"TRACHRAET","text":"Maelstrom Command's drawin' up plans to take back the tower, with Master Mimidoa advisin' on 'ow things stand on the ground. But when they asked 'im for 'is opinion, 'e kept goin' on an' on about some adventurer from long past that 'elped 'im drive off a siren from the same spot."},{"name":"TRACHRAET","text":"Now, no disrespect to the old fella, but 'e don't 'ave the firmest grasp on what 'appened when, so we couldn't 'elp wonderin' if maybe 'is 'ero o' yore was none other than yer fine self─you bein' a siren slayer an' all. So what d'ye say? Willin' to lend us an 'and relightin' the beacon?"},{"name":"TRACHRAET","text":"I knew I could count on ye! One of our storm flyers is makin' the final preparations at the airship landin' right now. Tell 'er Trachraet sent ye and she'll give ye the particulars."},{"name":"TRACHRAET","text":"One of our storm flyers is waitin' to brief you at the airship landin'. I'd get goin' if I were you... Master Mimidoa ain't the most forgivin' soul at the best o' times─an' when 'is precious restoration's at stake, well...it very much <span class=\"emphasis\">ain't</span> the best o' times, savvy?"},{"name":"MASTERSERGEANT02201","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>, we are honored to have you with us. The situation is developing even as we speak, but I will do my best to explain what we know."},{"name":"MASTERSERGEANT02201","text":"According to Master Mimidoa, he and his fellow smiths barely escaped with their lives when the kobolds began scattering bombs around the lighthouse's foundations."},{"name":"MASTERSERGEANT02201","text":"He believes the beastmen intend to blow Pharos Sirius to pieces, thus disrupting our most vital supply route to and from western La Noscea. Needless to say, they cannot be permitted to succeed. We must act swiftly, before wrecks begin to pile up around Aleport."},{"name":"MASTERSERGEANT02201","text":"That is where you come in. The kobolds have sealed off the ground entrance, so we propose to take you to the top of the tower by airship. Once there, you will proceed inside and see to the bombs, along with any kobolds you encounter. The Maelstrom will then bring up the rear, and secure the area."},{"name":"MASTERSERGEANT02201","text":"Before we proceed, I must stress the need for caution. Master Mimidoa suspects that if the kobolds are bent upon destroying Pharos Sirius, they will have more than a handful of flaming voidsent at their disposal. One inopportune explosion could set the restoration back by moons, if not years."},{"name":"MASTERSERGEANT02201","text":"You know as well as I do how volatile bombs can be. If we are to save the beacon, we had best leave soon."},{"name":"MASTERSERGEANT02201","text":"There is no telling when the kobolds' bombs will explode. Pray board the airship the instant you are ready."},{"name":"TRACHRAET","text":"Talk to the storm flyer at the airship landin'. She'll take ye where ye need to go."},{"name":"TRACHRAET","text":"Ah, yer back! An' since ye seem to be in one piece, I'm guessin' the mission was a success. I'd best be headin' off to Aleport to tie up the loose ends on Maelstrom Command's side o' things."},{"name":"MASTERSERGEANT02201","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>, you've returned!"},{"name":"MASTERSERGEANT02201","text":"You had us worried for a moment there! We heard an awful rumbling coming from deep underground and feared the worst!"},{"name":"MASTERSERGEANT02201","text":"My men have concluded a preliminary sweep of the lighthouse, and dismantled the remains of the bomb incubators. It would seem the beastmen have abandoned the tunnels directly beneath the tower. We have sent scouts in to pursue them, but the passages stretch farther than expected..."},{"name":"MESSENGER02201","text":"(-???-)Pardon the interruption..."},{"name":"MESSENGER02201","text":"While we was securin' the interior, we found this old seafarer's knife lyin' on the floor, and one of the lads noticed it'd got the sigil of Diamanda of Naldiq and Vymelli's carved into the handle."},{"name":"MASTERSERGEANT02201","text":"I see. Well, if anyone can tell us who the knife belongs to, I suppose it would be the smith who crafted it."},{"name":"MASTERSERGEANT02201","text":"Yet I cannot seek her out until the tunnels have been secured...<br>I have another <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\">task for you,  <span class=\"highlight\">Surname</span></span><span class=\"alternative\">favor to ask, <span class=\"highlight\">Forename</span></span></span>. Would you mind delivering the knife to Lieutenant Trachraet in Aleport on my behalf? He is due to meet with the artisans of Naldiq and Vymelli's shortly."},{"name":"MASTERSERGEANT02201","text":"I expect he will be waiting at the docks. Do not concern yourself about the tunnels─we will find out where they lead, however far they go.<br>On behalf of the Maelstrom, I thank you for your aid in reclaiming the lighthouse. Fortune go with you...till sea swallows all!"},{"name":"MASTERSERGEANT02201","text":"Lieutenant Trachraet will soon be meeting with the smiths. Pray make for Aleport at once."},{"name":"TRACHRAET","text":"Ah, yer back! An' since ye seem to be in one piece, I'm guessin' the mission was a success. I'd best be headin' off to Aleport to tie up the loose ends on Maelstrom Command's side o' things."},{"name":"TRACHRAET","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>, I just 'eard the good news. By Llymlaen's blessed light, ye did it! Ye saved Pharos Sirius!"},{"name":"TRACHRAET","text":"Oh, what's this?"},{"name":"TRACHRAET","text":"...I see. Well, I'll be sure to ask 'er about it. Ah, speak o' the devil!"},{"name":"MIMIDOA","text":"Oi! Wossname! Red coat! 'Ow long do I 'ave to rot in the tavern before yer boys send them shite-eatin' kobold bastards packin', eh? Much more o' this an' me 'ammerin' arm'll be as soft as me lily-white arse."},{"name":"TRACHRAET","text":"A terrifyin' prospect, an' no mistake. Luckily, it ain't one we need to worry about, though, 'cos we've taken Pharos Sirius back. An' after the wallopin' our mate 'ere gave 'em, them kobolds'll know to keep their grubby paws to 'emselves in future─meanin' you can get back to restorin' the place in peace!"},{"name":"TRACHRAET","text":"Miss Diamanda, while the lads were searchin' the lighthouse, they found summat that might interest you."},{"name":"TRACHRAET","text":"Does this 'ere seafarer's whittle look familiar?"},{"name":"DIAMANDA","text":"All too familiar...though it didn't look so worn down when I last saw it. I made this for Symond before he set sail three years ago. It was my first piece as a full-fledged smith."},{"name":"TRACHRAET","text":"Symond? As in, Captain Symond from Maelstrom Command?"},{"name":"DIAMANDA","text":"The same. I never meant for it to be a farewell present. But knowing he used it often, and kept it with him to the last... Well, it means a lot."},{"name":"DIAMANDA","text":"Master Mimidoa, I think it's a sign. Why else would my first piece be returned to me but to show me how far I've come? Just seeing it makes me want to restore the lighthouse to its former glory even more─to make it into a place to <span class=\"emphasis\">honor</span> the lost, rather than a place to grieve for them."},{"name":"MIMIDOA","text":"Aye, lass, that's the way. There's things we all of us would sooner forget, but rememberin' 'em's what makes us stronger."},{"name":"MIMIDOA","text":"Wouldn't you agree, 'nitiate? Hmm...speakin' of rememberin', you remind me o' someone. Somethin' about the eyes... Oh, aye! Yer the spittin' image of a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> as once helped me drive back an army o' the undead. A right tough bugger, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was. Like you, only taller."},{"name":"MIMIDOA","text":"Never did find out what happened to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, but lookin' at you, I'm guessin' <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> settled down an' <span class=\"alternative-container\"><span class=\"alternative\">squeezed out a few young'uns</span><span class=\"alternative\">sired himself an heir or two</span></span>. Ahh, it brings a tear to me eye seein' you carryin' on the family tradition. I'm much obliged to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Much obliged!"},{"name":"DIAMANDA","text":"I can't thank you enough for saving the lighthouse. If it hadn't been for you, all of our hard work would have been for naught."},{"name":"DIAMANDA","text":"But I for one mean to make the most of this reprieve. I swear to you on my brother's memory: when we've finished with Pharos Sirius, it will serve as more than just a guiding light to safe waters...it will lead the souls of those lost at sea back to familiar shores."},{"name":"TRACHRAET","text":"Some folk see Pharos Sirius as a cursed reminder o' the Calamity, while others see it as a monument to Limsa's golden age. But I'll bet it means more to them pair than everyone else in La Noscea put together. An' someday they'll show the world 'ow it looks to them─like a beacon of 'ope."},{"name":"TRACHRAET","text":"I realize I still ain't thanked ye properly for givin' us an 'and with all this. 'Ardly needs sayin', I s'pose, but the Maelstrom couldn't've done it without ye. You can leave the rest to us, though─we'll see that the smiths don't get disturbed again.<br>Until next time, then, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>!"}],"reward":{"gil":5000,"xp":0,"instance":40},"reqs":{"jobs":[{"lvl":60,"id":34}],"questsType":"all","quests":[67205,66745]}},"partials":[{"type":"npc","id":"1003550","obj":{"i":1003550,"n":"Trachraet","l":28,"q":8,"t":"Storm Lieutenant"}},{"type":"npc","id":"1016104","obj":{"i":1016104,"n":"Trachraet","l":33,"q":1,"t":"Storm Lieutenant"}},{"type":"npc","id":"1016103","obj":{"i":1016103,"n":"Storm Flyer","l":28,"q":1}},{"type":"npc","id":"1016105","obj":{"i":1016105,"n":"Storm Flyer","l":33,"q":1}},{"type":"instance","id":"40","obj":{"i":40,"n":"Pharos Sirius (Hard)","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":170,"max_ilvl":240}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"66745","obj":{"i":66745,"n":"Why So Sirius","g":91,"l":"Western La Noscea","s":500,"f":1}}]}