{"quest":{"name":"Electric Gunduloo","location":"The Sea of Clouds","id":67734,"patch":3.1,"sort":62,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016088,"involved":[1016239,1016240,1016241],"genre":45,"journal":["Muna Vanu would have you assist his tribesmen.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu tells you that Linu Vanu has been seeking you, with an aim to enlisting your assistance. Speak with him and find out what he needs help with.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You learn that the Vundu are training strong and skilled warriors whose prowess in the Vanu Vanu sundrop dance grows more daunting by the day. He bids you seek these threats out, and intimidate them with your own rendition of the dance, that they might lose faith and abandon their training.","You awe the young Vundu dancers with your impeccable dancing capabilities. Not one of the warriors holds his ground before your terrifying display. Report back to Linu Vanu and tell him that the Vundu whelps have been put in their place.","Linu Vanu is greatly relieved to hear that the Vundu dancers have been dealt with before they could pose a real and certain threat to the safety of his people. While thankful that his tribe has your strength to draw on, he resolves to also work on refining his own dancing abilities, to better serve in his tribe's protection."],"objectives":["Speak with Linu Vanu.","Overwhelm the Vundu dancers with the /sundropdance.","Report to Linu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Greetings, <span class=\"highlight\">Forename</span>! Linu Vanu searches for you!"},{"name":"MUNAVANU","text":"No doubt he wishes to ask netherling's help. Please seek Linu Vanu, and find out what he wants."},{"name":"LINUVANU","text":"How fortunate─just as Linu Vanu seeks <span class=\"highlight\">Forename</span>, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> arrives! I wish to borrow skills of netherling that perfected mighty sundrop dance!"},{"name":"LINUVANU","text":"We hear rumors that the Vundu train powerful warriors, whose command of sundrop dance rivals even our greatest dancers. This must not be! This menace must be stopped before it grows too strong."},{"name":"LINUVANU","text":"Please seek out Vundu dancers and show them full glory of Gundu <span class=\"highlight\">sundrop dance</span>. Make them know folly of daring to eclipse us!"},{"name":"LINUVANU","text":"Go to Vundu village! Show them mighty <span class=\"highlight\">sundrop dance</span> and let them cower, like new-hatched nestlings trembling before booming thunderstorm!"},{"name":"VUNDU02198","text":"This is Vundu land─begone! Netherling like you has no right to stand before mighty Vundu sundrop dancer!"},{"name":"VUNDU02198","text":"Wh-What!? Mere netherling masters sundrop dance!? <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> piercing gaze, sharper than claws of fiercest anzu... <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> commanding presence, overpowering like devastating gale..."},{"name":"VUNDU02198","text":"I can stand it no longer!"},{"name":"VUNDU02198","text":"Hmph! What brings netherling to Ok' Vundu? Foolish thing like you─who knows not even the sundrop dance─is not safe here."},{"name":"VUNDU02198","text":"But─but netherlings cannot perform so flawless a dance! It is not possible!"},{"name":"VUNDU02198","text":"<span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> style is impetuous! <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> defense is impregnable! I must retreat!"},{"name":"VUNDU02198","text":"Netherling approaches, but does not attack? Does <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> plan to challenge great Vundu with sundrop dance!?"},{"name":"VUNDU02198","text":"Such masterful dancing. I cannot believe it! Its power washes over me like endless torrent from vast waterfall!"},{"name":"VUNDU02198","text":"I cannot suffer this to be! Rage wells within me like great blazing furnace! Wait here, netherling! I return with most monstrous weapons I own and destroy you! "},{"name":"LINUVANU","text":"Word spreads fast, <span class=\"highlight\">Forename</span>─faster than herd of frightened dhalmels. Linu Vanu hears of netherling's victory over Vundu savages!"},{"name":"LINUVANU","text":"Through netherling's unrivaled power, Vundu threat is quashed before it can cause us real problems."},{"name":"LINUVANU","text":"You have Linu Vanu's thanks, <span class=\"highlight\">Forename</span>, and thanks of whole Gundu tribe. Linu Vanu fears even he might not stand up to netherling's fearsome sundrop dance... He must practice dancing himself, he thinks."}],"reward":{"gil":637,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"npc","id":"1016239","obj":{"i":1016239,"n":"Vundu Dancer","l":2100,"q":1}},{"type":"npc","id":"1016240","obj":{"i":1016240,"n":"Vundu Dancer","l":2100,"q":1}},{"type":"npc","id":"1016241","obj":{"i":1016241,"n":"Vundu Dancer","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}