{"quest":{"name":"The Cat's Meow","location":"The Sea of Clouds","id":67731,"patch":3.1,"sort":53,"interval":"daily","repeatable":1,"beast":6,"eventIcon":71222,"issuer":1016089,"target":1016088,"involved":[1011952,1016376,1016377,1016385],"genre":45,"journal":["Muna Vanu has a request to make of you.<br>※The difficulty of this quest will be synced to your current level.","Muna Vanu tells you that Linu Vanu has asked for your assistance. Speak with him to learn just what his request entails.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","In a bid to foster a spirit of cooperation between the Gundu and the nearby detachment of Ishgardian forces, Linu Vanu has prepared a gift of traditional Vanu Vanu catsfoot chews to present to them as an offer of goodwill. Rather than putting the knights on alert by having a Vanu approach their camp with the gifts, he asks that you deliver these presents to Laniaitte at Camp Cloudtop on the tribe's behalf.","Laniaitte thanks you for your gift, but suggests that it might be more appreciated by the tired and hungry knights out on patrol right now. Find them and deliver the catsfoot chews to them.","The knights under Laniaitte's command are delighted to receive the gifts you deliver. Report back to Linu Vanu and let him know that his gesture was well received.","Linu Vanu thanks you for your help. He explains that catsfoot chew was made using an ancient recipe passed down by his ancestors. Hopefully these gifts can come to represent another formative step in the development of amiable relations between the Gundu and Camp Cloudtop."],"objectives":["Speak with Linu Vanu.","Deliver the crone's catsfoot chews to Laniaitte at Camp Cloudtop.","Deliver the crone's catsfoot chews to the knights on patrol around Camp Cloudtop.","Report to Linu Vanu."],"dialogue":[{"name":"MUNAVANU","text":"Greetings <span class=\"highlight\">Forename</span>. Tribe requires netherling's aid in task only <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> can carry out. Go to Linu Vanu to learn details of task."},{"name":"LINUVANU","text":"Hello again, <span class=\"highlight\">Forename</span>. Linu Vanu wishes once again to borrow your aid in matter of grave import. Gundu wish to develop relations with netherling knights."},{"name":"LINUVANU","text":"Tribe wishes to form bonds much like it has with Zundu, to help bring prosperity in this new independence. Linu Vanu wishes to present gift to them."},{"name":"LINUVANU","text":"Sadly, any Gundu who goes now receives cold greeting. But you are trusted, and can deliver catsfoot chews as gifts from our tribe. Please, deliver these gifts to Laniaitte at Camp Cloudtop."},{"name":"LINUVANU","text":"Linu Vanu wishes he could be there when netherlings receive gifts. Take them to Laniaitte at Camp Cloudtop."},{"name":"LINUVANU","text":"Linu Vanu hopes for day he can deliver gifts in person. Until that day, we must place confidence in netherling's capable hands."},{"name":"LANIAITTE","text":"Gifts for the Rose Knights, you say? From the Gundu?"},{"name":"LANIAITTE","text":"Thank you for these, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. They look─and smell─absolutely delicious!"},{"name":"LANIAITTE","text":"I could never eat this all myself. The troops out on patrol are far more deserving of it. Please, do me one small favor and take it out to them. I have no doubt at all that they would be glad for the sustenance."},{"name":"LANIAITTE","text":"The knights have been out on patrol for some time now. They would all appreciate something to eat─especially something as delicious as authentic catsfoot chews."},{"name":"NEMUSOU02195","text":"...Wha─ Just resting my eyes, sir! ...Oh, you're not the commander! What? You have something for me?"},{"name":"NEMUSOU02195","text":"A gift from the Gundu!? And food, too! Thank the gods. Now I'll have the energy to get through the rest of my shift without dozing off."},{"name":"NEMUSOU02195","text":"That catsfoot chew was just delicious! But a full belly always makes me feel so sleepy... &lt;yawn&gt;"},{"name":"OKUSOU02195","text":"These patrol routes are far too long. We all end up so tired and hungry before we're finished, that if we ran into something dangerous, we'd be in no state to fend it off!"},{"name":"OKUSOU02195","text":"What, what? A gift from the Vanu Vanu? I do hope it's food. I hear Vanu cuisine must be tasted to be believed! ...And uh, besides, an army marches on its stomach, you know!"},{"name":"OKUSOU02195","text":"What did you say this was called? “Catsfoot chew”? Whatever the case, it's utterly marvelous. Do tell me where I can get more!"},{"name":"HIMASHOU02195","text":"The unparalleled honor of a sentinel─tirelessly guarding the Rose Knights from the greatest threats of the realm... Gods I'm so <span class=\"emphasis\">bored</span>."},{"name":"HIMASHOU02195","text":"Hm? The Gundu have sent <span class=\"emphasis\">me</span> a gift? Well, it smells decent enough. And it'll provide some distraction from the mind-numbing drudgery of watching nothing happen all day."},{"name":"HIMASHOU02195","text":"I know it's a <span class=\"emphasis\">good</span> thing that these patrols are so uneventful, but it's just so boring─it's driving me crazy."},{"name":"LINUVANU","text":"Ah, so gifts now rest in bellies of netherling soldiers? <span class=\"highlight\">Forename</span> has my heartfelt thanks."},{"name":"LINUVANU","text":"Netherling knights seem to love our food. So Linu Vanu makes catsfoot chews with ancient recipe passed down through generations. Fragrance is more heavenly than smell of newly cropped grain, or fresh-woven cloth drying in afternoon sun, and flavor is even better!"},{"name":"LINUVANU","text":"Gundu tribe thanks you again. Relationship between Camp Cloudtop and Gundu grows ever closer thanks to your efforts."}],"reward":{"gil":709,"reputation":50,"items":[{"num":15,"id":28},{"id":21074}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016089","obj":{"i":1016089,"n":"Muna Vanu","l":2100,"q":30}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"npc","id":"1011952","obj":{"i":1011952,"n":"Laniaitte","l":2100,"q":19}},{"type":"npc","id":"1016376","obj":{"i":1016376,"n":"Nodding-off Knight","l":2100,"q":1}},{"type":"npc","id":"1016377","obj":{"i":1016377,"n":"Unoccupied Knight","l":2100,"q":1}},{"type":"npc","id":"1016385","obj":{"i":1016385,"n":"Unnerved Knight","l":2100,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21074","obj":{"i":21074,"n":"Vanu Whitebone","l":1,"c":65055,"t":100}}]}