{"quest":{"name":"A Familial Resemblance","location":"Ishgard","id":67745,"patch":3.4,"sort":22,"icon":100589,"eventIcon":71221,"issuer":1015976,"target":1015976,"involved":[1017875,1017876,1017877,1017881,1017882,1017883,1018008,1018159,1018161,1018208],"genre":78,"journal":["Briardien is eager to continue his investigation.","Briardien declares that he will continue investigating your newest leads into the whereabouts of the missing Ulaa. In the meantime, he requests that you speak with some of the seminarians once more─namely Blaisie and the group she has been assisting with their own search. Though he is loath to admit it, the inspector seems to think that the youths may have noticed something you have overlooked thus far. But before you can learn what Blaisie knows, you will have to find her...","No one at the scholasticate seems to know exactly where Blaisie can be found, but a number of seminarians suggest that if you find Theomocent, she will not be far behind. As the young man is said to be somewhere in the vicinity of the Arc of the Venerable, that would seem to be the ideal location to begin your search.","You find Blaisie hiding behind a fountain, watching as Theomocent and his friends make their inquiries. Startled by your sudden appearance, she struggles to explain her behavior, but regains her composure upon realizing who you are. After introducing herself as Briardien's younger sister, she correctly deduces the purpose for which you have come and produces a scroll of considerable length containing countless testimonies she recently transcribed in an effort to ascertain the whereabouts of Ulaa.<br><br>Just as Blaisie is about to turn the scroll over to you, however, Theomocent, Leigh, and Crammevoix suddenly appear, and you find yourselves reviewing the many accounts together. Yet you are unable to read even half of Blaisie's accounts before Leigh grows frustrated at their apparent lack of relevant information. Whether or not they contain aught of value remains to be seen, but that is for Briardien to decide, as the seminarians are more than happy to let the inspector sift through the endless accounts in their stead.","Briardien's efforts have borne fruit, it would seem, as he reveals to you that the gentleman seeking cough medicine and the tavern patron who paid his debts are likely one and the same. Once a notorious thug, now ostensibly reformed, he is rumored to have come into money and now makes a living as a traveling merchant. Needless to say, the inspector has every intention of tracking this suspect down, but he requires more information─which you are more than happy to provide in the form of Blaisie's notes. Together, you review the testimonies and eventually conclude that Mestonnaux, a merchant, has been engaged in suspicious activities. Your next course of action is thus decided: you and Briardien are to spy upon Mestonnaux, and see if he leads you to your suspect."],"objectives":["Speak with the seminarians in the scholasticate.","Speak with Blaisie in the Pillars.","Deliver Blaisie's notes to Briardien at Saint Reymanaud's Cathedral."],"dialogue":[{"name":"BRIARDIEN","text":"Seeing how reluctant some of the citizens were to answer your questions, I believe it best for me to take over investigations in the Brume."},{"name":"BRIARDIEN","text":"As for you... Ah, yes. I am given to understand that Blaisie and her friends have been conducting their own investigation."},{"name":"BRIARDIEN","text":"Though I am loath to admit it, given the fact that they are seminarians, I should not be surprised if they have noticed something we overlooked..."},{"name":"BRIARDIEN","text":"You may as well go and see what Blaisie has learned. If you cannot find her at the scholasticate, I imagine someone can point you in the right direction."},{"name":"BRIARDIEN","text":"Time is of the essence, <span class=\"highlight\">Forename</span>, for we still cannot discount the possibility that the girl is in danger."},{"name":"ARCHOMBADIN","text":"Of course I don't know where she is. While I may be in charge of the dormitory, it is not my responsibility to hold the seminarians' hands or wipe their arses."},{"name":"LEBRASSOIR","text":"As you should well know, in light of recent events, Archombadin has not the luxury to concern himself with such trivialities."},{"name":"ARCHOMBADIN","text":"If you're here to ask after another seminarian, allow me to spare you the trouble─I don't know where anyone is or what they might be doing. Good day."},{"name":"LEBRASSOIR","text":"(Have you or the inspector managed to deduce anything from the book yet? Pray apprise me of your progress when you are able.)"},{"name":"RIGOROUSSTUDENT02207","text":"Blaisie? I haven't seen her all day. I expect she's gone out again with her friends to look for Ulaa."},{"name":"RIGOROUSSTUDENT02207","text":"I still don't understand why they bother. The girl's probably off gallivanting about with heretics and revolutionaries. Even if they find her, I doubt she'll want to return."},{"name":"RIGOROUSSTUDENT02207","text":"I'm sorry I could not be of any help. Rest assured, however, that if I do hear aught of Blaisie, I shall be sure to tell you."},{"name":"HARMLESSSTUDENT02207","text":"Hasn't she been following Theomocent around like a lost puppy this past fortnight? Find him and you'll probably find her, that's what I say."},{"name":"HARMLESSSTUDENT02207","text":"I don't know how he puts up with it, frankly. I suppose that, unlike <span class=\"emphasis\">some</span> of the seniors, he's simply too kind for his own good."},{"name":"HARMLESSSTUDENT02207","text":"Theomocent? I haven't the slightest idea where he could be..."},{"name":"JANCHETTE","text":"Oh, what with them both working to bring Ulaa back, Theomocent and Blaisie have had good reason to spend a great deal of time together."},{"name":"JANCHETTE","text":"These past few days they've been running around the city making inquiries. I wouldn't be surprised if that's what they were up to today."},{"name":"JANCHETTE","text":"Precisely where they might have gone, I cannot say. Mayhap one of the other seminarians might know?"},{"name":"GIRLFRIEND02207","text":"&lt;sigh&gt; That is a question I, too, would like to know the answer to. It feels as though we haven't spoken in ages!"},{"name":"GIRLFRIEND02207","text":"I did, however, overhear some of the other seminarians say that they saw Theomocent at the Arc of the Venerable. If so, Blaisie is certain to be close by."},{"name":"GIRLFRIEND02207","text":"If you hurry, you might still be able to catch them."},{"name":"THEOMOCENT","text":"Have you seen a young woman, small of stature, with auburn hair and pale blue eyes?"},{"name":"LEIGH","text":"And you're certain you've seen no one that fits that description?"},{"name":"CRAMMEVOIX","text":"'Tis a wonderful <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span> to enjoy a spot of reading outdoors. Why, I daresay it's nearly as lovely as you, my fair lady. Do you often come here to study?"},{"name":"BLAISIE","text":"Gah! Y-You startled me. I'm... I am here for Ulaa's sake, lest you wonder! This is all part of my investigation, I swear!"},{"name":"BLAISIE","text":"Wait, you're not a seminarian... And yet you seem so familiar. Ah, I know! You're my brother's associate!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"To whom might you be referring?"},{"name":"A1","text":"By brother, you mean...?"},{"name":"A1","text":"..."},{"name":"BLAISIE","text":"M-My apologies, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. With all the stories I've heard from Briardien about you, I'd forgotten I have yet to introduce myself. I'm Blaisie, Briardien's younger sister. A pleasure to meet you."},{"name":"BLAISIE","text":"My apologies, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. I suppose we have yet to be properly introduced. I'm Blaisie, Briardien's younger sister. It is a pleasure to finally meet you."},{"name":"BLAISIE","text":"...So he's sent you to see what I've learned? Then I'm afraid you'll be disappointed. I spent all <span class=\"alternative-container\"><span class=\"alternative\">day</span><span class=\"alternative\">night</span><span class=\"alternative\">morning</span></span> questioning merchants, watchmen, and random passersby, and they told me absolutely nothing of interest."},{"name":"BLAISIE","text":"I recorded their statements for good measure but, quite honestly, it was a waste of ink and paper."},{"name":"THEOMOCENT","text":"Blaisie! What are you doing here?"},{"name":"BLAISIE","text":"Theo! I...er...fancy meeting you here! I was just taking a moment to review these testimonies I had taken and thought to, um..."},{"name":"CRAMMEVOIX","text":"Ah, but of course! You then thought to come and share your findings with us."},{"name":"BLAISIE","text":"Y-Yes, that's it! While it might be a bit much, I wanted to make sure I did not omit a single word."},{"name":"THEOMOCENT","text":"By the Fury, Blaisie, this is over one hundred fulms long! I cannot even begin to imagine the amount of effort it took to organize all this information... It's incredibly heartening to know that there are others as dedicated as us to seeing Ulaa returned! Now, let's have a look, shall we?"},{"name":"THEOMOCENT","text":"“Investigation Log, Entry 1: Master of Ishgardian markets, Mistress Elaisse<br>Problems? Well, with this recent run of bad weather, we've had plenty. Why, just the other day my back started to give me trouble again, and I've had to hobble from place to place...”"},{"name":"THEOMOCENT","text":"“Investigation Log, Entry 2: House Fortemps steward, Honoroit<br>I cannot guarantee that this news will be great interest to you and yours, but a twelve-point proposal for the reformation of the inquisition has recently been tabled by Lord Artoirel in the House of Lords...”"},{"name":"THEOMOCENT","text":"“Investigation Log, Entry 10: Weaponsmith, Elbert<br>Ever since the blue bastard and his lapdog put an end to the war, profits have plummeted! I've had to sell my best stock for a fraction of its worth just to make ends meet...”"},{"name":"THEOMOCENT","text":"“Investigation Log, Entry 21: Carvery, Mestonnaux<br>I've barely enough time to fill my customers' orders, much less keep an eye out for foolish─”"},{"name":"LEIGH","text":"Godsdammit, Theo! That's enough! None of that rubbish is even remotely relevant!"},{"name":"THEOMOCENT","text":"Now, now, don't you think you're being a touch too hasty? We've not gotten even a third of the way through. We may yet learn something of value. Let's not dismiss Blaisie's hard work out of hand."},{"name":"BLAISIE","text":"Th-Thank you, Theo, for your kind words. I'm glad you think it may be of use..."},{"name":"LEIGH","text":"Fine. Let us briefly entertain this thought and say that <span class=\"emphasis\">something</span> in these notes will help us find Ulaa. How exactly do you propose that we determine what that is?"},{"name":"CRAMMEVOIX","text":"Leigh, Leigh. <span class=\"emphasis\">We</span> needn't do a thing. For though we may lack the skill to discern the relevant from the mundane..."},{"name":"CRAMMEVOIX","text":"...A certain inspector we know and love is a dab hand at such things, no?"},{"name":"THEOMOCENT","text":"But of course, Inspector Briardien! Brilliant idea, Crammevoix! <span class=\"highlight\">Forename</span>, if you would, take this scroll to him and see what he can make of it."},{"name":"LEIGH","text":"Hmph. I doubt even he could make heads or tails of this rubbish. In any event, it's out of our hands. We should continue with our search."},{"name":"BRIARDIEN","text":"We meet again. Doubtless you have much to share─I know I do."},{"name":"BRIARDIEN","text":"Do you recall Gibrillont's patron who recently paid off his debts and the gentleman attempting to attain cough syrups? Upon further investigation, it turns out they share one astoundingly similar facial feature: a pale, raised scar running from the top of their left cheekbone to their jaw."},{"name":"BRIARDIEN","text":"It so happens that this description also matches that of a notorious thug who was known to hang around outside taverns and harass patrons for coin─until an unexpected windfall saw his fortunes vastly improve."},{"name":"BRIARDIEN","text":"He is now rumored to make a living as a traveling merchant, though where he goes and what he sells, none can say. We shall find out in due time. But enough of my discoveries─what have you learned?"},{"name":"BRIARDIEN","text":"...By the Fury, this is longer than some scripture! And she compiled it all in less than a single day, you say? Remarkable..."},{"name":"BRIARDIEN","text":"“Investigation Log, Entry 1: Master of Ishgardian markets, Mistress Elaisse<br>Problems? Well, with this recent run of bad weather, we've had plenty. Why, just the other day my back started to give me trouble again, and I've had to hobble from place to place.”"},{"name":"BRIARDIEN","text":"“On the other hand, the Crozier has seen increased trading in oils, furs, and other goods folks begin to crave when it grows cold, so in that regard I can't complain...”"},{"name":"BRIARDIEN","text":"“Investigation Log, Entry 13: Purveyor of sundries, Pasdevillet<br>The other day, there was this one fellow who wanted to purchase robes for a young woman. A merchant, he said, but I've never known one who couldn't be bothered to haggle─not that I minded, of course!”"},{"name":"BRIARDIEN","text":"“Investigation Log, Entry 21: Carvery, Mestonnaux<br>I've barely enough time to fill my customers' orders, much less keep an eye out for foolish girls getting themselves into trouble.”"},{"name":"BRIARDIEN","text":"“Now, if you would excuse me, I really must be getting back to it. I'm expecting several regular customers any minute!”"},{"name":"BRIARDIEN","text":"“Investigation Log, Entry 47: Apothecary, Pienne<br>Mestonnaux has bought my whole stock of cough syrup every day for the past week. Passing strange, needless to say, so I followed him and found that he was <span class=\"emphasis\">reselling</span> my products to another! The nerve of some people, I tell you!”"},{"name":"BRIARDIEN","text":"A gentleman procuring cough medicines through a third party. That story has a familiar ring to it, does it not?"},{"name":"BRIARDIEN","text":"A man with a questionable past, recently come into wealth and playing at being a merchant, who so happens to travel with a young girl prone to fits of coughing..."},{"name":"BRIARDIEN","text":"Are you thinking what I'm thinking, <span class=\"highlight\">Forename</span>?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We must keep a close eye on Mistress Elaisse."},{"name":"A2","text":"Pasdevillet is somehow involved."},{"name":"A2","text":"The medicine is key, so it's Pienne we must watch."},{"name":"A2","text":"I don't like the cut of Mestonnaux's jib."},{"name":"A2","text":"..."},{"name":"BRIARDIEN","text":"...Perhaps not. It seems to me that Mestonnaux appears to be colluding with our man. In time, you may come to understand how I reached this conclusion. But first, we must pay a visit to his stall!"},{"name":"BRIARDIEN","text":"Nor I. 'Tis a pity our merchant friend had not the wits to match his newfound wealth─I could have done with a greater challenge. But that is neither here nor there. Come, <span class=\"highlight\">Forename</span>, let us pay a visit to Mestonnaux's stall."},{"name":"BRIARDIEN","text":"Ah, certainly, for the average mind it can be a lot to digest. However, seeing as how we haven't got all day, allow me to provide the answer: Mestonnaux has been colluding with our scar-faced friend. Shall we go and pay a visit to his stall, then?"}],"reward":{"gil":648,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67744]},"next":[67746]},"partials":[{"type":"npc","id":"1015976","obj":{"i":1015976,"n":"Briardien","l":2301,"q":6}},{"type":"npc","id":"1017875","obj":{"i":1017875,"n":"Sincere Seminarian","l":2337,"q":2}},{"type":"npc","id":"1017876","obj":{"i":1017876,"n":"Archombadin","l":2337,"q":2}},{"type":"npc","id":"1017877","obj":{"i":1017877,"n":"Janchette","l":2337,"q":2}},{"type":"npc","id":"1017881","obj":{"i":1017881,"n":"Theomocent","l":2301,"q":1}},{"type":"npc","id":"1017882","obj":{"i":1017882,"n":"Leigh","l":2301,"q":1}},{"type":"npc","id":"1017883","obj":{"i":1017883,"n":"Blaisie","l":2301,"q":1}},{"type":"npc","id":"1018008","obj":{"i":1018008,"n":"Stern Seminarian","l":2337,"q":2}},{"type":"npc","id":"1018159","obj":{"i":1018159,"n":"Lebrassoir","l":2337,"q":2}},{"type":"npc","id":"1018161","obj":{"i":1018161,"n":"Despondent Seminarian","l":2337,"q":2}},{"type":"npc","id":"1018208","obj":{"i":1018208,"n":"Crammevoix","l":2301,"q":1}},{"type":"quest","id":"67744","obj":{"i":67744,"n":"Through the Grapevine","g":78,"l":"Saint Endalim's Scholasticate","s":21}},{"type":"quest","id":"67746","obj":{"i":67746,"n":"Finding Ulaa","g":78,"l":"Ishgard","s":23}}]}