{"quest":{"name":"Divine Reckoning","location":"Ishgard","id":67743,"patch":3.4,"sort":20,"icon":100587,"eventIcon":71221,"issuer":1015976,"target":1017874,"involved":[1016234,1017875,1017876,1017877,1017878,1018008,1018159,1018160,1018161,1018162],"genre":78,"journal":["Briardien appears to be lost in thought.","Briardien tells you that while change has come to Ishgard, ill-feeling between the low- and highborn yet festers, with tensions rising by the day. The inspector is convinced that the recent hostilities are the result of a carefully laid plot conceived to further the interests of a party or parties unknown. Though he has yet to discover what their ultimate aim might be, he is not without a plan. Certain that the unexplained disappearances of Ulaa and volume eleven of the <span class=\"emphasis\">Articles of Halonic Polity</span> are somehow related to the scheme, he declares his intent to find the missing girl by tracking down the missing book. While he continues to search for the tome, Briardien bids you inquire as to whether the students have heard anything concerning Ulaa's whereabouts or, failing that, observed any unusual goings-on.","You speak with the students of the scholasticate, who are mostly preoccupied with their studies or else talking amongst themselves. As you continue making your rounds, however, it becomes clear that not everyone is present, and that two pupils in particular are notable by their absence. Ask Father Saturnois if he knows where Theomocent and Leigh might be.","Father Saturnois reveals that ever since Theomocent and Leigh learned of Ulaa's disappearance, they have devoted all of their energies to finding her, determined that she should resume her studies. With this apparently in mind, they begged leave to travel to Gorgagne Mills, and duly received it.","You arrive at the abandoned settlement to find Theomocent and Leigh kneeling in prayer. At your approach, the former rises to greet you, and reveals that Gorgagne Mills is the resting place of the boys' late mentor, Father Choisseau. He goes on to explain that the two of them often visit the grave when they are feeling lost or uncertain. Interpreting your unexpected arrival as a sign from on high, the two students seem satisfied that their time has been well spent, and resolve to return to the scholasticate forthwith. Follow in their footsteps, and report their deeds to Father Saturnois.","Upon learning what his two best pupils were doing in the western highlands, Father Saturnois seems wholly unsurprised, acknowledging that Theomocent and Leigh had always held the man who raised them close to their hearts. Far from feeling misled, he is pleased to see that their feelings for Father Choisseau are as strong as ever, and heartened by the concern they have shown for their fellow students."],"objectives":["Speak with the students in the scholasticate.","Speak with Saturnois in the scholasticate.","Seek out Theomocent at Gorgagne Mills in the Coerthas western highlands.","Report to Saturnois in the scholasticate."],"dialogue":[{"name":"BRIARDIEN","text":"Ah, if it isn't my trusted associate, back from the field! As you will doubtless have seen for yourself, change is sweeping through Ishgard, and the veil which once threatened to smother the hearts and minds of our people is slowly but surely being lifted."},{"name":"BRIARDIEN","text":"'Tis as if our fair city has been born anew─and it is in large part thanks to you. Which is not to say our problems have come to an end. No, the silent struggle between the lowborn and highborn goes on, growing more fractious by the day."},{"name":"BRIARDIEN","text":"I have come to believe that someone, somewhere is fanning the flames of hatred to further their own ends, and I am convinced, now more than ever, that Ulaa's sudden disappearance, alongside that of volume eleven of the <span class=\"emphasis\">Articles of Halonic Polity</span> is no mere coincidence. Both she and it, after all, were passionate advocates of equality among men."},{"name":"BRIARDIEN","text":"As to who is responsible and what their true intentions might be, I cannot say... Ascertaining these things will no doubt require that we first find the missing girl, and as of this moment, our best hope of learning her whereabouts may rest on discovering the fate of the book."},{"name":"BRIARDIEN","text":"As such, I shall continue searching for any clue which might lead us to the missing tome. In the meantime, I ask that you trouble the students for any information they might have on Ulaa. Failing that, find out if they have witnessed any unusual occurrences around the scholasticate. Anything at all.<br>Well then─let us be about it!"},{"name":"BRIARDIEN","text":"Even the most seemingly insignificant oddity can be all it takes to crack a case. In any event, there's a good chance that whatever the students have seen or heard will offer us some clue as to the culprits' next move."},{"name":"SCHOLASTICATELECTOR","text":"Welcome back, <span class=\"highlight\">Forename</span>. Pray allow me to show you inside."},{"name":"Q1","text":"Enter Saint Endalim's Scholasticate?"},{"name":"LEBRASSOIR","text":"Though some were shocked by the news of Ulaa's departure, Archombadin has worked tirelessly to reassure the student body that it is all for the best."},{"name":"CRAMMEVOIX","text":"While I cannot claim to have seen anything <span class=\"emphasis\">unusual</span>, exactly, I will say that things have not been the same here since Ulaa left. Somber doesn't do it justice."},{"name":"SATURNOIS","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Though the news of Ulaa's abrupt departure yet weighs heavily upon all of our minds, I am certain your presence within our hallowed halls will help to put a good many hearts at ease."},{"name":"RIGOROUSSTUDENT02207","text":"The lessons of volume eleven seemed to resonate deeply with Ulaa. She would oft stay up into the small hours reading and rereading them... Mayhap they spurred her to steal away in the night and take up with the <span class=\"emphasis\">revolutionaries</span>."},{"name":"RIGOROUSSTUDENT02207","text":"For some, merely to learn is enough. Others, meanwhile, feel compelled to put every teaching into practice. Needless to say, Ulaa falls into the second category. I only pray that her misguided actions do not have any long-term repercussions for the scholasticate."},{"name":"HARMLESSSTUDENT02207","text":"One of the seniors told me she'd been diagnosed with something called...&lt;shudder&gt;...<span class=\"emphasis\">lungrot</span>, and that she's too weak to attend any of her classes. Thinking back, I did hear her coughing from time to time, but I had no idea it was anything so serious..."},{"name":"HARMLESSSTUDENT02207","text":"Gods, I hope whatever she has isn't contagious! I used to sit near her in the library!"},{"name":"JANCHETTE","text":"The only really unexpected change I've seen of late is in Leigh's attitude towards Crammevoix. He really seems to have warmed to him. Why, he even went as far as to initiate a conversation the other day!"},{"name":"CRAMMEVOIX","text":"Ha! He spoke to me, 'tis true─but 'twas not out of fondness! He merely hates me very slightly less than he values Ulaa's safe return."},{"name":"JANCHETTE","text":"(Don't believe a word of it. Leigh's come to fancy Crammevoix nearly as much as he does Theomocent! Hahaha!)"},{"name":"CRAMMEVOIX","text":"I do hope Theomocent and Leigh find Ulaa soon─for their own sake if not her own. The way those two have been pushing themselves, they're like to collapse from exhaustion."},{"name":"GIRLFRIEND02207","text":"Blaisie has been so distracted lately, I'm lucky if I can get a simple “good morning” from her!"},{"name":"GIRLFRIEND02207","text":"Ever since Ulaa left, she's been rushing about the city like a madwoman, looking for any information she can find on the girl, that she might have an excuse to talk to Theomocent."},{"name":"GIRLFRIEND02207","text":"&lt;sigh&gt; It's been quite lonely without Blaisie around to keep me company..."},{"name":"ARCHOMBADIN","text":"&lt;sigh&gt; How many times must I say this... Ulaa was <span class=\"emphasis\">not</span> coerced into leaving. Nor was she abducted. Nor did she die from a fictitious disease! She <span class=\"emphasis\">quit</span> the scholasticate of her own free will for reasons known only to her and the Fury. Really, is it so difficult to understand?"},{"name":"ARCHOMBADIN","text":"I should not complain, I suppose. Since Ulaa departed, those Brume rats have scarce shown their faces here─and the scholasticate has been <span class=\"emphasis\">much</span> the better for their absence. Were it not for all these infernal rumors, everything would be exactly as it should be."},{"name":"SATURNOIS","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. What a pleasant surprise it is to see you. How might I be of service to you this day?"},{"name":"SATURNOIS","text":"Theomocent? Ah. In the wake of Ulaa's withdrawal, he and Leigh have devoted their every waking moment to the task of uncovering her whereabouts. They are quite adamant that the girl must be found and persuaded to resume her studies here."},{"name":"SATURNOIS","text":"As a matter of fact, they approached me earlier today to beg leave to travel to Gorgagne Mills, claiming that a trip there would yield the information they needed to accomplish their aim."},{"name":"SATURNOIS","text":"No sooner had I granted their request than they rushed off. Hahaha! Such compassion and eagerness to serve others is a rarity even among the clergy. I cannot tell you how proud I am of what fine young men they have become."},{"name":"SATURNOIS","text":"I know only that they intended to travel to Gorgagne Mills. They left me no time to inquire any further."},{"name":"LEIGH","text":"Do my eyes deceive me? Surely, that can't be you, <span class=\"highlight\">Forename</span>!? What brings you to Gorgagne Mills?"},{"name":"THEOMOCENT","text":"<span class=\"emphasis\"><span class=\"highlight\">Forename</span></span>, is it really you? That we should be reunited thus amid the snowy peaks of Coerthas is... Why, it is nothing short of a miracle! I sense the hand of the divine at work! Halone has answered our prayers!"},{"name":"LEIGH","text":"Theo! <span class=\"highlight\">Forename</span> has no idea what you're talking about. By all means explain─but do it <span class=\"emphasis\">slowly</span>. And from the beginning!"},{"name":"THEOMOCENT","text":"My apologies. Excitement got the better of me. <span class=\"highlight\">Forename</span>, this is the resting place of Father Choisseau─the man who found room in his heart for two waifs from the street, granting them the opportunity to rise above their station in life."},{"name":"LEIGH","text":"Do you perchance recall the book that was stolen from Theo and burned by that...by that <span class=\"emphasis\">lost soul</span> we once thought of as a brother? It was one of the last mementos we had of the man. Now, all that's left to remind us of him is this place."},{"name":"THEOMOCENT","text":"Indeed. And while we often come here to seek solace and guidance in his blessed presence, today our purpose is more practical─with our search for Ulaa at an impasse, we had hoped he might grant us inspiration."},{"name":"THEOMOCENT","text":"And that is why I believe our meeting with you here, in this our hour of need, is a sign from above─mayhap the work of Father Choisseau himself!"},{"name":"THEOMOCENT","text":"I take from this that we are not meant to bear this burden alone─that the obstacles we face can only be surmounted by working in concert with others."},{"name":"THEOMOCENT","text":"Ulaa's disappearance has thrown the scholasticate into turmoil, and the long-simmering mistrust between those of noble and ignoble birth has boiled over into outright hatred. Now more than ever, we must seek to join hands with like-minded souls who understand that this malice will only serve to sow further discord─like-minded souls such as you."},{"name":"THEOMOCENT","text":"I am reminded of the words of volume eleven of the <span class=\"emphasis\">Articles of Halonic Polity</span>...<br>“Of the Fury's love will all men receive, and by the balance of Her spear will all be set free.”"},{"name":"THEOMOCENT","text":"We must strive to love our neighbor even as we love ourselves, just as Halone does. To do otherwise is to defy Her will."},{"name":"LEIGH","text":"Yes! And while we will surely be rewarded for our tolerance, the highborn bastards who would sooner pretend that passage doesn't exist won't be so lucky! Why, they may even find themselves on the receiving end of Her spear for everything they've put us through! Bahahaha!"},{"name":"LEIGH","text":"...Sorry. I'm getting ahead of myself, aren't I. We still haven't found a single clue as to Ulaa's whereabouts."},{"name":"THEOMOCENT","text":"Fear not, Leigh! With <span class=\"highlight\">Forename</span> at our side, I have faith that we shall find her, and that she will soon retake her rightful place in the hallowed halls of Saint Endalim's Scholasticate!"},{"name":"LEIGH","text":"...I hope you're right. At any rate, we've done what we came to do, so there's no point freezing our arses off out here. Until we meet again, <span class=\"highlight\">Forename</span>!"},{"name":"SATURNOIS","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─I trust you were able to find Theomocent and Leigh?"},{"name":"SATURNOIS","text":"...I see. Yes, the two of them have always shared a special bond with Father Choisseau─one that only seems to have grown stronger with his passing."},{"name":"SATURNOIS","text":"It is encouraging to see that they have taken their lessons to heart, and continue to work so fervently for the good of their fellow students."},{"name":"SATURNOIS","text":"I fear, however, that a dark and treacherous path lies ahead of them. I only pray that when the time comes, they are ready for whatever challenges await."}],"reward":{"gil":827,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67691]},"next":[67744]},"partials":[{"type":"npc","id":"1015976","obj":{"i":1015976,"n":"Briardien","l":2301,"q":6}},{"type":"npc","id":"1017874","obj":{"i":1017874,"n":"Saturnois","l":2337,"q":2}},{"type":"npc","id":"1016234","obj":{"i":1016234,"n":"Scholasticate Lector","l":2301,"q":2}},{"type":"npc","id":"1017875","obj":{"i":1017875,"n":"Sincere Seminarian","l":2337,"q":2}},{"type":"npc","id":"1017876","obj":{"i":1017876,"n":"Archombadin","l":2337,"q":2}},{"type":"npc","id":"1017877","obj":{"i":1017877,"n":"Janchette","l":2337,"q":2}},{"type":"npc","id":"1017878","obj":{"i":1017878,"n":"Theomocent","l":2200,"q":1}},{"type":"npc","id":"1018008","obj":{"i":1018008,"n":"Stern Seminarian","l":2337,"q":2}},{"type":"npc","id":"1018159","obj":{"i":1018159,"n":"Lebrassoir","l":2337,"q":2}},{"type":"npc","id":"1018160","obj":{"i":1018160,"n":"Crammevoix","l":2337,"q":1}},{"type":"npc","id":"1018161","obj":{"i":1018161,"n":"Despondent Seminarian","l":2337,"q":2}},{"type":"npc","id":"1018162","obj":{"i":1018162,"n":"Leigh","l":2200,"q":1}},{"type":"quest","id":"67691","obj":{"i":67691,"n":"More than Meets Her Eye","g":78,"l":"Saint Endalim's Scholasticate","s":13}},{"type":"quest","id":"67744","obj":{"i":67744,"n":"Through the Grapevine","g":78,"l":"Saint Endalim's Scholasticate","s":21}}]}