{"quest":{"name":"Sky Pirates","location":"Ishgard","id":67740,"patch":3.1,"sort":1,"icon":100517,"unlocksFunction":1,"eventIcon":71341,"issuer":1016125,"target":1016119,"involved":[1012055,1016116,1016117,1016118,1016121,1016124,1016130],"genre":18,"journal":["The unquiet trader seems to be scanning the skies in silent desperation.","An anxious merchant in the Pillars is convinced that his newly acquired airship has run afoul of airborne buccaneers. Make your way to Camp Cloudtop in the Sea of Clouds, and question Rontremont about the missing supply vessel.","You explain the situation to Rontremont, and the soldier recalls seeing an airship charting an erratic course to the north. Head to the landmass north of Camp Cloudtop, and attempt to locate the cargo airship's helmsman.","You head to the north of Camp Cloudtop, only to find the wayward helmsman being robbed by a trio of brutish thieves. The villains do not take kindly to the interruption, but before they can make good on their threats of violence, they are again interrupted by the arrival of a sky pirate by the name of Redbill Leofard. Leofard quickly dispatches the would-be cargo robbers, and remarks upon the serendipity of meeting the very hero with whom he had hoped to speak. If you would grant the pirate the audience he desires, seek out his crew's standard in the north of the Blue Window.","You find the Redbill standard, and are greeted by Stacia, Leofard's right-hand woman. She leads you to the crew's base of operations, and you learn of their plans to board a massive derelict airship seemingly adrift in the Sea of Clouds. After agreeing to accompany the Redbills on their expedition to this “ghost ship,” Stacia suggests meeting with the crewmate in charge of tracking the elusive vessel. Head to the Gauntlet, and speak with Utata.","You approach Utata, and she introduces herself as the Redbills' chief of engineering. It would seem the tiny tinkerer has a flair for all things airship-related..."],"objectives":["Speak with Rontremont at Camp Cloudtop.","Find the cargo ship helmsman.","Locate the Redbills' standard.","Speak with Utata."],"dialogue":[{"name":"SHIPOWNER02204","text":"Ah, you have the look of a <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> who's seen <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fair share of trouble─mayhap you'd be willing to help me with mine. I need a capable sort to head into the Sea of Clouds and track down my missing airship."},{"name":"SHIPOWNER02204","text":"I had to mortgage my soul to get that vessel built, so winning the contract to ferry supplies out to Cloudtop was a real weight off my mind. But it seems my luck ended there─my ship was due back in Ishgard <span class=\"emphasis\">bells</span> ago and I've been praying for a glimpse of her sails ever since!"},{"name":"SHIPOWNER02204","text":"I can't help fearing the worst... What if she's run afoul of sky pirates!? My creditors will have their ponze of flesh!"},{"name":"SHIPOWNER02204","text":"...You think me foolish to fear piracy so far above the waves? Well, let me tell you that no honest merchant is safe now that airship production has─if you will excuse the pun─taken off. Any scoundrel with a sack of coin and a vague sense of direction can terrorize the skies!"},{"name":"SHIPOWNER02204","text":"Oh, yes, this new breed of buccaneers like to paint themselves as dashing explorers braving the unknown, but the truth of their nature is right there in the name: sky <span class=\"emphasis\">pirates</span>! Given half a chance, they'll strip your ship of every last scrap of cargo and cry “Yahaharrr!” as they launch you screaming over the rails! I've heard the stories!"},{"name":"SHIPOWNER02204","text":"Please, you must make haste to Camp Cloudtop─that's where the shipment was bound─and inquire as to the fate of my poor ship. Oh, and my poor helmsman! Ask Rontremont! He'll know─if any man does!"},{"name":"SHIPOWNER02204","text":"Pray make haste to Camp Cloudtop and speak with Rontremont. Mayhap he will have some news of my missing airship."},{"name":"RONTREMONT","text":"A supply airship has gone missing, you say? Well, that would certainly explain why our provisions are so late in arriving..."},{"name":"RONTREMONT","text":"I did, in fact, spy a vessel charting an erratic course northwards a short while ago...but as it seemed disinclined to make port here, I paid it little mind."},{"name":"RONTREMONT","text":"Not the most compelling piece of evidence, I grant you, but I have witnessed naught else of interest. I suggest you investigate the landmass to the north. Rest assured, I will send word if I spy any other sign of our errant supply ship."},{"name":"RONTREMONT","text":"The vessel I spotted earlier may very well have been the supply ship you seek. It was northward bound the last I saw─mayhap you could continue your search in that direction?"},{"name":"HELMSMAN02204","text":"Hah, we'll make some good coin from this haul! And then we'll see if this fool is worth the ransom..."},{"name":"HELMSMAN02204","text":"Aid! Aid, I say! These villains mean to plunder my cargo!"},{"name":"AIRPIRATE02204","text":"What've we got here, then? Think you're some sort of hero, do you?"},{"name":"AIRPIRATE02204","text":"Well then, you won't mind if me mates here join the fun. Make for a more heroical tale, won't it? ...The tale of how three sky pirates fed a meddlin' little <span class=\"emphasis\">shite</span> <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own bloody eyes!"},{"name":"AIRPIRATE02204","text":"What the─<br>Oh gods, I know that ship! It's─"},{"name":"LEOFARD","text":"(-???-)So <span class=\"emphasis\">you're</span> the scrags what've been draggin' our good name through the mud..."},{"name":"AIRPIRATE02204","text":"You...you're Redbill Leofard! We ain't done naught to you or yours. What do you want with us!?"},{"name":"LEOFARD","text":"I think I made me position pretty clear: you take on the mantle of sky pirate, you agree to a certain code of conduct. And codes ain't worth much if folk go around breakin' 'em. Frankly, lads, you're makin' us look bad, and we can't have that. No hard feelin's though, eh?"},{"name":"HELMSMAN02204","text":"Oh, thank you, Mister Leofard! Thank you! I'm certain my master will wish to repay you..."},{"name":"LEOFARD","text":"If your employer does business in Ishgard, he likely knows a merchant or two what trades with me associates. Tell him to say it's for “Leofard” and any reward should reach me soon enough."},{"name":"LEOFARD","text":"As for you, adventurer─'tain't often someone beats me to the scene... But then I'd expect naught less from a hero such as yourself...<span class=\"emphasis\"><span class=\"highlight\">Forename</span></span>."},{"name":"LEOFARD","text":"That <span class=\"emphasis\">is</span> who you are, ain't it? I don't know too many other <span class=\"alternative-container\"><span class=\"alternative\">lasses</span><span class=\"alternative\">folk</span></span> with one of them marvelous manacutters the Ironworks dreamed up."},{"name":"LEOFARD","text":"Well, then, it seems you've saved me the trouble of trackin' you down. I'd been hopin' to have a word with you, you see..."},{"name":"LEOFARD","text":"I'll put it to you straight: I need someone to help out with a little venture I have in mind. Someone used to takin' a few risks."},{"name":"LEOFARD","text":"Now, this wouldn't be no black-hearted brigand's work, so don't go worryin' yourself on that account. Unlike them thievin' curs just now, I don't hold with robbin' honest folk."},{"name":"LEOFARD","text":"For me, you see, the sky pirate's life is all about freedom─the freedom to go where you will; to find out what lies beyond the next cloud! If you're interested in joinin' us on an adventure worthy of the name, then look for me standard in the northern reaches of the Blue Window. Someone'll be waitin' there to greet you."},{"name":"STACIA","text":"That's far enough, stranger. If you value your life, tell me true: did you stumble across this marker by chance, or are you here by invitation?"},{"name":"Q1","text":"Are you here by invitation?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."},{"name":"STACIA","text":"Then that would make you the hero the captain said to watch out for. Well met."},{"name":"STACIA","text":"The name's Stacia. Leofard would call me his right-hand woman, but I feel more like his bloody nursemaid, gods' truth be told..."},{"name":"STACIA","text":"Ahem. Anyway, my thanks to you for comin' to hear him out. If you'd follow me, I'll take you to the Redbills' nest."},{"name":"STACIA","text":"Then you'd best forget we ever had this conversation. On your way."},{"name":"RADLIA","text":"(-???-)...I come to you in person, and <span class=\"emphasis\">still</span> you refuse my offer? Arrogant fool."},{"name":"LEOFARD","text":"On the subject of arrogance, Radlia, I bow to your superior knowledge. But that's all the bowin' you'll get from me. As I've told you a dozen times before, I ain't <span class=\"emphasis\">no one's</span> lackey."},{"name":"RADLIA","text":"But my dear Leofard, how else do you propose to survive an expedition into the ghost ship? I would fear for my life with naught but your feeble crewmates at my back..."},{"name":"LEOFARD","text":"While I'd fear for me life with your mangy crew at <span class=\"emphasis\">my</span> back, on account of 'em bein' murderous untrustworthy bastards to a man."},{"name":"RADLIA","text":"Hmph. I thought you cleverer than this, Redbill. But no matter─I always get what I want in the end. 'Tis merely a question of method."},{"name":"RADLIA","text":"Now there's a face I've not seen before. Hmmm. You don't have the look of one of Leofard's little birds."},{"name":"STACIA","text":"<span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> a guest. You understand the concept, don't you? You know, when someone is <span class=\"emphasis\">invited</span>, instead of just burstin' through the door whenever she damn well pleases?"},{"name":"STACIA","text":"That was Radlia, captain of the Talons. She knows Leofard's the best sky pirate alive, and the fact he won't join her sticks in her craw."},{"name":"SUBORDINATE02204","text":"Are you gonna let them talk to you like that, Captain? We should teach them Redbills some respect!"},{"name":"RADLIA","text":"Patience. When all of this is over, we shall see who rules the skies."},{"name":"LEOFARD","text":"Ho there, hero. I promised you high adventure, and high adventure you shall have...for we plan to board the Sea of Clouds' very own ghost ship!"},{"name":"STACIA","text":"...Or what folk have taken to callin' one, anyway. Every day for the past few weeks has brought with it a new sightin' of the selfsame vessel─a massive airship of queer design, adrift on the wind."},{"name":"STACIA","text":"Bein' a curious lot, there were a few buccaneers who tried explorin' belowdecks...but not one of 'em's been seen since. And so, naturally, they're sayin' the ship is cursed. Well, “haunted.”"},{"name":"LEOFARD","text":"Like I said: an honest-to-gods ghost ship!"},{"name":"LEOFARD","text":"My guess is she's another relic left behind by the Allagans, but we won't know for sure till we've had ourselves a good poke around inside. ...And liberated whatever ancient treasures she's got molderin' away in her hold, of course."},{"name":"STACIA","text":"But before we start dividin' up the spoils, we've got to <span class=\"emphasis\">find</span> the damn thing─which is why we've been workin' on a special new device..."},{"name":"LEOFARD","text":"Bah, findin' her'll be the easy part. What we can't do without is a veteran explorer what ain't afraid to fling <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> face-first into the jaws of danger."},{"name":"LEOFARD","text":"Now, I know you're a gallant champion of the people, and all. But strip away the fame and the glory, and I'll wager you're still an adventurer at heart. So what say you, <span class=\"highlight\">Forename</span>? Fancy a plunge into the unknown at the side of the Redbills?"},{"name":"STACIA","text":"Then it's settled. Let's pay a visit to our crewmate, Utata─she's been workin' on a way to track the vessel."},{"name":"STACIA","text":"This here's Utata, the lass I was tellin' you about. She's our engineer, and a damn good one at that."},{"name":"LEOFARD","text":"I always get this little thrill in me chest when I'm about to embark on a new adventure. And once you've felt your heart dance like that, there's naught you wouldn't do to feel it again..."},{"name":"LEOFARDSCONSPIRATORS02204","text":"Might be as there are better engineers in the realm, but I'd wager none are as inventive as our Utata. She earns her keep with her brains, not her brawn, and we're a stronger crew for it."},{"name":"UTATA","text":"Greetings! The name's Utata! I suppose you'd call me the Redbills' chief of engineering. Smithing, carpentry, magitek─if it's part of an airship, I can fix it!"},{"name":"UTATA","text":"...Just don't expect to see me waving a cutlass and swinging over the rails. If there's fighting to be done, well, that's what we have <span class=\"emphasis\">you</span> for!"},{"name":"SHIPOWNER02204","text":"（★未使用／削除予定★）"},{"name":"UTATA","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":778,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67205]},"next":[67741]},"partials":[{"type":"npc","id":"1016125","obj":{"i":1016125,"n":"Unquiet Trader","l":2301,"q":1}},{"type":"npc","id":"1016119","obj":{"i":1016119,"n":"Utata","l":2100,"q":2}},{"type":"npc","id":"1012055","obj":{"i":1012055,"n":"Rontremont","l":2100,"q":3}},{"type":"npc","id":"1016116","obj":{"i":1016116,"n":"Redbill Deckhand","l":2100,"q":2}},{"type":"npc","id":"1016117","obj":{"i":1016117,"n":"Leofard","l":2100,"q":2}},{"type":"npc","id":"1016118","obj":{"i":1016118,"n":"Stacia","l":2100,"q":2}},{"type":"npc","id":"1016121","obj":{"i":1016121,"n":"Sky Pirate","l":2100,"q":1}},{"type":"npc","id":"1016124","obj":{"i":1016124,"n":"Cargo Ship Helmsman","l":2100,"q":1}},{"type":"npc","id":"1016130","obj":{"i":1016130,"n":"Stacia","l":2100,"q":3}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}},{"type":"quest","id":"67741","obj":{"i":67741,"n":"To Rule the Skies","g":18,"l":"The Sea of Clouds","s":2,"f":1}}]}