{"quest":{"name":"To Rule the Skies","location":"The Sea of Clouds","id":67741,"patch":3.1,"sort":2,"icon":112118,"unlocksFunction":1,"eventIcon":71341,"issuer":1016119,"target":1016137,"involved":[1016116,1016117,1016118,1016138,1016139,1016140],"genre":18,"journal":["Utata seems eager to share her findings on the ghost ship.","Utata explains how she created an “ectocompass” that allows her to track the ghost ship's unique aetheric signature. Using the readings she has taken, it seems she has been able to plot a course to intercept the cursed vessel. Gather together a trusty crew, and prepare to boldly go where no sky pirate has gone before...and lived to tell the tale!<br><br>※The Void Ark can be accessed via the Duty Finder.","You have braved the depths of the Void Ark and lived to tell the tale. Make your way back to the Sea of Clouds.","At the heart of the Ark, you discover a massive coffin-like object, but before you can inspect it more closely, a fearsome voidsent appears, seemingly intent on your destruction. Rather than engage the creature, however, you elect to flee the violently heaving vessel at the behest of what appears to be a talking cat. Once outside in your manacutter, you are witness to an incredible spectacle: the prow of the ship splits open, and emits a blinding blast of light that tears a rent in the very sky. The belly of the vessel then ejects the huge coffin, which disappears into the gaping rift...<br><br>Speak with Leofard back at the Gauntlet, and attempt to make sense of these portentous events.","Back on solid ground, your rendezvous with Utata does not proceed as planned: Radlia and her axe-wielding brutes have taken the Redbill engineer captive. They ransom her for the ectocompass, but not before Leofard slips a linkpearl into the device's casing. Though concerned about Radlia's plans for the Ark, the Redbill captain first wishes to learn more of the cat creature─one “Cait Sith”─and of the haunted vessel upon which he dwelt.<br><br>You return to the Redbills' den, and the loquacious feline reveals his nature as a familiar. He tells the tale of High Voidmage Cessair, and of the Mhachi magi who constructed the Void Ark as a means to escape the great floods of the Sixth Umbral Calamity. Sadly for them, he continues, they proved unable to control the potent entity chosen to power the ship─whom he calls Scathach, the Shadow Queen─and were forced to contend with the horde of lesser voidsent servants that her rampant energies set loose. Though they ultimately succeeded in rebinding the creatures, they did so at the cost of their own lives, leaving Cait Sith alone to guard a derelict prison. For fifteen hundred years the Void Ark drifted, until a determined voidsent arrived on the ship and once more released its malevolent inmates, his efforts culminating in what you now understand to be the liberation of Scathach's warded tomb.<br><br>After hearing Cait Sith's story, Leofard vows to aid him in tracking down the Queen's Coffin...and collect any ancient treasures uncovered along the way. For the time being, however, the pirate captain encourages you to return to your adventures, adding that you should always keep an ear open for the Redbills' call to arms."],"objectives":["Enter the Void Ark.","Speak with Leofard."],"dialogue":[{"name":"STACIA","text":"This here's Utata, the lass I was tellin' you about. She's our engineer, and a damn good one at that."},{"name":"LEOFARD","text":"I always get this little thrill in me chest when I'm about to embark on a new adventure. And once you've felt your heart dance like that, there's naught you wouldn't do to feel it again..."},{"name":"LEOFARDSCONSPIRATORS02204","text":"Might be as there are better engineers in the realm, but I'd wager none are as inventive as our Utata. She earns her keep with her brains, not her brawn, and we're a stronger crew for it."},{"name":"UTATA","text":"Well met, ladies and gentlepirates! Now that we appear to have our hero, I'm happy to report that we've overcome the last obstacle to boarding the ghost ship!"},{"name":"LEOFARD","text":"...Meanin' your project is proceedin' as planned?"},{"name":"UTATA","text":"That it is, Captain! I knew this would be the perfect place to take readings─the scant amounts of background aether make it easy to follow the derelict's trail."},{"name":"STACIA","text":"The ghost ship has what Utata tells us is a “unique aetheric signature.” She's been buildin' a device what can sniff out this particular spectral flavor, and point us in the right direction."},{"name":"UTATA","text":"I call it the “ectocompass”! It's allowed me to collect some solid data on the vessel's movements, and plot a reliable intercept course. No groping blindly through the clouds for us!"},{"name":"STACIA","text":"All the ships are loaded and ready to fly. Just say the word, Captain."},{"name":"LEOFARD","text":"Utata, you'd best stay here, out of harm's way. Keep an eye on them aether trails, eh?"},{"name":"UTATA","text":"Aye, Captain! Grab an armload of treasure for me!"},{"name":"LEOFARD","text":"Now, we've got no way of knowin' what's waitin' for us on that cursed hulk, <span class=\"highlight\">Forename</span>, so you'd best bring along a few mates what you know you can trust. Don't hurt to be too careful, seein' as how you'll be goin' in first and all. I did tell you you'd be goin' in first, didn't I? I, well, you will."},{"name":"LEOFARD","text":"The rest of us'll be guardin' the rear, just in case Radlia and her brood decide to stick their beaks in where they ain't wanted. Don't worry, she'll not get past us, so you can concentrate on carvin' a path into the ship's belly!"},{"name":"LEOFARD","text":"An honest-to-gods ghost ship...<br>Ohhh-ho-ho, this is gonna be an adventure and a half!"},{"name":"STACIA","text":"I'll be on hand to see that our curious captain don't get us all killed meddlin' with some ancient artifact or other─meanin' you'll be free to concentrate on not gettin' killed by whatever's waitin' belowdecks. Can't say fairer than that, eh?"},{"name":"LEOFARD","text":"We'll deal with any sneaky bastards what try creepin' in behind us while you and your mates forge ahead. That hulk's secrets'll be ours alone."},{"name":"UTATA","text":"Leofard will be taking my ectocompass with him. Just follow his lead, and you'll arrive at the derelict soon enough. Who knows what wondrous trinkets await you inside!?"},{"name":"LEOFARDSCONSPIRATORS02204","text":"The captain's dragged us on some hair-raisin' ventures in his time, but summat tells me this one's gonna be the worst of the lot. If we look out for each other, though, I reckon we'll make it home in one piece...with a bit of luck."},{"name":"LEOFARD","text":"Bugger me... I expected danger, but not a hells-spawned bleedin' nightmare made flesh like that! Didn't stop you and your mates, though, did it!? That's some crew you've got there, and no mistake."},{"name":"LEOFARD","text":"Right, then─let's have a look inside that dirty great coffer-type...thing. Summat tells me it's filled to the brim with booty."},{"name":"STACIA","text":"Don't look at me! I never moved a muscle!"},{"name":"LEOFARD","text":"What in the seven hells is that bastard doin'!?"},{"name":"CAITSITH","text":"(-???-)This way! Swiftly now!"},{"name":"LEOFARD","text":"Er...can anyone else see that talkin' cat over there? Bloody hells, this adventure's gettin' queerer by the minute..."},{"name":"LEOFARD","text":"...Still, I'd rather take me chances with a prattlin' puss than stay here. Get your things, mateys─we're leavin'!"},{"name":"STACIA","text":"But...what about the loot!?"},{"name":"LEOFARD","text":"You can't spend it when you're dead! We either follow the furball, or make friends with a spell-slingin' voidborn! Your choice!"},{"name":"STACIA","text":"Gods damn it! How's an honest sky pirate meant to make a livin'!?"},{"name":"LEOFARD","text":"The ship's breakin' up...<br>Is he tryin' to bring her down?"},{"name":"CAITSITH","text":"(-???-)The voidsent is attempting to initiate a dimensional displacement! But the gate─it cannot possibly be large enough for the entire ship..."},{"name":"CAITSITH","text":"(-???-)&lt;gasp&gt; The Queen's Coffin! He takes it beyond our reach!"},{"name":"LEOFARD","text":"Well, there don't seem much point hangin' 'round here. Let's get back to solid ground."},{"name":"STACIA","text":"What kind of cat is that anyway? And what was it doin' on that ship...?"},{"name":"LEOFARDSCONSPIRATORS02204","text":"Ugh... Me poor heart... 'Tis a pity about the loot and no mistake, but at least we made it out in one piece. As the captain's so fond of sayin', “You can't spend it when you're dead!” &lt;sigh&gt;"},{"name":"CAITSITH","text":"Long has it been since my paws have trodden aught but those cursed decks...<br>&lt;sigh&gt; Would that I had made landfall under better circumstances."},{"name":"LEOFARD","text":"Aye, 'twas a bit touch and go in places, I grant you, but here we all are, and all with our bits still attached! This calls for a foamin' flagon of─"},{"name":"LEOFARD","text":"Hold on. Ain't we missin' someone? Didn't I tell Utata to wait for us here?"},{"name":"RADLIA","text":"(-???-)Never fear. We've been keeping the girl company."},{"name":"RADLIA","text":"But enough about her! Did you <span class=\"emphasis\">see</span> the cannon on that ship? As you know, my dear Leofard, I am not easily moved, but the sheer power on display set me all aquiver."},{"name":"LEOFARD","text":"Well, I hope you're content to admire it from afar. That vessel ain't for the likes of you and me."},{"name":"RADLIA","text":"Do not presume to measure me by your own limitations. Besides, I believe I've shown how <span class=\"emphasis\">resourceful</span> I can be."},{"name":"RADLIA","text":"Which brings me neatly to the point. You have in your possession a device capable of tracking the ghost ship. Hand it over, or your engineer shall suffer the consequences."},{"name":"RADLIA","text":"...Perfect. A compass pointing the way to my just reward. A weapon like that belongs in the hands of one with the will to use it!"},{"name":"RADLIA","text":"Come, lads. Our business here is concluded."},{"name":"UTATA","text":"I'm sorry, Captain. They caught me off guard..."},{"name":"STACIA","text":"...You get a bang on the head or summat? The man I know would never give in to scum like her without a fight. Unless─"},{"name":"STACIA","text":"&lt;sigh&gt; What did you do to the compass?"},{"name":"LEOFARD","text":"Who, me? Naught.<br>...Besides slippin' a linkpearl into its casin', like. Hah hah! So long as Radlia keeps it close─and you can be damn sure she will─we'll know exactly what them thievin' bastards are plannin'! Anyone care to wager how long it'll take her to notice me little gift?"},{"name":"STACIA","text":"That's very clever and all, but how were you proposin' to stop her from gettin' her hands on that derelict and its great big cannon?"},{"name":"LEOFARD","text":"I ain't worked that part out yet. But I 'spect it'll start with us keepin' a close eye on the Talons."},{"name":"LEOFARD","text":"'Fore we get into any of that, though, I've got some questions what need answerin'."},{"name":"CAITSITH","text":"You wish to know more of the Void Ark? The “ghost ship,” as you call it?"},{"name":"LEOFARD","text":"The Void Ark... So that's its proper name. Aye, I'd like to hear whatever you'd care to tell us, puss."},{"name":"CAITSITH","text":"(-Cait Sith-)And I, for my part, am curious to hear your stories. Ere we continue, however, I must insist that you address me by <span class=\"emphasis\">my</span> proper name: Cait Sith. I will not respond to “puss” or “cat,” and most decidedly not “furball.”"},{"name":"CAITSITH","text":"My tale begins long, long ago in the city of Mhach, which once stood in the lands of Yafaem."},{"name":"CAITSITH","text":"The sorcerers of Mhach were masters of destructive magicks, and they brought that terrible power to bear against Amdapor and Nym in the War of the Magi."},{"name":"CAITSITH","text":"The titanic forces they unleashed, however, took a heavy toll upon the land, ultimately resulting in a colossal flood that drowned the realm of Eorzea─a catastrophe which my master, High Voidmage Cessair, was wise enough to foresee."},{"name":"STACIA","text":"Wait, wait, wait... Colossal flood? Are you talkin' about the Sixth Umbral Calamity?"},{"name":"CAITSITH","text":"Hmm, I suppose you would know it as such... Now, where was I? Ah, yes. When they learned of the fate that awaited them, the Mhachi magi began construction of a gargantuan vessel that would bear their people to the skies, and to safety."},{"name":"CAITSITH","text":"The operation of the Void Ark, as the ship came to be called, was entrusted to Cessair. Prior to that, of course, my master had been a prisoner in her own home, confined for her outspoken opposition to the war..."},{"name":"UTATA","text":"So the Ark was meant as a <span class=\"emphasis\">sanctuary</span>? Then, how did it come to be so...um... I mean, what happened to all the people? And where did all the voidsent come from?"},{"name":"CAITSITH","text":"By what power do you imagine such a massive craft remains aloft? The energy required to raise the Ark was siphoned from over a thousand otherworldly servants sealed within the vessel."},{"name":"CAITSITH","text":"Advances in Mhachi sorcery were made for one reason and one reason only: cataclysmic destructive power. And the swiftest─and most dangerous─method of acquiring that power was through the enslavement of voidsent entities."},{"name":"UTATA","text":"So, the creatures on the derelict...they broke free from your master's control?"},{"name":"CAITSITH","text":"At the very heart of the Ark, the voidmages had entombed a great ruler of the voidsent─Scathach, the Shadow Queen."},{"name":"CAITSITH","text":"But in order to control so potent a prisoner, a mage of adamant will was required. And being Mhach's preeminent sorcerer, Cessair was deemed best qualified. Were it otherwise, my master might never have been released from her own imprisonment..."},{"name":"CAITSITH","text":"Yet even with Cessair's peerless skill, the Shadow Queen could not long be subjugated. One after another, the lesser voidsent awoke, and ran rampant within the ship."},{"name":"CAITSITH","text":"In the end, Cessair and the fifty-three voidmages aboard the Ark sacrificed their own life energies to return the fiends to their coffins...leaving me, a lowly familiar, to watch over a derelict prison."},{"name":"LEOFARD","text":"If I remember me Umbral Eras right, the stuff you just described happened more'n fifteen hundred years past─which is a good while by anyone's measure. And since everythin' seems to have been quiet on board your boat till just recently, I'm thinkin' summat unusual must've happened to wake the inmates up. Am I warm?"},{"name":"CAITSITH","text":"One day, a voidsent that had taken the shape of a bat flew into the ship. At first, it was little more than a nuisance that I brushed away, but the longer it remained on the Ark, the stronger it seemed to become... Eventually I could not contend with its power, and it began shattering seal after seal!"},{"name":"CAITSITH","text":"...You have faced this bat-winged fiend before!? It would seem, then, that the creature survived the encounter...and that he intends to celebrate his restoration by liberating his queen."},{"name":"CAITSITH","text":"...Ah, but you looked upon the true form of this fiend as he broke the chains holding the Queen's Coffin. I can only assume that he is one of Scathach's subjects, intent on bringing about her return."},{"name":"LEOFARD","text":"Well, that explains that, then─'cept for one small detail, namely, where the Queen's Coffin went. After it fell out of the ship's belly...I'm assumin' it didn't just disappear, right?"},{"name":"CAITSITH","text":"You recall the great rift that the Ark's cannon ripped in the sky? That was a voidgate."},{"name":"CAITSITH","text":"Such a portal opens a temporary path through the void, allowing the ship to travel almost instantaneously from one location to another. The voidsent, as you saw, only opened a gate large enough to displace the Coffin. As for the Coffin's destination, however...that is as much a mystery to me as it is to you."},{"name":"CAITSITH","text":"I beseech you, conquerors of the Ark: help me find the Queen's Coffin ere the wards binding Scathach are dispelled!"},{"name":"LEOFARD","text":"Smells to me like an adventure! And who knows what ancient Mhachi treasures we might stumble on along the way!? Gods know, they'll make a nice change from all them Allagan tomestones we've been collectin'!"},{"name":"LEOFARD","text":"Aye, we'll help you. I'm not riskin' me hide for the sake of the realm, you understand, but I'll be damned if I let either Radlia or that bat-winged bastard take the freedom of the skies from me!"},{"name":"CAITSITH","text":"You... You care only for how <span class=\"emphasis\">you</span> might be inconvenienced!? If the Shadow Queen were to return, it would have dire consequences for this entire star!"},{"name":"LEOFARD","text":"Count your blessin's, furball! I said we'd help, didn't I?"},{"name":"LEOFARD","text":"'Fore we go rushin' off in search of that coffin, though, there's preparations to be made. You might as well get back to your usual heroical employment, <span class=\"highlight\">Forename</span>. I'll let you know when it's time to round up your mates again..."},{"name":"RADLIA","text":"The time is nigh, my dear Talons. Soon, we shall seize control of the ghost ship and all its power, and rule the skies from here to the ends of the world!"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reward":{"gil":7500,"xp":0,"instance":30029},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67740]},"next":[67821]},"partials":[{"type":"npc","id":"1016119","obj":{"i":1016119,"n":"Utata","l":2100,"q":2}},{"type":"npc","id":"1016137","obj":{"i":1016137,"n":"Leofard","l":2100,"q":1}},{"type":"npc","id":"1016116","obj":{"i":1016116,"n":"Redbill Deckhand","l":2100,"q":2}},{"type":"npc","id":"1016117","obj":{"i":1016117,"n":"Leofard","l":2100,"q":2}},{"type":"npc","id":"1016118","obj":{"i":1016118,"n":"Stacia","l":2100,"q":2}},{"type":"npc","id":"1016138","obj":{"i":1016138,"n":"Redbill Deckhand","l":2100,"q":1}},{"type":"npc","id":"1016139","obj":{"i":1016139,"n":"Stacia","l":2100,"q":1}},{"type":"npc","id":"1016140","obj":{"i":1016140,"n":"Curious Cat","l":2100,"q":1}},{"type":"instance","id":"30029","obj":{"i":30029,"n":"The Void Ark","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":175}},{"type":"quest","id":"67740","obj":{"i":67740,"n":"Sky Pirates","g":18,"l":"Ishgard","s":1,"f":1}},{"type":"quest","id":"67821","obj":{"i":67821,"n":"The Weeping City","g":18,"l":"The Sea of Clouds","s":3,"f":1}}]}