{"quest":{"name":"A Pair of Hearts","location":"Limsa Lominsa","id":67756,"patch":3.15,"sort":97,"icon":100499,"eventIcon":71221,"issuer":1016434,"target":1016448,"genre":196,"journal":["Lisette's distressed expression does not befit the festive air around her.<br>※This quest is available for a limited time only.","Lady Lisette has lost sight of her companion, Hortefense, who left his post without explanation. Lisette cannot bear his absence much longer, and she asks you to find him and tell him to return to his duties at once. Speak with the House Valentione servants around the Aftcastle and inquire as to Hortefense's whereabouts.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Hortefense has been seen in the company of a young lady, and reportedly is going to have their romantic fortune told. Look for the lovestruck servant among the crowds surrounding the fortune-tellers.","The fortune-teller informs you that Hortefense was there but a short while ago, but he rushed off to a destination unknown after hearing his reading. In his haste Hortefense left behind the Valentione's card of his partner, upon which the name “Lisette de Valentione” is written. The fortune-teller asks you to return the ticket to Lisette, who in fact may not even be aware of her involvement in this incident.","Not surprisingly, Lady Lisette states that she had no inkling of Hortefense's plans to have their fortunes read, and her mood quickly changes for the worse, for apparently Hortefense had written the wrong nameday on her Valentione's card. She storms off to look for her manservant, and bids you aid in her search.","You and Lisette find a despondent Hortefense sitting by himself in the Anchor Yard. Lady Lisette berates him for keeping her waiting for so long, and after a bit of prodding, Hortefense reveals the reason for his despair. He confesses that the truth revealed by the fortune-teller was one of the most unfavorable that she had ever delivered, causing Hortefense to flee the Aftcastle on the verge of tears. It is then that Lady Lisette reveals her manservant's mistake, stating that the only recourse is to visit the fortune-teller once again with the correct information. She returns to the Aftcastle, leaving you and Hortefense behind. He expresses his apprehension at the possibility of receiving yet another inauspicious reading, and asks that you attend them as House Valentione's ambassador of ardor and affection. Follow the star-crossed couple to the Aftcastle and observe the fateful augury.","Lady Lisette and Hortefense start the reading as soon as you arrive. With the correct information at her disposal, the fortune-teller divines the romantic fate of House Valentione's two servants. The fortune-teller reveals that Lady Lisette and Hortefense are more compatible in love than any other couple she has seen. Hortefense takes advantage of this rare moment to profess his true feelings to Lady Lisette, and asks her to join him in marriage. Lady Lisette, after overcoming her initial fluster, agrees to the union. Hortefense is overjoyed, and rushes back to attend to the Valentione's Day festivities with renewed vigor. Lisette de Valentione thanks you before setting off towards what is sure to be a future filled with ardor and affection."],"objectives":["Question the people in the Aftcastle.","Speak with the frank fortune-teller.","Deliver the forgotten card to Lisette de Valentione.","Search for Hortefense.","Speak with Hortefense."],"dialogue":[{"name":"LISETTE","text":"Godsdammit, has Hortefense still not returned!? No doubt he's been caught up spreading <span class=\"emphasis\">ardor and affection</span>... The oaf! Was ever a man so simpleminded!?"},{"name":"LISETTE","text":"Oh, it's you! Our honored ambassador returns, and not a moment too soon! My man Hortefense left his post most suddenly, with nary a word as to why. "},{"name":"LISETTE","text":"His absence has already been noted by a number of curious citizens. It makes me uneasy to have him gone for so long, particularly as more and more couples are pouring in to have their fortunes told. Who will answer their inquiries!?"},{"name":"LISETTE","text":"<span class=\"highlight\">Forename</span>, I must have Hortefense back! Pray search for him around the Aftcastle, and tell him to return posthaste!"},{"name":"LISETTE","text":"Hortefense could not have gone far. If you see him about the Aftcastle, pray tell him I wish for him to return to his post at once."},{"name":"MISSIONARY02220","text":"Hortefense? I spoke to him but a moment ago. He was quite animated, going on about how he must know his affinity for his beloved. No doubt he and his companion have joined the other doting couples waiting at the fortune-teller."},{"name":"MAIDVLT00315","text":"You are looking for Hortefense? I sighted him just over there, with a young woman on his arm, but I do not know where they are now. Ah, it fills me with delight to see one of our own find true love!"},{"name":"MISSIONARY02220","text":"Hortefense visited me with his companion but a moment ago, going on about how they must have their fortune told at once. They may be somewhere among all the other waiting couples."},{"name":"MAIDVLT00315","text":"I sighted Hortefense with a young woman by his side, but I cannot tell you where they are now. They may have escaped the crowds to somewhere more private. Mayhap to discuss a fortunate reading?"},{"name":"COMPATIBILITYLUCKTELLER2220","text":"Ah, yes, Hortefense did visit me. 'Twas altogether odd. He rushed off without a word immediately after hearing his fortune, looking absolutely crestfallen. Understandable, I suppose, given the results."},{"name":"COMPATIBILITYLUCKTELLER2220","text":"He left his partner's card here in his haste. The name written on it is Lisette de Valentione, but truth be told that lass he had with him bore little resemblance to my lady. Anyroad, 'twould be best to return it to her, but I've still many couples to attend to. Could you return this to Lady Lisette?"},{"name":"COMPATIBILITYLUCKTELLER2220","text":"'Twas quite odd. Hortefense rushed off without a word immediately after I read his fortune, to gods know where. He looked quite crestfallen... Understandable, I suppose, given the results."},{"name":"COMPATIBILITYLUCKTELLER2220","text":"He forgot his partner's Valentione's card in his haste. The name written here is Lisette de Valentione, but truth be told that lass he had with him bore little resemblance to my lady. Could you return this to Lady Lisette?"},{"name":"LISETTE","text":"You are returned! Well, what news of Hortefense?"},{"name":"LISETTE","text":"Wh-What!? He had his affinity for love foretold? But with whom? A hopeless blockhead like him could never hope to─"},{"name":"LISETTE","text":"\"Lisette de Valentione“!? Why, what is the meaning of this!?"},{"name":"LISETTE","text":"The idiot! The imbecile! To get this reading without even speaking a word to me!? And look at this! My nameday is wrong! Not even close!"},{"name":"LISETTE","text":"If he has the gall to do this without my consent, he could at least get the most important details right! <span class=\"highlight\">Forename</span>, help me find that lout before he ruins anything else. I swear, this day brings out the worst in him!"},{"name":"LISETTE","text":"Here he is! What is that stupid look on his face?"},{"name":"HORTEFENSE","text":"My life is naught but a tragedy! Wherefore do the gods sneer so cruelly at me and my beloved! I can hear them mocking us from the heavens!"},{"name":"LISETTE","text":"Hortefense! At last, I've found you!"},{"name":"HORTEFENSE","text":"L-Lady Lisette!?"},{"name":"LISETTE","text":"What the hells're you thinking!? Do you not care a whit for other people's feelings!? Just what've you been taking your sweet time with!? Explain yourself─and choose your words carefully!"},{"name":"HORTEFENSE","text":"I... Well, I... &lt;sigh&gt; How shall I explain...?"},{"name":"LISETTE","text":"Just spit it out, will you!? Enough of your stuttering! I know you visited the fortune-teller!"},{"name":"HORTEFENSE","text":"But... But how? Ah, it does not matter. It is true, I must confess. I approached the fortune-teller with another standing in as my lady. We had our destiny in love revealed to us..."},{"name":"LISETTE","text":"So the truth comes out at last. Well, perhaps we can glean something useful from your rashness after all. Pray tell us; what did the fortune-teller say?"},{"name":"HORTEFENSE","text":"She was loath to even tell me, it was so bleak. A reading this inauspicious only comes once an era, she said... My lady, we are doomed to sorrow and despair the likes of which even the most melancholy of songs could not convey! So opposed are the gods to our pairing, that to dare continue any kind of relationship would risk inviting the next Calamity!"},{"name":"LISETTE","text":"I see... And so downcast were you upon hearing this that you came here, to wallow in sorrow?"},{"name":"HORTEFENSE","text":"You have the right of it, my lady. Are you not moved to the verge of tears to hear of this misfortune?"},{"name":"LISETTE","text":"Moved? Moved!? The only moving part of this story is your idiocy! My nameday, Hortefense! Remember, I was born in the First <span class=\"emphasis\">Umbral</span> Moon! Not the First Astral Moon!"},{"name":"HORTEFENSE","text":"S-Surely you jest!? The First <span class=\"emphasis\">Umbral</span> Moon!? Bloody hells, what a fool I have been."},{"name":"LISETTE","text":"\"Fool“ would be putting it kindly! If <span class=\"highlight\">Forename</span> hadn't returned the card you left behind, then this mistake would never have come to light. In fact, forgetting the card might've been the <span class=\"emphasis\">one</span> thing you've managed to do right in this whole mess."},{"name":"LISETTE","text":"There may be a way to salvage this catastrophe after all. We shall have to get our fortune told again!"},{"name":"HORTEFENSE","text":"To think, of all things, I forgot her nameday! Fortunately, my lady is right. We have been given another chance at true and undying love! You have my─nay, <span class=\"emphasis\">our</span> thanks."},{"name":"HORTEFENSE","text":"Alas, trepidation still fills my heart. What if it turns out our fates are not intertwined? What if the outlook is still more grim than before? I doubt I could survive the shock."},{"name":"HORTEFENSE","text":"That is why we require all the support we can muster. Adventurer, as House Valentione's official ambassador of ardor and affection, your presence could make all the difference. Prithee attend us when we have our fortune revealed."},{"name":"HORTEFENSE","text":"Our house could not ask for a more devoted ally! I shall make for the fortune-teller forthwith, and there await your arrival!"},{"name":"LISETTE","text":"Can't even remember a woman's nameday... What am I to do with him?"},{"name":"COMPATIBILITYLUCKTELLER2220","text":"Ah, so my intuition was correct. I thought the lass Hortefense was with before was lacking Lady Lisette's characteristic enthusiasm. 'Tis a most peculiar turn of events, but if my lady commands it, I suppose I cannot go against her wishes."},{"name":"HORTEFENSE","text":"Adventurer! You are here at last! Now we shall know what the heavens have in store for us."},{"name":"LISETTE","text":"Finally! Now, let's get on with it!"},{"name":"COMPATIBILITYLUCKTELLER2220","text":"Patience, my lady! To divine the threads of fate is a delicate art. Now, let us begin. Lisette de Valentione, you were born in the First Umbral Moon, correct?"},{"name":"COMPATIBILITYLUCKTELLER2220","text":"Yes... 'Tis materializing before my eyes. The many threads of fate are coming together to form a tapestry illustrating your lives together..."},{"name":"COMPATIBILITYLUCKTELLER2220","text":"And what a tapestry! I foresee a couple more deeply in love, more enraptured with each other, than even Menphina and Oschon. This fortune, 'tis the most propitious I've ever seen!"},{"name":"COMPATIBILITYLUCKTELLER2220","text":"You mustn't let this moment pass! Confess! Confess your feelings for each other straightaway, and the destiny my reading has promised shall be fulfilled!"},{"name":"HORTEFENSE","text":"This...this is our destiny!? I do not know what to say... No, I do! Lady Lisette!"},{"name":"HORTEFENSE","text":"For long have I yearned for something more than this arrangement, this friendship. And it seems the Twelve favor my desire as well. I wish to call you my love, instead of just my lady. Lisette de Valentione, I wish for you to be my wife!"},{"name":"LISETTE","text":"Hortefense! Th-Think on what you're saying! Your...lover? Your...wife?"},{"name":"HORTEFENSE","text":"Since the day your angelic arms lifted me from those snowdrifts, I felt we were destined to one day be together. The outcome of this fortune...it is only the gods affirming the truth I knew all along!"},{"name":"HORTEFENSE","text":"I have made my confession. I only hope that you feel as I do."},{"name":"LISETTE","text":"I... Well... This is all so sudden. But, I cannot deny your ardor... Y-Yes! I accept!"},{"name":"HORTEFENSE","text":"Truly!? I had never dared to hope this day would come! Lady Lisette, words cannot express how happy you have made me! I promise you, every day together shall be more joyous than the last!"},{"name":"LISETTE","text":"Why, that goes without saying! Don't you dare think that your work is done just because I've condescended to marry you!"},{"name":"HORTEFENSE","text":"Of course, my love. In sickness and in health, for richer or poorer, my devotion shall remain ever steadfast!"},{"name":"HORTEFENSE","text":"Many thanks to you, adventurer! If not for your intervention, we would be but another lovelorn pair, oblivious to the depth of the affection that might blossom between us."},{"name":"LISETTE","text":"What the hells're <span class=\"emphasis\">you</span> smiling at!? Can't you see we are having a private moment! Don't just stand there gawking at the blushing maiden! For shame!"},{"name":"HORTEFENSE","text":"My love, let us return to lead the festivities. The strength of our bond shall be the guiding beacon for the many lost souls that still seek romance!"},{"name":"LISETTE","text":"I...I apologize for my outburst just now. I am not accustomed to such...excitement. I suppose I owe you my gratitude as well. May you also find happiness this Valentione's Day, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":248,"items":[{"id":13298},{"id":13567}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67755]}},"partials":[{"type":"npc","id":"1016434","obj":{"i":1016434,"n":"Lisette De Valentione","l":28,"q":2}},{"type":"npc","id":"1016448","obj":{"i":1016448,"n":"Hortefense","l":28,"q":1}},{"type":"item","id":"13298","obj":{"i":13298,"n":"Black-feathered Flat Hat","l":1,"c":41300,"t":34,"p":1500}},{"type":"item","id":"13567","obj":{"i":13567,"n":"Red-feathered Flat Hat","l":1,"c":41301,"t":34,"p":1500}},{"type":"quest","id":"67755","obj":{"i":67755,"n":"The Fault in Our Cards","g":196,"l":"Limsa Lominsa","s":96,"r":1}}]}