{"quest":{"name":"Monkey about Town","location":"Gridania","id":67753,"patch":3.1,"sort":94,"icon":100496,"eventIcon":71221,"issuer":1016387,"target":1016387,"genre":194,"journal":["The distressed saru bugyo looks pleadingly in your direction.<br>※This quest is available for a limited time only.","The saru bugyo, part of a Far Eastern delegation come to Eorzea, is attempting to infuse this year's Heavensturn with the good fortune of the monkey. His plan to have Jiromaru distribute rice cakes to the masses and thus improve relations between man and blessed beast, however, has encountered cyclopean-sized difficulties. Retrieve the advent cakes necessary to continue the festivities by participating in the FATE “Pounding Rice, Pounding Hearts” at one of the following locations: southeast of the Zephyr Gate in middle La Noscea; east of the Salt Strand in lower La Noscea; southeast of Bentbranch Meadows in the Central Shroud; south of Hyrstmill in the North Shroud; southeast of the Ul'dah Dispatch Yard in central Thanalan; and east of Camp Drybone in eastern Thanalan.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have successfully avoided being ground into a gooey paste while retrieving advent cakes for Jiromaru. Return to the saru bugyo in Gridania.","Pleased to see you safely returned from your task, the saru bugyo directs your attention to the effect Jiromaru's performance is having on the populace─it seems that the sticky rice cakes are the perfect medium for bringing monkey and man closer together. The saru bugyo then expresses his intention to continue with the mochi making for the duration of Heavensturn, and hopes that you are still inclined to assist with the unusually dangerous chore of mochi retrieval..."],"objectives":["Retrieve advent cakes for Jiromaru by participating in the FATE “Pounding Rice, Pounding Hearts.”","Report to the saru bugyo in Gridania."],"dialogue":[{"name":"MONKEYMISSIONARY","text":"You are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the adventuring persuasion, yes? I was told that those of your profession are often willing to lend aid to those in need, and I had hoped to impose upon your kindness..."},{"name":"MONKEYMISSIONARY","text":"Ah, but you must think my manners have deserted me. I am the saru bugyo, part of the Far Eastern delegation come to introduce our Heavensturn customs to Eorzea."},{"name":"MONKEYMISSIONARY","text":"When the season of Heavensturn arrives on our shores, we have a tradition wherein monkeys─creatures perceived as living symbols of good fortune─are welcomed into our towns as an integral part of the festivities. We would like to share this tradition with your people."},{"name":"MONKEYMISSIONARY","text":"Are you perhaps familiar with the practice?"},{"name":"CHOICE2Q1","text":"Are you familiar with the practice?"},{"name":"CHOICE2A1","text":"Yes"},{"name":"CHOICE2A2","text":"No"},{"name":"MONKEYMISSIONARY","text":"Ah, then you must also know how the joyful antics of the monkey are a beacon for harmonious and positive energies! You are well traveled, indeed!"},{"name":"MONKEYMISSIONARY","text":"It is common, you see, for monkeys to be recruited by our festival performers. The creatures' joyful antics are known to serve as a beacon for harmonious and positive energies!"},{"name":"MONKEYMISSIONARY","text":"I am saddened, then, that Eorzeans do not hold a favorable opinion of these playful beings. Quite the opposite, in fact─the monkey is a wild beast to be cast out and reviled! There is much to be done if we are to undo this undeserved reputation..."},{"name":"MONKEYMISSIONARY","text":"Thus did I consult with the mochi daikan, our master of rice cakes, and settled upon an event that will surely soften this antagonistic attitude. Our plan involves the making of a veritable mountain of rice cakes, and then having these fortuitous treats distributed to the masses by the very animal they appear to despise."},{"name":"MONKEYMISSIONARY","text":"As matters stand, we have been able to contact the Coliseum in Ul'dah, and organize some hulking cyclopes to begin pounding the rice on the outskirts of the city–states..."},{"name":"MONKEYMISSIONARY","text":"Unfortunately, however, this activity soon attracted the attention of several wild opo-opos, who proceeded to dart in and snatch handfuls of the freshly pounded mochi. I fear that such mischievous behavior will only reinforce the reputation of monkeys as pests..."},{"name":"MONKEYMISSIONARY","text":"Before these befurred omens of prosperity further damage our cause, I would ask that you retrieve the mochi from one of the cyclopes, and deliver it into the waiting paws of Jiromaru."},{"name":"MONKEYMISSIONARY","text":"He and his handler will travel behind, and join you at whichever rice pounding site you choose to visit."},{"name":"MONKEYMISSIONARY","text":"If you can but perform this one service, then the festivities may continue as planned! Jiromaru, our most gentle and magnificent companion, shall hand out advent cakes to all and sundry, filling both hearts and bellies with warm appreciation for all monkeykind!"},{"name":"SYSTEM","text":"Hoping to share their Heavensturn customs with the realm, the saru bugyo and his Far Eastern delegation have organized rice pounding sites across the lands of Eorzea. The FATE “Pounding Rice, Pounding Hearts” can be found at any of the following locations:"},{"name":"SYSTEM","text":"Southeast of the Zephyr Gate in middle La Noscea; east of the Salt Strand in lower La Noscea; southeast of Bentbranch Meadows in the Central Shroud;"},{"name":"SYSTEM","text":"South of Hyrstmill in the North Shroud; southeast of the Ul'dah Dispatch Yard in central Thanalan; and east of Camp Drybone in eastern Thanalan."},{"name":"SYSTEM","text":"Complete the FATE by retrieving advent cakes for Jiromaru, then return to the saru bugyo with news of your success."},{"name":"RICECAKEREEVE","text":"I am the mochi daikan, and the making of mochi is my calling! Have you partaken of this treat before? You may know them better as “rice cakes.”"},{"name":"RICECAKEREEVE","text":"They are made by filling a mortar with freshly steamed rice, then pounding the whole into a glutinous mass. This is then coated with fine-ground starch, and rolled into balls─they are simply divine, I assure you! In the lands of the Far East, a festival would not feel like a festival without them!"},{"name":"RICECAKEREEVE","text":"The strongest arm makes the best mochi─this is known. Thus we hit upon the idea of borrowing some brutally powerful cyclopes from the Coliseum..."},{"name":"RICECAKEREEVE","text":"Such is the terrible force of their blows, however, that anyone attempting to retrieve the mochi risks becoming an unpalatable part of the treat!"},{"name":"MONKEYMISSIONARY","text":"Jiromaru and his handler will, in a manner that may seem quite miraculous, be present at whichever rice pounding site you elect to visit. Any rice cakes you manage to rescue should be handed over to them. May the fortune of the monkey attend you!"},{"name":"RICECAKEREEVE","text":"You've retrieved our mochi, have you!? Off to the saru bugyo with you, then!"},{"name":"MONKEYMISSIONARY","text":"Adventurer, glad I am to see you returned unharmed from your treacherous task! The advent cakes you collected have been starched and rolled and made ready for the festival!"},{"name":"MONKEYMISSIONARY","text":"See for yourself! Jiromaru hands out our Heavensturn treats even as we speak!"},{"name":"RESIDENTS02217","text":"I heard they were performing some Far Eastern custom outside the city, and went to see what all the fuss was about. When I saw what those opo-opos were doing, I thought for certain they were stealing the rice..."},{"name":"RESIDENTS02217","text":"But it seems that I was mistaken─it was all part of the performance! They were taking the rice treats so that the, uh, <span class=\"emphasis\">well-fed</span> opo-opo could hand them out in town!"},{"name":"RESIDENTS02217","text":"Those clever beasts were even trying to stop foolish adventurers from being injured by shooing them away from that nasty cyclops. And here I thought opo-opos were naught but a nuisance!"},{"name":"RICECAKEREEVE","text":"I'm afraid events have been somewhat misunderstood...but I suppose the result is what matters!"},{"name":"RICECAKEREEVE","text":"If people have begun to see monkeys in a more favorable light, then our mission here is a success. May the sticky goodness of mochi bind us all closer together! Gahahaha!"},{"name":"MONKEYMISSIONARY","text":"Well, let us hope that this proves to be the turning point for Eorzean appreciation for monkeys and the fortune they bring. We are most grateful for your assistance!"},{"name":"MONKEYMISSIONARY","text":"And as our custom has been so well received, we have decided to continue making and distributing rice cakes for the duration of the festival. We would be most appreciative should you choose to aid us again!"},{"name":"RICECAKEREEVE","text":"（★未使用／削除予定★）"}],"reward":{"gil":229,"items":[{"id":13295},{"id":13296},{"id":13297}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1016387","obj":{"i":1016387,"n":"Saru Bugyo","l":53,"q":1}},{"type":"item","id":"13295","obj":{"i":13295,"n":"See No Helm","l":1,"c":40225,"t":34,"p":83}},{"type":"item","id":"13296","obj":{"i":13296,"n":"Speak No Helm","l":1,"c":40227,"t":34,"p":83}},{"type":"item","id":"13297","obj":{"i":13297,"n":"Hear No Helm","l":1,"c":40226,"t":34,"p":83}}]}