{"quest":{"name":"Aligning the Stars","location":"Ul'dah","id":67757,"patch":3.2,"sort":98,"icon":100519,"eventIcon":71221,"issuer":1016354,"target":1016356,"genre":198,"journal":["A reporter from the <span class=\"emphasis\">Mythril Eye</span> is eager to hear your opinion.<br><br>※This quest is available for a limited time only.","You stop when a news reporter from the <span class=\"emphasis\">Mythril Eye</span> asks you for your candid opinion on the newly formed ensemble, the Songbirds, scheduled to perform at the coming Little Ladies' Day festival. Upon confessing your ignorance, he reveals that the group's rise to stardom hasn't been as smooth as was expected and that most of the realm remains unaware of their existence. Sensing your curiosity may be piqued, the reporter suggests you go and speak with the royal seneschal at the Ruby Road Exchange.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak with the royal seneschal and he expresses his concerns over the Songbirds' lack of notoriety. At wit's end, he turns to you, requesting that you help him promote his group. Speak with the royal servant to see what you can do."],"objectives":["Speak with the royal seneschal."],"dialogue":[{"name":"REPORTER02221","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>! <span class=\"alternative-container\"><span class=\"alternative\">Ma'am</span><span class=\"alternative\">Sir</span></span>! I'm a reporter from the <span class=\"emphasis\">Mythril Eye</span> and am interviewing adventurers such as yourself for an exclusive feature on Little Ladies' Day. Might I borrow but a moment of your time to ask a few questions?"},{"name":"REPORTER02221","text":"Fantastic! As you may have heard, the Songbirds─a trio of talented pre–teen troubadours─are headlining this year's festival. Tell me, what do you think of them?"},{"name":"REPORTER02221","text":"You've <span class=\"emphasis\">never</span> heard of the Songbirds?"},{"name":"REPORTER02221","text":"Well, you wouldn't be the first. While the girls have been hard at work trying to liven up the festivities, it would seem their efforts have gone largely unnoticed."},{"name":"REPORTER02221","text":"Ever since the esteemed F'lhaminn retired, no star of noteworthy ability has come to grace the stages of Ul'dah. We at the <span class=\"emphasis\">Mythril Eye</span> have been following their story in hopes that the Songbirds would be able to fill that void she left behind."},{"name":"REPORTER02221","text":"Were they to catch fire, it would serve to bolster the city–state's economy but, as it stands, they are still relative unknowns."},{"name":"REPORTER02221","text":"This is the extent of my knowledge, but if you're interested in learning more, I'm sure the royal seneschal would be happy to oblige. Seeing as he's in charge of organizing the festivities, you should be able to find him at the Ruby Road Exchange."},{"name":"REPORTER02221","text":"Was he not at the Exchange? I could have sworn I passed him not a quarter bell past."},{"name":"BUTLER","text":"Yes, that is correct. I am the seneschal of the Royal House of Ul and am tasked with overseeing this year's Little Ladies' Day festivities. How may I be of assistance?"},{"name":"BUTLER","text":"You're here to learn more about this year's main event, the Songbirds? Yes, yes, of course! They'll be performing on Emerald Avenue and I presume you'll be coming. In fact, just to be absolutely certain, allow me to present you with one of these fly─"},{"name":"DIVAS02221","text":"Hellooo! "},{"name":"BUTLER","text":"Ah, excellent timing, girls! This adventurer was just inquiring after you, but seeing as you're all here, why not introduce yourselves?"},{"name":"ULALA","text":"Good to meet you. I'm Ulala─soon to be Eorzea's premier songstress. And you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, are soon to be my biggest fan!"},{"name":"NARUMI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good afternoon</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. I'm Narumi. We have practiced day and night for this opportunity and would be honored if you were to attend our next performance."},{"name":"MASHAMHAKARACCA","text":"I'm Masha Mhakaracca, but you can call me Masha. My tongue may not be as sweet as Ulala's, but what I lack in charm, I make up for with my danc─"},{"name":"ULALA","text":"Masha, what exactly is that supposed to mean!? Unlike <span class=\"emphasis\">some</span> people, I'm trying to gain recognition for our group. To do so, it's important to pour on a bit of charm...and if you are without, well, I have more than enough for the both of us!"},{"name":"MASHAMHAKARACCA","text":"Is that so? Then why was Narumi able to hand out twice as many flyers as you?"},{"name":"BUTLER","text":"Enough with the incessant prattling! Need I remind you this type of behavior is a quick way to lose potential fans? Please, take a moment to go and compose yourselves!"},{"name":"BUTLER","text":"My apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. &lt;sigh&gt; With them constantly at one another's throats, it can be rather difficult to get things done. Sadly, however, that is not our biggest problem at present."},{"name":"BUTLER","text":"You see, there are few who are aware of the Songbirds' existence and fewer still who will attend performances. Time is running out and we are nowhere closer to gaining recognition from the good people of Ul'dah than when we first began."},{"name":"BUTLER","text":"Adventurer, what would you say to lending a hand in making three young girls' dreams come true? I can't help but feel it must be fate that brought you to us, just as we were about to lose all hope."},{"name":"BUTLER","text":"You will? This is most wonderful news! Please speak to one of my staff and they will set you straight to work! "},{"name":"REPORTER02221","text":"（★未使用／削除予定★）"}],"reward":{"gil":220,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67758]},"partials":[{"type":"npc","id":"1016354","obj":{"i":1016354,"n":"Mythril Eye Reporter","l":40,"q":1}},{"type":"npc","id":"1016356","obj":{"i":1016356,"n":"Royal Seneschal","l":40,"q":2}},{"type":"quest","id":"67758","obj":{"i":67758,"n":"Sugar, Spice, and Everything Rice","g":198,"l":"Ul'dah","s":99,"r":1}}]}