{"quest":{"name":"Coming into Its Own","location":"Azys Lla","id":67750,"patch":3.15,"sort":4,"repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1016135,"target":1016136,"involved":[1016290],"genre":74,"usedItems":[13577,13578,13579,13580],"journal":["Ardashir is concerned about the anima's growth.<br>※Changing classes or jobs will prevent progress during this quest.","The anima has grown at a rattling pace, absorbing large amounts of aether in the process. Ardashir fears this rapid development may exceed the limits of the soulstone serving as its base. To ensure all your hard work is not wasted, he plans to fortify the soulstone, as well as have Gerolt forge a new weapon to hold it. This new weapon, however, will require four materials essential for conducting large quantities of aether: enchanted rubber, fast-drying carboncoat, fast-acting Allagan catalyst, and divine water. Gerolt suggests seeking out a merchant named Cristiana at the House of Splendors in Mor Dhona who may have what he requires.<br><br>※You may not proceed with a class or job that is different from when you accepted this quest.","Cristiana's wares are limited, but she does, in fact, have what you seek. If only it were as simple as paying her in gil. She demands several expertly exotic goods in exchange for the materials Gerolt asked for. Whether you fashion them, find them, or trade for them, you must acquire what Gerolt needs if you are to complete the anima weapon.","You acquire the materials necessary to affix the anima's soulstone to a new weapon. Gerolt takes up his hammer and once again puts his legendary skills to work. The familiar ring of his hammer fills the air, but the medley soon comes to a halt. His latest masterpiece is complete, and your weapon is born anew! You hold it aloft, basking in its light, when what appears to be a sprite takes shape before you and thanks you for all you have done. You smile and nod, knowing your journey together has only just begun."],"objectives":["With <span class=\"alternative-container\"><span class=\"alternative\">Hauteclaire Awoken and Prytwen Awoken</span><span class=\"alternative\">Rising Suns Awoken</span><span class=\"alternative\">Parashu Awoken</span><span class=\"alternative\">Brionac Awoken</span><span class=\"alternative\">Berimbau Awoken</span><span class=\"alternative\">Seraph Cane Awoken</span><span class=\"alternative\">Lunaris Rod Awoken</span><span class=\"alternative\">Almandal Awoken</span><span class=\"alternative\">Elements Awoken</span><span class=\"alternative\">Yukimitsu Awoken</span><span class=\"alternative\">Ferdinand Awoken</span><span class=\"alternative\">Deathbringer Awoken</span><span class=\"alternative\">Atlas Awoken</span></span> equipped or in your inventory, speak with Cristiana in Revenant's Toll.","With <span class=\"alternative-container\"><span class=\"alternative\">Hauteclaire Awoken and Prytwen Awoken</span><span class=\"alternative\">Rising Suns Awoken</span><span class=\"alternative\">Parashu Awoken</span><span class=\"alternative\">Brionac Awoken</span><span class=\"alternative\">Berimbau Awoken</span><span class=\"alternative\">Seraph Cane Awoken</span><span class=\"alternative\">Lunaris Rod Awoken</span><span class=\"alternative\">Almandal Awoken</span><span class=\"alternative\">Elements Awoken</span><span class=\"alternative\">Yukimitsu Awoken</span><span class=\"alternative\">Ferdinand Awoken</span><span class=\"alternative\">Deathbringer Awoken</span><span class=\"alternative\">Atlas Awoken</span></span> in your inventory, deliver the merchant goods to Gerolt in Azys Lla."],"dialogue":[{"name":"SYSTEM","text":"Please note that upon completing the quest “Coming into Its Own,” you will receive an anima weapon for <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Undertake this quest as another job."},{"name":"A2","text":"Undertake this quest as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Be advised that once you have undertaken this quest, you may not proceed with a class or job that is different from when you accepted it."},{"name":"SYSTEM","text":"Please ensure you have changed to your desired job before speaking with Ardashir."},{"name":"SYSTEM","text":"In order to receive the quest “Coming into Its Own,” you must be equipped with [Error] and [Error]."},{"name":"SYSTEM","text":"In order to receive the quest “Coming into Its Own,” you must be equipped with [Error]."},{"name":"SYSTEM","text":"You have already received [Error] and [Error]. Please change to a different job and speak with Ardashir again."},{"name":"SYSTEM","text":"You have already received [Error]. Please change to a different job and speak with Ardashir again."},{"name":"ARDASHIR","text":"The anima's growth thus far is well beyond what I expected. By absorbing aether during our travels, it has matured enough to take on a form separate from the weapon, and even speak to <span class=\"highlight\">Forename</span>."},{"name":"ARDASHIR","text":"To grow so quickly would have required a substantial amount of aether. However, the soulstone is not without its limits. As it continues to absorb aether and grow, I fear it may not bear the strain of further development."},{"name":"GEROLT","text":"Yer tellin' me after all the work <span class=\"emphasis\">I</span> did, the anima could swell up like a Bombard an' burst!? Ye better have a plan to fix it, 'cause I sure as hells ain't startin' over."},{"name":"ARDASHIR","text":"Who exactly do you think you are talking to? This is <span class=\"emphasis\">my</span> life's work, short a time as that may be. Of course I have a plan."},{"name":"ARDASHIR","text":"If we can reinforce the soulstone and increase its capacity for aetheric energies, it should remain stable. I will speak with Rowena and see to collecting what we require."},{"name":"GEROLT","text":"Ah, ye had me fooled when you was beggin' and pleadin' to see those Sharlayan books before. Good to know yer incompetence was only fer show. Well, seein' as ye have everythin' under control, if ye don't mind I think I'll─"},{"name":"ARDASHIR","text":"Run off to some tavern to get deep in your cups? Sadly you haven't the time nor the coin for it. Not when you have a new weapon to make for our friend <span class=\"highlight\">Forename</span> here."},{"name":"GEROLT","text":"A new weapon!? I just finished fixin' the one <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has now. Why the hells do ye need another?"},{"name":"ARDASHIR","text":"Just as we develop and change over time, it is only fitting the anima should as well. Or do you mean to tell me you were always such a gentleman, even as a child?"},{"name":"GEROLT","text":"&lt;sigh&gt; It never ends, does it? Fine, if it'll help settle me debt with Rowena, ye'll have yer bleedin' weapon."},{"name":"GEROLT","text":"If we're attachin' the soulstone to a new weapon, we're gonna need materials fer conductin' aether. That's where you come in."},{"name":"GEROLT","text":"I need ye to go and fetch me some enchanted rubber, fast-drying carboncoat, fast-acting Allagan catalyst, and divine water."},{"name":"GEROLT","text":"I know a lass in Mor Dhona what sells 'em─Cristiana's her name. Like as not, ye'll find her keepin' a corner somewhere at the House o' Splendors. They won't come cheap, but yer a resourceful sort. I'm sure ye'll think o' somethin'."},{"name":"ARDASHIR","text":"This anima has grown remarkably fast. Judging by the rise in its aetheric levels, we'll soon need to reinforce the soulstone for this one as well."},{"name":"GEROLT","text":"Meanin' I have to fire up the forge again, eh? Well, <span class=\"highlight\">Forename</span>, that means there's work for you as well."},{"name":"GEROLT","text":"We're gonna need another round of enchanted rubber, fast-drying carboncoat, fast-acting Allagan catalyst, and divine water."},{"name":"GEROLT","text":"Go and speak with Cristiana at the House o' Splendors. She should be able to get you what we need."},{"name":"CRISTIANA","text":"A customer? A customer! You are a customer, aren't you? I mean, I realize this isn't a proper stall, but I do have wares to sell. That is, if, um, you're willing to buy them. Have you come to buy my wares?"},{"name":"CRISTIANA","text":"Aether-conductive materials? I think I have what you're looking for, but it won't come cheap!"},{"name":"CRISTIANA","text":"Truth be told, I don't get buyers for these items all that often, but now that I have you─my new favorite customer─I'm sure to turn a profit, and then I can build a stall of my very own!"},{"name":"CRISTIANA","text":"But I don't want your gil! No, dealing with gil is much too messy. What with all the counting, and sorting, and finding a place to─ Ahem. Bartering is much simpler, don't you think? There are a few things I'd be willing to trade for, if you're interested."},{"name":"CRISTIANA","text":"A customer? A customer! Oh, and a returning one at that! You did come to buy something, didn't you? I mean, I realize this isn't a proper stall, but I still have wares to sell. That is, if, um, you're willing to buy them. Have you come to buy my wares?"},{"name":"CRISTIANA","text":"Is that not what you asked for last time? I mean, I <span class=\"emphasis\">think</span> that's what you asked for. I recall something about rubber and water, and─ Ahem, excuse me. If that's what you're looking for, then you know what I'll need in exchange."},{"name":"SYSTEM","text":"The goods requested by Cristiana can be obtained through various means including dungeons, tribal quests, and crafting."},{"name":"SYSTEM","text":"Speak with other players and share information to discover how to find them!"},{"name":"GEROLT","text":"Get everythin' we need? Good. Hand it all over─the weapon, too."},{"name":"GEROLT","text":"Ardashir's ready to work on the soulstone, and he won't shut up about it. At least now it'll all be over."},{"name":"GEROLT","text":"Oi, I thought ye said ye had everything we need!"},{"name":"GEROLT","text":"That's enchanted rubber, fast-drying carboncoat, fast-acting Allagan catalyst, and divine water. If yer missing somethin', hurry on back to Cristiana."},{"name":"GEROLT","text":"Good on ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Now then, let's make us a weapon, eh?"},{"name":"GEROLT","text":"&lt;pant&gt; &lt;pant&gt; Can't say I've ever forged somethin' quite so extraordinary. A weapon fit for yer growin' anima. Nay, something more than that."},{"name":"GEROLT","text":"A beauty worthy o' ballads─Almace, a sword without equal. Together with Ancile, the gods themselves'd be hard-pressed to lay a blow on ye."},{"name":"GEROLT","text":"A beauty worthy o' ballads─Verethragna. The gods themselves'd be jealous o' knuckles so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Ukonvasara. The gods themselves'd be jealous of an axe so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Rhongomiant. The gods themselves'd be jealous of a lance so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Gandiva. The gods themselves'd be jealous of a bow so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Majestas. The gods themselves'd be jealous of a staff so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Hvergelmir. The gods themselves'd be jealous of a staff so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Draconomicon. The gods themselves'd be jealous of a tome so fine. "},{"name":"GEROLT","text":"A beauty worthy o' ballads─Tetrabiblos. The gods themselves'd be jealous of a tome so fine."},{"name":"GEROLT","text":"A beauty worthy o' ballads─Kannagi. The gods themselves'd be jealous of a pair o' blades so fine."},{"name":"GEROLT","text":"A beauty worthy o' ballads─Nothung. The gods themselves'd be jealous of a blade so fine."},{"name":"GEROLT","text":"A beauty worthy o' ballads─Armageddon. The gods themselves'd be jealous of a firearm so fine."},{"name":"GEROLT","text":"A beauty worthy o' ballads─Deneb. The gods themselves'd be jealous of an astrolabe so fine."},{"name":"BUKINOSEIREI","text":"(-???-)Thank...you..."},{"name":"GEROLT","text":"Wait till Rowena takes a gander at this. We keep this up an' she'll be givin' <span class=\"emphasis\">me</span> notes o' promise."},{"name":"ARDASHIR","text":"To be honest, I once questioned what use I had for a drunkard with a hammer. But you have proven yourself to be quite the competent blacksmith─when you're sober."},{"name":"ARDASHIR","text":"<span class=\"highlight\">Forename</span>, I am at a loss as to how to express my thanks. You looked danger in the eye, unflinching, risking life and limb to help me. I hope someday I can repay your kindness."},{"name":"GEROLT","text":"(Tch. Sure <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> carried it around a bit, but I <span class=\"emphasis\">made</span> the damned thing! Don't I deserve a little more than left-handed compliments?)"},{"name":"ARDASHIR","text":"What!? The anima manifested again? When?"},{"name":"ARDASHIR","text":"But I didn't see anything. Are you certain?"},{"name":"ARDASHIR","text":"Why is it that only you are able to see the anima when it chooses to present itself?"},{"name":"GEROLT","text":"Maybe it's got no interest in the likes o' you."},{"name":"ARDASHIR","text":"I suppose the anima is not yet strong enough. Perhaps one day, after it has fully matured, we too will be able to behold its wonders."},{"name":"ARDASHIR","text":"This calls to mind Thavnairian literature on the Zodiac Braves, legendary heroes who wielded arms of unparalleled strength."},{"name":"ARDASHIR","text":"But soon they will tell tales of a new legend─of you and your anima weapon!"},{"name":"GEROLT","text":"Now don't be gettin' ahead o' yerself, lad. There's no denying it's a beauty, but there's still room for improvement."},{"name":"GEROLT","text":"Ye just said yerself the anima ain't fully matured yet."},{"name":"ARDASHIR","text":"I do not need <span class=\"emphasis\">you</span> to remind me of such things."},{"name":"ARDASHIR","text":"I have kept a rather comprehensive account of everything we have done thus far. With all the data I have collected, it is only a matter of time before the next step in fostering the anima is clear."},{"name":"ARDASHIR","text":"Which reminds me, <span class=\"highlight\">Forename</span>. If you would care to read over my notes on our work, you are more than welcome to pore over them at your leisure. They are on the table just over there."},{"name":"GEROL","text":"(Aye, that's the way, lad. Every step that brings us closer to finishin' this bleedin' weapon brings me a step closer to a life free from debt and that gil-swindlin' wench Rowena.)"},{"name":"ARDASHIR","text":"Again we have succeeded in creating an anima weapon! Excellent work."},{"name":"ARDASHIR","text":"You say the anima has manifested itself yet again? That is good to hear."},{"name":"ARDASHIR","text":"Much like the last, I look forward to the day I can behold its wonder with my own eyes."},{"name":"ARDASHIR","text":"All the more reason I must continue my research! Our work is without precedent, 'tis true, but I will not be deterred."},{"name":"SYSTEM","text":"Your weapon has been forged anew, and the anima's strength blossoms!"}],"reward":{"gil":1512,"items":[{"id":13223},{"id":13236},{"id":13224},{"id":13225},{"id":13226},{"id":13227},{"id":13231},{"id":13232},{"id":13233},{"id":13234},{"id":13228},{"id":13229},{"id":13230},{"id":13235}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":107}],"quests":[67749]},"next":[67820]},"partials":[{"type":"npc","id":"1016135","obj":{"i":1016135,"n":"Ardashir","l":2101,"q":11}},{"type":"npc","id":"1016136","obj":{"i":1016136,"n":"Gerolt","l":2101,"q":4}},{"type":"npc","id":"1016290","obj":{"i":1016290,"n":"Cristiana","l":67,"s":1,"q":1,"t":"Anima Weapon Modification","r":1,"a":1392,"c":[21.39,5.5]}},{"type":"item","id":"13223","obj":{"i":13223,"n":"Almace","l":210,"c":30537,"t":2}},{"type":"item","id":"13236","obj":{"i":13236,"n":"Ancile","l":210,"c":30130,"t":11}},{"type":"item","id":"13224","obj":{"i":13224,"n":"Verethragna","l":210,"c":31103,"t":1}},{"type":"item","id":"13225","obj":{"i":13225,"n":"Ukonvasara","l":210,"c":31508,"t":3}},{"type":"item","id":"13226","obj":{"i":13226,"n":"Rhongomiant","l":210,"c":31908,"t":5}},{"type":"item","id":"13227","obj":{"i":13227,"n":"Gandiva","l":210,"c":32304,"t":4}},{"type":"item","id":"13231","obj":{"i":13231,"n":"Majestas","l":210,"c":32684,"t":9}},{"type":"item","id":"13232","obj":{"i":13232,"n":"Hvergelmir","l":210,"c":33052,"t":7}},{"type":"item","id":"13233","obj":{"i":13233,"n":"Draconomicon","l":210,"c":33538,"t":10}},{"type":"item","id":"13234","obj":{"i":13234,"n":"Tetrabiblos","l":210,"c":33539,"t":98}},{"type":"item","id":"13228","obj":{"i":13228,"n":"Kannagi","l":210,"c":33891,"t":84}},{"type":"item","id":"13229","obj":{"i":13229,"n":"Nothung","l":210,"c":34264,"t":87}},{"type":"item","id":"13230","obj":{"i":13230,"n":"Armageddon","l":210,"c":34664,"t":88}},{"type":"item","id":"13235","obj":{"i":13235,"n":"Deneb","l":210,"c":34864,"t":89}},{"type":"item","id":"13577","obj":{"i":13577,"n":"Enchanted Rubber","l":1,"c":22658,"t":61}},{"type":"item","id":"13578","obj":{"i":13578,"n":"Fast-drying Carboncoat","l":1,"c":27615,"t":61}},{"type":"item","id":"13579","obj":{"i":13579,"n":"Divine Water","l":1,"c":22659,"t":61}},{"type":"item","id":"13580","obj":{"i":13580,"n":"Fast-acting Allagan Catalyst","l":1,"c":27616,"t":61}},{"type":"quest","id":"67749","obj":{"i":67749,"n":"Toughening Up","g":74,"l":"Azys Lla","s":3,"r":1,"f":1}},{"type":"quest","id":"67820","obj":{"i":67820,"n":"Finding Your Voice","g":74,"l":"Azys Lla","s":5,"r":1,"f":1}}]}