{"quest":{"name":"The Lead Starling","location":"Ul'dah","id":67759,"patch":3.2,"sort":100,"icon":100521,"eventIcon":71221,"issuer":1016356,"target":1016356,"genre":198,"usedItems":[13741],"journal":["The royal seneschal has something important to discuss with you.<br><br>※This quest is available for a limited time only.","The royal seneschal has been busy pondering ways in which he can ensure the girls' continued success and has concluded a leader must be appointed among them. He tells you that the Songbirds' new face is to be determined by popular vote, and that all who have played an active role in supporting the girls, including you, are eligible to vote. Depending on the number of certificates of collaboration you would like to use to cast your vote, speak with either the slight servant or the stout servant.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After voting, report back to the royal seneschal at the Ruby Road Exchange.","You speak with the royal seneschal who is confident that determining a leader has lent the Songbirds a new strength. The Little Ladies' Day festival, however, is still far from over, and he tells you that should you be interested in helping them further, there are still plenty of rice cakes that need handing out."],"objectives":["Hand your certificates of collaboration to either the slight servant or the stout servant.","Report to the royal seneschal."],"dialogue":[{"name":"BUTLER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good afternoon</span></span>, adventurer! Your timing couldn't be better! As it so happens, I have one last favor to ask of you."},{"name":"BUTLER","text":"While the Songbirds have made a name for themselves on the streets of Ul'dah, I fear our current strategy of handing out sweets and flyers may not be enough to propel them towards their ultimate goal."},{"name":"BUTLER","text":"Instead, what they need is a leader─someone charismatic who, like glue, will hold the group together even through the worst of times. To this end, I've decided to hold a vote on who would best represent them as a whole."},{"name":"BUTLER","text":"All votes except yours are in, and it looks to be a close competition─so close, in fact, that your one vote may end up being the one to decide it all! Choose carefully, <span class=\"highlight\">Forename</span>, and take our Songbirds to new heights!"},{"name":"BUTLER","text":"The certificates of collaboration you have received will identify you as one of our contributors. Please hand them to either the slight gentleman over there or the stout fellow beside him, and tell them who it is you believe to be most worthy of being crowned leader."},{"name":"SYSTEM","text":"While the reward will remain the same, the outcome for this quest will change based upon whether you decide to vote using one or twenty certificates of collaboration. If you would like to vote using a single certificate, speak with the slight servant. If you would like to vote using twenty certificates, speak with the stout servant."},{"name":"BUTLER","text":"Please hand your certificates of collaboration to either the slender gentleman just over there or the stout fellow beside him."},{"name":"SYSTEM","text":"While the reward will remain the same, the outcome for this quest will change based upon whether you decide to vote using one or twenty certificates of collaboration. If you would like to vote using a single certificate, speak with the slight servant. If you would like to vote using twenty certificates, speak with the stout servant."},{"name":"ATTENDANTA02223","text":"Ah, our last voter has finally arrived! Before we begin, might I mention that should you use twenty certificates on this vote, your Songbird of choice may have a higher chance of winning. Even so, if you wish to proceed with only one, I shall be happy to accept your certificate."},{"name":"SYSTEM","text":"You may only participate in this vote once. If you would like to cast your vote using twenty certificates of collaboration, go and speak with the stout servant. Please note that while the outcome may differ, the reward will remain unchanged."},{"name":"ATTENDANTA02223","text":"You mean to say you are not currently in possession of any certificates of collaboration? Hm... Do you spy the hefty man beside the royal seneschal? He should be handing some out, so might I suggest you go and speak with him?"},{"name":"Q1","text":"You may only vote once. Are you sure you would like to proceed with just one certificate of collaboration?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."},{"name":"Q2","text":"Who would you like to vote for?"},{"name":"A2","text":"Ulala."},{"name":"A2","text":"Narumi."},{"name":"A2","text":"Masha."},{"name":"A2","text":"Cancel."},{"name":"ULALA","text":"You mean to say that I'm the leader!? Am I surprised? O–Of course, not! After all, it is my destiny to become the number one songstress in Eorzea!"},{"name":"ULALA","text":"...And though destiny it may be, I would like to thank you for your support, <span class=\"highlight\">Forename</span>. It takes a very special kind of person to believe in another's dreams. Not only did you believe in mine but you also provided me with a stepping-stone towards them."},{"name":"ULALA","text":"Rest assured I won't be squandering this wonderful opportunity! In fact, it shouldn't be long before the Songbirds are performing on stages throughout the realm, so sit tight and behold the magic yet to come!"},{"name":"NARUMI","text":"<span class=\"emphasis\">I–I'm</span> the new leader of the Songbirds!? I–It's such a huge responsibility─one I'm not entirely sure I'm ready to accept─but I owe it to you and everyone else who has voted for me to rise to the challenge."},{"name":"NARUMI","text":"I am aware that I still have much to learn, but my team has put their faith in me. For their sakes as much as mine, I must ensure the Songbirds' success. I intend to aim for the skies and, in time, have even the sparrows gathering along the rooftops to tweet along to our tunes."},{"name":"NARUMI","text":"In fact, I'll work so hard that wherever you may go, you will be sure to hear our name in whispered rumors, and see our achievements in portraits plastered on walls. No corner of Eorzea will be left untouched─that way you'll never forget us!"},{"name":"MASHAMHAKARACCA","text":"<span class=\"emphasis\">Me</span>, the leader!? Are you sure? I–I hardly dare believe it. While there's no denying a part of me is apprehensive, if there's anything I learned from being a part of the Songbirds, it's that I need to start trusting in my own abilities."},{"name":"MASHAMHAKARACCA","text":"I will show our fans that their faith in me is not misplaced, and that nothing will stop the Songbirds from rising above and beyond all expectations! With Narumi and Ulala at my side, what could go possibly wrong?"},{"name":"MASHAMHAKARACCA","text":"Thank you again, <span class=\"highlight\">Forename</span>. With all that you've done for us, I'm in no position to ask for favors, but if you could just promise me one thing─when you find the time between your extraordinary adventures, you'll come visit us won't you?"},{"name":"ATTENDANTB02223","text":"I see that not only have you decided on who you would like to vote for, but you're also willing to do so with twenty of your certificates of collaboration! My, won't she be pleased to know she has such an avid supporter in you!"},{"name":"SYSTEM","text":"You may only participate in this vote once. If you would like to cast your vote using a single certificate of collaboration, go and speak with the slight servant. Please note that while the outcome may differ, the reward will remain unchanged."},{"name":"ATTENDANTA02223","text":"Have you misplaced your certificates of collaboration? Or forgotten them, perhaps? No matter! The tall man just over yonder should have what you're looking for, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>."},{"name":"Q3","text":"You may only vote once. Are you sure you would like to proceed with twenty certificates of collaboration?"},{"name":"A3","text":"Yes."},{"name":"A3","text":"No."},{"name":"Q4","text":"Who would you like to vote for?"},{"name":"A4","text":"Ulala."},{"name":"A4","text":"Narumi."},{"name":"A4","text":"Masha."},{"name":"A4","text":"Cancel."},{"name":"ULALA","text":"You mean to say that I'm the leader!? Am I surprised? O–Of course, not! After all it is my destiny to become Eorzea's number one songstress!"},{"name":"ULALA","text":"...And though destiny it may be, I would like to thank you for your support, <span class=\"highlight\">Forename</span>. As often as I come across as overconfident, I know deep down that dreams are fragile things, easily shattered in but a moment's oversight."},{"name":"ULALA","text":"I can't tell you how happy I was, watching as you pulled in one person after another until we had crowds─actual crowds, <span class=\"highlight\">Forename</span>─coming and chanting our names. You gave us strength when we needed it most and there is no greater gift than that."},{"name":"ULALA","text":"But enough of that! The reason you love me is for my unshakable confidence and wily charm! Now that I'm here to stay, you'll most certainly be seeing even more of it."},{"name":"ULALA","text":"<span class=\"highlight\">Forename</span>, never in history has anyone made a finer choice than the one you've made today! You're leaving the Songbirds in good hands. With me leading the way, we'll be unstoppable!"},{"name":"NARUMI","text":"<span class=\"emphasis\">I–I'm</span> the new leader of the Songbirds!? I–It's such a huge responsibility─one I'm not entirely sure I'm ready to accept─but I owe it to you and everyone else who has voted for me to rise to the challenge."},{"name":"NARUMI","text":"Being a part of the Songbirds has taught me that with good friends anything is possible! Having always been so shy, I could never have imagined that the very stages that once terrified me would bring with them such joy."},{"name":"NARUMI","text":"The beaming faces of the people as they watched us sing and dance filled me with a happiness I had never before experienced. And all that was possible because I had Masha, Ulala...and most of all you, <span class=\"highlight\">Forename</span>, standing at my side."},{"name":"NARUMI","text":"You helped us through our most trying times, and now your steadfast support has lit our path forward. I can only hope in the suns and even moons that lie ahead, your spirit will continue to guide us."},{"name":"NARUMI","text":"I promise to do you proud. I'll work so hard that wherever you may go, you'll be sure to hear our name in whispered rumors, and see our achievements in portraits plastered on walls. No corner of Eorzea will be left untouched─that way you'll never be able to forget us, even if you tried!"},{"name":"MASHAMHAKARACCA","text":"Me, the leader!? Are you quite sure? I–I hardly dare believe it."},{"name":"MASHAMHAKARACCA","text":"I–I apologize. I have nothing prepared and I've never been one for sentimentality or speeches, as that's more Ulala's specialty...but as my pumpkin-headed sister might say, “Cor! This is amazing!”"},{"name":"MASHAMHAKARACCA","text":"Not even in my wildest dreams had I thought I would be appointed leader, much less by an esteemed adventurer such as yourself. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"MASHAMHAKARACCA","text":"I'll take us far beyond where the stars reach, to where the peaks of the musical heavens lie, and you'll once again be hearing the name “the Songbirds.”"},{"name":"MASHAMHAKARACCA","text":"...And when that day comes, you'll be sure to visit and share tales of your extraordinary adventures with us, won't you? Even were we to conquer all of Eorzea with our singing and dancing, it'd be an empty victory if we couldn't share it with you!"},{"name":"BUTLER","text":"With a new leader in place, there is nothing holding the Songbirds back from achieving their goals."},{"name":"BUTLER","text":"As a matter of fact, they're already well on their way. If you haven't heard, the <span class=\"emphasis\">Mythril Eye</span> contacted us, saying they'd like to run a feature article on the girls!"},{"name":"BUTLER","text":"With such exposure, it won't be long until they find themselves performing all across Eorzea. However, until that great day is upon us, we need continue forging onward and upward!"},{"name":"BUTLER","text":"Thank you again, adventurer! A better friend than you we could not have found, and even after you're gone, you will remain with us every step of the way to the top. Having said that, my staff has just finished roasting more rice cakes. Should you be interested in further helping the Songbirds, you know where to find us!"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"ATTENDANTA02223","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"ATTENDANTA02223","text":"（★未使用／削除予定★）"},{"name":"ATTENDANTB02223","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"ATTENDANTA02223","text":"（★未使用／削除予定★）"}],"reward":{"gil":210,"items":[{"id":13300},{"id":13639}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67758]}},"partials":[{"type":"npc","id":"1016356","obj":{"i":1016356,"n":"Royal Seneschal","l":40,"q":2}},{"type":"item","id":"13300","obj":{"i":13300,"n":"Lord's Suikan","l":1,"c":48929,"t":35,"p":59}},{"type":"item","id":"13639","obj":{"i":13639,"n":"Lady's Suikan","l":1,"c":48930,"t":35,"p":59}},{"type":"item","id":"13741","obj":{"i":13741,"n":"Outdated Certificate of Collaboration","l":1,"c":26187,"t":85}},{"type":"quest","id":"67758","obj":{"i":67758,"n":"Sugar, Spice, and Everything Rice","g":198,"l":"Ul'dah","s":99,"r":1}}]}