{"quest":{"name":"The New Frontier","location":"???","id":67752,"patch":3.1,"sort":0,"unlocksFunction":1,"eventIcon":71341,"target":1016126,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"AURVAEL","text":"Come one, come all! Take part in the grand endeavor to conquer an exciting new frontier─the Diadem!"},{"name":"AURVAEL","text":"You there, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Aye, I know an able–bodied adventurer when I see one. Come closer, come closer!"},{"name":"AURVAEL","text":"Pray allow me to introduce myself. I am Aurvael de Haillenarte, second son of Count Baurendouin. Ah, I can tell what you are thinking─what would spur a nobleman to leave the lap of luxury to explore a harsh and brutal wilderness?"},{"name":"AURVAEL","text":"Hearken to me, for deep within the Sea of Clouds, beyond treacherous winds and swirling rock, lies a land like no other."},{"name":"AURVAEL","text":"Isles─nay, pristine jewels─clustered about a massive floating crystal. No less a diadem fit for gods!"},{"name":"AURVAEL","text":"But be warned─these isles are home to myriad dangers. Bloodthirsty beasts thought lost to the ages, otherworldly fiends molded into merciless monsters by an unforgiving environment..."},{"name":"AURVAEL","text":"Yet, if the tales are to be believed, this selfsame environment is positively brimming with natural resources─resources which have caught the eye of nefarious sky pirates, I am sorry to say."},{"name":"AURVAEL","text":"And so, for the glory of Ishgard, we of House Haillenarte have spared no expense! We have at our disposal several outstanding airships, constructed by the Skysteel Manufactory for the express purpose of ferrying our courageous explorers to the Diadem!"},{"name":"AURVAEL","text":"We seek the strong, the fierce, the determined! Adventurers brave and true, with whose help we will beat all others to the punch and stake our claim!"},{"name":"AURVAEL","text":"What say you, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>!? Will you heed the Diadem's call!?"},{"name":"AURVAEL","text":"Marvelous, bloody marvelous... I should mention, of course, that as ceruleum does not come cheap, all participants are expected to provide a small contribution..."},{"name":"AURVAEL","text":"But that sacrifice pales in comparison to the riches that await us, as you shall soon see!"},{"name":"SYSTEM","text":"You can now participate in Ishgardian exploratory missions. These missions allow several parties to explore a remote cluster of islets in the Sea of Clouds known as the Diadem."},{"name":"SYSTEM","text":"To participate in an Ishgardian exploratory mission, you must have in your possession a <span class=\"highlight\">mission ceruleum voucher</span>, which may be purchased from Jaquoinie. Afterwards, speak with Aurvael to register for a mission."},{"name":"SYSTEM","text":"You may register for Ishgardian exploratory missions as an individual. However, you may also embark upon missions with free company members if you have purchased a workshop and constructed an airship. For further details, speak with the mammet voyager #004A in your company workshop."},{"name":"AURVAEL","text":"Fame and fortune await you just beyond the horizon in an exciting new frontier─the Diadem! And you there─yes, <span class=\"emphasis\">you</span>─need only hone your skills to their physical and mental peak to join us in this grand endeavor!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic. Limited jobs are not permitted."}],"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67205]}},"partials":[{"type":"npc","id":"1016126","obj":{"i":1016126,"n":"Aurvael","l":2301,"q":1}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}}]}