{"quest":{"name":"When the Bough Wakes","location":"The Rising Stones","id":67766,"patch":3.2,"sort":16002,"icon":100530,"unlocksFunction":1,"eventIcon":71341,"issuer":1014565,"target":1014565,"involved":[1016631,1016633],"genre":17,"journal":["Unukalhai is anxious to act before the Warring Triad awaken.","Unukalhai warns that the Warring Triad are stirring, and insists that the time to move against them has come. Being the closest to awakening, the eikon known as Sephirot is to be your first target. Join Unukalhai on the Flagship, Azys Lla's main isle, and await the arrival of your fellow Scions.","You rendezvous with Unukalhai, and are joined by Y'shtola, Urianger, and Krile─the latter being the “talented individual” to whom Unukalhai alluded earlier. Having spared no effort in her preparations, the surviving Student of Baldesion swiftly discerns the only feasible way to proceed, and assigns herself the task of disabling Sephirot's shackles. Summon your Echo-blessed companions, and make ready to engage the wrathful god as he awakens from millennia of dream-bound servitude.<br><br>※Containment Bay S1T7 can be accessed via the Duty Finder.","You have felled the towering Sephirot. Make your way back to the Flagship.","You return to the Flagship, and share a brief moment of celebration with your companions. For the present, at least, your mission on Azys Lla is complete. Head back to the Rising Stones and speak with Unukalhai.","Back at the Rising Stones, Urianger compliments you on your victory, but advises you to marshal your strength before contemplating confronting the Warring Triad's two remaining eikons. Given the Garleans' appetite for Allagan technology, however, Unukalhai warns that you may not have the luxury of time. Tiring of the masked youth's portentous utterances, Krile then challenges Unukalhai to reveal his master's identity, but finds the boy wholly unwilling to eschew his veil of secrecy. Though you say nothing, you cannot help but share her misgivings regarding his true motivations..."],"objectives":["Rendezvous with Unukalhai at the Flagship.","Confront Sephirot in Containment Bay S1T7.","Speak with Unukalhai at the Rising Stones."],"dialogue":[{"name":"UNUKALHAI","text":"The time has come, Warrior of Light─we must move against the Warring Triad now, or suffer the consequences."},{"name":"UNUKALHAI","text":"The seal is cracked and the eikons stir. Should they be allowed to awaken and resume their titanic conflict, it will be alike to the coming of a second Calamity. You, <span class=\"highlight\">Forename</span>, represent our best hope of eliminating this threat."},{"name":"UNUKALHAI","text":"That said, the very act of entering the containment facility itself presents certain...<span class=\"emphasis\">unique</span> challenges. So unique, in fact, that I struggled to locate an individual with the requisite talents to surmount them. Were it not for the impressively diverse connections of your fellow Scions, I might still be searching. Happily, however, they were able to furnish me with a suitable candidate."},{"name":"UNUKALHAI","text":"Now, along with you and your Echo-blessed companions, all the pieces we need to proceed with this deadly game are arrayed upon the board. Victory hinges upon no less than the total destruction of the Warring Triad."},{"name":"UNUKALHAI","text":"But we must also ware the interference of those who covet the Allagans' primal-harnessing technology. I speak, of course, of the blindly grasping hand of the Garlean Empire and its fumbling agents."},{"name":"UNUKALHAI","text":"The ignorant meddling of the Empire will serve only to hasten the eikons' awakening, and it is my master's desire that the Triad be dispatched before imperial forces delve too deeply."},{"name":"UNUKALHAI","text":"Being the nearest to wakefulness, the eikon Sephirot shall be your first adversary. Make your preparations, and join me on the Flagship in Azys Lla. We shall speak further there."},{"name":"UNUKALHAI","text":"Of the Warring Triad, Sephirot's slumber is the most fitful. Join me on Azys Lla's central isle as soon as you are able, and we shall attend to his destruction first."},{"name":"UNUKALHAI","text":"This is the place, Warrior of Light. Here we will find the containment facility wherein entities of incalculable power lie chained, their fathomless energies siphoned away by Allagan devices."},{"name":"UNUKALHAI","text":"As I warned you, Sephirot poses the most immediate threat─his dreaming mind drifts perilously close to consciousness. Thus must his destruction be our first concern."},{"name":"UNUKALHAI","text":"Your fellow Scions will be joining us anon, accompanied by the uniquely talented individual of whom I spoke. From what I gather, the two of you are already well acquainted."},{"name":"UNUKALHAI","text":"Let us continue inside, and wait before the doors to the containment facility."},{"name":"KRILE","text":"You've not been waiting long, I trust? We are eager to lend whatever cooperation we may to your mission, <span class=\"highlight\">Forename</span>."},{"name":"UNUKALHAI","text":"It is an honor to meet you at last. As I know of only one other Miqo'te Scion, you must be Archon Y'shtola...meaning your diminutive companion is Mistress Krile of the Students of Baldesion. Correct?"},{"name":"KRILE","text":"<span class=\"emphasis\">Diminutive</span>? Perhaps there has been some mistake. I assumed it was for my knowledge and not my stature that you requested my assistance."},{"name":"UNUKALHAI","text":"Ahem. The mistake is mine. My apologies if I have given offense. Mayhap it would be best if we proceeded directly to the matter of our objectives."},{"name":"UNUKALHAI","text":"Your adversary is the eikon Sephirot of the Warring Triad, otherwise known by the historians of Allag as “the Fiend.” He was once the patron deity to a tribe of treelike beings native to Meracydia, but was subdued by the Allagan Empire after a lengthy war of attrition."},{"name":"UNUKALHAI","text":"After his defeat, he was imprisoned for use as a source of power. Even now, Sephirot is neither truly living nor dead─his mind bound in a dream while his body's energies are harnessed by Allagan technologies."},{"name":"UNUKALHAI","text":"The explanation for his failure to dissipate into aether lies in his restraints. These ingenious devices serve not only to bind him but to continuously regenerate his corporeal form."},{"name":"KRILE","text":"Meaning it will be all but impossible to banish him while said restraints are in place, yes? Remove them, however, and we risk allowing an unfathomably powerful─and doubtless vengeful─eikon to run rampant."},{"name":"KRILE","text":"It seems we have no choice but to divide our forces: one team must locate the controls to Sephirot's shackles and disable them, while the other stands ready to destroy him at the moment of his awakening."},{"name":"UNUKALHAI","text":"...A most succinct assessment, Mistress Krile. While I was aware that the Echo provided you with uncanny insight, I did not expect you to intuit the core of my strategy quite so swiftly."},{"name":"KRILE","text":"Ha! If only my gift offered such detailed analysis─which is to say, it doesn't. I merely took it upon myself to learn as much about the Triad's imprisonment as I could before coming here. It will be <span class=\"highlight\">Forename</span> and I, after all, who enter the eikon's den."},{"name":"YSHTOLA","text":"Indeed. Given the nature of our adversary, none save those under the aegis of the Echo should be permitted to enter the containment facility. The risk of primal influence is too great."},{"name":"KRILE","text":"Well, that's that settled, then. I will disable the restraints, and <span class=\"highlight\">Forename</span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> gifted adventurer friends will welcome Sephirot back into the waking world. Better that than the other way around, I'd say, considering our respective fields of expertise─and, of course, my <span class=\"emphasis\">diminutive stature</span>."},{"name":"KRILE","text":"Right.<br>It's time I had a little “chat” with the doorkeeper over there..."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Activating verification systems. Lifting access restriction to Triad Control..."},{"name":"UNUKALHAI","text":"I had no idea the Baldesion curriculum was so comprehensive. When we locate the controls for Sephirot's restraints, I shall gladly leave their operation to you."},{"name":"YSHTOLA","text":"When “we” locate the controls? Mayhap my words were unclear. Only those blessed with the Echo may safely enter the facility."},{"name":"UNUKALHAI","text":"Your concern for my sanity is touching─but unnecessary. Suffice it to say, I am in no danger of falling under the eikon's sway."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; WARNING! Verification systems detect multiple unauthorized vessels entering restricted airspace. Security systems engaging intruders."},{"name":"YSHTOLA","text":"The Garleans...<br>Come, Urianger, we must keep the imperials occupied."},{"name":"KRILE","text":"We too should be on our way. Gods...I would be lying if I said I wasn't slightly terrified... But I can't very well leave <span class=\"emphasis\">every</span> deadly task to you Scions."},{"name":"KRILE","text":"According to the histories, Sephirot was immense in both size and strength─mighty enough to rout even the implacable armies of the Allagans, and that more than once. To cut a long story short, we have to get this right."},{"name":"KRILE","text":"I shall do my best not to wake the eikon up <span class=\"emphasis\">too</span> much. As my grandfather always used to say of certain little monsters: “Get them up and get them moving while their brains are still abed.”"},{"name":"UNUKALHAI","text":"Sephirot's power beggars belief. But a hero of your standing surely needs no reminding of the dangers of underestimating such an adversary."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Activating verification systems...<br>Identification code accepted. Triad Control clearance granted."},{"name":"KRILE","text":"You did it! I've seen you in action before, but never against anything <span class=\"emphasis\">that</span> big...<br>My legs kept telling me to run, but I just couldn't tear myself away! I don't think I blinked once during the whole battle!"},{"name":"UNUKALHAI","text":"A hero, tried and true.<br>If only I had possessed such strength..."},{"name":"KRILE","text":"Y'shtola? This is Krile. Eikon eliminated! Oh, if only you could have seen it... <span class=\"highlight\">Forename</span> gave Sephirot the mother of all rude awakenings!"},{"name":"KRILE","text":"And your distraction was perfect! We encountered not a single imperial soldier. Hm? Yes. Understood. Let's swap tales at the Rising Stones, then!"},{"name":"UNUKALHAI","text":"On our path to the control chamber, we discovered a number of dormant thralls. It would seem the machines that preserve their forms also hold them in a state of torpor. We need not fear them summoning their deity anew."},{"name":"KRILE","text":"In short, our work here is done─for the present, at least. Let's go home, shall we?"},{"name":"REGULAVANHYDRUS","text":"Your senses are sharp, young one."},{"name":"REGULAVANHYDRUS","text":"I am Regula van Hydrus, legatus of the VIth Legion...and it would seem that that damnable woman and her accomplice have led me a merry dance through the thickest of this infernal island's defenses. To think that I pursued them. &lt;sigh&gt; I shall withdraw for now, my lesson learnt."},{"name":"UNUKALHAI","text":"I doubt it. You Garleans <span class=\"emphasis\">never</span> learn. You covet the means to enslave primals─but in your headlong dash to control that which you do not understand, you show less wisdom than the very beast tribes that summoned them!"},{"name":"REGULAVANHYDRUS","text":"I have no interest in crossing blades with children. Live, grow strong, and mayhap one day you will warrant my attention."},{"name":"KRILE","text":"I looked back and you weren't there. Did something happen?"},{"name":"UNUKALHAI","text":"Naught of consequence. I mistook a shadow for a man."},{"name":"KRILE","text":"Just what are you hiding beneath that mask of yours? Hmmm... A longing for hope. An appetite for power. A lingering sense of regret."},{"name":"KRILE","text":"And do I detect a desire to test your strength against a certain hero...?"},{"name":"UNUKALHAI","text":"...Is that what your gifts tell you?"},{"name":"KRILE","text":"No, those were just wild guesses. But I wonder if some few of my words didn't strike close to the mark."},{"name":"KRILE","text":"...Or mayhap <span class=\"emphasis\">more</span> than a few."},{"name":"KRILE","text":"Be at ease, Unukalhai─I have no supernatural ability to read minds. The Echo simply allows me to comprehend, regardless of language, that which a fellow being would have me know. You need not mask your heart as you do your countenance."},{"name":"UNUKALHAI","text":"That was a performance, then? A ruse to uncover my true nature? I see I shall have to keep my wits about me..."},{"name":"UNUKALHAI","text":"So, Warrior of Light, how did it feel to strike down so great a foe? You must tell me more of the experience once our meeting with your colleagues is concluded..."},{"name":"URIANGER","text":"Through thine all-surpassing skill at arms do we now take our first step in ridding this star of the Warring Triad's baleful presence. And in such wise do we lessen the burden bequeathed unto us by the vainglory of Allag."},{"name":"URIANGER","text":"Know, however, that the two eikons which remain are thought equal in might to Sephirot...and may yet exceed him. Ere thou proceed, I would counsel thee to marshal thy strength, and give careful thought to thy preparation."},{"name":"UNUKALHAI","text":"Assuming the Garleans afford us the luxury of time. Even now, they grasp for the means to dominate primals, blind to the technology's potential for calamity."},{"name":"UNUKALHAI","text":"My master taught me that the entity known as Sephirot was this world's first sacred tree, elevated to godhood by the belief of its worshipers. There is no power more fearsome than that born of unconditional faith and unbending ideal."},{"name":"YSHTOLA","text":"'Tis plain your master found in you a willing student. Tell me, was it he who taught you of Allagan technology's “potential for calamity,” or are those your own words?"},{"name":"UNUKALHAI","text":"'Twas but a figure of speech, nothing more."},{"name":"KRILE","text":"When last we met, I thought I caught a glimpse of the boy behind the mask. ...But it would seem your defenses are firmly back in place."},{"name":"KRILE","text":"Must you persist with this infuriating veil of secrecy? I for one would very much like to know who this “master” of yours is─amongst other things."},{"name":"UNUKALHAI","text":"As long as our purposes align, what matter my affiliation?"},{"name":"KRILE","text":"It matters a great deal. I do not ask out of idle curiosity─if we are to fight as comrades, we need to be able to trust each other."},{"name":"KRILE","text":"On which note, I should apologize for my earlier trickery. It was merely an attempt to get to the heart of an enigmatic companion.<br>Truth be told, I was rather glad you reacted as you did. No person of your age has any business being calm and aloof all of the time, much as you might wish to be."},{"name":"KRILE","text":"Anyway, we had best be off. Do send word if there are any further developments!"},{"name":"UNUKALHAI","text":"A “companion” now, am I?"}],"reward":{"gil":3722,"xp":0,"instance":20037},"reqs":{"jobs":[{"lvl":60,"id":34}],"questsType":"all","quests":[67650,67699]},"next":[67817,67824]},"partials":[{"type":"npc","id":"1014565","obj":{"i":1014565,"n":"Unukalhai","l":481,"q":9}},{"type":"npc","id":"1016631","obj":{"i":1016631,"n":"Unukalhai","l":2101,"q":1}},{"type":"npc","id":"1016633","obj":{"i":1016633,"n":"Verification Node","l":2101,"q":5}},{"type":"instance","id":"20037","obj":{"i":20037,"n":"Containment Bay S1T7","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":190}},{"type":"quest","id":"67650","obj":{"i":67650,"n":"Gods of Eld","g":17,"l":"Ishgard","s":16001,"f":1}},{"type":"quest","id":"67699","obj":{"i":67699,"n":"As Goes Light, So Goes Darkness","g":4,"l":"Ishgard","s":8}},{"type":"quest","id":"67817","obj":{"i":67817,"n":"A Fiendish Likeness","g":17,"l":"The Rising Stones","s":16103,"f":1}},{"type":"quest","id":"67824","obj":{"i":67824,"n":"The Fate of Stars","g":17,"l":"The Rising Stones","s":16003,"f":1}}]}