{"quest":{"name":"The Nest of Honor","location":"The Sea of Clouds","id":67761,"patch":3.1,"sort":8,"beast":6,"unlocksFunction":1,"eventIcon":71341,"issuer":1016087,"target":1016088,"genre":44,"journal":["Linu Vali smiles at you warmly, and it looks like she has something to say.","Linu Vali once again expresses her gratitude for everything you have done for her tribe. Her brother also wishes to express his thanks, and looks deep in thought. Speak with him to hear what words his meditative mood has brought to him.","You speak with Linu Vanu, and despite his initial difficulties in figuring out what to say, he finally finds words that adequately express his gratitude. He names you an honored guest of the Gundu, and says you will be welcome with open arms whenever you wish to visit Ok' Gundu Nakki."],"objectives":["Speak with Linu Vanu."],"dialogue":[{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span>, Ok' Gundu Nakki thrives more than ever. To think about the hardships <span class=\"highlight\">Forename</span> helps us through..."},{"name":"LINUVALI","text":"Linu Vali knows words are wind, but she thanks you with all her heart! <span class=\"highlight\">Forename</span> is as sibling born in same nest!"},{"name":"LINUVALI","text":"Linu Vanu wishes to express thanks to <span class=\"highlight\">Forename</span> as well. Go to him, he is eager to share his words."},{"name":"LINUVALI","text":"Linu Vanu wishes to thank <span class=\"highlight\">Forename</span> for guiding Gundu safely through the storm. Go to him, he is eager to speak with you!"},{"name":"LINUVANU","text":"Ah, <span class=\"highlight\">Forename</span>, it brings Linu Vanu joy to see you again. For moons does Linu Vanu seek metaphor to express thanks for netherling's actions... "},{"name":"LINUVANU","text":"But moon sets and sun rises time and again, and still proper words do not come."},{"name":"LINUVANU","text":"However, now that <span class=\"highlight\">Forename</span> stands before me, it is clear!"},{"name":"LINUVANU","text":"A netherling such as <span class=\"highlight\">Forename</span> is more precious than double─no, <span class=\"emphasis\">triple</span>─rainbow stretching all the way across cloud sea!"},{"name":"LINUVANU","text":"From this day onward, <span class=\"highlight\">Forename</span> will be welcome in Ok' Gundu Nakki as a most honored guest!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Gundu."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon the completion of Vanu Vanu tribal daily quests."}],"reward":{"gil":405,"items":[{"num":3,"id":21072}]},"reqs":{"beastrank":7,"jobs":[{"lvl":50,"id":34}],"quests":[67706]}},"partials":[{"type":"npc","id":"1016087","obj":{"i":1016087,"n":"Linu Vali","l":2100,"q":10}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"quest","id":"67706","obj":{"i":67706,"n":"Nest Side Story","g":44,"l":"The Sea of Clouds","s":7,"f":1}}]}