{"quest":{"name":"Don't Call It a Comeback","location":"Coerthas Western Highlands","id":67763,"patch":3.2,"sort":31,"icon":100524,"unlocksFunction":1,"eventIcon":71341,"issuer":1016604,"target":1016619,"involved":[1016601,1016612,1016617,1016618,1016622,1016623,1016624,1016625,1016626,1016627,1016628,1016629,1016630],"genre":69,"journal":["Cyr's look of utter confusion is one you know all too well.","Recovering from his shock, Cyr expresses his strong disapproval of Nashu's willingness to employ a zombie gentleman as a bloodhound. Mustering his courage, he declares that you and he must regain control of the situation, before charging off in pursuit of the others.","The Gentle Dead Man pauses, explaining that some strange magical interference is confounding his senses, and that it may be for the best if you were to split up and survey the area. Cyr quickly asserts that the region is infested with wild beasts, and that such a plan is too risky, prompting Godbert to assign you and the zombie gentleman to guard Nashu, while he accompanies the inquisitor during the search.","In the distance, Nashu spies two sculpted legs clad in gentlemanly trousers protruding from the snow. Unfortunately, they are not alone. Two equally gentlemanly gazebos─that is to say, yetis─appear to be advancing upon the legs with murderous intent. It falls to you to put an end to their machinations.","The dread gazebos are no more, and the gentlemanly legs are no longer in danger. However, if they do indeed belong to the inspector, then it is difficult to imagine how he could yet be among the living...","Though they pull with all their might, Nashu and the Gentle Dead Man have not the strength to remove Inspector Hildibrand from the ground. Fortunately, their cries serve to draw the attention of Cyr and Godbert, and the latter states with confidence that he has ways of waking his son. Summoning his strength, he rips Hildibrand free, soaring high into the sky before slamming him even deeper into the snow. After taking a moment to reflect on the silliness of naming one's attacks, he once more pulls his son free with a mighty suplex. Rising to his feet, a bewildered Hildibrand quickly takes stock of the situation and poses for his fans. Yet soon all eyes are upon the mammet which was disgorged from the ground along with him─seemingly broken, but soon brought to life with a few deft whacks of Godbert's hammer.","It quickly becomes apparent that the mammet can remember nothing, not even its name─a realization which causes it to panic. Seeing this, Inspector Hildibrand attempts to comfort the poor creation, even going so far as to give it a new name: Gigi (which Inquisitor Cyr is quick to decry as a name no one in their right mind would ever give a mammet). The inspector resolves to help Gigi recover its memories, and they depart for Ishgard along with Nashu. Satisfied that Hildibrand is alive and well, the Gentle Dead Man and Godbert take their leave and set forth for Thanalan. Once more you find yourself left alone with Inquisitor Cyr, who has yet to come to terms with this strange new world he has found himself within, one devoid of reason and logic. Shaking his head, he mutters that Inspector Hildibrand will still need to be cleared of all suspicion before he will be permitted to travel freely in Ishgard. And so you two begin your trek back to the capital as well...","Inquisitor Cyr informs you that Inspector Hildibrand has been permitted to enter Ishgard, having been judged to be no more than an “eccentric curiosity,” and now roams the city with Nashu and Gigi in their quest to learn more about the mammet's identity. Though he no longer suspects him of being a heretic, he is nevertheless annoyed by his antics, and cannot help but dread the day that he enters into his life once more..."],"objectives":["Speak with the Gentle Dead Man.","Speak with Nashu.","Defeat the gentleman yetis.","Inspect the gentlemanly legs.","Speak with Hildibrand.","Speak with Cyr in Foundation."],"dialogue":[{"name":"CYR","text":"Who do they think they are, commandeering this investigation!? And employing a zombie as a bloodhound! It beggars belief!"},{"name":"CYR","text":"We must regain control of the situation. With me, <span class=\"highlight\">Forename</span>!"},{"name":"GODBERT","text":"Simply basking in this magnificent scenery fills me with inspiration!"},{"name":"NASHUMHAKARACCA","text":"Inspectooor! Inspectoooooor!"},{"name":"CYR","text":"Sickness is wont to fester and spread, yes? Is it truly safe to consort with this...man?"},{"name":"ZOMBIEA","text":"Hold a moment, my friends! I must needs concentrate..."},{"name":"ZOMBIEA","text":"Master Zombibrand is indeed nearby, but there is also something else...mayhap a powerful magick, confounding my senses. I can guide you no further; we must needs split up and search the area."},{"name":"CYR","text":"Now see here! These wastes are infested with wild beasts, and you would have us split up?"},{"name":"CYR","text":"<span class=\"highlight\">Forename</span> can handle <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>, true, and you've clearly no reason to fear death. But what of Mistress Nashu?"},{"name":"GODBERT","text":"Ah, I take your meaning. My good zombie, <span class=\"highlight\">Forename</span>─pray see to the lady's protection."},{"name":"GODBERT","text":"Inquisitor Cyr, would you care to take the lead?"},{"name":"NASHUMHAKARACCA","text":"Come on, you two! The inspector is out there, somewhere!"},{"name":"ZOMBIEA","text":"Ah! Those sculpted legs clad in gentlemanly trousers! I <span class=\"emphasis\">know</span> them!"},{"name":"NASHUMHAKARACCA","text":"Look, <span class=\"highlight\">Forename</span>! That's got to be the inspector!"},{"name":"NASHUMHAKARACCA","text":"And he's surrounded by giant fluffy man-shaped gazebos!"},{"name":"ZOMBIEA","text":"Nay, my lady, they are not mere gazebos. Note their regal bearing─they are <span class=\"emphasis\">gentleman</span> gazebos! Fearsome yet fastidious foes who would surely tear me rotting limb from rotting limb!"},{"name":"ZOMBIEA","text":"Only <span class=\"highlight\">Forename</span> can save Master Zombibrand now!"},{"name":"NASHUMHAKARACCA","text":"Aye, I see it now. They are rather more dignified and gentlemanly than your average gazebo."},{"name":"ZOMBIEA","text":"I beg of you, my friend! You must save Master Zombibrand before it is too late!"},{"name":"NASHUMHAKARACCA","text":"Cor! You sure gave them gazebos what for!"},{"name":"ZOMBIEA","text":"Huzzah! My heart fair stirred with new life to see you charge into battle for the sake of our beloved overlord!"},{"name":"NASHUMHAKARACCA","text":"Inspector! Inspector! Can you hear me? We've been looking all over for you!"},{"name":"NASHUMHAKARACCA","text":"Oh, but this just won't do! We've got to get you out of there before you catch cold!"},{"name":"ZOMBIEA","text":"Uggggggh! Uggggggh!"},{"name":"NASHUMHAKARACCA","text":"Up...up and at them! Everyone...is waiting for you!"},{"name":"ZOMBIEA","text":"&lt;huff&gt; &lt;puff&gt; Forgive me. If I pull any harder, my arms are like to tear..."},{"name":"CYR","text":"Ah, there you are. We heard shouting─have you perchance found something?"},{"name":"CYR","text":"Fury take me, is that my heretic!? Confound it─I wanted him alive!"},{"name":"NASHUMHAKARACCA","text":"Inspector Hildibrand is definitely not a heretic! And he's probably not dead either! He's...he's just hibernating, like last time!"},{"name":"GODBERT","text":"Hildy ever was a late riser. Fear not─my wife and I had our ways of waking him."},{"name":"GODBERT","text":"Hildibrand Helidor Maximilian Manderville! You will get up!"},{"name":"GODBERT","text":"Right...this...instant!"},{"name":"GODBERT","text":"Hm. Was it the Manderville Meteor Strike, or the Manderville Meteor Drive...? Bah, maybe Julyan was right─trying to name everything only leads to needless confusion."},{"name":"GODBERT","text":"One more time, then."},{"name":"GODBERT","text":"Out you go!"},{"name":"NASHUMHAKARACCA","text":"Splendidly suplexed, Lord Godbert!"},{"name":"HILDIBRAND","text":"Where...where am I? The snowy wastelands of Coerthas? And who are these people I see before me?"},{"name":"HILDIBRAND","text":"Ah, but of course! Who else would venture into inhospitable climes and wake me from slumber sweet but my beloved fans?"},{"name":"CYR","text":"...Why do I feel as though I've stepped through a portal into an alternate reality unbound by the laws of logic?"},{"name":"CYR","text":"What is that, a mammet? Where did it come from?"},{"name":"HILDIBRAND","text":"Oh, that? When my father drove me into the earth, I found it buried beneath the snow."},{"name":"NASHUMHAKARACCA","text":"A little Lalafellin girl! How adorable!"},{"name":"HILDIBRAND","text":"Nashu, please. Note the firm, muscular legs, not unlike my own. 'Tis clearly a Lalafellin boy!"},{"name":"NASHUMHAKARACCA","text":"Now that you mention it, I suppose his features are rather masculine..."},{"name":"CYR","text":"...You two cannot possibly be serious."},{"name":"HILDIBRAND","text":"I am the very soul of seriousness, good sir─especially in matters of deduction. This is undoubtedly a young boy who, much like myself, fell into a deep slumber upon being buried beneath the snow. Now then, let us gently wake him and ascertain his identity."},{"name":"GODBERT","text":"There, that ought to do it!"},{"name":"GIGI","text":"(-???-)GIGI※GIGIGI★※..."},{"name":"GIGI","text":"(-???-)WhAt...WhAt Is ThIs PlAcE? wHo...WhO aM i?"},{"name":"GODBERT","text":"'Tis naught in all creation that cannot be repaired with a little tender love and care."},{"name":"NASHUMHAKARACCA","text":"Inspector Hildibrand's back! And he brought a friend!"},{"name":"CYR","text":"Surely there is a perfectly logical explanation for all of this..."},{"name":"ZOMBIEA","text":"Master Zombibrand is alive and full of beans! It's a miracle!"},{"name":"GIGI","text":"(-???-)I rEmEmBeR...i ReMeMbEr...NoThInG..."},{"name":"HILDIBRAND","text":"It would seem that although Father's ungentle ministrations served to restore this young boy to life, they also robbed him of his memory..."},{"name":"GIGI","text":"(-???-)HoW dId I gEt HeRe? WhO aM i? WhY cAn I nOt ReMeMbEr!?"},{"name":"HILDIBRAND","text":"Do not worry, young man. Everything will be all right. Take it from me─I have lost my memory more times than I can even remember."},{"name":"GIGI","text":"(-???-)ThEn...ThEn CaN yOu HeLp Me To ReMeMbEr?"},{"name":"HILDIBRAND","text":"Hearken to me now, for I, Hildibrand, agent of enquiry, inspector extraordinaire, do hereby swear to solve the mystery of the amnesic hobbledehoy!"},{"name":"NASHUMHAKARACCA","text":"Wonderful, wonderful! I'll get started on a batch of Nashu's Delights!"},{"name":"HILDIBRAND","text":"Ah... Effective as your explosives were in the past, I suspect that young Gigi lacks the hearty constitution required to survive such an approach."},{"name":"GIGI","text":"(-???-)“GiGi”? Is ThAt My NaMe?"},{"name":"HILDIBRAND","text":"When you woke, you were muttering “GIGIGIGI.” I suspect the phrase may hold some significance for you, so until such time as we learn your real name, I say why not adopt it as a playful moniker?"},{"name":"CYR","text":"But...but that's just a sound <span class=\"emphasis\">all</span> mammets make! &lt;sigh&gt; What kind of imbecile goes and names a mammet “Gigi” anyway..."},{"name":"GIGI","text":"“GiGi”... I lIkE tHiS nAmE. tHaNk YoU, kInD sIr. BuT hOw WiLl ThIs NeW nAmE hElP mE tO rEmEmBeR wHo I aM?"},{"name":"HILDIBRAND","text":"Patience, Gigi! This is only the beginning! Next, we will return to the city and see if we cannot find any who know who you are. Come along!"},{"name":"ZOMBIEA","text":"Now that I know our overlord is safe and sound, I too must take my leave of you and return to my brothers. I daresay rigor mortis will set in if I remain here any longer..."},{"name":"GODBERT","text":"Bound for Thanalan? Then allow me to accompany you. Julyan will give me no end of trouble if I keep her waiting much longer─though perhaps she will forgive me once I tell her of Hildy's return."},{"name":"CYR","text":"This is rather a lot to digest─though you have the look of one accustomed to such happenings. In any case, regardless of Mistress Nashu's protestations, the inspector will not be granted access to the capital until we can confirm that he is not a heretic. You have my word that he will be treated fairly."},{"name":"CYR","text":"Fury take me, that man... Ah, <span class=\"highlight\">Forename</span>."},{"name":"CYR","text":"I suppose you have heard the news, then. That Inspector Hildibrand was cleared of all suspicion and judged to be no more than an “eccentric curiosity”?"},{"name":"CYR","text":"If you are looking for him, good luck. I wanted to thank him for his cooperation, but as soon as the Temple Knights released him, he and his assistant ran off to gods know where with that mammet in tow."},{"name":"CYR","text":"As for my investigation... In spite of all the twists and turns, I managed to salvage a satisfactory result. As far as the inquisition is concerned, the suspicious vagabond was naught more than a zombie which wandered away from the Dusk Vigil─sickness which has since been purged."},{"name":"CYR","text":"So it would seem that all is right with the world once more. For now. I have no doubt that the inspector will turn up again like a bad gil, and when he does, trouble is sure to follow."}],"reward":{"gil":1100,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67762]},"next":[67764]},"partials":[{"type":"npc","id":"1016604","obj":{"i":1016604,"n":"Cyr","l":2200,"q":2}},{"type":"npc","id":"1016619","obj":{"i":1016619,"n":"Cyr","l":2300,"q":6}},{"type":"npc","id":"1016601","obj":{"i":1016601,"n":"Nashu Mhakaracca","l":2301,"q":2}},{"type":"npc","id":"1016612","obj":{"i":1016612,"n":"Nashu Mhakaracca","l":2200,"q":1}},{"type":"npc","id":"1016617","obj":{"i":1016617,"n":"Hildibrand","l":2200,"q":1}},{"type":"npc","id":"1016618","obj":{"i":1016618,"n":"???","l":2200,"q":1}},{"type":"npc","id":"1016622","obj":{"i":1016622,"n":"Godbert","l":2200,"q":1}},{"type":"npc","id":"1016623","obj":{"i":1016623,"n":"Cyr","l":2200,"q":1}},{"type":"npc","id":"1016624","obj":{"i":1016624,"n":"Gentle Dead Man","l":2200,"q":1}},{"type":"npc","id":"1016625","obj":{"i":1016625,"n":"Nashu Mhakaracca","l":2200,"q":1}},{"type":"npc","id":"1016626","obj":{"i":1016626,"n":"Nashu Mhakaracca","l":2200,"q":1}},{"type":"npc","id":"1016627","obj":{"i":1016627,"n":"Cyr","l":2200,"q":1}},{"type":"npc","id":"1016628","obj":{"i":1016628,"n":"Godbert","l":2200,"q":1}},{"type":"npc","id":"1016629","obj":{"i":1016629,"n":"Gentle Dead Man","l":2200,"q":1}},{"type":"npc","id":"1016630","obj":{"i":1016630,"n":"Gentle Dead Man","l":2200,"q":1}},{"type":"quest","id":"67762","obj":{"i":67762,"n":"A Gentleman Falls, Rather than Flies","g":69,"l":"Ishgard","s":30,"f":1}},{"type":"quest","id":"67764","obj":{"i":67764,"n":"The Gigi Situation","g":69,"l":"Ishgard","s":32,"f":1}}]}