{"quest":{"name":"The Measure of a Mammet","location":"Ishgard","id":67765,"patch":3.3,"sort":33,"icon":100574,"unlocksFunction":1,"eventIcon":71341,"issuer":1016608,"target":1016619,"involved":[1011225,1016609,1016610,1017132,1017133,1017135,1017274,1017277],"genre":69,"journal":["Hildibrand knows in his heart that love transcends dimensions of time and space, definitions of man and machine...","The course of fatherhood never did run smooth, and Inspector Hildibrand is resolved to overcome this trial and be reconciled with his beloved son. In order to do so, however, he must first find the runaway mammet, who may already have left the city. While Hildibrand and Nashu question the sentries at the airship landing, Inquisitor Cyr will visit the Arc of the Worthy and see if any have seen the missing Gigi, leaving you to speak with the guard stationed at the gate near the Skysteel Manufactory.","His limited experience with Lalafells notwithstanding, Herewart confirms that Gigi secured passage aboard a supply ship bound for Falcon's Nest. Hildibrand and Cyr are quick to draw conclusions ridiculous and damning, and while neither seems willing to accept the other's deductions, both understand that they must return to Falcon's Nest to achieve their goals─conflicting though they may be.","For a mercy, the snows have yet to cover Gigi's tracks, which appear to lead north from Falcon's Nest towards the abandoned Camp Riversmeet. Struck by a sudden epiphany, Nashu speculates that Gigi may have wandered out into the wastes in search of his “grandpapa,” Lord Godbert, of whose crafting prowess she and Hildibrand spoke so highly. Alas, even should they have correctly discerned the mammet's intent, the western highlands are vast, and the odds of him stumbling upon the goldsmith and his wife are rather slim...","The tiny adorable footprints are unmistakable in the snow. Gigi must surely be somewhere nearby. With luck, you will find him before he runs afoul of one of the wastes' many ravenous beasts.","At long last, you come upon Gigi lying motionless in the snow. The fragments of ice clinging to his cap suggest that he was rendered unconscious by the impact of something small and round traveling at an incredibly high speed. Coincidentally, some few yalms away, Lord Godbert and Lady Julyan are engaged in an endless snowball fight, oblivious to you and Gigi and several dead steinbocks...","To your great relief, Gigi soon rises to his feet, apparently none the worse for wear. Hildibrand is overjoyed to be reunited with his errant son, and Godbert with his. Before you or anyone else can explain the situation, however, Gigi beseeches his grandfather to use his peerless skills to transform his body into that of a real boy. So enjoined, the goldsmith prepares his tools, and in a dazzling display of acrobatic craftsmanship molds the mammet's tiny frame into that of a towering Roegadyn. The jubilant Gigi then runs to his father, arms outstretched, only to accidentally deal him a bone-crunching blow, driving Hildibrand into the ground in an explosion of dirt and snow.<br><br>Alas, Gigi's joy is short-lived, not through any ill-feeling at his well-intentioned assault, but because of the magicks which soon envelop his body, restoring it to its original shape, and depriving him of that which he so desperately desired. Once more, the mammet seems poised to fall into despair, when Hildibrand, freshly extricated from the earth, reassures him that their bonds transcend flesh and blood and steel─that even if he is not a man, he is still a Manderville mammet. Yet while this sentiment brings Gigi and his Grandpapa Godbert much joy, Lady Julyan is of another mind, as evidenced by her brandishing of a skillet large enough to bludgeon a god to death. The sight of this prompts Hildibrand and Lord Godbert to depart with all haste, followed by Nashu and Gigi, and finally the Lady Julyan, still incandescent with rage, leaving you alone with a cowering Cyr.","Once more, Cyr proclaims himself the only sane man in a world gone mad. Though he has failed in everything he set out to achieve, he takes solace in the fact that Gigi was able to overcome his personal crisis...before berating himself for appearing to care about the feelings of a mammet. He duly departs for the city to inform his superiors of recent events, as ridiculous and unproductive as they proved to be.","Inquisitor Cyr's supervisors are understandably displeased with his “gross mishandling of the situation.” Nevertheless, they remain convinced that Gigi is the product of heretical machinations, leaving Cyr with no option but to continue his investigation. While he does not share his superiors' view, he does believe there is something very unusual about the mammet and the powers he─<span class=\"emphasis\">it</span> wields. Mayhap, one day, he will find the answers he seeks. But that is a story for another time..."],"objectives":["Speak with Herewart in Foundation.","Rendezvous with Cyr outside Falcon's Nest.","Follow the footprints.","Search for Gigi.","Aid Gigi.","Speak with Cyr.","Speak with Cyr in Foundation."],"dialogue":[{"name":"CYR","text":"Just so we're clear─you do agree that it's a mammet, right? You don't honestly believe that, you know..."},{"name":"NASHUMHAKARACCA","text":"I'm sure he didn't mean what he said about his Papa Hildy. Which means... &lt;gasp&gt; He thinks I'm his mama!?"},{"name":"HILDIBRAND","text":"The course of fatherhood never did run smooth, but I, Hildibrand, guardian of Gigi, doting parent extraordinaire, shall find a way to overcome this trial and be reconciled with my beloved son!"},{"name":"NASHUMHAKARACCA","text":"That's the spirit! Solving a simple case of childhood rebellion should be easy for a man who's unmasked thieves, defeated duelists, and led armies of the undead!"},{"name":"CYR","text":"Yes, yes, that's all very─ Wait, what was that about the undead? Actually, don't tell me. For now, all that matters is finding that mammet!"},{"name":"CYR","text":"We should begin by speaking with the sentries stationed at the city gates and the airship landing. If, Fury help us, he has left Ishgard, we need to know about it sooner rather than later."},{"name":"CYR","text":"I will visit the Arc of the Worthy, while the inspector and his assistant head to the airship landing. You can question the guard at the gate near the manufactory, after which we will regroup there and share our findings. Dismissed!"},{"name":"HEREWART","text":"Little fella with a wide-brimmed hat? Aye, he came through here─bought passage on a supply ship bound for Falcon's Nest."},{"name":"HEREWART","text":"One of them wossname...Lalafells, right? Funny little buggers<span class=\"alternative-container\"><span class=\"alternative\">─er, present company excepted, like. He, er...seemed</span><span class=\"alternative\">. Seemed</span></span> keen to be anywhere but here."},{"name":"HEREWART","text":"&lt;cough&gt; ...Good people, you Lalafells. Industrious folk, salt of the earth─like that waitress they've got down at the Forgotten Knight. Though I doubt you sing or dance half as well as she does, eh? Wh-Which is fine! I ain't judging."},{"name":"CYR","text":"Well, if Gigi left the city, it was not by the main gates."},{"name":"HILDIBRAND","text":"And the sentries at the airship landing have seen no one matching his description."},{"name":"CYR","text":"Falcon's Nest? Fury take me, must we return to that freezing pit of despair?"},{"name":"HILDIBRAND","text":"Wheresoever Gigi goes, I will follow him and find him and embrace him as my son once more!"},{"name":"HILDIBRAND","text":"However, I surmise our final destination lies far beyond the walls of said outpost. Indeed, there is but one reason he would return to those frozen wastes─"},{"name":"HILDIBRAND","text":"To frolic in the snow and cast his worries to the winds!"},{"name":"CYR","text":"...Really? He seemed in no mood to frolic when last <span class=\"emphasis\">I</span> saw him."},{"name":"CYR","text":"As I recall, he used his arcane powers to mend a vase, only to become morose and belligerent when it became clear to him that he was, in fact, a mammet."},{"name":"CYR","text":"One might even say he <span class=\"emphasis\">remembered</span> what he was, remembered his purpose! And so he returned to western Coerthas─that famous breeding ground for heresy─where first we found him..."},{"name":"CYR","text":"Home to his heretic masters, to share with them the intelligence he had gathered on the city! &lt;sniff&gt; &lt;sniff&gt; At long last, the undeniable, the unquestionable, the unmistakable scent of heresy!"},{"name":"CYR","text":"What are we standing around for!? We have a heretic to catch!"},{"name":"NASHUMHAKARACCA","text":"Inspector, I'm starting to think that Inquisitor Cyr might not think very highly of our little girl."},{"name":"HILDIBRAND","text":"It is possible, but I would not presume to know his feelings ere he voice them explicitly. Until such time as he does, we should endeavor to <span class=\"emphasis\">surreptitiously</span> bring him round to the opinion that Gigi is a boy of pure heart and good intent. Subtlety in all things, Nashu─<span class=\"emphasis\">that</span> is the Manderville way!"},{"name":"HILDIBRAND","text":"I would know those tiny footprints anywhere! Gigi came this way!"},{"name":"NASHUMHAKARACCA","text":"Awww, even her footprints are adorable! They almost look like they were made by one of those clockwork minions!"},{"name":"SYSTEM","text":"The tracks continue to the north..."},{"name":"HEREWART","text":"I've got no quarrel with Lalafells, mind, but you hear things sometimes, like how they've got a scheming nature, how they'll stab you in the calf for a handful of gil─<span class=\"alternative-container\"><span class=\"alternative\">er, not that I'd ever listen to such rot. Idle rumors is all they are. Ahem.</span><span class=\"alternative\">and I like me calves just the way they are, thank you very much.</span></span>"},{"name":"CYR","text":"A-HA! I knew it! The mammet immediately left the outpost and looks to have headed north along the river. By the Fury, I cannot wait to finally catch him in the company of heretics!"},{"name":"NASHUMHAKARACCA","text":"I don't much like your tone, Inquisitor! If our baby girl ran afoul of any heretics, she'd look them square in the eye and tell them she doesn't want any!"},{"name":"NASHUMHAKARACCA","text":"Hey, Inspector! I think I just had one of those moments─you know, of <span class=\"emphasis\">insight</span>. Maybe Gigi came out here to find Lord Godbert. I did tell her her grandpapa might like to see that trick of hers..."},{"name":"HILDIBRAND","text":"Brilliant deduction, Nashu! He must be eager to meet his grandparents!"},{"name":"CYR","text":"The selfsame ones he renounced when he declared you were not his father?"},{"name":"HILDIBRAND","text":"Ahahaha, what a fine young gentleman, eager to explore his heritage! Let us make haste, my friends, for a reunion of three generations of Mandervilles beckons!"},{"name":"CYR","text":"...I really can't be bothered."},{"name":"SYSTEM","text":"The tracks continue to the north..."},{"name":"SYSTEM","text":"The mammet lies motionless in the snow, fragments of ice stuck to its cap, suggesting the impact of something small and round traveling at high speed..."},{"name":"GIGI","text":"UgH, mY hEaD. wHo...? Oh, It'S yOu. YoU fOlLoWeD mE..."},{"name":"HILDIBRAND","text":"Oh, Gigi! If you wanted to have a snowball fight with your grandparents, you should have said so earlier! Papa Hildy was very worried─though he is glad to see that you are unharmed."},{"name":"CYR","text":"It would seem he was struck by a snowball, much like these steinbocks─these <span class=\"emphasis\">dead</span> steinbocks. Are you sure he isn't damaged?"},{"name":"HILDIBRAND","text":"As if a mere blow to the head could fell our Gigi! We Mandervilles are made of sterner stuff. I myself have been driven headfirst into the earth on no fewer than two dozen occasions─several times from malms above─and my mind is no less brilliant for the experience!"},{"name":"CYR","text":"I expect the earth was no less brilliant for the experience ei...ther. Why are you...? Are you <span class=\"emphasis\">nodding</span>?<br>Oh. He's behind me, isn't he...?"},{"name":"GODBERT","text":"What good fortune to cross paths with you lot so far from civilization! Forgive me for not taking notice earlier─I was engrossed in my duel with Julyan. But how rude of me! Would you care to join us?"},{"name":"GIGI","text":"GrAnDpApA gOdBeRt! GrAnDpApA gOdBeRt!"},{"name":"GIGI","text":"MaMa NaShU sAyS yOu WiElD tHe PoWeRs Of LiFe AnD dEaTh! I bEg Of YoU, gRaNdPaPa GoDbErT─gRaNt Me LiFe! MaKe Me A rEaL bOy!"},{"name":"GODBERT","text":"Are you sure about this, son? It may sting a little..."},{"name":"GIGI","text":"I wIlL eNdUrE wHaTeVeR i MuSt To BeCoMe A rEaL bOy!"},{"name":"GODBERT","text":"Then let us begin!"},{"name":"GIGI","text":"ThIs BoDy...It'S eVeRyThInG i EvEr WaNtEd! It'S <span class=\"emphasis\">pErFeCt</span>! ThAnK yOu GrAnDpApA gOdBeRt, ThAnK yOu!"},{"name":"GODBERT","text":"Oh, but I have not even begun to begin! Byregot, guide my hammer!"},{"name":"GIGI","text":"PaPa HiLdY! i'M...i'M a MaNdErViLlE mAn!"},{"name":"HILDIBRAND","text":"Gigi, my son! Come to your father! Let me have a look at you!"},{"name":"GIGI","text":"PaPa HiLdY!"},{"name":"HILDIBRAND","text":"Gigi!"},{"name":"GODBERT","text":"&lt;sniffle&gt; Now that brings back some memories..."},{"name":"GIGI","text":"PaPa HiLdY!? oH dEaR, wHo CoUlD hAvE dOnE sUcH a ThInG...?"},{"name":"CYR","text":"By the Fury, it's just like the vase all over again! Miraculously restored to its original form!"},{"name":"HILDIBRAND","text":"Gigi, my boy... Upon further consideration, I believe that this body may suit you best. It is, how shall I put this...more manageable."},{"name":"NASHUMHAKARACC0A","text":"And much more adorable!"},{"name":"GIGI","text":"BuT hOw CaN i EvEr Be AcCePtEd As YoUr SoN iF i ReMaIn A mAmMeT?"},{"name":"HILDIBRAND","text":"Is <span class=\"emphasis\">that</span> what's been troubling you all this time? But why didn't you say so?"},{"name":"HILDIBRAND","text":"A Manderville is more than mere flesh and bone! He is vigor, compassion, honor─a gentleman for all seasons! Be you man or machine, it makes no difference. If they call you a mammet, you look them in the eye and say, “NAY─I am a <span class=\"emphasis\">Manderville</span> mammet!”"},{"name":"HILDIBRAND","text":"Mother, Father, forgive me for not consulting with you earlier, but circumstances forced my hand. I have formally adopted Gigi as my son and ward of House Manderville."},{"name":"GODBERT","text":"Ye gods, I knew he was fond of the mammet, but did you hear that, woman!? Our son's gone and got himself a son!"},{"name":"GIGI","text":"GrAnDpApA gOdBeRt! GrAnDpApA gOdBeRt!"},{"name":"GODBERT","text":"Hah, It all makes sense now! Grandpapa Godbert and Grandmama Julyan─I've been waiting <span class=\"emphasis\">years</span> to hear those words! Grandpapa Godbert! Grandmama Julyan!"},{"name":"HILDIBRAND","text":"Few things in life are <span class=\"emphasis\">grander</span> than becoming a grandparent, as they say! Hah hah hah!"},{"name":"JULYAN","text":"And what's so bloody grand about it...?"},{"name":"JULYAN","text":"I'll not be made grandmother to a bloody buggering <span class=\"emphasis\">mammet</span>. It's past time I beat some sense into my beloved boy..."},{"name":"CYR","text":"Fury take me... I'd heard the tales of dark knights before, but... No, no, it couldn't be. No, I think it was something far worse. <span class=\"emphasis\">Heretical</span>, like as not, but rules be damned─I'm not risking my life to find out..."},{"name":"CYR","text":"They're mad, utterly mad. The whole damn lot of them. How their house could rise to such prominence, I will never understand."},{"name":"CYR","text":"Well...at least the mammet seems to have overcome its existential crisis. &lt;sigh&gt; Before today I didn't know a mammet could even <span class=\"emphasis\">have</span> an existential crisis..."},{"name":"CYR","text":"Wait, what am I saying? It's a mammet! Why should I care what it claims to think or feel?"},{"name":"CYR","text":"Fury take me! Their idiocy is infectious. I mustn't allow myself to fall prey to it. Follow procedure, report to your superior. One step at a time. One step at a time..."},{"name":"CYR","text":"Right, then. My superiors, having been informed of the mammet's adoption by House Manderville─as witnessed by House Fortemps─proceeded to take me to task for my, “gross mishandling of the situation.”"},{"name":"CYR","text":"They remain convinced that the mammet is the product of heretical machinations and have commanded me to redouble my efforts to prove this incontrovertible fact."},{"name":"CYR","text":"That may prove problematic, however, as Gigi seems to have forsaken his quest to recover his memories, and thrown himself wholly into his new life as a “Manderville mammet,” casting about for any hint of a case alongside his doting father..."},{"name":"CYR","text":"In any event, though I do not share my superiors' conviction, I think it safe to say there is something exceedingly unusual about that mammet. You saw with your own eyes how effortlessly it restored that vase─and itself─to its original form."},{"name":"CYR","text":"Reconstructive magicks are not particularly rare, but his are unlike any I have ever seen before..."}],"reward":{"gil":1054,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67764]},"next":[67905]},"partials":[{"type":"npc","id":"1016608","obj":{"i":1016608,"n":"Hildibrand","l":2301,"q":2}},{"type":"npc","id":"1016619","obj":{"i":1016619,"n":"Cyr","l":2300,"q":6}},{"type":"npc","id":"1011225","obj":{"i":1011225,"n":"Herewart","l":2300,"q":1}},{"type":"npc","id":"1016609","obj":{"i":1016609,"n":"Nashu Mhakaracca","l":2301,"q":2}},{"type":"npc","id":"1016610","obj":{"i":1016610,"n":"Cyr","l":2301,"q":2}},{"type":"npc","id":"1017132","obj":{"i":1017132,"n":"Hildibrand","l":2200,"q":1}},{"type":"npc","id":"1017133","obj":{"i":1017133,"n":"Cyr","l":2200,"q":1}},{"type":"npc","id":"1017135","obj":{"i":1017135,"n":"Nashu Mhakaracca","l":2200,"q":1}},{"type":"npc","id":"1017274","obj":{"i":1017274,"n":"Gigi","l":2200,"q":1}},{"type":"npc","id":"1017277","obj":{"i":1017277,"n":"Cyr","l":2200,"q":1}},{"type":"quest","id":"67764","obj":{"i":67764,"n":"The Gigi Situation","g":69,"l":"Ishgard","s":32,"f":1}},{"type":"quest","id":"67905","obj":{"i":67905,"n":"A Gazebo to Call Our Own","g":69,"l":"Ishgard","s":34,"f":1}}]}