{"quest":{"name":"For Whom the Starlight Bell Tolls","location":"Limsa Lominsa","id":67760,"patch":3.1,"sort":93,"icon":100495,"eventIcon":71221,"issuer":1016287,"target":1016373,"involved":[1000153,1000691,1000947,1000997,1001000,1002299,1003818,1004093],"genre":204,"usedItems":[13726],"journal":["Collys, a reporter for the <span class=\"emphasis\">Harbor Herald</span>, would ask your aid in securing an interview.<br>※This quest is available for a limited time only.","Collys, a reporter for the <span class=\"emphasis\">Harbor Herald</span>, is having a difficult time learning the details of this year's Starlight Celebration event. Speak with Baenfaeld at the Aftcastle, and convince him to answer the gazetteer's earnest questions.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The troubled Baenfaeld explains that he would be glad to provide Collys with the details for her special edition if only they could first fix the old signal bell that is to be the main attraction. He asks that you speak with Hervey, the Adventurers' Guild's best goldsmith, and see how the repairs are progressing. Seek out the artisan near the Ruby Road Exchange in Ul'dah.","You find Hervey just as he has determined the cause of the bell's refusal to clang. It seems that the clapper has rusted through, and the goldsmith laments that he has not the skills to forge a new one. Acquire a new iron clapper for the signal bell, then return to Hervey with the replacement part.<br><br>An <span class=\"highlight\">iron clapper</span> can be crafted using blacksmithing, or purchased from the market boards.","You deliver a replacement clapper to Hervey, and he immediately affixes the part. The melody he produces from the repaired bell, however, is not as festive as he had hoped. With the prompting of a passing little helper, the goldsmith decides to have you request a famous composer to modify the Ishgardian soldiers' tune into a more celebratory arrangement. Make your way to Mih Khetto's Amphitheatre in Gridania, and present the signal bell and its accompanying sheet music to Cahernaut.","You place the bell and sheet music before the discerning eyes of Cahernaut, but the composer is unsure that even his genius can coax an appropriate tone from the signal bell's limited musical range. As you wonder what will become of the festival, you are paid an unexpected visit by a white-bearded man dressed as the Saint of Nymeia. The saint offers to work a seasonal miracle upon the bell, and, after a few moments of metalworking ministrations, hands the newly gleaming instrument back to Cahernaut. The composer, inspired by this display of goldsmithing prowess, soon has the bell's old song arranged into an enchanting melody. Return to Limsa Lominsa, and deliver the Starlight bell─and its rearranged sheet music─to Baenfaeld in East Hawkers' Alley.","You deliver the Starlight bell to an appreciative Baenfaeld. The contrite celebrant explains that although he has thrown out his original plans in favor of a more child-focused festival, his efforts to purchase wondrous decorations for the bell frame have his head spinning in confusion. Almost as if on cue, you are once more taken aback by an unexpected visit: four costumed little helpers appear, and offer their assistance with the preparations. Still reeling at the experience, Baenfaeld wonders if Hervey's shopping trip will be subject to a similar interruption. Find the goldsmith somewhere in Limsa Lominsa.","You locate Hervey attempting to procure more decorations, and, as expected, you are visited by four more little helpers. Offering little chance to refuse, the costumed artisans take possession of the restored bell, and rush off to complete the centerpiece of the festival. Hurry back to the Aftcastle, and see what has become of the Starlight bell.","By the time you return to the Aftcastle, it seems the little helpers' work is already done. The main bell has been returned to a beautifully decorated frame, and the jubilant melody that next rings forth has child and grown-up alike beaming with joy. Speak with Baenfaeld and share his thoughts on the celebration.","Baenfaeld thanks you again for all you have done, and expresses how glad he is that the festival was saved from the pompous event it threatened to become. The celebrant then assures you that he has promised to provide a full interview to Collys, and vows to continue bringing radiant smiles to the children of Eorzea. Go forth now and enjoy the rest of the Starlight Celebration!"],"objectives":["Speak with Baenfaeld.","Speak with Hervey in Ul'dah.","Obtain an iron clapper and deliver it to Hervey.","Present the signal bell to Cahernaut in Gridania.","Deliver the Starlight bell to Baenfaeld in Limsa Lominsa.","Search for Hervey.","Examine the Starlight bell.","Speak with Baenfaeld."],"dialogue":[{"name":"COLLYS","text":"Lovely to meet you! The name's Collys. I'm a reporter for the <span class=\"emphasis\">Harbor Herald</span>, Limsa Lominsa's premier gazette. And let me tell you: no one is as excited as I am that the season for the Starlight Celebration has rolled around again!"},{"name":"COLLYS","text":"I don't know if you've heard, but my sources in the Adventurers' Guild tell me that the Starlight celebrant is planning an event that will resurrect a long-lost Starlight tradition! Doesn't that sound wonderful?"},{"name":"COLLYS","text":"I'd hoped to put together a special edition on the event...only, it seems there's been some kind of problem. And all the little helpers I've tried to interview have given me the vaguest of responses."},{"name":"COLLYS","text":"You're in good standing with the Adventurers' Guild, aren't you? Fancy helping a reporter share the word on the happiest time of the year?"},{"name":"COLLYS","text":"I need you to speak with Baenfaeld─he's this year's celebrant─and convince him to respond to my questions with definitive answers. You'll find him at the Aftcastle, making preparations for the festivities. Please, adventurer! I'll be ever so grateful!"},{"name":"BAENFAELD","text":"This ain't goin' well at all...<br>Eh? Need a word with me, do ye?"},{"name":"BAENFAELD","text":"...Aye, I know the lass ye speak of. Me bosses in the Adventurers' Guild told me a <span class=\"emphasis\">Harbor Herald</span> reporter'd be around, an' that I was to answer all her questions. Seems she means to write up some special piece on the Starlight Celebration..."},{"name":"BAENFAELD","text":"I'd love to help her, I truly would─the event we're plannin' could use the publicity. But unless we sort out the bleedin' snag we've hit, there might not <span class=\"emphasis\">be</span> any kinda event to write about."},{"name":"BAENFAELD","text":"...Here, ye look like a capable <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">bloke</span></span>. We could surely use another hand with the preparations, an' there'd be a reward in it for ye. Are you in?"},{"name":"BAENFAELD","text":"I expect ye already know the tale behind the festival, aye? Ishgardian soldiers lendin' their red jackets to wee freezin' orphans, an' all that?"},{"name":"BAENFAELD","text":"Well, there's another part to the story what don't get told as often: afore the soldiers would set off to round up the younglin's, they would always play a special melody on their signal bells."},{"name":"BAENFAELD","text":"The sound o' them bells echoin' through the frigid night air was said to bring the biggest bloody smiles to them orphans─an' even a few hard-bitten veterans as well, I'd wager."},{"name":"BAENFAELD","text":"It's a damn shame, then, that that particular tradition weren't adopted into the celebration along with the crimson coats."},{"name":"BAENFAELD","text":"Ever since the Calamity made a bloody mess of Eorzea, we've been doin' our best to put the place to rights. But the Garleans an' the beast tribes ain't makin' it easy for us, an' the unendin' flow o' refugees don't help matters neither."},{"name":"BAENFAELD","text":"An' when all grown-ups do is frown an' grumble, it creates an atmosphere o' despair for the little ones. How often do ye see the younglin's truly <span class=\"emphasis\">smilin'</span> these days, eh?"},{"name":"BAENFAELD","text":"That's why the Adventurers' Guild decided to do summat special this year."},{"name":"BAENFAELD","text":"It's time we resurrected an old custom to ring in the celebration, an' put some big bloody smiles back on folks' faces!"},{"name":"BAENFAELD","text":"The Temple Knights o' Ishgard was only too happy to dig up their old signal bells from where they was rustin' in some musty storehouse, an' then ship 'em here for the festival. No matter how much we cleaned an' oiled the main bell, though, we couldn't get the damn thing to ding, let alone dong."},{"name":"BAENFAELD","text":"The guild's coffers was all but emptied for this event, an' the Admiral's gone an' invited a bunch o' high-an'-mighty dignitaries to attend the openin' ceremony. We can't <span class=\"emphasis\">afford</span> to fail..."},{"name":"BAENFAELD","text":"Ye'll see this through to the end, though, won't ye? Get that bell to ring, an' I promise I'll talk that reporter's bloody ears off on any subject she cares to name."},{"name":"BAENFAELD","text":"First, ye'll need to head to Ul'dah. Track down Hervey─he's the guild's top goldsmith─an' see how things is comin' along with the bell repairs."},{"name":"HERVEY","text":"...You're <span class=\"highlight\">Forename Surname</span>? Uh-huh. So, is that supposed to impress me, or─ Oh! You must be the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">bloke</span></span> Baenfaeld mentioned. Well, your timing couldn't be better."},{"name":"HERVEY","text":"I just removed the bell's clapper, you see, and was surprised at how light it was. When I took a closer look, I realized that its middle had been eaten away by rust...which explains why no amount of adjusting or oiling could give the bell a satisfying clang."},{"name":"HERVEY","text":"The problem is, I haven't the slightest idea of how to forge a new one─that's a job for a smitty, not a goldsmith. I suppose we'll just have to ask around, and see what we can find."},{"name":"HERVEY","text":"Do you know anyone who can craft an iron clapper? Get your hands on one, and I'll tell Baenfaeld to dig a bit deeper for your reward. Meanwhile, I'll try my luck with the local merchants..."},{"name":"SYSTEM","text":"An <span class=\"highlight\">iron clapper</span> can be crafted using blacksmithing, or purchased from the market boards."},{"name":"BAENFAELD","text":"Get yerself to Ul'dah an' find Hervey, our guild's best goldsmith. Give him whatever help he needs to fix that bell!"},{"name":"HERVEY","text":"&lt;sigh&gt; None of my usual merchant contacts seem to deal in bell parts. I wonder if it's too late to commission a blacksmith..."},{"name":"HERVEY","text":"You've brought me a clapper!? But where did you─ Never mind, let's attach it to the signal bell right away!"},{"name":"HERVEY","text":"Well, it certainly sounds like a bell now, doesn't it? It's just that this melody is rather... Hmmm. Could I be reading the music wrong?"},{"name":"JULYAN","text":"You there! What was that song ye were playin' on that bell?"},{"name":"HERVEY","text":"Well, well, if it isn't one of the saint's little helpers. That was a tune we were taught by the knights of Ishgard─we're attempting to reenact an old tradition for this year's Starlight Celebration, you see."},{"name":"HERVEY","text":"This was once a signal bell for an Ishgardian barracks, and we've only just restored it to working order. As you may have noticed, however, the melody isn't quite <span class=\"emphasis\">festive</span> enough."},{"name":"JULYAN","text":"Let me ask ye a question, lad: what exactly are ye ringin' this bell for?"},{"name":"HERVEY","text":"Why, to make this year's Starlight Celebration a resounding success, of course! The Adventurers' Guild has spent a veritable fortune on festival preparations, and failure is simply unacceptable."},{"name":"JULYAN","text":"...I knew it. And what is the Starlight Celebration supposed to be for, then, hm? Is it for the prestige o' the bloody <span class=\"emphasis\">Adventurers' Guild</span>? ...Or is it for the happiness o' younglin's all across Eorzea?"},{"name":"HERVEY","text":"I... That is to say..."},{"name":"JULYAN","text":"Now, I'm barely half an artisan myself, but even I can see that ye've done a nice job o' restorin' an old signal bell to its original state. But maybe ye've let yerself get carried away by yer desire to resurrect the past."},{"name":"JULYAN","text":"Over the years, the Starlight Celebration has grown into a festival with the sole purpose o' bringin' joy to children. Maybe this bell ringin' custom o' yers needs some adjustment, as well, to match the era into which it's bein' reborn."},{"name":"HERVEY","text":"...You're absolutely right. Somewhere along the way, we lost sight of the true meaning of the celebration. The spectacle became more important than the happiness it was intended to create..."},{"name":"HERVEY","text":"But that ends right here! We'll turn this prideful mess into the joyous festival it was meant to be! Somehow!<br>...A little help, little helper?"},{"name":"JULYAN","text":"Ah, ye silly oaf! Must I do all the thinkin' for ye? All ye need do is take that tired old melody and add a little magic─make of it a spell what enchants the ears and brings a smile to a younglin's face."},{"name":"JULYAN","text":"You there. Lend this dolt a hand if he needs one."},{"name":"JULYAN","text":"<span class=\"highlight\">Forename</span>. Lend this dolt a hand, would ye? I'd feel better knowin' ye were involved."},{"name":"HERVEY","text":"Add a little magic to the melody...<br>I think I understand. But we'll need someone as can make it more festive without completely overshadowing the original tune."},{"name":"HERVEY","text":"And I know just the man to do it! Cahernaut's the composer for a famous orchestra, and they're in Gridania right now for the celebrations─take the bell and the sheet music to him, and see if he's willing to come up with a new arrangement for the song."},{"name":"HERVEY","text":"I'll head back to Baenfaeld, and we'll figure out how to include more younglings in the audience."},{"name":"HERVEY","text":"Contacting all the orphanages in the realm and inviting them to Limsa Lominsa for the performance should make for a good start. To the hells with the budget!"},{"name":"BAENFAELD","text":"Get yerself to Ul'dah an' find Hervey, our guild's best goldsmith. Give him whatever help he needs to fix that bell!"},{"name":"CAHERNAUT","text":"Yes, I am Cahernaut. Yes, <span class=\"emphasis\">the</span> Cahernaut. The orchestra is not presently accepting applicants, so if you would kindly─ Hm?"},{"name":"CAHERNAUT","text":"...And you would have me rearrange this into a less dreary melody? &lt;sigh&gt; Very well. Anything for <span class=\"emphasis\">the children</span>."},{"name":"CAHERNAUT","text":"I am afraid, however, that the signal bell is not a particularly versatile instrument. There is little even the great Cahernaut can achieve with such a limited musical scale..."},{"name":"GODBERT","text":"(-???-)Oho, then mayhap that bell is overdue for the gentle touch of innovation!"},{"name":"CAHERNAUT","text":"Ah, if it isn't the Saint of Nymeia himself."},{"name":"GODBERT","text":"(-Saint of Nymeia-)I overheard your little dilemma, and it just so happens that I have some small skill with goldsmithing. If it is extra notes you need, then it is extra notes you shall have!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)It's hammer time!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)Crafting miracles is the Mander...er, Starlight way!♪"},{"name":"GODBERT","text":"(-Saint of Nymeia-)A masterpiece to brighten your Starlight day!♪"},{"name":"GODBERT","text":"(-Saint of Nymeia-)See how it shines! See how it glimmers! And if it doesn't produce the sweetest of sounds, then I shall eat my Starlight hat!"},{"name":"CAHERNAUT","text":"Th-The richness of the timbre is inexplicable! Its ringing reverberations will enthrall both adults and younglings alike!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)It's an old bell, to be sure, but the restoration work was impeccable."},{"name":"GODBERT","text":"(-Saint of Nymeia-)The new clapper... That was your doing? It certainly made my task far simpler than I anticipated."},{"name":"GODBERT","text":"(-Saint of Nymeia-)The new clapper... That was your doing, wasn't it, <span class=\"highlight\">Forename</span>? It certainly made my task far simpler than I anticipated."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Well, I'm glad that this humble wandering pilgrim could be of service! Mayhap we shall meet again someday! Ho ho ho!"},{"name":"CAHERNAUT","text":"I shall begin work on the new arrangement immediately. The saint's genius has called to my own..."},{"name":"CAHERNAUT","text":"...And it is done! Pray convey these masterpieces─both the reworked bell and my Starlight melody─to your colleagues in Limsa Lominsa. Your audience shall be enchanted, I assure you!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)Hmmm. An acceptable result, but not enough flair for my taste. Time to dust off the linkpearl and make some calls..."},{"name":"BAENFAELD","text":"I heard word from Hervey. So, we're to call more younglin's to Limsa, now? I just hope this don't end in disaster..."},{"name":"CAHERNAUT","text":"Take the newly refurbished bell─and my masterfully rearranged melody, of course─to Limsa Lominsa and your waiting colleagues. The children are in for a treat this year!"},{"name":"BAENFAELD","text":"<span class=\"highlight\">Forename</span>! Hervey told me everythin' what happened, an' I decided to do some extra shoppin' for the festival while I was waitin' for ye to get back."},{"name":"BAENFAELD","text":"...Ah, so this is the new an' improved bell─an' a newly arranged melody to boot. Ye've been more help than I deserved, all things considered."},{"name":"BAENFAELD","text":"Hervey's tale opened me eyes to what proud clods we've been...<br>I've already been in contact with the Admiral about cancelin' that overblown openin' ceremony, an' she took me explanation with good grace."},{"name":"BAENFAELD","text":"It's time we started thinkin' with our hearts, an' not our bleedin' coinpurses! We'll throw the best damn Starlight Celebration these little ones have ever seen!"},{"name":"BAENFAELD","text":"Thanks to you, we've got the bell an' the song sorted. Now we just need to do summat about that borin' old metal frame..."},{"name":"BAENFAELD","text":"That's actually what brought me here to the markets. I was lookin' to decorate the bell frame, and make it a proper part o' the festivities."},{"name":"BAENFAELD","text":"But I'm afraid I've less sense for choosin' decorations than a blind Sahagin."},{"name":"GEVA","text":"(-???-)Ah, now I understand why our assistance was required."},{"name":"SERENDIPITY","text":"(-???-)If our task is to put smiles on little faces, then they shall be the widest smiles they can possibly be!"},{"name":"BAENFAELD","text":"But... Yer all guildmasters, ain't ye!?"},{"name":"REDOLENTROSE","text":"Ohohoho! Surely you jest, good sir! We are merely the saint's little helpers, wandering the land in search of good deeds to perform."},{"name":"BRITHAEL","text":"It were the saint himself what set us on this task, though. Seems ye could use a hand with some decoratin', eh?"},{"name":"GEVA","text":"Fortunately, we all have a certain amount of experience with such things. You just leave it to us."},{"name":"BAENFAELD","text":"Wh-What in the seven hells just happened...?"},{"name":"BAENFAELD","text":"Ye know, I sent Hervey off on a shoppin' errand o' his own... Ye don't suppose them “little helpers” will track him down as well, will they? Let's go check on him─the poor, unsuspectin' bugger!"},{"name":"REDOLENTROSE","text":"...How unusual for that bearded eccentric to call upon us for help. Well, I suppose I <span class=\"emphasis\">am</span> an expert in the prettifying department. Mayhap Serendipity will wish to coordinate colors..."},{"name":"SERENDIPITY","text":"Hmmm. We'll need a decorative design that, while tastefully extravagant, serves to draw all eyes to the main attraction. I wonder if Severian has any ideas..."},{"name":"SEVERIAN","text":"What part of “critical juncture in my research” does that persistent patrician fail to understand? &lt;sigh&gt; I suppose I should indulge in one of those “breaks” Deitrich is always insisting I take. Now, where is that linkpearl Redolent Rose gave me...?"},{"name":"GEVA","text":"...What an unexpected request. Decoration is not my usual area of expertise, but I'll make an exception in this case. What does Beatin think of all this, I wonder...?"},{"name":"BEATINE","text":"Hmph, this is so typical of him. How he extolls wood's finer qualities when he has need of my assistance. I assume Geva has experienced a similar overture..."},{"name":"BRITHAEL","text":"A request from one o' the best in the business...<br>I'd best have a drink to settle me nerves, then ask H'naanza how she means to handle this."},{"name":"LYNGSATH","text":"It's nice o' the old buzzard to include me, but 'ow am I meant to contribute? By makin' a meal what Brithael's churnin' innards can keep down? Ha! Well, I'm sure there'll be a way to make use o' me skills..."},{"name":"HNAANZA","text":"Aiding with these decorations shall prove an interesting challenge. Did he contact us all? Lyngsath must find this amusing..."},{"name":"HERVEY","text":"Bah, I thought this would be the perfect place to pick up something exotic and interesting for the decorations, but there's naught to be found...<br><span class=\"highlight\">Forename</span>! What are you doing here?"},{"name":"LYNGSATH","text":"(-???-)Leave it to an expert in procurin' rare ingredients, lad. I've already spoken with the 'arbormaster an' secured a box o' wonders from distant shores."},{"name":"BAENFAELD","text":"More guildmasters!? Yer <span class=\"emphasis\">all</span> in on it!"},{"name":"SEVERIAN","text":"Guildmasters? Where? I see only little helpers."},{"name":"HNAANZA","text":"You'll not find much when your objective is so hazy. Narrow your focus, and consider what it is the client truly desires."},{"name":"BEATINE","text":"It would be best if you entrust that bell to us, child."},{"name":"HNAANZA","text":"Fear not: we'll take care of everything!"},{"name":"BAENFAELD","text":"Am I dreamin', or was our final task just taken over by the master artisans o' three different city–states? I've got to see this for meself! Quick, back to the Aftcastle!"},{"name":"BAENFAELD","text":"By the gods! It's beautiful!"},{"name":"GUIDEXMSCHILD","text":"(-Orphan Boy-)It were amazin'! A gang o' little helpers came rushin' in like the wind, and done them bells up pretty afore I could even blink! I ain't never seen nothin' like it!"},{"name":"BAENFAELD","text":"I should've expected naught less from the guildmas─ Er, the saint's little helpers. I'll be sure to thank them all..."},{"name":"BAENFAELD","text":"What say ye, <span class=\"highlight\">Forename</span>? Shall we ring in the celebration? Let's light up the face of every child from here to the harbor!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)It's important to preserve the past..."},{"name":"GODBERT","text":"(-Saint of Nymeia-)But it's the culture and customs that grow and thrive with the passage of time that are truly history's treasures. That's what sings to people's hearts."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Ho ho ho! I'm sure the Ishgardians who began this tradition of giving would be pleased with the joy the Starlight Celebration continues to bring."},{"name":"BAENFAELD","text":"I have to thank ye again for all ye've done, <span class=\"highlight\">Forename</span>. Ye've helped steer us back to the road we ought to have been walkin' in the first place."},{"name":"BAENFAELD","text":"Speakin' o' which, that reporter from the <span class=\"emphasis\">Harbor Herald</span> sends her thanks as well. I've promised her a full interview at her earliest convenience."},{"name":"BAENFAELD","text":"Meanwhile, I've more younglin's to delight with that enchantin' melody. Mark me words, I'll have the whole bloody realm smilin' afore this festival's done!"}],"reward":{"gil":634,"items":[{"id":13290},{"id":13291},{"id":13292}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1016287","obj":{"i":1016287,"n":"Collys","l":28,"q":1}},{"type":"npc","id":"1016373","obj":{"i":1016373,"n":"Baenfaeld","l":28,"q":1}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"item","id":"13290","obj":{"i":13290,"n":"Reindeer Antler Headband","l":1,"c":40704,"t":34,"p":59}},{"type":"item","id":"13291","obj":{"i":13291,"n":"Reindeer Gloves","l":1,"c":44414,"t":37,"p":53}},{"type":"item","id":"13292","obj":{"i":13292,"n":"Reindeer Hooves","l":1,"c":46565,"t":38,"p":53}},{"type":"item","id":"13726","obj":{"i":13726,"n":"Iron Clapper","l":15,"c":21003,"t":85}}]}