{"quest":{"name":"As It Once Was","location":"Ishgard","id":67767,"patch":3.2,"sort":9,"icon":100525,"eventIcon":71201,"issuer":1012580,"target":1016535,"involved":[1010388,1010389,1010390,1012692,1012693,1013227,1016531,1016532,1016533,1016534,1016536,1016537,1016538,1016539,1016540,1016541,1016542,1016543,1016553,1016554,1016555,1016556,1016557],"genre":4,"journal":["Tataru is waiting to share good tidings with you and Alphinaud.","Tataru proudly informs you that F'lhaminn, Hoary Boulder, and Coultenet─the three Scions of the Seventh Dawn forced to flee Limsa Lominsa and the Crystal Braves' betrayal─are at last homeward bound. Not to be outdone, however, Krile and Thancred appear shortly thereafter, to share with the others the next step in their plan for tracking down Minfilia. Theorizing that Hydaelyn's direct intercession must leave a measurable impact on the ambient aether, they intend to study the battlefield where you faced the Ultima Weapon─where She shielded you with the blessing of Light: the Praetorium. Though he knows not how such data may be put to use, Alphinaud nevertheless defers to your comrades' judgment, as well as their suggestion that you, Alphinaud, and Tataru see to the necessary preparations for the long-lost Scions' homecoming.","Surprised and pleased to see a familiar face, F'lhaminn and her companions greet you warmly and offer their apologies for not returning sooner. Eager to speak with her daughter, F'lhaminn asks after Minfilia, forcing you to divulge that she has yet to be found. Though clearly distraught, F'lhaminn does her best to remain calm and trust in the Scions to see her daughter safely home, and together you make for Revenant's Toll.","Outside the Seventh Heaven, the trio pause to take in the familiar surroundings. Though much has changed, much indeed remains the same...though who can say how they will feel once they walk through the doors of the Rising Stones?","The Rising Stones is filled with the sounds of laughter and drink as F'lhaminn, Hoary Boulder, and Coultenet drift to familiar corners to greet old friends and tell tales of adventurers in foreign lands. For some, it is as though they never left─a break in a conversation now resumed. For others, it is the promise of a new beginning─a new chapter in a larger story. Yet in the midst of all the excitement, Alphinaud and Tataru stand apart, strangely silent...","Though many delight in the homecoming of the long-lost trio, Alphinaud's thoughts remain with those who have yet to return. But Tataru, ever resilient, reassures him that all their missing comrades will be found─Minfilia, Yda, Papalymo...every last one."],"objectives":["Rendezvous with F'lhaminn in Limsa Lominsa.","Speak with F'lhaminn in Revenant's Toll.","Speak with the Scions in the Rising Stones.","Speak with Tataru."],"dialogue":[{"name":"ALPHINAUD","text":"Much as I worry for the future of Ishgard, the fate of our missing friends concerns me even more..."},{"name":"TATARU","text":"Alphinaud, <span class=\"highlight\">Forename</span>! I've been looking all over for you!"},{"name":"TATARU","text":"We've received news regarding F'lhaminn, Hoary Boulder, and Coultenet!"},{"name":"ALPHINAUD","text":"Really? Has something happened?"},{"name":"TATARU","text":"No, no, it's nothing bad─quite the opposite, in fact! It seems that once they learned the Scions' good name had been restored, they boarded the next ship bound for Limsa Lominsa. They should be arriving any moment now!"},{"name":"TATARU","text":"It's easy to forget how useful linkpearls are, isn't it? When they work, I mean. And you don't mind being spied on."},{"name":"ALPHINAUD","text":"Quite. But what wonderful news! To think that our reunion is close at hand."},{"name":"THANCRED","text":"A pleasure to see you too, Alphinaud."},{"name":"ALPHINAUD","text":"Ah, Thancred...and Krile. What brings the two of you here?"},{"name":"THANCRED","text":"Krile and I have been looking into how we might track down Minfilia."},{"name":"KRILE","text":"And we may just have found the answer."},{"name":"KRILE","text":"<span class=\"highlight\">Forename</span>─when you were fleeing Ul'dah with Minfilia, you said that Hydaelyn spoke to her shortly before you parted ways, yes?"},{"name":"KRILE","text":"Well, assuming that is true─and I see no reason to suspect that it is not─it seems reasonable to conclude that Hydaelyn commanded her to remain behind."},{"name":"KRILE","text":"That is to say, the Mothercrystal <span class=\"emphasis\">directly interceded</span> to guide Minfilia."},{"name":"KRILE","text":"Admittedly, this is all still quite hypothetical, but I propose that such intervention, however subtle, must surely leave some residual trace. A lingering disturbance in the aether─or ripple, if you will."},{"name":"KRILE","text":"In order to establish the existence of such ripples, of course, we will require suitable data."},{"name":"THANCRED","text":"Fortunately, I know where such data can be found: the battleground where <span class=\"highlight\">Forename</span> felled the Ultima Weapon...and the site of my personal ignominy."},{"name":"THANCRED","text":"'Twas there that Hydaelyn intervened to shield <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> from the magick I invoked. Krile and I will infiltrate the castrum and analyze the aether therein."},{"name":"ALPHINAUD","text":"The two of you? Alone?"},{"name":"THANCRED","text":"I have a proven knack for subterfuge, and I am confident there will be sufficient nooks and crannies in which to hide Krile while the patrols pass."},{"name":"THANCRED","text":"Besides, if you and <span class=\"highlight\">Forename</span> come along, who will see to F'lhaminn's grand homecoming?"},{"name":"ALPHINAUD","text":"When you put it like that... Very well, I will trust in your plan."},{"name":"ALPHINAUD","text":"I know not whether this data will yield a means to find Minfilia, but it will at the very least eliminate another avenue of inquiry."},{"name":"ALPHINAUD","text":"Tataru and I will return to the Rising Stones and make preparations for our comrades' return. Might I impose upon you to meet them at the Lominsan docks?"},{"name":"ALPHINAUD","text":"Then I shall see the four of you at the Rising Stones. Safe travels!"},{"name":"HOARYBOULDER","text":"Is that...? By the gods, it <span class=\"emphasis\">is</span> you! Well met, <span class=\"highlight\">Forename</span>, well met!"},{"name":"COULTENET","text":"If it isn't <span class=\"highlight\">Forename Surname</span>! Really, you didn't have to come all this way just for us!"},{"name":"ALPHINAUD","text":"Oh? Lady F'lhaminn is not with you?"},{"name":"TATARU","text":"I can't wait to hear what adventures they've had!"},{"name":"FLHAMINN","text":"Oh, <span class=\"highlight\">Forename</span>! How have you been? Come here─let me have a good look at you."},{"name":"FLHAMINN","text":"Thank the Twelve. One hears the strangest tales in foreign lands. I worried about you all every day..."},{"name":"COULTENET","text":"We would have sent word sooner, but the Braves afforded us no opportunity. When they fell upon us in the market, it was all we could do to escape."},{"name":"COULTENET","text":"Tataru found her way to you, of course, but we were forced to seek shelter aboard a Hannish vessel."},{"name":"HOARYBOULDER","text":"It pained us not being there when you needed us most. But we made the most of it, didn't we, Coultenet? Studied and trained from dusk till dawn, we did!"},{"name":"FLHAMINN","text":"We would have sent word sooner, but we knew not whom to trust, and with the vast distance..."},{"name":"FLHAMINN","text":"But those dark days are behind us at last. I shall be glad indeed to return home and speak with my daughter."},{"name":"FLHAMINN","text":"What do you mean she's <span class=\"emphasis\">missing</span>!? How could you let this happen!?"},{"name":"FLHAMINN","text":"Forgive me, I...I am sure you are doing everything in your power to find her."},{"name":"FLHAMINN","text":"...As Thancred must be. He watched over her from the first─long before me. And he will watch over her to the last."},{"name":"FLHAMINN","text":"I shall pray for her safe return, and busy myself in the meantime."},{"name":"COULTENET","text":"For a certainty, there is much and more to be done. The Braves may have bloodied us, but the path remains, and we shall not be swayed from it."},{"name":"HOARYBOULDER","text":"Aye, that's the spirit! To the Scions, and a long overdue reunion! Huzzah!"},{"name":"FLHAMINN","text":"Well, there you have it. To the Rising Stones!"},{"name":"HOARYBOULDER","text":"Ahhh, it's great to be back in the Toll! &lt;sniff&gt; It even <span class=\"emphasis\">smells</span> like adventure!"},{"name":"COULTENET","text":"Home at last... I must make my rounds and see who remains."},{"name":"FLHAMINN","text":"...It feels good to be home again."},{"name":"FLHAMINN","text":"To think that everyone is waiting for us, just beyond those doors. Friends and family with whom we have shared so much..."},{"name":"FLHAMINN","text":"...Gods help me, but the older I get, the more sentimental I become. Come, let us not keep them waiting."},{"name":"ALPHINAUD","text":"And there they are, at last. Thank the Twelve..."},{"name":"TATARU","text":"Nothing like a homecoming to lift everyone's spirits! Thanks for bringing them back, <span class=\"highlight\">Forename</span>."},{"name":"ALIANNE","text":"When our comrades betrayed us, I feared all was lost. How wrong I was!"},{"name":"EPHEMIE","text":"We must tell the children at once! They've always been so fond of Hoary."},{"name":"BLUOMWYDA","text":"I worry that Aergmhus is getting a bit carried away, but I suppose I can overlook it on this occasion."},{"name":"ISILDAURE","text":"Aye, aye, I heard it all from Alianne. So, where is she? If I'm to greet the Songstress of Ul'dah, I would do so on my feet!"},{"name":"OCHERBOULDER","text":"Huzzah! He is returned! Together, my brother and I shall serve the Scions till the breaking of an <span class=\"emphasis\">eighth</span> dawn!"},{"name":"AENOR","text":"Oh my. Decisions, decisions..."},{"name":"CLEMENCE","text":"First Ocher, and now Hoary! A passing fancy I could suffer, but <span class=\"emphasis\">this</span>!? She's hopeless! Utterly hopeless!"},{"name":"VMAHTIA","text":"Is that the Lady F'lhaminn I've heard so much about? Well, well! I shall have to introduce myself."},{"name":"FLHAMINN","text":"Alianne, Ephemie! It fills my heart with joy to see you both hale and healthy. And what of Higiri?"},{"name":"EPHEMIE","text":"She is well, though abroad on a mission at present."},{"name":"ALIANNE","text":"It just wasn't the same without you. Welcome back, my lady!"},{"name":"FLHAMINN","text":"Twelve be praised, so many are still with us..."},{"name":"AERGMHUS","text":"Ah, we could do with more of that around here! Heartfelt reunions with stalwart companions! Brings a─&lt;belch&gt;─brings a bloody tear to the eye!"},{"name":"AERGMHUS","text":"Brilliant, bloody brilliant! &lt;belch&gt;"},{"name":"HOUMEI","text":"To secret oneself in a ship's hold to secure safe passage to a faraway land... This is a tale we know all too well."},{"name":"HOUMEI","text":"When they are well rested, I should like to seek a formal introduction."},{"name":"ISILDAURE","text":"Why wait, my friend? Come, there is no need to be shy!"},{"name":"HOUMEI","text":"Pray grant me a moment longer, at least! Though I am happy to oblige you, my legs are rather less accommodating..."},{"name":"HOUMEI","text":"Isildaure has the spirit of a man half his age. I imagine his granddaughter often struggled to keep up."},{"name":"HOARYBOULDER","text":"Ocher! What in the seven hells drove my little brother to come to Mor Dhona?"},{"name":"OCHERBOULDER","text":"Why, you, Brother─you and the Scions, of course! For a thousand days I trained, that I might grow as strong as you─that I might fight alongside you!"},{"name":"OCHERBOULDER","text":"Yet now that you are here, I sense that you have surpassed me once more... No, do not tell me─you trained with the Hannish, did you not?"},{"name":"HOARYBOULDER","text":"Your eyes do not deceive, Brother! Aye, I have studied the Trials of the Braves, and drunk deep of the souls of mine enemies!"},{"name":"HOARYBOULDER","text":"An unexpected but welcome reunion indeed! And a challenge, besides. It would not do to be bested by my little brother, oh no. Not after having come so far!"},{"name":"COULTENET","text":"Glad though I am to be home, I cannot help but think of those who have yet to return..."},{"name":"COULTENET","text":"Once we have settled in, I would join the search."},{"name":"COULTENET","text":"We all must do our duty─and I am no exception. Our brothers and sisters are counting on us."},{"name":"TATARU","text":"It's been so long since I've seen them all like this."},{"name":"ALPHINAUD","text":"Too long..."},{"name":"ALPHINAUD","text":"'Twas the chaos born of my foolish ambition which forced them to flee."},{"name":"ALPHINAUD","text":"Though they are returned, there are others yet missing─others whom we cannot forsake."},{"name":"TATARU","text":"We'll find them, Alphinaud─I know we will! Minfilia, Yda, Papalymo...every last one!"},{"name":"TATARU","text":"And when they walk through those doors, we'll be here to welcome them home."},{"name":"TATARU","text":"With me at the head of the queue, of course!"}],"reward":{"gil":1807,"items":[{"id":13742,"one":1},{"id":13743,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67699]},"next":[67768]},"partials":[{"type":"npc","id":"1012580","obj":{"i":1012580,"n":"Tataru","l":2301,"q":5}},{"type":"npc","id":"1016535","obj":{"i":1016535,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1010388","obj":{"i":1010388,"n":"F'lhaminn","l":67,"q":1}},{"type":"npc","id":"1010389","obj":{"i":1010389,"n":"Hoary Boulder","l":67,"q":1}},{"type":"npc","id":"1010390","obj":{"i":1010390,"n":"Coultenet","l":67,"q":1}},{"type":"npc","id":"1012692","obj":{"i":1012692,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1012693","obj":{"i":1012693,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1013227","obj":{"i":1013227,"n":"Alphinaud","l":2301,"q":4}},{"type":"npc","id":"1016531","obj":{"i":1016531,"n":"F'lhaminn","l":29,"q":1}},{"type":"npc","id":"1016532","obj":{"i":1016532,"n":"Hoary Boulder","l":29,"q":1}},{"type":"npc","id":"1016533","obj":{"i":1016533,"n":"Coultenet","l":29,"q":1}},{"type":"npc","id":"1016534","obj":{"i":1016534,"n":"Alphinaud","l":481,"q":2}},{"type":"npc","id":"1016536","obj":{"i":1016536,"n":"Alianne","l":481,"q":1}},{"type":"npc","id":"1016537","obj":{"i":1016537,"n":"Ephemie","l":481,"q":1}},{"type":"npc","id":"1016538","obj":{"i":1016538,"n":"Aergmhus","l":481,"q":1}},{"type":"npc","id":"1016539","obj":{"i":1016539,"n":"Isildaure","l":481,"q":1}},{"type":"npc","id":"1016540","obj":{"i":1016540,"n":"Homei","l":481,"q":1}},{"type":"npc","id":"1016541","obj":{"i":1016541,"n":"F'lhaminn","l":481,"q":1}},{"type":"npc","id":"1016542","obj":{"i":1016542,"n":"Hoary Boulder","l":481,"q":1}},{"type":"npc","id":"1016543","obj":{"i":1016543,"n":"Coultenet","l":481,"q":1}},{"type":"npc","id":"1016553","obj":{"i":1016553,"n":"Bluomwyda","l":481,"q":1}},{"type":"npc","id":"1016554","obj":{"i":1016554,"n":"Ocher Boulder","l":481,"q":1}},{"type":"npc","id":"1016555","obj":{"i":1016555,"n":"V'mah Tia","l":481,"q":1}},{"type":"npc","id":"1016556","obj":{"i":1016556,"n":"Aenor","l":481,"q":1}},{"type":"npc","id":"1016557","obj":{"i":1016557,"n":"Clemence","l":481,"q":1}},{"type":"item","id":"13742","obj":{"i":13742,"n":"Steamed Staff","l":160,"c":24317,"t":46}},{"type":"item","id":"13743","obj":{"i":13743,"n":"Sesame Cookie","l":139,"c":24007,"t":46}},{"type":"quest","id":"67699","obj":{"i":67699,"n":"As Goes Light, So Goes Darkness","g":4,"l":"Ishgard","s":8}},{"type":"quest","id":"67768","obj":{"i":67768,"n":"The Word of the Mother","g":4,"l":"The Rising Stones","s":10}}]}