{"quest":{"name":"The Gigi Situation","location":"Ishgard","id":67764,"patch":3.3,"sort":32,"icon":100573,"unlocksFunction":1,"eventIcon":71341,"issuer":1016619,"target":1016608,"involved":[1016600,1016601,1016602,1016603,1016607,1016609,1016610,1016614,1016616,1017128,1017129,1017130,1017131,1017136,1017275,1017276,1017278],"genre":69,"journal":["Cyr must once more enter into a world he does not quite understand.","Inspector's Log:<br>As invigorating as my sojourn in the skies above was, full glad I am to be back on terra firma. Of course, the landing left much to be desired─as did my father's overzealous efforts to pluck me from the snow─but in painful circumstance did we enjoy encounters serendipitous and strange. A good and true Gentle Dead Man, far removed from the sands of Ul'dah, and Gigi, a precocious young lad seemingly bereft of all memories. Some might dismiss these events as the mere whims of fate, but I say, if these be not the beginnings of a spectacular case, then my name is not Hildibrand Helidor Maximilian Manderville!<br>　　　　　　　　　　　　*　*　*<br>Cyr's superiors at the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine have decided that, in the interest of public safety, the mammet Gigi must be seized and subjected to thorough examination. Should it be determined that the mammet is of heretical origin, it is to be destroyed─a judgment not like to sit well with Inspector Hildibrand, who has taken to escorting the “young boy” around the city of Ishgard, in an effort to help him recover his missing memories.","In predictable fashion, Cyr's attempt to convince Hildibrand to surrender Gigi into his custody somehow leads to a debate on the mammet's gender. The commotion serves to draw Lord Edmont out from nearby Fortemps Manor, who agrees with the inspector that the mammet is clearly a boy. Upon learning of the inquisition's interest in Gigi, the count suggests that Hildibrand adopt the mammet as a ward, and even offers to stand as witness. Fascinated and enchanted by the thought of becoming a father, the inspector readily agrees, and Cyr can only look on in horror as Gigi is formally granted the patronage of House Manderville. It would seem there is nothing more to be done...but Inquisitor Cyr is a man bound by duty, and he is not yet ready to leave the mammet and its caretakers to their own devices, even as they embark upon another tour of the city to stir Gigi's memories.","In an impressive display of ignorance, Hildibrand introduces the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine─the Ishgardian institution which Cyr so proudly serves─to Gigi as a manor of “House Durenmaeltempsarte.” The inquisitor is quick to correct the inspector, who good-humoredly overlooks the incident. In any event, the name matters little, belonging as it does to but one more location which means nothing to the amnesic mammet.","The Holy Stables prove no more familiar to Gigi than the Tribunal, even after he takes a good, long whiff of the horsebirds' natural musk. Cyr observes that Gigi may not be native to Ishgard, leading Hildibrand to propose that you all visit the Jeweled Crozier next, and Cyr to subsequently berate himself for aiding in the inspector's endeavors.","A despondent Gigi once more fails to recall his memories and mutters that there is no point to this exercise. In an effort to raise his adopted son's spirits, the inspector resorts to his trademark pose, sending a precariously placed vase crashing to the ground. To Cyr's horror, the stall's owner reveals that the vase was valued at one hundred and twenty-three million, five hundred and four thousand gil, having been owned by countless esteemed personages, including one Ishgardian duke. However, before she can demand recompense, Gigi restores the vase to its original form in an unexpected display of magical prowess.<br><br>The stunned inquisitor declares Gigi's accomplishment a miracle, unable to fully comprehend what he has just witnessed. Sensing an opportunity, the merchant promptly offers to purchase the mammet from the inspector, who is taken aback at the suggestion he sell his adopted son. But Gigi has had enough; he can no longer entertain the illusion that he is flesh and blood. In the face of the inspector's continued insistence that he is a Manderville, the mammet storms off, declaring that Hildibrand and Nashu are not his papa and mama, leaving the stunned pair to watch in silence.","\"Gigi is at a rebellious age,“ Hildibrand declares, confident that he can weather the storm and regain his beloved son's trust. The key, Nashu believes, is to find out what first convinced Gigi that he was a mammet─a suggestion which Cyr lacks the will to dispute."],"objectives":["Speak with Hildibrand outside Fortemps Manor.","Follow Gigi.","Accompany Gigi to the Holy Stables.","Accompany Gigi to the Jeweled Crozier.","Speak with Hildibrand."],"dialogue":[{"name":"CYR","text":"I pray this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">morn</span><span class=\"alternative\">day</span></span> finds you well, <span class=\"highlight\">Forename</span>─or at least better than it finds me. &lt;sigh&gt; It seems I have no choice but to seek out that inspector and convince him to surrender up his mammet to me."},{"name":"CYR","text":"'Twas unearthed under most suspicious circumstances, after all, and who can say what secrets─or heresy─it might hold. Therefore, the inquisition would conduct a thorough inspection, and if needs must, destroy it."},{"name":"CYR","text":"Given his affinity for the contraption, I fear the inspector may not be amenable to my request. Nevertheless, he must be made to see that it is in the interest of public safety. Would you be willing to help me persuade him?"},{"name":"CYR","text":"Fury be praised, at least you have seen reason. Let us pray he will as well."},{"name":"CYR","text":"I am given to understand that while the inspector and his assistant have been wandering all over the city with the mammet in tow, they often frequent the gazebo near Fortemps Manor. With any luck, they will be there now."},{"name":"GIGI","text":"To ThE vErY pInNaClE oF tHe HeAvEnS!"},{"name":"NASHUMHAKARACCA","text":"Isn't she adorable!?"},{"name":"HILDIBRAND","text":"Verily shall we scour all creation─from the deepest pit of the seven hells to the very pinnacle of the heavens─for the answers we seek! Every day shall be filled with grand adventures─the stuff of faerie tales and legends!"},{"name":"GIGI","text":"HuZzAh! A gRaNd AdVeNtUrE iN tHe DeEpEsT pIt Of ThE sEvEn HeLlS!"},{"name":"HILDIBRAND","text":"Just so! Such is the creed of Hildibrand, agent of enquiry, inspector extraordinaire!"},{"name":"HILDIBRAND","text":"Well posed, Gigi, well posed! I daresay you have the potential to be an exemplary inspector someday!"},{"name":"CYR","text":"Right, that's enough of that! By virtue of the authority vested in me by the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine, I hereby command you to surrender that mammet of suspected heretical origin into my custody."},{"name":"HILDIBRAND","text":"Why, hello there, <span class=\"highlight\">Forename</span>. And Inquisitor Cyr, ever the jester! Accusing poor Gigi of being a clockwork heretic when 'tis plain to see that he is merely a precocious young lad!"},{"name":"NASHUMHAKARACCA","text":"Oh, there you go again, confusing the poor girl! As if those big, beautiful, boxy eyes aren't the soul of femininity!"},{"name":"HILDIBRAND","text":"Nashu, please. Were you not witness to the magnificent display of Mandervillian masculinity mere moments ago?"},{"name":"NASHUMHAKARACCA","text":"That's 'cause you haven't taught her any better. She needs a proper role model to show her what's what!"},{"name":"EDMONT","text":"(-???-)<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? Inspector Cyr? What is all this commotion? We can hear you from the courtyard..."},{"name":"CYR","text":"Oh, Lord Edmont! My sincerest apologies for the disturbance. I am come to seize this mammet on behalf of the inquisition─a fact which I clearly explained to the inspector before you arrived."},{"name":"CYR","text":"At which point they set to bickering about the contraption's gender..."},{"name":"HILDIBRAND","text":"What say you, my lord? Do you think Gigi a boy or a girl?"},{"name":"EDMONT","text":"...'Tis clearly a strapping young lad, no?"},{"name":"CYR","text":"Fury take me, not you too! Has the whole world gone mad?"},{"name":"CYR","text":"Fine, fine! But even supposing that this Gigi is a “real boy,” you cannot deny that the circumstances of his discovery and <span class=\"emphasis\">miraculous resuscitation</span> were most unusual. He cannot be suffered to roam the city with impunity until the inquisition has determined he is not a threat!"},{"name":"EDMONT","text":"I beg your pardon? “Miraculous resuscitation”?"},{"name":"EDMONT","text":"I see... Then until such time as Gigi recovers his memory, mayhap it would be best if you adopted him as a ward of House Manderville. I will even stand as witness here and now, if you wish."},{"name":"EDMONT","text":"Doubtless the inquisition would think better of taking any action which might threaten the cordial relationship between our two houses."},{"name":"HILDIBRAND","text":"A-A-Adopt? Then that would make me...Gigi's <span class=\"emphasis\">father</span>?"},{"name":"HILDIBRAND","text":"Yes, yes, of course! I'll do it! I, Hildibrand, agent of enquiry, inspector extraordinaire, do hereby grant this child the patronage of House Manderville!"},{"name":"GIGI","text":"PaPa HiLdY! pApA hIlDy!"},{"name":"NASHUMHAKARACCA","text":"The inspector's finally become a father! &lt;sniffle&gt; It's...it's so beautiful!"},{"name":"EDMONT","text":"Quite. Ahem. Now that you need no longer fear the inquisition, you are free to show Gigi more of our fair city. Indeed, I strongly encourage you to do so. Mayhap, by the grace of the Fury, something will jog his memory."},{"name":"HILDIBRAND","text":"Thank you, Lord Edmont! I shall not forget this kindness! Come, my faithful assistant, my beloved son─we must away!"},{"name":"CYR","text":"O Halone, I would not presume to question Your grand design, but... Gah! Confound it all!"},{"name":"CYR","text":"Well! Mayhap I cannot detain the mammet, but I am still within my rights to observe the blasted thing..."},{"name":"EDMONT","text":"Lord Godbert will be pleased to hear that his son is as hale and healthy as ever. Not that I would ever presume to meddle on another father's behalf. And certainly not without consent."},{"name":"HILDIBRAND","text":"Judging by the size of their estate, they've wealth to rival House Manderville..."},{"name":"CYR","text":"Ack. How long must I stand around waiting for that mammet to do something passably heretical..."},{"name":"NASHUMHAKARACCA","text":"Cor, look at all them halberds! I've never seen such a well-armed building before!"},{"name":"GIGI","text":"HmMmMmM..."},{"name":"HILDIBRAND","text":"Come now, Gigi! Surely gazing upon this wondrous work of Ishgardian architecture stirs something within your soul? This grand manor of House Duren...er, House Duren...maeltempsarte."},{"name":"CYR","text":"Pray do not fill the boy─the <span class=\"emphasis\">mammet's</span> head with such nonsense. That is the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine. I should know─I work there."},{"name":"CYR","text":"Furthermore, I am quite certain that there is no “House Durenmaeltempsarte” and that it is rather a ludicrous portmanteau of the four High Houses, including that esteemed house which but recently stood as witness to your adoption."},{"name":"NASHUMHAKARACCA","text":"Well, Gigi? Do you remember anything?"},{"name":"GIGI","text":"No, NoThInG..."},{"name":"HILDIBRAND","text":"I say, rather than parading him before the grandiose, why not give him a taste of something more prosaic? Let us make our way to the Holy Stables that he might bask in the singular sights, sounds, and smells of Ishgard's famous chocobos!"},{"name":"HILDIBRAND","text":"Such noble creatures, chocobos. How many halcyon days did I pass in the saddle, racing across the windswept plains..."},{"name":"CYR","text":"Patience, patience... A watched heretic never sins..."},{"name":"NASHUMHAKARACCA","text":"So if I wanted hair that color, I'd have to eat plums, valfruits, and pineapples...but how many?"},{"name":"GIGI","text":"HmMmMmM..."},{"name":"HILDIBRAND","text":"Splendid specimens of horsebirdflesh, would you not agree? In the hands of a skilled jockey, any one of them could take first place at the Saucer."},{"name":"CYR","text":"These chocobos are the pride of the Ishgardian cavalry and any Temple Knight who dared exploit them for personal gain would answer to the Fury Herself."},{"name":"NASHUMHAKARACCA","text":"How about now, Gigi? Do you remember anything about Ishgard? Be sure to sniff the chocobos─it might help!"},{"name":"GIGI","text":"&lt;sniff&gt; &lt;sniff&gt; ...It DiDn'T."},{"name":"CYR","text":"You know, just because you found him in a Coerthan snowbank, it doesn't mean he hails from Ishgard."},{"name":"CYR","text":"Wait─am I now complicit in this farce? Fury forgive me..."},{"name":"HILDIBRAND","text":"...Which is why we ought to try taking him to the markets and exposing him to all manner of goods from across Eorzea! Excellent suggestion, Inquisitor!"},{"name":"KID02228","text":"But I want one! I want one! Buy me a chocobo! Pleeease, Father!"},{"name":"KID02228","text":"Father, that strange-looking thing is staring at us..."},{"name":"GIGI","text":"GIGI※GIGIGI★※!"},{"name":"GIGI","text":"...Am I tHaT sTrAnGe-LoOkInG?"},{"name":"HILDIBRAND","text":"These goods would fetch a high price in Ul'dah..."},{"name":"CYR","text":"Receive your orders, detain your heretic, meet your quota... Fury take me, it used to be so simple. Frightening on occasion, I grant you─what with my mentor's little episodes─but simple nonetheless."},{"name":"NASHUMHAKARACCA","text":"What if I picked one with my eyes closed...and gave it as a nameday gift to myself!? Oh, I wonder what I'd get me!"},{"name":"GIGI","text":"WhY bOtHeR. iT's No UsE..."},{"name":"HILDIBRAND","text":"Now, now, Gigi, you must not give in to despair so easily! Did I not promise you days filled with grand adventures and the eventual discovery of your mislaid memories? Spirits, Gigi, spirits!"},{"name":"HILDIBRAND","text":"My word, a vase flung to the ground with reckless abandon! Could this be the opening salvo of an indiscriminate campaign of vandalism?"},{"name":"CYR","text":"One waged by <span class=\"emphasis\">your</span> wild gesticulations, perhaps. At least look before you strike a pose! The gods only know how much that vase cost..."},{"name":"FRINE","text":"One hundred and twenty-three million, five hundred and four thousand gil, at last assessment. 'Twas over seven hundred years old and graced the homes of a dozen archbishops, eight counts, two lord commanders and one <span class=\"emphasis\">duke</span>."},{"name":"CYR","text":"&lt;cough&gt; <span class=\"emphasis\">One hundred million gil</span>!? &lt;wheeze&gt;"},{"name":"CYR","text":"O Halone, why have You forsaken me...?"},{"name":"NASHUMHAKARACCA","text":"Well, would you look at that!"},{"name":"CYR","text":"It's...it's a miracle! Nay─the divine intervention of the Fury Herself!"},{"name":"GIGI","text":"DiD i Do ThAt...?"},{"name":"HILDIBRAND","text":"Gigi, my boy, that was marvelous! You're a born artisan, just like Father!"},{"name":"GIGI","text":"PaPa HiLdY's PaPa?"},{"name":"NASHUMHAKARACCA","text":"Your grandpapa Godbert─the man who woke you with a few gentle taps to the noggin. You wouldn't believe what else he can do with that hammer of his! Why, some folk say he wields the very powers of life and death!"},{"name":"NASHUMHAKARACCA","text":"Once he and the missus come back from their tour of the western highlands, I'm sure they'd love to see that trick of yours."},{"name":"CYR","text":"Do not demean this mammet's power as a mere parlor trick! We just witnessed a <span class=\"emphasis\">miracle</span>, and I demand that you all acknowledge it!"},{"name":"FRINE","text":"Sir! I-I say, sir! One hundred million gil for the mammet! Nay, one hundred million gil <span class=\"emphasis\">and</span> the duke's priceless vase!"},{"name":"GIGI","text":"ThIs...MaMmEt..."},{"name":"HILDIBRAND","text":"My word, is this what passes for trade in Ishgard? Gigi is my flesh and blood! I will not <span class=\"emphasis\">sell</span> him at any price!"},{"name":"GIGI","text":"PlEaSe, PaPa HiLdY, nO mOrE. i KnOw YoU mEaN wElL, bUt We CaN dEnY tHe TrUtH nO lOnGeR. I aM a MaMmEt."},{"name":"HILDIBRAND","text":"Gigi, whatever has gotten into you? You are my son! You are a Manderville man!"},{"name":"NASHUMHAKARACCA","text":"Listen to your papa, Gigi! You're a Manderville girl, through and through!"},{"name":"GIGI","text":"StOp It, BoTh Of YoU! yOu'Re NoT mY pApA oR mY mAmA!"},{"name":"CYR","text":"Ahhh, the unmistakable scent of─well, perhaps not heresy exactly... Regardless─that mammet's power cannot be allowed to fall into the wrong hands!"},{"name":"NASHUMHAKARACCA","text":"Oh, children do say the most hurtful things..."},{"name":"HILDIBRAND","text":"Well, it is only to be expected. Gigi is at a rebellious age... Strange as it may sound, I too tested my parents' patience, and that on more than one occasion! But if they could weather the storm, then so can I!"},{"name":"NASHUMHAKARACCA","text":"I say we find out what's got him thinking he's a mammet."},{"name":"CYR","text":"But he <span class=\"emphasis\">is</span> a mammet! How can you not─ Oh, never mind."}],"reward":{"gil":778,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67763]},"next":[67765]},"partials":[{"type":"npc","id":"1016619","obj":{"i":1016619,"n":"Cyr","l":2300,"q":6}},{"type":"npc","id":"1016608","obj":{"i":1016608,"n":"Hildibrand","l":2301,"q":2}},{"type":"npc","id":"1016600","obj":{"i":1016600,"n":"Hildibrand","l":2301,"q":1}},{"type":"npc","id":"1016601","obj":{"i":1016601,"n":"Nashu Mhakaracca","l":2301,"q":2}},{"type":"npc","id":"1016602","obj":{"i":1016602,"n":"Gigi","l":2301,"q":1}},{"type":"npc","id":"1016603","obj":{"i":1016603,"n":"Cyr","l":2301,"q":1}},{"type":"npc","id":"1016607","obj":{"i":1016607,"n":"Gigi","l":2301,"q":1}},{"type":"npc","id":"1016609","obj":{"i":1016609,"n":"Nashu Mhakaracca","l":2301,"q":2}},{"type":"npc","id":"1016610","obj":{"i":1016610,"n":"Cyr","l":2301,"q":2}},{"type":"npc","id":"1016614","obj":{"i":1016614,"n":"Hildibrand","l":2301,"q":1}},{"type":"npc","id":"1016616","obj":{"i":1016616,"n":"Nashu Mhakaracca","l":2301,"q":1}},{"type":"npc","id":"1017128","obj":{"i":1017128,"n":"Cyr","l":2301,"q":1}},{"type":"npc","id":"1017129","obj":{"i":1017129,"n":"Hildibrand","l":2301,"q":1}},{"type":"npc","id":"1017130","obj":{"i":1017130,"n":"Nashu Mhakaracca","l":2301,"q":1}},{"type":"npc","id":"1017131","obj":{"i":1017131,"n":"Gigi","l":2301,"q":1}},{"type":"npc","id":"1017136","obj":{"i":1017136,"n":"Cyr","l":2300,"q":1}},{"type":"npc","id":"1017275","obj":{"i":1017275,"n":"Hildibrand","l":2300,"q":1}},{"type":"npc","id":"1017276","obj":{"i":1017276,"n":"Nashu Mhakaracca","l":2300,"q":1}},{"type":"npc","id":"1017278","obj":{"i":1017278,"n":"Gigi","l":2300,"q":1}},{"type":"quest","id":"67763","obj":{"i":67763,"n":"Don't Call It a Comeback","g":69,"l":"Coerthas Western Highlands","s":31,"f":1}},{"type":"quest","id":"67765","obj":{"i":67765,"n":"The Measure of a Mammet","g":69,"l":"Ishgard","s":33,"f":1}}]}