{"quest":{"name":"This War of Ours","location":"Matoya's Cave","id":67769,"patch":3.2,"sort":11,"eventIcon":71201,"issuer":1016560,"target":1016564,"involved":[1011223,1012163,1016565,1016566,1016567,1016568,1016569,1016570],"genre":4,"journal":["Alphinaud has reached a decision.","Although Alphinaud intends to inform Tataru and Urianger of Minfilia's fate, he asks that you share with no one else what you have learned─especially F'lhaminn. He then states that you have more than earned a rest, only to suddenly recall that he but recently received a missive from Ser Aymeric. It would seem that the lord commander is planning a ceremony of some sort and would like you to attend. However, he neglected to provide details, and so a visit to the Congregation appears to be in order.","Never one to let an opportunity pass him by, Ser Aymeric wishes to take advantage of the recent shift in public sentiment towards the Dravanians to reestablish relations with their neighbors. To that end, he has begun making formal arrangements for a peace conference in Falcon's Nest, to be attended by Vidofnir...and by you, if possible. He admits that your presence would be more than a symbolic gesture, as he fears that Nidhogg and his followers may attempt to disrupt the proceedings. Moved by his passion, you agree, and prepare to leave for Falcon's Nest and speak with Lucia. In that moment, however, Ser Aymeric calls out, asking that you share a drink once the conference has concluded─doubtless a gesture of gratitude and camaraderie. Yet, in that moment, a thought unbidden of a woman in white floating before a great crystal gives you pause...and though you accept his invitation, it is with a heavy heart.","Most are blessed with precious few chances to choose their course in life, and Lucia is no different. Dispatched to a foreign nation as a spy, it was her duty to infiltrate Ishgardian society for her masters' ends. In the end, however, she chose a different path─to pledge herself to another nation's cause, and to join in their war. As she watches the masons of Falcon's Nest put the finishing touches on a relief, she reflects on what that war's resolution could mean for her...and for the country whose faith she has come to share."],"objectives":["Speak with Aymeric at the Congregation of Our Knights Most Heavenly.","Speak with Lucia in Falcon's Nest."],"dialogue":[{"name":"ALPHINAUD","text":"I must ask that you not breathe a word of this to any of the others at the Rising Stones─especially F'lhaminn."},{"name":"ALPHINAUD","text":"I will brief Tataru on what we have learned, as well as Urianger. He may have insight into what the Word told us."},{"name":"ALPHINAUD","text":"As for you, <span class=\"highlight\">Forename</span>...after all you have done, I would say you have earned a rest."},{"name":"ALPHINAUD","text":"Ah, but speaking of well-earned rewards─I received a missive from Ser Aymeric while you were away. 'Twould seem he is planning a ceremony of some sort, and would like you to attend."},{"name":"ALPHINAUD","text":"He did not divulge the details, preferring instead to explain in person. Mayhap you should pay him a visit?"},{"name":"ALPHINAUD","text":"Pray take some time to rest. I think I may as well. Oh, and should you decide to visit Ser Aymeric at the Congregation, do be sure to give him my regards."},{"name":"HANDELOUP","text":"The first commander is tending to the preparations at Falcon's Nest. If all goes to plan, this will mark a new day for Ishgard!"},{"name":"TEMPLEKIGHTGATE","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. The lord commander left instructions that you were to be shown inside."},{"name":"Q1","text":"Proceed to the Seat of the Lord Commander?"},{"name":"ARTOIREL","text":"Well met, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Have you spoken with the first commander yet?"},{"name":"EMMANELLAIN","text":"Oh! Fancy running into you here, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Gave me a bit of a shock. We'll talk later, yes?"},{"name":"HONOROIT","text":"(Thank the Fury you are here, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I am not sure what my lord intends...and that troubles me far more than when I do.)"},{"name":"CITIZENA02233","text":"By the Fury, would you look at the size of it! Got any idea what it'll look like when they've finished?"},{"name":"CITIZENB02233","text":"Peace between dragon and man. I would have scoffed at it not long ago but now, after seeing that dragon pluck that girl from the sky, well... If this is to be the moment, then my wife and I would witness it firsthand."},{"name":"CITIZENC02233","text":"I don't envy them poor sods what have to work atop that scaffolding, exposed to the wind and all. Aye, it's for a good cause, but better them than me!"},{"name":"LUCIA","text":"The lord commander said you would come, <span class=\"highlight\">Forename</span>."},{"name":"LUCIA","text":"As you can see, preparations for the conference are proceeding apace."},{"name":"LUCIA","text":"Mark well the curtain above."},{"name":"LUCIA","text":"It conceals a relief that will be unveiled during the conference. The masons labor day and night to see it finished on schedule."},{"name":"LUCIA","text":"Ser Aymeric wanted a symbol which would endure long after this conference is concluded. I think he will be pleased with the result."},{"name":"LUCIA","text":"'Twas not my war, but I made it mine...and to see it draw closer to a resolution fills me with a strange hope."},{"name":"LUCIA","text":"His faith is infectious, is it not? His certainty that we can be better than we are..."},{"name":"LUCIA","text":"Forgive me, I am rambling. You must be tired from your journey. Go, rest. I will not keep you."}],"reward":{"gil":1194,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67768]},"next":[67770]},"partials":[{"type":"npc","id":"1016560","obj":{"i":1016560,"n":"Alphinaud","l":2036,"q":2}},{"type":"npc","id":"1016564","obj":{"i":1016564,"n":"Lucia","l":2200,"q":2}},{"type":"npc","id":"1011223","obj":{"i":1011223,"n":"Temple Knight Guard","l":2300,"q":7}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1016565","obj":{"i":1016565,"n":"Artoirel","l":2200,"q":3}},{"type":"npc","id":"1016566","obj":{"i":1016566,"n":"Emmanellain","l":2200,"q":4}},{"type":"npc","id":"1016567","obj":{"i":1016567,"n":"Honoroit","l":2200,"q":4}},{"type":"npc","id":"1016568","obj":{"i":1016568,"n":"Lowborn Youth","l":2200,"q":6}},{"type":"npc","id":"1016569","obj":{"i":1016569,"n":"Highborn Merchant","l":2200,"q":6}},{"type":"npc","id":"1016570","obj":{"i":1016570,"n":"Spirited Stonecutter","l":2200,"q":6}},{"type":"quest","id":"67768","obj":{"i":67768,"n":"The Word of the Mother","g":4,"l":"The Rising Stones","s":10}},{"type":"quest","id":"67770","obj":{"i":67770,"n":"Staunch Conviction","g":4,"l":"Coerthas Western Highlands","s":12}}]}