{"quest":{"name":"Once More, a Favor","location":"Coerthas Western Highlands","id":67771,"patch":3.2,"sort":13,"eventIcon":71201,"issuer":1016566,"target":1016566,"involved":[1016077,1016567,1016568,1016569,1016570,1016573,1016574],"genre":4,"journal":["Emmanellain is less than his usual effervescent self.","Old habits are hard to break, as Emmanellain soon proves. Upon realizing that his brother asked you to look after him, the young lord proceeds to press you into duty, bidding you patrol several locations outside Falcon's Nest where wolves have been sighted. Before you can voice your opinion on the matter, Emmanellain vanishes, leaving you with little choice but to carry out the menial task.","As expected, there were wolves, and as expected, they were no match for you. With luck, Emmanellain will have returned to his post by now.","After congratulating you on a job well done, Emmanellain proudly announces that he has completed his rounds of Falcon's Nest and that yes, all is indeed well. In passing, he mentions that he spoke with Thancred─or the “grizzled fellow” who “made that arsonist confess,” as he puts it─while you were away, and that he employed the same devious techniques on him that he used to press you into wolf-slaying duty. With a sigh, you turn your attention to the wastes outside Falcon's Nest once more.","You find Thancred, as well as two heretics he seemingly saved from a ravenous wolf pack. Together, you return to Falcon's Nest, eager to see what other thrilling tasks Lord Emmanellain has in store.","Emmanellain has only praise for you and Thancred. “Gallant heroes” by whose “selfless sacrifice” the safety of the conference's guests has been guaranteed. Flattering as his words are, you cannot help but sense a mocking edge, and you suspect Thancred does as well, given the grinding of his teeth."],"objectives":["Stand watch for wolves outside Falcon's Nest.","Report to Emmanellain.","Search for Thancred.","Speak with Emmanellain."],"dialogue":[{"name":"HONOROIT","text":"Hm? Was that Lord Artoirel leaving with the first commander just now?"},{"name":"CITIZENA02233","text":"Everything is going to be all right. I know it will."},{"name":"CITIZENB02233","text":"What sort of trade opportunities might there be? I've never thought about it before, but do the Dravanians even have markets?"},{"name":"CITIZENC02233","text":"Do you think we'll have to let them come and go as they please? In the capital, I mean. Our roads weren't exactly designed for Dravanians..."},{"name":"EMMANELLAIN","text":"I'm rather busy at the moment, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Guarding this tavern, as it were."},{"name":"EMMANELLAIN","text":"Oh, I see now. Artoirel thought I might be derelict in my duties, eh? The nerve of my brother to question my dedication!"},{"name":"EMMANELLAIN","text":"...But since you are here, mayhap I can put you to proper use. The wasteland beyond the walls must be kept safe for travelers, yet I have been forbidden from leaving Falcon's Nest."},{"name":"EMMANELLAIN","text":"It wouldn't do for our esteemed guests to be devoured by wolves, oh no. Yet that is precisely what will happen if we do not cull the roaming packs!"},{"name":"EMMANELLAIN","text":"Your map, if I may. Right...there, those are the points our scouts marked for patrol. I'll leave you to it, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Come, Honoroit─I must return to my rounds!"},{"name":"HONOROIT","text":"Oh dear...do be careful, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>."},{"name":"HONOROIT","text":"Terrible imposition though it was, I am relieved that my lord did not think to tend to the wolves by himself."},{"name":"EMMANELLAIN","text":"<span class=\"highlight\">Forename Surname</span>, Wolves' Bane! It pleases me to inform you that I have completed my rounds, and that all is well in Falcon's Nest."},{"name":"EMMANELLAIN","text":"Oh, and there was a grizzled fellow looking for you. You know, the one who made that arsonist confess. Clever, that."},{"name":"EMMANELLAIN","text":"Thancred, was it? He was asking after you."},{"name":"EMMANELLAIN","text":"Anyway, once I noticed the garish weapons he was sporting, I deemed it a waste to leave him be. I dispatched him to an area I neglected to mark on your map...yes, this one. If you hurry, he might still be there."},{"name":"EMMANELLAIN","text":"I suppose we could simply wait here for your friend to return. But, if you're feeling impatient, you are free to go and look for him."},{"name":"HERETIC02235","text":"Stay your weapons! We come in peace!"},{"name":"HERETIC02235","text":"Lady Iceheart told us tales of Vidofnir. If she would trust in Ser Aymeric, then we too would hear what he has to say. But the wolves caught us unawares, and were it not for this man, we would have surely died."},{"name":"THANCRED","text":"Fancy meeting you here, <span class=\"highlight\">Forename</span>."},{"name":"THANCRED","text":"'Twas fortunate I came when I did. These two would not have fared well against the wolves on their own."},{"name":"THANCRED","text":"The young lord wasted no time taking advantage of you, did he? And me, I suppose."},{"name":"THANCRED","text":"Let us return to Falcon's Nest, then, and see what other thrilling tasks he may have for us."},{"name":"THANCRED","text":"(It's always the younger one. Every time, without fail.)"},{"name":"HONOROIT","text":"How wonderful, you found Master Thancred! As ever, I could not help but fear the worst."},{"name":"EMMANELLAIN","text":"And there they are, a pair of gallant heroes if I ever saw them. Comrades-in-arms, reunited at last."},{"name":"EMMANELLAIN","text":"By your selfless sacrifice have you guaranteed the safety of our many guests. On behalf of Ishgard, I thank you both."},{"name":"EMMANELLAIN","text":"And with that, there is naught left to do but to enjoy our well-earned respite."}],"reward":{"gil":810,"items":[{"id":13637,"one":1},{"id":13638,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67770]},"next":[67772]},"partials":[{"type":"npc","id":"1016566","obj":{"i":1016566,"n":"Emmanellain","l":2200,"q":4}},{"type":"npc","id":"1016077","obj":{"i":1016077,"n":"Thancred","l":2200,"q":3}},{"type":"npc","id":"1016567","obj":{"i":1016567,"n":"Honoroit","l":2200,"q":4}},{"type":"npc","id":"1016568","obj":{"i":1016568,"n":"Lowborn Youth","l":2200,"q":6}},{"type":"npc","id":"1016569","obj":{"i":1016569,"n":"Highborn Merchant","l":2200,"q":6}},{"type":"npc","id":"1016570","obj":{"i":1016570,"n":"Spirited Stonecutter","l":2200,"q":6}},{"type":"npc","id":"1016573","obj":{"i":1016573,"n":"Thancred","l":2200,"q":1}},{"type":"npc","id":"1016574","obj":{"i":1016574,"n":"Hopeful Heretic","l":2200,"q":1}},{"type":"item","id":"13637","obj":{"i":13637,"n":"Max-Potion","l":150,"c":20601,"t":44}},{"type":"item","id":"13638","obj":{"i":13638,"n":"Max-Ether","l":150,"c":20621,"t":44}},{"type":"quest","id":"67770","obj":{"i":67770,"n":"Staunch Conviction","g":4,"l":"Coerthas Western Highlands","s":12}},{"type":"quest","id":"67772","obj":{"i":67772,"n":"For Those We Have Lost","g":4,"l":"Coerthas Western Highlands","s":14}}]}