{"quest":{"name":"Causes and Costs","location":"Coerthas Western Highlands","id":67777,"patch":3.2,"sort":19,"icon":100529,"eventIcon":71201,"issuer":1016590,"target":1013227,"involved":[1012580,1016591],"genre":4,"journal":["Alphinaud knows at last what he must do.","Alphinaud restates that there are things he wishes to say to you─not to the Warrior of Light, or a fellow Scion, but to you, <span class=\"highlight\">Forename</span>, his friend. He proposes that you travel to Camp Dragonhead, to the intercessory Lord Haurchefant set aside for you long ago, that you might converse in private.","To fight and die for a noble cause is a notion many find romantic, and Alphinaud was no exception. Are not truth, justice, and freedom worth fighting for, after all? Yet having borne witness to the costs of pursuing these many causes, having seen at what price each victory is bought, Alphinaud has had enough. Even if Ser Aymeric and all of Ishgard are willing to sacrifice Estinien to slay Nidhogg, he is not. Though he may fail, Alphinaud is resolved to try to save the dragoon. Touched by your young friend's conviction, you find yourself thinking back to those you have lost. Moenbryda, Wilred, Lord Haurchefant, Ysayle, Minfilia...and one who may yet be saved.","Alphinaud thanks you for allowing him to unburden himself. Though he knows that not all the Scions may agree with his chosen course at first, he has faith that they can be won over in due time. For the present, he would return to Fortemps Manor and, with Tataru's aid, turn his thoughts to more uplifting subjects.","Ever the optimist, Tataru seems positive about your prospects, still believing that Yda, Papalymo, and even Minfilia might one day rejoin the Scions. Reminded of the Antecedent's plight, Alphinaud ponders what could have motivated her to go to such lengths to deliver so curious a message. Though it may be some time before the whole truth is known to you, he seems content to wait and turn his mind to solving the problems of the present. The Scions always find a way."],"objectives":["Wait for Alphinaud in the intercessory in Camp Dragonhead.","Speak with Alphinaud.","Speak with Alphinaud outside Fortemps Manor."],"dialogue":[{"name":"ALPHINAUD","text":"When I said I wished to speak with you after the conference, I confess I envisaged rather happier circumstances. If anything, however, this latest tragedy makes the need more pressing. There are things I must say."},{"name":"ALPHINAUD","text":"Not to the Warrior of Light, or even my fellow Scion, but...to you, <span class=\"highlight\">Forename</span>. My friend."},{"name":"ALPHINAUD","text":"But not here, no..."},{"name":"ALPHINAUD","text":"Ah, but of course. The intercessory in Camp Dragonhead is still open to us. Let us go there."},{"name":"ALPHINAUD","text":"Thank you, <span class=\"highlight\">Forename</span>. It is unfair of me to unburden myself in this manner, time after time, but I am glad that you permit me nonetheless. You are my true friend and ally."},{"name":"ALPHINAUD","text":"Though not all of our fellow Scions will support our stance on Estinien, I have faith that we will win them over in due course. Such is the infectious power of hope."},{"name":"ALPHINAUD","text":"Right. That is quite enough solemn introspection for one <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>. I think we would both benefit from some time in the company of Tataru. She stays for us at Fortemps Manor. Let us not keep her waiting any longer."},{"name":"TATARU","text":"(Well! Alphinaud certainly seems to be in better spirits. Do we have you to thank for this?)"},{"name":"ALPHINAUD","text":"Yet again we walk an all-too-familiar path. I am reminded of when we first came to this manor."},{"name":"ALPHINAUD","text":"Lost and uncertain, we were granted succor in our hour of need. We were saved─and now it is our turn to return the favor!"},{"name":"TATARU","text":"Hear, hear! Let no one say that the Scions do not repay their debts!"},{"name":"TATARU","text":"After all, what kind of people would we be if we forsook our friends? If we stopped looking for Yda and Papalymo, or if we gave up hope of bringing Minfilia back?"},{"name":"ALPHINAUD","text":"Though she knew it would cost her dearly, Minfilia reached out to us to deliver a message. She believed it was imperative that we understand the true nature of this star─of the rift between Zodiark and Hydaelyn, and of the Ascians' aspirations."},{"name":"ALPHINAUD","text":"But for all that has been revealed, I cannot shake the suspicion that there is much we have yet to learn..."},{"name":"ALPHINAUD","text":"In any event, I think it time we step back from the fray and carefully consider our next course of action. It will not be easy to turn this tragedy to triumph, but we will find a way. We will. We will."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Battle Stance</span>!"},{"name":"PAPALYMO","text":"Caution, Yda─that is all I ask! Do not be so eager to place your faith in them. Not until we know more."}],"reward":{"gil":1200,"emote":"Battle Stance","items":[{"id":20601,"one":1},{"id":20602,"one":1},{"id":20603,"one":1},{"id":20605,"one":1},{"num":3,"id":5826,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67776]},"next":[67778]},"partials":[{"type":"npc","id":"1016590","obj":{"i":1016590,"n":"Alphinaud","l":2200,"q":2}},{"type":"npc","id":"1013227","obj":{"i":1013227,"n":"Alphinaud","l":2301,"q":4}},{"type":"npc","id":"1012580","obj":{"i":1012580,"n":"Tataru","l":2301,"q":5}},{"type":"npc","id":"1016591","obj":{"i":1016591,"n":"Alphinaud","l":1429,"q":1}},{"type":"item","id":"20601","obj":{"i":20601,"n":"Hellfire Armor of Fending Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"20602","obj":{"i":20602,"n":"Slipstream Armor of Maiming Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"20603","obj":{"i":20603,"n":"Hellfire Armor of Striking Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"20605","obj":{"i":20605,"n":"Torrent Attire of Scouting Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"67776","obj":{"i":67776,"n":"For Those We Can Yet Save","g":4,"l":"Coerthas Central Highlands","s":18}},{"type":"quest","id":"67778","obj":{"i":67778,"n":"The Man Within","g":4,"l":"Ishgard","s":20}}]}