{"quest":{"name":"Choices","location":"Coerthas Western Highlands","id":67774,"patch":3.2,"sort":16,"eventIcon":71201,"issuer":1016579,"target":1016583,"involved":[1011223,1012251,1012252,1012253,1013167,1013183,1015978,1016024,1016069,1016070,1016584,1016585,1016595],"genre":4,"journal":["Thancred has lost all patience with Lord Emmanellain.","Thancred, unwilling to wait for Lord Emmanellain to gather himself, declares that you and he have more important matters to attend to in Ishgard before taking his leave. Indeed, he is correct, for Ser Aymeric is still waiting for you to deliver Lucia's report in her stead.","Change, however well intentioned, is often met with resistance. With resignation and pride both, Ser Aymeric admits that Ishgard is a nation built on centuries of warfare. To pursue peace in denial of this history is a doomed venture; rather, the people must be encouraged to embrace their identity, and take pride in one another's achievements, that they might be moved to common purpose. Happily, they will not want for suitable encouragement. The other members of the Eorzean Alliance have recently proposed joint military exercises, which Ser Aymeric believes could be presented as a “grand melee” to the public. Should Ishgard's forces triumph over those of the other city–states, it would doubtless do much to restore the nation's morale. Lord Edmont acknowledges that there is merit to the lord commander's plan, and his only request is that his younger son take part in the melee, that he might make amends for his mistakes in Falcon's Nest. Though Ser Aymeric agrees in principle, he remains to be convinced that Emmanellain's wishes are in alignment with those of his lord father.","Thancred is amused by the suggestion of an Ishgardian grand melee, wondering aloud what part you will be expected to play in the affair─and whether or not you will feel moved to oblige. As Ser Aymeric's grand scheme calls for a diverse force of Ishgardians to take the field, he departs to seek Hilda's opinion on the subject, leaving you to speak with Lucia alone.","As you detail Ser Aymeric's plan, Lucia cannot help but let her reservations show. Doubtless, as a Garlean citizen, she bore witness to similar spectacles intended to rally the people to the imperial cause─for weal or for woe. Nevertheless, out of loyalty to Ser Aymeric, she sets about selecting candidates from both the Temple Knights and the watch, preparing a list of the latter to be delivered to Hilda.","Hilda accepts the first commander's suggestions with grace, observing that she has an eye for talent. The watch successfully recruited, Thancred's thoughts turn, rather grudgingly, to the task of finding Lord Emmanellain. He suggests you try searching for him in the Pillars.","Born into privilege, Lord Emmanellain has never known true freedom. Like his brothers, his path in life was decided from birth. Yet as the old order crumbles and many are forced to choose a new path, he finds himself bewildered and lost. Terrified of making the wrong choice, he has let his father and brother order him about. To refrain from choosing is nevertheless a choice, however, and with regret he now sees what his indecision has wrought. Though his father may have had good reason to volunteer him for the melee, he cannot simply accept his command, and resolves to speak with Ser Aymeric himself, that for once he might make his own decision.","What drives a man to fight against all odds, against all opposition, and pursue a path that the world would deny him? In Ser Aymeric, Lord Emmanellain sees a man with unwavering conviction and faith, possessed of an almost supernatural strength. So inspired, he begs leave to participate in the grand melee, with a humility so unexpected that even Lord Edmont cannot contain his surprise. Ser Aymeric accepts, and the Ishgardian force is complete, save for a singular individual whom the lord commander would personally invite to join the fray: you. After a moment's introspection, you agree to fight for Ishgard, and a jubilant Ser Aymeric declares that you shall give the people a spectacle for the ages.","Thancred cannot help pointing out that your involvement in the melee could be considered unfair─you being the Warrior of Light. He confesses, however, that Ser Aymeric's honesty inspired even him to briefly contemplate joining the cause─though he quickly clarifies that it would not be his place to do so."],"objectives":["Speak with Aymeric at the Congregation of Our Knights Most Heavenly.","Speak with Thancred.","Speak with Lucia.","Deliver the letter to Hilda.","Search for Emmanellain in the Pillars.","Speak with Aymeric at the Congregation of Our Knights Most Heavenly.","Speak with Thancred."],"dialogue":[{"name":"LUCIA","text":"I will return to the capital as soon as I am able. Go, there is no need for you to remain."},{"name":"ARTOIREL","text":"I heard what happened. You need not wait for Emmanellain and Honoroit."},{"name":"THANCRED","text":"I have no desire to wait for the lordling to emerge from his puddle of self-pity. We have important matters to attend to in Ishgard."},{"name":"EDMONT","text":"We received troubling reports from Falcon's Nest. What befell you there?"},{"name":"TEMPLEKIGHTGATE","text":"You are expected, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Pray proceed."},{"name":"Q1","text":"Proceed to the Seat of the Lord Commander?"},{"name":"AYMERIC","text":"Word of the demonstration and its resolution outstripped you, <span class=\"highlight\">Forename</span>. Every man, woman, and child of Ishgard has heard the tale."},{"name":"EDMONT","text":"'Tis rumored that my youngest's lack of judgment was to blame. Of course...such stories are prone to exaggeration. What exactly came to pass?"},{"name":"EDMONT","text":"...I see. So that is the truth of it."},{"name":"EDMONT","text":"Regardless of his intent, the result is undeniable. He has furthered the cause of these misguided few who cannot let go of the past."},{"name":"EDMONT","text":"In an instant, the delicate peace we were poised to forge is once more beyond us."},{"name":"AYMERIC","text":"To dwell so deeply on the war and the vengeance it begets, only for that too to be taken away─is it any wonder that they were left bereft?"},{"name":"AYMERIC","text":"For what was this sacrifice? Have we naught to show for our suffering? I thought peace a sufficient salve, but mayhap I was mistaken."},{"name":"AYMERIC","text":"We are warriors, Lord Edmont, and ours is a nation built on centuries of warfare. Right or wrong, this is who we are, and we deny it at our peril."},{"name":"AYMERIC","text":"To hold on to the past, without being beholden to it... Aye, we must needs find a way to honor the sacrifice of our forefathers without glorying in their excesses."},{"name":"EDMONT","text":"A difficult path, to be sure. We dare not deny the scars which mar our nation's soul, lest we spur other disillusioned souls to retrace them..."},{"name":"EDMONT","text":"...But, as you say, we dare not revel in past glories either, for they are tainted all."},{"name":"EDMONT","text":"A clear, unambiguous enemy, and an undeniably righteous cause... 'Tis a bitter reflection, but lies though they were, they did long serve to unite us."},{"name":"AYMERIC","text":"No truth will ever serve as well, I fear. Yet...we are not without options."},{"name":"AYMERIC","text":"At our last meeting, a proposal was tabled by the other members of the Eorzean Alliance for joint military exercises─to strengthen the ties between our nations, and test our readiness to meet with a common threat."},{"name":"AYMERIC","text":"I had thought to delay these exercises until after the peace conference, but mayhap a grand melee would be just the thing to lift our beleaguered spirits."},{"name":"AYMERIC","text":"Better still, an occasion for the Temple Knights and the watch to take the field as allies─a unified Ishgardian force filled with men and women from all walks of life, which would stand against a coalition of the allied nations' finest!"},{"name":"AYMERIC","text":"Hosted by Ishgard, in the shadow of the Gates of Judgement! A victory under such circumstances would serve as a reaffirmation─nay, a declaration to all and sundry that we are as strong and united as ever!"},{"name":"EDMONT","text":"Such a victory would do much to fan the flames of patriotism, it is true. But if we should be defeated...? Though...even to hold our own against the cream of three nations might be presented as a triumph..."},{"name":"EDMONT","text":"Very well. You may count on my support, for what little it is worth. However, I have a request: I would have my son Emmanellain take part in the grand melee."},{"name":"EDMONT","text":"By his deeds has he brought shame upon Ishgard, and so by his deeds I would have him bring our nation honor."},{"name":"AYMERIC","text":"...As you wish, my lord. If that is <span class=\"emphasis\">his</span> desire, then it shall be so."},{"name":"AYMERIC","text":"Now then, we have no time to lose. <span class=\"highlight\">Forename</span>, would you be so kind as to deliver my instructions to Lucia?"},{"name":"AYMERIC","text":"I shall write to the Alliance leaders at once and begin making arrangements for the grand melee."},{"name":"EDMONT","text":"Should you chance to see my son, pray inform him of his duty."},{"name":"EDMONT","text":"If he has not already returned, he will soon enough─making every effort to avoid me."},{"name":"AYMERIC","text":"Pray excuse me, <span class=\"highlight\">Forename</span>. I have missives to write."},{"name":"EDMONT","text":"&lt;sigh&gt; I know my son. He will do his utmost to avoid me. See that he does not avoid you."},{"name":"LUCIA","text":"Forgive me, <span class=\"highlight\">Forename</span>. I arrived but a moment ago, and must needs unpack my things. We will speak anon."},{"name":"THANCRED","text":"So that is their solution. A “grand melee” to unite the people..."},{"name":"THANCRED","text":"And what part would they have <span class=\"emphasis\">you</span> play in this affair, I wonder. You, whom they have taken into their confidence, upon whom they have come so <span class=\"emphasis\">heavily</span> to rely."},{"name":"THANCRED","text":"And will you oblige them, when the proposition is made? Will you stand for Ishgard once more?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We have come this far, have we not?"},{"name":"A2","text":"I will stand for my friends and comrades, not a nation."},{"name":"A3","text":"It is getting to be a bit much, isn't it..."},{"name":"THANCRED","text":"Well, when you put it like that, I suppose it <span class=\"emphasis\">would</span> be a shame not to see it through to the bitter end."},{"name":"THANCRED","text":"You say that, and yet here you are. Here <span class=\"emphasis\">we</span> are. This is, after all, the life we chose."},{"name":"THANCRED","text":"In any event, let us not forget that the Ascians sought to profit from this war. To put an end to it is to put an end to their plot, and that, my friend, is ever a worthy cause."},{"name":"THANCRED","text":"A poor choice of words. For friends tried and true, then. The living and the lost."},{"name":"THANCRED","text":"So, for this grand melee of his, Ser Aymeric wishes to field a force comprising both his Temple Knights and Hilda's watch, yes? I can only imagine what she will have to say about that."},{"name":"THANCRED","text":"In fact, curiosity compels me to go and see for myself."},{"name":"THANCRED","text":"Hm? I thought you had something to discuss with the first commander?"},{"name":"SYMME","text":"Huzzah! We've been spoiling for a fight! We won't let Ser Aymeric down, you'll see!"},{"name":"EUDESTAND","text":"(Bloody fool doesn't realize he'll have to sit this one out. If all the watch ran off with Ser Aymeric to play soldier, who'd be left to keep an eye on things here?)"},{"name":"HILDA","text":"...Because of course he had to deliver the news in person, eh?"},{"name":"LUCIA","text":"Well met, <span class=\"highlight\">Forename</span>. Have you spoken with Ser Aymeric?"},{"name":"LUCIA","text":"...I was aware of the Alliance's request. So─Ser Aymeric would turn these exercises into a spectacle for the masses."},{"name":"LUCIA","text":"It is not that I doubt the efficacy of such a plan. Indeed, I know its effectiveness only too well, having witnessed it firsthand..."},{"name":"LUCIA","text":"Nevertheless, he has not once given me reason to doubt his intentions─and these are desperate times indeed."},{"name":"LUCIA","text":"I will select knights for the event forthwith. As for the watch─"},{"name":"LUCIA","text":"...Did he now? How considerate of Master Thancred to seek out our young watch commander of his own volition."},{"name":"LUCIA","text":"Alas, he acted prematurely. Pray deliver this list of watch candidates to Hilda. I would have her best men, not her most dispensable."},{"name":"LUCIA","text":"Forgive me, but I have much to do. Send Hilda my regards."},{"name":"HILDA","text":"Thancred's been tellin' me all about Ser Aymeric's grand soirée. Seems we're expected to join in."},{"name":"HILDA","text":"It's nice of him to invite us and all, but I hope he knows what he's doin'─'cause we ain't dressed to dance with professional bleedin' soldiers."},{"name":"HILDA","text":"...Well, well─seems the first commander's gone and handpicked her guests. Can't say I disagree with her choices, though. She's got a good eye."},{"name":"HILDA","text":"Will you be fightin' too? Reckon it'd inspire the lads if you were. Might take their minds off gettin' their hides tanned, and all. Think about it, eh?"},{"name":"THANCRED","text":"I hate to ask, but you haven't seen our favorite lordling, have you?"},{"name":"THANCRED","text":"&lt;sigh&gt; I thought not. On the assumption that he is not to be found in his father's loving embrace, I suggest we split up and look for him. I will search Foundation, and you the Pillars."},{"name":"THANCRED","text":"...Do not look at me like that. I will begin my search in due time."},{"name":"HILDA","text":"I still can't believe he actually hit the daft bastard. Gods, I wish I'd been there to see it!"},{"name":"LUCIA","text":"Hilda did not object to my selections, then? Good."},{"name":"EMMANELLAIN","text":"...I carried Honoroit to the manor."},{"name":"EMMANELLAIN","text":"Our best chirurgeons are tending to him as we speak. He has yet to wake, but surely...surely he will."},{"name":"EMMANELLAIN","text":"So Father has volunteered me for this “grand melee” of theirs?"},{"name":"EMMANELLAIN","text":"&lt;sigh&gt; My beloved family. Always making my decisions for me."},{"name":"EMMANELLAIN","text":"No, it's not like that! It's just... Oh, you wouldn't understand. How could you? You are free to be the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> you want to be, whereas I...I..."},{"name":"EMMANELLAIN","text":"I am a son of House Fortemps, don't you see? My future was determined before I was born. What I could and could not do."},{"name":"EMMANELLAIN","text":"Right or wrong, that was the way of it─until the old order began to crumble. Now we wander amidst the rubble, searching for a purpose, for a place..."},{"name":"EMMANELLAIN","text":"All around me, brave men and women rise to the occasion. With faith and conviction they dedicate themselves to their causes. But not I."},{"name":"EMMANELLAIN","text":"I was terrified of making the wrong choice, which is why I let better men make them for me. Do this, do that, take this duty, guard this conference─"},{"name":"EMMANELLAIN","text":"I suppose I had convinced myself I was above it...until your friend showed me otherwise."},{"name":"EMMANELLAIN","text":"When I saw Honoroit, I wanted to scream. I wanted someone to blame! But, in the end, there was only me. Only me."},{"name":"EMMANELLAIN","text":"So you see, I cannot meekly bow my head and accept Father's command. Such cowardice is what brought me to this point."},{"name":"EMMANELLAIN","text":"I will go to Ser Aymeric, and I will make my own decision."},{"name":"THANCRED","text":"...Found him, did you?"},{"name":"EMMANELLAIN","text":"No more excuses. This will be my choice, and mine alone."},{"name":"TEMPLEKIGHTGATE","text":"The lord commander is not to be disturbed. May I ask what matter demands his personal attention?"},{"name":"TEMPLEKIGHTGATE","text":"...I see. Very well─you may enter."},{"name":"Q3","text":"Proceed to the Seat of the Lord Commander?"},{"name":"LUCIA","text":"We would not have come this far were it not for you, <span class=\"highlight\">Forename</span>."},{"name":"LUCIA","text":"It has been an honor and a privilege."},{"name":"THANCRED","text":"Gods help me, I think it might be love."},{"name":"THANCRED","text":"I daresay it might be cheating, too. Your mere presence is enough to turn the tide of most battles."},{"name":"THANCRED","text":"And did you see the way his eyes lit up when you nodded? 'Twas a look of boundless relief and joy. One would think a politician more practiced at concealing his emotion."},{"name":"THANCRED","text":"Still, his honesty does him credit. For a moment, I was fair inspired to pledge myself to the cause. But that would be improper. This is their fight─and yours─but not mine."}],"reward":{"gil":1087,"items":[{"id":14389,"one":1},{"id":14391,"one":1},{"id":14393,"one":1},{"id":14401,"one":1},{"num":4,"id":5825,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67773]},"next":[67775]},"partials":[{"type":"npc","id":"1016579","obj":{"i":1016579,"n":"Thancred","l":2200,"q":3}},{"type":"npc","id":"1016583","obj":{"i":1016583,"n":"Thancred","l":2300,"q":2}},{"type":"npc","id":"1011223","obj":{"i":1011223,"n":"Temple Knight Guard","l":2300,"q":7}},{"type":"npc","id":"1012251","obj":{"i":1012251,"n":"Hilda","l":2300,"q":11}},{"type":"npc","id":"1012252","obj":{"i":1012252,"n":"Symme","l":2300,"q":10}},{"type":"npc","id":"1012253","obj":{"i":1012253,"n":"Eudestand","l":2300,"q":10}},{"type":"npc","id":"1013167","obj":{"i":1013167,"n":"Lucia","l":2300,"q":10}},{"type":"npc","id":"1013183","obj":{"i":1013183,"n":"Aymeric","l":2335,"q":4}},{"type":"npc","id":"1015978","obj":{"i":1015978,"n":"Lucia","l":2300,"q":4}},{"type":"npc","id":"1016024","obj":{"i":1016024,"n":"Count Edmont De Fortemps","l":2335,"q":1}},{"type":"npc","id":"1016069","obj":{"i":1016069,"n":"Lucia","l":2200,"q":2}},{"type":"npc","id":"1016070","obj":{"i":1016070,"n":"Artoirel","l":2200,"q":2}},{"type":"npc","id":"1016584","obj":{"i":1016584,"n":"Thancred","l":2300,"q":1}},{"type":"npc","id":"1016585","obj":{"i":1016585,"n":"Emmanellain","l":2301,"q":1}},{"type":"npc","id":"1016595","obj":{"i":1016595,"n":"Emmanellain","l":2300,"q":1}},{"type":"item","id":"14389","obj":{"i":14389,"n":"Augmented Hellfire Claws","l":240,"c":31110,"t":1}},{"type":"item","id":"14391","obj":{"i":14391,"n":"Augmented Slipstream Partisan","l":240,"c":31912,"t":5}},{"type":"item","id":"14393","obj":{"i":14393,"n":"Augmented Torrent Kris","l":240,"c":33895,"t":84}},{"type":"item","id":"14401","obj":{"i":14401,"n":"Augmented Hellfire Shield","l":240,"c":30135,"t":11}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67773","obj":{"i":67773,"n":"Consequences","g":4,"l":"Coerthas Western Highlands","s":15}},{"type":"quest","id":"67775","obj":{"i":67775,"n":"A Spectacle for the Ages","g":4,"l":"Ishgard","s":17}}]}