{"quest":{"name":"The Man Within","location":"Ishgard","id":67778,"patch":3.3,"sort":20,"icon":100558,"eventIcon":71201,"issuer":1015596,"target":1016818,"involved":[1012857,1013040,1015991,1016807,1016808],"genre":4,"journal":["The House Fortemps knight has a message for you.","According to the knight, Alphinaud wishes to speak with you. Enter Fortemps Manor and find out what young Master Leveilleur has to say.","Alphinaud bids you recall the events which unfolded at the peace conference─specifically, the moment when Nidhogg appeared in the guise of Estinien. Believing that the preservation of your friend's corporeal form may offer hope for the dragoon's salvation, he has sought the opinion of Y'shtola and Krile. In response to his request, it appears that they have already journeyed to Ishgard to share their observations. Make your way to the Forgotten Knight and speak with Krile.","At the tavern, Y'shtola and Krile relate their experiences at the conference, concluding at last that Estinien's spirit may indeed have survived, having apparently been enveloped but not consumed by Nidhogg's vengeful will. Heartened, Alphinaud speculates that removing the great wyrm's eyes from the dragoon's armor could potentially free him. Waving away Krile's concerns regarding this dubious proposition, the young Scion declares that he will do whatever it takes to save his friend. In the wake of this impassioned oath, Honoroit appears and announces that Ser Aymeric has requested your presence. Rendezvous with Alphinaud at the Congregation of Our Knights Most Heavenly in readiness for your audience.","You join Alphinaud outside the Seat of the Lord Commander. Alphinaud's musings echo your own as you ponder the reason behind Ser Aymeric's summons..."],"objectives":["Speak with Alphinaud at Fortemps Manor.","Speak with Krile at the Forgotten Knight.","Speak with Alphinaud at the Congregation of Our Knights Most Heavenly."],"dialogue":[{"name":"HOUSEFORTEMPSKNIGHT02242","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! It is well that you are here. You are wanted within."},{"name":"HOUSEFORTEMPSKNIGHT02242","text":"I believe Master Alphinaud wishes a word with you..."},{"name":"HOUSEFORTEMPSKNIGHT02242","text":"Master Alphinaud awaits within the manor. He appeared quite anxious to speak with you."},{"name":"ALPHINAUD","text":"Ah, <span class=\"highlight\">Forename</span>, there you are. Have you a moment? There is something I would fain discuss."},{"name":"ALPHINAUD","text":"I must ask you to recall the events which unfolded at the peace conference, though I daresay you would sooner forget them."},{"name":"ALPHINAUD","text":"My mind returns again and again to the moment when Nidhogg appeared before the crowd in the guise of Estinien. It was a sight to chill the soul─but one which gave me reason to hope that our friend might not be beyond salvation. When you described his fateful transformation at Azys Lla, I feared him lost forever, but the mere fact that some semblance of his former self endures must surely count for <span class=\"emphasis\">something</span>. Alas, I have no evidence to support this impression..."},{"name":"ALPHINAUD","text":"Thus did I turn to Y'shtola and Krile for a more <span class=\"emphasis\">empirical</span> appraisal─and full glad am I that I did, for it would seem they have some observations of their own to share."},{"name":"TATARU","text":"The ladies have saved us a table at the Forgotten Knight. Shall we go?"},{"name":"ALPHINAUD","text":"Excellent. Let us not keep our honored colleagues waiting."},{"name":"YSHTOLA","text":"The name does this establishment a disservice. Remarkably few of its patrons seem inclined to drink their way to oblivion. I do begin to see why Tataru chose to work here."},{"name":"TATARU","text":"I think I'll stay here at the Knight for the time being. After all, the rumors are fresh and the extra coin is always welcome!"},{"name":"HONOROIT","text":"Have you visited the lord commander, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? Then might I encourage you to report to the Congregation of Our Knights Most Heavenly at your earliest convenience? I would not have it said that I failed to pass on Ser Aymeric's summons."},{"name":"ALPHINAUD","text":"What news has Ser Aymeric to share with us, I wonder...?"}],"reward":{"gil":713,"items":[{"id":20604,"one":1},{"id":20606,"one":1},{"id":20607,"one":1},{"num":3,"id":5826,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67777]},"next":[67779]},"partials":[{"type":"npc","id":"1015596","obj":{"i":1015596,"n":"House Fortemps Knight","l":2301,"q":3}},{"type":"npc","id":"1016818","obj":{"i":1016818,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1012857","obj":{"i":1012857,"n":"Alphinaud","l":2320,"q":4}},{"type":"npc","id":"1013040","obj":{"i":1013040,"n":"Tataru","l":2300,"q":3}},{"type":"npc","id":"1015991","obj":{"i":1015991,"n":"Honoroit","l":2301,"q":1}},{"type":"npc","id":"1016807","obj":{"i":1016807,"n":"Krile","l":2300,"q":1}},{"type":"npc","id":"1016808","obj":{"i":1016808,"n":"Y'shtola","l":2300,"q":1}},{"type":"item","id":"20604","obj":{"i":20604,"n":"Torrent Attire of Aiming Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"20606","obj":{"i":20606,"n":"Hailstorm Attire of Healing Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"20607","obj":{"i":20607,"n":"Hailstorm Attire of Casting Coffer (IL 240)","l":1,"c":26509,"t":61}},{"type":"item","id":"5826","obj":{"i":5826,"n":"Allagan Gold Piece","l":35,"c":26001,"t":61}},{"type":"quest","id":"67777","obj":{"i":67777,"n":"Causes and Costs","g":4,"l":"Coerthas Western Highlands","s":19}},{"type":"quest","id":"67779","obj":{"i":67779,"n":"An Ally for Ishgard","g":4,"l":"Ishgard","s":21}}]}