{"quest":{"name":"For Those We Have Lost","location":"Coerthas Western Highlands","id":67772,"patch":3.2,"sort":14,"icon":100527,"eventIcon":71201,"issuer":1016566,"target":1016580,"involved":[1011231,1011232,1011233,1011235,1011236,1011238,1011240,1013709,1016077,1016567,1016568,1016569,1016570,1016578,1016579],"genre":4,"journal":["Emmanellain seems rather pleased with himself.","Per Lord Emmanellain's suggestion, you decide to partake of the food and drink in the nearby tavern. Desiring privacy, you opt for a secluded seat in the corner, and drink deep from a mug of mulled wine provided by a young waitress. You find yourself listening half-heartedly as she speaks of this and that...your eyes growing heavy, your limbs sapped of all strength. She turns, and through the haze you see her eyes, burning with contempt. You crumple to the ground, and as all fades to black, you hear her whisper to sleep, to sleep...<br><br>A grave, and a woman. No─two women, and a man. Countless graves, countless lives lost. A war that would never end, no─not for them. They came together, unwilling and unable to forgive, to forget. They learned of the conference and despaired...until she stepped forward. For she had a plan.<br><br>Thancred rouses you from your slumber, and from beyond the tavern doors you can hear the faint sounds of fighting. Bursting forth, you find chaos. Soldiers and civilians─some whom you recognize from your vision─lie dead and dying. From atop a wall she calls out. The woman from the tavern─from your vision. She cries out for vengeance against the Dravanians, and Emmanellain, in a panic, commands a nearby knight to act. As the crowd looks on, the knight shoots, striking her in the arm. Wounded and enraged, she decries the lordling and all for which he stands, before a second arrow silences her, and she falls from sight. All eyes turn to the young lord as he pleads his innocence, that all was a misunderstanding. But you know full well that it is too late for excuses.","In the wake of the failed protest, Lord Emmanellain retreats to the tavern, leaving you and Thancred to ensure that order has been fully restored. But, more importantly, having witnessed such a heavy-handed suppression, how will the people regard Ser Aymeric's efforts to ensure peace now?","You quickly ascertain that the people are uneasy and divided, harboring resentment towards the protesters, Lord Emmanellain, and even Ser Aymeric. Though there appears to be no risk of further violence, the peace conference clearly has no chance of success in this climate.","Thancred informs you that, for a mercy, the guards do not appear to have been responsible for any civilian casualties. Nevertheless, he agrees with your assessment. Misguided though her actions may have been, the protest leader's words resonated with many who have lost loved ones, as Thancred quietly observes..."],"objectives":["Speak with Thancred.","Speak with the people of Falcon's Nest.","Speak with Thancred."],"dialogue":[{"name":"HONOROIT","text":"(I am sorry, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. Truly, I am...)"},{"name":"THANCRED","text":"(“Selfless sacrifice” indeed.)"},{"name":"CITIZENA02233","text":"Just imagine: an end to the violence! Doesn't the very thought fill you with joy? You'll never have to fight again!"},{"name":"CITIZENB02233","text":"Are we truly the first, I wonder? Surely our forefathers tried to sue for peace in the past..."},{"name":"CITIZENC02233","text":"Not much longer now, eh? Wonder if I could sneak off to the tavern for a pint or three."},{"name":"EMMANELLAIN","text":"Oh, and this should of course go without saying, but let's keep those last few favors between us, yes? Artoirel wouldn't understand."},{"name":"EMMANELLAIN","text":"Right, then─the first floor of those barracks has been converted into a tavern for the duration of the conference. Why don't you go and have something to eat?"},{"name":"THANCRED","text":"For once, a suggestion with which I agree. Go on ahead, <span class=\"highlight\">Forename</span>. I will join you anon."},{"name":"EMMANELLAIN","text":"..."},{"name":"CITIZENA02233","text":"Gods, how could I have been so foolish!? She...she was right..."},{"name":"CITIZENB02233","text":"What was that fool of a lordling thinking!? What did he think would happen!?"},{"name":"CITIZENC02233","text":"I'm still not sure what they were about. I thought they might try to destroy the relief, but..."},{"name":"REDWALD","text":"He was not wrong to want to subdue the leader as quickly as able, for she may have spurred others to further violence."},{"name":"REDWALD","text":"But to fire on her as the crowd looked on was beyond reckless."},{"name":"TOURCENET","text":"It wasn't just young ones struggling with the guards. Older folk attacked them as well, screaming bloody murder..."},{"name":"AURIAUNE","text":"This was to be the end of it. Casualties at a peace conference, Fury take me..."},{"name":"EMERISSEL","text":"She seemed like such a nice girl. Always greeted me with a smile when she passed. Never would've guessed she had it in her."},{"name":"NOIRTEREL","text":"Pray forgive me, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. It's been chaos since preparations for the conference began, and I needed all the help I could get, and...and... How was I to know!?"},{"name":"NOIRTEREL","text":"I only realized what had happened after we inspected the mug. Master Thancred tells me it was a sleeping agent of some sort..."},{"name":"ROTHE","text":"Seven hells, the least he could've done is stop the bloody fool before he shot the second arrow!"},{"name":"INGARET","text":"You should've seen the looks on their faces as they left. There's no fixing this."},{"name":"THANCRED","text":"I daresay that could not have played out any worse, given that the first commander and Lord Artoirel are not here to take control of the situation."},{"name":"THANCRED","text":"I spoke with a messenger who said that they would be returning shortly, but until they do, naught will be done. Lord Emmanellain has retreated to the barracks and is refusing to speak to anyone."},{"name":"THANCRED","text":"Therefore it falls to us to ensure that order has been fully restored. Come, let us walk the streets and speak with the people."},{"name":"THANCRED","text":"So far, it would seem that the worst has passed..."},{"name":"CITIZENB02233","text":"My wife and I fell while fleeing with the others at first. The chirurgeons tended to our bruises afterwards."},{"name":"CITIZENB02233","text":"&lt;sigh&gt; Those mad fools have ruined everything, and for what?"},{"name":"CITIZENB02233","text":"I will never forgive them for this. Never!"},{"name":"CITIZENC02233","text":"I'd heard the rumors that the young lord was a drunken fool. What imbecile thought it would be a good idea to let him have the run of Falcon's Nest!?"},{"name":"CITIZENC02233","text":"Well, I say him and Ser Aymeric take their bloody “change” and shove it up their arses. I'll not be taken in by that rot again."},{"name":"CITIZENC02233","text":"She's right, you know. We're naught but tools to them, to be used and discarded as they see fit. We all saw it."},{"name":"JOSSELOUX","text":"They were wrong to resort to violence, but when I heard her speak, her words were as a dagger in my heart."},{"name":"JOSSELOUX","text":"Who are we to decide that enough is enough? That their calls for justice can never be answered? Will this be the end of it, or will there be others like them and the True Brothers?"},{"name":"JOSSELOUX","text":"I do not want to bear steel against my kinsman ever again. I do not know if I even can..."},{"name":"JOSSELOUX","text":"I'm tired of it. I'm just so tired of it all."},{"name":"THANCRED","text":"Well? What say you?"},{"name":"THANCRED","text":"So, the violence has passed, but the people are far from recovered. That is to be expected."},{"name":"THANCRED","text":"For the moment, it appears that no innocents were harmed by the guards. The blame for all casualties can be placed squarely upon the protesters."},{"name":"THANCRED","text":"Nevertheless, the people will not soon forget the image of a young lordling ordering the public execution of an unarmed protester─one whose words resonated with the hearts of many."},{"name":"THANCRED","text":"After all, who among us has not lost loved ones..."}],"reward":{"gil":810,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67771]},"next":[67773]},"partials":[{"type":"npc","id":"1016566","obj":{"i":1016566,"n":"Emmanellain","l":2200,"q":4}},{"type":"npc","id":"1016580","obj":{"i":1016580,"n":"Thancred","l":2200,"q":2}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1011232","obj":{"i":1011232,"n":"Tourcenet","l":2200,"q":5}},{"type":"npc","id":"1011233","obj":{"i":1011233,"n":"Emerissel","l":2200,"q":6}},{"type":"npc","id":"1011235","obj":{"i":1011235,"n":"Josseloux","l":2200,"q":3}},{"type":"npc","id":"1011236","obj":{"i":1011236,"n":"Rothe","l":2200,"q":5}},{"type":"npc","id":"1011238","obj":{"i":1011238,"n":"Noirterel","l":2200,"q":5}},{"type":"npc","id":"1011240","obj":{"i":1011240,"n":"Ingaret","l":2200,"q":5}},{"type":"npc","id":"1013709","obj":{"i":1013709,"n":"Auriaune","l":2200,"q":4}},{"type":"npc","id":"1016077","obj":{"i":1016077,"n":"Thancred","l":2200,"q":3}},{"type":"npc","id":"1016567","obj":{"i":1016567,"n":"Honoroit","l":2200,"q":4}},{"type":"npc","id":"1016568","obj":{"i":1016568,"n":"Lowborn Youth","l":2200,"q":6}},{"type":"npc","id":"1016569","obj":{"i":1016569,"n":"Highborn Merchant","l":2200,"q":6}},{"type":"npc","id":"1016570","obj":{"i":1016570,"n":"Spirited Stonecutter","l":2200,"q":6}},{"type":"npc","id":"1016578","obj":{"i":1016578,"n":"Emmanellain","l":2200,"q":2}},{"type":"npc","id":"1016579","obj":{"i":1016579,"n":"Thancred","l":2200,"q":3}},{"type":"quest","id":"67771","obj":{"i":67771,"n":"Once More, a Favor","g":4,"l":"Coerthas Western Highlands","s":13}},{"type":"quest","id":"67773","obj":{"i":67773,"n":"Consequences","g":4,"l":"Coerthas Western Highlands","s":15}}]}