{"quest":{"name":"A Spectacle for the Ages","location":"Ishgard","id":67775,"patch":3.2,"sort":17,"icon":100528,"eventIcon":71201,"issuer":1015978,"target":1016588,"involved":[1006455,1006456,1016008,1016072,1016073,1016074,1016075,1016076,1016583,1016587,1017095],"genre":4,"journal":["The grand melee is poised to begin, and Lucia would not be late.","Lucia informs you that the grand melee is to be held in central Coerthas, just outside the city. Allied forces are already en route, and your Ishgardian comrades gather in the shadow of the Gates of Judgement.","Lord Emmanellain is understandably nervous, though somewhat comforted by your presence. Marshaling his courage, he turns his thoughts from defeat to victory, and the stories he might tell Honoroit when he wakens from his torpor.","Before the grand melee commences, Lord Emmanellain presents to you a gift: the colors of House Fortemps, which he and his father would have you wear into battle. Obliging his request, you don the armor and take the field with Ishgard, ready to face your brothers and sisters in the Alliance.","Bards often sing of how, in battles, the champions of armies are wont to shun lesser combatants and seek out warriors of equal strength, that they might enjoy proper sport in the midst of war. So it was that Raubahn Aldynn, General of the Immortal Flames, the Bull of Ala Mhigo himself, swept aside all comers and challenged you to single combat. The raging flames held back all the world, and for a time, there were but two. Yet when at last the flames died down, and the others turned to see, only one remained standing. It was then that Ser Aymeric, raising both sword and voice to the heavens, proclaimed victory for Ishgard, for the day was theirs.<br><br>As you watch the Ishgardians celebrate their triumph, Thancred, having finally returned from his quarrel with an errant cyclops, offers his congratulations. Though clearly injured, he brushes aside your concern, declaring that there are many, many more important matters to which you both must attend, one day at a time...as Minfilia would have done.","Still grinning with the thrill of the fight, Raubahn declares that he had forgotten what it was like to feel so alive. Rarely do men in his position have the opportunity to take part in battle, and he cannot thank you enough for the indulgence. He duly takes his leave, but not before insisting upon a rematch, when time allows. As he strides away, you cannot help but wonder what might have been had the man been possessed of a full set of arms.","Ser Aymeric's plan appears to have worked faultlessly, strengthening relations between the city–states and providing a victory certain to inspire the people of Ishgard. With a smile, Thancred tells you to be proud, for it was you that made all of this possible."],"objectives":["Speak with Emmanellain outside the Gates of Judgement.","Speak with Emmanellain.","Speak with Raubahn.","Speak with Thancred."],"dialogue":[{"name":"THANCRED","text":"Mayhap I ought to fight for the other side─you know, even the odds."},{"name":"LUCIA","text":"Ser Aymeric informs me that the Alliance leaders have agreed to his proposal. The grand melee will be held here, in the shadow of the Gates of Judgement, and in sight of the capital."},{"name":"LUCIA","text":"An announcement has been made, and Allied forces are currently en route."},{"name":"LUCIA","text":"The eyes of Ishgard are upon us, <span class=\"highlight\">Forename</span>. We must not fail."},{"name":"THANCRED","text":"A rare opportunity to see you pit yourself against Allied forces─outside of Carteneau, perhaps. I would not miss this for the world."},{"name":"AYMERIC","text":"'Tis a matter of pride for the Alliance as well. They will not scruple to send their best against us. Yet we must not be cowed. Too much rests on our success."},{"name":"LUCIA","text":"The second commander and Hilda's lieutenants shall see to the security of the city in my absence. The melee demands my undivided attention."},{"name":"HILDA","text":"It ain't often highborn dandies deign to fight alongside us hoi polloi. Like all our namedays rolled into one, it is."},{"name":"HILDA","text":"Then again, it's our national pride that's at stake. National and personal. I ain't about to let a snotty-nosed lordling show me up."},{"name":"THANCRED","text":"It looks to be a veritable who's who of the Eorzean Alliance. The only question is: who came to watch and who came to fight? Hmm...Nanamo. Definitely Nanamo."},{"name":"MESSENGER02239","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, you honor us with your presence. There is a scurrilous rumor going around that you will be taking the field with the Ishgardians. It, uh... It isn't true, is it?"},{"name":"LOANNE","text":"The field has been made ready. All that remains is for the participants to assemble."},{"name":"CHAUNOLLET","text":"Temple Knights fighting side by side with humble watchmen... A queer sight, but somehow...right."},{"name":"EMMANELLAIN","text":"There <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is! I say, when you didn't appear, I began to question... N-Nothing! Never mind!"},{"name":"EMMANELLAIN","text":"Ahem. To think that we are mere moments away from facing the cream of Eorzea's soldiery in battle. That <span class=\"emphasis\">I</span> am...mere...mmm... But what if...?"},{"name":"EMMANELLAIN","text":"Oh, what am I saying!? I have to stop imagining the worst! I must think of the victory, of the glory! Of the stories I will tell Honoroit when he awakes!"},{"name":"EMMANELLAIN","text":"I am ready, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! Are you!?"},{"name":"EMMANELLAIN","text":"By the Fury, how could I forget? Father bid me present this to you."},{"name":"EMMANELLAIN","text":"I know it is sudden, but we believe the men would find it inspiring if you bore the colors of House Fortemps into battle. Pray do us this honor."},{"name":"SYSTEM","text":"During the grand melee, some of your gear will be glamoured. Your attributes and abilities will be unaffected."},{"name":"TEMPLEKNIGHT02239","text":"(-Flustered Temple Knight-)Cyclops! Cyclops! Everyone, on your guard!"},{"name":"LUCIA","text":"All forces, fall back!"},{"name":"THANCRED","text":"Continue the melee! I will deal with him!"},{"name":"HILDA","text":"Hmph. Daft sod...<br>You heard the man! Back to it!"},{"name":"AYMERIC","text":"All forces, form a line on <span class=\"highlight\">Forename</span>! Now!"},{"name":"RAUBAHN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Well met</span><span class=\"alternative\">[GC Rank]</span></span>. I will not lie─I was hoping it would come to this.<br>So then...shall we dance?"},{"name":"AYMERIC","text":"Damn it all!"},{"name":"PIPPIN","text":"As long as I live, I shall never forget that duel. It was inspiring and humbling in equal measure. I feel honor-bound to point out, however, that my father <span class=\"emphasis\">was</span> fighting one-handed."},{"name":"THANCRED","text":"I believe the Flame General would like a word."},{"name":"AYMERIC","text":"I confess, it stung my pride to be brushed aside so easily. But when the flames subsided, and I saw you standing there triumphant, there was only gladness in my heart."},{"name":"LUCIA","text":"The messengers have already been dispatched. Let us pray that this victory has the desired effect."},{"name":"HILDA","text":"That was just another battle for you, I bet, but for my lot... Hmph. It weren't so much the fightin' as the not trippin' over each other's feet. His lordship might think about layin' on some actual trainin' for us next time."},{"name":"EMMANELLAIN","text":"What are we waiting for!? We must return to the capital at once and tell them all about our victory!"},{"name":"LOANNE","text":"What a sight! Blades flashing, magicks dazzling─I could scarce make out who had the advantage from one moment to the next. And that duel... By the Fury, I was wringing my hands until the very end! I cannot wait to tell the others!"},{"name":"CHAUNOLLET","text":"Never did I doubt! Nay, not for a moment! By the Fury, I could fair burst with pride! Ishgard! Ishgard!"},{"name":"RAUBAHN","text":"Thal's balls... I had forgotten what it was like to feel so alive!"},{"name":"RAUBAHN","text":"Not since leaving the bloodsands have I had the privilege. Not since the Bull of Ala Mhigo hung up his swords."},{"name":"RAUBAHN","text":"Back then, the outcome might have been different. But I do not begrudge you your victory. I know how far you have come, how much you have endured. Our fight only confirmed it."},{"name":"RAUBAHN","text":"We shall have to do this again one day, when time allows. I shall look forward to it. Now go. Go to the Ishgardians and celebrate your victory. You have earned it."},{"name":"RAUBAHN","text":"Come, Pipin. Her Grace is expecting us."},{"name":"PIPPIN","text":"Lead on, Father!"},{"name":"THANCRED","text":"Said your good-byes?"},{"name":"THANCRED","text":"In all the years I have known Raubahn, I cannot recall ever seeing him look so happy in defeat."},{"name":"THANCRED","text":"Well! Everything seems to be falling into place, does it not? The Ishgardians have claimed their symbolic victory, and the Eorzean Alliance has been strengthened in the process. Be proud, <span class=\"highlight\">Forename</span>. You made this happen."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Victory</span>!"}],"reward":{"gil":2793,"emote":"Victory","items":[{"id":14392,"one":1},{"id":14395,"one":1},{"id":14397,"one":1},{"id":14398,"one":1},{"num":4,"id":5825,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67774]},"next":[67776]},"partials":[{"type":"npc","id":"1015978","obj":{"i":1015978,"n":"Lucia","l":2300,"q":4}},{"type":"npc","id":"1016588","obj":{"i":1016588,"n":"Thancred","l":63,"q":2}},{"type":"npc","id":"1006455","obj":{"i":1006455,"n":"Loanne","l":63,"q":4}},{"type":"npc","id":"1006456","obj":{"i":1006456,"n":"Chaunollet","l":63,"q":6}},{"type":"npc","id":"1016008","obj":{"i":1016008,"n":"Lucia","l":2300,"q":5}},{"type":"npc","id":"1016072","obj":{"i":1016072,"n":"Raubahn","l":63,"q":1}},{"type":"npc","id":"1016073","obj":{"i":1016073,"n":"Pipin","l":63,"q":1}},{"type":"npc","id":"1016074","obj":{"i":1016074,"n":"Aymeric","l":63,"q":2}},{"type":"npc","id":"1016075","obj":{"i":1016075,"n":"Lucia","l":63,"q":3}},{"type":"npc","id":"1016076","obj":{"i":1016076,"n":"Hilda","l":63,"q":2}},{"type":"npc","id":"1016583","obj":{"i":1016583,"n":"Thancred","l":2300,"q":2}},{"type":"npc","id":"1016587","obj":{"i":1016587,"n":"Emmanellain","l":63,"q":2}},{"type":"npc","id":"1017095","obj":{"i":1017095,"n":"Flame Herald","l":63,"q":1}},{"type":"item","id":"14392","obj":{"i":14392,"n":"Augmented Torrent Longbow","l":240,"c":32308,"t":4}},{"type":"item","id":"14395","obj":{"i":14395,"n":"Augmented Torrent Musketoon","l":240,"c":34668,"t":88}},{"type":"item","id":"14397","obj":{"i":14397,"n":"Augmented Hailstorm Rod","l":240,"c":33055,"t":7}},{"type":"item","id":"14398","obj":{"i":14398,"n":"Augmented Hailstorm Grimoire","l":240,"c":33545,"t":10}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67774","obj":{"i":67774,"n":"Choices","g":4,"l":"Coerthas Western Highlands","s":16}},{"type":"quest","id":"67776","obj":{"i":67776,"n":"For Those We Can Yet Save","g":4,"l":"Coerthas Central Highlands","s":18}}]}