{"quest":{"name":"Staunch Conviction","location":"Coerthas Western Highlands","id":67770,"patch":3.2,"sort":12,"eventIcon":71201,"issuer":1016564,"target":1016565,"involved":[1011231,1011236,1016566,1016567,1016568,1016569,1016570],"genre":4,"journal":["Lucia is concerned that you seem to be looking for something to do.","Resigned to the simple truth that you will never be content to do absolutely nothing, Lucia suggests that you take a stroll about Falcon's Nest and speak with the various peoples who have come to attend the conference. She also makes mention that lords Artoirel and Emmanellain should be nearby, as both have graciously volunteered their services.","Though they come from different walks of life, the Ishgardians with whom you speak all share a similar hope for peace, however unimaginable it might feel. The two young lords of House Fortemps are not difficult to find, but Emmanellain seems disinclined to conversation. Perhaps his older brother will be more obliging.","As you converse with Lord Artoirel about recent affairs, Lucia abruptly appears and announces that a party of Convictors has refused to stand down, and have instead pledged to engage any Dravanians they spy flying towards Falcon's Nest. Needless to say, such an act could spell disaster for the peace conference, and the first commander intends to ride out to the Convictory and resolve the situation in person. Lord Artoirel, she feels, would only strengthen her claim, as he can speak with the authority of House Fortemps. The young lord agrees, and before he departs he asks that you look after his younger brother, who he fears may fail to carry out his duties in his absence."],"objectives":["Speak with the people of Falcon's Nest.","Speak with Artoirel."],"dialogue":[{"name":"ARTOIREL","text":"Will it truly be enough, I wonder..."},{"name":"EMMANELLAIN","text":"Ah...still here, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>? This, uh...this really isn't the time."},{"name":"HONOROIT","text":"(I will do my utmost to keep him out of trouble, but I may require your assistance later...)"},{"name":"CITIZENA02233","text":"Have you peeked behind the curtain? Care to tell us what you saw?"},{"name":"CITIZENB02233","text":"I suppose we came a bit early, didn't we? Nevertheless, better early than late!"},{"name":"CITIZENC02233","text":"More and more folk are drifting into Falcon's Nest. Most ain't quite sure what to expect, I reckon. Quite frankly, neither am I..."},{"name":"LUCIA","text":"If you would rather not take a rest, then why not take a walk around Falcon's Nest? Make your presence known to the people and so forth."},{"name":"LUCIA","text":"In addition to those who have come from far and wide to attend this ceremony, you may meet lords Artoirel and Emmanellain, who have graciously volunteered their services."},{"name":"LUCIA","text":"They should be glad to see you. Now, if you would excuse me, I must needs return to my duties."},{"name":"ARTOIREL","text":"Taking a stroll around the hamlet? Very good, very good. We shall speak anon."},{"name":"ROTHE","text":"Bloody excitin', isn't it? Not just peace with the dragons, but with all them heretics besides!"},{"name":"ROTHE","text":"Don't misunderstand─we've all got a healthy fear of being bathed in dragon fire. That being said, the heretics did far more to hinder our efforts here in the past, so hearin' that we're close to a reconciliation comes as a great relief!"},{"name":"ROTHE","text":"If the dragons haven't got reason to fight, then neither will the heretics. Thank the Fury for that."},{"name":"REDWALD","text":"I am glad to see that the rumors were true! Well met, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, and fear not─I've no intention of begging your aid with this or that. Everything appears to be in order."},{"name":"REDWALD","text":"My only lingering concern is that one of the Convictors might not have been informed of our plans. As I recall, Vidofnir may pass directly over their encampment."},{"name":"REDWALD","text":"The last thing we need is a glory-seeking nobleman attempting to slay a Dravanian ambassador to a peace conference..."},{"name":"REDWALD","text":"Pay me no mind. Worrying over unlikely possibilities is my duty. Yours is to relax and enjoy the festivities."},{"name":"CITIZENA02233","text":"Do you know when everything's set to begin? I wasn't sure how many might come, so I thought it best to come early and find a spot with a great view."},{"name":"CITIZENA02233","text":"When I heard that Ser Aymeric was planning to make a speech, I knew I couldn't miss it. I mean, the man risked his own neck to rescue those hostages! How often do we get heroes like that in this day and age?"},{"name":"CITIZENA02233","text":"And he's more than a fighter, too─he's a thinker, he is. He's got plans to better our lives. To change things. And he'll do it, by the Fury. Me and my friends and family, we all believe he can do it."},{"name":"CITIZENA02233","text":"Where is everyone else? Don't they know what they're missing?"},{"name":"ARTOIREL","text":"How much has changed since we fought alongside each other in the Vault. If you had told me then that we would soon be hosting a peace conference, I would have thought you a naive fool."},{"name":"ARTOIREL","text":"Yet here we are, preparing to make that fantasy a reality. Hah─and here <span class=\"emphasis\">I</span> am, laboring to make it so."},{"name":"LUCIA","text":"Lord Artoirel, if I may."},{"name":"ARTOIREL","text":"Certainly, First Commander. How may I be of service?"},{"name":"LUCIA","text":"Some of the Convictors are refusing to stand down."},{"name":"LUCIA","text":"The majority were willing to do so, but a small party have instead pledged to engage any Dravanians bound for Falcon's Nest."},{"name":"ARTOIREL","text":"Fury take me, they would defy Ser Aymeric's commands!? If they dare attack Vidofnir─"},{"name":"LUCIA","text":"It will not come to that. But to see that it does not, we must needs hasten to their encampment."},{"name":"LUCIA","text":"They should be far more reluctant to oppose us were a lord of House Fortemps present."},{"name":"ARTOIREL","text":"I understand completely. Let us depart at once."},{"name":"ARTOIREL","text":"But ere we do, I must ask: would you look after Emmanellain while I am away?"},{"name":"ARTOIREL","text":"As you know, he has ever been an impulsive, changeable child, but recently he seems to have been suffering from a bout of melancholy."},{"name":"ARTOIREL","text":"I thought to lift his spirits by having him assist with guard duty─a simple but honorable charge, unlikely to expose him to danger given the presence of so many other knights. Alas, he has taken no interest, and I fear he may abandon his post in my absence."},{"name":"ARTOIREL","text":"All I ask is that you keep an eye on him until I return...exhausting though that may be."},{"name":"ARTOIREL","text":"Thank you, my friend. I promise we will not be long."}],"reward":{"gil":550,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67769]},"next":[67771]},"partials":[{"type":"npc","id":"1016564","obj":{"i":1016564,"n":"Lucia","l":2200,"q":2}},{"type":"npc","id":"1016565","obj":{"i":1016565,"n":"Artoirel","l":2200,"q":3}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1011236","obj":{"i":1011236,"n":"Rothe","l":2200,"q":5}},{"type":"npc","id":"1016566","obj":{"i":1016566,"n":"Emmanellain","l":2200,"q":4}},{"type":"npc","id":"1016567","obj":{"i":1016567,"n":"Honoroit","l":2200,"q":4}},{"type":"npc","id":"1016568","obj":{"i":1016568,"n":"Lowborn Youth","l":2200,"q":6}},{"type":"npc","id":"1016569","obj":{"i":1016569,"n":"Highborn Merchant","l":2200,"q":6}},{"type":"npc","id":"1016570","obj":{"i":1016570,"n":"Spirited Stonecutter","l":2200,"q":6}},{"type":"quest","id":"67769","obj":{"i":67769,"n":"This War of Ours","g":4,"l":"Matoya's Cave","s":11}},{"type":"quest","id":"67771","obj":{"i":67771,"n":"Once More, a Favor","g":4,"l":"Coerthas Western Highlands","s":13}}]}