{"quest":{"name":"For Those We Can Yet Save","location":"Coerthas Central Highlands","id":67776,"patch":3.2,"sort":18,"icon":100546,"eventIcon":71201,"issuer":1016074,"target":1016590,"involved":[1010383,1010384,1011231,1011232,1011233,1011236,1011238,1011240,1013709,1016075,1016076,1016565,1016568,1016569,1016570,1016587,1016588,1016589],"genre":4,"journal":["Ser Aymeric is beaming with pride.","As you pass through the city gates, a familiar voice calls out in greeting. Honoroit, Lord Emmanellain's manservant, has made a full recovery and is eager to resume his duties. As the boy and his master make up for lost time, Alphinaud and Lord Edmont bid you welcome as well, congratulating you and your comrades on your rousing victory over the Alliance. Emboldened by their words, Ser Aymeric declares that the peace conference is to be reconvened at once─that they will make peace with Hraesvelgr's brood and hasten the Dragonsong War to its end.","Alphinaud reveals that while he knew of your journey to Falcon's Nest, he refrained from joining you there for fear of turning to you for guidance. Master Matoya's words left a lasting impression on him, and he desired time alone to reflect on his life's course. Though he is yet uncertain about a great many matters, there are things he would say to you...but only after the conference is concluded.","Falcon's Nest is once more bustling with activity, the main square filled with spectators awaiting the commencement of ceremonies. Amidst the hubbub, you find Lord Artoirel, who thanks you for looking after his younger brother in the grand melee. Alas, he cannot speak with you at length, for duty calls, and he leaves you and Alphinaud to wait for the conference to begin.","For one thousand years have generations of Ishgardians and Dravanians lived and died, unable to conceive of a world without war. But when, during the unveiling of a relief celebrating the union of Saint Shiva and Hraesvelgr, Ser Aymeric and Vidofnir come together and speak of peace, such a world seems more than mere fantasy.<br><br>The dream endures for all of an instant. Without warning, Estinien leaps down from on high and drives his lance into Vidofnir's back, the white dragon's blood painting the relief a deep red. As the dragon collapses, Ser Aymeric seizes a bow and looses an arrow at his friend's heart, duty guiding his hand. The dragoon has naught to fear from worldly weapons, however, swatting aside the deadly shaft and regaining his perch atop a nearby tower. Silence.<br><br>All present strain to see the man who once embodied Ishgard's defiance. Estinien's now-crimson armor radiates a malevolent power which pours forth from two massive, twitching eyes fused to his arm and shoulder. And when he speaks, it is not with the voice of a man, but a wyrm. Nidhogg. The wrathful shade declares that the final chorus of the Dragonsong War is nigh, and that all will soon answer for their sins. He then throws his arms wide, and with a bestial roar, transforms into his draconic form, taking wing for distant skies. Ser Aymeric's face is a mask, unreadable, his eyes fixed upon the wyrm as he whispers an oath you cannot hear for the cries of the crowd howling for Nidhogg's blood.<br><br>Alphinaud watches as the last guests leave Falcon's Nest. Vidofnir will live, he tells you, though it was surely not by accident. Nidhogg's declaration of war was doubtless also a demonstration of power for Hraesvelgr's brood─and for the Ishgardians, who could do naught but watch as he wielded Estinien as an instrument of his vengeance."],"objectives":["Speak with Alphinaud.","Speak with Artoirel in Falcon's Nest.","Speak with Alphinaud."],"dialogue":[{"name":"THANCRED","text":"I cannot help but wonder what would have happened had you lost... Fantastical though such a state of affairs unquestionably is. I daresay the world would simply have ended."},{"name":"LUCIA","text":"When you are ready to return, pray inform the lord commander."},{"name":"HILDA","text":"I never imagined our humble gatherin' of like-minded souls would grow into somethin' proper, let alone a force fit to trade blows with the Alliance's finest. Can't say I didn't enjoy it, neither. Funny how things turn out, eh?"},{"name":"EMMANELLAIN","text":"I do hope Honoroit recovers soon. I have so much to tell him!"},{"name":"AYMERIC","text":"We have done it─nay, <span class=\"emphasis\">you</span> have done it. You have brought us the victory we so desperately needed."},{"name":"AYMERIC","text":"There is naught left but to return to the capital. Come─let us see what reception awaits us."},{"name":"ALPHINAUD","text":"They say you dueled General Raubahn within a ring of flames. I did not think the man so ostentatious. Would that I could have seen it..."},{"name":"ALPHINAUD","text":"After we parted ways in Matoya's Cave, I returned here to speak with Tataru. We agreed to tell the others only that our search for Minfilia had reached an impasse."},{"name":"ALPHINAUD","text":"I subsequently learned that you had left for Falcon's Nest, but I thought it best to keep to myself for a time. I am wont to rely on you overmuch when we are together, and I needed to think. To reflect."},{"name":"ALPHINAUD","text":"I still do, I suspect, but matters here seemed to be coming to a head. In short, there are some things I feel I must say─though nothing so urgent that it cannot wait until after the conference."},{"name":"ALPHINAUD","text":"So let us make for Falcon's Nest, and see if Lord Artoirel has need of our assistance."},{"name":"ALPHINAUD","text":"As Ser Aymeric hoped, Ishgard's success at the grand melee has done much to restore the people's faith in this endeavor. Look on their faces, <span class=\"highlight\">Forename</span>. Nervous, yet hopeful... <span class=\"emphasis\">Expectant</span>, in a word."},{"name":"CITIZENA02240","text":"I held on to the anger for so long. It was the only way I could cope with my husband's passing. But my daughter, stubborn as she is, insisted that we attend."},{"name":"CITIZENA02240","text":"I never thought this day would come. Never wanted it. Never needed it. But when I saw all these young ones... For their sake, then...and perhaps for his memory too."},{"name":"CITIZENB02240","text":"Did you hear how Ishgard trounced the Alliance forces in the grand melee? Hah, I knew they would be no match for us!"},{"name":"CITIZENB02240","text":"All credit to the lord commander, I say. I know some still had their doubts about his watch initiative, but who can argue with results like that?"},{"name":"CITIZENA02233","text":"I haven't forgotten about what happened, but everyone else seems willing to give Ser Aymeric another chance...so I will, too."},{"name":"CITIZENB02233","text":"While I am here, my family are at home celebrating the birth of our grandson. Though it pains me to be so far away, my wife insisted that one of us attend the ceremony, to tell the boy of this day when he is old enough to understand."},{"name":"CITIZENB02233","text":"The world he will know as an adult shall be much changed if Ser Aymeric's conference succeeds─and if each and every one of us lends him our support."},{"name":"CITIZENC02233","text":"It true that lordling fought in the grand melee? Bugger me, that must've been a thing to see. But they say he acquitted himself well enough. His way of making amends, I'll wager."},{"name":"REDWALD","text":"Much has been said of your role in the grand melee. Needless to say, more than a few of my subordinates have implored me to invite you to a training session, that they might benefit from your guidance─though such conversations can wait."},{"name":"TOURCENET","text":"After that disaster with the protesters, it seemed like the conference was doomed to failure. But now? Sometimes it feels like nothing even happened. I'm glad and all, but it's a bit surprising, even strange..."},{"name":"AURIAUNE","text":"Wait...you aren't about to leave, are you? The Dravanian emissary could arrive at any moment!"},{"name":"EMERISSEL","text":"All seems well for now. Nevertheless, we can ill afford to be caught off guard a second time."},{"name":"NOIRTEREL","text":"No time to talk! I've got to prepare enough soup to feed a bloody conference, in case you haven't noticed!"},{"name":"ROTHE","text":"Praise Halone, I was beginnin' to think that scaffold would never get used! We worked like beasts to build the bloody thing in time, only for the protest to delay everything. Better late than never, anyway."},{"name":"INGARET","text":"Rest assured that we will take no chances this time. All guests have been questioned, and we will have people watching the crowd for the duration of the ceremony."},{"name":"ARTOIREL","text":"Well met, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, and thank you for looking after my brother."},{"name":"ARTOIREL","text":"They say he fought bravely─that he did not dishonor his house. But you, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>─to you we owe everything."},{"name":"ARTOIREL","text":"As you can see, we have made every effort to strike while the iron is hot. We made our intentions known, and that all would be welcome to attend. And so they came. By the grace of the Fury, they came."},{"name":"ARTOIREL","text":"The ceremony will not be a lengthy affair, but there is still much to be done! I would speak with you more, but I must see to my duties. As for you and Master Alphinaud─you will do naught but enjoy yourselves, is that clear? If any dare beg your assistance again, I will have words."},{"name":"ALPHINAUD","text":"Well, there you have it. We have been forbidden from meddling. Shall we wait, or have you other matters to attend to before the ceremony begins?"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Wait with Alphinaud for the ceremony to begin."},{"name":"A1","text":"See to other matters first."},{"name":"ALPHINAUD","text":"By all means, then. I will remain here."},{"name":"ALPHINAUD","text":"Excellent. I only hope Thancred and the others will not be late. Epochal events do not come around very often."},{"name":"ALPHINAUD","text":"There they go, the last of the guests. Having come hither with hope in their hearts, they depart with hatred and bloodlust..."},{"name":"ALPHINAUD","text":"Until the moment I saw him strike, I still held some small hope that what you had seen in Azys Lla was...an illusion, perhaps. But he acted without hesitation...as did Ser Aymeric."},{"name":"ALPHINAUD","text":"For a mercy, Vidofnir's wound was not mortal, or so Lucia tells me. The dragon was spirited away to Anyx Trine to receive care from her brethren. We can but hope her recovery is swift."},{"name":"ALPHINAUD","text":"...But such was surely Nidhogg's intent. To deliver a proclamation not only to the children of Thordan, but to his kindred. “War is coming, and ye who do not stand with us stand apart.”"},{"name":"ALPHINAUD","text":"She was an example─a message to her brood. Another instrument of his vengeance...like Estinien."}],"reward":{"gil":1087,"items":[{"id":14396,"one":1},{"id":14399,"one":1},{"id":14400,"one":1},{"id":20419,"one":1},{"num":4,"id":5825,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67775]},"next":[67777]},"partials":[{"type":"npc","id":"1016074","obj":{"i":1016074,"n":"Aymeric","l":63,"q":2}},{"type":"npc","id":"1016590","obj":{"i":1016590,"n":"Alphinaud","l":2200,"q":2}},{"type":"npc","id":"1010383","obj":{"i":1010383,"n":"Modest Matron","l":2200,"q":1}},{"type":"npc","id":"1010384","obj":{"i":1010384,"n":"Proud Patriot","l":2200,"q":1}},{"type":"npc","id":"1011231","obj":{"i":1011231,"n":"Redwald","l":2200,"q":17}},{"type":"npc","id":"1011232","obj":{"i":1011232,"n":"Tourcenet","l":2200,"q":5}},{"type":"npc","id":"1011233","obj":{"i":1011233,"n":"Emerissel","l":2200,"q":6}},{"type":"npc","id":"1011236","obj":{"i":1011236,"n":"Rothe","l":2200,"q":5}},{"type":"npc","id":"1011238","obj":{"i":1011238,"n":"Noirterel","l":2200,"q":5}},{"type":"npc","id":"1011240","obj":{"i":1011240,"n":"Ingaret","l":2200,"q":5}},{"type":"npc","id":"1013709","obj":{"i":1013709,"n":"Auriaune","l":2200,"q":4}},{"type":"npc","id":"1016075","obj":{"i":1016075,"n":"Lucia","l":63,"q":3}},{"type":"npc","id":"1016076","obj":{"i":1016076,"n":"Hilda","l":63,"q":2}},{"type":"npc","id":"1016565","obj":{"i":1016565,"n":"Artoirel","l":2200,"q":3}},{"type":"npc","id":"1016568","obj":{"i":1016568,"n":"Lowborn Youth","l":2200,"q":6}},{"type":"npc","id":"1016569","obj":{"i":1016569,"n":"Highborn Merchant","l":2200,"q":6}},{"type":"npc","id":"1016570","obj":{"i":1016570,"n":"Spirited Stonecutter","l":2200,"q":6}},{"type":"npc","id":"1016587","obj":{"i":1016587,"n":"Emmanellain","l":63,"q":2}},{"type":"npc","id":"1016588","obj":{"i":1016588,"n":"Thancred","l":63,"q":2}},{"type":"npc","id":"1016589","obj":{"i":1016589,"n":"Alphinaud","l":2300,"q":3}},{"type":"item","id":"14396","obj":{"i":14396,"n":"Augmented Hailstorm Cane","l":240,"c":32687,"t":9}},{"type":"item","id":"14399","obj":{"i":14399,"n":"Augmented Hailstorm Codex","l":240,"c":33546,"t":98}},{"type":"item","id":"14400","obj":{"i":14400,"n":"Augmented Hailstorm Astrometer","l":240,"c":34869,"t":89}},{"type":"item","id":"20419","obj":{"i":20419,"n":"Augmented Hailstorm Rapier","l":240,"c":36717,"t":97}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67775","obj":{"i":67775,"n":"A Spectacle for the Ages","g":4,"l":"Ishgard","s":17}},{"type":"quest","id":"67777","obj":{"i":67777,"n":"Causes and Costs","g":4,"l":"Coerthas Western Highlands","s":19}}]}