{"quest":{"name":"Consequences","location":"Coerthas Western Highlands","id":67773,"patch":3.2,"sort":15,"eventIcon":71201,"issuer":1016580,"target":1016579,"involved":[1016069,1016070,1016071,1016077,1016568,1016569,1016570,1016578,1016581,1016582],"genre":4,"journal":["Thancred would like nothing more than to leave Falcon's Nest behind.","Recalling that Lord Artoirel and the first commander should have returned by now, Thancred makes for the tavern where Lord Emmanellain has taken shelter. Under the circumstances, he doubts very much that the lordling has left─and that the other two will surely wish to have words.","With tired eyes, Lucia briefs you on the latest developments, aided by a grim-faced Lord Artoirel. They reveal that the incident at the Convictory was more than likely a ruse intended to draw them away from the hamlet, and that the protest leader, while gravely wounded, yet lives. Their report concluded, you share your own assessment─that while order was restored, the people's faith in Ser Aymeric and his initiative has been gravely shaken. Head bowed, Lucia solemnly acknowledges that she has no choice but to call a halt to proceedings. Lord Artoirel duly orders his brother to return to Ishgard and answer for his actions, and he sullenly acquiesces, calling for his manservant to accompany him. Honoroit, however, is nowhere to be seen. Rising to his feet in a panic, Emmanellain casts about for the missing boy, before dashing outside to search for him.","You come upon a badly beaten Honoroit at the airship landing, moments before Thancred and Lord Emmanellain arrive. As the lordling calls out to the young boy, he opens his eyes, explaining that he attempted to dissuade the smallfolk from leaving─a request which invited violent reprisal from those who resented Lord Emmanellain for his role in ending the protest. After offering some words of comfort, the child's eyes close once more, prompting his master to loudly bemoan the circumstances of his failure. His continued refusal to accept responsibility grates your ears, and you step forward to speak─only to be stopped by Thancred, who proceeds to scold Emmanellain himself. Overcome with rage at the unflappable Archon's lecturing, the lordling unwisely lashes out, declaring that the man has never felt the sting of failure. Thancred, in turn, deals Lord Emmanellain a swingeing blow, snarling that he knows nothing of him and his failures. With that, he storms off, leaving the lordling to nurse his rapidly swelling jaw.","Thankfully, Thancred has regained his composure for the most part when you find him. Though he admits he may have overreacted, he does not regret his actions, for he knows from personal experience that there is little to be gained from refusing to acknowledge your mistakes. Such is the reason he offers as explanation for his behavior, but you cannot help wondering if he is being honest with you─or with himself."],"objectives":["Speak with Lucia.","Search for Honoroit.","Speak with Thancred."],"dialogue":[{"name":"EMMANELLAIN","text":"..."},{"name":"CITIZENA02233","text":"We cannot dishonor their memory. We must remember why they fought and died."},{"name":"CITIZENB02233","text":"You were there, were you not? Then you must have seen it in the people's eyes. Not even Ser Aymeric could convince them to return."},{"name":"CITIZENC02233","text":"The hells with them blue bloods. Can't believe I thought they might give half a damn about us. You can bet I won't be making that mistake again."},{"name":"THANCRED","text":"Lord Artoirel and the first commander should have returned by now."},{"name":"THANCRED","text":"To the tavern, then. Their first order of business will be to speak with Lord Emmanellain, and I somehow doubt that he has moved an ilm since last we saw him."},{"name":"ARTOIREL","text":"Fury take me, what a disaster... I should never have left."},{"name":"LUCIA","text":"My apologies, <span class=\"highlight\">Forename</span>. I bear full responsibility for this...debacle."},{"name":"THANCRED","text":"There will be time for that later. I, for one, am more concerned about picking up the pieces. What do we know?"},{"name":"LUCIA","text":"According to initial reports, the protest was orchestrated by the young woman whom Lord Emmanellain ordered shot. She and her conspirators infiltrated Falcon's Nest posing as servants and guests."},{"name":"LUCIA","text":"Several were taken alive. Others resisted and were struck down. Still others took their own lives."},{"name":"LUCIA","text":"Our forces suffered casualties as well, but by the grace of the Fury, no civilians were seriously injured."},{"name":"LUCIA","text":"Still more remarkably, the ringleader yet lives─for the time being, at least. The chirurgeons are doing what they can for her, but she may not live through the night."},{"name":"ARTOIREL","text":"Given their impeccable timing, it is like that the Convictors who drew us away from the hamlet were in league with the protesters. Accordingly, we have detained them for questioning."},{"name":"ARTOIREL","text":"&lt;sigh&gt; I'll be sworn that these villains spent as much effort plotting the failure of this peace conference as we did its success."},{"name":"THANCRED","text":"Well, if the mood of the hamlet is any indication, theirs have been the more fruitful labors. In the wake of the protest, the people seem disillusioned."},{"name":"LUCIA","text":"You spoke with them, then? I see..."},{"name":"LUCIA","text":"...Ser Aymeric placed his trust in me. It will be difficult to explain what has happened here."},{"name":"ARTOIREL","text":"Remember how far we have come, First Commander. The people's faith may be shaken, but we convinced them before, and will do so again."},{"name":"ARTOIREL","text":"If we can but find a means to remind them─to show them once more the promise that change holds for all─then this tragedy too shall pass into the past."},{"name":"LUCIA","text":"We must pray that you are right. Nevertheless, for the time being, I have no choice but to suspend the peace conference, pending Ser Aymeric's final decision."},{"name":"LUCIA","text":"Under the circumstances, I cannot leave Falcon's Nest. <span class=\"highlight\">Forename</span>, will you deliver my report to the lord commander in my stead?"},{"name":"ARTOIREL","text":"Get up, Emmanellain. You're going with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"EMMANELLAIN","text":"Go on without me."},{"name":"ARTOIREL","text":"...I was not asking."},{"name":"ARTOIREL","text":"You will answer for your actions. In person. Is that clear?"},{"name":"EMMANELLAIN","text":"...Yes, my lord.<br>Come, Honoroit."},{"name":"THANCRED","text":"Your manservant is not here. In fact, I have not seen him for some time..."},{"name":"EMMANELLAIN","text":"Honoroit...? Honoroit! I could have sworn he was..."},{"name":"LUCIA","text":"Once I have determined that my presence is no longer required, I will return to the capital as well. Pray give my regards to the lord commander."},{"name":"ARTOIREL","text":"I too had best remain here for a time. I should hope that the worst has passed, but it is too early to say for certain."},{"name":"EMMANELLAIN","text":"Where are you, where are you...!?"},{"name":"THANCRED","text":"Odd. The boy struck me as the rather devoted type. What reason would he have to leave his master unattended for so long?"},{"name":"HONOROIT","text":"..."},{"name":"EMMANELLAIN","text":"I will take him to the chirurgeons! It is...it is the least I can do."},{"name":"THANCRED","text":"...I may have overreacted. But it needed to be done. He was becoming hysterical."},{"name":"THANCRED","text":"I understand the desire to look for reasons. For excuses. To convince yourself you had no choice."},{"name":"THANCRED","text":"But the past is the past, and there is naught to be gained from reliving your mistakes. I know this. I <span class=\"emphasis\">know</span> this. But he..."}],"reward":{"gil":680,"items":[{"id":14388,"one":1},{"id":14390,"one":1},{"id":14394,"one":1},{"id":20418,"one":1},{"num":4,"id":5825,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67772]},"next":[67774]},"partials":[{"type":"npc","id":"1016580","obj":{"i":1016580,"n":"Thancred","l":2200,"q":2}},{"type":"npc","id":"1016579","obj":{"i":1016579,"n":"Thancred","l":2200,"q":3}},{"type":"npc","id":"1016069","obj":{"i":1016069,"n":"Lucia","l":2200,"q":2}},{"type":"npc","id":"1016070","obj":{"i":1016070,"n":"Artoirel","l":2200,"q":2}},{"type":"npc","id":"1016071","obj":{"i":1016071,"n":"Emmanellain","l":2200,"q":1}},{"type":"npc","id":"1016077","obj":{"i":1016077,"n":"Thancred","l":2200,"q":3}},{"type":"npc","id":"1016568","obj":{"i":1016568,"n":"Lowborn Youth","l":2200,"q":6}},{"type":"npc","id":"1016569","obj":{"i":1016569,"n":"Highborn Merchant","l":2200,"q":6}},{"type":"npc","id":"1016570","obj":{"i":1016570,"n":"Spirited Stonecutter","l":2200,"q":6}},{"type":"npc","id":"1016578","obj":{"i":1016578,"n":"Emmanellain","l":2200,"q":2}},{"type":"npc","id":"1016581","obj":{"i":1016581,"n":"Honoroit","l":2200,"q":1}},{"type":"npc","id":"1016582","obj":{"i":1016582,"n":"Emmanellain","l":2200,"q":1}},{"type":"item","id":"14388","obj":{"i":14388,"n":"Augmented Hellfire Blade","l":240,"c":30541,"t":2}},{"type":"item","id":"14390","obj":{"i":14390,"n":"Augmented Hellfire Battleaxe","l":240,"c":31514,"t":3}},{"type":"item","id":"14394","obj":{"i":14394,"n":"Augmented Hellfire Guillotine","l":240,"c":34265,"t":87}},{"type":"item","id":"20418","obj":{"i":20418,"n":"Augmented Hellfire Katana","l":240,"c":36408,"t":96}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67772","obj":{"i":67772,"n":"For Those We Have Lost","g":4,"l":"Coerthas Western Highlands","s":14}},{"type":"quest","id":"67774","obj":{"i":67774,"n":"Choices","g":4,"l":"Coerthas Western Highlands","s":16}}]}