{"quest":{"name":"An Ally for Ishgard","location":"Ishgard","id":67779,"patch":3.3,"sort":21,"eventIcon":71201,"issuer":1016818,"target":1011935,"involved":[1012326,1013040,1013076,1016824,1016881],"genre":4,"journal":["Alphinaud is eager to hear what tidings Ser Aymeric has to share.","It would seem that Ser Aymeric has a favor to ask. Now that Nidhogg is possessed of both of his eyes, the lord commander believes that there is only one being capable of standing against the vengeful shade─Nidhogg's own brood-brother, Hraesvelgr. As such, he would have you escort him to Zenith, and aid him in convincing the great wyrm to stand with Ishgard. Though Alphinaud harbors understandable doubts as to the wisdom of this course, it is plain that Ser Aymeric will not be swayed. Notify the lord commander when you are ready to depart.","Though Ser Aymeric is ready to ascend Sohm Al, he acquiesces to Alphinaud's suggestion that you first visit Vidofnir at Anyx Trine. Travel to the Dravanian forelands, and speak with the wounded dragon.","Vidofnir dismisses your concern regarding her injury, but can offer little in the way of hope for your intended audience with her sire. Disheartened but not dissuaded, Ser Aymeric resolves to press on into the Churning Mists."],"objectives":["Speak with Ser Aymeric.","Speak with Vidofnir in Anyx Trine."],"dialogue":[{"name":"ALPHINAUD","text":"Hmmm... Might Ser Aymeric perchance have received word of a Dravanian advance?"},{"name":"ALPHINAUD","text":"...Or mayhap they have located Esti─ That is to say, mayhap Nidhogg has been found!"},{"name":"ALPHINAUD","text":"Come! I would hear what the lord commander has to say!"},{"name":"ALPHINAUD","text":"I somehow doubt that Hraesvelgr will be pleased to see us. But for Estinien's sake, and that of countless others, I suppose we must risk his displeasure."},{"name":"TATARU","text":"I think I'll stay here at the Knight for the time being. After all, the rumors are fresh and the extra coin won't go amiss!"},{"name":"AYMERIC","text":"It grieves me to impose upon you in this manner, but you of all people understand the threat we now face."},{"name":"ALPHINAUD","text":"It is no imposition, Ser Aymeric─to <span class=\"highlight\">Forename</span> and I, Ishgard is as a second home."},{"name":"ALPHINAUD","text":"After the many battles we have fought and the bonds we have forged, the plight of your nation has become our own. If there is aught that we can do to aid in its salvation, then pray impose all you must."},{"name":"AYMERIC","text":"You are true friends..."},{"name":"ALPHINAUD","text":"Shall we be about our task, then? We have no way of knowing when Nidhogg's shade will strike, but we must assume that time is not our ally."},{"name":"AYMERIC","text":"Indeed. With that in mind, I have taken the liberty of dispatching a messenger to inform Mistress Tataru that you will be escorting me to Sohm Al. I confess, I did not provide the exact details of our destination, as they are as yet unknown to me..."},{"name":"ALPHINAUD","text":"We will summon Hraesvelgr at Zenith in the Churning Mists. Ere we begin our ascent, however, I think it best that we pay a visit to Anyx Trine."},{"name":"AYMERIC","text":"You seek an advantage in the coming negotiations?"},{"name":"ALPHINAUD","text":"I do. I would consult with Vidofnir."},{"name":"ALPHINAUD","text":"I propose this in part out of concern for her condition. Were she to succumb to her wounds, it could have grave consequences for our alliance. That apart, she may be able to provide insight into her sire's current state of mind."},{"name":"AYMERIC","text":"Well reasoned. To the Dravanian forelands, then."},{"name":"TATARU","text":"A nice young knight told me you were off to negotiate with Hraesvelgr again. Have you considered using the Manderville art of parley? It's surprisingly effective, you know!"},{"name":"VIDOFNIR","text":"Ah, 'tis the warrior of warriors and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> companions. What bringeth you to mine abode?"},{"name":"ALPHINAUD","text":"Pray forgive us for disturbing your recuperation, Vidofnir. I hope your wound does not pain you overmuch..."},{"name":"VIDOFNIR","text":"Didst thou imagine me close to death? The thrust was deep, but not mortal. I will heal in time."},{"name":"AYMERIC","text":"Full glad am I to hear it. You were the guest of honor at our conference, and we failed in our duty of protection. On behalf of Ishgard, I apologize unreservedly."},{"name":"VIDOFNIR","text":"...I am a dragon full-grown, and thou thought to protect <span class=\"emphasis\">me</span>, mortal? I was tempered by the fires of battle ere thy great-grandsire learned to crawl."},{"name":"VIDOFNIR","text":"Thy words do remind me of a knight whom I called friend some thousand years past. He swore to defend me from harm and hardship..."},{"name":"AYMERIC","text":"Would that we could return to that era of peace, when man and dragon knew such comradeship."},{"name":"ALPHINAUD","text":"Would that our every effort to do so were not undone by ancient rancor..."},{"name":"VIDOFNIR","text":"For a truth, there can be no peace while Nidhogg's shade yet lingereth."},{"name":"ALPHINAUD","text":"That much is plain─yet we lack the strength to banish him. Thus do we make for Sohm Al, to beseech the aid of your sire once more."},{"name":"VIDOFNIR","text":"Folly. Thou know'st as well as I how he will answer."},{"name":"AYMERIC","text":"...Hraesvelgr's heart remains unchanged, then. A pity.<br>But if it is folly to hope, I am content to die a fool."},{"name":"VIDOFNIR","text":"As hath ever been the way with thy kind. Go then, but be warned: the shade's presence hath driven its minions to frenzy."},{"name":"ALPHINAUD","text":"Thank you, Vidofnir. We shall disturb your rest no longer."},{"name":"LUCIA","text":"（★未使用／削除予定★）"},{"name":"HANDELOUP","text":"（★未使用／削除予定★）"},{"name":"HILDA","text":"（★未使用／削除予定★）"},{"name":"SYMME","text":"（★未使用／削除予定★）"},{"name":"EUDESTAND","text":"（★未使用／削除予定★）"}],"reward":{"gil":1031,"items":[{"id":14136,"one":1},{"id":14137,"one":1},{"id":14138,"one":1},{"id":14135,"one":1},{"id":14134,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67778]},"next":[67780]},"partials":[{"type":"npc","id":"1016818","obj":{"i":1016818,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1011935","obj":{"i":1011935,"n":"Vidofnir","l":2000,"q":10}},{"type":"npc","id":"1012326","obj":{"i":1012326,"n":"Tataru","l":2300,"q":3}},{"type":"npc","id":"1013040","obj":{"i":1013040,"n":"Tataru","l":2300,"q":3}},{"type":"npc","id":"1013076","obj":{"i":1013076,"n":"Alphinaud","l":2300,"q":2}},{"type":"npc","id":"1016824","obj":{"i":1016824,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1016881","obj":{"i":1016881,"n":"Aymeric","l":2300,"q":1}},{"type":"item","id":"14136","obj":{"i":14136,"n":"Peperoncino","l":180,"c":24016,"t":46}},{"type":"item","id":"14137","obj":{"i":14137,"n":"Boscaiola","l":210,"c":24017,"t":46}},{"type":"item","id":"14138","obj":{"i":14138,"n":"Loaghtan Steak","l":210,"c":24355,"t":46}},{"type":"item","id":"14135","obj":{"i":14135,"n":"Apple Strudel","l":210,"c":24079,"t":46}},{"type":"item","id":"14134","obj":{"i":14134,"n":"Spiced Cider","l":180,"c":24405,"t":46}},{"type":"quest","id":"67778","obj":{"i":67778,"n":"The Man Within","g":4,"l":"Ishgard","s":20}},{"type":"quest","id":"67780","obj":{"i":67780,"n":"Winning Over the Wyrm","g":4,"l":"The Dravanian Forelands","s":22}}]}