{"quest":{"name":"Winning Over the Wyrm","location":"The Dravanian Forelands","id":67780,"patch":3.3,"sort":22,"icon":100559,"eventIcon":71201,"issuer":1016819,"target":1017011,"involved":[1012078,1015983,1016810,1016811,1016812,1016813,1016822,1016825,1016882,1017022,1017023],"genre":4,"journal":["Alphinaud seems eager to press on.","Despite Vidofnir's predictably gloomy appraisal of your chances, Alphinaud is resolved to lead Ser Aymeric to the summit of Sohm Al. Rejoin your companions outside Moghome, and signal your readiness to depart to the lord commander.","As Ser Aymeric shares his wonder at the incredible vista, you are suddenly hailed by Moghan, the moogle who first guided you to Zenith. Upon learning of your purpose in the Churning Mists, he assures you that the winds are perfect for carrying your call to Hraesvelgr's ears. Make your way to Zenith, and blow the moogles' horn once more.","You look on as Hraesvelgr descends from the clouds, just as he did when first you came to Zenith─and wince inwardly as he greets your request for aid with the selfsame scorn. Undaunted, Aymeric and Alphinaud strive to win the great wyrm round with eloquence and reason, but it is not until Midgardsormr himself appears that Hraesvelgr finally assents to test you and your companions' resolve. Consult with Ser Aymeric on how best to approach the forthcoming trial.","Ser Aymeric informs you that he observed a wyvern landing just outside the palace, and concludes that it must be one of the “children” of whom Hraesvelgr spoke. Accost the waiting dragon.","It would seem that the wyvern has come to bear you to the scene of your ordeal. Steel yourself, body and mind, for the trials of so ancient and powerful a being as Hraesvelgr are not like to be simple...nor less forgiving.<br><br>※Challenge Sohr Khai with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","You have weathered the trial of the great wyrm. Before returning to Zenith, it would seem wise to speak with Hraesvelgr.","Hraesvelgr commends you and your companions for your unwavering determination, and pledges to aid you in the coming battle with Nidhogg. Inquire of Alphinaud how he fared in his own trial.","Your trials completed, Alphinaud ponders how much time you have to prepare for Nidhogg's assault. Scarcely have the words left his lips, however, when a thunderous roar echoes across the sky, signaling the advance of the Dravanian Horde. The time has come for the final reckoning with Nidhogg─to bring an end to his wrathful song."],"objectives":["Speak with Ser Aymeric outside Moghome.","Blow the horn on the top floor of Zenith.","Speak with Ser Aymeric.","Speak with the imperious wyvern.","Enter Sohr Khai.","Speak with Alphinaud."],"dialogue":[{"name":"AYMERIC","text":"Lucia's report described Anyx Trine in detail, but her words failed to convey the overwhelming <span class=\"emphasis\">strangeness</span> of standing here in the demesne of dragons."},{"name":"ALPHINAUD","text":"Though I expected no better answer from Vidofnir, I take little pleasure from having been proven right. 'Twould seem that our presence at Zenith will be every bit as unwelcome as I had anticipated. But what is the ire of one great wyrm to a trio of self-confessed fools such as ourselves?<br>Let us begin our ascent."},{"name":"AYMERIC","text":"After you, Master Alphinaud."},{"name":"ALPHINAUD","text":"Scout ahead if you wish, <span class=\"highlight\">Forename</span>. We shall join you outside Moghome!"},{"name":"ALPHINAUD","text":"The lord commander seems lost for words. Nor can I blame him. I recall being similarly awestruck when I first beheld this vista."},{"name":"AYMERIC","text":"I had heard tales of the world above the clouds, but never did I dream...<br>One's mind paints a pale picture of its majesty."},{"name":"ALPHINAUD","text":"Few live to see such wonders. I am reminded of my first visit to this peak, when Estinien and Ysayle yet walked at our side..."},{"name":"MOGHAN","text":"(-Churning Mists Moogle-)Kupopo? Is that you, <span class=\"highlight\">Forename</span>?"},{"name":"ALPHINAUD","text":"Ah, if it isn't Mog... Mog...uh..."},{"name":"MOGHAN","text":"(-Churning Mists Moogle-)Don't tell me you've forgotten my name, kupo!? After all we've been through together!"},{"name":"MOGHAN","text":"(-Churning Mists Moogle-)But at least <span class=\"emphasis\">you</span> remember me!<br>You...you <span class=\"emphasis\">do</span> remember me, don't you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"Do you remember the moogle?"},{"name":"A1","text":"How could I forget you, Moglin!"},{"name":"A1","text":"Of course I do, Moghan!"},{"name":"A1","text":"Apologies, friend, but all moogles look the same to me..."},{"name":"MOGHAN","text":"(-Churning Mists Moogle-)H-How could you mistake me for that overstuffed throne-warmer!? I'm Moghan! The courageous moogle who guided you to Zenith, kupo!"},{"name":"MOGHAN","text":"(-Churning Mists Moogle-)Phew! You seemed a bit hesitant for a moment there! But I'm sure you were just fondly recalling the time we camped near Zenith, right, kupo?"},{"name":"MOGHAN","text":"(-Churning Mists Moogle-)...I see, kupo. Then I suppose our time around the campfire meant less to you than I thought it did. It's “Moghan,” by the way... &lt;sniff&gt;"},{"name":"MOGHAN","text":"But putting our shared history to one side, what brings you and your friends to Moghome, kupo?"},{"name":"MOGHAN","text":"Ah, another audience with old Hraesvelgr..."},{"name":"MOGHAN","text":"Well, I hope you've brought the horn, kupo! With the winds as gentle as they are, a good loud toot should reach the great wyrm's ears easily enough!"},{"name":"ALPHINAUD","text":"That is good to hear, Moghan─thank you. We had best press on to Zenith, while the winds are in our favor."},{"name":"MOGHAN","text":"Now that was unexpected, kupo. Chieftain Moglin will want to hear about this!"},{"name":"MOGHAN","text":"Did you meet with Hraesvelgr already, kupo? You never know when the winds will pick up again!"},{"name":"ALPHINAUD","text":"Pray sound the horn, <span class=\"highlight\">Forename</span>."},{"name":"AYMERIC","text":"We <span class=\"emphasis\">must</span> win Hraesvelgr to our cause. Fail in this and Ishgard's fate is all but sealed."},{"name":"ALPHINAUD","text":"Another day, another trial. Such ordeals must seem almost mundane to you by now. Would that I could say the same."},{"name":"AYMERIC","text":"For the sake of Ishgard, I shall overcome whatever trial is placed before me. And I have no doubt that you will do the same, <span class=\"highlight\">Forename</span>."},{"name":"AYMERIC","text":"I believe I spied a wyvern landing just outside the palace. It is doubtless one of the “children” of whom Hraesvelgr spoke."},{"name":"AYMERIC","text":"Come, my friends: let us not keep our escort waiting."},{"name":"WYVERN02244","text":"My broodmates and I will bear you to the place of your trial. Make your preparations."},{"name":"WYVERN02244","text":"Great Hraesvelgr honors you with this trial. Prepare to be sorely tested..."},{"name":"WYVERN02244","text":"You have proven yourself in the eyes of great Hraesvelgr. I did not think such a thing possible..."},{"name":"AYMERIC","text":"Countless times have I fought the minions of Nidhogg, but never did I imagine that I would one day face Hraesvelgr himself."},{"name":"ALPHINAUD","text":"Oh...ohhh... Oh, my poor ribs... That was a painful reminder of a great wyrm's might..."},{"name":"AYMERIC","text":"And had he truly meant us harm, we would not be standing here now. Plainly, his intent was to teach. His onslaught forced me to recall my training─about the speed of the dragon, his balance, his blind spots... It was, in short, a very thorough lesson."},{"name":"MOGLIN","text":"Ow-ow-ow-ow-ow...kupo. <span class=\"highlight\">Forename</span>, let me begin by congratulating you on the completion of your trial."},{"name":"MOGLIN","text":"For one with a name more befitting a jester, you fight with the savagery of a rabid demon."},{"name":"MOGLIN","text":"Do you see how my wings are kinked? Even my pom aches! After this drubbing, I fear my loyal subjects will have to bear the load of my personal chores for quite some time, kupo. Possibly indefinitely."},{"name":"MOGHAN","text":"What!? When I told you about <span class=\"highlight\">Forename</span>'s trial, I didn't mean for the <span class=\"emphasis\">rest of us</span> to suffer..."},{"name":"MOGLIN","text":"...That's <span class=\"emphasis\">triple</span> shifts for you, Moghan."},{"name":"MOGHAN","text":"&lt;splutter&gt; <span class=\"emphasis\">Triple</span>!? But that's not fair!!!<br>There's no justice, kupo... None at all!"},{"name":"VIDOFNIR","text":"（★未使用／削除予定★）"}],"reward":{"gil":5000,"items":[{"num":5,"id":13637,"one":1},{"num":5,"id":13638,"one":1}],"xp":16740,"instance":44},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67779]},"next":[67781]},"partials":[{"type":"npc","id":"1016819","obj":{"i":1016819,"n":"Alphinaud","l":2000,"q":1}},{"type":"npc","id":"1017011","obj":{"i":1017011,"n":"Alphinaud","l":2002,"q":1}},{"type":"npc","id":"1012078","obj":{"i":1012078,"n":"Moghan","l":2002,"q":6}},{"type":"npc","id":"1015983","obj":{"i":1015983,"n":"Alphinaud","l":2000,"q":3}},{"type":"npc","id":"1016810","obj":{"i":1016810,"n":"Aymeric","l":2000,"q":1}},{"type":"npc","id":"1016811","obj":{"i":1016811,"n":"Aymeric","l":2002,"q":1}},{"type":"npc","id":"1016812","obj":{"i":1016812,"n":"Imperious Wyvern","l":2002,"q":1}},{"type":"npc","id":"1016813","obj":{"i":1016813,"n":"Aymeric","l":2002,"q":2}},{"type":"npc","id":"1016822","obj":{"i":1016822,"n":"Alphinaud","l":2002,"q":1}},{"type":"npc","id":"1016825","obj":{"i":1016825,"n":"Alphinaud","l":2002,"q":1}},{"type":"npc","id":"1016882","obj":{"i":1016882,"n":"Aymeric","l":2002,"q":1}},{"type":"npc","id":"1017022","obj":{"i":1017022,"n":"Alphinaud","l":2002,"q":1}},{"type":"npc","id":"1017023","obj":{"i":1017023,"n":"Aymeric","l":2002,"q":1}},{"type":"item","id":"13637","obj":{"i":13637,"n":"Max-Potion","l":150,"c":20601,"t":44}},{"type":"item","id":"13638","obj":{"i":13638,"n":"Max-Ether","l":150,"c":20621,"t":44}},{"type":"instance","id":"44","obj":{"i":44,"n":"Sohr Khai","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":200}},{"type":"quest","id":"67779","obj":{"i":67779,"n":"An Ally for Ishgard","g":4,"l":"Ishgard","s":21}},{"type":"quest","id":"67781","obj":{"i":67781,"n":"An End to the Song","g":4,"l":"The Churning Mists","s":23}}]}