{"quest":{"name":"Litany of Peace","location":"Ishgard","id":67783,"patch":3.3,"sort":25,"icon":100561,"eventIcon":71201,"issuer":1012380,"target":1012857,"involved":[1012163,1012858,1013167,1016823,1016827,1016828],"genre":4,"journal":["Aymeric appears lost in nostalgia.","Ser Aymeric relates a small part of his and Estinien's shared history, and muses on the brotherly bond which has formed between Alphinaud and the gruff dragoon. His thoughts are interrupted, however, by the sudden arrival of a messenger who urges the lord commander to visit the infirmary immediately. Trouble Ser Aymeric for news of your ailing comrade's condition.","Having followed Ser Aymeric to the infirmary, you are relieved to find Estinien in full possession of his senses and already mocking the openly weeping Alphinaud. You sense, however, that he is a changed man. Having spoken of his spirit's enslavement by Nidhogg, he declares at last that he intends to surrender the mantle of Azure Dragoon, his hunt now at an end.<br><br>Echoing Estinien's resolve, Ser Aymeric finally moves to abolish the thousand-year rule of the archbishops, paving the way for a new republic. In the days that follow, Ishgard's governance is placed in the hands of a newly formed House of Commons and House of Lords. And though Ser Aymeric would like nothing more than to lay down the reins of state, he soon finds himself elected to the highest seat in the latter.<br><br>You, meanwhile, borrow Midgardsormr's wings to escort Hraesvelgr back to Zenith, and find the former lord commander waiting to greet you upon your return. Speak with Ser Aymeric at the airship landing.","Ser Aymeric is clearly burdened by his new position, but is quick to stifle his complaints, vowing to lead Ishgard into a new era of peace─one measured step at a time. He then reveals that Estinien has disappeared, and asks that you give him a message should your paths ever chance to cross. Finally, Ser Aymeric bids you convey his warmest regards to Alphinaud. Return to Fortemps Manor, and seek him out.","Alphinaud appears certain that Ser Aymeric will make good on his promise to lead the people of Ishgard safely along their chosen road, though the way be choked with the debris of history. The Scions, too, have a difficult path ahead of them─bringing about a new dawn will be no easy task in the shadow of Ascian plots and implacable primals. But as the final strains of the Dragonsong War drift gently heavensward and a newborn litany of peace swells to take its place, it cannot be denied that there is much to celebrate."],"objectives":["Speak with Ser Aymeric.","Speak with Alphinaud at Fortemps Manor."],"dialogue":[{"name":"AYMERIC","text":"My own friendship with Estinien began some ten years past, shortly after we joined the Temple Knights..."},{"name":"AYMERIC","text":"I learned his name soon enough, but Estinien barely registered my existence. I was less a fellow recruit, and more a shadow which occasionally darkened his path."},{"name":"AYMERIC","text":"And so I might have remained, had fate not seen fit to intervene. While out on patrol, our company was set upon by a dragon, and we were the only two to survive. The experience forged a bond between us, as such life-threatening situations are wont to do."},{"name":"AYMERIC","text":"Despite our friendship, he remained an intense and solitary youth, wholly obsessed with claiming vengeance against Nidhogg. Revenge was ever at the forefront of his mind─revenge for the death of his parents, and revenge for his younger brother."},{"name":"AYMERIC","text":"I would venture that in Alphinaud he sees something of his lost sibling."},{"name":"AYMERIC","text":"And in the ungentle chidings of Estinien, Alphinaud has found the elder brother he never had."},{"name":"AYMERIC","text":"Truth be told, Estinien's tactless observations have saved me from disaster more than once, and I can well understand Alphinaud's affection for him. He is a friend for whom I would gladly─"},{"name":"TEMPLEKNIGHT02247","text":"Lord Commander! Your presence is required in the infirmary!"},{"name":"AYMERIC","text":"Is he─ Tell them I am on my way!"},{"name":"LUCIA","text":"&lt;sigh&gt; So it is over, then..."},{"name":"TEMPLEKNIGHT02247","text":"Captain Whitecape ordered me to fetch Ser Aymeric with all haste. I know no more than that."},{"name":"HANDELOUP","text":"I did not take the Azure Dragoon for a man to pass in his bed..."},{"name":"AYMERIC","text":"Quickly, <span class=\"highlight\">Forename</span>! We must go to him!"},{"name":"SYSTEM","text":"Upon proceeding to the infirmary, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"Q1","text":"Proceed to the infirmary?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"AYMERIC","text":"I was gazing out at the Sea of Clouds, in an all too rare moment of idleness, when I chanced to behold a certain hero wending <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> way towards the city on dragonback. Welcome home, <span class=\"highlight\">Forename</span>."},{"name":"AYMERIC","text":"Nay, 'twas no grave matter that moved me to greet you in person. Between you and me, I merely sought respite from the pressures of office... No sooner do I surrender my role as temporary head of state than I am burdened with a position of more <span class=\"emphasis\">permanent</span> responsibility!"},{"name":"AYMERIC","text":"I fancy that it echoes in some small measure the way you must feel when your improbable feats of heroism are rewarded with still more impossible challenges..."},{"name":"AYMERIC","text":"The myth which guided our society for generations lies in tatters─am I then to be scorned for building upon the system of nobility that I once sought to tear down? And what strange jest is this that places me at its pinnacle? An archbishop's bastard at the head of the House of Lords..."},{"name":"AYMERIC","text":"...Ah, but these questions are for me to answer."},{"name":"AYMERIC","text":"It is not in man's nature to change overnight. This I learned through painful experience. And it was this hard lesson which convinced me to take the path which we now follow. Even as we rebuild the bridge between man and dragon, so must we reimagine Ishgard─one carefully placed stone at a time."},{"name":"AYMERIC","text":"We must remember that it is not for us that we lay this groundwork, but for the men and women that our children will become. May their towers rise proudly from the fundament of our legacy."},{"name":"AYMERIC","text":"...I hear word from Captain Whitecape that Estinien has vanished from his sickroom. His willfulness survives undiminished."},{"name":"AYMERIC","text":"Should you ever happen upon our unmannerly friend on your travels, pray assure him that I shall keep Ishgard safe until he deigns to come home."},{"name":"AYMERIC","text":"Thank you, <span class=\"highlight\">Forename</span>. And please, convey my warmest regards to Master Alphinaud."},{"name":"TATARU","text":"You've saved the day again, <span class=\"highlight\">Forename</span>!<br>...Not that I ever doubted you would!"},{"name":"ALPHINAUD","text":"You spoke with Ser Aymeric? I do not envy him his new position."},{"name":"ALPHINAUD","text":"Ishgard has chosen a new road, but one littered with the detritus of a thousand years of broken faith."},{"name":"ALPHINAUD","text":"Yet though her people may stumble from time to time, I know of none better than Ser Aymeric to lead the march of progress."},{"name":"ALPHINAUD","text":"As for us, there remains the small matter of ushering in a new dawn in the shadow of inscrutable Ascian machinations and a seemingly endless procession of primals... But we too must walk our chosen path─no matter how treacherous the footing!"},{"name":"SYSTEM","text":"In the wake of Ishgard's governmental reform, new airship routes have been sanctioned. You may now travel to a selection of distant locales from the landing in Ishgard."},{"name":"WARRIOROFDARKNESS","text":"Thank you, Blanhaerz. Nay, you need not remain there. We shall rendezvous at the usual place."},{"name":"ELIDIBUS","text":"All is proceeding as expected, then?"},{"name":"WARRIOROFDARKNESS","text":"Aye, there is naught to concern us. Aside from one overly curious mouse..."},{"name":"THANCRED","text":"This way!"},{"name":"WARRIOROFDARKNESS","text":"Him again..."},{"name":"ELIDIBUS","text":"It is of no moment. They will play their part, and we will play ours..."}],"reward":{"gil":10000,"items":[{"id":15444},{"id":15830},{"id":15854}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67782]},"next":[67011,67825,67877,69208,69268,69708]},"partials":[{"type":"npc","id":"1012380","obj":{"i":1012380,"n":"Aymeric","l":2300,"q":5}},{"type":"npc","id":"1012857","obj":{"i":1012857,"n":"Alphinaud","l":2320,"q":4}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1012858","obj":{"i":1012858,"n":"Tataru","l":2320,"q":2}},{"type":"npc","id":"1013167","obj":{"i":1013167,"n":"Lucia","l":2300,"q":10}},{"type":"npc","id":"1016823","obj":{"i":1016823,"n":"Aymeric","l":2300,"q":1}},{"type":"npc","id":"1016827","obj":{"i":1016827,"n":"Temple Herald","l":2300,"q":1}},{"type":"npc","id":"1016828","obj":{"i":1016828,"n":"Aymeric","l":2301,"q":1}},{"type":"item","id":"15444","obj":{"i":15444,"n":"Wind-up Aymeric","l":1,"c":59606,"t":81}},{"type":"item","id":"15830","obj":{"i":15830,"n":"Dragonsong Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"15854","obj":{"i":15854,"n":"Alpine Coat","l":1,"c":42529,"t":35,"p":100}},{"type":"quest","id":"67782","obj":{"i":67782,"n":"Heroes of the Hour","g":4,"l":"Ishgard","s":24}},{"type":"quest","id":"67011","obj":{"i":67011,"n":"The Paths We Walk","g":65,"l":"Fortemps Manor","s":60}},{"type":"quest","id":"67825","obj":{"i":67825,"n":"Nidhogg's Rage","g":95,"l":"Mor Dhona","s":602,"f":1}},{"type":"quest","id":"67877","obj":{"i":67877,"n":"Promises Kept","g":5,"l":"Ishgard","s":1}},{"type":"quest","id":"69208","obj":{"i":69208,"n":"Towards the Firmament","g":83,"l":"Ishgard","s":1,"f":1}},{"type":"quest","id":"69268","obj":{"i":69268,"n":"Into the Blue Again","g":166,"l":"Ul'dah","s":502,"f":1}},{"type":"quest","id":"69708","obj":{"i":69708,"n":"Ascending to Empyreum","g":96,"l":"Ishgard","s":17001,"f":1}}]}