{"quest":{"name":"Toppling the Tyrant","location":"The Dravanian Hinterlands","id":67787,"patch":3.2,"sort":8,"icon":112130,"unlocksFunction":1,"eventIcon":71341,"issuer":1014409,"target":1013714,"involved":[1014407,1014408,1016637,1016638,1016997],"genre":16,"journal":["Roundrox's plight weighs heavy on Mide's mind.","Mide blames herself for Roundrox's capture, and is determined to mount a rescue without delay. Convinced that she is being held somewhere close to the colossus's central section, Mide bids you continue your assault through its left arm, while she looks for a route through the right. Push further into Alexander's interior and search for the stricken child.<br><br>※The Arm of the Son can be accessed via the Duty Finder.","After pressing further into the seemingly endless warren of pipes and beams, you find yourself face-to-face with the Grand Master of the Illuminati himself. After a fierce battle, you succeed in destroying Quickthinx's flying machine, and he is forced to flee. Roundrox, however, is nowhere to be seen. With no clear onward path to follow, you have little choice but to return to Bigwest Shortstop and report your progress to Backrix.","Shortly after informing Backrix of your deeds, Mide returns, claiming to have finished charting the interior of the metal giant. Before she can elaborate, however, the goblin calls her loyalty into question, accusing her of pursuing the aims of her fallen comrades. In a bid to assuage his doubts, she reveals her original motive for summoning Alexander, and reaffirms that her only wish is to meet once more with the man she loves. With Backrix seemingly placated, Mide turns to the matter of Roundrox's rescue. Reasoning that the child will be safe as long as Alexander remains immobile, she proposes disabling another of the three cores that power the primal. According to her information, the most accessible of these is situated in the left arm, not far from the scene of your battle with Quickthinx. She warns you, however, that the core is certain to be heavily guarded..."],"objectives":["Enter the Arm of the Son.","Report to Backrix."],"dialogue":[{"name":"MIDE","text":"Curse me for a fool! I should have known better than to underestimate the Illuminati. I assumed the “missing piece” in their plan was the codex fragment─but they were talking about Roundrox all along!"},{"name":"MIDE","text":"We must mount a rescue─now, without delay. To the Illuminati, she's no better than a cog in that monstrous machine!"},{"name":"MIDE","text":"It is like that she is being held somewhere in or close to Alexander's upper body. Continue your push through the left arm, and while the Illuminati are distracted I will search for a way forward."},{"name":"SYSTEM","text":"You now have access to the Arm of the Son. Midas can be accessed via the entrance at the Thaliak River."},{"name":"BIGGS","text":"Tale old as time, eh? Woman falls in love with man, man gets sucked into primal, woman tries summoning primal to be reunited with man... Load of old rot, if you ask me, but Mide seems to believe it."},{"name":"BIGGS","text":"We're all in agreement on one thing, though: an innocent child's at the mercy of the Illuminati, and it's our job to rescue her!"},{"name":"WEDGES","text":"It's all my fault! I only lost sight of Roundrox for a moment, but by the time I spied her again, the Illuminati had her surrounded!"},{"name":"WEDGES","text":"Gah! Can't I do <span class=\"emphasis\">anything</span> right!? If they hurt her, I shall never forgive myself. Please, <span class=\"highlight\">Forename</span>─<span class=\"emphasis\">please</span> bring her back safely."},{"name":"BIGGS","text":"So the master of the Illuminati himself came flying in to drive you out? Hah hah! Sounds like you've got him worried! We must be getting close!"},{"name":"WEDGE","text":"Ah, <span class=\"highlight\">Forename</span>. I hear you made short work of Quickthinx's flying machine. He will surely think twice before barging into the Shortstop uninvited again."},{"name":"WEDGE","text":"...Though I don't suppose he has any reason to come here anymore. He already has his “missing piece”... &lt;sniff&gt; Poor Roundrox... If the Illuminati have harmed her, I...I don't know what I'll do."},{"name":"BACKRIX","text":"Pssshkoh... Uplander sends Quickthinx scurrying! Illuminati think twice before threatening us again!"},{"name":"BACKRIX","text":"Uplander is nearly through left arm. Next uplander must push forward into inner parts, and save Roundrox!"},{"name":"MIDE","text":"Congratulations on your victory over Quickthinx. While you were busy dismantling his flying machine, I finished charting Alexander's interior. The chamber you reached is situated in the innermost part of the left sector, which means your next aim should be─"},{"name":"BACKRIX","text":"Pssshkoh... Backrix does not trust treasure hunter! Three years ago she summoned metal giant. Backrix wonders if she still wishes to finish mission of dead comrades..."},{"name":"MIDE","text":"...I do not blame you for doubting me. Truth be told, my former mentors often stressed that were the unthinkable to happen, it would be my burden, as the youngest, to carry on their work."},{"name":"MIDE","text":"But building the codex's perfect world was <span class=\"emphasis\">their</span> dream, not mine. I only borrowed it. As long as I was with those I held dear, I could happily have devoted myself to any cause."},{"name":"MIDE","text":"Seeing their passion, their joy─<span class=\"emphasis\">that</span> was what filled me with resolve. And it was that which drove me to collect the pieces of the codex. All their talk of learning and reason, of justice and perfection, meant little to me in itself."},{"name":"MIDE","text":"I sometimes wonder why I was able to read the <span class=\"emphasis\">Enigma Codex</span> in the first place. Mayhap it was because my youthful mind was as a blank slate, receptive to any ideal, if put convincingly enough."},{"name":"MIDE","text":"In the end, of course, it didn't matter. The primal took my friends' passion, their joy, and their idealism...and ground them into dust. Though I survived, my commitment to the cause did not. Put simply, I had no need for a perfect world without them to share it. So believe me when I tell you that I did not seek Alexander's return to realize the dreams of the dead."},{"name":"MIDE","text":"...I only wished to see him again."},{"name":"BIGGS","text":"...Meaning your leader."},{"name":"MIDE","text":"The section of Alexander you have been exploring is called “Midas,” after a king from a legend of eld."},{"name":"MIDE","text":"Midas entreated the gods for a finger that would turn all he touched into gold, and the gods duly obliged. But in his carelessness, he transformed the one he loved most in the world into a lifeless golden statue. And thus the thing he coveted became his undoing."},{"name":"MIDE","text":"So it was with me and mine. Had we but paused for a moment to consider the means, and not simply the end, mayhap my friends would still be alive. But we did not, and they are gone. My one remaining wish is simple: to speak with the man I love once more. If I could do that, I would be satisfied."},{"name":"MIDE","text":"...There. I have told you everything. Assuming no one else wishes to question my motives, I would speak of Roundrox's rescue─as was my original intent. Now listen well..."},{"name":"MIDE","text":"Alexander is divided into three main sections, each powered by an independent core."},{"name":"MIDE","text":"You have already fought your way through to the innermost part of Midas, the left arm. The core lies only a little way beyond, but you may be sure that the Illuminati will have deployed the bulk of their forces to defend it."},{"name":"WEDGE","text":"Hold on a minute... Why would they choose to keep Roundrox there? The cores are just power sources."},{"name":"MIDE","text":"You are correct. And the answer is: they wouldn't. Roundrox is most likely being held within Alexander's upper body. But the Illuminati have locked the entrances from either arm, making it impossible to enter. Our only choice is to stop the core, and in so doing stop Alexander."},{"name":"WEDGE","text":"I <span class=\"emphasis\">see</span>... Why, that's actually rather clever! The Illuminati need Roundrox to control the primal, but if it can't move, they'd have no need for her! At the very least, they'll have no choice but to keep her safe until the primal is in working order again!"},{"name":"BIGGS","text":"Activating those cores would've used up every crystal the Illuminati had. If we destroy the second one, I doubt they'll have enough to get them operational again."},{"name":"BACKRIX","text":"Pssshkoh... Do uplanders truly think metal giant can be toppled?"}],"reward":{"gil":3508,"xp":0,"instance":30032},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67786]},"next":[67788]},"partials":[{"type":"npc","id":"1014409","obj":{"i":1014409,"n":"Mide","l":2001,"q":7}},{"type":"npc","id":"1013714","obj":{"i":1013714,"n":"Backrix","l":2001,"q":6}},{"type":"npc","id":"1014407","obj":{"i":1014407,"n":"Biggs","l":2001,"q":8}},{"type":"npc","id":"1014408","obj":{"i":1014408,"n":"Wedge","l":2001,"q":10}},{"type":"npc","id":"1016637","obj":{"i":1016637,"n":"Biggs","l":2001,"q":3}},{"type":"npc","id":"1016638","obj":{"i":1016638,"n":"Mide","l":2001,"q":3}},{"type":"npc","id":"1016997","obj":{"i":1016997,"n":"Wedge","l":2001,"q":2}},{"type":"instance","id":"30032","obj":{"i":30032,"n":"Alexander - The Arm of the Son","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":200}},{"type":"quest","id":"67786","obj":{"i":67786,"n":"The Folly of Youth","g":16,"l":"The Dravanian Hinterlands","s":7,"f":1}},{"type":"quest","id":"67788","obj":{"i":67788,"n":"One Step Behind","g":16,"l":"The Dravanian Hinterlands","s":9,"f":1}}]}