{"quest":{"name":"An End to the Song","location":"The Churning Mists","id":67781,"patch":3.3,"sort":23,"icon":100560,"eventIcon":71201,"issuer":1016813,"target":1016589,"involved":[1006454,1006455,1006456,1011196,1012155,1012157,1012162,1012163,1012164,1016814,1016821],"genre":4,"journal":["Aymeric is desperate to fly to Ishgard's defense.","You and your companions settle upon the backs of Hraesvelgr and his kin, and dive through the clouds in the direction of Ishgard. Soon after, you alight, hands numb and eyes stinging, on the Steps of Faith in the midst of battle. With a mixture of surprise and scorn, Nidhogg welcomes Hraesvelgr, who attempts in vain to persuade his brother from his vengeful course. A mighty clash then ensues between the pair, from which there can be only one victor... The city's defenders watch transfixed as Hraesvelgr tumbles onto the bridge, beaten and bloody, Ishgard's fate seemingly sealed. Triumphant, Nidhogg revels in the moment, only to learn that his fallen sibling has entrusted you with a gift: one half of his power.","With Hraesvelgr's might now commingled with your own, you are become Ishgard's best and last hope of staying the rampaging Nidhogg. Slay the great wyrm's shade, and bring an end to a thousand years of fire and blood!<br><br>※The Final Steps of Faith can be accessed via the Duty Finder.","You have succeeded in subduing Nidhogg's shade. Wrest the wyrm's eyes from Estinien's armor, and rid your companion of Nidhogg's virulent spirit.","Following Alphinaud's lead, you join in the struggle to tear Nidhogg's eyes from Estinien's mail. Using every onze of your strength, you wrestle with the hateful things, arcs of crackling aether enveloping you in agony, but just when the feat appears beyond you, you appear to receive aid from a most unexpected source...<br><br>With one final heave, you succeed in separating man and wyrm, and for an instant you glimpse Nidhogg's disembodied spirit, before casting his eyes into the abyss. At long last, it is over. Having done all you can for Estinien, you watch as Ser Aymeric bears him back to Ishgard. Join Alphinaud at the Arc of the Worthy, and discuss the aftermath of the battle.","Upon returning to Ishgard, Alphinaud praises you for your victory over Nidhogg's shade. Whatever joy he feels at the dread wyrm's defeat, however, is overshadowed by his concern for the battered Estinien..."],"objectives":["Speak with Ser Aymeric.","Confront Nidhogg in the Final Steps of Faith.","Speak with Alphinaud."],"dialogue":[{"name":"AYMERIC","text":"Ishgard will not last long against Nidhogg and his Horde. We must away!"},{"name":"ALPHINAUD","text":"I pray we are not too late..."},{"name":"TEMPLEKNIGHTB02245","text":"You would venture onto the Steps of Faith?"},{"name":"SCENE00017","text":"Proceed to the Steps of Faith?"},{"name":"SCENE00017","text":"Yes"},{"name":"SCENE00017","text":"No"},{"name":"BELTARDOIS","text":"The Horde shall break itself upon the bulwark of the Temple Knights!"},{"name":"MARCELAIN","text":"The Dravanians shall find death at the points of our spears!"},{"name":"LOANNE","text":"Let the dragons come! We do not fear them!"},{"name":"CHAUNOLLET","text":"If the price be mine own life, I shall gladly spend it to purchase peace for Ishgard!"},{"name":"ALPHINAUD","text":"Through the haze of pain, I swear I sensed─ But no. The past is done, and we must look to the future. At long last, Nidhogg is gone, his foul spirit cast out once and for all. I only pray that Estinien survives the ordeal..."},{"name":"BELTARDOIS","text":"I bid you welcome, slayer of Nidhogg! Ever do the gates of Ishgard stand open to our savior!"},{"name":"MARCELAIN","text":"Warrior of warriors! It is ever a pleasure to see you."},{"name":"LOANNE","text":"The light of the Holy See has faded, and the wyrm's shadow darkens our walls no more. That I would live to witness the passing of one age into the next..."},{"name":"CHAUNOLLET","text":"Nay, I'll not deny it: without your skill and fortitude, the city would now be ash. Would that more of your adventuring brethren possessed such qualities."},{"name":"QUOMONRENTIN","text":"The Horde is routed, aye, but I will not count this war over until each blackened stone has been replaced."},{"name":"GONDELIMBAUD","text":"'Tis you! The champion who slew Nidhogg! Your deeds shall pass into legend, yet I am honored to speak with you thus in the flesh!"},{"name":"VAINCANNET","text":"The Horde is fled, and there is much cause to celebrate...but I shall keep one eye on the horizon nonetheless."},{"name":"TESCELINGEON","text":"After centuries of fighting, are we finally at peace...?<br>Bah! What a mawkish old fool I've become! I must needs return to my duties!"},{"name":"HANDELOUP","text":"Though our principal foe lies defeated, we shall continue to keep order inside the walls and protect the citizenry. In that much at least, the duties of the Temple Knights remain unchanged."}],"reward":{"gil":5000,"xp":16740,"instance":20039},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67780]},"next":[67782]},"partials":[{"type":"npc","id":"1016813","obj":{"i":1016813,"n":"Aymeric","l":2002,"q":2}},{"type":"npc","id":"1016589","obj":{"i":1016589,"n":"Alphinaud","l":2300,"q":3}},{"type":"npc","id":"1006454","obj":{"i":1006454,"n":"Marcelain","l":63,"q":4}},{"type":"npc","id":"1006455","obj":{"i":1006455,"n":"Loanne","l":63,"q":4}},{"type":"npc","id":"1006456","obj":{"i":1006456,"n":"Chaunollet","l":63,"q":6}},{"type":"npc","id":"1011196","obj":{"i":1011196,"n":"Beltardois","l":2300,"q":1}},{"type":"npc","id":"1012155","obj":{"i":1012155,"n":"Gondelimbaud","l":2300,"q":2}},{"type":"npc","id":"1012157","obj":{"i":1012157,"n":"Quomonrentin","l":2300,"q":1}},{"type":"npc","id":"1012162","obj":{"i":1012162,"n":"Vaincannet","l":2300,"q":3}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1012164","obj":{"i":1012164,"n":"Tescelingeon","l":2300,"q":1}},{"type":"npc","id":"1016814","obj":{"i":1016814,"n":"Alphinaud","l":2002,"q":1}},{"type":"npc","id":"1016821","obj":{"i":1016821,"n":"Dependable Temple Knight","l":2300,"q":1}},{"type":"instance","id":"20039","obj":{"i":20039,"n":"The Final Steps of Faith","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":205}},{"type":"quest","id":"67780","obj":{"i":67780,"n":"Winning Over the Wyrm","g":4,"l":"The Dravanian Forelands","s":22}},{"type":"quest","id":"67782","obj":{"i":67782,"n":"Heroes of the Hour","g":4,"l":"Ishgard","s":24}}]}