{"quest":{"name":"A Gob in the Machine","location":"The Dravanian Hinterlands","id":67789,"patch":3.2,"sort":10,"icon":100522,"unlocksFunction":1,"eventIcon":71341,"issuer":1013714,"target":1016638,"involved":[1014407,1014408,1016639,1016640,1016641,1017001],"genre":16,"journal":["Behind his impassive mask, you sense that Backrix is eyeing you and your comrades with no small amount of suspicion.","A plainly exasperated Backrix reiterates that he watched you depart for Midas only moments before your return. Unable to make sense of your version of events, he suggests that you take the matter up with Mide.","You confer with Mide, Biggs, and Wedge, and learn that the goblin standing guard in front of the primal has corroborated Backrix's claims. After exploring several theories, you have no choice but to consider the possibility that something is odd about the passage of time within the barrier around Alexander. At a loss to know how to proceed, Biggs suggests seeking Cid's opinion, and Wedge duly requests his presence via linkpearl. All that remains is to await the arrival of the Ironworks' finest mind.","Cid and Y'shtola have scarcely arrived when the ground begins to tremble. Fearing the worst, you rush to gain a better view of Alexander, and Cid witnesses a surprising phenomenon: the flow of aether that had been leaking from the primal reverses, as if time itself had been turned back. For all their combined knowledge, neither Cid nor Y'shtola can offer a credible explanation for this unprecedented event, and they are forced to concede that Alexander may possess a means to manipulate time... Though the implications of this explanation are grim beyond reckoning, none of your companions seem ready to admit defeat just yet. Trouble Wedge for his thoughts on your predicament.","Wedge informs you that Cid and Y'shtola have returned to Matoya's Cave, and seems optimistic that their combined intellect will succeed in identifying some means to combat the Illuminati. With that, he and Biggs trudge back to the Shortstop, while Mide indicates that there is something she wishes to discuss with you upon your return.","Back at the Shortstop, Mide expresses bitter regret at the part she played in bringing Alexander to life, and reaffirms her determination to rescue Roundrox. Ahead lies a battle against an enemy of unknowable power, but you must endeavor to prepare yourself all the same, for if you fail, all will pay the price of the Illuminati's twisted utopia."],"objectives":["Speak with Mide.","Wait for Cid to arrive.","Speak with Wedge.","Speak with Mide at Bigwest Shortstop."],"dialogue":[{"name":"BACKRIX","text":"Pssshkoh... Backrix is certain that uplanders left for metal giant only moments before returning. He watches uplanders disappear over horizon with own two eyes!"},{"name":"BACKRIX","text":"But it is <span class=\"emphasis\">impossible</span> to return so soon if uplander's tale is true! ...Why treasure hunter also makes such claims, Backrix does not know. Go uplander, trade tongueflaps with Mide, and together think of explanation."},{"name":"BIGGS","text":"What a bunch of bleedin' dolts! Why didn't we just leave the fragment here with Backrix!?"},{"name":"BIGGS","text":"Still, we did do <span class=\"emphasis\">one</span> thing right, I s'pose. The second core's out of action, and that primal's going nowhere."},{"name":"WEDGE","text":"Try as I might, I cannot think of a logical explanation for what happened back there."},{"name":"WEDGE","text":"Not only did the platforms malfunction at precisely the right moment, but Quickthinx was on the <span class=\"emphasis\">only</span> one that didn't. And it just happened to be in <span class=\"emphasis\">exactly</span> the right place to catch the codex fragment. Do you know how difficult it would be to orchestrate something like that, much less <span class=\"emphasis\">predict it</span>!?"},{"name":"WEDGE","text":"...Forgive me. Through my incompetence, the Illuminati have all they need to control Alexander. And though the beast is now immobile, I cannot help but feel that matters are worse."},{"name":"WEDGE","text":"Of course, Backrix claims that none of this ever happened. I only wish he were right."},{"name":"MIDE","text":"Have you been able to make any sense of Backrix's account? According to his version of events, we would scarcely have had time to <span class=\"emphasis\">reach</span> the core, much less shut it down. But we were all there─we all know what happened."},{"name":"BIGGS","text":"Are you sure he's not just confused? Maybe he got lost in all that data of his, and forgot the time."},{"name":"WEDGE","text":"I'm afraid not. That is, unless the goblin standing watch near Alexander was also confused. His reports corroborate Backrix's. No...something else is going on here, I'm certain of it. The question is, what? If we assume for a moment that the goblins' accounts are true, then hardly any time has passed since we entered the barrier around Alexander."},{"name":"MIDE","text":"Time...stopped? Impossible..."},{"name":"BIGGS","text":"Impossible? You mean like Quickthinx predicting exactly what was going to happen in the core room? I hate to say it, but maybe he <span class=\"emphasis\">wasn't</span> talking out of his arse. If time doesn't work the same in there, maybe he saw the future!"},{"name":"MIDE","text":"Hmmm... There may be another explanation for that. There is a device deep within Alexander capable of performing complex mathematical calculations. It is not outside the realm of possibility that it could be used to predict the outcome of simple events."},{"name":"BIGGS","text":"Using mathematics to predict the future!? Now even if I <span class=\"emphasis\">could</span> believe that, it wouldn't explain this business with Backrix!"},{"name":"WEDGE","text":"Biggs is right. Perhaps the presence of the primal somehow disrupted the flow of time within the barrier. It's only a theory, of course─and a far-fetched one at that─but it might go some way towards explaining recent events."},{"name":"MIDE","text":"...To be clear, you are implying that the Illuminati are aware of this temporal disruption, and have been using it to somehow gaze into the future? Very well. If you are willing to accept that, why not go further? Might it not be the case that they have found a way to bend time to their will?"},{"name":"MIDE","text":"By moving back and forth in time, the Illuminati could effectively manipulate the present however they saw fit. They would ever remain one step ahead of us, our every effort doomed to fail from the first."},{"name":"BIGGS","text":"Now, that's a sobering theory. But it's still only a theory, right? There's no point panicking just yet! Wedge, give the chief a call on your linkpearl, why don't you? If anyone knows how to untangle this knot, it's him."},{"name":"WEDGE","text":"Chief, it's me! It's about Alexander! We've noticed something strange about time inside the primal... What? No, not <span class=\"emphasis\">our</span> time inside the primal, <span class=\"emphasis\">the</span> time─I-I mean time itself! Chief, it might be best if you just came here... Aye, aye─we'll await your arrival."},{"name":"BIGGS","text":"I've heard some strange things in my time, but this might well top the lot. Just thinking about it gives me a sore head. No sense racking our brains over it, though. The chief'll only end up proving us wrong."},{"name":"WEDGE","text":"The chief says he's on his way! And I think I heard Y'shtola's voice on the other end as well. She kept asking him what I was talking about."},{"name":"MIDE","text":"It seems like only yesterday that Roundrox and I spent a few happy hours here sorting through her collection of treasures. How did things come to this?"},{"name":"CID","text":"Is that a heated debate, I hear!? Boys! You started without me! Now, what was that you were saying over the linkpearl? Something about running out of time?"},{"name":"YSHTOLA","text":"Cid insisted that I accompany him─though I would have come even had he not. Matters have taken a turn for the worse, I gather."},{"name":"CID","text":"You can say that again! "},{"name":"YSHTOLA","text":"The aetheric fluctuations are akin to those I observed shortly before the primal's awakening. In the absence of a functioning core, its form is dissipating, albeit slowly."},{"name":"CID","text":"Y'shtola─would you mind lending me your goggles for a moment? It can't hurt to have a second opinion."},{"name":"CID","text":"What in the seven hells...!? The aether pouring from the primal is flowing <span class=\"emphasis\">backwards</span>...as if time were passing in reverse."},{"name":"YSHTOLA","text":"That cannot be. Such a phenomenon is wholly without precedent. Knowing so little of this primal's capabilities, however, it would be remiss to discount the possibility outright."},{"name":"MIDE","text":"If it is as we fear, then at this very moment, Alexander could be undoing our efforts to shut down its cores. All of our labors will have been for naught."},{"name":"YSHTOLA","text":"Ah, the treasure hunter of whom we have heard so much. You seem unperturbed by our outlandish speculations. Was this perchance the subject of Wedge's communication?"},{"name":"CID","text":"Gods help us... If there is any truth to this, it won't matter how many cores we disable─the Illuminati will simply undo any damage we cause!"},{"name":"WEDGE","text":"Then what do we do, Chief? How do we even <span class=\"emphasis\">begin</span> to fight something like that!?"},{"name":"MIDE","text":"To erase the past... To return to a clean slate. Could Dayan have known...?"},{"name":"ILLUMINATIELITEGUARDB02253","text":"Pssshkoh... Preparations for restoration of <span class=\"emphasis\">Enigma Codex</span> are complete! Calculations show margin of error for futurereadings is 0.03 percent!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Foolish gobbie. When future is decided, there is no error."},{"name":"QUICKTHINXALLTHOUGHTS","text":"There is no failure!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Listen well, chosen of Illuminati!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"At last, all pieces are in place! No longer must wise suffer foolishness of unwise!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Time is come to backstrike! Inferiors will make way for perfect world...or <span class=\"emphasis\">die</span>. Now...restore <span class=\"emphasis\">Enigma Codex</span>!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Now is Alexander Illuminati's to control! Soon will cores disabled by uplanders be disabled no longer."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Reverse time!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Once power flows to third core, Alexander will be fully operational! And with third core will its true potential awaken!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Wings of time will unfurl, and all of history will be at mercy of Illuminati! Chosen ones will amend mistakes of past and reshape world into perfection!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... At last, prophecies of <span class=\"emphasis\">Enigma Codex</span> will be fulfilled."},{"name":"QUICKTHINXALLTHOUGHTS","text":"And Quickthinx Allthoughts will rule as king of new world─of <span class=\"emphasis\">correct</span> world! Chosen ones, menders of history...be proud to serve as builders of this paradise!"},{"name":"MIDE","text":"We don't have the luxury of time to plan our next step. We must rescue Roundrox without delay─for her sake and ours."},{"name":"BIGGS","text":"Seems we have more questions than answers where this primal's concerned... If the Illuminati really can see into the future, does that mean they already know what we're going to do next?"},{"name":"BACKRIX","text":"Pssshkoh... A primal that bends time!? Impossible!"},{"name":"BACKRIX","text":"This data must be recorded at once!"},{"name":"WEDGE","text":"Y'shtola and the chief have returned to Matoya's Cave. Don't worry, between them, they're sure to find the answer to our problems. If it isn't waiting on a shelf in the Sharlayan annals, it'll be in some forgotten corner of the chief's brain, you mark my words!"},{"name":"WEDGE","text":"And the next time we meet Quickthinx, we'll be ready for him!"},{"name":"MIDE","text":"Adventurer─there is something I would like to discuss with you. But mayhap it would be best to wait until we are safely back at the Shortstop. I will see you there."},{"name":"MIDE","text":"I suppose I should start by apologizing. For everything. Were it not for me, the Illuminati would never have summoned that infernal machine...or gained the means to control it."},{"name":"MIDE","text":"And now Quickthinx possesses the power to manipulate time. To foresee the future and erase the past."},{"name":"MIDE","text":"I dare not think how he will use it. Returning the cores to their former state was but a foretaste. When all three are active, and Alexander can traverse both time and space, nothing will stand between the Illuminati and their twisted utopia..."},{"name":"MIDE","text":"...We cannot let it come to that, <span class=\"highlight\">Forename</span>. Somehow, we must find a way to stop them."},{"name":"MIDE","text":"But first, we must rescue Roundrox. Of all the innocent victims of this sorry tale, her plight pains me the most."},{"name":"MIDE","text":"&lt;sigh&gt; ...The Shortstop just isn't the same without her. I hope someone will keep her treasures safe until she returns..."}],"reward":{"gil":745,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67788]},"next":[67790,67871]},"partials":[{"type":"npc","id":"1013714","obj":{"i":1013714,"n":"Backrix","l":2001,"q":6}},{"type":"npc","id":"1016638","obj":{"i":1016638,"n":"Mide","l":2001,"q":3}},{"type":"npc","id":"1014407","obj":{"i":1014407,"n":"Biggs","l":2001,"q":8}},{"type":"npc","id":"1014408","obj":{"i":1014408,"n":"Wedge","l":2001,"q":10}},{"type":"npc","id":"1016639","obj":{"i":1016639,"n":"Mide","l":2001,"q":1}},{"type":"npc","id":"1016640","obj":{"i":1016640,"n":"Biggs","l":2001,"q":2}},{"type":"npc","id":"1016641","obj":{"i":1016641,"n":"Wedge","l":2001,"q":2}},{"type":"npc","id":"1017001","obj":{"i":1017001,"n":"Mide","l":2001,"q":2}},{"type":"quest","id":"67788","obj":{"i":67788,"n":"One Step Behind","g":16,"l":"The Dravanian Hinterlands","s":9,"f":1}},{"type":"quest","id":"67790","obj":{"i":67790,"n":"A Refrain for the Undaunted","g":95,"l":"Mor Dhona","s":604,"f":1}},{"type":"quest","id":"67871","obj":{"i":67871,"n":"The Coeurl and the Colossus","g":16,"l":"The Dravanian Hinterlands","s":11,"f":1}}]}