{"quest":{"name":"The Folly of Youth","location":"The Dravanian Hinterlands","id":67786,"patch":3.2,"sort":7,"icon":112129,"unlocksFunction":1,"eventIcon":71341,"issuer":1016637,"target":1014409,"genre":16,"journal":["Biggs is eager to press on into Alexander's depths.","Confident that Roundrox is safe under Wedge's watchful gaze, Biggs urges you to press on into Alexander's interior. Gather your most trusted allies and brave the dangers that await you in the bowels of the slumbering primal.<br><br>※The Cuff of the Son can be accessed via the Duty Finder.","Thanks to your tireless efforts, yet more of the Illuminati's machines of war have been reduced to crumpled piles of scrap. Muscles aching, you head back to Bigwest Shortstop only to find that Mide has returned, presumably unaware of what has transpired in her absence. Corner the treasure hunter and demand the truth.","In the end, Mide confesses the truth to you with little prompting, readily admitting that she had planned to use both you and the Illuminati to summon the primal. She is not so brazen, however, as to deny you an explanation. She duly relates the events of three years past, when she and several companions set out to summon Alexander and realize the perfect world described in the <span class=\"emphasis\">Enigma Codex</span>. When their summoning subsequently failed, her companions were killed, and their leader absorbed into the primal's core.<br><br>Her tale told, Mide reveals at last that her true motive for attempting to revive the metal colossus was to meet once more with the man she loved. Furthermore, she tells you the two things required for complete control over Alexander: a complete <span class=\"emphasis\">Enigma Codex</span>, and someone with the ability to read it. Although the codex no longer responds to Mide, Roundrox is somehow able to view its contents, making her participation essential for any who hope to manipulate the primal. Unfortunately, it seems the Illuminati may already have reached the same conclusion, for no sooner has Mide uttered the words than a breathless Wedge barges into your midst bearing terrible news: Roundrox has been captured."],"objectives":["Enter the Cuff of the Son.","Speak with Mide."],"dialogue":[{"name":"BIGGS","text":"If you're worried about Roundrox, don't be. Wedge won't let her come to any harm. Truth be told, I'm more worried about this business with Mide. Still, we should be careful of making any rash decisions, as you can bet that's what the Illuminati want. For now, I reckon we should give her the benefit of the doubt. Innocent till proven guilty, and all that."},{"name":"BIGGS","text":"And anyway, we've got more pressing matters to deal with. Namely, taking back that codex fragment, and pushing on into Alexander before the Illuminati have a chance to shore up their defenses."},{"name":"BIGGS","text":"You ready for another round? Good. The sooner you get going, the better, I reckon. Oh, and when you're in the belly of the beast, be sure and break something for me, eh!?"},{"name":"SYSTEM","text":"You now have access to the Cuff of the Son. Midas can be accessed via the entrance at the Thaliak River."},{"name":"BIGGS","text":"Don't worry─Wedge'll have Roundrox back here in no time. For now, just focus on delving deeper into that primal before the Illuminati have a chance to regroup. And don't forget to break something for me!"},{"name":"BIGGS","text":"Another Illuminati brainchild back on the scrap pile, is it? Ah, if only I could've been there to watch you dismantle the thing!"},{"name":"BIGGS","text":"As you've likely noticed, Mide's back. Now, I haven't said a word to her about what went on while she was away, as I wanted you on hand if things turned nasty. But since she gets on better with you anyway, maybe it'd be best if you spoke to her yourself."},{"name":"MIDE","text":"Ah, <span class=\"highlight\">Forename</span>. You haven't seen Roundrox, have you? I was looking forward to hearing about the new treasures she's found."},{"name":"MIDE","text":"...I see.<br>Well, I will not lie to you. Some of it is true. I <span class=\"emphasis\">did</span> meet with the Illuminati. But that is not the whole story. Allow me to explain."},{"name":"BIGGS","text":"...You're saying you handed over the codex fragment to stop the Illuminati from coming here and taking it?"},{"name":"MIDE","text":"Yes. But the “fragment” I handed over to them was naught but a stone picked from a pile of rubble. The true codex fragment is here, safe and sound."},{"name":"BIGGS","text":"Hah! I bloody <span class=\"emphasis\">knew</span> Quickthinx was lying! The way he told it, you'd been working with the Illuminati all along. Load of old bilge, the lot of it."},{"name":"MIDE","text":"I...am afraid not. Quickthinx told you true. In fact, it was I who first taught the goblins how to summon the primal. I meant only to use them for my own ends, of course...much as I did you."},{"name":"MIDE","text":"The author of the <span class=\"emphasis\">Enigma Codex</span> was an ancestor of mine. The creation of the so-called perfect world proposed within it has long been the goal of certain members of our tribe, myself included. For years, we strove in secret to realize its high ideals─free of the twisted elitism which seems to have infected the Illuminati."},{"name":"MIDE","text":"During that time, there was one who served as our leader─a man who made us believe that our perfect world was within reach. A man...with whom I fell in love. I wished for nothing more than to see his dreams come to fruition."},{"name":"MIDE","text":"So blind was my devotion, I agreed to help him summon a primal without a second thought. The danger to our lives never even crossed my mind. But on that day, three years ago, I came to know the folly of our mission."},{"name":"MIDE","text":"In an instant, the infernal machine laid waste to our hopes, snuffing out the lives of my companions. And the man I loved was dragged into its core."},{"name":"MIDE","text":"In a last desperate attempt to make right our mistake, I called forth a barrier with which to seal Alexander. At that moment, however, the codex shattered, and the colossus vanished without a trace."},{"name":"MIDE","text":"When the dust settled, I found myself surrounded by the broken fragments of the codex; the cold, accusing remnants of our dream of a perfect world."},{"name":"MIDE","text":"We were fools to think only of the future. I did not realize it until my friends were gone, but the time we spent on our journey together, pursuing a shared dream...those moments were as precious as any paradise we could have hoped to build."},{"name":"BIGGS","text":"It's a sad old tale, I'll give you that─but it doesn't explain why you had the Illuminati summon the primal, or why you had <span class=\"emphasis\">us</span> help you infiltrate it. After everything you've been through, you can't seriously think any good will come of reviving Alexander? You all but said as much yourself!"},{"name":"MIDE","text":"Good has nothing to do with it. Understand, I did not act out of any lingering adherence to my old ideals. I simply wanted to see him again. And perhaps...walk to the ends of the world with him."},{"name":"BIGGS","text":"\"Him“?"},{"name":"BACKRIX","text":"Pssshkoh... Mide cannot mean Alexander?"},{"name":"MIDE","text":"Not Alexander itself, but the soul I believe still resides within."},{"name":"BACKRIX","text":"Soul of uplander sleeps in giant machine? Never has Backrix heard such unsense! Mide must abandon this─"},{"name":"BIGGS","text":"Now's not the time."},{"name":"BIGGS","text":"I've got one more question to ask you. What happens when all the codex fragments are brought together?"},{"name":"MIDE","text":"Alexander was born from hearts that yearned for a perfect world. The writings of the <span class=\"emphasis\">Enigma Codex</span> inspired such a desire, but they are more than just a collection of texts. The codex can also be used to control the primal."},{"name":"MIDE","text":"To be precise, two elements are required: a complete <span class=\"emphasis\">Enigma Codex</span>, and one capable of reading it. When both are present, Alexander can be commanded to transport its residents wherever they choose."},{"name":"MIDE","text":"I myself was once able to read the codex. But those days are long gone. Now, the fragments are as dead to me as the stones beneath my feet. There is another, however, to whom the codex still responds. One we all know quite well."},{"name":"BIGGS","text":"What...<span class=\"emphasis\">Roundrox</span>? Are you saying that little girl is the key to controlling a bleedin' <span class=\"emphasis\">primal</span>?"},{"name":"WEDGE","text":"R─ &lt;pant&gt; &lt;pant&gt;<br>Rou─ &lt;huff&gt; &lt;huff&gt;<br>&lt;gulp&gt; <span class=\"emphasis\">Roundrox</span>!"},{"name":"WEDGE","text":"<span class=\"emphasis\">Roundrox has been captured</span>!!!"}],"reward":{"gil":3573,"xp":0,"instance":30031},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67785]},"next":[67787]},"partials":[{"type":"npc","id":"1016637","obj":{"i":1016637,"n":"Biggs","l":2001,"q":3}},{"type":"npc","id":"1014409","obj":{"i":1014409,"n":"Mide","l":2001,"q":7}},{"type":"instance","id":"30031","obj":{"i":30031,"n":"Alexander - The Cuff of the Son","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":200}},{"type":"quest","id":"67785","obj":{"i":67785,"n":"Rearmed","g":16,"l":"The Dravanian Hinterlands","s":6,"f":1}},{"type":"quest","id":"67787","obj":{"i":67787,"n":"Toppling the Tyrant","g":16,"l":"The Dravanian Hinterlands","s":8,"f":1}}]}