{"quest":{"name":"Heroes of the Hour","location":"Ishgard","id":67782,"patch":3.3,"sort":24,"eventIcon":71201,"issuer":1016589,"target":1012380,"involved":[1012337,1012377,1016818,1016826,1016883,1016884,1016885,1016889,1017024],"genre":4,"journal":["Alphinaud seems distracted.","Alphinaud praises you for your epochal victory over Nidhogg, but admits that freeing Estinien felt the greater accomplishment. Yet even with the excision of the wyrm's eyes and their insidious influence, Alphinaud is concerned with how Estinien's spirit has endured the harrowing separation. Make your way to the Congregation of Our Knights Most Heavenly, and inquire with Lucia as to the Azure Dragoon's condition.","After thanking you for your deeds in service to Ishgard, Lucia informs you that Estinien has yet to regain consciousness. Promising that Ser Aymeric will send word as soon as the dragoon awakens, she suggests that you occupy yourself by paying a visit to Count Edmont and his sons. Head to Fortemps Manor with Alphinaud and announce your return to the city.","After treating you to a hero's welcome, Lord Edmont generously offers you the use of his guest quarters, that you might rest and recover. Alphinaud politely declines, however, begging leave to visit the Temple Knights' infirmary. Follow your young friend to the Congregation of Our Knights Most Heavenly.","You arrive at the Temple Knights' headquarters but find no sign of Alphinaud. Upon speaking with Ser Aymeric, you learn that your fellow Scion has stationed himself at the ailing Estinien's bedside, and seems determined to remain there unto the bitter end..."],"objectives":["Speak with Lucia.","Enter Fortemps Manor.","Inquire after Alphinaud at the Congregation of Our Knights Most Heavenly."],"dialogue":[{"name":"ALPHINAUD","text":"Your battle with Nidhogg's shade will beget many an epic ballad, <span class=\"highlight\">Forename</span>, and rightly so. It was, without a doubt, one of your more <span class=\"emphasis\">epochal</span> victories─though I must admit that I took greater joy in seeing you emerge from the experience unscathed."},{"name":"ALPHINAUD","text":"...And not only for your own sake. Had you not been there to aid me, those infernal eyes would still be fused to Estinien's mail..."},{"name":"ALPHINAUD","text":"Yet even with Nidhogg gone, I cannot help but wonder how much of our friend remains... Let us pay a visit to Lucia, and beg news of his condition."},{"name":"ALPHINAUD","text":"Let us speak with Lucia. She will know how Estinien fares."},{"name":"LUCIA","text":"<span class=\"highlight\">Forename</span>, Master Alphinaud...my honored friends... As if winning Hraesvelgr to our cause were not enough, you took it upon yourselves to rid us of his brood-brother... I know not how to thank you."},{"name":"ALPHINAUD","text":"My own contribution was hardly noteworthy. The true saviors of the day were <span class=\"highlight\">Forename</span> and Estinien. One triumphed over Nidhogg's shade through strength of arms and the other through strength of will."},{"name":"ALPHINAUD","text":"...And speaking of Estinien, what news of his recovery?"},{"name":"LUCIA","text":"The Azure Dragoon was conveyed to the infirmary, where he now resides under the care of our hospitalier captain. I am told he has yet to regain consciousness."},{"name":"LUCIA","text":"But as you know, Estinien's mind and body were held hostage for many days. We must be patient, and allow the process of healing to begin. In the meantime, you would do well to rest and recover from your own ordeals."},{"name":"ALPHINAUD","text":"But surely─"},{"name":"LUCIA","text":"Ser Aymeric is never long from Estinien's bedside, and will send word the moment there are any developments. Now, if I have satisfied your concerns, I believe Lord Edmont and his sons are most eager to celebrate your return."},{"name":"ALPHINAUD","text":"...Very well, First Commander."},{"name":"ALPHINAUD","text":"Come, <span class=\"highlight\">Forename</span>─'twould seem that we are awaited at Fortemps Manor."},{"name":"LUCIA","text":"Pray call upon Lord Edmont. I gather Fortemps Manor holds its breath for your return."},{"name":"EDMONT","text":"Go, Warrior of Light. We will not begrudge you time spent at a comrade's sickbed."},{"name":"ARTOIREL","text":"At long last, Nidhogg is gone... No true son of Ishgard could wish for more. Yet scores of my brother knights fell in the battle, and I find my joy tempered by their loss..."},{"name":"EMMANELLAIN","text":"Without the guiding hand of yours truly, House Haillenarte's famous dragonkillers wouldn't have killed <span class=\"emphasis\">half</span> so many dragons just now─as I shall be sure to tell my lady when next we meet..."},{"name":"HONOROIT","text":"If my lord's irrepressible optimism were ever to fix upon something about which he had cause to be optimistic, I dare not think what he might achieve."},{"name":"BUTLER02246","text":"Once more you risk your life in service to Ishgard. We are forever in your debt."},{"name":"HOUSEFORTEMPSSTEWARD02246","text":"We prayed for your safe return, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. If I may be so bold...<br>Welcome home."},{"name":"AYMERIC","text":"<span class=\"highlight\">Forename</span>, my friend. What can I do for the savior of Ishgard?<br>...You seek Master Alphinaud? Ah. He came to relieve me of my vigil a short while ago."},{"name":"AYMERIC","text":"When he begged to sit at Estinien's side, I could not well refuse him."},{"name":"AYMERIC","text":"Though he would sooner faint than admit it, the boy must be exhausted by Hraesvelgr's trial and all that followed...<br>Estinien is blessed to have such devoted comrades."}],"reward":{"gil":583,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67781]},"next":[67783]},"partials":[{"type":"npc","id":"1016589","obj":{"i":1016589,"n":"Alphinaud","l":2300,"q":3}},{"type":"npc","id":"1012380","obj":{"i":1012380,"n":"Aymeric","l":2300,"q":5}},{"type":"npc","id":"1012337","obj":{"i":1012337,"n":"House Fortemps Manservant","l":2320,"q":5}},{"type":"npc","id":"1012377","obj":{"i":1012377,"n":"House Fortemps Steward","l":2320,"q":6}},{"type":"npc","id":"1016818","obj":{"i":1016818,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1016826","obj":{"i":1016826,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1016883","obj":{"i":1016883,"n":"Artoirel","l":2320,"q":1}},{"type":"npc","id":"1016884","obj":{"i":1016884,"n":"Emmanellain","l":2320,"q":1}},{"type":"npc","id":"1016885","obj":{"i":1016885,"n":"Honoroit","l":2320,"q":1}},{"type":"npc","id":"1016889","obj":{"i":1016889,"n":"Count Edmont De Fortemps","l":2320,"q":1}},{"type":"npc","id":"1017024","obj":{"i":1017024,"n":"Lucia","l":2300,"q":1}},{"type":"quest","id":"67781","obj":{"i":67781,"n":"An End to the Song","g":4,"l":"The Churning Mists","s":23}},{"type":"quest","id":"67783","obj":{"i":67783,"n":"Litany of Peace","g":4,"l":"Ishgard","s":25}}]}