{"quest":{"name":"Resistance Is Futile","location":"The Dravanian Forelands","id":67795,"patch":3.2,"sort":5,"icon":100544,"beast":7,"unlocksFunction":1,"eventIcon":71341,"issuer":1016802,"target":1016802,"involved":[1011928,1011929,1016851,1016891],"genre":46,"journal":["The Vath deftarm sighs soberly.<br>※The difficulty of this quest will be synced to your current level.","The deftarm, feeling responsible for the misfortune that has befallen the hive, reveals to you his idea to avoid war. Having faith in the strength of his individuality, the Vath adventurer intends to willingly submit himself to the Gnath to enter their colony. Once the Overmind is lured out to claim him, he would fell the king-like Gnath, ending his threat to the Vath. The deftarm tries to reassure himself of his cause before saying farewell to you and setting off for Loth ast Gnath.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You divulge the deftarm's plan to the storyteller and fleetfoot, who quickly deny its feasibility, explaining that the Overmind would be all too willing to use the deftarm. The fleetfoot also reveals that the Overmind cannot truly be killed, for where one dies, another soon appears. As time grows short to save the deftarm from completely losing himself, the storyteller bids you pursue him while he sends out the call for help.","You discover the deftarm, but he has already submitted himself to the thoughts of the Onemind who surround him. You dispatch them in an attempt to quell their whispers. Speak to your pupil to see if he is yet himself.","Your efforts to reach the deftarm prove fruitless, as he silently proceeds towards the Gnath colony. Continue to pursue him into the heart of the hive.","You follow the entranced deftarm deep into Loth ast Gnath, where he is welcomed by the Overmind himself. The Overmind claims triumphantly that the Vath adventurer's individuality has been removed and he has taken his place among the Onemind once more. After berating mankind for their thirst of war and discord, the Overmind hisses at you to leave his domain. He uses his power over the deftarm to raise his musket toward you, but you stand firm, trusting in your pupil's power. The storyteller soon arrives with the allies the deftarm has gathered over the course of his travels, and they attempt to call out to him. Their voices soon reach him, and the Overmind senses the imminent threat posed by the deftarm's overwhelming sense of self. Shocked beyond comprehension upon losing power over his thralls and the deftarm's assault, the Overmind soon retreats to the recesses of its lair. As impending war becomes less of a possibility, the deftarm appears to be exhausted, and suggests everyone return to the hive.","At Loth ast Vath, the deftarm attempts to thank his friends for coming to his rescue, but they brush aside his sentimentality, humor lost on the Vath. The storyteller explains how the colony has become an important part of others' lives, and their security will be guaranteed so long as the Adventurers' Guild continues to reciprocate the assistance they receive from others. The deftarm is grateful to you for taking him under your wing to guide him in the ways of adventuring, but assures you he is ready to stand on his own. In addition to his duties to the guild, he declares his resolve to continue training his skills so that he may one day embark on an adventure with you."],"objectives":["Speak with the Vath storyteller.","Search for the Vath deftarm near Loth ast Gnath.","Speak to the Vath deftarm.","Search for the Vath deftarm.","Speak with the Vath deftarm."],"dialogue":[{"name":"UDEKIKI","text":"Master, I only wished to help Loth ast Vath. A well-meaning wish. But now it seems it will ruin us. With my travels, I have greatly angered the Overmind. I have brought this misfortune upon our colony."},{"name":"UDEKIKI","text":"It is my duty to rectify it. I thought long and hard, and there is only one way to avoid war. I will destroy the Overmind himself."},{"name":"UDEKIKI","text":"Without his guidance, the Onemind will know not what to do. They will grow confused. So confused. They cannot go to war without a leader to command them, yes?"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; So I will give myself up to Loth ast Gnath. Willingly. For the Overmind to come out of his nest, to cure me of individuality. In that moment, I will strike. If I submit myself to the Onemind's thoughts, he should not suspect. Should not. Should not..."},{"name":"UDEKIKI","text":"Master, when the storyteller spoke of true purpose, it caused me to reconsider my own. Perhaps becoming an adventurer was not my purpose at all."},{"name":"UDEKIKI","text":"Creating the guild, traveling to distant lands to secure resources, treating with the dragons... Perhaps these were to serve a greater purpose: to protect my colony."},{"name":"UDEKIKI","text":"I will not shirk this duty. My sense of self is strong enough. I will be victorious. As I was at Anyx Trine."},{"name":"UDEKIKI","text":"Master, I cannot ask for your help this time. The storyteller will have need of you here, at the colony. Should I fail in my task, all Vath must prepare themselves for war."},{"name":"UDEKIKI","text":"Forgive me. These are...difficult things for me to say. Very difficult. But I must. So...farewell for now!"},{"name":"STORYTELLER","text":"You look troubled, great hunter. Is there something amiss?"},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; The fool! The Overmind will gladly welcome him into his arms!"},{"name":"IDATEN","text":"Even should he strike down the Overmind, it will be for naught! When one falls, another rises! So it has ever been!"},{"name":"STORYTELLER","text":"Great hunter, we are vulnerable to the Overmind, but his thoughts hold no sway over man. Only you can pursue him."},{"name":"IDATEN","text":"But Storyteller, even should <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> find the deftarm, there are too many drones in the hive for them to escape. Too many! The Overmind could command them all to strike at once!"},{"name":"STORYTELLER","text":"We must try to reach him before that happens. If the deftarm enters the hive and is cleansed of his individuality, the Onemind will grow confident. Very confident indeed. His recklessness will only spur them to swifter action."},{"name":"STORYTELLER","text":"Let us hope there is still time. I will try to summon the others, those who may be willing to help us. Hurry, great hunter, to Loth ast Gnath!"},{"name":"STORYTELLER","text":"I make for the hunters' camp at once. Do not let the deftarm reach the hive!"},{"name":"IDATEN","text":"We shall remain here and prepare our colony for the worst. Go!"},{"name":"UDEKIKI","text":"..."},{"name":"UDEKIKI","text":"..."},{"name":"TSUNAGITOMESHIMONO","text":"(-???-)&lt;clack&gt; &lt;clack&gt; It is done. He is cured."},{"name":"TSUNAGITOMESHIMONO","text":"You come in vain, fleshling hunter of gods. Sense of self no longer exists in this one. He is ours once more. One with the many, in harmony."},{"name":"TSUNAGITOMESHIMONO","text":"Harmony that you could never hope to achieve. Your division breeds chaos. Murder. War. You do not understand peace."},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; Would that you could learn. Could link. Our harmony is beyond your kind. All submit to a single thought here. We do not quarrel."},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; But <span class=\"emphasis\">you</span>, fleshling. You sow discord. You nurture deformity. You would murder the many."},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; If you thirst for blood, hunter, then sate it with one of your own! Leave our hive at once!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I refuse!"},{"name":"A1","text":"Release the deftarm!"},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; You do not understand. The Nonmind's senses of self fester and corrupt the whole. The Nonmind threatens the natural order."},{"name":"TSUNAGITOMESHIMONO","text":"This one's presence is poison! Anathema! We feel it growing, gnawing. Present yet apart. <span class=\"emphasis\">Defiant</span>."},{"name":"TSUNAGITOMESHIMONO","text":"No longer. It ends. Corrupted flesh must be destroyed. Before it grows and claims us."},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; We know your strength, warrior. We know your thirst. Grant him his death─or will you let him grant you yours?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Deftarm, stop!"},{"name":"A2","text":"Remember who you are, Deftarm!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Deft...arm..."},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; What is this? The seams... They tear... Impossible."},{"name":"TSUNAGITOMESHIMONO","text":"No. We are the many. And you are one. Even if you stray, you cannot escape. <span class=\"emphasis\">You will obey.</span>"},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; You forget that the Vath yet have allies! Powerful allies!"},{"name":"MARCECHAMP","text":"Give 'em hell, Deftarm! You're stronger than this!"},{"name":"JANTELLOT","text":"You are an adventurer, are you not? Pull yourself together!"},{"name":"DRYDOX","text":"Pssshkoh... Without Deftarm, who will Drydox share stinkeggs with!?"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Deftarm... Deftarm... Deftaaaaaaaaarm!"},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; Whose thoughts are these!? Silence... Silence!"},{"name":"TSUNAGITOMESHIMONO","text":"The link...it bends to his voice...to his will... One speaks louder than many!"},{"name":"UDEKIKI","text":"Master? Storyteller? I know you all...and you know me!"},{"name":"UDEKIKI","text":"Yes, I am the Vath deftarm! Adventurer and protector of my colony!"},{"name":"TSUNAGITOMESHIMONO","text":"&lt;gasp&gt; You... You..."},{"name":"TSUNAGITOMESHIMONO","text":"&lt;clack&gt; &lt;clack&gt; None would <span class=\"emphasis\">dare</span> assault us. <span class=\"emphasis\">None</span>! You know not what you have done... Withdraw!"},{"name":"VATHSTORYTELLER","text":"&lt;click&gt; &lt;click&gt; Those who have always followed the will of the Overmind know nothing of other powerful bonds in this world."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I felt a great fear in him. Greater than his hate. I believe the Onemind will avoid us for some time."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I felt such emptiness. As they feel. There were no shapes, no flavors, no moods. There were no questions, no answers. Only a single command: to obey. I could not accept such a world."},{"name":"UDEKIKI","text":"I was able to regain myself, thanks to all of you. But now I feel so...exhausted. Let us return home, to the guild."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; To have reached the deftarm when we did was most fortuitous indeed. Were he lost to the Onemind completely, I fear our allies would be hesitant to intervene in a war between Gnath and Vath."},{"name":"IDATEN","text":"&lt;click&gt; &lt;click&gt; It seems the Gnath are the ones who are truly alone now. So lonely. Such pity we feel for those without others."},{"name":"UDEKIKI","text":"My friends. I cannot thank you enough for coming to my aid. I─"},{"name":"MARCECHAMP","text":"“Friends”? Now don't go thinkin' it's 'cause I'm soft. 'Cause I ain't. The hunters have been dependin' on the steady flow of arrow shafts from your guild. It'd be too much trouble to go back to fetchin' 'em ourselves."},{"name":"JANTELLOT","text":"That putrid incense supplied by the guild may make my eyes water, but it keeps the Convictory blessedly free of dragons."},{"name":"DRYDOX","text":"Pshhh... Shkohhh...<br>Gobbies cannot get enough of guild's stinkeggs! Drydox gets shiveryshakes without them!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I never realized that the guild had become so important to so many people."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; Loth ast Vath no longer lives as a parasite, thanks to the Adventurers' Guild. Our sustainability is guaranteed as long as there are those willing to accept our help."},{"name":"STORYTELLER","text":"The Onemind believed that we were alone, that we only survived by clinging to each other. That was their conception of a colony. To welcome strangers into the hive is unthinkable to them, and our advantage."},{"name":"STORYTELLER","text":"Unlike the Overmind, we can forge alliances with others to enrich our colony. They cannot ascertain our strength, and that is cause for them to leave us be. Much cause indeed."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; The Nonmind have much to be thankful for. It seems we have become <span class=\"emphasis\">too</span> useful to those around us. We are sure to repay our wonderful allies' kindness in whatever way we can. Even so, I yearn to experience more─to explore new lands and meet new people."},{"name":"UDEKIKI","text":"I have learned much from your lessons. But it is time to be my own master. I have burdened you long enough."},{"name":"UDEKIKI","text":"I know that I have much to learn, and that try as I might, I can never be as strong as you. I must develop my own strengths, and see to the guild and its future adventurers. But I hope someday to join you!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Your pupil will make you proud! Wait for me, Master!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Vath."},{"name":"SYSTEM","text":"Furthermore, you will receive an experience point bonus upon completion of the Vath tribal daily quests."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from the Vath stickpeddler."}],"reward":{"gil":742},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":34}],"quests":[67794]},"next":[67796]},"partials":[{"type":"npc","id":"1016802","obj":{"i":1016802,"n":"Vath Deftarm","l":2000,"q":6}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"npc","id":"1011929","obj":{"i":1011929,"n":"Vath Fleetfoot","l":2000,"q":9}},{"type":"npc","id":"1016851","obj":{"i":1016851,"n":"Vath Deftarm","l":2000,"q":1}},{"type":"npc","id":"1016891","obj":{"i":1016891,"n":"Vath Deftarm","l":2000,"q":1}},{"type":"quest","id":"67794","obj":{"i":67794,"n":"Your Enemy and Mine","g":46,"l":"The Dravanian Forelands","s":4,"f":1}},{"type":"quest","id":"67796","obj":{"i":67796,"n":"A Symbiotic Friendship","g":46,"l":"The Dravanian Forelands","s":6,"f":1}}]}