{"quest":{"name":"The Naming of Vath","location":"The Dravanian Forelands","id":67791,"patch":3.2,"sort":1,"icon":100540,"beast":7,"unlocksFunction":1,"eventIcon":71341,"issuer":1011928,"target":1016837,"involved":[1011916,1011922,1011929,1016835,1016836,1016838,1016839,1016840,1016892],"genre":46,"journal":["The Vath storyteller looks at you, clicking his mandibles nervously.<br>※The difficulty of this quest will be synced to your current level.","The storyteller explains that Loth ast Vath has a newcomer, who has yet to find his purpose and thus remains nameless. Determined to make himself useful, the new Vath set out towards the Chocobo Forest in search of food to bring back to his brothers and sisters; alas, he has not yet returned. Worrying that the hunters may have mistaken him for a Gnath, the storyteller urges you to venture out to Tailfeather and inquire as to his whereabouts.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You find the nameless Vath at Tailfeather, where he has been detained by the hunters for devouring a great amount of gysahl greens set in chocobo traps. Marcechamp offers to release the beastman on the condition that he repays the hunters for the greens by harvesting branches from young meliae, with which to make arrow shafts. The nameless one agrees, and Marcechamp asks you to accompany him so that he does not flee from his task.","You follow the nameless one into the Smoldering Wastes, where he tells you he intends to return to Loth ast Vath instead, without repaying his debt. But with a little persuasion on your part, he soon acquiesces to the hunters' task, asking you to help him gather the branches.","You harvest the melia branch with little effort. Return to the nameless one with the branch so he may pay his debt to the hunters.","You hand the sapling branch to the nameless one. Upon doing so, you notice the little Vath has also gathered a prodigious quantity of his own. Make for Tailfeather to deliver them to Marcechamp.","Marcechamp is visibly surprised that the Vath returned to Tailfeather, with a large quantity of branches besides. Satisfied with the Vath's hard work and amused by his honesty, he also offers a reward: a sack of gysahl greens for the nameless one to take home to Loth ast Vath. The nameless one grows excited at the prospect of retrieving items for rewards to share among the colony and declares his resolve to become an adventurer. Report the good news to the Vath storyteller in Loth ast Vath.","At Loth ast Vath, the nameless one offers his rewards to the Vath storyteller. While pleased with the gysahl greens he has brought, the storyteller and the fleetfoot are troubled by their colony's sustainability. Though their link with the Overmind has been severed, they continue to depend on the Onemind by stealing what little resources they can from Loth ast Gnath. The nameless Vath, steadfast in his resolve to become an adventurer, offers to travel to faraway lands and obtain rewards for his services to lessen the Vath's reliance on the Onemind. The storyteller accepts this as the nameless one's purpose, and allows him to set up an Adventurers' Guild in Loth ast Vath.","The nameless one intends to introduce you to his closest brothers, the stickpeddler, and the keeneye. But the stickpeddler mentions that the keeneye left the colony in search of food. When he notes that he may be surveying the river near the bridge, the nameless one recalls that ferocious dragons are often seen in the area. Fearing for the keeneye's safety, he asks you to check the bridge for dragons, but not to slay them for fear of reprisal. Instead, he bids you ride a kongamato to the bridge and use the smoke-spewing contraption strapped to its belly to drive away any dragons you discover.","You seek out the “ferocious” dragons the nameless one mentioned, only to find younglings guarding the bridge playfully. Using the putrid incense strapped to the kongamato's stomach, you spray the younglings, who irritatedly fly away. As the keeneye is nowhere to be seen, return to Loth ast Vath to see if the nameless one has had any luck with finding the keeneye.","You arrive at Loth ast Vath to find the keeneye has returned safe and sound. He expresses gratitude and willingness to help the nameless one with finding quests for the Adventurers' Guild to undertake. All that remains is to find a seasoned adventurer to teach the others the tricks of the trade─and that adventurer happens to be you. Overjoyed with the help of his brothers and his established role, the nameless Vath declares a new name for himself: the deftarm."],"objectives":["Search for the nameless one.","Accompany the nameless one to the Smoldering Wastes.","Survey the land for a young melia.","Deliver the pliant melia branch to the nameless one.","Speak with Marcechamp.","Report to the Vath storyteller.","Speak with the nameless one.","Ride the kongamato and use its Fumigate ability on any dragons near the bridge.","Report to the nameless one."],"dialogue":[{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; Great hunter, we are honored that you have returned to our humble hive. There is something which weighs heavy on our mind. Very heavy."},{"name":"STORYTELLER","text":"We have a newcomer to Loth ast Vath. He has not yet proved himself useful, and so he has no name."},{"name":"STORYTELLER","text":"So determined is he to find his place, that he left the sanctuary to forage in the forests of the east. He has not returned."},{"name":"STORYTELLER","text":"It has been difficult as of late, very difficult. We have grown hungry, and food remains scarce─the Onemind has seen to that."},{"name":"STORYTELLER","text":"This nameless one means well, but he is highly curious with his newfound senses. This makes him vulnerable. The forest is the domain of the hunters, and his intentions may be misunderstood, for men have not the means to tell Vath from Gnath at a glance."},{"name":"STORYTELLER","text":"Will you not lend us your assistance in finding him? Will you travel to the hunters of the east and ask if they have seen him?"},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; Kind hunter, generous hunter, you have our gratitude. Please make haste, so that the weight on our mind can be lifted."},{"name":"STORYTELLER","text":"If you find the nameless one, tell him you were sent by us. He will know you came from Loth ast Vath."},{"name":"GRIMOLD","text":"I was hoping for a fine bird, and lo and behold, I capture a bloody Gnath instead."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; Yes, we are the nameless one. Have you been sent by the storyteller?"},{"name":"NANASHI","text":"Tell your hunter friend to release me at once. We are not of the Onemind. We are Vath!"},{"name":"GRIMOLD","text":"I don't care if he's a two-headed bandersnatch, he isn't going anywhere. I'm detaining him for stealing our resources."},{"name":"GRIMOLD","text":"Normally, I'd say we're more lenient than the Gnath in terms of territory, so long as they don't hunt in excess or attack us."},{"name":"GRIMOLD","text":"But then this overgrown vilekin comes and gobbles up all the gysahl greens we laid in our traps. Enough bait to keep a drove of chocobos sated for days, gone! With nothing to show for it!"},{"name":"NANASHI","text":"So hungry, we were! We could not help ourselves. Unable to hunt, unable to forage... We are no different from a parasite. &lt;click&gt; &lt;click&gt; If only we could find a way to release ourselves. From this pitiful way of life."},{"name":"GRIMOLD","text":"Well, if you insist..."},{"name":"NANASHI","text":"You misunderstand! Spare us our life! It is all we have!"},{"name":"MARCECHAMP","text":"...Aye, spare it he will. Stop tormentin' the poor creature, Grimold. He doesn't know any better."},{"name":"MARCECHAMP","text":"We ain't savages, but we ain't charitable neither. You'll have to pay us back for the greens you ate. An' seeing as you don't have anythin' on you of value, it looks like you'll have to work off your debt."},{"name":"MARCECHAMP","text":"Hmmm... Last I checked, we're runnin' a mite low on arrow shafts. Harvest me some melia branches an' we'll call it square, eh?"},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; Very well. Release us, and we shall do as you say."},{"name":"MARCECHAMP","text":"'Course I ain't fool enough to let him go off alone. I'd ask that you see to it that the beastman don't flee from his debt. An' if he does, I'll have every hunter from here to the Hundred Throes after him for thievery. Understand?"},{"name":"NANASHI","text":"Ah, we are free! Much appreciated, hunter. Now then, to the Smoldering Wastes."},{"name":"GRIMOLD","text":"Gnath, Vath, what difference does it make? Pests, all of 'em."},{"name":"MARCECHAMP","text":"Our hunters have more important things to do than gather branches in the wilderness. If the beastman fulfills his end of the bargain, I'll consider his debt repaid."},{"name":"NANASHI","text":"Well then. The storyteller must be waiting for us. We make for Loth ast Vath."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You must keep your word."},{"name":"A1","text":"You intend to run away?"},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; ...Yes, we know. If we flee, we will never again be able to move freely. To the Nonmind, independence is all."},{"name":"NANASHI","text":"If we take too long, the hunters will surely come after us. Kind hunter, will you help us?"},{"name":"NANASHI","text":"We will not ask you to bear the entire burden. One sapling should be enough. We will gather the rest on our own."},{"name":"NANASHI","text":"We shall search on our own. We are not a parasite."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; Have you the branch?"},{"name":"NANASHI","text":"Many thanks for this. Now let us return to the hunters' camp and be done with it."},{"name":"MARCECHAMP","text":"Well, call me a chocobo's uncle, I'm impressed. You've given me more than your debt called for! These branches'll make for fine arrows."},{"name":"MARCECHAMP","text":"We've usually got to send a whole party of hunters to gather this much, what with the meliae's thrashin' about and the Gnath lurkin' in the brush. Heh, even with those scrawny arms an' legs, you proved more useful than I thought."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; We were...<span class=\"emphasis\">useful</span>?"},{"name":"MARCECHAMP","text":"Aye, I would say so. To be honest, I didn't expect you to come back with so much. Or to come back at all, for that matter."},{"name":"NANASHI","text":"We too will be honest. We thought to flee, but this hunter persuaded us to stay. But we...we were <span class=\"emphasis\">useful</span>?"},{"name":"MARCECHAMP","text":"Hahaha! I said you were, didn't I? In fact, I tell you what. Since you brought me more than a fortnight's worth, I'll even throw in a small reward: a sack of gysahl greens to take home to your kin."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; A <span class=\"emphasis\">reward</span>!? You mean, more of those tasty greens? For being useful?"},{"name":"NANASHI","text":"We tried to find a way to be useful at Loth ast Vath. We tried, but we could not find our purpose."},{"name":"MARCECHAMP","text":"Well, we hunters ain't like to turn away an extra pair of hands, beastman or not. An' we offer fair pay to adventurers willin' to take on the more dangerous tasks. Ain't that right, <span class=\"highlight\">Forename</span>?"},{"name":"NANASHI","text":"“Adventure-er”? There are those who travel to the wilds of their own accord? Risk life and limb all for the sake of these...“rewards”?"},{"name":"NANASHI","text":"Such excitement, such fortune! We want to become an adventurer!"},{"name":"MARCECHAMP","text":"Can't say I've come across an adventurer who requested gysahl greens as a reward, but we'd be willin' to compensate for honest work. If it's food you're after, I'm sure we could arrange for some spare cuts of meat, too."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; More crunchy greens <span class=\"emphasis\">and</span> juicy flesh! Enough to feed our colony! We will relay this to the storyteller at once!"},{"name":"MARCECHAMP","text":"Enthusiastic little bugger, ain't he? Come to think of it, we've only traded with the Vath sporadically, but they don't seem like such a bad lot. Maybe this'll work in both our favors."},{"name":"STORYTELLER","text":"Thank you hunter, for bringing our nameless brother back. We hope he was not a burden on you."},{"name":"NANASHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is no hunter, Storyteller. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is an <span class=\"emphasis\">adventurer</span>! And we are a burden no more! Look at what we have brought you."},{"name":"STORYTELLER","text":"&lt;crunch&gt; What strange-looking plants...yet they have such a delightfully bitter taste."},{"name":"NANASHI","text":"We have other good news. We have found our purpose. We will become an adventurer, too. If we work hard, the hunters promised to reward us with food. Food for the colony!"},{"name":"STORYTELLER","text":"You mean the hunters of the east? We thought it safer to limit contact with them. But they gave you such delicious rewards...hmmm."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; You have done well, nameless one. With your newfound purpose, we are sure you will ease the hunger of your brothers and sisters."},{"name":"STORYTELLER","text":"But trading with the hunters will not solve all of our woes. Much more is required for our survival. Yes, much more."},{"name":"IDATEN","text":"Our colony is falling into disrepair. We need metals for our defenses. We need clay for our walls. The Onemind knows this. They seek to impoverish us."},{"name":"IDATEN","text":"A few of our Nonmind brothers tried to steal such things from Loth ast Gnath. They never returned. The Overmind rages at what he sees as boldness. Even though we are mere leeches, partaking of tiny drops of their blood. Tiny drops."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; Even leeches do not loathe their own host as much as we. It is shameful that we must still rely on the Onemind to survive."},{"name":"NANASHI","text":"You can rely on <span class=\"emphasis\">us</span>, Storyteller! We shall travel the realm and offer our services in exchange for resources. We will bring back precious rewards from beyond."},{"name":"STORYTELLER","text":"Travel the realm? You mean to cross the hunters' borders to lands beyond? Nameless one, it is too dangerous."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; Fear not. It is what adventurers do! To explore unknown lands, meet their peoples, obtain greater rewards. Strengthen the colony!"},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; ...You speak strongly of your purpose. Very well. Should you succeed, we can sever ourselves from the Onemind completely. We can truly become our own masters."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; But do not become a pest, seeking work where there is none. The hunters may take offense at your eagerness to obtain rewards. How will you know when your services are required?"},{"name":"STORYTELLER","text":"An Adventurers' Guild? A place to exchange information and gather requests from others?"},{"name":"STORYTELLER","text":"Nameless one, no such place exists here. If this is your solution, you must start your own. But I am certain you will not be alone; some of your brothers and sisters still want for purpose. Seek them out."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; An Adventurers' Guild! There is much to do. But first, we will introduce you to our brothers. Come, come!"},{"name":"STORYTELLER","text":"That nameless one has changed much from when he first came here. He was so timid and he hardly spoke. For every Vath that finds his purpose, our sanctuary comes closer to weaning itself from the Onemind."},{"name":"IDATEN","text":"&lt;click&gt; &lt;click&gt; We wonder... Will the Adventurers' Guild mean we <span class=\"emphasis\">welcome</span> outsiders? What a strange concept. We thought a colony is built to protect us from the outside."},{"name":"AKINDO","text":"&lt;click&gt; &lt;click&gt; We tried to peddle like the vendor once. He mocked our wares, calling them no better than stones and sticks. So we took that name. We do not know if our wares are as useful as his. We only know that we enjoy peddling."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; This is the stickpeddler. He peddles sticks. He lost his connection with the Overmind near the same time as we did. There was one other, but we do not see him."},{"name":"AKINDO","text":"You mean the keeneye? He saw shadows fly across the colony. He was hungry, and said he would hunt the shadows east toward the river."},{"name":"AKINDO","text":"He could not have gone far, for he fears the water. Fears it much. He would not cross the river unless it was near the bridge."},{"name":"NANASHI","text":"Wise Vath know to avoid the bridge, for ferocious dragons often lurk near it. Could it be they were the shadows that the keeneye saw?"},{"name":"NANASHI","text":"Brave adventurer, could you check the bridge while we search the area for the keeneye? He could be in trouble!"},{"name":"NANASHI","text":"But do not slay dragons if you see them. Dead dragons will invite reprisals. We will lend you one of our kongamato. We have fitted it with a contraption which sprays a putrid smoke which irritates, but does not wound. Yes, irritates. We got too close to it once. Most irritating."},{"name":"NANASHI","text":"The kongamato are unaccustomed to fleshling riders. If you fall off, talk to the stickpeddler. He will help you get back on. Now let us find the keeneye!"},{"name":"SYSTEM","text":"Ride the kongamato to the bridge and use its spray on any ferocious dragons you see."},{"name":"AKINDO","text":"Be careful. The kongamato may throw you if startled."},{"name":"DRAGONPUPPYA02255","text":"&lt;cough&gt; &lt;cough&gt; Gah, it burns! I don't like this game anymore!"},{"name":"DRAGONPUPPYB02255","text":"&lt;sputter&gt; Ahhh, why do you do this?"},{"name":"DRAGONPUPPYA02255","text":"I move for no man!"},{"name":"DRAGONPUPPYB02255","text":"None shall pass! None shall pass!"},{"name":"SYSTEM","text":"The dragon younglings are playfully guarding the bridge. Speak with the Vath stickpeddler to ride a kongamato and use its Fumigate ability to drive the creatures away."},{"name":"AKINDO","text":"The kongamato must wear masks for protection from the putrid smoke. It is a shame, for their faces are quite endearing. Yes, quite endearing!"},{"name":"SEARCHER","text":"&lt;click&gt; &lt;click&gt; We thought we were finished. We could not hope to slip past one dragon, let alone two."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; He is the keeneye. So he named himself, for he never tires of discovery. He returned to the hive soon after you departed to search the bridge."},{"name":"SEARCHER","text":"&lt;click&gt; &lt;click&gt; We are grateful to you for your assistance. We enjoy exploring the lands near the colony, but we were careless in our search for curious things."},{"name":"SEARCHER","text":"Our nameless brother tells us he will open an Adventurers' Guild in Loth ast Vath. It was not long ago that we too yearned for purpose, and we will gladly join him in his mission."},{"name":"NANASHI","text":"Then it is decided. The keeneye will help us find many opportunities for adventure. Many opportunities!"},{"name":"NANASHI","text":"But our guild is not yet complete. We are unsure of the actual trade of adventuring. How to find things, how to fight things... We cannot do it without an experienced teacher. Kind adventurer, will you teach us your ways?"},{"name":"Q1","text":"Will you guide the nameless one as a mentor?"},{"name":"A1","text":"&lt;click&gt; &lt;click&gt; ...Very well."},{"name":"A1","text":"I cannot."},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; Wonderful, wonderful! From now on, we shall call on you as a master of the craft...Master!"},{"name":"NANASHI","text":"Leave the construction of the guild to us. The keeneye will be on the lookout for our hunter friends and any requests they may have."},{"name":"NANASHI","text":"But there are very few adventurers to carry out the tasks now. Very few. In fact, only you. We were hoping you could show us how it is done."},{"name":"NANASHI","text":"The storyteller told me he is most pleased with your deeds to our colony. Consider us friends! And from now on, let us work together. For the guild!"},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; And now that we have found purpose, we...no...<span class=\"emphasis\">I</span>...shall be nameless no longer! As I long to have so deft an arm in adventuring, I shall call myself...Deftarm!"},{"name":"NANASHI","text":"&lt;click&gt; &lt;click&gt; ...We understand. Perhaps we should find a new purpose. Forgive us."},{"name":"SYSTEM","text":"The nameless one is now called the Vath deftarm, and an Adventurers' Guild has been constructed in Loth ast Vath. The hunters of Tailfeather are now clients of the Adventurers' Guild!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Vath."},{"name":"SYSTEM","text":"Vath tribal quests are now available from the Vath keeneye."},{"name":"SYSTEM","text":"Furthermore, you now have access to a selection of wares from the Vath stickpeddler."}],"reward":{"gil":1027},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[67152]},"next":[67792]},"partials":[{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"npc","id":"1016837","obj":{"i":1016837,"n":"Nameless One","l":2000,"q":1}},{"type":"npc","id":"1011916","obj":{"i":1011916,"n":"Marcechamp","l":2000,"q":14}},{"type":"npc","id":"1011922","obj":{"i":1011922,"n":"Grimold","l":2000,"q":5}},{"type":"npc","id":"1011929","obj":{"i":1011929,"n":"Vath Fleetfoot","l":2000,"q":9}},{"type":"npc","id":"1016835","obj":{"i":1016835,"n":"Nameless One","l":2000,"q":1}},{"type":"npc","id":"1016836","obj":{"i":1016836,"n":"Nameless One","l":2000,"q":1}},{"type":"npc","id":"1016838","obj":{"i":1016838,"n":"Vath Stickpeddler","l":2000,"q":1}},{"type":"npc","id":"1016839","obj":{"i":1016839,"n":"Defiant Dragon","l":2000,"q":1}},{"type":"npc","id":"1016840","obj":{"i":1016840,"n":"Daring Dragon","l":2000,"q":1}},{"type":"npc","id":"1016892","obj":{"i":1016892,"n":"Vath Keeneye","l":2000,"q":1}},{"type":"quest","id":"67152","obj":{"i":67152,"n":"Lord of the Hive","g":3,"l":"The Dravanian Forelands","s":37}},{"type":"quest","id":"67792","obj":{"i":67792,"n":"Adventurers Don't Get Cold Feet","g":46,"l":"The Dravanian Forelands","s":2,"f":1}}]}