{"quest":{"name":"A Symbiotic Friendship","location":"The Dravanian Forelands","id":67796,"patch":3.2,"sort":6,"beast":7,"unlocksFunction":1,"eventIcon":71341,"issuer":1016802,"target":1011928,"genre":46,"journal":["The Vath deftarm overlooks the guild with satisfaction.","The Vath deftarm greets you warmly and tells you that the colony is thriving. Many new Vath are inspired by the guild's humble beginnings, choosing their purpose as adventurers under the deftarm's tutelage. Admitting that he is no good with sentimentality, he asks you to visit the storyteller, who also wanted to speak with you.","The storyteller expresses gratitude on behalf of Loth ast Vath for your efforts to help the hive. He observes that while the Overmind is well aware of the Vath's strength in allies and has been keeping tight guard over his subjects, there are always those who escape to the sanctuary, and he is eager to tell their story. The storyteller imparts upon you the Vath will not forget what you have done for them, and to ever consider yourself a part of the hive. "],"objectives":["Speak with the Vath storyteller."],"dialogue":[{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Master, what a pleasant surprise. Even though you are so busy with your own quests, I am glad you always stopped by to help me with the Adventurers' Guild. I could not have done it without you."},{"name":"UDEKIKI","text":"Our colony thrives, Master. Our new brothers and sisters are inspired by the guild's beginnings and your generous help. Many now seek my tutelage to become adventurers themselves. They seek me as the one who learned from you."},{"name":"UDEKIKI","text":"I would say more, but you know I am no good with these things. No good at all. The words come out strange. But the storyteller wanted to see you, too. I think he could tell you better than I."},{"name":"UDEKIKI","text":"The storyteller wished to speak with you about something important. Yes, important. Please seek him out."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; Kind hunter, generous hunter, you have contributed to our humble hive more than you know. And for that, we are truly grateful."},{"name":"STORYTELLER","text":"The Overmind now knows of our strength. We are certain he will do all in his power to keep his hold on the Onemind. But there will always be those who stray; there will always be Vath."},{"name":"STORYTELLER","text":"More Vath means more individuals, those with different minds and feelings. We cannot hope to agree on everything, but we accept this divergence. Even if it leads us to clash amongst ourselves, it is worth our freedom."},{"name":"STORYTELLER","text":"Through our colony's trials to preserve our existence, we will continue to tell our story. And we do not forget those who joined us in our struggles."},{"name":"STORYTELLER","text":"We had no choice when we were linked to the Overmind. But now, we choose to strengthen our bonds with you, hunter. You may ever consider us your brothers and sisters."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Vath."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the Vath tribal daily quests."}],"reward":{"gil":405,"items":[{"num":3,"id":21072}]},"reqs":{"beastrank":7,"jobs":[{"lvl":50,"id":34}],"quests":[67795]}},"partials":[{"type":"npc","id":"1016802","obj":{"i":1016802,"n":"Vath Deftarm","l":2000,"q":6}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"item","id":"21072","obj":{"i":21072,"n":"Venture","l":1,"c":65049,"t":100}},{"type":"quest","id":"67795","obj":{"i":67795,"n":"Resistance Is Futile","g":46,"l":"The Dravanian Forelands","s":5,"f":1}}]}