{"quest":{"name":"Bugging the Bugs","location":"The Dravanian Forelands","id":67799,"patch":3.2,"sort":9,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1011920,1017031],"genre":47,"journal":["The Vath keeneye is clacking his mandibles nervously.<br>※The difficulty of this quest will be synced to your current level.","A crop of gysahl greens at Tailfeather has been besieged by insects, and the Vath keeneye is beside himself with worry. Luckily, the Vath have a potent insect repellent for just such an occasion. He asks that you make for Tailfeather with great haste to dispel these horrid pests. First, you must speak with the Vath kintamer to mount a kongamato equipped with vilekin repellent.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You speak with the Vath kintamer who helps you mount a kongamato. Fly to Tailfeather and do away with the insect menace.","You spray the gysahl greens with a powerful blast of the repellent. Unfortunately, a hunter─Louisonet─happened to be standing in the patch of greens when you did so. After regaining composure, he informs you that you have not sprayed the greens in their entirety. He asks that you aim more carefully when you tend to the remaining portion of the plot.","You successfully do away with the remaining insects, inadvertently dousing Louisonet a second time in the process. He thanks you all the same, and asks that you make one more stop before returning to Loth ast Vath. These insects are quite persistent in their search for gysahl greens, and have gone so far as eating them from traps in the Chocobo Forest. He asks that you fumigate those greens as well before there is nothing left of their traps.","With no other potential targets in sight, you spray the remaining gysahl greens with abandon, driving off the remaining insects. Return to Loth ast Vath, and let the Vath keeneye know the greens are safe.","The Vath keeneye is overjoyed to hear the gysahl greens are safe. He recalls the first time they used this repellent and the praise showered upon him by Louisonet. However, it would seem the Vath still have much to learn of their new friends and their turns of phrase."],"objectives":["Speak with the Vath kintamer.","Ride the kongamato and use its Fumigate ability to drive the bugs from the gysahl green patch.","Use the Fumigate ability once more to drive the bugs away from the gysahl green patch.","Use the Fumigate ability to drive the bugs away from the gysahl green traps.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"Great hunter! Please, you must help! We received terrible news from Tailfeather. The hunters suffer from a vermin infestation. They say the crops of tasty greens are in danger! &lt;click&gt; &lt;click&gt;"},{"name":"SEARCHER","text":"The tasty greens are precious to the Vath. Yes, very precious. Our brothers and sisters will starve without them. The kintamer has fitted our kongamato with canisters of repellent to drive off the pests. Go quickly, great hunter. Fly to Tailfeather and spray the crops!"},{"name":"MUSHIKAI","text":"The kongamato is ready to spray the tasty greens. &lt;click&gt; &lt;click&gt; Be careful, the pest repellent is very pungent. I spilled it once. The smell was much too strong for me. Yes, much too strong."},{"name":"MUSHIKAI","text":"Oh, did you fall? &lt;click&gt; &lt;click&gt; Fear not, great hunter. Kongamato can be fickle─yes, very fickle─but they always return home to us. Hang on tight, and be mindful of the repellent."},{"name":"LOUISONET","text":"What the─ &lt;cough&gt; &lt;cough&gt; By the gods, it's everywhere! My eyes are burning! I take it this was meant for the crops? &lt;cough&gt; Well, I think you missed a spot. But please, I beg you, mind your aim!"},{"name":"LOUISONET","text":"Oh gods, why!? &lt;cough&gt; &lt;cough&gt; I think I'm going to be ill. At least the bugs are gone now."},{"name":"LOUISONET","text":"Ah, before you go, mind making a trip into the Chocobo Forest? Those bugs have been eating up our greens every chance they get, and we have two traps out there using them as bait. The last thing we need is our traps to be empty before the chocobos find them."},{"name":"LOUISONET","text":"How am I supposed to grow anything with these godsdamned bugs eating everything? "},{"name":"SYSTEM","text":"Insects are swarming about the gysahl greens. A repellent of some kind is needed to drive them away."},{"name":"LOUISONET","text":"Where'd that strange, giant insect of yours go? Don't tell me you've changed your mind about helping. We desperately need those traps."},{"name":"SYSYTEM","text":"The insects swarming the gysahl greens have been driven away!"},{"name":"SEARCHER","text":"Are the vermin gone? The tasty greens are safe? This is good news. Yes, very good news."},{"name":"SEARCHER","text":"Hunters are always so thankful. At least, we think so. Louisonet once said, “Bugger me if that's not the best trick I ever saw.” We don't quite understand. Bugs are bad for the tasty greens, yes? &lt;click&gt; &lt;click&gt; Why does he wish to be a bug?"}],"reward":{"gil":461,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1011920","obj":{"i":1011920,"n":"Louisonet","l":2000,"q":3}},{"type":"npc","id":"1017031","obj":{"i":1017031,"n":"Vath Kintamer","l":2000,"q":4}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}