{"quest":{"name":"Adventurers Don't Get Cold Feet","location":"The Dravanian Forelands","id":67792,"patch":3.2,"sort":2,"icon":100541,"beast":7,"unlocksFunction":1,"eventIcon":71341,"issuer":1016802,"target":1016802,"involved":[1011907,1011928,1016841,1016842,1016843,1016890],"genre":46,"journal":["The Vath deftarm looks to be in high spirits.<br>※The difficulty of this quest will be synced to your current level.","The colony has used some of its newfound wealth to procure second-hand cannons for their defense. However, the cannons did not come with the stock of firesand required to operate them. Not to be discouraged by the Gnath's fierce guard of the sulphur needed to make the powder, the deftarm sought advice from Marcechamp. The hunter made mention of the Convictors of Coerthas, who own cannons similar to the deftarm's second-hand ones. The Vath adventurer concludes that the dragonslayers must have a large supply of firesand on hand, and is eager to make their acquaintance. Before making your way to Coerthas, rendezvous with the deftarm on the edge of the Chocobo Forest. <br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You meet with an anxious Vath deftarm near the edge of the forelands, who remarks that this would be the furthest he has been from his home. But your journey is soon interrupted by a familiar foe.","You find yourself face-to-face with a Gnath brandishing a musket, whom you quickly dispatch. Afterwards, an ashamed deftarm explains that he was unable to join the fray because the voices of the Gnath struck fear in him. Turning his thoughts to the task at hand, he bids you continue onward to Coerthas.","The deftarm is overwhelmed by his first sight of snow. Unfortunately, he appears rather less comfortable in the cold. Shivering, he slowly makes his way towards the Convictory.","Jantellot quickly overcomes his astonishment at being addressed by a giant talking crab once the deftarm expresses his desire for firesand. The fledgling adventurer makes the mistake of declaring he will perform “any task” in exchange, prompting Jantellot to bid the Vath rid the camp of lesser dragons entirely. After failing to convince Jantellot to change his request, the deftarm is at a loss as to how to slay a horde of dragons on his own. However, recalling the Vathic methods of driving dragons away, he quickly departs the camp to search for herbs to make incense, but not before asking that you prepare a fire outside the camp.","You build a fire with the bundle of wood that Jantellot provided, and wait for the Vath's return. Just as the scouts have spotted lesser dragons flying over the ridge towards the camp, the deftarm appears with the dried herbs. He tells Jantellot if he lights them aflame, it will produce a smoke so potent that it forces dragons to retreat. The Convictor seems doubtful of its effectiveness at first, but is pleasantly surprised when he sees the results for himself. He offers firesand to the deftarm in exchange for more of the herbs to which the deftarm gleefully accepts. With mention of the guild and its services, a deal is struck between the Vath and the Convictor leader. Speak with the deftarm before you set off for Loth ast Vath.","The deftarm is satisfied that he was able to fulfill his quest, but expresses relief that he can now leave the freezing climate of Coerthas. Return to Loth ast Vath to apprise the storyteller of the developments.","You arrive at Loth ast Vath, but the storyteller informs you that the deftarm has not returned yet. Sensing something amiss, he asks you to search for him.","You find the deftarm in front of the colony. Strangely enough, it appears he lost his way on the path home. Speak to him once more at the Adventurers' Guild. ","The deftarm deems the trip to Coerthas a success, as he has been able to secure a supply of firesand for Loth ast Vath's cannons. Although the colder clime was not to his liking, he is pleased with his first journey outside of the Dravanian forelands. The deftarm dreams of seeing more of the realm, but his next foray will have to wait as his responsibilities as head of the guild will keep him busy for a while."],"objectives":["Rendezvous with the Vath deftarm near the edge of the Chocobo Forest.","Speak with the Vath deftarm.","Speak with the Vath deftarm in the west of the Coerthas western highlands.","Speak with Jantellot at the Convictory.","Build a fire outside of the camp.","Speak with the Vath deftarm.","Report to the Vath storyteller.","Search for the Vath deftarm near Loth ast Vath.","Speak with the Vath deftarm."],"dialogue":[{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; It seemed like it took days for the sun to set when I had no purpose. Now I barely notice until the braziers are lit! Our guild is so busy!"},{"name":"UDEKIKI","text":"Master is so generous to help us with our clients' tasks. After the guild was constructed, we did not know where to begin. But we watched you, and we learned many things."},{"name":"UDEKIKI","text":"We traded for cannons with rewards we reaped. For our colony's defense. Although they are not new, they should work well enough. But there is a problem. We have no firesand to use them if they are needed."},{"name":"UDEKIKI","text":"I sought to find sulphur─to make our own stock. But the Onemind has claimed all of the deposits for themselves. And they guard them fiercely. Very fiercely."},{"name":"UDEKIKI","text":"I asked Marcechamp where else I could procure firesand. He spoke of a group of fleshlings who slay dragons for glory─dragonslayers. They live far in the south, in the land the hunters call Coerthas. Do you know of them?"},{"name":"UDEKIKI","text":"He said these dragonslayers use cannons much like ours. But bigger. Much bigger! Bigger cannons must mean lots of firesand, yes? Will you come with me to speak with them?"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Thank you. This will be a long journey for me. Very long. I must prepare. Let us meet at the edge of the forest."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I am nervous, Master. I have never traveled beyond the borders of the hunters' camp. What awaits us in the south?"},{"name":"UDEKIKI","text":"These whispers... The Onemind!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; ...Forgive me, Master. Their voices, they frighten me."},{"name":"UDEKIKI","text":"My head aches. They drown out my own thoughts. I lose the will to move."},{"name":"UDEKIKI","text":"No. It is no excuse! All adventurers face many trials. This is my own to overcome. We must press on to Coerthas!"},{"name":"UDEKIKI","text":"What a beautiful land! Everything looks so clean! But my body <span class=\"emphasis\">shivers</span>, as if I had fallen in a river."},{"name":"UDEKIKI","text":"To feel cold all of the time─what an unpleasant feeling. Yes, most unpleasant. Let us hurry and find the leader of these dragonslayers."},{"name":"JANTELLOT","text":"An apprentice? Well, well. So, where is this aspiring adventurer?"},{"name":"JANTELLOT","text":"By the Fury, an enormous armed crab! I <span class=\"emphasis\">knew</span> this day would come! 'Tis my reckoning for the many nights I buttered and supped upon its kin. No matter─I have no regrets!"},{"name":"UDEKIKI","text":"What a strange greeting. &lt;click&gt; &lt;click&gt; I am the Vath deftarm, an adventurer who will perform any task you require. But I request firesand as my reward."},{"name":"JANTELLOT","text":"Hahaha, I must be dreaming. A talking crab, and one requesting <span class=\"emphasis\">firesand</span> at that! You speak as if we have aught to spare."},{"name":"JANTELLOT","text":"Yet if this is a waking dream, then I might as well entertain this crab's offer. Slay the lesser dragons which plague our camp at present, and firesand you shall have."},{"name":"JANTELLOT","text":"There's little glory for us in slaying such frail fiends. Yet you, as a greenhorn, might find it a suitable challenge."},{"name":"UDEKIKI","text":"But I have never killed a dragon before... Even a small one. &lt;click&gt; &lt;click&gt;"},{"name":"JANTELLOT","text":"You said you would perform <span class=\"emphasis\">any</span> task, did you not? I gave you my conditions. Go on, rid us of the dragon nuisance!"},{"name":"UDEKIKI","text":"How about a bundle of sapling branches for arrow shafts instead? Surely you are in need of quality arrows to take care of your foes yourself?"},{"name":"JANTELLOT","text":"We have no need for primitive sticks when we can procure the finest arrows from Ishgard. If you will not do as bade, then I have no use for you."},{"name":"UDEKIKI","text":"What should I do? I cannot kill a dragon. I could not even face the Onemind. Perhaps I cannot be useful after all..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That's not true."},{"name":"A1","text":"Stop being dramatic."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; But he asks an impossible task! How is one of my size able to rid his camp of an entire horde of─"},{"name":"UDEKIKI","text":"But of course! Killing the dragons is beyond my skills. But driving them away is the Vath's specialty!"},{"name":"UDEKIKI","text":"Master, I have a plan. Could I ask you to prepare a fire outside of the camp? I will return once I have found the herbs I need."},{"name":"JANTELLOT","text":"Herbs? For burning? I have heard tales of smoke screens used to keep dragons at bay, but never seen it done. I suppose you will need some firewood."},{"name":"JANTELLOT","text":"Now I find myself wondering if enormous talking crabs taste the same as silent ones. Hmmm... Tastes like crab, talks like people..."},{"name":"JANTELLOT","text":"Our scouts have spotted a group of lesser dragons approaching from beyond the ridge. Now then, where is that apprentice of yours?"},{"name":"UDEKIKI","text":"&lt;pant&gt; &lt;pant&gt; I found them, I found them!"},{"name":"UDEKIKI","text":"Set these withered herbs ablaze. It will create a thick smoke that offends the senses of dragons nearby. They will have no choice but to retreat."},{"name":"JANTELLOT","text":"This had better work. If I find you have wasted my time, I shall be most displeased."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; See for yourself."},{"name":"JANTELLOT","text":"By the Fury, it does work! The little bastards flitted away with their tails between their legs!"},{"name":"JANTELLOT","text":"My apologies for doubting you, adventurer. We shall take as many herbs as you can offer─and you will receive due compensation, of course. Firesand, was it?"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Yes, oh yes! It is my pleasure to serve. If you have other tasks for us, please send word to our guild. In the west."},{"name":"JANTELLOT","text":"You have a guild! Excellent, excellent. If it means the Convictors will be spared their time to concentrate on the larger threats at hand, you can count on our patronage."},{"name":"JANTELLOT","text":"It may take some convincing to get the other Convictors to accept the Vath's incense. Its smell is <span class=\"emphasis\">quite</span> potent. Mayhap if we place it near the latrines..."},{"name":"UDEKIKI","text":"I am glad I did not give up. Although it felt like slaying the dragons would be less work. My legs grew so cold in the snow. I feared they might freeze and snap!"},{"name":"UDEKIKI","text":"&lt;shiver&gt; Let us return home. I must speak with the storyteller about our new client."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; The deftarm? He has not returned to the colony yet. He was not with you?"},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; We wonder where he is... The Adventurers' Guild requires his attention."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Forgive me my lateness, Master. I was...unsure of the path."},{"name":"STORYTELLER","text":"&lt;click&gt; &lt;click&gt; While stockpiles of firesand will prove useful for urgent situations involving dragons, we hope such a day never comes. A day when we must use the cannons more than once."},{"name":"UDEKIKI","text":"We have secured much firesand for our cannons. Much firesand. The colony's defense will be guaranteed as long as we maintain relations with the dragonslayers."},{"name":"UDEKIKI","text":"How vast this world is! And I am hungry to see more of it. But for now, the guild needs tending. Our clients have many tasks for us. Until next time, Master!"},{"name":"SYSTEM","text":"The Convictors are now clients of the Adventurers' Guild!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Vath."},{"name":"SYSTEM","text":"New Vath tribal daily quests are now available from the Vath keeneye."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from the Vath keeneye as a reputation rank bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from the Vath keeneye. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from the Vath stickpeddler."},{"name":"SYSTEM","text":"In order to undertake the next tribal main quest, you must first complete the main scenario quest “A Great New Nation.”"}],"reward":{"gil":1064},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":34}],"quests":[67791]},"next":[67793,69374]},"partials":[{"type":"npc","id":"1016802","obj":{"i":1016802,"n":"Vath Deftarm","l":2000,"q":6}},{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"npc","id":"1011928","obj":{"i":1011928,"n":"Vath Storyteller","l":2000,"q":16}},{"type":"npc","id":"1016841","obj":{"i":1016841,"n":"Vath Deftarm","l":2000,"q":1}},{"type":"npc","id":"1016842","obj":{"i":1016842,"n":"Vath Deftarm","l":2200,"q":1}},{"type":"npc","id":"1016843","obj":{"i":1016843,"n":"Vath Deftarm","l":2000,"q":1}},{"type":"npc","id":"1016890","obj":{"i":1016890,"n":"Vath Deftarm","l":2200,"q":1}},{"type":"quest","id":"67791","obj":{"i":67791,"n":"The Naming of Vath","g":46,"l":"The Dravanian Forelands","s":1,"f":1}},{"type":"quest","id":"67793","obj":{"i":67793,"n":"An Acquired Taste","g":46,"l":"The Dravanian Forelands","s":3,"f":1}},{"type":"quest","id":"69374","obj":{"i":69374,"n":"Adventurers and Admirers","g":84,"l":"The Firmament","s":1101}}]}