{"quest":{"name":"Breath of Fresh Air","location":"The Dravanian Forelands","id":67798,"patch":3.2,"sort":8,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1011917,1011922],"genre":47,"journal":["The Vath keeneye is tilting his head, lost in thought.<br>※The difficulty of this quest will be synced to your current level.","The Vath keeneye is perplexed by a recent request from Tailfeather: herbs to be smoked for recreational purposes. Hoping you might have a better appreciation for this unusual custom, he asks that you travel to the Smoldering Wastes to gather three herb sprouts for the hunters.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You find three herb sprouts growing along the Whilom River. Hurry back to Loth ast Vath and deliver them to the Vath keeneye.","You hand over the herb sprouts to the Vath keeneye, who speedily prepares them for delivery. Unfamiliar with this use of herbs, he insists you deliver them, lest he embarrass himself. The two hunters who requested these herbs, Loupard and Grimold, can be found at Tailfeather.","The hunters are surprised and delighted to receive their packages. Return to Loth ast Vath and inform the Vath keeneye of your successful delivery.","You return to find the Vath keeneye suffering from an unseemly fit of coughing. Ever curious of foreign customs, he confesses to trying the smoking herbs. He fails to understand why hunters would use them, describing the herbs as foul smelling. Should anyone request these herbs again, he intends to warn them of their potential hazards."],"objectives":["Obtain fogweed.","Deliver the fogweed to the Vath keeneye.","Deliver the dried fogweed to Loupard.","Deliver the dried fogweed to Grimold.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"Requests from fleshlings grow stranger by the day. &lt;click&gt; &lt;click&gt; Tailfeather hunters ask us for herbs, but not for eating or salve-making. Fleshlings want to make smoke for recreation."},{"name":"SEARCHER","text":"They say inhaling smoke has a pleasing effect, but we do not understand. Smoke is for driving away dragons or vermin. This use of smoke seems very strange. Yes, much too strange."},{"name":"SEARCHER","text":"We do not understand, but you are a fleshling too. You understand this practice of smoke breathing, yes? &lt;click&gt; &lt;click&gt; This is why we ask that you gather the hunters' herbs."},{"name":"SEARCHER","text":"You can find herb sprouts in the Smoldering Waste, but we do not need many. Three herb sprouts will do nicely. Yes, very nicely."},{"name":"SEARCHER","text":"Welcome back, great hunter. Was your journey successful? Did you find herb sprouts?"},{"name":"SEARCHER","text":"Yes, yes. This will do nicely. Now, what did the fleshlings say to do? &lt;click&gt; &lt;click&gt; First, dry them with fire shards, like so. Then chop into fine pieces, and... There, it is done."},{"name":"SEARCHER","text":"All that remains is delivery. Might I ask that you take them their herbs? We think it better they receive packages from one who understands this smoke breathing."},{"name":"SEARCHER","text":"The order was from two hunters, Loupard and Grimold. They complained other shipments took much too long. They are always waiting. &lt;click&gt; &lt;click&gt; Please hurry. We fear they will grow irritable if we take too long."},{"name":"LOUPARD","text":"Good day to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. What brings you to Tailfeather?"},{"name":"LOUPARD","text":"Ah, the herbs I ordered from the Vath! What a welcome surprise. Goodness knows it's practically impossible to find anything like this out here. It's been a while since I've had anythin' to ease the nerves after a long day of huntin'."},{"name":"LOUPARD","text":"Back when the Sharlayans were still here, they cultivated the stuff in their conservatories. After they packed up and left, though, the plants made their way into the wilds and, well, here we are."},{"name":"GRIMOLD","text":"Ugh, what in the seven hells is taking them so long? Oh, hey there. You wouldn't happen to be coming from Loth ast Vath, would you?"},{"name":"GRIMOLD","text":"You're a lifesaver, truly. I was beginning to think they'd forgotten. Truth be told, their stock isn't very good, but beggars can't be choosers. The merchants who pass through here would easily charge three times as much for something only marginally better."},{"name":"GRIMOLD","text":"I thought about growing my own, maybe even turning a little profit. Then I remembered where the stuff grows, out in the heart of the Smoldering Wastes, and thought better of it."},{"name":"SEARCHER","text":"Welcome back, great─&lt;cough&gt; &lt;cough&gt;─great hunter!"},{"name":"SEARCHER","text":"Ahem. Excuse us. We were curious of this smoke breathing and wished to try it. Learning new fleshling customs is usually helpful, but this we are not so sure. Smoke is too smelly. Yes, much too smelly. It clings to clothing and shell, and incites terrible coughing."},{"name":"SEARCHER","text":"Perhaps we used too much smoke? Hmmm...we are not sure. &lt;click&gt; &lt;click&gt; We must remember to warn hunters of terrible smell and coughing."}],"reward":{"gil":489,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1011917","obj":{"i":1011917,"n":"Loupard","l":2000,"q":9}},{"type":"npc","id":"1011922","obj":{"i":1011922,"n":"Grimold","l":2000,"q":5}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}