{"quest":{"name":"A Refrain for the Undaunted","location":"Mor Dhona","id":67790,"patch":3.2,"sort":604,"icon":112135,"unlocksFunction":1,"eventIcon":71341,"issuer":1008278,"target":1016642,"genre":95,"journal":["The wandering minstrel craves tales of your adventures inside the steel colossus to rouse his muse once more.","It seems word of your recent exploits has reached Revenant's Toll, and the minstrel is desperate to hear your firsthand account. Your story moves the inspiration-starved bard to song, and he delivers a reasonably faithful retelling of your toils and triumphs within Alexander. The experience fills you with a desire to discuss the battles of your past with someone familiar. Walk along the banks of the Thaliak River and reminisce on your adventures with Lightkix.","For reasons you cannot well explain, it would seem you are now able to relive your foray into Midas. Peer into the past, knowing that considered retrospection can often grant valuable insight into the present─and occasionally more tangible rewards.<br><br>※Midas (Savage) can be accessed by speaking with Lightkix in the Dravanian hinterlands, as well as via the Raid Finder."],"objectives":["Speak with Lightkix Eyesfixed."],"dialogue":[{"name":"WANDERINGMINSTREL","text":"A wondrous tale is on the lips of every adventurer in this tavern, the details of which even I can scarce believe. They say that within the rusting relic which straddles the Thaliak, a hero met with a company of warriors wrought from solid steel."},{"name":"WANDERINGMINSTREL","text":"...A-ha! I rather thought it might be you. And you say you crossed swords with these dread automata? Splendid! Tell me <span class=\"emphasis\">everything</span>! Let me hear the sounds of battle echoing throughout that giant's iron innards."},{"name":"WANDERINGMINSTREL","text":"Your story stirs my muse from her slumber! To think that the goblins would contrive mechanical soldiers that could themselves combine to form a veritable walking fortress... And within a walking fortress, no less! The tales of my boyhood were not half as fascinating!"},{"name":"WANDERINGMINSTREL","text":"Your tale reminds me of another. That of the three great kings─Alexander, Midas, and Gordias─whose names must by now seem rather familiar."},{"name":"WANDERINGMINSTREL","text":"Covetous to the core, they spent their lives in a fever of conquest, never for a moment satisfied with their lot. That an ambulating paradise of wisdom and erudition should honor their memory is curious indeed. I can only assume that the genius who conceived it was possessed of a wicked sense of humor!"},{"name":"WANDERINGMINSTREL","text":"Ohhh, a story so steeped in myth could scarce <span class=\"emphasis\">fail</span> to stir the spirit of song within me! Lend me your ear, friend, that I might regale you with the tale of your own adventure!"},{"name":"WANDERINGMINSTREL","text":"In the giant's iron innards, the goblins did toil,♪<br>Through sunrise and sunset, intruders to foil,♪<br>Till the limb of their lodging did chance to awake,♪<br>A path for our weariless hero to make,♪<br>And thus did <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> aim for the beast's second heart,♪<br>Cleaving both it and its keepers apart.♪"},{"name":"WANDERINGMINSTREL","text":"Yet in spite of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> triumph, the goblins all laughed,♪<br>And by means lost to meaning, in victory basked.♪<br>Yea, the giant of steel was far more than it seemed,♪<br>With power beyond knowing, potential ungleaned.♪<br>And thus was our hero compelled to withdraw,♪<br>Resolved to return and do battle once more.♪"},{"name":"WANDERINGMINSTREL","text":"There! A courageous struggle rendered in the naive style, recalling the fantastical tales of youth! But tell me true: did I capture the spirit of your journey?"},{"name":"WANDERINGMINSTREL","text":"I took certain liberties, of course. But then such poems must do more than simply portray an event─they must tantalize the senses and stimulate the imagination! The hymn of battle is as old as time itself, but sung from the heart, it can inspire even the meekest soul to greatness."},{"name":"WANDERINGMINSTREL","text":"Hm? How do I think the poem will end? I was hoping you might tell me! Suffice it to say, I very much look forward to finding out."},{"name":"WANDERINGMINSTREL","text":"I sense the end of your journey is still some way off, however─and that my verse is destined to remain incomplete for a good while yet!"},{"name":"LIGHTKIX","text":"Pssshkoh... Lightkix stands guard over giant of whirlycogs. None shall pass! None shall pass!"},{"name":"SYSTEM","text":"Thanks to the poetical outpourings of the wandering minstrel, you can now relive your foray into Midas."},{"name":"SYSTEM","text":"Midas (Savage) may be undertaken by speaking with Lightkix at the Thaliak River."},{"name":"SYSTEM","text":"For details such as the conditions of entry, speak with Lightkix."},{"name":"SYSTEM","text":"Furthermore, Stone, Sky, Sea options have been updated."}],"reward":{"gil":1056,"instance":30034,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67789]}},"partials":[{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"npc","id":"1016642","obj":{"i":1016642,"n":"Lightkix Eyesfixed","l":2001,"q":3}},{"type":"instance","id":"30034","obj":{"i":30034,"n":"Alexander - The Fist of the Son (Savage)","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":215}},{"type":"quest","id":"67789","obj":{"i":67789,"n":"A Gob in the Machine","g":16,"l":"The Dravanian Hinterlands","s":10,"f":1}}]}