{"quest":{"name":"At Full Pelt","location":"The Dravanian Forelands","id":67806,"patch":3.2,"sort":16,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1011922],"genre":47,"journal":["The Vath keeneye has a rather hairy task for you to tackle.<br>※The difficulty of this quest will be synced to your current level.","The Adventurers' Guild must send pelts to the Convictory, but the Vath are not familiar enough with Coerthan climates to accurately judge which furs are best suited to such extreme temperatures. To prevent any mistakes, the Vath keeneye asks Grimold to take charge of this venture and requests that you go and provide assistance. Make your way to Tailfeather and speak with Grimold.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Grimold informs you that the warmest furs can be obtained from bandersnatches. He tells you he would like to divide the work and asks that you go and hunt down the beasts, while he remains behind to finish preparations for curing the hides you bring back.","You slay two bandersnatches and a Gnath. Find Grimold and deliver the bandersnatch pelts to him.","Grimold is not only pleased with the number of bandersnatch pelts you deliver to him, but he is also impressed by their quality. Upon learning of your encounter with the starved Gnath, he is very glad to have sent you. Make your way back to the Vath keeneye and give him his share of the payment.","As you recount your adventure in the woods, the Vath keeneye is shocked to hear one of his Onemind brothers was lured out of hiding by the scent of meat. Knowing you would have had little trouble dispatching a lone drone, he is more relieved that he did not make the mistake of sending his brethren to assist Grimold. He is convinced they would have found the succulent meat far too difficult to resist."],"objectives":["Speak with Grimold.","Place the scraps of meat at the designated locations and await your quarry.","Deliver the bandersnatch pelts to Grimold.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"Your fleshy skin and warm blood gives you strength in the ice and snow, whereas our shells do little to stave off the cold. Yes, to such climates fleshlings are well suited, but in Coerthas even your kind must wrap themselves in furs."},{"name":"SEARCHER","text":"Yes, the Convictors ever have need of warm pelts. Yet we do not know which beasts are best suited for this purpose, or if what we would provide will even suffice."},{"name":"SEARCHER","text":"We have enlisted Grimold's help. We will split the reward. However, he requires assistance. &lt;click&gt; &lt;click&gt; Great hunter, please go to him."},{"name":"GRIMOLD","text":"Ah, so the buggers had enough common sense to send me someone with hands instead of claws? What a relief! Between the two of us, I reckon we should be able to finish this quickly."},{"name":"GRIMOLD","text":"Now, in these parts, the only beast with a hide thick enough to withstand Coerthan climates is the bandersnatch. Luckily for us, I know just how to catch one."},{"name":"GRIMOLD","text":"Here─take these scraps of meat. Soon as you lay them out, the beasts ought to catch the scent. You'll have all the bandersnatches you could ask for before you can count to three."},{"name":"GRIMOLD","text":"I'll stay here and see to the more mundane preparations once you've finished. I imagine you're as eager as I am to get this over with, so I'll let you be on your way!"},{"name":"GRIMOLD","text":"First time, eh? It's simple. You just lay the bits of meat on the ground, all in different places. If you're lucky, a lone bandersnatch will turn up. Worst case scenario, you'll have three staring you down─nothing you can't handle, I'm sure."},{"name":"GNATHDRONEA02270","text":"(-Outloth Steeldrone-)The fleshling lures us with the sweet scent of blood!? &lt;click&gt; &lt;click&gt; Unforgivable!"},{"name":"GRIMOLD","text":"Oho, you're back already, and without a scratch on you! So do tell, have you got anything to show for it?"},{"name":"GRIMOLD","text":"You mean to say you could've brought back three, but a starved Gnath beat a bandersnatch to the bait? It's a bloody good thing I left the hunting to you, eh? A hungry bandersnatch is one thing, a ravenous Gnath is quite another."},{"name":"GRIMOLD","text":"The Vath, the Gnath─I can't for the life of me tell the two apart! Thinking he's a friendly face, I'd have approached him for myself! Hells' bells, what a pathetic way to go!"},{"name":"GRIMOLD","text":"Well, I'll take things from here. If you could set the pelts over there, I'll make sure they're processed and will deliver them to the Convictory myself. Oh, and before I forget─here's your half of the payment."},{"name":"GRIMOLD","text":"It's all they ever talk about, so I'm sure the Vath are anxious to have you return with their payment. I wouldn't keep them waiting for too long, else they'll likely work themselves into a frenzy."},{"name":"SEARCHER","text":"You have finally returned! &lt;click&gt; &lt;click&gt; How was the hunt?"},{"name":"SEARCHER","text":"After smelling juicy flesh, one of the Onemind made an appearance and threatened you!? How terrifying! But more than that, we are glad we did not send one of our brothers on this task. He would have eaten everything up before the traps were even baited!"}],"reward":{"gil":545,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":4,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1011922","obj":{"i":1011922,"n":"Grimold","l":2000,"q":5}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}