{"quest":{"name":"All about the Eggs","location":"The Dravanian Forelands","id":67809,"patch":3.2,"sort":19,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"genre":47,"journal":["The Vath keeneye has something he wants to show you.<br>※The difficulty of this quest will be synced to your current level.","After greeting you in a most unusual manner, the Vath keeneye tells you of yet another request from the goblins. As always, their appetite for nanka eggs is endless, and he would ask you help fill their most recent order. To lure out nankas heavy with eggs, he says you will need to retrieve bait from a trap set up north in the waters of the Hundred Throes.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You find the trap at the Hundred Throes and inside is a succulent shrimp. Now all that remains is to set your bait upstream of the Whilom River, and wait for nankas to come and take it.","No sooner do you place the shrimp down in the water than two nankas appear. You dispatch them quickly and procure an ample number of nanka eggs. Return to Loth ast Vath and deliver the eggs to the Vath keeneye.","The Vath keeneye is grateful for your assistance, and thankful the Gnath do not hunt nanka eggs to make matters worse. He tells you that, unlike the Vath, the Gnath eat the same dreary food every day. All the more reason he and his brethren are glad to be free of the Onemind, able to make decisions for themselves."],"objectives":["Obtain a nail shrimp from the Vath fish trap.","Use the nail shrimp at the designated location and slay the nankas that appear for their eggs.","Deliver the nanka eggs to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"Welcome, uplander...&lt;click&gt; &lt;click&gt; We need hand-lending muchly for request from Idyllshire. Yes, very muchly."},{"name":"SEARCHER","text":"&lt;click&gt; &lt;click&gt; Were we convincing? We talk with the goblins so much as of late, we thought we would study their speaking. It is interesting. Yes, very interesting. But I digress. The goblins ask us for more of their favorite food─nanka eggs."},{"name":"SEARCHER","text":"You will need to slay nankas heavy with eggs to ensure they are fresh. For that, you need bait. We place traps in the waters of the Hundred Throes to collect nail shrimp. They are a favorite of the nankas during spawning season."},{"name":"SEARCHER","text":"Take the shrimp and lay it in the Whilom River. Nankas plump with eggs will come to eat. Then you can slay them for soft, delicious eggs. &lt;click&gt; &lt;click&gt;"},{"name":"SEARCHER","text":"Did uplander succeed? &lt;click&gt; &lt;click&gt; Did shrimp lure in any nankas?"},{"name":"SEARCHER","text":"Good, good. We are thankful for lenthand from uplander. Yes, very thankful."},{"name":"SEARCHER","text":"&lt;click&gt; &lt;click&gt; We apologize. Goblin speech is much more fun than we thought. Thank you for hunting the nankas for us. Fortunately, those of the Onemind do not eat nanka eggs. It would be much too difficult to hunt them otherwise. Much too dangerous."},{"name":"SEARCHER","text":"They eat the same thing every day. Always the same boring food. We get to discover new, delicious foods like nanka eggs! That is why we are glad to be free. To have choice."},{"name":"SEARCHER","text":"There are still many not used to having choices, but we are glad to see them try, to see them make decisions. Soon they will also understand the wonderful flavor of nanka eggs. &lt;click&gt; &lt;click&gt;"}],"reward":{"gil":489,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}