{"quest":{"name":"Shoo Fly, Don't Bother Me","location":"The Dravanian Forelands","id":67808,"patch":3.2,"sort":18,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1016862,1016880,1017002,1017031],"genre":47,"journal":["The Vath keeneye sighs dejectedly.<br>※The difficulty of this quest will be synced to your current level.","The goblins of Idyllshire have an insatiable appetite for nanka eggs. So much so, the Vath keeneye explains, that they travel to the forelands in search of more in spite of constant deliveries from the Vath. Always near the river, the goblins are now beleaguered by swarms of insects. They refuse to leave, however, asking for the Vath's repellent so they may continue foraging. Speak with the Vath kintamer and prepare for a trip to the Whilom River.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You speak with the Vath kintamer who helps you swing into the saddle. He bids you a safe journey to the Whilom River, asking that you treat the kongamato gently.","As you head south, you find a goblin somewhat removed from the riverbank, troubled by the bugs buzzing about his head. You spray him with the repellent and the bugs immediately disperse. The goblin thanks you, and asks that you head to the river to help his two companions.","You find two goblins near the river and give them a quick spray of the repellent. They thank you profusely then set about their task of scavenging for nanka eggs. Return to Loth ast Vath and inform the Vath keeneye the deed is done.","The Vath keeneye thanks you for your efforts, but still seems unsure of what to make of this influx of goblin visitors. On the bright side, he supposes, more goblins coming to Loth ast Vath means less traveling to Idyllshire for requests."],"objectives":["Speak with the Vath kintamer.","Ride the kongamato and use its Fumigate ability to drive the bugs from the traveling goblin.","Ride the kongamato and use its Fumigate ability to drive the bugs from the traveling goblins.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"Why are goblins always so hungry? When they speak to us, they only speak of food. &lt;click&gt; &lt;click&gt; We are always sending them nanka eggs, but it is never enough. Now they come to the forelands scavenging for more. They are a gluttonous sort. Yes, very gluttonous."},{"name":"SEARCHER","text":"They say freshly caught nanka eggs taste best, so they are always by the river. If they are not eating nanka eggs, they are scavenging. Now they complain of bugs constantly biting them. The river attracts bugs with a nasty bite."},{"name":"SEARCHER","text":"They insist on staying, asking for our repellent to keep bugs away. &lt;click&gt; &lt;click&gt; Will you take the repellent to them?"},{"name":"SEARCHER","text":"We say <span class=\"emphasis\">take</span>, but you need only spray them with our kongamato. One spray and they should stay safe. Bugs hate our repellent very much. You can find the goblins down at the southern end of Avalonia Fallen."},{"name":"MUSHIKAI","text":"The keeneye told us you will be spraying the goblins. &lt;click&gt; &lt;click&gt; The repellent is loaded and ready. Be gentle with the kongamato. They are good mounts, but very testy. We are always gentle. Yes, very gentle."},{"name":"MUSHIKAI","text":"Did you fall? Or maybe the kongamato bucked too hard? &lt;click&gt; &lt;click&gt; Let us help you back on. Be careful not to overwork the kongamato. Its face does not show, but they are sensitive. Yes, very sensitive."},{"name":"GOBLINA02272","text":"Pshhh... Shkohhh...<br>The bugs are gone! No more scratchybites! Thank you, uplander!"},{"name":"GOBLINA02272","text":"Will uplander take spray to the river? Gobbieflock is searching for nanka eggs, but bugs are everywhere! Hard to work with so many scratchybites."},{"name":"GOBLINA02272","text":"Pshhh... Shkohhh...<br>Scratchybites from bugs are horrible! Can uplander make them go away?"},{"name":"SYSTEM","text":"The goblin is being troubled by insects. Mount a kongamato from Loth ast Vath and use its Fumigate ability to drive them away."},{"name":"GOBLINB02272","text":"Pshhh... Shkohhh...<br>Ah, the buzzing stopped. Thank you muchly, uplander. Now we can gather eggs in peace."},{"name":"GOBLINC02272","text":"The nibblebugs, they're leaving! Now we can find lots of nanka eggs. Mmm...soft, sticky nanka eggs."},{"name":"GOBLINB02272","text":"Pshhh... Shkohhh...<br>Scratchybites hurt muchly! Maybe gobbies should go home?"},{"name":"GOBLINC02272","text":"Pshhh... Shkohhh...<br>Cannot see through clouds of nibblebugs. Where are the tasty nanka eggs?"},{"name":"SEARCHER","text":"Welcome back, great hunter. The goblins should be all right for now. If they ever have their fill of nanka eggs, maybe someday they will ask for something else. &lt;click&gt; &lt;click&gt; They never seem to get full. Always eating."},{"name":"SEARCHER","text":"Then again, more goblins visiting Loth ast Vath could mean fewer deliveries to Idyllshire. We can trade goods here instead. This may not be so bad after all."}],"reward":{"gil":461,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1016862","obj":{"i":1016862,"n":"Goblin Scavenger","l":2000,"q":1}},{"type":"npc","id":"1016880","obj":{"i":1016880,"n":"Goblin Scavenger","l":2000,"q":1}},{"type":"npc","id":"1017002","obj":{"i":1017002,"n":"Goblin Scavenger","l":2000,"q":1}},{"type":"npc","id":"1017031","obj":{"i":1017031,"n":"Vath Kintamer","l":2000,"q":4}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}