{"quest":{"name":"Failure to Deliver","location":"The Dravanian Forelands","id":67807,"patch":3.2,"sort":17,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1016859],"genre":47,"journal":["The Vath keeneye seems anxious about something.<br>※The difficulty of this quest will be synced to your current level.","The Vath keeneye sent one of his brethren, the Vath farwalker, to Idyllshire with a cartload of goods. His delayed return, however, has left the Vath keeneye fearing the worst. He asks that you travel south toward the Dravanian hinterlands in search of the wayward Vath.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You find the Vath farwalker, but the reason for his delay is not what you feared. In truth, he was startled by the nearby wyverns and stumbled, knocking over his cart. Still fearful of wyverns nearby, he asks you to search the area for any unbroken cargo that he may complete his delivery.","You find an unbroken jar amidst the fallen cargo. Carry it back to the Vath farwalker, that he may load it back into his cart.","The Vath farwalker is overjoyed to see not all of his cargo was destroyed. However, he cannot shake the feeling the Vath keeneye will be displeased to hear he delivered only one jug. Hoping to appease his overseer, he asks you to search for more unbroken jugs.","You search what remains of his fallen cargo and find one last jug is still intact. Take it back to the Vath farwalker.","The Vath farwalker thanks you for finding a second jug. Though he can now finish his delivery, he still fears the scolding he is sure to receive upon returning. He recalls the reason you were sent, however, and devises a surprisingly deceptive plan to abate the Vath keeneye's anger. He asks you to tell the Vath keeneye that he was, in fact, assaulted by the Onemind, and that you saved him. He then sets off for Idyllshire, and suggests you think carefully about the story you will tell.","You relay a fabricated story of the farwalker's rescue, and the Vath keeneye is glad to hear he is safe and sound. As he tells it, there are Vath with links to the Onemind still strong enough to turn them back to the side of the Gnath. Though he worries his brothers may give in to the pull of their still-unbroken bonds, he believes that, with effort, they will one day be truly free."],"objectives":["Search for the Vath farwalker.","Look for an unbroken Vath jug.","Deliver the jug to the Vath farwalker.","Search for another unbroken Vath jug.","Deliver the jug to the Vath farwalker.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"He is late. Much too late. &lt;click&gt; &lt;click&gt; Oh, fleshling. Perhaps you can help."},{"name":"SEARCHER","text":"The farwalker was to deliver a cart of goods to Idyllshire, but he is taking too long. We fear something has happened. Perhaps something to do with the Onemind."},{"name":"SEARCHER","text":"Our link to the Onemind is very faint, like a whisper. Very hushed. Very quiet. &lt;click&gt; &lt;click&gt; The farwalker's link to the Onemind is not so quiet. He may grow confused and forget himself. He may return to the Onemind!"},{"name":"SEARCHER","text":"Please, travel south toward the hinterlands and search for him. If he does not seem himself, call out his name. He must not forget who he is."},{"name":"GOURIKI","text":"Thank goodness you have come. We were startled by a low-flying wyvern, and the cart toppled over. Now our jars are everywhere. &lt;click&gt; &lt;click&gt; So messy, so very messy. The keeneye sent you to help carry jars, yes?"},{"name":"GOURIKI","text":"Return to the Onemind? Never! With so many broken jugs, however, returning home also seems unpleasant. The keeneye will be angry. Yes, very angry. &lt;click&gt; &lt;click&gt; I think a few jugs may still be in one piece. We can deliver the unbroken ones. Will you retrieve them for us?"},{"name":"GOURIKI","text":"We would go get them, but the dragons... We will wait here and ready the cart."},{"name":"GOURIKI","text":"We should not stay here long. It is too dangerous. &lt;click&gt; &lt;click&gt; Yes, much too dangerous. Please hurry while I ready the cart."},{"name":"SYSTEM","text":"The remnants of black, slimy eggs have spilled through the cracks of the broken jar."},{"name":"GOURIKI","text":"Good, very good. &lt;click&gt; &lt;click&gt; There are still more jars, yes? If I deliver more jars, perhaps the keeneye will not be so angry. Could you bring back one more?"},{"name":"GOURIKI","text":"Delivering two jars would be much better than one. Yes, much better than one jar. Please check for any more unbroken jars."},{"name":"GOURIKI","text":"Thank you, fleshling. The goblins in Idyllshire are expecting many nanka eggs. Yes, many eggs. &lt;click&gt; &lt;click&gt; We only have two jars, but this should be plenty."},{"name":"GOURIKI","text":"The keeneye will still be furious, though. He may try to remove us from the guild. We would lose purpose."},{"name":"GOURIKI","text":"Hmmm, the keeneye was worried about the Gnath, yes? Afraid that we returned to the Onemind? Would you...would you tell him we were attacked, and you saved us from the Onemind?"},{"name":"GOURIKI","text":"The keeneye trusts you very much. Yes, very much. &lt;click&gt; &lt;click&gt; He would believe if you told him. Tread slowly back to Loth ast Vath, and think of a great story. We will finish our delivery to Idyllshire."},{"name":"GOURIKI","text":"We are sure the keeneye will believe you. Yes, very sure. Think of a good story on your way back."},{"name":"SEARCHER","text":"Ah, so we were right! The Onemind tried to reclaim the farwalker. Thank you for saving him."},{"name":"SEARCHER","text":"Sadly, the farwalker is not the only one with a stronger link to the Onemind. &lt;click&gt; &lt;click&gt; The links will fade in time, but we must be careful."}],"reward":{"gil":517,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1016859","obj":{"i":1016859,"n":"Vath Farwalker","l":2000,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}