{"quest":{"name":"Flea Troubles","location":"The Dravanian Forelands","id":67812,"patch":3.2,"sort":22,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1016868,1016869,1016870,1017031],"genre":47,"journal":["The Vath keeneye appears flustered.<br>※The difficulty of this quest will be synced to your current level.","Anyx Trine is facing a parasitic flea infestation and many of its residents find themselves playing host to these nasty bugs. Itchy and irritable, they ask the Adventurers' Guild to send someone to exterminate them. All necessary preparations to deal with the pests have been made, but the Vath adventurers are petrified at the thought of having to deal with agitated dragons. This mission now falls to you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","As he helps you onto the kongamato, the Vath kintamer expresses his amazement at your willingness to attend to the afflicted dragons. Make your way to Anyx Trine and deliver them from their misery.","You exterminate the parasitic fleas without any complications, and the dragons are extremely thankful to be rid of the pests. Head back to Loth ast Vath and tell the Vath keeneye the good news.","The Vath keeneye listens intently, and is once again impressed with your ability to address any type of situation at a moment's notice. He tells you of how he aspires to one day become as courageous and skilled an adventurer as you."],"objectives":["Speak with the Vath kintamer.","Ride the kongamato and use its Fumigate ability on the distressed dragons.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"Mighty hunter, there is a matter at Anyx Trine that requires immediate attention. &lt;click&gt; &lt;click&gt; There has been an outbreak of parasitic fleas in their tower."},{"name":"SEARCHER","text":"These pests are a particularly vicious breed. Even the hardest of scales will provide little protection against them, and already several dragons are in need of treatment."},{"name":"SEARCHER","text":"While it is an easy task of spraying the afflicted dragons with vilekin repellent, many of our brothers and sisters are wary of approaching these great beasts at the best of times. The thought of facing an irritated one is terrifying."},{"name":"SEARCHER","text":"The kintamer has already equipped several kongamato with the necessary canisters. The repellent within is extremely effective and will kill any fleas upon contact. &lt;click&gt; &lt;click&gt; Please fly to Anyx Trine, and help the dragons for us!"},{"name":"MUSHIKAI","text":"Someone rises to the challenge! &lt;click&gt; &lt;click&gt; Take this kongamato. She is prepared to face the fleas head-on!"},{"name":"MUSHIKAI","text":"Do not worry, great hunter! &lt;click&gt; &lt;click&gt; Let us help you remount your kongamato!"},{"name":"DRAGONA02276","text":"You are a welcome sight, adventurer. Had you appeared any later, a great many of us would have turned to fire to solve our dilemma."},{"name":"DRAGONB02276","text":"Ah, what a relief! The itching has finally subsided. May this be the last we see of these wicked fleas!"},{"name":"DRAGONC02276","text":"The dull prickling has vanished. Thank you, adventurer. &lt;sigh&gt; Perhaps, the young ones will now be convinced of the importance of better maintaining our towers."},{"name":"DRAGONA02276","text":"The horrible prickling sensation─it is beyond excruciating. Each bite taken from your flesh gnaws away at your sanity."},{"name":"DRAGONB02276","text":"If only we had hands or claws with which we could reach around to scratch our backs with."},{"name":"DRAGONC02276","text":"It itches. It itches so badly. Is there nothing that can relieve this agony!?"},{"name":"DRAGONA02276","text":"While this vilekin repellent burns my nose and eyes, it is far preferable to the alternative of hosting these despicable creatures for days to come."},{"name":"DRAGONB02276","text":"I have had many a close call in battle, yet never had I felt so hopeless. I suppose the true terrors of this world are not always the ones readily seen."},{"name":"DRAGONC02276","text":"It is unthinkable that our lovely home has been overrun by such nasty critters. It is something that would never have happened when I was younger."},{"name":"SYSTEM","text":"Several dragons just outside the tower look to be in a great deal of pain.  Ride forth on the mount supplied to you by the Vath kintamer and use its Fumigate ability to shower the distressed dragons in vilekin repellent."},{"name":"SEARCHER","text":"You have done it yet again! Your courage is most admirable! While we may no longer be of the Onemind, our inherent fear of dragonkind is not so easily forgotten. Memories of the long history we share have instilled within us a great fear of their kind. A very great fear."},{"name":"SEARCHER","text":"It is an instinct we must overcome. &lt;click&gt; &lt;click&gt; We must learn to be bold and brave like you, after all, the livelihood of our guild depends on it!"}],"reward":{"gil":461,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1016868","obj":{"i":1016868,"n":"Distressed Dragon","l":2000,"q":1}},{"type":"npc","id":"1016869","obj":{"i":1016869,"n":"Distressed Dragon","l":2000,"q":1}},{"type":"npc","id":"1016870","obj":{"i":1016870,"n":"Distressed Dragon","l":2000,"q":1}},{"type":"npc","id":"1017031","obj":{"i":1017031,"n":"Vath Kintamer","l":2000,"q":4}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}