{"quest":{"name":"One More Night in Amdapor","location":"Gridania","id":67818,"patch":3.2,"sort":500,"icon":112124,"unlocksFunction":1,"eventIcon":71341,"issuer":1000692,"target":1006751,"involved":[1008543],"genre":92,"journal":["Brother E–Sumi–Yan requires your assistance in a matter he thought long since put to rest.","A worried Brother E–Sumi–Yan reveals that the stirring of a hostile presence within the walls of the Lost City of Amdapor has prompted the Twelveswood's elementals to abandon their efforts to cleanse the ruins. Travel to Camp Tranquil in the South Shroud and answer Raya–O–Senna's plea for assistance.","Raya–O–Senna bids you delve once more into the Lost City of Amdapor, and banish the entity that has so unsettled the Twelveswood's eternal protectors. Speak with the Wood Wailer Alphene who stands guard at the ruins' entrance.","You prevail upon Alphene to unbar the gate to the ancient city of the Amdapori. What new terror has laid claim to its moldering stones? How many times must you cleanse the ruins of this obdurate darkness?<br><br>※The Lost City of Amdapor (Hard) can be accessed via the Duty Finder.","You have ventured into the darkest reaches of the Lost City of Amdapor, and vanquished the undying guardians lurking therein. Return to Camp Tranquil and inform Raya–O–Senna of your success.","Brother E–Sumi–Yan arrives at Camp Tranquil just as you announce your return to Raya–O–Senna. After hearing the tale of your expedition, the Padjals speculate that the animated statues you encountered may have begun to stir when darkness last took hold within the ruins. And when the elementals subsequently entered the city, the Amdapori sentinels likely perceived the purely aetherial beings as voidsent invaders of the kind often employed by the city of Mhach. The incident thus explained, and the defenses safely disabled, the Padjals may now resume the task of returning the ancient city to the embrace of the forest."],"objectives":["Speak with Raya–O–Senna at Camp Tranquil.","Speak with Alphene outside the Lost City of Amdapor.","Enter the Lost City of Amdapor (Hard).","Report to Raya–O–Senna at Camp Tranquil."],"dialogue":[{"name":"ESUMIYAN","text":"Full glad am I of your presence, <span class=\"highlight\">Forename</span>. The Twelveswood has need of your potent arts once more."},{"name":"ESUMIYAN","text":"Full glad am I of your presence, <span class=\"highlight\">Forename</span>. The Twelveswood has need of your talents once more."},{"name":"ESUMIYAN","text":"Full glad am I of your presence, <span class=\"highlight\">Forename</span>. The Twelveswood has need of your unyielding courage once more."},{"name":"ESUMIYAN","text":"Following your deeds in the Lost City of Amdapor, we had thought the darkness lifted; its haunted walls freed from nightmare."},{"name":"ESUMIYAN","text":"Thus did we enter the ruins, the elementals at our side, intent upon returning that decaying edifice to the forest..."},{"name":"ESUMIYAN","text":"...Only for our immortal companions to withdraw without warning. From their agitated whisperings we later gleaned that an entity of daunting power yet lingers within the bowels of the city."},{"name":"ESUMIYAN","text":"And until this being is put down, the elementals appear loath to return. I pray you, visit Raya–O–Senna where she waits at Camp Tranquil, and answer her plea for assistance."},{"name":"ESUMIYAN","text":"Raya–O–Senna awaits your arrival at Camp Tranquil. The Seedseer has every confidence that you will deliver us from this new threat─as do I."},{"name":"RAYAOSENNA","text":"Ah, Master A–Towa's successor is come! To no other would I entrust this task!"},{"name":"RAYAOSENNA","text":"Ah, the white mage who brought peace to the lost city! To no other would I entrust this task!"},{"name":"RAYAOSENNA","text":"Ah, the intrepid adventurer who braved the darkness of the lost city! To no other would I entrust this task!"},{"name":"RAYAOSENNA","text":"Lest you wonder, I do not doubt your success in expunging the darkness which took root in the ruins before─the heart of that evil was excised, without question. But it would seem that some other power lay dormant beneath the stones all the while, its presence invisible to our senses."},{"name":"RAYAOSENNA","text":"Plainly, however, that power is now very much awake. The elementals' panic attests to that. &lt;sigh&gt; Quieting them will be no small task..."},{"name":"RAYAOSENNA","text":"While my fellows and I endeavor to persuade the elementals to rejoin us, I would have you venture into the city once more. Find the source of this new disturbance...and do what must be done."},{"name":"RAYAOSENNA","text":"The Wood Wailer Alphene yet stands guard at the gate. I daresay he has not forgotten you. Ask and he will let you pass."},{"name":"RAYAOSENNA","text":"You remember Alphene, do you not? I am sure he remembers you. Speak with him when you are ready to brave the ruins, and he will gladly let you pass."},{"name":"ALPHENE","text":"When I heard about this new trouble in the lost city, I thought you might be back. Not one to leave a job half-finished, eh?"},{"name":"ALPHENE","text":"Ware your step in there─aught fit to frighten an elemental is not to be taken lightly, be you favored of the Seedseers or not."},{"name":"ALPHENE","text":"Whatever horror rose to fill the void left by the last blight, it was terrible enough to send the elementals scurrying for the safety of the forest. And that's all I can tell you, I'm afraid."},{"name":"ESUMIYAN","text":"You are returned from your expedition into the lost city? That is well. We for our part have at last succeeded in easing the elementals' disquiet. But tell us, <span class=\"highlight\">Forename</span>: what was the nature of the hostile presence that so unsettled them?"},{"name":"ESUMIYAN","text":"Extraordinary...<br>I was all but certain that some seed of the darkness had survived... I could not have been more wrong."},{"name":"RAYAOSENNA","text":"I certainly did not expect ensorcelled statues.<br>...Creations of the Amdapori magi, I imagine."},{"name":"ESUMIYAN","text":"It would appear so─they likely began to stir when that fiend was awoken by the weakening seal. Yet that does not explain why the elementals would have cause to fear these ancient sentinels..."},{"name":"RAYAOSENNA","text":"It seems safe to assume that the Amdapori built them to repel the armies of Mhach. Were I to hazard a guess, I would say that the passing of the years has dulled the statues' senses, and that they mistook our friends for aetherial beings of a different order─voidsent of the kind employed by the Mhachi magi. The elementals' arrival would have seemed like an invasion."},{"name":"ESUMIYAN","text":"That would explain much, yes. Voidsent monstrosities and undying guardians of stone... The War of the Magi must have been a conflict of truly terrifying proportions."},{"name":"ESUMIYAN","text":"It is well that these ancient relics have at last been laid to rest. With the city's defenses thus disabled, we may safely return to our task of cleansing the ruins. You have our deepest gratitude, <span class=\"highlight\">Forename</span>."},{"name":"ALPHENE","text":"The city feels...quiet. Whatever you did in there, I am happy to report that the hairs on the back of my neck are no longer standing on end. For this I can only thank you. Now be on your way. The Seedseers will wish to hear word of your success!"}],"reward":{"gil":3881,"xp":0,"instance":42},"reqs":{"jobs":[{"lvl":60,"id":34}],"questsType":"all","quests":[66925,67205]}},"partials":[{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"npc","id":"1008543","obj":{"i":1008543,"n":"Alphene","l":56,"q":3}},{"type":"instance","id":"42","obj":{"i":42,"n":"The Lost City of Amdapor (Hard)","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":180}},{"type":"quest","id":"66925","obj":{"i":66925,"n":"One Night in Amdapor","g":92,"l":"Gridania","s":500,"f":1}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}}]}