{"quest":{"name":"Smells Like Trouble","location":"The Dravanian Forelands","id":67810,"patch":3.2,"sort":20,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016863,"genre":47,"journal":["The Vath keeneye is covering his mandibles, trying not to snigger.<br>※The difficulty of this quest will be synced to your current level.","Goblins have requested a variety of herbs to be used in the filter of their masks. Because they requested so many, however, the Vath keeneye has decided to split up the work. He asks that you travel to Avalonia Fallen and retrieve leaves from two of the ten herbs requested─specifically, Danner sage and Whilom mint.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You procure three leaves of Danner sage and Whilom mint respectively. Take them to the Vath keeneye at Loth ast Vath that he can finish preparing the goblins' order.","The Vath keeneye quickly prepares and packs the herbs for an impatient goblin waiting nearby. However, he does not seem eager to complete the delivery in person. He explains that the Vath have not yet grown accustomed to the peculiar look of goblin masks, and cannot help but laugh at the sight of them. Rather than offending his client, he asks that you take them over in his stead.","The goblin's anger is replaced with joy when he sees the fine selection of herbs you brought. He happily makes his way back to Idyllshire, practically singing of the profits he will make."],"objectives":["Obtain Whilom mint.","Obtain Danner sage.","Deliver the mint and sage to the Vath keeneye.","Deliver the package of herbs to the goblin herbalist."],"dialogue":[{"name":"SEARCHER","text":"Tell me, great hunter, what do you think of the masks goblins wear? &lt;click&gt; &lt;click&gt; Quite whimsical, yes? We try not to laugh when we see them. It is very hard not to snicker. Yes, very hard."},{"name":"SEARCHER","text":"The goblins say they are stuffed with various herbs, and change them often to suit their moods. They use many combinations of herbs for their masks, and now they ask for help collecting them."},{"name":"SEARCHER","text":"We were asked to find ten varieties of herbs, but we have split up the work. &lt;click&gt; &lt;click&gt; Too much work for one alone. Yes, too much work. Will you gather two of the herbs for us?"},{"name":"SEARCHER","text":"You can find Danner sage and Whilom mint south of here in Avalonia Fallen. Three leaves of each should be all we require."},{"name":"GOBLIN02274","text":"Pshhh... Shkohhh...<br>We need ingredients to make special blend of smelling herbs, but the Vath are so slow!"},{"name":"SEARCHER","text":"Your timing is perfect, great hunter. One of the goblins has come for the herbs. &lt;click&gt; &lt;click&gt; We fear they are growing impatient. Do you have the herbs?"},{"name":"SEARCHER","text":"Excellent. Now we add these to the others, and... There. The package is ready."},{"name":"SEARCHER","text":"We need you to deliver the herbs. Normally we would ourselves, but their masks..."},{"name":"SEARCHER","text":"&lt;click&gt; &lt;click&gt; We are sure we will offend them with our laughter. Yes, very sure. Vath cannot help but chuckle when seeing their masks up close. They are too funny. You are used to their masks, yes?"},{"name":"GOBLIN02274","text":"We can't wait anymore. Gobbies need smelling herbs for masks!"},{"name":"GOBLIN02274","text":"Oh! Smelling herbs made with this will sell for much, much jinglyshine! Thank you."}],"reward":{"gil":489,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1016863","obj":{"i":1016863,"n":"Goblin Herbalist","l":2000,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}