{"quest":{"name":"Not for the Faint of Heart","location":"The Dravanian Forelands","id":67816,"patch":3.2,"sort":26,"interval":"daily","repeatable":1,"beast":7,"eventIcon":71222,"issuer":1016803,"target":1016803,"involved":[1016879],"genre":47,"journal":["The Vath keeneye stares off into the distance, his unwavering gaze set upon Mourn.<br>※The difficulty of this quest will be synced to your current level.","Mourn has been overrun by pesky dinosaurs, and the Adventurers' Guild is asked to find a way to reduce their numbers. Deciding it to be the safest course of action, the Vath keeneye sends the Vath braveheart to steal their eggs. What was to be a quick job has resulted in the braveheart disappearing for days and now the keeneye needs someone to find─and possibly rescue─his friend. Travel to the caverns of Mourn and look for the braveheart.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You speak with the Vath braveheart, who is paralyzed with fear but adamant about seeing his duties through. Search Mourn for a tyrannosaur egg and deliver it to the braveheart.","You pick up one of the tyrannosaur eggs. Deliver it to the Vath braveheart.","In his panic the Vath braveheart forgot to tell you that he must take back two tyrannosaur eggs. He would like for you to bring him another. Search Mourn for a second egg.","Your last trek through the caves seems to have given you a good idea on where to find the dinosaur eggs and you are quick to locate another one. Pick it up and deliver it to the Vath braveheart.","The Vath braveheart is very upset that the Vath keeneye did not disclose to him all the necessary details before having him embark upon this mission. In a trembling voice, he claims that he will be staying behind in the caverns of Mourn with the beasts he so fears as a form of protest.","The Vath keeneye is stunned and insulted to learn that the Vath braveheart believes him to be unworthy of managing their Adventurers' Guild. He shakes his head and tells you that running an organization is a great deal more difficult than he had ever expected it to be."],"objectives":["Speak with the Vath braveheart.","Obtain a tyrannosaur egg.","Deliver the egg to the Vath braveheart.","Obtain a tyrannosaur egg.","Deliver the egg to the Vath braveheart.","Report to the Vath keeneye."],"dialogue":[{"name":"SEARCHER","text":"We are very concerned, adventurer. &lt;click&gt; &lt;click&gt; The Anyx Trine dragons say the tyrannosaurs have become pests as of late. To cull their numbers, we would steal some of their eggs. We sent the braveheart on this mission."},{"name":"SEARCHER","text":"He was supposed to snatch the tyrannosaur eggs from the caverns of Mourn and bring them back to us. However, he has been gone for many days."},{"name":"SEARCHER","text":"We cannot help but fear the worst. We did not think it to be so arduous a task, but maybe Mourn is fraught with more dangers than we had anticipated."},{"name":"SEARCHER","text":"&lt;click&gt; &lt;click&gt; Please, can you go and make sure no ill has befallen our brother?"},{"name":"BIBIRI","text":"Oh, we are very scared. &lt;click&gt; &lt;click&gt; This place is so scary. We were sent to steal eggs. To only steal eggs. But we are surrounded by such hideous beasts, and we do not know how to fight."},{"name":"BIBIRI","text":"A fleshling? What is it doing here? &lt;click&gt; &lt;click&gt; You have come to help us? Oh, thank you, great savior! We are grateful! We must get eggs, but we are terrified. Can you please go and steal a dinosaur egg for us?"},{"name":"BIBIRI","text":"Oh, we are very glad another adventurer came to help us! There are too many of them. Too many dinosaurs for us to face alone!"},{"name":"BIBIRI","text":"Er... We are sorry. &lt;click&gt; &lt;click&gt; We forgot to mention that we must take back two eggs. Please, kind hunter, bring us another."},{"name":"BIBIRI","text":"Once we retrieve our second egg, we can return. We hope <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> makes haste."},{"name":"BIBIRI","text":"You have brought us another one! You are so swift and smart and brave! You are a master adventurer─much unlike the keeneye."},{"name":"BIBIRI","text":"He told us to go and steal eggs. He did not tell us that we must steal them from such ferocious beasts! We are very displeased. The keeneye is not the keeneye─he is...he is the Vath dulleye!"},{"name":"BIBIRI","text":"We will stay behind as a means of protest. Y-Yes, we are protesting his inadequate leadership. &lt;click&gt; &lt;click&gt; I-It is not that we are too afraid to move. We just refuse to take any more jobs from him today."},{"name":"BIBIRI","text":"Adventuring is not all it is cracked up to be. It is riskier business than we thought. Though, much and more of this risk can be attributed to the keeneye not doing his job properly!"},{"name":"SEARCHER","text":"We are glad to know the braveheart is safe, but to think that he called us an inadequate leader! And now he is protesting!? &lt;click&gt; &lt;click&gt; Running a guild is difficult work."},{"name":"SEARCHER","text":"We sent him to gather eggs because it seemed much safer than sending him to <span class=\"emphasis\">slay</span> the troublesome dinosaurs. If he found this task to be too scary, then maybe the braveheart should change his name. He can be the Vath trembler or the Vath panicker. They are both much more fitting, we think."}],"reward":{"gil":545,"reputation":70,"items":[{"num":15,"id":28},{"id":21079}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":34}]}},"partials":[{"type":"npc","id":"1016803","obj":{"i":1016803,"n":"Vath Keeneye","l":2000,"q":20}},{"type":"npc","id":"1016879","obj":{"i":1016879,"n":"Vath Braveheart","l":2000,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21079","obj":{"i":21079,"n":"Black Copper Gil","l":1,"c":65056,"t":100}}]}