{"quest":{"name":"The Fate of Stars","location":"The Rising Stones","id":67824,"patch":3.3,"sort":16003,"icon":100567,"unlocksFunction":1,"eventIcon":71341,"issuer":1014565,"target":1014565,"involved":[1017115,1017167],"genre":17,"journal":["Unukalhai is preoccupied by the threat of the VIth Legion.","Even as Unukalhai shares his concerns over the presence of the VIth Legion in Azys Lla, he receives word from Y'shtola that imperial forces have dispelled the ward barring ingress to the Aetherochemical Research Facility. Make haste to the Flagship, and rendezvous with Unukalhai at the facility entrance.","Outside the facility, you are joined by Krile and your fellow Scions. Urianger expresses puzzlement at the apparent ease with which the imperial forces dispelled his ward, but Unukalhai is in no mood to explore this mystery, urging you to seize the opportunity to eliminate the intruders. Krile duly uses a nearby terminal to open a direct path to the core laboratories, where the secrets of Allag are stored...","You enter the Aetherochemical Research Facility, ready to do battle with the VIth Legion. But time is short. Cut a path through the imperial rank and file, and defeat the legatus before he can escape with the Genesis Expression.","You carve through the forces of the VIth Legion in your pursuit of Regula van Hydrus, and succeed in halting the legatus mere steps from the tomelith containing his prize. Cursing your obstinate meddling, he reluctantly retreats, though you cannot help but agree with Urianger's appraisal that he will be back. Be that as it may, there is naught to be done now save to follow Unukalhai out of the facility while Krile and the Archons turn their attention to constructing a more potent ward to safeguard the perilous knowledge of Allag.","Safely outside the facility once more, you are unexpectedly joined by Urianger, who accuses Unukalhai of sabotaging his ward. Unable to refute the Archon's reasoning, the boy finally admits to setting a trap for the VIth Legion. Return to the Rising Stones and trouble Unukalhai for an explanation.","In an effort to excuse his uncharacteristically rash behavior, Unukalhai tells you of a star which met its end through the abuse of primal energies. This, he claims, is why it is imperative that those who would use primal-harnessing technologies are stopped by any means necessary. Continue to assist Unukalhai with his plans to eliminate the threat of the Warring Triad, and spare Hydaelyn a similarly tragic end."],"objectives":["Rendezvous with Unukalhai near the Aetherochemical Research Facility.","Operate the facility terminal.","Speak with Unukalhai near the Aetherochemical Research Facility.","Speak with Unukalhai at the Rising Stones."],"dialogue":[{"name":"UNUKALHAI","text":"I am troubled, Warrior of Light. The VIth Legion will not soon surrender its pursuit of Allagan technology..."},{"name":"UNUKALHAI","text":"While it is true that the VIth suffered heavy losses in attempting to breach Azys Lla's defenses, the legion is still very much a force to be reckoned with. Left to his own devices, it will not be long before the legatus moves to─ Hm?"},{"name":"UNUKALHAI","text":"Pray excuse the interruption, but a call to this linkpearl can only come from one of your fellow Scions.<br>...Archon Y'shtola! What news?"},{"name":"UNUKALHAI","text":"...And you are quite certain they have broken through!? ...Yes, of course. We shall leave immediately."},{"name":"UNUKALHAI","text":"...It would seem the thing I feared most has come to pass. The Garleans have succeeded in dispelling the barrier Urianger placed upon the entrance to the research facility. We must intercept and destroy them before they acquire the means to control primal entities."},{"name":"UNUKALHAI","text":"Archon Y'shtola requests that we assemble at the scene of the intrusion. Pray depart at once. I will join you when I have informed the other Scions of this development."},{"name":"UNUKALHAI","text":"Hie you with all haste to Azys Lla. I will join you there anon."},{"name":"UNUKALHAI","text":"I see we are the first to arrive. No matter. Your colleagues should be here anon. They were wise indeed to keep this area under surveillance. Had the Garleans slipped by unnoticed, I dare not think of the consequences."},{"name":"UNUKALHAI","text":"Archon Y'shtola set forth for Azys Lla when it became apparent that the legatus was attempting to breach the barrier, and arrived to find that he had succeeded. We must hope that he has yet to find his prize..."},{"name":"YSHTOLA","text":"Well met, Unukalhai─and thank you for answering my summons so swiftly, <span class=\"highlight\">Forename</span>. We shall all be glad of your presence should we meet with the VIth Legion...as seems all but certain."},{"name":"YSHTOLA","text":"As you may be aware, this facility houses some of Allag's most advanced technology. Accordingly, Urianger sought to deny the Empire easy ingress by weaving a ward of singular potency."},{"name":"KRILE","text":"Not singular enough, it would seem! I would be surprised if the legatus had not reached the core laboratories already."},{"name":"URIANGER","text":"'Tis passing strange... I wove the ward in accordance with the most closely guarded teachings of the archmages of Sharlayan. Naught was left to chance. Naught."},{"name":"URIANGER","text":"'Tis well known that the children of Garlemald have no talent for arcane manipulation, nor hath the Empire more than a cursory knowledge of sorcery. That they should succeed in unraveling so complex a skein of magecraft─and with such surpassing <span class=\"emphasis\">swiftness</span>─is... 'Tis passing strange."},{"name":"YSHTOLA","text":"That it is, Urianger─but 'tis a mystery for another day."},{"name":"UNUKALHAI","text":"Archon Y'shtola has the right of it. Before all else, we must move to safeguard the knowledge which enabled the Allagans to harness primal energies. Of particular concern is the “Genesis Expression”─an aetherochemical formula that allowed the scholars of yore to create substance from nothingness..."},{"name":"YSHTOLA","text":"I know of no such formula. Whence came you by this information? From your enigmatic master, perchance?"},{"name":"UNUKALHAI","text":"He did furnish me with that morsel, yes. And knowing exactly which prize the legatus now seeks enables us to predict his position. Do you not see? We have been gifted the perfect opportunity to remove the head of an entire legion!"},{"name":"KRILE","text":"I didn't think you quite so bloodthirsty, Unukalhai. Surely safeguarding secrets should take precedence over slaying legatuses?"},{"name":"YSHTOLA","text":"Krile's sentiments reflect my own. Yet the two objectives need not be mutually exclusive... What say you, Urianger?"},{"name":"KRILE","text":"...Urianger?"},{"name":"URIANGER","text":"...Ah! Forgive me. My thoughts were bound up in idle imaginings. In answer to thy question, milady: I am content to be led by thee in this matter."},{"name":"KRILE","text":"Right. I've enabled the facility's teleporters. Shall we?"},{"name":"URIANGER","text":"You dwell on the matter of the barrier."},{"name":"URIANGER","text":"I do. Verily, 'twas a warding spell of labyrinthine intricacy─the brainchild of the head of the Students of Baldesion himself. Even the most learned Archon would require some several moons to disentangle such an enchantment. To do so in mere <span class=\"emphasis\">bells</span> would require some preternatural power akin to the very Echo itself!"},{"name":"UNUKALHAI","text":"Within the research facility resides the key to controlling primals: the Genesis Expression. I trust I need not remind you of the danger inherent in allowing such knowledge to fall into the hands of the Empire."},{"name":"SYSTEM","text":"The terminal has been activated. Prepare to teleport into the Aetherochemical Research Facility..."},{"name":"YSHTOLA","text":"After the legatus!"},{"name":"YSHTOLA","text":"...And still they come!"},{"name":"YSHTOLA","text":"Press on, <span class=\"highlight\">Forename</span>. I will handle this!"},{"name":"REGULAVANHYDRUS","text":"I have exposed the bones of their work. Now to extract the marrow..."},{"name":"REGULAVANHYDRUS","text":"Even in the moment of my triumph, you persist in your misguided crusade... So be it. I shall present my prize to the Emperor alongside your head!"},{"name":"YSHTOLA","text":"<span class=\"highlight\">Forename</span>!"},{"name":"YSHTOLA","text":"The tomelith is unbreached, then?"},{"name":"YSHTOLA","text":"...Krile!"},{"name":"REGULAVANHYDRUS","text":"My wounds will not slow my blade should you seek to bar my path..."},{"name":"KRILE","text":"And you would slay me, no doubt─but it would be your <span class=\"emphasis\">final act</span>."},{"name":"REGULAVANHYDRUS","text":"What madness afflicts you Eorzean fools!? The Emperor but desires a means to shackle the eikons and their destructive appetites. Why do you rail against your own salvation!?"},{"name":"UNUKALHAI","text":"It is not for man to wield such power. The primal energy your emperor seeks to contain would be as kindling waiting for a spark."},{"name":"URIANGER","text":"<span class=\"emphasis\">Forget not the White Raven</span>, Legatus. Like thee, he presumed to wield the power of Allag, and invited the Calamity in so doing."},{"name":"UNUKALHAI","text":"This star's fate is too important to be decided by any one man, a warmongering savage least of all!"},{"name":"REGULAVANHYDRUS","text":"Have care, boy─you speak of my emperor."},{"name":"REGULAVANHYDRUS","text":"But dying here in defense of his honor will not further his cause..."},{"name":"KRILE","text":"Well, well... I appear not to be dead."},{"name":"KRILE","text":"Uh? ...OWWW!"},{"name":"YSHTOLA","text":"Krile!"},{"name":"KRILE","text":"I may have cracked a rib...&lt;wince&gt;...or two. But I'll be fine. Honestly."},{"name":"URIANGER","text":"Our foes gave no quarter. Had Unukalhai stinted in his defense of thee, thou may'st be certain thy hurts would be far worse."},{"name":"UNUKALHAI","text":"I could do no less. Mistress Krile is here at my behest, after all."},{"name":"URIANGER","text":"The secrets of Allag are safe for the present, though 'tis doubtful the legatus will return to Garlemald till the prize he coveteth lieth in his grasp."},{"name":"YSHTOLA","text":"Then we must redouble our efforts to protect this place. Krile and I will place additional seals upon the tomelith."},{"name":"KRILE","text":"Unukalhai─"},{"name":"KRILE","text":"I appreciated you staying at my side. Thank you."},{"name":"UNUKALHAI","text":"'Twas naught."},{"name":"KRILE","text":"Oh, please. It was a good deal more than that, and you know it. Now let me help you: when a woman thanks you for saving her life, the customary response is “you're welcome.”"},{"name":"UNUKALHAI","text":"I─ You are welcome."},{"name":"UNUKALHAI","text":"Ah, Urianger, are the new wards already in place?"},{"name":"URIANGER","text":"My colleagues yet toil upon their enchantments. I come unto thee in secret, that I might question thee outside their hearing."},{"name":"UNUKALHAI","text":"...Question me?"},{"name":"URIANGER","text":"Aye. I would speak with the one who undid my subtlest magecraft─he who invited an imperial legatus into this facility, in hopes of engineering the man's demise at the hands of the Warrior of Light."},{"name":"UNUKALHAI","text":"You accuse me of masterminding this day's events?"},{"name":"URIANGER","text":"The plan may have been thy master's, but the deed was thine. Thou didst lure the legatus of the VIth Legion into a trap from which he was not intended to emerge. 'Tis plain to me now that thy seeming opportunism in proposing his elimination was feigned, and that his death was the object of thy plan from the first."},{"name":"UNUKALHAI","text":"And you have proof of this?"},{"name":"URIANGER","text":"Thine own words betrayed thee. Thou didst speak of the Empire's desire to claim the Genesis Expression, the existence of which even the learned Mistress Krile was ignorant. Whence then did the legatus come by such definitive knowledge?"},{"name":"URIANGER","text":"And then there is the matter of mine unraveled ward. None save one possessed of an otherworldly gift could have so swiftly effected its dissolution. Know thee of another blessed with such?"},{"name":"UNUKALHAI","text":"Assuming these accusations have merit, what then?"},{"name":"URIANGER","text":"Full many times and oft doth the pursuit of truth lead men down darkened paths. I take no issue with thy purpose, 'tis but thy method I would call into question."},{"name":"URIANGER","text":"In the Garlean Empire we have a common foe. Hadst thou deigned to share thine intentions with <span class=\"highlight\">Forename</span> or Mistress Krile, 'tis like that we would have closed the trap with less risk to life, and more success."},{"name":"UNUKALHAI","text":"I sought to use the most dangerous secrets of Allag as bait. Who among you would agree to such a reckless plan?"},{"name":"URIANGER","text":"None, and with good cause. Irrespective, thou wert remiss in thy duty to thy comrades. I note with some disappointment that in matters concerning the primals and those who would control them, the cold rationality upon which thou so pridest thyself is conspicuous by its absence..."},{"name":"URIANGER","text":"Know that the salvation of this star is an end too vast for any one of us to accomplish alone. Shouldst thou fail to trust in thy comrades, I foresee thy actions precipitating some terrible misfortune."},{"name":"UNUKALHAI","text":"...Indeed."},{"name":"UNUKALHAI","text":"My sincerest apologies, <span class=\"highlight\">Forename</span>. Urianger is correct in his suspicions: it was I who orchestrated this encounter with the Empire."},{"name":"URIANGER","text":"I would ask that thou forgive Unukalhai this transgression...and keep mention of it from Mistress Krile. 'Twould be a pity for one foolish decision to wither their budding camaraderie ere it had a chance to bloom."},{"name":"KRILE","text":"There you are, you rotten idler! When Y'shtola realized we were struggling with the wards alone, she was absolutely livid!"},{"name":"URIANGER","text":"Ah. Never mind the Warring Triad─I have awoken Archon Y'shtola's tempestuous wrath! In supplicant mood shall I return at once, and there atone for mine indolence!"},{"name":"UNUKALHAI","text":"Come, <span class=\"highlight\">Forename</span>. It is time we returned to the Rising Stones."},{"name":"UNUKALHAI","text":"Once again, I must apologize for acting without your consent or counsel. As a gesture of repentance and a sign of good faith, allow me to share something of myself with you."},{"name":"UNUKALHAI","text":"As Urianger suggested, I possess the gift of the Echo...though it is of a nature different from yours."},{"name":"UNUKALHAI","text":"Regardless, I would use my gift for the selfsame purpose─the salvation of this star. And nothing─<span class=\"emphasis\">nothing</span>─poses a greater threat to the world than the proliferation of primal-harnessing technology. This I know only too well."},{"name":"UNUKALHAI","text":"...What I am about to divulge concerns the fate of another star entirely. On this other world, a magick was devised that allowed the realm's champions to use a stone known as “auracite” to contain the power of primals."},{"name":"UNUKALHAI","text":"So armed, these heroic souls conquered god after god, oblivious to their weapon's fatal imperfection: its propensity to bleed primal energies. And with each victory, the heroes <span class=\"emphasis\">changed</span>, transforming at last into fiends of endless appetite. Insatiable in their hunger for aether, they ultimately went to war over the star's ever-dwindling life force..."},{"name":"UNUKALHAI","text":"...And fought until there was nothing left. Thus, as Urianger so astutely observed, when I am faced with those who rush to embrace power unchecked, I lose all semblance of rationality."},{"name":"UNUKALHAI","text":"Know that my master, too, cares deeply about the fate of this star. I am his servant─his instrument─sent here to ensure that the same tragedy does not consume another world."}],"reward":{"gil":1935,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67766]},"next":[67868]},"partials":[{"type":"npc","id":"1014565","obj":{"i":1014565,"n":"Unukalhai","l":481,"q":9}},{"type":"npc","id":"1017115","obj":{"i":1017115,"n":"Unukalhai","l":2101,"q":1}},{"type":"npc","id":"1017167","obj":{"i":1017167,"n":"Unukalhai","l":2101,"q":1}},{"type":"quest","id":"67766","obj":{"i":67766,"n":"When the Bough Wakes","g":17,"l":"The Rising Stones","s":16002,"f":1}},{"type":"quest","id":"67868","obj":{"i":67868,"n":"Balance unto All","g":17,"l":"The Rising Stones","s":16004,"f":1}}]}