{"quest":{"name":"Deep into the Weeds","location":"The Churning Mists","id":67829,"patch":3.3,"sort":12,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017359,1017360,1017361,1017362,1017363],"genre":49,"usedItems":[15754,15728],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous is flitting back and forth, a dissatisfied frown on his plump features.","The baskets Mogek ordered have yet to arrive, and he is afraid he will be left without any means to transport the heaps of fabrics soon to be completed. While he awaits the first of these shipments, Mogek asks that you go and investigate the reason why the baskets have yet to turn up. Travel to the Sohm Al summit and speak with one of the basket-weaving moogles.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The moogle explains to you, with perhaps a tad too much enthusiasm, that the reason he has fallen behind is because he is having trouble harvesting sankchinni shoots─the main material used to create their wares. He asks that you go and harvest three.","You quickly find and gather three of the sankchinni shoots you promised the apprentice basket weaver. Return to the Sohm Al summit and deliver them to him.","As you prepare to return to Mogek with a report, the novice weaver stops you to ask for one final favor. He requests you to synthesize a few basic basket components, which will serve to accelerate the pace at which the weavers can construct baskets. Once you are finished, he asks that you see they are delivered to the managing moogle.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mendicant moogle.","You fulfill the young moogle's final request by delivering the basket-weaving components to the Mogmender in charge of overseeing the project. With the help of the items that you crafted for them, he is certain he will be able to finish all of the baskets Mogek requires a bit more quickly. Return to Bahrr Lehs and report to Mogek the Marvelous.","Mogek is crestfallen to hear that his projected estimates were off by so much. He decides he must use this opportunity to revise his expectations and mitigate any further repercussions this delay might cause."],"objectives":["Speak with the mendicant moogle.","Obtain three sankchinni shoots.","Deliver the shoots to the mendicant moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize basket components</span><span class=\"alternative\">Deliver the basket components to the managing moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"They're late, kupo. So very late! The baskets I ordered should be here by now, but they are nowhere to be seen! Without them, how are we to transport our fabrics, which are soon to be completed?"},{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, I'm terribly sorry to have to impose upon your generosity, but might you go and investigate the cause of this delay on my behalf?"},{"name":"MOGEK","text":"Fantastic! You should be able to find the Mogmenders overseeing the production of these baskets near the Sohm Al summit, kupo."},{"name":"BEGINNERMOOGLE02293","text":"My baskets are late? How awful! I swear I've been here diligently weaving away from sunrise to sunset─I've worked my paws to the bone!"},{"name":"BEGINNERMOOGLE02293","text":"I-I know that disappointed look. You think I'm lying! I'm not, kupo! I'm only one basket away from fulfilling Mogek's order─well, maybe two─but that's only because I'm unable to gather the necessary materials!"},{"name":"BEGINNERMOOGLE02293","text":"You see, I need sankchinni shoots, but it takes quick hands and incredible precision to pluck them! Please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, would you bring me three?"},{"name":"BEGINNERMOOGLE02293","text":"I cannot afford to fall any further behind. I must get back to work, kupo!"},{"name":"CRATEMOOGLE02293","text":"Thread this through here... Put this in─ Argh! Not again, kupo! Stupid, clumsy paws! &lt;sigh&gt; Once more from the beginning, then."},{"name":"SYSTEM","text":"Quickly grabbing the plant by the roots, you rip it from the air, and successfully harvest the sankchinni shoot!"},{"name":"SYSTEM","text":"Try as you might, the only things to be found are a few mangled roots and leaves."},{"name":"BEGINNERMOOGLE02293","text":"If your sap-stained hands and that piquant smell are anything to go by, you have brought me my shoots, kupo."},{"name":"BEGINNERMOOGLE02293","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>─you are my hero! Once these have been dried in the sun, they will make the perfect baskets. Er, before you go, however, there's one last thing..."},{"name":"BEGINNERMOOGLE02293","text":"I swear on the Mogmenders' name this is my final request!"},{"name":"BEGINNERMOOGLE02293","text":"To ensure a quality basket I need metal clips─something I have no experience forging. I-It's not as bad as you're thinking, kupo! I have the materials right here!"},{"name":"BEGINNERMOOGLE02293","text":"To ensure a quality basket I need wooden clips─something I know not how to craft. I-It's not as bad as you're thinking, kupo! I have the materials right here!"},{"name":"BEGINNERMOOGLE02293","text":"I need a finishing lacquer to coat these baskets with─something I know not how to make. I-It's not as bad as you're thinking, kupo! I have the materials right here!"},{"name":"BEGINNERMOOGLE02293","text":"Please, once you're finished deliver them to the professional basket weaver, just over there. Let me know if there is anything else you need─anything at all, kupo!"},{"name":"BEGINNERMOOGLE02293","text":"Ah, yes! Good thing I made sure to stock up on materials beforehand! I shall get them to you promptly."},{"name":"BEGINNERMOOGLE02293","text":"Oh, yes! If you could, please deliver them to the professional basket weaver. I'm certain even a perfectionist like him will be able to appreciate the quality of these beauties you've crafted!"},{"name":"CRATEMOOGLE02293","text":"Does he think I cannot see what he is doing? Me, the professional basket weaver? Pah! That's just his excuse to slither out of work and have me take up the slack, kupo!"},{"name":"CRATEMOOGLE02293","text":"It's about time, kupo! Thank you, for bringing these to me. With them, I shall be able to finish my baskets that much faster, and soon escape that pompous fool's cheeky smile and grating voice."},{"name":"CRATEMOOGLE02293","text":"Please tell Mogek to hold on for just a bit longer, kupo! We shall have the baskets delivered the moment they are finished!"},{"name":"CRATEMOOGLE02293","text":"Just a little bit more to go, kupo! Once the handles are securely fastened and they're given their finishing coat, all other baskets will pale in comparison!"},{"name":"BEGINNERMOOGLE02293","text":"Wh-What is that look for? I'm working hard. I swear I am, kupo! I'll even prove it. Feast your eyes on─ Oh, bugger, the blasted winds tore it apart again..."},{"name":"MOGEK","text":"It would seem I underestimated the amount of time that must be invested in weaving baskets, kupo. At this point, I suppose there is nothing to do but wait."},{"name":"MOGEK","text":"However, this brings us no closer to solving our current dilemma. Without the baskets, I have no way of transporting the fabrics we'll soon be receiving. &lt;sigh&gt; I must revise my estimations to ensure this has no lasting consequences, kupo."}],"reward":{"gil":700,"reputation":50,"items":[{"num":20,"id":13},{"num":3,"id":21080}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017359","obj":{"i":1017359,"n":"Mendicant Moogle","l":2002,"q":1}},{"type":"npc","id":"1017360","obj":{"i":1017360,"n":"Managing Moogle","l":2002,"q":1}},{"type":"npc","id":"1017361","obj":{"i":1017361,"n":"Sankchinni Shoot","l":2002,"q":1}},{"type":"npc","id":"1017362","obj":{"i":1017362,"n":"Sankchinni Shoot","l":2002,"q":1}},{"type":"npc","id":"1017363","obj":{"i":1017363,"n":"Sankchinni Shoot","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15754","obj":{"i":15754,"n":"Basket Component Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15728","obj":{"i":15728,"n":"Basket Component","l":55,"c":21005,"t":63}}]}