{"quest":{"name":"With a Little Help","location":"The Churning Mists","id":67826,"patch":3.3,"sort":9,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017351,1017352,1017353,1017354,1017355],"genre":49,"usedItems":[15751,15725],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous is in need of a master <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>.","Having inducted a large number of new recruits into his ranks, Mogek the Marvelous is running low on the tools and supplies necessary to see that they are properly trained. He requests that you craft the aforementioned items and directs you to speak with Mogwon, who has been rushing about Asah to gather materials for you.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Mogwon has set aside some prime materials you can use to craft the requested items. He asks that you take the final product to Moguppo, who is overseeing the distribution of supplies.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Mogwon.","Moguppo believes that the Mogmenders will be more enthusiastic about their training if they were to receive their shiny new supplies directly from you. After neatly packaging them up, he passes them to you for delivery.","As you distribute the parcels to each of the novice Mogmenders, they express their thanks before darting away, eager to begin their lessons.","Mogek is delighted to hear that on top of crafting the training implements, you took the time to hand them out individually. He is certain that with your help, the newest of their group are well on their way to becoming master crafters."],"objectives":["Speak with Mogwon in Asah.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize training supplies</span><span class=\"alternative\">Deliver the training supplies to Moguppo</span></span>.","Deliver the training supplies to the mentee moogles.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Well met, <span class=\"highlight\">Forename</span>! I was just about to send for you. You see, the sudden influx of new recruits has us short on woodworking tools and supplies, leaving those who joined us more recently with no means to begin their training."},{"name":"MOGEK","text":"We are sorely lacking in handsaws, and you're just the artisan we need to make them, kupo."},{"name":"MOGEK","text":"We are sorely lacking in sawhorses, and you're just the artisan we need to build them, kupo."},{"name":"MOGEK","text":"We are in dire need of resin, and you're just the artisan we need to mix it, kupo."},{"name":"MOGEK","text":"By now, Mogwon should have secured the necessary materials with which you can do so. If you make your way to Asah, you'll be able to begin crafting straightaway!"},{"name":"MOGWON","text":"Mogek mentioned you'd be along, kupo! Well, I daresay we shall not disappoint─the selection of materials we've gathered for you will even rival the wares of vendors in the inner cities!"},{"name":"MOGWON","text":"Ahem. Excuse me. I exaggerate, of course, but rest assured, all that you need can be found right here! Oh, and if you would, please take the finished product directly to Moguppo. He's been beside himself with excitement since learning you'd be the one creating supplies for our trainees."},{"name":"MOGWON","text":"Run out, have we? Just one moment, kupo!"},{"name":"MOGWON","text":"You can't find Moguppo? Where could he have─ Ah! There he is! If you squint hard enough you can see his ears peeking out from behind those boulders."},{"name":"BEGINNERMOOGLEA02290","text":"Are you also searching for materials to take back to Master Mogwon? Well, you're in the right place, kupo! There's plenty to be found just over there!"},{"name":"BEGINNERMOOGLEB02290","text":"Hm? Is that who I think it is? No, no, it's my imagination playing tricks again. There's absolutely no way <span class=\"highlight\">Forename Surname</span> would be here."},{"name":"BEGINNERMOOGLEC02290","text":"All this flying back and forth has really worked up my appetite. If only I had some kupo nuts to stave off this hunger for just a bit longer..."},{"name":"MOGUPPO","text":"Some moogles find it dull, but I adore this job! Spending my days sifting through the contents of every parcel we receive, and convincing people to sell us things at a cheaper price─why, it's a dream come true!"},{"name":"MOGUPPO","text":"<span class=\"highlight\">Forename</span>, you're right on time, kupo! Did you bring them with you?"},{"name":"MOGUPPO","text":"Oh, they're perfect─so perfect, in fact, it makes me think our novice Mogmenders would feel much more inspired to learn if they received their training supplies from a master <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> such as yourself! I shall wrap them up, so might you distribute them to each of our crafters-in-training?"},{"name":"MOGUPPO","text":"I'm jealous, kupo. These are of a quality that might even surpass those given to our veteran crafters!"},{"name":"MOGWON","text":"Now that everyone has what they need, we can begin training in earnest. I'll have these greenhorns licked into shape faster than you can eat a sack of kupo nuts!"},{"name":"BEGINNERMOOGLEA02290","text":"A special delivery for <span class=\"emphasis\">me</span>? How exciting, kupo! Let's see it, then."},{"name":"BEGINNERMOOGLEA02290","text":"Oho! These are just what I needed! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"},{"name":"BEGINNERMOOGLEB02290","text":"W-Wait! You're the esteemed <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>─in the flesh! How I have longed to meet you!"},{"name":"BEGINNERMOOGLEB02290","text":"Th-These were crafted by <span class=\"emphasis\">you</span>!? I shall treasure them always, kupo!"},{"name":"BEGINNERMOOGLEC02290","text":"What's brought you out all this way, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>? I joined for the free kupo nuts, but now that I'm here, I might as well go the full malm─there isn't any point in starting something unless you're going to be the best!"},{"name":"BEGINNERMOOGLEC02290","text":"These are simply splendid! With them, there's nothing stopping me from becoming the premier Mogmender!"},{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, from what I hear not only did you take the time to craft the supplies I requested, but went out of your way to distribute them as well. Thanks to you, the youngest of our crew couldn't be more excited to start their training!"},{"name":"MOGEK","text":"I just hope their zest for learning doesn't begin to wane over the coming days and weeks, kupo. We need all the paws we can get if Zenith is to be restored in a timely fashion!"}],"reward":{"gil":517,"reputation":50,"items":[{"num":20,"id":8},{"num":3,"id":21080}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017351","obj":{"i":1017351,"n":"Mogwon","l":2002,"q":4}},{"type":"npc","id":"1017352","obj":{"i":1017352,"n":"Moguppo","l":2002,"q":2}},{"type":"npc","id":"1017353","obj":{"i":1017353,"n":"Mentee Moogle","l":2002,"q":1}},{"type":"npc","id":"1017354","obj":{"i":1017354,"n":"Mentee Moogle","l":2002,"q":1}},{"type":"npc","id":"1017355","obj":{"i":1017355,"n":"Mentee Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15751","obj":{"i":15751,"n":"Training Supplies Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15725","obj":{"i":15725,"n":"Training Supplies","l":55,"c":21005,"t":63}}]}