{"quest":{"name":"Hasty Conclusions","location":"The Churning Mists","id":67827,"patch":3.3,"sort":10,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017356],"genre":49,"usedItems":[15752,15726],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous appears slightly flustered.","Despite Mogek's attempts to dissuade him, one of his Mogmenders is convinced that searching the House of Letters will yield the construction materials they have long been eager to strike off of their ever-growing list of necessary items. However, days have passed since he set out on his own for the ruins, and Mogek begins to worry for the moogle's safety. He bids you make your way to the House of Letters and seek out the stubborn moogle.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You come across a moogle who is so immersed in his work he does not notice you approach. Startled by your sudden appearance, he quickly recovers and goes on to explain that he is disappointed by the overall quality of the materials he has unearthed from the House of Letters. Knowing Mogek will not be satisfied by what he has gathered, he begs you to use your superior crafting skills to repurpose the  materials he has found into construction components and deliver them to Mogek the Marvelous.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mettlesome moogle.","The construction materials you deliver to Mogek seem to convince him that the ruins hold far more potential than he had believed. He decides he will begin sending Mogmenders to thoroughly scour the area for materials in the near future."],"objectives":["Speak with the mettlesome moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize repurposed construction components</span><span class=\"alternative\">Deliver the repurposed construction components to Mogek the Marvelous</span></span>."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, I know not what to do, kupo! Several days ago, one of my Mogmenders stormed off when I told him searching the House of Letters for construction materials was a foolish idea."},{"name":"MOGEK","text":"He has been absent for days, and being the hardhead he is, I'm sure he will not return until he has collected an assortment of planks, paints, and pilings large enough to prove me wrong."},{"name":"MOGEK","text":"I fear this means he might never come back, for there is nothing of the sort in Eil Tohm─only hungry predators seeking easy prey. And there's nothing easier than an overworked moogle! Please, find and make sure he is safe, kupo!"},{"name":"GOOUTMOOGLE02291","text":"Gah! P-Please, kupo! I am but skin and bones. I assure you, I do not taste nearly as good as I─<br>...Oh! Thank the gods it's you. As glad as I am to see your friendly face, I beg of you not to sneak up on me like that!"},{"name":"GOOUTMOOGLE02291","text":"Hm? Mogek sent you!? Kupooo! I just knew that smug-faced, pom-swinging miser didn't trust me to bring back anything worthwhile. Well, I'll show him, I will─just look at this huge pile I've gathered!"},{"name":"GOOUTMOOGLE02291","text":"Oh, who am I kidding, kupo! Most of these materials are so old and decrepit it would be a miracle if I could use them to build anything. &lt;sigh&gt; What am I to do with this rubbish?"},{"name":"GOOUTMOOGLE02291","text":"Wait! These metal bars─alone they might be worthless, but with your superb crafting skills maybe you could fashion some nails. Then, even Mogek cannot claim my coming here was a fruitless venture!"},{"name":"GOOUTMOOGLE02291","text":"Wait! These pillars of wood─alone they might be worthless, but with your superb crafting skills maybe you could fashion some beams. Then, even Mogek cannot claim my coming here was a fruitless venture!"},{"name":"GOOUTMOOGLE02291","text":"Wait! These jars of oil─alone they might be worthless, but with your superb crafting skills maybe you could mix me a couple buckets' worth of polish. Then, even Mogek cannot claim my coming here was a fruitless venture!"},{"name":"GOOUTMOOGLE02291","text":"Someone of your expertise should be able to make short work of this, and while you're at it, I will go and search the area for even more things to take back!"},{"name":"GOOUTMOOGLE02291","text":"Anyway, I shall let you get started! If you find yourself in need of more materials, do not hesitate to ask! Oh, and please deliver the finished product to Mogek directly, kupo! "},{"name":"GOOUTMOOGLE02291","text":"You ran out? Fear not─I shall fetch you some more this instant!"},{"name":"GOOUTMOOGLE02291","text":"Oh, they're magnificent! How I wish I could be there to see the look on Mogek's face when you hand them to him!"},{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>! You've returned much earlier than I expected, kupo! Were you able to find our missing Mogmender?"},{"name":"MOGEK","text":"I see, so he has stayed behind to continue his search? Well, for that I cannot fault him─these are simply splendid, kupo! Even more so, considering they were crafted using components found at the House of Letters."},{"name":"MOGEK","text":"Perhaps I was too quick to discount the potential the ruins offered. It is a mistake I mean to rectify immediately, kupo! I shall begin scheduling routine searches of the area... Just as soon as I get the rest of my Mogmenders in order, that is!"}],"reward":{"gil":600,"reputation":50,"items":[{"num":20,"id":11},{"num":3,"id":21080}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017356","obj":{"i":1017356,"n":"Mettlesome Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15752","obj":{"i":15752,"n":"Construction Component Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15726","obj":{"i":15726,"n":"Repurposed Construction Component","l":55,"c":21005,"t":63}}]}