{"quest":{"name":"Freedom for Our Skies","location":"The Parrock","id":67822,"patch":3.3,"sort":4,"icon":100577,"unlocksFunction":1,"eventIcon":71341,"issuer":1017168,"target":1017200,"involved":[1017165,1017536],"genre":18,"journal":["Leofard wishes you to join him in his questioning of Radlia.","Leofard has asked you to accompany him in his interrogation of Radlia. Join the Redbill captain in his chambers, and wait for Radlia to regain consciousness.","Scarcely has Radlia had time to digest the fate of her crew when Leofard questions her motives for exploring the ruins of Mhach. The Talon captain reveals her discovery of an ancient book that details the existence of both the Void Ark and the Nullstone─the knowledge of which fueled her ultimately disastrous ambition. After rejecting Cait Sith's offer to join the Redbills in their quest to defeat the voidsent, Radlia leaves the tattered tome with Leofard. The Redbill captain immediately urges Cait Sith to learn more of the Mhachi relic in his possession, adamant that the freedom of the skies will be threatened no more..."],"objectives":["Speak with Leofard in his chambers."],"dialogue":[{"name":"STACIA","text":"Aye, it all worked out in the end, but I've had just about enough of Leofard's folly.<br>...Ugh, I must've said that a hundred times by now."},{"name":"CAITSITH","text":"...Did the captain receive a blow to the head while we were in Mhach? I could have sworn he just paid me a compliment."},{"name":"LEOFARD","text":"We might be waitin' a while before Radlia finally decides to wake up."},{"name":"LEOFARD","text":"But not so long that you've got time to flit away on some other adventure. Come join me in my quarters, and we can ask her a few questions as soon as she's ready to talk."},{"name":"STACIA","text":"Radlia was moanin' the entire trip back to the Parrock. It can't have been a pleasant experience, bein' dragged around by that nasty fiend...<br>Anyway, let's go haunt the captain's quarters until she regains her senses."},{"name":"CAITSITH","text":"Once I have learned to harness the full power of the Nullstone, we shall have naught to fear from even the Shadow Queen herself!"},{"name":"LEOFARD","text":"Ho there, <span class=\"highlight\">Forename</span>. Might as well make yourself comfortable while we wait on Radlia. Besides, after fightin' through them ruins, I'll wager you could use the rest."},{"name":"RADLIA","text":"Where is the rest of my crew? Surely there were other survivors...?"},{"name":"LEOFARD","text":"Tell me, Radlia. What drove you to risk explorin' old Mhach? The compass sent you there, aye, but you were after the Void Ark. You knew somethin', didn't you?"},{"name":"RADLIA","text":"I found a book. We were looting these strange ruins in the Sea of Clouds, and one of the lads dug up a tome. It had passages that described the Void Ark...and a powerful relic called the “Nullstone.”"},{"name":"CAITSITH","text":"A tome scribed by a Mhachi sorcerer, mayhap? ...Captain, would you happen to know the author of this work?"},{"name":"RADLIA","text":"The words are muddled by obscuring magicks, and fifteen hundred years have faded its pages. There is much that remains illegible, but what little my darling cutthroats and I could decipher suggests it was written by a mage of exceptional status."},{"name":"RADLIA","text":"See for yourself. If what the book says is true, the ark is a source of immeasurable power. With that ship under my command and the mysteries of Mhach in my possession, I had thought to crown myself queen of the skies..."},{"name":"RADLIA","text":"...And look how well that turned out. What manner of sky pirate─what manner of queen─can't even keep her own crew alive?"},{"name":"RADLIA","text":"Ahem. Radlia, is it not? Would I be correct in assuming that you seek revenge against the voidsent who slaughtered your comrades?"},{"name":"RADLIA","text":"Of course I want revenge! That hells-spawned shite-gobbler killed my crew! If he were here right now, I'd gouge out his eyes and choke him to death with my bare, bloody hands!"},{"name":"RADLIA","text":"You are not alone in your desire to bring an end to these abominations, Captain. Will you not join us in our endeavor to secure peace for the skies? Will you not join the Talons' strength to ours?"},{"name":"RADLIA","text":"...What strength? The way things are right now, I doubt I could keep the peace in a monastery."},{"name":"RADLIA","text":"This has naught to do with personal grudges, either. I just don't have the men. All my best fighters died in the ruins, and the dregs that are left are scarce sharp enough to be called Talons."},{"name":"LEOFARD","text":"Did you leave your spine back in them ruins, Radlia? You've had your wings clipped, and no mistake, but that's no reason to give up the life. I thought we'd rescued a sky pirate─not some cur that turns tail when her pack ain't there to bite for her."},{"name":"RADLIA","text":"...I know what you're trying to do, Redbill, but I've lost my taste for glory. You can have the cursed book. Just be sure to make that bastard pay."},{"name":"LEOFARD","text":"...Hey, furball. How quickly do you think you can decipher that ratty old tome? I need you to figure out exactly how your relic works."},{"name":"LEOFARD","text":"Aye, you sent that one fiend squealin' in fear, but that ain't enough. From what you've told me, we'll need to aim for some of that “obliteration” if we're goin' to take on the Shadow Queen."},{"name":"LEOFARD","text":"The rest of you, put everythin' you've got into what you do best, be that research or bladework. Overdoin' it is doin' it just right, if you get my meanin'."},{"name":"LEOFARD","text":"I'll decorate my walls with voidsent heads if I have to. The skies should belong to no one..."},{"name":"DIABOLOS","text":"...The Nullstone hath fallen into mortal hands."},{"name":"FERDIAD","text":"A thousand apologies, Lord Diabolos! I shall personally wring each and every one of their scrawny necks!"},{"name":"DIABOLOS","text":"The time for skulking in shadows hath ended. I am grown weary of these meddling vermin..."},{"name":"DIABOLOS","text":"The power of the Shadow Queen waxeth full! Soon, mine ardent desire shall pass from dream into dark reality!"}],"reward":{"gil":615,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67821]},"next":[67016,67909]},"partials":[{"type":"npc","id":"1017168","obj":{"i":1017168,"n":"Leofard","l":1803,"q":1}},{"type":"npc","id":"1017200","obj":{"i":1017200,"n":"Leofard","l":1804,"q":1}},{"type":"npc","id":"1017165","obj":{"i":1017165,"n":"Stacia","l":1803,"q":2}},{"type":"npc","id":"1017536","obj":{"i":1017536,"n":"Cait Sith","l":1803,"q":1}},{"type":"quest","id":"67821","obj":{"i":67821,"n":"The Weeping City","g":18,"l":"The Sea of Clouds","s":3,"f":1}},{"type":"quest","id":"67016","obj":{"i":67016,"n":"Unidentified Flying Object","g":18,"l":"Idyllshire","s":7,"r":1,"f":1}},{"type":"quest","id":"67909","obj":{"i":67909,"n":"Where Shadows Reign","g":18,"l":"The Sea of Clouds","s":5,"f":1}}]}