{"quest":{"name":"A Fundamentally Important Task","location":"The Churning Mists","id":67828,"patch":3.3,"sort":11,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017357,1017358,1017471],"genre":49,"usedItems":[15753,15727],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous is nervously fluttering his wings.","The framework for the foundation was to be erected today, but the Mogmenders find themselves short of the necessary materials to do so. To remedy the situation, Mogek has ordered two of their number to scavenge for wood and steel bars in the Landlord Colony and Eil Tohm. However, both have yet to return. Wanting to save time, he requests that you go and collect whatever they may have found and deliver it to the mindful moogle.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You find both of the moogles worse for the wear but nevertheless satisfied with the copious amounts of metal bars and timber they have gathered from the surrounding land. Turning their haul over to you, they ask that you transport them back to the moogle at the restoration site.","The moogle at the construction site picks through the jumble of metal beams and timber─a smattering of which is charred around the edges. Seeming to come across items which spark his interest, he stops abruptly, and hands them to you, asking that you use them to create basic building components for the foundation of the plaza.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mindful moogle.","Mogek is pleased by your swift return, doubly so when you offer him the foundation components you crafted. He is convinced they will allow the plaza to stand tall and proud for centuries to come."],"objectives":["Collect the timber from the moiling moogle in the Landlord Colony.","Collect the metal bars from the minikin moogle in Eil Tohm.","Deliver the materials to the mindful moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize foundation components</span><span class=\"alternative\">Deliver the foundation components to Mogek the Marvelous</span></span>."],"dialogue":[{"name":"MOGEK","text":"As you might recall, today is─or rather <span class=\"emphasis\">was</span>─to be the day we began restoring the foundation, kupo. &lt;sigh&gt; A slight oversight, however, has left us with insufficient materials to do so."},{"name":"MOGEK","text":"To remedy this, I have dispatched Mogmenders to the Landlord Colony and Eil Tohm to root for loose lumber and steel. They should have returned by now but are nowhere to be seen."},{"name":"MOGEK","text":"It is imperative that we sort this mess out quickly, so I would ask that you lend us your strength once more, <span class=\"highlight\">Forename</span>. Please go and gather whatever they have collected and deliver it to one of my Mogmenders at the restoration site above, kupo!"},{"name":"RUINSMOOGLE02292","text":"I have scoured this entire area and am confident that, short of chopping down trees, there is no more timber to be found! While a few of the logs are a mite singed, they're no doubt still serviceable. Well then, I shall leave these to you, kupo!"},{"name":"FORRESTMOOGLE02292","text":"I've unearthed a large cache of metal bars, but try as I might, I cannot carry them for even a single ilm. You appear quite strong, kupo. Please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, take them to the restoration site in my stead!"},{"name":"RUINSMOOGLE02292","text":"I shall go and see what the area beyond has to offer in the way of materials, kupo!"},{"name":"FORRESTMOOGLE02292","text":"Hm. I think I might need to rest a spell before attempting to fly up that hill─mountain, rather─again."},{"name":"FWMOOGLE02292","text":"Mogek promised me they would be here by now, arms laden with stones, wood, and scraps of steel... Whatever could have happened?"},{"name":"FWMOOGLE02292","text":"Yes. Yes, indeed, kupo! Not moments ago I received word from Master Mogek that you would be along with more construction materials."},{"name":"FWMOOGLE02292","text":"Now, let's see what our little scavengers managed to dig up... Excellent, excellent, kupo! This is much more than I hoped to receive on such short notice!"},{"name":"FWMOOGLE02292","text":"Ho ho! Would you take a look at this, <span class=\"highlight\">Forename</span>! These metal bars are of unparalleled quality! They could be used to make exceptional pilings. Now, if only there was someone on hand with the talent and skills to do so..."},{"name":"FWMOOGLE02292","text":"Ho ho! Would you take a look at this, <span class=\"highlight\">Forename</span>! This birch is of exceptional quality! They could be used to make exceptional pilings. Now, if only there was someone on hand with the talent and skills to do so..."},{"name":"FWMOOGLE02292","text":"Ho ho! Would you take a look at this, <span class=\"highlight\">Forename</span>! If these bits of charcoal were ground to powder, it could be used to mix vats of varnish to shield our pilings from the elements! Now, if only there was someone on hand with the talent and skills to do so..."},{"name":"FWMOOGLE02292","text":"You'll do it? I knew I could count on you, kupo! Oh, and when you've finished please see that they undergo one of Master Mogek's routine inspections."},{"name":"FWMOOGLE02292","text":"I was hoping you'd ask! Please, allow me!"},{"name":"FWMOOGLE02292","text":"As much as I desire to watch the master at work, I must lug the rest of these items back to the others, kupo!"},{"name":"MOGEK","text":"You're back so soon, <span class=\"highlight\">Forename</span>! I trust all went smoothly?"},{"name":"MOGEK","text":"Magnificent, kupo! With these, our foundation will be able to withstand the ravages of time for generation upon generation to come!"}],"reward":{"gil":600,"reputation":50,"items":[{"num":20,"id":10},{"num":3,"id":21080}]},"reqs":{"beastrank":1,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017357","obj":{"i":1017357,"n":"Moiling Moogle","l":2002,"q":1}},{"type":"npc","id":"1017358","obj":{"i":1017358,"n":"Minikin Moogle","l":2002,"q":1}},{"type":"npc","id":"1017471","obj":{"i":1017471,"n":"Mindful Moogle","l":2002,"q":2}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15753","obj":{"i":15753,"n":"Foundation Component Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15727","obj":{"i":15727,"n":"Foundation Component","l":55,"c":21005,"t":63}}]}