{"quest":{"name":"Nidhogg's Rage","location":"Mor Dhona","id":67825,"patch":3.3,"sort":602,"icon":112161,"unlocksFunction":1,"eventIcon":71341,"issuer":1006950,"target":1008278,"genre":95,"journal":["Alys appears relieved by your appearance.","Alys informs you that the wandering minstrel is desperate to devour the tale of your latest exploit. Share your deeds with the story-starved bard before his moaning drives the Seventh Heaven's proprietress to commit murder by mutton leg.","You serve the ravenous minstrel with a hearty helping of heroic fare. Seemingly revived by your recounting of the battle against Nidhogg, the bard eagerly reaches for his instrument. Despite the flowery nature of his verses, he seems content with the epic depiction of your climactic encounter with the dreaded wyrm.<br><br>※The Minstrel's Ballad: Nidhogg's Rage can be accessed via the Duty Finder."],"objectives":["Speak with the wandering minstrel."],"dialogue":[{"name":"ALYS","text":"Greetings, <span class=\"highlight\">Forename</span>. I am ever glad to see you pass through the Seventh Heaven with purposeful stride. Although one of my more persistent patrons will be gladder still."},{"name":"ALYS","text":"I've been requested to direct you into his presence at your earliest convenience. If you've a moment to spare from saving the realm, pray rescue my establishment from the piteous mewling of a story-starved minstrel."},{"name":"ALYS","text":"The bard wails that his belly craves neither meat nor mead. Give him a tale to chew on lest I silence his hunger with a well-thrown leg of mutton."},{"name":"WANDERINGMINSTREL","text":"<span class=\"highlight\">Forename</span>! I have subsisted on the scraps of travelers, all but wasting away whilst I awaited the full repast that only you can provide!"},{"name":"WANDERINGMINSTREL","text":"They say you brought an end to a thousand years of war; that the great wyrm Nidhogg shall no more darken the skies of Ishgard."},{"name":"WANDERINGMINSTREL","text":"But the dragons' song must have a final verse! I beg of you, feed me every morsel. I shall devour every sight, every sound, every blow that you landed upon his scaly hide!"},{"name":"WANDERINGMINSTREL","text":"What glorious fare! Brother set against brother! A fallen companion saved! I am revived and restored, and my fingers ache to strum the score!"},{"name":"WANDERINGMINSTREL","text":"Eternal is a dragon's woe,♪<br>Unceasing doth his anguish flow,♪<br>Yet 'fore the walls of Ishgard high,♪<br>'Gainst blood did Hraesvelgr ally.♪"},{"name":"WANDERINGMINSTREL","text":"Eternal is a dragon's rage,♪<br>Dread Nidhogg's wrath did span an age,♪<br>Yet by his hated brother's eye,♪<br>Did light quell shade, and vengeance die.♪"},{"name":"WANDERINGMINSTREL","text":"...What say you? Does your blood not quicken at the tale's retelling?"},{"name":"WANDERINGMINSTREL","text":"One might accuse the language of being overly flowery, but epic deeds demand epic depictions, do you not agree!?"}],"reward":{"gil":453,"instance":20040,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67783]}},"partials":[{"type":"npc","id":"1006950","obj":{"i":1006950,"n":"Alys","l":67,"q":7}},{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"instance","id":"20040","obj":{"i":20040,"n":"The Minstrel's Ballad: Nidhogg's Rage","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":220}},{"type":"quest","id":"67783","obj":{"i":67783,"n":"Litany of Peace","g":4,"l":"Ishgard","s":25}}]}