{"quest":{"name":"The Negotiator","location":"The Churning Mists","id":67839,"patch":3.3,"sort":22,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017403,1017404,1017405,1017534],"genre":49,"usedItems":[15761,15735],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek has need of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with a silver tongue.","Unable to perform the heavy lifting required to proceed with construction, the Mogmenders now turn to the dragons for aid. Mogek, however, is concerned their representative may make promises they cannot keep. He implores you to meet with them at Zenith before any rash decisions are made.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You are greeted by a moogle who is all smiles, telling you a deal was made just moments before your arrival. If only the dragons had interest in what was offered. Rather than the cloud mallow or kupo nuts one would expect of moogles, they demanded a number of gratuitous items that only one of your expertise could hope to craft. Supplied with materials, the moogle representative implores you to fulfill the dragons' request.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mediating moogle.","You craft two masterpieces which are then offered up to appease the dragons. Satisfied with your work, they consent to lend their strength to the moogles. Return to Bahrr Lehs and inform Mogek the crisis he anticipated has been averted.","Mogek is relieved to know the dragons have agreed to help. With the Mogmenders now able to focus on the beauty of their work, he suspects the monument may turn out to be more magnificent than even your favorite moogle overseer."],"objectives":["Meet with the mediating moogle at Zenith.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the austere offerings <img class=\"hq-icon small\" src=\"images/item/hq.png\">.</span><span class=\"alternative\">Deliver the austere offerings <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the helpmeet moogle.</span></span>","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>! Perfect. We are sorely in need of one with your gift for negotiation."},{"name":"MOGEK","text":"With every passing day we find the stones that must be moved for construction to be larger and larger. The Mogmenders are at their wit's end, kupo! Thankfully, Whei Ahf has agreed to introduce us to dragons willing to help."},{"name":"MOGEK","text":"That is, of course, if we can agree on proper payment. There is little we can offer at present, and the Mogmenders are like to be intimidated by the dragons' imposing presence. We need someone who can look them in the eye and strike a fair deal."},{"name":"MOGEK","text":"No doubt they're at Zenith discussing terms even as we speak. Please hurry, before we're up to our poms in debt, kupo!"},{"name":"NEGOTIATEMOOGLEA02303","text":"Oh, I wasn't expecting Mogek to send anyone. No need to worry, though. A pact has been made, and the dragons will soon be ready to work, kupo!"},{"name":"NEGOTIATEMOOGLEA02303","text":"Except, well...they have no interest in what we had to offer."},{"name":"NEGOTIATEMOOGLEA02303","text":"Instead, they ask for metal covers fitted for their claws, kupo! They say their claws are chipped, and must be kept safe until they regrow."},{"name":"NEGOTIATEMOOGLEA02303","text":"Instead, they ask for nests of sorts made of soft materials, that they may rest easy whenever they come to Zenith."},{"name":"NEGOTIATEMOOGLEA02303","text":"Instead, they ask for ointments to heal their wounds. Though dragons are wont to sleep when injured, they wish to experience the healing arts of man."},{"name":"NEGOTIATEMOOGLEA02303","text":"I fear none of us have the skill to produce goods suitable to their high standards. I know this is sudden, but we could really use your help, kupo! When you've crafted the offerings, take them to my assistant."},{"name":"NEGOTIATEMOOGLEA02303","text":"If you're running low on materials, just say the word and I'll track down more. Don't take too long, though. My assistant can only placate the dragons for so long, kupo."},{"name":"NEGOTIATEMOOGLEA02303","text":"That was fast, kupo! And not a moment too soon. The dragons are growing restless. Take them the offerings, quickly!"},{"name":"NEGOTIATEMOOGLEB02303","text":"If you would kindly wait just a short while longer, we have our very best moogles working to prepare your payment."},{"name":"PARTTIMEDRAGONA02303","text":"Such puny creatures. These massive stones you speak of are but pebbles to us."},{"name":"PARTTIMEDRAGONB02303","text":"The pact has been made, moogle. If you cannot provide what was agreed upon, then we will take our leave."},{"name":"NEGOTIATEMOOGLEB02303","text":"Oh, thank goodness. A <span class=\"emphasis\">real</span> <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>. The day may yet be saved, kupo! Please tell me you have what the dragons have demanded of us."},{"name":"NEGOTIATEMOOGLEB02303","text":"Yes, yes, I am sure they will be most pleased."},{"name":"NEGOTIATEMOOGLEB02303","text":"O mighty dragons, I humbly offer this as payment for your services. I hope it meets with your expectations."},{"name":"PARTTIMEDRAGONA02303","text":"Hmmm... Well done. Perhaps there is merit in working with you moogles after all."},{"name":"PARTTIMEDRAGONB02303","text":"You have honored the pact, and so we shall do the same. Our strength is yours."},{"name":"NEGOTIATEMOOGLEB02303","text":"Phew. I shudder to think what would've happened if they didn't approve. Thanks, kupo!"},{"name":"NEGOTIATEMOOGLEA02303","text":"I daresay we wouldn't be able to finish the plaza without them. With the dragons handling the heavy lifting, things should move along much more smoothly, kupo!"},{"name":"MOGEK","text":"The Mogmenders tell me a certain someone's help was vital in negotiating with the dragons. Naturally, I assumed they meant yours truly. Imagine my embarrassment when I remembered I'd sent you on that errand! Well done, kupo!"},{"name":"MOGEK","text":"I really cannot thank you enough. Do you have any idea how many moogles it would take to carry even one of those boulders? Neither do I. Just trying to imagine it leaves me exhausted."},{"name":"MOGEK","text":"But with dragons handling the more strenuous labor, the Mogmenders can give more attention to detail. I daresay the monument may even turn out more marvelous than me, kupo!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":517,"reputation":50,"items":[{"num":20,"id":11},{"num":3,"id":21080}]},"reqs":{"beastrank":4,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017403","obj":{"i":1017403,"n":"Mediating Moogle","l":2002,"q":1}},{"type":"npc","id":"1017404","obj":{"i":1017404,"n":"Daunting Dragon","l":2002,"q":1}},{"type":"npc","id":"1017405","obj":{"i":1017405,"n":"Disgruntled Dragon","l":2002,"q":1}},{"type":"npc","id":"1017534","obj":{"i":1017534,"n":"Helpmeet Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15761","obj":{"i":15761,"n":"Austere Offering Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15735","obj":{"i":15735,"n":"Austere Offering","l":55,"c":23001,"t":63}}]}