{"quest":{"name":"Tricks without Treats","location":"The Churning Mists","id":67837,"patch":3.3,"sort":20,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017321,1017327,1017392],"genre":49,"usedItems":[15760,15734],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous is staring intently at a group of Ishgardian knights.","A band of Temple Knights have gathered in a tight circle just beyond Bahrr Lehs, an apprehensive air about them as they whisper to one another in hushed tones. Mogek is curious to know what has them so on edge, and having already tried and failed several times to eavesdrop on their conversation, he asks that you go and attempt to uncover whatever secrets they may be hiding.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Upon speaking with Hildeth you learn that the Ishgardian knights are planning to pull a prank of their own on the moogles to further cultivate their friendship. However, seeing as they are unable to fit their smoke bomb into the fake kupo nut they prepared, they are worried that all their scheming and hard work may never come to fruition. Help them synthesize a high-quality exploding kupo nut, and deliver it to the Temple Knight sapper in the Landlord Colony.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Hildeth.","You deliver the fake kupo nut to the Temple Knight sapper, who gingerly sets it down in an area where unsuspecting moogles are most likely to come across it. Wait just out of sight to see if your plan succeeds.","Two hungry moogles stumble across the trap you have set. As they move to pick up the delectable-looking kupo nuts, the little treats explode into a cloud of smoke, taking the moogles by surprise. Speak with the snickering Temple Knight sapper in Landlord Colony.","You speak with the Temple Knight sapper, who is doubled over with laughter. In between fits, he thanks you, commenting that it was only with your help that they were able to pull this off. Return to Bahrr Lehs and tell Mogek the Marvelous of all that has happened.","Mogek the Marvelous is delighted to hear that the Ishgardians have begun to embrace the moogle's prank-playing culture and believes they will have no trouble at all becoming friends."],"objectives":["Speak with Hildeth.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an exploding kupo nut <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the exploding kupo nut <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the Temple Knight sapper</span></span>.","Lie in wait until a moogle falls for the trap.","Speak with the Temple Knight sapper.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, I suspect trouble is afoot. Do you spy that group of Temple Knights yonder? They have been whispering amongst themselves, casting furtive glances this way and that for the past hour, kupo!"},{"name":"MOGEK","text":"A hush falls over the group every time I approach, and try as I might, I cannot overhear so much as a single word. Maybe they would be willing to open up to a great adventurer like you! Yes, maybe you can discover what the problem is, kupo!"},{"name":"HILDEATH","text":"Oh, hello there, adventurer! What has you looking so grim?"},{"name":"HILDEATH","text":"Hahaha! Trouble? I suppose one might call it that, though it's far from the sort your friend Mogek seems to have in mind."},{"name":"HILDEATH","text":"You see, my knights and I have traveled all this way to rekindle our friendship with the residents of Moghome. Master Tarresson told us of the moogles' love of pranks, and we figured we could start by playing a little trick on them."},{"name":"HILDEATH","text":"Unfortunately, our plan has hit a stumbling block─we have been struggling for the past hour trying to fit this smoke bomb into our fake kupo nut. I don't suppose you would know how to go about this?"},{"name":"HILDEATH","text":"Unfortunately, our plan has hit a stumbling block─we have been struggling for the past hour trying to fit this smoke bomb into our fake kupo nut. I don't suppose you would know how to go about this?"},{"name":"HILDEATH","text":"Unfortunately, our plan has hit a stumbling block─we have been struggling for the past hour trying to fit this smoke bomb into our fake kupo nut. I don't suppose you would know how to go about this?"},{"name":"ISHGARDENGINEERB02301","text":"Hildeth, while our capable friend here sees to the kupo nut issue, I shall go and search out the perfect place to lay our trap."},{"name":"HILDEATH","text":"Wait! ...Bah! He <span class=\"emphasis\">always</span> does that. &lt;sigh&gt; Back to the matter at hand, then. All the items you require should be here. Once you fit the smoke bomb into the casing, please take it to the lad who just rushed off."},{"name":"HILDEATH","text":"Thank the gods you came when you did! Who knows how long we would have been stuck here fiddling with this thing, otherwise."},{"name":"HILDEATH","text":"It's done, you say!? Fantastic! If you could see that it gets to our sapper, I would be most grateful."},{"name":"ISHGARDENGINEERB02301","text":"My hands are quivering with excitement! I can hardly wait to see how our wonderful plan will unfold!"},{"name":"ISHGARDENGINEERB02301","text":"Have you brought the fake kupo nut with you? You reckon it looks convincing?"},{"name":"ISHGARDENGINEERB02301","text":"By the gods, it's beautiful! Even Mogek would have difficulty telling it apart from a real one. Now, let's see. I think we had best place it right about...here!"},{"name":"ISHGARDENGINEERB02301","text":"All set! Let us duck behind some bushes to await our quarry."},{"name":"HILDEATH","text":"With you helping us along, I'm certain nothing can go wrong! Why, this might even be the greatest prank the moogles will ever see!"},{"name":"DECEIVEDMOOGLE02301","text":"What an odd place for kupo nuts to be lying about. Oooh! Some poor soul must have forgotten them! Hehehe!"},{"name":"DECEIVEDMOOGLE02301","text":"Yes, yes, kupo! If whoever left them here can't be bothered to come back, then it wouldn't be stealing to take them ourselves, nor a crime to sneak a small taste..."},{"name":"DECEIVEDMOOGLE02301","text":"Kupooo!"},{"name":"DECEIVEDMOOGLE02301","text":"&lt;cough&gt; &lt;cough&gt; An <span class=\"emphasis\">exploding</span> kupo nut!? To think we would fall for such an amateurish prank─soon as we recover we must begin plotting our revenge, kupo!"},{"name":"ISHGARDENGINEERB02301","text":"Adventurer, did you see that!? Please, tell me you did! Bahaha! What an astounding success! Then again, it would have been more of a surprise if it wasn't. The smoke bomb─it was engineered using the blueprints of those developed to immobilize dragons."},{"name":"ISHGARDENGINEERB02301","text":"Even so, we couldn't have done it without you, my friend! If it were not for your dextrous fingers, the moogles would never have fallen for it. Ahahaha!"},{"name":"MOGEK","text":"You have finally returned, kupo! I trust you have news regarding the matter we discussed earlier?"},{"name":"MOGEK","text":"Pranks, kupo!? So, that's what all the fuss was about! Wonderful, simply wonderful. Haha! Mischief makers are always welcome─especially those as talented as our new friends!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":600,"reputation":50,"items":[{"num":20,"id":9},{"num":3,"id":21080}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017321","obj":{"i":1017321,"n":"Hildeth","l":2002,"q":3}},{"type":"npc","id":"1017327","obj":{"i":1017327,"n":"Temple Knight Sapper","l":2002,"q":1}},{"type":"npc","id":"1017392","obj":{"i":1017392,"n":"Temple Knight Sapper","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15760","obj":{"i":15760,"n":"Exploding Kupo Nut Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15734","obj":{"i":15734,"n":"Exploding Kupo Nut","l":55,"c":21005,"t":63}}]}