{"quest":{"name":"A Little Pick-me-up","location":"The Churning Mists","id":67833,"patch":3.3,"sort":16,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017322,1017371,1017374],"genre":49,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek seems worried about something.","The Mogmenders have been giving it their all and more to restore Bahrr Lehs. What happens then should the moogles work themselves to exhaustion? The answer, Mogek tells you, is cloud mallows. A sprinkle of mallow puffs is all it takes to revitalize even the weariest of moogles. With many of the Mogmenders now neglecting their duties, he asks you to use one and puff new life into these worn out workers.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The moofy moogle lends you a cloud mallow that you might ride the winds of Churning Mists in search of the Mogmenders. Make your way to nearby Zenith first, and see what can be done for the moogles there.<br><br>※Speak with the moofy moogle in Bahrr Lehs to mount a cloud mallow.","You find a group of Mogmenders on the brink of collapsing. With a few well-timed wiggles atop the cloud mallow, the air is soon filled with puffs of its energizing seeds. The air soon clears and you find the moogles have rebounded with newfound strength. They bolt off to continue working without so much as acknowledging your presence. Head to the Rookery and see if anymore Mogmenders need a boost in their spirits.","You find yet another group of tired and unmotivated Mogmenders. After a few shakes of the cloud mallow, however, it is all they can do to contain their eagerness to work. With the wind back beneath their wings, you return to inform Mogek the Mogmenders have returned to their tasks.","You tell Mogek of the Mogmenders' enthusiasm, and he giggles with glee to hear his plan has taken effect. He is all but certain they will work tirelessly for days on end, fueled by the revitalizing power of cloud mallows."],"objectives":["Speak with the moofy moogle.","Ride the cloud mallow and use its Seed ability at Zenith.","Ride the cloud mallow and use its Seed ability at the Rookery.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"The Mogmenders have been working tirelessly towards the restoration of Zenith. So much so, in fact, I fear they may inadvertently work themselves to exhaustion."},{"name":"MOGEK","text":"Which is why I'd like you to help them using one of our cloud mallows, kupo! Though their fluffiness pales in comparison to the fabulously soft fur of yours truly, their ability to relieve fatigue is unsurpassed. "},{"name":"MOGEK","text":"All you have to do is give it a good shake to sprinkle a few mallow puffs on anyone nearby. They'll soon be reinvigorated and ready to continue working. You're likely to find them lazing about not far from here at Zenith and up north at the Rookery."},{"name":"MOGEK","text":"Speak with the moogle just over there to borrow one, then ride the breeze until you find them."},{"name":"MOUNTCONTROLMOOGLE02297","text":"Mogek told me you'd be coming. You're sure to have a comfortable trip. Just be careful, though. Some find them to be <span class=\"emphasis\">too</span> comfortable. I myself have fallen asleep riding them more times than I care to admit, kupo."},{"name":"MOUNTCONTROLMOOGLE02297","text":"Oh no, did you fall off? I bet you were napping at the helm. Never fear, we've all nodded off at least once atop these cushioned carriers. Take care, and stay alert, kupo!"},{"name":"SYSTEM","text":"The moogles are lounging about, unwilling to work. Perhaps a few puffs of cloud mallow could motivate them to resume their duties."},{"name":"TIREDMOOGLEA02297","text":"Still so much to do... My spirit is willing, but my poor little arms feel spongy and bruised, kupo..."},{"name":"TIREDMOOGLEA02297","text":"Huh!? I... I feel my strength returning!"},{"name":"TIREDMOOGLEA02297","text":"Hey-ho! I've got my second wind. No time for complaints, you two. That monument won't build itself, kupo!"},{"name":"SYSTEM","text":"The moogles rush off with renewed vigor, clamoring about the joys of working!"},{"name":"TIREDMOOGLEB02297","text":"Ugh...so tired. But we have to finish..."},{"name":"TIREDMOOGLEB02297","text":"Oh! It's so soft, and fuzzy! I'm feeling fresh and fired up, kupo!"},{"name":"TIREDMOOGLEB02297","text":"Let's get back to work, boys. My pom is full to bursting with energy, and I won't let it go to waste!"},{"name":"SYSTEM","text":"The moogles rush off with renewed vigor, clamoring about the joys of working!"},{"name":"MOGEK","text":"It would seem my plan was a success. Now the Mogmenders can labor with the strength of a hundred moogles each, kupo!"},{"name":"MOGEK","text":"From dawn till dusk, and perhaps till dawn again, they'll sing the praises of a hard day's work. We should be back on schedule in no time at all."}],"reward":{"gil":572,"reputation":50,"items":[{"num":20,"id":11},{"num":3,"id":21080}]},"reqs":{"beastrank":2,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017322","obj":{"i":1017322,"n":"Moofy Moogle","l":2002,"q":3}},{"type":"npc","id":"1017371","obj":{"i":1017371,"n":"Mirthless Moogle","l":2002,"q":1}},{"type":"npc","id":"1017374","obj":{"i":1017374,"n":"Mirthless Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}}]}