{"quest":{"name":"The Mining Mishap","location":"The Churning Mists","id":67835,"patch":3.3,"sort":18,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017379,1017380],"genre":49,"usedItems":[15758,15732],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous gazes at the sky, an exasperated sigh on his lips.","Tharl Oom Khash contains some of the purest crystals in the realm, and Mogek, eager to get a hold of some, has sent Mogmenders to procure several chestloads of these gleaming marvels. However, with their consignment now long overdue, Mogek's patience is wearing thin and, unable to contain his frustration, he bids you investigate the cause of this delay.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Upon entering the ruins, you are greeted by a moogle who expresses his relief that you're here. He goes on to explain that a number of his crew has been struck down, overwhelmed by the vast amounts of aether being emanated from the crystals around them. Believing he will be able to see their harvested crystals safely back to Mogek if he can shield the few remaining moogles from their adverse effects, he asks that you fashion an aetheric shielding for their chests. Synthesize the requested items and deliver them to the malaised moogle.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the muddled moogle.","The moogle you hand the aetheric shielding to is beginning to feel dizzy─a telltale sign of aether sickness. He is concerned that if his condition worsens, he will be unable to deliver the crystals he promised Mogek. Upon handing him the shielding you synthesized, however, he perks up, a great deal more confident he can handle the situation.","Mogek the Marvelous feels responsible for the complications that arose in Tharl Oom Khash. He tells you of how moogles are especially sensitive to aether and laments the fact that he failed to take this into account before sending his Mogmenders to a cave steeped with it."],"objectives":["Speak with the muddled moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize aetheric shielding</span><span class=\"alternative\">Deliver the aetheric shielding to the malaised moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, have your travels ever taken you to a place called Tharl Oom Khash?"},{"name":"MOGEK","text":"It is no secret the ruins hold some of the clearest crystals in the realm─crystals so pure they are often considered to be the perfect catalysts. As such, I sent some Mogmenders to harvest them."},{"name":"MOGEK","text":"They should have returned by now, with chests overflowing, kupo. The reason they haven't, I imagine, is because they have run into trouble. &lt;sigh&gt; Great adventurer, might you go and see what the problem is?"},{"name":"DIGGINGMOOGLE02299","text":"Kupooo! Thank the gods above Mogek finally sent help!"},{"name":"DIGGINGMOOGLE02299","text":"It's terrible, kupo! We were so fixated on mining crystals that we didn't realize just how thick the air was with aether, until it struck down over half of our squad!"},{"name":"DIGGINGMOOGLE02299","text":"While this puts us in a tenuous position, a few of us have yet to feel its full effects. If we proceed with caution, we might still be able to fulfill Mogek's request!"},{"name":"DIGGINGMOOGLE02299","text":"This is where you come in! Please, if you could craft metal casings for our chests to shield us from the crystals, we would be most grateful."},{"name":"DIGGINGMOOGLE02299","text":"This is where you come in! Please, if you could craft leather cases for the interiors of our chests to shield us from the crystals, we would be most grateful."},{"name":"DIGGINGMOOGLE02299","text":"This is where you come in! Please, if you could make a wax sealant which might prevent any aether within the chests from leaking out, we would be most grateful."},{"name":"DIGGINGMOOGLE02299","text":"Everything you need should be right here, but if there is something you can't find, please don't hesitate to ask!"},{"name":"DIGGINGMOOGLE02299","text":"Yes, yes, of course! Take however much you need, kupo!"},{"name":"DIGGINGMOOGLE02299","text":"This will certainly do the trick! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Now, do you see the moogle over by our wooden chests? He is charged with organizing our trip back, so please deliver the shielding to him."},{"name":"COLLECTIONMOOGLE02299","text":"Aether sickness is absolutely miserable, kupo! If only we had realized what was happening to us sooner we wouldn't be in this mess."},{"name":"COLLECTIONMOOGLE02299","text":"So dizzy, kupo... Unless we make haste, I, too, will soon be joining those of our ranks who lay listless on the ground. &lt;groan&gt; How am I to transport the crystals back to Mogek in this condition?"},{"name":"COLLECTIONMOOGLE02299","text":"What's this? A protective guard for our chests, you say? Oh, thank you! Thank you, adventurer─we are saved, kupo! "},{"name":"COLLECTIONMOOGLE02299","text":"With this to shield us from the crystals' aether, we should have no problem taking these back!"},{"name":"DIGGINGMOOGLE02299","text":"Now, to work out how we will transport those that are indisposed out of these ruins..."},{"name":"MOGEK","text":"I admit, the possibility of Mogmenders becoming affected by aether sickness completely slipped my mind, kupo. It seems the fault, in this case, lies with me."},{"name":"MOGEK","text":"We moogles are more adept at manipulating our aetheric flow than most. However, as this is less an acquired skill and more a natural talent, we are more like to succumb to overexposure."},{"name":"MOGEK","text":"While there is no denying this was an unfortunate turn of events, I am happy to see that the Mogmenders appear, at least, to be learning the value of hard work!"}],"reward":{"gil":572,"reputation":50,"items":[{"num":20,"id":13},{"num":3,"id":21080}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017379","obj":{"i":1017379,"n":"Muddled Moogle","l":2002,"q":1}},{"type":"npc","id":"1017380","obj":{"i":1017380,"n":"Malaised Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15758","obj":{"i":15758,"n":"Aetheric Shielding Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15732","obj":{"i":15732,"n":"Aetheric Shielding","l":55,"c":21005,"t":63}}]}