{"quest":{"name":"Stumbling Blocks","location":"The Churning Mists","id":67836,"patch":3.3,"sort":19,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017383,1017384,1017387],"genre":49,"usedItems":[15759,15733],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous is staring at two unevenly sized blocks of stone.","Rocks of every shape and size have been arriving at the restoration site, and the Mogmenders overseeing the monument's reconstruction have not been at all shy about voicing their complaints to Mogek. Claiming that the melange of rocks has rendered all the shipments they received from the stonemasons next to worthless from a builder's standpoint, a flustered Mogek turns to you for help. Travel to Zenith and speak with the masonry moogle.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The lead stonemason is taken aback to learn the construction moogles had been receiving such an incongruous variety of rocks with each shipment. Deciding the best way to ensure the standardization of their product is to cut down the larger blocks to match the size of the smaller ones, he asks that you produce an item with which the masons will be able to do so. Synthesize stonemasonry supplies and see that they are delivered to the apprentice stonemasons.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the masonry moogle.","The newest stonemasons gather around as you work and are impressed when you reveal your final product to them. Instilled with a renewed sense of motivation, they return to Asah to take another attempt at carving rocks.","The novice stonemasons present you with their latest attempt at producing a uniform set of stone blocks. Confident that they have improved, they ask that you deliver them to Mogek to receive his seal of approval.","Mogek is pleased to see the set of stones appear to be the exact same shape and size. He is certain even the construction moogles who had previously expressed their discontent will be appeased."],"objectives":["Speak with the masonry moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize stonemasonry supplies <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the stonemasonry supplies <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the muzzing moogle</span></span>.","Speak with the muzzing moogle.","Deliver the blocks of stone to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Thank the gods you're here! All <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span> the construction moogles have been pelting me with complaints regarding the shipments they've been receiving from the stonemasons."},{"name":"MOGEK","text":"It would appear that, while each of the stone blocks that arrive at the site have been polished to a shine, no two are the same! This has made it nearly impossible for the rocks to be stacked, much less used for construction."},{"name":"MOGEK","text":"The masons need someone to guide them, and I can think of none better than the master <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>. Please, <span class=\"highlight\">Forename</span>, show the stonemasons of Zenith how sculpting is truly done!"},{"name":"CRAFTSMOOGLE02300","text":"What is this!? The blocks we have been dispatching are not all uniform? Oh, this is not good, kupo! Not good at all!"},{"name":"CRAFTSMOOGLE02300","text":"I don't understand how such a thing could happen... My masons have been working tirelessly, meticulously chipping away at their stones, even as their pom-poms droop with exhaustion."},{"name":"CRAFTSMOOGLE02300","text":"Unless... Oh, dear! Is it possible, that in their haste to begin production, they forgot to consult with one another? That would certainly account for the differing shapes and sizes."},{"name":"CRAFTSMOOGLE02300","text":"<span class=\"highlight\">Forename</span>, it seems Mogek was right to send you! We are in desperate need of your assistance."},{"name":"CRAFTSMOOGLE02300","text":"Perhaps if you were to produce a file, with which we could grind down some of our larger blocks, we will be able to standardize all of the rocks in our shipments!"},{"name":"CRAFTSMOOGLE02300","text":"Perhaps if you were to produce a wooden mallet, which we could use with our chisels to pound down our larger blocks, we will be able to standardize all of the rocks in our shipments!"},{"name":"CRAFTSMOOGLE02300","text":"Perhaps if you were to produce an abrasive, with which we could use to grind down some of our larger blocks, we will be able to standardize all of the rocks in our shipments!"},{"name":"CRAFTSMOOGLE02300","text":"I'll have my masons bring them for you, so if you find yourself running low on materials, don't hesitate to speak up, kupo!"},{"name":"CRAFTSMOOGLE02300","text":"I am so glad this matter has been brought to my attention. It would seem we─ Ah! My apologies, <span class=\"highlight\">Forename</span> for not noticing sooner. I shall have them brought to you immediately. You there, go and fetch the requested materials at once, kupo!"},{"name":"CRAFTSMOOGLE02300","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, you've been gifted with a touch the gods themselves would envy! My masons have been waiting with bated breath to gaze upon your finished work, and I'm certain they shall not be disappointed!"},{"name":"STONEMOOGLE02300","text":"I can't see, kupo! I must move in closer to observe the master's movements, kupo!"},{"name":"STONEMOOGLE02300","text":"We have come to look upon the master's work, kupo!"},{"name":"STONEMOOGLE02300","text":"Y-You are truly amazing─so swift and precise, kupo! I have never seen anything like it! How does one become such a great crafter?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"One must always pay attention to the details."},{"name":"A1","text":"You must never give up."},{"name":"STONEMOOGLE02300","text":"Your wise words have served to motivate us even further. We shall return to work and try again and again until we get it right!"},{"name":"CRAFTSMOOGLE02300","text":"While it will likely take a tremendous amount of time and practice to become as adept as you, we shall never give up, kupo!"},{"name":"STONEMOOGLE02300","text":"Thank you, adventurer! With your help, we have finally created a set of three stone blocks that are the exact same size, kupo! We shall get started on the next ones, so please take these to Mogek for approval."},{"name":"STONEMOOGLE02300","text":"I think we have seen much improvement, and it is all thanks to you, kupo! "},{"name":"MOGEK","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>, <span class=\"highlight\">Forename</span>! Pray tell, how did the lessons go?"},{"name":"MOGEK","text":"What wonderful news! While they certainly have their work cut out for them, I feel this is the last bit of trouble we'll be seeing from the stonemasons."},{"name":"MOGEK","text":"Just look at these samples─they're absolutely magnificent! I'm certain even the construction moogles will be impressed by the precision with which they have been cut, kupo!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":517,"reputation":50,"items":[{"num":20,"id":12},{"num":3,"id":21080}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017383","obj":{"i":1017383,"n":"Masonry Moogle","l":2002,"q":1}},{"type":"npc","id":"1017384","obj":{"i":1017384,"n":"Muzzing Moogle","l":2002,"q":1}},{"type":"npc","id":"1017387","obj":{"i":1017387,"n":"Muzzing Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15759","obj":{"i":15759,"n":"Stonemasonry Supplies Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15733","obj":{"i":15733,"n":"Stonemasonry Supplies","l":55,"c":21005,"t":63}}]}