{"quest":{"name":"Kupo for Kupo Nuts","location":"The Churning Mists","id":67831,"patch":3.3,"sort":14,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017365,1017366,1017367,1017368],"genre":49,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The look in Mogek's squinty eyes tells you he has a favor to ask.","Mogek seeks to recruit more paws to aid the Mogmenders, and has devised a delicious plan to do so. He has amassed a large quantity of kupo nuts to offer any moogles who agree to help work on the plaza. While recruitment is seemingly well underway, he has yet to send anyone to Moghome, and asks you to go as their representative. Find potential recruits and, with the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “free kupo nuts” to rally them to your cause.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You speak with several moogles whose eyes grow wide with hunger at the thought of kupo nuts. Judging by the speed with which they flew back to Bahrr Lehs, it would seem the Mogmenders will have more than a few new recruits. Return to Mogek and tell him of your success in finding helpers.","Mogek is delighted to see that his plan has worked flawlessly─or so it would seem. He reveals to you he acquired his treasure trove of kupo nuts from the reserves of Chieftain Moglin. This store of kupo nuts is apparently so confidential that even the chieftain himself has forgotten its existence. One can only hope he never remembers."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “free kupo nuts” to rally the moogles.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"As the most brilliant moogle of the Mogmenders, I took it upon myself to devise a plan to recruit more helping paws. All I need now is a certain charismatic character to put my plan into action. That would be you, kupo!"},{"name":"MOGEK","text":"We moogles are all play and no work when time allows for it, but none can resist the allure of kupo nuts, even if it means arduous work. And that is how I will rally the moogles to help with construction!"},{"name":"MOGEK","text":"Mogmul was hesitant, though, concerned those already working would lose their share. Being the magnificent moogle that I am, however, I amassed an ample supply without dipping into their stock."},{"name":"MOGEK","text":"Now, what I want you to do is travel to Moghome, and see who would be willing to help us for a sizable sum of kupo nuts. The mere mention of the words should be more than enough to motivate them, kupo!"},{"name":"CANDIDATEMOOGLEA00295","text":"I'm so bored... &lt;sigh&gt; If only I had something to do."},{"name":"CANDIDATEMOOGLEA00295","text":"Nuts, you say? All I can eat if I help the Mogmenders? I'll do it, kupo!"},{"name":"CANDIDATEMOOGLEB00295","text":"Aren't cloud mallows the fluffiest? If only I could make my pom that soft and fluffy."},{"name":"CANDIDATEMOOGLEB00295","text":"Kupo nuts? For free!? My fluffy pom will have to wait, kupo!"},{"name":"CANDIDATEMOOGLEC00295","text":"I'm so hungry, kupo. What I wouldn't do for even a handful of kupo nuts..."},{"name":"CANDIDATEMOOGLEC00295","text":"Free kupo nuts for helping the Mogmenders? Who could say no to that!"},{"name":"CANDIDATEMOOGLED00295","text":"Look at that sky. To think we're just tiny, fluffy specks in the great expanse of it all. Really makes you think, doesn't it?"},{"name":"CANDIDATEMOOGLED00295","text":"Oh, free kupo nuts! Well I certainly don't need to think about that, kupo! Which way to the Mogmenders?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “free kupo nuts” to persuade the moogles to help with construction."},{"name":"SYSTEM","text":"free kupo nuts"},{"name":"MOGEK","text":"Moogles have been flying in from every which way asking for work. I've never seen them so eager! Hehehe, but you and I both know they're really just here for my nuts, kupo."},{"name":"MOGEK","text":"Hm? You wish to know how I procured enough for all the volunteers? Why, I borrowed them from Chieftain Moglin's secret reserves, of course."},{"name":"MOGEK","text":"So secret, in fact, that he's all but forgotten they exist. Even if he should remember, I'm certain he would agree our work in Zenith is a suitable use for them. At least, I hope so..."}],"reward":{"gil":700,"reputation":50,"items":[{"num":20,"id":9},{"num":3,"id":21080}]},"reqs":{"beastrank":2,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017365","obj":{"i":1017365,"n":"Mellow Moogle","l":2002,"q":1}},{"type":"npc","id":"1017366","obj":{"i":1017366,"n":"Mindless Moogle","l":2002,"q":1}},{"type":"npc","id":"1017367","obj":{"i":1017367,"n":"Meager Moogle","l":2002,"q":1}},{"type":"npc","id":"1017368","obj":{"i":1017368,"n":"Musing Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}}]}