{"quest":{"name":"A Fine Finish","location":"The Churning Mists","id":67834,"patch":3.3,"sort":17,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017377,1017378],"genre":49,"usedItems":[15757,15731],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek the Marvelous is gesturing for you to come over.","Mogek learns from Whei Ahf that the Monsterie ruins were also once the center of production for the former Zenith plaza. A lot of the equipment from the bygone era is still functional, and the Mogmenders decide to take full advantage of this opportunity. While many of the moogles rejoice, immediately setting about their tasks, Mogek is worried that the streak of bad luck they have recently faced may continue, and would like for you to make sure they stay out of trouble.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The lead stonemason tells you that the equipment they salvaged from the Monsterie has helped them make considerable headway, but their rate of production has surpassed their supply of raw materials. Now short on items used to put the finishing touches on their tiles, he bids you craft a high-quality veneer component and deliver it to his assistant.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mosaicist moogle.","The moogle assistant is upset that production has halted because they are out of materials. You present him with the veneer you have made, and he thanks you profusely, resolved to be extra careful with the supplies you have provided.","Mogek is relieved to hear that both you and his stonemasons are safe. He turns his attention to other matters, delighted that a ray of good fortune has finally shone through the black clouds hovering over them."],"objectives":["Speak with the mosaicist moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a veneer component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the veneer component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the moping moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, tell me, have you ever been to the Monsterie? While many, like me, assume it to simply have been a quiet place of worship, Whei Ahf says that the erstwhile sanctuary also once served as a stone fabrication facility."},{"name":"MOGEK","text":"We decided to do a bit of exploring, and a cursory search of the place yielded serviceable equipment once used in the production of decorative tilework."},{"name":"MOGEK","text":"The stonemasons have already set to work, clattering about our good fortune, but with all the trouble we've faced of late, I would prefer to leave nothing to chance. Please, <span class=\"highlight\">Forename</span>, bring me some peace of mind and make sure nothing is amiss."},{"name":"CRAFTSMOOGLE02298","text":"Hello, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Did you, too, come to look upon the Monsterie after hearing the great dragon's regaling tales? Well, here it is─everything he promised and more, kupo!"},{"name":"CRAFTSMOOGLE02298","text":"With the tools we found here, we've produced more tiles in an hour than we last did in a day! All this progress has us eager to continue, but we've exhausted the last of the veneer we had."},{"name":"CRAFTSMOOGLE02298","text":"Now that you're here, however, our problem is as good as solved, kupo! Please, if you would, make us some metal trim for our tiles?"},{"name":"CRAFTSMOOGLE02298","text":"Now that you're here, however, our problem is as good as solved, kupo! Please, if you would, make us some hardwood moldings for our tiles?"},{"name":"CRAFTSMOOGLE02298","text":"Now that you're here, however, our problem is as good as solved, kupo! Please, if you would, make us a glaze that we might add shine to our tiles?"},{"name":"CRAFTSMOOGLE02298","text":"Once you've finished, we'd be most grateful if you could deliver the product directly to my assistant, who is just beyond this archway. Ever since we used the last of our supply he's been inconsolable, lecturing any within earshot on the importance of properly managing supplies."},{"name":"CRAFTSMOOGLE02298","text":"Thankfully, we do not want for raw materials! Here, take as much as you like, kupo!"},{"name":"CRAFTSMOOGLE02298","text":"Oh, yes! This is certain to brighten even my assistant's mood! Before he sees fit to fly over and deliver yet another speech, please see that the veneer you crafted for us reaches him."},{"name":"FLOORMATERIALMOOGLE02298","text":"We're out! Completely out! Give it another day and we'll soon be falling behind schedule again!"},{"name":"FLOORMATERIALMOOGLE02298","text":"Honestly! If anyone had bothered to listen, we could have doubled─no, tripled─the day's output. &lt;sigh&gt; But now production's at a complete standstill, with little to no hope of starting again, kupo."},{"name":"FLOORMATERIALMOOGLE02298","text":"I-Is that what I think it is!? Ha ha! Why, I could just hug you! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>─you've really saved our poms with this one!"},{"name":"FLOORMATERIALMOOGLE02298","text":"Well, I've certainly learned my lesson─not a single soul shall be allowed to touch these without my explicit permission. Not a single soul, kupo!"},{"name":"CRAFTSMOOGLE02298","text":"With your help, all the tiles for the monument will be finished in next to no time, kupo!"},{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>! Thank the gods you've returned unharmed! I was beginning to worry I would have need to send one of my Mogmenders after you."},{"name":"MOGEK","text":"Ahaha! How refreshing it is to hear that the only trouble was a simple shortage of materials. It seems I need worry no longer─our luck has, at long last, taken a turn for the better, kupo!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":600,"reputation":50,"items":[{"num":20,"id":10},{"num":3,"id":21080}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017377","obj":{"i":1017377,"n":"Mosaicist Moogle","l":2002,"q":1}},{"type":"npc","id":"1017378","obj":{"i":1017378,"n":"Moping Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15757","obj":{"i":15757,"n":"Veneer Component Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15731","obj":{"i":15731,"n":"Veneer Component","l":55,"c":21005,"t":63}}]}