{"quest":{"name":"Work That Mallow","location":"The Churning Mists","id":67832,"patch":3.3,"sort":15,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017369,1017370],"genre":49,"usedItems":[15756,15730],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek wants to light up the skies of Zenith.","Bahrr Lehs is in need of decorations, and Mogek plans to illuminate the area with sparkling mallows. The moogle he sent to gather them, however, is taking longer than expected. Though the delay is likely a trivial matter, Mogek will leave nothing to chance, and so he asks you to check on his underling in Sohm Al.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","No sooner do you arrive at Sohm Al than you find a mournful moogle lamenting over his hatchet. He asks if you can help repair it, lest he anger the Mogmenders for delaying their plans. Once completed, he asks that you take the replacement parts to his moogle companion nearby.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mournful moogle.","You hand over supplies to a moogle relieved to see parts for fixing hatchets rather than another broken one. He tells you to inform Mogek that, thanks to your repairs, the collection of sparkling mallows will proceed as scheduled.","Mogek claims you confirmed his suspicions of trouble, and thanks you for repairing his worker's hatchet. Noticing your nonplussed expression, Mogek reassures you he clearly stated that “something” and not “nothing” was delaying the delivery of sparkling mallow."],"objectives":["Speak with the mournful moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the gathering tool components.</span><span class=\"alternative\">Deliver the gathering tool components to the malcontent moogle.</span></span>","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Tell me, <span class=\"highlight\">Forename</span>, have you ever heard of sparkling mallows? At the very least I'm sure you've seen them. Twinkling balls of fluff dotting the landscape here and there. We plan to use them to spruce up the monument grounds, kupo!"},{"name":"MOGEK","text":"I sent someone to gather a few, but alas, they've yet to return. You would think picking a few plants would be an easy task."},{"name":"MOGEK","text":"I'm sure it's nothing serious, but I would be remiss not to be certain, which is why I need you to travel to Sohm Al and see if anything is wrong."},{"name":"WEEDINGMOOGLE02296","text":"Hey! You're that crafting adventurer, right? Thank goodness you're here. I can't finish harvesting these sparkling mallows now that my hatchet's ruined, kupo!"},{"name":"WEEDINGMOOGLE02296","text":"I worked really hard, and I'd hate to upset the Mogmenders back home. Do...do you think you could help me fix it?"},{"name":"WEEDINGMOOGLE02296","text":"The head of the hatchet bent somehow, making it impossible to cut down the mallows. A master <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> like you shouldn't have a problem making a new one."},{"name":"WEEDINGMOOGLE02296","text":"The head of the hatchet practically snapped off when I struck the base of the mallow. A master <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> like you shouldn't have a problem fixing it."},{"name":"WEEDINGMOOGLE02296","text":"The blade has grown so dull it won't even cut grass let alone a cloud mallow. I was hoping you could make oil for sharpening."},{"name":"WEEDINGMOOGLE02296","text":"Thankfully, I have spare material for repairs right here. When you've crafted what we need, take it to the moogle floating just over there, and he'll make my tools as good as new, kupo!"},{"name":"WEEDINGMOOGLE02296","text":"I'm counting on you, adventurer. We need a lot of sparkling mallows for the monument, and the Mogmenders won't get any if I can't get back to work."},{"name":"WEEDINGMOOGLE02296","text":"Excellent, excellent! My friend over there can handle the rest, kupo!"},{"name":"TOOLMOOGLE02296","text":"&lt;sigh&gt; What am I to do with all these broken hatchets, kupo."},{"name":"TOOLMOOGLE02296","text":"Hello there. Before you say anything, I know why you're here. He broke another hatchet, didn't he? &lt;sigh&gt; Well, let's have a look then."},{"name":"TOOLMOOGLE02296","text":"Oh! You made new parts to fix it, kupo! That's awfully kind of you. I'll have him back to work in no time. "},{"name":"TOOLMOOGLE02296","text":"If Mogek asks, tell him that work is proceeding as planned."},{"name":"TOOLMOOGLE02296","text":"Thanks again for your help, kupo! Tell Mogek he doesn't have to worry about the sparkly mallows."},{"name":"WEEDINGMOOGLE02296","text":"Soon we'll have more than enough sparkling mallows for the monument, kupo!"},{"name":"MOGEK","text":"Welcome back!<br>Ah, so his tool was broken. Trouble, just as I suspected."},{"name":"MOGEK","text":"...Hm? You must have misheard me, my dear friend. I didn't say “I'm sure it's nothing serious,” I said “I'm sure it's <span class=\"emphasis\">something</span> serious.” Why else would I send you to help them, kupo?"}],"reward":{"gil":700,"reputation":50,"items":[{"num":20,"id":8},{"num":3,"id":21080}]},"reqs":{"beastrank":2,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017369","obj":{"i":1017369,"n":"Mournful Moogle","l":2002,"q":1}},{"type":"npc","id":"1017370","obj":{"i":1017370,"n":"Malcontent Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15756","obj":{"i":15756,"n":"Gathering Tool Component Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15730","obj":{"i":15730,"n":"Gathering Tool Component","l":55,"c":21005,"t":63}}]}