{"quest":{"name":"Journey of a Thousand Hews","location":"The Churning Mists","id":67846,"patch":3.3,"sort":29,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017416,1017421],"genre":49,"usedItems":[15765,15739],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek shakes his head.","An annoyed Mogek tells you that he allowed a group of moogles to take a break and explore the area around the enormous statue of Shiva south of Bahrr Lehs, but they have yet to return. He requests that you go and check on them to make sure they are staying out of trouble.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","One of the moogles stands in awe before the Mother of the Sheave, and admires the dedication that the artisans of the past must have had to make such an enormous piece. Inspired, the moogle declares that he too will become a sculptor and someday create a moogle monument as magnificent as the one of Shiva. Of course, no fledgling artisan works without some sort of guide. He requests that you create a small moogle statue to use as a model, using materials that his brother in Moghome would be happy to give you for free.","Unexpectedly, the fledgling sculptor's brother is somewhat skeptical of his declaration to create something as great as the Shiva statue. Nevertheless, he acknowledges you came all the way to Moghome on his behalf, and hands you the materials required to make the minute model. Craft the high-quality moogle statuette and deliver it to the moogle at the Mother of the Sheave.","You hand over the statuette to the moogle, who is delighted and impressed by your attention to detail. He asks you one more favor─to inform Mogek of his newfound calling for carving sculptures.","Unlike the moogle's brother, Mogek is somewhat supportive of his decision to become a master artisan. He muses the prospect of having moogle statues scattered throughout the Churning Mists."],"objectives":["Speak with the marveling moogle.","Speak with the mongering moogle at Moghome.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the moogle statuette <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the moogle statuette <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the marveling moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"&lt;sigh&gt; Why do I even bother sometimes..."},{"name":"MOGEK","text":"A group of moogles said they were going to take a break from the restoration effort and explore the area around the Shiva statue south of here. But they appear to be taking <span class=\"emphasis\">too</span> long for my tastes. Might you check on them and see what they are up to?"},{"name":"CRAFTSMOOGLE02310","text":"The Mother of the Sheave... So beautiful..."},{"name":"CRAFTSMOOGLE02310","text":"Oh, pardon me, kupo! I was so entranced by such majesty that I didn't see you standing there. Every time I lay eyes on her, I cannot help but feel inspired."},{"name":"CRAFTSMOOGLE02310","text":"How many years would it take to carve a statue of this size, I wonder? Ten? Twenty? One hundred? Regardless, it is a display of dedication worthy of the highest respect."},{"name":"CRAFTSMOOGLE02310","text":"Someday I wish to be respected as a moogle sculptor, and that's why my mind is made up, kupo! I too shall hone my skills and create a statue as grandeur as this one! ...With a little help, of course."},{"name":"CRAFTSMOOGLE02310","text":"You have an eye for detail, right? Do you think you could craft me a small metal statue in the likeness of a valiant moogle? I want to use it as a model for my much bigger mog monument, kupo!"},{"name":"CRAFTSMOOGLE02310","text":"You have an eye for detail, right? Do you think you could use your expertise to fashion me a small statue in the likeness of a valiant moogle? I want to use it as a model to practice for my much bigger mog monument, kupo!"},{"name":"CRAFTSMOOGLE02310","text":"You have an eye for detail, right? Do you think you could mold me a small resin statue in the likeness of a valiant moogle? I want to use it as a model to practice for my much bigger mog monument, kupo!"},{"name":"CRAFTSMOOGLE02310","text":"While I would love to see you work, I do not have any materials on hand, unfortunately. But my brother is a peddler who deals in odds and ends at the summit of Sohm Al. If you mention I sent you for my work, he should be willing to give you materials, free of cost."},{"name":"CRAFTSMOOGLE02310","text":"Be sure to craft the statuette as intricately as you can. After all, it could become the model of a monument that could stand for a thousand years, kupo!"},{"name":"MERCHANTMOOGLE02310","text":"Welcome, welcome! If I have anything you desire, just say the word, kupo!"},{"name":"MERCHANTMOOGLE02310","text":"He wants to carve <span class=\"emphasis\">what</span>? Did he hit his pom or something? My brother is talented, to be sure, but he's no master! Even a sculpture my size would take him more than a fortnight, kupo!"},{"name":"MERCHANTMOOGLE02310","text":"I'm rather doubtful that he could create such an enormous piece. But since you came all this way, I suppose I'll have to indulge him. Here."},{"name":"MERCHANTMOOGLE02310","text":"You know what they say, practice makes perfect, kupo! If only my brother would take the same advice before declaring such lofty goals."},{"name":"MERCHANTMOOGLE02310","text":"Fantastic work, kupo! Take it to my brother. I'm certain he is still living in his little dream world next to Shiva. It seems like he spends hours gazing at it when he's not working on the reconstruction."},{"name":"CRAFTSMOOGLE02310","text":"Did you finish making the model?"},{"name":"CRAFTSMOOGLE02310","text":"Wow, it's so lifelike, kupo! The details in the fur...The veins on the wings... If I didn't know better, I would say you've had quite the career as a sculptor yourself."},{"name":"CRAFTSMOOGLE02310","text":"Thank you so much for making me such an elaborate piece. You can tell Mogek that I've found my true calling in life. With this in hand, I'll be a master sculptor in no time, kupo!"},{"name":"CRAFTSMOOGLE02310","text":"I'm so excited, kupo! Although it would probably be best to start with a small boulder, kupo. Hmmm..."},{"name":"MERCHANTMOOGLE02310","text":"I'm not saying it's completely out of the question, but my brother tends to get in over his head sometimes. Surely he knows that the Mother of the Sheave was carved by more than one person, right?"},{"name":"MOGEK","text":"I see, so he decided he would rather dedicate his time to sculpting. Well, I for one have no qualms with it. Not every moogle is suited to be a Mogmender, you know."},{"name":"MOGEK","text":"Besides, if he is successful in his mission, then perhaps magnificent moogle statues will be scattered around the Churning Mists, kupo! I am glad you were able to support him in his dream, no matter how big or small."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":839,"reputation":50,"items":[{"num":20,"id":10},{"num":3,"id":21080}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017416","obj":{"i":1017416,"n":"Marveling Moogle","l":2002,"q":1}},{"type":"npc","id":"1017421","obj":{"i":1017421,"n":"Mongering Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15765","obj":{"i":15765,"n":"Moogle Statuette Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15739","obj":{"i":15739,"n":"Moogle Statuette","l":55,"c":23001,"t":63}}]}