{"quest":{"name":"Rare Refreshments","location":"The Churning Mists","id":67843,"patch":3.3,"sort":26,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017321,1017412,1017413],"genre":49,"usedItems":[15764,15738],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek stretches and waves to you.","Mogek tells you there is a moogle in Moghome who wished to ask something of you personally, but did not make it known to Mogek himself. He asks you to oblige the moogle by making a trip to Moghome to see what he has to say.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","As it turns out, the moogles at Moghome want to surprise the Temple Knights with a helping of their homemade cooking as a token of appreciation. While the actual preparation of the dish, spiced and stewed mushrooms and vegetables, is entrusted to capable paws, there are some elements that they require a more skilled hand to create. Synthesize the remaining touches of the dish and deliver them to the moogle in charge of the dish.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the meticulous moogle.","You effortlessly craft the remaining elements and hand them over to the moogle culinarian, who cooks and bundles the bowls of stew. However, he appears worried that the Temple Knights may not accept the gesture due to the moogles' tendency towards playing pranks. Return to Bahrr Lehs and deliver the mogstew to Hildeth on their behalf.","After a moment of wariness, Hildeth expresses appreciation for the moogles' gesture and gladly accepts the stew. Return to Mogek and inform him you have successfully helped the moogles with their surprise.","Mogek tells you that he too once thought to present a moogle dish to the Temple Knights, but he was unsure whether or not the knights would enjoy their cuisine. Nevertheless, he is happy that the knights seem to be enjoying the refreshments, and hopes that someday they too may share their own Ishgardian culinary delights."],"objectives":["Speak with the meticulous moogle at Moghome.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize mogstew miscellany</span><span class=\"alternative\">Deliver the mogstew miscellany to the mincing moogle</span></span>.","Present the bowls of mogstew to Hildeth.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, just the person I needed to talk to! Or someone else needs to talk to, rather. A moogle from Moghome has a request and asked for you personally should I see you around the plaza."},{"name":"MOGEK","text":"When I inquired what for, he said it was a secret, so I am not sure what it could be. But you'll oblige him regardless, won't you?"},{"name":"CRAFTSMOOGLE02307","text":"I've been waiting for you, kupo! I wanted to speak with you away from the plaza because we are preparing something special. It's a surprise!"},{"name":"CRAFTSMOOGLE02307","text":"You see, the Temple Knights spend night and day helping us out with the reconstruction efforts, so I wanted to do something nice for them in return."},{"name":"CRAFTSMOOGLE02307","text":"At first, I thought to show Moghome's appreciation by playing a trick on them, but as it turns out, Temple Knights don't take too kindly to that sort of camaraderie."},{"name":"CRAFTSMOOGLE02307","text":"Instead, we will give them a taste of our homemade cuisine, but we are missing some finishing touches that I wanted you to help us with as an exceptional <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>."},{"name":"CRAFTSMOOGLE02307","text":"We are preparing a dish of stewed mushrooms and vegetables from around the Churning Mists. We grill the vegetables over an open flame before adding them to the pot, and need skewers to do so. Could you make us some, kupo?"},{"name":"CRAFTSMOOGLE02307","text":"We are preparing a dish of stewed mushrooms and vegetables from around the Churning Mists. We need containers to pour the mogstew into that won't slosh around before delivery. Could you make us some, kupo?"},{"name":"CRAFTSMOOGLE02307","text":"We are preparing a dish of stewed mushrooms and vegetables from around the Churning Mists. However, we need seasonings that appeal to the tastes of man, as the vegetables can be quite bitter. Could you make us some, kupo?"},{"name":"CRAFTSMOOGLE02307","text":"Let me know if you need any materials, kupo!"},{"name":"CRAFTSMOOGLE02307","text":"When you are finished, please hand them to my friend over there, who will prepare the mogstew for delivery."},{"name":"CRAFTSMOOGLE02307","text":"Perfect timing, kupo!"},{"name":"HILDEATH","text":"The plaza is becoming quite a remarkable place, don't you agree? And it is all thanks to the collective efforts of both man and moogle."},{"name":"RECEIPTMOOGLE02307","text":"A little of this...♪<br>A little of that...♪<br>And a whooole lot of that...♪"},{"name":"RECEIPTMOOGLE02307","text":"Did you bring what we need?"},{"name":"RECEIPTMOOGLE02307","text":"Thank you very much! And now for the coup de grâce..."},{"name":"RECEIPTMOOGLE02307","text":"Ta-daaa! Mmmm, can you smell that heavenly aroma? ...But I'm a bit worried that the artisans might not take a single bite if a moogle presented it to them. We still have our reputation for trickery."},{"name":"RECEIPTMOOGLE02307","text":"How about I have you deliver it to Hildeth for me, kupo? She'll be less suspicious if it's from you."},{"name":"RECEIPTMOOGLE02307","text":"No tricks, I promise! Although I can't be blamed should they find a stray white hair or two in their food. It's unavoidable, I'm afraid."},{"name":"CRAFTSMOOGLE02307","text":"I hope they find the mogstew tasty. We spent nearly a fortnight gathering all of the ingredients, kupo!"},{"name":"HILDEATH","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good day to you</span></span>, <span class=\"highlight\">Forename</span>. Working hard or hardly working?"},{"name":"HILDEATH","text":"Wow, that smells <span class=\"emphasis\">divine</span>. What is the occasion, if I may ask?"},{"name":"HILDEATH","text":"A token of gratitude from the moogles? What a kindly─wait, is this safe to eat?"},{"name":"HILDEATH","text":"No, no, I trust you checked. This will be a refreshing break from hard biscuits, to be sure."},{"name":"HILDEATH","text":"Moogles are surprising creatures. We've been trying to adapt ourselves to their culture, but it appears they too have been thinking the same. Please tell them we have gladly accepted this token."},{"name":"HILDEATH","text":"I'll be the one to distribute the helpings of vegetables amongst the sappers. Although I will tell them beforehand that it came from the moogles, just as a precaution."},{"name":"RECEIPTMOOGLE02307","text":"Hooray! They enjoyed my cooking! Perhaps next time I'll try a kupo nut pudding, nice and moist."},{"name":"CRAFTSMOOGLE02307","text":"You know what they say: the way to man's heart is through their stomach, kupo!"},{"name":"MOGEK","text":"Welcome back, <span class=\"highlight\">Forename</span>. Did you find out what the moogles at Moghome wanted?"},{"name":"MOGEK","text":"Ah, so they wished to surprise the Temple Knights with a sampling of Moghome cooking. I must say I thought to do the same, but I was worried that our food would not suit their sophisticated tastes. After all, we moogles aren't known for having a diverse diet."},{"name":"MOGEK","text":"Even so, they seem to be satisfied with the gesture all the same. Perhaps someday I'll be able to try a bite of the Temple Knights' cooking, too. I've always wanted to, kupo!"}],"reward":{"gil":700,"reputation":50,"items":[{"num":20,"id":9},{"num":3,"id":21080}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017321","obj":{"i":1017321,"n":"Hildeth","l":2002,"q":3}},{"type":"npc","id":"1017412","obj":{"i":1017412,"n":"Meticulous Moogle","l":2002,"q":1}},{"type":"npc","id":"1017413","obj":{"i":1017413,"n":"Mincing Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15764","obj":{"i":15764,"n":"Mogstew Miscellany Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15738","obj":{"i":15738,"n":"Mogstew Miscellany","l":55,"c":23001,"t":63}}]}