{"quest":{"name":"Dragon Draff for Their Behalf","location":"The Churning Mists","id":67849,"patch":3.3,"sort":32,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017453,1017454,1017549],"genre":49,"usedItems":[15767,15741],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek is inspecting his paws.","Mogek muses that the moss and grime on the buildings of the Churning Mists, while giving the structures character, tend to cling to any who lean against them and he has made the decision to assemble a group of moogles to clean them. That being said, the moogles at Zenith request use of your adept hands, literally.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You arrive at a small tower behind Zenith, where you find two moogles and unexpectedly, a wyvern. The moogle in charge explains that they tried to use metal rasps brought to them by the Temple Knights, but they wore down far too easily. Chancing upon some shedded dragon skin on the ground, the moogles had the ingenious idea to try using hardened dragon scales instead, and an adolescent wyvern gladly offered his molting skin for the project. However, moogle paws are less adept than hands are at plucking the scales out of the molt, and they request that you use your hands to do it for them.","The wyvern breathes a sigh of relief as you peel away the paled, dry skin on his back until you have two fistfuls of his scales. Bring them to the moogle in charge for inspection.","The moogle looks closely at the wyvern scales and decides they are suitable to make the rasps, yet another task he entrusts to you as a master artisan. Show the moogles how to affix the scales to a shaft of your choosing.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the managerial moogle.","You hand over the rasps to the modest moogle nearby, who happily accepts them saying the buildings will be sparkling clean in no time. Return to Mogek to report your duty done.","You return to the plaza where Mogek seems to have already been made aware of the situation by a wyvern that was flying past Zenith earlier and saw the collecting of scales. He quips what sounds like an old moogle saying, but then soon denies as any sort of saying."],"objectives":["Speak with the managerial moogle.","Obtain wyvern scale flakes from the twitching wyvern.","Deliver the wyvern scale flakes to the managerial moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the dragonscale rasps</span><span class=\"alternative\">Deliver the dragonscale rasps to the modest moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"You'll have noticed the stone buildings of the Churning Mists are caked with centuries of mold and grime. While some might say this gives them character, I'm not sure it makes for the healthiest environment."},{"name":"MOGEK","text":"I entrusted the task of scouring the buildings to some moogles at Zenith. Having done so, they soon requested more adept hands─yours, kupo! They will explain everything there."},{"name":"MATERIALGETMOOGLE02313","text":"You've come to the right place, kupo! We are the cleaning team Mogek sent to scrape the structures. Yet I suppose you are wondering why our wyvern friend is here."},{"name":"MATERIALGETMOOGLE02313","text":"We were given metal rasps from the Temple Knight sappers, but they wore down too quickly. It was by chance that we found something else to use: coarse dragon scales, which have proven to be surprisingly resilient."},{"name":"MATERIALGETMOOGLE02313","text":"Fortunately, this molting wyvern has happily volunteered to help. However, we are having trouble removing the scales from the molt as our paws are less suited than your fingers to the task. Can you do it for us?"},{"name":"MATERIALGETMOOGLE02313","text":"Although he seems a bit shy. He asked us himself if we would do this in a secluded location."},{"name":"WYVERN02313","text":"If it is scales that you want, I have more than enough to give. My skin itches terribly so."},{"name":"RECEIPTMOOGLE02313","text":"Wyverns don't shed their scales very often, so we are very lucky to have him help us, kupo!"},{"name":"SYSTEM","text":"Bits of dead skin drift through the air as you pluck handfuls of scale flakes from the molt on the wyvern's back. He breathes a sigh of relief."},{"name":"WYVERN02313","text":"Ahhh, that feels much better than scraping my back against the crags."},{"name":"WYVERN02313","text":"Shall I take my leave, then? I hope to conclude before my brothers come looking for me."},{"name":"MATERIALGETMOOGLE02313","text":"Let's see what you've got, kupo!"},{"name":"MATERIALGETMOOGLE02313","text":"Great work, kupo! They'll snap off far too easily if they are brittle, but these ones will do nicely! That being said, we have one more favor to ask of you."},{"name":"MATERIALGETMOOGLE02313","text":"As a talented artisan, could you show us how to affix these scales to flat, metal shafts to make the rasps?"},{"name":"MATERIALGETMOOGLE02313","text":"As a talented artisan, could you show us how to affix these scales to shafts of hardened leather or wood to make the rasps?"},{"name":"MATERIALGETMOOGLE02313","text":"As a talented artisan, could you show us how to whip up an adhesive sticky enough to affix the scales to these metal shafts for the rasps?"},{"name":"MATERIALGETMOOGLE02313","text":"My friend over there will be the one to collect them. Thanks again for the help, kupo!"},{"name":"MATERIALGETMOOGLE02313","text":"If you need more materials to practice with, I'll have them ready for you. Sometimes it takes more than one attempt to get it right when making new tools, kupo!"},{"name":"MATERIALGETMOOGLE02313","text":"That was a lot simpler and quicker than I expected, kupo! I will keep your method in mind when making more."},{"name":"RECEIPTMOOGLE02313","text":"I'm waaaiting, kupo!♪"},{"name":"RECEIPTMOOGLE02313","text":"Thank you, thank you. I'll gather the others. The buildings of the Churning Mists will be sparkling in no time, kupo!"},{"name":"RECEIPTMOOGLE02313","text":"Soon the buildings will be molting their old skins, too!"},{"name":"MATERIALGETMOOGLE02313","text":"Sometimes I find myself envious of man's hands. Then I try to visualize having them, and see nothing but part moogle, part horrible beast."},{"name":"MOGEK","text":"There you are, kupo! I was surprised to hear from one of the wyverns that she was flying past Zenith and saw the moogles using their old scales to make better rasps."},{"name":"MOGEK","text":"Well, you know what they say, a dragon's trash is a moogle's treasure, kupo! ...Actually, no, no one really says that. But for the moment it's true, right?"}],"reward":{"gil":572,"reputation":50,"items":[{"num":20,"id":9},{"num":3,"id":21080}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017453","obj":{"i":1017453,"n":"Managerial Moogle","l":2002,"q":1}},{"type":"npc","id":"1017454","obj":{"i":1017454,"n":"Twitching Wyvern","l":2002,"q":1}},{"type":"npc","id":"1017549","obj":{"i":1017549,"n":"Modest Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15767","obj":{"i":15767,"n":"Dragonscale Rasp Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15741","obj":{"i":15741,"n":"Dragonscale Rasp","l":55,"c":21003,"t":63}}]}