{"quest":{"name":"Stirring by Sternutation","location":"The Churning Mists","id":67848,"patch":3.3,"sort":31,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017322,1017427,1017428,1017429,1017430,1017451,1017452],"genre":49,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek lets out a frustrated sigh.","Mogek has found himself in a conundrum as the dragons have been taking naps in the Mogmenders' construction sites, interfering with their work. As surprising a sleeping dragon is risky business, he has conceived an unconventional plan to make the dozing Dravanians sneeze themselves awake by showering them with the fluff of a cloud mallow. Speak with the moogle in charge of dispensing the cloud mallows to obtain one for the task at hand.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The moofy moogle lends you his fluffiest cloud mallow so that you may have success in making the drowsy dragons sneeze. Head towards Zenith where a meek moogle and a dozing dragon await.<br><br>※Speak with the moofy moogle in Bahrr Lehs to mount a cloud mallow.","The dragon murmurs softly as he lies amidst the rubble, showing no signs of moving. You rouse him from his slumber with a hearty shake of the cloud mallow, and he offers an apology before taking his leave. The moogle suggests you head towards road in the northeast.","You come upon another dragon lying in a supply road, its eyes heavy with drowsiness. With a furious shake, you fill the air and the nostrils of the dragon with cloud mallow fluff. Sneezing himself awake, the dragon curses the spores and takes flight.","In the Rookery you locate your final quarry, another dragon twitching every so often as she drifts in and out of a dream. You sprinkle fluff over her, triggering a mighty sneeze which coats your moogle companion from head to toe. He spares a moment to thank you before flying away to clean off the snot. Report your success to Mogek.","Mogek is grateful for your delicate handling of the situation. He explains to you that the dragons, having a different perception of time, could have very well slept for moons had they been left alone. Though he feels guilty for disturbing their naps, he nevertheless believes it was for the greater good."],"objectives":["Speak with the moofy moogle.","Ride the cloud mallow and sprinkle mallow puffs on the drowsy dragon.","Ride the cloud mallow and sprinkle mallow puffs on the dozing dragon.","Ride the cloud mallow and sprinkle mallow puffs on the dreaming dragon.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Oh, what to do... I know they mean no harm, but must the dragons use our construction sites as dozing spots? It's starting to slow our progress, kupo."},{"name":"MOGEK","text":"If only it were as simple as giving them a little nudge. I hear dragons do not take kindly to those who dare disturb their sleep... Ah, but wait! What if they were to wake of their own accord? Surely they would not be angry with us then, yes?"},{"name":"MOGEK","text":"I have an idea! Why don't you ride a cloud mallow and shake it over the dragons that they might sneeze themselves awake? It would be better to have an adventurer like you do it in case there are any mishaps, kupo."},{"name":"MOUNTCONTROLMOOGLE02312","text":"I heard, I heard. I'll be sure to give you one with lots of loose florets. It should take no more than a shake to make the fluff fly, kupo!"},{"name":"MOUNTCONTROLMOOGLE02312","text":"Did you fall off the cloud mallow, kupo? Here, try this one. It is not quite as fluffy as the last, but it will have to suffice."},{"name":"SYSTEM","text":"A dragon is napping peacefully. Return with a cloud mallow and sprinkle mallow puffs on it to rouse it from its dream."},{"name":"HOLYDRAGONA02312","text":"Slowly, now... Carefully, now... No sudden movements or loud noises..."},{"name":"HOLYDRAGONA02312","text":"&lt;sneeze&gt; My snout, it prickles... &lt;snort&gt;"},{"name":"HOLYDRAGONA02312","text":"Oh... Am I in your way? Forgive me, I was unaware. I shall find another place to rest."},{"name":"HOLYDRAGONA02312","text":"Phew... The next one is blocking the road to the northeast! Let's go, kupo!"},{"name":"HOLYDRAGONB02312","text":"&lt;sneeze&gt; So, that dreadful season is upon us."},{"name":"HOLYDRAGONB02312","text":"Damnable spores. &lt;sniffle&gt; Enough. I move for fair skies."},{"name":"HOLYDRAGONA02312","text":"That leaves one more to awaken. Our last stop is the Rookery, kupo!"},{"name":"HOLYDRAGONC02312","text":"&lt;sneeze&gt; What, where am I? I must have..."},{"name":"HOLYDRAGONC02312","text":"What a curious dream I had. A pity it had to end so abruptly. No matter, I shall take wing and think on its meaning."},{"name":"HOLYDRAGONA02312","text":"Is that...dragon snot on my fur? Ewww! One of the unexpected hazards of accepting this job, I suppose. Ugh, I'll have to go and clean this off. Anyway, many thanks for your help, kupo!"},{"name":"MOGEK","text":"Oh, thank goodness. I was beginning to worry they would never wake up, kupo. Dragons are prone to sleeping much longer than you or I."},{"name":"MOGEK","text":"Had we left those dragons be, who knows how long they might have slept? They could have delayed our work for <span class=\"emphasis\">moons</span>, kupo!"},{"name":"MOGEK","text":"I do feel a little guilty for disturbing their naps, but it was for the greater good. I am sure they would understand. Now it's time to get back to work, kupo!"}],"reward":{"gil":461,"reputation":50,"items":[{"num":20,"id":12},{"num":3,"id":21080}]},"reqs":{"beastrank":5,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017322","obj":{"i":1017322,"n":"Moofy Moogle","l":2002,"q":3}},{"type":"npc","id":"1017427","obj":{"i":1017427,"n":"Drowsy Dragon","l":2002,"q":1}},{"type":"npc","id":"1017428","obj":{"i":1017428,"n":"Dozing Dragon","l":2002,"q":1}},{"type":"npc","id":"1017429","obj":{"i":1017429,"n":"Dreaming Dragon","l":2002,"q":1}},{"type":"npc","id":"1017430","obj":{"i":1017430,"n":"Meek Moogle","l":2002,"q":1}},{"type":"npc","id":"1017451","obj":{"i":1017451,"n":"Meek Moogle","l":2002,"q":1}},{"type":"npc","id":"1017452","obj":{"i":1017452,"n":"Meek Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}}]}