{"quest":{"name":"Let There Be Light","location":"The Churning Mists","id":67842,"patch":3.3,"sort":25,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017411,1017470],"genre":49,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek has interesting news to share.","Mogek tells you of special statues once used to harness the magicks of dragons and a recent discovery of such devices in the Monsterie. In the hopes of discovering how they were used, he means to reawaken them with the help of Whei Ahf. Rather than go himself, of course, Mogek asks you to speak with Whei Ahf and convince him to help.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","In your search for Whei Ahf you find a young dragonling. You speak to him of Mogek's plan and he summons Whei Ahf to assist you. Ride to the Monsterie and awaken the long-dormant statues.<br><br>※Speak with the dextrous dragonet in Bahrr Lehs to mount Whei Ahf.","You happen upon a statue with an unusual carving reminiscent of a dragon. It reacts to the bellowing cry of Whei Ahf and soon pulses with energy. The dragon then bids you continue searching for more strangely carved constructs.","You find another statue, much like the last, and with another cry from Whei Ahf it begins to glow. He senses the last one close by and carries you off to resume your search.","Whei Ahf lets out a terrible roar that stirs both the ancient statue and a moogle sentry asleep at his post. Assuring you he was focused and alert, he takes notice of the glowing statue and makes a note to inform the Mogmenders. This reminds you that Mogek will also want to hear of your success.","Mogek is relieved to hear you had no troubles on your journey with Whei Ahf. He explains that the magic of the dragon's roar overwhelms moogles, sometimes causing pain or discomfort. You can be certain the moogles will call upon you should they again have need of the dragon's power."],"objectives":["Speak with the dextrous dragonet.","Ride Whei Ahf and use his Roar ability to awaken one of the statues.","Ride Whei Ahf and use his Roar ability to awaken another statue.","Ride Whei Ahf and use his Roar ability to awaken the last statue.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Say, <span class=\"highlight\">Forename</span>, you've spent a fair amount of time in the ruins dotting the Churning Mists, yes? Did you know they once used special conduits powered by the magicks of dragons?"},{"name":"MOGEK","text":"As luck would have it, we recently found three at the Monsterie still intact, kupo! What were they used for? That's what we mean to find out."},{"name":"MOGEK","text":"The quickest way to do so would be to reactivate them, and that will require the aid of our good friend Whei Ahf. I would go myself, but I'm much too busy. Yes, that's it. Busy! Now then, off you go."},{"name":"WYVERNRECEPTION02306","text":"Hello, <span class=\"alternative-container\"><span class=\"alternative\">daughter</span><span class=\"alternative\">son</span></span> of man. What business brings you here?"},{"name":"WYVERNRECEPTION02306","text":"Statues powered by dragons? Yes, I have heard stories. If the moogles wish to reawaken them, far be it from us to refuse. Allow me to call Whei Ahf."},{"name":"SYSTEM","text":"The dragon statue pulses faintly with a mysterious light. Have Whei Ahf use his Roar to see if it reacts."},{"name":"WYVERNRECEPTION02306","text":"Are there statues yet to be awakened? I will call Whei Ahf at once."},{"name":"SYSTEM","text":"The magicks in the stone statue stir, awakened by Whei Ahf's roar!"},{"name":"WYVERN02306","text":"(-Whei Ahf-)It is done. I am surprised after all these years they still respond to the dragon's call. The landlords were more clever than I thought. Come, let us find the others. "},{"name":"SYSTEM","text":"The magicks in the stone statue stir, awakened by Whei Ahf's roar!"},{"name":"WYVERN02306","text":"(-Whei Ahf-)This one too remembers the dragon's call. Hmmm...I sense there is yet another statue nearby. We must awaken it."},{"name":"NEARMOOGLE02306","text":"&lt;snore&gt; Please, mother...just one more kupo nut..."},{"name":"SYSTEM","text":"The magicks in the stone statue stir, awakened by Whei Ahf's roar!"},{"name":"WYVERN02306","text":"(-Whei Ahf-)This statue marks the last. I know not what manner of device is driven by their power, but it will soon be roused to action. Of this I am certain."},{"name":"NEARMOOGLE02306","text":"Kupopopo! I'll be good, I promise! Huh? Phew, it's only you. I was sleep─I mean, resting my eyes when I heard a terrible roar. But never mind that, the statue is glowing! Did you do this? I'll have to inform the Mogmenders at once."},{"name":"NEARMOOGLE02306","text":"You won't say anything about what you saw to Mogek, will you? He'll have my pom if he hears I was sleeping on duty again, kupo."},{"name":"MOGEK","text":"You've returned, and in one piece, kupo! We've tried to accompany Whei Ahf on trips such as this in the past, but the magic in his roar is so powerful. It's enough to pop one's pom!"},{"name":"MOGEK","text":"I confess that even my magnificent pom could not bear the might of his bellowing cry. I was in bed for at least a week."},{"name":"MOGEK","text":"Thankfully we have you to assist with dragon duties now. Such a lucky one you are. If only I had a pom as durable as you─wait, I'd nearly forgotten you don't have a pom! I suppose you're not so lucky after all, kupo."}],"reward":{"gil":572,"reputation":50,"items":[{"num":20,"id":12},{"num":3,"id":21080}]},"reqs":{"beastrank":4,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017411","obj":{"i":1017411,"n":"Mystified Moogle","l":2002,"q":1}},{"type":"npc","id":"1017470","obj":{"i":1017470,"n":"Dextrous Dragonet","l":2002,"q":5}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}}]}