{"quest":{"name":"An Ishgardian Treat","location":"The Churning Mists","id":67852,"patch":3.3,"sort":35,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017321,1017351,1017463,1017464],"genre":49,"usedItems":[15769,15743],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek points to Hildeth in the plaza.","Mogek was attempting to steer you towards Hildeth, who has requested your presence. Speak to the Temple Knight to see what she wants.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Speaking in a hushed voice, Hildeth tells you that the Temple Knight sappers wish to repay the moogles for their hospitality by introducing them to Ishgardian stew. Upon the initial count of supplies, they noticed there were a couple of elements that had been forgotten in the order sent to Ishgard, and entrusts to your craftsmanship skills to make before the ingredients spoil. Go to Asah to request materials from Mogwon without giving away the surprise.","Mogwon seems a bit inquisitive about your request as Hildeth often asks for building materials in bulk, but hands you the necessary crafting materials anyway. Synthesize the remaining elements for the Ishgardian cuisine. <br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Mogwon.","You return to Hildeth with the finished products, who then declares that samplings of the cuisine are ready to be handed out. She then asks you to deliver them to Mogwon and the hardest-working moogles you see.","The moogles accept the meal trays with glee. However, as you hand them out, you notice Mogek with a puzzled look on his face. Return to him to ask what is wrong.","Mogek is shocked that he did not receive a bowl of stew from you, and turns away to sulk, saying it had always been his dream to try Ishgardian cuisine. Hopefully he will receive one the next time that Hildeth doles out the stew."],"objectives":["Speak with Hildeth.","Obtain the Ishgardian cuisine miscellany materials from Mogwon.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the Ishgardian cuisine miscellany</span><span class=\"alternative\">Deliver the Ishgardian cuisine miscellany to Hildeth</span></span>.","Deliver the Ishgardian cuisine to the moogles.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Welcome back, <span class=\"highlight\">Forename</span>. Not too long ago Hildeth requested your assistance, which is why I was pointing you that way."},{"name":"MOGEK","text":"It probably has to do with the work the sappers are doing, but I told her I would send you along if I saw you, kupo."},{"name":"HILDEATH","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good day to you</span></span>, <span class=\"highlight\">Forename</span>. I would prefer if we kept our voices down. We sappers are arranging something for the moogles."},{"name":"HILDEATH","text":"As you know, they recently have been providing us with much-needed sustenance, giving us the strength to continue to toil night and day on the restoration. We wanted to repay that kindness by giving them a taste of a traditional Ishgardian stew."},{"name":"HILDEATH","text":"I thought to beseech your help, as when preparing a banquet, one always finds something missing. It takes quite a while for supplies to reach the Churning Mists from Ishgard, and we wish to serve the food to them before the ingredients spoil."},{"name":"HILDEATH","text":"Upon checking the supplies, we realized utensils from Ishgard are somewhat unwieldly for moogle paws. Perhaps you could use your skills to craft smaller spoons?"},{"name":"HILDEATH","text":"Upon checking the supplies, we had forgotten to include essential accessories. Perhaps you could use your skills to make trays and serviettes?"},{"name":"HILDEATH","text":"Upon checking the supplies, we realized we are unsure what moogles would actually drink as an accompaniment to the meal. Perhaps you could use your skills to make something they would enjoy?"},{"name":"HILDEATH","text":"I hear you are acquainted with Mogwon in Asah. If you mention my name to him, I am sure he would hand over materials for you to use."},{"name":"HILDEATH","text":"Although I would still be discreet. Obviously, it is a surprise, and Mogwon tends to be inquisitive."},{"name":"HILDEATH","text":"I wonder, do moogles even eat meat? I've only ever seen them partake in kupo nuts, vegetables, and wine. Perhaps I should ask the cook to leave it out of the recipe in case it makes them sick. Hmm..."},{"name":"WORKINGMOOGLE02316","text":"One, two! One, two! No rest for the Mogmenders, kupo! Those nails aren't going to hammer themselves!"},{"name":"MOGWON","text":"You need more materials, kupo?"},{"name":"GATHERINGMOOGLE02316","text":"Phew... Gathering crystals really saps your strength, kupo. My arms are so sore."},{"name":"MOGWON","text":"Huh? Are you sure Hildeth doesn't need something a little stronger and heavier for building materials? She often asks me for resources in bulk."},{"name":"MOGWON","text":"Hmmm... Well, if it's for the Temple Knights, I suppose there's no need to question it. Here you are, kupo!"},{"name":"MOGWON","text":"You should take those to Hildeth right away. She gets a scary look on her face when her orders are delayed, kupo!"},{"name":"MOGWON","text":"My apologies, kupo. It's just my responsibility to make certain the materials are being used in ways that benefit the projects."},{"name":"HILDEATH","text":"I take it you were able to prepare the finishing touches?"},{"name":"HILDEATH","text":"Excellent. And with that, the meals are complete and ready to be handed out."},{"name":"HILDEATH","text":"Deliver these to the hardest-working moogles you can find. Oh, and Mogwon as well. And let me know if they enjoy it."},{"name":"HILDEATH","text":"I know it seems like so few bowls for how many moogles are working, but we want to be sure that it suits their tastes first. There's no use in ordering enough ingredients to feed all if it will only be wasted."},{"name":"WORKINGMOOGLE02316","text":"What are you just standing there for? We've got a job to do, kupo!"},{"name":"WORKINGMOOGLE02316","text":"Wow, this is unexpected! I suppose a small lunch break wouldn't hurt so long as we pick up the pace afterwards. Thank you very much, kupo!"},{"name":"MOGWON","text":"Oh, you're back. Does Hildeth require more resources?"},{"name":"MOGWON","text":"Aha! I knew she was planning something, kupo! This looks positively toothsome!"},{"name":"GATHERINGMOOGLE02316","text":"&lt;pant&gt; Where is the moogle to relieve me from duty? I really could use...&lt;pant&gt;...a break."},{"name":"GATHERINGMOOGLE02316","text":"Hildeth had you bring this food all the way over here for me? Wow, I feel so honored, kupo! Thank you, adventurer!"},{"name":"WORKINGMOOGLE02316","text":"It even has a little spoon just for me, kupo! No need to dig in with my bare paws. Although I am somewhat tempted."},{"name":"MOGWON","text":"Mmm, I can't wait to try it, kupo! This makes up for all of the headaches my team has been giving me lately."},{"name":"GATHERINGMOOGLE02316","text":"After a couple bites of that stew, I feel like I could bring in an entire cartload of crystals, kupo!"},{"name":"HILDEATH","text":"It appears the moogles are enjoying our culinary creation, so we hope to make this a regular occurrence. We will make more when the next shipment comes in, so be assured that every Mogmender will eventually be able to try a taste."},{"name":"MOGEK","text":"What is going on? I just saw a moogle fly by with a delicious-looking sauce dribbled all over his coat."},{"name":"MOGEK","text":"Hildeth is having trays of food handed out to some of the Mogmenders? But, but, what about <span class=\"emphasis\">me</span>, kupo? I didn't receive one! Are there any left?"},{"name":"MOGEK","text":"&lt;sigh&gt; Oh, it's fine. It's not like I <span class=\"emphasis\">told</span> you I wanted any. People forget, I suppose. It was just, you know, a little dream of mine to dine on proper Ishgardian cuisine, but oh well... &lt;sniffle&gt;"}],"reward":{"gil":617,"reputation":50,"items":[{"num":20,"id":10},{"num":3,"id":21080}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017321","obj":{"i":1017321,"n":"Hildeth","l":2002,"q":3}},{"type":"npc","id":"1017351","obj":{"i":1017351,"n":"Mogwon","l":2002,"q":4}},{"type":"npc","id":"1017463","obj":{"i":1017463,"n":"Motivated Moogle","l":2002,"q":1}},{"type":"npc","id":"1017464","obj":{"i":1017464,"n":"Mobilized Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15769","obj":{"i":15769,"n":"Ishgardian Cuisine Miscellany Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15743","obj":{"i":15743,"n":"Ishgardian Cuisine Miscellany","l":55,"c":21003,"t":63}}]}