{"quest":{"name":"The Moogle Motivator","location":"The Churning Mists","id":67854,"patch":3.3,"sort":37,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017351,1017467,1017624,1017625],"genre":49,"usedItems":[15771,15745],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek appears to be pondering something.","Mogek is concerned about Mogwon, the manager of the restoration of Asah who is on the verge of pulling out his fur in frustration. He requests that you travel to the area and inquire as to what is troubling the poor moogle.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Mogwon tells you that the restoration is not proceeding nearly as fast as expected, and an exceptionally lazy moogle is to blame for the delay. This particular moogle uses all manner of excuses to put off the work he has been allocated, and Mogwon pleads with you to go and speak with him, mender to mender.","You try to engage the moogle, who is performing stretches in what he calls his “preparatory routine.” He chastises you for disrupting his peace and quiet before flying off to hide behind another building. Find the moogle and try to /psych him up to encourage him to get back to work.","You try your best to encourage the moogle to return to his tasks, but he will have none of it. Threatening that no work will be done if he is disturbed again, he flies away to hide behind another building. Encouragement having been proven ineffective, take a firmer hand and give the moogle a /slap.","Tired of the moogle's excuses, you find him once more and try to slap some sense into him. Initially at a loss for words, he quickly recovers and accuses Mogwon of hypocrisy and refuses to follow his orders. Return to Mogwon and tell him you may have unintentionally exacerbated the situation.","Mogwon decides to follow Master Tarresson's advice and bribe the moogle with a splendid inducement, in the hopes that it might mollify and convince him to return to work. He asks you to craft such a piece and deliver it to the moogle saying it's from Mogwon himself.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Mogwon.","The moogle is overwhelmed with joy at the sight of your crafted gift. He soon reflects on his bad behavior and promises he will put more effort into his duties. Report to Mogek that you have solved Mogwon's problem.","Mogek seems somewhat surprised that a managerial moogle like Mogwon sought out advice on motivation from Tarresson. Knowing Tarresson is a bit of a trickster himself, Mogek shudders to think about what would happen if Mogwon asked him for such advice."],"objectives":["Speak with Mogwon.","Speak with the malingering moogle.","/psych up the malingering moogle.","/slap the malingering moogle.","Speak with Mogwon.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the moogle mollifier <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the moogle mollifier <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the malingering moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"Hello, <span class=\"highlight\">Forename</span>. I need your help. It's about Mogwon. The last I saw him, he looked as if he was going to pull out all of his fur in frustration."},{"name":"MOGEK","text":"If moogles could go bald, he would be the first, kupo! Might I trouble you to go to Asah and ask what is troubling him?"},{"name":"MOGWON","text":"Thank you for coming, <span class=\"highlight\">Forename</span>! I trust Mogek sent you to inquire about the progress here in Asah? While Bahrr Lehs is nearing completion, I can't say I am content with our pace here."},{"name":"MOGWON","text":"Thank you for coming, <span class=\"highlight\">Forename</span>! I trust Mogek sent you to inquire about the progress here in Asah? While the plaza at Bahrr Lehs has been completely restored, I can't say I am content with our pace here."},{"name":"MOGWON","text":"In fact, there is one moogle in particular who is not only a lackluster bricklayer, but a master procrastinator! He always has some sort of excuse for why he can't be bothered to put hammer to nail. I've tried everything!"},{"name":"MOGWON","text":"He doesn't like to listen to me, but he might lend an ear to a fellow mender, an elite one at that. Perhaps you can try giving him some words of encouragement?"},{"name":"MOGWON","text":"He's not hard to miss. He's always hiding behind the buildings so that I can't clearly see what he's up to."},{"name":"MOGWON","text":"I've begged and pleaded and even tried working up some tears, but nothing worked. Maybe he'll listen to you."},{"name":"SULKINGMOOGLE02318","text":"Up, down, turn around, breathe in, breathe out, breathe in..."},{"name":"SULKINGMOOGLE02318","text":"Shhh! Can't you see I am doing my preparatory routine? A mender must be of sound mind and body, and that is achieved through profound contemplation. I must have peace and quiet!"},{"name":"SYSTEM","text":"The malingering moogle flutters away, muttering under his breath."},{"name":"SYSTEM","text":"The malingering moogle is apparently one tough kupo nut to crack. Search for and try to <span class=\"highlight\">psych</span> him up."},{"name":"SYSTEM","text":"Despite your best efforts, the moogle continues to ignore you. Perhaps if you were to <span class=\"highlight\">psych</span> him up, it would put a spring into his step."},{"name":"SULKINGMOOGLE02318","text":"You again, kupo? I told you, if you disturb me, then I won't be able to focus and then no work will get done today! Now I have to start all over again."},{"name":"SYSTEM","text":"The malingering moogle scoffs at you as he flutters away."},{"name":"SYSTEM","text":"An expert <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> does not deserve this kind of treatment. Find the moogle once more and <span class=\"highlight\">slap</span> some sense into him."},{"name":"SYSTEM","text":"Despite your best efforts, the moogle continues to ignore you. Perhaps if you were to <span class=\"highlight\">slap</span> him, he would pay attention."},{"name":"SULKINGMOOGLE02318","text":"D─Did you just... What... H-How can <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> slap, kupo!?"},{"name":"SULKINGMOOGLE02318","text":"Mogwon says <span class=\"emphasis\">I'm</span> the one slacking off? For a moogle who does nothing but delegate all day, he has some nerve, kupo! If he's so fixated on pushing me around then he can forget it! Hmph!"},{"name":"SULKINGMOOGLE02318","text":"&lt;mumble&gt; ...knew I should've become a bard... &lt;grumble&gt;"},{"name":"MOGWON","text":"Any luck, kupo?"},{"name":"MOGWON","text":"You <span class=\"emphasis\">slapped</span> him? Wow, and I thought I had some pent-up frustrations. While I appreciate your enthusiasm, it appears to have had the opposite effect. Hmmm...maybe Master Tarresson was right about trying a more traditional method."},{"name":"MOGWON","text":"Bribery! If you crafted him a shiny new tool, surely he would feel obligated to put more effort into the restoration?"},{"name":"MOGWON","text":"Bribery! If you fashioned him a fancy set of work equipment, surely he would feel obligated to put more effort into the restoration?"},{"name":"MOGWON","text":"Bribery! If you whipped up an ointment to soothe his paws, surely he would feel obligated to put more effort into the reconstruction?"},{"name":"MOGWON","text":"He may not deserve it, but an angry mender is worse than a lazy mender."},{"name":"MOGWON","text":"If you need any materials, let me know. Oh, and be sure to tell him it's from me when you give it to him."},{"name":"MOGWON","text":"We have plenty of materials on hand, you need only say the word, kupo!"},{"name":"MOGWON","text":"Wow, you've really outdone yourself, kupo! This will perk him up for sure."},{"name":"SULKINGMOOGLE02318","text":"Oh no, it's Mogwon's personal moogle admonisher! Go away, kupo!"},{"name":"SULKINGMOOGLE02318","text":"A present? &lt;gasp&gt; Why, it's beautiful! I...I don't know what to say, kupo!"},{"name":"SULKINGMOOGLE02318","text":"Mogwon had this made just for me? Well, uh, aren't I feeling embarrassed. After all those things I said, too..."},{"name":"SULKINGMOOGLE02318","text":"...Well, I suppose I could approach my mending with a liiittle more gusto, kupo! Mogwon can be demanding at times, but to give me such a nice gift shows he truly cares. Thank you for bringing it to me."},{"name":"MOGWON","text":"Worked like a charm, kupo! Master Tarresson calls this the “stick and krakka root” method. He said that it is used to train chocobos to behave themselves, but it is apparently effective on moogles, too."},{"name":"SULKINGMOOGLE02318","text":"Never will I be fancy-free!♪<br>No one swings their hammer as dutifully as me!♪"},{"name":"MOGEK","text":"Did you find out what was bothering Mogwon?"},{"name":"MOGEK","text":"Somehow I'm not surprised, there's one in every bunch."},{"name":"MOGEK","text":"Although it is unexpected that a moogle as serious as Mogwon would take advice from Master Tarresson. I shudder to think what other tricks he might learn."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":517,"reputation":50,"items":[{"num":20,"id":12},{"num":3,"id":21080}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017351","obj":{"i":1017351,"n":"Mogwon","l":2002,"q":4}},{"type":"npc","id":"1017467","obj":{"i":1017467,"n":"Malingering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017624","obj":{"i":1017624,"n":"Malingering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017625","obj":{"i":1017625,"n":"Malingering Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15771","obj":{"i":15771,"n":"Moogle Mollifier Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15745","obj":{"i":15745,"n":"Moogle Mollifier","l":55,"c":21003,"t":63}}]}