{"quest":{"name":"Trying Times","location":"The Churning Mists","id":67858,"patch":3.3,"sort":3,"icon":100550,"beast":8,"unlocksFunction":1,"eventIcon":71341,"issuer":1017169,"target":1017170,"involved":[1017172,1017432,1017433,1017434,1017435,1017436],"genre":48,"usedItems":[15747,15721],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Master Mogzin and Tarresson are deep in discussion.","Tarresson and Mogzin have decided the next step in the repair of Bahrr Lehs, but as always there seems to be an obstacle. Speak with Tarresson to hear more of the situation.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Although Tarresson would like to begin rebuilding the plaza's outer walls, the Mogmenders still lack a reliable means to lift the heavy bricks. However, the moogles are not the only inhabitants of the Churning Mists. Mogzin takes the initiative and suggests that you ask the dragons for help. The moogle even claims that he knows a dragon that can lend its aid, and asks you to wait at the Mogmender outpost while he seeks his friend out.","After a short wait, Mogzin returns to introduce his friend Ohl Deeh, who perhaps one day in the distant future might grow into a mighty dragon. It quickly becomes apparent that although Ohl Deeh has good intentions, the dragonet lacks the strength required to help rebuild the wall. However, he suggests entreating his older brother for help, and departs for Zenith to seek him out.","Although the elder dragon is indeed larger than his younger sibling, he is less than enthused with the prospect of aiding the moogles in their “games.” However, after much urging by Ohl Deeh and Mogzin, he grants you the opportunity to earn his aid by undertaking a simple trial. He bids you craft an object which cannot speak, but can be heard. Should you manage to do so, Whei Ahf will pledge his strength to your cause.","You and Mogzin mull over the meaning of Whei Ahf's words. After a bit of prodding on your part, Mogzin surmises that the dragon has asked you to make him an instrument. Confident in this conclusion, Mogzin decides to make a horn, and asks you to contribute to its construction. Mogmul holds the outpost's supplies, and it is from him you should procure what you require.","After a bit of banter, Mogmul hands over the supplies you need. Return to Mogzin once your work is finished.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Mogmul Mogbelly.","Mogzin is impressed by your handiwork, and it seems he has finished crafting the horn. However, he requests more time to apply the final touches. He bids you go to Zenith and assures you that he will follow close behind.","The dragon explains that musical instruments were once very important to mortal and dragon alike, after Hraesvelgr shared knowledge of how to imbue them with magicks akin to a dragon's roar. Whei Ahf acknowledges that the horn you and Mogzin have wrought is worthy to summon him, and Mogzin is overjoyed at his approval. The dragons and Mogzin depart for Bahrr Lehs to commence construction of the wall.","Bahrr Lehs is alive with the sound of man, moogles, and now dragons. Tarresson takes in the scene and congratulates Mogzin for his accomplishment, deeming him worthy of calling himself a crafter at last. As everyone prepares to start working, you sense that it is more than just the plaza that will be rebuilt through this endeavor."],"objectives":["Speak with Tarresson.","Wait for Master Mogzin to return.","Speak with Whei Ahf in Zenith.","Speak with Master Mogzin at Bahrr Lehs.","Speak with Mogmul Mogbelly.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a horn component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Show the horn component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Master Mogzin</span></span>.","Speak with Whei Ahf.","Speak with Tarresson."],"dialogue":[{"name":"MOGZIN","text":"<span class=\"highlight\">Forename</span>, you're back, and at the perfect time! Tarresson and I were just discussing how to move forward with the restoration. You're welcome to join us, kupo!"},{"name":"MOGZIN","text":"At first we were at an impasse, but I believe we may have found a solution, kupo! Of course, another opinion is always welcome!"},{"name":"TARRESSON","text":"<span class=\"highlight\">Forename</span>, how kind of you to join us. We were just discussing how to proceed with the restoration. The Mogmenders are ready for a new challenge, and I have a mind to set them to work on the plaza's outer wall. And what would a challenge be without an insurmountable obstacle?"},{"name":"TARRESSON","text":"They lack the strength to even lift the wall's heavy bricks a fulm, let alone stack them on top of each other. In Ishgard, we would use levers and pulleys to get the job done, but I am afraid their design is unfit for moogle proportions."},{"name":"TARRESSON","text":"Short of creating an entirely new system─which is outside the realm of my expertise─the solution to this problem eluded me. That is, until the master Mogmender himself had a brilliant suggestion. Mogzin, if you will?"},{"name":"MOGZIN","text":"Certainly, kupo! I proposed calling upon the dragons for help! I've seen them grasp vast boulders in their mighty claws! It should be a simple task for them to stack the bricks on top of each other."},{"name":"TARRESSON","text":"An ingenious idea, yes? And one which fills me with anticipation, for I have never seen a dragon's might put to constructive use. It would seem, as well, that Mogzin already knows who to ask."},{"name":"MOGZIN","text":"That's right, kupo! I happen to count a dragon among my many friends! He's strong, too. Much stronger than any moogle I've met. Tarresson, <span class=\"highlight\">Forename</span>, wait here. I'll seek him out straightaway!"},{"name":"TARRESSON","text":"Mogzin certainly is full of surprises, wouldn't you agree? His idea to call upon the dragons required no urging from me. For now, I suppose we would do best to wait here and trust our moogle friend to return in due time."},{"name":"MOGZIN","text":"We are returned, kupo! <span class=\"highlight\">Forename</span>, Tarresson, meet Ohl Deeh!"},{"name":"OHLDEEH","text":"So these are the ones in need of my strength? They are so...wingless. Nonetheless, any friend of Mogzin is a friend of mine. I am at your service!"},{"name":"TARRESSON","text":"By the Fury, if you were not Mogzin's friend, I would be trembling in my boots! Ohl Deeh, I was made to believe you could hurl boulders through the skies with but a flick of your powerful claws. Is that true?"},{"name":"OHLDEEH","text":"Of...of course! Do not think me some weakling! I am a dragon, and the blood of the great wyrm Hraesvelgr courses through my veins! In just three centuries, even the most colossal stone will be as a pebble in my claws."},{"name":"TARRESSON","text":"Did you hear that? We need only wait three centuries. Fortunately, I have no pressing engagements for the next three hundred years. What about you, Mogzin? Have you the time to spare?"},{"name":"MOGZIN","text":"N-No, certainly not, kupo! Oh, there must be another way..."},{"name":"MOGZIN","text":"Ah, I know! Ohl Deeh, we have a surplus of foodstuffs thanks to Mogmul's shrewd management. Eat your fill, and before long you'll be as big and strong as Hraesvelgr... Right?"},{"name":"OHLDEEH","text":"Mogzin, Mogzin, Mogzin. You are always so shortsighted. How many times must I tell you the quickest solution is not always best?"},{"name":"MOGZIN","text":"But don't you understand? We <span class=\"emphasis\">can't</span> wait three hundred years! By that time the poms of every moogle in Moghome will have gone to dust!"},{"name":"OHLDEEH","text":"Hmph. My apologies. I sometimes forget how very fragile you moogles are. I suppose we will have to entreat my older brother for help, then. Let me warn you, however, that he can be a bit...trying at times. But worry not, for I am certain we can sway him to help us one way or another."},{"name":"MOGZIN","text":"Thank you, Ohl Deeh! I knew we would find a way! However, I know there's still more work to be done. Soon I'll be able to add “persuading a dragon” to my list of accomplishments!"},{"name":"MOGZIN","text":"But as they say, there is strength in numbers. <span class=\"highlight\">Forename</span>, pray accompany me, as it may lend more weight to our request. "},{"name":"OHLDEEH","text":"Well then, let us be off! My brother, Whei Ahf, usually spends his time deeper within Zenith. I will go ahead and see if I can soften him up before you arrive."},{"name":"TARRESSON","text":"Hmmm... I can only hope Ohl Deeh's brother possesses the strength we require. Just in case, I shall try to think of some other way we might solve this conundrum."},{"name":"OHLDEEH","text":"Say hello to Whei Ahf, <span class=\"highlight\">Forename</span>. Mind your manners around him."},{"name":"MOGZIN","text":"Look at him, kupo! Whei Ahf looks at least twice as strong as Ohl Deeh! I'm certain lifting those stones will prove no difficulty to him!"},{"name":"WHEIAHF","text":"My brother has requested I hear your plea, and I shall not deny him."},{"name":"MOGZIN","text":"We are grateful for this audience, kupo. You see, we mean to rebuild the walls of Bahrr Lehs. Alas, our tiny paws can barely grip the massive stones, let alone lift them. That is why we require a dragon's strength. <span class=\"emphasis\">Your</span> strength."},{"name":"WHEIAHF","text":"Ah, yes, we have heard tell of moogles playing at being stonemasons. This I know."},{"name":"WHEIAHF","text":"I care not how or where you conduct your games, or whom you choose to imitate. However, I will not be made party to such whimsy."},{"name":"MOGZIN","text":"Whei Ahf, with all due respect, you are mistaken! This is no game, kupo! We're pouring our heart and soul into repairing Bahrr Lehs─and it is only the beginning!"},{"name":"OHLDEEH","text":"Brother, Mogzin tells the truth! He is wholly devoted to this task. He's even forsworn trickery! Please, I implore you to give him and his people a chance."},{"name":"WHEIAHF","text":"...One chance, then, to show me the depth of your conviction."},{"name":"WHEIAHF","text":"If you truly are a crafter, then craft something for me. That which cannot speak, yet can be heard. Present it to me, and my strength shall be yours."},{"name":"MOGZIN","text":"What? I-I mean yes, of course! <span class=\"highlight\">Forename</span>, let us return to Bahrr Lehs, so we can begin work on Whei Ahf's request forthwith!"},{"name":"WHEIAHF","text":"That which cannot speak, yet can be heard. Bring that to me, and I shall lend you my strength. This I swear."},{"name":"OHLDEEH","text":"See, I knew Brother would be reasonable. Now, off you go to craft... What was it, again?"},{"name":"TARRESSON","text":"The dragon has given you a trial, has he? With you and Mogzin working to crack Whei Ahf's riddle, I'm sure you shall have the solution shortly."},{"name":"MOGZIN","text":"I don't know what to make of Whei Ahf's words. Something that can't speak, but can be heard? Oh, my pom aches from trying to wrap it around his riddle. Hmmm... Perhaps I should just trick him. It can't be much more difficult than tricking a moogle!"},{"name":"MOGZIN","text":"I jest, I jest, kupo! Worry not, I won't rest until I've deciphered his strange request. <span class=\"highlight\">Forename</span>, let's put our poms together. Together, we can chip away at the question until the answer takes shape before us!"},{"name":"MOGZIN","text":"What could it possibly be, kupo? <span class=\"highlight\">Forename</span>, you've traveled to all manner of places. Surely a worldly adventurer such as yourself can offer some insight."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Perhaps it's not an object, but a demonstration of skill he seeks?"},{"name":"A1","text":"Well, some folks say that dragons have an insatiable lust for treasure..."},{"name":"MOGZIN","text":"A skill? Well, we moogles excel at trickery...and lounging in the sun...and seeing how many kupo nuts we can fit into our mouths at once. No, no, that can't be─<br>Wait, I know, kupo!"},{"name":"MOGZIN","text":"What would a nap or a kupo nut eating competition be without musical accompaniment? We make even the most mundane event come alive with our horns and harps! And an instrument doesn't speak, but it can certainly be heard!"},{"name":"MOGZIN","text":"Treasure? Well, we value nothing more than our kupo nuts...and the shiny tools made by the landlords...but I don't see─<br>Wait, there's another treasure, kupo!"},{"name":"MOGZIN","text":"That's right! The horn we use to call upon the great Hraesvelgr! A horn which cannot speak, but indeed can be heard!"},{"name":"MOGZIN","text":"So it's an instrument Whei Ahf wants! Now, I've always been partial to tooting the horn myself, so I believe crafting one should prove simple! However, I would entrust you with a separate task."},{"name":"MOGZIN","text":"A quality mouthpiece, while small, is indispensable if we want the sound to impress. And I would trust no one but you to craft a proper one! Mogmul should have any materials you require. I await your masterpiece, kupo!"},{"name":"MOGZIN","text":"Please, craft me a grip, which is most vital to ensure none drop the horn while giving it a mighty blow! Mogmul should have any materials you require. I await your masterpiece, kupo!"},{"name":"MOGZIN","text":"Grease to polish the horn to a mirror shine should provide that stunning final touch! Mogmul should have any materials you require. I await your masterpiece, kupo!"},{"name":"MOGZIN","text":"TEST"},{"name":"MOGZIN","text":"The horn is a basic instrument, but that doesn't mean I won't try my best! And with your help I'm sure a good horn will turn into a great one!"},{"name":"MOGMUL","text":"You've come here for materials? Very well, that will be thirty kupo nuts please!<br>Hahaha, you should see the look on your face! It was merely a jest! Please, take as much as you require. Free of charge, of course!"},{"name":"MOGMUL","text":"If perchance you find yourself low on materials, you need only return here for more, kupo! That is, if I am not absent. My stomach is rumbling and I may have to take my next meal sooner rather than later."},{"name":"MOGZIN","text":"Are you finished, kupo? I've completed the horn, and all I require is your final flourish!"},{"name":"MOGZIN","text":"This is even better than I could've hoped, kupo! Any moogle will surely be proud to toot on the horn─even Chieftain Moglin!"},{"name":"MOGZIN","text":"Nevertheless, I must take care when applying the final touches. Go on ahead and meet with Ohl Deeh and his brother. I will be close behind, horn in paw!"},{"name":"OHLDEEH","text":"Ah, there you are. Honestly, I thought you would be longer. Of course, I have solved my brother's riddle already, but I am curious to see what you've come up with!"},{"name":"MOGZIN","text":"With this horn, I'll prove to Whei Ahf the strength of my conviction and the depth of my determination. It needs to be just right... <span class=\"highlight\">Forename</span>, go ahead to where the dragon siblings await. I'll meet you there shortly, kupo!"},{"name":"MOGZIN","text":"Whei Ahf, we thought long and hard on your words, and have brought that which you seek. Behold, a Mogmender masterpiece!"},{"name":"OHLDEEH","text":"Why, that is just a horn! Why would Brother want that? Of course a horn cannot─<br>Oh, I see! How clever, Mogzin! And the craftsmanship is even better than we had hoped."},{"name":"WHEIAHF","text":"Do not feign knowledge, Ohl Deeh. You did not know the answer. As for you, Mogzin...was this horn truly wrought by your hands?"},{"name":"MOGZIN","text":"Indeed, kupo! I put every onze of my skill into its construction! Every onze...as well as a dash of <span class=\"highlight\">Forename</span>'s skill for good measure."},{"name":"WHEIAHF","text":"A horn does not speak, yet it can be heard from even the highest peaks. It would seem my trial was simple before the combined efforts of man and moogle. I am impressed. Accept my apologies for doubting you."},{"name":"OHLDEEH","text":"That means you'll help Mogzin!? Splendid! But Brother, I still don't understand why a horn is so important to you."},{"name":"WHEIAHF","text":"How much you have yet to learn─though I am sure you were taught once before that our songs are as roars to their ears, so alien and unfathomable."},{"name":"WHEIAHF","text":"So it was that Hraesvelgr bequeathed a magick to men, that they fashion sacred instruments to join in the chorus. The horn entrusted to the moogles is but one of these works."},{"name":"WHEIAHF","text":"If you would have my aid, you must wield an instrument worthy of calling upon my kind. I believe this horn will do nicely."},{"name":"MOGZIN","text":"An instrument to summon a dragon!? It's that good, kupopo!? I've never...I mean, no one has ever praised something I've made! This feeling is better than eating three kupo nuts at once!"},{"name":"MOGZIN","text":"I-I apologize. I got a little carried away! Now, where were we? Oh yes! Whei Ahf, allow me to escort you to Bahrr Lehs!"},{"name":"OHLDEEH","text":"When you presented that tiny horn to Brother, I was sure he'd laugh you out of Zenith. I suppose I still have much to learn about riddles and puzzles."},{"name":"WHEIAHF","text":"My word is my bond, and my wings are your wings."},{"name":"MOGZIN","text":"To create something with my own paws is an amazing feeling, kupo! Absolutely amazing!"},{"name":"TARRESSON","text":"Now this is what I envisioned when Mogzin spoke of dragons. I applaud your success, my friend, although I did not doubt you for a second. Mogzin certainly seems to be in high spirits. Higher than usual, even. Did your meeting with Whei Ahf go that well?"},{"name":"TARRESSON","text":"Ah, now I see. My dear Mogzin, how does it feel? To labor over your creation, to pour every onze of your vim and brio into it, and for that effort to be recognized and earn you accolades. Tell me true: can you think of aught better?"},{"name":"MOGZIN","text":"No, no, I can't, kupopo! This is even more thrilling than when I tricked Mogupp!"},{"name":"TARRESSON","text":"Hahaha, and now you understand why we crafters slave away for our art. Yes, “we,” for I daresay you are now as much a crafter as <span class=\"highlight\">Forename</span> or myself. Still, do not think your journey over already. You have much to learn yet in the way of technique."},{"name":"MOGZIN","text":"Me, a <span class=\"emphasis\">crafter</span>, kupo!? I...I don't know what to say, except that I'll try my utmost not to disappoint!"},{"name":"TARRESSON","text":"And you must be Whei Ahf, whose trial spurred Mogzin's growth. I am Tarresson, and I offer my humble greetings and thanks. Well then, shall we begin? For perhaps the first time in a thousand years, man and dragon shall work together to build, not destroy."},{"name":"WHEIAHF","text":"Although I am too young to have known the peace our ancestors once shared, I am honored to work alongside you. May our bonds be strengthened through our labor."},{"name":"SYSTEM","text":"Thanks to your efforts, the outer walls of Bahrr Lehs have been restored. Continue assisting the Mogmenders to see repair of the plaza completed."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Mogmenders."},{"name":"SYSTEM","text":"New moogle tribal daily quests are now available from Mogek the Marvelous at the plaza."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon the completion of the moogle tribal daily quests."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Mogek the Marvelous as a reputation rank bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Mogek the Marvelous. Please be advised that you cannot undertake these quests if you have no remaining allowances."}],"reward":{"gil":658,"items":[{"num":3,"id":5712,"one":1},{"num":3,"id":5707,"one":1},{"num":3,"id":5692,"one":1}]},"reqs":{"beastrank":2,"jobs":[{"lvl":50,"id":33}],"quests":[67857]},"next":[67859]},"partials":[{"type":"npc","id":"1017169","obj":{"i":1017169,"n":"Master Mogzin","l":2002,"q":4}},{"type":"npc","id":"1017170","obj":{"i":1017170,"n":"Tarresson","l":2002,"q":9}},{"type":"npc","id":"1017172","obj":{"i":1017172,"n":"Mogmul Mogbelly","l":2002,"s":4,"q":4,"t":"Craver of Kupo Nuts","r":1,"a":2095,"c":[15.99,28.55]}},{"type":"npc","id":"1017432","obj":{"i":1017432,"n":"Whei Ahf","l":2002,"q":2}},{"type":"npc","id":"1017433","obj":{"i":1017433,"n":"Ohl Deeh","l":2002,"q":2}},{"type":"npc","id":"1017434","obj":{"i":1017434,"n":"Master Mogzin","l":2002,"q":1}},{"type":"npc","id":"1017435","obj":{"i":1017435,"n":"Ohl Deeh","l":2002,"q":1}},{"type":"npc","id":"1017436","obj":{"i":1017436,"n":"Whei Ahf","l":2002,"q":1}},{"type":"item","id":"5712","obj":{"i":5712,"n":"Craftsman's Command Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"Control","category":1}}},{"type":"item","id":"5707","obj":{"i":5707,"n":"Craftsman's Cunning Materia IV","l":55,"c":20204,"t":58,"materia":{"tier":3,"value":4,"attr":"CP","category":1}}},{"type":"item","id":"5692","obj":{"i":5692,"n":"Gatherer's Guile Materia IV","l":55,"c":20212,"t":58,"materia":{"tier":3,"value":6,"attr":"Perception","category":2}}},{"type":"item","id":"15747","obj":{"i":15747,"n":"Horn Component Materials","l":55,"c":26001,"t":63}},{"type":"item","id":"15721","obj":{"i":15721,"n":"Horn Component","l":55,"c":21012,"t":63}},{"type":"quest","id":"67857","obj":{"i":67857,"n":"The Milk of Moogle Kindness","g":48,"l":"The Churning Mists","s":2,"f":1}},{"type":"quest","id":"67859","obj":{"i":67859,"n":"A Crystalline Solution","g":48,"l":"The Churning Mists","s":4,"f":1}}]}