{"quest":{"name":"From Lax to Max","location":"The Churning Mists","id":67851,"patch":3.3,"sort":34,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017352,1017457,1017458,1017459,1017460,1017461,1017462],"genre":49,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek twitches his whiskers and beckons you over.","A group of moogle gatherers have been ignoring Moguppo's orders, and Mogek has a mind to teach them a lesson. He asks you to go to them in his stead and give them the harshest, most extreme orders you can conceive, as well as warn them of terrible consequences should they disobey. Make for Zenith and locate the dawdling moogle gatherers.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Mustering your most intimidating glare, you approach the moogles one by one and give them tasks so daunting that they flee in terror, eager to complete them. Travel to Asah and tell Moguppo that you have seen to the moogles on Mogek's behalf.","Moguppo tells you that he has not seen any of the gathering moogles return yet with supplies and assumes they have chosen not to follow your orders. He asks that you go and see for yourself whether or not the moogles are gathering what has been requested of them.","Your efforts appear to have borne fruit, as each moogle presents to you the materials they have gathered, despite clearly having struggled to do so. Deliver the raw materials to Moguppo so that the restoration of Zenith can continue.","Moguppo is pleasantly surprised by the quantity of materials the moogles gathered in such a short period of time. He praises your powers of persuasion, deeming you a “moogle whisperer.” Return to Bahrr Lehs and report your success to Mogek.","Your success amuses Mogek, who thinks it remarkable that a stone-faced adventurer can so easily command the obedience of lazy moogles. His only regret is that he was not present to bear witness to their long-overdue comeuppance."],"objectives":["Speak with the maundering moogles at Zenith.","Speak with Moguppo in Asah.","Search for the maundering moogles.","Deliver the gathered resources to Moguppo.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"There you are! I have a somewhat unconventional task for you. As you know, the restoration of Zenith is a massive undertaking and it requires gathering an immense amount of resources."},{"name":"MOGEK","text":"Unfortunately, Moguppo tells me that the moogles under his command, who have been mostly loafing around, are now ignoring his requests entirely. He asked me to intervene personally, but I think they need to be taught a harsher lesson."},{"name":"MOGEK","text":"I want you to go to these moogles in my stead and give them the harshest, most extreme orders you can come up with. And if they don't do as bade, I will see that they face dire consequences."},{"name":"MOGEK","text":"You can make up whatever consequences you like, but be as intimidating as possible, kupo!"},{"name":"INSTRUCTIONWAITINGAMOOGLE02315","text":"Gather ninety-nine birds' nests or else he'll have you squeeze my pom off!? Uwaaah! Not my pom, kupo! Anything but my pom!"},{"name":"INSTRUCTIONWAITINGBMOOGLE02315","text":"Y-You can't be serious, kupo!? How am I supposed to gather <span class=\"emphasis\">that</span> many wadjet spines? It's not like they'll just let me climb on their backs and─ Gah, don't stare at me like that, kupo! Okay, I'm going, I'm going!"},{"name":"INSTRUCTIONWAITINGCMOOGLE02315","text":"Hello there─ Huh? Mogek says I'm to gather wind crystals while searching for one hundred and one moogles hiding throughout the Churning Mists <span class=\"emphasis\">or else</span>? Or else what? N-Never mind. That tone says it all, kupo!"},{"name":"MOGUPPO","text":"&lt;sigh&gt; We're beginning to run out of wind crystals, kupo..."},{"name":"MOGUPPO","text":"Hmmm... That's strange. I thought they would have returned by now."},{"name":"MOGUPPO","text":"Oh, I am certain they are slacking off again, kupo!"},{"name":"MOGUPPO","text":"Could you find them and make sure that they are gathering materials as instructed?"},{"name":"MOGUPPO","text":"Where did they go to get those wind crystals? The moon?"},{"name":"INSTRUCTIONWAITINGAMOOGLE02315","text":"H-Here you are, ninety-nine passerine nests. Oh, please, please, please don't pop my pom, kupo!"},{"name":"INSTRUCTIONWAITINGBMOOGLE02315","text":"Never...&lt;pant&gt;...again."},{"name":"INSTRUCTIONWAITINGCMOOGLE02315","text":"Here are the wind crystals. &lt;pant&gt; And I could only find thirty-four hiding moogles, kupo... &lt;pant&gt; F-Forgive me."},{"name":"INSTRUCTIONWAITINGAMOOGLE02315","text":"Hooray, I'm saved! Ninety-nine passerine nests on the shelf. Ninety-nine passerine... Ahahaha. Ha. &lt;sob&gt;"},{"name":"INSTRUCTIONWAITINGBMOOGLE02315","text":"I get it. &lt;sniffle&gt; I've learned my lesson. &lt;sob&gt; Moguppo is so much nicer about his requests."},{"name":"INSTRUCTIONWAITINGCMOOGLE02315","text":"&lt;pant&gt; I don't know what moogle in their right mind would think this was a good idea. &lt;pant&gt;"},{"name":"MOGUPPO","text":"Well, where were they? Did they even do what they were told?"},{"name":"MOGUPPO","text":"They gathered <span class=\"emphasis\">all</span> of these on their own? What? How?"},{"name":"MOGUPPO","text":"This is incredible. You're like a moogle whisperer, kupo! You can tell Mogek that we have enough raw materials for now. Thank you, <span class=\"highlight\">Forename</span>!"},{"name":"MOGUPPO","text":"You should teach me your methods sometime, kupo!"},{"name":"MOGEK","text":"How did it go, kupo?"},{"name":"MOGEK","text":"Wow, they actually did everything you bade them to?"},{"name":"MOGEK","text":"Remarkable isn't it? That they change their tune when they have an adventurer giving them orders rather than our sweet little Moguppo."},{"name":"MOGEK","text":"Although I must admit, I wish I could have seen the looks on their faces myself, kupo. &lt;giggle&gt;"}],"reward":{"gil":728,"reputation":50,"items":[{"num":20,"id":11},{"num":3,"id":21080}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017352","obj":{"i":1017352,"n":"Moguppo","l":2002,"q":2}},{"type":"npc","id":"1017457","obj":{"i":1017457,"n":"Maundering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017458","obj":{"i":1017458,"n":"Maundering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017459","obj":{"i":1017459,"n":"Maundering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017460","obj":{"i":1017460,"n":"Maundering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017461","obj":{"i":1017461,"n":"Maundering Moogle","l":2002,"q":1}},{"type":"npc","id":"1017462","obj":{"i":1017462,"n":"Maundering Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}}]}