{"quest":{"name":"Mine and Craft","location":"The Churning Mists","id":67853,"patch":3.3,"sort":36,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017465,1017466],"genre":49,"usedItems":[15770,15744],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek puffs up his chest.","Mogek tells you that the Temple Knights have been teaching the moogles new techniques for mining wind crystals, but he has yet to see any hauls returning from the extraction site. He asks you to check on the two mining moogles setting up their extraction site underneath the large floating isle at Ohl Tahn.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The moogle miner tells you that his apprentice accidentally dropped one of the cargo boxes carrying parts of a treadwheel crane. He requests that you use your skills to replace the pieces so that his apprentice can put the crane together and finally commence the mining operation.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with the mining moogle.","You successfully craft the replacement crane components and hand them over to the mentee moogle, who expresses his joy and gratitude that they can get back to work. Return to Mogek and apprise him of the details.","Mogek is relieved to hear that the operation will soon be underway. He expresses hope that the two miner moogles will be careful, for the Temple Knights have warned them that mining too many crystals from the center could cause the floating isles to fall out of the sky."],"objectives":["Speak with the mining moogle.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize the treadwheel crane components</span><span class=\"alternative\">Deliver the treadwheel crane components to the mentee moogle</span></span>.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"It's good to see you, kupo! I have a favor to ask. We've been learning new techniques for mining wind crystals from the Temple Knights, and two of our mining moogles were sent to try out their methods. But I haven't seen so much as a shard delivered yet."},{"name":"MOGEK","text":"I'm not privy to what's going on over there, so I was wondering if you could go and see what's keeping them? They said they would set up their extraction site on a small floating islet underneath Ohl Tahn."},{"name":"BORINGMOOGLEA02317","text":"Well met, adventurer! I assume Mogek sent you to check on us? We seem to be in a bit of a pinch, kupo."},{"name":"BORINGMOOGLEA02317","text":"The Temple Knight sappers told us the wind crystals within the center of floating isles are much more potent than ordinary crystals, and suggested drilling holes to mine them from the inside out."},{"name":"BORINGMOOGLEA02317","text":"But we've had a little accident, kupo. You see, the Temple Knights lent us a treadwheel crane with which to haul load from the center of the isle, but in bringing it to this spot piece by piece, my apprentice dropped one of the cargo boxes and it disappeared through the clouds, kupo!"},{"name":"BORINGMOOGLEA02317","text":"We can't retrieve it and even if we could, I'm certain the components in that box would be nothing but dust by the time we found it. We require replacement parts posthaste."},{"name":"BORINGMOOGLEA02317","text":"You will help us, right? You can make us a metal sheave that won't break under the weight of hundreds of ponzes worth of crystals?"},{"name":"BORINGMOOGLEA02317","text":"You will help us, right? You can make us parts for the belt and wheel strong enough to withstand the weight of hundreds of ponzes worth of crystals?"},{"name":"BORINGMOOGLEA02317","text":"You will help us, right? You can mix us pots of grease with which to lubricate the pulley?"},{"name":"BORINGMOOGLEA02317","text":"I've brought with me some items which you can use to make replacement components. When you've finished, bring them to my apprentice so that he may start putting the treadwheel together."},{"name":"BORINGMOOGLEA02317","text":"Here are the materials. I hope you can replace the missing elements speedily─the demand for wind crystals is never quite sated and I'm sure Mogek is already becoming impatient, kupo."},{"name":"BORINGMOOGLEA02317","text":"If you've finished creating the components, please give them to my apprentice over there. He'll be the one to put the crane together, kupo!"},{"name":"BORINGMOOGLEB02317","text":"Curse these little paws, kupo! If only I had been more careful..."},{"name":"BORINGMOOGLEB02317","text":"Are the components ready? Can it really be fixed?"},{"name":"BORINGMOOGLEB02317","text":"Oh, thank you! Thank you so much, kupo! I swear on my pom that I will never drop another box in my life. You can tell Mogek that we're all set here, kupo!"},{"name":"BORINGMOOGLEB02317","text":"We will be able to commence our mining in no time, kupo!"},{"name":"BORINGMOOGLEA02317","text":"Phew... You really saved us there. Oh, but let's keep this as a secret. No use having the Temple Knights fret over spilled nut milk. With your master mending skills, you might even have improved the original crane, right?"},{"name":"MOGEK","text":"Welcome back, <span class=\"highlight\">Forename</span>! I take it you were able to resolve the problem?"},{"name":"MOGEK","text":"Excellent, kupo! New mining techniques are always welcome, especially now that we know the wind crystals in the center of the isles are of better quality. I can't wait to see the delivery of the first loads."},{"name":"MOGEK","text":"But I hope those two take great care with every step. The Temple Knights warned us to extract the crystals in moderation, else the isle loses its buoyancy and falls right out of the sky, kupo!"}],"reward":{"gil":600,"reputation":50,"items":[{"num":20,"id":13},{"num":3,"id":21080}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017465","obj":{"i":1017465,"n":"Mining Moogle","l":2002,"q":1}},{"type":"npc","id":"1017466","obj":{"i":1017466,"n":"Mentee Moogle","l":2002,"q":1}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}},{"type":"item","id":"15770","obj":{"i":15770,"n":"Treadwheel Crane Component Materials","l":55,"c":25919,"t":63}},{"type":"item","id":"15744","obj":{"i":15744,"n":"Treadwheel Crane Components","l":55,"c":21003,"t":63}}]}