{"quest":{"name":"Tremble Finishing","location":"The Churning Mists","id":67855,"patch":3.3,"sort":38,"interval":"daily","repeatable":1,"beast":8,"eventIcon":71222,"issuer":1017171,"target":1017171,"involved":[1017468,1017469,1017470],"genre":49,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mogek waves his little paws excitedly.","After discovering that the roar of dragons can strengthen the aspect of crystals in the vicinity, Mogek wonders whether the roar will have the same effect on kupa trees, strengthening the crystals growing within their massive trunks. He asks you to call upon Whei Ahf to test the theory, while also taking advantage of the opportunity to have him roar to strengthen a crystal cluster.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","With a flip and a flick of the tail, the dextrous dragonet calls for Whei Ahf, whom you bestride and guide to the kupa tree.<br><br>※Speak with the dextrous dragonet in Bahrr Lehs to mount Whei Ahf.","Whei Ahf roars upon the crystal, which begins to strongly gleam. The moogle nearby observes the growth excitedly as you take off to find the crystal cluster.","Whei Ahf brings his magicks to bear on the crystal cluster, which shines brighter in response. Return to Mogek and report what you have seen.","While it is too early to tell whether the results of Whei Ahf's roar on the kupa tree have been fruitful, Mogek is relieved that there appear to be no negative outcomes from the experiment. He expresses appreciation to you and Whei Ahf for your efforts."],"objectives":["Speak with the dextrous dragonet.","Ride Whei Ahf and use his Roar ability on the kupa tree.","Ride Whei Ahf and use his Roar ability on the crystal cluster.","Report to Mogek the Marvelous."],"dialogue":[{"name":"MOGEK","text":"<span class=\"highlight\">Forename</span>, the Mogmenders and I had a splendid idea! Do you recall how crystals are strengthened when bathed in the roar of dragons?"},{"name":"MOGEK","text":"Well, consider the kupa tree, rich in aether and a natural source of crystals. If Whei Ahf were to roar at one, surely it would bear even better crystals, yes?"},{"name":"MOGEK","text":"We would like to test this theory, so could you summon Whei Ahf and ask him to roar upon a kupa tree? Oh, and while you're at it, might you also stop by one of the clusters we gather and have him roar on it as well?"},{"name":"WYVERNRECEPTION02319","text":"Well met, <span class=\"alternative-container\"><span class=\"alternative\">daughter</span><span class=\"alternative\">son</span></span> of man. What is your business here?"},{"name":"WYVERNRECEPTION02319","text":"And so you are requesting the help of Whei Ahf once more. Give me a moment, I shall call him over."},{"name":"SYSTEM","text":"The crystals within the kupa tree trunk softly glow with aetheric energy. Return with Whei Ahf and use his Roar ability to nurture its growth."},{"name":"SYSTEM","text":"The enormous crystal cluster softly glows with aetheric energy. Return with Whei Ahf and use his Roar ability to nurture its growth."},{"name":"NEARMOOGLEA02319","text":"Right here, right here! We need Whei Ahf to stand right here and roar, kupo!"},{"name":"NEARMOOGLEB02319","text":"Oooh, this crystal is sooo big, kupo..."},{"name":"WYVERNRECEPTION02319","text":"Oh, where can he be? Please wait here for a moment."},{"name":"NEARMOOGLEA02319","text":"Look how it glows! Surely the crystals are stronger now, kupo!"},{"name":"WYVERN02319","text":"(-Whei Ahf-)There was one more that you would have me bellow my magicks upon, yes?"},{"name":"NEARMOOGLEA02319","text":"I'm eager to see what happens, but I fear it is like waiting for a flower to bloom..."},{"name":"NEARMOOGLEB02319","text":"The aether in the cluster is changing, I can feel it! I'll have to be careful not to get sick..."},{"name":"WYVERN02319","text":"(-Whei Ahf-)And with that, it would seem my work here is done. I am glad to have been of some help to you, <span class=\"alternative-container\"><span class=\"alternative\">daughter</span><span class=\"alternative\">son</span></span> of man. Now let us return."},{"name":"NEARMOOGLEB02319","text":"I'm already starting to feel a little woozy, kupo. Maybe I should...move back a bit."},{"name":"MOGEK","text":"You're back, kupo! I'm glad that I didn't see any explosions in the distance. I was a little worried that the magicks of dragons might be too potent in the presence of all that aether."},{"name":"MOGEK","text":"It makes me reflect on how fortunate we are to have you and Whei Ahf assist us like this. If it weren't for you two, I don't think the Mogmenders would have made it half as far as they have."},{"name":"MOGEK","text":"I suppose it just goes to show that no moogle is an island, kupo!"}],"reward":{"gil":600,"reputation":50,"items":[{"num":20,"id":9},{"num":3,"id":21080}]},"reqs":{"beastrank":6,"jobs":[{"lvl":50,"id":33}]}},"partials":[{"type":"npc","id":"1017171","obj":{"i":1017171,"n":"Mogek The Marvelous","l":2002,"q":30}},{"type":"npc","id":"1017468","obj":{"i":1017468,"n":"Monitoring Moogle","l":2002,"q":1}},{"type":"npc","id":"1017469","obj":{"i":1017469,"n":"Monitoring Moogle","l":2002,"q":1}},{"type":"npc","id":"1017470","obj":{"i":1017470,"n":"Dextrous Dragonet","l":2002,"q":5}},{"type":"item","id":"21080","obj":{"i":21080,"n":"Carved Kupo Nut","l":1,"c":65057,"t":100}}]}