{"quest":{"name":"A Crystalline Solution","location":"The Churning Mists","id":67859,"patch":3.3,"sort":4,"icon":100551,"beast":8,"unlocksFunction":1,"eventIcon":71341,"issuer":1017169,"target":1017169,"involved":[1017170,1017173,1017432,1017433,1017437,1017438,1017439,1017440,1017441,1017442,1017443,1017444],"genre":48,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Master Mogzin is fiddling with his hammer excitedly.","The repair of Bahrr Lehs is proceeding apace, and the time has come to begin another major project. Tarresson looks eager to share his plan with you.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Your conversation is interrupted by a flustered Ohl Deeh, who explains that you have somehow earned the ire of an ancient dragon by the name of Gullinbursti. The dragon, through Ohl Deeh, has demanded that you cease your work on Bahrr Lehs and leave at once. Sensing that there may be some hope of reconciliation, Tarresson decides that the best course of action is to meet with Gullinbursti and explain the situation. He asks you and Mogzin to accompany him, and follows Ohl Deeh to the ancient dragon's location.","Gullinbursti is menacing at first, but after Tarresson explains the nature of the moogles' obligation, the dragon permits you a chance to prove your worth. Gullinbursti orders the fountain which once stood in the center of Bahrr Lehs to be rebuilt. Both Mogzin and Tarresson seem unperturbed by this seemingly impossible request, and return to Bahrr Lehs to discuss the best way of fulfilling it.","Neither Mogzin nor Ohl Deeh know of any way to transport water to the barren land, and Tarresson is unfamiliar with the region. Although the situation seems hopeless, you recall that the knights of Camp Cloudtop use spring crystals to keep their water supplies stocked. As luck would have it, Ohl Deeh comments that he has seen a crystal which he suspects might be the very type you seek. The young dragon and Mogzin depart for Weston Waters, and Tarresson asks you to follow them, that you might offer your opinion on the crystal's quality.","While Weston Waters is indeed home to a spring crystal, this particular one is too weak to be used as a water source. Ohl Deeh does not look unsettled by this fact, however. Perhaps he has some knowledge that you do not.","According to Ohl Deeh, the roar of a dragon can strengthen the elemental aspect of a crystal. However, as it is still some years until Ohl Deeh's roar becomes powerful enough, he suggests asking his brother for help once again.","Whei Ahf readily agrees to help with such a trivial matter. He instructs Ohl Deeh to stay behind should you two become separated, and prepares to set off to Weston Waters.<br><br>※Speak with Ohl Deeh in Zenith to mount Whei Ahf.","The dragon's roar echoes across Weston Waters, and the spring crystal comes alive, water gushing from its surface. Mogzin breaks off the largest shards he can manage, and departs for Zenith to show Gullinbursti the ingenious solution to his problem.","Gullinbursti is impressed that you were able to make use of a crystal, and acknowledges that this work may have worth after all. He will not interfere in the repair of Bahrr Lehs, on the condition that the statue that once stood as a monument to friendship and peace is rebuilt. Fail, and he will raze Bahrr Lehs to the ground once more. Mogzin is unperturbed by this threat, and promises Gullinbursti that before long the statue will stand as gloriously as it did before.","The moogles have received their first commission as professional crafters, and Mogzin is eager to begin. The Mogmenders set to work on the fountain, which will become the new centerpiece of the once desolate Bahrr Lehs."],"objectives":["Speak with Tarresson. ","Speak with Gullinbursti in Zenith.","Speak with Tarresson.","Investigate the spring crystal at Weston Waters.","Speak with Ohl Deeh.","Speak with Whei Ahf at Zenith.","Ride Whei Ahf and use his Roar ability to awaken the spring crystal.","Speak with Gullinbursti at Zenith.","Speak with Master Mogzin."],"dialogue":[{"name":"MOGZIN","text":"<span class=\"highlight\">Forename</span>, I thought that was you! Tarresson has decided where next to focus our efforts, kupo!"},{"name":"MOGZIN","text":"My paws are itching for more work, and Tarresson's next idea sounds like the most challenging yet!"},{"name":"TARRESSON","text":"Thanks to the efforts of Whei Ahf, Bahrr Lehs is now well fortified against any ne'er-do-wells who might wish to deface it. Well, that's what I would say if there was aught in it to deface! I believe now is the most opportune time to start the core of our─"},{"name":"OHLDEEH","text":"(-???-)Mogzin, Tarresson, <span class=\"highlight\">Forename</span>! Gullinbursti, he...&lt;huff&gt; &lt;puff&gt;...he has spoken, and he is livid!"},{"name":"TARRESSON","text":"Ohl Deeh, my friend, calm yourself. What matter do you speak of? Who is this Gullinbursti?"},{"name":"OHLDEEH","text":"He's an ancient dragon, more ancient than most. In passing he asked after the Mogmenders, and became enraged when I told him of your work here. He demanded I tell you to cease at once! I thought he was only curious, I swear! Please don't be cross with me!"},{"name":"TARRESSON","text":"&lt;sigh&gt; Just when things were going so well. Still, I suppose we can count it as a blessing that he did not drive us away by force. Doubtless he is capable. Perhaps the fact he has not means there is yet hope for reconciliation."},{"name":"TARRESSON","text":"Let us parley with Gullinbursti, if for no other reason than to make it clear that we bear no ill will towards him. <span class=\"highlight\">Forename</span>, Mogzin, I would ask that you accompany me. Ohl Deeh, pray deliver us to where this ancient dragon resides."},{"name":"OHLDEEH","text":"Certainly! Hopefully Gullinbursti will listen to reason. With luck, hopefully we can put this incident behind us soon enough."},{"name":"MOGZIN","text":"For the life of me, I cannot fathom a reason any dragons would be angry with us... Well, I suppose there was that one time I stuck a stone up a dragon's nostril. He was sleeping so deeply, I couldn't resist! You'd do the same, I'm sure."},{"name":"TARRESSON","text":"So this is Gullinbursti? Indeed, he has an air of wisdom about him. Much the same as yours truly, I would like to think."},{"name":"OHLDEEH","text":"Here we are! I'd suggest going before Gullinbursti with a measure of humility. He has no patience for arrogance."},{"name":"COLORDRAGON","text":"So you are the children of man who seek to undo my efforts to keep Bahrr Lehs forgotten? Enough. Cease this affront, and return from whence you came."},{"name":"TARRESSON","text":"Merciful Gullinbursti, I fear this is a dreadful misunderstanding. It is not by our own volition that we endeavor to repair the plaza. No, we are here at the behest of the moogles, and in fact our role is merely to teach them of stonemasonry. Naught more."},{"name":"TARRESSON","text":"As you are doubtless aware, the moogles are bound by an ancient accord with Hraesvelgr to guard and maintain Zenith. As it happens, several of Hraesvelgr's own brood are even now lifting stones in a show of support. Forgive me my boldness, but do you mean to put a stop to such efforts?"},{"name":"COLORDRAGON","text":"Bold indeed. You are right. I cannot oppose the will of Hraesvelgr. <span class=\"emphasis\">If</span> there is truth in your words."},{"name":"MOGZIN","text":"It's true, kupo! If you require proof, just visit the plaza yourself! And you only need to ask Hraesvelgr about the covenant we share!"},{"name":"TARRESSON","text":"My dear Mogzin, pray let me handle this matter. We must tread carefully; I would very much like to leave this parley without any singed hairs."},{"name":"TARRESSON","text":"Mighty Gullinbursti, I believe a dragon of your strength would have no difficulty driving us from the plaza and razing it to the ground. But I also believe you are wise. Too wise to act rashly, without knowledge of our intentions or our sincerity."},{"name":"COLORDRAGON","text":"Perhaps. If you would prove your worth, then so be it. Restore the splendor of ages past to Bahrr Lehs, and I shall oppose you no longer."},{"name":"MOGZIN","text":"That's it? We're already well on our way, kupo! Rest assured Bahrr Lehs will be restored in no time!"},{"name":"COLORDRAGON","text":"Will it? Long ago, the plaza held a fountain, from which flowed an unending stream. To build such a thing now would be an impossible feat."},{"name":"TARRESSON","text":"I would expect no less than to be tasked with the impossible. To construct a fountain on barren land seems an unsolvable riddle! Do not fear, however, for we will find a way, as we have many times before. Won't we, Mogzin?"},{"name":"MOGZIN","text":"Naturally, kupo! We'll show you the worth of the Mogmenders!"},{"name":"TARRESSON","text":"Excellent! Well then, my dear Gullinbursti, we shall set to work at once! In the meantime, I trust you will see fit to allow our repairs to resume unimpeded."},{"name":"COLORDRAGON","text":"Very well, child of man. I shall tolerate your presence for the time being."},{"name":"MOGZIN","text":"We'll find a way to get water, I'm sure of it, kupo!!"},{"name":"OHLDEEH","text":"I've never seen someone stand so fearlessly against Gullinbursti, not even Brother! With age comes a sharp wit!"},{"name":"COLORDRAGON","text":"Why do you remain? You will have no help from me. For now, I shall wait."},{"name":"TARRESSON","text":"While not the ideal outcome, there is naught for it but to turn our attention to the task at hand. Not only must we build a fountain, but we must also secure a source of water."},{"name":"TARRESSON","text":"Gullinbursti is well aware of the fact that we are surrounded by dust and wind-worn brick, which is why he expects us to fail. But we shall prove him wrong!"},{"name":"TARRESSON","text":"It would be best to first seek the wisdom of those most familiar with the land. Tell me, Mogzin and Ohl Deeh─how do you go about securing water for your peoples?"},{"name":"MOGZIN","text":"Truth be told, I've never thought too deeply about it, kupo. If our throats are dry, or if the flowers are drooping, we just go to the springs north of Moghome."},{"name":"OHLDEEH","text":"When we wish to wash the dirt from my scales, we tumble into the nearest cloud, and when our throats are parched, we slake our thirst with the blood of our prey."},{"name":"TARRESSON","text":"Hmmm, the springs of Moghome are entirely too far away, and somehow I doubt a fountain of blood is what Gullinbursti has in mind. How about you, <span class=\"highlight\">Forename</span>? Any ideas?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Perhaps we could make use of a spring crystal?"},{"name":"A1","text":"Why search for a water source when we could make one?"},{"name":"TARRESSON","text":"Spring crystals? The name rings familiar... Ah, now I remember! Crystals wet to the touch, yes? If I recall correctly, they are harvested in quantity from the Sea of Clouds, and are used to keep the barrels of Camp Cloudtop filled to the brim."},{"name":"TARRESSON","text":"Make one? But how would we─<br>Ah hah! <span class=\"highlight\">Forename</span>, my <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>, I could kiss you! Of course, the Rose Knights of Camp Cloudtop. They keep their stores of water plentiful with the spring crystals found in abundance throughout the Sea of Clouds."},{"name":"OHLDEEH","text":"Such an ingenious solution! Gullinbursti may be stubborn, but even he should be impressed."},{"name":"TARRESSON","text":"I believe he would, my dear Ohl Deeh. That settles it then: we must procure spring crystals. Of course, it would be preferable if we did not have to travel all the way to the Sea of Clouds. Can they be found near here?"},{"name":"OHLDEEH","text":"We are in luck, because I often fly over a crystal that seems to have water trickling from its surface. I have a suspicion this might be one of these spring crystals you speak of."},{"name":"MOGZIN","text":"All that's left is to gather them, then! Ohl Deeh, show me where they are, and I'll bring back as many as I can carry. Gullinbursti will know our worth, kupo!"},{"name":"TARRESSON","text":"Well, I cannot deny Mogzin's enthusiasm. However, neither he nor Ohl Deeh have actually seen a spring crystal up close, and it would be a shame if what they brought back was unusable. Follow them, so you might judge the crystal's quality."},{"name":"MOGZIN","text":"Oh, <span class=\"highlight\">Forename</span>, I didn't know you were following us, kupo! Look, there's water trickling from this crystal. Surely this is what we seek, yes?"},{"name":"OHLDEEH","text":"Here it is! Now, all we have to do is carry it back with us. Luckily there are three of us, so that should prove no difficulty!"},{"name":"TARRESSON","text":"While I trust Mogzin and Ohl Deeh, I gather you are more qualified to judge the quality of any spring crystals you may find. Follow them, and bring back any crystals you deem suitable."},{"name":"SYSTEM","text":"Water trickles forth from the crystal in thin rivulets, each running dry before reaching its base. It seems there is little hope that this can be used as a supply for the fountain."},{"name":"SYSTEM","text":"Water trickles forth from the crystal in thin rivulets, each running dry before reaching its base. It seems there is little hope that this can be used as a supply for the fountain."},{"name":"OHLDEEH","text":"From the skies, I could not tell that this crystal was so dry. But worry not, for you are in the company of a dragon!"},{"name":"OHLDEEH","text":"When I unleash my mighty roar, this crystal will awaken, and water will gush forth from it like a geyser!"},{"name":"OHLDEEH","text":"I simply need some time to gather my strength. One century should do the trick. Brother was around that age when he learned to roar."},{"name":"OHLDEEH","text":"You cannot wait even <span class=\"emphasis\">one</span> hundred years!? I pity you, truly. Well, I suppose we must ask Brother for his help again. I am certain this time we can skip the trial."},{"name":"MOGZIN","text":"So you're going back to Zenith? I'll wait here and protect the crystal from thieves and monsters, kupo."},{"name":"OHLDEEH","text":"<span class=\"highlight\">Forename</span>, welcome! I have already explained everything to Brother!"},{"name":"WHEIAHF","text":"Well met. My brother tells me you wish to borrow my strength again."},{"name":"WHEIAHF","text":"You mean to awaken a crystal? A simple matter. Very well, you have my wings."},{"name":"WHEIAHF","text":"Climb atop my back, and guide me to this crystal. Ohl Deeh, you stay behind. <span class=\"highlight\">Forename</span>, if we should become separated, return here and my brother shall summon me."},{"name":"OHLDEEH","text":"Not used to riding dragons, are you? It is a good thing Brother was clever enough to have me remain here, then. Wait here and I'll call him."},{"name":"SYSTEM","text":"The thin streams of water leaking from the crystal look as if they will dry up at any moment. Speak with Ohl Deeh to ride Whei Ahf, and use his Roar ability to awaken the spring crystal."},{"name":"MOGZIN","text":"Look! The water is spouting forth, kupo! This crystal will make the perfect source for our fountain. Now, we just need to break off a few shards..."},{"name":"MOGZIN","text":"(-Whei Ahf-)I am relieved. I could have just as easily shattered the crystal by mistake. Fortunately, I did not."},{"name":"MOGZIN","text":"I've gathered the largest shards I could find! Now let us be off to Zenith, and we'll show Gullinbursti that Bahrr Lehs will shine once more!"},{"name":"MOGZIN","text":"Gullinbursti will have no choice but to let us build in Bahrr Lehs now, kupo!"},{"name":"TARRESSON","text":"Mogzin has already gone to speak with Gullinbursti? Ah, it is good to see him taking the initiative. I daresay he can manage this on his own, but of course if you were by his side it would put my mind at ease."},{"name":"OHLDEEH","text":"Have you ever seen a spring crystal so vibrant? I knew Brother could do it!"},{"name":"MOGZIN","text":"Gullinbursti, we've done it! The fountain in Bahrr Lehs will flow as gloriously as before, kupo!"},{"name":"COLORDRAGON","text":"So, you have secured a water source?"},{"name":"MOGZIN","text":"It was a team effort, kupo! <span class=\"highlight\">Forename</span> suggested we use spring crystals, and Ohl Deeh told us where to find one. We've gathered more than enough shards to keep the fountain flowing indefinitely!"},{"name":"COLORDRAGON","text":"I know of these crystals. But do not attempt to deceive me. There are none with the strength of which you speak."},{"name":"MOGZIN","text":"There <span class=\"emphasis\">were</span> none, kupo! But through will, perseverance, and determination, we were able to find a solution!"},{"name":"COLORDRAGON","text":"Those words... Ah, it is nothing. Proceed, moogle."},{"name":"MOGZIN","text":"With Whei Ahf's mighty roar, we awakened a spring crystal, and now have enough water to make five fountains! Surely our deeds have proven that we are worthy to continue our work."},{"name":"COLORDRAGON","text":"Impressive, little one. However, your story tells only of the deeds of man and dragon. What has <span class=\"emphasis\">your</span> kind contributed?"},{"name":"MOGZIN","text":"There is still much work to be done, and the spring crystal is but one component. From here on out, it's the responsibility of the Mogmenders to see the fountain completed, kupo!"},{"name":"COLORDRAGON","text":"Your words bespeak confidence, and more importantly, sincerity. Very well, you may remain in Bahrr Lehs."},{"name":"COLORDRAGON","text":"On one condition!"},{"name":"COLORDRAGON","text":"Rising from the fountain was once a statue. A monument to friendship and peace. You will see it restored to Bahrr Lehs."},{"name":"MOGZIN","text":"A statue? We've never built something like that. What if it proves beyond our abilities, kupo?"},{"name":"COLORDRAGON","text":"Then I shall make the plaza dust and rubble once more."},{"name":"COLORDRAGON","text":"Well, it appears we have no choice but to succeed, then! Gullinbursti, the statue we raise will be even better than you remember, I promise!"},{"name":"COLORDRAGON","text":"There is something unique about that one. Do you not agree?"},{"name":"TARRESSON","text":"Mogzin looks in even higher spirits than usual. I take it your meeting with Gullinbursti went well, then?"},{"name":"OHLDEEH","text":"Mogzin and I used to spend our days hiding in imaginary palaces within the rubble. And now his imagination is coming to life! He has come quite far, I must say."},{"name":"COLORDRAGON","text":"What can be wrought by the hands of man, moogle, and dragon? I am eager to see."},{"name":"MOGZIN","text":"A monument to friendship and peace, and our latest challenge, kupo! I suppose we can consider this the Mogmenders' first commission! I must admit I'm a bit nervous─our reputation is at stake!"},{"name":"TARRESSON","text":"So the dragon has requested further work be done to the plaza? Mogzin, I have no doubt you and the Mogmenders shall rise to this challenge as you have risen to many others. Remember the wisdom I have tried to impart to you!"},{"name":"COLORDRAGON","text":"I won't disappoint you, Tarresson! Even if it looks like there is no way forward, I'll find one! Now, let's begin work on the fountain!"},{"name":"SYSTEM","text":"Thanks to your efforts, the fountain of Bahrr Lehs has been restored. Continue assisting the Mogmenders to see repair of the plaza completed."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Mogmenders."},{"name":"SYSTEM","text":"New moogle tribal daily quests are now available from Mogek the Marvelous at the plaza."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon the completion of the moogle tribal daily quests."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Mogek the Marvelous as a reputation rank bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Mogek the Marvelous. Please be advised that you cannot undertake these quests if you have no remaining allowances."}],"reward":{"gil":936,"items":[{"id":5688,"one":1},{"id":5698,"one":1},{"id":5703,"one":1}]},"reqs":{"beastrank":3,"jobs":[{"lvl":50,"id":33}],"quests":[67858]},"next":[67860]},"partials":[{"type":"npc","id":"1017169","obj":{"i":1017169,"n":"Master Mogzin","l":2002,"q":4}},{"type":"npc","id":"1017170","obj":{"i":1017170,"n":"Tarresson","l":2002,"q":9}},{"type":"npc","id":"1017173","obj":{"i":1017173,"n":"Ohl Deeh","l":2002,"q":5}},{"type":"npc","id":"1017432","obj":{"i":1017432,"n":"Whei Ahf","l":2002,"q":2}},{"type":"npc","id":"1017433","obj":{"i":1017433,"n":"Ohl Deeh","l":2002,"q":2}},{"type":"npc","id":"1017437","obj":{"i":1017437,"n":"Gullinbursti","l":2002,"q":1}},{"type":"npc","id":"1017438","obj":{"i":1017438,"n":"Tarresson","l":2002,"q":1}},{"type":"npc","id":"1017439","obj":{"i":1017439,"n":"Ohl Deeh","l":2002,"q":1}},{"type":"npc","id":"1017440","obj":{"i":1017440,"n":"Master Mogzin","l":2002,"q":1}},{"type":"npc","id":"1017441","obj":{"i":1017441,"n":"Ohl Deeh","l":2002,"q":1}},{"type":"npc","id":"1017442","obj":{"i":1017442,"n":"Ohl Deeh","l":2002,"q":1}},{"type":"npc","id":"1017443","obj":{"i":1017443,"n":"Master Mogzin","l":2002,"q":1}},{"type":"npc","id":"1017444","obj":{"i":1017444,"n":"Master Mogzin","l":2002,"q":1}},{"type":"item","id":"5688","obj":{"i":5688,"n":"Gatherer's Guerdon Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Gathering","category":2}}},{"type":"item","id":"5698","obj":{"i":5698,"n":"Gatherer's Grasp Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":6,"attr":"GP","category":2}}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"quest","id":"67858","obj":{"i":67858,"n":"Trying Times","g":48,"l":"The Churning Mists","s":3,"f":1}},{"type":"quest","id":"67860","obj":{"i":67860,"n":"The Tools Make the Moogle","g":48,"l":"The Churning Mists","s":5,"f":1}}]}