{"quest":{"name":"Tricks and Stones","location":"The Churning Mists","id":67856,"patch":3.3,"sort":1,"icon":100548,"beast":8,"unlocksFunction":1,"eventIcon":71341,"issuer":1017328,"target":1017335,"involved":[1012163,1012181,1017329,1017330,1017331,1017332,1017333,1017334,1017336,1017337],"genre":48,"usedItems":[15746,15720],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The seething stonemason is shouting obscenities into the wind.","On the outskirts of Moghome, you cross paths with a visibly agitated stonemason. He is grateful to speak with someone who stands on two legs, and explains he was dispatched to Moghome by the Temple Knights to teach its denizens stonemasonry, only to be sent on a journey of tedious chores and pointless errands upon his arrival. Eager to return home and never see another pom-pom again, the stonemason asks you to inform Mogkul of his immediate resignation.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Mogkul is disappointed but not surprised in the least by your news. He confesses that this is the ninth time an Ishgardian craftsman has been driven from the Churning Mists by the moogles' antics. Fearing that Ser Handeloup may come to regret the arrangement between Moghome and Ishgard, Mogkul asks you to accompany him to the Congregation so he might offer his sincerest apologies in person.","Mogkul apologizes to Ser Handeloup for the actions of his kin, but while the commander is willing to forgive and forget, he explains that Ishgard can spare no more stonemasons. As if on cue, an elderly male addressed only as Lord Tarresson enters the Congregation. Apparently, the nine stonemasons sent to Moghome were his own pupils, and for the honor of his house and his profession he says he will bear the burden of helping the moogles. He worries that his aged body and mind cannot attempt the task alone, however, and persuades you to lend him your aid. Heartened by your agreement, Tarresson immediately instructs Mogkul to gather the moogles involved in Zenith's repair. After Mogkul departs, Tarresson claims he plans to show the moogles some trickery of his own, and bids you follow him to the Jeweled Crozier.","You find Tarresson in the bustling marketplace, a mischievous look on his face. He questions you about the eating habits of the moogles, and once you mention kupo nuts you can see the gears turning in his head. He asks you to make a fake kupo nut, as you are the most familiar with their shape. Use the materials he has given you to make the most appetizing kupo nut you can muster. <br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Mathye.","Tarresson is impressed by your final product, and understands now why moogles have such affection for the nuts. He will remain behind in Ishgard to make more, based on your example, and bids you go to Bahrr Lehs near Zenith and await his arrival.","Bahrr Lehs is little more than dust and rubble, and you arrive to see Tarresson and Mogkul looking over the dismal scene. The Mogmenders are nowhere in sight. Unperturbed by this setback, Tarresson asks Mogkul who among them is most prone to trickery. The moogle reveals that one Mogzin, leader of the Mogmenders, is often the butt of his brethren's jokes. Tarresson, eager to proceed, assures Mogkul that the Mogmenders will be hard at work before long. It seems that Tarresson's plan is soon to come to fruition, and he asks for your assistance in locating Mogzin, who should be somewhere in the nearby palace ruins.","After a thorough search, you and Tarresson come upon a moogle, who is muttering aloud. Surprised by your sudden appearance, the moogle hastily explains that a rare sickness that occurs once in a millennium has washed over Moghome, causing all the moogles' wings to feel as heavy as stones. Tarresson makes a show of sympathy, lamenting the fact that he cannot share his bounty of kupo nuts with the moogles. Mogzin perks up at the mention of the delicacy, and quickly changes his story. It would seem that Mogzin mistook napping moogles for sick ones. Satisfied by this attempt to explain away his lie, Mogzin departs to gather the rest of the Mogmenders, and states they will meet you at Bahrr Lehs.","The Mogmenders await their promised feast in the ruins of Bahrr Lehs, and Tarresson gladly obliges them. He presents them three plump kupo nuts on a silver platter, and the moogles can barely contain themselves at the sight. Mogzin bites into the nearest one, only to find out that it is a fake. Though disappointed, the moogles are quite impressed by Tarresson's deception, some going so far as to say it may be the most elaborate trick in recent memory. With his plan finally at an end, Tarresson makes the moogles an offer. If they pledge to be hardworking students, he will teach them to craft whatever they can imagine. Mogzin agrees to this arrangement with much aplomb, and Tarresson gives the Mogmenders their first project: the restoration of Bahrr Lehs.","With an amicable agreement having been reached, Mogzin formally introduces himself as the leader of the Mogmenders, and reaffirms his resolve to be a diligent pupil and fulfill the moogles' obligation to restore Zenith. He asks if you intend to remain and assist with the rebuilding and the Mogmenders' education, and flits with joy when you say yes. Full of vim and vigor, the moogles set to work. How long their work ethic lasts, however, remains to be seen."],"objectives":["Speak with Mogkul.","Speak with Handeloup at the Congregation of Our Knights Most Heavenly.","Speak with Tarresson at the Jeweled Crozier.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a fake kupo nut</span><span class=\"alternative\">Show the fake kupo nut to Tarresson</span></span>.","Speak with Tarresson at Bahrr Lehs.","Search for Master Mogzin near Zenith.","Speak with Tarresson.","Speak with Master Mogzin."],"dialogue":[{"name":"MASON","text":"Godsdamned moogles! They'd lose their bloody pom-poms if they weren't attached to their heads! “I can't find my nuts, kupo! Find my pebbles, kupo!” You want to know where your pebbles are!? Well I'll tell you, right after I shove them up your bleedin'─"},{"name":"MASON","text":"Oh! You...you're not one of them!? Thank the gods! Finally someone capable of sensible conversation!"},{"name":"MASON","text":"You see, I was sent here at the Temple Knights' behest to teach stonemasonry to these...creatures. However, as soon as I arrived they bombarded me with menial tasks, and before long I found myself traipsing aimlessly across the Churning Mists."},{"name":"MASON","text":"I'll endure it no longer! It's time I bid good riddance to this place and its inhabitants! <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, I'm loath to ask you to suffer such wretched company, but could you inform the one named Mogkul that I shan't be returning? I dare not go myself lest my temper get the best of me!"},{"name":"MOGKUL","text":"Well met, adventurer! The Pomguard remains vigilant as ever! What brings you to Moghome? A sudden craving for kupo nuts?"},{"name":"MOGKUL","text":"Another stonemason has gone home, kupo? &lt;sigh&gt; At least this one bothered to inform me, in a manner of speaking."},{"name":"MOGKUL","text":"I suppose I can't blame him for leaving. He was only trying to help us repair Zenith. They're sent here to survey the area and teach us what they know of working stone."},{"name":"MOGKUL","text":"Alas, the moogles are more concerned with who can concoct the cleverest trick than who can build the sturdiest wall. They don't do it out of malice. It's just an impulse, like breathing or hiding! But the Ishgardians don't view it that way..."},{"name":"MOGKUL","text":"So far, this is the ninth stonemason that's left us. I fear Ser Handeloup may be regretting his decision to help. As a representative of Moghome, I must offer him an apology and an explanation. Adventurer, will you guide me to Ishgard so I might mend this situation?"},{"name":"MOGKUL","text":"What a relief, kupo! I tend to get terribly lost when traveling on my own. I trust your preparations are complete? Excellent, then let us be off!"},{"name":"MOGKUL","text":"Greetings, Ser Handeloup!"},{"name":"HANDELOUP","text":"If it isn't Mogkul and <span class=\"highlight\">Forename</span>! An unexpected visit, but a welcome one, for I had been hoping to speak with you of our stonemasons. Each one has returned within a fortnight, more wroth than the last. They claim the moogles are proving to be less...receptive to their teaching than they had anticipated."},{"name":"MOGKUL","text":"Ser Handeloup, my deepest and most sincere apologies, kupo! The others only meant to make the stonemasons feel welcome by including them in their mischief. They never meant to anger. I swear on my honor as a Pomguard that it will not happen again!"},{"name":"HANDELOUP","text":"Hmmm... For the sake of friendly relations, I'm more than willing to put this misunderstanding behind us and begin anew. Alas, we have already sent you every stonemason we can spare, and I fear there is little hope in convincing any of them to return to Moghome."},{"name":"TARRESSON","text":"(-???-)You haven't sent <span class=\"emphasis\">every</span> stonemason, my dear Handeloup."},{"name":"HANDELOUP","text":"Lord Tarresson!? What...what brings you to the Congregation?"},{"name":"TARRESSON","text":"Let us dispense with the titles, shall we? And surely you can surmise why I am here. Every one of those thin-skinned milksops was a pupil of mine. How would it reflect upon me if I let their negligence bring this project to ruins?"},{"name":"TARRESSON","text":"Besides, this task came to us directly by the Holy See, and failure would result in my family becoming a laughingstock for generations to come. So you see, for both personal and familial honor, I must take up my hammer and succeed where my students have failed."},{"name":"TARRESSON","text":"Alas, I am well past my prime. The hammer weighs heavy in my hand, and my mind dulls with age. Alone, I fear I might fall victim to the clever deceptions of the moogles, or my body might crumble under the stress of so much physical labor. Perhaps with the help of a young, stout adventurer..."},{"name":"TARRESSON","text":"One who has won the respect of the moogles, one who is well versed in their ways. Only with such a partner could this old man possibly hope to keep his honor from being sullied. Do you know any such adventurers, friend? Pray tell me you do..."},{"name":"TARRESSON","text":"What courage! Did you see that, Handeloup? This strapping young <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> put <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> name forward without a second thought! Truly, you have brought solace to this tired old man's heart, my dear <span class=\"highlight\">Forename</span>."},{"name":"MOGKUL","text":"...Kupo? I'm not sure I understand. Are you saying both you <span class=\"emphasis\">and</span> the adventurer will help us?"},{"name":"TARRESSON","text":"Indeed, my furry little friend, you shall be well taken care of! Now, our first order of business should be to gather all who are involved in the restoration. Mogkul, I entrust that task to you. <span class=\"highlight\">Forename</span> and I shall not be far behind."},{"name":"TARRESSON","text":"Before we depart, however, we have some work of our own to complete. You see, I mean to show the moogles that they are not the only ones with a penchant for trickery! Come, meet me at the Jeweled Crozier and we can begin preparations."},{"name":"HANDELOUP","text":"Once again, it would seem our burdens have become yours. My apologies. For what it is worth, the Temple Knights will provide you with any aid you might require."},{"name":"HANDELOUP","text":"For now, I suppose it would be best to follow Tarresson's lead. He is a wise man, although his methods can be somewhat unorthodox at times."},{"name":"MATHYE","text":"So you're here with Lord Tarresson? Rest assured you'll have my full cooperation. I wouldn't dare go against his wishes."},{"name":"TARRESSON","text":"There you are! Before we begin, I would draw upon your knowledge of the moogles. Namely, I wish to know what foods they are partial to, for I believe therein we shall find the means to deceive them."},{"name":"TARRESSON","text":"Hmmm... So their makeshift economy revolves around these kupo nuts? Why, this plan practically crafts itself. Our next course of action is plain, and I believe you are just the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> to rise to the challenge."},{"name":"TARRESSON","text":"For your hands speak volumes that your words do not. They are the hands of a practiced artisan, much like my own! There is no need for humility, my friend, you are among peers. And as your peer, I would be honored to call upon your aid!"},{"name":"TARRESSON","text":"I ask that you craft me a kupo nut. Not a real one, mind you, but a fake which could fool even the most discerning moogle. As I have never laid eyes on a kupo nut myself, I must entrust this task to you. I require only one, which I shall use to make more."},{"name":"TARRESSON","text":"I believe a nut made of steel shall suffice. Firm and sturdy, it will weather the harsh elements during the trip from Ishgard. Here, I believe these materials should prove sufficient."},{"name":"TARRESSON","text":"I believe with judicious use of wood, leather, and cloth, you should be able to craft a fake that perfectly captures the uneven texture of the wild nut. Here, I believe these materials should prove sufficient."},{"name":"TARRESSON","text":"I believe with the proper application of dye and wax you can craft a kupo nut that will both look and feel like the real thing! Here, I believe these materials should prove sufficient."},{"name":"TARRESSON","text":"TEST"},{"name":"TARRESSON","text":"Now, I know full well that even the master has <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> failed attempts, and so have instructed Mathye here to provide you with more materials should you require them."},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Tarresson to craft a fake kupo nut."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Mathye once more to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, open the <span class=\"highlight\">Crafting Log</span> from the main menu, followed by <span class=\"highlight\">Special Recipes</span>. Next, select <span class=\"highlight\">Tribal Quests</span>, then lastly <span class=\"highlight\">Moogle Quests</span> to locate the desired recipe."},{"name":"SYSTEM","text":"If synthesis proves too difficult, you may consider purchasing a better primary tool or gear from Evrardoux or Norlaise in the Jeweled Crozier."},{"name":"MATHYE","text":"If you require more materials to complete your work, just ask. Lord Tarresson has assured me he will take care of all payments."},{"name":"HANDELOUP","text":"Once again, it would seem our burdens have become yours. My apologies. For what it is worth, the Temple Knights will provide you with any aid you might require."},{"name":"TARRESSON","text":"How goes your work, <span class=\"highlight\">Forename</span>? There is no need to rush. I would not want a masterpiece to be marred by a hasty hand."},{"name":"TARRESSON","text":"So this is a kupo nut? Although I am not a moogle, I am certain that if I was, my stomach would be rumbling at the sight. Impressive, considering the meager materials we had on hand."},{"name":"TARRESSON","text":"No doubt you are wondering what I plan to do with this. Do not worry, I would not dare spoil the surprise for you. For now, just know that I intend to make more. It may take some time, so pray go on ahead to the plaza near Zenith. I shall meet you there."},{"name":"HANDELOUP","text":"Tarresson departed for the Churning Mists a short while ago. He said to wait for you in the plaza near the base of Zenith. Pray make your way there as soon as you are ready."},{"name":"MATHYE","text":"Any crafter that has Lord Tarresson's approval has mine as well. If ever you wish to sell your work, return here and I'll be sure to give you a fair price."},{"name":"MOGKUL","text":"Where are Mogzin and the others, kupo?"},{"name":"TARRESSON","text":"Welcome to Bahrr Lehs, <span class=\"highlight\">Forename</span>. Truth be told, this place is in even worse shape than I was led to believe. Well, I suppose even a fortress begins with but a single stone."},{"name":"MOGKUL","text":"My apologies, Lord Tarresson. I urged the Mogmenders to meet us here, but they all claimed to be busy with something or other. It may be a while before they arrive..."},{"name":"TARRESSON","text":"\"Tarresson“ will suffice, my dear Mogkul. And there is no need for apologies. From my understanding, the Mogmenders have laziness in abundance. While we are waiting, answer me one question: who among them is easiest to trick?"},{"name":"MOGKUL","text":"That would be Master Mogzin, without a doubt, kupo. He was put in charge of the Mogmenders on account of his deft paws, but he falls for their tricks more often than not. One time he spent three days playing hide-and-seek while the others gorged on kupo nuts."},{"name":"TARRESSON","text":"Such deviousness! I doubt I can surpass so clever a ploy! Nonetheless, I must try. Mogkul, I believe <span class=\"highlight\">Forename</span> and I can take over the reins from here. We shall have the Mogmenders hard at work ere long."},{"name":"MOGKUL","text":"You mean to outtrick the Mogmenders, kupo? Fascinating, I had no idea you played tricks on each other down below. Of course, I look forward to hearing of your victory! Oh, I do hope he hides his pebbles..."},{"name":"TARRESSON","text":"When building a wall, we are taught that a single ill-placed brick can cause a whole structure to collapse. I believe this Master Mogzin may be our figurative loose brick. Now, let us seek him out. He cannot be far."},{"name":"TARRESSON","text":"Could this be Mogzin? His bandana certainly sets him apart from the others. Listen. Is he muttering to himself?"},{"name":"MOGZIN","text":"Nine...nine stonemasons, kupo. Surely they are praising my cleverness in Ishgard. How should I trick the next one? Oh, I know! A rare sickness which strikes once every hundred years, and causes our pom-poms to─"},{"name":"TARRESSON","text":"Master Mogzin of the Mogmenders, I presume? I am Tarresson, freshly arrived from Ishgard. Forgive me for eavesdropping, but I overheard mention of a sickness. Is there aught I need worry about?"},{"name":"MOGZIN","text":"Y-You're here already!? I mean, er, yes, a terrible, incurable sickness has spread throughout Moghome! One last seen over a thousand years ago! Once afflicted, our wings grow heavier than...than stones! We can do nothing but lie on the ground helpless until it passes."},{"name":"TARRESSON","text":"I see... Such unfortunate timing. Well, I suppose we must postpone our work for now. May you and yours be in good health soon. 'Tis a pity, truly. Whatever shall I do with all these kupo nuts?"},{"name":"MOGZIN","text":"Did you say kupo nuts!? Here? Now!?"},{"name":"TARRESSON","text":"Why, yes. I brought a veritable feast, which I meant to share with the Mogmenders as a gesture of goodwill. Alas, we shall have to wait. A sickness which comes once every thousand years surely requires proper─"},{"name":"MOGZIN","text":"Did I say “sickness!?” Perhaps I was mistaken. Yes, yes, perhaps they weren't sick after all. Just...napping! How embarrassing! Luckily for you, however, that means the rest of the Mogmenders are hale and hearty. I'll summon them, and meet you at Bahrr Lehs forthwith!"},{"name":"TARRESSON","text":"&lt;sigh&gt; By the gods, I was hoping for a bit more sport than that. Perhaps if he said kupo nuts were a miraculous cure to this epidemic, I could have pretended to believe him. Well, what's done is done. Come, let us away to Bahrr Lehs and meet our new companions."},{"name":"MOGMUL","text":"You truly know the way to a moogle's heart: through his stomach! Now, where are those kupo nuts?"},{"name":"MOGEK","text":"I told Master Mogzin his story was unbelievable. If it didn't work the first three times, it won't work the fourth time, I said. Now, I would thank you very much to present <span class=\"emphasis\">me</span> with the kupo nuts, to teach Master Mogzin a valuable lesson in honesty."},{"name":"MOGZIN","text":"Mogek and Mogmul are at the ready, kupo! The others will be here before long, I'm sure!"},{"name":"MOGZIN","text":"As promised, I've gathered my most skilled Mogmenders! Now, I believe there was talk of a feast?"},{"name":"TARRESSON","text":"Indeed, they have the paws of true artisans. Now, for the feast! Let me start off our relationship by offering this bounty to you."},{"name":"MOGZIN","text":"They look so plump and so juicy, kupo! And all this for a little effort. As master of the Mogmenders, I declare first privileges!"},{"name":"MOGZIN","text":"That's...that's not how a kupo nut tastes! It's a fake! How could something that looks so delicious be so disappointing..."},{"name":"TARRESSON","text":"My dear Mogzin, it seems the tables have turned! Indeed, these nuts were wrought by man, not born of nature. Even better than the real thing, yes? Well, besides the taste, of course."},{"name":"MOGZIN","text":"They're <span class=\"emphasis\">all</span> fake? There's not even a real one tucked away inside, kupo? Perhaps we should check once again, just to be sure..."},{"name":"MOGZIN","text":"Hmmm... I daresay these would fool even Chieftain Moglin, and no one has ever been able to trick him! Truly works of art, kupo!"},{"name":"TARRESSON","text":"This is but a small sampling of our capabilities, friends! I have built towers and raised walls that rival the largest in the Churning Mists. Yes, even Zenith!"},{"name":"MOGZIN","text":"You mean...you can make kupo nuts even larger than these? Larger than Zenith!?"},{"name":"TARRESSON","text":"Perhaps I could, if I had the inclination. However, I offer you something better. Pledge your paws to me and I shall teach you how to craft aught you can imagine. Alas, I will make this offer only once. So, what say you?"},{"name":"MOGZIN","text":"Anything we can imagine, kupo? Of course! We swear on our pom-poms to be diligent pupils! Why, I'm ready to start repairing Zenith this very moment!"},{"name":"TARRESSON","text":"That's the spirit I like to see! But we have a long road ahead of us, my moogle menders. Before we start work on the palace proper, I believe we would do well to begin by repairing this very plaza. What you learn here shall form a solid foundation for what is to come."},{"name":"MOGMUL","text":"I know the kupo nuts were fake, but my stomach still rumbles at the thought of them. If I were able to make my own, just imagine the moogles I'd trick."},{"name":"MOGEK","text":"You may have fooled Master Mogzin, but who hasn't? I knew the kupo nuts were fake from the moment I saw them. You'll have to try harder to trick the Mogmenders' most brilliant moogle. Perhaps if you used <span class=\"emphasis\">real</span> kupo nuts next time..."},{"name":"TARRESSON","text":"I daresay we have earned their respect, and all we had to do was play by their rules for a short time. We have achieved what I hope will be the first success of many more to come."},{"name":"MOGZIN","text":"Well, now that things have settled, I do believe formal introductions are in order. I am Mogzin, master of the Mogmenders."},{"name":"MOGZIN","text":"I never knew what a crafter was capable of until I saw those fake kupo nuts. With even a fraction of such skill, I've no doubt that we could restore Zenith to its former glory!"},{"name":"MOGZIN","text":"Still, I can't help but wonder what we could have accomplished had we listened to the other nine stonemasons... Oh well, I suppose there's no use wracking my pom-pom over the past! Besides, you and Tarresson are so much more kind and patient than the others."},{"name":"MOGZIN","text":"You <span class=\"emphasis\">do</span> plan to stay and teach us, right? We'll work every day until our paws are sore and our cheeks are flushed. I promise you that, kupo!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Together we'll rebuild Bahrr Lehs, kupo!"},{"name":"A1","text":"Piss off, kupo."},{"name":"MOGZIN","text":"Truly, kupo? The others will be overjoyed to hear it!"},{"name":"MOGZIN","text":"Mogmenders! Let us go forth, tools in paw, and make Zenith shine once more!"},{"name":"MOGZIN","text":"I...I understand, kupo. For what it's worth, I promise to mend my ways from here on out. If you change your mind, I'll be waiting here."},{"name":"SYSTEM","text":"Thanks to your efforts, the restoration of Bahrr Lehs has begun! Continue assisting the Mogmenders to see repair of the plaza completed."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Neutral</span> reputation with the Mogmenders."},{"name":"SYSTEM","text":"Moogle tribal quests are now available from Mogek the Marvelous in Bahrr Lehs."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from Mogmul Mogbelly."}],"reward":{"gil":1483},"reqs":{"jobs":[{"lvl":50,"id":33}],"questsType":"all","quests":[67170,67407]},"next":[67857]},"partials":[{"type":"npc","id":"1017328","obj":{"i":1017328,"n":"Seething Stonemason","l":2002,"q":1}},{"type":"npc","id":"1017335","obj":{"i":1017335,"n":"Master Mogzin","l":2002,"q":1}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1012181","obj":{"i":1012181,"n":"Mathye","l":2301,"q":6}},{"type":"npc","id":"1017329","obj":{"i":1017329,"n":"Mogkul","l":2002,"q":1}},{"type":"npc","id":"1017330","obj":{"i":1017330,"n":"Tarresson","l":2301,"q":1}},{"type":"npc","id":"1017331","obj":{"i":1017331,"n":"Tarresson","l":2002,"q":1}},{"type":"npc","id":"1017332","obj":{"i":1017332,"n":"Mogkul","l":2002,"q":1}},{"type":"npc","id":"1017333","obj":{"i":1017333,"n":"Tarresson","l":2002,"q":1}},{"type":"npc","id":"1017334","obj":{"i":1017334,"n":"Master Mogzin","l":2002,"q":1}},{"type":"npc","id":"1017336","obj":{"i":1017336,"n":"Mogek The Marvelous","l":2002,"q":1}},{"type":"npc","id":"1017337","obj":{"i":1017337,"n":"Mogmul Mogbelly","l":2002,"q":1}},{"type":"item","id":"15746","obj":{"i":15746,"n":"Fake Kupo Nut Materials","l":55,"c":26001,"t":63}},{"type":"item","id":"15720","obj":{"i":15720,"n":"Fake Kupo Nut","l":55,"c":21012,"t":63}},{"type":"quest","id":"67170","obj":{"i":67170,"n":"Into the Aery","g":3,"l":"Ishgard","s":55}},{"type":"quest","id":"67407","obj":{"i":67407,"n":"Laying the First Brick","g":100,"l":"The Churning Mists","s":5611}},{"type":"quest","id":"67857","obj":{"i":67857,"n":"The Milk of Moogle Kindness","g":48,"l":"The Churning Mists","s":2,"f":1}}]}