{"quest":{"name":"The Tools Make the Moogle","location":"The Churning Mists","id":67860,"patch":3.3,"sort":5,"icon":100552,"beast":8,"unlocksFunction":1,"eventIcon":71341,"issuer":1017169,"target":1017170,"involved":[1017172,1017445,1017446],"genre":48,"usedItems":[15748,15722],"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Master Mogzin is tugging at his pom in frustration.","The Mogmenders are dealing with the latest in what has been a long string of difficulties. It is time once again to put your collective knowledge to work and find a solution to their current problem.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","A shipment of supplies from the Temple Knights is long overdue for arrival, and Mogzin suspects that the moogles in charge of delivery may have hidden them. He takes it upon himself to find the moogles responsible and give them a harsh talking to, and sets off towards Asah. Worried that the crates will be too heavy for the moogle to carry back alone, Tarresson asks you to follow him and assist in the recovery.","You catch up with Mogzin in Asah, and next to him you find a remorseful-looking moogle. Evidently, this is the moogle who hid the supplies, and after a stern lecture from Mogzin he has agreed to reveal their location. Mogzin is determined to handle this matter on his own, although he does give you one crate to deliver to Bahrr Lehs before departing to look for the rest of them.","Tarresson confides in you that the supplies are meant to increase the speed of the Mogmenders' work. After observing that their current tools were unfit for a moogle's small paws, he surmised that wind-aspected tools might be more suitable for the flying animals. Before he produces tools for all the Mogmenders, however, he requires a sample to base the rest on. He enlists your aid in producing a special moogle hammer, and instructs you to bring the crate to Mogmul before beginning your work.","Mogmul gladly accepts the supplies, although you can hear disappointment in his voice at the lack of kupo nuts. However, the hungry moogle remains diligent, and is ready to replenish your materials at any time.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Mogmul Mogbelly.","As Tarresson applies the final touches to the hammer, Mogzin returns to Bahrr Lehs, bearing news that he has found the rest of the supplies. Tarresson then informs Mogzin of the gift you both made, and although the moogle is wary at first, he eventually accepts. With hammer in hand, Mogzin remarks that the difference between this tool and the old ones is like night and day. It would seem Tarresson's intuition was correct, and with these tools the Mogmenders can forge further ahead on the path to mastery."],"objectives":["Speak with Tarresson.","Speak with Mogzin at Asah.","Deliver the crate of supplies to Tarresson.","Deliver the crate of supplies to Mogmul Mogbelly.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a moogle tool component <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Show the moogle tool component <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Tarresson</span></span>."],"dialogue":[{"name":"MOGZIN","text":"I can't believe them, kupo! Of all the times for trickery! Why, if they were here, I'd give them a piece of my─"},{"name":"MOGZIN","text":"Oh, <span class=\"highlight\">Forename</span>! Once again, fate is working against us. Sometimes it seems as though we can't lift even a single brick without something going wrong! Let's all put our poms together, and hopefully we can find a solution!"},{"name":"MOGZIN","text":"I've heard you have plenty of experience with matters of this sort. Perhaps you can lend us your expertise in searching for lost things, kupo!"},{"name":"TARRESSON","text":"Just when I had forgotten how entertaining the moogles' antics could be, this happens. You see, we are expecting a shipment of supplies from the Temple Knights, but their delivery is long overdue. Mogzin here suspects foul play."},{"name":"MOGZIN","text":"That's right, kupo! With the Mogmenders busy at Bahrr Lehs, I asked the moogles at Asah to help transport the supplies. Unfortunately, I fear they may have hid them, or worse. Our only choice is to find the moogles in charge and question them ourselves!"},{"name":"TARRESSON","text":"Give them a good talking to, Mogzin! As the leader of the Mogmenders, you must make it clear that you will not tolerate such trickery! I have faith the supplies will be here at Bahrr Lehs before long."},{"name":"MOGZIN","text":"Of course, Tarresson! I'll give them a scolding they won't soon forget! Perhaps I'll even make them carry the supplies themselves!"},{"name":"TARRESSON","text":"Ah, look at him. Off to rebuke an irresponsible moogle, as a father would a disobedient child. However, as we are expecting a good many crates, another pair of young strapping legs to carry them certainly would not hurt. Go and assist him should he require it."},{"name":"TARRESSON","text":"Mogzin will certainly be grateful for your company when he sees the size of the crates. Besides, it would bring me comfort to know you were by his side."},{"name":"TRANSPORTER","text":"You must be that adventurer who's helping the Mogmenders! I'm terribly sorry for hiding the supplies, kupo. I couldn't help myself. It's like there's some other moogle living inside my pom, and he made me hide them up there, and over there, and down there..."},{"name":"MOGZIN","text":"<span class=\"highlight\">Forename</span>, what're you doing here? Did Tarresson send you to accompany me again?"},{"name":"MOGZIN","text":"He really must learn to let me handle my own affairs, kupo! Look here, I gave this moogle such a verbal thrashing that he's agreed to show me where he hid the supplies, and has even forsaken trickery for good! Completely and utterly contrite, he is!"},{"name":"MOGZIN","text":"Alas, I'd rather not spend my time reprimanding others. There's still so much to be done at Bahrr Lehs. But lately, I've felt that no matter how many hours we labor for, we never get any closer to completion..."},{"name":"MOGZIN","text":"Ah, but worry not, <span class=\"highlight\">Forename</span>! I've no intention of giving up, kupo! One blow at a time, we'll chisel away at Bahrr Lehs until the glory of its past is restored!"},{"name":"MOGZIN","text":"For now, I suppose I should see to the unenviable task of collecting the rest of the supplies. <span class=\"highlight\">Forename</span>, I know much more important matters demand your attention, but could you deliver this crate to Bahrr Lehs? With any luck, we'll see each other again shortly!"},{"name":"MOGZIN","text":"Now, show me where you hid them! Quickly, there's no time to waste, kupo!"},{"name":"TARRESSON","text":"You are returned, and sooner than I expected. Is Mogzin not with you?"},{"name":"TARRESSON","text":"Aye, these are certainly the supplies we ordered. How kind of Mogzin to shoulder the burden of finding the rest. While he is occupied, there is a matter I would like to discuss with you."},{"name":"TARRESSON","text":"As you have doubtless noticed, Mogzin has become an admirable crafter in his own right. In fact, the zeal with which each and every Mogmender approaches their work has been naught short of astonishing. However, despite their best efforts, their progress leaves something to be desired."},{"name":"TARRESSON","text":"Curious as to why, I observed the Mogmenders at work, and one thing that struck me was the feebleness of their blows. Now, this is no fault of the moogles. It is not due to laziness that they strike so lightly. No, I believe the tools are to blame."},{"name":"TARRESSON","text":"The moogles cannot grip their tools firmly, and they do not have our thewy arms. Tools made for us are entirely unsuitable for them. But what if we were to furnish them with tools attuned to their aetheric energy?"},{"name":"TARRESSON","text":"Which brings us to the supplies. With them we shall make wind-aspected tools, which I believe the Mogmenders will be able to swing as mightily as we swing our own tools! I would give you the honor of helping me craft the first one!"},{"name":"TARRESSON","text":"I only ask that you craft a hammer head. I have procured a material known as aurum regis, possessed of superior aetherial conductivity. Use it to make a well-balanced head so the tool is not clumsy in our furry friends' paws."},{"name":"TARRESSON","text":"I ask that you craft a simple, but essential part: a hammer's handle. Ensure that its shape is suited to a moogle's paws. Afterwards, I shall apply a specially made varnish which will enhance the aetherial conductivity of the tool."},{"name":"TARRESSON","text":"I would have you prepare a special varnish, whose unique ingredients shall enhance the aetherial conductivity of the tools, enabling our furry friends to wield them with little effort."},{"name":"TARRESSON","text":"Before you begin, however, bring the crate of supplies to Mogmul. As always, you are free to take whatever you feel is necessary to complete your task."},{"name":"TARRESSON","text":"Well, we had best get to it then. I shall begin work on the remaining parts at once. I look forward to holding the finished product in my hands!"},{"name":"MOGMUL","text":"The others think I have the easiest job in the Mogmenders, but they're wrong! Have you ever flapped your wings in place for hours on end? No? Then you have no idea how hungry it makes you, kupo! But I must do my duty. What supplies do you require this time?"},{"name":"MOGMUL","text":"Ah, so these are the errant supplies? Any kupo nuts? I thought not. In that case, feel free to take anything you need!"},{"name":"MOGMUL","text":"Oh, did you run out of materials? As always, you are welcome to anything you require. Of course, I'll always accept offerings of kupo nuts, as thanks for my service."},{"name":"TARRESSON","text":"Are you finished already? Of course, I expect only the most superb craftsmanship from you."},{"name":"TARRESSON","text":"Ah, yes. This is a masterpiece, of that there can be no doubt! Now, we only need take what I have made and..."},{"name":"TARRESSON","text":"Look, <span class=\"highlight\">Forename</span>, have you ever seen a hammer so mighty, so majestic, so...miniature!? Ah, there is nothing like crafting something so fine with your own hand. Of course, I could not have done it without you, my friend."},{"name":"MOGZIN","text":"<span class=\"highlight\">Forename</span>, Tarresson, I am returned! And with all the missing supplies, no less! &lt;sniff&gt; What's that smell? Have you been crafting?"},{"name":"TARRESSON","text":"Indeed we have, my dear Mogzin! A special present, for our favorite Mogmender. I believe you will be most pleasantly surprised."},{"name":"MOGZIN","text":"Ohhh, I'm not falling for that again! I still remember the taste of disappointment when I bit into those fake kupo nuts! What is it this time, leather cloud mallow?"},{"name":"MOGZIN","text":"<span class=\"highlight\">Forename</span>, you too? Hmmm, perhaps you are telling the truth after all. Very well, show me your present. Just in case, I shall gird my pom for the worst!"},{"name":"MOGZIN","text":"This hammer, it's...different from the others."},{"name":"TARRESSON","text":"Both <span class=\"highlight\">Forename</span> and I poured our hearts and souls into it, so I hope you are able to make good use of it. I believe this hammer─and other tools like it─will bring a marked improvement to the Mogmenders' work. How does it feel, Mogzin?"},{"name":"MOGZIN","text":"It's so light, and fits in my paws perfectly. Were those other tools just for practice? Why, I feel as if I could chip away at stone all day and night, kupo!"},{"name":"TARRESSON","text":"I am full glad to hear that. Truth be told, I know that you and the other Mogmenders were growing frustrated at your lack of progress. With this, I believe you will be able to produce work at the speed and quality I know you are capable of."},{"name":"MOGZIN","text":"I...I apologize. You shouldn't have had to go to such great lengths on our account. Nevertheless, you have my thanks, and the thanks of every single Mogmender!"},{"name":"TARRESSON","text":"That is why we are here, is it not? To teach you and yours all we know, so that one day you might repair Zenith without guidance from a doddering old fool. So, there is no need to thank us, much less apologize. We shall be content to see you produce grand works!"},{"name":"MOGZIN","text":"And so we shall, kupo! I daresay this moment marks a new age for the Mogmenders!"},{"name":"SYSTEM","text":"Thanks to your efforts, the moogles have brand-new tools to work with. Continue assisting the Mogmenders to see repair of Bahrr Lehs completed."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Respected</span> reputation with the Mogmenders."},{"name":"SYSTEM","text":"New moogle tribal daily quests are now available from Mogek the Marvelous at the plaza."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon the completion of the moogle tribal daily quests."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Mogek the Marvelous as a reputation rank bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Mogek the Marvelous. Please be advised that you cannot undertake these quests if you have no remaining allowances."}],"reward":{"gil":574,"items":[{"id":5713,"one":1},{"id":5708,"one":1},{"id":5693,"one":1}]},"reqs":{"beastrank":4,"jobs":[{"lvl":50,"id":33}],"quests":[67859]},"next":[67861]},"partials":[{"type":"npc","id":"1017169","obj":{"i":1017169,"n":"Master Mogzin","l":2002,"q":4}},{"type":"npc","id":"1017170","obj":{"i":1017170,"n":"Tarresson","l":2002,"q":9}},{"type":"npc","id":"1017172","obj":{"i":1017172,"n":"Mogmul Mogbelly","l":2002,"s":4,"q":4,"t":"Craver of Kupo Nuts","r":1,"a":2095,"c":[15.99,28.55]}},{"type":"npc","id":"1017445","obj":{"i":1017445,"n":"Moogle Mailer","l":2002,"q":1}},{"type":"npc","id":"1017446","obj":{"i":1017446,"n":"Master Mogzin","l":2002,"q":1}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5693","obj":{"i":5693,"n":"Gatherer's Guile Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Perception","category":2}}},{"type":"item","id":"15748","obj":{"i":15748,"n":"Moogle Tool Component Materials","l":55,"c":26001,"t":63}},{"type":"item","id":"15722","obj":{"i":15722,"n":"Moogle Tool Component","l":55,"c":21012,"t":63}},{"type":"quest","id":"67859","obj":{"i":67859,"n":"A Crystalline Solution","g":48,"l":"The Churning Mists","s":4,"f":1}},{"type":"quest","id":"67861","obj":{"i":67861,"n":"A Monumental Task","g":48,"l":"The Churning Mists","s":6,"f":1}}]}