{"quest":{"name":"A Dream Fulfilled","location":"Azys Lla","id":67864,"patch":3.3,"sort":6,"repeatable":1,"icon":100547,"unlocksFunction":1,"eventIcon":71342,"issuer":1016135,"target":1016135,"involved":[1017108,1017529],"genre":74,"journal":["Ardashir is lost in thought.<br>※Changing classes or jobs will prevent progress during this quest.","The bond between you and the anima is stronger than ever. Though its development hereafter is but a matter of course, Ardashir believes he can hasten the process. He proposes a short voyage to Idyllshire to meet with an acquaintance, one Ulan. A fellow researcher and enthusiast of Carbuncles, she has devoted her life to the study of arcane entities and methods by which they can be enhanced. He is all but certain her work is the key to unlocking the anima's potential. And with that, you are off to Idyllshire.<br><br>※You may not proceed with a class or job that is different from when you accepted this quest.<br>※Please note this quest cannot be abandoned via the journal. If you wish to abandon the quest, you may do so at any time by speaking with Ardashir.","The focus of Ulan's research, as she tells it, is the use of crystal sand to promote growth in arcane constructs. Normally one must strike a proper balance of elements for the procedure to work, a process which may take weeks or even months. Thankfully, she realizes you are not one to waste time. To that end she suggests the use of umbrite, an umbral-aspected stone that can strip the elements from crystal sand, eliminating the need to finely attune its elemental properties. With that knowledge she bids you gather the crystal sand and umbrite necessary to foster the anima's development to your liking.","Ulan's plan is a success. With the crystal sand lacking any elemental aspects, the anima readily consumes it, reaching new heights of strength. Both you and Ulan are impressed by the results, even more so when the anima insists on consuming greater quantities of the treated crystal sand. Though it is not without risk, Ardashir consents to the request, stating the anima is free to make its own choices. He suspects this will also require a new weapon better suited to the anima's burgeoning strength. As a preemptive measure, he returns to Azys Lla to make preparations with Gerolt. His suspicions are soon confirmed when, after several applications of crystal sand, the anima appears before you whimpering and in pain. Ulan bids you meet with Ardashir and see what can be done to help.","You arrive at Azys Lla to find Ardashir and Gerolt ready with a freshly forged weapon to house the anima's soulstone. After verifying the stone is still in one piece, they carefully transplant it into a new vessel. You raise the weapon high, admiring its beauty, when suddenly the anima appears before you. And at last, after years of research and countless failures, Ardashir is able to behold the anima in all its splendor. His dream finally realized, the fledgling researcher must now set his sights higher in his pursuits of cultivating artificial life.<br><br>※ The attributes of the anima weapon can be reallocated by speaking with Ulan in Idyllshire."],"objectives":["With <span class=\"alternative-container\"><span class=\"alternative\">Hyperconductive Almace and Hyperconductive Ancile</span><span class=\"alternative\">Hyperconductive Verethragna</span><span class=\"alternative\">Hyperconductive Ukonvasara</span><span class=\"alternative\">Hyperconductive Rhongomiant</span><span class=\"alternative\">Hyperconductive Gandiva</span><span class=\"alternative\">Hyperconductive Majestas</span><span class=\"alternative\">Hyperconductive Hvergelmir</span><span class=\"alternative\">Hyperconductive Draconomicon</span><span class=\"alternative\">Hyperconductive Tetrabiblos</span><span class=\"alternative\">Hyperconductive Kannagi</span><span class=\"alternative\">Hyperconductive Armageddon</span><span class=\"alternative\">Hyperconductive Nothung</span><span class=\"alternative\">Hyperconductive Deneb</span></span> equipped or in your inventory, speak with Ulan in Idyllshire.","With <span class=\"alternative-container\"><span class=\"alternative\">Hyperconductive Almace and Hyperconductive Ancile</span><span class=\"alternative\">Hyperconductive Verethragna</span><span class=\"alternative\">Hyperconductive Ukonvasara</span><span class=\"alternative\">Hyperconductive Rhongomiant</span><span class=\"alternative\">Hyperconductive Gandiva</span><span class=\"alternative\">Hyperconductive Majestas</span><span class=\"alternative\">Hyperconductive Hvergelmir</span><span class=\"alternative\">Hyperconductive Draconomicon</span><span class=\"alternative\">Hyperconductive Tetrabiblos</span><span class=\"alternative\">Hyperconductive Kannagi</span><span class=\"alternative\">Hyperconductive Armageddon</span><span class=\"alternative\">Hyperconductive Nothung</span><span class=\"alternative\">Hyperconductive Deneb</span></span> equipped, speak with Ulan to strengthen the anima.","With <span class=\"alternative-container\"><span class=\"alternative\">Hyperconductive Almace and Hyperconductive Ancile</span><span class=\"alternative\">Hyperconductive Verethragna</span><span class=\"alternative\">Hyperconductive Ukonvasara</span><span class=\"alternative\">Hyperconductive Rhongomiant</span><span class=\"alternative\">Hyperconductive Gandiva</span><span class=\"alternative\">Hyperconductive Majestas</span><span class=\"alternative\">Hyperconductive Hvergelmir</span><span class=\"alternative\">Hyperconductive Draconomicon</span><span class=\"alternative\">Hyperconductive Tetrabiblos</span><span class=\"alternative\">Hyperconductive Kannagi</span><span class=\"alternative\">Hyperconductive Armageddon</span><span class=\"alternative\">Hyperconductive Nothung</span><span class=\"alternative\">Hyperconductive Deneb</span></span> in your inventory, speak with Ardashir in Azys Lla."],"dialogue":[{"name":"SYSTEM","text":"Please note that upon completing the quest “A Dream Fulfilled,” you will receive an anima weapon for <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Undertake this quest as another job."},{"name":"A2","text":"Undertake this quest as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Be advised that once you have undertaken this quest, you may not proceed with a class or job that is different from when you accepted it."},{"name":"SYSTEM","text":"Please ensure that you have changed to your desired job before speaking with Ardashir."},{"name":"SYSTEM","text":"In order to receive the quest “A Dream Fulfilled,” please ensure that [Error] and [Error] are either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"In order to receive the quest “A Dream Fulfilled,” please ensure that [Error] is either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"You have already received [Error] and [Error]. Please change to a different job and speak with Ardashir again."},{"name":"SYSTEM","text":"You have already received [Error]. Please change to a different job and speak with Ardashir again."},{"name":"ARDASHIR","text":"Hmmm..."},{"name":"GEROLT","text":"Save yer breath <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. He's been sittin' there broodin' ever since ye left. “Surely,” I said. “Surely, if we just leave <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> be, swingin' the weapon about as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> please, the anima'll grow on its own.”"},{"name":"GEROLT","text":"'Course there's no satisfyin' him. I dunno what's stirrin' in that loaf o' his, but I wish he'd pay a mind to stirrin's elsewhere. The boy could use a distraction. Hells, I could make use of a nice buxom distraction meself."},{"name":"ARDASHIR","text":"For the last time, please do not speak of such things! Not everyone shares your deplorable appetites."},{"name":"ARDASHIR","text":"&lt;sigh&gt; But what you say of the anima weapon is true. In its hyperconductive state, 'tis only a matter of time before the anima shows new signs of growth. Yet what sort of researcher would I be if I did not search for a way to hasten the process?"},{"name":"GEROLT","text":"Always so serious. So the little lord's found a way to bugger us some more, eh?"},{"name":"ARDASHIR","text":"Indeed I have, though it will require a trip to Idyllshire. My quest to find Sharlayan researchers there bore no fruit, but I did meet with a young lady whose field of expertise is quite similar to mine own."},{"name":"ARDASHIR","text":"Her name is Ulan. She has a vast knowledge of arcane entities, and specializes in the study of Carbuncles. In fact, her research concerns the enhancement of these entities with crystals. While not quite as freethinking as <span class=\"highlight\">Forename</span>'s anima, they are of a similar nature. Perhaps enough for her work to be of use."},{"name":"ARDASHIR","text":"When last we spoke, she sought an apprenticeship from the selfsame Sharlayan researchers who refused me an audience. No doubt they have left her waiting in Idyllshire even now."},{"name":"ARDASHIR","text":"Come, <span class=\"highlight\">Forename</span>. Let us be off before she finds reason to conduct her research elsewhere."},{"name":"ARDASHIR","text":"Ready to enhance another fledgling anima, are we? I am sure Ulan would be only too happy to put her research to further use. In fact, I spoke with her not long ago regarding the prospects of another venture."},{"name":"ARDASHIR","text":"No doubt she will insist on more supplementary literature as compensation for her efforts. Pray go on ahead to Idyllshire without me. I shall join you anon."},{"name":"SYSTEM","text":"The quest “A Dream Fulfilled” cannot be abandoned via your journal. If you wish to abandon the quest, you may do so at any time by speaking with Ardashir."},{"name":"ARNOTT","text":"What business do you have with Lady Ulan?"},{"name":"ARNOTT","text":"Ah, good day to you <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Lady Ulan is expecting you."},{"name":"ULAN","text":"What have we here? An admirer of the arcane? A connoisseur of Carbuncles? I have none for sale, mind you, but I would be more than willing to tell you about─"},{"name":"ULAN","text":"Ardashir? Pray forgive me, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Had I known you were an acquaintance of his... Ahem. Allow me to start anew."},{"name":"ULAN","text":"<span class=\"highlight\">Forename</span>, was it? I am Ulan, researcher of all matters arcane. Pleasure to make your acquaintance. My luminous companion here is Diamond. Now exactly how did you come to know my dear Ardashir?"},{"name":"ARDASHIR","text":"Ah, it would appear I have come late. My apologies."},{"name":"ARDASHIR","text":"I see you and <span class=\"highlight\">Forename</span> have already met. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has been of invaluable assistance in my research on anima."},{"name":"ULAN","text":"I see. Before you left Idyllshire you spoke of your preliminary proposal for the Sharlayans. I would very much like to hear how your work has progressed thus far."},{"name":"ULAN","text":"You wish to borrow my techniques for crystal absorption and apply them to your anima? An intriguing idea."},{"name":"ULAN","text":"Though there still remains one rather large obstacle."},{"name":"ULAN","text":"Arcane entities like Diamond here are comprised almost entirely of aether, which is why I believe that the aetherial energy of crystals can be harnessed to further their growth. This is the basis of my research."},{"name":"ULAN","text":"This can only be accomplished, however, using crystals with a combination of differing elemental aspects. All arcane beings are unique, and thus require a balance of crystals tailored to their composition. Even the slightest error can disrupt their aetherial equilibrium, possibly destroying them in the process."},{"name":"ULAN","text":"It is rather delicate work. To undertake such a project on your own could take weeks, even months without intimate knowledge of my research."},{"name":"ULAN","text":"Unless... Perhaps we can help one another."},{"name":"ULAN","text":"Being a researcher yourself, I have no doubt you understand my work requires a great deal of documentation, supplies, and more importantly, test subjects."},{"name":"ULAN","text":"I might be persuaded to select your anima as a test subject should you and your companion choose to assist me. Or if you would rather spend weeks poring over my notes..."},{"name":"ARDASHIR","text":"N-No, no. I think that is more than fair."},{"name":"ULAN","text":"Then we are agreed. You will supply me with literature to supplement my research, and your assistant here will bring me supplies. Here is a list of what I require."},{"name":"ARDASHIR","text":"It seems we have our work cut out for us, friend. I shall return as quickly as I am able."},{"name":"ULAN","text":"&lt;sigh&gt; Was time together with me truly such an unpleasant proposition?"},{"name":"ULAN","text":"Now where were we? Ah yes, supplies for my work. I will not burden you with all that I have listed there. Even one of those items would be a boon."},{"name":"ULAN","text":"In exchange I will offer you crystal sand, a reagent of my own creation that should help facilitate the absorption of crystal energies. The process will no doubt require a great deal of sand, but I will happily give all that you require."},{"name":"ULAN","text":"Be warned, however, you cannot haphazardly apply the sand as you please. Hmmm... I believe a demonstration would sooner explain my point. Would you be so kind as to call forth this anima of yours?"},{"name":"ULAN","text":"My, what a splendid thing you are."},{"name":"ULAN","text":"You seem surprised that I can see it. Come now, <span class=\"highlight\">Forename</span>. I have devoted my life to the study of arcane creatures of all sorts. As Ardashir explained it, the two of you have gone to great lengths to come this far. That I should be <span class=\"emphasis\">unable</span> to see it would be far more surprising."},{"name":"ULAN","text":"Now, come closer, little one. I have a gift for you."},{"name":"BUKINOSEIREI","text":"<span class=\"highlight\">Forename</span>, this woman...means us harm. I can feel myself...fading... We must flee!"},{"name":"BUKINOSEIREI","text":"<span class=\"highlight\">Forename</span>, this woman...means us harm. My body, it...it fades... We must flee!"},{"name":"ULAN","text":"My apologies. I did not mean to frighten it. Though I must say, your anima is more perceptive than I supposed. As I said before, every arcane creature is unique, and requires a certain balance of elements to absorb crystal sand. This sand, however, is at odds with its composition."},{"name":"ULAN","text":"Rather than waste time probing your anima to ascertain a proper balance of elements, I propose we treat the crystal sand with umbrite, stripping it of its elemental properties. This is by far the safest and quickest way to prepare the sand for consumption."},{"name":"ULAN","text":"As luck would have it, I found a merchant right here in Idyllshire who sells it. Hismena, I believe is her name. A single stone and pouch of crystal sand is all we need to begin."},{"name":"ULAN","text":"Ah, before I forget. You will need to have the anima's vessel close at hand when offering up the crystal sand. You mustn't forget it."},{"name":"ULAN","text":"I suppose this will also be of use. For your purposes, let us call it an anima glass. It allows me to more closely observe the aetherial balance of my dear Diamond. It should allow you to do the same for your anima."},{"name":"ULAN","text":"That should do for explanations. If you should have any questions, you are more than welcome to ask. When you have all we require, return to me and we shall make the anima grow as never before!"},{"name":"ULAN","text":"There you are. I was beginning to think Ardashir's proposal was but a cruel jest."},{"name":"ULAN","text":"As before you will require an ample supply of both crystal sand and umbrite. When you have collected what we require we can begin."},{"name":"ULAN","text":"Ah, and you must not forget the anima's vessel. I cannot do my work without it."},{"name":"ULAN","text":"You can examine the anima using this anima glass. I trust you remember how to use it, yes? In any case, should anything happen to it, Arnott will supply you with another. I look forward to seeing what becomes of this new anima."},{"name":"SYSTEM","text":"When requesting Ulan's assistance in developing the anima, you must first speak with her while equipped with your hyperconductive anima weapon, then select “Foster the anima's growth.”"},{"name":"SYSTEM","text":"She will then take the crystal sand and umbrite to create treated crystal sand. This process can be repeated so long as you have the requisite items in your inventory."},{"name":"SYSTEM","text":"Treated crystal sand can be used to raise the five attributes associated with your anima as you see fit."},{"name":"SYSTEM","text":"The five attributes associated with your anima are <span class=\"highlight\">critical hit rate</span>, <span class=\"highlight\">direct hit rate</span>, <span class=\"highlight\">determination</span>, <span class=\"highlight\">tenacity</span>, and <span class=\"highlight\">skill speed</span>."},{"name":"SYSTEM","text":"The five attributes associated with your anima are <span class=\"highlight\">critical hit rate</span>, <span class=\"highlight\">direct hit rate</span>, <span class=\"highlight\">determination</span>, <span class=\"highlight\">piety</span>, and <span class=\"highlight\">spell speed</span>."},{"name":"SYSTEM","text":"You can review the items to be exchanged for crystal sand at any time by accessing Ulan's note in your inventory."},{"name":"SYSTEM","text":"Moreover, you can view the progress of your anima at any time by accessing the anima glass in your inventory."},{"name":"SYSTEM","text":"Before selecting “Recondition the Anima,” your hyperconductive anima weapon must be discarded or entrusted to a retainer."},{"name":"ULAN","text":"There is little I can do for you without the anima weapon. I should hope you did not forget it somewhere."},{"name":"ULAN","text":"There is little I can do for you without the anima weapon and that shield of yours present. I should hope you did not forget them somewhere."},{"name":"Q1","text":"What would you like to do?"},{"name":"A1","text":"Foster the anima's growth."},{"name":"A2","text":"Exchange items for crystal sand."},{"name":"A3","text":"Ask about developing the anima."},{"name":"A4","text":"Nothing."},{"name":"Q1","text":"What will you ask?"},{"name":"A1","text":"How exactly do we help the anima grow?"},{"name":"A2","text":"Where can I obtain the supplies we need?"},{"name":"A3","text":"Nothing."},{"name":"ULAN","text":"Before the anima can consume my crystal sand, it must first be stripped of its elemental aspects. This requires umbrite."},{"name":"ULAN","text":"When you acquire both the crystal sand and umbrite, return here with the anima's vessel in hand and we can begin."},{"name":"SYSTEM","text":"When requesting Ulan's assistance in developing the anima, you must first speak with her while equipped with your hyperconductive anima weapon, then select “Foster the anima's growth.”"},{"name":"SYSTEM","text":"She will then take the crystal sand and umbrite to create treated crystal sand. This process can be repeated so long as you have the requisite items in your inventory."},{"name":"SYSTEM","text":"Treated crystal sand can be used to raise the five attributes associated with your anima as you see fit."},{"name":"SYSTEM","text":"The five attributes associated with your anima are <span class=\"highlight\">critical hit rate</span>, <span class=\"highlight\">direct hit rate</span>, <span class=\"highlight\">determination</span>, <span class=\"highlight\">tenacity</span>, and <span class=\"highlight\">skill speed</span>."},{"name":"SYSTEM","text":"The five attributes associated with your anima are <span class=\"highlight\">critical hit rate</span>, <span class=\"highlight\">direct hit rate</span>, <span class=\"highlight\">determination</span>, <span class=\"highlight\">piety</span>, and <span class=\"highlight\">spell speed</span>."},{"name":"SYSTEM","text":"You can view the progress of your anima at any time by accessing the anima glass in your inventory. Consider the balance of attributes carefully to create a weapon best suited to your needs."},{"name":"ULAN","text":"As I explained earlier, in addition to my crystal sand, we require umbrite that we may strip the sand of its elemental aspects."},{"name":"ULAN","text":"The sand I will offer to you in exchange for the supplies listed in the catalog I gave you."},{"name":"ULAN","text":"I should hope you have not lost track of it since last we spoke. If for any reason you did misplace it, however, I have prepared another copy just over there."},{"name":"ULAN","text":"The umbrite, I am afraid, will require bartering with Hismena of the House of Splendors. As a renowned collector of rarities, I can only imagine what she will ask for in exchange."},{"name":"ULAN","text":"After we begin the process of augmenting the anima, you will need a way to track its growth. That is when you use the anima glass. Speak with my assistant Arnott if you should require another."},{"name":"ULAN","text":"It would seem the anima has grown quite strong, would you not agree Arnott?"},{"name":"ARNOTT","text":"That crystal sand no longer aligned to any one element could be so effective is unprecedented. The data we have collected should prove quite useful to your research."},{"name":"ARNOTT","text":"I cannot say for certain if this anima is stronger than the last. Still, its growth rate is incredible. The data we have collected should prove quite useful to your research."},{"name":"BUKINOSEIREI","text":"I... I wish to continue."},{"name":"BUKINOSEIREI","text":"For your sake and mine, that you should never want for strength in times of strife. I must become stronger."},{"name":"BUKINOSEIREI","text":"I... I wish to continue."},{"name":"BUKINOSEIREI","text":"For your sake and mine, that you should never want for strength in times of strife. I will become stronger."},{"name":"ULAN","text":"An ambitious one, your anima. That it should strive so fiercely to exceed its own limitations is quite remarkable. Not even Diamond Carbuncle demonstrated such tenacity. The bond between you two is one to be envied, for certain."},{"name":"ULAN","text":"Again the anima aims to surpass its limits of its own volition. This is worthy of further investigation. Hmmm, perhaps another time."},{"name":"ARDASHIR","text":"&lt;pant&gt; &lt;pant&gt; The documents you requested. &lt;pant&gt; As promised."},{"name":"ULAN","text":"Ah, Ardashir. Your timing is impeccable. The crystal sand was as effective as we expected. However, it would seem your aetherial companion wishes to pursue greater strength despite reaching what I have calculated to be the apex of its power."},{"name":"ULAN","text":"Doubtless you are aware of the potential repercussions should we grant this request. So, what say you? Shall we cast caution to the wind, and see to what new heights the anima can attain? "},{"name":"ARDASHIR","text":"But of course. If it is the anima's wish, who are we to deny it? Though should we succeed, there is still the matter of its vessel─the weapon. I fear it will not bear the strain of any new powers the anima will possess."},{"name":"ARDASHIR","text":"I will consult with our smith to forge a new vessel. One better suited to the anima's burgeoning strength."},{"name":"ULAN","text":"It would seem my stay here in Idyllshire will be much more interesting than I anticipated. When you are ready to begin anew, you need but say the word."},{"name":"BUKINOSEIREI","text":"My body... It aches..."},{"name":"BUKINOSEIREI","text":"My body... It aches..."},{"name":"ULAN","text":"It is as Ardashir predicted. Its vessel can no longer bear the power that now courses through it."},{"name":"ULAN","text":"You must hurry back to him with the anima. I will see to it he is apprised of the situation by the time you arrive."},{"name":"ARNOTT","text":"Should he have need to examine the anima more closely, give him the anima glass."},{"name":"ULAN","text":"Safe travels, <span class=\"highlight\">Forename</span>. I pray the anima will be all right."},{"name":"SYSTEM","text":"You must have the anima glass in your inventory to proceed with this quest."},{"name":"SYSTEM","text":"Speak with Arnott in Idyllshire in order to obtain another."},{"name":"ARDASHIR","text":"<span class=\"highlight\">Forename</span>, thank goodness! We must act quickly, there's no telling how much longer the soulstone will last."},{"name":"ARDASHIR","text":"I would have the anima glass, along with the blade and shield serving as its vessel."},{"name":"ARDASHIR","text":"I would have the anima glass and the weapon serving as its vessel."},{"name":"ARDASHIR","text":"As I feared, the anima's vessel has reached its limit. We must remove the soulstone at once."},{"name":"ARDASHIR","text":"The soulstone appears to be still intact."},{"name":"ARDASHIR","text":"Ready the new weapon, Gerolt. The soulstone must be set before it begins to degrade."},{"name":"GEROLT","text":"The anima's got a lot o' spine for bein' one so small, I'll grant you that. This new weapon ought to make for a fine reward."},{"name":"GEROLT","text":"&lt;pant&gt; &lt;pant&gt; It's...it's done, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Hold her up an' see how she feels."},{"name":"GEROLT","text":"The pinnacle o' craftsmanship, courtesy o' yours truly, and the nodes what taught me the ins an' outs of Allagan technology─[Error]!"},{"name":"GEROLT","text":"The pinnacle o' craftsmanship, courtesy o' yours truly, and the nodes what taught me a few tricks about Allagan technology─[Error] and [Error]!"},{"name":"BUKINOSEIREI","text":"My body. It feels...so light! Is this the work of some arcane magick?"},{"name":"BUKINOSEIREI","text":"My body. It feels...so light! What manner of arcane magick caused this?"},{"name":"BUKINOSEIREI","text":"A new vessel, designed by Ardashir and forged by Gerolt."},{"name":"BUKINOSEIREI","text":"Thank you, both of you."},{"name":"ARDASHIR","text":"Can it be...? After years of research, of trials and failures...I can see the anima. I can <span class=\"emphasis\">see</span> the anima, and I can hear it speak! Oh, if only my master could be here to witness this."},{"name":"BUKINOSEIREI","text":"<span class=\"highlight\">Forename</span>, Ardashir does not seem well. Perhaps he too requires a new vessel."},{"name":"BUKINOSEIREI","text":"Yes, a mighty new vessel like your weapon. Let us ask the blacksmith Gerolt."},{"name":"BUKINOSEIREI","text":"Yes, a stalwart new vessel like your sword and shield. Let us ask the blacksmith Gerolt."},{"name":"BUKINOSEIREI","text":"<span class=\"highlight\">Forename</span>, Ardashir does not seem well. Perhaps he too requires a new vessel."},{"name":"BUKINOSEIREI","text":"Yes, something powerful like your new weapon. Might we ask Gerolt to build one?"},{"name":"BUKINOSEIREI","text":"Yes, something resilient like your sword and shield. Might we ask Gerolt to build one?"},{"name":"ARDASHIR","text":"Hahaha, it would appear you have developed a sense of humor to match your new body. Unfortunately, my aetherial friend, we can not exchange ours quite so easily. Though the weapon that houses your soulstone is indeed exquisite, I very much doubt Gerolt would grant me anything quite so elegant."},{"name":"ARDASHIR","text":"Oh, but look at me standing here, talking to you. Never have I felt such joy."},{"name":"ARDASHIR","text":"Oh, but it is I who should be thanking you, my aetherial friend. That we can finally converse after all this time...it fills my heart with joy."},{"name":"BUKINOSEIREI","text":"Joy...?"},{"name":"ARDASHIR","text":"You must be tired after such a long day. Rest─you have earned it."},{"name":"ARDASHIR","text":"This marks a monumental breakthrough in our work. Though it still appears to want for knowledge, our goal is all but realized!"},{"name":"ARDASHIR","text":"And I can think of none better suited to teaching our young charge of the world and its wonders."},{"name":"GEROLT","text":"Aye. You see to it yer anima doesn't turn into a snivelin' little shite like his lordship here. One is plenty."},{"name":"ARDASHIR","text":"I imagine an arrogant, pigheaded clod would be equally undesirable."},{"name":"ARDASHIR","text":"Ahem. As I said before, it has been a terribly long day not only for the anima, but for you as well. Rest easy, <span class=\"highlight\">Forename</span>. I will do all in my power to determine our next course of action by the time you return."},{"name":"GEROLT","text":"We've gone an' done it now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I know he's tryin' to keep his composure, but as soon as ye leave the boy'll be prancin' around singin' about the anima. I wouldn't count on him bein' ready to work again any time soon."},{"name":"GEROLT","text":"At least we've got nothin' to worry about so long as the anima is with ye. Take good care o' that weapon, ye hear?"},{"name":"ARDASHIR","text":"Another smashing success! How fortunate are we to be blessed with yet another anima so fine? There is much I wish to do that I might further my work, but for now I pray you rest. When the time comes, we shall begin anew in earnest."},{"name":"SYSTEM","text":"The anima has reached beyond its limits, the weapon housing its soulstone forged anew!"}],"reward":{"gil":488,"items":[{"id":15223},{"id":15236},{"id":15224},{"id":15225},{"id":15226},{"id":15227},{"id":15231},{"id":15232},{"id":15233},{"id":15234},{"id":15228},{"id":15229},{"id":15230},{"id":15235}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":107}],"quests":[67820]},"next":[67870,67915]},"partials":[{"type":"npc","id":"1016135","obj":{"i":1016135,"n":"Ardashir","l":2101,"q":11}},{"type":"npc","id":"1017108","obj":{"i":1017108,"n":"Ulan","l":2082,"q":2}},{"type":"npc","id":"1017529","obj":{"i":1017529,"n":"Arnott","l":2082,"q":1}},{"type":"item","id":"15223","obj":{"i":15223,"n":"Sword of the Twin Thegns","l":240,"c":30545,"t":2}},{"type":"item","id":"15236","obj":{"i":15236,"n":"Shield of the Twin Thegns","l":240,"c":30138,"t":11}},{"type":"item","id":"15224","obj":{"i":15224,"n":"Sultan's Fists","l":240,"c":31113,"t":1}},{"type":"item","id":"15225","obj":{"i":15225,"n":"Axe of the Blood Emperor","l":240,"c":31517,"t":3}},{"type":"item","id":"15226","obj":{"i":15226,"n":"Trident of the Overlord","l":240,"c":31917,"t":5}},{"type":"item","id":"15227","obj":{"i":15227,"n":"Bow of the Autarch","l":240,"c":32312,"t":4}},{"type":"item","id":"15231","obj":{"i":15231,"n":"Cane of the White Tsar","l":240,"c":32693,"t":9}},{"type":"item","id":"15232","obj":{"i":15232,"n":"Rod of the Black Khan","l":240,"c":33061,"t":7}},{"type":"item","id":"15233","obj":{"i":15233,"n":"Book of the Mad Queen","l":240,"c":33554,"t":10}},{"type":"item","id":"15234","obj":{"i":15234,"n":"Word of the Magnate","l":240,"c":33555,"t":98}},{"type":"item","id":"15228","obj":{"i":15228,"n":"Spurs of the Thorn Prince","l":240,"c":33899,"t":84}},{"type":"item","id":"15229","obj":{"i":15229,"n":"Guillotine of the Tyrant","l":240,"c":34272,"t":87}},{"type":"item","id":"15230","obj":{"i":15230,"n":"Flame of the Dynast","l":240,"c":34673,"t":88}},{"type":"item","id":"15235","obj":{"i":15235,"n":"Sphere of the Last Heir","l":240,"c":34872,"t":89}},{"type":"quest","id":"67820","obj":{"i":67820,"n":"Finding Your Voice","g":74,"l":"Azys Lla","s":5,"r":1,"f":1}},{"type":"quest","id":"67870","obj":{"i":67870,"n":"Recondition the Anima","g":0,"l":"Idyllshire","s":0,"r":1}},{"type":"quest","id":"67915","obj":{"i":67915,"n":"Future Proof","g":74,"l":"Azys Lla","s":8,"r":1,"f":1}}]}