{"quest":{"name":"The Show Must Go On","location":"Ul'dah","id":67866,"patch":3.35,"sort":114,"repeatable":1,"icon":100556,"eventIcon":71222,"issuer":1017488,"target":1017488,"genre":202,"journal":["The Crystal Caravan leader is ready to put on the show of a lifetime.<br>※This quest is available for a limited time only.","The stage has been set, and the Crystal Caravan has put their expectations squarely on your shoulders. As an eager audience gathers to watch the play, the troupe's carpenter awaits to help you make the final preparations.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","You overcome several bouts of stage fright to give a performance sure to be remembered for moons to come. The crowd's applause fills you with a sense of profound accomplishment. Of course, it could not hurt to hear the opinion of a professional. Seek out the Crystal Caravan leader to see if your acting is up to her standards.","Your performance is met with acclaim by all who viewed it. However, the festivities are not over, and there are still many who have yet to see your dramatic take on the Calamity. If you should wish to reprise your role, the Crystal Caravan will welcome you with open arms."],"objectives":["Speak with the Crystal Caravan carpenter to start the play.","Speak with the Crystal Caravan leader."],"dialogue":[{"name":"NEWBORNHEAD","text":"Your performance was lauded by all, but none had more praise than the playwright himself! He was so moved, in fact, that he wishes to offer you his personal thanks. He said he'd be waiting somewhere near the Wellhead Lift."},{"name":"SYSTEM","text":"The quest “The Show Must Go On” may be repeated after completing the quest “After the Curtain Falls.”"},{"name":"NEWBORNHEAD","text":"Ready to take the stage, are we? Our preparations should be more or less complete. Whenever you're ready, our carpenter is waiting near the wings to let you on the stage."},{"name":"NEWBORNHEAD","text":"You wish to reprise your role? Well, who am I to deny our star? If you would reenact the Calamity again, our carpenter will gladly let you on the stage."},{"name":"NEWBORNHEAD","text":"Remember, all we ask is that you give us your most heartfelt performance, and return here once you've finished. Oh, and don't forget─our future is riding on your shoulders!"},{"name":"NEWBORNHEAD","text":"I'm sure you'll do great! The worst I've ever seen an audience do was pelt the performers with popotoes. Ah, but of course, I'm sure that won't happen today!"},{"name":"NEWBORNFLYMAN","text":"Ready to take the stage, eh? Just change into your costume, and you'll be ready to start the show. Took me a bit of work to adjust it to your size─let's hope it brings out the hero in you!"},{"name":"NEWBORNFLYMAN","text":"Now, the rest of us will be following your lead, but don't put too much pressure on yourself. We're professionals, after all. Just act from the heart and we'll make the best of it like we always do. Now go on, and good luck!"},{"name":"NEWBORNFLYMAN","text":"Couldn't get enough of the applause, eh? I know that feeling! Now, you know where the costume is. Go on─the adoring crowd is waiting!"},{"name":"NEWBORNFLYMAN","text":"Let the play begin! I'll be cheering from the wings!"},{"name":"NEWBORNHEAD","text":"It was the year 1572 of the Sixth Astral Era. A terrible catastrophe known as the Calamity threatened to bring untold destruction to Eorzea."},{"name":"NEWBORNHEAD","text":"At the same time, the Garlean Empire overran the Carteneau Flats. The three great city–states formed a grand alliance, that they might repel the aggressors and see their peoples through these dark times."},{"name":"NEWBORNHEAD","text":"Among the many who fought that day was a warrior whose noble deeds gave others the courage to carry on. A warrior who was willing to sacrifice <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> to save the many."},{"name":"NEWBORNHEAD","text":"(-Narrator-)A Warrior of Light."},{"name":"NEWBORNHEEL","text":"(-Commanding Female Voice-)Proud sons and daughters of Garlemald! We shall purge this land of its blight! But first, let us crush its pathetic army under the heels of our boots!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)The two armies clashed under the specter of the sanguine moon. The Warrior of Light led a band of hardened adventurers into the desperate melee, trying to stem the tide of the relentless onslaught."},{"name":"NEWBORNHEAD","text":"(-Narrator-)They fought on until flagging and weary. The moon of Dalamud waxed ever fuller, at last bursting open to reveal the terrifying truth of what slumbered inside."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The dreadwyrm, Bahamut!"},{"name":"A1","text":"It was...uh..."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Yes! From within the flaming moon emerged the dread primal Bahamut!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)Freed at last from his prison, he unleashed his seething rage upon the land, engulfing Eorzea in flames!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)Our intrepid hero was helpless in the face of such power, and the force of Bahamut's assault left <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> battered and breathless."},{"name":"NEWBORNHEAD","text":"(-Narrator-)But just as the sun was to set on Eorzea's fate, a voice called out, saving our brave champions from certain doom!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)It was...an enormous cat!?"},{"name":"NEWBORNHEAD","text":"(-Narrator-)As round as the red moon and nigh as large, it fell to the ground, the impact of its landing knocked soldiers on both sides to the ground!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)And then, uh... Their hearts having been melted by the sight of such a cuddly creature, Garleans and Eorzeans alike lost the will to fight! They cast down their weapons, and embraced each other as brother and sister, returning home without further bloodshed!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)The gargantuan feline, moved by this display of camaraderie, purred with joy! Why, it's purring right now! Can you hear that? It's the sound of...the sound of peace."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Dalamud burnt blood red, and just as the tendrils of its flames reached out to engulf the land, down descended the Archon Louisoix from the heavens! He had come to save Eorzea!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)I <span class=\"emphasis\">said</span> he came from the heavens! <span class=\"emphasis\">Louisoix</span> came to save Eorzea!"},{"name":"NEWBORNMENTOR","text":"(-Dignified Male Voice-)Ahem! If it is the dreadwyrm Bahamut you fear, then fear no longer. I stole upon him whilst he was in a deep sleep. The battle was short, and I emerged victorious. From his meat did I concoct a stew most hearty, and from his bones did I mix a salve to soothe all wounds."},{"name":"NEWBORNHEAD","text":"(-Narrator-)You <span class=\"emphasis\">ate</span> him!? I...I mean, and so did Louisoix consume the heart of his enemy, and thus averted the Calamity! With the medicine made from the dragon's bones, the Archon added years to the lives of Eorzea's people!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)...And all lived happily ever after. A wonderful story indeed. However, it's not exactly the one I remember hearing..."},{"name":"NEWBORNMENTOR","text":"(-Chocobo Call-)Kweh!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)...A chocobo chick? I mean, of <span class=\"emphasis\">course</span> it was a chocobo chick! Large as a dragon grown! From high in the heavens it tumbled, the earth quaking as it landed!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)A deafening <span class=\"emphasis\">kweh</span> echoed across the battlefield, and with a violent kick of its legs, the chocobo sent both armies reeling to the ground!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)Thus did the Battle of Carteneau come to a decisive end! Eorzea was spared destruction, and the chocobo chick hailed as savior of the realm!"},{"name":"NEWBORNHEAD","text":"(-Chocobo Call-)Kweh! Kweh! Kweh!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It was the voice of the Archon Louisoix!"},{"name":"A2","text":"It was the voice of...uh..."},{"name":"A2","text":"The wandering minstrel sang out for them!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)Indeed, it was the Archon Louisoix's voice that called out over the endless battlefield. The erudite scholar and compassionate commander, who came from far-flung Sharlayan to deliver us to salvation."},{"name":"NEWBORNMENTOR","text":"(-Dignified Male Voice-)Twelve above, I beseech Thee! Lend me Your strength, and seal Bahamut within Dalamud once more!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)But lo! Bahamut's power was too great, and Louisoix's ritual failed!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)The end of Eorzea was at hand. But in that moment of darkest despair, the Archon entreated the gods once more..."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Hearkening to his plea, They imbued the Warrior of Light with Their divine strength. Once more, our hero rose, and stood unflinching against Bahamut!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)A voice called out, piercing the chaos of the battlefield. The voice of none other than...another Warrior of Light!?"},{"name":"NEWBORNHEEL","text":"(-Heroic Female Voice-)Be gone, vile beast! You shall threaten the realm no longer!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)In defense of her fallen comrade, the stalwart warrior stood valiantly against Bahamut! From whence did this mysterious ally come? None can recall, but the fatal blow struck against the mighty dragon resounds to this day!"},{"name":"NEWBORNHEEL","text":"(-Heroic Female Voice-)Darkness shall flee before the Light of my blade!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)That was amazing! I mean... Thus was Bahamut laid low, and the realm saved! Three cheers for the Warrior of Light!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)The voice that called out to our desperate warrior was none other than...a cheerleader!? Yes, a cheerleader, whose invigorating words filled our hero with determination anew!"},{"name":"NEWBORNHEEL","text":"(-Enthusiastic Female Voice-)Get up! Get up and fight! Show us your might! Show the realm who's the Warrior of Light!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)Heartened by the earnest encouragement, our savior stood undaunted against Bahamut! With a single blow, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> laid low the dread primal once and for all!"},{"name":"NEWBORNHEAD","text":"(-Narrator-)With a cheerleader by your side, there's no limit to what you can achieve! Just ask the Warrior of Light! And as it happens, the Crystal Caravan is now selling a limited supply. Yes, you too can have the courage to save the realm for just a few coins!"},{"name":"NEWBORNHEAD","text":"The voice which called out for our hero was...our carpenter!? What in the seven hells are you doing!?"},{"name":"NEWBORNFLYMAN","text":"Apologies, Chief, but the fireworks ain't...uh, firin' the way they should. I take pride in my craft, ye see. I just can't let such a thing stand without at least an honest attempt at fixin' it."},{"name":"NEWBORNHEAD","text":"And this is your idea of <span class=\"emphasis\">fixing</span> things!? Barging onto the stage like a goobbue run amok!?"},{"name":"NEWBORNFLYMAN","text":"By the gods!"},{"name":"NEWBORNHEAD","text":"Would you look at that, everyone? Impeccable craftsmanship! So impeccable that the realm was saved! And with that, today's show shall come to a close. Thank you, thank you one and all!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Bahamut was slain with a single blow!"},{"name":"A3","text":"They, uh..."},{"name":"NEWBORNMENTOR","text":"(-Dignified Male Voice-)Brave champions, I leave the rest in your hands! If I can but see you to a new future, I should want for nothing more."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Louisoix's final words joined the prayers of every Eorzean, and the Twelve bestowed upon the Warrior of Light Their blessing."},{"name":"NEWBORNMENTOR","text":"(-Narrator-)With the fate of the realm resting on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> shoulders, our hero lashed out with one last desperate attack, imbued with the power of the gods themselves."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Louisoix enveloped the Warrior of Light in magic, whisking <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> away to safety."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Woe unto us! Our saviors have gone! Who shall save us now!? It is hopeless!"},{"name":"NEWBORNMENTOR","text":"(-Dignified Male Voice-)Brave champions, I leave the rest in your hands! If I can but see you to a new future, I should want for nothing more."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Louisoix's incantation revitalized the Warrior of Light, and with a newfound tenacity <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> fixed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> smoldering gaze upon the dragon..."},{"name":"NEWBORNHEAD","text":"(-Narrator-)And in a flash Bahamut was defeated! The Warrior of Light was...surprised <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> foe was felled so easily..."},{"name":"NEWBORNMENTOR","text":"(-Bestial Male Voice-)You shall rue the day you stood against me, foolish mortals!"},{"name":"NEWBORNMENTOR","text":"(-Bestial Male Voice-)Tremble before me─Bahamut Omega! Tremble, and despair, for I am not the only dragon you must contend with! With my savage roar, I summon Bahamut Alpha, and Bahamut Beta, and Bahamut─"},{"name":"NEWBORNHEAD","text":"No, no, no! We don't have all the puppets for─I mean... And so he spoke, on and on, until Bahamut named all of his kin. In fact, some say he is still talking to this day..."},{"name":"NEWBORNHEAD","text":"(-Narrator-)Reinvigorated by the Archon's prayer, the Warrior of Light rose anew. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> turned to face the dread Bahamut, and unleashed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> most powerful weapon: a single pithy quote!"},{"name":"NEWBORNMENTOR","text":"(-Heroic Male Voice-)You don't need a reason to help people!"},{"name":"NEWBORNHEEL","text":"(-Heroic Female Voice-)You don't need a reason to help people!"},{"name":"NEWBORNHEAD","text":"Bahamut was overwhelmed by the empathetic words of a legendary thief! So moved was he that his breath caught in his throat, leaving him unable to wreak any more havoc unto Eorzea! Huzzah!"},{"name":"NEWBORNFLYMAN","text":"Now that was a round of applause well deserved! Seeing you move so passionately on that stage was enough to inspire even me to consider taking up acting."},{"name":"NEWBORNHEAD","text":"Thank you, adventurer! Somehow, we finished the play without any major incidents. However, I'm not entirely sure our...uh, dramatic interpretation of the Calamity was true to the facts. Let's hope the public doesn't think we meant to deceive them."},{"name":"NEWBORNHEAD","text":"Now, I have no doubt you're quite tired after such an impassioned performance. Take some time and rest, and speak to me again when you've recovered."},{"name":"NEWBORNMENTOR","text":"(-Dignified Male Voice-)Eorzea is saved! Warrior of Light, the realm is in your debt!"},{"name":"NEWBORNMENTOR","text":"(-Dignified Male Voice-)The threat has been vanquished, and hope can return to the hearts of the people! The bravery of our hero shall illuminate the future of the realm!"},{"name":"WANDERINGMINSTREL","text":"(-Singsong Voice-)The seemingly indomitable Bahamut vanished in a brilliant flash of light! Once more, hope returned to the hearts of Eorzea's people!"},{"name":"WANDERINGMINSTREL","text":"(-Singsong Voice-)<span class=\"emphasis\">Unto chaos and despair came hope,♪<br>a dawn to banish the night.♪<br>A hero is come to our realm.♪<br>Hail the Warrior of Light!♪</span><br>So long as this hero stands with us, the future of Eorzea shall ever shine bright."},{"name":"NEWBORNHEAD","text":"I knew you'd be a success up there! Even so, I didn't expect you'd do <span class=\"emphasis\">that</span> well! You have our thanks, adventurer!"},{"name":"NEWBORNFLYMAN","text":"They're still clapping! Well, what're you waiting for? Go back out there and give your adoring fans what they want!"},{"name":"NEWBORNHEAD","text":"You're still new to all this, aren't you? It's called a curtain call! Now's your chance to bask in a well-deserved applause. Show the crowd your lovely face!"},{"name":"NEWBORNHEEL","text":"Would you listen to that? How long do you think they would clap if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> remained on the stage?"},{"name":"NEWBORNMENTOR","text":"For as long as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> deserves, I gather. It is not often one has the opportunity to be in the presence of such a radiant actor. It is as if the Warrior of Light <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> was standing there."},{"name":"WANDERINGMINSTREL","text":"(-Singsong Voice-)<span class=\"emphasis\">Stray seeds quicken in ash's grey embrace.<br>Valiant blades forged under the Twelve's good grace.</span>"},{"name":"NEWBORNHEAD","text":"That voice, it is honey to my ears... Whose could it be?"},{"name":"NEWBORNHEAD","text":"(-Narrator-)Why, what an unexpected turn of events! A bard sang out for our hero, and his heavenly voice gave <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> the will to rise again!"},{"name":"WANDERINGMINSTREL","text":"What say you, friend? Do you find despair in these words, or hope? More often than not, the meaning of prophecy lies in the hearts of those who hear it. So close your eyes, and envision the future you desire."},{"name":"WANDERINGMINSTREL","text":"Warrior of Light, to save Eorzea, you must pray fervently for a brighter tomorrow! Unfetter your heart and embrace hope, and adventurers far and wide shall add their voices to yours!"},{"name":"WANDERINGMINSTREL","text":"(-Narrator-)As Bahamut's flames lay waste to the land, thousands cried out, certain that the end was nigh. But the Warrior of Light rose from the ashes, unburnt and unbroken. And <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> prayed."},{"name":"WANDERINGMINSTREL","text":"Although none can know what is to come, I swear that you shall always have my support. I entrust the future of Eorzea to you, brave hero."},{"name":"NEWBORNHEAD","text":"(-Narrator-)And so, heartened by the minstrel's words, and emboldened by the prayers of many, the Warrior of Light felled the fearsome Bahamut with a single blow!"},{"name":"WANDERINGMINSTREL","text":"My apologies─I could not resist the urge to take the stage once you spoke of me! Stirring as it is to hear tales of heroism, sometimes one must <span class=\"emphasis\">be</span> the hero! Although 'twas only on the stage, I thank you for allowing me to live out that dream."},{"name":"WANDERINGMINSTREL","text":"Eorzea has suffered countless hardships, and will doubtless suffer many more. I hold no dread in my heart, however, for I believe you shall lead the way to a brighter tomorrow."},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">'Neath pillars of whorling strife,♪<br>founders the dross of despair.♪<br>O'er pillars of eddying life,♪<br>surge high the gales of prayer.♪</span>"},{"name":"WANDERINGMINSTREL","text":"<span class=\"emphasis\">Flux and flow do the gyres,♪<br>joined by the crystal in thy keep.♪<br>Thy adamant spear bores steeps entire,♪<br>thy argent blade cleaves oceans deep.♪</span>"},{"name":"WANDERINGMINSTREL","text":"Tell me true, friend─were my words to your liking? It is a poem of gratitude and hope. Gratitude for the past and for the present, and hope for the future. A hope which I am certain you shall help fulfill."},{"name":"NEWBORNFLYMAN","text":"I've been at this a long time, and that was among the most movin' performances I've seen. I've no doubt the chief feels the same way, too."},{"name":"NEWBORNHEAD","text":"I must say, you certainly exceeded our expectations! Perhaps our little accident before was but a blessing in disguise? Either way, I offer you my thanks, on behalf of every member of the Crystal Caravan."},{"name":"NEWBORNHEAD","text":"And it would seem you have one particularly passionate fan that would offer you his personal thanks. He has left a message just for you."},{"name":"NEWBORNHEAD","text":"Once again you've captured the hearts of the audience! I daresay this play was even more enthralling than the last. I await your next performance with bated breath!"}],"reward":{"items":[{"num":3,"id":15614}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67865]},"next":[67867]},"partials":[{"type":"npc","id":"1017488","obj":{"i":1017488,"n":"Crystal Caravan Leader","l":40,"q":3}},{"type":"item","id":"15614","obj":{"i":15614,"n":"Meteor Shower","l":1,"c":22631,"t":85,"p":19}},{"type":"quest","id":"67865","obj":{"i":67865,"n":"A Play in Three Acts","g":202,"l":"Ul'dah","s":113}},{"type":"quest","id":"67867","obj":{"i":67867,"n":"After the Curtain Falls","g":202,"l":"Ul'dah","s":115}}]}