{"quest":{"name":"A Deific Simulacrum","location":"The Rising Stones","id":67869,"patch":3.4,"sort":16104,"icon":112202,"unlocksFunction":1,"eventIcon":71341,"issuer":1014565,"target":1016633,"genre":17,"journal":["Unukalhai has a gift for you.","Unukalhai gifts you an Allagan tomestone that contains a detailed record of the eikon Sophia at the height of her power. He proceeds to explain that this data will enable Azys Lla's miraculous reality augmentation technologies to generate an idealized simulacrum of the Goddess against whom to test your skills─just as the champions of Allag once did. Take the tomestone to the Flagship, and present the recording device to the verification node.","Upon receiving the tomestone, the verification node initiates what it refers to as an “enlistment program,” presumably intended to assess candidates' worthiness to join the Allagan warrior elite. Assemble a band of trusty companions, and meet the Goddess in all her terrible glory!<br><br>※Containment Bay P1T6 (Extreme) can be accessed via the Duty Finder."],"objectives":["Present the Allagan tomestone of divinity to the verification node on the Flagship."],"dialogue":[{"name":"UNUKALHAI","text":"I would like you to have this, Warrior of Light."},{"name":"UNUKALHAI","text":"It is an Allagan tomestone similar to the one we recovered after your victory over Sephirot. The records contained within describe the Goddess at the height of her power, and will enable Azys Lla's reality augmentation technologies to generate an idealized simulacrum of Sophia against whom to test your skills."},{"name":"UNUKALHAI","text":"From what I have been able to determine, this formed part of a greater trial intended to test Allag's elite warriors. Quite how it will compare to the challenge presented by the Fiend's tomestone, I cannot say..."},{"name":"UNUKALHAI","text":"I suppose there is only one way to be certain. Visit the verification node on Azys Lla, and witness firsthand what awaited the champions of eld."},{"name":"UNUKALHAI","text":"Have you the strength to equal Allag's greatest heroes? You need only visit Azys Lla to find out..."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Activating verification systems... Enlistment program request acknowledged. Awaiting tomestone data..."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Data processed. Adversary: Warring Triad, Sophia. Threat level: Extreme."},{"name":"VERIFICATIONSYSTEM","text":"Successful applicants will progress to elite squad induction. Families of unsuccessful applicants will receive twice standard death benefits."},{"name":"VERIFICATIONSYSTEM","text":"Before initiating this program, elite squad applicants must agree to extensive physical modifi─ &lt;bloop&gt; &lt;crackle&gt;"},{"name":"VERIFICATIONSYSTEM","text":"...Data corrupted. Unable to verify input. Applicant agreement accepted."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Activating reality augmentation... Initiating enlistment program... The Empire thanks you for your service. Postmortem data will be used to improve the survival rates of subsequent applicants. Your sacrifice is appreciated."}],"reward":{"gil":934,"instance":20042,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67868]}},"partials":[{"type":"npc","id":"1014565","obj":{"i":1014565,"n":"Unukalhai","l":481,"q":9}},{"type":"npc","id":"1016633","obj":{"i":1016633,"n":"Verification Node","l":2101,"q":5}},{"type":"instance","id":"20042","obj":{"i":20042,"n":"Containment Bay P1T6 (Extreme)","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":235}},{"type":"quest","id":"67868","obj":{"i":67868,"n":"Balance unto All","g":17,"l":"The Rising Stones","s":16004,"f":1}}]}