{"quest":{"name":"After the Curtain Falls","location":"Ul'dah","id":67867,"patch":3.35,"sort":115,"icon":100557,"eventIcon":71221,"issuer":1017488,"target":1017488,"genre":202,"journal":["The Crystal Caravan leader gazes at you with expectant eyes.<br>※This quest is available for a limited time only.","As the troupe leader tells it, the playwright himself was in the audience to witness your star turn, and would personally thank you for doing his work justice. Meet him near the Wellhead Lift.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Much to your surprise, the author of the play reveals himself to be none other than the wandering minstrel, known throughout Eorzea for his flowery songs and colorful poetry. He expresses his deepest gratitude for bringing his script to life, and sends you off with a heartfelt and encouraging farewell. The Crystal Caravan leader is likely curious to hear what the bard had to say.","The troupe leader is joined by her star actor, who also gives you his thanks. Although he has heard much of your virtuoso performance, he was unfortunately unable to attend due to his injuries. He makes a heartfelt plea for you to return to the stage, that you might inspire not only him, but all those who might have the good fortune to see you act again."],"objectives":["Wait for the playwright near the Wellhead Lift.","Speak with the Crystal Caravan leader."],"dialogue":[{"name":"NEWBORNHEAD","text":"Our leading <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> returns, I see! Once again, I must say you gave quite a memorable performance. So memorable, in fact, that the playwright himself expressed his admiration."},{"name":"NEWBORNHEAD","text":"Although he will soon be departing Ul'dah, he very much wished to speak with you before he boarded the airship. Go now, and you might catch him."},{"name":"WANDERINGMINSTREL","text":"(-???-)Greetings, my friend. When I set quill to parchment to recount the story of the Calamity, I did not imagine <span class=\"emphasis\">you</span> would be cast as the Warrior of Light."},{"name":"WANDERINGMINSTREL","text":"'Tis an honor to meet you. It is not often that I dabble in the art of prose, but I am glad my words were brought to life by such a skilled actor. You see, I am more of a poet by nature."},{"name":"WANDERINGMINSTREL","text":"And a poet's heart is wont to wander, which is how I found myself in Eorzea, a land once unfamiliar to me. My travels have been rife with innumerable trials, and often have I found myself indebted to the adventurers who saw me safely through them."},{"name":"WANDERINGMINSTREL","text":"It is to honor the selflessness of these heroes that I write my songs, and 'twas for the selfsame reason that I penned the play in which you performed."},{"name":"WANDERINGMINSTREL","text":"Your superb acting has certainly aided me in achieving that goal. I was so taken with your performance that I found myself unable to stop my applause even after you had left the stage."},{"name":"015","text":"...Which is not to say you were unfit for the role. On the contrary, I could not have hoped for a more talented thespian to bring my words to life. To a man, the audience was moved beyond words, and I found myself unable to stop clapping even after you had left the stage."},{"name":"WANDERINGMINSTREL","text":"I can only imagine the experiences you must have drawn upon to inform your acting. After today I suspect many shall call you the Warrior of Light in earnest."},{"name":"WANDERINGMINSTREL","text":"Although the Calamity was a terrible tragedy, it also served to sow seeds of hope for the future. Hope in the form of countless brave adventurers, much like the Warriors of Light, who even now protect Eorzea with their lives."},{"name":"WANDERINGMINSTREL","text":"And as much as I would like to see you take the stage time and again, I am certain you will be of more use to the realm as its protector. As an adventurer. For my part, I shall continue to regale others with songs telling of your deeds."},{"name":"WANDERINGMINSTREL","text":"The road ahead will be fraught with hardship─of this I am certain. If ever you find yourself in the midst of a crisis, remember the events of the Calamity. Remember how hope was born from despair, and continue your fight, that I might someday hear of your heroics."},{"name":"NEWBORNHEAD","text":"Have you spoken to the wandering minstrel? Splendid! Ah, but there is one last member of our troupe who would offer you his thanks. Why, none other than our star-crossed leading man, freshly released from the infirmary!"},{"name":"NEWBORNHERO","text":"When that beam took me out of commission, I was positively crestfallen! It is no small blessing that we were able to perform the show─and to such acclaim!"},{"name":"NEWBORNHERO","text":"But alas and alack! I was confined to a bed in Frondale's Phrontistery, unable to witness your stunning performance with my own eyes!"},{"name":"NEWBORNHERO","text":"The chirurgeon has instructed me to refrain from taking the stage until I am fully healed. But I intend to stay limber with some light rehearsing, and I certainly intend to watch your <span class=\"emphasis\">next</span> appearance!"},{"name":"NEWBORNHEAD","text":"Yes, yes, you simply must reprise your role! We've received countless inquiries from your adoring fans, all curious as to when your next performance will be! The puppet theater is a simple matter to set up─ask and we can be ready in a flash!"},{"name":"NEWBORNHEAD","text":"To prove how eager we are for you to join us again, I'll add a little bonus to your payment for this performance!"},{"name":"NEWBORNHERO","text":"You've certainly earned it, for all you've done for us. Pray do not let this be the last time I can reward your performance─it would be an honor to tell our tale of heroism and hope with you again!"}],"reward":{"gil":333,"items":[{"id":15443},{"id":15434}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67866]}},"partials":[{"type":"npc","id":"1017488","obj":{"i":1017488,"n":"Crystal Caravan Leader","l":40,"q":3}},{"type":"item","id":"15443","obj":{"i":15443,"n":"Wind-up Krile","l":1,"c":59605,"t":81}},{"type":"item","id":"15434","obj":{"i":15434,"n":"Dress-up Y'shtola","l":1,"c":59596,"t":81}},{"type":"quest","id":"67866","obj":{"i":67866,"n":"The Show Must Go On","g":202,"l":"Ul'dah","s":114,"r":1}}]}