{"quest":{"name":"Thus Spake Quickthinx","location":"The Dravanian Hinterlands","id":67873,"patch":3.4,"sort":13,"icon":112190,"unlocksFunction":1,"eventIcon":71341,"issuer":1016640,"target":1017942,"involved":[1014408,1016641,1017941,1017943],"genre":16,"journal":["Biggs has instructions for you from Cid.","With Roundrox safely back at the Shortstop─and the Illuminati deprived of their ability to manipulate time─the hour is right to delve into the very heart of the colossus. While Cid and his crew sweep the surrounding areas for any potential ambushers, you are to take the shortest path to innermost chambers of the giant. Steel yourself for battle, and may the Twelve smile upon you!<br><br>※The Heart of the Creator can be accessed via the Duty Finder.","The fearsome mechanical foe that guarded the core has been reduced to scrap metal by your hand. Reconvene with Cid and the others, and agree on your next step.","You fight your way to the core only to be confronted by an inconvenient truth─with the primal absorbing aether from the land at a heretofore unheard of rate, the crystal has swelled to mammoth proportions. Taking stock of the situation, Cid surmises that any attempt to dismantle it in its current state would prove futile, and proposes a change in plans─you will return to Central Control and attempt to find a way to cut off the influx of aether to the core, thereby stunting its growth and rendering it more easily destroyed. Cid and Wedge begin to consider the details of the plan, but their conversation is interrupted by Quickthinx, who descends on a floating platform to inform you that the discussion is entirely moot─he has already seen the future, and your attempts to defeat the primal are doomed to fail. He assures you that while he is too busy conquering time to kill you now, he has foreseen that the next time you step into this chamber will be your last. He gloats that he has sealed off all other routes to Central Control save for this one, giving you two choices: abandon your mission and cede control of history to the Illuminati, or forfeit your lives. Events take an unexpected turn, however, when Shanoa suddenly throws herself at Quickthinx as he is floating away, knocking his prized “futurebook”─the source of his vast knowledge of all that will come to pass─out of his hand and down to the floor in a scene uncannily similar to that witnessed during your trip to the past. Backrix quickly takes the tome into hand, and is astonished to see that it is none other than his very own watcherbook, with the final entry ending precisely where he had left off when Shanoa knocked the selfsame book out of his hands. While many of the convoluted details remain unclear, one thing is certain: for all of Quickthinx's bravado and bluster, the future from here onward remains unwritten, and the battle for history may yet be won!","Biggs reflects on the revelations of the day, piecing together the events that led Quickthinx to his delusion that he had been chosen by time itself as a prophet and mender of history. One riddle, however, still remains─while it is now evident that the events of the past three years were set in motion by Shanoa, the coeurl's motivation for doing so is entirely abstruse. Is there more to this curious kitten than meets the eye? To what end is she seeking to shape the course of history? The answers, no doubt, are housed deep within the bowels of that great steel beast..."],"objectives":["Enter the Heart of the Creator.","Report to Biggs."],"dialogue":[{"name":"WEDGE","text":"Jessie had the nerve to give me a dressing down for not saying “please”─said I was getting too big for my britches. Does she have any idea what we've been through!? Honestly!"},{"name":"BACKRIX","text":"Pshhh... Shkohhh...<br>Roundrox is resting back at Shortstop. Muchly worries for her friend Mide...but is safe."},{"name":"BACKRIX","text":"Backrix is happy to be on flatground again. Then uplanders tell Backrix he must go back into giant of whirlycogs for next mission. Shkohhh... What must poor gobbie do to get some rest?"},{"name":"BIGGS","text":"Quickthinx says the future's already been writ, eh? That we're fighting a losing battle? Well, we've got a thing or two to say about that, don't we, <span class=\"highlight\">Forename</span>?"},{"name":"BIGGS","text":"Roundrox is safe with us, which means the Illuminati won't be turning back time on us anymore. And that's not all─thanks to your efforts, we've got ourselves a straight path to the third and final core!"},{"name":"BIGGS","text":"Aye, the very heart of the colossus! Put it out of action, and the whole thing will grind to a halt! Let's go, <span class=\"highlight\">Forename</span>! We'll show the Illuminati that the future's yet to be decided─and save Mide while we're at it!"},{"name":"SYSTEM","text":"You now have access to the Heart of the Creator. Alexander can be accessed via the entrance in the Makers' Quarter."},{"name":"BIGGS","text":"Backrix is with the chief, preparing for the mission. I've been watching over Roundrox's “treasures” in the meantime. Call me a softy, but I'm really starting to see the beauty in them."},{"name":"BIGGS","text":"I reckon traveling back in time's made me appreciate the here and now a bit more, you know. Gripping as it was, I'm not in any hurry to have another try."},{"name":"WEDGE","text":"Y'shtola returned to Idyllshire to tend to Roundrox. Poor thing─as if being a cog in the colossus hadn't taken enough of a toll on mind and body, she now blames herself for the loss of her friend."},{"name":"WEDGE","text":"All the more reason to disable that core and get Mide out of there! The chief's already enlisted Backrix to join us this time around. You can count on Biggs and me as well, of course!"},{"name":"WEDGE","text":"Outstanding, <span class=\"highlight\">Forename</span>! Another Illuminati creation reduced to scrap metal. I'll wager the mere sight of you is enough to send the gobbies scurrying back to the drawing board!"},{"name":"CID","text":"There it is... The heart of the beast. Only now that I see it up close do I comprehend the true scale of the thing."},{"name":"CID","text":"To have reached this size in so short a space of time, the core must be taking in aether at a positively ungodly rate. I'd be willing to wager that it can regrow itself faster than we could ever hope to chip away at it."},{"name":"CID","text":"...Which means we'll need to change tack. Hmm... The central control room houses everything required to operate the colossus. It's not inconceivable that it might offer us a way to regulate, or even shut off, the flow of aether to the core. Of course, any attempt to control Alexander is doomed to fail without the guidance of the <span class=\"emphasis\">Enigma Codex</span>─and there is only one person alive who can access its secrets..."},{"name":"WEDGE","text":"B-But, Chief! Do we really need to drag the poor girl back there? What if she falls into Illuminati hands again!?"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Uplanders waste their tongueflaps. Quickthinx has seen future─<span class=\"emphasis\">true</span> future─and it ends badly for uplanders. Very, <span class=\"emphasis\">very</span> badly."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Uplanders think they just lazywalk into Central Control? Quickthinx thinks not. All passages are sealed, all floatyboards disabled. Only way left open is here, through corechamber. And when uplanders come next, it will be uplanders' endtimes. Quickthinx has seen it!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh!<br>Bad Shanoa! Stupid creature! What goes on in braincase!?"},{"name":"BIGGS","text":"Oi, Wedge... Is it just me, or are you getting the feeling we've seen all this happen before?"},{"name":"BACKRIX","text":"Pssshkoh! It...it is watcherbook of Backrix! And look─writings end where Backrix leaves off, when Shanoa sends watcherbook spinnyfalling from Backrix's fingers!"},{"name":"CID","text":"What the─? You mean to say the book Quickthinx has been reading from all this time is <span class=\"emphasis\">your journal</span>? The same journal that slipped from your hands when we traveled back in time?"},{"name":"CID","text":"So <span class=\"emphasis\">that's</span> how he was able to anticipate our every move! He's no prophet─just a gobbie with delusions of grandeur and a diary from the future!"},{"name":"BIGGS","text":"So the glorious bleedin' future he was always going on about─the one that was writ─was nothing but Backrix's record of the stuff we'd already seen?"},{"name":"BIGGS","text":"Bugger me...I've just had a thought! Oi, cat! Are you Schrödinger from the Shortstop─or are you Quickthinx's familiar Shanoa? Uh...twice for “yea,” was it, Chief?"},{"name":"BIGGS","text":"I bleedin' <span class=\"emphasis\">knew</span> it! She's <span class=\"emphasis\">both</span>! After Schrödinger went tumbling down from the colossus─and don't ask me how she survived the drop─Quickthinx found her, took her in, and gave her a new name! It's like they're two cats─but also one! At the same time!"},{"name":"WEDGE","text":"Um, setting aside for the moment the question of whether or not that even makes sense... What possessed that confounded cat─<span class=\"emphasis\">whatever</span> you want to call her─to do all this in the first place!? I swear, all she's done is made a right old mess of everything!"},{"name":"CID","text":"Now, now, Wedge. Taking out our frustrations on a mewling kitten won't get us any closer to dismantling the core. Getting back to the crux of the matter..."},{"name":"CID","text":"Backrix. You said the journal ends right where you left off, yes? That it's nothing but blank pages from that point on?"},{"name":"CID","text":"Do you hear that, everyone? Though Quickthinx would have us believe otherwise, the future─the future from here onward, that is─is still to be written. And I'll be damned if <span class=\"emphasis\">we</span> won't be the ones to write it!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh...<br>Futurebook is gone, but no matter! All knowings of truetimes are safe up here, in Quickthinx's braincase! Quickthinx is chosen one. Mender of history! Truth is unchanging!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh...<br>Truetimes choose Quickthinx to do their bidding! Truetimes send Shanoa into past, deliver to Quickthinx knowings of future! Truetimes live inside, guiding all of Quickthinx's doings!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Every tongueflap, every busydeal, every brainspark of Quickthinx brings world closer and closer to perfection! Guides Illuminati to rightful place as rulers of new world order! Truetimes will not be unmade by ignorant uplanders!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhhhhh...! Pshhhkohhhhhh!<br>Quickthinx needs no futurebook! No gobbiegirl! Quickthinx needs nothing and no one but ownself! Future has chosen, and future chooses <span class=\"emphasis\">Quickthinx</span>! Yes...even now, power granted by truetimes wells from Quickthinx's fingertips! Power beyond understanding of uplanders' feeble braincases!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhhhhh...!<br>Alexander! Overwatcher of truetimes! Deliver divine judgment on ignorant uplanders, and crush them out of existence for alltimes!"},{"name":"WEDGE","text":"So the only reason Quickthinx was able to predict the future was because he stumbled onto Backrix's watcherbook three years ago? That's not nearly as impressive as being some kind of “chosen one,” to say the least."},{"name":"WEDGE","text":"All of those uncanny predictions and impeccably timed actions─it was all just a sham! But without his precious book to guide him, it looks like the game is finally up!"},{"name":"BIGGS","text":"Let me see if I've got this right. Three years ago, the Quickthinx of back then found the journal that the Backrix of now dropped─which was only possible because <span class=\"emphasis\">we</span> traveled into the past, what with time being a circle and all that."},{"name":"BIGGS","text":"Sooo...he had a look inside and, not knowing the truth of the matter, got it into his head that he was some sort of prophet chosen to set history straight, and that Shanoa, who “miraculously” delivered the book to him, was a messenger from the future sent to show him the way."},{"name":"BIGGS","text":"That's all well and good, but the question remains─why did that bloody cat start all this in the first place? What could she possibly stand to gain from setting in motion this ridiculously convoluted series of events? Another answer found, another question raised─eh, <span class=\"highlight\">Forename</span>?"}],"reward":{"gil":3508,"items":[{"id":16827}],"xp":0,"instance":30041},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67872]},"next":[67874]},"partials":[{"type":"npc","id":"1016640","obj":{"i":1016640,"n":"Biggs","l":2001,"q":2}},{"type":"npc","id":"1017942","obj":{"i":1017942,"n":"Biggs","l":2001,"q":2}},{"type":"npc","id":"1014408","obj":{"i":1014408,"n":"Wedge","l":2001,"q":10}},{"type":"npc","id":"1016641","obj":{"i":1016641,"n":"Wedge","l":2001,"q":2}},{"type":"npc","id":"1017941","obj":{"i":1017941,"n":"Backrix","l":2001,"q":1}},{"type":"npc","id":"1017943","obj":{"i":1017943,"n":"Wedge","l":2001,"q":1}},{"type":"item","id":"16827","obj":{"i":16827,"n":"Exponential Entropy Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30041","obj":{"i":30041,"n":"Alexander - The Heart of the Creator","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":230}},{"type":"quest","id":"67872","obj":{"i":67872,"n":"Biggs and Wedge's Excellent Adventure","g":16,"l":"The Dravanian Hinterlands","s":12,"f":1}},{"type":"quest","id":"67874","obj":{"i":67874,"n":"Judgment Day","g":16,"l":"The Dravanian Hinterlands","s":14,"f":1}}]}