{"quest":{"name":"Who Lives, Who Dies, Who Retells Your Story","location":"Mor Dhona","id":67876,"patch":3.4,"sort":605,"icon":112195,"unlocksFunction":1,"eventIcon":71341,"issuer":1008278,"target":1017948,"genre":95,"journal":["The wandering minstrel seeks inspiration for a new masterpiece, and believes the tale of your ultimate confrontation with the colossus might very well provide it.","His muse stirred by the tale of your time-traveling adventures, the minstrel bursts into song, regaling you with a dramatic retelling of your battle with the colossus─seasoned with enough hyperbole to satisfy the demands of his audience. Should you wish to relive your adventure, wander back through the hinterlands to the Makers' Quarter and speak with the lookout Snapclix.","For reasons nigh as inscrutable as the convolutions of time and space you experienced inside Alexander, it is as if the power of the minstrel's song has given physical form to your recollections of that final confrontation with the colossus. Whatever the explanation, you know only too well that reflecting upon the past can leave one better equipped to face the future.<br><br>※Alexander (Savage) can be accessed by speaking with Lightkix in the Dravanian hinterlands, as well as via the Duty Finder."],"objectives":["Speak with Snapclix in the Makers' Quarter."],"dialogue":[{"name":"WANDERINGMINSTREL","text":"Well met, friend! Might you perchance be able to shed some light on a most remarkable rumor that has reached mine ears─that of a time-straddling hero who did rescue the gobbieflock of Idyllshire from a future most dire?"},{"name":"WANDERINGMINSTREL","text":"Ah, but the Twelve smile upon me today! 'Tis a stirring tale, indeed, and one made more affecting by the unadorned manner in which you tell it. A struggle for the future so grand as to span the boundaries of time and space... Would that I had been there to witness it with mine own eyes!"},{"name":"WANDERINGMINSTREL","text":"I must say, mine interest was especially piqued by the part about turning back time. If I understand correctly, had you triumphed over the giant only for the goblins to reverse the flow of time─thereby compelling you to do battle over and over and over again─the primal's power would have grown to nigh-infinite proportions."},{"name":"WANDERINGMINSTREL","text":"While we must all thank the Twelve that you and your companions were able to break this vicious cycle, as a <span class=\"emphasis\">performer</span>, I must confess to some curiosity over how the final battle with such a foe might unfold... N-Not that I want for inspiration, of course! Your tale is more than sufficient! Why, even now my muse stirs within me! Hearken unto her song!"},{"name":"WANDERINGMINSTREL","text":"In the breast of the giant, a crystal did stand,♪<br>Whose hunger for aether spelled death for the land.♪<br>And thus did our hero swear never to cease,♪<br>Till <span class=\"alternative-container\"><span class=\"alternative\">she'd</span><span class=\"alternative\">he'd</span></span> torn out the heart of the great metal beast.♪<br>Yet for all of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> labors, both bruising and brave,♪<br>The goblins stood poised to make hist'ry their slave.♪<br>"},{"name":"WANDERINGMINSTREL","text":"The giant, however, had plans of its own,♪<br>And plucked from the goblins their dream of a home,♪<br>For it saw but one way to set hist'ry aright,♪<br>A champion of ages, a hero of light.♪<br>So the giant now sleeps, as it did once before,♪<br>In a moment repeated, forever and more.♪"},{"name":"WANDERINGMINSTREL","text":"...You will forgive me if I took certain liberties in my retelling of your tale. My audience are a demanding lot, and they have come to expect a certain...grandeur from my work."},{"name":"WANDERINGMINSTREL","text":"Mine only regret is that I was not able to weave every remarkable detail of this most improbable adventure of yours into my humble composition. Of particular interest to me was the recurring theme of desires and dreams, and the power they may come to hold."},{"name":"WANDERINGMINSTREL","text":"Though I possess no ancient relic to grant form to one's wishes, might it not be said that music has a similar power, albeit in a more intangible sense? Should your travels chance to take you back to the scene of your triumph, pray reflect on your adventures with my song in your heart─you may yet be surprised by what you see."},{"name":"WANDERINGMINSTREL","text":"Though I possess no ancient relic to grant form to one's wishes, might it not be said that music has a similar power, albeit in a more intangible sense? Should your travels chance to take you back to the scene of your triumph, pray reflect on your adventures with my song in your heart─you may yet be surprised by what you see."},{"name":"SNAPCLIX","text":"Pshhh... Shkohhh...<br>First rule of gobbie watchguard: keep steadynerves at alltimes. Second rule of gobbie watchguard: if danger comes to gobbie, ignore first rule, and make speedyfeet."},{"name":"SYSTEM","text":"Thanks to the poetical outpourings of the wandering minstrel, you can now relive your foray into Alexander."}],"reward":{"gil":518,"instance":30043,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67875]}},"partials":[{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"npc","id":"1017948","obj":{"i":1017948,"n":"Snapclix","l":2001,"q":2}},{"type":"instance","id":"30043","obj":{"i":30043,"n":"Alexander - The Eyes of the Creator (Savage)","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":245}},{"type":"quest","id":"67875","obj":{"i":67875,"n":"Of Endings and Beginnings","g":16,"l":"The Dravanian Hinterlands","s":15,"f":1}}]}