{"quest":{"name":"Biggs and Wedge's Excellent Adventure","location":"The Dravanian Hinterlands","id":67872,"patch":3.4,"sort":12,"icon":112189,"unlocksFunction":1,"eventIcon":71341,"issuer":1017932,"target":1017938,"involved":[1017933,1017934,1017939,1017940],"genre":16,"journal":["Undaunted by recent revelations, Biggs would brief you on the next stage of the rescue mission.","With the operation to rescue Roundrox─and, in turn, foil the Illuminati's plans for historical domination─set to commence, Biggs briefs you on the details. Your task will be a straightforward if demanding one: enter the colossus through its head and delve deep through its nasal cavity to seize control of a moving platform that will transport the rescue party to Central Control, where Roundrox is being held captive. Cid and the others, meanwhile, will sweep through Midas, eliminating any Illuminati ambushers they encounter before rendezvousing with you in readiness to attempt the rescue. The goblin girl's fate─and that of history itself─hangs in the balance. Once more unto the breach, Warrior of Light!<br><br>※The Breath of the Creator can be accessed via the Duty Finder.","Dispatching an oversized Illuminati sellsword, you seize control of the transport platform, securing a shortcut to the heart of the colossus, where Roundrox is being held captive. Ride the platform to your destination to rendezvous with Cid and the others before proceeding with the next phase of the mission.","Successfully infiltrating Central Control, you find Roundrox chained to a metal chair. Projected on the ceiling above her is the <span class=\"emphasis\">Enigma Codex</span>, its vast knowledge and powers now open to the Illuminati by their cruel manipulation of the goblin girl's mind. Mide rushes to her friend's side, and the delirious Roundrox indicates that Alexander is now fully operational, with the capacity to travel through time. While Mide wistfully contemplates what she might do with such power, Roundrox engages the time travel engine, transporting the colossus and all within three years into the past, to the fateful day when Mide and her fellow treasure hunters attempted to summon the primal. From a perch high atop the colossus, Biggs and Wedge duly bear witness to what truly happened...<br><br><span class=\"emphasis\">Illuminati snipers emerge from within the steel fortress and fire upon the treasure hunters in the midst of their ritual. As chaos ensues, their leader, Dayan, declares the summoning a failure, and orders a fresh-faced Mide to seal the primal away, before sacrificing himself to save her life. After watching her beloved disappear into the primal's howling core, she slumps to the earth, bereft and broken. Meanwhile, back atop the colossus, Shanoa conspicuously hurls herself at Backrix, and both the kitten and the goblin's journal go tumbling to the ground below. The former─quite miraculously─scampers away unscathed, while the latter is discovered by the Roundrox of the past...</span><br><br>With a blinding flash, the time travel mechanism is disengaged, and the colossus returns to the present time. There, the party is met by Quickthinx, who reveals the most chilling truth of all: that time is a circle, an infinite loop, and the primal that Mide and her companions summoned three years ago was, in fact, the selfsame one that bore you to the past in scant moments before. The Illuminati Grand Master gleefully thanks you for playing out your roles in his preordained history, then summons his lackeys to put an end to you. You successfully retreat, but Mide─devastated by the knowledge that she is powerless to change either her past or her future─remains behind, unwilling to abandon the soul of her beloved.","All─save for Mide─emerge from the colossus unscathed if deeply unnerved by recent revelations. Roundrox, though finally free from the clutches of the Illuminati, is heartbroken over the role she played in her Auri friend's downfall, insisting that she will go and save her. Cid swiftly puts paid to this notion, however, assuring the goblin child that she can leave Mide's rescue to you.<br><br>Is Quickthinx truly an all-knowing traveler from the future? Does the soul of Mide's beloved still live on in the heart of the machine? Once again, each answer has given rise to yet more questions, and the steel giant beckons you within once more..."],"objectives":["Enter the Breath of the Creator.","Report to Biggs."],"dialogue":[{"name":"MIDE","text":"Even if we succeed in freeing Roundrox, what will remain of the girl we once knew? To the Illuminati, she's little more than a cog in their divine machine. They need her alive, aye, but no more than that. And they will not have scrupled to use any means necessary to force her compliance..."},{"name":"WEDGE","text":"Backrix said he saw Shanoa standing on top of the colossus, at Quickthinx's side, just as you'd expect her to be. Do you reckon Backrix's new pet is just a long-lost littermate? The resemblance is truly uncanny!"},{"name":"BIGGS","text":"Ready to head back into the belly of the beast, <span class=\"highlight\">Forename</span>? All right, let's get this rescue mission off the ground! First, some good news: while the barrier was down, we were able to get our first good look inside Alexander's innards."},{"name":"BIGGS","text":"Far as we can tell, Roundrox is being held captive in what seems to be the central control chamber of the whole colossus─called, helpfully, “Central Control.” As to how we reach it, do you remember when you infiltrated Midas, there was that cavernous room with a dirty great city in it? Aye, well, we've spotted one of those floating platforms which goes back and forth between there and the place we need to get to."},{"name":"BIGGS","text":"The quickest route to the city is straight through the giant's head. You'll go in through the hatch you opened for us last time, take care of any guards, and secure the platform I mentioned. Meanwhile, the chief and the others will be making their way to you via Midas, after setting out in advance to sweep the place for any nasty surprises. Once you've all rendezvoused, it'll be time to storm the control room, while me and Wedge stage a little diversion. Got all that? Good! Then let's crack some Illuminati skulls!"},{"name":"SYSTEM","text":"You now have access to the Breath of the Creator. Alexander can be accessed via the entrance in the Makers' Quarter."},{"name":"MIDE","text":"I will go with Cid and Y'shtola, and rid Midas of any lurking Illuminati ambushers. Roundrox is counting on us, friend. Be safe, and I will see you on the inside."},{"name":"BIGGS","text":"The Illuminati are holding Roundrox captive in Alexander's central control room. Your task is to go in through the head and secure the platform that'll take us there. You can expect it to be well guarded, but don't you worry─we'll be right behind you!"},{"name":"WEDGE","text":"We are ninety-nine percent certain that the <span class=\"emphasis\">Enigma Codex</span> is also in Central Control, both it and Roundrox being required to operate the colossus. Intriguingly, the platform which will take us there seems to have been installed quite recently. One can only assume that the original design sought to make the place less readily accessible for reasons of security. Happily, however, the Illuminati favored a more practical arrangement."},{"name":"CID","text":"Excellent work, old friend! That platform is our shortcut to the heart of the machine. All seems quiet on our front, so─ Seven hells! We've got company!"},{"name":"CID","text":"Ah, there you are, <span class=\"highlight\">Forename</span>! We were met by a small welcoming party, but it was nothing we couldn't handle. Biggs and Wedge just contacted me as well─they're headed here as we speak."},{"name":"MIDE","text":"Roundrox!"},{"name":"CID","text":"So this is the <span class=\"emphasis\">Enigma Codex</span>..."},{"name":"YSHTOLA","text":"And that must be the third and final core. Twelve have mercy... If you could but see the volume of aether issuing from it..."},{"name":"ROUNDROX","text":"Pssshkoh... Yes... Much swirlybright... Timewings...can spread... Travel to overtimes... Make bad things...good again..."},{"name":"MIDE","text":"Could it be...? Do we truly have the power to change the past? I could erase my mistakes... I could <span class=\"emphasis\">see him again</span>..."},{"name":"ROUNDROX","text":"Three... Three years ago... Mide lost dear one... Mide wants dear one back, yes? Roundrox... Roundrox helps Mide..."},{"name":"MIDE","text":"Roundrox, no! You must save your strength!"},{"name":"ROUNDROX","text":"Mide...worries too much. Roundrox is strong gobbie... Uplanders...hold on to braincases. Timewings...spread!"},{"name":"CID","text":"Seven hells, has the girl gone mad!? Stop this, Roundrox! STOP, I say!"},{"name":"WEDGE","text":"Uh, Biggs...? Wh-Where are we? And why is everything...spinning?"},{"name":"CID","text":"Biggs! Wedge! Can you hear me? Roundrox has engaged Alexander's time-distortion mechanism. We're hurtling into the past!"},{"name":"BIGGSWEDGE","text":"(-Biggs and Wedge-)We're...<span class=\"emphasis\">what</span>?"},{"name":"WEDGE","text":"B-Biggs, over here! You're not going to believe this!"},{"name":"BIGGS","text":"Eh? What's Mide doing down there with those─ Hold on! They're performing the summoning ritual! BUGGER ME! We really <span class=\"emphasis\">are</span> in the past!"},{"name":"CID","text":"What in the seven hells...? Someone's taken control of the colossus! Hold tight─I think it's about to go berserk!"},{"name":"DAYAN","text":"Damn it all! This isn't right! We must abort the summoning! Quickly, Mide! The seal!"},{"name":"MIDE","text":"Dayan... No!!!"},{"name":"BACKRIX","text":"Pshhh... Shkohhh...!?<br>What is meddlemaking kitten doing!?"},{"name":"YSHTOLA","text":"...'Twould seem we are back in our own time."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh...<br>Past is made right, and we return to nowtimes. Treasure hunter's friends die─as it is writ, as it must be. Uplanders serve Quickthinx well today."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh...<br>Uplanders are not grasping meaning? Quickthinx breaks into bittypieces, fit in uplanders' tiny braincases. Time is flat roundshape. All things uplanders and gobbies did, are doing, and will do─doings happen over and over and over again. For alltimes."},{"name":"CID","text":"So, when Mide and her friends attempted to summon Alexander three years ago, what they <span class=\"emphasis\">actually</span> saw was <span class=\"emphasis\">us</span> traveling back in time!? But that's... That's madness!"},{"name":"MIDE","text":"...Time is an endless circle? My failure, my pain, my suffering... It was all doomed to unfold like this from the very beginning?"},{"name":"YSHTOLA","text":"...Let us away. Quickly!"},{"name":"ROUNDROX","text":"Mide! Mide must hurry!"},{"name":"MIDE","text":"...No. Nothing remains for me out there. My future, my past, my reason for being... It all ended...before it ever began."},{"name":"ROUNDROX","text":"Mide! <span class=\"emphasis\">MIIIDE</span>!!!"},{"name":"WEDGE","text":"Good to see you safe, <span class=\"highlight\">Forename</span>! Whatever happened inside the control room, anyway? As for us... On second thought, let's save that for another day."},{"name":"BACKRIX","text":"Pshhhkohhh... Pshhhkohhh...<br>Uplander has seen Roundrox? Backrix hopes she is safe... As for Backrix... Pshhhkohhh... Backrix is not liking highplaces much anymore."},{"name":"BIGGS","text":"Chief, Y'shtola...and Roundrox! Gods, I've never been so bloody glad to see you! I thought we'd never make it back in one─ Wait, where's Mide?"},{"name":"ROUNDROX","text":"Pshhhkohhh...<br>Mide stays behind in giant of whirlycogs. All because of Roundrox! Roundrox must go back to giant of whirlycogs! Save Mide!"},{"name":"CID","text":"You leave that to us, child. Wedge! Get Jessie on that linkpearl and tell her to bring the <span class=\"emphasis\">Excelsior</span> around!"},{"name":"CID","text":"Though I don't much care for the answer, we finally know the truth behind the events of that day three years past. The Illuminati masterminded the massacre and─through some ungodly trick of time─'twas <span class=\"emphasis\">us</span> that brought them there to do the deed."},{"name":"BIGGS","text":"And what about Mide? The only thing keeping her going was the hope that her beau's soul lived on in the machine... But seeing what happened to the poor bastard..."},{"name":"YSHTOLA","text":"Aye...we witnessed the truth with our own eyes. Sucked into the core of the colossus to sate the primal's appetite. If aught remains of him, it is no more than heat and light."}],"reward":{"gil":3508,"xp":0,"instance":30040},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67871]},"next":[67873]},"partials":[{"type":"npc","id":"1017932","obj":{"i":1017932,"n":"Biggs","l":2001,"q":2}},{"type":"npc","id":"1017938","obj":{"i":1017938,"n":"Biggs","l":2001,"q":1}},{"type":"npc","id":"1017933","obj":{"i":1017933,"n":"Wedge","l":2001,"q":2}},{"type":"npc","id":"1017934","obj":{"i":1017934,"n":"Mide","l":2001,"q":2}},{"type":"npc","id":"1017939","obj":{"i":1017939,"n":"Wedge","l":2001,"q":1}},{"type":"npc","id":"1017940","obj":{"i":1017940,"n":"Backrix","l":2001,"q":1}},{"type":"instance","id":"30040","obj":{"i":30040,"n":"Alexander - The Breath of the Creator","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":230}},{"type":"quest","id":"67871","obj":{"i":67871,"n":"The Coeurl and the Colossus","g":16,"l":"The Dravanian Hinterlands","s":11,"f":1}},{"type":"quest","id":"67873","obj":{"i":67873,"n":"Thus Spake Quickthinx","g":16,"l":"The Dravanian Hinterlands","s":13,"f":1}}]}