{"quest":{"name":"Recondition the Anima","location":"Idyllshire","id":67870,"patch":3.3,"sort":0,"repeatable":1,"eventIcon":60091,"issuer":1017108,"target":1017108,"genre":0,"usedItems":[15841],"journal":[],"objectives":[],"dialogue":[{"name":"SYSTEM","text":"By reconditioning the anima, you can redistribute the attribute points allocated to your weapon."},{"name":"SYSTEM","text":"You may only recondition the anima of the weapon equipped when speaking with Ulan."},{"name":"SYSTEM","text":"The process can be canceled at any time."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Recondition the anima of a different weapon."},{"name":"A2","text":"Recondition the anima of your equipped weapon."},{"name":"SYSTEM","text":"In order to recondition the anima of a weapon, you must first equip it, then speak with Ulan."},{"name":"SYSTEM","text":"In order to recondition the anima of a weapon, you must first equip it, then speak with Ulan."},{"name":"SYSTEM","text":"You must equip your anima weapon before speaking with Ulan to proceed."},{"name":"SYSTEM","text":"You must equip both the Sword and Shield of the Twin Thegns before speaking with Ulan to proceed."},{"name":"ULAN","text":"Ardashir tells me you wish to alter the state of the anima, is that right?"},{"name":"ULAN","text":"Assuming we do not attempt to push beyond its current limitations, this should be a trivial matter."},{"name":"ULAN","text":"Mind you, this process requires crystal sand. If you have none, I will gladly furnish you with more per our original arrangement."},{"name":"ULAN","text":"But you need not worry about umbrite. For this we require elementally aspected sand to ever so slightly alter the anima's aetherial composition."},{"name":"ULAN","text":"Unless you have any other questions, let us begin!"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Recondition the anima."},{"name":"A2","text":"Exchange items for crystal sand."},{"name":"A3","text":"Ask about reconditioning."},{"name":"A4","text":"Nothing."},{"name":"ULAN","text":"You appear to be out of crystal sand, my friend. If you would have more, then I must ask you bring me supplies in exchange."},{"name":"ULAN","text":"To carefully modify the anima's aetherial composition, we must make use of crystal sand once more. The process is quite different from our previous endeavor, but thankfully much simpler."},{"name":"ULAN","text":"Nevertheless, it still requires a fair amount of crystal sand. If you require more, you must supply me with materials in exchange. A deal is a deal, after all."},{"name":"ULAN","text":"Oh, and you need not bother with the umbrite. Stripping the sand of its elemental aspect would be counterproductive this time."},{"name":"Q1","text":"Conclude your business with Ulan?"},{"name":"ULAN","text":"That went rather well, would you not agree? If you should have need of my services again, you have but to ask."},{"name":"SYSTEM","text":"The anima has been transformed, gaining newfound strength!"}],"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[67864]}},"partials":[{"type":"npc","id":"1017108","obj":{"i":1017108,"n":"Ulan","l":2082,"q":2}},{"type":"item","id":"15841","obj":{"i":15841,"n":"Crystal Sand","l":1,"c":21229,"t":54}},{"type":"quest","id":"67864","obj":{"i":67864,"n":"A Dream Fulfilled","g":74,"l":"Azys Lla","s":6,"r":1,"f":1}}]}