{"quest":{"name":"Two Sides of a Coin","location":"Coerthas Central Highlands","id":67879,"patch":3.4,"sort":3,"eventIcon":71201,"issuer":1017724,"target":1006325,"involved":[1007478,1012380,1016205,1016818,1017725,1017726,1017728,1017729],"genre":5,"journal":["Alphinaud would like nothing more than to get out of the snow.","A few brief moments standing in the snow is more than enough for Alphinaud to realize that this is neither the time nor the place to think deeply on recent events. While the House Fortemps knights return to Camp Dragonhead and prepare a report, he would head for the Congregation both to brief Ser Aymeric and to see if his sister's condition has at all improved.","Ser Aymeric escorts you and Alphinaud to Alisaie's room, where Thancred, Y'shtola, and Tataru are already waiting. There, Alphinaud is relieved to find that his sister has regained consciousness and is well on her way to a full recovery. Per Y'shtola's request, you proceed to give your account of all that occurred in Xelphatol, prompting a debate as to the credibility of the Warrior of Darkness's claims. When all have had their say, however, the Scions agree only that their foes' attempts to spur the beast tribes to summon ever stronger primals cannot be allowed to continue.<br><br>Thancred then reveals that he and Alisaie have uncovered evidence suggesting that the Ascians are behind a plot to furnish several beast tribes with a steady stream of crystals. On the understanding that severing their supply lines would do much to slow the escalation, it is decided that the others─Ser Aymeric included─will attempt to determine the Ixal and the Gnath's source. You and Alphinaud, meanwhile, will visit Urianger to find out if his wealth of knowledge concerning primal beings might be put to good use. When Alisaie subsequently insists that she be allowed to accompany you, Alphinaud seems poised to refuse her, only to relent in the face of her steely-eyed determination. All that remains is to wait for her to finish changing into her new outfit─yet another original creation of Tataru's fecund imagination.","After a brief moment of reflection─and a missed opportunity to hear an anecdote about Alphinaud's boyhood indiscretions─you and the twins are finally ready to depart. With luck, your visit to the Waking Sands will prove fruitful.","To your delight, Urianger appears to be well aware of the Warriors of Darkness and their recent activities, and he provides you with a promising new lead: the kobolds of Vylbrand are rumored to be on the verge of summoning Titan once more. Satisfied, you and Alphinaud prepare to depart for Camp Overlook in outer La Noscea, but your departure is delayed by Alisaie, who requests that Urianger look into some of the specific claims made by the Warriors of Darkness. She suggests that <span class=\"emphasis\">The Gerun Oracles</span> may hold the answers─though the frosty manner in which she addresses the scholar raises a host of other questions...","In Camp Overlook, you find a grim Commander Bloeidin muttering to himself about the need for reinforcements. Upon learning of your intent, however, his face splits into a wide grin. It would seem that the Scions of the Seventh Dawn have arrived in Vylbrand in the nick of time."],"objectives":["Speak with Aymeric at the Congregation of Our Knights Most Heavenly.","Speak with Alphinaud.","Speak with Urianger at the Waking Sands.","Speak with Bloeidin at Camp Overlook in outer La Noscea."],"dialogue":[{"name":"CAVALRYA02342","text":"'Twas a pleasure to work with you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I pray the Fury grants me the opportunity to do so again."},{"name":"CAVALRYB02342","text":"Seems our work here is done. No reason to linger any longer than we have to, eh?"},{"name":"ALPHINAUD","text":"Forgive me, this is neither the time nor the place for idle introspection."},{"name":"ALPHINAUD","text":"The knights can apprise Lord Edmont of our success, and we the lord commander. More importantly, I should like to see if my sister's condition has improved..."},{"name":"ALPHINAUD","text":"You may take a moment for yourself if you wish. I will be at the Congregation."},{"name":"ALPHINAUD","text":"Ah, there you are. Shall we make our report?"},{"name":"AYMERIC","text":"It brings me joy to see you safely returned to us, <span class=\"highlight\">Forename</span>. What news from Xelphatol?"},{"name":"AYMERIC","text":"...Then we were not too late. On behalf of Ishgard, I offer you my deepest thanks."},{"name":"AYMERIC","text":"As for we who remained behind─Mistress Y'shtola has been tending to Mistress Alisaie in your absence...and I am pleased to report that she has regained consciousness."},{"name":"AYMERIC","text":"I imagine you have many questions, especially given your recent encounter with the Warriors of Darkness. I know I do."},{"name":"AYMERIC","text":"Come, let me show you to her room. Do not worry, her condition is much improved. She is a resilient one, much like her brother."},{"name":"ALPHINAUD","text":"Would I be right in assuming that you have not spoken with my sister since...one of the memorial services, was it?"},{"name":"ALPHINAUD","text":"By the Twelve, it seems a lifetime ago. I should like to think we have both grown since then..."},{"name":"ALPHINAUD","text":"It has been many moons since last we worked together...though I believe the same cannot be said of the two of you."},{"name":"ALPHINAUD","text":"Aye, I confess, I was aware of your subterranean expedition─of your search for the truth of the Calamity."},{"name":"ALPHINAUD","text":"I considered involving myself with her venture for a time, but as you know all too well, circumstances conspired to keep us apart. I can only assume she carried on in our absence..."},{"name":"ALPHINAUD","text":"It was good of you to accompany my sister on her forays into the coils. The knowledge that you were with her did much to put my mind at rest."},{"name":"ALPHINAUD","text":"Though I know not what she found at the end of her search, Deks and Sinis did inform me that she had taken to the road on her own, apparently on a journey of self-discovery..."},{"name":"ALPHINAUD","text":"And what came of <span class=\"emphasis\">that</span> I can only speculate. I am glad our paths crossed, regardless."},{"name":"ALPHINAUD","text":"...To think that the three of us plumbed the depths of the coils and confronted Bahamut himself. Had I not been there, I would struggle to believe it."},{"name":"ALPHINAUD","text":"Shortly after we parted ways, I heard that she had taken to the road on her own, apparently on a journey of self-discovery. Precisely where to I never learned, though I suspect that was by design."},{"name":"ALPHINAUD","text":"...So she enjoyed hearing tales of our exploits, did she? Hmm..."},{"name":"ALISAIE","text":"My apologies for keeping you waiting."},{"name":"ALISAIE","text":"Right, then. Shall we be off?"},{"name":"ALPHINAUD","text":"Tataru never ceases to impress... Though, for a moment, I feared she might furnish you with an identical outfit."},{"name":"ALISAIE","text":"Praise the Twelve she did not! Mother and Father were rather too fond of making us wear matching clothes."},{"name":"ALISAIE","text":"Do you remember that time at the Studium when that girl of yours crept up behind me in the hall and whispered─"},{"name":"ALPHINAUD","text":"Sister, please! She was not my─ Ahem, can we not have this conversation in front of the <span class=\"emphasis\">Warrior of Light</span>!?"},{"name":"ALISAIE","text":"So be it. Another time, perhaps."},{"name":"ALISAIE","text":"It is an honor, <span class=\"highlight\">Forename</span>. I realize we are barely acquainted, but having heard so much about you, it hardly feels that way."},{"name":"ALISAIE","text":"I should thank you again for your assistance with my expeditions, <span class=\"highlight\">Forename</span>. Though we left matters somewhat unfinished, I am nevertheless prepared to focus on the task at hand and aid you to the fullest extent of my ability."},{"name":"ALISAIE","text":"As you helped me to brave the coils, so too will I help you to defeat the Warriors of Darkness."},{"name":"ALISAIE","text":"To be honest, <span class=\"highlight\">Forename</span>, I wasn't planning on seeking you out just yet. When I set forth on my journey, I did so with grand ambitions. As you may recall, I promised I would not disappoint you..."},{"name":"ALISAIE","text":"I pray you will forgive me if I do."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A pleasure to have you with us."},{"name":"A1","text":"I've been meaning to ask about the carriage..."},{"name":"A1","text":"Welcome to the fight."},{"name":"ALPHINAUD","text":"Ah, yes, the carriage that so fortuitously arrived to spirit us away from Ul'dah after the banquet."},{"name":"ALPHINAUD","text":"The driver informed me that I had my sister to thank for his presence in Ul'dah. How did you know to send help?"},{"name":"ALISAIE","text":"Oh, drunken Brass Blades are even less discreet than sober ones. Unfortunately, by the time I learned of the plot, it was too late to do anything more. Frankly, I'm still amazed <span class=\"alternative-container\"><span class=\"alternative\">Brennan</span><span class=\"alternative\">Bremondt</span><span class=\"alternative\">Brendt</span></span> managed to find you."},{"name":"ALPHINAUD","text":"New garments aside, I must say that you seem different─more...<span class=\"emphasis\">resolute</span> than when last we met. You have the look of a woman who is ready to fight for the future of Eorzea."},{"name":"ALISAIE","text":"To the extent of my abilities, perhaps, but I have no delusions of grandeur. Nor will I pretend to have “found myself” or any such thing."},{"name":"ALISAIE","text":"I am here today because I would regret it if I weren't. That is all."},{"name":"ALPHINAUD","text":"Fair enough. Let us depart for the Waking Sands, then, and see if Urianger can be of assistance."},{"name":"ALPHINAUD","text":"Urianger─apologies for calling upon you unannounced."},{"name":"URIANGER","text":"Why, Master Alphinaud. Would that the Scholar had seen fit to grant me knowledge of thy coming. What bringeth thee and thine here this day?"},{"name":"ALPHINAUD","text":"The Warriors of Darkness have returned. Pray allow us to explain..."},{"name":"URIANGER","text":"...I too have heard tales in recent days of primal beings rising up only to be cast down by forces unknown."},{"name":"URIANGER","text":"Alas, as thou didst observe, this serveth but to spur the beast tribes to pursue their goals with redoubled fervor."},{"name":"ALPHINAUD","text":"We have two objectives at this time: to identify and remove the source of the beast tribes' crystals, and to take direct action to prevent any further summoning rituals from reaching completion."},{"name":"ALPHINAUD","text":"The second is easier said than done, of course. While we were fortunate enough to learn of the Ixal's plans before they came to fruition, I should be surprised if the Warriors of Darkness and the Ascians did not have similar designs elsewhere of which we have no knowledge."},{"name":"URIANGER","text":"Thou wert wise to come hither, for this very day did I receive tidings most troubling from across the Strait of Merlthor."},{"name":"URIANGER","text":"O'Ghomoro stirreth, and there are whispers that the Lord of Crags neareth his return. Mere rumors, mark thou─but in light of thine own discoveries..."},{"name":"URIANGER","text":"...Thou canst ill afford to turn a deaf ear to their claims."},{"name":"ALPHINAUD","text":"Aye─we must ascertain the truth of the matter for ourselves. Let us consult with the Maelstrom forces stationed at Camp Overlook, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"Thank you for your counsel, Urianger. Pray inform us should you learn aught else."},{"name":"URIANGER","text":"I shall."},{"name":"ALISAIE","text":"If I may, Brother─ Urianger, is there anything else you would like to say?"},{"name":"ALPHINAUD","text":"Alisaie?"},{"name":"ALISAIE","text":"...If not, then never mind. I only ask because you are normally rather more...<span class=\"emphasis\">verbose</span>."},{"name":"ALISAIE","text":"Nothing to add? Very well. Ere we depart, I wish to make a request. The Warriors of Darkness spoke of how the Ardor had the power to “break down the barriers between planes,” that our worlds might be rejoined. I would ask that you research this for us."},{"name":"ALISAIE","text":"Being nowhere near as well-read as you, I'm sure I wouldn't know where to begin. That said, I have heard tell of a promising tome: <span class=\"emphasis\">The Gerun Oracles</span>. Mayhap you could start there."},{"name":"URIANGER","text":"...By thy leave."},{"name":"ALISAIE","text":"Camp Overlook, was it? Very well."},{"name":"URIANGER","text":"We shall speak anon, <span class=\"highlight\">Forename</span>. I prithee attend Master Alphinaud and Mistress Alisaie."},{"name":"ALPHINAUD","text":"Come, let us speak with Commander Bloeidin and see if there is any truth to these rumors concerning Titan's return."},{"name":"ALISAIE","text":"&lt;sniff&gt; &lt;sniff&gt; ...That had better be the sulphur."},{"name":"BLOEIDIN","text":"Seven hells, at this rate, I'll have to appeal to Maelstrom Command for reinforcements..."},{"name":"BLOEIDIN","text":"Hm? Whatever it is, we don't want any."},{"name":"BLOEIDIN","text":"Well, fancy that! Just when my kobold problems look like coming to a head, the Scions of the Seventh Dawn turn up, itching to pitch in!"},{"name":"BLOEIDIN","text":"Bloody <span class=\"emphasis\">brilliant</span> timing is what it is! Right, then─let's get to it!"}],"reward":{"gil":1912,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67878]},"next":[67880]},"partials":[{"type":"npc","id":"1017724","obj":{"i":1017724,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"npc","id":"1007478","obj":{"i":1007478,"n":"Urianger","l":356,"q":25}},{"type":"npc","id":"1012380","obj":{"i":1012380,"n":"Aymeric","l":2300,"q":5}},{"type":"npc","id":"1016205","obj":{"i":1016205,"n":"Alphinaud","l":2300,"q":1}},{"type":"npc","id":"1016818","obj":{"i":1016818,"n":"Alphinaud","l":2300,"q":4}},{"type":"npc","id":"1017725","obj":{"i":1017725,"n":"Steadfast House Fortemps Knight","l":63,"q":2}},{"type":"npc","id":"1017726","obj":{"i":1017726,"n":"Earnest House Fortemps Knight","l":63,"q":2}},{"type":"npc","id":"1017728","obj":{"i":1017728,"n":"Alphinaud","l":350,"q":3}},{"type":"npc","id":"1017729","obj":{"i":1017729,"n":"Alisaie","l":350,"q":2}},{"type":"quest","id":"67878","obj":{"i":67878,"n":"Shadows of the First","g":5,"l":"Fortemps Manor","s":2}},{"type":"quest","id":"67880","obj":{"i":67880,"n":"Unlikely Allies","g":5,"l":"Outer La Noscea","s":4}}]}