{"quest":{"name":"Shadows of the First","location":"Fortemps Manor","id":67878,"patch":3.4,"sort":2,"icon":100582,"eventIcon":71201,"issuer":1017721,"target":1017724,"involved":[1017720,1017722,1017723,1017725,1017726],"genre":5,"journal":["As Alphinaud and many others know all too well, there is no rest for the righteous.","Regardless of whether or not the Warriors of Darkness intend to kill Garuda, the fact remains that a primal summoning cannot be ignored, and should be prevented if at all possible. After some discussion, it is decided that you and Alphinaud will enter the Ixali homeland of Xelphatol by means of a mountain pass east of Camp Dragonhead. To see you to your destination with all haste, Lord Edmont will order a contingent of knights to secure the entrance and escort you as far as they are able. With the details settled, Alphinaud invites you to accompany him to Camp Dragonhead, where you may procure any additional supplies prior to departing for Xelphatol.","In Camp Dragonhead, you are informed that the House Fortemps knights took the initiative to launch an attack on the Ixali forces guarding the entrance to the mountain pass, rendering it safe well in advance of your arrival. The enemy's gate lies open, and you and Alphinaud need only walk through.","The knights salute as you approach and state that their scouts have observed increased activity around the First Mountain. Anticipating heavy resistance, Alphinaud reminds you of the need to advance with care as you search for the site of the summoning ritual. If the gods are good, you will only have to deal with some few patrols, but if not, you may be forced to do battle with the Warriors of Darkness once more...<br><br>※Challenge Xelphatol with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","In the shadow of the First Mountain, you confront the Ixali occultist overseeing the summoning ritual, and in a pitched battle manage to lay him low. Having put an end to the beastmen's ambitions, you prepare to return to Coerthas.","Before you can make good your escape, you find yourselves face–to–face with the Warriors of Darkness. Rather than engaging you in battle a second time, their leader proceeds to set out their reason for consorting with the Ascians.<br><br>He claims that he and his comrades hail from another world─a reflection of the Source─in which the power of Light is far greater than that of Dark. There, they easily bested their Ascian counterparts, only to discover that they had upset the primordial balance in so doing, triggering a flood of Light which now threatens to consume all that they sought to protect. If nothing is done, their world will soon give way to a void...as did the Thirteenth, when the Dark rose up unopposed. And so, to prevent this fate, they joined hands with the Ascians and came to the Source. Here, they intend to bring about another Umbral Calamity, for only through such unbridled destruction may the barriers between planes be broken down, and the First and the Source made one.<br><br>Incredulous, Alphinaud demands further answers, but the Warrior of Darkness will say no more, declaring in parting that he and his comrades will do whatever it takes to see your worlds rejoined.","To what ends must we labor for the sake of those we love? Is there any cause so noble that it may be used to justify any deed? Though he is shaken by their words, Alphinaud's resolve remains firm. Regardless of their reasons, the Warriors of Darkness cannot be allowed to achieve their goals. The sacrifice, the loss─it ends here."],"objectives":["Speak with Alphinaud at Camp Dragonhead.","Speak with the steadfast knight.","Enter Xelphatol.","Speak with Alphinaud."],"dialogue":[{"name":"AYMERIC","text":"Though I am not sure I grasp the full implications of her words, I know we dare not ignore them."},{"name":"EDMONT","text":"Warriors of Darkness? Xelphatol? What is this all about?"},{"name":"ALPHINAUD","text":"So the Warriors of Darkness and the Ascians are conspiring to bring about Garuda's summoning, that they might put her to the sword..."},{"name":"ALPHINAUD","text":"Then when we first encountered them in Loth ast Gnath...when they were confronting Ravana... Gods, has this been their aim all along?"},{"name":"EDMONT","text":"What do you intend to do, Master Alphinaud?"},{"name":"ALPHINAUD","text":"There is much and more I do not understand, but I know this: a primal summoning cannot be ignored."},{"name":"ALPHINAUD","text":"Alisaie risked her life to uncover this plot, and we squander her gift at our peril. <span class=\"highlight\">Forename</span>, will you accompany me to Xelphatol and help me stop the Ixal's ritual?"},{"name":"AYMERIC","text":"Given that Ishgard shares a border with the Ixali homeland, we have a vested interest in the outcome of this ritual."},{"name":"AYMERIC","text":"We have been willing to suffer the beastmen's intrusions into Coerthan lands to a point, but the summoning of a primal is an escalation we cannot abide."},{"name":"AYMERIC","text":"You shall have our fastest airship, Master Alphinaud. The mountains of Xelphatol are not easily traversed, and this endeavor demands all haste."},{"name":"ALPHINAUD","text":"The gesture is most appreciated, Ser Aymeric─but I fear an aerial approach is destined to fail. This is their homeland, after all, and Ixali dirigibles are not to be underestimated."},{"name":"ALPHINAUD","text":"No, experience tells me the only conceivable approach is by land. I believe it would be wiser to cross into Xelphatol by way of the mountain pass east of Camp Dragonhead."},{"name":"EDMONT","text":"In that case, I shall send instructions for a contingent of the camp's knights to be placed at your disposal. They will secure you safe passage through the mountains, and escort you thence to Xelphatol."},{"name":"EDMONT","text":"Though my men are unqualified to confront a primal, they are more than capable of contending with the Ixal."},{"name":"ALPHINAUD","text":"We should be glad of their assistance, Lord Edmont."},{"name":"AYMERIC","text":"In the event Mistress Alisaie regains consciousness, we will share with you any additional information she may provide. May the Fury watch over and keep you safe."},{"name":"ALPHINAUD","text":"Then let us be off. We can procure any additional supplies we require in Camp Dragonhead."},{"name":"EDMONT","text":"I shall send word to the acting commander at Camp Dragonhead of your imminent arrival.<br>Who knows...this may even spur me to nominate a permanent replacement. I have put off the task for far too long..."},{"name":"ALPHINAUD","text":"Have you everything you require, then? Excellent."},{"name":"ALPHINAUD","text":"The entrance to the pass is north of Natalan and due east of Camp Dragonhead."},{"name":"ALPHINAUD","text":"Though it is normally guarded by a score of Ixali warriors, I have been informed that House Fortemps knights have already dispatched them."},{"name":"ALPHINAUD","text":"The enemy's gate lies open. We need but walk through."},{"name":"ALPHINAUD","text":"Beyond this gate lies the trail which will lead us into Xelphatol. According to my map, it looks to be a relatively straightforward route, albeit one through exceedingly dangerous territory."},{"name":"CAVALRYB02342","text":"We have everything in hand here, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! No need to worry! And may I say what an honor it is to work with you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"CAVALRYA02342","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, Master Alphinaud. As you can see, the gate is ours."},{"name":"CAVALRYA02342","text":"Be advised that our scouts are reporting increased activity around the First Mountain. Simply put, they are up to something, and don't want anyone interfering."},{"name":"CAVALRYA02342","text":"We stand ready to escort you to Xelphatol and aid you as you see fit."},{"name":"ALPHINAUD","text":"The enemy will be thick on the ground. Upon arriving, let us advance with care as we search for the site of the summoning ritual."},{"name":"ALPHINAUD","text":"If the gods are good, we should only have to contend with the Ixal─but if they are <span class=\"emphasis\">not</span>, we may be forced to do battle with the Warriors of Darkness..."},{"name":"ALPHINAUD","text":"Come, my friend, let us make for Xelphatol!"},{"name":"CAVALRYA02342","text":"I won't lie to you: the trail will be hellish. But stick close and we'll see you safely through."},{"name":"CAVALRYA02342","text":"Well fought, well fought indeed! Lord Edmont will be pleased to learn that everything went according to plan."},{"name":"CAVALRYB02342","text":"All quiet here, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Nary a peep from the birdmen."},{"name":"ALPHINAUD","text":"All things considered, we should be grateful to have survived that encounter."},{"name":"ALPHINAUD","text":"...Do you think it could be true? That to save their world, they must bring ruin to ours?"},{"name":"ALPHINAUD","text":"No. No, it matters not. Such wanton destruction is beyond justification. Whatever their reasons, they must be stopped. The sacrifice, the loss─it ends here."}],"reward":{"gil":5000,"items":[{"id":16818}],"xp":16740,"instance":46},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67877]},"next":[67879]},"partials":[{"type":"npc","id":"1017721","obj":{"i":1017721,"n":"Alphinaud","l":2320,"q":2}},{"type":"npc","id":"1017724","obj":{"i":1017724,"n":"Alphinaud","l":63,"q":2}},{"type":"npc","id":"1017720","obj":{"i":1017720,"n":"Aymeric","l":2320,"q":2}},{"type":"npc","id":"1017722","obj":{"i":1017722,"n":"Count Edmont De Fortemps","l":2320,"q":2}},{"type":"npc","id":"1017723","obj":{"i":1017723,"n":"Alphinaud","l":63,"q":1}},{"type":"npc","id":"1017725","obj":{"i":1017725,"n":"Steadfast House Fortemps Knight","l":63,"q":2}},{"type":"npc","id":"1017726","obj":{"i":1017726,"n":"Earnest House Fortemps Knight","l":63,"q":2}},{"type":"item","id":"16818","obj":{"i":16818,"n":"Grounded Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"46","obj":{"i":46,"n":"Xelphatol","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":210}},{"type":"quest","id":"67877","obj":{"i":67877,"n":"Promises Kept","g":5,"l":"Ishgard","s":1}},{"type":"quest","id":"67879","obj":{"i":67879,"n":"Two Sides of a Coin","g":5,"l":"Coerthas Central Highlands","s":3}}]}