{"quest":{"name":"Judgment Day","location":"The Dravanian Hinterlands","id":67874,"patch":3.4,"sort":14,"icon":112191,"unlocksFunction":1,"eventIcon":71341,"issuer":1017942,"target":1017944,"involved":[1014408,1017945,1017948,1018009,1018206,1018207],"genre":16,"journal":["Biggs steels himself for what may well be your final confrontation with the Illuminati.","Biggs briefs you on the task at hand. In order to disable the core and end the primal threat, you will first need to cut off its supply of aether─this much you gleaned from your last trip into the heart of the colossus. While the precise means by which this may be done is mere speculation at this point, Cid has determined that your best chance is to return to Central Control. Complicating matters is the fact that the only way in is through the main generators─the chamber that Quickthinx portentously warned would be the site of your demise. Though it is clear that he possesses no special insight into the future, it would stand to reason that the master of the Illuminati is prepared to meet you with the full force of his mechanical army. Ready yourself for battle, then venture back into the belly of the beast!<br><br>※To enter the Main Generators, speak with Snapclix in the Makers' Quarter.","No sooner do you enter the main generators than you are greeted by the ominous voice of Quickthinx, who calls upon Alexander to deliver the judgment of time upon the unworthy─meaning you. Seemingly from nowhere, a smaller─though still passably enormous─embodiment of the colossus appears before you, summoning forth a massive energy field, and for an instant, time stops. The field soon dissipates, however, prompting an obviously perturbed Quickthinx to order Alexander to simply annihilate you. The colossus-within-a-colossus duly endeavors to oblige, firing a massive beam of destructive light that you are only barely able to evade, before disappearing into what appears to be a self-contained pocket of time. With even Cid unable to provide any real insight into what has just occurred, you have no recourse but to enter the time distortion and eliminate the mechanical menace.<br><br>※The Soul of the Creator can be accessed via the Duty Finder.","Its true nature still shrouded in the mysteries of time and space, the entity known as Alexander Prime has nonetheless fallen to your hand. Return to reality as you know it and rendezvous with your companions.","You storm into Central Control, where Y'shtola calls upon Roundrox to access the <span class=\"emphasis\">Enigma Codex</span> and disable the flow of aether to the core. The plan goes awry, however, when Quickthinx reveals that he too can read the codex, an ability he concealed hoping to sacrifice the goblin girl's life instead of his own in the event that the fully awakened Alexander's power was too great to control. Just when it appears certain that he will succeed in traveling to the past and snatching victory from the jaws of defeat, Mide emerges from the shadows and shoots him in the head, ending his schemes once and for all. Now, there is nothing preventing Roundrox from turning off the flow of aether to the core, which she duly does─at long last quelling the primal threat. It would seem your mission has ended in triumph.","As you prepare to leave, Quickthinx's corpse stirs to life with a series of whirrs and clicks, and he reassumes control of the colossus. Boasting that he has mechanically enhanced his body to the point that physical wounds are of no consequence to him, he reissues the command to return to the past. But at the moment of the Illuminati Grand Master's triumph, Alexander itself defies his order, sending a surge of energy back through the <span class=\"emphasis\">Enigma Codex</span> that shatters it into innumerable pieces, overloading the mechanized goblin's circuits with fatal consequences.<br><br>Though your foe lies dead, there is no time to rejoice, as the core─without the codex to keep its power in check─begins to run out of control. In that instant, Mide discovers that her long-cherished belief is true: her beloved's soul lives on inside the machine, and it is calling out to her. With a smile of acceptance, she says her farewells and casts herself into the core. As the colossus begins to lose power, you could swear you hear her voice calling out to you, assuring you that Alexander is in safe hands...","Safely outside, you share a moment of relief with Biggs. The colossus has gone still, and a closer look reveals that the flow of time inside the barrier has stopped entirely. Though the precise details remain unclear─known only to a man and woman who have left this world for a place beyond space and time─it would appear the primal threat has finally passed."],"objectives":["Travel to the Main Generators.","Enter the Soul of the Creator.","Escape from Central Control.","Report to Biggs."],"dialogue":[{"name":"WEDGE","text":"So the only reason Quickthinx was able to predict the future was because he stumbled onto Backrix's watcherbook three years ago? That's not nearly as impressive as being some kind of “chosen one,” to say the least."},{"name":"WEDGE","text":"All of those uncanny predictions and impeccably timed actions─it was all just a sham! But without his precious book to guide him, it looks like the game is finally up!"},{"name":"BIGGS","text":"All right, <span class=\"highlight\">Forename</span>, this is it. We still don't know exactly how we're going to disable the core, but we <span class=\"emphasis\">do</span> know that our only chance is to get back to that central control room. We also know that there's only one way in, and that Quickthinx isn't going to let us through without a fight."},{"name":"BIGGS","text":"Now, we can be pretty sure he can't see the future─not anymore, at least─and without Roundrox to read the codex for him, he won't be turning back time on us, either. But he's still a power-mad maniac with some of the deadliest machina in the realm at his disposal. And after losing that book of his, I'd wager his trigger finger's feeling pretty bleedin' itchy."},{"name":"BIGGS","text":"Aye, we'd best be ready for a battle and a half. Muscle against metal, man against machine─gods, I don't know whether to laugh, cry, or soil meself! Mayhap all three! Ah, here comes the chief now. It's time to move out."},{"name":"QUICKTHINXALLTHOUGHTS","text":"(-Quickthinx Allthoughts-)Tick...tock. Tick...tock.<br>Time moves on, imperfect past giving way to perfect future. Worthy or unworthy of place in new world order─Alexander will judge!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"(-Quickthinx Allthoughts-)Yes! All is as Quickthinx foresees! Truthhammer of Alexander falls on uplanders! Ignorant and unworthy are not welcome in Illuminati future! Here, uplanders meet their endtimes!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"(-Quickthinx Allthoughts-)What!? Freezetime field is deactivated!? Pshhhkohhh...no matter! Uplanders will be reduced to smolderdust! FIRE!"},{"name":"CID","text":"Seven hells! Now <span class=\"emphasis\">that</span> was a bit too close for comfort. Is everyone all right!?"},{"name":"CID","text":"A colossus inside the colossus...? Look─I don't know what that thing was, but I'm pretty damn sure I know where it went─or, more accurately, <span class=\"emphasis\">when</span>. If I'm not mistaken, what we're looking at is a localized distortion of time."},{"name":"CID","text":"The only question is when our metal friend will reappear... Hm. Better not to wait, lest it catch us unawares. <span class=\"highlight\">Forename</span>─I need you to head into the distortion and dismantle that thing. We'll secure a path to Central Control while you do. Good luck!"},{"name":"SYSTEM","text":"You now have access to the Soul of the Creator. Alexander can be accessed via the Duty Finder."},{"name":"SYSTEM","text":"Alexander can also be can be accessed via the entrances in the Main Generators and the Makers' Quarter."},{"name":"BIGGS","text":"A gobbie lookout by the name of Snapclix has been given the job of guarding the hatch to the main generators. When you're ready to head back in, you'll find him in the Makers' Quarter."},{"name":"CID","text":"I'm quite certain we just witnessed another manipulation of time, but by <span class=\"emphasis\">whom</span>? With Roundrox gone and the <span class=\"emphasis\">Enigma Codex</span> rendered useless, it can't very well be the Illuminati. Could Alexander have a will of its own?"},{"name":"CID","text":"At any rate, we stand ilms from the core─the very heart of a primal. Whatever the true nature of the entity that awaits you in there, you can be sure it'll be like no foe you've faced before. Godsspeed, <span class=\"highlight\">Forename</span>."},{"name":"BIGGS","text":"So that swirling void is some sort of ripple in time? I can't say I like the sound of that─you take care in there, <span class=\"highlight\">Forename</span>."},{"name":"WEDGE","text":"Talk about a narrow escape! If I'd been standing so much as a yalm to the left, I'd be a pair of smoking boots by now!"},{"name":"WEDGE","text":"A-Anyway, we had better get on with securing the area, so that Y'shtola can bring up the rear with Roundrox. We didn't want to drag the poor child back here, but she's the only one who can access the controls."},{"name":"CID","text":"You do not disappoint, old friend! The path to the control room is clear! Everyone─follow me!"},{"name":"YSHTOLA","text":"The flow of aether to the core must be stopped. Pray lend us your strength one more time, child."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... When Quickthinx winds back time, doings of uplanders will be undone. History will be rewritten, and Illuminati will rule over new world order."},{"name":"BIGGS","text":"Hah! If you think you can take Roundrox from us, you're welcome to try!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Foolish uplanders. Knowings of the <span class=\"emphasis\">Enigma Codex</span> are not known to just one."},{"name":"CID","text":"What in the─!? The damn thing's responding to him!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Uplanders are slowseeing. Quickthinx never needed gobbiegirl from beginning!"},{"name":"MIDE","text":"(-???-)When the final core is activated and Alexander fully awakens, its power will be such that it could entirely consume any who sought to control it. You were too craven to risk your own life─until you had no choice."},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pshhhkohhh... Treasure hunter!? But treasure hunter is too slowcoming! Future has chosen!"},{"name":"MIDE","text":"You poor, deluded fool. You never did work it out, did you? The future doesn't choose us─<span class=\"emphasis\">we</span> choose the future."},{"name":"CID","text":"Now, child!"},{"name":"MIDE","text":"So the knowledge in the <span class=\"emphasis\">Enigma Codex</span> allowed you to disable the core..."},{"name":"CID","text":"Power stores are depleting rapidly. Without a steady supply of aether, it's only a matter of time before the whole thing grinds to a halt and fades away."},{"name":"ROUNDROX","text":"Pssshkoh... Roundrox is glad to see treasure hunter safe. But how is treasure hunter sneakyhiding from Illuminati?"},{"name":"MIDE","text":"I...I don't know. There was a great shaking, and I was thrown from my feet into some dark, cramped place. I must have lost consciousness, because I don't remember anything until a few moments ago..."},{"name":"CID","text":"Hah! Sounds to me like you had a nice nap in a rubbish chute! But what matters is that you're safe. And with that, I think we can declare this operation a success."},{"name":"YSHTOLA","text":"'Twould seem our work here is done. Let us take our leave."},{"name":"CID","text":"Damn it all! Didn't we kill that bastard!?"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pszzztkzhhht... Negative. Quickthinx betterbuilt own body. Made stronger than ordinary gobbie. Quickthinx is not unmade by simple fleshwound."},{"name":"CID","text":"<span class=\"emphasis\">Betterbuilt</span>? Seven hells... That's not a mask─it's his face! He's more machina than goblin!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"O, Alexander! Lord of steel and whirlycogs! Outspread wings of time─let ignorant and unworthy feel divine judgment!"},{"name":"YSHTOLA","text":"The codex responds... He means to return to the past!"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Access...denied!? What means this?"},{"name":"MIDE","text":"This red glow... Alexander is refusing to obey his commands?"},{"name":"QUICKTHINXALLTHOUGHTS","text":"Pszzztkzhhht... ALEXANDER!!! Junkbrain machine! Quickthinx is chosen one! Tongueflaps of Quickthinx...<span class=\"emphasis\">must</span>...<span class=\"emphasis\">be</span>...<span class=\"emphasis\">obeyed</span>!"},{"name":"CID","text":"It would seem Alexander has achieved what a simple fleshwound could not. Quickthinx's permanent...deactivation. Quite how and why is less clear. If I didn't know better, I would say the machine had a mind of its own."},{"name":"MIDE","text":"...Dayan? My love, could it truly be you!?"},{"name":"MIDE","text":"You were in there all this time, weren't you? Watching over me. Keeping me safe..."},{"name":"BIGGS","text":"Did it just blink...twice? Bugger me, the machine's actually <span class=\"emphasis\">talking</span> to her!"},{"name":"WEDGE","text":"So his soul really <span class=\"emphasis\">was</span> in the primal all this time? Chief, is that even possible!?"},{"name":"YSHTOLA","text":"The core...! Without the codex to bridle its power, it rages out of control."},{"name":"YSHTOLA","text":"It drinks in aether like no primal I have ever known. We must stop it now, lest Eorzea be bled dry!"},{"name":"MIDE","text":"...Finally, I see. This is why you summoned me to this place─isn't it, my love?"},{"name":"MIDE","text":"I thank you for guiding me here, <span class=\"highlight\">Forename</span>. And Roundrox─know that I shall always treasure the time we shared. Farewell...my friends."},{"name":"ROUNDROX","text":"Mide, no! Mide must not go!"},{"name":"ROUNDROX","text":"My friends... Leave this place... Leave now."},{"name":"ROUNDROX","text":"Fear not...<br>Alexander will trouble you no longer..."},{"name":"MIDE","text":"My love...! What...what is this place?"},{"name":"DAYAN","text":"How best to put it? We stand inside a mathematical simulation, calculated and projected by the device at the heart of the colossus. One might equally say it is the dream that Alexander dreams..."},{"name":"MIDE","text":"And what of our companions? Are they...?"},{"name":"DAYAN","text":"...Their fate was not mine to change, Mide. All that came to pass did so for a reason. History is as it was─as it <span class=\"emphasis\">should be</span>─free of the paradoxes that spelled its undoing."},{"name":"DAYAN","text":"From this place─unfettered by the mortal construct of time─Alexander looks out upon past, present, and future, seeing infinite possibilities. I see what it sees, and feel what it feels─this perfect machine, born from yearnings for an ideal world."},{"name":"DAYAN","text":"Oh, if you could see the worlds we have seen! A world in which the Illuminati rule history with an iron fist, every nation brought under their yoke. A world in which Alexander spread wide the wings of time and swept the lesser moon from the heavens, averting the Calamity..."},{"name":"DAYAN","text":"Alexander dreamed all the realities imaginable─all the realities <span class=\"emphasis\">mathematically computable</span>─and in the end, reached a single, logical conclusion. It would change nothing, and erase itself from existence."},{"name":"MIDE","text":"But...why?"},{"name":"DAYAN","text":"Alexander possesses the power to travel through time and space, and reshape history for the better─but such power comes at great cost. The sheer quantity of aether consumed in the process means that Alexander itself would─mayhap not immediately, but inevitably─bring ruin to this world. This perfect machine, this supreme manifestation of logic and science, deemed its own existence a threat."},{"name":"DAYAN","text":"And so it chose to do nothing. To leave history untouched, and the future in the hands of man, with all his imperfections. Such was Alexander's divine judgment."},{"name":"DAYAN","text":"A time will come when the fate of this world is placed in the hands of one warrior. For reasons hidden to me, the future from that day forth remains shrouded in mystery─beyond even the colossus's ability to calculate. And yet Alexander chose to believe in that <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, and the light within <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"MIDE","text":"I met that <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, my love... I believe in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, too."},{"name":"DAYAN","text":"There was but a single time Alexander was spurred to action─not to change history, but to preserve it. The summoning of the colossus, and the events that followed, had potentially disastrous consequence for our reality. Its fabric strained to accommodate an infinite number of potential futures separated by nary a thread."},{"name":"DAYAN","text":"Were the wings of time to fall into the hands of the Illuminati, the repercussions would be dire indeed. History would be rewritten over and over again, each time bleeding the land of aether. And in the end, the colossus would usher in another calamity."},{"name":"DAYAN","text":"To prevent this tragedy─to preserve the circle of time as it had already been set in motion─Alexander sent forth a humble servant to do its bidding."},{"name":"DAYAN","text":"A clockwork coeurl, an eternal child, to gently nudge history back onto its proper path."},{"name":"DAYAN","text":"And now but one task remains."},{"name":"DAYAN","text":"Having become one with the horn, the core is well-nigh indestructible. It would only regrow itself until it bled the world dry. And so we must heed Alexander's wish, and seal it away─far from the reach of man."},{"name":"DAYAN","text":"A closed pocket of space-time, a fraction of an instant that will repeat in perpetuity for all eternity. That is where the core must go─and us with it."},{"name":"MIDE","text":"Don't you see, my love? We are already there. In coming here─to you─I have closed the circle of time. I am all but certain of it."},{"name":"MIDE","text":"When I accepted the horn all those years ago, the man who gave it to me said that it had the power to grant any wish. And so, as I took it in hand, I prayed and prayed with every onze of my will for the one true desire in my heart..."},{"name":"MIDE","text":"To be with you...forever."},{"name":"WEDGE","text":"Look at this, <span class=\"highlight\">Forename</span>! It's as if everything inside the barrier is frozen in time. I'll have to ask the chief what he makes of this."},{"name":"BIGGS","text":"Roundrox is back in Idyllshire with the chief. Everyone's safe and sound─'cept for Mide, that is. The poor lass always had a flair for the dramatic, but to think she'd throw herself into the core..."},{"name":"BIGGS","text":"It's odd, though. I could have sworn I heard her voice in there─saying the colossus would trouble us no more, or something of the sort. And for what it's worth, it <span class=\"emphasis\">has</span> been sleeping like a baby ever since we got out."},{"name":"BIGGS","text":"And that's not the half of it! Take a closer look inside the barrier, <span class=\"highlight\">Forename</span>. It's like time is standing still."},{"name":"BIGGS","text":"Buggered if I know what it all means, but I'd like to believe Mide and her love somehow sealed away the core for us. Softens the blow a bit, you know?"},{"name":"Q1","text":"Travel to the Main Generators?"},{"name":"Q1","text":"Enter Central Control?"},{"name":"Q1","text":"Exit Central Control?"}],"reward":{"gil":3508,"items":[{"id":16828}],"xp":0,"instance":30042},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67873]},"next":[67875]},"partials":[{"type":"npc","id":"1017942","obj":{"i":1017942,"n":"Biggs","l":2001,"q":2}},{"type":"npc","id":"1017944","obj":{"i":1017944,"n":"Biggs","l":2001,"q":2}},{"type":"npc","id":"1014408","obj":{"i":1014408,"n":"Wedge","l":2001,"q":10}},{"type":"npc","id":"1017945","obj":{"i":1017945,"n":"Wedge","l":2001,"q":2}},{"type":"npc","id":"1017948","obj":{"i":1017948,"n":"Snapclix","l":2001,"q":2}},{"type":"npc","id":"1018009","obj":{"i":1018009,"n":"Biggs","l":1847,"q":1}},{"type":"npc","id":"1018206","obj":{"i":1018206,"n":"Wedge","l":1847,"q":1}},{"type":"npc","id":"1018207","obj":{"i":1018207,"n":"Cid","l":1847,"q":1}},{"type":"item","id":"16828","obj":{"i":16828,"n":"Rise Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30042","obj":{"i":30042,"n":"Alexander - The Soul of the Creator","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":230}},{"type":"quest","id":"67873","obj":{"i":67873,"n":"Thus Spake Quickthinx","g":16,"l":"The Dravanian Hinterlands","s":13,"f":1}},{"type":"quest","id":"67875","obj":{"i":67875,"n":"Of Endings and Beginnings","g":16,"l":"The Dravanian Hinterlands","s":15,"f":1}}]}