{"quest":{"name":"One Life for One World","location":"Southern Thanalan","id":67885,"patch":3.4,"sort":9,"icon":100585,"eventIcon":71201,"issuer":1017762,"target":1017767,"involved":[1017750,1017751,1017763,1017764,1017765,1017766,1017768,1017769,1017770],"genre":5,"journal":["Alphinaud would keep moving forward.","If the false Griffin is to be believed, the crystals you seek are somewhere within the stronghold of Zahar'ak, where the Amalj'aa are presumably preparing to summon Ifrit. Given the gravity of the threat, you have no choice but to gather your comrades and proceed there at once. Alisaie has been waiting for Thancred for some time; hopefully the bard has finally arrived.","You tell Thancred and Alisaie of your recent reunion with Yda and Papalymo, and of your subsequent encounter with the false Griffin. At the mention of Ifrit's name, they agree without hesitation that you must make haste to the home of the Amalj'aa, for the Scions of the Seventh Dawn are duty-bound to combat the primal menace wheresoever it may arise.","Strangely, there appear to be no signs of increased activity, or anything else which might indicate that the Amalj'aa are preparing to summon Ifrit. Could it be that the false Griffin has made a fool of you? And if so, to what end? Though you are sorely tempted to march directly back to the Masks' camp, you must first complete your search, for only by venturing into the Bowl of Embers can you know for certain whether or not a ritual is taking place.","To your horror, you find the bodies of countless Amalj'aa waiting for you within the Bowl of Embers, and standing over them the Warriors of Darkness. This time, however, they are come not to slay a primal, but you, the Warrior of Light, in the belief that your death will plunge the realm into chaos and bring about another Umbral Calamity. They duly attack, but your allies are quick to rush to your defense─not least Alisaie, who conjures an aetheric blade before joining the fray.<br><br>The battle rages for a time, and eventually you feel the tide turning in your favor. But, in that instant, your counterpart unleashes a potent binding magic, and you and your allies suddenly find yourselves at the mercy of your opponents. Before they can administer the coup de grâce, however, Urianger appears from nowhere, and breaks the aetheric chains around you, revealing himself to have manipulated the Warriors of Darkness as a double agent. With the odds now even, the battle resumes, your enemies fighting with every onze of their strength to take your life.<br><br>When the dust finally settles, only you and yours remain standing. However, even in defeat, the Warriors of Darkness remain defiant, drawing forth Crystals of Light and proclaiming that you cannot defeat that which is eternal. It is then that Alphinaud realizes the horrible truth: these desperate men and women of the First are already dead. Bowing his head, their leader declares that they were humble adventurers chosen by the Mothercrystal to serve as Warriors of Light. They did everything that was asked of them, and yet, for all their efforts, and all their many triumphs, their world still fell to ruin. With naught left to say, they raise their crystals high, resolved to withdraw that they might one day return to carry on the fight. Seeing this, however, Urianger enjoins you to raise up your own Crystal of Light, and as it glows brighter and brighter in your hands, its radiance begins to blend with that of the others, until all is swallowed by incandescent, blinding white...<br><br>You open your eyes to find yourself in the aetherial sea, a familiar voice echoing in your ears. As the others struggle to comprehend what has happened, Urianger raises his hands to the heavens and cries out to Mother Hydaelyn, beseeching Her to grant you an audience with Minfilia in exchange for this bounty of Light. In answer, the Word of the Mother appears and addresses the fallen heroes of the First, declaring that she will travel to their world and draw the abundant Light unto herself, thus redressing the balance. Driven mad by this seemingly impossible reversal of fortunes, their leader makes to strike her down, but she halts his charge with a gesture, assuring him that she speaks true, and that his world will not fall to Light.<br><br>Turning to you and your allies, she then speaks as Minfilia once more, thanking Urianger for allowing her to see so many of her dearest friends one last time. His voice quavering, the Archon confesses to having orchestrated events to grant Minfilia her freedom, that she might then use her newfound powers to prevent the First from being lost to the void. Though this revelation prompts outrage in your allies, she reassures them that she is happy to have been given such an opportunity. As a final gesture, she entrusts to you Louisoix's broken staff, Tupsimati, praying that you will never have need of it.<br><br>Their journey at an end, the broken Warriors of Light have a simple request for your departing friend: “Take us with you. Take us home.” And so you bid farewell to them, and to brave Minfilia, who promises that one day, when she has found a way to free this star of her sorrow, she will return, just as you have always returned from your many adventures.","You cannot say when or how you all arrived back in Thanalan, but you are certain it was Minfilia's doing. While turning the day's events over in his mind, Alphinaud takes a moment to consider the fate of the Warriors of Darkness. If they were already dead, he reasons, a return to the First may very well mean their permanent demise... But perhaps, after all they had endured, that was their wish."],"objectives":["Speak with Alisaie.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"If we take the Griffin's double at his word, then the crystals are now somewhere within Zahar'ak...ready to be put to use by the Amalj'aa."},{"name":"ALPHINAUD","text":"We must apprise Alisaie of all we have learned. I will join you both in Little Ala Mhigo after I have changed."},{"name":"ALPHINAUD","text":"Ahh, that's much better. Subterfuge was never my strong suit. You are prepared for battle, then?"},{"name":"THANCRED","text":"Kept you waiting, eh? My apologies."},{"name":"ALISAIE","text":"Now that Thancred has <span class=\"emphasis\">finally</span> arrived, mayhap you could share your latest findings?"},{"name":"THANCRED","text":"You mean to tell me that while we were worrying ourselves sick, Yda and Papalymo were here all along? Well, Y'shtola will be relieved. And also angry. Mainly angry, I should think."},{"name":"THANCRED","text":"As for the crystals, what choice do we have? We cannot very well leave them in the hands of the Amalj'aa."},{"name":"THANCRED","text":"For all we know, they could be preparing to summon Ifrit even as we speak. We must make for Zahar'ak without delay."},{"name":"ALPHINAUD","text":"Agreed. If there is naught else to discuss, let us depart at once."},{"name":"URIANGER","text":"...And so they go forth, in accordance with the Griffin's plan."},{"name":"URIANGER","text":"The players gather to assume their marks on a stage wreathed in flame... Ere long, the curtain shall rise, and the drama of which I am author, gods forgive me, shall at last be performed."},{"name":"URIANGER","text":"Naught else remaineth, save to stand at the ready and pray that the chance is seized. For never shall we know its like again."},{"name":"THANCRED","text":"You'd think there would be more obvious signs that something was afoot─but, if anything, the place seems quieter than I remember it. I have a bad feeling about this..."},{"name":"ALISAIE","text":"All seems calm here. Is it possible that we've been deceived?"},{"name":"ALPHINAUD","text":"I confess, I expected a warmer greeting. But we must not jump to conclusions─not until we have braved the Bowl of Embers."},{"name":"ALPHINAUD","text":"We must be ready to engage the enemy at any moment. If you would make any final preparations, pray do so now. I shall await your signal."},{"name":"SYSTEM","text":"Upon proceeding to the Bowl of Embers, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"ALISAIE","text":"Though things did not unfold as perhaps─ I mean to say, I truly believe that she─ Forgive me. I should not have spoken. It is not my place."},{"name":"THANCRED","text":"..."},{"name":"URIANGER","text":"...Speak thy mind. I do not expect thy forgiveness."},{"name":"ALPHINAUD","text":"...It would seem we are in southern Thanalan again. Minfilia's doing, no doubt. May the Twelve speed her on her way...and the Warriors of Darkness too."},{"name":"ALPHINAUD","text":"I cannot help but wonder what awaits those wayward souls. If they gave their lives in order to travel to the Source, then in returning to the First, would they not...?"},{"name":"ALPHINAUD","text":"...But mayhap that was their wish."}],"reward":{"gil":2500,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67884]},"next":[67886]},"partials":[{"type":"npc","id":"1017762","obj":{"i":1017762,"n":"Alphinaud","l":45,"q":2}},{"type":"npc","id":"1017767","obj":{"i":1017767,"n":"Alphinaud","l":45,"q":2}},{"type":"npc","id":"1017750","obj":{"i":1017750,"n":"Alphinaud","l":45,"q":3}},{"type":"npc","id":"1017751","obj":{"i":1017751,"n":"Alisaie","l":45,"q":3}},{"type":"npc","id":"1017763","obj":{"i":1017763,"n":"Thancred","l":45,"q":1}},{"type":"npc","id":"1017764","obj":{"i":1017764,"n":"Alphinaud","l":45,"q":1}},{"type":"npc","id":"1017765","obj":{"i":1017765,"n":"Alisaie","l":45,"q":1}},{"type":"npc","id":"1017766","obj":{"i":1017766,"n":"Thancred","l":45,"q":1}},{"type":"npc","id":"1017768","obj":{"i":1017768,"n":"Alisaie","l":45,"q":2}},{"type":"npc","id":"1017769","obj":{"i":1017769,"n":"Thancred","l":45,"q":2}},{"type":"npc","id":"1017770","obj":{"i":1017770,"n":"Urianger","l":45,"q":2}},{"type":"quest","id":"67884","obj":{"i":67884,"n":"Honorable Heroes","g":5,"l":"Southern Thanalan","s":8}},{"type":"quest","id":"67886","obj":{"i":67886,"n":"An Ending to Mark a New Beginning","g":5,"l":"Southern Thanalan","s":10}}]}