{"quest":{"name":"An Envoy for Ishgard","location":"Ishgard","id":67888,"patch":3.5,"sort":12,"eventIcon":71201,"issuer":1016008,"target":1018015,"involved":[1012163,1013167,1016075,1018012,1018013,1018014,1018016,1018035,1018036,1018219],"genre":5,"journal":["Lucia seems eager to set forth for Gridania.","Lucia bids you join her outside the city to await the coming of Ishgard's envoy, whoever he or she may be. Make your way to the Gates of Judgement.","Your wait comes to an end with the arrival of Ser Aymeric. As lord commander, it seems his appointment as the nation's representative was a foregone conclusion. After bemoaning the unavoidably tedious workings of government, he asks that you delay your journey to Gridania once more to make a brief stop at Camp Dragonhead.","You find Ser Aymeric and Lucia at Camp Dragonhead, who invite you to meet the newly appointed garrison commander. Much to your surprise, you discover that it is none other than Ser Emmanellain─ably abetted by the rather more practically minded Honoroit. After leaving instructions to strengthen Coerthas' defenses, Ser Aymeric departs for the council. Travel to the Black Shroud, and rendezvous with the lord commander in New Gridania.","Ser Aymeric fondly recalls his previous visits to the forest nation, and regrets that circumstances preclude a more leisurely appreciation of Gridania's beauty. The Alliance council will soon commence..."],"objectives":["Wait at the Gates of Judgement.","Speak with Ser Aymeric at Camp Dragonhead.","Speak with Ser Aymeric in New Gridania."],"dialogue":[{"name":"HANDELOUP","text":"Retaking our place in the Eorzean Alliance is a vital step in reforging our bonds with the wider realm. The Temple Knights stand ready to honor the promise our nation has made."},{"name":"LUCIA","text":"If you have no other business in the city, join me at the Gates of Judgement. We must be ready to depart the instant the envoy arrives."},{"name":"LUCIA","text":"You are perhaps wondering who will represent Ishgard at the council? As this is a military matter, I should not be surprised if Ser Aymeric nominated himself. He is yet lord commander of the Temple Knights, after all."},{"name":"AYMERIC","text":"We meet again. As it happens, my counterpart in the House of Commons agreed that I should act as Ishgard's envoy."},{"name":"AYMERIC","text":"...Not, I concede, that there was ever any real doubt. As lord commander of the Temple Knights, it is my duty to sanction any military cooperation."},{"name":"AYMERIC","text":"Be that as it may, I could not in good conscience make the decision alone─not with the ink scarce dry in the republic's book of statutes."},{"name":"AYMERIC","text":"I trust you understand, my friend. Alas, I must test your patience still further by making a brief stop at Camp Dragonhead. Given the trouble brewing in the Black Shroud, I would see that the garrison is ready to defend the border."},{"name":"LUCIA","text":"I am glad that Ser Aymeric's counterpart saw the wisdom in his coming. Few if any in Ishgard can claim to possess his expertise in both politics and warfare."},{"name":"AYMERIC","text":"The garrison commander waits within. Why not accompany me, <span class=\"highlight\">Forename</span>? You may see a familiar face..."},{"name":"EMMANELLAIN","text":"<span class=\"highlight\">Forename</span>, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!? How wonderful to see you! And Ser Aymeric, too! To what do I owe these unexpected pleasures?"},{"name":"HONOROIT","text":"I will have some mulled wine brought up from the kitchens at once! If you will excuse─"},{"name":"AYMERIC","text":"Nay, do not trouble yourself, Honoroit─we shall soon be on our way. Lucia, a brief summary, if you will."},{"name":"LUCIA","text":"Yes, Lord Commander."},{"name":"EMMANELLAIN","text":"Hmph. Those villains hardly need an excuse to wage war. Bloodletting comes as naturally as breathing to a Garl─I-I mean, to an imperial."},{"name":"HONOROIT","text":"...And thus we shall strengthen our patrols as you suggest. We shall also be sure to communicate these developments to Lord Francel and the Observatorium."},{"name":"AYMERIC","text":"I see you have everything in hand. Carry on, Commander."},{"name":"EMMANELLAIN","text":"Surprised to see yours truly at the helm?"},{"name":"EMMANELLAIN","text":"You and me both, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. I doubt I'll ever feel worthy to sit where he sat..."},{"name":"EMMANELLAIN","text":"Yet we can but play the hand we're dealt. And with a little help from the veterans─and Honoroit's <span class=\"emphasis\">ceaseless</span> chiding─I'm sure I'll muddle through. So worry not, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! Off to Gridania with you!"},{"name":"EMMANELLAIN","text":"I shan't waste my time attempting to replace him. I can but be my best self and hope that that's enough!"},{"name":"HONOROIT","text":"I shall do my utmost to see that my lord is not overwhelmed by his duties. He can be surprisingly diligent when he puts his mind to it. <span class=\"emphasis\">If</span> he puts his mind to it..."},{"name":"LUCIA","text":"It seems so peaceful...<br>One would scarce believe that Baelsar's Wall─and wretched Ala Mhigo─lie but a few short malms away."},{"name":"SERPENTHONORGUARD","text":"I bid welcome to our visitors from Ishgard!"},{"name":"AYMERIC","text":"Diplomatic duties have brought me here on several occasions, but I find that I am as enraptured by the Black Shroud's beauty now as when first I laid eyes upon it."},{"name":"AYMERIC","text":"I fear that this time, however, events shall not afford us the luxury of enjoying the splendor of the forest..."}],"reward":{"gil":885,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67887]},"next":[67889]},"partials":[{"type":"npc","id":"1016008","obj":{"i":1016008,"n":"Lucia","l":2300,"q":5}},{"type":"npc","id":"1018015","obj":{"i":1018015,"n":"Aymeric","l":52,"q":2}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1013167","obj":{"i":1013167,"n":"Lucia","l":2300,"q":10}},{"type":"npc","id":"1016075","obj":{"i":1016075,"n":"Lucia","l":63,"q":3}},{"type":"npc","id":"1018012","obj":{"i":1018012,"n":"Aymeric","l":2300,"q":1}},{"type":"npc","id":"1018013","obj":{"i":1018013,"n":"Aymeric","l":63,"q":1}},{"type":"npc","id":"1018014","obj":{"i":1018014,"n":"Lucia","l":63,"q":1}},{"type":"npc","id":"1018016","obj":{"i":1018016,"n":"Lucia","l":52,"q":2}},{"type":"npc","id":"1018035","obj":{"i":1018035,"n":"Emmanellain","l":63,"q":1}},{"type":"npc","id":"1018036","obj":{"i":1018036,"n":"Honoroit","l":63,"q":1}},{"type":"npc","id":"1018219","obj":{"i":1018219,"n":"Serpent Honor Guard","l":52,"q":2}},{"type":"quest","id":"67887","obj":{"i":67887,"n":"Tidings from Gyr Abania","g":5,"l":"The Rising Stones","s":11}},{"type":"quest","id":"67889","obj":{"i":67889,"n":"An Allied Decision","g":5,"l":"Gridania","s":13}}]}