{"quest":{"name":"An Ending to Mark a New Beginning","location":"Southern Thanalan","id":67886,"patch":3.4,"sort":10,"icon":100586,"eventIcon":71201,"issuer":1017767,"target":1017776,"involved":[1006215,1017417,1017768,1017769,1017770,1017771,1017772,1017773,1017775,1017777,1017778,1017779,1017780,1017781,1017782,1017783,1017784,1017792,1017793,1017794,1017795,1017796],"genre":5,"journal":["Alphinaud seems to be at a loss for words.","Alphinaud recalls that the Ishgardian crystals are still somewhere within Zahar'ak, prompting Thancred to interject that he will see to their recovery─alone. Unable to persuade the bard to accept assistance, Alphinaud resolves to go and find Yda and Papalymo, leaving you with a tired Alisaie and a morose Urianger, who are doing their best not to speak to each other.","You finally break the silence, giving the others an excuse to speak. Alisaie declares that she wanted to believe Urianger would never betray them, but that some small part of her feared the worst. In response, the Archon once more expresses sorrow for his deception, though it is plain that he still believes the ends justified the means. Alisaie, however, cannot bring herself to condone his actions. Even so, she allows him to escort her to safety, suggesting that any rift that may have grown between them is already on its way to mending.","Having returned to Little Ala Mhigo, you and Alphinaud meet with Yda and Papalymo, who are understandably dumbstruck to hear the tale of your visit to the aetherial sea. After a pause, Papalymo declares that it is past time he and Yda rejoined the Scions. A statement of the glaringly obvious, no doubt, but a welcome one nonetheless. As you all prepare to return to the Rising Stones, you are accosted by Gundobald, who is apparently acquainted with both Yda and her father, with whom he fought in the revolution against the King of Ruin twenty years ago. He goes on to recall how Yda once played an active role in the Resistance...until she vanished one day, leaving him fearing the worst. Though plainly startled, Yda musters an apology, explaining that her involvement with the Circle of Knowing and its successor, the Scions of the Seventh Dawn, necessitated absolute secrecy. Suddenly conscious that her friends are waiting for her at the Rising Stones, she runs off, leaving Papalymo to reassure Gundobald that they will both return ere long.","With every surviving senior Scion now safely back at the Rising Stones, Alphinaud takes the opportunity to propose that the structure of the organization be revised. Rather than being beholden to a strict hierarchy, he believes that each member should be allowed to pursue whatever activities they think would best serve to ensure the safety and security of the realm. The others are amenable to this idea in principle─though, in practice, all seem content to carry on with their current activities. With thoughts now turning to the future, Krile and Alisaie are welcomed as a fully fledged Scions, though the latter accepts the honor with rather less enthusiasm than the former. Still more negative is Urianger, who is plainly haunted by feelings of guilt over his role in Minfilia's fate─but after some urging from Thancred, he too agrees to resume his research, thus completing the party─save, of course, for one. Expectantly, your friends and colleagues turn to you, eager to hear what you intend, and after looking deep within your heart, you know the answer.","The people you have met. The moments you have shared. The losses you have suffered. The tragedies you have overcome. All of it has made you and the Scions of the Seventh Dawn who you are today. Where you go from here and what the future holds, only the Twelve know...but Alphinaud knows that you will find out together."],"objectives":["Speak with Alisaie.","Speak with Papalymo.","Speak with Alphinaud in the Rising Stones.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"...We should talk about what to do next."},{"name":"THANCRED","text":"..."},{"name":"URIANGER","text":"...Speak thy mind. I do not expect thy forgiveness."},{"name":"ALPHINAUD","text":"...Hm? Forgive me. My thoughts were elsewhere. And this when I know full well there is yet work to be done. The crystals─"},{"name":"THANCRED","text":"Leave them to me. I will go back into Zahar'ak and secure them."},{"name":"THANCRED","text":"The Amalj'aa will still be in disarray after the thrashing the Warriors of Darkness gave them. They are not like to notice a lone bard skulking about."},{"name":"ALPHINAUD","text":"But Thancred, you─"},{"name":"THANCRED","text":"Don't have to do this, I know. But I <span class=\"emphasis\">want</span> to. I will see you at the Rising Stones."},{"name":"ALPHINAUD","text":"...I should go and find Yda and Papalymo. They must have finished searching the Masks' camp by now. Not that it matters anymore..."},{"name":"ALISAIE","text":"You must be tired, <span class=\"highlight\">Forename</span>. I know I am..."},{"name":"URIANGER","text":"If thou wilt permit me, my lady, I would ask a question. When didst thou become aware of mine independent pursuits?"},{"name":"ALISAIE","text":"When I saw you meeting with that Warrior of Darkness and the Ascian in white at the Great Library."},{"name":"ALISAIE","text":"I tried not to think the worst. You've never been one to confide in others, so I knew that even were your intentions pure, you would not share your plans with us until you felt the time was right."},{"name":"ALISAIE","text":"But I cannot deny that a part of me feared you had simply betrayed us."},{"name":"URIANGER","text":"Would that there had been another way. Know that I took no pleasure in deceiving thee, and that these sins will forever weigh heavy on my heart."},{"name":"ALISAIE","text":"...I understand why you did what you did. That you but sought to achieve the greatest good while inflicting the least harm. Not many would have the courage to make that choice."},{"name":"ALISAIE","text":"But even knowing what came of your actions...I find that I cannot condone them. I'm sorry."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>, forgive me, but I believe the events of the day have taken their toll on me. I should like to rest for a while."},{"name":"URIANGER","text":"If thou wilt grant me leave, I would gladly escort thee unto a refuge of thine own choosing.<br>Once my lady hath regained her strength, we shall join thee at the Rising Stones. Until then, Warrior of Light."},{"name":"ALPHINAUD","text":"(I have yet to tell them what happened in Zahar'ak. I thought it best to do so together.)"},{"name":"YDA","text":"Ah, there you are! We've finished our search, in case you were wondering."},{"name":"PAPALYMO","text":"Well met, <span class=\"highlight\">Forename</span>. Alphinaud said you would be joining us."},{"name":"PAPALYMO","text":"'Twould seem the Griffin's double was telling the truth, insofar as we found nothing resembling a sizable cache of crystals in the Masks' camp. Did you perchance find one in Zahar'ak?"},{"name":"ALPHINAUD","text":"Actually..."},{"name":"YDA","text":"...I don't believe it. The crystals, Minfilia, all of it. It's just─ I don't know what it is."},{"name":"ALPHINAUD","text":"I sympathize, Yda. Even now, I struggle to comprehend that which I saw... The only thing I can say with any certainty is that I feel blessed to have been granted a final chance to speak with her. 'Twas bittersweet, aye, but also...affirming."},{"name":"PAPALYMO","text":"...Alphinaud, I believe it is past time Yda and I rejoined the Scions. We have been away for far too long."},{"name":"PAPALYMO","text":"Though I am loath to leave the Griffin to his own devices, I feel our investigation would benefit from your more dispassionate perspectives. And I hope that we might, in turn, offer our own opinions on the many challenges that you have faced in our absence."},{"name":"YDA","text":"Gods, it's been absolutely ages, hasn't it? I can't wait to hear about everyone's adventures."},{"name":"ALPHINAUD","text":"We should be glad to recount them. And Tataru's tales may well surprise you."},{"name":"GUNDOBALD","text":"Yda...? Yda! Rhalgr be praised, it <span class=\"emphasis\">is</span> you!"},{"name":"GUNDOBALD","text":"Yda, <span class=\"emphasis\">alive</span> and standing here before me, in the flesh! I can hardly believe my eyes!"},{"name":"YDA","text":"I... Er..."},{"name":"GUNDOBALD","text":"Oh, come now, has it really been so long you don't remember me? It's Gundobald! I fought beside your father in the revolution!"},{"name":"GUNDOBALD","text":"Do not think less of her, friends! It's been twenty years since the occupation sent us our separate ways. But the Resistance were always welcome in Little Ala Mhigo. They gave us hope─and young Yda most of all!"},{"name":"GUNDOBALD","text":"Aye, Yda here was always full of fire, ever the first to volunteer for a mission. Until the day she up and vanished, that is! There were rumors, and we feared the worst, but here you are, alive and well, looking nary a day older!"},{"name":"YDA","text":"W-Well, what can I say? I...I'm sorry for running off like that and making you all worry."},{"name":"YDA","text":"It's a long story, but, you see, I...I got involved with my friends here, the Scions─ Oh, sorry, we were still the Circle of Knowing back then, right! A-Anyway, I wanted to come back and tell you, but it was all very secretive stuff at the time and, uh...as you can see, I'm completely fine!"},{"name":"YDA","text":"I know we've got a lot to talk about─and we will─but right now I've got to hurry back to our headquarters. My friends are expecting me!"},{"name":"PAPALYMO","text":"Pray forgive her. It has been a very long day for us all. I promise we will visit again at the first opportunity."},{"name":"PAPALYMO","text":"Let us return to the Rising Stones."},{"name":"PAPALYMO","text":"Hells take me for giving you that mask..."},{"name":"GUNDOBALD","text":"Yda's father was one of the finest men I've ever known. A true leader of the revolution. He inspired countless others to rise up and cast down the tyrant Theodoric, and fought tirelessly for the land he loved."},{"name":"GUNDOBALD","text":"...But not even he could inspire us to victory over the Garleans. He died...and I grew old. But Yda carried on his legacy─our legacy..."},{"name":"HOARYBOULDER","text":"Huzzah! Have you heard, <span class=\"highlight\">Forename</span>!? Yda and Papalymo are returned!"},{"name":"HOARYBOULDER","text":"We have not had a chance to speak, but the mere sight of them was enough to raise our spirits! Huzzah!"},{"name":"COULTENET","text":"Many of our number are still out in the field, but I believe Ocher's party should be returning shortly."},{"name":"FLHAMINN","text":"...You needn't say a word, <span class=\"highlight\">Forename</span>. I know. I know..."},{"name":"FLHAMINN","text":"Wherever she wanders, no matter how far, she will always be with us."},{"name":"ALPHINAUD","text":"Welcome home, <span class=\"highlight\">Forename</span>. I trust your journey was uneventful. You will be pleased to hear that Thancred has secured the crystals. He sent word a short while ago."},{"name":"ALPHINAUD","text":"Once he has delivered them safely into the Temple Knights' care, he will rejoin us here, and we can declare this matter officially resolved."},{"name":"ALPHINAUD","text":"While awaiting your arrival, I took the opportunity to contact Y'shtola and Krile, and briefed them on all that has occurred. I also requested that they return to the Rising Stones at their earliest convenience. Now that our lost friends have been found, it would seem meet to discuss the future."},{"name":"TATARU","text":"Leave it to me, <span class=\"highlight\">Forename</span>! I'll make sure she's properly introduced to everyone!"},{"name":"ALISAIE","text":"&lt;sigh&gt; It's official, then. Gods, I hope I don't regret this."},{"name":"YDA","text":"Same as it ever was..."},{"name":"YSHTOLA","text":"As agreed, we shall spend the coming moons conducting our own independent research. Should you have need of our services, however, you are of course welcome to seek us out."},{"name":"KRILE","text":"It would seem that I'm a Scion, then. Hmm... Some derive comfort from such titles, but I cannot say that I feel any different from before. Well, mayhap a <span class=\"emphasis\">twinge</span> of pride..."},{"name":"URIANGER","text":"It may be argued that the great sundering of the Source was an aberration, and the existence of the ten and three reflections an offense to the natural order."},{"name":"URIANGER","text":"That, most assuredly, is the Ascians' belief. 'Twas in the hope of opening mine eyes to said revelation that they first came unto me, imagining it sufficient to secure mine allegiance."},{"name":"URIANGER","text":"Nor would they have been mistaken─were my heart a temple to truth alone. But as a devoted follower of Master Louisoix's teachings, and for the love I bear him and his, I hearkened not to their words."},{"name":"PAPALYMO","text":"I suppose I should not be surprised. With everyone standing in a circle delivering grand proclamations about their future endeavors, she naturally felt obliged to make up one of her own."},{"name":"THANCRED","text":"I have Ser Aymeric's assurances that the Temple Knights will henceforth keep a close eye on the Ishgardian crystal trade."},{"name":"THANCRED","text":"Oh, and he extends his deepest apologies for your dinner having been cut short. Courteous fellow, isn't he? You would never guess he was a politician."},{"name":"HOARYBOULDER","text":"Ohoho! Do not think I will be bested so easily again! When my competition with Lady Yda has ended, the Scions of the Seventh Dawn shall crown a new champion of the squat!"},{"name":"COULTENET","text":"'Tis passing strange to think that we may never see Lady Minfilia again. After witnessing so many of our missing comrades return to us, I dared to hope that she might one day do the same..."},{"name":"OCHERBOULDER","text":"All these little mistakes are beginning to add up, Aenor! You must try harder to remain focused!"},{"name":"AENOR","text":"I-I'm doing my best, Ocher, I am! I just can't seem to clear my mind. I keep thinking about you...and your brother...and me..."},{"name":"CLEMENCE","text":"(Trouble in paradise, eh? Heh heh heh...)"},{"name":"ALPHINAUD","text":"Look at them, <span class=\"highlight\">Forename</span>. The Scions of the Seventh Dawn. Look how far we've come..."},{"name":"ALPHINAUD","text":"The people we've met. The moments we've shared. The losses we've suffered. The tragedies we've overcome. All of it has made us who we are today."},{"name":"ALPHINAUD","text":"Where we go from here and what the future holds, only the Twelve know..."},{"name":"ALPHINAUD","text":"...But I know that we will find out together."},{"name":"IRONMASK02350","text":"Well done, brother. You may resume your normal duties and rejoin the others. The coming battle shall be our greatest yet, and I intend to stand with you all on that glorious day."},{"name":"ELIDIBUSEORZEA","text":"...True believers are so <span class=\"emphasis\">readily</span> led."},{"name":"IRONMASK02350","text":"I have given them everything they desired. All for which they have prayed. I doubt you can say the same for your pawns."},{"name":"IRONMASK02350","text":"Get what you wanted, then? Was it all worth it in the end?"},{"name":"ELIDIBUSEORZEA","text":"There were some...unexpected developments, but they were ultimately to our advantage."},{"name":"ELIDIBUSEORZEA","text":"Be it host to a surfeit of Light or Dark, a world bereft of equilibrium is but a void in waiting. And a void is of no use to my master.<br>I shall follow Her emissary with great interest."},{"name":"ELIDIBUSEORZEA","text":"As for the “pawns” whom you so pity...they have delivered unto me a gift, which I do now present to you."},{"name":"ELIDIBUSEORZEA","text":"The eyes of Nidhogg. Many were the candidates considered, but by your deeds, you have proven yourself the most deserving."},{"name":"ELIDIBUSEORZEA","text":"A man of boundless rage and bottomless despair, in whose breast beats a heart which thirsts for vengeance. Only you are fit to wield these eyes─for weal or for woe."},{"name":"NERO","text":"(-???-)Hmph. So it was here all along..."},{"name":"NERO","text":"Oh, just you wait, my pretty! You and I are going to have <span class=\"emphasis\">so</span> much fun!"}],"reward":{"gil":1420,"items":[{"id":16927}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67885]},"next":[67887]},"partials":[{"type":"npc","id":"1017767","obj":{"i":1017767,"n":"Alphinaud","l":45,"q":2}},{"type":"npc","id":"1017776","obj":{"i":1017776,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1006215","obj":{"i":1006215,"n":"Gundobald","l":45,"q":13}},{"type":"npc","id":"1017417","obj":{"i":1017417,"n":"Alphinaud","l":45,"q":1}},{"type":"npc","id":"1017768","obj":{"i":1017768,"n":"Alisaie","l":45,"q":2}},{"type":"npc","id":"1017769","obj":{"i":1017769,"n":"Thancred","l":45,"q":2}},{"type":"npc","id":"1017770","obj":{"i":1017770,"n":"Urianger","l":45,"q":2}},{"type":"npc","id":"1017771","obj":{"i":1017771,"n":"Papalymo","l":45,"q":1}},{"type":"npc","id":"1017772","obj":{"i":1017772,"n":"Yda","l":45,"q":1}},{"type":"npc","id":"1017773","obj":{"i":1017773,"n":"F'lhaminn","l":481,"q":1}},{"type":"npc","id":"1017775","obj":{"i":1017775,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1017777","obj":{"i":1017777,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1017778","obj":{"i":1017778,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1017779","obj":{"i":1017779,"n":"Thancred","l":481,"q":1}},{"type":"npc","id":"1017780","obj":{"i":1017780,"n":"Y'shtola","l":481,"q":1}},{"type":"npc","id":"1017781","obj":{"i":1017781,"n":"Urianger","l":481,"q":1}},{"type":"npc","id":"1017782","obj":{"i":1017782,"n":"Krile","l":481,"q":1}},{"type":"npc","id":"1017783","obj":{"i":1017783,"n":"Yda","l":481,"q":1}},{"type":"npc","id":"1017784","obj":{"i":1017784,"n":"Papalymo","l":481,"q":1}},{"type":"npc","id":"1017792","obj":{"i":1017792,"n":"Hoary Boulder","l":481,"q":1}},{"type":"npc","id":"1017793","obj":{"i":1017793,"n":"Coultenet","l":481,"q":1}},{"type":"npc","id":"1017794","obj":{"i":1017794,"n":"Ocher Boulder","l":481,"q":1}},{"type":"npc","id":"1017795","obj":{"i":1017795,"n":"Aenor","l":481,"q":1}},{"type":"npc","id":"1017796","obj":{"i":1017796,"n":"Clemence","l":481,"q":1}},{"type":"item","id":"16927","obj":{"i":16927,"n":"Wind-up Moenbryda","l":1,"c":59624,"t":81}},{"type":"quest","id":"67885","obj":{"i":67885,"n":"One Life for One World","g":5,"l":"Southern Thanalan","s":9}},{"type":"quest","id":"67887","obj":{"i":67887,"n":"Tidings from Gyr Abania","g":5,"l":"The Rising Stones","s":11}}]}