{"quest":{"name":"When We Were Free","location":"Southern Thanalan","id":67883,"patch":3.4,"sort":7,"icon":100584,"eventIcon":71201,"issuer":1017750,"target":1017757,"involved":[1006213,1006215,1006223,1006224,1017751,1017752,1017753,1017754,1017755,1017756,1017758,1017759],"genre":5,"journal":["Alphinaud is eager to get to work.","It is not exactly a well-kept secret that the Resistance has an established presence in Little Ala Mhigo. Even refugees who are not directly involved in the organization are likely to possess some information concerning its activities─or so Alphinaud would like to believe. Whether or not they will speak openly of such things to outsiders is, of course, a different matter. Nevertheless, unasked questions are wont to go unanswered.","Several of the residents make mention of a mysterious man named the Griffin, a revolutionary leader who always wears a mask in public. A charismatic figure, he seems to have inspired a good many of the refugees to rally to his standard, and there are even rumors that he and his Masks have a secret weapon they plan to use against the Garlean occupiers.","Alphinaud and Alisaie's inquiries yield similar information to yours, and after reviewing your collected findings, you conclude it is highly likely that the Masks are the group who received the shipment of crystals from Ishgard. This, combined with the fact that their passion for Ala Mhigan liberation borders on the fanatical, does lend credence to the theory that the revolutionaries are plotting to summon a primal. Even so, it would be unwise to act on such suspicions without first obtaining confirmation, and to that end, a conversation with Gundobald, the settlement's leader, would seem to be in order.","Though the fires of idealism often fade with age and experience, Gundobald admits that even he has found inspiration in the Griffin and his deeds. Yet he has not forgotten how Wilred and his friends were once led astray, and how all might have ended in still greater tragedy had you not intervened. Determined that his people should never again fall prey to the machinations of manipulative men, he bids you journey to the Sunken Temple of Qarn, where the Griffin is due to speak, and weigh the worth of his words for yourself.","The Griffin is every bit the silver-tongued speaker, painting a picture of a homeland abandoned and of a people forsaken. His words conjure feelings of guilt, yet also offer the promise of redemption─of bloody retribution, and of glorious freedom, won with a power residing in the hearts of the brave and true. Muttering darkly to himself, Alphinaud surveys the congregation...and catches sight of two very familiar faces: Yda and Papalymo! Though you have many questions, it is agreed that the temple is no place for lengthy discussions, and so you slip away while the crowd watches the Griffin in rapt attention.","Yda and Papalymo reveal that having parted ways with you after the fateful banquet, they slipped out of the city with the aid of some old friends from the Resistance. These goodly souls duly sheltered the two fugitives in Little Ala Mhigo at great personal risk, and so they deemed it only fair to remain for a time, assisting them in their operations to repay the favor. When Papalymo subsequently learned of the Scions' exoneration─that the Crystal Braves had been denounced and General Raubahn reinstated─he apparently attempted to reestablish contact. However, it seems likely that his missive was intercepted by the Masks, who are reluctant to allow word of their activities to spread beyond the refugee community. Their tale thus told, you proceed to brief the pair on your ongoing investigation into the missing crystal shipment. While shocked by the idea that the Masks may be planning to summon a primal, they observe that the Griffin and his men have claimed on more than one occasion to possess a means to defeat the Empire... Plainly, much and more remains to be established, but whatever the truth may be, you are sure to find it that much faster with the help of your long-lost allies."],"objectives":["Question the residents of Little Ala Mhigo.","Speak with Alphinaud.","Speak with Gundobald.","Rendezvous with Alphinaud at the Sunken Temple of Qarn.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"Let us pray that someone will be willing to speak with us about the Resistance..."},{"name":"ALPHINAUD","text":"So, to review: we are reliably informed that members of the Ala Mhigan Resistance operating here have taken receipt of several large shipments of crystals, our task being to ascertain who and why."},{"name":"ALPHINAUD","text":"Given the size of the settlement, I find it hard to believe that anyone here could be wholly unaware of the Resistance's movements. The challenge, of course, will be finding individuals who are both able <span class=\"emphasis\">and</span> willing to share such information with outsiders."},{"name":"ALPHINAUD","text":"It would seem sensible to divide our forces. <span class=\"highlight\">Forename</span>, why don't you question the residents in the eastern half of town? Alisaie and I will do the same in the west, and afterwards we can rendezvous here to share our findings."},{"name":"ALPHINAUD","text":"Have you finished already, <span class=\"highlight\">Forename</span>? If not, then we shall speak anon."},{"name":"ALISAIE","text":"As outsiders, we must be careful how we broach the subject, lest they grow suspicious of our intent."},{"name":"SIFRID","text":"Ah, let me guess: come to join the fight, have you? No need to deny it, friend. You're not the first to answer the Griffin's call!"},{"name":"SIFRID","text":"While he's lit a fire in every Ala Mhigan's heart, he's also inspired more than a few Ul'dahns to pledge themselves to the cause. And little wonder─the Garleans won't stop until we're all under the yoke!"},{"name":"TALEBOT","text":"...I see you there, goin' around askin' questions. Lookin' for the Griffin an' his lot, I'll bet."},{"name":"TALEBOT","text":"Seems they're the talk of Little Ala Mhigo these days. Folk wonderin' what he's about, what he's got in store for the Garleans─an' what's under that mask of his, of course."},{"name":"TALEBOT","text":"Some say he's hardly got a face, what with all the scars. Others reckon he's been marked for death by the Empire, an' that they'd send a bloody legion if they knew he was here. &lt;snort&gt; Your guess is as good as mine."},{"name":"OTELIN","text":"Eh? The Resistance? Damned if I know. It's not as if I'd be any use to 'em. &lt;cough&gt; &lt;wheeze&gt;"},{"name":"OTELIN","text":"If you set store by all these tales of secret weapons, good luck to you─but I'm too old for the Masks' bedtime stories. This is our lot, and it's time we got used to it."},{"name":"SIFRID","text":"The Griffin's the leader we've been waiting for, mark my words! With his help, we'll finally take back our homeland!"},{"name":"TALEBOT","text":"Ever wear a mask like that? They're bloody <span class=\"emphasis\">hot</span>! He must have a pretty damn good reason for wearing one all the time. I'd sooner stay indoors."},{"name":"OTELIN","text":"Maybe...maybe if things were different...but they're not. I want to believe, I do, but..."},{"name":"ALISAIE","text":"Well, that was easier than expected. There's not a soul here who isn't eager to talk about our masked friends."},{"name":"ALPHINAUD","text":"I suppose I should ask what you learned, but I think I already know."},{"name":"ALPHINAUD","text":"...This Griffin seems to be the leader of a newly formed faction within the Resistance. The Masks. Yet despite their growing popularity, no one seems to know much about them─only that they are the most aggressively militant group to join the movement in recent memory."},{"name":"ALPHINAUD","text":"Indeed, many claim their commitment to the cause of Ala Mhigan liberation is unrivaled. We can but hope their revolutionary fervor is never channeled in the direction of a primal."},{"name":"ALPHINAUD","text":"Though I feel confident that this is the group which received the crystal shipments, we yet lack proof. Before taking any action, I would speak with the settlement's leader to confirm my suspicions─and mayhap enlist his help while I am about it."},{"name":"ALPHINAUD","text":"Given that you and Gundobald are already acquainted, mayhap it would be best if you took the lead. Shall we?"},{"name":"ALPHINAUD","text":"Naught would please me more than to be wrong about all of this..."},{"name":"ALISAIE","text":"To hear people speak of him, the Griffin sounds like a man in his middle years. But if that's the case, just what has he been playing at for the past two decades? If he's so devoted to the cause, why has he waited until now to do something about it? Unless, of course...he hasn't..."},{"name":"GUNDOBALD","text":"Much as it pleases me to see you again, <span class=\"highlight\">Forename</span>, I cannot help but wonder if I should be worried. I hear you and yours have been asking questions..."},{"name":"GUNDOBALD","text":"The Griffin? Aye, I know of him, as do we all. He and his Masks have become a leading faction within the Resistance."},{"name":"GUNDOBALD","text":"Though there was suspicion at first given his secretive ways, he quickly proved himself a charismatic and capable commander. Men are drawn to his passion and his vision─they truly believe that he has what it takes to lead them to victory."},{"name":"GUNDOBALD","text":"Even I cannot help but admire the man for what he's accomplished.<br>...But I have not forgotten Wilred. I was blind to the danger of his ambitions...and you were not."},{"name":"GUNDOBALD","text":"The Griffin will soon deliver a speech to our people at the Sunken Temple of Qarn. Go and see him with your own eyes, weigh his words with your own heart."},{"name":"ALPHINAUD","text":"How convenient. 'Tis but a pity Thancred is not here to join us."},{"name":"ALISAIE","text":"You two go on ahead. I shall stay behind and wait for him."},{"name":"ALISAIE","text":"Whatever could be keeping him? If he's taken the scenic route, leaving us to do all the hard work, I shall treat him to a piece of my mind."},{"name":"GUNDOBALD","text":"Men who can inspire such fervor in their followers are destined to shape the world. In what manner, however, is not always clear...until it is too late."},{"name":"GUNDOBALD","text":"The young ones were led astray once. Help us ensure that it never happens again. For their sake...and for Wilred's."},{"name":"ALPHINAUD","text":"Has it begun already? I hear voices coming from within..."},{"name":"YDA","text":"Of all the places to meet! It has to be fate!"},{"name":"PAPALYMO","text":"Mayhap it is my imagination, but you seem rather more rugged and world-weary than when last we spoke..."},{"name":"ALPHINAUD","text":"Words cannot express how glad I am to see you both alive and well."},{"name":"YDA","text":"And you! Though it was pretty obvious you and <span class=\"highlight\">Forename</span> would be fine."},{"name":"PAPALYMO","text":"The Crystal Braves never had a realistic chance of capturing any of the Scions, divided as they were and distrusted by the better part of Eorzea."},{"name":"ALPHINAUD","text":"But if you truly believed that─ Forgive me. What exactly have you two been doing all this time?"},{"name":"PAPALYMO","text":"...Repaying a favor. After the banquet, we had no choice but to flee Ul'dah, and we would not have been able to do so without the aid of some old friends from the Resistance."},{"name":"YDA","text":"That's right. They smuggled us out of the city and sheltered us in Little Ala Mhigo, all at great risk to themselves. Obviously, we couldn't let that go unacknowledged, so we offered to help them out with their operations for a while."},{"name":"PAPALYMO","text":"When we learned of the Scions' exoneration─that Lolorito had severed all ties with the Crystal Braves, and that General Raubahn had been reinstated─we resolved to make contact. But having long since discarded our linkpearls as a precautionary measure, our options were rather limited."},{"name":"PAPALYMO","text":"To make matters more complicated, we were embroiled in a delicate operation at the time, leaving me with little choice but to entrust a letter to a courier. I gather from your puzzled expressions, however, that you never received it."},{"name":"YDA","text":"To be honest, we thought this might happen. While the Masks are happy to let the refugees spread the word within the community, they're pretty strict about communicating with outsiders. Oh, and we also heard a rumor that the Griffin doesn't want us meddling in his affairs."},{"name":"ALPHINAUD","text":"The Griffin mistrusts the Scions of the Seventh Dawn?"},{"name":"ALPHINAUD","text":"Curious. It is well known that we are no friends to Garlemald. One would think the man we saw beseeching all and sundry to join his cause would welcome our support."},{"name":"PAPALYMO","text":"Ah, I should say that the man you saw was not in fact the Griffin, but an impersonator. And a talented rabble-rouser, to boot. 'Twould not surprise me if he were responsible for the majority of these public appearances."},{"name":"PAPALYMO","text":"As you may have gathered, the Griffin is an extremely cautious and distrusting man who has made every effort to conceal his identity. Even when we participated in a raid under his direct command, we were not permitted to approach him."},{"name":"YDA","text":"It's hard to know what to make of it all. The secrecy, the impersonators, the <span class=\"emphasis\">masks</span>..."},{"name":"YDA","text":"What!? It's not as if I'm making all of <span class=\"emphasis\">you</span> wear one! And mine only covers <span class=\"emphasis\">half</span> my face. It's <span class=\"emphasis\">completely</span> different!"},{"name":"YDA","text":"<span class=\"emphasis\">Anyway</span>, when we heard the Griffin was due to give a speech, we thought it might be a good opportunity to get a better sense of the man behind the─uh, to get a better sense of the <span class=\"emphasis\">man</span>."},{"name":"PAPALYMO","text":"...For all the good it did."},{"name":"PAPALYMO","text":"And now you have heard the whole of it. But tell me─what prompted <span class=\"emphasis\">you</span> to take an interest in the Griffin?"},{"name":"YDA","text":"<span class=\"emphasis\">Summoning</span>!? You're not serious! I can't believe it..."},{"name":"PAPALYMO","text":"The Resistance would never even entertain such a ridiculous plan, but the Griffin... Well, the man is an enigma. I cannot say with any confidence what he would or would not do."},{"name":"PAPALYMO","text":"What I <span class=\"emphasis\">can</span> say, however, is that the speech we heard today was not the first to make reference to a “power” capable of defeating the Empire. The Masks have made many such claims of late. I confess, I had assumed it to be mere bluster, but in the context of the shipments of which you spoke, it is not impossible that they are alluding to a primal."},{"name":"YDA","text":"Whatever it is, we'll find out together─and if anyone tries to stop us, they'll answer to me!"},{"name":"PAPALYMO","text":"Indeed. That is...assuming you'll have us?"}],"reward":{"gil":745,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67882]},"next":[67884]},"partials":[{"type":"npc","id":"1017750","obj":{"i":1017750,"n":"Alphinaud","l":45,"q":3}},{"type":"npc","id":"1017757","obj":{"i":1017757,"n":"Alphinaud","l":45,"q":2}},{"type":"npc","id":"1006213","obj":{"i":1006213,"n":"Otelin","l":45,"q":3}},{"type":"npc","id":"1006215","obj":{"i":1006215,"n":"Gundobald","l":45,"q":13}},{"type":"npc","id":"1006223","obj":{"i":1006223,"n":"Sifrid","l":45,"q":2}},{"type":"npc","id":"1006224","obj":{"i":1006224,"n":"Talebot","l":45,"q":3}},{"type":"npc","id":"1017751","obj":{"i":1017751,"n":"Alisaie","l":45,"q":3}},{"type":"npc","id":"1017752","obj":{"i":1017752,"n":"Alphinaud","l":45,"q":1}},{"type":"npc","id":"1017753","obj":{"i":1017753,"n":"Alisaie","l":45,"q":1}},{"type":"npc","id":"1017754","obj":{"i":1017754,"n":"Alphinaud","l":45,"q":1}},{"type":"npc","id":"1017755","obj":{"i":1017755,"n":"Alisaie","l":45,"q":2}},{"type":"npc","id":"1017756","obj":{"i":1017756,"n":"Alphinaud","l":45,"q":1}},{"type":"npc","id":"1017758","obj":{"i":1017758,"n":"Yda","l":45,"q":2}},{"type":"npc","id":"1017759","obj":{"i":1017759,"n":"Papalymo","l":45,"q":2}},{"type":"quest","id":"67882","obj":{"i":67882,"n":"Beneath a Star-filled Sky","g":5,"l":"Outer La Noscea","s":6}},{"type":"quest","id":"67884","obj":{"i":67884,"n":"Honorable Heroes","g":5,"l":"Southern Thanalan","s":8}}]}