{"quest":{"name":"An Allied Decision","location":"Gridania","id":67889,"patch":3.5,"sort":13,"icon":100612,"eventIcon":71201,"issuer":1018015,"target":1018020,"involved":[1000460,1012395,1018016,1018021,1018219],"genre":5,"journal":["Ser Aymeric is ready to attend the council.","With the council due to begin at any moment, Ser Aymeric bids you announce your arrival. As ever, the silent conjurer stands ready to admit you to the Lotus Stand.","After weighing the possible consequences of the Griffin's reckless scheme, the council members agree that the Gridanian border must be preemptively reinforced. With war now a distinct possibility, the mood is grim as the Alliance leaders disperse to make their preparations. Look for Alphinaud outside the Lotus Stand, and trouble him for his opinion on this latest development.","As you mull over the council's decision with Alphinaud and Alisaie, Ser Aymeric approaches and thanks you for escorting him to Gridania. Before departing, he also takes a moment to express his gratitude for Yugiri's support during the meeting, though she is customarily quick to downplay her contribution. With your business in Gridania now at an end, it is time to return to the Rising Stones.","Back in Revenant's Toll, you encounter Alisaie, who is quick to express her distaste for the carefully chosen words of politicians. You are about to comment on how different she and her brother are in this respect, when she remarks on how different Alphinaud seems from his former self, having apparently taken to running his own errands. How times have changed."],"objectives":["Speak with the silent conjurer at Nophica's Altar.","Speak with Alphinaud.","Speak with Alisaie in Revenant's Toll."],"dialogue":[{"name":"LUCIA","text":"It seems so peaceful...<br>One would scarce believe that Baelsar's Wall─and wretched Ala Mhigo─lie but a few short malms away."},{"name":"SERPENTHONORGUARD","text":"I bid welcome to our visitors from Ishgard!"},{"name":"AYMERIC","text":"It seems we are to have an escort to the Lotus Stand. A pleasant place to discuss unpleasant matters, is it not?"},{"name":"AYMERIC","text":"Yes, of course. 'Tis like that we are the last to arrive. Let us announce ourselves, shall we?"},{"name":"SILENTCONJURER","text":"The envoy from Ishgard is arrived? Very good. This way, if you pl─ Ah, and the Lominsan party, as well."},{"name":"MERLWYB","text":"I had hoped to slip in unnoticed, but I see I was not the only one delayed in my arrival. Greetings, Ser Aymeric."},{"name":"AYMERIC","text":"Admiral, always a pleasure."},{"name":"MERLWYB","text":"And <span class=\"highlight\">Forename</span>, I trust you are well? 'Tis a day for reunions, it seems. I believe you are well acquainted with my escort?"},{"name":"YUGIRI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. I was glad to hear from Riol that the missing Scions have now been found."},{"name":"MERLWYB","text":"There is much and more I would discuss with you, but let us first attend to the issue at hand. Shall we?"},{"name":"ALPHINAUD","text":"...That the council was able to reach an accord so swiftly is a heartening development in itself. I only hope my misgivings prove unfounded..."},{"name":"AYMERIC","text":"Ah, good, you have yet to depart. I feared I had missed you."},{"name":"ALPHINAUD","text":"Ser Aymeric!"},{"name":"AYMERIC","text":"Master Alphinaud, a pleasure as always. And Mistress Alisaie, how wonderful to see you thus recovered. Pardon the interruption. I had hoped to thank <span class=\"highlight\">Forename</span> for serving as our escort before other duties called <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> away."},{"name":"AYMERIC","text":"I also wished to thank our Doman ally..."},{"name":"YUGIRI","text":"Forgive me, my lord. I was but awaiting an opportune moment to join the conversation, and force of habit made me keep to the shadows."},{"name":"AYMERIC","text":"No apologies are necessary, Mistress Yugiri. I was most grateful for your interjection when I offered Ishgard's support."},{"name":"AYMERIC","text":"My nation's historic failure to heed the Alliance's pleas for aid is a matter of record."},{"name":"AYMERIC","text":"Even so, the Alliance leaders were plainly unprepared for my impromptu apology."},{"name":"AYMERIC","text":"The resulting air of awkwardness might have lingered longer were it not for your timely offer of cooperation, which allowed the Elder Seedseer to accept us both. I very much appreciated the gesture."},{"name":"YUGIRI","text":"I only did my duty, Ser Aymeric. The Empire is an enemy to us all, and we are grateful for the opportunity to fight at your side."},{"name":"AYMERIC","text":"And full glad are we to have you. Pray convey my regards to the Scions, my friends. We must return to Ishgard."},{"name":"ALISAIE","text":"Whatever is wrong with a simple “sorry” or “thank you”? Must these politicians always make a speech out of everything?"},{"name":"ALPHINAUD","text":"That is how we adults speak, dear sister."},{"name":"ALISAIE","text":"Hmph. Mayhap the ones who like the sound of their own voice. In any case, our business here is concluded. We should be on our way as well."},{"name":"ALISAIE","text":"Will you accompany us to Revenant's Toll, Yugiri?"},{"name":"ALPHINAUD","text":"Actually, I think I shall first pay a brief visit to the East Shroud. I am curious to know how Papalymo and Yda fared in their talks with the sylphs, not to mention what has been going on at Baelsar's Wall. I will join you at the Rising Stones anon."},{"name":"YUGIRI","text":"Even now, I am astonished by how closely Mistress Alisaie resembles Master Alphinaud. Their very mannerisms are alike. From a distance, I should be hard-pressed to tell one from the other─until they opened their mouths, of course..."},{"name":"ALISAIE","text":"Welcome back, <span class=\"highlight\">Forename</span>. I don't know about you, but I am heartily glad that all of the talking is over. I understand that these council meetings are important, but do you not find it tiresome to have to weigh every word before you speak it? I doubt I will ever feel at home in the realm of politics."},{"name":"ALISAIE","text":"That said, people have been known to change. And if my brother is willing to run his own errands, <span class=\"emphasis\">anything</span> is possible."}],"reward":{"gil":857,"items":[{"id":16709,"one":1},{"id":16712,"one":1},{"id":16711,"one":1},{"id":5825,"one":1}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67888]},"next":[67890]},"partials":[{"type":"npc","id":"1018015","obj":{"i":1018015,"n":"Aymeric","l":52,"q":2}},{"type":"npc","id":"1018020","obj":{"i":1018020,"n":"Alisaie","l":67,"q":2}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1012395","obj":{"i":1012395,"n":"Alphinaud","l":53,"q":4}},{"type":"npc","id":"1018016","obj":{"i":1018016,"n":"Lucia","l":52,"q":2}},{"type":"npc","id":"1018021","obj":{"i":1018021,"n":"Yugiri","l":67,"q":2}},{"type":"npc","id":"1018219","obj":{"i":1018219,"n":"Serpent Honor Guard","l":52,"q":2}},{"type":"item","id":"16709","obj":{"i":16709,"n":"Heavenly Eggnog","l":250,"c":24407,"t":46}},{"type":"item","id":"16712","obj":{"i":16712,"n":"Wildwood Scrambled Eggs","l":250,"c":24119,"t":46}},{"type":"item","id":"16711","obj":{"i":16711,"n":"Spaghetti Carbonara","l":250,"c":24019,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"67888","obj":{"i":67888,"n":"An Envoy for Ishgard","g":5,"l":"Ishgard","s":12}},{"type":"quest","id":"67890","obj":{"i":67890,"n":"Griffin, Griffin on the Wall","g":5,"l":"Mor Dhona","s":14}}]}