{"quest":{"name":"Unlikely Allies","location":"Outer La Noscea","id":67880,"patch":3.4,"sort":4,"eventIcon":71201,"issuer":1006325,"target":1017736,"involved":[1016815,1017728,1017729,1017730,1017731,1017732,1017733,1017734,1017735,1017737],"genre":5,"journal":["Commander Bloeidin is eager to put you to work.","Commander Bloeidin confirms Urianger's report that the kobolds of U'Ghamaro have grown more aggressive of late. Of more immediate concern, however, is the fact that one of the beastmen may be skulking about the camp, possibly with designs on the crystal store. Perhaps with the aid of Alphinaud and Alisaie, you can sniff out this mysterious infiltrator.","Though Alphinaud readily acknowledges that the kobolds' recent behavior does suggest that a summoning is imminent, he finds it odd that a single kobold would wander so close to a Maelstrom camp and risk drawing attention to the efforts of his brethren. Nevertheless, the beastman's presence presents a valuable opportunity to learn more of the kobolds' plans─providing he can be taken alive, of course.","The curiously small kobold proves quite easy to find, but difficult to catch, darting away after sensing your approach. However, in his panicked, disoriented state, he surely cannot have gone far.","Sure enough, you come upon the young kobold hiding beneath the wooden stairs to the east of the camp. This time, he begins to make a half-hearted appeal for you to keep your distance, but overcome by fear, stops short and flees once more.","You catch up with the kobold yet again, who─yet again─manages only a handful of words before running away. With a sigh, you resume your pursuit, offering a silent prayer that his little legs will grow weary before your own.","Blessedly, the kobold does not attempt to escape a fourth time, having mustered the courage to stand his ground and plead his case. Joined by Alphinaud, Alisaie, and Commander Bloeidin, you listen as he introduces himself as Ga Bu of the 620th Order. The young child then reveals his reason for coming to Camp Overlook: to beseech the Maelstrom to stop the patriarch from summoning Great Father Titan. Ga Bu goes on to explain that his parents, along with other like-minded kobolds, spoke out against the patriarch's plans, only to be taken away to serve as “coke for the furnace.” This ominous turn of phrase prompts Alisaie to recall tales of beastmen fashioning ritual foci from the bones of their brethren as a means to summon more powerful incarnations of their gods. Fearing the worst, Alphinaud instructs the commander to inform Maelstrom Command that Titan's return may be imminent, and declares that the Scions will attempt to infiltrate the kobold stronghold, secure the crystals, and free the prisoners.","Lowering his voice, Alphinaud confesses that although he is confident the primal has yet to be summoned, it may yet be too late to save Ga Bu's parents and the other prisoners. Regardless, you must do all you can to stop the patriarch's plans, and for that you will need to enlist the help of the brave young kobold before you."],"objectives":["Speak with Alphinaud.","Search for the kobold in Camp Overlook.","Pursue the koboldling.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"(Is it just my imagination, or is Alisaie staring daggers at me?)"},{"name":"ALISAIE","text":"&lt;sniff&gt; &lt;sniff&gt; (...I know it was him.)"},{"name":"BLOEIDIN","text":"So our friendly neighbors in U'Ghamaro have got much more aggressive of late, just as you said."},{"name":"BLOEIDIN","text":"Matter of fact, our scouts spotted one sniffin' about the stores just now, likely lookin' to make off with an armful of crystals."},{"name":"BLOEIDIN","text":"I'll be damned if I'm about to let that happen! Lend a hand and help us search the camp for the little bugger, would you?"},{"name":"BLOEIDIN","text":"Well? What are you waiting for!? We can't go lettin' thievin' bloody kobolds waltz into our camp and take whatever they fancy!"},{"name":"ALISAIE","text":"You've spoken with the commander, then?"},{"name":"ALPHINAUD","text":"Our Maelstrom friends seem notably more agitated than when first we arrived. Do you happen to know why that might be?"},{"name":"ALPHINAUD","text":"A kobold in the camp, you say...?"},{"name":"ALPHINAUD","text":"That would appear to corroborate Urianger's information, yes. But to be so reckless as to infiltrate a Maelstrom camp and draw attention to their efforts is passing strange."},{"name":"ALPHINAUD","text":"Well, there will be time to think on this later. For the present, we must do everything in our power to prevent Titan's summoning─and that means finding and questioning this kobold."},{"name":"ALPHINAUD","text":"Surely all this commotion cannot have escaped the kobold's notice. If he has any sense, he will attempt to quit this place, will he not?"},{"name":"ALISAIE","text":"One of the scouts said he looked quite small for a kobold. Could he be hiding somewhere like this?"},{"name":"GABU","text":"&lt;gasp&gt;"},{"name":"GABU","text":"S-Stay back! Away, far, back! I'm n-not a...not a..."},{"name":"GABU","text":"Gah, it's no use! Pointless, hopeless, no use!"},{"name":"GABU","text":"P-P-Please, d-don't hurt me! I only wish to talk. Yes, yes, just talk..."},{"name":"GABU","text":"I...I... Gaaah!"},{"name":"GABU","text":"This was a stupid plan! Stupid, stupid, stupid! But...if I tell no one, then everyone will..."},{"name":"GABU","text":"Gah, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> found me again! What to do, what to do, what to do...?"},{"name":"GABU","text":"I...I come in peace, only to talk! Speak, say, talk! So please, please, do not hurt me!"},{"name":"ALISAIE","text":"So this is our wily kobold infiltrator, is it? No wonder the soldiers were on edge. He could very well give one a bruised knee."},{"name":"BLOEIDIN","text":"Huzzah, we've got him! Fine work, Scions!"},{"name":"BLOEIDIN","text":"So, little one─thought you could sneak into my camp, did you? Plottin' to steal my crystals, were you!?"},{"name":"GABU","text":"No, no, no! I came to talk! To ask for help! But when your soldiers saw me, they drew their weapons and shouted, and I...I─"},{"name":"ALPHINAUD","text":"Now, now, let us all take a deep breath and discuss this like civilized...individuals. What is your name, child?"},{"name":"GABU","text":"(-Ga Bu-)Pickman Ga Bu of the 620th Order! At least...I <span class=\"emphasis\">will</span> be a pickman...one day."},{"name":"ALPHINAUD","text":"Well met, Ga Bu. I am Alphinaud, and this is my sister Alisaie."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who found you, is our friend. And now that you know our names, we can be friends too."},{"name":"ALPHINAUD","text":"Now, Commander Bloeidin here thinks you wanted to take his crystals, Ga Bu, but you said you came to ask for help. Why to us, and not to your own people? What happened, Ga Bu? Can you tell us?"},{"name":"GABU","text":"(-Ga Bu-)I...um...er..."},{"name":"ALISAIE","text":"No one is going to hurt you, all right? Not while we're here. I promise."},{"name":"GABU","text":"(-Ga Bu-)Th-The...<br>The patriarch, he...he's...<br>&lt;gulp&gt; <span class=\"emphasis\">...The patriarch is going to summon the Great Father again, and you have to stop him</span>! Beat him, fight him, <span class=\"emphasis\">stop him</span>!"},{"name":"GABU","text":"(-Ga Bu-)Ga Bu's parents said they didn't want it, along with many others! But the patriarch wouldn't listen. He was so angry─raging, fuming, angry!"},{"name":"GABU","text":"(-Ga Bu-)He said that if they didn't have iron in their hearts, they would serve as coke for the furnace. And then the guards took my parents and the others away, and I haven't seen any of them since..."},{"name":"ALPHINAUD","text":"\"Coke for the furnace“?"},{"name":"ALISAIE","text":"I did not want to believe it...but I have heard tales of foci fashioned from the bones of beastmen, which worshipers use in their rituals, hoping to summon more powerful incarnations of their gods."},{"name":"ALPHINAUD","text":"By the Twelve... That is... That is sickening."},{"name":"GABU","text":"(-Ga Bu-)No one listens to Ga Bu, no matter how much he cries─pleads, begs, cries! They do not listen, only talk about punishing the overdwellers and praising the Great Father."},{"name":"GABU","text":"(-Ga Bu-)Ga Bu loves the Great Father, but he loves his parents too! So please, help Ga Bu stop the patriarch and save his parents!"},{"name":"ALPHINAUD","text":"Commander─advise Maelstrom Command that Titan's summoning is imminent. Should the worst come to the worst, we will require their support."},{"name":"ALPHINAUD","text":"Time being of the essence, we three will attempt to infiltrate the kobold stronghold, secure their crystals, and free the prisoners."},{"name":"BLOEIDIN","text":"Well, if you're sure... You'll forgive me if I don't seem optimistic. We'll make ready, just in case."},{"name":"ALISAIE","text":"Do you know that there are collectors who will pay a fortune for beastmen ritual artifacts? It is <span class=\"emphasis\">perverse</span>."},{"name":"GABU","text":"I tried talking to the others, but they wouldn't listen! So even though I was afraid, I came here!"},{"name":"BLOEIDIN","text":"I'll leave it to you lot for now, but at the first sign of trouble, I'm sendin' in the Swallows. Understood?"},{"name":"ALPHINAUD","text":"I have faith that we may yet stop the ritual. We would surely have detected the associated aetheric disturbance had Titan manifested already."},{"name":"ALPHINAUD","text":"But I cannot speak for the prisoners. Twelve have mercy... That they would even <span class=\"emphasis\">contemplate</span> sacrificing their own flesh and blood─brothers and sisters, mothers and fathers..."},{"name":"ALPHINAUD","text":"Time is of the essence. We must see what else Ga Bu knows and formulate a plan without further delay."}],"reward":{"gil":583,"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67879]},"next":[67881]},"partials":[{"type":"npc","id":"1006325","obj":{"i":1006325,"n":"Bloeidin","l":350,"q":15,"t":"Storm Commander"}},{"type":"npc","id":"1017736","obj":{"i":1017736,"n":"Alphinaud","l":350,"q":2}},{"type":"npc","id":"1016815","obj":{"i":1016815,"n":"Ga Bu","l":350,"q":2}},{"type":"npc","id":"1017728","obj":{"i":1017728,"n":"Alphinaud","l":350,"q":3}},{"type":"npc","id":"1017729","obj":{"i":1017729,"n":"Alisaie","l":350,"q":2}},{"type":"npc","id":"1017730","obj":{"i":1017730,"n":"Alphinaud","l":350,"q":1}},{"type":"npc","id":"1017731","obj":{"i":1017731,"n":"Alisaie","l":350,"q":1}},{"type":"npc","id":"1017732","obj":{"i":1017732,"n":"Koboldling","l":350,"q":1}},{"type":"npc","id":"1017733","obj":{"i":1017733,"n":"Koboldling","l":350,"q":1}},{"type":"npc","id":"1017734","obj":{"i":1017734,"n":"Koboldling","l":350,"q":1}},{"type":"npc","id":"1017735","obj":{"i":1017735,"n":"Koboldling","l":350,"q":1}},{"type":"npc","id":"1017737","obj":{"i":1017737,"n":"Alisaie","l":350,"q":2}},{"type":"quest","id":"67879","obj":{"i":67879,"n":"Two Sides of a Coin","g":5,"l":"Coerthas Central Highlands","s":3}},{"type":"quest","id":"67881","obj":{"i":67881,"n":"The Beast That Mourned at the Heart of the Mountain","g":5,"l":"Outer La Noscea","s":5}}]}