{"quest":{"name":"Letters from No One","location":"Ishgard","id":67899,"patch":3.5,"sort":32,"icon":100627,"eventIcon":71221,"issuer":1017914,"target":1017923,"involved":[1017915,1017916,1017917,1017918,1017919,1017920,1017924,1017925],"genre":78,"journal":["Theomocent deliberates on how best to proceed with the investigation.","Theomocent and Leigh have offered to assist Archombadin in identifying the individual behind the suspicious letters calling for his expulsion. Unfortunately, while all are eager to get investigating, no one is quite sure where to begin the search. Putting your heads together, however, you soon come up with a plan of attack: to collect as many letters as you can and compare them to see what clues you might glean. Intent on getting to the bottom of the case once and for all, you return to the scholasticate.","You take a look around and speak with the seminarians─some of whom are able to confirm that not everyone received the suspicious letters. Having gathered a substantial stack of letters from both neglected corners of the scholasticate and students of scripture, meet up with Theomocent and Leigh to compare notes.","Together with Crammevoix and Blaisie, you read through the letters you have gathered. You quickly observe that there appear to be three distinct versions, all conveying a common message: that Archombadin should be expelled from the scholasticate immediately. You further surmise that it is highly likely that whoever distributed these letters is, in fact, none other than the true culprit behind Ulaa's abduction─a crime that appears to have been committed for the sole purpose of framing Archombadin. In light of this new evidence, you decide to make your way to the Vault to report to Inspector Briardien, who will undoubtedly be able to shed further light on the matter with his prodigious powers of deduction.","You share your findings with the inspector, who quickly deduces who is responsible for both the kidnapping and the letters. Knowing that you have come to the same conclusion as him, he reveals no more, but imparts upon those present a potent technique to induce laser-like focus and open the mind to all possible solutions. Equipped with this knowledge, you are now more than ready to face your man!"],"objectives":["Search Saint Endalim's Scholasticate for any suspicious letters.","Deliver the suspicious letters to Theomocent.","Speak with Theomocent in the Pillars."],"dialogue":[{"name":"LEIGH","text":"&lt;sigh&gt; If Theo wasn't so insistent on helping the bastard, I'd have left him to find his own way out of this mess."},{"name":"THEOMOCENT","text":"If we could only track down the author of the letters and convince them to recant these statements, the student body would have no choice but to withdraw their motion... But where would we even search?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"By searching for more of the same document."},{"name":"A1","text":"..."},{"name":"THEOMOCENT","text":"A brilliant plan, <span class=\"highlight\">Forename</span>! By examining all the letters that have been distributed throughout the scholasticate, we may very well find clues leading us to the culprit!"},{"name":"LEIGH","text":"I guess you're as stumped as we are. It's not as if we'd be able to glean any important clues from just these four slips of paper."},{"name":"THEOMOCENT","text":"If this isn't enough, then let us begin by finding the rest of the letters. Perhaps they'll prove more enlightening."},{"name":"LEIGH","text":"It's settled, then! Let's return to the scholasticate and commence our search!"},{"name":"THEOMOCENT","text":"A few of the seminarians were generous enough to lend us letters they received. Upon closer examination, it would appear that while the overarching message is the same, the precise arguments made differ from letter to letter. Whatever could this mean...?"},{"name":"LEIGH","text":"It would seem that more than a few of the students tossed the papers in the rubbish without so much as reading them. Thankfully, I was able to scavenge some of the ones that had been thrown away."},{"name":"JANCHETTE","text":"Suspicious letters? Whatever are you talking about? I've not received anything of the sort."},{"name":"JANCHETTE","text":"Now that you mention it, however, I did observe some of the seminarians tossing out crumpled slips of paper. Mayhap these are the letters you seek?"},{"name":"JANCHETTE","text":"I wish I could be of more assistance, but I fear that is the extent of my knowledge. Good luck in your search."},{"name":"CRAMMEVOIX","text":"Theo has already apprised me of the situation. Not that he needed to, mind you. It is for that very reason that I remained behind with Blaisie─to investigate the origin of the nasty rumors flying about."},{"name":"CRAMMEVOIX","text":"It didn't take long for us to connect the rumors to the letters and coax one of the seminarians to show us the document they had received."},{"name":"CRAMMEVOIX","text":"I investigated further, and behold! These are all the ones I managed to collect in my search thus far."},{"name":"CRAMMEVOIX","text":"Under normal circumstances, the baseless invectives penned here would hardly suffice to convince anyone. It would seem, however, years of harbored animosity have blinded people to their better judgment."},{"name":"CRAMMEVOIX","text":"So intense is the hostility towards Archombadin that seminarians are desperately searching for any excuse to have him removed from the scholasticate. These letters have provided just that, and at the worst possible time."},{"name":"BLAISIE","text":"Oh, yes! In fact, Crammevoix and I have been gathering letters all <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>. Feast your eyes on this!"},{"name":"BLAISIE","text":"One of the girls said that the letter just showed up on her bed, as if out of nowhere! I returned to my quarters to check if I had received something similar, but there was nothing to be found."},{"name":"BLAISIE","text":"At first I thought it a simple oversight, but after asking around, I learned that there were more than a few others who, like me, had been overlooked."},{"name":"BLAISIE","text":"Which leads us to the question: why is it that only certain seminarians are receiving the letters? What is it they have in common?"},{"name":"LEIGH","text":"Excellent work! Give them to Theo, that we might compare them with the others."},{"name":"THEOMOCENT","text":"Ah, <span class=\"highlight\">Forename</span>! Did your search prove fruitful?"},{"name":"THEOMOCENT","text":"Excellent! Let us take a closer look and see what we can discern."},{"name":"THEOMOCENT","text":"Hmmm...how curious. It would appear our culprit has gone through the trouble of writing and distributing three distinctly different versions of the letter."},{"name":"THEOMOCENT","text":"The first reads:<br>“As illustrated by the recent abduction that has taken place within these sacred halls, Archombadin will stop at nothing to eliminate those who stand in his way. Such blatant disrespect of Her teachings must not be tolerated.”"},{"name":"THEOMOCENT","text":"The second says:<br>“It is one thing to disagree with the opinions of your fellow seminarians. It is quite another to abuse one's influence to have your ideological opponents removed. Ulaa, a firm believer in the teachings of volume eleven of the <span class=\"emphasis\">Articles of Halonic Polity</span> and staunch advocate of equality fell victim to Archombadin's treachery. The villain cannot go unpunished.”"},{"name":"THEOMOCENT","text":"And last but not least:<br>“Ulaa's copy of volume eleven was discovered in the prefect's room shortly after the girl's disappearance. This, more than anything, proves beyond a shadow of a doubt that Archombadin is guilty.”"},{"name":"CRAMMEVOIX","text":"While the final letter at least offers an argument, it's hardly a compelling one."},{"name":"LEIGH","text":"Correct me if I'm mistaken, but aren't there several copies of the <span class=\"emphasis\">Articles of Halonic Polity</span> sitting on our library shelves? While I can't speak to why Archombadin would have one in the first place, the book found in his quarters could have been any one of those."},{"name":"THEOMOCENT","text":"Blaisie. When you spoke with Ulaa earlier, did she mention anything about volume eleven?"},{"name":"BLAISIE","text":"I...I didn't think anything of it at the time, but while Ulaa was recovering in the infirmary, she asked that I retrieve her copy from her room. When I went to look for it, it wasn't there."},{"name":"CRAMMEVOIX","text":"...Which would mean the tome was removed unbeknownst to her."},{"name":"BLAISIE","text":"So it would seem. After all, she testified that when the two thugs seized her at the marketplace, she had nothing on her person but a pocket of gil. Presumably, the book was still in her quarters then."},{"name":"LEIGH","text":"It would be one thing if the book had disappeared with Ulaa, but for someone to sneak into her room and remove it after the fact? Why, it's as if the culprit intended to use it to frame Archombadin all along!"},{"name":"CRAMMEVOIX","text":"Why, I'd bet my last gil you're right, and that that's the reason none of us received a letter. We're the only people who would be able to confirm with Ulaa that the book had been pilfered from her room."},{"name":"THEOMOCENT","text":"...But who would go to such great lengths to frame Archombadin?"},{"name":"CRAMMEVOIX","text":"That's our Theo! Always striving to help his fellow man, even if that man is all that stands between him and the top of the class. It's enough to leave a girl smitten...isn't it, Blaisie?"},{"name":"BLAISIE","text":"Wh-What are you talking about!? I-I-I'm not smitten! I just admire him for his...kind heart, is all!"},{"name":"THEOMOCENT","text":"B-Blaisie!? Whyever did she dash off like that? Has she taken ill?"},{"name":"CRAMMEVOIX","text":"In a manner of speaking... I'll...I'll go and make sure she's okay."},{"name":"THEOMOCENT","text":"Oh dear. Well, whatever it is, I hope she recovers quickly. In the meantime, we need to put our heads together if we hope to get out of this mess. <span class=\"highlight\">Forename</span>, what do you think? Why would anyone go to such lengths to implicate Archombadin?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"To throw others off the scent...?"},{"name":"A2","text":"Perhaps he implicated himself?"},{"name":"THEOMOCENT","text":"But of course! None save the kidnapper him or herself would have such a strong motive to concoct this convoluted plan! Which raises the possibility that the kidnapping was naught but a plot to have Archombadin expelled in the first place!"},{"name":"LEIGH","text":"In other words, if we can track down the person behind these letters, we'll have ourselves the culprit behind Ulaa's abduction! We must inform Inspector Briardien straightaway!"},{"name":"THEOMOCENT","text":"He's currently conducting an investigation at the Vault, you say? Let us make our way there with all speed!"},{"name":"THEOMOCENT","text":"But of course! Archombadin is so fed up with the rest of us that he's conceived this whole plot to get <span class=\"emphasis\">himself</span>─no, wait a minute! <span class=\"highlight\">Forename</span>, are you having a jest at our expense!?"},{"name":"LEIGH","text":"Well, logically, the only reason anyone would go to such great lengths to frame Archombadin was if they were trying to throw suspicion off themselves. Which raises the possibility that─as mad as it may sound─the kidnapping was simply a plot to get him expelled in the first place."},{"name":"LEIGH","text":"Think about it. It at least explains one thing. Ulaa's kidnapping was far from typical─she was not harmed, nor did her abductors demand any ransom for her release."},{"name":"THEOMOCENT","text":"You may very well be onto something, Leigh! We must report to Inspector Briardien straightaway. You say he's investigating at the Vault, <span class=\"highlight\">Forename</span>? Then let us go there!"},{"name":"LEIGH","text":"Ah, a perfect vantage point. From here..."},{"name":"CRAMMEVOIX","text":"Blaisie's quicker than she looks. I gave up my search when it became evident I had no chance of finding her and was just on my way back when lo and behold, who do I see but you three?"},{"name":"LEIGH","text":"That's him! Over there!"},{"name":"BRIARDIEN","text":"Ah...it's you. What brings you all the way here? Do you have something to report?"},{"name":"BRIARDIEN","text":"...I see. Show me these letters. I shall determine if they are as suspicious as you insist."},{"name":"THEOMOCENT","text":"This is everything we've been able to find."},{"name":"BRIARDIEN","text":"The author goes out of his way to mention that Ulaa's copy of volume eleven was found in Archombadin's room."},{"name":"BRIARDIEN","text":"...The fool. In his feeble plot to frame the prefect, he has only incriminated himself."},{"name":"BRIARDIEN","text":"I trust that you, too, have put the pieces together?"},{"name":"BRIARDIEN","text":"You have proven an able associate, indeed. It is from here, however, that the real work begins. Should at any time you begin to feel your powers of concentration waver or your attention to detail slip, you need but do this: take a deep breath and focus your eyes into the distance. In that moment, the solution will appear before you."},{"name":"BRIARDIEN","text":"The game is afoot, and if we intend to win the day, we must remain vigilant. Now, let's get our man!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Spectacles</span>!"}],"reward":{"gil":615,"emote":"Spectacles","items":[{"id":17717}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67898]},"next":[67900]},"partials":[{"type":"npc","id":"1017914","obj":{"i":1017914,"n":"Theomocent","l":2301,"q":2}},{"type":"npc","id":"1017923","obj":{"i":1017923,"n":"Theomocent","l":2301,"q":1}},{"type":"npc","id":"1017915","obj":{"i":1017915,"n":"Leigh","l":2301,"q":2}},{"type":"npc","id":"1017916","obj":{"i":1017916,"n":"Theomocent","l":2337,"q":1}},{"type":"npc","id":"1017917","obj":{"i":1017917,"n":"Leigh","l":2337,"q":1}},{"type":"npc","id":"1017918","obj":{"i":1017918,"n":"Janchette","l":2337,"q":1}},{"type":"npc","id":"1017919","obj":{"i":1017919,"n":"Crammevoix","l":2337,"q":1}},{"type":"npc","id":"1017920","obj":{"i":1017920,"n":"Blaisie","l":2337,"q":1}},{"type":"npc","id":"1017924","obj":{"i":1017924,"n":"Leigh","l":2301,"q":1}},{"type":"npc","id":"1017925","obj":{"i":1017925,"n":"Crammevoix","l":2301,"q":1}},{"type":"item","id":"17717","obj":{"i":17717,"n":"Inspector's Eyeglasses","l":1,"c":40966,"t":34,"p":100}},{"type":"quest","id":"67898","obj":{"i":67898,"n":"The Whipping Boy","g":78,"l":"Saint Endalim's Scholasticate","s":31}},{"type":"quest","id":"67900","obj":{"i":67900,"n":"The Life and Lies of Father Saturnois","g":78,"l":"Ishgard","s":33}}]}