{"quest":{"name":"Griffin, Griffin on the Wall","location":"Mor Dhona","id":67890,"patch":3.5,"sort":14,"icon":100613,"eventIcon":71201,"issuer":1018020,"target":1018026,"involved":[1018010,1018021,1018022,1018023,1018024,1018025,1018027,1018028,1018029,1018030,1018031,1018359,1018360,1018361,1018362,1018363],"genre":5,"journal":["Alisaie seems eager to discuss the council's decision with the other Scions.","Having apparently had her fill of the hustle and bustle of the town square, Alisaie declares her intention to retire inside to await the return of her brother and the others. Join her in the Rising Stones.","Shortly after Alphinaud's arrival, a meeting is convened to discuss the outcome of the council. Hoping to convince the Griffin to abandon his course before war engulfs the realm, it is decided that Papalymo, Yda, Thancred, and Yugiri will brave the secret tunnels beneath Baelsar's Wall, and endeavor to confront the Resistance leader directly. You, meanwhile, are to stand ready in the Black Shroud for whatever eventuality may arise. Notify Alphinaud when you have made the necessary preparations.","Alphinaud urges you to conclude any business you have in Revenant's Toll, and meet him at the Hawthorne Hut in the East Shroud.","Outside the Hawthorne Hut, you bid the infiltration team good fortune on their mission. After they depart, Alphinaud mentions that Amarissaix's Spire offers a clear view of the Wall, and suggests that you speak with the Alliance commanders who have gathered atop the lookout platform. Identify yourself to the serpent scout at the foot of the tower.","It would seem that fighting has broken out on Baelsar's Wall. Scouts report that the Griffin has begun his assault, his soldiers apparently clad in Grand Company uniforms... Plainly, the Resistance leader will stop at nothing to drag the Alliance into his conflict. To make matters worse, your fellow Scions are headed into the eye of this storm, wholly unaware of what awaits them on the surface... Despite the danger, Alphinaud resolves to plunge into the thick of the battle in an attempt to save the day. You have little choice but to join your young friend at the approach to the Wall.","Alphinaud outlines a simple plan wherein he will pursue the infiltration team through the tunnels while you scale the fortifications with a party of your most trusted comrades. You must reach the top of the Wall and force the Griffin to withdraw before the unthinkable happens!<br><br>※Challenge Baelsar's Wall with other players via the Duty Finder, or with a party of NPCs via Duty Support. Both systems are accessible from the main menu as well as the dungeon's entrance point.","You have overpowered the Griffin. See events to their conclusion before making your escape from the top of the Wall.","Beneath the mask, the Griffin is revealed to be none other than Ilberd, the disgraced captain of the Crystal Braves. Following his “defeat,” the Resistance leader enacts his true plan─a ritual to summon a nightmarish primal empowered by Ala Mhigan desperation and the might of Nidhogg's eyes. Fearing a disaster to rival the Calamity itself, Papalymo steps forward with Tupsimati, and grimly begins to weave a forbidden magick of confinement... You barely have time to escape on Hilda's airship before the incantation swallows Papalymo and encases the newborn entity in a vast cocoon of light.<br><br>Stunned by the unexpected summoning and the loss of her dearest friend, Yda's irrepressible spirit seems to have been broken at last. Offer her what comfort you may.","You attempt to speak with Yda, but there seems to be nothing you can say that will pierce the shroud of her grief. Thancred offers to watch over her whilst you and the others return to the Rising Stones with the tidings of Papalymo's demise."],"objectives":["Enter the Rising Stones.","Speak with Alphinaud.","Speak with Alphinaud near the Hawthorne Hut.","Speak with the serpent scout at Amarissaix's Spire.","Speak with Alphinaud.","Use the Duty Finder to climb Baelsar's Wall.","Speak with Yda."],"dialogue":[{"name":"YUGIRI","text":"Even now, I am astonished by how closely Mistress Alisaie resembles Master Alphinaud. Their very mannerisms are alike. From a distance, I should be hard-pressed to tell one from the other─until they opened their mouths, of course..."},{"name":"ALISAIE","text":"Well, as much as I enjoy the bustle of the Toll, I think it's time we headed inside. My brother and the others will not be long."},{"name":"YSHTOLA","text":"Ah, you are returned from the council. But what of Alphinaud? Did some other matter require his attention?"},{"name":"ALPHINAUD","text":"Mine apologies, friends. I trust we have not kept you waiting overlong."},{"name":"YDA","text":"Greetings, everyone!<br>Oh, Krile─how's Naago doing? She <span class=\"emphasis\">will</span> be all right, won't she?"},{"name":"KRILE","text":"I don't see why not. She's sleeping at the moment. Tataru is keeping an eye on her, so we'll know soon enough if there's any change in her condition."},{"name":"YSHTOLA","text":"Her wounds are healing well. With sufficient rest, I am certain she will make a full recovery."},{"name":"YDA","text":"Thank goodness for that."},{"name":"YSHTOLA","text":"Now, mayhap you would share with us the council's decision?"},{"name":"ALISAIE","text":"Each of the nations, Ishgard included, has committed to providing military support to Gridania. The Eorzean Alliance will soon have a significant force in the Black Shroud, ready to respond to any imperial act of aggression."},{"name":"YDA","text":"You know, I almost wish the council would stop messing around and give the Griffin what he wants. I wouldn't like to be the imperial caught between the Resistance and the Alliance!"},{"name":"PAPALYMO","text":"Yda, you cannot seriously─ One does not lightly go to war with the Garlean Empire."},{"name":"ALPHINAUD","text":"Quite. To open hostilities without due consideration would be to invite disaster. &lt;sigh&gt; If only there were some way to reach the Griffin─some means to convince him to abandon this reckless course..."},{"name":"PAPALYMO","text":"It may not be entirely unfeasible."},{"name":"PAPALYMO","text":"There is a network of tunnels beneath Baelsar's Wall─secret passages dug by the Resistance to provide a way out of Ala Mhigo."},{"name":"YSHTOLA","text":"...Which may equally serve as a way in?"},{"name":"PAPALYMO","text":"Precisely. If all are in agreement, I would be the one to undertake the necessary negotiations. I am familiar with the route, and the Resistance is familiar with me."},{"name":"YDA","text":"About as familiar as they are with <span class=\"emphasis\">me</span>, you mean? Say what you want─I'm coming too!"},{"name":"YUGIRI","text":"I have some experience in the practice of infiltration. If you would have me, my services are at your disposal."},{"name":"THANCRED","text":"As are mine. It has been far too long since I shared a shadow with a shinobi, and I do not intend to waste the opportunity."},{"name":"YSHTOLA","text":"Four is quite sufficient for an infiltration mission. Greater numbers will only serve to increase the risk of detection. Krile and I will direct our energies elsewhere. What of you Leveilleurs?"},{"name":"ALPHINAUD","text":"I will return to the East Shroud, and stand watch over the border. Should matters take a turn for the worse, 'twould seem wise to be on hand."},{"name":"ALPHINAUD","text":"Might I prevail upon you to accompany me, <span class=\"highlight\">Forename</span>? Gridania will be safer for your presence. And...while it may not seem the most thrilling duty, dear sister, might I ask that you remain at the Rising Stones to pass on messages and so on?"},{"name":"ALISAIE","text":"To <span class=\"emphasis\">hold the fort</span>, you mean.<br>...Very well. I suppose the task must fall to someone."},{"name":"ALISAIE","text":"Safe travels, all of you."},{"name":"ALISAIE","text":"I suspect Tataru would have little trouble facilitating communication between our forces under normal circumstances. But I concede she has her hands full nursing that Resistance fighter back to health. No matter: my turn in the field will come."},{"name":"YDA","text":"All I'm saying is that it wouldn't be the worst thing if we ended up joining the Griffin's fight against the Empire. I mean, it's going to happen sooner or later, isn't it?"},{"name":"PAPALYMO","text":"...I may perhaps have exaggerated my standing with the Resistance a little. But I am confident that I have a reasonable chance of putting a stop to this madness before events spiral out of control. Yes, fair-to-middling at the very least..."},{"name":"YUGIRI","text":"My fellow shinobi required little encouragement to take their place amongst the Alliance forces massing in Gridania. They are most eager to cross blades with the armies of Garlemald once more."},{"name":"THANCRED","text":"I am no ninja, but I did spend some few moons in the Sharlayan homeland learning how to move unseen. Between Yugiri and my humble self, Yda and Papalymo will be well protected."},{"name":"ALPHINAUD","text":"If you have any unfinished business in the Toll, pray attend to it now. I would depart for the Hawthorne Hut without delay."},{"name":"ALPHINAUD","text":"The nearby watchtower offers an unobstructed view of Baelsar's Wall, and I should be interested to speak to the Alliance commanders who have installed themselves at its top."},{"name":"ALPHINAUD","text":"Ah, <span class=\"highlight\">Forename</span>, there you are. Come, Amarissaix's Spire awaits."},{"name":"ALPHINAUD","text":"The Alliance officers on the platform should be able to apprise us of any developments at the Wall."},{"name":"THANCRED","text":"Fancy meeting the two of you here. We were about to set forth."},{"name":"ALPHINAUD","text":"Indeed. I was about to say, “Twelve watch over you,” but I doubt you have need of divine protection, even if you <span class=\"emphasis\">are</span> venturing into enemy territory..."},{"name":"YDA","text":"Don't worry, Alphinaud─we'll have the Griffin by the scruff of the neck before you know it!"},{"name":"PAPALYMO","text":"Do make up your mind, Yda. Nary a moment ago, you seemed ready to shake the Griffin by the <span class=\"emphasis\">hand</span> rather than the neck. So, which is it to be? 'Twould be best to decide <span class=\"emphasis\">before</span> we enter into negotiations."},{"name":"YDA","text":"<span class=\"emphasis\">Trust me</span>, Papalymo: I'll shake whatever needs shaking. The talking part I leave to you!"},{"name":"PAPALYMO","text":"...I think I feel a headache coming on. Let's be on our way, shall we?"},{"name":"ALPHINAUD","text":"Ah, some things never change...<br>Well then, shall we make for the spire? Our Alliance friends will doubtless have news for us."},{"name":"SERPENTSCOUT","text":"Welcome, Warrior of Light. I assume you are here to speak with our commanding officers?"},{"name":"SERPENTSCOUT","text":"You will find them on the observation platform. Pray proceed."},{"name":"PIPIN","text":"Greetings, my friends. 'Tis good to see you both well."},{"name":"HILDA","text":"I was hopin' you might turn up. I've dragged half the watch here, see, and the sight of you might help remind 'em why we bothered."},{"name":"RASHAHT","text":"If memory serves, I have not seen many of you since the day of the grand melee. Having borne the brunt of your blows, may I say what an honor it is to stand at your side!"},{"name":"ALPHINAUD","text":"'Tis heartening indeed to see the realm's most stalwart defenders thus gathered in common cause. Speaking of which─what news from the Wall?"},{"name":"VORSAILE","text":"All has been quiet."},{"name":"VORSAILE","text":"Report! <span class=\"emphasis\">What</span>? Seven hells... Fighting has broken out on top of the Wall! A full-scale assault!"},{"name":"PIPIN","text":"So the Griffin has made his move."},{"name":"VORSAILE","text":"<span class=\"emphasis\">Someone</span> has..."},{"name":"HILDA","text":"And what's that s'posed to mean?"},{"name":"VORSAILE","text":"The attackers, they─ They're wearing Grand Company colors."},{"name":"RASHAHT","text":"Impossible. We gave no such order."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Of course...</span> The Wall was never the Griffin's target─it was bait. We have been goaded into deploying our armies nearby, thus lending weight to this deception!"},{"name":"VORSAILE","text":"If those uniforms were convincing enough to deceive my scouts, the Empire will surely think we've launched an offensive. This could mean war!"},{"name":"ALPHINAUD","text":"Even so...this may yet be no more than a diversion. With the armies of the Alliance occupying the Empire's attention, it would be comparatively easy for the Griffin's supporters to slip into Ala Mhigo."},{"name":"ALPHINAUD","text":"He could then incite a rebellion amongst the populace which the imperial reserves would be hard-pressed to contain. Eorzea, meanwhile, would be plunged into chaos."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, we must make for the Wall at once."},{"name":"PIPIN","text":"What, just the two of you!?"},{"name":"ALPHINAUD","text":"Our companions embarked on a mission to sway the Griffin from his course, and are likely halfway to his command post by now. They will emerge in the midst of a raging battle and I do not mean to abandon them to their fate."},{"name":"ALPHINAUD","text":"It will be dangerous, aye, but the confusion may work to our advantage. If we are careful to avoid the skirmishing, it may yet be possible to reach the Griffin...and if we can do that..."},{"name":"PIPIN","text":"Lady Hilda─might I ask that you have an airship ready to bear the Scions to safety?"},{"name":"HILDA","text":"Ha! I don't know who this <span class=\"emphasis\">Lady</span> Hilda is, Marshal, but you can count on me."},{"name":"RASHAHT","text":"We must prepare for imperial reprisals. May the Navigator guide us through the storm!"},{"name":"IRONMASK","text":"Forward, comrades! The time has come to drive the Empire from Ala Mhigo, and force action upon those who have turned their backs to our suffering for so long!"},{"name":"IRONMASK","text":"Let this victory be the first step in the liberation of our homeland!"},{"name":"IRONMASK","text":"Ala Mhigo will be free─no matter the cost."},{"name":"ALPHINAUD","text":"From what Papalymo told me, the trail ahead should lead us into the shadow of the Wall."},{"name":"ALPHINAUD","text":"As we have two objectives, I suggest we divide our forces. I shall make straightways for the tunnels, and attempt to intercept our comrades ere they stumble into a bloodbath."},{"name":"ALPHINAUD","text":"While I do so...I must ask that you scale the Wall. Know that I would not propose such a course if there were any other way. But the time for subtlety is past. Take a band of your most trusted companions and cut a path through to the Griffin. Make him see reason─by any means necessary."},{"name":"ALPHINAUD","text":"Once we are free of the tunnels, we will make for your position with all due haste. And if everything proceeds according to plan, Hilda will then swoop in and spirit us all away to safety. I only pray that we have enough time."},{"name":"SERPENTSCOUT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Milady</span><span class=\"alternative\">Sir</span></span>! As per Marshal Tarupin's orders, we will provide a feint to cover your advance. May the Crystal light your way forward!"},{"name":"YUGIRI","text":"I understand only too well the desire to reclaim one's homeland...but I cannot condone such slaughter."},{"name":"THANCRED","text":"Papalymo knew what he was doing. I could not refuse him."},{"name":"PIPIN","text":"It has been explained to me what that light represents, and I have ordered our forces to stand ready. It seems we can do little else but wait..."},{"name":"ALPHINAUD","text":"How many more must we lose...?"},{"name":"HILDA","text":"Every Ishgardian gets taught that the Sea of Clouds churns in the grip of the warrin' elements of water and wind. Enough to tear you apart, they say. No one's <span class=\"emphasis\">ever</span> gone to the bottom of the abyss and lived to tell the tale. So how did that bastard manage to get his hands on Nidhogg's eyes?"},{"name":"YDA","text":"Why...?"},{"name":"YDA","text":"Why didn't they let me stay!?"},{"name":"YDA","text":"Papalymo is my friend! I should have been there with him!"},{"name":"THANCRED","text":"You could see it in his eyes, Yda. He knew what he was doing─what had to be done."},{"name":"THANCRED","text":"Master Louisoix wore that same look, right before the end..."},{"name":"YDA","text":"Do you think I don't know that!? I know, all right! <span class=\"emphasis\">I know.</span>"},{"name":"THANCRED","text":"There is nothing more you could have done. Ilberd caught us all off guard. Even <span class=\"highlight\">Forename</span> was powerless to stop him."},{"name":"THANCRED","text":"If you must blame someone, then blame me. Just promise that you will never forget what Papalymo strove to protect, or the lessons he tried to teach you."},{"name":"YDA","text":"...Don't. Don't speak to me."},{"name":"THANCRED","text":"Leave Yda with me. Go on. Go back to the Rising Stones. The others need to know what happened here."}],"reward":{"gil":5000,"items":[{"id":17635}],"xp":16740,"instance":48},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67889]},"next":[67891]},"partials":[{"type":"npc","id":"1018020","obj":{"i":1018020,"n":"Alisaie","l":67,"q":2}},{"type":"npc","id":"1018026","obj":{"i":1018026,"n":"Yda","l":55,"q":2}},{"type":"npc","id":"1018010","obj":{"i":1018010,"n":"Serpent Scout","l":55,"q":2}},{"type":"npc","id":"1018021","obj":{"i":1018021,"n":"Yugiri","l":67,"q":2}},{"type":"npc","id":"1018022","obj":{"i":1018022,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1018023","obj":{"i":1018023,"n":"Alphinaud","l":55,"q":1}},{"type":"npc","id":"1018024","obj":{"i":1018024,"n":"Serpent Scout","l":55,"q":1}},{"type":"npc","id":"1018025","obj":{"i":1018025,"n":"Alphinaud","l":55,"q":1}},{"type":"npc","id":"1018027","obj":{"i":1018027,"n":"Hilda","l":55,"q":2}},{"type":"npc","id":"1018028","obj":{"i":1018028,"n":"Pipin","l":55,"q":2}},{"type":"npc","id":"1018029","obj":{"i":1018029,"n":"Alphinaud","l":55,"q":2}},{"type":"npc","id":"1018030","obj":{"i":1018030,"n":"Yugiri","l":55,"q":2}},{"type":"npc","id":"1018031","obj":{"i":1018031,"n":"Thancred","l":55,"q":2}},{"type":"npc","id":"1018359","obj":{"i":1018359,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1018360","obj":{"i":1018360,"n":"Yda","l":481,"q":1}},{"type":"npc","id":"1018361","obj":{"i":1018361,"n":"Papalymo","l":481,"q":1}},{"type":"npc","id":"1018362","obj":{"i":1018362,"n":"Yugiri","l":481,"q":1}},{"type":"npc","id":"1018363","obj":{"i":1018363,"n":"Thancred","l":481,"q":1}},{"type":"item","id":"17635","obj":{"i":17635,"n":"Another Brick Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"48","obj":{"i":48,"n":"Baelsar's Wall","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":230}},{"type":"quest","id":"67889","obj":{"i":67889,"n":"An Allied Decision","g":5,"l":"Gridania","s":13}},{"type":"quest","id":"67891","obj":{"i":67891,"n":"Louisoix's Finest Student","g":5,"l":"East Shroud","s":15}}]}