{"quest":{"name":"Louisoix's Finest Student","location":"East Shroud","id":67891,"patch":3.5,"sort":15,"icon":100614,"eventIcon":71201,"issuer":1018029,"target":1018033,"involved":[1018026,1018027,1018028,1018030,1018031,1018034],"genre":5,"journal":["It is plain that recent events have shaken Alphinaud to the core.","Though he has scarcely begun to come to terms with what came to pass at Baelsar's Wall, Alphinaud resolves to gather the Scions and make a full report. Head back to the Rising Stones, and announce your return to Alisaie.","After relating the events that took place in Ala Mhigo, Alphinaud finally breaks the news of Papalymo's passing. Coming so soon after the loss of Minfilia, the Archon's death seems even harder to bear, but all present resolve to honor his sacrifice through decisive action. For though the fallen thaumaturge's spell has granted the realm some precious respite, the primal summoned by Ilberd will not be contained forever..."],"objectives":["Speak with Alisaie at the Rising Stones."],"dialogue":[{"name":"YUGIRI","text":"I understand only too well the desire to reclaim one's homeland...but I cannot condone such slaughter."},{"name":"YDA","text":"...It's over, Papalymo.<br>It's all over..."},{"name":"THANCRED","text":"Leave her be. Nothing you can say will console her now..."},{"name":"PIPIN","text":"It has been explained to me what that light signifies, and I have ordered our forces to stand ready. It seems we can do little else but wait..."},{"name":"HILDA","text":"Every Ishgardian gets taught that the Sea of Clouds churns in the grip of the warrin' elements of water and wind. Enough to tear you apart, they say. No one's <span class=\"emphasis\">ever</span> gone to the bottom of the abyss and lived to tell the tale. So how did that bastard manage to get his hands on Nidhogg's eyes?"},{"name":"ALPHINAUD","text":"...Once again, I find myself at a loss for words."},{"name":"ALPHINAUD","text":"But Thancred is right. We must return to the Rising Stones and apprise our companions of...all of this."},{"name":"ALPHINAUD","text":"Pray make your way there at once. I will send word to Y'shtola and the others of our imminent return."},{"name":"ALPHINAUD","text":"Let us return to the Rising Stones. We must gather our companions..."},{"name":"TATARU","text":"Why does everyone look so grim? Has something happened? Say something, for heavens' sake!"},{"name":"ALISAIE","text":"...'Twould seem you bring ill tidings, Brother."},{"name":"ALPHINAUD","text":"...Aye. Behind the Griffin's mask, we found the grinning face of an old adversary... <span class=\"emphasis\">Ilberd</span>. I know not how, but he had in his possession the eyes of Nidhogg, whose dread power he used to initiate a summoning ritual, even as we looked on..."},{"name":"YSHTOLA","text":"By the Twelve..."},{"name":"ALISAIE","text":"I don't understand. To attempt such a magick requires every onze of one's aether. No one─not even Grandfather─could cast it and hope to survive..."},{"name":"ALPHINAUD","text":"Indeed. It was ever a last resort─as I am certain Papalymo was aware."},{"name":"URIANGER","text":"Thus did the pupil follow in the footsteps of his master...even unto the grave."},{"name":"ALPHINAUD","text":"I have as yet been unable to explain how Ilberd came to possess Nidhogg's eyes."},{"name":"ALPHINAUD","text":"In the depths of the Sea of Clouds, a perpetual storm of water- and wind-aspected aether rages. No mortal could endure such conditions."},{"name":"YSHTOLA","text":"Then mayhap it was the work of an Ascian. But now is not the time for idle speculation. Krile, I have need of your assistance."},{"name":"KRILE","text":"I─ Yes. Yes, of course."},{"name":"YSHTOLA","text":"We must inspect the cocoon of light, and ascertain the state of the primal trapped within. Between our respective talents, I daresay we shall glean some measure of insight."},{"name":"KRILE","text":"Understood. I can't promise I'll be able to sense much through the barrier, but I shall certainly do my best."},{"name":"YSHTOLA","text":"As shall I. Let us be about it, then."},{"name":"ALISAIE","text":"...What, without so much as a “by your leave”!?"},{"name":"URIANGER","text":"Pray forgive Archon Y'shtola her brevity. She seeketh employment, lest her grief deprive her of the will to act. A desire to comfort Yda doubtless compoundeth her unseemly haste."},{"name":"URIANGER","text":"I, too, must contend with this grievous loss in mine own way. By thy leave, Lady Alisaie, I shall honor our fallen colleague through gainful study. There exist writings which may yet further our understanding of this cocoon of light..."},{"name":"ALISAIE","text":"...Mayhap I was too quick to judge. Surrendering to sadness and regret would be a poor tribute to Papalymo's sacrifice."},{"name":"ALPHINAUD","text":"Quite. We must begin preparations to face Ilberd's accursed creation without delay. What time we have was purchased at too dear a price for us to squander it."}],"reward":{"gil":848,"items":[{"id":17631}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67890]},"next":[67892]},"partials":[{"type":"npc","id":"1018029","obj":{"i":1018029,"n":"Alphinaud","l":55,"q":2}},{"type":"npc","id":"1018033","obj":{"i":1018033,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1018026","obj":{"i":1018026,"n":"Yda","l":55,"q":2}},{"type":"npc","id":"1018027","obj":{"i":1018027,"n":"Hilda","l":55,"q":2}},{"type":"npc","id":"1018028","obj":{"i":1018028,"n":"Pipin","l":55,"q":2}},{"type":"npc","id":"1018030","obj":{"i":1018030,"n":"Yugiri","l":55,"q":2}},{"type":"npc","id":"1018031","obj":{"i":1018031,"n":"Thancred","l":55,"q":2}},{"type":"npc","id":"1018034","obj":{"i":1018034,"n":"Tataru","l":481,"q":1}},{"type":"item","id":"17631","obj":{"i":17631,"n":"Forever Lost Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"67890","obj":{"i":67890,"n":"Griffin, Griffin on the Wall","g":5,"l":"Mor Dhona","s":14}},{"type":"quest","id":"67892","obj":{"i":67892,"n":"The Obvious Solution","g":5,"l":"The Rising Stones","s":16}}]}