{"quest":{"name":"The Whipping Boy","location":"Saint Endalim's Scholasticate","id":67898,"patch":3.5,"sort":31,"icon":100626,"eventIcon":71221,"issuer":1017897,"target":1017912,"involved":[1017909,1017910,1017911,1017913,1017914,1017915,1018296,1018297,1018298],"genre":78,"journal":["Theomocent looks down and sighs in defeat.","The students come to the conclusion that your best chance at stopping the petition is to beat the angry mob to Father Saturnois and explain the situation to him. While Crammevoix and Blaisie stay behind to investigate a matter on their own, Leigh asks that you accompany him and Theomocent to Saint Reymanaud's Cathedral, that you might catch Father Saturnois upon his return from meeting with the headmistress.","To the surprise of all, Father Saturnois is already aware of why you have come. He then shocks everyone by calmly stating that he has already received the petition, and furthermore intends to throw his full support behind the proposal to expel Archombadin from the scholasticate. More disturbing still is his rationale for doing so: he does not necessarily believe the prefect was responsible for Ulaa's abduction, but wishes to make an example of him nevertheless. With a half-crazed gleam in his eye, he tells of his tragic past─how he, too, had been raised by Father Choisseau, and how he suffered the loss of his best friend and confidant. It would seem his belief that any who would refute the teachings of volume eleven bear responsibility for all of Ishgard's sins nigh borders on fanaticism. With Archombadin's fate all but sealed, perhaps the only person who can find a way out of this predicament is the very boy whose future hangs in the balance. Seek Archombadin out in the Pillars that you might discuss a plan.","Archombadin is irate to a point that Theomocent's best efforts to reason with him go completely ignored. Asking that you work your magic once more, Theomocent beseeches you to /soothe the agitated Dzemael heir.","Your attempts to calm Archombadin's nerves serve only to further stoke his ire, and he turns to you, accusing Theomocent and Leigh of circulating rumors and letters to convict him of a crime he did not commit. Leigh and Theomocent review the documents, and observe they contain no actual evidence that Archombadin is responsible for the kidnapping. Seeing the two seminarians are as confused as he is, Archombadin begins to regain his composure. Not entirely convinced he arrogantly refuses your help in hunting down the true culprit─something Lebrassoir, on the other hand, is altogether too eager to receive. Imperiously ordering you to report back with any information you might find, he scuttles off in his friend's wake."],"objectives":["Speak with Saturnois in Saint Reymanaud's Cathedral.","Speak with Archombadin.","/soothe Archombadin."],"dialogue":[{"name":"LEIGH","text":"I can understand not wanting to condemn the man without solid evidence but Theo practically threw himself on the bastard's burning pyre back there! And for what? He's suffered the most at Archombadin's hand! Why does he still try to help him!?"},{"name":"CRAMMEVOIX","text":"There's no stopping an angry mob, I fear. I wonder if any of us will emerge from this unscathed..."},{"name":"BLAISIE","text":"Theo is a man of unwavering principle. That's what I lo─er, admire about him. &lt;sigh&gt; I wish I too were possessed of such staunch conviction."},{"name":"THEOMOCENT","text":"If only I could have done more to dissuade them! This blind persecution will only serve to further divide us, and Archombadin's expulsion would be a tremendous loss for the scholasticate. Why will no one listen to reason!?"},{"name":"BLAISIE","text":"Theo, there's still time to turn things around─I'm sure of it! I-I'll help you in any way I can!"},{"name":"THEOMOCENT","text":"Thank you, Blaisie, for your kind words. Indeed, it's not too late to reverse the course of today's events. We should try speaking with Father Saturnois─surely, he'll know what to do."},{"name":"LEIGH","text":"Incredible! Despite all that, he's still intent on saving Archombadin! &lt;sigh&gt; <span class=\"highlight\">Forename</span>, there's no talking him out of it now. Considering how our last “discussion” ended, it would put me much at ease if you would accompany us."},{"name":"CRAMMEVOIX","text":"I shall be staying behind. There are a few things that I would attend to here. My dear Blaisie, if you would, I could do with an extra pair of hands."},{"name":"THEOMOCENT","text":"In that case, Leigh, <span class=\"highlight\">Forename</span>, let us make haste to the cathedral. The headmistress's meeting will not run forever, and we must catch Father Saturnois before the others do."},{"name":"CRAMMEVOIX","text":"Forgive me for keeping Blaisie. I required the aid of someone with a keen eye for detail, and she was the first one that came to mind."},{"name":"BLAISIE","text":"I can't bear to see Theo looking so sad. I'd do anything to put a smile back on his face..."},{"name":"THEOMOCENT","text":"Father Saturnois─please, we need your help!"},{"name":"LEIGH","text":"Father Saturnois, we need to talk to you. It's about Archombadin."},{"name":"SATURNOIS","text":"Theomocent, Leigh...and <span class=\"highlight\">Forename</span>. Whatever brings you here in such a hurry? Ah, mayhap it concerns the petition I just received from the student body?"},{"name":"SATURNOIS","text":"Not to worry. Rest assured that I have reviewed the document and will be submitting it to the headmistress shortly, along with my own strong recommendation in favor of Archombadin's immediate and irrevocable expulsion from the scholasticate."},{"name":"THEOMOCENT","text":"W-Wait, Father! We are not here in support of the petition, but rather to argue against it. We cannot rightly expel Archombadin for a crime that the evidence─or lack thereof─suggests he did not even commit!"},{"name":"SATURNOIS","text":"Quite true. And yet it is not because I believe him guilty that I have chosen to move forward with this proposal."},{"name":"THEOMOCENT","text":"Then...why!?"},{"name":"SATURNOIS","text":"For too long has our church been corrupted by men and women who would see its foundation built upon sin instead of virtue. I mean to put an end to this vicious cycle."},{"name":"THEOMOCENT","text":"What...what are you saying!?"},{"name":"SATURNOIS","text":"Theomocent, Leigh, there is something you must know. When I was young, I too was taken under the wing of Father Choisseau. It was by his good graces that I gained admission into the scholasticate, not unlike yourselves."},{"name":"SATURNOIS","text":"I devoted myself entirely to my studies, that I might prove myself worthy of his kindness. My dedication was rewarded when I graduated at the top of my class, and secured a prized position in the archives, alongside some of the Holy See's most esteemed individuals."},{"name":"SATURNOIS","text":"It was there that I met the man who would become my closest friend and confidant. For ten years he had toiled in the See's darkest recesses, working to see that the ugly truth of Ishgard's past would never see the light of day. Until the day the burden grew too great to bear, and he took his own life."},{"name":"SATURNOIS","text":"For years I was torn between grief and anger at not being able to save him from his fate. Fearing my anguish would consume me, I found succor in my religion. Day and night I'd pore over scripture, and soon I found myself back in these very halls, not as a student, but as a teacher."},{"name":"THEOMOCENT","text":"A tragic story, indeed, and you have my condolences for your loss... But what does any of this have to do with Archombadin!?"},{"name":"SATURNOIS","text":"“Of the Fury's love will all men receive, and by the balance of Her spear will all be set free.” Doubtless you, too, are familiar with these words."},{"name":"SATURNOIS","text":"Those who deny the teachings of volume eleven commit the greatest sin of all. They must bear full responsibility for the injustices wrought on the victims of our society. Master Archombadin has done naught but scorn the truths penned within the tome. His dismissal is long overdue."},{"name":"LEIGH","text":"This is madness! The Fury knows I bear no love for the bastard, but what you propose is to lay the blame for generation upon generation of the church's transgressions at his feet!"},{"name":"SATURNOIS","text":"I do only what must be done. Countless lives were lost in the Dragonsong War. We must needs purge the church of any who espouse the false ideal that all men are not born equal, that the sins of our past are never repeated and that the clergy might be restored to their former glory."},{"name":"SATURNOIS","text":"I have faith in you, my children. Reflect on the teachings of Father Choisseau. If you do not understand now, you will soon enough."},{"name":"THEOMOCENT","text":"It is true that Father Choisseau was an ardent advocate of equality, who strove always to adhere to the principles espoused in “Equal under Her ever-watchful gaze.” 'Tis equally true that Archombadin has been outspoken in condemning that selfsame passage. Still, that hardly warrants his expulsion!"},{"name":"LEIGH","text":"You must admit, the man has a point. Making an example of the son of one of Ishgard's most prominent houses <span class=\"emphasis\">would</span> send a message, and it just might be the fastest way to bring about the change he seeks. Whether or not that change would be for the better, however, is another matter entirely..."},{"name":"THEOMOCENT","text":"It was one thing when it was just an angry mob of seminarians calling for Archombadin's head. Now that Father Saturnois intends to lead the charge, it's another matter entirely. Whatever are we to do!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We must speak with Archombadin."},{"name":"A1","text":"I'm not entirely sure..."},{"name":"A1","text":"..."},{"name":"THEOMOCENT","text":"But of course! Archombadin's nothing if not astute─he's sure to have an idea or two on how to extricate himself from this predicament. Come, let us make for the Pillars!"},{"name":"LEIGH","text":"Theo, why don't we just let matters take their course? Archombadin's always going on about his superior intellect. If he's so damned clever, he'll find a way out of this himself."},{"name":"THEOMOCENT","text":"But of course, that's it! If there's anyone we can go to for ideas on how to resolve this mess, it's Archombadin himself! Come, let us make for the Pillars!"},{"name":"LEBRASSOIR","text":"Leave us! This has nothing to do with you!"},{"name":"THEOMOCENT","text":"<span class=\"highlight\">Forename</span>, what should we do!? I-I've never seen them like this!"},{"name":"LEIGH","text":"So that's why Archombadin hasn't been rampaging about the scholasticate. Call me crazy, but I almost feel sorry for Lebrassoir..."},{"name":"ARCHOMBADIN","text":"What baseless accusations would you care to hurl at me this time? Attempting to destroy the church? Or perhaps you're here to bring to light the personal hand I had in instigating the Dragonsong War?"},{"name":"ARCHOMBADIN","text":"Perhaps instead of entertaining every ridiculous rumor you hear, you might actually make yourself useful for once!"},{"name":"ARCHOMBADIN","text":"You can start by questioning those two beside you. After all, they're the ones who arranged this entire farce and have been spreading these letters in a pathetically transparent attempt to incriminate me that I might be expelled!"},{"name":"THEOMOCENT","text":"Please listen, Archombadin! We know that the accusations being leveled at you are unfounded. I know we've had our differences, but today we come to lend you our aid!"},{"name":"THEOMOCENT","text":"H-He's so full of rage, he can scarce hear a word I say! Please, <span class=\"highlight\">Forename</span>, perhaps you can try <span class=\"highlight\">soothing</span> him."},{"name":"LEBRASSOIR","text":"Didn't he tell you to leave!? Now look what you've done! My bruises won't heal for weeks..."},{"name":"THEOMOCENT","text":"&lt;sigh&gt; Nothing I say will reach him. But you─no doubt your <span class=\"highlight\">soothing</span> presence and words will succeed where mine have failed."},{"name":"ARCHOMBADIN","text":"To think that you would resort to such treachery to secure Theomocent's place as the head of class. Hah! Enjoy your piddling triumph while you can. Rest assured that House Dzemael will see this debt repaid!"},{"name":"ARCHOMBADIN","text":"Bask in this small victory while you can, for this slight against House Dzemael shall not be forgotten or forgiven!"},{"name":"ARCHOMBADIN","text":"Hah! Don't make me laugh! You expect me to believe that <span class=\"emphasis\">you</span>─the two who would stand to gain the most from my expulsion─have not so much as <span class=\"emphasis\">seen</span> the nonsense that's been making the rounds in the dormitories!?"},{"name":"LEIGH","text":"“The Truth Revealed: Archombadin de Dzemael, A Kidnapper?” Trust me, were we to try and implicate you in a crime you didn't commit, we would have done a far more thorough job than this! "},{"name":"THEOMOCENT","text":"...Indeed. These writings simply make an appeal to emotion, with not a single piece of concrete evidence to support the accusation."},{"name":"ARCHOMBADIN","text":"F-Fine! Perhaps it wasn't you two after all! Still, you rest assured that when I get my hands on the commoner that did this, they'll rue the day they thought to meddle with the affairs of House Dzemael!"},{"name":"LEIGH","text":"...You best realize we <span class=\"emphasis\">commoners</span> are not the ones on trial here─you are. I suggest you watch your tongue, unless you would prefer to lose the only allies you seem to have these days."},{"name":"THEOMOCENT","text":"Do not lose heart, Archombadin. Together, we'll uncover the truth and see that this baseless petition against you is withdrawn!"},{"name":"ARCHOMBADIN","text":"Hah! Why would I need your help!? My innocence is beyond question, and the Fury Herself will see my good name restored!"},{"name":"THEOMOCENT","text":"I pray that She will... In the meantime, we too shall do our part."},{"name":"LEIGH","text":"Fury's sake, Theo! Leave it be. &lt;sigh&gt; That aside, where did these papers even come from? And why didn't we receive one?"},{"name":"LEBRASSOIR","text":"If I had to guess, perhaps they were given only to those most inclined to believe the accusations..."},{"name":"ARCHOMBADIN","text":"Foolishness at best! If anything, these letters will only give me the clues I need to identify the coward behind them! As a matter of fact, I believe I know precisely where to begin my search."},{"name":"THEOMOCENT","text":"Brilliant! We would be more than happy to assist you in the investigation. Where would you have us go?"},{"name":"ARCHOMBADIN","text":"And hand you the very knife you would put in my back? Do you think me daft!? If the petition is approved and I am expelled, that would put you right at the top of the class. How very <span class=\"emphasis\">convenient</span>!"},{"name":"THEOMOCENT","text":"Oh, Archombadin. Don't you see? It is not for awards or accolades that I study the scripture as I do."},{"name":"THEOMOCENT","text":"I seek only to follow in the footsteps of Father Choisseau. It was he who granted me the chance to achieve the grand vision he had for our realm, and bring relief to those in need of spiritual succor."},{"name":"THEOMOCENT","text":"“Of the Fury's love will all men receive, and by the balance of Her spear will all be set free.” I would share the wisdom of these words with all of Ishgard."},{"name":"ARCHOMBADIN","text":"Volume eleven of the <span class=\"emphasis\">Seventy-two Articles of Halonic Polity</span>... Hmph... What is it with commoners and their obsession with that overidealistic screed?"},{"name":"LEBRASSOIR","text":"Come, Archombadin. Let us not waste any further time entertaining the idle musings of the riffraff. Look, we can manage just fine without your help, but if you <span class=\"emphasis\">do</span> find anything─not that we expect you to─you'll report back to us if you know what's good for you. Understood?"},{"name":"LEIGH","text":"If I didn't know better, I'd almost say that sounded like a “thank-you.” Well, if there's nothing else to do here, I suppose we should set to work."},{"name":"THEOMOCENT","text":"An excellent idea, Leigh! Now...where do you propose we should start?"},{"name":"LEIGH","text":"...The Fury save us."}],"reward":{"gil":583,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67897]},"next":[67899]},"partials":[{"type":"npc","id":"1017897","obj":{"i":1017897,"n":"Theomocent","l":2337,"q":2}},{"type":"npc","id":"1017912","obj":{"i":1017912,"n":"Archombadin","l":2301,"q":1}},{"type":"npc","id":"1017909","obj":{"i":1017909,"n":"Saturnois","l":2301,"q":1}},{"type":"npc","id":"1017910","obj":{"i":1017910,"n":"Theomocent","l":2301,"q":1}},{"type":"npc","id":"1017911","obj":{"i":1017911,"n":"Leigh","l":2301,"q":1}},{"type":"npc","id":"1017913","obj":{"i":1017913,"n":"Lebrassoir","l":2301,"q":1}},{"type":"npc","id":"1017914","obj":{"i":1017914,"n":"Theomocent","l":2301,"q":2}},{"type":"npc","id":"1017915","obj":{"i":1017915,"n":"Leigh","l":2301,"q":2}},{"type":"npc","id":"1018296","obj":{"i":1018296,"n":"Leigh","l":2337,"q":1}},{"type":"npc","id":"1018297","obj":{"i":1018297,"n":"Crammevoix","l":2337,"q":1}},{"type":"npc","id":"1018298","obj":{"i":1018298,"n":"Blaisie","l":2337,"q":1}},{"type":"quest","id":"67897","obj":{"i":67897,"n":"The Student Body's Revenge","g":78,"l":"Ishgard","s":30}},{"type":"quest","id":"67899","obj":{"i":67899,"n":"Letters from No One","g":78,"l":"Ishgard","s":32}}]}