{"quest":{"name":"Fly Free, My Pretty","location":"The Rising Stones","id":67894,"patch":3.56,"sort":18,"icon":100617,"eventIcon":71201,"issuer":1018043,"target":1018046,"involved":[1012812,1013178,1013179,1018011,1018042,1018044,1018048,1018057,1018221,1018321,1018322,1018336,1018337,1018338,1018370],"genre":5,"journal":["Yda's eyes shine with rekindled determination.","After the briefest of discussions, the contingent for the Omega expedition is decided, with Cid and Nero providing the technical expertise, while you, Yugiri, Gosetsu, and─most unexpectedly─Yda supply the steel. Make your way to the northern bank of Silvertear Lake, where the <span class=\"emphasis\">Excelsior</span> is waiting, and inform Cid of your readiness to depart.","You arrive in Carteneau to find that Nero spoke the truth when he declared that you were not the only ones with designs on the slumbering relic. Challenged by a brutish Garlean soldier named Grynewaht, you are soon embroiled in a skirmish with imperial forces. Rather predictably, Nero abandons you without hesitation, employing a teleporter to travel deeper into the facility, and Cid duly pursues him, leaving you to see to the small matter of winning the battle.","With a helping hand from your favorite former tribunus, you eventually rout your adversaries, and press on into Omega's control room. There you find Cid and Nero hard at work priming the relic for action, but it is Yda who finally takes it upon herself to press the launch button. Even as Omega takes flight, you cannot help but wonder if you have made a terrible mistake...<br><br>Initially, all seems to be proceeding as planned, but just as you begin to breathe a little more easily, the signal emanating from the weapon falls silent, prompting Cid to reengage its stasis systems. Struggling to hide his concern, he immediately resolves to head for Gridania to find out what has become of Omega and its target.","After a journey spent contemplating all manner of apocalyptic eventualities, you are relieved to find Gridania exactly where you left it. Trouble Cid for his thoughts on what could have become of Omega.","Still baffled by the Allagan relic's sudden failure, Cid suggests a firsthand inspection. Perhaps the waiting Alphinaud knows something that might be of use to your investigation..."],"objectives":["Speak with Cid in Mor Dhona.","Speak with Cid.","Speak with Cid in Omega Control.","Speak with Cid at the airship landing in Gridania."],"dialogue":[{"name":"ALISAIE","text":"Truly, I had no idea Domans could be so loud. He and Yugiri could hardly be more different..."},{"name":"CID","text":"Oh, I think he's going to fit right in."},{"name":"YUGIRI","text":"Never did I think to hear Gosetsu's voice echo through these halls..."},{"name":"GOSETSU","text":"My blade shall carve a path through the Empire's ranks as a scythe fells stalks of wheat!"},{"name":"NERO","text":"The “Mark XIV Thermocoil Boilmaster”? Dear me... How risible must the previous thirteen iterations have been? I could design a more efficient water heater in the time it took that ill-conceived lump to become lukewarm."},{"name":"TATARU","text":"How dare he mock the Scions like that!? If I ever had to sew a set of traveling clothes for <span class=\"emphasis\">him</span>, I just might forget to take out the pins."},{"name":"ALPHINAUD","text":"Just the <span class=\"emphasis\">two</span> unexpected guests, then. Still, I suspect that each will prove useful in his own way."},{"name":"YDA","text":"So we have to wake Omega up, right? When do we start?"},{"name":"ALPHINAUD","text":"Yda, you... Are you sure that's...?"},{"name":"YDA","text":"I'm sure, yes. I won't lie and say I'm completely fine, but I'll feel a lot better if I'm doing something useful."},{"name":"ALISAIE","text":"Very well. I will remain here and continue coordinating our efforts with the Alliance. Alphinaud, mayhap you could return to Gridania and assist Y'shtola and Krile?"},{"name":"ALPHINAUD","text":"A fine suggestion."},{"name":"CID","text":"The rest of us will form the Carteneau expedition party. Nero and I will focus on rousing Omega, while <span class=\"highlight\">Forename</span>, Yda, and our Doman friends take care of security."},{"name":"CID","text":"The <span class=\"emphasis\">Excelsior</span> is by the lake just outside town. We'll leave as soon as everyone is ready."},{"name":"YUGIRI","text":"Gosetsu is an accomplished swordsman. Should it come to battle, he will prove a staunch ally. Would that I could say the same for Nero."},{"name":"GOSETSU","text":"...Will this contraption truly bear us through the skies!?"},{"name":"NERO","text":"Soon, Omega, soon...<br>I will see you rise again!"},{"name":"YDA","text":"I was a bit...lost for a while back there─but I'll be fine. Trust me."},{"name":"ALISAIE","text":"Go and save the realm, <span class=\"highlight\">Forename</span>. I have everything in hand here."},{"name":"TATARU","text":"I do hope you like your new outfit. It may just be my finest creation!"},{"name":"CID","text":"We haven't far to go─with any luck, we'll be in Carteneau before Gosetsu graces the deck with his dinner."},{"name":"CID","text":"Once there, however, we had best be on our guard. Given that Eline Roaille was still active when Omega was discovered, we can be sure that the Empire has long been aware of its existence. And if Nero deemed it the obvious solution to the threat posed by this new primal, it is not impossible that Garlemald might do the same."},{"name":"CID","text":"Have your weapons ready and your wits about you. Something tells me we're flying into a fight."},{"name":"GRYNEWAHT","text":"Surrender! We have you outnumbered!"},{"name":"YDA","text":"Wouldn't be the first time!"},{"name":"NERO","text":"Are you <span class=\"emphasis\">still</span> playing with those soldiers? &lt;sigh&gt; I <span class=\"emphasis\">suppose</span> I can lend you one of my toys─but only if you promise to give it back."},{"name":"NERO","text":"Behold! The <span class=\"emphasis\">Red Baron</span>! Now end this nonsense!"},{"name":"GRYNEWAHT","text":"What the─? No one told me they'd have magitek armor! Er...forward! For the Empire!"},{"name":"GOSETSU","text":"The honorless cur thinks to abandon his men? I shall see that he shares their fate! Pray attend to the rest of his minions!"},{"name":"CID","text":"I take it you're ready to make for the control room?"},{"name":"Q1","text":"Travel to Omega Control?"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"CID","text":"I'm not sure why we lost contact with Omega, but I mean to find out. Let's be on our way."},{"name":"Q2","text":"Travel to Gridania?"},{"name":"A2","text":"（★未使用／削除予定★）"},{"name":"A2","text":"（★未使用／削除予定★）"},{"name":"YUGIRI","text":"（★未使用／削除予定★）"},{"name":"GOSETSU","text":"（★未使用／削除予定★）"},{"name":"NERO","text":"（★未使用／削除予定★）"},{"name":"YDA","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"I came as soon as I heard the <span class=\"emphasis\">Excelsior</span> had been spotted on its approach..."},{"name":"CID","text":"One moment everything was functioning perfectly and the next it wasn't. It makes no sense. We need to see what happened for ourselves, and soon."}],"reward":{"gil":615,"items":[{"id":17627},{"id":17628}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67893]},"next":[67895]},"partials":[{"type":"npc","id":"1018043","obj":{"i":1018043,"n":"Yda","l":481,"q":1}},{"type":"npc","id":"1018046","obj":{"i":1018046,"n":"Cid","l":52,"q":3}},{"type":"npc","id":"1012812","obj":{"i":1012812,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1013178","obj":{"i":1013178,"n":"Alisaie","l":481,"q":2}},{"type":"npc","id":"1013179","obj":{"i":1013179,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1018011","obj":{"i":1018011,"n":"Nero Tol Scaeva","l":67,"q":1}},{"type":"npc","id":"1018042","obj":{"i":1018042,"n":"Cid","l":481,"q":2}},{"type":"npc","id":"1018044","obj":{"i":1018044,"n":"Cid","l":67,"q":1}},{"type":"npc","id":"1018048","obj":{"i":1018048,"n":"Alphinaud","l":52,"q":3}},{"type":"npc","id":"1018057","obj":{"i":1018057,"n":"Gosetsu","l":481,"q":1}},{"type":"npc","id":"1018221","obj":{"i":1018221,"n":"Yugiri","l":67,"q":1}},{"type":"npc","id":"1018321","obj":{"i":1018321,"n":"Yda","l":67,"q":1}},{"type":"npc","id":"1018322","obj":{"i":1018322,"n":"Gosetsu","l":67,"q":1}},{"type":"npc","id":"1018336","obj":{"i":1018336,"n":"Yugiri","l":481,"q":1}},{"type":"npc","id":"1018337","obj":{"i":1018337,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1018338","obj":{"i":1018338,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1018370","obj":{"i":1018370,"n":"Nero Tol Scaeva","l":481,"q":1}},{"type":"item","id":"17627","obj":{"i":17627,"n":"He Who Continues the Attack Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"17628","obj":{"i":17628,"n":"Imperial Will Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"67893","obj":{"i":67893,"n":"The Greater Obeisance","g":5,"l":"Gridania","s":17}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}}]}